{
  "modId": 10001.0,
  "modName": "Winterludes Arrowsmithing Mod",
  "summary": "Create and upgrade arrows in quivers of 50. If you have the perk, you can do the work. ",
  "descriptionHtml": "Smith and upgrade your own arrows\r\n\r\nSo you think that you\\'re a hot shot blacksmith because you can make Daedric, Ebony, and Glass  weapons an armor that puts Eorland Grey-Mane to shame... but what\\'s that? You can\\'t sharpen an arrow, much less make one for yourself? \r\n\r\nAnd for all those archers out there: who actually bothers using Orchish and Elven arrows when Ebony arrows can be purchased from every blacksmith? \r\n\r\nThis mod hopes to rectify the situation. Provided that you have the smithing perk, you can craft arrows in quivers of 50 at the forge. Further, at the forge, you can sharpen them to \\\"legendary\\\" status by doubling their damage. Now you can make legendary Deadric arrows with a damage of 48 provided that you have the right crafting ingredients. Oh, no feathers required. \r\n\r\nArrows that you can craft at the forge are Iron, Steel, Dwarven, Elven, Orchish, Ebony, Daedric and Dragon Bone. They can all be improved to double their damage. Iron can be improved into Nord Hero arrows with the Arcane Smithing perk. How many points you have in smithing doesn\\'t matter; only if you have the perk. So Archers just beginning to climb the smithing skill tree can still benefit from using Steel, Dwarven and Orchish arrows of legendary status.\r\n\r\nEnjoy!\r\n\r\n\r\nChanges included in version 1: \r\n\r\nRemoved Nord Hero Legendary Arrow forging--these were just too powerful for the price\r\n\r\nRemoved directly creating Nord Hero arrows at the forge from scratch\r\n\r\nAdded Iron Arrow enhancing --Now they can be upgraded to (regular) Nord Hero arrows at the forge with an iron ingot and the Arcane Smithing Perk\r\n\r\nNow when you pick up any type of Legendary arrows, the proper name is displayed on the stray arrows\r\n\r\nAdded Dragon Bone Arrow and Dragon Bone Legendary Arrow forging. They are slightly stronger than Daedric Arrows and more valuable because of the cost of Dragon Bones. I wanted to do something useful with all the Dragon Bones and scales my character has accumulating, and adding a Dragon Bone arrow to this mod made sense. I guess, officially, Dragon Bones and scales are more rare than Daedra Hearts since vendors don\\'t sell dragon parts (as far as I\\'ve seen). Also, I wanted to give people an alternative to the Nord Hero Legendary arrows that I removed in this version. Those Nord Hero Arrows were just too cheap and powerful and accessible, requiring a low Smithing Perk, so I regretted making them soon after I uploaded version 1. The reason I\\'ve gone with crafting batches of 50 arrows across the board as opposed to 20 is due to the cost of materials. Generally, final products should be more valuable than the raw materials, but Bathesda prices arrows quite cheaply. Daedric Arrows, for example, cost only 8 gold each. Since Daedric crafting requires at minimum, 1 Daedra Heart (250 gold), and 1 ebony Ingot (150 gold), before adding a second Ingot and firewood, the minimum raw materials for the arrows already is valued at 50 arrows (8 gold x 50 arrows = 400 gold = 1 Daedra Heart + 1 Ebony Ingot). Well, I suppose this explains why vendors don\\'t sell Daedric arrows. As such, I\\'ve made Dragon Bone Arrows a bit more expensive and powerful since a single dragon bone is already valued at 500 gold. Dragon scales are used for sharpening the Dragon Bone Arrows. If you don\\'t like that I\\'ve included this \\\"new\\\" arrow, just don\\'t use them. Dragon Armor Smithing Perk required.\r\n\r\n\r\n",
  "categoryId": "55",
  "version": "1.1",
  "author": "Winterlude",
  "createdUnix": "1329439614",
  "updatedUnix": "1329688678",
  "containsAdultContent": false,
  "uploadedBy": "winterlude",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32322",
      "name": "Winterludes Arrowsmithing Mod",
      "version": "1.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "2",
      "fileName": "Winterludes Arrowsmithing Mod-10001.rar",
      "uploadedUnix": "1329439960",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d89bf22bbe4adb3a42dcfaa447da9750251c20dead8e594340ca7d08b94d2f55/analysis/1406688649/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Winterludes%20Arrowsmithing%20Mod-10001.rar?fid=32322&ttl=1535770052&ri=8192&rs=8192&setec=1c4795cbe8f5cfcf9a5fe5ffdfdc4a49"
    },
    {
      "fileId": "33872",
      "name": "Winterludes Arrowsmithing Mod update 1",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "2",
      "fileName": "Winterludes Arrowsmithing Mod update 1-10001-1-1.rar",
      "uploadedUnix": "1329688678",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5a78ef3ce9e1d3e280ccf6348d6bf581621c5c4ecc68fb8ab0493da90ed10005/analysis/1406696703/",
      "changelogHtml": " Removed Nord Hero Legendary Arrow forging--these were just too powerful for the price <br/> \n Removed directly creating Nord Hero arrows at the forge from scratch <br/> \n Added Iron Arrow enhancing --Now they can be upgraded to (regular) Nord Hero arrows at the forge with an iron ingot and the Arcane Smithing Perk <br/> \n Now when you pick up any type of Legendary arrows, the proper name is displayed on the stray arrows <br/> \n Added Dragon Bone Arrows and Dragon Bone Legendary Arrow forging. They are slightly stronger than Daedric Arrows and more valueable because of the cost of dragon bones. If you don\\'t like them, just don\\'t use them. Dragon Armor Smithing Perk required <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Winterludes%20Arrowsmithing%20Mod%20update%201-10001-1-1.rar?fid=33872&ttl=1535770053&ri=8192&rs=8192&setec=2a43279dc0f1ce3fbcea4f8659465657"
    }
  ]
}