{
  "modId": 10016.0,
  "modName": "Roadside Ruins Retreat",
  "summary": "The ruins near Falkreath are now a player home. ",
  "descriptionHtml": "Are you the outdoorsy type? Yearn to hear the crickets chirping as you\\'re dropping off to sleep? Then Roadside Ruins Retreat just might be for you. Live in a cozy, exterior Nordic ruin, located northwest of Falkreath, in the Falkreath Hold. If you\\'ve never discovered the location yet in the game then the map marker is visible, but you\\'ll have to travel to it on foot first to discover it.\r\n\r\nOF NOTE: Roadside Ruins was a clearable location, part of the radiant quests for the Companions but it should not be after activating this mod. If you don\\'t want that, then please, don\\'t use this mod. If, after activating, anyone still gets it as a quest objective for Trouble in Skyrim from one of the Companions then let me know. \r\n\r\nThe ruins are suitable for two. One of the bedrolls is player owned so it will give you a rested bonus after sleeping in it. There\\'s some minor loot scattered about the place. None of it will respawn after you take it. All the smithing stations are present at this location, plus a wood chopping block and a cooking pot. \r\n\r\nI haven\\'t been a big fan of the alchemy lab and arcane enchanter. The alchemy lab isn\\'t too bad but the enchanter just looked kind of hokey to me. In place of these, I\\'ve placed on a table, an apothecary\\'s satchel and a greater soul gem that do the same job. When you activate them, the appropriate crafting menu comes up and you can mix potions and enchant weapons to your heart\\'s content. There are no animations to go with these two actions. \r\n\r\nThere are plenty of empty containers (including crates) about the place. None of them should respawn. The only items that will respawn here are the hanging food items by the dresser. There are some herbs and garlic, plus rabbits, a pheasant, and a few salmon. \r\n\r\nInstallation:\r\nUnpack the zip file to your computer, then drag the rrcamp.esp file into your Skyrim Data folder. Make sure it\\'s activated on your next start up. \r\n \r\nEnjoy the place and please, let me know if there\\'s anything amiss. I\\'ll always do my best to fix things. ",
  "categoryId": "67",
  "version": "1.0",
  "author": "mellowtraumatic",
  "createdUnix": "1329444541",
  "updatedUnix": "1329444617",
  "containsAdultContent": false,
  "uploadedBy": "mellowtraumatic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32352",
      "name": "Roadside Ruins Retreat",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "110",
      "fileName": "Roadside Ruins Retreat-10016-1-0.rar",
      "uploadedUnix": "1329444617",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/362d18f9f3bc4bb022f4aca6237339ec9eecbc10a75fdf3273af4c80dbfd3abb/analysis/1406688679/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Roadside%20Ruins%20Retreat-10016-1-0.rar?fid=32352&ttl=1535770079&ri=8192&rs=8192&setec=37fe3915f6b699de1f79123e945dba7b"
    }
  ]
}