{
  "modId": 10018.0,
  "modName": "Frost Dragon Grove",
  "summary": "A cave that goes into a mountain and comes out at a snowy volcanic grove.",
  "descriptionHtml": "*UPDATE: The video is very out of date, anyone is welcome to make a video of it and send me the link and/or upload images of the mod. There is a new area to the left as you walk in with giants and a waterfall and the file is available for download now.*\r\n\r\n- I am aware that the npcs will act strangely when trying to move to certain places. It is because the navmesh is made terribly because for now I\\'m just concentrating on making the landscape.\r\n\r\n- I also had to change the weather for the one I uploaded to get rid of the snow storms. While the snowstorms look great they don\\'t work with the cave. I\\'m going to see if I can work around this or I may have to move the cave to a different worldspace.\r\n\r\n- Please comment, any suggestions or criticisms are welcome.\r\n\r\n- Also please endorse/vote if you enjoy as it gives me confidence to work more on it.\r\n\r\nThis mod is very early in development at the moment. Will be adding quests, items etc.. Also in future releases i will expand the land among many other things depending on how much time I have and how much popularity it gets.\r\n\r\nThis release is mainly concentrated on the look of the outside landscape. The beginning cave isn\\'t made yet and the cave inside the grove is unfinished.\r\n\r\nAnyway its a new land hidden in the mountains. With snow, dragons and a huge cave. \r\nPlease endorse and vote if you like!.\r\n\r\nI\\'d advise probably not saving while using the mod. It\\'s very untested. Something may not happen but I am unsure. So save at your own risk.\r\n\r\nInstall:\r\nEasiest way is using nexus mod manager. Download, install and open the mod with that.\r\n\r\nThe location of the cave entrance (will soon be a full cave) that leads to the grove is north of Riften to the right of Tolvad\\'s cave.\r\n[img]http://static.skyrim.nexusmods.com/downloads/images/10018-1-1329494699.jpg[/img]\r\nThere is a video if you can\\'t find it.\r\n\r\nPlease feel free to add any suggestions or whatever you want.\r\nEnjoy.",
  "categoryId": "30",
  "version": "0.2",
  "author": "FieryTigerWolf",
  "createdUnix": "1329445005",
  "updatedUnix": "1340795760",
  "containsAdultContent": false,
  "uploadedBy": "fierytigerwolf",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70567",
      "name": "Frost Dragon Grove Main",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "436",
      "fileName": "Frost Dragon Grove Main-10018-0-2.rar",
      "uploadedUnix": "1340795760",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/e57c5d8777aa48c39809bda95326100199beef1497fc8fdeea1a75190272ab8d/analysis/1406985724/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Frost%20Dragon%20Grove%20Main-10018-0-2.rar?fid=70567&ttl=1535770082&ri=8192&rs=8192&setec=74c3cfec0b2b5e88b7fa5dca3f966bad"
    }
  ]
}