{
  "modId": 10022.0,
  "modName": "Playable Snow Elves",
  "summary": "The Falmer of today are descendants of a once mighty empire before the Nords drove them into hiding with the Dwemer. However the Dwemer turned against them, enslaved them using drugs to blind them and turn them into mindless thralls. However a few escaped and went into hiding else where, in deep underground caves or high in the mountains. They have",
  "descriptionHtml": "The Falmer of today are descendants of a once mighty empire before the Nords drove them into hiding with the Dwemer. However the Dwemer turned against them, enslaved them using drugs to blind them and turn them into mindless thralls. However a few escaped and went into hiding else where, in deep underground caves or high in the mountains. They have skin crusted with ice rendering them all but immune to frost, they posses a gilded tongue and potent magic.\r\n\r\nFurther reading on the history of the Falmer (note: this is all true)\r\n\r\nhttp://www.uesp.net/wiki/Lore:Falmer\r\nhttp://elderscrolls.wikia.com/wiki/Snow_Elf\r\n\r\nRacial Stats:\r\n+10 Speech \r\n+10 Illusion\r\n+5 Conjuration\r\n+5 Destruction\r\n+5 Alchemy\r\nTotal: 35\r\n\r\nThe Calm of Snow ability is a simple rename of The Voice Of The Emperor ability, later I will change it so that it will increase NPC disposition and decrease aggression, then it will add a calm ability just long enough for the game to recalculate weather to make the NPCs attack again.\r\n\r\nThen the Frosted Skin ability gives you\r\n+80% Frost Resistance\r\n+25% Disease Resistance\r\n+5% Damage Resistance\r\n+30% Shock Weakness\r\n+50% Fire Weakness\r\n---\r\n\r\nSo far i have just edited some values, added descriptions, and made a new ability (Frosted Skin) soon i will make a new mesh for my snow elves and create the Calm Of The Snow ability. Furthermore i eventually plan to add some dialogue for NPCs (like ya know how guards will comment on your race) Probably along the lines of “W-W-What are you?” or “Damn Elves painting their own skin blue”\r\n\r\nP.S. This is a simple rough description until i can get home from school and make a better one. Also my name anywhere else is 18scsc, its just 18scsc2 here because i forgot my old password :(\r\n\r\n----\r\n\r\nIf there is any bugs let me know via the comment section",
  "categoryId": "34",
  "version": "1.3",
  "author": "18scsc",
  "createdUnix": "1329447721",
  "updatedUnix": "1329452039",
  "containsAdultContent": false,
  "uploadedBy": "18scsc2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32386",
      "name": "Snowelf18scsc esp",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Snowelf18scsc esp-10022-1-3.zip",
      "uploadedUnix": "1329452039",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/c6e3b7b9fef7e4eb24fbd007bf5bed8a61ff959e4ae280f4c65703d5787e673e/analysis/1406688962/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Snowelf18scsc%20esp-10022-1-3.zip?fid=32386&ttl=1535770088&ri=8192&rs=8192&setec=937d8172569883af84d0890b5b62123b"
    }
  ]
}