{
  "modId": 10038.0,
  "modName": "Ebony Dagger of Mephala",
  "summary": "Changes Mephala\\'s Ebony Blade from a katana to a dagger",
  "descriptionHtml": "I personally never liked the two-handed Ebony Blade as presented in game for various reasons. It was buggy and used one-handed perks, enchantments, and sounds. The name was just far too generic to even identify it as a Daedric Artifact. And most importantly, playing an amoral throat-slitting shadow-warrior made a bulky two-handed weapon impractical, especially given the requirements to improve it!\r\n\r\nSo, I made a few changes.\r\n\r\nThe Ebony Blade is now called Ebony Blade of Mephala (matching with Mehrune\\'s Razor, Mace of Molag Bal, Azura\\'s Star, etc.). Most importantly, it has been changed into a dagger! This is personal taste. A Daedric Prince of secret murder should have an artifact weapon suited to that purpose! Charging someone with an Akaviri greatsword isn\\'t exactly subtle.\r\n\r\n[b][u]INSTALLATION:[/u][/b]\r\n\r\nNothing fancy, just plug in the esp. I used the standard Ebony Dagger model. It was the only thing that felt appropriate.\r\n\r\n[b][u]POSSIBLE CONFLICTS:[/u][/b]\r\n\r\nIf you use any of the several mods that make corrections to the weapons/items in the game, then this should definitely go AFTER those mods. As stated above, the original Ebony Blade suffered several problems that people have fixed. I have added the smithy information and you can upgrade the Ebony Blade of Mephala at the grindstone, so don\\'t worry about losing out on the biggest fix.\r\n\r\n[u][b]NOTE:[/b][/u]\r\nWith the new 1.4.26 Patch, the load order system for the game has changed. If it appears that the mod isn\\'t having any effect at all, check the plugins.txt file and move the mod down to the bottom of the list. [url=\\\"http://forums.nexusmods.com/index.php?showtopic=583662&st=0\\\"]More information can be found here.[/url]\r\n\r\n[u][b]CHANGELOG:[/b][/u]\r\n\r\nv1.1 - It was pointed out in the comments that the absorb health enchantment was not correctly applied to the weapon. I have adjusted this and tested. The enchantment is now properly applied.",
  "categoryId": "55",
  "version": "1.1",
  "author": "ClancyDamon",
  "createdUnix": "1329455623",
  "updatedUnix": "1330289904",
  "containsAdultContent": false,
  "uploadedBy": "ClancyDamon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "37277",
      "name": "Ebony Dagger of Mephala",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Ebony Dagger of Mephala-10038-1-1.rar",
      "uploadedUnix": "1330289904",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/db846f657f0b057130d9f91e122943985bfe9498974bc31f91b1fcb55544eff9/analysis/1406715609/",
      "changelogHtml": " It was pointed out in the comments that the absorb health enchantment was not correctly applied to the weapon. I have adjusted this and tested. The enchantment is now properly applied. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ebony%20Dagger%20of%20Mephala-10038-1-1.rar?fid=37277&ttl=1535770132&ri=8192&rs=8192&setec=8c7aff7d06e08f6a7920306a1ef89180"
    }
  ]
}