{
  "modId": 10045.0,
  "modName": "Craftable and moveable alchemy and crafting containers",
  "summary": "Need more storage containers, lots of them, in an cottage out in the wood? Need to store alchemy ingredients or crafting materials with two clicks?",
  "descriptionHtml": "Need more storage containers, lots of them, in an cottage out in the wood. Need to store alchemy ingredients or crafting materials with two clicks?\r\nYes you can get everything in the picture.\r\n\r\nThis craftable and moveable containers solves this problem. \r\nCraftable under mish, satchel is craftable under studded.\r\n\r\nInclude pot, satchel, barrel, chest, upper class chest, end table, upper class end table, strong box and the huge dwenwer chest. \r\n\r\nTo place drop on ground, activate it and it will behave a bit strange so just drag it where you want and activate again and it\\'s useable. You see mouseover change from pick up to open and it\\'s ready for use. If you open it you get an menu, open, pick up moves it together with it\\'s content to your inventory. Store ingredients moves all alchemy ingredients from your inventory to the satchel, store crafting materials do it same for it and it\\'s everything you can use on an crafting station. \r\n\r\nSneak changes behavior so you will open it as an normal container next time, you can still access the menu if you are in sneak mode where you can change it back. \r\nThis is nice if you use it as an normal container, this mode can be set for each satchel so you can have one for ingredients and one for potions. This let you take all and return it with store ingredients.\r\n\r\nMovement menu let you fine adjust position, you can move items in all directions in step of 10cm, movement down stops and returns you to main menu as it\\'s easy to move items below ground, the satchel can not be moved downward as it will end up under ground at first move.\r\nGo into sneak and activate to stop the movement.\r\n\r\nTested so it\\'s safe and does no disappear or lose inventory after 10 days. You can order Lydia or other followers to take all in it.\r\n\r\n3d model in inventory is an book, for the pot, satchel and end tables.\r\nThe chests uses in bar of iron ore, placeholder is resized to match the final container.\r\n\r\nPlaceholders will be replaced with real models if somebody tells me how to make movable mish items out of static ones. \r\n",
  "categoryId": "27",
  "version": "2",
  "author": "Zaria",
  "createdUnix": "1329459335",
  "updatedUnix": "1330605271",
  "containsAdultContent": false,
  "uploadedBy": "magnemoe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32457",
      "name": "Craftable and moveable satchel",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "Craftable and moveable satchel-10045.zip",
      "uploadedUnix": "1329459538",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/9a8bb971b0c12512a2629e395e8cbf3d517249b995a18315ef7b481d3390fe8b/analysis/1406689324/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20and%20moveable%20satchel-10045.zip?fid=32457&ttl=1535770141&ri=8192&rs=8192&setec=c7f7258ff8c98c48d07a0e6c7f77db2a"
    },
    {
      "fileId": "38821",
      "name": "Moveable and craftable containers",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22",
      "fileName": "Moveable and craftable containers-10045-2.zip",
      "uploadedUnix": "1330605271",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/f3d0465b1d963fba59bf5cb7516f42bdab161c605a00f0783bc3c630874e088a/analysis/1406723177/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Moveable%20and%20craftable%20containers-10045-2.zip?fid=38821&ttl=1535770141&ri=8192&rs=8192&setec=4f39a3101f897a2be7442acd8c5c9db8"
    }
  ]
}