{
  "modId": 10058.0,
  "modName": "Skyrim Balancing Mod - German",
  "summary": "Komplett-Balancing von Preisen, Gewichten und einige andere Verbesserungen.\r\nDawnguard, Dragonborne und HearthfiresBalancing! (eigene ESP\\'s)\r\nUnbegrenzt Ringe und Amulette includiert! (eigene ESP\\'s)\r\n\r\nGERMAN VERSION !!",
  "descriptionHtml": "Version:    3.2\r\nSprache:    DV\r\nDateigröße:    ca. 3.9 MB (gezippt)\r\nAbhängigkeiten:   neuester Skyrim-Patch\r\n\r\n\r\nDOWNLOAD VIA MIRROR !!!\r\n============================\r\n\r\n\r\n\r\nDieses Balancing-Plugin ist ursprünglich entstanden, um sämtliche Gewichtswerte in Skyrim zu verringern. Mittlerweile umfasst dieses Plugin ebenfalls ein ausgewogenes Preisbalancing, berichtigte und verbesserte Waffenwerte, verbesserte Speisen (Heilungswert), Namenskorrekturen und vieles mehr.\r\n\r\nWas das Balancing der Preise betrifft, so habe ich versucht, dabei sehr vorsichtig vorzugehen, und für Werte die erhöht werden mussten (z. B. verzauberte Waffen gegenüber nicht verzauberten) habe ich andere wiederum verringert, damit die Gesamtbalance möglichst der ursprünglichen Balance des Spieles entspricht.\r\n\r\nDas Plugin ist nun seit Version 2.0 an \\\"Skyrim Directors Cut\\\" angepasst, was bedeutet, dass sie idealerweise zusammen mit SDC und den zugehörigen Komponenten verwendet werden sollte.\r\n\r\nWeiters gibt es verbesserte Texturen: für den Fliegenpilz, einige im Original vorhandene Speisen und neue Suppen. Kürbisse und Muscheln können nun ebenfalls für die Zubereitung von Speisen verwendet werden. \r\n\r\n\r\n\r\nZusätzliche Inhalte:\r\n-----------------------------\r\nBalancing für Dawnguard!\r\nBalancing für Hearthfire!\r\nBalancing für Dragonborn!\r\nAlternative ESP\\'s mit neuem Inhalt: unlimitierte Amulette und Ringe!\t\r\n(auch für Dawnguard und Dragonborn) \r\n\r\n\r\n Hier die Änderungen im Detail:\r\n=============================\r\n\r\n\r\nRüstungen, Bekleidung und Schmuck:\r\n===================================\r\n\r\n- Schwerere Rüstungsteile, Bekleidung Schmuck etc. - Gewicht verringert und bestmöglich aufeinander abgestimmt (z. B. Ringe 0,2, Amulette 0,4 etc.)\r\n- Verzauberte Rüstungen sind nun mehr Wert als nicht verzauberte und je nach Stärke des Zaubers preislich gestaffelt\r\n- Kapuzenroben und Kapuzen können nun mit Diademen kombiniert werden\r\n- Roben der Graubärte sind nun spielbar\r\n- Roben der Graubärte in verzauberter Version für euren \\\"Char\\\" samt Begleiter je 3 x in Hochrothgar verteilt\r\n- Bisher nicht spielbare Rüstungen sind nun spielbar (Daedrische Rüstung...)\r\n- Fehler bei Slotzuordnungen von Rüstungen etc., die ich für das Balancing ändern musste, berichtigt (entsprechend SDC)\r\n- Um die Balance zu bewahren, mußte ich zuvor sehr teure Rüstungen preislich ein wenig herabsetzen, jedoch sind sie immer noch verhältnismäßig teurer\r\n- Zwerge in Dwemer umbenannt\r\n- Schuhe und Handschuhe der Abgeschworenen-Rüstungen - Slots berichtigt, sodass sie nun am Körper besser angepasst sein dürften\r\n\r\nRoben der Graubärte: \r\n-------------------------------\r\nDa mir diese Roben außerordentlich gut gefallen, man aber die Graubärte ja nicht unbedingt töten will, um möglichst früh in den Besitz einer solchen zu gelangen, habe ich nun Robe, Kapuze und Schuhe je 3 mal in Hochrothgar verteilt. Ihr könnt sie ab einem bestimmten Fortschritt in der Hauptquest einfach an euch nehmen.\r\nKapuze und Robe sind je mit einem speziellen, auf das Wirken der Graubärte abgestimmten Zauber versehen.\r\n\r\n\r\n\r\nWaffen und Pfeile etc.:\r\n======================\r\n\r\n- Gewicht schwererer Waffen verringert und alle Waffen in einem reellen Verhältnis zueinander abgestimmt\r\n- Verzauberte Waffen sind nun mehr wert als nicht verzauberte und je nach Stärke des Zaubers preislich gestaffelt\r\n- Verzauberungswerte (Anzahl der Benutzungen) von Waffen und Zauberstäben berichtigt, wo diese nicht korrekt waren bzw. bei folgenden Stäben ein wenig verstärkt: Stab der Heilenden Hand, Stab der Flammenwand, Stab der Sturmwand \r\n- Zauberstäbe sind nun generell ein wenig mehr wert\r\n- Fehlerhafte Preise sind nun berichtigt (z. B. Dwemerbogen)\r\n- Um die Gesamt-Balance bestmöglichst zu bewahren, habe ich sehr teure Waffen preislich ein wenig herabgesetzt\r\n- Zwerge in Dwemer umbenannt; \r\n\r\n\r\n\r\nTränke, Ingredentien und Nahrungsmittel:\r\n========================================\r\n\r\n- Gewichte von Ingredentien ebenfalls teilweise verringert\r\n- Alle Ingredentien haben nun den Mindestwert von 2 Goldmünzen\r\n- Salz und Knoblauch (in der letzten Version war es nur Salz) kommen nun häufiger vor, da beide Zutaten zum Kochen von Speisen als auch für Alchemie eingesetzt werden\r\n- Weizen- und Lauchvorkommen ein wenig erhöht (jedoch mit geringstmöglichem Eingriff in bestehende Behälter)\r\n- Heiltränke (0,50 Gewicht) auf ein Gewicht von 0,25 und Gifte auf 0,20 herabgesetzt\r\n- Selbst erstellte Heiltränke haben nun ebenfalls ein geringeres Gewicht, entsprechend der im Game vorhandenen\r\n- Alle Fleischsorten haben nun im gekochten Zustand den doppelten Heilwert (gegenüber dem Rohzustand).\r\n- Heilungswerte mancher Speisen erhöht! Bsp: Mammutbraten: 24 (Roh 12); Rind gekocht 20 (Roh 10), gewürzter Braten 22; Pferdehüfte gebraten 18 - roh 9; Horkerfleisch gebraten 16 - roh 9, Lachs, Schlachterfisch, Muscheln... ebenfalls ein wenig verbessert, usw.\r\nDa gerade in den ersten Stufen oft Unmengen an Heiltränken gebraucht werden, habe ich versucht, auf diese Art etwas Abhilfe zu schaffen!!!!\r\n- Karotten, Kartoffeln, Lauch, und Kürbis können ab sofort ebenfalls bei Händlern für 1 Goldmünze verkauft werden\r\n- Gourd in Kürbis umbenannt!\r\n- Rohe und gebratene oder gekochte Speisen sind nun eindeutiger benannt\r\n- Suppen und Eintöpfe im Spiel hatten vorher alle dieselbe Textur, nun haben sie individuelle Texturen (geringe Datengröße)\r\n- 6 neue Suppen hinzugefügt (Kürbisse und Muscheln sind nun auch ein wenig besser integriert): Kürbiscremesuppe, Karottencremesuppe, Käse-Lauch-Suppe, Kräutersuppe, Muschelsuppe, Tomatemcremesuppe\r\n- Fliegenpilze: neue Texturen\r\n\r\n\r\nNeue Speisen:\r\n--------------------\r\nDa Lebensmittel wie Muscheln und Kürbis überhaupt nicht wirklich richtig zum Einsatz kamen, habe ich mich dazu entschlossen, ein paar zusätzliche Speisen zu machen. Die Meshes sind aus dem Original-Spiel, die Texturen sind jedoch allesamt neu von mir gemacht. Ich habe mich zwar zurückgehalten, damit ich Skyrim nicht mit unendlich vielen Suppenvariationen überschwemme, jedoch konnte ich mir z. B. eine entsprechende Variante zur rituellen Neunkräutersuppe nicht verkneifen.\r\n\r\n\r\n\r\nDiverse Gegenstände, Bücher usw.:\r\n=================================\r\n\r\n- Bei diverse Tagebüchern und ähnlichem habe ich das Gewicht auf 0,5 gesetzt, vorher hatten sie ein Gewicht von 1; \r\n- Texte solcher veränderten Bücher wurden inhaltlich komplett an SDC angepasst\r\n- Beschädigte Bücher haben nun keinen Wert mehr, da es mir nicht logisch erschien, dass sie teilweise mehr Wert sein sollen als ein Buch mit Inhalt\r\n- Schwere Gegenstände und solche, die sich im Inventar gerne sammeln, sind nun leichter: z. B. Leder 0.5, Bärenpelz 2.5, \r\n      alle Erze 0.5; daraus hergestellte Barren wiegen nun ebenfalls minimal weniger;\r\n- Die Preise von Barren und Erzen sind nun so balanciert, dass 2 Stück Erz weniger kosten als 1 daraus hergestellter Barren;\r\n- Zwerge in Dwemer umbenannt (auch Buchinhalte etc.); Malachit in Vulkanglas...\r\n- Änderungen wie \\\"Korund\\\" statt \\\"Corundrum\\\" usw. aus SDC übernommen\r\n- Pelz des Schneesäbelzahntigers richtig benannt!\r\n\r\n\r\n\r\nZwerge in Dwemer umbenannt:\r\n=============================\r\n\r\nEs sind davon alle!!! Inhalte davon betroffen bei denen ich auch Gewichte, Preise etc. wegen des Balancings verändert habe - Waffen, Rüstungen, Bücher und teilweise auch Buchtexte. Für ein inhaltlich passendes und abgestimmtes Spiel empfehle ich zu meinem Plugin die \\\"Zwerge zu Dwemer\\\"-Strings von Skyrim Director\\'s Cut zu verwenden.\r\n\r\nMalachit zu Vulkanglas:\r\n=====================\r\n\r\nDie \\\"Malachit zu Vulkanglas.esp\\\" von SDC benötigt ihr mit meiner Balancing-Mod nicht mehr, da alle Inhalte integriert sind. \r\n\r\n\r\n\r\nÄnderungen in Version 3.2:\r\n=========================\r\n\r\nÄnderungen in der Balancing-Mod 3.2 und den entsprechenden DLC-Versionen:\r\n- Anpassungen an SDC 3.2 (in allen Balancing-Modulen)\r\n- Gewichte der Zauberrollen reduziert (in allen Balancing-Modulen)\r\n- Preise und Gewichte einiger Gegenstände überarbeitet und als Händlerware deklariert (vor allem in der Haupt-ESP)\r\n- Weitere Feinabstimmung (Rüstungen, Waffen etc. bezüglich Preis, Gewicht (in allen Balancing-Modulen)\r\n- In der Variante mit den unlimitierten Amuletten und Ringen einige wenige Amulette als einzeln tragbar eingetragen: Amulett von Talos, Kynareth, Mara, Stendarr etc.; Das bedeutet, dass zwar andere zusätzliche Amulette getragen, aber diese den einzelnen Göttern geweihten nicht miteinander kombiniert werden können, um so eine kleine Einschränkung zu haben. Mir war es auch wichtig, einige der Amulette auch sichtbar tragen zu können, da ich sie sehr schön finde.\r\n- Die Ringe habe ich vorerst so belassen.\r\n\r\nAlle Änderungen in den einzelnen Versionen findet ihr im Readme als auch auf meiner Homepage aufgelistet.\r\n\r\n\r\n\r\n\r\nInstallation:\r\n=========== \r\n\r\n- Die gezippte Datei an einen externen Ort entzippen.\r\n- Esp in den Ordner: entsprechendes Laufwerk \r\n(...meistens C)/Programme/Steam/SteamApps/common/skyrim/Data kopieren\r\n- Esp im Skyrim-Launcher aktivieren\r\n\r\n\r\n\r\nLadereihenfolge:\r\n================\r\n\r\nIn Kombination mit der Mod \\\"Skyrim Directors Cut\\\" sollte auf folgende Ladereihenfolge geachtet werden:\r\n\r\n- Strings \\\"Zwerge zu Dwemer\\\" in den Stringsordner kopieren (Details dazu findet ihr in der Beschreibung von Skyrim Director\\'s Cut)\r\n- Skyrim - Director\\'s Cut.esp\r\n- Eindeutige Regionsnamen.esp\r\n- Unofficial Skyrim Patch.esp\r\n- Unofficial Dawnguard Patch.esp\r\n- Unofficial Hearthfire Patch.esp\r\n- Unofficial Dragonborn Patch.esp\r\n- LMBalancingDV.esp\r\n- LMBalancingDawnguardDV.esp\r\n- LMBalancingHearthfiresDV.esp\r\n- LMBalancingDragonbornDV.esp\r\n\r\n\r\n\r\nInkompatibilität:\r\n===============\r\nDieses Plugin ist mit allen Mods inkompatibel, die vor allem Gewichte, Preise und andere Eigenschaften von Rüstungen, Kleidung, Gegenständen, Schmuck, Büchern, Ingredentien, Tränken, Speisen, Waffen, Pfeilen usw. verändern! \r\n\r\n\r\n\r\nAnmerkung:\r\n===========\r\nSollten mir noch weitere kleine Verbesserungen in diesem Rahmen auffallen, wird es natürlich ein Update dieses Plugins geben. \r\nSollte jemand von euch Wünsche oder Ideen haben, die in dieses Plugin passen (generell alle Änderungen an Gegenständen im Game betreffend), so könnt ihr euch gerne an mich wenden.\r\n\r\nInhalte dieses Plugins dürfen nicht für kommerzielle Zwecke weiterverwendet werden!\r\n\r\n\r\n\r\nVerwendetes Tool: \r\n==================\r\n- Creation Kit\r\n- The Gimp\r\n\r\n\r\n\r\nDanksagung an:\r\n=============== \r\n- Bethesda für dieses wundervolle Spiel und das Creation Kit!\r\n- PlanB für seine Fixed German Strings ... und die Hilfe mit dem String Localizer!\r\n- Den Entwicklern von \\\"The Gimp\\\" für ihre unermüdliche Arbeit!\r\n- Mikal33 für die Pilztextur, die ich als Vorlage für meine Fliegenpilze verwendet habe!\r\n\r\n\r\n\r\n\r\nViel Spass mit dem Plugin\r\nLilaMue",
  "categoryId": "79",
  "version": "3.2",
  "author": "LilaMue",
  "createdUnix": "1329469532",
  "updatedUnix": "1329469532",
  "containsAdultContent": false,
  "uploadedBy": "LilaMue",
  "primaryFile": null,
  "files": []
}