{
  "modId": 10063.0,
  "modName": "Skyrim Balancing Mod II - German",
  "summary": "Gewichte herabgesetzt, diverse kleine Verbesserungen ...\r\nMehr Gold für Skyrim\\'s Händler\r\nONLY GERMAN VERSION !!",
  "descriptionHtml": "Version: 1.2\r\nSprache: DV\r\nDateigröße: ca. 180 KB (gezippt)\r\nAbhängigkeiten: -\r\n\r\n\r\nDOWNLOAD VIA MIRROR !!!\r\n============================\r\n\r\n\r\nDieses Plugin ist lediglich eine Kombination der Plugins \\\"Balancing Mod\\\" und der ersten Preis-Varianteder Mod \\\"Betuchtere Händler\\\", die ich in meinem eigenen Spiel verwende.\r\n\r\n\r\nHier die Änderungen im Detail:\r\n=============================\r\n\r\nGewicht: \r\n========\r\n- Gewichte von den schwereren Rüstungsteilen, Bekleidung und Schmuck verringert: Ringe 0,2, Amulette 0,4, Diademe 0,5\r\n- Heiltränke (0,50 Gewicht) auf ein Gewicht von 0,25 und Gifte auf 0,20 herabgesetzt\r\n- Das Gewicht der diversen Tagebücher und ähnlichem habe ich auf 0,5 gesetzt (vorher 1)\r\n- Schwere Gegenstände und solche, die sich im Inventar gerne sammeln, sind nun leichter: z. B. Leder 0,5, Bärenpelz 2,5, alle Erze 0,5 \r\n- Gewichte von Ingredentien teilweise verringert\r\n\r\nPreise: \r\n=======\r\n- Die Preise von Barren und Erzen sind nun so balanciert, dass 2 Stück Erz weniger kosten als 1 daraus hergestellter Barren\r\n- Beschädigte Bücher haben nun keinen Wert mehr, da es mir nicht logisch erschien, dass sie teilweise mehr wert sein sollen als ein Buch mit Inhalt.\r\n- Alle Ingredentien haben nun den Mindestwert von 2 Goldmünzen\r\n- Karotten, Kartoffeln, Lauch, und Gourd können ab sofort ebenfalls bei Händlern für 1 Goldmünze verkauft werden\r\n\r\nHeilung: \r\n========\r\n- Alle Fleischsorten haben nun im gekochten Zustand den doppelten Heilwert (gegenüber dem Rohzustand).\r\n- Heilungswerte mancher Speisen erhöht! Bsp: Mammutbraten: 20 (Roh 10), Rindfleisch gekocht 18 (Roh 9), Horkerfleisch gebraten 16 (Roh 8), usw.\r\nDa gerade in den ersten Stufen oft Unmengen an Heiltränken gebraucht werden, habe ich versucht, auf diese Art etwas Abhilfe zu schaffen.\r\n\r\nSonstiges: \r\n=========\r\n- Pelz des Schneesäbelzahntigers richtig benannt!\r\n- Malachit in Vulkanglas umbenannt!\r\n- Rohe und gebratene oder gekochte Speisen sind nun eindeutig benannt!\r\n- Roben der Graubärte sind nun spielbar, könnte allerdings sein, dass sie nur für einen männlichen Char tragbar sind!\r\n\r\nMehr Händlergold:\r\n==================\r\n- Alchemisten: 850 (vorher 500)\r\n- Zauberer: 750 (vorher 500)\r\n- Schmiede: 1500 (vorher 1000)\r\n- Allgemeine Händler: 1000 (vorher 750)\r\n\r\n\r\n\r\n\r\nNEU - Version 1.1 und 1.2:\r\n========================\r\n\r\nHändlergold:\r\n- Alchemisten: 900\r\n- Schmiede in z. B. Flußwald, Markarth Schloss, Schmied (verheiratet): 800 (vorher 500)\r\n- Schmiede, orkische: 550 (vorher 400)\r\n\r\nGewichte:\r\n- selbst erstellte Heiltränke haben nun auch das Gewicht von 0,2 bzw. 0,25 (der Wert von 0,25 wird im Game mit 0,3 angezeigt, aber als 0,25 berechnet)\r\n- weitere Feinabstimmung bei den Gewichten generell\r\n\r\nPreise:\r\n- verzauberte Waffen und Rüstungen sind nun mehr Wert als nicht verzauberte, je nach Stärke der Zauber gibt es ebenfalls eine kleine Preisabstufung\r\n- fehlerhafte Preise sind nun berichtigt (z. B. Dwemerbogen)\r\n- Zauberstäbe sind nun generell ein wenig mehr wert\r\n- um die Balance zu bewahren, mußte ich zuvor sehr teure Waffen und Rüstungen etwas herabsetzen, jedoch sind sie immer noch verhältnismäßig teurer\r\n\r\nFixes:\r\n- Gourd in Kürbis umbenannt!\r\n- Umbenennung der Zwerge in Dwemer: Waffen, Rüstungsteile, Bücher und deren Inhalte, etc. berichtigt!\r\n- Hühner legen nun regelmäßig Eier, außer im Winter\r\n- Stab des Donnerkeils: Fehler behoben, er hat nun die richtige Verzauberung!\r\n\r\nSonstiges:\r\n- Verzauberungswerte (Anzahl der Benutzungen) von Waffen und Zauberstäben berichtigt, wo diese nicht korrekt waren bzw. in wenigen Fällen verbessert!\r\n- Folgende Verzauberungen ein wenig verbessert: Sturmwand, Flammenwand und Heilende Hände (betreffen Zauberstäbe)\r\n- mittlerweile spielbare Robe der Graubärte (Robe, Kapuze und Schuhe) für euren Char und eventuelle Begleiter je 3 mal in Hochrothgar verteilt. Kapuze und Robe für den Spieler sind nun mit einer besonderen und meiner Meinung nach passenden Verzauberung versehen, jedoch nicht die originalen der Graubärte.\r\n- andere, bisher nicht spielbare Rüstungs- und Kleidungsteile spielbar gemacht: Daedrische Rüstung, Schattenrüstung...\r\n- die meisten Kapuzen sind nun zusammen mit Diademen tragbar!\r\n\r\n\r\n\r\n\r\nInstallation:\r\n=========== \r\n- Die gezippte Datei an einen externen Ort entzippen.\r\n- Esp in den Ordner: entsprechendes Laufwerk \r\n(...meistens C)/Programme/Steam/SteamApps/common/skyrim/Data kopieren\r\n- Esp im Skyrim-Launcher aktivieren\r\n\r\nVersion 1.1:  bitte einfach die letzte Version der \\\"ESP\\\" im Data-Ordner überschreiben\r\n\r\n\r\n\r\nAnmerkung: \r\n===========\r\nSollten mir noch weitere kleine Verbesserungen in diesem Rahmen einfallen, wird es natürlich ein Update dieses Plugins geben. Sollte jemand von euch Wünsche oder Ideen haben, die in dieses Plugin passen (Änderungen die oben genannten Bereiche betreffend), so könnt ihr euch gerne hier, auf \\\"Ei-der-Zeit\\\" oder im \\\"Scharesoft-Portal\\\" in Form einer PN an mich wenden.\r\n\r\nInhalte dieses Plugins dürfen nicht für kommerzielle Zwecke weiterverwendet werden!\r\n\r\n\r\n\r\nVerwendetes Tool: \r\n==================\r\n- Creation Kit\r\n\r\n\r\n\r\nDanksagung an:\r\n=============== \r\n- Bethesda für dieses wundervolle Spiel und das Creation Kit!\r\n- PlanB für seine Fixed German Strings ... hat die Arbeit im CK wesentlich angenehmer gemacht!\r\n\r\n\r\n\r\nViel Spass mit dem Plugin\r\nLilaMue ",
  "categoryId": "79",
  "version": "1.2",
  "author": "LilaMue",
  "createdUnix": "1329471528",
  "updatedUnix": "1329471528",
  "containsAdultContent": false,
  "uploadedBy": "LilaMue",
  "primaryFile": null,
  "files": []
}