{
  "modId": 10086.0,
  "modName": "Charmed Followers",
  "summary": "A spell that charms people into becoming recruitable followers.",
  "descriptionHtml": "Charmed Followers 0.1-dev\r\n\r\nCharms people into becoming recruitable followers.\r\n\r\nWARNING: This mod is very likely to break quests, destroy your game and really upset you. It ignores all gameplay rules and is likely to conflict with everything. YOU HAVE BEEN WARNED.\r\n\r\n(Now then....)\r\n\r\nThis mod gives you a lesser power named \\\"Charm Follower\\\". When cast on a character (touch-range), it will charm them into becoming a recruitable follower permanently. The spell is added at game start, you don\\'t need to buy it or retrieve it from somewhere.\r\n\r\nIf the spell was successful, the normal \\\"Follow me, I need your help\\\" option should appear when you talk to the character.\r\n\r\nThis mod tries to detect whether a character could become a follower through some other method (favours, quests etc) and will not change them into followers. This is a simplistic method to avoid breaking quests.\r\n\r\nThere is no way to undo the charm at the moment.\r\n\r\nHIGHLY RECOMMENDED MOD: The \\\"Additional Vanilla NPC Follower Voice Types\\\" mod:\r\nhttp://skyrim.nexusmods.com/mods/16266\r\n\r\nNot every character is compatible with this spell by default. The game supports only certain races and voice types as potential followers, and this mod doesn\\'t do anything to change that. Other races and voice types lack the recruitment dialogue necessary for follower support. The mod above will allow a great many additional characters to be recruitable as followers.\r\n\r\nInstallation\r\n----------------\r\n\r\nNMM - The mod is NMM compatible.\r\nManual Installation - Simply unzip the archive into your Skyrim\\\\Data folder. In the Skyrim launcher, activate \\\"zs charmed followers.esp\\\" in the data files page before starting the game.\r\n\r\nI strongly recommend the additional voices mod mentioned in the previous section.\r\n\r\nChangelog\r\n----------------\r\n\r\nVersion 0.1\r\n-----------------\r\nInitial Release",
  "categoryId": "66",
  "version": "0.1",
  "author": "Sirtaj",
  "createdUnix": "1329484043",
  "updatedUnix": "1329484187",
  "containsAdultContent": false,
  "uploadedBy": "sirtaj",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32569",
      "name": "Charmed Followers",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Charmed Followers-10086-0-1.7z",
      "uploadedUnix": "1329484187",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/82f8fef68044f55f752e7d50106a4878665e82f8d15af2825633228213e56586/analysis/1406689767/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Charmed%20Followers-10086-0-1.7z?fid=32569&ttl=1535770195&ri=8192&rs=8192&setec=767ec146439d0006e5a5f7caa0fa1540"
    }
  ]
}