{
  "modId": 10097.0,
  "modName": "An Old Rangers Story",
  "summary": "This is the Prologue of a Questmod and will frequently updated.",
  "descriptionHtml": "This is the prologue of an adventurer which will sent you on the trail of a guild that has been destroyed long ago. Erased from the annals of history. Find their old Base, find out what happend to those people!\r\nAnd be ready. Skyrim will soon need you to face a threat bigger than all previous.\r\nStart your quest by reading the book in \\\"Dead Man´s Drink\\\" in Falkreath.\r\n\r\nDescription:\r\n\r\nPart 1:\r\nThis mod adds a new player home to the lands of skyrim which can be acquired be doing a little quest. As mentioned befor this is just the beginning of this mod! I will soon add more quests and a whole guild!\r\nTo start the quest you have to TAKE the book in the tavern of Falkreath which is located at the desk near to Valga.\r\n\r\nPart 2: IS Out NOW!!! Read the new book in the ground floor of the guildmastershack to start the second quest! Have added Mapmarkers NPC´s with dialogue and many more! (savegame compatible)\r\n\r\nKeep your eyes open! There are many books which contain background informations and hints on the next part of the mod.\r\n\r\nYou found any bugs? Please send me PM!\r\n\r\nInstallation:\r\n\r\nsimply use the Nexusmodmanager or download the stuff and paste everything into your skyrim/data folder.\r\n\r\nIf you like this mod try my other one: http://skyrim.nexusmods.com/downloads/file.php?id=8698 ",
  "categoryId": "35",
  "version": "1.2",
  "author": "nomo89",
  "createdUnix": "1329489600",
  "updatedUnix": "1331886884",
  "containsAdultContent": false,
  "uploadedBy": "nomo89",
  "primaryFile": null,
  "files": [
    {
      "fileId": "43790",
      "name": "Old Rangers Story",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23604",
      "fileName": "Old Rangers Story-10097-1-2.zip",
      "uploadedUnix": "1331886884",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/91cc2fe64701bcda2ef6f5e4d58798a77432a2f842f8170601170017c4c39021/analysis/1406751450/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Old%20Rangers%20Story-10097-1-2.zip?fid=43790&ttl=1535770212&ri=8192&rs=8192&setec=0cbe72e97d1becd4805ef46aa1457455"
    }
  ]
}