{
  "modId": 10128.0,
  "modName": "Logical Smithing",
  "summary": "Smithing, only more logical. Better Perks , Auto unlocking and Faction armours. Lore friendly Too",
  "descriptionHtml": "I find Skyrim\\'s Perk Tree Awful. It\\'s not Lore friendly Or a strong point of the gameplay. I found that id have to go through many Perks points To Get to something worth crafting\r\n\r\n\r\nOverview of what this mod currently does now\r\n\r\nMajor Features\r\n\r\nRemoved \\\"double improvements\\\" on perks, because that\\'s broken\r\n\r\nOnly Two Main armour perks (discounting Daedric Smithing)\r\nSteel , Scaled and Steel Plate armour are all under the perk \\\"nordic Smithing\\\" \r\nLight elven , Elven , Elven Guilded, Ebony And Glass are all Under the perk \\\"Elven smithing\\\" \r\n\r\nThese Actualy start out very limited. More Armour from each perk is Available . For instance, Under smithing level 50 only Light elven/ Standard steel is available.\r\n\r\nSecond big feature is that New smithing styles are unlocked by Quests or actions\r\n- Orcish- Become bloodkin\r\n- Dwemer- Gain \\\"Ancient Knowledge\\\" \r\n- Imperial - Get outfitted With imperial Armour in solitude \r\n- Thieves guild- Collect debts \r\n\r\nAlong with armours we have weapons. You don\\'t Need To have An armour perk for weapons. You can quite happily Make A Glass Sword without The elven armours so long as you have the sword perk (although similarly, Just because you can make ebony swords doesn\\'t mean that you can make the armour. Also i see Similarities between Elven, Glass and Ebony... So i have no clue as to why you\\'d have to learn how to make Dwarven to make ebony. This Mod Makes Everything More Easy.. As you Can Make what you want but still manage to save perk points for other things.\r\n\r\nPerk tree is like this\r\n\r\nElven\r\nNordic\r\nWeapons--- >Advanced weapons\r\nBows\r\nArcane blacksmith ---- > Daedric \r\n\r\n\r\nThere are many, many smaller additions and it would be silly to name them all. But one thing that i am working on is Different metals for different styles- Why Can\\'t i make  Full Plate armour out Of Ebony or Orcish out of Moonstone? In this current version of the mod you can see That i am beginning to implement this into Both steel and elven With quicksilver! If anyone were to Make these kinds of textures for me then i will take them, credit you and then make downloaders happy bunnies!\r\n",
  "categoryId": "54",
  "version": "1",
  "author": "Jack254",
  "createdUnix": "1329504258",
  "updatedUnix": "1329504336",
  "containsAdultContent": false,
  "uploadedBy": "jack254",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32711",
      "name": "V1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "V1-10128-1.7z",
      "uploadedUnix": "1329504336",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/d4a9bf7547b2744cf8668b8c7e71777faeee203c3d97f44a0fbf242fceb65d97/analysis/1406690762/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/V1-10128-1.7z?fid=32711&ttl=1535770275&ri=8192&rs=8192&setec=8f4450114bda023349cc9f0d63f4b788"
    }
  ]
}