{
  "modId": 10131.0,
  "modName": "Guard Faction Armor",
  "summary": "With this mod, when you put on the helmet and cuirass of a Hold Guard, you are effectively disguised as a guard of that hold&#33; Great for stage IV vampires and characters in the Thieves Guild/Dark Brotherhood.",
  "descriptionHtml": "NO LONGER MAINTAINED\r<br />\r<br />Sorry guys, life caught up with me. I stopped updating this mod before the DLC came out, so it won&#39;t work with any of those costumes. I may re-do this mod when the remaster is released. If so, I&#39;ll let you guys know.\r<br />\r<br />---------------------\r<br />\r<br />Is being a wanted criminal or a stage IV vampire getting you down? Ever put on a set of guard armor, helmet and all, only to have guards automatically recognize that you are not one of them? Or did you simply fall in love with the &#34;faction armor&#34; system in Fallout: New Vegas (when it worked correctly)?\r<br />\r<br />Introducing, the Guard &#34;Faction Armor&#34; Mod for The Elder Scrolls V: Skyrim&#33;\r<br />\r<br />This mod makes it so that when you put on a guard&#39;s helmet and cuirass together, you become &#34;disguised&#34; as a guard of that Hold (ex. Whiterun Guard&#39;s Helmet + Whiterun Guard&#39;s Cuirass = Whiterun Guard disguise)&#33; Guards from the same hold your armor is associated with (and only that hold) will not attack you on sight or try to arrest you if you have a bounty, and NPCs will not be hostile toward stage IV vampires. Your true identity will be revealed as soon as you take off the cuirass or the helmet.\r<br />\r<br />But be careful... guards will still come after you if you commit a crime while wearing the disguise. \r<br />\r<br />Note: This disguise should not effect how guards see you in The Forsworn Conspiracy or during the Civil War Battles.\r<br />\r<br />This is my first mod that I have had the guts to upload, so please make sure you have backup saves in case this mod messes anything up (which it shouldn&#39;t). If you encounter problems, please contact me so I can fix them and update the mod. Enjoy&#33; \r<br />\r<br />~ duchessnukem\r<br />\r<br />-------------------------------------------------------\r<br />FOR MORE INFORMATION, INCLUDING INSTALLATION INSTRUCTIONS, PLEASE VIEW README.\r<br />-------------------------------------------------------\r<br />\r<br />*****NOTE*****\r<br />\r<br />This mod is experimental, and is not guaranteed to work in all circumstances. Still working out a few issues. The basic functionality should be there, however. Please tell me if you tried it and had issues&#33; And if you tried it and had no issues, tell me then too&#33; Thanks&#33; I really want this to work for everyone.\r<br />\r<br />\r<br />HELP ME MAKE THIS MOD BETTER&#33;\r<br />\r<br />If you have any idea how to write a script that involves detection, please let me know&#33; I want to be able to make it so that if the player is detected by *anyone* while putting on the disguise, it won&#39;t work. Email or PM me&#33; \r<br />\r<br />\r<br />[duchessnukem@gmail.com]\r<br />\r<br />-------------------------------------------------------\r<br />\r<br />Known Issues\r<br />====================\r<br />\r<br />- If a save is loaded where the player is already a Stage IV Vampire, equipping the faction armor does not work properly. To remedy this, feed once and then wait three days to reset your Stage IV Vampire status.\r<br />\r<br />- If the player puts on the disguise while detected by other NPCs, the disguise will work normally, even if those NPCs are hostile toward the player. Completely unrealistic - Must Fix.\r<br />\r<br />- If the player commits a crime while wearing the disguise and gets arrested/pays bounty, a guard may force-greet the player upon his/her release as if she committed another crime, even though the player&#39;s bounty has been cleared.",
  "categoryId": "24",
  "version": "0.6",
  "author": "duchessnukem",
  "createdUnix": "1329505827",
  "updatedUnix": "1332015902",
  "containsAdultContent": false,
  "uploadedBy": "duchessnukem",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32730",
      "name": "MODDisguisesV0_5",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "MODDisguisesV0_5-10131.zip",
      "uploadedUnix": "1329505983",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2c23637bb4cf62ae689884769f9d91baa81f64d0d7c642c45c6ed57fbe54710e/analysis/1406690865/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MODDisguisesV0_5-10131.zip?fid=32730&ttl=1535770279&ri=8192&rs=8192&setec=926a690419d7eefdd726ef062fb58f57"
    },
    {
      "fileId": "44229",
      "name": "MODDisguisesV0_6",
      "version": "0.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "MODDisguisesV0_6-10131-0-6.zip",
      "uploadedUnix": "1332015902",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/6626e5693e0992bca964333af887a870a0460c360d304a810229b7acff6554ed/analysis/1406753468/",
      "changelogHtml": " Started from scratch - completely rewritten <br/> \n Now works with both new and saved games <br/> \n Removed the functionality where disguise was ineffective when NPC sees player put on the disguise <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MODDisguisesV0_6-10131-0-6.zip?fid=44229&ttl=1535770280&ri=8192&rs=8192&setec=f553b6a42730d3c45a376a08a4b03397"
    }
  ]
}