{
  "modId": 10150.0,
  "modName": "Mage Tweaks",
  "summary": "Mage Tweaks provides modest adjustments to the Skyrim magic system to enhance gameplay.",
  "descriptionHtml": "===========================\r\nMage Tweaks by WoodsDweller\r\n===========================\r\n\r\nv1.0\r\n====\r\nConsisting of:\r\n    qqMTperks.esp   v0.4\r\n    qqMTenchant.esp v0.1\r\n\r\nDescription:\r\n============\r\nI am fairly happy with the magic system implemented in Skyrim, but feel it could benefit from some careful tweaking. To that end, I have implemented some changes that I feel enhance mage character gameplay without trying to turn the system on its head.\r\n\r\nThis release has two plugins. They can be used independently or together, your choice.\r\n\r\nqqMTenchant\r\n-----------\r\nOn robes you can get the (Fortify <school> + Magicka Regeneration) enchantment. This is an enchantment separate from either Fortify <school> or Magicka Regeneration. If you disenchant a robe with it you get that enchant, not the other two. You can go ahead and apply that enchantment to any armor, but the enchantment is too weak to be useful. This is because internally it is implemented as an enchantment that references two other enchantments, and your enchanting skill only applies to the first sub-enchantment (school) and not the second (regeneration), which is fixed at \\\"10\\\". The enchantment is so weak that it is worthless.\r\n\r\nProceeding under the assumption that \\\"worthless enchantments are worthless\\\", I changed them to be a somewhat stronger version of Fortify <school> (with enchantment maxed but no potions you can get to 25) and a fixed value of \\\"100\\\" for regeneration. So you can make a single enchantment with 25 Fortify Destruction and 100 Magicka Regeneration. By contrast, Master Robes of Destruction give you 22 Fortify Destruction and 150 Magicka Regeneration.\r\n\r\nYou can, of course, put a second enchantment on your armor and the Magicka Regeneration stacks. I\\'m using 25 (actually 28 with a potion) Fortify Destruction with 100 Magicka Regeneration plus 25 (28) Fortify Conjuration with 100 Magicka Regeneration. So I can make something better than a standard item, plus put it on armor of my choice instead of merely on a standard robe, without it being too extremely overpowered.\r\n\r\nThe Archmage Robe enchantment is implemented the same way, except it has five Fortify <school> enchantments plus the Magicka Regeneration and Fortify Magicka enchantments, only one of which will be affected by your enchanting skill. I didn\\'t see anything useful to do, here, so I just left it alone.\r\n\r\n\r\nqqMTperks\r\n---------\r\nThe Restoration/Necromage perk is nice to have - it gives 25% bonus damage to undead, and it only requires the Novice and Regeneration perks. However, Regeneration is available at skill 20, and Necromage is not available until skill 70. After 50 hours of play I only had skill 35. Restoration levels very slowly, and it is tedious to grind. I can\\'t see grinding 35 extra levels to get one perk.\r\n\r\nThis mod simply drops the Restoration skill requirement for Necromage from 70 to 40.\r\n\r\nThe other thing this mod does is add three additional levels to each of the three Destruction/Augment <damage type> perks. \r\n\r\nThe original form for each <damage type> was:\r\nAugment 1 - 25% bonus to <damage type> with Destruction skill requirement 30.\r\nAugment 2 - 50% bonus to <damage type> with Destruction skill requirement 60.\r\n\r\nThe new form is:\r\nAugment 1 - 20% bonus to <damage type> with Destruction skill requirement 30.\r\nAugment 2 - 40% bonus to <damage type> with Destruction skill requirement 45.\r\nAugment 3 - 60% bonus to <damage type> with Destruction skill requirement 60.\r\nAugment 4 - 80% bonus to <damage type> with Destruction skill requirement 75.\r\nAugment 5 - 100% bonus to <damage type> with Destruction skill requirement 90.\r\n\r\nHaving a five-stage damage improvement perk mirrors the way that weapon skills work. Overall you can get 100% bonus rather than 50% bonus, which should come in handy at higher levels.\r\n\r\nAcross the three damage types this will require up to nine extra perks. That\\'s a pretty heavy load, so it encourages you to concentrate in one damage type. It also gives you something useful to do with extra perks as you get to a higher character level.\r\n\r\n\r\n\r\nInstallation:\r\n=============\r\n\r\nUnzip the downloaded file to the location of your choice.\r\n\r\nPut either or both esps in the Data folder in your main installation directory and enable them.\r\n\r\nMake sure to retain a character save prior to taking the new perks, see Uninstallation, below.\r\n\r\n\r\nUninstallation:\r\n===============\r\nRemove the esp(s) from your Data folder.\r\n\r\nWARNING: if your character has used the new perks, its status will be unclear if you later disable or remove qqMTperks. It is not recommended that you continue a character that has taken Augment 3, 4, or 5.\r\n\r\nI believe that you will retain Necromage if you took it. \r\n\r\nYou will retain Augment 1 & 2 (their formIDs did not change).\r\n\r\nAugment 3, 4, and 5 are new formIDs that will not be defined once qqMTperks.esp is disabled or deleted. At the very least, your character will no longer have them and the perks you spent on them will be gone. I don\\'t know if your character is in any further way corrupted by this.\r\n\r\n\r\nCredits:\r\n========\r\nBethesda for Skyrim and the Construction Kit.\r\n\r\n\r\nPrograms Used:\r\n==============\r\nSkyrim\r\nConstruction Kit\r\n\r\n\r\nUsage and Permissions:\r\n======================\r\nThis mod is open source - you are free to modify or use it in your own mod without further permission, but you cannot further restrict usage of this mod\\'s resources by including in your own mod.\r\n\r\nYou may not upload it to sites other than Nexus.\r\n\r\nPlease credit me in your readme.\r\n\r\nThis mod is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. Use it at your own risk.\r\n",
  "categoryId": "75",
  "version": "1.0",
  "author": "WoodsDweller",
  "createdUnix": "1329514678",
  "updatedUnix": "1329514923",
  "containsAdultContent": false,
  "uploadedBy": "WoodsDweller",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32791",
      "name": "Mage Tweaks",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Mage Tweaks-10150-1-0.zip",
      "uploadedUnix": "1329514923",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e6be23ef726f45cf1b930236ee275d4efcb24723a865353cc3d1233983e2b9d0/analysis/1406691122/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mage%20Tweaks-10150-1-0.zip?fid=32791&ttl=1535770311&ri=8192&rs=8192&setec=155522ae7ccbf3950573c6833e2732ce"
    }
  ]
}