{
  "modId": 10154.0,
  "modName": "Sabers Armor",
  "summary": "Saber\\'s armor from Fate/Stay Night",
  "descriptionHtml": "Update Log:\r\n\r\nVersion 0.4: So this is another update, mainly on textures. I revamped the metal texture to give it a more \\\"polished\\\" feel, and added some little details to her cloth. Also further fixed some clipping. I know that Hentai has also released a Saber cloth dress, and I learned a lot from the way he handled things, but I dare say his version is much less polished than mine as of now. When I learn some new techniques in modelling and texturing in the future, I\\'ll apply those to this mod as well.\r\n\r\nVersion 0.3: This is a huge update. First and foremost, an unarmored version has been added! Made the cloth completely from scratch! I also solved most of the clipping issues. Only very minor clipping persists and you probably won\\'t even notice it. In the end I updated all the textures and they look more detailed and realistic now! The neck issue hasn\\'t been solved yet, so please just use the lowest weight for now (move the weight slider all the way to the left). After that I\\'ll move on to the Saber Lily armor and hopefully I can finish it soon.\r\n\r\nVersion 0.21: Fixed Gauntlet lighting on the right hand. Now it is much more natural.\r\n\r\nVersion 0.2: Boots and Gauntlets added! We now have the complete Saber! Well, still missing the hair style but hey, this is as close as we can get right now. Also improved the cloth texture so that it is more realistic. \r\n\r\nVersion 0.1: Initial release, only containing the armor.\r\n\r\nTODO: Implement the weight slider, at least solve the neck clipping issue at higher weights. \r\n\r\n===========================================\r\n\r\nInstallation:\r\n\r\nJust copy everything into the Skyrim\\\\Data\\\\ directory. Or simply use the Nexus Mod Manager.\r\n\r\nTo obtain the armor in game, simply forge it under Daedric armor category (no perk needed), or search for the item code using \\\"help saber 4\\\" in the console. The unarmored version is under Glass armor category (again no perk needed).\r\n\r\n===========================================\r\n\r\nCredits:\r\n\r\nThanks to the tutorial on NexusWiki about how to create armor for Skyrim, I was able to learn modelling and import/exporting from scratch.\r\nThanks to Norakuro for his previous work on Saber Lily\\'s armor. I didn\\'t use his mesh or texture but those gave me a lot of inspiration.\r\nThanks to Caliente\\'s body mod, on which a large portion of this mod is based. It makes an excellent starting point of making an armor mesh.\r\nThanks to Bethesda for making such an awesome game!\r\n\r\n==========================================================\r\n\r\nPermissions:\r\n\r\nIf you want to share this mod somewhere else, please inform me so that I know where this mod goes (you may tell me after you share it).  If you want to improve this mod, please feel free to do it on your own, but please send me a copy of your product so that I can learn from you!\r\n\r\n========================================================\r\n\r\nFrom First Release note:\r\n\r\nThis is my first mod, a recreation of Saber\\'s Armor in Fate/Stay Night. \r\n\r\nThe armor is still pretty much a work in progress. There is only Saber\\'s main armor, without gauntlets and boots yet (use your favorite for the moment). The large skirt also has some clipping issues when sneaking, but it is expected due to its size and complexity (3 layers!). I simply do not yet have the skill (or patience) to assign the perfect skin weight to make all clipping disappear. The next step will be including the gauntlets and boots first, before I come back to work on the clipping issues. An unarmored version is also on the horizon, which will be a light armor. In fact I just need to delete some meshes, but the texture for the clothing underneath looks terrible at the moment. \r\n\r\nI started learning 3D modelling and texturing about a week ago, so obviously there\\'s still a lot to be desired. For the mesh I loosely based on a model found on thefree3dmodels.com, but ended up recreating most of it by morphing Caliente\\'s body mesh. For the texture I made everything from scratch, and as of now it simply does not contain enough detail to match the vanilla armors in Skyrim. If someone could point me to a tutorial on making more detailed textures it would be highly appreciated!",
  "categoryId": "54",
  "version": "0.4",
  "author": "Fizban007",
  "createdUnix": "1329516811",
  "updatedUnix": "1330753937",
  "containsAdultContent": false,
  "uploadedBy": "fizban007",
  "primaryFile": null,
  "files": [
    {
      "fileId": "36542",
      "name": "Saber Armor Set v0_3",
      "version": "0.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "26380",
      "fileName": "Saber Armor Set v0_3-10154.zip",
      "uploadedUnix": "1330150280",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/6dd6335d6314f83305d2286d2b0fd54998936756df648c43775575e9a49f5a1b/analysis/1406711862/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saber%20Armor%20Set%20v0_3-10154.zip?fid=36542&ttl=1535770316&ri=8192&rs=8192&setec=d7647f4bfb998e10b38f9b4eccaf2b71"
    },
    {
      "fileId": "39459",
      "name": "Saber Armor Set v0_4",
      "version": "0.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26159",
      "fileName": "Saber Armor Set v0_4-10154-0-4.zip",
      "uploadedUnix": "1330753937",
      "modVersion": "0.4",
      "virusScanUrl": "https://www.virustotal.com/file/870afb184128bb8c949757536f5c705684928c864d900780a6cee4ff4db1b338/analysis/1406726771/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saber%20Armor%20Set%20v0_4-10154-0-4.zip?fid=39459&ttl=1535770316&ri=8192&rs=8192&setec=0f510d2d3140bf85aa17b9eb748cc1c9"
    }
  ]
}