{
  "modId": 10161.0,
  "modName": "Khalifa Save Game - Nord Assassin",
  "summary": "Here it is a save game of Khalifa, it ir a Nord and It is level 10.",
  "descriptionHtml": "Khalifa used to live in Bruma, the northest town of Cyrodill. He was the listener of the Dark Brotherhood. One day he decided to come back to the town were he was born, Falkreath.\r\nThe way from Cyrodill to Skyrim was not easy. There were some dangerous mountains that Khalifa had to go through if he wanted to arrive to his house. \r\n\r\n He took all his belongings and set off the way to Falkreath.  At first, the way was confortable without hard enemies to kill, just some big spiders and wolves. But when he arrived to the mountains he had to face some snow trolls he did not saw before. As he was such a skilled warrior with his bow and sword, he beat them and little by little he went down the mountain untill he saw a camp of some warriors called Stormcloacks. He was so hungry so he was hidding behid a tree to try to steal some bread. Suddenly something hit him in the head and he fainted.\r\n\r\nWhen he woke up he was sitting in a carruage way to his execution with someone called Ulfric. \r\n\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nThe character is level 10, he has some peark in Sneak, One-handed, Archery, Light Armor and basic Restauration. \r\n\r\nI have not done any qust but Golden Claw and the first step of the main quest (Western Watchtower) \r\n\r\nMods I have used:\r\n- Aragorn Ranger Armor- Standalone and Craftable - LOTR by BurnInHeaven aka Mister Fahrenheit with Credits to NoseGoblin\r\n- Straight hair retexture by navetsea\r\n\r\nRecomended Mods:\r\nSexy Cities\r\nRealistic water",
  "categoryId": "43",
  "version": "1.0",
  "author": "Masushulo",
  "createdUnix": "1329519876",
  "updatedUnix": "1329520400",
  "containsAdultContent": false,
  "uploadedBy": "masushulo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32827",
      "name": "Khalifa",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1908",
      "fileName": "Khalifa-10161-1.rar",
      "uploadedUnix": "1329520400",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3823656265cf52f78c341ca7ebef11526cf1fa656915906b8ff4e20472dfe14b/analysis/1406691184/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Khalifa-10161-1.rar?fid=32827&ttl=1535770329&ri=8192&rs=8192&setec=a486ef54d5be4f61c2d1054eac656293"
    }
  ]
}