{
  "modId": 10179.0,
  "modName": "Crystalis",
  "summary": "Crystalis is a player home added to the northern Winterhold region, north of Pilgrim\\'s Trench.\r\n\r\nCrystalis\\' theme is more suitable for Mage type characters, but has all storage and crafting needs for all character types. ",
  "descriptionHtml": "Crystalis is a player home added to the northern Winterhold region, north of Pilgrim\\'s Trench.(See screenshots for exact location)\r\n\r\n\r\nDescription\r\n___________\r\n\r\n\r\nCrystalis\\' theme is more suitable for Mage type characters, but has all storage and crafting \r\nneeds for all character types. \r\n\r\nInside you\\'ll find a Living area, containing basic home necessities such as a bed, two mannequins, a standard chest, and several wall displays for weapons.\r\n\r\nA Moon Altar that grants a 25% bonus to all crafting for 5 minutes upon use. \r\n\r\nA storage and mannequin room, containing separate storage chests for most item types, several mannequins, and a forge, workbench, smelter, tanning rack, cooking area and sharpening stone with a similar theme to the \r\nhome.\r\n\r\nA garden, containing several sources of alchemy ingredients from various regions.\r\n\r\nA library, containing 6 bookcases, Enchanting and Alchemy workstations, and a Moon Altar.\r\n\r\nA Throne room, in which sitting upon the throne grants a 5% power bonus to One-handed, Two-handed, Marksman and all schools of magic for 2 hours.\r\n\r\nAnd a Temple, containing access to all blessings of the divines.\r\n\r\nYou\\'ll receive a teleport spell upon arrival that will teleport you to Crystalis from any location you can fast travel from.\r\n\r\n\r\n\r\n\r\n\r\n\r\nI originally planned to expand upon the mod, add a questline, some indication as to why some trans-dimensional crystalline fortress happened to arrive just off the coast of Winterhold, but my desire to continue with the mod aside from home aspects weaned, and these features will most likely never be added.\r\n\r\nThis is a comment on Steam workshop, by Psykrom, that describes the mod, and the feeling associated with it pretty well,\r\n\r\n\\\"Everytime I enter this realm I\\'m stunned.\r\nCrystalis feels to me like a mystical shard broken from a star or a meteorit that landed in the icy realm of Skyrim. You can dive into another dimension temporarily.\r\nThe magic power of the Crystalis makes you switch through your rooms with ease with a flawless teleportation-navigation - that\\'s what I call fast moving while crafting.\r\nWhile looking awesome it\\'s kept simple and there are named rooms/chests for your needs.\r\nBecause there are no seen walls it has it\\'s own spacious freedom. And when you\\'re sitting on your throne, you can just relax and forget about the needs of the mortal realm...\\\"\r\n\r\nA better description of the mod I couldn\\'t give.\r\n\r\n\r\nChange Log\r\n___________\r\n\r\nV2.1 - \r\nMostly a final update adding some requested missing features and cleaning up the file for better compatibility with other mods.\r\n- Added a tanning rack, in between workbench and sharpening stone.\r\n- Added cooking, in the center of the smithing and storage room, you can use the mysterious light source in the center of the room to cook meals, that just happens to be the exact temperature for all your home cooked meals, whenever you want it to be.\r\n- Various minor adjustments and unnoticeable compatibility changes.\r\n\r\nV2 -\r\n- Added the Crystalline Throne and the Temple of Crystallinity. (See Screenshots)\r\n- Added 2 COA(Two Weapon and shield) racks, and altered the appearance and amount of weapon racks.\r\n- Optimized Navmesh.\r\n- Added music.\r\n- Moon Blessing now cures disease.\r\n- Added various lighting and ambient effects.\r\n- Various minor alterations to existing areas.\r\n- Adjusted ImageSpace(colors and blurring)\r\n\r\nV1.2 -\r\n- Reverted to previous ImageSpace.\r\n\r\nV1.1 -\r\n- Followers now follow you in and within without difficulty.\r\n- While there is still some trouble loading the exterior, most if not all will load upon \r\ncoming close enough to the exterior.\r\n- Ambient noise removed.\r\n\r\n\r\nKnown issues\r\n___________\r\n\r\n\r\nExterior doesn\\'t load fully at long distances. Please contact with solution if known.\r\n\r\n\r\n___________\r\n\r\nPlease report all bugs and issues to be remedied.\r\n\r\nIt is not possible for this mod to be causing your game to crash on start or on loading on it\\'s own. This is caused by a conflict with other mods installed. Claiming or alluding to this mod causing your crashing does not allow me to fix what\\'s causing it.\r\n\r\nPlease refrain from the overwhelming desire of posting some type of allusion or implication of Crystalis being derived from any source relating to Superman. It\\'s been done already with a large portion of the comments.. I\\'ve never seen the fortress of solitude in any rendition previous to making this mod that I recall, and when looking at pictures of it\\'s various formations I don\\'t see the significant obvious identical structure or outright mimicking so many of you have alluded to. It\\'s a house mod made of Azura\\'s star resources, that\\'s it, the end. Nothing else.\r\n___________\r\n\r\nAlso available on Steam Workshop : http://steamcommunity.com/sharedfiles/filedetails/?id=11999",
  "categoryId": "67",
  "version": "2.1",
  "author": "BartokTB",
  "createdUnix": "1329535208",
  "updatedUnix": "1340095251",
  "containsAdultContent": false,
  "uploadedBy": "BartokTB",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39970",
      "name": "Crystalis",
      "version": "2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "174",
      "fileName": "Crystalis-10179-2.zip",
      "uploadedUnix": "1330877189",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/2b662d191e161a4c5caabec5b497e34c2afcc20ec63b5dc78867dc0e16ba1fbb/analysis/1406729824/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Crystalis-10179-2.zip?fid=39970&ttl=1535770365&ri=8192&rs=8192&setec=28512adad764348297f02af1a1e33208"
    },
    {
      "fileId": "68988",
      "name": "Crystalis",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "171",
      "fileName": "Crystalis-10179-2-1.zip",
      "uploadedUnix": "1340095251",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/76a01e1ad4d4637282ae1a48c8f8c005cb424cd81bf4e3c54da997f9e8c010c2/analysis/1406969464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Crystalis-10179-2-1.zip?fid=68988&ttl=1535770366&ri=8192&rs=8192&setec=6a284dee9bf122108f4c50b45fa573ac"
    }
  ]
}