{
  "modId": 10180.0,
  "modName": "FXAA Injector Preset",
  "summary": "This is a FXAA injector preset I made for Kingdoms of Amalur: Reckoning because it really needs it but I though it might work well in Skyrim too.  The preset adds more vibrancy, some sharpening for a more crisp look, which brings out the textures more.",
  "descriptionHtml": "This is a FXAA injector preset I made for Kingdoms of Amalur: Reckoning because it really needs it but I though it might work well in Skyrim too. \r\n\r\nThe preset adds more vibrancy, some sharpening for a more crisp look, which brings out the textures more. I\\'ve tried not to go too overboard with this but I think it just tips the balance nicely. \r\n\r\n-----------Instructions---------------------------------------------------------------------------\r\n\r\nExtract the zip to your Skyrim directory where your main exe is, usually:\r\n(64bit) C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\r\n(32bit) C:\\\\Program Files \\\\Steam\\\\steamapps\\\\common\\\\skyrim\r\n\r\nRun the game as usual, toggle on/off by pressing the Pause Break key.\r\n\r\n--------Recommended-----------------------------------------------------------------------\r\n\r\nYou can use this FXAA injector with MSAA but disable FXAA in the game settings in the launcher, Options>Advanced.\r\n\r\n--------Notes-------------------------------------------------------------------------------------\r\n\r\nThe injector works with Kingdoms of Amalur: Reckoning(and a lot of DX9 games) in the same way and you can use it with that game. Some games come with their own post processing which can look poor and blurry, depending on the methods they use.\r\n\r\nJust credit me if you put it up on the net somewhere or and link me. Authors are in the readme file that comes with this file, I just tweak the settings.\r\n\r\nDon\\'t forget to endorse if you like it!",
  "categoryId": "62",
  "version": "1.0",
  "author": "Half64",
  "createdUnix": "1329535639",
  "updatedUnix": "1329535889",
  "containsAdultContent": false,
  "uploadedBy": "Half64",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32917",
      "name": "FXAA Injector Preset",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "67",
      "fileName": "FXAA Injector Preset-10180-1-0.zip",
      "uploadedUnix": "1329535889",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d2761a273d536e2db809acab7677b9431ca11330a4e4f643dc6241fcf71fc7f7/analysis/1406691680/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FXAA%20Injector%20Preset-10180-1-0.zip?fid=32917&ttl=1535770367&ri=8192&rs=8192&setec=055b0afc4c279e8d095529f9d58ec8ab"
    }
  ]
}