{
  "modId": 10188.0,
  "modName": "ghost hunter",
  "summary": "This is my first mod, so please let me know what you think!",
  "descriptionHtml": "Idea:\r\n     When I hit level 41 in Skyrim, I had already maxed out my smithing, and had an improved deadric sword. I didn\\'t need any other weapons, and that means that all the effort put into creating all the different types of weapons in the game went completely to waste, as I either dropped or sold them all. Enter, my mod.\r\nOverview:\r\n     So, to solve this problem, my mind went to shows like Supernatural, and games like the Witcher. They had multiple weapons, each used for specific types of creatures. I decided, using mostly lore from those sources, that I would make other types of weapons useful against different types of creatures. \r\nDetails:\r\n     The following changes have been made.\r\nItems Added:\r\n-Insectoid Oil =- can be crafted by boiling Chaurus Chitin and Frostbite Venom in a cook pot.\r\n-Holy Water =- Crafted from certain religious amulets also in a cook pot.\r\n-Refined Dragons Blood =- crafted in a cook pot, from 2 dragon hearts (an item I also added)\r\n\r\n     I used the cook pot, because I do not know of a way to use alchemy to create items, and I imagine water would be the first thing in the pot anyway.\r\n\r\nGameplay Changes:\r\n-Deadra =- being the demons of the Elder Scrolls world, \\\"poisoning\\\" your blade with holy water will cause them to take twice as much damage, and do half as much, for 2 minutes.\r\n-Dragons =- In many mythos, dragons can only be harmed by their own blood, so to this end, the poison \\\"Refined Dragon\\'s Blood\\\" SHOULD disable all of the dragons shouting and spells abilities for 2 minutes.\r\n-Spiders and the Chaurus =- Being Poisoned with Insectoid Oil will cause them to take twice as much damage for 2 minutes.\r\n-Silver weapons now do not effect ghost type creatures, and instead of doing the default +20 damage, they do 1.5 times the damage.\r\n-Iron weapons now affect ghost type creatures, and do 3 times the damage (only to ghosts), to compensate for the low damage output of iron weapons later in the game.\r\n\r\nInstallation:\r\n     Should work with NMM.\r\n\r\nFinal Notes:\r\n     This is my first mod, and has not broken my game, but I have not tested it yet, so please let me know how it works, if it works. Also, if anything is over/under powered. Finally, give me any ideas you have for that mod, that you feel i should implement. \r\n     Please do not use this mod in yours, even with my permission, until it\\'s actually finished, lol. When it\\'s finally done, You may use it to your hearts content. (if it\\'s even remotely worth using, lol)",
  "categoryId": "24",
  "version": "0.5",
  "author": "Shiek200",
  "createdUnix": "1329539505",
  "updatedUnix": "1329539684",
  "containsAdultContent": false,
  "uploadedBy": "shiek200",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32936",
      "name": "Ghost Hunter",
      "version": "o.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Ghost Hunter-10188-o-5.rar",
      "uploadedUnix": "1329539684",
      "modVersion": "o.5",
      "virusScanUrl": "https://www.virustotal.com/file/41ae44be65eba116f22e9802f37de6cc6e60130be9ee50819e9a6f8361efecac/analysis/1406691888/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ghost%20Hunter-10188-o-5.rar?fid=32936&ttl=1535770383&ri=8192&rs=8192&setec=a5294fa0b4ead0a5bf3e19791fb1171d"
    }
  ]
}