{
  "modId": 10198.0,
  "modName": "Playable Children PLUS",
  "summary": "Makes child races playable & functional, and adds a chest with child outfits to Helgen Keep; makes the Roughspun Tunic appear as one of the child clothing items to prevent children being in their underwear at game start; makes Dremora race playable.",
  "descriptionHtml": "This mod makes a number of changes designed to make it possible/easier to play as a child in Skyrim. First, it makes the child races playable, and as a bonus makes the Dremora race playable too. Next, it adjusts the stats of the newly-playable races so that they have appropriate regen and carrying capacity - 0.7 regen rate for health, 3 regen rate for magicka (up from 0 for both) and 5 regen for stamina (down from 10). The Dremora has a custom-designed racial ability, while the child races inherit their parent race\\'s racials.\r\nBut playing as a child in the current state of affairs presents another challenge, that is, avoiding having a child running around in their underwear (henceforth referred to as \\\"naked\\\") in the cold Skyrim winter. I haven\\'t truly solved that issue, but I\\'ve discovered a workaround so that your child character need never appear to be naked. This fix only affects the Roughspun Tunic, adding body data for the child races so that Breton, Imperial, Redguard, and Nord children, and other races which copy body data from those races, will not appear naked when wearing the Roughspun Tunic, which is the item of clothing you start the game wearing. Note that the Dremora race is affected by this issue as well, but I declined to try and fix it for that race. They\\'re immortal Daedra, they can suffer a little cold until they get some proper clothing.\r\n\r\nNOTE: this does not affect the appearance of the Roughspun Tunic on adults.\r\n\r\nFinally, along the same lines as the last item, this mod also adds a chest with one of each of the regular child clothing - which have been marked as playable, otherwise you wouldn\\'t be able to see them in the chest. There are three colors of children\\'s clothes, so one of each color is in the chest; you will also find a pair of children\\'s shoes there. The chest is placed in Helgen Keep, next to the dead Stormcloak soldier; it\\'s placed there because regardless of which side you choose, that chest is immediately accessible at the start of the game. It continues to be accessible throughout the game, so long as you can get to Helgen.\r\n\r\nPlease note that in order to complete the Dark Brotherhood questline you may need [url=http://skyrim.nexusmods.com/downloads/file.php?id=10770]Higher Magic DB CookQuest Fix[/url]. This is a custom race fix, which allows the conversation with the Solitude cook to proceed.",
  "categoryId": "24",
  "version": "1.0",
  "author": "Kristoffer",
  "createdUnix": "1329544477",
  "updatedUnix": "1329544539",
  "containsAdultContent": false,
  "uploadedBy": "Deadlykris",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32972",
      "name": "Original Release",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "65",
      "fileName": "Original Release-10198-1.zip",
      "uploadedUnix": "1329544539",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/9800ffccf761c50c4188d1f7e9c0f17961edff22a955e3316431dffb43c54230/analysis/1406692024/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Original%20Release-10198-1.zip?fid=32972&ttl=1535770397&ri=8192&rs=8192&setec=72ab4b75353b34fc9b7174045c42ff22"
    }
  ]
}