{
  "modId": 10192.0,
  "modName": "Static Mesh Improvement Mod Hidden Mod",
  "summary": "Hidden mod page used for SMIM\\'s images and layout changes.",
  "descriptionHtml": "Hidden mod page used for SMIM\\'s images and layout changes.\r\n\r\nTEST LAYOUT:\r\n\r\n[center][url=http://skyrim.nexusmods.com/downloads/images/10192-1-1331409074.jpg][IMG]http://skyrim.nexusmods.com/downloads/images/10192-1-1331408167.png[/IMG][/url][/center]\r\n\r\n[center][b]Current Version: [color=#62fffd]1.15 - March 11, 2012[/color] - Farmhouse Texture Fixes All Done! Celebration time![/b]\r\n\r\n[/center]\r\n\r\n[center][IMG]http://skyrim.nexusmods.com/downloads/images/10192-1-1332711219.png[/IMG][/center]\r\nA mod that changes the ugly, pure-white dynamic snow effect to actually use the default snow texture (landscape\\\\snow01.dds). This minor change greatly improves the visual appearance of dynamic snow. See for yourself:\r\n\r\n[center][IMG]http://skyrim.nexusmods.com/downloads/images/10192-1-1332716199.png[/IMG][/center]\r\n\r\n[center][IMG]http://skyrim.nexusmods.com/downloads/images/10192-1-1332712570.png[/IMG][/center]\r\nIt is recommended to download the mod using the [url=http://skyrimnexus.com/content/modmanager]Nexus Mod Manager (NMM)[/url]. Simply click on the \\\"Files\\\" tab of this page and click \\\"Download with Manager\\\". Then once the mod downloads, simply click the \\\"Activate\\\" button. Pick \\\"Yes to all\\\" if NMM asks if you want to overwrite any files.\r\n\r\nFor a manual install, locate your Skryim installation directory, usually at Program Files (x86) / Steam / steamapps / common / skyrim. In this folder is a folder called \\\"Data\\\". Unpack or drag the contents of the mod archive file into \\\"Data\\\". Allow BDS to overwrite any file conflicts.\r\n\r\nUninstallation is easy to do via Nexus Mod Manager. For manual uninstallations, delete the files you installed. If you can\\'t remember what you installed just re-download the mod and look at the file structure!\r\n\r\n[center][IMG]http://skyrim.nexusmods.com/downloads/images/10192-1-1332713305.png[/IMG][/center]\r\nThere are about 1070 total objects that Skyrim applies \\\"Dynamic Snow\\\" to (not actually dynamic but a static shader effect). This applies a pure-white color on the object. The result is sometimes nice but more often the result is a very ugly \\\"white-washed\\\" appearance as if someone took white paint and plastered it on the objects. Smaller, more complex objects with curves and angles tend to look decent with the vertex-based snow, but large, flat surfaces like floors tend to look absolutely terrible since they appear nearly pure-white, totally obscuring the underlying texture.\r\n\r\nThe better method is to apply an actual snow texture to the object surfaces. The problem is there is a serious engine limitation that doesn\\'t allow a texture to be applied on top of part of a mesh that already uses an alpha transparency. This is most likely why Bethesda didn\\'t use the actual snow texture method.\r\n\r\nBetter Dynamic Snow (BDS) version 1.0 to 1.6 basically changed all 1070 objects to use the snow texture, which looked great but resulted in many objects missing the dynamic snow entirely because of the alpha transparency issue.\r\n\r\nTherefore, version 2.0 of Better Dynamic Snow only applies the snow texture to almost exactly 60% of the 1070 meshes and leaves the other 40% with the pure-white-vertex snow. We went through all 1070 objects one by one and changed only those that wouldn\\'t result in missing snow. The good news is almost all of the worst-looking-vertex-snow objects now use the snow texture.\r\n\r\n[center][b]REPORTING ISSUES OR PLACES TO IMPROVE[/b][/center]\r\n\r\nIf you find a place that uses vertex-snow and you think it is exceptionally ugly, please take a screenshot and post it along with your location. Then we can address fixing it to use the snow texture shader.\r\n\r\nIf you find a place you think is missing snow due to BDS\\'s changes, please take a screenshot, then disable BDS and take another screenshot of the vanilla game and compare. If BDS does cause snow to become missing (very unlikely), please post the information.\r\n\r\n[center][b]TECHNICAL INFORMATION FOR MODDERS[/b][/center]\r\n\r\nDue to how BDS works, we had to split up certain meshes and add them to the game using the CK. The main meshes are the snow versions of all Farmhouse buildings, the 5 Windhelm Palace pieces, the Orc Longhouse, and the Imperial Stables shack kit pieces. You don\\'t need to use our split apart meshes but your mod will simply use the vanilla vertex-snow on any of these type of meshes you place. If you want BDS-snow-shader versions, just place both parts of each object, such as \\\"Farmhouse01SnowNoRoof\\\" and \\\"Farmhouse01SnowRoof\\\", in the exact same location instead of using the regular \\\"Farmhouse01Snow\\\" object.\r\n\r\n[center][IMG]http://skyrim.nexusmods.com/downloads/images/10192-4-1332712571.png[/IMG][/center]\r\nBDS probably won\\'t conflict with other mods.\r\n\r\nBDS has to edit a number of cells in order to replace the non BDS versions of quite a few meshes. The regular versions of these meshes are set to disabled. Very few mods should touch these references since they are all vanilla building and cave entrance meshes.\r\n\r\nBDS will conflict with mods that edit the snow shaders. No mods like this are known.\r\n\r\n[center][IMG]http://skyrim.nexusmods.com/downloads/images/10192-2-1332712571.png[/IMG][/center]\r\nBDS version 2.0 is complete. It doesn\\'t need to be updated and can be used for years to come. However, minor improvements could be made to include even more of the 40% that don\\'t use the snow texture. To accomplish this it is necessary to break any mesh that uses alpha transparency into two separate meshes and then apply the snow texture shader to the non-alpha parts and keep the vertex-snow on the alpha parts. This has diminishing returns since the meshes that really need this treatment already have it.\r\n\r\n[center][IMG]http://skyrim.nexusmods.com/downloads/images/10192-1-1332713437.png[/IMG][/center]\r\n[center][youtube]-0c-75L8Vxc&feature=youtu.be[/youtube]\r\n\r\nVideo by Arsenalrobert. Thank you very much![/center]\r\n[center][IMG]http://skyrim.nexusmods.com/downloads/images/10192-1-1332713563.png[/IMG][/center]\r\nSince Better Dynamic Snow uses the default snow texture (landscape\\\\snow01.dds), it can benefit from using alternate high-quality snow texture replacer mods. We recommend [URL=http://skyrim.nexusmods.com/downloads/file.php?id=743]Snow HQ Texture Pack by Erik[/url], but you can use any snow texture replacer mod you wish.\r\n\r\n[center][IMG]http://skyrim.nexusmods.com/downloads/images/10192-3-1332712571.png[/IMG][/center]\r\n[b]Version 2.0 - March ??, 2012[/b]\r\n[LIST]\r\n[*]Complete rewrite. All objects using Dynamic Snow checked to see if they can use BDS snow textures without issues. Overall, 60% of objects use the BDS snow shader.\r\n[*]Split many meshes into separate parts, the alpha and non-alpha elements, in order for the BDS snow texture to be applied to the non-alpha parts, leaving the alpha parts to use the vertex-color snow.\r\n[/LIST]\r\n\r\n[b]Version 1.6 - February 28, 2012[/b]\r\n[LIST]\r\n[*]Re-added textures to the shader.\r\n[*]New enhanced snow shader with extra sheen effect to make it look more realistic.\r\n[/LIST]\r\n\r\n[center][IMG]http://skyrim.nexusmods.com/downloads/images/10192-1-1332713932.png[/IMG][/center]\r\n[b]OpticShooter[/b] - Discovery, original concept, testing and general help. Original author of BDS.\r\n\r\n[b]Brumbek[/b] - All the mesh work in 2.0, including painstakingly going through any object that required fixing. Fixes included breaking apart meshes, removing redundant alpha channels and also using the CK to replace any object instances. Brumbek also had to test these objects one by one to make sure they worked properly.",
  "categoryId": "62",
  "version": "1.00",
  "author": "Brumbek",
  "createdUnix": "1329541793",
  "updatedUnix": "1329541793",
  "containsAdultContent": false,
  "uploadedBy": "Brumbek",
  "primaryFile": null,
  "files": []
}