{
  "modId": 10201.0,
  "modName": "Miravel Tel-Nar - The Rose of Valenwood",
  "summary": "A beautiful, capable Aldmeri hunter, who will support with her bow or her daggers, and may be courted by the player.",
  "descriptionHtml": "================================================================================\r\nMIRAVEL HAS BEEN UPDATED!\r\n================================================================================\r\nv. 1.2b includes:\r\n================================================================================\r\nMiravel now has a unique class and custom combat behaviors!\r\n\r\nWill switch between bow and blades dependent upon combat conditions(based on modified behavior presets), and will now DUAL WIELD!  As well, she\\'ll perform the appropriate finishers and decapitations in melee combat.\r\n\r\nMiravel is even more powerful than before, due to her revised combat suite, and if you feel she\\'s too powerful, just unequip her circlet and ring, to diminish archery and melee damage by 30% respectively for those skills.  Recommend leaving her amulet on, to keep her improved stealth rating.\r\n\r\nShadow Warrior helps improve her threat reduction in ranged combat, but present AI behaviors make it impossible to keep her in sneak mode to initiate ambushes.  She will, however, hold position until she feels directly threatened when you\\'re ambushing with archery.  Her Elemental Fury shout DRASTICALLY improves her melee combat speed for 15 seconds at a time.\r\n\r\nMarriage by default is still off the table from what appears to be a faction bug in the CK.  Have her added to the appropriate factions, with the appropriate values, but apparently even people who aren\\'t native residents of Skyrim only \\\"respond to deeds.\\\"  Will be adding a basic quest to properly trigger the faction necessary to make her courtable(v. 1.3b to come).\r\n\r\nIn the meantime, use the console command \\\"addfac 19809 1\\\" to properly seat the already existing faction scripting, and you\\'ll get the engagement dialogue.\r\n\r\n=========================================================================\r\n=========================================================================\r\n\r\nIF YOU ENJOY THIS COMPANION MOD, PLEASE RATE AND ENDORSE!  Anyone wanting a small tweak to this character may request it, as it only takes a few minutes for me to make any number of modifications to her appearance and outfitting.\r\n\r\nAlso, READ THIS ENTIRE POST SO YOU KNOW IMPORTANT INFORMATION REGARDING THE COMPANION AND HER FUTURE!!!\r\n\r\nMiravel Tel\\'Nar is a basic companion, at this point.  She has a complete backstory, following a line back to the Merethic Era.  She is, for all intents and purposes, immortal.  A true child of Anuri-El, she believes that the Mer have been corrupted too long, and strives against the 2nd Aldmeri Dominion, which she considers fanatical, violent, and sick.\r\n\r\nShe knows not why she\\'s lived for millenia, but the quest that will eventually attach to this companion will reveal the secrets which have kept her alive, by the very grace of the Aedra....  and will find the price to stop the Thalmor\\'s domination of the races of Men and Beast alike to be higher than she ever imagined.\r\n\r\nRight now, she uses a preset package of generic and basic voice interactions.  As near as I can tell she is also in a \\\"Courting\\\" status, with a disposition of 100.  I have yet to test the ability to marry her, but I\\'m reasonably certain I have this set up correctly.  Contact me or post screenshots with a wedding photo if you manage to, or with the news that she\\'s not marriageable if you\\'re unable to court her.\r\n\r\n=================================================================\r\n\r\n[UPDATE FOR MARRIAGE WORKAROUND]:\r\nSTATUS:  Pending\r\n\r\nThere appears to be an issue with setting a non-quest-related NPC to the marriage faction by default.  I have all the appropriate factions in place, and she refuses to prompt for engagement.  My guess is it\\'s yet another bug that Bethesda failed to notice.  Going to consult with a few people, and see if I can figure a workaround.  In the meantime, open the console, target Miravel, and input the following to activate the already existing but defunct faction:\r\n\r\n\\\"addfac 19809 1\\\"\r\n\r\nI\\'ll update this when I figure out a solution, but for the time being, this nuisance is getting the better of me.  As soon as I get it to properly add her, I\\'ll remove this segment and post an update.  In the meantime, I\\'m working on a small, nothing quest to attempt to force the faction to the necessary value.  Apparently, this might be the only way to make it properly shift her faction rating.\r\n\r\n===============================================================\r\n\r\nEventually, this companion will have a complete story, with dozens of quests, an attainable player home, Radiant Story arcs that let you choose your relationship, interactions and branching quest progression, an optional romantic story arc that will run in tandem to her main quest, and hundreds - possibly thousands - of lines of COMPLETELY VOICED DIALOGUE.\r\n\r\nThings are hectic at present, and I wanted to get my first companion posted, basic though it may be.  She will be naked when you find her, but has a full inventory of gear, which includes:\r\n\r\n2 Elven Daggers\r\nElven Bow\r\n150 Elven Arrows\r\nForsworn Cuirass\r\nForsworn Boots\r\nForsworn Gloves\r\nAmulet of Peerless Sneaking\r\nCirclet of Peerless Archery\r\nRing of Peerless Wielding\r\n\r\nSimply remove and replace an item in her fully customizable inventory, and she\\'ll auto-equip the gear.  She was naked deliberately.  Not placing a pre-set default allows you to trade all her gear out if you so choose, giving full freedom to equip her however you wish.\r\n\r\nI recommend leaving the enchanted gear on her to increase her combat efficiency, but if you want to break immersion and steal all her stuff, be my guest.  Not really what was intended, but do as you please.  Also, she presently uses the default combat package, but if you\\'d like her to be just an archer, that can be arranged as an alternate download.  Let me know.\r\n\r\n================================================================\r\n\r\nThis mod will take a lot of time, and I promise that the dialogue won\\'t be overly one-sided on Miravel\\'s part, and won\\'t bog down conversation like some other mods from Oblivon which involved overly talkative Argonians that gave you no choice but to hear their entire life story every time you spoke with them.\r\n\r\nThe notion, via use of Radiant Story/Dialogue, is to make this character as immersive or business as you want her to be, in future versions.  Want to keep to only the particulars of the fight brought to your doorstep?  No problem, she won\\'t inflict her past on you if you just want to help her and be about the tasks at hand.\r\n\r\nWant to know her every secret and desire?  Engage her more actively, and enjoy the wonders of truly Radiant character development, where your choices will have a real impact on how she perceives you, and what parts of her past she\\'ll share.  Feel the consequence of your actions and words shift her emotions and the quest-line, as your good or ill deeds and choices, or silver-tongued or cruel words cut to the bone in ways she\\'ll always remember.\r\n\r\nIt will even be possible to fail this quest in grand fashion through the use of Radiant Story, allowing the player to stray from the path at hand, inviting the wrath of the Rose of Valenwood, or forever driving a wedge between you.  Your choices will decide whether she will become your life-long companion, or leave Skyrim forever upon the completion of her task.\r\n\r\n===============================================================\r\n\r\nWhile I work to finish the quest, story, and dialogue for this companion, which will likely be done in progressive phases as I become more skilled with the CK(and some of the bazillion bugs it has are worked out and around), I will always have a \\\"finished and functional\\\" work in progress always available and playable.\r\n\r\nUntil the fully voiced Radiant Companion and quests are finished, I will always have this version posted for those who want to simply have a fully compatible and marriageable companion at their beck and call.\r\n\r\nShe can presently be found relaxing in the Sleeping Giant Inn in Riverwood, having a few glasses of wine with a nice, quiet meal.  This makes her immediately obtainable as a companion upon escaping Helgen.\r\n\r\nWhen this becomes a Full Radiant Companion mod, she will no longer be here, but will instead be discovered by the player in another location, under far more intense circumstances.\r\n\r\nKeep an eye out, because I guarantee you, when the bugs in the CK get sorted out, it will be well worth the wait.\r\n\r\n===============================================================\r\nIMPORTANT NOTE ON APPEARANCE:\r\n===============================================================\r\n\r\nAll Vanilla resources are used for Miravel, so there are no requisite mods required to utilize her as a companion.  HOWEVER, if you want her to look as my version does, there are a few mods I utilize to make her FAR more aesthetically pleasing:\r\n\r\n[REMEMBER:  THESE FILES ARE OPTIONAL!]\r\n\r\nCoverwomen by mrLenski:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3563\r\n\r\nCovereyes by mrLenski:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4869\r\n\r\nCaliente\\'s Big Bottom Edition Body Mod \\\"-CBBE-\\\":\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2666\r\nBe sure to download the compatible v2/3 compatibility textures to avoid mesh thrashing on the hips!\r\n\r\n/with CHSBHC - BBP - Body Physics Mod Compatibility:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4888\r\n\r\nKillerKeo\\'s Skimpy CBBE Conversions WIP for Vanilla Armor Conversion:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3654\r\n\r\nEnhanced with CHSBHC - BBP Conversions with BBP to add physics to KillerKeo\\'s Armors:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=7475\r\n\r\nAnd finally, Coolsims Hairs:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3809\r\n\r\nIt\\'s important to note that if you want her to have those gorgeous, searing green eyes, you\\'ll have to do some shuffling and renaming of mrLenski\\'s Covereyes.  If you take the green human eyes, rename them to overwrite the WoodElfLightBrownEyes file(must have identical spelling and should prompt for an overwrite - click Yes).\r\n\r\nI personally hated the default eyes that Bethesda gave the Bosmer.  Call it \\\"lore-breaking\\\" if you wish, but if you go by previous \\\"lore\\\" that exists in the games, Bosmer had all different eye colors, not just five crappy ones, demonic eyes, or blindness.\r\n\r\nTheir time in Valenwood made their appearance change, but there\\'s nothing that says their eyes have to look animalistic and demonic.  Personally, I thought the eyes the Children of Aldmeris had in this game were garbage.  The only ones that look suits are the Dunmer.  That\\'s just how I feel about it.",
  "categoryId": "66",
  "version": "1.2b",
  "author": "Archangel7144",
  "createdUnix": "1329546396",
  "updatedUnix": "1329780551",
  "containsAdultContent": false,
  "uploadedBy": "Archangel7144",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32984",
      "name": "Miravel Tel_Nar",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Miravel Tel_Nar-10201.7z",
      "uploadedUnix": "1329546706",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e0517cdd652c42bbd54eae11ad206aeb164edc3d0421998eb5e57966e01906de/analysis/1406692095/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Miravel%20Tel_Nar-10201.7z?fid=32984&ttl=1535770401&ri=8192&rs=8192&setec=2a958c3bcdca5a14204641b563a7864a"
    },
    {
      "fileId": "34444",
      "name": "Miravel With Unique Build",
      "version": "1.2b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Miravel With Unique Build-10201-1-2b.7z",
      "uploadedUnix": "1329777082",
      "modVersion": "1.2b",
      "virusScanUrl": "https://www.virustotal.com/file/799ab1d9467fb8a3e04322141a09a8b5ad928c6b5db08f71decc1d61693fea0f/analysis/1406699407/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Miravel%20With%20Unique%20Build-10201-1-2b.7z?fid=34444&ttl=1535770402&ri=8192&rs=8192&setec=2ac5afc806332dc961e3862a4ae11cc9"
    },
    {
      "fileId": "34474",
      "name": "Miravel with Forsworn Default Armor",
      "version": "1.2.1b",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Miravel with Forsworn Default Armor-10201-1-2-1b.7z",
      "uploadedUnix": "1329780459",
      "modVersion": "1.2.1b",
      "virusScanUrl": "https://www.virustotal.com/file/283ca299bb5382e484feff943761836f70ad4e27ce22816895c5d9212271698b/analysis/1406699765/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Miravel%20with%20Forsworn%20Default%20Armor-10201-1-2-1b.7z?fid=34474&ttl=1535770402&ri=8192&rs=8192&setec=1a6bd24886fb56e1aaba5d626f3a12bb"
    },
    {
      "fileId": "34475",
      "name": "Miravel with Wench Outfit Default",
      "version": "1.2.2b",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Miravel with Wench Outfit Default-10201-1-2-2b.7z",
      "uploadedUnix": "1329780551",
      "modVersion": "1.2.2b",
      "virusScanUrl": "https://www.virustotal.com/file/131bfdddb5c80dc58c156171cf59a430ff39113e81e859cdfb64cd32dccc7c8b/analysis/1406699766/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Miravel%20with%20Wench%20Outfit%20Default-10201-1-2-2b.7z?fid=34475&ttl=1535770403&ri=8192&rs=8192&setec=406bf8770492af33210ab1dd26bc38d7"
    }
  ]
}