{
  "modId": 10206.0,
  "modName": "Cozier Villages - Outdoor Lighting",
  "summary": "Lamp posts, lanterns and sconces have been added to warm Skyrim\\'s cities and villages so they\\'re more inviting to Tamriel\\'s weary travelers.",
  "descriptionHtml": "[font=Lucida Sans Unicode][center][size=4][color=7CFC00]This mod will likely no longer be updated.  It also may not be compatible with new patches from Bethesda, so please use with caution.\r\n\r\nI would like to suggest as an alternative:\r\n\r\n[url=http://skyrim.nexusmods.com/mods/17605]Claralux - More and Brighter Lights[/url]\r\nor\r\n[url=http://skyrim.nexusmods.com/mods/18916]Lanterns of Skyrim - All in One[/url]\r\n\r\nBoth are great mods, both add great atmosphere and, more importantly, both seem to be kept up-to-date!\r\n\r\nAlso, thanks to everyone who endorsed and for the feedback![/color][/size][/center]\r\n\r\n[center][img]http://img607.imageshack.us/img607/5589/2012041800001k.jpg[/img][/center]\r\n[center][size=2][i]Mmmmm, doesn\\'t that look cozy?[/i][/size][/center]\r\n\r\n[center][size=4][color=00CED1]If you notice bugs, please report them in the comments.  I didn\\'t have time to QC check every new location, so there may be a light or two out there that doesn\\'t cover much area.\r\n\r\nAnother note: With every realistic lighting mod I\\'ve used thus far, the lights I\\'ve placed have far more color saturation than vanilla.  That coupled with the countless environmental effects from snow to rain to aurora can make one light look completely different if it\\'s in different locations.  If you see some lights that look off in color, try waiting for the weather to change or the sky to clear.  You\\'ll be surprised how much difference the other game effects have.\r\n\r\nIf they\\'re way off though, tell me and I\\'ll do some color correction. ;)[/color][/size][/center]\r\n\r\n[center][size=4][color=00CED1]What this mod does:[/color][/size][/center]\r\n[size=2]- Adds light posts, lanterns and sconces to streets and buildings in Skyrim\\'s populated areas.\r\n- Except for Whiterun, which I used lamp posts in lieu of the default braziers, I have tried to use native light sources such as pit fires in Markarth and Windhelm.  I\\'ve simply deleted some that seemed unneeded, added others and placed accent lights on prominent architectural features so they\\'re lit at night.\r\n- Gives an overall \\\"lived in\\\", warmer feel to the otherwise dark, dank towns for Skyrim\\'s people![/size]\r\n\r\n\r\n[center][size=4][color=00CED1].ini Tweak (light source render distance)[/color][/size][/center]\r\n[size=2]- Go to the folder where your Saves folder is located (for Win7 users, Start/Documents/My Games/Skyrim)\r\n- Open SkyrimPrefs with notepad\r\n- Find the line \\\"fLightLODStartFade=\\\"  This is how far away that light sources are rendered from the player.  The greater the number, the farther away you\\'ll see lights.  The default maximum that you can change this to from the splash screen options is \\\"35\\\", or \\\"3500.00\\\" as it would show up in the .ini file.\r\n- Change the value to 7500.  You can go higher, but you\\'ll risk seeing glitchy distant lights, especially as you close in on 10,000.  You can also go lower toward the original 3500.\r\n- Save, close, play Skyrim\r\n- If you notice flickering lights in dungeons, you may want to back that number off again until you find something that\\'s less flickery.  I haven\\'t tested this at all in dungeons, I\\'m just assuming that at some point you may see flickering dungeon lights because of how they\\'re typically laid out and how the game decides which lights to turn on according to player position and the direction they are looking.[/size]\r\n\r\n[center][size=4][color=00CED1]Updates:[/color][/size][/center]\r\n[size=2]- Orc Strongholds\r\n- Skyhaven Temple courtyard\r\n- Various Mills (Half-Moon, Solitude Sawmill, etc)\r\n- Various Inns (Nightgate, Old Hroldan)\r\n- Mine encampments (Darkwater Crossing,  Rockwallow Mine)\r\n- Farms (Goldenglow Estate, Brandymug Farm)\r\n- More realistic colors\r\n- Lanterns now replace candle-horn sconces\r\n- I haven\\'t done much on the road to Solitude. The ground textures don\\'t want to reflect light and it looks like there are shadows where I have placed lights. I think it\\'s something to do with the way the lights are programmed, and I don\\'t know how to resolve the issue.\r\n- I won\\'t be updating both versions of this mod any longer. I was asked to early on because Realistic Lighting made interiors dark along with outside lighting. There are a few other modders out there making interior lighting mods for just this purpose, so I\\'m going back to focusing on outdoor lighting only.\r\n- Currently working on switching out timed lights that \\\"flip\\\" on and off for ones that can \\\"fade\\\" on and off over time to make them coming on and turning off not be so noticeable.[/size]\r\n\r\n[center][size=4][color=00CED1]Features:[/color][/size][/center]\r\n[size=2]- Lights now have timers (see \\\"Many Thanks\\\" section) and aren\\'t immersion breaking by being bright and visible during the daylight hours.\r\n- There are slight color variations in lights varying by location (i.e. winter climate lights are slightly blue/purple, temperate climate lights are slightly yellow, forested areas like Falkreath are slightly green).\r\n- Slight NPC interaction with light posts.[/size]\r\n\r\n[center][size=4][color=00CED1]Compatability with other mods:[/color][/size][/center]\r\n[size=2]- Working on compatability with [url=http://skyrim.nexusmods.com/downloads/file.php?id=11534]Whiterun Outskirts Market by RadioBoX[/url]\r\n- There MAY be some compatibility issues with new releases of [url=http://skyrim.nexusmods.com/downloads/file.php?id=8793]Detailed Cities[/url] and [url=http://steamcommunity.com/sharedfiles/filedetails/?id=14323&searchtext=]Detailed Outskirts[/url] by Dexicoder.  I\\'ve noticed he\\'s added some light sources that may conflict with the ones I\\'ve added.  I\\'m trying to work with him to try and resolve that.\r\n- I recommend that you also use one of the many realistic lighting mods out there.  Coupled with the .ini tweak, it lets you see that inn just off the main road at night when you\\'re looking for a place to rest from your travels.[/size]\r\n\r\n[center][size=4][color=00CED1]Known Issues:[/color][/size][/center]\r\n[size=2]- I have taken care of any and all floating fires that Cozier Villages had (it was less than 5, all in Whiterun proper).  Any other floating fires you see are likely caused by others mods, as I\\'ve seen them myself and informed their authors.  Aside from them being fixed by their authors, you can try loading a previous save file, as they seem to be save-file artifacts.\r\n- Will not be compatible with beta patches from Bethesda.  I just can\\'t predict what future patches will consist of, so for me to try and predict changes to make beta patches compatible (which they shouldn\\'t be beta for long anyway) would be a waste of time I could use to make the mod better overall.\r\n- There is some flickering in Markarth\\'s interior. A lot of it will come from light reflecting off of smoke effects near fires.  I\\'ll be working on ridding Markarth\\'s interior guards of their torches.  It would seem that the more lights that occupy a given space in the game makes nearby lights not reflect off of walls as intended.[/size]\r\n\r\n\r\n[center][size=4][color=00CED1]Installation:[/color][/size][/center]\r\n[Size=2]- Easiest with [url=http://skyrim.nexusmods.com/content/modmanager/]Nexus Mod Manager[/url].\r\n- Manual install: unpack the .rar file to your Skyrim/data/ folder.\r\n- Manual uninstall is as easy as removing the installed files.[/size]\r\n\r\n\r\n[center][size=4][color=00CED1]Many thanks to:[/color][/size][/center]\r\n[size=2]- Cipscis for the creation of and allowing use of his [url= http://www.creationkit.com/Light_Switch]Timed Light Switch script[/url]!  He\\'s also got a great site with resources for scripting for Fallout and Skyrim.  [url= http://www.cipscis.com]Be sure to check it out[/url]![/size][/font]\r\n\r\n",
  "categoryId": "53",
  "version": "120419",
  "author": "Big Dan",
  "createdUnix": "1329549735",
  "updatedUnix": "1334812237",
  "containsAdultContent": false,
  "uploadedBy": "BigDan6248",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44505",
      "name": "Cozier Villages 120318",
      "version": "120318",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "329",
      "fileName": "Cozier Villages 120318-10206.rar",
      "uploadedUnix": "1332093563",
      "modVersion": "120318",
      "virusScanUrl": "https://www.virustotal.com/file/d0ea45893453808bdbb9bdfd39d19e380182c21e96fe808956cc4a86e06e65cc/analysis/1406766447/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cozier%20Villages%20120318-10206.rar?fid=44505&ttl=1535770413&ri=8192&rs=8192&setec=ead0d1c041c3438e09f23e2f78125110"
    },
    {
      "fileId": "54479",
      "name": "Cozier Villages 120419",
      "version": "120419",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "497",
      "fileName": "Cozier Villages 120419-10206-120419.rar",
      "uploadedUnix": "1334812237",
      "modVersion": "120419",
      "virusScanUrl": "https://www.virustotal.com/file/3c343689b0c8f3efa6f70400db707d25feeac088f3f34b6ab9e78542ab12d79d/analysis/1406823265/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cozier%20Villages%20120419-10206-120419.rar?fid=54479&ttl=1535770414&ri=8192&rs=8192&setec=3c173becc28f3befd240143e202981ca"
    }
  ]
}