{
  "modId": 10242.0,
  "modName": "Sizaan Dein",
  "summary": "A luxurious three bedroom Dwemer retreat. \r\n\r\nVersion 1.0\r\nSkyrim Location 3 -8\r\nSouth of Whiterun, on the mountainside behind Pelagia Farm\r\n\r\n",
  "descriptionHtml": "Version 1.0\r\nSkyrim Location 3 -8\r\nSouth of Whiterun, on the mountainside behind Pelagia Farm\r\n\r\nUpon discovery you\\'ll find the entrance door locked with an adept level lock (a keyed entrance is planned to go along with a small quest line). \r\n\r\nIn and about Sizaan Dein you will find... \r\n\r\n-a ton of safe storage (only one container respawns...it is marked as \\'Trash Barrel\\')\r\n-all of the crafting tools you\\'re likely to need (wood chopping, cooking, smithing, smelting, tanning, alchemy and enchanting)\r\n-display room for your prized weapons and armor (note there are no mannequins...I found them too quirky so I suggest using Cobalt\\'s Advanced Mannequin mod...also, I did not include any display cases, as I found them pointless in that you have to almost stand on top of them and look down to see what\\'s in them...so instead, there are plenty of (over 20) weapon plaques. \r\n-six large (enclosed) bookcases.\r\n-six wardrobes plus a number of dressers bedside tables to better sort your different gear\r\n-safe in the master bedroom \r\n-three bedrooms (1 double and 2 singles)\r\n-the house in mostly decorated so it doesn\\'t feel empty but there is room for more.\r\n-being a Dwemer ruin, I scattered about some Dwarven armor and weapons ...that might be considered OP for a low level character but am hoping the locked entry would discourage low level looters! Anyway, it\\'ll have to do until I (learn how and) complete a quest line to make possession of Sizaan Dein a more appropriate achievement.\r\n-the former owner, Lord Imola, was old school and still worshiped Talos despite the Imperial\\'s recent stance on the man-god...hence his preference for retirement in Skyrim...and so had made a couple of personal additions to the home unbeknownst to the Empire.\r\n-Lia, at this point, is not interactive and will basically stay where you find her 24/7. She is tagged as essential though...and may steal your mounted weapons to fight with should you attack her.\r\n\r\nThat\\'s the vitals I guess. Hope you enjoy a bit.\r\n\r\nNote, there are no planned updates to the interior (except giving Lia more \\'life\\')...so nothing to jeapordize any of your stored items...rest assured you won\\'t lose your prized weapon collection via an update. \r\n\r\n\\'Back story\\'...\r\n\r\nLong lost and forgotten, the entrance to this lost keep on the mountainside south of Whiterun was buried and hidden under a pile of scrag and rubble due to a landslide. While the interior has been totally converted to a residence at great expense to the empire, the exterior still shows signs of the landslide that kept this ruin hidden for so long. This home was to serve as a residence to the distinguished Imperial war hero Lord Alfredo Imola. Now, Imola has disappeared and Sizaan Dein sits empty save for the lord\\'s servant girl Lia. There are no clues as to how or why Imola has gone missing at this time...though it must be said, he made his fair share of enemies in his storied career...perhaps in the days to come, something will reveal itself...until then, you should use Sizann Dein as a base of operations and wait for further information...",
  "categoryId": "67",
  "version": "1.0",
  "author": "EZ",
  "createdUnix": "1329572391",
  "updatedUnix": "1329573457",
  "containsAdultContent": false,
  "uploadedBy": "Eziador",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33136",
      "name": "Sizaan Dein",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "47",
      "fileName": "Sizaan Dein-10242-1-0.rar",
      "uploadedUnix": "1329573457",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6dc6e0267288c61c6f5d3f000c998d6ae29547157b7d86172d9557ce6a32ae08/analysis/1406692927/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sizaan%20Dein-10242-1-0.rar?fid=33136&ttl=1535770475&ri=8192&rs=8192&setec=accfbe463dbff2aea4be3ad6d48222ae"
    }
  ]
}