{
  "modId": 103.0,
  "modName": "YF4M - Younger Faces for _Human_ Males v1-2-5 - DELETED",
  "summary": "The humanoid male face looked a little..Okay a lot, old. I aimed to change that. Seems to work for most humanoid races.",
  "descriptionHtml": "-- SEVERELY OUTDATED, SEE [url=http://www.nexusmods.com/skyrim/mods/54568/?]CMO[/url] --\r<br />\r<br />MOKAINE&#39;S YF4MH 1.2.5 - Younger Faces For Human Males Version 1, Update 2, Series 2.\r<br />______________________________________\r<br />\r<br />Greetings everyone&#33; I know I seemingly abandoned this file, but that wasn&#39;t entirely my fault, and wasn&#39;t purposeful in the least. My life got a little hectic with my girlfriend, some mental troubles and then the blasted holiday season and all the chaos that comes with that, (not that everything was a bad thing,) but I honestly haven&#39;t played Skyrim recently until the last three days. I just remembered my own cosmetic mod after seeing so many others, and decided to update it. The older versions will be kept for archiving purposes, as I no longer have them, but the new version is a completely redone project with both Diffuse and Normal maps rather than just the former. Now mind, this face is smoother than even before, but there&#39;s a reason behind that: there are many Complexion settings, scars, dirt, facial hair, and color sliders, etc that add a grimy look to each individual character. Upon the release of the Skyrim version of the Creation Kit, I plan to do a sweep of the entire game and fix any NPCs who don&#39;t have any of those Complexions or sort, so that none of them have that baby smooth default face. Some NPCs may look odd (I haven&#39;t had sufficient testing time, only a few hours ingame, mostly looking for errors or odd things.) I had some initial problems with Farenger, the Court Wizard in Whiterun, and how his chin would take the texture, but I think I&#39;ve worked them out. I hope you all don&#39;t hate me for my abscence, but if it could&#39;ve been avoided I would have avoided it.\r<br />\r<br />tl;dr -- Sorry for being gone, here&#39;s your snazzy new younger male files. Completely redone.\r<br />______________________\r<br />Description:\r<br /> I was tired of the faces on male characters being quite overly aged, given that some of them were slim and young, and many others who would never compete in a fight, yet they all had the war-torn face of a man who had fought most of his life and was setting into his 40&#39;s. Well, I&#39;m 23, and I&#39;m pretty sure I didn&#39;t do much fighting in Cyrodil, if I am allowed to make up my own backstory (god-forbid I do) and didn&#39;t want to look like I had. Many of the people here, in Skyrim, infact, were new arrivals to the region, so the cold beating their flesh like that isn&#39;t even an excuse&#33; So I set off and did this. It&#39;s in its third version now from the initial, aka the 2nd update, but I&#39;m still not quite satisfied with it.\r<br />\r<br />At the time of taking these screenshots, I had removed all other mods I had installed, and was running base-game Skyrim as an Imperial on the Ultra preset. Typically, I use the PureENB Skyrim Enhanced Shaders Beta, and many upon many texture mods and my own settings in the .ini files, so for you, the results may vary. In my game, initially, when all of my mods were installed and switched on, the face looked much younger, but the default lighting in Skyrim is very grim and not very bright, so it brings out any wrinkled features in the normal, which were already smeared away almost entirely. I had an earlier version today, that didn&#39;t have this problem, but I couldn&#39;t get it to work without Farengar&#39;s chin looking like a donkey&#39;s backside. So I binned it, and started again from scratch. Hopefully this doesn&#39;t have that problem. \r<br />\r<br />tl;dr (again?&#33; Read people, READ&#33; ) - Shiny and new in my Ultra+PureENB Beta game, might be different for you. I mod for my tastes.\r<br />\r<br />In general I tried to make the faces more &#34;manly&#34; this time around, while keeping the younger, more innocent feel. Anyone who prefers the old files, they&#39;re there, or you can swap around the normal and diffuses and see which combo you like best. \r<br />____________\r<br />Thanks to:\r<br />Bethesda Game Studios\r<br />CaBaL for inspiration to begin texture work (unrelated to this project but he is my inspiration)\r<br />Young Guys, for being, well, young.\r<br />My Girlfriend for not chewwing my ass for making textures to make younger guys.",
  "categoryId": "29",
  "version": "1.2.5",
  "author": "Mok Chaoticran",
  "createdUnix": "1321161242",
  "updatedUnix": "1326253195",
  "containsAdultContent": false,
  "uploadedBy": "User_2530535",
  "primaryFile": null,
  "files": [
    {
      "fileId": "172",
      "name": "MokaineYoungerFacesMale",
      "version": "v.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "1643",
      "fileName": "MokaineYoungerFacesMale-103.rar",
      "uploadedUnix": "1321161302",
      "modVersion": "v.1",
      "virusScanUrl": "https://www.virustotal.com/file/85fcbce129278e0285e961294d01cbcf3ea5deca46dcd00785710012458388ed/analysis/1406328423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MokaineYoungerFacesMale-103.rar?fid=172&ttl=1535752676&ri=8192&rs=8192&setec=12f2b51130795a3a6952e8f4ee7115d6"
    },
    {
      "fileId": "212",
      "name": "Younger Faces with Reduced Brightness",
      "version": "v.1.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "1562",
      "fileName": "Younger Faces with Reduced Brightness-103.rar",
      "uploadedUnix": "1321204223",
      "modVersion": "v.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5528dd504160b1cad863794cdf592eea208c512fff803dcfe87b1457f41f0bcd/analysis/1406329063/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Younger%20Faces%20with%20Reduced%20Brightness-103.rar?fid=212&ttl=1535752676&ri=8192&rs=8192&setec=60711806817f367cc1431646c7156679"
    },
    {
      "fileId": "18054",
      "name": "YF4M - Younger Faces v1-2",
      "version": "v.1.2",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "1401",
      "fileName": "YF4M - Younger Faces v1-2-103.rar",
      "uploadedUnix": "1326064733",
      "modVersion": "v.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/da65c9fc027882edf9e7f7a6718c788acbc60b50dd1de171cc5de1d373eb65bd/analysis/1406595432/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YF4M%20-%20Younger%20Faces%20v1-2-103.rar?fid=18054&ttl=1535752677&ri=8192&rs=8192&setec=f0d52525c06fceefbf9127efa9260802"
    },
    {
      "fileId": "18761",
      "name": "YF4M - Younger Faces v1-2-5",
      "version": "v.1.2.5",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "1382",
      "fileName": "YF4M - Younger Faces v1-2-5-103-v-1-2-5.rar",
      "uploadedUnix": "1326253195",
      "modVersion": "v.1.2.5",
      "virusScanUrl": "https://www.virustotal.com/file/924dcc60dd2a13f9c0669425f5b54b98bc069be1fe6ece63bee7abb9ce7f7cbe/analysis/1406601941/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YF4M%20-%20Younger%20Faces%20v1-2-5-103-v-1-2-5.rar?fid=18761&ttl=1535752677&ri=8192&rs=8192&setec=f5adfeb51fd9cc5b8ed76459cdedbb7a"
    }
  ]
}