{
  "modId": 10307.0,
  "modName": "No leveled and totally revised world - inmersive",
  "summary": "World with no levels for role players, fully revised to avoid greatest power differences between low and high levels. Also, combat gameplay settings changed to do the combat more realistic, interesting and difficult. In addition, many other changes to try to get a more immersive experience. See the readme.",
  "descriptionHtml": "INSTALLATION: Put the archives in your Skyrim data folder, and select the .esp in the launcher. 7\r\nUNINSTALLATION: Deleselect the .esp archives in the launcher, and paste in your data folder the carpet \\\"textures\\\" contained in \\\"Uninstall textures\\\" (all are in the .rar). \r\n\r\n(All the gramatical errors you see are by the Google translator, this is not my native language)\r\n\r\n- I edited the classes, characters, and lists of items to flush all the armor and the game animals appear from level 1, and all the NPCs have invariable level. Vendors sell all weapons except draedric and dragon from level 1. Some NPC will be lower levels, and other higher, but will generally be of a level higher than 15, and the big bosses can reach level 50.\r\n- I edited the races, including the playable races. Each has its own characteristics, very different from each other. Now, no bandit will die at the first blow, and will be comparable in difficulty level with any other human NPC.\r\n- Dragons are much harder to kill.\r\n- I have reviewed one by one ALL the characters in the game, now they are all consistent with its history: for example, ex-soldier Amren now is a level 20 warrior, Ulfbert, finally is a war-bear ... And there are some changes in the apariences: Lydia now not looks like a cheap cabaret in armor, Stenvar (named Haleth)  is no longer a good-natured daddy...\r\n- Now, the rich and powerful in the game have more than poor steel swords and armor ... magicians tend to use daggers of glass, and all the orcs have weapons of orichalcum.\r\n- Regarding the combat system, the arcs go further, and the arrows do more damage. The melee weapons do more damage, and finishing moves and attacks are powerful extra damage, and the sneak melee. The shields lock almost always, but the two-handed weapons, not.\r\n-I have reviewed all the armor: now, there is something more like light armor, medium armor and heavy armor, as in Morrowind. The leather armor and scales are light. Elven, Glass and Dragonscale, are heavy. And all the heavy armor are ... more than heavy: take a spell that reduces speed, sneak, magickal and more, but have a much higher frame rate to compensate. The heavyweight now fight like heavyweight.\r\n- Animals run more faster; big animals take more damage (don´t worry, this is for adjuste the general gameplay mechanic, there are no problems to kill they with a companion, or if you are in high levels), and wolves are less suicidal.\r\n- Arrows do bleeding damage\r\n- 25% critical damage bonus, if you not wear helmet (first level of the first perk of one weapon, two weapons and marksman sustitution and rebalanced). Is to compensate the bonus of the perks with full set of armor; no helmet is more stetic, hehe.\r\n- All the characters of the game, included yours, go up 1 point of Health, Magicka or Stamina by level, not 10. This is to avoid unbalanced power differences between the different levels of the NPCs and player, and is the fundamental change in my mod (there was already a \\\"world deleveled\\\" mod in Nexus). The best characters are better by their improved skills and armors, not by their unrealistic health bars... Althougt you had many levels, a small forest elf can not take many more blows with a hammer than a bodybuilder orc .... I think raising the skills and perks you can build your character without any problem, without the need that your little elf takes 500 of health ... \r\n- Looking for realism, the rate of regeneration of life and magic has fallen: 3 to 0.5, and stamina has increased from 3 to 5. \r\n- One of the bigger changes in the play mechanics, also looking for realism, is the reduced charge capacity, that is relationed with the Health, and can´t be improved (only with magic items). This represents the strenght of the player; Orcs have 170 charge, but Khajit or Wodden Elf have only 50 charge, so that is very difficult wear a set of heavy armor with a Khajit, within the \\\"conditionating\\\" perk. Works fine with \\\"bandoliers mod\\\".\r\n- I have 20 levels played with this mod, and the sensation of progress but not overpower is very good. This mod was created to play at adept level, because is not necesary select a high difficulty, which have fake damage, to have epic battles. With my mod, a companion is necessary if you want battle against a group of bandits in adept level.\r\n\r\n\r\nIMPORTANT!\r\n\r\nYour character does not start with the health, Magicka and stamina with which should start as the race of your choice (I do not know how to fix it). So, for now, the first time you play with my mod, make use of the command \\\"player.setav health ...\\\", \\\"player.setav stamina ...\\\", and \\\"player.setav magicka ...) You must do this, if you want a balanced experience, because all the NPC´s in the game (with my mod) has this base values at level 1 (and some changes in the abilities). Here is the table with the values you must imput:\r\n\r\n- Imperial: 150 health, 150 stamina and 150 Magicka (the voice of the emperor is replaced by \\\"imperial education,\\\" which gives a bonus to speech, and a spell to convince 1 time per day, and there is no longer the unrealistic \\\"imperial luck\\\").\r\n- Argonian: 120 He, 150 Ma, 150 sta. (Hitskin is replaced by a permanent bonus 5 to armor and 15 to sneak)\r\n- Khajit: 100 hea, 120 ma, 200 sta (addition of permanent bonus 40 to sneak)\r\n- High elf: 140 hea, 200 ma, 120 sta \r\n- Breton: 120 he, 200 ma, 130 sta\r\n- Wooden elf: 100 hea, 170 ma, 180 sta (changed unrealistic command animal for 120 s. detect life)\r\n- Dark Elf: 130 hea, 170 ma, 160 sta \r\n- Orc: 220 hea, 100 ma, 140 sta.\r\n- Nord: 200 hea, 100 ma, 150 sta.\r\n- Redguard: 150 hea, 100 ma, 200 sta.\r\n\r\nThe differences over the total are to compensate the race powers.\r\n\r\n- The damage unnarmored of all the races are relationed with health (with exception for Khajit and Argonian), that represents \\\"strength\\\". Weight you can carry is calculated with -50 over the health. (Stamina represents the \\\"fitness\\\"). \r\n\r\nI´m playing with no bugs or problems with mods like Jaysus swords or Cloaks of Skyrim; with many mods that add new items to the forge or the game, like \\\"bandoliers\\\", etc, and with mods that change the gameplay mechanics, and there are no bugs.\r\n\r\nYou can do with this mod all what you want, but in consideration of the 65 hours I´d been doing (as recorded by Steam), I want see my name in the credits! \r\nPD: Please, report me any bug you find.\r\n\r\n",
  "categoryId": "24",
  "version": "0.7",
  "author": "Indaril",
  "createdUnix": "1329604301",
  "updatedUnix": "1338593060",
  "containsAdultContent": false,
  "uploadedBy": "Indaril",
  "primaryFile": null,
  "files": [
    {
      "fileId": "36614",
      "name": "Noleveledworld05",
      "version": "0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1184",
      "fileName": "Noleveledworld05-10307.rar",
      "uploadedUnix": "1330170115",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/d72611f8e9973b83675af6b26bff739bba9da12de85984ec3b469764a5da1908/analysis/1406712185/",
      "changelogHtml": " - Bows do bleeding damage <br/> \n - Animals and Horses run more faster <br/> \n - Attack with no helmets do 25% more of critical damage (edited armsman, barbarian and overdraw perks) <br/> \n - Sneak perks revised, now more balanced. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Noleveledworld05-10307.rar?fid=36614&ttl=1535770577&ri=8192&rs=8192&setec=ef2c7eb0e2f3785fc9c69068940d0000"
    },
    {
      "fileId": "37129",
      "name": "Noleveledworld06",
      "version": "0.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1104",
      "fileName": "Noleveledworld06-10307.rar",
      "uploadedUnix": "1330272914",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/fdbc8f0c03fbf881d1af1fabd66f6234e72cd02fc6a635d38a2a521fe0e1654b/analysis/1406714835/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Noleveledworld06-10307.rar?fid=37129&ttl=1535770577&ri=8192&rs=8192&setec=99c64dbe2a889bd4e36af4ce977d6710"
    },
    {
      "fileId": "62779",
      "name": "Noleveledworld07",
      "version": "0.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1104",
      "fileName": "Noleveledworld07-10307-0-7.rar",
      "uploadedUnix": "1337604459",
      "modVersion": "0.7",
      "virusScanUrl": "https://www.virustotal.com/file/be952a5725172f04cf57d2995a55636de512f0f0bbee2c45ce774e53af4d5f34/analysis/1406906945/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Noleveledworld07-10307-0-7.rar?fid=62779&ttl=1535770578&ri=8192&rs=8192&setec=9e72b894fdff35c54618ea80ca6da8f1"
    },
    {
      "fileId": "65197",
      "name": "Noleveledworld071",
      "version": "0.71",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "467",
      "fileName": "Noleveledworld071-10307-0-71.rar",
      "uploadedUnix": "1338593060",
      "modVersion": "0.71",
      "virusScanUrl": "https://www.virustotal.com/file/6e91016157be5b9279e3b006b00bcae380b7f1af810a12f8543c4653bd0c0d4d/analysis/1406930704/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Noleveledworld071-10307-0-71.rar?fid=65197&ttl=1535770578&ri=8192&rs=8192&setec=d187d87cbcab63e94aea6d584446bf8e"
    }
  ]
}