{
  "modId": 10317.0,
  "modName": "Gersillas Riverwood House",
  "summary": "Nice little house a bow shot from Riverwood",
  "descriptionHtml": "Name: Gersilla&#39;s House\r<br />Version: 1.done\r<br />Date: 2/18/2012\r<br />Category: Abodes - Player Homes\r<br />Author: Malachi Delacot\r<br />Requirements:  Official Skyrim Patch  1.421.0.4  or later is needed.\r<br />\r<br />Description\r<br />===========\r<br />While Gersilla is out adventuring ( causing mayhem ), you are welcome to use her Riverwood home until she gets back.  She&#39;s even left a suit of armour and a few weapons that she no longer needs but you may be able to put to use ( if you are beginning the game )\r<br />When I started the game, before entering Riverwood, I saw this was a good place to put a house but had to wait for the Creation Kit to make it happen.  Other people beat me to releasing their mods first.\r<br />Makes for a good starter home until you find something you like better....\r<br />\r<br />Location\r<br />========\r<br />A bow shot south west of Riverwood.  If you fast travel; upon arrival, turn around and you should be able to see her home.\r<br />\r<br />Details\r<br />=======\r<br />Since Gersilla is out most of the time, she only needs a place to eat, sleep, store things she&#39;s collected, and do smithing.  There are 11 unmarked chests to store things in. Five strong boxes for jems, jewlery, etc. are on top of the double bookcase.  Weapon racks will hold up to 17 weapons.  A handy place to cook is by the fireplace, and there is a wardrobe for extra clothing.  Food containers respawn...chests should not. All your smithing needs are on the west side of the house.  Archery target in back.  If you need to chop wood, the sawmill is a short distance away.  There is no enchanting table, nor an alchemist lab since Gersilla never uses enchanted weapons, nor does she mix potions. Also, no stable since Gersilla has a phobia of horses and never rides one.\r<br />\r<br />Please note:\r<br />Gersilla&#39;s House is &#34;as is&#34;...meaning there will be no changes to suit people that ask for something else added.  It&#39;s build to suit her needs.  Remember, you don&#39;t own the place, you are a guest there while she&#39;s gone. But don&#39;t count on her getting back soon because she&#39;s my character in my game.\r<br />Other really nice homes close by that you might like that are much better:\r<br />Thistle Cottage:\r<br />http://skyrim.nexusmods.com/mods/10313\r<br />Willow Creek Cottage:\r<br />http://skyrim.nexusmods.com/mods/29313\r<br />\r<br />Install\r<br />=======\r<br />1. Unzip to your  SkyrimData  folder.\r<br />2. Start Skyrim Launcher, click &#39;Data Files&#39;, place a checkmark beside the .esp file.\r<br />\r<br />Uninstall\r<br />=========\r<br />1. Start Skyrim Launcher, click &#39;Data Files&#39; , uncheck the .esp file.\r<br />2. Delete the .esp file from your  SkyrimData  folder\r<br />\r<br />Incompatibility  ( minor conflict )\r<br />===============\r<br />Riverwood Cabin  by Phong.  His stairs are over Gersilla&#39;s and the walkway goes under her house.  Phong&#39;s house is further up the hill, behind Gersilla&#39;s place.  You can find his mod here:  \r<br />http://skyrim.nexusmods.com/downloads/file.php?id=9096&navtag=file/images.php?id=9096&tab=3\r<br />Other than the walkway and stairs, both mods should work together.\r<br />Any other incompatibility:  ...to be honest, I don&#39;t care...the mod works fine in my game...but if you have conflicts, you&#39;ll have to either live with it or pick the mod you like the best.\r<br />\r<br />Known Issues or Bugs\r<br />====================\r<br />Companions may have trouble getting up the stairs, and will usually go a round about way.  It may take them a minute to get to the house, but they should be able to.\r<br />If you have Thistle Cottage by Carah, load Gersilla&#39;s House after it or there will be a land tear south of the smithing area.  You can get her mod here:  \r<br />http://skyrim.nexusmods.com/downloads/file.php?id=10313&navtag=file/images.php?id=10313&tab=3\r<br />\r<br />Contact\r<br />=======\r<br />If needed, PM me in Nexus, or email:  delacot@hotmail.com\r<br />\r<br />Credits\r<br />=======\r<br />Thanks to Bethesda for creating Skyrim.\r<br />Thanks to TESNexus.com for the one-stop-shop resource for authors and players.\r<br />Thanks to LHammonds for the Readme Generator this file was based on.\r<br />Thanks to The Goddess for creating us all.\r<br />Thanks to Carah for putting the house in place and making it possible to gain entry and exit the house.\r<br />Thanks to Gersilla for sharing her home.\r<br />\r<br />Tools Used\r<br />==========\r<br />Readme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r<br />Bethesda&#39;s Creation Kit\r<br />My computer....\r<br />\r<br />Licensing/Legal\r<br />===============\r<br />Do whatever you want with this mod but don&#39;t complain to me if it doesn&#39;t work or your PC blows up.  If you use this mod as a base for your own, credit for my work would be appreciated.\r<br /> ",
  "categoryId": "67",
  "version": "1.done",
  "author": "malachi delacot",
  "createdUnix": "1329607230",
  "updatedUnix": "1329686878",
  "containsAdultContent": false,
  "uploadedBy": "Malachi Delacot",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33845",
      "name": "Gersillas House",
      "version": "1.done",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "156",
      "fileName": "Gersillas House-10317-1-done.rar",
      "uploadedUnix": "1329686878",
      "modVersion": "1.done",
      "virusScanUrl": "https://www.virustotal.com/file/4279e750d84a62bc328df30ecf8e700e6fa0ecc0ed37db0ae014c06e9aece807/analysis/1406696523/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gersillas%20House-10317-1-done.rar?fid=33845&ttl=1535770586&ri=8192&rs=8192&setec=8a66369a20344dd8b12187158af2cbd8"
    }
  ]
}