{
  "modId": 10319.0,
  "modName": "Spouse Life by Ekkii",
  "summary": "Fixing the Recluse Spouse Syndrome one city at a time.",
  "descriptionHtml": "[center][img]http://i.imgur.com/6ioFM.png[/img][/center]\r\n\r\nThe night after their wedding, Theodrik and Senna returned home from Riften. The Thane of Whiterun was excited to show his wife, a priestess of Dibella, thier new home. Sitting in front of the fire, resting after a long trip, Senna and Theodrik started making plans for the future. One of those plans was for Senna to set up a store in Whiterun while Theodrik went out on the road. After all, a woman like her wasn't born to be a stay-at-home wife.\r\n\r\nEarly the next morning, while her husband was gearing up, Senna went downstairs to eat breakfast and then headed out to the market to get her new store ready...\r\n\r\n[center][url=http://www.skyrimgems.com][img]http://www.skyrimgems.com/images/badge_featured_sm.png[/img][/url][/center]\r\n\r\n\r\n[center][img]http://i.imgur.com/d7eAS.png[/img][/center]\r\n\r\nThis mod aims to change one of the biggest issues of marriage in Skyrim: the Recluse Spouse. The Dragonborn can find love in lots of places, with lots of different people ranging from fellow adventurers to merchants and common folk. But all these men and women say good-bye to their life once they get married, and become little more than a wandering decoration in your Dovahkiin's house. Almost out of boredom, they set up a shop in town and even manage to earn some coin each day without ever leaving their home. Ever. We seek to give them back their life, lest they go all Annekke Crag-Jumper on your hero and take off with the first adventurer that comes through town.\r\n\r\n\r\n[center][img]http://i.imgur.com/KXpRF.png[/img][/center]\r\n\r\nThere are two changes that you'll notice after installing this mod: the first one happens in the Whiterun Market, where Carlotta Valentia's double stall of fruits and vegetables has been divided in half. Now the second stall will display some miscellaneous items for a completely new shop.\r\n\r\nThe second change will be the behaviour of your spouse, provided they live with you in Breezehome. In the future we will cover the rest of cities, and if possible the new houses added by Hearthfire, but for now this only works for Whiterun.\r\n\r\nYour spouse new day will start at 6 AM, when they'll get up, fix a quick breakfast and then head out to their stall. A clean stall attracts customers the most, so they'll spend some time tidying up before the townsfolk start arriving. The rest of their morning and part of the afternoon they'll be busy doing business, but around 5 PM the shop will close and your spouse will return home for diner. After cooking and eating, they will head out to the Bannered Mare to chat, drink, fight, eat or whatever they please, returning home somewhere around 10 PM. After a couple of hours resting or reading a book, they'll go upstairs to the master bedroom and sleep until the next morning.\r\n\r\n\r\n[center][img]http://i.imgur.com/5WdiR.png[/img][/center]\r\n\r\nSpouse Life has been developed to work together with [url=http://skyrim.nexusmods.com/mods/9000/]Breezehome Basement by Ekkii[/url]. It works just fine by itself, but if you're running the basement your spouse will also have some activities there. If you feel like adding a cozy, functional and lore-friendly basement to your Breezehome, there's a bundled plug-in in the Files tab of [url=http://skyrim.nexusmods.com/mods/9000/]Breezehome Basement[/url] that includes the current version of Spouse Life.\r\n\r\n\r\n[center][img]http://i.imgur.com/WpT2Q.png[/img][/center]\r\n\r\nThis mod has been rebuilt and tested with the latest version of Skyrim. We don't know if it'll work with older patches (and why would you be using an old patch anyway?).\r\n\r\n[b]INSTALLATION[/b]\r\n\r\nThe installation is simple:\r\n\r\n[b]Nexus Mod Manager users:[/b]\r\nJust click 'Download with Manager'. Once it's downloaded simply activate it in NMM.\r\n\r\n[b]Manual installation:[/b]\r\nDownload the file and unzip the contents of the file to your Data folder. Activate the plug-in with your mod-manager of choice or in the Data Files section of the Skyrim Launcher.\r\n\r\n[b]For both methods:[/b]\r\nIf your spouse is currently living in Breezehome, talk to them and select the option to move elsewhere, then talk to the again and move them back to Breezehome. This is done to ensure they get the new behaviours and everything runs as it's supposed to.\r\n\r\n[b]UNINSTALLATION[/b]\r\n\r\nIf for some strange reason you wish to uninstall this mod (and I can't think of a reason why you'd want to do that), first tell your spouse you want to move to another house and save your game. After uninstalling the mod you can bring them back to Breezehome with the vanilla, creepy, depressive and reclusive behaviour.\r\n\r\n[b]Nexus Mod Manager users:[/b]\r\nDeactivate the mod in NMM.\r\n\r\n[b]Manual installation:[/b]\r\nDe-activate the plug-in with your mod-manager of choice or in the Data Files section of the Skyrim Launcher, then remove \"Ekkii Spouse Life.esp\" from your Data folder.\r\n\r\n[color=#ff0000][b]UPDATING[/b][/color]\r\n\r\nThere are no special measures to take here, simply replacing the .esp file works. The only thing you need to do AFTER loading your game with the new version is to tell your spouse you're moving someplace else and immediately bring them back to Whiterun so the correct behaviours are assigned to them.\r\n\r\n[b]CONFLICTS AND KNOWN ISSUES[/b]\r\n\r\nThis mod has been carefully crafted to avoid conflicts. In fact, we use it with several other mods without any issue. The only possible conflict is with other mods that affect the [i]RelationshipMarriageFIN[/i] quest, which was modified to assign the new sandbox packages or makes changes to the WhiterunBreezehome cell. Anything else should work just fine.\r\n\r\nThere is a known issue where the dialogue option to tell your spouse to move somewhere else once they're settled in a house will not appear. This seems to be an issue with Hearthfire itself, and not with this mod. We were able to reproduce the issue in different saves, with and without our mod but weren't able to pinpoint the cause. The best workaround we found was to buy Breezehome before starting the marriage quest, but even then the dialogue option disappeared for one of our test characters without using this mod.\r\n\r\n[b]CREDITS AND PERSMISSIONS[/b]\r\n\r\nAuthor: Ekkii\r\nContact: Message elgatoenlaluna on the Nexus Sites.\r\n\r\nDo not modify this file whitout asking first. We've allowed other authors to tweak our mods in the past, so if you have something interesting in mind chances are we're going to say yes. Also, do not, for any reason whatsoever, upload this mod to the Steam Workshop. Neither Ekkii nor I use it or have any interest in using it, and we will not provide any updates or help over there. Thanks!",
  "categoryId": "78",
  "version": "0.28",
  "author": "Ekkii",
  "createdUnix": "1329607915",
  "updatedUnix": "1360371817",
  "containsAdultContent": false,
  "uploadedBy": "elgatoenlaluna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33397",
      "name": "Ekkii Spouse Life v0dot1",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "111",
      "fileName": "Ekkii Spouse Life v0dot1-10319.zip",
      "uploadedUnix": "1329607972",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/75dfe6703fe2c5877abd0215b6f13d03ba5dd21de42b5d35db89d5bbef989990/analysis/1406694007/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ekkii%20Spouse%20Life%20v0dot1-10319.zip?fid=33397&ttl=1535770588&ri=8192&rs=8192&setec=54727790801c7b82d60c720e8f0b261c"
    },
    {
      "fileId": "35569",
      "name": "Ekkii Spouse Life v0dot2",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Ekkii Spouse Life v0dot2-10319-0-2.zip",
      "uploadedUnix": "1329970951",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/2103f8e1f0271c6ffea2bd340aa69ab1d1112a0b693238806cf420dbd22f9606/analysis/1406706972/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ekkii%20Spouse%20Life%20v0dot2-10319-0-2.zip?fid=35569&ttl=1535770588&ri=8192&rs=8192&setec=115e75a994dc80a467c228303f4af912"
    },
    {
      "fileId": "1000002024",
      "name": "Spouse Life by Ekkii - Standalone",
      "version": "0.28",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "Spouse Life by Ekkii - Standalone-10319-0-28.7z",
      "uploadedUnix": "1358067512",
      "modVersion": "0.28",
      "virusScanUrl": "https://www.virustotal.com/file/b68ae2fe54d2bbb847524205bf9c2f339b66c44bde791d933aafcd2269d5cc4c/analysis/1407351025/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spouse%20Life%20by%20Ekkii%20-%20Standalone-10319-0-28.7z?fid=1000002024&ttl=1535770589&ri=8192&rs=8192&setec=df150dd359a6295255bfb009f6c7ebf4"
    },
    {
      "fileId": "1000008194",
      "name": "Spouse Life by Ekkii - Standalone No Hearthfire",
      "version": "0.28",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "22",
      "fileName": "Spouse Life by Ekkii - Standalone-10319-0-28.zip",
      "uploadedUnix": "1360371817",
      "modVersion": "0.28",
      "virusScanUrl": "https://www.virustotal.com/file/ec42e8c79e82223afec804b0677d2c1709ee24d0b44634a6e749f86562eaa8a2/analysis/1407405978/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spouse%20Life%20by%20Ekkii%20-%20Standalone-10319-0-28.zip?fid=1000008194&ttl=1535770589&ri=8192&rs=8192&setec=ee33d702964558a255f43e72cde8eec5"
    }
  ]
}