{
  "modId": 10323.0,
  "modName": "Gamepad Expanded",
  "summary": "This improves the controls of the XBox 360 Gamepad to improve ease of use, improve menu navigation, and most importantly increase the number of available hotkeys to 8.",
  "descriptionHtml": "This changes the XBox 360 Gamepad controls to improve ease of use, improve menu navigation, and most importantly to increase the number of available hotkeys to 8.\r\n\r\n---Details---\r\nWhen assigning Hotkeys, up/down/left/right function as 4 of the possible keys. The other 4 include diagonal directions such as up+right or down+left.\r\nThere is very little need to worry about using diagonal keys accidentally, since it will not activate unless you press them simultaneously. This means that if, for example, you press left and accidentally slide up immediately after so that you are now pressing both, it won\\'t activate left+up.\r\n\r\nB now activates the Favorites. While navigating Favorites, you must use the left stick to move up and down the list.\r\nSelect/Back now activates the Menu, rather than B.\r\nTo Wait, you must press A+B simultaneously.\r\nTo Quicksave, press Start+Select simultaneously.\r\n\r\nWhen navigating menus, B should now always function to cancel or close down the menu.\r\nWhile navigating your Map, the 8 Direction keys can now be used to move the screen directly, rather than having to drag the cursor to the side.\r\n\r\n---Installation---\r\nTo install the mod, first drop the Interface folder into your Data folder within the Skyrim game directory.\r\nAfter you\\'ve done this, go in-game, enter the Controls menu, and press Y to reset the controls to Default.\r\n\r\n---Uninstallation---\r\nTo uninstall the mod, first delete the files added by this mod. Then go in-game, enter the Controls menu, and once again press Y to restore the controls to Default.\r\n\r\n---Changes---\r\n1.2: Start has reverted to it\\'s base function of opening the Journal, and Select now opens the Menu, for compatibility with SkyUI.\r\n1.1: Start+Select can now be pressed to activate Quicksave.",
  "categoryId": "42",
  "version": "1.2",
  "author": "Ronyn",
  "createdUnix": "1329609898",
  "updatedUnix": "1377114907",
  "containsAdultContent": false,
  "uploadedBy": "Shadow_Dragyn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000048638",
      "name": "Gamepad Expanded",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Gamepad Expanded-10323-.rar",
      "uploadedUnix": "1377114907",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5272ae942180f784aa5cda14ce72e77226df8fd4e00724d6ae8ef9f8458e4ccd/analysis/1407692113/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gamepad%20Expanded-10323-.rar?fid=1000048638&ttl=1535770594&ri=8192&rs=8192&setec=77d82482d79efed0f1cec3b0233c2569"
    }
  ]
}