{
  "modId": 10322.0,
  "modName": "petite lass Rebecca",
  "summary": "Adds a little girl Rebecca to Riverwood Giant Inn, you can recruit her if you need an apprentice...",
  "descriptionHtml": "I was messing with the creation kit and came up with this. I didnt like the children in Skyrim as they look awful, the boys and girls share the same face lol. So I decided to do a test and add a girl into the game. Well the job was simple, I just edited her height and made her a follower. \r\nRebecca, a girl they found wandering in the wilderness then brought her back to Riverwood Giant Inn to help out with the chores. A beggar armed only with a dagger to protect herself. You can recruit her and have her accompany you on your journey and quests, she\\'s quite capable and can put up with a fight (she\\'s mastered with human melee lvl7) Being the master yourself, you can equip her with your armor and weaponry...\r\n\r\ngood luck becky!\r\n\r\nNote - \r\nAll I did was made a full grown character shorter to look more like a child, so I\\'m not responsible if the user used a nude mod over this girl NPC.\r\nI was not able to take a screenshot for the girl, sorry about that\r\n\r\nI can\\'t assign her with a female girl voice, doing that makes unrecruitable for a follower.\r\nI given her the marriage faction attributes, I hope it works as I have yet to test it out myself.\r\nShe has a nasty habit of cutting herself when being idle \r\n\r\nThank you kicknnit for the image\r\n\r\nTITLE edited for good reasons. Thanks my friend, vexxallarius for your advise. Appreciate it.",
  "categoryId": "33",
  "version": "1.00",
  "author": "simplesim",
  "createdUnix": "1329609473",
  "updatedUnix": "1329609715",
  "containsAdultContent": false,
  "uploadedBy": "simplesim",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33406",
      "name": "little girl Rebecca",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "little girl Rebecca-10322-1-00.zip",
      "uploadedUnix": "1329609715",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/0c6a17c05041dc97fd9035ab8ba252b8bf5de0080a5fdcd81aa2c294d0a41313/analysis/1406694010/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/little%20girl%20Rebecca-10322-1-00.zip?fid=33406&ttl=1535770592&ri=8192&rs=8192&setec=d6faa4fd0e9f1538880b77486043d359"
    }
  ]
}