{
  "modId": 10336.0,
  "modName": "Shenk Thievery Overhaul",
  "summary": "This mod aims to make thievery in Skyrim more rewarding, as well as a bit more challenging. It is being built in 3 phases, each of which will go a bit farther towards satisfying your inner kleptomaniac.",
  "descriptionHtml": "This mod aims to make thievery in Skyrim more rewarding, as well as a bit more challenging. It is being built in 3 phases, each of which will go a bit farther towards satisfying your inner kleptomaniac.\r\nMain features:\r\n- Added stealthy ways of getting around the five major cities (Solitude, Windhelm, Whiterun, Markarth and Riften). These can include tunnel systems, rooftops, ladders, hatches in roofs etc.\r\n- Added vaults beneath the five major cities. These have a large City Guard presence and require keys to access, but have plenty of loot. So far only Solitude, Markarth and Whiterun vaults are completed.\r\n- Added NPCs to guard various shops and houses during night hours. Poor areas may have Guard Dogs, shops and middle-class have Night Watchmen, and richer residents have hired Housecarls.\r\n- NPC thieves sometimes prowl targets at night. These are much smarter than the Riften thieves, they sneak around specific houses and shops and will steal items laying out. They only head out on specific days of the month, so seeing them can be somewhat rare.\r\n- Three varieties of specialty arrows have been added. Immolation Arrows light the target on fire, Noisemaker Arrows cause the throw voice effect at their impact point, and Blinding Arrows knock their target out of combat for a short time. These arrows can be found in various Thieves Guild caches, or purchased from Tonilia in the Thieves Guild HQ.\r\n- Added additional loot and items to houses and shops across Skyrim. Not a huge amount, but enough to hopefully make burglary feel a bit more rewarding.\r\n\r\nPhase 3 (Current version 3.31):\r\n- Rebuilt all mod cell navmeshes by hand. This should take care of *some* crashes.\r\n- Relocated a few vault keys that were in bad locations.\r\n- A few small visual glitches fixed.\r\n- The Whiterun vault is in. It is a bit simpler than the others due to Whiterun being the first city commonly arrived at. Enterprising thieves may locate a map hinting at the back door inside the Whiterun Keep Tunnel.\r\n- Keys to display cases and chests (Not vault keys) are now placed on the proper NPCs via a hidden quest. The same system is used to populate the new arrows into Tonilia\\'s merchant selection in the Thieves Guild. This should help with conflicts.\r\n- Explosion scene in the Markarth Vault tightened up a bit, and hopefully will no longer explode after the scene is complete. The explosion scene will also correctly happen if Rennard the worker is dead.\r\n\r\n- The Markarth Vault has been located by the Thieves Guild. This large underground Dwemer ruin has plenty of goodies for you to get your hands on. Assuming you can get past the Markarth City Guard force.\r\n- The Markarth Vault has a couple pieces of unique loot for you to find as well.\r\n- Night Watchman now properly leave the shops when they are off-shift. No more dealing with their aggressiveness during quests.\r\n- Guard Dogs now properly attack the player while trespassing at night.\r\n- Tweaked the NPC thief AI, as well as added quite a few more thieves targetting houses (Player houses are not an eligible target for the NPC thieves, don\\'t fear.)\r\n- Higher-level Housecarls (Levels 30 to 50) now select from a higher level of weapon.\r\n- Cleaned out a few more dirty edits.\r\n- Fixed rank 3 Housecarls inheriting properties from dogs (What the hell, CK)\r\n- Fixed an issue with explosion effects in the Markarth Vault not stopping after the scripted scene.\r\n- Fixed the improperly locked Blacksmith Vault door in the Markarth Vault.\r\n\r\n- Rumors abound of a vault hidden beneath Solitude storing large amounts of loot. While it is extremely well guarded, the benefits are sure to outweigh the risks. If you can find a key or a way in, that is.\r\n- Solitude Sewers and Windhelm Walls guards now properly warn you and arrest you for trespassing. They probably just needed valium.\r\n- Additional collision fixes to the rooftops in Windhelm and Riften, as well as a bit of beautification on the roofs.\r\n- Added a couple thief caches. Keep your eyes open for the cache shadowmark.\r\n- Added Noisemaker Arrows, Immolation Arrows and Blinding Arrows. Noisemakers produce the Throw Voice effect wherever the arrow strikes, Immolation Arrows cause a burst of flame on the target. Blinding arrows cause targets in an impact radius to drop combat for a brief time. These arrows can be found in Thief Guild caches as well as bought from Tonilia in the Guild Headquarters.\r\n\r\nPhase 2 (Complete):\r\n\r\n- Additional loot and items have been added to shops, houses, castles and farms across the land. Make sure to check in all those dark corners.\r\n- Some shops have very desirable items stashed away in display cases or locked chests. These items require keys, so you\\'d better see about locating them.\r\n- Lower-income residents of Skyrim have purchased Guard Dogs. While not much of a combat threat, if the dogs get irritated by your presence they can wake the other residents.\r\n- Shopkeepers have grown tired of their wares being stolen, they have hired Night Watchmen. These guards wander around the shops after hours hunting thieves.\r\n- Rich residents and prominent members of cities have set their Housecarls to watching over their property. Housecarls are quite nasty customers in a fight and come well-equipped.\r\n- NPC thieves sometimes prowl the night, breaking into selected houses and shops.\r\n- Most of the guards in the hold keeps have altered their patrols slightly, attempting to cover previous blind spots.\r\n\r\n\r\nPhase 1 (Complete):\r\n\r\n- The Solitude Sewers are now open. These tunnels have small access ways to the majority of the locations in Solitude. Be warned, the city guards also know this and have added it to their patrols.\r\n- The Thieves Guild has snuck in ladders and wooden bridges to Windhelm, allowing you rooftop access to some of the various locations. A passage and storage area through the western city walls has also been added, linking to the remaining locations. The city guards have set up a small barracks in the area, however.\r\n- A forgotten section of the Riften Ratway has been opened, giving you access to the lower canals destinations. Ladders have also been smuggled in to allow you access to some of the city rooftops with access hatches.\r\n- Markarth now has a few rooftop and cliff ledges to find. These give access to a few locations, while two sets of small tunnels link to the others.\r\n- Whiterun already had easy access with multiple ways into most buildings, but a few have been enhanced. There is also a tunnel and cavern section leading directly into Dragonsreach.\r\n\r\nKnown bugs and caveats:\r\n\r\n- City guards in the various areas do not change faction based on the Civil War progression. Attempting it causes crashes, this seems to be a bug in the game so I left them as Imperial and Stormcloak respectively no matter the war progression.\r\n- Levelled items added by this mod to the world may not show up for high-level saves.\r\n- Night Watchman and Housecarls have a noticable skin color difference between their body and head. This is a bug in the base game.\r\n- Re-entering the new areas will probably cause the navmesh bug to occur, making the NPCs unable to navigate. This is a bug in the base game.\r\n- You may sometimes see a flash or briefly see through walls in very narrow areas transiting between rooms. Seems to be some issue with roombounds and portals in the base game.",
  "categoryId": "24",
  "version": "3.31",
  "author": "Enos Shenk",
  "createdUnix": "1329616714",
  "updatedUnix": "1332398673",
  "containsAdultContent": false,
  "uploadedBy": "Enos Shenk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34414",
      "name": "Shenk Thievery Overhaul 31",
      "version": "3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "373",
      "fileName": "Shenk Thievery Overhaul 31-10336.zip",
      "uploadedUnix": "1329775135",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/cea4234d5f00cfb1f8f5942e9b9b131f642d203cd0be1a7bf428e42e22228187/analysis/1406699223/",
      "changelogHtml": " Added the Solitude Vault and assorted keys. <br/> \n Fixed Solitude Sewers and Windhelm Walls guard behavior, they arrest instead of kill now. <br/> \n Removed Eorland Graymane\\'s Housecarl. <br/> \n Fixed a small Thief AI glitch, they should deploy now. <br/> \n Other assorted bugfixes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shenk%20Thievery%20Overhaul%2031-10336.zip?fid=34414&ttl=1535770620&ri=8192&rs=8192&setec=966c358164bda6a9a8a9ee925d9a65fb"
    },
    {
      "fileId": "34856",
      "name": "Shenk Thievery Overhaul 311",
      "version": "3.11",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "370",
      "fileName": "Shenk Thievery Overhaul 311-10336.zip",
      "uploadedUnix": "1329846607",
      "modVersion": "3.11",
      "virusScanUrl": "https://www.virustotal.com/file/4ab2eb1e54d38bc79e1f3b4c8e090eaec611f15bb955e3cc15b6d39b235de040/analysis/1406701931/",
      "changelogHtml": " Cleaned a bunch of dirty edits from the mod. <br/> \n Fixed door issues with the Solitude Vault. <br/> \n Gave Leonard a unique loot drop. <br/> \n Added Noisemaker and Immolation arrows. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shenk%20Thievery%20Overhaul%20311-10336.zip?fid=34856&ttl=1535770621&ri=8192&rs=8192&setec=ec4345b62513880284a556df6c422b08"
    },
    {
      "fileId": "35361",
      "name": "Shenk Thievery Overhaul 312",
      "version": "3.12",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "386",
      "fileName": "Shenk Thievery Overhaul 312-10336.zip",
      "uploadedUnix": "1329936193",
      "modVersion": "3.12",
      "virusScanUrl": "https://www.virustotal.com/file/acfa6e0234db1a6c3a060464fa0a9e4b101a32ba1964fcfee41f7f9126a7c9d3/analysis/1406705352/",
      "changelogHtml": " Placed a couple vault keys that were improperly located. <br/> \n Changed Night Watchmen to always ignore combat during business hours. <br/> \n Added Blinding Arrows. <br/> \n Added a neutral NPC to the Solitude Vault. <br/> \n Other minor bugfixes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shenk%20Thievery%20Overhaul%20312-10336.zip?fid=35361&ttl=1535770621&ri=8192&rs=8192&setec=02210a6f9e12c87521d44981e0a2d06c"
    },
    {
      "fileId": "36976",
      "name": "Shenk Thievery Overhaul 32",
      "version": "3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "511",
      "fileName": "Shenk Thievery Overhaul 32-10336.zip",
      "uploadedUnix": "1330232456",
      "modVersion": "3.2",
      "virusScanUrl": "https://www.virustotal.com/file/f9d3fff7cf433a8d01638ad5002641de7e82a6a5ce210eb66355dafdd440a96b/analysis/1406713993/",
      "changelogHtml": " Added the Markarth Vault <br/> \n Improved Night Watchman, Housecarl and Guard Dog reactions to the player. <br/> \n Tweaked NPC Thief deployment and gave them more targets. <br/> \n Buffed Housecarl weapon selection at higher levels. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shenk%20Thievery%20Overhaul%2032-10336.zip?fid=36976&ttl=1535770622&ri=8192&rs=8192&setec=f77bef97742f4ff4d8afe3feebfad466"
    },
    {
      "fileId": "37413",
      "name": "Shenk Thievery Overhaul 321",
      "version": "3.21",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "510",
      "fileName": "Shenk Thievery Overhaul 321-10336.zip",
      "uploadedUnix": "1330315740",
      "modVersion": "3.21",
      "virusScanUrl": "https://www.virustotal.com/file/bf9488d7203d1a1268250e1a9eaee1799ba74da6ad582ee35e57153669363a93/analysis/1406716388/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shenk%20Thievery%20Overhaul%20321-10336.zip?fid=37413&ttl=1535770622&ri=8192&rs=8192&setec=e4e5cf32bba32f85e8e4deae4c144582"
    },
    {
      "fileId": "38158",
      "name": "Shenk Thievery Overhaul 322",
      "version": "3.22",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "519",
      "fileName": "Shenk Thievery Overhaul 322-10336.zip",
      "uploadedUnix": "1330465200",
      "modVersion": "3.22",
      "virusScanUrl": "https://www.virustotal.com/file/1fe04961ecb62affdbd23455cde682e50dac989f0a0ccc3f69a3006a47754d51/analysis/1406719925/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shenk%20Thievery%20Overhaul%20322-10336.zip?fid=38158&ttl=1535770623&ri=8192&rs=8192&setec=eac7e9d8c9f6ec15261435cb4acc6450"
    },
    {
      "fileId": "40867",
      "name": "Shenk Thievery Overhaul 33",
      "version": "3.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "600",
      "fileName": "Shenk Thievery Overhaul 33-10336.zip",
      "uploadedUnix": "1331075902",
      "modVersion": "3.3",
      "virusScanUrl": "https://www.virustotal.com/file/2cf4250d358cbbf9bfb1bb88bf572b0cbcbe6a1c987175e034b850d6b35f33c6/analysis/1406735243/",
      "changelogHtml": " Added the Whiterun Vault <br/> \n Shopkeeper bonus loot keys (Not vault keys) and arrows for Tonilia changed to added via hidden quest. <br/> \n Fixed Markarth vault explosion. Again. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shenk%20Thievery%20Overhaul%2033-10336.zip?fid=40867&ttl=1535770623&ri=8192&rs=8192&setec=54d4f84833be8680ee61ec1ded442bb9"
    },
    {
      "fileId": "45636",
      "name": "Shenk Thievery Overhaul Latest",
      "version": "3.31",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "550",
      "fileName": "Shenk Thievery Overhaul Latest-10336-3-31.zip",
      "uploadedUnix": "1332398673",
      "modVersion": "3.31",
      "virusScanUrl": "https://www.virustotal.com/file/79ef72c666347ed21ff9985d55ba35777816d99140a6d400915a313a16e0a5c2/analysis/1406772545/",
      "changelogHtml": " Rebuilt all STO cell navmeshes. <br/> \n Relocated a couple vault keys to better locations. <br/> \n Fixed small visual glitches. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shenk%20Thievery%20Overhaul%20Latest-10336-3-31.zip?fid=45636&ttl=1535770624&ri=8192&rs=8192&setec=df14b43a1aa02f6089d6f4e5ea345972"
    }
  ]
}