{
  "modId": 10331.0,
  "modName": "RibeenaNudeMales - changing pubic hair colour",
  "summary": "A male nude mod, which include changing pubic hair colour (to match you hair). Includes best-style naked model for Khajiit. Does not Argonion.",
  "descriptionHtml": "No longer supported - Use SAM or Schlongs of Skyrim. If you want to use the Khajit model elswere, just remember to acknowledge.\r<br />\r<br />[center][heading][size=5]&gt;&gt; Description &lt;&lt;[/size][/heading][/center]\r<br />This mod (my first) is a male nude mod, which include changing (buggy) pubic hair colour, with varying pubic styles for races. Currently the textures are only set-up for uncircumsized.\r<br />\r<br />This mod also includes a ChangeMaleModels.esp - this will enable the different pubic styles, update Khajiit to use a seperate model with beast style genitals, and change naked Argonion to the default naked mesh.\r<br />\r<br />The models are based off the vanilla models, outside off adding the genitals, there has only been adjustments to the buttox to provide a better naked shape. Likewise with the textures, they are based off the vanilla textures.\r<br />\r<br />[center][heading][size=5]&gt;&gt; News &lt;&lt;[/size][/heading][/center]\r<br />[b]Khajiit update[/b] - after finally figuring out normal maps between Blender and Skyrim, i was able to procude a new and clean normal map for khajiit. For those interested to go from Blender Object Space normals to Skyrim - on the image, invert the blue channel, then swap the green and blue channel. Reverse this process to return to Skyrim. Upon having the correct normal map, you can apply it as a displaycement map to a multires or highly subdivided model, and then sculpt in more or new texture. Not sure how deep the normal maps need to be, it&#39;s just a guessing game, :).\r<br />\r<br />Looking to use the same model but new textures for the Argonians - my research tells me they should be entirely smooth, and possibly have dual penises.\r<br />\r<br />Did a bit more testing, and will look into programming help for the pubic hair colour - thank [b]reidus404[/b] for all the testing and reports :D\r<br />\r<br />Will do a bit more work on the main model - there&#39;s a UV error currently on the testicals.\r<br />\r<br />[center][s]= = = = = = = = = = = = = = = = = = = = = = [/s][/center]\r<br />\r<br />Texture tweaks and bug testing. Now there are custom texture for Breton, Orc, and RedGuard. Changed &#34;BeastModels.esp&#34; to &#34;ChangeMaleModels.esp&#34; - as it includes the changes for different pubic hair types.\r<br />\r<br />Yet to find a solution to NPC&#39;s pubic textures always being black... any advice greatly appreciated, :D, might result in abandonment of this mod - moved into a non hair colour version (if only my own character&#39;s pubic colour changes, might aswell just use a texture mod with black pubic hair in it, and applies to armours etc too without further modification)\r<br />\r<br />[center][s]= = = = = = = = = = = = = = = = = = = = = = [/s][/center]\r<br />\r<br />Rebuilt the models, and new textures for the penis, as a result seams should be fixed, and now testing new BeastModels.esp to include race specific pubic textures - currently just have one for the breton race.\r<br />\r<br />Hopefully more updates soon, :) - Khajit with sheathed style penis planned - not sure on the argonion... might be the same, as far as i can tell genetically they would probably have non-visible testicals or glands.\r<br />\r<br />[center][s]= = = = = = = = = = = = = = = = = = = = = = [/s][/center]\r<br />\r<br />This mod (my first) is a male nude mod, which include changing pubic hair colour. Currently the textures are only set-up for uncircumsized.\r<br />\r<br />This mod also includes a BeastModels.esp - this will change naked Argonion and Khajit to use malebody_0/1.nif in the Khajit and Argonion folders, for future modelling of nude Beast.\r<br />\r<br />The model and textures are based off Sundracon and thegal&#39;s Nule Male - this is a higher detail mesh detail than thegal&#39;s, but considerablly less intensive than Sundracon (for those who want to make every guy naked without performance loss, :) )\r<br />\r<br />This is mostly a proof of concept and learning how to get Blender 2.49 modelling workflow going. I will be updating this one weekends; first fixing the seam error, and possibly expanding the pubic hair region.\r<br />\r<br />[center][heading][size=5]&gt;&gt; Bugs (help appreciated) &lt;&lt;[/size][/heading][/center]\r<br />[list]\r<br />[*]UV error on testicals for main model\r<br />[*]When setting weight slider to full, the texture changes colour - changing the colour fixes the error after this, but not sure why it happens, maybe an issue with my files?\r<br />[*]NPC&#39;s hair colour is not set for pubic hair (so defaults to black), no leads on how to change this, tried updating NPC&#39;s through creation kit... bit lost on this - MAY BE A DEAL BREAKER ON THIS MOD - mostly cause it&#39;s not that often i see my own character naked&#33;\r<br />[*]hide armour (separate mesh) does not have pubic hair due to being a separate mesh. I am not aware of any other topless armours which this is also an issue.\r<br />[/list]\r<br />\r<br />[center][heading][size=5]&gt;&gt; Not compatible with &lt;&lt;[/size][/heading][/center]\r<br />\r<br />Any hair mods - due to the new mesh to create the colourable pubic hair, installing hairy mods (which are black pubic hair) will create an odd dual coloured character. Adding more/full body colourable pubic hair will require complete duplication of the model and a new high res texture, considerablly upping the performance hit (i have a mediocre computer, :) ) - so i welcome any mods following to do this, but am not currently planning it.\r<br />\r<br />Texture mods - while i started trying to recycle existing versions, i ended up doing considerable changes to the normal map, and skin textures to fix some seaming and flat areas to now include more veins etc.\r<br />\r<br />Any mods that affect naked version of races - may not work in conjunction with some female naked mods.\r<br />\r<br />[center][heading][size=5]&gt;&gt; Recommendation &lt;&lt;[/size][/heading][/center]\r<br />\r<br />This mod will be partially compatible with Better Males - http://skyrim.nexusmods.com/downloads/file.php?id=2488 - I reccomend installing it afterwards, to ensure the model, textures and normal maps oveerride Better Males. If you want naked Khajit and Argonion, copy the meshes from Better Males into meshes/actor/character/khajit(or argonion) folder. I may update with new naked models specifically for the beast races.\r<br />\r<br />[center][heading][size=5]&gt;&gt; Installation &lt;&lt;[/size][/heading][/center]\r<br />\r<br />Move the Data folder to your Skyrim folder.\r<br />You can find the Skyrim folder here: Steam&#92;steamapps&#92;common&#92;skyrim\r<br />\r<br />Once in game, you will need to strip your character, hit ~ and type &#34;showracemenu&#34;, you may need to navigate to the hair option to get the pubic hair colour to update, once done, hit r and retype your name to finish.\r<br />\r<br />[center][heading][size=5]&gt;&gt; Disinstallation &lt;&lt;[/size][/heading][/center]\r<br />\r<br />Remove the files, check the zip for the list.\r<br />\r<br />[center][heading][size=5]&gt;&gt; Requirements &lt;&lt;[/size][/heading][/center]\r<br />\r<br />Skyrim.\r<br />\r<br />[center][heading][size=5]&gt;&gt; Version History &lt;&lt;[/size][/heading][/center]\r<br />[list]\r<br />[*][2012-03-02] 1.0.3 (khajiit special)\r<br />[*][2012-03-02] 1.0.2\r<br />[*][2012-02-26] 1.0.1\r<br />[*][2012-02-19] 1.0 Release\r<br />[/list]",
  "categoryId": "29",
  "version": "1.0.3",
  "author": "Ribeena",
  "createdUnix": "1329613691",
  "updatedUnix": "1331974014",
  "containsAdultContent": true,
  "uploadedBy": "ribeena",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33447",
      "name": "RibeenaMales100a",
      "version": "1.0.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4750",
      "fileName": "RibeenaMales100a-10331.7z",
      "uploadedUnix": "1329613856",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/1a3c1c6c8c7bb45c3a9d346ab0e15214f6f74203862aec4b22826fdf00d0afc0/analysis/1406694372/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RibeenaMales100a-10331.7z?fid=33447&ttl=1535770609&ri=8192&rs=8192&setec=2ae8f250373564db52c7e22aa05eadcc"
    },
    {
      "fileId": "37050",
      "name": "RibeenaMales101",
      "version": "1.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9150",
      "fileName": "RibeenaMales101-10331.7z",
      "uploadedUnix": "1330254750",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/74c09af93d415f00aca14aedd562936f5c61d1967af7b2d963b7be28fb4ea508/analysis/1406714371/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RibeenaMales101-10331.7z?fid=37050&ttl=1535770610&ri=8192&rs=8192&setec=c441abc06c7543eeba5750720bac2d07"
    },
    {
      "fileId": "39432",
      "name": "RibeenaMales102",
      "version": "1.0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10896",
      "fileName": "RibeenaMales102-10331-1-0-2.7z",
      "uploadedUnix": "1330748241",
      "modVersion": "1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/93294851e05c7715f93eec81f2531de6c2e237376056a39dd84060d82709a72f/analysis/1406726478/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RibeenaMales102-10331-1-0-2.7z?fid=39432&ttl=1535770610&ri=8192&rs=8192&setec=128913c4e985b00d43ba318a1ce5d0c5"
    },
    {
      "fileId": "44057",
      "name": "RibeenaMales103",
      "version": "1.0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13427",
      "fileName": "RibeenaMales103-10331-1-0-3.7z",
      "uploadedUnix": "1331974014",
      "modVersion": "1.0.3",
      "virusScanUrl": "https://www.virustotal.com/file/1e1b46720eca57deb35c8f741e0d2807aab1da73c66cd7546c3456b78a4c34e6/analysis/1406752721/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RibeenaMales103-10331-1-0-3.7z?fid=44057&ttl=1535770611&ri=8192&rs=8192&setec=ac53cf24c90014fa3c9d1730ae4128e9"
    }
  ]
}