{
  "modId": 10344.0,
  "modName": "Encryptions Call Dragon Shout Changes",
  "summary": "This mod changes the original Call Dragon shout to give the player better control.",
  "descriptionHtml": "This is a reworked version of the Call Dragon shout. It allows the player to call either Odahviing or Paarthurnax to help them or to just have them hang around.\r\n\r\nFirst and second words of the shout used to do nothing... now they do.\r\n\r\n1st word tells the current dragon to either land  and follow the player or follow them in orbit.\r\n\r\n2nd word tells the current dragon to return home.\r\n\r\n3rd word calls the dragons and using this again while one of them is out will call the other dragon and tell the current one to go home.\r\n\r\nSome things you should know though. I haven\\'t fully tested wether or not these changes breaks quests tied to Odahviing or Paarthurnax so if they do then please leave a comment. Also later I will be replacing Paarthurnax with a skeletal version of him in case someone opted in to take him out. Maybe even change up that certain quest to give the option to kill either Paarthurnax or Delphine. Personally i would go for the later :P\r\n\r\nAnyways I hope you enjoy and if there are any game breaking bugs with this then please leave a comment. Also keep in mind that by default dragons have terrible pathing while on the ground... getting stuck in rocks,trees, and buildings from time to time so be mindfull where you plop them down.",
  "categoryId": "24",
  "version": "1.0",
  "author": "Encryption",
  "createdUnix": "1329620396",
  "updatedUnix": "1329620501",
  "containsAdultContent": false,
  "uploadedBy": "Encryption767",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33482",
      "name": "Encryptions Call Dragon Changes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "38",
      "fileName": "Encryptions Call Dragon Changes-10344-1-0.zip",
      "uploadedUnix": "1329620501",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bea7bd6d778ec10ccaf41301483733b27b8e61093e27cff66b46b049a5a38c34/analysis/1406694435/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Encryptions%20Call%20Dragon%20Changes-10344-1-0.zip?fid=33482&ttl=1535770638&ri=8192&rs=8192&setec=bcee454423ca5a76cabaec6a4556de4f"
    }
  ]
}