{
  "modId": 10347.0,
  "modName": "Proudspire Manor Weapon Rack Fixes",
  "summary": "Fixes several bugs related to the weapon racks in Proudspire Manor, in Solitude.",
  "descriptionHtml": "This mod will fix several bugs related to the weapon racks of Proudspire Manor, in Solitude. Currently, there are two fixes included. The first patches the far left and far right weapon racks on the first story so that you can remove the weapons placed in them. The second fix patches the weapon racks on the third story in the bedroom so that large eapons placed on the left-hand rack do not disable the right-hand rack. Note that overly-large weapons added through replacers or other mods may still disable the racks.\r\n\r\nI would also like to request that anyone who has a save where any of the default houses have broken weapon racks or wall mounts send a copy to me. I have been unable to replicate the bug, despite the numerous mentions on the wikis regarding an unspecified bug that keeps them from functioning properly. (This does not include bugs such as the ones fixed by this mod, like large weapons disabling nearby racks or the weapon racks not letting you reclaim a placed weapon, and instead keeping the \\\"activate weapon rack\\\" message.\r\n\t\r\n.-= Installation =-.\r\n\r\nSimply place \\\"Proudspire Manor Weapon Rack Fixes.esp\\\" into the Skyrim/Data folder.\r\n\r\n.-= Requirements =-.\r\n\r\n- Skyrim\r\n\r\n.-= Incompatibility =-.\r\n\r\n- Probably any other mod that affects Proudspire manor, or these specific weapon racks. If it works with a specific mod that edits Proudspire Manor, please tell me.\r\n\r\n.-= To-Do List =-.\r\n\r\n- Fix the large weapon bug in the first floor weapon racks.\r\n- Look into the wall mount bugs.",
  "categoryId": "95",
  "version": "1.0",
  "author": "Glitchfinder",
  "createdUnix": "1329622724",
  "updatedUnix": "1329622782",
  "containsAdultContent": false,
  "uploadedBy": "Glitchfinder",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33496",
      "name": "Proudspire Manor Weapon Rack Fixes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Proudspire Manor Weapon Rack Fixes-10347-1-0.rar",
      "uploadedUnix": "1329622782",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/335e72f146d123aa6b6a7db63b92e4d57e4fcb46e9906a7aa4b4068a67219d08/analysis/1406694547/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Proudspire%20Manor%20Weapon%20Rack%20Fixes-10347-1-0.rar?fid=33496&ttl=1535770644&ri=8192&rs=8192&setec=4fd18df333fae30309c6980668d9567f"
    }
  ]
}