{
  "modId": 10343.0,
  "modName": "Elisif the Fair Marriable - become future High King or Queen",
  "summary": "Simply adds the Jarl of Solitude to the Marriable faction and thus enables you to potentially become the new future High King/Queen of Skyrim.",
  "descriptionHtml": "Become the High DovahKing of Skyrim.\r\n\r\n*Slightupdate - added a second throne next to Elisif\\'s chair in the palace so you can sit next together solidifying the illusion of being the Jarl of Solitude - check the images for detail\r\n\r\nNOTE: If this fails to work, you could simply hit console, click on Elisif and type \\\"addfac 19809 1\\\" and hit enter. That basically does the same thing as this mod. I am just trying to start a potential mod to literally become the High King or Queen of Skyrim.\r\nI lack the skill and time currently to undertake such a mod.\r\n\r\nI was messing about with the \\\"addfac\\\" console command a while back, adding people to be potentially be married and what not and did it on Elisif the fair.\r\n\r\nRequirements to achieve this I think:\r\n\r\n - You are either neutral or sided with the Legion.\r\n - you have befriended her by completing both the Queen Potema quest in Wolfskull Cave\r\n - you have completed her personal quest to place her late husband\\'s family horn at a Talos   shrine near whiterun.\r\n - you are single OR have a mod that enables multible spouses\r\n - you have and are wearing a Amulet of Mara.\r\n\r\nI found out she has the dialogue related to the marriage factor of Skyrim and this concluded that people could technically become the Jarl of Solitude and the future High King or Queen or what ever you want.\r\n\r\nIt may be buggy, such as Elisif not having the required AI packages and scripts to work with vanilla spouses (e.g being told where to live, set up shop or what ever)\r\nThe marriage in Riften works just fine so that is ideal. You should also be given a key to the Blue Palace aswell as added to the various factions Elisif is, I dont know how the marriage aspect works in Skyrim as I am thinking it works as in Oblivion and Fallout  where the player is added to the various factions and given a rank (Oblivion Legion recruitment mod where you are identified by your rank and in Vanilla Fallout 3 where the Brotherhood of Steel reconises you and greets you with \\\"Sir Knight\\\" estabilising that you are indeed a Brotherhood of Steel Knight.\r\n\r\nI was expecting to see the aftermath of the war with the choronation of Elisif as High Queen if won by Legion or if won by Stormcloaks, Ulfric being crowned as High King of Skyrim...\r\n\r\nMay be added in a DLC by Bethesda or perhaps created by a talented modder or group of us but for now, this is, in my eyes as close as absolute power you can \\\"politically\\\" gain in Skyrim and thus, the Empire also...\r\n\r\n... I will look into making the Emperior Titus Mede II into being marriable and also make him available outside the Dark Brotherhood questline.",
  "categoryId": "33",
  "version": "1.1",
  "author": "Beth",
  "createdUnix": "1329619978",
  "updatedUnix": "1329622457",
  "containsAdultContent": false,
  "uploadedBy": "nofear88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33479",
      "name": "Jarl Elisif the Fair Marriable",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Jarl Elisif the Fair Marriable-10343.rar",
      "uploadedUnix": "1329620044",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b1de7cc308d6031893a4c271053893ec171189362b0e231345488f2aeab3fc0b/analysis/1406694433/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jarl%20Elisif%20the%20Fair%20Marriable-10343.rar?fid=33479&ttl=1535770637&ri=8192&rs=8192&setec=561814750e2bdc3c559c58883b0d270e"
    },
    {
      "fileId": "33493",
      "name": "Elisif update - adds second chair",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Elisif update - adds second chair-10343-1-1.rar",
      "uploadedUnix": "1329622457",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/08366c3ca20b00da954b67096c8cdea6df1ce21cd6561d5aefe5ef037e08a598/analysis/1406694440/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elisif%20update%20-%20adds%20second%20chair-10343-1-1.rar?fid=33493&ttl=1535770637&ri=8192&rs=8192&setec=d1aef573950e96b3b5146dcc1cb7bef8"
    }
  ]
}