{
  "modId": 10364.0,
  "modName": "Storage Spells",
  "summary": "Have you ever been \\\"overencumbered\\\" and had a hard time deciding what to drop?\r\n\r\nThis mod adds a Spell to the game that allows you to magically \\\"banish\\\" all the items in your inventory. The items can later be recalled to a set of containers that have been added in each of the five walled cities.",
  "descriptionHtml": "This mod adds a Spell to the game that allows you to magically \\\"banish\\\" all the items in your inventory. The items can later be recalled to a set of containers that have been added in each of the five walled cities.\r\n\r\nTo acquire the spell, find the spellbook that is in the bookbag that is part of a set of containers located in any of the five walled cities.  The set beside your house in Whiterun are probably easiest to find, but none of them are hidden.\r\n\r\nTo recall your banished items, use the \\\"Item Summoning Rune\\\" located on top of one of the new containers. The Rune will ask you where to send your banished items, and will attempt to sort them into different containers by item type. The sorting is not perfect and things that the spell doesn\\'t know how to sort will be sorted into the Lockbox.  In addition to summoning the banished items, The Rune also summons items from the equivalent set of containers in the other cities, making it a great way to transport your stuff from place to place.\r\n\r\nI should warn you that when you cast your spell ALL OF YOUR ITEMS WILL GO AWAY, at least until you can get to a city to summon them back. I tried to make it leave the items you have equipped or favorited, but couldn\\'t figure out how to do so. In a way, this feature adds some balance to this mod, since you must temporarily drop or store any items you want to keep before casting the spell.\r\n\r\nI waited for over five game years to make certain that none of the new containers ever respawn. This means you will never have to worry about items stored in them vanishing.\r\n\r\nI made this spell because I found myself spending too much time managing my inventory. For me it was the sorting feature that was most important, and I am a little disappointed that I could not make it sort categories into the proper containers with 100% accuracy. However, I do not have the time in my life to devote to working out how to work perfectly, I don\\'t even have the time to play the game, really. If anyone figures out a way to make it give back the favorited and equipped items, message me.\r\n\r\nNote: If you ever disable this mod, move your stuff to some other containers first!",
  "categoryId": "75",
  "version": "1",
  "author": "Silas",
  "createdUnix": "1329634660",
  "updatedUnix": "1329635008",
  "containsAdultContent": false,
  "uploadedBy": "SylvanTiw",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33559",
      "name": "InventoryManagementSpell",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "93",
      "fileName": "InventoryManagementSpell-10364-1.zip",
      "uploadedUnix": "1329635008",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/8cf60171113c4ad896f148fefab9991cfc358a41e0ef79fecc9a679d797e43c7/analysis/1406694906/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/InventoryManagementSpell-10364-1.zip?fid=33559&ttl=1535770678&ri=8192&rs=8192&setec=28d6373f71b4235e3f606cf239f2a922"
    }
  ]
}