{
  "modId": 10398.0,
  "modName": "Primby Village",
  "summary": "Primby Village is a new village in Skyrim, perched on a cliff between Windhelm and Riften. It also has a nice player home and merchants and services for you to use.",
  "descriptionHtml": "[CENTER][IMG]http://i889.photobucket.com/albums/ac96/Antiscamp/Primby00Logo.png[/IMG]\r\n\r\nVersion 0.5 Beta\r\n\r\n\r\n\r\n\r\n[URL=\\\"http://frontierskyrim.wordpress.com/\\\"]The Frontier Development Blog[/URL][/CENTER]\r\n\r\n\r\n\r\nYour Uncle has recently passed away and you have inherited his house in Primby. This is a small trading and farming village between Riften and Windhelm, perched safely on a cliff overlooking the marshlands to the north. Here you\\'ll find all the usual services, like a smith, a trader and an alchemist. There\\'s also a tavern here. The village is inhabited by NPC\\'s and farm animals. \r\n\r\nFind the key to your new home in the barrel by the door. The house is nicely decorated and there\\'s storage space there for your loot.\r\n\r\nThe purpose of the mod is to create a village of the size of Riverwood that looks vanilla and could have had a place in the main game. It\\'s all supposed to fit right into the world of Skyrim. My own personal goal with Primby is to learn the CK tools and familiarize myself with the modding of the game. Go easy on me, since this is my first mod for this game. There are future plans for this; I will expand the village and I will make the things already in it work even better.\r\n\r\nTHIS IS BETA AND YOU SHOULD TAKE PRECAUTIONS! ALWAYS BACKUP YOUR SAVED GAMES BEFORE INSTALLING NEW MODS. KEEP A BACKUP FOLDER WITH OLDER SAVES OR WHATEVER. THERE ARE SEVERAL KNOWN BUGS AFFECTING THIS MOD. REFER TO THE KNOWN BUGS DEPARTMENT OF THIS README FOR MORE ON THOSE. BY INSTALLING IT, YOU AGREE THAT YOU USE THIS MOD AT YOUR OWN RISK. THIS MOD HAS BEEN EXTENSIVELY BETA TESTED BY SEVERAL TESTERS AND HAS PROVEN TO BE STABLE AND WELL-WORKING AS INTENDED; ANY SERIOUS BUGS YOU ENCOUNTER MAY BE FOUND IN MOD CONFLICTS, ESPECIALLY IF YOU\\'RE USING MANY MODS.\r\n\r\n\r\n[IMG]http://i889.photobucket.com/albums/ac96/Antiscamp/Primby01Installation.png[/IMG]\r\n\r\nPlace the PrimbyTown.esp and the folders in your Skyrim/Data folder. Merge where asked, and check that the .esp is marked in the Skyrim Launcher. Find Primby village on the map on the road between Riften and Windhelm. You can\\'t fast-travel there the first time. You need to go on foot, so just take the road north from Riften, or south from Windhelm.\r\n\r\n\r\n\r\n[CENTER][IMG]http://i889.photobucket.com/albums/ac96/Antiscamp/PrimbyPics01Village.png[/IMG][/CENTER]\r\n\r\n\r\n\r\n[IMG]http://i889.photobucket.com/albums/ac96/Antiscamp/Primby02WhenUpdating.png[/IMG]\r\n\r\nBe sure to take out all your stored good in the containers in the Player House. OTHERWISE THEY\\'LL DISAPPEAR WHEN UPDATING! Before installing the new file, go to Primby and take the goods with you. Leave Primby and save the game. Install the new file, and then go back to Primby.\r\n\r\n\r\n\r\n[IMG]http://i889.photobucket.com/albums/ac96/Antiscamp/Primby03KnownIssues.png[/IMG]\r\n\r\nThis is a Beta! You\\'re bound to excperience glitches, weirdness and bugs. Please report these to me as soon as possible to help in the development of this mod. TAKE PRECAUTIONS. Always backup your saved games before running a new mod.\r\n\r\nThe following bugs are things I can\\'t do anything about, but Bethesda are reportedly working on both:\r\n\r\n1. THE NAVMESH BUG. Every time you leave Primby village and travel away, when you return, the NavMesh will have disappeared and all the NPC\\'s will have reverted to the vanilla NavMesh. This is irritating and looks bad. You\\'ll have NPC\\'s not wandering on the streets anymore and guards glitching through floors and that kind of stuff. The only known solution right now is to entirely quit and reload Skyrim. This will reset the NavMesh. Companions WILL follow you anywhere in the village, but will glitch when the NavMesh bug kicks in after the second visit within one game.\r\n\r\n2. THE GREY FACE TEXTURE BUG. Some NPC\\'s will have weird-looking face coloration. Again, this is a bug with the CK and not on my, or your, end. Bethesda are working on both of these, and we\\'ll hopefully see a patch soon.\r\n\r\n3. FLOATING GRASS. If you experience grass hovering above the ground inside Primby Village, you\\'re one of those who have encountered a specific bug that does this. It seems to strike some players, while others, like myself, don\\'t have it. The workaround is this: Open up both Skyrim.ini AND SkyrimPrefs.ini and at the bottom of the [Grass] section add/alter this: bAllowLoadGrass=0, bAllowCreateGrass=1, bDrawShaderGrass=1 Then, in the skyrim installion folder open SkyrimEditor.ini and at the bottom of the [Grass] section add: bAllowCreateGrass=1, bAllowLoadGrass=0. Source: http://frontierskyrim.wordpress.com/2012/02/28/floating-grass-in-primby/\r\n\r\n\r\n\r\n[IMG]http://i889.photobucket.com/albums/ac96/Antiscamp/Primby04MoreStuffFromMe.png[/IMG]\r\n\r\nIf you liked Primby Village and would like to see more of what I do in Skyrim, check out my [URL=\\\"http://frontierskyrim.wordpress.com/\\\"]Frontier Development Blog[/URL] (http://frontierskyrim.wordpress.com/). I have some pretty cool stuff in the works. I\\'ve been modding the Elder Scrolls Series since 2005, and my greatest days are yet to come. Please, do leave comments, endorsements and votes on my pages. Stuff like that keep modders going. Have fun!\r\n\r\n\r\n\r\n[CENTER][IMG]http://i889.photobucket.com/albums/ac96/Antiscamp/PrimbyPics02DragonAttack.png[/IMG][/CENTER]\r\n\r\n\r\n\r\n[IMG]http://i889.photobucket.com/albums/ac96/Antiscamp/Primby05VersionHistory.png[/IMG]\r\n\r\n0.1 Initial Release February 19, 2012\r\n\r\n0.2 February 25, 2012\r\n\r\n- Expanded the Fort. Outside and inside.\r\n- Created five more NPC\\'s in the village.\r\n- More features added to the Player House.\r\n- Retextured and created the Griffin Banner.\r\n- Reuniformed all the guards.\r\n- Cleared some grass here and there.\r\n- Made ownership on the smith\\'s chest.\r\n\r\n0.3 February 29, 2012\r\n\r\n- Added Sugardaddy\\'s Bakery (do read his book on the table by the bed!).\r\n- Created a Governor\\'s Quarters in the other Fort Tower.\r\n- Created an interior Griffin Banner.\r\n- Many new NPC\\'s have been added. The Governor and Sugardaddy, among others.\r\n- Added more guards; Primby Sharpshooters, manning the fort walls.\r\n- The merchant doors now lock at night.\r\n- If you commit a crime and are caught, the guards will now send you to prison in Windhelm.\r\n- The guards will now talk about arrows in knees and lolligaggin\\', like they should.\r\n- Locked the Smith\\'s chest.\r\n- Updated the \\\"History of Primby\\\" book.\r\n- Fixed several other small glitches, did corrections and tweaks.\r\n\r\n0.4 March 3, 2012\r\n\r\n- Created a farm at the end of the village. Interior and Exterior as well as NPC\\'s.\r\n- Created a Shrine to Dibella.\r\n- Beautified the back of the village, with a view towards the marshlands in the north.\r\n- Created Dragon markers where Dragons land when attacking Primby.\r\n- Sanadara and the Jailor now speak again.\r\n- Helda now sings and plays properly at the tavern at night.\r\n- There is now an Enchanter in the Alchemist\\'s Shop too.\r\n- Fixed issue with bounties for Windhelm and Eastmarch.\r\n- Fixed several NavMesh issues throughout the village.\r\n- Did numerous minor corrections; moving rocks, levelling ground and such.\r\n\r\n0.5 March 18, 2012\r\n\r\n- Updated the Player House a bit. A new mannequin added, among other things.\r\n- Updated Faction info for the townspeople. No more weird reporting of crimes.\r\n- Did numerous smaller corrections and tweaks.\r\n\r\n\r\nAntiscamp (http://frontierskyrim.wordpress.com/), Feb-Mar, 2012\r\n\r\n\r\n\r\n---",
  "categoryId": "53",
  "version": "0.5",
  "author": "Antiscamp",
  "createdUnix": "1329668058",
  "updatedUnix": "1332022935",
  "containsAdultContent": false,
  "uploadedBy": "Antiscamp",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44251",
      "name": "Primby Village",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "614",
      "fileName": "Primby Village-10398-0-5.zip",
      "uploadedUnix": "1332022935",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/016c08c848401d17ba8523ece333b190ed9fc915fe8f134771f53d989b082cf8/analysis/1406764878/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Primby%20Village-10398-0-5.zip?fid=44251&ttl=1535770732&ri=8192&rs=8192&setec=f5a8b909929d5b60e0814086e82b3e15"
    }
  ]
}