{
  "modId": 10415.0,
  "modName": "Spelltome IMMORTAL",
  "summary": "Spell that summons someone far better and stronger than any follower...",
  "descriptionHtml": "Rumor has it that in Riverwood, there holds a spelltome that belonged to an old mage whom he visited a young man and his sister in his dying days. The two showed kindness and cared for that old sorcerer, and in return for their kindness, the frail old bloke gave them a spellbook and then breathed his last on the bed. Ignorant to that which was given them, the two have no idea what worth as to make of that old and dirty book. Lacking knowledge of any kind, they casually left it somewhere in the house...\r\n\r\nRegarding this mod\r\nThis is a spelltome whereby the bearer can conjure a Dremora Lord, and to whomever believes in his heart that the spell will work for him, even though he\\'s an apprentice to magic, will see the power of his faith in it. That immortal will follow the conjurer for 86400 seconds (lol).....\r\n\r\nWhy this mod \r\nAlright, jokes aside. Firstly you will need to find this spelltome in riverwood. Trust me its easy to locate it. Once when you learn this spell, you will be able to summon a Dremora Lord for 24 hours, however I had him following me for more than the said period of time, lol dont ask me why he\\'s not leaving. You need not have to hire or get any follower with you on your quests now. You\\'ve got the dremora lord, isnt he better? lol\r\n\r\nI made this mod because of the followers that I hired kept dying and also they were rather weak and useless. Since I\\'ve installed the civil war mod, I have had numerous encounters with gangs, I mean seriously very aggresive gangs killing me over and over again, So it\\'s time I hire someone far better than a mere follower to help endeavour my bold adventures in SKYRIM. \r\n\r\nIf you like this mod, please feel free to drop me a comment.  \r\n\r\nInstallation\r\nJust extract it and put in the data folder, and remember to put a check on the box for the immortal.esp\r\n\r\nNote of using -\r\nYou need not have to be an expert in magic to use this spell\r\nwhen he expires, just summon him again, You need not have to wait for your magic to fill inorder to conjure\r\n\r\n** If you really dont know where to find the spelltome, its on the 2nd floor in Riverwood Traders\r\n\r\nUploaded only for Nexus",
  "categoryId": "75",
  "version": "1.00",
  "author": "simplesim",
  "createdUnix": "1329677512",
  "updatedUnix": "1329679780",
  "containsAdultContent": false,
  "uploadedBy": "simplesim",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33778",
      "name": "spelltome immortal",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "spelltome immortal-10415-1-00.7z",
      "uploadedUnix": "1329679176",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/7316e646f6d9dd632f3cfb78df124a3b661dc99839f080c14b9b8b1ffb0e04f4/analysis/1406696169/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/spelltome%20immortal-10415-1-00.7z?fid=33778&ttl=1535770768&ri=8192&rs=8192&setec=aecb5e0f5e3f23c9482baa5ae17edfcb"
    },
    {
      "fileId": "33782",
      "name": "spelltome immortal Priest",
      "version": "v1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "spelltome immortal Priest-10415-v1-00.7z",
      "uploadedUnix": "1329679780",
      "modVersion": "v1.00",
      "virusScanUrl": "https://www.virustotal.com/file/541f3b2627af4fa4b24aae1c096652259f82bb4c677bc05adfdf57dd41313349/analysis/1406696170/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/spelltome%20immortal%20Priest-10415-v1-00.7z?fid=33782&ttl=1535770769&ri=8192&rs=8192&setec=54a58c400be9628b9e34cc5fe1eaf8c8"
    }
  ]
}