{
  "modId": 10431.0,
  "modName": "Directors Tools",
  "summary": "This mod allows to: play various animations by player\\'s characters and NPCs, cast plenty of effect shaders and visual effects on them, apply various imagespace modifiers on screen (post-processing effects), and change interior fog or exterior weather.",
  "descriptionHtml": "[center][b][size=6]Director\\'s [color=#eecc77]Tools[/color][/size]  (v2.0)[/b][/center]\r\nDIRECTOR\\'S TOOLS IN NUMBERS:\r\n[color=#dddd77]260+[/color] animations, [color=#dddd77]~70[/color] kill moves, [color=#dddd77]147[/color] effect shaders, [color=#dddd77]87[/color] visual effects, [color=#dddd77]165[/color] imagespace modifiers, [color=#dddd77]~100[/color] interior fog templates, [color=#dddd77]60[/color] weather types, [color=#dddd77]130[/color] outfits\r\n\r\n[size=4][color=ff4444][b]Changes in new v2.0:[/b][/color][/size]\r\n-> converted to ESM format and added CUSTOM ANIMATIONS category to the main menu - by default it\\'s an empty menu section. This place may store any future and new custom animations when animators/modders decide to make them as plugins dependent on Director\\'s Tools esm file. For modders this means that no any coding skills are required to add new animations and by simple copy&paste activities it is possible to add new working entries to DT\\'s menu and relay on its functionality. For players this means that all idle animation mods from different modders can be \\\"united\\\" and accessible in game through only one and easy to use menu system. \r\n\r\n-> replaced Self and Execute power spells with items: Manual and Horn. This makes the whole setup far more efficient as you need to equip only the Target power to use it, the items: Manual (Self power previously) and Horn (Execute power previously) while binded to Quick Keys can be triggered with just press of a button, anywhere, anytime (even while sitting on furniture).\r\n\r\n-> added possibility to set intervals between stored animations. It is possible to create sort of anim events queue which will be delaying the start of every next animation by the whole seconds or fractions of those. You can do this for many targets or just one (including PC). In the latter case certain animations can be triggered one by one with various pauses between them thus creating \\\"chain of anim events\\\" for one character [color=ff6666][see \\\"When You Aren\\'t At Home In Whiterun\\\" movie in videos tab which features all Nocturnal animations played by PC \\\"one by one\\\"][/color]\r\n\r\n[size=4][color=ff9999][b]Added in v1.7:[/b][/color][/size]\r\n- possibility to set any NPC or Creature as target for main camera [color=ffcccc][see \\\"Set Camera and Push Away\\\" and \\\"Unusual Dragon Encounter\\\" movies in videos tab][/color]\r\n- push actor away function [color=ffcccc][see \\\"Set Camera and Push Away\\\" and \\\"Slippery In Whiterun\\\" movies in videos tab][/color]\r\n- settings for attackers/casters/targets for kill moves and some paired visual effects\r\n- ability to play combat moves by NPCs\r\n- random kill moves mode [color=ffcccc][see \\\"Berserker\\'s Way\\\" movie in videos tab][/color]\r\n- some furniture animations (while sitting on chairs or benches)\r\n- fog manipulation in interiors (color, distance, strength) + about 100 predefined fog settings based on original lighting templates [color=ffcccc][see \\\"Interior Fog\\\" movie in videos tab][/color]\r\n- storage slots for anim events - it is possible to trigger synchronized various animations (or the same animation) for up to 10 different characters at once (including PC) - [color=ffcccc][see \\\"Automation Of Animation\\\" movie in videos tab][/color]\r\n\r\n\r\n[size=4][color=ffee99][b]DESCRIPTION:[/b][/color][/size]\r\n\r\nThis modification allows to: play various animations by player\\'s characters and NPCs, cast plenty of effect shaders and visual effects on them, apply various imagespace modifiers on screen (post-processing effects), and change interior fog or exterior weather.\r\n\r\nUseful tools for all kinds of virtual photographers, machinima directors, and modders. This mod it\\'s like a kind of a browser of original visual content, as the actual names of actions and effects in menu are exactly the same as editor IDs of those items in Creation Kit - just check the stuff in game, write down the names of your favourites, and use in your mods later without spending much of the time on searching.\r\n\r\nThe mod adds two items and one power (spell): Director\\'s Tools (Manual), Director\\'s Tools (Horn), and Director\\'s Tools (Target). Manual allows to apply effects and actions on PC, change fog and weather, display post-processing effects on screen, and sets behavior mode for Target power and Horn item. Target power casts effects and actions on targets (NPCs and Creatures) either in default menu mode or in certain semi-automated ways set in CONFIGURATION menu of Manual item. Horn item silently triggers paired animations and visual effects, or previously memorized (stored) anim events for up to 10 targets either at once or one by one with certain intervals set between them (queued anim events).\r\n\r\nPower spell (Target) needs to be equipped and is triggered by the same button you use for shouting. Items, Manual and Horn, need to be set as Favourites and binded to Quick Keys, and can be triggered only this way. Due to technical limitations both these items can be found in armor category. This is an ideal place for them, as it allows these items to be set is such a way to not generate any messages upon their activation and don\\'t occupy any armor slots at all.\r\n \r\n\r\n[size=4][color=#ffee99][b]MENU OPTIONS DETAILED DESCRIPTION:[/b][/color][/size]\r\n \r\n[color=#dddd77][b]CONFIGURATION[/b][/color] (all config options visible in menu of Manual item only)\r\n\r\n[color=#dddd77][b]CONFIGURATION - Set Horn Mode[/b][/color]\r\n- sets how Director\\'s Tools (Horn) item works.\r\n\r\nIf set to \\\"paired anim event\\\" mode then it \\\"executes\\\" chosen paired animation (kill move most likely) between attacker and its target. Attacker and target need to be set in CHARACTER OPTIONS - MARK CHARACTER menu, and the default paired anim needs to be set in CONFIGURATION - SET DEFAULTS - SET DEFAULT PAIRED ANIM menu.\r\n\r\nIn \\\"paired visual effect\\\" mode it does similar but triggers visual effect instead (i.e. soul trap spell effect between PC and NPC).\r\n\r\nThird mode, \\\"trigger stored anims\\\", does exactly just that - triggers at once all chosen animations on selected targets that were previously set in \\\"Anim Events (store)\\\" menu section.\r\n\r\nThe last mode, \\\"reset camera\\\", sets main camera to follow the player\\'s character. This is only useful if you previously set main camera to follow other target than your character, and want to reset it to default later without displaying any menu on screen.\r\n\r\nIn all these modes Horn item doesn\\'t display any menu while triggered.\r\n\r\n[u]Available Settings:[/u]\r\npaired anim event, paired visual effect, trigger stored anims, reset camera.\r\n\r\n[u]Useful:[/u]\r\nWhen you want to trigger paired animation (kill move mostly) or paired visual effect between two characters (PC+NPC, or NPC+NPC), or just synchronously execute various (or the same) animations on chosen targets (up to 10 characters in total). And all this \\\"silently\\\" without any additional menu visible on screen.\r\n\r\n[color=#dddd77][b]CONFIGURATION - Set TARGET Power Mode[/b][/color]\r\n- sets how Director\\'s Tools (Target) Power Spell works - either in default menu mode, or in certain semi-automated mode where action (point and click on NPC or creature) applies one from previously set default effects. All these modes but default make that Target power doesn\\'t display any menu while casted on target.\r\n\r\n[u]Available Settings:[/u]\r\ndefault menu, play anim event, reset anim event, paired anim (kill moves), random kill move, push away, outfit, apply effect shader, clear effect shader, apply visual effect, clear visual effect.\r\n\r\n[u]Useful:[/u]\r\nWhen you want to apply quickly a certain effect or action on more than a few NPCs and Creatures. Just set default action or effect in CONFIGURATION - SET DEFAULTS section of main menu and choose Target power mode which corresponds to that action. Then point and click on any NPC or Creature to \\\"cast\\\" that effect or action on it.\r\n\r\n[color=#dddd77][b]CONFIGURATION - SET DEFAULTS[/b][/color]\r\n\r\n[color=#dddd77][b]CONFIGURATION - SET DEFAULTS - SET DEFAULT ANIM EVENT[/b][/color]\r\n- sets Anim Event (animation) for corresponding automated mode of Target power.\r\n\r\n[color=#dddd77][b]CONFIGURATION - SET DEFAULTS - SET DEFAULT PAIRED ANIM[/b][/color]\r\n- sets paired anim (Kill Move) for corresponding automated modes of Target power and Horn item.\r\n\r\n[color=#dddd77][b]CONFIGURATION - SET DEFAULTS - SET DEFAULT OUTFIT[/b][/color]\r\n- sets outfit (cloth, armor) for corresponding automated mode of Target power.\r\n\r\n[color=#dddd77][b]CONFIGURATION - SET DEFAULTS - SET DEFAULT EFFECT SHADER[/b][/color]\r\n- sets Effect Shader for corresponding automated mode of Target power.\r\n\r\n[color=#dddd77][b]CONFIGURATION - SET DEFAULTS - SET DEFAULT VISUAL EFFECT[/b][/color]\r\n- sets Visual Effect for corresponding automated mode of Target power.\r\n\r\n[color=#dddd77][b]CONFIGURATION - SET DEFAULTS - SET DEFAULT PAIRED VFX[/b][/color]\r\n- sets paired Visual Effect for corresponding automated mode of Horn item.\r\n\r\n[color=#dddd77][b]CONFIGURATION - SET DEFAULTS - SET DEFAULT PUSH FORCE[/b][/color]\r\n- sets strength of push force for corresponding automated mode of Target power (1 is gentle push, 100 can catapult targets out of the cities ;]).\r\n\r\n[color=#dddd77][b]CONFIGURATION - RESET ALL IMGS MODIFIERS[/b][/color]\r\n- removes all post-processing effects from screen.\r\n\r\n[color=#dddd77][b]CONFIGURATION - RESET WEATHER TO DEFAULT[/b][/color]\r\n- restores default weather.\r\n\r\n[color=#dddd77][b]CHARACTER OPTIONS[/b][/color] (character options are visible in menu of Manual item and Target power)\r\n\r\n[color=#dddd77][b]CHARACTER OPTIONS - MARK CHARACTER[/b][/color]\r\n\r\n[color=#dddd77][b]CHARACTER OPTIONS - MARK CHARACTER - MARK AS KILL MOVE ATTACKER[/b][/color]\r\n- marks PC or NPC as Attacker for corresponding mode of Horn item (paired anim event) which triggers paired anim (kill move) set in CONFIGURATION - SET DEFAULTS - SET DEFAULT PAIRED ANIM menu section.\r\n\r\n[color=#dddd77][b]CHARACTER OPTIONS - MARK CHARACTER - MARK AS KILL MOVE TARGET[/b][/color]\r\n- marks PC or NPC as Target for corresponding mode of Horn item (paired anim event) which triggers paired anim (kill move) set in CONFIGURATION - SET DEFAULTS - SET DEFAULT PAIRED ANIM menu section.\r\n\r\n[u]Note:[/u]\r\nIf you choose PC as Target and then trigger anim event such as kill move, your character will die by the hands of NPC and you will be in need to reload the game. The same happens when you set both, PC as attacker, and as target, then your character will die as well. Good time for those memorable just-before-the-grave photos ;>\r\n\r\n[color=#dddd77][b]CHARACTER OPTIONS - MARK CHARACTER - MARK AS KILL VISUAL FX CASTER[/b][/color]\r\n- marks PC or NPC as Caster for corresponding mode of Horn item (paired visual effect) which triggers paired visual effect set in CONFIGURATION - SET DEFAULTS - SET DEFAULT PAIRED VFX menu section.\r\n\r\n[color=#dddd77][b]CHARACTER OPTIONS - MARK CHARACTER - MARK AS KILL VISUAL FX TARGET[/b][/color]\r\n- marks PC or NPC as target for corresponding mode of Horn item (paired visual effect) which triggers paired visual effect set in CONFIGURATION - SET DEFAULTS - SET DEFAULT PAIRED VFX menu section.\r\n\r\n[color=#dddd77][b]CHARACTER OPTIONS - SET CHARACTER[/b][/color]\r\n\r\n[color=#dddd77][b]CHARACTER OPTIONS - SET CHARACTER - AS CAMERA TARGET[/b][/color]\r\n- marks PC or NPC as target for main camera. Good for inspecting the world from those bandits\\' eyes or to take some aerial photography from the perspective of a dragon.\r\n\r\n[color=#dddd77][b]CHARACTER OPTIONS - SET CHARACTER - TOGGLE GOD MODE[/b][/color] (option visible in menu of Manual item only)\r\n- sets God Mode for player\\'s character. Can be useful sometimes if you hunt for that particular \\\"wow\\\" action shot, and do not want to bother when your character dies often.\r\n\r\n[color=#dddd77][b]CHARACTER OPTIONS - SET CHARACTER - TOGGLE POTENTIAL FOLLOWER[/b][/color] (option visible in menu of Target power only)\r\n- adds/removes NPC from potential followers faction. This won\\'t make that every single NPC will want to follow you, but definitely enables such possibility for some of them (all those wives and husbands sitting alone in your houses will be now more eager to take an adventure with you for instance).\r\n\r\n[color=#dddd77][b]CHARACTER OPTIONS - SET OUTFIT[/b][/color]\r\n- sets outfit (clothes, armor) for target (PC or NPC). You can quickly set the look of your companion whether it will be an evil dark knight all in daedric armor, proud and powerful jarl, or just a poor farmer. Or you can remove all of the clothes entirely what will make the place for experiments with custom attire from other mods - default outfit won\\'t block \\\"less superior stuff\\\" then.\r\n\r\n[u]Note:[/u]\r\nIf you set an outfit for your character in first person mode, then all will be fine. But if you choose one of the outfits in third person mode then your character may become invisible and some clipping with hair may occur. Don\\'t worry then, just \\\"re-equip\\\" one of added pieces manually and all should be fine.\r\n\r\n[color=#dddd77][b]CHARACTER OPTIONS - RESET ANIM EVENTS[/b][/color]\r\n- removes all current Anim Events from selected target.\r\n\r\n[color=#dddd77][b]CHARACTER OPTIONS - RESET ALL EFFECT SHADERS[/b][/color]\r\n- removes all current Effect Shaders from selected target.\r\n\r\n[color=#dddd77][b]CHARACTER OPTIONS - RESET ALL VISUAL EFFECTS[/b][/color]\r\n- removes all current Visual Effects from selected target.\r\n\r\n[color=#dddd77][b]CUSTOM ANIMATIONS[/b][/color] (various custom animations available in menu of Manual item and Target power)\r\n- by default it\\'s an empty menu section. This place may store any future and new custom animations when animators/modders decide to make them as plugins dependent on Director\\'s Tools esm file. For modders this means that no any coding skills are required to add new animations and by simple copy&paste activities it is possible to add new working entries to DT\\'s menu and relay on its functionality. For players this means that all idle animation mods from different modders can be \\\"united\\\" and accessible in game through only one and easy to use menu system. \r\n\r\n[color=#dddd77][b]Anim Events[/b][/color] (various original animations available in menu of Manual item and Target power)\r\n\r\n[color=#dddd77][b]Anim Events - Anim Events (action)[/b][/color]\r\n- group of action anim events - these are short single animations.\r\n\r\n[color=#dddd77][b]Anim Events - Anim Events (behavior)[/b][/color]\r\n- group of behavior anim events - these are long, static, or looping animations. To reset these you need to use RESET ANIM EVENT option at the top of this menu, or RESET ANIM EVENTS option in CONFIGURATION - CHARACTER OPTIONS menu.\r\n\r\n[color=#dddd77][b]Anim Events - Anim Events (combat)[/b][/color]\r\n- group of combat anim events - these are combat power and normal attack animations.\r\n\r\n[color=#dddd77][b]Anim Events - Anim Events (furniture)[/b][/color] (available in menu of Manual item and in menu of Target power only while PC or NPC is sitting)\r\n- group of anim events related to furniture (chairs).\r\n\r\n[color=#dddd77][b]Anim Events - Anim Events (movement)[/b][/color]\r\n- group of movement anim events - these are various animations related to movement (alas no standard walking and running there).\r\n\r\n[color=#dddd77][b]Anim Events - Anim Events (objects)[/b][/color]\r\n- group of anim events with objects - these are short or looping animations with objects (sometimes reset function needs to be used twice to remove objects).\r\n \r\n[color=#dddd77][b]Anim Events (paired)[/b][/color]\r\n- mostly kill move anim events. The real killers - spectacular but can wreck havok upon the targets. Though here animations aren\\'t as deadly and can be played by PC or NPC without the target. If you want these to be like real \\\"finishers\\\" use \\\"paired anim event\\\" modes of Target and Execute powers.\r\n\r\n[color=#dddd77][b]Anim Events (store)[/b][/color] (available in menu of Manual item and Target power)\r\n- this menu section allows to \\\"store\\\", or memorize if you like, up to 10 selected targets and assign chosen animations to them. This way all these animations can be triggered simultaneously for all targets by activating (silently with the press of a button) the Horn item while it is in \\\"trigger stored anims\\\" mode. You can also set various intervals between stored animations and create sort of anim events queue which will be delaying the start of every next animation by the whole seconds or fractions of those.\r\n\r\n[u]Short workflow:[/u]\r\nCast Target power on any NPC, choose from menu: ANIM EVENTS (store) - Slot #1, then select one of animations from the list. Repeat this for another NPC but choose Slot #2. Do the same with others if you like. Then set a mode for Horn item in CONFIGURATION - SET HORN MODE to \\\"trigger stored anims\\\". Finally activate Horn item via quick key and enjoy the show.\r\n\r\n[color=#dddd77][b]Effect Shaders[/b][/color] (available in menu of Manual item and Target power)\r\n- group of various Effect Shaders. You can apply them on PC or NPCs.\r\n\r\n[color=#dddd77][b]Visual Effects[/b][/color] (available in menu of Manual item and Target power)\r\n- group of various Visual Effects. You can apply them on PC or NPCs.\r\n\r\n[color=#dddd77][b]Imagespace Modifiers[/b][/color] (available in menu of Manual item only)\r\n- group of various post-processing screen effects.\r\n\r\n[color=#dddd77][b]Interior Fog[/b][/color] (available in menu of Manual item while in interior type cells only)\r\n- menu section that allows to manipulate* fog settings inside of interiors (* by default to some limited extent, fully with optional plugin - DirectorsTools_FogUnlocker.esp).\r\n\r\n[u]Note:[/u]\r\nAll changes to the fog settings are not permanent. You can mess in game with these options as you like. After you exit the game and start it again, all things should return to normal, default values.\r\n\r\n[color=#dddd77][b]Interior Fog - Fog Color[/b][/color]\r\n- sets RGB values for NEAR and FAR planes of the fog.\r\n\r\n[color=#dddd77][b]Interior Fog - Fog Planes[/b][/color]\r\n- sets distance from the camera of NEAR and FAR planes of the fog.\r\n\r\n[color=#dddd77][b]Interior Fog - Fog Power[/b][/color]\r\n- sets strength of the fog (smaller value - more dense fog, greater value - less dense fog).\r\n\r\n[color=#dddd77][b]Interior Fog - Fog Templates[/b][/color]\r\n- various predefined templates of fog settings (exactly the same as original lightning templates).\r\n\r\n[color=#dddd77][b]Weather Types[/b][/color] (available in menu of Manual item while in exterior type cells only)\r\n- all types of default weather to choose from.\r\n \r\n\r\n[size=4][color=#ffee99][b]INSTALLATION:[/b][/color][/size] \r\n\r\n» Copy DirectorsTools.esm, DirectorsTools.bsa, and DirectorsTools_FogUnlocker.esp files to \\\"Skyrim\\\\Data\\\" folder (default path from Steam\\'s main folder is: Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data).\r\n\r\n[u]NOTE:[/u] Using DirectorsTools_FogUnlocker.esp is optional. While this file doesn\\'t change anything visible, it just edits properties of each interior cell in game and removes inheritances from Lightning Templates for all these cells. This allows to control all fog settings in interiors for Director\\'s Tools. Without this optional plugin this would be possible only to some very limited extent. This plugin is not recommended for normal game play, but if you are an avid collector of photos from virtual worlds, machinima director, or modder, you may find it useful to fully control and test fog settings in a real time in many game\\'s original places.\r\n\r\n» In Skyrim Launcher choose \\\"Data Files\\\" and make sure that checkboxes near DirectorsTools.esm and DirectorsTools_FogUnlocker.esp are selected.\r\n\r\n» Start the game and load your any save - two items and one power (spell) should be added automatically: Director\\'s Tools (Manual), Director\\'s Tools (Horn), and Director\\'s Tools (Target). You\\'ll find Target power in MAGIC -> POWER section. And Manual and Horn itmes are in Armor category. You may also want to make all these as Favourities and bind to certain Quick Keys for easy of use. In fact in case of the items you must to do this to be able to use them.\r\n \r\n\r\n[size=4][color=#ffee99][b]REMOVAL:[/b][/color][/size] \r\n\r\n» Delete the same files you copied previously during the installation process.\r\n \r\n\r\n[size=4][color=#ffee99][b]UPDATE (for saves that use one of previous versions):[/b][/color][/size]\r\n \r\n» Delete DirectorsTools.esp from previous versions (this esp file is not needed anymore, and creates conflicts with the current version) and copy DirectorsTools.esm and DirectorsTools.bsa files to Skyrim\\\\Data folder (do not forget to copy optional DirectorsTools_FogUnlocker.esp plugin as well if you want to fully control fog settings in interiors).\r\n\r\n» Start the game and load your any save - two items and one power (spell) should be added automatically. If not just type these commands in the console:\r\nstopquest axdQuest\r\nstartquest axdQuest\r\nAll missing spells and items should be added then. \r\n\r\n\r\n[size=4][color=#ffee99][b]Known Issues / Compatibility:[/b][/color][/size]\r\n \r\nThis mod adds only a new stuff. It doesn\\'t overwrite or change anything from the original game thus incompatibility with other mods has been reduced to minimum.\r\n\r\nThere are some restrictions related to animations if you try to cast the spell on any NPC. Currently the Creation Kit does not allow to modify properties, conditions and priorities of animation files. So if a certain NPC is in an idle state then he will likely be playing any animation you cast on him. That is not the case with \\\"busy\\\" NPC as any animations related to his current activities may overwrite any animations cast on him.\r\n\r\n\r\n------------------------------------------------------------\r\n\r\n[size=4][b]Tutorial - adding custom idle animations and poses[/b][/size] (optional file)\r\n\r\nThis tutorial describes how to add new idle animations/poses to the game without any coding skills or other magical tricks. It is related to using Fore\\'s modified behavior files and Director\\'s Tools mod in esm format as a base.\r\n\r\nAs for today (2nd half of March, 2012), the Creation Kit does not have an option which allows to add new idle animations/poses to the game in any way. There are some work-around methods, but one of easiest ways to add new idle animations/poses to the game is by using Fore\\'s modified behavior files and esm file of Director\\'s Tools mod as a base.\r\n\r\n[u]This tutorial focuses on the process of adding new idle animations and poses for default characters (races), it doesn\\'t cover creature or object animations.[/u]\r\n\r\nFor animators (persons who create animations) this tutorial can be useful as it describes all the steps required to add new animation/pose to the game in one of the easiest ways currently possible. No any Papyrus coding skills are required here, but just simple copy&paste activities mostly. No more, no less.",
  "categoryId": "51",
  "version": "2.0",
  "author": "Artisanix",
  "createdUnix": "1329682946",
  "updatedUnix": "1337097739",
  "containsAdultContent": false,
  "uploadedBy": "Artisanix",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44159",
      "name": "DirectorsTools2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "211",
      "fileName": "DirectorsTools2-10431.zip",
      "uploadedUnix": "1332000276",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/005e0b063494c398868bac8f20abc6c27f7555d44535fcac519e4ce0d59b5fe3/analysis/1406753240/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DirectorsTools2-10431.zip?fid=44159&ttl=1535770802&ri=8192&rs=8192&setec=d504086ddc22652c9e62715560345538"
    },
    {
      "fileId": "61488",
      "name": "Tutorial_AddCustomAnims",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "151",
      "fileName": "Tutorial_AddCustomAnims-10431.zip",
      "uploadedUnix": "1337097739",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2fec4262aa8bf2fc361add7bb78b11384605628223188621d9fdb67180983e66/analysis/1406894414/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tutorial_AddCustomAnims-10431.zip?fid=61488&ttl=1535770802&ri=8192&rs=8192&setec=d5a11dba07f0e8dd0ee419f905255f7e"
    }
  ]
}