{
  "modId": 10455.0,
  "modName": "GBobs Imported Alchemy",
  "summary": "New ingredients, alchemy effects, and potions imported from the distant lands of Cyrodiil and Morrowind.",
  "descriptionHtml": "GenghisBob\\'s Imported Alchemy\r\n-----------------------------------------------------------------------------\r\n\r\nCurrent version: 1.1a (work in progress)\r\nLast updated: Feb 23, 2012\r\n\r\nThis is a a continuing alpha release to learn the CK and explore where I want to take this mod. The mod has enough working content that you can have a lot of fun with some new alchemy potion creation and/or just purchasing existing potions - all will effects not present in standard Skyrim. Since this is still just an alpha, however, understand that things aren\\'t balanced yet and bugs will still exist. Otherwise, please enjoy and let me know if you have any feedback!\r\n\r\n- GBob\r\n\r\n\r\n\r\nDescription\r\n\r\nAll of my characters tend to gravitate towards Alchemy. It is just way too much fun look for ingredients, look for the best combinations, and brew potions - No matter how many alchemical ingredients exist, I always want more!\r\n\r\nThis mod aims to bring nearly all of the alchemy ingredients from Oblivion and Morrowind, into Skyrim. Most alchemy effects will be translated (as possible) and in a few cases new ones will be required. The ultimate goal is to have a fun and balanced mod that greatly expands our alchemy options while still sticking to common lore from the previous TES titles.\r\n\r\n\r\nThis sounds great! Where can I get my favorite ingredients, imported directly from Cyrodiil and Morrowind?\r\n\r\nFor the moment, there are a couple \\\"importer\\\" merchants wandering around the market in Whiterun (it is the commerce capital of Skyrim, afterall!). One sells imported merchandise from Cyrodiil and one from Morrowind. Ingredients, Potions, and Alchemy Recipes are available.\r\n\r\n\r\nFeatures\r\n\r\n- *most* of Oblivion\\'s standard ingredients (currently ~70)\r\n- *most* of Morrowind\\'s standard ingredients (currently ~50)\r\n- quite a few example potions from each land\r\n- numerous alchemy recipes specific to the new ingredients from either Morrowind or Oblivion\r\n- includes new merchants in Whiterun who will sell these ingredients, potions, and recipes\r\n- any ingredients already present in Skyrim are not duplicated or altered\r\n- includes several new effects for alchemy:\r\n\r\n    Fire Cloak\r\n    Shock Cloak\r\n    Frost Cloak\r\n    Fire Damage\r\n    Frost Damage\r\n    Shock Damage\r\n    Drain Health\r\n    Drain Stamina\r\n    Drain Magicka\r\n    Detect Life\r\n    Detect Animal\r\n    Night Eye\r\n    Shield\r\n    Fortify Speed\r\n    ... and more coming!\r\n\r\nFuture Plans\r\n\r\n- Need volunteers for new meshes for these ingredients! Please! :cool:\r\n- Update item costs to reflect their rarity/import costs (but stay balanced and fun)\r\n- Look into adding ingredients from Expansions (not sure if this makes sense or not)\r\n- Add a good selection of potion recipes\r\n- Add more merchants (probably in Solitude and Riften)\r\n- Look at adding wandering merchants or caravans to simulate imports from Cyrodiil and Morrowind\r\n- Maybe some quests related to such merchants to help gather exports, protect caravans, or raid caravans!\r\n- Any other good ideas that the community comes up with that fits with this overall model\r\n- Continue to update spell effects that are missing or problematic\r\n- Maybe make this a community modding resource (or add to if someone is already working on it)\r\n\r\n\r\nCurrent Known Issues\r\n\r\n- Most ingredients currently use the Salt Pile as a default mesh\r\n- The merchants have a tendency to bump other merchants out of their stalls. Need to learn more about the AI Packages.\r\n- Some of the new effects probably need to be balanced.\r\n- Many of the ingredients regular effects need to be balanced.\r\n- Many ingredients had effects which do not exist in Skyrim. Need to fill these slots with something that makes sense.\r\n- Elixirs of Exploration (tier 3+) have effects not present in Skyrim. Need to figure out what to do.\r\n\r\n\r\nVersion History\r\n\r\nVersion 1.1a (Feb 23, 2012)\r\n- added ~50 Morrowind ingredients\r\n- fixed fire, frost, shock cloak effects on the player\r\n- added a number of alchemy recipes\r\n- added a number of pre-made potions (great for testing effects)\r\n- added a few varieties of the Elixer of Exploration\r\n- added Telvanni Bug Musk\r\n- fixed numerous little bugs\r\nVersion 1.0a (Feb 19, 2012)\r\n- Initial release ",
  "categoryId": "94",
  "version": "1.1a",
  "author": "GhengisBob",
  "createdUnix": "1329689628",
  "updatedUnix": "1330041191",
  "containsAdultContent": false,
  "uploadedBy": "Ghengisbob",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33885",
      "name": "GBobs Cyrodilic Imported Ingredients v1_0a",
      "version": "1.0a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "GBobs Cyrodilic Imported Ingredients v1_0a-10455.zip",
      "uploadedUnix": "1329689776",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/9166728bb9b59677f25fc2fa4cf1bd3fff3f2d1bf21399fbe13a7fe461d54109/analysis/1406696723/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GBobs%20Cyrodilic%20Imported%20Ingredients%20v1_0a-10455.zip?fid=33885&ttl=1535770842&ri=8192&rs=8192&setec=174bbfa7cc3145d7c2b250c08d3f60aa"
    },
    {
      "fileId": "35986",
      "name": "GBobs Imported Ingredients v1_1a",
      "version": "1.1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20",
      "fileName": "GBobs Imported Ingredients v1_1a-10455-1-1a.zip",
      "uploadedUnix": "1330041191",
      "modVersion": "1.1a",
      "virusScanUrl": "https://www.virustotal.com/file/24e94cef06896013b4b35ac8beed7ab7e0f586ca1cf97c98b041bb304886ca25/analysis/1406708950/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GBobs%20Imported%20Ingredients%20v1_1a-10455-1-1a.zip?fid=35986&ttl=1535770842&ri=8192&rs=8192&setec=411903ad23d6f9e1ea9e2398aa17bb6c"
    }
  ]
}