{
  "modId": 10459.0,
  "modName": "Dye-Namic Smithing  Mages Edition",
  "summary": "There are mods out there that let you get unenchanted Thalmor robes, wearable unenchanted Psiijic armor, and unenchanted Archmage Robes with or without the hood. This mod lets you create their entire outfits in the Leather catagory of the smithing forge. It also lets you craft them in 5 different colors! You can mix and match between them to create",
  "descriptionHtml": "There are mods out there that let you get unenchanted Thalmor robes, wearable unenchanted Psiijic armor, and unenchanted Archmage Robes with or without the hood. This mod lets you create their entire outfits in the Leather catagory of the smithing forge. It also lets you craft them in 5 different colors! You can mix and match between them to create your own unique look!\r\n\r\nYou can also create all 10 circlets in the Jewelry catagory.\r\n\r\nDye-namic Smithing: Mage edition aims to make gearing your mage more fun and rewarding, by letting you choose what you want to wear, what stats you want on it, and what color you want to be when you do it.\r\n\r\nAll items are craftable in Black, White, Red, Blue, and Yellow, with the exception of Psiijic boots and gloves. They really would not benefit much from being retextured, so I didn\\'t bother.\r\n\r\nAll robes require 3 Leather and 2 Leather strips.\r\nAll boots, gloves, and hoods require 2 Leather and 2 Leather strips\r\n\r\nWhy leather? Because It is already in the game as a material for crafting. This is a vanity mod, and putting alot of time into creating new materials and populating the world with them is hardly worth the effort. Leather is in the game, so leather is the material.\r\n\r\nAll Circlets are crafted in the Jewelry catagory, and Jade, Silver, Gold, and Copper Circlets are created using orcish, Silver, Gold, and Dwarven Ignots respectively. They also require a gem or additional Ingot that I felt was best suited for the name/look of the circlet.\r\n\r\nTO DO:\r\n-Fix any issues that crop up. There are bound to be a few, as I have added alot of custom textures. This was alot of work!\r\n\r\n\r\nCHANGELOG:\r\n\r\n1.2\r\na) Removed Steel Smithing perk requirement by request.\r\nb) Added white/red/blue/yellow Thalmor hoods as craftable.\r\nc) Modified a few circlet recipes by request to better reflect the finished item.\r\n\r\n1.1\r\na) Fixed texture issues on female clothing.\r\nb) Added a Black Thalmor Hood to the crafting list. Other colors coming soon.\r\n\r\n1.0 Initial release\r\n\r\n\r\nIf you find any issues, please comment with your characters race, sex, and whataver you were doing when you saw the item with the texture issue(as in wearing the item, viewing it in the crafting window, or looking at it when it is dropped on the ground) and I will try to fix it promptly.\r\n\r\nAfter ironing out all issues with this mod, my next project will be a Warrior Edition, that will include craftable Blades armor, as well as 5 craftable color options for that and the other vanilla armor. Following that will be a Thief Edition, allowing craftable Thieves guild and Nightengale armor with 5 color options as well.\r\n\r\n\r\nOther Options:\r\nI also recommend you try my Added Rank to Enchanting \\\"Extra Effect\\\" Perk mod here: \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=8277\r\nthat allows you to spend an additional perk point to get 3 enchants per piece of gear.\r\n\r\nAnother mod I made attempts to balance spell damage and boost other spell lines power using modified destruction perks, and all new enchantments here: http://steamcommunity.com/sharedfiles/filedetails/?id=12510\r\nUsing these 3 mods together has made being a mage really fun for me, and I hope you enjoy them!",
  "categoryId": "60",
  "version": "1.2",
  "author": "TheDemonInside",
  "createdUnix": "1329691424",
  "updatedUnix": "1329691817",
  "containsAdultContent": false,
  "uploadedBy": "thedemoninside",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33899",
      "name": "Dye-Namic Smithing  Mage Edition",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12144",
      "fileName": "Dye-Namic Smithing  Mage Edition-10459-1-2.rar",
      "uploadedUnix": "1329691817",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/bb75b7673330883d74e9af23780a07e066a608eaf4ceb5911e90237f75cc3d56/analysis/1406696788/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dye-Namic%20Smithing%20%20Mage%20Edition-10459-1-2.rar?fid=33899&ttl=1535770850&ri=8192&rs=8192&setec=012175079c0d61efe1871fb06e9a05dc"
    }
  ]
}