{
  "modId": 10465.0,
  "modName": "Tartan Stormcloaks Plus -DEAD-",
  "summary": "The highly awaited upgrade to my Tartan Stormcloaks Mod.",
  "descriptionHtml": "::UPDATE::\r\n\r\nThis mod is DEAD, no more updates will be taking place from me, so unless Armdude re-appears or i get a message from another modder who wants to take over, no more updates.\r\n\r\nCallaghan04\r\n\r\n::IMPORTANT RANDOM UPDATE::\r\n\r\nHey people, this is Armdude. I just want to let everyone know that the reason we haven\\'t updated in a couple days is that Callaghan has recently been going through some pretty tough surgery. Wish him the best of luck everyone. I\\'m certain he\\'ll make it through as he continues to take lightly of some of the more problematic issues he\\'s described to me. I feel I am not inclined to go into any more details, but regardless, keep him in your thoughts.\r\n\r\nWe\\'ll be updating as soon as it is possible. Edit: also left a sneak peak (maybe) of a hauberk that might make it in. Still wip, I\\'ll keep you posted.\r\n\r\nArmdude\r\n\r\n::RANDOM UPDATE::\r\n\r\nAdded a video that showcases the mod, it also contains alot of Killmoves from battles found in WARZONES - CIVIL UNREST, so if anyone says \\'WARZONES doesn\\'t work with this mod, i beg to differ.\r\n\r\nCallaghan04\r\n\r\n::RANDOM UPDATE::\r\n\r\nas most of you (if you have seen my other mods) will know, i SUCK at making Normal Maps for my textures, so to remedy this the Tartan Stormcloaks Plus mod has a new member, armdude is now part of the \\'team\\' i guess, if 2 people can be called a team? i dont know... anyway, he will be making the Normals, and from the samples i\\'ve seen from him, their AWESOME! so hopefully soon, there will be no more crappy scaled shadows on chainmail, or padded cloth shadows on disk mail etc. And on top of this, if ever he feels like it (as i\\'ve given him full access to all the files and editing of this page) he may well help with more textures and variations, so this might seriously speed up the updates!\r\n\r\nWelcome aboard armdude!\r\n\r\n::1.1 UPDATE::\r\n\r\n8 New Armors added! YAY! the new armors are as follows:\r\n\r\nCallaghan Tartan (Best one!) (Scaled Horn Armor)\r\nMacAlistair Tartan (Scaled Horn Armor)\r\nMacCleod Tartan (Scaled Horn Armor)\r\nMacLachlan Hunting Tartan (Scaled Horn Armor)\r\nQizilchoka Lost Eastern Tartan (Scaled Horn Armor)\r\nDrover Tartan (Fur Armor Variety 2)\r\nFerguson Tartan (Fur Armor Variety 3)\r\nMonroe Tartan (Fur Armor Variety 1)\r\n\r\nEnjoy Killing those imperial dogs! For Scotlan... uhh.. Skyrim!\r\n\r\n::UPDATE::\r\n\r\nBelow is \\'Crumpets\\' i have solved my Screenshot Issue, thanks to some random website :D so now you can see the fruit of my labour and ridiculous amount of time on Nifskope! *Growls Angrily*\r\n\r\n::Introduction::\r\n\r\nFirstly, sorry about the No Screenshots problem, for some reason ALL my image editors are crashing when i try and save a .bmp to a .jpeg file :S so for now, you\\'ll have to look at my old version of this mod, the \\'Replacer Armor\\' Version, \r\n\r\nLink: http://skyrim.nexusmods.com/downloads/file.php?id=3359\r\n\r\n::What is this?::\r\n\r\nThis Mod is literally exactly the same as the one linked above, the only difference is the above link is for Replacers of the Stormcloak Armor, this mod mash\\'s them all up into one big levelled list giving the Stormcloaks a Huge Variety of armor on their default spawns! please upload screenshots so people can see this if i cant figure out my problems here.\r\n\r\nCurrently there are 10 armor Variants.\r\n\r\n::Known Bugs::\r\n\r\nIf your load order is incorrect and my MOD is not at the BOTTOM of the load order, deffinately below any other armor mod and deffinately below WARZONE - CIVIL UNREST, then there will be issues, either my mod wont work period, or my armors wont display correctly.\r\n\r\nI will fix this by making a .esm file ASAP.\r\n\r\n::Disclaimer::\r\n\r\nIf anyone wants to use my mod or parts thereof, He/She MUST seek my permission BEFORE uploading it ANYWHERE. and for the safety of your own computer, do NOT download my mods from anywhere but the Nexus, i have NOT uploaded anywhere but here and do not have any responcibility for virus\\'s and/or other damaging files withing archives not from the Nexus.\r\n\r\n::Requests::\r\n\r\nSame as the Origonal for this mod, send me a request, i\\'ll do it if i can. although the above mentioned Image Editor trouble may mean delays...\r\n\r\nCallaghan04",
  "categoryId": "54",
  "version": "1.1",
  "author": "Callaghan04",
  "createdUnix": "1329693133",
  "updatedUnix": "1330520464",
  "containsAdultContent": false,
  "uploadedBy": "Callaghan04",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33924",
      "name": "TSP V1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10859",
      "fileName": "TSP V1-10465.7z",
      "uploadedUnix": "1329693647",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a865418e4ba3e522c4e9099062a9d45e2f6d056a6b95b77041f6dd90213e6ed7/analysis/1406696902/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TSP%20V1-10465.7z?fid=33924&ttl=1535770860&ri=8192&rs=8192&setec=c22229195c564322c895ed6a054c8d8f"
    },
    {
      "fileId": "38062",
      "name": "TSP V1 point 1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7511",
      "fileName": "TSP V1 point 1-10465-1-1.7z",
      "uploadedUnix": "1330447182",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/659f27959385f94c26df79bc7670d094dd88a0bfbbbff5af69daa246180677cf/analysis/1406719457/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TSP%20V1%20point%201-10465-1-1.7z?fid=38062&ttl=1535770861&ri=8192&rs=8192&setec=deee6d5392c3a70aeeb168579b9248ce"
    },
    {
      "fileId": "38407",
      "name": "1 point 1 fixed ESP",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "1 point 1 fixed ESP-10465-1-1.7z",
      "uploadedUnix": "1330520464",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/228524d9fb6383b4f2dc44689c0f99efa6fb3068e8cc4bcc89c61f20c4631ede/analysis/1406721183/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/1%20point%201%20fixed%20ESP-10465-1-1.7z?fid=38407&ttl=1535770861&ri=8192&rs=8192&setec=61ba81c6c8eade2f80954766ffcd3fbf"
    }
  ]
}