{
  "modId": 10466.0,
  "modName": "Traders of Skyrim ENG",
  "summary": "Mount & Blade + Fable like:\r\n- Add 5 new vendors with specific product you can sell at higher price in other Holds.\r\n- Allow you to buy some shops and make profits every 1/2 of playing.\r\n\r\nSimply allow you to earn your life as a trader !\r\n",
  "descriptionHtml": "Important update: TraderEvo becomes Traders of Skyrim !\r\n\r\n----------\r\nEnglish\r\n----------\r\n\r\nFirst I want to thank Vanlococo ( http://skyrim.nexusmods.com/modules/members/index.php?id=957744 ) who has made the english translation for this mod !\r\n\r\n\r\n--------------------\r\nAbout the Mod:\r\n--------------------\r\n\r\n\r\nTraders of Skyrim 2.0:\r\n\r\nThis Mod breaks into 2 parts for now :\r\nI ) Import / Export: A travelling salesman life\r\nII ) Purchasing a Shop: A life of shop owner.\r\n\r\n\r\nI ) \r\nFor the Import/Export, you will find 5 new merchants in the following cities : Riften / Windhelm / Whiterun / Markarth / Solitude.\r\nEach one will sell you a unique commodity. This commodity will always be bought at a higher price at the following merchants:\r\nSmall profit if you sell the commodity/commodities to a Khajiit caravan.\r\nGood Profit if you sell your commodity at one of the other new merchants.\r\nBig profit if you sell it at one of the general goods stores  (vanilla stores) in  Dawnstar / Morthal / Winterhold / Falkreath.\r\nThe Aim of this mod is to make the trader career possible for your character.\r\nI can’t advise you enough to play the game as much as possible if you are going to use this mod: hire a mercenary, and travel from town to town on your horse via the trade roads!\r\nIt is obvious that this mod, coupled with the abuse of Fast Travel or the horse cart will ruin your experience.\r\n\r\n\r\nII ) \r\nThis mod allows you to buy 9 vanilla shops:\r\nThe 5 general goods stores of the big Holds ( Belethor in Whiterun / Bits and Pieces in Solitude / Etc. )\r\nThe 4 remaining (general or apothecary) stores in the smaller Holds.\r\nThe first ones will cost around 30 000 septims to purchase and will give you an income of 1000 every half-hour.\r\nThe second ones cost around 20 000 septims and give 700 every half-hour.\r\n\r\nYou can count on around 10 to 15 hours in game (not in menus / inventory/ map/ book) to get back the initial investment.\r\n\r\nTo make your bourgeois pleasure more varied, you can also purchase 3 special buildings. Those don’t give you gold openly, but a commodity that you’re meant to sell :\r\nHall of the Dead in Whiterun.\r\nThe Orphanage in Riften.\r\nTemple of Dibella in Markarth.\r\nThose buildings will only cost 8 000 septims , for an income of 1200/1500 septims every 2 in-game days.\r\n\r\nThose shops and buildings do seem like they are not equally interesting. But  BE AWARE : the commodities are PERISHABLE.\r\nThe shops will pile up the income gold to infinity, but the production buildings will never pile up for more than 1500 septims worth of merchandise.\r\nExample !  You buy Belethor of Whiterun and the Hall of the Dead. You go explore a dungeon for 3 real hours, so 6 ingame days (imaginary ratio):\r\nThe Shop will have 1000 septims x 6 half hours = 6000 septims.\r\nThe Hall of the Dead will have no more than 1200/1500 septims worth of merchandise\r\n\r\nDon\\'t forget to look at the Read Me.\r\n\r\n",
  "categoryId": "69",
  "version": "2.0",
  "author": "Calvitious",
  "createdUnix": "1329693446",
  "updatedUnix": "1330878576",
  "containsAdultContent": false,
  "uploadedBy": "Calvitious",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39977",
      "name": "Traders of Skyrim 2 ENG",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7033",
      "fileName": "Traders of Skyrim 2 ENG-10466-2-0.zip",
      "uploadedUnix": "1330878576",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/f05b3be861e5e11ee6bc559d8539ec5d8140677bd198139eddb6a3b8efc503ec/analysis/1406729893/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Traders%20of%20Skyrim%202%20ENG-10466-2-0.zip?fid=39977&ttl=1535770863&ri=8192&rs=8192&setec=8da22c0f5a05d72057a41e88ac5182a4"
    }
  ]
}