{
  "modId": 10479.0,
  "modName": "Clear Skies - No More Dragons - Dragon Extinction",
  "summary": "End game player? Want the dragons to die off for good? This mod is for you...",
  "descriptionHtml": "Hi Guys,\r\n\r\nThis is my first mod \\\"from scratch\\\", so excuse me if it doesn\\'t work quite as properly as intended as I\\'m still learning, but I\\'m almost certain I did it right - it\\'s not that much of a complicated thing to do it seems.\r\n\r\nSo, what this mod does essentially is reduce the dragon re-spawn likelihood by 1000% (I hope that value is acceptable, it seems to be because the CK didn\\'t error on me and the CK usually lets you know if a value isn\\'t acceptable).\r\n\r\nI have also removed the ability for any dragons to be able to re-spawn, so you might still have to kill off a few dragons, but if you\\'re at the end game and you have killed all the dragons in the world the ones that you are killing now will be the last ones that you see - you are starting the extinction of the Dragon race (especially if you did what the Blades wanted).\r\n\r\nI think it\\'s kind of a cool mod to have for end game players who think that once they have completed the game that it is silly for Dragons to still just mysteriously be coming from \\'no-where\\' despite what has happened in the story.\r\n\r\nI hope it works as intended, I have tested it for a little while, but not nearly long enough to be sure that it works properly, so you guys can all help me test it by downloading and trying it out :)\r\n\r\nCheers,\r\nColonialRaptor",
  "categoryId": "83",
  "version": "0.1",
  "author": "Colonial Raptor",
  "createdUnix": "1329697549",
  "updatedUnix": "1329697900",
  "containsAdultContent": false,
  "uploadedBy": "ColonialRaptor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33956",
      "name": "Clears Skies - No More Dragons",
      "version": "0.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Clears Skies - No More Dragons-10479-0-01.rar",
      "uploadedUnix": "1329697900",
      "modVersion": "0.01",
      "virusScanUrl": "https://www.virustotal.com/file/b34f8784935c478fd585c89100c30ae14ff87576567384060d2aa1eeb4841e33/analysis/1406697127/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Clears%20Skies%20-%20No%20More%20Dragons-10479-0-01.rar?fid=33956&ttl=1535770887&ri=8192&rs=8192&setec=11fec5c1e9a79526ce8774695ef20bb7"
    }
  ]
}