{
  "modId": 10471.0,
  "modName": "Aleks Armor Skills Overhaul - AASO",
  "summary": "Better block and armor skill scaling, three new perks one for block and two for armor skills, rebalanced and reworked some vanilla perks. New perks include: Deadly Recoil, Adventurer, Reactive Plating/Padding. Works with existing characters.",
  "descriptionHtml": "AASO is a second mod in my upcoming overhaul series. If you like the mod you can also check [url=http://skyrim.nexusmods.com/downloads/file.php?id=9419]Alek\\'s Weapon Skills Overhaul - AWSO[/url]\r\n\r\nAASO features overhaul of block, heavy and light armor skills and perks. Each one of three skills gets better skill scaling, improved existing perks where needed and add couple of cool new and unique ones. By default armor rating skill multiplier is 1.4 when at 100 skill and with 5 ranks in first tier perks you get total of x2.8 armor rating at 100 skill. I changed skill scaling multiplier to 2.5 which is less than 2.8 but addition of new perks and changes to old ones should very much make up for it. Default perk layout remains so it doesn\\'t break vanilla perk dependency therefore existing characters can install and use this mod without the need to start the new game.\r\nBlock skill has gotten the most attention because it was broken and with addition of Adventurer perk torches can now be effective in both offense and defense. Overall block skill gets a damage increase rather than defense increase because it is exactly what was needed in my opinion. On the other hand armor skills now gain some elemental protection with a minor passive bonus and an active part so it still make first few nukes from mages count.\r\nAlso note that Argonians cannot use disarming bash because of missing keywords in race\\'s attack data records. I\\'ve fixed this in [url=http://skyrim.nexusmods.com/downloads/file.php?id=9419]AWSO[/url] or you can get standalone version from [url=http://skyrim.nexusmods.com/downloads/file.php?id=9593]here[/url], just do not use both.\r\n\r\n* In short this mod does the following:\r\n\r\n- First tier of perks no longer do what skill is supposed to do therefore armor rating scale better with the skill.\r\n- Most armor perks only require three pieces of armor to work (e.g. can work without wearing a helmet).\r\n- Added option to use torches more effectively.\r\n- Armor specializations include new perks which give unique protection against elemental damage.\r\n- Each of three skills gets one new perk.\r\n- Some original perks have been reworked or improved with scripts.\r\n- New unique perks: Deadly Recoil, Adventurer, Reactive Plating/Padding.\r\n- Fixed game bug where Matching Set Heavy perk did not include Ebony Armor.\r\n\r\n* Compatibility:\r\n\r\n- Not compatible at all with mods that change block and armor perks or alter armor rating skill scaling.\r\n\r\n* Install & Uninstall Notes:\r\n\r\n- You may use this mod with existing characters without any problems but backup your saves first.\r\n- Do not save the game with Reactive Plating/Padding bonuses active or resistances will stay boosted after you uninstall. To deactivate it just wait 10 seconds after last time being hit by a spell before saving or simply unequip some armor to let the perk conditions do the job.\r\n- Do not save the game when in melee combat or Unstoppable perk damage reflect bonus will stay boosted.\r\n- Uninstalling after picking new perks (Adventurer, Reactive Plating and Reactive Padding) will not refund the perk points.\r\n- After you\\'ve uninstalled the mod you will have to manually readd two perks if you learned them in order to reset the changes they\\'ve made to original ability spell values. These perks are Wind Walker (code:105F22) and Reflect Blows (code:105F33). First remove perks by using console: \\\"player.removeperk code\\\" then reenter console and add them back: \\\"player.addperk code\\\".\r\n\r\n* Change Log:\r\nV1.2\r\n- Reverted to original Deflect Arrows perk because Skyrim 1.5 patch fixed it in game code.\r\n- Fixed bug with Reactive Plating/Padding not increasing shock resistance.\r\nV1.1:\r\n- Fists of Steel renamed to Mighty Clench and now additionaly give immunity to disarm. Many people complained about Fists of Steel being useless and even more people were annoyed by being disarmed so this should make them all happy.\r\n- Reflect Blows reworked and is now called Unstoppable. The more enemies in your melee range the more damage you reflect and more health you regenerate.\r\n- Deft Movement now give increased movement speed and apply to elemental damage as well.\r\nV1.0:\r\n- Initial release.\r\n\r\n* Details:\r\n\r\n== Block Perks ==\r\n- Block skill originally did not affect the amount of damage blocked. I wasn\\'t able to figure out if it actually improved anything else other than reducing the stagger when blocking power attacks but it will now increase blocking damage up to 50% at 100 skill replacing the old Shield Wall perks. Scaling is made to work by creating a special hidden perk which is added automatically to the player when mod is loaded for the first time.\r\n- Shield Wall replaced with Deadly Recoil which is a new scripted ability (Blocking enemy attacks with a shield or a weapon have 20/40/60/80/100% chance of causing physical damage to the attacker). Damage scale with the block skill level naturally and is doubled if blocking a power attack. Blocking with a weapon deals slightly more damage. Maximum possible damage at 100 block skill is 60 if blocking a power attack with a shield or 80 if blocking with a weapon.\r\n- Quick Reflexes spell cannot be absorbed. Don\\'t know if it was really possible but I think I\\'ve read it somewhere. Changed the spell flags just to be safe.\r\n- Adventurer is the new perk that requires 20 skill and Deadly Recoil (Blocking with a torch is more effective and bashing cause the enemy to burn more intensively. Deadly Recoil can set enemy on fire when blocking with a torch). Basically it increase effectivenes when blocking with torch by 50% bringing it up from 50% to 75% of shield effectiveness. Bash fire damage without this perk is 3/2s and now it ranges from 2/4s to 20/4s so at 100 block skill it will deal max 80 fire damage over 4 seconds and cannot be stacked but bash fire damage is added to normal physical bash damage. Also with this perk blocking with a torch gains benefit from Deadly Recoil perks but deals fire damage instead of physical. Unfortunatelly 5 minute extinguish timer cannot be changed dynamically so you will have to collect torches as you adventure. Also note that power bash will not work with torches if you don\\'t have weapon equipped in right hand because of game mechanics.\r\n- Deadly Bash now increase bash damage up to ten times, scaling with the block skill. When you first time pick up this perk at 50 skill bash will deal 5 times more damage like the old perk did but increasing the skill further will also increase the damage smoothly until it reach its maximum at 100 skill. I don\\'t know what is the damage formula for bashing but I know from experience that x5 damage just didn\\'t cut it late game.\r\n\r\n== Heavy Armor Perks ==\r\n- Juggernaut perks effect changed (Incoming damage from enemy power attacks is reduced by 5/10/15/20/25% if wearing at least three pieces of Heavy Armor).\r\n- Fists of Steel renamed to Mighty Clench and have additional effect (While wearing Heavy Armor gauntlets you are immune to disarm and unarmed attacks do gauntlets\\' base armor rating in extra damage).\r\n- Reactive Plating perk requires 40 skill and Juggernaut perk. Gives new scripted ability (Reduces incoming elemental damage by 10% if wearing at least three pieces of Heavy Armor. Suffering from elemental damage increase corresponding resistance by 10% for 10 seconds, stacking up to five times). Each element is processed separately and has its own timer. When you are hit by elemental damage corresponding resistance is increased by 10% and timer is reset back to 10 seconds. There is a short delay of 2 seconds before another hit can be registered in order to make it work well when being affected by channeled spells.\r\n- Cushioned perk now requires at least three pieces of Heavy Armor to work (Half damage from falling if wearing at least three pieces of Heavy Armor).\r\n- Well Fitted perk changed slightly (Each piece of Heavy Armor worn gives 5% bonus to armor rating. Bonus applies only to Heavy Armor). Bonus is additive so when wearing full Heavy Armor you gain 20% bonus to armor rating.\r\n- Matching Set (25% bonus to armor rating if wearing a matched set of Heavy Armor) now supports Ebony Armor and still require all four pieces to work. Not to be confused with original description which said \\\"Additional 25%\\\" even though it was only 20% (x1.2) meaning that when you combine it with original Well Fitted 25% (x1.25) you get 1.25 x 1.2 = 1.5 which is exactly \\\"Additional 25%\\\" and not multiplicative. It now have multiplier of 1.25 to reflect the description but Well Fitted have new maximum of 1.2 which gives the same result just numbers have been swapped between these two perks and description changed to match the actual percentages.\r\n- Reflect Blows replaced with Unstoppable (While wearing all Heavy Armor and at least one enemy is in melee range you reflect 20% melee damage back to the attacker and regenerate 1% of your maximum health per second. Both effects are multiplied by the number of enemies).\r\n\r\n== Light Armor Perks ==\r\n- Agile Defender perk is the same as Juggernaut (Incoming damage from enemy power attacks is reduced by 5/10/15/20/25% if wearing at least three pieces of Light Armor).\r\n- Custom Fit perk is the same as Well Fitted (Each piece of Light Armor worn gives 5% bonus to armor rating. Bonus applies only to Light Armor).\r\n- Reactive Padding new perk is the same as Reactive Plating (Reduces incoming elemental damage by 10% if wearing at least three pieces of Light Armor. Suffering from elemental damage increase corresponding resistance by 10% for 10 seconds, stacking up to five times).\r\n- Wind Walker now requires at least three pieces of Light Armor (Stamina regenerates 50% faster if wearing at least three pieces of Light Armor).\r\n- Deft Movement improved (While wearing all Light Armor you move 20% faster and have 10% chance of avoiding all physical or elemental damage).",
  "categoryId": "79",
  "version": "1.2",
  "author": "Alek",
  "createdUnix": "1329694956",
  "updatedUnix": "1332266160",
  "containsAdultContent": false,
  "uploadedBy": "mitchalek",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33934",
      "name": "AASO_1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10",
      "fileName": "AASO_1_0-10471.zip",
      "uploadedUnix": "1329695017",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f6d412269351a4ab71b8f372b9ee72317587d7104526e97023542322740375c5/analysis/1406696979/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AASO_1_0-10471.zip?fid=33934&ttl=1535770870&ri=8192&rs=8192&setec=e656f0553ec0774e01f7570758c8dd41"
    },
    {
      "fileId": "37285",
      "name": "AASO_1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "AASO_1_1-10471.zip",
      "uploadedUnix": "1330290711",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d0e23b60eee1867ae107e965baf2dd0d493be515d47a302ab314e335063567ec/analysis/1406715664/",
      "changelogHtml": " Fists of Steel renamed to Mighty Clench and now additionaly give immunity to disarm. <br/> \n Reflect Blows reworked and is now called Unstoppable. The more enemies in your melee range the more damage you reflect and more health you regenerate. <br/> \n Deft Movement now give increased movement speed and apply to elemental damage as well. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AASO_1_1-10471.zip?fid=37285&ttl=1535770871&ri=8192&rs=8192&setec=4a21bf1f7ef1b62804ec98df7054fecc"
    },
    {
      "fileId": "45136",
      "name": "AASO_1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "AASO_1_2-10471-1-2.zip",
      "uploadedUnix": "1332266160",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/cb7af9d2a94fa198a3f07988dbaee560d0035d90b519544cbb30e113c7e7eb7e/analysis/1406769815/",
      "changelogHtml": " Reverted to original Deflect Arrows perk because Skyrim 1.5 patch fixed it in game code. <br/> \n Fixed bug with Reactive Plating/Padding not increasing shock resistance. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AASO_1_2-10471-1-2.zip?fid=45136&ttl=1535770871&ri=8192&rs=8192&setec=9dc7fb938732de33e317c42b5c0ab0d3"
    }
  ]
}