{
  "modId": 10510.0,
  "modName": "Additional Dark Brotherhood Members",
  "summary": "Adds six new members to the Dark Brotherhood.  ATTN:  Please see long description",
  "descriptionHtml": "Update: I&#39;ve been asked a few times, and you have likely figured out, but I&#39;m no longer working on this mod.  Sadly, I just didn&#39;t have the time to work on it.  Still don&#39;t&#33;  At the time of this mods release, there wasn&#39;t a lot of mods out for the Dark Brotherhood.  Since then, there&#39;s been some really great mods for the DB.  Go try them, if you haven&#39;t already&#33;  This mod was given a lot more credit than it deserves, so thank you all for the support.  Now, I think I hear whispering from the Night Mother&#39;s coffin... you better go check that.\r<br />\r<br />V. 1.1\r<br />\r<br />- Changed combat styles for members.  Their fighting should be better.\r<br />- Changed base inventory.  If you have added anything to their inventory, it should not be affected.  But just in case, you might want to take all the stuff off them that you really want.\r<br />- Added a few more spells and a few perks to members.  They shouldn&#39;t be overpowered, but they should be a little more powerful than a normal follower.  If they do feel overpowered, let me know.\r<br />- Improved idle in the Sanctuary.\r<br />- Upgraded Cicero.  He now dual-wields and has a few perks.\r<br />- Upgraded Initiates.  The female one now dual-wields.  Downgraded daggers to Orcish.  \r<br />- Upgraded the Spectral Assassin.  He now has a few defense spells, has better weapons, and fights as an assassin.  He should be overpowered at early levels but still weak at later levels.  Did I mention he dual-wields too?  Please give me feedback.\r<br />\r<br />I&#39;m still working on version two with full voiceovers and recruiting quests.\r<br />\r<br />\r<br />\r<br />\r<br />SPOILERS to the Dark Brotherhood questline to follow.   ATTENTION:  This mod should only be activated AFTER you complete the Dark Brotherhood questline.  The six added members are put right inside the Dawnstar Sanctuary... there&#39;s no triggers or events to not have them there if you haven&#39;t gained it yet.  I assume they will cause problems with the quest to hunt down Cicero if you have not completed it.  I&#39;m working on a second version of this that will fix that.\r<br />\r<br />I found the Dawnstar Sanctuary to feel rather empty after you gain it... you&#39;re down to two original members and two boring Initiates.  This mod adds SIX more members that are placed around the Sanctuary.  They have generic voices and they won&#39;t refer to you as the listener, etc, but they will follow you if asked.  They are loyal to the Brotherhood and will join together to attack you if provoked.\r<br />\r<br />1:  Alawen Darkwood, Female Bosmer Scout\r<br />2:  Narisa Dreth, Female Dunmer Nightblade, Flames/Shock\r<br />3:  Lokir Reignheart, Male Nord Conjurer, Frost\r<br />4:  Daron, Male Redguard Assassin\r<br />5:  Do&#39;Sava, Male Khaijit Scout\r<br />6:  Grey-Soul, Female Argonian Nightblade, Frost\r<br />\r<br />Ah, almost forgot&#33;  Also adds a new spider named Amy&#33;  (Update:  There is now a second file that you may download that does not include the new spider.  You only have to download the second file.)\r<br />\r<br />They can be killed and do not respawn, be careful if you like &#39;em&#33;  I changed the Initiates so they can be killed, but they still respawn.\r<br />\r<br />If you like this one, please remember to endorse&#33;  It&#39;ll keep me going for the next version.  This is my first mod ever.\r<br />\r<br />VERSION TWO NEWS:\r<br />\r<br />Wow, okay then... I&#39;m really glad to see how much support this mod has had.\r<br />\r<br />I&#39;ve been gone a bit.  I was pretty far into making the the first dungeon, I had voice files just about figured out, and bam... lost pretty much everything.  My BACKUP file was corrupted.  I thought about starting from again and I just didn&#39;t have the energy at the time.  I&#39;m sorry.\r<br />\r<br />I have a bit more time for mods now, and I&#39;m going to try to get back right back into this.  I&#39;m sorry for the delay.\r<br />\r<br />No, I will not make different versions of this mod.  No, I can&#39;t really tell you if this mod is compatible with some other random mod.  Yes, I might consider adding some more beds or such to the sanctuary... but that might interfere with some other mod you guys have for the sanctuary.  I can&#39;t make everything perfect for everyone.\r<br />\r<br />I am considering making the followers essential.  I personally don&#39;t like being able to kill something... I can have them set that only the player can kill them, but this can still lead to accidents with a badly aimed arrow or spell.  I dislike the idea of having them respawn even less... the iniates sorta make sense because their named.  I think it&#39;s silly for the named ones to come back from the dead all the time.",
  "categoryId": "25",
  "version": "1.1",
  "author": "icestormganon",
  "createdUnix": "1329719374",
  "updatedUnix": "1331278663",
  "containsAdultContent": false,
  "uploadedBy": "icestormganon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41631",
      "name": "Additonal DB Members",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Additonal DB Members-10510-1-1.zip",
      "uploadedUnix": "1331278509",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/8d8ffcc1859ef99c6738a796d247a6a2bef7bb7bd0479affe47018c7f3b40585/analysis/1406739370/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Additonal%20DB%20Members-10510-1-1.zip?fid=41631&ttl=1535770947&ri=8192&rs=8192&setec=4f4848339994454eb49c9e93f9ec92b9"
    },
    {
      "fileId": "41632",
      "name": "Additonal DB Members NO SPIDER",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Additonal DB Members NO SPIDER-10510-1-1.zip",
      "uploadedUnix": "1331278663",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/65fdfdf009845a3b4476fc7581974bd0da1d3d0b8fa66a6782f32e3a54749d2e/analysis/1406739371/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Additonal%20DB%20Members%20NO%20SPIDER-10510-1-1.zip?fid=41632&ttl=1535770948&ri=8192&rs=8192&setec=7b6ea82659ebd24924bd95d317263680"
    }
  ]
}