{
  "modId": 10513.0,
  "modName": "Uvamdaras-Palace Of The Dragons",
  "summary": "Still in it\\'s Beta stages, this mod adds Adds a very large world to Skyrim, with a castle exterior, throne room, library, bedroom, crafting areas, caves, barracks, guardian dragon, captains quarters, and study, with beautiful scenery. (includes 52 weapon racks, 99 bookcases shrines of all the divines, and weapon plaques. Crafting areas include for",
  "descriptionHtml": "[img]http://fc08.deviantart.net/fs70/i/2012/050/0/3/uvamdaras_pic_by_bluefox202-d4qc6re.png[/img]\r\n\r\n*Notice* I uploaded this on Steam Workshop too. :)\r\n\r\nStill in it\\'s Beta stages, this mod adds Adds a very large world to Skyrim, with a castle exterior, throne room, library, bedroom, crafting areas, caves, barracks, guardian dragon, captains quarters, and study, with beautiful scenery. (includes 52 weapon racks, 99 bookcases shrines of all the divines, and weapon plaques. Crafting areas include forge, sharpening wheel, workbench, smelter, wood chopping block, enchanting table, and alchemy table)\r\n\r\nInspiration: Uvamdaras was inspired by the great dragon palace Uvamdaras in a book that I am currently writing. Since I started playing Skyrim I always thought of how amazing it would be walk around in the places in my book, so when the creation kit came out, I seized the opportunity to do just that, but made it more suitable for human residents than dragon. I myself am very new to modding, this being my second mod ever, but luckily I have an abundance of free time, which I have devoted to learning the ins and outs of creating mods. I originally wasn\\'t going to release this till it was completed, but what the heck, why not release it early. The dragon outside of the palace is actually a character from the book Uvamdaras came from named Níðvauggr who is Uvamdaras\\'s eternal guardian. I hope you enjoy Uvamdaras! :)\r\n\r\n1.0~\r\n\r\nIncludes: castle exterior, throne room, library, bedroom, crafting areas, caves, barracks, guardian dragon, captains quarters, study, 52 weapon racks, 99 bookcases, shrines of all the divines, 6 mannequins, weapon plaques, forge, sharpening wheel, workbench, smelter, wood chopping block, enchanting table, and alchemy table, and throne.\r\n\r\nBugs: *If you have experience in fixing bugs and think you can fix one of these, please email me at airkonic@gmail.com\\\"\r\n\r\n1- When Níðvauggr flies, he flys through the crystals and palace\r\n2- Mannequins dissapear sometimes\r\n\r\nSupporting Uvamdaras~\r\n\r\nInterested in supporting? Thanks for even considering. Email me at airkonic@gmail.com for more info, no money needed.  :)",
  "categoryId": "68",
  "version": "1.0",
  "author": "Vulden",
  "createdUnix": "1329723074",
  "updatedUnix": "1329723358",
  "containsAdultContent": false,
  "uploadedBy": "Vulden",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34117",
      "name": "Uvamdaras 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "61",
      "fileName": "Uvamdaras 1_0-10513-1-0.zip",
      "uploadedUnix": "1329723358",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bf6761d3c604ae4a0056447f22f4a72f6d4cbb844351eae2a9c2b6bc5978e9a7/analysis/1406697859/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Uvamdaras%201_0-10513-1-0.zip?fid=34117&ttl=1535770952&ri=8192&rs=8192&setec=ec3082735432bfb57ba6a752e1605551"
    }
  ]
}