{
  "modId": 10512.0,
  "modName": "Bronze and Stone",
  "summary": "\tBronze and Stone is a mod that aims to completely overhaul the Dwemer and Falmer in\r\nSkyrim as well as add the Reachwind Valley Hold to the Reach. (see story for details)",
  "descriptionHtml": "  Bronze and Stone is a mod that aims to completely overhaul the Dwemer and Falmer in\r\nSkyrim by adding new dungeons ruins, and structures to the game. The Imperial Legion will also be improved. \r\n\r\nShort Summary( it\\'s much more detailed on mod db pg): Takes place three and a half years after slaying Alduin. Imperials disover largest gold vein in Imperial History in the Reach, Reagar Mines. Imperials build new Citadel, The Guard of the Reach, around the Reagar Mines with new wealth. Dunmer Senator, Theras Durai, is voted to succeed Titus Mede II as Emperor, name changed to Marcus Theras. Imperials stumble upon the mythical Dwemer capitol of Lezkar\\'Marka in the Reagar Mines. Emperor Marcus Theras send the Argonian Legion to the Reachwind Valley to explore the Dwemer ruins. Argonian legion builds Camp Blackswamp around the Reachwind Eyrie. Unknown disaster in Summerset Isle results in Thalmor agents in Skyrim and Thalmor Soldiers in Valenwood to be recalled back to the Isle. After two years of silence from the Dominion Emperor Marcus Theras takes the documents of the Gold-White Concordat, declares the treaty as unacceptable, and burns it in front of the Thalmor ambassador in the Imperial City. The Emperor expells all Thalmor from the Imperial provinces and reinstates the worship of Talos across all Imperial provinces. The Night of Lights causes a mass panic throughout  Tamriel. Dwemer structures begin appearing all over Tamriel. The Dragonborn is called on once again to save Skyrim. The fears of the ancients have some true, the return of Bronze and Stone is at hand.  \r\n\r\nPlan: \r\n-Now I have decided to not release small aesthetic additions anymore so instead the next release, which will be 2.0 will add the Reachwind Valley Hold to the Reach with the following:  \r\n\r\n               -CampBlackswamp\r\n\r\n                -Questline in Camp Blackswamp\r\n\r\n              - Imperial Eyrie (Reachwind Eyrie)\r\n\r\n              - Imperial Citadel, The Guard of the Reach\r\n               \r\n              - Questline in The Guard of the Reach\r\n\r\n               -Argonian Imperial Soldiers\r\n\r\n              - Regar Mines\r\n\r\n              - Questline in Regar Mines\r\n           \r\n              -Mining town of Reagar\\'s Folly (located outside the Citadel)\r\n                  \r\n              - and Emperor Marcus Theras and his Black Guard ( Dunmer Wizards and Veteran Imperials) may make an  appearance.\r\n\r\n\r\n***Report Any Issues***\r\n\r\nI am working alone at the moment  and will take any help I can get because this mod is huge in scale so just message me :) \r\n\r\n\r\n***Much more to come....\r\n\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "79",
  "version": "1.25",
  "author": "BronzeKing101",
  "createdUnix": "1329722393",
  "updatedUnix": "1329722717",
  "containsAdultContent": false,
  "uploadedBy": "Train101",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34116",
      "name": "Bronze and Stone",
      "version": "1.25",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "153",
      "fileName": "Bronze and Stone-10512-1-25.rar",
      "uploadedUnix": "1329722717",
      "modVersion": "1.25",
      "virusScanUrl": "https://www.virustotal.com/file/deba76f1db6f517be7a8a3f7da90ed605f889a75e54af5c7ec8469a303cd4227/analysis/1406697858/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bronze%20and%20Stone-10512-1-25.rar?fid=34116&ttl=1535770950&ri=8192&rs=8192&setec=0fa43e9f056209145b257eea9315f0f0"
    }
  ]
}