{
  "modId": 10524.0,
  "modName": "ShipHome - A Unique Player Home",
  "summary": "A beautiful and Unique player home, with NO LOADING SCREENS!",
  "descriptionHtml": "[i]On the verge of a daunting precipice, there lies the remains of an old ship, long forgotten by time, it lies trapped, intact, in the side of a glacier. Hmm, it looks like someone built a house on it...how incredibly clever and good looking they must be, pity they\\'re not around...I suppose I\\'ll stay here for a while![/i]\r\n\r\n[center] [size=200] Welcome to ShipHome! [/size] [/center]\r\n[IMG]http://i205.photobucket.com/albums/bb279/ripped_apart_inside/oie_2013194CVQKx75E.jpg[/IMG]\r\n\r\n[center] [youtube] 2O8XMRl0vXg [/youtube] [/center]\r\n\r\n[center]\r\nThanks for taking a look at my newest creation, ShipHome! Fans of my mods (Both of you) will know that my mods are unique, in that, I build all of my homes from various statics I dig around for in the CK! The benefit? Unique and beautiful homes, with no loading screens! You will NEVER find another home like ShipHome I am sure of it. Real views of beautiful ocean vistas! Incredibly time consuming to make! Creativity out the wing-wong! Take a look at the screens, but don\\'t blame me if your hair starts on fire, FROM THE AWESOME! [/center]\r\n\r\n[center] Edit: This is V1 of this mod, there will be many updates based on feedback and my own ideas, Let me know what you guys think! [/center]\r\n\r\n[center] Edit: The location of the home is North of Solitude quite a ways out in the ocean, There is a fast travel marker for convenient travel. Also because you can\\'t get there from the water. [/center]\r\n\r\n[center] [size=200] Features! [/size] [/center]\r\n[center]\r\n*Real Views from the windows!\r\n*No Loading screens\r\n*Teeny Tiny Shrine to Talos (Because I love Talos!)\r\n*Fully Indoor/Outdoor home!\r\n*Named/Non-Respawning/Player Owned Storage!\r\n*Cookpot!\r\n*IT\\'S A SHIP JAMMED INTO A GLACIER WITH A HOUSE ON IT I MEAN COME ON!?! [/center]\r\n\r\n1. Installation\r\n\r\n2. Uninstallation\r\n\r\n3. Breakfast\r\n\r\n\r\n\r\n1. Installation: To install Shiphome, simply put the .esp into your /data folder and activate! Simple!\r\n\r\n2. Uninstall: To uninstall, simply pour a glass of incredibly wet water into your computer case. EASY!\r\n\r\n3. Breakfast: Scramble up 3 eggs, add in chopped red peppers, a small bit of chopped onion, some chopped spinich, Salt and pepper to taste, Enjoy with Hollandaise sauce!\r\n\r\nBugs/Incompatibility: This mod will conflict with anything that messes with the same area in game. I highly doubt it will be an issue. It may have bugs, I\\'ve tested it as thoroughly as I can, but there is always a chance! Save carefully! Because of the nature of this mod (Built entirely out of statics) lower end computers will have issue with framerates. There\\'s nothing I can/will do about it. I run it at 60fps, and my computer is Mid-high end so I did the best I could to save fps. ",
  "categoryId": "67",
  "version": "1.0",
  "author": "Sislaen",
  "createdUnix": "1329731828",
  "updatedUnix": "1329731891",
  "containsAdultContent": false,
  "uploadedBy": "Sislaen",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34152",
      "name": "ShipHome v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3077",
      "fileName": "ShipHome v1-10524.7z",
      "uploadedUnix": "1329731891",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/87655a016c108df252ca70eec4ead1b0b020f5a4c388e26482cda304e4d2c160/analysis/1406698035/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ShipHome%20v1-10524.7z?fid=34152&ttl=1535771007&ri=8192&rs=8192&setec=42af9585a41383d32e48c71601cc9966"
    }
  ]
}