{
  "modId": 10537.0,
  "modName": "Engineering",
  "summary": "Allows you to craft dwarven minions to aid in battle.\r\n\r\nThis mod allows you to use the forge to make blueprints for dwarven constructs. The blueprints are under the miscellaneous section of the crafting menu. The blueprints work like scrolls and let you make dwarven spiders, spheres, and guardians.",
  "descriptionHtml": "Allows you to craft dwarven minions to aid in battle and help carry your gear.\r\n\r\n=====================\r\nBrief Description\r\n=====================\r\n\r\nThis mod allows you to use the forge to make blueprints for dwarven constructs. The blueprints are under the miscellaneous section of the crafting menu. The blueprints work like scrolls and let you make dwarven spiders, spheres, and guardians. Each dwarven construct takes different items to make them and different ranks of blacksmithing.\r\n\r\n=====================\r\nWhat is Added\r\n=====================\r\n\r\n-Mini Spider: Small and easy to destroy, but very easy to make.\r\n(Requirements: Leather and Steel Smithing; 1 Dwarven Oil, 1 Dwarven Ingot, 1 Petty Soulgem, and 2 Steel Ingots)\r\n\r\n-Spider Protector: Bigger version of the spider that is tougher and can carry 300(weight).\r\n(Requirements: Ancient Knowledge, Dwarven Smithing; 1 Dwarven Oil, 1 Common Soulgem, 2 Dwarven Gears, 2 Iron Ingots, and 4 Dwarven Ingots)\r\n\r\n-Sphere Knight: Higher health and slightly faster than the spider, the knight makes a decent tank and can carry 100(weight).\r\n(Requirements: Ancient Knowledge, Dwarven Smithing; 2 Dwarven Oil, 1 Dwarven Gyro, 1 Common Soulgem, 2 Steel Ingots, and 5 Dwarven Ingots)\r\n\r\n-Centurion Titan: Big and slow, the Titan deals massive damage and takes quite a beating, it carries 600(weight)\r\n(Requirements: Ancient Knowledge, Ebony Smithing; 1 Dwarven Cog, 1 Dwarven Gear, 3 Dwarven Oil, 1 Dwarven Centurion Dynamo, 1 Grand Soulgem, and 14 Dwarven Ingots)\r\n\r\n-Sphere Ebony Knight: Has ebony plating offering more health and resistance from the normal Sphere Knight, it can carry 200(weight)\r\n(Requirements: Ancient Knowledge, Ebony Smithing; 2 Dwarven Oil, 1 Dwarven Gyrom, 1 Greater Soulgem, 2 Gold Ingots, 3 Dwarven Ingots, and 6 Ebony Ingots)\r\n\r\n-Spider Protector Ebony: Has ebony plating offering more health and resistance from the normal Spider Protector, it can carry 400(weight)\r\n(Requirements: Ancient Knowledge, Ebony Smithing, 1 Dwarven Oil, 1 Greater Soulgem, 2 Dwarven Gears, 2 Gold Ingots, 3 Dwarven Ingots, and 5 Ebony Ingots)\r\n\r\n=====================\r\nHow To Guide\r\n=====================\r\n\r\nFirst, make sure you have the prerequisites for the construct you need to make. The main requirements are perks from the smithing skill tree and Ancient Knowledge, gained by completing the Unfathomable Depths quest. http://elderscrolls.wikia.com/wiki/Unfathomable_Depths\r\n*The reason I am using \\\"Ancient Knowledge\\\" as a prerequesit is for the immersion factor.\r\n\r\nNext, you will need to get the required material for the construct you wish to build.\r\n\r\nUse a forge and go to the Misc. category, the blueprints should appear there if all prerequistes have been filled.\r\n\r\nAfter making the blueprints, go to the scroll section of your inventory and use the blueprint, you will need to cast it like you do a normal scroll; there is no skill requirement for using a blueprint. The construct will appear next to you, though not necessarily where you were aiming at.\r\n\r\nYou now have a dwarven construct which you can tell to wait, follow, or even hold your gear for you. It will follow you and help out in combat. Have fun!\r\n\r\nI plan to add in a new perk obtained by having gained Ancient knowledge and then reading some select Dwarven history books and research notes. The new perk will allow you to deactivate and salvage enemy dwarven constructs as well as salvaging parts off the ones make.\r\n\r\n=====================\r\nUpdates\r\n=====================\r\n\r\nVersion 1.09: Added two new constructs, the Ebony Knight and Ebony Protector. Made a few changes to dialogue and constructs AI.\r\n\r\nVersion 1.08: Gave Knights a dwarven sphere bow and arrows and that should fix problems they have had with attacking; you may need to create a new sphere for this to work properly though. Added them into the playerfollowers faction which I hope will make it so they don\\'t have problems with your chosen army side.\r\n\r\nVersion 1.07: Rearchived my files and now the blueprint summons and all dialogue functions are working, thanks to d_leucas for testing it out for me!\r\n\r\nVersion 1.06: Changed the requirement of filled soulgems to regular soulgems.\r\n\r\nVersion 1.05: Fixed some spelling errors, upgraded construct speed.\r\n\r\nVersion 1.04: Now has wait and follow commands, changed some requirements, increased weight and value of blueprints. Made adjustments to summon effect to hopefully fix problems some players were reporting.\r\n\r\nVersion 1.03: Added real trading, made it more difficult to create the blueprints, now requires \\\"Ancient Knowledge\\\" for Titan, Protector, and Knight. All constructs are now permanent until they are destroyed.\r\n\r\n\r\nFeedback is always helpful, please let me know if you run into any bugs or suggestions\r\n\r\n-I\\'d like to thank Tuddywutwut and his original mod Skittles which inspired me to make this mod.",
  "categoryId": "65",
  "version": "1.09",
  "author": "Vault Boy",
  "createdUnix": "1329739044",
  "updatedUnix": "1339349187",
  "containsAdultContent": false,
  "uploadedBy": "Varence",
  "primaryFile": null,
  "files": [
    {
      "fileId": "36585",
      "name": "Engineering Old",
      "version": "1.07",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "Engineering Old-10537.rar",
      "uploadedUnix": "1330158607",
      "modVersion": "1.07",
      "virusScanUrl": "https://www.virustotal.com/file/2a9fe900111afafb41b439f1f223c8558735197c4c1b8ef63f3e4268c9123898/analysis/1406712016/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Engineering%20Old-10537.rar?fid=36585&ttl=1535771016&ri=8192&rs=8192&setec=16d09ffcb2487f480a2c68be0edb0768"
    },
    {
      "fileId": "59483",
      "name": "Engineering",
      "version": "1.08",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "Engineering-10537-1-08.rar",
      "uploadedUnix": "1336393771",
      "modVersion": "1.08",
      "virusScanUrl": "https://www.virustotal.com/file/31c4fad193d6e64fa88c42bfc8aad4401e652737cd433a307b00da8a0dc67fdd/analysis/1406874844/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Engineering-10537-1-08.rar?fid=59483&ttl=1535771017&ri=8192&rs=8192&setec=aa7e892819bba59c4e2f29f29e906c71"
    },
    {
      "fileId": "67151",
      "name": "Engineering v109",
      "version": "1.09",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5451",
      "fileName": "Engineering v109-10537-1-09.rar",
      "uploadedUnix": "1339349187",
      "modVersion": "1.09",
      "virusScanUrl": "https://www.virustotal.com/file/ad8111ede48fbf59b99d94782377899fc0cbda60781a69b010d1f8f3632dd90f/analysis/1406950809/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Engineering%20v109-10537-1-09.rar?fid=67151&ttl=1535771018&ri=8192&rs=8192&setec=963db84bed5668eb35c05e80f66b3178"
    }
  ]
}