{
  "modId": 10535.0,
  "modName": "Vesper Sanctuary",
  "summary": "Some say Castle Vesper is abandoned, forgotten.. empty. But it is said when walking along the long dark road it is possible to see shadowy figures standing along the wall. Motionless sentinels silhouetted against the night sky.. waiting..",
  "descriptionHtml": "(Work in progress) If you wish to contribute anything I will gladly accept. :D\r\n\r\nStatus Update:\r\nGood news first I guess. I\\'ve discovered a fix for the grass issue, :D.\r\nAlso I\\'ve been looking into better ways to handle guards and other nuances, so that should be more streamlined.\r\nThen the bad news. The CK\\'s alias system is a M****F******A**hole. What that means is that the quest is coming along much more slowly than I originally anticipated. Once I get the hang of this (if) I\\'ll be able to add content relatively easily. I plan to have the quest ready within the next few days hopefully. So stay tuned. :D\r\n\r\nYou may also like my other mods:\r\nWestern Watchtower Rebuilt    http://skyrim.nexusmods.com/downloads/file.php?id=9555\r\nWhitewatch Tower Camp    http://skyrim.nexusmods.com/downloads/file.php?id=9277\r\n\r\nVesper Sanctuary is a castle West of Solitude geared toward vampire characters. Currently the player owns the castle but I\\'m working on a quest of acquisition.\r\n\r\n(Features)\r\n- Adds Castle Vesper\r\n- Adds a library and a council chamber to Vesper Keep\r\n- Adds 3 towers as living quarters\r\n- Adds a dungeon for thralls\r\n- Adds a blood storage room (ice room)\r\n\r\n(Installation)\r\nExtract esp to data folder\r\n\r\n(Uninstallation)\r\nDelete esp from data folder\r\n\r\n(BUGS)\r\nStill haven\\'t found a fix for the floating grass issue. Will update once a solution is found.\r\nLibrary bookshelves may not work very well at the moment. (took 3 hours for just that lol)\r\nBuildings may disappear at times. Known issue around the Nexus. Travel indoors and back out (refresh cell) to fix. Working on a solution.\r\n\r\n(The Quest) SPOILER ALERT\r\n - The quest revolves around a small coven of vampires who own Castle Vesper and who (somehow) capture/imprison you. Eventually they decide to allow you to become one of their coven/family. You are then granted the southeast tower (one with the round balcony) as a player home. The other members of the coven (6) own the rest of the castle respectively and will eventually have their own treasure room/thralls/tower/roles in the family. I\\'m trying to devise a way that the player could bring back riches/treasures/bottled blood/thralls to help support the coven and subsequently unlock services/more of the castle.",
  "categoryId": "68",
  "version": "1.0",
  "author": "Jace_1991",
  "createdUnix": "1329737986",
  "updatedUnix": "1329738041",
  "containsAdultContent": false,
  "uploadedBy": "Jace_1991",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34179",
      "name": "Castle Vesper",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "251",
      "fileName": "Castle Vesper-10535-1-0.rar",
      "uploadedUnix": "1329738041",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ab443bbc53629800da72b0b7c2d3543b2bec4d6d6c0703a354b3b3406adeb0e3/analysis/1406698157/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Vesper-10535-1-0.rar?fid=34179&ttl=1535771013&ri=8192&rs=8192&setec=c47b2df566d5e8c34c6e98a74cc8f157"
    }
  ]
}