{
  "modId": 10564.0,
  "modName": "Fall of Ithenzard Zel - Aringols Cairn- Preview",
  "summary": "a Preview of am of I\\'m making, Just the first dungeon",
  "descriptionHtml": "-------update---------\r\nOne minor update, the voices now sound a lot better; I forgot about audacity, I\\'ve cleaned the audio up and changed pitch and and used equalisation to increase the base (was a tiny bit tinny) now they sound right, I really can\\'t do an old mans voice, it\\'s amazing what you can do with a pitch change :D.\r\nAlso I worked out why the actors wearnt helping each other, I forgot to set there AI data and releation ships up properly\r\n\r\n---------update-------------\r\nI\\'ve had a go at making the quest and to be frank... I suck, I can come up with a story line easily but actually making the game do it is altogether a differant thing, so unless some one can help this thing goes no further, bad voice acting an all.\r\n\r\nP.s. It is a little awesome to hear one\\'s own voice in game, even if it\\'s bad :D\r\n\r\n-----------------V0.2----------------\r\nI\\'ve decided to release this as is and then try and work on the quest, part of the mod, if i can finish this then the rest of it should flow, well I hope so at any rate.\r\nThis update adds an entrance, and some dwemer ruins near by, I will advise one thing though, I\\'m not sure if the nav mesh (for outside  is working for it but it seeamed to be ok. at least now the dungeon has an entrance.\r\n\r\n\r\n----------update----------------\r\nI\\'ve finished the dungeon, the entrance and even the bits outside that lead you to it, The problem is doing making quest. I\\'ve looked at it and I have No real idea how to go about doing this, I\\'m still looking through tuts but at this rate i\\'m Never gonnah learn how to make it, so unless some one wants to colaborate and help (I give you the quest stuff and you make it) then AS much as it sucks tosay this, This thing is probably never gonna go any further, stuill if it doesn\\'t Then i\\'ll release as is. Least there\\'s a new dungeon to explore with a bit of story.\r\n\r\n\r\n------------------V0.1--------------------------\r\nFirst off, this is my first attempt at a mod for a bethesda game, actually it\\'s my first mod period.\r\nSecond of all this dungeon has no ground side entrance and it won\\'t untill I release the full preview containing the first chapter of my full mod (after which i willl work on and release the full mod) this is a release to see what you think and to see what improvements can be made on it. \r\nSo save your game before you try this as the dungeon is fairly difficult. \r\nto access type in the command console \\\"COC aringolscairn\\\" without the apostrophes.\r\n\r\nThere is a hint as to the nature of the full mod in the dungeon see if you can find it. Also note there are three chests and a few urns for loot.\r\n\r\nP.S. the whole point of this mod (int it\\'s full version) is to learn the tool kit and at the same time get a quest idea made.",
  "categoryId": "88",
  "version": "0.2",
  "author": "rpgjaguar",
  "createdUnix": "1329761502",
  "updatedUnix": "1331132572",
  "containsAdultContent": false,
  "uploadedBy": "rpgjaguar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34302",
      "name": "AringolsCairn",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35",
      "fileName": "AringolsCairn-10564.zip",
      "uploadedUnix": "1329761753",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/eac1107f3011f6c6bac7d4606d5cd2ac17e493a1d9ba218b8fa46689315b7f50/analysis/1406698692/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AringolsCairn-10564.zip?fid=34302&ttl=1535771053&ri=8192&rs=8192&setec=369cb8f95ec5314d459633ce4892ea94"
    },
    {
      "fileId": "41034",
      "name": "AringolsCairn second version",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "271",
      "fileName": "AringolsCairn second version-10564.zip",
      "uploadedUnix": "1331132572",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/b35310e96619cf97678809833fac94e96b4e8ae01e96b6dcb074fb3e6f2bd42e/analysis/1406736193/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AringolsCairn%20second%20version-10564.zip?fid=41034&ttl=1535771053&ri=8192&rs=8192&setec=7888955647812eb7997c50d81f4914aa"
    }
  ]
}