{
  "modId": 10578.0,
  "modName": "Portable OnDemand Disposable Unlimited Mannequins SPODUM",
  "summary": "Works with ALL BODY REPLACER MODS.  There are SIXTY SEVEN different types of Mannequins available.  POSE them, MOVE them, RESIZE, DELETE, even ANIMATE them!  CHANGE RACES/GENDER! Even display DRAWN WEAPONS!",
  "descriptionHtml": "**********\r\nI, SLuckyD, am no longer developing or supporting this mod.\r\n**********\r\n\r\n\r\n\r\nPortable On-Demand Disposable Unlimited Mannequins v1.5\r\n(aka SPODUM)\r\n- a NEAR-Total Mannequin System Remake mod by SLuckyD\r\n\r\n*** IF UPGRADING FROM A PREVIOUS VERSION: See special note below BEFORE installing this version. ***\r\n\r\n\r\n[SUMMARY]\r\n- SIXTY SEVEN (67) different races/types of Mannequins\r\n- Change any Mannequin\\'s RACE or GENDER at will\r\n- ALL the HUMANOID races, MALE and FEMALE; ALL of which will display the following:\r\n\t- Armor, boots, gloves\r\n\t- Rings, amulets, diadems, helmets & masks\r\n\t- Weapons and Shields\r\n\t- Bows and Quivers\r\n- Weapons are equipped, an optional pose allows them to be drawn.\r\n- Over TWO DOZEN different creatures, machines, animals, and undead (all of which may only be used as storage)\t\r\n- ALL Mannequins also function as PERMANENT STORAGE, allowing Player to store ANY kind of item\r\n\t(WARNING: they\\'ll consume most types of your consumables!)\r\n- Real-time REPOSITIONING is available (with a separate vertically raise/lower option)\r\n- Choose from different POSES/IDLES to play\r\n\t- Optional Living Mode behavior setting breathes life into Mannequins (yet they always remain in-place)\r\n- PACK IT UP completely, and re-place it anywhere in the world - indoors or outside!\r\n- KILL your Mannequins to delete them permanently... they\\'ll even BLEED and COMPLAIN if assaulted\r\n- Mannequins function as PRACTICE DUMMIES... boost your stats by doing whatever to them\r\n- Toggle the ESSENTIAL setting... so they won\\'t die \\'accidentally\\'\r\n- Tweak Menu allows certain facial expressions, invisible pedestals, and even \\'ghostly\\' Mannequins\r\n- Automatically works after installing... instant and without effort, drama, or extensive instructions\r\n- Works automatically with any \\\"Body Replacers\\\" you have installed... all races and creatures (eg- nude mods)\r\n- Fixes the Vanilla \\\"Wandering Mannequin\\\" Bug\r\n- Fixes the Vanilla \\\"Item Duplication\\\" Bug\r\n\t>>These two \\'Fixes\\' are only applied to the Mannequins in this mod.  Vanilla Mannequins remain UNCHANGED... I made a PLAIN mod-fix for nilla-quins:\r\nhttp://skyrim.nexusmods.com/mods/10652\r\n\r\n\r\n[WHERE TO FIND]\r\n- There is a strong-box just outside the MAIN GATE OF WHITERUN, to the right of the stairs (in the bushes).\r\n- This box contains 100 free Mannequins, which will eventually respawn if Player does not enter that specific area for the prescribed time (which resets the respawn clock).\r\n\t\r\n\t\r\n[HOW TO USE YOUR MANNEQUINS]\r\n= DROP a Mannequin Dummy from Player\\'s Inventory (doesn\\'t matter where), then ATTACK IT\r\n- Move Player around so that the Dummy that appears is in the exact position/rotation you want it to be in\r\n- Attack it and choose your race-type\r\n\r\n= ACTIVATE/TALK: enters the Inventory\r\n= ACTIVATE WHILE SNEAKING: enters the Customization Menu\r\n*** NOTE: Non-Humanoid Mannequins will NOT show you the \\'talk/activate\\' message in your crosshairs.  You may STILL activate them normally though... if you are close enough.\r\n*** NOTE: While in Statue Mode, sometimes Player will be able to walk completely through a mannequin (therefore unable to activate it).  See \\\"Important Notes\\\" below for details on this bug/glitch introduced by the Skyrim v1.6 Update.\r\n\r\nMOVEMENT and REPOSITIONING:\r\n= Select Race-Reposition in the Customization Menu\r\n- A dummy will appear in front of Player; move Player around until the dummy is in the exact spot and rotation you want your mannequin.  Attack it.\r\n- Mannequins may be moved vertically (higher or lower) in the Customization Menu.\r\n\r\nESSENTIAL: in the Customization Menu, will toggle that entire Mannequin-Race to unkillable or not\r\n\r\nSCALING:\r\n= Between 0.1x and 5x the original size with several increments between\r\n- If scaling up or down, you must exit the Menu then restart it in order to scale in the opposite direction (eg- scaling up, exit, restart, scale back down)\r\n- ORIG automatically sets it back to normal (without having to exit/reenter the menu)\r\n* Collision does NOT scale up with the mannequin.  This seems to be a bug/glitch in the game-engine which cannot be circumvented.\r\n\r\nRACE-TYPE CHANGE:\r\n= Select Race-Reposition in the Customization Menu\r\n- Reposition the dummy to the exact position/rotation you want, then attack it\r\n- Then choose your desired type; listing is in the other readMe file included in the download package.\r\n- Items will automatically be transferred to the new mannequin.\r\n- Choosing Dremora will give all items to Player.\r\n\r\nPOSES:\r\n= Select Poses in the Customization Menu\r\n- Poses may not be properly advanced when first set; leaving the area then returning corrects it\r\n- Poses are available in both Living and Statue behavior modes\r\n\r\nTWEAKING:\r\n- Facial expressions will always be displayed.\r\n- Ghostly means the mannequins have a degree of transparency, cycling between 50%, 25%, and Opaque/Normal.\r\n- Pedestal may be set to invisible (eg- if it is unsightly, or mannequin doesn\\'t fit on it)\r\n\r\nPACK UP:\r\n- Automatically removes all the objects from this Mannequin (placing it all in Player\\'s Inventory), deletes it and its pedestal, then adds a Dummy to your Inventory\r\n\r\nCHANGING BEHAVIOR MODES:\r\n= click one of the following..\r\n> STATUE Mode: Mannequins are frozen in the same pose all the time.\r\n> LIVING Mode: Mannequins always stand in one spot, but perform idle animations, head tracking, and occasionally speak.  \r\n\r\n*** NOTE: Using a certain \\\"Behavior-Mode Version\\\" of this mod (NOT the numeric version; but Living or Statue) sets all your Mannequins\\' DEFAULT behavior.  In-game, you may change EACH individual Mannequin\\'s behavior \\\"Mode\\\" to either, even while using ANY \\\"Version\\\" of the mod. ***\r\n\r\n\r\n[IMPORTANT NOTES]\r\n*** While in Statue Mode, sometimes you won\\'t be able to Activate the mannequin (it won\\'t have any collision at all).  Leave the area then return (eg- go outdoors then return indoors).  This is a bug/glitch introduced with the v1.6 Skyrim Update affecting actors with disabled AI.  If the bug is triggered, you only have a few seconds after first entering the area to Activate the mannequin before it turns into a \\'walk-through ghost\\' (after which time you\\'d have to leave-return again).  It does NOT happen all the time, but I have been unable to pinpoint a pattern or find a workaround. If the problem persists; open the console, select the mannequin, type \\\"activate player\\\" (while sneaking to open the Customization Menu). ***\r\n\r\n= ONLY humanoid races DISPLAY equipment, the only exceptions to these are:\r\n- Dremora may only store items.\r\n- Draugrs ONLY wear weapons/bows/quivers, shields, and diadems.\r\n- Skeletons ONLY wear weapons/bows/quivers, shields, and diadems.\r\n= Creatures, animals, machinery, and other \\'mannequins\\' may be used as permanent STORAGE but will NOT display any items.\r\n- Poses may only be used with the humanoid races.\r\n- Drawn weapons only seem to work in Living Mode.\r\n- Equipped weapons may sometimes disappear in Statue Mode.. they still exist, but you cannot see them.\r\n- A Mannequin can only store up to TEN ITEMS at a time... they\\'ll automatically give back any items past that\r\n- Scaling up a mannequin too large may cause it to fall off its pedestal.\r\n\r\n\r\n[UPGRADING FROM A PREVIOUS VERSION OF SPODUM]\r\n* BEFORE installing this mod, load the game with the old version still installed.\r\n- REMOVE ALL ITEMS from any SPODUM mannequins, save the game in a place away from any of them and away from the inside of Whiterun (or outside the main gate)\r\n- EXIT the game, uninstall the old version of the mod\r\n* OPTION 1: start Skyrim without ANY version of SPODUM running or installed, save a new game, exit then install\r\n* OPTION 2: install new version, then use the console to manually delete any pedestals or mannequins leftover from the previous versions (open console, select object, type \\\"delete\\\", hit enter)\r\n\r\n[INSTALLATION]\r\n- save a new saveGame AWAY from any Mannequins and away from the main gate of Whiterun\r\n- Copy over the contents of this mod\\'s DATA folder to your game install\\'s DATA folder\r\n- When asked, answer \\\"Yes\\\" to overwriting files\r\n- Start Skyrim, load that new saveGame and play\r\n\r\n*\r\n[SWITCHING DEFAULT BEHAVIOR VERSIONS]\r\n- You may switch between versions (Living or Statue) at ANY time, and without doing anything special.  This will NOT affect your game\\'s data or break any questlines.\r\n- To change to a different version, simply copy over the contents of the desired DATA folder to your game install\\'s DATA folder (overwrite when asked).  The as-installed default is Statue Mode, Living Mode is included in the folder \\\" Alternative Default - Living\\\".\r\n- Behavior of Mannequins placed BEFORE changing versions may not reflect the change until manually set in its Customization Menu.\r\n*\r\n\r\n\r\n[KNOWN PROBLEMS and POTENTIAL CONFLICTS]\r\nTRY THIS FIRST:\r\n- If you have any kind of problem or strange behavior from Mannequins, LEAVE THE AREA containing Mannequins (fast-travel or go into/exit a building), THEN RETURN.  This resets the area (cell) ensuring any new changes take effect, and positioning is corrected.\r\n***\r\n\r\nIT MOVES AWAY FROM PEDESTAL:\r\n(or is knocked/bumped off or falls)\r\n= Mannequins will automatically return to their proper positions; you may have to leave the area and return (to refresh the cell)\r\n- If a larger Mannequin-type is chosen, it may not fit on or fall off the pedestal without provocation.  Using the Customization Menu, I suggest moving the Mannequin \\'down\\' enough so that the pedestal is closer to the floor/land (so the Mannequin stands on land, thereby preserving it\\'s position better).  A possible alternative is to set the pedestal to Invisible in the Tweak Menu (but it may cause the Mannequin to shift position or look like it\\'s climbing something that isn\\'t there).\r\n\r\nWEAPON OR OTHER ITEM DOESN\\'T DISPLAY WHILE IN STATUE MODE:\r\n- For some reason, disabling AI sometimes causes weapons to disappear - this seems to be a bug in the game-engine (introduced with the v1.6 Skyrim Update?).  Your items will never be lost, they just may not appear when they should.\r\n\r\nSOMETIMES IT FLOATS IN MIDAIR:\r\n- I\\'m not sure what causes this yet, but I haven\\'t looked into it.  When you leave the area then return, it fixes itself automatically.  (I fairly certain I eliminated this, but left this notice just in case it arises)\r\n\r\nMANNEQUIN FLICKERS AFTER INTERACTION:\r\n- Presently, this is unavoidable as actors always flicker when equipping each new piece of equipment.  There is also a glimpse of a mannequin dummy during race/repositioning.. this prevents a glitch which causes a newly placed mannequin to not be in the correct spot. \r\n\r\n- When you shoot Mannequins with arrows, the ones that would be \\'retrievable\\' automatically become quivers worn by the Mannequin\r\n\r\n\r\n\r\n[UNINSTALL]\r\n- remove any ITEMS you may have placed on SPODUM mannequins\r\n- navigate Player to an area which doesn\\'t have mannequins\r\n- save a NEW saveGame, exit Skyrim\r\n- delete the following EIGHT (8) files:\r\nDATA/SPODUM.esm\r\nDATA/SPODUM v1.5.esp\r\nDATA/Scripts/aaSLuckMannHuman.pex\r\nDATA/Scripts/aaSLuckMannAnimal.pex\r\nDATA/Scripts/aaSLuckMannDremora.pex\r\nDATA/Scripts/aaSLuckMannDummyScript.pex\r\nDATA/Scripts/aaSLuckMannPlace.pex\r\nDATA/Meshes/SLuckyD/Misc/aaSLuckMannequinInvisiPed.nif\r\n- delete the following TWO (2) folders (and their entire contents):\r\nDATA\\\\Textures\\\\Actors\\\\Character\\\\FacegenData\\\\FaceTint\\\\SPODUM.esm\\\\\r\nDATA\\\\Meshes\\\\Actors\\\\Character\\\\FaceGenData\\\\FaceGeom\\\\SPODUM.esm\\\\\r\n- load that new saveGame and resume play...\r\n\r\n\r\n[VERSION HISTORY]\r\nv1.5 - Changes the Movement Options to real-time, Player-oriented repositioning\r\n\t- removes a lot of unnecessary objects by combining all the dummy-types into one\r\n\t- lowers the weight of dummies from 15 to 1, and the price down to 1\r\n\t- combines all the dummy-chests into one\r\n\t- moves the chest to outside Whiterun\\'s main gate (to better allow respawning)\r\n\t- shrinks the menus that get cut off by certain screen resolutions\r\n\t- the need for excessive leave-return seems not to be necessary anymore\r\n\t- moves the Race Menu to a single temp-mannequin, reducing the amount of BS stored in saveGames and memory\r\n\t- remove extra coding and properties from most mannequins by splitting up the script\r\n\t- fixed bug where Dremora would become naked with or without equipment added\r\n\t- adds a Tweak Menu which allows transparency, facial expressions, and invisi-pedestal\r\n\t- removed Freeze mode as it essentially is the same as Statue, and didn\\'t work as intended\r\n\t- added back Wooden mannequins (which has NO effect on the Vanilla mannequins, it\\'s custom)\r\nv1.4 - FIXED THE GREY HEADS, and gave em all purdy moufs\r\n\t- tweaked the race change system to exactly place the new NPC\r\n\t- tweaked the movement system so it is near-flawless (rotating in Living Mode does NOT work)\r\n\t- ADDED DRAWN WEAPONS\r\n\t- removed EVERYTHING which altered ANYTHING VANILLA (to be released as a separate addon)\r\n\t- tweaked most of the menus to operate without exit/return drama\r\nv1.3 - Adds FULL mannequin mobility with the MOVEMENT MENU\r\n\t- Adds ability to CHANGE POSES\r\n\t- Adds ability to CHANGE RACE/type\r\n\t- Adds ability to set the mannequin\\'s race to ESSENTIAL (so it doesn\\'t die)\r\n\t- Modifies the Vanilla mannequins, and the Vanilla script (to include the Customize Menu)\r\nv1.1 - Small change to FormIDs of the chests which hold \\\"Dummy\\\" items in-game\r\n\t- Customize Menu has been tweaked a little\r\n\t- FULLY portable\r\n\t- WEAPONS, BOWS, and QUIVERS may now be displayed; but only in a \\'stored\\' position\r\n\t- Mannequins now act as Player-Owned STORAGE, add ANYTHING from your inventory\r\n\t- Retrieve your target-practice arrows\r\n\t- FIXES the Vanilla \\\"armor duplication bug\\\" (when giving armor then taking it back before closing the mannequin\\'s Inventory screen, then leaving the cell and returning)\r\nv1.0 - Original Release\r\n\t- FIXES the Vanilla \\\"wandering mannequin syndrome\\\" (not walking across the room, but appearing in the wrong spot and/or floating when Player returns from other areas)\r\n\t- Early stage development of the Customize Menu\r\n\t- Semi-portability (couldn\\'t pick up the mannequin completely)\r\n\t\r\n\r\n[LEGAL]\r\nBethesda (or \\\"Licensor\\\" as defined in the Skyrim EULA) is not the author of the \\\"Customized Game Materials\\\" included in this package.\r\n“THIS MATERIAL IS NOT MADE, GUARANTEED OR SUPPORTED BY THE PUBLISHER OF THE SOFTWARE OR ITS AFFILIATES.”\r\n\r\nSLuckyD is not responsible for any damage these materials may cause, any misrepresentations or alterations to the original, and/or failure to successfully deliver any stated products or services.\r\n\r\n\r\n\r\n[OTHER SLuckyD RELEASES]\r\n(availability may be limited until I can update them to 100% compatible Skyrim Creation Kit versions, as some of these mods were made before its release)\r\n\r\n- Overlook Tower Player Home (1st non-Nilla Player Home for Skyrim EVER)\r\nhttp://skyrim.nexusmods.com/mods/4514\r\n\r\n- SPODUM: SLuckyD\\'s Portable On-Demand Disposable Unlimited Mannequins\r\nhttp://skyrim.nexusmods.com/mods/10578\r\n\r\n- Moving Target Practice\r\nhttp://skyrim.nexusmods.com/mods/28336\r\n\r\n- Vanilla Mannequin Script Fix (for anything that uses Vanilla mannequins)\r\nhttp://skyrim.nexusmods.com/mods/10652\r\n\r\n- Gokstad Sailable Viking Ship & Portable Player Home\r\nhttp://skyrim.nexusmods.com/mods/5432\r\n\r\n- Faster Woodland Creatures\r\nhttp://skyrim.nexusmods.com/mods/4799\r\n\r\n- Wounded Knee Gulch (1st non-Nilla Dungeon for Skyrim EVER)\r\nhttp://skyrim.nexusmods.com/mods/3787\r\n\r\n- Ring of Fortify Carry Weight plus 10000\r\nhttp://skyrim.nexusmods.com/mods/8520\r\n\r\n- Bullseye (1st New/Custom WorldSpace for Skyrim EVER)\r\nhttp://skyrim.nexusmods.com/mods/2945",
  "categoryId": "92",
  "version": "1.5",
  "author": "SLuckyD",
  "createdUnix": "1329767063",
  "updatedUnix": "1342455711",
  "containsAdultContent": false,
  "uploadedBy": "SLuckyD",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34344",
      "name": "SPODUM v1_0 Original Release",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "69",
      "fileName": "SPODUM v1_0 Original Release-10578.rar",
      "uploadedUnix": "1329767204",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5c8552a45fedfd1a70d9971d12d3a0e2aa939c636e470140d89bb7a3a147ef38/analysis/1406698870/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPODUM%20v1_0%20Original%20Release-10578.rar?fid=34344&ttl=1535771072&ri=8192&rs=8192&setec=e268c6a6e774554eff6faa9324d5a875"
    },
    {
      "fileId": "35043",
      "name": "SPODUM v1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "66",
      "fileName": "SPODUM v1_1-10578.rar",
      "uploadedUnix": "1329875010",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9cabb21fd82f6c5d0d4c7948bddae719da29242c39cd79f708550ab08c82b0bd/analysis/1406703544/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPODUM%20v1_1-10578.rar?fid=35043&ttl=1535771073&ri=8192&rs=8192&setec=c0fa9d04abd5d537a8601ff20c706bbf"
    },
    {
      "fileId": "38595",
      "name": "SPODUM v1_3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "31",
      "fileName": "SPODUM v1_3-10578.rar",
      "uploadedUnix": "1330552995",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/045b16544aac9b20787f1c87dfe034a73ac0f0534e8a069c4269d33667b1f8e0/analysis/1406721985/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPODUM%20v1_3-10578.rar?fid=38595&ttl=1535771074&ri=8192&rs=8192&setec=9c4ecb2931568dcfeb2114f04ea5e207"
    },
    {
      "fileId": "39480",
      "name": "SPODUM v1_4   All Behavior Modes Included",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2492",
      "fileName": "SPODUM v1_4   All Behavior Modes Included-10578-1-4.rar",
      "uploadedUnix": "1330757219",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/00fe62016946cf9c883110d7c11d88c4a4cc601c4bf80b6dac8cdababd919e5c/analysis/1406726776/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPODUM%20v1_4%20%20%20All%20Behavior%20Modes%20Included-10578-1-4.rar?fid=39480&ttl=1535771074&ri=8192&rs=8192&setec=9b0b609b88bd851ac5fd4147b9f33331"
    },
    {
      "fileId": "74720",
      "name": "SPODUM v1_5   Statue Mode Default",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2593",
      "fileName": "SPODUM v1_5   Statue Mode Default-10578-1-5.rar",
      "uploadedUnix": "1342455711",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/1a4f9ada68493a4e396c9d305d2663e3e3fb10acaf59498b3871d53e265750aa/analysis/1407026545/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPODUM%20v1_5%20%20%20Statue%20Mode%20Default-10578-1-5.rar?fid=74720&ttl=1535771075&ri=8192&rs=8192&setec=7f597f10db8e5788c82c0fcdd54668ca"
    }
  ]
}