{
  "modId": 10573.0,
  "modName": "Camping Kit of the Northern Ranger",
  "summary": "At last, a portable campsite that you can construct yourself&#33; Position each item exactly where you want, and dig in for the night.",
  "descriptionHtml": "[center]\r<br />[img]http://www.clan-tkcfiles.com/images/ckmod.png[/img]\r<br />[img]http://www.clan-tkcfiles.com/images/quote.png[/img]\r<br />[youtube]2ZsgvINFPmk[/youtube][youtube]kO6VrlWM5A0[/youtube]\r<br />[img]http://www.clan-tkcfiles.com/images/header000.png[/img]\r<br />[/center]\r<br />\r<br />Are you looking for camping gear that isn&#39;t overpowered and stays true to Tamriel lore? Do you want to be able to setup your camp the way YOU want? How about sleeping under the stars or in a tent? If you answered &#34;yes&#34; to any of those questions, then look no further&#33;\r<br />\r<br />This is a set of camping gear packaged together nicely into two types of portable kits and is designed for those who are traveling Skyrim and want to sleep out in the wild. You can place each piece of your camp (the tent, the bedroll, the fire, etc) exactly where you want it, and then &#34;activate&#34; each marker to turn them into the real thing. Selecting &#34;pack up camp&#34; will instantly put everything back into your kit. No messy cleanup required&#33;\r<br />\r<br />The mod also boasts a slew of other features such as establishing barricades, cooking, and much more&#33;\r<br />\r<br />[center]\r<br />[img]http://www.clan-tkcfiles.com/images/header005.png[/img]\r<br />[/center]\r<br />\r<br />[center]\r<br />[color=#7b8e54]Version 2.2[/color]\r<br />-Cleaned the mod even further, removing all economy references and shop-related stuff. It is now compatible with all shop mods since you craft the kit instead of purchase it.\r<br />\r<br />-The kit is now craftable at any tanning rack for a few pieces of leather, strips, and iron.\r<br />[/center]\r<br />\r<br />[center]\r<br />[color=#7b8e54]Version 2.0[/color]\r<br />1. The trapping system has been removed. While it was a good idea in theory, there were too many unknowns and issues with some of the scripting related to other mods. In actuality hunting on your own is pretty easy and seems more realistic&#33;\r<br />\r<br />2. Darkfire - A magical &#34;light&#34; source that emits heat but no fire. Compatible with hypothermia mods, frostfall, etc. Perfect for scouts deep in enemy territory or those who wish to remain unseen..\r<br />\r<br />3. Camping Table - You can now setup a table in your campsite. You can decorate it after it is deployed with a map, lantern, etc.\r<br />\r<br />4. Barricades - Fortify your position&#33; Setup barricades around your camp perimeter and dig in for the night. Now that both camping kits have their own markers, you could setup a more permanent camp while using your other for travel.\r<br />\r<br />5. Fish rack, tanning rack, alchemy stand - Added by popular request.\r<br />\r<br />6. Stabilized more within the scripting, removed unneeded models, etc. Everything should run faster and better. \r<br />\r<br />[img]http://www.clan-tkcfiles.com/images/header003.png[/img]\r<br />[/center]\r<br /> \r<br />[color=#7b8e54]The standard camping kit contains:[/color]\r<br /> 1) Two Bedrolls (One for you, one Extra)\r<br /> 2) A Tent (you can even enter this tent by activating it to be indoors)\r<br />    a) A barrel inside the tent where you can configure your tent (click barrel to see the menu). This is YOUR barrel items will not disappear.\r<br />       The barrel contains some books to read and also Weaponblack, an inky black substance you smear on your weapons to improve your chances of hiding.\r<br /> 3) Campfire (can be ignired and doused for some Roleplaying fun)\r<br /> 4) Darkfire - Darkfire is a magical fire that emits heat but no light. Useful for scouts deep in enemy territory, or those who want to avoid\r<br />    being seen. You can convert your regular campfire into darkfire by activating the campfire.\r<br /> 4) Cooking pot\r<br /> 5) 3 Compact Camping Chairs\r<br /> 6) 7 Leather Screens or Partitions \r<br /> 7) An Animal Pelt (makes the ground more comfortable)\r<br /> 8) 2 Horse Tethering Posts (they don&#39;t actually tether horses through scripts, but you can place one on each side of your horse).\r<br /> 9) A fishing rack\r<br /> 10) An alchemy stand\r<br /> 11) A tanning rack\r<br /> 12) Barricades - useful if you want to fortify your position.\r<br /> 13) The ability to create flat terrain around your campsite.\r<br />\r<br />[color=#7b8e54]The Imperial camping kit contains:[/color]\r<br />The Imperial camping kit contains:\r<br />1) Two Bedrolls\r<br />2) A smaller tent\r<br />3) A campfire (and darkfire)\r<br />4) Cooking Pot (Smaller)\r<br />5) TWo compact camping chairs\r<br />6) 3 Leather Screens\r<br />7) The ability to create flat terrain around your campsite.\r<br />\r<br />\r<br />To get this kit, craft it at a tanning rack for some leather, strips, and iron. Use both\r<br />to make an even bigger camp, or setup both of them in different parts of Skyrim.\r<br />\r<br />\r<br />[center]\r<br />[img]http://www.clan-tkcfiles.com/images/header001.png[/img]\r<br />[/center]\r<br />Craft the kit at any tanning rack. There are two versions available (you should craft both so you can mix and match your camp or if you&#39;d like to setup two camps in different areas).\r<br />\r<br />[color=#7b8e54]Method #1 NMM)[/color]\r<br />Download using Nexus Mod Manager, then simply double click the mod to install.\r<br />\r<br />[color=#7b8e54]Method #2 Manual)[/color]\r<br />It&#39;s pretty easy, download, unzip then just drag and drop the contents of my data folder into your skyrim data folder. It will add the scripts into the scripts folder, and the esm into the data folder.\r<br />[center]\r<br />[img]http://www.clan-tkcfiles.com/images/header002.png[/img]\r<br />[/center]\r<br />\r<br />Activate by clicking the camping kit in your inventory list, and it will automatically be removed from your inventory and placed in the general area in front of your character. Use the camping kit and follow the menu to build your very own camp exactly how you want it by dragging each marker (using the &#39;E&#39; key). You&#39;ll notice many of the items can be further customized, such as setting the height (moving them up or down for best positioning) or even changing the angle.\r<br />\r<br />[center]\r<br />[img]http://www.clan-tkcfiles.com/images/header006.png[/img]\r<br />[/center]\r<br />[color=#531C39]Issue:[/color] The Riverwood Trader does not have the kit\r<br />[color=#7b8e54]Solution:[/color] First be sure that you enabled the ESM file. You wouldn&#39;t believe how many times I&#39;ve got a new mod and for one reason or another forgot to enable it&#33;\r<br />\r<br />[color=#531C39]Issue:[/color] When you left click the camping marker in your inventory, the item does not deploy.\r<br />[color=#7b8e54]Solution:[/color] Did you copy the scripts folder correctly? Remember my scripts need to be in your data/scripts folder.\r<br />\r<br />[color=#531C39]Issue:[/color] The camping kit isn&#39;t working when I left click it in my inventory.\r<br />[color=#7b8e54]Solution:[/color] That probably means you didn&#39;t copy the scripts folder correctly for some reason. Just go back and verify your scripts folder contains the ckcamping scripts.\r<br />\r<br />[color=#531C39]Issue:[/color] Help&#33; I upgraded and now things seem weird or off or broken.\r<br />[color=#7b8e54]Solution:[/color] Remember the saying &#34;Rebooting solves 99% of the problems?&#34;. I&#39;ve solved so many of my own personal modding problems (even using other mods) by doing the following (this is really good to try)\r<br />a) Uncheck the mod\r<br />b) Load your game. Bypass the nag message telling you that this save uses content which is no longer available.\r<br />c) You&#39;ll now notice you do not have the camping kits. Save your game, and exit.\r<br />d) Check the mod back, optionally you can reinstall the mod.\r<br />e) Load the game again, and buy the camping kit. It should &#34;reboot&#34;\r<br />f) If no luck, send me an e-mail or post on here. I&#39;ll look at it right away.\r<br />[center]\r<br />[img]http://www.clan-tkcfiles.com/images/ckhrbar.png[/img]\r<br />[/center]",
  "categoryId": "78",
  "version": "2.2",
  "author": "The Northern Ranger",
  "createdUnix": "1329765588",
  "updatedUnix": "1405797598",
  "containsAdultContent": false,
  "uploadedBy": "tek_7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000118294",
      "name": "Camping Kit of the Northern Ranger",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1300",
      "fileName": "Camping Kit of the Northern Ranger-10573-2-2.zip",
      "uploadedUnix": "1405797598",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/1cae32bacb8838563c37697f9848d4a75d15d0a918c7da0c53cc842ee98b964b/analysis/1405797641/",
      "changelogHtml": " Included 2.1&#39;s changes&#33; <br/> \n Cleaned major references and removed all camping kit references from Riverwood Trader. Safe for all merchant/economy mods&#33; <br/> \n Camping kits are now crafted at any tanning rack. <br/> \n More support to include followers and bring them into your tent. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Camping%20Kit%20of%20the%20Northern%20Ranger-10573-2-2.zip?fid=1000118294&ttl=1535771067&ri=8192&rs=8192&setec=e5459c6fe93e861d3e9d504526d0afb0"
    }
  ]
}