{
  "modId": 10594.0,
  "modName": "Dynamic TimeScale now with AutoSave",
  "summary": "Changes your game\\'s timescale based on whether you outdoors, indoors or in combat. Can perform periodic AutoSaves.",
  "descriptionHtml": "[center][heading]Dynamic TimeScale V4![/heading][/center]\r\n[b]Public Domain[/b]\r\nWhile I placed this mod in the public domain when I created it, I am now officially saying Dynamic TimeScale is public domain. I have taken this mod about as far as I can go with it. If you want to take this mod and change it, translate it, rip it off, or lay it on a railroad track and flatten it like a penny, be my guest. Don\\'t even ask, just take and do. While recognition of my work would be aprreciated, it is not necessary.\r\n[line] \r\n[b]WTF does this thing do?[/b]\r\nThis mod does two jobs. First, it changes the TimeScale based on whether your character is indoors, outdoors, running around in Skyrim\\'s wilderness and whether you are fighting. Second, it can perform an AutoSave at regular intervals or after certain events (specfically after combat or after picking a lock.)\r\n[line]\r\n[b]Requirements[/b]\r\nSkyrim\r\nSKSE 1.6.9 or later (found at [url=\\\"http://skse.silverlock.org/\\\"]skse.silverlock.org[/url])\r\nSkyUI 3.1 or later (found at [url=\\\"http://skyrim.nexusmods.com/mods/3863\\\"]Skyrim Nexus[/url])\r\nIf using the Dawnguard or Dragonborn version, their respective expansions.\r\n[line]\r\n[b]Upgrading[/b]\r\nIf you\\'re upgrading from an older version of Dynamic TimeScale, before uninstalling the old mod, go into the configuration book and under Advanced Options, select uninstall. Save your game and then upgrade to the new version.\r\n[line]\r\n[b]Dynamically adjusting TimeScales[/b]\r\nThere are up to six different TimeScales to will be switched to when...\r\n\r\nThe Wilderness TimeScale is used when your character is roaming around in the general wilderness of Skyrim (you\\'re not inside a building/dungeon or in one of the major cities.)\r\n\r\nThe Indoors TimeScale is used when your character is inside a building or in a dungeon.\r\n\r\nThe Outdoors TimeScale  is used when your character is either in one of the major cities or you\\'re in one of the \\\"outdoor\\\" dungeons (i.e. Blackreach.)\r\n\r\nEach of these settings has a partner setting that is used when your character is in combat (which can mean either you have your weapon drawn, an agressive NPC is fighting or actively looking for you or a combination of both.)\r\n[line]\r\n[b]Fast Travel, Sleeping & Waiting[/b]\r\nThanks to some new features in SKSE, Dynamic TimeScale will now switch the TimeScale to the default 20 whenever you open up the map, sleep or wait menus and will immedeatly switch back to your desired TimeScale when you leave those menus.\r\n[line]\r\n[b]Periodic AutoSaves[/b]\r\nA new feature to DynamicTimeScale. This will perform an AutoSave at regular intervals and can, optionally, perform an AutoSave at the end of a combat session or after picking a lock.\r\n\r\nThe AutoSaves come with a warning message, in the top left of the screen, and a slight delay to give you time to \\\"get your poop in a group\\\" before for the AutoSave takes place. \r\n\r\nThese AutoSaves are put on hold when your character is in any menu, but specifically in a dialog or crafting menu, and will resume when you leave the menu. (See the configuration description for details.)\r\n[line]\r\n[b]Fully Configurable[/b]\r\nFirst off, this version of Dynamic TimeScale uses MCM for its configuration menu. The configuration book of olde is gone.\r\n\r\nAll features can be configured to your taste or disabled, if you so choose.\r\n\r\nAll options come with helpfull tips, explaining what the setting does and what its default value is.\r\n[line]\r\n[b]Dynamic TimeScale Configuration[/b]\r\n[i]Standard TimeScales[/i]\r\nThe left side of the configuration menu are all seven settings for adjusting the TimeScales\r\n\r\nWilderness:  This is the TimeScale used when your character is in Skryim\\'s wilderness, Dayspring Canyon (Dawnguard version) or Solstheim (Drgaonborn version). The range is from 0-60. Setting this to 0 completely disables dynamically adjusted TimeScales. (Default 24 : 1 hour in real time = 24 hours game time)\r\n\r\nOutdoors: This is the TimeScale used when your character is in a major city or certain \\\"outdoor\\\" dungeons. The range is from 0-60. Setting this to 0 disables the Outdoors  and In Combat Outdoors TimeScales. (Default 12 : 1 hour in real time = 12 hours game time) \r\n\r\nIndoors: This is the TimeScale used when your character is inside a building or in a dungeon. The range is 0-60. Setting this to 0 disables both the Indoors and In Combat Indoors TimeScales.  (Default 6 : 1 hour in real time = 6 hours game time)\r\n[line]\r\n[i]Combat TimeScales[/i]\r\nWilderness: This is used when your character is in combat in in the wilderness (see above.) The range is 0-60. Setting this to 0 disables all Combat TimeScales. (Default 12)\r\n\r\nOutdoors: This is used when your character is in combat in a city or outdoor dungeon. The Range is 0-60. Setting this to 0 disables uses the Standard Outdoors TimeScale instead. (Default 6)\r\n\r\nIndoors: This is used when your character is in a building or dungeon. The Range is 0-60. Setting this to 0 uses the Standard Indoors TimeScale instead. (Default 3)\r\n[line]\r\n[i]\\'In Combat\\' Means...[/i]\r\nYou have two options here and you must choose at least one of them. (Default \\\"A NPC is fighting you\\\")\r\n\r\nThe first option, a NPC is fighting you, is when a hostile NPC is either fighting you or actively looking for you (in MUD/MMORPG terms you have Agro.) Essentially, the combat TimeScales will be used any time you have a red dot on your compass.\r\n\r\nThe second option, you have your weapon drawn, switches between standard and combat TimeScales whenever you sheath/draw your weapon, respectively.\r\n\r\nIf you enable both options then the combat TimeScales are used only when you have \\\"agro\\\" and have your weapon drawn. If you sheath your weapon or no longer have any NPC fighting you (either you killed them all or they gave up) will use the standard TimeScales.\r\n[line]\r\n[b]AutoSave Configuration[/b]\r\nIf you\\'re going to use the AutoSave feature, the first thing that I recomend is that you open up your Skyrim.ini file and change iAutoSaveCount value to something larger than the default 3. I\\'m using 25, but 10 or any other large number should sufice. It all depends on how many saves you want to keep. \r\nYou can find Skyrim.ini in \\\"My Documents\\\\My Games\\\\Skyrim\\\\\\\"\r\n\r\n[SaveGame]\r\niAutoSaveCount=25\r\n[line] \r\n[i]Reoccurring Time[/i]\r\nThis perofrms an AutoSave ever few (specified) minutes of play time. The range is 0-60. Setting this to 0 disables reooccuring AutoSaves. (Default 5 minutes)\r\n\r\n[i]After Picking a lock Time[/i]\r\nThis performs an AutoSave after you finish picking a lock. The setting determines the minimum time (in seconds) that you must spend picking a lock (the lock pick screen is open) before it qualifies for an AutoSave. The range is 0-60. Setting this to 0 disables lock picking AutoSaves. (Default 10 seconds)\r\n\r\n[i]After combat time[/i]\r\nThis performs an AutoSave after you finish combat. The setting determines the minimum length of time (in seconds) that combat must last before it qualifies for an AutoSave. The Range is 0-60. Setting this to 0 disables combat AutoSaves. (Defulat 10 seconds)\r\n\r\n[i]\\'In Combat\\' means...[/i]\r\nThis setting is similar to the setting in combat TimeScales of the same name, but is used exclusively for combat AutoSaves. Again you must choose at least one of the options. (Default \\\"A NPC is fighting you\\\")\r\n\r\n[i]Delay before AutoSave[/i]\r\nSince AutoSaves freeze the game for a brief moment, this setting gives you a little time to get ready for it. The setting is the delay, in seconds, before the AutoSave is actually performed. The Range is 0-60. Setting this to 0 will perform an AutoSave immedeatly when it\\'s able.\r\n\r\n[i]Show warning before AutoSave[/i]\r\nThis shows a warning message, in the top left corner of the screen, that an AutoSave is about to be performed. This option is disabled if the \\\"Delay before AutoSave\\\" is set to anything less than five seconds. (Default enabled)\r\n[line]\r\n[b]Uninstall Dynamic TimeScale[/b]\r\nWhen you close the menu screen and return to the game, this shuts the script down, set TimeScale to its default 20, gets everything ready to uninstall the mod and performs and AutoSave.\r\n[line]\r\n[b]Technical Details[/b]\r\nFor Dynamic TimeScales:\r\nTimeScales are only changed when your character changes \\\"states\\\" (enter or leave combat, go from outdoors to indoors, etc.) This means that, if you wish, you can open up the console and change the TimeScale by hand and it will not change again until your character changes his/her state as previously mentioned.\r\n\r\nIf you disable Dynamic TimeScales, by setting the Standard Wilderness TimeScale to 0, TimeScale will be set back to the default 20 when you close the menu and the TimeScale global variable will never be touched again (unless, of course, you change the wilderness setting again) completely disabling the Dynamic TimeScales feature.[line]\r\n\r\nFor AutoSave:\r\nThis mod attempts to trap circumstances when an AutoSave would be inappropriate, such as when your character dies or enters a new region (any time you see a loading screen). This isn\\'t 100% effective, especially since the mod cannot detect when you\\'ve peformed a full or quick save, but stops most instances of possible AutoSave spam.\r\n\r\nThe reoccurring AutoSave timer is reset any time an AutoSave is performed. Example: Reoccurring AutoSave is set for five minutes. Three minutes after your last AutoSave you get in a fight and and end of combat AutoSave is performed. Your next reoccurring AutoSave will be in five minutes, not the remaining two.\r\n\r\nIn Combat times are cumulative, if the fights are spaced apart less than the AutoSave delay. This way, multiple short fights count as one long battle. As an example: Your settings are for a ten second minimum fight length and a ten second delay before AutoSave. You have two fights, the first last six seconds and the second lasts five. If the second fight starts within ten seconds after the first fight finishes, the two fights are considered as one fight lasting eleven seconds and qualifies for an AutoSave. If the second fight doesn\\'t start before that ten seconds, they are counted as two separate fights, neither qualifying for an AutoSave.\r\n\r\nLock pick times are not cumulative. I thought about making them cumulative, like combat, but if you can pick a half dozen lock taking less than ten seconds each, you don\\'t need an AutoSave.\r\n\r\nNo AutoSaves are performed when the player is in combat (according to your settings), the dialog or the crafting menus are opened. Any AutoSaves will be put on hold until combat finishes or you leave those menus and the delay time will be reset and restarted.\r\n\r\nAll timers, including the AutoSave delay timer, are paused when you are in any of the menu screens, with the exceptions of dialog and crafting menus, and resume when you return to game mode.\r\n\r\nThere is one situation that I have not found a way to trap, when the character is harvesting (chopping wood, mining, etc.) If an AutoSave is scheduled to occur when the player is in the harvesting animation, the AutoSave won\\'t take place.\r\n[line]\r\n[b]Closing[/b]\r\nI want to thank all of you, for giving my mod a try, for the comments and suggestions and even for recommending it to friends.\r\n \r\nI\\'d also like to thank Ka3mon for listing my mod in [url=http://skyrim.nexusmods.com/mods/23826]G.E.M.S.[/url]\r\n \r\nFor the people who made [url=\\\"http://skyrim.nexusmods.com/mods/3863\\\"]SkyUI[/url]. As a user you might think MCM is as great as sliced bread, but for me, as a modder, it\\'s a godsend.\r\n \r\nAnd, of course for the Silverlock crew for making [url=\\\"http://skse.silverlock.org/\\\"]SKSE[/url]\r\n \r\nThis was a mod that I originally was going to make, put up on Nexus and, for the most part, forget. Because of your encouragement, and the people who made tools to make this job easier, I\\'m still updating this mod a year later.\r\n \r\nThank you all\r\nKeith\r\n",
  "categoryId": "78",
  "version": "4.2",
  "author": "Kae Arby",
  "createdUnix": "1329772254",
  "updatedUnix": "1362831662",
  "containsAdultContent": false,
  "uploadedBy": "Kae Arby",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34800",
      "name": "DynamicTimeScale-BSAEdition",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "DynamicTimeScale-BSAEdition-10594.7z",
      "uploadedUnix": "1329835668",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5e9f5efca1af7427dcb87dd83261672d3deaeaff38e237764a4e93681fccf900/analysis/1406701642/",
      "changelogHtml": " Finally got the BSA edition to work properly <br/> \n Cleaned up the scripts a bit. Nothing major <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DynamicTimeScale-BSAEdition-10594.7z?fid=34800&ttl=1535771107&ri=8192&rs=8192&setec=7d77e2763dd6267f2a7a0fce33672ccc"
    },
    {
      "fileId": "34801",
      "name": "DynamicTimeScale-LooseFileEdition",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "DynamicTimeScale-LooseFileEdition-10594.7z",
      "uploadedUnix": "1329835706",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/418a03e54b07047adb28ad15a6a96d2f845777ce0fd3808255b4099d287d168a/analysis/1406701643/",
      "changelogHtml": " Finally got the BSA edition to work properly <br/> \n Cleaned up the scripts a bit. Nothing major <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DynamicTimeScale-LooseFileEdition-10594.7z?fid=34801&ttl=1535771107&ri=8192&rs=8192&setec=1401c1f2c69eb26dbdbc75caf9b8420b"
    },
    {
      "fileId": "36506",
      "name": "DynamicTimeScale - BSA Edition",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "DynamicTimeScale - BSA Edition-10594-2-0.7z",
      "uploadedUnix": "1330143756",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/4d940362bd1cddfaf25b49e0413953e66a59ffab6a238c461506b94c0013bcaf/analysis/1406711547/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DynamicTimeScale%20-%20BSA%20Edition-10594-2-0.7z?fid=36506&ttl=1535771108&ri=8192&rs=8192&setec=89b5e4ea329ea04cb789429386bda21d"
    },
    {
      "fileId": "36507",
      "name": "DynamicTimeScale - Loose File Edition",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "DynamicTimeScale - Loose File Edition-10594-2-0.7z",
      "uploadedUnix": "1330143826",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/418a03e54b07047adb28ad15a6a96d2f845777ce0fd3808255b4099d287d168a/analysis/1406711548/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DynamicTimeScale%20-%20Loose%20File%20Edition-10594-2-0.7z?fid=36507&ttl=1535771109&ri=8192&rs=8192&setec=225ef6dd2a90841e0420fce9ff15e093"
    },
    {
      "fileId": "84937",
      "name": "DynamicTimeScaleLFE",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "DynamicTimeScaleLFE-10594-2-1.7z",
      "uploadedUnix": "1346197573",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/4f4858a33cc906c4e90618a43a99ed68243c8d73042d369eab6d79ccf4333ef3/analysis/1407129063/",
      "changelogHtml": " Recombiled the scripts with creation kit v1.6.89 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DynamicTimeScaleLFE-10594-2-1.7z?fid=84937&ttl=1535771109&ri=8192&rs=8192&setec=41cd0db49c69f92e1ae98b3169334d8b"
    },
    {
      "fileId": "84938",
      "name": "DynamicTimeScaleBSA",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "DynamicTimeScaleBSA-10594-2-1.7z",
      "uploadedUnix": "1346197680",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/968ddcf63da032d5fcd9e053450bd85e94dfdc7a2a9cf9e2a997e8f4149e5b56/analysis/1407129064/",
      "changelogHtml": " Recombiled the scripts with creation kit v1.6.89 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DynamicTimeScaleBSA-10594-2-1.7z?fid=84938&ttl=1535771110&ri=8192&rs=8192&setec=9399ad300c2261b4d10507df9ac0d5d9"
    },
    {
      "fileId": "88672",
      "name": "DynamicTimeScale-BSA",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "DynamicTimeScale-BSA-10594-3-0.7z",
      "uploadedUnix": "1347740495",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/5c3dbc8603ae1dae6f26ca6796dc8ed5a48f31228efbd996b1d0ffcc3c4399b7/analysis/1407168003/",
      "changelogHtml": " Script now recognizes when you\\'re in menu mode (game is paused) and sets the timescale to 20. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DynamicTimeScale-BSA-10594-3-0.7z?fid=88672&ttl=1535771110&ri=8192&rs=8192&setec=17caf4eb4c31a465dac056db9d4b087b"
    },
    {
      "fileId": "88673",
      "name": "DynamicTimeScale-LFE",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "DynamicTimeScale-LFE-10594-3-0.7z",
      "uploadedUnix": "1347740545",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/a6cda00b3a034f36c72027e0d6ca373f1ffd3119758987cb3414c76f6469362f/analysis/1407168004/",
      "changelogHtml": " Script now recognizes when you\\'re in menu mode (game is paused) and sets the timescale to 20. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DynamicTimeScale-LFE-10594-3-0.7z?fid=88673&ttl=1535771111&ri=8192&rs=8192&setec=e002cfcc610da525a2f6b02486a68f49"
    },
    {
      "fileId": "1000016166",
      "name": "Dynamic TimeScale Vanilla",
      "version": "4.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Dynamic TimeScale Vanilla-10594-4-2.zip",
      "uploadedUnix": "1362831529",
      "modVersion": "4.2",
      "virusScanUrl": "https://www.virustotal.com/file/d6a531d129e147771965db4f2e4566545fdf5c9b405ff01dc411327b566adbe0/analysis/1407460540/",
      "changelogHtml": " Fixed the configuartion menu so it properly dispalys the initial values of the TimeScales <br/> \n Copied the updated script/BSA into the archives <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20TimeScale%20Vanilla-10594-4-2.zip?fid=1000016166&ttl=1535771111&ri=8192&rs=8192&setec=2740759c84b39412ec1c0cd5a21cac6d"
    },
    {
      "fileId": "1000016167",
      "name": "Dynamic TimeScale Dawnguard",
      "version": "4.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Dynamic TimeScale Dawnguard-10594-4-2.zip",
      "uploadedUnix": "1362831578",
      "modVersion": "4.2",
      "virusScanUrl": "https://www.virustotal.com/file/f19d55244a81dc404af5492a99460f2e04b2e25916ce33b30a9703cbbfd3167c/analysis/1407460562/",
      "changelogHtml": " Fixed the configuartion menu so it properly dispalys the initial values of the TimeScales <br/> \n Copied the updated script/BSA into the archives <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20TimeScale%20Dawnguard-10594-4-2.zip?fid=1000016167&ttl=1535771112&ri=8192&rs=8192&setec=7da72d938a3c44990e36805fac5f45a9"
    },
    {
      "fileId": "1000016168",
      "name": "Dynamic TimeScale Dragonborn",
      "version": "4.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Dynamic TimeScale Dragonborn-10594-4-2.zip",
      "uploadedUnix": "1362831621",
      "modVersion": "4.2",
      "virusScanUrl": "https://www.virustotal.com/file/cedc849b63cc347d37d4ac1636f37cc1dc4caa8152dad9b8e48aef3ca9c2759e/analysis/1407460563/",
      "changelogHtml": " Fixed the configuartion menu so it properly dispalys the initial values of the TimeScales <br/> \n Copied the updated script/BSA into the archives <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20TimeScale%20Dragonborn-10594-4-2.zip?fid=1000016168&ttl=1535771113&ri=8192&rs=8192&setec=ecf1947c62ba2e35fce40483f38354d6"
    },
    {
      "fileId": "1000016169",
      "name": "Dynamic TimeScale Dawnguard Dragonborn",
      "version": "4.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Dynamic TimeScale Dawnguard Dragonborn-10594-4-2.zip",
      "uploadedUnix": "1362831662",
      "modVersion": "4.2",
      "virusScanUrl": "https://www.virustotal.com/file/70a9e4ebbf3ba8cc8af6b29ce2ee9e7c8f5d2c4ea49d405e1a14d5e9c13de5f9/analysis/1407460563/",
      "changelogHtml": " Fixed the configuartion menu so it properly dispalys the initial values of the TimeScales <br/> \n Copied the updated script/BSA into the archives <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20TimeScale%20Dawnguard%20Dragonborn-10594-4-2.zip?fid=1000016169&ttl=1535771113&ri=8192&rs=8192&setec=50aec22b0683c12213cdfe661445738c"
    }
  ]
}