{
  "modId": 10613.0,
  "modName": "Zelda Character Game Save",
  "summary": "A simple Zelda character.",
  "descriptionHtml": "I noticed while looking at different Saved Games, that there was not a single Zelda saved game! They were all Link! So, this is my attempt at a Zelda character. This is my first upload to Skyrim Nexus, and I don\\'t know a whole lot about NMM, but I\\'m pretty sure all you need to do is download the file, and place it in your C:\\\\Users\\\\UserName\\\\Documents\\\\My Games\\\\Skyrim\\\\Saves. Correct me if that\\'s wrong.\r\n\r\nIntroduction:\r\nThis is a simple character save I made the other day as an attempt to look like Zelda. If you feel like her hair isn\\'t blonde enough, or brown enough, feel free to change it to your liking. I had a really hard time finding hair that looked somewhat close to Zelda\\'s hair, but I thought this one did nicely. \r\n\r\nDescription:\r\nIn this save game, Zelda is a Nord. I couldn\\'t make Zelda an elf because of a few reasons. First reason being, their eyes are too slanted. Second reason being, their ears don\\'t go well with the Airy ears mod. I may take a stab at a wood elf/high elf Zelda later, but again, I couldn\\'t get the look I wanted with the default elf. I know the nose looks a little weird in the pictures, but she looks better in game.\r\n\r\n\r\nLocation, Level, and Abilities:\r\nShe\\'s level 3, and she just finished talking to the Jarl about the dragon attack at the western tower. All you need to do now is go slay the dragon to continue the main quest line. I left her stats untouched for the most part so you can decide for yourself what you want her to be like. \r\n\r\nPlease note: This save game will not look correct unless you download the mods I used to get this look. List of mods used to create this look:\r\n\r\nXenius Character Enhancement by Xenius - used as a base (download this one first)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2356 \r\n\r\nCover Eyes by Mr. Lenski - Let this overwrite Xenius\\' eye textures (download this one second)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4869\r\n\r\nEnvision Face by dd2501 - (download this one third)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=7897\r\n\r\nApachii Sky Hair by Apachii - Used to get the hair (download this fourth)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10168\r\n\r\nAiry Ears and Armor by \\\"unknown\\\" - This is for the ears, open console in-game and type \\\"help airy\\\". Once you get the code for Airy ears, type in \\\"player.additem (code)\\\".\r\nhttp://www.mediafire.com/?641j7a0b8cvxa29",
  "categoryId": "43",
  "version": "Original",
  "author": "WatchTheShow",
  "createdUnix": "1329777546",
  "updatedUnix": "1329777880",
  "containsAdultContent": false,
  "uploadedBy": "WatchTheShow",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34449",
      "name": "Zelda Save",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1681",
      "fileName": "Zelda Save-10613.zip",
      "uploadedUnix": "1329777880",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/eb7dfae8ebc694f4fc0869ed10bb5919e3ebded2e9583f4c5782587a7aa795b4/analysis/1406699411/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Zelda%20Save-10613.zip?fid=34449&ttl=1535771149&ri=8192&rs=8192&setec=9c17d5a82187cb6ea65a47002c4efc0c"
    }
  ]
}