{
  "modId": 10610.0,
  "modName": "Cinder The Flame Dancer CHAPTER ONE",
  "summary": "Cinder the flame Dancer Performs at the Bannered Mare in Whiterun and has developed a curious urge to see the world.",
  "descriptionHtml": "[center][IMG]http://fc01.deviantart.net/fs71/f/2013/035/9/a/cinder_poster_2_transparent_by_burnedraven_d5tt4ol_by_burnedraven-d5tus6s.png[/IMG][/center]\r\nINTRODUCTION\r\n=Require subtitles to be enabled to see quest dialogue=\r\n-----------------------\r\nI made this mod because I have always enjoyed creating and telling story\\'s through my artwork. I thought about creating a story driven mod like this for a long time but was intimidated by all the technical side to it with scripting and such, I dont come from an IT background but thanks to all the encouragement from you guys I finally attempted it and now have a small part of the story up and working to share with you. Thank you so much for the support or I would not have made this.\r\nTHANK YOU!\r\n[center][img]http://fc07.deviantart.net/fs70/f/2013/035/1/f/ctfd_poster_by_burnedraven-d5tt5pg.png[/img][/center]\r\n\r\nDescription\r\n--------------------\r\nKeep in mind this will be a very story driven mod.\r\nThis mod will tell the story Cinder the flame dancer, a curious flame atronach that has developed an urge to see the world. After meeting with the Dragon born there adventures together begin to unfold leading them to every part of skyrim. After completing the quest you can take her with you as a follower \\\"or perhaps as something more?\\\" and show her the world outside the Bannered Mare. I am hoping that you build a very close relationship with Cinder as a character as the story goes on.\r\n\r\nThe story will be broken up into chapters, each chapter being released after the other. Each chapter will have an introduction story leading up to the mod fleshing out the events leading up to the mod itself. There will also be another story after you have finished each chapter which will then lead to the next chapter.\r\nDuring playing the mod there will be journals and diary\\'s scattered about dungeons and on enemy\\'s which will give you further insights into the story and the characters. I will mark them on a picture of the map for those that don\\'t want to miss them.\r\n\r\nYou will also notice that there are no quest markers telling yo were to go only description pointing you in the direction. I found that the markers made you explore less when going through dungeons so I decided to leave them out. Again all post pictures of maps to help you navigate if you get lost.\\\"I will start hiding things in dungeons later on\\\"\r\n\r\nTo start the quest Talk to Cinder in the Bannered Mare\r\n\r\nalso \\\"PLEASE SEND LOTS OF IMAGES OF YOU ADVENTURING WITH CINDER\\\" I would love to see were you have been taking her :)\r\n\r\nIMPORTANT BUGS TO TAKE NOT OF           [PLEASE READ]\r\n=============================\r\nLike I said I have never attempted anything like this before so there are things I didn\\'t know how to do or fix.\r\n\r\n-There is a slight delay on the quest update when completing them, just wait a few seconds and it will pop up.\r\n-I have not found out how to make Cinder a follower at the end of the quest so at the moment she can join you strait away but for story consistency please dont take her with you until you have done the quest.\r\n-I have noticed that during the quest conversations they sometimes skip a sentence, I find the best way to avoid this is to not skip forward after reading the dialogue and let it move on to the next sentence by itself though if it does skip cancel the conversation and skip back to the part you was at.\r\n-Another problem which sometimes occurs, after you leave the dungeon that\\'s apart of the quest you may be under the steps that are outside the door, if this happens just jump back up towards the door.\r\n-The poster I created advertising Cinders performance at the Bannered Mare may fall down \\\"shouldn\\'t\\\" but it might.\r\n\r\nIf you could help me fix any of these problems please let me know.\r\n---------------------\r\nAbout Cinder\r\n---------------------\r\nHer ability\\'s are your basic flame atronach abilitys. more will be added as the story progresses\r\nShe starts at lvl 15 and will always be double the players lvl after that.\r\nShe has the added ability to duplicate herself in a fight \\\"something she original used as part of her performance\\\"\r\n\r\nlet me know if you think she is to powerful or to weak.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n===============\r\nCHAPTER ONE - Cinder The Flame Dancer\r\n===============\r\nRead before starting Chapter One quest\r\n-----------------------------------------\r\nHe was a poor man with little to his name “at least so it seemed” he had spent the past few days in the Bannered Mare keeping very much to himself. When it came to him paying for the bed he had slept in and the food he had eaten he had no money to offer. Hulda the owner was furious that he was unable to pay but the man stopped her and offered her something which was of greater worth than the money that he owed her. Hulda realising she wasn’t going to get any real payment from him hesitantly agreed. The mage stepped towards the fire in the centre of the room and pulled one of the still glowing pieces of lumbar from the fire place. Astonished, Hulda as well as the rest of the patrons in the room stared in bewilderment at the on-going event that was taking place. The mage pulled something from his pouch and placed it in a small recess of the lumbar, he lifted it up to his lips as he whispered an incantation which made patrons lean in towards him straining to try and hear what was being said.\r\nHe then placed the lumbar back into the fire place and stepped back.\r\n“You may want to shield your eyes” he said while smirking at Hulda. \r\nIn that instance a large explosion erupted from the fire place spewing fire of purples and reds. From the ashes of the fire place emerged a creature which inspired awe in the room. The mercenary Sinmir that was sat closest to the explosion was picking himself up and was about to charge at the mage but was stopped in his tracks by the image of the creature which had formed were the fireplace once stood.\r\n“Her name is Cinder” the mage said while grinning at Hulda.\r\n“She will entertain your guests for as long as you see fit, how you want to profit from this I’ll leave up to you, I’ve never really been very good with money”\r\nThe mage walked out of the bannered mare leaving his creation with Hulda, no one pursued him.\r\n\r\nThere was a silence at first, no one really knowing what to do. Eventually Hulda moved towards Cinder and asked.\r\n“so ….. what do you do?”\r\nCinder looked up at her and replied hesitantly.\r\n“I….I like to dance”\r\n\r\nFor months Cinder danced for the patrons of the Bannered Mare bringing in large crowds and even larger coin. Unfortunately for Hulda Cinder was a very curious being and as she listened in on the tails of adventures that people were telling night after night she began to develop an urge to see what was outside the walls of the Bannered Mare.\r\nAt that moment a newcomer entered the Bannered Mare, she had not seen them before which she thought was odd as she tended to know everyone that came to her shows.\r\nPeople began to mutter the word “Dragon Born”\r\nShe didn\\'t know what this meant but she felt a strange presence around this stranger, perhaps this person could show her the outside.\r\n\r\n---------------------------\r\nContinue reading after finishing Chapter One quest\r\n---------------------------\r\n\r\nCinder\\'s excitement to leave quickly dissipated as she turned to see all of her friends had gathered to say good bye. All this time she had wanted to to see the outside, to travel the world but she had never thought of the people she would be leaving behind.\r\nMikael was the first to approach her, he was also one of the first people that befriended Cinder when she first arrived.\r\nWith his lute in hand he strummed a few cords and looked at Cinder.\r\n\\\"Looks like you finally get to live that dream of your Cinder, I guess you wont get to hear that song I have been working on tonight after all\\\" He smiled at her with that cheery expression he always had.\r\nCinders emotions began to get the better of her, her flames became more subtle and less vibrant as she listened.\r\n\\\"I guess so...\\\"\r\n\\\"I promise I will come back to visit, then we can perform together like we used to\\\"\r\nMikael plucked at a few more strings of his lute, It was a slow and stirring rythem. His cheerful expression had gone, replaced by sadness.\r\n\\\"Ill miss you Cinder\\\"\r\nThey put there arms around each other, Cinders flames subtly flickering around him.\r\nNo sooner had they release each other, a big burly arm was put around her shoulder, This caught Cinder of guard and her flames sprung back to life.\r\n\\\"I cant believe my little Cinder is actually leaving, Im sure all those monsters out there are allready shaking in there boots\\\"\r\nSinmar bellowed while pulling Cinder under his arm.\r\n\\\"Ill never forget the day you first arrived, That bruise you gave me after knocking me of my chair when you appeared was in quite the tender area\\\"\r\nSinmar was all most like a father figure to Cinder, he was actually one of the main sources of story\\'s Cinder would listen to. She remebered when she used to get Sinmar to tell her story\\'s late at night About his adventures when he used to travel, she was quite fond of the story he would tell about how he beat a troll in an arm wresting contest and then beat the troll almost to death with its own arm.\r\nCinder squirmed to give herself a bit of room as she tried to pry herself from his grip.\r\n\\\"I will miss you to Sinmar\\\"\r\n\\\"I will miss your storys aswell\\\"\r\nSinmar released her from his grip.\r\n\\\"Those are not just story\\'s...they are lessons on how to live! Remember that and you can take on all that life throws at you\\\"\r\n\\\"Who knows maybe next time you will be the one telling me story\\'s\\\"\r\n\\\"Also keep an eye out for that one armed troll I told you about\\\"\r\nAs soon as Sinmar finished his sentence Cinder threw her arms around him, Sinmar returned the gesture and gently put his arm around her.\r\nAs Cinder released Sinamr from her hold she turned to Saadia.\r\nSaadia smirked at her.\r\n\\\"Well look whos going out on adventure, I didn\\'t know you had it in you\\\"\r\nSaadia always used to taunt Cinder, never to to be hurtful but they enjoyed poking fun at each other.\r\n\\\"Ill admit its going to be awfully boring around here with out some one to tease\\\" \r\nShe turned her gaze to Mikael\r\n\\\"im sure ill find someone though\\\"\r\nMikaels face suddenly looked quite concerned.\r\n\\\"Just be careful out there okay, and watch out for any of them men trying to get there hand on you, remember to hit them were I told you\\\"\r\nCinder laughed at the thought. She remembered what happened to the last person that tried to get to friendly with Saadia and for some reason when ever she brought it up all the men in the room would cringe.\r\nCinder nodded in acknowledgment to her comment.\r\n\\\"Dont worry Ill remember\\\"\r\nSuddenly all the men in the room cringed slightly, even sinmar.\r\nCinder looked towards Hulda. They didn\\'t talk much, she was Cinders boss but also something more than that. She always got the impression that Hulda was protecting her from something but she could never quite put her finger on it. When ever she tried to bring up the topic she would change the subject to something else, and now she actually suggested that I leave with this stranger.\r\nCinder moved over towards her and nervously began make out the words she wanted to say.\r\n\\\"...I know we don\\'t...talk too much but..I just wanted to say thank you, you looked after me and gave me a home. You didn\\'t have to but you did anyway \\\"\r\n\\\"I just wanted to say...Thank you\\\"\r\nCinder smiled at her and slowly moved away and headed towards were the Dragonborn was standing near the door. She turned around one last time to glimpse tears falling down Huldas cheeks.\r\n\r\nThe Dragonborn pushed the doors of the Bannered Mare open. The cold winds quickly engulfed Cinder, the moisture in the air dimming her flames slightly. This quickly lost her attention though as she looked around her new surroundings.\r\nPeering over at the market stall, She recognized Carlotta, seems she was shewing away another man trying to propose. Her attention was then drawn to the children running through the streets, one of them sccindently bumping into the Dragonborn.\r\nShe then Looked towards the mountains and the sky. Had all this really been outside the walls of the Bannered mare this whole time? \r\nThe Dragonborn regained there balance after being run into by one of the children and turned to Cinder.\r\n\\\"You coming?\\\"\r\nCinder quickly came back to her senses as she heard their voice.\r\n\\\"Uh yes be right there\\\"\r\nShe took a step away from the Bannered mare and suddenly felt cold hands grasp her body, her strength seemed to fade. As she got further away from the Bannered Mare she began to get vision of being pulled into the void. The word \\\"Oblivion\\\" repeating over and over in her head. She looked around only to realize there was no longer a market place just blackness, visions of an old man in a robe began to flash in her mind. Suddenly out of the darkness she heared her name.\r\n\\\"Cinder\\\"\r\n\\\"Cinder!\\\"\r\nA hand grabbed her by the shoulder and lifted her up.\r\nIn shock she again looked around in a panic, she was back in the market place the Dragonborn was holding her by the shoulders.\r\n\\\"Are you alright\\\"?\r\nCinder didn\\'t know what to say, she still felt really weak but she didn\\'t want say, they might not take her if she said anything.\r\n\\\"Im fine its just a bit... overwhelming seeing the sky\\\"\r\nThe Dragonborn looked at her with understanding.\r\nI forget you haven\\'t been outside before.\r\nCinder looked around one last time and then began to follow the Dragonborn, The cold hands slowly beginning to grasp at her body again.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n======================\r\nChapter Two - A Dying Flame\r\n======================\r\nRead before starting Chapter Two quest\r\n---------------------------------------------------------\r\nINTRO STORY TO CHAPTER TWO COMING SOON\r\n\r\nThings that will be added with chapter two.\r\n\r\n-Multiple choice conversations which lead to different dialogue and perhaps even more. Like mass effect\r\n-In game Bookshelf containing all the chapters of the story so far and will be updated with every Chapter.\r\n-I will hopefully be working on illustrating some of the in game books myself with my own art work. A book you will acquire containing details on flame atronachs illustrated by myself.\r\n\r\nThere will be other things as well but I have not yet begun planning out all of chapter two yet so I have ideas on bit of paper all over the place at the moment.\r\n\r\n===============================================\r\n\r\nTHINGS I WOULD LIKE TO DO BUT DONT KNOW HOW TO :/\r\n===============================================\r\n-Give Cinder her own voice and have all quest dialogue voiced.\r\n-Give Cinder a unique appearance, will probably start looking up some meshing and texturing tutorials .\r\n-Actually give Cinder the ability to dance on command - way out of my ability but one can hope.\r\n\r\nKeep in mind this mod Is only the beginning of the story and a test to see of I could make a working quest so this first chapter is not very long but as the chapters go on they will get longer and more in depth.\r\n\r\nThank you again everyone for your support, I\\'m now just hoping i put all the right file together so you can actually play it :)\r\nAs allways please leave any suggestions you have for the story or for things you want to see, always glad to hear them\r\n\r\nIt may be some time before chapter two is released as I need to catch up on other things.\r\nalso ill be spell checking this all again later :D",
  "categoryId": "65",
  "version": "2.0",
  "author": "BurnedRaven",
  "createdUnix": "1329776526",
  "updatedUnix": "1360010197",
  "containsAdultContent": false,
  "uploadedBy": "BurnedRaven",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34442",
      "name": "Cinder the flame dancer-follwer only- no quests",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "Cinder the flame dancer-10610-1.zip",
      "uploadedUnix": "1329776856",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3d462d383dd89444621fa67210a7fe76af3b2994db96d2a9fe2a29710e3b484a/analysis/1406699406/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cinder%20the%20flame%20dancer-10610-1.zip?fid=34442&ttl=1535771142&ri=8192&rs=8192&setec=189e32c9f1346803dffd72ed114995dc"
    },
    {
      "fileId": "36740",
      "name": "Cinder the flame dancer V1_02 Marriage",
      "version": "1.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Cinder the flame dancer V1_02 Marriage-10610-1-02.zip",
      "uploadedUnix": "1330200185",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/93b986d4e686c8ff2c09433644826be23c9d7d90367d981679b283f47035838b/analysis/1406712726/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cinder%20the%20flame%20dancer%20V1_02%20Marriage-10610-1-02.zip?fid=36740&ttl=1535771143&ri=8192&rs=8192&setec=4a235ce16c2d6f0ed268d48250ea0a1e"
    },
    {
      "fileId": "1000007090",
      "name": "Cinder The Flame Dancer-Chapter One",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5391",
      "fileName": "Cinder The Flame Dancer-Chapter One-10610-2-0.7z",
      "uploadedUnix": "1360010197",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/fbf80a522840dac719945988e60bc199c20f5b549753cad399007b8f4c644a62/analysis/1407397441/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cinder%20The%20Flame%20Dancer-Chapter%20One-10610-2-0.7z?fid=1000007090&ttl=1535771143&ri=8192&rs=8192&setec=8c158b761b116b3ab1ca0921c3c4c74c"
    }
  ]
}