{
  "modId": 10612.0,
  "modName": "Followers Unlimited",
  "summary": "This mod lets you have a whole bunch of followers all at once.",
  "descriptionHtml": "Mod:  Readme - Followers Unlimited 1_6\r\nGame:  TES V: Skyrim\r\nAuthor:  David Brasher                                          \r\nDate:  4/4/12\r\nDownload Point:  http://skyrim.nexusmods.com/downloads/file.php?id=10612                   \r\n************************************************************************\r\nCONTENTS                          \r\n************************************************************************\r\n1. Information on the Mod\r\n2. Installation\r\n3. Version History\r\n4. Conflicts, Known Issues, and Troubleshooting\r\n5. Copy Status and Credits\r\n************************************************************************\r\n1. INFORMATION ON THE MOD           \r\n************************************************************************\r\n\t   This mod lets you have a whole bunch of followers all at once.\r\n\r\n\t   The followers in this mod do not use the original follower system.  This mod does not edit\r\nor conflict with that system and with mods that edit it.  This mod makes a sort of a duplicate of the \r\nfollower system usable only by followers that come from this mod and from copies of it.  You can have \r\nfollowers from the original follower system along with followers from this mod.  One main difference \r\nis that under the original follower system, you can only have one NPC follower and one dog.  Using \r\nthis mod and additional copies of it at the same time, you can have as many followers as you want that \r\nare added by this mod.  You can have dozens of them if you want.  There is no limit to how many NPC or \r\nanimal companions you can have if they are added by this mod.  (You can still only have one original \r\nNPC follower and one dog using the original system.)  The instructions must be followed carefully to \r\ncreate multiple working copies of this mod to run all at once.\r\n  \r\n\t   If you use a mod to change the vanilla Skyrim system to allow you to have more than one \r\nNPC follower at a time, you can still have more than one vanilla Skyrim NPC follower at a time after \r\nyou install this mod, plus as many new followers as you want that Followers Unlimited adds.\r\n\r\n\t   To reiterate what has just been said, this mod does not edit how many vanilla Skyrim \r\nfollowers you can have.  There are other really complicated mods that do that.  Here are two examples: \r\nhttp://forums.bethsoft.com/topic/1345602-wiprel-multiple-followers/\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=12933\r\n\r\n\t   The follower system in Followers Unlimited is much like the one in the base game and uses \r\nvery similar commands.  It uses \\\"Join Me\\\", \\\"Wait\\\", \\\"Follow\\\", \\\"Share\\\" and \\\"Dismiss.\\\"\r\n\r\n\t   The followers use voiced dialog from the original game.\r\n\r\n\t   The followers sneak when you sneak and draw weapons when you draw weapons.\r\n\r\n\t   The followers in this mod are set so that they can be married.  They do not own homes, so if \r\nyou marry one, you will want your spouse to come live at a home that you own.\r\n\r\n\t   The followers are set to wear armor that you give them in-game.  They wear custom outfits made \r\nup of custom armor with the terrible armor rating of zero.  This will make them want to wear any armor you \r\ngive them, because it will be an improvement over what they have.\r\n\r\n\t   In this mod, there are 21 potential companions.  They are mostly found in the hold capitals.  \r\nSee the list below for details on who they are and where to find them.  In the town where they live, they \r\ncan usually be found wandering in the street, in front of a player home, tavern, or other location.  You \r\ncan consult the listing to see where a particular follower can be found.\r\n\r\n\r\n\t   Some information on the 21 followers:\r\n\r\nAAMyFemEvenToned01, Female Spellsword, Whiterun, player home, Verona Lightbringer\r\nAAMyFemEvenToned02, Female Mage, Whiterun, tavern, Gretel\r\nAAMyFemEvenToned03, Female Warrior, Falkreath, tavern , Hilda Hot Temper\r\nAAMyFemEvenToned04, Female Rogue, Riften, player home, Skitty\r\nAAMyFemEvenToned05, Female Legionnaire, Solitude, player home, Ingrid\r\nAAMyFemEvenToned06, Female Savage, Markarth, player home, Kashaw\r\nAAMyFemEvenToned07, Female Ranger, Dawnstar, tavern, Gertrude\r\nAAMyFemEvenToned08, Female Mage, Winterhold, tavern, Ingmar Piercing Gaze\r\nAAMyFemEvenToned09, Female Warrior, Morthal, tavern, Margved\r\nAAMyFemEvenToned10, Female Stormcloak, Windhelm, player home, Hildebrand \r\nAAMyMaleBrute11, Male Warrior, Solitude, tavern, Org Thick Pate \r\nAAMyMaleBrute12, Male Warrior, Falkreath, blacksmith shop, Throngar\r\nAAMyMaleOrc13, Male Warrior, Morthal, bridge, Bargul gro-Vergum\r\nAAMyFemOrc14, Female Warrior, Riften, tavern, Mazgar gra-Balzahk\r\nAAMyFemSultry15, Female Vampire Mage, inside Dustman\\'s Cairn, north-west of Whiterun, Bridget\r\nAAMyMaleSlyCynical16, Male Vampire, inside Dustman\\'s Cairn, north-west of Whiterun, Arelden\r\nAAMyDog17, Dog, Markarth, tavern, dog is named \\\"Scamp\\\"\r\nAAMyFemKhajiit18, Female Barbarian, Rorikstead, tavern, Kavharri      \r\nAAMyMaleKhajiit19, Male Rogue, Ivarstead, tavern, J\\'rahshka \r\nAAMyFemArgonian20, Female Cleric, Windhelm, Docks, Deet-Jaraw\r\nAAMyMaleArgonian21, Male Warrior, Windhelm, Docks, Zebekei\r\n\r\n\t   This mod is designed as a modders resource that you can use to make companions that are the way\r\nyou want them to be.  You can edit the existing companion .esp or create a new one following certain \r\nguidelines.  If you want more than 21 companions, you can run multiple copies of this mod at once if you \r\nrename the .esp files as described below.  \r\n\r\n\r\n\t\t\t\tGUIDELINES FOR EDITING OR CREATING COMPANIONS\r\n\r\n\t   There are two ways to customize companions using this mod:\r\n(1) Edit the companions in the .esp file to have the characteristics and gear you want.\r\n(2) Copy the .esp file and name it with a new number such as \\\"Followers Unlimited 12\\\" or \\\"Followers \r\nUnlimited 13.\\\"  Then edit the content within the new file.\r\n\r\n\t   To find the followers in the .esp file of this mod in the CK, so that you can edit them, find the \r\nactors named like\\\"AAMyFemEvenToned01\\\" or \\\"AAMyMaleBrute11\\\" in the actor list.  See the list above for the\r\nFormIDs of the actors.\r\n\r\n\t   You may delete or move a follower from the worldspace where he or she is at in the .esp and place\r\nhim or her somewhere else without breaking anything.  \r\n\r\n\t   If you edit the AI package list of a follower, the first two packages on the list must remain \r\nat the top of the list.  A wander-near-editor-location package must remain at the bottom of the list.\r\n\r\n\t   The follower should remain in both AAMyFollowerFaction and AAMyFollowerFaction2 which are added \r\nby this mod.  These factions are designed to prevent fights between your followers.  All the follower\\'s\r\nother factions may be changed or removed.  You might want to pay attention to the crime factions if you move\r\nthe actors to new towns.  \r\n\r\n\t   Your follower needs to have an outfit assigned, or he or she will be naked when you first meet\r\nhim or her and at other times.  If things are built wrong, followers will not equip the gear you give them \r\nor will take it off at any opportunity.  This seems to be caused by the default outfit being of greater \r\nvalue than the gear you give the followers.  For this reason, the followers included in this mod have been \r\ngiven custom outfits composed of armor pieces with armor ratings of zero.  So the followers should gladly \r\nwear anything you give them because it will likely be better than what they have.\r\n\r\n\t   If you don\\'t choose the proper race and sex for your companion, you can make the dialog sound bad.  \r\nLike you don\\'t want a follower who sometime speaks like a man and sometimes like a woman.  You don\\'t even \r\nwant a female follower to say some of her lines in a soft pleasant voice and others in a harsh scratchy voice. \r\nSo what you need to do is choose the proper slot and build a follower that fits the slot.  For example: Build \r\nfemales with the even-toned voice in a slot named like \\\"AAMyFemEvenToned08.\\\"  Build males with the male brute \r\nvoice in a slot named like \\\"AAMyMaleBrute12.\\\"  If you fail to do this, the vanilla Skyrim dialog associated \r\nwith this character type will not match the dialog used by this mod.  Your follower will than talk with two \r\nvoices at different times.\r\n\r\n\t   You cannot add any more than 21 followers to a single mod unless you are a goofball and don\\'t \r\nknow what you are doing, or unless you are a skilled modder with lots of time on your hands.  Just don\\'t \r\nbother with that approach.  Create a second renamed copy of this mod and edit the NPCs in it to get another \r\n17 followers.  And if you need even more than that, create a third mod.  Believe me, it is a lot easier than \r\ntrying to expand and rebuild a copy of this mod to hold more than 21 followers.   \r\n\r\n\t   To create a new .esp file, you will need to copy the existing one and rename it using the format \r\nlike \\\"Followers Unlimited 12\\\" or \\\"Followers Unlimited 13\\\" using whatever number you need to.  You will also \r\nneed to copy the Data\\\\Sound\\\\Voice folders corresponding to the .esp file and rename it like \\\"Followers \r\nUnlimited 12.esp.\\\"\r\n\r\n\t   If you don\\'t want your .esps to add so many NPCs to the game world, you can go in and initially\r\ndisable some of them or else go delete some of them from the game world.  (Delete the actor object from the\r\nstreet or place he or she is standing in.  Do not delete the actor from the object list.  That would mess up \r\nthe scripting and make it so you couldn\\'t ever put a companion into that slot in the .esp ever again.)\r\n\r\n\t   The way Skyrim scripting is, you should not edit the scripts in this mod because it will then edit\r\nthe scripts in all the copies of this mod that you are running at once.  What you should do instead is create\r\nnew scripts (which could require that you create new dialog infos for them to attach to.)\r\n\r\n\t   If you try to rename a copy of this mod to something other than a name like \\\"Followers Unlimited 14\\\" \r\n(where only the number changes) you will break the voiced dialog and have to laboriously rename each file to\r\nreconnect it.\r\n\r\n\t   If you create a new .esp, you should change the summary header attached to the file to describe \r\nits content and to give it new version and variant numbers.\r\n\r\n\t   To run multiple copies of this mod, rename them in a pattern like \\\"Followers Unlimited 12\\\" and \r\n\\\"Followers Unlimited 13.\\\"  To keep from losing the dialog, the number is the only part of the name you \r\nchange.  You would need to copy the existing sound folder and its contents and set it alongside the old one\r\nwith a new name that matches your mod.  For example, your new folder full of copied sounds might be:\r\n\r\nSkyrim\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\Sound\\\\Voice\\\\Followers Unlimited 13.esp\r\n\r\nYou just copy the entire folder and rename it and put it in the proper directory.  (Copying the entire \r\nfolder automatically copies all the folders and files inside it.)\r\n\r\n\t   In Skyrim, actors do not really like to wear clothing you give them in-game, only armor.  An actor \r\nwill wear the armor in their inventory that has the highest armor rating.  Clothing has an armor rating of \r\nzero, so followers are not very interested in wearing it instead of their default outfit, even if their default \r\noutfit is clothing.  There is a way to work out around this.  If for instance you wanted a companion to wear a \r\npretty dress from a mod you downloaded, you can edit that mod so that the dress is light armor with an armor \r\nrating of 1.  You have to be sure to edit two boxes in the clothing dialog: (1) \\\"Armor Rating\\\" (2) The box to \r\nthe right of \\\"Weight\\\" which has \\\"None\\\" for its value.  Make the first box say \\\"1\\\" and the second box say \r\n\\\"Light.\\\" Then you also need to be sure that your actor does not have corresponding items of clothing or armor \r\nin his or her default outfit with armor ratings higher than zero.  This is not a surefire approach, and \r\nsometimes there is a delay.  Like you might give the NPC clothing and be upset to see that he or she won\\'t wear\r\nit, but then the next time you load your game, he or she might suddenly be wearing it.  \t        \r\n************************************************************************\r\n2. Installation                           \r\n************************************************************************\r\n           Extract (decompress) the .esp, Scripts, Sounds, meshes, and textures folders to your Skyrim \r\ndirectory.  (It will be something like *Installation directory*\\\\Skyrim\\\\SteamApps\\\\common\\\\Skyrim\\\\Data)\r\nMark the box next to the Followers Unlimited .esp you wish to activate in your mod manager.\r\n \r\n           Alternately, extract files someplace else.  Then move the .esp files, scripts, sounds, meshes,\r\nand textures to Skyrim\\\\Data.  Mark the box next to the plugin in your mod manager.\r\n************************************************************************\r\n3. Version History    \r\n************************************************************************\r\nV 1_6    4/4/12    Made it so Deet-Jaraw can heal you on request.\r\nV 1_5    3/15/12   Attempted fix to the issue of fights between followers erupting because of friendly fire.\r\n\t\t   Twenty-one followers including male and female Argonians and Khajiit.\r\nV 1_4    3/10/12   Seventeen followers.  Added a female Breton vampire, a male High Elf vampire, and a dog. \r\nV 1_3    3/2/12    Better audio files.  Added Facegen data.  Added a male Orc and a female Orc.\r\nV 1_2    2/29/12   Twelve followers in one .esp including two male humans. \r\nV 1_1    2/25/12   All ten followers in one mod.  Added low-value default outfits so followers will be more \r\n\t\t   likely to use gear they are given.  Made it so followers sneak or set alert when you do. \r\nV 1_0_5  2/21/12   Fixed error in file description of .esp # 10 which said follower was in wrong town.\r\n\t           Fixed corrupted .esp # 1 which made the follower disappear.\r\nV 1.0    2/19/12   Initial release.   \r\n************************************************************************\r\n4. Conflicts, Known Issues, and Troubleshooting\r\n************************************************************************\r\n\t   This mod will conflict with Open Cities-type mods or other mods which edit the locations where the \r\nfollowers are so that they are heavily altered or unreachable.  You can fix this issue by editing your copy of \r\nthis mod to move the followers elsewhere.\r\n\r\n\t   This mod will not work right if you do not install the scripts, sounds, meshes, and textures in\r\nthe proper locations.\r\n\r\n\t   This mod may not work if you are not using the latest version of Skyrim.  Log on to Steam and \r\nallow it to automatically update your game to the latest version.\r\n\r\n\t   Some mods just don\\'t work on some computers.  This mod has successfully worked on thousands of \r\ncomputers, but there are at least five computers that this mod does not work on for no reason that anyone can\r\nfigure out.  If this mod does not work on your computer and you think you have done everything right, read the \r\nmod thread which discusses a bunch of other things you can try.  Then if it still doesn\\'t work, just give up \r\nand don\\'t use this mod.  Computers are not always logical like you would think they should be.\r\n\r\n\t   If you get too many followers, you will get lag, and AI problems, such as followers standing \r\naround instead of helping fight. \r\n\r\n\t   If you have too many followers in narrow hallways, you will get stuck.\r\n\r\n\t   The game becomes too easy when you use too many followers.\r\n\r\n\t   The Skyrim design flaw which causes NPCs that you edit to have their head skin color not match their \r\nbody skin color can be worked around by using this approach:\r\n\r\n(1) You .esmify the .esp in Wrye Bash and then load it in the CK.\r\n(2) You select all the actors added by the mod.\r\n(3) You press CTRL + F4 to export facegen data.  (It takes awhile.)\r\n(4) You .espify the mod again using Wrye Bash.\r\n\r\n\t   The original unedited followers added by this mod will have the proper skin shades for their heads.\r\nIf you edit them in the original file, you may need to generate  new facegen data.  If you create multiple copies\r\nof the mod, you will need to generate facegen data for the additional copies. \r\n\r\n\t   I can not figure out how to get the \\\"I need you to do something for me.\\\" dialog to work right.\r\nThe followers enter this mode and will do anything you tell them to do.  But then they are stuck in this\r\nmode and won\\'t follow you ever again.  It sounds like other companion mod projects are having problems with\r\nthis too.  There may be a basic problem with Skyrim.  This portion of the dialog has been disabled and will not \r\nbe visible or accessible to players.\r\n\r\n\t   However, there is a shortcut that many people don\\'t know about to get your vanilla Skyrim followers\r\nto do miscellaneous tasks for you.  You can aim your crosshairs at your follower and press and hold down the key \r\nassigned to the \\\"activate\\\" function. (The \\\"E\\\" key by default.)  Do NOT use this shortcut with Followers Unlimited \r\nfollowers.  It will cause the problem described in the last paragraph.  You will break your game and need to load \r\nup an old savegame or else permanently stop using the follower you used the shortcut on.  I believe that much of \r\nthis part of the game is hardcoded, and I have not figured out if a solution is even possible.\r\n\r\n\t   This mod does not really work with marriage.  If you marry one of your followers, she or he will not\r\nbe able to go adventuring with you anymore and will just stay at whatever house she or he lives at.  (And your\r\nspouse will be awfully eager to leave the temple the instant the wedding ends.) \r\n\r\n\t   This mod is still under development and will likely be changed and expanded.\r\n\r\n\t   The amount of time spent play-testing so far has not been adequate.\r\n\t\r\n\t   If you locate a bug, contact David Brasher on TES Nexus so that the situation can be\r\nexamined and can hopefully be fixed. \r\n************************************************************************\r\n5. Copy Status and Credits           \r\n************************************************************************\r\nCredits:  Bethesda for making Skyrim in an open format anyone can mod.\r\n\t\t\r\nCopy Status:  Modders resource.  Public domain with proper attribution.  You should list the author in \r\n\t      your credits if you distribute mods with content from this mod.  You may use things from \r\n\t      this mod in your own mods and distribute them.  You are not required to ask permission to\r\n\t      use things from this mod and not required to notify the author that you have used things \r\n\t      from this mod.  The structure of this mod is such that you are encouraged to make your own \r\n\t      versions of the .esp file with the same name with different numbers and use them and \r\n\t      distribute them.           \r\n************************************************************************\r\n************************************************************************\r\n************************************************************************\r\n************************************************************************",
  "categoryId": "66",
  "version": "1.6",
  "author": "David Brasher",
  "createdUnix": "1329777115",
  "updatedUnix": "1342490696",
  "containsAdultContent": false,
  "uploadedBy": "David Brasher",
  "primaryFile": null,
  "files": [
    {
      "fileId": "35067",
      "name": "Followers Unlimited 1_0_5",
      "version": "1.0.5",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "606",
      "fileName": "Followers Unlimited 1_0_5-10612.7z",
      "uploadedUnix": "1329878777",
      "modVersion": "1.0.5",
      "virusScanUrl": "https://www.virustotal.com/file/36397ef98eef75b581205bbfe5eeba47b4eccc953182b336d3d8c7dc17cea184/analysis/1406703729/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Followers%20Unlimited%201_0_5-10612.7z?fid=35067&ttl=1535771147&ri=8192&rs=8192&setec=1d2fa34f0501193c8d3a22f9b7ba8823"
    },
    {
      "fileId": "50149",
      "name": "Followers Unlimited 1_6",
      "version": "1.6",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8896",
      "fileName": "Followers Unlimited 1_6-10612-1-6.7z",
      "uploadedUnix": "1333585264",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/a5344a3dc560454245be9e087a523b02080557465afaa286f4f340b8e2296921/analysis/1406797694/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Followers%20Unlimited%201_6-10612-1-6.7z?fid=50149&ttl=1535771147&ri=8192&rs=8192&setec=0f4263182cabf8260e4f6a64b8c8f93d"
    },
    {
      "fileId": "74808",
      "name": "Followers Unlimited 1_6_B ",
      "version": "1.6.B",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5259",
      "fileName": "Followers Unlimited 1_6_B -10612-1-6-B.7z",
      "uploadedUnix": "1342490696",
      "modVersion": "1.6.B",
      "virusScanUrl": "https://www.virustotal.com/file/abbbd35ab39d7938a3b67ec61f0713dcb29fbc7aea7976f88628246f03e8b163/analysis/1407027496/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Followers%20Unlimited%201_6_B%20-10612-1-6-B.7z?fid=74808&ttl=1535771148&ri=8192&rs=8192&setec=886c242eaed8484312c14d86ec43c3cb"
    }
  ]
}