{
  "modId": 10622.0,
  "modName": "Playable Skeleton Race Updated",
  "summary": "Playable Skeletons.  READ DESCRIPTION!!!!",
  "descriptionHtml": "I no longer have the files for this mod.  If anyone is wanting to fix the problems then go for it.  I do not want my mod posted anywhere else but nexus though.\n<br />\n<br />---COMING SOON---\n<br />since i am still tryin to figure out how to separate the body parts i will go ahead and release the selectable eyes sometime very soon.  i will also look into making all armor actually playable i will replace the skin on them with something else such as chainmail (something that was suggested  a while ago).  This will include the female skeleton race (as i said before u cant tell a diff between them.  I might make them a little smaller so u can tell.).  This will only effect the skeleton wearing them so they will still look normal for the regular races.  if anyone has ideas on what i should use for the skin then just comment and let me know.\n<br />\n<br />---V1.03---\n<br />FINALLY armor, clothes, helmets, circlet, rings, amulets, and shields are visible on the skeleton.\n<br />Only armor that is visible is the armor this didnt show human skin so i did not make all armors visible same for clothes but there is a lot that is visible.  nightingale is one armor that is working.  now for the nightingale hood i had to fix it temporarily.  until i can get the skeleton head separated from the body and make it an actualy head the face in the nightingale hood pokes through this is for all races.  the skeleton body and head are one right now.  once i can get a good idea how to work a mesh program i will hopefully fix this unless yet again someone is willing to help me with this.  and once i have the head separated from the body i will start adding diff eye choices.  so the sooner i can fix this or someone is willing to help me for once we will have working eye selections.\n<br />\n<br />for most armors to show up and not actually show skin play as a male skeleton.  most female armors show a lot of skin where the males dont.\n<br />\n<br />if anyone finds a helmet, ring, amulet, hat, shield, or circlet that isnt showing let me know and ill find and fix it.  armor and clothes are pretty much a final thing right now.  i might make a optional plugin later that makes them all visible but that will be once the head is done and im pretty much done with the whole mod its self\n<br />\n<br />\n<br />\n<br />---V1.02---\n<br />this is now a standalone race it no longer effects the skeletons in game.  delete the old files called skeletons and skeletonf as they are no longer needed and replace with the new ones.  first person is working.  armor is yet again removed i will fix this to where only armor that fits the body is shown such as helmets and robes.  all armor will be wearable but wont show up on body so defense can still raised.  health regin is also fixed along with carry weight was orginally 9999 dont know why they chose to set it that high but ok.  damage should also be fixed i tested it myself and everything seemed to be normal for me.  only glitches that remain are in first person the skull is sometimes seen well the lower jaw is and also in first person the left foot looks messed up and stretched.  ill look into fixing those myself unless someone is willing to help me fix this.",
  "categoryId": "34",
  "version": "1.03",
  "author": "Mhenlo The Insane",
  "createdUnix": "1329781713",
  "updatedUnix": "1330032391",
  "containsAdultContent": false,
  "uploadedBy": "xxcthomasxx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "35930",
      "name": "Playable_Skeletons_V1_03",
      "version": "1.03",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "47",
      "fileName": "Playable_Skeletons_V1_03-10622-1-03.zip",
      "uploadedUnix": "1330032391",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/e9b4385506c3d3578c483cfa969509df0c86430af0840407481fe895ba78cfc4/analysis/1406708603/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Playable_Skeletons_V1_03-10622-1-03.zip?fid=35930&ttl=1535771160&ri=8192&rs=8192&setec=bb2bc711a9c6c5a093b0dacfc8d9bbc4"
    }
  ]
}