{
  "modId": 10635.0,
  "modName": "Fort Buldurr - Player House",
  "summary": "DESCRIPTION\r\nAdds a fort named Fort Buldurr to the Rift region that can be utilized as a player house. The fort is rustic and is designed to look like an adventurer\\'s home rather than the home of a town citizen.",
  "descriptionHtml": "[size=+2]This mod is basically dead, at least for now.  Sorry.[/size]\r\n[color=red]TheDarkListener34 and raventrigun have permission to edit, update, and upload this mod anywhere and whenever they want.[/color]\r\n\r\nDESCRIPTION\r\nAdds a fort named Fort Buldurr to the Rift region that can be utilized as a player house. The fort is rustic and is designed to look like an adventurer\\'s home rather than the home of a town citizen. I have tested this mod myself quite a bit and I do not think there are any issues, but I may have overlooked something.  PLEASE LEAVE A COMMENT IF YOU FIND A PROBLEM. Also, please endorse it if you like it or not so that I know whether I should publish something like this again.  See comments section for discussion of this mod.\r\n\r\n*NOTE*\r\nThis mod was first published on Steam Workshop.  The change log below includes record of updates from before uploading to the Nexus on Feb 20th 2012.\r\n\r\nCHANGE LOG\r\nv0.1 - Initial release Feb 15th 2012. Fully decorated, optimized, and navmeshed.\r\nv0.2 - Added pet dog to interior of fort. Feb 15th 2012\r\nv0.3 - Made lighting brighter, added 2 more bookshelves to \\\"dining\\\" room. Feb 16th 2012\r\nv0.4 - Added mannequins, dog is now named \\\"Dog\\\" and roams the fort more than before, dog does not have conversation options for following anymore due to problems, fixed a couple lighting issues, navmesh outside fort is a bit better, but still has issues I cannot solve. Feb 18th 2012\r\nv0.5 - Uploaded dungeon expansion. Access through trapdoor in main fort stairway room. Feb 20th 2012\r\nNEWEST - v0.6 - Fixed exterior navmesh.  Should be completely functional. Also added 2 unique books.  One is \\\"Buldurr\\'s Tale\\\" and it simply thanks you for checking out this mod.  The other is \\\"The Cask of Amontillado\\\" by Edgar Allan Poe, and I added it because it is a short story that I love  Feb 21st 2012\r\n\r\nLOCATION\r\nThe fort is located northeast of the Ruins of Bthalft.\r\nThe map marker is visible immediately upon starting a new game, but you will have to discover it before you can fast travel to it. Alternatively, you can use the console to \\\"teleport\\\" to the interior of the fort or the fort dungeon at any time. In the console, type \\\"coc fortbuldurr\\\" or \\\"coc fortbuldurrdungeon\\\" You can do this without discovering the fort, walk outside the fort, and it will become discovered so you can fast travel from then on.\r\n\r\nFEATURES\r\nWeapon and shield racks\r\n2 unique books\r\nPet dog\r\nMannequins\r\nBig mannequins\r\nEven bigger mannequins\r\nDisplay cases\r\nSafe with lock\r\nBookshelves\r\nAlchemy and Enchanting tables\r\nPlayer owned beds\r\nPlayer owned chests\r\nShelves and tables to decorate\r\nGuard barracks\r\nDungeon\r\nSurprise suit of armor scattered throughout dungeon!\r\nInterior fully navmeshed\r\n\r\nCOMING SOON\r\nDungeon will have access to cave system leading to tall tower that is visible from exterior of fort!\r\nSecret rooms!\r\nQuest to obtain ownership of the fort!\r\nPurchase optional upgrades such as...\r\n- personal guards to defend the fort\r\n- better lighting\r\n- remove rubble and broken down pieces of fort\r\n- upgrade to noble furniture\r\n- other stuff being brainstormed constantly\r\nOther stuff we might think of\r\nComment with any suggestions you have\r\n\r\nCREDITS\r\n-Bethesda for developing Skyrim\r\n-BIG thank you to raventrigun for helping with dialogue and quest aspects of this mod in order to make it fit better into Skyrim, and for being such a great supporter of this mod since the day it was published.\r\n-Edgar Allan Poe for publishing The Cask of Amontillado a long time ago so that it is legal for me to add it as a book in this mod.\r\n\r\nUSAGE PERMISSION\r\nMessage me if you want permission to edit this mod.",
  "categoryId": "67",
  "version": "0.6",
  "author": "bobrockstar",
  "createdUnix": "1329793282",
  "updatedUnix": "1329860511",
  "containsAdultContent": false,
  "uploadedBy": "bobrockstar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34576",
      "name": "FortBuldurr0_5",
      "version": "v0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "190",
      "fileName": "FortBuldurr0_5-10635.rar",
      "uploadedUnix": "1329793568",
      "modVersion": "v0.5",
      "virusScanUrl": "https://www.virustotal.com/file/928d6b010fb1f85efacc6e4fc39285a96cfb977f7528125adbeac0f7a0e12ffe/analysis/1406700311/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FortBuldurr0_5-10635.rar?fid=34576&ttl=1535771191&ri=8192&rs=8192&setec=3f0560a9aef5ecd037730cda7882a22b"
    },
    {
      "fileId": "34956",
      "name": "FortBuldurr0_6",
      "version": "0.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "223",
      "fileName": "FortBuldurr0_6-10635.rar",
      "uploadedUnix": "1329860511",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/924011b871a7a32e156934f6312162a7b61b5886752c32d53e070f2c9be15567/analysis/1406702828/",
      "changelogHtml": " Fixed exterior navmesh. Should be completely functional. <br/> \n Also added 2 unique books. One is \\\"Buldurr\\'s Tale\\\" and it simply thanks you for checking out this mod. The other is \\\"The Cask of Amontillado\\\" by Edgar Allan Poe <br/> \n I added it because it is a short story that I love and the story will soon be a clue (if you read it) to help you find a secret area in Fort Buldurr! :) Feb 21st 2012 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FortBuldurr0_6-10635.rar?fid=34956&ttl=1535771191&ri=8192&rs=8192&setec=718fe0b99004e8c04a64a034a527691e"
    }
  ]
}