{
  "modId": 10643.0,
  "modName": "Haven -Player Home-",
  "summary": "Adds a new player home to Skyrim, in one of the game\\'s most beautiful areas.",
  "descriptionHtml": "**UPDATE  24/02/2012**\r\n\r\n-Fixed the NPC following issue, they will now follow you all over Haven!\r\n-Adjusted the lighting to be less orange/ bronzy\r\n-Made the Dragon Priest alter behind the bed functional. NOTE If you place all masks on Haven\\'s alter before placing them on the one in Laborynthian, it will bug out and you wont be able to get the final mask. SIMPLY put them on the Laborynthian one first and grab the last mask before putting them on Haven\\'s altar. NOTE you can have 7 on the Haven alter and it wont do anything just DONT place the last one till your ready.\r\n-The Haven Vault has been added!!\r\n-Vault has 4 new shield racks!\r\n-Vault has 16 new mannequins!\r\n-Vault has 4 new weapon racks!\r\n\r\nTo update just delete the old Haven.esp and replace it with the new one.\r\n\r\n\r\nBasically, I love this location so I built a house there. I tried to do it in a way that I wouldn\\'t disturb the surrounding area too much and ruin the sights.\r\n\r\nLocation: \r\nHaven is a Dwemer style home built into a cliff side with multiple waterfalls. Follow the road north out of Ivarstead and down the cliff side. There will be a small road that breaks off to the East which takes you to one of the Darkwater Caverns entrances, follow it. When you get down to the water take the stone stairs to the right and into the Haven Tunnels. Once your through the tunnels and armory section, the main entrance to Haven is right there. An easier method that requires no walking is to open up the console and enter   coc havenmain   It will teleport you inside and to discover it all you need to do is step outside. If your having trouble finding it, have a look at the map pictures above.\r\n\r\nWhat\\'s in Haven?\r\n\r\nMain Building:\r\n-Bed\r\n-Bar\r\n-Cooking Spit\r\n-Multiple Weapon Racks both wall mounted and floor ones.\r\n-Multiple Display Cases (may only be big enough for daggers or shortswords)\r\n-2 Mannequins\r\n-Shrine to Talos (opposite of bed on top of dresser)\r\n-Enchanting Table and chest\r\n-Alchemy Table and Chest\r\n-A vendor NPC called Nyl \r\n-Lots of Bookshelves and Cabinets\r\n-There are 2 big piles of books on the floor (I couldn\\'t figure out how to put them on the shelf in the CK so you\\'ll have to do it the long way....sigh)\r\n-2 Full sets of Deadric Armor, both Heavy and Light variants, some weapons as well.\r\n-Rear exit leads to panoramic view (watch your step)\r\n\r\nArmory & Tunnel\r\n-Forge\r\n-Smelter\r\n-Tanner\r\n-Workbench\r\n-Grindstone\r\n-Blacksmithing Chest\r\n-Smith NPC Neera\r\n-Entrance tunnel is rich with every kind of ore     \r\n\r\nInstallation:\r\nIf you use NMM, hit the button and it will do everything for you. If you don\\'t, just extract the Haven file to your Skyrim Data folder and enable it in the launcher.\r\n\r\nPossible Future Additions:\r\n-Tiny dragon that patrols around the house (already dabbled a bit with this, its very buggy and I need alot more experience with NPC/ Actors before its getting added)\r\n\r\nIf anyone has ideas or suggestions on how to improve Haven please share. \r\n\r\nIssues:\r\n-If your married you wont be able to move your partner into Haven. I\\'m not sure how to implement this and I\\'m not going to worry about it. If you really want your partner in Haven you\\'ll have to figure it out in the CK.\r\n-The mannequins can bug out sometimes, just leave and re-enter.\r\n-Some people have been having issues with Haven and Warzones on at the same time, I cannot replicate this problem, if more people are experiencing issues with both on I will try and address it.\r\n\r\nIf you want to modify Haven in anyway, go for it!! Just be sure to acknowledge that my blood, sweat and tears are in every wall. (some might be on the bed too, might wanna clean that before using)\r\nThis is a standalone mod, there should be no conflicts whatsoever with anything else. \r\nThis is my first submitted mod, if there is anything wrong that I missed please speak up and I\\'ll try to fix it. Also, feel free to modify Haven for your own taste, house mods are very personal and everyone is different. Other than that, hope you enjoy it!!\r\n ",
  "categoryId": "67",
  "version": "2.0",
  "author": "ScottyP",
  "createdUnix": "1329797801",
  "updatedUnix": "1330148423",
  "containsAdultContent": false,
  "uploadedBy": "scottypimpin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34603",
      "name": "Haven01",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "43",
      "fileName": "Haven01-10643.rar",
      "uploadedUnix": "1329798241",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/690ea442749222c0ff0d0f7721b9eb3b5ee306297c0a64b7160725919982e354/analysis/1406700496/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Haven01-10643.rar?fid=34603&ttl=1535771198&ri=8192&rs=8192&setec=559e578d089e0d2de7bbef643d736959"
    },
    {
      "fileId": "36533",
      "name": "Haven v2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "127",
      "fileName": "Haven v2-10643-2-0.rar",
      "uploadedUnix": "1330148423",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/aa551d27923c28a694398e15520759f34eb7892eda910ba78c5942164b27d117/analysis/1406711707/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Haven%20v2-10643-2-0.rar?fid=36533&ttl=1535771199&ri=8192&rs=8192&setec=0d1c10b2a289d40a2ec67376f30c6e5e"
    }
  ]
}