{
  "modId": 10644.0,
  "modName": "DARKHOME RETREAT",
  "summary": "This is a free player home in a scenic setting.",
  "descriptionHtml": "DARKHOME_RETREAT_V1_0 by heurex67\r\n\r\nWHAT: \r\n\r\nThis is a free player home meant to be a retreat away from the normal activities of Skyrim. There are no crafting stations, no work to be done.\r\n\r\nMy intent was for this to be my primary residence where I could store all my loot as well as display most of my collectibles. There are many storage chests, many weapon racks and many mannequins. \r\n\r\nThis includes the main house (floorplan from Breezehome) with a large added cellar. The alchemy room is now a study and most of what was in Breezehome has been altered.\r\n\r\nWHERE: \r\n\r\nDue East of Whiterun. Follow the river and at the base of a waterfall is Darkshade cave. Once you find the cave you can fast travel to the home as well. I\\'ve cleaned up around the outside of the cave but left the cave itself intact.\r\n\r\nEXTRAS:\r\n\r\nPsijic clothes on the bed in the cellar, a few odd bits and pieces. No weapons or armor or other exotic bits. There are 3 benches and a chair around the outside of the home that offer some nice nature views.\r\n\r\nExiting the front door moving several meters due east there\\'s a grove of pine trees along the river. I placed a bench next to the big pine as well for added scenic lounging.\r\n\r\nBUGS/ISSUES:\r\n\r\nBreezehome stairs, bleh. Aggravatingly unsmooth. The planter doesn\\'t help.\r\n\r\nMannequins. They like to migrate. I don\\'t think there\\'s anything I can do about it. Seems worst when you go back and forth between the house and cellar several times. Just leave the cell or even the area and come back. I haven\\'t lost anything, the mannequins reset. Just sometimes they go invisible or\r\nfloat in the air. I dunno.\r\n\r\nKeep a save game set aside so you can decide whether you want to keep this or not. Don\\'t blame me if you overwrite, but I\\'ve had no real problems. Enjoy.",
  "categoryId": "67",
  "version": "1.0",
  "author": "heurex67",
  "createdUnix": "1329797835",
  "updatedUnix": "1329797961",
  "containsAdultContent": false,
  "uploadedBy": "heurex67",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34601",
      "name": "DARKHOME2",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35",
      "fileName": "DARKHOME2-10644-1-0.7z",
      "uploadedUnix": "1329797961",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/462b87701c94cf23cdbca718e27049d54d9e35ac9f4c1d57563b09c758e4a47a/analysis/1406700495/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DARKHOME2-10644-1-0.7z?fid=34601&ttl=1535771200&ri=8192&rs=8192&setec=c215a1d96a0836a5dc099bc88887bfbf"
    }
  ]
}