{
  "modId": 10656.0,
  "modName": "Shockwolfs Voluptuous Jenassa",
  "summary": "This is an improved Jenassa companion.",
  "descriptionHtml": "[b]Shockwolf\\'s Voluptuous Jenassa.[/b]\r\n\r\nRemember that Dark Elf bird you met in the Drunken Huntsman in Whiterun last night?\r\nDon\\'t you think she was rather Voluptuous?\r\nNo?\r\nMaybe it was that stale Mead you were knocking back?\r\nNow that you\\'re sober, you might want to consider giving her a second glance...\r\n\r\nThis is an improved Jenassa companion. With the help of Apachii\\'s SkyHair and Zalzama\\'s Amazing Smooth females face texture, I have given Jenassa a major makeover. The SkyHair is not necessary to use with this as the files used are already included. Although I do recommend it anyway, as they are great mods. I have also used Acdales EyeCandy Body (ADEC) and Draconic Dragonscale Armour in the screenshots (not included), which I also use and what gives Jenassa her Voluptuousness, but you can use whatever body you like with this.\r\n\r\nI have also made Jenassa feminine in her animations and made her essential. If she gets beaten, she will still struggle on the ground, but she should never actually die, anymore.\r\n\r\nI have changed some of Jenassa\\'s vanilla behaviour characteristics.  Her fighting style I have changed from a Forsworn Berserker (Low) to an Assassin Missile style.  Her class skill weights are now focused on One-Handed 2, Archery 3, Block 1, Light Armour 2 and Sneak 3.\r\nFor a comparison the vanilla Combat Ranger skill weights that Jenassa had were One-Handed 2, Archery 3, Block 2, Light Armour 3 and Sneak 1.\r\n\r\n\r\n[b]Installation:[/b]\r\n\r\n1. [url=http://skyrim.nexusmods.com/downloads/file.php?id=140] Download and install Amazing Smooth Females Complete[/url].  If you plan on installing the ADEC body, then you will need to install this Smooth Females mod AFTER it, to help insure that the skin tones match.\r\n2. Then after downloading this mod as well, Unzip the file contents to steamapps\\\\common\\\\skyrim\\\\data\r\n3. Activate SW_Jenassa.esm in the Nexus Mod Manager or the Skyrim Launcher.\r\n\r\n[i]Note: If you have any of the old esp files for this mod installed, you\\'ll need to remove/delete them. [/i]\r\n\r\n[b]Uninstall:[/b]\r\n\r\nSimply delete the SW_Jenassa.esm from steamapps\\\\common\\\\skyrim\\\\data\r\nIf you want to get rid of the files for her hair, they can be located here:\r\nHair07 files found in \r\nSteam\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\mesh\\\\actors\\\\character\\\\character assets\\\\hair\\\\apachii\\\\female\r\nand\r\n66a_n.dds and 66a_silver7a.dds files found in Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\textures\\\\actors\\\\character\\\\hair\\\\apachii\\\\Anto\r\n\r\n\r\n \r\n[b]Recommended Mods:[/b] As used in the images of Jenassa and parts taken from to make this mod possible.\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=10168]ApachiiSkyHair[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=140]Amazing Smooth Females Complete[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=5390]Acdale EyeCandy Body[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7782]ADEC Armour and Clothing Complation[/url]\r\n\r\n\r\n[b]The Grey Face Bug[/b]\r\n\r\nProviding you have installed this mod correctly and used all of the recommended mods to accompany it, there should be no mismatch between this characters head and body colour.  I have also followed the necessary steps with the Creation Kit to eliminate the Grey Face Bug before releasing it to the public and I have tested it myself.  As you can see from the images provided the bug is not present for me when I am using them.   However on the off chance that the bug still affects you, there is a way you can attempt to fix it yourself.  [url= http://www.youtube.com/watch?v=rOXF89QtgYM]Here is a helpful video showing you how you can do this.[/url]  Hopefully Bethesda will come up with a fix for this soon.\r\n\r\n\r\n[b]Credits/Thanks[/b]\r\n\r\nBethesda for Skyrim.\r\nApachii for the use of the hair from their SkyHair Mod.\r\nZalzama  for the Amazing Smooth females face texture used in this mod.\r\nAcdale for the use of their ADEC body and Armour in the images.\r\n\r\n\r\n[b]Updates:[/b]\r\n\r\n[b]Version 1.04[/b]\r\nIncreased Jenassa\\'s speed to help her keep up.\r\nNow that I\\'ve found out a work around to the Face Tint Bug, I have made Jenassa look how I originally Intended.  She now has Darker Greyish Blue Skin, War paint across her left eye and brightly coloured unique Darkelf eyes.\r\n\r\n[b]Version 1.03[/b]\r\nI have changed some of Jenassa\\'s vanilla behaviour characteristics.  Her fighting style I have changed from a Forsworn Berserker (Low) to an Assassin Missile style.  Her class skill weights are now focused on One-Handed 2, Archery 3, Block 1, Light Armour 2 and Sneak 3.\r\nFor a comparison the vanilla Combat Ranger skill weights that Jenassa had were One-Handed 2, Archery 3, Block 2, Light Armour 3 and Sneak 1. \r\n\r\n[b]Version 1.02[/b]\r\nAfter my attempts at making version 1.01 correct Jenassa\\'s obsession with getting naked failing, I decided to release 2 versions.  A Main file with default armour assigned to prevent her from ever going naked and an Optional file to provide players with the other choice.  The Default armour being off, means you can manually manipulate what she wears when following you, instead of companions occasionally using their default armour that you don\\'t want them to use, which can be very annoying and nonsensical when you\\'ve given them better gear. This option does however mean that she will go naked when not following and is just what Bethesda seemed to do with the AI for some reason.  This I understand can be very upsetting to certain players, but for some of us not at all as the case may be. >;-D   This is why I am providing the choice of Main file with default Armour and Optional Without.  Simplest piece of advice; If you don\\'t like it don\\'t download it.  Please don\\'t feel obliged to download, install it, use it and then whinge about it.  Thank you.\r\n\r\n[b]Version 1.01[/b]\r\nAttempted to stop Jenassa from going naked when not following the player by adding normal clothes to her inventory.\r\n\r\n\r\nEnjoy!\r\n\r\n\r\nShockwolf\r\n",
  "categoryId": "66",
  "version": "1.04",
  "author": "Shockwolf",
  "createdUnix": "1329814154",
  "updatedUnix": "1334746838",
  "containsAdultContent": false,
  "uploadedBy": "ShockWolF",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54222",
      "name": "SW_Voluptuous_Jenassa",
      "version": "1.04",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1921",
      "fileName": "SW_Voluptuous_Jenassa-10656-1-04.rar",
      "uploadedUnix": "1334746750",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/f630ab5e53939c7aee6a3a7a5f1c89fa40f202c7864e6ac6b9452715a069b150/analysis/1406821627/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SW_Voluptuous_Jenassa-10656-1-04.rar?fid=54222&ttl=1535771214&ri=8192&rs=8192&setec=4c9157d7b3038e8617588ff5caceb563"
    },
    {
      "fileId": "54223",
      "name": "SW_Jenassa_Default_Armour_Off",
      "version": "1.04",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1921",
      "fileName": "SW_Jenassa_Default_Armour_Off-10656-1-04.rar",
      "uploadedUnix": "1334746838",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/1508f0fb60a8c50bfa22f79106ea4dfef33853d3d2f52467dd20d075e05612a6/analysis/1406821629/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SW_Jenassa_Default_Armour_Off-10656-1-04.rar?fid=54223&ttl=1535771215&ri=8192&rs=8192&setec=2694276ee7ec0edd57ee34baf9ad7894"
    }
  ]
}