{
  "modId": 10667.0,
  "modName": "Ultimate training ground",
  "summary": "The ultimate training ground introduces to the people of Whiterun the hall of valor.In it are gathered the best trainers in all of Tamriel.All are master level  fully voice acted and will assist you with your training.Also there are included beds,alchemy  and enchanting workbenches.Also there is a shrine with all the blessing so you could choose yo",
  "descriptionHtml": "Ultimate training ground\r\n\r\nWhat is the ultimate training ground?\r\n\r\nThe jarl of whiterun have invited the best trainers in Tamriel to his majestic Hall of Valor.They are the ultimate warriors of Tamriel and are 100 percent willing to assist the Dovahkiin in his training.Also the hall is well equipped for those willing to join it.It has beds,crafting benches and everything you might need.\r\nWhat is the hall of Valor:\r\nIN the hall of valor there are alternatives to the vanila master trainers.They do not replace them or have any conflict with them.Just it is way easier to find the master trainer you need.This is WIP and will be heavily developed over time.First i will try removing any bugs which may appear.Second i will start developing stories and quests for each of the trainers .\r\n\r\n\r\nHow to get there:\r\nThe hall of valor is located along the wall of Dragonreach.You should look to the left from the Dragonreach entrance.Refer to the screens to view the entrance.IF you still cannot find it use the following code: Coc ultimatetrainingground .This will teleport you directly into it.\r\n\r\nManual installation notes:\r\n1)Put the file Ultimate training ground.esp in the skyrim/data\r\n2)Activate it with your favourite mod manager\r\n\r\n\r\nFuture plans:\r\n1)Development of quests connected with the story of each trainer,with unique rewards :)\r\nChangelog:\r\n3/5/2012\r\nProperly sorted out the trainers with armors\r\n23/2/2012\r\nV1.1 Added player owned chest near the fireplace.Refer to the screenshots if you cannot find it.\r\nTrainers can train until skills level 100>>>i will try to allow them to train until 300.\r\n21/2/2012\r\nV 1.0 Initial release\r\n\r\n\r\n\r\nIf u like the mod please come back and endorse it,so other people could find it and enjoy it :)Also endorsments increase my will to continue developing mods :)\r\nFor any assistance,good attitude,nice video or pictures i will give kudos :)\r\n\r\n\r\nFor further suggestions,feedback,bugs reports,requests and ideas refer to the comment section.I will try to answer as fast i can and give as full feedback as i can. \r\nMy other mods:Secondary perks enhanced -http://skyrim.nexusmods.com/downloads/file.php?id=11418\r\nTomb Ahranas-http://skyrim.nexusmods.com/downloads/file.php?id=9560",
  "categoryId": "33",
  "version": "1.2",
  "author": "Powerclick",
  "createdUnix": "1329823436",
  "updatedUnix": "1336074781",
  "containsAdultContent": false,
  "uploadedBy": "powerclick",
  "primaryFile": null,
  "files": [
    {
      "fileId": "58397",
      "name": "Ultimate training ground",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "41",
      "fileName": "Ultimate training ground-10667-1-2.rar",
      "uploadedUnix": "1336074781",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/d1f172c43e1f4e0d649a45490978f7b2c61005a898cf4d66d98facd25869e624/analysis/1406863820/",
      "changelogHtml": " As promised i made sorting of the trainers with proper armors corresponding to their discipline <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ultimate%20training%20ground-10667-1-2.rar?fid=58397&ttl=1535771229&ri=8192&rs=8192&setec=f21b25c7cb5cfea8c647ce9833f5c4ed"
    }
  ]
}