{
  "modId": 10676.0,
  "modName": "BMC - Anna Savegame",
  "summary": "WARNING:  This save is intended to be used along with \\\"Live Another Life\\\" by Arthmoor (http://skyrim.nexusmods.com/downloads/file.php?id=9557), I doubt it will work properly if your not using that mod and with the horribly gimped CS I don\\'t intend to fix it to work as a pre-set.",
  "descriptionHtml": "WARNING:  This save is intended to be used along with \\\"Live Another Life\\\" by Arthmoor (http://skyrim.nexusmods.com/downloads/file.php?id=9557), I doubt it will work properly if your not using that mod and with the horribly gimped CS I don\\'t intend to fix it to work as a pre-set.\r\n\r\nI\\'m not happy with the amount of clones in this game due to the severely (seriously, we can\\'t even adjust nose width?) limited character gen as such I didn\\'t intend to upload saves till we got the CS to fix it but now the CS is out and it turns out its just as gimped as the in game character gen I figured I may as well.\r\n\r\nThis is my most recent character, another Nord but this time I\\'m finally trying mage now there are some mods available to make it less tedious.\r\n\r\nThis save is immediately after character gen, before you first gain control of your character to in choosing your starting location through the shrine to Mara.\r\n\r\nIt has to be said I am using some texture mods/fixes as listed below, all available on skyrimnexus.\r\n\r\nNo More Blocky Faces + LUEF patch by Xenius & arlekin\r\nDetailed Faces by Xenius\r\nDetailed Bodies by Xenius\r\nHigh Quality Eyes by Xenius\r\n\r\nI don\\'t use the lips mod however despite testing it so be warned that does change the appearance quite dramatically, I just wanted a more natural un-made up look for characters where I felt the lips mod looked more like lipstick with my settings.\r\n\r\nDue to time passed you will almost certainly get a missing mods warning on loading this file, not least due to me using various mods from the nexus but also because I have my own private crafting mods and the likes, none of them should affect loading however and I also reduced my games grids to load to default before creating this \r\n\r\ncharacter so accept loading and see if it works.",
  "categoryId": "43",
  "version": "1.0",
  "author": "Badmagic",
  "createdUnix": "1329830205",
  "updatedUnix": "1329830398",
  "containsAdultContent": false,
  "uploadedBy": "Badmagic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34767",
      "name": "BMC Anna 7z",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3759",
      "fileName": "BMC Anna 7z-10676-1-0.7z",
      "uploadedUnix": "1329830398",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c60be9330edff13c8e57cf8f74b4b5eac6889387b926ad835fa428bccdf81f76/analysis/1406701222/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BMC%20Anna%207z-10676-1-0.7z?fid=34767&ttl=1535771241&ri=8192&rs=8192&setec=c21c2c5a549636e81b37ed8c4e89202e"
    }
  ]
}