{
  "modId": 10688.0,
  "modName": "Barad Mithost",
  "summary": "Perched on a ridge high above the Whiterun tundra stands the grey watchtower of Barad Mithost. A LOTR inspired home for a mid-to end-game character.",
  "descriptionHtml": "\r<br />[center][size=5][b]~ UPDATE 05-07-17 ~[/b][/size]\r<br />No content update, but did unhide the file making it available again [b][u][i]as-is[/i][/u][/b] for those asking for it. \r<br />Please note there are a number of minor bugs that I&#39;ve not had the time to iron out.\r<br />At this point, I am not planning any further updates to this mod.\r<br />\r<br />[u]Are you a mod author and interested in reviving this home?[/u] \r<br />Please feel free to clean up, enhance and/ or bring over to Skyrim SE.\r<br />I&#39;d be thrilled and happy to provide a link&#33; Just let me know.\r<br />\r<br />[i]Cheers and Happy Modding&#33;[/i][/center]\r<br />\r<br />[center][size=5][b]~ DESCRIPTION~[/b][/size][/center]\r<br />\r<br />Perched on a ridge high above the Whiterun tundra stands the grey watchtower of Barad Mithost. Looking up from the valley floor the tower seems inaccessible, but with a little exploring this fully furnished tower can be your home in Skyrim&#33;\r<br />\r<br />[b][u][color=c5baa9][size=3]Background:[/size][/color][/u][/b]\r<br />\r<br />I was having trouble finding a suitable medium-sized, lore-friendly abode for my mid-level battlemage: while there are many wonderful humble starter homes, and an impressive number of epic end-game Dovahkiin palaces, there seems to be little in between. Thus I built Barad Mithost, designed for a mid-to-late game player which I am sharing solely with the NEXUS community as a way of saying Thank You for far too many hours spent enjoying heavily modded TES games: Morrowind, Oblivion and Skyrim.\r<br />\r<br />[b][u][color=c5baa9][size=3]Theme:[/size][/color][/u][/b]\r<br />\r<br />The primary structural elements (tower, walls, floor) are Dwemer, but the overall feel (furniture, hangings, architectural decoration) is Nordic. With the exception of the hearths and forge, I have downplayed the Dwemer theme in favor of a Nordic feel. I took strong inspiration from Gondor and Rohan in LOTR.\r<br />\r<br />See the section below on Lore & History for more background.\r<br />\r<br />[b][u][color=c5baa9][size=3]Location[/size][/color][/u][/b]\r<br />\r<br />NW of Whiterun and due North of Silent Moons Camp. Look for a series of long stairs; see the pictures for more detail. Warning for low level characters: there is a vanilla predator spawn point near the bottom of the stairs. Be prepared for a Saber Cat or Bear&#33;\r<br />\r<br />[center][size=5][b]~ FEATURES ~[/b][/size][/center]\r<br />\r<br />The interior tower structure is roughly based on the Markarth Guard Tower: descending from the tower entryway, the player enters the main hall. On either side of the main hall run two parallel halls: Smithy, crafting and alchemy to the left, Enchanting/ Armory straight ahead and the library and living quarter to the right.\r<br />\r<br />[b][u][color=c5baa9][size=3]Interior Features:[/size][/color][/u][/b]\r<br />\r<br />[list]\r<br />[*]Full Smithy (Anvil, Skyforge, Grindstone, Workbench, Tanning Rack) with 3x Storage Containers\r<br />[*]Woodcutting Nook with convenient weapon rack - never lose that wood axe again&#33;\r<br />[*]Alchemy Room (Alchemy Station, Cooking Spit) with Satchel and 12x Storage Containers \r<br />[*]Main Hall with 7x Weapon Mounts, 2x Shield Mounts, 8 Dragon Mask Busts, 4x Storage Containers, 4x Mannequins and decorative Nordic mural walls\r<br />[*]Enchanting Room/ Armory (Enchanting Station) with 6x Weapon Mounts, 1 Shield Mount, 3x Storage Containers, 2x Mannequins and 2 shelves full of stuff for atmosphere. \r<br />[*]Library with shelves for 378 books, plus more shelves for 44 books in the living room for a grand total of 422 books&#33;\r<br />[*]Map Room for planning your next adventure with 1 shield mount, 3x Storage Containers\r<br />[*]Living/ Dining/ Hearth Room. Sit back, relax and enjoy the comforts after a long day adventuring with 2x Weapon Mounts, 2x Shield Mounts (shields only)\r<br />[*]Cozy Bedroom with double bed, 1 Shield Mount, 3x Storage Containers, 1x Mannequin\r<br />[*]Tower Entryway with connecting door to the Tower Courtyard and a ladder to the Balcony\r<br />[/list]\r<br />\r<br />[b][u][color=c5baa9][size=3]Exterior Features:[/size][/color][/u][/b]\r<br />\r<br />[list]\r<br />[*]270 degree Balcony of views from the SE to the NW\r<br />[*]4 Balcony Platforms with watchtower chairs facing SE, S, SW, NW. Misty-shrouded Mountains the SE and amazing sunsets to the NW&#33; \r<br />[*]Exterior Tower Courtyard situated high above the path to Mara’s shrine. Map marker for fast travel to the Courtyard.\r<br />[*]Cliff-hugging stairway leading down the ridge behind Silent Moons Camp for access to the Whiterun Tundra.\r<br />[/list]\r<br />\r<br />[b][u][color=c5baa9][size=3]Other Features:[/size][/color][/u][/b]\r<br />\r<br />[list]\r<br />[*]Hand-placed lighting and clutter creates a comfortable, living home feel.\r<br />[*]Interior fully Navmeshed (mostly by hand), tested and companion-friendly&#33;\r<br />[*]Exterior fully Navmeshed (all by hand), some minor issues with balcony and approach via southern stairs. See known issues for complete details.\r<br />[/list]\r<br />\r<br />[center][size=5][b][color=FFFFFF]~ LORE & HISTORY ~[/color][/b][/size][/center]\r<br />\r<br />Originally a Dwemer construction, Barad Mithost was established as a watchtower in the Late Middle to Late Merethic Era by the expanding Dwemer. However, guarding the Northern passes, Barad Mithost was quickly claimed by the Nords during the Nordic Empire’s expansion in the early First Era. It is not known if the tower was acquired through diplomacy, fell from an assault, or through treachery. Regardless, with the growth of the Nordic power across Skyrim, the tower occupied a strategic location and continued to remain a Nordic holding through the eras.\r<br />   \r<br />Thus, while the tower is obviously Dwemer in construction, with over three Eras as a Nordic possession, Barad Mithost clearly has been heavily influenced by Nordic culture and design.\r<br />\r<br />The name, however, is not based in Tamrielic lore. Instead, it is derived from LOTR Quenya and Sindarin elements. Barad: Tower, Mith: Grey, Ost: Fortress.\r<br />\r<br />[center][size=5][b][color=FFFFFF]~ VERSION HISTORY ~[/color][/b][/size][/center]\r<br />\r<br />[b]Current Version: 3_0[/b]\r<br />\r<br />[b]v3_0:[/b] \r<br />[list]\r<br />[*]Major update to balcony and main hall\r<br />[*]Exterior balcony railing replaced   \r<br />[*]Main Hall- rug replaced, table runners, more tables\r<br />[*]Main Hall - 4x weapon plaques added\r<br />[*]Main Hall - 2x mannequins added, improved stands. \r<br />[*][b]Remove armor from mannequins in main hall prior to updating&#33;[/b]\r<br />[*]Woodcutting Nook - shifted woodpile to avoid clipping\r<br />[*]Alchemy Room - expanded cooking area, added 9x containers, shifted clutter\r<br />[*]General clean-up and removal of redundant statics\r<br />[/list]\r<br />\r<br />[b]v2_9:[/b] \r<br />[list]\r<br />[*]Replaced re-spawning treasure Apothecary Satchel in Apothecary Rm with a safe container. Remove all items from satchel prior to updating&#33;\r<br />[*]Added small chest to Apothecary Table in Apothecary Rm.\r<br />[*]Removed unnecessary static clutter from enchanting room shelf. (Was causing the Wolf Helmet to fall)\r<br />[/list]\r<br />\r<br />[b]v2_8:[/b] \r<br />[list]\r<br />[*]Fixed bugged center bookshelf in library room. Remove all books from center bookshelf before updating.\r<br />[*]Added embers to watchtower balcony pillars as requested\r<br />[/list]\r<br />\r<br />[b]v2_7:[/b] \r<br />[list]\r<br />[*]Fixed light glitch in main entry hall - slightly less dramatic but no longer buggy.\r<br />[*]Rotated map so it showed Skyrim correctly\r<br />[*]Set larger rocks on W.side as LOD to prevent seam from showing when traveling path on W.side\r<br />[*]Fixed several cosmetic issues (rugs, seam showing on external stair)\r<br />[*]Added embers to courtyard pillars\r<br />[*]Removed 2nd story ring platform in tower interior\r<br />[/list]\r<br />\r<br />[b]v2_6:[/b] \r<br />[list]\r<br />[*]Reworked exterior Navmesh\r<br />[/list]\r<br />\r<br />[center][size=5][b]~ INSTALL/ UPDATE/ UNINSTALL ~[/b][/size][/center]\r<br />\r<br />[b][u][color=c5baa9][size=3]Updating from v2_9 or prior to Current Version[/size][/color][/u][/b]\r<br />\r<br />Current version changes placement of the two mannequins in the main hall outside the enchanting room for all prior versions. Remove all armor and weapons before updating. \r<br />\r<br />If you have anything on the side tables in the main hall, closest to the entryway (incl the silver clutter and flowers which were originally placed there), please remove them prior to updating. Those tables are replaced with mannequin stands in v3_0. \r<br />\r<br />[b][u][color=c5baa9][size=3]Updating from v2_8 or prior to Current Version[/size][/color][/u][/b]\r<br />\r<br />Current version removes the re-spawning alchemy satchel in the alchemy room (to the right of the alchemy table) with a safe version. Bug exists in all versions prior to 2_9. Remove any items from the alchemy satchel before updating. \r<br />\r<br />[b][u][color=c5baa9][size=3]Updating from v2_7 or prior to Current Version[/size][/color][/u][/b]\r<br />\r<br />Current version fixes a duplicate bookshelf bug in the library. Bug exists in all versions prior to 2_8. Remove all books from the center bookshelf (all 3 shelves) in the library. Exit the tower and do a hard save. Update to current version. Some users may need to wait 24hrs in game for the change to update properly.\r<br />\r<br />[b][u][color=c5baa9][size=3]First Time Install of Current Version[/size][/color][/u][/b]\r<br />\r<br />No special install/ uninstall instructions. This is a simple ESP which uses only Skyrim vanilla resources. As always, make backups of your saves and data root directory when testing out a new mod. This mod is presented as-is and you use it at your own risk.\r<br />\r<br />Highly recommend Nexus Mod Manager for install/ uninstall of any mod. See Gopher’s excellent walk through if you are unfamiliar with NMM or installing/ uninstalling mods.\r<br />\r<br />[b]Nexus Wiki - NMM Video:[/b] http://wiki.tesnexus.com/index.php/NMM_Video_Tutorials\r<br />\r<br />[center][size=5][b]~ KNOWN ISSUES & CONFLICTS ~[/b][/size][/center]\r<br />\r<br />[b][u][color=c5baa9][size=3]CK Cleaning[/size][/color][/u][/b]\r<br />\r<br />I have been unable to clean current version using the CK. There -should- be no unintentional edits to other cells. Only exterior cells (0,5), (0,6), (0,0) and interior cell BaradMithost are intentionally modified. (0,0) appears to be modified only for the LOD issue below. \r<br />\r<br />As soon as I figure out why my CK is unable to clean I will update with a cleaned version.\r<br />\r<br />[b][u][color=c5baa9][size=3]LOD Bug for Large Items:[/size][/color][/u][/b]\r<br />\r<br />Both the tower and the rock cliff the tower sits on have been marked as Full LOD to prevent them from disappearing. There are reports that this workaround does not always work properly.\r<br />\r<br />[b][u][color=c5baa9][size=3]Balcony Issues[/size][/color][/u][/b]\r<br />\r<br />[b] v3_0 significantly reduces the number of statics in the balcony railing and should give most users a HUGE increase in frame rate performance. Enjoy&#33;[/b]\r<br />\r<br />The balcony is fully Navmeshed but because of the tight confines, companions will often teleport around the balcony. This is exacerbated by the poor static mesh model of the tower which depicts more space then is actually available for movement. \r<br />\r<br />[b][u][color=c5baa9][size=3]Shield/ Sword Mounts by Living Room Hearth:[/size][/color][/u][/b]\r<br />\r<br />Mount the shields first, then the swords. Cause is unknown.\r<br />\r<br />[center][size=5][b]~ FAQs ~[/b][/size][/center]\r<br />\r<br />[color=c5baa9][b]Q: Your mod broke my game/ ruined my save/ caused the world to end&#33;[/b][/color]\r<br />[b]A:[/b] Well, that is unfortunate. Did you read the install notes and known issues? This is a slightly buggy mod...\r<br />\r<br />[color=c5baa9][b]Q: Will you fix (Insert Known Issue Here)?[/b][/color]\r<br />[b]A:[/b] Not at this point. See the update at the top though. I&#39;d be thrilled if someone ported a clean version over to Skyrim SE&#33;\r<br />\r<br />[color=c5baa9][b]Q: My game does not look anything like your pictures - you lied to me&#33;[/b][/color]\r<br />[b]A:[/b] Pictures lie all the time. In this case, I am using a customized color pallet, ENB config and a touch of the FXAA postprocess injector. I&#39;m NOT using any of the Darker Dungeons mods.\r<br />\r<br />[color=c5baa9][b]Q:It&#39;s really, really dark in here&#33;[/b][/color]\r<br />[b]A:[/b]I&#39;ve tweaked the lighting for my exact setup (see above) which has ambient lighting and source intensity similar to vanilla Skyrim. If you&#39;re using one of the Darker Dungeons or a custom ENB config which lowers either ambient light or light source intensity it&#39;s going to be REALLY DARK.\r<br />\r<br />   You have two options to &#34;lighten up&#34; Barad Mithost:\r<br />[color=c5baa9][b]   (1)[/b][/color] Go into the CK and crank up the ambient lighting for the cell &#34;BaradMithost.&#34; \r<br />   It&#39;ll take you 10 minutes at most, and that includes reading up on the wiki. =0)\r<br />\r<br />[color=c5baa9][b]   (2)[/b][/color] There are a growing number of mods which add place-able light sources. Check &#39;em out. There are a few recommendations in the comments    sections.\r<br />\r<br />[color=c5baa9][b]Q: How come the pictures show armor/ weapons/ books but when I load up the house they’re missing?[/b][/color]\r<br />[b]A:[/b] I put those in during the course of my gameplay to show what the house looks like with stuff in it. However, adding the Mace of Molag Bal or Nordic Hero weapons would be experience breaking. That said, there are a two small items which might be considered experience breaking even for a mid-level character: (1) dragonbone helmet and (1) black soul gem.\r<br />\r<br />[color=c5baa9][b]Q: Will you add/ change XYZ?[/b][/color]\r<br />[b]A:[/b] Not at this point. Sorry.\r<br />\r<br />[color=c5baa9][b]Q: Can I use your tower in my mod or tweak your tower to better fit my tastes?[/b][/color]\r<br />[b]A:[/b] Sure, all I ask is that you: (1) let me know so I can enjoy your mod and link to it from here and (2) give credit where credit is due.\r<br />\r<br />[color=c5baa9][b]Q: You have only uploaded to the Nexus. Can I upload to Steam or site XYZ?[/b][/color]\r<br />[b]A:[/b] No. This is my personal house mod released to support the Nexus community. Please respect my wishes. If you substantially change the mod and decide to upload outside of the Nexus, please remove the name Barad Mithost from the title.\r<br />\r<br />[center][size=5][b]~ ACKNOWLEDGEMENTS ~[/b][/size][/center]\r<br />\r<br />Bethesda for Skyrim and the CK\r<br />GIMP used for image editing\r<br />Poliahu for Beta testing and holding off playing Skyrim for two weeks while I worked.",
  "categoryId": "67",
  "version": "3.0",
  "author": "stevea2",
  "createdUnix": "1329837705",
  "updatedUnix": "1331757467",
  "containsAdultContent": false,
  "uploadedBy": "stevea2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34811",
      "name": "Barad Mithost v2_6",
      "version": "2.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "135",
      "fileName": "Barad Mithost v2_6-10688.7z",
      "uploadedUnix": "1329837951",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/833d22bdab8b70cecb317da7ed588919d1844557d50c2d0963baf9214da3d843/analysis/1406701754/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Barad%20Mithost%20v2_6-10688.7z?fid=34811&ttl=1535771262&ri=8192&rs=8192&setec=60ebba4fa29bf640d21d39fdc49c2fe1"
    },
    {
      "fileId": "36183",
      "name": "Barad Mithost v2_7",
      "version": "2.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "135",
      "fileName": "Barad Mithost v2_7-10688.7z",
      "uploadedUnix": "1330088335",
      "modVersion": "2.7",
      "virusScanUrl": "https://www.virustotal.com/file/d832daac7b7e9c1f608276163dfbfcd53ea56ad0c8b726b2d00b4977b289621c/analysis/1406710022/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Barad%20Mithost%20v2_7-10688.7z?fid=36183&ttl=1535771262&ri=8192&rs=8192&setec=e14341d8678a5b3a2841321573cebc27"
    },
    {
      "fileId": "36689",
      "name": "Barad Mithost v2_8",
      "version": "2.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "135",
      "fileName": "Barad Mithost v2_8-10688.7z",
      "uploadedUnix": "1330190748",
      "modVersion": "2.8",
      "virusScanUrl": "https://www.virustotal.com/file/cc9781a852c61bfd2722782175c41363599cb0eb4cebe422c9045ab01d15ddd7/analysis/1406712543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Barad%20Mithost%20v2_8-10688.7z?fid=36689&ttl=1535771263&ri=8192&rs=8192&setec=df0b4ff8bc6a3b971553e96c93a457e2"
    },
    {
      "fileId": "37992",
      "name": "Barad Mithost v2_9",
      "version": "2.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "136",
      "fileName": "Barad Mithost v2_9-10688.7z",
      "uploadedUnix": "1330430832",
      "modVersion": "2.9",
      "virusScanUrl": "https://www.virustotal.com/file/8611b4b51e471fb5cf7b0a3113a22eff609a30618a63fa99d2f6babc806d947a/analysis/1406719206/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Barad%20Mithost%20v2_9-10688.7z?fid=37992&ttl=1535771263&ri=8192&rs=8192&setec=0a1d008a1b80e45d64102f2c9d251fcc"
    },
    {
      "fileId": "43370",
      "name": "BaradMithost",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "135",
      "fileName": "BaradMithost-10688-3-0.7z",
      "uploadedUnix": "1331757467",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/0aef87db3936dc2a97b9ac7ff0904eab18bbb467cee670b0909f706ae6b934e2/analysis/1406749263/",
      "changelogHtml": " Major update to balcony and main hall <br/> \n Exterior balcony railing replaced <br/> \n Main Hall- rug replaced, table runners, more tables <br/> \n Main Hall - 4x weapon plaques added <br/> \n Main Hall - 2x mannequins added, improved stands. <br/> \n Woodcutting Nook - shifted woodpile to avoid cliping <br/> \n Alchemy Room - expanded cooking area, added 9x containers, shifted clutter <br/> \n General clean-up and removal of redundant statics <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BaradMithost-10688-3-0.7z?fid=43370&ttl=1535771263&ri=8192&rs=8192&setec=10755f1f8b8b1056cfc90f64174f0b7e"
    }
  ]
}