{
  "modId": 10692.0,
  "modName": "Whiterun Guard Followers",
  "summary": "Contains 4 stand-alone, lore-friendly, Whiterun Guard characters for you to recruit from Dragonsreach.",
  "descriptionHtml": "Hi, I\\'m very new to the Creation Kit, and modding in general, so this is just a very basic NPC companion mod. I made it for my own personal use mainly, however I thought I\\'d share it considering there isn\\'t such a mod available already. The NPCs only have the very basic dialogue options (just the recruitment options), then have all the standard follower options that bethesda created. \r\n\r\nThey can be found in Dragonsreach in Whiterun, 3 of them on the balconies overlooking the main hall (go up the stairs at the back and double back on yourself) and one is in the hall itself, near the doorway to Farengars alcove. (If you can\\'t find them, comment and I\\'ll post screenshots showing where they are.)\r\n\r\nI gave them all the basic guard weaponry -- they all have imperial bows, whiterun standard armours. I tried to mix it up a bit while being lore friendly, so two have 2handed weapons, and 3 of them have non-standard headgear. Obviously these are quite low level (steel mostly) allowing you to give them better equipment if you want.\r\n\r\nAs a further note, I\\'m very new to this modding stuff, so it is conceivable there will be bugs. I do not think there will be any game shattering ones, (I custom created the NPCs and did not alter any worldspaces or scripting), however I cannot be certain. Therefore USE AT YOUR OWN RISK. I accept no responsibility for your computer imploding while using my mod, or any other results.\r\n\r\nOther mods that would work well with my mod. (I did not create any of them, and I haven\\'t touched any of their stuff)\r\nAllows multiple followers, all with proper dialogue (I use this, and it works great for me, however it is still only a beta):\r\n\r\nhttp://forums.bethsoft.com/topic/1345602-wiprel-multiple-followers/\r\n\r\nWhiterun Western Watchtower and Whitewatch Camp (Both by Jace_1991):\r\n\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=9555\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=9277\r\n\r\n",
  "categoryId": "66",
  "version": "1.0",
  "author": "Will_B_1991",
  "createdUnix": "1329838958",
  "updatedUnix": "1329839118",
  "containsAdultContent": false,
  "uploadedBy": "Will_B_1991",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34817",
      "name": "Whiterun Guard Followers",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Whiterun Guard Followers-10692-1-0.zip",
      "uploadedUnix": "1329839118",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4211c6a4bb0fc70cb9fbc3304bdeb25115bdec349e3fe1a854630c2c21ad1fe0/analysis/1406701743/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whiterun%20Guard%20Followers-10692-1-0.zip?fid=34817&ttl=1535771269&ri=8192&rs=8192&setec=b7e1d1a475cbd536bb7dd6cb2c662ee5"
    }
  ]
}