{
  "modId": 10740.0,
  "modName": "Roman Imperial armor and weapons",
  "summary": "Adds a set of heavy and light Roman style armors and weapons to Skryim. Replacer is optional.",
  "descriptionHtml": "[Center][img] http://img.photobucket.com/albums/v298/CorvusTortus/banner-roman_zps1b37cdda.jpg [/img][/center]\r\n\r\n[CENTER]CUSTOM ROMAN MODELS FOR SKYRIM\\'S LEGIONS[/CENTER]\r\n[CENTER] (A mod in progress...) [/CENTER]\r\n[CENTER]Part of the [url=http://forums.nexusmods.com/index.php?/topic/610587-wip-imperial-affairs/page__p__4849359__fromsearch__1#entry4849359]Imperial Affairs[/url] mod series[/CENTER]\r\n\r\n\r\n[img] https://lh5.googleusercontent.com/-pybF8NOivgE/UB3Ar5WXcDI/AAAAAAAAAOU/miZIEW_AmD0/s605/Announcements.png [/img]\r\n\r\n*13 April 2013\r\nDear all,\r\n[size=15] This mod has been superseded by a larger conversion mod and now continues here: [url=http://skyrim.nexusmods.com/mods/32988]http://skyrim.nexusmods.com/mods/32988[/url] [/size]\r\n\r\n\r\nYou can still use this mod as it has been reported to be far less buggy than this other one and in Roman Era conversion mod I hardly change anything about the Romans so it\\'s the same thing either way.\r\n\r\n\r\n\r\n\r\n*17March2013\r\nI decided to go ahead and release the changes made by the co-modders so far. No bug fixes yet either, sorry.\r\n\r\n- Added an optional replacer version from SPQRLegate\\'s & JedJTL\\'s team that replaces Penitus Oculatus armor with their Praetorian version (needs his optional textures)\r\n- Added updated texture from AngryEw0k for the white tunic segmentata (the one that currently replaces Pentius Oculatus armor).\r\n- Added AngryEw0k\\'s retexture of the scutum, representing (if I\\'m not mistaken) a 200+ AD find from  the Eastern borders. The new shield can be crafted/tempered.\r\n\r\nFor various personal reasons my own planned additions to the mod are extremely slow going and I can\\'t tell when they will be done. Hardly any progress in several weeks; I should be fired...lol\r\n\r\n\r\n*3March2013\r\nI just heard that \\\"Great Battles of Rome: Gaul\\\" mod is probably not going through, which is sort of what I expected with such a big undertaking. If that is indeed true (still checking), then what I am going to do is put the armor mods I am making together and see where we can go from there. I am thinking I could add small things like Roman coinage and maybe a few symbols here and there.\r\n\r\n\r\n* Please note that I no longer have the time to answer questions or do requests (not that I did much before). \r\nI kindly ask more experienced users to check the forum and help out those with problems.\r\nBecause I don\\'t have much time for modding I decided to concentrate the little time I have on making Celto-Germanic armor.\r\nIf you detect a bug and you are capable of fixing it, please feel free to do so and send me the updated files and I can add them, with credit to you.\r\n\r\n\r\n*2 January 2013 - Status update and plans for the next versions. \r\nI don\\'t have much time anymore to finalise this mod, but will try asap to do the following:\r\n1. Improve female armor compatibility for all the armours. 80% done\r\n2. Distortion, clipping, texture and other fixes as much as I can (about 70% done)\r\n3. Add collision to the shields, if I can. Currently using existing vanilla collision meshes. \r\n4. Centurion armor needs to still get a few additions\r\n5. Finish the braccae (pants) for the light armor. 60% done\r\nIn the far far future I may add signifier\\'s animal skin and various optional versions, but this is not a priority.\r\n\r\nAs the above states, this is not a finished mod. It is continuously in progress as I become more skillful with modding and texturing and try to fix all the little problems. So effectively I am learning modelling through doing this mod, so it will always be a little messed up. Unfortunately I have less and less time to work on it.\r\n\r\n\r\n[img] https://lh3.googleusercontent.com/-2DrwNjMWH54/UB3Atpk23gI/AAAAAAAAAOg/4FJ-9rI4B88/s605/Contents.png [/img]\r\n\r\nThis mod contains mostly the cliche versions of the armor and weapons from the early to high Imperial period of the Roman era. They are not 100% historically accurate because of my own skill limitations, game\\'s limitations and because there is much debate and uncertainty about what \\\"historically accurate\\\" exactly is. This is what the mod contains:\r\n- 2 types of gladius or spanish sword; \r\n- 2 types of Spatha or longsword/cavalry sword\r\n- 2 daggers - one Roman (pugio) and one Celto-Roman\r\n- a deco \\\"fake\\\" version of the pugio dagger to be worn on the right side.\r\n- 3 types of shields - light (parma) medium light (cetratus) and one heavy (scutum). The cetratus shield comes in red and blue. \r\nThe Scutum mesh comes in two versions. \\'V2\\\" is the one with the standard Skyrim handle that looks better when used by player in 1st person view.\r\nScutumalso has a Dura-Europos style retextured version.\r\n- lorica laminata/segmentata set - a heavy segmented armor set, including several types of helmets (galea), two types of boots, separate left and right arm protection (manica)\r\n- lorica hamata set - a light chainmail armor set\r\n- lorica musculata set - a heavy armor officer\\'s set \r\n- Arcani armor set - a light armor spy outfit\r\n- Centurion armor set - a light armor set\r\n- a cape to serve as a sort of sagum for now (three types, one for light armor, one for heavy armor and one for Arcani)\r\n- 2 legionary rings (jewelry)\r\n- 3 types of javelins - they are currently quite overpowered, just the way I like it.\r\n- a Roman standard that summons a couple of imperial ghosts from the legion\r\n\r\n- Extra retextured items by JedJTL and SPQRLegate can be downloaded as the optional file.\r\n- Andouce created a number of esp versions for better compatability with SkyRe, Immersive Patrols and Battles and Wet & Cold. They can be found in the optional files. To be used instead of  the REPLACER version of my mod. Please note that they may be missing one or two updates because they were based from an older verison.\r\n\r\n\r\nThe armour is quite racist and sexist unfortunately, in the sense that it is meant for human males.  What that means is that the female versions of the armour are backwards compatible - some pieces are still being worked on, some pieces are missing, and everything is just of poorer quality than their male counterparts. I\\'m sorry, but spending time on the female armour knowing that there were no (or very few) Roman female soldiers makes it a 2nd priority for me.\r\n\r\nSmall video by AngryEw0k\r\n[youtube]RL1ZO68vOSI[/youtube]\r\n\r\n[img]https://lh3.googleusercontent.com/-dBHsr0WiWqE/UB3AqNy-cCI/AAAAAAAAAOQ/Zd3s5Owleow/s605/mod+installation.png [/img]\r\n\r\nOnce you download the mod, the archive file contains 2 esp files:\r\n\r\n          I. Roman Armor and Weapons esp: This is a standalone mod that adds all the armour sets and weapons into a room located in the imperial quarters in Solitude (look in the back room behind general Tullius) and some items are also sold by the Solitude blacksmith.\r\n\r\n          II. Roman Armor and Weapons Replacer esp: replaces the vanilla imperial armors with the ones from No. I. DO BEWARE that any mods that modify leveled lists may interfere with my mod. Also some effects will only take place after Skyrim resets its cells (a month in game?). \r\n\r\n[Color=red] You can use either of these esp files [/color]. They are designed to work independently from each other. Both esps contan mostly the same types of craftable armor and weapons, but there are slight differences, like the replacer version doesn\\'t contain the javelins. This does mean if you have both esps enabled, most of the armors will appear twice in the list of craftable items.\r\n\r\n[b]To install the mod[/b], copy the contents of the data folder inside the zip file into the data folder in your Skyrim directory. Click yes if Windows asks you whether you want to merge folders (my files do not replace any of the game\\'s original files). Then, on the game\\'s startup screen click \\\"data files\\\" and click the checkboxes next to the mod names. Should be relatively simple.\r\n\r\n\r\n[img]https://lh3.googleusercontent.com/-wT0Ah2AxwYc/UB3AwBYA0HI/AAAAAAAAAOo/tidAtGCk5zE/s605/bugs+and+other+issues.png [/img]\r\n\r\n [color=red] [b]PLEASE READ THIS BEFORE REPORTING IN COMMENTS[/b] [/color]\r\n=======================================================================================\r\nThis mod still contains many little \\\"bugs\\\" at the moment. The more content I add, the more bugs. This outlines some of the major issues you may see:\r\n\r\ni.  There are still some clipping issues during animations, especially on the female character - I hope not as noticeable though. For the record it is not the mesh itself, but rather the animation.\r\n\r\nii. Currently there is LIMITED SUPPORT and no plans for adding full support for special races (no offense) like Khajits, so the armour may look weird/broken on them or may not work - I don\\'t know as haven\\'t tested this and don\\'t really care to. \r\n\r\niii. There is support for the females, but it is not full yet.\r\n \r\niv. There are distortions in texture during animations, especially on the chainmail - it is more obvious on other NPCs. I have been trying to fix it for a while now and will continue to do so, but even vanilla armors get distorted. I cannot do much about the stretching in the areas of the skirt, like the pteruges (leather strips) on the officer\\'s armour.\r\n\r\nv. left hand manica doesn\\'t show up in 1st person view (possibly a hardcoded bug)\r\n\r\nvi. Female heavy gauntlets are all messed up at the moment\r\n\r\nvii. The back of the helmet is a bit too narrow and clips through long hair.\r\n\r\nviii. Something\\'s wrong with Tullius\\' gauntlets so I removed them (they should disappear the next time the game updates its cells).\r\n\r\nix. Please note that if you have both esps enabled then the items will appear in the list of craftable items twice - that is not a bug.\r\n\r\nx. When wearing centurion hamata first person upper part of your arm after the gauntlets is invisible . \r\n\r\nxi. For one of the heavy caligae types the slider doesn\\'t work. I don\\'t know why or how to fix it.\r\n\r\n=============================\r\nTroubleshooting\r\n=============================\r\n\r\n1. [color=red]IMPORTANT NOTE TO ALL: to see all of the changes in the replacer version of my mod , Skyrim first needs to reset/respawn the characters it already spawned, so that means the old ones need to die first (or respawn otherwise). Use the \\\"set timescale to 100000\\\" command to skip time and/or wait and after a while new armors should start spawning [b]AND[/b] make sure that the replacer esp file is lowest on your list of mods (that modify leveled lists of items)[/color]\r\n\r\n2. Make sure your version of the game is updated with the latest patch or the game might crash when running the mod.\r\n\r\n3. Move your mod down to the bottom of your list of mods.\r\n\r\n4. If none of the above works, pour lighter fluid over hair, set it on fire and then run in circles with a 5 meter radius while screaming in panic but also send me a message, although I can\\'t promise I\\'ll be able to help.\r\n\r\n[img] https://lh6.googleusercontent.com/-PHhQrHPw7Gc/UB3AyCa5KLI/AAAAAAAAAOw/Ut_btkTa_0U/s605/conflicts.png [/img]\r\n\r\nAny any mod that replaces the imperial armor or weapons will have a problem with the replacer version of my mod. You can still use the standalone esp in that case.\r\n\r\nMods that modify inventory lists may have a problem with the replacer version of my mod (because they may tell the imperial soldiers to wear something else than what my mod tells them to wear).\r\n\r\nThere seems to be a problem with the Civil War mod and the replacer esp of my mod:\r\n1. Fast traveling to a civil war zone sometimes causes a crash/freeze. \r\n2. My game will freeze in the midst of a busy battle sometimes. I think it might be all those high res textures and polys that push the PC too far. I tried cleaning my mod but to no result. On a new computer I had recently bought the game has not crashed so far\r\n\r\n[img] https://lh4.googleusercontent.com/-s-0hBlWDZ3I/UB3A14BypSI/AAAAAAAAAPA/GUP1sLIvQjk/s605/credits.png [/img]\r\n\r\nThanks to \r\n- Andouce for optional compatibility files\r\n- JedJTL and SPQRLegatecan for additional retextures\r\n- AngryEw0k for one of the banners,d Hadrian Wall expansion textures and the scutum retexture\r\n- all who helped me with some of the issues I have been having.\r\n- somuchmonsters for the excellent tutorials\r\n- SeptusTiberius for the red version of the Cetratus shield texture.\r\n- Lord_Kosmos for fixing my Scutum shield texture\r\n- 747823, represented by his successor, for letting me use one of the cubemaps\r\n- My girlfriend for providing me a base texture and mesh for the rope. She also mods [b][url=http://www.ohbehave007.blogspot.com]http://www.ohbehave007.blogspot.com[/url][/b]\r\n- AND THANKS TO MADRILOUS FOR LETTING ME USE HIS THROWING WEAPONS MOD and assisting me with making the javelins work. I picked his mod because out of all the throwing mods I have seen, his seems to be the most thorough and best for javelins.[b][url=http://skyrim.nexusmods.com/downloads/file.php?id=14176]http://skyrim.nexusmods.com/downloads/file.php?id=14176[/url][/b]\r\n\r\n\r\n[img]https://lh5.googleusercontent.com/-G71eTD4_jp0/UB2_3pAMbvI/AAAAAAAAAM8/G2xOTCoWebY/s605/on+historical+accuracy.png[/img]\r\n\r\nAmost all the items I made have some sort of historical source to them. A movie by the way does not constitute a historical source (grrr).\r\n\r\nIf you\\'re interested to know a little more about my research please follow this link:\r\n[url=http://www.romanarmytalk.com/rat/14-gaming-a-modelling/320065-roman-weapons-and-armour-mod-for-skyrim.html#323798]http://www.romanarmytalk.com/rat/14-gaming-a-modelling/320065-roman-weapons-and-armour-mod-for-skyrim.html#323798[/url]\r\nIf you want to see images you have to have an account there.\r\n\r\n\r\n[img] https://lh6.googleusercontent.com/-xWb_FBRruR4/UB3A0LtFwhI/AAAAAAAAAO4/0JzE2mky_eI/s605/other+info.png [/img]\r\n\r\n=============================\r\nChange history:\r\n=============================\r\n\r\nThe history of previous changes can be found in the readme included with the file.\r\n\r\n\r\n=============================\r\nRecommended mods\r\n=============================\r\n\r\n- Warzones: [url=http://skyrim.nexusmods.com/mods/9494]http://skyrim.nexusmods.com/mods/9494[/url]\r\n- Immersive patrols: [url=http://skyrim.nexusmods.com/mods/12977]http://skyrim.nexusmods.com/mods/12977[/url]\r\nThere are unfortunately no great battles in Skyrim where thousands of soldiers can march forward under volleys of arrows and stones to the glorious slaughter, but Warzones and Immerive patrols together turn the whole SKyrim into a semi-battlefield.\r\n- Mods from my [url=http://forums.nexusmods.com/index.php?/topic/610587-wip-imperial-affairs/page__p__4849359__fromsearch__1#entry4849359]Imperial Affairs[/url] series, which are slowly going to try and turn Skyrim\\'s forces into Roman-era armies. Look, it\\' not much, but it\\' all you got from what I\\'ve seen on Nexus so far.\r\n- this banner mod [url=http://skyrim.nexusmods.com/mods/32833] http://skyrim.nexusmods.com/mods/32833 [/url]\r\n\r\n=============================\r\nPerformance impact\r\n=============================\r\n\r\nI recently got a new machine so I don\\'t care much about computer specs anymore (Muwahahahah...awkward evil laugh). Most of my textures are 1024x. Some are 2048x and some are 512x, and I tried to not go overboard with the number of polys for my meshes. They are about the same amount of polys as some of the vanilla Skyrim meshes (which do differ considerably from armor to armor by the way). Yes, I could make my armor and weapons even prettier if I increased resolution and polycount even further or more optimized if reduced everything, but I think I have reached a balance.\r\n\r\n=============================\r\nLegal\r\n=============================\r\n\r\nSince I am putting a lot of effort into this and my favorite sin is pride, you can use the mod and its contents for any non-commercial purposes, BUT please ask for permission first and please give due credit - it\\'s the usual honor system.\r\n\r\n[Center][img] https://lh3.googleusercontent.com/-7oRwhu1aLEs/UMNYNq5627I/AAAAAAAAAY0/qvdTHl3tdp0/s717/Untitled-3.png [/img][/center]",
  "categoryId": "36",
  "version": "1.9.9",
  "author": "Jedo Dre and the team",
  "createdUnix": "1329862041",
  "updatedUnix": "1363727472",
  "containsAdultContent": false,
  "uploadedBy": "Jedo_Dre",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000010413",
      "name": "Optional esp files by Andouce",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "168",
      "fileName": "Optional esp files from Andouce-10740-1-0.rar",
      "uploadedUnix": "1361058766",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d9b14d6a3b9e1b0574daff951d8d9ccc2650e8bb239b3d23ba0595b132f45d9a/analysis/1407421327/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Optional%20esp%20files%20from%20Andouce-10740-1-0.rar?fid=1000010413&ttl=1535771332&ri=8192&rs=8192&setec=4d24e805e68c640165b05918d37032e4"
    },
    {
      "fileId": "1000011260",
      "name": "Roman Imperial Armor and Weapons 197",
      "version": "1.9.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "125389",
      "fileName": "Roman Imperial Armor and Weapons-10740-1-9-7.zip",
      "uploadedUnix": "1361299679",
      "modVersion": "1.9.7",
      "virusScanUrl": "https://www.virustotal.com/file/b6924c968873588e986b063d14851fc9e096520dd116d383b64f5d65e43393c9/analysis/1407427570/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Roman%20Imperial%20Armor%20and%20Weapons-10740-1-9-7.zip?fid=1000011260&ttl=1535771332&ri=8192&rs=8192&setec=db27caf72fa43084f1831db51f456a38"
    },
    {
      "fileId": "1000014573",
      "name": "Additional retextures by JedJTL and SPQRLegate",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "124859",
      "fileName": "Additional retextures by JedJTL and SPQRLegate-10740-.zip",
      "uploadedUnix": "1362275301",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/bb57facf1f066d6bec2915276b44c54e9b047f8cf1ef9be9f1cbb1e45f4a68f8/analysis/1407449239/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Additional%20retextures%20by%20JedJTL%20and%20SPQRLegate-10740-.zip?fid=1000014573&ttl=1535771333&ri=8192&rs=8192&setec=ee81675a84c49d1f5317b0661c732242"
    },
    {
      "fileId": "1000014574",
      "name": "Roman Imperial Armor and Weapons 198",
      "version": "1.9.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "138545",
      "fileName": "Roman Imperial Armor and Weapons-10740-1-9-8.zip",
      "uploadedUnix": "1362275544",
      "modVersion": "1.9.8",
      "virusScanUrl": "https://www.virustotal.com/file/d4f5e84727eacf0b35eff39f6d9a14c15519db8392f092dbd608aa8ee1f4ca13/analysis/1407449273/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Roman%20Imperial%20Armor%20and%20Weapons-10740-1-9-8.zip?fid=1000014574&ttl=1535771334&ri=8192&rs=8192&setec=0d4ea9a0f11e0b7c16ccbcfb6fc23521"
    },
    {
      "fileId": "1000018769",
      "name": "Roman Imperial Armor and Weapons",
      "version": "1.9.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "140742",
      "fileName": "Roman Imperial Armor and Weapons-10740-1-9-9.zip",
      "uploadedUnix": "1363727472",
      "modVersion": "1.9.9",
      "virusScanUrl": "https://www.virustotal.com/file/f293083fb1ddd05386631069ac3a40c21948985e320906ea0f26a0fe4fa3a463/analysis/1407477831/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Roman%20Imperial%20Armor%20and%20Weapons-10740-1-9-9.zip?fid=1000018769&ttl=1535771334&ri=8192&rs=8192&setec=a5b151a0545f38f61f430447b97de2ee"
    }
  ]
}