{
  "modId": 10748.0,
  "modName": "Animated Prostitution - Skyrim - WIP",
  "summary": "Animated Prostitution: &#34;sexy time&#34; with NPCs plus more ;)",
  "descriptionHtml": "-THE DETAILS-\r<br />\r<br />This mod allows you to have sex with NPCs.\r<br /> \r<br />To use it, talk to your marriage partner (default key &#34;E&#34;). To use this with other NPCs, you must equip an item with the enchantment &#34;Sexually Active&#34; . The animations play for 60 seconds on a timer.\r<br />\r<br />Each NPC has a cooldown time of 1 ingame hour. You the player can boink as much as you wish, but NPCs can&#39;t. (Poor NPCs just don&#39;t have the endurance of the Dragonborn&#33;)\r<br />\r<br />An AP Amulet of Dibella will be added and equipped once you start a game with this mod enabled. If you lose it or upgrade with out resetting, you can make on at a forge under the jewelry category.\r<br />\r<br />Before starting to use the mod, make sure to visit the option menus first so that the settings can be tweaked to your satisfaction.\r<br />\r<br />-Mod highlights-\r<br />[List]\r<br />[*] You can have sex with almost all friendly NPCs.\r<br />[*] You can let male NPCs have sex with your companion.\r<br />[*] You can make almost any friendly NPC a companion.\r<br />[*] You can pimp yourself on automatic mode for coinage. (Female players only ATM.)\r<br />[*] You get Speechcraft experience for talking NPCs into it.\r<br />[*] Has built-in strap-on to enable females to use male AP animations.\r<br />[*] Can be used in either full bore or covert modes.\r<br />[*] Has its own behavior files, allowing it to be run out of the box.\r<br />[*] Can be made compatible with fore&#39;s work.\r<br />[/List]\r<br />\r<br />[color=lightblue]Comment Posting:[/color]\r<br />[color=red]KEEP THE COMMENTS POSTED ON THE FALLOUT NEXUS CLEAN.[/color]\r<br />Other comments can be posted to me at:\r<br />JoshNZ666@hotmail.com\r<br />If this mod gets locked (AP has already had a 3 week ban because of bad comments) again because of rude comments I&#39;ll delete it myself and save the moderators some work\r<br />\r<br />Please do not report comments as the moderators already go through my page at least once a week, save them some work, please.\r<br />\r<br />[color=lightblue]The Limit:[/color]\r<br />Here&#39;s my limit. Most things are below the limit, and can be dealt with.\r<br />These things are OVER THE LIMIT, and will NOT be done under ANY circumstances.\r<br />\r<br />[color=red]CHILDREN ARE A NO NO&#33; DON&#39;T ASK&#33;, NOT EVER, EVER, NEVER&#33;&#33;&#33;.[/color]\r<br />\r<br />Dogs/Critters - To much work for not enough fun. I have to test man on man as it is...even though I&#39;m a heterosexual male. So, I&#39;m not getting involved with bestiality.\r<br />\r<br />Rape - Player Rape/Player Raping. --- Nope, not happening. Nexus rule&#39;s. You sick Puppy.\r<br />[color=orange]Please DO NOT ask for any of the above because I will not indulge you...and you run the risk of getting your account banned&#33;[/color]\r<br />\r<br />If you have to exceed the limit, once again:\r<br />JoshNZ666@hotmail.com\r<br />\r<br />Also note that the above is MY limit. The moderators on the nexus have their own, which might not be set as high as mine.\r<br />But their limit is MORE important than mine. So respect it.\r<br />[color=red]THE MODEARATORS WORD IS LAW AND I AM ON THEIR SIDE.[/color]\r<br />If any moderator asks me too, I&#39;ll update my limits.\r<br />\r<br />-Note about requirements-\r<br /> You must have Skyrim Patch 1.9 or above. (The CK was updated in V1.9 and I don&#39;t know if mods made with V1.9 CK will run on anything lower.)\r<br />\r<br />-Note about recomended complemtery mods-\r<br />\r<br />[url=http://skse.silverlock.org/]SKSE[/url] &lt;- Lets me use more comands. Use this.\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=3863]Sky UI[/url] &lt;- Better menus.\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=36213]HDT HighHeels System[/url] &lt;- Fix&#39;s the hight on some anims if you are useing a custom Skelly.\r<br />\r<br />-Note about other people&#39;s work-\r<br />I have tried hard over the years to only use my own work in AP.  But with my reduced developer time, I have had to use...\r<br />masty animation: [url=http://skyrim.nexusmods.com/downloads/file.php?id=8714]Adult Show XXX - ASX[/url], because, lets face it...  He&#39;s a better animator than me.\r<br />Strap on: [url=http://skyrim.nexusmods.com/downloads/file.php?id=13362]StrapOn - CBBEv3[/url]. \r<br />\r<br />-Note about getting naked-\r<br /> Just to be clear, AP is NOT a bodies mod. It will NOT change anything about how you look.\r<br /> To get naked you will need 3rd party body changing mods.\r<br /> \r<br />I recommend:\r<br />For females:\r<br />Install first...\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=4888]CHSBHC - BBP - Nude and Jiggly Mod by CherryHotaling[/url] the female body. (All animations in AP Skyrim are BBP enabled, but BBP is not necessary.)\r<br />Install next...\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=13180]CBBEv3M Body Replacer[/url]\r<br />Then...\r<br />Run BodySlide and make your self a nice looking never nude. Just keep the arse small to match the AP Strap-on.\r<br />Last...\r<br />In game, pick the females strip to nude option.\r<br /> \r<br />For Males:\r<br />Install first...\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=2488]Better males - Beautiful nudes and faces - New hairstyles by Chris57 and FavoredSoul [/url] for the male body. (I pick the one with boner.)\r<br />Then...\r<br />Delete the .nif files you just intalled but leve the textures(They look 100% on the defult body).\r<br />Last...\r<br />In game, pick the males strip to nude option.\r<br />\r<br />(This is just MY way of setting up the bodies. Feel free to pick your own.)\r<br />\r<br />-Note about included nude bodies-\r<br />AP has a set of naked bodies that come with it for the male nude body setting.\r<br />The male body is from the erect &#34;Better Males&#34;.\r<br />The female body is a body slide &#34;CBBE&#34;.\r<br />\r<br />These are just placeholders and it is recommended that you replace them with a body of your own choosing.\r<br />\r<br />-Note about spells-\r<br />AP spells will be added when you equip an AP Amulet of Dibella or a piece of equipment enchanted with the AP-exclusive enchantment &#34;Sexually Active&#34;. They will be removed when you unequip the AP Amulet of Dibella or the enchanted item.\r<br />\r<br />Equipping the amulet grants your character several new abilities:\r<br />&#34;AP Options&#34; -- toggles the options menu.  Binds to the shout/powers button. (Default Z.)\r<br />&#34;AP Enjoy Yourself&#34; -- allows a female Dragonborn to have a little fun.  Binds to the shout/powers button.  Exclusive to women.\r<br />&#34;AP Player Slut Spell&#34; -- brings up the menu for prostitution options. Also enables you to begin working. Binds to the shout/powers button. Exclusive to women, for now.\r<br />&#34;AP Show Me&#34; -- strips the targeted NPC for a time. Works on both men and women. Binds to the action buttons, and takes up one hand. (Default left/right mouse button.)\r<br />&#34;AP Uncontrolled Urges&#34; -- makes the targeted woman strip nude and have some fun. Binds to the action buttons, and takes up one hand.\r<br />\r<br />Special note:   The auto pimp yourself spell (female only ATM) can be ended by drawing your weapons, or re-casting the spell.\r<br />\r<br />-Note about strap-on-\r<br />AP has optional strap-ons that can be forged under the leather category. To use it, just be female and have it in your inventory when you talk to an NPC, no need to equip it.\r<br />To get a female NPC to use it, add it to their inventory. How you *cough* give it to them is up to you.  \r<br />If you have strap-ons from another mod that you like better than the AP one, you can just copy over the files or pick the option &#34;Strap On Override&#34;.\r<br />\r<br />-Making an NPC into a follower-\r<br />Just sleep with them FOR FREE enough times. Each free time raises their relationship rank one rank. At rank 4, they can be asked to follow you as a companion. This is accessed through the new &#34;Come with me&#34; dialogue upon reaching rank 4.\r<br />You can make almost any friendly NPC into a follower, even ones that would normally never be recruitable. However, AP followers may only have basic commands; others have the full range of commands, and this is pre-determined by their voice type. You can interact with AP-made companions through the &#34;Let&#39;s talk&#34; dialogue. \r<br />\r<br />-Making an NPC into a follower: male players-\r<br />I knew that housecarls were good for something. Even with the option &#34;Dragonborn Can&#39;t Be Gay&#34;, you can still give away your follower. Guys like that kind of thing... \r<br />\r<br />-Making an NPC into a follower -- Modded NPCs-\r<br />If you have other mods that change the properties of followers or add new options when you talk to them, these fields will also show up on followers made through AP. For example, with the mod [url=http://skyrim.nexusmods.com/mods/18045]My Home is Your Home[/url], you can invite your new friends to stay at one of your houses. Be aware, however, that followers earned through AP may not have the full range of function and may not respond correctly to these new, modded commands.\r<br />\r<br />-Using the bed sex options-\r<br />Take your date to a bed. Either use Let&#39;s Talk -&gt; Can you do something -&gt; Bed, Or click (E) on the bed and pick one of the menus.\r<br />If you are female you have the option to self pleasure.\r<br />\r<br />-Fixes and better functionality for AP followers-\r<br />So, you&#39;ve made an unusual follower via AP, one that the game doesn&#39;t normally allow.  If you try them in combat, though, there is a good chance that they will be very fragile and weak.  How do you fix it?  The answer is console commands and/or mods.\r<br />[list]\r<br />[*]To level up the new follower to your level, open the console command menu with the tilde key (~).  Click on them to target them, then input this code without the quotation marks: &#34;[i]setlevel 1000,0,1,81[/i]&#34;.\r<br />[*]Followers in general tend to be killed easily.  Want to make your new follower effectively immortal by making them [url=http://elderscrolls.wikia.com/wiki/Essential_Characters]essential[/url]?  There is a method to do it with [url=http://elderscrolls.wikia.com/wiki/Console_Commands_%28Skyrim%29#setessential_.3Cbase_id.3E_0.2C_setessential_.3Cbase_id.3E_1]console codes[/url], but the simplest way is to try the mod [url=http://skyrim.nexusmods.com/mods/14037]UFO - Ultimate Follower Overhaul[/url], which lets you set followers as essential and much more. \r<br />[*] Given the NPC you want plenty of favors, but they&#39;re not willing to go with you?  Open the console, target them, and input this code without quotation marks: &#34;[i]player.setrelationshiprank player 4[/i]&#34;.  That should solve it.\r<br />[*] And of course, BE CAREFUL with who you make a follower.  If they are a vendor, it can disrupt their selection of goods.  If their behavior is heavily scripted, it might break.  If they are involved in quests, things can get messy.[/List]\r<br />\r<br />\r<br />-Pimping your follower-\r<br />You can pimp your follower to male NPCs with no speech check. Giving them away for free will make the NPC like you. If you have 50+ Speech, you can try to get 25g for them. Your follower isn&#39;t anywhere near as hot as the Dragonborn, so don&#39;t expect to make to much coin.\r<br />\r<br />-Note about bugs-\r<br />As it stands, AP is 90% bug free (the listed known ones don&#39;t count). As you may or may not know my APs  ?- OB through NV were all buggy as duck, but I worked them out as I went, fixing yesterdays bugs while making today&#39;s.\r<br />Skyrim will not be the same as my former mods. As I don&#39;t have the developer time I used to (F3 took 4 months of 16 hour days, with a post at the end of each day), each release will take much longer. The end result will hopefully be more stable, though.\r<br />\r<br />-Note #1: Getting AP installed and working- simple \r<br />The easiest way to get AP is through the Nexus Mod Manager.  Give it a try if you haven&#39;t already&#33;\r<br />You will need to activate AP Skyrim.esm to get dialogue working. (Keep in mind that it&#39;s very difficult to get mods working on cracked copies of skyrim: your best bet is to buy a legit copy of Skyrim if you are using a cracked version.)\r<br />Before you activate AP, I HIGHLY recommend that you make a new save and leave it alone. All saves after should go into a new slot. Remember, people, Skyrim breaks at the drop of a hat and ANY mod can kill a save. You have been warned. This goes for ANY mod.  (Damn it, people, you can kill a save just by forgetting to hit auto-fill on a property&#33;)\r<br />\r<br />-Note #2 about AP installed and working - Upgrading from previous versions.\r<br />Best and and safest bet:\r<br />[List]\r<br />[*] Install into a save that has never had AP installed\r<br />[/list]\r<br />\r<br />Next best and and safest bet:\r<br />[List]\r<br />[*] V2.1 and higher -&gt; Run game -&gt; Cast AP options -&gt; Select Kill AP -&gt; Remove anulet -&gt;Save\r<br />[*] Use NMM to uninstall AP &lt;- So you don&#39;t have outdated files\r<br />[*] Load game &lt;- Cleans game save\r<br />[*] Save &lt;- So it stays that way\r<br />[*] Quit game \r<br />[*] Use NMM to install AP\r<br />[*] Make sure AP is checked\r<br />[*] Load game\r<br />[*] Make an auto-save\r<br />[*] Load the auto save you just made from in-game(Don&#39;t quit). &lt;- Dont know why. It fixes the Game.GetPlayer() script I think\r<br />[*] Save &lt;- So it stays that way\r<br />[*] Enjoy\r<br />[/List]\r<br />\r<br />-Note #3 about getting AP installed and working ? Asking me\r<br /> I WILL NOT ANSWER QUESTIONS ABOUT HOW TO INSTALL AP. There is an entry in the discussions page. Try there.\r<br />\r<br />-Note about posting a vid-\r<br />No. Nexus pollicy says no and I fully suport there idear. I will not be posting or linking in any vidios of AP in action.\r<br />Utube and other people have no such constrant.\r<br />\r<br />-Note #1 about role playing-\r<br />I have mostly released AP as a &#34;Here, this is how to do it&#34; mod in the hope that other modders can expand on it. If there is anyone out there that wishes to make this more quest/role play-oriented, DO IT with my blessing. I&#39;ll use yours, as I have never liked the &#34;Over-the-Top-Sex-with-Everyone&#34; AP style any more than you do. I have even made an AP.esm so you can make a &#34;Love&#34; mod without having to re-make all the work that went into AP.\r<br />\r<br />-Note #2 about role playing-\r<br />On a whim, I have made it so you will need to equip an AP Amulet of Dibella to have sex with anyone other than your spouse. This is for role play purposes and so you can&#39;t enter dialogue with NPCs you should not be able to.  In addition to that, you can bribe the guards for crimes less than 500g.\r<br />\r<br />-Note about making translations-\r<br />Go right ahead. No problems here matey. But it would be nice for you to send me a link and post it on the Nexus. Also, people, if you are doing a translation you should try do the voices. I will not blame you if you don&#39;t. (I have not...)\r<br />I will list them here...\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=22799]Animated Prostitution - Animierte Prostitution - deutsch[/url] \r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=22312]Animated Prostitution - SPANISH[/url] \r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=29641]Animated Prostitution - Russian[/url] \r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=25833]Animated Prostitution translation into Spanish[/url]  ?? Why 2? oh well ant my work\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=16223]Animated Prostitution_Traduzione Italiana[/url] \r<br />\r<br />-Note about voice acting-\r<br />I have done the voices on the (male) NPCs. If you dont like the sound of my voice, just replace it.\r<br />I have even typed out a how to in the articals. Really people. NOT HARD.\r<br />Just a thought... If you are female, Live in New Zealand and are keen to do the female voices... My e-mail is in this description.\r<br />\r<br /> -Note about idles replaced-\r<br />NONE... Ma ha ha, Skyrim animations ARE possible, just HARD to get working. AP now uses [url=http://skyrim.nexusmods.com/downloads/file.php?id=15906]Josh&#39;s Skyrim Behavior File Patcher [/url]  as its animation system.\r<br />\r<br />AP has its own behavior files because FORE would not let me ship his and I needed AP to run out of the box. However, you can get both AP and fore&#39;s to work side by side.\r<br />\r<br />So just to labor a point...\r<br />Each patch of Skyrim has its own behavior files. Each update will need a new hacked set to enable animations for mods. If you have higher,then you WILL NEED to re-patch your behavior files or the new content will not work. This is the same for my program or fore&#39;s.\r<br />\r<br />Now, fore&#39;s program seems to have version specific behavior files included (0_Master.hkx) but 0_Master is mostly about what other BF to load and should be pretty safe from upgrades.\r<br />\r<br />My program &#34;should&#34; be able to patch ANY set of behavior files. It works on all the vanilla ones (tested up to v1.9) and all of fore&#39;s can be patched. (Don&#39;t do this if you included my AP files when you ran his.) It &#34;should&#34; work on any damn behavior file set you throw at it.\r<br />\r<br />To use my patcher:\r<br />Download.\r<br />Run ONE time as admin.\r<br />Hit restore original. (If you have a fore-made one you will need to remove 0_master.hkx manually as my program was made and posted before fore&#39;s so I did not know.)\r<br />Hit-&gt; Get form update.bsa\r<br />\r<br />-Note about getting AP compatible with fore&#39;s-\r<br />I have included a fore style patch list in the main AP download. I could ship an AP/fore compatible BF, but I am not allowed to: sorry for the inconvenience. Still, if AP is the first animation mod you downloaded (it is for a lot of people) it will go with no other download needed. If you are a fore-dedicated mod lover, you already know that you needed to run his patcher on mod install anyway. You&#39;ll just need to delete some files first with AP.\r<br />\r<br />So it&#39;s easy now to get AP 100% compatible with other animation mods.\r<br />\r<br />[List]\r<br />[*] Delete &#34;datameshesactorscharacterbehaviorsmt_behavior.hkx&#34;\r<br />[*] Delete &#34;datameshesactorscharactercharactersdefaultmale.hkx&#34; &lt;- Not really needed, just to be safe\r<br />[*] Delete &#34;datameshesactorscharactercharacters femaledefaultfemale.hkx&#34; &lt;- Not really needed, just to be safe\r<br />[*] Run fore&#39;s ForUsers Program\r<br />[*] Enjoy\r<br />[/List]\r<br />\r<br />Actually, ATM it&#39;s better to use fore&#39;s than mine. I need to work on my patcher a bit. ATM, mine and fore&#39;s are about the same but his uses instant transition and mine uses 0.5 sec blend. In short, the twitches look/work better with his until I update my patch files. This is the next thing on the AP dev list. Once it&#39;s done, the animation results will be unbeatable.  \r<br />\r<br />-Note about my old race swap animation system-\r<br />My old system works by &#34;hot swapping&#34; the player/NPC race to a temporary race (one for each default race) and replacing that race&#39;s animations. All vanilla animations still work, but I can play my &#34;new animations&#34; when needed.\r<br /> \r<br />:Known bugs. (Being fixed when possible.)\r<br /> \r<br />:All\r<br />As a rule you should always activate mods after you have finished character creation.\r<br />AP breaks the starting experience. I don&#39;t know why, because I didn&#39;t do anything to it. It might be a good idea to use an alternate start-up mod, such as [url=http://skyrim.nexusmods.com/mods/9557]Alternate Start - Live Another Life[/url].\r<br />Also: Over the years I have made AP, there has been some really weird stuff reported. Everything&#39;s been reported, from flying raiders to CTDs to being unable to open windows&#33; Some weird stuff happens. If you have an up-the-duck copy I recommend re-downloading and trying again on a fresh save.\r<br />\r<br />\r<br />:Behavior file system (New)\r<br />Sometimes an idle will get interrupted, making it look weird.\r<br />To line up the animations, I had to scale NPC/player to a height of one. There is a BethSoft bug with GetScale/SetScale. Rarely, NPCs will not return to the right height.  This seems to affect about 1/50 NPCs.\r<br />Sometimes the timer will break, making you stuck in the animation.  Be ready with back-up quick saves to prevent getting stuck.\r<br />Non-Bethsoft followers will only wait with the &#34;do something for me&#34; dialogue.\r<br />\r<br />:Appendix A (SetRace hair bug) -- Now obsolete, new versions no longer have this issue.\r<br />\r<br />When a script calls SetRace, the player&#39;s/NPCs hair changes to the default for that race. This is a problem on Bethesda&#39;s end, and I have been asking them to fix it since OB. Give it a try: who knows, if 10k people ask, it might happen in a future patch? Until then, SetRace is the ONLY way to get new animations to play without replacing the old ones.\r<br />\r<br />There are two ways to fix the hair change bug that I know of.\r<br />\r<br />Fix 1\r<br />1) Extract ALL the vanilla hairstyles.\r<br />2) Find the default hair for your race, and the hair you want to use. (NifScope might help.)\r<br />3) Change the file names. \r<br />4) Load the game and use ShowRaceMenu to set your hair to default.\r<br />Now sex won&#39;t change your hair.\r<br />\r<br />Fix 2\r<br />1) Open AP in the editor.\r<br />2) Change the default hair of the race (e.g aaSexImperialRace01,aaSexImperialRace02) that you are to the hair you use.\r<br />3) Save AP.\r<br />Now sex won&#39;t change your hair.\r<br />\r<br />:Appendix B (AP not working checklist)\r<br />\r<br />- No dialogue. \r<br />[List]\r<br />[*] Check you have the amulet on.\r<br />[*] Check AP.esp is enabled.\r<br />[*] Check AP.esp is at the bottom of your load list.\r<br />[*] I have the spells but no dialogue options... Push T. Wait one hour. Load auto save. Told you that 3 times already. (V1.6/1.7 Bug)\r<br />[/List]\r<br />If it isn&#39;t one of those, I just don&#39;t know. If you have the amulet on and AP enabled there is no way you Can&#39;t get the dialogue, so don&#39;t ask me.  \r<br />\r<br />- No animations. \r<br />[List]\r<br />[*] Sometimes the NPCs will talk and break the animation. Try again.\r<br />[*] Check that the behavior files and animations are in the right place.\r<br />[*] This AP is compatible with Skyrim patch V1.9. Is yours higher? If so, run my patcher program. (Restore original, get from update bsa.)\r<br />[*] Do you have archiveinvalidate on? You probably need it, I think. NMM will do it for you.\r<br />[/List]\r<br />Once again, if it isn&#39;t one of these, I just don&#39;t know. AP has always worked on my PCs.\r<br />\r<br />- CTD.\r<br />[List]\r<br />[*] CTD on load: Re-download. This has happened to me ( 1 or 2 times) with other mods.\r<br />[*] CTD on bringing up a menu: Your game (save) is busted. Load a save before you started getting CTD.\r<br />[/List]\r<br />\r<br />:Appendix C (Is my save broken? AP or other mods can do this...)\r<br />- Things to check for\r<br />[*] AP Menus run slow.\r<br />[*] NPCs don&#39;t stay still for sex.\r<br />[*] Sex script runs slowly (you can move after the dialogue for a few steps).\r<br />[*] You get a message box that tells you.\r<br />[*] You can&#39;t sit down or use work benches. (This is an OLD one happens if you don&#39;t reset a scene right. Hasn&#39;t happened in AP for months.)\r<br />[*] CTD when you bring up a menu.\r<br />- The way to fix it:\r<br />You can&#39;t. Just plain can&#39;t. The break is saved in your game save. The only way out is to load a save that doesn&#39;t have the break in it. I did tell you, over and over to make a safe save. (I lost a LV 72 to the bag of holding, and that mod is as safe as you can get&#33;&#33;&#33;)\r<br />- Work Around:\r<br />Get the AP Skyrim-Dev out of the zip and changed the .bsa name and the sounds name to AP Skyrim-Dev.esp (On .esp on the .bsa). This works because the break is saved in the save game under MOD name. So AP Skyrim.esm might be for ever broken for you but AP Skyrim-Dev.esp will work just like a new one. FUBAR.\r<br />\r<br />:Appendix D (How can I stop my scripts/packages/scenes from breaking?)\r<br />- Never NEVER use quick load in a sex scene. What will happen is you will break the package aaSexDoJack and all the NPCs will walk away from you in future sex.\r<br />- I have found out what breaks the scripting. And it is FUBAR. It&#39;s that each script has a run time limit on it. And guess what people? Its based on YOUR computer&#39;s CPU power. The more power your computer has, the longer each script has assigned to it for runtime. So it works just fine for me but if your computer is slower than mine (you should not be able to play Skyrim if it is but some people can handle lag better than me) then the scripts will probably break. This will be fixed. Now I know I can work around it. Joy.\r<br />\r<br />\r<br />[b]:Change log.[/b]\r<br />\r<br />V1.1\r<br />[List]\r<br />[*] Fixed the Redguard Sex Race.\r<br />[*] Removed bloated Files.\r<br />[*] Made an easy to re-use script to handle the race changes.\r<br />[/List]\r<br />\r<br />V1.2\r<br />[List]\r<br />[*] Fixed the Redguard Sex Race again.\r<br />[*] Removed more bloated files.\r<br />[*] Added 2 new animation types.\r<br />[*] Added &#34;Twitch&#34; idles to 2 of the female animations.\r<br />[/List]\r<br />\r<br />V1.3\r<br />[List]\r<br />[*] Added 2 new animation types.\r<br />[*] Added M/M and F/F options.\r<br />[*] Added a ESM so others can re-use AP.\r<br />[*] Finished adding &#34;Twitch&#34; idles to all animations.\r<br />[*] Tweaked Idles for better placement.\r<br />[*] NPCs should no longer move away.\r<br />[/List]\r<br />\r<br />1.4\r<br />Um... Never existed... My bad&#33;\r<br />\r<br />V1.5\r<br />[List]\r<br />[*] Added sound to females, including the player.\r<br />[*] Changed to fore&#39;s anims system.\r<br />[*] Can bribe guards for crimes less than 500 gold.\r<br />[*] Removed &#34;Twitches&#34; from all animations.( Will re-add under the new system.)\r<br />[*] NPC&#39;s shouldn&#39;t move away.\r<br />[/List]\r<br />\r<br />V1.6\r<br />[List]\r<br />[*] Fixed sounds.\r<br />[*] Can &#34;pimp&#34; your companion.\r<br />[*] Can &#34;pimp&#34; your companion to bribe guards for crimes less than 200 gold.\r<br />[*] Added &#34;Twitches&#34; back to animations. (Player only.)\r<br />[*] Updated to fore&#39;s 1.5.\r<br />[/List]\r<br />\r<br />V1.7\r<br />[List]\r<br />[*] Removed fore&#39;s behavior files because he insisted.\r<br />[/List]\r<br />\r<br />V1.8\r<br />[List]\r<br />[*] Added my own behavior files.\r<br />[*] Added an options menu.\r<br />[*] Other stuff, but the description was lost.\r<br />[/List]\r<br />\r<br />V1.9\r<br />[List]\r<br />[*] Changed male modesty undies to rags.\r<br />[*] Made the options work in all cases of sex.\r<br />[*] Fixed stuff.\r<br />[*] Added NPC masty spell.\r<br />[/List]\r<br />\r<br />V2.0\r<br />[List]\r<br />[*] Sill no new animations as of this version.\r<br />[*] Almost everything works almost 100% of the time.\r<br />[*] Men&#39;s rude body fits.\r<br />[*] Updated dialogue, and made miscellaneous fixes.\r<br />[/List]\r<br />\r<br />V2.01\r<br />[List]\r<br />[*] Found a massive conflict error with having an .esm as the mod base. Changed to .esp until I can figure it out or someone really needs an .esm. This one is a doozy. If any mod changed the Amulet of Dibella the whole lot of AP&#39;s dialogue went out the door. Note: SORRY to all the people that had no dialogue. My BAD.\r<br />[*] Added more functions to AP companions.\r<br />[/List]\r<br />\r<br />V2.02\r<br />[List]\r<br />[*] Added a fore patch list for compatibility.\r<br />[*] Found and killed a bug in the main script but got too messed up last night and ended up killing the whole thing, so it&#39;s not posted. However, note that if the sex script is running slower than it should, you need a re-install. I ran the .esp and my god, the lag. Took the better part of 6 hours to get back up to speed and that was how I did it. Killed my dev copy learning that, so hope it helps.\r<br />[/List]\r<br />\r<br />V2.1\r<br />[List]\r<br />[*] Added SKSE extensions to remove/put back clothes.\r<br />[*] Added  8(Styles) * 5(Twitches) and new anims for M/F (M/M on some).\r<br />[*] Sound now uses shared dialogue to save on file size and to make the sound re-usable.\r<br />[*] More options in the menus.\r<br />[*] Twitches can be disabled.\r<br />[*] Added amulet on start if you don&#39;t have one.\r<br />[*] Added a Kill AP option for uninstall.\r<br />[*] Made the Auto-Pimp spell more stable and added more styles. (Some are off of true though, need to figure out why the offset is different if the player is controlled).\r<br />[*] Overall it&#39;s just plain better. There is other stuff I did that I can&#39;t remember right now.\r<br />[/List]\r<br />\r<br />V2.2\r<br />[List]\r<br />[*] Fixed option No-Strip.\r<br />[*] Fixed option Scale to player height.\r<br />[*] Added option Disable Role play.\r<br />[*] Added option for twitches on player or player & NPC or nada.\r<br />[*] Added option for strap-ons external to AP.\r<br />[*] Added a AP strap-on that can be made at forges under the leather category.\r<br />[*] Opened up existing styles for men and implemented strap-on styles for Player/NPC.\r<br />[*] Added follow/wait to followers. (Failed to get them to attack on command... Next version...)\r<br />[*] Fixed not being able to recruit followers with sex that you could have recruited some other way.\r<br />[*] Added a new AP Amulet of Dibella to avoid conflicts. Can me made at a forge under the jewelry category.\r<br />[*] Changed the nude body to one that fits the strap-on. It&#39;s CBBE now.\r<br />[*] Player/NPC will pick a random twitch to start with.\r<br />[*] Made a hack to line up the BJ in the auto pimp spell.\r<br />[*] Fore&#39;s strip option now re-equips every slot possible.\r<br />[*] No more getting Speech up to 100 by lvl 10. Speech EXP reward reduced by 75%.\r<br />[*] Included Dawnguard compatible behavior files.\r<br />[*] Other small stuff. That&#39;s the ones that I did and can remember. And welcome to the team...\r<br />[*] Text revisions by MysteryHelper, no more bleeding eyes from reading my dyslexic sprawl.\r<br />[/List]\r<br />\r<br />V2.21\r<br />[List]\r<br />[*] Dawnguard vampires have sounds.\r<br />[*] Changed that way usable NPCs are detected. Instead of having a list of voices you can use it on, it now works on a list that you can&#39;t. AKA non-vanilla (Dawnguard and mod) NPCs will work now.\r<br />[*] Moved the twitches script to a whole new spell. Should stabilize the whole thing quite a bit.\r<br />[*] Fore&#39;s users will have a happy expression. :) (Was trying to open mouth for BJ: failed on that, got happy face...)\r<br />[*] Moved back to .esm as there are enough translations to make it worth while and now that AP has its own amulet no conflict is possible.\r<br />[/List]\r<br />\r<br />V2.22\r<br />[List]\r<br />[*] Removed the skeletons for BBP. (I had it up the duck anyway... This whole time since V1 in fact.)\r<br />[*] Added a new rude-body for BBP.\r<br />[*] Added &#34;Can you do something for me&#34; to dates.\r<br />[*] Made pimping you companion give friendship or coin.\r<br />[*] Did the convert to .esm the right way.\r<br />[/List]\r<br />\r<br />V2.3\r<br />[List]\r<br />[*] Removed BBP body and option.\r<br />[*] Added sex on the bed.(1 style 11 anims M/F F/F)\r<br />[*] Female players can have a wank on a bed (6Anims 1 style).\r<br />[*] Improved options menus.\r<br />[*] Added a see you sleep perk and option to turn off.\r<br />[*] Changed the activator to an enchantment and not the amulet.\r<br />[/List]\r<br />\r<br />V2.31\r<br />[List]\r<br />[*] Fixed the &#34;black screen of death&#34; on bed use.\r<br />[*] Fixed the 50 gold spam. (My bad, that was a debug line I left in.)\r<br />[*] Most inportantly... Found WHY my scripts keep breaking. Bethsoft you ..... where&#39;s my ....ing bike. (Will have the whole lot stable by V2.4,testing &#34;UNBREAKABLE&#34; script on the beds ATM.)\r<br />[/List]\r<br />\r<br />V2.32\r<br />[List]\r<br />[*] When I posted V2.31 I got the latest update to the CK. This version is the same as V2.31 just made with the latest CK. Hope that stops BOSS complaining about AP, and it hopefully fixes that damn need to save/load for dialogue.\r<br />[*] Forgot to include the updated esm with the V2.31 post. So basically the V2.3s have been up the duck something bad. Good thing I only left it that way for 2 days... Let&#39;s just pretend that V2.32 was the first of the V2.3s, okay?\r<br />[/List]\r<br />\r<br />V2.33\r<br />[List]\r<br />[*] Fixed stacking of sex reward.\r<br />[*] Main script changed to timer-based and not while-based control. No more broken main script.\r<br />[*] Other small stuff. Can&#39;t really remember right now.\r<br />[*] Oh, and I reset the timer to 60 seconds on main sex script. Sorry, people, I made it 25 sec for testing and forgot to put it back. My bad.\r<br />[/List]\r<br />\r<br />V2.34\r<br />[List]\r<br />[*] One and only change -- moved the script from one spell to 3. I REALLY hope that&#39;s the last of the broken/breakable main script.\r<br />[/List]\r<br />\r<br />V3\r<br />[List]\r<br />[*] Added new anims\r<br />[*] Added a HOLE lot of pollish\r<br />[*] Puppy is now a full feture in it own right\r<br />[/List]\r<br />\r<br />V3.01\r<br />[List]\r<br />[*] Lets just pertend that this is V3 a? Shout on. No Idear how I missed that one.\r<br />[*] Finaly did comthing about that dang ride&#39;em&#39;cow girl anm. Lost 3 twitch&#39;s but it lines up now.\r<br />[/List]\r<br />\r<br />V3.02\r<br />[List]\r<br />[*] Lets just pertend that this is V3 a? Bad doggy. I have bean up the duck latey.\r<br />[/List]\r<br />\r<br />V3.03\r<br />[List]\r<br />[*] Ok the bed scripts have been UP THE DUCK. I know why now. Female masty solved... Stable as. Rest will follow.\r<br />[*] Added the option to shag for cheep goods\r<br />[*] And the biggy. No more bull haveing to save-&gt;load to get the dialoug to work. Joy that bean an anoiance for 1 year now.\r<br />[/List]\r<br />\r<br />V3.04\r<br />[List]\r<br />[*] Bed Scripts made stable.\r<br />[*] This just may be the first Stable AP for skyrim since I moved from race based anims\r<br />[/List]\r<br />\r<br />V3.05\r<br />[List]\r<br />[*] Maybe the first AP I can lable stable. (Close)\r<br />[*] Fixed Dialouge.\r<br />[*] Fixed Beds (Agean).\r<br />[*] Pollished it right up.\r<br />[*] Tested Every-Thing with a Female Player and it ALL works. Thats a AP First.\r<br />[*] Can &#34;Pimp&#34; you companion with the &#34;Do something for me&#34; comands\r<br />[/List]\r<br />\r<br />V3.1\r<br />[List]\r<br />[*] Yet more stable.\r<br />[*] All Dialouge has a fail chance.\r<br />[*] Added a work around for Player Home Beds.\r<br />[*] Added MCM menu.\r<br />[*] Added 3 way if you have a female companion (Female Player needs a strap-on).\r<br />[*] Yet more refinments.\r<br />[*] Really from now on you will NEED to install into a clean save\r<br />[/List]\r<br />\r<br />V3.2\r<br />[List]\r<br />[*] Tryed to add sos intergation.\r<br />[*] Ok,The bed has bean stable for the last few, Now it works FORE/Mine/M/F.\r<br />[*] Few other small things, Just wanted to get that dam bed out of the way.\r<br />[/List]\r<br />\r<br />V4.0\r<br />[List]\r<br />[*] Better sos intergation.\r<br />[*] Lots of new anims for f/f, some can be m/f\r<br />[*] Made hight problems way worse\r<br />[*] Removed helaner&#39;s voice\r<br />[*] Did male voice acting\r<br />[/List]\r<br />\r<br />V4.01\r<br />[List]\r<br />[*] Fixed hight problems\r<br />[/List]\r<br />\r<br />V5.0\r<br />[List]\r<br />[*] More Anims.\r<br />[*] Some satire on boat raceing.Java ant so bad. At least it is stable.\r<br />[/List]\r<br />\r<br />V5.1\r<br />[List]\r<br />[*] Changed Bed hook, now works on player owened beds .\r<br />[*] Extended 3Way. Rember to have a strap on in your companions Inv, they cant use what they ant got.\r<br />[/List]\r<br />\r<br />V5.12\r<br />[List]\r<br />[*] Should of fixed the dialouge not showing up.\r<br />[*] Few other things. All small and not noticeable really.\r<br />[/List]\r<br />\r<br />V5.21\r<br />[List]\r<br />[*] &#34;Should&#34; of fixed the dialouge not showing up. Again. Sigh\r<br />[*] Bed &#34;Should&#34; never get stuck in the fade to blank now.\r<br />[*] Inproved the Player sex sounds.\r<br />[*] Sex will now leve a mark. Use the towel if you dont like it.\r<br />[*] Better &#34;cum&#34; , no more lights...\r<br />[*] You pick use&#39;s form lists. Works better this way. F/F is a bit iffy.\r<br />[*] Puppys will like me. Lots done for them.\r<br />[*] NMM installer. Don&#39;t &#34;Have&#34; to install my patched BF&#39;s any more. Included some support files. They are optional.\r<br />[/List]\r<br />\r<br />Dev-Plains:\r<br />[List]\r<br />[*] Hugs/Kiss&#39;s\r<br />[*] 3/4 way - More...\r<br />[*] finnish makeing the bed stabe\r<br />[*] Working girls\r<br />[*] Non standard Follower intergration\r<br />[*] And Allwase :New Anims\r<br />[/List]\r<br />\r<br />Note About Vershion Numbers-\r<br />Ok, here is how I do my version numbers. It Go&#39;s... Majior,Minior,Bug Fix.\r<br />So V2 has much more then V1 But the only real diff Between V3 and V3.01? is bug fix&#39;s.\r<br />If you are after new anims and functions and are happy with the AP you have only bother upgrading on the .Somthings. Mostly new anims will be a hole new V Level.\r<br />\r<br />-Credits-\r<br />Programming/Animation/Scripting/Design/Everything by JoshNZ\r<br />Text revisions by MysteryHelper & togan77 (Oh thank-you,my everything isn&#39;t worth anything if you can&#39;t read it) ",
  "categoryId": "51",
  "version": "5.21",
  "author": "JoshNZ",
  "createdUnix": "1329868997",
  "updatedUnix": "1393592674",
  "containsAdultContent": true,
  "uploadedBy": "JoshNZ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77984",
      "name": "AP Race Based Anim Demo",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3195",
      "fileName": "AP Race Based Anim Demo-10748-1-3.7z",
      "uploadedUnix": "1343789738",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/784d21c8b3ad09ab10c1e19de4174f191cd063541e46e900b05cba146c082bd2/analysis/1407061204/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AP%20Race%20Based%20Anim%20Demo-10748-1-3.7z?fid=77984&ttl=1535771346&ri=8192&rs=8192&setec=9e58c1e9df61fe4216d50b1b0e4d7dd7"
    },
    {
      "fileId": "1000056768",
      "name": "Max dev files",
      "version": "1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "3490",
      "fileName": "Max dev files-10748-1.7z",
      "uploadedUnix": "1379715723",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/f5a9599cffb9c10324a89423b577783413f642ffcc7774f7dd8b08dc6fa18b7e/analysis/1407729425/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Max%20dev%20files-10748-1.7z?fid=1000056768&ttl=1535771347&ri=8192&rs=8192&setec=7d63bf62b3a72ab3b0b27b9ca9a7eb76"
    },
    {
      "fileId": "1000057342",
      "name": "Animated Prostitution - Known Working",
      "version": "5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23365",
      "fileName": "Animated Prostitution-10748-5.7z",
      "uploadedUnix": "1379928548",
      "modVersion": "5",
      "virusScanUrl": "https://www.virustotal.com/file/e1789554a5682fb6118539ad2c88235ffcaf7024f93d5d9a9d7e00ef3b812d49/analysis/1407732437/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Animated%20Prostitution-10748-5.7z?fid=1000057342&ttl=1535771347&ri=8192&rs=8192&setec=0e166061dae377e0ce25782f0cbbe73a"
    },
    {
      "fileId": "1000094128",
      "name": "Male Voice Pack",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "15199",
      "fileName": "Male Voice Pack-10748-1.7z",
      "uploadedUnix": "1391037927",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/9bb7ba41e29c529e1c7dc22508cd56e2e2850d882286a1beb62eb777a2054f9f/analysis/1407908003/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Male%20Voice%20Pack-10748-1.7z?fid=1000094128&ttl=1535771348&ri=8192&rs=8192&setec=e77024b7506fcc6c19980caf6f7f25dc"
    },
    {
      "fileId": "1000099103",
      "name": "Animated Prostitution",
      "version": "5.21",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10185",
      "fileName": "Animated Prostitution-10748-5-21.7z",
      "uploadedUnix": "1393592674",
      "modVersion": "5.21",
      "virusScanUrl": "https://www.virustotal.com/file/463bdab7589eecb859ed46108642829e44a47fbd69ce3733e4e3ea95937aded3/analysis/1407953693/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Animated%20Prostitution-10748-5-21.7z?fid=1000099103&ttl=1535771348&ri=8192&rs=8192&setec=7e8707496b4fd2020f34fa728229367e"
    }
  ]
}