{
  "modId": 10751.0,
  "modName": "REAL Glass Armor and Shields with realistic transparency",
  "summary": "This mod makes it so all glass armor and shields in the game have a realistic see-through glass-like quality.",
  "descriptionHtml": "This mod is a companion piece to my other mod \\\"REAL Glass Weapons with realistic transparency\\\" which you can find here: http://skyrim.nexusmods.com/downloads/file.php?id=9892\r\nThis mod uses the same effect as my weapons mod to give glass armor and shields a realistic transparency effect. This mod is different from other transparency mods in that it doesn\\'t make the armor/weapons simply see-through and ghost-like, but rather gives a more subtle transparency effect more similar to glass. I hope you enjoy how they look, and will download and enjoy your new and improved glass armor and shields! (This mod uses the textures provided by the high resolution texture pack from Bethesda)\r\n\r\n2/22: Released a color variant of my mod using \\\"More Morrowind Like Glass Armor Texture\\\" by JESSETIN3. You can find his mod here: http://skyrim.nexusmods.com/downloads/file.php?id=4859\r\n*Note: As of right now the mod uses the low res textures. When the HD version of his mod is released, I\\'ll update my file.\r\n*Note2: I feel like the transparency might be less noticeable using his textures. I think I\\'ll play around with it to get it looking better, but I\\'m going to wait until I get the HD files first.\r\n\r\n2/23: Released an optional file using Killer Keo\\'s Skimpy CBBE glass armor mesh with my glass transparency effect on it, for those of you who are into that sort of thing. Find his original mod here: http://skyrim.nexusmods.com/downloads/file.php?id=3654\r\n\r\n3/14: Decided to go back to 1.0 as the main file, as I felt the shadow problems from 2.0 were worse than the lighting problems from 1.0, I\\'ve kept 2.0 as a \\\"beta\\\" version. Feel free to try both and use whichever you prefer. Any more feedback I can get on which version you prefer would be great.\r\n\r\n************************************\r\n\r\nNote: The \\\"Real Glass Armor/Shield\\\" main mod does NOT make see through, bikini-like glass armor like some would hope. The effect is rather subtle, and is only on parts that come off from the armor, like the shoulderpiece and other parts of the helmet, gauntlets, and boots. The shield is more noticeable, though, as there is more glass on it.\r\n\r\nHowever, as of 2/23 you may download the optional Skimpy Glass Armor file, for anyone who wanted a little more skin to be shown in my mod. Find it in the optional section, enjoy!\r\n\r\n************************************\r\n\r\nKNOWN ISSUES:\r\n\r\nWith V 1.0, there was some lighting issues where when you were outdoors, even if you were under shade, the armor would appear to be completely lit by sunlight. Also when you were indoors, the armor wouldn\\'t be affected by certain light sources by fire.\r\n\r\nWith V 2.0, these issues are corrected, but unfortunately created a new issue. Now, in a weird way, the armor will show shadows from objects behind you on the armor, rather than how it\\'s supposed to be. \r\n\r\nAlso, in both versions, shadows don\\'t seem to appear on the ground from your armor. Still looking for a solution to this.\r\n\r\nI am always looking for fixes for all of this, and will update as soon as I figure anything better out. It\\'s up to you to decide which version has the least annoying problem in your opinion. If anyone knows a solution to these issues or has any suggestions, please let me know, and also please let me know of any other bugs you encounter.\r\n\r\n************************************\r\n\r\nThe \\\"REAL Glass Armor and Shield with Transparency\\\" mod unfortunately is not compatible with other texture mods just from downloading it. \r\nFortunately there is a workaround that will require a little manual effort, but will get your favorite glass texture with the glass transparency effect from my mod.\r\nThis essentially involves copying the alpha channels from the textures in my mod onto whatever textures you want to use, and using the meshes that I included. \r\nBelow are more detailed instructions on how to do this.\r\n\r\nInstructions: \r\n\r\n**You\\'ll need an image editing program (I use Photoshop), and download support for opening .dds files. For Photoshop, use this plugin: http://developer.nvidia.com/nvidia-texture-tools-adobe-photoshop\r\n\r\n1. Extract all of the meshes (.nif files) from my mod and put them in the proper folder (data/meshes/armor/glass/...).\r\n2. Open up both the texture that you want to use, and the texture (of the same weapon) that came in my mod into your image editing program. I would do one weapon at a time, (i.e. open up my shield.dds and your shield.dds)\r\n\tMake sure the textures are the same size, resize them if they aren\\'t (preferably to 1024, or 2048)\r\n3. Then, either:\ta. Copy your texture onto my texture file\r\n\t\tor\tb. Copy the alpha channel from my texture file onto your texture file.\r\n\tWhichever you prefer, both options will work. Just copy and paste or shift drag the layers.\r\n4. Save out that file as a .dds file with the alpha channel in the proper folder (data/textures/weapons/glass/...) as the same name. For photoshop, I use the \\\"DXT3 ARGB 8 bpp | explicity alpha\\\" option when saving the .dds file.\r\n\r\nThis should work if you\\'ve done it correctly and everything is named correctly and in the right folder.\r\n\r\n************************************\r\n\r\nVersion Info:\r\n2.0- Fixes some lighting issues, but adds a new shadow issue.\r\n1.0- Initial release, covers all glass armor and the glass shield.\r\n\r\n************************************\r\n\r\nPlease check out my other mod \\\"Icy Chillrend with transparency\\\", which is how I originally figured out how to do realistic transparency: http://skyrim.nexusmods.com/downloads/file.php?id=9705\r\n\r\nThanks and enjoy! Please endorse if you like the mod.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Joshawowo",
  "createdUnix": "1329869892",
  "updatedUnix": "1330478263",
  "containsAdultContent": false,
  "uploadedBy": "Joshawowo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "35018",
      "name": "Real_Glass_Armor_and_Shield_v_1-0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9892",
      "fileName": "Real_Glass_Armor_and_Shield_v_1-0-10751-1-0.rar",
      "uploadedUnix": "1329870039",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7c77b95ffa8575b5b924df5b61417acb50a6f5f9447d569ad631eed27cbb0ff2/analysis/1406703223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Real_Glass_Armor_and_Shield_v_1-0-10751-1-0.rar?fid=35018&ttl=1535771351&ri=8192&rs=8192&setec=0843e3b0ade2033cdabc0dcbf2fd27ef"
    },
    {
      "fileId": "35400",
      "name": "Real_Glass_Armor_and_Shield with Morrowind Like Textures by JESSETIN3",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "9396",
      "fileName": "Real_Glass_Armor_and_Shield with Morrowind Like Textures by JESSETIN3-10751.rar",
      "uploadedUnix": "1329941270",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/12f4bc7f7361b9886f63e81369dc721996db136d9ab2d6cc052c1e36be68206e/analysis/1406705782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Real_Glass_Armor_and_Shield%20with%20Morrowind%20Like%20Textures%20by%20JESSETIN3-10751.rar?fid=35400&ttl=1535771351&ri=8192&rs=8192&setec=12f3bb8e05ec1c27f89d377a5cde93e9"
    },
    {
      "fileId": "35847",
      "name": "Killer Keos Skimpy Real Glass Armor",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2906",
      "fileName": "Killer Keos Skimpy Real Glass Armor-10751-1-0.rar",
      "uploadedUnix": "1330021832",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/be9db6b2be468f1dee7e888e5d7480d80903807f2702673546ad1d14eca34711/analysis/1406708231/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Killer%20Keos%20Skimpy%20Real%20Glass%20Armor-10751-1-0.rar?fid=35847&ttl=1535771352&ri=8192&rs=8192&setec=5a312e1bef73c5cfe051981e700aa121"
    },
    {
      "fileId": "38247",
      "name": "Real_Glass_Armor_and_Shield_v_2-0 BETA",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9892",
      "fileName": "Real_Glass_Armor_and_Shield_v_2-0 BETA-10751.rar",
      "uploadedUnix": "1330478263",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/19a757dcd8d84441b4132b0de795624f109d918557d72b40941175721088f042/analysis/1406720469/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Real_Glass_Armor_and_Shield_v_2-0%20BETA-10751.rar?fid=38247&ttl=1535771352&ri=8192&rs=8192&setec=da21dc3a554190e433d150dab055c34a"
    }
  ]
}