{
  "modId": 10789.0,
  "modName": "Colorful Lights - No Shadows - More FPS",
  "summary": "Modifies lighting to remove glitchy shadows while maintaining color and brightness for improved performance and image quality, good for lower-spec systems.",
  "descriptionHtml": "tl:dr Summary\r<br />-------------------\r<br />pretty lights, no shadows, more FPS, simple esp file, no ini or cfg tweaking\r<br />\r<br />Intro\r<br />-----\r<br />If your computer spec lurks somewhere near or below the edge of the recommended minimum system requirements you have probably noticed that the option to disable shadows is not offered in the launcher, and consequently may have noticed that the low quality shadow settings look like garbage. If you scratched a little deeper you probably tried disabling shadows by changing the commonly recommended ini values and were disappointed to find everything had turned dark and colorless. The vanilla shadow options amount to menu choices between a garbled blocky flickering striped mess and a beautiful slide show, or editing the ini to induce a global dungeon vibe. This mod offers a alternative that I think strikes a nice balance between eye candy and system performance by removing most of the system-hog shadows. Everything will still be shaded to create the static, nice-looking shadows and colorful lights that utilize relatively little system resources. The shadows that are removed by this are the dynamically-rendered flickering shadows, commonly found near flames. \r<br />\r<br />How it works\r<br />------------\r<br />Every single light in the game world is a reference to a base form that defines how that light will behave: its color, brightness, radius, etc. The light base form definition dialogue in the CK has a &#34;Type&#34; field with four options: Omnidirectional, Shadow Hemisphere, Shadow Omnidirectional, and Shadow Spotlight. Omnidirectional lights cast no real-time shadows but the other three types do. It seems that disabling shadows by editing the ini causes only omnidirectional lights to render and disables the other three types. Unfortunately much of the color comes from the  shadow-producing lights so you end up with a dreary, colorless image if you disable the shadows with ini tweaks. This is especially noticeable in the interior spaces lit by candles and fires. \r<br />\r<br />I opened every light form in the CK. I changed the &#34;Type&#34; setting of all shadow omnidirectional and shadow hemisphere lights to omnidirectional. In a few rare cases I made adjustments to other characteristics of the light form to correct for brightness. I did not edit any shadow spotlights due to their scarcity and unusual qualities.\r<br />\r<br />Usage Notes\r<br />-----------\r<br />-I know that this works really well for me and that I prefer to play with it rather than without it. Your results may vary, and I make no claims besides that of my own satisfaction with my results on my system with my monitor at my desk. I can report that on my system I get an increase of about 10 FPS in most indoor areas when using this, and in some areas the increase is much higher than that. I also think that it looks nice, and I prefer the lack of shadows to the lower-quality ones.\r<br />\r<br />-In outdoor cells there will still be shadows created by the moving sun/moon light source, which this mod does not affect.\r<br />\r<br />-If another mod adds a new light form this mod will have no affect on it. \r<br />\r<br />-If another mod utilizes only the vanilla light forms this mod will work correctly with it. Most modders probably use the vanilla lights most of the time so this should function correctly with most mods, including those that add new cells. The worst that will happen is that you will see some shadows in the modded area if they used a new type of shadow light.\r<br />\r<br />-If another mod alters the vanilla light forms it probably will not work correctly with this. This would probably include, and be mostly limited to,  lighting overhaul mods\r<br />\r<br />-This is not a finely tuned lighting overhaul that has been extensively tested to look beautiful in all areas. It makes a very small and unsophisticated change to a total of 124 light forms, and the change made to those forms affects thousands of light references. Each reference, however, can itself override the base form attributes. Two different instances of the same base light form may look and behave completely differently, despite being of the same form. This means that the only way to truly know what the final affect of editing a base light form will be is to look at the light as it is rendered in the cell in which it exists as a reference, either in the game or the CK. Because I can not spend the time necessary to look at every light in every cell it is possible that you may find an area that is extremely bright because of the change that this mod makes. If you do find an extremely bright or otherwise bugged-out area please report it so that I can update the file.\r<br />\r<br />Change Log\r<br />----------\r<br />1a - Removed edits to spotlights, returning them to vanilla behavior. \r<br />\r<br />1b - Changed &#34;Fade&#34; value of BleakFallsSunlight01 and BleakFallsSunlight02 from 5 to 2.5 to correct brightness and increase performance in 14 cells, including the spider room in Bleak Falls Barrow, the Temple of Talos in Windhelm, and the Thieves Guild hall",
  "categoryId": "62",
  "version": "1b",
  "author": "TRoaches",
  "createdUnix": "1329898823",
  "updatedUnix": "1330224765",
  "containsAdultContent": false,
  "uploadedBy": "TRoaches",
  "primaryFile": null,
  "files": [
    {
      "fileId": "36927",
      "name": "ColorfulLightsNoShadows-v1b",
      "version": "1b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "ColorfulLightsNoShadows-v1b-10789-1b.zip",
      "uploadedUnix": "1330224765",
      "modVersion": "1b",
      "virusScanUrl": "https://www.virustotal.com/file/f9c0e27b0172b4560348e7ff5f5e99df222f2a2a216b9f8e406c312dca2e3fe4/analysis/1406713658/",
      "changelogHtml": " Changed \\\"Fade\\\" value of BleakFallsSunlight01 and BleakFallsSunlight02 from 5 to 2.5 to correct brightness and increase performance in 14 cells, including the spider room in Bleak Falls Barrow, the Temple of Talos in Windhelm, and the Thieves Guild hall <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ColorfulLightsNoShadows-v1b-10789-1b.zip?fid=36927&ttl=1535771405&ri=8192&rs=8192&setec=705cc1265339c158690b8724a59f6381"
    }
  ]
}