{
  "modId": 10842.0,
  "modName": "Auditorium",
  "summary": "Second release of an expansion to the Bard\\'s College in Solitude with attached quest.",
  "descriptionHtml": "Explore the Bard\\'s College Auditorium and enjoy the music of Skyrim. \r\n\r\nHidden below the basement of the Bard\\'s College in Solitude you will discover the Auditorium, a unique interior dedicated to the music of the Bard\\'s of Skyrim. \r\n\r\nAs you enter you will find the large open Main Auditorium Hall, which houses the College\\'s most precious first edition books. \r\n\r\nIn the three lower rooms you will find peaceful spaces with decorated alters and soft music. Each honors one of the three instruments of the Bard. The flute, the lute, and the drum. \r\n\r\nThe two other rooms serve as a dining area and living quarters for the Auditorium Curator and her guests. Meet with Curator Heather to begin the quest \\\"A Curator\\'s Concern\\\".\r\n\r\nThe quest will take you to Nevmar\\'s Cave a little known hideout for thugs, bandits, and burglars.\r\n\r\nWhen you have completed the quest you will be rewarded with three unique Alteration spells.\r\n\r\nPlease remember to rate if you enjoy this mod!\r\n\r\n~~~~~~~~\r\n\r\nFeatures\r\n\r\n- A new expansion to the Bard\\'s College in Solitude, the Auditorium.\r\n\r\n- A unique quest, \\\"A Curator\\'s Concern\\\" with voice acting.\r\n\r\n- A new dungeon to explore and fight your way through.\r\n\r\n- Three unique Alteration spells as a reward for completing the quest \\\"A Curator\\'s Concern\\\".\r\n\r\n- Consistent with the style and themes of the rest of the game.\r\n\r\n~~~~~~~~\r\n\r\nInfo\r\n\r\nTo find the Auditorium go down the stairs in the Bard\\'s College in Solitude to the basement and take a right. The door will be on the right.\r\n\r\nMore to come. This mod is still a work in progress. Plans include the addition of vendor NPCs, singer/player Bard NPCs, and more music related quests.\r\n\r\nThis is a beta test release as there has been no testing done other than by myself. Please email me here or on Steam if you find any bugs that are not listed below and I will do my best to work them out.\r\n\r\n~~~~~~~~\r\n\r\nKnown Bugs\r\n\r\n- Quest markers and log entries not showing (Quest Aliases not working properly in the CK)\r\n\r\nThe quest can still be completed easily by following the directions given by Curator Heather \r\nand the journal. The dungeon will appear on your map when the quest is accepted but \r\nyou will not recieve an objective marker.\r\n\r\n~~~~~~~~~\r\n\r\nFixed Bugs\r\n\r\nResolved previous issues with the archive being improperly packed.",
  "categoryId": "28",
  "version": "1.2",
  "author": "Raj Kahlira",
  "createdUnix": "1329937734",
  "updatedUnix": "1330007555",
  "containsAdultContent": false,
  "uploadedBy": "KahjiitRaj",
  "primaryFile": null,
  "files": [
    {
      "fileId": "35740",
      "name": "Auditorium",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8331",
      "fileName": "Auditorium-10842-1-2.7z",
      "uploadedUnix": "1330007555",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/520f17a920d3c0f1025f9ef9daaf8891e4937369e3603de68368d26e87ad2ee5/analysis/1406707713/",
      "changelogHtml": " Corrected file names in the mod archive. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Auditorium-10842-1-2.7z?fid=35740&ttl=1535771489&ri=8192&rs=8192&setec=bbddd6039e7ea3eec553eae6a3f2beaf"
    }
  ]
}