{
  "modId": 10843.0,
  "modName": "Total Realism - Basic Needs",
  "summary": "Hardcore Survival mod with emphasis on immersion. Adds Hunger, Sleep and Thirst simulation to the game, with gameplay adaptability and real effects on the character.",
  "descriptionHtml": "[size=\\\"12\\\"]TOTAL REALISM - Basic Needs[/size]\r\nTR - Basic Needs is a Thirst, Sleep and Hunger simulation for Skyrim. The system is designed to be as immersive and as unintrusive as possible, at the same time providing the player with real incentives to attend to their character\\'s basic needs, going beyond just simulating them. If you go hungry or thirsty, your character will suffer for it and it will reflect on your gameplay.\r\n\r\n[center]--Don\\'t forget to [color=\\\"#00FF00\\\"][b]Endorse[/b][/color]  if you like the mod!--[/center]\r\n\r\nFor unistall instructions, scroll down to the bottom of description.\r\n\r\nHere is a nice video showcasing the mod and some of its features. Big thanks to [url=\\\"http://forums.nexusmods.com/index.php?/user/3166292-arsenalrobert/\\\"]ArsenalRobert[/url] for making it!\r\n[center][youtube]aD7thgxXyLI&feature=youtu.be[/youtube][/center]\r\n\r\n[b]v0.9 change log[/b]\r\n\r\nGAMEPLAY ADDITIONS\r\n-added the ability to refill empty bottles of water at any inn - just ask the bartender or a servant!\r\n-added a more efficient messaging system when players eat or drink. Now there is no longer need for guesswork.\r\n-added the ability to drink directly from streams; to drink, you have to be outside combat, sheathe your weapon and crouch while standing in a source of fresh water\r\n-added the blur vision effect for drunk, roaring drunk and alchohol poisoned states. Now you can fall down the mountain and it will really all be a blur!\r\n-added effect descriptions for drunkenness stages\r\n\r\nGAMEPLAY CHANGES\r\n-fresh water is now detected much more effectively, meaning instantly.\r\n-altered the effects food and drinks have in various stages of hunger; now it should feel more natural.\r\n-increased the time needed to become hungry after being fully sated to 6 hours from 4.\r\n-increased the time needed to become thirsty after being fully sated to 5 hours from 3.\r\n-expanded the valid sources of fresh water; now only interior, stangant (non-moving) and marshland water is not good for drinking\r\n-increased the weight of water bottles to: full(10), two thirds(6.6), one third(3.3) empty(1)\r\n-snacks are now useless once you get very hungry or starving. Get some proper food!\r\n-increased the upper limit of death by alcohol poisoning by 20% or another stiff one. Cheers!\r\n\r\nBUG FIXES\r\n-tired effects now display as detrimental (red), as they should\r\n-fixed a bug where it was possible to keep drinking alcohol indefinitely. Now you can die from alcohol poisoning like a mortal you are. Nords be warned!\r\n-fixed a bug which would make it impossible to wait out drunkenness\r\n-fixed a bug that would make the player stuck when trying to play certain animations when the player was sitting\r\n\r\nMISCELLANEOUS\r\n-added one more sip to a bottle of water to a total of 3; full, two thirds, one third, empty\r\n-changed Cabbage to a snack, from raw food\r\n-changed Venison Chop to a normal meal, from snack\r\n-lowered the effect of Exhaustion by 30%\r\n\r\n--version 0.91 change log addendum--\r\nCRITICAL BUG FIXES \r\n-fixed a bug causing players to get inconveniently stuck and forced to change weapons after playing an idle animation if they tried to eat/drink with weapons out \r\nBUG FIXES \r\n-Dragon\\'s Breath Mead now has an appropriate kick (added missing strong alcohol effect) \r\nGAMEPLAY CHANGES \r\n-changed water bottle names to something more easily sorted in the Inventory\r\n\r\n[center]------------------------------------------------------[/center]\r\nGameplay features:\r\n\r\n[list]\r\n[*]adjusts dynamically to various timescale settings\r\n[*]non-linear, realistic sleep, hunger and thirst simulation\r\n[*]several types of food and alcoholic drinks\r\n[*]multiple need phases with various stacking effects\r\n[*]you can get drunk for real, fall on your face\r\n[*]drinking, eating and barfing animations (3rd person only)\r\n[*]can get sick and puke from eating stale or raw food\r\n[*]fresh food availability reduced in dungeons and world in general\r\n[*]refillable water bottles, can refill at any running water source\r\n[*]needs interactivity; penalties stack, if you are drunk you have less chance of barfing after eating raw food etc.\r\n[/list]\r\nAnd more.\r\n\r\n[b][size=\\\"4\\\"][color=\\\"#008000\\\"]Quick gameplay tips[/color][/size][/b]\r\n-you can only refill bottles in running water such as rivers and streams. Lakes, ponds, marshes and the sea are not considered as good sources of fresh water\r\n-to refill a bottle, stand in the water for a few moments, then click on an empty water bottle in you inventory\r\n-you get empty water bottles from drinking most beverages in the game\r\n-stale food will often make you sick; avoid eating it if you can\r\n-if you have to eat stale or raw food, get yourself drunk first; it helps\r\n-running, sprinting and fighting increases your Exhaustion, which in turn can accelerate your hunger, sleep and thirst up to three times. It takes max 4 hours of waiting (game time or via menu) or not exerting yourself to drop your Exhaustion to zero. It takes two hours of sleeping to do the same\r\n-you can view your current sleep, hunger and thirst information under Magical Effects in the character menu. Only detrimental stages show up.\r\n-getting drunk has a chance of making you trip up and fall if you run or sprint. Don\\'t run with scissors in hand while drunk!\r\n-you can wait out the effects of overzealous alcohol imbibement\r\n-messages always appear when you first enter (and re-enter) a certain sleep, hunger, thirst or drunkenness stage, and then appear based on a random chance depending on the severity of your condition\r\n-the distribution of sleep, and thirst stages is non-linear:\r\nHunger has 6 stages: : stuffed [1 hour], not hungry [ next 6 hours], peckish [next 2 hours], hungry [ next 24 hours], starving [up to three days], dying [last nine hours]\r\nThirst has 5 stages: not thirsty [5 hours], thirsty [next 6 hours], dehydrated [next 9 hours], severely dehydrated [up to two days], dying [last seven hours]\r\nSleep has also 5 stages: not tired [12 hours], tired [next 12 hours], extremely tired [next 12 hours], sleep deprived [next 12 hours], dying [last seven hours] \r\n\r\n-effects of food and drink vary depending on your condition; an apple may sate your hunger if you are peckish, but it will take a bucket of them to do the same if you are starving\r\n-it takes maximum eight hours of sleep to fully recover from any level or tiredness\r\n-sleep, hunger and thirst have real and quite severe effects on your character; take care of your basic needs in a timely fashion or suffer the consequences!\r\n-to drink directly from streams, put away your weapons or spells and crouch while standing in a source of fresh water\r\n-to refill your bottles at the inns, just ask the bartender or a servant; refilling a single bottle is free, while refilling all your empty bottles costs 5 gold\r\n\r\n\r\nKeep in mind this is an unfinished release, so there are bugs possible. I did my best to catch all of them and in my experience the mod runs very smoothly, but if you do catch a bug, do tell me about it so I can fix it!\r\n\r\nDetailed mod installation/uninstallation/gameplay instructions are in the readme bundled with the mod.\r\n\r\nOther Language Versions:\r\nSPANISH: [url=\\\"http://skyrim.nexusmods.com/downloads/file.php?id=11492\\\"]http://skyrim.nexusmods.com/downloads/file.php?id=11492[/url]\r\n[size=\\\"3\\\"](these versions are not uploaded and maintained by me, so I cannot guarantee they are up-to-date)[/size]\r\n\r\n--IMPORTANT--\r\n[b]To uninstall the mod:[/b]\r\n\r\n1. Make SURE that all the effects of Basic Needs have worn off. You can check that in the Magic Effects Listings - you should have no Sleep, Hunger or Thirst effects listed there. \r\n2. Make a NEW save game \r\n3. Close the game and uninstall the mod \r\n4. Reload your save and WAIT for a few seconds to let the scripts terminate themselves \r\n5. Save the game again, and you\\'re golden ",
  "categoryId": "24",
  "version": "0.94",
  "author": "ManSh00ter",
  "createdUnix": "1329938687",
  "updatedUnix": "1332706426",
  "containsAdultContent": false,
  "uploadedBy": "Mansh00ter",
  "primaryFile": null,
  "files": [
    {
      "fileId": "35533",
      "name": "TRO_BasicNeeds Archive",
      "version": "0.81",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "43",
      "fileName": "TRO_BasicNeeds Archive-10843.zip",
      "uploadedUnix": "1329965019",
      "modVersion": "0.81",
      "virusScanUrl": "https://www.virustotal.com/file/f54cfe4959b4f615742226d409790b3f5d8efa55ab3c642f9a9cd5d651b2f1f5/analysis/1406706782/",
      "changelogHtml": " -changed the Exhaustion rate to maximum 1 from 2. Now basic needs buildup can be max 100% faster, down from max 200% <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TRO_BasicNeeds%20Archive-10843.zip?fid=35533&ttl=1535771490&ri=8192&rs=8192&setec=4c2aae1bc07dad7105987334b6794072"
    },
    {
      "fileId": "37825",
      "name": "TRO Basic Needs Archive",
      "version": "0.91",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "57",
      "fileName": "TRO Basic Needs Archive-10843.zip",
      "uploadedUnix": "1330391163",
      "modVersion": "0.91",
      "virusScanUrl": "https://www.virustotal.com/file/e495103c23597bb5a9744d2b10c1282a5d112ec5f1acba5fa96937e2490f5905/analysis/1406718383/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TRO%20Basic%20Needs%20Archive-10843.zip?fid=37825&ttl=1535771490&ri=8192&rs=8192&setec=4a97d47ba9674ebdf7c38c94c03dc6d4"
    },
    {
      "fileId": "45815",
      "name": "TRO Basic Needs",
      "version": "0.94",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "63",
      "fileName": "TRO Basic Needs-10843.zip",
      "uploadedUnix": "1332452347",
      "modVersion": "0.94",
      "virusScanUrl": "https://www.virustotal.com/file/54c4c9fd7816f7474192ea61b86dc57037e28e832ec11d678498b391741dcbb4/analysis/1406773754/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TRO%20Basic%20Needs-10843.zip?fid=45815&ttl=1535771491&ri=8192&rs=8192&setec=3c75ef225312ed5e7714435f60ac395c"
    },
    {
      "fileId": "46810",
      "name": "TRO Basic Needs - WATER Compatibility Patch",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5",
      "fileName": "TRO Basic Needs - WATER Compatibility Patch-10843-1-0.zip",
      "uploadedUnix": "1332706426",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a3a99c45debb669e88316488bc576c3d9fc29f5fdb36ed4045118246df162e2e/analysis/1406779588/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TRO%20Basic%20Needs%20-%20WATER%20Compatibility%20Patch-10843-1-0.zip?fid=46810&ttl=1535771491&ri=8192&rs=8192&setec=58b93e47b17959238cb3ca19f186919d"
    }
  ]
}