{
  "modId": 10852.0,
  "modName": "Enchant Magicka Regen buffed",
  "summary": "Even with 100 enchanting and all enchanting perks, you can only get around 60\\'ish percent magicka regen. Master robes in game have 150%. Now you can make the same strength enchantment on anything that is enchantable. Yes, even armor.",
  "descriptionHtml": "Enchant anything with master level magicka regen, replacing those worn out Master Robes of Whatever that you\\'ve had since the dawn of time.  \r\n\r\nMaster robes in game have 150% regen.  Without this, the most you can get is 60\\'ish% with maxed enchanting.  With this you can get slightly over 150%, because you\\'re slightly more awesome than the people that made the other robes.  You will of course need maxed enchanting and all the relevant perks to see this number, but as a MASTER enchanter that is expected.\r\n\r\nWhy did I make this?  I got tired of my stupid Master robes and never finding an upgrade (even archmage robes are only 100%).  And so here we are.  Standing around awkwardly and avoiding making eye contact.  \r\n\r\nAnd yes, this means you can have Master level regen on armor or jewelry or whatever you normally could put it on.  Mages need love compared to fighters anyways, or so says me. \r\n\r\nEDIT:  Oh, and one last thing.  The single combination enchants from the college robes (Destruction + regen, Restoration + regen) are still broken, just as they are in the vanilla game.  I tried to fix them but it turns out I\\'m not as smart as I thought I was.  Try it in your current games, the magicka regen part will never go up even with grand soul gems.\r\n\r\nSo if you\\'re recreating Master robe enchants, just use the stand alone Magicka Regen plus whatever else you want to add to it, Destruction or whatever.  ",
  "categoryId": "75",
  "version": "1.0",
  "author": "SourGrape",
  "createdUnix": "1329943788",
  "updatedUnix": "1329943986",
  "containsAdultContent": false,
  "uploadedBy": "SourGrape",
  "primaryFile": null,
  "files": [
    {
      "fileId": "35425",
      "name": "MasterMagickaRegen",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "MasterMagickaRegen-10852-1-0.7z",
      "uploadedUnix": "1329943986",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ae2a7dd6dbe4fd5b1ccb6c4533dfe7cc2deb9dc3fc089e75a2703e3d05e7db7b/analysis/1406706072/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MasterMagickaRegen-10852-1-0.7z?fid=35425&ttl=1535771504&ri=8192&rs=8192&setec=de0c081b25c6fbf98562cfb146b579d3"
    }
  ]
}