{
  "modId": 10863.0,
  "modName": "Another Shadowmere Mod - Horse",
  "summary": "A slightly different set of tweeks for Shadowmere. Previously posted on the Steam Workshop. I thought I would include it here as well for the ever growing anti-workshop crowd.",
  "descriptionHtml": "A slightly different set of tweeks for Shadowmere.\r\n\r\nI know there are about a million horse mods but this one will only effect Shadowmere. All other horses will remain the same. This mod is light, stable, and unlikely to interfere with other mods (with the exception of horse mods for obvious reasons).\r\n\r\n~~~~~~~~~~\r\nFeatures\r\n\r\nShadowmere will no longer fight anything or run away from anything. She\\'ll stay where you leave her and no more having your kills stolen!\r\n\r\nShadowmere cannot die by any means and you cannot be hurt by falling when mounted on Shadowmere. Jump off cliffs and charge through battles!\r\n\r\nShadowmere also runs 20% faster than normal and can sprint/gallop for what seems like forever. Enjoy!\r\n\r\n~~~~~\r\nOther Versions\r\n\r\nIf you want Shadowmere to be ignored by all hostile NPCs and creatures check out my other version here\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=12929\r\n\r\nIf you want all your horses to be ignored by all hostile NPCs and creatures check out \\\"Oblivious Horses\\\" here\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=13036\r\n\r\n~~~~~\r\nOther Notes\r\n\r\nNo longer supported. I do not plan to purchase Hearthfire due to a personal distaste for the product and so cannot mod with the new content. This mod should still work with unexpanded Skyrim (and Dawnguard if noted as such). Sorry for any inconvenience but with this game being almost a year old I feel it\\'s time to move on to newer modding horizons. Thank you to everyone who downloaded and enjoyed my Skyrim mods. I hope to see you all again in other mod workshops. Best wishes!",
  "categoryId": "83",
  "version": "1.0",
  "author": "KahjiitRaj",
  "createdUnix": "1329952988",
  "updatedUnix": "1329953594",
  "containsAdultContent": false,
  "uploadedBy": "KahjiitRaj",
  "primaryFile": null,
  "files": [
    {
      "fileId": "35464",
      "name": "Another Shadowmere Mod",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Another Shadowmere Mod-10863-1-0.7z",
      "uploadedUnix": "1329953594",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3375935558728ffb176ff115ac8485a21a39317e58d1a286533dadff47e0a478/analysis/1406706313/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Another%20Shadowmere%20Mod-10863-1-0.7z?fid=35464&ttl=1535771524&ri=8192&rs=8192&setec=63a550659dfe812c02da2adcd738b691"
    }
  ]
}