{
  "modId": 10866.0,
  "modName": "Dragonwatch",
  "summary": "I bid you welcome to the town of Dragonwatch, this IS your new home. For what is more fitting to the Dragonborn; savior of the world, than the title of lord and the ruling of a town/fortress.",
  "descriptionHtml": "For those with the CTD issue: load an earlier save (preferably indoors) and then load your latest one again. If you experience a crash when fast traveling anywhere near Dragonwatch I would recommend that you open the console and write \\\"coc dragonwatchstables\\\" without the \\\". That will teleport you to Dragonwatch and after that everything should work fine.\r\n\r\n\r\n[size=2][center]NOTE: This mod is currently on hold. For some reason I decided to build a city, and when doing that you will experience almost every major bug in the Creation kit. So until Bethesda either fix them or some of the wonderful modder find a way around it, I will only work on it in private and not release any further updates. Hopefully this will mean that the next time you see it. We will have an almost finished mod:)\r\nFrOzeN out.[/center][/size]\r\n\r\n[center][img]http://img207.imageshack.us/img207/7479/dragonwatchbanner.png[/img][/center]\r\n[center][b]I bid you welcome to the town of Dragonwatch, this IS your new home. For what is more fitting to the Dragonborn; savior of Tamriel, \r\nthan the title of Jarl and the ruling of a town/fortress.[/b][/center]\r\n\r\nI always thought the rewards at the end of the main quest were lacking. So after getting my hands on the CK, we now have an entire town at the Dragonborn\\'s disposal. \r\n\r\n[u]Features:[/u]\r\nA completely new town.\r\nA keep/mansion as a house for the Dovahkiin.\r\n20+ new unique NPCs.\r\n3 new unique followers.\r\n\r\nDragonwatch is located just north of Rorikstead. It consists of the old and partly crumbled fortress of Dragonwatch, which has once again become inhabited and turned into a flourishing town. The entire town is divided into three separate parts; the main gate (named \\\"Dragonwatch East Gate\\\"), the keep (named Faal Dovahdein \\\"The Dragonkeep\\\") and the town/village (named Faal Dovahsahsunaar \\\"The Dragonvillage\\\").\r\n\r\nRemember; the town is FAR from finished, only the basic layout is done. The main reason for releasing it this early is to give you access to the main \\\"keep\\\", which is almost finished and should works as a home for the Dovahkiin. At first I intended for the keep to act as a lone house in the wilds, but it ended up as an entire town instead. \r\nI would recommend that you download this to get a feel for how the final result may be and also to use the keep as a home. Your feedback would be great as well, hopefully it will give me some motivation to continue working on the project.\r\n\r\n[color=red]NOTE:[/color] This is a replacement for the Talking Stone Camp (a giant camp just north of Rorikstead.) I liked the look of the area.....so I took it. This may cause some problems with the radiant quests, but I have not yet seen any proof of it.\r\nAnother thing to note is that this is an \\\"open city\\\" and therefore may (or rather will) give you an FPS hit when inside the town.\r\nMost if not all mods that affect the area around the Talking Stone Camp will conflict with this.\r\n \r\n[u]My future dreams/plans:[/u]\r\n-Finish the layout (clutter, buildings and such).\r\n-Do some work on the interior of the village (as of now it is mainly a copy/paste from other houses in Skyrim)\r\n-Add quests (for example so that you receive the town after completing the main quest.)\r\n-To make it so that you have to \\\"renovate\\\" the entire village (the same way the houses work, only much...much bigger).\r\n-To write some story about the towns origins.\r\n-A lot more that I have not yet thought about.\r\n\r\n[u]Changelog:[/u]\r\n25/2/2012 - Moved up to Beta V1. As the town now should be somewhat functional. The mod has been cleaned up and a lot of small changes to other areas have been removed. +A lot of small bugfixes.\r\n24/2/2012 - Alpha V3 is released. All buildings now have their correct names and owners, several traders and followers have been added. A carriage has been added outside the Eastern Gate. The stables have been through a rework. A few changes to the keep has been made. + Several minor fixes.\r\n23/2/2012 - Alpha V2 is released. Replaced the small farmhouse in the keep with the remains of the Dragonwatch keep \\\"Dovahgolz\\\" (Dragonstone). An early version of the Dovahgolz inside were also added. The Dragonkeep and its basement is 95% finished and should be \\\"habitable\\\" now. + some other minor changes/fixes.\r\n22/2/2012 - First Release (Alpha V1)\r\n\r\n[color=red]Known bugs:[/color]\r\n-Upon loading the mod Skyrim may \\\"not respond\\\" this is because the mod adds so many new things to the world. The easiest solution for this is to simply give it a few minutes to load. Note; it is still loading even if windows says that \\\"the program is not responding\\\". It is best that you do not touch anything for some time (depending on your computer, but it should be about a minute in most cases).\r\n-If the weapons fall off the walls or the mannequins do \\\"walking poses\\\" simply exit and reenter the building again.\r\n-Due to a bug in the Creation Kit some characters will not have the correct facial complexion.\r\n-Only the most basic navmesh is done outside of buildings, this may lead to problems with followers and hostiles in the village.\r\n-A memory bug caused by the Creation Kit will render certain buildings invisible. As of yet there is no solution for this, all we can do is to wait for Bethesda to release a fix.\r\n-Sometimes the grass will not update to the new heightmap (causing it to float in the air) - try this fix for that: \r\n\\\"Open in your documents folder Skyrim.ini AND SkyrimPrefs.ini and in the [grass] section \r\nadd the following \r\nbAllowLoadGrass=0 \r\nbAllowCreateGrass=1 \r\nbDrawShaderGrass=1 \\\"\r\nThis will force the grass to update instead of loading the default. (Thanks to OnyxNightBlack and Brendan62 for this solution)\r\n\r\n[b][center]Dahmaan aar; aav ahrk lahney, beyn ahrk dir.[/center][/b]",
  "categoryId": "53",
  "version": "BetaV1",
  "author": "MrFrOzeN",
  "createdUnix": "1329954739",
  "updatedUnix": "1330189722",
  "containsAdultContent": false,
  "uploadedBy": "MrFrOzeN",
  "primaryFile": null,
  "files": [
    {
      "fileId": "35472",
      "name": "Dragonwatch AlphaV1",
      "version": "AlphaV1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "611",
      "fileName": "Dragonwatch AlphaV1-10866.rar",
      "uploadedUnix": "1329954821",
      "modVersion": "AlphaV1",
      "virusScanUrl": "https://www.virustotal.com/file/242c8d5c75325de670ee19b276863d51af5ea1f133691fd4302ace81c7144599/analysis/1406706328/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonwatch%20AlphaV1-10866.rar?fid=35472&ttl=1535771529&ri=8192&rs=8192&setec=f894601e3f0d8fbba478acaeab5d120a"
    },
    {
      "fileId": "35790",
      "name": "Dragonwatch Alpha V2",
      "version": "AlphaV2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "773",
      "fileName": "Dragonwatch Alpha V2-10866.rar",
      "uploadedUnix": "1330016325",
      "modVersion": "AlphaV2",
      "virusScanUrl": "https://www.virustotal.com/file/e2347c48553c67cd0fe3215ecacd3d3fb408275e8abb15f2c832500a22a7fff3/analysis/1406708043/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonwatch%20Alpha%20V2-10866.rar?fid=35790&ttl=1535771529&ri=8192&rs=8192&setec=6956d4dcd9aa2c9c6f0113646c8601aa"
    },
    {
      "fileId": "36393",
      "name": "Dragonwatch Alpha V3",
      "version": "AlphaV3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "762",
      "fileName": "Dragonwatch Alpha V3-10866.rar",
      "uploadedUnix": "1330126281",
      "modVersion": "AlphaV3",
      "virusScanUrl": "https://www.virustotal.com/file/3607f7750ad2a9d539fa8acf5294e4f26b71f3be8dac511627738a2bf913e768/analysis/1406711105/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonwatch%20Alpha%20V3-10866.rar?fid=36393&ttl=1535771530&ri=8192&rs=8192&setec=fe974f8df61df8696aedb8d7880bdbaa"
    },
    {
      "fileId": "36682",
      "name": "Beta V1",
      "version": "BetaV1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "706",
      "fileName": "Beta V1-10866.rar",
      "uploadedUnix": "1330189722",
      "modVersion": "BetaV1",
      "virusScanUrl": "https://www.virustotal.com/file/6522153fb314a79214bc0e0a1a59d068701ff2b4b065b391fdd814833192ceed/analysis/1406712471/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beta%20V1-10866.rar?fid=36682&ttl=1535771530&ri=8192&rs=8192&setec=b361ebd5e03dc35023483f9234ffddb6"
    }
  ]
}