{
  "modId": 10868.0,
  "modName": "Tactless Toxins",
  "summary": "Adds a new store to the Mixwater Mill ran by the alchemist Magickius Forkus II. He sells unique poisons, potions, and temporary enchantments, which are all available for crafting as well. Also adds unique items that relate to poisons other than what is at the store.",
  "descriptionHtml": "Readme: v.1.6 Tactless Toxins **Important: Read the Lazarus Flask section&#33;**\r<br />\r<br />This mod adds a new store to the game run by the eccentric wizard\r<br />Magickius Forkus II. He sells unique poisons and potions which are all\r<br />craftable at a unique crafting station. The store is located at Mixwater Mill.\r<br />\r<br />Potions and Poisons: Craftable at the Font of Putrescence added in 1.6\r<br />\r<br />Frost Infusion: Poison that infuses your enemies with frost. They take\r<br />continual frost damage (health and stamina) and are considerably slowed.\r<br />\r<br />Shock Infusion: Potion that infuses the user with electrical energy, dealing\r<br />shock damage (health and magicka) at a continual rate, but when \r<br />damaged a chaining spark is released that deals shock damage to your attackers.\r<br />\r<br />Flame Infusion: Poison that infuses your enemies with flames. They take\r<br />continual fire damage and at the end of the effect or on their death they\r<br />release a burst of flame that damages them and anything near them, including\r<br />you.\r<br />\r<br />Mounting Poison: Lingering poison, damage rises at certain levels of the\r<br />enemies health.\r<br />\r<br />Fumbling Poison: Damages enemy stamina and whenever they are attacked they may\r<br />stagger.\r<br />\r<br />Poison of Subversion: Decreases enemy resistance to magic by 100% and another 100%\r<br />to all forms of elemental damage. ** 5 ranks **\r<br />\r<br />Delaying Poison: Low damage lingering poison that deals a high damage \r<br />poison burst at the end of the effect\r<br />\r<br />Oil of Dessication: Damages enemy Damage Resistance, only affects targets in\r<br />armor and will not affect any actor that is not hostile to you. (This effect\r<br />could be game breaking without these limitations)\r<br />\r<br />Concentrated Nightshade: Very low chance to instantly kill opponents, if it\r<br />does not kill it applies a heavy lingering poison damage effect. ** 3 ranks **\r<br />\r<br />Tiring Poison: Damages stamina completely and forces opponents to the ground.\r<br />\r<br />Wracking Poison: Applies a poison where damage from any source causes the\r<br />victim to take 5 points of poison damage for the duration.\r<br />\r<br />Venom of Flickering Madness: Enemies change rapidly through fear, calm, and frenzy\r<br />for the duration.\r<br />\r<br />Venom of Pure Madness: Enemies are randomly induced with fear, calm, or frenzy,\r<br />and then are cycled through at intervals of 10 seconds.\r<br />Note: This poison does not easily wear off, so be careful who you hit with it\r<br />and don&#39;t say I didn&#39;t warn you if you hit a follower.\r<br />\r<br />Corpse Spiders: When the victim dies they release 5 corpse spiders which\r<br />attack and poison your enemies.\r<br />Note: Corpse spiders are normally killable in one hit, and are very small and\r<br />hard to see.\r<br />\r<br />Adrenaline Shot: Potion that applies a weak slow time effect and drains stamina.\r<br />\r<br />Purified Adrenaline Shot: Second rank adrenaline, completely slows time but drains\r<br />stamina by double a regular adrenaline shot and continues to do so for awhile after\r<br />the effect wears off.\r<br />Note: This is the version used in a lazarus flask.\r<br />\r<br />Contagion: Upon contact with flesh, releases a poisonous fog that causes poison\r<br />damage to anything that walks through it.\r<br />\r<br />Vicious Contagion: Rank 2 Contagion, creates more clouds making the fog appear thicker\r<br />and giving it a wider area of effect and more damage.\r<br />\r<br />Ice Infusion: Magical poison causes victim to become frozen in place and take \r<br />continual frost damage. (health only) Frozen enemies take less damage from outside \r<br />sources. ** 2 versions, poison and potion **\r<br />\r<br />Lasting Poison: Deals low health, magicka, and stamina damage until the victim is\r<br />dead. ** 3 ranks **\r<br />Note: Measures are in place to prevent this from damaging non-hostile actors,\r<br />I don&#39;t want to break anyone&#39;s game.\r<br />\r<br />Extract of Shadow: Magical poison twists the victim&#39;s shadow into the form of\r<br />a giant cat. The shadow cat is invulnerable and will attack the victim for \r<br />the duration or until the victim is dead.\r<br />\r<br />Bottle of Nightmares: Second rank Extract of Shadow, creates 2 shadow creatures\r<br />that spit poison and attack the victim.\r<br />\r<br />Shadow Displacement: Third rank Extract of Shadow Switch positions with the victim, \r<br />leaving behind your shadow in the form of a floating axe that bleeds enemies\r<br />and causes poison damage on strike.\r<br />Notes: The axe might not immediately attack your enemy if you are warped too long\r<br />of a distance.\r<br />\r<br />Arcane Disruption: Causes the victim to burst with arcane energy at 5 second\r<br />intervals, damaging themselves and anything around them. Effect ends when\r<br />victim dies.\r<br />Note: Like the lasting poison, there are measures to prevent this from\r<br />affecting non-hostile actors.\r<br />\r<br />Potion of Blinding Rage: Doubles your melee damage output, but completely\r<br />blinds you for 15 seconds.\r<br />Note: Description now works.\r<br />\r<br />Beast Blood Potion: Turns you into a werewolf.\r<br />\r<br />Vile Concoction: Causes the victim to vomit poison that damages them and \r<br />anyone the vomit hits. ** Poison and potion version **\r<br />Suggested by: Kodiak412\r<br />Notes: Non-hostile actors will not be affected.\r<br />\r<br />Ice Diffusion: At first has an effect similar to frost infusion, and then has\r<br />a frost explosion similar to flame infusion, and afterwards the original target\r<br />is affected with Ice Infusion while all others are slowed.\r<br />Suggested by: Andellmere \r<br />\r<br />Tonic of Polymorphing: Turns your opponent into one of 5 random things.\r<br />Suggested by: Dark_ranger\r<br />Notes: No longer uses a Wabbajack type script, should have no bugs.\r<br />\r<br />Jar of Screams: Whenever an opponent strikes the user, they flee for 5 seconds.\r<br />Suggested by: Andellmere\r<br />Note: Description now shows, sound added to the effect, and no more visible\r<br />projectiles.\r<br />\r<br />Plague Enzymes: Spit poison on your enemies for 10 seconds by pressing the shout\r<br />button. The poison damages and inflict enemies with a random disease like debuff.\r<br />\r<br />Potion of Denial: Marks you as essential for the duration, if you die you fall\r<br />to your knees and enemies will ignore you. Bleedout ends after awhile\r<br />Note: No longer requires a potion, just wait it out.\r<br />\r<br />Potion of Enervation: Applies a cloak that begins to absorb the health of\r<br />enemies below 50% health.\r<br />\r<br />Elixir of Dragon&#39;s Breath: Drains all magicka while you breathe a fire breath,\r<br />frost breath, or concentrated shock beam attack.\r<br />\r<br />Neuro-Toxin: Long lasting poison has a chance to cause paralysis for 5 seconds\r<br />every 5 seconds.\r<br />Suggested by: Andellmere\r<br />Note: Be careful who you hit with this&#33; I should really just say that for everything,\r<br />shouldn&#39;t I?\r<br />\r<br />Rolling Thunder:Deals shock damage and warps you next to the victim with a\r<br />crack of thunder.\r<br />\r<br />Essence of Plague: Whenever you are wounded ghostly plague rats spring from\r<br />your wounds to attack and disease enemies.\r<br />\r<br />Knock-out Poison: Puts the enemy into a deep sleep until they are attacked.\r<br />Suggested by: Dark_ranger\r<br />Note: Will never wear off unless they take damage.\r<br />\r<br />Elixir of Peryite: Commune with the daedric lord of pestilence to randomly \r<br />kill yourself or one of anything around you. If you survive your vision is \r<br />addled for two minutes.\r<br />\r<br />Toxin of Ferocity: Long lasting frenzy effect, enemies have their damage output\r<br />increased.\r<br />Notes: Only affects actors who are hostile to you.\r<br />Requested by: Kodiak412\r<br />\r<br />Dragonsbane: Poison that prevents dragons from flying for 30 seconds.\r<br />\r<br />Draught of Earthshaking: Repeatedly shakes the earth beneath the user, you and\r<br />anything around you are damaged and greatly staggered with each shake.\r<br />\r<br />Oil of Impact: Increases the impact of your next attack, dealing increased\r<br />damage and blowing the victim backwards. Doesn&#39;t knock down dragons, mammoths, etc.\r<br />\r<br />Bloodmoon Elixir: Second rank beastblood potion, turns the user into a werewolf\r<br />and summons a pack of werewolves to fight with you. If you&#39;re outside when you drink\r<br />the potion the bloodmoon will rise in the sky.\r<br />Notes: The bloodmoon weather and werewolves often don&#39;t stick around as long as they&#39;re\r<br />supposed to.\r<br />\r<br />Shock Diffusion: Creates an electrical explosion that damages any surrounding targets and releases \r<br />up to 5 sparks which then fire lightning bolts back at the original target.\r<br />Notes: The effects of the sparks can be very random and can range from nothing at all to completely\r<br />devastating. I recommend using this with a bow because the sparks do a ton of damage if they go\r<br />off and can hit you if you aren&#39;t careful.\r<br />\r<br />Clustering Flame: The target releases a clustering explosion of flame, the explosions will damage the\r<br />victim and anything else that is near.\r<br />\r<br />\r<br />_____________________________________\r<br />\r<br />Weapon Coatings: These are temporary enchantments, they require your weapon to\r<br />be unenchanted. Have multiple resistance values which I will list. For example\r<br />an undead opponent will not take poison damage, but will not pass a fire resistance\r<br />check if that coating has another effect with fire resistance. All coatings last \r<br />for 5 minutes, but will end upon sheathing your weapon. ** Craftable at the Font of Putrescence **\r<br />\r<br />Standard Coatings: I may add coatings that are clones of vanilla Skyrim enchantments\r<br />if people are interested, but as of now there are none of these.\r<br />\r<br />Coating of Sorrow: Applies a 10 poison damage per second DoT and slows\r<br />enemies by 50% for 5 seconds\r<br />Resistances: The damage effect has poison resistance, the slowing effect has\r<br />frost resistance.\r<br />\r<br />Coating of Infused Frost: Deals 15 frost damage (health and stamina) per strike\r<br />and slows enemies by 80% for 3 seconds.\r<br />Resitances: Frost resistance only.\r<br />\r<br />Coating of Infused Shock: On striking an enemy they release a spark that jumps\r<br />to other enemies, the spark deals shock damage (health and magicka) \r<br />to anything it hits.\r<br />Resistances: Shock resistance only.\r<br />Notes: Might bug out, but I think I&#39;ve fixed any issues with this. If something\r<br />weird happens after awhile when using this be sure to tell me.\r<br />\r<br />Coating of Necrosis: Applies a low damage disease DoT and lowers damage \r<br />resistance by 25% for 5 seconds.\r<br />Resistances: Disease only.\r<br />Notes: It is safe to hit followers and non-hostiles with this, they will recover.\r<br />\r<br />Coating of Nightshade: Low chance to instantly kill enemies below 75% health\r<br />with each strike, if it does not kill poison damage is added to your strike.\r<br />Resistances: Poison only.\r<br />\r<br />Coating of Consecration: Turns and Burns the Undead, may also disintegrate them\r<br />if you strike them when their health is low enough.\r<br />Resistances: Only affects the Undead and will not harm anything else.\r<br />\r<br />Coating of Stendarr: Damages daedra and the undead, turns daedra as well.\r<br />Resistances: Only affects daedra and the undead.\r<br />\r<br />Coating of Jarrin Root: Lowers an enemies poison resistance and deals low damage,\r<br />the poison resistance will stack with each consecutive strike and increase the\r<br />damage of the secondary effect.\r<br />Resistances: Poison only\r<br />\r<br />Coating of Scorching: Burns your enemies and the heat from your weapon may cause\r<br />them to drop their own with each strike.\r<br />Resistances: Fire only\r<br />Note: All descriptions working.\r<br />\r<br />Coating of Hunger Spittle: Drains your enemies vital essences with each strike and\r<br />transfers them to you.\r<br />Resistances: Magic only.\r<br />\r<br />Coating of Fluid Motion: Increases your attack speed and adds physical damage\r<br />to your weapon.\r<br />Resistances: The extra damage counts as weapon damage, so anything that resists\r<br />weapon damage will resist the added damage.\r<br />\r<br />Coating of the Necromancer: Decreases enemy resistance to magic, and upon striking\r<br />a dead body it ressurects to fight for you. Can only have one thrall at a time.\r<br />Resistances: None\r<br />\r<br />Coating of Hemmorhaging: Causings bleeding in enemies, and may cause humans to enter\r<br />a bleedout causing them to take even more bleeding damage.\r<br />Resistances: Non-hostile actors will not enter the bleedout, undead enemies and \r<br />dwarven machines do not bleed and will not take damage or be affected by the bleedout.\r<br />\r<br />Coating of Jolting: Deals Shock damage (magicka and health) and has a chance to cause\r<br />staggering with each strike.\r<br />Resistances: Shock only.\r<br />\r<br />Coating of Madness: Induce your enemies with fear, calm, or frenzy on strike. Can also\r<br />switch between them on strike.\r<br />Resistances: Magic and normal illusion spell resistance.\r<br />\r<br />Coating of Rigor Mortis: Chance to induce paralysis on strike, if an enemy is\r<br />paralyzed they take massive physical damage for the duration.\r<br />Resistance: The damage dealt is negated by damage resistance.\r<br />\r<br />Coating of Ignition: Ignites the ground below your enemy, any enemies that\r<br />walk through the ignited ground take fire damage.\r<br />\r<br />Coating of Rusting: Damages armor of dwarven machines and anyone in heavy armor\r<br />and also deals health damage to dwarven machines.\r<br />\r<br />Coating of Lulling: On strike might lull the victim into a deep sleep until \r<br />they are damaged.\r<br />\r<br />Coating of Pestilence: On strike induces a random disease, can place up to 5\r<br />diseases on your enemies.\r<br />Note: One of the diseases has stun-locking potential, this is intended. It \r<br />shouldn&#39;t happen every time but there is a chance.\r<br />\r<br />Coating of Soulrending: Rend the soul of your enemy on strike, causes soul trap\r<br />and also has a chance to banish them to another location.\r<br />Note: The banishment is permanent and they are literally banished to a location\r<br />I&#39;ve created. Essential actors and dead bodies cannot be banished.\r<br />Suggested by: trippdoll\r<br />\r<br />Coating of the Hedgewizard: 50% chance to steal an enemy&#39;s equipped spells on strike and cast them\r<br />for your benefit, also absorbs a small amount of magicka.\r<br />Notes: Will probably be more useful if you have a mod that alters the spells enemies cast.\r<br />Also, this interrupts any spell yo&#39;re casting 5 seconds after striking an enemy, this is to\r<br />prevent spells like frostbite from casting in an infinite loop.\r<br />\r<br />__________________________________\r<br />\r<br />The Lazarus Flasks: \r<br />\r<br />These are self refilling versions of nearly every item included. To use them\r<br />activate them like any other item, but be careful that you want to use it before\r<br />you do as it will be used up even if you aren&#39;t eligble to use it at the moment.\r<br />After that an empty flask is added to your inventory, it weighs the same as the \r<br />potion and you can just drop it if you don&#39;t care about immersion or balance. After\r<br />30 minutes (time is a little weird and doesn&#39;t go as fast as it should if you wait\r<br />or fast travel) you will recieve a message that your flask has been refilled\r<br />and you are then free to use it again.\r<br />\r<br />You can have up to five of these. To make one you need to \r<br />find a flask mold which are placed at five different areas around Skyrim. Once\r<br />you find a mold you can make a flask at the blacksmith forge, if you decide that\r<br />you do not want the flask you have chosen you can take it down to a smelter and\r<br />get another mold in exchange for the unwanted flask, but you will not get any\r<br />other items back that were required to forge it.\r<br />\r<br />** As of V1.6 the crafting recipes for the flasks will only show up at the blacksmith\r<br />when you have at least one flask mold in your inventory. Also, the smelting recipes\r<br />will only show if you have a flask as well as some blacksmithing tongs that have been placed near smelters. **\r<br />\r<br />IMPORTANT: DO NOT MAKE TWO OF THE SAME FLASK&#33; If you do, smelt one of them back\r<br />into a mold or reload your save, but do not use them both at the same time or\r<br />something very bad will happen&#33; Very bad&#33; I warned you&#33; Don&#39;t do it&#33;\r<br />__________________________________\r<br />\r<br />The Cauldron of Peryite:\r<br />\r<br />This item grants gives you access to an inventory to place your poisons inside of,\r<br />but only while it is in YOUR inventory. Also, I don&#39;t recommend placing it inside\r<br />of itself because you will lose access to the inventory and you will be unable to\r<br />retrieve it. This item can be found at the Shrine of Peryite.\r<br />\r<br />Will be updated for even easier access if I ever figure out a proper script.\r<br />\r<br />___________________________________\r<br />\r<br />The Poison Stones:\r<br />\r<br />Spread around Skyrim, these stones can be equipped in the apparel section of the menu.\r<br />They take up a custom equipment slot that only allows you to equip one at a time. What\r<br />they do is add a permanent buff to any weapon you have equipped which will add an extra\r<br />effect such as damage or other effects. These effects are minor and mostly simple, comparable \r<br />to a level 1 vanilla enchantment. The buff is only applied while you have the stone equipped, \r<br />unequipping the stone will remove the buff until you equip it again and you can also \r<br />switch stones at any time if you have more than one with you.\r<br />\r<br />Stone of Flame: Applies a fire DoT, dealing 2 damage every second for 5 seconds.\r<br />\r<br />Stone of Frost: Deals 5 frost damage to health and stamina, and slows by 25% for 5 seconds.\r<br />\r<br />Stone of Shock: Deals 5 shock damage to health and magicka, and has a low chance to inflict paralysis for 2 seconds.\r<br />\r<br />Stone of Venom: Deals 5 poison damage every second for 5 seconds.\r<br />\r<br />Stone of the Elements: Lowers enemy resistances to fire, frost, and shock by 10% for 5 seconds.\r<br />\r<br />Stone of Souls: Killing blows with weapons will trap the victim&#39;s soul.\r<br />\r<br />Stone of Light: Deals 5 fire damage every second for 5 seconds to undead, and has a low chance to turn them.\r<br />\r<br />Stone of Life: Absorbs 1-5 points of health, magicka, and stamina on strike.\r<br />\r<br />Stone of Vanishing: Chance to make you invisible and muffled for _ seconds on strike.\r<br />\r<br />Stone of the Conjurer: Low chance to summon 1 of the 3 elemental atronachs to aid you.\r<br />\r<br />Stone of Fear: Low chance to cause enemies to run in fear.\r<br />\r<br />Stone of Calming: Low chance to calm enemies.\r<br />\r<br />Stone of Fury: Low chance to frenzy enemies.\r<br />\r<br />Stone of Weakness: Damages enemy stamina, if their stamina becomes completely drained they may fall over when attacked.\r<br />\r<br />Stone of Luck: Grants an increased 25% critical chance and a 20% increase to critical damage to any weapon you use.\r<br />\r<br />Stone of Ice: Low chance to freeze opponents in place, which increases their resistances to all forms of damage and deals frost damage, for 5 seconds.\r<br />\r<br />Stone of Disarming: May disarm enemies on strike.\r<br />\r<br />Stone of Time: May heighten your reflexes for a short duration on strike. (Near equivalent to the Quick Reflexes perk)\r<br />\r<br />Stone of Sentience: Unique stone that changes it&#39;s attack based on you and your enemies resistances and properties. This is the most powerful stone and cannot be found, to get it you must find all the other stones and the Catalyst of Sentience hidden similarly to the stones), then you will be able to craft it at a font of putrescence. Will always add some kind of damage to your attack.\r<br />Notes: Has many effects depending on your enemies health and resistances, and your own. If your health is low you will absorb health, if the enemy&#39;s health is low their soul will be trapped, if they are weak to fire it will deal fire damage, if you have a higher level than your enemy they may be feared, etc. The criticals bonus from luck is also passively active.\r<br />_________________________________\r<br />\r<br />Recipe Books:\r<br />\r<br />As of v1.6 all recipes require a respective recipe book to be read in order for you to be able to craft the item. Recipe books\r<br />can be found in numerous places and some are added to various leveled lists as loot and as purchasable\r<br />items at apothecary stores. If you aren&#39;t interested in acquiring the recipes the books are worth double the price of the item whose recipe \r<br />they teach, so you can just sell them for a pretty good price.\r<br />\r<br />** Recipe books work by adding an ability to your character, like a permanent spell. Do not manually dispel any of these spells or you will lose the recipes,\r<br />they won&#39;t show in your UI but I&#39;m just making it clear that if you find these things through some kind of a refscope mod don&#39;t remove them. **\r<br />\r<br />__________________________\r<br />\r<br />The Font of Putrescence:\r<br />\r<br />This is a unique crafting station where all the poisons and weapon coatings are now made, one can be found in the store and there you can also purchase\r<br />the Skull of Putrescence which will allow you to call a Font to your location no matter where you are. In Whiterun there is one in Dragonsreach, in Winterhold \r<br />there are several at the college, in all the other cities there is one in the apothecary shops, and there are also many placed near alchemy workbenches around \r<br />Skyrim. There are over 80 of them so you don&#39;t have to use the spell if you don&#39;t want to.\r<br />\r<br />The positioning of a summoned font depends on the way your camera is looking, if you are looking straight ahead the font will be summoned standing up straight\r<br />and correct, but if you are looking up or down at an angle the font will still be summoned but it will look all lopsided and weird. It still works no matter what,\r<br />it just looks funny and I figured I should explain why.\r<br />\r<br />* I will not be adding any of these to player homes, if you want to do it yourself it is very easy. Just open the CK and set this mod as your active file and then\r<br />search in the object window for TTPoisonFont. In the cell view window select the cell you want to place the font in and then double click it to set it to the render\r<br />window. After that drag the item from the object window into the area you want it at in the render window and that&#39;s that.\r<br />\r<br />\r<br />Known Issues: \r<br />-Reported issues with Stone of Souls, might not work properly\r<br />-Enemies infected by a lot of disease debuffs might not play the\r<br />correct death animations, I don&#39;t really know what the deal with that is, but\r<br />it isn&#39;t that big of a problem.\r<br />-If you use two of the same Lazarus Flask it will glitch and you can lose one\r<br />of them, just don&#39;t do it and save me a whole heap of problems.\r<br />-If Boodmoon Elixir&#39;s corresponding magic effect is not off of your character\r<br />and you drink the potion again, the werewolf summons will become hostile and attack\r<br />you. This shouldn&#39;t happen as the effect should be off by the time you turn back.\r<br />-The Poison Stones don&#39;t have havok data if you drop them from your inventory, so\r<br />they&#39;ll just float there... I don&#39;t know how to fix that, really.\r<br />-If you use an enchantment table while your weapon has a coating applied to it, you will be able to disenchant your weapon and it will be permanently stuck on there. I&#39;d suggest just sheathing the weapon or otherwise do something to remove the effect before you use the enchanting table.\r<br />\r<br />v1.2:\r<br />-Added several new poisons and potions\r<br />-Added a new series of items called weapon coatings\r<br />-Changed the aggression on Shadow Cat and Corpse Spiders so they shouldn&#39;t attack you over enemies\r<br />-Removed Necromancer&#39;s Vial, replaced it with a weapon coating with a similar effect\r<br />-Issues with the werewolf potion fixed, it&#39;s now in the mod\r<br />-Changed the names for every item to include TT, allows for better sorting\r<br />\r<br />v1.3:\r<br />-Moar potions, poisons, and weapon coats\r<br />-Descriptions on everything are now working\r<br />-Changes to Jar of Screams, sound added to it and annoying projectile colors removed\r<br />\r<br />v1.4:\r<br />-Added a few more poisons and a weapon coating\r<br />-Added the Lazarus Flasks and Cauldron of Peryite\r<br />\r<br />v1.5:\r<br />-Altered some values on items that weren&#39;t doing the correct damage when they had dual value modifiers.\r<br />-Added just a couple more potions, poisons, and weapon coatings\r<br />-Potion of denial changed, it no longer requires a potion and will properly remove you from a bleedout on its own and\r<br />it now has a crafting recipe.\r<br />\r<br />v1.6:\r<br />-Added the Vicious Contagion poison\r<br />-Changes to Tonic of Polymorphing, should now work properly in any situation.\r<br />-Added the Poison Stone items\r<br />-Added filters to the flask recipes at the forge and smelter, the recipes will only show when you have a mold for the forge and\r<br />when you have a flask for the smelter as well as a pair of blacksmithing tongs.\r<br />-Added recipe books, you can find or buy these and then read them to unlock the recipes for the poisons.\r<br />-Added the Font of Putrescence, use this to craft the poisons once you obtain their recipes",
  "categoryId": "94",
  "version": "v1.6.1",
  "author": "Magicfork",
  "createdUnix": "1329955561",
  "updatedUnix": "1337964066",
  "containsAdultContent": false,
  "uploadedBy": "MagicFork",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39729",
      "name": "Tactless Toxins v1-3",
      "version": "v1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "93",
      "fileName": "Tactless Toxins v1-3-10868.zip",
      "uploadedUnix": "1330814630",
      "modVersion": "v1.3",
      "virusScanUrl": "https://www.virustotal.com/file/e0f8586015cc321c4a7f0efcaf5c3a322694b94b8e975def18f19195d5cca50e/analysis/1406728032/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tactless%20Toxins%20v1-3-10868.zip?fid=39729&ttl=1535771539&ri=8192&rs=8192&setec=16dc770a60a32580905a99167de30143"
    },
    {
      "fileId": "42649",
      "name": "Tactless Toxins v1-4",
      "version": "v1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "350",
      "fileName": "Tactless Toxins v1-4-10868.zip",
      "uploadedUnix": "1331563672",
      "modVersion": "v1.4",
      "virusScanUrl": "https://www.virustotal.com/file/911e8fef96aab5ec42e2ce28308ec3d5a393a35ad8ce103257e9f515e75889da/analysis/1406745248/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tactless%20Toxins%20v1-4-10868.zip?fid=42649&ttl=1535771539&ri=8192&rs=8192&setec=09f138fa9296e5dd71b52daf5c35e334"
    },
    {
      "fileId": "44855",
      "name": "Tactless Toxins v1-5",
      "version": "v1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "355",
      "fileName": "Tactless Toxins v1-5-10868.rar",
      "uploadedUnix": "1332182845",
      "modVersion": "v1.5",
      "virusScanUrl": "https://www.virustotal.com/file/d599f44c53de90970080fbdb0a031e950d1e98e7c2f59698d6f318262962047f/analysis/1406768345/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tactless%20Toxins%20v1-5-10868.rar?fid=44855&ttl=1535771540&ri=8192&rs=8192&setec=787ff9c84c9241690cc0e38719f59b69"
    },
    {
      "fileId": "48257",
      "name": "Tactless Toxins v1-6",
      "version": "v1.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1391",
      "fileName": "Tactless Toxins v1-6-10868.zip",
      "uploadedUnix": "1333131675",
      "modVersion": "v1.6",
      "virusScanUrl": "https://www.virustotal.com/file/b3bfe5a861500da2428a2f83263973f5b7def2747984ce818ffe6f88ef845623/analysis/1406787793/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tactless%20Toxins%20v1-6-10868.zip?fid=48257&ttl=1535771541&ri=8192&rs=8192&setec=4e9bcb3a5b9eda510e75960b3f542031"
    },
    {
      "fileId": "63586",
      "name": "Tactless Toxins v1-6-1",
      "version": "v1.6.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1304",
      "fileName": "Tactless Toxins v1-6-1-10868-v1-6-1.rar",
      "uploadedUnix": "1337964066",
      "modVersion": "v1.6.1",
      "virusScanUrl": "https://www.virustotal.com/file/df3b8833d0d4bda49e79ec8ee798364a57b478eebd975958986b0aa86096b21c/analysis/1406914629/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tactless%20Toxins%20v1-6-1-10868-v1-6-1.rar?fid=63586&ttl=1535771541&ri=8192&rs=8192&setec=c9658f6fcba91d5e9eb622ec13a3294d"
    }
  ]
}