{
  "modId": 10878.0,
  "modName": "Breezehome Basement Redux",
  "summary": "This mod adds a cozy Basement to Breezehome. This mod is an edited version of Ekkii\\'s Basement and Spousal Life mod. It is for those who are looking for something realistic and not \\'OP\\'. Care was taken to make it look as natural as possible. The entrance is right below the stairs in the dining room.",
  "descriptionHtml": "[b][size=5][center]BREEZEHOME BASEMENT REDUX[/center][/size][/b]\r\n[b][size=3][center]Version 0.04a -Complete Package-[/center][/size][/b]\r\n\r\n[b][size=4]WHAT IS THIS MOD?[/size][/b]\r\n\r\nThis is the most realistic and laid back basement mod around. Inspired and based off of Ekkii\\'s Basement mod, this basement is in the same foundational footprint as Breezehome above it. It is not large but any means but it is a space that you\\'d want to live in. You won\\'t feel like you\\'re cheating.\r\n\r\n[b]This mod includes the Ekkii\\'s Spouse Life mod addition. That means when you get married your spouse can work at the market stall and hang out in the basement.\r\n\r\nThe mod works fine as a standalone as well for those not planning on getting married.[/b]\r\n\r\nThe space is divided into two sections: The Workshop, and the Living Area.\r\n\r\nThe Workshop includes an Anvil, a Workbench, a Tanning Rack, a Grinding Wheel, and an Enchanting Table. [b]Sorry, there is no smelter.[/b]\r\n\r\nThe workshop is also the gear display area which includes two working mannequins, one male and one female. There is also two up-right weapon racks beside the mannequins and a display case by the Enchanting Table.\r\n\r\nThere is a large chest and two barrels in the workshop for your crafting stuff or whatever you want to store there.\r\n\r\n[b]By request there is now a magical \\'safe\\' beside the Enchanter\\'s table. It\\'s super snazzy![/b]\r\n\r\nThe second space is the Den slash Library slash relaxing zone. It has 4 working book shelves. Two tall ones with 7 separate shelves combined. There is a custom-made \\'Mammoth\\' shelf (credit to Ekkii) above the desk, and a lectern with a top display spot.\r\n\r\nThere is one long fancy looking chest to hold nicer gear. There is a fancy strongbox on the desk perfect for notes, gems, and jewelry.\r\n\r\nI placed a new navmesh by hand and made an overall sweep of asset placement to make everything grid friendly and lighting friendly.\r\n\r\nThere should be no shadow striping.\r\n\r\n[b][size=4][color=red]This mod is currently INCOMPATIBLE with the Hearthfire DLC. Sorry about that. [/color][/size][/b]\r\n\r\n[b][size=3]Thanks to Ekkii, elgatoenlaluna and Thepal[/size][/b]\r\n\r\nThis mod is based primarily on the [url=file.php?id=9000]Ekkii Breezehome Basement[/url] mod.\r\n\r\nThanks to Ekkii for giving me permission to upload this, and thanks to elgatoenlaluna for uploading the original mod and discussing things with me.\r\n\r\nThanks to Thepal for letting me include the new actor based on his work.\r\n\r\n[b][size=4]Is this mod OP?[/size][/b]\r\n\r\nI don\\'t believe this mod will break any sense of immersion or difficulty. Essentially this mod will allow you to not have to run up to Dragon\\'s Reach to enchant or use the War Maiden\\'s tanning rack or forge. You will still need to use their smelter though.\r\n\r\nThere is no option to buy the basement from the Jarl\\'s steward, but I feel the 5000 gp purchase price is enough of an investment of player\\'s time to be rewarded with a working basement. In other words, if you buy Breezehome you get this standard. I may add the option to buy it later. If you really feel that bad you can always give away your gold :D\r\n\r\nThis mod will work fine regardless if you have or have not bought Breezehome already.\r\n\r\nThere is practically no saleable clutter, and no gear/treasure items pre-placed the character can use.\r\n\r\nThe space has been beautified and made to look like someone wants to live there and does live there. I hope you enjoy your new basement.\r\n\r\nThanks for checking it out!\r\n\r\n[b][size=4]INSTALLATION[/size][/b]\r\n\r\nUsers updating from 0.02a or 0.03 will need to grab everything they currently have in the basement and create a save outside of it before switching to the new mod. Sorry about that. I am happy enough with the mod now that it has a finalized name and no version appended to the file name. All versions going forward will share the same name and therefore the game won\\'t complain that you are loading without a previously installed mod. A little pain now so all future updates will be painless.\r\n\r\nNew users can just install as per normal with NMM or manually.\r\n\r\nIf you have the Original Ekkii Basement mod then this one is a complete replacement. You can switch back and forth between them with NMM or uninstall Ekkii\\'s manually and install this one instead. Note: this is a replacement for the combo mod with the Spousal Life addition.\r\n\r\nExtract the .esp file into your DATA folder, then sort the mod in NMM or by hand in the load files (see forums for instructions). You can add the file through NMM with the add file function, or self extract it.\r\n\r\nThis mod works with Ekkii\\'s spouse mod and aims to add a few more interactables (now a word) to the area. It will also work on its own and should allow Lydia even if she is not married to hang out downstairs if she is not following you.\r\n\r\n[b][size=4]Change Log[/size][/b]\r\n\r\nver 0.04a 14:00-03-22-2012\r\n          -Renamed femalehead.nif to femalemannequinhead.nif this should solve any issues users with custom female nord replacements that used the same name were having.\r\n\r\nver 0.04 18:00-03-04-2012\r\n          -Packaged the female mannequin assets with mod. No secondary downloads required.\r\n          -Created a new Enchanter\\'s Safe out of the magic glowing flange that is beside the table. Placed it in/on the wall.\r\n          -Adjusted the navmesh to reduce Lydia or other NPCs bumping into stuff.\r\n          -Added small shelf beside Enchantment table. Increased the scale of the one above the display case.\r\n          -Added a Bonzai Sakura in a pot beside the Enchantment table.\r\n          -Added some vines and moss to the wall behind the Enchantment table, changed lighting above table.\r\n          -Improved Lighting quality in workshop area.\r\n\r\nver 0.03 23:15-02-23-2012\r\n          -Created a new actor class with a female mannequin (manakin or manekin...people at Bethesda can\\'t spell and they spelled it 3 different ways in the game), used thepal\\'s female mannequin mod as a guide.\r\n          -replaced the NE corner male mannequin with a female one.\r\n\r\nver 0.02a 7:00-02-23-2012\r\n          -Adjusted one of the mannequins which seemed to be causing an invisible collision.\r\n\r\nver 0.02 5:30-02-23-2012\r\n          -Fixed the scale and position of the the ladder leading back upstairs. It was floating below the ceiling.\r\n          -Added a soft yellow light to the workshop to make things a tad more visible.\r\n          -Added a small ruin pedestal above the lectern for placing a found oddity on.\r\n          -Added a partially constructed wooden wall behind the barrels to look like a renovation that never got completed.\r\n          -Added cobwebs to a few corners\r\n          -Updated to Ekkii\\'s latest bug free spousal mod version 0.81\r\n\r\nver 0.01 Initial release\r\n\r\n[b][size=4]POTENTIAL CONFLICTS[/size][/b]\r\n\r\nNew BOSS ordering seems to be recognized and NMM is working to order these correctly. So the below conflict should no longer be an issue unless you hand load the mods and create your own plugin.txt and loadorder.txt files. If so, then note below.\r\n\r\nSuggest to load near the top of your list.\r\n\r\n[b]Notes for people with Companion mods:[/b] Make sure that any companion mods you have are placed after this one in the stack. So that means where the Skyrim.esm is at the top, this mod would be below that but above the \\'Followers Can Wear ZAZZ\\', or \\'Visible Companion Bows\\', or now inclusive UFO.\r\n\r\nAny mods that add a trap door in the same spot in Breezehome will obviously conflict.\r\n\r\n[b][size=4]Known Issues[/size][/b]\r\n\r\nAs with some other mods, the mannequins can sometimes move when you enter the space the second time if you had not already placed items on them. This has only happened once for me and the mannequin snapped back to where it should be when I pressed \\'e\\' where it normally stands. If it happens don\\'t panic, it will resolve itself and the chances of it occurring seem very low.\r\n\r\n[b]Contact me with any questions or requests.[/b]\r\n\r\n\r\n[b][size=4]CREDITS[/size][/b]\r\n\r\nEkkii\r\nelgatoenlaluna\r\nthepal\r\nYotrig for his youtube tuts\r\nBethesda\r\nNexusmods\r\nBethesda Video Tutorials\r\nBethesda Wiki\r\nOther house mods I cracked open to see how they did things. Though nothing was borrowed from them.",
  "categoryId": "67",
  "version": "0.04a",
  "author": "Aelquias",
  "createdUnix": "1329959466",
  "updatedUnix": "1332451460",
  "containsAdultContent": false,
  "uploadedBy": "Aelquias",
  "primaryFile": null,
  "files": [
    {
      "fileId": "45808",
      "name": "Breezehome Basement Redux ver 0-04a",
      "version": "0.04a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3151",
      "fileName": "Breezehome Basement Redux ver 0-04a-10878.zip",
      "uploadedUnix": "1332451460",
      "modVersion": "0.04a",
      "virusScanUrl": "https://www.virustotal.com/file/72c6e042b2984ce4613ea5f04caa06a93e41f55ebb34aa7265d6c340e7b70948/analysis/1406773707/",
      "changelogHtml": " Renamed femalehead.nif to femalemannequinhead.nif this should solve any issues users with custom female nord replacements that used the same name were having. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezehome%20Basement%20Redux%20ver%200-04a-10878.zip?fid=45808&ttl=1535771556&ri=8192&rs=8192&setec=4f0b27d5794590f798a33b8b7afcf750"
    }
  ]
}