{
  "modId": 10892.0,
  "modName": "Enchanted Bound Weapons",
  "summary": "Adds perks to the Conjuration & Enchanting trees which improve all of your Bound weapons with enchantments and other abilities.\r\nThis aims to make Bound weapons more viable for higher level characters who wish to use Bound weapons throughout their playthrough.",
  "descriptionHtml": "[b][size=4]Bugfix & Tweak version 0.21 is now out. If you have 0.20 please download 0.21 as some perks had a condition error that made them behave improperly.[/size][/b]\r\n--Thanks to NeoSeether for bug reports.\r\n\r\n---[b][size=5]What does this mod do?[/size][/b]\r\nThis mod adds [b]4 new perks[/b] to the [b]Enchanting[/b] tree, and [b]5 new perks[/b] to the [b]Conjuration[/b] tree, all of which improve your [b]Bound[/b] weaponry. Your character can spend up to 10 perk points in total on these custom perks if you so desire.\r\nIn the Enchanting tree you may [b]choose either Fire, Frost or Storm[/b] as your second enchantment, in addition to the draining enchantment perk you acquire before that. Choosing one of the elements [b]locks out[/b] the other two, so consider well which you would like.\r\n\r\nRefer to the images section to see how it looks on the perk star maps.\r\n\r\n---[b][size=5]What do the perks do?[/size][/b]\r\n[color=2590ff][b][size=17][u]ENCHANTMENT PERKS[/u][/size][/b][/color]\r\n[size=3]Perk: [b]Essence Binding[/b], Ranks: 2.[/size]\r\nRank 1:\r\nPrerequisite: 30 Enchanting.\r\nEffect: Adds an enchantment to your Bound weapons causing strikes to Absorb 3 (4 for Bound Battleaxe) Health and Magicka from the target. Your character gains the same amount of Health and Magicka that was absorbed by the strike.\r\nRank 2:\r\nPrerequisite: 70 Enchanting.\r\nEffect: The absorbing enchantment becomes more powerful, absorbing 10 (13 for Bound Battleaxe) Health and Magicka with each strike.\r\n-----\r\n[size=3]Perk: [b]Fire Binding[/b], Ranks: 2.[/size]\r\nRank 1:\r\nPrerequisites: 40 Enchanting, Essence Binding.\r\n[color=ff4436][b][i]Excludes: Frost Binding, Storm Binding.[/b][/i][/color]\r\nEffect: Adds an enchantment to your Bound weapons causing strikes to deal 6 (7 for Bound Battleaxe) Fire damage, lighting targets of fire in the process, causing them to burn for a small amount of additional damage.\r\nRank 2:\r\nPrerequisites: 80 Enchanting.\r\nEffect: The Fire enchantment becomes more powerful, dealing 20 (24 for Bound Battleaxe) Fire Damage and a greater amount of additional burning damage.\r\n-----\r\n[size=3]Perk: [b]Frost Binding[/b], Ranks: 2.[/size]\r\nRank 1:\r\nPrerequisites: 40 Enchanting, Essence Binding.\r\n[color=ff4436][b][i]Excludes: Fire Binding, Storm Binding.[/b][/i][/color]\r\nEffect: Adds an enchantment to your Bound weapons causing strikes to deal 6 (7 for Bound Battleaxe) Frost damage to both Health and Stamina, as well as slightly slowing down targets for 3 seconds (4 seconds for Bound Battleaxe).\r\nRank 2:\r\nPrerequisites: 80 Enchanting.\r\nEffect: The Frost enchantment becomes more powerful, dealing 20 (24 for Bound Battleaxe) Frost Damage to both Health and Stamina and increasing the time enemies are slowed by 1 second.\r\n-----\r\n[size=3]Perk: [b]Storm Binding[/b], Ranks: 2.[/size]\r\nRank 1:\r\nPrerequisites: 40 Enchanting, Essence Binding.\r\n[color=ff4436][b][i]Excludes: Fire Binding, Frost Binding.[/b][/i][/color]\r\nEffect: Adds an enchantment to your Bound weapons causing strikes to deal 6 (7 for Bound Battleaxe) Shock damage to Health and half that damage to the Magicka of the target.\r\nRank 2:\r\nPrerequisites: 80 Enchanting.\r\nEffect: The Shock enchantment becomes more powerful, dealing 20 (24 for Bound Battleaxe) Shock Damage to Health and half that damage to the Magicka of the target.\r\n-----\r\n[color=8240ff][b][size=17][u]CONJURATION PERKS[/u][/size][/b][/color]\r\n[size=3]Perk: [b]Nirn Binding[/b], Ranks: 2.[/size]\r\nRank 1:\r\nPrerequisites: 30 Conjuration, Mystic Binding.\r\nEffect: Increases the stability of your Bound weapons, allowing them to be summoned for twice as long before disappearing. (Note the base duration for Bound weapons is 120 seconds)\r\nRank 2:\r\nPrerequisites: 60 Conjuration.\r\nEffect: Further increases Bound weapon stability, allowing them to be summoned for four times the normal duration.\r\n-----\r\n[size=3]Perk: [b]Ghastly Binding[/b], Ranks: 1.[/size]\r\nPrerequisites: 70 Conjuration, Soul Stealer.\r\nEffect: Causes horrid, evil energies to manifest within you Bound weapons, giving a 5% chance that a strike will paralyse its victim. (The Bound Battleaxe has a 7% chance)\r\n-----\r\n[size=3]Perk: [b]Ethereal Binding[/b], Ranks: 1.[/size]\r\nPrerequisites: 80 Conjuration, Nirn Binding.\r\nEffect: Grants your Bound weapons the ability to slightly phase through enemies, allowing strikes to ignore 40% of the target\\'s armour.\r\n-----\r\n[size=3]Perk: [b]Enslave Impish Ethersmith[/b], Ranks: 1.[/size]\r\nPrerequisites: 90 Conjuration, Oblivion Binding.\r\nEffect: Using your mastery of Conjuration magic you are able to remotely bend the will of an Imp in Mehrunes Dagon\\'s Deadlands to endlessly forge Legendary quality Bound weapons for you to summon. This improves your Bound weapon damage in the same way that a master blacksmith improves corporeal weapons.\r\n-----\r\n[size=3]Perk: [b]Reaper\\'s Gift[/b], Ranks: 1.[/size]\r\nPrerequisites: 100 Conjuration, Ethereal Binding.\r\nEffect: Deadly energies from Oblivion swell within your Bound weapons, causing them to deal 35% more damage.\r\n-----\r\n---[b][size=5]Why did you create this mod?[/size][/b]\r\nIn the vanilla game Bound weapons are pretty inconsistent in their usefulness, since for low level character they are extremely powerful (especially the Bound Bow), but as your character improves their Smithing and Enchanting skills they become less and less useful compared to their corporeal counterparts, until you reach the stage where you\\'re able to create Legendary Daedric enchanted weapons which are atleast three times stronger than Bound weapons with the Mystic Binding perk.\r\n\r\nI aim to make it so you may choose to continue making your Bound weapons stronger as you progress, and this mod takes just a small step in that direction.\r\nI intend to continue expanding upon this mod, releasing updated versions when I find the time to do so.\r\n\r\n---[b][size=5]Compatability?[/size][/b]\r\nIncompatible with any mod that alters the Bound weapon enchantments or the star-map of the Enchanting tree and Conjuration tree.\r\nCompatible with mods that alter standard enchantments, Enchanting perks or Conjuration perks without altering the star map of the Conjuration or Enchanting tree.\r\n\r\nBOund Daggers: If you have downloaded a Bound Dagger from another mod then only the Conjuration perks in this mod will affect the Bound Dagger, with the exception of the Ghastly Binding perk which acts like an enchantment, and enchantments won\\'t work on the Bound Dagger.\r\n\r\n---[b][size=5]What will be in future versions of this mod?[/size][/b]\r\nEDIT:This mod is officially dead for the time being, and will recieve no additional updates in the forseeable future.\r\n\r\nThanks to everyone for the support in this endeavour, and sorry if this disappoints anyone.\r\n\r\n\r\n---[b][size=5]Can I make a suggestion?[/size][/b]\r\nEDIT: As said above, sorry,  no longer being worked on.\r\n\r\n---[b][size=5]How do Bound weapons work? Do they use Conjuration skill or One-Handed/Two-Handed/Archery?[/size][/b]\r\n[b]Conjuration:[/b] Summoning the Bound weapon gives a very small amount of Conjuration experience, and you will also gain a very small amount of Conjuration experience for approaching enemies with a Bound weapon in your hands. However, the majority of Conjuration experience from Bound weapons is gained through striking enemies, since you gain Conjuration experience based on the damage of each strike in the same way that your One-Handed/Two-Handed/Archery skills would improve.\r\n\r\n[b]One-Handed:[/b] Bound Swords base their damage off of your One-Handed skill level and any perks, just like regular Swords do. Striking enemies with the Bound Sword grants you One-Handed experience based on the damage dealt, in the same way that regular Swords do.\r\n\r\n[b]Two-Handed:[/b] Bound Battleaxes base their damage off of your Two-Handed skill level and any perks, just like regular Battleaxes do. Striking enemies with the Bound Battleaxe grants you Two-Handed experience based on the damage dealt, in the same way that regular Battleaxes do.\r\n\r\n[b]Archery:[/b] Bound Bows base their damage off of your Archery skill level and any Archery perks, just like regular Bows do. Striking enemies with Bound Arrows grants you Archery experience based on the damage dealt, in the same way that regular Bows and Arrows do.\r\nAlso note that the Bound Bow is summoned along with a quiver of 100 Bound Arrows, which are ethereal versions of Daedric Arrows, making the Bound Bow incredibly powerful for low level characters.\r\n\r\n---[b][size=5]Are there any bugs?[/size][/b]\r\n[b]1.[/b] NPCs will think you have a Fire enchantment on your Bound weapons, regardless of whether or not you have the Fire BInding perk.\r\n   This bug is insignificant since:\r\n      a) You won\\'t run around town with Bound weapons out most of the time.\r\n      b) The Bound weapons effect looks like ethereal fire anyway.\r\n[b]2.[/b] Killing enemies with a paralysing attack can make their corpse look glitchy, but this is a bug from the vanilla Skyrim and is not caused by this mod.",
  "categoryId": "75",
  "version": "v0.21",
  "author": "Gosgosgosu",
  "createdUnix": "1329971665",
  "updatedUnix": "1330591332",
  "containsAdultContent": false,
  "uploadedBy": "Gosgosgosu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "35574",
      "name": "Enchanted Bound Weapons v0_10",
      "version": "v0.10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Enchanted Bound Weapons v0_10-10892.zip",
      "uploadedUnix": "1329971950",
      "modVersion": "v0.10",
      "virusScanUrl": "https://www.virustotal.com/file/03fb5e22106ce43968f7161ed2b2f1e904c39f6a03e1fded4538d3610fb0f03a/analysis/1406706977/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanted%20Bound%20Weapons%20v0_10-10892.zip?fid=35574&ttl=1535771580&ri=8192&rs=8192&setec=e03a98019e1e56de7b1ae4111015c519"
    },
    {
      "fileId": "36109",
      "name": "Enchanted Bound Weapons v0_20",
      "version": "v0.20",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "Enchanted Bound Weapons v0_20-10892.zip",
      "uploadedUnix": "1330069500",
      "modVersion": "v0.20",
      "virusScanUrl": "https://www.virustotal.com/file/32de1dc6660018f09cc416e8b6d1f377c0bed3e22fc7edd85ae5e6e4f9f37933/analysis/1406709545/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanted%20Bound%20Weapons%20v0_20-10892.zip?fid=36109&ttl=1535771580&ri=8192&rs=8192&setec=d43388b54c1aa73311b07e75ce6c196f"
    },
    {
      "fileId": "38749",
      "name": "Enchanted Bound Weapons v0_21",
      "version": "v0.21",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Enchanted Bound Weapons v0_21-10892.zip",
      "uploadedUnix": "1330591332",
      "modVersion": "v0.21",
      "virusScanUrl": "https://www.virustotal.com/file/7ab9d2ff4ef88587893445a115cf95d29621e6fda263bcc1b78139fb1510bc61/analysis/1406722817/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanted%20Bound%20Weapons%20v0_21-10892.zip?fid=38749&ttl=1535771581&ri=8192&rs=8192&setec=0bef8e1b4109e512afc11cd612c61890"
    }
  ]
}