{
  "modId": 10898.0,
  "modName": "The Vampire FX Project",
  "summary": "The Vampire FX Project is a visual effect, ability and gameplay improvement project for vampires. Adding new abilities, powers, shaders, death effects, custom scripts, new animations, and sound effects. Developed to enhance vampirism. NPC Mind Control, Flying Mist Transformation, Vampire Sprint, Slow Falling, NPC Vampirism Infection, and more",
  "descriptionHtml": "[center][IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/MainLogo-1a.png[/IMG][/center]\r\n\r\n[color=crimson][b]NOTICE:[/b][/color] This file has been hidden since March. I have enabled the file again, due to many requests. Updating is on hold until I see what TES V: Dawnguard expansion brings to the game regarding vampires. As many planned components of this project are going to be added officially via the expansion pack. Then I will build apon those additions, and changes.\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/Desc-1a.png[/IMG]\r\n[font=candara][size=3]The Vampire FX Project is a WIP effects, ability, and gameplay improvement project for vampires. Adding new abilities, factions, powers, shaders, death effects, custom scripts, new animations, and added sound effects. This was developed to enhance the overall vampire gameplay experience, and also hopefully help those of you considering to play a vampire, to make the right decision. Skyrim\\'s vanilla vampirism is quite dull, and there really isn\\'t any distinction to playing a vampire at all. My plan is to make vampires unique in the great world of Tamriel. If your playing as a vampire, then It should add some depth and complexity to the game, and an overall enjoyable style of gameplay. [b]This[/b] is the objective of The Vampire FX Project.\r\n\r\nA major goal of this project, was to maintain compatibility with progression vampire mods that altered the vampire mechanics, I do no alteration of Skyrim\\'s vanilla scripts, and write all of my own. This means, my modifications should be compatible with most other vampire mods out there. Meaning, you get to choose which vampire progression mod you want, and/or keep using your favourite current one, and this should enhance their\\'s even further.\r\n[/font][/size]\r\n\r\n[color=yellow][u][size=2]Scroll to the end the of page, for Installation, Current Workings Tracking, and Version History Notes[/u][/color][/size]\r\n\r\n\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/Featsa.png[/IMG][size=5][font=candara][list][*]New Animated Feeding Method\r\n[*]New Ability Sound Effects\r\n[*]New Screen Shaders                               \r\n[*]New Unique Summon Power\r\n[*]Flying Dark Mist Transformation\r\n[*]NPC Mind Control\r\n[*]Vampire\\'s Guile - Slow Fall Speed, Fall Damage Reduction\r\n[*]NPC Vampirism Infection\r\n[*]New Magic Effects\r\n[*]Vampire Sprint Ability\r\n[*]All Custom Written Scripts, No Vanilla Scripts Modified\r\n[*]New Unarmed & Melee Effects\r\n[*]Vampire Race Name\r\n[*]New Vampire Death Sequence\r\n[*]Stage 4 Flame Effects in Sunlight\r\n[*]New Scripted Vampire Invisibility\r\n[*]Join the Vampire Faction, Vampires are Allys (temp disabled)\r\n[*]Optional LoK Vampiric Skin Tone, which is customizable\r\n[*]Fix for the Vanilla Female Vampire Eyes Bug.\r\n[*]Lastly, No Modification of the Vampire Quest Scripts, for Compatibility\r\n[/list]  [/size][/font]\r\n\r\n[center][IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/at_examples_dividera.gif[/IMG][/center]\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/feedinga.png[/IMG]\r\n[size=3][font=candara]I have added a completely new drain-type major power called Blood Harvest, to be used once a day for feeding on enemies, it is an AoE, or Area spell which drains the blood, and souls of all enemies around you, and also feeds your vampirism. This power includes a custom made script, modified magic/shader effects, special sound effects, and added animations. I also found the original Vampire Drain spell to be quite redundant, there is already a drain health spell which does exactly the same thing. I have changed its magic effects and given the spell some new properties, such as a bleeding effect, slight magic draining, and visual effects.[/font][/size]\r\n\r\n\r\n\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/soundFXa.png[/IMG]\r\n[size=3][font=candara]All of the spells, and abilities I have either altered or added have new sound effects I thought (imo) were more suited than the original for vampiric ablilities. Many contain multiple sound effects, for more depth.[/font] [/size]\r\n\r\n\r\n\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/summona.png[/IMG]\r\n[size=3][font=candara]I\\'ve added a completely new summon power for vampires, to be used once a day (as it\\'s quite powerful) It summons 3 Master Vampire Minions to slay your foes and protect you for 30 seconds. Each Minion is scripted to reanimate 1 dead body around them, if any are near, so you can potentially have up to 6 minions during the duration. These summoned minion\\'s also possess all of the vampire abilities to wield as they see fit[/font]  [/size]\r\n\r\n\r\n\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/MistForm.png[/IMG]\r\n[size=3][font=candara]Transform into a flying dark mist form at will, called Shadow Form. To evade your enemies, hunt them down, or simply use this for flying around the world map. This ability enables you to move through solid objects, so it\\'s best used in open areas.[/font][/size]\r\n\r\n\r\n\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/MindControl.png[/IMG]\r\n[size=3][font=candara]Control NPC\\'s minds, with Invade Mind. A new power which lets you take direct control of an NPC, swap camera views, and see through their eyes, and have them do your will. Read the NPC Mind Control FAQ in the current workings section.[/font][/size]\r\n\r\n\r\n\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/Infection.png[/IMG]\r\n[size=3][font=candara]Dark Gift enables you to infect NPCs with vampirism, have them gain vampiric abilities, progress within the stages of vampirism, and feed on other sleeping NPCs, this ability is a WIP, and it is a very large undertaking. Infected NPCs will help you as party members, this is not a follower, as you cannot give them commands yet, but will be able to in future versions. Read the infection FAQ in the current workings section.[/font][/size]\r\n\r\n\r\n\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/sprinta.png[/IMG]\r\n[size=3][font=candara]Another new ability, best used while moving. It gives your vampire a huge burst of speed, and can be used at will, with no cooldown. Like [u]all[/u] of my added powers, this is a completely custom-scripted ability, meaning you will not find another power like this in the vanilla game. Also has speed effect shaders, visuals, and sound effects.[/font][/size]\r\n\r\n\r\n\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/meleea.png[/IMG]\r\n[size=3][font=candara]Reworked vampire melee, and unarmed attacks for a bit more fun. Vampire unarmed attacks now cause victims to bleed from the vampire\\'s claws, and both weaponed-melee, and unarmed melee have had their damage increased which also have a chance of knocking targets back into the air a short distance, from Vampiric Strength\\'s power attacks. [/font]   [/size]\r\n\r\n\r\n\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/nameda.png[/IMG]\r\n[size=3][font=candara]I found it a bit immersion killing when you finally decided to be a vampire, that the only thing that said you had vamprisim anywhere on the UI, was your Resist Disease and Weakness to Fire, So I changed it so when your character changes into a vampire, your race name will also be changed from the default race name, to Vampire. A simple change, but it adds to the overall game when playing as a vampire, especially to roleplayers[/font]   [/size]\r\n\r\n\r\n\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/deathFXa.png[/IMG]\r\n[size=3][font=candara]I\\'ve changed the death sequence for vampires, to a more entertaining death sequence, from the default of flopping to the floor like a dead fish. Now you slowly disintegrate into a pile of ash similar to the ones NPC vampires turn into apon death. You will find yourself killing your character deliberately quite a few times, just to see this.[/font]  [/size]\r\n\r\n\r\n\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/flamesa.png[/IMG]\r\n[size=3][font=candara]Well, not much to say about this really, Stage 4 vampires now burst into flames apon contact with sunlight (only stage 4, mind) this was added as special effects for those who have mods that grant stage 4 vamp sun damage, and also for some fun, there\\'s something satisfying about suddenly seeing your character burst into flames with a searing, crackling sound as the sun rises, when you are weak. This is just an [u]effect[/u], it doesn\\'t introduce sun damage to your character[/font]   [/size]\r\n\r\n\r\n\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/invisa.png[/IMG]\r\n[size=3][font=candara]Slightly reworked the vampiric invisibility spells to make them unique to vampires. With a script added to the vampiric invisibility to enhance it\\'s effects visually, and functionally, and not behave, and look the exact same as the other invisibility spells and effects in the game. I have also found a fix for the double-eye texture bug after using invisibility, which I will be including in 1.4a[/font] [/size]\r\n\r\n\r\n\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/allysa.png[/IMG]\r\n[size=3][font=candara] Player vampires are now scripted to join the Vampire Faction when they turn. Vampires are now your allys, they will not attack you on sight, and will aid you if they can. You can still attack and kill them of course, and they will attack you if you attack them, making them aggressive, Vampires can also accept yields from the player.[/font]   [/size]\r\n\r\n\r\n\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/modifa.png[/IMG]\r\n[size=3][font=candara]I\\'ve strived during development of this to try my best to keep it compatible with other vampire mods, specifically vampire modifications to the vanilla progression system. Most other vampire mods I have seen are VampireQuestScript altering mods, for reversing and changing the vampire feeding, & stats etc, I have left those scripts completely unaltered, and have wrote all my own, so they should not cause conflicting problems. just make sure you load my mod [u]after[/u] their\\'s, preferably put mine last in your mod load order.\r\n\r\n\r\n[center][IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/at_examples_dividera.gif[/IMG][/center]\r\n\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/workingsa.png[/IMG]\r\n[list]\r\n[*]I may make a custom installer for version 2, not much need for it really, but considering.\r\n[*]To implement some method of acquiring the powers in-game, rather than me just \\'giving\\' them to you, which is boring. Considering Vampiric Spell Tombs.\r\n[*]A Force Feed Biting ability.\r\n[*]Feed count (necks bitten) to unlock perk points, per every certain amount.\r\n[*]Vampire Appearance Toggle. - [color=crimson]Nearly Done[/color]\r\n[*]I would like to implement some telekinetic abilities, [color=crimson]Working on a Few[/color].\r\n[*]To have some of these changes implemented for NPC vampires also. [color=crimson]- done for NPCs infected via Dark Gift[/color]\r\n[*]Vampiric Agility - An evasion ability to avoid enemy attacks in realtime, and adding a flurry effect to attacks & spells for it\\'s duration. [color=crimson]- Done[/color]\r\n[*]A Full-Functional Vampire Lair, completely custom built to accommodate vampires, minions, and vampire modifications.\r\n[*]Shadow Cloak - Which activates automatically apon entering a shadowed area, which makes you undetectable while in shadows, will be using the nightingale shadow effect most likely.\r\n[*]NPC Sanguinare Vampiris infection [color=crimson]- Done as a power, WIP still[/color] \r\n[*]Vampire Jump ability - Have working, making it so it changes according to your current speed. [color=crimson]= Done[/color] \r\n[*]Vampire Transformation. [color=crimson]- Script finished, Trying to sort the no-head bug after returning to vamp form[/color]\r\n[*]Vampire Stage system implementation, Faction Ranks.\r\n[*]Vampire Kill Moves. [color=crimson]- WIP[/color]\r\n[*]Currently trying to write a script to fix the vanilla bug regarding invisibility spells messing up character\\'s eyes. [color=crimson]- nearly done[/color]\r\n[*]Create custom cooldowns for vampire powers, considering having them reset when you feed.\r\n[*]A Flying Mist power. [color=crimson]- Done[/color] \r\n[*]Vampire Hunter Faction, and Rival Vampire Factions Implementation. [color=crimson]WIP[/color]\r\n[*]A shadowstep ability, to dissolve into the shadows, and reappear behind your target. [color=crimson]- WIP[/color]\r\n[*]Mesh edits so you can open your mouth to see your fangs.\r\n[*]NPC Mind Control - remote control NPC\\'s for a certain duration. [color=crimson]- Done[/color]\r\n[*]Vampire Thralls. [color=crimson]- WIP[/color]\r\n[*]Improving the current abilities, effects, and functionality, will try to be lore friendly, and balanced.\r\n[*]Also considering changing the current summon ability. To summon, (maybe) Shades, not desided yet.\r\n[*]Also considering releasing a video with the next version (V2.0), but I have terrible bandwidth, so i\\'ll have to see.\r\n[/list]\r\n[center][IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/at_examples_dividera.gif[/IMG][/center]\r\n[b][color=crimson]Version History[/color][/b][list]\r\n[*][b][color=crimson]1.1:[/color] [/b]Fixed the vanilla game bug regarding female vampire eyes turning hazel apon change.\r\n[*]Fixed an issue where certain races may not have received the Vampire Summon ability.\r\n\r\n[*][b][color=crimson]1.1a:[/color][/b] Includes reversion of the Vampiric Drain spell to mostly it\\'s original design, it now drains blood per second again, is channeled, added effects are: Causes a bleed effect, and now it can \\'turn\\' NPCs, infecting them with vampirism. It works fine, it just needs to be refined. I will probably be adding it to bed feeding, instead of the drain, unless i think of a better idea.\r\n[*]Also added Blood Harvest, which was Drain Blood last version, Aoe Drain (it got a a substantial damage buff this version) and it is an extra feed method.\r\n\r\n[*][color=crimson][b]1.2: [/b][/color]Completely rewrote the infection script, from scatch. It is now in a new lesser power called \\'Dark Gift\\' it is still not complete yet. NPC vampires should now progress within the stages of vampirism just like players, and also gain the vampire spells/abilities, and feed. May not yet join you as a follower though, I\\'m still working on that, current infection script is over 440 lines long, and the follower extention will probably be that much again.\r\n[*]Vampire Drain, now Drains health, and magicka from enemies, it has had its damage reduced a bit, and its magic cost increased a bit to counter the magic drain.\r\n[*]Removed the Active Effect \\'Undead\\' from the UI effects, and imbedded it into vampirism, you will still turn to ash apon dying.\r\n[*]Fixed an issue where Imperials may not have heared their shout voice \\'words\\'. \r\n[*]Vampires will now attack the player if the player has attacked the vampire enough to make him aggressive.\r\n[*]Hopefully fixed the second animation from Blood Harvest, as it was causing issues with actor geometry.\r\n[*]Vampiric Speed is now a toggle on/off ability for run speed. I will be adding another ability soon called Vampiric Agility which will be the new \\'burst\\' effect, speed oriented ability, i\\'ve also included a fall-damage reducing effect to it\\'s duration.\r\n[*]Fixed an issue where Drain Health would change it\\'s spell effect to \\'green lazers\\' \r\n[*]Voice of the Master is now called \\'Call of the Master\\' \r\n[*]Added improved Embrace of Shadows script, to try get \\'real\\' undetectability, so you won\\'t set off alarms etc.\r\n\r\n[*][color=crimson][b]1.2a: [/b][/color]Had to revert the Speed toggle ability, it wasn\\'t working for everyone, as everyone\\'s default run speed seems to be very slightly different, from perks/buffs/mods and the like. I need to find a generic actor value which won\\'t be different for each person, for the conditional statement.Vampire\\'s Speed also now has a fall-damage reduction ability embedding into it\\'s duration. So i\\'ve removed the tgm effect.\r\n[*]Dark Gift is now working for all races. I will more than likely be changing the visual effect, as it\\'s still in beta, and probably making at an animated feed-style infection method.\r\n\r\n[*][color=crimson][b]1.2b: [/b][/color]Fixed an Issue where certain players may have had a spell sound effect stuck running in an ambient loop, even while the spell was not being used.\r\n[*]Wrote a new Faction Script for player vampires, You will now [u]only[/u] be friendly to vampires as a vampire yourself, vampires will treat you as an ally, but will attack you if you attack them, but they can also accept yields from the player vampire, and will stop attacking.\r\n\r\n[*][color=crimson][b]1.3: [/b][/color]Fixed the issue where a copy of the Imperial Race was showing in the Race Menu.\r\n[*]Fixed an issue where certain players may have been friendly to certain factions they shouldn\\'t have been. EG: wolves, spiders, skeletons etc. You are now only friendly to Vampires, and wolves, as a vampire yourself.\r\n[*]Fixed an issue where certain players had the Weakness To Sunlight debuff, even when it was night time.\r\n[*][color=crimson]*NEW ABILITY:[/color] Shadow Form - You take the form of shadowy Mist, and it enables you to fly. [b]NOTE: This ability enables you to pass through solid objects, it is up to you, the user to use this power responsibly.[/b]\r\n[*][color=crimson]*NEW ABILITY:[/color] Invade Mind - You take direct control on an NPC for 30 seconds, enabling you to move around as that actor. Some Beast-type creature\\'s controls are a bit hard to use. Attacking as the Controlled actor does not work, this is a vanilla issue, and i\\'m trying to find a way around it. I had fun making NPC\\'s run into monsters, off cliffs, into traps etc. as a few examples of possible use.\r\n[*][color=crimson]NEW PASSIVE ABILITY:[/color] Vampire\\'s Guile, enables you to fall slowly when jumping, and you take far less fall damage.\r\n[*]Blood Harvest as of now, will not harm followers, or essential NPCs. Also added a stagger effect to migitate some damage from stronger enemies.\r\n[*]Various other small fixes.\r\n\r\n[*][color=crimson][b]1.4: [/b][/color]Shadow Form toggling should now work as intended (not without considerable difficulty I may add).\r\n[*]Mind Control now works as intended, fixed various issues with player AI after the mind control ended, players will now be able to activate objects, and feed etc. Also Enhanced the camera attach, so you should see the NPC much closer to the Camera now.\r\n[*]Hopefully fixed an issue where players had the Imgspace mod getting stuck when they used Elemental Fury.\r\n[*]Vampire\\'s Guile fixed, it now reduces falling speed of the vampire, and also dramatically reduces fall damage. Ie you would want to be [b]fairly[/b] high to take any considerable falling damage as a vampire now.\r\n[*]Effects fixed, on various abilities, such as vampire\\'s speed wind shaders, Invade Mind sound effects, Shadow Form, shadow effects, and various others.\r\n[*]I am getting too many people complaining about wolves being friendly, so I\\'ve reverted it. Only vampires are friendly towards the PC Vampire now, they will aid you in battle, but if you attack them enough they can turn on you. Vampires can also accept yields.\r\n\r\n\r\n[b][color=crimson]FAQ: At the moment regarding NPC Infection of vampirism[/color][/b]\r\n\r\n[u]The Infected NPC Can Do:[/u]\r\n[*]Can Join the Vampire Factions/Potential Followers Faction\r\n[*]Can use the same abilties as the PC vampire, excluding the sprint, but I will give them that soon, once I have finalized it.\r\n[*]Infected NPCs will not die from hunger, nor be hated at stage 4 currently, they probably won\\'t progress to stage 4 anyway, as they\\'ll feed when their left to roam their navmesh packages.\r\n[*]Can be party members, this is not a follower, This means you can infect people in dungeons etc and have them help you defeat the other enemies, and they will act like party members, but you cannot give them instructions...yet.\r\n[*]Can feed, and progress through vampirism, they won\\'t get hated or die through means of progression. They [u]can[/u] infect other NPC\\'s but I have not yet scripted them to do so, and will not until the Dark Gift ability is out of Beta.\r\n\r\n[b][color=crimson]FAQ: At the moment regarding NPC Mind Control[/color][/b]\r\n\r\n[*]You can swap views and take control the NPC and move around.\r\n[*]If the NPC, is sleeping, or doing some fixed task like sitting, You won\\'t be able to move them until they get up.\r\n[*]If you want to be able to attack with the controlled NPC, open the console and type toggleai with nothing selected, the 30 second timer will stop and you will be able to attack, to return to normal, just reopen the console and type toggleai again.\r\n[*]You can sometimes you can sheath their weapons to force them into a yield when the MC ends.\r\n[*]Controls for moving left and right may be the strafe keys for certain beasts, like horses etc.\r\n[*]You can\\'t enter or exit an area like a house with a controlled NPC\r\n[*]Jumping as NPCs is a bit \\'goofy\\' looking, as NPCs generally don\\'t jump.\r\n[*] If you can\\'t see the NPC after taking control, zoom the camera out a bit\r\n[*]I had fun making NPC\\'s run into monsters, off cliffs, into traps etc. as a few examples of possible use.\r\n[*][b]These are the game\\'s restrictions, I\\'m going to need to wait for a stable Script extender soon, i\\'m afraid.[/b]\r\n\r\n\r\n[b][color=crimson]FAQ: At the moment regarding Dark Mist Transformation[/color][/b]\r\n\r\n[*]You can pass through solid objects, it is up to you, the user to use this power responsibly, abusing the game\\'s mechanics for long periods, such as going through certain barriers, areas that normally require loading, can cause issues.\r\n[*]The intended usage of this power, is for flying.\r\n[*]Some users, that have fps dips, or stutter during usage of the Mist Form [u]toggle[/u], can get it to reverse, and toggle off the power, but toggle on collision, just toggle twice after this to reset, or open the console and type TCL and hit enter.\r\n[*]Try not to save, and exit the game while in mist form, toggle out of it before saving, and exiting.\r\n[*]If your system, cannot load worldspace grids fast enough while flying, you can sometimes experience a CTD, this is not a bug. It would happen the same way on the ground if you were moving fast enough. If your system is having trouble loading fast enough. If you are flying long distances, and experience this, try either flying very high up, or lower to the ground. I cannot produce this myself.\r\n[/list][/size]\r\n\r\n\r\n[size=2][b][color=crimson]Possible Future Scope[/color][/b][list]\r\n[*]In the long run, I\\'m considering completely removing the vanilla-style vampire system, and replacing it with a better progression mechanism, [u]maybe[/u] such as, tied to your age as a vampire, as vampire\\'s are generally known to grow stronger as they get older, or collecting blood artifacts (example name) similar to the dragon soul method. But, for now, this is an enhancement set of modifications.[/list]\r\n\r\n[color=crimson]*[/color]These getting implementation is ultimately up to you though, if you find this project interesting enough for me to continue it, and you enjoy my modifcations, let me know with the endorsement button.[/font][/size]\r\n\r\n\r\n\r\n[center][IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/at_examples_dividera.gif[/IMG][/center]\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/instala.png[/IMG]\r\n[size=3][font=candara]Put the contents of the downloaded Zip file into your data folder, make sure all of the scripts are put in the Data->Scripts Folder, or all of the new abilities won\\'t work. \r\n\r\n[b][u]Manually sort your mods with the Skyrim launcher[/u][/b]\r\n\r\n[b][color=crimson]If you are [u]not[/u] a vampire[/color][/b]\r\nIf you\\'re not a vampire, [u]it is recommended that you contract vampirism the vanilla way[/u]. You can just contract the disease as per usual, it is the same as you would do it normally.\r\n\r\n[b][color=crimson]If you are already a vampire[/color][/b]\r\nIf you\\'re already a vampire, you may need to wait for a day in-game to make your vampirism\\'s stage increase by one, and then feed the traditional way (feeding on a sleeping person), to activate an update hook in the scripts for the first time.\r\n\r\n[b][color=crimson]If you are already a vampire, and have another vampire mod[/color][/b]\r\nSame as above, but make [u]sure[/u] you have my mod loaded [u]After[/u] their\\'s in your mod load-order. Or, you can just push this mod to last in the load order. Also, ensure you have the other vampire mod, loading right behind mine, so mine will be last, and the other vamp mod is 2nd last.\r\n\r\nThe reason mine is loaded after the others is, because my mod is focused on gameplay abilities, effects etc, and not modifying the vampire progression system (this meaning, how Skyrim\\'s vampire\\'s progress) which is one script, for the most part, called the PlayerVampireQuestScript. So, since I haven\\'t altered that, you will still get the progression system of that mod, but if mine is not loaded after that mod, that mod will produce problems adding in my new scripted powers etc.\r\n \r\n[/font]\r\n [/size]\r\n\r\n\r\n\r\n[IMG]http://i1069.photobucket.com/albums/u466/Asmodean778/Bugsa.png[/IMG]\r\n[size=3][font=candara]None at present, please report in the comments section if you find any.[/font] [/size]\r\n\r\n\r\nI leave my source files in this mod, as I don\\'t believe that anyone gains from me being greedy and keeping them hidden. I worked hard writing these scripts. You may not reupload, modify, or redistribute my custom scripts without consent from myself. Thank you.\r\n\r\nRegards,\r\n[font=fantasy][color=crimson][size=5]Kieranh7[/size][/color][/font]",
  "categoryId": "24",
  "version": "1.4",
  "author": "Kieranh7",
  "createdUnix": "1329982073",
  "updatedUnix": "1332255294",
  "containsAdultContent": false,
  "uploadedBy": "kieranh7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "37883",
      "name": "The Vampire FX Project 1point1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6855",
      "fileName": "The Vampire FX Project 1point1-10898.zip",
      "uploadedUnix": "1330404508",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4cb12c798644ba6ed4e4c5aeb6f7203486c9e39c3eca2e75181fb7d1a029534b/analysis/1406718674/",
      "changelogHtml": " Fixed the vanilla game bug regarding female vampire eyes turning hazel apon change <br/> \n Fixed an issue where certain races may not have received the Vampire Summon ability. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Vampire%20FX%20Project%201point1-10898.zip?fid=37883&ttl=1535771588&ri=8192&rs=8192&setec=9994f4dc26c1eac129a40a8d3c3ce660"
    },
    {
      "fileId": "38899",
      "name": "The Vampire FX Project 1point2a",
      "version": "1.2a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6864",
      "fileName": "The Vampire FX Project 1point2a-10898.zip",
      "uploadedUnix": "1330626337",
      "modVersion": "1.2a",
      "virusScanUrl": "https://www.virustotal.com/file/0f969eda297a4651e037bd8af923e01a5b3ca6076f7998ed0a4498c73e84e9ed/analysis/1406723590/",
      "changelogHtml": " Had to revert the Speed toggle ability, it wasn\\'t working for everyone, as everyone\\'s default run speed seems to be very slightly different, from perks/buffs/mods and the like. <br/> \n Dark Gift is now working for all races. I will more than likely be changing the visual effect, as it\\'s still in beta, and probably making at an animated feed-style infection method. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Vampire%20FX%20Project%201point2a-10898.zip?fid=38899&ttl=1535771589&ri=8192&rs=8192&setec=042f942d162289310b182284ffb1b0e5"
    },
    {
      "fileId": "39714",
      "name": "The Vampire FX Project 1point2B",
      "version": "1.2b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6866",
      "fileName": "The Vampire FX Project 1point2B-10898.zip",
      "uploadedUnix": "1330811819",
      "modVersion": "1.2b",
      "virusScanUrl": "https://www.virustotal.com/file/3647080584f16e91c212dc68db7f4d7b7805aebfd7195d11c5070542d0f9ca38/analysis/1406727845/",
      "changelogHtml": " Wrote a new Script for vampire player factions, so you will only be friendly to vampires, AS a vampire. <br/> \n •Fixed an issue where some players had a sound effect stuck in a loop playing even when the ability was not being used <br/> \n Read version notes section of description for full change log. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Vampire%20FX%20Project%201point2B-10898.zip?fid=39714&ttl=1535771589&ri=8192&rs=8192&setec=647f594d352af2ce5c5c7a960b0c0782"
    },
    {
      "fileId": "41654",
      "name": "The Vampire FX Project",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6868",
      "fileName": "The Vampire FX Project-10898-1-4.zip",
      "uploadedUnix": "1331285749",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/b713b0d6ff55c09b11aaa716f6c932b790015a8169038e3555a06952755daef7/analysis/1406739463/",
      "changelogHtml": " Shadow Form toggling should now work as intended  <br/> \n Mind Control now works as intended, fixed various issues with player AI after the mind control ended (activating objects) <br/> \n Hopefully fixed an issue where players had the Imgspace mod getting stuck when they used Elemental Fury. <br/> \n Vampire\\'s Guile fixed, it now reduces falling speed of the vampire, and also dramatically reduces fall damage.  <br/> \n Effects fixed, on various abilities <br/> \n Wolves are now hostile towards the player. <br/> \n Only vampires are friendly towards the PC Vampire now, they will aid you in battle, but if you attack them enough they can turn on you. Vampires can also accept yields. <br/> \n See version notes for complete changes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Vampire%20FX%20Project-10898-1-4.zip?fid=41654&ttl=1535771590&ri=8192&rs=8192&setec=52dd56d18d0afe126cb3eb621e47bc9c"
    },
    {
      "fileId": "41710",
      "name": "VFX Optional Vampiric Skin Tone",
      "version": "1.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "64",
      "fileName": "VFX Optional Vampiric Skin Tone-10898-1-4.zip",
      "uploadedUnix": "1331308424",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/1cf3f346384f81b6d583c100f2a5f01d3e0be2568a6a511bedd74ad8c8a55465/analysis/1406739914/",
      "changelogHtml": " Shadow Form toggling should now work as intended  <br/> \n Mind Control now works as intended, fixed various issues with player AI after the mind control ended (activating objects) <br/> \n Hopefully fixed an issue where players had the Imgspace mod getting stuck when they used Elemental Fury. <br/> \n Vampire\\'s Guile fixed, it now reduces falling speed of the vampire, and also dramatically reduces fall damage.  <br/> \n Effects fixed, on various abilities <br/> \n Wolves are now hostile towards the player. <br/> \n Only vampires are friendly towards the PC Vampire now, they will aid you in battle, but if you attack them enough they can turn on you. Vampires can also accept yields. <br/> \n See version notes for complete changes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VFX%20Optional%20Vampiric%20Skin%20Tone-10898-1-4.zip?fid=41710&ttl=1535771590&ri=8192&rs=8192&setec=dda67a94887debf1e7ee08dba80f45ae"
    },
    {
      "fileId": "45099",
      "name": "VFX Update Factions Fix",
      "version": "1.4a",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "93",
      "fileName": "VFX Update Factions Fix-10898.zip",
      "uploadedUnix": "1332255294",
      "modVersion": "1.4a",
      "virusScanUrl": "https://www.virustotal.com/file/ce4bdd241805823e70ab4d64035d8286298aca3091ea1e60cf4f8f1a27ac4c8a/analysis/1406769423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VFX%20Update%20Factions%20Fix-10898.zip?fid=45099&ttl=1535771591&ri=8192&rs=8192&setec=483f1ebb3449a7235add87b42c12612f"
    }
  ]
}