{
  "modId": 10893.0,
  "modName": "Riften TortureHouse",
  "summary": "Haelga Has a secret.... \r\nThis mod changes the Riften BunkHouse into a true horror story house. The mod only effects the visuals of the house currently but that will change soon once I add some interaction using quests and whatnot. ",
  "descriptionHtml": "Haelga Has a secret.... \r\n\r\nThis mod changes the Riften BunkHouse into a true horror story house. The mod only effects the visuals of the house currently but that will change soon once I add some interaction using quests and whatnot. The middle level of the building will remain relatively unchanged, and this is because Haelga doesn\\'t want anyone to know whats going on upstairs or even worse... downstairs...\r\n\r\nHaelgas key is ontop of the end table in the room behind her, make sure to be hidden when stealing the key or you may have it taken away.\r\n\r\nThe downstairs is currently locked and inaccessible, this will change soon. (unfinished)\r\n\r\n\r\n\r\n\r\nHow can you be part of this mod?\r\n\r\nI could have easily came up with a background story for this mod but I felt that it would be more fun to let the community take part so if you want to be a part of this mod, you can come up with a background including quests, stories, custom npcs, etc, and I will build it all for you. I will also give credit to the person who made the story that I pick.\r\n\r\nUPDATE: I will be adding lots of stuff next weekend, I have a few tests and assignments due this week so I will have a bit more free time next week.\r\n\r\n\r\n[IMG]http://i42.tinypic.com/z00ld.png[/IMG]\r\n1. Finish basement\r\n2. Questlines\r\n3. More Gore\r\n\r\n\r\n[IMG]http://i41.tinypic.com/vetd2r.png[/IMG]\r\nv1.1\r\n     -More ambience stuff",
  "categoryId": "53",
  "version": "1.1",
  "author": "Falconsflight",
  "createdUnix": "1329973611",
  "updatedUnix": "1330383587",
  "containsAdultContent": false,
  "uploadedBy": "Falconsflight",
  "primaryFile": null,
  "files": [
    {
      "fileId": "37762",
      "name": "Riften TortureHouse",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35",
      "fileName": "Riften TortureHouse-10893-v1-1.rar",
      "uploadedUnix": "1330383587",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4ab3e7d0004291d4b479468e92224a4c41cddb2533caabe99ba7e3473df4964c/analysis/1406718126/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riften%20TortureHouse-10893-v1-1.rar?fid=37762&ttl=1535771582&ri=8192&rs=8192&setec=048e06b7ab138e854cefc1106d02187e"
    }
  ]
}