{
  "modId": 10899.0,
  "modName": "Armor Padding Kits",
  "summary": "Craftable Armor Padding \\\"Kits\\\" worn under clothes/armor for a slight fortification in defense without affecting Mage Armor, Heavy or Light armor perks.",
  "descriptionHtml": "NEW CHAINMAIL TUNIC armor! Counts as clothes, same effect as the Chainmail padding, but is visibly worn. Unfortunately I could not determine how to make them show up underneath other armor as the biped objects would conflict and could only equip one or the other. Chainmail Tunic can still have the undershirt and padding equipped beneath it btw! :D Chainmail Tunic can be \\\"bought\\\" at a tanning rack at the cost of 1 Chainmail Undershirt and 200 gold coins!\r\n\r\nThe book can be found in Warmaiden\\'s in Whiterun on the counter! Careful, because it does belong to Adrianne and Ufberth and taking it is stealing! (same with all three standard pieces hidden on top of the wardrobe) ;) Also, it can be found in blacksmith inventories (rare) and as a common clutter book (anywhere common cheapo books are found). For this I STRONGLY suggest using Wrye Bash to combine leveled lists to avoid conflicts :)\r\nAlso, optional file adds all items to a bandit loot list for a small chance to find bandits in possession of ANY these paddings (Including the disenchantable ones AND the chainmail tunic)!\r\n\r\nExcerpt from the Armor Padding manual:\r\n\r\n\\\"This book contains directions, sketches, and notes regarding the crafting of armor padding kits, or \\\"Armor Kits\\\". Armor kits are worn beneath clothing and armor in the form of cloth or leather padding or a chainmail shirt and are designed to improve resistance to damage without hindering movement or combat capabilities in any way.\\\"\r\n\r\nArmor Padding Kits are worn under clothes/armor for a slight fortification in defense without affecting Mage Armor, Heavy or Light armor and related perks. Useful for everybody from lowly peasants to esteemed knights and feared criminals, and mighty wizards. Also included are advanced craftable versions of cloth and leather with some nice new enchantments to play with!\r\n\r\nIncludes a custom-skinned linen wrap model and textures, freely usable with credit to Bethesda (for the base model and texture) and myself (for the editing work) as a modder\\'s resource, edited into a new roll of chainmail!\r\n\r\nThe new enchantments are:\r\n\\\"Fortify Armor Rating\\\" and \\\"Spell Absorption\\\" which both properly scale alongside your Restoration and Alteration skill respectively! Only the Studded Leather and the Enchanted Cloth Padding are disenchant-able, to make the new enchantments require a little effort to obtain! ****SPOILER WARNING****all three disenchantable pieces can be found in Labyrinthian Thoroughfare near the Wispmother****\r\n\r\nAlso check out my other mods\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10184 Soft Leather Armor\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=9784 Less Frustrating Hard Mode\r\nand\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10249 Convertible Archmage Robes \r\n\r\nCredits:\r\nBethesda\r\nTheNexus\r\n\r\nSpecial thanks and recommendations to fireundubh and their \\\"I Put A Spell On You\\\", to open up enchanting options for armor :D All Enchanters should have this mod!: http://skyrim.nexusmods.com/downloads/file.php?id=3313\r\n\\\"Is this display name taken?\\\"s mods: http://skyrim.nexusmods.com/downloads/file.php?id=10255 Crafting Complete and http://skyrim.nexusmods.com/downloads/file.php?id=10902 Weapon Variant Expansion\r\nBaratan\\'s Armoury of Tamriel: http://skyrim.nexusmods.com/downloads/file.php?id=2933",
  "categoryId": "54",
  "version": "1.4",
  "author": "crazyjoe2k",
  "createdUnix": "1329982908",
  "updatedUnix": "1330269070",
  "containsAdultContent": false,
  "uploadedBy": "crazyjoe2k",
  "primaryFile": null,
  "files": [
    {
      "fileId": "37107",
      "name": "Armor Padding Kits",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7252",
      "fileName": "Armor Padding Kits-10899-1-4.zip",
      "uploadedUnix": "1330269070",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/6e29f64ee86347a7776e126980fc07196500c120173a6500f5e1b75138fff2c0/analysis/1406714715/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Armor%20Padding%20Kits-10899-1-4.zip?fid=37107&ttl=1535771592&ri=8192&rs=8192&setec=255c29e8d7c18c711c639e0fce01813d"
    }
  ]
}