{
  "modId": 10900.0,
  "modName": "Crypt Of The Tongues",
  "summary": "This is my 2nd Skyrim Dungeon I\\'ve published. This is designed to be a challenging but brief dungeon and the rewards reflect the risk. This dungeon is about challenging combat and offers lots of it. I\\'ve concentrated on interesting use of game mechanics, atmosphere and design and I truly believe the Boss fight is a unique experience to Skyrim whi",
  "descriptionHtml": "==Background/Lore==\r\nDuring the Skyrim Conquests of Morrowind and High Rock, around 1E 240, great Nordic war chiefs were also Tongues. They needed no typical siege weapons when attacking a city, instead using the Voice to break down the city gate and allow their armies to storm in.\r\n\r\nAfter Jurgen Windcaller\\'s call for pacifism via his way of the voice, three powerful war chiefs (Derek the Tall, Jorg Helmborg and Hoag Merkiller) buried themselves with a company of their finest warriors in a Nordic temple high in the mountains south of present day Winterhold. They vowed to rise again and reclaim Skyrim.\r\n\r\n\r\nOver the years the temple became known as the Crypt of the First Tongues, eventually lost to snow drifts and avalanches. Almost 4,000 years later strange earthquakes are becoming common, explorers talk of a unusual shrine outside a cave they\\'ve never seen before, and from within the sounds of ancient war horns boom but none dare enter… until now.\r\n\r\n==Summary==\r\nThis is my 2nd Skyrim Dungeon I\\'ve published. This is designed to be a challenging but brief dungeon and the rewards reflect the risk. This dungeon is about challenging combat and offers lots of it. I\\'ve concentrated on interesting use of game mechanics, atmosphere and design and I truly believe the Boss fight is a unique experience to Skyrim which I hope to improve further with your feedback.\r\n\r\nIt is also Radiant ready.\r\n\r\nMinimum level is 10, I\\'ve play tested with 3 characters (22, 24, 36) so if you give feedback on the combat please include your level. Finally I would also recommend the mod \\'Tougher Traps\\' in conjunction with any dungeon release I put out.\r\n\r\n==Where to find in game==\r\n\r\nSouth of Winterhold, south of Sightless Pit, north of Mount Anthor.\r\nTeleport Console: cow tamriel 24,18\r\n\r\nRevision 3 - First upload to Nexus.",
  "categoryId": "88",
  "version": "R3",
  "author": "Nashable",
  "createdUnix": "1329984233",
  "updatedUnix": "1329984346",
  "containsAdultContent": false,
  "uploadedBy": "nashable",
  "primaryFile": null,
  "files": [
    {
      "fileId": "35619",
      "name": "Mod Files",
      "version": "R3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "102",
      "fileName": "Mod Files-10900-R3.zip",
      "uploadedUnix": "1329984346",
      "modVersion": "R3",
      "virusScanUrl": "https://www.virustotal.com/file/89446cdbaa0f4f004273350d8e62f787a28d52fb3f7f40215eb7d38bba1d4845/analysis/1406707149/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mod%20Files-10900-R3.zip?fid=35619&ttl=1535771594&ri=8192&rs=8192&setec=8affa03a7895c0d41e00fa3d71e1c534"
    }
  ]
}