{
  "modId": 10903.0,
  "modName": "Star Wars Planets Skyrim Moon Replacers",
  "summary": "Here are 15 Star Wars re-placers for the Masser and Secuda moons. ",
  "descriptionHtml": "Here are 15 Star Wars re-placers for the Masser and Secuda moons. The resolution for the masser moons are 1024 x 1024 and the resolution for the secunda moons are 256 x 256. Just drag and drop these in your Skyrim data folder. I do not really know much about NMM, so I can only give instructions on dropping them in your data folder, sorry. Just extract the contents of the file somewhere and then look at the pics to choose and decide which re-placers you want to use. Then just open up their folder and just drag and drop the &#34;textures&#34; folder into your Skyrim data folder. The re-placers are as follows:\r<br />\r<br />Alderaan -\r<br />A planet that it is the home of  Princess Leia, Bail Organa, Tycho Celchu and also, in 4000 BBY, Ulic Qel Droma who fought in the Great Sith War. It is ultimately destroyed by the Death Star.\r<br />\r<br />Bespin -\r<br />Bespin is a major source of tibanna gas, which is refined for production and transport in Cloud City and used in hyperdrive coolant for starships, as well as in the production of blasters. It is home to several million individuals, including humans and Ugnaughts.\r<br />The planet is a gas giant that is about 118,000 kilometres (73,000 mi) in diameter. Like most gas giants, it has a solid core that consists of metal followed by layers of metallic gases. Many of the layers of gas are poisonous, and the pressure and temperature are far above what a human could tolerate. But from approximately 150 to 180 km (93 to 110 mi) down from outer space, there is a habitable layer known as the Bespin Life Zone. This layer has an oxygen atmosphere with the temperature and pressure that makes it ideal for human life. It is in this layer that Cloud City is located. Bespin has a number of moons. It has a 12-hour day, and completes an orbit around its star about every 14 earth years (10,220 Bespin days).\r<br />\r<br />Coruscant -\r<br />Coruscant is, at various times, the capital of the Old Republic, the Galactic Empire, the New Republic, the Yuuzhan Vong Empire and the Galactic Alliance. Not only is Coruscant central to all these governing bodies, it is the navigational center of the galaxy, given that its hyperspace coordinates are (0,0,0). Due to its location and large population, the galaxy&#39;s main trade routes Perlemian Trade Route, Hydian Way, Corellian Run and Corellian Trade Spine go through Coruscant, making it the richest and most influential world in the galaxy.\r<br />\r<br />Dagobah -\r<br />Dagobah, in the Sluis sector, is a world of murky swamps, steaming bayous, and petrified gnarltree forests. The ubiquitous white spiders that roam the swamps are actually newly sprouted seedlings of the gnarltrees that will take root and grow.\r<br />\r<br />Deathstar -\r<br />The Death Star is a moon-sized space station and superweapon. It is capable of destroying a planet with a single destructive energy beam.\r<br />\r<br />Endor -\r<br />Endor was notable for being the native home of the Ewoks, and being the location of the Battle of Endor, which would result in the downfall of the Empire and the first death of the Emperor Palpatine. Due to its proximity to the inhospitable Unknown Regions, Endor was a relatively quiet planetoid both prior to and after the battle.\r<br />Endor was also known for the vast amount of sentient species it supported, from baseline to exotic. This was largely due to the unusually large number of shipwrecks Endor experienced; it has been compared to a &#34;desert island&#34; in space.\r<br />\r<br />Hoth -\r<br />The sixth planet of the remote Hoth system. A desolate world covered with ice and snow, located in the Anoat sector, a rarely-traveled portion of the Outer Rim Territories, it became famous as the one-time location of the Alliance to Restore the Republic&#39;s Echo Base during the Galactic Civil War. The base was discovered by the Empire in 3 ABY, precipitating the Battle of Hoth, a major engagement that destroyed the Rebels&#39; base and gave them heavy casualties.\r<br />\r<br />Kamino -\r<br />Called Planet of Storms, Kamino is the watery world where the Clone Army for the Galactic Republic was created, as well as the Kamino Home Fleet. It is inhabited by a race of tall, elegant beings called the Kaminoans, who keep to themselves and are known for their cloning technology. Kamino is located just south of the Rishi Maze, and is governed by the Ruling Council, headed by the Prime Minister.\r<br />\r<br />Mustafar -\r<br />A fiery volcanic world where lava is mined like a precious natural resource. It is also the last capital of the Confederacy of Independent Systems and the site of the Separatists&#39; downfall, an event that shaped galactic history.\r<br />Mustafar is a very young and volatile world, being torn apart by opposing gravitational forces of the gas giants Jestefad and Lefrani, with the former being the closer of the two. Astride thick-skinned lava fleas, the natives leap across the lava fields to mine the planet&#39;s deadly natural resources. Mustafarians oversee the smelting facilities constructed by the Separatists on Mustafar.\r<br />\r<br />Mygeeto -\r<br />Since Mygeeto is locked in an ice age, giant crystallized glaciation and ice covers its surface, as well as huge crystal spurs. Because of this, Mygeeto meant &#34;gem&#34; in the ancient trade language of the Muuns. Mygeeto&#39;s internal fires long since cooled and had left a colossal deposit of precious stones within its crust and mantle. The immense assets of nova crystals and fields of lasing crystals make Mygeeto one of the wealthiest worlds in the galaxy. It hosts artesian crystals and relacite. The planet&#39;s ice shelves are home to a species of huge and aggressive worm-like creatures.\r<br />\r<br />Naboo -\r<br />A planet that is the sector capital of the Chommell Sector near the Outer Rim territories. It is a largely unspoiled world with large plains, swamps and seas. It is mostly known as the homeworld of notable historical figures who played major roles in the downfall of the Old Republic and the rise of the Galactic Empire, namely Padmé Amidala, Supreme Chancellor Palpatine and Jar Jar Binks.\r<br />\r<br />Neimoidia -\r<br />A planet in the Colonies region that the Duros colonized sometime around 25,000 BBY, bringing it into the Galactic Republic. Neimoidia was ruled by a Trade Monarch, reflecting the Neimoidian&#39;s obsession with trade, commerce, and money. That was also present in the Neimoidian Inner Circle, the government/legislature of the planet.\r<br />\r<br />Rattatak -\r<br />An Outer Rim world unknown to the Galactic Republic at the time of the Clone Wars. It is a dry, arid, mountainous planet covered in red rock, judging by its appearance from orbit. Most settlements appeared to be hewn into the rock itself. Rattatak was one of the unexplored planets in the galaxy. Isolated, the Rattataki fought each other as well as at least one other sentient species in never ending battles. \r<br />\r<br />Tatooine -\r<br />A desert world and the first in a binary star star system that has three moons and is in the Arkanis sector of the Outer Rim Territories. It is inhabited by poor locals who mostly farm moisture for a living. Other activities include used equipment retailing and scrap dealing. The planet is on the 5709-DC Shipping Lane, a spur of the Triellus Trade Route, which itself connected to the Sisar Run. The planet is not far from the Corellian Run. It also has its own navigation system.\r<br />\r<br />Yavin 4 -\r<br />One of three habitable moons orbiting the gas giant Yavin. It is mainly covered in jungle and rainforest, and despite being remote and unheard of, it plays an important role in galactic events, serving as the base of the Alliance to Restore the Republic during the Battle of Yavin and as a battlefield in other battles of the Galactic Civil War. An attack was launched on the Death Star from this moon.\r<br />\r<br />\r<br />That was a little background information, thanks to Wookieepedia. I&#39;m using a lighting mod, so my in-game pics may vary from yours. That being said, I hope you all like these re-placers and please endorse if you do :-)\r<br />\r<br />I&#39;d like to give credit to Bethesda, Skyedit and Wookieepedia.\r<br />And also to all those that made the original planets, moons and Deathstar, from where I got my ideas and textures to re-texture. Mainly from using Google and Wookieepedia to find pics and to get information.\r<br />\r<br />-avenger86",
  "categoryId": "29",
  "version": "1.0",
  "author": "avenger86",
  "createdUnix": "1329987320",
  "updatedUnix": "1329987963",
  "containsAdultContent": false,
  "uploadedBy": "avenger86",
  "primaryFile": null,
  "files": [
    {
      "fileId": "35638",
      "name": "Star Wars Planets Skyrim Moon Replacers WIP",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "46635",
      "fileName": "Star Wars Planets Skyrim Moon Replacers WIP-10903-1-0.zip",
      "uploadedUnix": "1329987963",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c85dae8156f9fba593506c03f213102961a7ec00c12621890c69ce4ae27af2e3/analysis/1406707338/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Star%20Wars%20Planets%20Skyrim%20Moon%20Replacers%20WIP-10903-1-0.zip?fid=35638&ttl=1535771600&ri=8192&rs=8192&setec=725380381a61747f5839c416b83e7c3b"
    }
  ]
}