{
  "modId": 10929.0,
  "modName": "Skyrim - An Alternate Reality",
  "summary": "An alternate reality for Skyrim! No main quest, no dragons and no Dovahkiin. A fresh start with the freedom to do what you want, when you want (THIS IS A PLUGIN, NOT A SAVEGAME)",
  "descriptionHtml": "============================\r\nSkyrim - An Alternate Reality\r\n============================\r\n\r\nNOTE: THIS IS A PLUGIN, NOT A SAVEGAME.\r\n\r\n\r\n\r\nThis mod provides an alternative start where you will begin a new game \r\nin a similar way to the default game as a traveller crossing the border \r\nfrom Cyrodiil to Skyrim, but in this reality you do not run into the \r\nImperials and therefore do not become a prisoner destined for execution.\r\n\r\nYour personal timeline from this point onward is now different. Because \r\nyou are not captured, your destiny is also changed. You don\\'t get to meet \r\nRalof or Hadvar in Helgen, meaning you don\\'t receive word to travel to \r\nRiverwood and then consequently, to Whiterun. In this reality, Alduin has \r\nnot returned and your destiny to become \\'Dovahkiin\\' has dissolved into the \r\nthreads of some unrealised reality in some unrealised universe. \r\n\r\nHere, in this world, you are now free to go where you want, when you want.\r\n\r\nWho will you be? What race are you? Do you seek adventure, wherever it lies? \r\nOr do you live the quiet life, minding your own business? Will you become a \r\nstrong warrior or a powerful mage? A married family man, earning an honest \r\nwage, or a sneaking thief, simply stealing everything you desire?\r\n\r\nWhichever path you choose, you will start at the bottom with very little and \r\nhave to slowly work your way up. Good luck!\r\n\r\n\r\n=============================\r\nWHAT THIS MEANS FOR YOUR GAME\r\n=============================\r\nThe game still begins with the titles and intro music as before. When the titles \r\nfade, your character will be walking into Skyrim from close to the border with \r\nCyrodiil. For a few short seconds, you will not be able to control movement or \r\nhave access to the game menu. You will then get to pick your race and appearance \r\nas normal. An on-screen message box will welcome you to the world and from this \r\npoint on, you will have full control.\r\n\r\nThe town of Helgen, although deserted, is now fully intact and open to you.\r\n\r\nThere are still lots of references in the game to the dragons returning and the \r\nattack at Helgen etc, but you\\'ll just have to ignore all that! I *MAY* consider\r\nworking on an update that removes/alters these references, but that will be a \r\nmajor undertaking.\r\n\r\nHigh Hrothgar will remain locked as the location is only relevant to the main quest.\r\n\r\nWord Walls are useless to you because you are not dragonborn and have no shouts.\r\n\r\n\r\n==========\r\nMAIN QUEST\r\n==========\r\nThe whole point of this mod is to play without the main quest and to live a life \r\nfree from dragons and the whole \\'dragonborn destiny\\'. However, if you wish to get \r\ninto the main quest, simply enter the following in the console:\r\n\r\n\tsetstage mq102 30\r\n\r\nThis will update your journal with instructions to head to Whiterun with news of \r\nthe dragon attack on Helgen. From here on, the main quest will run as normal.\r\n\r\n\r\n============\r\nINSTALLATION\r\n============\r\nThere are two versions in this folder. One with normal starting map markers and \r\nthe other with all starting markers disabled until you discover them. To install, \r\nplace the plugin and \\'scripts\\' folder (from the version of your choice) into your \r\nSkyrim/Data folder.\r\n\r\nEnjoy!\r\n\r\n\r\nStannieDum\r\nFebruary 2012",
  "categoryId": "24",
  "version": "1.0",
  "author": "StannieDum",
  "createdUnix": "1330006532",
  "updatedUnix": "1330021332",
  "containsAdultContent": false,
  "uploadedBy": "StannieDum",
  "primaryFile": null,
  "files": [
    {
      "fileId": "35729",
      "name": "Skyrim - An Alternate Reality",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "693",
      "fileName": "Skyrim - An Alternate Reality-10929.rar",
      "uploadedUnix": "1330006644",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/21b8006af8e93e53806253dbe42112511a841e478ec722d67b0788be1f363494/analysis/1406707698/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20-%20An%20Alternate%20Reality-10929.rar?fid=35729&ttl=1535771744&ri=8192&rs=8192&setec=c2b8e455e366b08b7cfb5d7d6ad1b81a"
    },
    {
      "fileId": "35836",
      "name": "Update 1_01",
      "version": "1.01",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "35",
      "fileName": "Update 1_01-10929-1-01.rar",
      "uploadedUnix": "1330021332",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/5e2164e34856256cb444e6ed97afe953ab1f612a5bb72850e756636b9574fdf4/analysis/1406708246/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Update%201_01-10929-1-01.rar?fid=35836&ttl=1535771744&ri=8192&rs=8192&setec=31ae2efb295ab339a15d100b286a7fd6"
    }
  ]
}