{
  "modId": 10965.0,
  "modName": "The Poisoners Bow",
  "summary": "A way to deliver poisons without getting caught",
  "descriptionHtml": "The problem with poisons in Skyrim, is you have to have an insane sneak skill to use them as a stealth weapon. And for the most part, that\\'s okay. When you can swing a sword and do 3 times the damage of a poison, why bother? Why not just sell the poisons for the gold you can make, right?\r\nThis mod was inspired by Tactless Toxins (http://skyrim.nexusmods.com/downloads/file.php?id=10868), a mod that adds some very wonderful poisons to the game. But the problem remained, how to deliver the poisons to unsuspecting victims and have them stay unsuspecting victims?\r\nAnd thus, the Poisoner\\'s Bow was born. \r\nThe bow is lightweight and does zero base damage. The Poisoner\\'s Arrows are much the same.\r\nAnd I\\'m sure you\\'re wondering why you should use this, right?\r\nWell, ever have an ambush go wrong, because you weren\\'t quite stealthy enough? No more! The Poisoner\\'s Bow and Arrows don\\'t draw enemy attention. You can fire them into someone all day long and they won\\'t care!\r\nNow your ambush will go off cleanly, because you can drop poisons into the enemy ranks without them becoming suspicious.\r\n\r\nNotes(You might want to read these):\r\nThe Bow and Arrows are both marked \\'non-hostile\\'. This means that you can shoot someone in the face and they won\\'t report you. They DO NOT increase or in any way modify your ability to stay hidden. On a side note, I recommend Nazeem for target practice.\r\nTo obtain the bow and arrows, it\\'s one firewood for the bow and one firewood for ten arrows. Bow is in iron, and arrows are in miscellaneous. Which confuses me since the arrow recipe is patterned off the bow recipe...\r\nAlthough the bow itself doesn\\'t cause anger, the poisons will. But, in all my tests(which is admittedly a small number) the enemies can\\'t seem to figure out where the arrow came from. They do a standard search pattern around where they are and then go back to what they were doing. Neutral and friendlies don\\'t even do that. They won\\'t register it as a bad thing until you actually kill someone.\r\nIf anything else doesn\\'t work as advertised, let me know. Can\\'t fix what I don\\'t know is broken and as my Skyrim CTD\\'s a lot, I can only run the most basic tests and none of the longer term ones.\r\n\r\nUPDATE!\r\nSo! I\\'ll be getting Dawnguard in the next month or so. That means the Poisoner\\'s Bow will be getting several new variants. Including those variants I promised you when it first came out.\r\nReal sorry about that, but I had an attack of life, work, and college.\r\nNew aesthetics should be expected in the next week or so, barring any real life issues and the other two planned versions should appear within a month. Dawnguard exclusive content sometime in the next two.\r\nAs such, if you have any bugs you\\'d like to report, please do so now, so I can fix them before this next update.\r\nFuture Plans:\r\nNothing too ambitious.\r\n-Different models for bow and arrow(because I know not all of you want a longbow and dwarven arrows)\r\n-A version that makes it a minor crime to use the bow. It doesn\\'t deliver health and wellness to your targets, after all. Though that is an idea...\r\n\r\n\r\nCredits:(Just to make sure I\\'m getting everything)\r\nBethesda. Because without them, I might actually get something constructive done.\r\nAli123 and their mod Saber\\'s Swords(http://skyrim.nexusmods.com/downloads/file.php?id=3542). Because without their screwy enchantment, I might never have grabbed the CK.\r\nMagic Fork and his wonderful Tactless Toxins(http://skyrim.nexusmods.com/downloads/file.php?id=10868) mod. Without you, my friend, this mod would not exist. Thank you for inspiring the Poisoner\\'s Bow and making it worthwhile.",
  "categoryId": "55",
  "version": "1",
  "author": "Andellmere",
  "createdUnix": "1330024988",
  "updatedUnix": "1330025122",
  "containsAdultContent": false,
  "uploadedBy": "Andellmere",
  "primaryFile": null,
  "files": [
    {
      "fileId": "35867",
      "name": "Poisoners Bow",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Poisoners Bow-10965-1.rar",
      "uploadedUnix": "1330025122",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/17cabc4184ed81eccea4b9b72e143bc9e3dd779c197782874d1243a57b7c3324/analysis/1406708285/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Poisoners%20Bow-10965-1.rar?fid=35867&ttl=1535771810&ri=8192&rs=8192&setec=cd6c68c94bd2f3483c289d1d48f9e59e"
    }
  ]
}