{
  "modId": 10975.0,
  "modName": "Biet Akhrin",
  "summary": "\\\"Brit-Ahkrin\\\" is Dragon -Tongue for \\'beautiful-courage.\\\"  Basic starter home for Player and one companion near Riverwood. \r\nStorage, cooking, hearth, inside toilet, two beds, some books, no uber items, companion friendly.  \r\n\r\n[Brit-Ahkrin is a single esp file, There are no loose files, no bsa, only master/dependency is Skyrim.esm]  Mod require",
  "descriptionHtml": "\\\"Brit-Ahkrin\\\" is Dragon -Tongue for \\'beautiful-courage,\\'  a place for your character / avatar to begin a new and worthwhile life.  It is a basic rustic cottage- just SWof Riverwood - intended for immersion, roleplay, balance, and to give Dovakiin (and one companion) a safe base from the beginning of the game.  \r\n\r\nThe house is \\'free,\\' (owned by player faction) just outside Riverwood.   Brit-Ahkrin has a unique memorial to Akatosh, a little food, a working cook pot on the hearth, an indoor toilet, sleeping for two - and NO uber items. All containers (sacks, barrels, and chests) are safe for storage.  Items are deliberitaly \\'mis matched\\' to add to feel of home being poor, thrown together from cast off or scrounged items, but useful. Items acquired in your early travels may be displayed on the mantle or the shelves.  Only vanilla resources used.  There is also a back story (in journal).  Brit-Ahkrin is fine as a stand alone abode (just ignore the journal).\r\n\r\nTo locate the home, go SW from Riverwood along the road,  You will see it\\'s roof off to the left.  Follow the road a bit more, round the bend, and you will see a lamp post with two lamps.  Ascend the wooden stairs and you are home. \r\n\r\nOnce established, moving on to nicer digs, is expected.  Brit-Ahkrin (casa uno version) then becomes a rustic retreat - a place to rest, relax, recover, plan, (hide out?) and remember your beginnings in the \\\"Bron\\\"  - the North.\r\n\r\nThe mod is also the jumping off point for a major quest line.  Cottage is fine as a stand-alone starter base for new characters.  Enjoy the journal as backstory.  The quest is WIP. Journal and NPC driven.  This means that quest markers will be few, so keep your journals, make notes on conversations, and have captions set to on.  I hate needle in a haystack quests, so clues to what and where, next, will be farily obvious, if you pay attention.  Read the journal in the cabin to find out more.\r\n\r\nArchive contents:\r\nBrit Ahkrin.esp\r\nBrit Ahkrin - readme\r\nBrit Ahkrin - screen shots\r\nLegacy\\'s Shadow -WIP\r\n\r\n----------------------   Modders    ---------------------------\r\n\r\nConstructive criticism is welcome - if presented specifically and politely.  Advanced modders are welcome to take a look, and suggest more efficient or better ways to implement Brit-Ahkrin mod in future versions.  \r\n\r\nonly cell edited is \\\"Riverwood06\\\"     3, -13\r\none vanilla patrol marker for NPC (a thief) moved about 6 in game feet.\r\nIncompatible with any mod that changes cell 3, -13  .\r\n\r\n---------------------   Future Plans ----------------------------\r\nBrit-Ahkrin will be the first of several abodes.  Each successive abode will be \\'better\\' that previous ones.  Eventually, I will link them together in a quest-story line.  Ever wonder what happened to ...?  The idea is to give players a way to have realistic (non-uber) homes that grow with your avatar.  \r\n\r\nAnd if you happen to make Skyrim safer for travelers, and become guildmaster of the Wanderer\\'s Guild, and curator of a unique and awesome Museum, well, why not?  Enjoy the journey.  Its a \\\"Brit-Ahmik,\\\" a beautiful service.\r\n\r\n- ElanaAgain, February, 2013.\r\n\r\n\r\n",
  "categoryId": "67",
  "version": "1.04",
  "author": "ElanaAgain",
  "createdUnix": "1330029191",
  "updatedUnix": "1362101407",
  "containsAdultContent": false,
  "uploadedBy": "elanaagain",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000010432",
      "name": "Biet Ahkrin",
      "version": "1.03",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "90800",
      "fileName": "Biet Ahkrin-10975-1-03.rar",
      "uploadedUnix": "1361063291",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/1b1100eae0b505fb95928b549efaecf89813e41e19ea838475dfcd0b137394c9/analysis/1407421616/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Biet%20Ahkrin-10975-1-03.rar?fid=1000010432&ttl=1535771822&ri=8192&rs=8192&setec=85b8a39f5daa97cce2c99f7ff46438ab"
    },
    {
      "fileId": "1000014053",
      "name": "Biet Ahkrin",
      "version": "1.04",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "96570",
      "fileName": "Biet Ahkrin-10975-1-04.rar",
      "uploadedUnix": "1362101407",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/30b3edd7b37c68b072298b5c707b42344a3f2ca445a965abf1277f962d3e7803/analysis/1407445206/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Biet%20Ahkrin-10975-1-04.rar?fid=1000014053&ttl=1535771823&ri=8192&rs=8192&setec=05c7bd5c32191d57e36c8ed80eeafa37"
    }
  ]
}