{
  "modId": 10998.0,
  "modName": "Enchanted Items overhaul and new enchantments",
  "summary": "Mod with new enchantments and 30 new meshes totaling in 300+ new magic weapons. Makes finding them more to morrowind\\'s levelled lists, options for making magic items rare set at 20%, and 50%",
  "descriptionHtml": "1. Description and mod future\r\n2. Installtion (READ CAREFULLY!)\r\n3. Credits\r\n\r\n[color=#FF4000] New Enchantment Items can be bought at Belethor\\'s in whiterun if you want to buy them for new enchantments or try them out wihtout looking for them however they are expensive. [/color] \r\n\r\n\r\nAll new enchantments are being made to be balanced and lore friendly, they are powered to how rare they are.\r\n\r\n\r\n[color=#FF4000] 1. Description, Enchanted Items Overhaul [/color] \r\n\r\nMakes enchanted items far more RARE with settings for 15% (default main file) or 50% (if you dont want the items to be ultra rare)\r\n\r\nI didnt like the levelling system of Skyrim as it was too much like oblivion. This basically changes it to halfway between oblivion and morrowind  where yes theres a chance of finding a powerful weapon at the start of the game, but its such a small chance that it doesnt ruin the gameplay.\r\n\r\nThis is meant to be played with the main file only,  magic items are very POTENT and now you must earn them by slaying a powerful foe, theres no more 5 bandits huddling around a chest full of powerful artifacts but only using their iron axes. there will be a chance to find ANY weapon at ANY level, but at level 1 you will have (approximatly) a 5% chance of ever finding a daedric level weapon, \r\nThere is an 15% (or 50% depending on what file you choose) chance that when you encounter a boss level character (vampire master, deathlord, bandit chief etc) that they will be carrying a magical item. This item is completely random from all availiable items and weapons (AS WELL AS THE 30 new weapons with 300 variations of magical effects)\r\n\r\nNot all weapons are shown in the pics, many more are avaliable\r\nNew Enchantements are as follows:\r\n\r\nDisarm on Strike ( disenchantable)\r\nStagger on Strike ( disenchantable)\r\nFreeze Solid on strike ( disenchantable)\r\nFortify Destruction Spell Damage (stackable, disenchantable)\r\nFortify illusion Spell level effect (stackable, disenchantable)\r\nFortify Conjuration duration ((stackable, disenchantable)\r\nFortify Alteration Duration (stackable, disenchantable)\r\nFortify Healing spell effects (stackable, disenchantable)\r\nShadowfire (new enchantment) (Stacks) (Creates a black swirling energy around the wearer, causing shadow damage (ignores resistances) to nearby enemies. Can be worn twice to stack damage but doesnt stack after 2 items worn) NOT DISENCHANTABLE, has some strange effects when I attempted this.\r\nDestiny (new enchantment, constant clavoience effect) (disenchantable)\r\n\r\nGuardian = Reduces damage from evil creatures by 60% (does not stack, werewolves, vampires, deadra and other undead affected)\r\nIncreased Movement Speed (stackable, disenchantable)\r\nGuiding Light (Creates a ball of light to follow the wearer)\r\nFortify Attack damage of all by 20% (Doesnt Stack) (same kinda thing as fortify attack in morrowind)\r\nNighteye ( disenchantable)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nUses about 30 new meshes and textures created for the weapons of the third era mod\r\nwith 300 variations of the new weapons.\r\nMagic items are now very rare, but more powerful\r\n\r\nThe main reasons for making this file was because it becomes too easy\r\nto become powerful, now there is a chance to find any weapon at any level but the chances are very small.\r\nMy aim is to give finding a magical item a feel similiar to other fantasys such as Lord of the rings, where items like gandalf\\'s staff, the one ring, aragorns sword, etc are very rare but are powerful items that are worth finding.\r\nMostly only bosses carry magic items now \r\nYou can still buy items at random from venders, but the chances are significantly decreased.\r\nLower level items are rare, higher level items are extremely rare. \r\nWeaker enemies have non enchanted items ranging between iron, steel, silver, dwarvern, elvish and orcish from the start.\r\nBoss level enemies have silver, orcish and steel from the start, with a very small chance of having an ebony or daedric weapon (about 10%) and about a 5% chance of having something enchanted.\r\nAfter 24 real time hours of gameplay, I found only about 10 magical items, only of which 1 was of any use. That was with all items set to 5% chance of finding one. So I changed the settings to 15% to give players a better chance at finding something.\r\n\r\n\r\n\r\n[color=#FF4000] MOD FUTURE[/color] \r\nMore enchantments and items \r\n\r\nI also need to get the value of items corrected. Some go crazy and are worth 1000000 where others are worth 1 of the same type. This is a minor issue for now, ill update it soon when I get the time.\r\nTheres a few other minor bugs, but anything ive found thats buggy hasnt been included in this version to minimize problems. It should be fairly stable at the moment, but if you find anything that doesnt make sense let me know and ill have it done for the next version.\r\n\r\n\r\n [color=#FF4000] 2. Installation. [/color]\r\nDownload the meshes and textures and Copy straight to the Skyrim / data folder\r\n\r\nThen Download the ESP files\r\nONLY USE 1! Normal has items set to about 15% chance, or the 50% chance for more common magic items.\r\nThe reason they are seperate is so I dont have to upload the meshes and textures each time I update and so gamers dont have to download the whole package when updating.\r\nThere will be a update file for each version, that is all you will need to update from an old version. But if its your first download of this mod, you will need both the meshes and textures and the main file (currently Version 2)\r\n\r\n\r\n\r\n\r\n\r\n[color=#FF4000] 3. Credits [/color]\r\n\r\nCredit goes to the creator of the weapons of the third era mod for their meshes and textures. I did not make the items meshes and textures, I made the enchantments, levelled lists and the ability to temper all the items at the forge. So all weapons are fully upgradable with smithing.\r\n\r\n\r\n [color=#FF4000] Issues and bugs [/color]\r\n\r\nConflictions and usuage\r\nThis will conflict with anything that adits the levelled lists.\r\nNot compatible with weapons of the third era mod, as it includes that mod\r\n\r\nYou may NOT upload this anywhere else or use it in your own mods, unless you ask me first\r\n\r\n",
  "categoryId": "75",
  "version": "2.1",
  "author": "thelonewarrior",
  "createdUnix": "1330041011",
  "updatedUnix": "1330270626",
  "containsAdultContent": false,
  "uploadedBy": "thelonewarrior",
  "primaryFile": null,
  "files": [
    {
      "fileId": "36452",
      "name": "Enchanted Items Overhaul Meshes and Textures Only",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "84645",
      "fileName": "Enchanted Items Overhaul Meshes and Textures Only-10998-1.zip",
      "uploadedUnix": "1330135288",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/0dce022acfb5f0ea4a3259a6c90cd540643d558398a25cc8dbd3223c0b41400d/analysis/1406711303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enchanted%20Items%20Overhaul%20Meshes%20and%20Textures%20Only-10998-1.zip?fid=36452&ttl=1535771861&ri=8192&rs=8192&setec=f24f90eaa784e9529b16aab0f20b5d32"
    },
    {
      "fileId": "37115",
      "name": "New Version with new enchantments",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "120",
      "fileName": "New Version with new enchantments-10998-2-1.zip",
      "uploadedUnix": "1330270626",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/9d62f88dee78f385a18abd4565c91d110ca5d74237622afdc6b69a9ebcc013d7/analysis/1406714788/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Version%20with%20new%20enchantments-10998-2-1.zip?fid=37115&ttl=1535771861&ri=8192&rs=8192&setec=b6171dbf018f8aba4d4616688f46b208"
    }
  ]
}