{
  "modId": 11028.0,
  "modName": "Curse of the Werewolf Mod",
  "summary": "THIS MOD IS FOR HARDCORE PLAYERS, WW-LOVERS AND REALISM FANBOYS ONLY",
  "descriptionHtml": "This mod is also downloadable at Steam Workshop: http://steamcommunity.com/sharedfiles/filedetails/?id=12953. However, I cannot upload the mod there at the moment (it contains an old version), so I\\'ll move here to Nexus.\r\n\r\nInstall: Unzip the files into your Data-folder.\r\n\r\n-------------------------------------------------\r\nCurse of the Werewolf Mod by Fennica\r\n-------------------------------------------------\r\nVersion 1.8 BETA\r\n\r\n------------\r\nSummary\r\n------------\r\n\r\n***THIS MOD IS MEANT FOR HARDCORE PLAYERS, WW-LOVERS AND REALISM FANBOYS***\r\n\r\nIf you want your werewolf to be a godly killing machine, then you\\'re obviously in a wrong place. There\\'s tons of mods for that kind of wussiness.\r\n\r\nThis mod aims to give you the feel of the CURSE being a werewolf. The hunger, the need to kill, the brutal reality of the changes, etc. You don\\'t have to be \\\"in-game-werewolf\\\" by Companions quest-chain in order to use this mod. Just load it and get the curse on you character.\r\n\r\n-----------------------------------------\r\nDependencies & my suggestions\r\n-----------------------------------------\r\n- This mod has NOT been fully tested with most of the other mods (see exceptions below). I will not take responsibility for incompatibility issues with any other mods.\r\n- I recommend using the Hypotermia (http://skyrim.nexusmods.com/downloads/file.php?id=6745) and Total Realism (http://skyrim.nexusmods.com/downloads/file.php?id=10843) -mods with this mod to get the ultimate realistic feel. Also, with Total Realism, feeding lowers your hunger and thirst, but you have to load that mod before all other mods. Hypothermia intervenes with the silver damage done to the player so that no damage from silver is taken. This can be circumvented by changing the load order so Hypothermia loads before my mod.\r\n- With a new character consider putting difficulty to Novice (yes, Novice) and run a console command \\\"player.setav health 10\\\" for better balance (= nerf all for realism).\r\n- Consider using body mods that remove clothing to add... er... more realistic feel...\r\n- Use Wait, Sleep and Fast Travel with caution as they may produce undesireable results.\r\n- Avoid feeding, if you\\'re full (Magicka-bar represents your saturation in beast form). You should preserve your victims for later feasting. Consider waiting 2 hours, kill, feed (on humans), repeat. Or just hunt animals all night long.\r\n- Consider disabling the compass at SkyrimPrefs.ini. Change bShowCompass=1 to bShowCompass=0.\r\n- REALLY hardcore-players (like me) will do a new character EVERY time they die, no saves.\r\n\r\n----------------\r\nModifications\r\n----------------\r\nIn first load:\r\n- You will not heal in combat anymore.\r\n- Mod asks if you wanna wake up in different location without your items (as if you were just transformed back)\r\n\r\nChanging into a werewolf and back:\r\n- You will change at nightfall and change back at dawn.\r\n- Taking damage sometimes changes you for a short time. You can modify the chance, however, by console command \\\"SET AggressionModifier to XXX\\\". Default is 100%, which means that taking 50% damage to your current health is 50% chance to change (1:1). 0 = no chance. 200 means that taking 50% damage is 100% chance to change (1:2), etc.\r\n- Sometimes you will change randomly for a short time. This can also be modified by a command \\\"SET RandomChangeChancePerHour to XXX\\\". Default is 8% (transform approximately once per 12h). Set this to 0, if you don\\'t want to change randomly at all.\r\n- Changing DESTROYS ALL your gear. All of it. For item hoarders I have added a Global Variable, which you can manipulate if you wish to come back at your precious stuff. Just use console command \\\"set ImACrybaby to 1\\\". Your stuff is stored to a large sack on your feet when you transform.\r\n- When changing, you\\'re invulnerable.\r\n- When transformation is complete, the Fear-effect is activated\r\n- Fear Effect doesn\\'t work to WerewolfBeastRace (Werewolves in beast form).\r\n- Night-eye automatically activates at night\r\n- Changing back will hurt you and drop your stamina to zero\r\n- You can optionally get a warning before you change. Use command \\\"SET WerewolfWarningTime to XXX\\\". Default is 0 seconds. 10 means you get a warning 10 seconds before etc.\r\n\r\nBeing a werewolf:\r\n- No, not any buffs here, sorry.\r\n- When in the beast form, you must feed on humans every 3 hours, or the beast consumes you within. This can be modifed with console command \\\"SET MustFeedModifier to XXX\\\". Default is 1. Setting 2 means you die in about 1.5h. Setting 0.5 means about 6h. Don\\'t tell me if you use 0, it makes me puke.\r\n- You can feed on animals too, but you need approximately one in every half an hour.\r\n- Feeding does not give you more time as a werewolf (it is irrelevant & obsolete in this mod)\r\n- Feeding removes all items from your victim as you devour those as well (what an appetite...)\r\n- If you let the beast get starved, it takes over and you wake up in different place, finding out that you did terrible deeds while in blackout...\r\n\r\nOther effects\r\n- You cannot heal when clothless (=feeling cold).\r\n- If you\\'re playing with a clothless female character, people wont just ask you to get dressed, they will take action.\r\n- Wolves don\\'t attack you in human or beast form\r\n- Sometimes Silver Hand tracks you down. They are immune to your Howl and their silver weapons do extra damage\r\n\r\n-------------------\r\nChange history\r\n-------------------\r\nVersion 1.8 BETA\r\n- Sound effect (heartbeat) when receiving the tranformation alert\r\n- Max. arrows attached to your body increased to 10 and they stay there for 60 secs (What? I love watching them!)\r\n- When using the Total Realism -mod with this, feeding lowers hunger by 10 and thirst by 1 \r\n- When first loading this mod, it asks (twice, cos it\\'s bugged ATM) if you wanna wake up in different location without your items\r\n- If you let the beast get starved, it takes over... (don\\'t worry about the flashing)\r\n- Fear is now roused before transformation, not after\r\nVersion 1.7\r\n- Global Variable WerewolfWarningTime\r\nVersion 1.6\r\n- Werewolfbeastrace is immune to Fear Effect\r\n- Modifiable random changes\r\n- Modifiable feeding requirements\r\n- Modifiable changing chance\r\nVersion 1.5\r\n- Removed hungry, cold and sleepy -functionality as there are better mods for that\r\n- Removed automatic health nerf\r\n- Added item retrieval option\r\nVersion 1.4\r\n- Feeding from Silver Hands damage you\r\n- Fixed a bug that didn\\'t do any bonus damage to PC from silver weapons when in human form\r\nVersion 1.3.2\r\n- Fixed a bug conflicting with the Companions\\' quest-line\r\nVersion 1.3.1\r\n- Fixed various bugs about messages and fixed Night Eye removal\r\nVersion 1.3\r\n- Feed on animals\r\n   - Gain less \\\"soul\\\" when feeding on animals\r\n- Feeding removes all items on victim\r\n- Removed Bloodlust\r\nVersion 1.2.1\r\n- Repaired a bug that allowed the Silver Hand to own your arse when transforming. Now you just have to be quick\r\nVersion 1.2\r\n- Silver Hand\r\nVersion 1.1.1\r\n- Repaired a bug in how long the change is going to last at nights\r\nVersion 1.1\r\n- When you return to your human form, your stamina will drop to zero\r\n- During transformation, a \\\"Fear\\\" effect is activated\r\n- Night-eye automatically activates at night\r\n- Wolves don\\'t attack you in human or beast form\r\n\r\n---------------\r\nKnown bugs\r\n---------------\r\n- Reported once: Werewolf is not able to attack. Need more info.\r\n- Reported once: Nighttime transformation happens at day, 2 PM. Need more info.\r\n- Mod asks 2x if you wanna start as a newborn\r\n- Waiting and Sleeping are not fully compatible\r\n- Updating the mod from an old version to new one sometimes seems to lead to undesired results. It is recommended to unload the mod, start Skyrim, load the savegame, save anew, close Skyrim, load the mod, start Scyrim and load that savegame.\r\n\r\n--------------------------\r\nFuture development\r\n--------------------------\r\n- When werewolf dies, he changes back to humanoid form\r\n- When changing back, wake up somewhere else.\r\n- Craft fur-armors with ease and without forge\r\n- Only humanoid males will go after a clothless female character. Guards will put you into jail instead.\r\n- Jailing: many improvement ideas here, gotta do something about them. 1st time your head gets shaved, 2nd time they execute you etc.\r\n- Companions and other npc werewolves use their beast form in battle (could be tough one to make)\r\n- In consideration: Unarmed combat is increased dramatically so that, in human form it is virtually impossible to lose a \\\"bar fight\\\" -> I\\'ll probably add a knockback-effect without any damage-buffs, cos like I said, I don\\'t wanna buff the beast too much\r\n- Detect Life active when in beast form and needs to feed\r\n- All encountered wolves will follow you as their alpha\r\n- Silver weapons do damage if held\r\n- Option: Do not get lycanthrophy automatically, but get it as an infection from other werewolves from the wild\r\n- Global Variable: Nighttime changing chance (now 100%)\r\n- AI control fully/partially when in beast form\r\n- Eating too much causes frenzy, AI takes over and you found wake up in different location.\r\n- Optional item destroy specifics (i.e. only armor will be destroyed or all items drop into the ground one by one)\r\n- Ring of Hircine & fighting the curse.\r\n- Option: Transform only in full moons. \r\n- Dogs attack & horses flee \r\n- Townsfolk sometimes comes to lynch you (with big numbers)\r\n\r\n--------------------\r\nReporting bugs\r\n--------------------\r\nI will take great interest with receiving bug reports and with fixing them. Keep in mind, however, that I only fix bugs which are related to modifications listed above. Any \\\"bugs\\\" reported outside of that list will have no meaning to me. Also, please do recognize the differences between a bug and a feature. Feature is a function meant to work in specific way and a bug is a function that works wrong. In order to fix a bug, I first need to reproduce it. For that, I need information from you.\r\n\r\n--------------------------------------------------------\r\nSuggesting modifications to this modification\r\n--------------------------------------------------------\r\nI will hear you out of course, but please keep in mind that this mod is firstly to me and secondly to you. If I, however, take notice that your suggestion is in line with the basic idea of this mod AND it is scriptable with a decent timeline by me, I will do it with pleasure. Polite and constructive feedback will always get you better results than just whining and raging.",
  "categoryId": "24",
  "version": "1.8BETA",
  "author": "Fennica",
  "createdUnix": "1330073051",
  "updatedUnix": "1331328117",
  "containsAdultContent": true,
  "uploadedBy": "Fennica",
  "primaryFile": null,
  "files": [
    {
      "fileId": "36800",
      "name": "Curse of the Werewolf v1-5",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20",
      "fileName": "Curse of the Werewolf v1-5-11028.zip",
      "uploadedUnix": "1330210060",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/3c262042cda8c60ecfa995ac3c5713e17f396c8b55470601d6d7f50389112a30/analysis/1406712997/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Curse%20of%20the%20Werewolf%20v1-5-11028.zip?fid=36800&ttl=1535771917&ri=8192&rs=8192&setec=7d8789348176e5b42ba690d1877d3002"
    },
    {
      "fileId": "38150",
      "name": "Curse of the Werewolf v1-6",
      "version": "1.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20",
      "fileName": "Curse of the Werewolf v1-6-11028.zip",
      "uploadedUnix": "1330463624",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/0d2ae40292c48fb2ae8fdcfd748eefff2cd31b52f639ad747f3216b843579068/analysis/1406719881/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Curse%20of%20the%20Werewolf%20v1-6-11028.zip?fid=38150&ttl=1535771917&ri=8192&rs=8192&setec=71e79d4290f669b0f157d29af013b99a"
    },
    {
      "fileId": "38528",
      "name": "Curse of the Werewolf v1-7",
      "version": "1.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20",
      "fileName": "Curse of the Werewolf v1-7-11028.zip",
      "uploadedUnix": "1330543550",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/b7697681327ce63a10c57c4a5416bd8bc795ac70febadf8a25a585969b6199b5/analysis/1406721797/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Curse%20of%20the%20Werewolf%20v1-7-11028.zip?fid=38528&ttl=1535771918&ri=8192&rs=8192&setec=1b8b818661d941d4da8bf6fa4bbf74a4"
    },
    {
      "fileId": "41767",
      "name": "Curse of the Werewolf v1-8 BETA",
      "version": "1.8BETA",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27",
      "fileName": "Curse of the Werewolf v1-8 BETA-11028.zip",
      "uploadedUnix": "1331328117",
      "modVersion": "1.8BETA",
      "virusScanUrl": "https://www.virustotal.com/file/6b2344f647268f4774f4ad1b3dc66e1f7514c19eb8d35af5da2b1ed86c7bf1d9/analysis/1406740270/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Curse%20of%20the%20Werewolf%20v1-8%20BETA-11028.zip?fid=41767&ttl=1535771918&ri=8192&rs=8192&setec=e6f31acc8824af033d58f36817a057c9"
    }
  ]
}