{
  "modId": 11035.0,
  "modName": "Super Ale",
  "summary": "This plugin replaces generic Ale with Super Ale which increases carrying capacity by 1500 for 24 hours. Or chose the more Lore Friendly version, Celtic Special Stout, in the magic section of this site. ",
  "descriptionHtml": "I got tired of having to run a carry weight cheat script every time I loaded into Skyrim. I know carry weight is probably an issue with a lot of people (think dragon loot). I thought that modifying the generic Ale found throughout Skyrim would be useful. Super Ale will now increase players carrying capacity by 1500 for 24 hours. This plugin replaces only the generic ale, which is really common, sold in the inns and found all over shelves.\r\n\r\n It is a tiny little plug-in that makes what is basically a junk item useful, and eliminates the need to carry uselessly enchanted armor and consume massive amounts of potions. \r\n\r\nI thought it was a good solution to minimize extra mods and not feel like you are completely cheating. \r\n\r\nCheck out Celtic Special Stout for a more Lore Friendly version here: \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11204\r\n\r\nOnce you drink it, you are stuck with the effect for the 24 hour duration. \r\nIf you want to remove the plug-in it, just deselect it in your data files and Ale\\'s original stats will be restored. No harm done =)\r\n\r\nenjoy. \r\n\r\nInstall:\r\nDownload and extract to: C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data or where ever your Skyrim/Data file is located. \r\nUninstall:  \r\nDelete the file SuperAle.esp \r\n\r\n\r\n*note:  I am unsure if this will install properly with the Download manager, but once placed in the data folder it will show up in your mod-manager. It is also located on the Steam Workshop (blah)",
  "categoryId": "40",
  "version": "1",
  "author": "Merrydeath",
  "createdUnix": "1330081131",
  "updatedUnix": "1330081268",
  "containsAdultContent": false,
  "uploadedBy": "merrydeath",
  "primaryFile": null,
  "files": [
    {
      "fileId": "36154",
      "name": "Super Ale",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Super Ale-11035-1.rar",
      "uploadedUnix": "1330081268",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/2287b7c3e21b5bb5a840ae393ed668b739e96a4b3f2248b53c0add41805361ae/analysis/1406709855/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Super%20Ale-11035-1.rar?fid=36154&ttl=1535771931&ri=8192&rs=8192&setec=e30d48b439b4485081ec5fb9529e9f4c"
    }
  ]
}