{
  "modId": 11041.0,
  "modName": "Flames Of Health and Magic Spell",
  "summary": "A spell book of flames that do damage, absorb health and magicka.",
  "descriptionHtml": "This is a spell learned from a spell book found in the very room where Hadvar unbinds you, or, if you chose to go with Ralof, in that room as well. I really only recommend this book for those wanting to start the game on the \\\"Master\\\" difficulty setting, as the spell is over-powered. But, if you are a character that does not regenerate health and you get in a bind in close quarters, it is a life saver. But, after a while, you may not need it when your level is high enough. This spell is a must if you have the \\\"Warzone\\\" and especially the \\\"War in Skyrim\\\" mods added, as they allow for powerful enemies to spawn at random.\r\n\r\nAs an added bonus, I made a Dragon Priest Staff that can be smithed under the \\\"Misc\\\" category, that is also extremely powerful. It can cast a potent fireball at 10x the default distance the game allows. This is good if you want to clear out an area fast from a distance or are running away. Be careful, this has large AoE and can hurt allies/friendly NPCs.\r\n\r\nInstructions; Download and unpack using the NMM or simply download, then unpack and place in the \\'Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\' folder. Start Skyrim launcher, click data files and then check the appropriate box, or do this from within NMM. Enjoy :D",
  "categoryId": "75",
  "version": "1.0",
  "author": "Tommy6860",
  "createdUnix": "1330085083",
  "updatedUnix": "1330088445",
  "containsAdultContent": false,
  "uploadedBy": "Tommy6860",
  "primaryFile": null,
  "files": [
    {
      "fileId": "36184",
      "name": "Healthy Grilling",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Healthy Grilling-11041-1-0.rar",
      "uploadedUnix": "1330088445",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/34ce4e93abb253bf3e878fb6de2ff6ca99690fa4da2fd405e39af02e1906e186/analysis/1406710023/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Healthy%20Grilling-11041-1-0.rar?fid=36184&ttl=1535771939&ri=8192&rs=8192&setec=c9745f7cef841de429305354adccdac7"
    }
  ]
}