{
  "modId": 11045.0,
  "modName": "Belethor Goods",
  "summary": "Custom weapons sold by Belethor of Whiterun.",
  "descriptionHtml": "It\\'s been four months since I last downloaded Chachanshen\\'s work from the Nexus. It was removed due to copyright hits and he was consequently banned. I really loved his works so I asked his permission to re-upload his works without those copyright hits. \r\n\r\nSo here is his mod again. I have removed other items in it that uses external assets to obey the Terms of User Agreement. The mythic weapons and their archematics were also removed. I\\'m sorry to those who loved using these cool weapons.\r\n\r\nThere may still be items that use external assets but with explicit permissions from their respective authors and the credits are given through their unique names in-game. I do not know which are specific to this so feel free to inform me. \r\n\r\nIf you have questions regarding the original full version of this mod feel free to ask me. \r\n\r\nINSTALLATION\r\n\r\nAfter downloading this mod, extract the file at your desktop. \r\nYou should have a DATA folder. This folder should contain three items: \r\n\r\nMESHES folder\r\nTEXTURES folder\r\nESP file\r\n\r\nSelect the three files. Copy the three files.\r\n\r\nGo to the DATA folder of your Skyrim directory. Paste the three items you just copied. It should prompt you to overwrite MESHES and TEXTURES folder. If there is no overwrite prompt then you are doing it wrong. \r\n\r\nCheck mod at the DATA FILES.\r\n\r\nVisit Belethor\\'s General Goods at Whiterun. Check also the forge for the mod arrows.",
  "categoryId": "69",
  "version": "1.0",
  "author": "Rudolflee",
  "createdUnix": "1330088667",
  "updatedUnix": "1330093051",
  "containsAdultContent": false,
  "uploadedBy": "RudolfLee",
  "primaryFile": null,
  "files": [
    {
      "fileId": "36201",
      "name": "Belethor Goods ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "97274",
      "fileName": "Belethor Goods -11045.zip",
      "uploadedUnix": "1330093051",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a49bb8ceca6c9401271afbfb9ef748684d312bfead883cb35524755ea08d1082/analysis/1406710102/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Belethor%20Goods%20-11045.zip?fid=36201&ttl=1535771943&ri=8192&rs=8192&setec=aac22d55949bea53d2a084853f6ebfb6"
    }
  ]
}