{
  "modId": 11051.0,
  "modName": "Rama_s Joy Ruins",
  "summary": "Complete New Very Large Dungeon / Map / Level. Battle 40+ Creatures at Once. Enjoy Beautiful Natural Scenery. 4 Difficulty Settings",
  "descriptionHtml": "Rama\\'s Joy Ruins\r\n\r\n==============================================================\r\nHere is an absolutely awesome video showing the larger battles in my\r\nlevel.\r\n\r\nMy friend who is doing this video demonstrates absolute mastery of \r\ncombat skills that you would not have even thought possible within \r\nSkyrim\\'s system.\r\n\r\nHe demonstrates Godly combat skill while simultaneously being poetic and fun\r\n\r\nhttp://www.youtube.com/watch?v=JhgjDneLO8Q&feature=youtu.be\r\n\r\n==============================================================\r\n\r\n==============================================================\r\nThis is a very large level with beautiful Natural Scenery and big battles :)\r\n==============================================================\r\n\r\nThis level is about Beautiful scenery, advanced, fast gameplay mechanics, and new exciting things that you probably didn\\'t know the Skyrim Creation Engine could do :)\r\n\r\nIt is a level of moving walls,rotating bridges, and other tricks I learned to implement with the Creaton Kit.\r\n\r\nMy Joy Ruins is designed to cater to the gamer who wants intense hard battles and varied gameplay strategies, as well as the gamer who wants to enjoy new level mechanics and do a series of well-timed jumps 1000 feet in the air above a canyon as the Aurora Borealis shines above.\r\n\r\nExpect Skyrim and your Dragon-Born to do things before your eyes that you never thought possible within the game environment\r\n\r\n:)\r\n\r\n-Rama\r\n\r\n~~~\r\n\r\nFast Way To My Level\r\n\r\nJust Fast Travel to Whiterun, and go behind Breezehome and Iron Maiden / the main smithing location. \r\n\r\nIf you know what COC means, don\\'t use it, it will not take you to the beginning of my level.\r\n\r\nEnjoy!\r\n\r\n~~~\r\n\r\n====================\r\n\r\nHuge Battles\r\n\r\nIn my level you will at times be facing 40+ creatures at the same time!\r\n\r\nBut they are much easier to destroy than normal :)\r\n\r\nEnjoy the incredible battles!\r\n\r\n=====================\r\n\r\n4 Difficulty Settings\r\n\r\nGood Fun - should be fun for everyone\r\n\r\nReally Good Fun - more creatures spawn than Good Fun\r\n\r\nVery Intense - more creatures and they are harder\r\n\r\nWow!!!!! - Your character will need super high armor and attack damage to complete this level of challenge\r\n\r\n=======================\r\n\r\nCustomize your Display Settings\r\n\r\nI am fully aware that there is an ever increasing variety of display settings that different people are using on 3 different systems!\r\n\r\nI try to color my level to be pretty and wonderful for everyone, but with such a variety of machine settings, I determined the very best thing I could do was enable you to fine tune the display of my level to your exact preferences.\r\n\r\n==================================================================\r\nAs a result I built a Display Settings menu system into my level.\r\n==================================================================\r\n\r\nThis menu can be accessed with the spell that you learn upon entrance to my level.\r\n\r\nMy menu system remembers what menu you were in so when you recast the spell you can easily repeat/magnify the setting you were adjusting.\r\n\r\nYou can adjust the Color Saturation, Brightness, and Contrast of your display while in my level.\r\n\r\nThe settings you choose only affect my Joy Ruins level and cannot possibly affect the rest of your Skyrim Experience (if our friends at Bethesda add a payprus script function for GetCurrentImageSpace() then I could enable the spell to work anywhere).\r\n\r\nThe spell gives you the option to restore defaults any time.\r\n\r\nYou save your settings by saving the game.\r\n\r\n==========================\r\n\r\nConvenient Entrance In Whiterun\r\n\r\nGo behind Breezehome and Iron Maiden to find the entrance to my level\r\n\r\n:)\r\n\r\n==========================\r\n\r\nNo Loading Screens Within Level\r\n\r\nThrough great effort on my part, and the robustness of the Creation Engine, I did not need to include any loading doors in my level.\r\n\r\nSo enjoy an ENTIRE rather large level with no loading screens!\r\n\r\nI feel this level is large by any Skyrim dungeon standards, it is just a feat of effort and Creation Engine power that I did not need loading doors.\r\n\r\n\r\n==========================\r\n\r\nLevel Instantly Resets\r\n\r\nMy Joy Ruins level instantly resets whenever you leave and re-enter, so you can do the level as many times as you want, all loot resets, and all my fancy puzzles reset as well.\r\n\r\n==========================\r\n\r\nGameplay\r\n\r\nThere is a huge focus on gameplay in this level.\r\n\r\nIn this level you will encounter the following new gameplay elements\r\n\r\n\r\nExotic Room Shapes\r\n\r\nI make an effort to present you with indoor rooms that are as varied in terrain and shape as many of the outdoor areas you are used to exploring.\r\n\r\nYou might forget at times that you are exploring an indoor dungeon!\r\n\r\nEnjoy great views and jagged mountain skylines, huge deep canyons and an amazing waterfall Paradise\r\n\r\nThese large rooms are hand-crafted by me into their unusual shape and have a distinctive character.\r\n\r\n==========================\r\n\r\nFor me, part of what makes Skyrim unique is the emphasis on Natural Beauty.\r\n\r\n==========================\r\n\r\nMy levels continue this theme of Skyrim\\'s, and I present you with my own rugged Natural Scenery and beautiful cave settings.\r\n\r\n\r\nAdvanced Jumping Sequences\r\n\r\nYou will have to use your jumping ability frequently!\r\n\r\nYou will encounter many sequences of jumps and will be quite happy to see how well our friends at Bethesda designed the DragonBorn\\'s jumping mechanics.\r\n\r\nIf you enjoy jumping around mountains and finding unusual pathways to your destination, well these are things you HAVE to do in my Joy Ruins level!\r\n\r\n\r\n==========================\r\n\r\n3D Spatial Puzzles\r\n\r\nYou will encounter some puzzles in my level that encourage you think in a very spatial way.\r\n\r\nThese are not puzzles of a mental sort, more of a physical environment sort, you have to look around and think about how to move in new ways to take advantage of the terrain to achieve your goal\r\n\r\nThere are two settings for puzzle challenge/difficulty level\r\n\r\nI assure you I have play tested this level MANY times, before telling me you think there\\'s something not working in my level, make sure to really try and think in new ways and try new things to get past your current area.\r\n\r\nThe puzzle are designed to make you think, and try new things :)\r\n\r\n========================\r\n\r\nManual Installation (PC)\r\n\r\n========================\r\n\r\nInstallation is easy, you do not need a mod manager or the download manager.\r\n\r\n1. Download the file by clicking on the _downloads_ button on this page\r\n\r\n2. Save the file to a location that is easy to find, like your desktop or downloads folder\r\n\r\n3. Unzip the file by double-clicking on it\r\n\r\n4. Copy the Data folder over to your root skyrim directory, even if a Data folder is already present. \r\n\r\nThis directory is _wherever your TESV.exe file is_, and is usually:\r\n\r\nc:\\\\program files (x86)\\\\steam\\\\steamApps\\\\common\\\\skyrim\r\n\r\n\r\nChoose yes whenever asked to confirm file copying. \r\n\r\nAgain, make sure to choose to copy even if a Data folder is already present, as only my unique file names are in the Data folder structure that comes from the zip file.\r\n\r\nDo not worry, you cannot possibly be damaging your original Skyrim files or any mod files, as all of my filenames are unique and have my name in them and only apply to my level.\r\n\r\n\r\n5. Load the regular Skyrim installer. If you use a different method to launch Skyrim, make sure to launch the regular Skyrim .exe file first, which is called TESV.exe, so that the standard Skyrim launcher appears\r\n\r\n6. Click on _Data Files_\r\n\r\n7. Select my Joy Ruins .esp file which is now visible on the list because you moved it to the Data folder.\r\n\r\n8. If you missed this fact elsewhere in this description, the entrance to my level is inside the town of White Run itself, check out the Story section.\r\n\r\n9. Go behind the Iron Maiden in Whiterun, the entrance to my level is behind Breezehome and Iron Maiden\r\n\r\n10. Enjoy!\r\n\r\n~~~\r\n\r\nNo Main Plot Advancement Required\r\n\r\nThis level does NOT require you to know any shouts, and no plot advancement is required at all\r\n\r\n==========\r\n\r\nStory\r\n\r\nWhiterun townspeople have reported hearing strange noises from an old underground piping system that has an entrance right behind the Iron Maiden.\r\n\r\nNo one has ever tried exploring the system because it is not in use and is presumed to be a relic from a timeperiod similar to the Skyforge. Because the system is so extensive and there is insufficient light or food supply for such a long exploration, no adventurer has yet attempted to chart the entire system.\r\n\r\nHowever, now that strange noises are being reported, the Companions and even the Jarl of Whiterun have requested that you, the bravest and most powerful individual they know, to go investigate the strange occurrences.\r\n\r\nThey have warned you that whatever you find down there, it is up to you to resolve the mysterious disturbance and thus restore Harmony to Whiterun and Peace to the people who are wondering what manner of strange things are happening far below the surface of Whiterun\\'s grounds.\r\n\r\n~~~\r\n\r\nYou Enter the Piping System\r\n\r\nAfter trekking through the vast piping system for days beneath the surface of Whiterun and what feels like most of Tamriel itself, using some spells for light in the utterly dark underground, you finally find the entrance to what appears to be a relatively normal looking cave.\r\n\r\nThere is a strange magnetic vibrancy in the air of this cave. \r\n\r\nYou round a bend a behold an amazing sight!\r\n\r\nBefore you towers a huge Dwemer Ruin!\r\n\r\nIt is heavily damaged form what appears to be a very large cave collapse. \r\n\r\nAs excited as you are, you realize you must return to the surface first and gather more supplies.\r\n\r\nNow that you know the way, you can make the journey back much faster and commence thorough exploration of the ruin...\r\n\r\n\r\n\r\n=====================\r\nPositive Feedback Requested\r\n=====================\r\n\r\nLet me know what aspects of my level were your favorite!\r\n\r\nThis will help me get a sense of the everyone\\'s personal favorite elements as I make my next level :)\r\n\r\nAnd don\\'t forget to endorse this mod/level/dungeon if you think others should also play it, so the word spreads :)\r\n\r\nVictory to You!\r\n\r\n<3\r\n\r\nRama\r\n\r\n=====================\r\n\r\nKnown Issues\r\n\r\n-If your game crashes while you are trying to loot bodies during the big 40+ creature battle scenes, or any time, the solution is to not loot. There is no plot-essential loot on any of the creatures.\r\n\r\n-”Help I quit in the middle of a battle and loaded a different save game and the enemies followed me!” Solution: Petition some local guards for help, the creatures in my level REALLY like you once they spot you. Another solution is to re-enter my level. It is a good idea not to switch to different save games in the middle of a big battle if you don\\'t want the creatures to follow you, either complete the level or finish the current battle :)\r\n\r\n-the water turned mostly transparent and the waterfall splash effects are gone: If you Alt-Tab out of Skyrim too many times in one game session this does happen, this also removes the spell effects on your heal and other spells. You must restart Skyrim to get all the effects back and restore the water to normal. This is not particular to my level but I thought I\\'d let you know :)\r\n\r\n-The entrance/exit locations for the main whiterun gate somehow got altered slightly, and nothing I have tried could fix it, even referring to mod-cleaning procedures from prior Bethesda games and editing the “details” of my .esm file. The gate still works of course, but you spawn at slightly off-center locations. If anyone finds a way to restore the main gate spawn positions precisely to normal please do let me know. I will be doing future levels outside of Whiterun for this single reason :)\r\n\r\n=====================",
  "categoryId": "88",
  "version": "1.3",
  "author": "Rama",
  "createdUnix": "1330094587",
  "updatedUnix": "1330654670",
  "containsAdultContent": false,
  "uploadedBy": "evernewjoy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39062",
      "name": "RamaJoyRuinsBeautyandNaturev3",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "345",
      "fileName": "RamaJoyRuinsBeautyandNaturev3-11051.rar",
      "uploadedUnix": "1330654670",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/aca20d673fb529eadd2e289e095508f0a75e3d670dd9cddc5db66d588b90c0f1/analysis/1406724632/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RamaJoyRuinsBeautyandNaturev3-11051.rar?fid=39062&ttl=1535771961&ri=8192&rs=8192&setec=39cb4d9624b5795bed1c3d773e618f3a"
    }
  ]
}