{
  "modId": 11057.0,
  "modName": "Dunmer- Ziada",
  "summary": "I don\\'t see many Dark elves around, so heres one I think looks rather nice.",
  "descriptionHtml": "Soo, I decided to upload my own save game from early on. I really like the look of this character. She suits my preference, and even has a bit of a backstory. I\\'ll type up the story so you can get a feel for her, if you want, and post what mods I\\'m using below.\r\n\r\nZiada. It\\'s.. the name my mother gave me. She\\'s your typical Dunmer woman. I was born and raised in Morrowind. I fit in pretty damn well there, aside from the trouble I got into with practicing my archery in not-so appropriate places. My Mum died about ten years ago, I\\'m 64 if you were wondering. Anyways, I\\'m sure you\\'ve noticed these pretty horns that stick out of my skull, huh? Well, I know you\\'re going to ask about them.\r\nSee, my mum was a summoner. She summoned anything. Well, one night she was.. not quite sober and summoned a big Dremora Lord. Then I came along. Until I was about ten, I looked like any other Dunmer girl in Morrowind, then these babies popped up out of nowhere. I cut them off, but they kept coming up! So, I just let them be. Sure I get looks, but they\\'re useful as hell! And others don\\'t seem to mind them too much. Gives the guys and girls something to hold onto. Hehe.. Anyways, enough about me. I need some wine and- Ooh, who is that hot piece of Altmer Ass over there? Well, I\\'ll be right back.\r\n\r\nMods used-\r\nBetter Females by Bella\r\nLess Harsh Elves\r\nLovely Hairstyles\r\nExtended Color sliders\r\nCBBE body\r\nKiller Keos Armor set\r\n\r\n When starting the game, it will most likely just tell you that some content is missing. Don\\'t worry, as long as you have the above mods, or at least the first , she should come out how she is in the screenies. I hope you guys like her. :) \r\nCharacter starts on the bridge from Riverwood with Leather armor, some weapons and a decent amount of coin. No standing stone picked, so you can make her yours. Thankyou. ^^",
  "categoryId": "43",
  "version": "1.0",
  "author": "SalemLynn",
  "createdUnix": "1330096975",
  "updatedUnix": "1330096975",
  "containsAdultContent": false,
  "uploadedBy": "SalemLynn",
  "primaryFile": null,
  "files": []
}