{
  "modId": 11111.0,
  "modName": "Armor Tree Perks Redone",
  "summary": "Changes some of the perks in the Light and Heavy armor trees in an effort to make for more unique perk choices.",
  "descriptionHtml": "Description\r\n===========\r\nThis is just something I did, spur of the moment. Some of the changes may not be related to armor, but they\\'re meant to give more of a specific role to the armor types. I made all of the changes within a 4-5 hour time span, so there may be some bugs. I did test everything and nothing seemed off to me, but there\\'s always a slight chance. Just make sure you make back ups of your files before trying this or any mod.\r\n\r\nChanges\r\n===========\r\nBoth Trees: I\\'ve removed the helm requirement on all of the perks that originally required helm, chest, hands and feet. So, you don\\'t need to use a separate mod for that.\r\n===========\r\n\r\n\r\nHeavy Armor\r\n____________\r\n\r\n+++++++++\r\n::::Juggernaut:::: Unchanged\r\n+++++++++\r\n\r\n+++++++++\r\n::::Fists of Steel:::: Now \\\"Weighted Strikes.\\\" - Melee attacks do 10% more damage while wearing full Heavy armor. Unarmed damage scaling with gauntlets remains the same. (Only requires gauntlets for unarmed scaling)\r\n+++++++++\r\n\r\n+++++++++\r\n::::Well Fitted:::: Unchanged\r\n+++++++++\r\n\r\n+++++++++\r\n::::Cushioned:::: 25% chance to reduce physical damage by 25% while wearing full Heavy armor. Half fall damage remains the same.\r\n+++++++++\r\n\r\n+++++++++\r\n::::Tower of Strength:::: You now stagger enemies significantly more while wearing full Heavy armor. 50% less stagger received remains the same. (This only works with melee and possibly unarmed damage. Anytime you would have staggered an enemy with a power attack or shield bash, they are hit with a greater effect of stagger [generally kneeling])\r\n+++++++++\r\n\r\n+++++++++\r\n::::Matching Set:::: Unchanged. Subject to change.\r\n+++++++++\r\n\r\n+++++++++\r\n::::Conditioning:::: Original perk effects removed. No more weightless armor. Instead, you get 50 stamina (default:5 levels worth) as conditioning for having lugged around Heavy armor for a long time.\r\n+++++++++\r\n\r\n+++++++++\r\n::::Reflect Blows:::: Instead of having a 10% chance to reflect 100% damage, you will now have a 100% chance to reflect 25% damage. (Note: In Skyrim, reflect damage does NOT cause you to ignore the damage you reflect like it did in Oblivion. Therefor, you will take full damage, but you will reflect 25% of it.)\r\n+++++++++\r\n\r\nLight Armor\r\n____________\r\n\r\n+++++++++\r\n::::Agile Defender:::: [5 ranks] Increases Light armor rating by 10% per rank. (Used to be 20%) Also gives 2% chance per rank to avoid physical damage completely. So, Light armor gets less armor increases than Heavy. (How illogical, right?!) But receives a small chance to avoid all damage, with Light or no armor.\r\n+++++++++\r\n\r\n+++++++++\r\n::::Custom Fit:::: Unchanged\r\n+++++++++\r\n\r\n+++++++++\r\n::::Unhindered:::: Original perk effects removed. No more weightless armor. Instead, you get 15% increased movement speed. Which, for Light armor is pretty much the same (if not more) but with the side effect of having to watch your carry weight more closely. Works with Light or no armor.\r\n+++++++++\r\n\r\n+++++++++\r\n::::Wind Walker:::: Remains the same with the restrictions changed to Light or no armor, as opposed to Light only.\r\n+++++++++\r\n\r\n+++++++++\r\n::::Matching Set:::: Now \\\"Dexterous.\\\" - Original perk effects removed. No more bonus armor. Instead, your attack speed is 15% faster while wearing Light or no armor.\r\n+++++++++\r\n\r\n+++++++++\r\n::::Deft Movement:::: Original perk effects removed. If you\\'ve seen my other mods, you probably already know what this is gonna be. Now gives a 10% chance to slow time on enemy\\'s normal attacks and a 50% chance to slow time on enemy\\'s power attacks. It\\'s essentially the \\\"Quick Reflexes\\\" Block perk, but works so long as you\\'re wearing Light or no armor and is chance based. The chance to slow on normal attacks isn\\'t going to be overly useful unless you\\'re already moving as they start the swing. This is mainly because the impact data and animations don\\'t always sync up when in slow-no. Not much I can do about it. If you don\\'t like the percentages I\\'ve put in this mod, you can always download one of the versions from my standalone version of this and load it after this in your load order.\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6478\r\n+++++++++\r\n\r\n============\r\nTo summarize everything. Heavy armor is for damage absorption and overwhelming your opponents with momentum and strength. Light armor is for quickly maneuvering in and out of attack range, to avoid damage, and striking enemies that are too slow to keep up with your fast pace.\r\n============\r\n\r\n=============\r\nSorry about the setup of the description. I\\'m still not used to the whole mod uploading business. Especially one that requires this much information. \r\nI\\'m open to suggestions and/or possibly making alternate versions if I have time and the ability. Just bare with me. Like I said, this was done within 4-5 hours, spur of the moment.\r\n=============\r\n\r\n=============\r\nInstallation: Use the Nexus mod manager and the esps should all go where they\\'re supposed to. Otherwise, place whichever esp(s) you download into your Skyrim/Data folder and check the box next to the mod name in your load order.\r\n=============\r\n\r\n=============\r\nConflicts: This will conflict with anything that changes any of the changed perks. If you have a mod that alters one of these perks that you\\'d rather use, while still using most of my changes, simply load it after whichever of my mods it conflicts with and it should work just fine.\r\n=============",
  "categoryId": "54",
  "version": "1.0",
  "author": "Maleficus04",
  "createdUnix": "1330122405",
  "updatedUnix": "1334683676",
  "containsAdultContent": false,
  "uploadedBy": "Maleficus04",
  "primaryFile": null,
  "files": [
    {
      "fileId": "36386",
      "name": "Heavy Armor Tree Redone",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Heavy Armor Tree Redone-11111-1-0.rar",
      "uploadedUnix": "1330125706",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/db3eb3e70b0eb2677417a80d8719919d9c8a1dc29002dde65a7a918e3369aa27/analysis/1406710998/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Heavy%20Armor%20Tree%20Redone-11111-1-0.rar?fid=36386&ttl=1535772048&ri=8192&rs=8192&setec=4acd37ee25598acb5da4fb48b913f2d5"
    },
    {
      "fileId": "36388",
      "name": "Light Armor Tree Redone",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Light Armor Tree Redone-11111-1-0.rar",
      "uploadedUnix": "1330125738",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/41d4630682cd3f1697ef83c72ee6869981898c93bbcd0d2d53e3941b01fdebd4/analysis/1406710999/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Light%20Armor%20Tree%20Redone-11111-1-0.rar?fid=36388&ttl=1535772048&ri=8192&rs=8192&setec=bfc79bb6d9967ae0eafa460c79a33e08"
    },
    {
      "fileId": "54026",
      "name": "Heavy Armor Tree Redone_No Stagger",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Heavy Armor Tree Redone_No Stagger-11111-1-0.rar",
      "uploadedUnix": "1334683676",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f94ce2de0c1d8ec3b166d5bee1cd006474bc098a4b6329207d1bda49e4ea8d8e/analysis/1406820376/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Heavy%20Armor%20Tree%20Redone_No%20Stagger-11111-1-0.rar?fid=54026&ttl=1535772049&ri=8192&rs=8192&setec=21f630780912c1fa211a722da66c83f1"
    }
  ]
}