{
  "modId": 11120.0,
  "modName": "Fishchicken Lodge in Falkreath",
  "summary": "A simple player home in Falkreath with everything an aspiring adventurer needs under one roof. Designed to be easy to use, effective and fast. Left to you by an eccentric scholar, the door is unlocked and the chests are empty. No quests or dialogues, just the house.",
  "descriptionHtml": "[b]Description:[/b] \r\nThis began as a simple project of mine to learn how to use the CK. I never really intended to publish it anywhere, but as I finished it, I realized there may be other people looking for a simple, clean player home. Not too big (i hate walking for five minutes just to get to the enchanting table), with not too many loading screens and with all the things you use frequently in Skyrim: an enchanting table, an alchemy lab, all the blacksmithy stuff, some chests, a bed, a cooking pot and a few mannequins and weapon racks to display your loot.\r\n\r\nI placed it in Falkreath, since I like the place. Once you discover the house (it is near the waterfalls), you will also get a nice map marker that you can use to travel there quickly.\r\n\r\nThere are no associated quests and no new dialogue, just a lonely journal that explains the history of the place.\r\n\r\nPlease note that this is my first mod and there may be bugs! You would do me a huge favor by reporting any you find.\r\n\r\n[b]Installation:[/b]\r\nJust copy the .esp file into your data Skyrim/Data directory, make sure it is checked in the Skyrim loader and you are good to go!\r\n\r\nTo be safe, make sure to make a clean save before enabling the mod in case you find bugs.\r\n\r\nTo uninstall, simply uncheck the file the loader. To completely uninstall, also delete the esp.\r\n\r\n[b]Compatibility:[/b] \r\nThis mod may be incompatible with any mods that modify the Falkreath village.\r\n\r\n[b]Known bugs:[/b]: \r\n1. the mannequins can sometimes behave strangely (move, change stances, float around). This is a problem with Bethesda mannequins, there is not much I can do about that.\r\n2. even though I properly navmeshed the house, your followers may refuse to enter the house with you. I am not sure how to fix that, if any of you have any ideas, please share.",
  "categoryId": "67",
  "version": "1.0",
  "author": "Annun",
  "createdUnix": "1330127566",
  "updatedUnix": "1330128038",
  "containsAdultContent": false,
  "uploadedBy": "annun",
  "primaryFile": null,
  "files": [
    {
      "fileId": "36405",
      "name": "fishchickenlodge",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "183",
      "fileName": "fishchickenlodge-11120-1-0.zip",
      "uploadedUnix": "1330128038",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/60a6de7209e596ce7e36f75a8c9ba469571af836921952613720fb60447f9e48/analysis/1406711110/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/fishchickenlodge-11120-1-0.zip?fid=36405&ttl=1535772066&ri=8192&rs=8192&setec=fb5232520c88c2e89abe4d2f1ba824bc"
    }
  ]
}