{
  "modId": 11132.0,
  "modName": "Portable Ingredient Storage",
  "summary": "A portable Apothecary\\'s Satchels where you can store all of your ingredients. It and the stored ingredients weigh nothing. --- Ein transportierbarer Trankmischerbeutel in dem du deine Zutaten verstauen kannst. Er selbst und die verstauten Zutaten wiegen nichts.\r\n",
  "descriptionHtml": " Multilingual: english / deutsch\r\n (deutsch siehe unten)\r\n \r\n[b]The successor of this mod is [url=http://www.skyrim.nexusmods.com/downloads/file.php?id=12027] Portable Storages [/url] which also includes soul gems and crafting materials.[/b]\r\n\r\n Description\r\n ===========\r\n A portable Apothecary\\'s Satchels where you can store all of your ingredients. It and the stored ingredients weigh nothing.\r\n \r\n Details\r\n =======\r\n At gamestart / mod install you get an Apothecary\\'s Satchels in your apparel inventory. It is named \\\"A IngredientStorage\\\" to put it at the top of the list.\r\n By clicking the item it displays how many ingredients you have in your inventory and in your storage. You get the choice to store all into the storage,\r\n to take all from the storage or to summon the satchel. After summonig the satchel leave the inventory and you see the satchel in front of you.\r\n\r\n The satchel reacts like a normal container. You can stash it away by activating it in sneak-mode. But no need to do so. The satchel is also always in your inventory. The next time you summon the satchel it appears again in front of you.\r\n \r\n You could misuse the summoned satchel for storing other items into it. But the \\\"Store all\\\"-/\\\"Take all\\\"-functions only work on the ingredients.\r\n \r\n Technics\r\n ========\r\n The script uses a FORMLIST of the ingredients. It does not loop through the inventory. The advantage is, that it works quick.\r\n Same as in [url=http://www.skyrim.nexusmods.com/downloads/file.php?id=10009] Quick Ingredient Storing [/url]\r\n \r\n The inventory item is based on an Armor-FORM because of the equipped-/unequipped-event.\r\n The summoned satchel is an Activator for a container located in a hidden room. I had to do it in this way because I can not open\r\n the container from inside the open player inventory.\r\n \r\n Install\r\n =======\r\n With NMM or copy the content of the archive into the Skyrim/Data directory.\r\n (You can leave out the readme´s, the folder /Scripts/Source and  from /Strings/..the not installed language files.)\r\n \r\n Uninstall\r\n =========\r\n Manually: Delete the files.\r\n\r\n Known issues\r\n ============\r\n - If you have a mod that adds new ingredients to the game these new ingredients are not detected from the \\\"Store all\\\"-/\\\"Take all\\\"-functions. Therefor you must merge both and add the new FORMs to the FORMLIST \\\"IngredientList\\\". But you can store / take these ingredients manually after opening the summoned satchel.\r\n\r\n - The inventory item uses the normally unused equip-slot 55. If another mod uses this slot (e.g. more rings or similar) the items remove each other.\r\n \r\n#######################\r\n\r\n Beschreibung\r\n ===========\r\n Ein transportierbarer Trankmischerbeutel in dem du deine Zutaten verstauen kannst. Er selbst und die verstauten Zutaten wiegen nichts.\r\n \r\n Einzelheiten\r\n ============\r\n Bei Spielstart / nach Mod-Installation erscheint ein Trankmischerbeutel in deinem Bekleidungs-Inventar. Er heißt \\\"A Zutatenablage\\\" damit er in der Liste oben erscheint. \r\n Beim Anklicken wird angezeigt wieviele Zutaten du im Inventar und in der Ablage hast. Du hast die Wahl alle Zutaten abzulegen oder zu nehmen oder den Beutel herbeizubeschwören. Nach dem Beschwören einfach das Inventar verlassen und du siehst den Beutel vor dir liegen. \r\nDer Beutel reagiert wie ein normaler Behälter. Du kannst ihn wieder verschwinden lassen indem du ihn im Schleich-Modus aktiviert. Musst du aber nicht. Der Beutel bleibt immer zusätzlich im Inventar. Beim nächsten Beschwören erscheint er wieder vor dir.\r\n \r\n Man kann den beschworenen Beutel auch zur Ablage anderer Gegenstände missbrauchen. Die \\\"Alles verstauen\\\"-/\\\"Alles nehmen\\\"-Funktionen arbeiten aber nur mit den Zutaten.\r\n \r\n Technik\r\n =======\r\n Das Skript benutzt eine FORMLIST der Zutaten. Es durchläuft nicht das Inventar und ist daher sehr schnell.\r\n Genau wie in [url=http://www.skyrim.nexusmods.com/downloads/file.php?id=10009] Quick Ingredient Storing [/url]\r\n \r\n Das Inventar-Item basiert auf einer Armor-FORM wegen des An- und Ablegen-Ereignisses.\r\n Der beschworene Beutel ist ein Aktivator für einen Behälter in einem verstecktem Raum. Ich musste es so machen da ich den Behälter nicht aus dem\r\n geöffneten Spieler-Inventar öffnen konnte.\r\n \r\n Installieren\r\n ============\r\n Mit NMM oder den Inhalt des Archives in der Skyrim/Data-Ordner kopieren.\r\n (Du kannst dabei die readme´s, den Ordner /Scripts/Source und von /Strings/..die nicht installierten Sprachdateien auslassen.)\r\n \r\n Deinstallieren\r\n ==============\r\n Manuell: Die Datein wieder löschen.\r\n\r\n Bekannte Probleme\r\n =================\r\n - Wenn ein Mod neue Zutaten ins Spiel einfügt werden diese nicht von den \\\"Alles verstauen\\\"-/\\\"Alles nehmen\\\"-Funktionen erfasst. Dafür müsste man die Mods zu einem vereinen und dann die FORMLIST \\\"IngredientList\\\" um die neuen Zutaten erweitern. Aber mit dem beschorenen Beutel kannst du sie verstauen oder nehmen.\r\n \r\n - Das Inventar-Item benutzt den normalerweise ungenutzten Ausstattungs-Slot 55. Wenn ein anderes Mod auch diesen Slot benutzt (z.B. mehr Ringe oder ähnliches) wird der dort ausgerüstete Gegenstand jeweils durch den anderen ersetzt.\r\n",
  "categoryId": "27",
  "version": "1.0",
  "author": "TomHart",
  "createdUnix": "1330131774",
  "updatedUnix": "1330137232",
  "containsAdultContent": false,
  "uploadedBy": "TomHart",
  "primaryFile": null,
  "files": [
    {
      "fileId": "36466",
      "name": "Ingredient Storage",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Ingredient Storage-11132-1-0.7z",
      "uploadedUnix": "1330137232",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3b225d4dcef8bc8d246f60f857a4d8cbbab94bd571846696837b3efe1e9c26e2/analysis/1406711361/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ingredient%20Storage-11132-1-0.7z?fid=36466&ttl=1535772089&ri=8192&rs=8192&setec=c57260d056b7f2a373c8bab4660a9a35"
    }
  ]
}