{
  "modId": 11152.0,
  "modName": "The Cellan Race",
  "summary": "Adds a New Race to the Game called \\\"The Cellan.\\\"",
  "descriptionHtml": "The Cellan are typically a Nomadic species, they live their entire lives on ships from birth, til death. Many ages ago the Cellan had a vast empire and thousands of colonies, spreading across the stars. However after an internal affairs fiasco on the homeworld, the empire split in two. This lead to disagreement througout the entire Cellan nation, and it eventually led to war, both sides destroying each other completely. All that remained was a small collection of battered ships and several hundred Cellan.\r\n\r\nThe technology they had created in the years of prosperity however managed to survive, if only a little. Temporal weaponry, an advanced knowledge of how time works... those were the gifts they had left.\r\nAll they had left.\r\n\r\nWhile most became pirates, using their skills and intelligence to murder, pillage and plunder, some began a new culture. A nomadic way of life that continued to exist for over three hundred years.\r\n\r\nThe story in the mod follows one ship that crash landed on Tamriel two era\\'s prior.\r\n\r\nForced to settle they began to build into the mountains of skyrim, creating vast tunnel networks. The main city was a thriving technological metropolis centered around a natural inground lake.\r\n\r\n--- \r\nBasic anatomy notes\r\n\r\nBeing otterlike in form they do have webbed fingers and toes. A genetic carry over that was never bred out of the species. Their legs are muscular but their frame on average is quite lithe. Unlike typical otters their pelt is soft and retains water. An, unfortunate genetic hangover. As such, they aren\\'t really built for swimming despite being otters. However, they do have a third lung and much higher lung capacity as a result allowing them to hold their breath for MUCH longer periods of time.\r\n\r\nThey tend to come in four varieties.\r\n1:Those with dark fur on the outside, moving in to lighter on the belly. \r\n\r\nIn this first variation they have a different hair colour from their fur. Cellan only have three hair colours: Brown, Auburn, and Black. All of their furs range from Deep brown to Terracotta and Mahogany.\r\n\r\n2: Light fur on the outside getting darker with a near white muzzle.\r\nAs was the case with the first, this variation has a different hair colour from their fur.\r\n\r\nThe other two remaining types are the same as 1 and 2, only with hair that blends into the fur almost completely.\r\n\r\nEyes come in Grey, Amber, Red and Blue. Amber is the dominant Gene, Red is the pigmentation deficient version of it. Blue is the recessive, likewise, Grey is the pigment deficient version of blue.\r\n\r\nCellan have rather simple anatomy otherwise. Their body has no vestigial organs save for their webbing. The body is partially immune to several types of particles commonly encountered in time travel and temporal manipulation. In other individuals that are not immune, these particles are deadly.\r\n\r\nLastly, Cellan have pink flesh rather than black flesh. It is a very soft pink.\r\n\r\n---\r\nPlans for the Mod, Lesser Powers, spells, weapons.\r\n\r\nSpell: Haste\r\nSchool: Alteration\r\nA self targeted technique that enhances speed and agility for a short amount of time, as well as making fatigue infinite while it is active, so you can sprint for a much longer time or use power attacks more often. However, plans are to have a debuff to balance this. The original plan is to make it so that as soon as it deactivates, the player will temporarily collapse like some mods did in oblivion. Its not known however if this is doable in skyrim YET. So other suggestions for balancing are always welcome.\r\n\r\nSpell: Slow\r\nSchool: Alteration\r\nSlow causes all creatures (NPC characters, monsters, wyverns, and animals) within a five foot radius of the spellcaster to be \\\"slowed.\\\"\r\nThey begin to speed up in steady increments as time goes on.\r\n\r\nSpell: Timesnap\r\nSchool: Destruction\r\nSkill Level: Master\r\nTimesnap is a \\'touch\\' spell, requiring the player to touch the target directly for it to hit. The spell erases the touched being from time, cutting them out of history and turning them to dust, in game this will be a simple spell that calls the end resurrected corpse effect, that burns them up and turns them into \\\"ash pile.\\\"\r\nThis could work on anything, but there will be attempts made to have it not effect dragons. This spell does an automatic 50% of max health damage to the user on success. If you are half dead already and you use this, you will also burst into dust; or at least die at any rate.\r\n\r\nThis spell WILL kill essential NPCs. Do NOT use it for giggles.\r\n---",
  "categoryId": "34",
  "version": "0.00a",
  "author": "GDelscribe",
  "createdUnix": "1330143012",
  "updatedUnix": "1330143012",
  "containsAdultContent": true,
  "uploadedBy": "GDelscribe",
  "primaryFile": null,
  "files": []
}