{
  "modId": 11223.0,
  "modName": "Xinmer",
  "summary": "Xinmer, the citizens of Spersax. ",
  "descriptionHtml": "HISTORY:\r\n\r\nThe Xio Chuan elves originates from a place far, far outside the boundaries Tamriel, a place called Spersax. There, everyone follows the rules of god Rizhai. A god of dexterity and sword skill. The elves in Spersax did great and they had no enemies.\r\n  But 250 years ago the Nords came to Spersax in peace, at least thats what they thought. And it was, for 30 years, but then the Nords started slaughtering and killing the elves in cold blood. They wanted their land. And so started a war, a war that would last for 112 years.\r\n  The Nords easily conquered Spersax because none of the elves expected this attack, so they had no soldiers. The Xiao Chuan elves were driven out of their own country. They were to fight 112 years against the Nords, to get back their land. The Nords were a lot more than the Chuan elves, so the had to use their stealth skills to slowly and without being noticed, eliminate the enemies. One by one. They sneaked into the Nord camps and planted poison in their food and mead. And after those 112 years of sneaking and silently killing, the Xiao Chuan elves finally managed to take their home back from the nords. \r\n  But they could not continue to live in Spersax, when the Nords knew they were loosing, they sat the whole land on fire. They destroyed everything of value, and burned down every single building in the land. The elves couldn’t live there anymore, so they decided to flee to Tamriel, in Skyrim. \r\n\r\n  The methods the elves used during the war, is now the reason why it’s remembered as “The Shadow War”.\r\n\r\n But now a new war is to start, rigth here,  in Skyrim.\r\n\r\nDESCRIPTION:\r\n\r\nThis \\\"mod\\\" adds a new race to the game. The Xio Chuan, also known as Xinmer. The Xinmer is a race based on dexterity and Sword skill.\r\n\r\n +10 lockpicking, pickpocketing, light armor, two and onehanded weapons\r\n +5 illusion\r\n",
  "categoryId": "34",
  "version": "Xinmer",
  "author": "FrenziedMango",
  "createdUnix": "1330193844",
  "updatedUnix": "1330193844",
  "containsAdultContent": false,
  "uploadedBy": "Frenziedmango",
  "primaryFile": null,
  "files": []
}