{
  "modId": 11246.0,
  "modName": "WKO - Helgen - DELETED",
  "summary": "Complete Overhaul of the Citizens of Helgen ",
  "descriptionHtml": "This mod makes noticeable changes to each individual character who was at Helgen. \r\n\r\nEach character is lore-friendly and realistic. They will be frequently updated, with lots more variations to come.\r\n\r\nTo install, simply extract into your \\\"steamapps/common/Skyrim/Data\\\" directory. \r\n\r\n\r\nCompatibility : No issues known. Compatible with most, if not all, mods, so long as they do not alter the base facial features of the NPC(s) you use. All my mods, when installed correctly, should run smooth as a Falmer\\'s behind. \r\n\r\n\r\nIf at any point you find that you have trouble with new games or crashes to desktop, follow these simple steps. It\\'s very important you do so in the exact order. It will not work (to my knowledge) if you deviate from it in any way whatsoever : \r\n\r\n1. Uncheck the character\\'s .esp in NMM (or the default launcher). Once that\\'s complete, close the launcher. \r\n\r\n2. Go into your Skyrim/Data directory. Once you\\'re there, find and delete the following files: \r\n\r\n- The .esp you just deactivated.  \r\n- The .nif file belonging to the character. These .nifs can be found at : \r\n\r\nC:Program Files (x86)Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\meshes\\\\actors\\\\characterfacegendata\\\\facegeom\\\\skyrim.esm \r\n\r\n3. Re-install. \r\n\r\n\r\nSpeaking of mods, I use the following mods for my Dovahhims. For optimal results, install them in this order : \r\n\r\nXCE (Xenius Character Enhancement) : http://skyrim.nexusmods.com/downloads/file.php?id=2356\r\n\r\nBetter males - Beautiful nudes and faces - New hairstyles : http://skyrim.nexusmods.com/downloads/file.php?id=2488\r\n\r\nHigh Res Face Maps for Men by Geonox : http://skyrim.nexusmods.com/downloads/file.php?id=4141   \r\n\r\n\r\nFor the Dovahgirls, I use these excellent mods. For the same looks as seen in screenshots, install them in this order: \r\n\r\nXCE (Xenius Character Enhancement) : http://skyrim.nexusmods.com/downloads/file.php?id=2356\r\n\r\nDimonized UNP Body : http://skyrim.nexusmods.com/downloads/file.php?id=6709\r\n\r\nBetter Females by Bella : http://skyrim.nexusmods.com/downloads/file.php?id=2812\r\n\r\n\r\nComments/questions/critiques/requests welcome. Feel free to drop me a line at any time.  \r\n\r\n\r\nLastly, I\\'d like to apologize on behalf of my sponsor, General Tulius. The general denied all allegations made by the citizens of Riverwood. He stated that he is not, in fact, a military governor and no, the Thalmor did not have anything to do with this. \r\n\r\n\r\n- WaywardKnight",
  "categoryId": "26",
  "version": "1.0",
  "author": "WaywardKnight",
  "createdUnix": "1330204549",
  "updatedUnix": "1330204549",
  "containsAdultContent": false,
  "uploadedBy": "WaywardKnight",
  "primaryFile": null,
  "files": []
}