{
  "modId": 11281.0,
  "modName": "Dread Weapons - Fifthdreads Craftable Weapon Pack",
  "summary": "Craftable - Legit - Non-OP - Balanced - Awesome Weapons! This is my first mod, and only contains the first few swords of many. Expect some evil looking fully unique swords that can be legitimately obtained in game through crafting and/or discovery!",
  "descriptionHtml": "Craftable - Legit - Non-OP - Balanced - Awesome Weapons! This is my first mod, and only contains the first few weapons of many. Expect some evil looking fully unique weapons that can be legitimately obtained in game through crafting and/or discovery!\r\n\r\nCurrent Craftable Weapons:\r\nDread Sword - Ebony Perk - Craftable\r\nDwarven Dread - Dwarven Perk - Craftable\r\nDoom Hack - Ork Perk - Craftable\r\n***NEW***  Shadowgreed - Daedric Perk - Craftable - Two handed AXE!\r\n***NEW***  Dread Arrows (Misc Category) (Require Daedric Smithing)\r\n\r\n\r\nThere will be many more weapons to come. I look forward to making a few weapon sets that are evil looking, and also just a little more powerful than the default sets. They will be a little harder to obtain as well.\r\n\r\nPLEASE RATE and SUPPORT!  I will be providing continuous support for this mod, so expect updates and more additions to the sword database! A high rating will encourage me to continue to push to create awesome mods!\r\n\r\nI want to create a cool set of rare weapons, all of which will be a little stronger than the default sets, and give the player a non- overpowered option for being awesome. Some weapons I want to appear in rare places, and I want most of them to be craftable (although difficult to obtain)\r\n\r\nI plan on adding  all weapon types to the table, including arrows, axes, bows, and more! I will likely add matching shields as well, but bare with me... I am still learning how to do all of this stuff.\r\n\r\n\r\nUPDATE LOG:\r\n\r\n-Update: 25 Feb 2012\r\nAdded Dread Arrows (Misc Category) (Require Daedric Smithing)\r\n\r\n-Update: 24 Feb 2012\r\nAdded Shadowgreed (Daedric) \r\n\r\n-Update: 22 Feb 2012\r\nAdded Doom Hack (Orcish) \r\n\r\n-Update: 21 Feb 2012\r\nFixed Dwarven Dread (Dwarven)\r\n\r\n-Update: 20 Feb 2012\r\nAdded Dread Sword (Ebony)\r\nAdded Dwarven Dread (Dwarven)\r\n\r\n\r\nNEXT UPDATE:\r\nWeapon Damage Balance - Making them more balanced with the actual game.\r\nWeapon – “The Spank”\r\nMore weapons! Suggest what’s next below!\r\n\r\n\r\nQ&A:\r\n\r\nQ: Scabbards: Can we get them?\r\nA: Give me time to get a few more swords out... Then I will consider revising the swords to include Scabbards.\r\n\r\nQ: What is your goal?\r\nA: I want to create awesome swords that add to the game experience... Like better weapons that are more difficult to obtain but offer greater power. I want to add weapons that go beyond the daedric and dragon set in power, as well as offer weaker weapons that you obtain as you level your smithing skills... Also, I want to include a few unique weapons that are scattered across the world.\r\n\r\nQ: How will you obtain the most powerful weapons?\r\nA: If you remember that one quest where you have to obtain sword shards for that mythic dawn guy... Well, I am probably going to do some special items you will need to craft the swords... I am also going to add some sort of ore that you can obtain through special areas... ;) This ore will be better than ebony of course... ;) and harder to get. It has to be a challenge and leave you exploring and having fun! Also, I find myself playing to achieve a goal, like getting better gear... This will be one of those goals.\r\n\r\nQ: How fast will you release more swords?\r\nA: As fast as I can. I work full time but after work and during the weekends I enjoy learning how to develop more mods... In fact, last night I made a new sword after work. My wife wasn\\'t happy with the texture so I have to redo it just a bit, but it should be released today.\r\n\r\nQ: I want bows, axes, and other stuff!\r\nA: Give me time to develop more swords, as it is the only thing I understand ATM... Remember, this is my first mod. There may be more to developing bows and such, but it will come in time.\r\n\r\nQ: Can I help develop this mod? Let\\'s collaborate!\r\nA: Sure! Just shoot me a PM on fifthdread.com... of course, you have to sign up! It\\'s just my community website. No worries, and takes 5 seconds. My name is Fifthdread of course!\r\n\r\n\r\nwww.fifthdread.com - My Gaming community!\r\nfifthdread@fifthdread.com",
  "categoryId": "55",
  "version": "1.0",
  "author": "Fifthdread",
  "createdUnix": "1330219008",
  "updatedUnix": "1330220931",
  "containsAdultContent": false,
  "uploadedBy": "Agent_X04",
  "primaryFile": null,
  "files": [
    {
      "fileId": "36899",
      "name": "DreadWeapons",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10594",
      "fileName": "DreadWeapons-11281.7z",
      "uploadedUnix": "1330220931",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/648dd0cb10df8e993823946495b245c20855e5597395bc81c529052b007d533f/analysis/1406713630/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DreadWeapons-11281.7z?fid=36899&ttl=1535772315&ri=8192&rs=8192&setec=55a106161cfd4df13d07ebe1e11a1685"
    }
  ]
}