{
  "modId": 11329.0,
  "modName": "Nordlaender-Ausstattung - Extended Edition",
  "summary": "Die Modifikation fuegt eine transportable Lagerausruestung und allerlei sonstige Gegenstaende in das Spiel ein und erweitert das Spiel optional um ein einfaches Beduerfnis-System (Hunger, Durst und Muedikeit fuer den Spieler)",
  "descriptionHtml": "[center][img]http://www.ei-der-zeit.com/Brausebart/bbLagerS/v42/screens/naee_cover01.jpg[/img][/center]\r\n\r\n[b]Beschreibung:[/b]\r\nMit der Nordländer-Ausstattung erhält der Skyrim-Abenteurer eine transportable Camping-Ausstattung, welche allerlei unterwegs nützliche Gegenstände bereithält. So ist es nun jederzeit und an fast jedem Ort möglich, ein Lager für die Nacht aufzuschlagen. Je nach Anspruch des Abenteurers stehen unterschiedlich komfortable Ausrüstungsgegenstände zur Verfügung, vom kleinen Zelt mit Schlafsack bis hin zum komfortablen Wohn- und Werkstatt-Zelt mit fast allem Luxus, den man auch Daheim schätzt.\r\n\r\nDie Extended Edition Vers. 5 erweitert die Modifikation um ein einfaches Bedürfnis-System. Wird es aktiviert, muss der Spielcharakter fortan regelmäßig Nahrung und Wasser oder andere Getränke zu sich nehmen und schlafen. Tut man dies nicht, werden mit fortschreitender Spielzeit zunehmende Beeinträchtigungen etlicher Attribute und Skills wirksam. Das Ausmaß der Beeinträchtigungen steigt dabei linear mit der Zeit.\r\n\r\nDas Bedürfnis-System will keine \\\"Ernährungs-Simulation\\\" sein und ist von daher vergleichsweise einfach angelegt.\r\n\r\nZu Spielbeginn ist das Bedürfnis-System deaktiviert. Im Gepäck des toten Alfons Uldinger findet man ein \\\"Camping-Geschirr\\\" (in der Kategorie \\\"Essen\\\"). Benutzt man das Geschirr zum ersten Mal, wir man gefragt, ob die Bedürfnisse aktiviert werden sollen. Im weiteren Verlauf dient das Camping-Geschirr zur Anzeige von Statusinformationen und ein wenig Statistik sowie auch dazu, die Bedürfnisse zu pausieren oder gänzlich zu deaktivieren. Über eine Anzahl von Parametern können unter Verwendung der Konsole verschiedene Aspekte des Bedürfnis-Systems von jedem Spieler selbst geändert werden.\r\n\r\nDie Funktionsweise des Bedürfnis-Systems ist detailliert in der im Download-Archiv enthaltenen [i]HDS-System_ReadMe.txt[/i] beschrieben.\r\n\r\n[b]Hinweis zur Installation:[/b]\r\nEine Update-Installation älterer Versionen der Mod als 5.1 ist leider nicht möglich, da ich teilweise bereits in früheren Versionen vorhandene, ältere Skripte nochmals erweitert habe. Mit älteren Spielständen werden diese Skripte nicht mehr korrekt funktionieren. Die Installation der Mod sollte daher ausgehend von einem \\\"sauberen\\\" Spielstand erfolgen, wie in der ReadMe näher beschrieben.\r\n\r\nWie die Erfahrung lehrt, bleiben aber selbst in einem sauberen Spielstand nach zuvor korrekt erfolgter Deinstallation einer älteren Version des PlugIns doch noch Rückstände davon in Savegames erhalten, die möglicherweise unter bestimmten Umständen zu seltsamen Fehlern führen können. Die besten Ergebnisse erzielt man bei einer Installation der Modifikation ausgehend von einem Spielstand, der ältere Versionen der Nordländer-Ausstattung zuvor noch nie gesehen hat.\r\n\r\nEin Update von Versionen neuer als 5.1 auf die aktuelle Vers. 5.4 ist durch einfachen Austausch der Dateien [i]bbLager.esp[/i] und [i]bbLager.bsa[/i] im Data-Ordner möglich.\r\n\r\nDie Mod wurde mit dem Creation Kit Vers. 1.6.89.0 erstellt. \r\n\r\n[center][img]http://www.ei-der-zeit.com/Brausebart/bbLagerS/v42/screens/naee_cover02.jpg[/img][/center]\r\n\r\nDer eine oder andere mag sich noch an Sepp Uldinger aus Cyrodiil erinnern, wie er nahe Skingrad einst die Herstellung von und sein Geschäft mit Camping-Ausstattung betrieb. Die Kenntnisse wurden von Generationen der Uldingers weitergegeben und heute ist es Alfons Uldinger in Skyrim, der die Tradition der Herstellung von Camping-Artikeln aufrecht erhält. Oder bedauerlicherweise besser gesagt: aufrecht erhielt.\r\n\r\nUnglücklicherweise ereilte Alfons Uldinger während eines Jagdausflugs gemeinsam mit seinem treuen Hund Brego etwa auf halber Strecke zwischen Flusswald und Weißlauf in einem Moment von Unachtsamkeit der Tod.\r\n\r\nIhr findet sein Lager verlassen; nur Brego hält einsam Wacht neben seinem toten Herrn. Da sie nun nicht länger von ihrem ursprünglichen Besitzer benötigt werden, steht es Euch frei, die verwaisten Ausrüstungsgegenstände an Euch zu nehmen. Ebenso wird Brego sich trotz seiner Trauer freuen, wenn Ihr ihm ein neuer Herr sein möchtet.\r\n\r\nAuf seinem letzten, so verhängnisvollen, Jagdausflug reiste Alfons nur mit kleinem Gepäck: einem kleinen Zelt mit Schlafsack, Kochstelle, Baumstumpf und seinem magischen, Nimmervollen Rucksack. Vielleicht hätte er doch vor seinem Aufbruch gründlicher nach seinem besonderen Waldläufer-Ring suchen sollen, welchen er irgendwo in seiner Jagdhütte, südwestlich Morthals gelegen, verlegt hat.\r\n\r\n[center]Demo-Video (Vers. 3.1)\r\n[youtube]_px6-OC_9jA[/youtube][/center]\r\n\r\nWenn ihr mögt, steht es Euch frei, Alfons Hütte und seine Werkstatt im Keller selbst nach weiteren Ausrüstungsgegenständen zu durchsuchen. Ihr früher Eigentümer benötigt sie bekanntlich nicht länger. Schaut beim toten Alfons nach seinem Schlüssel.\r\n\r\n\r\n[b]Ausrüstungsgegenstände der Nordländer-Ausstattung[/b]\r\n\r\n[b]Trag- und aufstellbare Laternen[/b]\r\nVersion 4.1 der Nordländer-Ausstattung enthält nun die bereits in meiner Mod \\\"Mehr Licht\\\" vorgestellten Laternen.\r\nDazu habe ich die im Spiel bereits enthaltene Laterne ausrüstbar gemacht, deren Modell ein wenig modifiziert, mit zusätzlichen Glasscheiben versehen sowie eine höher aufgelöste Textur aufgebracht.\r\n\r\nZur Herstellung einer tragbaren Laterne am Amboss benötigt man eine der im Spiel zu findenden \\\"normalen\\\" Laternen und ein Feuersalz. Die Brenndauer der Laternen ist unbegrenzt. Die Anleitung zur Herstellung der Laternen wird verfügbar, \r\n\r\nLegt man eine Laterne aus dem Inventar ab und aktiviert sie nachfolgend im Schleichmodus, wird die Laterne an dieser Stelle fixiert. Aktiviert man die fixierte Laterne, wiederum im Schleichmodus, so wird ihr Licht gelöscht. Nochmaliges Aktivieren im Schleichmodus entzündet die Laterne wieder. Um eine fixierte Laterne wieder aufzunehmen, muss man sie normal aus dem Stand aktivieren.\r\n\r\n[b]Magische Truhen[/b]\r\nIn den Zelten finden sich seit Vers. 4.1 besondere \\\"Magische Truhen\\\", bzw. im kleinen Zelt ist es ein \\\"Magischer Sack\\\". Die Behälter greifen alle auf denselben Inhalt zu. Legt man etwas in eine der Truhen bzw. den Sack, sind die Gegenstände auch in allen anderen Truhen enthalten.\r\n\r\nNeben diesen fest installierten magischen Truhen, können weitere Exemplare selbst am Amboss hergestellt werden. Benötigt werden hierzu jeweils 10 Stück Feuerholz, 5 Ebenerzbarren und ein gefüllter, mächtiger Seelenstein. Diese transportablen Truhen können überall aufgestellt und fixiert werden, z.B. in den Spielhäusern oder bei den bevorzugten Händlern usw.\r\n\r\n[b]Barrikaden und Zäune[/b]\r\nNeu in Vers. 4.1 hinzugekommen sind Barrikaden und Windschutzzäune. Die Gegenstände können am Gerbgestell angefertigt werden.\r\nWurden wenigstens 2 Barrikaden und/oder Zäune aufgestellt, schützen sie das Lager vor feindlichen Angriffen. D.h.: Man kann auch dann im Feldbett oder dem kleinen und mittlerem Zelt schlafen, wenn sich Gegner in der Nähe befinden sollten.\r\n\r\n[b]Fuhrwerk[/b]\r\nMit Version 3.1 wurde die Nordländer-Ausstattung um ein Pferdefuhrwerk zum Transport der Ausrüstungsgegenstände erweitert. Eine Benutzung des Fuhrwerks ist optional. Zu finden ist der Wagen anfangs bei Alfons Uldingers Hütte. Sofern man ein Pferd besitzt und dieses sich in der Nähe des Wagens aufhält, kann man sein Pferd vor den Wagen anspannen. Reitet man jetzt das Pferd, wird es das Fuhrwerk hinter sich herziehen. Nimmt man hingegen auf dem Kutschbock Platz, erlaubt ein Menü die Auswahl des eigenen Lagers (sofern aufgebaut) und der Städte Skyrims, wohin das Pferd das Fuhrwerk dann selbständig zieht. Hat man sein Pferd nur angekoppelt ohne es zu reiten oder auf dem Fuhrwerk aufzusitzen, wird das Pferd samt Wagen dem Spieler in einigem Abstand folgen.\r\n\r\nWährend der ersten Benutzung des Fuhrwerks erhält man automatisch den Zauber \\\"Wagenruf\\\". Der Zauber kann dazu verwendet werden, Fuhrwerk und Pferd zu sich zu rufen. Der Zauber kann nur im Freien erfolgreich angewendet werden.\r\n\r\nLässt man das Fuhrwerk im abgekoppelten Zustand zurück, zeigt eine Kartenmarkierung (Hufeisen-Symbol) dessen Standort auf der Übersichtskarte.\r\n\r\nBitte beachtet auch die in der ReadMe angegebenen Hinweise zur Verwendung des Fuhrwerks.\r\n\r\n[b]Kleines, offenes Zelt[/b]\r\nDas kleine Zelt beinhaltet einen Schlafsack und bietet minimalen, dafür aber auch auf beengtem Raum verfügbaren Schlafkomfort für den ermüdeten Abenteurer. Der Sack neben dem Zelt steht in Verbindung zu den anderen \\\"Magischen Truhen\\\" (siehe unten). Gegenstände, welche in den Sack gegeben werden, können anderenorts aus weiteren magischen Truhen wieder entnommen werden. Weiterhin verfügt das kleine Zelt über ein wenig Innenausstatung, einen Platz zum Einpacken von Proviantpaketen sowie eine ein- und ausschaltbare Beleuchtung. Version 5.0 fügt dem Zelt ein stationäres Wasservorratsfass hinzu.\r\n\r\n[b]Mittleres, offenes Zelt[/b]\r\nDas mittlere Zelt verfügt über eine fest eingebaute Inneneinrichtung einschl. einer \\\"Magischen Truhe\\\". Die Beleuchtung des Zeltes kann auf Wunsch ein- und ausgeschaltet werden. Wie das kleine Zelt, bietet auch das mittlere Zelt ansonsten nur wenig Schutz, vor allem nicht vor etwaigen Gegnern in der näheren Umgebung. Ihr könnt dort nicht schlafen, solange die Umgebung nicht sicher ist. Ein Arbeitsplatz zur Herstellung von Proviantpaketen sowie auch hier ein Wasserfass stehen ebenfalls zur Verfügung.\r\n\r\n[b]Feldbett[/b]\r\nDas Feldbett kann, anders als die Zelte, auch in Innenräumen aufgestellt werden, falls Euch dies einmal notwendig erscheint.\r\n\r\n[b]Wohnzelt[/b]\r\nDas große Wohnzelt beinhaltet verschiedenste Einrichtungsgegenstände, welche Euch auch unterwegs allen von Zuhause bekannten Komfort gewähren.\r\n\r\n- Bett sowie Schlafsack, in denen Ihr komfortabel wie Daheim die Nacht verbringen könnt.\r\n- Badezuber für ein erholsames Bad am Abend. Ihr werdet den Zuber erfrischt und gestärkt verlassen.\r\n- Ein Kanonenofen sorgt neben behaglicher Wärme auch dafür, dass Ihr Euch eine Mahlzeit im Zelt zubereiten könnt.\r\n- Ein Platz zum Einpacken von Proviant sowie ein Vorratsfass für Wasser komplettieren die Kochecke.\r\n- Im Falle einer Erkrankung mag Euch die Dibella-Statue nützlich sein.\r\n- Alchemisten finden einen kleinen Alchemie-Platz samt speziellem Trankmischerbeutel vor. Der Beutel nimmt auf Wunsch\r\n  automatisch alle von Euch gesammelten Zutaten auf.\r\n- Für magiebewanderte Reisende findet sich ein kleiner Verzauberungs-Platz.\r\n- Kisten, Säcke und Schränkchen bieten Stauraum für Eure überzähligen Habseligkeiten. Die Container im Zelt sind sämtlich respawn-frei, mit Ausnahme der \\\"Vorratstonne\\\". Sie wird von Zeit zu Zeit neu aufgefüllt.\r\n- Schließlich findet Ihr im Zelt eine Laute und eine Flöte. Spielt die Instrumente zu Eurer Erbauung. Beide Instrumente sind statisch. Nach dem Aktivieren startet jeweils eine kurze Animation. Während der Animationen sind die PlayerControls deaktiviert. Nach dem Spiel erhält man einen kleinen Bonus in Form eines Zaubers. Aktiviert man die Laute oder die Flöte im Schleichmodus, kann man wählen, ob man gerne Hintergrundmusik im Zelt hören möchte.\r\n\r\n[b]Werkstattzelt[/b]\r\nDie Ausstattung des Werkstattzeltes bietet alles, was der fahrende Handwerker benötigt: Schmelzofen, Schmiedeamboss, Schleifstein, Werkbank, Gerbergestell und einen Platz zum Hacken von Feuerholz. Verschiedene Kisten und Saäcke werden von Zeit zu Zeit immer wieder mit Rohmaterialien aufgefüllt.\r\nMit Vers. 4.4 kommt ein Abfallbehälter hinzu. In diesen hinein gelegte Gegenstände werden (nach Rückfrage) im Schmelzofen geschmolzen oder verbrannt. Je nach Gegenständen, erhält man eine Anzahl versch. Metall-\\\"Nuggets\\\", die sich zu Erzbarren weiterverarbeiten lassen sowie Holzkohle.\r\n\r\nAb Version 4.4 werden zum Aufstellen der Zelte Zeltstangen sowie Lederstreifen benötigt. Die großen Zelte benötigen 8 Zeltstangen und 20 Lederstreifen,  das mittlere Zelt benötigt 6 Zeltstangen und 15 Lederstreifen und für das kleine Zelt werden 4 Zeltstangen und 8 Lederstreifen gebraucht. Beim Abbau der Zelte erhält man regelmäßig 2 Lederstreifen weniger zurück, als für den Aufbau verwendet wurden. Bei den großen Zelten besteht darüber hinaus eine 50% Wahrscheinlichkeit, dass eine oder zwei Zeltstangen zerbrechen, beim mittleren und kleinen Zelt besteht eine 50% Wahrscheinlichkeit, dass eine Zeltstange zerbricht. Einige Zeltstangen findet man bei Alfons Uldingers Hütte, weitere können in den Sägewerken angefertigt werden.\r\n\r\n[b]Kochstelle und Lagerfeuer[/b]\r\nMit der Kochstelle könnt Ihr Euch auch unabhängig vom großen Wohnzelt jederzeit eine warme Mahlzeit zubereiten. Setzt Euch an das Lagerfeuer, um dessen Licht und Wäre zu genießen. Für das Entzünden des Feuers benötigt Ihr jedesmal ein Stück Feuerholz, entweder in Eurem Gepäck oder im Rucksack. Habt Ihr sowohl die Feuerstelle als auch Feuerholz im Gepäck oder dem Rucksack, wird beim Aufstellen der Kochstelle das Feuer automatisch mit platziert.\r\n\r\n[b]Aufstellbare Lagerfackeln[/b]\r\nDie schon aus der \\\"Abenteurerausstattung\\\" bekannten aufstellbaren Fackeln sind auch in der Nordländer-Ausstattung wieder verfügbar. Die Fackeln werden aufgestellt, indem man sie einfach aus dem Inventar fallen lässt. Bei jedem Aufstellen wird ein Stück Feuerholz benötigt und sofern vorhanden automatisch dem Spieler-Inventar oder dem Rucksack entnommen. Ohne Feuerholz können die Fackeln nicht aufgestellt werden. Durch Aktivieren aufgestellter Fackeln werden diese wieder aufgenommen.\r\n\r\nMit Vers.4.1 können die Fackeln nun auch selbst (am Gerbgestell) hergestellt werden. Benötigt werden dazu pro Aufstellfackel eine gewöhnliche Fackel, 3 Lederstreifen und ein Stück Feuerholz. Die Herstellung erfolgt am Gerbgestell. Die Herstellung wird möglich, nachdem man eine der Fackeln oder die Laterne in Alfons Uldingers Keller an sich genommen hat. Die bisherigen sechs individuellen Fackeln sind weiterhin in der Mod enthalten.\r\n\r\n[b]Stuhl und Baumstumpf[/b]\r\nBieten Sitzgelegenheiten für den Spieler und wahlweise auch Begleiter.\r\n\r\n[b]Sitzkissen[/b]\r\nDas Sitzkissen stellt eine weitere portable Sitzgelegenheit dar. Abhängig davon, ob das Kissen auf dem Boden oder einer erhöhten Position abgelegt wird, sitzt man auf dem Kissen entweder im Schneidersitz oder in normaler Sitzhaltung.\r\n\r\n[b]Map-Marker[/b]\r\nBeim Aufbauen eines der Zelte, wird eine Markierung auf der Übersichtskarte eingefügt, welche die Position des Lagers markiert und auf Wunsch eine Rückreise mittels Schnellreisefunktion ermöglicht.\r\n\r\n[b]Portalsteine[/b]\r\nDie Ausrüstung enthält zwei Portalsteine. Sind beide Steine in der Spielwelt platziert, kann zwischen ihnen teleportiert werden, z.B. in das eigenen Haus oder zum bevorzugten Händler und wieder zurück zum Lager. Einer der Portalsteine befindet sich anfangs im großen Wohnzelt, kann von dort aber mitgenommen (im Schleichmodus aktivieren) und anderswo beliebig aufgestellt werden.\r\n\r\n[b]Rucksack[/b]\r\nDer Rucksack stellt meine Skyrim-Version eines \\\"Nimmervollen Beutels\\\" dar. Anfangs enthält er die Ausrüstungsgegenstände. Nimmt man den Rucksack ins Inventar auf und aktiviert ihn dort, geschieht zunächst scheinbar nichts. Es wird angezeigt, der Gegenstand könne nicht verwendet werden. Sobald man danach das Inventar-Menü aber verlässt, wird der Rucksack geöffnet und man kann nun bel. Gegenstände hinein geben oder heraus nehmen. Legt man den Rucksack ab, kann man auf die in ihm enthaltenen Gegenstände zugreifen, indem man den Sack im Schleichmodus(!) aktiviert. Aktiviert man den Rucksack aus dem Stand, nimmt man ihn wieder in das Inventar auf.\r\n\r\nIm Rucksack befinden sich seit Vers. 4.3 neu div. Beutel. Jeder dieser insg. 9 Beutel im Rucksack ist dafür vorgesehen, eine bestimmte Gruppe von Inventar-Gegenständen aufzunehmen und so das mit zunehmender Spielzeit oft überbordende Inventar zu entlasten. Alle Beutel \\\"existieren\\\" nur im Rucksack und können nicht aus diesem entnommen werden.\r\n\r\nÖffnet man einen der Beutel, hat man bei allen die Möglichkeit, eine oder mehrere Gruppen von Gegenständen zugleich aus dem Inventar und dem Rucksack in den jeweiligen Beutel zu übertragen. Und natürlich auch wieder zurück. Hierbei besteht jeweils Wahl, alle enthaltenen Gegenstände entweder zurück in das Inventar, den Rucksack oder die \\\"magischen Truhen\\\" zu transferieren. Und schließlich lassen sich die Beutel natürlich auch ganz normal öffnen, um einzelne Gegenstände daraus zu entnehmen oder hinein zu geben. \r\n\r\nBenutzt man die verschiedenenen Arbeitsplätze in den Zelten oder die Kochstelle, werden zuvor die Gegenstände aus den jeweils relevanten Beuteln oder dem Rucksack in das Spieler-Inventar übertragen, sodass sie für die Arbeit oder zum Kochen zur Verfügung stehen. Nach getaner Arbeit werden die verbliebenen Zutaten oder Materialien wieder in die Beutel zurückgelegt.\r\n\r\n[b]Angeln[/b]\r\nAls zusätzliche Möglichkeit, sich selbst in der Wildnis mit Nahrung zu versorgen, kann man nun an Flüssen und Seen nach Fischen angeln. Dazu wurden die im Spiel zu findenden, bislang nutzlosen, Angelruten in nutzbare Exemplare abgeändert. Die Angelruten sind dafür jetzt als Stäbe eingebunden. Möchte man angeln, muss eine Angel als Waffe ausgerüstet und \\\"gezogen\\\" sein. Und logischerweise sollte man sich während dem \\\"Ziehen\\\" der Angelrute nahe eines Gewässers mit Blickrichtung zu diesem befinden. Eine Textnachricht informiert darüber, ob die Angel erfolgreich ausgeworfen wurde. War dies der Fall muss einige Sekunden gewartet werden (bis zu hören ist, wie die Angel eingeholt wird). Anschließend findet man den Fang vor den eigenen Füßen. Je nach Angelerfahrung sowie zufalls-abhängig fängt man üblicherweise mind. einen bis zu max. 5 Fisch(e).\r\n\r\nAngelruten finden sich neu auch innerhalb der Angelruten-Gestelle, die man hier und dort im Spiel findet. Ein derartiges Gestell befindet sich bei Alfons Uldingers Hütte.\r\n\r\n[b]Salzabbau[/b]\r\nDa Salz im Grundspiel ein seltenes Gut darstellt, andererseits zur Zubereitung von Essen sehr häufig als Zutat benötigt wird, habe ich einen Teil der im Grundspiel vorhandenen Eisenerzadern in Salzvorkommen umgewandelt. Dort lassen sich, wie üblich mit einer Spitzhacke ausgerüstet, Salzkristalle abbauen, welche wiederum in Kochtöpfen zu Salz weiterverarbeitet werden können. Des weiteren findet man Salzkristalle nun manchmal in Fischfässern. Insgesamt wurden 130 Eisenerzadern in Salzvorkommen umgewandelt. Es verbleiben damit noch ca. 550 Eisenerzadern.\r\n\r\n[b]Neue Zutat: Mehl[/b]\r\nMit Version 4.2 wird Mehl als neue Zutat eingeführt. Man benötigt es zur Herstellung bestimmter, neuer, Backwaren. Hauptsächlich Brot kann damit neu selbst \\\"gebacken\\\" werden. Brot wiederum stellt einen der wesentlichen Bestandteile von \\\"Proviantpaketen\\\" dar. (s.u.)\r\n\r\nZur Herstellung von Mehl habe ich die im Spiel vorhandenen, jedoch bislang zwecklosen, Mühlen und handbetriebenen Mühlräder dahingehend nutzbar gemacht, dass man dort aus Weizen Mehl mahlen kann. \r\n\r\n[b]Wasserschläuche und Proviantpakete[/b]\r\nZum Stillen der Hunger- und Durst-Bedürfnisse wird, wie schon in der alten Oblivion Abenteurerausstattung, wieder hauptsächlich von Wasserschläuchen und Proviantpaketen Gebrauch gemacht.\r\n\r\nProviantpakete stellen im Prinzip eine Zusammenstellung von drei unterschiedlichen Nahrungsmitteln dar und werden den Spieler für einen ganzen Tag sättigen können. Jedes der Zelte mit Ausnahme des Werkstattzeltes erhielt neu einen Platz zum Einpacken dieser Pakete.\r\n\r\nWasserschläuche werden gebraucht, um stets einen Wasservorrat zum Stillen des Durstes mit sich zu führen.\r\n\r\nVersion 5.3 erweitert das PlugIn um Möglichkeiten, Wasservorratsfässer sowie Plätze zum Einpacken von Proviantpaketen selbst am Gerbgestell herstellen zu können, um diese danach z.B. im Spielerhaus aufzustellen.\r\n\r\n[b]Fleißigere Hühner[/b]\r\nHühnernester enthalten jetzt (auch optisch) drei Eier statt einem. Dazu habe ich allen Hühnernestern ein Skript gegeben, welches beim Nehmen dem Inventar zwei zusätzliche Eier hinzufügt.\r\n\r\n[b]Neue und geänderte Kochrezepte[/b]\r\nIn erster Linie um das durch das Angeln erhöhte Aufkommen an Fischfleisch auch nutzbar zu machen, sowie um generell die Selbstversorgung mit gekochten Speisen für eine Weiterverwendung in den Proviantpaketen zu erleichtern, habe ich verschiedene neue Kochrezepte hinzugefügt. Diese benötigen jeweils nur zwei Zutaten, welche sich für Jäger oder Angler relativ einfach beschaffen lassen, ohne dass man sich allzu viel als Kräutersammler betätigen muss.\r\n\r\n[b]Nirnwurz-Elixiere (Vers. 5.2)[/b]\r\nRotwurz-, Blauwurz- und Lilawurz-Elixiere sind neue Tränke, die als eine Art Aufputschmittel für begrenzte Zeit die Müdigkeit reduzieren können falls man gerade keine Zeit oder Gelegenheit zum Schlafen findet. Dies geschieht allerdings auf Kosten der Ausdauer- und Heilungs-Regeneration.\r\n\r\n[b]Mokka und dessen Zubereitung[/b]\r\nDie Mod fügt mit Vers. 5.3 Mokka als neues Getränk in das Spiel ein. Mokka wird hergestellt aus \\\"Schwarzbohnen\\\" aus Elsweyr. Diese werden exklusiv von den Khajiit-Handelskarawanen in kleinen Säcken angeboten. Die Zubereitung des Mokkas erfolgt in einer speziellen Mokka-Kanne. Eine solche ist exklusiv bei Ri\\'saad, dem Anführer der Karawane bei Weißlauf erhältlich. Um Mokka aufzubrühen, muss die Kanne nahe einer Feuerstelle platziert und wie üblich im Schleichmodus fixiert werden.\r\n\r\n[b]Schmuckstücke und sonstiges[/b]\r\n\r\n[b]\\\"Ring des Waldläufers\\\"[/b]\r\nGewährt Euch den Zauber \\\"Kynes Frieden\\\". Solange der Ring getragen wird, greifen Tiere in Eurer Nähe nicht an und fliehen auch nicht vor Euch.\r\n\r\n[b]\\\"Ring des nächtlichen Jägers\\\"[/b]\r\nGewährt Spielern aller Rassen permanente Nachtsicht, solange der Ring getragen wird.\r\n\r\n[b]Amulett \\\"Stern des Nordens\\\"[/b]\r\nSolange das Amulett getragen wird, erleuchtet eine Lichtaura Eure nahe Umgebung. Der Zauber entspricht im Prinzip dem \\\"Kerzenschein\\\", ist aber permanent und etwas heller. Des weiteren ermöglicht der \\\"Stern des Nordens\\\" Unterwasseratmung.\r\n\r\n[b]Stundenglas[/b]\r\nMit dem Stundenglas in Eurem Gepäck, könnt Ihr Euch periodisch zur halben und/oder vollen Stunde die Uhrzeit anzeigen lassen.\r\n\r\n[b]Kräutertasche des Sammlers[/b]\r\nMan findet diesen besonderen Trankmischerbeutel beim Handelskontor in Flusswald auf einem Fass liegend. Die Tasche ist als Kleidungsstück eingebunden, belegt aber keinen Body Slot. Solange man die Kräutertasche ausgerüstet hat, werden Zutaten in der unmittelbaren Nähe des Spielers automatisch eingesammelt, ohne dass man sie noch anklicken muss. Hat man den Nimmervollen Rucksack dabei, werden die gesammelten Zutaten im Beutel für Zutaten abgelegt, anderenfalls normal im Inventar. Sind viele Zutaten gleichzeitig zu ernten, etwa auf einem Feld, dauert es eine kurze Weile, bis alle Zutaten eingesammelt sind. Hier bitte einfach etwas warten.\r\n\r\n[b]Stab der Rückkehr und Rückkehr-Zauber (Vers. 5.2)[/b]\r\nDen Stab findet man in Alfons Uldingers Hütte. Nimmt man den Stab an sich, erhält man automatisch auch den Zauber \\\"Rückkkehr\\\". Nachdem man den Stab genommen hat, ist er im Gepäck in der Kategorie \\\"Sonstiges\\\" zu finden.\r\n\r\nUm den Stab aufzustellen und damit den einen Rückkehrpunkt zu markieren, muss der Stab lediglich an einem bel. Ort aus dem Gepäck in die Umgebung abgelegt werden. Danach kann der Zauber \\\"Rückkehr\\\" an jedem Ort verwendet werden. Spricht man den Zauber aus, wird am aktuellen Aufenthaltsort eine magische Markierung gesetzt und der Spieler unmittelbar zum \\\"Stab der Rückkehr\\\" teleportiert. Aktiviert man danach den Stab, reist man wieder zu dem Ort zurück, an welchem man zuvor den Rückkehr-Zauber gewirkt hat. \r\n\r\nReist man mit dem Rückkehrstab und -zauber, werden ein ggf. folgender Begleiter und/oder tierischer Begleiter und/oder das folgende Pferd mitgenommen. Das Pferd kommt nicht mit, wenn sich das Teleportations-Ziel nicht im Worldspace Tamriel befindet.\r\n\r\n[b]Pferdegeflüster (Vers. 5.2)[/b]\r\nIn Alfons Uldingers Hütte findet man die Schriftrolle \\\"Pferdeflüsterer\\\". Liest man die Schriftrolle erhält man den Zauber (Schrei) \\\"Pferderuf\\\" und erlernt außerdem die Fähigkeit, mit seinem Pferd sprechen zu können.\r\n\r\n[b]Pferderuf[/b]\r\nDer \\\"Pferderuf\\\" ermöglicht es, sein Pferd jederzeit zu sich zu rufen. Befindet sich das Pferd in relativer Nähe genügt ein kurzer Pfiff und das Tier wird in Kürze herbei galoppieren. Ist das Pferd hingegen weiter entfernt, greift man automatisch zum Pferdehorn. Bald nach Ertönen des Hornsignals wird das Pferd in unmittelbarer Nähe des Spielers erscheinen.\r\n\r\n[b]Mit Pferden sprechen[/b]\r\nUm mit seinem Pferd zu sprechen, muss man das Tier im Schleichmodus aktivieren. Man kann es nun anweisen, dem Spieler zu folgen/nicht länger zu folgen, auf die Satteltaschen des Pferdes zugreifen oder es füttern oder tränken. Tut man das, wird das Tier für einige Zeit schneller und stärker als es aufgrund seiner Grundwerte wäre.\r\n\r\n[b]Brego, der Hund[/b]\r\nLast but not least findet Ihr den Hund Brego und könnt ihn auf Wunsch als Begleiter mit Euch nehmen. In Version 5.1 habe ich mich noch einmal Bregos angenommen und ihn vollständig überarbeitet.\r\n\r\nDurch regelmäßiges Füttern wird Brego mit der Zeit größer. Brego frisst alle Arten von rohem Fleisch (mit Ausnahme von Hundefleisch), besonders gerne aber Hundekuchen. Hundekuchen können vom Spieler aus einem Stück Wildbret und einer Portion Knochenmehl im Kochtopf hergestellt werden. Vor allem dient eine regelmäßige Fütterung Bregos aber der Aufrechterhaltung seiner Fertigkeiten. Brego muss regelmäßig Nahrung zu sich nehmen. Zwar ist er unsterblich (essential), doch ohne Fütterungen werden seine Gesundheit, Ausdauer und Geschwindigkeit mit der Zeit massiv leiden.\r\n\r\nBrego ist trotz seiner anfangs geringen Größe bereits als recht tüchtiger Jagdhund ausgebildet! Erteilt man ihm das Kommando \\\"Fass!\\\" wird er versuchen, das nächstbeste Wild in der Nähe zu erjagen. Elche, Hirsche, Füchse und Kaninchen sind seine bevorzugten Beutetiere.\r\n\r\nNimmt man Brego zum ersten Mal mit sich, erhält man automatisch den Zauber (Schrei): \\\"Brego rufen\\\". Wendet man den Schrei an, wird Brego seine momentane Aktivität beenden und zum Spieler zurückkehren. Befindet er sich in relativer Nähe, wird er zum Spieler laufen. Ist er weiter entfernt, wird Brego zum Spieler teleportiert.\r\n\r\n\r\n[center]_________________________________________________________________________[/center]\r\n[b]Credits:[/b]\r\n\r\nVielen Dank an [b]wildkarrde[/b] für seine Oblivion-Mesh des Ofens im Wohnzelt, die ich übernommen habe.\r\n\r\nBregos Textur basiert auf [b]Ichibu\\'s[/b] \\\"Brown and White Dog\\\".\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=1381\r\n\r\nDanke an [b]Apogee777[/b], aus dessen Mod \\\"Move it Dammit\\\" ich die Vorgehensweise übernommen habe, um den Weg blockierende NPCs anzuschubsen.\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4020\r\n\r\nIch bedanke mich herzlich bei [b]TreasureChest[/b] für die Erlaubnis, die Wasserschlauch-Mesh aus seiner \\\"Fur Bag-Backpack\\\"-Mod entnehmen und weiter verwenden zu dürfen.\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=9090\r\n\r\nDie Kaffee-Textur stammt aus [b]Sam Lakes[/b] \\\"Coffee Resource\\\" für Oblivion. Vielen Dank für die Bereitstellung als Ressource!\r\n\r\n[center]_________________________________________________________________________[/center]\r\n[b]Versionshistorie:[/b]\r\n\r\n[b]Version 5.5 - 27.08.2012[/b]\r\n* Brego wird keine Gegner mehr angreifen, während der Spieler schleicht.\r\n* Brego folgt normalerweise jetzt in größerem Abstand. Wenn der Spieler schleicht, kommt er näher.\r\n+ Optionaler Anpassungs-Patch für [i]83Willows \\\"101 Bugs\\\"[/i]-Mod. Mit dem Patch können die zusätzlichen Insekten\r\n  aus \\\"101 Bugs\\\" mit der \\\"Kräutertasche des Sammlers\\\" automatisch eingesammelt werden und die dabei\r\n  gesammelten Zutaten werden von der Nordländer-Ausstattung als solche erkannt.\r\n+ Neuen Aufbewahrungsbeutel für \\\"Schriften\\\" hinzugefügt.\r\n+ Neuen Aufbewahrungsbeutel für \\\"Waffen und Rüstungen\\\" hinzugefügt.\r\n- Bugfix: Der Hotkey zum Öffnen des Camp-Rucksacks funktioniert jetzt auch bei abgeschaltetem HDS-System.\r\n* Anpassungs-Patch für DLC Dawnguard aktualisiert und an die neuen Beutel angepasst.\r\n* Das Abbauen von Salzvorkommen geht nun 3 x schneller. Diese Änderung greift allerdings erst,\r\n  wenn ein neues Spiel begonnen wird.\r\n* Version 5.5 enthält jetzt die in Vers. 5.4 noch optionalen, neuen Hühnernester. Die optionale\r\n  Version ist damit entfallen.\r\n* Proviantpakete regenerieren beim Essen mehr Gesundheit.\r\n* Wirkungsdauer von \\\"Des Abenteurers Segen\\\", \\\"Erholsames Baden\\\" und \\\"Glück des Barden\\\" wieder verlängert.\r\n* Nach der Aktivierung von Gegenständen der Nordländer-Ausstattung im Schleichmodus, richtet sich die\r\n  Spielfigur in den meisten Fällen automatisch wieder auf.\r\n\r\n[b]Version 5.4 - 16.08.2012[/b]\r\n+ Die Modifikation wurde um einen optionalen Anpassungs-Patch für das DLC Dawnguard erweitert. \r\n  Details siehe in seperater bbLagerDGPatch.txt\r\n* Die Modifikation ist ab Version 5.4 von der Update.esm abhängig\r\n+ Als Vampir wird man bei aktiviertem HDS-System nicht durch Hunger, Durst und Müdigkeit beeinträchtigt.\r\n+ Bei aktiviertem HDS-System können die aktuellen Hunger-, Durst- und Müdigkeitswerte per Hotkey abgefragt werden.\r\n  Hat man den Rucksack im Inventar, kann dieser per Hotkey geöffnet werden. Die Hotkey-Funktionalität benötigt SKSE.\r\n- Bugfix: Nach Verwendung von \\\"startquest bbReleaseHorsesQuest\\\" und anschließender De- und Neuinstallation\r\n  der Nordländer-Ausstattung sollte das zugehörige Quest-Skript nicht länger wieder und wieder ausgeführt werden.\r\n+ Hat man ein beschworenes Pferd geritten, dessen Beschwörung geendet hat oder nach dessen Tod, wird durch den\r\n  \\\"Pferderuf\\\" eines der zuletzt gerittenen regulären Pferde herbei gerufen. \r\n+ Die Anzahl der per Pferderuf im Schleichmodus herbeigerufenen Pferde wurde auf max. 6 erweitert. \r\n- Bugfix: Man erhält den Zauber \\\"Brego rufen\\\" jetzt erst nachdem man zum ersten Mal mit Brego gesprochen hat.\r\n* Bregos Skripte und Packages wurden vom Vanilla-Begleiter-System entkoppelt, d.h. er zählt darin nicht länger\r\n  als tierischer Begleiter, sodass man trotz Bregos Begleitung noch einen weiteren Hund, Panzertroll o.ä mitnehmen kann.\r\n+ Brego besitzt nun 100% Resistenz gegen Magie.\r\n+ Verbesserte Erkennung von dunklen Lokationen, wenn der \\\"Stern des Nordens\\\" sich im Automatik-Modus befindet.\r\n+ Man kann nun jedesmal beim Aufnehmen des \\\"Stern des Nordens\\\" wählen, ob der Automatikmodus aktiviert werden soll.\r\n+ Zwei weitere Sitzkissen hinzugefügt. Man findet sie in Alfons Hütte. Textur der Sitzkissen verbessert.\r\n* Verschiedene Skript-Anpassungen vorgenommen, um die Nordländer-Ausstattung leichter an das DLC Dawnguard anpassen zu können.\r\n+ Skript hinzugefügt, welches die Vorratstonne im Wohnzelt, die Materialkisten im Werkstattzelt sowie die Kaffeebohnen-\r\n  vorräte der Khajiit-Händler nach 72 Ingame-Stunden wieder auffüllt.\r\n+ Experimentell: Alle Hühnernester aus dem Grundspiel wurden durch eine eigene Version ersetzt. In den neuen Nestern\r\n  respawnen nach 24 Ingame-Stunden ein oder zwei Eier und wartet man weitere 12 Stunden, nochmals 0 bis 2 weitere Eier.\r\n* Rezept für Bratkartoffeln geändert. Es werden nun 4 Kartoffeln, 1 x Salz und ein Hühnerei benötigt.\r\n* Wirkungsdauer der Nirnwurztränke verkürzt.\r\n* Wirkungsdauer von \\\"Des Abenteurers Segen\\\", \\\"Erholsames Baden\\\" und \\\"Glück des Barden\\\" verkürzt.\r\n* Beim Einschmelzen im Werkstattzelt erhält man weniger Gold- Malachit- und Obsidian-Nuggets.\r\n+ Zusätzliche Rezepte für Hundekuchen aus Kaninchen- Rind- und Fuchsfleisch.\r\n* Verringerte Wahrscheinlichkeit für Salzkristalle in Leveled Lists\r\n* Verschiedene zu laute Soundeffekte in ihrer Lautstärke reduziert.\r\n\r\n[b]Version 5.3.2 - 05.08.2012[/b]\r\n- Bugfix: Skript für die Hühnernester geändert. Eier sollten ab jetzt durch die \\\"Kräutertasche des Sammlers\\\"\r\n  nur noch einmal pro Nest automatisch eingesammelt werden.\r\n- Bugfix: Seltenen Fehler behoben, der 9999 Sitzkissen im Beutel für Camping-Ausrüstung vervielfältige.\r\n\r\n[b]Version 5.3.1 - 28.07.2012[/b]\r\n- Bugfix: Bei ausgerüsteter Kräutertasche werden während des Angelns jetzt auch Schlachterfische nicht\r\n  mehr endlos eingesammelt.\r\n- \\\"Stern des Nordens\\\" sollte nicht länger manchmal im Inventar vervielfältigt werden.\r\n* Liste der Gegenstände für den \\\"Beutel für Gerümpel\\\" ergänzt.\r\n* Magische Gegenstände aus der Nordländer-Ausstattung können nicht mehr entzaubert werden.\r\n* Wasserschläuche können nicht mehr bei Bauern aufgefüllt werden sondern nur noch in Gasthäusern.\r\n- Bugfix: Camp-Gegenstände werden nach Benutzung des Schmelzers im Werkstattzelt wieder in den Beutel\r\n  für Camp-Gegenstände zurückgelegt.\r\n- Bugfix: Gefüllte Wasserfässer werden jetzt tatsächlich von Gastwirten angeboten.\r\n* Nuggets auf Wunsch umbenannt in z.B. Nugget-Silber, Nugget-Gold usw.\r\n+ Verwendet man den \\\"Pferderuf\\\" während sich das Pferd in unmittelbarer Nähe aufhält, wird dies vom Tier neu\r\n  als \\\"Folge mir\\\"- bzw. \\\"Folge mir nicht länger\\\"-Kommando interpretiert, so als hätte man die entsprechende\r\n  Anweisung im Dialog-Menü gegeben.\r\n+ Ein Quest-Skript zur sauberen Deaktivierung der Pferde-Funktionen der Nordländer-Ausstattung hinzugefügt.\r\n  Die Ausführung von \\\"[i]Startquest bbReleaseHorsesQuest[/i]\\\" in der Konsole setzt die Attribute der Pferde auf \r\n  ihre Normalwerte zurück, macht die Pferde normal aktivierbar und deaktiviert die Pferde-Funktionen\r\n  der Nordländer-Ausstattung. Der Pferderuf-Zauber wird entfernt und ggf. der Inhalt der Satteltaschen in das\r\n  Spieler-Inventar übertragen.\r\n  Möchte man später die Pferde-Funktionen wieder nutzen, kann die Schriftrolle in Alfons Uldingers Hütte erneut\r\n  gelesen werden.\r\n  Das Quest-Skript kann auch genutzt werden, um nach einer Deinstallation der Mod \\\"Better Horses\\\" die Pferde wieder\r\n  ansprechbar zu machen und die von dem genannten PlugIn verursachten 25.000 Hitpoints der Pferde zurückzusetzen.\r\n\r\n[b]Version 5.3 - 24.07.2012[/b]\r\n+ Schwarzbohnen (Kaffee), Schwarzbohnen-Mehl und Mokka als neue Zutaten bzw. Getränke hinzugefügt. Mokka-Kanne zur\r\n   Herstellung von Mokka in Feuerstellen hinzugefügt.\r\n+ Auf- und herstellbare Wasser-Vorratsfässer hinzugefügt.\r\n+ Auf- und herstellbare Plätze zum Packen von Proviantpaketen hinzugefügt.\r\n- Bugfix: Schwebende Fackeln nach dem Abbau der Zelte beseitigt\r\n- Bugfix: Langwährender Fehler beim Aufstellen der Stühle, der Baumstümpfe, des Feldbettes, der Kochstelle und der\r\n  Feuerstelle beseitigt. Die Gegenstände sollten nun schon beim ersten Aufstellen in der korrekten Größe sein und die\r\n  Feuerstelle sollte nicht mehr beim ersten Aufbauen der Kochstelle verschwinden.\r\n* Nach der Verwendung von Kocktopf und Alchemieplatz im Wohnzelt wird man nun gefragt, ob die verbliebenen\r\n  Zutaten in den Trankmischerbeutel im Zelt gelegt werden sollen.\r\n* Nach dem Ansprechen der Pferde wechselt die Kameraposition automatisch wieder in die First-Person-Ansicht,\r\n  sofern diese zuvor aktiv war.\r\n- Kein Hundebellen mehr nach einem Ansprechen der Pferde.\r\n\r\n[b]Version 5.2.2 - 19.07.2012[/b]\r\n* Beim Aufnehmen des \\\"Stabs der Rückkehr\\\" wird man nun gefragt, ob man nach dem Aufnehmen zum\r\n  markierten Rückkehrpunkt (sofern gesetzt) zurückreisen möchte. Ein markierter Rückkehrpunkt\r\n  wird nicht mehr automatisch gelöscht.\r\n- Der Rückkehrzauber kann nicht mehr während eines Kampfes gewirkt werden.\r\n+ Neue Globale Variable bbHorseFeedMult (Voreinstellung: 1.0)\r\n  Der Wert der Variablen beeinflusst, wie schnell Pferde nach dem Tränken und Füttern wieder hungrig\r\n  und durstig werden. Kleinere Werte verlängern die Zeit, bis das Tier wieder gefüttert/getränkt\r\n  werden sollte. Ein Wert von 0.0 bewirkt, dass die Tiere ihre verbesserten Attribute nach\r\n  einer Fütterung und dem Tränken dauerhaft beibehalten.\r\n- Bugfix: Beim Pferderuf wird jetzt (wie in der ReadMe angegeben) tatsächlich unterschieden, ob\r\n  sich das gerufene Pferd in der Nähe oder weiter entfernt aufhält und je nachdem gepfiffen oder \r\n  zum Pferdehorn gegriffen.\r\n+ Wird der Pferderuf im Schleichmodus ausgeführt, werden bis zu vier der dem Spieler gehörenden Pferde\r\n  herbeigerufen. Ich verwende die Mod \\\"Amazing Follower Tweaks\\\" und so finden die Begleiter ggf.\r\n  ihre Pferde schneller. Ein Pferd gilt als dem Spieler gehörend, sobald man es regulär erworben und\r\n  wenigstens einmal mit ihm gesprochen hat.\r\n+ Der \\\"Stern des Nordens\\\" verfügt neu über einen optionalen Automatik-Modus für das von ihm\r\n  ausgehende Licht. In Exteriors während der Tagstunden und in bewohnten Häusern erlischt sein \r\n  Licht. Befindet man sich während der Nacht im Freien oder in Höhlen, Ruinen etc. leuchtet das\r\n  Amulett. Sobald man in Interiors schleicht, erlischt das Licht ebenfalls selbständig.  \r\n  Die Erkennung, ob man sich in einem Dungeon oder einem Haus befindet, ist noch experimentell. \r\n  Um den Automatik-Modus des Amuletts zu aktivieren, muss in der Konsole:\r\n  StartQuest bbSDNQuest eingegeben werden. StopQuest bbSDNQuest beendet den Automatik-Modus.\r\n\r\n[b]Version 5.2.1 - 17.07.2012[/b]\r\n- Bugfix: Das Pferd folgt dem Spieler weiterhin, nachdem es geritten wurde oder in einen Kampf verwickelt war.\r\n- Bugfix: Vor dem Kochen werden Nahrungsmittel nur noch automatisch aus dem Rucksack/Beutel in das Inventar\r\n  übertragen, wenn die Kochstelle auch tatsächlich benutzt werden kann.\r\n* Sound-Effekte nach dem Füttern/Tränken des Pferdes leiser eingestellt.\r\n- Bugfix: Die Kräutertasche sammelt jetzt tatsächlich keine Purpurnen Nirnwurze mehr ein, dafür aber wieder\r\n  normale Nirnwurze. (War in 5.2 genau falsch herum geändert, Sorry!)\r\n\r\n[b]Version 5.2 - 14.07.2012[/b]\r\n+ Stab und Zauber der Rückkehr hinzugefügt. (Mark&Recall-Funktion)\r\n+ Neuer Zauber: Pferderuf\r\n+ Neue Option, mit Pferden sprechen zu können.\r\n+ Rotwurz-, Blauwurz- und Lilawurz-Elixiere hinzugefügt.\r\n* Geangelte Fische werden nun so platziert, dass sie nicht mehr manchmal im Boden verschwinden.\r\n* Implementierung der Beutel im Rucksack geändert, sodass diese nun hoffentlich nicht mehr nach\r\n  Änderung der Ladereihenfolge bei ihrer nächsten Aktivierung in das Inventar gelegt anstatt\r\n  geöffnet zu werden.\r\n- Fehler behoben, der bei ausgerüsteter Kräutertasche während des Angelns zu endlosem Einsammeln\r\n  von Fisch führte.\r\n- Die Kräutertasche sammelt keine Purpurnen Nirnwurze mehr ein.\r\n- Der Fehler, der beim ersten Aufbauen der großen Zelte zum ungewollten Teleportieren führte, konnte\r\n  endlich gefunden und (hoffentlich) beseitigt werden. Falls doch nicht, gibt es jetzt statt des ungewollten\r\n Teleports eine Fehlermeldung. Ab dem zweiten Aufbauen sollte es dann auf jeden Fall klappen.\r\n* Hundekuchen wirkt beim Verzehr nicht länger tödlich.\r\n+ Zusätzliche Hinweismeldung beim Mahlen von Weizen\r\n+ \\\"Blur\\\"-Effekt bei starker Müdigkeit verbessert. Der Effekt blendet nun  sanft ein.\r\n* Das Stundenglas kann die Uhrzeit nun wahlweise auch alle 15 Minuten anzeigen. (Praktisch bei niedrig\r\n  eingestelltem Time Scale)\r\n- \\\"Kräutertasche des Sammlers\\\" sammelt nun überall Kräuter, nicht länger nur im Worldspace Tamriel.\r\n- Shadereffekt beim automatischen Sammeln auf dem Player wieder entfernt.\r\n+ Bugfix: Bratkartoffeln und gebratenes Fuchsfleisch können ab jetzt auch zur Zusammenstellung von\r\n  Proviantpaketen genutzt werden.\r\n+ Liste der Gegenstände, die automatisch in den \\\"Beutel für Gerümpel\\\" gelegt und im Abfallsack verbrannt\r\n  werden können  wurde erweitert.\r\n* Bugfix: Der zweite Baumstumpf und der zweite Stuhl aus Vers. 5.0.3 werden nun auch automatisch in den\r\n  \\\"Beutel für Lagerausrüstung\\\" gelegt.\r\n- Optionale Version entfallen.\r\n\r\n[b]Version 5.1 - 27.06.2012[/b]\r\n+ Brego komplett überarbeitet.\r\n+ Fuchsfleich, Gebratenes Fuchsfleisch und Fuchspfeffer samt entspr. Kochrezepte neu hinzugefügt.\r\n   Man findet das Fleisch bei erlegten Füchsen.\r\n+ Man findet kein Gold und Krimskrams mehr bei erschlagenen Tieren.\r\n- Kräutertasche des Sammelers sammelt keine Geldbeutel mehr ein.\r\n* Position des Fasses und der Kräutertasche in Flusswald leicht geändert.\r\n+ Proviantpakete können nun auch in Gasthäusern gekuaft werden.\r\n+ Ein Stundenglas und ein leeres Wasserfass können im Flusswald Handelskontor gekauft werden.\r\n+ Neues Gericht und Rezept: Bratkartoffeln\r\n* Texturen der Suppen in den Kochstellen und Bratspießen verbessert. (Nicht in der optionalen Version.)\r\n* Optionale Light-Version auf den Vers.-Stand 5.1 gebracht.\r\n\r\n[b]Version 5.0.4 - 21.06.2012[/b]\r\n- Fehler gefixt, dass beim Auto-Harvest auch Gegenstände eingesammelt wurden, die jemandem gehörten.\r\n\r\n[b]Version 5.0.3 - 21.06.2012[/b]\r\n+ Experimentell: \\\"Kräutertasche des Sammlers\\\" zum Auto-Harvest von Zutaten.\r\n  Man findet die Tasche beim Handelskontor in Flusswald außen auf einem Fass.\r\n  (Nicht in der optionalen Version enthalten)\r\n+ Ein weiterer Camping-Stuhl und ein weiterer Camping-Baumstumpf wurden hinzugefügt. Sie sind\r\n  bei und in Alfons Hütte zu finden. (Nicht in der optionalen Version enthalten)\r\n+ Globale Variable bbNZIB hinzugefügt. Default-Setting ist 1.\r\n  Wird bbNZIB auf 0 gesetzt, werden nach dem Kochen und nach der Zubereitung von Proviantpaketen die\r\n  Nahrungsmittel nicht mehr automatisch in den \\\"Beutel für Nahrungsmittel\\\" gelegt. \r\n- Doppelt im Rucksack vorhandenen \\\"Beutel für Schmuck\\\" entfernt.\r\n* Kuhfell, Hirschfell, Ziegenfell und Pferdefell werden nun auch auf Wunsch\r\n  automatisch im \\\"Beutel für Material\\\" abgelegt.\r\n\r\n[b]Version 5.0.2 - 17.06.2012[/b]\r\n- Fehler behoben, durch den Brego unsichtbar war.\r\n\r\n[b]Version 5.0.1 - 17.06.2012[/b]\r\n- Fehler behoben, der dafür sorgte, dass die Müdigkeit nicht durch Schlafen gesenkt wurde.\r\n\r\n[b]Version 5.0 - 16.06.2012[/b]\r\n* Die Version wurde mit dem CK Vers. 1.6.89.0 erstellt und mit der Spielversion 1.6.89.0.6 getestet.\r\n+ Ein Bedürfnis-System zur Simulation von Hunger, Durst und Müdigkeit wurde hinzugefügt. (siehe\r\n   bbLager_WhatsNew_5_0.txt und HDS-System_ReadMe.txt)\r\n+ Neue Wasservorratsfässer im kleinen, mittleren und Wohnzelt.\r\n* Verfahren zum Auffüllen von Wasserschläuchen und -fässern geändert und optimiert.\r\n+ Neue Getränke: Apfel-, Trauben- und Tomatensaft, Wasser(flaschen), Milch.\r\n+ Gastwirte verkaufen die neuen Getränke, Wasser und Wasserfässer\r\n+ Neue Texturen für Eintöpfe und Suppen\r\n* Gegenstände in den \\\"Beuteln\\\" des Rucksacks werden bei Aktivitäten nun tatsächlich besser berücksichtigt.\r\n  (Kochen, Entzünden von Ofen und Lagerfeuer, Gerbgestell, Werkbank und Schmiede im Werkstattzelt).\r\n* Kochstellen und Bratspieße geben nach dem Kochen ggf. leere Flaschen zurück.\r\n- Fehler bei der Ermittlung des Bestandes von Feuerholz im Inventar behoben.\r\n- Verschiedene seit Vers. 4.4 gemeldete Fehler behoben\r\n\r\n[b]Version 4.4 - 29.05.2012[/b]\r\n+ Zum Aufstellen der Zelte werden ab sofort Zeltstangen sowie Lederstreifen  benötigt. Die großen Zelte\r\n  benötigen 8 Zeltstangen und 20 Lederstreifen,  das mittlere Zelt benötigt 6 Zeltstangen und 15 Lederstreifen\r\n  und für das kleine Zelt werden 4 Zeltstangen und 8 Lederstreifen benötigt.  Beim Abbau der Zelte erhält man\r\n  regelmäßig 2 Lederstreifen weniger zurück,  als für den Aufbau benötigt wurden. Bei den großen Zelten\r\n  besteht darüber hinaus eine 50% Wahrscheinlichkeit, dass eine oder zwei Zeltstangen zerbrechen,  beim\r\n  mittleren und kleinen Zelt besteht eine 50% Wahrscheinlichkeit, dass eine Zeltstange zerbricht. \r\n+ Neues MiscObject: \\\"Zeltstangen\\\".\r\n  Zeltstangen können in Sägewerken hergestellt werden.\r\n+ Im Werkstattzelt gibt es neu einen Abfallbehälter. Dort hinein gegebene Gegenstände aller Art werden nach\r\n  Rückfrage verbrannt bzw. eingeschmolzen. Teilweise erhält man dafür Eisen-, Zwergische, Silber-, Gold-,\r\n  Malachit- oder Obsidian-Nuggets und Holzkohle. Die Nuggets können zu Erzbarren weiterverarbeitet werden. \r\n* Holzkohle ist jetzt eine Zutat.\r\n* Gewicht von Feuerholz reduziert\r\n* Hoffentlich funktionierender Workaround für gemeldete Probleme mit den  Beuteln. (Die eigentliche\r\n  Problemursache habe ich noch immer nicht verstanden bzw. finden können.)\r\n+ Neuer \\\"Beutel für Gerümpel\\\".\r\n* \\\"Beutel für Material\\\" nimmt nun auch Drachenknochen und Pelze aller Art auf.\r\n\r\nDie nachfolgend aufgeführten Änderungen sind ggf. im Spiel nur wirksam, sofern die \\\"Beutel\\\" im Rucksack nicht\r\ndeaktiviert wurden und der Spieler den Rucksack bei sich trägt.\r\n\r\n* Bei Arbeiten im Werkstattzelt werden auch die im Rucksack, im \\\"Beutel für Material\\\" und im \\\"Beutel für\r\n  Lagerausrüstung\\\" enthaltenen Materialien berücksichtigt und nach getaner Arbeit in die Beutel zurückgelegt.\r\n* Beim Anzünden des Ofens im Wohnzelt wird auch das im Rucksack oder dem \\\"Beutel für Lagerausrüstung\\\"\r\n  enthaltene Feuerholz berücksichtigt.\r\n* Beim Kochen im Wohnzelt oder der Kochstelle werden ggf. auch die Kochzutaten aus dem Rucksack dem \\\"Beutel\r\n  für Nahrungsmittel\\\" und dem  \\\"Beutel für Zutaten\\\" berücksichtigt. Die verbleibenden Zutaten werden\r\n  nach dem Kochen in die \\\"Beutel zurückgelegt gelegt.\r\n* Beim Aufstellen der Kochstelle wird die Feuerstelle automatisch auch dann platziert, wenn letztere sich im\r\n  \\\"Beutel für Lagerausrüstung\\\" befindet (und Feuerholz vorhanden ist).\r\n* Beim Aufstellen der Feuerstelle wird auch der Feuerholz-Vorrat im \\\"Beutel für Lagerausrüstung\\\" berücksichtigt.\r\n\r\n[b]Version 4.3 - 23.05.2012[/b]\r\n+ Neue \\\"Beutel\\\" zur Sortierung des Inventars im \\\"Nimmervollen Rucksack\\\" hinzugefügt.\r\n+ Wieder einen \\\"Seelenstein-Behälter\\\" im Wohnzelt hinzugefügt.\r\n+ Seelensteine werden vor der Benutzung des Verzauberungs-Platzes im Wohnzelt automatisch\r\n  aus dem Seelensteinbehälter, dem Rucksack und dem \\\"Beutel für Seelensteine\\\" in das Spieler-Inventar\r\n  übertragen.\r\n* Verzauberungsaltar im Wohnzelt benutzt auch Seelensteine aus dem Behälter, dem Rucksack und\r\n  dem \\\"Beutel für Seelensteine\\\" (wenn Rucksack im Gepäck).\r\n* Alchemie-Platz im Wohnzelt benutzt auch Zutaten aus dem Rucksack und dem \\\"Beutel für\r\n  Zutaten\\\" (wenn Rucksack im Gepäck). Am Ende der Trankherstellung werden die verbleibenden Zutaten\r\n  automatisch in den Trankmischerbeutel zurück gelegt.\r\n* Beim Mahlen von Mehl kann die Menge des zu mahlenden Weizens ausgewählt werden.\r\n* Salzadern in Interior-Zellen reduziert.\r\n* Salzadern in Exterior-Zellen erweitert.\r\n* Anzahl der Salzkristalle pro Salzader reduziert.\r\n* Gewicht, Verkaufspreis und Werte de ralchemistischen\r\n  Eigenschaften der Salzkristalle reduziert.\r\n\r\n[b]Version 4.2 - 16.05.2012[/b]\r\n+ Der Spieler kann nach Fischen angeln\r\n+ Alle Zelte (außer dem Werkstattzelt) erhielten eine Vorrichtung zur Herstellung von Proviantpaketen.\r\n+ Diverse neue Gerichte und Rezepte hinzugefügt.\r\n+ Salzkristalle als neue Zutat. An Kochtöpfen kann daraus Salz gewonnen werden.\r\n+ Mehl als neue Zutat. \r\n+ Alle im Spiel vorhandenen Mühlen wurde so modifiziert, dass dort Mehl aus Weizen gemahlen werden kann.\r\n+ Die Zubereitung aller bereits im Grundspiel vorhandenen sowie neu hinzugefügten Eintöpfe sowie die \r\n  Herstellung  von Brot erfordern, dass der Spieler mind. einen nicht leeren Wasserschlauch mit sich führt. \r\n  Anderenfalls werden die Rezepte nicht angezeigt.\r\n* Gewicht, Verkaufswert und Eigenschaften von Brot angepasst.\r\n+ Brot als herstellbares Nahrungsmittel hinzugefügt.\r\n* Hühnernester enthalten 3 Eier statt bisher einem.\r\n* Der Stuhl wird nun wieder um 180° gedreht, mit der Lehne zum Spieler aufgestellt.\r\n* Sounds beim Auf- und Abbauen der Zelte sind leiser.\r\n* Sounds beim Öffnen und Schließen der Magischen Truhen sind leiser.\r\n* Inhalt der Vorratstonne im Wohnzelt modifiziert.\r\n\r\n[b]Version 4.1 - 28.04.2012[/b]\r\n+ Die Gamesettings: fBumpReactionMinMoveDist, fBumpReactionIdleMoveDist,\r\n   fBumpReactionSmallDelayTimer und fBumpReactionSmallWaitTimer werden so modifiziert,\r\n   dass im Wege stehende NPC\\'s eher Platz machen.\r\n+ Die Außenbeleuchtung der Zelte verfügt neu über einen zusätzlichen Automatik-Modus. Die Ein- und\r\n   Ausschaltzeit der Zeltbeleuchtung kann auf Wunsch über die Globals:\r\n   bbTentNightlightStartTime und\r\n   bbTentNightLightEndTime geändert werden.\r\n+ Ein Windschutzzaun findet sich jetzt bereits in Alfons Uldingers verlassenem Lager. Die Herstellung\r\n   von Zäunen und Barrikaden ist daher schon früh im Spiel verfügbar.\r\n* Das Zelt im verlassenen Lager sieht nun so aus, wie dasjenige, welches man später selbst aufstellen kann.\r\n* Skripte zum Aufstellen von Wohn- und Werkstattzelt geändert. Vielleicht kommt es jetzt nicht mehr zu\r\n   ungewollten Zellenwechseln. (Ich kann bei mir den Fehler nicht reproduzieren.)\r\n+ Zwei weitere Schubladen unterhalb des Schränkchens im Wohnzelt hinzugefügt.\r\n* Die Holz-Texturen der drei großen Zelte sowie die N-Map der Pelz-Texturen sind Bethesdas HighRes-\r\n  Texture-Pack entnommen. (Eine höher auflösende Textur der Pelze ist leider nicht im Pack enthalten.)\r\n+ Ein weiterer, das Pferdefuhrwerk der Nordländer-Ausstattung zeigender Ladebildschirm wurde hinzugefügt.\r\n- Schlafposition auf dem Schlafsack im Wohnzelt korrigiert.\r\n- Beleuchtung im Wohnzelt geändert. Sollte jetzt nicht mehr unter bestimmten Blickwinkeln verschwinden.\r\n\r\n[b]Version 4.0 - 22.04.2012[/b]\r\n+ Beleuchtung (ein- und ausschaltbar) für alle Zelte hinzugefügt.\r\n+ Das Mittlere Zelt enthält nun eine Einrichtung.\r\n+ Das kleine Zelt enthält nun eine (Deko)Einrichtung.\r\n+ Aufstell- und herstellbare Barrikaden hinzugefügt.\r\n+ Aufstell- und herstellbare Windschutzwände hinzugefügt. Hat man mind. zwei Barrikaden und/oder \r\n  Windschutzwände aufgestellt, kann man in den offenen Betten auch dann schlafen, wenn sich Feinde\r\n  in der Nähe aufhalten.\r\n+ Herstellbare Aufstellfackeln hinzugefügt.\r\n+ Trag- und aufstellbare Laternen hinzugefügt.\r\n+ Magische Truhen in den Zelten sowie selbst am Amboss herstellbar hinzugefügt. Die Truhen sind\r\n   untereinander verlinkt und greifen alle auf den selben Inhalt zu.\r\n+ 15 Loadscreens hinzugefügt.\r\n* Bezeichnungen beim Aktivieren der Zelte und deren Türen geändert.\r\n* Soundeffekte für den Auf- und Abbau der Zelte und den Kanonenofen geändert.\r\n* Das Kochen im großen Wohnzelt ist nur noch möglich, nachdem zuvor der Ofen angefeuert wurde.\r\n  Hierzu wird 1 Stück Feuerholz benötigt. Der Ofen brennt danach, bis das Wohnzelt abgebaut wird.\r\n* Das Baden im großen Wohnzelt ist nur noch möglich, nachdem zuvor der Ofen angefeuert wurde.\r\n* Die aufstellbare Kochstelle kann nur noch verwendet werden, wenn auch das Lagerfeuer in der\r\n  unmittelbaren Nähe errichtet wurde.\r\n* Verbesserte Skripte zum Aufstellen stapelbarer Objekte.\r\n+ Beim Schlafen im Bett und dem Schlafsack im Wohnzelt sowie im Feldbett wurden kurze Animationen\r\n   hinzugefügt.\r\n  Wer das nicht möchte, öffne die Konsole und gebe dort:\r\n  \\\"set bbNoSleepAnim to 1\\\" ein.\r\n+ Schubladen unterhalb des Bettes bieten im Wohnzelt zusätzlichen Stauraum\r\n- Schlafposition auf dem Feldbett korrigiert.\r\n- Gewicht und Wert des platzierbaren Baumstumpfes korrigiert.\r\n\r\n[b]Version 3.1.2 - 11.04.2012[/b]\r\n- Der Stuhl hat beim Aufstellen nun wieder die richtige Größe\r\n\r\n[b]Version 3.1.1 - 02.04.2012[/b]\r\n* Die Modifikation wurde mit Version 1.5.24.0 des Creation Kit erstellt.\r\n* Die Platzierungs-Objekte sind nicht länger als individuelle Referenzen, sondern als normale\r\n  MiscObjekte eingebunden.  Dies sollte Probleme in Form von unerwartetem Verschwinden\r\n  der Gegenstände hoffentlich nun beheben.\r\n- Einige überflüssige Debug-Meldungen beim Aufstellen von Wohn- und Werkstattzelt werden nicht mehr\r\n  angezeigt.\r\n- Message-Box-Ausgaben werden nun sämtlich über im CK definierte Messages ausgegeben.\r\n  Einige Ausgaben erfolgten bislang noch durch Debug-Messages in den Skripten.\r\n+ Die Wirkung des \\\"Ring des Waldläufers\\\" erstreckt sich nun auch auf die aktuellen Begleiter und\r\n   das vom Spieler gerittene Pferd.\r\n* Mesh des Baumstupf-Sitzplatzes geringfügig modifiziert.\r\n* Mesh des Fuhrwerks geringfügig modifiziert.\r\n\r\n[b]Version 3.1 - 24.03.2012[/b]\r\n+ Vom Spieler steuerbares Pferdefuhrwerk hinzugefügt.\r\n+ Nahe Uldingers Hütte wurde eine Remise hinzugefügt. Dort findet man anfangs das Fuhrwerk.\r\n- Seltener Fehler der zum Verschwinden von Ausrüstungsgegenständen führen konnte hoffentlich beseitigt. \r\n  (Selbst kann ich das Problem leider nicht reproduzieren)\r\n* Debug-Skript erweitert. Es sollte nun verlorene Gegenstände zuverlässiger wiederherstellen.\r\n* Das Bett in Alfons Uldingers Hütte kann nun vom Spieler zum Schlafen verwendet werden.\r\n* Anfänglichen Fundort des Nimmervollen Rucksacks auf die rechte Seite von Alfons Zelt verlagert.\r\n  Er wird nun nicht länger von dem Felsen aus \\\"Dovahkiin Hideout\\\" verdeckt.\r\n\r\n[b]Version 3.0.2 - 14.03.2012[/b]\r\n+ Jedes der vier Zelte verfügt nun über einen eigenen Map-Marker. Auf der Karte angezeigt werden diese\r\n  jedoch nur, wenn das jeweilige Zelt außerhalb eines Mindestabstandes von einem zuvor aufgestellten\r\n  anderen Zelt aufgebaut wird.\r\n- Fehler behoben, der beim gleichzeitigen Aufstellen von Koch- und Feuerstelle zur Zerstörung des\r\n  Feuerstellen-Platzierungsobjektes führte. \r\n- Beim Verlassen des Werkstattzeltes verbleibt eine Holzfälleraxt dort nur noch automatisch, wenn\r\n  diese zuvor auch im Zelt aufgenommen wurde.\r\n+ Debug-Skript hinzugefügt, welches ggf. zur Wiederbeschaffung verlorengegangener Platzierungs-Objekte\r\n  verwendet werden kann.\r\n  Aufruf in der Konsole durch: startquest bblagerdebugquest.\r\n\r\n[b]Version 3.0.1 - 12.03.2012[/b]\r\n- Einige Rechtschreibfehler in Message Boxen und der ReadMe korrigiert\r\n- Navmesh rund um Alfons Hütte angepasst\r\n* In Bregos Textur die doch all zu helle blaue Augenfarbe reduziert\r\n\r\n[b]Version 3.0 - 12.03.2012[/b]\r\n+ Neuer Begleiter-Hund Brego, noch rudimentär.\r\n+ Ring des Waldläufers (Tiere greifen nicht an und fliehen nicht)\r\n+ Ring des nächtlichen Jägers (gibt Nachtsicht)\r\n+ Amulett \\\"Stern des Nordens\\\" (Lichtaura und Wasseratmung)\r\n+ Stundenglas (periodische Einblendung der Uhrzeit)\r\n* Alle Gegenstände der Ausrüstung befinden sich nun an ihren endgültigen Fundorten im Lager nahe\r\n  Weißlauf sowie in Alfons Uldingers Hütte südwestlich Morthals.\r\n* Beim Aufstellen der Kochstelle wird das Lagerfeuer darunter automatisch mit platziert, sofern\r\n  der Spieler sowohl die Feuerstelle als auch mindestens ein Stück Feuerholz im Inventar oder dem\r\n  Rucksack bei sich hat.\r\n* Die Lichtquellen der Lagerfackeln werfen nun keine Schatten mehr.\r\n  Hoffentlich löst dies das Problem mit der verschwindenden Beleuchtung.\r\n* Neue Screenshots und ReadMe überarbeitet.\r\n\r\n[b]Version 2.7 - 29.02.2012[/b]\r\n+ Werkstattzelt mit Schmelzofen, Schmiede, Schleifstein, Werkbank, Gerbergestell und Holzhackklotz\r\n+ Aufstellbare Lagerfackeln\r\n+ Spielbare Laute und Flöte im Wohnzelt\r\n* Die Ausgangs-Marker der geschlossenen Zelte befinden sich nun in korrekter Position vor den Türen\r\n* Die geschlossenen Zelte werden beim Aufstellen nicht länger automatisch betreten.\r\n+ Schlafen im Wohnzelt gibt nun den \\\"Gut ausgeruht\\\"-Bonus\r\n* Lichtquellen im Wohnzelt werfen nicht länger streifen- und gitterförmige Schatten\r\n* Position der Rauchfahne vom Ofen des Wohnzeltes korrigiert.\r\n* Beim Aufstellen des Lagerfeuers oder der Fackeln wird nun auch ein etwaiger Vorrat an Feuerholz im\r\n  Rucksack berücksichtigt und vorrangig verwendet.\r\n* div. kleinere Skript-Änderungen\r\n\r\n[b]Version 2.5 - 26.02.2012[/b]\r\n+ Großes, geschlossenes Wohnzelt hinzugefügt\r\n* Einer der Portalsteine befindet sich anfangs nun im Wohnzelt und nicht länger im Rucksack\r\n\r\n[b]Version 2.0 - 22.02.2012[/b]\r\n+ Rucksack (nimmerlvoller Beutel) hinzugefügt\r\n+ Kochstelle hinzugefügt\r\n+ Sitzkissen hinzugefügt\r\n+ Stuhl hinzugefügt\r\n+ Baumstamm (Sitzplatz) hinzugefügt\r\n+ Mapmarker für das Lager hinzugefügt\r\n+ Portalsteine hinzugefügt\r\n* Die Ausrüstungsgegenstände finden sich nun im Rucksack außerhalb des Spielerhauses in Weißlauf\r\n* Das Anzünden des Lagerfeuers benötigt jetzt jedesmal ein Stück \\\"Feuerholz\\\"\r\n* Verschiedene, kleinere Änderungen und Optimierungen an den Skripten\r\n- Die Ausrüstungstruhe in Weißlauf wurde entfernt (ersetzt durch den Rucksack)\r\n\r\n[b]Version 1.0 - 13.02.2012[/b]\r\nErstes Release\r\n",
  "categoryId": "78",
  "version": "5.5",
  "author": "Brausebart",
  "createdUnix": "1330259623",
  "updatedUnix": "1347495535",
  "containsAdultContent": false,
  "uploadedBy": "Brausebart",
  "primaryFile": null,
  "files": [
    {
      "fileId": "37075",
      "name": "Nordlaender-Ausstattung_V_2_5",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2277",
      "fileName": "Nordlaender-Ausstattung_V_2_5-11329.7z",
      "uploadedUnix": "1330261594",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/886c94dc791dbadafa41b5e33fd3fda68c0745f3fb9974a95d0f674060d80dc8/analysis/1406714584/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_2_5-11329.7z?fid=37075&ttl=1535772386&ri=8192&rs=8192&setec=feae35d4e25d0a54a2475c80a4d4c67b"
    },
    {
      "fileId": "38693",
      "name": "Nordlaender-Ausstattung_V_2_7",
      "version": "2.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3166",
      "fileName": "Nordlaender-Ausstattung_V_2_7-11329.7z",
      "uploadedUnix": "1330575431",
      "modVersion": "2.7",
      "virusScanUrl": "https://www.virustotal.com/file/31523497c63183baf96a4599232b6c9185dbe57b03f014a09ad80e27dc061ea7/analysis/1406722625/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_2_7-11329.7z?fid=38693&ttl=1535772387&ri=8192&rs=8192&setec=056b415cbf5dbbd252a314ddb6ab536b"
    },
    {
      "fileId": "43113",
      "name": "Nordlaender-Ausstattung_V_3_01",
      "version": "3.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9633",
      "fileName": "Nordlaender-Ausstattung_V_3_01-11329.7z",
      "uploadedUnix": "1331687360",
      "modVersion": "3.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/218a7b8407b15af61a6823e4003f99eb614cea5a78ba393fe51a5f248876ba3e/analysis/1406747725/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_3_01-11329.7z?fid=43113&ttl=1535772387&ri=8192&rs=8192&setec=9e6ec1c41688aa173613183027258b67"
    },
    {
      "fileId": "49203",
      "name": "Nordlaender-Ausstattung_V_3_11",
      "version": "3.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11754",
      "fileName": "Nordlaender-Ausstattung_V_3_11-11329.7z",
      "uploadedUnix": "1333337920",
      "modVersion": "3.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/23539303c23cb8567e664f20bd8d0cbe9e3575a471f6d0c38abbf4f9a088d8d5/analysis/1406792717/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_3_11-11329.7z?fid=49203&ttl=1535772387&ri=8192&rs=8192&setec=e7eac2bcdf286f839973bb5603c8b498"
    },
    {
      "fileId": "57141",
      "name": "Nordlaender-Ausstattung_V_4_1",
      "version": "4.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16586",
      "fileName": "Nordlaender-Ausstattung_V_4_1-11329.7z",
      "uploadedUnix": "1335658688",
      "modVersion": "4.1",
      "virusScanUrl": "https://www.virustotal.com/file/0901db506f37abef29e18ab1a49c55ce8d43509925c005a94e92bf654d6d8c91/analysis/1406852115/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_4_1-11329.7z?fid=57141&ttl=1535772388&ri=8192&rs=8192&setec=635738ab0257ce2c70f356e8cf1e782f"
    },
    {
      "fileId": "63176",
      "name": "Nordlaender-Ausstattung_V_4_3",
      "version": "4.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "21962",
      "fileName": "Nordlaender-Ausstattung_V_4_3-11329.7z",
      "uploadedUnix": "1337788721",
      "modVersion": "4.3",
      "virusScanUrl": "https://www.virustotal.com/file/07d01ad86138f26ab791bbdf998025fab24043c493563ee713d8db32fe5cf7a4/analysis/1406910871/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_4_3-11329.7z?fid=63176&ttl=1535772388&ri=8192&rs=8192&setec=c3e0c191907ece871b7353c8df1877a7"
    },
    {
      "fileId": "64411",
      "name": "Nordlaender-Ausstattung_V_4_4",
      "version": "4.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "32278",
      "fileName": "Nordlaender-Ausstattung_V_4_4-11329-4-4.7z",
      "uploadedUnix": "1338311406",
      "modVersion": "4.4",
      "virusScanUrl": "https://www.virustotal.com/file/d4242c59147fa5f1b6b5531990c058cbfccba52a4215dc05cdc4b11112e92f2f/analysis/1406923647/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_4_4-11329-4-4.7z?fid=64411&ttl=1535772389&ri=8192&rs=8192&setec=5e8ece9227d3e1d3c46eff0a299fa8b4"
    },
    {
      "fileId": "68477",
      "name": "Nordlaender-Ausstattung_V_5_01",
      "version": "5.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35864",
      "fileName": "Nordlaender-Ausstattung_V_5_0_1-11329-5-0-1.7z",
      "uploadedUnix": "1339893651",
      "modVersion": "5.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/42f437014360fa0c49192b761c079cff34ec8a19d9fc25af781f2e97b8f873f1/analysis/1406964207/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_5_0_1-11329-5-0-1.7z?fid=68477&ttl=1535772389&ri=8192&rs=8192&setec=9ab15fe663958d4b96e5b646918814f1"
    },
    {
      "fileId": "68610",
      "name": "Nordlaender-Ausstattung_V_5_02",
      "version": "5.0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35833",
      "fileName": "Nordlaender-Ausstattung_V_5_02-11329-5-0-2.7z",
      "uploadedUnix": "1339944855",
      "modVersion": "5.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/4bd253ab603c6abb7c84ebc710be49383bfe8ce88896a05a6ff1f33303543cfc/analysis/1406965175/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_5_02-11329-5-0-2.7z?fid=68610&ttl=1535772390&ri=8192&rs=8192&setec=5845c0377dd33b483473d0dafcebb1db"
    },
    {
      "fileId": "69423",
      "name": "Nordlaender-Ausstattung_V_5_0_4",
      "version": "5.0.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35902",
      "fileName": "Nordlaender-Ausstattung_V_5_0_4-11329-5-0-4.7z",
      "uploadedUnix": "1340296118",
      "modVersion": "5.0.4",
      "virusScanUrl": "https://www.virustotal.com/file/083040e623504d4c1763199bf36d5fac496687e83931c6ca28b23d97ef5e0d4f/analysis/1406973800/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_5_0_4-11329-5-0-4.7z?fid=69423&ttl=1535772390&ri=8192&rs=8192&setec=07efdb5ff6c1cc0dcf7bb13458595db5"
    },
    {
      "fileId": "70608",
      "name": "Nordlaender-Ausstattung_V_5_1",
      "version": "5.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "37785",
      "fileName": "Nordlaender-Ausstattung_V_5_1-11329-5-1.7z",
      "uploadedUnix": "1340812194",
      "modVersion": "5.1",
      "virusScanUrl": "https://www.virustotal.com/file/335637ac9d13ffd54d570d7ab5d2094ebc77d71337b63d6b0d833ff900f2d60d/analysis/1406986208/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_5_1-11329-5-1.7z?fid=70608&ttl=1535772391&ri=8192&rs=8192&setec=e2bfabed472320e5d7ea69607b53a4f9"
    },
    {
      "fileId": "74801",
      "name": "Nordlaender-Ausstattung_V_5_21",
      "version": "5.2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "38527",
      "fileName": "Nordlaender-Ausstattung_V_5_21-11329-5-2-1.7z",
      "uploadedUnix": "1342487976",
      "modVersion": "5.2.1",
      "virusScanUrl": "https://www.virustotal.com/file/6706d3aa62292671e34cc29e7bd1c07a2f42d12a06259de61ddfa21b4dd0d4f1/analysis/1407027431/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_5_21-11329-5-2-1.7z?fid=74801&ttl=1535772391&ri=8192&rs=8192&setec=95eba38388c1037ba555c2bce482563d"
    },
    {
      "fileId": "75424",
      "name": "Nordlaender-Ausstattung_V_5_22",
      "version": "5.2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "38535",
      "fileName": "Nordlaender-Ausstattung_V_5_22-11329-5-2-2.7z",
      "uploadedUnix": "1342744080",
      "modVersion": "5.2.2",
      "virusScanUrl": "https://www.virustotal.com/file/eed73f80667f3c77100660ce9825969be9cf64f94f558d17304a64a44a1b5e6c/analysis/1407034271/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_5_22-11329-5-2-2.7z?fid=75424&ttl=1535772392&ri=8192&rs=8192&setec=598619ecac1dfefdbf68f12dfc0c936c"
    },
    {
      "fileId": "75427",
      "name": "bbLagerLMBalancingPatch_1_02",
      "version": "1.0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "bbLagerLMBalancingPatch_1_02-11329-1-0-2.7z",
      "uploadedUnix": "1342746582",
      "modVersion": "1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/9111500a7250b18369dba800594a4ab1f4c880ebfeed6ea4be9ce2c4c8e2f3cb/analysis/1407034322/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/bbLagerLMBalancingPatch_1_02-11329-1-0-2.7z?fid=75427&ttl=1535772392&ri=8192&rs=8192&setec=2cf08c51787873ca82182a8a6b7b4ada"
    },
    {
      "fileId": "76467",
      "name": "Nordlaender-Ausstattung_V_5_3",
      "version": "5.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "39160",
      "fileName": "Nordlaender-Ausstattung_V_5_3-11329-5-3.7z",
      "uploadedUnix": "1343172409",
      "modVersion": "5.3",
      "virusScanUrl": "https://www.virustotal.com/file/a344a69e13bcf94edc13cfe81066b73c0464dfffd204d5076d4e4fb9cd4654eb/analysis/1407044183/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_5_3-11329-5-3.7z?fid=76467&ttl=1535772393&ri=8192&rs=8192&setec=ce72f172cccf3178dea29988bc8aea10"
    },
    {
      "fileId": "76469",
      "name": "bbLagerLMBalancingPatch_1_03",
      "version": "1.0.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "11",
      "fileName": "bbLagerLMBalancingPatch_1_03-11329-1-0-3.7z",
      "uploadedUnix": "1343172826",
      "modVersion": "1.0.3",
      "virusScanUrl": "https://www.virustotal.com/file/59d22b1e0af45b0264424907504b72491f0e43e634cd0ef768b20d30a3f24816/analysis/1407044184/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/bbLagerLMBalancingPatch_1_03-11329-1-0-3.7z?fid=76469&ttl=1535772393&ri=8192&rs=8192&setec=fc1053a6bb7ba6b0140bbef01cb61873"
    },
    {
      "fileId": "77018",
      "name": "Nordlaender-Ausstattung_V_5_31",
      "version": "5.3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "39253",
      "fileName": "Nordlaender-Ausstattung_V_5_31-11329-5-3-1.7z",
      "uploadedUnix": "1343440184",
      "modVersion": "5.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/06dec4ae17a1d78d23edceb342b03e890396e0a92abd1ab50ef684104d1449f0/analysis/1407050951/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_5_31-11329-5-3-1.7z?fid=77018&ttl=1535772394&ri=8192&rs=8192&setec=ec9d68633ad5856663582497ea045a3e"
    },
    {
      "fileId": "78977",
      "name": "Nordlaender-Ausstattung_V_5_32",
      "version": "5.3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "39253",
      "fileName": "Nordlaender-Ausstattung_V_5_32-11329-5-3-2.7z",
      "uploadedUnix": "1344180853",
      "modVersion": "5.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/bd64d5c3bed7668f84e65ecbbdefa4d239170cb42f75c243a34eb32d09fa7994/analysis/1407071660/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_5_32-11329-5-3-2.7z?fid=78977&ttl=1535772394&ri=8192&rs=8192&setec=90698aed62e6216b8e3a014641292296"
    },
    {
      "fileId": "82968",
      "name": "Nordlaender-Ausstattung_V_5_4",
      "version": "5.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40285",
      "fileName": "Nordlaender-Ausstattung_V_5_4-11329-5-4.7z",
      "uploadedUnix": "1345462865",
      "modVersion": "5.4",
      "virusScanUrl": "https://www.virustotal.com/file/6b616c6cf62eaba0fd87fa62364dcde5dd9a0631381af5a546e0194735c7e9a2/analysis/1407109638/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_5_4-11329-5-4.7z?fid=82968&ttl=1535772394&ri=8192&rs=8192&setec=698134f65249564251b2f13db73c637b"
    },
    {
      "fileId": "88115",
      "name": "Nordlaender-Ausstattung_V_5_5",
      "version": "5.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "40709",
      "fileName": "Nordlaender-Ausstattung_V_5_5-11329-5-5.7z",
      "uploadedUnix": "1347495535",
      "modVersion": "5.5",
      "virusScanUrl": "https://www.virustotal.com/file/a74f3d2813ab132ce8db5086f150a6d0ed6eae26f4ec17e1019d2c20db196b61/analysis/1407162257/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_V_5_5-11329-5-5.7z?fid=88115&ttl=1535772395&ri=8192&rs=8192&setec=48ec478a2a2cbf98e99a15d19d1bd276"
    }
  ]
}