{
  "modId": 11333.0,
  "modName": "Portable Storage - Ingredients and Soulgems",
  "summary": "A portable satchels where you can store all of your ingredients and soulgems.",
  "descriptionHtml": " [b][u]Multilingual[/u][/b]: english / deutsch           (deutsch siehe unten)\r\n \r\n[b]The successor of this mod is [url=http://www.skyrim.nexusmods.com/downloads/file.php?id=12027] Portable Storages [/url] which also includes crafting materials.[/b]\r\n\r\n[b][u]Description[/u][/b]\r\n \r\n A portable satchels where you can store all of your ingredients and soulgems. It and the stored items weigh nothing.\r\n Extension of [url=http://www.skyrim.nexusmods.com/downloads/file.php?id=11132] Portable Ingredient Storage [/url]\r\n \r\n [b][u]Details[/u][/b]\r\n \r\n At gamestart / mod install you get an satchels in your apparel inventory. It is named \\\" Central storage\\\".\r\n By clicking the item it displays a menu where you can choose to manage your ingredients or soulgems or to summon the satchel.\r\n The ingredient / soulgem menu displays how many items you have in your inventory and in your storage.\r\n You get the choice to store all into the storage or to take all from the storage.\r\n After summonig the satchel leave the inventory and you see the satchel in front of you. The satchel reacts like a normal container.\r\n You can stash it away by activating it in sneak-mode. But no need to do so. The satchel is also always in your inventory.\r\n The next time you summon the satchel it appears again in front of you.\r\n \r\n You could misuse the summoned satchel for storing other items into it. But the \\\"Store all\\\"-/\\\"Take all\\\"-functions only work on the ingredients and soulgems.\r\n \r\n [b][u]Technics[/u][/b]\r\n \r\n The script uses FORMLISTs of the ingredients and soulgems. It does not loop through the inventory. The advantage is, that it works quick.\r\n Same as in [url=http://www.skyrim.nexusmods.com/downloads/file.php?id=10009] Quick Ingredient Storing [/url]\r\n \r\n The inventory item is based on an Armor-FORM because of the equipped-/unequipped-event. The summoned satchel is an Activator for a container located in a hidden room.\r\n I had to do it in this way because I can not open the container from inside the open player inventory.\r\n \r\n Because of the restrictions of the scripting-engine you cannot loop through the inventory and get the attributes of the items. So I cannot do this:\r\n - Adding weigh depending on the stored items.\r\n  (It is only possible by checking every single item of the whole ingredient / soulgem list one by one against the inventory. That is to slow.)\r\n - To distinguish between empty and self-filled soulgems, because they both base upon the empty soulgem-FORM.\r\n - Restrict the direct container-access to ingredients and soulgems.\r\n \r\n I hope that with a future SKSE-version I can do this (similar to OBSE in Oblivion). \r\n \r\n [b][u]Install[/u][/b]\r\n \r\n With NMM or copy the content of the archive into the Skyrim/Data directory.\r\n (You can leave out the readme´s, the folder /Scripts/Source and  from /Strings/..the not installed language files.)\r\n \r\n [b][u]Uninstall[/u][/b]\r\n \r\n Manually: Delete the files.\r\n\r\n [b][u]Known issues[/u][/b]\r\n \r\n - If you have a mod that adds new ingredients or soulgems to the game these new items are not detected from the \\\"Store all\\\"-/\\\"Take all\\\"-functions. \r\n Therefor you must merge both and add the new items to the FORMLISTs. But you can store / take these items manually after opening the summoned satchel.\r\n - The inventory item uses the normally unused equip-slot 55. If another mod uses this slot (e.g. more rings or similar) the items remove each other.\r\n \r\n=== deutsch ===\r\n\r\n [b][u]Beschreibung[/u][/b]\r\n \r\n Ein transportierbarer Beutel in dem du deine Zutaten und Seelensteine verstauen kannst. Er selbst und die verstauten Gegenstände wiegen nichts.\r\n Erweiterung von [url=http://www.skyrim.nexusmods.com/downloads/file.php?id=11132] Portable Ingredient Storage [/url]\r\n\r\n [b][u]Einzelheiten[/u][/b]\r\n \r\n Bei Spielstart / nach Mod-Installation erscheint ein Beutel in deinem Bekleidungs-Inventar. Er heißt \\\"  Zentrale Lagerverwaltung\\\". \r\n Beim Anklicken erscheint ein Menü wo du zwischen verwalten der Zutaten, der Seelensteine oder dem Beschören des Beutel wählen kannst.\r\n Das Zutaten- / Seelenstein-Menü zeigt, wieviele Gegenstände du im Inventar und im Lager hast.Du hast die Wahl alle zu verstauen oder zu nehmen.\r\n Nach dem Beschwören des Beutels einfach das Inventar verlassen und du siehst den Beutel vor dir liegen. Der Beutel reagiert wie ein normaler Behälter.\r\n Du kannst ihn wieder verschwinden lassen indem du ihn im Schleich-Modus aktiviert. Musst du aber nicht. Der Beutel bleibt immer zusätzlich im Inventar.\r\n Beim nächsten Beschwören erscheint er wieder vor dir.\r\n \r\n Man kann den beschworenen Beutel auch zur Ablage anderer Gegenstände missbrauchen. Die \\\"Alles verstauen\\\"-/\\\"Alles nehmen\\\"-Funktionen arbeiten aber nur mit Zutaten und Seelensteinen.\r\n \r\n [b][u]Technik[/u][/b]\r\n \r\n Das Skript benutzt eine FORMLIST der Zutaten. Es durchläuft nicht das Inventar und ist daher sehr schnell.\r\n Genau wie in [url=http://www.skyrim.nexusmods.com/downloads/file.php?id=10009] Quick Ingredient Storing [/url]\r\n \r\n Das Inventar-Item basiert auf einer Armor-FORM wegen des An- und Ablegen-Ereignisses. Der beschworene Beutel ist ein Aktivator für einen Behälter in einem verstecktem Raum.\r\n Ich musste es so machen da ich den Behälter nicht aus dem geöffneten Spieler-Inventar öffnen konnte.\r\n \r\n Aufgrund der Beschränkungen der Skript-Engine kann man leider nicht das Inventar durchlaufen und Informationen über die Gegenstände erhalten. Daher kann ich folgendes nicht machen:\r\n - Gewicht abhängig von den verstauten Gegenständen hinzufügen.\r\n   (Ginge nur durch Prüfung jedes Gegenstands in der gesamten Zutaten- / Seelenstein-Liste einzeln gegen das Inventar. Ist viel zu langsam.)\r\n - Unterscheiden zwischen leeren und selbst gefüllten Seelenstein. Beide basieren leider auf der gleichen FORM für ungefüllte Seelensteine.\r\n - Den direkten Zugriff auf den Zentrallager-Behälter auf Zutaten und Seelenstein beschränken.\r\n \r\n [b][u]Installieren[/u][/b]\r\n \r\n Mit NMM oder den Inhalt des Archives in der Skyrim/Data-Ordner kopieren.\r\n (Du kannst dabei die readme´s, den Ordner /Scripts/Source und von /Strings/..die nicht installierten Sprachdateien auslassen.)\r\n \r\n [b][u]Deinstallieren[/u][/b]\r\n \r\n Manuell: Die Datein wieder löschen.\r\n\r\n [b][u]Bekannte Probleme[/u][/b]\r\n \r\n - Wenn ein Mod neue Zutaten oder Seelensteine ins Spiel einfügt werden diese nicht von den \\\"Alles verstauen\\\"-/\\\"Alles nehmen\\\"-Funktionen erfasst.\r\n   Dafür müsste man die Mods zu einem vereinen und dann die neuen Gegenständer den FORMLISTs hinzufügen. Aber mit dem beschorenen Beutel kannst du sie verstauen oder nehmen. \r\n - Das Inventar-Item benutzt den normalerweise ungenutzten Ausstattungs-Slot 55. Wenn ein anderes Mod auch diesen Slot benutzt (z.B. mehr Ringe oder ähnliches) wird der dort ausgerüstete Gegenstand jeweils durch\r\n   den anderen ersetzt.\r\n",
  "categoryId": "27",
  "version": "1.0",
  "author": "TomHart",
  "createdUnix": "1330264047",
  "updatedUnix": "1330264725",
  "containsAdultContent": false,
  "uploadedBy": "TomHart",
  "primaryFile": null,
  "files": [
    {
      "fileId": "37091",
      "name": "Portable Ingredient Storage",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Portable Ingredient Storage-11333-1-0.7z",
      "uploadedUnix": "1330264725",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8e3116f1a621dc6ad702a300c5efb318fddadb10a06460ac402d3285f0bcd79b/analysis/1406714607/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Portable%20Ingredient%20Storage-11333-1-0.7z?fid=37091&ttl=1535772401&ri=8192&rs=8192&setec=ccf458722c375099de82a17a6d3dac1c"
    }
  ]
}