{
  "modId": 11348.0,
  "modName": "Sneak Tree Overhaul - Anatomy and Auditory",
  "summary": "Redesign the Sneak Perk tree. Combines Sneak Multiplier to 1 Perk and allows Detection via Auditory.",
  "descriptionHtml": "This is an Overhaul of right wing of the Sneak Perk Tree. Endorse it if u like it\r\n\r\nI combined all sneak damage multiplier perks into 1 perk called Anatomy.\r\nThrough understanding the Human and Animal Body you are now able to do more precise attacks from stealth by targeting the right Body Parts.\r\nPerk steps are 1Handed (6x) -> 2Handed (4x) -> Bow (4x) -> Dagger (15x)\r\n\r\nThe Second modification is Auditory\r\nThrough Concentrating on your Hearing Senses  you are able to locate Nearby Enemies.\r\nLiving Creatures and Undead Creatures alike. Corpses wont be detected cause they are dead silent.\r\nAuditory is a lesser power and last for 60 Seconds and can be recast as much u want.\r\n\r\nInstallation:\r\nUse NMM to install or just simply move the Sonar.esp to the data folder.\r\n\r\nKnown Bugs: If u know how to solve one please help!\r\n1. I don\\'t know why but it seems that in Exterior u have make visible contact to spot a creature, but after u found it it shows behind rocks etc. Need confirmation on Interiors (dungeon etc).\r\n2. I wanted to make the Ability to be toggle on and off (like the Nighteye Spell) but didnt managed to work it out.\r\n3. The deactivates when u draw your weapon but can be recast and deactivates when u put your weapon back. I honestly don\\'t know if i should remove it or not; cause its better for immersion cause when you attack u don\\'t concentrate anymore on your hearing. On the other-hand its kind of annoying when you spot some, you want to shoot and draw your bow and the effect disappears. third: i don\\'t know how to fix this^^.\r\n\r\nQuestion:\r\nDo u like the 4 Step Anatomy Perk with the 2Hand  or do u prefer a version without 2 Hand.\r\n   \r\n\r\n",
  "categoryId": "73",
  "version": "1.0",
  "author": "Donkalleone",
  "createdUnix": "1330272887",
  "updatedUnix": "1330272968",
  "containsAdultContent": false,
  "uploadedBy": "DonKallleOne",
  "primaryFile": null,
  "files": [
    {
      "fileId": "37131",
      "name": "DKO Sneak Tree Overhaul v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "DKO Sneak Tree Overhaul v1-11348-1-0.rar",
      "uploadedUnix": "1330272968",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1ab9a237d537dfb5f1060b9765c8254d64e110773d35688f6edf3d6d8635fc98/analysis/1406714837/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DKO%20Sneak%20Tree%20Overhaul%20v1-11348-1-0.rar?fid=37131&ttl=1535772428&ri=8192&rs=8192&setec=d429872243414b85f81fa0a5d4319590"
    }
  ]
}