{
  "modId": 11365.0,
  "modName": "Bobs Mountainside Brewery",
  "summary": "Bob&#39;s Mountainside Brewery Player Home\r<br />version 0.9\r<br />\r<br />Description:\r<br />This is my first Skyrim mod.  Before downloading, please read the feature, future updates, and bug lists below.  If you discover any issues please leave a comment briefly describing the issue.\r<br />\r<br />Location:  See the screenshot of the map.  Use the ",
  "descriptionHtml": "Bob&#39;s Mountainside Brewery Player Home\r<br />version 0.91(beta)\r<br />\r<br />Description:\r<br />This is my first Skyrim mod. Before downloading, please read the feature, future updates, and bug lists below. If you discover any issues please leave a comment briefly describing the issue.\r<br />\r<br />Location: See the screenshot of the map. Use the two fast travel points on the map. They are located north of helgan, on the north side of the lake.\r<br />\r<br />Features\r<br />- Brewery doubles as a player house\r<br />- Secure place to store items, all chests inside the brewery are player owned\r<br />- Chests will not be altered in future releases, so it is safe to store items between mod updates.\r<br />- Custom mead&#33; Mountside Mead, which gives +15 to carry weight for 1 hour. This should keep you drinking&#33;\r<br />- Mountainside Mead can be made using the cooking pots(see screenshot for recipe)\r<br />- Two fast travel points on the map, player house and dock merchant\r<br />- Quick access from the main entrance to all crafting nodes, including a wood chopping block\r<br />- Quick access from the main entrance to plenty of storage in the armory\r<br />- Storage includes display cases, mannequins, weapon/shield plaques and more\r<br />- Two Khajiit guards that double as followers, one in the brewery and one at the docks\r<br />- Two Khajiit merchants, one in the brewery and one at the docks\r<br />- Bedroom has a shower with a mudcrab shower buddy\r<br />- Lots of nice scenic areas inside and out.\r<br />- Threw a few weapons and armor in the armory chests, nothing godly.\r<br />- Rooms include kitchen, armory, bedroom, crafting room, library and plenty of other places to sit down.\r<br />\r<br />Future Updates\r<br />- May add a custom mead logo to the actual mead bottle\r<br />- Kitchen and fridge will resupply automatically with minor things like mead or cooking ingredients\r<br />\r<br />Minor Bugs\r<br />- A few lighting issues, not many left\r<br />- The female Khajiit voices do not work by default as followers, so temporarily they use a non-khajiit voice until I find a fix.\r<br />- The two merchants and two guards may use the throw voice shout insults. It&#39;s a bug, so don&#39;t take it personnally when they call you a skeever&#39;s butt.\r<br />- AI navigation needs some improvements. I think I was to light on the navmesh.\r<br />- Some of the walls need a little shifting to get rid of the noticable overlap\r<br />\r<br />Bug Fixes and Revisions\r<br />0.90 Released\r<br />0.91 Fixed many lighting problems, wall alignment issues, added craftable mead recipe",
  "categoryId": "67",
  "version": "0.99",
  "author": "Bob the Burrito",
  "createdUnix": "1330280097",
  "updatedUnix": "1330310837",
  "containsAdultContent": false,
  "uploadedBy": "bobtheburrito",
  "primaryFile": null,
  "files": [
    {
      "fileId": "37377",
      "name": "BobsMountainsideBrewery",
      "version": "0.91",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "172",
      "fileName": "BobsMountainsideBrewery-11365-0-91.zip",
      "uploadedUnix": "1330310837",
      "modVersion": "0.91",
      "virusScanUrl": "https://www.virustotal.com/file/4d2ddf269b06b781590d247629c82a3588ef6b0f0570674a4c159c043882423f/analysis/1406716143/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BobsMountainsideBrewery-11365-0-91.zip?fid=37377&ttl=1535772457&ri=8192&rs=8192&setec=68bfea97183ffce7876bed26e71eb9de"
    }
  ]
}