{
  "modId": 11372.0,
  "modName": "The Power of Blood - Vampirism Overhaul",
  "summary": "A vampirism overhaul which creates strong strengths and weaknesses for vampire players.  Also adds new powers and overhauls the feeding system.  The end result should be a noticeably altered playstyle for vampires.",
  "descriptionHtml": "[color=#990000][size=4][b]Overview:[/b][/size][/color]\r\n\r\nThis mod seeks to crank up the intensity of both the strengths and weaknesses of being a vampire in Skyrim, not just by altering the values of Bethesda\\'s version, but also by overhauling the effects to be more in line with traditional vampires.  When well-fed, you will be stronger, faster, and harder to kill, while when you are starving for blood and in sunlight, you will be a pitiously weak creature (though for the sake of gameplay, sunlight is not instant death and does not even apply damage over time).  Note that the resultant balance is a bit unusual: when at your strongest, most enemies will fall easily before you, and when at your weakest, you will likely be unable to defeat the weakest of enemies.  Feeding must be done far more frequently but is no longer restricted to sleeping NPCs.\r\n\r\n[color=#990000][size=4][b]New effects of being a vampire:[/b][/size][/color]\r\n\r\n+Vampirism: Vampires receive bonuses to the following stats\r\nStronger: damage bonus\r\nFaster: movement and weapon speed bonus\r\nMore athletic: more stamina and faster stamina regen\r\nHarder to kill: more health\r\nRegenerative: fast health regen\r\nMore powerful: small bonus to magicka\r\n+Attribute bonuses are scaled to improve in tiers as you level up\r\n\r\n-Blood drain: When fully fed, you receive maximized bonuses to vampirism stats (above).  As your hunger grows, the benefits will drop drastically until you will eventually receive PENALTIES to those stats instead!   Details: Blood pool ranges from 0 to 100.  50 blood points are drained per day (without any sunlight exposure and without using any powers).  Note: At no stage will you be attacked on sight like in the Bethesda implementation.\r\nStages of vampirism:\r\n100-75 blood points: stage 1 - much stronger\r\n75-50 blood points: stage 2 - stronger\r\n25-50 blood points: stage 3 - no change\r\n0-25 blood points: stage 4 - weaker\r\n\r\n+Feeding: Feeding on sleeping NPCs is unchanged.  You can now feed on NPCs who are awake, but only if they are not alerted and only if you are not being attacked by others.  However, doing so is messy, and is likely to result in the death of the NPC.  Details: Player must be crouched in order to feed.  When target is awake: target must not be in combat, player must not be in combat, absorbs up to 100 health, replenishes 25 blood points.  When target is asleep: replenishes 50 blood points.\r\n-If you wish to avoid killing when you feed, allow at least 24 hours for the victim\\'s body to recover before feeding on a given person for a second time.  Details: Second feed on the target within 24 hours: replenished blood points reduced by 50% and target is killed (unless target is essential)\r\n\r\n-Sunlight: Sunlight is bad news!  There is still no damage over time effect, for the sake of gameplay, but sunlight will fully negate the vampirism stat bonuses to a fully fed vampire, so a vampire weakened by hunger will receive penalties to those stats.  A vampire who is dying from lack of blood (and therefore already receiving penalties to the those stats), who is in sunlight, will be EXTREMELY weak.  Details: Sunlight hours are 5am to 7pm.\r\n-As with Bethesda\\'s version, sunlight will stunt your health, magicka, and stamina regeneration.\r\n-In addition, when feeling the combined effects of sunlight and hunger, your vision will be impaired.\r\n-Sunlight will also drain your reserves of blood more quickly, causing you to feel the effects of your hunger sooner.  Details: sunlight causes a 4x rate of blood drain.\r\n\r\n-Fire damage: Fire is bad news too!  You will ALWAYS be 200% vulnerable to fire damage. Note: this may seem extreme, but given the large bonuses to health and health regen, it simply creates a challenge for a stage 1 vampire.  Also see the suggested strategies section.\r\n+Frost damage: Your cold nature makes you naturally resistant to such attacks.  Always 50% resistant to frost damage.\r\n\r\n+Unbreathing: Vampires do not need to breathe underwater.\r\n+Vampiric Acrobatics: Vampires take greatly reduced falling damage.\r\n+Vampiric Seduction: Vampires gain a 75 point bonus to speech.\r\n+Night Stalker\\'s Footsteps: Vampires are 25% harder to detect while sneaking.\r\n+Champion of the Night: Illusion spells of vampires are 25% stronger.\r\n+Resist Disease\r\n+Resist Poison\r\n\r\n[color=#990000][size=4][b]New activated abilities:[/b][/size][/color]\r\n\r\n+Vampiric Sight: A vampire can see in darkness at will.  Details: toggle-able night eye effect.  No duration.  Not usable in sunlight.\r\n\r\n+Vampiric Domination: Temporarily shatters your opponent\\'s mind by force of will.  Details: causes a single target to stop attacking you for 30 seconds.  Costs 15 blood points.  Usable at stages 1, 2, and 3.  Note: can be used to take a target out of combat in order to feed on him.\r\n\r\n+Vampiric Presence: Suppress the minds of all those around you by the power of your presence.  A weaker form of Vampiric Domination that affects all nearby opponents.  Details: causes all enemies within 30 feet to stop attacking you for 5 seconds.  Usable once per day.  Costs 15 blood points.  Usable at stages 1 and 2.  Note: can be used to feed on a group of enemies.\r\n\r\n+Vampiric Shadowform: Use your power to become invisible.  Details: Up to 3 minutes of invisibility.  Costs 15 blood points.  Usable at stages 1 and 2.\r\n\r\n+Vampiric Burst of Power: Burn through your blood reserves to gain a powerful burst of energy.  Details: Strong bonus to vampirism stats for 30 seconds.  Costs 50 blood points.  Usable at stages 1 and 2.\r\n\r\n+Vampiric Servant: Raise an undead servant to fight for you.  Details: Reanimate a dead body up to level 30 to fight for you for 60 seconds.  Costs 15 blood points.  Usable at stages 1 and 2.\r\n\r\n[color=#990000][size=4][b]Suggested strategies:[/b][/size][/color]\r\n\r\n*Use Vampiric Domination to feed on your last remaining enemy for a net gain of 10 blood points.  If other enemies are still alive, you will remain in combat and be unable to feed.\r\n*It should not be difficult to stay well-fed using Vampiric Domination, but stealthy characters may have an even easier time, by being able to sneak up and feed on enemies without need of Vampiric Domination.\r\n*Rest indoors and feed if possible, before initiating fast-travel at 7pm in order to avoid overly draining your blood reserves by traveling in sunlight.\r\n*With the bonuses to movement speed and stamina, make use of sprint to travel at high speeds.  Also consider using crouch/walk when navigating indoors.\r\n*To deal with fire wielding enemies with the 200% weakness to fire, make sure you are in stage 1 before trying to face them, then make use of your abilities like Domination, Burst of Power, and Vampiric Servant, use Presence to feed and regenerate health during combat, and don\\'t be afraid to retreat and give yourself time to regenerate if you get low on health.\r\n\r\n[color=#990000][size=4][b]Possible issues:[/b][/size][/color]\r\n\r\n*It appears to be a game engine limitation that changes to movement speed do not register until you crouch or bring out or put away your weapons.\r\n\r\n[color=#990000][size=4][b]Installation:[/b][/size][/color]\r\n\r\nInstall mod then if already a vampire, feed or wait a full day, if not yet a vampire, become one the normal way.\r\n\r\n[color=#990000][size=4][b]Wishlist:[/b][/size][/color]\r\n\r\n*Feeding animation: It would be really cool to add in an animation for feeding on wakeful NPCs, but animations are not my thing.\r\n*Jump height: I would really like to set jump height to around 350 when at stage 1, but there appears to be no way to adjust jump height on the fly (as far as I know, it can currently only be changed to a new fixed value, so it couldn\\'t be adjusted based on sunlight and stage of vampirism).  It is possible SKSE will provide this functionality, but I don\\'t know if I want to saddle on that dependency just for jump height.\r\n*Blood display: Currently blood pool is displayed from time to time in the top left.  It would be nice to display it instead as part of the UI, but I\\'m not one to do graphics.\r\n*Detect life: I wanted Vampiric Sight to include a detect life effect, but for some reason detect life is a ridiculously difficult effect to work with, so I wasn\\'t able to get it working right.",
  "categoryId": "24",
  "version": "1.0b3",
  "author": "agw00",
  "createdUnix": "1330282877",
  "updatedUnix": "1331008391",
  "containsAdultContent": false,
  "uploadedBy": "agw00",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40651",
      "name": "power_of_blood",
      "version": "1.0b3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "37",
      "fileName": "power_of_blood-11372-1-0b3.zip",
      "uploadedUnix": "1331008391",
      "modVersion": "1.0b3",
      "virusScanUrl": "https://www.virustotal.com/file/a1c4ddaee4080395194320170a976462d3ca9aee94990164b9ebf2f3cba19819/analysis/1406734203/",
      "changelogHtml": " Fixed compatibility with SkyUI <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/power_of_blood-11372-1-0b3.zip?fid=40651&ttl=1535772470&ri=8192&rs=8192&setec=5987da1defe05ac53f8c8d434222c397"
    }
  ]
}