{
  "modId": 11406.0,
  "modName": "QBSmoke - Smokey Mist",
  "summary": "Smokey Mist is a new house east of Whiterun near Shimmermist Cave. A trap door by the bed leads to and from QASmoke, but in the house you get 30 safes that have many copies of all items in the game. All crafting equipment. New plants. And much more...",
  "descriptionHtml": "Smokey Mist is your new house. It\\'s slightly east of Whiterun near Shimmermist Cave, on a small hill by the river. On one wall section you\\'ll find a grid of 30 metal plates that contain many copies of all items in the game, including items that you can\\'t normally get. These are like the \\\"Dev Chests\\\" but much better. Each container is properly named and they are divided into very logical and easy to use groups.\r\n\r\nUnder the corner of the bed there is a trapdoor to and from QASmoke. On wall shelves there are miniature working versions of every Shrine and Standing Stone. The house is very detailed. Outside you\\'ll find a sand bar fishing area and other surprises.\r\n\r\nIn addition to that you get plenty of storage containers if you want to live there, all Crafting Equipment, 17 new weapons and armor, 6 plants which you can use to make potions with unique effects, another new potion, a new scroll, and a few more new items.\r\n\r\nThe Adult Content rating is because there are 3 \\\"bad\\\" words in one of the notes and a few humorous drug references.",
  "categoryId": "89",
  "version": "1.0",
  "author": "PikNik",
  "createdUnix": "1330311662",
  "updatedUnix": "1330311862",
  "containsAdultContent": true,
  "uploadedBy": "PikaNikz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "37385",
      "name": "QBSmoke",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35",
      "fileName": "QBSmoke-11406-1-0.rar",
      "uploadedUnix": "1330311862",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d961623fb2b2928ba2f109c659673b4f4b635d837fb7ab50eae77d9bcd1f4c9b/analysis/1406716227/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/QBSmoke-11406-1-0.rar?fid=37385&ttl=1535772540&ri=8192&rs=8192&setec=6331c75a8f6822bdeac5695676f2b228"
    }
  ]
}