{
  "modId": 11414.0,
  "modName": "Disable Fast Travel Permanently - Obsolete - See inside for details",
  "summary": "That&#39;s right, no more fast travel for you&#33; (~^-^)~",
  "descriptionHtml": "[size=50][center][B][COLOR=RED]PLEASE NOTE THAT THIS MOD IS COMPLETELY AND UTTERLY OBSOLETE AND THUS HAS BEEN REMOVED. PLEASE DOWNLOAD &#34;BETTER FAST TRAVEL - CARRIAGES AND SHIPS - OVERHAULED BY DJ20 AND SP0RK&#34; WHICH ALLOWS FOR BOTH DISABLING OF FAST TRAVEL AND CUSTOMISABLE COSTS FROM WITHIN THE MOD CONFIGURATION MENU.\r<br />\r<br />DOWNLOAD LINK:\r<br />http://www.nexusmods.com/skyrim/mods/15508[/COLOR][/center][/size][/b]\r<br />\r<br />Old Description in case anyone cares:\r<br />Simply put, this disables fast travel in the land of Skyrim. Carriage services are still available and there are also versions that increase the cost by x10 and by x20 as well as versions that make all destinations cost 1,000 and 2,000 gold.\r<br />\r<br />The final option removes the carriage drivers completely, meaning you have to hoof it no matter what. The only way to magic travel with this mod is get arrested and dragged to the dungeons or to =][= REDACTED BY THE ORDO SPOILERUS =][=\r<br /> \r<br />Remember to put this very last in your load order or other mods may re-enable fast travel again&#33; As for compatibility with other mods, it will depend on your load order, as it always does. Mods that add new drivers will most likely work, though if you use a price changer see how the load order affects the prices.\r<br />\r<br />I recommend combining this mod with [url=http://skyrim.nexusmods.com/downloads/file.php?id=10579]Better Horses[/url] (I personally use Non-Essential, 130% Speed, 2,500 Gold Cost) as well as using [url=http://skyrim.nexusmods.com/downloads/file.php?id=183]Timescales modified[/url] set to 5 (i.e. Days are twice as long as Vanilla. This seems to be the lowest setting one can use without breaking several quests.) for an optimum gaming experience.\r<br />\r<br />[b][u]Known Issues:[/b][/u]\r<br />Because of the way Skyrim spawns your follower when you use a door/portal (aka Poorly) followers can sometimes disappear and don&#39;t arrive even if you wait for days. The only solution so far is to temporarily disable the mod and fast travel somewhere (generally wherever you happen to be at the time works) or take a carriage somewhere.\r<br />\r<br />In addition, any mods that add additional carriage drivers will result in incorrect carriage fees being displayed and charged if loaded after this mod. If you load this mod after mods that add additional carriages, this should work fine, though the new drivers dialogue may not reflect the price changes.\r<br />\r<br />[b][u]Changelog:[/b][/u]\r<br />v1.0: Initial Release.\r<br />v2.0: Added NMM Installer. Fixed Dialogue amounts bug. Removed need for another mod to disable fast travel messages.\r<br />v2.1: Added 1,000 gold and 2,000 gold to all destination options.\r<br />v3.0: Fixed for Skyrim 1.8\r<br />\r<br />[b][u]Installation Instructions:[/b][/u]\r<br />Click the Download Button and then pick the version you want&#33;\r<br />If you download it manually, simply extract it to the Data folder of Skyrim.\r<br />\r<br />[b][u]Credits:[/b][/u]\r<br />[b]Bethesda - [/b]For making the best open world games ever made.\r<br />[b]Mountain Dew - [/b]For being so tasty.\r<br />\r<br />[b][u]My Mods[/b][/u]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=10847]Barbarian Perk Tweak aka More Two Handed Damage[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=10905]Merchants only reply with Take a Look[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=7892]Nighteye Muted or Quieter Sound[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=11119]More Firewood per Chop[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=11414]Disable Fast Travel Permanently[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=11684]Bonus Damage Perks affect all Weapons[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=12356]Dragon Priest Masks - Better Sorting Style[/url]",
  "categoryId": "24",
  "version": "0",
  "author": "-",
  "createdUnix": "1330317976",
  "updatedUnix": "1330317976",
  "containsAdultContent": false,
  "uploadedBy": "BaconCat",
  "primaryFile": null,
  "files": []
}