{
  "modId": 11411.0,
  "modName": "Cavern Isles",
  "summary": "A somewhat unique player home built on small Islands within a flooded cavern open to the sky. Has all the bells & whistles, i.e., crafting, cooking, shrines, mannequins (5), map marker, storage, cows, chickens, and merchants - rich ones! It also has lots of ambiance, a waterfall, glowbugs, hawks, salmon, crickets chirping at night. has a day/ night",
  "descriptionHtml": " Everything a Dovakiin needs to go out and conquer the world. Except weapons. And armor. And gold. And a mount....Hmmn, Ok, Ok, its just a fancy player house.\r\n \r\n\r\nNOTICE: Due to real life constraints, I find that I just don\\'t have the time to continue to implement all the good ideas that many people have suggested for this mod, Therefor,  I have asked Georgiegril to take over the moderation of Cavern Isle for me, and she has graciously agreed to do so.\r\n\r\nUPDATE: Georgiegril has now posted her new version of this mod, please go visit it at:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=17176\r\n\r\nIf you like it, please endorse her for all her hard work! Any friendly suggestions for future changes should be asked on her page now, as well.\r\n\r\nI will leave this mod up for anyone who likes this mod in it\\'s original state, but Georgiegril\\'s mod is the only version that will keep getting updates/ improvements.\r\n\r\n \r\n Thank all of you who enjoyed this mod, and gave such good ideas for it, it was a lot of fun to create. I hope the new moderator of this mod will enjoy working on it as much as I have.\r\n\r\n\r\n\r\n\r\n\r\n      Anyway, this is my take on what the Dovakinn\\'s home should be like. This does not replace any other abode. I never liked the camera restrictions you get in homes because of the low ceiling, so, I made mine in an open cavern, something like the crater of an extinct volcano. It is stretched over a series of small islands in a lake surrounded by steep walls. Being open to the sky, it is illuminated by the sun (a little too bright at noon in my opinion) and the light waxes and wanes as the day progresses, just like it does when you are outdoors. The home has all the crafting stations (including a smelter), lots of decorations, shrines to all the divines, 5 mannequins, a cooking area, sleeping areas, and 2 merchants at a small campsite in the back. Since I hate poor merchants, they both have in excess of 50,000 coins, so hopefully you won\\'t even have to leave your house to sell all your loot!\r\nIt is located slightly south of Whiterun, just behind the Pelagia farm. It does have a Navmesh, so NPC\\'s can move around in it. \r\n\r\n\r\n \r\n",
  "categoryId": "67",
  "version": "2.1",
  "author": "DarkFrost5",
  "createdUnix": "1330314857",
  "updatedUnix": "1335832354",
  "containsAdultContent": false,
  "uploadedBy": "darkfrost5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39654",
      "name": "Cavern Isles 106",
      "version": "Ver1.06",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "49",
      "fileName": "Cavern Isles 106-11411.zip",
      "uploadedUnix": "1330801513",
      "modVersion": "Ver1.06",
      "virusScanUrl": "https://www.virustotal.com/file/66489487209a5d79b3453e7e217893fb196100e368945169f7e54c6496388122/analysis/1406727664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cavern%20Isles%20106-11411.zip?fid=39654&ttl=1535772553&ri=8192&rs=8192&setec=58f2a1a43b85c207371e5d57c284169f"
    },
    {
      "fileId": "57704",
      "name": "Cavern Isles",
      "version": "Ver2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "34",
      "fileName": "Cavern Isles-11411.zip",
      "uploadedUnix": "1335832354",
      "modVersion": "Ver2.1",
      "virusScanUrl": "https://www.virustotal.com/file/3b74b29f2ce4f2913549cf6c9e7958ae93513280bb67154f83575c07aaea7f5a/analysis/1406857744/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cavern%20Isles-11411.zip?fid=57704&ttl=1535772553&ri=8192&rs=8192&setec=bbabeda75bbc740e6be1a0e64bdf6972"
    }
  ]
}