{
  "modId": 11450.0,
  "modName": "Enhanced Skyrim Followers - Aela the Huntress",
  "summary": "ESF: Aela is a project to turn Aela the Huntress into a Bioware-style companion with conversations and commentary on the game&#39;s quests and locations, as well as expanded friendship and romance options. Currently includes over 1,000 lines of new dialogue, plus unique follower features such as beast form.",
  "descriptionHtml": "[img]http://static-5.nexusmods.com/15/mods/110/images/11450-1-1365778540.png[/img]\r<br />\r<br />[color=#e6790f][size=5]Enhanced Skyrim Followers[/size][/color]\r<br />[color=#74b464][size=6]Aela the Huntress[/size][/color]\r<br />\r<br />By DreamKing\r<br />Version: 0.4.7, 8 June 2013\r<br />\r<br />[size=4][color=#74b464]Upgrade Information for 0.4.7[/color][/size]\r<br />\r<br />To upgrade from 0.4.3 and above, just overwrite the ESFAela.esp and ESFAela.bsa -- existing saves should work fine. For older versions, consult the readme. [u]Note that Skyrim 1.9 is required.[/u]\r<br />\r<br />\r<br />[size=4][color=#74b464]Introduction[/color][/size]\r<br />\r<br />The character of Aela the Huntress impressed me from the first encounter with the degree that she felt like her own person, living her own story. Aela had her own opinions, her own expertise, her own family history, her own plans and goals. She wasn&#39;t just waiting around to assist my character--if anything, my PC had to prove himself worthy of assisting her. It made for a refreshing change in a game that&#39;s otherwise so focused on how special the PC is. I was quite disappointed, then, that after Aela became available as a follower, most of her personality and individuality vanished. This woman whose years of hunting and questing had given her extensive knowledge of Skyrim, who had a vested interest in its fate, was unaccountably silent as I went about shaping her land&#39;s future. [b]Enhanced Skyrim Followers: Aela the Huntress[/b] aims to correct that discontinuity.\r<br />\r<br />[b]ESF: Aela[/b] is a project to add story content and new follower features to Aela the Huntress, of the Companions. In the current version of the mod, most of the core new follower functionality is complete, however writing is still underway for the story content. I&#39;m releasing this version for testing purposes, and because I think players will find it fun and useful, as it is one of the most advanced follower mods I know of for Skyrim. See the screenshots for a quick tour, or read the sections below for a more detailed list of improvements made.\r<br />\r<br />\r<br />[size=4][color=#74b464]Getting It Working[/color][/size]\r<br />\r<br />You must be using Skyrim version 1.9 or above to use this mod. The official DLCs are supported but not required.\r<br />\r<br />This mod has several conversations presented without voices, so you will need to have both dialogue and general subtitles turned on.\r<br />\r<br />[color=#e6790f]Installation[/color]\r<br />\r<br />You can start a new game with this mod installed, but it will change very little until after the end of the Companions questline--the only change is that during the questline Aela should be a slightly better fighter.\r<br />\r<br />When installing this mod into an existing save game, you must meet the following conditions:\r<br />\r<br />1) Aela is not currently following you--you should dismiss her prior to installing [b]ESF:Aela[/b].\r<br />2) Aela is not your spouse, and you are not &#34;engaged&#34; to her.\r<br />3) Aela is not a Blade.\r<br />4) Aela is not a steward (if using the Hearthfire DLC).\r<br />\r<br />It has been reported that installation works more reliably when done into a &#34;full&#34; save rather than an autosave or a quicksave.\r<br />\r<br />This mod is packaged in an archive compatible with Wrye Bash&#39;s BAIN installation method and with the Nexus Mod Manager. To install manually, extract ESFAela.esp and ESFAela.bsa from the archive with [url=http://www.7-zip.org]7zip[/url] or a compatible program and place them into your game&#39;s Data directory. For most users this will be something like C:Program Files (x86)SteamsteamappscommonskyrimData (although if it is, you may want to read up on moving Steam out of the Program Files directory to avoid permissions problems).\r<br />\r<br />Use a load order management tool (Skyrim&#39;s launcher, Wrye Bash, Nexus Mod Manager) to ensure this mod loads after any other mods that impact either followers in general or Aela in specific. See the section on &#34;Compatibility&#34; below. I recommend using [url=http://code.google.com/p/better-oblivion-sorting-software]BOSS[/url] to automatically sort your load order in a way that resolves common problems.\r<br />\r<br />This version of the mod was cleaned with the version of TES5Edit current at time of release, 3.0.30.\r<br />\r<br />You should keep at least one save game from before you installed this mod, that you can revert back to in case of any problems.\r<br />\r<br />[color=#e6790f]Compatibility[/color]\r<br />\r<br />[list]\r<br />[*]This is compatible with all official DLC released to-date. There are some areas in both Dawnguard and Dragonborn where Aela will not follow you, as per Bethesda&#39;s intentions; she will catch up with you after you exit those areas.\r<br />[*]Mods that alter all Nords, all female bodies, all faces, and so forth, should be compatible. Mods that alter Aela specifically--that remove her warpaint or otherwise change her face, or that give her new perks--will conflict.\r<br />[*]Mods that alter all followers (UFO, AFT, EFF, Convenient Horses, etc.) should be compatible; however, any improvements they try to make will probably not impact Aela. Position ESFAela.esp lower in your load order than any of these mods.\r<br />[*]Mods that alter werewolves are generally compatible. Moonlight Tales forces its own transformation system onto Aela, breaking ESF: Aela&#39;s &#34;transform when I do&#34; feature; I&#39;m looking into improving compatibility for 0.4.8.\r<br />[*]Deadly Combat currently causes some problems because it constantly increases the PC&#39;s &#34;Spells Learned&#34; statistic, which is looked upon unfavorably by Aela&#39;s respect system. A workaround for Deadly Combat&#39;s behavior will be in 0.4.8.\r<br />[*]The &#34;Kingthings Petrock font&#34; mod by DarthBehemoth does not work properly, causing some dialogue items to not be available. Using Kingthings Petrock in combination with the EZ2C dialogue mod appears to fix this. Other font mods appear to work without needing EZ2C.\r<br />[/list]\r<br />\r<br />\r<br />[color=#e6790f]Other Recommended Mods[/color]\r<br />\r<br />[b][url=http://skyrim.nexusmods.com/mods/22650]Enhanced Skyrim Factions: The Companions[/url][/b]\r<br />My &#34;companion&#34; mod to this one, improves the experience of the vanilla Companions questline by introducing requirements to complete more radiant quests, have appropriate combat skills, etc. Also restores some cut content for Aela and makes various other improvements.\r<br />\r<br />[b][url=http://skyrim.nexusmods.com/mods/18466]EZ2C Dialogue Menu by steve40 and Deathless Aphrodite[/url][/b]\r<br />Spend enough time with Aela and her dialogue choices will all become the hard-to-read gray of &#34;already clicked.&#34; This mod can make the dialogue choices you&#39;ve already selected more legible.\r<br />\r<br />\r<br />[color=#e6790f]Uninstallation[/color]\r<br />\r<br />Depending on where you are in the game, it may or may not be possible to fully uninstall this mod. Bethesda&#39;s official stance is that uninstalling mods is not possible with Skyrim. I have nevertheless tried to provide a procedure, but I can make no guarantees, and can offer no support if the uninstallation procedure below does not work for you.\r<br />\r<br />To uninstall, take anything you want to keep from Aela&#39;s treasure sack and outfit storage, then dismiss Aela back to Jorrvaskr, wait a few seconds, then open the console (usually the &#34;`&#34; key) and enter:\r<br />\r<br />startquest ESFAelaUninstall\r<br />\r<br />A box should appear telling you that all quests added by this mod have been stopped. Wait a few seconds, make a save, and exit the game. \r<br />\r<br />You can then use your mod manager to uninstall the mod, or manually uninstall by removing ESFAela.esp and ESFAela.bsa from your skyrimData directory. It is best to remove these files, or copy them to a directory outside your Data directory, rather than simply deactivating or unchecking the mod; scripts and variables from this mod will remain in your saved games as long as its files are in your Data directory.\r<br />\r<br />If after following these steps Aela or another potential follower complain that you already have someone following you, you probably installed this mod while Aela was already following you. To free up space for a new follower, use this console command:\r<br />\r<br />set playerfollowercount 0\r<br />\r<br />\r<br />[size=4][color=#74b464]Features[/color][/size]\r<br />\r<br />[color=#e6790f]Basic Changes[/color]\r<br />\r<br />[list]\r<br />[*]Aela has been removed from the default follower system--other followers will join while she is following, and she will join even if others are already following. (Note that this means she will no longer be available as a Hearthfire steward--really, that job doesn&#39;t fit her character at all.)\r<br />[*]She has also been removed as a potential marriage partner (for now; future versions of the mod will include expanded romance/marriage options).\r<br />[*]The constantly re-appearing Hunting Bow and endless supply of arrows associated with the vanilla followers are now gone.\r<br />[*]She now has both an equippable, &#34;at-hand&#34; inventory, and a &#34;treasure sack,&#34; the contents of which she will never equip. The capacity of the treasure sack is adjustable via a SkyUI MCM.\r<br />[*]Her stats--health and skills--will now level correctly with the player, up to a maximum level of 9999.\r<br />[*]She has a realistic set of mid-level perks in the light armor, archery, and stealth trees--including lightfoot so she will not set off traps.\r<br />[*]She has a custom class, to avoid snafus with mods like the Unofficial Skyrim Patch that make changes to her class skills.\r<br />[*]She should no longer turn hostile from actions you take while in werewolf form.\r<br />[*]She has a Serana/Dawnguard-like &#34;wander&#34; mode when the player stops moving, but only in cities when the player isn&#39;t sneaking and doesn&#39;t have a weapon drawn. This can also be toggled off.\r<br />[*]She will now sit when the player sits. (She&#39;ll pick the closest chair or bench to where she is standing when the player sits.)\r<br />[*]She has a &#34;warp&#34; function that increases her speed to 2.5x normal if she falls far behind you, and a teleport function that will move her to you if she really gets lost.\r<br />[/list]\r<br />\r<br />\r<br />[color=#e6790f]Respect[/color]\r<br />\r<br />Before Aela will agree to certain requests, you&#39;ll need to earn her respect. Respect is earned through combat victories, exploring Skyrim, and completing quests while Aela is with you to witness them--victories won while she is dismissed, or waiting, do not count. And on the other hand, you may lose respect if you show too much of an inclination to learn spells or commit crimes while Aela is present; or if you ask her to wait for you and then take too long to return to her. As well, certain dialogue choices will also increase or decrease her respect for you.\r<br />\r<br />\r<br />[color=#e6790f]Enhanced Dialogue[/color]\r<br />\r<br />ESF: Aela adds over 1,000 lines of new dialogue as of version 0.4.7. The additions include:\r<br />\r<br />[list]\r<br />[*]New, context-sensitive greetings and farewells (voiced).\r<br />[*]You can now ask Aela about a variety of subjects (mix of voiced and unvoiced). However, she&#39;s not one for casual chit-chat or frequent deep personal conversations--after a few queries, she&#39;ll get tired of answering your questions. You can ask more in 24 hours; gaining her respect will increase the number of topics you can ask about per day.\r<br />[*]New location-based commentary for many game locations and situations (mostly unvoiced).[*]Several extensive branching conversations to enhance game quests and situations, often with options linked to PC gender, race, faction membership, etc. (mostly unvoiced).\r<br />[/list]\r<br />\r<br />If Aela initiates conversation with you, it means she wants to talk about current or recent events. Please don&#39;t tab out of these conversations (unless threatened by combat or such); none are especially long, and all will end on their own. If you do need to tab out of a conversation, it would be best to wait 3 hours before letting Aela re-initiate the conversation (which she should do); that will allow all dialogue choices to reset.\r<br />\r<br />This aspect of the mod is still very much in-development: what is there now is just a small part of what is to come. Try the &#34;Ill Met by Moonlight&#34; quest in Falkreath with Aela following, or &#34;No One Escapes Cidhna Mine&#34; in Markarth, for examples of what I&#39;m trying to accomplish.\r<br />\r<br />You will need dialogue subtitles turned on (in Settings &gt; Display) to see the unvoiced dialogue. (&#34;Unvoiced&#34; means silent: I&#39;m using existing voice assets where I can, but there are things I want her to say that there are not assets for. So, you will need to use your imagination, for now. Plans are underway to have the additions voiced, but with this much added content this will take months.)\r<br />\r<br />\r<br />[color=#e6790f]Enhanced Tactical Choices[/color]\r<br />\r<br />[list]\r<br />[*]Ask her to use ranged weapons only, melee weapons only, choose between the two on her own (the default), or switch based on the player&#39;s weapon.\r<br />[*]Have her attack at will (default), only after she or the player has been attacked (good for sneaking), or never attack.\r<br />[*]Set her follow distance to close (default), medium, or far.\r<br />[*]Control whether she dismounts to fight, or ignores combat when mounted.\r<br />[*]Toggle her as essential (unkillable). Although note that some quests override this; in practice, depending on where you are in the game, it may not be possible to make her not essential. If she is made not essential, she should now use health potions in her inventory.\r<br />[*]She can light torches automatically when it gets dark (default), automatically but never when sneaking, only when the player lights one, or only when the player asks that one be lit.\r<br />[/list]\r<br />\r<br />\r<br />[color=#e6790f]Beast Form[/color]\r<br />\r<br />[list]\r<br />[*]By default, Aela will now use her beast form when the player uses their&#39;s, if the player is a werewolf. Once the player earns enough respect, they can ask her not to do this.\r<br />[*]The player can also ask Aela to shift to beast form at any time independently of their own transformation, using the Ask of Aela lesser power. (The choice is in the Combat Style menu, although you can also ask her to transform for roleplaying reasons other than combat.) She will only be willing to shift if you are away from civilization. She will stay in beast form for one hour of game time.\r<br />[*]In &#34;dungeon&#34; locations (ruins, caves, etc.) she may transform on her own, if her health is low. Again, once you&#39;ve earned anough respect, you can ask her not to do this.\r<br />[*]While transformed she will regenerate health. The default is 2 health/second; this can be adjusted (or turned off) via the SkyUI MCM.\r<br />[*]Like the player, Aela can only transform once per 24 hours, unless the player can find a way to alter this limit.\r<br />[*]Fast travel, most conversation options, and most Ask of Aela commands are disabled while Aela is in beast form (you can still ask her to wait).\r<br />[/list]\r<br />\r<br />\r<br />[color=#e6790f]Outfits & Equipment[/color]\r<br />\r<br />[list]\r<br />[*]Aela now has three separate unlockable, configurable outfits--Combat, Travel & Exploration, and Town. As you earn more of her respect, you will gain the ability to set the contents of each of these in turn, through the &#34;traveling together&#34; dialogue topic. You can also have her change into the appropriate outfit automatically, or only at your command. (See the videos tab for a demonstration.) And you can always continue to put armor in her inventory, which will override the outfits if the gear in her inventory is better than the gear in the outfits.\r<br />[*]You do not need to set all three outfits. You could have just Combat and Town outfits, for instance, and she will use the Combat outfit while exploring.\r<br />[*]Do not put armor you have enchanted or improved through smithing into her outfit slots--it may revert to its default, unimproved form. You can use improved armor and weapons in her normal, at-hand inventory without problems.\r<br />[*]As a matter of personal preference, she will not be willing to use Elven equipment--think about the history of the Companions, never mind recent history in Tamriel--and will also reject any heavy armor or two-handed melee weapons you try to give her as not fitting her talents.\r<br />[*]To go along with this, her default combat outfit is now a version of the Ancient Nord Armor that is light armor, rather than heavy. Because really, does it look like heavy armor?\r<br />[/list]\r<br />\r<br />\r<br />[color=#e6790f]Teleportation and Map Marker[/color]\r<br />\r<br />By default, Aela will seamlessly teleport to you if she gets stuck too far behind while following you. You can turn this off in the &#34;traveling together &gt; follow distance&#34; dialogue menu, and it may be advisable to do so before some quests.\r<br />\r<br />If Aela gets lost while this is turned off, or if you need her at some point when she is not following you, you can use The Ring of the Blood Call (which will be in her inventory if she did not give it to you) to teleport her to you--at the cost of 20 Health. If the player is a werewolf, you can also use the Ring to teleport yourself to Aela. This is meant to be used mainly when one of you is lost or stuck; using the Ring as a solution to puzzles may break quests and is not recommended.\r<br />\r<br />If you take off the Ring without teleporting to/from Aela, the awareness of her location granted to you by the Ring will linger for 30 seconds. During that time, you can go the Miscellaneous section of the Quest Journal, select the entry that the Ring has added, and then use the &#34;M&#34; key to see Aela&#39;s current location on the map.\r<br />\r<br />\r<br />[color=#e6790f]Mounts and Riding[/color]\r<br />\r<br />Aela can now ride horses and other mod-added mounts.\r<br />\r<br />[list]\r<br />[*]You will first need to aquire a mount that you will give to Aela. The easiest way is to buy a horse for yourself; you can also use a mod like Horse Branding, Horses for Followers, Like a Boss, etc. Basically you need a mountable animal owned by either the player, the CurrentFollowerFaction, the PlayerFollowerFaction, or nobody.\r<br />[*]The player now has a power called &#34;Give Mount to Aela.&#34; Equip that power, target the mount in your crosshair, and cast the power as if it were a spell.\r<br />[*]That mount will now be Aela&#39;s, and you will need to find another for yourself (buy one from a different city, or use the Horse Branding mod).\r<br />[*]Aela&#39;s mount will usually be found right next to yours when she is following you. Whenever you mount, the mount you have given Aela will appear next to her if it is not already close by, and once you start moving she will mount and follow you. When you dismount, she will dismount as well. You do not need to worry about losing her mount: just pretend it is always right beside your own mount, blocked from view.\r<br />[*]Aela can only have one mount. If you try to give her a second mount, the first will revert in ownership back to you. You can also cast the power on a mount that you have given Aela to revert its ownership back to you, or your other followers.\r<br />[*]Note that many game systems are disabled while riding. Most notably, you cannot fast travel while Aela is riding with you. Also you will not be able to use the &#34;Ask of Aela&#34; power to issue commands, nor will she change outfits while riding.\r<br />[*]Like all followers, Aela cannot fight while riding.\r<br />[/list]\r<br />\r<br />[color=#e6790f]Sleeping & Healing[/color]\r<br />\r<br />[list]\r<br />[*]Aela has a simple portable bedroll. If you are in an appropriate location, you can use the &#34;discuss this place&#34; dialogue topic to tell Aela that she should get some sleep here. She&#39;ll then unroll her bedroll directly behind where she is standing (if it is raining or snowing, she&#39;ll also pitch a tent) and go to sleep. She&#39;ll sleep until you click her to wake her up, or 8 hours pass, whichever comes first. &#34;Appropriate locations&#34; are typically either unowned locations--outdoors away from cities, or in dungeons--or inside a house owned by the player. Note that the ground needs to be very flat for this to work well.\r<br />[*]Also, if Aela is within a few steps of an unowned bed or bedroll--including spare bedrolls from the Frostfall mod--an option will appear in her &#34;discuss this place&#34; dialogue where you can ask her to sleep there. She will move to it and sleep for 8 hours, or until the player wakes her by clicking her.\r<br />[*]When using either of these functions, if Aela is not essential, she will heal while she sleeps. She&#39;ll heal 1/8 of her total health for each hour she rests.\r<br />[*]There is also a choice in her combat tactics dialogue that controls whether she will drink potions to heal after, or outside of, combat, when not set as essential. You can also give her healing potions to drink by asking her status, when her health is under 100%.\r<br />[*]If you&#39;re looking for a place to make camp, Aela--having grown up hunting across Skyrim--knows of several, although by no means all of them. If you&#39;re reasonably close to a good campsite she knows of, she&#39;ll speak up about it between the hours of 8pm and 2:30am (this notification can be turned off in her traveling dialogue), and an option for Aela to lead you there will appear in the &#34;discuss this place&#34; dialogue. (If anyone can suggest some other nice places to make camp, feel free to send them to me for inclusion in the mod.)\r<br />[/list]\r<br />\r<br />[color=#e6790f]Wait Here/Relax Here/Meet Me Elsewhere[/color]\r<br />\r<br />[list]\r<br />[*]In addition to the vanilla &#34;wait here&#34; option, there is now also a &#34;relax here&#34; option, which will put Aela in a &#34;sandbox mode&#34; where she will sit, eat, move around, and otherwise interact with her immediate environment.\r<br />[*]She will stop waiting for you and return to her usual schedule after only 1 day (24 hours) when using these options. Other followers wait 3 days; Aela isn&#39;t that patient.\r<br />[*]In addition to resuming her default duties back at Jorrvaskr, you can now ask Aela to meet you at any of the default player houses you own (you must have the key to the home in your inventory), or any of the Inns in habitations that you have visited. She will stay there for 7 days before getting tired of waiting around, and resuming her normal Companion activities.\r<br />[*]The player homes from the Hearthfire and Dragonborn DLCs will work; however, you will need to save and reload for her to be aware of a house after you&#39;ve come into ownership of it.\r<br />[*]There is a facility to add up to three houses from other mods to the list of houses you own, that you can meet Aela at. For this to work, a house mod must follow the vanilla system where 1) the house has its cell set to be owned by the player and 2) that cell must be defined as a Location with the keyword LocTypePlayerHouse. While in such a house, you will see an option to tell Aela about it in the &#34;about this place&#34; dialogue.\r<br />[/list]\r<br />\r<br />[color=#e6790f]Quick Command Menu[/color]\r<br />\r<br />When Aela follows you for the first time, you will gain a new Lesser Power named &#34;Ask of Aela.&#34; You can add this to your Favorites list and press &#34;Z&#34; to activate it when it is equipped. The exact commands available will depend on how close you are standing to Aela, the tactics you have set, and whether you are in combat. See the screenshots or read the full readme for details.\r<br />\r<br />[color=#e6790f]Support for Uncapped Skills[/color]\r<br />\r<br />Per game default Aela&#39;s skills will stop increasing when they reach 100, and her health and stamina will not improve past their level 81 values. If you would like skills and attributes to continue increasing (often in conjunction with a player skill uncapper such as Elys&#39;s Skyrim Community Uncapper), you can use the SkyUI MCM, or, open the console and enter the following line:\r<br />\r<br />SetPQV ESFAelaCoreDialogue bUncapSkills True\r<br />\r<br />Changes will show up the next time her skills recalculate, if any should be higher than 100. The easiest way to see this is to simply wait 24 hours.\r<br />\r<br />To undo uncapped skills, open the console and enter\r<br />\r<br />SetPQV ESFAelaCoreDialogue bUncapSkills False\r<br />\r<br />And again, wait 24 hours.\r<br />\r<br />Note that Aela&#39;s level does not actually rise above 81. What I&#39;m doing is calculating what her skills and attributes would be, if she was matching the player&#39;s level with uncapped skills and attributes.\r<br />\r<br />\r<br />[size=4][color=#74b464]Known Issues[/color][/size]\r<br />\r<br />[list]\r<br />[*]Occassionally Aela will appear without armor after installing this mod. If this happens, 1) make sure you are installing the mod into a proper save game, rather than an autosave or quicksave; 2) try loading into a save made where Aela is already within view; and 3) if that does not work, open the console while Aela is on-screen with the ` key, click her, type &#34;tai&#34; (without quotes; this stands for &#34;toggle AI&#34;), close the console, wait a few seconds, open it again, enter &#34;tai&#34; again, and close the console again. If this does not work, I can&#39;t help, sorry; try a clean install with no other mods to determine if you have a load order conflict.\r<br />[*]Do not put more than one type of any item into an outfit, or more than 10 items into any outfit. And do not have armor in *both* her at-hand inventory and her outfits, as due to some engine oddities this can result in the armor in her inventory disappearing.\r<br />[*]When set to match the player&#39;s combat style, because of an engine bug/limitation, she will not switch when the player equips a different weapon type via a hotkey. You must select your weapon from the favorites list or the main inventory screen for her to know that you have equipped a new weapon.\r<br />[*]When using the carriage system, Aela won&#39;t arrive at your destination with you--you&#39;ll have to wait a few seconds for her to catch up.\r<br />[*]If you try to give Aela armor she won&#39;t wear (Elven or heavy) multiple times, her body may disappear until you close the Inventory screen.\r<br />[*]For some reason the game considers standing and stirring a pot to be sitting, so if the player sits and a cookpot is closer to Aela than any chair, she may start stirring it. The main room in Breezehome is one place this can easily happen.\r<br />[*]Aela still uses her human voice while in werewolf form. Since Sinding does this as well, this seems to be &#34;normal,&#34; if odd.\r<br />[*]In werewolf form, Aela may flee from high-level opponents such as giants.\r<br />[*]Occassionally if you command Aela to put out a torch, the torch will disappear but her arm will remain outstretched as though holding it. Drawing and then sheathing your weapon will fix this.\r<br />[*]When using the Frostfall mod to chop firewood from nearby trees, Aela will occassionally become stuck. This can be resolved by asking her to wait, then asking her to follow again. Also when using Frostfall, if she is sleeping on a Frostfall-added bedroll, always wake her up before packing your tent&#33;\r<br />[*]Aela won&#39;t immediately recogize homes and inns added by the Hearthfire and Dragonborn DLCs; to conserve performance, the code with those checks is run infrequently. You can make a save after you&#39;ve built/acquired/discovered the place and then load that save to force an update of her awareness.\r<br />[*]The &#34;Totems of Hircine&#34; quests require some care: 1) do not dismiss Aela while one of these quests is active, 2) you must initiate dialogue with Aela after recovering each totem for the quest to advance, and 3) after placing each totem in the Underforge, wait 20 seconds before speaking to Aela or leaving the Underforge.\r<br />[/list]\r<br />\r<br />\r<br />[size=4][color=#74b464]Contact[/color][/size]\r<br />\r<br />If you have problems, suggestions, or questions about the mod, the best way to get in touch is via the thread for the mod in the [url=http://forums.bethsoft.com/forum/183-skyrim-mods]Skyrim Mods area on the Bethesda Forum[/url]. One of the reasons that I&#39;m releasing this testing version is to see if there are any problems; I&#39;d like to hear from you. As of this writing, the current Forum thread for the mod is [url=http://forums.bethsoft.com/topic/1336512-wipwipz-enhanced-skyrim-followers-aela-the-huntress-of-the-companions]here[/url].\r<br />\r<br />You can also send me private messages as [b]DreamKing[/b] (preferred) on the [url=http://forums.bethsoft.com]Bethesda Forum[/url], or on the [url=http://forums.nexusmods.com]Nexus Forums[/url] as [b]DreamKingMods[/b].\r<br />\r<br />\r<br />[size=4][color=#74b464]Disclaimer[/color][/size]\r<br />\r<br />Use of this mod may lead to broken quests, corrupt or bloated save games, and other issues. Make sure you keep a save game from before you installed this mod, than you can revert to in case of any problems.\r<br />\r<br />\r<br />[size=4][color=#74b464]Legal, Distribution, and Use of Assets[/color][/size]\r<br />\r<br />In part or in whole, you may not upload, re-host, or otherwise make this mod or an edited version you derive from it available at any other location under any circumstances, except as specified here.\r<br />\r<br />This version (0.4.7) of the mod is authorized for release on the Skyrim Nexus (http://skyrim.nexusmods.com/) only. If you downloaded it from an unauthorized location, be advised that there may be newer versions of the mod available with important fixes and additions posted on authorized sites.\r<br />\r<br />I&#39;ll be making the source of the scripts used by this mod available as a separate download; feel free to use these scripts as a base for creating follower mods for NPCs other than Aela, which you may release as you wish. I apologize for the sloppiness of the scripts and their lack of generality: I was learning as I went. You may release scripts that you derive from my work, provided that you properly credit me and remove all references in the scripts to ESFAela. I welcome suggestions for improvement of the scripts.\r<br />\r<br />If I do not respond to attempts to contact me via the methods listed in the &#34;Contact&#34; section of the latest release of this mod for 6 months, and have not given prior notice of planned absence, then consider this mod and its assets released to the community.\r<br />\r<br />\r<br />[size=4][color=#74b464]Thanks and Credits[/color][/size]\r<br />\r<br />Anyone who has used follower mods in previous Bethesda games will quickly see that very few of the ideas I&#39;m implementing here are original: I&#39;m combining features from follower mods that I enjoyed. Most notable influences in this release are Emma and CDCooley&#39;s Vilja for Oblivion, RickerHK&#39;s Brisa for Fallout 3 and Wendy Gilbert for Fallout: New Vegas, and llamaRCA&#39;s Willow for Fallout: New Vegas. Much thanks and credit to these modders; if you play those games, I recommend those mods.\r<br />\r<br />Thanks to Alek, whose &#34;Auto Unequip Arrows&#34; mod for the player provided the inspiration and basic method for Aela unequipping her quiver.\r<br />\r<br />Thanks to Kevin Kidder AKA sushisquid whose Specialized Followers mod inspired Aela&#39;s transformation when her health is low.\r<br />\r<br />Thanks to Wrye, whose &#34;Summon Bed&#34; mod for Oblivion supplied the basic logic for placing the bedroll and tent.\r<br />\r<br />Thanks to Ethatron for the BSAopt extraction tool, and Agnahim for FUZ Extractor, which together allowed me to begin editing the voice files before the Creation Kit&#39;s release.\r<br />\r<br />Thanks to Oranges13 and crash_oxide for their campsite suggestions.\r<br />\r<br />Thanks to Michael Kirkbride, for inspiration and a few specific sentences on Nord culture that I adapted into dialogue.\r<br />\r<br />Thanks to the SKSE and SkyUI teams, who have enabled so many great things.\r<br />\r<br />Thanks to the members of TES Lore area on the Official Bethesda Forum (http://forums.bethsoft.com/forum/16-elder-scrolls-lore/) and to the maintainers of the Imperial Library website (http://www.imperial-library.info/), for many interesting ideas backed up by lore sources.\r<br />\r<br />Thanks to the Unofficial Elder Scrolls Pages (http://www.uesp.net/) for being a frequent and valuable reference.\r<br />\r<br />Thanks to the Nexus Network (http://skyrim.nexusmods.com/) for providing a platform for mods and the community that exists around them.\r<br />\r<br />Thanks to the users of this mod--in particular Svammelie and namz--for their encouragement, bug reports, and ideas.\r<br />\r<br />And of course credit and thanks go to Bethesda Softworks, for releasing and supporting modding tools for their games--without which this mod could not have been made.\r<br />\r<br />[center][url=http://www.skyrimgems.com][img]http://SkyrimGEMS.com/images/badge_featured.png[/img][/url][/center]",
  "categoryId": "96",
  "version": "0.4.7",
  "author": "DreamKing",
  "createdUnix": "1330351071",
  "updatedUnix": "1370798828",
  "containsAdultContent": false,
  "uploadedBy": "DreamKingMods",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033296",
      "name": "ESFAela",
      "version": "0.4.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11417",
      "fileName": "ESFAela-11450-0-4-7.7z",
      "uploadedUnix": "1370697496",
      "modVersion": "0.4.7",
      "virusScanUrl": "https://www.virustotal.com/file/ba14c199241cccf985209dcf563b2013dc36e87a1f3f7c14c641f039724451a0/analysis/1407596235/",
      "changelogHtml": " Removed respect/friendship/romance changes when Aela goes into bleedout that were introduced in 0.4.6, pending further study. <br/> \n Aela will now more reliably use health potions placed in her inventory even when set as essential. <br/> \n Aela now has a chance to turn into a werewolf on her own in combat if her health goes under 33%; this will only happen in caves, ruins, and other \"dungeons,\" where she knows she&#39;s out of public view. Can be turned off through dialogue. <br/> \n Moved her werewolf behavior dialogue topic from \"traveling behavior\" to \"combat tactics\" section (requires respect to unlock). <br/> \n Aela&#39;s health now regenerates in werewolf form (configurable via MCM). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESFAela-11450-0-4-7.7z?fid=1000033296&ttl=1535772626&ri=8192&rs=8192&setec=da3c0e40c2255f0050df9e75e2cf52f1"
    },
    {
      "fileId": "1000033497",
      "name": "ESFAela_ScriptsSource",
      "version": "0.4.7",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "40",
      "fileName": "ESFAela_ScriptsSource-11450-0-4-7.7z",
      "uploadedUnix": "1370798828",
      "modVersion": "0.4.7",
      "virusScanUrl": "https://www.virustotal.com/file/58bb26dd155c122430b748bb053e81c203cb1dc9853426e3896d7f42b721e0e8/analysis/1407598036/",
      "changelogHtml": " Removed respect/friendship/romance changes when Aela goes into bleedout that were introduced in 0.4.6, pending further study. <br/> \n Aela will now more reliably use health potions placed in her inventory even when set as essential. <br/> \n Aela now has a chance to turn into a werewolf on her own in combat if her health goes under 33%; this will only happen in caves, ruins, and other \"dungeons,\" where she knows she&#39;s out of public view. Can be turned off through dialogue. <br/> \n Moved her werewolf behavior dialogue topic from \"traveling behavior\" to \"combat tactics\" section (requires respect to unlock). <br/> \n Aela&#39;s health now regenerates in werewolf form (configurable via MCM). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESFAela_ScriptsSource-11450-0-4-7.7z?fid=1000033497&ttl=1535772626&ri=8192&rs=8192&setec=026a91858cfa4b0ad41ea31806e56259"
    }
  ]
}