{
  "modId": 11473.0,
  "modName": "Herman the Mad",
  "summary": "Adds Herman the Mad as follower. With fully voiced dialogue!",
  "descriptionHtml": "Adds Herman the Mad as follower. With fully voiced dialogue!\r\n\r\nVersion 1.05 now available!\r\n\r\n\r\n----------------------------------------------------------------------------------------------------------\r\nThis mod was originally published on Steam Workshop, but since the workshop\\'s a little bit too unreliable for my taste, I decided to put it up on the Nexus as well. \r\nWorkshop link: http://steamcommunity.com/sharedfiles/filedetails/?id=13348\r\n------------------------------------------------------------------------------------------------------------\r\n\r\nMeet Herman.\r\nHerman\\'s had a little bit of bad luck in recent centuries. One day he was strolling through Bleak Falls Barrow, visiting his long dead ancestors, when some idiot closed that damn combination door behind him. He\\'s been trapped in there ever since, and let\\'s just say the years haven\\'t been too kind to good ol\\' Herman...\r\n\r\nYou can find Herman in the corridor directly behind the combination door in Bleak Falls Barrow. He should be there even if you\\'ve cleared that area a long time ago.\r\n\r\nHe is fully voiced and follows commands. I\\'ll add more dialogue and idle chatter once my voice has recovered from all the growling. ;) \r\n\r\nHerman\\'s either a spellsword/necromancer hybrid or a heavy hitter melee guy. Let me know, if you think he\\'s too OP/weak. I haven\\'t had the opportunity to test him out on higher levels yet. He\\'s level 10 when you meet him and should level up with you (not extensively tested). He can\\'t be killed, except by you.\r\n\r\nThis mod is work in progress, so expect some bugs.\r\n-------------------------------------------------------------------------------------------------------------------\r\n\r\nVersion 1.05:\r\nAdded the new \\'Summon Herman\\' spell. If Herman\\'s already at your side, just talk to him and the new spell will automatically be added to your spell list. If Herman\\'s busy somewhere else or you\\'ve experienced the vanishing bug, you\\'ll find the spellbook on one of the barrels at the campfire in Bleak Falls Barrow. The spell works even if Herman isn\\'t your current follower, making switching followers really easy. It won\\'t work though, if you haven\\'t met Herman yet, of course. If you\\'re a victim of the vanishing bug it should call Herman back to you. Please leave a comment if it doesn\\'t. If your Herman\\'s stuck in his skeleton form, he should be transformed back after fast traveling.\r\n\r\nVersion 1.042:\r\nTemporarily disabled Herman\\'s teleportation ability, since it seems to cause the vanishing bug some people are experiencing. Please leave a comment if Herman still disappears!\r\n\r\nVersion 1.041:\r\nFixed a bug where Herman would sometimes vanish after fast travelling.\r\n\r\nVersion 1.04: \r\nUnlike other lazy ass followers, Herman keeps on fighting, even when he\\'s been knocked down by his foes. His Skeleton form is much weaker, but invulnerable. After 30 seconds Herman transforms back, fully regenerated.\r\nFor a demonstration watch the new video!\r\nHerman now uses his own following routines. He should keep up much better, and if he\\'s too far behind, he\\'ll teleport himself back to you. \r\nIt\\'s a spell Herman learned even before his time in the crypt. Too bad it doesn\\'t work through thick stone walls. Herman tried, believe me! (He doesn\\'t want to talk about it, though...) ;)\r\n\r\nIMPORTANT: If Herman\\'s already your companion, you\\'ll have to talk to him, in order for the new routines to kick in. Ignore the \\\"Your follower has left your service\\\" message. This will only be necessary once.\r\nThere might still be some bugs. Please post in the comments, if you find any. \r\n\r\n\r\nVersion 1.031: \r\nFixed a bug where Herman sometimes would not start a conversation at the first meeting.\r\n\r\nVersion 1.03: \r\nIf you\\'ve already cleared Bleak Falls Barrow before installing the mod, or if you dismiss Herman, he\\'ll now wait for you at the campfire in the entrance hall of BFB. No more running through the whole dungeon again, just to get him! Of course, If you haven\\'t opened the door yet, he is still waiting behind it. If he isn\\'t there when you arrive at the campfire, just wait for an hour or two, eventually he\\'ll show up. \r\n\r\nVersion 1.02:\r\nCompletely new feature: Herman\\'s class change ability!\r\nI\\'ve toyed with the idea of releasing a heavy melee two-hander version of Herman\\'s mod, but instead of making two separate mods I\\'ve decided to put it all in this one. ;)\r\nBeing a complete Draugr badass, Herman\\'s now able to completely swap his class at your command. This includes all his stats, spells, skills and abilities.\r\nYou can make him swap back and forth as often as you like, just make sure there\\'s always both a one-handed and a two-handed weapon in his inventory.\r\nThis feature is still pretty experimental, so there might be some quirks. I\\'ve had no problems so far.\r\n\r\n\r\nVersion1.01: \r\nAdded more fun stuff for Herman to say, including some of your contributions. Big thanks to all! Keep it coming!\r\nI finally dabbled around with Skyrim\\'s stupid xwm audio file format, resulting in a greatly reduced package size.\r\n\r\nVersion 1.0:\r\nAdded new dialogue option: Herman\\'s words of wisdom.\r\n\r\nHerman has had quite some time to think while being trapped in his dungeon and is eager to share his conclusions with you! (in two hour intervals of game time at least) \r\n\r\nI\\'m always looking for more wisdoms to add, so feel free to leave any good ideas in the comments!\r\n\r\nVIDEO UPDATE:\r\nHerman\\'s now also featured on SaioTV\\'s fantastic Skyrim Mods Series on Youtube:\r\n\r\n[youtube]lFd199Edyrk[/youtube]\r\n\r\nMany thanks to SaioTV! Herman\\'s proud to be on the show! :)\r\nVisit SaioTV\\'s Youtube channel: http://www.youtube.com/user/SaioTV  !\r\n\r\nMany thanks also go to R3viewsHD for his awesome video review! I\\'m deeply honored :)\r\nNow there\\'s even a version that\\'s completely in english! :)\r\n\r\n[youtube]JRGt3qNgPpI[/youtube]\r\n\r\nVisit his Youtube channel for many more great gaming related videos: http://www.youtube.com/user/R3viewsHD ! \r\n\r\nA big thank you also goes to Aiphares for his Youtube video showing you his first meeting with Herman!\r\n\r\n[youtube]oi5H_QVr258[/youtube]\r\n\r\nVisit his Youtube channel: http://www.youtube.com/user/Aiphares !\r\n\r\nHave fun! :)\r\n",
  "categoryId": "66",
  "version": "1.05",
  "author": "Jaerv",
  "createdUnix": "1330364768",
  "updatedUnix": "1331052327",
  "containsAdultContent": false,
  "uploadedBy": "JaervSkyrim",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40776",
      "name": "Herman the Mad v1_05",
      "version": "1.05",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4286",
      "fileName": "Herman the Mad v1_05-11473-1-05.rar",
      "uploadedUnix": "1331052327",
      "modVersion": "1.05",
      "virusScanUrl": "https://www.virustotal.com/file/4c335ee016dd839916eb81c540ca917772fa4c40e0793622c5ef51bdfeb3abc1/analysis/1406734755/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Herman%20the%20Mad%20v1_05-11473-1-05.rar?fid=40776&ttl=1535772664&ri=8192&rs=8192&setec=5a830dc73808e8ac3a32043e0cc7b500"
    }
  ]
}