{
  "modId": 11481.0,
  "modName": "Phitts Alchemy and Food Overhaul",
  "summary": "Completely rebalances and enhances the alchemy and food crafting systems. Now split into two esps (so you can choose if you only want the alchemy overhaul or only the food overhaul) and with \\'Better Sorting\\' compatibility.",
  "descriptionHtml": "== Phitt\\'s Alchemy and Food Overhaul ==\r\n\r\nUpdated to v1.2, please read installation instructions and changelog. And just for clarification: the changes to food are optional in the latest version. If you prefer to use a hunger/thirst realism mod and the mod you use would be incompatible then you can only use the alchemy overhaul without any changes to food.\r\n\r\nThis mod completely rebalances and enhances the alchemy and food crafting systems. For a short description of all the changes read the following two paragraphs, a long, detailed description can be found further down. Please read the sections about installing/uninstalling and compatiblity.\r\n\r\n\r\n= Quick overview of changes to alchemy =\r\n\r\n1. Potion strength now heavily depends on the rarity of the ingredients used. \r\n\r\n2. Potion prices were lowered drastically. \r\n\r\n3. Potion prices depend on potion strength mostly and not so much on magic effect type. \r\n\r\n4. The magnitude of ingredient effects was rebalanced to make custom potions made from average ingredients at max skill level not more or less powerful than the best premade potions.\r\n\r\n5. Number of ingredients per effect were rebalanced.\r\n\r\n6. Restore Health and Restore Magicka now have a duration and won\\'t heal instantly.\r\n\r\n7. Most magic effects have been rebalanced to make them neither useless, nor overpowered.\r\n\r\n8. All poisons now have a duration and don\\'t work instantly.\r\n\r\n9. Fortify secondary skill effects (lockpicking, pickpocket, enchanting, smithing, barter) were removed and replaced with other effects.\r\n\r\n10. 7 new effects were added - Fortify Speed, Fortify Weapon Speed, Fortify Armor Rating, Weaken Armor, Night Eye, Cure Poison, Fortify Unarmed Damage.\r\n\r\n11. Reading recipes now automatically unlocks the ingredient effects and new recipes were added.\r\n\r\n\r\n= Quick overview of changes to food =\r\n\r\n1. You can now only have one active food effect at a time, but the effects are a bit stronger and last longer plus they work in addition to alchemy effects.\r\n\r\n2. Recipes were altered to make the better food types slightly more challenging to create.\r\n\r\n3. A few new recipes were added to balance the system and give each possible effect a weak, average and strong version.\r\n\r\n\r\n= Detailed overview of changes to alchemy =\r\n\r\n1. Potion strength now heavily depends on the rarity of the ingredients used. \r\n\r\nPotions made from rare ingredients will be much more powerful than those made from very common ingredients. Ingredients have been classified into very common, common, uncommon, rare and very rare categories. Bethesda already has implemented a system to do this (unlike Oblivion, where it wasn\\'t possible since all effects automatically had the same magnitude), but unfortunately they didn\\'t make use of it. There are differences between ingredients in the vanilla game, but they don\\'t follow any scheme - instead some random ingredients are slightly weaker than others, but most have the same default maximum magnitude. So looking for rare ingredients is pointless - whether you use a Pearl and a Briar Heart (which you will hardly ever find) or a Red Mountain Flower and a Gras Pod (with more than 1200/500 respawning plants in the game world) to create a restore magicka potion doesn\\'t matter, the potion strength will be the same. With my system the ingredients will make a huge difference, a potion with at least one very rare ingredient will be 3x as powerful as a potion made from very common ingredients only. This is how I defined the rarity of ingredients:\r\n\r\nVery common (-50%) - More than 200 respawning \\'containers\\' (ususally plants) for the ingredient in the game world (Mountain Flowers, Thistle etc)\r\n\r\nCommon (-25%) - Between 100 and 200 containers in the game world or ingredients taken from critters that need to be catched (Butterflies etc) or ingredients obtained from common enemies (Mud Crab etc)\r\n\r\nUncommon (0%) - Rare ingredients (Bees etc) or uncommon ingredients scattered throughout Skyrim (Bird Eggs etc) or ingredients obtained from tougher and less common enemies (Sabre Cat Tooth, Dwarven Oil etc)\r\n\r\nRare (+25%) - Very rare ingredients or ingredients obtained from very tough enemies (Briar Heart, Giant\\'s Toe etc)\r\n\r\nVery Rare (+50%) - Ingredients that cannot be harvested regularly, neither from (respawning) enemies nor from plants (Daedra Heart or Pearl for example)\r\n\r\n2. Potion prices were lowered drastically. \r\n\r\nIn the vanilla game you can become rich easily by making potions, even with an average alchemy skill you can make potions worth as much as a full set of Dwarven armor. Now custom potions will be worth far less. Prices of premade potions you can find in loot were also lowered, but not as much. Generally a potion with the same strength as the best premade potion will be worth 20% as much. So when the best premade Fortify Sneak potion in the game is worth 110 gold then a custom potion with maxed out alchemy skill made with at least one uncommon ingredient will be worth 22 gold.\r\n\r\n3. Potion prices depend on potion strength mostly and not on magic effect type. \r\n\r\nIn the vanilla game some magic effects (like regenerate health for example) have a much higher price than other effects (like restore health for example). This forces you to make potions or poisons you don\\'t need to level your alchemy skill quickly. Not anymore, now potions made from rare ingredients will be worth more than those made from common ingredients, but the magic effect type won\\'t matter much. There are still some small differences, but none that would matter.\r\n\r\n4. The magnitude of ingredient effects was rebalanced to make custom potions made from average ingredients at max skill level not more or less powerful than the best premade potions.\r\n\r\nIn the vanilla game the magnitude of custom potions was seemingly randomly implemented. Some custom potions are much stronger than the best premade potions at max alchemy skill level while others are much weaker. Now potions made from an uncommon ingredient at max skill level will be exactly as strong as the best premade potion of that type. \r\n\r\n5. Number of ingredients per effect were rebalanced.\r\n\r\nSome effects only had very few ingredients to choose from (like fortify two-handed for example with only 3 ingredients to choose from), while others had more than you would ever need (like resist poison with 9 ingredients to choose from). I rebalanced the ingredients so all main effects have at least one rare or very rare and one uncommon as well as two very common ingredients to chose from. This also means that a lot of ingredients work differently now, so looking up potion effects on the UESP Wiki or somewhere else won\\'t work anymore in many cases. In my opinion that is a nice side effect.\r\n\r\n6. Restore Health and Restore Magicka now have a duration and won\\'t heal instantly.\r\n\r\nRestore Health and Restore Magicka potions now have a duration of 10 seconds and don\\'t stack. To make sure they\\'re still useful their total magnitude was doubled. So a Potion of Plentiful healing, which replenishes 75 health instantly in the vanilla game will now replenish 15 points of health for 10 seconds for a total of 150 points. \\'Ultimate\\' potions were not altered, they still replenish all health or magicka instantly.\r\n\r\n7. Most magic effects have been rebalanced to make them neither useless, nor overpowered.\r\n\r\nSpeaks for itself. The changes aren\\'t huge, but you will notice them while playing the game.\r\n\r\n8. All poisons now have a duration and don\\'t work instantly.\r\n\r\nAll poisons now have a duration and don\\'t work instantly, that\\'s how poisons usually work. Regular damage poisons now have a duration of 5 seconds, lingering damage poisons have a duration of 25 seconds. The totalstrength of poisons was slightly increased.\r\n\r\n9. Fortify secondary skill effects (lockpicking, pickpocket, enchanting, smithing, barter) were removed and replaced with other effects.\r\n\r\nI never liked the fortify secondary skill effects, so I replaced them. They can easily be exploited (crafting loop) and they\\'re just enhancements of a skill without any drawbacks. How often do you enchant your gear? Of course you\\'ll always have a fortify enchanting potion each time you enchant something you use yourself, so you could just as well increase the enchanting skill as you increase your alchemy skill. Would be less annoying and would have the same effect. Obviously that\\'s pointless. So I replaced them with useful effects, see below. \r\n\r\n10. 7 new effects were added - Fortify Speed, Fortify Weapon Speed, Fortify Armor Rating, Weaken Armor, Night Eye, Cure Poison, Fortify Unarmed Damage.\r\n\r\nFortify speed gives a short (10 seconds), but strong speed boost (up to 75% more speed). It replaces the lockpicking potions in the game, only the Thieves Guild potions still have the fortify lockpicking effect. \r\n\r\nFortify Armor Rating will give a fixed bonus to your armor rating independent from the armor you wear. Especially useful for mages. Replaces the smithing potions in the game.\r\n\r\nWeaken Armor is a poison the reduces the target\\'s armor rating for a limited duration. Only works on NPCs who wear armor and doesn\\'t reduce the armor rating below 0. Replaces the pickpocket potions in the game, only the Thieves Guild potions still have the fortify pickpocket effect. \r\n\r\nFortify Unarmed Damage increases unarmed (hand to hand) damage by a fixed amount. Replaces the barter potions in the game.\r\n\r\nAbsorb Spell works exactly like the effect you can get from the Atronach Stone. It gives you a percentage chance to absorb a spell that hits you - the spell will have no effect and the magicka it costs will be added to your magicka pool. Replaces the enchanting potions in the game.\r\n\r\nFortify Weapon Speed increases your weapon speed by 20% for a duration defined by the potion strength. If you have the dual flurry perk(s) and equip two weapons the effect will be dispelled immediately for technical reasons - your weapons will be 20% or even 35% faster anyway. \r\n\r\nNight Eye works like the Night Eye effect Khajiits for example have. \r\n\r\nCure Poison creates cure poison potions, just like the ones that can be found in game already.\r\n\r\n11. Reading recipes now automatically unlocks the ingredient effects and new recipes were added.\r\n\r\nIf you read an alchemy recipe (the notes you can find in game or buy from vendors) the effects described in the recipe will automatically get unlocked on the ingredients so you don\\'t have to remember them yourself. I also added 46 new recipes to the existing 27 (for a total of 73 recipes) to make sure each possible alchemy effect has at least one recipe. I added the recipes to the leveled lists and slightly increased the chance for finding one (in vanilla the chance to find a recipe is 3.33% on mage type enemies, now it is 10%). Fortunately there are lists exclusively for recipes so it shouldn\\'t conflict with any other mod (unless that mod also adds new recipes, but that won\\'t work well with my mod anyway).\r\n\r\n\r\n= Detailed overview of changes to food =\r\n\r\n1. You can now only have one active food effect at a time, but the effects are a bit stronger and last longer plus they work in addition to alchemy effects.\r\n\r\nIn the vanilla game the food system is a weak, pointless and idiotic alternative to the alchemy system. Food often works like a very weak restore health potion and to make good use of it you eat about 50 pounds of food in a split second. Yeah, makes sense. Now (most) food effects will last longer, but only the first one will take effect. So as long as one food effect is active eating other food will not grant additional benefits. Cooked food has better effects than raw food, and the more ingredients you need to cook a certain type of food, the better it will be and the longer it will last. There are only eight effects available from food now - fortify health/stamina/magicka, regenerate health/stamina/magicka, fortify carry weight and fortify speed. Pick the one you need most when you eat food and think ahead. \r\n\r\n2. Recipes were altered to make the better food types slightly more challenging to create.\r\n\r\nIn the vanilla game you only need one tomato to cook a tomato soup. If you ever cooked a tomato soup yourself you know that this is nonsense. Ingredients needed to cook stews and soups have been increased a lot to make it at least a bit more challenging to cook the better food types.\r\n\r\n3. A few new recipes were added to balance the system and give each possible effect a weak, average and strong version.\r\n\r\nA few new recipes were added to balance the effects, for each effect there is at least one weak food item (raw food), one average food item (cooked, but only few ingredients needed) and one powerful food item (cooked with lots of ingredients needed). \r\n\r\n\r\n= Compatibility =\r\n\r\nDue to the all-encompassing overhaul nature of this mod it will not play well with other mods that make changes to the alchemy or food systems. Most mods should at least work, but depending on what they do they might unbalance the system. The changes to the potion prices also require a change to the leveling rate so any mods that alter the leveling rates of skills MUST be loaded before this mod or leveling alchemy will take forever.\r\n\r\n\r\n= Installation =\r\n\r\nIf you use v1.0 please delete the old esp (PTAlchemyFoodOverhaul_x_x.esp) then follow the directions below.\r\n\r\nExtract the archive into your data folder and overwrite if asked. You will find nine esps to choose from. The esp names should be pretty self-explaining. Use the \\'ONLY\\' esps if you only want to use one overhaul (either alchemy or food). Otherwise use the PTAlchemyFoodOverhaul esp if you want to use both. If you want the \\'Better Sorting\\' version then pick the esp with the \\'BetterSorting\\' suffix. \r\n\r\nNow the important part. If you use the alchemy overhaul you HAVE to choose one of the PTAlchemyOverhaul_SkillRate_x_x esps and you have to make sure it loads AFTER any mod that changes the leveling rate of skills. Otherwise leveling alchemy will take forever. For a leveling rate about equal to vanilla choose 1_0, for a leveling rate half as fast choose 0_5 etc. \r\n\r\nIf you use only the food overhaul you should end up with just one esp, if you use the alchemy overhaul (and possibly the food overhaul as well) you should end up with two esps (one for the overhaul(s) and one for adjusting the skill rate). Delete the rest.\r\n\r\n\r\n= Uninstallation =\r\n\r\nBefore you uninstall this mod make sure neither you nor any of your companions or other important people are affected by any potion or food effects. If you have a savegame where no one is affected delete the esp, the scripts (PTWeakenArmorScript, PTNightEyeScript, PTFortifyWeaponSpeedScript, PTFortifySpeedScript, PTAlchRecipeScript) and the PTAlchemy folders in the meshes and textures folders.\r\n\r\n\r\n= Changelog =\r\n\r\nv1.0\r\n\r\n- intitial release\r\n\r\nv1.1\r\n\r\n- added a \\'Better Sorting\\' version\r\n- split alchemy and food overhauls into two different esps\r\n- some minor tweaks to the alchemy system\r\n- implemented a script that automatically unlocks ingredient effects when you read an alchemy recipe\r\n- added 46 new recipes for a total of 73, added them to leveled lists and slightly increased the chance to find them in loot\r\n\r\nv1.2\r\n\r\n- fixed prices for custom fortify magicka potions - they were 10x as valuable as they should be\r\n- fixed a typo (caused by the silly auto \\'correction\\' system of the CK) in the fortify two-handed recipe\r\n\r\n\r\n= Credits =\r\n\r\n- fowl for the \\'recipe unlocks ingredient effects automatically\\' idea and script template",
  "categoryId": "24",
  "version": "1.2",
  "author": "Phitt",
  "createdUnix": "1330369775",
  "updatedUnix": "1332358892",
  "containsAdultContent": false,
  "uploadedBy": "Phitt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "37687",
      "name": "Food and Alchemy Overhaul",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "358",
      "fileName": "Food and Alchemy Overhaul-11481.7z",
      "uploadedUnix": "1330369828",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/183e2f03dc5b68b9e7a192666605735a7b7f8a0d11796f05faa25c0f168f8312/analysis/1406717592/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Food%20and%20Alchemy%20Overhaul-11481.7z?fid=37687&ttl=1535772692&ri=8192&rs=8192&setec=3c98092da497ae388052d66eab6ac49d"
    },
    {
      "fileId": "39253",
      "name": "Alchemy and Food Overhaul v1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "366",
      "fileName": "Alchemy and Food Overhaul v1_1-11481.7z",
      "uploadedUnix": "1330713022",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/af383cb922240743ce104c5244bc0d3dfb98bd6b981b70a08833cab95857b506/analysis/1406725517/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alchemy%20and%20Food%20Overhaul%20v1_1-11481.7z?fid=39253&ttl=1535772693&ri=8192&rs=8192&setec=b58a4da44915ad1fe90992a4f933f141"
    },
    {
      "fileId": "45493",
      "name": "Alchemy and Food Overhaul v1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "366",
      "fileName": "Alchemy and Food Overhaul v1_2-11481-1-2.7z",
      "uploadedUnix": "1332358892",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/a1d5cb2735e8ae706710ee7861c3d6306d164d160e61fed7cfafeda60756f3aa/analysis/1406771597/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alchemy%20and%20Food%20Overhaul%20v1_2-11481-1-2.7z?fid=45493&ttl=1535772693&ri=8192&rs=8192&setec=24e933c7f3e61093877a802a525195d1"
    }
  ]
}