{
  "modId": 11494.0,
  "modName": "Masters of Death - Rise of the Brotherhood - Traduzione ita",
  "summary": "This is only a translation into Italian of the original mod.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/downloads/file.php?id=9752]original mod[/url].\r\nThe original mod introduce a new light armor: The Sicarius Armor.\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size]\r\n\r\n[color=red][b]ATTENZIONE![/b]\r\nQuesta è solo la traduzione italiana del mod originale che trovate [url=http://skyrim.nexusmods.com/downloads/file.php?id=9752]qui[/url].[/color][/center]\r\n\r\n[center][color=GREEN][size=+4]UNA TRADUZIONE DRAGONBORN ITALIA[/size][/color][/center]\r\n\r\n[color=GREEN][b]DESCRIZIONE[/b][/color]\r\nChi non si è innamorato dell\\'armatura di Ezio in Assassin\\'s Creed? \r\nOra potrete rivederla anche per le lande di Skyrim!\r\nL\\'armatura è disponibile in diversi colori (scaricabili a parte), sia per uomo che per donna.\r\nLa mod originale prevede due diverse versioni, nella prima questa armatura va a sostituire quella della confraternita oscura, mentre nella seconda non toccherà nulla ma la renderà solo forgiabile. All\\'interno dell\\'archivio che troverete alla pagina di Dragonborn Italia vi saranno le traduzioni di entrambe le versioni. Copiate nella cartella data solo l\\'esp della versione che avete installato!\r\n\r\n[color=GREEN][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n[color=GREEN][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!\r\n",
  "categoryId": "54",
  "version": "2.1",
  "author": "klop",
  "createdUnix": "1330378214",
  "updatedUnix": "1330378214",
  "containsAdultContent": false,
  "uploadedBy": "klopklop",
  "primaryFile": null,
  "files": []
}