{
  "modId": 1151.0,
  "modName": "Remove Perks",
  "summary": "Removes learned perks so you do not manual have to console command them all out. Useful in \\\"respecing\\\" your characters perks.",
  "descriptionHtml": "MAKE SURE YOU SAVE YOUR GAME BEFORE YOU RUN THIS SCRIPT. I am 100% certain it does not mess up your game or disable your achievements as I have tested it, but I do not want you to mess up your game anyway!\r\n\r\nI do not very much wish to cheat in this game per say, but I did want to spice my game up a bit and enjoy a different play style, so instead of removing all my perks 1 at a time with console commands i just created this script file to ease the pain. \r\n\r\nSimply copy respec.txt into your skyrim executable folder (ex: C:\\\\Program Files (x86)\\\\Steam2\\\\steamapps\\\\common\\\\skyrim) run skyrim, and open your console prompt (typically by pressing `) and type in:\r\n\r\nbat respec\r\n\r\nAfter this all of you perks should be removed but you will be at 0 perks available, so you can regain your perk count by console commands or downloading this great addon: http://skyrimnexus.com/downloads/file.php?id=745 and doing it that way.\r\n\r\nYou may have to run the console command a few times to get rid of all the perks, and also make sure you are not in your perk menu when running the command.\r\n\r\nEdit: I\\'ve just noticed other mods that are more sophisticated than this one in Skills and leveling. I\\'ll just leave this up for now, just wanted to be clear I did not see the other mods ahead of time and the name was purely coincidental to Kaenil\\'s \\\"Inelegant Respec\\\". So just take your pick on your preferred method of removing/adding perks. =)\r\n\r\n\r\n\r\n",
  "categoryId": "73",
  "version": "1.0",
  "author": "Redhill",
  "createdUnix": "1322028800",
  "updatedUnix": "1322029291",
  "containsAdultContent": false,
  "uploadedBy": "Redhill",
  "primaryFile": null,
  "files": [
    {
      "fileId": "3047",
      "name": "respec",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "respec-1151-1-0.zip",
      "uploadedUnix": "1322029291",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/abce7124724a4e0ed43ffe55cdc32cc90539e3f52d6297879039555b3816e908/analysis/1406437024/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/respec-1151-1-0.zip?fid=3047&ttl=1535754561&ri=8192&rs=8192&setec=41112b4a1d1260712ed5b3174b3edf5d"
    }
  ]
}