{
  "modId": 11541.0,
  "modName": "Dragonborn Balance Mod",
  "summary": "Completely changes the levels and scaling of all of the enemies in the game. Plans for more.",
  "descriptionHtml": "*UPDATES*\r\n\r\n1.1 : Reworked Bleakfalls Barrow and Early Dragons to allow player to get to Dragon Slaying earlier in the game.\r\n\r\n\r\n*Goal of the mod*\r\n\r\nThere have been several mods that edit the leveled lists, including PISE or the fantastic scaling stopper. None of them did quite what I wanted. The goal of this mod is to balance the world in around the concept of the Dragonborn. Meaning, I want to feel as though I become more powerful from killing dragons and absorbing their souls. Not merely leveling up, which in my game will make you no more powerful than a high level bandit. \r\n\r\nThe result of this is a world with humans who have far more static and sane levels. Very few will be over level 15, and most of those are named bosses. Other creatures will have much higher levels to reflect their powers and abilities according to LORE, not according to the original values in Skyrim. Dragons will also be a varied and dangerous foe. You are just as likely to run into high level dragons as low, and it will be important to know the types of dragon to avoid a quick death.\r\n\r\nIF this doesn\\'t sound quite like what you\\'re looking for there is an alternative link at the bottom.\r\n\r\nSince I am editing every single npc in the game in some way, it would be pretty to tedious to list every change I make as I make them, however I will try to give a broad sense of what I do with each release.\r\n\r\n**** IMPORTANT COMPANION MODS******\r\n\r\nThis mod is meant to be a companion mod to several that I use. Without them it will simply make your game way way too easy. The crucial mods to get the most out of the experience are\r\n\r\nFrost Fall - http://skyrim.nexusmods.com/downloads/file.php?id=11163\r\n\r\nLegit Food and Rest - http://skyrim.nexusmods.com/downloads/file.php?id=7511\r\n\r\nPotions over time - http://skyrim.nexusmods.com/downloads/file.php?id=5873\r\n\r\nPerkup -http://skyrim.nexusmods.com/downloads/file.php?id=9359\r\n\r\nDragon Souls to Perks (for this you should set it to a 1-1 transfer) - http://skyrim.nexusmods.com/downloads/file.php?id=9359\r\n\r\nSlower Leveling is not really necessary because Leveling up is not where you get the most power in this game. Even if you try to break it using smithing, alchemy, or enchanting, you are not really going to make yourself all that much stronger. You will still need to convert Dragon Souls to take on the higher level enemies.\r\n\r\n*What\\'s been done so far*\r\n\r\nAs of v1.0 All of the races in the game have been modified and scaled. I have only changed their levels, I have no individually edited stats beyond that. All other aspects of this overhaul will be released in separate ESPs to avoid overlap with other mods.\r\n\r\n*Planned* \r\nAt the moment I\\'m looking into mostly minor tweaks. Resistances to elemental damage on certain types of enemies and npcs, I am open to suggestions for this. As long is it fits into my lore-centric view of how I want the game balanced. \r\n\r\nUpdate - I am now actually working on re-balancing the loot lists. So you will have as much a chance to find high-level gear as low level gear. Also, any scaled quest rewards will have their low-level variants removed and only the highest level version will remain. It may make certain weapons over-powered, however I think this balances out with the more challenging world.\r\n\r\n\r\n*Compatibility*\r\n\r\nObviously this will clash hardly with anything that edits leveled lists or level scaling. If you have to mix and match, I\\'d load mine last. If there are conflicts, let me know so I can post them here.\r\n\r\nAlso feel free to message me if you need links or suggestions for other mods, or if you have specific questions about this mod.\r\n\r\n\r\n**Thanks**\r\n\r\nOf course to a few close friends who helped me brainstorm the ranges of levels, and a special thanks to David Brasher, who was an immense help in doing this, and has his own version if mine isn\\'t quite what you\\'re looking for. http://skyrim.nexusmods.com/downloads/file.php?id=9857\r\n\r\nIf you play it and like it, endorse and spread the word. I can\\'t be the only one who wants this kind of skyrim.",
  "categoryId": "79",
  "version": "v1.1",
  "author": "Efrim Black",
  "createdUnix": "1330410723",
  "updatedUnix": "1331521754",
  "containsAdultContent": false,
  "uploadedBy": "EfrimBlack",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42543",
      "name": "Dragonborn_Balance_Mod",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1119",
      "fileName": "Dragonborn_Balance_Mod-11541-v1-1.rar",
      "uploadedUnix": "1331521754",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b66350755e802baf671deaf3701cd781122a3ccf67b72e461a6a6eb55434a12d/analysis/1406744591/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonborn_Balance_Mod-11541-v1-1.rar?fid=42543&ttl=1535772803&ri=8192&rs=8192&setec=4cb2bd14ea33a393421438c902019668"
    }
  ]
}