{
  "modId": 11553.0,
  "modName": "Shifts of Power",
  "summary": "As foretold by the prophecy, they lay together as one, yet also seperated. Three factors of power, Might to the North, Insight to the West, and Endurance to the East. Each different as they are alike. From this, man can sacrifice one power for another, as all things lay equal in the world. They stand ever still, and will so until the end.\r\n\r\nShut t",
  "descriptionHtml": "As foretold by the prophecy, they lay together as one, yet also seperated. Three factors of power, Might to the North, Insight to the West, and Endurance to the East. Each different as they are alike. From this, man can sacrifice one power for another, as all things lay equal in the world. They stand ever still, and will so until the end.\r\n\r\nShut to the world long ago, six stones have lay ever still, resting in their aura of omnipotence. Prophesied to enable man to shift their factors of power between each other, the door was magically sealed from the outside. A mere whisper, however, weakens the magic binding to the door, and those with enough power can enter.\r\n\r\nThis mod aims to enable a much more dynamic experience as you reach higher levels. It creates a new cave/dungeon near Riverwood in which there are six stones, which allow the player to exchange stats for one another, like health to magcika.\r\n\r\nI made this mod because of how the way you play becomes very limited as you level up higher and higher. For example, since I had originally decided to be a mage, I put all my points to magicka as I leveled up. As I progressed, however, I decided I might want to be more of a battlemage. Unfortunately I was at level 50 and my play style was limited to that of a pure mage. This mod changes that, and you won\\'t have to start from scratch if you want to have a different play style.\r\n\r\nFinally, I would like to say thank you to anyone who subscribes to this mod, as I put quite a lot of time and effort into all the creation and scripting, and I would love to hear any feedback from you, especially ideas for the quest!\r\n\r\n\r\nUpdate 1.1 changes:\r\nPlayer now has to be level 5 to activate entrance stone.\r\nCosts 1 dragon soul each time you enter.\r\nYou can now choose between 100, 50, 20, or 10 stat points to exchange!\r\n\r\n\r\nStill to be done:\r\nMake a quest based upon the mod.\r\nA lot more scripting!",
  "categoryId": "24",
  "version": "1.1",
  "author": "Barnard401",
  "createdUnix": "1330423147",
  "updatedUnix": "1330531524",
  "containsAdultContent": false,
  "uploadedBy": "barnard401",
  "primaryFile": null,
  "files": [
    {
      "fileId": "38467",
      "name": "The Shifts of Power",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "152",
      "fileName": "The Shifts of Power-11553-1-1.zip",
      "uploadedUnix": "1330531524",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d81746a9f53f459f0aca52d54e0aa1bc44232218a01870e0da6bce079cdef036/analysis/1406721364/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Shifts%20of%20Power-11553-1-1.zip?fid=38467&ttl=1535772817&ri=8192&rs=8192&setec=f98f8a4a66f2fd16b39ba0126b7fef45"
    }
  ]
}