{
  "modId": 11584.0,
  "modName": "Magic Arrows for Crafting Complete",
  "summary": "Because an archer just isn\\'t an archer unless his arrows explode.",
  "descriptionHtml": "Important: [b]REQUIRES[/b] Crafting Complete.  This is only a set of enchanted arrows to add to it.\r\n\r\n\r\nAdds a set of magical arrows, craftable through the same fletching system as other arrows added by Crafting Complete.  They require Arcane Blacksmith, Alchemist II, and Enchanter II in addition to the requirements to fletch regular Steel Arrows, as well as Alchemy ingredients and Soul Gems.  All arrows have a base damage of 10, same as steel, but explode on impact with additional effects.\r\n\r\nForce Arrows do more damage to targets closer to the blast and cause stagger.  They require 3x Bone Meal and a Lesser Soul Gem to craft.\r\n\r\nFire, Frost, and Shock Arrows do elemental damage to targets inside the blast zone.  They require 3x Fire, Frost, or Void Salts as well as a Common Soul Gem.\r\n\r\nStun Arrows have a chance to paralyze targets inside a small radius on impact.  They require 3x Bone Meal and 1 each of Fire, Frost, and Void Salts, as well as a Greater Soul Gem.\r\n\r\nLight Arrows do a large amount of AoE damage to Undead and Daedra targets, as well as having Banish and Turn Undead effects on them.  They require 2 each of Nirnroot and Glowdust, as well as a Grand Soul Gem.\r\n\r\nThere is at least one issue I have no idea how to fix, probably more I haven\\'t found; if someone more knowledgeable wants to fix them (if it\\'s even possible), feel free to go right ahead.  Specifically, I\\'ve found you can kill people with the AoE effects and only have it count as an assault rather than a murder.  The damage doesn\\'t seem to be coming from the player.",
  "categoryId": "27",
  "version": "1",
  "author": "SparklyDemonLord",
  "createdUnix": "1330457830",
  "updatedUnix": "1330457943",
  "containsAdultContent": false,
  "uploadedBy": "SparklyDemonLord",
  "primaryFile": null,
  "files": [
    {
      "fileId": "38116",
      "name": "Magic Arrows for Crafting Complete",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Magic Arrows for Crafting Complete-11584-1.7z",
      "uploadedUnix": "1330457943",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/7a8f80f005511affdfa01d12d6b91e9ad217ea68096c39f3d22b19a222cb4684/analysis/1406719780/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Magic%20Arrows%20for%20Crafting%20Complete-11584-1.7z?fid=38116&ttl=1535772875&ri=8192&rs=8192&setec=414d2af493c30796908cd6ae6436b1ba"
    }
  ]
}