{
  "modId": 11589.0,
  "modName": "Portable Campsite - German",
  "summary": "Diese Modifikation ermöglicht das errichten eines eigenen kleinen Zeltlagers. Dazu können alle Gegenstände von einer Händlerin in der Taverne \\\"Schlafender Riese\\\", welche sich in Flussheim befindet, erworben werden.",
  "descriptionHtml": "_____________________________________________________________________________________________________________________________________\r\n[center][size=5]EINLEITUNG[/size][/center]\r\n\r\nDiese Modifikation ermöglicht das errichten eines eigenen kleinen Zeltlagers. Dazu können alle Gegenstände von einer erfahrenen Jägerin in der Taverne \\\"Schlafender Riese\\\", welche sich in Flussheim befindet, erworben werden.\r\n\r\n\r\nDiese Modifikation stammt von Mcxar. Ich habe diese Modifikation lediglich ins deutsche uebersetzt.\r\n\r\nBitte besucht auch die Seite des Mod-Autoren Mcxar und hinterlasst ihm ein \\\"Endorsed\\\", wenn euch diese Modifikation gefallen hat:\r\n[center][size=3][url=http://skyrim.nexusmods.com/downloads/file.php?id=9935]Originalversion von Mcxar[/URL][/size][/center]\r\n\r\n_____________________________________________________________________________________________________________________________________\r\n[center][size=5]BESCHREIBUNG DER VERSIONEN[/size][/center]\r\n\r\nBitte wähle nur eine der beiden Version aus! [Light-Version folgt demnächst]\r\n\r\n[u]Full Version: 3.0[/u]\r\n\r\nDu kannst die Gegenstände von Portable Campsite von der erfahrenen Jägerin im Schlafenden Riesen, der Taverne in Flussheim, unter dem Bereich \\\"Sonstiges\\\" erwerben.\r\nUm ein Objekt zu platzieren, lasse das Objekt fallen. Sobald das Objekt ein deinen gewünschten Ort liegt, gehe in den Schleichen-Modus und aktiviere das Objekt.\r\n\r\nUm das Objekt wieder aufzunehmen, gehe wieder in den \\\"Schleichen\\\"-Modus und \\\"aktiviere\\\" nochmal den Gegenstand. Daraufhin wird das Objekt wieder in deinem Inventar platziert.\r\n\r\n[u]Alternativ:[/u]\r\nDu kannst alle Gegenstände aus Portable Campsite an jeder Schmiede und Gerbgestell, je nach Gegenstand, herstellen. Die Platzierung erfolgt wie oben beschrieben.\r\n\r\n\r\n[u]Light Version: 2.50 - [Übersetzung erfolgt in den nächsten Tagen von mir!][/u]\r\n\r\nDiese Version funktioiert genau so wie die \\\"Full-Version\\\". In der \\\"Light-Version\\\" werden jedoch nur die \\\"Basis\\\"-Objekte hinzugefügt. Diese können ebenfalls bei der Jägerin erworben oder geschmiedet werden. Aufgrund der \\\"simplen\\\" Umsetzung, trägt diese Version noch immer die Version 2.50. Das ist die aktuellste und wird, so scheint es zumindest, nicht mehr aktualisiert.\r\n\r\n[b]Wichtige Anmerkung des Mod-Autoren[/b]\r\n\r\nDurch die Art, wie dieses System im moment arbeitet, ist die Benutzung von nur einer Einheit pro Gegenstand empfohlen. Du wirst möglicherweise in der Lage sein, 2 Bettrollen (Beispiel!) korrekt zu platzieren, um jedoch sicher zu gehen, schmiede/benutze/kaufe nur eine Einheit von diesen Gegenständen.\r\n\r\nEs kann passieren das, wen zu viele Lichter nahe beieinander stehen, sich die Lichtquellen ausschalten. Das ist ein bestätigter Bug der Skyrim Engine. \r\n\r\n[i][Anmerkung von Dante2000: Ich konnte das besagte Problem nicht feststellen und konnte mehrere Bettrollen problemlos platzieren. Ich erwähne es hier dennoch, damit ihr über eventuell auftretende Fehler informiert seit. Auch die Lichtquellen scheinen in einem nachfolgenden Patch gefixxt worden zu sein.][/i]\r\n\r\n_____________________________________________________________________________________________________________________________________\r\n[center][size=5]KOMPATIBILITÄT ZU ANDEREN MODIFIKATIONEN[/size][/center]\r\n\r\nBegleiter-Modifikationen sollten kein Problem darstellen, jedoch können Begleiter bei der Aufstellung / Errichtung eines Camps sehr nervig werden, da sie regelmäßig mit den aufgestellten Gegenständen interagieren. Um das vorzubeugen, empfehlen wir, den Begleiter einfach an Ort und Stelle warten zu lassen und ihn erst wieder anzusprechen, bzw. ihn mit kommen zu lassen, nachdem das Camp von euch aufgestellt wurde.\r\n\r\nMöglicherweise könnte es mit dieser Modifikation Probleme geben, wenn andere Modifikationen die Schmiede und das Gerbgestell verändern. Zudem könnte es Probleme damit geben, wenn andere Modifikationen den Schlafenden Riesen im Flusswald verändern, da sich darin die erfahrende Jägerin befindet. Um diese Probleme zu umgehen, ladet diese Modifikation als letztes. (Leicht mit dem Nexus Mod Manager umzusetzen).\r\n\r\nDiese Modifikation wird Probleme mit anderen Modifikation haben, wenn diese das Angebot der Händler global verändern. Dies kann eine zu einem CTD (Crash to Desktop) führen. Ich, Dante2000, habe damit jedoch bisher keine Probleme gehabt.\r\n                            \r\n_____________________________________________________________________________________________________________________________________\r\n[center][size=5]PROBLEME UND LOESUNGEN[/size][/center]\r\n\r\nSollte sich Skyrim beim Starten, kurz vor dem Bethesda-Logo, aufhängen, stellt bitte sicher, das die \\\"update.esm\\\" aktiviert wurde.\r\n\r\nDiese Modifikation setzt keine Landmarken auf der Karte, so dass es am besten wäre, sich eine eigene Wegmarkierung zu seinem selbst erstellten Lager aufzustellen.\r\n\r\nSolltest du die Händlerin nirgends finden, starte Skyrim als Administrator, stelle sicher das diese Modifikation aktiviert ist und das PC am Ende der Laderereihenfolge steht.\r\n\r\n_____________________________________________________________________________________________________________________________________\r\n[center][size=5]MEINE ANDEREN UEBERSETZUNGEN[/size][/center]\r\n\r\n[center][size=4][url=http://skyrim.nexusmods.com/mods/38352/]RE - Real Estate[/url][/size][size=4] | [/size][size=4][url=http://skyrim.nexusmods.com/mods/42762/?tab=1&navtag=%2Fajax%2Fmoddescription%2F%3Fid%3D42762%26preview%3D&pUp=1]Highland Milk Farm[/url][/size][/center]\r\n",
  "categoryId": "27",
  "version": "3.00",
  "author": "Mcxar - DV von Dante2000",
  "createdUnix": "1330461960",
  "updatedUnix": "1373669460",
  "containsAdultContent": false,
  "uploadedBy": "Dante2000",
  "primaryFile": null,
  "files": [
    {
      "fileId": "38143",
      "name": "Portable Campsite - DV",
      "version": "2.50",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1296",
      "fileName": "Portable Campsite - DV-11589.zip",
      "uploadedUnix": "1330462065",
      "modVersion": "2.50",
      "virusScanUrl": "https://www.virustotal.com/file/ece7737e2a7a23336ce7f402b74bcf505e6decd88b27fa3f4b645089765af4bf/analysis/1406719827/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Portable%20Campsite%20-%20DV-11589.zip?fid=38143&ttl=1535772883&ri=8192&rs=8192&setec=0f523441d97f581226ffc42782e7124c"
    },
    {
      "fileId": "1000038620",
      "name": "Portable Campsite - DV",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1290",
      "fileName": "Portabl Campsite - German-11589-3-0.rar",
      "uploadedUnix": "1373669460",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/570a422e5ca0d0916d20197ce6e230a9204e09055d3a111575fbdfce4daf3179/analysis/1407641234/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Portabl%20Campsite%20-%20German-11589-3-0.rar?fid=1000038620&ttl=1535772884&ri=8192&rs=8192&setec=1536ae1fd7ae8ff80b5a8ca12fd0dd24"
    }
  ]
}