{
  "modId": 11604.0,
  "modName": "Rats and Other Critters",
  "summary": "Rats have been added to the game.",
  "descriptionHtml": "Rats, crabs, cats, and spiders can now be found in the game. They are essentially Skeevers, mudcrabs, sabre cats, and Frostbite spiders respectively, but scaled down and non-aggressive. Nothing special, just to add atmosphere to the game.\r\n\r\nMore critters will be added to the game later - if you have any suggestions for places to add them, let me know! Also, if anyone can make a more realistic cat model, or knows where to find one, it would be much appreciated.\r\n\r\nRevision 12, March 12 2012 - The issues with spiders making noise when they walk has been fixed! A big thanks to Nedius for the advice. I\\'ve added him as an NPC to the Old Hroldan Inn in return. Also, critters have been added to Riverwood and Dragon Bridge.\r\n\r\nRevision 11, March 2 2012 - Rats and cats have been added in Rorikstead. I\\'ve done my best to fix some of the issues, but I can\\'t seem to solve them for now.\r\n\r\nRevision 10, Feb. 28 2012 - Thanks to a comment on Skyrim Nexus, cats FINALLY can chase rats! It turns out I needed to actually place them in the town factions, rather than setting them to be allies. Also, critters have been added to the remaining hold capitals.\r\n\r\nRevision 9, Feb. 27 2012 - Critters have been added to Dawnstar. You can find rats, crabs, and cats on the docks, plus rats and spiders in the Dark Brotherhood Sanctuary. I\\'ve also put some rats and a single spider in the Riften sewers (how I missed this one, I\\'ll never know).\r\n\r\nRevision 8, Feb. 24 2012 - I\\'ve adjusted the speed and sounds of the critters in response to some comments. Now you can find critters in Solitude, in the market, the docks, and in Castle Dour Dungeon. This rounds out the large hold capitals.\r\n\r\nRevision 7, Feb. 23 2012 - Critters now drop appropriate items. Rats drop tails and whiskers, cats drop eyes and claws, crabs drop claws, and spiders drop eggs. Currently, the rat whiskers use the Canis Root model, as it was the closest thing I could think of. Rats and cats have been added to Whiterun - you\\'ll find them in the market and in the Dragonsreach Dungeon.\r\n\r\nRevision 6, Feb. 22 2012 - Fixed a few things. I deleted some critters I had placed in the Riften docks as seen from the city, since I didn\\'t realise those were only for distant renderings. I also got rid of the cat sound effect for now, as it seemed to be crashing my game (but I don\\'t know about you guys.) Critters have also been added to multiple buildings in Windhelm - you can find them in the Aretino Residence, the jail, and the warehouses outside the city, in addition to Hjerim before you buy it.\r\n\r\nRevision 5, Feb. 21 2012 (yes, I\\'m on vacation, why do you ask?) - You can now find cats and rats in Windhelm in the market and Grey Quarter, as well as rats, crabs, and cats on the docks outside Windhelm and Riften. New sounds have been added for cats and rats.\r\n\r\nRevision 4, Feb. 21 2012 - Markarth has been updated. You can find rats and cats in the marketplace, as well as rats and crabs on the docks. Rats have also been added to the Warrens and Cidhna Mine. In addition, I\\'ve added a new type of critter, spiders. Ordinarily I\\'d only have them in dungeons, since they don\\'t really fit in a town like rats do, but since Cidhna Mine has Frostbite spiders in the escape route, I thought it\\'d work. I\\'ve placed a handful of spiders around the Mine.\r\n\r\nRevision 3, Feb. 20 2012 - Cats and crabs have been added. Cats will eventually chase after rats, but I can\\'t find a way to do that without having other NPCs attack them. Additionally, I have added a few more rats to Riften, and some to the Riften jail - get arrested, and you may find yourself with a cellmate. Rats will now run away from the player. Thanks to everyone who contributed their ideas and advice!\r\n\r\nRevision 2, Feb. 18 2012 - Rats now have the AI package used by foxes, per suggestion. However, they don\\'t seem to be running away from people for me. I have also added rats (and lots of them) to the Ratway and the Ragged Flagon, since a place called the Ratway deserves to be teeming with rats. Suffice to say, the Flagon won\\'t be passing a health inspection any time soon.\r\n\r\nInitial Release - Several rats have been added to Riften, primarily around the docks and marketplace. After all, what\\'s a crime-ridden slum without a local rat infestation? \r\n\r\nKnown issues:\r\n* Yes, I know the miniature sabre cats don\\'t look like real cats, but right now there\\'s nothing I can do until someone comes out with a better cat model. If you can, let me know.\r\n* NPCs will react to cats chasing rats as if there\\'s a fight, although they won\\'t fight each other now. They will also pause over any dead rats. I\\'ve tried making it so that the rats\\' faction is opposed to all the towns and the cats are friends with them, but it isn\\'t changing.\r\n\r\nI can\\'t find a way to fix any of these, so any advice is welcome. If you tell me how to fix them, I\\'ll put you into the mod as an NPC to thank you.",
  "categoryId": "83",
  "version": "12",
  "author": "Captain Lhurgoyf",
  "createdUnix": "1330468596",
  "updatedUnix": "1331582371",
  "containsAdultContent": false,
  "uploadedBy": "CaptainLhurgoyf",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42728",
      "name": "Rats",
      "version": "12",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "73",
      "fileName": "Rats-11604-12.zip",
      "uploadedUnix": "1331582371",
      "modVersion": "12",
      "virusScanUrl": "https://www.virustotal.com/file/6d3ee1c2516bbdd6c3664476e13a746ee14f35c1fbc42f4760ef1ceb8f8e4773/analysis/1406745668/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rats-11604-12.zip?fid=42728&ttl=1535772900&ri=8192&rs=8192&setec=2c3b1a49e48425460d69241dfc94008d"
    }
  ]
}