{
  "modId": 11601.0,
  "modName": "Master Shape Shifter",
  "summary": "Master Shape Shifter is a mod that gives you over 167 different shape shifting spells.  You can literally shape shift into every single variation of monster you have ever seen in Skyrim as well as disguise yourself as a host of classes from many of the games NPC factions.",
  "descriptionHtml": "[img]http://static.skyrim.nexusmods.com/downloads/images/11601-1-1330468650.jpg[/img]\r\n\r\n[color=red][b]MASTER SHAPE SHIFTER v2.8[/b][/color]\r\n[url=http://www.youtube.com/watch?v=nIjRGd88mVM]Master Shape Shifter Gameplay Video[/url]\r\n\r\n[color=yellow][b]What is Master Shape Shifter?[/b][/color]\r\n\r\nMaster Shape Shifter is a mod that gives you over 167 different shape shifting spells.  You can literally shape shift into every single variation of monster you have ever seen in Skyrim as well as disguise yourself as a host of classes from many of the games NPC factions.\r\n\r\nUsing it is simple, you just run the autohotkey file in the background while you play the game.  At any moment, you can shape shift into whatever you want and with the tap of the F1 key, instantly transform back to your normal self.\r\n\r\nGetting the spells is equally as simple.  Just go to Lord Jared\\'s Hideout in Forsaken Cave (\\'coc unownedcell\\' in the console for those of you who are lazy) and look for the daedric worship shrine.  Once you find it, next to a bowl of bloody skulls, you\\'ll find a treasure chest.  Just open up the chest and take whichever polymorph tomes you want.  Once you read the tomes, you\\'ll know the spells.  You *can* use PSB to get the spells, but for some reason you will not be able to use the monster\\'s (dragon, afflicted and draugr) shouts until you go open the chest at least once.\r\n\r\n[color=yellow][b]What are the current known issues?[/b][/color]\r\n\r\n1. Shape-shifter blood is not compatible with vampirism.  Upon casting any of my polymorph spells, you will instantly be cured of vampirism.  I had to make this so because there was a nasty bug where, if you were a vampire, eventually you would shape shift yourself to death due to the health decrease penalty of vampirism.  If you would rather play as a vampire than over 167 different awesome forms, then do not download and play this mod.  \r\n\r\n2. If the included autohotkey program\\'s F1 feature doesn\\'t work for you, chances are you have a non-english standard keyboard and therefore missing a tilde key.\r\n\r\nIf this is the case, you are lucky because Paul92 kindly modified my autohotkey executable for use with German, Italian and Swedish keyboards!  Try whichever one you need and this should resolve your issue.  Big thanks to Paul92!\r\n\r\n[url=http://hotfile.com/dl/148719836/f71d758/Polymorph_German_.exe.html]German Autohotkey Program[/url]\r\n[url=http://hotfile.com/dl/148722247/0d3f18b/Polymorph_Italian.exe.html]Italian Autohotkey Program[/url]\r\n[url=http://hotfile.com/dl/148721616/8072ac1/Polymorph_Swedish_.exe.html]Swedish Autohotkey Program[/url]\r\n\r\n\r\n3. While all of the monster / animal transformation spells work perfectly to my knowledge, there is a certain bug with the NPC disguise spells and the shape-shift dremora spells.  When you shape shift back, you will return to whatever race you were when you last opened the chest full of polymorph tomes.\r\n\r\n[i]So there you have it.  Three bugs that I know of.  There are probably more small ones I haven\\'t discovered, but that\\'s just the way it is.  If you have a problem with any of these three issues, do not download and play this mod.[/i]\r\n--------------------------------------------------------------------------------足------------------------------\r\n[b]CHANGES & FIXES IN 2.8:[/b]\r\n--------------------------------------------------------------------------------足------------------------------\r\n- You no longer need to do any of the companion\\'s quests to get the spells. Just go to the forsaken cave and look for the door to \\'Jared\\'s Hideout\\'. Go through the bedroom and into the basement where there\\'s a shrine dedicated to the worship of Lord Dagon. In the chest next to a sacrificial bowl of bloody skulls, there will be all of the polymorph spell tomes. Take whichever ones you want.\r\n\r\n- A simple visual effect has been added for each polymorph spell.\r\n\r\n- Removed the limit of once per day for each of the shapeshifting spells.\r\n\r\n- Improved the custom dremora face texture.\r\n\r\n- You now take on the HP, magicka and stamina of each monster when you shape shift into it. \r\n\r\n- Your health now regenerates when polymorphed.\r\n\r\n- Fixed the bug where the monster\\'s visual effects would get stuck on your normal character.\r\n\r\n- The stats of each polymorphed monster will now increase with the player\\'s stats. This means that as you level up the HP, magicka and stamina of your main character, each of your polymorph forms will gain stat bonuses as well.\r\n--------------------------------------------------------------------------------足------------------------------\r\n[b]MASTER SHAPE SHIFTER MOD FEATURES:[/b]\r\n--------------------------------------------------------------------------------足------------------------------\r\n\r\n- Shape shift into ANY variation of any living thing you have ever seen in Skyrim\r\n- Have access to all new monster\\'s spells and weapons that you\\'ve never used before\r\n- Temporarily take on alliances with whichever faction of beast you are shape shifted into.\r\n- Kill whoever you wish without anyone knowing your true identity!\r\n- Shape shift into small unnoticeable creatures like a rabbit or a chicken to sneak past guards or other enemies.\r\n- Creatures and people will react differently to you based on the form you are in. For example, if you\\'re a giant most people and creatures will flee in terror upon seeing you.\r\n- Disguise yourself as any class (archer, battle mage, captain, etc.) of many factions in the game, from bandits to forsworn, and sneak past enemy lines.\r\n\r\n[color=yellow][b]Credits to Beta Testers[/b][/color]\r\n\r\nI\\'d like to give a huge thank you to the following beta testers.  Without them, this mod never would have been at the level of quality needed for a public release.\r\n\r\nElste17\r\nVoom101\r\nSpartan1849\r\nKridlekid\r\nSkyes666\r\nHejpadig\r\n\r\n[b]And a big thank you to those of YOU who endorse, support and vote for my mod.  Thank you.[/b]",
  "categoryId": "75",
  "version": "2.8",
  "author": "Jackalhead",
  "createdUnix": "1330467537",
  "updatedUnix": "1330998091",
  "containsAdultContent": false,
  "uploadedBy": "jackalhead",
  "primaryFile": null,
  "files": [
    {
      "fileId": "38687",
      "name": "Master Shape Shifter v2 83",
      "version": "2.8.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "50309",
      "fileName": "Master Shape Shifter v2 83-11601-2-8-3.rar",
      "uploadedUnix": "1330571234",
      "modVersion": "2.8.3",
      "virusScanUrl": "https://www.virustotal.com/file/4527310e99ff63baec244c5ed905537e5104e3f69dd2ccd7e9a2425c44cb37f3/analysis/1406722490/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Master%20Shape%20Shifter%20v2%2083-11601-2-8-3.rar?fid=38687&ttl=1535772896&ri=8192&rs=8192&setec=528cbb3bc3766fa31d88e6ba49c1c866"
    },
    {
      "fileId": "40610",
      "name": "Patch 1 84",
      "version": "1.8.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "223",
      "fileName": "Patch 1 84-11601-1-8-4.zip",
      "uploadedUnix": "1330998091",
      "modVersion": "1.8.4",
      "virusScanUrl": "https://www.virustotal.com/file/f0fc509512d726e3fee7045c741315af7a0d3f074a28ab90898148ebb799532b/analysis/1406733973/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%201%2084-11601-1-8-4.zip?fid=40610&ttl=1535772897&ri=8192&rs=8192&setec=c4cce860727dd9715cb3a7d69e057886"
    }
  ]
}