{
  "modId": 11623.0,
  "modName": "Spend Dragon Souls for Perks",
  "summary": "Spend Dragon Souls For Perks",
  "descriptionHtml": "(Show some love! Favorite & Thumbs up!)\r\n\r\nNew 3.0 Update video:\r\nhttp://www.youtube.com/watch?v=n-V3PoKVt7M\r\nConvert souls directly into perk points!\r\n\r\nCheckout the 2.0 Update Youtube video for more details.\r\nhttp://www.youtube.com/watch?v=pHcUclVVJH8\r\n\r\nCheck out the original YouTube video to see it in action with commentary.\r\nhttps://www.youtube.com/watch?v=rXy__9IQoeQ\r\n\r\nA Mod designed to allow the spending of Dragon Souls for Perks.\r\n\r\n* Does NOT require any script extenders. *\r\n\r\n- Adds \\\"Dragon-Stones\\\" North-East of Riverwood.\r\n- Adds a Map-Marker for fast traveling to the stones.\r\n- Spend Dragon Souls for stat upgrades.\r\n- Spend Dragon Souls To Recieve Perks.\r\n- Stronger Perks Cost More Dragon Souls.\r\n- This is now completely configurable by the user.\r\n- Will Not Recognize Perks Added Through Mods. (Use your real perk points for those.)\r\n\r\nRevision Log:\r\nV 1.0:\r\nInitial Realease\r\nV 1.1: \r\nAdded \\\"Extra Pockets\\\" Perk. (Forgot that one somehow...)\r\nRenamed Stones, per user request.\r\nAdded Instructions at the \\\"Dragon-Stones\\\", per user request\r\nV 1.2:\r\nFixed Alchemy 3 not showing up\r\nV 1.3:\r\nWorked on bugged Pickpocket Tree (May still be bugged, waiting on feedback)\r\nV 1.4:\r\nFixed Pickpocket bugs!\r\nMoved Dragon Stones. North-East of Riverwood. No quests required, no main story progression required. Map Marker available from start.\r\nAdded cost of souls to every option.\r\nAdded sounds.\r\nV 1.5:\r\nFixed Smithing bugs.\r\n\r\nv 2.0\r\nAdded base stat increase options (Health, Magicka, & Stamina)\r\nHUGE re-write of scripts to allow user-configurable perk costs!\r\nV 2.1\r\nFixed bug where increasing stamina didn\\'t add to carrying weight.\r\n\r\nTO DO LIST:\r\n.....\r\n\r\n\r\nFAQ:\r\n\r\n\\\"Did the Soul-Cost change on the lowest tier perks\\\"\r\nYes, with the 2.0 update, one of the cost-configure options is \\'half cost\\'. Because papayrus rounds down its decimals, this made perks that cost 1 Soul free. Because of this, the minimum was changed to 2 souls.\r\n\r\n\\\"This seems unfair\\\" / \\\"This seems like cheating\\\"\r\nDragon Souls give the player power in the form of shouts. I simply extended the idea to include perks. I designed this mod to be able to progress with new characters from scratch as they develop. It also works with high level characters who have a storage of souls. I thought it was silly that once every \\'word\\' is learned that Dragon Souls have no purpose. The cost is balanced in that low tier perks are cheap, and high tier perks are expensive. Also, it\\'s up to the player to determine how they play...\r\n\r\n\\\"I don\\'t like where the stones are\\\"\r\nI struggled with where to place these. In the end, I settled for somewhere that was open and obvious.\r\nTo comply with players who don\\'t want to go through the main quest to reach them, they have been moved. A Map Marker is available North-East of Riverwood.\r\n\r\n\\\"Now I can\\'t absorb Dragon Souls\\\"\r\nThat has nothing to do with this mod. This mod does not alter how players interact with dragons.\r\n\r\n\\\"Why can\\'t we just have perk points\\\"\r\nWithout using a script extender, that is not possible. I wrote this mod specifically so script extenders would not be needed.",
  "categoryId": "73",
  "version": "3.0",
  "author": "darkseraphim85",
  "createdUnix": "1330488490",
  "updatedUnix": "1330488490",
  "containsAdultContent": false,
  "uploadedBy": "DarkSeraphim85",
  "primaryFile": null,
  "files": []
}