{
  "modId": 11630.0,
  "modName": "Improved Interior Lighting",
  "summary": "Updates certain interior spaces with more realistic lighting to better mimic ambient lighting caused by smaller enclosed spaces. Also adds a few personal stylistic alterations to improve realism based on various environmental factors.  Requires Pluto\\'s Realistic Lighting Mod.",
  "descriptionHtml": "Updates certain interior spaces with more realistic lighting to better mimic ambient lighting caused by smaller enclosed spaces. Also adds a few personal stylistic alterations to improve realism based on various environmental factors.\r\n\r\n[b]REQUIREMENTS[/b]\r\nThis mod is intended to be used with the mod \\\"Realistic Lighting\\\" by Pluto (aka kurtcop) found here: http://steamcommunity.com/sharedfiles/filedetails/?id=7648&searchtext=realistic+lighting\r\n(also found on Skyrim Nexus here: http://skyrim.nexusmods.com/downloads/file.php?id=7654)\r\n\r\nI have tested this mod without Realistic Lighting, and it works just fine without it. However, the visuals will not be quite what I intended. Overall, you\\'ll be seeing a much lighter and brighter version of the affected interiors, and things will be a bit washed out. I highly recommend picking up the Realistic Lighting Mod to fully enjoy this!\r\n\r\nI have enjoyed Realistic Lighting mod very much, however, I\\'ve always felt he took things a little too far with reducing the ambient light throughout the game. I think it works fine in the exteriors, but in several interior spaces the lighting feels far too harsh. In real life, when light is in an enclosed space, it bounces around off surfaces a lot more, creating much softer shadows and more ambient lighting than what is reflected in-game with Pluto\\'s mod.\r\n\r\nThis mod aims to fix some of these areas and create a more realistic feel. The first pass of this mod fixes the ever-popular Breezehome. Future updates will improve upon further interior areas based on my own personal priority (expect Honeyside to be coming soon!).\r\n\r\nIn general, expect ambient lighting to be a tad brighter, slightly more diffused, windows will generally emanate light as if light is really shining through them from the outside, as well as a few of my own personal artistic touches to certain areas (such as the light beams seen in Breezehome\\'s bedroom).\r\n\r\nPlease keep in mind, this is not a world-wide alteration, but a built-by-hand, per-area, alteration. Currently the only area affected by this mod is Breezehome.\r\n\r\n[b]INCOMPATIBLE MODS[/b]\r\nPlease be aware, the following mods are known to modify the lighting in areas affected by this mod. As a result, buggy lighting and strange results unintended by this mod WILL occur. I highly suggest you run this mod without any lighting mods that modify individual lighting in the affected areas.\r\n\r\n-More Dynamic Shadows (It will work, but the lighting will not match up with what\\'s in the screenshots and buggy visuals may occur).\r\n-Any mod that alters lighting in Breezehome & Honeyside (and soon more)\r\n\r\n[b]OTHER NOTES:[/b]\r\n-I plan on releasing this mod to Skyrim Nexus after more work has been completed and it\\'s a bit more fleshed out.\r\n-If you are not used to using the realistic lighting mod, and install both Pluto\\'s mod and mine at the same time, you\\'ll undoubtedly notice that several areas are far darker than normal. This is due to Pluto\\'s Realistic Lighting Mod, not mine. Mine aims to lighten up his mod and fix *some* of those very dark areas. In short, his darkens, mine lightens. :-)\r\n\r\n----------------\r\nChange Log\r\n----------------\r\n\r\n[b]Current Version:[/b]\r\nv1.8 - Riverwood: Sleeping Giant Inn Updated\r\n-Increased amount of sunlight pouring into the main room during the day.\r\n-Added a few shadow casting lights to certain areas.\r\n-Greatly increased the radius of existing shadow-casters\r\n-Added some day/night cycles to certain lights where sunlight shone through.\r\n\r\nPrevious Versions:\r\nv1.6 - Breezehome Updated\r\n-Increased overall level of light throughout the house.\r\n-Fixed a few lights that were appearing to light the room but didn\\'t properly light the character\r\n-Removed two lights that became unnecessary.\r\n-Optimzed performance for better framerates.\r\n\r\nv1.5 - Honeyside\r\n-Added day/night lighting in the kitchen/entry area coming from windows. During the day this area is now flooded with light. At night, its primary light source is from the cooking fire - with reduced diffusion of light coming from the windows.\r\n-Brighened several extremely dark areas in the bedroom and basement. Attempted to lighten these areas while maintaining the original light sources by simulating a more realistic diffiusion of light throughout the room.\r\n-No longer will you have to use a torch to view your weapon rack downstairs.\r\n-Significant fine-tuning of every single light in Honeyside.\r\n\r\nv1.0 - Initial Release: Breezehome\r\n-Added several lights, removed a few, tweaked many others.\r\n-Fixed strange, unrealistic light leaks in the alchemy room.\r\n-Added sunlight filtering through various windows and holes in the ceilings.\r\n-All sunlit areas are tied to the time of day and will shine bright during the day and dim at night (see screenshots for day/night comparisons).\r\n-Fixed several buggy light situations throughout the house where lights would randomly blink on/off.\r\n-Added several light rays filtering through cracks in the ceiling (particularly in the bedroom). These will shine bright during the day and less-so during the night. Someone needs to get a better roof on this house - too many holes! (Perhaps that\\'s why it\\'s called Breezehome?)\r\n-Adjusted general ambient lighting throughout. Tried to soften up several darker areas and lighten the darkest areas up just a tad. No more Lydia sitting in dark shadows!\r\n\r\nCheck out the screenshots for further details. Unless labeled as \\\"Vanilla\\\" or \\\"Realistic Lighting Mod Only\\\" the screenshots display what you should see. The ones labeled are for comparison only. Many show comparisons between day & night. A picture says a thousand words! As always, I look forward to feedback and constructive criticism. Most importantly - ENJOY!",
  "categoryId": "62",
  "version": "1.8",
  "author": "David Vasquez",
  "createdUnix": "1330494562",
  "updatedUnix": "1330494562",
  "containsAdultContent": false,
  "uploadedBy": "KnightshadeVK",
  "primaryFile": null,
  "files": []
}