{
  "modId": 11664.0,
  "modName": "Dovahkiins Bedroom",
  "summary": "The Dovahkiin&#39;s Bedroom is a livingspace fit for the Dragonborn.",
  "descriptionHtml": "[url=http://skyrim.nexusmods.com/mods/10342][img]http://i1263.photobucket.com/albums/ii630/DovahkiinsWarehouse/DWB%20Logos/DWBLogo295_zpsi5ny8bmk.jpg[/img][/url][img]http://i1263.photobucket.com/albums/ii630/DovahkiinsWarehouse/DWB%20Logos/SexyMannLogo295_zps00jhq6ux.jpg[/img][url=http://skyrim.nexusmods.com/mods/32878][img]http://i1263.photobucket.com/albums/ii630/DovahkiinsWarehouse/DWB%20Logos/DWBArmoryLogo295_zpslkvpm3pe.jpg[/img][/url]\r<br />[img]http://i1263.photobucket.com/albums/ii630/DovahkiinsWarehouse/Sexy%20Mannequins/SexyMannequinsTitle900_zpssxxxugco.png[/img]\r<br />[img]http://i1263.photobucket.com/albums/ii630/DovahkiinsWarehouse/Sexy%20Mannequins/SexyMannTitle001_zpsushk91tl.jpg[/img]\r<br />[img]http://i1263.photobucket.com/albums/ii630/DovahkiinsWarehouse/Sexy%20Mannequins/Vyktor%20Nexus445_zpsdqf2qp17.jpg[/img][img]http://i1263.photobucket.com/albums/ii630/DovahkiinsWarehouse/Sexy%20Mannequins/Vyktoria%20Nexus445_zpsrirgyx7l.jpg[/img]\r<br />\r<br />[color=RoyalBlue][size=5][b] DESCRIPTION: [/b][/size][/color]\r<br />[size=4][color=lightblue]\r<br />Sexy Mannequins are skinned and attractive mannequins to replace the wooden mannequins in the game.  You can now choose the collection of female models or you can separately choose the male model, Vyktor or the female model, Vyktoria. The mannequin model(s) you choose will replace all of the vanilla mannequins in the game. If you choose the collection, the six models will be randomly selected by the game.  There is no user control over who gets selected where or in what order.  There is now also a version of the female collection that works with Hearthfire.  Don&#39;t load it if you don&#39;t have Hearthfire as it will prevent the game from running if you do.  These are simple replacements of the vanilla mannequins and nothing more.  I created them at the special request of users of my other mod, [/color][/size][url=http://skyrim.nexusmods.com/mods/10342][color=yellow][size=5][b]Dovahkiin&#39;s Warehouse and Bedroom[/b][/size][/color][/url][color=yellow][size=5][b],[/b][/size][/color][size=4][color=lightblue] who were seeking a simple option to replace the ugly vanilla mannequins.  They don&#39;t do anything special except stand there (mostly) and look pretty.  As far as I know they don&#39;t provide any miracle cures for the various mannequin bugs such as moving mannequins or naked mannequins. On the other hand, there are no fancy new scripts or special new functions to mess up your game either. \r<br />\r<br />The files no longer include the [url=http://skyrim.nexusmods.com/downloads/file.php?id=10652]Vanilla Mannequin Script Fix[/url] as there have been continuing complaints about CTDs on entering various locations - most notably the castle in Dawnguard, Hjerim and now Leveler&#39;s Tower and there may be others.  I suspect it has more to do with some problem with the mannequins in those locations, but it is still a problem.  If you still want the script, you can either keep the prior version of Sexy Mannequins as that is the only change, or go load it from the link above.  Loading the original script separately is probably the better approach as you will then have access to the most up to date version.  I am still going to use it as I don&#39;t need access to the problem locations and I have found it to be a very helpful tool for managing a large number of mannequins.  \r<br />[/color][/size]\r<br />[color=RoyalBlue][size=5][b] VYKTORIA: [/b][/size][/color]\r<br />[img]http://i1263.photobucket.com/albums/ii630/DovahkiinsWarehouse/Sexy%20Mannequins/Vyktoria%20Glamour900_1_zpsl88gzddu.jpg[/img]\r<br />[size=4][color=lightblue]\r<br />Vyktoria comes with no custom meshes or texures. If you like the look in the pictures and you want her to look the same, you will need to install the following mods:\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/2666]Calientes Female Body Mod Big Bottom Edition -CBBE- by Caliente[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/2812]Better Females by Bella by BellaGail[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/9249]Improved Eyes Skyrim by missjennabee[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/1167]Pretty Lips by Danariel[/url] and\r<br />[url=http://skyrim.nexusmods.com/mods/5564]a little sexy apparel replacer - for CBBE - by Cotyounoyume[/url]\r<br />\r<br />If you prefer a different look, she also looks great with the other good face and body mods that are available.  And you can use any combination that you like best.\r<br />[/color][/size]\r<br />[color=RoyalBlue][size=5][b] VYKTOR: [/b][/size][/color]\r<br />[size=4][color=lightblue]\r<br />Vyktor comes complete with the underwear non-nude)version of:\r<br /> [url=http://skyrim.nexusmods.com/mods/2488]Better males - Beautiful nudes and faces - New hairstyles by Chris57 and FavoredSoul[/url][/color][color=LightBlue]\r<br /> who have graciously granted permission to the modding community to use their files. If you like it be sure and visit their site and endorse the mod.  I included the textures more specifically for my Steam friends who do not want to download the mod from Nexus.  It seems to make sense as the whole purpose of the mod is to look better than vanilla.  \r<br /> [/color][/size]\r<br />[color=RoyalBlue][size=5][b] INSTALLATION: [/b][/size][/color]\r<br />[color=LightBlue][size=4]\r<br />I strongly suggest you use the Nexus Mod Manager to download and install Sexy Mannequins.  If you absolutely insist on doing it manually, unpack the contents of the rar file into the Skyrim/Data directory.  You should have two files - an esp and a bsa called either Mannequin_Male_Viktor or Mannequin_Female_Vyktoria. Be sure and check the mod in the game launcher and you are done. All required meshes, scripts and textures are contained in the bsa file so there is nothing else to do. You can easily switch between them by selecting the desired model in the launcher.\r<br />[/size][/color][color=red][size=5][b]\r<br />If you installed both models, remember you can only use one at a time.\r<br />[/b][/size][/color]\r<br />[color=RoyalBlue][size=5][b] KNOWN ISSUES: [/b][/size][/color]\r<br />[color=LightBlue][size=4]\r<br />You can download both models, but you can only run one at a time as they would naturally conflict with each other.  They may also conflict with any other mod that makes changes to the vanlilla mannequins.  I recognize that the game has a number of issues with Mannequins.  Sexy Mannequins contain nothing special to fix those bugs.  I am not saying they will behave any better than vanilla, but they will look better.  If you don&#39;t want any of the meshes, textures or scripts included in the mod, you can install anything you prefer into approprate meshes, textures and scripts directories and it will override the ones in the bsa files.\r<br />\r<br />There have been some comments that the mod may not be compatible with Hearthfire, which is not entirely correct.  The mannequins in Hearthfire are not actually vanilla mannequins, so the Sexy Mannequins mod does not affect them and they remain the ugly wooden models.  I will probably not take the time to create an entirely separate mod just for the six mannequins in Hearthfire.  If you are using Hearthfire, you should still be able to use Sexy Mannequins, just don&#39;t expect the mannequins in Hearthfire to be Sexy Mannequins.\r<br />  \r<br /> [/size][/color]\r<br />[color=RoyalBlue][size=5][b] UNINSTALLATION: [/b][/size][/color]\r<br />[color=LightBlue][size=4]\r<br />Use the Nexus Mod Manager to uninstall if you used it to install.  Otherwise, simply uncheck the mod in the data window of the laucher. To remove it completely, delete the esp and the bsa files that were installed during the installation.\r<br />[/size][/color]\r<br />[color=RoyalBlue][size=5][b] NOTE: [/b][/size][/color]\r<br />[color=LightBlue][size=4]\r<br />Sexy Mannequins is in no way associated with horrorview and his great mods - [url=http://skyrim.nexusmods.com/mods/7059]Sexy Whiterun[/url], [url=http://skyrim.nexusmods.com/mods/7241]Sexy Riften[/url], [url=http://skyrim.nexusmods.com/mods/7178]Sexy Windhelm[/url], [url=http://skyrim.nexusmods.com/mods/12308]Sexy Solitude[/url], [url=http://skyrim.nexusmods.com/mods/7484]Sexy Winterhold College[/url] and [url=http://skyrim.nexusmods.com/mods/7583]Sexy Villages and Towns[/url].  Please go check them out as they definitely make huge portions of the game much better.  In fact, his Sexy Whiterun textures can be seen in many of my screenshots.\r<br />\r<br />And don&#39;t forget to check out the [/size][/color][url=http://skyrim.nexusmods.com/mods/10342][color=yellow][size=5][b]Dovahkiin&#39;s Warehouse and Bedroom[/b][/size][/color][/url][color=yellow][size=5][b].[/b][/size][/color][color=lightblue][size=4]  It is a great place to display your new mannequins. [/size][/color] ",
  "categoryId": "68",
  "version": "0.1Beta",
  "author": "ch0k3h0ld",
  "createdUnix": "1330530523",
  "updatedUnix": "1330530726",
  "containsAdultContent": false,
  "uploadedBy": "ch0k3h0ld",
  "primaryFile": null,
  "files": [
    {
      "fileId": "38463",
      "name": "DovakiinsBedroom",
      "version": "0.1Beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28",
      "fileName": "DovakiinsBedroom-11664-0-1Beta.rar",
      "uploadedUnix": "1330530726",
      "modVersion": "0.1Beta",
      "virusScanUrl": "https://www.virustotal.com/file/0fc8398f4315795854fd8d08b8c4aed9f3cf99b627b46de4b9666d75585576d3/analysis/1406721362/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DovakiinsBedroom-11664-0-1Beta.rar?fid=38463&ttl=1535773011&ri=8192&rs=8192&setec=2e2ee0c152a3799eac89a170e94aa63c"
    }
  ]
}