{
  "modId": 11680.0,
  "modName": "Psiijic Teleport Spells - Traduzione Italiana",
  "summary": "This is only a translation into Italian of the original mod.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/downloads/file.php?id=8535] Psiijic Teleport Spells [/url].\r\nThe original mod adds 4 new spells: Blink, Teleport, Omnipresence and ShadowStep.\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size][/center]\r\n\r\n[color=GREEN][b]DESCRIZIONE[/b][/color]\r\nQuesta mod aggiunge 4 nuovi incantesimi. Baleno, Teletrasporto, Omnipresenza e Passo D\\'Ombra.\r\n\r\nFAQ:\r\n\r\nD: Dove posso trovarli?\r\nR: Gli incantesimi si apprenderanno leggendo il tomo: I Segreti Del Teletrasporto. Una copia del libro può essere trovata sul tetto degli Alloggi dell\\'ArciMago, l\\'area sarà accessibile solo dopo aver completato le quest dell\\'Accademia. Altrimenti potrete trovarne una copia seguendo degli indizi sparsi per l\\'Accademia. L\\'incantesimo Passo D\\'Ombra invece sarà reperibile in entrambi i Santuari della Confraternita Oscura.\r\n\r\nD: Come funziona \\'Baleno\\'?\r\nR: Se lanciato in combattimento vi ruoterà di 180 gradi. Usare questo incantesimo non vi garantirà un atterraggio sicuro, e potreste avere dei danni.\r\n\r\nD: Come funziona \\'Teletrasporto\\'?\r\nR: Funziona come un incantesimo di evocazione, con la particolarità che evocherete voi stessi. Le vostre eventuali evocazioni spariranno una volta usato\r\nl\\'incantesimo. Diversamente da Baleno ed Omnipresenza, Teletrasporto vi porterà sempre in un posto sicuro.\r\n\r\nD: Come funziona \\'Omnipresenza\\'?\r\nR: Simile a Baleno. Omnipresenza comunque ha un costo di Magicka, basata sulla distanza alla quale vorrete essere trasportati e non funzionerà se non\r\navrete abbastanza Magicka. A 100 di abilità di Alterazione potrete muovervi di 3 piedi usando un punto di Magicka. Per raggiungere la distanza massima richiederà\r\n700 punti Magicka. Per evitare la morte \\'da caduta\\' sarete invulnerabili ai danni per 5 secondi dopo l\\'uso dell\\'incantesimo. A causa della sua distanza massima raggiungibile\r\nè utilizzabile solo dov\\'è utilizzabile il Fast Travel. E\\' altamente raccomandato di non usare l\\'incantesimo nelle maggiori città.\r\n\r\nD: Come funziona Passo D\\'Ombra?\r\nR: Lanciatelo su qualcuno ed apparirete alle sue spalle. Se non sarete visibili al bersaglio, l\\'incantesimo vi camufferà, rendendovi invisibili per 2 secondi. Passo D\\'Ombra ha un tempo di carica lungo, per scoraggiarne l\\'uso in combattimento.\r\n\r\nD: Qual\\'è la distanza massima?\r\nR: Per Baleno è 200 piedi. Per Teletrasporto 700 e per Omnipresenza 2000 piedi. Teletrasportarsi su lunge distanze darà luogo ad una schermata di caricamento\r\ne potreste ritrovarvi di fianco ad un Gigante!\r\n\r\nD: Alle volte Baleno e Teletrasporto non funzionano, perchè?\r\nR: Quando usi Baleno, l\\'incantesimo manca la superficie mirata. Quando usi Teletrasporto, il gioco non riesce a trovare un valido punto d\\'atterraggio, quindi non vieni teletrasportato del tutto.\r\nQuesto generalmente accade quando si cerca di teletrasportarsi sopra rocce o edifici. Baleno non è soggetto a questa regola e può essere usato per accedere ai tetti degli edifici.\r\n\r\nD: Può il Perk - Evocatore, incrementare la distanza massima raggiungibile teletrasportandosi?\r\nR: No.\r\n\r\n[color=GREEN][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n[color=GREEN][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!",
  "categoryId": "75",
  "version": "4.4.3",
  "author": "Andre7890",
  "createdUnix": "1330537142",
  "updatedUnix": "1330537142",
  "containsAdultContent": false,
  "uploadedBy": "Andre7890",
  "primaryFile": null,
  "files": []
}