{
  "modId": 117.0,
  "modName": "Elder_Scrolls_ScreenShot_Manager",
  "summary": "Automatically grabs your screen shots and places them in the familiar \\\"My Games\\\" folder for easy location.",
  "descriptionHtml": "--------------------------------\r\nElder Scrolls ScreenShot Manager\r\n--------------------------------\r\nAuthor: GuruSR\r\nVersion: V1.0\r\nClass: Tools -> Miscellaneous\r\nDate: November 13, 2011\r\n\r\n----------------\r\nRequirements:\r\n----------------\r\nRequires any of the following: Morrowind, Oblivion and Skyrim\r\n\r\n----------------\r\nPreface\r\n----------------\r\nThis software will convert your ScreenShots into JPEGs, stored in the Game\\'s \\\"My Games\\\" folder under \\\"Screen Shots\\\", it beats sifting through hundreds of shots looking for the ones you want (because you forgot what day you did them on).\r\n\r\n----------------\r\nDescription:\r\n----------------\r\nThis program runs silently in the background (on IDLE priority, this *IS* important), will eventually empty out all those nasty \\\"ScreenShot#.bmp\\\" files out of your game folder(s), leaving a copy in where your Game\\'s \\\"My Games\\\" folder is.  Inside there will be \\\"Screen Shots\\\".  Inside there will be all of your Screen Shots, neatly jpeg\\'ed and date/time formatted.  It\\'s capable of 1 million ScreenShots per minute (like anyone wants to hold their key down THAT long).  Game performance shouldn\\'t be affected at all, or only slight or minor studdering, your system performance may vary after the screenshot happens, your game may also say \\'ScreenShot0.bmp\\' a lot, this can be normal.\r\n\r\n----------------\r\nInstallation:\r\n----------------\r\nRun the installer and follow the instructions.\r\n*IF* you were a user of Oblivion SS Manager, this superseeds that version.  Run the Configuration program, if it tells you to uninstall OBSSMGR, please do so at that time, you can safely start the new version as it will also make sure the old one isn\\'t running.\r\n\r\n----------------\r\nUsage:\r\n----------------\r\nThe Configuration window is new, offers basic controls:\r\n. Manager status (running or not) and the ability to start/stop it.\r\n. Quality slide bar.\r\n. Ability to toggle whether or not the Manager starts when you log into Windows.\r\n. View status on current games.\r\n. View notices pre-programmed into the Manager.\r\n\r\nThis program runs until you shut the machine down or Log Out, sits at IDLE priority and only does something when one of the game folders for any of the games gets a new file.  Typical CPU usage during all idle operation 0%, typical during saving a ScreenShot 0% to 1%.  In most cases, you blink, you miss it.\r\n\r\n\r\n----------------\r\nWARNINGS:\r\n----------------\r\n1.)  TESNexus is the ONLY authorized place to download this software, if you downloaded it from somewhere else, UNINSTALL, DELETE the download, get onto TESNexus for the REAL program!\r\n2.)  The software now knows about the UAC (User Access Control) which is part of Vista and Windows 7.  If any of the games was installed within the standard \\\"Programs Folder\\\", the UAC will not allow ScreenShots to be stored there, they will be stored in the UAC\\'s \\\"Virtual Storage\\\".  If this happens, and it\\'s not showing any of your screen shots in the My Games folder, simply run the Configuration and Stop the Manager, then Start it again, it\\'ll pick up that the UAC interfered with them and will know about this from this point on (this will only happen on first time usage).\r\n3.)  Games typically should never be installed in the \\\"Program Files\\\", but in another spot, perhaps \\\"C:\\\\Games\\\" would be better.  This way, the UAC will not interfere with the game\\'s operation.\r\n4.)  Steam installs will install the game within Steam\\'s \\\"common\\\" application folder, again, Steam should never be installed in the \\\"Program Files\\\" folder that it defaults to.\r\n\r\n----------------\r\nUninstalling:\r\n----------------\r\n(Like anyone is GOING to do this)\r\nThe Program\\'s Startmenu folder has a link to uninstall, also \\\"Add/Remove Programs\\\" (for Pre-Vista) or \\\"Programs & Features\\\" (Vista and beyond) will have it listed for removal.  *Before* Uninstall, Run the Configuration program and stop the Manager if it is running.\r\n\r\n----------------\r\nVersion History:\r\n----------------\r\n1.0\r\n- Initial Release:  Should work flawlessly, as this is pre-designed code from one of my other programs that is rock stable (runs on a server and has been for 4 years+).\r\n\r\n----------------\r\nCredits:\r\n----------------\r\nMe, for getting the coding done.\r\nMyself, for bug testing and yelling about them.\r\nI, for coffee runs...  COOOFFFFEEEEE!!!!\r\n\r\n----------------\r\nContact:\r\n----------------\r\nContact me either on TES Nexus (GuruSR) or on BethSoft\\'s forums (GuruSR).",
  "categoryId": "39",
  "version": "1",
  "author": "GuruSR",
  "createdUnix": "1321192157",
  "updatedUnix": "1321192157",
  "containsAdultContent": false,
  "uploadedBy": "GuruSR",
  "primaryFile": null,
  "files": []
}