{
  "modId": 11712.0,
  "modName": "Helgra the Faithless - Draugr Femme Fatale",
  "summary": "Adds a reather unique lady to Skyrim, nothing you would have never seen before.",
  "descriptionHtml": "So you spent half the day down some dusty old Nordic Ruin, hacking, bone smashing and  Fus-Roh-Daing many Draugr and Skeletons, so on your usual route back home traveling with , hmmm lets say Lydia as she seems to be the Skyrim fanboy favorite...\r\n\r\nYour travels take you to Falkreath, home of the biggest boneyard in Skyrim where many a necromancer wet dream begins, along the road, just outside the town limits, sits a house that you failed to notice before. \r\n\r\nYou proceed to check it out and as you approach the front door, a most unexpected sight occures....\r\n\r\nA Draugr opens the door and lets it pet cat out!! You suddenly draw your... what ever weapon or spell you use and take a deep breath to Fus-Roh-Dah but you then notice that this Draugr is by no means attacking you and asks you \\\"What are you doing?\\\"\r\n\r\nShe then dismisses it as nonsense and invites you in for a meal and mead as she sees you have been busy adventuring. \r\n\r\nYou think, \\\"what the heck, Ive already seen a ton of wired shit like a big bad Emo Dragon guy, tea with a crusty long dead chick souldnt be much different.\\\"\r\n\r\nAs she pours you a cup of mead, she mentions her name is Helgra.\r\n\r\nHelgra the Faithless\r\n\r\n[img]http://static.skyrim.nexusmods.com/downloads/images/11712-1-1330552994.jpg[/img]\r\n\r\n[youtube]GJ2noz4-BBM[/youtube]\r\n\r\nThis mod adds a new female Companion in the guise of a Draugr lady!\r\n\r\nShe is fully Thu\\'um activated, has a big chopping head Axe and also likes to drain the life out of people.\r\n\r\nI did this as I was inspired by Herman the kooky Draugr companion as its the most interactive companion mod I see so far! I love Herman but felt his dusty old self needed some lady company that was similar to his own condition. \r\n\r\nPlus I thought we needed more veriaty of people to Marry. Lets marry our Ancestors!! \r\n\r\nHelgra has her own non-replacer gear and her own generic house for you to make use of if you decide to marry her. \r\n\r\nI need to fully test it but the whole basic marriage package should work but she is limited to just wandering your house/her house due to restricting animations of Draugrs \r\n(She won\\'t sit down, sleep, eat or what ever)\r\n\r\nHelgra wont open up a shop neither as that is too complex for me for now but will cook for you.\r\n\r\nI am unsure if anybody wants to eat a meal cooked by a 1000 year old corpse though.\r\n\r\nFind her house West of Falkreath (check images.)\r\n\r\n\r\n",
  "categoryId": "66",
  "version": "1",
  "author": "beth",
  "createdUnix": "1330552915",
  "updatedUnix": "1330556402",
  "containsAdultContent": false,
  "uploadedBy": "nofear88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "38620",
      "name": "Helgra v1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21",
      "fileName": "Helgra v1-11712-1.rar",
      "uploadedUnix": "1330556402",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/8aba6329fdd8e77962410fa1386b5495063ac16b765e3e599afa69aa1efe93fe/analysis/1406722154/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Helgra%20v1-11712-1.rar?fid=38620&ttl=1535773086&ri=8192&rs=8192&setec=1dddeff8cf7ba78ebb3aec8dea08ff9a"
    }
  ]
}