{
  "modId": 11721.0,
  "modName": "MoM - Mastery of Magicka",
  "summary": "Experience a new way of mastering the power of Magicka and learn new useful and powerful spells.",
  "descriptionHtml": "[center][img]http://i1241.photobucket.com/albums/gg507/SkyDreamer7/Nexus%20Things/MoMBanner.png[/img][/center]\r\n[b][size=4]___________\r\n¯¯¯¯¯¯¯¯¯¯¯\r\nIndex\r\n______________\r\n¯¯¯¯¯¯¯¯¯¯¯¯¯¯[/size][/b]\r\n\r\n1 | Purpose of the mod\r\n2 | What it does?\r\n3 | Options\r\n4 | How to get this to work (or not)\r\n5 | Compatibility and Issues\r\n6 | Disclaimers\r\n7 | Changelog\r\n\r\n[b][size=4]________________________\r\n¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯\r\n1 | Purpose of the mod\r\n___________________________\r\n¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯[/size][/b]\r\n\r\nMagic in Skyrim is fine. It is not bad, by any means. But the problem is just that, it is fine, not good, nor great. When you acquire a perk like Apprentice Destruction you are just capable of casting some spells for longer times. That does not make you feel more powerful, that is not the vision I have of a powerful mage...\r\n\r\nThe purpose of Mastery of Magicka is to make magic great and provide a different experience when casting spells in Skyrim. You will cast less spells, but when you do, they will have a greater impact. A mage may start slow, with lesser spells, but once he reaches deeper understandings of Magicka, his spells will be a powerful display of magical prowess.\r\n\r\nSome of the features of the mod are:\r\n\r\n- Mastery perks scale power or duration of spells\r\n- Revisited, reworked and all new perks for all schools of Magic\r\n- Diversified and balanced existing spells\r\n- New interesting spells\r\n- Fixes for spells and perks\r\n- Alchemy and Enchantment overhauls to balance power\r\n\r\nAll of this will follow as close as possible the existing magic system convention in Skyrim. Less \\\"tiered\\\" spells and more varied effects, without emulating unique shouts. Also, many effects from previous The Elder Scrolls games spells will make a return, in a form or another.\r\n\r\nReady your spells, start mastering magic!\r\n\r\n[b][size=4]___________________\r\n¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯\r\n2 | What it does?\r\n______________________\r\n¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯[/size][/b]\r\n\r\nIt introduces many changes to both spells and perks. Some general changes, such as dual casting, magicka regeneration and tweaked spells cost are also present to have a more enjoyable experience.\r\n\r\nNew spells are introduces via spell tomes, just like normal spells, that you will find at appropriate merchants.\r\n\r\nAlchemy has been rebalanced to work better with the changes of power in the mod. Additionaly now there are enhanced ingredients that create more powerful potions and poisons.\r\n\r\nEnchanting has been reworked completely to balance not only the magic aspect of the game, but the overall gameplay.\r\n\r\nSince the mod removes some perks and add some new ones, and the Enchantment overhaul was meant to rebalance every enchantable equipment, I strongly recommend to start a new game when using this mod.\r\n\r\nThat said, every change is included in the file in the Read Me tab and an extensive, easy to navigate spreadsheet is present in the Documentation folder of the archive.\r\n\r\n[b][size=4]_____________\r\n¯¯¯¯¯¯¯¯¯¯¯¯¯\r\n3 | Options\r\n________________\r\n¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯[/size][/b]\r\n\r\nApart from the main file, MoM - Mastery of Magicka, this mod includes four optional plugins.\r\n\r\nAll optional plugins are standalone, as such, they must be used without other plugins activated for them to work and prevent issues (you can still have them installed).\r\n\r\nThe optional plugins are:\r\n\r\n--- MoM - No Alchemy & Enchanting ---\r\n\r\nThis is the main plugin without the Enchantment and Alchemy overhauls. It includes fixes, general changes, spell changes, new spells, and magic school perks changes.\r\n\r\n--- MoM - No Alchemy ---\r\n\r\nThis is the main plugin without the Alchemy overhaul but with the Enchantment overhaul. Potions found, bought or created remain the same as the original ones. Enchanted equipment is affected by the mod.\r\n\r\n--- MoM - No Enchanting ---\r\n\r\nThis is the main plugin without the Enchantment overhaul but with the Alchemy overhaul. Levelled lists for vendors, loot and enemies stays the same for enchanted equipment, as well as your Enchanting perks and enchanted equipment. Potions and ingredients are affected by the mod.\r\n\r\n--- MoM - Mastery Perks Only ---\r\n\r\nThis contains only the changes to the Mastery perks. It does not include fixes, general changes, spell changes, the Alchemy overhaul or the Enchantment ovarhaul. All other plugins include Mastery perks, so this file is for those who only like this change and want optimal compatibility.\r\n\r\n[b][size=4]______________________________________\r\n¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯\r\n4 | How to get this to work (or not)\r\n_________________________________________\r\n¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯[/size][/b]\r\n\r\nI recommend to install the mod with the [url=http://skyrim.nexusmods.com/content/modmanager]Nexus Mod Manager[/url].\r\n\r\n--- Requirements ---\r\n\r\nSkyrim (patch 1.6.89.0.6 or later)\r\n\r\n--- Manual Installation ---\r\n\r\nCopy the Script folder and one of the plugins in the Data folder of Skyrim and activate it in Data Files when launching Skyrim. See the segment above, Options, to choose which plugin to install (you could install all of them, but only one must be activated).\r\n\r\n--- Nexus Mod Manager Installation ---\r\n\r\nDouble click the mod from the list in the Mods tab or select the mod from that list and click on the \\\"Activates the selected mod.\\\" button in the left bar (second button from the top). In the Plugins tab, activate only one of the MoM plugin files according to your preferences (see Options).\r\n\r\n--- Manual Uninstallation ---\r\n\r\nErease the file or files you copied in the Data folder when you installed the mod.\r\n\r\n--- Nexus Mod Manager Uninstallation ---\r\n\r\nDouble click the mod from the list in the Mods tab or select the mod from that list and click on the \\\"Deactivates the selected mod.\\\" button in the left bar (third button from the top).\r\n\r\n[b][size=4]______________________________\r\n¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯\r\n5 | Compatibility and Issues\r\n_________________________________\r\n¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯[/size][/b]\r\n\r\nMastery perks are compatible with all mod that add spells, such as [url=http://skyrim.nexusmods.com/downloads/file.php?id=3413]Midas Magic[/url] or [url=http://skyrim.nexusmods.com/downloads/file.php?id=5898]Phenderix Magic Evolved[/url]. Remember though that with increased power and duration, those spells may ruin the balance of the game.\r\n\r\nSome perks aside from the Mastery ones are not compatible with spells from other mods because I had to customize each spell; that would need a compatibility patch.\r\n\r\nWhen dual casting spells that have their casting time increased, the animation will not adapt to the new casting time. However, good indicators for knowing when the spell is ready to cast are the Magicka bar and the sound effect. When the bar reaches the point where it stops draining Magicka you can cast the spell and the sound will change to represent that.\r\n\r\n[b][size=4]_________________\r\n¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯\r\n6 | Disclaimers\r\n____________________\r\n¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯[/size][/b]\r\n\r\n--- Future Plans ---\r\n\r\nI\\'m working on two new spell lines, complete with perks: one for Conjuration and one for Destruction. Although I\\'m always working on less focused spells also, I will release both of these spell lines when they are complete. Regarding Spellcrafting, almost everything is complete; I need to finish some recipes and maybe make scrolls and staves more consistent with spells, but that can wait. I will also include quests for researching Master spells after I release the base system since that can take a long time to make. The most important thing i need now thou, is a better model for the station; one that can make different animations than those of the existing ones. I\\'m not very capable at modelling, so if someone could lend me an hand and contact me on how to do it or even offer to do it, I\\'d be most grateful.\r\n\r\n--- Recommended mods ---\r\n\r\nSome mods I think are great additions to the game in general:\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=3222]Immersive HUD (iHUD)[/url] by Gopher: this really enriches the game by giving an immersive feeling.\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=3829]Deadly Dragons[/url] by 3jiou: with this mod battling a dragon truly feels rewarding.\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=2700]Duel - Combat Realism[/url] by Gabriel Mailhot: fighting face to face is a thrill every time now.\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=1002]JaySuS Swords[/url] by JaySuS: these are some of the best weapon models I\\'ve ever seen in a game.\r\n\r\n--- Thanks to... ---\r\n\r\nBethesda, for letting us experience some of the most faithful RPG experiences on videogames.\r\nThe Nexus Staff, for providing and running a great place for those interested in modding.\r\ndimitrazzz, for his great help with the Bound Armor spell\\'s script.\r\n\r\n[b][size=4]_______________\r\n¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯\r\n7 | Changelog\r\n__________________\r\n¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯[/size][/b]\r\n\r\n[list]\r\n- v1.1 -\r\n\r\n[*]Balanced Bound weapons perks and Restoration spells, increased reduced cost from skill level.\r\n[*]New Spells: Cleanse Diseases, Debilitate.\r\n\r\n- v1.2 -\r\n\r\n[*]Added Enchantment overhaul. Fixed some things and increased compatibility.\r\n[*]New Spells: Conjure Dremora Warlock, Reminiscence of Pain, Distortion.\r\n\r\n- v1.3 -\r\n\r\n[*]Added Alchemy overhaul. Tweaked spells and enchantments.\r\n[*]New Spells: Combat Focus, Ease Burden, Empower, Infuse Black Soul Gem, Magic Focus, Stealth Focus.\r\n\r\n- v1.4 -\r\n\r\n[*]Armor spells have been improved. Some tweaks and fixes for spells.\r\n[*]New Spells: Bound Armor, Dispel Self.\r\n[/list]",
  "categoryId": "93",
  "version": "1.4",
  "author": "SupremeDemon",
  "createdUnix": "1330556221",
  "updatedUnix": "1342300577",
  "containsAdultContent": false,
  "uploadedBy": "SupremeDemon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74287",
      "name": "MoM - Mastery of Magicka v1_4 Fix",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "212",
      "fileName": "MoM - Mastery of Magicka v1_4 Fix-11721-1-4.rar",
      "uploadedUnix": "1342300577",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/fe5816a9d189ce4fe02269c4127307a2e98618d04acb1f6adbbb3f27b01d9090/analysis/1407022446/",
      "changelogHtml": " Armor spells have been improved. Some tweaks and fixes for spells. <br/> \n New Spells: Bound Armor, Dispel Self. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MoM%20-%20Mastery%20of%20Magicka%20v1_4%20Fix-11721-1-4.rar?fid=74287&ttl=1535773096&ri=8192&rs=8192&setec=d856237c44001776bba192e212fae15c"
    }
  ]
}