{
  "modId": 11733.0,
  "modName": "The_Ballad_of_the_white_Orc",
  "summary": "How on earth could it be that a female orc is the dovahkiin ...",
  "descriptionHtml": "To make sense please PLEASE read the story.\r\n\r\nIts packed in the zip as pdf with pictures. But for the impatient i paste it below.\r\n\r\nI created the charaacter with Extended Slider Colors\r\n\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6923\r\n\r\nBut afterwards I deleted the mod and the girls still was white. I think, that the mod is not recommended. \r\n\r\nI use Better Females by Bella and of corse UNP by dimon99.\r\n\r\nHere comes the story:\r\n\r\nThe ballad of the white Orc\r\n\r\nShe was cursed. She always was. There was always something wrong with her. She was too tall. She was too skinny. And she was too pale - for an orc. Her name was Ulûk Hai.\r\n\r\nShe was member of a big clan in Orsinium. Her mother Ulak-Bak once was the smithing wife of the clan-chief. Shortly after she was born, her mother was sent away to work in the mines of Reytry. Ulûk Hai grew up in the mines where it doesn\\'t matter how pale she was. During that time, her mother told her everything about steel and orichalcum and smithing. But only in theory, because her mother has to do her mining work and couldn´t get near a smithy.\r\n\r\nWhen she was eight, she had to begin with the warrior training but she didn\\'t like it. Especially the bow. But she did her best to serve malacath and became a fairly good fighter with two-handed swords.\r\n\r\nBut she preferred the smell of the mines. the iron ore, the corundum, the taste of steel. And she hated herself. Hoping to soon grow up and leave the stronghold to find an early death in a battle. Or by a wild animal – if there was one strong enough to kill her.\r\n\r\nWhen she was twelve and had to go out hunting. And none of the other kids wanted to accompany her. No chance to take part in a big fight with a bear or a sabre cat. „You are so pale and shining, that all the prey will notice you from miles away.“ they said. So she had to go out on her own and learn to sneak and hunt in her own way. And she succeeded. Ulûk Hai was a good hunter. Yes!\r\n\r\nShe always thought that she was the reason for the degradation of her mother, because she was so wayward. She never felt worth being a member of the stronghold. But her mother always treated her with love.\r\n\r\nOne day - a few months ago - it happens. Deep under the soil of Orsinium in the lonliest and deepest part of the mine, the rocks came down and buried her mother. Ulûk Hai worked in panic to rescue the only person in tamriel that she loved. But her mother was seriously injured. The way up to call a healer was too far. And she was not educated in healing. So the only thing she could do was to listen to the story her mother told her in her dying moments.\r\n\r\n\\\" Ulûk Hai my daughter\\\" her mother began. „20 years ago I went to Skyrim to celebrate the wedding of my syster with the clan-chief of Mor Khazgur. And on our way home through the Reach we were ambushed by a bunch of nord who were in war with some forsworn. They called themselves stormcloaks.\r\n\r\nThe fighting lasts for an hour and all the warriors of malacath got killed. One of them was your father. Well not your real father...“\r\n\r\n„There was their leader who called himself Ulfric. He was mad about loosing men in a battle with some orcs. But he doesnt\\'t slaughter the survivors. Only my sister Ura-Bak and I had survived. He raped us and he bashed us...  for hours...“   Ulûk Hai´s mother had to pause to fight her tears. Hoarsely she continued.\r\n\r\n„And then they went away thinking we were dead. And my sister was. But I survived. It took me weeks to find my way home. Always in fear from the nord. Always in struggle to find something to eat. To steal some food from sleeping wanderers. Trapping a rabbit.“ \r\n\r\n„Then I realized I was pregnant. I paniced. First I wanted to kill myself. But then I knew that it was Malacaths plan and I had to fullfill my role in his plan.“\r\n„A few months after I arrived home I gave birth to a little girl - to you. So beautiful and cute but  with an unorcish white skin. And I knew, this Ulfric-guy not only killed my husband, but he also cursed me with a bastard. And the Clan Chief said I was cursed and sent me away to work the rest of my days in the mines. But you, my child Ulûk Hai, you were innocent. So I did everything I could to raise you as a good orc in honor of Malacath. I should have told you earlier, but I didn\\' dare...“\r\nHer mother coughed. Blood trickled from her mouth. With a last effort she whispered:“  Ulûk Hai, kill him! Take revenge for what he did to us. Promise me. Kill Ulfric Stormcloak!“ Then she died.\r\n\r\nThis was ages ago. But  Ulûk Hai was willing to fulfill her promise. The day she attained full age, she went away. The Clan-chief of Reytry didn´t argue with her that she needs a warrior from another stronghold to marry her. No, he was glad that this baleful skinny and pale bastard leaves his area of responsibility. \r\nWhen she crossed the border of the Reach, she first heard the name Ulfic. She nearly stumbled into a camp of stormcloaks. Luckily it was night – she only travels at night to avoid attracting any attention. As she reached Hjaalmarch. She heard that Ulfric was Jarl of Windhelm. And so she carried on heading east. Getting into Windhelm was impossible for her, but after one day waiting and thinking how to get in, she saw a big group of stormcloak soldiers leaving the town. In the middle of the group was one man taller than the others and wearing diffenrent clothes. His behavior told  Ulûk Hai that he has to be a chief. „Maybe he is Ulfric.“ she said to herself. \r\nShe followed them one day. In the night she sneaks nearer and listens to their conversation. „My Jarl Ulfric“ one stormcloak said „General Tullius´ weakest point is in Helgen. When we strike hard, we will succeed and drive the Imperials out of the south of skyrim.“\r\n\r\nThe next day Ulûk Hai figures out how to ambush Ulfric. No question that she will be killed, but she wants to be shure that she gets him. Her skills with the bow were not good enough to kill him with one shot. So she has to close the distance and kill him with her greatsword. „When I follow a scout and kill him and take his armor...“ she thought. So she did. \r\nIn a small clearing far enough away from the main camp, she ambushed a scout. It was a women. Now laying naked in the snow. She realized that this woman was just as pale as herself. „Good“ she thought. „Porbably no-one will recognize me as a stranger, when I approache Ulfic.“ \r\nWith the iron war axe heavy in her hands Ulûk Hai was heading towards the stormcloak camp. And just in the moment when she reached the first guard hell broke loose!\r\nImperials! Everywhere. No, not now. She doesn´t want to fight with strangers. It was not her war. What shall I do. \r\nShe was confused and frustrated. Standing on the brink of the camp like a statue with a war axe loosely in her hands. Then darkness.\r\n\r\nShe awoke on a rumbling trap with an aching head. Astonished by the fact that Ulfric Stormcloak sits beside her. She didn´t follow the conversation of the blond man in front of her. The only thoughts in her aching head were „I failed!“ \r\nAfter a while the trek arrived in a small stronghold. The blond man said it was Helgen. There were Imperials and a general. The trap halted and they had to stand in front of some Imperials with list of names. The General impeaches Ulfric for starting a war and some other things. Ulûk Hai was in trance. Everything around her was meaningless. She failed.\r\nThe first stormcloak was executed. Then she had to go. Hoping that Ulfric will also be decapitated. She kneeled down as a strange growl reaches her ears. The headsman lifted his axe when a giant black something landed on the tower she was looking at. In an instant she was alerted. All her senses to the maximum. The dragon shouted in a alien language and glowing rocks came down. This shout touched her deep inside. In an undiscovered abyss of her existance a vibration began. Like in the nightmares she always had. Something like fear and like might. Something beyond recognition but still familiar. \r\nShe had to run. The blond stormcloak warrior orders her to follow him. Through the shock waves. Into the tower there. She barely could see. Shouting and crying all around her. They reached the tower alive. Inside she stands besides Ulfric, again! Handcuffed. No chance to reach his throat, grab it and squeeze the life out of this nightmare. Ralof, the warrior always talking to her, orders her to climb the stairs. \r\nA wall breaks, a dragon shouts with flames. Someone dies. Now she has to jump. Jump into a house. Jump again, downstairs. And run. To an imperial officer. Follow him! He has a weapon. Maybe when I can get rid of the handcuffs, I take his sword an find Ulfric and …\r\nRalof again. „Follow me!“ he shouts. „No“ I think. No, the Imperial is the better opportunity. This General Tullius seems to be a good ally. So I follow the officer into the castle...\r\n\r\n\r\nOne day later,  Ulûk Hai stands in the Bleak Falls Temple, a corpse to her feet. She cannot resist. Her nord blood is boiling fanned by the orcish blood that slayed that draugr in berserker rage. She simply has to. She has to take his armor. Malodorous and hundreds of years old. But nord! The other part of her. Now she feels complete. At home. She feels strong. No, she feels mighty...\r\n\r\nUlfric, I´m coming.\r\n",
  "categoryId": "43",
  "version": "1",
  "author": "PanTast",
  "createdUnix": "1330564290",
  "updatedUnix": "1330564475",
  "containsAdultContent": false,
  "uploadedBy": "PanTast",
  "primaryFile": null,
  "files": [
    {
      "fileId": "38650",
      "name": "The Ballad of the white Orc",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5537",
      "fileName": "The Ballad of the white Orc-11733-1.7z",
      "uploadedUnix": "1330564475",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/29a03baae577cd2a7ce66f2a0867c48dd09e9e5cc5de34cfd1346769fc09b2ca/analysis/1406722346/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ballad%20of%20the%20white%20Orc-11733-1.7z?fid=38650&ttl=1535773105&ri=8192&rs=8192&setec=34f6ba3d21127647c5065c224dc11bd5"
    }
  ]
}