{
  "modId": 11735.0,
  "modName": "Dragonsreach hideout Alternative Version",
  "summary": "Alternative version to the beautiful [url=http://skyrim.nexusmods.com/downloads/file.php?id=8197]ElDiabs DragonsReach Hideout[/url]",
  "descriptionHtml": "EDIT 05/04/12 - the long waited images are uploaded now!, working on the assassin version.\r\n\r\nFirst of all, I\\'m not North American or English, I\\'m Brazilian so enlish is like my second language, please forgive me for any grammar issues.\r\n\r\n[u]Description[/u]\r\nI loved the ElDiabs Dragonsreach Hideout, but I felt it was needing some details and specific containers that I\\'m used to use, like soulgem boxes, ingredients chests (not barrels), alchemy shelves with more ingredients, etc. So I made this alternative version and after getting permission from ElDiabs I finnally posted it! It\\'s a very personal taste to redecorate and detail a house, so if you like my vision of a Nightingale\\'s hideout give me your endorsement! But do not forget to give it to the original maker of this great house mod too, the link to the original Dragonsreach Hideout is right here:\r\n [url=http://skyrim.nexusmods.com/downloads/file.php?id=8197]link[/url] (also at the credits tab)\r\n*Be aware that some containers had been or either moved or deleted to give place for immersion and newer stuff, full details below.\r\n\r\nSo this is what has been added to the house:\r\n[list]*Deleted the \\\"small safe\\\" near the bed, latern put on the ground and bed replaced with a Bedroll (only furniture not upgraded). Yes I know you guys hate bedrolls, sleeping on the ground with the insects and the filth, but I personally don\\'t like the other beds.\r\n*I did a little \\\"upgrade\\\" in the furniture, instead of the lower class cupboards and wardrobes I replaced them with the upper class and noble class of the construction kit, note that they are new containers not mesh replacements.\r\n*Added another bookshelf with upper meshes and placed them in the three mannequins spot near the hidden door. Be aware that I deleted two of them. I personally don\\'t need seven mannequins.\r\n*Added two ingredients shelves near the alchemy stand, that has been replaced with the regular alchemy stand, instead of the table-stand one.\r\n*Added wall shelves (like the arch-mage quarters ones, many furniture were copied from that cell) with a Soulgem strongbox and others filled with skulls or animals in jars, etc\r\n*Deleted the main room weapon racks to give place to a Alchemy Garden, not many ingredients but enough to get by. (also the chest near to those weapon racks has been deleted)\r\n*Added a noble wardrobe to store more clothes and to separate it from the cupboard near the bed.\r\n*Added a desk with inkwell, quill and a documents box to place notes and stuff. Be aware that two of the three chests near the hidden door were deleted.\r\n*Added more detail to the cooking area, like wood, a woodcutter\\'s axe, barrels and food in new stands. Also a broom and bucket near the garden (immersion purposes).\r\n*Added a Jewerly strongbox near the shrine of nocturnal.\r\n*Added a noble cupboard near the new soulgems wall shelves.\r\n*Deleted weird Nocturnal Shrine magic effect.\r\n*Iron ingots deleted from the working bench and replaced with a hammer and tongs.\r\n*Banner in front of the hidden door deleted.\r\n*Added an upper chair near the alchemy shelves and bookshelves so you can read your favorite books.[/list]\r\n\r\nIn the hidden room:\r\n[list]*A strongbox formulary replacement because I used it to create the other strongboxes.\r\n*Moved and increased the number of floor weapon racks by three.\r\n*Deleted one of the small safes (now renamed to just \\\"Safe\\\") and ingots above them to give place to weapon racks.[/list]\r\n\r\nThat\\'s it, those are all the changes made I think. I\\'m not at home at the moment so I can\\'t make any request changes, but please send them to me and when I get back I will attend you and post another alternative versions. I will make newer changes with time if I found new furnitures like couches and confortable chairs, or newer stands and probably a female mannequin to be added with the male mannequins, I will get permission from mod resourcers to use one that I found. I will make the assassin version, I made it only Nightingale because it was the version I was using, but as soon as I get home I will release the other version with assassin stuff. You can always make your own changes to this house like the Bedroll thing that I forgot to replace for a bed for the release of the mod, the Nocturnal Shrine effect, banners, etc.\r\n- I used ElDiabs v3.0 DragonsReach Hideout to make the mod, since in v3.1 he added noresetzone flags to the cells, I made it too in this version. Not sure what it will do with Alchemy Garden tough.\r\n\r\nMy main concern is if you guys will like my tweaked favorite home, leave any comments giving me your feedback and opnion.\r\n\r\n[u]Bugs[/u]\r\nNone that I know yet, weapon rack and mannequin problems are Bethesda\\'s issues. The only problems is the quill in the desk that I placed, that thing really don\\'t like being in the table. Some friends of mine didn\\'t have problem with it, but mine just keeps going under the table, so I just put it in a strong box. Maybe a static version may fix it, I need to think about it.\r\n\r\n[u]Install[/u]\r\nIf you are already using this mod go to the upgrades tab. I renamed the .esp file to differentiate it from ElDiabs house, so [b]do NOT[/b] use both of them.\r\n\r\n1. Download the file and activate it with NMM.\r\n2. Manually install in Skyrim/Data folder. Activate both esm and esp in a mod loader.\r\n\r\n[u]Uninstall[/u]\r\nBe sure to save outside of the house. If you save inside the house and uninstall the mod, your game may crash, weird stuff can happen and your computer may explode in a bolt of molten lava (kidding).\r\n\r\n1. Deactivate the file with NMM.\r\n2. Delete the .esp and .esm files from your Skyrim/Data folder.\r\n\r\n[u]Upgrade[/u]\r\nBack up your saves. I don\\'t recommend to upgrade from ElDiabs version to this one, many things have been changed so my main recommendation is that you do like I did, take all your stuff out, leave the house, deactivate the mod, re-enter the game, load your save and say yes to the message that appears, save again, exit the game and deactivate ElDiabs version and activate my version. Put everything in its place when you get back. Remember [b]do NOT[/b] use my version and ElDiabs version, all sort of duplicates and crazyness can happen.\r\n\r\n1. Manually remove old esm and esp files from Skyrim/Data folder. Install new ones.\r\n\r\n[u]Credits[/u]\r\nAll credits belongs to ElDiabs, whithout his original idea and house construction skills I woudn\\'t be making this. Thanks for Bethesda for making the game of the year that is Skyrim and thanks for the mod community for providing me amusement and improvements to my gaming experience.\r\nSource mod for this house -> [url=http://skyrim.nexusmods.com/downloads/file.php?id=8197]DragonsReach Hideout[/url] by [url=http://skyrim.nexusmods.com/modules/members/index.php?id=916280]ElDiabs[/url]",
  "categoryId": "67",
  "version": "1.0",
  "author": "Shockwave171",
  "createdUnix": "1330565667",
  "updatedUnix": "1330567510",
  "containsAdultContent": false,
  "uploadedBy": "shockwave171",
  "primaryFile": null,
  "files": [
    {
      "fileId": "38667",
      "name": "Dragonsreach Hideout Alternative",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "100",
      "fileName": "Dragonsreach Hideout Alternative-11735-1-0.rar",
      "uploadedUnix": "1330567510",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ad8d3dcac08f02f48e648fb0169ded159015a601b8043f02de485297301053f6/analysis/1406722446/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonsreach%20Hideout%20Alternative-11735-1-0.rar?fid=38667&ttl=1535773107&ri=8192&rs=8192&setec=3114db731e267e241478fd8c0531d61a"
    }
  ]
}