{
  "modId": 11757.0,
  "modName": "Convenient and Fun Spells",
  "summary": "Ever wished you could raise a giant to be your loyal thrall, cast a spell to enable you to carry over 2,000 pounds of loot across the beautiful land of Skyrim, or see in the dark like a Khajiit for 5 to 10 minutes by just casting a spell.  If you answered yes to any of the questions, then this mod is for you.",
  "descriptionHtml": "After playing through Skyrim multiple times while eagerly awaiting the arrival of the Creation Kit, I created a small personal list of things I wished my primary characters in the game could do.  These spells are examples of some of items on my wish list that the Creation Kit has enabled me produce.  Currently, this mod only contains 3 new spells; however, depending on the feedback I get, more could be added.\r\n  \r\nThe current spells included in this mod are:\r\n[list][*]Ultimate Carry Weight Boost - adds 2,000 to your maximum carry weight for 5 minutes (10 with alteration dual casting)\r\n[*]Ultimate Dead Thrall - enables casting the dead trall master conjuration spell on all creatures and mechanical automatons (excluding dragons)\r\n[*]Ultimate Night Eye - grants night vision for 5 minutes (10 with illusion dual casting)\r\n[/list]\r\n\r\n[b][u]Acquiring The Spells[/u][/b]\r\nAlexa, a new vendor added by this mod at the Arcanaeum in College of Winterhold, sells all the new spells for a cost of approximately 1000 gold before discounts.  By placing the spell tomes in a single vendor\\'s inventory at the College of Winterhold, I aimed to make it a fun challenge for new players since just getting to Winterhold is a perilous endeavor for new characters early in the game.  Using a new vendor also prevents conflicts with other mods that modify vendor lists. Alexa has a diverse inventory, similar to Enthir\\'s, and 25,000 gold to help you offload the junk that you dont want in one convinient location.\r\n\r\n[b][u]Requirements[/u][/b]\r\nThis mod has no additional requirements.\r\n\r\n[center][b][size=3]Installing / Uninstalling[/size][/b][/center]\r\nBefore installing or uninstalling any mods, it\\'s always a good idea to have a backup copy of at least one save game (not just quick or auto saves).\r\n\r\n[b][u]Nexu Mod Manager Install / Uninstall[/u][/b]\r\nClick the Download With Manager button and just activate the file once downloaded.  Use the deactivate button in NMM to uninstall the mod.\r\n\r\n[b][u]Manual Install[/u][/b]\r\nDownload the file manually and extract the single \\\"Fierce Slayer\\'s Convenient and Fun Spells.esp\\\" to your Skyrim data folder (same folder was Skyrim.esm).  Then activate the plugin file in your prefered mod manager or in the Skyrim Launcher\\'s data files.\r\n\r\n[b][u]Manual Uninstall[/u][/b]\r\nUninstall by deactivating the plugin file in your prefered mod manager or in the Skyrim Launcher\\'s data files, then delete the \\\"Fierce Slayer\\'s Convenient and Fun Spells.esp\\\" from your Skyrim data folder.  This is they only file used by this mod.\r\n\r\n[center][b][size=3]Detailed Spell Descriptions[/size][/b][/center]\r\n[b][u]Ultimate Carry Weight Boost[/u][/b]\r\nThis spell increases your carry weight capacity by 2000 for 5 minutes or 10 minutes if you have the dual casting perk in alteration magic.  This spell has no other perk requirements.  With these spell I can now complete multiple quest without becoming overburdened with heavy items reducing the time I spend managing my inventory.\r\n\r\n[b][u]Ultimate Dead Thrall[/u][/b]\r\nThis spell tome removes the maximum level and race limits of the original vanilla Dead Thrall spell. The original limits are humanoid only races (changed to allow any race, creature, or mechanical automatons) with a maximum level of 40 (changed to level 100 which includes all creatures in Skyrim except dragons).  The new general rule is that if it can be killed it can be raised as a thrall with this spell.  Since this is a powerful spell, it can only be purchased after obtaining the Master level perk in conjuration magic. \r\n\r\nSome of the benefits of using this spell are:\r\n[list][*]You can use this spell to raise a loyal giant, werewolf, or Dwarven Centurion thrall to fight at your side permanently as long I they don\\'t get annihilated.  If your dead thralls do get smacked down, you can just raise them again since they shouldn\\'t disintegrate as when using lower level necromantic spells (although rare, there\\'s still a small chance of disitegration).\r\n[*]The Twin Souls conjuration perk enables you to have 2 dead thralls plus a typical companion (a party of 4) to make your Skyrim travels less lonely.  This can also come in handy if you play at master level difficulty with [url=http://skyrim.nexusmods.com/downloads/file.php?id=6176]Wars in Skyrim[/url] or [url=http://skyrim.nexusmods.com/downloads/file.php?id=9494]WARZONES - Civil Unrest[/url] installed.  I use both of those mods together to add more combat opportunities and challenge. \r\n[*]If you\\'re like me and like to keep questing as long as possible before taking a break to sell all the loot you\\'ve gathered, this is where a dead thrall can come in handy, since you can just beat them down (or just cast spell to summon an atronach) to send their souls back to oblivion and then offload any excess invontory to them before bringing back by recasting this spell.  This gives you virtually unlimited capacity, but be careful not to loose your thralls.  Their AI is limited as with the vanilla dead thrall spell.  I recommend saving frequently if you use your dead thrall to carry your excess inventory just to be safe. Thralls have a tendency to get lost or just disappear occasionally.  For more details on the limitations of the Dead Thrall magic effect and workarounds see this article. If you don\\'t use your dead thralls as pack mules then, the limitations (bugs) are negligible.  See the [url=http://elderscrolls.wikia.com/wiki/Dead_Thrall]Dead Thrall page in the Elder Scrolls Wiki[/url] for more details on the limitations.\r\n\r\n[b][u]Ultimate Night Eye[/u][/b]\r\nThis spell enables the caster to see in the dark as well as a Khajiit.  The spell duration is 5 minutes or 10 minutes if you have the dual casting perk in Illusion magic.  This spell doesn\\'t have any additional perk requirements.  If you don\\'t like the slight vision blur that is part of the default night eye effect, I recommend using [url=http://skyrim.nexusmods.com/downloads/file.php?id=8090]No Blur Night Vision[/url] with this mod.  The No Blur Night Vision mod will remove the blur effect for all night vision spells and powers.\r\n\r\nOne of the main reasons, I created this spell is that I use Immersive HUD to hide most UI elements during combat .  This includes the compass and all enemy indicators (for increased challenge I also disable my crosshairs and stealth indicator).  When fighting groups of enemies outdoors at night or in large dark indoor areas, the candlelight spells or torches can make it harder to see enemies at a distance.  I used night eye spells in Oblivion to solve this problem so it seemed that this was missing in my Skyrim experience for all races besides Khajiit.  Being able to see better in the dark helps my play style since I don\\'t know exactly where my enemies are until I see them.  I also use the vanilla detection spells and the aura whisper shout, but those are costly in terms of magicka and the coold down period for shouts is too long to always rely on it.  Those are the reasons this spell is a must have for me; however, I still use candlelight spells for looting since it\\'s hard to find things with the color blind effect of night eye spells, and for close quaters combat. \r\n[/list]\r\n[b][u]Reasons for Publishing this Mod[/u][/b]\r\nThis mod only contains spells that increase my enjoyment of the game by avoiding repetitive tedious tasks and enable situations that can be fun to try like raising odd creatures as thralls.  If you are just playing Skyrim casually or are veteran (like me) and want to enjoy the game world without the hassle of tedious tasks I hope you can get instant enjoyment by using these spells.\r\n\r\nI know there are already great magic mods that provide similar spells, but I prefer to create my own spells for three reasons:\r\n[list][*]Because I love the vanilla magic system in Skyrim and didn\\'t what to add too many new spells.  \r\n[*]The spells in other mods weren\\'t exactly what I was looking for.\r\n[*]And last but not least, I ran out of buttons for Extra Hotkeys on my Logitech G13 gamepad and Razer Naga Epic mouse and I don\\'t like pausing the game during combat by using the favorites menu (LOL).\r\n[/list]\r\n[b][u]Feedback[/b][/u]\r\nAlthough I started modding with Oblivion for small customizations, this is my first published mod so constructive criticism is welcome.  I hope you enjoy these spells as much as I do.  If you have ideas for spells that could add more convenience and enjoyment in Skyrim let me know and I can look into adding them to this mod.  \r\n\r\n[center][b][size=3]* Please remember to endorse this mod if you like it.[/size][/b] :)[/center]\r\n\r\n\r\nI used the following mods while creating the images above.\r\n",
  "categoryId": "75",
  "version": "1.0",
  "author": "FierceSlayer",
  "createdUnix": "1330589146",
  "updatedUnix": "1330589146",
  "containsAdultContent": false,
  "uploadedBy": "FierceSlayer",
  "primaryFile": null,
  "files": []
}