{
  "modId": 11750.0,
  "modName": "Recruit More Blades - SkyHavenTempleEnhanced",
  "summary": "Blades vs Thalmor  3Jan2015 Prepare to Fight or Prepare to Die&#33;&#33;&#33;\r<br />\r<br />Recruit any 30 followers to become a Blade, Blades vs Thalmor Quests, Recover Lost Blade Relics to help return the Blades to their former Glory, Paarthurnax does not have to die, and more.",
  "descriptionHtml": "Blades vs Thalmor\r<br />3Jan2015\r<br />Prepare to Fight or Prepare to Die&#33;&#33;&#33;\r<br />\r<br />Recruit any 30 followers to become a Blade, Blades vs Thalmor Quests, Recover Lost Blade Relics to help return the Blades to their former Glory, Paarthurnax does not have to die, and more. Yes, Paarthurnax does not have to die and you get to put Esbern and Delphine in their place. They serve the Dragonborn, not the other way around. The quests are fully voiced and you are still friends with the Blades, Greybeards, and Paarthurnax, with all their quests still available and working.\r<br />\r<br />\r<br />Mod Version, 5Mar2014, REQUIRES (A NEW CHARACTER) OR (A SAVE GAME BEFORE ENTERING KARTHSPIRE CAVE FOR THE FIRST TIME).\r<br />\r<br />Mod Version, 3Jan2015, is a patch that fixes the bright lighting in the court yard and at the main stairway inside Sky Haven Temple. Plus in the Dragonborn Room if you decide to build it. You do not need to download Version 5Mar2014, if this is your first time running this mod. Use Version, 3Jan2015, it is the complete version. If you have Version, 5Mar2014 installed, just install Version, 3Jan2015, over it. If you already have Version, 5Mar2014 working, then there should be no problems installing Version, 3Jan2015, over Version, 5Mar2014.\r<br />\r<br />1. Look for Alvar Orlawn&#39;s journal in Riverwood.\r<br />2. The Quest should continue when you pick this journal up.\r<br />3. If you have problems with the quests in this mod, see Known Issues and the FAQ below.\r<br />\r<br />It’s a good idea to do the ‘Reference IDs to Objects’ CHECK PROCEDURE on any save game you’re going to use after installing this mod. Once you do the check and it passes, you’re good to go and no further checks should be necessary for this play-through.\r<br />\r<br />\r<br />Previous versions have the items already active and visible in the game. In version, 5Mar2014, the player will have to make and purchase these items. Items and locations are added to your saved games. Therefore, if you have already been to Karthspire Cave and/or Sky Haven Temple, the items will already be there and when you build and purchase the items in version, 5Mar2014, you will get a copy of the same items trying to occupy the same point in space. This will cause problems with your game.\r<br />\r<br />\r<br />START OF THE ‘Reference IDs to Objects’ CHECK PROCEDURE\r<br />\r<br />MAKE SURE YOU DO THE FOLLOWING AND VERIFY YOUR RESULTS AFTER INSTALLING AND ACTIVATING MY MOD. THE BEST TIME TO DO THIS IS AFTER YOU CREATED A NEW CHARACTER.\r<br />\r<br />Sometimes Bethesda&#39;s code won&#39;t fill in the Reference IDs to objects.\r<br />\r<br />Let&#39;s see if you have a Reference ID problem.\r<br />\r<br />Type the following in the console and compare your results to the pictures that I posted on my Mod Page. You will have to scroll through the pictures until you find the ones with the listings that you want to compare.\r<br />\r<br />Use the Page Up and Page Down buttons to see all that is listed when you type the following;\r<br />\r<br />sqv FreeformSkyhavenTempleA\r<br />\r<br />If you don’t have the same results before the Rebuilding the Blades Quest is started, then you will have to start a new character. There’s nothing I can do to help you resolve this problem. It’s a Bethesda bug and the only way to hope that it resolves itself, is with a new character.\r<br />\r<br />END OF THE ‘Reference IDs to Objects’ CHECK PROCEDURE\r<br />\r<br />\r<br />&#34;BLADES VS THALMOR&#34; by klcjr on Steam / ItsMeToo on Nexus\r<br />New voiced quests, based on MadFrenchie&#39;s 4 mods &#34;Fight against the Thalmor&#34;, with 4 unique Blades relics to find, hidden in MadFrenchie&#39;s 4 Thalmor mods. New unique items meshes, design and textures by 0Prime0 and klcjr/ItsMeToo(nexus).\r<br />\r<br />&#34;SOUTH DRAGON BRIDGE&#34; by MadFrenchie, klcjr on Steam / ItsMeToo on Nexus, and 0Prime0\r<br />The Dragonmourn Inn / &#34;Fight against the Thalmor IV&#34;\r<br />A real new DLC, including a new district to the town of Dragon Bridge, 3 new dungeons to clear, near 200 enemies to beat, 10 new interactive NPC&#39;s, and a new Player house Inn to earn, including the 1st female marriageable sexy bard follower of Skyrim, and a unique new artifact to discover, new meshes and textures designed by 0Prime0.\r<br />\r<br />“Helgen Reborn” by Mike Hancho (aka Balok on Nexus)\r<br />An EPIC DLC that has been integrated into the Blade vs Thalmor storyline with an additional quest to establish a Blade Outpost in Helgen.\r<br />\r<br />\r<br />REQUIRED MODS\r<br />Dawnguard by Bethesda\r<br />Hearthfire by Bethesda\r<br />Dragonborn by Bethesda\r<br />\r<br />MAKE SURE THAT, Recruit More Blades - SkyHavenTempleEnhanced, IS THE LAST MOD LOADED IN THE LOAD ORDER. For the other required mods, use the mod author’s recommendation, but SkyHavenTempleEnhanced.esp must be the last mod loaded or it will not work, with one exception. I have ReProccer last and my mod right above that in the load order. I put ReProccer last because I&#39;m going to have weapons and armor added to my mod that I wanted included in the Master List. I too use SkyRe and wanted my mod compatible with this great mod.\r<br />\r<br />REQUIRED MODS if you talk to the quartermaster about Lost Blade Relics or ask, “Have you heard anything lately?”\r<br />\r<br />Adal Matar, the lost Stronghold – by MadFrenchie\r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=75662068\r<br />or\r<br />http://[color=#000000]www.nexusmods.com/skyrim/mods/[/color]33108\r<br />\r<br />\r<br />The Frontier to Cyrodiil - by MadFrenchie\r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=87242447\r<br />or\r<br />http://[color=#000000]www.nexusmods.com/skyrim/mods[/color]/33164\r<br />\r<br />\r<br />The Aldmeri Domain - by MadFrenchie\r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=106992906\r<br />or\r<br />http://[color=#000000]www.nexusmods.com/skyrim/mods[/color]/33261\r<br />\r<br />\r<br />South Dragon Bridge - by MadFrenchie\r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=130933707\r<br />or\r<br />http://[color=#000000]www.nexusmods.com/skyrim/mods[/color]/33323\r<br />\r<br />\r<br />REQUIRED MOD if you talk to the quartermaster about Helgen.\r<br />\r<br />Helgen Reborn – by Mike Hancho (aka Balok on Nexus)\r<br />http://[color=#000000]www.nexusmods.com/skyrim/mods[/color]/35841\r<br />\r<br />\r<br />RECOMMENDED, but not required mods\r<br />\r<br />Blades Samurai Armour and Kimonos - by Prime\r<br />http://[color=#000000]www.nexusmods.com/skyrim/mods[/color]/24704\r<br />\r<br />DragonsEnhanced - by ItsMeToo, klcjr on Steam\r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=2027089\r<br />or\r<br />http://[color=#000000]www.nexusmods.com/skyrim/mods[/color]/15765\r<br />\r<br />Shout Travel - by ItsMeToo, klcjr on Steam\r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=186817961\r<br />or\r<br />http://[color=#000000]www.nexusmods.com/skyrim/mods/44804[/color]\r<br />\r<br />\r<br />DON’T USE ANY Paarthurnax MODS, THEY ARE NOT COMPATIBLE&#33;&#33;&#33;\r<br />I have my own solution in my mod.\r<br />\r<br />Take all of the books in the secret location at The Sleeping Giant Inn in Riverwood, when you are able to, and don’t lose or sell them. They will be needed for a later quest in a future update.\r<br />\r<br />Do not talk to the ghost around the Blood Seal area until you find Quartermaster Alvar Orlawn’s Journal.\r<br />\r<br />Just to let everyone know, I made this mod for ME and if others enjoy it, that&#39;s great. Starting a new play-through sometimes is not what I want to do, but if it&#39;s necessary to keep everything working like it should, then that is what you need to do. If people aren&#39;t willing to do this, then don&#39;t use the mod.\r<br />\r<br />Only a few people need to do the following, as a last resort, if the mod doesn’t work correctly. You may be one of those people.\r<br />\r<br />It might be a Bethesda bug with some scripts not starting correctly. See the FAQ below, your solution might be located there.\r<br />\r<br />Or, it could be…\r<br />\r<br />A Steam &#39;Game Validation Check&#39;, can also cause the mod to stop working. Steam will over-ride these scripts to a &#39;default state&#39;, but won&#39;t do it cleanly and leave some &#39;dead&#39; code in the scripts. These scripts will need to be deleted and reloaded. To get them all, that is why I say the following;\r<br />\r<br />The game is located here\r<br />Program Files (x86) -&gt; Steam -&gt; SteamApps -&gt; common -&gt; Skyrim\r<br />\r<br />Your save game folder is located here\r<br />Users -&gt; your user name -&gt; My Documents -&gt; My Games -&gt; Skyrim\r<br />\r<br />1) You need to delete all your saved games and delete the Skyrim saved game folder.\r<br />2) Uninstall Skyrim and delete the Skyrim folder.\r<br />3) Reinstall Skyrim. The newest version.\r<br />4) Reinstall the mods that do not conflict with my mod, whatever those happen to be.\r<br />(NOTE: This time don&#39;t install any follower mods until after you have all the Blades you want, up to 30 max.)\r<br />5) Reinstall my mod at the bottom of the load order. This is very important or my mod will not work correctly.\r<br />\r<br />Good Luck, I hope this works for you. \r<br />\r<br />\r<br />Remember BOSS and TES5Edit are still in Beta and make errors in their reports.\r<br />Not everything they report needs to be corrected.\r<br />Just because they tell you to report these errors to the mod authors doesn&#39;t mean you need to report them.\r<br />\r<br />\r<br />Recommended Player levels for the Lost Blade Relic Quests, with the game set to Expert. Of course this depends on your game play style, mods, and settings.\r<br />\r<br />Find Lost Blade Relic Northwind (Level 20 minimum)\r<br />Find Lost Blade Relic Renault Akaviri Katana (Level 30 minimum)\r<br />Find Lost Blade Relic San Soon’s Kimono (Level 40 minimum)\r<br />Find Lost Blade Relic Dragonborn Kimono (Level 40 minimum)\r<br />\r<br />NOTE: Find Lost Blade Relic Dragonborn Kimono will not have a quest marker due to the item is inside an area of MadFrenchie’s mod that I don’t have access to from my mod. The other quests will have quest markers.\r<br />\r<br />100% Compatible with UFO and AFT. EFF is not Compatible. The EFF mod author will have to change the way they use the variable PlayerFollowerCount before any compatibility is possible. I have not checked this with other multi follower mods. That will be your task, if you use one of them.\r<br />\r<br />\r<br />After the first 3 Blade Recruits, Delphine will tell you to talk to Esbern about Dragon Lairs, just like in the vanilla game. If this doesn’t happen or you can’t go Dragon Hunting, then you have a corrupted save game that happened before you installed my mod or a mod conflict. This is your problem to resolve, not mine.\r<br />\r<br />You can keep getting Blade Recruits, go talk to Esbern and go Dragon Hunting (only the first three will go Dragon Hunting), or do something else.\r<br />\r<br />Leaving the cell and coming back to SHT will cause the new Blade Recruit to get into their Blade Armor.\r<br />\r<br />You can keep going dragon hunting just like in the vanilla game. I didn&#39;t change anything about that quest. Recruit as many Blades as you want, up to 30 maximum. Using console commands can break mods, don&#39;t blame mod authors if their mods stop working for you or your game stops working. Use mods and console commands at your own risk. If you uninstall my mod, you&#39;ll lose all your Blades and all the SHT upgrades. \r<br />\r<br />Will those NPCs return to the game like they were before you recruited them into the Blades? I don&#39;t know. Why would I even do something like that when I&#39;m working on expanding my mod?\r<br />\r<br />The mod does what it says it will do.\r<br />\r<br />All Blade Recruits are still followers you can use.\r<br />\r<br />Blade Recruits 1 through 3 are set to essential just like in the vanilla game, which means they can’t be killed. Bethesda did this so that quests and scripts would not stop working if one of those recruits died. These Blades have schedules for training, guard duty, and sleeping at SHT.\r<br />\r<br />Blade Recruits 4 through 10 are set to protected, which means only the player can kill them. These Blades have schedules for training, guard duty, and sleeping at SHT.\r<br />\r<br />Blade Recruits 11 through 30 are set to protected, which means only the player can kill them. They just do idle things around SHT, Karthspire Cave, and Karthspire Camp Area. The Blades around the Karthspire Camp Area will help keep the area free from the Forsworn that keep re-spawning.\r<br />\r<br />Sky Haven Temple, Karthspire Cave, Karthspire Camp, and surrounding area, will change as new updates and quests are added.\r<br />\r<br />If you don’t like Protected Mode, you can always have your Follower mod change this attribute. Remember, once you reach your maximum number of Blade Recruits, you will not get any more.\r<br />\r<br />\r<br />For a list of Bethesda Followers go here,\r<br />http://www.uesp.net/wiki/Skyrim:Followers\r<br />\r<br />\r<br />Custom Followers should work if the mod author created them like Bethesda intended followers to work. The best way to know, is to try them out.\r<br />\r<br />\r<br />START OF UFO SPECIFIC INFO\r<br />\r<br />All UFO users – You might not need to uninstall UFO, but you need to at least dismiss all of your followers. I&#39;ve found out that the original Bethesda Rebuilding The Blade Quest doesn&#39;t work with more than one follower at a time and my mod was built from that script. (Note: They might leave and head back to where you recruited them.)\r<br />\r<br />The best way that I know is, if you haven&#39;t started the Recruit More Blades Quest, then just dismiss all of your followers, install Recruit More Blades - SkyHavenTempleEnhanced, activate it, recruit followers (one at a time, bring each one to Delphine one at a time like in the original game), dismiss each new recruit after you talk to Delphine. They will stay at SHT. Leaving the cell and coming back to SHT will cause the new Blade Recruit to get into their Blade Armor. After you’re through recruiting for a while, or have reached the maximum number of recruits I have set for this mod version, go get your followers and have fun with your new Blade Army. The number of followers and their dialog options are now controlled by UFO.\r<br />\r<br />To get your Blade follower to give up their Blade Armor and wear something else, do the following,\r<br />\r<br />1) Have them as a follower.\r<br />2) Tell them that they can dress better. This will put the Blade Armor into their inventory so that you can see and take it. They will still be wearing their Blade Armor.\r<br />3) Take their Blade Armor and then give them the new armor that you want them to wear.\r<br />\r<br />END OF UFO SPECIFIC INFO\r<br />\r<br />\r<br />START OF AFT SPECIFIC INFO\r<br />\r<br />This mod is 100% compatible with AFT if you follow the following steps.\r<br />\r<br />NOTE: Disable AFT’s Inventory Management before recruiting the follower into the Blades, so that it&#39;s disabled when the follower gets its Blade armor. Re-enable it afterwards, then the armor will correctly appear in its inventory and can be improved at the forge or changed. If you don’t Disable AFT’s Inventory Management before you recruit the follower into the Blades, they will lose their weapons and armor, which you will not be able to get back.\r<br />\r<br />1) Have no followers before talking to Delphine to Recruit More Blades for the first time. This quest starts after Alduin’s Wall Quest completes.\r<br />2) Go get a follower, (Only one at a time).\r<br />3) After you have the follower, type the following in the console; Set playerfollowercount to 1\r<br />4) Talk to Delphine about having a new recruit.\r<br />5) Repeat steps 2, 3, and 4 for each follower.\r<br />6) When you are finished recruiting all the followers you want for now, type the following in the console; Set playerfollowercount to 0\r<br />7) Enjoy your new Blade Army.\r<br />\r<br />END OF AFT SPECIFIC INFO\r<br />\r<br />\r<br />\r<br />Quest: Find a Quartermaster – The Quartermaster will be the primary quest giver. He gives out four of the Find Lost Blade Relics Quests so far, with more quests to come in future updates. The Quartermaster also gives out the quest, Helgen Blade Outpost. STATUS: COMPLETED\r<br />\r<br />Quest: Recruit More Blades – Recruit up to 30 Blade Recruits. If you recruit a follower that is also a trainer, then that Blade can still train you when asked. STATUS: COMPLETED\r<br />\r<br />Quest: Helgen Blade Outpost - “Helgen Reborn” by Mike Hancho (aka Balok on Nexus) has been integrated into the Blade vs Thalmor storyline with an additional quest to establish a Blade Outpost in Helgen. This is part of the Recruiting More Blades Quest Series. STATUS: COMPLETED\r<br />\r<br />Quest: Furnishing Sky Haven Temple and Karthspire Cave – This quest allows the player to build and furnish Sky Haven Temple and Karthspire Cave, like you would do in the Hearthfires DLC. You can also purchase a Barkeep, Merchant, Farmer, and Bard. STATUS: COMPLETED\r<br />\r<br />Note: There is some additional crafting content in this version, some will be over-powered. It will be up to each of you to decide if you use the over-powered items or leave them alone for now. The items are easy to make. I was just messing around with ideas, so enjoy them if you want. Some crafting items are just a &#39;Proof of Concept&#39;, to see if I could make them.\r<br />\r<br />Quest: Thalmor/Blade Assassination Quests – These series of quests will help defeat the Thalmor by eliminating key Thalmor Agents throughout Skyrim. There are four quests that you can play, so far in this series by MadFrenchie, which have been incorporated into the Find Lost Blade Relic Quests from my mod. More quests could happen in future updates.\r<br />\r<br />Quest: Find Lost Blade Relics – These series of quests will send the player out to find Lost Blade Relics. These are part of the Return to Glory Quests. There are four quests that you can play, so far in this series. More quests could happen in future updates.\r<br />\r<br />Quest: Paarthurnax Quest – The choice of keeping Paarthurnax alive. STATUS: COMPLETED\r<br /> \r<br />\r<br />Known Issues\r<br />\r<br />Added a Start Quest Trigger in Riverwood, so that the player wouldn’t have to start a new character every time I posted a new update to my mod. This should trigger only once per character play-through and display a message. If you need to start the Quest indicated, do what the message indicates before clicking OK. If the quest has already started or is finished, then click OK and continue playing.\r<br />\r<br />A Dialog Box should pop-up telling you to type a console command. If the Dialog Box doesn&#39;t pop-up you can just type the following in the console.\r<br />\r<br />SetStage ItsMeTooQuartermasterAlvarOrlawn001 5\r<br />\r<br />The quest to find the journal should start.\r<br />\r<br />If the quest doesn’t start and you already have Quartermaster Alvar Orlawn Journal, drop the journal, type the console command;\r<br />\r<br />SetStage ItsMeTooQuartermasterAlvarOrlawn001 5\r<br />\r<br />Then pick up the journal and the quest should start.\r<br />\r<br />End of Known Issues\r<br />\r<br />FAQ\r<br />\r<br />Q. There are Required Mods for your mod. Should I load and activate all Required Mods before talking to Quartermaster Alvar Orlawn?\r<br />A. Yes\r<br />\r<br />Q. What quest(s), in your mod, should be active when I first play your mod?\r<br />A. “Find Quartermaster Alvar Orlawn”, see Known Issues for info about this quest.\r<br />\r<br />Q. When I first talked to Delphine in Sky Haven Temple about Rebuilding the Blades I told her, “Good Luck with that.” I’ve changed my mind and now I want to help her Rebuild the Blades. What do I need to do to start the quest?\r<br />A. In the console type the following\r<br />    SetStage FreeformSkyhavenTempleA 10\r<br />\r<br />Q. I found Quartermaster Alvar Orlawn, but he won’t talk to me.\r<br />A1. Do you blame him? You have ‘bad breath’. Go brush your teeth.\r<br />A2. If you don’t have his journal, go find it.\r<br />\r<br />Q. After I talk to Quartermaster Alvar Orlawn about his journal and that quest ends, now what happens?\r<br />A. Three Side Quests should start; Helgen Blade Outpost, Find Lost Blade Relic Dragonborn Kimono, and Find Lost Blade Relic Northwind.\r<br />\r<br />Q. What is the best order to play the quests about the Blades vs Thalmor series of quests?\r<br />A. Play the quests in this order for the best immersion of the storyline about the Thalmor build-up in Skyrim after talking to Quartermaster Alvar Orlawn; Helgen Blade Outpost, Find Lost Blade Relic Northwind, Find Lost Blade Relic Captain Renault&#39;s Akaviri Katana, Find Lost Blade Relic San Soon&#39;s Kimono, Find Lost Blade Relic Dragonborn Kimono.\r<br />\r<br />NOTE: It would be best to finish the quest, Helgen Blade Outpost, before starting to Recruit More Blades. You want the Helgen Reborn quest guards to stay in Helgen and not stay at Sky Haven Temple and be counted as part of your 30 Blade Recruits.\r<br />\r<br />Q. The Helgen Blade Outpost quest doesn’t start when I talk to Quartermaster Alvar Orlawn.\r<br />A. Type the following in the console, SetStage ItsMeTooHelgenBladeOutpost 10\r<br />\r<br />Q. The Find Lost Blade Relic Northwind quest doesn’t start when I talk to Quartermaster Alvar Orlawn.\r<br />A. Type the following in the console, SetStage ItsMeTooLostBladeRelicNorthwind 10\r<br />\r<br />Q. After I finish the Find Lost Blade Relic Northwind quest, Find Lost Blade Relic Captain Renault&#39;s Akaviri Katana doesn’t start?\r<br />A. Type the following in the console, SetStage ItsMeTooLostBladeRelicRenaultAkaviriKatana 10\r<br />\r<br />Q. After I finish the Find Lost Blade Relic Captain Renault&#39;s Akaviri Katana quest, Find Lost Blade Relic San Soon&#39;s Kimono doesn’t start?\r<br />A. Type the following in the console, SetStage ItsMeTooLostBladeRelicSanSoonKimono 10\r<br />\r<br />Q. The Find Lost Blade Relic Dragonborn Kimono quest doesn’t start when I talk to Quartermaster Alvar Orlawn.\r<br />A. Type the following in the console, SetStage ItsMeTooLostBladeRelicDragonbornKimono 10 \r<br />\r<br />Q. What is the best order to talk to the NPCs so I don’t have to kill Paarthurnax?\r<br />A. Use this order of conversation; Esbern, Delphine, Greybeards, Paarthurnax, Greybeards, Delphine, Esbern.\r<br />\r<br />The reason the conversations in the Kill Paarthurnax Quest are the way they are is because, I modified some of Bethesda&#39;s main scripts and wanted to leave the original dialog and actor&#39;s voices intact and not change the way the quest unfolds. This was my best solution so that the quest would not break and give the player an option to not kill Paarthurnax.\r<br />\r<br />Yes, this order might seem strange, but look at the order carefully. It is a nested loop that needs to unfold the same way it got nested. Sometimes we have to do strange things to work around Bethesda&#39;s coding.\r<br />\r<br />Having the dialog the way I put it leaves each player the option to justify what they want to do for their role play. Some people want to kill Parrthurnax and some don&#39;t.\r<br />\r<br />Q. Why must your mod be at the end of the Load Order?\r<br />A. I modify a few of Bethesda&#39;s main scripts and if my mod is not at the end of the load order, some other mod could change these scripts back and then my mod would not work as intended. Just because you don&#39;t see anything happening doesn&#39;t mean that it didn&#39;t do something that will be used later in the game.\r<br />\r<br />Boss is not the Boss of your load order, You are. The mod authors are the best judge as to where their mods should be placed in the load order, but it&#39;s still your choice as to where you want to put them.\r<br />\r<br />I have ReProccer last and my mod right above that in the load order. I put ReProccer last because I&#39;m going to have weapons and armor added to my mod that I wanted included in the Master List. I too use SkyRe and wanted my mod compatible with this great mod. \r<br />\r<br />Q. Are Helgen Reborn and The Cyrodiil Frontier compatible?\r<br />A. Due to the size of the mod&#39;s cell, The Cyrodiil Frontier - Fight Against the Thalmor II, the game will usually CTD if you don&#39;t fast travel to the Thalmor check-point and make a hard save before you continue playing. This flushes the game buffer, which gets full when this area gets loaded.\r<br />\r<br />Make the hard save, reload that save, and then continue playing from that point. You should be okay after that, if not, just fast travel to the Thalmor check-point whenever you have to go to that location.\r<br />\r<br />When you have to travel to the Thalmor Prison, which is in the same cell as The Cyrodiil Frontier mod, just fast travel to the location and make a hard save, and continue playing from there.\r<br />\r<br />There&#39;s really not a mod conflict between these two mods, (Helgen Reborn and The Cyrodiil Frontier). It&#39;s just a lot of objects and textures being loaded in that cell.\r<br />\r<br />My mod doesn&#39;t do anything with these mods. I just place my items into the same cell and give out a quest for each one. Which ties it all together in a Blades vs Thalmor storyline.\r<br />\r<br />Q. Why are there so many Blades to recruit? I only want a few more, not 30&#33;&#33;&#33;\r<br />A. Then don&#39;t recruit more Blades than you want.\r<br />\r<br />Q. When will the mod be finished?\r<br />A. As it stands right now, this is the finished state. I&#39;ve moved on to other things. I might come back some time and add more to it, but don&#39;t know when I will. This mod will not be ported to Skyrim Special Edition. There are factors in the mod that will not let that happen.\r<br />\r<br />End of FAQ\r<br />\r<br />\r<br />Thanks and credits are as follows;\r<br />\r<br />MadFrenchie for the great cover he made for me, and the use of his Thalmor mods to put my Lost Blade Relics into which enhance the Blades vs Thalmor quest lines.\r<br />\r<br />Prime for allowing MadFrenchie and I to use his mod and textures in our mods, which enhanced and expanded the choices of Blade weapons and armor and made them look so much better than the already beautiful items they were.\r<br />\r<br />Mike Hancho (aka Balok on Nexus) for allowing me to integrate his wonderful mod “Helgen Reborn”, into my Blades vs Thalmor storyline. \r<br />\r<br />DarkFox127 for his great Creation Kit Tutorials which helped me solve some of my Creation Kit problems. Check out his YouTube Channel located here\r<br />http://www.youtube.com/user/DARKF0X127?feature=watch \r<br />\r<br />And his Website Page located here http://www.darkfox127.co.uk/\r<br /> \r<br />Everyone who gave me feedback to help improve my mod. Thanks for all the help.\r<br />\r<br />And the BIGGEST THANKS goes to Bethesda for making this great game and allowing users like me to modify it, plus giving us the tools to do it.\r<br />\r<br />\r<br />Update History -\r<br />\r<br />3Jan2015 - Mod Version, 3Jan2015, is a patch that fixes the bright lighting in the court yard and at the main stairway inside Sky Haven Temple. Plus in the Dragonborn Room if you decide to build it. You do not need to download Version 5Mar2014, if this is your first time running this mod. Use Version, 3Jan2015, it is the complete version. If you have Version, 5Mar2014 installed, just install Version, 3Jan2015, over it. If you already have Version, 5Mar2014 working, then there should be no problems installing Version, 3Jan2015, over Version, 5Mar2014.\r<br />\r<br />5Mar2014 – Added some quests and made the mod more immersive. Fix some Reference ID problems. Updated the Description with new information. Modified and updated some scripts. This is the new base mod that future updates will be based on.\r<br />8Aug2013 – Added some quests, moved some items, and removed some items so that objects from Blades Samurai Armour and Kimonos - by Prime, would look better in my mod, (there were some collisions). Added a Start Quest Trigger in Riverwood, so that the player wouldn’t have to start a new character every time I posted a new update to my mod. Fixed some dialog issues.\r<br />12June2013 – Added some scripts, converted custom voice files to .fuz format, added a merchant with a shop, added a barkeep and bar, added a farmer with a garden and animals, added a bard, added more crafting stations, added more smithing/building stations, modified the Dragonborn Room, removed some display stations, removed some Mannequins.\r<br />27Mar2013 – Fixed the custom merchant and caravan merchant bug, fixed the Blade Recruiting and journal entry bugs, added working bookshelves, added a Shrine of Talos, added clutter items to SHT, expanded the Blades to inhabit and guard Karthspire Cave and Karthspire Cave Entrance.\r<br />28Feb2013 - Recruit any 30 followers to become a Blade, Blades vs Thalmor Quests, Recover Lost Blade Relics to help return the Blades to their former Glory, Paarthurnax doesn’t have to die fix, and more.\r<br />31Oct2012 – Now 100% Compatible with UFO. Changed how you enter the Dragonborn Room and fixed it up. I think it looks better. Added a statue of Talos, removed a few Mannequins, and added some guard stations.\r<br />5Sept2012 – Added Display cases, Mannequins, waterfall, plants, and improved the Journal entry for the Rebuilding the Blades quest. Also sent more Blades to work in the Blood Seal Area of Karthspire Cave.\r<br />5Aug2012 - I was going to wait and have it part of a quest, but the uneven floors were causing lighting issues. I removed a lot of lights, moved some items, and added new things to SHT. I even removed the banners for now. I&#39;m going to give people the option of putting up different banner types in some future update. The frame-rate has been greatly improved.\r<br />29July2012 – This is version 11May2012, with a few updates and lighting fixes. This is the most stable version for now and doesn’t have the vender/merchant bug.\r<br />28July2012 – Don’t use this version or version 26July2012 (They have the Merchant Bug).\r<br />26July2012 – Changed the floor and expanded the walls of the Dragonborn room, added a Shrine to Talos, added guard locations through-out SHT, added Dragonbane back to the table in the Armory, added a Dragon Head Trophy to SHT, added a Blade Quartermaster (this is still a work-in-progress for the Quartermaster Quest), added a Dragonborn Stone (this is a work-in-progress for the UFO/EFF Recruit More Blades option)\r<br />11May2012 - Repaired the Journal problem and Delphine&#39;s dialog for a new game play, allowed the Esbern quests to start after recruiting 3 Blades, added more idle actions for the Blades, made all the fires at SHT entrance light when the Blood Seal is activated\r<br />22Apr2012 - Recruit any 20 followers to become a Blade and more training areas\r<br />20Mar2012 - Fixed most of the lighting issues and added a lot of stuff\r<br />16Mar2012 - Re-packed the archive file (there were missing files)\r<br />15Mar2012 - Re-packed the archive file to make sure that the updated scripts were included in the upload, corrected some lighting issues, added a lot stuff throughout Sky Haven Temple\r<br />08Mar2012 - Re-textured and added some Blade Banners, added and fix some lighting issues\r<br />04Mar2012 - Recruit any 10 followers to become a Blade\r<br />29Feb2012 - Added your very own room and a few more lights throughout Sky Haven Temple\r<br />18Feb2012 - More lighting outside front and back of Sky Haven Temple, Cooking Fire, Wood chopping Block with wood added to the outside area\r<br />14Feb2012 - Combined SkyHavenTempleMoreLights.esp, SkyHavenTempleBlackSmithing.esp, and SkyHavenTempleEnchantingAndAlchemyStations.esp into the SkyHavenTempleEnhanced.esp file.\r<br />Fixed some lighting issues, (Note: There are still some lighting issues, but I believe these will need to be resolved by Bethesda).\r<br />Added the following to SkyHavenTempleEnhanced.esp;\r<br />Weapon Plaques, Mannequins, More Storage Chests, More Storage Shelves, and Reading Chairs\r<br />9Feb2012 - Added Storage Chest, Storage Shelf, Soul Gem Holders to the SkyHavenTempleEnchantingAndAlchemyStations.esp file",
  "categoryId": "35",
  "version": "3Jan2015",
  "author": "ItsMeToo - klcjr on Steam",
  "createdUnix": "1330580923",
  "updatedUnix": "1420331908",
  "containsAdultContent": false,
  "uploadedBy": "ItsMeToo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000100007",
      "name": "Recruit More Blades - SkyHavenTempleEnhanced - 5Mar2014",
      "version": "5Mar2014",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7256",
      "fileName": "Recruit More Blades - SkyHavenTempleEnhanced - 5Mar2014-11750-5Mar2014.zip",
      "uploadedUnix": "1394067682",
      "modVersion": "5Mar2014",
      "virusScanUrl": "https://www.virustotal.com/file/3f57ec2ab57c47bf7e41c72a21f5c3e159062ad10590e207cde6a563822e1e7f/analysis/1407961899/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Recruit%20More%20Blades%20-%20SkyHavenTempleEnhanced%20-%205Mar2014-11750-5Mar2014.zip?fid=1000100007&ttl=1535773133&ri=8192&rs=8192&setec=f9a764d6e1dfb205bea141272976bdbb"
    },
    {
      "fileId": "1000141295",
      "name": "Recruit More Blades - SkyHavenTempleEnhanced - 3Jan2015",
      "version": "3Jan2015",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "7256",
      "fileName": "Recruit More Blades - SkyHavenTempleEnhanced - 3Jan2015-11750-3Jan2015.zip",
      "uploadedUnix": "1420331908",
      "modVersion": "3Jan2015",
      "virusScanUrl": "https://www.virustotal.com/file/c591511cf63cc2d788e30b9fed457c9944eeff60e8fbcdc5c7b08322e5a23caf/analysis/1420331946/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Recruit%20More%20Blades%20-%20SkyHavenTempleEnhanced%20-%203Jan2015-11750-3Jan2015.zip?fid=1000141295&ttl=1535773133&ri=8192&rs=8192&setec=2ae3e7864ba1ef583f5f907ae84a49c1"
    }
  ]
}