{
  "modId": 11754.0,
  "modName": "Buck Keep",
  "summary": "Adds a rather large castle like structure near Rorikstead.",
  "descriptionHtml": "*****  If you are upgrading from previous uploads and are having problems:\r\n\r\nMake sure you back up your saves and uninstall the old Buck Keep mod before downloading and installing the new one.  Also only install one mod at a time and play for a bit before installing a new mod.\r\n\r\nVersion 1.2\r\nCleaned the mod with the CK to the best of my ability.  \r\nWorked with the Fool to make him more bard like.  I still haven\\'t heard him sing.  Let me know if you do.\r\n\r\n\r\nVersion 1.1\r\nAdded Fool (bard) and cook now has a merchant menu.  Bath house attendant is now a follower.  A few other minor fixes.\r\n\r\nSome people have said that they are having problems with crashes after installing the last version.  The mod might be dirty so next release will be my attempt to clean it.  I have used clean saves and have had no problems.  Nothing is added that is a requirement...took that out a few versions ago.  I am looking into it.\r\n\r\nVersion 1.0  \r\n\r\nThis mod creates a player compound with a keep, stable, blacksmithing area, bath house, and other things.  The keep has secret areas and all manners of craftables inside.  There are 3 merchants, and numerous NPC\\'s including 3 lady followers.  \r\n\r\nAdded NPC followers (three)\r\nAdded three merchants that are not overstocked with gold.\r\n1.  Apothecary\r\n2.  Blacksmith who sells (among other things) ingots\r\n3.  A Peddler/Pawnbroker\r\nFixed various issues inside including some things that created messes, ie. dishes being knocked off shelves.\r\n\r\n*No longer requires any other mods.\r\n\r\nNumerous other small fixes.\r\n\r\n\r\nUpgrades for later versions:\r\n1.  Guards\r\n2.  Better NPC schedules\r\n3.  Even more NPC\\'s\r\n4. Explanation for player to have keep\r\nAnd more.....\r\n\r\n\r\n********************************Old Versions***************************************************\r\n\r\n\r\nBeta version 0.76\r\nUpdated some navmesh.\r\nAdded some npc\\'s\r\nStraightened some clutter and weapon plaques.  \r\n\r\n\r\n\r\nNew to modding, but this is something I created that took on a life of it\\'s own. \r\n\r\nYou may need Apachii hair to use. \r\n\r\nI\\'ve created a compound to the south east of Rorikstead near the Imperial Camp.  It contains a stable, black smith work area, two gardens, a bath house, and a keep.  The entire area is circumvented by a wall and towers.  The main tower is an armory/ barracks/ dungeon with cells and torture chamber.  \r\n\r\nThe keep has two floors with plenty of display and storage space.  It contains a kitchen with a cook (still working on the details), a main hall, a display area, servant\\'s quarters on the first floor.  More display areas with four bedrooms with 3 ladies-in-waiting, a medical commissary with a healer, and a library.  There is also a warren of secret passageways with a secret room.\r\n\r\nProblems:  \r\n\r\nAs far as the NPC\\'s go, they have very basic tasks if any at all.  I am just now learning how to mod. \r\n\r\nThere are also a few hiccups here and there as far as spiderwebbing and weapons racks not showing up correctly.  In time I will fix these.\r\n\r\nThere is an invisible ledge in front of the keep that I have no idea how to fix.  Any constructive advice would be gladly appreciated.\r\n\r\nSome of the NPC\\'s are naked.  Uploaded the mod before I worked out how to get custom clothes in the mod, but with all the body and clothes mods, dress them yourselves.  Will figure out how to make NPC\\'s companions in a later update.\r\n\r\nAs far as anything else goes, let me know what I\\'ve missed.\r\n\r\nFuture Updates\r\n\r\nOther than the obvious stated above:\r\n1.  NPC schedules\r\n2.  Gaurds\r\n3.  Custom Banners\r\n4.  Add some vendors to the keep area\r\n5.  Customize containers\r\n6.  Questline to get the keep...given by the Jarl of Whiterun after defeating the first dragon.\r\n\r\nI would love to get some help with a few of the things above.  Altering textures and scripting are not my forte.  Any help and constructive criticism would be greatly appreciated, especially if everyone likes the keep and would like to see further development other than simple bug fixes.\r\n\r\n",
  "categoryId": "67",
  "version": "1.2",
  "author": "Taocat",
  "createdUnix": "1330584709",
  "updatedUnix": "1330845290",
  "containsAdultContent": true,
  "uploadedBy": "Taocat",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39859",
      "name": "Buck Keep vs 1_2",
      "version": "1.2",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "274",
      "fileName": "Buck Keep vs 1_2-11754-1-2.rar",
      "uploadedUnix": "1330845290",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/3fb8106d5c72bc4b5a639a33d52e9ac3d675df9187917595efaf01d066ecb9f0/analysis/1406728744/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Buck%20Keep%20vs%201_2-11754-1-2.rar?fid=39859&ttl=1535773137&ri=8192&rs=8192&setec=c7b0e0e7dfe7ef57f493828b3c33938c"
    }
  ]
}