{
  "modId": 11760.0,
  "modName": "Dwemer Bunker",
  "summary": "A Dwemer bunker designed for surviving the end of Nirn.  Rumored to have been designed by Kagrenac himself.",
  "descriptionHtml": "UPDATED (3/1/12)\r\n\r\n-description-\r\n  This mod adds a Dwarven style player house I made for myself to use in my adventures.  I was always a fan of Dwarven ruins, and even lived in them back on the XBox version of Morrowind.  When skyrim came out and the Dwemer ruins were all around again i rejoiced...only to sigh when i realized that Markarth\\'s Vlindrel Hall was lamesauce. So I decided to try my hand at making a Dwarven home worthy of a Dovahkiin.\r\n    Includes:\r\n      Anvil\r\n      Workbench\r\n      Sharpening Wheel\r\n      Tanning Rack\r\n      Smelter\r\n      Enchanting Table\r\n      Alchemy Lab\r\n      Cooking Pot\r\n      3x Mannequins\r\n      30x Weapon Racks\r\n      195x Bookshelf space\r\n      1x Horadric Cube\r\n      and 50+ Containers \r\n  The containers may be a bit overkill for some, but you don\\'t have to use them all. Also the decor on the inside might not be what most would call \\\"purist friendly\\\" as selling it would generate a decent profit, but no overpowered items were added.  People will do what they do with the stuff, but it was meant to be left alone. This is my first real mod besides small things like weight changes and magic effects, so let me know what you think!\r\n\r\n-location-\r\n  Just outside of Riverwood, if you head to the center of the village and look east you can\\'t miss it...but it will be locked.  They key rests in Delphine\\'s secret basement room, on the table next the the map of Skyrim.  So you\\'ll either need to have done some of the main quest or noclip your way to it.\r\n\r\n-install-\r\n  Drop the .esp file into the skyrim\\\\data folder and activate it under your data files in the Skyrim launcher.\r\n\r\n-uninstall-\r\n  Delete the .esp file.\r\n\r\n-Incompatibility-\r\n Nothing I know of besides anything dealing with the same area outside Riverwood.\r\n\r\n-history-\r\n\r\n1) 3/1/2012- v1.0 Initial Release\r\n\r\n2) 3/1/2012- v1.1\r\n-Cut down on the towers on the exterior to give it a less intrusive feel on Riverwood and make it feel more like a \\\"bunker\\\".\r\n-Changed a few lights out\r\n-Dulled the sound of the machinery inside and out\r\n-Changed the interior music to something a little less annoying\r\n-added NMM download\r\n-added one more Mannequin\r\n\r\n\r\n",
  "categoryId": "67",
  "version": "1.1",
  "author": "Kilnem",
  "createdUnix": "1330592101",
  "updatedUnix": "1330645943",
  "containsAdultContent": false,
  "uploadedBy": "Kilnem",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39016",
      "name": "Dwemer Bunker",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "37",
      "fileName": "Dwemer Bunker-11760-1-1.zip",
      "uploadedUnix": "1330645943",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/3b9379a6b6608bfd1e8e4bb1b84583c0bdedf2a29ba97b60a0d3fbe780afc3d4/analysis/1406724275/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwemer%20Bunker-11760-1-1.zip?fid=39016&ttl=1535773153&ri=8192&rs=8192&setec=e870d22bd97acbcd98485bde718af914"
    }
  ]
}