{
  "modId": 11785.0,
  "modName": "Nimmervoller Beutel - German",
  "summary": "Der magische \\\"nimmervolle Beutel\\\" nun auch in Skyrim!\r\n\r\n",
  "descriptionHtml": "! DOWNLOAD VIA MIRROR !\r\n=========================\r\n\r\nVor dem Brisenheim in Weißlauf findet ihr einen kleinen Lederbeutel. Allerdings ist es kein gewöhnlicher Beutel, denn egal, wieviel ihr in ihm verstaut, er wird nie auch nur das Geringste an Gewicht zunehmen.\r\n\r\n\r\nDetails:\r\n\r\nDer Nimmervolle Beutel lässt sich ganz einfach durch aktivieren aufheben und befindet sich dann in euerm Inventar immer an erster Stelle.\r\n\r\nSobald ihr diesen Beutel aus dem Inventar fallen lasst (mit entsprechender Taste, mit der ihr auch andere Gegenstände aus dem Inventar entfernt), öffnet er sich bei nochmaligem Aktivieren, sodass ihr ihn füllen könnt.\r\nWenn ihr ihn im Schleichmodus aktiviert, öffnet er sich noch einmal (auch hier ist Befüllen möglich) und verschwindet dann wieder im Inventar.\r\n\r\nWenn ihr ihn einmal nicht benötigt, kann er ohne Weiteres irgendwo abgestellt und zu einem späteren Zeitpunkt wieder eingepackt werden.\r\n\r\nAchtung! Es gibt ein winziges Kuriosum:\r\nWenn ihr den Beutel vor dem Brisenheim findet und aufhebt, erscheint sofort der richtige \\\"Container-Beutel\\\". Das passiert leider auf eine etwas eigenartige Weise, sodass er auch hinter euch auftauchen kann.\r\nAlso bitte nicht erschrecken, wenn da was herumpurzelt oder im schlimmsten Fall eurem Char auf die Füße fällt. Das passiert dann später nicht mehr! Warum er das beim ersten Mal macht, ist mir selbst recht rätselhaft.\r\n\r\nIm Falle eines Verlustes:\r\nSobald ihr den Nimmervollen Beutel (Container) aktiviert, befindet sich der Nimmervolle Beutel als \\\"Item\\\" wieder in eurem Inventar. Sollte es euch passieren, dass ihr nun den Beutel (Item) im Inventar in den Nimmervollen Beutel (Container) packt und diesen schließt, oder den Nimmervollen Sack versehentlich verkauft, befindet sich nun hinter dem Brisenheim eine Tonne mit einer Karte drauf.\r\nIhr müßt in so einem Fall lediglich das Fähnchen in der Mitte der Karte aktivieren (anklicken). Daraufhin taucht der Nimmervolle Beutel samt Inhalt wieder in eurem Inventar auf. Dies wurde bis zu einem Zeitraum von 4 Ingame-Tagen getestet. \r\n\r\n\r\nSolltet ihr das Plugin \\\"Verbesserte Spielerhäuser\\\" von mir installiert haben, so ist dieser Nimmervolle Beutel schon inkludiert und ihr benötigt dieses Plugin nicht mehr. Sollte jemand 2 solche Beutel haben wollen, ist es durchaus möglich, dass das funktioniert, zumindest was die ID\\'s und Skripte betrifft, denn die habe ich unterschiedlich benannt. Im Spiel habe ich es selbst kurz getestet, und es dürfte funktioneren. Um im Inventar ein kleines Unterscheidungsmerkmal zu haben, habe ich diesen \\\"Nimmervollen Beutel\\\" in \\\"Nimmervollen Sack\\\" umbenannt.\r\n\r\n\r\nVersion 1.5:\r\nHinter dem Brisenheim befindet sich nun auf einer Tonne eine Karte mit einem Fähnchen, das bei Verlust des Beutels aktiviert werden kann. Danach befindet er sich wieder in eurem Inventar.\r\n\r\nVersion 1.4:\r\nNimmervollen Beutel (Item als auch den Container) im CK auf Eigentum des \\\"Players\\\" gesetzt. In Skyrim ist es, im Gegensatz zu Oblivion, nun so, dass NPC\\'s Gegenstände etc., die herumliegen, einfach an sich nehmen. Aus diesem Grund ist es passiert, dass der Beutel nicht mehr vor dem Brisenheim zu finden war.\r\n\r\nVersion 1.2 & 1.3:\r\n- Ordnerstruktur berichtigt!\r\n- Ordnernamen bei Skripten berichtigt!\r\n\r\nVersion 1.1:\r\n- Fehlendes Nif ergänzt, der Beutel erscheint nun korrekt!\r\n\r\n\r\nInstallation:\r\n\r\n- Die gezippte Datei an einen externen Ort entzippen.\r\n- Esp und dazugehörige Dateien in den Ordner: entsprechendes Laufwerk (...meistens C)/Programme/Steam/SteamApps/common/skyrim/Data kopieren\r\n- Esp im Skyrim-Launcher aktivieren\r\n\r\n\r\nVerwendetes Tool: Creation Kit\r\n\r\n\r\nLizenz:\r\n\r\nInhalte dieses Plugin können gerne weiterverwendet werden, allerdings nur mit Credits an alle Beteiligten.\r\nEs dürfen keine kommerziellen Zwecke damit verfolgt werden.\r\n\r\n\r\nDanksagung an:\r\n\r\n- Bethesda für dieses wundervolle Spiel und das Creation Kit!\r\n- Brausebart für die Erlaubnis, seine Skripte des Plugins \\\"Abenteuerausstattung\\\" als Vorlage für den Nimmervollen Beutel verwenden zu dürfen und für die sehr guten einführenden Erklärungen bezüglich des Skriptens im CK\r\n- Snusmumriken für die große Hilfe bei den Skripts und das Testen des Plugins!\r\n- PlanB für seine \\\"Fixed German Strings\\\"!\r\n\r\n\r\nViel Spaß mit dem Plugin!",
  "categoryId": "27",
  "version": "1.5",
  "author": "LilaMue",
  "createdUnix": "1330611211",
  "updatedUnix": "1330611211",
  "containsAdultContent": false,
  "uploadedBy": "LilaMue",
  "primaryFile": null,
  "files": []
}