{
  "modId": 11780.0,
  "modName": "Verbesserte Spieler-Eigenheime mit Nimmervollem Beutel - Ger",
  "summary": "9 verlinkte Behälter in jedem Haus!\r\nBrisenheim komplett überarbeitet - mit Nimmervollem Beutel!\r\nGut Stolzspitze & Erzmagier-Räume verbessert! - Kleine Bugs in allen Spielerhäusern behoben!\r\nNEU: Version 1.8 \r\nOnly German!",
  "descriptionHtml": "! DOWNLOAD VIA MIRROR !\r\n========================\r\n\r\n\r\n\r\nDieses Plugin fügt jedem der 5 Spielerhäuser insgesamt 9 verschiedene Behälter zu, die mit entsprechenden Behältern in den andern Spielerhäusern verlinkt sind. Jedem wichtigen Bereich ist einer dieser Behälter (Truhe, Schrank, Kommode...) zugeordnet.\r\n\r\nDas Brisenheim wurde komplett überholt! Die Räumlichkeiten habe ich vergrößert und (hoffentlich) verbessert und es gibt einen neuen Verzauberungs- und Alchemiebereich in einem eigens dafür eingerichteten Keller. Des Weiteren findet ihr im Brisenheim einen Nimmervollen Beutel!\r\n\r\nDas Haus in Einsamkeit, Gut Stolzspitze, habe ich aufgewertet, sodass es seinem hohen Preis gerecht wird. Es besitzt nun eine hauseigene Schmiede und einige neue, edle Details. Dort ursprünglich aufgetretene Bugs wurden ebenfalls behoben.\r\n\r\nAls Erzmagier stehen euch die 9 Behälter auch im Erzmagier-Quartier in Winterfeste zur Verfügung, das ich ebenfalls entsprechend verbessert habe. \r\n\r\n\r\n\r\n\r\nInhalte des Plugins:\r\n==================\r\n\r\n\r\nVerlinkte Truhen und andere Behälter:\r\n====================================\r\nDie Truhen tragen eine eindeutige Bezeichnung, sodass sie nicht mit anderen verwechselt werden können. Ich habe die jeweilige Art des Behälters so gewählt, dass er sich in das Gesamtbild des Raumes gut einfügt:\r\n\r\n- Allgemeine Truhe (statt der bisherigen Truhe, die von Anfang an in jedem Haus zu finden ist\r\n- Rüstungs-Truhe (oder Schrank)\r\n- Waffen-Truhe\r\n- Kleine Alchemie-Truhe\r\n- Tränke-Schrank\r\n- Zauber-Schränkchen\r\n- Wertsachen-Schatulle\r\n- Schmiedeutensilien-Schrank (oder Kommode)\r\n- Diebesgut-Sack (oder Truhe)\r\n\r\n\r\n\r\n\r\nDer Nimmervolle Beutel:\r\n======================\r\n\r\nWie oben erwähnt findet ihr diesen Beutel im Brisenheim. Er lässt sich ganz einfach durch Aktivieren aufheben und befindet sich dann in euerm Inventar ganz oben an erster Stelle.\r\nSobald ihr diesen Beutel aus dem Inventar fallen lasst (mit entsprechender Taste, mit der ihr auch andere Gegenstände aus dem Inventar entfernt), öffnet er sich bei nochmaligem Aktivieren, sodass ihr ihn füllen könnt.\r\nWenn ihr ihn im Schleichmodus aktiviert, öffnet er sich ebenfalls (auch hier ist Befüllen möglich) und verschwindet dann wieder im Inventar.\r\nWenn ihr ihn einmal nicht benötigt, kann er ohne Weiteres irgendwo abgestellt und zu einem späteren Zeitpunkt wieder eingepackt werden.\r\n\r\nAchtung! Es gibt ein winziges Kuriosum:\r\n-------------------------------------------------------\r\nWenn ihr den Beutel vor dem Brisenheim findet und aufhebt, erscheint sofort der richtige \\\"Container-Beutel\\\". Das passiert leider auf eine etwas eigenartige Weise, sodass er auch hinter euch auftauchen kann.\r\nAlso bitte nicht erschrecken, wenn da was herumpurzelt oder im schlimmsten Fall eurem Char auf die Füße fällt. Das passiert dann später nicht mehr! Warum er das beim ersten Mal macht, ist mir selbst rätselhaft.\r\n\r\nBei Verlust des Nimmervollen Beutels:\r\n-----------------------------------------------------\r\n... befindet sich im Erdgeschoß des Brisenheims auf einem Schrank eine Karte mit einem Fähnchen drauf. Durch Aktivieren dieses Fähnchens habt ihr den Beutel dann wieder in eurem Inventar. Das funktioniert auch, wenn ihr ihn versehentlich verkauft. Mit meiner ursprüngliche Lösung, den Beutel so teuer zu machen, dass es nicht mehr möglich war, ihn zu verkaufen, passierte es leider, dass er von Wachen wie \\\"Diebesgut\\\" abgenommen wurde.\r\n\r\nSolltet ihr das Plugin \\\"Nimmervoller Beutel\\\" von mir ebenfalls installieren wollen, dürfte das kein Problem sein, da diese beiden Behälter in keinster Weise zusammenhängen. Im Spiel habe ich es selbst kurz getestet, und es dürfte funktionieren. Um im Inventar ein kleines Unterscheidungsmerkmal zu haben, habe ich diesen \\\"Nimmervollen Beutel\\\" in \\\"Nimmervollen Sack\\\" umbenannt. \r\n\r\n\r\n\r\n\r\nBrisenheim:\r\n===========\r\n\r\nDer ursprüngliche Bereich des Brisenheims ist nun etwas umgestaltet und dadurch ein wenig größer. Vor dem Schlafzimmer habt ihr nun einen abgetrennten Sitzbereich zwischen Grünpflanzen, die ich vor allem im oberen Wohnbereich recht großzügig verteilt habe. Die abgestoßenen Möbel habe ich durch ein wenig hochwertigere ersetzt und auch das Zimmer des Huscarl ist, soweit es dessen Größe zuließ, ein wenig verbessert.\r\nNeu ist allerdings, dass sich der Alchemie-Bereich nicht mehr in einem kleinen Kämmerchen im Erdgeschoß befindet, sondern ihr habt nun für das Erstellen eurer Tränke und auch Zauber einen ein wenig verborgener Kellerraum zur Verfügung. Das ehemalige Alchemiezimmerchen ist nun ein kleines Lesezimmer, über das mittels einer Klapptüre in den Keller gelangt. \r\n\r\n\r\n\r\n\r\nGut Stolzspitze:\r\n===============\r\n\r\nEs befindet sich nun mit dem Kauf von Gut Stolzspitze eine hauseigene Schmiede in eurem Besitz, und zwar mit allen Feinheiten, die zu einer Schmiede gehören. Außerdem habe ich das Haus etwas verschönert, damit es seinem hohen Preis besser entspricht. Für etwas mehr Wärme in den Räumlichkeiten ist nun auch gesorgt, auch wenn diese leider durch die noch nicht vorhandene Möglichkeit, Navmeshes im Creation Kit zu generieren, etwas winzig ausfallen hat müssen.\r\nFolgende Bugs wurden behoben:\r\n- Fehler mit der Balkontüre gefixt! (Man ist ursprünglich nicht mehr durch diese Tür ins Haus zurückgekommen.)\r\n- Den Fehler an der Wand im Erdgeschoß (in der Ecke mit den Rüstungsdummies) habe ich ebenfalls gefixt.\r\n- Bug behoben: Korrektes Auftauchen der Einrichtung im Raum des Huscarl! \r\n\r\n\r\n\r\n\r\nHonigheim in Rifton:\r\n====================\r\n\r\nHier habe ich die verlinkten Truhen eingefügt, den Bug mit der Treppe behoben und die Räumlichkeiten minimal verschönert. Generell finde ich es nämlich nicht schlecht, wie es ist, denn es passt in diesem Stil nach Rifton und unterscheidet sich dadurch ein wenig von den anderen Spielerhäusern.\r\n\r\n\r\n\r\n\r\nHjerim in Windhelm:\r\n===================\r\n\r\nLediglich die verlinkten Behälter eingefügt.\r\n\r\n\r\n\r\n\r\nQuartier des Erzmagiers:\r\n=======================\r\n\r\nSobald euer Char zum Erzmagier geworden ist, findet ihr auch in den Räumlichkeiten des Erzmagiers in Winterfeste die zu den anderen Häusern verlinkten Behälter. Außerdem wurde dieser Bereich ebenfalls ein wenig berbessert und mit schönen, passenden Statuen ausgestattet. \r\n\r\n\r\n\r\n\r\nWichtig - Was ihr beim Laden des Plugins beachten solltet:\r\n======================================================\r\n\r\nWenn ihr das Plugin erstmals ladet, und euer Char schon in einem der Häuser wohnt, sind folgende Truhen zu räumen, da ich sie ausgetauscht habe:\r\nBrisenheim: Truhe auf dem Bücherregal im Alchemieraum.\r\n   ab Version 1.4: beide Nachtkästchen und Kommode im Schlafzimmer, Nachtkästchen und Kommode im Zimmer des Huscarl\r\n   ab Version 1.5: Waffenhalter über dem Bett und rechts vom Eingang, damit euch dort platzierte Waffen nicht abhanden kommen;\r\n+ kl. Rucksack im Lesezimmer (nur bei Update von Version 1.4 auf 1.5 oder höher)\r\n\r\nMarkarth: großer Schlafzimmerschrank, Kommode zwischen den Eingängen zum Alchemie- und Verzauberungsraum, Kommode vor dem Schlafzimmereingang\r\nRifton: großer Schlafzimmerschrank\r\nWindhelm: großer Schlafzimmerschrank\r\n\r\nWenn ihr von Version 1.5 auf 1.6 wechselt: \r\nBitte einzig vorher den Waffenständer im Brisenheim räumen! Alles andere habe ich nicht mehr verändert. \r\n\r\nBeim Wechsel von Version 1.6 auf 1.7 muss nichts Besonderes beachtet werden.\r\n\r\n\r\n\r\n\r\nAnmerkung:\r\n===========\r\n\r\nEs wurde für alle Truhen (die jeweils miteinander verbunden sind) in einer DummyCell ein Container angelegt. Sobald z. B. eine Truhe in einem der Häuser vom Player geschlossen wird, wandert der gesamte Inhalt in den entsprechenden Container in dieser DummyCell. Die Truhen in den Häusern sind dann leer.\r\nAus diesem Grund passiert es, dass, wenn ihr zu einer dieser Truhen kommt, diese erst immer als \\\"LEER\\\" deklariert sind. Bei Aktivieren derselben wandert der Inhalt wieder aus der DummyCell in die Truhe, und somit steht euch der gesamte Inhalt auch aus den anderen Häusern zur Verfügung. Also bitte nicht durch dieses \\\"LEER\\\" erschrecken lassen. \r\n\r\n\r\n\r\n\r\nVerbesserungen in Version 1.8:\r\n=============================\r\n\r\nAb jetzt könnt ihr eure Begleiter in alle Bereiche mitnehmen!\r\nBrisenheim: NavMeshes im Alchemie-Keller\r\nGut Stolzspitze: NavMeshes in der Schmiede\r\n\r\n\r\nAlle Verbesserungen in den einzelnen Version findet ihr detailiert in der Beschreibung der Mod!!!\r\n\r\n\r\n\r\nInstallation:\r\n===========\r\n\r\n- Die gezippte Datei an einen externen Ort entzippen.\r\n- Esp und zugehörige Dateien in den Ordner: entsprechendes Laufwerk (...meistens C)/Programme/Steam/SteamApps/common/skyrim/Data kopieren\r\n- Esp im Skyrim-Launcher aktivieren\r\n\r\n\r\n\r\n\r\nVerwendetes Tool: \r\n=================\r\n\r\nCreation Kit\r\n\r\n\r\n\r\n\r\nInkompatibilität:\r\n===============\r\n\r\n- Das Plugin ist mit Mods inkompatibel, die in den Playerhäusern genau dieselben Dinge verändern, die ich oben beschrieben habe\r\n\r\n- Dovakhiin Hideout dürfte zusammen mit meiner Mod kompatibel sein, habe ich den Eingang zum Alchemiebereich im neuen kleinen Leseraum (ehem. Alchemiebereich) eingefügt habe, und nicht wie ursprünglich geplant, unter der Treppe. - Wenn ihr Plugins wie Shadow Striping Fix verwendet, so solltet ihr diese vor meinem Häuserplugin laden. Ich habe alle mir aufgefallenen Schatten-Bugs behoben.\r\n\r\n- Die Mod ist kompatibel mit dem Plugin \\\"Nimmervoller Beutel\\\". \r\n\r\n\r\n\r\n\r\nLizenz: \r\n======\r\n\r\nInhalte dieses Plugin können gerne weiterverwendet werden, allerdings nur mit Credits an alle Beteiligten (was vor allem auch für die Skripte gilt!), jedoch dürfen damit keine kommerziellen Zwecke verfolgt werden.\r\n\r\n\r\nUnd an dieser Stelle noch ein persönliches Anliegen:\r\n\r\nWarum ich nicht nur die \\\".pex-Dateien\\\" der Skripte mitliefere, hat einen Grund, und ich muss zu dieser neuen Entwicklung einfach mal was sagen!\r\nIch persönlich bin überzeugt davon, dass es der eigentlich positiven Entwicklung der Modder-Community in den letzten Jahren äußerst abträglich ist, hier anders als bisher zu verfahren. Es sind wundervolle Modifikationen gerade durch die Einsicht in andere Mods (incl. deren Skripte) von guten Leuten entstanden. Wir alle brauchen Beispiele von guten Moddern (womit ich jetzt nicht mich meine) um von ihnen lernen zu können. Argumente, dass dann Wissen weiterverwendet und nicht honoriert würde, kann ich so nicht gelten lassen. Deshalb bitte ich an dieser Stelle all jede, die über solche Kenntnisse verfügen, diese wie bisher weiter zu geben, und all jene, die solch ein Wissen, so wie ich nutzen dürfen, dies auch angemessen zu honorieren.\r\n\r\n\r\n\r\n\r\nDanksagung an:\r\n==============\r\n\r\n- Bethesda für dieses wundervolle Spiel und das Creation Kit!\r\n- Brausebart für die Erlaubnis, seine Skripte des Plugins \\\"Abenteuerausstattung\\\" als Vorlage für den Nimmervollen Beutel verwenden zu dürfen und für die sehr guten einführenden Erklärungen bezüglich des Skriptens im CK!\r\n- Snusmumriken für die große Hilfe bei den Skripten und für das Testen des Plugins!\r\n- Argomirr für das Skript seines Plugins \\\"Linked Home Chest\\\", das zur Orientierung gedient hat!\r\n- Dem Team vom Ei-der-Zeit und Hebrock für die Hilfestellungen beim Skripten!\r\n- PlanB für seine \\\"Fixed German Strings\\\"!\r\n\r\n",
  "categoryId": "67",
  "version": "1.8",
  "author": "LilaMue",
  "createdUnix": "1330609391",
  "updatedUnix": "1330609391",
  "containsAdultContent": false,
  "uploadedBy": "LilaMue",
  "primaryFile": null,
  "files": []
}