{
  "modId": 11803.0,
  "modName": "Deus Mons",
  "summary": "A fairly large and detailed player stronghold. Check screenshots if you need a reason to download this.",
  "descriptionHtml": "NEW Version of STS by qlhaele. It&#39;s awesome&#33;\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=17289]Just Re-Released, Sleeping Tree Sanctuary[/url]\r<br />[youtube]BN9d-5PJJA0[/youtube]\r<br />\r<br />From eldiabs: No longer supporting this mod. Have fun doing whatever, re-upload, blah blah blarg. Good luck trying to fix. She&#39;s one of the oldest &#39;over-rated&#39; house mods out there, and a lot of people have added to it. Much has changed since the creation kit first came out. Recommend starting with the oldest of the old if you&#39;re going to make any attempt. Probably better just starting over from scratch with your own awesome idea, but do what you wish with this one.\r<br />\r<br />Name: Deus Mons \r<br />Version: 1.211\r<br />Date: 3/1/2012\r<br />Category: Abodes\r<br />Author(s): ElDiabs (story,design), Daemonjax (scripts,testing), koaandl (npcs), Utopolyst (npc edits), timohatt1981 (navmesh improvements in LQ)\r<br />\r<br />Thanks again for all of the support and endorsements everyone. This mod took 3rd place in files of the month for March, which is WAY more than I would have expected of a player home with all of the great stuff coming out almost daily. - ElDiabs\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/18798]Polish Translation[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=15577]German Translation[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=13089]Spanish Translation[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=12414]Italian Translation[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/21663]French Translation[/url] - Updated\r<br />\r<br />This guy makes my favorite videos for player homes.\r<br />[youtube]zXhNlvu22-8[/youtube]\r<br />\r<br />I actually really liked this video...sort of a teaser...it&#39;s short...but creative, very cool ihatemondays999&#33;\r<br />[youtube]N4NhTZU-f1M[/youtube]\r<br />\r<br />Video of an older (probably more stable) version of Deus Mons by pyrodino (TehMaskedRacoon)\r<br />[youtube]VNCPigcQGeA[/youtube]\r<br />\r<br />Gamespot Top 5 video\r<br />[youtube]VTgmVqSg-N0[/youtube]\r<br />\r<br />Video walk through by ArsenalRobert.\r<br />[youtube]PYnvk_mqRl4[/youtube]\r<br />\r<br />A very thorough walk through by MemorabIe.\r<br />[youtube]vCjjYsu4cuE[/youtube]\r<br />\r<br />[img]http://www.lightalivephotography.com/img/s3/v39/p979545291-4.jpg[/img]\r<br />I don&#39;t normally ask for my files to be endorsed, but if you enjoyed this, take a moment to click the thumbs up button in your download history. In fact, how about endorsing every file you have used and enjoyed on the Nexus??\r<br />\r<br />It&#39;s actually easier then installing the mod itself. However, the choice is yours. Have fun&#33;\r<br />\r<br />Remember to back up your saves, just in case. There have been reports of the dragon priest masks and some chests resetting and users losing their loot in the newest updates. It is recommended you remove everything from the forge area chests as well as the dragon priest masks when updating. If you did not read this warning, placed here and in the known issues section, bummers&#33;\r<br />\r<br />Game crashes on startup are due to not having the esm (which is the master file for this mod) enabled with the esp file. Also, this mod may conflict with other player homes, although I&#39;ve tested it with my other three homes and it works fine. It&#39;s as &#39;clean&#39; as I can make it.\r<br />\r<br />Please read the description before asking questions about bugs or issues you are having. Check the known issues/bugs and version sections below for possible solutions. \r<br />\r<br />For people having the building fade into view, please see bugs section below.\r<br />\r<br />Also, this is a Nexus only mod, omitting translations to a point. I would prefer you put the translation on the Nexus though, but it is not required. Thank you.\r<br />\r<br />Recommended\r<br />=============\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=10361]Just In Time Lighting[/url]\r<br />Please take the time to endorse this mod. Without it I would not have been able to do the dynamic lighting in such a way. -- Eldiabs\r<br />\r<br />-I used [url=http://skyrim.nexusmods.com/downloads/file.php?id=11650]Jasmin ENB Real Cinema[/url] for many of the screenshots (the older version). I like the cinematic effect for screens. Not my personal preference for gameplay, but still worth checking out.\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=10891]Unlimited Bookshelves[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=11370]Spouses Can Live Everywhere[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=9504]Followers Can Relax[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=10652]Vanilla Mannequin Script Fix[/url] - Recommend Alternative version (eldiabs)\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=9131]Female Mannequins[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=10216]House Decorations[/url]\r<br />\r<br />I also HIGHLY recommend using [url=http://skyrim.nexusmods.com/downloads/file.php?id=1840]Wrye Bash[/url] and [url=http://skyrim.nexusmods.com/downloads/file.php?id=6]BOSS[/url] to help in reducing mod conflicts. You&#39;ll be amazed at how well your game will function after using these.\r<br />\r<br />Description\r<br />===========\r<br />A fairly large and detailed player stronghold. Check screenshots if you need a reason to download this. Why such a ridiculously spacious castle you may ask? Because. \r<br />\r<br />Location\r<br />========\r<br />Deus Mons is located atop a peak south of the Throat of the World. However, I recommend you first head to Vilemyr Inn in Ivarstead and look for a book in one of the rooms. No quest attached, so it is not necessary, but it provides a bit of a backstory.\r<br />\r<br />[img]http://www.lightalivephotography.com/img/s3/v39/p946064642-3.jpg[/img]\r<br />\r<br />[img]http://www.lightalivephotography.com/img/s3/v39/p839733799-2.jpg[/img]\r<br />\r<br />Details\r<br />=======\r<br />Take down a powerful dragon to obtain the key to Deus Mons.\r<br />[img]http://www.lightalivephotography.com/img/s11/v28/p896859787-3.jpg[/img]\r<br />\r<br />Hall of Heroes and Gods\r<br />[img]http://www.lightalivephotography.com/img/s3/v45/p786097253-2.jpg[/img]\r<br />\r<br />Enjoy the Underfalls\r<br />[img]http://www.lightalivephotography.com/img/s11/v35/p811230662-2.jpg[/img]\r<br />\r<br />Garden In the Overfalls\r<br />[img]http://www.lightalivephotography.com/img/s11/v29/p854009704-2.jpg[/img]\r<br />\r<br />Pool area..ish\r<br />[img]http://www.lightalivephotography.com/img/s3/v45/p822281484-2.jpg[/img]\r<br />\r<br />Check out the screens page for plenty more.\r<br />\r<br />Install\r<br />======\r<br />1. Use NMM to install. Esm and esp should automatically activate once installed.\r<br />2. Manually install contents of archive in Skyrim/Data folder.\r<br />\r<br />Uninstall\r<br />=========\r<br />Make sure to save outside of the cell being uninstalled. This has been common practice since Fallout 3. If you save inside of a cell and uninstall the mod controlling that cell , all manner of oddness will most definitely occur.\r<br />\r<br />1. Use NMM\r<br />2. Delete the book pic textures (textures/ElDiabs), scripts, .esp and .esm files from your Skyrim/Data folder.\r<br />\r<br />Upgrade\r<br />=======\r<br />Back up your saves. There are known bugs with upgrading mods...unfortunately. I try to have a working and complete mod first time around, but some people make decent suggestions worth implementing. Keep this in mind when upgrading to a newer esp.\r<br />\r<br />Make sure to save outside of the cell being upgraded. This has been common practice since Fallout 3. If you save inside of a cell and upgrade the mod controlling that cell , all manner of oddness will most definitely occur.\r<br />\r<br />1. Unless otherwise stated in the download description, uninstall old version with NMM and install and activate new version...easy stuff. Updates may just be overwrites and not require the  entire mod to be uninstalled first.\r<br />2. Manually remove old esm and esp files from Skyrim/Data folder. Install new ones. \r<br />\r<br />Incompatibility\r<br />===============\r<br />For future use. Please report any you find.\r<br />\r<br />NPCs\r<br />===============\r<br />-The Deus Mons with NPCs option is an entirely stand alone package, which includes the Main ESM, a seperate ESP with fixed navmeshes and seven NPCs to make the castle less lonely, the NPCs include:\r<br />  - A Bard.\r<br />  - A Hunter.\r<br />  - A Blacksmith.\r<br />  - A Cook.\r<br />  - A Thief/Gardener.\r<br />  - A Librarian.\r<br />  - A Priestess.\r<br />\r<br />-All NPCs have their own schedules, and will wander about the Castle doing their chores and business, interacting with the environment.\r<br />\r<br />-Companion NPCs:\r<br />  -An &#34;Aural Paladin&#34;, a Strong, Two-Hander wielding warrior, with the ability to heal himself and others, as well as repelling undead monstrosities. Has a fast, flanking combat style, preferring to swing from the front or sides in fast strikes with occasional power attacks, and little blocking.\r<br />\r<br />  -A &#34;Rogue&#34;, a Quick, Agile Khajit, who dual wields daggers, with the ability to poison and slow foes. Enters combat by poisoning or slowing nearby foes, and and using his bow until an enemy closes in. When confronted by a melee range enemy, he will circle them and stab quickly.\r<br />\r<br />-Guards\r<br />  -Guards may be purchased for the Castle, they will maintain a post, occasionally wandering. There is one to two guards for every area, except for the Underfalls.\r<br />\r<br /> \r<br />Known Issues or Bugs\r<br />====================\r<br />Remember to back up your saves, just in case. There have been reports of the dragon priest masks and some chests resetting and users losing their loot in the newest updates. It is recommended you remove everything from the forge area chests as well as the dragon priest masks when updating\r<br />\r<br />-Structure fades into view...looking a bit odd. \r<br />Quick solution: Face away from the building, save the game and quit. Reload and turn around. Building should be there.\r<br />For those with a decent computer: BACKUP and then open your Skyrim.ini. Under [General] change ugrids to 7 (see below example). REMEMBER that changing ugrids affects save games and you will need to consult the tutorials at [url=http://donotargue.com/cfg-makers/skyrim]Do Not Argue[/url] to revert things. This probably will cause issues with awesome mods like Warzones, so I don&#39;t personally recommend it...but it does work. - eldiabs\r<br />[General]\r<br />uGridsToLoad=7\r<br />\r<br />-Lower end machines may experience lag or performance issues in some areas. Also, random lag may accur in interior sections. I&#39;ve had this with many mods. Solution is to save, exit, and reload. Works every time.\r<br />\r<br />-Horse will probably spawn in weird places...if anyone can fix this, let me know.\r<br />\r<br />-Will be dark for some enb setting and realistic lighting users. I built this according to the bethesda lighting, which is quite nice in my opinion. Download one of the light placement mods floating about and light the place up to your tastes. I won&#39;t be adding more lights. I did test it with [url=http://skyrim.nexusmods.com/downloads/file.php?id=11650]Jasmin ENB[/url] and it looked really good, except for the fx above some statues and in the pool.\r<br />\r<br />-Dragon clips through objects. Dragons clip through objects in the vanilla game as well. Dragon also likes to dive bomb you off of bridge. Sort of funny actually...I fell to my death twice when fighting him. Dragon may also decide to orbit. Shout the bastard down&#33;\r<br />\r<br />-Upon first entering into living quarters cell, mannequins and weapon racks may behave strangely. Simply leave the cell and re-enter.  For much better mannequins, download SLuckyD&#39;s & Daemonjax&#39;s [url=http://skyrim.nexusmods.com/downloads/file.php?id=10652]Vanilla Mannequin Script Fix[/url]. - eldiabs\r<br />\r<br />-In the Living Quarters, there&#39;s a specfic area where the Depth of Field in that imagespace behaves in an unintended way.  If it bothers you a lot, then you can use this .ini tweak in skyrimprefs.ini:\r<br />[Imagespace] \r<br />bDoDepthOfField=0 \r<br />\r<br />However, I&#39;d recommend leaving it alone for now. It&#39;s only a problem for that one room, and it doesn&#39;t affect gameplay. Next update, I&#39;ll tone the effect down.  -- DJ\r<br />\r<br />History\r<br />=======\r<br />1.21\r<br />- new armor and clothes\r<br />- less guards (better performance for many PCs)\r<br />- moved the guards position\r<br />- Renamed all scripts to DeusMons_(x); (x)=Bard, Hunter, Guards, etc... -&gt; Better Compability.\r<br />\r<br />1.1 \r<br />Adds two new companions. \r<br />\r<br />(Life Branch 1.0)\r<br />Updated to include seven new NPCs, two of which are vendors.\r<br />\r<br />.72a\r<br />ESP only update. Might fix companion issue in Living Quarters.\r<br />\r<br />.72 (Read warnings)        \r<br />Added coal to forge and some fire fx.\r<br />Fixed wood beams in entrance area of LQ - uneven.\r<br />Removed light on middle mannequin below stairs across from bedroom. Too many lights, was causing shader issues.\r<br />New name for dragon - Deussosdova - Thanks for the suggestion logomac3.\r<br />Fixed space in forge area on floor, and added another rug.\r<br />Fixed Lighting Controllers and Balls so they should function properly when using portal statues - Thanks for all the testing, troubleshooting, and pointers Daemonjax.\r<br />Added critterspawn script - All credit goes to Daemonjax.\r<br />Cleaned up the esm and esp files a bit.\r<br />\r<br />Warnings due to 1.5 patch: \r<br />-Personally all of my save games have been corrupted by the new 1.5 patch and mods edited with the new version of the CK. BACK UP YOUR SAVES before installing if you choose to try this version. Nothing I can do to fix this, ask the developers for support. You can try doing a clean save by removing all of your gear from the home, saving somewhere far away from the location, disabling and uninstalling it, then installing the new version from scratch. However...I don&#39;t know if this will even work. Best of luck.\r<br />-Using portal statues constantly will result in a CTD. You will be able to go through them after reloading.\r<br />-Fast Travel to Deus Mons may cause CTDs (another new bug introduced in 1.5). In a new game it worked for me, just a heads up.\r<br />-Excessive use of doors to exterior roof from Overfalls may cause CTDs. You can continue to use them after reloading.\r<br />\r<br />v0.71\r<br />Added scripts to keep mannequins from floating - all credit to deamonjax, the creator of [url=http://skyrim.nexusmods.com/downloads/file.php?id=10361]Just In Time Lighting[/url]\r<br />Fixed missing columns in exterior below bridge\r<br />Added additional lighting near azura statue\r<br />Redesigned forge area. Old forge was acting odd for some and was boring anyway. Here&#39;s something a little different.\r<br />\r<br />v0.7\r<br />Please be aware this update may alter things drastically. I edited the esm file in TESVSnip and Wrye Bash. Tested on multiple saves and it works, but who knows...Back up your saves just in case&#33;\r<br />Wrye Smash may give you a warning about the esm file. It is fine, just click ok when it pops up.\r<br />Fixed save game crashes&#33; Thanks madriel222 and the others who sent me their save games.\r<br />Fixed lod on platforms below talos statues outside.\r<br />Added dragon priest masks to armory.\r<br />Added collision to statue in hall.\r<br />Added animal parts container.\r<br />Added servant quarters.\r<br />Added additional weapon display cases.\r<br />Added roombounds to living quarters in an attempt to reduce lag. Extended a small area to make this work.\r<br />Fixed fireplace lights when going through portal. Another lighting controller. More lights.\r<br />\r<br />v0.62\r<br />Fixes exterior gap near main hall entrance by bridge.\r<br />Removes current in water...forgot to do that.\r<br />Redid navmesh near stairs in living quarters.\r<br />\r<br />v.61\r<br />Fixed ingots in vault chests...gah\r<br />Removed loot list from safes. All containers in the game have been set to no respawn since release...no worries.\r<br />Added unobtrusive &#39;portals&#39; of a sort. Connect Under and Overfalls as well as Overfalls and Living Quarters.\r<br />Removed alchemy table in Underfalls. Left benches in case people want to populate them with clutter from other mods.\r<br />Added this description to a txt file to the archive for downloading.\r<br />\r<br />v.6\r<br />Fixed exterior worldspace navmesh across bridge and into main hall.\r<br />Fixed navmesh in Underfalls.\r<br />Fixed some rocks outside not properly displaying.\r<br />Added navmesh to top tower.\r<br />Added a bedroom door and some treasure chests to Vault.\r<br />\r<br />v0.55\r<br />Removed Full LOD setting from portions of structure that refuse to accept said command resulting in them not being visible. See bug list for solution to keeping structure from fading into view.\r<br />\r<br />v0.5\r<br />Initial Release\r<br />\r<br />Credit\r<br />==========\r<br />Daemonjax - lighting and critterspawn scripts, testing, overall support\r<br />koaandl - NPCs, recruiting, dialogue\r<br />Utopolyst - improvement of NPCs and general clean up\r<br />timohatt1981 - worked on the new esp to improve navmesh\r<br />\r<br />Tools Used\r<br />==========\r<br />Creation Kit\r<br />Wrye Smash\r<br />TESVSNip\r<br />7-Zip - http://www.tesnexus.com/downloads/file.php?id=15579\r<br />Readme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r<br />\r<br />\r<br />I don&#39;t accept donations for my work, but I do endorse donations to [url=http://www.childsplaycharity.org]Child&#39;s Play[/url].\r<br />\r<br />My other player homes:\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=9904]Ranger Ridge[/url]\r<br />[img]http://www.lightalivephotography.com/img/s11/v36/p920078971-3.jpg[/img]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=9064]Domus Dementis[/url]\r<br />[img]http://www.lightalivephotography.com/img/s3/v44/p990809500-3.jpg[/img]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=8197]Dragonsreach Hideout[/url]\r<br />Assassin\r<br />[img]http://www.lightalivephotography.com/img/s11/v35/p861080018-3.jpg[/img]\r<br />Nightingale/Thief\r<br />[img]http://www.lightalivephotography.com/img/s11/v35/p545306029-3.jpg[/img]",
  "categoryId": "67",
  "version": "1.211",
  "author": "Eldiabs - Daemonjax - koaandl - Utopolyst",
  "createdUnix": "1330630187",
  "updatedUnix": "1335369150",
  "containsAdultContent": false,
  "uploadedBy": "eldiabs",
  "primaryFile": null,
  "files": [
    {
      "fileId": "38972",
      "name": "Deus Mons ",
      "version": ".55",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1671",
      "fileName": "Deus Mons -11803.7z",
      "uploadedUnix": "1330637291",
      "modVersion": ".55",
      "virusScanUrl": "https://www.virustotal.com/file/d43376951d0e27b4c1594132f55cbcc61d4beea87c8f772a6688f40cff436454/analysis/1406724073/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deus%20Mons%20-11803.7z?fid=38972&ttl=1535773225&ri=8192&rs=8192&setec=25bb91988a07edfcaf0f667a09dc9c31"
    },
    {
      "fileId": "39622",
      "name": "Deus Mons v_62",
      "version": ".62",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "130",
      "fileName": "Deus Mons v_62-11803.7z",
      "uploadedUnix": "1330794792",
      "modVersion": ".62",
      "virusScanUrl": "https://www.virustotal.com/file/aad46167a41cbbfaa9a9162f9b8b816f9b39054c5add2ea522ad82e6f1275925/analysis/1406727483/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deus%20Mons%20v_62-11803.7z?fid=39622&ttl=1535773225&ri=8192&rs=8192&setec=e7d360796e310ca7def69e8490be39b7"
    },
    {
      "fileId": "39700",
      "name": "Deus Mons Full With Update ESM added",
      "version": ".62Full",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1713",
      "fileName": "Deus Mons Full With Update ESM added-11803.7z",
      "uploadedUnix": "1330810211",
      "modVersion": ".62Full",
      "virusScanUrl": "https://www.virustotal.com/file/99c1771c78c641d9e1285bb86fa0dca8a58f6099b747592a9c92be7a3879bdf2/analysis/1406727794/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deus%20Mons%20Full%20With%20Update%20ESM%20added-11803.7z?fid=39700&ttl=1535773226&ri=8192&rs=8192&setec=c8a52e109c4742c528e2063b1d95cdf8"
    },
    {
      "fileId": "40613",
      "name": "Deus Mons v_7",
      "version": ".7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1726",
      "fileName": "Deus Mons v_7-11803.7z",
      "uploadedUnix": "1330998357",
      "modVersion": ".7",
      "virusScanUrl": "https://www.virustotal.com/file/022da5cfb1b8241aa6bfc7c1e1c482c5ebf1b3161b0111918156fa64cc003584/analysis/1406733976/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deus%20Mons%20v_7-11803.7z?fid=40613&ttl=1535773226&ri=8192&rs=8192&setec=d592b8c374ba4f41c833ec111f9b2c64"
    },
    {
      "fileId": "40789",
      "name": "Deus Mons v_71",
      "version": ".71",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1768",
      "fileName": "Deus Mons v_71-11803.7z",
      "uploadedUnix": "1331054923",
      "modVersion": ".71",
      "virusScanUrl": "https://www.virustotal.com/file/4d6de75fd6deb5ad0773214155d7bf1923081e9d629e15441e470fe3e41087f0/analysis/1406734869/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deus%20Mons%20v_71-11803.7z?fid=40789&ttl=1535773227&ri=8192&rs=8192&setec=3baa5b0918985a485c69590548220ccf"
    },
    {
      "fileId": "45868",
      "name": "Deus Mons v_72",
      "version": ".72",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1764",
      "fileName": "Deus Mons v_72-11803.7z",
      "uploadedUnix": "1332469020",
      "modVersion": ".72",
      "virusScanUrl": "https://www.virustotal.com/file/eab920472838c3ccd8095929500ba55331d17c6c81d2c1b25ac399b1e1f3fa72/analysis/1406773984/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deus%20Mons%20v_72-11803.7z?fid=45868&ttl=1535773228&ri=8192&rs=8192&setec=754dea7fb631122bdd595397aea4ac5b"
    },
    {
      "fileId": "50413",
      "name": "Deus Mons v_72 ESP Fix",
      "version": "v0.72a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "140",
      "fileName": "Deus Mons v_72 ESP Fix-11803.7z",
      "uploadedUnix": "1333663775",
      "modVersion": "v0.72a",
      "virusScanUrl": "https://www.virustotal.com/file/e5cc26529ef749d4fe9bdb92d130b61bac27dd226556da89a37dcf65c8bdbc9f/analysis/1406799215/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deus%20Mons%20v_72%20ESP%20Fix-11803.7z?fid=50413&ttl=1535773228&ri=8192&rs=8192&setec=2635417b93ac9adbb34113cf39d2b4ba"
    },
    {
      "fileId": "50991",
      "name": "Deus Mons - NPCs and Vendors",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1795",
      "fileName": "Deus Mons - NPCs and Vendors-11803.7z",
      "uploadedUnix": "1333826642",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a0875860e398a3b7547f98889e11ab1d60f9808728be7d6edd3432d7c37b1758/analysis/1406802610/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deus%20Mons%20-%20NPCs%20and%20Vendors-11803.7z?fid=50991&ttl=1535773229&ri=8192&rs=8192&setec=1fdc10144f275f4194ec40dc9ed3c30c"
    },
    {
      "fileId": "51143",
      "name": "Deus Mons NPCs Navmesh Fix",
      "version": "1.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "154",
      "fileName": "Deus Mons NPCs Navmesh Fix-11803.7z",
      "uploadedUnix": "1333866150",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/77916596210e686ea35b9ee01c53aae7822584ef2ee20beeb1009b0758ea8f3e/analysis/1406803446/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deus%20Mons%20NPCs%20Navmesh%20Fix-11803.7z?fid=51143&ttl=1535773230&ri=8192&rs=8192&setec=c04f4a2b88db19d1d515e2acb78ac673"
    },
    {
      "fileId": "51698",
      "name": "Deus Mons - NPCs Companions and Vendors",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1793",
      "fileName": "Deus Mons - NPCs Companions and Vendors-11803.7z",
      "uploadedUnix": "1333997703",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/13aef2ad137d4ebbadc52e3e3fa96182d479cfea23999868f794a810f82f8dd9/analysis/1406806336/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deus%20Mons%20-%20NPCs%20Companions%20and%20Vendors-11803.7z?fid=51698&ttl=1535773231&ri=8192&rs=8192&setec=c8a0b87f01474a221f26d7d3fbf3a8b5"
    },
    {
      "fileId": "52065",
      "name": "Deus Mons - Guards and Gold Fixed",
      "version": "1.12",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1796",
      "fileName": "Deus Mons - Guards and Gold Fixed-11803.7z",
      "uploadedUnix": "1334093281",
      "modVersion": "1.12",
      "virusScanUrl": "https://www.virustotal.com/file/60771c09355972b772ca11afda256fd20bdb6c62f7a1b5d1e647d51821f7bc3a/analysis/1406808310/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deus%20Mons%20-%20Guards%20and%20Gold%20Fixed-11803.7z?fid=52065&ttl=1535773231&ri=8192&rs=8192&setec=29bdd6e64c0710a9d87cf15887721ee5"
    },
    {
      "fileId": "53523",
      "name": "Deus Mons v_1_21",
      "version": "1.21",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1778",
      "fileName": "Deus Mons v_1_21-11803-1-21.7z",
      "uploadedUnix": "1334519469",
      "modVersion": "1.21",
      "virusScanUrl": "https://www.virustotal.com/file/4cdfa63be97e5693a392d5195861271f25dba1ae0136f1ab7e4705343df24396/analysis/1406817493/",
      "changelogHtml": " new armor and clothes <br/> \n less guards (better performance for many PCs) <br/> \n moved the guards position <br/> \n Renamed all scripts to DeusMons_(x); (x)=Bard, Hunter, Guards, etc... -> Better Compability <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deus%20Mons%20v_1_21-11803-1-21.7z?fid=53523&ttl=1535773232&ri=8192&rs=8192&setec=944c122b60f2ad57cab213f0b2245af2"
    },
    {
      "fileId": "54274",
      "name": "Deus Mons withNPCs AI Fix",
      "version": "1.211",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "157",
      "fileName": "Deus Mons withNPCs AI Fix-11803-1-211.7z",
      "uploadedUnix": "1334762511",
      "modVersion": "1.211",
      "virusScanUrl": "https://www.virustotal.com/file/c98be641e6d835ba6cd633f30bc11c867a2615702f7be53c405027c0229c22fd/analysis/1406821863/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deus%20Mons%20withNPCs%20AI%20Fix-11803-1-211.7z?fid=54274&ttl=1535773232&ri=8192&rs=8192&setec=45eb250f156427b28e068538c31be865"
    },
    {
      "fileId": "56223",
      "name": "Deus Mons withNPCs by Tim",
      "version": "1.211b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "163",
      "fileName": "Deus Mons withNPCs by Tim-11803-1-211b.zip",
      "uploadedUnix": "1335369150",
      "modVersion": "1.211b",
      "virusScanUrl": "https://www.virustotal.com/file/effef840cc82c55a53a7269c0edcbe05e504e43272a089bbc1b52c4d9b1b167d/analysis/1406840178/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deus%20Mons%20withNPCs%20by%20Tim-11803-1-211b.zip?fid=56223&ttl=1535773233&ri=8192&rs=8192&setec=fa2c8d281e6eac09c91ad83c18012977"
    }
  ]
}