{
  "modId": 11828.0,
  "modName": "Better Ebony Blade",
  "summary": "Unleash the true power of the Ebony Blade!\r\n\r\nThis mod offers adjustments and bugfixes for the ebeony blade to make it powerful but yet still balanced",
  "descriptionHtml": "Since the vanilla Ebony Blade was extremely underpowered compared to other weapons I fixed some bugs and made some adjustments.\r\nI focused on improving the whole mechanic rather than just increasing weapon damage - tried to balance it to other weapons though.\r\n\r\nThe base damage of the weapon remains unchanged.\r\nAs the powerful enchant is what makes this weapon unique, i adjusted the twohanded perk barbarian so that it not just works now but actually also increases the Ebony Blade\\'s absorb enchant.\r\n\r\nFurthermore the weapon AND enchant will now be improved by the fortify twohanded enchant. (Note: to achieve this is had to modify the enchant so that it increases the damage of ALL destruction spells - since they were quite underpowered i think this shouldnt be that much of a problem)\r\nLast but not least the Ebony Blade is now ready for sharpening at a grindstone, it will benefit from the daedric smithing perk too.\r\n\r\nThis is my first mod, so id love to see some comments, hope you enjoy it :)\r\n\r\nChangelog:\r\n\r\nv1.1 \r\n- all tooltips translated into english\r\n- increased value (2000 > 18000) to reflect increased power potential\r\n\r\n- reduced enchant enhancements: \r\n    - barbarian perk: now increases enchant effect by 12% per rank\r\n    - fortify twohanded: destruction spell bonus reduced to ca. 60% of twohanded bonus\r\n> decided to do this because the drain effect got to fast to strong, you can still reach drain amounts of more than    100 per hit with perks and well enchanted gear, still very powerful but in my opinion reflects the power of 10 absorbed souls very well\r\n\r\n- pre-enchanted fortify two-handed gear now also increases the power of destruction spells (and therefore the ebony blades drain effect)\r\n\r\nknown issues:\r\nas it seems, combined enchants are bugged so that just one of the enchantments will benefit from enchanting skill/ perks  (same with the restore magic compnent from combined robe enchants ) Don\\'t know how to fix this yet, hints are welcome ;) \r\n\r\nv1.0\r\n- Ebony Blade fixed to twohanded weapon\r\n- Ebony Blade now upgradeable at grindstone, benefits from deadric smithing perk\r\n- Drain enchant profits from Barbarian perk (increases enchant effect by 20% per rank)\r\n- Enchant now counts as destruction spell\r\n- selfmade fortify two-handed enchants now also increase the power of destruction spells\r\n",
  "categoryId": "95",
  "version": "1.1",
  "author": "maxmuh",
  "createdUnix": "1330645622",
  "updatedUnix": "1330645808",
  "containsAdultContent": false,
  "uploadedBy": "maxmuh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39013",
      "name": "Better Ebony Blade v1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Better Ebony Blade v1_1-11828-1-1.rar",
      "uploadedUnix": "1330645808",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c29d55a103bbed56a9c5fac1456730c03f521e205c2429cdb284af46dcc62914/analysis/1406724274/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Ebony%20Blade%20v1_1-11828-1-1.rar?fid=39013&ttl=1535773272&ri=8192&rs=8192&setec=6baaf96d606138e8a6c033837b716b21"
    }
  ]
}