{
  "modId": 11831.0,
  "modName": "Vampire Overhaul - Traduzione Italiana",
  "summary": "This is only a translation into Italian of the original mod.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/downloads/file.php?id=11487] Vampire Overhaul [/url].\r\nThe original mod overhauled the vampire gameplay in skyrim adding proper ranks and strength progression (both magic and melee, version 3 now includes vamp perks).\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size][/center]\r\n\r\nRidefinisce totalmente l\\'essere Vampiro in Skyrim.\r\nAggiunge tre nuovi Perks per personaggi Vampiri tra cui uno che dona un nuovo incantesimo.\r\nOra vi evolverete in base alla quantità di colli che moderete! Passerete dall\\'essere Neo-Vampiri ad Antichi Antenati.\r\nAggiunge il Recupero Vampirico che vi dona 100% di resistenza alle malattie, il 100% di resistenza al veleno e +100 Punti di carico trasportabile.\r\nAggiunge diversi stati che il vampiro può raggiungere:\r\nStage1 - Pieno di sangue ( - 6% Danno da mischia e  da Distruzione, +100% Resistenza al Gelo e -25% Resistenza al Fuoco )\r\nStage2 - Sazio ( - 4% Danno da mischia e da Distruzione, +75% Resistenza al Gelo e -50% Resistenza al Fuoco )\r\nStage3 - Affamato ( - 2% Danno da mischia e da Distruzione, +50% Resistenza al Gelo e -75% Resistenza al Fuoco )\r\nStage4 - Famelico ( -25% Resistenza al Freddo, -100% Resistenza al Fuoco)\r\nraggiungerete i diversi stati in base a quanto e quando vi nutrirete.\r\n\r\nCambi da esposizione al Sole\r\n-Stage1 - Nessuna Rigenerazione di Salute Magicka e Vigore e  -15 Punti delle stesse, ( Vampiri Ascendenti e superiori sono immuni al\\'indebolimento delle rigenerazioni )\r\n-Stage2 - Nessuna Rigenerazione di Salute Magicka e Vigore e  -30 Punti delle stesse, ( Antenati e superiori sono immuni al\\'indebolimento delle rigenerazioni )\r\n-Stage3 - Nessuna Rigenerazione di Salute Magicka e Vigore e  -45 Punti delle stesse, ( Antenati Maggiori e superiori sono immuni al\\'indebolimento delle rigenerazioni )\r\n-Stage4 - gli NPC vi saranno ostili,Nessuna Rigenerazione di Salute Magicka e Vigore e  -60 Punti delle stesse, ( Antichi sono immuni al\\'indebolimento delle rigenerazioni )\r\n\r\nDiversi cambiamenti generali tra cui:\r\n- I Vampiri possono cibarsi di corpi appena morti\r\n- I Vampiri possono respirare sott\\'acqua\r\n- Il Risucchio Vampirico assorbe 20/15/10/5 punti a seconda degli stage raggiunti\r\n- L\\'Abbraccio delle Ombra ha un effetto attenuato\r\n- I Vampiri ora sono una Fazione\r\n- Gli effetti del sole saranno attivi dalle 6am alle 7pm\r\n\r\nNOTA: Se siete già un Vampiro dovete avanzare di uno stage ( non nutrendovi per un pò ). Poi nutritevi e vedrete le nuove Skills aggiornarsi.\r\n\r\n[color=GREEN][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n[color=GREEN][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!",
  "categoryId": "79",
  "version": "4.5",
  "author": "Andre7890",
  "createdUnix": "1330646065",
  "updatedUnix": "1330646065",
  "containsAdultContent": false,
  "uploadedBy": "Andre7890",
  "primaryFile": null,
  "files": []
}