{
  "modId": 11841.0,
  "modName": "Torch Club",
  "summary": "This mod makes the torch equipable as a WEAPON!",
  "descriptionHtml": "Torch Club - By: tjbek - v.1\r\n----------------------------\r\n\r\n\r\n\r\nAbout this mod:\r\n---------------\r\n\r\n* This mod makes the torch equipable as a WEAPON in either of the players hands.\r\n  (You can choose to use in just one hand or DUAL WIELD!)\r\n\r\n* These torches cause blunt and fire damage, lighting your foes on fire!\r\n\r\n* These torches use the mace skill perks.\r\n\r\n* These torches are CRAFTABLE!\r\n  (Requires 1 linen wrap, 1 charcoal, and one firewood.)\r\n\r\n* I have started the player off with one torch club, and enough resources to\r\n  make one more torch club.\r\n\r\n* NOTE These torches do NOT emit light!\r\n\r\n* Works with \\\"Shars Deadly Torches\\\", by Shar181.\r\n  (http://skyrim.nexusmods.com/downloads/file.php?id=10552)\r\n   \r\n   -This is useful if you want to have one torch to emit light that you can,\r\n    block and bashwith, and use one Torch Club to hit with.\r\n\r\n* CAUTION: When these Torch Clubs are sheathed, they will still have a flame!\r\n\r\n\r\nINSTALLATION:\r\n-------------\r\n\r\n* I did not make a FOMOD installer for this mod. I do not use FOMOD.\r\n\r\n* Manually install by copying the contents of the data folder to the data\r\n  folder in your Skyrim dir. \r\n  \r\n  (NOTE: The texture file is optional; it is just a glowmap that I made for\r\n         myself a couple months ago. It makes the top of the torch glow blue.\r\n         It is a 1024 pixel texture and is NOT perfect. You will see some other\r\n         colors glow below the blue and I could not fix it.)\r\n\r\n\r\n\r\nWhat I would like to fix:\r\n-------------------------\r\n\r\n* I would like to remove the flame from the Torch Clubs when sheathed.\r\n\r\n* I would like to have the torches emit light.\r\n\r\n  - If you know how to fix these things or figure it out before me please let me know.\r\n\r\n\r\n\r\nCloser:\r\n------\r\n\r\n* I hope you enjoy this mod. I\\'m not the most experienced modder, but all suggestions,\r\n  constructive criticizms, and compliments are welcome.\r\n\r\n* I\\'m not here for fame but if you do like my mod please endorse to let me know that\r\n  my time/work is appreciated, and so that others may be able to find this mod and like\r\n  it too.\r\n         \r\n         ~TY",
  "categoryId": "55",
  "version": "1",
  "author": "tjbek",
  "createdUnix": "1330654018",
  "updatedUnix": "1330654018",
  "containsAdultContent": false,
  "uploadedBy": "TJBEK",
  "primaryFile": null,
  "files": []
}