{
  "modId": 11854.0,
  "modName": "Vampire Puppet Master",
  "summary": "Some new vampire abilities, which drain stamina not mana, to make playing as one more interesting.",
  "descriptionHtml": "[size=1]Remember to endorse if you like it (this mod and any other), I never used to bother but since becoming a mod author I\\'ve found it makes us mod authors feel all warm and fuzzy inside, and encourages us to make more/improve more, so totally worth the effort.[/size]\r\n\r\nEDIT: Due to the current situation with adding custom animations, this mod is indefinitely on hold.\r\n\r\nShort Version of stuff below: More Vampire powers, which drain stamina not mana. Updates to include better mechanics, animations, more powers and maybe a questline.\r\n\r\n===What this Mod Does===\r\n\r\nOk, for now what this mod does is grant vampires a new lesser power, called \\\"Grab Bloodsack\\\" (because derogatory terms for us mere mortals are fun :D). If you aren\\'t a vampire yet, you\\'ll get it when you become one. If you\\'re already a vampire you need to go sit in a chair, any chair, and the power will be granted to you.\r\n\r\nThis power only works on the living, has an aimed range of 1ft (so touch pretty much) and opens up a window with three options when you use it, enrage, command and drain. Enrage will enrage any enemy of any level, and drains 10 of your stamina every second. Command is the same, except it\\'s a calm spell (I haven\\'t managed to get a command spell to work yet) and drains 20 stamina per second. Drain damages them for 10hp and heals you for 10 hp, and drains 10 stamina per second. All of these effects are ended by the death of the target, or you running out of stamina, or you using the lesser power that replaces grab bloodsack after it is used (it\\'s automatically equipped when you use grab bloodsack and grab bloodsack is removed from your spellbook).\r\n\r\n===Planned Future Features===\r\n\r\nDifferent Mechanics: Right now the spell is a touch spell that doesn\\'t need charging which forges a link between you and your victim. What I want to happen is you grab your victim (sam fisher style) using the first spell, at which point you get a selection of spells (auto equipped and disable the spell menu/hotkeys so you can\\'t choose your normal spells) that do things like enrage it or drain it\\'s health or turn it into a walking bomb and give it an enemy to target. These spells take time to charge, during which time your stamina is falling rapidly while your victim struggles. If you run out of stamina before you cast a spell, they turn around and punch you in the face, knocking you down. Once the spell is cast you release them, and your stamina continues to be drained by some spells (but not others), slower than before though.\r\n\r\nMore Options: At the moment you only have enrage, command (really calm) and drain. I want to add things like turning them into a walking bomb, calming them and using them as a magicka battery, stealth options like \\'go and try and stab this guy in the back\\', afterall what boss suspects his loyal henchmen? (obviously a normal NPC against a boss will fail, but do damage, most of the time, they\\'re more likely to succeed at killing a fellow bandit/whatever)\r\n\r\nAnimations: Yep, the current version has none, which makes it kind of lacklustre. If you are an animator and want to help, I\\'d welcome it. If you know an animator who might want to help, show them the mod and pester them till they do! The only other option is that I try, which will almost inevitably result in shoddy animations which will only be a bit better than nothing.\r\n\r\nQuest: At some point I\\'ll add a questline that gives you this power, and each of the individual effects as you advance through it.\r\n\r\n===The Next Step===\r\n\r\nRight now the next thing that I want to implement is actually grabbing the enemy, no movement, just grab them and you are both rooted to the spot. This of course needs an animation, and should all else fail I\\'ll give it a try.\r\n\r\n===My Other Mods===\r\n\r\nBecome a Vampire at the start: http://skyrim.nexusmods.com/downloads/file.php?id=11965\r\nBecome a Werewolf at the start: http://skyrim.nexusmods.com/downloads/file.php?id=11674\r\nSustained Spells: http://skyrim.nexusmods.com/downloads/file.php?id=13450\r\nEveryone Get Inside! Dragon Attack: http://skyrim.nexusmods.com/downloads/file.php?id=12785\r\nWerepyres: http://skyrim.nexusmods.com/downloads/file.php?id=11503\r\nWerewolf Second howl Toggle: http://skyrim.nexusmods.com/downloads/file.php?id=12017",
  "categoryId": "24",
  "version": "0.1",
  "author": "MGoods",
  "createdUnix": "1330677160",
  "updatedUnix": "1330677221",
  "containsAdultContent": false,
  "uploadedBy": "MGoods",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39118",
      "name": "VampirePuppetMasterv0_1",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "VampirePuppetMasterv0_1-11854-0-1.rar",
      "uploadedUnix": "1330677221",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/fdca68f12a4489c149c49cd48cb131a8d9dde8b3ff3ecb84626f576478ea2db3/analysis/1406724869/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VampirePuppetMasterv0_1-11854-0-1.rar?fid=39118&ttl=1535773315&ri=8192&rs=8192&setec=21e994500ca21df1025f1ec73ab975ec"
    }
  ]
}