{
  "modId": 1186.0,
  "modName": "Pinkbeards",
  "summary": "\\\"An order of philosopher monks who are masters of the Way of the Voice, the Pinkbeards live in candy-coloured isolation atop Skyrim’s largest mountain.\\\"",
  "descriptionHtml": "[color=deeppink]=====DESCRIPTION=====\r\n\r\nThis mod changes the Greybeards\\' robes and turns them pink and also, surprisingly, makes the beards (from which they get their namesake) pink. I made this mod as an initial test of texture replacing in Skyrim, I can never seem to find the Graybeards about and this makes them highly visible and easy to locate... It also makes them a lot harder to take seriously, throughout the campaign; for better or for worse!\r\n\r\nis a texture replacer for the trim on Ebony Armor; originally a dull grey I have changed it to a bright red - see pictures. As with most of my mods, I acknowledge the simplicity of this retexture, however, I made such a mod for Oblivion and wanted to re-create it for this most epic and hallowed of games. \r\n\r\n\\\"I love this\\\"\r\n\r\n=====INSTALLING=====\r\n\r\nNOTE: You can download it with the Nexus Mod Manager if you so choose, and there will be no need for installation.\r\n\r\nI have chosen not to include a ReadMe with this mod, as it is a very simple texture replacement. Please take a few seconds here to read up on the process. Once you have downloaded and extracted the mod, simply place the folder named \\\"textures\\\" into your Skyrim \\\"Data\\\" folder. For most of you, this will be: \r\n\r\nC:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\r\n\r\n=====UNINSTALLING=====\r\n\r\nTo uninstall this texture replacer, simply enter the \\\"Data\\\" folder in your Skyrim directory, then enter \\\"textures\\\" and delete the associated files: beards and Greybeard Robes. Please remember to leave constructive feedback on un-installation.\r\n\r\n=====PLEASE NOTE=====\r\n\r\nThis mod [i]replaces[/i] the texture of the Greybeard robes and certain beards styles. My only slight worry is that any other NPCs with the same style of beard will suffer from this candy-coloured infection. Including the main character, if you have one of these styles. As long as this mod is installed - you will not encounter an original version.\r\n\r\nPlease remember to comment with ideas and criticisms!\r\nNow, download, install, and enjoy! [/color]",
  "categoryId": "33",
  "version": "V1.0",
  "author": "Ojox",
  "createdUnix": "1322056952",
  "updatedUnix": "1322057324",
  "containsAdultContent": false,
  "uploadedBy": "",
  "primaryFile": null,
  "files": [
    {
      "fileId": "3132",
      "name": "Pinkbeards",
      "version": "V1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3172",
      "fileName": "Pinkbeards-1186.rar",
      "uploadedUnix": "1322057324",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bf9b4495b6d6f7ee97aec077dd4361fd10fc070d1ee9025f9d73c6862cd59505/analysis/1406437925/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pinkbeards-1186.rar?fid=3132&ttl=1535754616&ri=8192&rs=8192&setec=7311120558b33961f381178bc5bb3503"
    }
  ]
}