{
  "modId": 11872.0,
  "modName": "Knock Out Perk Mod",
  "summary": "This mod adds a three level \\\"knock out\\\" perk in the stealth skill tree. This perk allows you to have a chance to knock out your target for about 30 seconds when you are sneaking and using any mace type weapon.  ",
  "descriptionHtml": "Knock Out Perk Mod by Hjorr\r\n\r\nThis mod adds a three level \\\"knock out\\\" perk in the sneak/stealth skill tree. \r\n\r\n\r\nThis perk allows you once unlocked to have a chance to knock out your target for about 30 seconds when you are sneaking and using any mace type weapon (it works with imported weapons as well).  \r\n\r\nYou will not be detected as long as the target is unconscious but of course you can still be detected by other enemies. \r\n\r\nThis mod is still a work in progress and it is not perfect since I have not been a modder for a long time.\r\n\r\nStill, I think that as a first version, it is satisfying enough to be uploaded and used.\r\n\r\n\r\nInstallation:\r\n\r\n1 -unzip\r\n\r\n2 -To install this mod, simply place the \\\"ko.esp\\\" file in your skyrim Data file and don\\'t forget to tick it in the Skyrim launcher. \r\n\r\n- To uninstall it, just untick the box in the skyrim data launcher and delete the \\\"ko.esp\\\". \r\n\r\nKnown problems:\r\n\r\n- This mod uses the enableai command, so while the target is on the ground, you will not be able to interact with it, meaning that You can not kill the target while it is unconscious or that you can not even loot it.\r\n\r\n- On the player\\'s hit event, the target is set to unconscious but from time to time and for some reason I can not figure out, the enemy will only have his eyes half shut, (which is something clinically possible in real life).  \r\n\r\n\r\n\r\n   ",
  "categoryId": "24",
  "version": "1.00",
  "author": "Hjorr",
  "createdUnix": "1330701960",
  "updatedUnix": "1330702157",
  "containsAdultContent": false,
  "uploadedBy": "Hjorr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39197",
      "name": "Knock Out Perk Mod by Hjorr",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Knock Out Perk Mod by Hjorr-11872-1-00.7z",
      "uploadedUnix": "1330702157",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/ef739a9dd53a7197bc90b1c8738dacafe5156f45ed1820955fa7b067342a6bbf/analysis/1406725219/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Knock%20Out%20Perk%20Mod%20by%20Hjorr-11872-1-00.7z?fid=39197&ttl=1535773335&ri=8192&rs=8192&setec=798f9f20ebf4bcf00805149f753ae725"
    }
  ]
}