{
  "modId": 11882.0,
  "modName": "DIMONIZED UNP clothing resources",
  "summary": "Very Lore - unfriendly clothes for UNP body. ADULT content.",
  "descriptionHtml": "DIMONIZED UNP clothing resources. Geared for modders,but usefull for gamers too. \r\n--------------------------------------------------------------------------------------------------------------------\r\nInsanely lore unfriendly- in case of pink thighs-purposefully ;) Nothing else as make prudes mad. For a good laugh :)\r\nADULT content. Do not redistribute in kindergardens :)\r\n----------------------------------------------------------------------------------------------------------------------------------------\r\nSorry folks, I will not convert anything to other bodies. It takes a lot of work and time. Plus-things like stockings ,thighs and even tight tops - they all have to be remade,or they work and look like a crap. Only \\\"easy\\\" conversion -is for Skinny UNP body -same topology. But I not gonna do even that,no time. Sorry.\r\n-------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n==================================================================================================\r\nV1.0 Set1. Codename : Hooters :) \r\n\r\n By large it is absolutely useless for \\\"normal\\\" gameplay. Tho you could easily make,say, chain greaves from stockings with simple retex and use with some armor to cover up bare legs. I use things like these for companions - I have 4 atm, they dance and live in my houses. Which I have 5 ,not counting Breezehome. It\\'s a game in a game. When I going back home from adventuring I like things to be shmexy and pretty. Thus,this set.\r\n\r\nSet includes 2 tops,stockings,thighs,miniskirt and microskirt. Everything except the tops is an ADDON piece - you can try to add,say,stockings to an existing outfit/armor. Addon pieces will work properly ONLY with UNP Main body V1.2 and higher. Otherwise,there will be serious clipping. For instance,my Dragonscale armor is no good , Vevlec is no good - both use pre 1.2 body meshes. \r\n   There\\'s no boots in this release, they are not ready. I recommend using Ashara\\'s boots from Romantic dress outfit - they work the best. I give no guarantees with any other boots-esp. knee high. There can be clipping. Thighs clip the worst, they are pretty much a \\\"miss\\\". They originally were intended as tight leather pants, which I probably will make at some point. As the tighs their usage very limited - too loose fit,clip with every skirt and such. However, pink thighs plus max slider combo is simply hillarious. That combo would draw million honks from nearby cars and probably cause some traffic jam in where I live,lol :) Stockings, on the other hand , are a total Win. They work like a charm. I didn\\'t make them from thighs-I remade them from the leg. There\\'s no panties (yet) either. Bikini (I use \\\"Armored bikini\\\" myself) works pretty good - just some minor clipping at sides of the skirts. No biggie.\r\n----------------------------------------------------------------------------------------------------------------------\r\nI might (or not) add shorts or hotpants,some boots and some panties to this set in the future. When and if is unclear atm.\r\n-----------------------------------------------------------------------------------------------------------------------\r\nDo not expect much in terms of textures. I used ONE decent texture in total for whole set - from my FO3 stockings. I simply do not have time for proper texturing. However, mesh-wise pieces are pretty good, and retexing things like these is quite fun. Variants are virtually limitless. Go ahead and give it a whirl. \r\n   If you don\\'t like UV map placement-it is weird at times,for example, I adopted stockings texture for skirts, go ahead and tweak it. You can do it in Nifskope. \r\n-----------------------------------------------------------------------------------------------------------------------\r\nRequirement:\r\n\r\nUNP Main body (any boobs variant)  OR UNP Skinny body- provided you use one of tops -your body will change to Main and look \\\"fatter\\\" tho.\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nHow to get items ingame:  \r\n\r\nCurrently only thru console.  Type help HOOTERS 4 to get all item codes. Google or search forums for how to use console.\r\nIt is usefull in many ways as you will learn. \r\n  I tried to put some chest ingame - quickly moved some rock somewhere, stinked up something else and crashed CK. Of course,putting chest or merchant would be much better-alas, I simply do not have time for \\\"luxuries\\\". And unable to make it quickly. So,no bitching. :)\r\n------------------------------------------------------------------------------------------------------------------------\r\nInstall: \r\n\r\nUnzip and drop contents into Sata folder. Enable DIMclothes1 ESP in launcher,if needed. NMM should work too, tho I heard it\\'s kinds broken now. I never use managers, so I\\'m not sure.\r\n------------------------------------------------------------------------------------------------------------------------\r\nUninstall:\r\n\r\nQuick: Uncheck DIMclothes1 ESP. \r\nFull: Delete ESP and all files,assotiated with this mod. All meshes are in meshes\\\\dimon99\\\\Hooters\r\nTextures are in  textures\\\\dimon99\\\\Thighs \r\n                 textures\\\\dimon99\\\\Stockings\r\n                 textures\\\\dimon99\\\\SSkirt\r\n------------------------------------------------------------------------------------------------------------------------------------------\r\nNOTES:\r\nAs of initial release, V1.0 : There\\'s no consensus yet of how utilize unused addon slots - which garment goes to which slot. There is thread on forums, but looks like EVERY poster offers different variant. No use for now,hehe.  I added leg gadgets (thighs,stockings) to 44, Skirts to 45 , will use 46 for panties,shorts and such.  Already some collision happened - Backsteppo put his thong (panties) to 45 in Sorceress outfit- so when I try to use my skirt with his panties - they bump each other out. Things are a mess atm, hopefully it will get to some order in time.\r\n-------------------------------------------------------------------------------------------------------------------------------------------\r\nI batch compress all textures, so everything is compressed on DXT5 - couple of files have unused alfa channels. Also, every texture is 2048x2048, pretty big. My main intent is to supply modders tho, I am not good at making \\\"finished\\\" outfits anyway,no talent,hehe, so bigger textures are the way to go. So they don\\'t lose resolution. Anyone is welcome to optimize textures for better performance, I am VERY unlikely to do that. Plus, I was running all these textures UNCOMPRESSED ,for 4 toons at the same time (yep, I have 4 companions atm :) )  and it worked almost without a problem. So,for most people things gonna run fine.\r\n-----------------------------------------------------------------------------------------------------------------------------------------------------------\r\nYou must be already aware that Alfa blending kinda shaky atm in Skyrim. Clothes and hairs will go \\\"dark\\\" under some lightning conditions.  No workaround at this time , just wait till it\\'s fixed. It either have things go \\\"bad\\\" at SOME locations, or have clothes and hairs look like crap ALL the time. \\\"Vanilla\\\" Alfa settings will work without going dark - but it looks like crap. Me no need crap :)  \r\n    Tops are somewhat inconsistent with alfa - in temple of Kynareth they go almost invisible, under the sun they go almost opaque . Must be that combination of white + some gloss ,maybe even normal map, I didn\\'t get it to the point where I liked it.  Take it for the spin - maybe you will get better results. \r\nThanks:\r\nOUTFITS:\r\nAshara Romantic Outfit for CBBE and UNP by SydneyB http://skyrim.nexusmods.com/downloads/file.php?id=5577\r\nDragons Crown Sorceress Outfit for UNP by Backsteppo  http://skyrim.nexusmods.com/downloads/file.php?id=11767\r\nHAIR:\r\nApachiiSkyHair by Apachii  http://skyrim.nexusmods.com/downloads/file.php?id=10168\r\nLOCATIONS:\r\nMoonpath to southern tropical Elsweyr_previously the anvil_ by muppetpuppet   http://skyrim.nexusmods.com/downloads/file.php?id=9782\r\nDragon Falls Manor by Mattcm919   http://skyrim.nexusmods.com/downloads/file.php?id=10901\r\nANIMATION:\r\nFores New Idles in Skyrim - FNIS by fore   http://skyrim.nexusmods.com/downloads/file.php?id=11811\r\nDance Animation for Modder by umpa   http://skyrim.nexusmods.com/downloads/file.php?id=2658\r\nNPCs/Companions:\r\nBathing Beauties Luxury Suite - Beta by Migal   http://skyrim.nexusmods.com/downloads/file.php?id=11427\r\nJenassa changed into Sexy Breton by Dark13lade   http://skyrim.nexusmods.com/downloads/file.php?id=9964\r\n\r\nMy thanks to all authors - you make my game BETTER!\r\n---------------------------------------------------------------------------------------------------------------------------------------------------------------\r\nLegal/usage:\r\n\r\nRules are simple: You can modify All CLOTHING meshes and textures freely, no permission needed. All I ask is-release it on Nexus, so I could shop for it too :)  Link to original mod doesn\\'t hurt either,but not required. \r\n  Body meshes usage is the same as described in UNP mod page - only normal clothmaking activities,as cropping and mutilating,if needed. Can flatten nipples if needed. CANNOT change the shape of the body. \r\n\r\n ",
  "categoryId": "60",
  "version": "1.5",
  "author": "dimon99",
  "createdUnix": "1330708379",
  "updatedUnix": "1330709918",
  "containsAdultContent": true,
  "uploadedBy": "dimon99",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39236",
      "name": "DIMclothes_set1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "55335",
      "fileName": "DIMclothes_set1-11882-1-0.7z",
      "uploadedUnix": "1330709918",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fbdfbfb2457ac268997596927733f749c0ccd0f4187ad1dd7cb2b9e40dd755c3/analysis/1406725457/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DIMclothes_set1-11882-1-0.7z?fid=39236&ttl=1535773352&ri=8192&rs=8192&setec=958054fe097136115ac5862aacee82b0"
    }
  ]
}