{
  "modId": 11892.0,
  "modName": "New Magic Variants",
  "summary": "Adds new spells, staves, scrolls and perks and improve the vanilla ones.\r\nThere are in total 25 new scrolls, 10 new perks, 34 new spells, 8 new staves that improve the vanilla experience. ",
  "descriptionHtml": "[color=green]This mod won\\'t add any more content, for me this mod is almost over. The next updates will only contain bugfixes. (hopefully there won\\'t be so many updates)[/color]\r\n\r\nwhat this mod does try to do:\r\nMy final aim is to do a mod where you can chose which kind of mage you want to be. For this i need some new spells, new scrolls, new staves and perks and I improved some of the vanilla ones. I try to be lore frendly and make this mod as compatible as possible with others mods.\r\nI will try to make more useful and available  scrolls and staves. \r\n\r\nWhat this mod does:\r\n\r\nADD [color=red]NEW SCROLLS[/color] and make [color=green]all preexisting scrolls salable (you can find them to vendors)[/color] and lootable (all scrolls but the special ones). (in 1.04b)\r\nScroll of Flame/Frost/lightning cloak of the expert. (6 damage, 15 resist per 60 seconds)\r\nScroll of Resist Fire/Frost/Shock Cloak. (per 60 seconds) \r\nScroll of the Skeleton.\r\nScroll of the Corrupted Shade.\r\nScroll of Fiery Soul Trap.\r\nScroll of Cheap Invisibility. (Invisibility for 15 seconds)\r\nScroll of Magicka Regeneration (Tenfold increse in the regeneration for 60 seconds)\r\nScroll of Fire/Frost/Shock Rune of the Expert. (70 damage)\r\nScroll of Spell Absorption. (100% per 30 seconds)\r\nScroll of Weakness to Fire/Frost/Shock. (25% weakness for 180 seconds)\r\nScroll of Fury Rune.\r\nScroll of Calm Rune.\r\nScroll of Frenzy Rune.\r\nScroll of Pacify Rune.\r\nScroll of Rune of Paralysis.\r\nScroll of Slow Time. (0.20 per 10 seconds)\r\nScroll of Stop Time. (0.10 per 10 seconds)\r\n[color=green]N.B.: scrolls haven\\'t always the same magnitude or duration of their spell counterpart [/color]\r\n\r\nADD [color=red]NEW PERKS[/color] (change only one perk requirement, ie recovery second rank):\r\n\r\n2 new Alteration perks: improved mage armor, Distort time;\r\n3 new Restoration perks: Improved wards, recovery75, recovery100;\r\n3 new Destruction perks: Burning Flames, Frozen Frost, Electric Shock;\r\n1 new Conjuration perk: Dark potency;\r\n\r\n[color=yellow]PERKS DESCRIPTION[/color]:\r\n-Improve mage armor perk gives to all mage armor spells a 20% chance to reflect a small damage back to the enemy (20%). It requires 60 Alteration and the second rank of Mage armor perk.\r\n-Distort time perk makes stronger the magnitude of a new spell, Stop time. It requires the Master Alteration perk\r\n\r\n-Improved wards spells gives to all wards (plus two new wards spells) twice as much protection. it requires the ward absorb perk and 75 in restoration.\r\n-ATTENTION: changed the requirement to recovery (second rank) from 60 to 50 (because in the CK it was recovery50).\r\n-Recovery75 gives 100% magicka regeneration. It requires the second rank of recovery and 75 in restoration.\r\n-Recovery100 gives 200% magicka regeneration. It requires the third (new) rank of recovery and 100 in restoration.\r\n\r\n-Burning flames perk makes all damage from fire spells (and weapons) twice stronger. It requires 90 destruction and Intense Flames.\r\n-Frozen frost perk makes all damage from frost spells twice stronger. It requires 90 destruction and Deep Freeze.\r\n-Electric shock perk makes all damage from shock spells twice stronger. It require 90 destruction and Disintegrate.\r\n\r\n-Dark potency perk makes conjured skeletons (new), conjured shades (new) and conjured familiar 50% more powerful. It\\'s the second rank of Dark Souls perk (so it hasn\\'t the name displayed).\r\n\r\nADD [color=red]NEW SPELLS[/color]:\r\n\r\n-Destruction spells: Flames of the Apprentice, Flames of the Adept, Frostbite of the Apprentice, Frostbite of the Adept, Sparks of the Apprentice, Sparks of the Adept, Flame cloak of the Expert, Frost cloak of the Expert, Lightning Cloak of the Expert, Fire rune of the Expert, Frost rune of the Expert, Lightning rune of the expert, Arcane Art: Fireball, Resist Fire Cloak, Resist Frost Cloak, Resist Shock Cloak, Weakness to Fire, Weakness to Frost, Weakness to Shock.\r\n\r\n-Alteration spells: Rune of paralysis, Slow Time, Stop time.\r\n\r\n-Conjuration spells: Conjure Archer Skeleton, Conjure Corrupted Shade, Call Athena, Fiery Soul Trap.\r\n\r\n-Restoration spells: Expert Ward, Master Ward, Cure Disease.\r\n\r\n-Illusion spells: Calm Rune, Fury rune, Pacify Rune, Frenzy Rune.\r\n\r\n[color=yellow]SPELLS DESCRIPTION[/color]:\r\n-flames of the Apprentice has 12 fire damage, is an apprentice spells and is sold by vendors\r\n-flames of the Adept has 16 fire damage, is an adept spells and is sold by faralda (and some others)\r\n-frostbite of the Apprentice has 12 frost damage\r\n-frostbite of the Adept has 16 frost damage\r\n-sparks of the apprentice has 12 shock damage\r\n-sparks of the adept has 16 shock damage\r\n-Flame cloak of the expert has 12 fire damage and 30 resist fire (influenced by augmented perks and burning flame). Faralda sells it.\r\n-Frost cloak of the expert has 12 frost damage and 30 resist frost\r\n-Lightning cloak of the expert has 12 shock damage and 30 resist shock\r\n-Fire rune of the Expert has 75 fire damage. Faralda sells it.\r\n-Frost rune of the Expert has 75 frost damage.\r\n-Lightning rune of the Expert has 75 shock damage.\r\n-Arcane art: Fireball is a special spell that can harm only dragons with a fire damage. Can\\'t be resisted. It\\'s a master spell and can be found in the skytemple. Has 125 fire damage and 100 fire damage per 4 seconds. The cast time is 3,5 seconds. Influenced by the dual casting perk, augmented perks and burning flames perk.\r\n-Resist Fire/Frost/Shock Cloak: the caster can resist 20% of Fire/Frost/Shock damage for 15 seconds. It\\'s an Apprentice spell.\r\n-Weakness to Fire/Frost/Shock: 25% weakness for 180 seconds.\r\n\r\n-Slow time can slow time for 3 seconds with a magnitude of 0.25 (slight better than the first rank of the shout). Tolfdir sells it. it\\'s an adept spell.\r\n-Stop time can slow time for 3 seconds with a magnitude of 0.15 (slight better than the second rank of the shout). It can improve to 0.05 with the Distort Time perk. Tolfdir sells it after the ritual quest. it\\'s infact a master level spell.\r\n-Rune of Paralysis can paralize for 3 seconds opponents that fail to resist in a 15 foot radius. Tolfdir sells it after the ritual quest. it\\'s infact a master level spell.\r\n\r\n-Fury Rune is a novice spell. Creatures and people up to level 6 in a 15 foot radius attack anyone nearby. Influenced by master of mind perk.\r\n-Calm Rune is an apprentice spell. Calm creatures and people up to level 9 in a 15 foot radius. Influenced by master of mind perk.\r\n-Frenzy Rune is an adept spell. Creatures and people up to level 14 in a 30 foot radius attack anyone. Influenced by master of mind perk. Found in the college of winterhold.\r\n-Pacify Rune is an expert spell. Pacify enemies in a 30 foot radius up to level 20. Influenced by master of mind perk. Sold in the college of winterhold.\r\n\r\n-Expert Ward is an expert spell. 100 magnitude. Colette sells it.\r\n-Master Ward is a master spell. 120 magnitude. Colette sells it after the ritual quest.\r\n-Cure disease. it\\'s an adept spell. Colette sells it.\r\n\r\n-Conjure Skeleton is an Apprentice spells and summon an archer skeleton.\r\n-Conjure Corrupted Shade is an Adept spell and summon a corrupted shade. Can be sold in the college of winterhold.\r\n-Fiery Soul Trap is an Adept spell, soultrap for 60 seconds and give 5 damage per seconds per 1 minute. sold in the college of Winterhold. \r\n-Call Athena is an Adept spell and can be found in the inventory of Athena, a new mage npc (no experience gain).\r\n\r\nADD [color=red]NEW[/color] (no texures) [color=red]STAVES[/color]:\r\nStaff of the Skeleton, Staff of the Corrupted Shade, Staff of flames of the apprentice/adept, Staff of frostbite of the apprentice/adept, Staff of sparks of the apprentice/adept.\r\n\r\nWHAT DOES THIS MOD [color=yellow]IMPROVE[/color]:\r\nWall of flames, frost and storms damage from 8 to 15.\r\nStaves of walls damage from 8 to 15.\r\nTurn Undead spells: now they have a small holy damage overtime.\r\nTurn Undead Staves: now they have a small holy damage overtime.\r\nTurn Undead Scrolls: now they have a small holy damage overtime.\r\nThe base enchantment of mage <school> robes: should now give 100% magicka regeneration after learning the enchantment (before it was 10%)\r\nThe base enchantment of magicka regeneration: should now give 150% magicka regeneration with all enchantments perks and 100 skill.\r\nThe base enchatment of turn undead weapons: should now have a small fire damage overtime.\r\n\r\nATHENA NPC:\r\nAthena is a new mage npc equipped with a special staff of wall of storms with infinite charge but less powerful (5 damage per second). She is a lightning oriented mage with some frost spells. She IS strong and can level til the level 81 cap. She has also some of the new perks added in this mod.\r\nShe can use also some basic shout and is in a beta testing fase. you can find her in the college of winterhold. \r\n\r\nBUGS: \r\n\r\nMinor bugs:\r\nFrost/Shock Cloak of the expert spells have the wrong description in the ui.\r\n\r\nPlease report bugs!!!",
  "categoryId": "75",
  "version": "1.2",
  "author": "Kizude",
  "createdUnix": "1330720361",
  "updatedUnix": "1336229246",
  "containsAdultContent": false,
  "uploadedBy": "Kizude",
  "primaryFile": null,
  "files": [
    {
      "fileId": "43042",
      "name": "New Magic Variants v 1_03",
      "version": "1.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18",
      "fileName": "New Magic Variants v 1_03-11892.zip",
      "uploadedUnix": "1331671730",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/f51ac3faaa91fc6c798293de0a111e92265ba4e2c1b5f7fcd9c156d6b69a4a3e/analysis/1406747344/",
      "changelogHtml": " Fixed the Resist Cloak spell\\'s description in the UI. <br/> \n Modified the duration of Resist Cloak spells from 10 seconds to 15 seconds. <br/> \n Improved Cloak of the expert spells. <br/> \n Change the esp name. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Magic%20Variants%20v%201_03-11892.zip?fid=43042&ttl=1535773371&ri=8192&rs=8192&setec=575c9e8bf3362dd304fc017d2d5057b5"
    },
    {
      "fileId": "47420",
      "name": "New Magic Variants v 1_08",
      "version": "1.08",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22",
      "fileName": "New Magic Variants v 1_08-11892.zip",
      "uploadedUnix": "1332873842",
      "modVersion": "1.08",
      "virusScanUrl": "https://www.virustotal.com/file/be35272932c4e18622d07ee5d1ad34a79e28a322482f97bc6ba97dc20d9dd7bc/analysis/1406783122/",
      "changelogHtml": " Improved Turn undead spells/enchantments/scrolls. <br/> \n Improved Slow Time and Stop Time spells. <br/> \n Added 2 new scrolls. <br/> \n fixed the lesser turn undead enchantment <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Magic%20Variants%20v%201_08-11892.zip?fid=47420&ttl=1535773372&ri=8192&rs=8192&setec=ac734702db4bbfc6c54dfe86194d0ed9"
    },
    {
      "fileId": "55687",
      "name": "New Magic Variants v 1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20",
      "fileName": "New Magic Variants v 1_1-11892.zip",
      "uploadedUnix": "1335199476",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/a6022e9cde8aaea34f34da047a251a5b8505ff387d4b89431b6e4f385d7b6ff8/analysis/1406831527/",
      "changelogHtml": " Some names fix <br/> \n Cleared the esp <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Magic%20Variants%20v%201_1-11892.zip?fid=55687&ttl=1535773372&ri=8192&rs=8192&setec=9d2d3e2e6addd04db17a0c851dee6174"
    },
    {
      "fileId": "57090",
      "name": "New Magic Variants v 1_1 Full Version",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "401",
      "fileName": "New Magic Variants v 1_1 Full Version-11892.rar",
      "uploadedUnix": "1335642445",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/fbd1581bfde339a016dd94cfd26d86635d784c6ec3f89f17563e8276499d70d7/analysis/1406851743/",
      "changelogHtml": " Some names fix <br/> \n Cleared the esp <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Magic%20Variants%20v%201_1%20Full%20Version-11892.rar?fid=57090&ttl=1535773373&ri=8192&rs=8192&setec=56b1f14cb8b3e9062cc747aacd6022b3"
    },
    {
      "fileId": "58910",
      "name": "New Magic Variants v 1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "402",
      "fileName": "New Magic Variants v 1_2-11892-1-2.rar",
      "uploadedUnix": "1336229246",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/23429aeb041a7eef9e80e2e85b7974896b671b1a030342d272cc48a7a6aacaf1/analysis/1406869027/",
      "changelogHtml": " Added the keyword \\\"VendorItemScrolls\\\" to all the scrolls that didn\\'t have it. In this way, merchant that aren\\'t supposed to buy scrolls won\\'t buy some of them. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Magic%20Variants%20v%201_2-11892-1-2.rar?fid=58910&ttl=1535773373&ri=8192&rs=8192&setec=6b080557ad9ce7e2f58f3077e2c94bf8"
    }
  ]
}