{
  "modId": 11902.0,
  "modName": "Cloudsrest Manor Player Home",
  "summary": "Adds a very large two-story, ancient nordic themed house to a mountain in the Hold of Eastmarch for all the True Nords and Dragonborns out there. Features all the basic necessities of a house mod, and much more!",
  "descriptionHtml": "[center][img]http://img191.imageshack.us/img191/7090/byxion209.png[/img][/center]\r\n[center][img]http://img831.imageshack.us/img831/9172/41089738.png[/img][/center]\r\n\r\n[size=6][color=red]Important: I discovered this mod is broken in that it REPLACES the Arentino Residence. I don\\'t know how I managed to do this, and I will fix it when I get the time.[/color][/size]\r\n\r\n[size=3][center][b]Mod name: Cloudsrest Manor Player Home\r\nVersion: 1.1\r\nCategory: Player Homes (free, no quest)\r\nAuthor(s): Xion209\r\nRelease Date (newest version): 3/3/12[/b][/center][/size]\r\n\r\n[b]Note: If you use custom mannequin meshes, this mod seems to override them with the vanilla ones. I do not currently know a fix for this, but I\\'ll be looking into it.[/b]\r\n\r\n[center][IMG]http://img705.imageshack.us/img705/9150/enhlogo.jpg[/IMG][/center]\r\n[size=3]\r\n[center][b][color=\\\"#FF8C00\\\"]Short Description\r\n================[/color][/b][/center]\r\nAdds a large, two-story, ancient nordic themed house to a mountain in the Hold of Eastmarch suitable for all True Nords and Dragonborns (Designed for Nords, but other races can surely make use of it as well!). Features all the basic necessities of a house mod, and much more.\r\n\r\n[center][color=\\\"#FF8C00\\\"][b]Long Description\r\n==============[/b][/color][/center]\r\n\tAdds a large, two-story, ancient nordic themed house to a mountain in the Hold of Eastmarch (The Hold that Windhelm is in). The house is called Cloudsrest Manor, and it is chock full of features, including a merchant and your very own Dark Elf servant garbed in Jester  clothes (Muahaha, take that you filty Elves)! I believe that it has everything a True Nord Dragonborn could need, including lots of storage, weapon racks, weapon plaques, and weapon display cases, shield plaques, mannequins, crafting equipment and much more; see \\\"Features\\\" sections below! The house isn\\'t Stormcloak themed; It does however have a few Talos statues and a Talos shrine, so Empire sympathizers will probably not want to live here (You can always disable the statues and shrine though, everything should still look just as good!).\r\n The house is located on one of the Velothi Mountains (not sure of the mountain\\'s name if it has one, so until I learn otherwise I hereby dub it Cloudsrest Peak), east of Windhelm and up from Narzulbur. While it is not on the very tip top of the mountain, it is very high up it. The house has a man-made stone path leading up to it; it takes a good minute to run up to the house from the bottom of the path! The house itself is located on a massive granite shelf, and has a \\\"back yard\\\" with an epic glacier for your viewing pleasure (I made it so you can\\'t go on the glacier though; at least not in this version!). The exterior also features stone walls up the side of the granite shelf, which adds to the Ancient Nordic theme, and the walls are actually part of the pathway up to the house. It is possible to get on the roof of the house, to get the best possible view of the Eastmarch from this area (and it\\'s quite a view indeed! You can see Windhelm, Winterhold and the College, part of High Hrothgar and much more!).\r\n\r\n\r\n[center][b][color=\\\"#FF8C00\\\"]Interior Features\r\n================[/color][/b][/center]\r\nMerchant that buys and sells weapons and armor (NEW to v1.1)\r\n14 Weapon Plaques (4 are the Weapon-and-Shield plaques)\r\n14 Weapon Racks\r\n9 Chests & 5 Safes (Entrance chest included for quick loot drops)\r\n9 Mannequins\r\n8 Shield Plaques (Not counting the Weapon-and-Shield plaques)\r\n8 Weapon Display Cases (1 is a Dagger Display Case)\r\nTalos Shrine w/ Statue\r\nThrone\r\nNew unique Steel Warhammer which ignores Armor Ratings of enemies\r\nA full-fledged Feast on a long table (Carnivore\\'s feast; theres not a single veggie to be found!)\r\nDark Elf servant with AI to cook your meals, sleep in his own bedroll, and otherwise sit around and drink mead!\r\nYsgramor Statue\r\nStuffed Bear (Not to be cuddled with!)\r\nLots of Mead!\r\nBar to sit and drink at\r\nCooking pot\r\n\r\nAnd More!\r\n\r\n\r\n[center][b][color=\\\"#FF8C00\\\"]Exterior Features\r\n================[/color][/b][/center]\r\nFast Travel Marker (Need to discover the house first)\r\nlots of snow FX\r\nTanning Rack\r\nForge\r\nGrinding Wheel\r\nWork Bench\r\nSmelter\r\nBasically that\\'s it other than a lot of visuals, statics and whatnot\r\nOh yeah, there\\'s [color=red]a talking midget Frost Dragon that will defend your home with its life![/color]\r\n\r\n\r\n[center][color=\\\"#FF8C00\\\"][b]UPDATE INSTRUCTIONS\r\n===================[/b][/color][/center]\r\nIf you are updating from V1.0, you need to follow these instructions before you overwrite the old esp or weird things will happen! Sorry, but it\\'s gotta be done :(. (Note: If you use a mod that greatly reduces cell respawn times, then you can just wait around until the cell respawns rather than follow these steps; use the tfc console command to make waiting take a couple seconds rather than 24 seconds.)\r\n\r\n\t1) Remove EVERYTHING that you placed in the house, including stuff in/on chests, racks, plaques, display cases, mannequins etc! You will lose anything you don\\'t take, FOREVER!\r\n\t2) Go to Windhelm or anywhere away from the house and save (quicksave should be fine)\r\n\t3) Disable the old esp\r\n\t4) Go back to your save, and save again, then quit the game again\r\n\t5) Replace the old esp with the new esp and enable it in your mod manager\r\n\t6) You are done, travel back to the house and behold the new changes!\r\n\r\n\r\n[center][b][color=\\\"#FF8C00\\\"]Recommended Mods\r\n================[/color][/b][/center]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=10652]\r\nWandering Dupe Mannequin Fix\r\n[/url]Fixes Mannequin bugs\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=11370]\r\nSpouses Can Live Everywhere\r\n[/url]Your spouse can move into this house (See known issues for how to get your spouse into the house).\r\n\r\n\r\n[center][b][color=\\\"#FF8C00\\\"]Recommended INI Tweaks\r\n======================[/color][/b][/center]\r\nI recommend that you disable the Border Regions, because a tiny area of this house is behind the border, and otherwise  can\\'t be accessed, although there is nothing of particular interest in that part anyway so it\\'s purely optional!\r\n\r\n\t1) Go to Documents\\\\My Games\\\\Skyrim and open Skyrim.ini\r\n\t2) Add this line to the [General] section: bBorderRegionsEnabled=0\r\n\t3) Save and close, \r\n\t4) Done!\r\n\r\n\r\n[center][b][color=\\\"#FF8C00\\\"]Location of the House\r\n====================\r\n[/color][/b][/center]\r\nGo to Narzulbur, East of Windhelm.\r\n\r\nFrom the entrance of Narzulbur, head west, follow the mountain north then east.\r\nStick to the mountain, there will be a right-hand turn around a corner. You\\'ll see hunters.\r\nHead east from the hunters, up the hill.\r\nYou\\'ll see the stairs to the left, that\\'s the bottom of the path up to the house.\r\nFollow the path to the house.\r\n\r\n\r\n[b][center][color=\\\"#FF8C00\\\"]Change Log\r\n==========[/color][/center][/b]\r\nV1.1 - \r\n Tons of changes to the interior; moved throne to second floor, made second floor into 2 rooms, added shelves, a bar, a new merchant npc, removed the unnecessary wall in front of the stairs, moved the table, moved the talos statue and shrine, removed the wind sounds, moved the ladder to the roof, changed the location of some of the mannequins, moved the Ysgramor statue and added a second one, that\\'s all I can think of for the inside right now but there\\'s probably more! Added tanning rack and fast travel map marker to exterior, cleaned the esp a bit (I accidentally moved something slightly in a couple unrelated cells, that\\'s fixed), other small, unimportant changes.\r\nV1.0 - Initial Release\r\n\r\n\r\n[center][b][color=\\\"#FF8C00\\\"]Installation\r\n==========[/color][/b][/center]\r\nIf using NMM, just double click this mod to activate it, and you\\'re done.\r\nIf not using NMM, place the files in your Skyrim\\\\Data folder, open your Skyrim launcher, go to the data option, and find Cloudsrest Manor.esp, and activate it.\r\n\r\n[center][b][color=\\\"#FF8C00\\\"]Uninstallation\r\n============[/color][/b][/center]\r\nBe sure to get all of your stuff out of the house before deactivating the mod, or it will be gone forever, even if you reactivate the mod.\r\n\r\n[center][b][color=\\\"#FF8C00\\\"]Known Issues/Bugs\r\n=================[/color][/b][/center]\r\n1) Sorry, the exterior is not yet nav-meshed. That means that followers will not even try to follow you to your new home. I  definitely plan to do this in a later version, but I wanted to get this mod out there so I just released it without exterior nav-meshing. For now if you want a follower/spouse in the home, you will have to  select them in the console, then when you are in the house type MoveTo Player.\r\n2) The throne has a bug where if you look around in first person, your character will rotate with the camera. To avoid this make sure to switch to third person before looking around.\r\n\r\n\r\n[center][b][color=\\\"#FF8C00\\\"]Future Plans\r\n============[/color][/b][/center]\r\n Nav-Mesh the exterior of the house\r\n Add a quest to obtain the house\r\n Replace the first-story ceiling with a better texture (currently uses floor texture)\r\n Improve the functionality of the Dunmeri Servant (He will give you food, mead, and do other things as well, such as possibly playing music)\r\n Add more clutter to both the interior and exterior of the house\r\n\r\n\r\n[center][b][color=\\\"#FF8C00\\\"]Feature Requests\r\n==================[/color][/b][/center]\r\nGo ahead and request features if you think of something, if I like them I\\'ll probably add them in!\r\n\r\n\r\n[center][b][color=\\\"#FF8C00\\\"]Compatibility\r\n=============[/color][/b][/center]\r\nThis mod is not compatible with any mods that change the cells affected by my mod. The location is pretty secluded though, so I don\\'t forsee any major conflicts.\r\n\r\nThe exterior fires in this mod are compatible with Frostfall - Hypothermia Camping Survival\r\n\r\n\r\n[center][b][color=\\\"#FF8C00\\\"]Other Mods by Me\r\n=================[/color][/b][/center]\r\n[b][center][url=http://skyrim.nexusmods.com/downloads/file.php?id=8075]Realistic Wildlife Loot[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=8841]Shadowmere Visual Effects[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=9872]Haunted House[/url][/center][/b]\r\n\r\n\r\n[center][b][color=\\\"#FF8C00\\\"]Credits\r\n=======[/color][/b][/center]\r\nBethesda Softworks for creating epic games\r\nSkyrimNexus ftw\r\n[/size]",
  "categoryId": "67",
  "version": "1.1",
  "author": "Xion209",
  "createdUnix": "1330723852",
  "updatedUnix": "1330845673",
  "containsAdultContent": false,
  "uploadedBy": "Xion209",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39319",
      "name": "Cloudsrest Manor V1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "100",
      "fileName": "Cloudsrest Manor V1_0-11902.zip",
      "uploadedUnix": "1330723927",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9970ea359c7d98dd1b77680f4aad666b2205230c5990a5bb4960a75f29d7a5db/analysis/1406725767/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cloudsrest%20Manor%20V1_0-11902.zip?fid=39319&ttl=1535773388&ri=8192&rs=8192&setec=66df712202d20e420562ecc60e0828a3"
    },
    {
      "fileId": "39863",
      "name": "Cloudsrest Manor V1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "103",
      "fileName": "Cloudsrest Manor V1_1-11902.zip",
      "uploadedUnix": "1330845673",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/bcdb6173fa6ee21f2042cb0aaa472bde11fa89af3fa4e67580a172ac1d422b65/analysis/1406728748/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cloudsrest%20Manor%20V1_1-11902.zip?fid=39863&ttl=1535773389&ri=8192&rs=8192&setec=6366f800201aa4842225de0a6fcd412b"
    }
  ]
}