{
  "modId": 11904.0,
  "modName": "Necromancer - Necromancy and Conjuration extended",
  "summary": "Powerful unique Necromancy and Conjuration spells with a story that come with a cost. Adds new spells, perks, books, items, weapons, armor, etc. If you\\'re like me and love Conjuration and think the vanilla game lacks some spells, this mod is for you.",
  "descriptionHtml": "VERSION\r\n-------\r\n1.6-ATTENTION!!! Namira Gauntlets might be out of your inventory, you have to buy them again (price is a LOT lower, so don\\'t worry), equip and unequip them, make a safeguard save, then everything should be normal, sorry for the trouble. Added 3 new staffs (with spells), 5 books, 3 spells, 2 items and video. Prices reduced for all items. Impalement and Arrow Storm spell changed according to feedback. Some optimizations\r\n1.5-Added 4 new spells, 3 new items, 3 new books and new video. Some bug fixes\r\n1.4-Quick fix to Undead Horde not summoning 5 undead to some people\r\n1.3-Added 3 new spells, 2 new items, 3 new books, new README according to feedback and new video!\r\n1.2-.bsa file was missing! Sorry! Thanks to Nahkin\r\n1.1-Added some lines to a specific script\r\n1.0-Release\r\n\r\nTITLE\r\n-----\r\nNecromancer - Necromancy and Conjuration extended\r\n\r\nFILE DESCRIPTION - SMALL DESCRIPTION\r\n------------------------------------\r\nPowerful unique Necromancy and Conjuration spells with a story that come with a cost. Adds new spells, perks, books, items, weapons, armor, etc. If you\\'re like me and love Conjuration and think the vanilla game lacks some spells, this mod is for you.\r\n\r\nLONG DESCRIPTION\r\n----------------\r\n\r\nSPELLS, PERKS, BOOKS, ITEMS, WEAPONS, ARMOR, ETC\r\n------------------------------------------------\r\nAll spells are very powerful, in order to balance things it\\'s supposed for you to use heavy enchanted items or use one of the items provided by me.\r\n\r\n***Namira Wrath***\r\n\r\nGood: a projectile that kills anything at contact\r\nBad: similiar to the side effects of Death Touch, 3 seconds to cast\r\nHow to get it and history: go to the Hall of the Dead in Markarth and read the book \\\"Necromancy, v2\\\" that can be found near the shrine of Arkay\r\nNote: you can just read or read it and stole it\r\n\r\n***Bound Armor***\r\n\r\nGood: armor rating of 400 not counting with heavy armor skill\r\nBad: can\\'t unequip while effect lasts, magicka regen is off and at the end you will be naked, so be carefull! \r\nHow to get it and history: go to Urag gro-Shub in the librarian of The Arcanaeum at the College of Winterhold and buy the book \\\"The Art Of Conjurating Objects, v2\\\"\r\n\r\n***Suck Life***\r\n\r\nGood: consume a soul and obtain special ingredients\r\nHow to get it and history: go to the Hall of the Dead, a House of Arkay in Falkreath and read the book \\\"Necromancy, v1\\\" that can be found in the end table near the beds\r\nNote: you can just read or read it and stole it\r\n\r\n***Yersiman Consume Soul***\r\n\r\nGood: after death, consume the vital essence of your foe for 40 seconds\r\nBad: consumes one heart\r\nHow to get it and history: see spell Suck Life\r\n\r\n***Cold Staff***\r\n\r\nGood: the power of a Dragon\r\nBad: it freezes!\r\nHow to get it and history: see Inferno Staff\r\n\r\n****Inferno Staff****\r\n\r\nGood: the power of a Dragon\r\nBad: it burns!\r\nHow to get it: go to Farengar Secret-Fire in Dragons Reach at whiterun and pickpocket him\r\nHistory: pickpocket him again and retrieve the journal \\\"Dragons Research Journal, v1\\\"\r\n\r\n***Zombie Jesuz Staff***\r\n\r\nGood: turn corpses to lich\r\nBad: the lich will help but won\\'t obey and follow you like normal summons\r\nHow to get it and history: go to Dragons Reach in Whiterun and buy the book \\\"Zombie Jesuz Staff\\\" from Farengar Secret-Fire, follow instructions\r\nNote: you can\\'t unequip the staff until the Lich appears, you can turn more than one corpse at a time    \r\n\r\n***Falion Ring Of Conjuration***\r\n\r\nAn expensive ring that gives you 100% less mana to cast conjuration spells\r\nHow to get it: buy it from Falion\\'s at Morthal\r\n\r\n***Crawlers Of The Deep***\r\n\r\nGood: summons five poisoned chaurus\r\nBad: you get poisoned\r\nHow to get it and history: go to Calcelmo in the Dwemer ruins beneath Markarth and buy the book \\\"Crawlers, v1\\\"\r\n\r\n***Arrow Storm***\r\n\r\nGood: remember movies that have many flying arrows?\r\nBad: better take cover\r\nHow to get it and history: go to Urag gro-Shub in the librarian of The Arcanaeum at the College of Winterhold and buy the book \\\"The Art Of Conjurating Objects, v1\\\", follow instructions\r\nNote: to recast you need to get the item again\r\n\r\n***Impalement***\r\n\r\nGood: impale your foes with tremendous force\r\nBad: loose all your stamina, 3 seconds to cast\r\nHow to get it and history: see spell Arrow Storm\r\n\r\n***Death***\r\n\r\nGood: everyone starts dying\r\nBad: everyone includes you\r\nHow to get it and history: go to the Hall of the Dead in Falkreath, find Runil pickpocket him to get the book \\\"Grim Reaper\\\", follow instructions\r\nNote: to recast you need to get the item again \r\n\r\n***Death And Decay***\r\n\r\nGood: absorb health and stamina while decaying targets, high damaged targets loose their minds\r\nBad: absorbing decaying matter damages your health\r\nHow to get it:\r\n-Get the new perk\r\n-OR go to the Riverwood trader and buy the book \\\"Conjuration and Necromancy studies, v1\\\"\r\n-OR read the spell Revive (third spell)\r\nHistory: read the book  \r\nNote: essentials and creatures won\\'t decay, they just stagger and loose health and stamina. Decaying starts with zombie then turn to bones, while in zombie and if you stop casting the spell targets will recover original form\r\n\r\n***Undead Horde***\r\n\r\nGood: Summons up to five undead\r\nBad: Consumes all your magicka and some health, not all of them are friendly, they consume your heal rate in order to live\r\nHow to get it:\r\n-Get the new perks\r\n-OR go to Belethor\\'s General Goods in Whiterun buy the book \\\"Conjuration and Necromancy studies, v2\\\"\r\n-OR read the spell Revive (third spell)\r\nHistory: read the book\r\n\r\n***Revive The Fallen***\r\n\r\nGood: Revive lot\\'s of bodies\r\nBad: Consumes all your stamina and magicka, your stamina rate is down for a time\r\nHow to get it:\r\n-Get the new perk\r\n-OR go to the College of Winterhold and buy the book \\\"Conjuration and Necromancy studies, v3\\\" from Phinis Gestor\r\n-OR go to Falion\\'s house in Morthal, pickpocket him and retrieve his journal \\\"Falion\\'s Conjuration Research Journal\\\" (if not unlocked yet, this unlocks all three first spells)\r\nHistory: read the book and journal\r\nNote: Falion has another interesting item, \\\"Falion Experimental Necromancer Robes\\\", his enchantment gives:\r\n-100% Less mana needed to cast Conjuration spells\r\n-200% Faster magicka regeneration rate\r\n\r\n***Pest And Disease***\r\n\r\nGood: summons ten disease infected skeevers\r\nBad: you get the infection\r\nHow to get it: go to the Bards College in Solitude and pickpocket Pantea Ateia to get Hamelin\\'s Flute\r\nHistory: pickpocket her again and get the book \\\"Pied Piper of Hamelin\\\"\r\n\r\n***Death Touch***\r\n\r\nGood: instakill (target instantly turns to bones)\r\nBad: consumes all stamina, all magicka and 99% of your health\r\nHow to get it: go to the Silver-Blood Inn in Markarth and buy the \\\"Namira Gauntlets\\\" from Kleppr \r\nHistory: buy the book \\\"Namira Lost Gauntlets\\\" from him\r\nNote: essentials and creatures won\\'t turn to bones (they just die), spell only works with gauntlets equipped\r\n\r\n***Turn To Zombie****\r\n\r\nGood: turn people to zombies in a area\r\nBad: zombies are aggressive towards everyone, including you, your heal, magicka and stamina rate is consumed\r\nHow to get it: buy the book \\\"Necronomicon, v1\\\" from Bothela in Markarth\r\nHistory: read the book\r\nNote: essentials and creatures won\\'t turn to zombie, they just stagger at hit and suffer from the same bad effects. Zombies will recover when the effect goes away\r\n\r\nEXAMPLE OF HISTORY\r\n------------------\r\nQuote from the book \\\"Conjuration and Necromancy studies, v1\\\":\r\n\r\n\\\"Prolongued exposion damages flesh, bones, clothes and armor, as a side effect the victim looses is mind. Because this is an absorb spell, prolonged use poisons the caster, this is caused by the absorption of decaying matter.\\\"\r\n\r\nINSTALLATION\r\n------------\r\nShould be simple, it\\'s only three files, one .esp, one .bsa and one .bsl file.\r\n\r\nMOTIVATION\r\n----------\r\nNecromancer - Necromancy and Conjuration extended: Necromancy Spells with a story\r\n\r\nAfter playing the game I asked myself, where are the undead? Why can\\'t I have them? And why can\\'t I revive more people? I know, there are some really good mods out there that add some cool spells, congrats to them and to all modders.\r\n\r\nBut I wanted something else, I want to have new powerful spells but at the same time try to balanced them, I like the vanilla flavor of things.\r\n\r\nIs this possible? In Skyrim? Such a huge game with so many things and so many combinations. To be honest I don\\'t think it\\'s possible to balance such a big game, BUT I CAN TRY, and that\\'s what I did, I guess, you are the ones that are gonna evaluate this.\r\n\r\nWhat\\'s special about this spells? In all honesty I think it\\'s the balance, you can use them, but they come with a cost.\r\n\r\nTHANKS\r\n------\r\nThanks to Bethesda for providing such a great game and tools, thanks to all that read this, thanks to the ones that enjoy the mod and thanks to the Nexus site for providing a way to share files.\r\n\r\nThanks to my wife for understanding me, I love you.\r\n\r\nCREDITS\r\n-------\r\nBy Black aka Black RL aka BlackRL\r\nhttp://www.bethsoft.com/\r\nhttp://www.elderscrolls.com/skyrim/\r\nhttp://www.creationkit.com/\r\nhttp://www.uesp.net/\r\nhttp://skyrim.nexusmods.com/\r\nhttp://en.wikipedia.org/",
  "categoryId": "75",
  "version": "1.6",
  "author": "Black RL",
  "createdUnix": "1330724673",
  "updatedUnix": "1332105997",
  "containsAdultContent": false,
  "uploadedBy": "BlackRL",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44586",
      "name": "Necromancer - Necromancy and Conjuration extended",
      "version": "1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "51",
      "fileName": "Necromancer - Necromancy and Conjuration extended-11904-1-6.rar",
      "uploadedUnix": "1332105997",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/ec9ced6c6a30a3bf642588060a51fa2c9e6cc721d4cf40f00100dac19d289698/analysis/1406766905/",
      "changelogHtml": " ATTENTION!!! Namira Gauntlets might be out of your inventory, you have to buy them again (price is a LOT lower, so don\\'t worry), equip and unequip them, make a safeguard save, then everything should be normal, sorry for the trouble. <br/> \n Added 3 new staffs (with spells), 5 books, 3 spells, 2 items and video. Prices reduced for all items. Impalement and Arrow Storm spell changed according to feedback. Some optimizations <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Necromancer%20-%20Necromancy%20and%20Conjuration%20extended-11904-1-6.rar?fid=44586&ttl=1535773391&ri=8192&rs=8192&setec=b0390be45cc2ea8ca57c74d6a1dd14a2"
    }
  ]
}