{
  "modId": 11919.0,
  "modName": "Economics of Skyrim",
  "summary": "Overhauls Skyrim\\'s economy into a region-based system, with goods and prices dependent on where you are shopping.",
  "descriptionHtml": "[center][IMG]http://i.imgur.com/fqaP1.png[/IMG][/center]\r\n\r\n[color=Yellow][size=5][center]Also available in the following localizations:[/center][/size][/color]\r\n[center][url=http://skyrim.nexusmods.com/mods/20179][IMG]http://i.imgur.com/hMgwn.jpg[/IMG][/url] [url=http://skyrim.nexusmods.com/mods/25535][IMG]http://i.imgur.com/VhmxN.jpg[/IMG][/url][url=http://skyrim.nexusmods.com/mods/28800][IMG]http://i.imgur.com/kqC4c.jpg[/IMG][/url][url=http://skyrim.nexusmods.com/mods/29487][IMG]http://i.imgur.com/Mpxvj.jpg[/IMG][/url][/center]\r\n\r\n\r\n\r\n[center][IMG]http://i.imgur.com/PX9cu.png[/IMG][/center]\r\n\r\n-\tSkyrim version 1.8.151.0.7 or later. Previous versions WILL NOT WORK. Please don\\'t bother asking for help if you have an earlier version of Skyrim, as I guarantee you your issues are being caused by your game being out of date.\r\n\r\n-\tSkyrim Script Extender version 1.05 or later. There is some stuff this mod does that, on its own, Papyrus just can\\'t do. That is why Skyrim Script Extender is needed. The link to download is in the Required Files section.\r\n\r\n\r\n[center][IMG]http://i.imgur.com/50r68.png[/IMG][/center]\r\nYou have arrived at your local Blacksmith, and are shopping for new toys, armor, whatever it is you want. Ever notice something odd? Like how every single blacksmith seems to have exactly the same items in stock? Well, that’s because they do.\r\n\r\nEvery major merchant in the game have their shops stocked based on a single boilerplate arrangement of leveled lists, which both randomizes their stock and it is also rather obviously scaled to match your level. It works, but is very inelegant and can raise a few eyebrows when the smith who had nothing but low-grade Steel one day suddenly has a boatload of Ebony gear the next.\r\n\r\nWouldn\\'t it make much more sense for the merchants to stock items based on the resources available to them in whichever region they are found? These are not modern times, merchants do not rely on buying things from other people to sell; they sell what they make. I, for one, feel the game\\'s economy should reflect that. That is where this mod comes in.\r\n\r\nAnd now, it\\'s better than ever! Gone are the old issues with unusable ingots and duplicated items! The mod has received a total makeover, literally rebuilt from the ground up. This means you can be assured a much better economic experience than before.\r\n\r\n\r\n[center][IMG]http://i.imgur.com/XaiPP.png[/IMG][/center]\r\n        Q: I installed Skyrim Script Extender! Why is the mod telling me SKSE isn\\'t installed?\r\n        A: Because you did not FULLY install Skyrim Script Extender. Just dropping in the DLL and the loaders will not do it anymore, you need to install everything packaged in the Data folder, as well. If you don\\'t do this, Papyrus can\\'t access the new SKSE functions and you will receive the \\\"SKSE not detected\\\" error on startup.\r\n\r\n        Q: Why are enchanted items sometimes cheaper than their base counterparts?\r\n        A: This is because they do not share value information with their base items. Unfortunately, it would be terribly impractical to include them to have their values changed (there are just too many). This issue is known to me and there is nothing I can do to address it, so please do not ask.\r\n\r\n        Q: Why does the Regional Values script take so long to execute?\r\n        A: Because the Papyrus VM is a terrible platform for handling large amounts of items as I am. If you don’t like it, you can turn the Regional Values off.\r\n\r\n        Q: I never get the prompt to start the mod! What do I do?\r\n\tA: Download the Loose Scripts version of the mod and use it instead. This occurs if the game fails to properly load the scripts when the mod is started. If that fails to solve your problem, check your game’s version number. If it is below 1.6.89, you must update your game.\r\n\r\n        Q: I\\'ve correctly installed SKSE and am launching it through the launcher, but the mod still tells me SKSE was not found! What gives?\r\n        A: Windows User Account Control is blocking SKSE from accessing the game, and this will occur if you installed Skyrim into the Program Files directory instead of an independent directory that UAC is more lenient with. If you are unwilling to move your Steam installation elsewhere, you can fix this by giving SKSE Admin privileges.\r\n\r\n        Q: The mod is bloating my save! What\\'s happening?\r\n        A: Your savegame is damaged. This is done primarily through carelessness. Skyrim is not Oblivion or Fallout 3: a lot more data gets stuck in your save permanently when you install a mod. If you are not careful about what mods you add and remove, you will end up doing permanent damage to your save which will cause all sorts of problems not just with this mod, but many others, as well. There are currently no means of repairing your saves available, so the only fixes are to either revert to earlier, healthier saves or to start a new game.\r\n\r\n        Q: Is this mod clean?\r\n\tA: Yes. It was checked in TES5Edit and contains no dirty or wild edits.\r\n\r\n\r\n[center][IMG]http://i.imgur.com/zKXJJ.png[/IMG][/center]\r\nFixed Bug: Arcadia and Farengar Secret-Fire were not linked to their respective workbenches correctly.\r\n\r\nFixed Bug: Removed workstation rental dialogue from a couple actors who had no reason to offer it.\r\n\r\nFixed Bug: Arcadia and Zaria will no longer offer the Alchemy tutorial quest to avoid a soft-conflict. It is now exclusive to Orgnar in Riverwood. Fix is not retroactive.\r\n\r\nFixed Bug: Adrianne Avenicci will no longer offer the Smithing tutorial to avoid a soft-conflict. It is now exclusive to Alvor in Riverwood. Fix is not retroactive.\r\n\r\nFeature Change: Allowed possibility to disable workstation rentals.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n[center][IMG]http://i.imgur.com/t9J8i.png[/IMG][/center]\r\n\r\n[color=yellow]-Regional Economy-[/color]\r\n\r\nGlobally:\r\n\r\n- General merchants will no longer be a one-stop shop for all your adventuring needs. They will instead be geared towards selling food, books, clothing (why do none of the merchants in this game sell clothes?!), jewelry, and odds and ends.\r\n\r\n- Alchemy shops stock regional ingredients much more often and in much higher quantities along with some ingredients that are imported from other areas of Skyrim, though these will not always be available and stocks will not be guaranteed. Rare ingredients will have a chance to be stocked by any city-dwelling alchemist, but that chance is lower and you won\\'t find as many available.\r\n\r\n- Blacksmiths sell weapons and armor based on what is available to them in their specific region. There will be an occasional, though very slight, chance for rare items to be in stock, though you will need to have played the game for some time before you can actually see them (for the sake of balance).\r\n\r\n- Innkeepers serve food based off of a regional menu. This menu are strictly adhered to, as they do need to keep costs down. Buying local product is a good way to save some coin. The inns found in major cities serve a wide range of foods along with a selection of desserts, whereas inns and taverns found in the more rural areas of Skyrim tend to operate on a more rigid \\\"this is today\\'s dinner\\\" style.\r\n\r\n- Merchant stocks are un-leveled. If you have the coin, you\\'ve got the product. Plain and simple. Instead, what is available for you to purchase depends on where in Skyrim you are shopping. Whiterun and Riften, for instance, now have vastly different goods for sale.\r\n\r\n- The vast majority of Skyrim\\'s merchants no longer sell magic items. This is done to A: keep with the game lore better that Skyrim is relatively superstiscious of magic and B: for the sake of my own sanity (repricing thousands of enchanted items by hand is not something I have any interest in doing). If you are shopping for spells and soul gems, your best bet is to visit your local court mage or take a carriage to Winterhold.\r\n\r\n- You will have to pay extra for non-local goods than for local product to make up for shipping costs.\r\n\r\n- If you are looking for goods that may not be entirely from legitimate sources, Khajiit Caravans should have what you need. They are also the only merchants who are openly willing to sell you lockpicks. Also, try the fondue, mages love the stuff!\r\n\r\n- Orcish gear is available for cheaper prices in the various Orc Strongholds in Skyrim. Of course, actually being allowed to buy it is something you\\'ll need to figure out for yourself.\r\n\r\n\r\nWhiterun: Major resources: Leather, Iron, and Corundum, meat and game.\r\n\r\n- Given its central location, there is a chance of finding a little bit of everything here, but stocks will still be heavily geared towards what is found out in the plains. Lots of meat and hides, as well as plentiful iron.\r\n\r\n- This means alchemists stock a lot of tundra-specific ingredients, but there is still plenty of imported ingredients for sale.\r\n\r\n- General merchants are geared towards the sale of meat and vegetables, as well as working class clothing. Goods are geared towards a more middle-class standard of living.\r\n\r\n- Blacksmiths sell a lot of leather product (due to the plentiful game hunting in the tundra) as well as a fair bit of iron and steel. There will be a higher chance than other areas to see other armor and weapon types in town given, such as Dwemer or Elven. Iron and Corundum is available plentifully.\r\n\r\n- The Drunken Huntsman is geared towards selling hunting quality bows and arrows. They will not stock higher grades, as they are not in the business of combat archery.\r\n\r\n- Eorlund Gray-Mane now exclusively sells Skyforge Steel weapons and armor, as well as any special gear only open to the Companions.\r\n\r\n- Market merchants: meat stall will sell plenty of fresh meats, vegetable stall will sell vegetables and bread, and the Gray-Mane stand will sell basic silver jewelery.\r\n\r\n- Innkeepers will sell lots of meat steaks including venison, beef, and occasionally mammoth. Vegetable stews are also popular fare.\r\n\r\n- In short, Whiterun is an excellent city for newer characters to get geared up learn the lay of the land, as goods and services are plentiful in this central city of Skyrim.\r\n\r\n\r\nMarkarth: Major resources: Dwemer metal, silver, and gold.\r\n\r\n- As Markarth is built in an old Dwemer city, plenty of Dwemer metal means plenty of Dwemer goods. Silver and Gold is available in great supply, as well, but little animal hides.\r\n\r\n- Alchemists stock Reach-specific ingredients, such as Juniper Berries , as well as ingredients commonly found in Dwemer ruins (like Falmer Ears and Chaurus Eggs).\r\n\r\n- General merchants have plenty of Dwemer utensils to sell, as well as foods that favor rocky environments. Clothing is geared towards mining with a bit of finery here and there. And lots of jewelery. Markarth is also (almost) the only place in Skyrim you can find raw gemstones for sale.\r\n\r\n- Blacksmiths commonly stock Dwemer goods in Markarth, as well as silver weapons. Dwemer metal scraps and silver can be purchased as ore.\r\n\r\n- Innkeepers sell hearty stews, a fair bit of goat and plenty of starch. Leafier vegetables are not often found fresh, as the Reach makes for very poor farmland.\r\n\r\n\r\nRiften: Major resources: Ebony and Malachite, wood, vegetables.\r\n\r\n- Riften\\'s proximity to Morrowind makes it much easier to obtain raw Ebony and Glass than most other places. You will see Ebony more often than Glass here.\r\n\r\n- Alchemists have Rift-specific ingredients for sale, so forest mushrooms and bird eggs can be found plentifully. River fish, as well, due to the presence of plentiful lakes.\r\n\r\n- Due to heavy forests, farming is difficult in the Rift, so foods are favored towards items that can be more easily foraged. That being said, farm space has been cleared, and the ground is very fertile, so fresh fruits are plentiful.\r\n\r\n- General merchants sell lots of wood-based products in Riften, though rarely anything valuable due to the presence of the Thieves Guild.\r\n\r\n- Blacksmiths will stock Ebony and Glass items more often in Riften, and ingots of Ebony and Malachite are also available, though expensive and in short supply.\r\n\r\n- Innkeepers favor Maven Black-Briar\\'s mead in the Rift, as well as hearty stews due to the Rift\\'s high elevation compared to the rest of Skyrim.\r\n\r\n\r\nSolitude: Major resources: Moonstone and Quicksilver, fish.\r\n\r\n- As the Imperial capital, Thalmor influence is very strong in Solitude, so you will often come across Elven weaponry and armor.\r\n\r\n- A fairly rich town, Solitude has more finery available for sale than most other provinces.\r\n\r\n- Fish is very common to see on the plate. Vegetables are a bit more difficult due to how far north Solitude is, and the rocky environment prevents good farming.\r\n\r\n- General Merchants sell finer wares than other places in Solitude. Clothing is geared towards upper-class, and plenty of fish. Horker can also be found occasionally.\r\n\r\n- Alchemists specialize in hardy plant life found far to the north. As the Thalmor are magically inclined, rarer ingredients can be found more commonly in Solitude.\r\n\r\n- Blacksmiths often have Elven gear for sale, as well as Quicksilver and Moonstone. You cannot buy iron and steel at all here, they need it for Legion equipment.\r\n\r\n- Fletchers are geared toward Combat archery, due to the military presence in the city. Higher quality bows and arrows can be purchased here.\r\n\r\n\r\nWindhelm: Major resources: Malachite and Ebony from Morrowind, fish, leather.\r\n\r\n- Fish is the dominant protein in Windhelm. Little farmland is available, but what can be used is extremely fertile due to the volcanic presence, making for a decent supply of vegetables.\r\n\r\n- Alchemists stock the local flora, as well as river-caught fish since two rivers run through the Hold. Giant toes and Ice Wraith teeth can be found more often, too, as Nord tradition runs very deeply through the city (slaying a giant or an ice wraith is a Rite of Passage in Nordic culture).\r\n- Mammoth is found more often here than other places due to bolder hunters.\r\n\r\n- Light Armor is the preference of Windhelm, and thanks to its close proximity to Morrowind, has taken a liking to Glass equipment. Glass and some Ebony can be found more easily here than other Holds, specifically Glass thanks to the mines in Kynesgrove.\r\n\r\n- Foods are very Nordic, so heavy on roasted meat and stew, and plenty of ale and mead.\r\n\r\nSmall holds:\r\n\r\nFalkreath - Plenty of wood and birds means plenty of arrows from fletchers.\r\n\r\nMorthal - Marshy ingredients are plentifully sold, but selections are limited here due to the largely isolated community and resource-poor surroundings.\r\n\r\nDawnstar - A small trade hub in the far northern reaches, a fairly good selection of non-local goods is often found here.\r\n\r\nWinterhold - This is the place to go if you want magical gear. Spell tomes, scrolls, and robes can be bought for cheap and are readily available in Winterhold.\r\n\r\n[color=yellow]-Armor Sets-[/color]\r\n\r\n- It is now possible to buy an entire set of armor in one fell swoop. If you see a merchant has \\\"XXX Armor Set\\\" in stock, if you buy that item, every piece of that armor (including the shield, if applicable) will be added to your inventory.\r\n\r\n- Buying these full sets is slightly cheaper than buying the armor in individual pieces where the armor in question is regularly forged, and it is also the only way to buy armor if the materials to make it are not present in a particular region.\r\n\r\n[color=Yellow]-Regional Values-[/color]\r\n\r\nNot only are what the merchants selling affected by region, but so is what they will actually pay for them. As you travel, you might notice the published values of the items you are carrying are fluctuating. What you are seeing is how much merchants in the area are willing to pay for the items you are carrying around. You may not get too much out of a jewelry sale in Markarth, due to the abundance of Gold and Silver in the region, but in Whiterun, you can get a much better deal.\r\n\r\nNeed to make some fast cash? Why not BE the traveling trader who is responsible for all those non-local goods everyone else is selling? If you want to play the role of a traveling merchant, this mod is right up your alley.\r\n\r\n\r\n[color=yellow]-Extra Merchant Gold-[/color]\r\n\r\nLet’s face it; merchants in this game simply don’t have enough gold to keep up with all the high-tier loot you truck back to them late into the game. Well, no more! This mod provides a number of options for you to choose from for how much extra gold you want your merchants to have. They are:\r\n\r\n1.\tVanilla (No Change)\r\n2.\tMore (+500 extra Gold)\r\n3.\tLots More (+1000 extra Gold)\r\n4.\tRich (+2000 extra Gold)\r\n5.\tBreak the Bank! (+5000 extra Gold)\r\n\r\nYou may choose whichever one is to your liking. And you may change this whenever you wish, though please take note for the sake of balance, your changes will not take effect for any merchants you have already visited until the next time their inventories are restocked.\r\n\r\n[color=yellow]Blacksmith Services[/color]\r\n\r\nBlacksmiths should be good for more than just a place to shop for weapons and armor.  Metalwork is a fine craft that encompasses so much more than retail sales, so now the blacksmiths will be allowed a means of exercising that craft for you. All you need is some coin to spend.\r\n\r\n1.\tTempering: Blacksmiths can temper your weapons for you now if you do not wish to do it yourself. A new dialogue topic is available with all blacksmiths while they offer services: “Can you improve my equipment?” Select it, and the Smith will ask you if you wish to improve your weapons or your armor. Choose which you want (or change you mind if you hit the topic by mistake) and the smith will inform you to what grade of quality he is capable of improving your gear to, and will do so. For a price.\r\n\r\n2.\tOrdering: Blacksmith not have that elusive Dwarven Helmet you’ve been after? Why not ask for it to be made for you? A new dialogue topic is available with all blacksmiths: “Can I order some equipment?” Select it, and the smith will show you the list of all the weapons and armors he can craft for you (it varies by region, so different Blacksmiths will offer different goods). For each item you purchase, you must wait one game day before you can obtain it (so if you order three items, you will need to wait three days until you can pick up your order). An Objective will be displayed for you that will show you how long you have left to wait to help you keep track of your orders easily, and will count down every 24 hours. Once the full time you need to wait has elapsed, the Objective will update telling you your order with a particular blacksmith is ready, and a Quest Marker will point the way to the Smith in question (in case you forgot). Talk to him again, ask “is my equipment ready?”, and you will receive your shiny new gear. [b]You may only have ten orders pending at a single time.[/b]\r\n\r\n3.\tBoth of these features are universally compatible, so you will be able to access them from any blacksmith in the world, including those added by other mods.\r\n\r\n[color=yellow]Enchanting Services[/color]\r\n\r\n\tCourt Mages will now provide you with Enchanting services, so that characters who would prefer not to make use of the Enchanting skill can purchase enchantments, or to allow for you to receive access to higher powered enchantments for a price.\r\n1.\tGo to your local Court Mage and select the new dialogue option “Could you enchant something of mine?” You will then be prompted to choose the soul quality you want, as well as the asking price per-enchantment. This price is non-negotiable. You can use Petty all the way up to Grand souls.\r\n2.\tOnce you select the soul quality, you will be brought to the Enchanting menu. From here, simply use it as normal. You may only enchant one item at a time. I would have preferred this not be the case, but due to some shortcomings in the Enchantimg menu logic, this is the only option on the table right now.\r\n3.\tYou may only use enchantments that have been learned through Disenchantment in the service. This is a hardcoded game mechanic that cannot be changed. But thankfully for you, the Court Mages offer free Disenchantment services (but note you will not receive any Enchanting skill boosts).\r\n4.\tAs with the Blacksmith services, this feature is universally compatible, so you may access it from any mods that add their own court mages.\r\n\r\n[color=yellow]Workstation Rental[/color]\r\n\r\nNow you must pay to use a merchant\\'s workstation. Speak to the merchant in question and ask to use his equipment, and for a fee (100 Gold) you will be able to use their crafting equipment for 24 hours.\r\n\r\nThis goes for all merchants who have a crafting workbench they normally would be found using, so the fee will cover an Alchemist\\'s Alchemy bench, as well as the full set of crafting benches for Smithing at the local Blacksmith.\r\n\r\nThis feature is currently only compatible with the vanilla merchants. Dawnguard will not be covered due to this being unnecessary for them (you must join factions to use the new workbenches in Dawnguard, which defeats the purpose of paying for them).\r\n\r\nThis feature can be disabled if you don\\'t like it in the menus.\r\n\r\n\r\n[center][IMG]http://i.imgur.com/XxXUJ.png[/IMG][/center]\r\n\r\n[center][IMG]http://i.imgur.com/VxeCQ.png[/IMG][/center]\r\n\r\nWrye Bash users: The mod is provided in a BAIN-friendly format so that you may quickly drop it into your Installers folder and install.\r\n\r\nNexus Mod Manager users: Nexus Mod Manager will be able to handle the packaging of this mod on its own, you won’t need to do anything fancy. Just convert it into an FOMOD and install.\r\n\r\nIf you use none of the above: Just drag and drop the provided files into your Skyrim\\\\Data folder.\r\n\r\nIf you have Dawnguard, install the EOS-Dawnguard.esp file in addition to the base plugin. Failure to do so will result in your game crashing at startup.\r\n\r\nUsers of Fuz-Ro-Doh (a Universal Silent Voice SKSE plugin) can download the optional “No Silent Voice” file, which omits the silent MP3s generated for the new dialogue and saves you some space on your hard drive.\r\n\r\n\r\n[center][IMG]http://i.imgur.com/QQznh.png[/IMG][/center]\r\n\r\nFirst, disable the workstation rentals.\r\n\r\nSecond: exit the area you are in and re-enter to force any affected workbenches to reset themselves. After this, the mod is safe to uninstall.\r\n\r\nIt is recommended you save your game somewhere away from any merchants, and after you do uninstall the mod, wait for at least two game days so that their inventories will be restocked with the vanilla items. You don’t absolutely have to do this, but the mod\\'s changes to the merchant stocks will persist until they restock again if you uninstall.\r\n\r\nWrye Bash users: Very easy, just navigate to the package in your installers tab and choose Uninstall.\r\n\r\nNexus Mod Manager: Again, very easy. Just deactivate the mod.\r\n\r\nIf you use none of the above: Simply follow the steps for Steam Workshop minus the need to unsubscribe.\r\n\r\n\r\n[center][IMG]http://i.imgur.com/VobNW.png[/IMG][/center]\r\nNew Game: Due to the need to avoid causing problems with the game start sequence at Helgen (and in general), and also to avoid interruptions, the mod will not start up at all until you have completed the intro sequence up to the point where your bindings are cut (shortly after you enter the Keep in Helgen). Or, if you are using an alternate start mod like Live Another Life, when you exit the starting cell. Once either of these conditions are fulfilled, the menu item (a gold coin labeled +Skyrim Econ Options+) will be given to you and a message will appear letting you know that it is now safe to start the mod.\r\n\r\nPre-existing game:The message stating the mod is safe to start will appear about a second after you have loaded up the game.\r\n\r\nOnce you have been notified that Economics of Skyrim is ready for your input, you can call for the initial load whenever you wish through the menu coin. Once you do, the mod will begin loading up the initial data it needs for its full functionality. When it is done, you will be notified if you wish to enable the Regional Values feature now or leave it disabled. If you choose to leave it off, you may turn it on in the menus whenever you wish.\r\n\r\nThe available options for you in the menus are:\r\n\r\nExtra Gold: This is where you choose how much extra gold you want your merchants to have. Each of the button prompts will do exactly as described above in the Features section.\r\n\r\nRegional Values: Options for configuring the Regional Values scripts are found here. They are:\r\n\r\nEnable/Disable Regional Values: Turns the Regional Values feature on and off.\r\n\r\nNotifications: If you want, you can have the mod provide notifications when the Regional Values updates have started and ended. You can set those up here.\r\n\r\nRe-Calculate values: this tells the mod to re-run the Regional Values update script. You can use this if for some reason your item values become messed up and you want to reset them.\r\n\r\nRegion Info: For which of the nine Holds you are in, this option will provide a description of the area’s major resources and the state of the local economy. Or, if you are not in any of the nine Holds, you will be notified.\r\n\r\nMerchant Difficulty: This sub-menu allows you to tailor the haggling difficulty of the game to your personal desires. There are five pre-sets available: Very Easy (Vanilla), Easy, Moderate (Default), Hard, and Inconceivable! (use the latter at your own risk). If none of those pre-sets do it for you, then select the “Custom” option and you can tailor the difficulty to your liking. This will change the values of two Game Settings: “fBarterMax” and “fBarterMin.” Increasing the numbers makes items more expensive and decreasing them makes items cheaper (and vice versa). The greater the gap between the two numbers, the more the prices will fluctuate as your Speech skill increases. You may manipulate the variables in increments of 0.5 only (only minor adjustments are permitted because getting wild with these settings can have significant effects on item prices).\r\n\r\nOther: Any options that currently do not fall into the above categories. Currently only contains the option to enable or disable the workbench ownership scripts.\r\n\r\n\r\n[center][IMG]http://i.imgur.com/dqKHD.png[/IMG][/center]\r\n\r\nCompatibility issues regarding merchant inventory control have been resolved. This mod now provides merchants their inventories without getting in the way of other mods who want to add their own items to the merchants. Those doing so by adding them directly to the container will be fully compatible. Mods that choose to add items to the merchants via leveled lists can be made compatible by using Wrye Bash\\'s Bashed Patch to merge your leveled lists together (this mod is already tagged, you just need to check its checkbox in the Bashed Patch menu).\r\n\r\nIf anyone was using a previous compatibility patch, please deactivate and remove them, as they are no longer needed.\r\n\r\nIf you have any further incompatibilities in your game, please report them. There is no guarantee that I will address them, but if it is well-requested, I very much might.\r\n\r\n[b][color=red]Current list of incompatible mods (do not use):[/color][/b]\r\n         [b]Cutthroat Merchants (All plugins):[/b] This mod already allows you to adjust merchant barter difficulty to a much greater degree than Cutthroat Merchants, there is no reason at all for you to use these two together.\r\n\r\n\r\n\r\n[center][IMG]http://i.imgur.com/DBAyb.png[/IMG][/center]\r\nRegional Values does not change the values of pre-enchanted items. This is because their value information is separate from the base item\\'s value information, and including them in Regional Values is hopelessly impractical (the scripts would take way too long to run).\r\n\r\nThough intended, Food values are not affected by Regional Values. This is because the gold values for potions (which is what Food items are) is implemented differently to the other items, and the function being used is currently incompatible with this method. This issue is SKSE related, so nothing I can do about it.\r\n\r\nEquipment orders are not affected by the haggling equation. This is due to limitations of the game engine and Papyrus making it impossible to do so. They tend to be cheaper than buying from generic stock, but since you need to wait for the orders to be completed, it balances itself out.\r\n\r\n\r\n[center][IMG]http://i.imgur.com/ZgaqC.png[/IMG][/center]\r\n- You are free to alter, expand on, or destroy this mod in any way you see fit. If you wish to share your work, however, you MUST contact me and obtain my explicit permission before doing so. Any instances of severe mod destruction will not be eligible for technical support until restored to a functional state.\r\n\r\n- Any works that are found to be in breach of the above, the author will receive a single polite request from me to remove it from wherever it is being hosted (from all sites it is being hosted on). Failure to respond within 48 hours will result in more direct action being taken.\r\n\r\n- DO NOT upload this mod to any site other than those I have personally uploaded it to without my express permission given. Any user or site found in violation of this will be considered to be stealing intellectual property and will be treated as such. Just because this mod is free does not mean that gives you free reign over what you can do with it. My work, my rules.\r\n\r\n- If I fail to respond to your requests to expand or alter this mod within 30 days, you may consider yourself as having my approval to do as you wish, but please note that upload location restrictions still stand.\r\n\r\n- Translators: please simply PM me if you wish to translate this mod. If you wish to upload the translated version to one of my current mirrors, you may consider my answer to be “yes” outright. If you wish to upload elsewhere, though, you must obtain my permission to do so. All I wish to know is that the mod is being translated, and anyone who wishes to do so has my approval.\r\n",
  "categoryId": "69",
  "version": "1.4.1",
  "author": "Thomas Kaira",
  "createdUnix": "1330732360",
  "updatedUnix": "1355779090",
  "containsAdultContent": false,
  "uploadedBy": "Thomas Kaira",
  "primaryFile": null,
  "files": [
    {
      "fileId": "105786",
      "name": "Economics of Skyrim - Dawnguard Addon",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7",
      "fileName": "Economics of Skyrim - Dawnguard Addon-11919-1-0.7z",
      "uploadedUnix": "1355764424",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/46ac432cfa6b9f9847dd699e21b17af2494be544fb0d8169516076496e7fade0/analysis/1407309068/",
      "changelogHtml": " Merchants are now selling enchanted items again. Enchanted versions of items are only available in cities where those items are readily available. <br/> \n Spell merchants have been overhauled. Only apprentice spells are available outside the College of Winterhold now, and each spell vendor only sells tomes for his Magic School specialty. They do, however, stock more scrolls and staffs now. <br/> \n Regional Values system has been completely redesigned from the ground up. It is now accomplished purely through scripting, meaning most major issues with the item hot-swap method used previously are no longer a problem. <br/> \n Extra Merchant Gold can now be tailored to your liking. There are five settings for you to choose from, each offering progressively larger amounts of extra gold. <br/> \n Innkeepers will no longer be selling items they aren’t supposed to. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Economics%20of%20Skyrim%20-%20Dawnguard%20Addon-11919-1-0.7z?fid=105786&ttl=1535773413&ri=8192&rs=8192&setec=44452b1788239e1b30811636e7120dae"
    },
    {
      "fileId": "105824",
      "name": "Economics of Skyrim v1-4-1",
      "version": "1.4.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "182",
      "fileName": "Economics of Skyrim v1-4-1-11919-1-4-1.7z",
      "uploadedUnix": "1355778973",
      "modVersion": "1.4.1",
      "virusScanUrl": "https://www.virustotal.com/file/d459da083eb4d4b4c0b23ff1365bf6540768331626f977c8277adf204214053d/analysis/1407309317/",
      "changelogHtml": " Fixed Bug: Arcadia and Farengar Secret-Fire were not linked to their respective workbenches correctly. <br/> \n Fixed Bug: Removed workstation rental dialogue from a couple actors who had no reason to offer it. <br/> \n Fixed Bug: Arcadia and Zaria will no longer offer the Alchemy tutorial quest to avoid a soft-conflict. It is now exclusive to Orgnar in Riverwood. Fix is not retroactive. <br/> \n Fixed Bug: Adrianne Avenicci will no longer offer the Smithing tutorial to avoid a soft-conflict. It is now exclusive to Alvor in Riverwood. Fix is not retroactive. <br/> \n Feature Change: Allowed possibility to disable workstation rentals. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Economics%20of%20Skyrim%20v1-4-1-11919-1-4-1.7z?fid=105824&ttl=1535773413&ri=8192&rs=8192&setec=e28cb51c8be66b364876c691a0812a8c"
    },
    {
      "fileId": "105825",
      "name": "Economics of Skyrim v1-4-1 No Silent Voice",
      "version": "1.4.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "163",
      "fileName": "Economics of Skyrim v1-4-1 No Silent Voice-11919-1-4-1.7z",
      "uploadedUnix": "1355779000",
      "modVersion": "1.4.1",
      "virusScanUrl": "https://www.virustotal.com/file/3646ba8b38b2337849a6d52ef0f6201962b703897e7971695b226274a242f44e/analysis/1407309318/",
      "changelogHtml": " Fixed Bug: Arcadia and Farengar Secret-Fire were not linked to their respective workbenches correctly. <br/> \n Fixed Bug: Removed workstation rental dialogue from a couple actors who had no reason to offer it. <br/> \n Fixed Bug: Arcadia and Zaria will no longer offer the Alchemy tutorial quest to avoid a soft-conflict. It is now exclusive to Orgnar in Riverwood. Fix is not retroactive. <br/> \n Fixed Bug: Adrianne Avenicci will no longer offer the Smithing tutorial to avoid a soft-conflict. It is now exclusive to Alvor in Riverwood. Fix is not retroactive. <br/> \n Feature Change: Allowed possibility to disable workstation rentals. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Economics%20of%20Skyrim%20v1-4-1%20No%20Silent%20Voice-11919-1-4-1.7z?fid=105825&ttl=1535773413&ri=8192&rs=8192&setec=0bb90fa7e537b26bdd1e4b8d0f3e2a59"
    },
    {
      "fileId": "105826",
      "name": "Economics of Skyrim v1-4-1 Script Resource",
      "version": "1.4.1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "45",
      "fileName": "Economics of Skyrim v1-4-1 Script Resource-11919-1-4-1.7z",
      "uploadedUnix": "1355779090",
      "modVersion": "1.4.1",
      "virusScanUrl": "https://www.virustotal.com/file/1473cdc3d8e4e739dc55b4201f9154380355ee10eee5bd1da6d8590d63d1aa95/analysis/1407309363/",
      "changelogHtml": " Fixed Bug: Arcadia and Farengar Secret-Fire were not linked to their respective workbenches correctly. <br/> \n Fixed Bug: Removed workstation rental dialogue from a couple actors who had no reason to offer it. <br/> \n Fixed Bug: Arcadia and Zaria will no longer offer the Alchemy tutorial quest to avoid a soft-conflict. It is now exclusive to Orgnar in Riverwood. Fix is not retroactive. <br/> \n Fixed Bug: Adrianne Avenicci will no longer offer the Smithing tutorial to avoid a soft-conflict. It is now exclusive to Alvor in Riverwood. Fix is not retroactive. <br/> \n Feature Change: Allowed possibility to disable workstation rentals. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Economics%20of%20Skyrim%20v1-4-1%20Script%20Resource-11919-1-4-1.7z?fid=105826&ttl=1535773414&ri=8192&rs=8192&setec=53c3b80bb6c30724dc3add3bf42dcdbb"
    }
  ]
}