{
  "modId": 11928.0,
  "modName": "Imperial Legion Armour Uniformity",
  "summary": "Adds extra armour to most Imperial Legion soldiers, so thay\\'re no longer so much of a leather gang.\r\nUnlocks several rarely-used armor pieces, making them easier to find and loot.",
  "descriptionHtml": "Now updated to 1.2 ! See changelog by clicking the blue number 1.2 above\r\n---------------------------------------------------------------------------------------- \r\n\r\nThe Emperor has stepped up funding for the Skyrim campaign. Finally the legion\\'s northern presence can getsome additonal equipment!\r\n\r\nPlease leave an endorsement if you like it <3\r\n\r\nThis mod adds some much needed armour to the rather poor-looking Imperial Legion soldiers. The new armour pieces were already in the game, but were getting little or no use, and were exceeedingly rare to find ingame. All i\\'ve done is unlock these objects and put them to a use in outfitting the legion. The changes made are as follows:\r\n\r\n-All light imperial troopers gain studded armour, and a Light Imperial Shield,  archers won\\'t make much use of it, but anyone who\\'s into hackyslashy attacks will generally have their shield out when they get up in your face.\r\n\r\n-The legionnaires who wore the Studded imperial armour, have been reclassified as medium troops. Their armour has been replaced with a new, more fitting suit (see images), these soldiers also gain a standard issue Steel Imperial Helmet, a Heavy Imperial Shield, plus heavy gauntlets and boots. In general they actually look like professional soldiers now, and are a force to be reckoned with.\r\n\r\n-The officers of the legion have all been given a heavy shield too, and in addition have recieved a headgear upgrade. Now all imperial officers wear the centurion-styled Imperial Corinthian Helm. This replaces the normal Imperial Officer Helm entirely (it kind of sucked) and is even given to officers who previously didn\\'t wear a helm. \r\n\r\n-Two exceptions to the above are Legate Rikke, who only gets the shield (no helm) and General Tullius, who gets upgrades to shield, boots and gauntlets (but no helm either). As these two are prominent figures in the legion, it\\'s important for them to have visible faces, for identification and morale of the troops.\r\n\r\nThis mod is compatible with Cloaks of Skyrim. If you want to use the two of them together, just use the normal esp from that mod (NOT the \\\"no imperials\\\" version) and you\\'ll see soldiers appearing with capes and new armour all over the place, it\\'s wonderful ^^\r\n\r\nIMPORTANT!\r\nIt\\'s quite likely that you won\\'t see the effects of this right away. In areas you\\'ve already been to, the equipment of soldiers won\\'t immediately update until the gameworld refreshes. I think this happens roughly every 3-4 ingame weeks.  You could sleep in a bed for a few weeks straight. or you could just wait for it to happen naturally, and imagine it\\'s a gradual upgrade.\r\n\r\nIf you urgently want to see a soldier with new armour, open the console with `, click on the target, and type resurrect. This will force them to reload with proper equipment. You can do this manually to update any soldier you see.\r\n\r\n\r\nmade in 2012",
  "categoryId": "78",
  "version": "1.2",
  "author": "NanakoMagojiro",
  "createdUnix": "1330736039",
  "updatedUnix": "1332965340",
  "containsAdultContent": false,
  "uploadedBy": "NanakoMagojiro",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39392",
      "name": "Legion Requisition old",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Legion Requisition old-11928.zip",
      "uploadedUnix": "1330736399",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/217ea7bba6952f55ae13553a94ca9c99f7f15d89e34767f3887a6c0613e673f5/analysis/1406726231/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legion%20Requisition%20old-11928.zip?fid=39392&ttl=1535773427&ri=8192&rs=8192&setec=1c45e8dedd20cd24a9ddad6462a3a8df"
    },
    {
      "fileId": "40957",
      "name": "Legion Requisition second release",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1079",
      "fileName": "Legion Requisition second release-11928.zip",
      "uploadedUnix": "1331101582",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2bdaad7d3da40c6ad1d078077ee269c74aa366b807e39ab688b81cc0c178c7e2/analysis/1406735775/",
      "changelogHtml": " -added \\\"Imperial Legion Armour\\\", for medium troops. Retextured from general tullius\\' armour.  -Altered armour values of imperia <br/> \n -Made medium troops more common. They now form 66% of random imperial spawns (previously 50 %) <br/> \n -Altered armour values of imperial armour a bit. Heavy armour is now equivilant to steel armour. the light leather stuff is weakened slightly. New armour is between studded and heavy, in armor rating. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legion%20Requisition%20second%20release-11928.zip?fid=40957&ttl=1535773428&ri=8192&rs=8192&setec=8792015fb3c1a5d71523c23ecbd9c4a1"
    },
    {
      "fileId": "47746",
      "name": "Legion Requisition",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1006",
      "fileName": "Legion Requisition-11928-1-2.rar",
      "uploadedUnix": "1332965340",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/4572a9946f0690ebb1a54d6be79c7d32b07e9451fc47954328956b1c4aab84e1/analysis/1406784847/",
      "changelogHtml": " Changed Imperial Medium Armor from using Light Armor skill, to Heavy Armor skill. bringing it in line with the rest of the uniform <br/> \n Increased Armor rating of Heavy Imperial Armor from 32 to 34 (same as dwarven Armor) <br/> \n Increased Armor rating of Medium Imperial Armor from 28 to 31 (same as steel Armor) <br/> \n Increased Armor rating of Heavy Imperial Shield from 20 to 26 (same as dwarven shield) <br/> \n Increased Armor rating of Imperial Boots and Imperial Gauntlets from 10 to 12, to match the steel boots/gauntlets which look identical but had slightly higher stats (this is a bugfix imo) <br/> \n Altered a few names of Armors and shields, to be more informative, and to sort better alphabetically. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legion%20Requisition-11928-1-2.rar?fid=47746&ttl=1535773428&ri=8192&rs=8192&setec=da4c480ca3293bb1ec3d2a10df849266"
    }
  ]
}