{
  "modId": 11944.0,
  "modName": "Riverwood Repose and Mine",
  "summary": "Adds a quaint player home & mine just west of Riverwood.  Features a MINI-QUEST to obtain the keys and deed to the property, so you feel you&#39;ve properly earned it. Hire miners too&#33; A covered bridge takes you to your new home as if it always belonged in Skyrim.  The house & mine contain typical display plaque, mannequin & crafting options\u0003",
  "descriptionHtml": "[size=3]\r<br />[b]Welcome to Riverwood Repose and Mine&#33;[/b]\r<br />\r<br />My goal was to create a simple player home in a beautiful central location where I could store and display my loot.  A second goal was to maintain the immersive feel of the game, having the house blend in to the world of Skyrim as if I weren&#39;t playing a mod but something the developers might have included themselves.  To that end, you can&#39;t simply walk in and take the house... you need to earn it&#33;  A small quest is included to ensure you feel proper satisfaction in acquiring the house.  You can also hire miners to mine ore for you&#33;\r<br />\r<br />The house itself is quaint and has a number of weapon plaques, a trophy room in the basement, complete with display cases and mannequins.  Enchanting and alchemy stations are located in the basement as well.  A number of chests and barrels can be found around the house.  All interior chests are marked to NOT respawn and should be safe.  Exterior barrels are NOT safe and will respawn. The mine also features weapon and armor crafting stations with additional display and storage options. If you hire the miners, the ore chest will respawn and is not safe.\r<br />\r<br />To enjoy Riverwood Repose and mine, complete the mini-quest given by the courier.  Once the mod is installed, a courier will approach you with a note providing the back story and the quest is on to &#34;Retake Riverwood Repose&#34;&#33;\r<br />[/size]\r<br />\r<br />[center]Thanks to Ownallday for featuring Riverwood Repose and Mine&#33;  The mod review starts at 8:50 in the video...\r<br />\r<br />[youtube]KqaZJu55Kck[/youtube][/center]\r<br />\r<br />[color=yellow][size=4]NEW INSTALL:[/size][/color]\r<br />Welcome and thank you for trying this mod&#33;  It has been a fun journey and learning opportunity putting this mod together (my first one&#33;). \r<br />\r<br />1. To install for the 1st time, use the NMM (Nexus Mod Manager) to download and activate [b](recommended)[/b]\r<br />2. Or download manually; Extract the contents from the RiverwoodRepose.7z archive file to your data folder &gt; activate\r<br />3. The quest will begin after you walk into a habitable area such as Riverwood or Whiterun\r<br />4. Please read the KNOWN ISSUES - TIPS section below before starting the quest\r<br />5. Enjoy&#33;\r<br />\r<br />[color=yellow]REVISION HISTORY:[/color]\r<br />3.6 MINOR FIXES\r<br />- Added a wood chopping block behind house\r<br />- Added a few torches in mine crafting area\r<br />- Fixed mesh issue with mine ceiling\r<br />- Fixed center barrel by smelter to non-respawn (empty it before upgrading)\r<br />\r<br />See full revision history by clicking on the &#34;Latest Version&#34; link above\r<br />\r<br />[color=cyan]*** UPDATE NOTES FOR UPGRADING TO 3.6 ***[/color]\r<br />[color=yellow]UPGRADING FROM 3.1 OR HIGHER[/color]\r<br />1. As a best practice, create a save game somewhere indoors other than the house or mine\r<br />2. Use the nexus mod manager to download and activate [b](recommended)[/b]\r<br />         or\r<br />2.1 Download manually; Extract the contents from the RiverwoodRepose.7z archive file to your data folder &gt; activate\r<br />3. Please read the KNOWN ISSUES - TIPS section below for any special notes\r<br />\r<br />That simple... enjoy&#33;\r<br />\r<br />ALL PRIOR VERSIONS EARLIER THAN 3.1 (1.0 - 3.0)\r<br />Due to significant changes and fixes, if you&#39;re still running an earlier version, I would recommend following the CLEAN UPDATE and INSTALL instructions below.  Or, if you&#39;d like additional options, click the README link above.\r<br />\r<br />[color=yellow]CLEAN UPDATE and INSTALL[/color]\r<br />If you have any issues with upgrading, follow these instructions to perform a clean install to ensure you don&#39;t lose any loot.\r<br />\r<br />1. Take all your loot out of the house and mine\r<br />2. Go to another indoor location (such as the Riverwood Trader)\r<br />3. Create a save game at that location and exit Skyrim\r<br />4. Deactivate the mod\r<br />5. Back in Skyrim load the save game just created (ignore the warnings about missing content)\r<br />6. Create another new save game and exit Skyrim\r<br />7. Delete any old copies of the mod\r<br />8. Download and activate/install (per above New Install steps) the latest version\r<br />9. Load your last save game and enjoy&#33;\r<br />\r<br />[color=yellow]CONFLICTS:[/color]\r<br />None that I&#39;m aware of other than some of the Riverwood house mods which use the same exterior world space.\r<br />\r<br />[color=yellow]KNOWN ISSUES - TIPS:[/color]\r<br />1. If the courier doesn&#39;t show when you enter habitable location, it could be a few things;\r<br />a) Somtimes fast traveling into an area won&#39;t trigger the courier\r<br />b) Some quests (like the Helgen startup quest) need to complete to a certain point before the courier will trigger\r<br />c) Recommend walking into Riverwood and then enter Riverwood Trader, wait a moment and then walk back out.  That should trigger it (with possible expection from note &#39;b&#39; )\r<br />\r<br />2. After you find the mine key the quest marker MAY point to the house door instead of the mine door.  Ignore and proceed north of the house to the mine entrance. (May be an issue if your updating from an older revision and have already entered the house)\r<br />\r<br />3. If upgrading from 3.1 or 3.2 to 3.3 or later, since you&#39;ve already finished the quest.  Find U&#39;Dain in Riverwood Trader and purchase the &#34;Mining Contract&#34; to hire the miners.  Read the contract for details.\r<br />\r<br />4. Staves don&#39;t work in the display cases.  I&#39;ve no clue lol.\r<br />\r<br />5. Based on feedback in the forums, it would appear Bethesda introduced a bug with the courier in patch 1.6.  This seems to impact mods who use the default courier quest, such as this one, as well as possible default quests.  After a bit of sleuthing, one workaround would be to perform the following;\r<br />\r<br />a) After you&#39;ve installed this mod and are approached by the courier, fast travel someplace far from the courier.  Then return.  The 2nd time the courier approaches you, he should give you the letter.  I&#39;ve tried this a few times with this mod and that seems to work for now.  If Bethesda doesn&#39;t fix this with a future patch, I may go through the trouble of creating my own courier.\r<br />\r<br />[color=yellow]UNINSTALL[/color]\r<br />1. Simply deactivate the mod in NMM\r<br />         or \r<br />2. If you installed the mod manually;\r<br />\r<br />For 3.1 version and earlier\r<br />- Manually deactivate the mod\r<br />- Delete RiverwoodRepose.esp from your Data folder\r<br />- Delete any files from DataScripts and DataScriptsSource which contain &#34;RWRMQ01&#34; in the file name (there should be 8 files)\r<br />\r<br />For 3.2 version or later\r<br />- Manually deactivate the mod\r<br />- Delete RiverwoodRepose.esp and RiverwoodRepose.bsa from your Data folder",
  "categoryId": "67",
  "version": "3.6",
  "author": "szewski",
  "createdUnix": "1330752047",
  "updatedUnix": "1346030792",
  "containsAdultContent": false,
  "uploadedBy": "szewski",
  "primaryFile": null,
  "files": [
    {
      "fileId": "53000",
      "name": "Riverwood Repose and Mine 3_5",
      "version": "3.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "225",
      "fileName": "Riverwood Repose and Mine 3_5-11944.7z",
      "uploadedUnix": "1334361493",
      "modVersion": "3.5",
      "virusScanUrl": "https://www.virustotal.com/file/57099711db71d3bbcb5a68047e76181581655b9a517ac82c719bf9afb5fc3606/analysis/1406814245/",
      "changelogHtml": " Fixed broken animation on corundum ore pile <br/> \n Fixed mesh issue with exterior stone wall <br/> \n Added a weapon rack for the knotched pickaxe in crafting area <br/> \n Added 2 additional mannequins in mine display area <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riverwood%20Repose%20and%20Mine%203_5-11944.7z?fid=53000&ttl=1535773460&ri=8192&rs=8192&setec=f98ae15235921ccd8cd9c746ea5852a6"
    },
    {
      "fileId": "53002",
      "name": "Riverwood Repose and Mine 3_5 - Brighter Lights",
      "version": "3.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "225",
      "fileName": "Riverwood Repose and Mine 3_5 - Brighter Lights-11944-3-5.7z",
      "uploadedUnix": "1334361596",
      "modVersion": "3.5",
      "virusScanUrl": "https://www.virustotal.com/file/1dbee804e5ac6a7dff01dbc9f525d6436e4d3919349e934c909d70c6682e92c3/analysis/1406814246/",
      "changelogHtml": " Fixed broken animation on corundum ore pile <br/> \n Fixed mesh issue with exterior stone wall <br/> \n Added a weapon rack for the knotched pickaxe in crafting area <br/> \n Added 2 additional mannequins in mine display area <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riverwood%20Repose%20and%20Mine%203_5%20-%20Brighter%20Lights-11944-3-5.7z?fid=53002&ttl=1535773461&ri=8192&rs=8192&setec=e0a38f886bfd6d13bf427d2a9b36f509"
    },
    {
      "fileId": "84515",
      "name": "Riverwood Repose and Mine 3_6",
      "version": "3.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "225",
      "fileName": "Riverwood Repose and Mine 3_6-11944-3-6.7z",
      "uploadedUnix": "1346030792",
      "modVersion": "3.6",
      "virusScanUrl": "https://www.virustotal.com/file/edcbc10a0ee90efab5b569115e48d7e350ab2e66695ea0bcf78db40ca063122d/analysis/1407124804/",
      "changelogHtml": " Added wood chopping block behind the house <br/> \n Added a few torches in the mine crafting area to improve lighting <br/> \n Fixed mesh issue with mine ceiling <br/> \n Fixed center barrel near smelter to non-respawn (empty prior to upgrading) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riverwood%20Repose%20and%20Mine%203_6-11944-3-6.7z?fid=84515&ttl=1535773461&ri=8192&rs=8192&setec=1ebf2147e563267ac5a4f45d6ea49a25"
    }
  ]
}