{
  "modId": 11941.0,
  "modName": "ABT - Arrows and Bolts Tweaks",
  "summary": "Lots of options for arrows and bolts in one handy NMM installer, pick and install only the tweaks you want!",
  "descriptionHtml": "[center] \n<br />[size=4][color=#ff7700]&gt; [/color][/size][size=4][url=http://www.nexusmods.com/skyrimspecialedition/mods/4683]SPECIAL EDITION AVAILABLE HERE[/url][/size][size=4][color=#ff7700] &lt;[/color][/size]\n<br />\n<br />\n<br />[img]https://c1.staticflickr.com/9/8307/7762716856_da65659229_o.jpg[/img] [/center]\n<br />\n<br />[center] [url=http://skyrim.nexusmods.com/mods/24822][img]http://farm9.staticflickr.com/8251/8515180571_1222c466bc_o.gif[/img][/url] [url=http://forum.scharesoft.de/showthread.php?47528-Jeden-Tag-eine-%DCbersetzung][img]http://farm9.staticflickr.com/8372/8515610363_1235a980ab_o.jpg[/img][/url] [url=http://skyrim.nexusmods.com/mods/27057][img]http://farm9.staticflickr.com/8526/8515180591_04f34a0a73_o.gif[/img][/url] [url=http://skyrim.nexusmods.com/mods/47445][img]https://lh5.googleusercontent.com/-OxyPBhGTbwY/Uow-H81db3I/AAAAAAAABpM/HJXuSDb3f4U/s30/Poland%2520Flag.jpg][/img][/url] [url=http://www.nexusmods.com/skyrim/mods/62244][img]http://farm8.staticflickr.com/7387/9600881461_30855a8813_o.jpg[/img][/url] [url=http://skyrim.nexusmods.com/mods/37269][img]http://farm9.staticflickr.com/8228/8515180619_9f39b5588f_o.jpg[/img][/url] [/center]\n<br />\n<br />[center] [size=4] [color=red]IMPORTANT:[/color] If you use 'Better Sorting' or 'Complete Crafting Overhaul' mods by Headbomb, switch to [url=http://skyrim.nexusmods.com/mods/26230]Sharlikrans Compatibility Patches[/url] versions of them, they fix a few problems with those mods and diminish/eliminate CTDs.[/size] [/center]\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8192/8084444563_4b5849e08c_o.jpg[/img] [/center]\n<br />I really like playing as an archer, but I wasn't satisfied with some aspects regarding arrows. Some mods here on the nexus helped improve what I wanted, but I still wasn't fully satisfied and I always ended up tweaking them, changing them completely, or even making my own mods to change other aspects of the game involving arrows. So I decided to make this mod to compile all my tweaks. After Dawnguard came out, crossbow bolts were added to Skyrim, and I felt the need to change them as well, although it's not required to have that add-on installed to use this mod.\n<br />\n<br />You can install only the tweaks you want (or all of them!) using the NMM installer. I also added support versions for [url=http://skyrim.nexusmods.com/mods/26230]Better Sorting[/url] and/or [url=http://skyrim.nexusmods.com/mods/26230]Complete Crafting Overhaul[/url] mods (use Sharlikrans' updated versions) since I use both of them, but you can still choose a vanilla version if you prefer (though I encourage you to try them).\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8513/8457764231_87b4040255_o.jpg[/img][/center]\n<br />[center] [img]http://farm9.staticflickr.com/8046/8084441360_7986cfa1f2_o.jpg[/img] [/center]\n<br />These are the tweaks currently available, I may add more in the future:\n<br />\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8436/7875433430_636fc3a2f6_c.jpg[/img] [/center]\n<br />\n<br />I was using FordPerfect's mod [url=http://www.nexusmods.com/skyrim/mods/1009]Faster Arrows[/url], but since he allowed permission to modify and/or improve his mod, I decided to finally add support for Bound Arrows and Practice Arrows, which is something that was bothering me for a long time (that mod left out those two arrow types, so they didn't fly as fast as the rest). I also corrected some arrow's collision problems in that mod. Basically this tweak makes arrows fly faster and further. It also decreases gravity pull on them around 50% (the actual decrease is %57.14, based on FordPerfect's mod). Multiple versions to choose from:\n<br />\n<br />[list]\n<br />[*]+10% faster\n<br />[*]+25% faster\n<br />[*]+50% faster\n<br />[*]+75% faster\n<br />[*]+100% faster!\n<br />[/list]\n<br />[color=red]Riekling Spears:[/color] Note that Riekling Spears' gravity was halved and its range was doubled, to keep that 'heavy feeling' spears have. Their speed was still increased to match the rest of the arrows, so watch out, they'll be harder to dodge! &gt;:)\n<br />\n<br />As FordPerfect's suggested, I also recommend adding these lines to your [color=#458B00]Skyrim.ini[/color] file, they work great (I added a couple of entries too). If you are not sure how to edit the file check the video tab, Gopher was kind enough to explain how to do it. You need to add these lines to your Skyrim.ini file, located in your /Documents/My Games/Skyrim/ directory (backup Skyrim.ini before editing!!!):\n<br />\n<br />[color=#66CCCC] [Actor] [/color]\n<br />[color=#66CCCC] fVisibleNavmeshMoveDist=12288.0000 [/color]\n<br />[color=#66CCCC] [Combat] [/color]\n<br />[color=#66CCCC] fMagnetismStrafeHeadingMult=0.0 [/color]\n<br />[color=#66CCCC] fMagnetismLookingMult=0.0 [/color]\n<br />[color=#66CCCC] f1PArrowTiltUpAngle=0.7 [/color]\n<br />[color=#66CCCC] f3PArrowTiltUpAngle=0.7 [/color]\n<br />\n<br />The line below Actor ([color=#66CCCC]fVisibleNavmeshMoveDist[/color]) increases the distance arrows fly, which allows you to hit targets from longer distances, rather than arrows passing through them without causing any damage.\n<br />\n<br />The first two lines below Combat ([color=#66CCCC]fMagnetism[/color]) remove the aim assist. If you miss slightly with an arrow, the game will automatically make them hit anyway. This stops that, so it basically makes it a little harder (most noticeable at long range).\n<br />\n<br />The last two lines below Combat ([color=#66CCCC]ArrowTiltUpAngle[/color]) make the dot or crosshair the centre (rather than being slightly above it), so your arrows will go where you actually aim (keep in mind that gravity still affects arrows, so you'll still have to compensate when aiming really far). Note that these two lines only affect vertical axis behavior (up/down), sadly there is no tweak for horizontal axis corrections (left/right). The f1 line is for first person, the f3 line is for third person. If you use any mods that changes or modifies auto-aim or crosshair behavior you may have to use different values (you'll probably have to increase third person value from 0.7 to 2.2, or even 3.2, experiment with other numbers if that doesn't work).\n<br />\n<br />Note: If you don't have an [color=#66CCCC][Actor][/color] and/or [color=#66CCCC][Combat][/color] section in your Skirim.ini file already, just add them (after [General] section for example).\n<br />\n<br />[u]Update:[/u]\n<br />If you have edited your [color=#458B00]Skyrim.ini[/color] file and the TiltUpAngle value of 0.7 is not working for you very well, try these:\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8281/7763449292_45c3645350_b.jpg[/img] [/center]\n<br />\n<br />If you [b]still[/b] can't get arrows to go to the center of the crosshair, check the 'Recommended/Compatible mods' section at the end of the description, and look for the Proper Aiming mod.\n<br />[line]\n<br />\n<br />[center] [img]http://farm8.staticflickr.com/7117/7875453028_34e11fb296_c.jpg[/img] [/center]\n<br />\n<br />Just like the previous tweak, Faster Bolts Improved increases bolts speed in the same manner, making them fly faster, and further too. If you don't have Dawnguard installed don't worry, the installer will let you choose a version compatible with your game without DLC. Versions available:\n<br />\n<br />[list]\n<br />[*]+10% faster\n<br />[*]+25% faster\n<br />[*]+50% faster\n<br />[*]+75% faster\n<br />[*]+100% faster!\n<br />[/list] \n<br />Just like before, I recommend adding these lines to your [color=#458B00]Skyrim.ini[/color] file:\n<br />\n<br />[color=#66CCCC] f1PBoltTiltUpAngle=0.7 [/color]\n<br />[color=#66CCCC] f3PBoltTiltUpAngle=0.7 [/color]\n<br />\n<br />[u]Update:[/u]\n<br />If you have edited your [color=#458B00]Skyrim.ini[/color] file and the TiltUpAngle value of 0.7 is not working for you very well, try these:\n<br />\n<br />[center] [img]http://farm8.staticflickr.com/7131/7763601668_155b8cf427_b.jpg[/img] [/center]\n<br />\n<br />If you [b]still[/b] can't get bolts to go to the center of the crosshair, check the 'Recommended/Compatible mods' section at the end of the description, and look for the Proper Aiming mod. I don't know if will help with bolts (it seems to only affect arrows) but it can't hurt to try (or even ask the author for bolts support).\n<br />\n<br />So, if you've installed both Faster tweaks and added the lines to your [color=#458B00]Skyrim.ini[/color] file, it should look like this:\n<br />\n<br />[color=#66CCCC] [Actor] [/color]\n<br />[color=#66CCCC] fVisibleNavmeshMoveDist=12288.0000 [/color]\n<br />[color=#66CCCC] [Combat] [/color]\n<br />[color=#66CCCC] fMagnetismStrafeHeadingMult=0.0 [/color]\n<br />[color=#66CCCC] fMagnetismLookingMult=0.0 [/color]\n<br />[color=#66CCCC] f1PArrowTiltUpAngle=0.7 [/color]\n<br />[color=#66CCCC] f3PArrowTiltUpAngle=0.7 [/color]\n<br />[color=#66CCCC] f1PBoltTiltUpAngle=0.7 [/color]\n<br />[color=#66CCCC] f3PBoltTiltUpAngle=0.7 [/color]\n<br />\n<br />Remember: If you don't have an [color=#66CCCC][Actor][/color] and/or [color=#66CCCC][Combat][/color] section in your [color=#458B00]Skyrim.ini[/color] file already, just add them (after [General] section for example).\n<br />[line]\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8439/7875448342_dc2477fc4f_c.jpg[/img] [/center]\n<br />\n<br />It always bothered me that some arrows have the same base damage value, so what's the point on using an Ancient Nord Arrow instead of a Steel Arrow if both do the same damage? or even the less damaging Falmer Arrow instead of a Forsworn Arrow? Well, this mod changes that to make them have progressive damage values. Here's the new arrows progression table:\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8237/8457467282_68735df6ff_o.jpg[/img] [/center]\n<br />\n<br />Changes marked [color=red]in red[/color] indicate which arrows damages were modified to avoid having duplicate damages, with two exceptions:\n<br />\n<br />[list]\n<br />[*]Bound Arrows were paired up with Dragonborn Arrows if you have Dawnguard (see explanation below).\n<br />[*]The special elven arrows were slightly increased by the same amount.\n<br />[/list]\n<br />Versions available:\n<br />\n<br />[list]\n<br />[*]Vanilla Arrows (all of the above)\n<br />[*]Vanilla + Nord Hero Arrows (available using the [url=http://skyrim.nexusmods.com/mods/23491]Unofficial Dawnguard Patch[/url] or other mods)\n<br />[*]BS and CCO (includes Vanilla + Nord Hero Arrows + Skyforge Steel Arrows, available using Complete Crafting Overhaul mod)\n<br />[/list] [line]\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8289/7875441052_8f8a287016_c.jpg[/img] [/center]\n<br />\n<br />As of v2.4 Progressive Damage tweak includes new options for [b]Increased[/b] damage values. Here's the same arrows progression table but with 100% damage increase:\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8523/8456391525_4e896bbc6f_o.jpg[/img] [/center]\n<br />\n<br />I decided to pair Bound Arrows with Dragonbone Arrows (if you have Dawnguard, otherwise they will be paired up with Daedric Arrows) to provide some sort of 'balance' between pure archers and pure mages, I think both should be able to deal the same high-level damage values coming from different backgrounds.\n<br />\n<br />As of v3.0 bolts are supported too, here's the bolts damage table with 100% damage increase:\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8521/8457501036_0a8cb7138e_o.jpg[/img] [/center]\n<br />\n<br />Note: exploding bolts damage effects were also increased by +100%, the new damage is shown [color=red]in red[/color].\n<br />\n<br />Three versions to choose from:\n<br />\n<br />[list]\n<br />[*]+50% Increased Dmg\n<br />[*]+100% Increased Dmg\n<br />[*]+150% Increased Dmg\n<br />[/list]Since Better Sorting and Complete Crafting Overhaul mods haven't been updated for the DLCs (and they don't seem like they'll ever be updated) I included a version that only renames bolts to 'Bolt - (Type)' without changing their damages.\n<br />[line]\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8351/8295209858_9eaaf622b0_c.jpg[/img] [/center]\n<br />\n<br />[color=red]NEW:[/color] This tweak aims to fix the impact depth of bolts in-game, and bring a little bit of realism to them. I've never aimed to make ABT a 'realistic' mod, but in this case I felt this needed to be included here, because bolts impacts' depth is plain awful in the vanilla game. Traditionaly crossbows, in comparison to bows, have always added greater speed to their ammunitions  (of course there are a few minor exceptions, but generally speaking this is true), making bolts impacts stronger at close range. However what Skyrim shows us is a whole different story when we take a closer look at a dead body, or even at a bolt stuck in a wooden door: the tip has barely penetrated and when comparing bolts and arrows side by side, the bolt comes out looking out of place. This tweak replaces bolts meshes with ones edited by [url=http://skyrim.nexusmods.com/users/3297180]Ghosu[/url] that increase the depth of their impacts, three versions to choose from:\n<br />\n<br />[list]\n<br />[*]+5 Units Deeper\n<br />[*]+8 Units Deeper\n<br />[*]+12 Units Deeper\n<br />[/list]You can see a comparison between their depth in the image above. Note that this tweak only replaces the bolts 'projectiles', you can install any mod that edits the .nif files for the bolts quiver, they are both compatible (as long as that mod doesn't try to replace the projectiles as well, in that case you'll have to choose).\n<br />[line]\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8442/7762582548_cf3f06e3f0_c.jpg[/img] [/center]\n<br />\n<br />This tweak is based on my previous 'Recover Less Arrows' mod. It basically changes the amount of arrows and bolts you recover from the one's you've shot at a target. Some people requested me to add slightly different versions, so here you go:\n<br />\n<br />[list]\n<br />[*]+10%, +25%, +35%, +50% \n<br />[*]-10%, -25%, -35%, -50%\n<br />[/list]\n<br />Thanks to [url=http://skyrim.nexusmods.com/users/3921199]Athyra[/url] recover arrows and bolts tweak now works exactly the same as before, but without modifying Game Settings or the Hunter's Discipline perk, so it should be compatible with almost everything. You'll see a confirmation message the first time you load your saved game, and that's it. If you ever need to change to a different version, just uninstall it and choose a new version, it won't leave anything installed from previous versions.\n<br />[line]\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8004/7605986486_f0f5fde82e_c.jpg[/img]  [/center]\n<br />\n<br />This tweak modifies (increases or decreases) the amount of arrows found in loot (dead bodies, chests, etc). This one is different from Recover Arrows in that it doesn't affect arrows you've shot at a target, it just changes the leveled item's lists that include arrows so that only the target's inventory is modified, as well as chests. You'll notice this make a bigger difference in-game than Recover Arrows. Keep in mind that chests usually fill themselves when the cell is loaded, so if you install this tweak and test it on a chest that was right in front of you when you saved your game, you probably won't see any differences. \n<br />\n<br />I wanted to give some flexibility to the game in this particular aspect since lots of people use mods that allow crafting arrows (me included) and if you are anything like me, then you probably like to plan ahead what resources you'll take with you when leaving town so that you don't run out of arrows (or potions for that matter). This also makes the smithing perk tree more important if you use an arrow-crafting mod and decide to use a harder version (beware of the HARDCORE version), or you can just take the opposite side and choose a version that increases availability (e.g. +100%) and forget about running out of arrows ever again (useful for those who [b]don't[/b] use arrow-crafting mods). \n<br />\n<br />Lots of versions to choose from:\n<br />\n<br />[list]\n<br />[*]+25%, +50%, +75%, +100% arrows in loot\n<br />[*]-25%, -50%, -75% arrows in loot\n<br />[*]HARDCORE version: reduces the amount of arrows found in loot (dead bodies, chests, etc) to the bare minimum. Low-level arrows (such as Iron Arrows for example) will still be found regularly in loot to some extent, but high-level arrows will be harder to find. I recommend using a mod that allows you to craft arrows (like CCO for example), and remember to retrieve those missed arrows lying on the floor!\n<br />[/list][line]\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8295/7762990990_0f307055da_c.jpg[/img] [/center]\n<br />\n<br />If Loot Arrows isn't enough for you, maybe this tweak can help. It modifies (increases or decreases) the amount of arrows sold by [url=http://www.uesp.net/wiki/Skyrim:Merchants]merchants[/url] (General traders and Blacksmiths; I didn't mess with Apothecaries, Innkeepers, Jewelers and Spell traders). If you run out of arrows and don't have the resources to craft those special high-level arrows, you can buy the supplies you need from merchants: making arrows less available will add an extra level of difficulty to your game, making arrows more available will make your life that much easier. \n<br />\n<br />Again, lots of versions to choose from:\n<br />\n<br />[list]\n<br />[*]+25%, +50%, +75%, +100% arrows sold\n<br />[*]-25%, -50%, -75% arrows sold\n<br />[*]HARDCORE version: reduces the amount of arrows sold by merchants (General traders and Blacksmiths) to the bare minimum. Low-level arrows (such as Iron Arrows for example) will still be regularly available to some extent, but high-level arrows will be less frequent. I recommend using a mod that allows you to craft arrows (like CCO for example), and remember to save those special arrows for critical situations!\n<br />[/list]\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8324/8084444477_46d8e788f0_o.jpg[/img] [/center]\n<br />Lots of people ask me what tweaks I use, given that there are so many choices. They also ask me about which ones are more 'realistic', for that read the article I wrote. These are the tweaks *I* use while playing Skyrim, they don't alter the game too much, they just improve some aspects I felt needed to be changed from *my* perspective and style of gameplay.\n<br />\n<br />- My selected [color=#838EDE]tweaks[/color]:\n<br />\n<br />[list]\n<br />[*]ABT - Progressive Damage (BS and CCO) [No Increased Damage]\n<br />[*]ABT - Bolts Renamed for BS and CCO [No Increased Damage]\n<br />[*]ABT - Faster Arrows Improved +50%\n<br />[*]ABT - Faster Bolts Improved +50%\n<br />[*]ABT - Recover 50% Less Arrows and Bolts\n<br />[*]ABT - Loot Arrows HARDCORE version\n<br />[*]ABT - Merchants Arrows HARDCORE version\n<br />[*]Deeper Bolts Impacts: +8 Units Deeper\n<br />[/list]\n<br />- My [color=#458B00]Skyrim.ini[/color] settings:\n<br />\n<br />[color=#66CCCC] [Actor] [/color]\n<br />[color=#66CCCC] fVisibleNavmeshMoveDist=12288.0000 [/color]\n<br />[color=#66CCCC] [Combat] [/color]\n<br />[color=#66CCCC] fMagnetismStrafeHeadingMult=0.0 [/color]\n<br />[color=#66CCCC] fMagnetismLookingMult=0.0 [/color]\n<br />[color=#66CCCC] f1PArrowTiltUpAngle=0.5 [/color]\n<br />[color=#66CCCC] f3PArrowTiltUpAngle=1.0 [/color]\n<br />[color=#66CCCC] f1PBoltTiltUpAngle=0.3 [/color]\n<br />[color=#66CCCC] f3PBoltTiltUpAngle=0.4 [/color]\n<br />\n<br />- My [color=#FFA500]Crosshair[/color] in-game:\n<br />\n<br />[list]\n<br />[*]None.\n<br />[/list]\n<br />Wait, what!? No crosshair? Yes, no crosshair, I followed [url=http://skyrim.nexusmods.com/users/1735630]Ka3m0n's[/url] advice and I must say I enjoy playing like this MUCH more:\n<br />\n<br />[quote]I HIGHLY RECOMMEND disabling the bow crosshairs entirely using [url=http://skyrim.nexusmods.com/mods/3222]iHUD[/url]. You'll find yourself actually practicing with those archery targets and, with practice, you can become a pretty darn good shot. Every time you hit the target (shooting freehand), it's extremely gratifying and a lot more fun than moving virtual reality crosshairs with a mouse and shooting bullseyes at 1000 feet every.....single.....time. (booooring).[/quote]\n<br />[center] [img]http://farm9.staticflickr.com/8469/8084441220_c614a55608_o.jpg[/img] [/center]\n<br />Three alternatives, choose one:\n<br />\n<br />[url=http://skyrim.nexusmods.com/ajax/downloadwithnmm?id=84687] [img]http://farm9.staticflickr.com/8327/8084576571_dcee135a43_o.jpg[/img] [/url]\n<br />\n<br />[color=#FFC125]1st.[/color] Fancy NMM installer! Click the [b][color=#BCE937]DOWNLOAD WITH MANAGER[/color][/b] button. Activate with the NMM. As of v4.0, ABT includes several choices:\n<br />\n<br />[list]\n<br />[*]Skyrim Only\n<br />[*]Skyrim + Dawnguard\n<br />[*]Skyrim + Hearthfire\n<br />[*]Skyrim + Dragonborn\n<br />[*]Skyrim + All DLCs\n<br />[/list]\n<br />If you have any (or all) DLCs, after installing you should see the file names start with 'ABT'. If you don't have any DLCs, your files should start with just 'AT'. \n<br />\n<br />I won't be making 'combined' versions with different DLCs (other than the 'All DLCs' option). Each individual DLC option in the installer is there for convinience, however you can still use ABT if you only have 2 DLCs, for example:\n<br />\n<br />[list]\n<br />[*]Hearthfire + Dawnguard: just install the 'Skyrim + Dawnguard' versions.\n<br />[*]Hearthfire + Dragonborn: just install the 'Skyrim + Dragonborn' versions.\n<br />[*]Dawnguard + Dragonborn: just install the 'All DLCs' versions.\n<br />[/list]If your game crashes, check you have installed the correct version before posting in the comments section. Also, verify that you are using the latest version of Skyrim (v1.8.151.0.7). SKSE is *not* required for this mod.\n<br />\n<br />[color=#FFC125]2nd.[/color] Download the Bain-ready file, and install using Wyre-Bash, courtesy of [url=http://skyrim.nexusmods.com/modules/members/index.php?id=1368495]Xaliqen[/url]\n<br />\n<br />The BAIN-ready package doesn't include the 'Skyrim + Hearthfire' version because it is not needed (either install the standard 'Skyrim Only' options, or any of the other versions if you have the proper DLCs).\n<br />\n<br />[color=#FFC125]3rd.[/color] Manual installation: just open the file and copy the .esp files you want to your SkyrimData directory. Then activate the files using the NMM.\n<br />\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8468/8084478291_9f77a4bbfb_o.jpg[/img] [/center]\n<br />Use [url=http://skyrim.nexusmods.com/mods/6]BOSS[/url] to sort ABT's plugins in your load order. However, as a general rule all tweaks should be loaded [b]after[/b] any mods that edits arrows and/or bolts, for example:\n<br />\n<br />&gt;Skyrim.esm\n<br />&gt;Update.esm\n<br />&gt;Dawnguard.esm\n<br />&gt;Hearthfires.esm\n<br />&gt;Dragonborn.esm\n<br />....\n<br />&gt;(other mods)\n<br />....\n<br />&gt;Smithing Perks Overhaul - Balanced.esp\n<br />&gt;Weapons and Armor fixes.esp\n<br />&gt;Weapons and Armor fixes - Hacks.esp\n<br />&gt;Complete Crafting Overhaul - BS version.esp\n<br />&gt;Headbomb's Better Sorting - Ammo.esp\n<br />&gt;Headbomb's Better Sorting - Books.esp\n<br />&gt;Headbomb's Better Sorting - Food (Reduced Weight).esp\n<br />&gt;Headbomb's Better Sorting - Ingredients.esp\n<br />&gt;Headbomb's Better Sorting - Miscellaneous.esp\n<br />&gt;Headbomb's Better Sorting - Potions (Half Weight).esp\n<br />&gt;Headbomb's Better Sorting - Soul Gems (Ranked).esp\n<br />&gt;Headbomb's Better Sorting - Spells.esp\n<br />....\n<br />ACE Modules (such as ACE Archery.esp)\n<br />....\n<br />&gt;ABT - Faster Arrows Improved (any version).esp\n<br />&gt;ABT - Faster Bolts Improved (any version).esp\n<br />&gt;ABT - Loot Arrows (any version).esp\n<br />&gt;ABT - Merchants Arrows (any version).esp\n<br />&gt;ABT - Progressive Damage (any version, but 'BS and CCO' versions in particular).esp\n<br />&gt;ABT - Recover Arrows (any version).esp\n<br />&gt;ABT - Bolts Renamed for BS and CCO.esp\n<br />....\n<br />&gt;(rest of your mods)\n<br />&gt;Your Merged Patch\n<br />\n<br />\n<br />[center] [img]http://farm8.staticflickr.com/7311/9724431615_44bc85a154_o.jpg[/img] [/center]\n<br />The Tutorial in the Files section shows you how to edit custom arrows and bolts added by other mods to make them compatible with my 'Faster Arrows/Bolts Improved' tweaks, which are the ones most likely to cause issues (while playing you will notice right away if a newly added arrow/bolt doesn't fly at the same speed as the vanilla ones). It's fairly simple to edit custom ammo speeds, you'll probably need to spend 5 maybe 10 minutes learning how to do it the first time, and you'll be able to do it in a couple of minutes next time you add new ammo to the game.\n<br />\n<br />The following are some instructions and/or clarifications regarding popular mods that people ask me about, by no means this aims to be a complete list of compatible mods, I'll just add information as I see fit to this section.\n<br />\n<br />\n<br />[color=#FFC125][u]ACE - COMBAT SKILLS[/u][/color]\n<br />\n<br />In previous versions ABT was compatible (to some extent) with [url=http://skyrim.nexusmods.com/mods/10037]ACE[/url]. It has come to my attention that ACE changed the keywords it uses to differenciate arrows (Long, Light, Worn, Regular) sometime ago. I had to make a decision whether to continue using ACE-keywords in ABT or change them to match the unofficial patches, so I chose the latter for compatibility reasons. As of v4.3 the keywords for arrow projectiles ABT uses match USKP, UDGP and UDBP. This means you have to either manually patch ACE and ABT to work together (using Tes5Edit compare plugins and drag-and-drop changes from one to the other, choosing which edits you want to keep), or you can just skip some tweaks that are more or less already covered by ACE features, from what I can tell you can still use:\n<br />\n<br />[list]\n<br />[*]Faster Bolts Improved\n<br />[*]Increased Bolts Damage\n<br />[*]Deeper Bolts Impacts\n<br />[*]Recover Arrows and Bolts\n<br />[*]Loot Arrows (partial compatibility, ACE changes some leveled lists from this tweak, load Loot Arrows before [b]ACE - Archery[/b] module)\n<br />[*]Merchant Arrows (partical compatibility, ACE changes some leveled lists from this tweak, load Loot Arrows before [b]ACE - Archery[/b] module)\n<br />[/list]\n<br />[color=#FFC125][u]CLOSER QUIVERS AND LONGER ARROWS[/u][/color]\n<br />\n<br />[url=http://skyrim.nexusmods.com/mods/5711]Closer Quivers and Longer Arrows[/url] and ABT are fully compatible (confirmed by EvilDeadAsh). :)\n<br />\n<br />\n<br />[color=#FFC125][u]EXPLOSIVE BOLTS VISUALIZED[/u][/color]\n<br />\n<br />There are some incompatibilities between [url=http://skyrim.nexusmods.com/mods/21922]Dawnguard Crossbow Explosive Bolts Visualized[/url] and ABT:\n<br />\n<br />- [b]ABT - Faster Bolts Improved (any version)[/b]: MadCat's mod edits the PROJectiles in order to change the Model paths used by bolts, using TES5Edit you can drag &amp; drop ABT's Gravity and Speed changes in the conflicting bolts and copy them into ExplosiveBoltsVisualized.esp\n<br />\n<br />- [b]ABT - Bolts Renamed for BS and CCO[/b]: MadCat's mod edits the AMMO in order to change the Model and Texture paths used by bolts, using TES5Edit you can see a difference in the Name of the Bolt, if you want to keep BS and CCO's conventions you can drag &amp; drop the bolts' names and copy them into ExplosiveBoltsVisualized.esp\n<br />\n<br />- [b]ABT - Increased Bolts Damage (any version)[/b]: same as before (for BS and CCO versions with Increased Damage), under TES5Edit's scope you can see the increased damage and value changes from ABT are overriden (depending on which version you choose), again: drag &amp; drop those changes and copy them into ExplosiveBoltsVisualized.esp\n<br />\n<br />As for the [b]Deeper Bolts Impacts[/b] tweak, in theory you can still use it, but you will only notice the difference in the two basic bolts of each kind (Steel Bolt and Dwarven Bolt), the special versions of each will use MadCat's nif files, so they will keep the vanilla depth for impact. To make this compatible would mean editing the .nif files, so unless you know how to do it or MadCat decides to make alternative versions, I'm afraid you won't be able see the special bolts with deeper impacts.\n<br />\n<br />\n<br />[color=#FFC125][u]IMMERSIVE WEAPONS[/u][/color]\n<br />\n<br />Most of ABT's tweaks seem to be fully compatible with [url=http://skyrim.nexusmods.com/mods/27644]Immersive Weapons[/url] (I don't use it so take it with a grain of salt), except for 'Faster Arrows Improved', 'Loot Arrows' and 'Merchants Arrows' tweaks. If you load those tweaks [b]after[/b] Immersive Weapons you won't see some of its new weapons used by enemies or sold by merchants (mainly the ones added to vanilla leveled lists), and you also won't see new arrows fly faster because ABT changes vanilla arrows mostly. If you load them [b]before[/b] Immersive Weapons, then the changes those tweaks make will be overriden and they won't work, so there's no point in installing them if you're going place them before that mod. I suggest you skip those tweaks if you use Immersive Weapons (however, you can install Faster Arrows Improved if you want, and use the tutorial I uploaded to edit the new arrows PROJectiles, it takes only a couple of minutes and you'll be able to make that tweak work without problems).\n<br />\n<br />Edit: [url=http://skyrim.nexusmods.com/users/1585359]Pestilenz[/url] uploaded a compatibility patch for ABT's Faster Arrows Improved and Immersive Weapons, you can find it [url=http://skyrim.nexusmods.com/mods/41868]here[/url].\n<br />Update: [url=http://www.nexusmods.com/skyrim/users/4392056]EAGnR[/url] made another compatibility patch for ABT's Faster Arrows Improved and Immersive Weapons, apparently the one made by Pestilenz is broken. You can find the new patch [url=http://www.nexusmods.com/skyrim/mods/56331]here[/url].\n<br />\n<br />\n<br />[color=#FFC125][u]REQUIEM - THE ROLEPLAYING OVERHAUL[/u][/color]\n<br />\n<br />I have never used [url=http://skyrim.nexusmods.com/mods/19281]Requiem[/url], but based on its readme I would say it's not compatible with ABT. Requiem seems to change almost every aspect of the game, and between those changes I see leveled lists (so Loot and Merchants tweaks from ABT won't work), and I also see overhauls to the whole ranged/archery experience (so Faster Arrows/Bolts Improved, and Progressive/Increased Damage tweaks won't work either). The only tweak that would probably be safe to use is Deeper Bolts Impacts. Theoretically if you installed ABT and placed its plugins after Requiem they 'should' work... but that mod aims to change how everything works in the game, so even if they do work, there's no guarantee the result will be balanced under that mod's perspective (specially ammo damage), so I would advice against using ABT based on that notion alone (except for Deeper Bolts Impacts, those are just meshes so they can still be used by themselves). If you still want to try using both, you could always test them together, and if you don't like how they work uninstall one of the other (probably ABT, because it's less troublesome than uninstalling an overhaul mod).\n<br />\n<br />\n<br />[color=#FFC125][u]SKYRIM REDONE[/u][/color]\n<br />\n<br />Most of ABT's tweaks are *NOT* compatible with [url=http://skyrim.nexusmods.com/mods/9286]SkyRe's[/url] 'main module' (and most likely neither with it's 'combat module'), that mod overhauls the archery system (the entire game actually), changing ammo, projectiles, leveled lists, etc., making for a completely different archery experience. Having said that, if you are not planning on using SkyRe's 'main module' or 'combat module', you should be fine using ABT (I can't guarantee it because I don't use SkyRe, but based on the description page I think you are safe using both mods without those two modules).\n<br />\n<br />[color=red]Note:[/color] The 'Recover Arrows and Bolts' and 'Deeper Bolts Impacts' tweaks [b]are[/b] compatible with SkyRe, load the first one after SkyRe's modules (the second tweak is just meshes, no .esp file is needed).\n<br />\n<br />If you prefer an overhauled ranged experience, use SkyRe, it already includes some of the same options ABT has. If you are like me, who prefers a little adjustment here and there, then use ABT.\n<br />\n<br />\n<br />[color=#FFC125][u]ULTIMATE SPINNING ARROWS[/u][/color]\n<br />\n<br />[url=http://skyrim.nexusmods.com/mods/37358]Ultimate Spinning Arrows[/url] only has meshes, so no plugin from ABT will conflict with it. However, it does include two bolt projectile meshes (boltprojectile.nif and dwarvenboltprojectile.nif) which are also used by ABT, so if you are planning on using that mod skip the [b]Deeper Bolts Impacts[/b] tweak, since it replaces those two meshes for bolts projectiles.\n<br />\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8328/8084441714_2b045319b9_o.jpg[/img] [/center]\n<br />[list]\n<br />[*] This may or may not happen to some of you (it doesn't seem to happen to everyone): Sometimes when you run out of a given type of arrow the last arrow shot from that type, and the first one shot from the next type automatically assigned, will fly a shorter distance that they should. For example: you shoot your last Steel Arrow, and let's say the game assigns an Iron Arrow to be shot next (based on what arrows you have in your inventory): both the last Steel Arrow and the first Iron Arrow shot may fly a shorter distance than expected. Apparently this happens with the all Faster Arrows Improved versions, and it seems to be an issue related to how the game handles switching/assigning arrows when you run out of a given type.\n<br />[/list]\n<br />&gt; [color=#B3EE3A]Solution 1:[/color] Try to keep a good supply of arrows so as not to run out of any given type. If you are like me and play with less available arrows, try to switch to a different arrow type just before running out. Skyrim is a dangerous place and you should keep an eye out for your arrows supply.\n<br />\n<br />&gt; [color=#B3EE3A]Solution 2:[/color] When shooting the last arrow of a given type, wait half 0.5 - 1 seconds before reloading the bow. This will allow the last arrow to be shot at the correct speed, and the next arrow you shoot will fly normaly.\n<br />\n<br />From a role-playing perspective, it could mean the player may suddenly panic while running out of arrows, or maybe while changing quivers in a rush, which could led to shooting recklessly. So try to keep a good amount of arrows at hand, and take your time when switching quivers!\n<br />\n<br />\n<br />[list]\n<br />[*] Another issue may be crosshair behavior: if you use any Faster tweaks, you will probably [b]need[/b] to edit your Skirim.ini file with the entries I mentioned above. Make sure you are editing the right .ini file! (make a backup before just in case!). If your arrows and/or bolts don't go right where you are aiming, change the values in the TiltUpAngle entries, from 0.7 to other numbers (if you are shooting to high, reduce the numbers, if you are shooting too low, increase them). It may take you some tests to find the right values, but I do encourage you to do it, you probably won't have to change them ever again, and it's worth it. Be aware that there aren't any entries for the 'horizontal' axis of the crosshair, so if your arrows are hitting on either side of the center of the crosshair, there's really nothing I can do.\n<br />[/list]\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8473/8084444845_4255acb8dd_o.jpg[/img] [/center]\n<br />[u]Currently available in:[/u]\n<br />\n<br />[url=http://skyrim.nexusmods.com/mods/24822] [img]http://farm9.staticflickr.com/8251/8515180571_1222c466bc_o.gif[/img] [/url]\n<br />[url=http://skyrim.nexusmods.com/mods/24822]Chinese[/url] - courtesy of [url=http://skyrim.nexusmods.com/users/5130823]Taylortay2012[/url]\n<br />\n<br />[url=http://forum.scharesoft.de/showthread.php?47528-Jeden-Tag-eine-%DCbersetzung][img]http://farm9.staticflickr.com/8372/8515610363_1235a980ab_o.jpg[/img][/url]\n<br />[url=http://forum.scharesoft.de/showthread.php?47528-Jeden-Tag-eine-%DCbersetzung]German[/url] - courtesy of [url=http://skyrim.nexusmods.com/users/623217]greywater[/url]\n<br />\n<br />[url=http://skyrim.nexusmods.com/mods/27057] [img]http://farm9.staticflickr.com/8526/8515180591_04f34a0a73_o.gif[/img] [/url]\n<br />[url=http://skyrim.nexusmods.com/mods/27057/]Italian[/url] - courtesy of the [url=http://skyrim.nexusmods.com/users/1748210]FatalIllusion[/url] (member of the Tes Translators Team)\n<br />\n<br />[url=http://skyrim.nexusmods.com/mods/47445] [img]https://lh5.googleusercontent.com/-OxyPBhGTbwY/Uow-H81db3I/AAAAAAAABpM/HJXuSDb3f4U/s30/Poland%2520Flag.jpg][/img] [/url]\n<br />[url=http://skyrim.nexusmods.com/mods/47445]Polish[/url] - courtesy of [url=http://skyrim.nexusmods.com/users/664578]matatiah[/url]\n<br />\n<br />[url=http://skyrim.nexusmods.com/mods/41018] [img]http://farm8.staticflickr.com/7387/9600881461_30855a8813_o.jpg[/img] [/url]\n<br />[url=http://skyrim.nexusmods.com/mods/41018]Spanish[/url] - courtesy of [url=http://skyrim.nexusmods.com/users/1602430]Aegeons[/url]\n<br />\n<br />[url=http://skyrim.nexusmods.com/mods/37269] [img]http://farm9.staticflickr.com/8228/8515180619_9f39b5588f_o.jpg[/img] [/url]\n<br />[url=http://skyrim.nexusmods.com/mods/37269]Russian[/url] - courtesy of [url=http://skyrim.nexusmods.com/modules/members/index.php?id=100354]DJ_Kovrik[/url]\n<br />\n<br />You have my permission to translate this mod if the translation will be uploaded to the Nexus. I only ask that you let me know, and that you send me the link so I can include your translation in this description (as well as credit you, of course). If you want to upload it to other sites, ask me first via PM, I'll probably say yes but don't take my permission for granted.\n<br />\n<br />If any of the translations are outdated, please [b][color=red]ask the translators to update them[/color][/b]. If you know how to do it yourself, go ahead and then send me a link to the updated version.\n<br />\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8324/8084444795_8fa5cc6d29_o.jpg[/img] [/center]\n<br />Click on the 'Changes' tab to see the full changelog. These are the latest changes:\n<br />\n<br />[color=#FF6666]Version 4.3[/color]\n<br />- Fixed all WeapMaterial keywords: all of them were corrected to match the unofficial patches. ABT versions compatible with CCO (which adds its own keywords for a couple of arrows) will use CCO keywords so that it works as CCO intended.\n<br />- Incorporated UDGP fixes: Exploding crossbow bolts were still recoverable after being fired despite the obvious implication that they explode and thus should be consumed (Bug #5038). Same thing applies for Sunhallowed Elven Arrows. Nord Hero Arrows were missing a Non-Bolt flag in most cases.\n<br />- Fixed: some inconsistences I found while editing the plugins.\n<br />- Updated: plugins were updated to match unofficial patches changes where necessary (USKP v2.0.4, UDGP v2.0.3, UDBP v2.0.3, UHFP v2.0.3).\n<br />- Cleaned: wild edits (worldspace) in all plugins. STEP users shouldn't have to do this manually anymore. ;)\n<br />\n<br />[color=#FF6666]Version 4.2[/color]\n<br />- Added: Kevkas All-in-One version that includes all my Personal Tweaks Recommendations.\n<br />- Incorporated UDBP v1.0.5 fix: Stalhrim arrow projectile effects (DLC2ArrowStalhrimProjectile) linked to the wrong mesh, firing the standard arrow instead of the projectile that includes the tracer. (Bug #13449)\n<br />- Incorporated UDGP v1.2.3 fix: Nord Hero Arrows needed the WeapMaterialDraugr keyword so they show up in the correct smithing category. (Bug #12513)\n<br />- Updated: readme information.\n<br />\n<br />[color=#FF6666]Version 4.1.2[/color]\n<br />- Incorporated USKP v1.3.2 fix: Fired Iron Arrows (ArrowIronProjectile) were flagged as \"supersonic\" which caused them to make out of place sounds when flying past the player. (Bug #12635)\n<br />- Incorporated USKP v1.3.2 fix: Fired Nord Hero Arrows were being marked as \"ArrowNordHeroProjectile\" instead of \"Nord Hero Arrow\".\n<br />- Added: readme to the downloaded files.\n<br />\n<br />[color=#FF6666]Version 4.1.1[/color]\n<br />- Fixed: typo in the NMM script that was installing the wrong versions.\n<br />- Updated: some damage tables in the NMM installer.\n<br />\n<br />[color=#FF6666]Version 4.1[/color]\n<br />- Fixed: all Faster Arrows Improved tweaks from 'Skyrim + All DLCs' option (new arrows should fly faster now).\n<br />- Fixed: all Progressive Damage and Increased Progressive Damage tweaks from 'Skyrim + All DLCs' option (new arrows should have proper damage values, and also proper names in BS and CCO versions).\n<br />- Fixed: all Loot Arrows and Merchants Arrows tweaks in 'Skyrim + All DLCs' option (leveled lists were duplicated and changes were not applying to the correct leveled lists).\n<br />- Fixed: all Recover Arrows and Bolts tweaks in 'Skyrim + All DLCs' option (these ones I remade just in case).\n<br />\n<br />[color=#FF6666]Version 4.0[/color]\n<br />- Added: support for Dragronborn DLC (Nordic Arrows, Stalhrim Arrows, and Riekling Spears).\n<br />- Added: Skyrim + Hearthfire option in the installer.\n<br />- Added: Skyrim + Dragonborn option in the installer.\n<br />- Added: Skyrim + All DLCs option in the installer.\n<br />- Fixed: compatibility issues with ACE for Skyrim + Dawnguard options (I forgot to add some keywords needed to sort 'long' and 'light' arrows).\n<br />- Added: compatibility with ACE for Skyrim + Heartfire options.\n<br />- Added: compatibility with ACE for Skyrim + Dragonborn options.\n<br />- Added: compatibility with ACE for Skyrim + All DLCs options.\n<br />- Updated: ALL damage tables in the installer.\n<br />- Updated: (and simplified) ALL descriptions in the installer.\n<br />- Major internal rewrite of the installer script.\n<br />- Redesign of the installer layout to make it more user-friendly.\n<br />\n<br />[color=#FF6666]Version 3.1[/color]\n<br />- New tweak: 'Deeper Bolts Impacts'.\n<br />- Fixed 'ArrowDraugrProjectile' name from 'Draugr Arrow' to 'Ancient Nord Arrow'.\n<br />- Fixed some descriptions within the NMM installer for consistency purposes.\n<br />\n<br />\n<br />[center] [img]http://farm4.staticflickr.com/3761/9727660718_08bf3c5078_o.jpg[/img] [/center]\n<br />[list]\n<br />[*][url=http://skyrim.nexusmods.com/mods/10037]ACE - Combat Skills[/url]: if you want to try a different Archery experience try ACE, it is completely modular and each skill tree can be downloaded separately. ABT is already compatible with ACE, so you don't need a patch. I also included some instructions above specifically for ACE users.\n<br />[*][url=http://skyrim.nexusmods.com/mods/11165]Arrows in the Everywhere[/url]: lots of options that allow more arrows to stick to actors, it also increases how long arrows stay visible on them.\n<br />[*][url=http://skyrim.nexusmods.com/mods/10753]Auto Unequip Ammo[/url]: essential for any archer... heck, for anyone really!\n<br />[*][url=http://skyrim.nexusmods.com/mods/35717]Belt-Fastened Quivers[/url]: this mod changes the position of the bow and quiver to a more backpack-friendly position (made by Chesko, author of Frostfall, and compatible with it). It also includes a new animation for loading the bow, made by Ninivekha.\n<br />[*][url=http://skyrim.nexusmods.com/mods/522]Better archery Eagle Eye perk[/url]: very old mod, but it still works like a charm, highly recommended.\n<br />[*][url=http://skyrim.nexusmods.com/mods/5711]Closer Quivers and Longer Arrows[/url]: no more floating quivers, this mods adjusts them to be better positioned on your back. The new version also adds longer arrows (though I prefer version 2).\n<br />[*][url=http://skyrim.nexusmods.com/mods/25790]Convenient Crossbows[/url]: adds crossbows and bolts into the game like they always should have been, to enemies, forges, sold by blacksmiths, etc. You may have to edit it's new leveled lists to make bolts more/less available in-game, if you want it to match my Loot and Merchants tweaks.\n<br />[*][url=http://skyrim.nexusmods.com/mods/2944]Iron Arrow Head Retex[/url]: changes vanilla texture or Iron Arrow's head, small but very good mod (highly underrated IMO). The resolution is lower that CaBaL's work, but it still deserves to be mentioned.\n<br />[*][url=http://skyrim.nexusmods.com/mods/23318]Larger penetrating crossbow bolts[/url]: if you think bolts aren't big enough to deal the amount of damage they were assigned, this mod will increase their mesh size, making them penetrate more on creatures/enemies. If you choose to use this mod, don't use my 'Deeper Bolts Impacts' tweak, they both replace the same meshes.\n<br />[*][url=http://skyrim.nexusmods.com/mods/13652]Proper Aiming[/url]: if you are having trouble with the crosshair, and you've already tried modifying the Skyrim.ini file with no luck, try this mod, some people have reported it works for them (load it [b]after[/b] ABT). If that doesn't work, I have no idea how to fix the crosshair in your game.\n<br />[*][url=http://skyrim.nexusmods.com/mods/5164]Proper Lenght Arrows[/url]: alternative mod for v3 of Closer Quivers and Longer Arrows if you want arrows to be longer than vanilla.\n<br />[*][url=http://skyrim.nexusmods.com/mods/7548]Selective Quivers[/url]: Replacer mod that forces NPCs and player character to use only one type of quiver for all arrows.\n<br />[*][url=http://skyrim.nexusmods.com/mods/2960]Steel Arrow Head Retex[/url]: another great retexture mod, changes Steel Arrow's head texture, by the same author of Iron Arrow Head Retex. The resolution is lower that CaBaL's work, although I do like the color of the feathers a little bit more than CaBaL's.\n<br />[*][url=http://skyrim.nexusmods.com/mods/7716]Well Placed Weapons and Quivers[/url]: if Closer Quivers and Longer Arrows is incompatible for you, here's another option (thanks to livewired500 for pointing it out).\n<br />[/list]\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8054/8084441582_22ce58bfaa_o.jpg[/img] [/center]\n<br />This is a list of things I would like to add in future updates, kind of a \"to-do\" list of possible features for next versions (no ETA though):\n<br />\n<br />[list]\n<br />[*]Add support for the unique [url=http://elderscrolls.wikia.com/wiki/Dwarven_Sphere_Centurion_Arrow]Dwarven Sphere Centurion Arrow[/url] found in the Dwemer Museum in Markarth and make it playable\n<br />[*]Add 'Progressive vs. Damage' tweak (basic idea is: low level arrows do less damage and fly slower, and high level arrows do more damage -increasing exponentially- as well as fly faster)\n<br />[*]Add different arrow's release sounds\n<br />[/list]\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8185/8084444643_e7015752a3_o.jpg[/img] [/center]\n<br />[list]\n<br />[*][url=http://skyrim.nexusmods.com/modules/members/index.php?id=953005]Zappoo[/url]: for letting me dig into his files to learn how to create the NMM installer.\n<br />[*][url=http://skyrim.nexusmods.com/modules/members/index.php?id=2848806]FordPerfect[/url]: for creating Faster Arrows which was one of the first mods I've downloaded from the nexus.\n<br />[*][url=http://skyrim.nexusmods.com/modules/members/index.php?id=2654467]Sunnie[/url] and [url=http://skyrim.nexusmods.com/modules/members/index.php?id=2811323]Jet4571[/url]: For helping me figure out how leveled item lists work.\n<br />[*][url=http://missselfdestruct.deviantart.com]MissSelfDestruct[/url] (@ DeviantArt): for providing the main image for this mod.\n<br />[*][url=http://cvillarosa.deviantart.com]Cvillarosa[/url] (@ DeviantArt): for providing the title's background image for this mod.\n<br />[*][url=http://skyrim.nexusmods.com/users/3921199]Athyra[/url]: for helping make ABT compatible with ACE, and for explaining everything to me with the utmost patience.\n<br />[*][url=http://skyrim.nexusmods.com/users/3297180]Ghosu[/url] (aka LeckerHamster): for allowing me to use his meshes for the Deeper Bolts Impacts tweak.\n<br />[/list]\n<br />[b]Nexus artists whose screenshots I use on this mod:[/b]\n<br />\n<br />[center] [url=http://skyrim.nexusmods.com/users/938388][img]http://www.thenexusforums.com/uploads/av-938388.jpg[/img][/url] [url=http://skyrim.nexusmods.com/users/2159884][img]http://www.thenexusforums.com/uploads/av-2159884.jpg[/img][/url] [url=http://skyrim.nexusmods.com/users/457645][img]http://www.thenexusforums.com/uploads/av-457645.png[/img][/url] [url=http://skyrim.nexusmods.com/users/2596964][img]https://lh6.googleusercontent.com/-APYgPK9J_24/UKPUAhCstRI/AAAAAAAAAiw/iKPUy5MvwDc/s64/glaucus.jpg[/img][/url] [url=http://www.flickr.com/photos/lunanella/sets][img]http://www.thenexusforums.com/uploads/av-2099379.png[/img][/url] [url=http://www.flickr.com/photos/midhras/sets][img]http://www.thenexusforums.com/uploads/av-2808024.jpeg[/img][/url] [url=http://skyrim.nexusmods.com/users/1589086][img]http://www.gravatar.com/avatar/dded940b9d3795931b14c9d766de7927?s=64&amp;d=[/img][/url] [url=http://skyrim.nexusmods.com/users/3489139][img]http://www.thenexusforums.com/uploads/av-3489139.png[/img][/url] [url=http://skyrim.nexusmods.com/users/2484266][img]https://lh5.googleusercontent.com/-KXAUHl0I4qo/UKPTOkxHD6I/AAAAAAAAAic/0zCVR0XT2AY/s64/Silvaner.jpg[/img][/url] [url=http://skyrim.nexusmods.com/users/3128020][img]http://www.gravatar.com/avatar/ba56bae0aa982160f30436bddcc7d446?s=64&amp;d=[/img][/url] [/center]\n<br />\n<br />[list]\n<br />[*][size=4]Last but not least a big thanks to [url=http://skyrim.nexusmods.com/modules/members/index.php?id=1089738]Utopolyst[/url]: for helping and lending me a hand when I needed one.[/size]\n<br />[/list]\n<br />\n<br />[center] [img]http://farm9.staticflickr.com/8464/8084441446_7679b2a98c_o.jpg[/img] [/center]\n<br />[center] [url=http://www.nexusmods.com/skyrim/mods/10125] [img]http://farm9.staticflickr.com/8142/7360210334_4f525aaf01.jpg[/img] [/url] [/center][center] [url=http://www.nexusmods.com/skyrim/mods/17968] [img]http://farm8.staticflickr.com/7232/7321224062_3b226a6e05_z.jpg[/img] [/url] [/center][center] [url=http://www.nexusmods.com/skyrim/mods/12129] [img]https://lh4.googleusercontent.com/-jG-7vgNTbXk/T7BT9fKGleI/AAAAAAAAAZo/FvXi0Qx5bjw/s950/Bullseye%2520Perk%2520Fix%2520-%2520Dragonslayer%2520Perk.jpg[/img] [/url] [/center]",
  "categoryId": "24",
  "version": "4.3",
  "author": "Kevkas",
  "createdUnix": "1330750307",
  "updatedUnix": "1406256363",
  "containsAdultContent": false,
  "uploadedBy": "kevkas",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013427",
      "name": "ABT - Tutorial v1-2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1486",
      "fileName": "ABT - Tutorial v1-12-11941-1-2.rar",
      "uploadedUnix": "1361905087",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/9bf8b8db9b6bc378c82ebd6258108e071d1c50016a9f7d0aac9270c02fb3b931/analysis/1407441015/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ABT%20-%20Tutorial%20v1-12-11941-1-2.rar?fid=1000013427&ttl=1535773452&ri=8192&rs=8192&setec=89b65875363abdbe026d416c1b07dec5"
    },
    {
      "fileId": "1000013668",
      "name": "Arrows and Bolts Tweaks v4-1-1",
      "version": "4.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "45265",
      "fileName": "Arrows and Bolts Tweaks v4-1-1-11941-4-1-1.7z",
      "uploadedUnix": "1361985636",
      "modVersion": "4.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1c5c2ce30b8435acac78c8620f0de5de1fe80d3ef54c7cf70ca2647876ee9c6d/analysis/1407442690/",
      "changelogHtml": " Updated: some damage tables in the NMM installer. <br/> \n Fixed: typo in the NMM script that was installing the wrong versions. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arrows%20and%20Bolts%20Tweaks%20v4-1-1-11941-4-1-1.7z?fid=1000013668&ttl=1535773453&ri=8192&rs=8192&setec=1e22c343ba8d2309b40a96d5492e1512"
    },
    {
      "fileId": "1000013676",
      "name": "Arrows and Bolts Tweaks v4-1-1 - BAIN-ready",
      "version": "4.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "46949",
      "fileName": "Arrows and Bolts Tweaks v4-1-1 - BAIN-ready-11941-4-1-1.7z",
      "uploadedUnix": "1361986712",
      "modVersion": "4.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/80cd0c26ade5bca31aefa7daec0e9c1c6f46b629edf668dbd706430c0e2e7fdb/analysis/1407442806/",
      "changelogHtml": " Updated: some damage tables in the NMM installer. <br/> \n Fixed: typo in the NMM script that was installing the wrong versions. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arrows%20and%20Bolts%20Tweaks%20v4-1-1%20-%20BAIN-ready-11941-4-1-1.7z?fid=1000013676&ttl=1535773453&ri=8192&rs=8192&setec=866c7c27c0b199e60f8bb98579becb86"
    },
    {
      "fileId": "1000031013",
      "name": "Arrows and Bolts Tweaks v4-1-2",
      "version": "4.1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "45276",
      "fileName": "Arrows and Bolts Tweaks v4-1-2-11941-4-1-2.7z",
      "uploadedUnix": "1369265648",
      "modVersion": "4.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/049e1850b479382b25d4c3ecb2fa1970b6e27d65c5f4cdefb774e0b4769f1425/analysis/1407578179/",
      "changelogHtml": " Incorporated USKP v1.3.2 fix: Fired Iron Arrows (ArrowIronProjectile) were flagged as \"supersonic\" which caused them to make out of place sounds when flying past the player. (Bug #12635) <br/> \n Incorporated USKP v1.3.2 fix: Fired Nord Hero Arrows were being marked as \"ArrowNordHeroProjectile\" instead of \"Nord Hero Arrow\". <br/> \n Added: readme to the downloaded files. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arrows%20and%20Bolts%20Tweaks%20v4-1-2-11941-4-1-2.7z?fid=1000031013&ttl=1535773454&ri=8192&rs=8192&setec=1edb8e8b95c12fc5574243a7d101df99"
    },
    {
      "fileId": "1000031014",
      "name": "Arrows and Bolts Tweaks v4-1-2 - BAIN-ready",
      "version": "4.1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "46950",
      "fileName": "Arrows and Bolts Tweaks v4-1-2 - BAIN-ready-11941-4-1-2.7z",
      "uploadedUnix": "1369266511",
      "modVersion": "4.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/32a8febf167eb9b42e9a8f58e5296fd26353589a8b448b25dfc2dd052df98a8e/analysis/1407578217/",
      "changelogHtml": " Incorporated USKP v1.3.2 fix: Fired Iron Arrows (ArrowIronProjectile) were flagged as \"supersonic\" which caused them to make out of place sounds when flying past the player. (Bug #12635) <br/> \n Incorporated USKP v1.3.2 fix: Fired Nord Hero Arrows were being marked as \"ArrowNordHeroProjectile\" instead of \"Nord Hero Arrow\". <br/> \n Added: readme to the downloaded files. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arrows%20and%20Bolts%20Tweaks%20v4-1-2%20-%20BAIN-ready-11941-4-1-2.7z?fid=1000031014&ttl=1535773454&ri=8192&rs=8192&setec=4f17ea4f36f3560e059f096ea76416a3"
    },
    {
      "fileId": "1000083412",
      "name": "Arrows and Bolts Tweaks v4-2",
      "version": "4.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "47813",
      "fileName": "Arrows and Bolts Tweaks v4-2-11941-4-2.7z",
      "uploadedUnix": "1385496266",
      "modVersion": "4.2",
      "virusScanUrl": "https://www.virustotal.com/file/3dee470bbdff05a53a2e20b056a83a6f69dde46a4d11fd280c7e16cb38add8d2/analysis/1407810037/",
      "changelogHtml": " Added: Kevkas All-in-One version that includes all my Personal Tweaks Recommendations. <br/> \n Incorporated UDBP v1.0.5 fix: Stalhrim arrow projectile effects (DLC2ArrowStalhrimProjectile) linked to the wrong mesh, firing the standard arrow instead of the projectile that includes the tracer. (Bug #13449) <br/> \n Incorporated UDGP v1.2.3 fix: Nord Hero Arrows needed the WeapMaterialDraugr keyword so they show up in the correct smithing category. (Bug #12513) <br/> \n Updated: readme information. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arrows%20and%20Bolts%20Tweaks%20v4-2-11941-4-2.7z?fid=1000083412&ttl=1535773454&ri=8192&rs=8192&setec=e69bab048c14dc4e68b9fd82c26fcb82"
    },
    {
      "fileId": "1000083415",
      "name": "Arrows and Bolts Tweaks v4-2 - BAIN-ready",
      "version": "4.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "49486",
      "fileName": "Arrows and Bolts Tweaks v4-2 - BAIN-ready-11941-4-2.7z",
      "uploadedUnix": "1385497378",
      "modVersion": "4.2",
      "virusScanUrl": "https://www.virustotal.com/file/4b513274ac372aa726d31423a10686c66f3a9967d57f5b60463a423fbc3e669e/analysis/1407810018/",
      "changelogHtml": " Added: Kevkas All-in-One version that includes all my Personal Tweaks Recommendations. <br/> \n Incorporated UDBP v1.0.5 fix: Stalhrim arrow projectile effects (DLC2ArrowStalhrimProjectile) linked to the wrong mesh, firing the standard arrow instead of the projectile that includes the tracer. (Bug #13449) <br/> \n Incorporated UDGP v1.2.3 fix: Nord Hero Arrows needed the WeapMaterialDraugr keyword so they show up in the correct smithing category. (Bug #12513) <br/> \n Updated: readme information. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arrows%20and%20Bolts%20Tweaks%20v4-2%20-%20BAIN-ready-11941-4-2.7z?fid=1000083415&ttl=1535773455&ri=8192&rs=8192&setec=1f5455d023e0ffa7349d8f3e30259fd4"
    },
    {
      "fileId": "1000110175",
      "name": "Arrows and Bolts Tweaks v4-3",
      "version": "4.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "47813",
      "fileName": "Arrows and Bolts Tweaks v4-3-11941-4-3.7z",
      "uploadedUnix": "1400888505",
      "modVersion": "4.3",
      "virusScanUrl": "https://www.virustotal.com/file/44e9f33d17b9b358970b9e5f74766d0c430aa8cbe2c43d42408ef10dd1cd3af1/analysis/1408092295/",
      "changelogHtml": " Fixed all WeapMaterial keywords: all of them were corrected to match the unofficial patches. ABT versions compatible with CCO (which adds its own keywords for a couple of arrows) will use CCO keywords so that it works as CCO intended. <br/> \n Fixed: some inconsistences I found while editing the plugins. <br/> \n Updated: plugins were updated to match unofficial patches changes where necessary (USKP v2.0.4, UDGP v2.0.3, UDBP v2.0.3, UHFP v2.0.3). <br/> \n Cleaned: wild edits (worldspace) in all plugins. STEP users shouldn&#39;t have to do this manually anymore. ;) <br/> \n Updated the Tutorial to v1.3 (fixed grammar and some typos). <br/> \n Incorporated UDGP fixes: Exploding crossbow bolts were still recoverable after being fired despite the obvious implication that they explode and thus should be consumed (Bug #5038). <br/> \n Incorporated UDGP fixes: Sunhallowed Elven Arrows were still recoverable after being fired despite the obvious implication that they explode and thus should be consumed (Bug #5038). Nord Hero Arrows were missing a Non-Bolt flag in most cases. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arrows%20and%20Bolts%20Tweaks%20v4-3-11941-4-3.7z?fid=1000110175&ttl=1535773455&ri=8192&rs=8192&setec=2e8720cb8416364433dc603b36d85062"
    },
    {
      "fileId": "1000110177",
      "name": "Arrows and Bolts Tweaks v4-3 - BAIN-ready",
      "version": "4.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "49486",
      "fileName": "Arrows and Bolts Tweaks v4-3 - BAIN-ready-11941-4-3.7z",
      "uploadedUnix": "1400892299",
      "modVersion": "4.3",
      "virusScanUrl": "https://www.virustotal.com/file/30ce6828ad43a9761f8890d1a62ba8fa0b54455aef87da1d706ac07db288cd99/analysis/1408092305/",
      "changelogHtml": " Fixed all WeapMaterial keywords: all of them were corrected to match the unofficial patches. ABT versions compatible with CCO (which adds its own keywords for a couple of arrows) will use CCO keywords so that it works as CCO intended. <br/> \n Fixed: some inconsistences I found while editing the plugins. <br/> \n Updated: plugins were updated to match unofficial patches changes where necessary (USKP v2.0.4, UDGP v2.0.3, UDBP v2.0.3, UHFP v2.0.3). <br/> \n Cleaned: wild edits (worldspace) in all plugins. STEP users shouldn&#39;t have to do this manually anymore. ;) <br/> \n Updated the Tutorial to v1.3 (fixed grammar and some typos). <br/> \n Incorporated UDGP fixes: Exploding crossbow bolts were still recoverable after being fired despite the obvious implication that they explode and thus should be consumed (Bug #5038). <br/> \n Incorporated UDGP fixes: Sunhallowed Elven Arrows were still recoverable after being fired despite the obvious implication that they explode and thus should be consumed (Bug #5038). Nord Hero Arrows were missing a Non-Bolt flag in most cases. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arrows%20and%20Bolts%20Tweaks%20v4-3%20-%20BAIN-ready-11941-4-3.7z?fid=1000110177&ttl=1535773456&ri=8192&rs=8192&setec=5ef8cb2c2d60fcf0687f3e4157499732"
    },
    {
      "fileId": "1000119115",
      "name": "ABT - Tutorial v1-3",
      "version": "1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1487",
      "fileName": "ABT - Tutorial v1-3-11941-1-3.rar",
      "uploadedUnix": "1406256363",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/7aa76b0e3efd4a30eea478524f5117fb199c5a889c5bcd5fa04533f2dcda731f/analysis/1406256435/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ABT%20-%20Tutorial%20v1-3-11941-1-3.rar?fid=1000119115&ttl=1535773456&ri=8192&rs=8192&setec=0f92c45174195a4e1a04139b9e76a811"
    }
  ]
}