{
  "modId": 11967.0,
  "modName": "Humour of Skyrim Volume 2",
  "summary": "This mod adds some colour and humour to relieve the drab, bleak, colourless aspect of Skyrim.",
  "descriptionHtml": "Humour of Skyrim Vol. 2\r\n\r\nAfter many emails and messages (which surprised me with a mod of this type), we decided to do another \\\"Humour of Skyrim\\\" mod. This mod adds to the original \\\"Humour of Skyrim\\\" mod.  If you have the original one installed, this one will overwrite everything and add the new material.  You don\\'t need any previous files as this one is stand-alone.\r\n\r\nThis mod addresses the drab, bleak colourless aspect of Skyrim.  I won\\'t say \\\"humourless\\\" this time.  \r\n\r\nYou should have some fun with the ads and locating the items.  Every advertised item is in the game as suggested by the ads (except for one...and you will know which one when you see it).  Each item has something special about it (powers, etc), so they are not worthless curiosities.\r\n\r\nIf you are the type who uses fast-travelling extensively, you may not get the full benefit of this mod.\r\n\r\n\r\n========================\r\nINSTALLING/UNINSTALLING\r\n========================\r\n\r\nDue to the fact that there are so many mod managers now (Workshop, Curse, NMM, etc.) we are just going to stick with the tried and true, \\\"drag-and-drop-to-the-data-folder\\\" method.  Some mod managers will pick up the .7z file with its directory structure and install it automatically.\r\n\r\nTo install:\r\nUnpack with \\\"7-zip\\\" (or similar). Drag and drop the contents of the mod into your \\\"...skyrim/data/\\\" folder.  \r\n\r\nIf you have the earlier \\\"Humour of Skyrim\\\" mod, it will ask if you want to overwrite/merge existing files.  Choose \\\"yes\\\".\r\n\r\nOr a compliant mod manager can be used.\r\n\r\nTo uninstall:\r\nDelete the files (listed in the readme) installed by the mod.  Or use your mod manager if it supports uninstalling.\r\n\r\n\r\n========================\r\nFILES\r\n========================\r\nSee the readme.txt as the list got too long to place here.\r\n\r\n\r\n========================\r\nCREDITS and PERMISSIONS\r\n========================\r\n\r\nNancy Krantz...artwork and conception\r\nBrad Meeks...more artwork and conception\r\nAndrew Clements...Nifskope and creation kit work. (you might call me a \\\"mesh\\\"ed up, \\\"normal\\\"ised, \\\"alpha\\\" male...with lots of \\\"texture\\\".)\r\nBethesda...game, creation kit, commitment to great gaming.\r\n\r\nAnyone is welcome to use any part of this mod however they would like.  No credits or permissions are needed.",
  "categoryId": "28",
  "version": "2.0",
  "author": "Andrew Clements et al",
  "createdUnix": "1330775226",
  "updatedUnix": "1330775523",
  "containsAdultContent": false,
  "uploadedBy": "AndrewClements",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39539",
      "name": "Humour of Skyrim Volume 2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15571",
      "fileName": "Humour of Skyrim Volume 2-11967-2-0.7z",
      "uploadedUnix": "1330775523",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/cc432d24c16c8b40c888f776397f65e471167c3d27ff6711cd5aef17f17a1c0b/analysis/1406727173/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Humour%20of%20Skyrim%20Volume%202-11967-2-0.7z?fid=39539&ttl=1535773497&ri=8192&rs=8192&setec=18d4d231a7a5d49fe598c095a3427c8d"
    }
  ]
}