{
  "modId": 11960.0,
  "modName": "Birds and Flocks  - Traduzione Italiana",
  "summary": "This is only a translation into Italian of the original mod.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/downloads/file.php?id=11555] Birds and Flocks [/url].\r\nThe original mod will add in dozens and dozens more instances of birds that fly away when startled by either the player or another creature. The effect is one that already exists in the game but was used very rarely, so it expanded its use. \r\nThis mod also adds in many more circling birds of prey along cliffs, tundras, forests, and mountain ranges, and now includes more bats in dungeons!\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size][/center]\r\n\r\nQuesta interessante mod fa in modo che vediate non un solo sporadico uccello in volo per i cieli di Skyrim, ma veri e propri stormi così come dovrebbe essere in realtà. Include anche più pipistrelli nei dungeons.\r\n\r\n[color=GREEN][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n[color=RED]Nel pachetto .zip è inserito anche l\\'addon per Heartfire![/color]\r\n\r\n[color=GREEN][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!",
  "categoryId": "74",
  "version": "2.4",
  "author": "Andre7890",
  "createdUnix": "1330771294",
  "updatedUnix": "1330771294",
  "containsAdultContent": false,
  "uploadedBy": "Andre7890",
  "primaryFile": null,
  "files": []
}