{
  "modId": 11970.0,
  "modName": "Night Eye - Enchantment Potion Spell - multilingual",
  "summary": "This mod adds an enchantment (in form of a necklace), a spell and potions with the Night Eye effect. All effects (including the already existing race powers) are compatible with each other. Includes string files for CZ, EN, FR, DE, IT, PL, RU and ES.\r\n\r\nOptional: No casting sound, unlimited duration of power, no blur and less blue tint.",
  "descriptionHtml": "-------------------------\r\n[b]1. Quick Overview[/b]\r\n-------------------------\r\n* Adds a Night Eye enchantment in form of a necklace.\r\n* Adds four Night Eye potions with different durations.\r\n* Adds a Night Eye spell which is an Illusion Adept spell.\r\n* Adds a spell called Night Eye Dispel which allows the immediate removal of the Night Eye effect.\r\n* All of the things mentioned above can be bought from merchants or found in the world by chance.\r\n* [u]Optional:[/u] No casting sound, unlimited duration of power, no blur and less blue tint.\r\n* Compatible with Headbomb\\'s Better Sorting and Valdacil\\'s Item Sorting.\r\n* Multilingual: Czech, English, French, German, Italian, Polish, Russian and Spanish supported.\r\n\r\n\r\n-------------------------\r\n[b]2. Description[/b]\r\n-------------------------\r\nI think other races besides Khajiits (Vampires or Werewolves) should have access to the Night Eye effect like in previous TES games. An enchantment, a spell and potions with the Night Eye effect is added with this mod. Of course, Khajiits should still have an advantage with their racial power. Therefore, the effect of the enchantment, potion and spell is weaker than the one of the racial power and the spell lasts shorter than the racial power. Additionally, it costs you money to obtain the effect or you need luck if you are not a Khajiit.\r\nAll four sources (enchantment, potion, power, spell) are compatible with each other. E.g. if you drink the potion and then cast the spell the effect from the potion is removed and the effect from the spell is applied. The Night Eye effect from the enchantment has the highest priority, i.e. if you wear an item with the enchantment, and then use another source, then the effect of this source won\\'t be applied. If you have an active Night Eye on you, and then put on an item with the enchantment, then the active effect is removed and the enchantment is applied. It might sound complicated, just try it out!\r\n\r\n[b]Necklace of Night Eye:[/b]\r\nThis Necklace will give you a permanent Night Eye effect if worn. The necklace is disenchantable, so you can apply the effect to other items as well. It can be found at merchants and in the world by chance similar to the Necklace of Waterbreathing. Additionally, Calcelmo in Understone Keep in Markarth and Nelacar in The Frozen Hearth in Winterhold sell the Necklace. It is not cheap since it should be a little bit rewarding to acquire it.\r\n\r\n[b]Night Eye potions:[/b]\r\nThere are four potions granting you 15, 30, 45 and 60 seconds of the Night Eye effect. They can be found at alchemists by chance similar to the Waterbreathing potions based on your level. Additionally, Arcadia in Whiterun sells at least six potions. During the installation you can choose between potions weighing 0.5 and 0.1.\r\n\r\n[b]Night Eye Spell:[/b]\r\nThis is a level 50 (Adept) Illusion spell and lasts 45 seconds. It is an adept spell because not everyone should be able to cast it. Using this spell will train your Illusion Skill, but it will be slow. The corresponding spell tome can be bought from wizards specialized in Illusion (e.g. Drevis Neloren in the College of Winterhold).\r\n\r\n[b]Night Eye Dispel:[/b]\r\nThis spell will remove any Night Eye effect not coming from an enchanted item in case you do not want to wait until the timer runs out. This spell is free to cast and the corresponding spell tome can be bought at any merchant selling spell tomes.\r\n\r\n[b]Optional Adjustments:[/b]\r\nYou can choose to remove the casting sound if it annoys you {no_sound}. The duration Night Eye power (not the spell!) can be made unlimited {no_duration_of_power}. Additionally, you can remove the blur {no_blur} of the effect and reduce its blue tint {less_blue_tint}. The name of the folder with the corresponding file is written inside the curly brackets.\r\n\r\n[b]Sorting mods:[/b]\r\nA version where the potions and spell tomes are named according to [url=http://skyrim.nexusmods.com/downloads/file.php?id=2730]Headbomb\\'s Better Sorting[/url] or [url=http://skyrim.nexusmods.com/downloads/file.php?id=4873]Valdacil\\'s Item Sorting[/url] is included. It is English only because I do not know how others translated these mods.\r\n\r\n[b]Multilingual:[/b]\r\nString files for Czech, English, French, German, Italian, Polish, Russian and Spanish language are included. I.e., there will be no English text in your localized game version (one exception, see notes below). If you use another language or have problems with the localized version, you can use the non-localized version.\r\n\r\n\r\n-------------------------\r\n[b]3. Compatibility[/b]\r\n-------------------------\r\n* Not compatible with any mod that changes the original Night Eye magic effect [NightEyeEffect] / [6B10C].\r\n* If only the underlying imagespace modifier is altered, there will be no problem.\r\n* Probably not compatible with mods that use the original Night Eye magic effect [NightEyeEffect] / [6B10C]. But there should be no need to use such a mod if you install this one.\r\n* The Night Eye racial powers (Khajiit, Vampire, Werewolf) are unchanged only the underlying magic effect and script are changed. Therefore, there should be no problem with mods that alter these powers.\r\n* Not compatible with any mod that changes the leveled lists of potions and spells. If you use such a mod nonetheless, the potions and spells will probably not show up at the merchants or in the world. You could still obtain them with the console.\r\n\r\n\r\n-------------------------\r\n[b]4. Installation[/b]\r\n-------------------------\r\n[color=orange][b]IMPORTANT: Make sure that you have no savegame with an active Night Eye effect on you when you install this mod![/b][/color]\r\n\r\na) Automatic installation with Nexus Mod Manager ([b]strongly recommended[/b])\r\n1) Download the mod with the Nexus Mod Manager (or open the downloaded archive with the Nexus Mod Manager).\r\n2) Activate the mod and follow the instructions. Read the descriptions carefully.\r\n3) Make sure that the optional file concerning sound and/or duration is loaded after the main file.\r\n\r\nb) Manual installation\r\n1) Extract the archive.\r\n2) Copy the contents of the [i]Main[/i] folder into your [i]Skyrim\\\\Data[/i] directory (i.e., the location of your [i]Skyrim.esm[/i]).\r\n3) If you want a different version, open the Alternative_esps folder, choose your version, open the corresponding folder and copy the esp file into your [i]Skyrim\\\\Data[/i] directory. \r\n3a) Normal Weight means potions weigh 0.5, Light Weight means 0.1.\r\n3b) Better Sorting/Valdacil\\'s Item Sorting means that potions are named according to the Better Sorting/Valdacil\\'s Item Sorting mod, respectively. These version are English only.\r\n4) The files for the optional adjustments are located inside the [i]Optional_esps[/i] folder. Choose only one sound/duration (No. 1) as well as blur/tint (No. 2) version and copy the corresponding esp files into your [i]Skyrim\\\\Data[/i] directory.\r\n5) Activate the file [i]NightEye_Ench+Potion+Spell.esp[/i] and any optional esp files in the launcher under \\\"Data Files\\\".\r\n6) Make sure that the optional file concerning sound and/or duration is loaded after the main file.\r\n\r\n\r\n-------------------------\r\n[b]5. Deinstallation[/b]\r\n-------------------------\r\n[color=orange][b]IMPORTANT: Make sure that you have no savegame with an active Night Eye effect on you when you deinstall this mod! The effect might get stuck on you![/b][/color]\r\n\r\na) Automatic Deinstallation with Nexus Mod Manager\r\n1) Deactivate the mod in the Nexus Mod Manager\r\n\r\nb) Manual Deinstallation\r\n1) Go to your [i]Skyrim\\\\Data[/i] directory (i.e., the location of your [i]Skyrim.esm[/i]).\r\n2) Remove in this directory the files [i]NightEye_Ench+Potion+Spell.bsa[/i] and [i]NightEye_Ench+Potion+Spell.esp[/i].\r\n3) Remove any optional esp file you installed, they all begin with [i]NightEye_Ench+Potion+Spell[/i].\r\n\r\n\r\n-------------------------\r\n[b]6. Notes[/b]\r\n-------------------------\r\n* I tried to balance the costs for necklace, potions, spell and spell tomes such that you have to do some work to obtain one of these.\r\n* Maybe the Night Eye effect is too weak depending on your lighting settings. Tell me if this is the case.\r\n\r\n* If you want more languages included, I need the appropriate string files/translations.\r\n* The sentence \\\"Dispels Night Eye effect not coming from an enchanted item.\\\" is not translated (except German), since I do not want to produce non-sense with an Internet translator. Feel free to provide a translation.\r\n* Also, the translation of Night Eye Dispel might be incorrect. Feel free to provide a correct translation.\r\n\r\n\r\n-------------------------\r\n[b]7. Version History[/b]\r\n-------------------------\r\nv1.02: Added options for no sound, unlimited duration of power, no blur and less blue tint\r\nv1.01: Added support for Valdacil\\'s Item Sorting\r\nv1.00: Initial release\r\n\r\n\r\n-------------------------\r\n[b]8. Thanks[/b]\r\n-------------------------\r\nThanks to Bethesda for the Creation Kit and the developers of [url=http://skyrim.nexusmods.com/downloads/file.php?id=5064]TESVSnip[/url] and [url=http://skyrim.nexusmods.com/downloads/file.php?id=2889]Skyrim Strings Localizer[/url].",
  "categoryId": "75",
  "version": "1.02",
  "author": "Lambda",
  "createdUnix": "1330780911",
  "updatedUnix": "1331075517",
  "containsAdultContent": false,
  "uploadedBy": "Lambda",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39551",
      "name": "Night Eye - Enchantment Potion Spell - multilingual",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "127",
      "fileName": "Night Eye - Enchantment Potion Spell - multilingual-11970.zip",
      "uploadedUnix": "1330781761",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/af9679b31156f584b1278bbed1dd5c977f610889f608f2d7c500c11cb2c43f6b/analysis/1406727175/",
      "changelogHtml": " Initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Night%20Eye%20-%20Enchantment%20Potion%20Spell%20-%20multilingual-11970.zip?fid=39551&ttl=1535773501&ri=8192&rs=8192&setec=aa5faa433cf4fa1115d1d3f6e0b6f033"
    },
    {
      "fileId": "40460",
      "name": "Night Eye - Enchantment Potion Spell - multilingual - 1-0-1",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "133",
      "fileName": "Night Eye - Enchantment Potion Spell - multilingual - 1-0-1-11970.zip",
      "uploadedUnix": "1330969809",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/d0a9df03fdd3a2f134dfde3c63f0383c9d9af4bdd37bcf86deffa959d1c4f3bd/analysis/1406732944/",
      "changelogHtml": " Added support for Valdacil\\'s Item Sorting <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Night%20Eye%20-%20Enchantment%20Potion%20Spell%20-%20multilingual%20-%201-0-1-11970.zip?fid=40460&ttl=1535773501&ri=8192&rs=8192&setec=7bc0179ffaf6e9efcf610353bca4ccda"
    },
    {
      "fileId": "40866",
      "name": "Night Eye - Enchantment Potion Spell - multilingual - 1-0-2",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "149",
      "fileName": "Night Eye - Enchantment Potion Spell - multilingual - 1-0-2-11970.zip",
      "uploadedUnix": "1331075517",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/c38436a59932912374e9f7233aa1fab35bac7610fe560760e716b28b5557509d/analysis/1406735241/",
      "changelogHtml": " Added options for no sound, unlimited duration of power, no blur and less blue tint <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Night%20Eye%20-%20Enchantment%20Potion%20Spell%20-%20multilingual%20-%201-0-2-11970.zip?fid=40866&ttl=1535773502&ri=8192&rs=8192&setec=5c2f0d6fd1ea8d3cf0312ea2fd6f1a40"
    }
  ]
}