{
  "modId": 11978.0,
  "modName": "Multiclass Manager",
  "summary": "Create multiple *classes* on a single Skyrim character. Each class may level-up independently and have separate Skills, Perks, Health, Stamina, Magicka! Edit skills, transfers skills between classes, or merge the best skills back together again later! Character level (and therefore enemy levels!) are automatically recalculated when switching classe",
  "descriptionHtml": "Create multiple *classes* on a single Skyrim character. Each class may level-up independently and have separate Skills, Perks, Health, Stamina, Magicka! Edit skills, transfers skills between classes, or merge the best skills back together again later! Character level (and therefore enemy levels!) are automatically recalculated when switching classes.\r\n\r\ne.g. You could level up (1-81) multiple times, perhaps as a Warrior, Mage, and Thief, and have enemies scale up with you each time.\r\n\r\n----------------------------------------------------------------------------\r\nBackground:\r\n\r\nI created this utility because I levelled my character from 1-46 as a shield warrior/paladin very quickly, and I wanted to try out different styles of character, such as mage, thief & assassin, without having to start a brand new game. \r\n\r\nI wanted to go to the Mage College, and learn how to fight as a pure mage, and then on to the thieves guild to learn how to play as a stealth character. However, because I was already level 46, whenever I tried to fight using pure mage (using my puny 17 destruction!) or stealth guy (32 stealth), I\\'d get annihilated in seconds by high-level creatures way beyond my low-level magic & stealth abilities! \r\n\r\nI didn\\'t want to start a new game, because I was only 5-10% through the content. So, I wished that could temporarily \\\"forget\\\" my warrior skills and become a low-level mage, level-up through the mage\\'s college as a pure mage, and then later do the same as a thief/assassin, at the thieves guild and dark brotherhood! \r\n\r\nThe Skyrim Multiclass Manager is a utility that enables you to do exactly these things :)\r\n\r\nFurther, because Skyrim scales the level & strength of enemies based upon your current level, when you switch to a lower-level class, then the enemies scale-down with you!\r\n\r\n----------------------------------------------------------------------------\r\nFeatures:\r\n\r\nThe Skyrim Multiclass Manager utility runs outside the Skyrim game, and has the following features:\r\n\r\n- Create as many \\\"classes\\\" as you like.\r\n- Switch between classes, at will.\r\n- Each class has separate perks, skills, strength, magicka, and stamina, and LEVEL!\r\n- The level of a class is automatically calculated based upon its skill levels (just like normal in Skyrim).\r\n- You can edit skills directly in the Manager, and therefore start a class at any level you like!\r\n- You can duplicate classes, and strip out skills you don\\'t want in that class.\r\n- You can merge all the highest skills from all your classes, into a single mega-class!\r\n\r\nMulticlass Manager generates a Skyrim Console Batch file, which you can easily execute with a single command, in order to change your class.\r\n\r\n----------------------------------------------------------------------------\r\nInstallation\r\n\r\nDownload and unzip ZIP file.\r\nClick the MSI file, to install the MultiClass Manager Utility\r\nIf you don\\'t have it already, then you will need to download the \\\"Microsoft .NET Framework 4 Client Profile\\\" from Microsoft. The installer should do this for you. In case it doesn\\'t the link is:\r\n\r\nhttp://www.microsoft.com/download/en/details.aspx?id=24872\r\n\r\n\r\n----------------------------------------------------------------------------\r\nWish List\r\n\r\n- Add support for custom Races.\r\n- Add support for custom Skills.\r\n- Add a check box to the Class window that allows skills to be set from 1-255.\r\n\r\n----------------------------------------------------------------------------\r\nRelease History\r\nv1.0.0 - 03Mar2012 - First release.\r\nv1.0.1 - 04Mar2012 - Added a Skill Points Spent total to the Class Window.\r\nv1.0.2 - 08Mar2012 - User interface re-skinned.",
  "categoryId": "73",
  "version": "1.0.2",
  "author": "Peter Hughes",
  "createdUnix": "1330787969",
  "updatedUnix": "1331239731",
  "containsAdultContent": false,
  "uploadedBy": "peterhughes",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41452",
      "name": "Skyrim Multiclass Manager Setup ZIP 1 0 2",
      "version": "1.0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "436",
      "fileName": "Skyrim Multiclass Manager Setup ZIP 1 0 2-11978-1-0-2.zip",
      "uploadedUnix": "1331239731",
      "modVersion": "1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/05f29a5f6fa2306bd8baf6323fa9efb0c508bc7eee7b4180253d131b507c0438/analysis/1406738358/",
      "changelogHtml": " 08Mar2012 - User interface re-skinned. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Multiclass%20Manager%20Setup%20ZIP%201%200%202-11978-1-0-2.zip?fid=41452&ttl=1535773517&ri=8192&rs=8192&setec=5f94dd7652a3631868f733cacd711803"
    }
  ]
}