{
  "modId": 11983.0,
  "modName": "Weapons Of The Shogunate 1_06",
  "summary": "18 versions of 11 authentic base Japanese weapons from the Edo period. Plus the old daedric artefacts Goldbrand and Eltonbrand.",
  "descriptionHtml": "WHAT IT DOES\r<br />\r<br />It adds a few Edo era Japanese... err... I mean, Akaviri weapons, because you can never have enough katanas in a game ;)\r<br />\r<br />The weights, speed and damage are loosely based on the existing Akaviri katana in the game, and my own extrapolations for the other weapons than the katana. Most weapons are fairly fast, especially the two handed katana and ninjato, which offer a completely different two-hander experience from the normal game weapons. They&#39;re also all set to silent for detection, since, well, if it was silent enough for the ninja, it&#39;s silent enough for me.\r<br />\r<br />All weapons except the naginata have custom lacquered scabbards.\r<br />\r<br />All weapons need steel and firewood to craft, and the ones with wrapping on the hilt also need linen wraps. So you might need to raid some tomb for linen if you want to craft them.\r<br />\r<br />The weapons are: katana, wakizashi, zanbato (big two-hander sword used against cavalry), nagamaki, naginata, kikuchi yari, two types of tanto, and two types of ninjato. They&#39;ll be described in more detail in another section at the end of this readme. Bonus weapons: Goldbrand from Morrowind and Skyrim, and Eltonbrand from Morrowind.\r<br />\r<br />\r<br />RETEXTURING AND MODDING\r<br />\r<br />As most of my mods, it&#39;s designed for ease of retexturing, so the textures are separate pieces, and the mapping such that you can just swap in some other material. This is probably less easy to do for the blade, unless you&#39;re willing to lose the hamon, though even there it&#39;s possible if you want to end up with a more simple metal blade.\r<br />\r<br />You can however safely replace similar textures included in the mod with each other. E.g., if you want a tsuka (handle) with black fittings instead of yellow, you can just replace the Tsuka.dds file with the NinjatoTsuka.dds, and suddenly the katana, ninjato and nagamaki will have black at the ends of the tsuka too. Similarly you can replace the RoundTsuba.dds with the NinjatoTsuba.dds to remove the yellow star on the guard (though the star-shaped indentation will remain.) The same can be copied over Habaki.dds to get a steel blade sleeve like the ninjato has instead of the yellow one.\r<br />\r<br />The mesh pieces are separate too, somewhat like in Neverwinter Nights 2, so if you&#39;re not affraid to copy nodes around in NifSkope, you can mix and match. Katana with square guard? Wakizashi blade on the pole on my Roman Spear? Ninjato blade on an Epix Dagger hilt? You can do that. It&#39;s just copy-and-paste exercises, in fact.\r<br />\r<br />\r<br />HOW TO GET IT\r<br />\r<br />A chest containing one of each weapon and variant except Goldbrand and Eltonbrand is in the Skyhaven Temple, near Alduin&#39;s Wall. Seemed like the most logical place to find ancient Akaviri weapons. The chest IS locked, but it&#39;s a novice-level lock, so it takes no skill to open it. Still, bring a lockpick or two.\r<br />\r<br />Alternatively, you can craft them. As mentioned, you might need to raid a tomb for linen wraps for the tsuka, though. (Nobody said they&#39;d be trivial to get.)\r<br />\r<br />Goldbrand can only be obtained from the priest of Boethiah involved in the haunted house quest in Markarth, either stealing it from him or looting the body at the end. Backstabbing Boethiah&#39;s champion to steal their weapon is really what Boethiah would have wanted. (If you already missed that opportunity, type &#34;help goldbrand&#34; in the console without the quotes, and &#34;player.additem xxxxxxxx 1&#34; to give it to yourself, where xxxxxxxx is the item id that the previous command showed.)\r<br />\r<br />Eltonbrand can only be obtained by taking the daedric smithing perk and upgrading Goldbrand at a forge. Look for it under the &#34;Daedric&#34; category. (Or via the console like above.)\r<br />\r<br />\r<br />HOW TO INSTALL IT\r<br />\r<br />Extract the archive, with directories, in your &#34;Data&#34; folder. Select it in the list of plugin files in the launcher.\r<br />\r<br />\r<br />HOW TO UNINSTALL IT\r<br />\r<br />Delete the .esp file from your Data directory.\r<br />\r<br />Delete the WOTS directory in both the MeshesWeapon and TexturesWeapons directories.\r<br />\r<br />\r<br />CONFLICTS\r<br />\r<br />It shouldn&#39;t conflict with anything.\r<br />\r<br />\r<br />LICENSE\r<br />\r<br />I release it in the public domain. You can do anything you wish with it. I would, of course, appreciate it if you give credit, but if not, so be it, I can live with that too.\r<br />\r<br />\r<br />DETAILED WEAPON DESCRIPTIONS\r<br />\r<br />Warning: this is a lot of text. If you didn&#39;t come here for a history lesson or exact measurements down to the last inch, you may want to skip it. Just trust the crafting menu and the names and images of each weapon. If it says for example &#34;naginata&#34; and looks like a blade on a pole, chances are it will simply be just that.\r<br />\r<br />The blades are made in shobu-zukuri style, which is to say, without a yokote line. Some have fullers (e.g., the katana or ninjato), some don&#39;t (the daggers and naginata).\r<br />\r<br />They are made of folded steel (hence the metal pattern), differentially hardened (hence the traditional white hamon along the edge), and as shiny and polished as the art of sword polishing historically got in this period. We&#39;re talking whole dynasties of specialized sword-polisher craftsmen.\r<br />\r<br />The folded or pattern welded steel is sometimes incorrectly called &#34;Damascus steel&#34;, but that&#39;s incorrect. The real Damascus steel is Wootz, an alloy where bands of high-carbon steel precipitate naturally during tempering. Japanese swords are not real Damascus steel, but really pattern welded steel. You know, folded and hammered repeatedly.\r<br />\r<br />The tsuka (handles) sport the traditional silk wrap that Japanese swords are well known for, and same (rayskin) based on actual photos of old rayskin in disassembled old swords. Note however that white rayskin was only used in times of peace, for ceremonial guard duty, and so on. Rayskin is very easily damaged by water, for example from rain, so if you had to go to war or such, you&#39;d disassemble the hilt and put in rayskin covered in black lacquer. The actual wrapping, though, is hand-drawn.\r<br />\r<br />The tsuba (guard) is based on a historical Edo era tsuba, made of steel with inlaid gold, except for the ninjato where you wouldn&#39;t want such shiny decorations. Historically speaking, such plain disc tsuba were not just more common than the ellaborate metal doilies, but actually mandatory for samurai on ceremonial guard duty, at least when they had to do it at the shogun&#39;s palace. In fact, they weren&#39;t even allowed any other decoration than a small cutout of the family mon (crest.) The rest of the time, decorative engravings were used extensively though, and many of the more abstract ones (like this one) were based on the numbers 4 and 8, because of their significance in Buddhism. E.g., some form of 8-point star or 8-spoke wheel, or really anything with 8, would mean the Noble Eightfold Path. Anything with 4 was the Four Noble Truths. Sometimes they were combined, for example as an 8-point star made of two squares.\r<br />\r<br />Note that when discussing the dimesions below 1 shaku is very very close to 1 foot, so you can take the dimensions pretty much 1 to 1 when comparing to japanese standards.\r<br />\r<br />\r<br />1. A katana. This is probably the weapon that needs the least introduction.\r<br />\r<br />This one got an approximately 2.3 shaku long blade, which actually makes it a fairly average katana. Most katanas are under 2.4 shaku, some significantly under. There is no fixed length though. To be a proper katana, it can be anywhere between 2 shaku (under that, it becomes a wakizashi), and 3 shaku (over 3 shaku, it becomes an odachi.) The blade is about 1.2 inch (1 sun) wide and a little under a quarter of an inch thick, both of which are fairly average. And, of course, it sports a gentle curve, largely because that&#39;s what happens when you differentially harden a single-edge sword.\r<br />\r<br />You get a choice of single-handed or two-handed katana. Both are the same weapon, but it&#39;s flagged differently so the game knows if you want to hold it with one hand or both hands. The two-handed one doesn&#39;t become slow and hard-hitting like the normal two handers. It gets a smaller boost in base damage than the vanilla two-handers (it&#39;s the same weapon, after all), but also get a boost in speed, becoming a fast weapon. This also means that the base damage number shown in the inventory will be lower than for the normal massive two-handers. But because of the speed, it actually has very good dps.\r<br />\r<br />Furthermore, the single-handed katana is also available in a &#34;daisho&#34; (long and short) scabbard version, basically meaning that it has a sheathed wakizashi attached to the scabbard. The second sword cannot actually be used, and technically it doesn&#39;t even have a blade, but is there for the looks. That way you can look like you&#39;re wearing both swords, like a real samurai, not just one sword like a lowly ashigaru. Of course, since the scabbard for the offhand weapon isn&#39;t shown, you can always equip a wakizashi in the off-hand, Musashi style, and pretend it goes in the second scabbard when you sheathe your weapons.\r<br />\r<br />\r<br />2. A wakizashi, the side-arm for personal defense indoor and in other spaces where a katana would have been less practical. Also, the only sword allowed for Ashigaru.\r<br />\r<br />It&#39;s got a blade that&#39;s about 1.8 shaku in length, which means it doesn&#39;t miss qualifying as a katana itself by much. Blade width and thickness are just like for the katana above.\r<br />\r<br />It has the same tsuba as the katana, and a shorter handle, as was generally the case for wakizashi, since they were strictly one-hand weapons.\r<br />\r<br />In the game, the wakizashi has a little less base damage than the one-handed katana, but is a little faster, so it all multiplies to roughly equal DPS.\r<br />\r<br />\r<br />3. A zanbato, or &#34;horse slaying sword&#34;. And I mean the historical weapon, not the oversized anime one. And yes, the weapon is actually historical, but its use on the battlefield is disputed. It&#39;s likely a Japanese re-imagining the Chines Zhanmadao, also meaning &#34;horse slaying sword&#34;, especially since it&#39;s written with the exact same characters as the Chinese one. Although it&#39;s often hyped as being able to cut a horse and its rider in one stroke, that&#39;s highly unlikely given that at least the rider would wear samurai armour after all. But, as I was saying, we don&#39;t know exactly how it was used on the battlefield, if at all. If it was used anything like the Chinese one, for that one the soldiers were trained to kneel on one knee when charged and slice one leg off the horse, then finish off the rider after he hits the ground.\r<br />\r<br />By the Edo era, at any rate, it was not used as a military weapon any more, though some oversized zanbato and nodachi were produced as proof of a smith&#39;s skill or as offerings to shrines. And of course some people still kept their ancestors&#39; blade around, for example in their shinto shrine.\r<br />\r<br />It&#39;s one of the few Japanese swords that actually has an unsharpened ricasso, about 1 to 1.5 shaku in length (1 shaku on this one), so one can grip the blade and use it as a short spear.\r<br />\r<br />This one has a 4 shaku long odachi blade, and about 1.5 inch wide. Like the tachi and nodachi, historical examples are all over the place, with some blades as long as 12 shaku (ft) and probably too impractical to actually use in a battle, while others were barely long enough to qualify as an odachi.\r<br />\r<br />In game, it&#39;s only marginally faster than vanilla two-handers, and thus only marginally penalized in base damage. However, it actually out-dps-es the two-handed katana and nagamaki, but only marginally. As you&#39;d expect from something this size, it has very high reach, which was after all its whole reason to exist. It also has the highest stagger chance of these weapons, together with the naginata.\r<br />\r<br />\r<br />4. A nagamaki. The nagamaki is an interesting polearm, in that it basically has a long katana grip that is actually wrapped all the way. Even the name means &#34;long wrap.&#34; The blade is also a full sized katana or nodachi blade, and slender like one, instead of the shorter and wider blade on a naginata.\r<br />\r<br />So, as you&#39;d expect, it sports the same tsuba and tsuka as the katana, only it&#39;s a much longer tsuka.\r<br />\r<br />This is actually one of the shorter nagamaki, but you do have to wield it in cramped hallways. It has about 2.5 shaku worth of blade length, and about 1.35 inches broad, with an about 2 shaku handle. The more typical ones were a little longer in both blade and hilt, but they were used on open battlegrounds against cavalry.\r<br />\r<br />In the game, the nagamaki has not much higher base damage than the two-handed katana, but is also only not much slower. It is in any case much faster than the vanilla game two-handers, but less harder hitting as base damage. It makes up in DPS because of the speed, so don&#39;t be discouraged if the numbers shown in the inventory or crafting menu seem a bit low.\r<br />\r<br />\r<br />5. A naginata, the better known Japanese polearm. Until the 15&#39;th century it was the main polearm on the battlefield. However, it required lots of training and stamina to use well, and the rise of the cheap ashigaru troops also meant giving them little training or even no training at all. It was cheaper and more effective to just give them a yari (straight-tipped spear) and tell them to keep the pointy end aimed at the enemy. So by the Edo period, the naginata was completely phased out as a military weapon, and was relegated to the role of self-defense weapon for samurai women and girls. The rationale being that a woman could use the extra range and cutting power to keep an attacker at bay. Anyway, now you too can fight like a girl ;)\r<br />\r<br />This one is a fairly typical naginata, with a slightly less than 2 shaku blade that starts relatively straight, but curves more towards the tip. It also widens slightly before starting to taper towards the tip again. It has a 4 ft pole which, again, is actually pretty typical for an Edo period woman&#39;s naginata.\r<br />\r<br />\r<br />6. A yoroidoshi, a.k.a., &#34;armour piercer&#34;, a style of tanto especially designed for piercing through armour. I.e., the Japanese idea of a stiletto. It has a relatively thick blade, some even go all the way to half an inch at the base, a straight back and a more tapered tip.\r<br />\r<br />This particular one has a 0.3 inch thick blade and 1.2 inch (1 sun) wide, and almost 1 shaku long. I.e., it&#39;s one of the largest tanto ever made.\r<br />\r<br />It is made in aikuchi mounting style, which is to say, without a tsuba and with typically a non-wrapped tsuka. This style got very popular for tanto in the Edo period, which is to say, the period I&#39;m modelling here. For this one, I gave it a black lacquered wooden handle.\r<br />\r<br />Damage-wise, it does less damage than a katana, but is faster, so it works out to about the same dps.\r<br />\r<br />\r<br />7. A chiisagatana style tanto. The term, meaning &#34;short katana&#34; meant different things at different times, e.g., originally it meant what we now call &#34;katana&#34;. But by the Edo period, it meant a tanto which has a tsuba and usually a tsukamaki (wrapping on the grip), like a katana. You know, as opposed to the aikuchi style that had become more common for tanto.\r<br />\r<br />It has a 0.7 shaku long blade, about 1 inch wide at the base, and a little less than 0.2 inch thick.\r<br />\r<br />Damage-wise, it does less damage than a katana, but is faster, so it works out to about the same dps.\r<br />\r<br />\r<br />8. A ninjato, i.e., &#34;ninja blade.&#34; It&#39;s a shorter and much less curved katana, only about 1.8 shaku blade length, with a square tsuba and a full-sized katana hilt.\r<br />\r<br />While it&#39;s inevitable that a differentially forged sword will curve a little, it can be actually very little, and it can be even further reduced during polishing. There are historical blades, especially from the Sengoku Jidai, with as little as 0.1 inch sori. (Maximum difference between the back arc and a straight line.) Which is very nearly straight.\r<br />\r<br />Making a historically accurate ninjato has the problem that nobody in that era wrote about ninja blades, or indeed ever used the terms &#34;ninjato&#34; or &#34;ninja ken&#34; or &#34;shinobigatana.&#34; Which made some people flat-out proclaim, &#34;ninjatos didn&#39;t exist&#34;, which is actually both technically true and technically false. While indeed there is not a single mention of a &#34;ninjato&#34; or &#34;shinobigatana&#34; in period texts, that&#39;s also because medieval times didn&#39;t have a branding mania like modern times. Even for the European blades, it didn&#39;t actually occur to anyone before Oakeshott to actually classify the blades (Petersen classification mostly classified the hilt.) A sword was a sword. You could add some descriptive adjectives like &#34;long sword&#34; or &#34;big/great sword&#34; or &#34;old sword&#34;, but that was not a typology. So it was for the japanese too: a katana was a katana. All the elements that nowadays are associated with ninja swords (square guards, little curvature, shorter blades, carrying on the back, etc,) are well supported by actual weapons, and existed all right. Just nobody would call it a &#34;ninja sword&#34;, they&#39;d just call it a &#34;katana.&#34; And, technically, they weren&#39;t really used only by ninjas anyway, as many samurai used such swords too. Short version: it&#39;s a different but historical katana, really.\r<br />\r<br />Just like for the katana, you get a choice of single-handed or two-handed ninjato. Both are the same weapon, but it&#39;s flagged differently so the game knows if you want to hold it with one hand or both hands. It gets a smaller boost in base damage than the vanilla two-handers (it&#39;s the same weapon, after all), but also get a boost in speed, becoming a very fast weapon. This also means that the base damage number shown in the inventory will be lower than for the normal massive two-handers. But because of the speed, it actually has very good dps.\r<br />\r<br />Furthermore, the two-handed Ninjato is also available in a &#34;dual scabbard&#34; configuration. Basically the scabbard has an entire second ninjato attached to it, so you can look like you have two swords crossed on your back, like in some ninja movies. You can&#39;t actually use the second sword, and technically it doesn&#39;t even have a blade. It&#39;s just for looks.\r<br />\r<br />As of 1.02, the one-handed ninjato counts as a dagger for sneak kills, and the two-handed ninjato variants also got a boost in damage from sneak, so you have an incentive to play, you know, like a ninja.\r<br />\r<br />\r<br />9. A shinobigatana. A.k.a., &#34;ninja katana&#34;, which is really the Japanese reading of what the West calls a Ninjato. In this mod, it simply means a ninjato with a longer, katana-sized blade, or conversely a less curved katana with a square guard.\r<br />\r<br />The same historicity caveats apply as for the Ninjato. Swords identical to this actually existed during the Sengoku Jidai, but they&#39;d just be called &#34;katana&#34; and be generally used by normal samurai. And of course they&#39;d be illegal during the Edo period because of the square tsuba (hand guard.)\r<br />\r<br />It&#39;s available in one handed versions, two handed, daisho (long and short ninjato on the hip), and dual scabbard (two-handed on the back). For the daisho and dual scabbard versions, basically the scabbard has an entire second ninjato attached to it, so you can look like you have two swords, like in some ninja movies. You can&#39;t actually use the second sword, and technically it doesn&#39;t even have a blade. It&#39;s just for looks. For the daisho version you can however equip the normal ninjato in the off-hand, and pretend it goes into the shorter scabbard when not in use.\r<br />\r<br />For the stats and materials, it&#39;s identical to the normal ninjato. Which also means that, just like the other ninjato, it&#39;s slightly weaker but faster than a katana in a standup fight, but it gets a massive bonus for stealth attacks. So you have an incentive to play, you know, like a ninja :p\r<br />\r<br />\r<br />10. A nodachi. Meaning &#34;field sword&#34; in the sense of &#34;war sword&#34;, the nodachi used to be the main weapon of the samurai before and all through the Sengoku Jidai, with the katana actually being the second sword. While people nowadays tend to think the katana is THE samurai weapon, actually the nodachi was fast, deadly and had the range too, and was the preferred war weapon of the samurai. After the Sengoku Jidai, though, maximum sizes were imposed on swords, and the nodachi became illegal to wear in public, which is really what it took to end its status as THE melee weapon of the samurai. Many were cut down to katana sizes, unfortunately destroying thousands of historical weapons, and destroying the smiths&#39; signatures on the tang, while some were kept in the family&#39;s shinto shrine just like the zanbato.\r<br />\r<br />Also known by the name of &#34;o-dachi&#34;, i.e., &#34;great sword&#34;, because of its blade length. Everything with 3 shaku or more blade length was an o-dachi by definition. The two names are not mutually exclusive, though. While &#34;o-dachi&#34; is a statement of size, &#34;nodachi&#34; is a statement of role or purpose.\r<br />\r<br />It&#39;s also what games like Oblivion called a &#34;Daikatana&#34;, which is the wrong reading of the Japanese signs for &#34;o-dachi&#34;. But, anyway, if you wanted your Blades member to wield a &#34;daikatana&#34; like in Oblivion, this is it.\r<br />\r<br />Also useful if you wanted to play a certain white haired Jenova&#39;s Witness ;)\r<br />\r<br />In this mod, it&#39;s almost identical to the zanbato, except without the ricasso. Basically if the ricasso bothered you, just use the nodachi instead.\r<br />\r<br />I also kept the straight grip, because although most had the hilt continue the curve of the blade, the game&#39;s animations are for grips curved in the opposite direction, so a proper tachi grip would cause even worse clipping problems with the left hand. It&#39;s not completely ahistorical, though, because many did have straight hilts.\r<br />\r<br />I gave it black fittings and black lacquered rayskin on the hilt, because, as I was saying, raw rayskin is easily destroyed by rain, and thus in the field they&#39;d replace the white rayskin with black lacquered rayskin. And this is a field sword. I also gave it an octogonal tsuba (handguard), just not to be TOO identical to the zanbato.\r<br />\r<br />\r<br />11. A kikuchi yari. As seen in the movie &#34;13 Assassins.&#34; It&#39;s a type of spear with a tanto blade for a tip, meaning it&#39;s sharpened only on one side. Unlike other kinds of yari, most of which CAN cut, but not too well, this one is excellent at cutting and was historically used for hacking and slashing. Which made it an obvious choice for a game where the animations are for cutting. It&#39;s also the only type of Japanese spear that has a habaki (blade sleeve) for the blade.\r<br />\r<br />By the sengoku jidai times, and even more so during the Edo period, this would be more commonly an ashigaru weapon, rather than a samurai weapon, although they ARE occasionally depicted in period texts and illustrations as being used even by very high ranking samurai.\r<br />\r<br />Note that the metal parts at the front of the shaft are not sockets, since this type of spear is tang-mounted like the naginata, not socket mounted. In fact, the mounting on this one, including the habaki, is pretty much identical to how a sword was fixed to the handle. The metal parts just hold the wood together around the long tang.\r<br />\r<br />Historically, this kind of spear would always have a saya (scabbard) for the tip, so it got one in this mod too.\r<br />\r<br />Since the game doesn&#39;t have proper spear animations, and holding it like a sword looks pretty bad, it is declared as a battleaxe in the game. For the materials and stats, it&#39;s identical to the naginata.\r<br />\r<br />It is gripped so close to the blade, hence sits so high on the back, because I wanted the blade to be roughly where the killmove game animations expect it to be. E.g., when hacking at someone&#39;s waist from behind, that you hack into them with the blade, not with the pole. I.e., it&#39;s fit to the game&#39;s existing animations, just like the rest of my weapons.\r<br />\r<br />\r<br />12: Goldbrand from Morrowind and Oblivion. It&#39;s really just a more angular tip Shinobigatana with a golden blade and a fire enchant. This is NOT a historical weapon, but is lore-conform for Skyrim. It can only be obtained via a vanilla quest arc. (Look for the haunted house in Markarth, do the quests and be sure to loot the corpse at the end. Or type &#34;help goldbrand&#34; into the console, and give it to yourself with player.additem)\r<br />\r<br />Once obtained, it can be freely converted between one-handed and two-handed versions at any forge, for no extra materials, since it takes no real reforging to convert a katana between holding it one-handed or using both hands. Any enhancements will be lost though.\r<br />\r<br />Unlike the other weapons, it can not be crafted and counts as a Daedric artefact weapon for enhancing. It also needs a gold bar to enhance.\r<br />\r<br />It IS more powerful than the other blades except Eltonbrand, but it already has an enchantment, so it can&#39;t be further enchanted, and you can&#39;t craft more.\r<br />\r<br />It has a massive backstab bonus, if you have the stealth perks, just like daggers. (Hey, Boethiah is the prince of backstabbing.) It also has the silver effect against undead.\r<br />\r<br />\r<br />13: Eltonbrand from Morrowind. It&#39;s an upgrade of Goldbrand with a sharper tip and increased damage, both base and enchantment. It can only be obtained by reforging Goldbrand into Eltonbrand at a forge. Goldbrand will be consumed in the process, so you can&#39;t have both without using the console. It needs a human heart and Daedric smithing. This is NOT a historical weapon.\r<br />\r<br />Once crafted, it can be freely converted between one-handed and two-handed versions at any forge, for no extra materials, since it takes no real reforging to convert a katana between holding it one-handed or using both hands. Any enhancements will be lost though.\r<br />\r<br />Unlike the other weapons, it can only be obtained by crafting it out of another quest weapon (Goldbrand) and counts as a Daedric artefact weapon for enhancing.\r<br />\r<br />This is a very powerful weapon, to reward those who both do side quests and invest in smithing perks.\r<br />\r<br />It has a massive backstab bonus, if you have the stealth perks, just like daggers. (Hey, Boethiah is the prince of backstabbing.) It also has the silver effect against undead.\r<br />\r<br />\r<br />VERSION HISTORY\r<br />\r<br />1.06:\r<br />\tAdded Goldbrand\r<br />\tAdded Eltonbrand\r<br />\r<br />1.05a:\r<br />\tFix for 2h ninjatos and shinobigatanas not advancing two-handed skill when used.\r<br />\tFix for the 1h non-daisho shinobigatana having the wrong 1st person record\r<br />\r<br />1.04:\r<br />\tAdded the shinobigatana, i.e., long ninjato\r<br />\tAdded the nodachi\r<br />\tAdded the kikuchi yari\r<br />\tMade the Zanbato (and Nodachi) handle a bit thicker and wider.\r<br />\tReplaced the white rayskin with black lacquered rayskin on all ninjatos (don&#39;t want the handle seen from a mile away)\r<br />\tMade the rayskin white instead of pink on the other swords\r<br />\tCorrected the rayskin texture stretching on all swords\r<br />\r<br />1.03:\r<br />\tRedone the katana (all 3 versions), wakizashi, ninjato (all 3 versions), nagamaki and zanbato blades\r<br />\tTweaked the blade textures again\r<br />\tShinier blades\r<br />\tMuch better blood on all blades\r<br />\tFlagged all 3 versions of the Ninjato as both dagger and sword, so they get the damage bonus from one-handed power enchantments on clothes AND a big stealth-attack bonus\r<br />\r<br />1.02:\r<br />\tThe Yoroidoshi and Chiisagatana are now correctly flagged as daggers, so you can get that 15x damage bonus when sneaking\r<br />\tThe Ninjato has also been internally flagged as a dagger, so you can 15x damage from sneak with it too. You shouldn&#39;t be penalized for playing a Ninja with a Ninjato, I figure.\r<br />\tThe 2h Ninjato and Dual Ninjato are kinda 2h daggers now. You can hit up to 7.5x from sneak with them.\r<br />\r<br />1.01:\r<br />\tRedone the naginata blade\r<br />\tRemoved the nicks in the blade on all blades\r<br />\tSlightly dirtier metal texture\r<br />\tRemoved the linen for crafting the yoroidoshi, since it has no wrapping\r<br />\tRedone the habaki (blade collar) on most blades, to better fit the new blades\r<br />\tAdded the chest, for people who can&#39;t or won&#39;t craft\r<br />\tTweaked the glossiness of the blades\r<br />\r<br />1.0:\r<br />\tFirst Skyrim release.\r<br />",
  "categoryId": "55",
  "version": "1.06",
  "author": "Moraelin",
  "createdUnix": "1330792403",
  "updatedUnix": "1392313406",
  "containsAdultContent": false,
  "uploadedBy": "Moraelin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39606",
      "name": "WeaponsOfTheShogunate_1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1097",
      "fileName": "WeaponsOfTheShogunate_1_0-11983.7z",
      "uploadedUnix": "1330792500",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/92b0cdfe9796669fae6f841a1d7d843c6ccbeee8cdef282d2864ba7b36a94f0e/analysis/1406727306/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WeaponsOfTheShogunate_1_0-11983.7z?fid=39606&ttl=1535773524&ri=8192&rs=8192&setec=7a96ce37837278629a20efe2fed92004"
    },
    {
      "fileId": "41293",
      "name": "WeaponsOfTheShogunate_1_01",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1065",
      "fileName": "WeaponsOfTheShogunate_1_01-11983-1-01.7z",
      "uploadedUnix": "1331200469",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/9cc03e191dfc6acc43745077b7b0dd90b7a397d56c4c1d5139f731590f42b356/analysis/1406737391/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WeaponsOfTheShogunate_1_01-11983-1-01.7z?fid=41293&ttl=1535773524&ri=8192&rs=8192&setec=ee2988d004d24f17caa033c6c22faac4"
    },
    {
      "fileId": "94737",
      "name": "WeaponsOfTheShogunate_1_02",
      "version": "1.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1069",
      "fileName": "WeaponsOfTheShogunate_1_02-11983-1-02.7z",
      "uploadedUnix": "1350716135",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/ef58504d71b20d6de44613cb19484752df636691ae70219d98df26ef6b856fb0/analysis/1407229504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WeaponsOfTheShogunate_1_02-11983-1-02.7z?fid=94737&ttl=1535773525&ri=8192&rs=8192&setec=3cd8ec93a0c7c7d2b91cf69762396662"
    },
    {
      "fileId": "1000089474",
      "name": "WeaponsOfTheShogunate_1_03",
      "version": "1.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1779",
      "fileName": "WeaponsOfTheShogunate_1_03-11983-1-03.7z",
      "uploadedUnix": "1388650465",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/90ed25118b63e7e810010033ed9fa110c9a1d6751dafadcaca1386f127ddb06b/analysis/1407868361/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WeaponsOfTheShogunate_1_03-11983-1-03.7z?fid=1000089474&ttl=1535773525&ri=8192&rs=8192&setec=d599656066c57dcec38d1530dcb612b0"
    },
    {
      "fileId": "1000094787",
      "name": "WeaponsOfTheShogunate_1_04",
      "version": "1.04",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1915",
      "fileName": "WeaponsOfTheShogunate_1_04-11983-1-04.7z",
      "uploadedUnix": "1391344873",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/84fce790432972a9af1736a79e3d032c3ee5a36ef2a1564d4abfe8ca6393a94e/analysis/1407914105/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WeaponsOfTheShogunate_1_04-11983-1-04.7z?fid=1000094787&ttl=1535773525&ri=8192&rs=8192&setec=8ecd21988b83e08a961216091d83ee45"
    },
    {
      "fileId": "1000095415",
      "name": "WeaponsOfTheShogunate_1_05",
      "version": "1.05",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1916",
      "fileName": "WeaponsOfTheShogunate_1_05-11983-1-05.7z",
      "uploadedUnix": "1391623686",
      "modVersion": "1.05",
      "virusScanUrl": "https://www.virustotal.com/file/2475bd253f4f21d041b58985eaf1ab82e7b927e9104639cf720a69256cb22260/analysis/1407919453/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WeaponsOfTheShogunate_1_05-11983-1-05.7z?fid=1000095415&ttl=1535773526&ri=8192&rs=8192&setec=33d43877903615eb409a7171a87bcffa"
    },
    {
      "fileId": "1000095433",
      "name": "WeaponsOfTheShogunate_1_05a",
      "version": "1.05a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1915",
      "fileName": "WeaponsOfTheShogunate_1_05a-11983-1-05a.7z",
      "uploadedUnix": "1391629297",
      "modVersion": "1.05a",
      "virusScanUrl": "https://www.virustotal.com/file/4d7bb1853333bc89fbfd5370b19013f7779eefcf34b359effd8e880c8faee408/analysis/1407919691/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WeaponsOfTheShogunate_1_05a-11983-1-05a.7z?fid=1000095433&ttl=1535773526&ri=8192&rs=8192&setec=d807e50623163b0c91767b9a62ac3119"
    },
    {
      "fileId": "1000096884",
      "name": "WeaponsOfTheShogunate_1_06",
      "version": "1.06",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2594",
      "fileName": "WeaponsOfTheShogunate_1_06-11983-1-06.7z",
      "uploadedUnix": "1392313406",
      "modVersion": "1.06",
      "virusScanUrl": "https://www.virustotal.com/file/012ff4edb7b328f4d4215c6d741eec35c9768ed9057312bb4dd2447cf6bf8fc7/analysis/1407932109/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WeaponsOfTheShogunate_1_06-11983-1-06.7z?fid=1000096884&ttl=1535773527&ri=8192&rs=8192&setec=d1b6a15e20465c353d98deb503f10dc5"
    }
  ]
}