{
  "modId": 12012.0,
  "modName": "Nocturnals Shadow",
  "summary": "A Cheat Pack for the Thieves Guild Containing Enhanced Enchanted Armour and Three Sets of a Ring and Amulet Pair with different levels of Enchantments",
  "descriptionHtml": "Hey guys first of all I would like to say that this is my first mod and I am planning to Make a Equipment set for every Faction in the Thieves Guild for you guys to use and basically have fun with   my mods aiding you all the way through :) \r\n\r\nSo this mod is about the Thieves Guild Faction Skyrim.\r\n\r\nIt is based about A power called the Nocturnal\\'s Shadow locked Somewhere within the Nightingale Hall. The previous Nightingales tried to find this immense source of power but failed... failed all except Gallus. However knowing Mercer\\'s True Nature he locked away the shadow in a chest located in the Nightingales Hall knowing as if it was Mercer he would never go back there. And placed the key in the living quarters just near the armoury. \r\n\r\nThe Nocturnal\\'s Shadow Consists of An Enhanced Armour Set, and three sets of pair of ring and amulets for further enhancements each in three different levels \r\n\r\nPS: Im open to any suggestions, complaints and of course compliments :) Please Comment to let me know via the comments box. Please dont post anything rude or offending to anyone Thanks :)",
  "categoryId": "40",
  "version": "1.0",
  "author": "ShadowEye14",
  "createdUnix": "1330810219",
  "updatedUnix": "1330810510",
  "containsAdultContent": false,
  "uploadedBy": "ShadowEye14",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39703",
      "name": "Nocturnals Shadow",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Nocturnals Shadow-12012-1-0.zip",
      "uploadedUnix": "1330810510",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0d6a68c2be789cefc676dc629e577dd74f446205e52fa4feda96750eab1808be/analysis/1406727795/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nocturnals%20Shadow-12012-1-0.zip?fid=39703&ttl=1535773565&ri=8192&rs=8192&setec=d748f12a3bd178a58e8be4018e05e155"
    }
  ]
}