{
  "modId": 12020.0,
  "modName": "From Helmets to Circlets",
  "summary": "Changes the appearance of some helmets to look like circlets. That\\'s it. No changes whatsoever to stats, textures, heavy armor/light armor flags on helmets or anything else.",
  "descriptionHtml": "Changes the appearance of some helmets to look like circlets. That\\'s it. No changes whatsoever to stats, textures, heavy armor/light armor flags on helmets or anything else.\r\n\r\nThis is something I wanted for my own game for a long time, and there are a few mods out there that do similar things (no helmet mods, mods that turn circlets into armorer versions, and so on), but all I ever wanted was for my helmets to LOOK LIKE circlets, nothing more!\r\nFinally, I decided to do it myself end created this little mod, then thought to share it with the community for the... Uh... Embetterment of everyone! (is \\\"embetterment\\\" even a proper word? Damn my shaky knowledge of this language!).\r\n\r\nRight now there is only 1 .esp file, that changes the appearance of the Daedric helmet so it\\'ll look like the Gold & Ruby Circlet. If \\'nuff people like this one and/or ask for another helmet to be converted, I\\'ll add more options.\r\n\r\nDISCLAIMER\r\nThis is my very first mod, and o.c. I\\'m very inexperienced. I tested it (I use it myself) and it seems to work just fine, no problems whatsoever (I mean, it\\'s just a very simple .esp that changes 1 single mesh and a few flags, that\\'s all). HOWEVER, if you decide to try and use this, you do so at your own peril, I won\\'t be held responsible for whatever mess might occour, and so on, yadda yadda, you know the drill...\r\n\r\nAlso, you can do with this mod what you feel like: use it, change and/or redistribute it (just gimme credit for the original file), abuse it, mock it, bask in its glorious presence, download and never use it, use it but not download it (eh, like to see this one), and so on. But, well, if you like it, I wouldn\\'t be too offended with a few endorsments (damn, it\\'s like with achievements, the more you have, the more you wanna get!).\r\n\r\nMore detailed description coming soon! (gimme some time, right now I\\'m taking screenshots, checking if the file is online and working, and so on).\r\n\r\nNOTE:\r\nThis mod was created using Skyeditor, and would never have been created without it. All credits for that awesome tool goes to its creators of course. Thank you guys!",
  "categoryId": "29",
  "version": "1.0",
  "author": "Soulofanna",
  "createdUnix": "1330814530",
  "updatedUnix": "1330814692",
  "containsAdultContent": false,
  "uploadedBy": "soulofanna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39731",
      "name": "Daedric Helmet to Ruby Circlet",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Daedric Helmet to Ruby Circlet-12020-1-0.rar",
      "uploadedUnix": "1330814692",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b68e58a6ada13cd8c1511c15d784ff197deb70e94460af49ee1f91f9828599e0/analysis/1406728032/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Helmet%20to%20Ruby%20Circlet-12020-1-0.rar?fid=39731&ttl=1535773583&ri=8192&rs=8192&setec=b1ddc0c82a94ee404b9770fd2085c582"
    }
  ]
}