{
  "modId": 12057.0,
  "modName": "Lake View Estate",
  "summary": "My first Skyrim Mod, A Large Luxurious Home for players to stash their goods.",
  "descriptionHtml": "This is a new player home located to the west of Riften. Lake View Estate consists of many Mannequins, Weapon Racks, Bookshelves, Weapon / Shield Plaques and even a new Follower NPC!\r\n\r\nI am aware that there are still some bugs / glitches, some of them I\\'m not sure how to fix but I\\'m still working on it. I\\'m still very new to modding skyrim so the mod is not exactly perfect. Any bug / glitch reports would be greatly appreciated and if you know a fix, I\\'m more than willing to accept some help.\r\n\r\nA lot of time has been put into this mod, and although it may seem inferior to some of the other user created content, I think I did rather well.\r\n\r\n\r\nAny new ideas and or suggestions are always welcome and considered. I like to try to make people happy, so I will not ignore ideas or suggestions, but this also does not mean all ideas or suggestions will be added to the mod.\r\n\r\nUpdates will be made regularly, testing is greatly appreciated.\r\n\r\n_____________________________________________________________________________________\r\n\r\nVersion 1.3 !NEWEST!\r\n--Fixed issues with Damian not giving you gold when he buys items from you. Damian now carries 25,500 Gold. Please be aware that Damian\\'s \\\"Stock\\\" is only within the Lake View House (Interior)\r\nHe does not carry Gold or Items (Merchant Related) outside of the House.\r\n--Replaced Barstools with a Bench, the Barstools \\\"animation\\\" didn\\'t match up with the table they were near.\r\n--A few cosmetic fixes, plugged some holes where you could see light shining through wall tile pieces.\r\n--Added more idle markers, giving Damian more options of things to do around the House.\r\n_____________________________________________________________________________________\r\nVersion 1.2\r\n--Added Interior Lighting Template to make the place feel a little more realistic.\r\nI may tweak the lighting more in future updates.\r\n\r\n--Added 10 new Weapon Plaques. (6 in the Master Bedroom and 4 in the Crafting Rooms Hallway, now there is a Weapon Plaque above each doorway in the House)\r\n\r\n--Added Windows (These Windows do not match the interior / exterior design, but they still look nice! I\\'m not too picky about the interiors and exteriors \\\"matching\\\" due to architectural \\\"realism\\\" I believe the interior and exterior of a House can easily look much different)\r\n\r\n--Added Loads of Decoration throughout the House, for a better feeling of a nicely decorated Home.\r\n\r\n--Added a few more Ingots in the Smithing Room.\r\n\r\n--Added 2 new Chests in the Enchanting Room.\r\n\r\n--Added 1 new Chest near the Stairs leading to Damian\\'s Room.\r\n\r\n--Made multiple changes to the Follower NPC (Damian)\r\nDamian can now be Married.\r\nDamian can now Buy items from you and sell items to you from his own stock.\r\nDamian carries 50,000 Gold for merchant transactions.\r\nDamian is also now Fully Interactive with the entire House and all Furniture inside!\r\n\r\n--Added a Campfire, Archery Target, Combat Dummies and a Chair to the Exterior Area.\r\nI may enhance the outside of the House more in future updates. The Archery Target and Combat Dummies aren\\'t really in strategic locations, just tossed down.\r\n\r\n_____________________________________________________________________________________\r\n\r\nFuture Update Ideas include:\r\nI may tweak / enhance the interior lighting template for better appearance.\r\nAdjust the campfire outside to look more like a camping area.\r\nAdjust the Archery target and Combat dummies outside to a more strategic combat training pattern instead of just being blindly placed together.\r\n\r\nThis place seems almost 100% complete to me, so if there are more updates to it, there wont be many and they wont be very drastic.\r\nI\\'m beginning to work on my next Home mod as well as a couple other ideas for fun mods. No details but I will be releasing more fun mods!\r\n\r\n_____________________________________________________________________________________\r\n!!PLEASE REPORT ANY FOUND BUGS OR ISSUES TO ME, I WANT TO GET THEM FIXED!!\r\n_____________________________________________________________________________________\r\n\r\nPlease Comment and Endorse if you enjoy Lake View.\r\nI\\'m enjoying my time modding and testing, so let me know if you have any ideas for improvement, or for new homes or whatever.\r\n\r\n!! IMPORTANT !!\r\nPlease make sure to delete the older version before using Version 1.2!! in order to apply changes to the Follower NPC I had to remove my file, save the game without it existing, then install Lake View. This ensures all changes are applied and you start with a fresh new Home filled with goodies and an excellent Follower.\r\n\r\nNate.",
  "categoryId": "68",
  "version": "1.3",
  "author": "CrazyNate aka ViolentNed",
  "createdUnix": "1330846304",
  "updatedUnix": "1331852493",
  "containsAdultContent": false,
  "uploadedBy": "ViolentNed",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39865",
      "name": "Lake View Estate",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1115",
      "fileName": "Lake View Estate-12057.rar",
      "uploadedUnix": "1330846429",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/c5a60fc7b7526f53c78d8a25b5849ee7e663000421635c1aeebd7a402ac7402d/analysis/1406728756/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lake%20View%20Estate-12057.rar?fid=39865&ttl=1535773647&ri=8192&rs=8192&setec=675d7bbbf3bec2fd7529fa7169cba993"
    },
    {
      "fileId": "40273",
      "name": "Lake View Estate v1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "342",
      "fileName": "Lake View Estate v1_1-12057.rar",
      "uploadedUnix": "1330927353",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/8a1a1214bcaabccc52016d9bf8b2c6fe7e98a08bb85ca2b136d9b29d43a48b47/analysis/1406731805/",
      "changelogHtml": " Damian can now teach you Block skills. <br/> \n Eterior edited and re-navmeshed. <br/> \n Added Candles to the Smithing Room. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lake%20View%20Estate%20v1_1-12057.rar?fid=40273&ttl=1535773648&ri=8192&rs=8192&setec=701fa8a09b5aa34b40b752d6df2eb562"
    },
    {
      "fileId": "41846",
      "name": "Lake View 1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "345",
      "fileName": "Lake View 1_2-12057.rar",
      "uploadedUnix": "1331342874",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/11eb93ea27cd97de90fc5ee8433073598feac98f81b1eb835568ddbd2a5457f1/analysis/1406740869/",
      "changelogHtml": " Added 10 new Weapon Plaques throughout the House. <br/> \n Added Interior Lighting Template and Windows. (Windows do not match tileset but still look nice) <br/> \n Multiple Tweaks to Follower NPC. (Damian) <br/> \n Added Archery Target, Combat Dummies and a Campfire to the Exterior Area. <br/> \n Changed Kitchen Area around a little bit and added a lot more Decor around the House. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lake%20View%201_2-12057.rar?fid=41846&ttl=1535773648&ri=8192&rs=8192&setec=389251bd43224c482e3b9ca983ae8bc4"
    },
    {
      "fileId": "43691",
      "name": "LakeView v1_3",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "347",
      "fileName": "LakeView v1_3-12057.rar",
      "uploadedUnix": "1331852493",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/7db08f8037fa9e1955a5c9e62cffca5fbc0584821a8ef4c6e011feaa6bc125ab/analysis/1406750955/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LakeView%20v1_3-12057.rar?fid=43691&ttl=1535773649&ri=8192&rs=8192&setec=ec5dcbb6e4dfb3a806a289c99fafa748"
    }
  ]
}