{
  "modId": 1206.0,
  "modName": "True Nightingale - Armour Recolor",
  "summary": "This is my second attempt at recoloring Nightingale armour. First time I tried I got some comments and messages stating that my designs are not lore-friendly as they are not \\\"stealthy\\\".\r\n\r\nSadly for me - that was correct. I’m not a person who surrenders easily though, so I decided to take this as a challenge and deal with it seriously. I came up ",
  "descriptionHtml": "[size=5]!!!READ INFO FIRST!!!\r\n!!!CONTAINS SPOILERS REGARDING THIEVES GUILD QUESTS!!![/size]\r\n\r\nSorry for bad english - it\\'s not my first language.\r\n\r\nThis is my second attempt at recoloring Nightingale armour. First time I tried I got some comments and messages stating that my designs are not lore-friendly as they are not \\\"stealthy\\\".\r\n\r\nSadly for me - that was correct. I\\'m not a person who surrenders easily though, so I decided to take this as a challenge and deal with it seriously. I came up with a plan.\r\n\r\n[size=4]=====================\r\nI. The Question.\r\n=====================[/size]\r\nWhat does it mean to be a Nightingale?\r\n\r\nIt may look obvious, as the explanation is provided to us in-game, but... yes, there is a \\\"but\\\". Yes, the truth behind the protecting trio is revealed, but isn\\'t as complex and comprehensive as it should be. In Skyrim there are several books that have scraps of knowledge, but still - that\\'s not enough to grasp the bigger picture (and I needed it to fully understand the concept of Nightingales).\r\n\r\n[size=4]=====================\r\nII. The Pillars.\r\n=====================[/size]\r\nThus began the highly theoretical thought process (\\\"conceptualisation\\\" in research methodology - process of producing clear definitions and solid base for further research). As a result I came up with two determinants (let\\'s call the \\\"pillars\\\").\r\n\r\n[b][u]The First Pillar[/u][/b] - Nocturnal and Her influence\r\nIt is clear that at the very core of nature of Nightingales and Thieves in general lies their connection with the Night Mistress. I don\\'t mean the importance of Nightingales protecting the Skeleton Key etc., the other way around rather. I focused on the gifts provided to each and every Thief in a Guild - the \\\"luck\\\", possibility to success in things deemed as impossible. Scientifically speaking this have to be somehow based with tampering or totally overthrowing basic laws of probability. From more mystical/philosophical point of view it looks like a way to alter the Karma of specific people. Karma, understood as an energy of good deeds flowing between people, could be in theory bent to favour specific individuals. Nocturnal as a supreme being could possibly do it at will to reward her followers, given the opportunity of course. And so - the first pillar is Karma.\r\n\r\n[b][u]The Second Pillar[/u][/b] - The Art of Thief\r\nI decided to take on a dualistic approach, pairing mythical power with a really down-to-earth properties of a thief. At first I thought strongly about purely materialistic side - clothing, colours etc. However - it\\'s not the right way. While it\\'s true, that dark apparel fits perfectly the \\\"hide in the shadows\\\" idea we get to know that \\\"The Shadows\\\" are not understood only as a dark places, but also as an aid of Nightingales that were before us. Thus clearly, to be \\\"one with the shadows\\\" is not merely to wear dark clothing. What it is then? It is to be LIKE a shadow - not in the obvious \\\"grey\\\" way though. It is to blend everywhere and remain unnoticed. It is to be present everywhere without rising suspicion. It is to fit and adapt accordingly. It is to be invisible in plain sight. Not the \\\"obscured by darkness\\\" approach then, but rather the Chameleon skill. And so - the second pillar is Chameleon.\r\n\r\n[size=4]=====================\r\nIII. The Answer.\r\n=====================[/size]\r\nProperly conceptualised definitions didn\\'t made it any easier for me. I knew what I was looking for, but still the unifications of both concepts was just a bit out of my grasp. Then it hit me. An epiphany. The answer was there all along. Again, I turned to Google and there it was. The answer practical and easy to apply.\r\n\r\nThough it was placed in a popular culture I had no doubt it was it. As I read the words I realised that maybe the cult of Nocturnal in TES series isn\\'t totally made up? Maybe it was based on an actual, yet hidden organisation? The words I\\'ve seen right in front of me were clearly confirming this theory. Author was speaking to the Night Mistress, or rather whoever he chose to worship:\r\n\r\n\\\"Desert loving in your eyes all the way.\r\nIf I listen to your lies would you say I\\'m a man without conviction?\r\nI\\'m a man who doesn\\'t know how to sell a contradiction?\r\nYou come and go, you come and go...\r\n\r\nKarma, karma, karma, karma, karma chameleon!\r\nYou come and go, you come and go...\r\nLoving would be easy if your colors were like my dream:\r\nRed gold and green.\\\"\r\n\r\nRED. GOLD. AND GREEN.\r\nThese are the true colours of a faithful Nocturnal follower.\r\nI see. I hear. I obey.\r\nBehold the Karma Chameleon!\r\n\r\nSource:  http://www.youtube.com/watch?v=JmcA9LIIXWw\r\n\r\nP.S.:\r\nAlso most part of it is made out of dragons, so you can see the scales. Rawr.",
  "categoryId": "54",
  "version": "1.0",
  "author": "HalfBlack",
  "createdUnix": "1322070961",
  "updatedUnix": "1322072002",
  "containsAdultContent": false,
  "uploadedBy": "halfblack",
  "primaryFile": null,
  "files": [
    {
      "fileId": "3174",
      "name": "Male and Female version 1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1042",
      "fileName": "Male and Female version 1-1206-1.rar",
      "uploadedUnix": "1322072002",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/5db9c21ead13f5a0cb5630f50c653bd974ca270ef42a990ab2ba9c69b7ff955c/analysis/1406438703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Male%20and%20Female%20version%201-1206-1.rar?fid=3174&ttl=1535754650&ri=8192&rs=8192&setec=43a55a0c4fd81a0fe73fc48b4c4f162c"
    }
  ]
}