{
  "modId": 12075.0,
  "modName": "Skyrim Enhanced Overhaul",
  "summary": "Total OVERHAUL of Skyrim: weight of each item, food effects, health regeneration, text messages, 2 new recipes, revisioned Smithing and Heavy Armor tree...for a more HARDCORE and REALISTIC Skyrim Experience!",
  "descriptionHtml": "THIS MOD IS DEAD: SOON SKYRIM MASSIVE IMPROVING PROJECT - S K M I P - \r\nif possible with english support and the greatest compatibility as possible\r\n\r\n\r\nNOTE: First, this mod is only for italian versions, because are changed some names and descriptions including text messages,potions, armors, perks, misc items and spells. Other languages are anyway compatible. If someone want to translate my mod is free to do so, just tell me.\r\n\r\n=====ENGLISH  (see below for italian description)\r\nThis mod is the result of a work lasted almost a month, but I was able to create an overhaul designed for hardcore gamers like me.\r\nWARNING: Need Skyrim patch 1.4 or more recently.\r\n\r\nFeatures:\r\n* Revisioned the weight of almost each item. Quest items have a lower weight to avoid being too annoying, except for Ysgramor\\'s Axe, which however can be removed even during its mission. See the list below to get an idea about new weights.\r\n* The maximum carry weight was modified from 300 to 100. Summing this to the new weight of the items, on average you can carry 1/5 or 1/6 than before. This is also valid for hirelings.\r\n* Revisioned the names and the descriptions of some text messages, potions, spells, perks, active effects and Shouts.\r\n* Revisioned some perks:\r\n - Instead of Steel Fists in the Heavy Armor tree we have Robustezza (+25% health regeneration with a complete heavy armor)\r\n - Revisioned the perk Conditioning: now if you use a complete heavy armor, this weight half instead nothing.\r\n - Divided the perk Advanced armors of the Smithing tree in Forgiatura a scaglia and Forgiatura a piastre (see the photos for more details). So:\r\n   Forgiatura a scaglie needs Elven smithing; Glass smithing needs Forgiatura a scaglie; Forgiatura a piastre needs Dwarven smithing; Ebony smithing needs Orcish smithing or Forgiatura a piastre.\r\n - Now Daedric smithing (Smithing tree) needs 100 skill points and Dragon armor needs 90 skill points, being daedric armors more powerful. Accordingly:\r\n   Daedric smithing needs Dragon Armor; Dragon armor needs Ebony smithing or Glass smithing (see the photos for more details).\r\n*Food now have stronger effects and soups/stews have weaker effects.\r\n*Khajiit passive skill \\\"Claws\\\"(unarmed damage increased) has been replaced by Shock resist (50%).\r\n* Now you can sharpen silver swords and greatswords using the sharpening wheel. You can duplicate the effects with the perk Steel smithing.. You can also have the possibility to find them from merchants.\r\n* General shops and khajiit caravans always have 2, 3 or 4 torches, view of their scarcity.\r\n* You can find from clothing merchants new clothes (Alik\\'r outfit, chef, executioner, jarl...)\r\n* You can also find executioner\\'s axe from blacksmiths and pickaxe and woodsman axe from general shops.\r\n* Now werewolves are more strong, accordingly they appear only in high levels, and the opportunity to meet them will decrease.\r\n* You\\'ll now find minors gold amounts in the loots, and they will be less richest (for example a dragon will drop only 1 dragon scale and 1 dragon bone; or a giant will drop only animal pelts and no more also gold and gems).\r\n\r\nList of new weights:\r\n*NOTE: For arrows It\\'s not possible to change the weight. If anyone finds a way to do it, I may contact me with a private message.\r\nTWO-HANDED WEAPONS: 22 - 40\r\nONE-HANDED WEAPONS (excluding daggers): 13 - 22\r\nDAGGERS: 6 - 10\r\nBOWS: 10 -17\r\nSTAFFS: 8.0\r\nLIGHT ARMORS: 10 - 20\r\nHEAVY ARMORS: 25 - 50\r\nLIGHT SHIELDS: 5 - 9\r\nHEAVY SHIELDS: 10 - 22\r\nFOOD: 0.5 - 3.0\r\nINGREDIENTS: 0.2 - 2.0\r\nPOTIONS: 0.5 - 1.0\r\nSCROLLS: 0.5\r\nBOOKS: 1.0\r\nLETTERS: 0.5\r\nLOCKPICKS: 0.5\r\nSOUL GEMS: 0.5 - 1.0\r\nTORCHES: 2.0\r\nPARTS OF ANIMALS: 2.0 - 4.0\r\nDRAGON SCALES: 4.0 (decreased)\r\nDRAGON BONES: 6.0 (decreased)\r\nINGOTS: 2.0 - 3.0\r\nORES: 3.0\r\nOTHER MISC ITEMS: 0.2 - 6.0\r\n\r\n                                                         > > >  IF YOU LIKED THIS MOD REMEMBER TO ENDORSE ME!  < < <\r\n\r\n\r\n=====ITALIAN\r\nQuesta mod è frutto di un lavoro durato quasi un mese, ma sono riuscito a creare una revisione pensata per giocatori puristi come me.\r\nATTENZIONE: Richiede la patch 1.4 o più recenti.\r\n\r\nCaratteristiche:\r\n* Revisionato il peso di quasi ogni singolo oggetto. Gli oggetti di missione avranno un peso un po\\' inferiore per evitare che siano troppo fastidiosi, fatta eccezione per l\\'ascia di Ysgramor, che comunque adesso potete rimuovere anche durante la relativa missione. Guarda l\\'elenco in fondo per farti un\\'idea sui nuovi pesi.\r\n* Il peso massimo trasportabile ha un valore base di 100 anziché 300. Sommando questo al nuovo peso degli oggetti, in media potete portare 1/5 o 1/6 rispetto a prima. Questo è anche valido per i seguaci.\r\n* Revisionati i nomi e le descrizioni di alcuni testi di messaggio, pozioni, incantesimi, perk, effetti attivi e Urli.\r\n* Rivisti alcuni bonus degli alberi di abilità:\r\n - Al posto di Pugni d\\'acciaio nell\\'albero Armatura pesante avremo Robustezza (+25% rigenerazione salute con armatura pesante completa).\r\n - Rivisto il bonus Condizionamento: ora se usate l\\'armatura pesante completa questa pesa la metà anziché nulla.\r\n - Diviso il bonus Armature avanzate dell\\'albero Forgiatura in Forgiatura a scaglie e a piastre (vedi le foto per maggiori dettagli). Quindi:\r\n   Forgiatura a scaglie richiede Forgiatura elfica; Forgiatura del vetro richiede Forgiatura a scaglie; Forgiatura a piastre richiede Forgiatura nanica; Forgiatura dell\\'ebano richiede Forgiatura orchesca o Forgiatura a piastre.\r\n - Ora Forgiatura daedrica (albero Forgiatura) richiede 100 e Corazza di drago richiede 90 di abilità, essendo le armature daedriche più potenti. Di conseguenza:\r\n    Forgiatura daedrica richiede Corazza di Drago; Corazza di drago richiede Forgiatura dell\\'ebano o Forgiatura del vetro (guarda le foto per maggiori dettagli).\r\n* Il cibo ha effetti più marcati e le zuppe/stufati ne hanno di ridotti.\r\n* L\\'abilità passiva dei Khajiiti Artigli (danno a mani nude aumentato) è stato sostituito da Resistenza all\\'elettricità (50%).\r\n* Ora potete migliorare spade e spadoni d\\'argento alla mola. Potete raddoppiare gli effetti con il bonus Forgiatura dell\\'acciaio. Inoltre avete anche una possibilità di trovarle dai mercanti.\r\n* Gli empori e le carovane khajiiti avranno sempre dalle 2 alle 4 torce in vendita, vista la loro precedente scarsità.\r\n* Potete anche trovare in vendita asce da boia dai fabbri e picconi e asce da taglialegna dagli empori.\r\n* Potete trovare dai mercanti di abiti nuovi vestiti (completi Alik\\'r, da cuoco, da boia, da Jarl...).\r\n* Ora i lupi mannari selvaggi saranno più forti, di conseguenza appariranno solo ad alti livelli, e la probabilità di incontrarli diminuirà.\r\n* Ora troverete minori quantità d\\'oro nei bottini, e gli stessi saranno meno ricchi (ad esempio un drago lascerà solo 1 scaglia di drago e 1 osso di drago; o un gigante lascerà solo pelli di animali e non più anche gemme e oro).\r\n\r\nLista dei nuovi pesi:\r\n*NOTA: Per le frecce non è possibile modificare il peso. Se qualcuno trova un modo per farlo mi può contattare con un messaggio privato.\r\nARMI A DUE MANI:  22 - 40\r\nARMI A UNA MANO (esclusi pugnali):  13 - 22\r\nPUGNALI: 6 - 10\r\nARCHI: 10 - 17\r\nBASTONI: 8.0\r\nCORAZZE LEGGERE: 10 - 20\r\nCORAZZE PESANTI: 25 - 50\r\nSCUDI LEGGERI: 5 - 9\r\nSCUDI PESANTI: 10 - 22\r\nCIBO: 0.5 - 3.0\r\nINGREDIENTI: 0.2 - 2.0\r\nPOZIONI: 0.5 - 1.0\r\nPERGAMENE: 0.5\r\nLIBRI: 1.0\r\nLETTERE: 0.5\r\nGRIMALDELLI: 0.5\r\nGEMME DELL\\'ANIMA: 0.5 - 1.0\r\nTORCE: 2.0\r\nPARTI DI ANIMALI: 2.0 - 4.0\r\nSCAGLIE DI DRAGO: 4.0 (ridotto)\r\nOSSA DI DRAGO: 6.0 (ridotto)\r\nLINGOTTI: 2.0 - 3.0\r\nMINERALI GREZZI: 3.0\r\nALTRI OGGETTI VARI: 0.2 - 6.0\r\n\r\n                                                  > > >  SE VI E\\' PIACIUTA LA MIA MOD RICORDATEVI DI CLICCARE IL TASTO \\\"ENDORSE\\\"!  < < <\r\n",
  "categoryId": "79",
  "version": "1.3",
  "author": "Alfx3",
  "createdUnix": "1330871602",
  "updatedUnix": "1334243552",
  "containsAdultContent": false,
  "uploadedBy": "alfx3",
  "primaryFile": null,
  "files": [
    {
      "fileId": "45398",
      "name": "Skyrim Enhanced Overhaul",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "955",
      "fileName": "Skyrim Enhanced Overhaul-12075.rar",
      "uploadedUnix": "1332340001",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/50d502f9325570381d106499f9e49041275521bce3786f45b2c6825766b6e20b/analysis/1406771283/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Enhanced%20Overhaul-12075.rar?fid=45398&ttl=1535773679&ri=8192&rs=8192&setec=ab4b1f2c45e1eff8b80a2d5fbd28dd3d"
    },
    {
      "fileId": "52599",
      "name": "Skyrim Enhanced Overhaul II",
      "version": "1.3",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "698",
      "fileName": "Skyrim Enhanced Overhaul II-12075.rar",
      "uploadedUnix": "1334243552",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/2e40822994ceafccedf5dece8d8304953950b3848672a5e6018e1ca7c36e1820/analysis/1406811904/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Enhanced%20Overhaul%20II-12075.rar?fid=52599&ttl=1535773679&ri=8192&rs=8192&setec=6746693ed702f166c5822932a7a75f7a"
    }
  ]
}