{
  "modId": 12071.0,
  "modName": "Armageddon Manor",
  "summary": "This house is designed for the serious dungeon explorer who likes to collect EVERYTHING.\r\nThe mod all together has a grand total of \r\n19x Mannequins\r\n105x weapon racks\r\n22x shield plaques\r\n4x crossed weapon plaques\r\n10x large flat display cases that hold a weapon and 2 daggers each \r\n4x large standing display cases\r\n23x Large bookshelves\r\n",
  "descriptionHtml": "ALSO AVAILABLE ON STEAM\r\n\r\nThis house is designed for the serious dungeon explorer who likes to collect EVERYTHING.\r\nThe mod all together has a grand total of \r\n19x Mannequins\r\n105x weapon racks\r\n22x shield plaques\r\n4x crossed weapon plaques\r\n10x large flat display cases that hold a weapon and 2 daggers each (depending on the size of the weapon)\r\n4x large standing display cases\r\n23x Large bookshelves\r\n8x Dagger display cases\r\n4x servants (2 are vendors)\r\n8x guards\r\nand a Dragon NPC (who will offer quests eventually)\r\nEVERYTHING WORKS\r\n\r\nall in a stunningly designed mod that covers 5x interior cells \r\nHouse interior\r\nHouse Basement interior\r\nForge interior\r\nDungeon interior\r\nMine interior\r\n\r\nand located on the beautiful waterfall cliffs of Darkwater pass exit.\r\n\r\n-------------------------------------------------------------------------------------------------------------\r\nUpdated 11 MAR 2012: v0.6.1\r\n\r\nFinished the basement\r\nchanged a few things in the pool area\r\nchanged a few things in the vault\r\nadded moss around pool area\r\nadded water affects to the SPA to make it more realistic\r\nadded NavMesh to the guest rooms in the main House\r\nadded NavMesh to the entire basement\r\nadded room boxes to every room and linked them with portals to cut down on the amount of stuff loaded at once. \r\n\r\nThe NPCs in the training hall area of the basement do not have any AI packets yet.\r\nThe Archery Master does not have AI packets yet.. and the scripting for the archery range event is not complete yet. Its not cooperating with me.\r\n\r\n--------------------------------------------------------------------------------------------------------------\r\nUpdated 08 MAR 2012: v0.6.0\r\n\r\nadded the basement cell, zone.\r\n\r\nIncludes:\r\nPool, spa area - the mesh object I used was from the bards collage exterior and after I fully incorporated it as my pool I found that there is an invisible collision that extends up from it so you were unable to exit the pool. To solve this I added an auto load door to the steps exiting the pool that zones you past the collision barrier. you can enter the pool from anywhere though.\r\n\r\nVault - The key for the vault is in the house sitting on the black book on the desk above the waterfall basement entrance in the main bedroom area. \r\n\r\nThe other door from the pool area is locked and unavailable right now... I am currently working on this section. It will be the training area with the archery range.\r\n\r\nother then that I still need to add the Nav Mesh to the basement which I will do once the training area is complete, as well as the Nav Mesh for the guest rooms and the basement entrance.\r\n\r\n--------------------------------------------------------------------------------------------------------------\r\nUpdated 05 MAR 2012:v0.5.9 (11:40pm)\r\n\r\nfixed some exterior issues \r\ncleaned up some water areas and found a water tile that had about 20x multiple currants linked to it ... might have been what was crashing people. playing havic with water mods\r\n\r\nready for this?\r\nAdded a stair case up one floor from the back hall way.. added 2 additional rooms for guests.\r\nadded a stair case going down from the center of the bed room near the Dragon armor display. The door down there will link to a new cell that will have a recreation area that includes pool, spa, archery range, training dummies, and the Vault for the house.\r\n\r\nAnd to show I do listen to suggestions i added a few more plants and ..... a waterfall that comes down in front of the desk above the new staircase that drains down both sides into 2x planting beds, some water flows down the stairs and runs to the door at the bottom because behind that door will be the swimming pool\r\n\r\nI still need to alter / update the Nav Mesh for the new areas inside the house\r\n\r\nand YES i know the new rooms need clutter added.\r\n\r\nI did not alter any displays or mannequins.\r\n\r\n--------------------------------------------------------------------------------------------------------------\r\nUpdated 05 MAR 2012: v0.5.8\r\n\r\nFixed some terrain issues around the exterior\r\ncapped the beams extending out from the house for the suspended platforms.\r\nadded some more trees in some places\r\nfixed some floating trees near the mine\r\nFixed the \\\"OWNED\\\" clutter in the house\r\nAdded collisions around the roots so it is easy to walk over them now.\r\n\r\nThank you for the feed back... please keep it coming and I will be glad to fix any issues\r\n\r\n------------------------------------------------------------------------------------------------------------------\r\n\r\nServent - Buttler (planning to make him capable of holding items for the player, and distribute them to various containers. food to the kitchen, blacksmithing items to the forge, potions or ingrediants to the arcanum, etc\r\nSo players can unload all their stuff at one location)\r\n\r\nButler also has AI packages so he will go to his room shut his door and go to sleep at night.\r\n\r\nGuards - have been upgraded and stats have been set\r\n\r\nKitchen\r\nCrafting Cooking Fire Spit\r\nStorage chests for all your cooking ingredients\r\nPlenty of seating for all your guests\r\nhanging pots and pans for a more realistic and modern kitchen.\r\n\r\nServent - Cook (is now a vendor) also has AI packages so he will go to his bed room shut his door and go to sleep at night\r\n\r\nBedroom\r\nNoble double bed\r\nplenty of dressers for item storage\r\nan office area\r\n2x Mannequins (designed for dragonbone armors) \r\n5x weapon racks (for dragonbone weapons)\r\nbut feel free to use them all how you wish\r\nthere are also 2x doors from the bedroom area that exit the house.\r\nOne goes to the lake side if you want to fish\r\nThe other exits to the suspended balconies with an awesome view.\r\n\r\nLibrary\r\n23x Bookshelves (can hold more then double every book in the game and then some)\r\n8x Mannequins (I use them for all the various robes and mage gear)\r\n10x weapon racks (I use these for staffs)\r\n4x Large standing weapon display cases\r\n8x Dagger display cases\r\n4x Crossed weapon plaques each with a shield plaque in the middle of them.\r\nThe middle cabinet on the back wall of the library is a secret door leading to the Arcanum.\r\n\r\nArcanum\r\nCrafting Enchanting Workbench\r\nCrafting Alchemy Workbench\r\nhalf the room is set up for Alchemy complete with drying racks \r\nOther half of the room is designed for enchanting\r\nthe middle is set up as a herb garden based on the Headmasters room in the collage.\r\n\r\nChapel\r\nDown the back hall you will find 2x extra bedrooms, these are for servants that I intend to add in the future.\r\nIn between these rooms is a small chapel.\r\nThe balcony above the bedroom area has 10x large flat display cases. Each one is set up to hold a weapon + 2x daggers (depending on the size of the weapon)\r\n\r\nBasement\r\nPool\r\nSpa\r\nsome tables and chairs to relax in (might have to make some lawn chairs LOL)\r\nDoor to the left of the pool leads to the Vault.\r\nDoor to the right of the pool leads to the training hall, Archery range (under construction)\r\n\r\nForge\r\nThe forge doubles as a forge and armory\r\nCrafting Blacksmith Forge\r\nCrafting Smelter\r\nCrafting Tanning Rack\r\nCrafting Blacksmith Armor Workbench\r\nCrafting Blacksmith Sharpening Wheel\r\nSeveral storage containers for all your blacksmithing needs.\r\n\r\nServent - Blacksmith (is now a vendor) also has AI packages and will go to bed at night.\r\n\r\nArmory areas are the three corners of the room\r\n90x total weapon racks\r\n18x Shield Plaques\r\n9x total mannequins\r\n3x tables with chairs\r\n\r\nin the back of the room is a waterfall as reflected from outside and i used the Skyforge sunken into the floor as a heated pool. This is to resemble a place to temper metal as you are crafting. \r\nBehind the waterfall is a door that accesses the Dungeon\r\n\r\nArmageddon\\'s mine\r\nSimply just a mine. because I wanted a mine near my house with every ore I need for crafting.\r\n\r\nArmageddon\\'s Lair (dungeon)\r\nThis is the home of the dragon Armageddon\r\nthere are several cages to imprison people.\r\nArmageddon is the owner of the entire area (house, mines, forge, etc.) in a future update of the house I plan to have a quest set up that would bring the player to this location to clear out a cult that has inhabited the area.. the house will be un-furnished and look rundown. \r\nAfter clearing it out and meeting the dragon Armageddon he will offer the house to you as a reward for doing some tasks for him. additional tasks / quests will be offered to obtain the forge, and the mines as well as room decorations.\r\n\r\nI will add that version of this mod separately so players can choose which version they want .. The quest line one or this one already fully furnished.\r\n\r\nThere are Fast travel locations for:\r\nHouse\r\nForge\r\nMine\r\nStables\r\n\r\nthe coc commands are:\r\ncoc ArmaHouse056\r\ncoc ArmaForge056\r\ncoc ArmaMine056\r\ncoc ArmaDungeon056\r\ncoc ArmaBasement056\r\n\r\nIf you like my mod please leave a comment, I also enjoy feedback and if you find any problems with the mod let me know so i can fix them.\r\n\r\nThanks\r\nJena Angela\r\naka Armageddon\r\n\r\nENJOY!",
  "categoryId": "67",
  "version": "v0.6.0",
  "author": "Jena Angela",
  "createdUnix": "1330860782",
  "updatedUnix": "1331480922",
  "containsAdultContent": false,
  "uploadedBy": "Armaggeddon12345",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42334",
      "name": "Armageddon Manor",
      "version": "v0.6.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "440",
      "fileName": "Armageddon Manor-12071-v0-6-1.zip",
      "uploadedUnix": "1331480922",
      "modVersion": "v0.6.1",
      "virusScanUrl": "https://www.virustotal.com/file/7c2a8b12540f386cde23df8c89f609d2b88bfd77ca82c3d62a6943314b8c45a9/analysis/1406743519/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Armageddon%20Manor-12071-v0-6-1.zip?fid=42334&ttl=1535773670&ri=8192&rs=8192&setec=dc3c166e3716cdddd3ee9cc864066445"
    }
  ]
}