{
  "modId": 12094.0,
  "modName": "Vile Art of Necromancy",
  "summary": "This mod will add many improvements to necromancy and to the darkest aspects of magic...",
  "descriptionHtml": "VILE ART OF NECROMANCY 2.0\r<br />By Aghnaar Mareth\r<br />\r<br />*SKSE 1.05.09+ IS REQUIRED TO RUN THIS MOD*\r<br />\r<br />DESCRIPTION\r<br />In Vanilla Skyrim I was enthralled by the Ritual Stone ability and I&#39;ve tried to use its power to storm a Thalmor prison with the undead...but Necromancy isn&#39;t that good in the original game, so, after the Creation Kit came out, \r<br />I begun to work upon this mod, which attempts to empower Necromancy and other dark arts. This mod will add the following features to your Skyrim experience:\r<br />\r<br />- All vanilla necromantic spells and abilities (including Ritual Stone) have enhanced duration and power. They still cannot be used on summoned creatures and dragons, but you can have any other kind of creature as thrall for an undefinite amount of time&#33;\r<br />- New ingredients (soul gem powder, human fat, etc..) are added to the game.\r<br />- You will be able to grind bones into bonemeal.\r<br />- A powerful necromantic grimoire (Necronomicon) is added to the game*. If you find it and study it, you&#39;ll unlock the &#34;advanced&#34; features of this game.\r<br />- All Daedric artifacts added by this mod (including the Necronomicon) are forbidden by the Empire and by most other governments, so they&#39;ll be confiscated by guards if you&#39;re found with them...and the Vigil of Stendarr won&#39;t take it kindly if finds them in your backpack&#33;\r<br />- (Advanced) You will be able to dissect any NPC with your dagger to get all kinds of ghastly ingredient and body part (skulls, hearts, fat, etc...).\r<br />- (Advanced) You will be able to &#34;rebuke&#34; undead creatures (including your zombies and thralls) to gain control over them (if hostile), equip them,  improve them (with special Daedric artifacts), force them to wait or follow you and even destroy them&#33;\r<br />- (Advanced) You will learn how to produce powerful Daedric artifacts to improve your undead minions, turning them into unstoppable killing machines&#33;\r<br />- (Advanced) Reanimate a huge army of undead minions with the Army of Darkness spell.\r<br />- (Advanced) Sell the souls of your enemies to the Daedra Lords for Daedric Coins (...but do it at your risk&#33;&#33;) with the Daedric Bargain spell.\r<br />- (Advanced) Reanimate back to life your enemies at the risk of losing your own lifeforce with the Blasphemous Resurrection spell.\r<br />- (Advanced) Craft the Akaviri Spirit Bottles and collect dragon souls with them...and, may be, turn them into powerful artifacts or into useful (filled) Black Soul Gems&#33;\r<br />- (Advanced) Craft the Distiller and equip it, if you want to produce Distilled Human Blood or to produce very powerful and useful potions and poisons.\r<br />- (Advanced) Craft the Mimir, equip it and use the knowledge of the dead to produce mighty magical artifacts with many different enchantments (implemented, but not tested). \r<br />\r<br />And...apart from the above, I have also made craftable useful vanilla ingredients like Dwarven Oil and Spriggan Sap and shadier substances, like Skooma and Double-Distilled Skooma.\r<br />\r<br />In order to support those who had problems in finding the Necronomicon or are too far into the game to get it from its original location, I have added the option to craft an Apocryphal Copy of the Necronomicon.\r<br />\r<br />This is a non-original copy which is supposed to be written by the player on dictation from Daedra Lords and from the souls of passed necromancers.\r<br />\r<br />The book could be crafted at the Tanning Rack and requires the player to have the following (just to be available):\r<br />\r<br />- Enchanting 50+\r<br />- Conjuration 50+\r<br />- Conjure Dremora Lord spell\r<br />\r<br />The book itself will require 1 ruined book, 1 daedra heart and 13 filled black soulgems.\r<br />\r<br />\r<br />* = The Necronomicon could be found in Helgen Keep or in a location near Riverwood (where there is a witch...), but still it&#39;s probably the best if you start a new game to fully experience this mod.\r<br />\r<br />CHANGELOG\r<br />1.0      Original version.\r<br />1.1      Added Craftable Apocryphal Copy of the Necronomicon.\r<br />1.2      Increased the Necronomicon font by two steps (now it&#39;s 10...I hope won&#39;t be messed up, but I am not willing to increase more because fonts seems to behave strangely in Skyrim, shrinking and growing in impredictable ways *even* after you tell them what&#39;s the size&#33;). Now I hope will be more readable.\r<br />      I&#39;ve dumped the whole Quest thing and I&#39;ve changed the letter in Anise cabin accordingly. Now the original Necronomicon will be found in the Captain&#39;s chest AND you&#39;ll find an Apocryphal Copy in Anise cabin. Both the book and the letter will be enabled at the beginning, so I hope they&#39;ll be easier to find.\r<br />      Army of Darkness now should take in account Line of Sight. No more &#34;reanimation surprises&#34; and I&#39;ve added a check on whether the target is dead or not [I hope this solves the &#34;unanimation&#34; issue and the weird behaviour after multiple casting. Consider that the original Dead Thrall spell doesn&#39;t have this condition...but I hope it works&#33;]\r<br />      The Subjugate option now should make turn a non-reanimate undead into a teammate. \r<br />      Quick and dirty solution for &#34;Come&#34; and &#34;Wait&#34; commands. Now the AI of the undead is disabled by the Wait command and enabled by the Come command. It&#39;s not perfect, but it&#39;s the easiest solution without having to resort to Quests...now it won&#39;t follow you when it&#39;s not supposed to&#33; :)\r<br />      Now when dissecting a corpse, all the harvested body parts are left on the ground, allowing you to pickup whatever you want (instead of dumping it in your inventory).\r<br />      I am moving all the Bonemeal recipes to the Cooking pot in order to keep it in line with what was done for JK Crafting Breakdown (which is the &#34;still kicking&#34; version of Valsosa&#39;s mod).\r<br />      I&#39;ve changed &#34;Human Blood&#34;, &#34;Human Skin&#34;, &#34;Distilled Human Blood&#34; into the more generic &#34;Blood&#34;, &#34;Skin&#34; and &#34;Distilled Blood&#34;. However, I&#39;ll not change other components as I&#39;m not feeling comfortable with that (because vanilla ingredients have racial specifications [such as &#34;troll fat&#34;] or because I&#39;d need to change vanilla ingredients [such as &#34;human heart&#34; or &#34;human meat&#34;]). \r<br />      Improved the scripting...now you should not have some weird message or behaviour from Daedric Bargain and other effects.\r<br />1.3      The script for &#34;Come&#34; and &#34;Wait&#34; has been changed slightly. Now the undead should follow you as long as you&#39;ve given a &#34;come&#34; command and should stay for a while (3 in-game days, 8.640 RL seconds) and then disappear if you&#39;ve given it a &#34;wait&#34; command.\r<br />      The Mimir has been changed so now it enhance the power of enchantments and the power of soulgems used in incantation, but it no longer attempts to give extra effects.\r<br />1.4      Solved the issue with Skooma and other craftable which were set to the wrong Crafting Furniture (now they are at the CookingPot as intended).\r<br />      Changed the name of Vanilla Skooma to &#34;Watered Skooma&#34; and increased its price to 44 gold coins.\r<br />      Added two recipes for &#34;Watered Skooma&#34; for the would-be Skyrim drug-dealers out there. One is hard to make as Skooma, but more profitable. The other has easier to find ingredients and is easier to make.\r<br />      Added &#34;Skooma&#34; (&#34;pure&#34; Skooma) which will be crafted according to the recipe from Necronomicon and its price has been set to 500 gold coins.\r<br />      Changed the value of &#34;Double Distilled Skooma&#34; to 2.000 gold coins and doubled its effectiveness (note that Skooma and Watered Skooma are still the most profitable recipes).\r<br />      Attached a script to all in-game Buckets which allow both to &#34;Fill&#34; and to &#34;Take&#34; them when they are dropped to the ground. &#34;Fill&#34; will allow to fill them once or many times (at a stamina cost) and each &#34;Fill&#34; will bring 4 units of &#34;Water&#34;.\r<br />      Added &#34;Water&#34; as a new food (mainly for use with watered skooma).\r<br />      Now vampires can drink blood to stave off their hunger.\r<br />      Added Elixir of Vampirism to become vampire with 100% certainty (but still take 3 days to change).\r<br />      The Mimir now is fixed and works as intended, adding +1 extra enchantment at specific skill levels (+1 below 25, +2 over 25, +3 over 75 and +4 over 100).\r<br />      Removed any reference to the &#34;Horn of Death&#34; (this was a botched attempt to call all your undead minions to a location, but was an utter failure, so I dropped it... :( )\r<br />1.5      Added the &#34;Configure&#34; button to the Rebuke menu.\r<br />      Within the &#34;Configure&#34; menu there are two submenu (Follow Delay and Putrefaction Timer), which allow to customize the amount of time before a minion catches up with the player when ordered to &#34;Follow&#34; and the amount of time before it is destroyed when ordered to &#34;Wait&#34;.\r<br />1.6      Added the Blood Replicator, a specialized alchemical device which (when equipped) replicate a single unit of blood through the use of a special alchemical substance (nutrient solution); this device was conceived for the vampires which don&#39;t want to depend on murderous practice to survive.\r<br />      Note that the Blood Replicator is similar to the Distiller, in which it works by equipping it (as an armor), but it doesn&#39;t require the alchemical bench...just equipping will activate its script. However, I wasn&#39;t able to unequip it automatically (the script is there, but doesn&#39;t work&#33;), so you&#39;ll have to unequip it manually.\r<br />      Added the Daedric Mystery Box, which is a new (craftable) daedric artefact which allows to &#34;spend&#34; one&#39;s daedric coins to gain Dragon Souls, gold coins and a special one-shot artefact (&#34;Oblivion Tears&#34;) which supercharges your Enchanting skills (especially if paired with the Mimir and perks like Extra Effects&#33;).\r<br />1.7      Added Bucket of Ever-Bountiful Water (which is a mod-specific bucket to avoid incompatibilities...so you&#39;ll have to use console &#34;help&#34; to find its code and add via console).\r<br />      Fixed the recipe for Daedric Mystery Box.\r<br />      Solved a little problem with Mimir, Blood Duplicator and Distiller meshes when using them with a female character (I&#39;ve forgot to change that from the original duplication of Mutant Heart).\r<br />1.8      Added a recipe to extract salt from blood, a recipe to extract water from blood and a recipe to extract ectoplasm from blood (none of them is cost-efficient, since selling blood would be more profitable, but are a last-ditch method to get these ingredients).\r<br />      Added a Configure option to the Necronomicon menu, which allows you to switch between the Vanilla Anatomy (dagger in hand to dissect) and the Alternate Anatomy (scalpel in inventory to dissect). The Necronomicon will still grant you the vanilla Anatomy,\r<br />      so, if you want the alternate version, you&#39;ll have to take vanilla Anatomy and switch it with the Configure option. The Configuration option also allows you to choose between the Chaotic (default) dissection method, which drops all items around you as if you&#39;d\r<br />      just finished butchering the corpse and the (less realistic) Orderly dissection method, which transfers all items to your backpack. Solved an issue with Necronomicon not showing properly.\r<br />      Added the new spell Imprison Soul Essence which allows you to create a special artefact (Skull of Enslaved Soul) which takes all the attributes and the skill of a corpse and could be thereafter used to improve them (as long as the victim had an higher score, its level isn&#39;t too much lower than yours and your Conjuration is high enough).\r<br />1.9      Improved the Imprison Soul Essence spell with elements from the aborted &#34;Highlander&#34; immortal script: Now even characters with character lower level and/or skill level will grant a one-shot potential for skill increase...the increase will be calculated as 1/100ths and the victim level will affect it (+1/100th for each 25% of caster level...up to 100 and +5)\r<br />      as will the skill rank level (+1/100th for each 25 skill levels, up to 100 and +5). This benefit will be one-shot, but any victim will grant it...so high level necromancers could just &#34;harvest&#34; any victim for memories, knowledge and power. Moreover some error in the script were patched up.\r<br />      Added a craftable Horn of the Dead which could be used to call the undead minions that you&#39;ve ordered to &#34;Come&#34;.\r<br />2.0      Imprison Soul Essence has been made more realistic by making impossible multiple uses on the same victim. A new spell called Extract Spirit Essence has been added, which allows to extract specific essences from non-NPC victims; while the requirements for this new spell are less strict, it is usable only once and for one type of essence.\r<br />      Nine elemental spirit essence (Corruption, Energy, Freedom, Honor, Integrity, Life, Sin, Thought, Wrath) have been added as ingredients and are linked to specific attributes and/or skills, which they greatly enhance. Moreover if you equip a Distiller and have at least 1 unit of spirit essence in your inventory, you&#39;ll find a significant number\r<br />      of Elixir which require a large quantity of spirit essence, skooma and an uncommon ingredient (which change for each elixir); there are a total of 21 elixir, each associated with an attribute or a skill, which allow you to permanently increase them by +1 just by imbibing it. In fact this is a variant of Imprison Soul Essence which has a different\r<br />      &#34;flavour&#34;, because the original spell was more versatile, while this new spell allows you to quickly increase specific skills, but will require you to stockpile the appropriate ingredients. This spell won&#39;t *work* on dragon corpses and this for a simple reason: Dragon corpses aren&#39;t the real dragon corpse, so aren&#39;t truly associated with the original\r<br />      creature and the spell won&#39;t recognize the being as a corpse. Attribute enhancement from Imprison Soul Essence and Extract Spirit Essence has been made more useful by using SetAV instead of ModAV, so the change is permanent and affects the base actor value. Daedric Mystery Box will now offer the option to trade one of the nine elemental \r<br />      spirit essence with another with a 1:1 ratio. I have solved an issue with the improvements of Sanguine and Namira...now they work as they were designed to work.\r<br />\r<br />\r<br />HOW TO ADJUST AN ATTRIBUTE INCREASED VIA IMPRISON SOUL ESSENCE IN 1.9 VERSION\r<br />As you have probably noticed, Imprison Soul Essence adds any extra point to attribute as an &#34;empowerment&#34;. This wasn&#39;t meant to work like that, but was due to my imperfect understanding of the ActorValue mechanics.\r<br />My original desire was to have it to act exactly as if they were points of gained through level up (affecting Base Value), but I only found later that this requires the SetValue function.\r<br />Now...removing (and, if possible, re-adding) both the Imprison Soul Essence spell and any skull (which cannot be changed, so are lost, sorry) should solve the issue for the future, but the solution for the past is this:\r<br />- Check if you have any active enchantment or constant ability that affects your attributes (Health, Magicka and/or Stamina).\r<br />- Unequip any enchanted item affecting those statistics.\r<br />- Find out the amount of enhancement granted by any constant ability you have (this enhancement will be called OthEn later).\r<br />- Use the Player.GetBaseActorValue (BAV) command to get the base value of all your attributes.\r<br />- Calculate the appropriate value for the attribute as BAV + OthEn and record any difference between this amount and your total permanent actor value (this is the ImprEn).\r<br />- Use Player.ModAV to reduce the value by -ImprEn.\r<br />- Use Player.SetAV to increase the base value to BAV + ImprEn.\r<br />I am sorry, but I had to use this very same procedure with my own character to set up the previously made changes, but after updating you should have no more to use this &#34;procedure&#34;...\r<br />\r<br />FIX FOR &#34;LOST&#34; UNDEAD MINIONS\r<br />If you lose your undead minions, the Horn of the Dead doesn&#39;t do the trick for you (even after waiting) and you want to relieve yourself of the active reanimate effect:\r<br />- Open the console.\r<br />- Type &#34;player.dispelallspells&#34;.\r<br />This will solve the issue, but, on the other hand, will dispell all effects on you, so you&#39;ll want to remove any equipped item and restore any permanent ability thereafter.\r<br />\r<br />\r<br />\r<br />INSTALLATION\r<br />Just unpack the content of the zip file into your Data directory, select &#34;Vile Art of Necromancy.esp&#34; and it should work properly.\r<br />\r<br />UNINSTALLATION\r<br />Remove all spells and items through console commands, deselect &#34;Vile Art of Necromancy.esp&#34;, cancel Vile Art of Necromancy.bsa, Vile Art of Necromancy.bsl and Vile Art of Necromancy.esp and the whole package should be uninstalled.\r<br />\r<br />CREDITS\r<br />- Bethesda for making Skyrim.\r<br />- JustinOther for allowing me to add the bones from his great &#34;More Interactive Items - Grab Moveable Statics&#34; mod to my mod.\r<br />- To all the guys who asked for a new way to spend their hard-earned daedric coins...this version wouldn&#39;t been possible if you didn&#39;t request this kind of &#34;improvement&#34;&#33; ;P\r<br />- L3zard05 for finding out the error with the Daedric Mystery Box (solved in v. 1.7).\r<br />- SilentSymphony for finding out the problem with the Unholy Feast of Namira (solved in v. 2.0).\r<br />\r<br />TRANSLATIONS\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=12227]Italian Translation (by Andre7890 of Dragonborn Italia)[/url] \r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=12260]Russian Translation (by Gluzdir)[/url] \r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=16030]Spanish Translation (by Obla)[/url] \r<br />\r<br />[b]WHAT IT&#39;S NOT GOING TO CHANGE\r<br />The following things aren&#39;t going to change in my mod ever, because of the reasons I made it:\r<br />- The amount of meat and fat dropped.\r<br />- The maximum limit of minions for Army of Darkness.\r<br />However, the changes to Army of Darkness should avoid people raising corpses which isn&#39;t expected to be raised and all the effects of the Necronomicon should apply to less powerful spells, so no need to use AoD if you just want a few minions...and I&#39;ll try to have the load from dissection dropped so you can hand-pick what you want. [/b]",
  "categoryId": "75",
  "version": "2.0",
  "author": "AghnaarMareth",
  "createdUnix": "1330884247",
  "updatedUnix": "1342904839",
  "containsAdultContent": true,
  "uploadedBy": "AghnaarMareth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40014",
      "name": "Vile Art of Necromancy - 1-0 Zip Version Old",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1946",
      "fileName": "Vile Art of Necromancy - 1-0 Zip Version Old-12094.zip",
      "uploadedUnix": "1330884441",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/de6026a5dfa415f82c7086f8f8eef326a8598df34f4490911694230a8a41822a/analysis/1406730251/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%201-0%20Zip%20Version%20Old-12094.zip?fid=40014&ttl=1535773722&ri=8192&rs=8192&setec=d08b8aaed487ae9452102024f600712a"
    },
    {
      "fileId": "40015",
      "name": "Vile Art of Necromancy - 1-0 Rar Version Old",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2529",
      "fileName": "Vile Art of Necromancy - 1-0 Rar Version Old-12094.rar",
      "uploadedUnix": "1330884508",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fc8d319d7424e6f50e8eba069e4a1192d4bc504b71f7fed87dc49dd98b157e37/analysis/1406730253/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%201-0%20Rar%20Version%20Old-12094.rar?fid=40015&ttl=1535773723&ri=8192&rs=8192&setec=d59da3429adc2d882e8e70a1c399c8bb"
    },
    {
      "fileId": "40076",
      "name": "Vile Art of Necromancy - 1-1 Zip Version",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1947",
      "fileName": "Vile Art of Necromancy - 1-1 Zip Version-12094.zip",
      "uploadedUnix": "1330894365",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d53bb75ec7684c527276702256fe3eb15ab24454a08d50feb4ede5fec26ad0f6/analysis/1406730727/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%201-1%20Zip%20Version-12094.zip?fid=40076&ttl=1535773723&ri=8192&rs=8192&setec=d18ddf503d9741bb8d6c68e49597a02b"
    },
    {
      "fileId": "40077",
      "name": "Vile Art of Necromancy - 1-1 Rar Version",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2529",
      "fileName": "Vile Art of Necromancy - 1-1 Rar Version-12094.rar",
      "uploadedUnix": "1330894398",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f1b46f14b604b95e49f4a31ef7f51d03f41f52be841ca7ae820865c23f08b297/analysis/1406730730/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%201-1%20Rar%20Version-12094.rar?fid=40077&ttl=1535773724&ri=8192&rs=8192&setec=e3d05511825675089ea7a5eb01529c7f"
    },
    {
      "fileId": "58235",
      "name": "Vile Art of Necromancy - 1-2 Zip Version Old",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3282",
      "fileName": "Vile Art of Necromancy - 1-2 Zip Version Old-12094.zip",
      "uploadedUnix": "1335996437",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/5d275b62eb1b8341f9066915e0173103e38f16501d2ba96ff2db3cbd6750afbb/analysis/1406862493/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%201-2%20Zip%20Version%20Old-12094.zip?fid=58235&ttl=1535773725&ri=8192&rs=8192&setec=b9e54dd35f2c0bbbfa69dfa5d99f581d"
    },
    {
      "fileId": "58236",
      "name": "Vile Art of Necromancy - 1-2 Rar Version Old",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2878",
      "fileName": "Vile Art of Necromancy - 1-2 Rar Version Old-12094.rar",
      "uploadedUnix": "1335996482",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/28ee3c34b33594944695bb992568feacc868c4d35b8b734db994ebab2565bc7b/analysis/1406862499/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%201-2%20Rar%20Version%20Old-12094.rar?fid=58236&ttl=1535773725&ri=8192&rs=8192&setec=2184c15e4635de75e01c3dffcbb3f155"
    },
    {
      "fileId": "65415",
      "name": "Vile Art of Necromancy - 1-3 Rar Version ",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3066",
      "fileName": "Vile Art of Necromancy - Rar Version-12094-1-3.rar",
      "uploadedUnix": "1338652225",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/3ec85c6ce321358b3c6f94d4c6615a6be32d17dc2a4514720ed1586ed4c687f2/analysis/1406932385/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%20Rar%20Version-12094-1-3.rar?fid=65415&ttl=1535773726&ri=8192&rs=8192&setec=ade1c9ed5aea990ab8d4668352cf7f13"
    },
    {
      "fileId": "65416",
      "name": "Vile Art of Necromancy - 1-3 Zip Version",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2305",
      "fileName": "Vile Art of Necromancy - Zip Version-12094-1-3.zip",
      "uploadedUnix": "1338652295",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/a16866a29052b1f1f01aba3c9ddced21e239fd39f119aaf2611a3db653613ec0/analysis/1406932387/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%20Zip%20Version-12094-1-3.zip?fid=65416&ttl=1535773727&ri=8192&rs=8192&setec=277c6aabbd437d4f35bf2e67f706dc50"
    },
    {
      "fileId": "69058",
      "name": "Vile Art of Necromancy - 1-4 Zip Version",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2513",
      "fileName": "Vile Art of Necromancy - Zip Version-12094-1-4.zip",
      "uploadedUnix": "1340132358",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/f48fb8f020a3ce6067fe3960f3a4af74b9720ca7abcdbd0484f2f25dca143d30/analysis/1406970246/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%20Zip%20Version-12094-1-4.zip?fid=69058&ttl=1535773727&ri=8192&rs=8192&setec=cc0dc50ff6f03d2f83d025a999cfdb7a"
    },
    {
      "fileId": "69059",
      "name": "Vile Art of Necromancy - 1-4 Rar Version",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3312",
      "fileName": "Vile Art of Necromancy - Rar Version-12094-1-4.rar",
      "uploadedUnix": "1340132403",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/e2395e3742af5561e4dac908db5c5febfa5c175126e5518205a92e71d3903044/analysis/1406970248/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%20Rar%20Version-12094-1-4.rar?fid=69059&ttl=1535773728&ri=8192&rs=8192&setec=024d5f2e9372cac532c85ce1b5a88d30"
    },
    {
      "fileId": "69164",
      "name": "Vile Art of Necromancy 1-5 - Zip Version",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2513",
      "fileName": "Vile Art of Necromancy - Zip Version-12094-1-5.zip",
      "uploadedUnix": "1340185912",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/f48fb8f020a3ce6067fe3960f3a4af74b9720ca7abcdbd0484f2f25dca143d30/analysis/1406971225/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%20Zip%20Version-12094-1-5.zip?fid=69164&ttl=1535773728&ri=8192&rs=8192&setec=2acad016184ecd669d0506e24f89a7fc"
    },
    {
      "fileId": "69165",
      "name": "Vile Art of Necromancy 1-5 - Rar Version",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3312",
      "fileName": "Vile Art of Necromancy - Rar Version-12094-1-5.rar",
      "uploadedUnix": "1340185954",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/e2395e3742af5561e4dac908db5c5febfa5c175126e5518205a92e71d3903044/analysis/1406971227/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%20Rar%20Version-12094-1-5.rar?fid=69165&ttl=1535773729&ri=8192&rs=8192&setec=efab79fb52a1ca8008864248b9de32f1"
    },
    {
      "fileId": "69276",
      "name": "Vile Art of Necromancy - 1-6 Zip Version",
      "version": "1.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2607",
      "fileName": "Vile Art of Necromancy - Zip Version-12094-1-6.zip",
      "uploadedUnix": "1340233621",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/173778f83a20121558c8460831abcf56dfd3ea27b188e3eef8efbc0eef3c00e3/analysis/1406972363/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%20Zip%20Version-12094-1-6.zip?fid=69276&ttl=1535773730&ri=8192&rs=8192&setec=11b7a49f240b1a245f55634aa53c45a4"
    },
    {
      "fileId": "69277",
      "name": "Vile Art of Necromancy - 1-6 Rar Version",
      "version": "1.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3411",
      "fileName": "Vile Art of Necromancy - Rar Version-12094-1-6.rar",
      "uploadedUnix": "1340233667",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/9debae940cc46d5861a38f76b9f6d99fc6a830da86ad0f3a893f17f8f95d5d9f/analysis/1406972365/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%20Rar%20Version-12094-1-6.rar?fid=69277&ttl=1535773730&ri=8192&rs=8192&setec=f905ccee01dbcb219440e4789e48d478"
    },
    {
      "fileId": "70669",
      "name": "Vile Art of Necromancy - 1-7 Rar Version",
      "version": "1.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3411",
      "fileName": "Vile Art of Necromancy - Rar Version-12094-1-7.rar",
      "uploadedUnix": "1340841793",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/02016811b361227d699b0728281999dc83b6257efe284b14fedc1bfd9aea0013/analysis/1406986746/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%20Rar%20Version-12094-1-7.rar?fid=70669&ttl=1535773731&ri=8192&rs=8192&setec=2ae1bfd8e1ac40ee9f7918f0e1f5bb85"
    },
    {
      "fileId": "70670",
      "name": "Vile Art of Necromancy - 1-7 Zip Version",
      "version": "1.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2607",
      "fileName": "Vile Art of Necromancy - Zip Version-12094-1-7.zip",
      "uploadedUnix": "1340841840",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/faec81b95eaf59fb71918e01d78a7a217905d2cc480080e65f349b7c37eade0d/analysis/1406986804/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%20Zip%20Version-12094-1-7.zip?fid=70670&ttl=1535773731&ri=8192&rs=8192&setec=482de1ee0f64fa331dea5898e49942c2"
    },
    {
      "fileId": "72862",
      "name": "Vile Art of Necromancy - 1-8 Zip Version",
      "version": "1.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2616",
      "fileName": "Vile Art of Necromancy - Zip Version-12094-1-8.zip",
      "uploadedUnix": "1341703503",
      "modVersion": "1.8",
      "virusScanUrl": "https://www.virustotal.com/file/9d32907a3cb95feeaf3fefec226de8c4d28b5e08a52ec570b15b664f4c4827e9/analysis/1407008645/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%20Zip%20Version-12094-1-8.zip?fid=72862&ttl=1535773731&ri=8192&rs=8192&setec=2021266e9233936587fcdfbd152823e1"
    },
    {
      "fileId": "72863",
      "name": "Vile Art of Necromancy - 1-8 Rar Version",
      "version": "1.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3220",
      "fileName": "Vile Art of Necromancy - Rar Version-12094-1-8.rar",
      "uploadedUnix": "1341703549",
      "modVersion": "1.8",
      "virusScanUrl": "https://www.virustotal.com/file/730f96e274537f3256472d31afedb4f35c5509dd7d2415bd6007895011eddaca/analysis/1407008648/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%20Rar%20Version-12094-1-8.rar?fid=72863&ttl=1535773733&ri=8192&rs=8192&setec=df461a3032a8371d342b682999a36f69"
    },
    {
      "fileId": "73852",
      "name": "Horn of the Dead Blowing",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1412",
      "fileName": "Horn of the Dead Blowing-12094-1-0.zip",
      "uploadedUnix": "1342120536",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/14f67064865ee404040ab33e6510b9e4ab568effcff1ba986e45f2666b497308/analysis/1407018364/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Horn%20of%20the%20Dead%20Blowing-12094-1-0.zip?fid=73852&ttl=1535773733&ri=8192&rs=8192&setec=b7267d4206c124bb6879d7c33415c9ee"
    },
    {
      "fileId": "74017",
      "name": "Vile Art of Necromancy 1-9 Zip Version",
      "version": "1.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4782",
      "fileName": "Vile Art of Necromancy - Zip Version-12094-1-9.zip",
      "uploadedUnix": "1342196035",
      "modVersion": "1.9",
      "virusScanUrl": "https://www.virustotal.com/file/c433f2d9830744b165a7f8d3e698746af3a5f9e9b5a0d8c2d4483b97738efcf3/analysis/1407019925/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%20Zip%20Version-12094-1-9.zip?fid=74017&ttl=1535773733&ri=8192&rs=8192&setec=fc0ecc72ccf4c7236f12a6793fae488a"
    },
    {
      "fileId": "74019",
      "name": "Vile Art of Necromancy - 1-9 - Rar Version",
      "version": "1.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5343",
      "fileName": "Vile Art of Necromancy - Rar Version-12094-1-9.rar",
      "uploadedUnix": "1342196090",
      "modVersion": "1.9",
      "virusScanUrl": "https://www.virustotal.com/file/99d3cfbc31568d99da43612a6cac8b17d0a60defff477bea4e371a86532f14fb/analysis/1407019928/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%20Rar%20Version-12094-1-9.rar?fid=74019&ttl=1535773734&ri=8192&rs=8192&setec=fcf670801f876558d19cbd193f519ab7"
    },
    {
      "fileId": "75790",
      "name": "Vile Art of Necromancy - Zip Version",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4791",
      "fileName": "Vile Art of Necromancy - Zip Version-12094-2-0.zip",
      "uploadedUnix": "1342904805",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/5fc02ca440cdb1bf871baaad8004cf4de6e9a85f42d6d5dab7102b515ad0de9a/analysis/1407037522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%20Zip%20Version-12094-2-0.zip?fid=75790&ttl=1535773734&ri=8192&rs=8192&setec=29eaf244d71b4ae2298bc0b4cf7387cb"
    },
    {
      "fileId": "75792",
      "name": "Vile Art of Necromancy - Rar Version",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5369",
      "fileName": "Vile Art of Necromancy - Rar Version-12094-2-0.rar",
      "uploadedUnix": "1342904839",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/bd0ab125ec6ac2100b91b12abc3d79999a69667b2ce89bb70f13d91f0255cf01/analysis/1407037528/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vile%20Art%20of%20Necromancy%20-%20Rar%20Version-12094-2-0.rar?fid=75792&ttl=1535773735&ri=8192&rs=8192&setec=5b14daa462a14461fa2cb00b08d4e2c8"
    }
  ]
}