{
  "modId": 12090.0,
  "modName": "GBobs More Minor Vendors",
  "summary": "Adds a minor vendor to several small towns including Rorikstead, Ivarstead, and Karthwasten",
  "descriptionHtml": "GenghisBob\\'s More Minor Vendors\r\n-----------------------------------------------------------------------------\r\nCurrent version: 1.0 (first release and work in progress)\r\n\r\nThis is a first initial release of this mod. Any construtive feedback as to problems and/or direction to take the mod is much appreciated. Enjoy!\r\n\r\n- GBob\r\n\r\n\r\nDescription\r\n---------------------------------------------------------------\r\nExhausted from the burden of your travels, laden with loot, your intrepid hero finally comes to small village. At last - time to rest, drink some mead, and sell of some of your hard-earned in order to lighten the load before you continue your travels. What?! Nobody in this town will buy the iron daggers I looted off the bandits who ambushed me on the road? Nobody will purchase that steel battle-axe I picked up as a victorious spoil from the bandit thug hiding out in that cave? Do you know how freaking heavy it is and how long I\\'ve been carrying that lump of metal?! What do you mean I can\\'t even give it away?!\r\n\r\nOkay. Ok. I\\'m tired and just want to get out of here. How about I resupply on a few quick essentials - I\\'m running low on arrows and another torch or two just to be safe. Nobody here has any extra they\\'re willing to sell me? I killed the freaking bandits who were waylaying travelers outside of your town! I killed the bears that have been marauding the forests where your children play! How the hell do any of you get any supplies?!\r\n\r\n---\r\n\r\nIf you\\'ve ever trekked across the vast lands of Skyrim, only to have the above scenario sap the very soul out of your adventurous, looting, pack-ratting, hero, then this mod is for you!\r\n\r\nThis mods adds a few minor vendors to some of the small towns around Skyrim. These vendors do not have a lot of cash, nor do they carry a lot of stock, but they will help lighten your load and may even have a few minor essentials for sale.\r\n\r\n\r\nFeatures\r\n---------------------------------------------------------------\r\n- minor vendor in Ivarstead (in the inn)\r\n- minor vendor in Rorikstead (in the inn)\r\n- minor vendor in Karthwasten (outside one of the houses)\r\n\r\n\r\nFuture Plans\r\n--------------------------------------------\r\n- maybe add more vendors to some of the other small towns where it makes sense\r\n- maybe have more advanced AI packages for more realistic wandering around\r\n- maybe add an outside \\\"stand\\\" with some barrels, crates, etc for the vendor\r\n- maybe adjust their stock to better represent where they are at\r\n- maybe give \\'em real names for better immersion\r\n\r\n\r\nCurrent Known Issues\r\n--------------------------------------------\r\n- None known\r\n\r\n\r\nVersion History\r\n--------------------------------------------\r\nVersion 1.0 (Mar 4, 2012)\r\n - Initial release\r\n",
  "categoryId": "69",
  "version": "1.0",
  "author": "GhengisBob",
  "createdUnix": "1330882302",
  "updatedUnix": "1330882432",
  "containsAdultContent": false,
  "uploadedBy": "Ghengisbob",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40001",
      "name": "GBobs_More_Minor_Vendors_v1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "GBobs_More_Minor_Vendors_v1_0-12090-1-0.zip",
      "uploadedUnix": "1330882432",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cdd1349b16a8a789d1b584db43689f097d44d0aeb0422a571d55492897da3362/analysis/1406730189/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GBobs_More_Minor_Vendors_v1_0-12090-1-0.zip?fid=40001&ttl=1535773711&ri=8192&rs=8192&setec=9e9f839c6a219d0934946498bb607356"
    }
  ]
}