{
  "modId": 12092.0,
  "modName": "Cloaks of Skyrim",
  "summary": "Adds almost 100 new styles of cloak to the world of Skyrim, via crafting, levelled-lists, and static loot. They are lore-friendly and enchantable, and more are being added with every update. The aim of this mod is to provide some variety and flavour to the world, as well as the chance to wear a stylish cloak and quite literally keep the cold out.",
  "descriptionHtml": "Please be sure to read both the [size=4][b]Installation instructions[/b][/size] and the [size=4][b]FAQ[/b][/size], as both contain solutions or answers to common questions. Even if installing with NMM, still make sure to read the installation instructions. \r<br />\r<br />[center][img]http://i.imgur.com/Ro1spJ4.jpg[/img][/center]\r<br />[center][url=http://www.skyrimgems.com/][img]http://www.skyrimgems.com/images/gems_logo.png[/img][/url][/center]\r<br />\r<br />[size=6][b]:: Contents ::[/b][/size]\r<br />\r<br />- Description\r<br />- Recent updates\r<br />- Cloak types and locations\r<br />- Installation instructions\r<br />- FAQ \r<br />- Uninstallation\r<br />- Credits\r<br />\r<br />\r<br />[size=6][b]:: Description ::[/b][/size]\r<br />\r<br />Adds almost 100 new styles of cloak to the world of Skyrim, via crafting, levelled-lists, and static loot. They are lore-friendly and enchantable, and more are being added with every update. The aim of this mod is to provide some variety and flavour to the world, as well as the chance to wear a stylish cloak and quite literally keep the cold out. (the cloaks provide defence against the cold in both the [url=http://skyrim.nexusmods.com/downloads/file.php?id=11163]Frostfall[/url] and [url=http://skyrim.nexusmods.com/downloads/file.php?id=6745]Hypothermia[/url] mods). You will see NPCs around Skyrim wearing various cloaks, and there are unique and rare variations to stumble across in your travels. \r<br />\r<br />The cloaks use slot 46, so can be worn without replacing any other equipment. \r<br />\r<br />Please feel free to add more screenshots, as I do love seeing them. Especially if you have screenshots of any unique cloaks you wish to share. Very interested to see and hear what people&#39;s favourites are&#33; \r<br />\r<br />[size=6][b]:: Updates ::[/b][/size]\r<br />\r<br />Cloaks of Skyrim version 1.2 \r<br />\r<br />-Dawnguard DLC optional added.\r<br />-proper weight-slider support for linen/burlap and cape meshes. Hide and Dragon Priest cloaks to be done for the next update.\r<br />-crafting changes, including the fantastic spinning wheel resource by Stroti\r<br />-new cloaks and capes, including the Companions, the College of Winterhold, Dawnguard amongst others.\r<br />-a bundle of  tweaks and improvements\r<br />\r<br />\r<br />[size=6][b]:: Cloak types and locations ::[/b][/size]\r<br />\r<br />With the addition of new cloaks, I thought it may be an idea to explain how to find the various kinds.\r<br />\r<br />:: CRAFTING ::\r<br />\r<br />So you want to craft a cloak? Version 1.2 sees a few changes to make crafting slightly more involved than linen wrap-hoarding. You&#39;ll still need linen wraps, but also a few other bits and pieces. The most important of these is a book - [b][i]Fryssa the Wide&#39;s Nordic Tailoring[/i][/b] - a long-winded historical text that will allow you to craft capes and cloaks at the tanning rack and spinning wheel. Without this book in your inventory, you won&#39;t be able to craft any cloaks or capes, keeping clutter on the tanning rack to a minimum. Keep an eye out for the book on your travels.\r<br />\r<br />To craft hide and burlap items, you&#39;ll need to head to the [b]tanning rack[/b]. For the more up-market linen cloaks and capes, you&#39;ll need to find a [b]spinning wheel[/b] in likely locations such as the College of Winterhold or Radiant Raiment. Dragonsreach also has one.  \r<br />\r<br />This change to crafting fits nicely in line with Frostfall and reflects the progression of cloak quality in that mod, from cheap burlap to warmer, better quality linen. \r<br />\r<br />:: HOLD GUARD CLOAKS and CAPES ::\r<br />\r<br />Hold Guard cloaks are not craftable, but can be seen worn by guards of the various Holds. In addition, so no guard-killing is necessary, spare Hold cloaks can be found, hand-placed in likely locations. \r<br />\r<br />:: FACTION CLOAKS ::\r<br />\r<br />Various factions have their own cloak variants, which can be found in the world in likely locations, or looted from NPCs. \r<br />\r<br />:: UNIQUE / RARE ::\r<br />\r<br />Finally, there are currently many styles of unique/rare cloaks hand-placed in the world, waiting to be discovered. Some are already enchanted, some not, and there are many more to come. Keep an eye out for them when adventuring and exploring&#33; Hints for their locations can be found in the Locations Readme.\r<br />\r<br />:: DRAGON PRIEST CLOAKS ::\r<br />\r<br />Unique variants can be looted from the named Priests. If you have already killed them, their cloak can be found somewhere in the vicinity of where they spawn. Unnamed Dragon Priests spawning at high levels will also drop the regular Dragon Priest cloak, while at lower levels, the cloak can be found within Geirumund&#39;s Hall.\r<br />\r<br />[size=6][b]:: Installation ::[/b][/size]\r<br />\r<br />Using this mod on earlier versions of the game may result in a crash at the main menu. Please take a moment to read the FAQ after installation if you have any questions or queries. Common problems are already answered there.\r<br />\r<br />1. Extract contents of download file straight into SteamappsCommonSkyrimData and go to 3.\r<br />or\r<br />Extract contents of download file into a temporary location and go to 2.\r<br />2. Copy all files to Steamsteamappscommonskyrimdata\r<br />3. Three .esp files are included. Cloaks.esp is the default file, but there are two optional files: Be sure to activate only [b]ONE[/b] esp of your choice.\r<br /> \r<br />[list][*][b]Cloaks.esp[/b] - Regular version. Cloaks are distributed throughout levelled lists and hand-placed in the world, as well as being craftable.\r<br />[*][b]Cloaks - No Imperial[/b] - Cloaks are craftable and distributed throughout the levelled lists, but not amongst Imperial NPCs. This is so that this mod is compatible with Prometheus&#39; excellent Imperial Capes mods. \r<br />[*][b]Cloaks - Player Only[/b] - The cloaks are not distributed throughout the levelled lists, no NPCs will be seen wearing them, but some are still hand-placed in the world to find. They are craftable, and therefore unique to the player only.\r<br />[/list]\r<br />In addition, the Dawnguard files are optional. Again, activate only ONE of the Dawnguard esp files, relevant to the main Cloaks of Skyrim esp that you use. \r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=13486]Winter is Coming[/url] now has a patch available for compatibility between the two mods. Be sure to read the description there.\r<br />\r<br />[size=6][b]:: FAQ ::[/b][/size]\r<br />\r<br />Q- This mod crashes my game before the main menu&#33; Help? \r<br />A- It is most likely related to your Skyrim version, as this mod uses Update.esm as a master. Try updating your Skyrim to see if you are running the latest version, or double-check to see if Update.esm is activated (though I think it should run automatically). Crashes on or before the main menu are usually due to a missing master file.\r<br />\r<br />Q- Why aren&#39;t the cloaks showing up in-game or on the tanning rack?\r<br />A- The esp possibly hasn&#39;t been activated. Double-check your Launcher to make sure the file is ticked. NMM also occasionally has a hiccup when activating a mod, so double-check that too if you use it.\r<br />\r<br />Q- Cloaks are showing up on the tanning rack but no NPCs are wearing them?\r<br />A- If you have just installed or updated, cloaks can take a few days to start showing up on NPCs due to respawn. If they still don&#39;t show, check to make sure you aren&#39;t running the Player Only.esp, which will prevent any NPCs from using cloaks. \r<br />\r<br />Q- Where can I find the book needed for crafting?\r<br />A- Fryssa the Wide&#39;s Nordic Tailoring can be found in usual booky-type places on your travels, as it is part of the common and cheap book levelled lists, it&#39;ll turn up reasonably often on shelves across Skyrim. It can also be found with the spinning wheels in the College and Dragonsreach if you are in a particular rush. \r<br />\r<br />Q- So much clipping&#33; Is this normal?\r<br />A- Afraid so. Some clipping is inevitable, as the cloaks can&#39;t be made to work flawlessly with every armour/clothing type. Re: clipping of feet - the hide cloaks won&#39;t clip, as they are attached to the feet. The linen/burlap cloaks will clip with the feet, as they aren&#39;t attached. However, if attached, the flowing movements of the cloak would then be lost. I personally prefer the way the linen cloak moves, so the clipping is a minor inconvenience for me. but I can understand if it is a turn-off for you. If it is intolerable, I&#39;d recommend using the hide cloak variants or the shorter capes.\r<br />\r<br />Q- If I install this are ALL the NPCs going to be wearing cloaks? \r<br />A- No.  I&#39;ve added the cloaks to the levelled lists in an immersive way. Not every NPC will be wearing one, some NPC types are more likely to have one than others, etc. The various guards and factions will have their own cloak variants, but again, not every single NPC will wear a cloak. \r<br />\r<br />Q- Why do the crafting recipes show up 3 times? \r<br />A- All 3 esp files have been activated during installation. Instead, activate only the one of your choice. Read the Installation section. \r<br />\r<br />Q- Why aren&#39;t the crafting recipes showing up on the forge?\r<br />A- They are crafted on the tanning rack and the spinning wheel.\r<br />\r<br />Q- Why has the cloak chopped off my Khajiit/Argonian&#39;s tail?\r<br />A- Beast-race tails are removed, as people complained about them poking through oddly. Think of them as being hidden under the cloaks, rather than poking through the middle of &#39;em in a bizarre way. Very simple task anyone can do in the CK to get them back if you are desperate. \r<br />\r<br />&#34;Give me back my tail&#33;&#34; instructions:\r<br />\r<br />You&#39;ll need the Creation Kit for a start. Open it up. \r<br />\r<br />Go to File - Data. Double-click on Skyrim.esm and Update.esm. Then find the Cloaks.esp you use in the list, and double-click that also. Also, with the Cloaks file selected, hit &#34;Set as Active File&#34;. Hit OK and wait for it to load up. Hit &#34;Yes to All&#34; on any warnings that pop up in the meantime.\r<br />\r<br />You&#39;ll need to edit two different entries for each cloak/cape you&#39;d like to use. Firstly, go to ArmorAddon in the list. Scroll down until you find the Cloak entries (they&#39;ll have names like CloakBlackAA). Right-click, Edit on the one you want. In the centre of the window, you&#39;ll see a list headed Biped Object, with numbers and names for body slots. Click on 40 - Unnamed so it un-highlights it. Click OK. \r<br />\r<br />Secondly, in the main list again, go to Armor, and again find the Cloaks. They&#39;ll be named with CloakAshlander1, etc (there should even be a separate cloaksofskyrim tab if you expand the armor list that&#39;ll take you straight to them). Open up the entry (right-click, edit) of the cloak you want to use and again you&#39;ll see the Biped Object section in the centre of the window. Do the same again - unhighlight 40 - Unnamed. Click OK. \r<br />\r<br />Repeat for any other cloaks you wish to edit. And all done&#33; Save and exit. Next time you fire up Skyrim and equip the edited cloak, the tail will be visible again. \r<br />\r<br />Q- Some of the cloaks have an Enchanted icon in the inventory, but show no magic effects. What&#39;s going on?\r<br />A- Any cloaks with a flavour description will falsely show an enchanted icon in the inventory. They are still fully enchantable, however. Some of the unique cloaks already have an enchantment, some do not. Any with an enchantment will show it in the Magic Effects menu.\r<br />\r<br />\r<br />[size=6][b]:: Uninstallation ::[/b][/size]\r<br />\r<br />Unequip any cloaks or capes you and followers have equipped. Find a nice, empty cell and save your game. Deactivate the esp file and remove the cloaksofskyrim folders within meshes and textures.\r<br />\r<br />[size=6][b]:: Credits ::[/b][/size]\r<br />\r<br />Thanks and huge credit to Backsteppo and Zenl for creating the excellent cloak meshes used here and allowing me to edit and add them in a separate mod.\r<br />Thanks to Bethesda for creating Skyrim and providing us with such amazing resources to use.\r<br />Thanks to Stroti for the fantastic [url=http://skyrim.nexusmods.com/mods/25279]spinning wheel[/url] resource used in the mod.\r<br />Thanks to Shadowtroop for the [url=http://skyrim.nexusmods.com/mods/27691]high-collared cloak[/url] resource.\r<br />Thanks to Hemingwey for permissions to use and play around with his excellent textures.\r<br />Thanks to TESNexus for the a one-stop-shop resource for authors and players.\r<br />Thanks to LHammonds for the Readme Generator this file was based on.\r<br />\r<br />[size=6][b]:: Permissions ::[/b][/size]\r<br />\r<br />Currently very busy and away from modding, so thought I&#39;d update the permissions to reflect that I haven&#39;t been able to respond to many requests:\r<br />\r<br />If you just wish to use one of the cloak meshes for an armour/clothing/companion mod, then go ahead. You have permission to use the resources for anything along those lines. If the request is something larger, then still fire a PM my way and I&#39;ll try to respond. ",
  "categoryId": "60",
  "version": "1.2",
  "author": "Noodles",
  "createdUnix": "1330882994",
  "updatedUnix": "1362336080",
  "containsAdultContent": false,
  "uploadedBy": "Nikinoodles",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54540",
      "name": "Cloaks of Skyrim dot7",
      "version": "0.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "26044",
      "fileName": "Cloaks of Skyrim dot7-12092.rar",
      "uploadedUnix": "1334839733",
      "modVersion": "0.7",
      "virusScanUrl": "https://www.virustotal.com/file/8fec254fae283d1e52cd060a992a808cbf6033235a8023ca7610715faa6b25aa/analysis/1406823633/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cloaks%20of%20Skyrim%20dot7-12092.rar?fid=54540&ttl=1535773714&ri=8192&rs=8192&setec=80540000ba50f7459e6c00eb7a71ff86"
    },
    {
      "fileId": "56502",
      "name": "Cloaks of Skyrim dot8",
      "version": "0.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "31762",
      "fileName": "Cloaks of Skyrim dot8-12092.rar",
      "uploadedUnix": "1335458944",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/7af10879a443180caf4f4bad67229ec77884bef7a7db3191a2fd00e33cac7161/analysis/1406841850/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cloaks%20of%20Skyrim%20dot8-12092.rar?fid=56502&ttl=1535773714&ri=8192&rs=8192&setec=ca5ff4f4d0f34a942acbe2cac084308f"
    },
    {
      "fileId": "63041",
      "name": "Cloaks of Skyrim dot9",
      "version": "0.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "53370",
      "fileName": "Cloaks of Skyrim dot9-12092-0-9.rar",
      "uploadedUnix": "1337715490",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/6e38704dbc05f777fd78409cb31d2d7808336925c1977d231ab9637517eb5784/analysis/1406909680/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cloaks%20of%20Skyrim%20dot9-12092-0-9.rar?fid=63041&ttl=1535773715&ri=8192&rs=8192&setec=fc470721a238af7ddf0bcc3d6b325272"
    },
    {
      "fileId": "68553",
      "name": "Cloaks of Skyrim v1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "70463",
      "fileName": "Cloaks of Skyrim v1-12092-1-0.rar",
      "uploadedUnix": "1339925451",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bdce896c82ba93a27fcca8867636fbe19176362b18d508319049727c82ede9ac/analysis/1406964675/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cloaks%20of%20Skyrim%20v1-12092-1-0.rar?fid=68553&ttl=1535773716&ri=8192&rs=8192&setec=560a22084a1366fd8c669ecf31881b5f"
    },
    {
      "fileId": "95366",
      "name": "Cloaks of Skyrim Patch v1-1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4661",
      "fileName": "Cloaks of Skyrim Patch v1-1-12092-1-1.rar",
      "uploadedUnix": "1350998297",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b514a59775859b2d709c048a7b7f133e9eb93f26b495897e5ef1283dc1cdc051/analysis/1407233135/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cloaks%20of%20Skyrim%20Patch%20v1-1-12092-1-1.rar?fid=95366&ttl=1535773717&ri=8192&rs=8192&setec=49982536e659ca12c7f78825888908d7"
    },
    {
      "fileId": "1000014777",
      "name": "Cloaks of Skyrim 1-2 ",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "84456",
      "fileName": "Cloaks of Skyrim 1-2 -12092-1-2.rar",
      "uploadedUnix": "1362335937",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/95ae76f758640f6a8e597d026f7543bb28a53e1c46399d562c641297738eee5b/analysis/1407450662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cloaks%20of%20Skyrim%201-2%20-12092-1-2.rar?fid=1000014777&ttl=1535773718&ri=8192&rs=8192&setec=6a00cbc42c0d338e9240a2eb7bd72a84"
    },
    {
      "fileId": "1000014778",
      "name": "Cloaks of Skyrim 1-2 Dawnguard",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1162",
      "fileName": "Cloaks of Skyrim 1-2 Dawnguard-12092-1-2.rar",
      "uploadedUnix": "1362336080",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/2b4f6e3ddafa2fee4f883edd4ece8d05a7b0ce7f920d22f6990e5d13b32a8a71/analysis/1407450732/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cloaks%20of%20Skyrim%201-2%20Dawnguard-12092-1-2.rar?fid=1000014778&ttl=1535773718&ri=8192&rs=8192&setec=d69989aebe9ff285bd27823d3362e6ff"
    }
  ]
}