{
  "modId": 12122.0,
  "modName": "Dragon Priest Mask Tweakes",
  "summary": "Alters all the dragon priest masks to be clothing, and adds a fortify shouts 20% effect to all of them.",
  "descriptionHtml": "The idea of collectable dragon priest masks is a good one, but I felt that the divisions of the masks into heavy and light armor undermined the motivation to acquire them.  After all, why bother getting them all if most don\\'t match your armor specializations?  Pure mages have it worse, since wearing any of them negates the important mage armor perk.  This mod seeks to at least make the masks more consistent, and therefore each one a more viable choice.  Firstly, all masks have been changed to clothing.  This makes them usable by mages, and at least equal in terms of their effects on armor ratings.  To make up for the armor loss, and also to make them all more consistent, all the dragon priest masks (except the wooden mask) now fortify shouts 20%, in addition to their vanilla effects.  This is something I primarily made for myself, but I figured, maybe a few others would like it as well.\r\n\r\nIn addition to normalizing the masks, I beefed up the primary enchantments on the Rahgot and Morokei masks.  Vanilla Rahgot is basically as good as some of the random loot you can find at high levels, so I bumped it\\'s stamina fortification from 70 to 100, just to make it a bit more special.  To make up for the diminished uniqueness of the (fixed) Morokei, I upped it\\'s Magicka regen rate fortification from 100% to 150%.  Hopefully neither is too much of a buff, I felt they were pretty minimal.",
  "categoryId": "54",
  "version": "1.01",
  "author": "JeffSteel",
  "createdUnix": "1330898046",
  "updatedUnix": "1331175357",
  "containsAdultContent": false,
  "uploadedBy": "JeffSteel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41223",
      "name": "DragonPriestMaskTweaks V101",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "DragonPriestMaskTweaks V101-12122-1-01.7z",
      "uploadedUnix": "1331175357",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/6e051fd5395818505de7c0490186c9b9e8f7dc4aa19e992932fdb9c5ded37e50/analysis/1406737202/",
      "changelogHtml": " Replaced all armor (i.e. ArmorHead) related keywords with \\\"ClothingHead\\\" keyword. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DragonPriestMaskTweaks%20V101-12122-1-01.7z?fid=41223&ttl=1535773776&ri=8192&rs=8192&setec=ff40926aab4f48b49e02e5798eb0372c"
    }
  ]
}