{
  "modId": 12140.0,
  "modName": "Epic Glory skill advancement overhaul",
  "summary": "Leveling is slower, skills start at zero, attributes start at 50 for a more challenging start but a more powerful finish for epic glory when you finally can slay that dragon or boss!",
  "descriptionHtml": "Description:\r\nEpic Glory is a collection of mods which makes the game more challenging and rewarding. I never cared for the difficulty slider concept because it nerfs player damage and increases everything elses damage output. Low level creatures should not be lethal and a spamfest hitting something 1000 times to kill everything causes the player to level too fast. I prefer a more challenging beginning game and a bigger feeling of accomplishment so when I achieve glory at level 50+ it feels epic and rewarding.\r\n\r\nThe first plugin I am releasing is a leveling rebalance mod:\r\n\r\nFeatures\r\n\r\nSkills start at zero.\r\nAll player Skills start out at zero, aside from racial bonuses. It is worthy of note your character will gain skill very rapidly early on with the first few skill uses, but once you get to 15 or so (where the vanilla game starts) you will notice skill progression is a little slower than vanilla. The idea here was that by lowering your skill level, you can ultimately level more times and get a few more perk points, and not start out with any decently high skills, everything is 0 unless you have racial bonuses, so some skills might start at 5 or 10.\r\n\r\nLeveling rates are slowed\r\nAll Skill rates are reduced to .75 of their original values, so leveling is 3/4 as fast as vanilla Skyrim with the exception of smithing and enchanting, which I have slowed to .5 of their original value, so they level twice as slow.\r\n\r\nAttributes start at 50 instead of 100.\r\nHealth, stamina and Magicka start values have been reduced to 50 each. So you won\\'t have as much stats as a level one character until level 15 now, assuming you add stats equally. You could in theory always have a 50 magicka if you never put any points towards it. However with the ability to level more, eventually you can get the same amount of attribute points as in a vanilla game because you can now level higher. (in theory, I haven\\'t tested it that far yet) However you\\'ll still have as many perks as a level 15 character would have, but still have all the opportunity to grow to a higher level eventually, for hopefully an epic reward at the end.\r\n\r\nMy own testing experience:\r\nAt level 15 with my test character, I finally have 100 health stamina and magicka. The game really feels better this way because I have 15 perks so I can jack of all trades a little better, yet still some specialization was required to survive. Starting out with only 50 health makes traps much deadlier and running away isn\\'t very easy either with only 50 stamina. So basically I had to specialize on a few perks to stay alive, stock up on potions, and sneak around a little more. I had to go mudcrab hunting, and hunt a lot in general, just so I could survive a basic normal dungeon crawl. To me it reminded me of how OOO for Oblivion felt, which is what I was after. \r\n\r\nI\\'m now at level 40 with my test character, and still loving it. Why? Because usually at level 30-35 playing vanilla I\\'m a god already and get bored. But with the attribute and skill nerfing, level 40 feels about like level 25. I can smith and enchant my stuff to the hilt, and still struggle here and there which makes the game more fun for me.\r\n\r\nInstallation: \r\nDrop the esp into your data folder and make sure its near the bottom of the list, at least when you first run it so that other mods that edit the player don\\'t affect your start skill values. I\\'ve seen some dirty mods do this as well. Once you start your game and your stats are 50, load order shouldn\\'t matter much after that, unless you are using mods which affect skill rates in some way.\r\n\r\nYou will have to start a new character to get the 50 attributes at start. Otherwise you can use the plugin to just have slower leveling rates by installing on an existing character, your stats should not be changed at all.",
  "categoryId": "24",
  "version": "1.0",
  "author": "madmole",
  "createdUnix": "1330905372",
  "updatedUnix": "1333246859",
  "containsAdultContent": false,
  "uploadedBy": "madmole",
  "primaryFile": null,
  "files": [
    {
      "fileId": "48419",
      "name": "Epic Glory Skills Start at Zero",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Epic Glory Skills Start at Zero-12140-1-0.zip",
      "uploadedUnix": "1333165790",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/31f24197c55f19588e801c651bde5f5751d3a53ed6fac64c0ae616c3a615b038/analysis/1406788503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Epic%20Glory%20Skills%20Start%20at%20Zero-12140-1-0.zip?fid=48419&ttl=1535773808&ri=8192&rs=8192&setec=1bb122729bb0253af4cd4081a5204420"
    },
    {
      "fileId": "48421",
      "name": "Epic Glory Stats Start at 50",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Epic Glory Stats Start at 50-12140-1-0.zip",
      "uploadedUnix": "1333165890",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3a689402d6ccebce5fb53e1db2db185a77079dd5b14b27957480603ef84c5d06/analysis/1406788503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Epic%20Glory%20Stats%20Start%20at%2050-12140-1-0.zip?fid=48421&ttl=1535773808&ri=8192&rs=8192&setec=448080a6f59622634ae53e32fa3a866b"
    },
    {
      "fileId": "48781",
      "name": "Epic Glory Skill Advancement Overhaul",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Epic Glory Skill Advancement Overhaul-12140-1-1.zip",
      "uploadedUnix": "1333246181",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/bce3d62aba0615271e0a53917fb6b5ce57fae356584cb0fca9d3424b441aca8d/analysis/1406790492/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Epic%20Glory%20Skill%20Advancement%20Overhaul-12140-1-1.zip?fid=48781&ttl=1535773808&ri=8192&rs=8192&setec=9f14ed5b437d1a11510a1bda234222cc"
    },
    {
      "fileId": "48785",
      "name": "Epic Glory Slower Leveling",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5",
      "fileName": "Epic Glory Slower Leveling-12140.zip",
      "uploadedUnix": "1333246859",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ea055044ba911affaa7c2b843b0f111c092deb0c10c0286d8f25fd9c3ef038e8/analysis/1406790493/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Epic%20Glory%20Slower%20Leveling-12140.zip?fid=48785&ttl=1535773809&ri=8192&rs=8192&setec=ddc9ecc38917655a0122a8930304d64f"
    }
  ]
}