{
  "modId": 12157.0,
  "modName": "Fighting Styles of Tamriel",
  "summary": "Throughout all of Tamriel and Nirn itself, warriors of all caliber have been honing their skills and fighting styles.  This mod grants adds a few of these styles, and the ability to switch between them at will: Imperial Stance, Lightning-quick Akaviri Stance, Powerful Orcish Stance, or Misdirecting Weynon Stance.",
  "descriptionHtml": "[b]Fighting Styles of Tamriel[/b]\r\nby [b]Yarharhar (yarharhar@yarsoft.com)[/b]\r\n\r\nV1.8\r\n     Bugfix Update\r\nReset functionality can undo the weynon/orcish stance sticky values. \r\n\r\n\r\n[b]**Important Note If Manually Upgrading from 1.1/1.0 (without the Nexus Mod Manager or Steam Workshop)**[/b]\r\n     Remove the old included script files: OrcStancePowerScript.pex,/psc, FightingStyle_AddChangePower.pex/psc, and fightingStanceMenuScript.pex/psc.  These files are now included in the bsa file and are easier to manage there.\r\n\r\n[b]Updates[/b]\r\n     1.8 - Bugfixes\r\n          Apparently the Orcish/Weynon Stances are still resulting in some sticky values.  I\\'m working on a new way of tracking these changes to fix this, but in the meantime the Reset function can undo this bug.\r\n\r\n     1.7 - Bugfixes\r\n          I believe I have squashed the rare case of orcish or weynon stance values getting stuck in wrong states.\r\n          Sneak attacking with bows in Akaviri stance no longer does insane damage.\r\n\r\n     1.6 - Addendum\r\n          Added a \\'reset\\' option, if needed, when upgrading from 1.1/1.0.\r\n\r\n     1.5 - General\r\n          The quest managing the different styles, handling future updates, and ensuring the player has the \\\"Change Fighting Style\\\" ability was completely rewritten.  The old quest was replaced, to ensure people with the buggy 1.0 Nexus release get the proper experience.  You may see a warning about a missing asset if upgrading from an earlier release, for that reason.  It can safely be ignored.\r\n     The Change Fighting Style power can now be used as often as you like, at the cost of 50 stamina.\r\n\r\n     Orcish Stance\r\n          Balance:  Power-Attacking  now costs more stamina than before\r\n          Balance:  Orcish Stance Power-Strike is no longer a guaranteed disarm.  A few factors come into play.  Style section has details.\r\n          Balance: Orcish Stance\\'s armor-piercing ability is now a reward after staying in the stance for 1-hour.\r\n          Appearance: Orcish Stance\\'s animations and attack speed have been modified.  Combatants now wind-up and then strike at normal speed, rather than the previous - \\\"Swinging through molasses\\\" method :)\r\n\r\n     Akaviri Stance\r\n          Balance: Power-Attacking in Akaviri Stance costs less stamina than before\r\n          Balance: Akaviri Stance gains a reward at 1-in-game hour of use.  A bleeding effect on all physical damage.  15 damage spread over 10 seconds.\r\n\r\n     Weynon Stance\r\n          A new stance has been added!  Weynon stance is a countering-friendly way of fighting, offering high defense until struck, then momentarily giving a damage boost to counter-attack.\r\n\r\n     1.1 - Bugfix Release, this made the Nexus and Steam versions Equivalent\r\n\r\n     1.0 - Initial Release.  Steam version worked, Nexus version did not\r\n\r\n[b]Intro[/b]\r\n     Throughout all of Tamriel and Nirn itself, warriors of all caliber have been honing their skills and talents.  But not all talents, and indeed, fighting styles themselves, are the same.  This mod grants adds a few of these styles, granting you the ability to switch between them at will.  But be warned!  Switching can be exhausting, and the true power of a style may only be unlocked after a short period of use.\r\n     Fight in the classic Imperial Stance, Lightning-quick Akaviri Stance, Powerful Orcish Stance, or Misdirecting Weynon Stance.\r\n\r\n[b]The Styles[/b]\r\n     Imperial Stance - Vanilla Skyrim combat.\r\n     Lore - The most popular and versatile style of fighting in Tamriel. Speed and power is balanced for a stable fighting base.\r\n     Pros:     Balanced\r\n          Effective against all combat types.\r\n          Full power is always available (no 1-hour reward)\r\n\r\n      Akaviri Stance - Fast paced combat that favors poisons and enchantments.\r\n     Lore - The style of fighting once favored by the Akaviri. Their warriors were said to become a whirlwind around foes, flowing around counterattacks while dicing them to pieces.  Those who fully immerse themselves in the style find their wounds striking deeper, yet unnoticed by their opponents until too late.\r\n     Pros:     Double combat speed\r\n          20% faster movement speed\r\n          Poisons last for three hits\r\n          Cannot be recoiled.\t\r\n          1-Hour Reward:  15 bleed damage over 10 seconds.\r\n\r\n     Cons:     30% physical damage.\r\n          Cannot recoil foes.\r\n\r\n     DPS:     Physical DPS 60% of imperial\r\n          Enchantment/Poison DPS 200% of imperial\r\n\r\n     Orcish Stance - Slow, but incredibly powerful tactical combat. A few good power attacks will turn the tides of many battles.\r\n     Lore - Beware those who move in the manner of the early, vicious Orcs. Their movements may seem slow and deliberate, but that gives way to a fast, crushing strike that can keep an enemy off their feet for an entire battle.  Once they full immerse themselves in the style, even an opponent\\'s armor tends to give way.\r\n     Pros:     250% physical damage\r\n          A power attack that connects will both stagger and can disarm a foe.  Foes who are blocking are more likely to be disarmed.  Similarly, striking with a two-handed weapon also raises your odds.\r\n          1-Hour Reward: 10% Armor Piercing\r\n\r\n     Cons:     Reduced Combat Speed\r\n          20% slower movement speed\r\n\r\n     DPS:     Physical DPS 125% of imperial\r\n          Enchantment/Poison DPS %50 of imperial\r\n\r\n     Weynon Stance - A style that surprises foes by switching from a master-defense to a crushing offense, and often.\r\n     Lore - The monks of the Weynon Priory, with their connections to the blades, had an upbringing both peaceful, yet warlike in nature.  The resulting style means that while they won\\'t start a fight, they sure as Oblivion will finish one.\r\n\r\n     Pros:     Increased defense until struck\r\n          Increased offense after struck for a short period of time\r\n\t\r\n     Cons:     Decreased offense until struck\r\n          Offensive gains are reduced if continually hit\r\n          Weak against magic users\r\n\r\n     Dps:     400% Defense/20% Offense (until struck)\r\n          100% Defense/400% Offense (after struck, for 3 seconds)\r\n          Offense gains cut in half with each additional hit, until able to rest for 2-3 seconds\r\n\r\n[b]Installation/Upgrading[/b]\r\n     Install the mod via Steam Workshop, Nexus Mod Manager, (any other tool of your choice), or manually unzip the files to your Skyrim folder.\r\n     Upgrading follows a similar path, though for the most guaranteed-bug free experience, I recommend switching back to Imperial Stance before doing so.\r\n     To change fighting styles, simply select the Power \\\"Change Fighting Style\\\" from the magic menu and use it as you would a shout or racial ability.\r\n\r\n     [b]**Important Note If Manually Upgrading from 1.1/1.0 (without the Nexus Mod Manager or Steam Workshop)**[/b]\r\n          Remove the old included script files: OrcStancePowerScript.pex,/psc FightingStyle_AddChangePower.pex/psc, and fightingStanceMenuScript.pex/psc.  These files are now included in the bsa file and are easier to manage there.\r\n\r\n[b]Uninstalling[/b]\r\n     For the most optimal experience, switch back to Imperial Stance before uninstalling.  Then, simply remove the mod files.  If you fail to do this, you may have lingering effects.  The reset option in the fighting stance menu should clean up any of these lingering problems, if necessary.\r\n\r\n[b]Known Bugs[/b]\r\n     Orcish stance can animate oddly in third-person.  I\\'m working on it.\r\n     \\\"Missing Assets\\\" warning may come up once when loading a save with an earlier (1.1 or lower) version of Fighting Styles on it.\r\n\r\n[b]RoadMap (future updates)[/b]\r\n     1.6-1.9 - Glaring Balance and Outstanding Bugs\r\n     2.0 - Massive Overhaul\r\n          Styles will be split into three categories “Style”, “Stance”, and “Step”,\r\n          Being able to mix and match abilities and powers of each.\r\n          Each race (and a few other groups) will be contributing to these categories.\r\n          Players will gain the ability to master elements of each category to reduce penalties or unlock greater powers.\r\n          The ability to make followers switch to a new style configuration.\r\n          And more!",
  "categoryId": "77",
  "version": "1.8",
  "author": "Yarharhar",
  "createdUnix": "1330918711",
  "updatedUnix": "1332624993",
  "containsAdultContent": false,
  "uploadedBy": "yarharhar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40239",
      "name": "Fighting Stances -Old",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "Fighting Stances -Old-12157.zip",
      "uploadedUnix": "1330918858",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ce0adff12e5be04246868015b5a09f07111555eed5e2c3c6a7271bd72d4fbc14/analysis/1406731639/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fighting%20Stances%20-Old-12157.zip?fid=40239&ttl=1535773840&ri=8192&rs=8192&setec=387e4a1023af0b41d96729c278f7c34d"
    },
    {
      "fileId": "40240",
      "name": "Enemies Pack",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Enemies Pack-12157-1-0.zip",
      "uploadedUnix": "1330918987",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d932cc56b52dcbeac8fd859ed6d043389369ad1e9e8c8154dc0320c323cc9b44/analysis/1406731639/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enemies%20Pack-12157-1-0.zip?fid=40240&ttl=1535773840&ri=8192&rs=8192&setec=b3889a6c041bf61ec29cc75fb6eb6d4e"
    },
    {
      "fileId": "40493",
      "name": "Fighting Stances  -1-1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "Fighting Stances  -1-1-12157.zip",
      "uploadedUnix": "1330974732",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/760c818258bc4704c2d156caff026e33d0b40a07dac3cbc84d8f557c1dc7570f/analysis/1406733265/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fighting%20Stances%20%20-1-1-12157.zip?fid=40493&ttl=1535773841&ri=8192&rs=8192&setec=fbb41d496902d4131a346081bb2eb267"
    },
    {
      "fileId": "46477",
      "name": "Fighting Stances",
      "version": "1.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26",
      "fileName": "Fighting Stances-12157-1-8.zip",
      "uploadedUnix": "1332624993",
      "modVersion": "1.8",
      "virusScanUrl": "https://www.virustotal.com/file/4505c946ee6cc4435499ceb9f26e889bf04ff81537121dd45ddf1dc8493ebba5/analysis/1406777583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fighting%20Stances-12157-1-8.zip?fid=46477&ttl=1535773841&ri=8192&rs=8192&setec=e5a0ca6d94f4b7023f32b2b5a1ee0071"
    }
  ]
}