{
  "modId": 12183.0,
  "modName": "Void Armor adaptation for CBBE users",
  "summary": "Void Armor by Hentai, adapted for CBBE users. I have added a bra to cover the deformed breasts that CBBE users get when use the UNP version. Two variants: slider at 0 and slider at 100. No shoulders versions for each. ",
  "descriptionHtml": "Void Armor by Hentai\r\nadaptation for CBBE users\r\nby Cicattrix\r\n\r\n[b]Announcement:\r\nMy mod is obsolete now, as there is a better mod for all those that dont like the bad clipping on the CBBE conversion:\r\n\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=12482 \r\n\r\nveekhan mod allows you to keep your main body and use the original armor without any bugs and clipping.\r\n\r\nThank you all and I hope this mod, as rough it was, had been useful for a while for some of you.[/b]\r\n\r\n--------------------\r\n\r\nNote on nausicaa36 conversion:\r\nAfter I have uploaded this, I have seen that nausicaa36 have uploaded meantime a total conversion for CBBE (http://skyrim.nexusmods.com/downloads/file.php?id=12181).\r\nMy intention was to make this adaptation to be only temporary, until a pro modder will make a serious conversion. So, I have tested it and I have found that, while it is pretty well made, there are some bad issues at the neck and with the shoulderpads. \r\nThe neck and the chin is clipping through the straps when the char turn her head and is quite visible to be able to ignore it. The shoulderpads are totally messed up and I wouldnt use it like this. Well, the shouldersless version could awesome, if the neck clipping will ever be fixed, but until then...\r\n\r\n-----------------------\r\n\r\nTwo variants - no weight slider - you must choose one:\r\n- Skinny (Curvy body at min) - UNP body shape, slider at 0, smaller breasts, tight hips, shadows under breasts\r\n- Large (Curvy body at max) - UNP body shape, slider at 100, bigger breasts, larger hips, shadows under breasts\r\n\r\nNo shoulderpads versions added for each variant!!!\r\n\r\nFiles provided with each variant:\r\n- cuirass_0.nif and cuirass_1.nif --> Meshes folder\r\n- BikiniBlack.dds and Bikini_n.dds--> Textures folder\r\n- Info file\r\n\r\nInstallation:\r\n- install original Void Armor by Hentai - not the sliding version (link bellow)\r\n- install the chosen variant from my adaptation - either use NMM or put my files into Data folder\r\n- accept overwrite when asked\r\n- if you want to be able to enchant the boots and gloves, change Hentai`s esp with the one from here: http://skyrim.nexusmods.com/downloads/file.php?id=11993# \r\n\r\nCredits and Resources used:\r\n- Void Armor by Hentai --> http://skyrim.nexusmods.com/downloads/file.php?id=11871#\r\n- Void armor - Working with slider - by dimon99 --> same location\r\n- CBBE bra from anano`s Layer Bikini with my own retexture  --> http://skyrim.nexusmods.com/downloads/file.php?id=7736#\r\n- Bethesda, ofc, for Skyrim.\r\n- NiFSkope\r\n\r\nPlease give kudos and endorse:\r\n- Hentai\r\n- dimon99\r\n- anano\r\n\r\n------------------------------\r\n\r\nWhy this?...\r\nI wanted this armor badly, but I have re-customized my game so much that it will be a mess if I will drop CBBE body for it. And on top of that, I like CBBE curves better, although I cant say that UNP body isnt nice.\r\nAt first, I tried to convert it to the CBBE body, but is not that easy for a starter like me. I  think that such conversion will require the split of the armor in 3 pieces, in order to resize it to the different shape of this body: the chest must be moved to the front to cover the bigger breasts, the pants must go to the back to cover the rounder bottom, sleeves must be moved to the X axis also. And I suppose there will be work on the polygons also to make it fit the body shape smoothly. Oh, and there may be another way by replacing the body skin that shows up with CBBE skin, but that is already SF for me. No wonder Hentai didnt wanted to do it, this is like almost making it from scratch and can be solved only by the hands of a skilled modder. Anyone?!\r\nSo, the only temporary solution that I was able to come with was to cover the deformed breasts on the UNP version. Sounds easy, but I needed a lot of tries until I figured the best combo. And I couldnt do it at all with the original size provided by Hentai. Luckily, dimon99, the author of the UNP body, has made a sliding version and provided me the permission to use it for you. And even so, only with his largest size of armor I could cover that bra properly.\r\nI tried to make it work with the weight slider, but either I couldnt fit the UNP bra on _1.nif file, either the CBBE bra didnt wanted to get smaller on _0.nif file. In the end I tried to use the armor size from the dimon99`s _1.nif file on both nifs, and it was fine on both 0 and 100 sizes, but it didnt worked at all between them. so, I have decided to drop the sliding and give you the possibility to choose between two body variants: skinny (weight 0) and large (weight 100).\r\nTake note that I have worked entirely in NifSkope. I could take it to 3dsMax and try to make it work, but I am a starter there too and I didnt had the patience to start it over there yet (I struggled with it 2 days). \r\nIn conclusion, with this ”adaptation”, your char or follower will still have the UNP body shape and the shadows under the breasts, but you will be able to use this wonderful armor in decent conditions while keeping the CBBE body installed. And lets not forget the sexy bra created by anano...\r\n\r\nEnjoy!",
  "categoryId": "54",
  "version": "1",
  "author": "by Hentai - dimmon99 - anano - Cicattrix",
  "createdUnix": "1330950224",
  "updatedUnix": "1330970569",
  "containsAdultContent": false,
  "uploadedBy": "Cicattrix",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40353",
      "name": "Skinny variant",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1682",
      "fileName": "Skinny variant-12183-1.7z",
      "uploadedUnix": "1330950618",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/2a9e262929789a7735386062013fafc8755141a2c67379c47c5fb4adcc94dba5/analysis/1406732252/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skinny%20variant-12183-1.7z?fid=40353&ttl=1535773896&ri=8192&rs=8192&setec=82afdd9188d28c67576a1c124fceb649"
    },
    {
      "fileId": "40354",
      "name": "Large variant",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1690",
      "fileName": "Large variant-12183-1.7z",
      "uploadedUnix": "1330950681",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/610e60878fabd97123b3f67fc1ecba1bd03d98f490a6fff9bda13f2679568580/analysis/1406732255/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Large%20variant-12183-1.7z?fid=40354&ttl=1535773897&ri=8192&rs=8192&setec=73705a2408318b02bae04d635a2a1e56"
    },
    {
      "fileId": "40469",
      "name": "Large variant - No Shoulders",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1690",
      "fileName": "Large variant - No Shoulders-12183-1.7z",
      "uploadedUnix": "1330970496",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/960c5b74a46d65df13cf9fcd7461ff29284e523c4245ff953f7b7f98846363ed/analysis/1406733063/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Large%20variant%20-%20No%20Shoulders-12183-1.7z?fid=40469&ttl=1535773897&ri=8192&rs=8192&setec=e4dc31cfe87d13d0fa39944290588e21"
    },
    {
      "fileId": "40470",
      "name": "Skinny variant - No Shoulders",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1638",
      "fileName": "Skinny variant - No Shoulders-12183-1.7z",
      "uploadedUnix": "1330970569",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/9035489f12349e4bbd2e14948768c8b3a82999f51e586de93ed2b4f6daf4190f/analysis/1406733065/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skinny%20variant%20-%20No%20Shoulders-12183-1.7z?fid=40470&ttl=1535773898&ri=8192&rs=8192&setec=0aceb31f4c375a140a6b63ea75ff549f"
    }
  ]
}