{
  "modId": 12198.0,
  "modName": "Skyrim Barbers - Traduzione italiana",
  "summary": "This is only a translation into Italian of the original mod.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/downloads/file.php?id=12117]original mod[/url].\r\nThe original mod adds a barber!\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size]\r\n\r\n[color=red][b]ATTENZIONE![/b]\r\nQuesta è solo la traduzione italiana del mod originale che trovate [url=http://skyrim.nexusmods.com/downloads/file.php?id=12117]qui[/url].[/color][/center]\r\n\r\n[center][color=GREEN][size=+4]UNA TRADUZIONE DRAGONBORN ITALIA[/size][/color][/center]\r\n\r\n[color=green][b]DESCRIZIONE[/b][/color]\r\nQuesta mod aggiungerà un barbiere che vi permetterà di rinfrescare il look del vostro personaggio! Certo, si può fare anche tramite console, ma così non è più gradevole?\r\nL\\'obbiettivo, a detta dell\\'autore, è di inserire un barbiere in tutte le principali città, ognuino con la sua bottega. Molto importante tenere a mente che, una volta aperta la finestra di modifica del personaggio, vi sarà possibile cambiare anche razza e sesso, ma questo è fortemente sconsigliato dall\\'autore.\r\n\r\nNella versione attuale ci sono ancora alcuni problemi, infatti ad alcuni il barbiere, benchè funzionino i dialoghi e tutto il resto, non taglierà i capelli. L\\'autore ha già annunciato di aver individuato il problema ed ha promesso di correggerlo a breve. Per chi intanto volesse comunque provarla, sapete dove trovare la traduzione!\r\n\r\n[color=green][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n[color=green][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!\r\n\r\n",
  "categoryId": "33",
  "version": "2.0",
  "author": "klop",
  "createdUnix": "1330961839",
  "updatedUnix": "1330961839",
  "containsAdultContent": false,
  "uploadedBy": "klopklop",
  "primaryFile": null,
  "files": []
}