{
  "modId": 12207.0,
  "modName": "Revised Character System",
  "summary": "RCS is a perk and attribute mod that focuses on the RPG factor in the action-RPG duality. It aims to incorporate attributes in skill effectiveness and provide a smoother progression.",
  "descriptionHtml": "[size=5]Faulgor\\'s Revised Character System (FaRCS)[/size]\r\nVersion 1.0 beta\r\n\r\n========================\r\n\r\nRCS is a perk and attribute mod that focuses on the RPG factor in the action-RPG duality. Its main goals are:[list]\r\n[*]Reintroduce functions of attributes into the character design process\r\n[*]Smooth level progression by replacing generic base perks\r\n[*]Enhance underdeveloped playstyles, like agile characters, staffs, distinction between light and heavy armor\r\n[*]Further increase the advantage of specialization by taking limited attribute points into the equation\r\n[*]Rebalance of fortification effects\r\n[*]Decrease in leveling speed\r\n[/list]\r\nMost of these changes have been made by introducing new or replacing old perks, with a few necessary changes to existing items and effects. Thus, RCS comes from a different angle than most combat enhancing mods, and works quite well with most of them.\r\n\r\n========================\r\n\r\n[color=#ff0000][size=5]WARNING[/size][/color]\r\n\r\n[color=#ff0000]Before using this mod, make a new save. Unequip all items and let all potion durations expire. A change in active magic effects can damage your character permanently![/color]\r\nFurther, if you want to use RCS with an existing character, you will need a mod that resets your perks. Doing so by hand with the console is tedious, and neglecting to reset your perks will result in unintended effects and loss of perks.\r\n\r\n========================\r\n\r\n[size=5]Installation[/size]\r\n\r\nCopy the files into your Skyrim\\\\Data folder, and select Revised Character System.esp in the Skyrim Launcher.\r\nIf you are using Skyrim Spells Restored, RCS needs to load after SSR.\r\n\r\n========================\r\n\r\n[size=5]Compatability[/size]\r\n\r\nAs I said above, RCS should work with most combat modifications. However, they can produce imbalances when they add their own dodging mechanics, such as Duke Patrick\\'s.\r\nSmithing Overhauls can be used as well. However, if they change the smithing perks, they will have to be loaded after RCS.\r\nMods that add new enchantments or staffs may not work with the corresponding perks.\r\n\r\n========================\r\n\r\n[size=5]Recommended mods[/size]\r\n\r\n[url=file.php?id=10520]Skyrim Spells Restored[/url] by Faulgor (optional version without skill changes)\r\n[url=file.php?id=3665]Paid Perk Reset[/url] by zenofx (requires ScriptDragon)\r\n[url=file.php?id=1269]Improved Skyrim Experience[/url] by Pluto (PISE)\r\n[url=file.php?id=5485]Deadly Combat[/url] by Borgut1337\r\n\r\n========================\r\n\r\n[size=5]Feature list[/size]\r\n\r\nHere’s a list of current perk and skill changes\r\n\r\nAlteration\r\n* Spell magnitude scales with skill level (+1% per level)\r\n\r\nConjuration\r\n* Spell magnitude scales with skill level (+1% per level)\r\n\r\nDestruction\r\n* Spell magnitude scales with skill level (+1% per level)\r\n\r\nIllusion\r\n* Spell magnitude scales with skill level (+1% per level)\r\n\r\nRestoration\r\n* Spell magnitude scales with skill level (+1% per level)\r\n\r\nEnchanting\r\n* Enchanter: Your magicka increases the strength of your enchantments. (~+1% per 10 magicka)\r\n* Wizardry (Enchanter 30): Your magicka lowers charge cost of staves.\r\n* Mantle of Magnus (Wizardry 50): Your Enchanting skill level increases damage with staves.\r\n\r\nArchery\r\n* Overdraw: Your health and stamina increase your damage with bows. (+0.3 per 10 health, +0.5 per 10 stamina)\r\n* Spectral Arrow (Critical Shot 40): Your magicka lowers charge cost of enchanted bows.\r\n\r\nBlock\r\n* Shield Wall: Your health and stamina increase blocked damage. (+1% per 10 health, +1% per 10 stamina)\r\n\r\nOne-Handed\r\n*Armsman: Your health increases your damage with daggers, swords, battleaxes and maces. (+0.8 per 10 health)\r\nWindblade (Armsman 30): Your stamina increases attackspeed with daggers, swords, battleaxes and maces. (+1% per 10 stamina)\r\n* Spellsword (Armsman 30): Your magicka lowers charge cost on enchtanded daggers, swords, waraxes and maces.\r\n* Martial Arts: Your health increases unarmed damage. (+0.8 per 10 health)\r\n* Enduring Fighter (Martial Arts): 25% less stamina cost with unarmed power attacks.\r\n* Fists of Steel (Enduring Fighter): Your gauntlets increase unarmed damage. (All of them.)\r\n* Fists of Randagulf (Fists of Steel): Power attacks against staggered enemies cause double critical damage.\r\n\r\nTwo-Handed\r\nBarbarian: Your health increases your damage with greatswords, battleaxes and warhammers. (+0.8 per 10 health)\r\nBerserker (Barbarian 30): Your stamina increases attackspeed with greatswords, battleaxes and warhammers. (+1% per 10 stamina)\r\nArcane Might (Barbarian 30): Your magicka lowers charge cost with enchanted greatswords, battleaxes and warhammers.\r\n\r\nSmithing\r\n* Replaced “improve twice as much” benefits with “get twice as many ingots from ore”.\r\n* Goldsmith (Steel Smithing 40): You get twice as many ingots from gold and silver ore.\r\n\r\nHeavy Armor\r\n* Juggernaut: Adds a chance to stagger a hitting opponent when wearing heavy body (!) armor. Increases with Heavy Armor skill. (+0.4% per skill level)\r\n* Strongback (Juggernaut 30): Increases carrying capacity with your heavy armor skill.\r\n* Magical Barrier (Juggernaut 50): Your  magicka increases magic resistance when wearing heavy body armor. (+0.3% per 10 magicka)\r\n* Conditioning (3) (Stronbgack 40/60/80): Heavy armor weighs 10/20/30% less.\r\n* Tower of Strength (2) (Conditioning 50/70): 25/50% less stagger when wearing heavy body armor.\r\n\r\nLight Armor\r\n* Agile Defender: Adds a chance to dodge (slow time) when being attacked in light body (!) armor. Increases with skill level. (+0.4% per skill level)\r\n* Magical Evasion (Agile Defender 40): Your magicka increases magic resistance when wearing light body armor. (+0.3% per 10 magicka)\r\n* Unhindered (3) (Custom Fit 40/60/80): Light armor weighs 30/40/50% less.\r\n* Wind Walker (2) (Unhindered 50/70): +25/50% stamina regeneration in light body armor.\r\n* Thick Skin (3): 30/40/50 armor rating when wearing no body armor.\r\n* Swiftfoot (Thick Skin): When not wearing any body armor, your stamina adds a chance to dodge (slow time) when being attacked. (+0.16% per stamina)\r\n* Full Force (Swiftfoot): Power attacks without any body armor cost 25% less stamina.\r\n* Momentum (Thick Skin): When not wearing any body armor, increases attackspeed by 10%.\r\n* Athlete (Momentum): Your stamina increases your running and sprinting speed. (+2 per 10 stamina)\r\n* Acrobat (3) (Momentum): Lowers fall damage by 25/50/75%.\r\n* Leaper Demon (Acrobat): Increases jumping height. (Not implemented =()\r\n\r\nLockpicking\r\n* Increased difficulty on high level locks.\r\n\r\nPickpocket\r\n* Light Fingers: Your stamina increases your pickpocket chance slightly. (+1% per 10 stamina)\r\n* Bandit: Attack on targets with more than 30 gold have an increased critical chance. (+0.2% per skill level)\r\n\r\nSneak\r\n* Stealth: Your stamina increases your chance to stay undetected. (1% per 10 stamina)\r\n* Backstab: Works with unarmed attacks. (Not implemented yet)\r\n\r\nSpeech\r\n* Helping Hand: Friends, allies and lovers give you better buying and selling prices. Increases with Speech skill. (Not working correctly due to CK bug)\r\n\r\nAlchemy\r\n* Alchemist: Your magicka increases the strength of your potions. (+1% per 10 magicka)\r\n\r\n* All fortification effects (enchantments and potions) now directly increase the skill level.\r\n* Leveling speed is reduced to 50%.\r\n\r\n========================\r\n\r\nRemember, this is a beta version. Not all effects will function properly.",
  "categoryId": "73",
  "version": "1.0",
  "author": "Faulgor",
  "createdUnix": "1330966766",
  "updatedUnix": "1330967216",
  "containsAdultContent": false,
  "uploadedBy": "Faulgor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40445",
      "name": "Revised Character System 1_0 beta",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31",
      "fileName": "Revised Character System 1_0 beta-12207-1-0.7z",
      "uploadedUnix": "1330967216",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ac5b978ef50cfa8c388945f327b1eb48694f95c3eb580f2fe258f047d8957706/analysis/1406732893/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Revised%20Character%20System%201_0%20beta-12207-1-0.7z?fid=40445&ttl=1535773928&ri=8192&rs=8192&setec=44aa15f14cd3f42d519c80cac66a2161"
    }
  ]
}