{
  "modId": 12222.0,
  "modName": "Diu Vux - Day Long Candlelight Spell",
  "summary": "Conjure a ball of light that follows you around for a full 24 hours - no more constant re-casts in long dungeons! ",
  "descriptionHtml": "Diu Vux - \\'Long Light\\' in Latin.\r\nPart of DyingAtheist\\'s New Spells series.\r\n--------------------- \r\n\r\nCandlelight, for Mages who do not wish to carry a Torch, is an immensely useful spell. Especially if you play with other mods that increase the darkness of dungeons.\r\nHowever, it lasts for a maximum of 60 seconds, and that is a lot of re-casting in a long dungeon.\r\nSo I present to you, Diu Vux!\r\nThe spell tome, availiable in the Arcaneum of the College of Winterhold on the librarian\\'s desk, will teach you the Diu Vux spell; this level 50 Alteration Spell (Adept) will summon a ball of light that follows you for an entire in game day. \r\nYou will require a slightly sizeable mana bar, as this spell is designed with Mages in mind (Failing that, get yourself some Alteration mana reduction gear!) but it should save a lot of spell swapping in dungeons. \r\nEnjoy!\r\n\r\nTO INSTALL - Drag the .esp file into your Skyrim Data folder.\r\nTO UNINSTALL - Do the opposite of what I just said. \r\nNOTES - The spell says it has a constant, per sec cost. It does not. That\\'s an error. \r\n--------------------- \r\n\r\nThe plan in future is to have a host of new spells/tomes that are accesible through a secret library room, itself requiring the completion of a unique quest.\r\n\r\nIf interested, follow the link for my Youtube channel, where I play through Skyrim (Among other games) and record Mod Spotlights as well as a Creation Kit Tutorial series. \r\nhttp://www.youtube.com/user/ForAdventure?feature=mhee",
  "categoryId": "75",
  "version": "1",
  "author": "DyingAtheist",
  "createdUnix": "1330985344",
  "updatedUnix": "1330985564",
  "containsAdultContent": false,
  "uploadedBy": "DyingAtheist",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40553",
      "name": "Diu Vux - Day Long Candelight Spell",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Diu Vux - Day Long Candelight Spell-12222.rar",
      "uploadedUnix": "1330985564",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/c75bb3fb99facb1d05f1ab8afd5dc95bb472547e42c4156c196f1f4bb11f1186/analysis/1406733624/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Diu%20Vux%20-%20Day%20Long%20Candelight%20Spell-12222.rar?fid=40553&ttl=1535773953&ri=8192&rs=8192&setec=637e5090aeb8b07763711b8b45c0bf00"
    }
  ]
}