{
  "modId": 12220.0,
  "modName": "The Lodge",
  "summary": "A orc style longhouse in The Rift. ",
  "descriptionHtml": "Do you dream of living in your very own orc longhouse? Then The Lodge is for you! This house is situated northeast of Ivarstead, just along the river. If you follow the river and water cascades from Ivarstead, and cross it right before you get to the huge drop off, you\\'ll find it. There is a fast travel marker that\\'s visible but you must travel there first to enable it. \r\n\r\nThere\\'s ample storage, alchemy and enchanting stations on the first floor, and a small basement with most of the blacksmith crafting stations present. The only one not there is the tanning rack, which is outside with the wood chopping block. All of the storage containers are empty and do not respawn. Most of the loot is fairly minor and does not respawn. Right now, the house is open and free to use but later on when someone posts a tutorial with a script on how to make the house buyable, I will change that in the future. I\\'ve tried it myself and believe me, scripting is not my forte, so I\\'m going to leave that the more talented folk of the modding community. \r\n\r\nThe house and basement are navmeshed so it should be follower friendly. If you use or want to use the excellent mod, Spouses Can Live Everywhere, then this mod has been tested with that and everything seems fine. Please, let me know if you run into any issues. \r\n\r\nThis mod may not be uploaded to other mod sites without my permission. Just be courteous and ask, okay? I\\'ll more than likely say yes. \r\n\r\nInstallation: \r\nUnpack the rar file and drag and drop the meshes folder and esp file into your Skyrim Data directory. Make sure it\\'s activated from the Skyrim main launch window on your next game startup. Enjoy!\r\n\r\nRequirements: \r\nThe latest Skyrim update. \r\n\r\nConflicts:\r\nNone that I\\'m aware of. \r\n\r\nRecommended Mods:\r\nSpouses Can Live Everywhere\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11370",
  "categoryId": "67",
  "version": "1.0",
  "author": "mellowtraumatic",
  "createdUnix": "1330984763",
  "updatedUnix": "1330984815",
  "containsAdultContent": false,
  "uploadedBy": "mellowtraumatic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40545",
      "name": "The Lodge",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "183",
      "fileName": "The Lodge-12220-1-0.rar",
      "uploadedUnix": "1330984815",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/14853c86145d670a245b7d9ff6ecae1cbca16806c421a5b96969a8a48860b1c9/analysis/1406733458/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Lodge-12220-1-0.rar?fid=40545&ttl=1535773950&ri=8192&rs=8192&setec=4c156f19480a10afa15eb14c8acfdbef"
    }
  ]
}