{
  "modId": 12234.0,
  "modName": "Uncle Sheogorath",
  "summary": "Uncle Sheogorath\\'s Really Helpful Hints and Tips.",
  "descriptionHtml": "[center][img]http://www.gwdbooks.com/Uncle%20Sheo%20Splash.jpg[/img][/center]\r\n\r\n[b]UNCLE SHEOGORATH\\'S REALLY HELPFUL HINTS AND TIPS[/b]\r\n\r\nEverything you need to know about Skyrim and the other lands of Nirn, available for you right here in a handy little magic pill.\r\n\r\nSorry about the lilac coating. I was out of Bosmer. But lilacs taste almost the same, if you cross your eyes first.\r\n\r\nI\\'ve been watching you through your little magic viewing portal thingie. Very nice. Very nice indeed. It takes me all the way back. Oh, the laughter, the screams, the lakes of mixed bodily fluids, the rare cheeses... But Haskill\\'s looking at me like one of those things. Puppies? Fish? Which is it that goes well with lemon sauce? Anyway, he\\'d BETTER STOP IT RIGHT N -- Fine. \r\n\r\nSo. Your portal thingie. BOOOOOORING. All that dull, unnecessary information they\\'re forcing on you. Useless. I thought I\\'d lend a hand. SO I AM. I\\'ve replaced all that so-called \\'fact\\' for you, with my very own really helpful hints and tips to help you stay alive and well around Skyrim. You can thank me later. YOU HAD REALLY BETTER THANK ME LATER OR I\\'LL DROP BY IN THE NIGHT AND CHOP YOU INTO FILLETS. To go with lemon sauce. SO THERE.\r\n\r\nRun along now, and have fun. Toodle-oo!\r\n\r\n-----\r\n\r\nWHAT IS THIS?\r\n\r\nIt removes all of the loading screen hints and tips in the game and replaces them with a blend of helpful, enlightening, confusing, untrue, insane, funny and/or peculiar observations from Sheogorath, the Daedric Prince of Madness. \r\n\r\n\r\nWHAT VERSION ARE WE ON?\r\n\r\nThis is the launch version, 1.0. \r\nLatest updates: There aren\\'t any, obviously.\r\n\r\n\r\nHOW DO I INSTALL IT?\r\n\r\nWith the Nexus Mod Manager, or manually by downloading the archive, unpacking it to your Skyrim installation\\'s /Data folder, and activating Uncle Sheo.esp.\r\n\r\nThis mod will only conflict with other mods that alter the base loading screen hints and tips. Even that shouldn\\'t cause any harm though, it\\'ll just change what you see on the loading screens.  It doesn\\'t conflict with KenMod\\'s Loading Screen Time. I rely on LST to get me to bed at a half-sane time :) \r\n\r\nIf you have Static Loading Screens active, the mod won\\'t do anything. Just saying.\r\n\r\n\r\nBUT WHAT HAVE YOU DONE??\r\n\r\n* I have replaced all 299-ish of the original loading screen tips with an equivalent -- but better :) -- piece of information. \r\n* I have not wildly deviated from the original subject matter (much). \r\n* I have not added in entirely new tips. Well, maybe just one or two.  \r\n* I have not changed the screen images associated with the tips. I think.\r\n\r\nIn future updates, I may improve current tips, add more tips, alter screen images, or otherwise attempt to make things better. I may also do another set of loading screen tips from a different character\\'s viewpoint. The world is my textual oyster.\r\n\r\n\r\nWHY?\r\n\r\nWhy not? I\\'m utterly fed up with the same old tedious loading screen texts. Aren\\'t you? \r\n\r\n\r\nBUT *WHY*?\r\n\r\nI\\'m a professional writer and editor. I\\'m not a coder. I\\'m hopeless at 3D modelling. I can barely draw stick-figures. So I figured I\\'d stick to what I know -- words and madness -- and combine them into one delicious little package. You can cyber-stalk me at @ghostwoods.\r\n\r\nIf you find this mod amusing, I\\'d love an endorsement!\r\n\r\n\r\nCAN I...?\r\n\r\nTranslate this / Add this to a compilation / Put extracts of it up on the web / Set it to music / Make T-shirts out of it / Mail it to the Bilderberg Group Members? Sure, go ahead. Just include a credit and mention my Twitter username.\r\n\r\nContact you about something else? Sure, drop me a PM or get me at Twitter.\r\n",
  "categoryId": "42",
  "version": "1.0",
  "author": "Tumbleworld",
  "createdUnix": "1330993896",
  "updatedUnix": "1330994273",
  "containsAdultContent": false,
  "uploadedBy": "tumbleworld",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40604",
      "name": "Uncle Sheogorath",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31",
      "fileName": "Uncle Sheogorath-12234-1-0.zip",
      "uploadedUnix": "1330994273",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/eae14e577f2328c7941401d17df95bd0720983b11c1c10e297b64d9524820259/analysis/1406733888/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Uncle%20Sheogorath-12234-1-0.zip?fid=40604&ttl=1535773970&ri=8192&rs=8192&setec=4c308a4ad414812a85bac6f59bcd193d"
    }
  ]
}