{
  "modId": 12243.0,
  "modName": "Fierce Assassin Thief Lydia",
  "summary": "Fierce Assassin/Thief Lydia 1.0\r\nThis is a mode with the thought of changing Lydia a little bit. Or maybe a bit more :)",
  "descriptionHtml": "Fierce Assassin/Thief Lydia 1.0\r\n\r\n\r\nThis is a mode with the thought of changing Lydia a little bit. Or maybe a bit more :)\r\nI changed the face and hair so Lydia looks like a fierce warrior, so she dosnt look like a newbie, but someone who was in a couple of fights (sadly as she wears nightingale helmet, her face cant be seen, but there are some modes that made the face visible, just look for it).\r\nMore to it i changed her behavior completely. She now is a double blade fighter, specialized in assassination and theft, so she is a great follower for a stealth player. If i made it right, she should behave when you are on assassination trips, she should be carefull, and not run into fights, so everyone knows where you are even before you do something.\r\nShe is equipped with 2x Nightingale blades, and complete set of Nightingale Armor (the highest rate ones), boosted by a light armor ring (highest rate) and perk Matching Set. Nightingale Bow and set of 1000 ebony arrows.\r\nShe is excelent in a stealth, boosted by a stealth amulet (highest rate) muffled perk. \r\nAll her stats and skills are changed to be good for a higher level player.\r\n\r\nAll specifications are in the images. Game images will come probably after my loong rest :)\r\n\r\nPS: its possible to make some changes. Just ask.  \r\n\r\nInstruction to use:\r\nManual instal, download and unpack into your main game folder\r\nNMM instal, download and just instal.\r\n\r\nIMPORTANT!!!: Dont remove the Steel Sword from Lydia, as she will stop figting.\r\nIn the begginning she will wore the old equipment, but after you take something from her inventory or you go through a loading screen, she will be equipped in full Nightingale.\r\nTake from her everything beside the Nightingale (any shields, armor and weapons, but not the Steel Sword). \r\nShe is equipped by a Nightingale, but she wont wore the one she got in her inventory, its a spare which you can take, upgrade and give it to her back. She will than wore this one instead. \r\n\r\n\r\n\r\nAs i am no modder, i used the help of the Skyrim NPC Editor (http://skyrim.nexusmods.com/downloads/file.php?id=4554), which is a great and easy to use tool, even for a dummy like me.\r\nMy thanks go to the maker of this tool: foretrenty (whom i personally asked for a permission to put this mode here)\r\nIf you would like to use this mode in any other means, just ask for my permission. \r\nPlease dont upload it on Steam Workshop.",
  "categoryId": "66",
  "version": "1.0",
  "author": "Cohenat",
  "createdUnix": "1330998923",
  "updatedUnix": "1330999403",
  "containsAdultContent": false,
  "uploadedBy": "Cohenat",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40620",
      "name": " Fierce Assassin Thief Lydia",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "460",
      "fileName": " Fierce Assassin Thief Lydia-12243-1-0.rar",
      "uploadedUnix": "1330999403",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0871fac9a46375edf06821ac6090efe947236bcc8bca71ce14f4adb81f521380/analysis/1406734023/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/%20Fierce%20Assassin%20Thief%20Lydia-12243-1-0.rar?fid=40620&ttl=1535773987&ri=8192&rs=8192&setec=f8c4d861016bb78fa770f656a7857b5a"
    }
  ]
}