{
  "modId": 12251.0,
  "modName": "Immersive Lore and Hidden Treasures",
  "summary": "ILHT is a mod meant to expand on the many missing details of the game, in several different ways. There are no end goals, aside from it being bug free. Typically this may be a fleshed out civil war camp, making it feel more alive, or enhancing background stories and relationships between npcs.",
  "descriptionHtml": "[b] Update [/b]\r\n\r\nFixed most of the bugs reported by Pnic193 - thank you. I\\'ve also taken some of your suggestions and implemented them, specifically adding more skeletons. With the help of a few friends on steam workshop, I was able to fix the invisible barrier bug. It was a simple (and slightly ridiculous) mistake, but I forgot to adjust the room bounds, so the game was processing the addition l made to the mine seperately. That should no longer be the case - I also did a fairly thorough run thru to make sure I didn\\'t introduce any anywhere else in the mine, but if anyone notices a brief flash of blue space when theyr\\'e running around, let me know and l\\'ll fix it. There shouldn\\'t be any issues, however. Spent about an hour exploring.\r\n\r\nHOWEVER: there are two things I haven\\'t finished yet, mostly cosmetic. I haven\\'t done the lighting in the new area just yet, have to reinstall skyrim. The torch scones are there, and in some cases you may see light without a source, but I will fix it asap. Probably tonight or tomorow - I just wanted to get the major bug fixed. Also, because I\\'m unable to edit landscape,t heres a spot outside whiterun where I\\'m putting something in. Most of the grass may look like it\\'s floating - it is, but l can\\'t fix it till skyrim reinstalls. Don\\'t know why l\\'m having trouble with missing files, but l am.\r\nIt\\'s not game breaking, but it is visually weird & annoying.\r\n\r\nThanks, guys. Probably going to clean up the description sometime this week, too. \r\n\r\n~~~~~~~~~~~~\r\n0.0.3 :\r\nAnother mini quest, although this one is fairly indepth. Without giving spoilers, theres a new landmark location, which should help with guiding players to part of the quest line, and a - hopefully - interesting character development. I also gave a certain mine an atmospheric makeover to suit the new quest, including adding blood spatters and a burial spot of sorts. Still need to flesh out the new room a bit more, but wanted to get this out now. Thanks for the support, guys. really been amazing.\r\n--------------------\r\n- 1 npc celebrating a birthday. This one includes a gift with some hopefully small changes to the persons house, as well as lighting in the one area. Shouldnt\\' alter anything other than that, however. (More to come.)\r\n\r\n- a small unmarked quest exploring the motivations and character of one npc in the Whiterun area, with some inactive npcs acting as support for the quests\\' storyline.\r\n\r\n- a thief that died in front of a bandit fort, mid-escape. You\\'ll find the bandits didn\\'t even care enough about the items he stole to take the chest. The only matter of importance was his daring to break in.\r\n\r\n- a few letters addressing certain events in the game involving the related npc, often as a sort of foreshadowing. \r\n\r\n[b]What I\\'ve done with the first camp:[/b]\r\n- add a sense of npcs having a daily life\r\n- I\\'ve given the horses a small shelter, food and water\r\n- added evidence of a small ambush (with prisoners to be added later when I figure out how to set them as bound npcs)\r\n- added a tent for a chef, + storage\r\n- added wooden floor bases to the larger tents. If you\\'re wounded, you should not be sleeping on the snow. however, l\\'ve tried to maintain the sense that this is made out of materials that would be practical for a temporary setup\r\n- added a few pelts on the floor\r\n- added a large rain barrel near the side of the camp\r\n- added a half-assed death wagon\r\n\r\n** fixed the placement of the wagon, shrunk the size of teh rain barrel and horse shelter, and mostly (l hope) fixed the navmesh.\r\n\r\n",
  "categoryId": "92",
  "version": "0.0.3",
  "author": "Nyhil",
  "createdUnix": "1331012054",
  "updatedUnix": "1331502805",
  "containsAdultContent": false,
  "uploadedBy": "Nyhilisa",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41248",
      "name": "ILHT Old",
      "version": "0.0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "380",
      "fileName": "ILHT Old-12251.rar",
      "uploadedUnix": "1331180562",
      "modVersion": "0.0.3",
      "virusScanUrl": "https://www.virustotal.com/file/45065453d97b9b7bd651e7419ff74afe21adbc2e860a1f101b8f6e22ea80423c/analysis/1406737216/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ILHT%20Old-12251.rar?fid=41248&ttl=1535774000&ri=8192&rs=8192&setec=e08f7b2d55dc1566c706e8de095aff9e"
    },
    {
      "fileId": "42447",
      "name": "ILHT",
      "version": "0.0.3.a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "514",
      "fileName": "ILHT-12251-0-0-3-a.rar",
      "uploadedUnix": "1331502805",
      "modVersion": "0.0.3.a",
      "virusScanUrl": "https://www.virustotal.com/file/e0aec3077144d24a147f3dde1f1ba565417ef4ad3de22086bba1dabb4f95673f/analysis/1406744107/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ILHT-12251-0-0-3-a.rar?fid=42447&ttl=1535774000&ri=8192&rs=8192&setec=b384576d71d990fdbfff7da8bf903142"
    }
  ]
}