{
  "modId": 12253.0,
  "modName": "Glowtastic",
  "summary": "Adds several castable aura-type glows for aesthetics and RP.",
  "descriptionHtml": "Ever want your character to have some nifty visual aura hanging around your character? \r\nEver wish you could keep those shadowy tendrils on all the time? \r\nDo you play a vampire who wants to actually LOOK the part of creepy walking dead guy? \r\nAre you annoyed that you can\\'t look like you\\'re on fire when you\\'re not? \r\n\r\nWell fret no longer! Now you can be GLOWTASTIC! That\\'s right friends, with Glowtastic, you can wear that dragon soul bling everywhere you go!\r\n\r\nFor fabulous weapons, check out Animated Weapon Enchants : http://skyrim.nexusmods.com/downloads/file.php?id=12668\r\n\r\n\r\nWHAT IT DOES : I made roughly 15 (more now) different illusion spells that do nothing more than add a shader effect to the caster. They\\'re all low-cost, both in magicka and gold, so a starting character could easily pick them up and play the entire game with them (provided you can get into the College).\r\n\r\nThe glows last 8 days or until canceled by the Remove Glows spell, which removes all active glows. This is where I warn you that yes, you can have more than one active at a time, but I have no idea what that\\'ll do to your video card. Some effects are more subtle than others, and a couple are easily over-written if you have others active at the same time. Personally, I enjoy mixing 3 at once because any more than that is too \\\"busy\\\" for my taste. You might feel differently though - feel free to mix and match!\r\n\r\nAs a side note I\\'ve been told that users with epilepsy shouldn\\'t use the either of the storm glows. They\\'re sort of frantic and I might add a \\\"less-busy\\\" version soonish.\r\n\r\nMembrane shaders vs. particle shaders : Most of these are pure particle shaders - that\\'s the \\\"glow\\\" of \\\"stuff\\\" you see coming off your character. Basically if it leaves your character it\\'s probably a particle shader. Membrane shaders are \\\"on skin\\\" effects that move across your actual character, like Mage Armor. Most membrane shaders don\\'t work alongside a particle shader, though some do. I don\\'t think I\\'m smart enough (yet) to figure out a way around that, so mix and match to figure out what works for you.\r\n\r\nThis is all about visual effects. There are no actual mechanics affected, no sounds included, and the glows don\\'t even create actual light sources(so it won\\'t mess with your stealth). It\\'s a tool to assist you in getting to know your character and helping with immersion - play a vampire and use the red glow after you\\'ve fed. Let your fire or lightning mage run around with those effects on them all the time. \r\n\r\nNEW WITH 1.02 : ALL GLOWS ARE AREA OF EFFECT! This means that if you\\'re standing near (pretty much in their face) an NPC, follower, monster, etc. when you cast the glow, they should get it too. Remove glows works the same way and has a slightly larger radius. NOTE : for some reason the area effects don\\'t always work in 3rd person view, but they almost always work in 1st. Absolutely no idea why that is. ALSO - Glows on NPCs seem to vanish when they switch zones. Again, no idea why this happens, but I feel like it might just be a game bug, not anything I can fix. Regardless, I\\'m still trying to find ways around it.\r\n\r\nI made new entries for the shaders and spells, so there shouldn\\'t be any conflicts. \r\n\r\nHOW TO GET STARTED : Download the file and put it in your data directory. Enable the mod, fire up Skyrim, and get glowy! Spell tomes are in a knapsack in the Hall of Attainment, and are buyable from Drevis Neloren. If you like, there\\'s even a short lore-friendly explanation in there too.\r\n\r\nI\\'ll likely add more than a few more effects as time goes on. I don\\'t do requests but if your idea is good enough I\\'ll probably get jealous that I didn\\'t think of it and implement it (and of course give you credit). I\\'ll try to include later additions to the knapsack, but if they\\'re not there then check with Drevis.\r\n\r\nI\\'m a total mod n00b, but if you want to use my work in your own mod, GO FOR IT! Just credit me. If you do use my work, be warned that I didn\\'t organize the shaders in a very logical manner (or at all), so message me if you have problems finding one of the effects. \r\n\r\nThis is indeed my first mod so if you run into any problems, conflicts, or the like, please absolutely let me know so I can look into it!\r\n\r\nAlso go check out Animated Weapon Enchants - http://skyrim.nexusmods.com/mods/12668/\r\n\r\n\r\nVersion history -\r\n1.04 - Added some glows (more \\\"holy\\\" options, black lightning, etc.), cleaned with TES5 Edit.\r\n\r\n1.03 - A couple glows added (smoke, deeper shadow, etc.), minor cleanup.\r\n1.02 - Area effect glows! \r\n1.01 - New glows added.\r\n1.0  - Release!\r\n\r\nFor those of you wondering, for the screenshots I used :\r\nADEC body by Acdale - http://skyrim.nexusmods.com/downloads/file.php?id=5390\r\nADEC armors (orcish with some daedric) - http://skyrim.nexusmods.com/downloads/file.php?id=7782\r\nApachiiSkyHair by Apachii - http://skyrim.nexusmods.com/downloads/file.php?id=10168\r\nCoverwomen by mrLenski - http://skyrim.nexusmods.com/downloads/file.php?id=3563\r\nCraftable Helmet to Circlet by koryushin - http://skyrim.nexusmods.com/downloads/file.php?id=4014\r\n\r\n\r\nCREDITS :\r\nBethesda - I just used some of their existing shaders. A few I tweaked here and there, but their vanilla shaders were the base.\r\nBill 267 for his Rings of Effects mod - it sort of inspired me to make this mod. This is how art works folks : one person does something and it inspires others. \r\nTHE MODDING COMMUNITY! - Seriously, whether you made a mod that only one person likes or you crafted some masterpiece of gaming, you\\'re enhancing people\\'s enjoyment. If I wore a hat, I\\'d be tipping it to you right now!",
  "categoryId": "93",
  "version": "1.04",
  "author": "vysh",
  "createdUnix": "1331016505",
  "updatedUnix": "1352178359",
  "containsAdultContent": false,
  "uploadedBy": "Vysh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "47836",
      "name": "Glowtastic old",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16",
      "fileName": "Glowtastic old-12253.zip",
      "uploadedUnix": "1332998024",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/a5b00f98eba87209d6502c07ed42f81b96506d20fd8e179fa2d5f26a67245df3/analysis/1406785278/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Glowtastic%20old-12253.zip?fid=47836&ttl=1535774003&ri=8192&rs=8192&setec=7c6761d9a79f4c6fcaa20de6e29ae1ea"
    },
    {
      "fileId": "54922",
      "name": "Glowtastic old2",
      "version": "1.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18",
      "fileName": "Glowtastic-12253.zip",
      "uploadedUnix": "1334962284",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/4bc8227bf157a8e4f305b914a49674adb4172352209f4141d820e3d58b9ad3d1/analysis/1406825844/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Glowtastic-12253.zip?fid=54922&ttl=1535774004&ri=8192&rs=8192&setec=d2b1d21e8b42b7d25baa0a3452f2c949"
    },
    {
      "fileId": "85905",
      "name": "Glowtastic old3",
      "version": "1.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "19",
      "fileName": "Glowtastic -12253-1-03.zip",
      "uploadedUnix": "1346572584",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/cfcd484ce0b80b53fc635daae134719f9359e41cad17d122be96f70dcc689d43/analysis/1407140102/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Glowtastic%20-12253-1-03.zip?fid=85905&ttl=1535774004&ri=8192&rs=8192&setec=cb472d278b3758277f03ed30c5d78c7e"
    },
    {
      "fileId": "97753",
      "name": "Glowtastic",
      "version": "1.04",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20",
      "fileName": "Glowtastic-12253-1-04.zip",
      "uploadedUnix": "1352178359",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/e6ffc3c44a1782f857dca00d82b39b208547b035eba0cf4b5c91bf1424b02b56/analysis/1407251588/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Glowtastic-12253-1-04.zip?fid=97753&ttl=1535774004&ri=8192&rs=8192&setec=74ff69781c5d56470915cb5fee00da93"
    }
  ]
}