{
  "modId": 12286.0,
  "modName": "Abandoned Tavern - Player Home",
  "summary": "Modest Player Home, nothing fancy, but I think it looks good.\r\n\r\nClose to Whiterun, in the wilderness",
  "descriptionHtml": "This File is also on Steam Workshop\r\n\r\nThis Mod is compatible with the 1.4 version of Skyrim.  I will be updating regularly\r\n\r\nThis is my first mod I have created for Skyrim, the last time I actually had time to mess with an editor was with Morrowind, and I never released any of those mods, so take it easy with the criticism, however, criticism is what this modder needs to make the mod better, so COMMENT!!!!\r\n\r\nBE SURE TO BACK UP YOUR SAVE FILES EVERY TIME YOU TRY A NEW MOD!!! THIS MOD IS NO EXCEPTION TO THIS RULE.  ALSO, when loading a pre-existing game for the first time with this mod installed, make a new save immediately, this seems to make things work better.\r\n\r\nPlease do not change/modify/ or redistribute this mod without my permission.  Please do not take credit for my creation either.\r\n\r\nThis mod does not contain any game breaking or godly items, it is just a home for the player to decorate and use as storage/home base.\r\n\r\nThis home is follower friendly (navmesh/No AI acquire), however there is no designated area for followers to sleep.  They will sleep in the player\\'s bed though (pretty sure).\r\n\r\nAll containers are non-respawning, meaning you can safely store stuff in them, this includes all barrels and sacks.\r\n\r\nThere is a feast waiting for you, with a fully stocked kitchen, including a shelf down low for all your de-glazing liquids (beer and wine and mead)\r\n\r\nEverything else in the home (surfaces, shelves) are empty and are meant for the player (you) to decorate as you see fit.\r\n\r\nWhat it Contains:\r\n\r\n-Exterior location with map marker/fast travel\r\n-Farm building exterior\r\n-Interior bar, with \\\"secret\\\" trap door\r\n-Storage area\r\n-Kitchen/dining room\r\n-Dark and creepy pantry\r\n-Fancy display hallway\r\n-Bedroom/library\r\n-Smithing area\r\n-Alchemy/Enchanting area\r\n-----------------------------------------------------------------------------------------\r\n\r\n-8 storage chests\r\n-8 display cases\r\n-7 dual weapon/shield plaques\r\n-6 single weapon plaques\r\n-6 Mannequins\r\n-Numerous barrels and sacks\r\n-Many tables, chairs, and shelves\r\n-Alchemy Station\r\n-Enchanting Station\r\n-Cooking Spit - over top of a stove/grill with it\\'s own ventillation hood\r\n-Forge, Leather Tanner, Armor Bench, Sharpening Wheel, Smelter - Smelter and Forge both have ventillation hoods\r\n- \\'Moody\\' lighting ;)\r\n-Wall mounted Dragon Skull, Male Elk, Slaughterfish, and Mudcrab\r\n------------------------------------------------------------------------------------------\r\n\r\nIssues:\r\n\r\n-This mod does not conflict with any other mods as far as I know, but I just released it so I need feedback.  The exception to this is any mod that changes the exterior space where the Tavern is located (look at map pic).\r\n\r\n-This Mod should be compatible with, Val\\'s Crafting Meltdown, Legendary Smithing Upgrades, Jayzus\\' Swords, Lost Art of the Blacksmith, Lore Friendly Armors, and Private Singular Quivers.  NEED CONFIRMATION ON THIS THOUGH, HELP ME OUT!!!!!!!\r\n\r\n-Sometimes the webs and fog disappear from the bar area, I have no idea why.  Reloading, entering/exiting seems to fix this.  Any feedback on this would be appreciated.\r\n\r\n-Sometimes the Mannequins assume a wierd stance, but they primarily stay in the spot that I put them.  I have never experienced a loss of function or loss of armor due to this issue though.  Reloading, entering/exiting seems to fix this though.  Any feedback on this would be appreciated.\r\n\r\n-The Wood Chopping block on the porch outside will sometimes (more often than not) display the chopping animation even when there is no wood cutter\\'s axe in the player\\'s inventory.  However, it will only put wood in your inventory if you have the axe in your inventory too.  Any feedback on this would be appreciated.\r\n\r\nFOR THE FUTURE:\r\n\r\n-A quest perhaps, maybe having to kill someone, and a searching/exploration sequence with a key for the doors.\r\n\r\n-A secret passageway in the pantry, going somewhere (no idea where yet)\r\n\r\n-Possibly follower\\'s quarters\r\n\r\n-MAYBE - BIG MAYBE, a small farm/garden outside\r\n\r\nTo Install:\r\nJust extract the .esp to your skyrim/data folder.\r\n\r\nHow to Contact: goblinsmash@yahoo.com\r\n\r\nChangelog\r\n\r\nVersion 1.1\r\n\r\n-Realized that the dinner plates were Aretino Family Heirlooms,\r\n\treplaced them with Dwemer Plates\r\n\r\n-Optimized Dining Room Table, made it neater\r\n\r\n-Added three dual weapon/shield plaques, one each above a display case in dining\r\n\troom, and one near the alchemy station\r\n\r\n-Added two candles and a light to the Pantry\r\n\r\n-Replaced a Green Generic Banner with a mounted Dragon Skull\r\n\r\n-Placed a mounted Slaughterfish and a mounted Mudcrab right above the mannequins\r\n\r\n-Placed a mounted male elk head near the alchemy station\r\n\r\n-Moved some lights a little closer to the mannequins",
  "categoryId": "67",
  "version": "1.1",
  "author": "Goblinsmash",
  "createdUnix": "1331061430",
  "updatedUnix": "1331072895",
  "containsAdultContent": false,
  "uploadedBy": "goblinsmash",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40818",
      "name": "Abandoned Tavern - Player Home",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "38",
      "fileName": "Abandoned Tavern - Player Home-12286-1-0.rar",
      "uploadedUnix": "1331061854",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8fe4e7955b207a79e3e3b7d025f5e745a8735319b12d08501c2df3b391bbb6f4/analysis/1406735045/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Abandoned%20Tavern%20-%20Player%20Home-12286-1-0.rar?fid=40818&ttl=1535774053&ri=8192&rs=8192&setec=17a1e7983d57220bd809a65d04ebe67e"
    },
    {
      "fileId": "40858",
      "name": "Abandoned Tavern Version2",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "38",
      "fileName": "Abandoned Tavern Version2-12286-1-1.rar",
      "uploadedUnix": "1331072895",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9c8c20523724a483fd1ce77c840a91bdc3adaf19984ac16d52d301ddbaccf994/analysis/1406735240/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Abandoned%20Tavern%20Version2-12286-1-1.rar?fid=40858&ttl=1535774053&ri=8192&rs=8192&setec=c4b5b1533ef468aaa8dc080dc4bec2b1"
    }
  ]
}