{
  "modId": 12293.0,
  "modName": "Hellion Arrows",
  "summary": "This mod adds 17 exploding arrows 1 teleporting arrow and an additional 2 non-exploding arrows (see description below for full list of effects) all with different ranges of damage and effects. These arrows are craftable at the smithing forge under the Misc category. ",
  "descriptionHtml": "This mod adds 17 exploding arrows, 1 teleporting arrow and an additional 2 non-exploding arrows (see description below for full list of effects) all with different ranges of damage and effects. These arrows are craft able at the smithing forge under the Misc category. **TO MAKE THESE ARROWS YOU MUST BE AT LEAST LEVEL 20 WITH THE ARCANE BLACKSMITHING PERK**. All of these arrows fly much faster than the default speed (all fly at least 5000 rather than 3600). These arrows are extremely powerful should be used sparingly. The sheer power of these arrows is the main reason I selected the crafting ingredients that I did (mainly the 2:1 ratio of Daedric arrows to Hellion arrows) so that they require a little work to get and force you to use them sparingly. Due to some requests I have made a Hellion Arrow Merchant who you can purchase the arrows from, he is located in the Whiterun hall of the dead catacombs.\r\n\r\nI made this mod previously just for personal use but have decided to post it so others may enjoy them. I have added my own unique look to the quiver, giving the arrow a more personal touch. I will continue to update this mod for as long as I have ideas. I try to avoid certain effects that you can already do with magic so that I don’t take away your hard earned work of rolling a mage.\r\n\r\nRECOMENDATIONS: \r\n\r\nThe following Mods are ones that i personally use and find very enjoyable in combination with Hellion Arrows. The Arrowsmith allows for easier access to daedric arrows without having to use the command prompt and ruin gameplay. The Wars in Skyrim and Warzones add large scale battles all throughout Skyrim, which are prime encounters for Hellion Arrows. I have provided links to the mods below, the authors of these mods are very talented and gave me the inspiration to create Hellion Arrows and deserve to be noted in this description. Without their mods Hellion Arrows wouldn\\'t have been possible.\r\n\r\n-Arrowsmith v3b - Simple Fletching ( http://steamcommunity.com/sharedfiles/filedetails/?id=7417 )\r\n-Wars in Skyrim ( http://skyrim.nexusmods.com/downloads/file.php?id=6176 )\r\n-Warzones - Civil Unrest ( http://skyrim.nexusmods.com/downloads/file.php?id=9494 )\r\n\r\n\r\nIMPORTANT:\r\n\r\n-Note- I have added a test chest to the top of Breezehome in Whiterun, it replaced the dresser on the right as you enter the room, so if you have any valuables that you don\\'t wish to lose you need to move all of them. If you have already subscribed don\\'t worry, just relaunch skyrim and in you data section of the launcher un-check the Hellion Arrows esp file and then play the game, the dresser should re-appear with all of your items inside. So now just move all of you items to another location and save. Now all you have to do is close skyrim, re-check the Hellion Arrow esp and your good to go. Sorry for the inconvenience\r\n\r\nQ: Can you please remove the chest from breezehome? It is conflicting with other mods.\r\n\r\nA: For those who would like the test chest removed from breeehome. I\\'m very sorry for the inconvenience, however removing the chest entirely will not fix the issue. Because i modified the default version of breezehome it will always conflict with other mods no matter if i remove the test chest or not. The only way to fix the issue would be to either A) make an entirely new Hellion Arrows or B) make sure that whatever breezehome mod your using is loaded after hellion arrows as to make sure the game loads that modified version of breeehome.\r\n\r\n\r\n-Note- most of these arrows will knock you down as well if you are inside the blast\r\n\r\n-Note- The following damages or DMG is the damage the npc receives from the explosion, this does not include damage to the target if struck by the arrow (an additional 24 damage would be received). \r\n\r\n\r\nARROWS: \r\n\r\nSonic-flies much much faster, increased damage from 24 to 50. Almost instant hit. Great for shooting dragons out of the sky\r\n\r\nTesla-shocks all occupants inside the blast radius (150 DMG+ normal shock DMG and effects)\r\n\r\nInferno- burns all occupants inside the blast radius with intense flames (150 DMG + normal fire DMG and effects)\r\n\r\nHydra- large water explosion, considerable amount of force as well (130 DMG)\r\n\r\nSiphon- this arrow when fired, siphons health from all occupants of the blast and gives all absorbed health to you (Ench DMG only to NPC only)\r\n\r\nSoul reaper- massive AOE damage and collects all souls of occupants inside the blast (1000 DMG, this allows for a more timely collection of souls)\r\n\r\nIcicles- an explosion of frost that does frost damage in addition to freezing all the occupants inside the blast for 4 seconds (100 DMG + normal frost DMG + Ice form DMG)\r\n\r\nAlmighty Push- explosion of pure force that sends occupants flying\r\n\r\nParalytic- paralyzes all occupants inside the blast for 6 seconds\r\n\r\nAsh- explosion of scalding ash, burning occupants inside the blast (100 DMG+ normal fire DMG)\r\n\r\nZen- upon impact this arrow produces an explosion that calms all hostiles within the blast zone\r\n\r\nDefault- basic Hellion arrow with no enchant but just as fast, for those regular encounters \r\n\r\nHypno- for 2 min all occupants in the blast will owe allegiance to you and therefore fight for you (working on getting them to follow you when they become affected)\r\n\r\nHell Hound- Upon the explosion, a Hell Hound is brought forth from Oblivion to wreak havoc upon Skyrim until he is killed. The dog is extremely fast and quite large. Due to his unique hellion nature he is completely immune to arrows with magic effects such as Zen and Hypno \r\n\r\nStatic- small shock explosion (90 DMG and reduced shock damage)\r\n\r\nBlaze – small fireball explosion (100 DMG and reduced fire damage)\r\n\r\nSpray – small water explosion (80 DMG)\r\n\r\nCinders- small explosion of cinders that burns the enemy (50 DMG and reduced flame damage)\r\n\r\nFrost- small explosion of frost (65 DMG and reduced frost damage)\r\n\r\n***Flying Raijin***- teleports you to where the arrow impacts. Upon impact releases a force explosion, knocking down all occupants inside the blast (excluding yourself). The arrow is equipped with a range so if fired way up into the air it will not teleport you to wherever it lands. Reduced projectile damage from 24 down to 5 so that other npcs will not pick up this arrow. DO NOT GIVE THIS ARROW TO COMPANIONS, PERSONAL USE ONLY!\r\n\r\n\r\nCRAFTING DETAILS:\r\n\r\nSonic x 15- filled greater soul gem x1, Hawk Feathers x3, Daedric arrow x30\r\n\r\nTesla x 15- filled greater soul gem x1, Void Salts x3, Daedric arrow x30\r\n\r\nInferno x 15- filled greater soul gem x1, Scroll of fire Storm x1, Fire Salts x1, Daedric arrow x30\r\n\r\nHydra x 15- filled greater soul gem x1, Bucket x1, Daedric arrow x30\r\n\r\nSiphon x 15- filled greater soul gem x1, Ultimate Health Potion x2, Daedric arrow x30\r\n\r\nSoul Reaper x 15 - filled greater soul gem x1, Spell Tome Soul Trap x1, Daedric arrow x30\r\n\r\nIcicles x15 - filled greater soul gem x1, Frost Salts x3, Daedric arrow x30\r\n\r\nAlmighty Push x15 - filled greater soul gem x1, Ultimate Magicka x2, Daedric arrow x30\r\n\r\nParalytic x15 - filled greater soul gem x1, Canis Roots x3, Daedric arrow x30\r\n\r\nAsh x15 - filled greater soul gem x1, Vampire Dust x3, Daedric arrow x30\r\n\r\nZen x15 - filled greater soul gem x1, Scroll of Calm x1, Daedric arrow x30\r\n\r\nDefault x30 - filled greater soul gem x1, Daedric arrow x30\r\n\r\nHypno x 15 – filled greater soul gem x1, Draught of Glibness x1, Daedric Arrow x30\r\n\r\nHell Hound x10 - filled black soul gem x1, wolf pelt x2, fire salt x1, Daedric Arrow x15\r\n\r\nBlaze x5 - filled common soul gem x1, fire salts x1, Daedric Arrow x10\r\n\r\nStatic x5 - filled common soul gem x1, void salt x1, Daedric Arrow x10\r\n\r\nSpray x5 - filled common soul gem x1, bucket x1, Daedric Arrow x10\r\n\r\nCinders x5 - filled common soul gem x1, vampire dust x1, Daedric Arrow x10\r\n\r\nFrost x5 - filled common soul gem x1, frost salf x1, Daedric Arrow x10\r\n\r\nFlying Raijin x20- filled greater soul gem x1, atomizing crystal x2, Daedric Arrow x30\r\n\r\nINGREDIANT:\r\n\r\nAtomizing Crystal- Do not eat this crystal as it will kill you!! \r\n\r\nCHANGES:\r\n\r\n3/16/12\r\n-Added New Teleporting Hellion Arrow “Hellion Arrow – Flying Raijin” this arrow is something that i have been trying to do since the inception of hellion arrows. \r\n-Added new crafting ingredient to game “atomizing crystal” used for crafting flying raijin. Crystals only available at vendor “Wweezzyy” (placed 2 inside test chest in breezehome)\r\n\r\nIf you enjoy this mod please rate :) many thanks!",
  "categoryId": "55",
  "version": "1.20",
  "author": "Wweezzyy - yes this is the same author as Steam Community Hellion Arrows",
  "createdUnix": "1331065660",
  "updatedUnix": "1331946371",
  "containsAdultContent": false,
  "uploadedBy": "coletonj",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40838",
      "name": "Old HellionArrows_original no Lite arrows",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "41",
      "fileName": "Old HellionArrows_original no Lite arrows-12293.zip",
      "uploadedUnix": "1331066357",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/92079b945492a4ae2ccb339f6ec8477ec8e4281cae8a31be052aba6fc458a839/analysis/1406735105/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Old%20HellionArrows_original%20no%20Lite%20arrows-12293.zip?fid=40838&ttl=1535774061&ri=8192&rs=8192&setec=e6c686f24a8e37ac9a7127034fa3a90a"
    },
    {
      "fileId": "41744",
      "name": " Hellion Arrows",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "42",
      "fileName": " Hellion Arrows-12293.zip",
      "uploadedUnix": "1331321276",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/fecc6622d8c2b44c7033caddec0b96745a223c9317cf6aeefb62979b676f723f/analysis/1406740024/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/%20Hellion%20Arrows-12293.zip?fid=41744&ttl=1535774062&ri=8192&rs=8192&setec=9b1d5b2f9264b71427368ffa32d71e64"
    },
    {
      "fileId": "42052",
      "name": "Old Hellion Arrows_no name revision of small explosion arrows",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "42",
      "fileName": "Old Hellion Arrows_no name revision of small explosion arrows-12293.zip",
      "uploadedUnix": "1331402979",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/fec629b86d1545c6fe166ef5af4034bcc93e5cf1c067a194e2a9951c4678aa86/analysis/1406741950/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Old%20Hellion%20Arrows_no%20name%20revision%20of%20small%20explosion%20arrows-12293.zip?fid=42052&ttl=1535774062&ri=8192&rs=8192&setec=c2fcef625fb11f04ff6e01103fc6b29f"
    },
    {
      "fileId": "43967",
      "name": "Updated HellionArrows",
      "version": "1.20",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "51",
      "fileName": "Updated HellionArrows-12293-1-20.zip",
      "uploadedUnix": "1331946371",
      "modVersion": "1.20",
      "virusScanUrl": "https://www.virustotal.com/file/89e7fc68d0665d027a1c6c8cb2c964ae985567d7ceca1d9b214f839e4eab93f6/analysis/1406752262/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Updated%20HellionArrows-12293-1-20.zip?fid=43967&ttl=1535774063&ri=8192&rs=8192&setec=aa11d5e09718a33d197275c8e239a0ed"
    }
  ]
}