{
  "modId": 12294.0,
  "modName": "House Decorations - Plants and Flowers -Traduzione Italiana",
  "summary": "This is only a translation into Italian of the original mod of toddkay.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/downloads/file.php?id=10216]original mod[/url].\r\n14 plants and flowers in various planters that can be purchased from vendors and placed in your home as decoration. \r\nArrange them in-game without using the Creation Kit! These were created using static objects & scenery, \r\nbut are entirely NEW objects that you can purchase and move around in-game. In some cases I combined multiple foliage models \r\nto create unique bouquets.\r\n\r\nCurrently, they can be found in Whiterun at \\\"Arcadia\\'s Cauldron\\\", and in Solitude at \\\"Angeline\\'s Aromatics.\\\"\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size]\r\n\r\n\r\n[color=red][b]ATTENZIONE![/b]\r\nQuesta è solo la traduzione italiana del mod originale che trovate [url=http://skyrim.nexusmods.com/downloads/file.php?id=10216]qui[/url].[/color][/center]\r\n\r\n\r\n[center][color=GREEN][size=+4]UNA TRADUZIONE DRAGONBORN ITALIA[/size][/color][/center]\r\n\r\n\r\n[color=green][b]DESCRIZIONE[/b][/color]\r\nPiante e Fioriere bellissime per arredare la vostra casa.\r\nLe potete trovare al \\\"Calderone di Arcadia ed al \\\"Aromaticità di Angeline\\\".\r\n\r\n\r\n[color=green][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n\r\n[color=green][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!",
  "categoryId": "85",
  "version": "2.0",
  "author": "marcovaldo",
  "createdUnix": "1331066048",
  "updatedUnix": "1331066048",
  "containsAdultContent": false,
  "uploadedBy": "marcovaldo",
  "primaryFile": null,
  "files": []
}