{
  "modId": 12308.0,
  "modName": "Sexy Solitude v1",
  "summary": "A complete and sexy overhaul of Solitude, the jewel of Skyrim!",
  "descriptionHtml": "[center][img]http://jamesfreilly.com/sexy-solitude.jpg[/img][/center]\r\n[center][youtube]fCLEKEbZcDE&feature=youtu.be[/youtube][/center]\r\n\r\n[color=red]Sexy Solitude 1.0[/color] \r\n\r\n[b]DESCRIPTION:[/b] I give you [b]Sexy Solitude 1.0[/b], a near-complete retexturing of the city of Solitude, and a companion piece to my other mods - \r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7241]Sexy Riften v2[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7059]Sexy Whiterun v3[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7484]Sexy Winterhold v1[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7583]Sexy Villages and Towns v1[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7178]Sexy Windhelm v2[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=12928]Sexy Boats [/url] \r\n\r\n[color=red][b]Please, if you use and like these or any other file on the Nexus, please endorse as it only takes a second, and it makes us modder folk feel all warm and fuzzy inside![/b][/color] \r\n\r\n[center][youtube]AEY3mrCtAno[/youtube][/center]\r\n\r\nAs with my most recent mods, this retexturing of Solitude, the jewel of Skyrim, goes beyond just saturating the colors of the original textures. This is a full redo of almost every single texture seen in Solitude, once again, using photographs of era appropriate items and materials. I\\'ve pushed texture size a bit, here, making both the textures and normal maps 1024x1024, which, I find, makes things a touch sharper. This should still run fine on medium spec machines, however!\r\n\r\nSo what\\'s new about Sexy Solitude? \r\n\r\n[center][youtube]VCDgE_d3fls[/youtube][/center]\r\n\r\nAs always, just about everything, but, this time out, I decided to try and maintain much of the city\\'s original look in terms of the structure of things such as doors and windows, painstakingly retexturing each with new, more photorealistic materials, but keeping the general \\\"look\\\" the same (well, besides them looking newer and sexier!). \r\n\r\nAs for stone work, I\\'ve redone it all, both inside and out. The castle walls, house foundations, stucco, ceilings, everthing. I\\'ve also remodeled the interiors with lots of marble, granite, and new carvings. Now Proudspire looks like how the most expensive home in Skyrim SHOULD look! It\\'s decadent, I tell ya! \r\n\r\nAs with Riften and Whiterun, I also remade the windows with a bubbled glass look, new reflection, and replaced/added more colorful and vibrant stained glass that really looks killer at night. \r\n\r\nNatural elements, like grass, dirt, moss, and ivy have all been replaced by new photorealistic hi-res textures. \r\n\r\nAlso retextured were the grates, manholes, rope, gates, wall studs, gravestones, windmill, stone mill, etc... \r\n\r\nAs for vanilla textures, I used three (brought over from the \\\"hi res\\\" files from Bethesda\\'s DLC Texture pack), including 2 banners and the throne (I wasn\\'t going to bother redoing that as it looks fine as it is). All were sharpened and enhanced in terms of color.\r\n\r\n[color=red][b]If you use it and like it, an endorsement would be much appreciated! It\\'s nice to know people like what you\\'ve done! :)[/b][/color]\r\n\r\n[color=red][b]Notes on Using with Bethesda HQ Texture Pack:[/b][/color] This mod, like most of the texture mods, may not work with the Bethesda HQ textures pack unless you do a few tweaks (or simply disable them, which I recommend as there are much better texture mods out than the official ones!). You can find several workarounds  [url=http://forums.nexusmods.com/index.php?/topic/554970-important-info-for-mod-authors-regarding-official-hd-texture-pack] HERE[/url] on the Nexus Forums\r\n\r\nWhile I consider this mod \\\"lore friendly\\\" it is NOT for everyone. Those who like the weathered look of vanilla Skyrim should steer clear. Those who like a more fantastical world, ala Oblivion, The Witcher, and Fable, with more vibrant colors, however, should give this one a try!\r\n\r\nAs with any texture thing I do, it\\'s all for fun and, ultimately, my personal enjoyment. If you don\\'t like it, that\\'s fine, but please don\\'t flame it here as that is AGAINST TOS and your post will be reported. Constructive criticism only, please!\r\n\r\n[b]NMM INSTALL:[/b] Download with NMM and let it do the install for you OR...\r\n\r\n\r\n[b]MANUAL INSTALL:[/b]  Note - There are TWO folders in the textures folder.\r\n\r\nStep 1) Copy the \\\"solitude\\\" folder out of the zip, and paste it into your \\\"/Data/textures/architecture folder. (ie: \\\"Steam/steamapps/common/skyrim/Data/textures/architecture/solitude\\\"). \r\n\r\nStep 2) Copy the \\\"lod\\\" folder and paste it into your \\\"/Data/textures/\\\" folder (or, if you already have an lod folder made, drag the contents of the lod folder on the zip in there. ie; \\\"/Data/textures/lod\\\".\r\n\r\n[b]UNINSTALL:[/b] Delete folders or uninstall with NMM.\r\n\r\nSexy Solitude 1.0 is a companion piece to my other sexy mods:\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7241]Sexy Riften v2[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7059]Sexy Whiterun v3[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7484]Sexy Winterhold[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7178]Sexy Windhelm[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7583]Sexy Villages and Towns[/url]\r\n\r\nUse them all for to create an ultra-sexy Skyrim!\r\n\r\nPLEASE don\\'t IM me to ask if you can upload this to some site in Kazakhstan or Micronesia or translate it into Swahili. For the foreseeable future, my files will be Nexus exclusives, and, while I am more than happy to share this with anyone who wants it, I like to have all the files in one place so I can make changes/updates as I see fit, as well as support anyone who has issues. Thanks for understanding. ;)\r\n\r\nThanks to Bethesda,  to  whom  all of  this  stuff belongs in the first place!  ",
  "categoryId": "53",
  "version": "1.0",
  "author": "horrorview",
  "createdUnix": "1331079340",
  "updatedUnix": "1331079495",
  "containsAdultContent": false,
  "uploadedBy": "horrorview",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40886",
      "name": "Sexy Solitude v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "62187",
      "fileName": "Sexy Solitude v1-12308-1-0.zip",
      "uploadedUnix": "1331079495",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8421a5d9b80953bf8f6ce661f72fdcaaa713b79241ff529831e8699665cb56ff/analysis/1406735326/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sexy%20Solitude%20v1-12308-1-0.zip?fid=40886&ttl=1535774089&ri=8192&rs=8192&setec=1b3f3806d660f5fe1aafb8870b277534"
    }
  ]
}