{
  "modId": 12328.0,
  "modName": "Woad Warrior",
  "summary": "messing with the Creation kit can yield some interesting stuff....",
  "descriptionHtml": "Hello All, \r\n\r\nThis is a pure vanilla armor, yet this has never before been put together. The Woad Warrior Armor was created entirly by accident yet it was tto cool to pass up making.\r\n\r\nBackground:\r\n\r\nA splinter faction of the Forsworn had left the reach and moved North further in to Skyrim in search of new lands, and conquests.\r\n\r\n The Woads, as they where called, where just as fierce and crazy as the Forsworn, if not more so. As their token piece of armor, they used cowhide, uncured and stripped straight from cow\\'s bodies and fashioned into armor. Then they would paint markings in blue dye across the hide. This dye was said to stop arrows and swords in their tracks and cause no harm to befall the wearer. Armed with this belief, when Woads attacked, they attacked fiercely and without any regard to their own safety since they where confident that their armor could stop anything.\r\n\r\nDetails:\r\n-craftable ( needs three cow hides, so either slaughter three cows or use the console)\r\n- temperable ( needs one more cow hide)\r\n- standalone\r\n-looks cool\r\n- male only, (the effect did not look as awesome on the female base clothing)\r\n- tagged as light armor to receive relevant perks etc.\r\n- under the mic tab in the forge menu\r\n\r\nPermissions:\r\ncan do whatever with it, just don\\'t upload to third party sites, especially Steam workshop\r\n\r\nCredits:\r\nBethesda\r\n",
  "categoryId": "54",
  "version": "1.0",
  "author": "modder3434",
  "createdUnix": "1331098315",
  "updatedUnix": "1331098385",
  "containsAdultContent": false,
  "uploadedBy": "modder3434",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40947",
      "name": "Woad Warrior",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Woad Warrior-12328-1-0.7z",
      "uploadedUnix": "1331098385",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/dcf9f6ba24b4089e1bc4f97f668cd36025cc0681e4ed7ddd7f59bd0b5b278622/analysis/1406735771/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Woad%20Warrior-12328-1-0.7z?fid=40947&ttl=1535774132&ri=8192&rs=8192&setec=967dd6c8d7971d8e0a10d0815dd2b5ea"
    }
  ]
}