{
  "modId": 12320.0,
  "modName": "The Sky Haven Temple Restoration Project by Natterforme",
  "summary": "This is a Skyrim Nexus Exclusive.\r\n \r\nA project to completely restore Sky Haven Temple.\r\n ",
  "descriptionHtml": "This is a Skyrim Nexus Exclusive.\r\n \r\nThis mod will attempt to restore Sky Haven Temple. A lot has been done to the interior and the exterior to make it feel less like a structure that has been abandoned for five hundred years. The exterior has been completely scrapped and replaced with a walled fortress that is quite large, extending greatly over the cliff face that abruptly ended the vanilla exterior.\r\n\r\n Install\r\n =======\r\n Throw the .esp file into your Skyrim Data Folder and check the box on your Skyrim Laucher Data Files tab.\r\n \r\nRemove to uninstall.\r\n\r\nUpgrade\r\n =======\r\n I will adding and removing to and from this mod over the coming weeks. Be sure to check in occasionally to recieve the lastest updates.\r\n \r\nPlanned Updates(in no particular order):\r\n \r\n-Reflecting Pool in the exterior cell.\r\n -Merchants and vendors in the exterior cell.\r\n -Full crafting capabilities throughout the cells.\r\n -Integration into the questline. Make upgrade features available for a price like a player home.\r\n -Make the exterior follower and NPC friendly.\r\n -Small Arena and Sparring Areas.\r\n -Addition of gardern elements to remove the sterility of the exterior kit pieces.\r\n -Cliff top Onsen once I figure it out.\r\n -Improve the lighting throughout the cells.\r\n -Improve the lighting for the exterior cells.\r\n -Addition of safe containers, mannequins, book shelves, weapon racks, and other clutter items.\r\n -Exterior stair walkway to the surrounding area.\r\n -Towers, watchfires, and wall ledges to the exterior walls.\r\n -Addition of reasonable suggestions provided by you the player and the community so long as I like them.\r\n \r\nIncompatibility\r\n ===============\r\n This mod will be fundamentally uncompatable with any mod that changes or modifies Sky Haven Temple, both inside and out, and any areas immediately surrounding its proximity.\r\n \r\nKnown Issues or Bugs\r\n ====================\r\n This mod currently breaks quest process and quest rewards for the Blades questline. Until this is changed, it is HIGHLY recommended that you take precautions to preserve your gaming experience. \r\n \r\n\r\n1. Back up your save games.\r\n 2. Finish the Blades Quest Line before installing this mod.\r\n 3. Or only install this mod if you do not intend to finish the Blades Quest Line or have already done so.\r\n 4. Be sure to save your game with your character away from Sky Haven Temple or the exterior to aviod save game corruption.\r\n 5. Remove all personal items from containers and chests before uninstalling or upgrading this mod. \r\n\r\nNO RESPONSIBILITY WILL BE TAKEN BY ME FOR CORRUPTED SAVE GAMES!!!\r\n\r\nThere is a known issue where large exterior objects are not guarenteed to appear. Some of you have noticed that the exterior is floating in midair. I am working on resolving this issue that the rocks, mountians, and boulders that I put there show up properly.\r\n\r\nLet me know if you notice any bugs or problems. I cant fix them if I dont know about them. You MUST take a screenshot and post it to show the bug if it is a visible issue. Otherwise I cant know where to look for it. Some things are vanilla issues. Some things are caused by me. I cant know the difference if you dont give me visual evidence of the problem.\r\n\r\n \r\nHistory\r\n =======\r\n1.1 3/9/2012\r\n Updates\r\n -Fixed LOD issues causing rocks, mountains, and boulders not appearing and thus giving the appearance that the Temple is hanging in midair.\r\n -Fixed LOD issues which caused some of the pagoda towers to randomly disappear at times.\r\n -Added weapon racks to the bedroom.\r\n -Added sword and shield racks to the bedroom.\r\n -Added more curtains to the bedroom.\r\n -Added chest at the foot of the bed with safe storage.\r\n -Added large fireplace in the grand hall in front of the Dragon Born Wall.\r\n -Fixed some interior lighting issues, added more brazers.\r\n -Added Door to the area left of the entrance where the weapon rack of katanas used to be. This will lead to a new chamber once completed.\r\n -Cleaned up more of the interior chamber, removed more clutter items that I had missed.\r\n -Added planters to every tree in the exterior courtyard. These have been given ledge seating so NPCs will use them to sit on later.\r\n -Laid the ground work for merchant stalls. There will be at least four-a blacksmith for weapons and armor, a mage on loan from the college for magical items and equipment, a Khajit trader for thieves and archer type characters which will also serve as a fence, and a general trader which will serve as a catchall for anything else.\r\n -Full crafting support added to the exterior cell. Most of it is located at the blacksmith\\'s stall but there is another set of alchemical and enchanting workbenches at the mage\\'s merchant stall. Will add cooking fire and spit the to general goods stall.\r\n -Removed most of the benches and lanterns. Will reincorporate them again later elsewhere.\r\n -Fixed some exterior seams but in the process created more. They are by far the hardest thing to nail down and remove. A simple snap to nearest piece option would save me so much headache.^^\r\n\r\n1.05 3/7/2012\r\nUpdates:\r\n-Improved the Bedroom. \r\n-Addition of interior lighting in that section. Improved existing lighting. \r\n-Addition of Mannequines(tested working).\r\n-Desk with bookcases and safe. Benches and chairs around the fire place with end tables and \r\ncoffee table.\r\n-Addition of dining table with plates and cuttlery.\r\n-Alchemical and Enchanting crafting tables.\r\n-Addition of rugs and curtains.\r\n-Display case with katanas.\r\n\r\n 1.0 3/6/2012 - Initial Release\r\n \r\n\r\nContact\r\n =======\r\n I can be found at the Nexus forums as Natterforme\r\n\r\nThis is a Skyrim Nexus Exclusive.\r\n\r\nLiscense/Legal\r\n =======\r\n \r\nYou MUST contact me before you do anything with this mod in any form for any reason. This includes language translations. I will NOT be providing Steam Workshop support at this time. I do not feel comfortable with their legal policies towards modding so I will not use it. I will not support or endorse its use at this time. If I want it to be on Steam, I will do so myself. If you see this on Steam, LET ME KNOW! I will not support any version of this mod found on Steam. I will not accept any childish excuse about \\\"sharing\\\" with the community. If you refuse to respect my wishes, I can not, in good faith, respect yours.\r\n \r\n ",
  "categoryId": "53",
  "version": "1.1",
  "author": "Natterforme",
  "createdUnix": "1331088038",
  "updatedUnix": "1331347216",
  "containsAdultContent": false,
  "uploadedBy": "Natterforme",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40919",
      "name": "Main File Beta version 1dot0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "86",
      "fileName": "Main File Beta version 1dot0-12320.zip",
      "uploadedUnix": "1331088524",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/47a27f35f8db30e0748bc6a66d115302a78bb7aa1075f7b3810188b830d5ea51/analysis/1406735472/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File%20Beta%20version%201dot0-12320.zip?fid=40919&ttl=1535774114&ri=8192&rs=8192&setec=6cdd74a83b2317094cad3aa8604bbf7c"
    },
    {
      "fileId": "41114",
      "name": "Main File version 1dot05",
      "version": "1.05",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "94",
      "fileName": "Main File version 1dot05-12320.zip",
      "uploadedUnix": "1331152244",
      "modVersion": "1.05",
      "virusScanUrl": "https://www.virustotal.com/file/1810a869786019b646ccd76169eb4f1d69d7176167e25982d95d58cccb526fe8/analysis/1406736524/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File%20version%201dot05-12320.zip?fid=41114&ttl=1535774115&ri=8192&rs=8192&setec=2d58e6c9f3740285d920164317511a10"
    },
    {
      "fileId": "41863",
      "name": "Main File version 1dot1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "98",
      "fileName": "Main File version 1dot1-12320-1-1.zip",
      "uploadedUnix": "1331347216",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/a6af06023991d7006409a27a77c0a85dbfe94eb13a9a8505618b675017e4dd08/analysis/1406741049/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File%20version%201dot1-12320-1-1.zip?fid=41863&ttl=1535774115&ri=8192&rs=8192&setec=ab093d7363119879641473e42597066e"
    }
  ]
}