{
  "modId": 12324.0,
  "modName": "Skyrim Survival Suite - Nourriture et sommeil - FR",
  "summary": "Gestion de la nourriture et du sommeil, simple d\\'utilisation et sans fioritures.",
  "descriptionHtml": "[center][IMG]http://img440.imageshack.us/img440/8349/sssheader.jpg[/IMG][/center]\r\n\r\nSkyrim Survival Suite est un projet visant à la création de nombreux plugins destinés à rendre Bordeciel plus immersif et plus réaliste. Chaque plugin aura pour but de gérer un aspect précis de gameplay, tout en étant bien entendu compatible avec tous les autres. Il n\\'est pas question à un seul moment de dénaturer le jeu d\\'origine ni même de vraiment ajouter du contenu, mais plutôt d\\'utiliser les éléments présents dans le jeu pour leur donner une nouvelle utilité.\r\n\r\nvoir aussi :\r\n[b][size=4][url=http://skyrim.nexusmods.com/downloads/file.php?id=16114]Skyrim Survival Suite - Armure[/url][/size][/b]\r\n[b][size=4][url=http://skyrim.nexusmods.com/downloads/file.php?id=16499]Skyrim Survival Suite - Survie[/url][/size][/b]\r\n\r\nMême si les deux plugins présentés ici peuvent être utilisés séparément, je vous recommande de les utiliser conjointement car c\\'est dans cette optique qu\\'ils ont été conçus.\r\n\r\n[B][size=6]S[/size][size=5]kyrim [/size][size=6]S[/size][size=5]urvival [/size][size=6]S[/size][size=5]uite - Sommeil[/B][/size]\r\n\r\n[size=3][B]Notes de mise à jour[/B][/size]\r\n[size=4][b]1.0.3 :[/b][/size] correction des messages intempestifs au réveil et ajout d\\'un message indiquant le nombre d\\'heures restant à dormir si on se réveille avant d\\'avoir dormi suffisamment. Quelques petites retouches sur les descriptions.\r\n[size=4][b]1.0.2 :[/b][/size] ajout des scripts qui avaient mystérieusement été \\\"oubliés\\\" ... (toutes mes excuses)\r\n[size=4][b]1.0.1 :[/b][/size] correction d\\'un bug qui faisait se cumuler les effets sur le taux de récupération de santé des différents types de sommeils quand le joueur dormait sans être fatigué, et d\\'erreurs dans la description de certains effets.[/hide]\r\n\r\nAvec ce plugin, le joueur doit se reposer régulièrement pour ne pas souffrir des effets de la fatigue. S\\'il ne dort pas au moins 6 heures pour chaque tranche de 24 heures, ses taux de récupération en santé, vigueur et magie sont réduits d\\'un tiers. Notez cependant que la valeur de récupération de santé du joueur est initialement réduite d\\'un tiers de sa valeur d\\'origine, et c\\'est cette nouvelle valeur qui est alors elle-même réduite d\\'un tiers.\r\nLes 3 types de sommeil d\\'origine sont conservés, mais leurs effets ont été ajustés : le sommeil \\\"normal\\\" ne fait que rétablir les valeurs de récupération habituelles du personnage. Le sommeil réparateur augmente encore la récupération de 5% pour la vigueur et la magie et augmente également la vitesse d\\'amélioration des compétences de 5% pendant 8h. Le sommeil conjugal double ces derniers bonus.\r\nUn message vous averti lorsque vous êtes fatigué, ce qui permet de ne pas avoir le nez collé à la fenètre des effets pour savoir ce qu\\'il en est. De plus, un personnage fatigué ne peut plus utiliser le voyage rapide !\r\n\r\n[I]J\\'utilise pour ma part le mod de Gerauld permettant de ramasser et de déposer les [url=http://skyrim.nexusmods.com/downloads/file.php?id=13614#content][b]sacs de couchage[/b][/url] qui correspond bien à la philosophie de mes propres mods. En attendant son éventuelle autorisation pour ajouter cette fonctionalité directement dans mon mod, je vous encourage à utiliser le sien :)[/i]\r\n\r\n[size=3][B]Installation :[/B][/size] placez le contenu de l\\'archive .Zip dans le dossier data puis activez le plugin de la façon habituelle (ou laissez le nexus mod manager faire son boulot). Une fois en jeu, l\\'activation ne sera vraiment complète qu\\'après avoir dormi une première fois.\r\n[size=3][B]Désinstallation :[/B][/size] voir plus bas.\r\n\r\n[B][size=6]S[/size][size=5]kyrim [/size][size=6]S[/size][size=5]urvival [/size][size=6]S[/size][size=5]uite - Nourriture[/B][/size]\r\n\r\n[size=3][B]Notes de mise à jour[/B][/size]\r\n[size=4][B]1.1.0 :[/b][/size] Ajout de recettes manquantes dans le jeu : miel, friandise au miel, pain**, tarte aux pommes**, soupe de palourdes*, pommes de terre au four, ragoût de chien*, soupe de gourde* et poisson carnassier grillé**\r\nAjout de la farine de blé (ingrédient alchimique avec les mêmes effets que le blé et utilisé dans certaines recettes) et de la chair de poisson carnassier (trouvée sur ... les poissons carnassiers !)\r\n[size=1]* nouvelle recette utilisant des ingrédients d\\'origine[/size]\r\n[size=1]** recette d\\'un plat d\\'origine utilisant de nouveaux ingrédients[/size]\r\nDésormais un personnage affamé ne peut plus ni utiliser le voyage rapide, ni attendre ni dormir !\r\nSuppression du script commun avec SSS - Sommeil (toujours utilisé par ce dernier)\r\nQuelques petites retouches sur les descriptions et modification de la fondue d\\'Elsweyr qui est désormais considérée comme de la nourriture excellente.\r\n[size=4][B]1.0.2 :[/b][/size] ajout des scripts qui avaient mystérieusement été \\\"oubliés\\\" ... (toutes mes excuses)\r\n[size=4][B]1.0.1 :[/b][/size] correction de petits bugs, et d\\'erreurs dans la description de certains effets.\r\n\r\nAvec ce plugin, le joueur doit manger régulièrement pour ne pas souffrir des effets de la faim. S\\'il ne mange pas, ses taux de récupération en santé, vigueur et magie sont réduits d\\'un tiers. Notez cependant que la valeur de récupération de santé du joueur est initialement réduite d\\'un tiers de sa valeur d\\'origine, et c\\'est cette nouvelle valeur qui est alors elle-même réduite d\\'un tiers.\r\nIl existe 3 types de nourriture : médiocre, normal et excellent. La nourriture normale permet de retrouver ses valeurs de récupération d\\'origine alors qu\\'avec la nourriture médiocre les récupérations de vigueur et de magie souffrent d\\'un malus de 10%. La nourriture excellente quand à elle octroit un bonus de 10%. La durée de ces effets dépend du poids de la nourriture consommée, variant par exemple de 2 heures pour une pomme à 24 heures pour un steak de mammouth (partons du principe que le personnage ne mange pas tout d\\'un coup ... ;-) ).\r\nUn message vous averti lorsque vous êtes affamé, ce qui permet de ne pas avoir le nez collé à la fenètre des effets pour savoir ce qu\\'il en est. De plus, un personnage affamé ne peut plus utiliser le voyage rapide !\r\nLe poids de la nourriture a été multiplié par 5, étant donné qu\\'elle a désormais une réelle importance dans le jeu. De même, le prix a été significativement augmenté, et ce en fonction du poids et de la qualité.\r\n\r\n[size=3][B]Installation :[/B][/size] placez le contenu de l\\'archive .Zip dans le dossier data puis activez le plugin de la façon habituelle (ou laissez le nexus mod manager faire son boulot). Une fois en jeu, l\\'activation ne sera vraiment complète qu\\'après avoir mangé une première fois.\r\n[size=3][B]Désinstallation :[/B][/size] voir plus bas.\r\n\r\n[size=5][B]Précisions[/B][/size]\r\nSi vous utilisez conjointement, comme conseillé, ces deux mods vous aurez les valeurs de régénération initiales suivantes : \r\n   [b]Santé[/b] : [b]33%[/b]\r\n   [b]Vigueur[/b] et [b]Magie[/b] : [b]100%[/b]\r\nSi vous ètes fatigué OU affamé :\r\n   [b]Santé[/b] : [b]23%[/b]\r\n   [b]Vigueur[/b] et [b]Magie[/b] : [b]67%[/b]\r\nEt enfin si vous êtes fatigué ET affamé :\r\n   [b]Santé[/b] : [b]12%[/b]\r\n   [b]Vigueur[/b] et [b]Magie[/b] : [b]34%[/b]\r\n\r\n[size=5][B]Désinstallation[/B][/size]\r\nSi vous n\\'avez aucun soucis particulier et souhaitez simplement désinstaller le plugin, il vous suffit de manger de la nourriture \\\"normale\\\" (ni médiocre ni excellente) et de dormir de façon à être affecté par l\\'effet \\\"repos\\\" (pas réparateur ni conjugal). Ensuite vous pouvez désactiver le plugin sans problème en le décochant dans la liste des plugins activés. Faites bien attention à ne pas être affecté par les effets contrindiqués quand vous désactivez le plugin car vous ne recupéreriez alors pas vos caractéristiques d\\'origine et il faudrait passer par la console pour les restaurer (voir ci dessous).\r\n\r\n[size=5][B]En cas de problème[/B][/size]\r\nSi vous rencontrez des problèmes avec un de ces deux mods, vous pouvez procéder comme expliqué ci-dessous pour annuler tous les effets :\r\n\r\n1) chargez votre partie, puis assurez vous que vous n\\'ètes pas sous l\\'effet \\\"repos réparateur\\\" ou \\\"repos conjugal\\\" (les autres effets ne posent pas de problème)\r\n2) sauvegardez la partie une première fois puis une seconde fois sous un autre nom, au cas où ; vous pouvez utiliser la commande suivante dans la console : savegame XXX (remplacez XXX par le nom que vous voulez lui donner).\r\n3) quittez le jeu et désactivez le plugin puis relancez le jeu et chargez votre sauvegarde courante\r\n4) assurez vous que vous ne subissez aucun autre effet qui puisse modifier vos valeurs de récupération en santé, vigueur et/ou magie (que ce soit une bénédiction, un objet, une maladie, etc .).\r\n4) utilisez la console (touche ² par défaut) puis tapez les lignes suivantes :\r\n\r\n\t[B]player.forceAV healratemult 100[/B]\r\n\t[B]player.forceAV staminaratemult 100[/B]\r\n\t[B]player.forceAV magickaratemult 100[/B]\r\n\r\n5) et voilà ! vos valeurs de récupération sont remises à 0 de cette façon et tous les effets du plugin sont supprimés.\r\n\r\n[B]Note :[/B] Si d\\'aventure vous aviez un doute quand à l\\'état de vos valeurs de récupération, les commandes de console suivantes pourraient vous aider :\r\n\r\n\t[B]player.getAV healratemult[/B] pour le taux de récupération de santé\r\n\t[B]player.getAV staminaratemult[/B] pour celui de vigueur\r\n\t[B]player.getAV magickaratemult[/B] pour celui de magie",
  "categoryId": "78",
  "version": "1.1.0",
  "author": "Helghast",
  "createdUnix": "1331090826",
  "updatedUnix": "1336080239",
  "containsAdultContent": false,
  "uploadedBy": "Helghast",
  "primaryFile": null,
  "files": [
    {
      "fileId": "58423",
      "name": "SSS - Sommeil",
      "version": "1.0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "SSS - Sommeil-12324.zip",
      "uploadedUnix": "1336080190",
      "modVersion": "1.0.3",
      "virusScanUrl": "https://www.virustotal.com/file/d12c3d4010a9876ba2d49e947e5c73e72242fbef3424f832259f0551f5181626/analysis/1406863981/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSS%20-%20Sommeil-12324.zip?fid=58423&ttl=1535774126&ri=8192&rs=8192&setec=49b2f3e72670c450548d3ea7e7d881aa"
    },
    {
      "fileId": "58424",
      "name": "SSS - Nourriture",
      "version": "1.1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "SSS - Nourriture-12324-1-1-0.zip",
      "uploadedUnix": "1336080239",
      "modVersion": "1.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e068e976b509444fd05b73eaba984920cbc3503ee5aaaa242ff47048b5d5435a/analysis/1406863982/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSS%20-%20Nourriture-12324-1-1-0.zip?fid=58424&ttl=1535774126&ri=8192&rs=8192&setec=b5fbdba62827c77c8490c5888313b56c"
    }
  ]
}