{
  "modId": 12344.0,
  "modName": "DovahKeep Player Home and Village",
  "summary": "Whiterun\\'s Dragonsreach turned into a player home with a small village to accompany it. Has great scenery on a lake near Half-Moon Mill.",
  "descriptionHtml": "This is a player house based on the concept that in Skryim you eventually become incredibly rich and powerful. Compared to the average citizen walking down the street you\\'re a god. In a similar time period in the real would you\\'d easily be a king. You\\'d be so rich you\\'d be a walking economy, and an entourage of merchants and servants would flock to you just for a chance that your wealth would trickle down. However, I\\'m not interested in creating an entourage that would follow you around, dealing with the AI involved wouldn\\'t be fun for anyone.\r\n\r\nInstead the idea is that you build yourself a grand keep to live in. Many modern cities were established from workers and merchants that migrated to an industry, and in the world of Skryim, building a large keep would require a small army of workers, and surely some merchants would show up to profit from both the workers and your wealth. And of course it makes sense that after your keep was built, that some of the folks would stick around.\r\n\r\nUnfortunately I don\\'t have the time or patience to build a whole city with a lot of people, and even in Skyrim\\'s largest cities you don\\'t get that hustle and bustle sort of feeling. It always feels a little empty, so my intention wasn\\'t to attempt that. Instead I built a small somewhat sustainable village(more of a hamlet really) built near your keep.\r\n\r\n=============================================================================\r\n\r\nHere\\'s what I\\'ve put together:\r\n\r\n- A large keep that is essentially Dragonsreach Castle pulled out of Whiterun. Out of it\\'s context its quite nice looking(the inside is essentially unchanged). I\\'ve placed it on the lake near Half-Moon Mill. I even managed to integrate Dragonsreach\\'s Great Porch that goes out just a little into the lake to give you an incredible scene. During the day you can see the Throat of the World, and some animals near the lake. At night with a clear sky you can see the Aurora.\r\n\r\n- Next to the throne inside is a player chest for general use. It keeps you from having to load another room to get to the bedroom for a chest.\r\n\r\n- There are 6 Mannequins in the main hall for you to display your armor.\r\n\r\n- There are 8 Shield and weapon plaques for display in the main hall.(I miscounted the first time.)\r\n\r\n- There 5 weapon display cases in the main hall.\r\n\r\n- A complete blacksmith area outside of the keep with an Orcish Blacksmith name Ushag. She has a modified version of the Warmaiden\\'s vender package. This means more minerals, leather, and ore. She toils around outside for 12 hours a day. There\\'s a player chest right in the middle of the blacksmith area for convenience.\r\n\r\n- 12 Large Orc guards. Six of them patrol outside and six inside, 3 at a time. They\\'re pretty high level so if a dragon shows up they can take care of it pretty easily. They all look the same, but I gave them each unique names.\r\n\r\n- A courtmage named Raksada, much like Farengar in Whiterun. He has a similar vendor package to Farengar, but I added more alchemy ingredients for those who like alchemy. I don\\'t use alchemy, so hopefully its enough to make him useful.I added two chests in the room next to his lab for your personal use. They\\'re right next to the enchantment and alechemy tables for convenience. \r\n\r\n- A maid that sweeps up around the front door named Chiran.\r\n\r\n- A bard named Eiruki, using the same model as Hroki because she\\'s one of the prettier NPCs in Skryim. She mostly just sits in the main room of the keep, and I think she occasionally sings, but I haven\\'t seen her do it. If you talk to her, you can make a request however and she\\'ll sing for you.\r\n\r\n- There is a farmer named Frande who tends to his crops all day.He\\'s for immersion.\r\n\r\n- There\\'s a grumpy old man named Valund that sits on a bench, chops wood, and feeds his chickens. He\\'s also for immersion.\r\n\r\n- There are two hunters that live in one of the farmhouses. They\\'re just random Hunters and it may be possible to buy furs off them, but I don\\'t know. You might see one of them out hunting.\r\n\r\n-One thing I did not want to add in was stacks of ingredients and ingots like lots of people do for custom houses. I feel like those things are easy to find in the game without just handing them to you in a big pile.\r\n\r\n===================Possible bugs.===============================\r\n[b]Some people have been experiencing crashes to desktop and other problems when walking around the property. While making this mod I loaded it up with different saves and characters more than 30 times to test different features. My computer is 5 years old and runs everything fine with no problems. The only way I could imagine any conflicts is if somehow someone changed the terrain or other parts of the world the mod exists in. If you find a mod that you can verify conflicts with mine please let me know so I can get the word out.[/b]\r\n\r\nThere are some possible bugs I\\'m not aware of, but expect to occasionally see someone walking somewhere they probably shouldn\\'t. \r\n\r\nExpect some possible encounters near the keep(not really a bug).\r\n\r\nThere are some weird quirks with the mannequins. Sometimes they might move or take funny poses. Usually reloading the area helps.\r\n\r\nThere some leaks on the outside of the house, but you shouldn\\'t notice them unless you\\'re really looking at it with a magnifying glass. \r\n\r\nThe Creation Kit isn\\'t perfect, so some things might be out of my control.\r\n\r\nI don\\'t know the effect of having items in the chests and then updating this mod, but I\\'ve seen a lot of modders warn that you should take items out of the chests before changing versions of any mod. However, I\\'m pretty satisfied with the way this mod is right now, so I might not update it unless there\\'s a serious problem.",
  "categoryId": "67",
  "version": "1.0",
  "author": "AceUnKnown",
  "createdUnix": "1331127109",
  "updatedUnix": "1331127358",
  "containsAdultContent": false,
  "uploadedBy": "aceunknown",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41010",
      "name": "DovahKeep",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "433",
      "fileName": "DovahKeep-12344-1-0.zip",
      "uploadedUnix": "1331127358",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b5751c1e3fe2b139ff8d86d645c63bb00242de0d465e84c25389cd43a776137d/analysis/1406736123/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DovahKeep-12344-1-0.zip?fid=41010&ttl=1535774159&ri=8192&rs=8192&setec=b25462a6cb9569db3682c35ad535519e"
    }
  ]
}