{
  "modId": 12340.0,
  "modName": "Voice Master House - Player home",
  "summary": "Adds a player home with a small dungeon, weapon with custom texture and two unique sets near High Hrothgar.",
  "descriptionHtml": "[b]About the mod:[/b]\r\nThis mod adds a player-owned house, the \\\"Voice Master House\\\", near High Hrothgar.\r\nTo get the key to the house, you must brave a small dungeon with a scaled encounter.\r\n\r\nThe house includes multiple secrets - or small \\\"easter eggs\\\" if you want - that you can find. (Hint: Find the to-do list!) Can you find out what happened to the person who lived here before?\r\n\r\nThese secrets include two custom three part gear sets, a custom texture dagger and multiple miscellaneous things scattered around the house and in the dungeon.\r\n\r\nThe house has everything your Voice Master needs for blacksmithing, alchemy and enchanting!\r\n\r\n\r\nAuthor note:\r\nWhew! It\\'s taken many hours and nights of sitting in front of my PC, but I finally got to a point that I can release the mod for public testing.\r\n\r\nThis has been an interesting learning process, and I personally am quite happy how it turned out, since this is my first \\\"full\\\" mod.\r\n\r\nThe house was at first supposed to be just a small house mod, but as I went on I wanted to add a dungeon, new gear and a small story to go with it.\r\n\r\nThank you for downloading, hope you enjoy!\r\nRemember to endorse if you liked the mod!\r\n\r\nBugs and fixes:\r\nFind anything? Report it in the comments section or through a PM!\r\n\r\nTo be fixed:\r\n- Found a few small ugly places where the stones clip through the floor, but these are very minor. Shouldn\\'t be too easy to spot.\r\n- The weapon plaguette over the alchemy table and near the downstairs door sometimes won\\'t work.\r\n",
  "categoryId": "67",
  "version": "1.1",
  "author": "MrRightclick",
  "createdUnix": "1331121721",
  "updatedUnix": "1331155211",
  "containsAdultContent": false,
  "uploadedBy": "MrRightclick",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41127",
      "name": "Voice Master House v1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "569",
      "fileName": "Voice Master House v1-1-12340-1-1.rar",
      "uploadedUnix": "1331155211",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/8ab8d6db19e67c047d9e2bea1a2196aa4d0d5c4aca4623abc18a466eb3e3a88e/analysis/1406736677/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Voice%20Master%20House%20v1-1-12340-1-1.rar?fid=41127&ttl=1535774153&ri=8192&rs=8192&setec=8d437fd4889050a082e6253290ee094e"
    }
  ]
}