{
  "modId": 12351.0,
  "modName": "Waterfall Tower",
  "summary": "My home on a cliff side and next to a waterfall. Located between Darkwater Pass and Lost Knife Hideout. Console command to try it out: coc waterfallhome",
  "descriptionHtml": "[center][b][u]=Short Description=[/u][/b][/center]\r\n[center]My home on a cliff side and next to a waterfall. Located between Darkwater Pass and Lost Knife Hideout. Nothing super special... just a well furnished Nordic ruin really. I just wanted a nice place to store all my stuff and do all my crafting without traveling all over town. Console command to try it out: coc waterfallhome[/center]\r\n\r\n[center][b][u]=Quick Run Through Vid=[/u][/b]\r\n[youtube]tFdRc1fo5DA[/youtube][/center]\r\n\r\n[center][b][u]=Install=[/u][/b]\r\nJust place esp in data folder. All content within game so there should be no conflicts.\r\n\r\nCan also find it at Steam\\'s workshop and let it install n update it for you:\r\n[url=http://steamcommunity.com/sharedfiles/filedetails/?id=15173]Steam Workshop Link[/url]\r\n[/center]\r\n\r\n[center][b][u]=Long Description=[/u][/b][/center]\r\nI made this mod for when I get back to playing Skyrim. I spent a lot of time working on it in my off time and I rather like it soooo... made it public for you in case you need a \\\"one stop shop\\\" for all your household needs including smithing, alchemy, enchantments, displays, plenty of storage, etc.\r\n\r\nHouse is located deep underground and accessed through a tower right next to a waterfall. On the tower there will be smithing/crafting equipment on the roof has well has a great view. The trap door will lead you to the underground nordic ruin converted into a great living space suited to a dragon born traveler that has walked all of Skyrim.\r\n\r\nI don\\'t normally make my houses this big but due to limitations of the building kit I used it got a bit bigger then I expected... has well has all the extra spacing out I had to do due to lighting issues with the game. But I really like the Nordic ruins and made the best living space I could out of what was available in game. I could do more crazy stuff but kinda ran out of room... I don\\'t want it TOO big.\r\n\r\nThere shouldn\\'t be any problems with it beyond some of the mannequins not always being in the correct pose (game bug) or perhaps navmesh issues (also a game bug). I have not gotten back to playing in Skyrim yet so I have not throughly tested my home. I expect to update and/or fix any issues it may have in ze future... but for now... hope ya like it and enjoy.",
  "categoryId": "67",
  "version": "1",
  "author": "SkyDragon",
  "createdUnix": "1331138080",
  "updatedUnix": "1331138232",
  "containsAdultContent": false,
  "uploadedBy": "SkyDragonV1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41053",
      "name": "Waterfall Tower",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "130",
      "fileName": "Waterfall Tower-12351-1.zip",
      "uploadedUnix": "1331138232",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/ad747c482316d76fed0a25b598dca888fb66abca56ab29201b5e15c5e6d332ac/analysis/1406736306/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Waterfall%20Tower-12351-1.zip?fid=41053&ttl=1535774166&ri=8192&rs=8192&setec=fb26cbecd97fa614c3449485b06bae13"
    }
  ]
}