{
  "modId": 12366.0,
  "modName": "Elven Blade Sword",
  "summary": "A fast, short sword crafted by the dark elfs themselves. Very light weight but extremely sharp.\r\n\r\n\r\n\r\n",
  "descriptionHtml": "I was tinkering with Maya 2012 the other day and I came up with this model. I was fairly happy with the results so I decided to share with you guys. The model and textures are all made from scratch. I got the idea after watching Hellboy 2 the other day. One of the characters was using a similar sword to this one. Anyways, you can find the sword in Markarth inside the shrine of Talos. It’s sitting on top of the shrine. \r\n\r\nThe specs are similar to the elven sword except is a lot lighter and faster too. The sword can be upgraded as well. \r\nIf you guys like it I’ll take some requests on a weapon or shield you’ll like to see in game. \r\nEndorse if you like it!\r\n\r\nInstallation:  Easy, just drop the esp under the data folder inside Skyrim.  then drop the meshes and texture files also inside the data folder...Contact me if you have any questions.\r\n\r\nGuys, if anyone wants to use this model and textures on their own mods thats cool.  However, I only ask you give me credit for my work and before using please verify with me first.  this model and textures are all made from scratch and is original work I have created...thanks.",
  "categoryId": "55",
  "version": "1.0",
  "author": "Josielism",
  "createdUnix": "1331148318",
  "updatedUnix": "1331149128",
  "containsAdultContent": false,
  "uploadedBy": "josielism",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41095",
      "name": "Elven Blade Sword",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3106",
      "fileName": "Elven Blade Sword-12366-1-0.rar",
      "uploadedUnix": "1331149128",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e381ed829e221bde4fd0578ab32bdee3e8cfffb76b3b5274efbc71a1c4ec3f39/analysis/1406736496/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elven%20Blade%20Sword-12366-1-0.rar?fid=41095&ttl=1535774191&ri=8192&rs=8192&setec=c2262b0a5ad3d486d4e23b84485a74a9"
    }
  ]
}