{
  "modId": 12386.0,
  "modName": "The Cauldron of Peryite Standalone",
  "summary": "Adds a unique item to give you easier access to your poisons and potions. The item can be found at the Shrine of Peryite.",
  "descriptionHtml": "Readme - Cauldron of Peryite Standalone\r\n\r\nThis is a standalone version of an item I\\'m adding to my other mod - Tactless Toxins\r\n\r\nThis is a simple mod adding a very simple item to the game. When this item\r\nis in your inventory you gain a spell (used with the shout button)that opens\r\nan inventory where you can place poisons and potions and from that inventory\r\nyou can shiftclick the poisons or potions and use them from there. The container\r\ncan only hold 3 units of weight, so if your poisons are standard weight it will\r\nhold around 6 of them. The cauldron itself weighs .5 a unit and anything placed\r\ninside won\\'t weigh you down any.\r\n\r\nThe whole point of this is to make it easier to access your poisons and potions\r\nand eventually I want to add another item that utilizes the inventory of this\r\none to make access even easier, but I don\\'t know how to go about this at the\r\nmoment.\r\n\r\nTechnically this can hold any item that is under 3 units of weight, but I \r\nsuggest only using poisons and potions.\r\n\r\nLocation:\r\n\r\nThe cauldron is found at the Shrine of Peryite in the reach, it isn\\'t hard to\r\nfind so you should see it easily.\r\n\r\nInstallation:\r\n\r\nunzip the files into your data directory, and make sure you get the meshes and\r\ntextures into the right place or the cauldron will look all weird. My recommendation\r\nis to just click the nice green button for the download manager.\r\n\r\nConflicts:\r\n\r\nThere should be no conflicts, but if you have a potion reweight mod you will\r\nbe able to hold more items in your cauldron.",
  "categoryId": "27",
  "version": "v1",
  "author": "Magicfork",
  "createdUnix": "1331161454",
  "updatedUnix": "1331161550",
  "containsAdultContent": false,
  "uploadedBy": "MagicFork",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41167",
      "name": "The Cauldron of Peryite v1",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "202",
      "fileName": "The Cauldron of Peryite v1-12386-v1.zip",
      "uploadedUnix": "1331161550",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/cb4f157a0e1c9f5445614b36e54776cee72ecb4e3e56de2def3667a909171dd3/analysis/1406736958/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Cauldron%20of%20Peryite%20v1-12386-v1.zip?fid=41167&ttl=1535774228&ri=8192&rs=8192&setec=e36e3407db4a5bdbff1674b9de9b31ae"
    }
  ]
}