{
  "modId": 12382.0,
  "modName": "DNTH - The Magician Scroll",
  "summary": "Dovakhiin is a Ninja Treasure Hunter. Quest for the Magician.",
  "descriptionHtml": "In a Nutshell:\r\n\r\nBasically the idea of this little series is to make the game a little more puzzling and fun. DNTH is a plot to turn the everyday Dragonborn into a master treasure hunter.\r\n\r\nGomplex puzzles, Great heights, Great danger, Great puzzles. Just think, \\\"what would a ninja be doing?\\\" YOU can be a Ninja Treasure Hunter too1\r\n\r\nUse the clues to figure out where exactly the prizes may be. It will ALWAYS be in the place you never really bother to look. The clue location will corrospond with the prize. think about it.\r\n\r\nPrize:\r\nThe prize of this hunt is an otherworldly being. A magician not from this world. \r\n\r\nIt will allow you to summon the magician for 7 days. After that time it will instantly dissapear. The magician is essential, so no need to worry about losing it before your time. After it dissapears, another scroll will be added to the same location for your retrieval.\r\n\r\nStory:\r\nYou have gathered information about rumors of an other worldy being. A particular scroll that will summon the most potent magician in the universe. With great hast you set out to find this magical, extraterestrial being and claim it as your own. Clues have been set out, break the conspirecy behind the great leaders of Skyrim. And unfold the true nature of their currupt greed. You are Dragonborn, and you are the savior of Skyrim. Now go Dragonborn, claim the rightful treasures left by your ancestors and become one that will not fall. one that will not be defeated.\r\n\r\n\r\n\r\nKnown Bugs:\r\n-some unmoved pieces of structure move once the game is loaded. (nothing serious or dextremental. merely some coordinates erroe. does not affect the game spaces in any important way.)\r\n\r\n\r\nLog:\r\nv1 - fixed most of the bugs and added an extra little goodie to the prize box\r\n\r\nEditor Note:\r\nThis is my first attempt of my first installment of my soon to be \\\"Dovakhiin Is A Ninja Trasure Hunter\\\" quest line.\r\nplease give as much feedback as possible.\r\nI grew tired of run/fail/run/fail/run/fail on certain things so there might be some bugs and stuff.\r\n\r\nsuggested:\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7649]Ninja Outfit[/url]\r\n\r\nNote:\r\nI am not the original creater of the characters armor, i simply added it. the original creater is unknown (to me) cause i saw it on youtube and it was in another language..",
  "categoryId": "35",
  "version": "1",
  "author": "Survival Strategy",
  "createdUnix": "1331159578",
  "updatedUnix": "1331468893",
  "containsAdultContent": false,
  "uploadedBy": "oncloudtwenty",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41160",
      "name": "MagicianScrollv_05",
      "version": ".05",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3431",
      "fileName": "MagicianScrollv_05-12382.zip",
      "uploadedUnix": "1331159846",
      "modVersion": ".05",
      "virusScanUrl": "https://www.virustotal.com/file/35a0852a5519df598847e2f0c1da3f59bb114ac1d790804a447f10ff55a576c9/analysis/1406736938/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MagicianScrollv_05-12382.zip?fid=41160&ttl=1535774212&ri=8192&rs=8192&setec=d03e2314e5d8123cd9ab89023b99ea55"
    },
    {
      "fileId": "42288",
      "name": "MagicianScrollv_1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4395",
      "fileName": "MagicianScrollv_1-12382-1-0.zip",
      "uploadedUnix": "1331468893",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6caf5b7eeebb8c9c1ee0e654a239c030a429e7cf405a8d926c16369570ded054/analysis/1406743150/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MagicianScrollv_1-12382-1-0.zip?fid=42288&ttl=1535774212&ri=8192&rs=8192&setec=6a7c5dcec7df395d7839ddc3e892217f"
    }
  ]
}