{
  "modId": 12387.0,
  "modName": "Sevar Castle home WIP",
  "summary": "Adds a Castle home (riften style) with everything ah dragon born could need.\r\nFeatures:\r\n- Sort options for Smiting, Alchemy, Potions and Arrows\r\n- Display options for Potions (Potion rack), Ingots, Leather, dragon stuff, Arrows and some more\r\n",
  "descriptionHtml": "Sevar Castle home by JJ\r\n\r\nThis is a work in progress it should be playable but it is likely that there are bugs and other things that could go wrong.  You have been warned!\r\n\r\nIf the file does not work please let me know it is a bit messy in my skyrim folder and it is easy to miss stuff\r\n\r\nUpdate: \r\n\r\nCtd problem seems to be fixed at least i didn\\'t had any in 2 hours testing. Mesh still not working right but better that than ctd. \r\n\r\nYour items are save this time but if you take the same save some changes won\\'t take effect. \r\n(There you need Retrieve your stuff deinstall load the game save than install the new one and load that save game if you later load an older one the changed scripts will not work right )\r\n\r\nspecial thanks to Hurricane06 for feedback and creative input. \r\n\r\nV0.95\r\n-                 Added 4 settings to the treasury 30,60,80 and 100k (is a script change)\r\n-                 Added the option to chose diffrent thron\\'s talk to jeff\r\n-                 Added option to hire a smith she is a merchant\r\n-                 Added dialoge and a quest to mira\r\n-                 Added a quest to Bernd \r\n-                 the froge should now count as a skyforge \r\n-                 minor things like always  \r\n\r\nproblems:  Text is to fast(i know only one sulution and i dont had the nerve to make x silent voice files) \r\nThe quests a not polished there are some problems with them like the enemies don\\'t attack first. \r\n\r\nV0.9\r\n-\tAdded a wishing well to the basement does some stuff \r\n-\tFinished the barracks \r\n-\tFinished the warehouse\r\n-\tFixed the arrow display you can now take the arrows in the middle like the other ones \r\n-\tChanged the gate!\r\n-\tHave changed stuff in the yard but most won\\'t be noticeable\r\n-\tAdded 3 custom banners nothing fancy but adds a bit to the atmosphere (I put them          under optional files, chose only one)\r\n-\tChanged the lighting (get rid of the fog)  \r\n\r\nPlans: I think I make perhaps one last update before the mod  is not pre beta anymore and make a non wip release  but not sure about that(interest is not high anyway). If nothings comes up or I have an idea what else to add I will focus mainly on the npc\\'s the next days. \r\n\r\n\r\n\r\nV0.8\r\n-Added a option to hire personal for the castle talk to Jeff (the lizard who wanders around main  hall study, \tthere is no option to dismiss them I will add that later)\r\n-You can hire: Cook(same as before)\r\n-\t     Bard(same as before)\r\n-\t      Maidservant(she has a kid cleans the castle and can teach you in alchemy)\r\n-\t      Weapon master(can teach you in 2h)\r\n-\t      Castle guards(a pack of 6 guards who don\\'t do anything but looking mean and tough \r\n-\t      Merchant(you can buy sell stuff he will open shop in the warehouse, not finished with him yet but the scripts I tried don\\'t work right now)\r\n(if you want to see what they say you need to activate subtitles)\r\n\r\n-\tAdded speech trainer to Jeff \r\n\r\n-\tAdded custom ai pack\\'s for most of the npc\\'s a bit rough but they should do some different stuff now(works as long as the mesh)\r\n\r\n-\tFinished the companion quarters (haven\\'t changed much rather liked the original move some stuff added the navmesh placed lights)\r\n\r\n-\tRewrote and readded the ingot display script works better now and generates less lag but it adds 200+ items if that is too much don\\'t use the stock option(it takes 2-3 sec to stock sry about that should go better but I just have no motivation to optimize it) \r\n\r\n-\tGet rid of redundant textures better for file size and now if you have texture packs they affect my things again \r\n\r\n-\tFixed some minor things can\\'t remember which though\r\n\r\nPlans: I am a bit unhappy with the feedback or the lack there of but suppose I can\\'t complain. Don\\'t give feedback either. Thanks to the people who have endorsed makes me happier than I thought it would go figure. \r\n\r\nThe gate is still ugly and I know I should write some dialogues but...\r\nHave written a script for a wishing well that does random stuff when you throw money at it \r\nPerhaps I do that don\\'t know right now there is still much stuff to do want a custom banner finish the merchant script write a new bard script add a dungeon &#12539;.\r\nAnd I think I take the idea from \\\"CyrusAmell\\\" and add a marriageable lady to the castle no quest I think because I don\\'t fell up to writing something good.    \r\n\r\nv0.7\r\n- Buildings should no longer be invisible quit so often (sometimes they still are though)\r\n\r\n- Some cosmetic changes (moved stuff around pluck some holes changed the yard texture)\r\n\r\n- Followers follow you in the building and around in the yard but if you zone out the mesh will    likely not load at all so your follower will vanish they reappear after you walk some distance or    simple fast travel to another location. \r\n\r\nPlans: If the mesh doesn\\'t work I can\\'t really do any fun things will finish the 3 reaming rooms even if they have little use now. \r\n-Perhaps make some scripts for useless things (will look at the ingot display again have an idea which    might work if there is still too much lag I will move it to the warehouse).\r\n- I am unhappy with the gate but can\\'t seem to find a descent solution yet.\r\n\r\n\r\nSevar Castle home by JJ\r\n\r\n\r\n\r\nThis is a work in progress it should be playable but it is likely that there are bugs and other things that could go wrong.  You have been warned!\r\n\r\n\r\nAdds a Castle home (riften style) with everything ah dragon born could need.\r\n\r\nFeatures:\r\n- Sort options for Smiting, Alchemy, Potions and Arrows\r\n- Display options for Potions (Potion rack), Ingots, Leather, dragon stuff, Arrows and some more\r\n\r\n- Book Cases\r\n- Weapon Plaques\r\n- Weapon Racks\r\n- Mannequins\r\n- Dagger display case normal Display case \r\n- Bard  \r\n- Mapmaker\r\n- Alchemy, Enchanting Smiting tables benches...\r\n.... Perhaps more I have forgotten read the room description bellow for more info\r\n\r\nInstall:\r\nCopy the files in your Skyrim data folder or use nexusmodmanger I don\\'t made any fomod stuff but should work anyway\r\nDeinstall:\r\nDelete all files can be annoying with the script files.\r\nConflicts: Don\\'t know of any I tried to not use any vanilla stuff directly but it can happen\r\nAnd every mode who alter the place the castle is build \r\n\r\nReason for the early release: I simply need someone who is willing to test stuff. And I hope for feedback, pointers and constructive critic. \r\n\r\n-----------------------------------------------------------------------------------\r\nRooms\r\n Main Hall: That is the place where you lord over your subordinates\r\nnothing much to do here you can listen to Lilika the bard(semi working) or you can order ah meal    for you and your men from Lydia the cook (will be displayed at the great table warning  if you clear the table the items will be deleted you can eat the stuff it is not for hording)\r\n\r\n Kitchen: Tanya and her help work her... that all\r\n From the foodstorage area you can get to the basement via ah secret path\r\n\r\n Working room and master bedroom: here you plan your adventures and the future of your little     holding (in fact nothing of that right know but you know... immersion) \r\n In the bedroom is a secret door to a small private armory were you can store you favorite equip\r\n\r\n Armory: Standard some mannequins Racks Plaques and Cases. The button on the end let you sort arrows and stock them (note: only arrows which are in the chest are stocked doesn&#31258; take them from your inventory) It is semi working have a problem with the arrows in the center weird collusion.\r\n \r\n Treasury: Place to display the stuff you have found in your adventures. The second half off the   room displays one  of six settings based on the gold you carry or have stored in one of the   safe(at least I think it does can\\'t  remember if I add the safe)\r\n \r\nBasement: Alchemy and Mage Room The book on the desk let you sort and stock potions the display is   in the backroom can stock ca. 220 potions it seems to work fine but needs testing. \r\n \r\n Companion quarters: Just the quarters for some of your personal you should not have much reason to go there at this moment.\r\n\t \r\n Castle ext: Stables, Barracks, Warehouse Smiting take ah look around (it is not finished and the     navmesh is not  working right).\r\n Ah trigger in front of the gate should open it if the player goes near or close it depends\r\n  \r\nKnown issues: Stuff falling that is the most annoying thing most times it doesn\\'t matter but I work with disable enable and there it is quit fatal tell me if it happens and were.\r\n\r\nNavmesh outside is not working right known bug it crashes after you zone 1-2 times\r\n(Only way to fix it atm is new start)\r\nNpc inside the castle are sometimes not there I think it is when the mesh is not loaded properly they get placed in weird places. \r\n(Only way to fix it atm is new start)\r\n\r\n \r\nBuildings disappear don\\'t know what to do about that simply save load will fix it.\r\n\r\nFollowers follow you in the building and around in the yard but if you zone out the mesh will    likely not load at all so your follower will vanish they reappear after you walk some distance or    simple fast travel to another location. \r\n\r\nSort scripts does sometimes some strange stuff mostly multiply the sorted stuff it should not do that I get that only if I coc directly from the title screen if you see that otherwise you know tell me.\r\n\r\n\r\nFuture Plans: Fix bugs, Setup the Navmesh outside.\r\n\r\n Credits: I used 2 textures from: Texture Resource by Mr. Dave    http://skyrim.nexusmods.com/downloads/file.php?id=2324\r\n The Picture Frames you are seeing are from: Grimoas Picture Frame - A Resource for Interior  Decorators by Grimoa  (there are new ones I take a look sometime)\r\n http://skyrim.nexusmods.com/downloads/file.php?id=10963\r\n Note: the pictures are placeholder imo just some free pics I could find with Google you can use    your own pictures but I am too lazy to explain \r\n Bethesda for creating Skyrim, and skyrimnexus for creating a Skyrim modding Forum.\r\n",
  "categoryId": "67",
  "version": "0.95",
  "author": "JJ",
  "createdUnix": "1331163143",
  "updatedUnix": "1333124826",
  "containsAdultContent": false,
  "uploadedBy": "janicke80",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42694",
      "name": "Sevarv08",
      "version": "0.80",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4903",
      "fileName": "Sevarv08-12387.7z",
      "uploadedUnix": "1331574625",
      "modVersion": "0.80",
      "virusScanUrl": "https://www.virustotal.com/file/6d4f4f51718950e1a889a13a7bf6fa629756e5c547a76b171a4a7315a5ea47f6/analysis/1406745525/",
      "changelogHtml": " Added a option to hire personal for the castle talk to Jeff <br/> \n Added speech trainer to Jeff <br/> \n Added custom ai pack\\'s for most of the npc\\'s  <br/> \n rewrote and readded the ingot display script  <br/> \n Get rid of redundant textures  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sevarv08-12387.7z?fid=42694&ttl=1535774229&ri=8192&rs=8192&setec=4526ff4c1b3484813247ec34aa046826"
    },
    {
      "fileId": "43980",
      "name": "Sevarbannerblack",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "119",
      "fileName": "Sevarbannerblack-12387-1-0.7z",
      "uploadedUnix": "1331949536",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0fc48d02410ca2ac44286a9d4c937d8de12b1548294e9b79e125a9ce800f5687/analysis/1406752328/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sevarbannerblack-12387-1-0.7z?fid=43980&ttl=1535774230&ri=8192&rs=8192&setec=c2f84539a39b6120b2bb832cb24e500c"
    },
    {
      "fileId": "43981",
      "name": "Sevarbannerred",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "55",
      "fileName": "Sevarbannerred-12387-1-0.7z",
      "uploadedUnix": "1331949582",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7dc557f7d744d4624c61603ec21fa0b056b800ac8eac09f9aa8aaffb0b3b3563/analysis/1406752329/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sevarbannerred-12387-1-0.7z?fid=43981&ttl=1535774230&ri=8192&rs=8192&setec=3beb1dd81f5c1848fb0d8b592a040d68"
    },
    {
      "fileId": "43982",
      "name": "Sevarbannerblue",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "11",
      "fileName": "Sevarbannerblue-12387-1-0.7z",
      "uploadedUnix": "1331949626",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ae8d7d49fecae6ffaeb65e3974f52b3b338313cc6bfbd49e0674082ad6de47e2/analysis/1406752330/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sevarbannerblue-12387-1-0.7z?fid=43982&ttl=1535774231&ri=8192&rs=8192&setec=b4df2b3bea4586fba0a0218f845bbec4"
    },
    {
      "fileId": "44306",
      "name": "Sevar09",
      "version": "0.90",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5296",
      "fileName": "Sevar09-12387.7z",
      "uploadedUnix": "1332040077",
      "modVersion": "0.90",
      "virusScanUrl": "https://www.virustotal.com/file/edbbd0c0ebcbe30b1e8095d1885b27ee0ce51f2de6c9fb9b4db3b16f8496fd8d/analysis/1406765170/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sevar09-12387.7z?fid=44306&ttl=1535774231&ri=8192&rs=8192&setec=6de7d4058b3525a3cf9af41a4dedb50d"
    },
    {
      "fileId": "48227",
      "name": "Sevar095",
      "version": "0.95",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5321",
      "fileName": "Sevar095-12387-0-95.7z",
      "uploadedUnix": "1333124826",
      "modVersion": "0.95",
      "virusScanUrl": "https://www.virustotal.com/file/fed10a47c11ab94d84ea6119de9dcfb1212fe8ef37f806e1670e6e8e307d4a50/analysis/1406787731/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sevar095-12387-0-95.7z?fid=48227&ttl=1535774232&ri=8192&rs=8192&setec=c4c438a1a0379e39e8409a181bc89f13"
    }
  ]
}