{
  "modId": 12399.0,
  "modName": "Gardens Of Whiterun Insomnium",
  "summary": "This Mod adds a lot of pinewood trees to the area. Unlike other Tree mods for certain cities this \r\nNEXUS EXCLUSIVE! \r\nPLZ DONT UPLOAD ON STEAM WORKSHOP! \r\nTested it with \\\"WhiterunTrees\\\" by PixelRabbit and it works fine together!\r\nThat means if you like birches, you will have a very nice combo of trees along the animals in whiterun! Will release ",
  "descriptionHtml": "Hello Modfriends,\r\n\r\nI was very happy at first when i saw the first mods which are adding more vegetation to the Cities.\r\nIt was awesome to have more trees in Whiterun, but unfortunately these tree mods were adding just birch trees in Whiterun for example. \r\nNothing more. \r\nNo life, just trees.\r\nI decided to change this small problem.\r\nNow you can see birds flying over whiterun, Insects flying around flowers, which are placed around the roots of the big pinetrees.\r\nMaybe you will see one of the hares running around in Whiterun and maybe you will need some Herbs or Mushrooms, which you can find all around.\r\nIf you watch carefully, you will find some Statues of Dibella, holding a Dibella Flower, water  pouring on the flowers around her and drips into the small canal, which flows in a circle around Dibella and ends in small Waterfalls in a basin.\r\nBUT: \r\nYou must earn it with completing the Nettlebane Quest!\r\nIf you have not completed the Nettlebane Quest, you will see only half of the beauty Gardens of Whiterun can offer!\r\nIf you dont have completed the nettlebane quest yet, you will see more decent versions of the gardens. \r\nThey look a bit dull.\r\nThis is because of the dead  Gildergreen Tree.\r\nHis energy fills the town with more beauty. After his blooming you will see swift mist in the branches and blooming flowers at the statues with the same mist you can see at the Gildergreens branches.\r\nAfter his blooming you will see unbelievable changes to Whiterun!\r\nWaterfalls falling upwards and downwards at the same time, beautiful statues are beginning to let water flow, which seems to be more than just normal water. \r\nIts Gildergreens blessed Water flowing through the Town and unleashing a mysterious power, which citizens had never seen before, even in the old blooming days of the Gildergreen....\r\n\r\n--------------------------------------------------------------------------------------------------------\r\n!!!!!!!!!!!!!!!!!!!!VIDEO FOR FIRST IMPRESSIONS IN THE CLIP SECTION!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\r\n--------------------------------------------------------------------------------------------------------\r\nNEXUS EXCLUSIVE! \r\nPLZ DONT UPLOAD ON STEAM WORKSHOP! \r\n-------------------------------------\r\nHope you like my little mod:)\r\nI plan to make other cities a lot greener and add more life to them, but i first want to see the reactions for the first Edition of my \\\"Gardens of\\\"  - Mods.\r\n--------------------------------------\r\nVERSION 1.5 - The Big Blooming\r\nCorrected a bug which occured when Nettlebane quest is finished. \r\nGildergreen was duplicated on the same spot, so there was a very nasty graphical bug, where  you see parts of the ugly texture from the dead tree over the bloomy trees texture. \r\nATTENTION! NEW:\r\nYou will see all the changes if you finish the gildergreen Quest!\r\nIf you have not finished it, many places will look a bit dull and boring....no moths - thats right! go finish the quest and you will be lucky (about 10 spawnpoints for moths across whiterun!)\r\n...no proper lights, no nice plants at the statues and no mists at statues or gildergreen tree until you solve the Nettlebane Quest.\r\nI made this because i found out how the gildergreen is supposed to bloom and when the dead tree has to vanish. \r\nI played around this event function and bound some elements from my mod to this event.\r\nHope you guys like it!\r\nPLZ dont be shocked when you activate the mod and dont see the usual beauty! \r\nIts still there, it just needs to be earned now;)\r\nHave fun all and as always Suggestions, Critics or just Endorsements are very welcome:)\r\n----------------------------------------------\r\nVERSION 1.4a:\r\nRemoved a few Moth-spawnpoints at drunken huntsman and around the centre. removed all light pillars from dibella waterfall and some at the stairs, hope to undermine CTD`s with this. Minor corrections on light and mists, removed mist from gildergreen tree (testing higher placed mist in the blooming tree, maybe included in version 1.5 someday.) \r\n----------------------------------------\r\n\r\nVERSION 1.4 (2 VIDEOs UPLOADED!):\r\n-Ysgramor-Statues at stairs and Skyforge \r\n-standing platform for Ysgramor statue at stairs to Dragonsreach\r\n-light pillars at stairs to Dragonsreach\r\n-Mists to various spots (Statues, Gildergreen Tree, Watersurfaces)\r\n-more moth spawnpoints across whiterun, \r\n-Dynamic shadows from lights at Dibella Statue\r\n-added a name to the nameless Skeleton under the Bridge. He is a long forgotten Mage, which was hunted down for some reason, the player will find out soon more about this strange corpse under the bridge to Dragonsreach...\r\n-added a journal book next to skeleton (this is just the beginning of a WIP-quest. Atm nothing will happen when you pick up the book, but i intend to implement a quest related to the waterfalls and the \\\"magical\\\" Lights. \r\n------------------------------------\r\n\r\n-------------------------------------------\r\n-----------------------------------------\r\nInstall Instructions:\r\nYou will find all until now released Versions in this Package.\r\nPlease choose only ONE of them!\r\nThey are all named the same, so whichever version you choose, it will overwrite the previous version. \r\nIf you still have one of the separate evrsions available on my modpage, please delete them to prevent crashes or Bugs.\r\n\r\nHere is a small description for each file in this Zip:\r\n\r\n00 - Normal full Version (includes everything i originally implemented, such as many insects, many mist/smoke effects, some more bunnies running around AND Nettlebane quest related changes: you wont see every change of the mod if you have not solved the nettlebane quest yet!) <- recommended!\r\n\r\n01 - Red Eagle at Skyforge (Identical with normal version - just reddish light at skyforge)\r\n\r\n02 - Light_version (identical with normal version, except for the Dragonbridge: i removed the bisg waterfalls from the normal version and placed some more lorefriendly waterfountains instead...)\r\n\r\n03 - No Gildergreen related changes (this is just the normal Version WITHOUT any changes during the Nettlebanequest. You wont need to solve the Nettlebanequest to see the whole modchanges like in normal version)\r\n\r\n04 - No Smoke or Mist (removed every mist/smoke effekt i added in the normal version, rest is identical)\r\n\r\n05 - no Ysgramor Statue in front of Skyforge (removed on request, rest identical)\r\n\r\n06 - No Ysgramor Statue at Skyforge - Red Eagle at Skyforge\r\n(slightly red colored light on skyforge, lets the eagle shine reddish...not everyones thing, so its just another optional version for ppl who dun linke ysgramor in front of skyforge AND want the red eagle)\r\n\r\n07 - OPTIONAL!!! Rabbit overkill is a small mod which can be run standalone, it dont need any other mod. It was created to add much more life to whiterun, not everyone likes that, thats why i created this standalone evrsion, you can decide if you want much more rabbits or not. In normal versione are about 5 rabbits running across whiterun, with rabbit overkill there are about 12 Rabbits:)\r\n----------------------------------------\r\n------------------------------------------\r\n\r\nMore to come, so stay tuned!\r\nHave fun and constructive critics allowed!\r\n\r\n",
  "categoryId": "53",
  "version": "1.5.2",
  "author": "Madbane",
  "createdUnix": "1331182673",
  "updatedUnix": "1333976659",
  "containsAdultContent": false,
  "uploadedBy": "madbane",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51631",
      "name": "Gardens of Whiterun Insomnium 1-5-2 All In One Pack",
      "version": "1.5.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1563",
      "fileName": "Gardens of Whiterun Insomnium 1-5-2 All In One Pack-12399.zip",
      "uploadedUnix": "1333976659",
      "modVersion": "1.5.2",
      "virusScanUrl": "https://www.virustotal.com/file/9df387e6707a1d64c2f57e7e3cb0b2f8b14143523b86e6ef9261287ed6ff667b/analysis/1406806044/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gardens%20of%20Whiterun%20Insomnium%201-5-2%20All%20In%20One%20Pack-12399.zip?fid=51631&ttl=1535774256&ri=8192&rs=8192&setec=7c7f5201d9a4f374d9ad9b8c5bc25cd3"
    }
  ]
}