{
  "modId": 12397.0,
  "modName": "Arachnid Dungeon with Video",
  "summary": "If you want an eerie dungeon full of bugs and creepy crawlies heres a Brand new Dungeon in the wilderness around Tamriel\r\n",
  "descriptionHtml": "[youtube]_N7QVM_HA9M[/youtube]\r\nA backlash against the backlash against spiders in Skyrim, frankly there isnt enough creepy crawlies in Skyrim.\r\n\r\nHeres a dungeon ive made with more than enough creepy crawlies.\r\n\r\nINFO:\r\nmap isnt too big, its not a sprawling corridor dungeon, 1 short corridor to 1 room x3. \r\n3 corridors 3 rooms.\r\n\r\nmay take around 10-15 minutes to get through without dying.  take time to look around at the work ive done, the shadows, water room, the room decorations.\r\n\r\nno mazes just one way. it has 2 exits so no doubling back through an empty dungeon, 2 entrances, 2 different ways 2 play through it.\r\n\r\nI have used alot of creepy shadow effects shown in the vid, have a look\r\n\r\nTECHNICAL: \r\nAll levelled enemies, lots of triggers, sometimes enemy triggers in main room are ignored cant be helped after loads of tweaking and tests, the effect isnt really much worse without that trigger, Navmaesh is down, ROOM optimised, followers go in and follow correctly.\r\nhas got a mapmarker\r\nbased in Tamriel coordinates -15,5  Wilderness.  its not near anywhere of importance, mainly exploring land so it adds something important to that area.\r\nand if you want a quick look bring up your console and type COC AAAspider\r\n\r\nWHATS INSIDE?:\r\n\r\nattention to detail is my downfall but your reward, it took me ages, lots of clutter stuff, lighting and miscellaneous THINGS.\r\n\r\ngot a few treasure chests and goodies inside.\r\n\r\nlost of easy/medium enemies, just hack and slash your way through the spider horde.\r\nbut theres alot of spiders so it may be tough, and its got a couple of tougher spiders and got a boss spider and boss Dragon Priest.  \r\n\r\nit may be tough when they are all coming at you at once, keep your cool and be strategic in your battling and you will reach the other side.\r\n\r\nMYTHOLOGY:\r\nWas an old underground Temple, the insects and spiders got in and multiplied, killed all the humans and scared the rest away, now its only occupied by insects and the souls of some unlucky explorers that came across this god forsaken place looking for loot.\r\n\r\nAn old powerfull Dragon Priest has entered looking for somewhere to meditate and has managed to keep the spiders at bay and is hanging around in the fire room acting all badass. he knows his limit though and wont go forward into the main chambers or he will be consumed by the spiders.\r\n\r\nbugs: tested to the max on my PC, no bugs found. have ESP file but for better compatibility download the ESM version. use whichever works best, NMM will download both and you have the choice to tick either in NMM.\r\n\r\nCREDITS:\r\n\r\nbig thanks to JSNIDER193 for ESM conversion and cleanup work.\r\n\r\ncheck out his mods at:\r\nhttp://skyrim.nexusmods.com/modules/members/index.php?id=906002\r\nmod list\r\nCritter Variants\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6472\r\nMale Undies \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6640\r\nNordic Dungeon Suite Alternative\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10029",
  "categoryId": "88",
  "version": "2.0",
  "author": "mitzibishi",
  "createdUnix": "1331181477",
  "updatedUnix": "1332597971",
  "containsAdultContent": false,
  "uploadedBy": "mitzibishi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "46321",
      "name": "arachnid Dungeon esp and esm",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "95",
      "fileName": "arachnid Dungeon esp and esm-12397-2-0.rar",
      "uploadedUnix": "1332597971",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/bcfb91b6b4e5f86c967e39efbadca07a32ac1a7e4261d6c524138a32a2d2e346/analysis/1406776673/",
      "changelogHtml": " more dropping spiders <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/arachnid%20Dungeon%20esp%20and%20esm-12397-2-0.rar?fid=46321&ttl=1535774253&ri=8192&rs=8192&setec=efff74582579bbdb57e4f026b79b21ec"
    }
  ]
}