{
  "modId": 12405.0,
  "modName": "Super Arrows",
  "summary": "Two new (super fun) arrows added to the game.",
  "descriptionHtml": "This is my very first mod for Skyrim. I was messing around and decided to make it. \r\n\r\nThis adds two new arrows to the game, no replacements. But it does use the Daedric arrow model. You can find the arrows in a respawning chest behind Jorrvaskr (See picture).\r\n\r\nFirst is the Super Arrow, it does high damage and travels much faster and creates more force than a normal arrow, also staggers anyone near impact. Then there is the Super Duper Arrow, much more damage and force, staggers anyone near impact and does something special to those you kill.\r\n\r\nBEWARE. NPCs can use these arrows against you if you let them.\r\n\r\nThese arrows are probably overpowered, but I created them as a toy. The only conflict I can think of is if you have a mod that uses the same space as the chest. ENJOY!\r\n\r\nP.S.- I do take suggestions, but I am a NOOBIE so who knows if those suggestions would come to fruition. I do what I can and I will try. I haven\\'t perused the files for any mods like mine. If my mod happens to be exactly like yours, I apologize.",
  "categoryId": "55",
  "version": "1.0",
  "author": "Enigma1776",
  "createdUnix": "1331195876",
  "updatedUnix": "1331196541",
  "containsAdultContent": false,
  "uploadedBy": "Enigma1776",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41279",
      "name": "Super Arrows",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Super Arrows-12405.rar",
      "uploadedUnix": "1331196541",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/defe8d4929284d7d72d678d79a2b695f62c9b70a33105fc1c1dae1964f2f8013/analysis/1406737383/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Super%20Arrows-12405.rar?fid=41279&ttl=1535774266&ri=8192&rs=8192&setec=69bd4b24d14f862d392e12292507c666"
    }
  ]
}