{
  "modId": 12404.0,
  "modName": "Better Sounding Longhammer",
  "summary": "Did you ever find this fantastic Warhammer, only to draw it and realize it sounds like a wimpy sword? Well, this is the mod for you then!",
  "descriptionHtml": "I\\'ve been made aware that this mod is being hosted on other websites other than the Nexus and Steam Workshop.\r\n\r\nIf you desire to make copy of this file and host it somewhere else, please ask for permission before doing so. It\\'s in the agreement when you registered for the site, so please abide by the rules. \r\n\r\nPart of my giving permission will involve you linking back to the Nexus as well as the one on Steam Workshop. If this is not possible for whatever reason, then I will not give permission for this file to be hosted anywhere else, or by anyone else.\r\n\r\nThanks.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nI found this really cool Warhammer. It\\'s lighter, swings faster, and kicks butt! Unfortunately, whoever designed the sound for this hammer thought that since it\\'s smaller than a regular warhammer, it should sound smaller. So, he used 1 handed sword sounds for it.\r\n\r\nSigh.\r\n\r\nI know that this hammer is smaller, but come on! I\\'m a 2 handed barbarian, I don\\'t want to sound like I\\'m wielding a wimpy sword!\r\n\r\nSo, I tweaked this wonderful implement of bashing to sound like it\\'s bigger cousins! I thought it would be fitting to share this simple mod with the community, just for anyone else out there who cringed at the swinging sounds for the original hammer.\r\n\r\nI might think about modding the hammer a bit more in other ways if I get the time. Feel free to send me your suggestions!\r\n\r\nBTW, this is my first mod. I\\'m pretty new at using CK, but I think I\\'m getting the hang of it fairly quickly.\r\n\r\nLet me know if it works for you in the comments!\r\n\r\nHope you enjoy! :)\r\n\r\n-------------------------------------------------------------------------------------\r\n\r\nYou can also find this mod on Steam Workshop, if you prefer:\r\n\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=15392",
  "categoryId": "55",
  "version": "1.0",
  "author": "Trepmaws",
  "createdUnix": "1331193848",
  "updatedUnix": "1331194126",
  "containsAdultContent": false,
  "uploadedBy": "trepmaws",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41271",
      "name": "Manly Longhammer",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Manly Longhammer-12404-1-0.zip",
      "uploadedUnix": "1331194126",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3834a50c1e998522d14075198493149f52b58152c9641a79ff393311e3534ec5/analysis/1406737282/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Manly%20Longhammer-12404-1-0.zip?fid=41271&ttl=1535774264&ri=8192&rs=8192&setec=8cab25ed032cf7e5668bf78950f59ea3"
    }
  ]
}