{
  "modId": 12436.0,
  "modName": "Forsworn Faction Pack _ ArbitraryFA _ Forsworn",
  "summary": "Forsworn: WE quests, Favor Jobs, Recipes, Merchants, Followers/Animals/Pets, Trainers, Camp Gear, Player Homes/ Beds & Containers,+\r\n- Recipe Types:: Portable Forsworn [Camp] Gear;;; Weapons & Armor;;; Food: ;;; [[Arsenal Gear]]: Bindings: , Poisons (Bane:), Call (Beckon:) , Summon (Conjure:) , Utility: , [Trap] );;;  [[Universal Ingredients]]: (Hi",
  "descriptionHtml": "This weekend sometime after a 6:00p.m. ET night I will be releasing my 2nd mod \\\"Imperial Faction Pack - ArbitraryFA-Imperial\\\" The file will be uploaded and available on both Steam and Nexus.\r\nForum Post:\r\nhttp://forums.nexusmods.com/index.php?/topic/638852-imperial-faction-pack-pre-release-notes/\r\n\r\nThis mod expands the Forsworn Faction by adding tons of new features! There are new random world events! Followers! Crafting Recepies! etc. etc. And more! - - someone who complained about description\r\nNew Forsworn Oriented: Random Encounter quests, Favor Jobs, Recipes, Merchants, Followers/Animals/Pets, Trainers, Camp Gear, Player Homes/ Beds & Containers,+\r\n\r\n [ArbitraryFA - Forsworn.esm] ! always backup your saved games before using new mods !\r\n--- --- --- !!!  In order to join the Forsworn you must either... !!! --- --- ---\r\n1) Side with Madanach in the quest “Escape from Cidhna Mine!”. \r\n2) Place the Red Fury sword in \\\"Rebel\\'s Cairn\\\"\r\n3) Or for those not quest prone, read the book at the base of a tower outside Markarth. or find one in Druadach Redoubt on the table with the Reachmen Map. -Or- Simply use the scroll ( Renown ).\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n!*!*! UPDATE !*!*! – All added items are now crafted under “Hide”\r\n*** Likely to come soon (along with the already constant arbitrary/impulsive additions or changes)\r\nChoice to become a Briarheart. Already have the basic structure mapped out, will be similar to Vampirism & too cureable;;; Forsworn Workbenches specific for some items added by this mod as to avoid clutter (Perhaps Universal Ingredients, Archaic mixtures, yada yada);;; Purchase-able homes carved into the redoubts;;; shouts;;; Scrolls called chants that can be combined once you have all the individual phrases (scrolls) for very powerful scroll;;; More WE Quests/ variations;;; More followers;;; Cast-able spells obtained through equipping armor, NPC favor dialogue, or tomes that are timed and disappear from spell list after so long. essentially scrolls, but rather than by number of uses the concept will go by time passed;;; much more\r\n--- --- ---[[[Basics and Overview]]] --- --- ---\r\nAdds to what I am referring to as \\\"The 5 Holds of The Reach\\\" (Forsworn \\\"Capitals-Redoubts\\\": Druadach Redoubt, Hag\\'s End, Karthspire Camp, Lost Valley Redoubt, and Hag Rock Redoubt)\r\n[Map Markers]: 5 player homes, road markers, small Forsworn camp markers.\r\n[Containers]: 5 no-respawn chests “Forsworn Chest (Nr)”, 5 no-respawn knapsacks “Forsworn Pack (Nr)”, dispersed around the Reach respawning knapsacks “Forsworn Cache”\r\n[Merchants]: Hedge-Shaman (Spells), Hag Alchemist (Apocrathy), Pillager Smith (Blacksmith), Forager Druid (Hunter/Misc); Peregrinate Forager & Hag Peregrinate (Randomly Spread throughout the Reach or appearing in random encounters)\r\n[Followers]: Forsworn, Forager, Shaman, Pillager, Ravager ; Druadach Redoubt Members: Kaie.\r\n[Animal Followers]: War Hound & Frost Broodling (Essential, able to follow again after being released with the \\\"Stay\\\" dialogue); and summoned Broodling Thrall & Spirit Wolf (Summoned with the recipe “Beckon: Spirit Wolf” & \\\"Beckon: Broodling Thrall\\\") [Companion Pets]: Forsworn War Hound Pup & Forsworn Broodling ; they do not attack or take up an animal follower count slot; Pet your companion (dialogue) for a temp buff.\r\n- Portable Forsworn Camp Gear. Only the items starting with the beginning syntax \\\" [Camp] \\\". When you drop it give a moment for the firewood to settle to the ground, and try not to stand on top of it and look straight down.\r\n--- --- --- New, extended, and additional Random WE Quests --- --- ---\r\n- A new WE spawns a Forsworn Peregrinate Forager (a hunt/gather merchant) route to one of the 5 Redoubt-Hold Capitals (chosen at random). Another does the same but has a group of three Forsworn patrolling. A new Markarth Guard trio escorting a Forsworn Prisoner. Be sure to share items and give arms when you free your comrade. A new Markarth Guard trio patrol. A Forsworn triad in a skirmish with two Markarth Guards.\r\n- Many added vanilla WE triggers around the Reach, especially Forsworn oriented (Forsworn fighting Imperials, Hagraven fighting Spriggan, etc.)\r\n--- --- ---[[[General/ Arbitrary]]] --- --- ---\r\n- AoE Effects added by this mod do not affect the Forsworn followers and animal followers added by this mod (the AoE stagger with “Utility: Carpe Diem”, the AoE fear from “Bane: Hit & Run”, etc).\r\n- Followers added stay where you release them (No home location)\r\n- Buffs: Shrine of The Old Gods (One in each Canton); Hagraven Tribute (Hagraven Dialogue); Briarheart Lupine (Briarheart Dialogue); Pack Companionship (Hound Pup Dialogue); Brood Companionship (Brood Hatchling)\r\n- Hilt Notch: Added to most of the generic non-forsworn NPC inventories... One for each kill. They represent morale, reputation, and experience; and they are used in recipes, or they can be used to gain temporary speech/haggling increases (Renown).\r\n- Recipe Types:: Portable Forsworn [Camp] Gear;;; Weapons & Armor;;; Food: ;;; [[Arsenal Gear]]: Bindings: , Poisons (Bane:), Call (Beckon:) , Summon (Conjure:) , Utility: , [Trap] );;; [[Universal Ingredients]]: (Hilt Notch, Archaic Mixture, Vocation Kit)\r\n- Adds many craftable items based on universal item recipes; including food recipes with long-term buffs that require a type of meat + Archaic Mixture. The kicker is that there are 9 different ways to make Archaic Mixture. Meaning you don\\'t have to go looking everywhere for this one ingredient or have 50 of one required ingredient for a recipe and 0 of the other. Then there are Vocation Kits which are used to create forsworn utilities; like long-term Bindings which are applied to your armor or weapon like an augment/gear tune-up. Many of the recipes require things you are likely to get through \\\"Raiding\\\". The more forsworn oriented obtain method the recipe ingredients are, the easier and more plentiful the recipe items are to obtain. Like a Markarth Guard Cuirass.\r\n---[[[Notes]]] --- This mod needs to be towards the end of your load order if you use many mods. Changes to game mechanics/ general quests/ factions like Multiple Followers should be loaded after this.\r\n- Two chests are next to the entrance of Fort Sungard, to the right as you are walking in, full of the added items and ingredients for you to play around with if you wish.\r\n- Bindings: Sabre - make sure your weapons are drawn before using or it is wasted.\r\n- [Loot Changes] Animals: Added Wolf Blood to DeathItemWolf, Bit more meat, Bit more alchemy ingredients… Flora: Juniper, Hanging Moss, and Red-Blue-& Purple Mountain Flowers now have a chance to yield between 1-3 ingredients each.",
  "categoryId": "25",
  "version": "",
  "author": "Malzen",
  "createdUnix": "1331235648",
  "updatedUnix": "1333495143",
  "containsAdultContent": false,
  "uploadedBy": "Malanity333",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41425",
      "name": "ArbitraryFA - Forsworn 00",
      "version": "00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1257",
      "fileName": "ArbitraryFA - Forsworn 00-12436.zip",
      "uploadedUnix": "1331235781",
      "modVersion": "00",
      "virusScanUrl": "https://www.virustotal.com/file/a4a5a9e10657a6dfff81f3914664c177946e5eb712201a5d10acc2eaff2d9c06/analysis/1406738108/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArbitraryFA%20-%20Forsworn%2000-12436.zip?fid=41425&ttl=1535774336&ri=8192&rs=8192&setec=ddaa916ef9ad90120b191aeac211f0fd"
    },
    {
      "fileId": "43820",
      "name": "ArbitraryFA - Forsworn - Pre-WEQuests",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "677",
      "fileName": "ArbitraryFA - Forsworn - Pre-WEQuests-12436.zip",
      "uploadedUnix": "1331896764",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a5d3e79085244ba7d520d1307a05c2f94a6a44888ad6bf1e1a0c53111aff26ef/analysis/1406751543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArbitraryFA%20-%20Forsworn%20-%20Pre-WEQuests-12436.zip?fid=43820&ttl=1535774337&ri=8192&rs=8192&setec=e8c5257b94a60c116b6815caf7bf98b3"
    },
    {
      "fileId": "49864",
      "name": "Forsworn Faction Pack _ ArbitraryFA _ Forsworn",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1702",
      "fileName": "Forsworn Faction Pack _ ArbitraryFA _ Forsworn-12436-1.zip",
      "uploadedUnix": "1333495143",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/37777578a86a21ae2020dbbfac16aede4485467d4e6bc906b6514b9d9a34e102/analysis/1406795929/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forsworn%20Faction%20Pack%20_%20ArbitraryFA%20_%20Forsworn-12436-1.zip?fid=49864&ttl=1535774337&ri=8192&rs=8192&setec=99c0e099d780b3feb16df01e42fcb0d6"
    }
  ]
}