{
  "modId": 12448.0,
  "modName": "Nature of the beast",
  "summary": "The mod covers night eye ability and smell. You can sense others and others can sense you. Smell is influanced by the direction and strength of wind. Adrenaline surge has been added that temporarily increases your speed, increases maximum carry weight, increases your jump height at the cost of stamina. I have also added 6th sense ability.",
  "descriptionHtml": "Nature of the beast - ver. 4.00\r\n\r\n\r\n\r\nATTENTION: THIS MOD IS OBOLETE! CONSIDER TRYING CONTINUATION OF THE MOD: NATURE OF THE BEAST II: http://skyrim.nexusmods.com/mods/20721/\r\n\r\n\r\n\r\nANNOUNCEMENT:\r\n\r\n1) IF ANYONE IS USING VER. 2.0-3.7 OF THE MOD PLEASE UPDATE IT TO VER. 4.0 OR HIGHER WHICH GIVES CRITICALL IMPROVEMENT OF PERFORMANCE!\r\n\r\n2) If anyone likes the ideas behind this mod and has some knowledge about creation of new models and animations which regrettably I lack please contact me. I would like to improve this mod futher and implement a reptilian humanoid beast with wings. The beast should have additional animations such as spit (with venom), tail attack flying/gliding/falling animations. Such a person would ofcourse be mentioned as a co-author of the mod.\r\n\r\n\r\n\r\n\r\nWARNINGs:\r\n\r\n1) BE ADVISED! THIS MOD CONTAINS MANY SCRIPTS AND CAN POTENTIALLY AFFECT YOUR GPU! NEVERTHELESS YOU SHOULD TRY IT OUT. REMEMBER THAT THIS MOD IS MODULAR AND YOU CAN TURN OFF OR NOT USE ANY OF ITS COMPONENTS. IN CASE OF ANY SLOW DOWNS YOU SHOULD IN FIRST PLACE TURN OFF 6TH SENSE AND DETECTION OF PLAYER BY ACTORS.\r\n\r\n2) BE ADVISED! THIS MOD IS A WORK IN PROGRESS. I SUGGEST TO CHECK OUT THIS PAGE EVERY WEEK OR TWO FOR UPDATES.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nShort description:\r\n\r\nThis mod tweaks night eye abilities in many ways improving immersion. It also introduces the smell abilities that take into account the strength and direction of the wind. Not only you can smell most of the actors but some actors can smell you! Adrenaline surge ability has been introduced that makes you faster, stronger and increases your jump height at the cost of stamina. I have also added 6th sense ability that warns you if someone or something want to attack you. Remember you dont have to use all content of the mod. You can always turn off or remove some components that for some reason doesnt suit you.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLong description:\r\n\r\nI) Content of the mod:\r\n\r\n\r\n\r\n1) Night eye lesser power tweaks:\r\n\r\na) Night eye is toggleable\r\n\r\nb) Night eye effect is muted\r\n\r\nc) If you press \\\"[\\\" button you turn on night eye. If you press \\\"[\\\" button again you turn off night eye. The key can be customised in the Button.ini file - key variable. Due to the way night eye is lauched, you can turn it on or off while riding on horse. Night eye can also be turned on or off in vanilla way.\r\n\r\nd) If you hold \\\"[\\\" button you turn on passive night eye. If you hold \\\"[\\\" button again you turn off passive night eye. You can also turn on or off passive night eye by using Nature of the beast Settings Ring in your inventory or using lesser power. Passive night eye automatically turns on or off night eye depending on the amount of light on player. The amount of light can be customised in the Nature of the beast.ini file - NightEyeChangeLevel variable but in order to do so you must set SettingVariables to 0. You can also configure the variable by using Nature of the beast Settings Ring in your inventory. Passive night eye strength depends of the amount of light on player\r\n\r\ne) The effect of night eye and passive night eye is being applied/removed gradually to increase immersion. The speed of change can be customised in the Nature of the beast.ini - NightEyeChangeSpeed variable but in order to do so you must set SettingVariables to 0. You can also configure the variable by using Nature of the beast Settings Ring in your inventory.\r\n\r\nf) The strength of the night eye can be customised in the Nature of the beast.ini file - NightEyeStrength variable but in order to do so you must set SettingVariables to 0. You can also configure the variable by using Nature of the beast Settings Ring in your inventory. Passive night eye strength depends of the amount of light on the player.\r\n\r\ng) Night eye vision is by default green and with no blur. You can choose between 3 different colours of night eye (blue, red, green) in the Nature of the beast.ini file - NightEyeColour variable but in order to do so you must set SettingVariables to 0. You can also configure the variable by using Nature of the beast Settings Ring in your inventory.\r\n\r\nh) If player doesnt have night eye lesser power, vampire hunter sight lesser power is used. If player doesnt have night eye lesser power and vampire hunter sight lesser power, werewolf night eye lesser powers is used.\r\n\r\n\r\n\r\n2) Wind:\r\n\r\na) Is automatically added no mater what is the race of the player.\r\n\r\nb) The wind changes every time when whether changes. There are 16 directions. For example north wind means it blows from north. There are five types of strength of the wind. The stronger the more rare. You cannot have a strong wind when the weather is classified as pleasant.\r\n\r\nc) An ability is added automatically that allows to check the wind.\r\n\r\nd) You can turn on or off wind scripts by tweaking WindTurnedOn variable in the ring setup or ini file.\r\n\r\ne) In the Eastmarch you will encounter the phenomenon of thermal columns (a stream of hot air going up). It affects the smell abilities of all actors. In other words you can detect actors that are higher of you than ussually but you will find it more difficult to sense actors that are below of your position. The same applies to other actors. The closer to the center of the region of geysers the stronger the effect.\r\n\r\n\r\n\r\n3) Smell:\r\n\r\na) The mod will automatically add smell ability to Player that has any night eye lesser power or waterbreathing constant effect\r\n\r\nb) If you press \\\"]\\\" button you turn on smell. If you press \\\"]\\\" button again you turn off smell. The key can be customised in the Button.ini file - key variable. You can also turn on or off the ability by choosing appropriate power in magic menu and pressing the power button.\r\n\r\nc) The ability shows direction and strenght of wind and detected NPCs/creatures. In exterior places scanning with smell takes some time.\r\n\r\nd) If you hold the toggle button and then release it you activate/deactivate passive smell. It notifies you about random detected target every few sec. You can turn it on or off by using appropriate lesser power. You can tweak SixthSenseInterval (value 0-100) variable in the ring menu or via ini file to determine the frequency of the ability.\r\n\r\ne) The ability depends on the direction and strength of wind. \r\n\r\nf) The direction of the wind determines whether you can detect current actor while being in exterior world space. For example when the wind is north it means that it blows from the north and that you can detect actors north of you. When no wind or in interior you can detect a target no matter its position.\r\n\r\ng) The strength of wind affects how distant targets player can smell. The stronger the father. Maxdistance in interior = 4000.0. Maxdistance in exterior = 4000+4000+WindStrength.GetValue()*16000.0. This means that potentially the greatest range is 24000, but in practice unless you change the number of grids and cells being loaded the maximum number is 16000. Be warned changing the number of grids and cells in \\\"Skyrim.ini\\\" file can cause crashes and other problems. \r\n\r\nh) The strength also affects the angle of detection (both vertical and horizontal). You can detect only targets that lie in the direction of wind. Max angle = 45 - (22*wind speed). \r\n\r\ni) The smell provides you with information about target\\'s name (only if target is unique and you have learned its scent), race, sex, condition (whether its dead or alive) and distance (in percent  - current distance / current max distance of smell). Smell detect if current NPC is a vampire. You can learn scents of unique actors by approaching them and aiming at them while passive smell is turned on but only if you can sense them. You can sense most kind of actors. You cannot sense ghosts, fishes or magic anomalies. You cannot use smell while swimming. You cannot smell actors that are swimming.\r\n\r\nj) After the smell sequance you have the option to track a specific actor detected by the smell (added visual effect on tracked actor that shows you only a direction and not the actor itself which I think is more realistic). If you activate the smell again or you are unable to track it anymore for some time you turn off the smell track mode (the visual effect is removed immediatelly). While in smell tracking mode passive smell provides you with information only about tracked actor if you can sense it (if not information is provided as default). If you initiate smell while passive smell is active and you sensed some actor you are given an option to scan the surrounding area (classic smell ability) or skip that and immediately start to track the recently detected actor (usfull when in exterior places since scanning with smell takes some time there).\r\n\r\nk) Some actors can smell you as well. This will set them into alert state for some time. While approaching them take into consideration the direction and strength of wind. Beware animals, argonians, khajjits, vampires and werewolves. They cannot detect you when you are swimming. If you enter a new interior world space you are initially almost impossible to detect, but it gradually changes with time when your scent spreads in new place. In other word at the beginning you have a natural advantage. It doesnt matter whether you have a smell ability. Even if you dont they can still sense you. You can turn on or off detection by some actors of the player by tweaking ActorSmellDetectionTurnedOn variable in the ring setup or ini file. \r\n\r\nl) Be advised! The detection of player by actors requires a script to be run on any loaded actor and can potentially affect the speed of the game.\r\n\r\n\r\n\r\n4) Adrenaline surge:\r\n\r\na) The mod will automatically adds adrenaline surge ability to the player that has any night eye lesser power or waterbreathing constant effect.\r\n\r\nb) Temporarily increases your speed, increases maximum carry weight, increases your jump, reduces fall damage and increases several combat stats but constantly damages stamina. \r\n\r\nc) You can turn it off at any time. Automatically turns off when your stamina drops below 10.\r\n\r\nd) If you press \\\"-\\\" button you turn on adrenaline surge. If you press \\\"-\\\" button again you turn off adrenaline surge. The key can be customised in the Button.ini file - key variable. You can also turn on or off the ability by choosing appropriate power in magic menu and pressing the power button.\r\n\r\ne) Two versions:\r\n- time slows down\r\n- time doesnt slow down but you move faster\r\n\r\nf) You choose version by tweaking AdrenalineSurgeFast variable in ring settings or in the ini file.\r\n\r\ng) In the same way you can also change the AdrenalineSurgeJumpHeight (value from 100 to 500)\r\n\r\nh) As a rookie yout physical condition is lower and you can use adrenalins surge for shorter period of time. When your level is below 21 you will receive additional damage to stamina. The lower your level the higher the damage. \r\n\r\n\r\n\r\n5) 6th sense:\r\n\r\na) The mod will automatically adds 6th sense ability to the player that has any night eye lesser power or waterbreathing constant effect.\r\n\r\nb) It warns you if someone or something wants to attack you and provides you with direction of the threat. In other words the ability triggers when an actor is targeting the player.\r\n\r\nc) Two versions:\r\n- only notification\r\n- notification+trigger of adrenaline surge (player must have adrenaline surge)\r\n\r\nd) You choose version by tweaking 6thSenseOn variable in ring settings or in the ini file (value from 0 to 2, 0 = no 6th sense active)\r\n\r\ne) 6th sense automatically turns off adrenaline surge when no one is attacking the player and the 6th sense interval period hasnt expired. In such case automatic adrenaline surge is immediately possible.\r\n\r\nf) 6thSenseAdrenalineInterval (value from 0 to 360) value determines how much time must pass before 6th sense can trigger adrenaline surge again. You can change the variable in ring settings or in the ini file.\r\n\r\ng) SixthSenseInterval (value 5-100) value determines frequency of spamming the message. You can change the variable in ring settings or in the ini file.\r\n\r\nh) SixthSenseChance (value 1-100) value determines chance to detect the threat. You can change the variable in ring settings or in the ini file.\r\n\r\ni) Be advised! 6th sense requires a script to be run on many loaded actors and can potentially affect the speed of the game.\r\n\r\n\r\n\r\n6) Settings:\r\n\r\nYou can configure the mod by using Nature of the beast Settings Ring in your inventory. The ring is automatically added to your inventory. You can even add or remove abilities. Alternatively you can configure the mod via Nature of the beast.ini. Just make sure to set SettingVariables to 1 and set other variables as you like. Just remember this way of configuraion requires Dragon Script and will set varaiables every time you launch the game.\r\n\r\n\r\n\r\nII) Requirements:\r\n\r\n1) Skyrim,\r\n\r\n2) Dragon Script - without it the buttons, high jumps with adrenaline surge and the ability to customise the mod via .ini file will be disabled, the rest should work though.\r\n\r\n\r\n\r\nIII) Recommended mods:\r\n\r\n1) DYNAVSION - Dynamic Depth of Field by Gopher and MyGoodEye: http://skyrim.nexusmods.com/downloads/file.php?id=12525,\r\n\r\n2) Immersive HUD - iHUD by Gopher: http://skyrim.nexusmods.com/downloads/file.php?id=3222,\r\n\r\n3) Real Effect Candle by Yuril: http://skyrim.nexusmods.com/downloads/file.php?id=7643,\r\n\r\n4) Realistic Lighting With Customization by Pluto - 747823 - Leviathan1753 - Sydney666: http://skyrim.nexusmods.com/downloads/file.php?id=7654,\r\n\r\n5) Subliminal Traps by Mr Dave: http://skyrim.nexusmods.com/downloads/file.php?id=2653,\r\n\r\n6) SkyTEST - Realistic Animals and Predators by EtaYorius: http://skyrim.nexusmods.com/downloads/file.php?id=10175.\r\n\r\n\r\n\r\n\r\nIV) Instalation:\r\n\r\n1) Unpack the content of skyrim directory inside your skyrim directory;\r\n\r\n2) Do not download and install via NMM. Because of the Dragon Script files (.asi and .ini files) you should do it manually;\r\n\r\n3) Place the mod in any load order below number550:).\r\n\r\n\r\n\r\nV) Updates:\r\n\r\n1) Uninstall old version;\r\n\r\n2) Make a save (clean save);\r\n\r\n3) Install new version.\r\n\r\n\r\n\r\nVI) Future plans:\r\n\r\n1) Command hordes od creatures;\r\n\r\n2) Polymorph to few creatures;\r\n\r\n3) Telepathic abilities;\r\n\r\n4) Telekinesis of actors including throwing in different directions choking, reflective barrier;\r\n\r\n5) Flying/hovering ability (sophisticated with collision detection and taking into account gravity and direction and force of wind)\\'\r\n\r\n\r\n\r\nVII) Credits:\r\n\r\n1) Bethesda - for Skyrim,\r\n\r\n2) Alexander Blade - for Dragon Script - Keep up the good work (and updates!).\r\n\r\n3) Outlandstalker - for usufull tips\r\n\r\n4) MofoMojo - for help with the FoxRace problem in vanilla Skyrim\r\n\r\n\r\n\r\nVIII) Legal issues:\r\n\r\n1) This mod is provided as is.\r\n\r\n2) Notwithstanding the above any constructive criticism or suggestion will be appreciated.\r\n\r\n3) I do not take any responsibility for any errors caused by this mod (although I tried to test it as much as I can), use it at your own risk.\r\n\r\n4) You may use any part of this mod in whatever way you wish (I have even provided you with the source files). Just give me credit.\r\n\r\n\r\n\r\nIX) Suggestions:\r\n\r\n1) This mod relies on Dragon Script, which cannot be used when Skyrim has been recently updated (as long as new version of Dragon Script that is compatible with new version of Skyrim is not released) so keep backups of TESV.exe file. Without the Dragon Script the button, increased jumping height with adrenaline surge and the ability to customise the mod via .ini file will not work ... but the rest of the mod will (at least it should). In fact, in case you haven\\'t noticed, this mod combines Dragon Script mod with CK mod.\r\n\r\n2) Check out for updates of this mod from time to time on Skyrim Nexus site\r\n\r\n\r\n\r\nX) Bugs/issues:\r\n\r\n1) The ring menu mentioned above may seem to be broken.Few times I have experienced it myself although for me everything works fine now. It always seems to happen only with the last added option in the main menu. This bug is propably caused by wrong update of the mod - see appropriate section above. In case it wont fix the problem remember that you dont have to use the ring. You can always configure the mod via ini file in Skyrim directory and you can turn on or off passive abilities via abilities menu of Skyrim. I hope this helps. If not notify me.\r\n\r\n2) Occasionally the smell ability can describe NPC as FOXRACE when its a humanoid. This is a Skyrim glitch not caused by the mod. This problem should be eliminated in ver. 4.0 and above.\r\n\r\n3) some quest stages or fights can require you to cast no spells. This is a problem, because although you cant see this the mod constantly causes the player to cast spells via scripts. In such case you have to options: 1) turn off the mod for appropriate time, 2) turn off for appropriate time all passive abilities (night eye, smell, 6th sense), wind script and detection of player by actors.\r\n\r\n\r\n\r\n\r\nXI) Changelog:\r\n\r\n1) ver. 1.1 - Added the ability to customise the mod during game.\r\n\r\n2) ver. 2.0 - Tweaked settings script;\r\n\t    - Fixed button script - should work well now;\r\n\t    - Added wind;\r\n\t    - Added smell - both active and passive;\r\n\t    - Some actors can smell you as well;\r\n\t    - From now on when turning on night eye, you can no longer see the vanilla (gray) night eye visual effect for a brief moment;\r\n\t    - magicNightEyeScript has been tweaked so in case of uninstallation it works as if it was vanilla;\r\n\t    - Passive night eye has been added as a lesser power.\r\n3) ver. 2.01 - Fixed a bug that occasionally caused flashes of light and made nearby actors to become invisible for a second or two.\r\n\r\n4) ver. 3.00 - Added Adrenaline surge;\r\n\t     - Fixed sex and state messages in smell (will be shown only on some appropriate actors and not on all as previously).\r\n\r\n5) ver. 3.50 - Added 6th sense;\r\n\t     - Tweaked adrenaline surge.\r\n\r\n6) ver. 3.60 - The effect of night eye and passive night eye is being applied/removed gradually to increase immersion;\r\n\t     - The speed of change can be tweaked;\r\n\t     - Passive night eye strength depends of the amount of light on player;\r\n\t     - Night eye strength can be futher increased;\r\n\t     - You can choose between 3 different colours of night eye (blue, red, green);\r\n\t     - The same sound is being applied to both versions of adrenaline surge.\r\n\r\n7) ver. 3.70 - Fixed a small bug in 6th sense settings;\r\n\t     - Optimized abilities for better performance\r\n\t     - Reworked smell abilities;\r\n\t     - Added ability to learn scents of uniwue actors\r\n\t     - Smell abilities provide you with names of unique actors if you have learned their scent;\r\n\t     - Smell track mode added that helps you to track a specific actor (visual effect).\r\n\r\n8) ver. 4.00 - greatly improved performance of smell abilities;\r\n\t     - moved string actors used for creating strings for messages to custom inaccessible cell;\r\n\t     - now 6th sense provides you with direction of the threat;\r\n\t     - 6th sense can turn off adrenaline surge when no threat;\r\n             - improved configurability of 6th sense and passive smell;\r\n\t     - adrenaline surge burns more stamina when your level is below 21, the lower level the more damage to stamina;\r\n\t     - eliminated the FoxRace Skyrim glitch;\r\n\t     - OldRacePeople are now introduced as Nords;\r\n\t     - smell abilities detect if current NPC is a vampire.\r\n\r\n\r\n\r\nXII) Epilog:\r\n\r\nIf you are curious what\\'s on my mind check out my Oblivion mod: http://tes.nexusmods.com/downloads/file.php?id=38453",
  "categoryId": "24",
  "version": "4.00",
  "author": "gulogulo",
  "createdUnix": "1331239524",
  "updatedUnix": "1340660378",
  "containsAdultContent": false,
  "uploadedBy": "gulogulo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41453",
      "name": "Nature of the beast",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "46",
      "fileName": "Nature of the beast-12448.7z",
      "uploadedUnix": "1331239819",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/2ba9b256b047031f66d6b98feb35c6c3a0e25a74170c6651f7470b4af6413d1a/analysis/1406738358/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nature%20of%20the%20beast-12448.7z?fid=41453&ttl=1535774358&ri=8192&rs=8192&setec=ebba318eb203added0540420f6cb026b"
    },
    {
      "fileId": "43659",
      "name": "Nature of the beast v 1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "49",
      "fileName": "Nature of the beast v 1_1-12448.7z",
      "uploadedUnix": "1331847982",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ebc826199f89d7dec073886b4d08245c7b43d1f02d5dbeff3dd85d21701e52e9/analysis/1406750763/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nature%20of%20the%20beast%20v%201_1-12448.7z?fid=43659&ttl=1535774358&ri=8192&rs=8192&setec=7982390c7092e26f203ff94dc11663c0"
    },
    {
      "fileId": "54863",
      "name": "Nature of the beast v2_0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "76",
      "fileName": "Nature of the beast v2_0-12448.7z",
      "uploadedUnix": "1334944432",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/cb621f067e204fb052ea76a274fc4c798d590393e2cb1d6bc541d5efbe22a9a6/analysis/1406825403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nature%20of%20the%20beast%20v2_0-12448.7z?fid=54863&ttl=1535774359&ri=8192&rs=8192&setec=b9e49c296a4ecdb9a5a4678ba3e4d302"
    },
    {
      "fileId": "55477",
      "name": "Nature of the beast v 2_01",
      "version": "2.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "38",
      "fileName": "Nature of the beast v 2_01-12448.7z",
      "uploadedUnix": "1335131643",
      "modVersion": "2.01",
      "virusScanUrl": "https://www.virustotal.com/file/3888b239c40703611f4e6d147760a9446e02f574299ca8fe7d36f6cb0494781e/analysis/1406829430/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nature%20of%20the%20beast%20v%202_01-12448.7z?fid=55477&ttl=1535774359&ri=8192&rs=8192&setec=0ecfd5f2da8d84c8a81b5dfcfe422fa1"
    },
    {
      "fileId": "61350",
      "name": "Nature of the beast v3_0",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "84",
      "fileName": "Nature of the beast v3_0-12448.7z",
      "uploadedUnix": "1337032974",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/556d996235d7e0cc845c459c3fbd16cff863fa3389f7e9c2ff54a1e32d0cfdd7/analysis/1406892790/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nature%20of%20the%20beast%20v3_0-12448.7z?fid=61350&ttl=1535774359&ri=8192&rs=8192&setec=e2e6c74f224a13f3f0692bad05b309de"
    },
    {
      "fileId": "62075",
      "name": "Nature of the beast v3_5",
      "version": "3.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "88",
      "fileName": "Nature of the beast v3_5-12448.7z",
      "uploadedUnix": "1337349791",
      "modVersion": "3.5",
      "virusScanUrl": "https://www.virustotal.com/file/d90ff76049855dd602b38d89eb890cdfbae138a1b88367bb082678937ea75322/analysis/1406900057/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nature%20of%20the%20beast%20v3_5-12448.7z?fid=62075&ttl=1535774360&ri=8192&rs=8192&setec=e75deeeb0ade459b4e27dd603097a9f8"
    },
    {
      "fileId": "63211",
      "name": "Nature of the beast v3_6",
      "version": "3.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "90",
      "fileName": "Nature of the beast v3_6-12448.7z",
      "uploadedUnix": "1337803666",
      "modVersion": "3.6",
      "virusScanUrl": "https://www.virustotal.com/file/9b434d78b12914ad6607e40c693361de068452890ef81fb5fe8cd64385ec0e20/analysis/1406911206/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nature%20of%20the%20beast%20v3_6-12448.7z?fid=63211&ttl=1535774360&ri=8192&rs=8192&setec=2d315db2fb3ab59e0095c39c80bdcf82"
    },
    {
      "fileId": "65879",
      "name": "Nature of the beast v3_7",
      "version": "3.70",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "104",
      "fileName": "Nature of the beast v3_7-12448-3-70.rar",
      "uploadedUnix": "1338822647",
      "modVersion": "3.70",
      "virusScanUrl": "https://www.virustotal.com/file/6e0220cd4c0e128ccf785342566a9b926b184f7e8b2d449d62f637a463964ff6/analysis/1406937544/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nature%20of%20the%20beast%20v3_7-12448-3-70.rar?fid=65879&ttl=1535774361&ri=8192&rs=8192&setec=e15939c79a7b411c6b6f03acd383619c"
    },
    {
      "fileId": "70300",
      "name": "Nature of the beast v4_0",
      "version": "4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "103",
      "fileName": "Nature of the beast v4_0-12448-4-0.7z",
      "uploadedUnix": "1340660378",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/f4dcd7f66700e6e11aee7ab599d48173d38e9306c34f259ca9690731d63720f2/analysis/1406982902/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nature%20of%20the%20beast%20v4_0-12448-4-0.7z?fid=70300&ttl=1535774361&ri=8192&rs=8192&setec=45ca267c4e92695af230aa0ff3aec346"
    }
  ]
}