{
  "modId": 12450.0,
  "modName": "Deacons Dark Brotherhood Pack",
  "summary": "A pack containing all of my Dark Brotherhood Gear.",
  "descriptionHtml": "Install\r\n\r\nUnzip and put all the files into the /skyrim/data file.\r\n\r\nArmor Set: Standalone armor, adds an armor set to the dawnstar sanctuary in the master bedroom, obtainable and the end of the DB questline (or if it is already finished). This is a new armor set NOT a replacer for the shrouded armor.\r\n\r\nGloves - These light gloves are made for assassins, they are designed for silent killing and so add 2x backstabe damage, but they aren\\'t too thick, so also can be used for sublter tactics like lockpicking and pickpocketing which get a boost of 30%\r\n\r\nBoots - Study and Swift boots for the best of the Brotherhood. Their stability allows for +30% for 1 handed dmg, but they are swift, so sneaking is 30% easier and movement is muffled.\r\n\r\nHood - Those burning red eyes mark sharpness of sight as well and sharpness of mind. Not only is archery damage increased by 30% but potions are 30% stronger and speechcraft is 25% better meaning talking your way out of a lifetime sentence in jail might have just become somewhat easier.\r\n \r\nNecklace - A simple enough matter. The blood of the night mothers children is embued in this pendant, and her love is channeled through it. Her protection gives you 30% resistance to frost, fire, and shock.\r\n\r\nRing - A ring made by the greatest assassin mages reducing the cost of illusion and destruction by 30%. If that doesn\\'t please you you can just punch someone with it, because it is massive. It does 25 points of unarmed damage.\r\n\r\nThe Mail - Legend has it the blood of Sithis himself is worked into this armor, giving his will and strength. +15 to the light armor skill, 30% resist to disease, poison, magic, 25% increase to stamina and health regen.\r\n\r\n\r\nWeapons\r\n\r\nBow - It has a base of 19 damage (same as Daedric) deals thirty points of poison damage and 15 points of stamina damage and has a chance to paralyze. The model is a retextured Nightingale Bow and a new enchantment list was written for it. Found in the first room of the Falkreath Sanctuary on a short bookshelf to the left of the door. Can be gotten after the changes to that sanctuary.\r\n\r\nDaggers - Add\\'s a strong dagger (same stats as Daedric Dagger) to the Dark Brotherhood Sanctuary. It casts soul trap for ten seconds uses the Mehrunes razor enchantment and steals health from your enemies. Two can be found just inside the Dark Brotherhood sanctuary for those wanting to dual wield. Tempering requires 1 Daedra Heart and Daedric Smithing. The model is Mehrunes Razor with retexturing and a new enchant list, because let\\'s face it, the razor sucks.\r\n\r\nSwords - ON FIRE! That is right, custom flame effects!\r\n\r\nThis mod adds two swords to the Dawnstar Sanctuary master bedroom on the wall to the left of the door, right across from my armor set. These two swords are:\r\nThe Wrath of Sithis- Sithis\\' Wrath adds 20 points of fire damage 20 points of bleeding damage and causes people up to lvl 25 to run like the wind.\r\nThe Will of Sithis- Sithis\\' Will strengthens the blade allowing it to absord 20 points of stamina and health and makes undead up to lvl 25 flee and flat out banishes daedra up to level 25.\r\nBoth have so much of the power of sithis that when drawn they burst into spectral flames. Damage is base 11, but they can be fully upgraded to legendary with the right smithing ability and items.\r\n\r\nArrows - Arrows are the same as Daedric Arrows but have a skin set for the dark brotherhood.\r\nThey can be manufactured at the forge for the cost of 10 firewood, 1 ebony ingot, 1 hagraven feather, 1 daedra heart, 1 void salts, and 1 deathbell. The result is 100 arrows as strong as Daedric arrows, but designed for the Dark Brotherhood.\r\n\r\nCraftable Pack - Unenchanted version of all weapons. That means no flame effects on swords.",
  "categoryId": "36",
  "version": "1.0",
  "author": "Deacon Sawyer",
  "createdUnix": "1331240572",
  "updatedUnix": "1331240722",
  "containsAdultContent": false,
  "uploadedBy": "DeaconSawyer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41457",
      "name": "Deacons Dark Brotherhood Pack",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6298",
      "fileName": "Deacons Dark Brotherhood Pack-12450.zip",
      "uploadedUnix": "1331240722",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1cb9b442d4859c5752b88a1e74108c73692b14de3fc3a8de7a4c19c927120d0f/analysis/1406738487/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deacons%20Dark%20Brotherhood%20Pack-12450.zip?fid=41457&ttl=1535774364&ri=8192&rs=8192&setec=d6fa89b3621f121aea389ea4b04eb44b"
    }
  ]
}