{
  "modId": 1245.0,
  "modName": "Empowered Destruction Magic",
  "summary": "Empowers Destruction Magic providing scaling to destruction spells, better Master Spells, more cloaks, improvements on costs/magicka etc. Based on Penumbral\\'s mod.",
  "descriptionHtml": "Modifications to Destruction to make spell scale in power while filling the tree. The modifications are based on Penumbral\\'s mod.\r\n\r\nI increased range of bonuses for more options, made two separate versions, one with three augmented perks and the other as vanilla, huge improvements on Master Spells, more cloaks spells and some changes to casting. Other changes are in line with Penumbra\\'s mod.\r\n\r\n----------------------------------------------------------------\r\nImproved Destruction Perks:\r\n----------------------------------------------------------------\r\n\r\nThis version has three augmented perks, one more at skill level 90, adding another bonus to damage. This version scales better in power, with less spikes, but it has the drawback of a new perk that can be wasted depending if you then decide to remove the mod later.\r\n\r\n- 100% version: Expert +10%, Master +15%, +75% from Augmented Perks, total 100%\r\n- 105% version: Adept +5%, Expert +10%, Master +15%.\r\n- 110% version: Adept +5%, Expert +10%, Master +15%, and +80% from Augmented Perks.\r\n- 120% version: Adept +10%, Expert +15%, Master +20%.\r\n- 125% version: Apprentice +5%, Adept +10%, Expert +15%, Master +20%.\r\n- 130% version: Apprentice +5%, Adept +10%, Expert +15%, Master +20%, and +80% from Augmented Perks.\r\n- 150% version: Apprentice +5%, Adept +10%, Expert +15%, Master +20%, and +100% from Augmented Perks.\r\n\r\nNote: choose a version only (you find all of them in the archive) and use only that. As an advice for an adept run 100% is balanced, for expert 100%-120%.\r\n\r\n----------------------------------------------------------------\r\nImproved Destruction Perks - Original version:\r\n----------------------------------------------------------------\r\n\r\nThis is the version that has two augmented perks, as in vanilla skyrim. The pro is that since the perks remains the same there is more compatibility for the future, the drawback is that it has more spikes in power.\r\n\r\nThis version scales Destruction only by novice, apprentice, adept, expert and master perks.\r\n\r\n- 80%  version: Adept +5%, Expert +10%, Master +15%, +50% from augmented perks, total 80%\r\n- 100% version: Apprentice +5%, Adept +10%, Expert +15%, Master +20%.\r\n- 125% version: Novice +5%, Apprentice +10%, Adept +15%, Expert +20%, Master +25%.\r\n- 150% version: Apprentice +10%, Adept +20%, Expert +30%, Master +40%.\r\n\r\nNote: choose a version only (you find all of them in the archive) and use only that. As an advice for an adept run 80% is balanced, for expert 100%, for Master 125%. This version has more power at middle skills\\' level (the peak is at Destruction level 60) but then it balances later with the other, albeit it\\'s not perfectly equal.\r\n\r\n\r\n----------------------------------------------------------------\r\nImproved Master Spells:\r\n----------------------------------------------------------------\r\n\r\nAll master spells have increased power and utility. The costs are balanced for a build that relies a little on enchantments but not abusing them. \r\n\r\nThe esp comes in three versions:\r\n\r\nAll instant cast version: all master spells are instant casted. To compensate for the ability to cast them almost immediately the damage is lowered in confront to the normal version.\r\nLightning Storm instant cast version: Lightning storm is instant cast with increased cost (since it\\'s not AOE) and a little decrease in power. Firestorm and Blizzard have normal casting times.\r\nNormal: only more powerful Master Spells.\r\n\r\n----------------------------------------------------------------\r\nImproved Cloaks\r\n----------------------------------------------------------------\r\n\r\n- Added two new cloaks (for all damage types), a weaker and a greater version, for apprentice and expert, very useful for battlemage/spellswords characters. The tomes can be bought from vendors.\r\n- Reworked damage. Apprentice: 8, Adept: 12, Expert: 18.\r\n\r\n----------------------------------------------------------------\r\nImproved Walls\r\n----------------------------------------------------------------\r\n\r\n- Wall spells in this esp are changed in more powerful versions of Flames, Spark and Frostbite. For a probable bug wall spells in the original game didn\\'t scale in damage and (worser) the damage was applied literally every second instead as novice spells where the DPS is constant. This made them less effective than they could have been. Being now higher power version of novice spells they are much more effective and useful.\r\n\r\n----------------------------------------------------------------\r\nImproved Runes\r\n----------------------------------------------------------------\r\n\r\n- Increased rune base damage to 75.\r\n- Increased maximum rune count to 3.\r\n\r\n\r\n----------------------------------------------------------------\r\nImproved Casting:\r\n----------------------------------------------------------------\r\n\r\nThere are three options to choose from.\r\n\r\nNormal:\r\n- Dual Casting power: x2.5.\r\n- Dual Casting time: x1.3.\r\n- Dual Casting cost: x2.5.\r\n\r\nEnhanced:\r\n- Dual Casting power: x2.25.\r\n- Dual Casting time: x1.\r\n- Dual Casting costs: x2.4.\r\n- Magicka Regeneration in combat increased to 1,5% every second.\r\n- Casting costs are reduced by 1/4 per skill from original.\r\n\r\nDynamic:\r\n- Dual Casting power: x5.\r\n- Dual Casting time: x4.\r\n- Dual Casting costs: x4.\r\n- Magicka Regeneration in combat increased to 2% every second.\r\n- Casting costs are reduced by 1/3 per skill from original.\r\n- Dual Casting perk can be taken from skill 30 (and not from 20 as in original).\r\n- Novice spells (Flames, Sparks, Frostbite) has a little lowered damage.\r\n- Increased damage a little on the major spells for their singular (not Dual Casted) use.\r\n\r\nThe Normal version has an increased DC damage, a little lowered DC costs from original and a little increased DC time. Rest is invaried. This version is for users that want just a little more power while Dual Casting spells but the rest substantially the same as the vanilla experience.\r\n\r\nThe Enhanced version has DC power on par with the original, but it reduces costs of spells and increases magicka regeneration while in combat. This version is for users that prefer to be able to cast more spells while again retaining the vanilla experience.\r\n\r\nThe Dynamic version has a vastly increased DC damage but at the cost of much increased costs and time while using it; magicka regeneration is much increased from original and base costs are reduced. This version is for those users that prefer a more dynamic playstyle, less tied to DC and stunlocking. In this version DC is to be used with strategy, morover it has the surprisingly benefit of turning novice spells an useful arsenal from beginning to end while dual casted; you probably will use them very often as a pure mage in between more powerful attacks.  \r\n\r\nI reintroduced the Dynamic version after some little changes: I increased the requirement to take Dual Casting (so you can\\'t take it too early, making novice spell do too much damage for your level) and decreased a little damage of novice spells (that have no casting time so get practically no drawbacks from DC) so that they are still very powerful while Dual Casted, but not overpowered.\r\n\r\n----------------------------------------------------------------\r\nVersions Log:\r\n----------------------------------------------------------------\r\n\r\n- 1.45: Added a new esp with improved wall spells.\r\n- 1.44: Increased damage on spells in the Improved Casting Dynamic version because here they get used many times as single casting (vs. Dual Casted, as it is often the case in other versions).\r\n- 1.43: Reintroduced the Dynamic version of Improved Casting; now there are three versions to choose from. I made some adjustments to hopefully balance the game while using this interesting version.\r\n- 1.42: Added new cloaks. Reworked Improved Casting Dynamic since the way it was before, also if interesting because much less reliant on the broken impact, made spells without casting time overpowered and I don\\'t like it; when and if I will find a compromise somewhere for it to work without having some spells become OP I will reintroduce it. \r\n- 1.41: Lowered costs of Master Spells for a more \\\"normal\\\" use not requiring strong enchantments to lower costs. This also helps for the dynamic version of Improved Casting for users that want to use +regen enchantments instead of fortify ones.\r\n- 1.40: Balanced Master Spells and tailored their power depending on version used; made a new version of Improved Casting for a more Dynamic mage gameplay.\r\n- 1.30: First version of the mod.\r\n\r\n----------------------------------------------------------------\r\nHow to install\r\n----------------------------------------------------------------\r\n\r\nExtract the archive somewhere. Inside you will find various folders containing all the modifies. Chose the version you like in those directories.\r\nGo to: Drive Letter:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\\r\nFor those who don\\'t have bought the game on steam put the files in the Data dir where you installed the game\r\n\r\n1. Drop the chosen ESPs in the above folder (choose only one for power and master spells or put everything in there and only thick what you want, it\\'s the same)\r\n2. Launch the Skyrim Launcher, and click on \\'Data Files\\'\r\n3. Tick the chosen ESPs and click \\'Ok\\'\r\n\r\n\r\n----------------------------------------------------------------\r\nData Files grayed out?\r\n----------------------------------------------------------------\r\nGo to: Drive Letter:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Skyrim\\\\SkyrimPrefs.ini\r\n\r\nFor those who don\\'t have bought the game on steam, the SkyrimPrefs.ini file is located in Drive Letter:\\\\Users\\\\<USERNAME>\\\\Documents\\\\My Games\\\\Skyrim\r\n\r\nAdd these lines, or change them if they already exist so they match the below:\r\n [Launcher]\r\n bEnableFileSelection=1\r\n\r\nIf that fails:\r\n Go to: Drive Letter:\\\\Users\\\\[USERNAME]\\\\AppData\\\\Local\\\\Skyrim\r\n Make the Skyrim folder un-read only.\r\n\r\n\r\n----------------------------------------------------------------\r\nCredits:\r\n----------------------------------------------------------------\r\n\r\n- All credits for the mod goes to Penumbral. I just made my personal modifications and updated Master Spells to be more powerful. I made these modifications for my personal use and posted them in the Penumbral\\'s mod comments, but since I\\'ve had many people asking for them I thought to share them in a separate file.",
  "categoryId": "24",
  "version": "1.45",
  "author": "Penumbral - Lautreamont",
  "createdUnix": "1322085570",
  "updatedUnix": "1324065013",
  "containsAdultContent": false,
  "uploadedBy": "Lautreamont",
  "primaryFile": null,
  "files": [
    {
      "fileId": "11096",
      "name": "Empowered Destruction",
      "version": "1.45",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Empowered Destruction-1245-1-45.7z",
      "uploadedUnix": "1324064971",
      "modVersion": "1.45",
      "virusScanUrl": "https://www.virustotal.com/file/129eaf6cc4a14cefeecc814d934450d1aaa4c1886e0b83b00e8d9b448d6f8f64/analysis/1406526311/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Empowered%20Destruction-1245-1-45.7z?fid=11096&ttl=1535754709&ri=8192&rs=8192&setec=e69bb5fb0aaceb9e0f148290f3df8801"
    },
    {
      "fileId": "11097",
      "name": "Empowered Destruction - 2 augmented perks",
      "version": "1.45",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6",
      "fileName": "Empowered Destruction - 2 augmented perks-1245-1-45.7z",
      "uploadedUnix": "1324065013",
      "modVersion": "1.45",
      "virusScanUrl": "https://www.virustotal.com/file/994bf9d91e92d09d74757834be29f0f6846d2100e07759137a6e6cd126815d8f/analysis/1406526362/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Empowered%20Destruction%20-%202%20augmented%20perks-1245-1-45.7z?fid=11097&ttl=1535754709&ri=8192&rs=8192&setec=77ad2b37766a530f48712683e2911f48"
    }
  ]
}