{
  "modId": 12455.0,
  "modName": "Orc Companion Viin",
  "summary": "Female Orc Warrior Viin",
  "descriptionHtml": "Viin is an Orc warrior that favors two-handed weapons and light armor (though her heavy armor skill is almost as good). She comes with the Forsworn armor, a Glass Greatsword, a non-stock bow, and a small compliment of glass arrows (as well as a few supplies to help her traveling companion). You can find her weapon shopping in Warmaiden\\'s in Whiterun.\r\n\r\nNote: The faint facial markings are the result of setting warpaint in a light red tone and it not working quite as it should thanks to the buggy Creation Kit. I thought the pattern looked interesting so I didn\\'t change it. She is essential, should level with the player, and can be married (green girls can be sexy too; just ask Captain Kirk or a She-Hulk fan).\r\n\r\nPlace the zip file\\'s contents into your Skyrim/data folder to install and be sure to activate the ESP and ESM files in you Data Files listing.\r\n\r\nShe should also work with a vanilla install of Skyrim, but she will not look like she does in the screen shots. To get her appearance as initially created, you will need the following mods:\r\n\r\nCBBE V3 (standard body) and the hip texture compatability pack:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2666\r\n\r\nEnvision Face for CBBE:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=7897\r\n\r\nRANs HeadMesh Variants (Type D):\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=7127\r\n\r\nCover Eyes (eyes 1 file):\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4869\r\n\r\nKiller Keos Skimpy CBBE V2 Armor Set:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3654\r\n\r\nSpecial thanks to Blackie for his CM New Companions mod that includes a top-notch detailed tutorial on how to create Skyrim companions without the face discoloration bug. Get his mod and tutorial (contained in the mod) here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11669\r\n\r\nSpecial note: All of my future companions after Divada, Taja, Viin, and Kyia will be made using the Better Females by Bella mod. I switched to another mod set for faces (the ones listed here) due to a bug on my end I couldn\\'t resolve (the issue with females having faint male beard stubble on their faces while using Bella\\'s). I have resolved that issue, so I\\'ll be going back to Bella\\'s for my future projects. You DO NOT have to switch to Bella\\'s if you use the face mods listed above OR if you use other face mods. All of my companions should work with other face/body mods and vanilla setups unless specifically mentioned in the description. \r\n\r\nThe work around I found for the bug with Bella\\'s face mod is to use the standard Better Faces Version 3, and then apply the \\\"No Shine\\\" option available on her mod page.\r\n\r\nThe link to Bella\\'s Better Females is below.\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2812\r\n\r\nNote: I have added two screen shots with Bella\\'s Better Females installed so you can see the difference. If you\\'re still using vanilla; you might find either Envision or Bella\\'s to your liking. If you already have Envision installed, future companions will still work or if you currently use Bella\\'s you\\'ll now have an idea as to what my first four companions (Kyia, Viin, Taja, and Divada) will look like on your system.",
  "categoryId": "66",
  "version": "1",
  "author": "Grimraven1",
  "createdUnix": "1331245619",
  "updatedUnix": "1331245690",
  "containsAdultContent": false,
  "uploadedBy": "Grimraven1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41488",
      "name": "Viin",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "130",
      "fileName": "Viin-12455-1.rar",
      "uploadedUnix": "1331245690",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/0e10d2e5458c1de97e6b0c6ae9ce3eaba69f97f4fe09f685393e3dd62ebfabb4/analysis/1406738648/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Viin-12455-1.rar?fid=41488&ttl=1535774377&ri=8192&rs=8192&setec=a85bd6b934fb1f421999d40e90113a6f"
    }
  ]
}