{
  "modId": 12470.0,
  "modName": "Better Paladins and Sorcerers",
  "summary": "Be a better Paladin and Sorcerer with unique spells and enchantments.",
  "descriptionHtml": "Better Paladins and Sorcerers\r\n\r\nAdded Spells for those that would rather roleplay as a Sorcerer\r\n\r\nBoethiah\\'s Cloak (Adept Alteration): The same as the armor enchantment on the Ebony Mail, but in spell form. It\\'s the same concept as a flame cloak, and will do continual poison damage to those in melee range. Only works on hostile targets. Can be obtained by kill the \\\"Champion of Boethiah\\\" by searching his corpse, or if you already completed that quest, can be crafted at the SKYFORGE (only) by exchanging the Ebony Mail for the spell. \r\n\r\nCurse of the Draugr (Apprentice Alteration): Transforms a human foe into a Draugr ally for 30 seconds. They will take continual spiritual damage for 30 seconds while in form. They will not turn back into human form (still messing around with this) but will aggro you after the 30 seconds are up. So it\\'s a double edge sword, once you transform them, you will have to ultimately kill them once the duration is up because the spell only works on human NPCs, so since they are now a draugr, the spell won\\'t work on them a second time. Will not work on companions, unless you attack them (magic, weapons, etc.), and then they aggro you. Don\\'t use the spell on them, because they will never change back into human form.\r\n\r\nCurse of the Falmer (Adept Alteration): Same as the draugr\r\n\r\nCurse of the Troll (Expert Alteration): Same as the draugr, but for 60 seconds.\r\n\r\nCurse of the Werewolf (Master Alteration): Same as above, but for 80 seconds.\r\n\r\nCan be bought upon reaching the appropriate levels in Alteration.\r\n\r\n(See photos for the Effects of the New Spells)\r\n\r\nMore spells to come.\r\n\r\n======================================================================================================\r\n\r\n If you used my other mod, \\\"Be a better Mage with Unique Spells (http://skyrim.nexusmods.com/downloads/file.php?id=5283)\\\", You know that I geared that mod essentially to the dark magic builds because those were the ones I was using at that current moment. Then the mod grew from there. I then tried to see what it was like to build a pure Paladin/Monk build and found it really boring. So now here\\'s a mod that will totally make the Paladin build much more fun, strategic, and powerful. I wanted to role play as a genetically created being whose sole purpose is destroying the “Monsters” of Skyrim. Got the idea from the other amazing RPG, \\\"The Witcher\\\". Hope you enjoy it. Some nice spell combos can be made, with this mod. Like turning an enemy Draugr into a temporary ally (Command Undead), then cast \\\"Deify\\\" onto it to make it an immortal tank for 30 seconds. Just for an example, so many new combinations now.\r\n\r\n(Can obtain all the spells by bringing up the console and typing, \\\"coc qasmoke\\\" without the quotes. Will be in the spell tome container)\r\n======================================================================================================\r\nWhat this mod does-\r\n\r\n- Created special armor enchantments and weapon enchantments geared to the Paladin build. These enchantments are unlike the vanilla enchantments because as you spend the required perks, your character will begin to get more powerful. They will get faster (weapon speed and foot speed), stronger, more resistant to disease and magicka. Will explain this better further down below.\r\n- Adds 4 new perks to the restoration tree. As you spend the perks into it, you will notice, your character will begin to get more powerful. It\\'s a gradual process, so it won\\'t be mind blowingly powerful, and some may not even notice it (other than the weapon and foot speed boosts). Will explain this better further down below.\r\n- New spells to the school of restoration and Illusion. The Spells are: Haste, Magicka Null, Deify, Horror, Frenzied, Pacifism, Exorcism Beam, and four levels of, \\\"Command Undead\\\", spells. Will explain each further below.\r\n- Circlets can now be crafted under the jewelry category. It will come in two categories, light and heavy. They will level as you put perks into the light/heavy armor skill tree, can be tempered at a work bench like helmets, armor, etc., and will grant you armor increases like Matching Set (light/heavy) and Well \r\n\r\n*I think people don\\'t understand what this mod does. This mod doesn\\'t change any armor, whatsoever, it just adds an enchantment that you can place on ANY of your armor. Meaning, you can have ANY armor mod that\\'s out there, and put my enchantment on that armor. Also, I didn\\'t change ANY of the weapons, at all, the normal, vanilla steel weapons, will still damage humans and the draugrs, etc. It\\'s just that only my modded Blessed Steel weapons, will do +15/+20 damage to those monsters, but WILL NOT affect the human NPCs. It\\'s for role play purposes only. You can use this mod and NOT have to craft the weapons, or use the enchantments, if you just want the companion boosting spells. Please read further bellow what this mod does*\r\n\r\n======================================================================================================\r\nRecommended Mods:\r\nFor Higher Res Circlets: Aeterna Circlets (http://skyrim.nexusmods.com/downloads/file.php?id=1994)\r\n\r\nFor the weapons you see in the pictures: Malos Weapons (http://skyrim.nexusmods.com/downloads/file.php?id=5174)\r\n\r\nFor the unique armor: R18Pn01- Eisen Platte Armor (http://skyrim.nexusmods.com/downloads/file.php?id=11050)\r\n\r\nFor the glass armor retexture: Tribal Might Armor HD -Glass Armor Rehaul- (http://skyrim.nexusmods.com/downloads/file.php?id=10235)\r\n\r\n======================================================================================================\r\n\r\nPERKS\r\n- Under the restoration tree, you will notice that Novice restoration has 5 tiers to its leveling bracket. The first is just standard, vanilla Skyrim restoration. The 4 after it is what this mod is all about. They are called, \\\"Path of the Paladin\\\", and the easiest way to search for this when bringing up the console is, help \\\"Paladin\\\" 4. Pretty much everything related to this mod will come up, except for the weapons. Each perk can be unlocked at level: 20, 40, 60, and 80 restoration.\r\nAs you spend perks into this, it will unlock the abilities of the, \\\"Paladin\\\", armor enchantments. Also, it will unlock the hidden enchantments on the weapons and will make: Healing Hands and Exorcism beam more powerful. To notice these effects, simply spend the perk, then un-equip and then re-equip the armor to notice the differences. Again, it\\'s subtle and won\\'t be noticed immediately, but it\\'s there. I took time to make it not overpowered. Will explain what each level unlocks in the armor/weapons section.\r\n\r\n\r\nWEAPONS\r\n\r\n- Added a new weapon category (Skyrim vanilla weapons only at the moment) called, \\\"Blessed (Steel, Orcish, Ebony, Elven, Glass, Dwarven)\\\". They will appear and are able to be crafted (same ingredients as their normal version) as you unlock their perks under the Smithing tree (Ebony, Steel, Orcish, etc). These weapons WILL ONLY affect the CREATURES of Skyrim. Meaning: trolls, dragons, vampires, werewolves, hagravens, spriggans, Draugr, Daedra, etc. How this works is that those creatures that are deemed MONSTERISH, will allow your blessed weaponry to gain a +15/20 armor ignoring damage bonus. So these weapons work like the vanilla silver weapons, but will effect a larger pool of creatures. But you will cause ZERO, damage to humans. So when fighting a human based NPC, your weapons will do no damage at all. You will have to use a different weapon to do that, or, since you\\'re a Paladin, rely solely on your Companions to deal the damage to human NPCs. It will do normal damage to animals (bears, wolves, etc.), so no penalties or bonuses to them. Was inspired by the game, \\\"The Witcher\\\", trust me, you\\'ll get used to it and it\\'s fun to role play as a bad arse Paladin who can only damage the \\\"Monsters\\\" of Skyrim. The weapons are also enchanted, you won\\'t notice it immediately, but once you spend perks into the Paladin skill tree, the enchantments will present itself. The enchantments are fire and turn undead enchantments. The magnitude and enchantment type are dependent on the type of weapon you\\'re using. So Steel, Elven, Dwarven, and Orcish, will only have the fire base enchantments. Glass and Ebony, will grant both fire and turn undead enchantments. Glass and Ebony, since they are the strongest, will also have a +20 damage bonus to the creatures of Skyrim, the others will be +15.\r\nWEAPONS CANNOT BE DISENCHANTED. They also are only on the vanilla weapons at the moment. It’s a scripting mod, not an enchanted mod, so getting it to disenchant properly was difficult. So I had to redo ALL the vanilla weapons, in order for this to work (it was long and painful), and then had to do the recipes and tempering as well. For those who are familiar with how to use the CK or SkyEdit, you can manually place the script on any of your modded weapons, something I already did. Can’t add modded weapons to this mod, without the permission of the mod creators. Message me if you want to know how to do this.\r\n\r\n\r\nARMOR\r\n\r\n- It\\'s not the armor that grants the bonuses, but the Enchantment that does. If you\\'re starting a new game, you will be able to grab armor that\\'s already enchanted with the \\\"Paladin\\\" enchantment. If you pick the Stormcloak side, the dead body of the Stormcloak warrior, Gunjar, will be wearing this armor. It\\'s the same vanilla armor, only that it\\'s already enchanted. Only thing that\\'s different is that he\\'s wearing Stormcloak fur gauntlets as well and the Circlet will be in his inventory. \r\nIf you choose the Imperial side, in the chest, where you get your initial gear in the Vanilla version of Skyrim, you will see the Imperial gear is enchanted as well. It will also, have the, \\\"Blessed Steel\\\" weapon as well. This was done so that you don\\'t have to wait later in game to craft gear with these enchantments.\r\nIf you\\'re already far into the game, and don\\'t want to start a new game, then you can craft, Steel Armor, that\\'s called, \\\"Paladin Armor\\\", under the Steel category. You have to have to the Steel Smithing Perk, obviously. \r\n\r\nENCHANTMENTS\r\nWhen you first obtain (Beginning of the game) or craft the armor, you can disenchant them, as you would any other armor with enchantments that you want. The Enchantment on the item that you initially obtain or craft can only be placed on the same item of the same type. So the enchantment on the Cuirass can only be placed on a different Cuirass and Robes. Same for the Gauntlets and Boots. When disenchanting, or placing the enchantment on a different item of the same type. Nothing will change, and you\\'ll still have the same bonuses that were on the previous item. So when you first obtain (Beginning of the game) or craft the armor, you can disenchant them, as you would any other armor with enchantments that you want. This is true for the gauntlets and boots. The Enchantment can be placed on modded armor, without any problems. And if you have the Enchantment perk that allows you to put two on one item, you can do that as well. \r\n\r\n      GAUNTLETS\r\nWeapon Speed Buff: These will be unlocked when you spend the perks into the 40 and 80 Paladin perk. Your one handed/two handed weapon speed will be enhanced. Paladin 40 grants the same speed as the, “Dual Flurry 30” perk does and Paladin 80 will grant the same speed as the, \\\"Dual Flurry 50\\\" does. But if you spend perks into Dual Flurry, you will gain no speed boosts. This was done because those perks will double your dual wielding speed, and that would be game breaking.\r\n\r\nAttack Buff: This will boost your damage dealing capabilities with ALL the types of weaponry. You will gain the bonus as you spend perks into Paladin 20, 40, 60, and 80. The same as the Armsman, Overdraw, and Barbarian tree. But, they will only unlock if you don’t spend perks further into the Armsman, Overdraw, and Barbarian tree. You can spend the initial perks that’s needed to unlock the perks like Fighting Stance and Champion Stance. But once you spend the 2nd perk into those skill trees, the Attack Buff enchantment will no longer grant bonuses as you spend the perks into the Paladin skill tree. This was done to prevent you from becoming overpowered and allow you to focus only on the Paladin skill tree to be a bad arse One handed, Two handed, and Archery user while using on one skill tree. But you still have to spend the perks for the criticals, savage strike, beheading, ranger, etc. You have to be committed to the Paladin Perks, in order to become a true Paladin. You can avoid this, and level normally (spending perks into overdraw, Armsman, Barbarian skill tree) and still gain the other bonuses on the gauntlets. It’s up to you.\r\nUnarrmed Buff: You will gain bonuses to unarmed damage as well. When the Paladin Perk tree is fully unlocked, you will have a +20 unarmed damage bonus. Double that of a Khajiit.\r\n\r\nBOOTS\r\n\r\nSpeed Buff: When unlocking Paladin 20, 60, 80, you will gain a 10,10, 20 speed boost. Vanilla Skyrims foot speed is 100. At Paladin 80, you\\'ll be 140. Trust me, it isn\\'t game breakingly fast.\r\nMagic Resistance: As you spend perks, you\\'ll gain bonuses to Magicka resistance. When at 80 Paladin, you’ll be 50% more resistant to magicka damage.\r\n\r\nARMOR\r\n\r\nEach level unlocked will grant bonuses to health, magicka, and stamina regeneration bonuses. So at Paladin 80 you’ll gain: 100% health, magicka, and stamina regeneration. Also your combat health regeneration, at Paladin 80, will be about the same as a Troll\\'s combat health regeneration. You\\'re a bad arse, genetically enhanced mutant, you should rival a lousy troll. At level 80 Paladin, you’ll also be 100% resistant to diseases. \r\n\r\nCIRCLETS\r\n\r\n-\tThese can be crafted immediately, no smithing, perks required. They aren’t enchanted, so you can place any enchantment that you would like. I wrote a script that will allow you to gain the bonuses to Light/Heavy armor. But you have to be wearing the same type of circlet with that particular armor. So the Light Armor Circlet, will only grant the bonus while you’re wearing Light Armor gear, the same goes for the Heavy armor. Go to the Jewelry section at any forge, and you\\'ll see that they are properly labeled as: Light and Heavy. This is so you can avoid any confusion. But you can enchant and rename them whatever you want. They aren’t as powerful, armor wise, as a helmet, but the will level as you put perks into the heavy/light armor tree. This is for role playing purposes only. And can be Smithed to Flawless (since it’s jewelry, I believe the game engine won’t allow it to go further) when you have 100 smithing. Of course you can reach Legendary with the known, enchanting, alchemy exploits.   \r\n          Circlets won\\'t immediately show the Matching Set armor bonus when unlocking that perk. Don’t worry, put it on, exit your inventory, and then reopen it, you will see that the bonus is properly applied.\r\n\r\nNEW SPELLS\r\n\t\r\n-\tFrenzied: A Master level Illusion Frenzy spell that will permanently send enemies up to level 30 into berserk mode, until they’re dead.\r\n\r\n-\tHorror: Fear spell that does the same\r\n\r\n-\tPacifism: A calm spell that does the same.\r\nOnly works on a single target at a time, will not be enhance when dual casted, will get more powerful when spending perks into Kindred Mage, Animage, Mind Mastery, etc. WILL NOT AFFECT COMPANIONS. Would be a disaster if they did. These 3 spells, hopefully, can be bought from Drevis at the College of Winterhold after completing the Illusion Ritual Quest. \r\n\r\n-\tHaste: (Adept Restoration) Double the weapon speed of a companion for 15 seconds. Can be dual casted for a 30 second boost. WILL ONLY WORK ON COMPANIONS. So you’re not penalized if you mistakenly hit an enemy NPC. Will only work on Human NPCs, not pets, or summons, etc. Can be bought when reaching Adept level Illusion, from a spell vendor.\r\n\r\n-\tCommand Undead (Apprentice, Adept, Expert, Master Restoration): These spells will put UNDEAD NPCs under your command for 30 seconds (60 seconds for the Master level one). Meaning, they will be a companion for you for that duration, they will fight and deem whoever you deem as an enemy, an enemy. Apprentice, Adept, and Expert level can be dual casted for longer duration, the Master level cannot. Will only work on Undead (Draugrs, vampires, etc.) I experimented with human NPCs but found it too powerful because there isn’t a limit to how many you can do at a time, so it would be too powerful to use on them. I wanted to maintain this a strictly a pure Undead, destroying Paladin.\r\n\r\n-\tExorcism Beam (Novice Restoration): This will allow you to fire a beam of pure energy on the Undead. Will work only on the Undead. It’s the same as a flame, spark, frost spell. But will triple in effectiveness once unlocking level 80 Paladin. Can be dual casted. Can be bought from any spell selling vendor. \r\n\r\n-\tMagicka Null (Expert Restoration): For 15 seconds, take away the magicka capabilities of an enemy Mage. They will then have to focus on attacking with their pathetically weak daggers. Some may not even have daggers, so will then try to fight you unarmed. Can be dual casted for a 30 second boost, and should work on most enemy mages. May not work on high level Mages, like Dragon Priests. Won’t work on Dragons.\r\n\r\n-\tDeify (Master Restoration): Triple the damage dealing (one handed, two handed, and Destruction Magic) of your companions for 30 seconds. It will also make them immune to magicka and immortal for those 30 seconds. Will not be enhanced when dual casting.\r\n\r\n          SPELL TWEAKS\r\n\r\n-\tHealing Hands will work on ANY of your companions now: Summons, Pets, Zombies, Command Undead allies, etc. Will also double in strength when unlocking Paladin Perk 80. \r\n\r\n\r\nOPTIONAL FILE\r\n\r\n-\tMutant: This is a simple mod that will further help role play as a genetically enhanced destroyer of the undead by granting you the ability to jump higher and fall from much higher distances without getting hurt. Also boosts to power attack stamina reduction, shield bashing, and sprinting. Not too much and isn’t too noticeable. Totally optional\r\n\r\n\r\nKnown Issues: \r\n\r\nWith the Command Undead spells, sometimes your companions will attack your undead ally. Doesn’t happen a lot, but it does do happen. Put away your weapons and they might no longer still view them as a threat.\r\n\r\nBlessed Weapons will show a 0 as its damage dealing capabilities. Don’t worry, it will still work as intended. If you equip a standard weapon, and then view your inventory again, it should show the proper damage of your weapon. ",
  "categoryId": "75",
  "version": "2.1",
  "author": "Concept83",
  "createdUnix": "1331259126",
  "updatedUnix": "1331259126",
  "containsAdultContent": false,
  "uploadedBy": "Concept83",
  "primaryFile": null,
  "files": []
}