{
  "modId": 12485.0,
  "modName": "Player Army Members Basement and Quests",
  "summary": "--04/04/2012 Ver1.0 file have already uploaded.\r\nThis mod provides 15 new Npcs and 1 simple basement for them.\r\n15Npcs can trade weapon and apparel and so on, and they use it.\r\nYou can invite them to the PT at the same time, and walk through in the skyrim.\r\n3 hard battle quest are included to enjoy fighting with them.\r\n2 new thu\\'um are included t",
  "descriptionHtml": "----------------------------------------------\r\nSummary\r\n----------------------------------------------\r\nThis mod provide 9 new Npcs(Army members) and 1 simple basement for them.\r\n9Npcs can trade weapon and aparrel and so on.\r\nThey wear the given weapon and apparels(v0.1).\r\nPlayer can invite them to the PT at the same time(MAX 9Npc),\r\nand walk through all areas in the skyrim(v0.2).\r\nHard battle quest against undead is added(v0.3).\r\nVery hard quest, battle against Dragon, is added(v0.4).\r\nNew thu\\'um which concentrates targets of armymembers to the player\\'s target.(v0.5)\r\n6npcs are added to the army members.(v0.6)\r\nExtremely hard quest, battle against Thalmor, is added.\r\nPlayer army\\'s cloaks and banners are added as a reward of the thalmor quest.(v0.7)\r\nVer0.7 quest is Modified to easier, and peformance might be improved.(v0.71)\r\n\r\n\r\nThis mod is designed for high level charactor like those who finish vanilla original quest.\r\n(Maybe character level is over 50)\r\nTo be more specific,\r\n1st quest is designed for over 50level.\r\n2nd quest is designed for over 70level.\r\n3rd quest is designed for near 100level.\r\n----------------------------------------------\r\nDetails\r\n----------------------------------------------\r\n9npcs exist in the Inns of 9 major cities. Please visit each Inn and scout them.\r\n - City name - Inn name - Character Name, Based character (Race)\r\n\r\n - Riften - Bee And Barb - Nana, based Vex  (Imperial)\r\n - Whiterun - Bannered Mare - Mina, based Aela (Nord)\r\n - Windhelm - Candle Haerth Hall - Bear, based Ulfric (Nord)\r\n - Winterhold - The Frozen Hearth - Ena, based Faralda (Hight Elf)\r\n - Markarth - Silver Blood Inn - Nero, based Ondolemar (Hight Elf)\r\n - Morthal - Moor Side Inn - Bash, based Yamarz  Orc)\r\n - Dawnstar - Wind Peak Inn - Ten, based Nazir (Red guard)\r\n - Falkreath - Dead Man\\'s Drink - Kana, based Deeja (Kajieet)\r\n - Solitude - The Winking Skeever - Mana, based Aia aria (Bard)\r\n\r\nThe basement is located at the south of Helgen.\r\nIf you can\\'t find the basement, please use console comand.\r\n Write \\\"coc armybasement\\\" and hit enter.\r\n\r\n--03/12/12 ver0.2 up info--\r\nPlayer can invite them to the PT(MAX 9Npc), and walk through all areas in the skyrim.\r\n(fast travel enable. Mods for a follower are not applied.(For example, \\\"ask follower skill\\\" etc.)\r\n--03/12/12 ver0.2 up info end--\r\n\r\n--03/17/12 ver0.3 up info--\r\nOne npc, named Glass, is added in the basement.\r\n\r\nShe gives a new quest and reward.\r\nIf player\\'s level was below 50 and army members are not replaced their equipment by the stronger one,\r\nit is very hard to complete this quest.\r\n--03/17/12 ver0.3 up info end--\r\n\r\n--03/19/12 ver0.4 up info--\r\nIf you finished v0.3 quest, \\\"Rescue Falkreath\\\", you can take new quest from Glass.\r\nThis quest is very hard.\r\nSo enchantment of cold resistance, blooking and escaping from dragon\\'s attack are necessary.\r\nFinally, you can learn new Thu\\'um.\r\n--03/19/12 ver0.4 up info end--\r\n\r\n--03/23/12 ver0.5 up info--\r\nNew Thu\\'um which concentrate targets of armymembers to the player\\'s target is added.\r\nNew Thu\\'um can be learned from a book on the corner table in the basement.\r\n--03/23/12 ver0.5 up info end--\r\n\r\n--03/24/12 ver0.6 up info--\r\n6Npcs are added. They exist in the Inns of 6 minor towns.\r\nThey are stronger than prior members.\r\nBecause they have some spells, shouts and perks initially according to their combat style.\r\n\r\n - Town name - Inn Name - Character Name, Based character (Race) - Combat Style\r\n - Rorikstead - Frost Fruit Inn - Sana, based Jenassa (DarkElf) - Dual Wield\r\n - Ivarstead - Vilemyr - Una, based Mercer (Breton) - Dual Wield\r\n - DragonBridge - Four Shields Tavern - Rin, based Danica (Nord) - Healing\r\n - Kynesgrove - Braid Wood Inn - Mona, based Mjoll (Nord) - Two Handed\r\n - Riverwood - Sleeping Giant Inn - Kuna, based Aranea (WoodElf) - Destraction\r\n - Old Hroldan - Old Hroldan Inn - Rena, based Dinya (Breton) - Healing\r\n--03/24/12 ver0.6 up info end--\r\n\r\n--03/30/12 ver0.7 up info--\r\nFirstly, massive credit to Backsteppo and Zenl for the original cloak meshes used in this mod, and for giving me permission to make use of them \r\n\r\nIf you finished v0.4 quest\\\"Kill the Frost Dragon Lord\\\", you can take a new quest from Glass.\r\nThis quest is extremely hard.\r\nSo I gave some shouts, spells and perks to army members.\r\nAnd I made cool down time of the shout,\\\"RestorationFollower\\\", short.(From 75sec to 30sec)\r\n\r\nPlayer army\\'s cloaks and banners are added as a reward of the quest noted above.\r\nBanners are automatically shown up in the basement after completing  the quest.\r\nCloaks are in the chest near the training dummy. \r\nThe chest is also automatically shown up after completing the quest.\r\n--03/30/12 ver0.7 up info end--\r\n\r\n--03/31/12 ver0.71 up info--\r\nEnemies in the Thalmor Army Post were reduced.\r\nAnd the Thalmor Army Post was divided to 3 blocks in order to prevent all enemies attacking to the player at the same time.\r\nAs a result, the performance might be improved.\r\nAnd chests which include portions are added under tents in the Thalmor Army Post.\r\n--03/31/12 ver0.71 up info end-- \r\n\r\n----------------------------------------------\r\nInstall\r\n----------------------------------------------\r\n-Overwrite or place armybasement.esp to your data folder\r\n-Overwrite or place armybasement.bsa to your data folder\r\n\r\n--note:version0.1 remover--\r\nWhen i uploaded ver0.1, I mistook script folder name \\\"Script\\\". (Scripts are correct...)\r\nSo I think mod didn\\'t work for those who download ver0.1...\r\n\r\nAnd I renamed esp file.(remove version#.)\r\nBecase filename is different, game engine think these mods are different. \r\nAs a result, mod updating will become difficult for users.\r\n\r\nAnd i renamed fragment script files which are auto genereted by CK\r\nin order to avoid confliction with other mods.\r\n(Detail info of object used in this mod is written in readme.txt Please look at the \\\"OBJECT STRUCTURE OF THIS MOD\\\" part.)\r\n\r\nIf you installed ver0.1, you can delete all files using PAMBv0.1Remover.bat in the ZipFile.\r\nPlace the bat file to your data folder, and run it only.\r\n--------Coution!--------\r\n\r\nIf you gave npcs some items, please take them back from npcs before delete ver0.1.\r\n\r\n---------------------------\r\n--note:version0.1 remover end--\r\n\r\nSorry for my mistake of ver0.1 very very very...\r\n\r\n----------------------------------------------\r\nKnown issue\r\n----------------------------------------------\r\n-If you have used some mod, using quest object, and deactivate it, npc may not reply player\\'s comment.\r\n-Nordic chests are respawn status. please do not use until next update(change player home chest.)\r\n ---->fixed ver0.21\r\n\r\nBash don\\'t use one-handed or two-handed weapons.\r\nPlease give bash the weapon like \\\"bow & arrows\\\" or \\\"lightning staff\\\" \r\nwhich enable bash to attack from far distance.\r\n\r\nAfter giving bow or staff, bash start combat with one-handed or two-handed weapons.\r\n\r\n--03/17/12 ver0.3 up info--\r\n-If you killed all undeads, and quest didn\\'t go the next step.\r\n Please use console command to let quest go the next step.\r\n  \r\n SetStage PlayerArmyQuest01 30\r\n And then speak to Glass.\r\n--03/17/12 ver0.3 up info end--\r\n\r\n--03/24/12 ver0.6 up info--\r\nSana and Una can use dual weapons.\r\nBut when you trade weapons with them, they equip only one weapon on right hand.\r\nDon\\'t worry this. When they will start combat, they will use dual weapons on both hands.\r\n--03/24/12 ver0.6 up info end--\r\n\r\n--03/30/12 ver0.7 up info--\r\nThalmor quest loads many npcs, so sometimes game freezes, especially when you taking screenshots.\r\nI recommend you to set graphic option lower than that which you usually use.\r\n\r\nIf you want to take reward without quest battle, please look below.\r\n \r\nAfter taking quest from Glass, please use console command.\r\n [Falkreath Rescue]\t\tSetStage PlayerArmyQuest01 30\r\n [Kill the Frost Dragon Lord]\tSetStage PlayerArmyQuest02 30\r\n [Wipe out the thalmor armies]\tSetStage PlayerArmyQuest03 20\r\nAfter setting stage to each quest, please speak to Glass in order to take reward and go to the next quest.\r\n\r\nReward of the quest, \\\"Kill the Frost Dragon Lord\\\" , is in the chest at the back of cave, \\\"Frost Dragon Lord Nest\\\".\r\nSo please run through cave and use unlock command to the chest and take a new Thu\\'um book.\r\nEnemies in \\\"Frost Dragon Lord Nest\\\" and \\\"Thalmor Army Post\\\" are every time in there and respawn.\r\nSo you can enjoy battle all-time after completing quest. \r\n--03/30/12 ver0.7 up info end--\r\n\r\nIf army member is dead, please follow next steps.\r\nFirstly, take their equipments from their dead bodies.\r\nNext, open the console and select their dead bodies.\r\nWrite \\\"resurrect\\\" and hit enter.\r\nWrite \\\"disable\\\" and hit enter.\r\nWrite \\\"enable\\\" and hit enter.\r\nAfter then, they rise from the dead.\r\nPlease give them equipments back.\r\n\r\n----------------------------------------------\r\nVersion history\r\n----------------------------------------------\r\n2012/03/08 ver0.1\r\n2012/03/10 ver0.2 Player can take npcs to the field\r\n2012/03/13 ver0.21 Comments of npc and chest in player army basement are changed.\r\n2012/03/17 ver0.3 One quest, \\\"Falkreath Rescue\\\" , is added. \r\n2012/03/19 ver0.4 One quest, \\\"Kill the Frost Dragon Lord\\\" , and new Thu\\'um, \\\"RestorationFollower\\\" are added.\r\n2012/03/23 ver0.5 one new thu\\'um, \\\"Concentrate Target\\\" , is added. \r\n2012/03/24 ver0.6 6npcs are added.\r\n2012/03/30 ver0.7 One quest, \\\"Wipe out the thalmor armies\\\" , new cloaks and banners are added.\r\n2012/03/31 ver0.71 Quest, \\\"Wipe out the thalmor armies\\\" , is modified easier and peformance is improved.\r\n2012/04/02 ver0.72 Nif file\\'s texture path setting are changed to relative reference.\r\n2012/04/04 ver0.73 Bug fixed. When army member is resurrected, they can equip given weapons and apparels.\r\n2012/04/04 ver1.0 Reorganize sound files in order to make npc\\'s comment more visible. And compress script, sound, nif and dds files to bsa file.\r\n-------------------------------------------\r\nNote\r\n-------------------------------------------\r\nThis mod is created for my studying of CK, my first mod.\r\nSo quality is not so well.(You may feel rough.)\r\nAnd I\\'m not good at English, so Npc\\'s comment might be felt strange.\r\nI apologize on ahead.\r\n\r\nIf you have an idea of better English or any questions, please comment.\r\nI will change in the next update or reply comment as possible as I can. \r\nPlease enjoy!",
  "categoryId": "66",
  "version": "1.0",
  "author": "kyojan",
  "createdUnix": "1331274985",
  "updatedUnix": "1333529225",
  "containsAdultContent": false,
  "uploadedBy": "kyojan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44817",
      "name": "v1 files remover",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "v1 files remover-12485-1-0.zip",
      "uploadedUnix": "1332175219",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ff2984e3c5470f61e4d182b4e66d4eb7a9f0ca6585e26362b1d327802445ce15/analysis/1406767926/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/v1%20files%20remover-12485-1-0.zip?fid=44817&ttl=1535774414&ri=8192&rs=8192&setec=e372cca5893dd576b722d96d3e02a675"
    },
    {
      "fileId": "49974",
      "name": "Player Army Members Basement and Quests v 1 0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16859",
      "fileName": "Player Army Members Basement and Quests v 1 0-12485.zip",
      "uploadedUnix": "1333529225",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3e1d220f3db56b9fd4783792f4c0463494f963f098ec0b522a3afb23e9ca14ba/analysis/1406796622/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Player%20Army%20Members%20Basement%20and%20Quests%20v%201%200-12485.zip?fid=49974&ttl=1535774414&ri=8192&rs=8192&setec=db305020f21d4fe682080cbd801e9709"
    }
  ]
}