{
  "modId": 12506.0,
  "modName": "The Chronicles of Steel -Skyrim- Realswords NEXUS EXCLUSIVE",
  "summary": "In this module I&#39;ve released Realswords Nord. It features over 75 brand new weapon models and textures, each with their own unique feel. If you can&#39;t afford the new versions of the weapons, you can find Worn and Old versions of the weapons in your travels. They have been distributed amongst many of the NPCs such as Bandits, Stormcloaks, Dra",
  "descriptionHtml": "[center][img] http://i.imgur.com/aSN9A.png [/img][/center]\r<br />\r<br />[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/hXQSy.png[/img][/url][/center]\r<br />\r<br />This mod adds 78 new weapon models including arrows, and integrates them into the world&#33; Future versions will have quests, new creatures, and even it&#39;s own lore, so be sure to keep in tune with the mod&#33;\r<br />\r<br />&#34;The Chronicles of Steel - Skyrim&#34; is in short an extension, port, and continuation of Waalx&#39;s incredible mod: Waalx Animals and Creatures (WAC). Thanks to the very kind permission of my friend, Waalx, I have been given freedom to port his self-created models from WAC, into Skyrim. \r<br />\r<br />This release is the first of a long set, starting with the Realswords Modules, and adding more along the way as I learn about 3D Modeling. \r<br />\r<br />Please don&#39;t forget to Endorse&#33;&#33;\r<br />\r<br />NOTE: PLEASE, UNDER NO CIRCUMSTANCES HOST THIS ON STEAM WORKSHOP OR ANYWHERE ELSE OTHER THAN SKYRIM NEXUS. IF I DECIDE TO PLACE THIS ELSEWHERE I WILL DO SO MYSELF. THANK YOU&#33;\r<br />\r<br />[center] Video of the Mod here&#33; Thanks to SaioTV for the review&#33; [/center]\r<br />[center] [youtube]egOwrp_0koo[/youtube] [/center]\r<br />\r<br />[center][img]http://i.imgur.com/xNE7l.png[/img][/center]\r<br />\r<br />[img]http://i.imgur.com/1q6SG.png[/img]\r<br />\r<br />\r<br />Two hundred years have passed since the horrors of the Oblivion crisis were unleashed upon Tamriel. The invasion was thwarted at its darkest hour by the self sacrifice of a holy man, the unknown son of an assassinated king. This man summoned into his flesh and spirit the avatar of the dragon god Akatosh. Bathed in wings of golden fire and roaring in righteous anger he banished the Daedra back to the Planes of Oblivion.\r<br />\r<br />Histories were written and bards told the tales wherever any would listen. But memories fade as generations pass, especially among the common folk. \r<br />\r<br />Now... after many years of unrest, war has come again to Tamriel...\r<br />\r<br />\r<br />In the cold and harsh lands North of Cyrodiil, in the Province of Skyrim, the Nords and Imperial Legions do battle for sovereignty over the seat of the High King. The sons and daughters of Skyrim now take up arms against the occupying forces of the Imperials, in a civil war that could break the strength and resolve of Skyrim&#39;s people. Blood flows freely, the ringing and clashing of steel disturbs the peace even as birds sing at dawn, and suffering returns to the land.\r<br />\r<br />The soil of Skyrim is now moist with the blood of soldiers, and the tears of grieving mothers, as death stalks their children with a savagery that must end in either freedom for the Nords, the rightful citizens of Skyrim, or continued existence beneath the yoke of Imperial rule. Even worse, legends of old have bring forth another most dire threat...but that is a story for another time.\r<br />\r<br />One chill morning near the outbreak of this war, and unknown to any who would care, a young Redguard set foot upon these frozen and war torn lands. He carried with him the tools of his trade and little else, for he had few needs other than knowledge. Besides a well crafted warm cloak, lined with fur to keep him warm through the frigid nights, some food, and ale, which he preferred to mead, his most precious possessions were a number of antique and mysterious tomes. He kept them wrapped in soft, dry cloth at the bottom of a burlap sack, hidden in the folds of his cloak from the sight of would be thieves. At his side he carried a much trusted blade, The Curved Dagger, a weapon forged by a distant ancestor of his race.\r<br />\r<br />Sheltered from the wind in a small rocky outcrop and wrapped in his heavy cloak, the novice smith opened the sack, unwrapped the cloth, and by the light of his flickering bonfire selected an old, yet well cared for leather tome. He read until he fell asleep, dreaming of a time long past.\r<br />\r<br />Each of the volumes he carried detailed the schematics of ancient blacksmith arts long forgotten in the distant threads of time. The books speak of a &#34;Green Wanderer&#34;: A legendary Aylied-Elf named Waalx who traveled the world, learning and mastering the smithing arts of all of the races of Tamriel... It&#39;s a fanciful, and perhaps crazy tale, but to this young Redguard the story was great enough to inspire him and ultimately become his greatest ambition. After all, what better opportunity than a war to practice his art and one day become a master smith like his ancient mentor?\r<br />\r<br />During those early days of the war when it was still possible to pass freely through the Cyrodiil-Skyrim border, the Redguard stopped to survey the open, unknown land ahead of him. He took a long deep breath of anticipation and a little uncertainty considering the possible dangers he may face. After a few moments, satisfied with his final decision, in plumes of misty breath he exhaled loudly and declared to the empty landscape ahead....\r<br />\r<br />&#34;Well...if I&#39;m to make my fortune, and become a worthy smith, I surely can&#39;t linger here, eh? The war might be over before I know it&#33;&#34;\r<br />\r<br />Thus, with a spring in his step he set off in search of others smiths whom he would apprentice himself to, in order to bring the ancient lore of the master smith Waalx back to the world... \r<br />\r<br />And thus the second coming of The Chronicles of Steel began...\r<br />\r<br />.\r<br />.\r<br />.\r<br />\r<br />However, there was one tome he would not share: a book with schematics for a number of special weapons... For those, he needed his own forge, one that burned with the hottest coals, and the accumulated knowledge of the artisans of Skyrim. \r<br />\r<br />And time....\r<br />\r<br />[center][img]http://i.imgur.com/2U76u.png[/img][/center]\r<br />\r<br />[img]http://i.imgur.com/4Wnvt.png[/img]\r<br />\r<br />In this module I&#39;ve released Realswords Nord originally made by Waalx. It features over 75 brand new weapon models and textures, each with their own unique feel. \r<br />\r<br />You can purchase New Versions of the weapons from either Eorland Gray-Mane or Adrienne Avennichi in Whiterun. \r<br />\r<br />If you can&#39;t afford the new versions of the weapons, you can find Worn and Old versions of the weapons in your travels. \r<br />\r<br />They have been distributed amongst many of the NPCs in the game such as Bandits, Stormcloaks, Draugr, Jarls and more. \r<br />\r<br />Hopefully, the weapons will mesh well with the world and be a welcome addition to your adventures :).\r<br />\r<br />[center][img]http://i.imgur.com/AJ1QX.png[/img][/center]\r<br />\r<br />[img]http://i.imgur.com/h8SV9.png[/img]\r<br />\r<br />- All One Handed Axes, Swords, Daggers, Claymores, Pole-Axes, and Bows Added To The Game.\r<br />- Most weapons have Steel and Bronze Hilt Variations.\r<br />- All weapons have Worn, and Old Variations, each with different stats and abilities.\r<br />- Some weapons Have Fine Variations, which exceed normal versions in most aspects.\r<br />- The Nord Scorch Bow and Nord Blizzard Bow are Enchanted and Glow in the Dark&#33;\r<br />- These make a total of 75 weapons added in the game.\r<br />- All weapons have custom Blood Shader UV Maps For Every Weapon Type (done by me). This allows for interesting blood effects unique to each weapon type.\r<br />- All of the Nord Arrows from RS Nord Added to the Game.\r<br />- All Weapons And Ammo Added to Appropriate Levelled Lists for the Stormcloaks and Stormcloak Commanders, further diversifying that Faction.\r<br />- Weapons And Ammo are also added to Bandits, Draugr, Jarls, Guards, Hunters, and various spots in the world. Look around and see if you can find them&#33;\r<br />- All weapons can be sharpened at the grindstone. None, however can be forged at the smith. You have to adventure out to find them, or purchase new ones from the smiths.\r<br />- Steel Hilt Weapons are Lighter (Less weight = Less Stamina Cost for Power Attacks) And Slightly Faster than Their Bronze Hilt Counterparts, but do less damage. Steel hilt Weapons will be best for people who like fast, light attacks.\r<br />- Bronze Hilt Weapons are Slightly Heavier (More Weight = More Stamina Cost for Power Attacks) And Slightly Slower than the Steel Hilt, but do a bit more Normal and Critical Damage than Steel Hilt weapons. Bronze Hilt weapons will be best for people who like slower but heavy damage attacks.\r<br />- The Daggers Are Weaker than Most Vanilla Daggers, but their Critical Damage is Equal to or up to 30% higher than their base damage. Basically, the Criticals with these Daggers hurt, and will benefit dual wield dagger types quite a bit.\r<br />\r<br />  \r<br />My hope with these new features is to give each weapon a unique feel based on your own play-style. Also, this will make NPCs feel a bit more diverse when they wield a Realswords Blade.\r<br />\r<br />[center][img]http://i.imgur.com/w1PDI.png[/img][/center]\r<br />[img]http://i.imgur.com/9fFgq.png[/img]\r<br />\r<br />- Nord Race Specific Bonus (Need to learn the new scripting language).\r<br />- In real life, Steel is lighter than Bronze, but stronger. Since some weapons have steel hilts: Steel Hilt weapons will give a small bonus to Blocking Skill, while Bronze Hilts will give One or Two Handed Skill Bonuses.\r<br />- A custom forge for the weapons.\r<br />- Weapons deteriorate over time.\r<br />- If you give Old Weapons/Worn Weapons and some materials and gold, to a &#34;certain NPC&#34;, you will be allowed to make those weapons new again&#33;\r<br />- Adding vanilla style hooks onto all weapon scabbards so they dont float at the side.\r<br />- Certain Weapons Added As Quest Rewards.\r<br />- New Lore friendly Helmets for the Stormcloak Army.\r<br />\r<br />[center][img]http://i.imgur.com/nuo9A.png[/img][/center]\r<br />\r<br />[img]http://i.imgur.com/2a1jl.png[/img]\r<br />\r<br />1) Extract the Archive Into Your Data Folder or install using NMM or Wrye Bash.\r<br />2) For Wrye Bash, just paste the zip into your &#34;Bash Installers&#34; folder, and right click the \r<br />zip, and click &#34;install&#34;.\r<br />3) If you have other mods that alter in game Leveled Lists, be sure to use Wrye Bash to merge your Leveled Lists together. \r<br />\r<br />[center][img]http://i.imgur.com/tYzVi.png[/img][/center]\r<br />\r<br />[img]http://i.imgur.com/X98Za.png[/img]\r<br />\r<br />1) Uninstall using NMM or Wrye Bash.\r<br />2) If you installed it manually, delete these files: &#34;TCOSS.esp&#34;, &#34;Data/textures/Realswords&#34;, &#34;Data/meshes/Realswords&#34;.\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/dXos6.png[/img][/center]\r<br />\r<br />[img]http://i.imgur.com/AFaJo.png[/img]\r<br />\r<br />1) Weapons Float at the Side. Will Fix this soon.\r<br />2) Damage may be a bit high, please let me know if its too high.\r<br />3) Some weapon hilts in third person don&#39;t line up correctly. I currently don&#39;t know how to fix this. If someone knows what value controls the third person positioning of weapons, please let me know&#33;\r<br />4) Some weapons are not uniform in positioning in the inventory. Also, unsure how to fix at present. If you know, let me know&#33;\r<br />5) Some weapons might not show on an already started game for NPCs you have already met. I&#39;m trying to get a script to fix this but haven&#39;t been able to make anything just yet. Please be patient&#33;\r<br />\r<br />If you see any NPC weirdness, just click them and type &#39;resetinventory&#39;. Best solution for now.\r<br />\r<br />[center][img]http://i.imgur.com/H3GpG.png[/img][/center]\r<br />\r<br />[img]http://i.imgur.com/PxQZ5.png[/img]\r<br />\r<br />- Waalx for all his incredible models and textures and being a good friend. Without him this mod wouldn&#39;t be possible&#33;\r<br />- Maigrets for working on the story&#33; Thanks so much&#33;\r<br />- Members on the Bethsoft and Waalx forums who beta tested the mod&#33; All of you really helped a ton&#33;\r<br />- Bethesda, for making this great game&#33;\r<br />- Skyrim Nexus for also Hosting this mod&#33;\r<br />\r<br />==========\r<br />References (Waalx&#39;s Notes)\r<br />==========\r<br />\r<br />Atmorian Crown: based on archeological photograph. \r<br />Gramr: No reference (creation). Gramr mean &#39;fierce&#39;.\r<br />Warp: Made from a fuzzy internet reference with no link to origin.\r<br />Beserker: Peter Johnsson, from historical research. Albion Armorer. I made it a patern-welded blade.\r<br />Norland: Made from a fuzzy internet reference with no link to origin.\r<br />Gotland: Peter Johnsson, from historical research. Albion Armorer. I made it a patern-welded blade and deco.\r<br />Cawood: I modeled that one from an archeological photograph, and also looked at the work of Andy Davis and David Delagardelle of Mad-Dwarf Workshop.\r<br />Naegling: Based on a painting for Thorgal #7, L&#39;enfant des Étoiles by Grzegorz Rosinski. (Thorgal is my favorite comic book&#33;) Naegling mean &#39;Hole-maker&#39;.\r<br />Broadedge & Broadpoignard: No reference (creation).\r<br />Poignard: No reference (creation).\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/1mCe8.png[/img][/center]\r<br />\r<br />[img]http://i.imgur.com/iEGyi.png[/img]\r<br />\r<br />- Realswords and WAC are creations made by Waalx with their own copyrights and permissions, see below. \r<br />- I explicitly asked for permission to do this port, so if you would like to ask permission of Waalx for anything he has created. Please contact him on his forum at http://waalx.com/RealSwordsForum/index.php.\r<br />- If you make some derivation of this work as applicable in Waalx&#39;s permissions, but based on this port, please contact me first&#33; I&#39;m &#34;Shingouki2002&#34; on the Skyrim Nexus. If okayed, please credit both Waalx and myself and provide a link to download this mod here&#33; Thanks&#33;\r<br />\r<br />[center][img]http://i.imgur.com/NjWsv.png[/img][/center]\r<br />\r<br />[img]http://i.imgur.com/e36x6.png[/img]\r<br />v1.0 -  Release\r<br />\r<br />&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;\r<br />\r<br />------------------------\r<br />Waalx&#39;s original Readme is located below:\r<br />\r<br />============\r<br />Readme\r<br />============\r<br />The Nord module features an assortment of swords, axes, bows and arrows that can be wielded by any race, but the Nords get a bonus&#33;\r<br />\r<br />This module feature a difference to the previous RealSwords release, where I&#39;m getting closer to my initial idea. RealSwords Nord introduce a new weapon system based on the weapon \r<br />quality. For each types of weapons you get 3 variations based on 2 differents models and 2 differents textures.\r<br />\r<br />- New : those are new, so they are rare. In RS Nord they can only be bought at the store. Even in NPC versions you will not see them other than in the store.\r<br />- Worn : those are the common weapons that have been used. They use a different model based on the New version, they all have dents and appear to have been in use as it should be.\r<br />- Old : those are less common and can be found usually on Undead and on bad guys sometimes. They use the Worn model and the Old textures. You should find the Old versions on Nords Bandits/Marauders sometimes in RealSwords Nord. \r<br />\r<br />However, RealSwords doesn&#39;t deal with monsters/undead, so this is for Waalx Animals and Creatures (WAC), and FCOM. Remember RealSwords is a preview? Remember that. The real RealSwords thing with all the races, the 12th module that is named \r<br />The Chronicles of Steel has begun, and is now a part of WAC.\r<br />\r<br />============\r<br />Weapon Bonus\r<br />============\r<br />\r<br />The weapons give bonus abilities if used by the race of it&#39;s origin.\r<br />\r<br />It fortify the blade attribute by 5, the agility by 5, and ease the wearer fatigue by 10. It doesn&#39;t add more damage, it act more like a &#34;feel natural&#34; bonus. This bonus stay the same for the four esp.\r<br />The bows bonus fortify the marksman attribute by 5 instead of the blade...but the two other bonus are the same.\r<br />The axes will give the user a blunt bonus.\r<br />\r<br />They are powerful, and they are expensive, yet less than they were in previous RS mods..\r<br />\r<br />==========\r<br />Permission\r<br />==========\r<br />©2009 RealSwords and related material are copyrighted work of Alex Brisson aka waalx. All models and textures are freely distributed to be used in the game Elder Scroll IV: Oblivion only. NO OTHER USES OF THE MODELS AND TEXTURES ARE PERMITTED. \r<br />\r<br />While I deliver these swords to the public domain via this mod, most of them have been designed and created by smiths in the real world. Those artist have their own copyright, and I didn&#39;t recreate their design to have them stolen for commercial purpose, \r<br />let alone the commercial use of my models. So, as long as you use these models for your own enjoyment and don&#39;t try to make any commercial attempt with them, it&#39;s good.\r<br />\r<br />That mean you CAN use them in your own mods if you want. You can retexture them pink with blue spots and make them glow green if you want (please&#33; if you do something like this don&#39;t show me ok?). \r<br />But if you do something cool with them, in your mod, or a retexture that kick ass..show me, I&#39;m interested to see.\r<br />I would also appreciate a lot if you could give me credit if you are using them in your own things.\r<br />\r<br />Thanks, love, and see you in the next pack...\r<br />waalx\r<br />\r<br />Visit my forum at index.php for more information about the progress on the upcoming other modules.And please register to show you support my work&#33;\r<br />\r<br />\r<br />Special \r<br />==============\r<br />To you all who support my work on the Workshop...Cheers&#33; \r<br />And to the team at Bethesda for their great game&#33;\r<br />\r<br />-----------------------------------------------------------------------\r<br />\r<br />©2009 RealSwords and related material are copyrighted work of Alex Brisson aka waalx. All models and textures are freely distributed to be used in the game Elder Scroll IV: Oblivion only. NO OTHER USES OF THE MODELS AND TEXTURES ARE PERMITTED.",
  "categoryId": "55",
  "version": "1.0",
  "author": "Waalx and ShinGouki",
  "createdUnix": "1331301530",
  "updatedUnix": "1331317172",
  "containsAdultContent": false,
  "uploadedBy": "shingouki2002",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41729",
      "name": "The Chronicles of Steel - Skyrim",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "45525",
      "fileName": "The Chronicles of Steel - Skyrim-12506-1-0.rar",
      "uploadedUnix": "1331317172",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d14982e1729dc3336b0394c17a46fc792c28041b8d0ad8463dc416f03d40982b/analysis/1406739987/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Chronicles%20of%20Steel%20-%20Skyrim-12506-1-0.rar?fid=41729&ttl=1535774452&ri=8192&rs=8192&setec=2f70f39c7889b594ac54026c3c4714fd"
    }
  ]
}