{
  "modId": 12513.0,
  "modName": "Katixas Usable Barrels",
  "summary": "Makes almost all barrels usable and functional, allowing you to fill a bottle of alcohol",
  "descriptionHtml": "[b]DESCRIPTION[/b]\r\n------------------------------------\r\nThis mod makes almost all barrels around the world usable (inns, dungeons, forts, etc.)\r\n\r\nThey can contain any of the following:\r\n- Nord mead\r\n- Wine\r\n- Honningbrew mead\r\n- Black-briar mead\r\n- Black-briar private reserve mead\r\n- Empty!\r\n\r\nPlease report any issues you find (wrong names, notifications, non-working barrels, etc.).\r\nThanks!\r\n\r\nHave fun!\r\n\r\n[b]HOW TO USE[/b]:\r\n------------------------------------\r\nThis mod can be configured to work in one of these two ways:\r\n\r\n1- One empty bottle type for every barrel type: This means that any beverage consumed will return always the same type of empty bottle. You will be able to use this bottle on any type of barrel (mead, honningbrew, wine, etc.). The item created will depend on the barrel used (a honningbrew bottle if used a honningbrew barrel, and so on).\r\n\r\n2- Empty bottle type matching barrel type: This means that when you drink a Honningbrew mead, you will get an empty honningbrew mead bottle, that you will be able to use only with honningbrew mead barrels. This applies to all liquids. This is the \\\"realistic\\\" mode, because you see the same model in the inventory, and also you can only use a \\\"black-briar\\\" mead barrel if you are carrying an \\\"empty black-briar\\\" mead bottle.\r\n\r\nThe default option is one bottle for everything. You can change this setting using the contract book found at almost every Inn. Using this book will allow you to \\\"sign\\\" a new agreement on how to use these barrels.\r\n\r\nEvery bottle used will return empty to your inventory. Depending on the \\\"contract\\\" chosen, it will be the same bottle as consumed, or it will be just a standard empty bottle.\r\n\r\nEmpty bottles weight 0.1. You can get empty bottles by consuming existing filled bottles, or just buying one from the crate available at most Inns (1 gold piece). If you chose to play in the realistic mode (each barrel type needs the same bottle type), you can choose the bottle you want. Else you just get the default empty bottle, usable on any barrel.\r\n\r\nBarrels at Inns are pay-to-use. All other barrels at homes, dungeons, etc. are free to use. Is up to you if you want to \\\"steal\\\" a drink from someone\\'s house, or just let it be if you think it\\'s wrong.\r\n\r\n[b]THIEF?[/b]\r\n------------------------------------\r\nIf you Sneak you can steal the empty bottles at inns, and also fill the bottle for free. If you do it without sneaking you will pay if required. There is no control on this so you won\\'t get any bounty. It\\'s just for roleplaying purposes: steal it, or be a good citizen and pay.\r\n\r\n[b]COMPATIBILITY:[/b]\r\n------------------------------------\r\nShould be compatible with any mod that uses game\\'s default items. Anyway, if you experience issues (like an effect from another mod not being triggered, for example drunk, thirst, etc.), you may need to change mod load order. In some cases mods create their own specific items, therefore compatibility is not possible. This mod uses the game\\'s default drinks, so if you have a mod using those same items, this should be 100% compatible.\r\n\r\n[b]CHANGELOG:[/b]\r\n------------------------------------\r\nClick the version number to see the log.\r\n\r\n[b]Steam Workshop Link[/b]\r\n------------------------------------\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=13677\r\n\r\nThis mod was featured in the Skyrim Mods Series #29, by Saiodin (thanks!). You can check the video here:\r\n\r\n[youtube]R5WNMNxkeBY[/youtube]",
  "categoryId": "78",
  "version": "2.0.1a",
  "author": "Katixa",
  "createdUnix": "1331314019",
  "updatedUnix": "1340736137",
  "containsAdultContent": false,
  "uploadedBy": "katixa",
  "primaryFile": null,
  "files": [
    {
      "fileId": "45144",
      "name": "Katixas Usable Barrels OLD",
      "version": "1.3.0a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "96",
      "fileName": "Katixas Usable Barrels OLD-12513.7z",
      "uploadedUnix": "1332268049",
      "modVersion": "1.3.0a",
      "virusScanUrl": "https://www.virustotal.com/file/6a97a3fc390534ce8b98a562ef99cc5ba0709af41e0b693faa9b1688a1ed1d75/analysis/1406769971/",
      "changelogHtml": " Just a quick-fix for a bug that created an empty bottle with any food item consumed (thanks Casanova for reporting!) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Katixas%20Usable%20Barrels%20OLD-12513.7z?fid=45144&ttl=1535774465&ri=8192&rs=8192&setec=6d0284d849246f11d5a4ddc8b2610ebc"
    },
    {
      "fileId": "54063",
      "name": "Katixas Usable Barrels 2_0_1",
      "version": "2.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "98",
      "fileName": "Katixas Usable Barrels-12513-2-0-1.7z",
      "uploadedUnix": "1334694247",
      "modVersion": "2.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/857e4349bedee366dc02a5229864fda784318217af6a16f3629e56ef2c84007c/analysis/1406820607/",
      "changelogHtml": " Fixed bug created by 2.0 update. Bottle crates work again (if you choose different bottles agreement, you are prompted with a menu to choose bottle type). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Katixas%20Usable%20Barrels-12513-2-0-1.7z?fid=54063&ttl=1535774466&ri=8192&rs=8192&setec=b3d74a1cfae238f21b2d9222481619ba"
    },
    {
      "fileId": "70450",
      "name": "Katixas Usable Barrels",
      "version": "2.0.1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "100",
      "fileName": "Katixas Usable Barrels-12513-2-0-1a.7z",
      "uploadedUnix": "1340736137",
      "modVersion": "2.0.1a",
      "virusScanUrl": "https://www.virustotal.com/file/e68967cd66c09c496eb60fee6247aafb3e16d94b30fff13c0f7df58ce0f10737/analysis/1406984584/",
      "changelogHtml": " Temporary fix to lessen the impact of the 1.6 patch, which broke some parts of this mod. Still trying to fix it 100%. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Katixas%20Usable%20Barrels-12513-2-0-1a.7z?fid=70450&ttl=1535774466&ri=8192&rs=8192&setec=bdcbcbd40eed215a8254f34e47861269"
    }
  ]
}