{
  "modId": 12525.0,
  "modName": "DYNAVISION - Dynamic Depth of Field",
  "summary": "DYNAVISION provides a dynamic depth-of-field and auto-focus effect similar to a camera.  ",
  "descriptionHtml": "[color=cyan]Update version 2.2[/color] \r<br />1. Switch Dynamic DoF off when riding. Static DoF will remain if set.\r<br />2. Added the option to have a different strength Dynamic DoF when talking to someone. This allows you to have a subtle DoF while playing, but much stronger when talking to someone. Or vice versa.\r<br />\r<br />[img]http://www.mgenyc.com/modsskyrim/DynavisionSkyrim_splash01.png[/img]\r<br />[img]http://www.mgenyc.com/modsskyrim/DynavisionSkyrim_splash02.png[/img]\r<br />\r<br />[img]http://www.mgenyc.com/modsskyrim/DYNAVISION_sub_whatis.png[/img]\r<br />\r<br />[b]DYNAVISION[/b] provides a dynamic depth-of-field and auto-focus effect similar to a camera.  \r<br />\r<br />In other words, when you&#39;re close to something and looking right at it, the subject stays in focus while the background blurs.\r<br />\r<br />[color=#fdba00][b]DYNAVISION OPTIONS[/b][/color]\r<br />\r<br />You may adjust DYNAVISION as you like, in-game using the MCM system that comes with SkyUI 3 or later.\r<br />\r<br />Currently available features are:\r<br />\r<br />[color=#fdba00][b]&gt; DYNAVISION ACTIVATION[/b][/color]\r<br />\r<br />DYNAVISION can be ACTIVATED or DEACTIVATED in-game&#33;\r<br />\r<br />The DYNAVISION effect can be changed depending upon whether you are RUNNING, in COMBAT and in INTERIORS all from the ADVANCED menu.\r<br />\r<br />[color=#fdba00][b]&gt; DYNAVISION EFFECT STRENGTH[/b][/color]\r<br />\r<br />Increases or decreases the overall DYNAVISION blur.\r<br />\r<br />[color=#fdba00][b]&gt; DYNAVISION SHIFT SPEED[/b][/color]\r<br />\r<br />Adjust the speed at which DYNAVISION shifts focus.\r<br />\r<br />[img]http://www.mgenyc.com/modsskyrim/DYNAVISION_sub_inaction.png[/img]\r<br />\r<br />[youtube]gyYLb_aqj68[/youtube]\r<br />\r<br />[img]http://www.mgenyc.com/modsskyrim/DYNAVISION_sub_subject.png[/img]\r<br />\r<br />What you&#39;re looking at would be considered the [b]SUBJECT[/b].\r<br />\r<br />For the purposes of this mod, the SUBJECT is considered to be what&#39;s directly under your CROSSHAIR - or, what&#39;s dead-center on your screen.\r<br />\r<br />[img]http://www.mgenyc.com/modsskyrim/DYNAVISION_sub_similartocamera.png[/img]\r<br />\r<br />Yes.  Similar.\r<br />\r<br />Tell you why, but I&#39;m going to keep it to what some might call a major oversimplification.\r<br />\r<br />The human eye doesn&#39;t really use Depth-of-Field (DOF) unless you put your thumb VERY close to your eyes.  And that&#39;s more a function of the subject (your thumb) being out of your focal range than the eye&#39;s ability to use cinematic DOF.\r<br />\r<br />The human eye is designed to focus on a very, very small area, which is why you have to move your eyes and head to follow the ball during a tennis match.\r<br />\r<br />DOF is typically created by a camera lens.  It&#39;s a cinematic solution that is typically employed to emphasize the subject.\r<br />\r<br />Without going into a 20 page discussion about lenses, apereture, focal-length and the like, it&#39;s easy enough to state that DYNAVISION is a pleasant bastardization of a much beloved camera effect. \r<br />\r<br />DOF doesn&#39;t necessarily change with camera-operator movement, but DYNAVISION is 100% determined by distance from the subject and whether you&#39;re looking at it.  \r<br />\r<br />It&#39;s an inaccurate analogy for purists, but for us, it&#39;ll have to do - and it&#39;s really cool.\r<br />\r<br />If you want more detailed information about DEPTH-OF-FIELD, hit [url=http://en.wikipedia.org/wiki/Depth_of_field]WIKIPEDIA[/url]\r<br />\r<br />[img]http://www.mgenyc.com/modsskyrim/DYNAVISION_sub_whatdoesitdo.png[/img]\r<br />\r<br />Well, it simulates AUTO-FOCUS and DOF based on your relative position to your subject and whether or not you&#39;re looking directly at your subject.\r<br />\r<br />For instance, when you crouch beside a rock and look at the rock, the landscape behind that rock will go out-of-focus.  However, when you look at the landscape while still crouched behind the rock, the landscape will come into focus and the rock (depending on where you&#39;re looking) will go out of focus.\r<br />\r<br />To be 100% honest with you, I can try to describe it for days but you&#39;ll get the idea faster by trying it out - or looking at the screenshots.\r<br />\r<br />It&#39;s been called DYNAMIC DEPTH-OF-FIELD and that&#39;s about as good a description as any.\r<br />\r<br />[color=#fdba00][b]DYNAMIC DEPTH OF FIELD[/b][/color]\r<br />\r<br />Dynamic Depth-Of-Field differs from what you think of as the &#39;usual&#39; in-game depth-of-field in that the effect is based on your distance to your subject.\r<br />\r<br />Most other DOF mods are just blurring the deep-background.  It can be loosely considered to be a fixed-focal-length and it&#39;s okay, but it&#39;s not for me.\r<br />\r<br />[color=#fdba00][b]I UNDERSTAND THE WORD DYNAMIC, BUT WHY USE IT HERE?[/b][/color]\r<br />\r<br />dynamic: \r<br />\r<br />- Relating to energy or to objects in motion. Compare static.\r<br />\r<br />- Characterized by continuous change or activity.\r<br />\r<br /> \r<br />[img]http://www.mgenyc.com/modsskyrim/DYNAVISION_sub_using.png[/img]\r<br />\r<br />IMPORTANT: Make sure you have not switched DoF off in your ini file. If you don&#39;t see any effect, open you Skyrimprefs.ini and look for &#39;bDoDepthOfField&#39;. Make sure it is set to 1. ie.\r<br />\r<br />bDoDepthOfField=1\r<br />\r<br />It&#39;s easy&#33;  Install and activate the mod as you would any other.\r<br />\r<br />Ta-DA&#33;\r<br />\r<br />To uninstall just go to the MCM menu and select OFF for the Depth of Field. Wait a few seconds, save your game. This makes sure all the scripts terminate. Then quit and uninstall. Not doing this will not affect you game in any way but will leave a script in your save that does nothing. It is small and harmless, but if you deactivate the mod first it means your save will be a few bytes smaller :)\r<br />\r<br />[b]PLEASE NOTE: DYNAVISION will work with most ENB configuations, however if you are using ENB, remember to turn OFF the ENB DOF feature or you will very likely experience odd visual results and grind your system to a halt.  Otherwise, it&#39;ll work fine.  We can&#39;t account for every configuration of every ENB variation, so you may experience odd results depending on what you&#39;ve got going on.[/b]\r<br />\r<br />[img]http://www.mgenyc.com/modsskyrim/DYNAVISION_sub_history.png[/img]\r<br />\r<br />GOPHER and MYGOODEYE got together way back in our FALLOUT : NEW VEGAS days, where DYNAVISION was first introduced.\r<br />\r<br />GOPHER loves making screenshots and videos and literally as soon as the CREATION KIT was released, he dove straight into bringing DYNAVISION to SKYRIM.\r<br />\r<br />DYNAVISION for SKYRIM is a complete ground-up overhaul with entirely new code and optics.  \r<br />\r<br />What&#39;s especially nice about it is that it&#39;s done with the game engine and therefore demands far less of your graphics card than ENB does with similar visual results.\r<br />\r<br />As you approach your subject, the DOF effect seems natural.  The closer you get to the subject, the more the background goes out of focus.  \r<br />\r<br />When you look into the middle distance, there is no DOF effect (as in &#39;real-camera-life&#39;) so walking down the highway isn&#39;t a disorienting blur.  \r<br />\r<br />When you stare off into the deep-background, the immediate foreground will go slightly out of focus.  \r<br />\r<br />All as if you were playing the game through a decent 35MM lens - with a really good Assistant Cameraman (ha&#33;  film joke).\r<br />\r<br />It would be a damn lie if we said this was a perfect replica of a 35MM camera auto-focus.  It&#39;s not, but it&#39;s really good.\r<br />\r<br />However, that said, when playing the game and not just staring at the effects to see how it goes, we think you&#39;ll find it a great addition.\r<br />\r<br />- Gopher & MyGoodEye",
  "categoryId": "62",
  "version": "2.2",
  "author": "Gopher and MyGoodEye",
  "createdUnix": "1331323960",
  "updatedUnix": "1359063360",
  "containsAdultContent": false,
  "uploadedBy": "Gopher",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000004637",
      "name": "DYNAVISION Dynamic Depth of Field v 2_2",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18",
      "fileName": "DYNAVISION Dynamic Depth of Field v 2_2-12525-2-2.rar",
      "uploadedUnix": "1359063360",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/e85b7417f933461c162cd172754f2fc2e09127a5c0294e0e694348528cda236d/analysis/1407376995/",
      "changelogHtml": " Switch Dynamic DoF off when riding. Static DoF will remain if set. <br/> \n Added the option to have a different strength Dynamic DoF when talking to someone. This allows you to have a subtle DoF while playing, but much stronger when talking to someone. Or vice versa. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DYNAVISION%20Dynamic%20Depth%20of%20Field%20v%202_2-12525-2-2.rar?fid=1000004637&ttl=1535774486&ri=8192&rs=8192&setec=eedd00e51e02333ddec2d7a4337059e1"
    }
  ]
}