{
  "modId": 12538.0,
  "modName": "Creation Kit Tutorial - Creating a fully custom race",
  "summary": "A in-depth step-by-step guide on how to create a custom race that uses its own assets.",
  "descriptionHtml": "[center][img]http://70.38.64.76/f/1/8e3605b1-b140-44a7-b004-f0f0e09ff1b6.jpg[/img][/center]\r\n\r\n[font=georgia]Requirements: [list][*] The Elder Scrolls V: Skyrim (Patch 1.8 or up recommended)\r\n\t[*] [url=http://skse.silverlock.org]SKSE (The latest version)[/url]\r\n\t[*] [url=http://skyrim.nexusmods.com/mods/24168]RaceCompatibility for Skyrim and Dawnguard[/url]\r\n\t[*] [url=http://skyrim.nexusmods.com/mods/30411/]Ningheim Brows package[/url][/list][/font]\r\n\r\n[center][youtube]JrMEbTJxD7Y[/youtube] [youtube]ExdwTiU8pfM[/youtube][/center]\r\n\r\n[center][b][color=brown][font=Georgia]The Ningheim are a rare race of Nord or Nede who have been gifted by The Nine with otherworldly vision to serve as a physical connection between the realm of the spirits and that of the living. Ningheim usually grow up in secluded areas, with or without protectors. It is not known how a Ningheim Nede comes to existence or where they come from, but folk-lore tells each and every one of them is specially selected by The Nine. They share the same traits as regular Men, though they usually have a striking, almost other-wordly, beauty which is said to be caused by the good health they maintain through their powerful souls. From birth a Ningheim\\'s soul will change into what eventually become a tool to wield great power, as they are gifted with many abilities that are unfathomable by regular men over the course of their life. With the ability to look into another\\'s mind, and even their very souls, a Ningheim is always feared no matter if they are good, evil or anything in between. Their gaze alone can break the will of their foes, their magicka can command souls, and with their powerful will they can take on any obstacle.\r\n\r\nThese are the Ningheim. Powerful warriors sent from the heavens above, sporting both heavenly beauty and terrifying power. There is no set path for a Ningheim. Become one yourself and make your mark on the province of Skyrim and beyond![/font][/color][/b][/center]\r\n\r\n[center][size=4][b][color=firebrick][font=georgia]Vampires[/font][/color][/b][/size]\r\n[img]http://70.38.64.76/f/1/9b474360-fe77-43d5-889d-e4c7fe0b9f7c.jpg[/img]\r\n\r\n[b][color=brown][font=Georgia]The eyes are of a Ningheim are very precious. A Ningheim relies on his/her sight to perceive the world of the soul. Without eyesight they would lose much of their power. When a Ningheim\\'s eyesight is impaired, a strange process transforms the eyes to see directly with the soul. A Ningheim will thus never go truly blind, but they will lose their normal eyes if their eyes do get damaged. It has been said that when a Ningheim were to become a vampire their soul would reject the corporeal influence by transforming the eyes before they get tainted and they will retain their normal facial features.[/font][/color][/b][/center]\r\n\r\n[center][size=5][font=georgia][color=lavender][b]The race\\'s features[/b][/color][/font][/size][/center]\r\n\r\n[size=3][font=georgia][list][color=#669999]\r\n[*] [b]Works with the new Dragonborn DLC and every other official Skyrim DLC![/b]\r\n[*] Face and body textures by Hellosanta, Urshi with special updates and changes specially made for this race.\r\n[*] Exclusive alternative female face textures by m0ckin9bird for more character creation options.\r\n[*] Includes [b][u]56+[/u][/b] [b][i]new[/i][/b] eye types and [b][u]63[/u][/b] [b][i]new[/i][/b] highly-detailed eyebrows made by Hvergelmir from [url=http://skyrim.nexusmods.com/mods/30411/]Brows[/url] and Pikkatze from [url=http://skyrim.nexusmods.com/mods/1971]Smooth Faces for Ladies and Gents[/url].\r\n[*] 24 New warpaint types made by TairenSoul from [url=http://skyrim.nexusmods.com/mods/25211]TairenSoul Face Tattoo Warpaint[/url], exclusively for this race.\r\n[*] Custom complexions with 3 new HD Dirt options.\r\n[*] Comes with built-in [url=http://skyrim.nexusmods.com/mods/34346]Smile in HD[/url] by Zzjay.\r\n[*] All new head meshes and head morphs for a totally new and refreshing look never found before in a custom race up till now.\r\n[*] Fully stand-alone body meshes and skeletons for that extra bit of customization.\r\n[*] Of course full support for DG and non-DG Vampires and Werewolves. Vampires retain their normal facial features, and get special new eyes.\r\n[*] Original new powers only available to this race, such as the ability to teleport, the power to control souls, even the power to set your foe ablaze using their own soul and MORE.\r\n[*] Powers will be gained by leveling your character instead of gifted to you for simply choosing the race. It\\'ll keep the gameplay in balance for any player.\r\n[*] Features new followers to enrich the world with that fit in with the unique new story that has been made for your character.\r\n[*] This all is made available to you through an [u]easy installer[/u] for the ultimate ease of use.[/color][/list][/font][/size]\r\n\r\n[center][color=lavender][b]Featuring NEW warpaint for men and women, made by[/color] [color=teal]TairenSoul[/color][/b]\r\n[size=1][color=lavender]Click on the image to see the new warpaint that will be available to you for the men.[/color][/size]\r\n[url=http://70.38.64.76/f/1/01f1cfd8-c028-48a1-8755-1377a6331fd7.jpg][img]http://70.38.64.76/f/1/0252c933-f3c2-42b7-8397-8c9b91d39eb3.jpg[/img][/url]\r\n\r\n[size=1][color=lavender]Click on the image to see the new warpaint that will be available to you for the women.[/color][/size]\r\n[url=http://70.38.64.76/e/1/233d5adc-83b9-427f-8da6-86c636983ff1.jpg][img]http://70.38.64.76/e/1/92d401d1-ac74-422e-8ae5-ca0a124e996c.jpg[/img][/url][/center]\r\n\r\n[font=georgia][color=lavender][b]Base Stats:[/b]\r\n\r\n\tTwo-handed +10\r\n\tConjuration +5\r\n\tBlock +5\r\n\tRestoration +5\r\n\tArchery +5\r\n\tLight Armor +5\r\n\r\n\tTotal Skill Bonus = 35 (Just like vanilla races)\r\n\r\n[b]Race powers:[/b][/color]\r\n\r\n\t[color=brown][list][*] Spirit Control: The influence of your soul\\'s power can now twist the souls of the dead to fight for you. Turn undead into ally for 60 seconds. Type: Twice a day Power. Gained at level 8.\r\n\t[*] Ethereal Shift: The soul has developed and can sustain on its own. Enables a Ningheim to instantly transfer the soul to another place and rematerialize around it. Type: Lesser Power, will work for as long as you have the required magicka. Gained at level 10.\r\n\t[*] Soul-shattering Gaze: Increased reserves of spiritual energy can cripple your foe by showing a glimpse of your soul\\'s true power. Paralyze a foe for 10 seconds with a chance to paralyze all foes around if the target has less than 20% health. Type: Twice a day Power. Gained at level 15.\r\n\t[*] Watchful Eye of The Nine: Receive \\\"Divine Intervention\\\" of The Gods once your health drops below 20%. Type: Daily Power, [b][u]auto-equipped[/u][/b]. Press power-button (default=\\'Z\\') to use when you get the notification. Gained at level 20.\r\n\t[*] Soul Ignition: A Ningheim with an overwhelming amount of spiritual energy can become powerful enough to touch another\\'s soul and set it ablaze. Type: Twice a day Power. Gained at level 30.\r\n\t[*] Soul Shade: Ningheim have enormous might, which comes with great responsibility. Take the darkness from the soul and turn it into a powerful follower for 2 minutes. Type: Daily Power. Gained at level 35.[/list][/color][/font]\r\n\t\r\n[img]http://70.38.64.76/f/1/a211d542-e719-4082-9d3a-31c689247144.jpg[/img]\r\n[color=lavender][font=georgia][center][size=5][b]The new character customization options[/b][/size][/center]\r\n\r\n\t[b]Men[/b]\r\n\t\t[list][*] Mouth Forward = Lip Fullness\r\n\t\t[*] Jaw Forward = Nose Width\r\n\t\t[*] Eyebrow Forward = Eyebrow Angle[/list]\r\n\t\t\r\n\t[b]Women[/b]\r\n\t\t[list][*] Jaw Forward = Nose Width\r\n\t\t[*] Eye Depth = Eye Tilt[/list]\r\n\t\t\r\n[size=2][i]The original functionality of these sliders was always minimal, and with the new head shape your character\\'s head will not need them as they were. In return, you get very nice new options to create the character that you want.[/i][/size][/font][/color]\r\n\r\n[img]http://70.38.64.76/f/1/944e48ae-326b-4a8c-a883-6069b2085b93.jpg[/img]\r\n[color=lavender][center][font=georgia][b][size=5]Notes[/size][/b][/font][/center]\r\n\r\nIMPORTANT: \tUpon switching to The Ningheim race make sure it has loaded correctly by seeing if you can select all vanilla Nord hairstyles, and hairstyles from hair mods. If this isn\\'t the case, don\\'t continue and reload the game to select the race again.\r\n\t\t\t\tThis must work for the race to properly work well with vampire/werewolf transformations.\r\n\t\t\t\t\r\n\tIf you\\'re using RaceMenu by Expired then upon selecting a female preset it will always revert the Head Scale back to 1.0. This should be set to 1.1 so your characters don\\'t have small heads. Vanilla females have a head scale of 1.1 too.\r\n\t\r\n\tThe men have some \\\"empty\\\" nose/mouth morphs at the end of their slider. This is because the females have new nose and mouth morphs in those slots.\r\n\t\r\n\tYou\\'ll always have some odd eyes/eyebrows on the females, because they are vanilla eyes/eyebrows which have different meshes from The Ningheim\\'s. These couldn\\'t be removed from the race without breaking the mod.[/color]\r\n\t\r\n[img]http://70.38.64.76/f/1/2eafb93d-45ac-41d3-9bf7-7951d14cd998.jpg[/img]\r\n[color=lavender][center][font=georgia][b][size=5]Installation[/size][/b][/font][/center][/color]\r\n\r\n[color=red]Make sure you have the required mods as listed at the top of this page before beginning the installation of The Ningheim.[/color]\r\n\r\n[color=lavender]The mod comes with an easy-to-use Nexus Mod Manager(NMM) installer so you can set up the mod to your preferences. It has lots of options already, and more are sure to come!\r\nMake sure you have installed the Nexus Mod Manager([url=http://skyrim.nexusmods.com/mods/modmanager/]download link[/url]). After downloading the mod you will find it under the \\\"Mods\\\" tab at the top where it will be listed under \\\"Races, classes and birthsigns\\\".\r\nClick on \\\"Activate selected mod\\\" to begin the installation procedure. Enjoy!\r\n\r\nIt is also recommended to use SKSE to enable [i]high-resolution warpaint[/i]:\r\n1) Download and install Skyrim Script Extender (SKSE) (1.6.6 or later)\r\n2) Check the Data folder and create the SKSE folder if necessary\r\n3) Check the SKSE folder and create the SKSE.ini file if necessary\r\n4) Open SKSE.ini\r\n5) Add the following entry to the .ini file if necessary\r\n\r\n[Display]\r\niTintTextureResolution=2048\r\n\t\t\r\n[center][font=georgia][b][size=5]Uninstallation[/size][/b][/font][/center]\r\n\r\n\t[list][*]With NMM: go to the \\\"Mods\\\" tab and select this mod. Choose \\\"Deactivate Selected Mod\\\".\r\n\r\n\t[*]Manually: first disable the Ningheim.esp and remove the following folders from your skyrim/data folder:\r\n\t- skyrim/data/meshes/actors/character/Ningheim\r\n\t- skyrim/data/textures/actors/character/Ningheim\r\n\t- skyrim/data/sound\\\\fx\\\\Ningheim\r\n\t- in skyrim/data/scripts all the scripts which names start with \\\"Ningheim\\\".\r\n\t- Also delete \\\"The Ningheim.esp\\\" file in skyrim/data.[/list][/color]\r\n\t\r\n[img]http://70.38.64.76/f/1/16b5b5bb-5d43-44a0-bddb-b0f7abe9522f.jpg[/img]\r\n[color=lavender][center][font=georgia][b][size=5]Coming Soon[/size][/b][/font][/center]\r\n\r\n[list][*] 10 Brand-new followers placed throughout Skyrim\r\n[*] More body options[/list]\r\n\r\n[center][font=georgia][b][size=5]Future Ideas[/size][/b][/font][/center]\r\n\r\n[list][*] A special Ningheim-related event generator featuring shifts or glimpses into the world of spirits\r\n[*] Potential quests related to the Ningheim lore (If you are interested in helping with this, feel free to send me a PM!)[/list][/color]\r\n\t\r\n[img]http://70.38.64.76/f/1/cb738197-6aad-44e3-86b8-debf9fe9e2c0.jpg[/img]\r\n[color=lavender][center][font=georgia][b][size=5]Frequently Asked Questions[/size][/b][/font][/center]\r\n\r\n\t[b]Q: \tI can\\'t select all of the hair types/eyes/eyebrows/etc I\\'m supposed to get when I want to edit my character.[/b]\r\n\tA: \tFor some installations the race compatiblity script does not get activated properly. This can cause a multitude of bugs such as:\r\n\t\t[list][*] Vampire and/or Werewolf transformation not functioning correctly\r\n\t\t[*] No additional hair showing up\r\n\t\t[*] Missing parts of the head or the head itself\r\n\t\t[*] The fixed DB quest not working[/list]\r\n\r\n\t\tYou can usually fix these problems by opening your console in-game (tilde-button: ` ) and typing these two separate commands:\r\n\t\tstopquest OrientalRaceController\r\n\t\tstartquest OrientalRaceController\r\n\r\n\t\tThis is preferably done in an interior that has nothing to do with the DB quest that was fixed.\r\n\r\n\t[b]Q: \tWhere can I find the mod\\'s files (I want to change its files)?[/b]\r\n\tA: \tThe mod\\'s files can be found in the following folders:\r\n\t\t\t- skyrim/data/meshes/actors/character/Ningheim\r\n\t\t\t- skyrim/data/textures/actors/character/Ningheim\r\n\t\t\t- skyrim/data/sound\\\\fx\\\\Ningheim\r\n\t\t\t- in skyrim/data/scripts all the scripts which names start with \\\"Ningheim\\\".\r\n\t\t\r\n\t[b]Q: \tWhat mods are used in some of the screenshots?[/b]\r\n\tA: \tSome I don\\'t know and others I can\\'t share the link for. You\\'ll have to search yourself.\r\n\r\n\t[b]Q: \tI used the \\\"showracemenu\\\" command in the console to change my character to your race and I\\'m experiencing problems.[/b]\r\n\tA: \tDon\\'t use showracemenu and just make a new character. For example, it messes up your stats and it also makes the werewolf transition not work properly.\r\n\t\tThere is also a good alternative mod for the showracemenu command: http://skyrim.nexusmods.com/mods/20394 .\r\n\r\n\t[b]Q: \tI\\'m using a mod that adds armor/clothing/necklaces/rings and some of them don\\'t show up![/b]\r\n\tA: \tThat mod\\'s author probably did not include the Default Race to the list of races that can use his/her mod. Contact the author for a fix or do it yourself in the CK by going to Items->ArmorAddons and look for pieces that belong to the mod. Open such an item and on the right-hand you\\'ll have a list of valid races. Click the race called \\\"DefaultRace\\\", press OK and save.[/color]\r\n\t\r\n[img]http://70.38.64.76/f/1/7a5f23e7-6827-4042-a285-28d0ceb697f7.jpg[/img]\r\n[color=lavender][center][font=georgia][b][size=5]Credits[/size][/b][/font][/center]\r\n\r\nMy thanks go out to:\r\n\t[list][*] Bethesda Softworks for Skyrim and the Creation Kit\r\n\t[*] Hellosanta for the female textures from [url=http://skyrim.nexusmods.com/mods/35267/]\\\"SG Female Texture Pack\\\"[/url]\r\n\t[*] Urshi for his amazing and friendly help in building the male side of the mod, and for the male textures from [url=http://skyrim.nexusmods.com/mods/27815]\\\"Fine Face Textures\\\"[/url] and the body and textures from [url=http://skyrim.nexusmods.com/mods/26145]\\\"Smooth male body normal map - Better Males Sundracon meshes\\\"[/url]\r\n\t[*] M0ckin9bird, Zzjay, Navetsea, and Maeven for the Ningheim Alternative Female Face Texture\r\n\t[*] Pikkatze for male and female eyebrows from [url=http://skyrim.nexusmods.com/mods/1971]\\\"Smooth Faces for Ladies and Gents\\\"[/url]\r\n\t[*] Zzjay for [url=http://skyrim.nexusmods.com/mods/34346]Smile in HD[/url]\r\n\t[*] RadioRagae for the male [url=http://skyrim.nexusmods.com/mods/6953]\\\"Better FaceGen\\\"[/url] and [url=http://skyrim.nexusmods.com/mods/18110]\\\"Hair packs of TES IV Oblivion\\\"[/url]\r\n\t[*] Apachii for [url=http://skyrim.nexusmods.com/mods/10168]\\\"ApachiiSkyHair\\\"[/url]\r\n\t[*] tktk for [url=http://skyrim.nexusmods.com/mods/12951]\\\"Enhanced Character Edit\\\"[/url]\r\n\t[*] RAN46 for [url=http://skyrim.nexusmods.com/mods/12944]\\\"RANs CharGenMorph\\\"[/url]\r\n\t[*] Sjogga for his teleport script from [url=http://skyrim.nexusmods.com/mods/8535]\\\"Psijic Teleport Spells\\\"[/url] and help\r\n\t[*] Enter_77 for his explanation on how to create the script-updating system\r\n\t[*] Missjennabee for the female freckles\r\n\t[*] Dimon99 for his [url=http://skyrim.nexusmods.com/downloads/file.php?id=6709]DIMONIZED UNP(B) body and textures[/url]\r\n\t[*] Calyps for his [url=http://skyrim.nexusmods.com/mods/14899]UNPB variant[/url] of the UNP body\r\n\t[*] Turbosundance for his [url=http://skyrim.nexusmods.com/mods/21199]UNP (T)BBP body[/url]\r\n\t[*] Caliente for [url=http://skyrim.nexusmods.com/mods/2666]CBBE body[/url]\r\n\t[*] XP32 for [url=http://skyrim.nexusmods.com/mods/26800]XPMS[/url] and BBP\r\n\t[*] Expired6978 and TMPhoenix for [url=http://skyrim.nexusmods.com/mods/24168]RaceCompatibility[/url]\r\n\t[*] Lunanella for [url=http://skyrim.nexusmods.com/mods/21123]The Wilds ENB[/url] which I\\'ve used in most of my screenshots\r\n\t[*] The beta testers: EcthelionOtW, GabbeR-Hu, Gracescreech, HoneyVanity, Lordarion76, M0ckin9bird, Mahtawa, MissAniThrope, Nanjo, TairenSoul, Urshi, Xenoziel, Zzjay\r\n\t[*] Everybody who has pointed out bugs and suggestions for improvement\r\n\t[*] Everybody who supports this mod in any way\r\n\t[*] Anyone else I might have not credited accidentally (PM me!)[/list][/color]\r\n\t\r\n[img]http://70.38.64.76/f/1/76cd9926-b852-473e-89f5-a7ab55e0d0d7.jpg[/img]\r\n[color=lavender][center][font=georgia][b][size=5]Version History[/size][/b][/font][/center]\r\n\r\nV1.0 - \tInitial release.[/color]\r\n\r\n[img]http://70.38.64.76/f/1/1e78ff94-ec62-4a53-a7cd-b7eaa8ef051c.jpg[/img]\r\n[color=lavender][center][font=georgia][b][size=5]Legal/Licensing[/size][/b][/font][/center]\r\n\r\nUnder NO circumstances may this mod or any part of it be re-uploaded as is available on the modpage and none of its assets may be re-used in another mod without my (Seren4XX) express permission.\r\nAll parts of the mod that were not created by me (Seren4XX) may only be used in other works with permission from the original owner.\r\nI, Seren4XX, nor any of the authors listed in the credits section of this text can be held responsible for any damage of any type caused by the usage of this mod. It is fully at your own risk to use this mod.\r\nBy downloading this mod you agree to the above terms and state that you will adhere to these.[/color]",
  "categoryId": "39",
  "version": "v1.0",
  "author": "Seren4XX",
  "createdUnix": "1331335742",
  "updatedUnix": "1331335742",
  "containsAdultContent": false,
  "uploadedBy": "Seren4XX",
  "primaryFile": null,
  "files": []
}