{
  "modId": 12557.0,
  "modName": "Redguard Taja",
  "summary": "Redguard Necromancer Companion Taja",
  "descriptionHtml": "This is Taja; a Redguard Necromancer. She comes with a Deadric dagger, an offensive staff, fur clothing, and some other various goodies (including the skull of the first bandit she ever killed).\r\n\r\nYou can find her within Arcadia\\'s Cauldron in Whiterun.\r\n\r\nShe should also work with a vanilla install of Skyrim, but she will not look like she does in the screen shots. To get her appearance as initially created, you will need the following mods:\r\n\r\nCBBE V3 (standard body) and the hip texture compatability pack:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2666\r\n\r\nEnvision Face for CBBE:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=7897\r\n\r\nRANs HeadMesh Variants (Type D):\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=7127\r\n\r\nCover Eyes (eyes 1 file):\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4869\r\n\r\nKiller Keos Skimpy CBBE V2 Armor Set:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3654\r\n\r\nInstallation: Place the contents of the Zip file into your Skyrim/data directory and make sure that Taja\\'s ESP and ESM files are activated in your Data Files listing.\r\n\r\nMore companions coming soon.\r\n\r\nSpecial note: All of my future companions after Divada, Taja, Viin, and Kyia will be made using the Better Females by Bella mod. I switched to another mod set for faces (the ones listed here) due to a bug on my end I couldn\\'t resolve (the issue with females having faint male beard stubble on their faces while using Bella\\'s). I have resolved that issue, so I\\'ll be going back to Bella\\'s for my future projects. You DO NOT have to switch to Bella\\'s if you use the face mods listed above OR if you use other face mods. All of my companions should work with other face/body mods and vanilla setups unless specifically mentioned in the description. \r\n\r\nThe work around I found for the bug with Bella\\'s face mod is to use the standard Better Faces Version 3, and then apply the \\\"No Shine\\\" option available on her mod page.\r\n\r\nThe link to Bella\\'s Better Females is below.\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2812\r\n\r\nNote: I have added two screen shots with Bella\\'s Better Females installed so you can see the difference. If you\\'re still using vanilla; you might find either Envision or Bella\\'s to your liking. If you already have Envision installed, future companions will still work or if you currently use Bella\\'s you\\'ll now have an idea as to what my first four companions (Kyia, Viin, Taja, and Divada) will look like on your system.",
  "categoryId": "66",
  "version": "1",
  "author": "Grimraven1",
  "createdUnix": "1331356925",
  "updatedUnix": "1331356977",
  "containsAdultContent": false,
  "uploadedBy": "Grimraven1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41899",
      "name": "Taja",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "135",
      "fileName": "Taja-12557-1.rar",
      "uploadedUnix": "1331356977",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/44334a1a53c96a1c5f36901bec7b4173331dbb83ff2f027c6e1b04a488d2c71f/analysis/1406741169/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Taja-12557-1.rar?fid=41899&ttl=1535774547&ri=8192&rs=8192&setec=717c533264657a95857111bff3470b83"
    }
  ]
}