{
  "modId": 12560.0,
  "modName": "MOAR Followers",
  "summary": "Adds 6 unique followers to Skyrim, including a Falmer and a Werewolf, all with special abilities.",
  "descriptionHtml": "[u][font=Batang][size=16]TL;DR[/size][/u][/font]\r\nThis mod adds several additional followers to the game because, lets face it, having more friends (and more marriage options ;D ) to help you beat down dragons is always better.\r\n\r\n[b]Note:[/b] All followers begin at lvl 25 and cap at lvl 100, they are also all marked as essential. Certain followers (for example, Dragostea with the spell invisbility) will unlock new abilities as they level. [b][u]This mod is compatible with everything.[/u][/b]\r\n\r\n[size=14][b][u]CAUTION: BEFORE YOU UPDATE:[/b][/u][/size] Make sure you collect any gear you want off your follower and ask them to leave your service before switching to an updated version of this mod or uninstalling the mod, specially between 1 and 2, as in order to fix the skin tint issue I had to delete the followers from the world and replace them back into it, so they are technically \\\"different\\\" NPCs. If you fail to ask your follower to leave and leave gear with them, when you update to 2.0 your follower will be deleted with the gear you gave them, but still be in your service. It will be impossible other than loading an earlier save to get rid of the \\\"ghost\\\" follower  that is still in your service (and ask a new follower to join you). Be careful, this issue shouldn\\'t exist in later copies of the mod. This only applies to followers from this mod, not the built in skyrim followers.\r\n\r\n[u][font=Batang][size=16]Recent Updates:[/size][/u][/font]\r\n\r\n--The following updates occured March 11th 2012--\r\n-[b][u]2.0 release![/u][/b]: Added two additional followers, Blanche the frost mage and Dragostea the rogue.\r\n\r\n-Fixed the facial tint issue. Hooray, warpaint and skin tones for all! Special thanks to Matchstik23 who pointed me in the direction of Cutthroat Mods, whom designed a walkthrough for fixing the issue. I have provided the walkthrough in the readme file of this mod.\r\n\r\n-Smacked Hatalii around--She no longer sits half-lodged in front of the door to the Silverblood Inn.\r\n\r\n-Warwick: Removed the Briar heart, Human heart, and Daedra heart from his inventory. I had mistakenly left them there while debating an alternate background for Warwick. He is also slightly closer to Falkreath than he previously was.\r\n\r\n-Sylvanas: Updated her gear; she no longer sports the Falmer mask and instead wears a crown of bone horns. Her appearence still retains her ragged look. \r\n\r\n-Last but not least, PICTURES ADDED! Enjoy.\r\n\r\n[u][font=Batang][size=16]Meet The Newbies[/size][/u][/font]\r\n\r\n[font=Algerian][size=14]D[/font]anivian the Sighted[/size]\r\n\r\n[b]Race:[/b] Falmer (Untainted)\r\n[b]Gender:[/b] Male (Marriage enabled)\r\n[b]Location:[/b] Shrine of Azura\r\n[b]Combat Style:[/b] Dual-wield mace, occasional archery\r\n[b]Role:[/b] Melee damage, disabler. \r\n[b]Notes:[/b] It is a wise choice to allow Danivian to stick with maces. His name references the D&D Snow Elf god. His model is that of a High Elf, albiet white in color and without the attitude. \r\n\r\n[b]Specials:[/b] \r\n\r\n[b]Flashfreeze-[/b] Danivian blasts cold air in a line in front of him, temporarily stunning enemies. \r\nThis is Danivian\\'s prefered ability. Shares a cooldown with Fury and Dash.\r\n\r\n[b]Fury of the Snow Elves[/b]- Danivian briefly but drastically increases his attack speed. Shares a cooldown with Dash and Freeze.\r\n\r\n[b]Dash-[/b] Danivian launches himself forward, quickly escaping harm or closing in on enemies. Shares a cooldown with Freeze and Fury.\r\n\r\n[b]Agile (Passive)-[/b] Danivian easily evades pressure plate traps, never triggering them.\r\n\r\n[b]Against the Machine (Passive)-[/b] Fending off mechanical constructs has given Danivian an edge against metal,\r\ngranting him increased armor penetration while wielding maces. \r\n\r\n\r\n\r\n[b]Backstory (Prepare for CHEESE!):[/b]\r\n\r\n[i]\\\"If I don\\'t have a past... Do I still deserve a future?\\\"[/i]\r\n\r\n [font=Algerian][size=16]D[/font][/size]anivian awoke in the pits of Black Reach without a shread of memory. Scouring the area for clothing, he was lucky to come across a dead body that, unlike many others he had encountered, was not picked clean. He managed to secure two ebony maces off of a burnt husk of what must have been a Thalmor agent who lost his way in the ruins. It wasn\\'t soon after Danivian found his maces that he was quickly aquainted with Dwemer technologies, and not the friendly variety. His mind flooded with an unexplained rage as the Dwemer constructs approached him, and with a fury unseen for centuries, Danivian ripped the machines circuit from circuit. Not being ones to remain out of the loop, the Falmer quickly took notice of the path of destruction Danivian was weaving as he attempted to find a way out of the cavernous Black Reach. Originally recognizing his scent and approaching with curiosity, it was not long before they were met with the end of Danivian\\'s mace as well. After all, there was no way he could have known they were once just like him. It did not take much for the curiosity of the Falmer to turn into vicious onslaught.\r\n\r\nDanivian dredged his way through Black Reach, eradicating Dwemer machines and Falmer alike, until finally he breached the surface. He had barely made it out alive. Collapsing in the snow, a certain Azurian cleric happened by the dying Snow Elf. Puzzled by his appearence but nevertheless compelled to aid him, Aranae Lenith took the elf back to the nearby Shrine of Azura and nursed him back to health. It is at that shrine that Danivian still resides, clueless of his origin or race, unknowing of the implications of his existance. Learning English from Aranae and reading various books about Skyrim, he now waits with a building wanderlust. Perhaps his desires will be met, and an adventurer will happen by to lend this unique follower purpose.\r\n---\r\n\r\n[font=Algerian][size=14]S[/font]haman Hatalii[/size]\r\n\r\n[b]Race:[/b] Orc\r\n[b]Gender:[/b] Female (Marriage enabled)\r\n[b]Location:[/b] Silverblood Inn, Markarth\r\n[b]Combat Style:[/b] Destruction magic, occasional one-handed axe\r\n[b]Role:[/b] Caster, can tank magic users.\r\n[b]Notes:[/b] Has the standard elementalist casting kit, all of which will become higher in rank as she levels (see: Firebolt turning into Incinerate).\r\n\r\n[b]Specials:[/b]\r\n\r\n[b]Stormrage-[/b] While outdoors, Hatalii  may create a thunder storm which will occasionally damage enemies. \r\n\r\n[b]Mother Nature (Passive)-[/b] 30% of the magic damage done to Halatii is absorbed and converted into magicka, instead of harming her.\r\n\r\n[b]Aggressive Caster (Passive)[/b] - Hatalii will attempt to lock onto a target and empty all of her magicka as quickly as she can, providing herself with a great deal of burst damage and rather high threat generation. Off with their head!\r\n\r\n[b]Regrowth (Passive)[/b]: Hatalii benefits from increased magicka regeneration. \r\n\r\n\r\n[b]CHEESE:[/b] \r\n\r\n[i]\\\"The Forsworn\\'s days are numbered. The Earth\\'s days are uncountable.\\\"[/i]\r\n\r\n[font=Algerian][size=16]A[/font][/size]lthough showing a talent for the elements, Hatalii was not always a Shaman. In fact the title belonged to her younger brother for the longest time. She had spent her days as a simple herbalist, tending to the small crops of her settlement, using her keen insight with nature to make even the most troublesome garden burst into abundant harvest. Life was simple for the Orc, but she secretly wished for so much more; for in her heart burnt the spirit of not only a powerful Shaman, but an adventurer. \r\n\r\nUnfortunately for her she was to get her wish for a more exciting life but at a terrible cost. The Forsworn menace had not been picking on nearby Markarth alone; her settlement was soon besieged. Scraping by with massive losses, her people had managed to fend off the Forsworn, and along with so many others, Hatalii found her brother dead. Taking up the mantle as Shaman, Hatalii began to train. In a matter of months, she had reached her peak; Hatalii had blossomed into one of the most powerful Shaman in Skyrim virtually over night. Although she had fufilled her desire to become a brilliant Shaman, her heart remained heavy from the loss of her brother and her people. \r\n\r\nWith vengance stalking her thoughts and a renewed thirst for improving her natural gifts ever further, Hatalii set out to Markarth to find anyone who will help her get her revenge on the Forsworn, once and for all. She now resides in the Silverblood Inn, waiting for a helping hand.\r\n\r\n---\r\n\r\n[font=Algerian][size=14]W[/font]arwick[/size]\r\n\r\n[b]Race:[/b] Pure Werewolf [i](Has never had, and never will have a \\\"human\\\" form)[/i]\r\n[b]Gender:[/b] Male \r\n[b]Location:[/b] Falkreath, across the stream from the mill\r\n[b]Combat style:[/b] unarmed melee\r\n[b]Role:[/b] Tank\r\n[b]Notes:[/b] Warwick has a large health pool, but is quite smaller than the average werewolf. Try to engage enemies at range so Warwick can intercept them. Warwick was inspired by the LoL character of the same name. His voice makes sense if you read his CHEESE!\r\n \r\n[b]Specials:[/b]\r\n\r\n[b]One with the Wilds:[/b] Warwick sometimes befriends wild animals he encounters.\r\n\r\n[b]Broad Swings (Passive):[/b] Warwick occasionally knocks enemies back.\r\n\r\n[b]Feral Swiftness (passive):[/b] Warwick moves 15% faster.\r\n\r\n[b]Kahjiit Caravan (passive):[/b] Warwick suffers no encumberment from carrying heavy and light armor for you. Ultimate pack mule!\r\n\r\n[b]Last Stand (passive):[/b] When Warwick drops below 10% health, he is instantly healed for 250 hit points. This effect cannot occur more than once a day.\r\n\r\n\r\n[b]CHEESE:[/b] \r\n\r\n[i]\\\"Why do people look at Kahjiit funny when Kahjiit refers to Kahjiit\\'s self as \\'Kahjiit?\\'\\\"[/i]\r\n\r\n[font=Algerian][size=16]W[/size][/font]arwick has been a wolf for as long as he can remember. A Khajiit merchant caravan tredging the sands of Elsweyr had stumbled across the young pup travelling with a strange, dirty and ill-tempered Breton. Both overwhelmed by curiosity and a fear for the pup\\'s safety, the caravan agreed to purchase the wolf from the drunk and belligerent man. Soaking up language, culture, nourishment and much-needed love, the young wolf thrived with the caravan. \r\n\r\nSeveral years later, during a particularly nasty sandstorm,  an older Warwick had found himself somehow seperated from the Kahjiit caravan. When the sandstorm had finally subsided, the caravan was nowhere to be found. Using his keen sense of smell, Warwick has been attempting to track down the caravan for months. His search has lead him to Skyrim, where he finds himself utterly friendless and alone. Friendly as ever, the poor wolf wanders Falkreath, unable to enter the town -- where the scent suddenly stops -- without an escort due to his unsettling appearance, hoping one day he finds his caravan and his family of cats.   \r\n\r\n---\r\n\r\n[font=Algerian][size=14]S[/font]ylvanas[/size]\r\n\r\n[b]Race:[/b] Dark Elf, Undead\r\n[b]Gender:[/b] Female (Marriage enabled)\r\n[b]Location:[/b] Windhelm Cemetary\r\n[b]Combat style:[/b] Archery\r\n[b]Role:[/b] Ranged damage, disabler\r\n[b]Notes:[/b] Sylvanas is rather squishy, try to keep enemies off of her. She is inspired by the WoW character of the same name. \r\n\r\n[b]Specials:[/b]\r\n\r\n[b]Black Arrow (passive)-[/b] Enemies are staggered under the impact of Sylvanas\\' shots.\r\n\r\n[b]Necromancy-[/b] Sylvanas occasionally enslaves nearby corpses. Minions raised by Sylvanas become more powerful as she levels.\r\n\r\n[b]Hunter\\'s Mark-:[/b] Sylvanas marks her target for death, decreasing their armor and causing them to take damage every second for \r\n60 seconds.  \r\n\r\n[b]CHEESE:[/b]\r\n\r\n[i]\\\"May Sovngarde have mercy on you... For I will not.\\\"[/i]\r\n\r\n [font=Algerian][size=16]S[/font][/size]ylvanas was a loving, hardworking and loyal patron of the busy city of Windhelm. Her strong work ethic and brilliant people skills would have carried her far in the city, if not for one thing: she was a Dark Elf. Facing constant racism from the local Nords, her conflicts with the less-accepting folks of Windhelm came to a head one night when she found herself followed home from work at Candlehearth Hall. Her screams for help were ignored by Windhelm\\'s guards as her life was stolen from her. \r\n\r\nBroken and bloodied, the body of Sylvanas was dumped into the ocean where it sunk like an anchor. Not a soul noticed that the Dark Elf was missing; not a soul cared. \r\n\r\nThe ocean thrashed and groaned in the winds of a particularly furious blizzard one fridgid night on the coast of Windhelm, when slowly, a dark, rotting and bloated corpse dredged its way onto the shore. Pulling herself to her feet, her limbs twisting at impossible angles, she set her eyes upon her once beloved city. Wreaking of hatred and vengeance, Sylvanas dragged her body to Windhelm. Unlike the silence that met her cries on the night of her murder, not a single whimper was heard through the raging blizzard that blanketed the kulling of dozens of anti-elf enthusiasts that night. Sylvanas dumped their bodies into the sea, as they had once done to her, and the ocean devoured them wholly. With a shriek from the cliffs of Windhelm, Sylvanas (and oddly, the blizzard) vanished.\r\n\r\nSome say a shadowy figure lurks in the graveyard of Windhelm at night,* where Sylvanas would have been burried... if she were human. \r\n\r\n*She is there during the day. :\\'D\r\n\r\n-----\r\n\r\n[font=Algerian][size=16]B[/font]lanche[/size]\r\n\r\n[b]Race:[/b] Imperial\r\n[b]Gender:[/b] Female (Marriage enabled)\r\n[b]Location:[/b] The Ragged Flagon, Riften\r\n[b]Combat Style:[/b] Various ice spells, uses a staff of icy spear to conserve magicka\r\n[b]Role:[/b] Caster damage, disruption\r\n[b]Notes:[/b] Blanche excells at distracting enemies, followed by punishing them severely with multiple ice spells. She has a general frost mage kit, including icy spear, frost atronach, ice cloak etc. Be careful though, for what she makes up for in utility, she lacks in hit points and armor.\r\n\r\n[b]Specials[/b]:\r\n\r\n[b]Icy Blast[/b]: Blanche looses a biting torrent of wind in a cone in front of her, icing enemies and reducing their stamina. \r\n\r\n[b]Winter Shade[/b]: Upon being threatened by enemy advances, Blanche will occasionally coelesce snow in the air around her into icy images of herself, reducing her threat. The images will then go about distracting and harassing enemies. After taking damage, the shades will detonate, dealing damage to nearby enemies.\r\n\r\n[b]Mistveil (passive)[/b]: Blanche is surrounded by a thin layer of fog at all times, giving her a 25% chance to completely avoid all damage from a melee attack and increasing the damage nearby enemies take from her frost spells by 50% (This is the visual you see around her).\r\n\r\n[b]Quickchill (passive)[/b]: All ice projectiles are quicker and easier for Blanche to cast, allowing her to spam abilities like icy spear to a greater affect than the average caster. In addition, enemies at low health suffering frost damage from Blanche may become completely frozen.\r\n\r\n[b]CHEESE[/b]: \r\n\r\n[i]\\\"Come now darling, let me warm you up...\\\"[/i]\r\n\r\n [font=Algerian][size=16]T[/font][/size]he life of a thief isn\\'t always easy. In fact, it never is. As a manipulative conartist and aspiring professional thief, Blanche found herself needing to use every dirty trick in the book to be half as good as other thieves. You see, Blanche wasn\\'t very good at stealth, for she had been cursed with an uncanny link to the elements of ice. One can imagine it is quite difficult to sneak up on someone and rob them blind, when entering the room causes a noticible drop in temperature. Try as she might, Blanche could never sever her tie with the glaciers in order to become the thief she dreamed of, and lying was only getting her so far. It wasn\\'t until Blanche was faced with certain death that her realization came to her; she had been tasked with looting by the Guild. The target: a Daedric shrine located in the mountains. She had been chosen for the job not only because it would probably involve zero sneaking, but because she was completely unhindered by the cold and blizzarding nature of Skyrim\\'s peaks. Upon reaching the summit and locating the shrine, Blanche began looting. She had barely found anything before rifts burst out of reality around her, and she found herself set upon by fierce Dremora soldiers. \r\n\r\nAs their firey magics burned and seared around her, something other than fear awoke inside her. The very essence of Skyrim herself rushed from Blanche\\'s body like an avalanche, devastating the mountain side in an uproarious blizzard. The Dremora, however, weren\\'t put off by this display of raw energy, for they knew Blanche was close to death after their attack. Putting her quick wit to good use, Blanche combined her thief-cunning with her new found power, and collapsed a thick layer of fog around the shrine. Lost and confused in the dense fog, the Dremora searched tirelessly for the witch, but every time they stabbed out at what appeared to be Blanche, she disappeared. The Dremora found themselves surrounded by constant illusion; at times there was nothing in the mist, and others...Entire frost atronachs charged them.\r\n\r\nSuffice it to say, Blanche returned the following day with all the spoils she could carry. She has since been impressing the Guild with her unique form of large-scale thievery, using her icey powers to conceal and baffle victims while her frost atronachs and misty mirror images loot multiple places at once. She currently resides in the Ragged Flagon, itching for something to do, someone to lie to, and something to steal.\r\n\r\n-----\r\n\r\n[font=Algerian][size=16]D[/font]ragostea[/size]\r\n\r\n[b]Race:[/b] Nord\r\n[b]Gender:[/b] Male (Marriage enabled)\r\n[b]Location:[/b] Mara\\'s Eye Pond, Southwest of Windhelm\r\n[b]Combat Style:[/b] Dual-wielding daggers, occasional archery\r\n[b]Role:[/b] Melee damage, assasin\r\n[b]Notes:[/b] Dragostea is extremely adept at stealth. Take him on quests that require you to sneak a lot.\r\n\r\n[b]Specials[/b]:\r\n\r\n[b]Acid Spray[/b]: Dragostea fires a jet of acidic liquid from a contraption hidden in his clothing, damaging enemies from afar and reducing their armor.\r\n\r\n[b]Highpitch Pulse[/b]: Dragostea dislikes being beaten upon by sharp or blunt objects and will attempt to remove them from enemies, using a mind-numbing rift of sound from his mechanically enchanced armor.\r\n\r\n[b]Sharpened Wit (passive)[/b]: All damage done by Dragostea is increased while wielding daggers. \r\n\r\n[b]Predator (passive)[/b]: In addition to being incredibly difficult to detect, Dragostea\\'s attacks from sneaking become critical strikes, dealing up to 15 times their regualr damage. \r\n\r\n[b]CHEESE[/b]:\r\n\r\n[i]\\\"If only finding my true love was as easy as murder...\\\"[/i]\r\n\r\n[font=Algerian][size=16]T[/font][/size]here are four things in life that Dragostea tends to obsess over: gadgets, assassinations, stealing and love. Constantly mocked by other assassins and thieves for his perpetual poem writing and puppy-dogging of crushes, Dragostea generally has a rough time fitting in. He had been chasing a girl \\\"of his dreams,\\\" as he said, a fellow thief of a rivaling group. She refused to pay him much attention, of course that didn\\'t stop Dragostea from going out of his way to impress her. He devised a plan that would surely win her heart; he was going to track down the infamous and deadly Nightingales and steal one of their costumes. A feat that was entirely unheard of and completely impossible would not only impress his love, but win him the respect of assassins and thieves everywhere. Perhaps the Dark Brotherhood would even take notice.\r\n\r\nLuckily for Dragostea, he had a keen insight when it came to machines. Spending his days in various Dwemer ruins, he had used his talent to reverse-engineer all sorts of machinery. Using a new form of mechanical explosive, Dragostea managed to crack the seal on the Twilight Sepulcher, sneak in unnoticed and nab one of their costumes. He was surprised at how empty the Sepulcher was, not a single Nightingale was seen. However, on his way to meet his love he was attacked -- By a Nightingale. Using his mechanical trickery and adept stealthing abilities he evaded the Nightingale for hours. Finally, the elite thief ceased her pursuit, calling out to Dragostea and announcing her defeat. She simply could not find him. Dragostea returned to his peers headstrong and confident. Alas, although he presented his crush with proof of his tale -- the costume of a Nightingale -- Blanche still refused to associate with him. Not one to give up on love, Dragostea decided to sport the costume of the Nightingale in hopes to attract his new crush... The Nightingale who had tried to catch him. He currently resides in Mara\\'s Eye pond, preying to the goddess of love for a chance to meet the Nightingale he loves. Will he ever fall for someone in his league? Probably not, but for now he is content to chase any tail that happens by -- Nightingale, Dragonborn or otherwise. \r\n\r\n[u][font=Batang][size=16]COMING SOON [s]TO A THEATRE NEAR YOU[/s][/size][/u][/font]: \r\n\r\n-Perhaps a 2h-ed Meleer in the future? Who knows.\r\n\r\n[u][font=Batang][size=14]KNOW ISSUES:[/size][/u][/font]\r\n\r\n-Fixed everything so far as of March 11th!",
  "categoryId": "66",
  "version": "2.0",
  "author": "Oneirophobia",
  "createdUnix": "1331365613",
  "updatedUnix": "1331459799",
  "containsAdultContent": false,
  "uploadedBy": "Oneirophobia",
  "primaryFile": null,
  "files": [
    {
      "fileId": "41921",
      "name": "Oneirophobia MOAR followers",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22",
      "fileName": "Oneirophobia MOAR followers-12560.rar",
      "uploadedUnix": "1331365861",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/be7cbab2d456a9b36b9528b5a652710757a7ad270e43d5e1f3ba4c683b9ceba4/analysis/1406741343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Oneirophobia%20MOAR%20followers-12560.rar?fid=41921&ttl=1535774554&ri=8192&rs=8192&setec=cadcf53467e36933fb5284cf6d6f9c4a"
    },
    {
      "fileId": "42263",
      "name": "MOAR Flowers-- Er I mean followers",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "714",
      "fileName": "MOAR Flowers-- Er I mean followers-12560-2-0.rar",
      "uploadedUnix": "1331459799",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/4b3be0e95fad27458e03d58df44b03bea3e0c8f2fae3341a994ba1899f5a9a08/analysis/1406742971/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MOAR%20Flowers--%20Er%20I%20mean%20followers-12560-2-0.rar?fid=42263&ttl=1535774555&ri=8192&rs=8192&setec=6f3a644a251861981e542668ee096636"
    }
  ]
}