{
  "modId": 12577.0,
  "modName": "SRM Companion Cart",
  "summary": "This mod adds a player owned caravan available for purchase from J\\'zzir, your neighborhood caravan dealer. Simply walk up to him, talk to him about it, and purchase it from him. Note the default version does not have companion compatability, I will be uploading the companion versions as well in a few.",
  "descriptionHtml": "[center][size=14][color=#FF00FF][b]SKYRIM ROADKILL MOD: COMPANION CART[/b][/color][/size][/center]\r\n[center][img]http://img842.imageshack.us/img842/9256/okayue.jpg[/img][/center][center][color=#FF00FF]{Brought to you by SHEO Motors, ride the cheese}[/color][/center]\r\n\r\n[center][color=#008000]Current version 2.3[/color]: Updated for 1.5, inceases carrying capacity of cart to 1000. IF YOU HAD LOOT IN YOUR CART AND UPDATE, YOU CAN GET IT BACK BY ACTIVATING THE HORSE. IT IS NOT GONE FOREVER.[/center]\r\n\r\n[center][youtube]u99fLFigvtg[/youtube][/center]\r\n\r\n[center][color=#008000]Keep in mind that despite the light-hearted nature of the videos and description of this mod, this mod expects to be treated as if it were seriously serious (seriously). This mod is extremely role-play/lore friendly. Enjoy the videos, enjoy the mod.[/color][/center]\r\n\r\n[size=4][center][color=#00FF00]****# DA MOD DETAILZ #*****[/color][/center][/size]\r\nThis mod adds a player owned caravan available for purchase from J\\'zzir, your neighborhood caravan dealer. Simply walk up to him (he is just outside of the Pelagia Farm, along the road to the watchtower), talk to him about it, and purchase it from him. \r\n\r\nOnce acquired you can store up to 600lbs in the cart before your horse can no longer run. (REALISM!)\r\n\r\nThis cart carries your companions too! Any humanoid followers in your service get in and out with you.\r\n\r\nThe cart adds a wow factor of 1000x to the men and ladies of Tamriel, impress the sexes with your cool new ride. (This is a joke, just a heads up <.<)\r\n\r\n[size=4][center][color=#00FF00]****# IMPROVEMENTS OVER LAST VERSION #*****[/color][/center][/size]\r\n\r\n1. Reduced the bouncing in the cart, occurring usually shortly after getting in and also a bit while on the road. The bouncing should be nothing more than a slight thump equivalent to hitting a stone along the road now, unless of course you go hog wild and slam into a giant boulder, in which case good for you!\r\n\r\n2. Removed the exit animations from the cart. If you liked them, I\\'m sorry but you\\'ll have to use the old version. The exit animation caused some small issues, all of which should be eliminated now. It also lets you get out faster. Nothing wrong with that.\r\n\r\n3. Fixed the issue of \\\"Random teleportals\\\" entirely. Very rarely, when exiting the cart, your player would fly across the map to someplace you had already been. It was very rare, but it did occur. It doesn\\'t now. Hooray!\r\n\r\n4. Fixed a rare bug causing your combat animations to lock up shortly after exiting cart. This was tied into the a fore mentioned removing the exit animation. \r\n\r\n5. Eliminated the potential for the player to be hurt whilst exiting cart.\r\n\r\n6. Not noticeable yet, but I have made way for future compatibility with multiple followers. Be ready for it sometime in the future. Till then this mod assumes you have just one follower. If you have more, then be prepared to watch the cart flip out and go on a havok-induced killing spree.\r\n\r\n7. Fixed small issue where the quest would not start for some people.\r\n\r\n[size=4][center][color=#00FF00]****# Future Improvements? #*****[/color][/center][/size]\r\n\r\n1. Fast Travel. It isn\\'t looking good for fast travel kids. Currently the script functions just won\\'t allow it. Looking into SKSE to fix this. Note, you can fast travel with this mod, just don\\'t expect the horse and cart to follow you.\r\n\r\n2. Make the magical stone (Read below) move the cart more nicely. It likes to flip the cart upside down on occasions. Sorry bout that.\r\n\r\n3. Fix any reported bugs. Like a good modder.\r\n\r\n4. Been looking at how radio works in Fallout, think I might be able to have a custom radio system in the cart. If I make such a system, I may also add other cool pimp features like massive rims or hydrolics for bounce (as optional file of course, the default is as lore friendly and realistic as possible). Yes, I said Hydrolics.\r\n\r\n[size=4][center][color=#00FF00]****# UPGRADE/INSTALL PROCEDURE #*****[/color][/center][/size]\r\n\r\nIf you are upgrading from the singles edition, simply:\r\n\r\n1. remove the mod from your data checklist in the launcher.\r\n2. delete the mod if you wish, found in the data folder of skyrim in BSA/ESP formats.\r\n3. load a save, it will say \\\"You no longer have some data, blah, continue?\\\" Continue loading and once in game,\r\n4. Save a new save file. Not a quick/auto save either. A hard new manual save.\r\n5. Exit game.\r\n6. Download mod,\r\n7. Put in data folder\r\n8. Check in launcher\r\n9. Profit.\r\n\r\nIf you aren\\'t upgrading, use step 6-9.\r\n\r\n\r\n[size=4][center][color=#00FF00]****# Known Issues #*****[/color][/center][/size]\r\n\r\n1. THIS ISSUE CANNOT BE FIXED, I HAVE MADE SURE TO NEGATE IT AS MUCH AS HUMANLY POSSIBLE, THIS IS NOT A BIG DEAL. If you load a save next to the cart it will likely not be tethered in game. I have put several \\\"failsafes\\\" to negate this issue as much as possible, since again it is just an issue with the script function and likely will not be fixed. If this problem occurs to you, simply:\r\n    a. Enter Interior. Exit Interior. Fixed.\r\n    b. Leave the cart and horse and do something, return to cart after awhile. Should be tethered.\r\n    c. Touch J\\'zzir\\'s stone. Its on the ground where you met him and bought the cart (It is called Magical Stone). It looks like Iron ore. Once touched, the stone moves the cart and horse together in front of you. It wont tether them, so you\\'ll have to use step 1 or 2. But it helps if they are separated a ways and can\\'t find them.\r\n\r\n2. This also seems like it can\\'t be fixed for future reference, however it is entirely a cosmetic issue. Rarely, after extended periods of carting, your companion will vanish from the cart yet still be making noises as if in the cart. Its weird. In my testing its usually a good 30+ minute trip in the cart before it happens. However, beyond visually and audio-ly being odd, it seems to be only a cosmetic issue, as  once you exit the cart the companion is right next to you as always. Silly Lydia.\r\n\r\n(not really a problem)3. The camera is a bit wonky for the split second before it changes to the horse. Once you are in the horses perspective (should be easy to notice), just scroll with your mouswheel to adjust your camera like you normally do. Not a problem but people have mentioned it.\r\n\r\n4. The horse, despite having no AI packages allowing him to do combat, still likes to do combat after getting out of the cart. It can be odd watching him dart at bandits up a 200 foot incline and the cart flailing about. I\\'m trying to find a way to make this stop.\r\n[size=4][center][color=#00FF00]****# Some Notes #****[/color][/center][/size]\r\n\r\n\r\nAgain, thanks to all on Bethesda official forums who gave me assistance, tip of the hat to you sirs/mams",
  "categoryId": "83",
  "version": "2.3",
  "author": "Supernastypants",
  "createdUnix": "1331390215",
  "updatedUnix": "1332281230",
  "containsAdultContent": false,
  "uploadedBy": "supernastypants",
  "primaryFile": null,
  "files": [
    {
      "fileId": "43247",
      "name": "SRM Companion Cart v2_0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3797",
      "fileName": "SRM Companion Cart v2_0-12577.rar",
      "uploadedUnix": "1331733354",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/5d85fb2483cba37d2bbe0986d0745d13cf4aa25f6649fd75bf8b93f01eb9f8b7/analysis/1406748639/",
      "changelogHtml": " Companion Functionality <br/> \n Quest for Tracking Cart <br/> \n Ability to modify the horse\\'s speed <br/> \n Menu System <br/> \n Voice Acting re-recorded and spelling mistakes fixed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SRM%20Companion%20Cart%20v2_0-12577.rar?fid=43247&ttl=1535774582&ri=8192&rs=8192&setec=811bfa1d7025ddbc629242036bd41b01"
    },
    {
      "fileId": "43249",
      "name": "SRM CompanionCart Singles Edition No Followers",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3812",
      "fileName": "SRM CompanionCart Singles Edition No Followers-12577-1-2.rar",
      "uploadedUnix": "1331734255",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/f51ea3035f993ae19ca58fb0699b5ee968adedc810129c7ff2bea4009fe5f81c/analysis/1406748644/",
      "changelogHtml": " Previous change didn\\'t change anything. This change changes everything. Again, fixes issue with horse forrealz. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SRM%20CompanionCart%20Singles%20Edition%20No%20Followers-12577-1-2.rar?fid=43249&ttl=1535774583&ri=8192&rs=8192&setec=34db73982e6fff3ca89fe1b02ac9c071"
    },
    {
      "fileId": "43883",
      "name": "SRM Companion Cart v2_1",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3800",
      "fileName": "SRM Companion Cart v2_1-12577.rar",
      "uploadedUnix": "1331920397",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/49a8151d074ae1992ba75f0a0603453151bbd769ca7e5542b6be05b1610f3360/analysis/1406751821/",
      "changelogHtml": " Fixes cart bouncing after getting in initially <br/> \n Fixes Animation Lockup rarely occurring after exiting cart <br/> \n Fixes \\\"random teleportals bug\\\", which rarely shot the player across the map randomly <br/> \n Eliminated potential for player to be hurt exiting the cart <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SRM%20Companion%20Cart%20v2_1-12577.rar?fid=43883&ttl=1535774583&ri=8192&rs=8192&setec=7f0184c134162a0060a65e84993c9134"
    },
    {
      "fileId": "44150",
      "name": "SRM Companion Cart v2_2",
      "version": "2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3800",
      "fileName": "SRM Companion Cart v2_2-12577.rar",
      "uploadedUnix": "1331999132",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/8f1385d01e09c3d05de41088e7bfe137c85094a1da9a40fa4601ea9de73b8e46/analysis/1406753237/",
      "changelogHtml": " Fixes the quest not starting for some people. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SRM%20Companion%20Cart%20v2_2-12577.rar?fid=44150&ttl=1535774584&ri=8192&rs=8192&setec=fe16ec5ff1212019b9260a5fd368e01d"
    },
    {
      "fileId": "45206",
      "name": "SRM Companion Cart v2_3",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3802",
      "fileName": "SRM Companion Cart v2_3-12577-2-3.rar",
      "uploadedUnix": "1332281230",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/0e6c116410f951308dcbd8294256d9124a8de83dd6c1a895a19beedc8ca7e241/analysis/1406770340/",
      "changelogHtml": " 1.5 update <br/> \n 1000 carrying capacity now, WOOO <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SRM%20Companion%20Cart%20v2_3-12577-2-3.rar?fid=45206&ttl=1535774584&ri=8192&rs=8192&setec=b327cf43df5dcc7d62dd346f351d5060"
    }
  ]
}