{
  "modId": 12604.0,
  "modName": "Alternate Breezehome Purchase",
  "summary": "You can now buy Breezehome after restoring the Gildergreen by any means. Vanilla option still available.",
  "descriptionHtml": "By request, for those who use alternate starts, etc.\r\n\r\nYou can now buy Breezehome after restoring the Gildergreen by any means. All you need to do is complete the quest The Blessings of Nature, and you will be able to buy the house from Proventus. This mod is \\\"safe\\\" to leave in a game where you intend on playing the main quest normally, as well. The condition is an \\\"or\\\", and the original condition \\\"or\\\"s are intact. In short, you can gain the ability to buy the house either way.\r\n\r\nThis ALSO, incidentally, allows people who have done alternate starts buy any houses anywhere in the normal fashion. (Becoming Thane, etc.) This apparently did not work beforehand, as the House Purchase quest is somehow enabled in the intro. When you skip the start, you skip the trigger to enable it.\r\n\r\n\r\nCOMPATIBILITY/PERFORMANCE:\r\n\r\nThis does not touch Breezehome itself, only the one exact topic to sell the house, so it should be compatible with almost anything. It does not touch the quest The Blessings of Nature, I merely used it as a convenient \\\"favor\\\" to unlock the option to purchase the house.\r\n\r\nNow, it also touches the House Purchase quest. I don\\'t know what else might change that quest, but it will conflict with anything that does. If in doubt, load any new house mods after this one.\r\n\r\n\r\nINSTALLATION:\r\n\r\nIt\\'s just an ESP, so pop it in your Data folder, activate it, and go.\r\n\r\n\r\nCREDITS:\r\n\r\nSkyGrim on Steam for the request and testing\r\nSoulvex on the Bethesda forums for suggestions\r\n\r\n\r\nVERSION HISTORY:\r\n1.00 - Release\r\n1.01 - Fixed problem that did not allow any house to be purchased if the player had done an alternate start",
  "categoryId": "28",
  "version": "1.01",
  "author": "Midnight Voyager",
  "createdUnix": "1331409608",
  "updatedUnix": "1331601462",
  "containsAdultContent": false,
  "uploadedBy": "MidnightVoyager",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42810",
      "name": "Alternate Breezehome Purchase",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Alternate Breezehome Purchase-12604.rar",
      "uploadedUnix": "1331601462",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/b9721b7229bf80df12e6ada09d849db00865a516889218bf8b0c81884a250eaa/analysis/1406746049/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternate%20Breezehome%20Purchase-12604.rar?fid=42810&ttl=1535774631&ri=8192&rs=8192&setec=81cc2513757c9e98d67b2725dbc5d46c"
    }
  ]
}