{
  "modId": 12622.0,
  "modName": "Beowulf Quest WIP",
  "summary": "The story of Beowulf, as told through Skyrim",
  "descriptionHtml": "This is my FIRST MOD EVER. No programming, no modding Oblivion, just my beginner\\'s Java book, a couple tutorials, and a whole lot of patience. I need ridiculous amounts of guidance before this can even be released as a 1.0, but I\\'m hoping the Nexus community would like to assist me. BACK UP SAVES before downloading. No glitches so far outside of the ones in the mod itself, but there\\'s plenty of ones inside the mod (Grendel not spawning).\r\n\r\nStory:\r\nTaken from the Beowulf I read for English, story tells of a man named Beowulf who achieved great feats and was the strongest in the land. To repay a debt his father owed, Beowulf comes to the Danish King Hrothgar (Bethesda took this name obviously from here) to aid him while his people are under attack by Grendel, an evil monster (the blackened Orc guy). After defeating him, he fights of Grendel\\'s mother, and then dies at the hand of a dragon.\r\n\r\nYou can see there\\'s a lot of room for modding here. I\\'ve only gotten to create the Grendel fight, and I plan on doing all three fights, quests for each, and a couple of new items. \r\n\r\nTO PLAY:\r\nGo to Honningbrew Meadery, and look for a building near the river (its back faces the river).\r\nEnter Hrothgar\\'s Palace and talk to Hrothgar, and then follow his instructions.\r\nHave merciful pity on my first mod.\r\n\r\nPlease message/comment on any ideas you have to complete the project. I want to do it myself, but there are just so many chances to get help doing meshes and textures for the weapons, characters, and I don\\'t have much experience with the Creation Kit besides tutorials.",
  "categoryId": "35",
  "version": "0.1",
  "author": "Swiggles1987",
  "createdUnix": "1331423965",
  "updatedUnix": "1331424080",
  "containsAdultContent": false,
  "uploadedBy": "Swiggles1987",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42166",
      "name": "Beowulf Quest Mod",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "134",
      "fileName": "Beowulf Quest Mod-12622-0-1.7z",
      "uploadedUnix": "1331424080",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/f8e07d0e936ccd5b398285af32e535aef48842830d693325becab6d72bb2b330/analysis/1406742622/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beowulf%20Quest%20Mod-12622-0-1.7z?fid=42166&ttl=1535774665&ri=8192&rs=8192&setec=36a860baf0e80aa3fa689bf8979175b4"
    }
  ]
}