{
  "modId": 12643.0,
  "modName": "Little Barons Interior Decorating aka LB-ID",
  "summary": "Adds variety to glazed pottery, adds varied flower pots and planters throughout civilized Skyrim, small purchaseable statues, player placeable paintings, and miscellaneous gew-gaws for your home decorating pleasure.",
  "descriptionHtml": "WHAT DOES IT DO?!\r\n\r\nAdds variety to glazed pottery, adds varied flower pots and planters throughout civilized Skyrim, small purchaseable statues, player placeable paintings, and miscellaneous gew-gaws for your home decorating pleasure.\r\n\r\nAlso adds a bit of dirt to the large empty pots in places like Proudshire Manor, removes many of the ugly \\'wall baskets\\' \r\n\r\nAbout half or more of the paintings were converted by permission from screen shots taken and posted by fellow Nexus members. The paintings are named as \\'painted\\' by them in game, and these members are listed below. Thanks again!!\r\n\r\nHOW TO INSTALL IT:\r\n\r\nUse NMM! Or, pop both the files into your DATA folder and make sure the box is checked in the launcher.\r\n\r\nHOW TO USE IT:\r\n\r\nFor the most part everything operates like normal in-game clutter, with the exception that all the custom objects are bottom heavy so they are much easier to move around.\r\n\r\nPaintings are special objects: When you drop one into the world, after about a second it will re-align itself so it is facing you and will remain stuck in the air. If you click on it you will be given a menu which will allow you to move it around and even re-size it (see the screenshot).\r\n\r\nThe merchants who carry the decorative goods are:\r\n                  \r\nBelethor of Belethor\\'s General Goods\r\nSayma of Bits & Pieces in Solitude\r\nLisbet of Arnlief & Sons in Markarth\r\nBirna of Birna\\'s Oddments in Winterhold\r\nRevyn of Sadri\\'s Used Wares in Windhelm\r\nBersi of The Pawned Prawn in Riften\r\nTonilia in the Ragged Flagon in Riften\r\n\r\nTonilia will also sell a few items that would be considered \\'illegal\\' in Skyrim, such as daedric statues.\r\n\r\nMerchant\\'s \\'decorative\\' stock changes every few days.\r\n\r\nCONFLICTS?\r\n\r\nThis mod does not touch any cell or NPC directly. The merchants get their new items via a script, the wall baskets are eliminated via .nif trickery and the glazed objects alter themselves via scripting again. In short there should be almost no conflicts with other mods, unless they alter the following base item forms: \r\n\r\nGlazed02Jug01 GlazedPotteryBase01 GlazedPotteryBase02 GlazedPotteryBase03 GlazedBowl01\r\nGlazedBowl02 GlazedGoblet01 GlazedJugLarge01 GlazedJugSmall01 GlazedPlate01 GlazedPot01\r\nGlazedPot02 BasketClosed01 WallBasket01 WallBasket03 WallBasketHex02 WallBasketLarge02\r\n\r\nKNOWN ISSUES:\r\n\r\nRarely the process of creating a room full of replaced glazed clutter results in a few items getting knocked out of place. Also, if you are paying close attention when you enter a new location you will see the glazed clutter getting replaced within the first few seconds after entering. This was coded on purpose  in the interest of game stability.\r\n\r\nRarely you may move a painting far enough into a wall that after \\'finishing\\' it (and even though you can still see the painting) the painting is no longer accessible. Make sure you\\'re happy with the placement before clicking \\'finish\\', just in case!\r\n\r\nIf you un-install this mod, any place you visited prior to a save where the pottery was changed will be devoid of any pottery. Try this mod out, and if for some reason you don\\'t like it, revert to a save you made before you installed it.\r\n\r\nMANY THANKS TO:\r\n\r\nKarrakaz who tested an early alpha version with just the flower pots.\r\nOminousVoice for helping me on the forums to overcome the overwhelming darkness of colorless verts\r\nBethesda, the NifTools peeps, the Blender Foundation, Paint.Net\r\n\r\nAnd to the following people who contributed screenshot art for use as paintings:\r\n\r\nDonald the Duck aka Eomolch, Alexandrogr, Eiries, Darkstone, Vampyr_Lamia, Lord Maxim Stark\r\nTrapiki, Nakha, Feenixfly & Dezz\r\n\r\nPERMISSIONS: I am currently unable to work on or support the MODS I made for SKYRIM. Current SKYRIM modders may use the resources they find in this mod in their own mods without permission. Please credit me as is appropriate.\r\n\r\nUPDATE 1.0 to 1.1: Added glazed items and flower pots/planters to vendors. NOTE: If you installed v 1.0, you can safely replace it with this version but the items may not ever show up in the vendor inventories unless you revert to a pre-LB-ID save. Sorry about that.\r\n\r\nUPDATE 1.1 to 1.2: A code fix (I hope!) to an issue at least one person had where their game cells loaded so quickly that original pottery would spawn new versions twice or more before the script stopped normally. The insense burner\\'s glow map was also corrected. This update is backwards compatible with version 1.1, however any doubled glazed clutter already created prior to a save will continue to exist.\r\n\r\nUPDATE 1.2b : Added a version of the mod that will stop glazed clutter replacement from happening in previously unvisited areas (post \\'LB-ID normal\\' save game compatible). This WILL still auto replace pots and baskets with flower pots and planters but will no longer replace plates, goblets, decanters or bowls. All items are still available at the vendors.",
  "categoryId": "85",
  "version": "1.2",
  "author": "Little Baron",
  "createdUnix": "1331455676",
  "updatedUnix": "1332177813",
  "containsAdultContent": false,
  "uploadedBy": "LittleBaron",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44825",
      "name": "LB ID ",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12660",
      "fileName": "LB ID -12643.zip",
      "uploadedUnix": "1332177813",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/6da4ad2f12f39930e20e95354d87911dd92379215cdfb8a5f28781e090a5de33/analysis/1406768051/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LB%20ID%20-12643.zip?fid=44825&ttl=1535774714&ri=8192&rs=8192&setec=457862157fe6ea9c7922ac2c50d11115"
    }
  ]
}