{
  "modId": 12666.0,
  "modName": "Amphitheatrum Flavium BETA",
  "summary": "The Amphitheatrum Flavium, is a planned for arena for my gladiators mod.",
  "descriptionHtml": "Updates 3\r\nEverything\\'s complete, but I couldn\\'t get any npcs to attack me in the arena, they just stand there looking stupid, I tried everything, including setting them to enemy factions, I even used the default enemies, so I guess I won\\'t be releasing this mod. \r\n\r\nUpdates 2\r\nAfter many hours of piecing things together and painful mistakes and testings, seriously I felt like giving up on this mod. Anyways, I have completed the Grande Amphitheatrum Flavium, and now to add in the decorations and testing on the enemies. \r\nSorry guys but I couldn\\'t find a place to put the colosseum in Skyrim map as it\\'s really big (see image) so I put in in a new world which I created. That saves me from a great deal of problems. Check the new images i uploaded and give your comments please.\r\nLastly, the BETA arena, which I will be taking down soon and replace with the new colosseum (hopefully everything goes well) \r\n\r\nUpdates 1\r\nComing soon! The Grande Amphitheatrum Flavium. Please check out the first image and let me know what you think.\r\n\r\n\r\nIt\\'s a mod I have been working on, the Amphitheatrum Flavium, (Beta) is still a WIP mod. I added the colosseum at whiterun, the place where you slain your first dragon. I spent a great deal of time on this one, it hold 17 gladiators cells. You can walk into the colosseum (NO LOADING) and unlock any cell of your choice and fight your opponents. Or you can just unlock all 17 cell gates and challenge all of them at one go. The pull levers are in the centre of the arena and there\\'s one in the middle that opens up all the cells. I\\'m still working on it and planning to add in more decoratives and features hopefully. But at the moment, I have a problem putting in the enemies, they all fall through the elevated flooring and on the ground below. Still trying to fix this. To get into the arena, look for the knapsack at the front gate, its there by the statue of Talos. Feedbacks and suggestions are welcome. So if you don\\'t like the idea of a gladiator\\'s arena mod, fine, maybe just have it standing there in the game, it kinda looks...great against the background lol.",
  "categoryId": "24",
  "version": "1.00",
  "author": "simplesim",
  "createdUnix": "1331477618",
  "updatedUnix": "1331477686",
  "containsAdultContent": false,
  "uploadedBy": "simplesim",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42316",
      "name": "Amphitheatrum Flavium BETA",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18",
      "fileName": "Amphitheatrum Flavium BETA-12666-1-00.7z",
      "uploadedUnix": "1331477686",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/0908362bfd51a8f9c31781b9d61eac1876706ea178bcd1fb767b9d167a873072/analysis/1406743398/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Amphitheatrum%20Flavium%20BETA-12666-1-00.7z?fid=42316&ttl=1535774755&ri=8192&rs=8192&setec=347aa2564ef6765f2bfc92d0c828c96e"
    }
  ]
}