{
  "modId": 12679.0,
  "modName": "Imps More Complex Needs - German translation",
  "summary": "Dies ist die deutsche Version von Imps More Complex Needs (v. 0.25b)",
  "descriptionHtml": "Dies ist die deutsche Version von [url=http://skyrim.nexusmods.com/downloads/file.php?id=10639]Imps More Complex Needs (v. 0.25b)[/url]\r<br />\r<br />\r<br />Da die Originalversion von IMCN nicht nur einige neue Menüs und Texteinblendungen in englischer Sprache hinzufügt, sondern auch noch viele Itemnamen, in den meisten Fällen handelt sich dabei um Nahrungsmittel, ins Englische umwandelt, habe ich diese Übersetzung erstellt.\r<br />[size=4]\r<br />Wichtig:\r<br />[/size]\r<br />Mit dem letzten Update wurde die Übersetzung auf die finale Version gebracht. Damit sind die Arbeiten daran abgeschlossen. \r<br />Da Imp selbst die Mod schon seit langer Zeit nicht mehr geupdatet hat [size=5]werde auch ich nicht mehr weiter daran arbeiten und stelle auch den Support vollständig ein[/size], bis es eventuell irgendwann ein neues Update von Imp gibt.\r<br />\r<br />\r<br />Der Download enthält alle Daten der englischen Orginalversion von IMCN (v0.25b als Basis), daher braucht ihr nur diese hier zu installieren. Sollte IMCN schon installiert sein, werden die Daten durch die deutsche Version ersetzt.\r<br />\r<br />[size=4]\r<br />Beschreibung:\r<br />[/size]\r<br />\r<br />Imp&#39;s More Complex Needs v0.25b\r<br />\r<br />von\r<br />\r<br />&#39;Imp of the Perverse&#39;\r<br />\r<br />übersetzt von\r<br />\r<br />CreatorX\r<br />\r<br />\r<br />****************************************************************\r<br />Beschreibung\r<br />\r<br />\r<br />Dies ist eine realistisch-orientierte Hunger/Durst/Schlaf Mod für Skyrim. Sie fügt allen Nahrungsmitten Ernährungsinformationen aus unserer realen Welt hinzu, verleiht jedem davon Stärken sowie Schwächen und bewirkt eine Vielzahl neuer Charakterwerte und -änderungen, neben dem normalen Hunger/Durst/Schlaf.\r<br />IMCN enthält zwei Modi: &#39;Einfach&#39; und &#39;Komplex&#39;.\r<br />\r<br />\r<br />\r<br />Der &#39;Komplex&#39; Modus beinhaltet:\r<br />\r<br />\t* Sättigung - Führt zu negativen Effekten bei mehr als 100%, nimmt durch essen zu.\r<br />\r<br />\t* Kalorien - Führt zu negativen Effekten bei weniger als 0%, nimmt durch essen/trinken zu.\r<br />\r<br />\t* Flüssigkeit - Führt zu negativen Effekten bei weniger als 0%, nimmt durch essen/trinken zu.\r<br />\r<br />\t* Schlafmangel - Führt zu negativen Effekten bei mehr als 100% (8 Stunden).\r<br />\r<br />\t* Blut (falls du ein Vampir bist) - Führt zu negativen Effekten bei weniger als 0%, Boni für hohe Werte.\r<br />\r<br />\t* Protein - Führt zu negativen Effekten bei weniger als 75%, Boni bei mehr als 125%.\r<br />\r<br />\t* Nährstoffe - Führt zu negativen Effekten bei weniger als 75%, Boni bei mehr als 125%.\r<br />\r<br />\t* Alkohol - Hat sowohl positive als auch negative Effekte abhängig vom Wert (keine Veränderung bei 0%).\r<br />\r<br />\t* Koffein - Boni abhängig vom Wert (keine bei 0%).\r<br />\r<br />\t* Mentale Erschöpfung - Hat negativen Einfluss auf die Magicka bei mehr als 10%, nimmt zu wenn die Magicka aufgebraucht ist, nimmt ab wenn du schläfst oder rastest.\r<br />\r<br />\t* Körperliche Erschöpfung - Verringert die maximale Ausdauer bei mehr als 10%, nimmt zu wenn die Ausdauer aufgebraucht ist, nimmt ab wenn du schläfst oder rastest.\r<br />\r<br />\t* Moral - Boni bei mehr als 6.0, negative Effekte bei weniger als 4.0, nimmt zu oder ab abhängig von der Attraktivität der Nahrung die du isst.\r<br />\r<br />\r<br />\r<br />\r<br />Der &#39;Einfach&#39; Modus beinhaltet:\r<br />\r<br />\t* Sättigung\r<br />\r<br />\t* Kalorien\r<br />\r<br />\t* Flüssigkeit\r<br />\r<br />\t* Schlafmangel\r<br />\r<br />\t* Blut (falls du ein Vampir bist)\r<br />\r<br />\t* Koffein (neu seit v0.20)\r<br />\t\r<br />\t* Alkohol (neu seit v0.20)\r<br />\r<br />\r<br />\r<br />Positive wie negative Effekte sind in &#39;Einfach&#39; und &#39;Komplex&#39; dieselben und können detailliert eingesehen durch öffnen des +IMCN Conditions+ Items. \r<br />Eine komplette Auflistung ist auch auf der [url=http://skyrim.nexusmods.com/downloads/file.php?id=10639]Beschreibungsseite zu IMCN bei Nexus[/url] verfügbar, sowie im [url=http://forums.bethsoft.com/topic/1357444-relz-imps-more-complex-needs-2]Vorstellungs-Thema des Bethesda-Forums[/url]\r<br />\r<br />Wasser kann, an vielen Wasserquellen in Innenräumen und Häusern sowie den meisten Brunnen, in Flaschen abgefüllt oder getrunken werden. Um Wasser zu benutzen, wähle die &#39;Benutze Wasser&#39;-Kraft aus deiner Spruchliste und aktiviere sie (Y-Taste) in der Nähe der Quelle\r<br />oder Brunnens. Falls du vor hast Wasser von einem Fluss außerhalb der Stadt zu trinken oder abzufüllen, such nach Schaumwellen in der Nähe von Wasserfällen und stell dich in dessen Nähe.\r<br />Wasser kann außerdem bei Gastwirten, Khajiit Karawanen und einigen allgemeinen Händlern erworben werden. Normaler Wein ist verdünnt und kann daher auch für die Flüssigkeitszufuhr verwendet werden ohne dass es dich zu betrunken macht.\r<br />Es gibt nun auch einen Wasserbehälter, den du herstellen und wiederbefüllen kannst.(Vielen Dank an TreasureChest für das Model.)\r<br />\r<br />Kaffeebohnen können bei Khajiit Karawanen, und Teeblätter bei einigen allgemeinen Händlern erworben werden. Sie können mit abgefülltem Wasser an Lagerfeuern kombiniert werden um daraus Kaffee oder Tee zu machen.\r<br />\r<br />Ab v0.24 kann Essen verfaulen, wenn diese Option aktiviert ist. In den Grundeinstellungen ist dies deaktiviert, kann aber im Konfigurationsmenü umgeändert werden. \r<br />Rohes Fleisch wird nach 24 Stunden schlecht, gekochtes fleischhaltiges Essen nach 48 Stunden und gekochtes fleischloses Essen bzw. Gemüse nach 72 Stunden. Das meiste fleischfreie Essen, auch getrocknetes wie z.B. Brot, wird spätestens nach 5 Tagen verfaulen.\r<br />In vielen Fällen kann Fleisch getrocknet werden um es unbegrenzt haltbar zu machen. Sobald du &#39;Marise&#39;s Quest&#39; in Rifton abgeschlossen hast in der du ihr die Eisgeistzähne übergibst damit sie damit ihre Nahrung kühlen kann, wird ein Rezept, um einen magischen Eiskristall in der Schmelzhütte herzustellen,\r<br />verfügbar (es benötigt 5 Eisgeistzähne pro Kristall.) Platziere den Kristall in irgendeinem unlebendigen (und möglichst nicht respawnenden) Behälter, und du kannst dort jedes Essen verstauen, ohne dass es schlecht wird.\r<br />\r<br />Eine andere Sache, die mit 0.24 eingeführt wurde, sind persönliche Geschmäcker/Vorlieben für bestimmte Nahrungsmittel - jeder Charakter hat seine ganz eigenen Vorzüge und Abneigungen (gilt nur im &#39;Komplex&#39; Modus.) Nahrungsmittel mit einem hohen Attraktivitätswert zu essen steigert die Moral.\r<br />\r<br />Essen, was normalerweise heiß serviert wird (Steaks, Kaffee, Suppe usw.) erhält eine Steigerung des Attraktivitätswerts, wenn es in einem Gasthaus oder in der Nähe einer Feuerstelle (Stellen an denen es möglich ist Nahrung zu kochen/braten) gegessen wird.\r<br />\r<br />Rohes Fleisch zu essen, kann zu einer Lebensmittelvergiftung führen (Darmerkrankung durch Salmonellenbefall). Es vermindert deine Gesundheit, Magicka und Ausdauer, und führt zu einer doppelt so schnellen Dehydratation (Flüssigkeitsverlust).\r<br />Lebensmittelvergiftungen klingen nach einem Tag ab, oder können durch Heiltränke oder die Nutzung eines Schreins wie jede andere Krankheit geheilt werden.\r<br />\r<br />Alkohol macht dich betrunken, abhängig davon was und wie viel du trinkst. Trunkenheit wird durch einen visuellen Effekt dargestellt, welcher im Konfigurationsmenü deaktiviert werden kann. \r<br />Aktuell steigert es die Redekunst (solange du nicht zu betrunken bist), verringert die Schmiedefähigkeit ein wenig, und erhöht die Schadensresistenz ein wenig (bis zu 10% wenn du richtig &#34;voll&#34; bist.)\r<br />\r<br />Vampire brauchen nicht essen, trinken oder zu schlafen, lediglich Blut. Als Untoter, geht der Stoffwechsel auf null wenn sie untätig sind. Hat er sich einmal eines schlafenden Opfers bedient, braucht es 3 Tage bevor er dasselbe Opfer erneut befallen kann.\r<br />In &#39;Komplex&#39; Modus, gelten Moral und Müdigkeit auch für Vampire. \r<br />\r<br />Nach dem Verlassen des Inventarmenüs werden Ess- und Trink-Animationen abgespielt, sobald du irgendwas zu dir genommen hast. Das kann im Konfigurationsmenü abgestellt werden.\r<br />\r<br />Deine Bedürfnisse wechseln je nachdem wie aktiv dein Charakter ist. Ein Pferd zu reiten, ist eine gute Idee.\r<br />\r<br />Du kannst das Maßeinheiten-System im Konfigurationsmenü anpassen. In der Standarteinstellung wird alle in Prozent angezeigt, stattdessen können aber auch Kalorien Hungeranzeige stehen falls du das möchtest, und Durst in Form von Millilitern.\r<br />\r<br />Die Ernährungs-Statistik für Essen wurde der Seite &#39;NutritionData.com&#39; entnommen. Beeindruckend, da stehen jetzt Sachen über Wassergehalt, den Sattheits-Faktor und Ernährungsfaktoren für Essen, Sachen die ich mehr oder weniger so schon in älteren Versions eingebaut hatte.\r<br />\r<br />Wenn IMCN aktiviert ist, überprüft es die Rasse und das Geschlecht deines Charakters und nutzt das um Größe, Gewicht, Körperfettanteil, und die Skelettmuskulatur zu bestimmen.\r<br />Aktuell sind diese Zahlen fest, und werden nur dafür genutzt um die Werte für die Bedürfnisse festzulegen (schwerere Charaktere müssen mehr essen usw.) aber in zukünftigen Versionen sollen Boni für Körperfettanteil und die Skelettmuskulatur hinzukommen, \r<br />welche sich im Laufe der Zeit verändern werden, abhängig davon wie aktiv der Charakter ist und von den verzehrten Lebensmitteln.\r<br />\r<br />\r<br />Ich habe eine Timescale(Zeitverlaufs Geschwindigkeit)-Anpassung eingefügt. Diese Mod ist wahrscheinlich unspielbar mit der standart-Timescale-Einstellung von 20. Ich empfehle einen Wert zwischen 5 und 10.\r<br />Es gibt einen &#39;Fest&#39; Modus(die Timescale bleibt bei dem Wert, den du eingestellt hast, via Konsole oder im Menü dieser Mod) und einen &#39;Dynamisch&#39; Modus welcher, in Abhängigkeit vom Ort, unterschiedliche Timescale-Einstellungen nutzt:\r<br />\r<br />\t* Innenräume (Häuser)\r<br />\t* Außenwelt (&#34;Himmelsrand&#34;)\r<br />\t* Städte\r<br />\t* Kampf (Wird ein Kampf gestartet, ändert sich für die Zeit des Kampfes auch die Timescale)\r<br />\t* Dialoge (Funktioniert momentan nicht)\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />****************************************************************\r<br />Grundlegende Tipps:\r<br />\r<br />Versuch deinen Hunger und Durst über 0 zu halten, versuche nach einer Mahlzeit für beide mehr als 100% zu erreichen.\r<br />\r<br />Esse vor einer Schnellreise, falls du der Meinung bist, dass du danach zu hungrig sein wirst.\r<br />\r<br />Reite ein Pferd. Das verringert Kalorienverbrennung und Flüssigkeitsverlust, und beinhaltet eine gewisse Chance sich von Erschöpfungen zu erholen.\r<br />\r<br />Nutze die TIMESCALE-Anpassung. Sie kann im Konfigurationsmenü aktiviert und eingestellt werden.\r<br />\r<br />Überprüfe das +IMCN Conditions+ Menü um eine Vorstellung davon zu bekommen, welche Arten von Boni und Mali es gibt.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />****************************************************************\r<br />Essens Menü\r<br />\r<br />\r<br />In der Voreinstellung, wird das Essen nicht sofort verzehrt, wenn du dein Inventar öffnest und auf ein Nahrungsmittel klickst. Stattdessen erscheint ein Menü mit verschiedenen Optionen.\r<br /> So sieht es in etwa aus:\r<br />\r<br />\t_______________________________________________________________\r<br />\t\r<br />\t\tEssens Statistik/Mahlzeit Statistik/Vitalität\r<br />\r<br />\t\t\tSättigung: 10% / 0% / 0%\r<br />\t\t\tKalorien: 20% / 0% / -5%\r<br />\t\t\tFlüssigkeit: 3% / 0% / +10%\r<br />\r<br />\r<br />\t&#39;Essen&#39;\t&#39;Nicht Essen&#39; &#39;Mahlzeit abbrechen&#39;  &#39;Erweitert&#39;\t&#39;Spezial&#39;\r<br />\t_______________________________________________________________\r<br />\r<br />\r<br />\r<br />Der &#39;Essen&#39; Knopf lässt das Essen konsumieren (eigentlich wird es deiner aktuellen Mahlzeit hinzugefügt, welche dann konsumiert wird wenn du das Inventar komplett schließt.)\r<br />\r<br />Der &#39;Nicht Essen&#39; Knopf legt die gewählte Nahrung wieder zurück in dein Inventar.\r<br />\r<br />Der &#39;Mahlzeit abbrechen&#39; Knopf legt alle bisher gewählten Nahrungsmittel zurück ins Inventar, somit kannst du dir eine neue Mahlzeit zusammenstellen.\r<br />\r<br />Der &#39;Erweitert&#39; Knopf zeigt erweiterte Nährwerts Informationen des gewählten Nahrungsmittels, Sachen wie Nährstoff, Protein, Fett und Zuckeranteil. Es ist nur dann wirklich wichtig, wenn du den &#39;Komplex&#39; Modus benutzt, aber du kannst die Werte auch schon im &#39;Einfach&#39; Modus einsehen, falls es dich interessiert.\r<br />\r<br />Der &#34;Spezial&#34; Knopf beinhaltet ein paar spezielle Eigenschaften des Nahrungsmittels, wie die Chance davon eine Lebensmittelvergiftung zu bekommen, Reiz/Attraktivität oder den Koffein und Alkohol Anteil. Diese Werte sind sowohl im &#39;Einfach&#39; als auch im &#39;Komplex&#39; Modus von Bedeutung.\r<br />\r<br />\r<br />Was die angezeigte Statistik betrifft: Sättigung sagt aus, wie voll dein Magen ist. Ist er zu voll (mehr als 100%) erhältst du Abzüge. Kalorien beziehen sich grundlegend auf den Hunger, ein höherer Wert ist besser (zumindest bis ich eine Fettgewinnung eingebaut habe), und hat negative Auswirkungen wenn der Wert negativ ist. \r<br />Flüssigkeit bezieht sich auf Wasser und gleichermaßen auf Kalorien, du bekommst Abzüge, wenn dieser Wert negativ wird. \r<br />\r<br />Die erste Spalte (links), die Essens-Statistik, zeigt den Sättigungs-, Kalorie- oder Wassergehalt des Nahrungsmittels, das du gerade angeklickt hast. Die zweite Spalte (Mitte), die Mahlzeit Statistik, ist die Summe von alledem was du was du bisher ausgewählt hast (jedes Mal wenn du auf &#34;Essen&#34; klickst, \r<br />wird die Essenstatistik der Mahlzeitstatistik-Spalte hinzugefügt.) \r<br />Die dritte Zeile, Vitalität, zeigt die aktuellen Reserven deines Charakters (es ist die Summe von dem was dein Charakter bereits verdaut hat und von dem was er gerade verdaut).\r<br />\r<br />Wenn du eine Mahlzeit zu dir nimmst, wirst du grundsätzlich versuchen Hunger und Flüssigkeit über 100% oder so zu bekommen, ohne dabei die Sättigung auf über 100% steigen zu lassen. Der einfachste Weg das zu machen ist, indem du Essen zu deiner Mahlzeit hinzufügst bis der Wert in der zweiten Spalte plus der Wert der dritten Spalte zusammen bis zu 100% ergeben. \r<br />Wenn dein Charakter sich viel bewegt oder wenn du findest du isst zu oft, solltest du versuchen 200%+ anzustreben. Es ist auch eine gute Idee, vor einer Schnellreise über eine lange Distanz, nochmal ordentlich was zu essen, damit du nicht hungrig dein Ziel erreichst.\r<br />\r<br />\r<br />Es gibt noch eine &#34;Schnelles Essen&#34; Option im Konfigurationsmenu. Wenn sie aktiviert ist, wird ein Nahrungsmittel sofort konsumiert sobald du darauf klickst, ohne dass das Essensmenü erscheint. Ernährungsinformationen werden dir dann nicht angezeigt, aber du wirst benachrichtigt falls das letzte Essen dich vollkommen gesättigt hat. \r<br />Kombiniere das mit der Option &#34;Realism Mode&#39; (wird unter Anzeige im Konfigurationsmenü aktiviert) und du wirst ein umfassendes, realistisches Skyrim-Erlebnis bekommen (denn Dovahkiin hat schließlich keinen Pipboy um seinen Arm geschnallt).\r<br />\r<br />[size=4]\r<br />Tipp:\r<br />[/size]\r<br />Ich empfehle nach der Installation [url=http://skyrim.nexusmods.com/downloads/file.php?id=6]BOSS[/url] drüber laufen zu lassen, um die Ladereihenfolge zu optimieren. In jedem Fall sollte die &#39;IMCN - Overrides.esp&#39; bei jedem Spielstart nach &#39;Imp&#39;s More Complex Needs.esm&#39; geladen werden.\r<br />\r<br />[size=3]\r<br />Weitere Modübersetzungen von mir:\r<br />[/size]\r<br />\r<br />-[url=http://skyrim.nexusmods.com/mods/27182]Realistic Needs and Diseases[/url]\r<br />-[url=http://skyrim.nexusmods.com/mods/29732]ERSO _ Erkeil Real Skyrim Overhaul[/url]\r<br />-[url=http://skyrim.nexusmods.com/mods/31598]Drinking Fountains of Skyrim[/url]\r<br />\r<br />-[url=http://skyrim.nexusmods.com/mods/29405]HBE - Hardcore and Balanced Experience (wird nicht weitergeführt)[/url]\r<br />",
  "categoryId": "24",
  "version": "0.25bFinal",
  "author": "CreatorX",
  "createdUnix": "1331485426",
  "updatedUnix": "1352217514",
  "containsAdultContent": false,
  "uploadedBy": "CreatorX",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42634",
      "name": "Imps_More_Complex_Needs_v0_23_de-ger_alpha03",
      "version": "0.23Alpha3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "85",
      "fileName": "Imps_More_Complex_Needs_v0_23_de-ger_alpha03-12679.7z",
      "uploadedUnix": "1331554128",
      "modVersion": "0.23Alpha3",
      "virusScanUrl": "https://www.virustotal.com/file/dc1ab446330d08a55bcb97e4230c6bb497f561c144ddc3a56c18489926bdb932/analysis/1406745191/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imps_More_Complex_Needs_v0_23_de-ger_alpha03-12679.7z?fid=42634&ttl=1535774780&ri=8192&rs=8192&setec=1c33aa3216c5800f4dc082110d0bcb40"
    },
    {
      "fileId": "44204",
      "name": "Imps_More_Complex_Needs_v0_24_de-ger_alpha04",
      "version": "0.24Alpha4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "308",
      "fileName": "Imps_More_Complex_Needs_v0_24_de-ger_alpha04-12679.7z",
      "uploadedUnix": "1332010175",
      "modVersion": "0.24Alpha4",
      "virusScanUrl": "https://www.virustotal.com/file/e8d6b3ee4f2fa79c71b81dcbd74cda9cd182262b254d6bb92b2bfb95fd29cbea/analysis/1406753414/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imps_More_Complex_Needs_v0_24_de-ger_alpha04-12679.7z?fid=44204&ttl=1535774780&ri=8192&rs=8192&setec=ea3a01822a6f9af4142ad6bcae11c0f0"
    },
    {
      "fileId": "44497",
      "name": "Imps_More_Complex_Needs_v0_25_de-ger_alpha05",
      "version": "0.25Alpha5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1793",
      "fileName": "Imps_More_Complex_Needs_v0_25_de-ger_alpha05-12679.7z",
      "uploadedUnix": "1332092618",
      "modVersion": "0.25Alpha5",
      "virusScanUrl": "https://www.virustotal.com/file/73a2cbffa9a40fadff3b95547e1e4e5b6a3d178a9307e833639533e6e9e506f5/analysis/1406766445/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imps_More_Complex_Needs_v0_25_de-ger_alpha05-12679.7z?fid=44497&ttl=1535774781&ri=8192&rs=8192&setec=bfbdda86fbfbca81208153c5d4418981"
    },
    {
      "fileId": "44881",
      "name": "Imps_More_Complex_Needs_v0_25b_de-ger_alpha06",
      "version": "0.25bAlph6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1798",
      "fileName": "Imps_More_Complex_Needs_v0_25b_de-ger_alpha06-12679.7z",
      "uploadedUnix": "1332187013",
      "modVersion": "0.25bAlph6",
      "virusScanUrl": "https://www.virustotal.com/file/a5caaa27ff3b2f2c6c3de0f192c100ab5900dd0b5ce4c15f6f6e997dface3979/analysis/1406768469/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imps_More_Complex_Needs_v0_25b_de-ger_alpha06-12679.7z?fid=44881&ttl=1535774782&ri=8192&rs=8192&setec=d4aae050e04e15cd5996d944333c08d0"
    },
    {
      "fileId": "45762",
      "name": "Imps_More_Complex_Needs_v0_25b_de-ger_alpha07",
      "version": "0.25bAlph7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1796",
      "fileName": "Imps_More_Complex_Needs_v0_25b_de-ger_alpha07-12679.7z",
      "uploadedUnix": "1332443955",
      "modVersion": "0.25bAlph7",
      "virusScanUrl": "https://www.virustotal.com/file/8e3aeba400eba28d8f1acf748d1f8cba8552a5f881d5a98fa61b9bc74ffc80cd/analysis/1406773489/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imps_More_Complex_Needs_v0_25b_de-ger_alpha07-12679.7z?fid=45762&ttl=1535774782&ri=8192&rs=8192&setec=d3e643528de98bc704f4e27b637a76dc"
    },
    {
      "fileId": "49448",
      "name": "Imps_More_Complex_Needs_v0_25b_de-ger_alpha08",
      "version": "0.25bAlph8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1796",
      "fileName": "Imps_More_Complex_Needs_v0_25b_de-ger_alpha08-12679.7z",
      "uploadedUnix": "1333401126",
      "modVersion": "0.25bAlph8",
      "virusScanUrl": "https://www.virustotal.com/file/a0574d3531c03fbd824d290315ca94cd842ee9b79ba487d03ff4e4a772de9cd0/analysis/1406793971/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imps_More_Complex_Needs_v0_25b_de-ger_alpha08-12679.7z?fid=49448&ttl=1535774783&ri=8192&rs=8192&setec=cd77bb08c9a9ba0f5f4301857d1856ed"
    },
    {
      "fileId": "57561",
      "name": "Imps_More_Complex_Needs_v0_25b_de-ger_beta01",
      "version": "0.25bBeta1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1796",
      "fileName": "Imps_More_Complex_Needs_v0_25b_de-ger_beta01-12679.7z",
      "uploadedUnix": "1335786223",
      "modVersion": "0.25bBeta1",
      "virusScanUrl": "https://www.virustotal.com/file/7b1e4cd8b2890d7e95da54ef0e843dfe2422d88f1fb779a1701bdd6470c48a7f/analysis/1406856484/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imps_More_Complex_Needs_v0_25b_de-ger_beta01-12679.7z?fid=57561&ttl=1535774783&ri=8192&rs=8192&setec=167e4ed9224288331268d8799bf36150"
    },
    {
      "fileId": "65852",
      "name": "Imps_More_Complex_Needs_v0_25b_de-ger_beta02b",
      "version": "0.25bBeta2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1796",
      "fileName": "Imps_More_Complex_Needs_v0_25b_de-ger_beta02b-12679-0-25bBeta2.7z",
      "uploadedUnix": "1338809434",
      "modVersion": "0.25bBeta2",
      "virusScanUrl": "https://www.virustotal.com/file/776be13aaf1b5bb360f53090710f3fbda0e73961c0f1f1ebba265c0c222da6ff/analysis/1406937130/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imps_More_Complex_Needs_v0_25b_de-ger_beta02b-12679-0-25bBeta2.7z?fid=65852&ttl=1535774784&ri=8192&rs=8192&setec=210d2c25ada0f987aac70411d33db8a5"
    },
    {
      "fileId": "97818",
      "name": "Imps_More_Complex_Needs_v0_25b_de-ger_final",
      "version": "0.25bFinal",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1796",
      "fileName": "Imps_More_Complex_Needs_v0_25b_de-ger_final-12679-0-25bFinal.7z",
      "uploadedUnix": "1352217514",
      "modVersion": "0.25bFinal",
      "virusScanUrl": "https://www.virustotal.com/file/3fede60a6889e079fa397ef62e4496b80445fe08a1caa4443154c18d5772ee5e/analysis/1407252064/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imps_More_Complex_Needs_v0_25b_de-ger_final-12679-0-25bFinal.7z?fid=97818&ttl=1535774784&ri=8192&rs=8192&setec=957fb1a0f416c4b076dbf179e19e822d"
    }
  ]
}