{
  "modId": 12671.0,
  "modName": "Complete Crafting Overhaul - Traduzione italiana",
  "summary": "This is only a translation into Italian of the original mod.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/downloads/file.php?id=8003]original mod[/url].\r\nThe original mod completely changes the crafting system by adding new objects, new ingredients and much more.\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size]\r\n\r\n[color=red][b]ATTENZIONE![/b]\r\nQuesta è solo la traduzione italiana del mod originale che trovate [url=http://skyrim.nexusmods.com/downloads/file.php?id=8003]qui[/url].[/color][/center]\r\n\r\n[center][color=GREEN][size=+4]UNA TRADUZIONE DRAGONBORN ITALIA[/size][/color][/center]\r\n\r\n[color=green][b]DESCRIZIONE[/b][/color]\r\nUna serie di modifiche a tutto il sistema della forgiatura. Con questa mod sarà possibile forgiare frecce, armi ed armature prima non possibili (come quelle delle fazioni, ma solo dopo averle ottenute), e molte altre utili cose. Inoltre prevede un ribilanciamento totale degli ingredienti richiesti nelle creazioni.\r\n\r\nL\\'autore di questa mod specifica che affinchè il tutto funzioni correttamente, dovrete avere anche le seguenti mod:\r\n- Smithing Perks Overhaul [Balanced version]\r\n- Weapons and Armor Fixes [including the optional Crafting Hacks]\r\n\r\n[color=green][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n[color=green][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!\r\n",
  "categoryId": "79",
  "version": "1.12",
  "author": "klop",
  "createdUnix": "1331481165",
  "updatedUnix": "1331481165",
  "containsAdultContent": false,
  "uploadedBy": "klopklop",
  "primaryFile": null,
  "files": []
}