{
  "modId": 12687.0,
  "modName": "Tales of Lycanthropy - Werewolf Overhaul",
  "summary": "This mod features the return of the Sanies Lupinus disease from Morrowind, moon based werewolf transformations (5 settings), new transformation animations (4 settings) with an easy to use configuration ring. The new re-written modules feature high stability and compatibility and were all designed to work together with the Dawnguard DLC. Testing: OK",
  "descriptionHtml": "[center][img]http://www.spwned.net/pics/tol/Nexus_logo_01.png[/img][/center]\r\nCreated by Brevi | www.spwned.net\r\n\r\nThis mod features the return of the Sanies Lupinus disease from Morrowind, moon based werewolf transformations (5 settings), new transformation animations (4 settings) with an easy to use configuration ring. The new re-written modules feature high stability and compatibility and were all designed to work together with the Dawnguard DLC.\r\n\r\n[center][img]http://www.spwned.net/pics/tol/Nexus_title_01.png[/img][/center]\r\n\r\n[center][img]http://www.spwned.net/pics/tol/Nexus_moon.png[/img][/center]\r\n\r\n[size=6]News flash: Dawnguard DLC released![/size]\r\nI\\'m happy to say that we are ready to go with Dawnguard compatibility on day one! The new modules were all designed to work together with the Dawnguard DLC, and play testing shows no conflicts or problems at all. I wish you guy and girls a great and atmospheric experience with the new content!\r\n\r\n\r\n[size=6]I. Introduction[/size]\r\nLycanthropy is the disease that causes a person to turn into a were-creature. There are several different strains of the disease, most are localized to certain areas of Tamriel, but the most common strain, which turns men and mer into werewolves is reputed to exist in all areas of Tamriel, and Skyrim is no exception.\r\n\r\n\r\n[size=6]II. Modules[/size]\r\n\r\n[size=4]ToL - Core (Released)[/size]\r\nCompletely independent from Bethesda scripts - very high compatibility.\r\nStandalone and can function fully without the rest of the modules.\r\n\r\n[ ] Configuration ring that automatically gets added to your character.\r\n[list][*]Select the chances for the lunar transformation feature. 5 settings available.\r\n[*]Select the animation of your choice for Lunar based transformations. 4 settings available.\r\n[*]Select the Howl which you would like to use during your next transformation. The 3 original choices from Bethesda.\r\n[*]Option to immediately infect your character with lycanthropy.\r\n[*]Option to immediately cure your character from lycanthropy.[/list]\r\n\r\n[ ] Sanies Lupinus disease for all werewolves NPCs in Skyrim.\r\n[list][*]Any transformed NPC will be able to spread the disease to the player from now on. This includes werewolves added by custom mods such as Monster Mod (already tested and working).\r\n[*]The disease (once developped) will be equal to gaining beasthood from the Companions. You get the Beast Form ability, disease immunity and the rest.[/list]\r\n\r\n[ ] Forceful transformation at 8 pm based on the cycles of the moon. The 5 possible settings are:\r\n[list][*]Transform every night.\r\n[*]High random chance + full moons. 0/5/25/50/100\r\n[*]Low random chance + full moons. 0/1/10/15/100 (Default setting.)\r\n[*]Only on full moons. 0/0/0/0/100\r\n[*]Lunar transformations disabled.[/list]\r\nMoon phases are reported to the player at 6 pm. If the screen flashes at this moment then the player will shift into a beast on that night (designed to work as a warning). When your transformation is triggered by the moon it will always last till 5 am in the morning.\r\n\r\n\r\n[ ] New animation sequence complete with sound effects for the more stressful lunar transformations. The 4 possible settings are:\r\n[list][*]Random delay + heartbeat + new transformation animations + horror screams.\r\n[*]Random delay + heartbeat + new transformation animations. (Default setting.)\r\n[*]Random delay + heartbeat + vanilla transformation style.\r\n[*]Vanilla transformation style.[/list]\r\n\r\n\r\n[size=4]ToL - SKSE (Released)[/size]\r\nCompletely independent from Bethesda scripts - very high compatibility.\r\nStandalone and can function fully without the rest of the modules.\r\nRequires the latest version of SKSE installed! ([url=http://skse.silverlock.org]http://skse.silverlock.org[/url]) Make sure that you start the game with the SKSE executable. This means you either run skse_loader.exe or that you select it in Nexus Mod manager like this:\r\n[img]http://www.spwned.net/pics/skyrim/skse.png[/img]\r\n\r\nThis module provides two handy keybinds for all lycanthrope characters.\r\n(Both human and beast form) - V key - Toggles nighteye.\r\n(Only in beast form) - B key - Cycles between werewolf howls. (Works instantly even in combat!)\r\n\r\nYou will no longer need to rely on simply one of the three werewolf howls, but instead you can strategically switch depending on the situation or even combine their effects. The keybinds are decently responsive with a 0.80 second cooldown, but button smashing is not advised... patience.\r\n\r\n\r\n[size=6]III. Sound & Music[/size]\r\nSix classic music themes imported from the old Morrowind McAsmod werewolf mod. View the credits section for more info on this. Additionally, I\\'ve created 9 new transformation sound effects using free resource material from the following great sites:\r\nhttp://www.shockwave-sound.com\r\nhttp://soundbible.com\r\n\r\n\r\n[size=6]IV. Troubleshooting[/size]\r\nAt present time, there is no common problems or mistakes with the installation. Just keep these in mind when installing the new modules:\r\n\r\n[list][*]You must have the previous versions of Tales of Lycanthropy FULLY uninstalled before adding any of the new modular content.\r\n[*]If you had the old ToL installed before then a new game is highly recommended but a CLEAN SAVE is the minimum requirement. \r\n[/list]\r\n\r\n\r\n[size=6]V. Recommended Mods[/size]\r\nUse Tales of Lycanthropy - Core together with the following great mods for the best effect and please don\\'t forget to endorse the authors of these impressive projects. (Note that these mods are fully tested for compatibility.)\r\n[list]\r\n[*]Realistic Werewolves: Sound files - [url=http://skyrim.nexusmods.com/mods/13779]http://skyrim.nexusmods.com/mods/13779[/url]\r\n[*]Sounds of Skyrim - The Wilds by Cliffworms - [url=http://skyrim.nexusmods.com/mods/10886]http://skyrim.nexusmods.com/mods/10886[/url]\r\n[*]Sounds of Skyrim - The Dungeons by Cliffworms - [url=http://skyrim.nexusmods.com/mods/8601]http://skyrim.nexusmods.com/mods/8601[/url]\r\n[*]Sounds of Skyrim - Civilization - Cliffworms - [url=http://skyrim.nexusmods.com/mods/20193]http://skyrim.nexusmods.com/mods/20193[/url]\r\n[*]Alternate Start - Live Another Life by Arthmoor -[url=http://skyrim.nexusmods.com/mods/9557]http://skyrim.nexusmods.com/mods/9557[/url]\r\n[/list]\r\n\r\n[size=6]VI. Known Problems[/size]\r\nNone at the moment. \r\n\r\n\r\n[size=6]VII. Contribute[/size]\r\nPlease add suggestions and feedback that you feel could help. Note that older versions are no longer in development so reporting problems affecting them is not helpful.\r\n\r\n\r\n[size=6]VIII. Compatibility[/size]\r\nThe Core and the SKSE plugins are highly compatible with any other mod so feel free to experiment. \r\nThe new modules were all designed to work together with the Dawnguard DLC, but they will work fine with vanilla Skyrim as well. Dawnguard is fully tested with the mod and everything is functioning well.\r\n\r\n\r\n[size=6]IX. Special thanks[/size]\r\nI would like to take a moment to thank everyone who endorsed and / or commented my mod on the Nexus site. The following users have contributed especially a lot to this mods development, thanks again!\r\n\r\nAedilesBeadle\r\nDetman101\r\nHidden_7\r\nJusey1\r\nnskin039\r\nredwes\r\nstuffer\r\nT3alrose\r\nTovias\r\nXahstur\r\nXenonychus\r\n\r\n\r\n[center][img]http://www.spwned.net/pics/tol/Nexus_title_02.png[/img][/center]\r\nBrevi from the www.spwned.net gaming community. \r\nJeremy Hamilton - Werewolf textures.\r\nMy tester: Maryen. Kisses and hugs. ;)\r\n\r\nMorrowind McAsmod werewolf mod team for the sound & music files! Visit their website: [url=http://werewolves.skaarj.com]http://werewolves.skaarj.com[/url]\r\nFull list of credits of the original McAsmod here: [url=http://werewolves.skaarj.com/index.php?bg=1&page=credits]http://werewolves.skaarj.com/index.php?bg=1&page=credits[/url]\r\nNote however that none of the original McAsmod team members worked on this mod.\r\n\r\nBethesda for Skyrim and the Creation Kit.\r\n\r\n\r\n[center][img]http://www.spwned.net/pics/tol/Nexus_title_03.png[/img][/center]\r\n[list][*]2012.08.03. ToL SKSE Version 1.0\r\n[*]2012.07.27. ToL The Howling Natural 1.2 - The hand and feet areas are much more detailed and corrected where it was needed...\r\n[*]2012.07.27. ToL Core Version 1.5 - Dependency on the installed version of Skyrim will no longer prevent the mod from working. Small changes to the text of the menu.\r\n[*]2012.07.17. ToL Core Version 1.4 - The menu has been reworked to appear optimal even on low resolutions.\r\n[*]2012.07.16. ToL Core Version 1.3 - On a popular demand the config spell is now replaced by a magical ring. The ring is called \\'Ancient Silver Ring\\' and equipping it gets you into the menu. The ring will only be added to your inventory once per character, so you can drop it once the configuration is complete. You can re-add it with the console if the need arises.\r\n[*]2012.07.15. ToL Core Version 1.2 - Corrected a mistake in the file package. Scripts folder renamed.\r\n[*]2012.07.15. ToL Core Version 1.1\r\n[/list]\r\n\r\nBefore the modular setup:\r\n[list][*]2012.04.13. Version 2.4 - Followers will work as intended. (If you had a lycanthrope follower before this version, then use the mediate dialogue once.) Call of the Wild will now work every time, event werewolves will not howl during the day, werewolf hunters are much stronger.\r\n[*]2012.04.08. Version 2.3c - No changes to the esp or the scripts. The mesh files for the NPCs are now correctly included in the bsa file. The grey face bug will be gone.\r\n[*]2012.04.08. Version 2.3b - Followers that are werewolves without you being one will now correctly trigger the guards to attack when transformed.  When the werewolf follower is set to wait, the guards will no longer be hostile to you if you approach alone.\r\n[*]2012.04.05. Version 2.3 - Major optimization on the follower scripts and dialogue. Included a new bugfix dialogue option named \\'Meditate.\\' for werewolf followers.\r\n[*]2012.04.04. Version 2.2b - Fixes a coding mistake in the werewolf player script.\r\n[*]2012.04.04. Version 2.2 - NPC infection and werewolf follower support, slight toning of the npc transformations and the player werewolf script.\r\n[*]2012.04.02. Version 2.1 - This version is a must get! Fixes several bugs that came with the new animal feeding system, grammar problems, slight tuning to the werewolf events, infected hunters and the werewolf AI.\r\n[*]2012.04.01. Version 2.0b - Hotfix for the feral beast blood health regen problem.\r\n[*]2012.03.31. Version 2.0 - Backup your save game! This version is a complete rework of everything, introducing new features like 2 new werewolf archetypes, detailed bloodlust, 3 new transformation animations, 2 new werewolf powers, customization options like never before and more...\r\n[*]2012.03.23. Version 1.8c - Back to 6 music songs for now.\r\n[*]2012.03.23. Version 1.8b - Re-compiled all music files at a better quality. No changes in the rest of the files.\r\n[*]2012.03.23. Version 1.8 - The npc events only happen after level 10, otherwise the player would be too weak. werewolf Hunters introduced, they can track you anywhere outside of cities and dungeons if you are a werewolf. Silver weapons burn turned werewolves for 30 damage. For non-werewolves: new hunting NPC werewolves in special events mostly on full moons but 3/4 moon also leave a small chance, they can happen anywhere in Tamriel outside of cities and dungeons. Many different types of werewolves for you to discover, sometimes they will even hunt in packs. The necklace system is changed, keeping them equipped is no longer needed. 4 new howl sounds that you will hear when werewolves are after you. 3 new atmospheric music titles that will play when you are a werewolf. NPC wanderer lycanthropes now only turn on the nights of the full moon or with small chance on 3/4 moon.\r\n[*]2012.03.20. Version 1.7b - Further fine tuning of the music system. The Companion Rampage quest (when you first turn into a werewolf) is scripted better.\r\n[*]2012.03.20. Version 1.7 - The werewolf themed music will never play now when it is not supposed to. Disease renamed to Sanies Lupinus. NPC werewolves will never talk like a human any more. NPC werewolves will no longer attack player werewolves.\r\n[*]2012.03.16. Version 1.6b - Fixes the Ring of Hircine because it was totally broken. No changes made to the .esp, so updating will not cause problems on save games.\r\n[*]2012.03.16. Version 1.6 - Fixes a lot of bugs caused by a failing Creation Kit save function. Recompiled all scripts, re-saved all properties.\r\n[*]2012.03.15. Version 1.5b - Fixes a major bug that caused the player not to transform on his/her first night after joining the Companions Guild.\r\n[*]2012.03.15. Version 1.5 - A ton of optimization and bug fixing. New effect for transforming back into a human, disease now has 100% chance of applying, lifedetect howl now only affects humans and has 500 feet range. \r\n[*]2012.03.14. Version 1.4b Hotfix - Fixes the typo in \\'Crescent Moon Amulet\\' and \\'Medallion\\'. Requires version 1.4 already installed.\r\n[*]2012.03.14. Version 1.4 - 4 different amulets added to let players fully customize the moon cycle system. Complete werewolf stat re-balance. Reworked howl system.\r\n[*]2012.03.13. Version 1.3 - Moon phases fully integrated and introduced into the mod. Fatality bug fixed. Ring of Hircine redesigned.\r\n[*]2012.03.12. Version 1.1b - Fixed the neck seam on the Nord male werewolf near Windhelm. Fixed the bug where NPCs would not equip their armor after turning back to human form.\r\n[*]2012.03.12. Version 1.1 - A lot of fixes like: the mod now automatically sets itself up even if you were a companion werewolf before installing it. Better NPC werewolf scripts. Fixes the rare bug that your weapon would remain equipped as a werewolf. Readme added to the file.\r\n[*]2012.03.11. Version 1.0 - Release.\r\n[/list]\r\n\r\n\r\n[center][img]http://www.spwned.net/pics/tol/Nexus_title_04.png[/img][/center]\r\n\r\n[size=6]I. Werewolf models: The Howling[/size]\r\n\r\n\r\n[center][img]http://www.spwned.net/pics/skyrim/howling_a2/thehowling_naturalistic2.png[/img][/center]\r\n\r\nUnedited full screen screenshots: The Howling - Naturalistic Werewolves Skin:\r\n[url=http://www.spwned.net/pics/skyrim/howling_a2/ss00.jpg]SS00.JPG[/url]\r\n[url=http://www.spwned.net/pics/skyrim/howling_a2/ss01.jpg]SS01.JPG[/url]\r\n[url=http://www.spwned.net/pics/skyrim/howling_a2/ss02.jpg]SS02.JPG[/url]\r\n[url=http://www.spwned.net/pics/skyrim/howling_a2/ss03.jpg]SS03.JPG[/url]\r\n[url=http://www.spwned.net/pics/skyrim/howling_a2/ss04.jpg]SS04.JPG[/url]\r\n\r\n[center][img]http://www.spwned.net/pics/skyrim/howling_b/thehowling.png[/img][/center]\r\n\r\nUnedited full screen screenshots: The Howling:\r\n[url=http://www.spwned.net/pics/skyrim/howling_b/ss00.jpg]SS00.JPG[/url]\r\n[url=http://www.spwned.net/pics/skyrim/howling_b/ss01.jpg]SS01.JPG[/url]\r\n[url=http://www.spwned.net/pics/skyrim/howling_b/ss02.jpg]SS02.JPG[/url]\r\n[url=http://www.spwned.net/pics/skyrim/howling_b/ss03.jpg]SS03.JPG[/url]\r\n[url=http://www.spwned.net/pics/skyrim/howling_b/ss04.jpg]SS04.JPG[/url]\r\n[url=http://www.spwned.net/pics/skyrim/howling_b/ss05.jpg]SS05.JPG[/url]\r\n[url=http://www.spwned.net/pics/skyrim/howling_b/ss06.jpg]SS06.JPG[/url]\r\n\r\n[center][img]http://www.spwned.net/pics/tol/thehowling_reference.png[/img][/center]\r\n\r\n\r\n[size=6]II. Companion Circle Followers Redone[/size]\r\n- This addon is no longer supported. -\r\n\r\n[b]Required mods:[/b][list]\r\n[*]Calientes Female Body Mod by Caliente\r\n[*]Calientes / Official CBBE Face Pack\r\n[*]Calientes / Feminine Brows\r\n[*]ApachiiSkyHair by Apachii\r\n[*]Remodeled Armor CBBEv3 by MAK\r\n[*]The Eyes Of Beauty by Gabriel Mailhot\r\n[/list]\r\n\r\nNew outfit and looks for Aela, Farkas and Vilkas. They will now scale with the player up to level 100. Vilkas uses heavy armor and 2h sword, Farkas heavy armor 1h sword + shield, Aela bow + dagger and shield. Their AI and skill scaling will be better balanced. Screenshots:\r\n\r\n[center][img]http://www.spwned.net/pics/tol/companions1.png[/img][/center]\r\n\r\n[center][img]http://www.spwned.net/pics/tol/companions2.png[/img][/center]\r\n\r\n[center][img]http://www.spwned.net/pics/tol/companions3.png[/img][/center]",
  "categoryId": "79",
  "version": "1.5",
  "author": "Brevi",
  "createdUnix": "1331492801",
  "updatedUnix": "1348565238",
  "containsAdultContent": false,
  "uploadedBy": "spwned",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51650",
      "name": "03 Companion Circle Followers Redone 1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1067",
      "fileName": "02 Companion Circle Followers Redone 1_2-12687.zip",
      "uploadedUnix": "1333983578",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/91984e039c089524e8f3a49a8eb63f463109ad03db216f28f4311570471ea29d/analysis/1406806102/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/02%20Companion%20Circle%20Followers%20Redone%201_2-12687.zip?fid=51650&ttl=1535774805&ri=8192&rs=8192&setec=86f5adeb0de13b9362d9f311dac208e6"
    },
    {
      "fileId": "51651",
      "name": "04 Companion Circle Followers Redone - Wolf armor for Aela",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "03 Companion Circle Followers Redone - Wolf armor for Aela-12687.zip",
      "uploadedUnix": "1333983972",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3fd51e4a2c9da3917101f8848eb5753b68578f2f66ed178f266a1dd63db79134/analysis/1406806102/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/03%20Companion%20Circle%20Followers%20Redone%20-%20Wolf%20armor%20for%20Aela-12687.zip?fid=51651&ttl=1535774806&ri=8192&rs=8192&setec=53d1f3dc53a979f24115f613625e852e"
    },
    {
      "fileId": "52704",
      "name": "01 Werewolf Overhaul v2_4",
      "version": "2.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "64287",
      "fileName": "Werewolf Overhaul v2_4-12687-2-4.zip",
      "uploadedUnix": "1334274528",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/c2b5d0ed35e149a86fc2f33f258b0a737ecc37bc99b9567c12958f267fead8a5/analysis/1406812529/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Werewolf%20Overhaul%20v2_4-12687-2-4.zip?fid=52704&ttl=1535774806&ri=8192&rs=8192&setec=1b6277b1e73ac52d4cbb9efd135c31c1"
    },
    {
      "fileId": "55982",
      "name": "02 Werewolf Overhaul v2_4 Source Code",
      "version": "2.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "41",
      "fileName": "Werewolf Overhaul v2_4 Source Code-12687.zip",
      "uploadedUnix": "1335290376",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/8293acaf8e77f5fbbe7026a8c5600aa57ff93a570ef8830ffea5f96ff94fd613/analysis/1406838544/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Werewolf%20Overhaul%20v2_4%20Source%20Code-12687.zip?fid=55982&ttl=1535774806&ri=8192&rs=8192&setec=00aced3d4623312994879f0aba913bc3"
    },
    {
      "fileId": "73990",
      "name": "02 New werewolf model and textures - The Howling",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5013",
      "fileName": "02 New werewolf model and textures - The Howling-12687-1-1.zip",
      "uploadedUnix": "1342181738",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/25a67a0a4a4afe2e8a5d8014c1b5da1f57aaf8d8ca1b4937aeea90f40efa1400/analysis/1407019701/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/02%20New%20werewolf%20model%20and%20textures%20-%20The%20Howling-12687-1-1.zip?fid=73990&ttl=1535774807&ri=8192&rs=8192&setec=5ffbc45c7d8f1df1595b93c8914f910f"
    },
    {
      "fileId": "76878",
      "name": "01 Tales of Lycanthropy Modular - Core v1_5",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6421",
      "fileName": "Tales of Lycanthropy Modular - Core v1_5-12687-1-5.zip",
      "uploadedUnix": "1343398958",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/7a491e038b5b006429b4a421a3e8aa4f09fb4c235dbf51bb9491e1a69ff22265/analysis/1407049272/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tales%20of%20Lycanthropy%20Modular%20-%20Core%20v1_5-12687-1-5.zip?fid=76878&ttl=1535774808&ri=8192&rs=8192&setec=b0faf6745aaa0a33acfd082b3953e171"
    },
    {
      "fileId": "76914",
      "name": "01 New werewolf model and textures - The Howling Natural",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1618",
      "fileName": "01 New werewolf model and textures - The Howling Natural-12687-1-2.zip",
      "uploadedUnix": "1343410196",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/f32817c4016f777697c5bb2bef9f4b19a562fd39a818f57256bedeb3d5bf6120/analysis/1407049924/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/01%20New%20werewolf%20model%20and%20textures%20-%20The%20Howling%20Natural-12687-1-2.zip?fid=76914&ttl=1535774808&ri=8192&rs=8192&setec=ed8c517a5f922b206962cdd455adbcd0"
    },
    {
      "fileId": "78336",
      "name": "02 Tales of Lycanthropy Modular - SKSE v1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Tales of Lycanthropy Modular - SKSE v1_0-12687-1-0.zip",
      "uploadedUnix": "1343945467",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f7277b5eaf079b0738d3a76a712cac88f51ec65f457622a7339d74c0b3368c2b/analysis/1407064922/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tales%20of%20Lycanthropy%20Modular%20-%20SKSE%20v1_0-12687-1-0.zip?fid=78336&ttl=1535774809&ri=8192&rs=8192&setec=369d3013e699ecd82f2698981ccc0616"
    },
    {
      "fileId": "90373",
      "name": "03 Source Code - Core Module v1_5",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "01 Tales of Lycanthropy Modular - Core v1_5-12687-1-5.zip",
      "uploadedUnix": "1348564923",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/12341ea0c2fa005aa62b8612d5eb2280935ddad31ec622b76f570cd3a38b777e/analysis/1407186009/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/01%20Tales%20of%20Lycanthropy%20Modular%20-%20Core%20v1_5-12687-1-5.zip?fid=90373&ttl=1535774809&ri=8192&rs=8192&setec=cda0aee6e0aa4ad17e54026d1f27af0e"
    },
    {
      "fileId": "90375",
      "name": "04 Source Code - SKSE Module v1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "04 Source Code - SKSE Module v1_0-12687-1-0.zip",
      "uploadedUnix": "1348565238",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/786f8840abf573db076ab01ad0c64bae08306dc0f46e3cc9d0e165ba5aee74b5/analysis/1407186010/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/04%20Source%20Code%20-%20SKSE%20Module%20v1_0-12687-1-0.zip?fid=90375&ttl=1535774809&ri=8192&rs=8192&setec=18f74ed8fa26d881cf2a51823d2419f6"
    }
  ]
}