{
  "modId": 12694.0,
  "modName": "E55 Female Body Replacer",
  "summary": "A Female Body Replacer for Skyrim",
  "descriptionHtml": "[img]http://static.skyrim.nexusmods.com/downloads/images/12694-1-1331498273.png[/img]\r\n\r\nThis is a Female Body replacer for Skyrim\r\n\r\nPLEASE READ THE FOLLOWING INFORMATION CAREFULLY BEFORE INSTALLING THIS MOD.  \r\n\r\nIf you are already using another body replacer or beauty mod,  installation of our body textures is going to write over most if not all of the previous body textures / beauty mod files.  We recommend that you use only our files for this mod - otherwise you will have seam issues.\r\n\r\nIf you decide you want to continue using the beauty mod you have installed, then you will need to carefuly examine all the files our mod will install.  There is a list further down the page.\r\n\r\n\r\nThe files should work with NMM, however,  If you are interested in altering your game with mods, you should educate yourself, at the very least, to know what files you have installed and what they are altering in your game.  There are literally hundreds of thousands of mods between the nexus and the steam workshop.  Knowing this, it should not come as a surprise that we cannot possibly know or anticipate what all of those mods do, change or how they will interact with one another.  We do our best to let our audience know what to look out for but, in the end, it is your responsibility as the game player, to know what you have installed and what those files are altering in your game.  The game developers, on the other hand, are able (for the most part) to see that the mods (dlc) they create ARE compatible with the base game THEY created.  They are a single unified team and as such are able to communicate with one another.  Hundreds of thousands of modders cannot do this.  The reasons SHOULD be obvious.\r\n\r\nA Note on the team\\'s aesthetic goals:\r\n\r\nOur goal is not to provide every possible breast or hip size but, instead, one body with some variation that meets the aesthetic desires of most people.  There are other body mods that allow breast expansion in multitudes.  There are no further variations planned at this time.\r\n\r\nFinally, by downloading this package you are attest that you have read and understand the \\'E55 user license agreement.txt\\' that is included with every package and posted on this page in the Distribution Permissions section.  I detest having to include this but past experiences have made it necessary.\r\n\r\n_____________________________________________________________________________________________________\r\n\r\n\r\nE55 Current Features:\r\n\r\n- New Feet (from scratch) with separate toenail meshes\r\n- Edited Vanilla hands with separate fingernail meshes\r\n- 0 and 1 meshes that morph using the character generator weight slider\r\n- New weighting for all body parts (see \\'technical notes\\' for more info)\r\n- nearly seamless textures\r\n- Hands and Body meshes compatible with vanilla textures including the argonian. (feet are not) \r\n\r\nE55 Possible Future Features:\r\n\r\n- New makeup\r\n- More skin/face options\r\n- Longer fingernail options\r\n- tutorials including msn creation in Blender 2.49b; breast creation and UV editing.  This will depend on community interest.\r\n\r\nThe E55 textures were made for the E55 and made to blend together.  If you use other textures than the ones provided with the mod - this includes face textures - you will most likely get seams and texture mismatch/distortion.  To achieve the result from the screen shots you must use our textures together as a set.  We cannot help with texture issues that arise from using other mods textures with ours.\r\n\r\n\r\nInstallation:\r\n\r\nextract the archives into your Skyrim data folder.\r\n\r\nDeinstallation:\r\n\r\ndelete the files!\r\n\r\n\r\nHere is the list of the base files and where they will be copied:\r\n\r\n\r\nMESHES:\r\n\r\nAll of the following meshes will be written to: meshes\\\\character\\\\character assets\\\\\r\n\r\n1stpersonfemalebody_0.nif, 1stpersonfemalebody_1.nif, 1stpersonfemalehands_0.nif, 1stpersonfemalehands_1.nif, femalebody_0.nif, femalebody_1.nif, femalefeet_0.nif, femalefeet_1.nif, femalehands_0.nif, femalehands_1.nif\r\n\r\n\r\nBODY SKIN TEXTURES:\r\n\r\nAll of the following textures will be written to: textures\\\\actors\\\\character\\\\female\\\\\r\n\r\nfemalebody_1.dds\r\nfemalebody_1_msn.dds\r\nfemalebody_1_s.dds\r\nfemalebody_1_sk.dds\r\nfemalehands_1.dds\r\nfemalehands_1_msn.dds\r\nfemalehands_1_s.dds\r\nfemalehands_1_sk.dds\r\nfemalehead.dds\r\nfemalehead_msn.dds\r\nfemalehead_s.dds\r\nfemalehead_sk.dds\r\n\r\n\r\nfemalehead_msn.dds  will be also written to:\r\n\r\ntextures\\\\actors\\\\character\\\\bretonfemale\\\\\r\ntextures\\\\actors\\\\character\\\\darkelffemale\\\\\r\ntextures\\\\actors\\\\character\\\\highelffemale\\\\\r\ntextures\\\\actors\\\\character\\\\imperialfemale\\\\\r\ntextures\\\\actors\\\\character\\\\redguardfemale\\\\\r\n\r\n*NOTE* the femalehead_msn.dds WILL remove the forehead ridges AND wrinkles on the elves as well as change the appearance of their ears.  If you do not want that, then either backup the msn files in the elves races folders and recopy them after installing this mod or install this mod manually and do not copy our msn to those directories.\r\n\r\n\r\nMAKEUP/FACETINT TEXTURES:\r\n\r\n\r\nall of the following textures will be written to: textures\\\\actors\\\\character\\\\character assets\\\\tintmasks\r\n\r\nfemaleheadbreton_lips.dds\r\nfemaleheadhighelf_lips.dds\r\nfemaleheadimperial_lips.dds\r\nfemaleheadnord_lips.dds\r\nfemaleheadredguard_lips.dds\r\n\r\n\r\n177 Facetint textures will be written to: \r\ntextures\\\\actors\\\\character\\\\facegendata\\\\facetint\\\\skyrim.esm\\\\\r\n\r\n\r\nThe facetint textures contain the \\'makeup\\' and skin tints for all of the races, male and female.  Xazomn worked tirelessly to determine which of these files affected the females using this body replacer.  These 177 textures have been altered to conform to the new lip shape of our femalehead texture.\r\n \r\nOPTIONAL FILES:\r\n\r\n\r\nThe Body options include 5 different variations on the body texture.  Four of them are different pubic hair types and one of them is a skin with \\'beauty marks\\' - ie. moles.  See the screenshots for examples.  Pick the one you want and use it to replace the \\'femalebody_1.dds\\' texture in  \\'textures\\\\actors\\\\character\\\\female\\\\\\' folder.\r\n\r\nThe Colored Nails include 5 different colors for the fingernails and toenails.  They are equippable and appear in your inventory.  You wear them like clothing.  To install, just copy the files in the archive into your Skyrim \\'data\\' folder.  It will copy 5 new nail colors into the  textures\\\\actors\\\\character\\\\female\\\\nails\\\\  folder that was created when you installed the base files.   Check the esp \\'E55 Colored Nails.esp\\' and then look for them in the small table that is on the left hand side of your bed in the Whiterun Breezehome.\r\n\r\nStarter Outfits includes 2 outfits i converted to the E55; The Nord Steel Plate armor (Vanilla) and the Triss outfit from \\'Witcher 2\\'.  Copy the files to your Skyrim Data folder.  It will create an \\'E55\\' folder in the \\'armor\\' folder under both \\'meshes\\' and \\'textures\\'.  Check the \\'E55 Starter outfit.esp\\'  file and look for them in the player chest in your Whiterun Breezehome.  Coincidentially, any other home in the game that contains the \\'players chest\\' will have these outfits in them also.\r\n   \r\n\r\nCredits:\r\n\r\neronel55 : meshes, msn generation\r\nXazomn : textures, msn editing\r\nkendo2 : outfits, feedback\r\nGinnyfizz : beta testing, feedback\r\n\r\n\r\nA big thanks to Humannature66 for providing valuable moral support and feedback\r\n\r\n__________________________________________________________________________________________\r\n\r\nTechnical Notes:\r\n\r\nRegarding the weighting.  To be fair, i do not think the devs meant their female body to be used extensively in the game nude.  But, for us - if we are going to have a nude body in the game then it should look and move as naturally as possible.  There were several areas that required addressing in order to better accomodate this.\r\n\r\n\r\n- the sternum\r\n\r\nIf you watch one of the other npc\\'s or better - a companion such as Lydia, closely, you will notice that the upper breast and sternum move and stretch whenever they move their heads.  This is especially noticable when using the character generator.  This is due to the Spine 2 bone being very heavily weighted in that area.  I significantly decreased the bone heat for the spine 2 bone in this area.  It now appears more natural to my eye. \r\nCheck ut the Steel Plate armor i converted for this body.  It is in the downloads section as part of the E55 Outfits.  The Torso portion of the armor is now rigid as steel should be.\r\n\r\n-  lower breast area\r\n\r\nIf your character squats or is in ready mode for fighting, the underside of the breasts would crumple up and collapse into the upper breast.  To eliminate this it required 2 strategies - `1 - lessening the influence of the spine bones and 2 - matching the weight with the vertices that overlap with the spine 2 bone.  The breasts remain normally shaped regardless of the players position.  (It is probably unnecessary to have overlapping vertices)\r\n\r\n- the lower calves (upper portion of the foot meshes)\r\n\r\nthis area does not deform gracefully or blend well with the legs when the player is standing on uneven ground.  I have lessened the calf bone influence but this area remains unsatisfactory to my eyes.  However, I do not spend a great deal of time staring at my characters feet so my work here has been limited.\r\n\r\n- the abdomen\r\n\r\nWhen in sneak mode ie, squatting, the abdomen would deform inward - as if the character was holding a large heavy pipe pressed to their abdomen.  This required lessening the amount of influence the spine 1 bone has.  This area no longer deforms in this manner.\r\n\r\n- the buttocks\r\n\r\nThe \\'asscrack\\' on the vanilla mesh is crooked.  This is mostly due to 3 bones influencing this area: the pelvic and left and right thigh bones.  When the character walks or runs or stands still it does not look correct.  I reduced the amount of influence the thigh bones have in this area including eliminating cross over - the left bone affecting the right buttock and the right bone affecting the left buttock.  The buttocks appear normal now when standing , running, walking or squatting.",
  "categoryId": "29",
  "version": "1.0",
  "author": "Glosshouse",
  "createdUnix": "1331497360",
  "updatedUnix": "1331594645",
  "containsAdultContent": true,
  "uploadedBy": "eronel55",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42416",
      "name": "E55 Optional Body Textures",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8964",
      "fileName": "E55 Optional Body Textures-12694.rar",
      "uploadedUnix": "1331497711",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cfe9fb495f462410b349a14c743f4358ac57ba355435ef890153be34c0347e28/analysis/1406743927/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/E55%20Optional%20Body%20Textures-12694.rar?fid=42416&ttl=1535774824&ri=8192&rs=8192&setec=af314fdb6ca86ae90654a183f424c30d"
    },
    {
      "fileId": "42417",
      "name": "E55 Colored Nails",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "691",
      "fileName": "E55 Colored Nails-12694-1-0.rar",
      "uploadedUnix": "1331497796",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e86b5babc835295537cc2c14ebb29145b10759f18b1c66b81d69236948e957d1/analysis/1406743928/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/E55%20Colored%20Nails-12694-1-0.rar?fid=42417&ttl=1535774825&ri=8192&rs=8192&setec=eb2f2af40405ab133705a5920ec72190"
    },
    {
      "fileId": "42418",
      "name": "E55 Starter Outfits",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "12482",
      "fileName": "E55 Starter Outfits-12694-1-0.rar",
      "uploadedUnix": "1331497900",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4e17f1149d62962700e19fe99d32895be0b2ebbceb57864b8d27d030ba18b9a8/analysis/1406743936/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/E55%20Starter%20Outfits-12694-1-0.rar?fid=42418&ttl=1535774825&ri=8192&rs=8192&setec=3cfa7755ed294a04efdb568c677e87b9"
    },
    {
      "fileId": "42780",
      "name": "E55 Base Files",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "34952",
      "fileName": "E55 Base Files-12694.rar",
      "uploadedUnix": "1331594645",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bf3d607b354b4aba02545f2be36e7bc4b5bde43a0e1003e91a434b0fd89e68fe/analysis/1406745924/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/E55%20Base%20Files-12694.rar?fid=42780&ttl=1535774826&ri=8192&rs=8192&setec=09d2732166a638526def86d6b00f1595"
    }
  ]
}