{
  "modId": 12714.0,
  "modName": "SkyHold_Lodge",
  "summary": "Secluded Nord Fishing Lodge for Skyrim, perfect retreat for Warriors, Mages and Adventurers of all Holds.",
  "descriptionHtml": "SkyHold Lodge 1.2\r\n\r\nA Unquie LakeSide Fishing Lodge \r\nPlayer Home for Skyrim\r\n\r\nCrisG9\r\n\r\n================================================================\r\n\r\nPlayer Home Fishing Lodge on Lake across from Half Moon. A lovely rustic retreat with stunning views of the Mountains of Skyrim. Built by an eccentric Nord Noble from Solitude, SkyHold Lodge was originally created for fishing and repose for a noble family far from the rumors and turmoil of the cities. Unused by them for some time, it is now available to you, for your enjoyment.\r\n\r\nReachable by water or by road, it is a rustic haven perfect for the adventurer or Thane, complete with extensive fishing docks, a lovely walled Courtyard Garden, and fully furnished with player friendly non spawning containers of all kinds. Fast Travel is availble once discovered, and if you come with a horse or fast travel to this location your horse will be located in the open air stable area to the left of the Main Lodge, by the Gateway to the Fishing Docks.\r\n\r\nDragons have been sighted in the area, so be wary and there are wild animals in the hills nearby, but the experienced Nord will know this well. Future developments will include crafting and possibly a fishing quest. \r\n\r\nEnjoy, and don\\'t miss sunset on the lake from the end of the pier, you will find comfortable seating for this beautiful view.\r\n\r\nWelcome to SkyHold Lodge\r\n\r\nInstallation: \r\nLoad the esp into your data folder and enable using the Launcher Data function or activate with Nexus Mod Manager.\r\n\r\nImportant Notice:\r\nCurrently in this build of Skyrim large structures may not appear when you arrive at a cell, if the house is missing, just save your game and then load the save and it will appear. Hopefully this will be fixed soon. Same when returning to the outside from in the house, repeat same proceedure. The Lodge is there, just follow the proceedure.\r\n\r\nEnhancements:\r\nBest Enjoyed with the High Res Texture pack by Insanity and Real Water and Realistic Lighting with the Sydney666 custom ini Config but all files for this Lodge are from the original Skyrim install, no addional files are needed.\r\n\r\nAcknowledgements:\r\nI want to thank Bethesda for amazing games and the CK, the community for constant support and especially the TesAlliance fellowship and DarkRider, all  who have been of such support and great guidance in moding for the wonderful Elder Scrolls series.\r\n\r\nRelease:\r\n This Add On is free to use and Alter with permission, the only restriction is that any changes must be Lore Friendly...ie no Star Wars or Heavy Metal variations please.\r\n\r\nPlease report any problems, you may find me at TesAliance and on the Bethesda Official Skyrim Forums and on Skyrim Nexus under CrisG9.\r\n\r\nMarch 2012\r\n\r\n",
  "categoryId": "67",
  "version": "1.3",
  "author": "CrisG9",
  "createdUnix": "1331511116",
  "updatedUnix": "1331711383",
  "containsAdultContent": false,
  "uploadedBy": "CrisG9",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42699",
      "name": "SkyHold_Lodge_Old_Version",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "917",
      "fileName": "SkyHold_Lodge_Old_Version-12714-1-2.zip",
      "uploadedUnix": "1331576099",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/b40376a9c199218878d1c15fd5c910841e3e0938e51f60b5eb7e4750bc3c20a3/analysis/1406745542/",
      "changelogHtml": " Corrected a floating wall on South Face of Main Lodge Lakeside, added ivy and structural support <br/> \n Thanks to Arion, Gentester, samusaran589, Brendan 62, and kitsuneshoujo for suggestions and bug notices..much appreciated! <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyHold_Lodge_Old_Version-12714-1-2.zip?fid=42699&ttl=1535774859&ri=8192&rs=8192&setec=0b832be9b221273bf8b89217ae890fe4"
    },
    {
      "fileId": "43194",
      "name": "SkyHold_Lodge",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "917",
      "fileName": "SkyHold_Lodge-12714-1-3.zip",
      "uploadedUnix": "1331711383",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/1ea70e1efcee50f75d8c3cf48008e45752ef8c030b9b54cea19012485ad72803/analysis/1406748253/",
      "changelogHtml": " Replaced Dwarven Items of decor that may have been causing a conflict with a Dwarven Ruin <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyHold_Lodge-12714-1-3.zip?fid=43194&ttl=1535774859&ri=8192&rs=8192&setec=40e20a2b627f6614e944a1bca9dc8d63"
    }
  ]
}