{
  "modId": 12752.0,
  "modName": "Sheogorath Shout - Call of Madness",
  "summary": "Adds a new shout, harnessing the powers of Sheogorath - Wabbajack enemies with your voice, summon the Prince of Madness to fight for you, or even make it rain deadly Cheese from the sky&#33;",
  "descriptionHtml": "Adds the Call of Madness to the game, a Shout worthy of Sheogorath.\r<br />\r<br />[line]\r<br />Latest Version:  v1.16[list]\r<br />[*] Essential characters are now vulnerable to more of the Wabbajack&#39;s effects, such as healing, invisibility, life steal, and force push.\r<br />[*] Life Steal and Force Push now work on dragons.\r<br />[*] Sheogorath&#39;s laughter can be heard while firing the Wabbajack Shout.\r<br />[*] A scripting tweak has been added to help treat the Transmogrification bug where the target would not disappear.  It&#39;s not a guaranteed fix, but incidences seem to be noticeably reduced.\r<br />[*] The Ice Form effect from the Wabbajack can now be dispelled by hitting the target, like with the actual Ice Form shout.\r<br />[*] Numerous minion tweaks\r<br />[line]\r<br />\r<br />[heading]THE MADNESS[/heading]\r<br />\r<br />The Call of Madness packs three wacky powers into one shout:\r<br />\r<br />The First Word is the Wabbajack Shout. Your very breath becomes the essence of insanity, unleashing the powers of the elements on enemies, bending them to your will, and turning them into creatures, gold, or sweetrolls&#33; \r<br />\r<br />The Second Word summons Sheogorath to fight on your side. He can use his own Wabbajack, a cheese-throwing spell, three different shouts, and a conjuration spell which will summon one of 15 colorful minions:[list]\r<br />[*]Dremora Lord\r<br />[*]Generic Dovahkiin\r<br />[*]Dwemer Warrior\r<br />[*]Ancient Nord Chef\r<br />[*]Demon Child\r<br />[*]Elder Troll\r<br />[*]Vamspider\r<br />[*]Lager Breadlord\r<br />[*]Aspect of Cicero\r<br />[*]Electrobot\r<br />[*]Wagon Priest\r<br />[*]Ka-Boom Dragon\r<br />[*]Super Horker\r<br />[*]Marionette\r<br />[*]Headless Blade\r<br />[/list]\r<br />Using all Three Words activates the Cheese Storm Call, which rains delicious, cheesy death upon your foes from the heavens\r<br />\r<br />\r<br />[heading]BONUS[/heading]\r<br />\r<br />Go to the bottom room at the end of the Pelagius Wing, where you can find Sheogorath&#39;s Fun Chest of Fun, which makes some of the weapons and spells used by the NPC&#39;s in this mod available to the player, along with some new armor&#33; All items can be tempered, provided you have the Arcane Blacksmith perk.[list]\r<br />[*]Sheogorath&#39;s Razor, which has a chance to cast Wabbajack on enemies it hits\r<br />[*]Breadlord Battleaxe, Bow and Sword, which cause enemies to explode into liquor when killed\r<br />[*]Wagon Priest Staff, which fires wagons that knock enemies back\r<br />[*]Cheese Throwing spell\r<br />[*]Food Flinger spell\r<br />[*]Vamspider Cloak Spell - drain life from nearby enemies\r<br />[*]Cheese Torrent spell - perfect for high-level destruction characters\r<br />[*]Mad God Armor: Light armor with Dragonscale stats. Gives bonuses to conjuration, destruction, shout cooldown, and magic resistance.\r<br />[*]Mad God Boots: also light, with Dragonscale stats. Increases carrying capacity and allows the wearer to walk on water&#33;\r<br />[/list]\r<br />\r<br />[heading]THE WABBAJACK&#33;[/heading]\r<br />\r<br />The script of the Wabbajack has been newly overhauled for extra insanity&#33; The staff can also now be given to and used by followers. \r<br />\r<br />Vanilla effects: \r<br />- Fire, Frost, or Shock explosion \r<br />- Heal target \r<br />- Turn target invisible \r<br />- Leech Health, Stamina, and Magicka (now with improved visual effect&#33;) \r<br />- Transfigure into Chicken, Rabbit, Mudcrab, or Dremora Lord \r<br />- Disintegrate and turn into Sweetroll or Gold \r<br />New Effects: \r<br />- Removed effect restriction on Giants \r<br />- Force push target away \r<br />- Pull target towards caster \r<br />- Ice Form \r<br />- Frenzy \r<br />- Force target to fight for you \r<br />- Shrink target for 30s \r<br />- Speed Boost or Super Slow \r<br />- Spawn a ghostly duplicate of target, and turn it against them&#33; \r<br />- Transfigure into Cow, Goat, Skeever, or Horker \r<br />- Chance to make target explode mightily and knock down all other nearby enemies&#33; \r<br />\r<br />[color=yellow][b]Note that other mods which affect the Wabbajack&#39;s scripting will not be compatible.[/b][/color] Additionally, the effects of this mod will not carry over to other mods which apply the Wabbajack&#39;s magic to other items (i.e. giving its enchantment to weapons or spells) \r<br />\r<br />\r<br />[heading]ACQUIRING THE SHOUT[/heading]\r<br />\r<br />To get the Shout, you must enter the Pelagius Wing in the Blue Palace in Solitude and complete &#34;The Mind of Madness&#34; quest. When the quest is completed, continue down the hallway past the point where you teleport, down the stairs, and into the small chamber below. In the chamber, you&#39;ll find a door leading to &#34;The Mind of a Madman&#34;. It will take you back to Pelagius&#39; mind, where the Word Wall is now active and the words can be learned. A new door will also have appeared, which will lead you back to the Pelagius Wing.\r<br />\r<br />It does not matter if you install this mod before completing the quest, or vice versa. It works essentially the same.\r<br />\r<br />Once you have the Words, you can then unlock them either with dragon souls, or by looking up the words &#34;Sheo&#34;, &#34;Gor&#34;, and &#34;Ath&#34; in the Console and entering player.unlockword commands for each of their ID codes.\r<br />\r<br />##0012c9\r<br />##0012ca\r<br />##0012cb\r<br />(the ## corresponds to the mod&#39;s place in your load order)\r<br />\r<br />[b]Have fun&#33;[/b]\r<br />\r<br />[url=http://steamcommunity.com/sharedfiles/filedetails/?id=15872]Also available on the Steam Workshop[/url]\r<br />\r<br />\r<br />[heading]Known Bugs:[/heading]\r<br />[list]\r<br />[*]Some NPC&#39;s, primarily Hold Guards, may not respond correctly to some of the Wabbajack effects, namely Transfiguration. This is a known giltch with the vanilla Wabbajack as well. \r<br />[*]I have received many complaints about the new door in the Pelagius Wing not enabling properly.  I have done everything in my power to ensure that it does, so if it still doesn&#39;t appear to you, then I can&#39;t help.  The way that scripts are embedded in save files makes problems like this tricky to fix.  Your options are:\r<br />- Run BOSS\r<br />- Completely uninstall the mod, save, quit the game, restart the game, save again, quit the game again, and then re-install the mod.\r<br />- Load an older save\r<br />- console-command the shout to yourself\r<br />Any further complaints about the door being missing will be ignored.\r<br />[*]An old version of the Mad God Boots may have left a permanent Water-Walking effect on the player. To remove it, type &#34;player.removespell ##025EE4&#34; into the console (XX corresponds to the mod&#39;s place in your load order) \r<br />[*]An older version of the mod may have left a red aura on the player.  To get rid of it, enter &#34;player.sms 00074799&#34; in the console.\r<br />[*]The scripted effects for the new spells and weapons may not work until you use the shout once after acquiring them. I have no idea why. \r<br />[*]If, when you turn someone into an animal with the Wabbajack and they disappear/don&#39;t reappear, try extracting the &#34;ComTransmogrifyCreature&#34; .pex and .psc files into the Skyrim/Data/Scripts and Skyrim/Data/Scripts/Source folders respectively.\r<br />[*]Some people have reported the Word Wall not activating, leaving them unable to learn the words. If this happens, look up the words in the console and use &#34;player.teachword&#34; commands for each of them. \r<br />[/list]\r<br />\r<br />[heading]Changelog:[/heading]\r<br />\r<br />v1.15: \r<br />- A fix for the inactive Wabbajack bug, along with some new random effects and further scripting improvements \r<br />- Retextured Sheogorath&#39;s personal Wabbajack \r<br />- Added a new ability to the Super Horker \r<br />- Changed the emanating light in the Wabbajack&#39;s magic effect to something more fitting \r<br />- Switched the Wabbajack&#39;s skill to Destruction \r<br />v1.14:  \r<br />- Issues with missing door/inactive word wall should be resolved once and for all.  If the door is still not there for you, then there&#39;s nothing I can do about it.  See the &#34;Known Bugs&#34; section for further information\r<br />- The Mad God armor should no longer provide unlimited shouts, and the Water-Walking effect from the Mad God boots should not stay after they have been removed.  Enter &#34;player.removespell ##025EE4&#34; in the console (the ## corresponds to the mod&#39;s place in your load order) to get rid of the lingering ability.\r<br />- A bug with the Wabbajack script which left a red aura on the player is now resolved.  Enter &#34;player.sms 00074799&#34; in the console to get rid of it if it is currently affecting you.\r<br />- A bug in the Vamspider&#39;s cloak spell which made it aggro nearby allies should now be fixed.\r<br />v1.13.1\r<br />- Added new scripts to ensure that the Word Wall and doors enable properly\r<br />- Cleaned up the script governing the word wall and door to Pelagius&#39; mind.  Word wall should not be active before the quest is finished.  If it is, use a BSA unpacker to extract the &#34;QF_DA15_0002AC68.pex&#34; file to the &#34;Skyrim/Data/Scripts&#34; directory, and its corresponding .psc file to the &#34;Skyrim/Data/Scripts/Source&#34; directory.  [b]BACK UP THE ORIGINALS FIRST.[/b]\r<br />v1.13: - More missing files are now accounted for\r<br />- Overhauled the Wabbajack script, adding more effects and enabling the staff&#39;s use by NPC&#39;s.  Affects the original Wabbajack, Sheogorath&#39;s Wabbajack, and the Wabbajack Shout.\r<br />- Cheese Storm will not damage your followers\r<br />- Tweaks to Sheogorath&#39;s abilities\r<br />- Added a new minion - the Headless Blade\r<br />v1.12:  - Unique textures applied to the new weapons\r<br />- Added Breadlord Battle Axe to Sheogorath&#39;s Fun Chest of Fun\r<br />v1.11.1 - fixed the &#34;silent Sheogorath&#34; bug\r<br />v1.11 - added Sheogorath&#39;s Fun Chest of Fun, with some new weapons and spells to the Pelagius Wing[list]\r<br />[*]Made preparations for a possible future Dawnguard extension\r<br />[*]The Loading Screens are now included in a separate plugin, which can be found under the Downloads page, in Optional Files.[/list]\r<br />v1.10 - Sheogorath speaks&#33; (and dances)\r<br />- Fixed some bugs in minion AI\r<br />v1.9  - The Word Wall is now coded to unlock the words after teaching them to the player.  The bug that kept players from learning the latter two words should also be fixed.\r<br />- Tweaked the Lager Breadlord&#39;s weapon script so that death effect only happens if they are the one who scores the killing hit\r<br />- Fixed bug that made Un-summonation visual effect play randomly after Sheogorath disappears\r<br />- Sheogorath now uses an altered version of Mehrunes&#39; Razor as his backup melee weapon, which has a chance to cast Wabbajack on enemies it hits.\r<br />- Added the Marionette to Sheogorath&#39;s minions\r<br />- Edited some of the new Load Screens\r<br />v1.8 - Tweaked the Disappearing Food Script in an effort to prevent SaveGame bloating\r<br />- Added the Super Horker to Sheogorath&#39;s minions, plus a new Load Screen\r<br />- Fixed a rare bug that sometimes caused minions to turn against the player when hit accidentally.\r<br />v1.7.3 - fixed a small bug related to a change in the last update where some new spells wouldn&#39;t work properly\r<br />- Added Ancient Daedric Cheese to random loot lists\r<br />v1.7.2 - Tweaks made to spells and enchantments added by mod\r<br />- New Loadscreens added, related to the Call of Madness and Sheogorath&#39;s minions. These will begin to appear after you have completed the required quest.\r<br />v1.7.1 - The Ka-Boom Dragon&#39;s explosion no longer sends the player flying\r<br />- Made tweaks to recently added NPC&#39;s and weapons\r<br />v1.7 - Cheese and other items dropped by spells will now disappear after a set amount of time, unless the player picks them up.\r<br />- Sheogorath now throws Cheese instead of fire\r<br />- Tweaked some sound and VFX\r<br />- Added more new minions to Sheogorath&#39;s conjuration spell\r<br />- The Summonation Spell that Sheogorath uses can now be learned from a Spell Tome, located on top of the barrels to the right of the door to Pelagius&#39; mind. Goes great with the Twin Souls perk&#33;\r<br />v1.6 - Added five new possible summonations for Sheogorath&#39;s conjure spell\r<br />- Minor tweaks to VFX for Wabbajack shout and Cheese storm \r<br />v1.5.1 - Fixed a bug that was preventing Sheogorath from using Conjuration spells\r<br />v1.5 - Moved the Word Wall to Pelagius&#39; mind, behind Sheogorath&#39;s throne. Completing &#34;The Mind of Madness&#34; is now a requirement to unlock the Shout.\r<br />- Due to problems with compatibility and crashes, the Madman&#39;s Lair is no longer included in this mod. It has been moved to its own plugin, which can be found on my Files page.\r<br />- &#34;The Jarl, the Clown, and the Daedra&#34; is still included, and can be found in the Pelagius Wing or the Arcaneum, dropped as random loot, and bought from vendors. However, it is no longer tied to any quests.\r<br />v1.4 - Tweaked Sheogorath&#39;s spells and abilities\r<br />- Sheogorath now disappears with a nicer visual effect, instead of simply vanishing \r<br />v1.3 - Entering the Madman&#39;s Lair will start the quest if you haven&#39;t already read the book\r<br />- Cheese Storm Call cannot be used indoors\r<br />- Copies of the book can now be found in the Pelagius Wing, in the box on the floor right near where you teleport, as well as in both Dark Brotherhood sanctuaries, near the Night Mother&#39;s coffin. Cicero carries a copy on him as well.\r<br />- Fix for the quest marker not appearing after the boss fight\r<br />- Fixed a portcullis in a puzzle room not loading\r<br />- Improved enemies&#39; attack behavior\r<br />v1.2 - Added the Madman&#39;s Lair\r<br />- New sound effects\r<br />- Fixed a bug where if Sheogorath turned someone into a Dremora or a Mudcrab, and his time expired, they would not change back, and attack the player while invulnerable. They can now be killed, which will transform them back to their original state.\r<br />v1.1 - adjusted shout recovery times for balance, and made tweaks to some VFX\r<br />v1.0 - original upload\r<br />[line]\r<br />\r<br />Please try it out and leave feedback, thanks&#33;",
  "categoryId": "75",
  "version": "1.16",
  "author": "Kingston3K",
  "createdUnix": "1331571674",
  "updatedUnix": "1395102526",
  "containsAdultContent": false,
  "uploadedBy": "TheAmazingDerpMan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42678",
      "name": "Call of Madness original",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "Call of Madness original-12752.zip",
      "uploadedUnix": "1331571953",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ebc8db18432841bac7c0908327bbf17ef352b3049adbf623330265a2c1da22d7/analysis/1406745288/",
      "changelogHtml": " Original upload. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Call%20of%20Madness%20original-12752.zip?fid=42678&ttl=1535774909&ri=8192&rs=8192&setec=68be690bbc50ca3373fdd36eb7da7952"
    },
    {
      "fileId": "42846",
      "name": "Call of Madness rev1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16",
      "fileName": "Call of Madness rev1-12752.zip",
      "uploadedUnix": "1331616211",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f7177ed42a128e3020d27f03efa38cfeb0fb7a4c8bbc41a0e7f1fbd0b8a6325d/analysis/1406746267/",
      "changelogHtml": " Adjusted shout cooldown times <br/> \n Tweaked spell VFX <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Call%20of%20Madness%20rev1-12752.zip?fid=42846&ttl=1535774909&ri=8192&rs=8192&setec=80920ba902ac6521cb8bc95d9d152607"
    },
    {
      "fileId": "44016",
      "name": "Call of Madness - featuring the Madmans Lair rev2",
      "version": "v1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "561",
      "fileName": "Call of Madness - featuring the Madmans Lair rev2-12752.zip",
      "uploadedUnix": "1331959799",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/5bc9f78de326c5b0ea29787cb4b16a938a59e950bac405f532e2440719a8fc6c/analysis/1406752503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Call%20of%20Madness%20-%20featuring%20the%20Madmans%20Lair%20rev2-12752.zip?fid=44016&ttl=1535774910&ri=8192&rs=8192&setec=7b60ed66187e7250a570433dba8cc29e"
    },
    {
      "fileId": "44308",
      "name": "Call of Madness with Madmans Lair rev3",
      "version": "v1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "685",
      "fileName": "Call of Madness with Madmans Lair rev3-12752.zip",
      "uploadedUnix": "1332040495",
      "modVersion": "v1.3",
      "virusScanUrl": "https://www.virustotal.com/file/4f66a1d97d39b46fee0ee97bb6f5a7e74beb7c67b63ceae7dd0a75958ab1f80a/analysis/1406765173/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Call%20of%20Madness%20with%20Madmans%20Lair%20rev3-12752.zip?fid=44308&ttl=1535774910&ri=8192&rs=8192&setec=3483f99626f08a89e1fb577388964be2"
    },
    {
      "fileId": "44678",
      "name": "Call of Madness - with Madmans Lair",
      "version": "v1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "686",
      "fileName": "Call of Madness - with Madmans Lair-12752.zip",
      "uploadedUnix": "1332125296",
      "modVersion": "v1.4",
      "virusScanUrl": "https://www.virustotal.com/file/f408ee1cdeb702569a95e3c4cc53781afd1be842bc9b9ac8d6e6423f1702cb04/analysis/1406767446/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Call%20of%20Madness%20-%20with%20Madmans%20Lair-12752.zip?fid=44678&ttl=1535774910&ri=8192&rs=8192&setec=9a8c64e9aabbdd2f6c921d4bb23db426"
    },
    {
      "fileId": "45225",
      "name": "Call of Madness rev5",
      "version": "v1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "579",
      "fileName": "Call of Madness rev5-12752.zip",
      "uploadedUnix": "1332287243",
      "modVersion": "v1.5",
      "virusScanUrl": "https://www.virustotal.com/file/ccb8d78d69572f2725a6a059bb7e26533d349909ac2e1869fc0c4aa4ff37db33/analysis/1406770408/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Call%20of%20Madness%20rev5-12752.zip?fid=45225&ttl=1535774911&ri=8192&rs=8192&setec=5e64444c923c7c2d0839c23ae159d6dc"
    },
    {
      "fileId": "46199",
      "name": "Call of Madness rev5-1",
      "version": "v1.5.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "586",
      "fileName": "Call of Madness rev5-1-12752.zip",
      "uploadedUnix": "1332559587",
      "modVersion": "v1.5.1",
      "virusScanUrl": "https://www.virustotal.com/file/0e8e651a6277fa78657ee561ee5ee46a6ec0c41231604a59346312ffc7cd4199/analysis/1406776091/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Call%20of%20Madness%20rev5-1-12752.zip?fid=46199&ttl=1535774911&ri=8192&rs=8192&setec=280716caedb8eb689940e3d215cb1752"
    },
    {
      "fileId": "49166",
      "name": "Call of Madness rev6",
      "version": "1.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "592",
      "fileName": "Call of Madness rev6-12752.zip",
      "uploadedUnix": "1333330660",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/ad3d232fd2227c11951cd6ce09dbf70c4e4235bfd118996b7ba543d635bddfeb/analysis/1406792549/",
      "changelogHtml": " VFX tweaks for Cheese Storm and Wabbajack Shout <br/> \n Added five new possible minions for Sheogorath&#39;s summonation spell. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Call%20of%20Madness%20rev6-12752.zip?fid=49166&ttl=1535774912&ri=8192&rs=8192&setec=30f3e42ff5047d8dc6b545dfe0d671c5"
    },
    {
      "fileId": "50433",
      "name": "Call of Madness rev7",
      "version": "v1.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "859",
      "fileName": "Call of Madness rev7-12752.zip",
      "uploadedUnix": "1333667273",
      "modVersion": "v1.7",
      "virusScanUrl": "https://www.virustotal.com/file/bfa7b092f3a9c5e93ed38aea4b87dc05a5fd85ec280e2cb58ddbe00fcd3ece19/analysis/1406799308/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Call%20of%20Madness%20rev7-12752.zip?fid=50433&ttl=1535774913&ri=8192&rs=8192&setec=71b1e74619c3c169d4b0c5c9fecc5351"
    },
    {
      "fileId": "50827",
      "name": "Call of Madness rev7-1",
      "version": "v1.7.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "860",
      "fileName": "Call of Madness rev7-1-12752.zip",
      "uploadedUnix": "1333775085",
      "modVersion": "v1.7.1",
      "virusScanUrl": "https://www.virustotal.com/file/a0f860da59ea4d95fb02c4f20c4bcb170a27d81a46526c076d65bbc316451c70/analysis/1406801775/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Call%20of%20Madness%20rev7-1-12752.zip?fid=50827&ttl=1535774913&ri=8192&rs=8192&setec=ffb5030f40886a9232be6111b43fbad5"
    },
    {
      "fileId": "55225",
      "name": "call of madness rev 7-2",
      "version": "v1.7.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "863",
      "fileName": "call of madness rev 7-2-12752.zip",
      "uploadedUnix": "1335051090",
      "modVersion": "v1.7.2",
      "virusScanUrl": "https://www.virustotal.com/file/1e50e1034b481d57b799fb97822319e9f6c7357cb8beba6161c6009a17062aa0/analysis/1406827464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/call%20of%20madness%20rev%207-2-12752.zip?fid=55225&ttl=1535774914&ri=8192&rs=8192&setec=741fdb72254714b0991c048ba44ec204"
    },
    {
      "fileId": "55488",
      "name": "Call of Madness rev7-3",
      "version": "v1.7.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "863",
      "fileName": "Sheogorath Shout - Call of Madness-12752-v1-7-3.zip",
      "uploadedUnix": "1335136528",
      "modVersion": "v1.7.3",
      "virusScanUrl": "https://www.virustotal.com/file/e5e0c7baef1e6d158dfdbda80d67e52466ee8bd3e000ca9980d8370934689e09/analysis/1406833271/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sheogorath%20Shout%20-%20Call%20of%20Madness-12752-v1-7-3.zip?fid=55488&ttl=1535774914&ri=8192&rs=8192&setec=0f5a3941b1214621d4ae30cac6bc9af4"
    },
    {
      "fileId": "69952",
      "name": "Call of Madness rev8",
      "version": "v1.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "867",
      "fileName": "Sheogorath Shout - Call of Madness-12752-v1-8.zip",
      "uploadedUnix": "1340510284",
      "modVersion": "v1.8",
      "virusScanUrl": "https://www.virustotal.com/file/50a05abbc853784bc6f6f5b59639218e75adbcfdc1cd4c9082d86aedbedd41cc/analysis/1406979305/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sheogorath%20Shout%20-%20Call%20of%20Madness-12752-v1-8.zip?fid=69952&ttl=1535774914&ri=8192&rs=8192&setec=082591e428dd3236ed89a4b9acb58a51"
    },
    {
      "fileId": "71312",
      "name": "Sheogorath Shout - Call of Madness",
      "version": "v1.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "869",
      "fileName": "Sheogorath Shout - Call of Madness-12752-v1-9.zip",
      "uploadedUnix": "1341097106",
      "modVersion": "v1.9",
      "virusScanUrl": "https://www.virustotal.com/file/93f2d378c0a2c31356b00e8482594c257e7d5cb006874a1705664236b9436ce5/analysis/1406992874/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sheogorath%20Shout%20-%20Call%20of%20Madness-12752-v1-9.zip?fid=71312&ttl=1535774915&ri=8192&rs=8192&setec=14ae974e16b4cdc83e1d61c38fd6a336"
    },
    {
      "fileId": "71778",
      "name": "Sheogorath Shout - Call of Madness",
      "version": "v1.10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1532",
      "fileName": "Sheogorath Shout - Call of Madness-12752-v1-10.zip",
      "uploadedUnix": "1341271304",
      "modVersion": "v1.10",
      "virusScanUrl": "https://www.virustotal.com/file/a3a9c17608357f4b4c6cad7715bae24eb5dfdda4bb84c5633f1c4ca37ffc8e9f/analysis/1406997607/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sheogorath%20Shout%20-%20Call%20of%20Madness-12752-v1-10.zip?fid=71778&ttl=1535774916&ri=8192&rs=8192&setec=0696932bb8b48d231dbde3c14a7d887d"
    },
    {
      "fileId": "84037",
      "name": "Sheogorath Shout - Call of Madness",
      "version": "v1.11",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6935",
      "fileName": "Sheogorath Shout - Call of Madness-12752-v1-11.zip",
      "uploadedUnix": "1345856533",
      "modVersion": "v1.11",
      "virusScanUrl": "https://www.virustotal.com/file/786420e947384b2917e855662eaffe4e7db93e24225a168d588924b8bab8aaf2/analysis/1407119887/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sheogorath%20Shout%20-%20Call%20of%20Madness-12752-v1-11.zip?fid=84037&ttl=1535774916&ri=8192&rs=8192&setec=656f59f2c75bb4d8c24ec331abbfc2cd"
    },
    {
      "fileId": "84038",
      "name": "Call of Madness Loading Screens",
      "version": "v1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "21",
      "fileName": "Call of Madness Loading Screens-12752-v1-0.zip",
      "uploadedUnix": "1345856611",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e1fbbfe811a1fb2e63def147aa00a21faf7b068f2c77270bc5bbc3642ddecbeb/analysis/1407119887/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Call%20of%20Madness%20Loading%20Screens-12752-v1-0.zip?fid=84038&ttl=1535774917&ri=8192&rs=8192&setec=1a6dd6314620759cf07d75721e102513"
    },
    {
      "fileId": "1000010837",
      "name": "Sheogorath Shout - Call of Madness 1-11-1",
      "version": "1.11.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1538",
      "fileName": "Sheogorath Shout - Call of Madness-12752-1-11-1.zip",
      "uploadedUnix": "1361179164",
      "modVersion": "1.11.1",
      "virusScanUrl": "https://www.virustotal.com/file/52490f2f129b9ff060e5591e5d351db3d8d7e364b5bff28be15830f5507af98c/analysis/1407424506/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sheogorath%20Shout%20-%20Call%20of%20Madness-12752-1-11-1.zip?fid=1000010837&ttl=1535774917&ri=8192&rs=8192&setec=78090e2393a8b883a5d4a8fa6aa7dcec"
    },
    {
      "fileId": "1000024299",
      "name": "Sheogorath Shout - Call of Madness 12-1",
      "version": "1.12.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7980",
      "fileName": "Sheogorath Shout - Call of Madness-12752-1-12-1.zip",
      "uploadedUnix": "1365916252",
      "modVersion": "1.12.1",
      "virusScanUrl": "https://www.virustotal.com/file/ee3c03502211853f863add7e8fbbf5a5df4e4dc3bda983fbbb5ccf4c08fc911c/analysis/1407521300/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sheogorath%20Shout%20-%20Call%20of%20Madness-12752-1-12-1.zip?fid=1000024299&ttl=1535774918&ri=8192&rs=8192&setec=96f30fc449fba965a234d88909fed742"
    },
    {
      "fileId": "1000025466",
      "name": "Sheogorath Shout - Call of Madness rev13",
      "version": "1.13",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8555",
      "fileName": "Sheogorath Shout - Call of Madness-12752-1-13.zip",
      "uploadedUnix": "1366466481",
      "modVersion": "1.13",
      "virusScanUrl": "https://www.virustotal.com/file/7f75716dd46f82daebd0059c9e7055819a9b9123ee9961ad1467dd61ede47898/analysis/1407531081/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sheogorath%20Shout%20-%20Call%20of%20Madness-12752-1-13.zip?fid=1000025466&ttl=1535774918&ri=8192&rs=8192&setec=4c0379ded2489e65eaa402be81bd1dc5"
    },
    {
      "fileId": "1000027010",
      "name": "Call of Madness rev13-1",
      "version": "1.13.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8555",
      "fileName": "Sheogorath Shout - Call of Madness-12752-1-13-1.zip",
      "uploadedUnix": "1367201837",
      "modVersion": "1.13.1",
      "virusScanUrl": "https://www.virustotal.com/file/212dc77bd017ac1aa0a75f7b8eb3be40d6d9243d2a5acf750b78db587623cc5d/analysis/1407546351/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sheogorath%20Shout%20-%20Call%20of%20Madness-12752-1-13-1.zip?fid=1000027010&ttl=1535774919&ri=8192&rs=8192&setec=6bcc169845c895ffb8a775b019b57caf"
    },
    {
      "fileId": "1000045947",
      "name": "Call of Madness rev14",
      "version": "1.14",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "19660",
      "fileName": "Sheogorath Shout - Call of Madness-12752-1-14.zip",
      "uploadedUnix": "1376178043",
      "modVersion": "1.14",
      "virusScanUrl": "https://www.virustotal.com/file/1cdc4e9277f9dffe6c7513db550e9f0c2b071eb77f6d4775b858bbf75dfa27c5/analysis/1407677657/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sheogorath%20Shout%20-%20Call%20of%20Madness-12752-1-14.zip?fid=1000045947&ttl=1535774919&ri=8192&rs=8192&setec=ce67870774f742104df64bc48f01a985"
    },
    {
      "fileId": "1000088762",
      "name": "Call of Madness rev15",
      "version": "1.15",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10409",
      "fileName": "Sheogorath Shout - Call of Madness-12752-1-15.zip",
      "uploadedUnix": "1388282121",
      "modVersion": "1.15",
      "virusScanUrl": "https://www.virustotal.com/file/55be14f93c149570309ade692355084d1cbd61eaba5e73a192cd157493d50b23/analysis/1407862767/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sheogorath%20Shout%20-%20Call%20of%20Madness-12752-1-15.zip?fid=1000088762&ttl=1535774919&ri=8192&rs=8192&setec=8106f1fd13658dee5f45bbbd6c95ed7e"
    },
    {
      "fileId": "1000088764",
      "name": "Wabbajack Retexture",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1858",
      "fileName": "Wabbajack Retexture-12752-1-0.zip",
      "uploadedUnix": "1388283931",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c51a6e877314a41a68527ff2ea2a4f144525665a936e2e42147da4e5b3ee3f2b/analysis/1407862807/",
      "changelogHtml": " Original upload. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wabbajack%20Retexture-12752-1-0.zip?fid=1000088764&ttl=1535774920&ri=8192&rs=8192&setec=f2f0460d577dd9660360dd417b66f5fc"
    },
    {
      "fileId": "1000101547",
      "name": "Call of Madness ver 1-16",
      "version": "1.16",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11371",
      "fileName": "Call of Madness ver 1-16-12752-1-16.zip",
      "uploadedUnix": "1395102526",
      "modVersion": "1.16",
      "virusScanUrl": "https://www.virustotal.com/file/f0d445c66c6b16683f1e411d69803fc88a64e9fb64b68c28d90adcdeffc47057/analysis/1407986187/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Call%20of%20Madness%20ver%201-16-12752-1-16.zip?fid=1000101547&ttl=1535774920&ri=8192&rs=8192&setec=dc500001b8707c8a52e7d00f53f79572"
    }
  ]
}