{
  "modId": 12760.0,
  "modName": "Reachwind Eyrie",
  "summary": "Expands Reachwind Eyrie into a charming cliffside home",
  "descriptionHtml": "[img]http://img41.imageshack.us/img41/7082/updateheader25.png[/img]\r\n[img]http://imageshack.us/a/img441/4381/title01requirements.png[/img]\r\n1. Skyrim patched to the latest version, make sure your Update.esm is enabled\r\n2. Willingness to complete a simple quest\r\n3. A decent graphics setup\r\n[img]http://imageshack.us/a/img402/6798/title02description.png[/img]\r\n[b]NEW - UPDATE 2.5\r\n\r\n - Many improvements small and large to lighting and general decoration inside and out\r\n - Brand-new exterior navmeshes to eliminate the pervasive navmesh bug once and for all\r\n - A thorough scrubbing with TESVEdit to ensure maximum squeaky-cleanliness and compatibility[/b]\r\n\r\nAt long last I present to you Reachwind Eyrie v2, right on time for Skyrim\\'s first birthday! The mod has been extensively improved from its original form, with fixes ranging from quests to new areas to simple graphical beautification. Every known bug has been squashed, and many requested features have been added in. Even Skyrim\\'s persistent Grey-Face and Dialogue Bugs have been taken care of! Because there is so much new stuff on top of so much old stuff, I\\'ll just spell it out with a modified passage from the last readme.\r\n\r\nImportant note - This is not a \\\"Dovahkiin Mansion\\\" with 50 mannequins, display-covered walls, city-portal doors, and a warehouse aesthetic. This house has its own story and style, and it is ready to be lived in, all it needs is your presence. This house fits in with the game world like anything from the vanilla game, yet I hope it rises above and beyond the vanilla level of detail and functionality.\r\n\r\nThe Eyrie features seven rooms, utilizing the original tower and a new set of chambers I built from scratch beneath it. Everything uses the Dwemer theme but in a more fluid and liveable way than their ruins. I looked to Markarth for inspiration but ended up going in a different direction altogether. \r\n\r\nThe outside courtyard houses a complete forge setup with storage and an offset smelter, a reflecting pool/well with a bench, a fast-travel hitching post for your horse, and a cliffside overlook with great views of the eastern Karth River Canyon. I intended the courtyard to be the most-used place, so it is inviting and accommodating.\r\n\r\nThe tower houses a study with custom bookcases on the first level, a balcony with views of the Karthspire, and a new second storey for the Enchanter and Alchemical setup, along with labeled containers for convenient storage.\r\n\r\nThe lower chambers include a charming entryway (nice for entertaining guests!), a central nexus with a picturesque fountain and plenty of seating, and branches into the four main rooms.\r\n\r\nThe room to the left is the kitchen, which features a cooking spit over a fire, a large dining table with dinnerware and food already in place, and a preparation counter with flanking garden boxes.\r\n\r\nThe room to the right is the armory, which features ten weapon plaques (four are shield/double plaques), two weapon racks, six display cases (two large, four small), four mannequins, and six storage chests. There is also a nice seating area around the fireplace and four more custom bookcases (a total of 198 default book slots!).\r\n\r\nAcross from the entrance is the bedroom, which houses a large, sturdy bed (not stone, for those with bad backs), two wardrobes, and a couple chests.\r\n\r\nThe deepest room is the pool, which is spacious, steamy, and filled with scripted water dynamics to cater to your character\\'s mood.\r\n\r\nAll containers are non-respawning with the exception of the Trash Barrel in the kitchen, which purposefully respawns.\r\n\r\nFor additional information there are documents placed in each room written by the Eyrie\\'s previous owner, in which he researches and pieces together the obvious and hidden functions of everything you see.\r\n\r\nNow, you didn\\'t think I\\'d make a mod this big without having a little fun, did you?\r\n\r\nThe part which contributed the most to my slow process of learning was implementing a discovery quest for the Eyrie (playing off of already-founded lore), as well as a fully-functional, custom-dialogued, conversationally unique male Khajiit potential follower. He is central to the quest, though you can choose your ending based on your desired level of charity. You can be his friend, you can deny his appeal outright, you can even make him quite angry. I am very proud of the finished product; this was the first time I\\'ve delved into NPC creating and scripting at such a level.\r\n\r\nSome considerations must be made, though -\r\n\r\nI have neither microphone nor audio software, so he is silent. His dialogue lines are set up for eight seconds apiece, though this may be much too long for some.\r\n\r\nDue to the long silent files, you may have to wait for him to stop \\\"saying\\\" his line before he actually does anything. Nothing I can do there.\r\n\r\nHis part in the quest may stutter a bit or need some \\\"encouraging\\\", but let me know if anything bad happens.\r\n\r\nAlso, as a necessity for adding a character to the game world, I have fully navmeshed the entire house (mostly by hand), so any followers you have should be able to interact with things and generally navigate with ease. You\\'re welcome.\r\n\r\nAlso also, the outside courtyard area may take a hit on lower-end graphics setups. Lots of detail, you know. Sorry!\r\n\r\nIf you\\'ve made it this far down the description I commend you, there are a lot of details involved in something this big. I made this place to integrate as seamlessly as possible into your gameplay experience, and your satisfaction was second on my list of requirements (my own was first, of course). So most of all, enjoy the house, make it a home, and let me know how you like it. In this age of anonymous endorsements, a thoughtful comment is greatly appreciated (though the endorsements are nice too).\r\n[img]http://imageshack.us/a/img213/7292/title03installation.png[/img]\r\n1. Walk far away from the Eyrie (or go inside Reachcliff Cave).\r\n2. Drop all the files and folders into your data folder, then activate your .esm and .esp files.\r\n3. Catch your breath.\r\n4. Walk up to the Eyrie.\r\n[img]http://imageshack.us/a/img547/958/title04uninstallation.png[/img]\r\n1. Walk far away from the Eyrie (or go inside Reachcliff Cave).\r\n2. Uncheck the .esm and .esp files.\r\n3. Delete everything you dragged into the data folder.\r\n4. Sob quietly.\r\n[img]http://imageshack.us/a/img818/5549/title05compatability.png[/img]\r\n[b]NEW - UPDATE 2.5\r\n\r\nIf upgrading from version 2.0, simply replace the old .esp and .esm files with the new ones. Everything you\\'ve placed within the Eyrie should be just fine. As a precaution, you may want to dismiss Vera if he\\'s following you prior to upgrading. For installing over older versions, see below.\r\n\r\nYou need to install v2.0 before upgrading to v2.5.[/b]\r\n\r\nThe v2 Eyrie is incompatible with versions 1.0 and 1.1, and those should be removed completely before installing v2. If you are upgrading, dismiss Vera (if he\\'s following you) and move to a safe location, like the nearby Reachcliff Cave. I also recommend removing all your items from the Eyrie, including stuff in containers, bookcases, weapon racks, and sitting out in the open, though if you\\'re the risk-taking type it *should* all be there after updating. \r\n\r\n[b]It would be best if you make a clean save without the .esp or .esm activated, then start the discovery quest all over again, as many scripts and AI packages have been changed.[/b]\r\n\r\nBy its nature this mod will be absolutely incompatible with anything else that changes the Eyrie or the surrounding area. This could also potentially mess with any other mods adding a custom-voiced companion to the vanilla follower factions/quests. I am not proficient enough at scripting to make my own unique system, so I had to use what Bethesda gave me. Sorry. Apart from that, you should be golden.\r\n\r\n- Reported incompatible with Chinese mod ANK Castle, thanks Skyrim1m!\r\n\r\n- I highly recommend against using this with Trainwiz\\'s Dwemer Spectres mod. While that looks like a very awesome idea, there appears to be a spectre who resides in the Eyrie and, purposefully or not, uses an enchantment to throw clutter around. If you\\'re okay with that I have not found any other issues, but be warned - there\\'s a LOT of loose clutter to be picked up afterward.\r\n\r\nRecommended Mods:\r\nThe official High Resolution update\r\n[url=http://skyrim.nexusmods.com/mods/29608/]Detailed Rugs[/url] by raiserfx\r\n[url=http://skyrim.nexusmods.com/mods/10891]Unlimited Bookshelves[/url] by da5id2701\r\n[url=http://skyrim.nexusmods.com/mods/5941/]Coverkhajiits[/url] by mrLenski\r\n[url=http://skyrim.nexusmods.com/mods/141/]Skyrim Flora Overhaul[/url] by vurt\r\n[url=http://skyrim.nexusmods.com/mods/10652//?]Vanilla Mannequin Script Fix[/url] by SLuckyD\r\nAn ENB of your choice\r\n[img]http://imageshack.us/a/img713/5225/title06troubleshooting.png[/img]\r\nQ: The house isn\\'t there/Things look weird/The quest isn\\'t working right or at all.\r\nA: Make sure the folder structure is intact, go through the .rar file to double-check. Also, make sure no other mods are conflicting. Make triply sure your Data/SEQ folder is in the right place, this folder overrides the infamous \\\"Dialogue bug\\\".\r\n\r\nQ: The quest broke on me because I did something impetuous!\r\nA: Tell me, maybe I can fix it in a later version.\r\n\r\nQ: Help, what do I do, where do I go, who am I?\r\nA: There are no quest markers (bothersome things), so you\\'ll have to go by your gut feeling or find things by coincidence. Explore!\r\n\r\nQ: Will you upload this to Steam Workshop?\r\nA: Nope. I use Steam by necessity, not by choice.\r\nQ: But -\r\nA: No.\r\n\r\nQ: Will you integrate this with (super huge overhaul mods) or (barbie doll body types) or (creepy skin-covered mannequins) or (insanely in-depth eating/sleeping/etc. mods) or... ?\r\nA: Probably not.\r\n\r\nQ: I don\\'t like it/the quest is too hard/not enough mannequins/no Imperial dragons plastered on the walls/where are my Dragon Priest busts/Vera is ugly/general whining\r\nA: Like I said before, I made this place to be my home. Either you like it or not, but if you don\\'t, just move on and we\\'ll both be better for it.\r\n\r\nKnown bugs: \r\n\r\nLet\\'s recap - with this latest update this mod has been made immune to all three major bugs in Skyrim\\'s engine, both past and present. The .esm file fixes the grey-face NPC bug, the SEQ folder fixes the dialogue bug, and the re-done exterior fixes the navmesh bug. All of this in an unspeakably beautiful package, so you must ask yourself, What more can you ask of me?\r\n\r\n(i.e. None!)\r\n[img]http://imageshack.us/a/img547/660/title07changelog.png[/img]\r\n2.5 - 3/8/13 - Many minor fixes and upgrades, navmesh bug finally squashed\r\n2.0 - 11/11/12 - Major updates, previous version obsolete\r\n1.1 - 3/12/12 - Patched to include many missing scripts and a couple meshes\r\n1.0 - 3/12/12 - Initial release\r\n[img]http://imageshack.us/a/img163/6038/title08credits.png[/img]\r\n - Innumerable thanks to Bethesda for the only game which could ever outdo Oblivion\r\n - Thanks to those who answered my silly questions in the support forums\r\n - Thanks to those who stuck around through my extensive image teaser campaign\r\n - Thanks to all who download and enjoy\r\n[img]http://imageshack.us/a/img231/5554/title09contact.png[/img]\r\nI would love to hear what you think of the mod, so either leave me a comment or PM me here or on the Bethesda forums (here is your best bet). My username on both is Kohdi.",
  "categoryId": "67",
  "version": "2.5",
  "author": "Kohdi",
  "createdUnix": "1331580081",
  "updatedUnix": "1362786915",
  "containsAdultContent": false,
  "uploadedBy": "Kohdi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42718",
      "name": "Reachwind Eyrie v1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1037",
      "fileName": "Reachwind Eyrie-12760-1-0.rar",
      "uploadedUnix": "1331580149",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f73184cbf9bebe647766489208b5fffb8d7dde10075fdc4c34672fe6782f6b25/analysis/1406745666/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Reachwind%20Eyrie-12760-1-0.rar?fid=42718&ttl=1535774929&ri=8192&rs=8192&setec=ba1fea9977f427b37c11cfe2948ebc78"
    },
    {
      "fileId": "42801",
      "name": "Patch 1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "124",
      "fileName": "Patch 01-12760-1-1.rar",
      "uploadedUnix": "1331599170",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/31473e8d1ce00def99a97bf44d3ab89a6afe2e20a35608f56e0ee23468295e37/analysis/1406746034/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%2001-12760-1-1.rar?fid=42801&ttl=1535774930&ri=8192&rs=8192&setec=009deb910c8d942ea5759a2f740f1774"
    },
    {
      "fileId": "98969",
      "name": "Reachwind Eyrie v2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8546",
      "fileName": "Reachwind Eyrie v2-12760-2-0.rar",
      "uploadedUnix": "1352695160",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/0e8443cdaaf98d29e08062131556b3674b33ea648d1788ea3f903a6be4de1f9e/analysis/1407259707/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Reachwind%20Eyrie%20v2-12760-2-0.rar?fid=98969&ttl=1535774930&ri=8192&rs=8192&setec=76846fe88337f2a2578934582fc3ec99"
    },
    {
      "fileId": "1000016025",
      "name": "Update v2_5",
      "version": "2.5",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "937",
      "fileName": "Update v2_5-12760-2-5.rar",
      "uploadedUnix": "1362786915",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/27b71d7c7170c7ec76d1b35bb2d0e2adfa4edff30e0013c0511e353414179f0d/analysis/1407459555/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Update%20v2_5-12760-2-5.rar?fid=1000016025&ttl=1535774931&ri=8192&rs=8192&setec=ef985c891731ee4f53b4e749726e1097"
    }
  ]
}