{
  "modId": 12771.0,
  "modName": "Windhelm Fixed",
  "summary": "Removes All of the Rubble in the city of Windhelm... (a preview of my upcoming mod)",
  "descriptionHtml": "This mod aims to remove the ugly rubble in Windhelm and make it a little nicer. \r\n\r\nThis is just a small preview of my upcoming mod to make Windhelm nicer. There will most likely be 3 versions of the mod for people who don\\'t want to screw with the Elder Scrolls lore. This is basically what the mods will do \r\n\r\nThe NON lore friendly version will:\r\nRemove all of the bigger snow piles, icicles and noticeable snow effects. It will add a lot of green vegetation like trees, shrubs, flowers, leaves on the paths and vines and moss on the walls of buildings. It will also add benches, rose bushes, etc. where the snow covered weird looking spots in Windhelm where there were seams and stuff. \r\n\r\nThe lore friendly version will:\r\nNot remove the snow and keep the icicles and snow effects. It will still add vegetation but not as much. I will also add benches but they won\\'t be as nice looking as the ones in the non lore friendly version.\r\n\r\nThe one in the middle is pretty much just just in the middle of the non lore friendly version and the lore friendly version. Some of the things will be there some won\\'t.\r\n\r\nPS: If anyone wants to make banners for Windhelm please let me know. I have never been good at Texture and Mesh creating. (I don\\'t think Bethesda made ones that looks nice). I have been trying to make them since age 11 in the Oblivion days. \r\n ",
  "categoryId": "53",
  "version": "1.0",
  "author": "Little Spedve",
  "createdUnix": "1331590737",
  "updatedUnix": "1331591041",
  "containsAdultContent": false,
  "uploadedBy": "littlespedve",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42764",
      "name": "Windhelm_Fixed",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "633",
      "fileName": "Windhelm_Fixed-12771-1-0.zip",
      "uploadedUnix": "1331591041",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/409429dd49e614e5e3801ac137be0464abccbdf62202766583581d1bf6c5bdca/analysis/1406745726/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Windhelm_Fixed-12771-1-0.zip?fid=42764&ttl=1535774952&ri=8192&rs=8192&setec=6a53127eadd6662120b3b7429382ba62"
    }
  ]
}