{
  "modId": 12783.0,
  "modName": "Legende d outre tombe FR",
  "summary": "Ce mod a pour but final d’améliorer les maisons du joueur et de rajouter une quête pour acquérir une dernière demeure",
  "descriptionHtml": "ATTENTION: mod encore en bêta, tous les éléments ne sont pas présents! Vérifier la version courante et les éléments présents dans la section téléchargement!\r\n\r\nCe mod veut modifier le contenu des maisons et leur structure:\r\n\r\n> Plus de conteneurs\r\n> Des mannequins dans chaque maison\r\n> Une cave dans chaque maison\r\n> Une mise à niveau du matériel de craft (forge/alchimie/enchantement)\r\n\r\nDans chaque cave se trouve une portes : elle mène à un petit donjon contenant un boss, une probable histoire de la maison et un objet de quête. Derrière ce boss se trouve une seconde porte qui mène à une salle, commune à chaque maison. En son centre se trouve un contenu accessible avec seulement les 5 objets de quête récupérée dans chacun des donjons..\r\n\r\nLorque vous récupérerez un objet de quêtre,  une quête nouvelle apparaitra: la \\\"Légende d\\'Outre-Tombe\\\", qui mènera le joueur à chercher des renseignements sur un temple nommé \\\"Valtenruud\\\". Une fois sur place, il aura un donjon périlleux à explorer (c\\'est un temple ou vivent des zombies qui ont tyrannisés l\\'humanité et non une promenade de santé). Le premier niveau contient uniquement des pièges et créatures, dont un boss. Le second niveau est essentiellement composé de 4 énigmes, mortelles, en plus de quelques pièges et créatures. Au bout du niveau, une ultime énigme attend le Dovahkiin (petit clein do\\'eil à Morrowind). Si le joueur arrive à la résoudre, il aura le choix d\\'une arme unique entre 5 et gagnera un effet permanent lui donnant 20% de résistance aux dégâts physiques. Le joueur pourra alors accéder au dernier niveau.\r\n\r\nLe dernier niveau est une caverne d\\'une seule pièce contenant une maison (dans le style ancien nordique ou dwemer, je n\\'ai pas encore décidé. Si vous avez une préférence, n\\'hésitez pas à me le dire par mp). Le joueur rencontrera un fantôme, un homme inconnu qui a connu Martin Septim et qui l\\'a accompagné lors de son périple contre Mehrunes Dagon (Oui, c\\'est vous sous TES IV) et qui, après un dialogue,, remettra le titre de propriété de la maison et la clef au joueur. La maison sera donc habitable avec tout ce qu\\'il faut et le joueur en fera ce que bon lui semble. Il sera possible de circuler de la demeure aux villes par téléportation, et d\\'y amener son/sa épou(se). Une prochaine version pourrait voir la possibilité d\\'y recruter un protecteur.",
  "categoryId": "35",
  "version": "Beta",
  "author": "Weldukin",
  "createdUnix": "1331596948",
  "updatedUnix": "1332924767",
  "containsAdultContent": false,
  "uploadedBy": "Weldukin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42963",
      "name": "Legende d outre tombe beta",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1248",
      "fileName": "Legende d outre tombe beta-12783-1.rar",
      "uploadedUnix": "1331657224",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/dcbf0124c0de695b5f11f635bee3675c51cbb6e45ca79dc189087da304fa56c4/analysis/1406746929/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legende%20d%20outre%20tombe%20beta-12783-1.rar?fid=42963&ttl=1535775003&ri=8192&rs=8192&setec=f28ae09080b9b1eeaf6fd83877cfabb4"
    },
    {
      "fileId": "47611",
      "name": "Beta 02",
      "version": "Beta02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1762",
      "fileName": "Beta 02-12783-Beta02.rar",
      "uploadedUnix": "1332924767",
      "modVersion": "Beta02",
      "virusScanUrl": "https://www.virustotal.com/file/e6fe2d579103e675f1a95b210c19735a7f97904357d39dd06c1d787804561b72/analysis/1406783901/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beta%2002-12783-Beta02.rar?fid=47611&ttl=1535775003&ri=8192&rs=8192&setec=daf6fafad892ea7ba45e1955eee016c6"
    }
  ]
}