{
  "modId": 12792.0,
  "modName": "Castle Draco Imperial outpost player home city Mult versions WIP",
  "summary": "Castle Draco Imperial outpost player home. I am always looking for comments and resources. Project is going well need people to help with bug reports. No dawnguard or hearthfire required. Working on new version coming soon.",
  "descriptionHtml": "[color=yellow][u][b]New Version CASTLE DRACO HIGH HROTHGAR EDITION[/b][/u][/color]\r\n [u][url=http://skyrim.nexusmods.com/mods/35943//?] Castle Draco High Rrothgar Edition [/url][/u]\r\n[color=yellow][u][b]NEW VERSION RIVERWOOD EDITON[/b][/u][/color]\r\n[u][url=http://skyrim.nexusmods.com/mods/30469/?] Castle Draco Riverwood Edition [/url][/u]\r\n\r\nJust wanted to let you I know the mod is broken that is why I had to abandon the project and made the mod Castle Draco Riverwood edition. I have left this up in hopes someone would help as all my requests for help on the forums have gone unanswered. I am at this time unsure on how to fix the lag, fix the crashes, and since the last patch now I have issues with heads. I just don\\'t know what to do. Every patch something else breaks in this mod ever since 1.7 update. I thank all who supported me and am sorry the mod never saw it potential. I started modding in oblivion and still new to it but, I wanted to share this mod with the community. \r\n\r\n\r\nIMPORTANT please when updating from an old version (0.512 or Higher should be safe). or  switching versions. Remove Your items or they may be lost. Will say it again I have done alot of work to form id\\'s and cleansing so remove items or they maybe lost.\r\n\r\n\r\n\r\n\r\nNOTICE: Can\\'t move forward with the project until I get some feedback. Please drop some comments let me know if you are having issues. I am having issues need to see if it is my system or the mod. So Far I have found the cells that are causing the errors. Well I wanted to give a new update I loaded a previous backup from tesedit and looks like it is crash free so project may continue will have to finish with the nav meshes and exterior before it is ready for a an update,\r\n\r\n\r\n\r\n\r\nNEW 0.69 Alpha test update maybe broken. Added new companion hunter, worked on nav meshes, and lighting. Went in to test mod and started to crash when I explore the castle let me know if you have same problem. Had just finished cleaning it and validating forms.\r\n\r\nNEW 0.68 Made some head way with the issues in the mod releasing most stable so far. Only been doing bug fixes and cleaning to mod. But I did have to rename some form ids so treat as a new mod.\r\n\r\nNew 0.67 Must be treated as new mod will be posting as new mod in the up coming weeks after I do some testing. Renamed form id to fix 1.8 errors, removed problem scripts since 1.8, Manually removed papyrus errors in logs. Should be stable and crash free now let me know if not. Doing some testing of my own in the following weeks. Plan to make new release new post once quest are added with help from jerros.\r\n\r\n\r\n\r\n\r\n\r\n\r\nAdded Optional File for sorting room but I had problems with it,\r\nNote make sure load order is right and sorting is loaded after main plugin.\r\n\r\n\r\n\r\n\r\n\r\n\r\nAt this point I am leaving the imperial outpost up as safe to use version and will be focusing on the Lost paladin version and updating it. There will no new update to the imperial version until project is almost done so you can safely used it until then.\r\n \r\n\r\n\r\n\r\nVideo of top ten player homes by Machinima http://www.youtube.com/watch?v=RS0AN6l9eOc \r\n\r\nRated Number one thank you Machinima.\r\n\r\nBeen awhile, to be honest I lost interest but with new vote by Machinima. I have decided to start work on project again. It will be a few weeks for a update as I need to try and address the esm over esp problem as esm appear to not let you add quests. Using tesedit I have cleaned my esp file and believe that has fixed mod conflict errors. I am going to release a beta test of the esp let me know if you have any problems. However I cant add quest to esm file so I need the esp to work to continue the project. Thank you all for your support.\r\n\r\nCurrent Safe version to use.\r\nCastle Draco by Draco1122 Version 0.512 Updated on 11/22/12 No dawnguard required\r\n\r\n\r\n\r\nWHERE IS THE KEY THE BOOK HISTORY OF CASTLE DRACO HINTS TO IT\\\"S LOCATION. Nexus has screenshots where key is. http://skyrim.nexusmods.com/mods/12792 (Update Notes are also stored their.)\r\n\r\n\r\nHave to see it!\r\n\r\nPlease endorse IF you like.\r\n\r\nFeatures In imperial outpost version.\r\nPlayer Home\r\nLots of storage\r\nLots Of Mannequins \r\nLots Of Chest \r\nTreasure Vaults Locked for balance Can be picked master difficult.\r\nVendors Added New vendor in old servant quarters that sells an (Old star of azura and Fallen star of Blades)\r\nGuards added 20 more guards.\r\nEaster Eggs (Find the Lost armor Of Draco Some pieces added)\r\nUnmarked quest to clear armory dungeon and get key to castle.\r\n\r\n\r\nCastle Rooms, Bath, Main hall with library, Royal Quarters, Dinning Hall, Chapel, Vaults, Great Forge and watering Hole lol.\r\n\r\nCity Has WIP, Old Armory, Blacksmith quarters, Servants quarters, Captains Quarters, Old dungeon, Lighthouse quarters, Guard barrack, Guard Towers, Imperial checking station, and Imperial Offices.\r\n\r\nNew in 0.49 Scion\\'s hall, Temple Haven, Scion\\'s Reach, Scion\\'s quarters, Scion\\'s Reach hall of portals, and Temple Gardens. (Location are to be used for quest in future updates the key to scion\\'s reach is hidden but is their.\r\n\r\nNEW Added quest reward Divine Aegis HD to the cathedral Kill the vampires and find the hidden armor pieces. \r\n\r\nTemple OF the One WIP, main hall, quest and more detailed description.\r\n\r\nHave to see it!\r\n\r\nLink to Nexus http://skyrim.nexusmods.com/mods/12792 Please endorse IF you like.\r\n\r\n~~~~Key Spoilers~~~~\r\nTheir is no key for the treasure room it it just locked hard for balance there is lots of goodies in there. All doors that have a key can be unlock with the castle draco key. Found at the end of halldir\\'s cairn cave below the castle. Or in the Author Cheat Box In the tent outside of the front gate.\r\n\r\n\r\n\r\n\r\nWhat is being start in Lost paladin version.\r\n\r\nNever ending To do list.\r\n\r\nAdd Easter eggs. and quest events.\r\nFix and issues people report.\r\nFix things as I notice them. \r\nFinish the history of the castle. (Started)\r\nAnd more as I think of it.\r\nAdd and finish stables (Started)\r\nGet npc\\'s to stay in general area. (Started)\r\nAdd Cook, maid, Stewart, guards to main level of castle.\r\nFinish back story and add quest. (Working on with Jerro)\r\n\r\n\r\n\r\n\r\n\r\nNOTE:\r\n\r\nThe end goal of this project is to add a Imperial outpost to the border of skyrim and cyrodill with a player home castle with everything a player could need. It will be like border patrol outpost. Plan is to finish layout and interior cells, move on to decor, then to nav mesh, npc\\'s with voice, and over quests . Lastly due to request by player I am releasing 3 versions of this mod. First is the Imperial out post, second is the stormcloak version, and lastly due to help from Jerros and permission from ActusReus Castle Draco Lost plaadins version.  I will complete one version and from that add the others.\r\n\r\nPosted some New Pictures. Send me message with ideas of things you would like to see.\r\n\r\nI am also looking for resources for this..\r\n\r\nWould like to see statues from oblivion mainly the dragon and some good royal looking furniture let me know if you guys see any mods like that.\r\n\r\nAlso, I would like to hear from you guys if you are having any problems with mod. Since I started a new save I have had no issues. Want to make sure you all are ok to.\r\n\r\n\r\nThis post will be WIP of this mod will post other versions separately . I will try to keep the esp up to update from here on out.\r\n\r\n\r\n\r\nKNOWN ISSUES: // Troubleshooting \r\n\r\nSince hearthfire if you go to load a save from the castle it may not load or crash. To resolve this until bethesta fixes this load a save away from the castle and then load the save that didn\\'t load the first time. (Without exiting the game)\r\n\r\nObjects use to not always render. It appears bethesda has fixed that issue but if a wall or something is missing just fast travel away and back. \r\n\r\nThe Sorting room is a WIP it works but I have plans to add in other areas of the castle this maybe a long time away without some help, Just be aware. (Sjogg made it I just merged it in game)\r\n\r\n\r\nMODS you will see in the pictures but are not in this mod. \r\n\r\nSexy winterhold retexture\r\nSerious HD Retexture Skyrim\r\nSKYRIM ENHANCED SHADERS FX - ENB by Tapioks his night sky didn\\'t install the rest I hate darker nights.\r\nI have Lots of re-texture so you may see some others but to many to post them all. They are all on the nexus tho. Steam is more of a annoyance then a tool reasons (poor search engine, many errors, can\\'t post esm\\'s, have to use that horrible cloud, all around poor planning and design).\r\nMy other mods\r\nAnd many mods I have over 239 mods running but I think I almost have my skyrim perfect lol.\r\n\r\nAlso,Dova Hideout Rugs and Banners - New Exotic Furs by mgbeach and trixterpriest has given permission to rugs from his mod maybe adding them in an up and coming update. Until then I do recommend using his retexture.\r\nhttp://skyrim.nexusmods.com/mods/6721\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nUpdate Log.\r\n\r\nUpdates Most recent 0.49 and on. I will be using action log for here on out for updates.\r\n\r\nOn going --Added new Pic\\'s and Updated Them. Not all the far off pictures are up to date.\r\n\r\nPrevious version noted in readme file.\r\n\r\n\r\n[color=yellow][u][b]My other mods[/b][/u][/color]\r\n[color=yellow][u][b]Draco1122[/b][/u][/color]\r\n\r\n\r\n[u][url=http://skyrim.nexusmods.com/mods/12890] Craftable Blood Jagged Crown [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/13548] Free camera movement jarls thrones [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/13841] Longer Lasting potions [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/3939] HD Thalmor recolor pack [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/20089] Forest green - brown imperial retexture [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/20197/] Draco powerful artifacts and enchants [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/20813] Restoration Lesser powers and spells [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/20932] Golden dwemer ruins Retexture [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/21392] Skyrim crash prevention Tutorial Guide [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/12792] Castle Draco Orginial Version [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/29681] Enchantment Overhaul [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/28829] Expanded Hearthfire Homes and Vaults [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/24025] Black Scaled armor Craftable [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/30469/?] Castle Draco Riverwood Edition [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/31219/?] Dragonborn Craftables [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/35943//?] Castle Draco High Rrothgar Edition [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/36129/?] Light Sword Craftable [/url][/u]\r\n[u][url=http://skyrim.nexusmods.com/mods/36129/?] Knights Templar Landing [/url][/u]\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nCredits and Special thanks. For all version of castle. Please endorse their file.\r\n\r\nSpecial thx Als Treasure Vault by AlCiao for his great vault mod and giving me permission to use in mod. Please endorse his file. http://skyrim.nexusmods.com/downloads/file.php?id=9994\r\nSpecial Thx to Vortai The home in the sky by Stuges for letting me use his mod to build part of Old Temple Gardens (WIP At this point) please endorse his mod as well here is link http://skyrim.nexusmods.com/mods/10214\r\nSpecial thx For permission to use his mod. Uploaded by r6xs0n1kx Genesis Rhapsodos Rapier by SoniK5201 (This is Genesis\\' Rapier from the psp game Final Fantasy Crisis Core. The Meshes and textures were created by Nexxon, it was featured in his \\\"Nexon Armory\\\" mod. all credits go to him, i simply just transported it to Skyrim). Please endorse his mod. http://skyrim.nexusmods.com/mods/19030 And retextured blade by Reixko \r\nSpecial Thank to Cleric Armours of the Nine Devines - Credo StandAloneMod by ActusReus http://skyrim.nexusmods.com/mods/26904 For guard armor in the Lost paladin version permission. Can be crafted at forge.\r\nSpecial thank to Orlongs Hearth V1dot1 by cire992 For his open ended permission to use resources of his mod so I can add men and women bath and Thrane\\'s Quarters. CATHEDRAL by SagonTHX For allow mod to be use as a resoure. http://skyrim.nexusmods.com/mods/21157\r\nEbony Mage Robe Variants by Natterforme- armor_ frank zunge - retexturesSpecial http://skyrim.nexusmods.com/mods/26752\r\nThanks Modders Resource - Auto sorting and auto looting when crafting by Sjogg\r\nThanks for  open permission to use One-Handed Seraphim Blade by furiousfighter  \r\nhttp://skyrim.nexusmods.com/mods/18288\r\nThank you for permission use mod. Insanitys Pale Blade by InsanitySorrow http://skyrim.nexusmods.com/mods/27562\r\nBreton Longbow by cageu ---http://skyrim.nexusmods.com/mods/22316\r\nThank to Divine Aegis HD - Paladin Style Ebony Armor Rehaul by Sader and Shodan44 for leaving his permission open for use by others. http://skyrim.nexusmods.com/mods/9109\r\nSpecial Thank to Lost Paladins of the Divines Wrath Armor by Jerros For support in helping with quest and having the idea to make a Lost paladins version of the mod http://skyrim.nexusmods.com/mods/24253 \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "68",
  "version": "0.512.or.0.69",
  "author": "draco1122",
  "createdUnix": "1331604410",
  "updatedUnix": "1355071308",
  "containsAdultContent": false,
  "uploadedBy": "draco1122",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86374",
      "name": "old file 0 48",
      "version": "0.48",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3960",
      "fileName": "Castle Draco Main ESM and ESP-12792-0-48.zip",
      "uploadedUnix": "1346751636",
      "modVersion": "0.48",
      "virusScanUrl": "https://www.virustotal.com/file/719be9dce4f155f6ecace0d60483c7128b3e663df8e61261c8e1e382d4ac1fae/analysis/1407145087/",
      "changelogHtml": " 0.48--- Cleaned up mod description. Added new vendor to servants quarters that sells Old Azura\\'s Star and Fallen Star of Lost Blades. Added 20 more guards. Added unmarked quest to Clear Old armory and Old Dungeon with great reward in the boss chest. Adde <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Draco%20Main%20ESM%20and%20ESP-12792-0-48.zip?fid=86374&ttl=1535775016&ri=8192&rs=8192&setec=065dd7f65ae39cdd8e508b00954748fe"
    },
    {
      "fileId": "87265",
      "name": "old file 0 49",
      "version": "0.49",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4435",
      "fileName": "Castle Draco Main ESM and ESP-12792-0-49.zip",
      "uploadedUnix": "1347137167",
      "modVersion": "0.49",
      "virusScanUrl": "https://www.virustotal.com/file/110f24a0b2ba43c9990b835a858e07b049ce63bce4a6920ab4022c22063f9378/analysis/1407154086/",
      "changelogHtml": " 0.49--- Huge Update here many hours in adding new areas to the temple of the one for future quest. New in 0.49 Scion\\'s hall, Temple Haven, Scion\\'s Reach, Scion\\'s quarters, Scion\\'s Reach hall of portals, and Temple Gardens. Renamed, retextured, rebalan <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Draco%20Main%20ESM%20and%20ESP-12792-0-49.zip?fid=87265&ttl=1535775016&ri=8192&rs=8192&setec=4055301b6923c6ec2eb5783fbe7c553b"
    },
    {
      "fileId": "89517",
      "name": "old file 0 50",
      "version": "0.50",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4460",
      "fileName": "Castle Draco Main ESM and ESP-12792-0-50.zip",
      "uploadedUnix": "1348142218",
      "modVersion": "0.50",
      "virusScanUrl": "https://www.virustotal.com/file/0c52d4158a8b6b2a9e6daa5885f2aaa0e4a429ff6f2531ef812c8484e9255349/analysis/1407176833/",
      "changelogHtml": " 0.50--- Reworked rewards for clearing armory and dungeon. Fixed Dungeon missing walls, started steps to add quests. (Harder then I was thinking it was going to be so hopefully have them in next update). Added custom enchant to Blades bow of the hunt can n <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Draco%20Main%20ESM%20and%20ESP-12792-0-50.zip?fid=89517&ttl=1535775017&ri=8192&rs=8192&setec=2a72be40cf8627c0eb137f9700c2676f"
    },
    {
      "fileId": "96473",
      "name": "old file 0 51 esm and esp",
      "version": "0.51",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4428",
      "fileName": "Main File all you need-12792-0-51.zip",
      "uploadedUnix": "1351505586",
      "modVersion": "0.51",
      "virusScanUrl": "https://www.virustotal.com/file/d1f1946bbc14087a449837475038864a8538910d72a77ecc8f2a19d5f2cee2a8/analysis/1407240544/",
      "changelogHtml": " Fixed errors in videos and cleaned the esp with tesedit made some other small changes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File%20all%20you%20need-12792-0-51.zip?fid=96473&ttl=1535775017&ri=8192&rs=8192&setec=e44b9f4a075e64dd9bcd3c5ed502952c"
    },
    {
      "fileId": "96648",
      "name": "old file 0 51 esp and bsa",
      "version": "0.52",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16715",
      "fileName": "Castle Draco Main File all you need ESP Version and BSA-12792-0-52.zip",
      "uploadedUnix": "1351591871",
      "modVersion": "0.52",
      "virusScanUrl": "https://www.virustotal.com/file/dcd24f2093c6c58329d24ec76641de1a5deb64171c4265a1bfcd639bbfb29115/analysis/1407241933/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Draco%20Main%20File%20all%20you%20need%20ESP%20Version%20and%20BSA-12792-0-52.zip?fid=96648&ttl=1535775018&ri=8192&rs=8192&setec=2f7fb34d7831d0ef6f5dc8173fe385a6"
    },
    {
      "fileId": "101158",
      "name": "Castle Draco Main File all you need ESP Version and BSA",
      "version": "0.512",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16715",
      "fileName": "Castle Draco Main File all you need ESP Version and BSA-12792-0-512.zip",
      "uploadedUnix": "1353655360",
      "modVersion": "0.512",
      "virusScanUrl": "https://www.virustotal.com/file/1db10335c111b98c2af7e54fef2fb715cb7dc8f0d283e8a3076eef17a1c94dc7/analysis/1407274089/",
      "changelogHtml": " Small fix to freezes on load screens when loading at the Castle. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Draco%20Main%20File%20all%20you%20need%20ESP%20Version%20and%20BSA-12792-0-512.zip?fid=101158&ttl=1535775018&ri=8192&rs=8192&setec=fe303cb2624d88edad72a7bf5f248d03"
    },
    {
      "fileId": "101159",
      "name": "Castle Draco Main ESM and ESP",
      "version": "0.512",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4433",
      "fileName": "Castle Draco Main ESM and ESP-12792-0-512.zip",
      "uploadedUnix": "1353655541",
      "modVersion": "0.512",
      "virusScanUrl": "https://www.virustotal.com/file/022b3a6d8e205ce8f22b3674056e6bf67c2c4d12ef93c8f7afc0c8fa42eee237/analysis/1407274093/",
      "changelogHtml": " Small fix to freezes on load screens when loading at the Castle. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Draco%20Main%20ESM%20and%20ESP-12792-0-512.zip?fid=101159&ttl=1535775019&ri=8192&rs=8192&setec=a395a8c05875d82884a8eff4abd179e8"
    },
    {
      "fileId": "101619",
      "name": "Castle Draco Loat Paladin Edition Beta 0 60",
      "version": "0.60",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "88417",
      "fileName": "Castle Draco Loat Paladin Edition Beta 0 60-12792-0-60.zip",
      "uploadedUnix": "1353872899",
      "modVersion": "0.60",
      "virusScanUrl": "https://www.virustotal.com/file/3c6fcd9b75e6dc7706b3b2dc708e6fbfa4319113205a3f2940833d1458f0a798/analysis/1407277831/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Draco%20Loat%20Paladin%20Edition%20Beta%200%2060-12792-0-60.zip?fid=101619&ttl=1535775019&ri=8192&rs=8192&setec=67b96f3c7de71b8970d719f11f289bd3"
    },
    {
      "fileId": "101884",
      "name": "Castle Draco Loat Paladin Edition Beta 0 61",
      "version": "0.61",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "101069",
      "fileName": "Castle Draco Loat Paladin Edition Beta 0 61-12792-0-61.zip",
      "uploadedUnix": "1353986290",
      "modVersion": "0.61",
      "virusScanUrl": "https://www.virustotal.com/file/b80ee02cafe4921048e771bcd299e85330427bdf21c0d062e870993403e1f1d3/analysis/1407280054/",
      "changelogHtml": " NEW IN LOST PALADIN VERSION 0.61 ITEM SORTING ROOM. (Two use sorter place items in sorting chest click button to sort click again to get all items back in chest). Two Companions and some minor fixes. Added Mod Cathedral For a future quest. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Draco%20Loat%20Paladin%20Edition%20Beta%200%2061-12792-0-61.zip?fid=101884&ttl=1535775019&ri=8192&rs=8192&setec=1d72f50400b1b25d8bee3c2bbe4b243e"
    },
    {
      "fileId": "102116",
      "name": "Castle Draco Loat Paladin Edition Beta 0 62",
      "version": "0.62",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "101069",
      "fileName": "Castle Draco Loat Paladin Edition Beta 0 62-12792-0-62.zip",
      "uploadedUnix": "1354130438",
      "modVersion": "0.62",
      "virusScanUrl": "https://www.virustotal.com/file/46f6d088224efa413e975bffd02b4b850d4d977f548c90851360381968a6fe2c/analysis/1407283422/",
      "changelogHtml": " Third release made many bug fixes to npc&#39;s and nav meshes. BETA Please report bugs. Comments are always helpful. If any porblems read Known issues first. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Draco%20Loat%20Paladin%20Edition%20Beta%200%2062-12792-0-62.zip?fid=102116&ttl=1535775020&ri=8192&rs=8192&setec=f308a9a2ea232ec2bf461b20e16eac3d"
    },
    {
      "fileId": "102503",
      "name": "Castle Draco Loat Paladin Edition Beta 0 63",
      "version": "0.63",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "187442",
      "fileName": "Castle Draco Loat Paladin Edition Beta 0 63-12792-0-63.zip",
      "uploadedUnix": "1354347528",
      "modVersion": "0.63",
      "virusScanUrl": "https://www.virustotal.com/file/59f9c8bca12b72fc8071bf2de0297867e7598a3f8d87ebb0128ad6921ffb2879/analysis/1407286662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Draco%20Loat%20Paladin%20Edition%20Beta%200%2063-12792-0-63.zip?fid=102503&ttl=1535775020&ri=8192&rs=8192&setec=e585184041120d2d72823c758c86c1b5"
    },
    {
      "fileId": "102962",
      "name": "Castle Draco Loat Paladin Edition Beta 0 64",
      "version": "0.64",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "189020",
      "fileName": "Castle Draco Loat Paladin Edition Beta 0 64-12792-0-64.zip",
      "uploadedUnix": "1354531498",
      "modVersion": "0.64",
      "virusScanUrl": "https://www.virustotal.com/file/ff159e704a6f5ac0186581261de00917b4372e6e23cddfbd401a0daad6aad30a/analysis/1407289865/",
      "changelogHtml": " NEW IN 0.64 Moved some things around to get ready for quest chains. Fixed big bug with missing textures and meshes. Did alot of little thing more then I can remember. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Draco%20Loat%20Paladin%20Edition%20Beta%200%2064-12792-0-64.zip?fid=102962&ttl=1535775021&ri=8192&rs=8192&setec=1ec7c4b4ec0e141a2e2816e30bfd31b0"
    },
    {
      "fileId": "103154",
      "name": "Adds sorting room to forge",
      "version": "0.65",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "44",
      "fileName": "Adds sorting room to forge-12792-0-65.zip",
      "uploadedUnix": "1354630646",
      "modVersion": "0.65",
      "virusScanUrl": "https://www.virustotal.com/file/390d9c636f43a96ea221bcfe36cff00ebf2459837e1b8e6ecaa30233c2e65781/analysis/1407291188/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Adds%20sorting%20room%20to%20forge-12792-0-65.zip?fid=103154&ttl=1535775021&ri=8192&rs=8192&setec=5cfb726bfd4125902e2f96d65893a08d"
    },
    {
      "fileId": "103580",
      "name": "Castle Draco Loat Paladin Edition Beta 0 68",
      "version": "0.68",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "189203",
      "fileName": "Castle Draco Loat Paladin Edition Beta 0 68-12792-0-68.zip",
      "uploadedUnix": "1354849855",
      "modVersion": "0.68",
      "virusScanUrl": "https://www.virustotal.com/file/fb0edc8c95a73e059a00d9b9cd4f7f6e3bb1dc2dffc1dc23e1b2dbabdd1a08e5/analysis/1407840607/",
      "changelogHtml": " NEW 0.68 Made some head way with the issues in the mod releasing most stable so far. Only been doing bug fixes and cleaning to mod. But I did have to rename some form ids so treat as a new mod. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Draco%20Loat%20Paladin%20Edition%20Beta%200%2068-12792-0-68.zip?fid=103580&ttl=1535775022&ri=8192&rs=8192&setec=0af544ede51c65e45e058febff757780"
    },
    {
      "fileId": "104089",
      "name": "Castle Draco Loat Paladin Edition Beta 0 69 Test Update",
      "version": "0.69",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "1702",
      "fileName": "Castle Draco Loat Paladin Edition Beta 0 69 Test Update-12792-0-69.zip",
      "uploadedUnix": "1355071308",
      "modVersion": "0.69",
      "virusScanUrl": "https://www.virustotal.com/file/567c7dcdb56123fead6b580874ee0465c945808410c08953eabef584cad6b3f7/analysis/1407296764/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Draco%20Loat%20Paladin%20Edition%20Beta%200%2069%20Test%20Update-12792-0-69.zip?fid=104089&ttl=1535775022&ri=8192&rs=8192&setec=8b790a37c0852873a4ef6f5001ec38cf"
    }
  ]
}