{
  "modId": 12808.0,
  "modName": "Creepy Dungeons",
  "summary": "It\\'s time to fear the dark again, enter the REAL dark dungeons of Skyrim...",
  "descriptionHtml": "[i]After hours of repetitive and hard work, Creepy Dungeons is finally done! It\\'s once again time to fear the dark and enter the REAL dungeons of Skyrim...[/i]\r\n\r\nIn vanilla, when you enter a nordic ruin, it\\'s like walking around in my living room. I\\'m not getting any chills at all! This mod changes this once and for all and makes all dungeons darker by removing ambient lightning and unrealistic lightsources. This mod has been tested on my quite heavily modded Skyrim without problems but please let me know any mods conflicting.\r\n\r\nExamples of changes:\r\n1. Nordic ruins are in general abandoned for centuries and it\\'s not very likely that the draugr are walking around lightening those braziers and lanterns... Those places are dark now.\r\n2. Dwemer ruins are also supposed to be abandoned a long time ago and the falmer and the dwemer robots don\\'t need light to navigate. It\\'s dark down there now!\r\n3. Ice and water doesn\\'t emit light, thus that strange blue light in ice caves and water caves are removed.\r\n\r\nLore:\r\nSince ALL dungeons and scary locations are hand-changed, (ordinary houses etc. haven\\'t been touched.) I have taken great care in immersion and lore. Those dungeons inhabited by humans etc. are more lightened. I mean, not even a necromancer would want to grope around in the dark trying to find his spell tome...\r\n   However after very learnful comments on the mod I have learned some more about, for instance, draugr. They obviously want lights around them but personally I think it\\'s much neater if they don\\'t and that\\'s why nordic ruins still are very darkened and creepy!\r\n\r\nConflicts:\r\nMods that change the lightening in dungeons etc. would probably conflict with this mod but I would love to hear exactly which mods that conflict with this one. My screenshots have been taken using Superl3\\'s ENB mod linked here: \\\"http://skyrim.nexusmods.com/downloads/file.php?id=11318\\\", but the mod should work with whatever ENB-mod out there (at the moment only tested with 3 different ones). \r\n   Also, as this mod changes a lot of lightningsources within dungeons, it might conflict with mods that alter dungeons. I appreciate feedback on those conflicts. So take the mod as it is and if you play with heavy modded dungeons, there might be conflicts.\r\n\r\nI also suggest using some kind of everlasting torch mod or something because you don\\'t want to get stuck down there without a torch...\r\n\r\nThis mod was hard and repetitive so give me credit for it if you use it in your own mod. Feedback is always welcome! Enjoy...\r\n\r\n/Rednaolrac aka Svabbarjack\r\n",
  "categoryId": "78",
  "version": "1.00",
  "author": "Rednaolrac",
  "createdUnix": "1331629750",
  "updatedUnix": "1331634827",
  "containsAdultContent": false,
  "uploadedBy": "Rednaolrac",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42894",
      "name": "Creepy Dungeons",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "46",
      "fileName": "Creepy Dungeons-12808-1-0.rar",
      "uploadedUnix": "1331634827",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d8e0d53b7b996830528cab64b07a06b6edb02e1f315d5321cb153d58050aa1c4/analysis/1406746577/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Creepy%20Dungeons-12808-1-0.rar?fid=42894&ttl=1535775050&ri=8192&rs=8192&setec=453e15b3e73066fbb81c8ba24a5c2c73"
    }
  ]
}