{
  "modId": 12819.0,
  "modName": "ACE Sandbox - New Features",
  "summary": "Sandbox area for testing out new effects to be implemented in ACE. Some files are in beta, some work, all are open to discussion and building better ones. Several modders have access to this page and more can get access if they want to participate in R&D. :)",
  "descriptionHtml": "[center][color=#008000][size=4][b]What this Mod Is[/b][/size][/color]\r\nSandbox area for testing out new effects to be implemented in [url=http://skyrim.nexusmods.com/downloads/file.php?id=10037]ACE - Comprehensive Enhacements[/url]. \r\nSome files are in beta, some work, all are open to discussion and building better ones. \r\nSeveral modders have access to this page and more can get access if they want to participate in R&D. :)\r\n\r\n[color=#008000][size=5][b]Future Plans & Ideas[/b][/size][/color]\r\n\r\n[b][color=#00c0ee]ACE Archery[/color][/b]\r\n- same stamina drain for longbows? \r\n- after X distance, shots do -% dmg, long shoot farther thn short\r\n- implement the z arrows\r\n- If the Archery skill is <33, arrows get 1/2 chance to do critical damage after medium range, if <66 then after long range, if >90 then full no penalty. Long and Light arrows would have different medium & long range values\r\n\r\n[b][color=#00c0ee]ACE Armor[/color][/b]\r\n- Light armor\\'s dodge bonus does not apply while flat-footed or prone, is halved while standing still or sprinting, and is 50% better while walking or running\r\n- When carry weight is within 10% overweight, stamina/magicka regeneration and movement speed are reduced by 25%\r\n- When carry weight is between 10% and 20% overweight, stamina/magicka regeneration and movement speed are reduced by 50%\r\n- When carry weight is between 20% and 30% overweight, stamina/magicka regeneration and movement speed are reduced by 75%\r\n- When carry weight is between 30% and 40% overweight, stamina/magicka regeneration and movement speed are reduced by 95%\r\n- When carry weight is 40% or more overweight, stamina/magicka regeneration and movement speed are reduced by 100%\r\n(so max movable weight is at 39% overweight, so if you play with a base of 300, then with more than 417 weight you are unmovable)\r\n(max movable weight will also be lower if other effects are currently reducing your movement speed, as they stack)  \r\n\r\n\r\n[b][color=#00c0ee]ACE Conjuration[/color][/b] (not yet in master file)\r\n- check out summoning bound armor\r\n\r\n\r\n[b][color=#00c0ee]ACE Enchanting[/color][/b]\r\n- more ideas?\r\n\r\n\r\n[b][color=#00c0ee]ACE Melee[/color][/b]\r\n- possible to use some stamina on misses (Maybe put this in RF)\r\n- make all weapons add a % of the weapon skill level to critical damage (to overcome the flaw in vanilla where criticals don\\'t increase as you get stronger)\r\n\r\n\r\n[b][color=#00c0ee]ACE Realistic Fighting[/color][/b]\r\n- waiting for feedback and ideas? :)\r\n\r\n\r\n[b][color=#00c0ee]ACE Smithing[/color][/b]\r\n- add effects to weapons if player has their material\\'s smithing perk\r\n- Tempering bonus for light weapons that are made of materials associated with light armor (daggers, swords, 1h-axes, light bows)\r\n- Tempering bonus for heavy weapons that are made of materials associated with heavt armor (1h maces, 2h maces, long bows)\r\n(not sure what to do about 2h axes and greatswords ... the rationale is that the \\\"light\\\" materials are better suited to slicing edges and piercing points, but that the \\\"heavy\\\" materials are better suited to mass-impact and hard surfaces )\r\n\r\n\r\n[b][color=#00c0ee]ACE Speech[/color][/b]\r\n- Make followers smarter\r\n\r\n[b][color=#00c0ee]ACE Synergy[/color][/b]\r\n- figure out a way to display what effects are active, maybe byog-type show effects display, or a book ...\r\n- move effects to area-effect type spells, if it\\'s not too laggy\r\n- add bonuses based on blessings and standing stones\r\n- add more bonuses (suggestions moved to the bottom of this page since there are so many)\r\n \r\n[b][color=#00c0ee]Casting Forms[/color][/b]\r\n- Certain conditions unlock casting forms, forms are powers that set one of the following forms.\r\n- Forms can be unlocked based on which perks the player has, skill levels, or other factors\r\n- Forms last 20 minutes of game-time, they are a state of mind and can\\'t be changed often\r\n- Once a form is set, another one can not replace it until the first one expires\r\n\r\n* [b]Reckless Control OR Chaos Form[/b] \r\n(each effect has an independent chance of occurring, several may occur at once) \r\n-> 5% Chance 33% or 150% Damage or Magnitude or Duration\r\n-> 20% Chance 66% or 133% Damage or Magnitude or Duration\r\n-> 33% Chance 75% or 125% Casting Cost\r\n-> 1% Chance Spell Failure (0% power or mana-drain)\r\n-> 0.5% Chance Self Damage / or fall over / or daze (like reading the Elder Scroll)\r\nOR\r\n(each effect has an independent chance of occurring, several may occur at once) \r\n-> 10% chance impotent or superpower(3x) \r\n-> 25% chance half power or 2x power \r\n-> 33% chance half cost or 2x cost \r\nOR\r\nsome combination or other ideas\r\n\r\n* [b]Battlemage Form[/b] \r\n-> +25% Magicka Regen, +10% Cost; +10% destruction power; -25% other schools power\r\nOR\r\n-> moving speed and sneak are reduced by 90%, spell cost is 10% higher but spell power is 40% higher\r\nOR\r\nsome combination or other ideas\r\n\r\n* [b]Spellsword Form[/b] \r\n-> -25% Magicka Regeneration, -10% Casting Cost, -10% Destruction Spell Damage, +25% Other school Spell power\r\nOR\r\n-> +200 Magicka points, -75% magicka regeneration, +150% duration of alteration spells, -75% power of destruction spells\r\nOR\r\n-> all spells -50% cost, -50% power, magicka regen +50%\r\nOR\r\nsome combination or other ideas\r\n\r\n* [b]Potentia Animi OR Powerhouse Form[/b] \r\n-> +5% Destruction Spell Damage, -10% Other Spell Magnitude, +2.5% Casting Cost\r\n-> -1% / +1% / -0.5% Adjustment per 10% Health, Stamina, or Magicka lost (up to -29%/+29%/-14.5% at 0 stamina 0 magicka and <10% health)\r\nOR\r\n-> +15% casting cost but +25% spell power\r\nOR\r\nsome combination or other ideas\r\n\r\n* [b]Corpus et Anima OR Corpus Spiritus OR Channel Form[/b]\r\n-> -5% Destruction Spell Damage, +10% Other Spell Magnitude, -2.5% Casting Cost\r\n-> -1% / +1% / -0.5% Adjustment per 10% Health, Stamina, or Magicka lost (up to -29%/+29%/-14.5% at 0 stamina 0 magicka and <10% health)\r\nOR\r\n-> Magicka and Stamina regen stop but spells cost 15% less and are 20% stronger \r\n-> If stamina or health goes below 50% power increases to +30% \r\n-> If both go below 50% power increases to +50% \r\nOR\r\nsome combination or other ideas\r\n\r\n* [b]____ School Specialization Form[/b] (this would be 5 different forms)\r\n( Replace ____ with Alteration/Conjuration/Illusion/etc )\r\n-> _____ Spells are 30% stronger/longer and -30% cost, all other schools are -30% power/length and +30% cost\r\nOR\r\n-> Specialized School: +15% power/length, -15% cost\r\n-> 2 Neutral Schools: no changes\r\n-> 2 Weak Schools:  -10% power/length, +10% cost, and 20% Chance Spell Failure\r\nOR\r\nsome combination or other ideas\r\n\r\nSpecialized School : 2 Neutral Schools : 2 Weak Schools\r\nDest : Alt & Conj : Rest & Ill\r\nAlt : Dest & Rest : Ill & Conj\r\nRest: Alt & Ill : Dest & Conj\r\nIll : Rest & Conj : Dest & Alt\r\nConj : Ill & Dest : Alt & Rest\r\n\r\n* [b]Purus Forma[/b]\r\n-> +5% Magicka Regeneration, -5% Casting Cost\r\n\r\n\r\n[b][color=#00c0ee]Asyrin\\'s Trees & Zenogais\\' Block[/color][/b]\r\n\r\nConcept: Currently there are two offensive melee combat trees and one defensive combat tree. In order to be effective in modified complex combat, a character must choose one of the two offensive trees and some or all of the block tree. Two-handers, Spellswords, and Duelists often take the “stump” of the block tree in order to enhance their game despite the fact that the tree was primarily designed with a shield in mind. \r\n\r\nGoal: Differentiate the melee combat trees to better compliment differing fighting styles in a more intuitive fashion while maintaining a balance of both game difficulty and perk points spent. \r\n\r\nOverview: Specialize Two-handed, Block, and One-handed trees into unique and complete melee packages that would allow for a far more distinct and different feel to each style. \r\n\r\nProtection - Replaces Block Tree. The character who specializes into Protection has mastered the Art of combining one-handed weapon and shield. More than just a board to take hits on, the shield becomes an offensive weapon as well as a defensive tool. This tree focuses on utilizing weapon and shield together offensively and defensively. This character has an answer for most everything and her abilities are often in response to or anticipation of attacks by her opponent. \r\n\r\nFinesse - Replaces One-handed Tree. The quintessential Weaponsmaster. The tree allows for further Customization into the Twin Blades (Dual Wielding), Spellsword (One hand spell, the other weapon), and Duelist (Off hand empty) styles. All three styles focus to one degree or another on misdirection, speed, and agility. They dodge, parry, disarm, and strike with lightning fast attacks enhanced by their chosen path. \r\n\r\nSavagery - Replaces Two-Handed Tree. A mountain of power. A rage and fury unrivaled in Skyrim. This tree focuses on pure brute force, the Berserker who thrives on the blood of his enemies and a massive weapon few would be able to hold much less wield with the deadly accuracy she\\'s capable of. Instead of dancing around like the Finesse fighters or cowering behind a metal sheet like the Protection fighters, she embraces the adrenaline of combat, using it to rejuvenate her and fuel the burning swath of death she leaves behind her. \r\n\r\n\r\n---Protection--- \r\n- Knight - Unlocks Dragonknight Stance while wielding a shield which has an 8% chance to reflect melee attacks back at the attacker and increases One-handed weapon damage by 20%. \r\n- Power Bash - Allows you to do a Power Bash with a shield. \r\n- Shield Training - Reduces the stamina cost of your Shield Bash by 30% and Power Attacks by 30%. \r\n- Shield Spike - Bashing does 5 times more damage and leaves a long duration bleed when unblocked. \r\n- Strong Arm - Bashing with a Heavy Shield deals 50% of the damage to an opponent\\'s stamina as it does to their health. \r\n- Quick Arm - Increases the speed of your power bash with a Light shield by 20% \r\n- Follow-through - After bashing an opponent that doesn\\'t block your next melee deals double damage. \r\n- Pincushion - Blocked arrows deal no damage and you have an 8% chance of automatically taking no damage from arrows. \r\n- Daze - Your power bash has a 15% chance of throwing an opponent to the ground. \r\n- Elemental Protection - Blocking with a Shield reduces incoming fire, frost, and lightning damage by 50%. \r\n- Elemental Reflection - Blocking with a Shield gives you a 15% chance to reflect spells. \r\n- Block Runner - Able to move faster with a shield raised. \r\n- Shield Charge - Sprinting with a shield knocks down most opponents. \r\n- Quick Reflexes - Time slows down if you are blocking during an enemy\\'s power attack. \r\n- Shield Wall - Lesser Power: Reduces incoming damage by 50%, outgoing damage by 50%, and drains 15 stamina per second (toggle) \r\n\r\n\r\n---Finesse--- \r\n- Weaponmaster - Unlocks Spellsword, Duelist, and Twin Blade fighting styles \r\nSpellsword Stance: Melee attacks restore a small amount of mana. Increases the magnitude and duration of all spells 10% and the cost by 15% while wielding a one-handed weapon and a spell in your off-hand. \r\n- Spell Parry - While in Spellsword Stance you take 15% less damage from frost, fire, and lightning effects. \r\n- Elemental Punishment - Increases elemental damage you deal for 3 seconds following an unblocked power attack. \r\n- Mystic Synergy - The spell in your off hand melds perfectly with your weapon, granting it additional effects when you power attack: \r\nFire Spell - Deals X fire damage and sets the target aflame. Targets on fire take additional damage. (benefits from Intense Flames Destruction Tree) \r\nIce Spell - Deals X frost damage to health and stamina and slows the target (Benefits from Augmented Frost) \r\nLightning Spell - Deals X Lightning damage to health and magicka. (Benefits from Augmented Shock) \r\nRestoration Spell - Heals you for a small percentage of your health (Benefits from Regeneration Restoration Tree) \r\nMage Armor Spell - You take 50% less damage for 3 seconds. \r\n\r\nDuelist Stance: Slows time by 10% when in combat and wielding a one-handed weapon with your off-hand empty, increases your critical strike chance by 5% and your movement speed by 10%. \r\n- Celerity - Unblocked Attacks in Duelist Stance increase your weapon speed and damage by 10% for 3 seconds stacking up to 3 times. Each application of celerity resets the duration. \r\n- Riposte - Increases the effectiveness of blocking with a one-handed weapon by 40% and after successfully blocking an attack gives your next unblocked power attack a 50% chance to disarm your opponent. \r\n- Bladedance - Increases the damage you deal to an opponent from the side and back by an additional 35%. \r\n\r\nTwin Blades Stance: Dual wield attacks are 10% faster and increases your parry chance by 15% while wielding two one-handed weapons. \r\n- Whirlwind - Backwards power attacks damage opponents on all sides of you. \r\n- Disembowel - Attacks with your main hand increase the damage of your offhand attacks by 50% \r\n- Scissorcut - Increases the damage of your dual wield power attacks by 50% \r\n- Weapons Efficiency - Decreases power attack stamina cost by 25%/50% \r\n\r\n\r\n\r\n---Savagery--- \r\n- Berserker  - Unlocks Berserker Stance while wielding a two-handed Hammer, Sword, or Axe. Berserker Stance increases health and stamina regeneration by 30% and increases all damage done with weapons by 20%. \r\n- Painless  - Pain is for the weak and puny! Ignore 5/10/15% of all incoming damage while in Berserker Stance. \r\n- Crushing Blow  - Pardon me, there\\'s a dent in your helm roughly the shape of my weapon and something leaking out. Your attacks ignore 20/40/60% of your opponent\\'s armor. \r\n- Impale  - Just a scratch...right through your lower intestine. Increases your critical strike chance with Greatswords by 5/10/15% and your critical strike damage by 15/30/45%. \r\n- Flesh Hook  - Hook and rip \\'em open. Unlocked Power attacks made with Battleaxes cause the opponent to bleed for 15/30/45% of the damage done over 4 seconds. \r\n- Two-handed Bash  - Increases the speed of your bash with two-handed weapons by 30% and doubles its damage. \r\n- Ring the Bell  - Here, catch! Attacks with Warhammers have a x/x/x% chance of knocking your opponent to the ground. \r\n- Heavy Lifting  - Nothing ruins your morning like a massive chunk of metal to the head. Increases your chance to stagger with all attacks by 50/100% in Berserker stance. (note, this means you take the base chance for stagger and double it...NOT that every hit staggers) \r\n- Weight Training  - What? This small thing? Not heavy at all. Reduces Stamina cost of Power Attacks by 15/35%. \r\n- Sweeping Strike  - Size does matter. Your power attacks hit all targets in front of you. \r\n- Death Machine  - Blood of your enemies fuels your rage. Whenever an enemy dies within 15 yards, you gain 100% stamina and health regeneration for 3 seconds. \r\n- Bloodbath  - Killing an opponent while in Berserker Stance increases your melee damage by 50% for 5 seconds. \r\n- Overkill  - While in Berserker Stance melee attacks against opponents with 20% or less health have a 30% chance of killing them outright. \r\n- Avatar of Rage - You become Fury itself. (Lesser Power) Increases all outgoing melee damage by 75% melee attack speed by 30% and all incoming damage by 75%. Continually drains stamina.\r\n\r\n\r\n\r\nZenogais Block:\r\n\r\nWrote out a very rough \\'first sketch\\' to what\\'s on my mind for this tree. There\\'s 3 trees (off_stance, general, and def_stance). The passive effects/bonuses to Power Bash should be restricted to that stance only (ie if in off_stance, no perfect_wall benefits, etc.). The [Burst_Stance] can be opened to either stance, as a once a day \\'super form\\'.\r\n\r\n[url=http://i33.photobucket.com/albums/d54/zenogais85/Block_Draft.jpg]Here[/url] is a sketched perk tree design. For the most part, everything\\'s in placeholder status (perk names, passive bonuses, etc.). The layout and general order of power are what I\\'m pushing. ^.^\r\n\r\nGeneral flow is each perk requires the previous. Notable marks:\r\n- : \\'Dead-End\\' branch from previous perk.\r\n=: Last perk of the branch\r\n\r\n(Novice Block): +Effectiveness; +Deflect_Arrow%\r\n\r\n[ShieldMaster]\r\n(Power Bash): Unlock Power_Bash; +Effectiveness; +Disarm%\r\n(Quick Reflexes(1)): +Effectiveness; +Deflect_Arrow%; +Disarm%\r\n(Quick Reflexes(2)): 2sec Time_Dilation\r\n-(Block Runner): +Move_Speed_while_Blocking; -Received_Stagger_Duration\r\n-(Shield Charge): +Sprint_Knockdown; -Received_Stagger_Chance\r\n=(Elemental Protection): +Magic_Damage_Reduction; +(Low)Deflect_Magic_Projectile_Chance\r\n\r\n[Offense_Stance]\r\n(Improve_Stance): +Stance_Passive\r\n-(Power_Bash_Proc): +Damage_Buff_upon_Successful_Bash (short duration; 1/2 attacks)\r\n(Mobile_Ram(1)): +Move_Speed_while_Blocking; +Shield_Charge_Radius\r\n(Mobile_Ram(2)): +Shield_Charge_Radius; +Shield_Charge_Damage; -Sprint_Paralyze_Chance; +Stamina_Cost_while_Charging \r\n=(Burst_Stance): +Improved_Stance_Passives/Proc(short duration; 1 use/day)\r\n\r\n[Defense_Stance]\r\n(Improve_Stance): +Stance_Passive\r\n-(Power_Bash_Proc): +Stamina_upon_Successful_Bash\r\n(Perfect_Wall(1)): (While Immobile+Blocking) (Large) +Deflect_Arrow%; +Deflect_Magic_Projectile_Chance; -Stagger_Chance\r\n(Perfect_Wall(2)): (While Immobile+Blocking) (Perfect) Deflect_Arrow; Deflect_Magic_Projectile; 0_Stagger_Chance; (HUGE) +Stamina_Cost_per_Received_Attack\r\n=(Burst_Stance): +Improved_Stance_Passives/Proc(short duration; 1 use/day)\r\n\r\nNotables:\r\nShieldmaster tree: Dead end branches and final perk are logically placed against each other, but not perfect for stance trees (particularly Perfect_Wall/Elemental Protection). If possible, The improved effects in the stance branches should be null until the shieldmaster perk that unlocks them is taken.\r\n\r\nOff_Stance: Theme here is charging into the enemy, and pounding their faces in(with their shield). Mobile Ram (in theory) drastically improves Shield Charge, while costing more stamina. The Power Bash proc here is to simulate followups with your main hand weapon.\r\n\r\nDef_Stance: Theme here is an immovable Wall that will outlast any onslaught. Perfect Wall drastically changes immobile blocking to make the wielder untouchable/unmovable, but only until your stamina is gone. I\\'d want this to handle a dragon\\'s breath attack through most/all it\\'s duration. Power Bash Proc is to help endure/recoup during long fights.\r\n\r\nStance_Passives: Not solid on what these should be yet. +Disarm% should be a defense stance passive. +Bash_Damage should be an offense stance passive. Beyond those...not sure yet.\r\n\r\nOptions: \r\n-Bash_Proc and Improve_Stance could be swapped, letting Improve_Stance improve the Proc effect.\r\n-Moving Shield_Charge, Block_Runner, Elemental_Protection around.\r\n\r\nIdeal Passive Range(s): \r\nBlock Effectiveness: ~10-50% (Def_Stance: ~65%; Perf_Wall: cap) \r\nDeflect_Arrow_Chance: ~10-50% (Def_Stance: ~75%; Perf_Wall: cap) \r\nDisarm_Chance: ~5-15% (Def_Stance: ~15-50%) \r\nMove_Speed_while_Blocking: ~10% (Off_Stance: ~15%; Mobile_Ram: ~25%) \r\nMagic_Damage_Reduction: ~33% \r\nDeflect_Magic_Projectile_Chance: ~10% (Def_Stance: ~15-25%; Perf_Wall: cap) \r\nPower_Bash_Damage: ~1x-3x (Off_Stance: ~3x-10x) \r\n\r\nOff_Bash_Proc: ~5-10% +Damage; ~0.5-1 second duration \r\nDef_Bash_Proc: ~5-10% +Stamina; (+Stagger Chance?) \r\n\r\nOff_Passives (+Burst Effects): +Bash_Damage; +Move_Speed; +Off_Bash_Proc; +Charge_Radius \r\nDef_Passives (+Burst Effects): +Effectiveness; +Deflect; +Disarm; +Deflect_Magic; +Def_Bash_Proc \r\nBurst_Stance: ~10-15 second duration; 1/day usage \r\n\r\nEffectively, the burst stance should either cap the stats(minus what Mobile_Ram(2)/Perfect_Wall(2) give) of the stance you\\'re currently in, or improve the stats of the stance you\\'re not in (giving Def_Stance Offensive stats or vice versa). This would, for example, make a Defense Stance character act as if using Perfect_Wall(2) while moving, or grant the Defense Stance character the damage bash proc and increased bash damage, etc. \r\n\r\nStamina use: I see the second perk perks(Mobile/Quick/Perfect) in each tree (they each add new mechanics) as \\\"new skills\\\". The stamina usage of these should reflect the drastic change (and also why they\\'re second perks and not required to progress to the end of the branch). \r\n-As mentioned in above post, the Perfect_Wall should be able to handle a dragon\\'s full breath duration (if just barely, or not quite the full). Something that\\'d be helpful to prevent exploitation (twitchy players surely can stop and block at a moments notice) would be to place a delay timer on the immunity effects (say; 1-1.5 seconds). \r\n-Mobile_Ram should have increased stamina cost for each target \\'charged\\'. Damage could be comparable to baseline power bash (whatever you can get out of shieldmaster perks) or higher, and should have a huge (100% even?) stagger chance (if not already).\r\n\r\n\r\n\r\n[color=#008000][size=5][b]Specific Files and their Contents[/b][/size][/color]\r\n[b]ACE Z Melee[/b]\r\nThis is a new project by me, Zeromus, to further enhance the ACE Melee module. This will be focused on letting players get abilities organically when they reach a certain skill level and have certain perks, as well as capitalizing on ACE Realistic Fighting\\'s directional effects.\r\n\r\nShield Abilities:\r\n- Defender: Lowers attack by 25% but gain a 25% boost to armor rating (or damage resistance)\r\n- Sentinel: Enormous boost to physical damage resistance that degrades over time, but alters enemies aggression to pursue you forever\r\n- Shield Smash: Temporary boost to shield bash damage\r\n- Rampart: Temporary boost to magic resistance\r\n\r\nDuelist Abilities:\r\n- Grace: Boost to movement speed\r\n- Duel Stance (Spirit): Halves melee damage in favor of doing 50% damage to opponents magicka\r\n- Duel Stance (Vigor): Halves melee damage in favor of doing 50% damage to opponents stamina\r\n- Disarming Lunge: Bonus to disarm on weapon bash\r\n- Parry: Boost to block skill when using one weapon\r\n\r\nDual Wield Abilities:\r\n- Sneak Attack: Boost to damage and crit chance when attacking from behind\r\n- Berserk: Lowers armor rating by 25% but gives a 25% boost to damage\r\n- Kidney Stab: Boost to damage when attacking from the side\r\n\r\n[b]Nifty Arrows[/b]\r\nNifty Arrows are some arrows I made just for fun and are subject to change based on user feedback. I will be updating the ESP file so they\\'re easier to find, but for now the instructions to get them are in the comments section. I will update this when I\\'ve uploaded a new esp to use.\r\n\r\nThere\\'s now a chest in The Drunken Hunstman in Whiterun containing all my arrows thus far for testing!\r\n\r\nArrow Effects are as follows:\r\n- Napalm (Regular, Trap, Timer): Regular napalm arrows explode and release flaming gas at the point of impact, burning any targets in range. The Trap arrows allow you to fire and arrow and set it up as a trap. When an enemy comes within range, it detonates and leaves burning gas in it\\'s wake. The timer allows you to shoot an arrow that, after 3 seconds, detonates with flaming gas. The timer arrow has a wider area than the regular or trap varieties.\r\n- Poison gas arrow: Releases a cloud of poisonous gas in large area. Eventually this arrow will do a bit less damage in a shorter area.\r\n- Blitz arrow: This arrow spawns a shock trap on impact, dealing damage to health and magicka. Will eventually be changed to deal more magicka damage than health, making this arrow invaluable against mages.\r\n- Diamond Dust arrow: On impact, momentarily freezes target and reduces movement speed by 75% for 20 seconds, making this a great \\\"get away\\\" arrow.\r\n- Frenzy/Calm gas arrows: Frenzy or calm targets in a small area for 10 seconds. A good opener or if you just need a chance to catch your breath\r\n- Proximity arrow: Very simple arrow, causes arrow to become armed with an explosive after firing. When an enemy comes within range...boom. \r\n\r\n\r\n\r\n[color=#00f0f0][size=4][b]These are suggested ideas for Synergy Bonuses[/b][/size][/color]\r\n\r\nThese are mine and player suggested bonuses to be considered & discussed:\r\n[b] * If you like any of these ideas, now is the time to comment or suggest something! *[/b]\r\n[size=2][color=#00c0ee]\r\n\r\n[b][Mage][/b]\r\n? Conjuration & destruction relevant elemental damage or effect perk = stronger summoned atronachs. \r\n[How about: all 3 basic elemental atornachs exploding upon death (much like the flame atornach already does, only make it much more powerful), causing respective elemental damage, based on destrucions skill level.]\r\n? Alchemy & Restoration skill levels = +15% stronger restoration potions and/or fortify potions\r\n? Master of the Mind + Master Alteration = Cannot be staggered while casting. \r\n? Restoration + Experimenter 2 + Green Thumb = Food has additional benefits and stronger healing. \r\n\r\n[b][Warrior][/b]\r\n? 1-handed & 2-handed = a kind of melee master\r\n[how about: When both are level 90+: A higher % chance of finishing moves.]\r\n? Shield charge & Reflect blows: % chance to disarm enemies when the succesfully hit you with a melee attack.\r\n? Blocking + Two-Handed 90 = Bashing with a two-handed staggers all enemies in front of you. \r\n\r\n[b][Thief][/b]\r\n? Sneak & Speechcraft & Locksmith = a kind of master thief\r\n[How about: When all thief skills are level 100 (very hard to do), neutral NPC\\'s will no longer turn hostile upon witnessing crimes. Requires presence perk.]\r\n? Archery and Sneaking, permanent buff of detect life. \r\n? Sneak and Speech, sell stolen goods in any vendor \r\n? Top Light Armor perk + Shadow Warrior = additional chance to dodge any attack, ranged or melee. \r\n\r\n[b][Warrior-Mage][/b]\r\n? destruction & light/heavy armor = spells do more damage to armored enemies \r\n? Adept Alteration & Fighting Stance = Bull\\'s Strength (power attacks with one handed weapons deal +damage) \r\n? Adept Alteration & Champions Stance = Giant\\'s Strength (power attacks with two handed weapons deal +damage) \r\n? Disarming Bash + Enhanced Flames/Shock/Frost lvl3 = Power Bashing with a damage cloak increases the damage of the cloak. \r\n? Kindred Mage + Champion Stance = bonus melee damage to Calmed enemies. \r\n\r\n[b][Warrior-Thief][/b]\r\n? Intimidate & power attack perks = enemies have a chance to flee on power attacks\r\n? Lockpicking + all Dual Wield perks in One-Handed = slightly increased \\\"sweet spot\\\" on locks of all difficulties \r\n? Reflect Blows + Lockpicking + at least 3 Lockpicking perks = Once a day use your brute strength to smash a lock to pieces. \r\n\r\n[b][Thief-Mage][/b]\r\n? Powershot & Intense Flames = Flame Imbued Shots (causes targets to flee if their health is low) \r\n? Powershot & Deep Freeze = Frost Imbued Shots (paralyze targets if their health is low) \r\n? Powershot & Disintegrate = Shock Imbued Shots (disintegrate targets if their health is low) \r\n? Powershot & Poisoner = Assassins Shot (additional damage dealt as poison damage) \r\n(Could do the same with this with One Handed and Two Handed weapons, but lessen the effects to balance it with the higher attack rate of melee weapons) \r\n? Adept Alteration & Eagle Eye = Cat\\'s Eyes (bow shots whilst zooming cause + damage) \r\n? Quick Hands + Adept casting for all Alteration/Conjuration/Destruction/Illusion/Restoration = Spellcasting Prodigy (Charge up speed of all spells increased)\r\n? Archery + Alterration, you can get closer to beasts before they spot you. \r\n? Destruction & stamina > 75% or stamina is highest attribute = you can cast faster. \r\n? Restoration & Speechcraft = normal heal spells heal all friendlies around you also a bit. \r\n\r\n[b][Warrior-Mage-Thief][/b]\r\n? Snakeblood + tier 3 sword perk(s) + Alteration + Kindred Mage = chance on crit to deal poison damage over time\r\n\r\n[b][Racial][/b]\r\n? player race & skill related to lore or racial power = ? for example, a wood elf with high archery\r\n? Player race & enemies equipment & smithing perk = take less damage from your races weapons, do more damage to your races armors\r\n[/color][/size]\r\n\r\n\r\n[/center]",
  "categoryId": "77",
  "version": "2.3",
  "author": "Athyra - Zeromus88",
  "createdUnix": "1331650515",
  "updatedUnix": "1345837051",
  "containsAdultContent": false,
  "uploadedBy": "Athyra",
  "primaryFile": null,
  "files": [
    {
      "fileId": "60902",
      "name": "Playtest Arrow Effects",
      "version": "1.somethin",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "Playtest Arrow Effects-12819.rar",
      "uploadedUnix": "1336880270",
      "modVersion": "1.somethin",
      "virusScanUrl": "https://www.virustotal.com/file/0c2994a7fc034339bcf3fb4b009df4624e2237b44824675c242f1e7d85ba0890/analysis/1406888470/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Playtest%20Arrow%20Effects-12819.rar?fid=60902&ttl=1535775070&ri=8192&rs=8192&setec=53ff1065736d939643d9ee93573afd84"
    },
    {
      "fileId": "65072",
      "name": "ACE Nifty Arrows Test 3",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25",
      "fileName": "ACE Nifty Arrows Test 3-12819-2-3.rar",
      "uploadedUnix": "1338561144",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/f09cb3ff85ffc218a9142f4f1572d06efe9df2c001d454ea64c237add30a2d15/analysis/1406929564/",
      "changelogHtml": " Z Arrows - Removed shatter effect from glass arrow. Has slightly lower bleed but set up for AP <br/> \n Nifty Arrows - Added new arrow to testing chest <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ACE%20Nifty%20Arrows%20Test%203-12819-2-3.rar?fid=65072&ttl=1535775071&ri=8192&rs=8192&setec=093926d87d72d392ec9adb48e122ba48"
    },
    {
      "fileId": "73953",
      "name": "ACE Archery v12a inc Z Arrows",
      "version": "12a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "108",
      "fileName": "ACE Archery v12a inc Z Arrows-12819-12a.7z",
      "uploadedUnix": "1342159555",
      "modVersion": "12a",
      "virusScanUrl": "https://www.virustotal.com/file/6c546030ed90cd33701f5f86844b7b51e7d2a7f9ee04fe0e2bb353e1331a026d/analysis/1407019383/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ACE%20Archery%20v12a%20inc%20Z%20Arrows-12819-12a.7z?fid=73953&ttl=1535775072&ri=8192&rs=8192&setec=3ac991b27f0e711c1f4c78b393c5b0aa"
    },
    {
      "fileId": "74706",
      "name": "Arrows Tweaks - Recovery Rate - All options",
      "version": "2.8",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "2",
      "fileName": "Arrows Tweaks - Recovery Rate - All options-12819-2-8.7z",
      "uploadedUnix": "1342449308",
      "modVersion": "2.8",
      "virusScanUrl": "https://www.virustotal.com/file/b8f76bffce96db04afdba16a5e56052235d2f09f072537551c8d04faf5628179/analysis/1407026403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arrows%20Tweaks%20-%20Recovery%20Rate%20-%20All%20options-12819-2-8.7z?fid=74706&ttl=1535775072&ri=8192&rs=8192&setec=3b4b7a16142662e2e838b78956d70608"
    },
    {
      "fileId": "82111",
      "name": "All ACE Mods DATA Files and Misc",
      "version": "99",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "90756",
      "fileName": "All ACE Mods DATA Files and Misc-12819-99.7z",
      "uploadedUnix": "1345167776",
      "modVersion": "99",
      "virusScanUrl": "https://www.virustotal.com/file/650e562d6da6b6d01653752009d30fff003ef0712a522ac9437d1fac543026c9/analysis/1407101941/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%20ACE%20Mods%20DATA%20Files%20and%20Misc-12819-99.7z?fid=82111&ttl=1535775073&ri=8192&rs=8192&setec=fbe81c7dae469a0a56fe913e9f4e1c65"
    },
    {
      "fileId": "83841",
      "name": "ACE Archery Dawnguard Z Arrows",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "111",
      "fileName": "ACE Archery Dawnguard Z Arrows-12819-1-0.7z",
      "uploadedUnix": "1345790772",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/61e26751749732bc80a0dab89a8a27a4b7b16250ea3e3d433d81497d03bd631b/analysis/1407117964/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ACE%20Archery%20Dawnguard%20Z%20Arrows-12819-1-0.7z?fid=83841&ttl=1535775073&ri=8192&rs=8192&setec=86818d8fc890cd9fe148ccb47cf01e95"
    },
    {
      "fileId": "83984",
      "name": "ACE Archery DG Patch",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17",
      "fileName": "ACE Archery DG Patch-12819-1-1.7z",
      "uploadedUnix": "1345837051",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/71ca3e230c2fc0d3e27a30322242a6530bbd1764f01c912a1f839f14ccab63d0/analysis/1407119288/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ACE%20Archery%20DG%20Patch-12819-1-1.7z?fid=83984&ttl=1535775073&ri=8192&rs=8192&setec=88d6df7ea2ef984c5ea84c8bb0934238"
    }
  ]
}