{
  "modId": 12820.0,
  "modName": "Black Hands Dagger",
  "summary": "Very deadly Daedric dagger for assassins. It will paralyze your prey for one second and absorb 20 points of their health for 30 seconds (plus the base of 9 that the actual dagger does). It can be found in the Dawnstar Dark Brotherhood Sanctuary.",
  "descriptionHtml": "First off, this is my first mod so I\\'m sorry if there are any problems. Just let me know what they are and we\\'ll figure it out.\r\nVery deadly Daedric dagger for assassins. It will paralyze your prey for one second and absorb 20 points of their health for 30 seconds. Also, I made the speed of the attack a little too fast but after playing with it this way for a bit I kind of liked it this way. So, if it seems like your character doesn\\'t move when attacking with this, they actually are moving so fast it\\'s hard to see LOL. It can be found in the Dawnstar Dark Brotherhood Sanctuary.\r\nThis weapon was the most powerful in Morrowind and I thought it was pretty sad that it wasn\\'t in Skyrim. I tried to keep it as true to the original and lore friendly to Skyrim as possible. I didn\\'t make a story for this (yet) but let\\'s just assume someone in the DB assassinated someone from the Morag Tong who had it or something like that :p. I also placed it in Dawnstar Sanctuary so it would have somewhat of an assassins prerequisite. When I made and placed this I had already done the remodel quest for the Dawnstar Sanctuary BUT I\\'m pretty sure it should be there before and after the remodel quest.\r\n\r\nBUGS- \r\n\r\nnot exactly a bug but in your menu under weapons it will say it only absorbs health and not for 30 seconds but it actually does absorb for 30 seconds.\r\n\r\nthere is a bug i noticed when you kill some people really fast by slashing them repeatedly they will be standing and sometimes walking in place while dead. sometimes right after they\\'ve died they\\'ll fall then get back up and walk in place. you can still search the body and take their things though. not sure what causes this but doesn\\'t seem to be a problem\r\n\r\nsometimes a dead body on the ground will remain paralyzed instead of going limp but again you can still search the body and also move the body around. the limbs just remain rigid\r\n\r\n**spoiler** \r\n-----------------------\r\nthe dagger is on the table after you go down the entrance way hall. pretty close to where the night mother ends up (on that same level).",
  "categoryId": "55",
  "version": "1.0",
  "author": "garfieldjael",
  "createdUnix": "1331650535",
  "updatedUnix": "1331650941",
  "containsAdultContent": false,
  "uploadedBy": "GarfieldJael",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42937",
      "name": "Black Hands Dagger",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Black Hands Dagger-12820-1-0.rar",
      "uploadedUnix": "1331650941",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2f79a775dd58d7624a6288abef18a9155906fa860e2e6f30839ebc51136b847d/analysis/1406746756/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Hands%20Dagger-12820-1-0.rar?fid=42937&ttl=1535775075&ri=8192&rs=8192&setec=b40a41622952927702d1d4735ba18768"
    }
  ]
}