{
  "modId": 12827.0,
  "modName": "Moonpath to Elsweyr - Traduzione italiana",
  "summary": "Traduzione della mod di muppetpuppet",
  "descriptionHtml": "[center]- Traduzione italiana facente parte del progetto di traduzioni [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]Dragonborn Italia[/url] -\r\n16/04 Ringrazio Andre7890 per essersi preso carico della mod, d\\'ora in poi gli aggiornamenti saranno opera sua. ;)\r\n\r\n***[/center]\r\n\r\n[color=#7FFF00][b][right]Attention!\r\nThis is just the italian translation of the original mod. I didn\\'t create it.\r\nYou can find the original mod at [url=http://skyrim.nexusmods.com/downloads/file.php?id=9782]this page[/url]. All credit goes to his creator muppetpuppet.\r\n\r\nIf you like the mod, go to his page and [I]ENDORSE[/I] him![/right][/b][/color]\r\n\r\n[center]***[/center]\r\n\r\n\r\n[color=#7FFF00][B]Moonpath to Elsweyr - Traduzione italiana[/b][/color]\r\n\r\nVersione 6.4\r\nSe state aggiornando dalla versione 6.2 ad una superiore, ricordatevi di eliminare hg.esp e hg.bsa!\r\n[color=#20B2AA][B]Contenuto della mod:[/B][/color]\r\n\r\nLa mod aggiunge una località tropicale ispirata alla provincia immaginaria di Elsweyr. \r\nLa zona è articolata in 4 aree, di cui una adibibile a propria dimora.\r\nSi accede alla nuova zona attraverso il \\\"Sentiero lunare verso Elsweyr\\\", ad ovest di Falkreath. La zona è già visibile e raggiungibile dalla mappa.\r\n\r\nEcco le principali caratteristiche della mod:\r\n- nuove aree di ispirazione tropicale molto curate e ben fatte;\r\n- 6.2: aggiunta una vasta area desertica e una nuova parte della missione, ora si può possere la propria nave volante;\r\n- alcune missioni, tutte all\\'interno della nuova area di gioco;\r\n- una dimora, munita di casse, manichini e rastrelliere per armi, nonché di un mercante sempre disposto ad acquistare la zavorra che non volete portarvi appresso;\r\n- molti nuovi mostri (Regine della Jungla, Granchi dei fiumi, Pahmar, ovvero tigri, Iene, Centopiedi...)\r\n- per avere un\\'idea delle nuove zone andare alla pagina principale e consultare le immagini, vi assicuro che ne vale la pena ;)\r\n\r\n[center]***[/center]\r\n\r\n[color=#20B2AA][B]Installazione:[/B][/color]\r\n\r\n[B]Innanzitutto recarsi alla [url=http://skyrim.nexusmods.com/downloads/file.php?id=9782]pagina originale[/url] e scaricare la mod.[/B]\r\n\r\nDopodiché recarsi alla pagina di [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]Dragonborn Italia[/url], consultare la lista \\\"Downloads\\\" (pulsante verde subito sopra la descrizione) e scaricare la mod corrispondente.\r\n\r\nL\\'archivio contiene unicamente il file tradotto, per poter fruire della mod è necessario prima scaricarla dalla pagina originale (assicurandosi di scaricare la versione della traduzione fornita, in alternativa la mod non funzionerà) e poi sostituire il file .esp con quello da noi fornito.\r\n\r\n[center]***[/center]\r\n\r\n[I]Se notate qualche incongruenza o imprecisione nella traduzione, sarò aperto a qualunque suggerimento/critica vogliate pormi.[/I]",
  "categoryId": "30",
  "version": "6.4",
  "author": "muppetpuppet",
  "createdUnix": "1331659066",
  "updatedUnix": "1331659066",
  "containsAdultContent": false,
  "uploadedBy": "Ichnos",
  "primaryFile": null,
  "files": []
}