{
  "modId": 1282.0,
  "modName": "Archmage Robes No Mud or Dirt Retexture",
  "summary": "Removed the ugly dirt specks, brown crap, and mud on archmage robes",
  "descriptionHtml": "So this is my first \\\"mod\\\" ever published. I\\'m quite new to drawing in general as well as with photoshop and of course, texturing. I\\'m hoping to get better and do some cooler things, and improve the non-existent skills I have ;-)\r\n\r\nThis texture removes the dirt & mud from the Archmage Robes in Skyrim. I figured if I\\'m the Archmage, shouldn\\'t I be noble enough to clean, and less like I take a shower and wash my clothes once per year?\r\n\r\nIt\\'s simple, I know..and perhaps you don\\'t notice the difference, or don\\'t care..either way, hopefully someone other than me finds this useful...\r\n\r\nAlso note that it removes brown entirely from the leather parts (not the parts with the fur area on them), so the areas that should have been black but weren\\'t because they had dirt on them, are now entirely black. Did some black&white effects on those leather areas, hand drew areas to remove the dirt/mud speckles which were everywhere, and added a tad bit of noise so it doesn\\'t look too fake (I tend to be relatively bad at drawing details, or drawing in general..)\r\n\r\nEither way, let me know if you like it, or if you have any critiques/suggestions for me.\r\n\r\nAll of my work is and always will be licensed under the GPL. In other words, you can freely tweak it, modify it, and gut it, and even sell it and run your own business off of the profits. As long as you submit the changes to me, if they were substantial and improved upon the original. That said, I\\'m only interested if you modified it in a way that made this particular mod \\\"better\\\" (don\\'t fret if you used this and did some color modifications or a retexture or something to make it totally different and this was simply a help to get you there). Also, if you use this, you can\\'t use a license that is more restrictive, like requiring permission to use your files which were derived from mine.\r\n\r\nSo to wrap up and hopefully be clear, I really don\\'t care what you do with this (and this is how all mods/modders should be, to be honest, since it\\'s in the best interest of the modding community.\r\n\r\nI\\'m planning on using this as a basis for some upcoming Archmage recolours and stuff, so let me know if you have any thoughts or suggestions as to what you might like.\r\n\r\n\r\nIf you like it, and if someone wants a Female version, I will do that. However, this is currently ONLY the MALE version.\r\n\r\n\r\n\r\nINSTALLATION:\r\n\r\nSimply read the README and/or extract to skyrim/data/... which will create textures/clothes/archmage/robe/m/..\r\n\r\n-Predator106 - predator106 (feel free to ask me for anything) gmail.com",
  "categoryId": "60",
  "version": "1.0",
  "author": "Predator106",
  "createdUnix": "1322108471",
  "updatedUnix": "1322109458",
  "containsAdultContent": false,
  "uploadedBy": "Predator106",
  "primaryFile": null,
  "files": [
    {
      "fileId": "3364",
      "name": "Archmage Robe No Mud or Dirt Retexture Predator106 v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1399",
      "fileName": "Archmage Robe No Mud or Dirt Retexture Predator106 v1-1282-1-0.7z",
      "uploadedUnix": "1322109458",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c19beda0fc0be61c09b77dc09eeb0a414e91679a613f9155b8dece9a19ee1c45/analysis/1406440924/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Archmage%20Robe%20No%20Mud%20or%20Dirt%20Retexture%20Predator106%20v1-1282-1-0.7z?fid=3364&ttl=1535754770&ri=8192&rs=8192&setec=d33fa4f6717a639a1a435f50d0035952"
    }
  ]
}