{
  "modId": 12837.0,
  "modName": "Machinists Refuge WIP",
  "summary": "An ancient Dwemer settlement on one of the bigger islands in the northwest, once the workshop of one of their greatest mechanics, with large parts of it below sea level. *Unfinished*, cooperation welcome",
  "descriptionHtml": "Welcome to the Machinist\\'s Refuge.\r\n\r\nIt\\'s an ambitious but not entirely finished project with many hours put into it. The largest part of it should be working including displays, mannequins, book shelves, room markers and most of the navmesh. I ran into some frustrating navmesh issues with followers refusing to teleport to new rooms and paused. Then Mass Effect 3 arrived and I threw in the towel. I have no desire to pursue this mod any further.\r\n\r\nIf there\\'s anyone willing and capable of finishing it by filling it with a few scripted NPCs and tweaking the layout, I\\'d gladly pass it on to another modder. So if you\\'ve already got a mod online that shows you can do something and would like to use my concept, please tell me in your comments. It\\'s not that I think my work is the bee\\'s knees, but I\\'ve invested too much time to just give it away randomly. The new \\\"owner\\\" can change it at will and upload it under his own name. I don\\'t want anything out of it; my only request would be that the results are not uploaded to the Steam Workshop and that I\\'m mentioned somewhere along the lines of \\\"based on an idea by\\\".\r\n\r\nDescription:\r\n\r\nThe property is an ancient Dwemer settlement located on one of the bigger unpopulated islands in the northwest, with large parts of it below sea level. Once the workshop of one of their greatest mechanics, it houses some old machines that function to this day, providing the structure with extravagant comforts. It\\'s not clear what it\\'s powered by apart from a mysterious object deep down in its bowels. Cleaned, refurbished and surrounded by sturdy walls, it\\'s a home for the distinguished adventurer who has slain the most dangerous dragons, decided the war and can afford a luxurious lifestyle. \r\nThe Dwemer weren\\'t particularly modest architects. So if you\\'re looking for a smallish, realistic home this won\\'t be your cup of tea. But if you\\'d like to live in a fortress that\\'s built for the ages, only accessible by water and - thanks to several levels connected by a lift -  much larger than it looks from the outside, this might be to your taste. I tried to make it grandiose and cozy at the same time.\r\nWhat it\\'s got: a small lighthouse, boat service from and to the shore with new piers, a drawbridge with secured lever mechanism, walkable walls, several adjacent buildings, a reasonably large library, a heated pool, guest rooms, a kitchen, electric lighting, a large subterranean armory with mannequins and all sorts of displays, dragon mask stands, storage en masse, an engine room, a fully equipped forge, an enchanting / alchemy room and the source of all that energy.\r\n\r\nPerformance: I use quite a few hi-res texture mods. On my slighty dated rig with an Intel core 2 duo E8500, 4 GB RAM and a GeForce GTX 570 (1.25 GB) the new cells run fine.\r\n\r\nI don\\'t use the Mod Manager, so I won\\'t know how to solve conflicts you encounter with it.\r\n\r\nTo find the new cells in the CK look for \\\"IslandRetreat\\\" (Tamriel) and interiors starting with \\\"Island\\\". \r\n\r\nIMPORTANT: You\\'ll have to clean up the accidental edits in some of the master cells before making it available as a finished mod. I found out about that too late and don\\'t dare to mess with the ignore function in the CK.",
  "categoryId": "67",
  "version": "",
  "author": "kerrangdoodle",
  "createdUnix": "1331663451",
  "updatedUnix": "1331673849",
  "containsAdultContent": false,
  "uploadedBy": "kerrangdoodle",
  "primaryFile": null,
  "files": [
    {
      "fileId": "43045",
      "name": "machinists refuge --unfinished--",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "587",
      "fileName": "machinists refuge --unfinished---12837-1.zip",
      "uploadedUnix": "1331673849",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/dd98eddcd6db4482919b622e768df4c835fe8fb40f176b8caf0beeb65e29b44d/analysis/1406747349/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/machinists%20refuge%20--unfinished---12837-1.zip?fid=43045&ttl=1535775102&ri=8192&rs=8192&setec=97e59581c8ec221c8f5e1f0e1c152a3a"
    }
  ]
}