{
  "modId": 12851.0,
  "modName": "Pinewood Village",
  "summary": "This adds a tree house village to Hjaalmarsh (West of Morthal), roughly the same size as Riverwood populated by Bosmer. The village includes a player home (with purchasable extension), several villagers with houses (quests coming soon), Blacksmith, General Store (fence), Alchemist, Arcane Enchanter and Pinewood Inn. Voices are slowly being added to",
  "descriptionHtml": "[color=green]Sorry guys but I am not working on this any longer, I have learnt everything I wanted to in making this and have started another project to progress myself further.\n<br />\n<br />The village is finished in my eyes. If you want to change a few things for personal use then that is fine but I am not changing/adding anything else. \n<br />[/color]\n<br />\n<br />[youtube]L7Y915AnlY4[/youtube]\n<br />\n<br />[size=3][b]Description[/b][/size]\n<br />This adds a full blown village built into the trees in Hjaalmarsh with an expandable player house (through Thorian who is located at Rotmeth Inn) and over a dozen villagers with custom dialogue that through the constant updates adds realism to the village. \n<br />\n<br />Things you can find here:\n<br />[list] [*]Moramath (Player Home with Purchasable Extensions)\n<br />[*]Raelyns Oddities (Alchemist Shop)\n<br />[*]Paulies Pineforge (Blacksmith) \n<br />[*]Marvelous Mabons (General Store and Fence)\n<br />[*]Arcane Enchanter\n<br />[*]Rotmeth Inn (with Julianos, Bard of the Voice)\n<br />[*]Overlook \n<br />[*]Gardens\n<br />[*]Farmland\n<br />[*]Pond, Stream and Waterfall\n<br />[*]Life, as in villagers with custom dialogue \n<br />[/list]\n<br />[b][size=3]History[/size][/b]\n<br />The Wood Elves, otherwise known as Bosmer to themselves have a simple existence living in harmony with the land, its wild beauty and wild creatures. Adapting well in their move to Skyrim and taking to the trees so they can stay close to nature but avoid the dangers that are nearby.\n<br />\n<br />The Bosmer have been settled in Hjaalmarch now for quite some time. They have had an understanding over the years with each of the Jarls of the Hold that if they allow their guards and follow the laws then they can remain where they are without qualm. It has remained this way in a peaceful manner since they broke from the traveling Bosmer city of Falinesti.\n<br />\n<br />When the Bosmer settled here they had to quickly build relationships with the locals so they could buy goods, even though they were no longer in Valenwood they would still not break their Green Pact with the Forest God Yffre, which prevents them from harming or eating the vegetation of Valenwood. Even though this was supposed to stop at the borders of the Great Forest they are still in the same frame of mind, and stick with it in Skyrim. So they buy their building materials for their homes, arrows and wooden instruments.\n<br />\n<br />These Bosmer have dropped their Cannibalistic nature so as not to anger the other races living nearby. They settled here for peace and quickly found that this would no longer help them in their goals. Although they still worship Herma-Mara, the Daedric Prince in seclusion on a regular basis. \n<br />\n<br />[b][size=3]Location[/size][/b]\n<br />It is located West of Morthal, if you follow the path West that comes out South of Morthal it is just on your left after you leave the snowy area and hit the Pinewooded area. If you have trouble finding it you can use the [b]`[/b] and [b]coc pinewood[/b] to be sent there.  \n<br />\n<br />[b][size=3]Help[/size][/b]\n<br />[list][*]For those of you that this is till not working. Try a clean install of Skyrim. For those of you that have to download from steam, copy the 'Skyrim - NAMED.bsa' files and IF you have the texture pack from steam the 'HighResTexturePack.bsa' 01 and 02 files also from the data folder. Then when you click to install you just paste them files back in again for a faster download. Pinewood Village works for a lot of people and I keep being given incompatibilities and testing them to find they work for me. This is why I have not posted a list of them.\n<br />[*]If you experience NPC's doing what they shouldn't be, try doing a reset. Disable 'PinewoodVillage.esp' load the game, save and exit. Enable it again then everything in the Village will be as it should be. (*tip if you have purchased Moramath (player house) before doing this, follow the instruction below.)\n<br />[*]You may notice that Moramath (the player house) has things there that shouldn't be and that you can't get in. Activate the Firewood to the left of the door of Moramath. You will get fully refunded and the purchase will be reset.\n<br />[*]For lag issues I have made all of the buildings as interiors. Also! You can try lowering your graphics settings a notch. \n<br />[*] For those of you having trouble with saving and loading, make sure the 'Pinewood Village.esp' is quite high in the load order so everything else loads afterwards. This should fix this.\n<br />[*]Floating grass where I flattened the land for the camp. Don't fret, there is a fix [url=http://www.creationkit.com/Floating_Grass_Fix]HERE[/url].\n<br />[*]This mod is incompatable with a few other popular mods. Although unfortunate, it is understandable as they change content that we use in the mod. Try loading Pinewood Village earlier than the other mods. \n<br />[/list]\n<br />[size=3]Changes[/size]\n<br />All changes are now in the change log, click the Version Number at the top of the page.\n<br />\n<br />[size=3]Translations [/size]\n<br />[url=http://modgames.net/load/254-1-0-10416]Pinewood Village[/url] - Russian Translation by ArsisLeoni\n<br />\n<br />[img]http://i105.photobucket.com/albums/m224/Kr4ggle/KRAGGLE-PC/Pictures/2014/PinewoodMods1_zpsd7d77162.png[/img]\n<br />[img]http://i105.photobucket.com/albums/m224/Kr4ggle/KRAGGLE-PC/Pictures/2014/WyvernCliff_zps8082551d.jpg[/img]\n<br />[img]http://i105.photobucket.com/albums/m224/Kr4ggle/KRAGGLE-PC/Pictures/2014/Cavern_zps940e39dc.jpg[/img]\n<br />[youtube]A71VhZEW6CI[/youtube]\n<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=12299]Wyvern Sanctuary[/url]\n<br />\n<br />[img]http://i105.photobucket.com/albums/m224/Kr4ggle/KRAGGLE-PC/Pictures/2014/SharedStorageChest_zps27d80b97.jpg[/img]\n<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=12376]Shared Storage[/url]",
  "categoryId": "53",
  "version": "2.5",
  "author": "Kraggle",
  "createdUnix": "1331676462",
  "updatedUnix": "1339286150",
  "containsAdultContent": false,
  "uploadedBy": "kraggle",
  "primaryFile": null,
  "files": [
    {
      "fileId": "59956",
      "name": "Pinewood v 2_3",
      "version": "2.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35299",
      "fileName": "Pinewood v 2_3-12851.rar",
      "uploadedUnix": "1336559621",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/af75fafd6887af30882393ddc4d812e4a7245e3fd3cd016fa9809cea62db9433/analysis/1406880194/",
      "changelogHtml": " Made tavern, interior and exterior as a whole for less faces/lag. <br/> \n Made shops, interior and exterior as a whole for less faces/lag. <br/> \n Made houses, interior and exterior as a whole for less faces/lag. <br/> \n Fixed Farhad and Tamzens lip sync for most of their dialogue <br/> \n Filled in the gaps that I left in the roof meshes! <br/> \n Added a Pineforge sign that actually looks the part (custom mesh and texture) <br/> \n Replaced the ladder with a spiral stair by where the garden was. <br/> \n Added flora to the whole ground level of the village. <br/> \n Customised the entire tavern, whole new layout! <br/> \n Removed the garden. <br/> \n Made a custom bar for the tavern, mesh and textures. <br/> \n Added a sign for Raelyn\\'s Oddities. Custom mesh and textures. <br/> \n Added a Tavern Sign with custom mesh and texture <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pinewood%20v%202_3-12851.rar?fid=59956&ttl=1535775123&ri=8192&rs=8192&setec=b383caaeec96c84f655310511b8a22fe"
    },
    {
      "fileId": "60620",
      "name": "Pinewood v 2_4",
      "version": "2.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35314",
      "fileName": "Pinewood v 2_4-12851.rar",
      "uploadedUnix": "1336780498",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/6c4668e615d4bdabb445888b89d5ad579a692b533bf34813398f84be546c2162/analysis/1406886196/",
      "changelogHtml": " Made Moramath look better, fixed the walls, windows and beams. <br/> \n Floored the floating shelves in Raelyns. <br/> \n Filled the gaps left in the shop interior meshes. <br/> \n Fixed Raelyn following you as soon as you enter her shop. <br/> \n Fixed the display cases in Moramath. <br/> \n Fixed funny floor outside Weldons house. <br/> \n Compass now points north when indoors instead of south. <br/> \n Fixed all lighting interior and exterior. <br/> \n Smoothed the spiral stairs a bit, they are not perfect but they are better until a propper collision can be made. <br/> \n Problem with falling to the ground outside Raelyns Oddities. <br/> \n Organized the meshes folder so things can be found easier by myself. <br/> \n Rearranged furniture markers after adding all new buildings and fences. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pinewood%20v%202_4-12851.rar?fid=60620&ttl=1535775124&ri=8192&rs=8192&setec=916a9fcb6f523b299101e190ba975532"
    },
    {
      "fileId": "62074",
      "name": "Pinewood v 2_5",
      "version": "2.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "36137",
      "fileName": "Pinewood v 2_5-12851-2-5.rar",
      "uploadedUnix": "1337349660",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/5829168092aa811b389ef64d5b6ff77732db4abd6910dc820eaf44f75cdc9ec9/analysis/1406900056/",
      "changelogHtml": " Setup spell shop at The Circle run by Weldon the Mage. <br/> \n Made shelves to add to The Circle. <br/> \n Added custom chair that matches the circle table for The Circle. <br/> \n Cutom bridge meshes now complete. <br/> \n Improved the circle table mesh! <br/> \n There are now no problems with collision thanks to NifConvert. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pinewood%20v%202_5-12851-2-5.rar?fid=62074&ttl=1535775124&ri=8192&rs=8192&setec=8645af92bbfba439946bafcb5ccd6071"
    },
    {
      "fileId": "67008",
      "name": "Pinewood Village with ONAM List - BSA Fix",
      "version": "2.5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "32320",
      "fileName": "Pinewood Village with ONAM List - BSA Fix-12851-2-5.rar",
      "uploadedUnix": "1339286150",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/8b8cc6410a4bb57b4220c028d16e37be4d8d6344d45edd192d063343cfcb6d99/analysis/1406949232/",
      "changelogHtml": " Setup spell shop at The Circle run by Weldon the Mage. <br/> \n Made shelves to add to The Circle. <br/> \n Added custom chair that matches the circle table for The Circle. <br/> \n Cutom bridge meshes now complete. <br/> \n Improved the circle table mesh! <br/> \n There are now no problems with collision thanks to NifConvert. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pinewood%20Village%20with%20ONAM%20List%20-%20BSA%20Fix-12851-2-5.rar?fid=67008&ttl=1535775125&ri=8192&rs=8192&setec=27472acfb3aa6d49514f7a926acebdfc"
    }
  ]
}