{
  "modId": 12870.0,
  "modName": "Marriagable Khajiit Followers- The Twins",
  "summary": "Two new badass kitties from the Thieves Guild that you can recruit as followers and marry!",
  "descriptionHtml": "These Khajiit twins hail from Imperial City, so they don\\'t have the usual accent that a Khajiit is associated with. At least that\\'s the story, and I\\'m sticking to it.\r\n\r\nThese two were born and raised in Cyrodill. Abandoned as cubs, they were forced to resort to thievery and dishonest living to get by. Unfortunately, after a particularly influential doyen got a little rough with his sister, Rakharo was kicked out of the Thieves Guild for murder. He and Doreah fled to Skyrim, and were delighted to find that there was a Thieves Guild up and running in Riften. They\\'ve been there ever since.\r\n\r\nLet\\'s introduce our friends, shall we? \r\n\r\n[b]Rakharo[/b]\r\n\r\n[IMG]http://i.imgur.com/3wWXx.png[/IMG]\r\n\r\nRakharo, the eldest of the twins, is a one-handed melee badass. He found his first war axe when he was a cub, and has perks associated with it so if you give him new weapons I\\'d highly recommend sticking to war axes. He favors dwemer weaponry. He\\'s a bit of a hot head but is great to have on your side in battle. Combined with a ton of health and high archery/one handed perks, this guy will plow through an entire town without going down.\r\n\r\n[b]Doreah[/b]\r\n\r\n[IMG]http://i.imgur.com/OTsKS.png[/IMG]\r\n\r\nDoreah is the softer, more gentle half of the twins. Her brother never had the patience to learn magic, but she certainly did. Doreah is an excellent frost mage who will throw on a frost cloak at the first sign of battle. She comes equipped with a glass dagger, a glass bow, and glass arrows, and knows how to use them.\r\n\r\nThese two live in the Thieves Guild cistern, and are eligible for marriage. I plan to make them trainers in the future, I have to figure that part out first. Make sure when you install that you\\'re going off of a save that is not inside the Thieves Guild cistern, or they may not appear.\r\n\r\nIf they still do not appear, use \r\n\\\"help doreah 4\\\"\r\n\\\"help rakharo 4\\\"\r\nto get their ID numbers and then \r\n\\\"player.placeatme XXXXXXXX\\\"\r\n\r\nAs always stick it in your data folder to install, and use NMM preferably so it\\'s easy to uninstall if you don\\'t want them.\r\n\r\nThanks to Bethesda for making lovely characters and for giving us the creation kit to make more lovely characters with.",
  "categoryId": "33",
  "version": "1.0",
  "author": "Rouxez",
  "createdUnix": "1331696956",
  "updatedUnix": "1331696956",
  "containsAdultContent": false,
  "uploadedBy": "Rouxez",
  "primaryFile": null,
  "files": []
}