{
  "modId": 12881.0,
  "modName": "Schmidts Tunnel - The Motherlode of Tamriel",
  "summary": "Schmidts Tunnel - The Motherlode of Tamriel\r\nUnlimited Amounts of every type of Ore from one small undisclosed mine.",
  "descriptionHtml": "Schmidts\\' Tunnel\r\nThe Motherlode of Tamriel\r\nUnlimited Amounts of every type of Ore in a small, undisclosed location.\r\n\r\nA small, cramped, dark tunnel out in the middle of nowhere.\r\nCan you find it?\r\nIf you do find it, there is rumored to be unlimited amounts of Ore of all types available within this one mine tunnel.\r\n\r\n--------------------------\r\n\r\nI always thought it was kind of dumb that the Ore Veins only gave you 3 pieces of Ore.\r\nI realize that it is a \\\"Balance\\\" Issue, but I still didn\\'t like needing some Ore for crafting and having to wander all over to see if they had \\\"grown back\\\" yet.\r\nBeing a rockhound and a sometimes weekend miner myself, I know rocks/minerals/ores do not work that way, You should be able to go to a location known for whatever type of ore you need, gather an amount you require, and haul it off to wherever for processing, that\\'s is what I have hoped to create here.\r\nIn order to still address that balance issue, I have created unique ore veins that only exist in one small location.\r\nNo other ore veins should be affected.\r\nYou will have to walk there, as [b]there is NO MAP MARKER[/b], and [b]there are no plans to add one at this time[/b]. I am hoping this will at least somewhat preserve the balance for those players that wish to do so.\r\nI really hope most do... Some will not like the mod this way, Please feel free to modify this to your own purposes if you feel the need to do so.\r\n\r\nThis method should hopefully also make it more difficult to carry insane amounts of Ore home with you, you will have to walk. \r\n(unless, of course, you brought your horse or can drag around that much weight)\r\n\r\nYou will also have to \\\"pay\\\" for your Ore with a little bit of your time.\r\n\r\n[b]If you use the mining animation you will get 1 piece of Ore per 3 hits[/b]\r\nYou will only see the message that you aquired Ore once every 6 hits, but you are getting one every 3 (Listen carefully :) ) I have no idea why it does this.\r\n\r\n[b]If you attack the Ore[/b], you will get 1 Ore per 2 attacks, and it seems like sometimes you don\\'t get one (I could be missing the attack due to no stamina, I\\'m not really a fighter player, I\\'m more of a mage :) )\r\n\r\nThat Seemed like an alright balance to me, your getting unlimited Ores, start the animation and go have some tea or something it\\'s nothing to get upset about. :)\r\n\r\nBoth seem to last indefinitely, I allowed the animation to run for about 10 minutes the other night and walked away with about 90 Ores.\r\n\r\nYou might want to bring a torch or some other light source, it is dark inside, it is a mine tunnel. (there\\'s a little bit of light, but only from the lighting settings on the cell and possibly what is coming from one FXAmbBeam light. (which I can\\'t seem to get to work, though I\\'m sure I am doing something wrong)\r\nThe lighting was a major pain for me to try and get \\\"just right\\\" and in the end I just removed most of the lights.\r\nIt\\'s a very small, cramped, place. However, you won\\'t get lost without light. You can always find the outside.\r\n\r\n[b]There is no Navmeshing inside[/b], I realize it\\'s a small place and it would not be hard to do at all, but with the cramped conditions having a follower in there with you would be crazy. So I left the space \\\"un-meshed\\\".\r\nYour Followers *should* wait at the entrance for you.\r\n\r\nI saw a couple of other mod\\'s that do the same thing but could not tell if they implemented theirs in the same way I did.\r\nIf they had used this same method, I am sorry, I do not want to step on anyone\\'s toes. I just came up with this the other day for myself. Since I could not tell if it was just another \\\"flavor\\\" of the same thing or not I decided to release it because I thought others might enjoy it. If you can use it for your project, please, feel free.\r\n\r\n[b]I probably will not change this mod from version 1.0, unless there is overwhelming outrage at it\\'s implementation.[/b] (or for major issues, as I can only test so much on my own)\r\nThe only change I *may* make will be a single NPC who gives a quest to find it\\'s location, I have thought of this and I\\'m not certain if I will do it or not, it\\'s not even in the works at this point. I like it this way and I think it should remain a secret only for those who find it.\r\n\r\n[b]If you want to ruin the fun and post it\\'s location here, feel free, but know that the ghosts of a thousand old drunken miners will descend on your home and start mining at all hours of the night... and don\\'t even get me started on the smell of their burros![/b] :)\r\nPosting Clues is welcomed however, and will not incur the wrath of the drunken miners and their burros.\r\n\r\nand finally, since I can\\'t be all that bad (even though this might be worse than just looking for it, yeah sorry, ya might have to think)\r\n\r\nIf you can answer these questions three, I will tell you where it be.\r\n1. Where, actually, in reality, is Schmidts\\' Tunnel? (the nearest town will work if you can\\'t be more specific)\r\n2. There is a door inside the real tunnel, what is in it? (Bonus +1 if you can answer what [i]used[/i] to be in it.)\r\n3. The real tunnel goes all the way through the top of a mountain, well a big hill, I\\'m not sure it would really qualify as \\\"mountain\\\"... anyways... What dry lake bed are you looking at when you \\\"exit\\\" the tunnel.\r\n**Optional** 3. What is the \\\"Legend\\\" of the tunnel?\r\n\r\nIf you can answer those, you\\'ve either been there or have some pretty good google-foo, either way, I will tell you it\\'s location in a PM.\r\n\r\n(or just coc yourself there... )\r\nTo also address different play styles (and I liked the idea from one of the comments) there is now \\\"The Optional File\\\".  If you want to search and feel proud to have found the mine on your own then I encourage you to do so, but if it is just maddening, then use the book. I\\'m not sadistic. :)\r\nShould you choose to use the optional file, it contains one book, that one vendor will sell. This vendor has no idea what he holds in his hands and will sell it for a pittance. He only bought it from his wholesaler because he liked the cover and it was slightly cheaper than the other books that day.\r\nHe then went home and added to his pile of crap he sells, in the hopes some hapless soul would take it off his hands one day...\r\n( now to figure out who I am talking about huh?  :) )\r\nThis book contains a map and should help you find the mine. The vendor *should* only sell this book once, so do not lose it or make sure you remember the location of the mine before you do.\r\nThe map is not in the \\\"Skyrim\\\" style, I am sorry. I could probably sketch one up quickly on real paper, but I cannot draw one with a mouse, with my right hand... :S and our scanner doesn\\'t work of course at the moment... I will update the map to be more in style with the rest of the game as soon as I get a chance.\r\nAlso, the book mod is not needed in any way for the main mod file to work, it can safely be removed once you learn the location.\r\n\r\nINSTALL\r\n----------\r\nExtract and copy the files to your data folder\r\nShould be NMM compatible...  should be...\r\n\r\nUNINSTALL\r\n----------\r\nRemove the same files\r\nor do whatever it is you do with NMM.\r\n\r\nThanks to\r\n----------\r\nBethesda, for making me frustrated enough that rocks do not \\\"grow back\\\" over time, to finally do something about it!\r\n\r\nRestrictions\r\n----------\r\nPlease don\\'t upload to steam!\r\nJust give me credit for helping to inspire you to also create something. :smile:\r\n\r\nDisclaimer\r\n----------\r\nThis all seems to work fine on my machine, it likely will not on yours.",
  "categoryId": "24",
  "version": "1.0",
  "author": "ride",
  "createdUnix": "1331713393",
  "updatedUnix": "1331753941",
  "containsAdultContent": false,
  "uploadedBy": "r1de",
  "primaryFile": null,
  "files": [
    {
      "fileId": "43200",
      "name": "Schmidts Tunnel v1_0 with BSA",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Schmidts Tunnel v1_0 with BSA-12881-1-0.7z",
      "uploadedUnix": "1331713539",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/408eecd0f6066ffc55d1ab4a0fa501cd1049aa79a0f7cf6ec198ca671c93f222/analysis/1406748388/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Schmidts%20Tunnel%20v1_0%20with%20BSA-12881-1-0.7z?fid=43200&ttl=1535775167&ri=8192&rs=8192&setec=1336f4e71c103ddce59a565e701d465c"
    },
    {
      "fileId": "43345",
      "name": "Schmidts Folly - Clue Book",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "589",
      "fileName": "Schmidts Folly - Clue Book-12881.7z",
      "uploadedUnix": "1331753941",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3d7a4ed9ca94c8717acb828ce31aacd9680ff6b733d1451b059550ee420aaaed/analysis/1406749145/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Schmidts%20Folly%20-%20Clue%20Book-12881.7z?fid=43345&ttl=1535775167&ri=8192&rs=8192&setec=751291efb770c879d3e430e03ab803cc"
    }
  ]
}