{
  "modId": 12905.0,
  "modName": "Alternate Start - Live Another Life TRADUZIONE ITALIANA",
  "summary": "Traduzione italiana del file Alternate Start-Live Another Life di Arthmoor\r\nTHIS IS ONLY A TRANSLATION OF THE ORIGINAL MOD",
  "descriptionHtml": "[color=red][size=+2][center]NOTICE![/color][/size][/center]\r\n[color=red][size=+1][center]This is only a translation into Italian of the original mod. All credits go to the creator of the [url=http://skyrim.nexusmods.com/downloads/file.php?id=9557]original mod[/url].\r\nLive Another Life provides an alternative means to start the game for those who do not wish to go through the lengthy intro sequence at Helgen. \r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.[/color][/size][/center]\r\n[color=green][size=+5][center]UNA PRODUZIONE DRAGONBORN ITALIA[/color][/size][/center]\r\n\r\n[color=green][size=+1]DESCRIZIONE[/color][/size]\r\nMiseria e disperazione ti hanno dato la caccia per tutta la vita. Proprio quando pensavi che non sarebbe potuta andare peggio sei stato arrestato e sbattuto in prigione. Il processo doveva essere settimane fa, ma nessuno è venuto per te. È passato molto tempo da quando hai visto la luce del sole l\\'ultima volta ed ora non ricordi nemmeno che mese sia. Le segrete sono fredde, umide, e cosa anche peggiore, stai finendo il cibo. Perlomeno c\\'è quella perdita nel muro per l\\'acqua. Sembra proprio che si siano dimenticati di te, lasciato a marcire e morire. Gli dei ti hanno abbandonato! Oppure no?\r\n\r\nLive another life fornisce un modo alternativo di cominciare il gioco per tutti coloro che vogliano saltare il lungo filmato iniziale. Ti sarà data la possibilità di scegliere la razza e successivamente una nuova vita da condurre per il tuo personaggio. Sarà disponibile una grande varietà di scelta. Le tue scelte avranno un forte impatto nel gioco, quindi scegli con attenzione o gli dei potrebbero abbandonarti ancora!\r\n\r\n[color=green][size=+1]REQUISITI PER L\\'INSTALLAZIONE[/color][/size]\r\nPatch di Skyrim Ufficiale [b]1.5.26[/b] o superiore. Utilizzare con versioni del gioco precedenti comportarà il blocco del gioco al menu principale.\r\n\r\n[size=+1][b]Aggiornare il gioco da una versione precedente alla 2.x - IMPORTANTE! NON STALTARE QUESTO PASSAGGIO![/b][/size]\r\nLa versione 2.0 è una revisione totale della mod, questo implica che non potrete continuare alcun salvataggio con una missione aggiunta dalla mod attiva. \r\nSe un vostro personaggio ha la missione \\\"Vivi un\\'altra vita\\\" attiva DOVETE prima completare tale missione con la versione della mod che avete installata. Non utilizzate questa versione finché ogni personaggio che utilizzate non ha completato questa missione attivabile interagendo con il cadavere carbonizzato. Procedete poi fino al salvataggio di Hadvar/Ralof o fino a parlare con lo jarl Balgruuf. Quando apparirà il messaggio di completamento della missione potete eliminare la versione della mod che avete installata. I personaggi creati che cominciano come soldati nella guerra civile saranno già oltre questo punto e sono l\\'unica eccezione. \r\n\r\nSe il vostro personaggio utilizza la fattoria dovete assicurarvi di spostare ogni oggetto di valore che avete depositato all\\'interno prima di passare alla nuova versione. \r\n\r\nFatto ciò create un salvataggio pulito dopodiché eliminate il file .esp e il file .bsa dalla cartella Skyrim/Data. Dovrete creare un salvataggio pulito per ogni personaggio che avete salvato. Fatto ciò potete tranquillamente installare la nuova versione ed attivarla.\r\n\r\n[color=green][size=+1]OPZIONI DISPONIBILI[/color][/size]\r\nScegli tra una della opzioni principali per cominciare. Non appena mi verranno nuove idee, questa lista crescerà.\r\n\r\n\r\n[b]Catturato per aver oltrepassato il confine illegalmente[/b]\r\n-------------------------------------------------------\r\nA coloro che desiderano utilizzare questa opzione per cominciare il gioco ad Helgen, verrà saltato il processo di creazione della razza durante il dialogo prima dell\\'esecuzione. Verrà saltato anche il tutorial. \r\n\r\n[b]Immigrato a Skyrim[/b]\r\n-------------------\r\nApproderai a Skyrim con una nave nei porti di Solitude, Dawnstar o Windhel con poco più che forniture base, abbigliamento di media classe e una somma di denaro decente per ricominciare dopo il tuo arrivo.\r\n\r\n[b]Possessore di proprietà[/b]\r\n------------------------\r\nComincerai con la casa da te scelta completa di tutto l\\'arredamento. La casa di Windhelm non è selezionabile a causa della missione che interagisce direttamente con l\\'acquisto della proprietà. \r\nIn ogni casa comincerei con l\\'abbigliamento appropriato ed alcune monete da spendere. Troverai anche alcune armi sempre in base alla vittà scelta nel baule nella camera da letto. \r\nSe possedere una casa in città è troppo noioso puoi scegliere di possedere una fattoria. Questa è situata sulla strada principale ad est di Ponte del Drago ed è abitata da due NPC che fungeranno da tuoi agricoltori. La fattoria genererà regolarmente un guadagno che potrai ottenere dagli agricoltori. Dovrai tonare a casa di tanto in tanto per ottenerlo però.\r\n\r\n[b]Membro di una Gilda[/b]\r\n--------------------\r\nSarai la nuova recluta in una delle gilde a cui è possibile accedere nel gioco. I Compagni, l\\'Accademia di Winterhold, la Confraternita Oscura o la Gilda dei Ladri. L\\'equipaggiamento varierà in base alla gilda da te scelta.\r\nPer la gilda dei ladri, comincerai nella caraffa logora, non appena sarai uscito dal ratway. Parla a Brynjolf per concludere il patto. \r\nPer la confraternita oscura, comincerai nel santuario di Falkreath ed dovrai soltanto parlare ad Astrid.\r\nPer l\\'Accademia, comincerai subito fuori dalla sala degli elementi ed avrai completata la fase iniziale di ingresso.\r\nPer i Compagni, comincerai a Jorvaskr con la missione di allenarti con Farkas. \r\n\r\nL\\'accademia dei bardi potrebbe essere aggiunta in un secondo momento se la Bethesda aggiunge più caratteristiche alla fazione. Per ora sono solo un simbolo e poco più\r\n\r\n[b]Cliente abituale di una Locanda[/b]\r\n----------------------------\r\nPotrai scegliere una delle locande di tutta Skyrim. Alcune sono più sicure di altre. Per esempio la locanda del cancello notturno è isolata tra le montagne ed è più pericolosa di altre. Scegli con prudenza.\r\n\r\n[b]Fuorilegge nelle regioni selvagge[/b]\r\n----------------------------------\r\nComincerai come membro di un gruppo di banditi. Il gruppo di cui farai parte verrà scelto a caso. Ti sarà assegnato l\\'equipaggiamento standard di un bandito. A differenza di Oblivion sarai inserito nella fazione dei banditi. Questo comporta che le guardie non ti saranno apertamente ostili. Avventurati con prudenza comunque perché avrai una taglia di 500 monete d\\'oro nel feudo in cui comincerai a giocare.\r\n\r\n[b]Soldato di un esercito[/b]\r\n-----------------------\r\nComincerai come recluta nella Legione Imperiale o nei Manto della Tempesta. Quella che sarà la tua scelta determinerà l\\'armatura che indosserai. Ti ritroverai immediatamente dopo aver completato la prima missione.\r\n\r\n[b]Accampato nei boschi[/b]\r\n--------------------\r\nSei un cacciatore solitario accampato nei boschi. Partirai con equipaggiamento di basso livello, e tutto quello di cui un accampamento ha bisogno. L\\'accampamento è situato nei boschi vicino Helgen che servirà anche come metodo alternativo per venire a conoscenza dell\\'attacco del drago. Questo farà in modo che tu non debba essere proprio nel villaggio mentre viene distrutto. Il campo verrà eliminato una volta che lo lascerai per almeno 3 giorni.\r\n\r\n[b]Naufragato al largo della costa[/b]\r\n--------------------------------\r\nNaufragato! Eri un passeggero a bordo di una nave mercantile diretta a Solitude quando la nave urta un iceberg lontano dalla costa e poi affonda. Apriti una via di fuga dall\\'imbarcazione, prendi qualsiasi oggetto possa esserti utile alla fuga e scappa dalla nave verso la vicina piattaforma di ghiaccio. Da qui capirai velocemente che la strada per la costa sarà davvero LUNGA.\r\n\r\n[b]Assalito e creduto morto[/b]\r\n-------------------------  \r\nTi ritrovi in una zona sconosciuta, derubato e lasciato lì da un gruppo di banditi. Sono stati abbastanza gentili da lasciare quello che pensavano fosse il tuo cadavere in degli sporchi abiti, ma niente più. Riuscirai a sopravvivere nelle terre selvagge e raggiungere una zona sicura?\r\n\r\n[b]Vampiro in Nascondiglio Segreto[/b]\r\n--------------------------------\r\nLa tana dell\\'occhio di Mara è sempre stata la tua casa da quando riesci a ricordare. Non riesci più a ricordare nemmeno da quanto tempo sei un vampiro, sai solo che sei affamato e voglioso di avventure. \r\nATTENZIONE- così comincerai come un vampiro di 4° stadio. Chiunque incontrerai dal momenti in cui lascerai il nascondiglio ti attaccherà e proverà ad annientarti. Se vuoi mescolarti in una città dovrai prima cibarti.\r\n\r\n[b]Necromante in un Laboratorio Nascosto[/b]\r\n--------------------------------------\r\nIl laboratorio che hai scoperto nel Blackreach è a corto di provviste. Sembra proprio che dovrai uscire per procurartene altre, e magari anche vedere cosa sta succedendo nel mondo in questi  giorni. \r\nATTENZIONE- c\\'è una sfera dwemer fuori dalla porta del laboratorio. Dovrai programmare come scappare prima di uscire.\r\n\r\n[b]Vigilante di Stendarr[/b]\r\n----------------------\r\nSei stato accettato tra i vigilanti di stendarr e hai avuto pieno accesso al loro quartier generale vicino Dawnstar.\r\nIl baule vicino a te quando cominci è tuo ed è un luogo sicuro dove conservare i tuoi beni.\r\n\r\n[b]Vivere in un fortino orchesco[/b]\r\n------------------------------\r\nComincerai nel fortino orchesco di Dushnikh Yal. Hai vissuto lì per un po\\' di tempo, ma sei ancora considerato un forestiero, ed ora ti senti ancora più affamato di avventura.\r\nPer alcuni questo è un inizio un po\\' squilibrato perché comincerai in armatura completa orchesca e con un\\'ascia da guerra orchesca, ma sarai comunque di livello 1. La morte può ancora raggiungerti facilmente.\r\n\r\n[b]Guardia di una carovana Khajiit[/b]\r\n--------------------------------\r\nFai parte della carovana da molto tempo ormai, ma finalmente il capo della carovana ha assunto una nuova guardia. È tempo per un po\\' di avventura, ma sarai sempre il benvenuto negli accampamenti Khajiit di Whiterun e di Markath. Questa opzione è attiva soltanto per personaggi Khajiit\r\n\r\n[b]Membro di una tribù di Rinnegati[/b]\r\n---------------------------------\r\nUn tempo gli originari abitanti del Reach, la tua tribù ed i tuoi compagni sono stati costretti a vivere tra le montagne, lontano da ogni comodità. È giunto il momento di lasciare tutto e cercare un po\\' di avventura per conto tuo. Opzione attiva soltanto per bretoni.\r\nNOTA – otterrai un baule utilizzabile per conservare beni in modo sicuro.\r\n\r\n[b]Argoniano scaricatore di porto[/b]\r\n--------------------------------\r\nLavori su questi moli da mesi ormai, forse di più. I cittadini locali non ti trattano meglio ed è ora che tu faccia qualcosa al riguardo. Una vita di avventure e gloria è proprio il cambiamento di cui hai bisogno.\r\n\r\nNota - Il primo tavolo dopo la porta, con il piedistallo per la gemma dell\\'anima, è di tua proprietà e può essere utilizzato come deposito sicuro.\r\n\r\n[b]Redguard guerriero Alik\\'r[/b]\r\n--------------------------------\r\nDisilluso dalla vita nella tua città nelle Hammerfell, ti sei unito agli Alik\\'r e sei partito per Skyrim per una missione. Purtroppo le cose non sono come credevi ed è giunto il tempo di continuare da solo. In ogni caso da dove provieni nessuno conoscerà la differenza.\r\n\r\n[b]Sorprendimi[/b]\r\n------------\r\nScelta casuale che sceglierà una delle opzioni precedenti. Il normale inizio ad Helgen non sarà incluso nella scelta. Inizi specifici per ogni razza saranno inclusi soltanto se la razza coinciderà.\r\n\r\n[color=green][size=+1]ATTIVARE LA MISSIONE PRINCIPALE[/color][/size]\r\nSkyrim è molto meno lineare da queto punto di vista. Anche se è scelto il normale inizio ad Helgen, la missione principale in cui il giocatore scopre di essere il sangue di drago passa inosservata fino al primo incontro con lo jarl di whiterun. \r\nSe non verrà scelto l\\'inizio ad Helgen, le voci dell\\'attacco del drago cominceranno a circolare immediatamente, ed ogni dialogo che coinvolgerà il giocatore dicendo che questi era effettivamente lì sarà lasciato – fingendo che il personaggio possa mentire sull\\'argomento. Gli avventurieri raccontano sempre storie false, e dopotutto per quello che sai qualcuno che coincida con la tua descrizione era davvero ad Helgen e quegli idioti credono che sia davvero tu senza accorgersi dell\\'errore.\r\nHelgen sarà distrutta in ogni caso a prescindere dall\\'inizio che verrà scelto.\r\n\r\n[color=green][size=+1]INSTALLAZIONE[/color][/size]\r\n[b]Manuale[/b]\r\n============\r\n\r\nCopia i file LiveAnotherLife.esp e LiveAnotherLife.bsa nella cartella Skyrim\\\\Data. Poi Attiva il mod utilizzando il programma che preferisci.\r\n\r\n\r\n[b]Via Nexus Mod Manager[/b]\r\n=======================\r\n\r\nUtilizza il pulsante “download with manager” nella pagina di Dragonborn Italia. Il programma si prenderà cura di tutta la procedura da adesso.\r\nOppure aggiungi manualmente il file dopo averlo scaricato utilizzando il pulsante “add file from archieve” nel NMM.\r\nAlla fine assicurati di attivare il mod semplcemente cliccandoci due volte nella scheda mod del NMM.\r\n\r\n[color=green][size=+1]LOAD ORDER[/color][/size]\r\nLa posizione della mod non dovrebbe fare grande differenza eccetto se si hanno altri file che modificano la missione iniziale “Senza Catene” (MQ101). \r\n\r\n[color=green][size=+1]INCOMPATIBILITÀ[/color][/size]\r\nQualsiasi altro sistema che modifichi l\\'inizio del gioco o che modifichi la missione “Senza Catene” (MQ101)\r\n\r\n[color=green][size=+1]PROBLEMI CONOSCIUTI[/color][/size]\r\nNon sarà presente l\\'offerta a diventare thane in alcune città se si comincia come preprietario di una casa in quella città. \r\nSe si sceglie di cominciare come membro dei Compagni, dovrai sempre andare a vedere il combattimente prima che Vilkas esca per allenarti. \r\n\r\nMolti dialoghi continueranno a parlarti come se fossi stato ad helgen e fossi stato in procinto di essere giustiziato dagli imperiali. Ce ne sono troppi sparsi per il gioco perchè possa modificarli tutti. Farlo potrebbe anche alterare la missione principale.\r\n\r\n[color=green][size=+1]DISINSTALLAZIONE[/color][/size]\r\n\r\nSe hai usato il NMM disinstallalo semplicemente cliccando due volte su LiveAnother Life nella scheda mod. Altrimenti elimina manualmente i file copiati all\\'interno della cartella Skyrim\\\\Data. \r\n\r\nIl readme di questo file è disponibile nell\\'archivio scaricabile tramite il link nella sezione \\\"Mirror\\\" nella sua versione originale.\r\nReadme is available in the archieve you have to download through the Mirror link in English only.\r\n\r\nTutti i meriti vanno ad [url=http://skyrim.nexusmods.com/modules/members/index.php?id=684492]Arthmoor[/url] per la creazione di questa fantastica mod.\r\nAll credits go to [url=http://skyrim.nexusmods.com/modules/members/index.php?id=684492]Arthmoor[/url] for the creation of this awesome mod.",
  "categoryId": "24",
  "version": "2.1.1",
  "author": "Demea",
  "createdUnix": "1331745179",
  "updatedUnix": "1331745179",
  "containsAdultContent": false,
  "uploadedBy": "Demea",
  "primaryFile": null,
  "files": []
}