{
  "modId": 12907.0,
  "modName": "Racially Motivated Overhaul",
  "summary": "Overhauls Skyrim\\'s races to give each playable race a unique feel and each NPC race a unique combat experience.",
  "descriptionHtml": "RMO 2.2\r\n\r\nREADME.TXT tells what each of the playable races\\' stats are and will give a generalization of the changes to the NPC races\r\n\r\nIn vanilla Skyrim, each race regenerates health, magicka and stamina at the same rate. Each race has 35 skill bonus points. Some races have useful powers, others have useless powers.\r\n\r\nBut the worst part is they all feel the same. I forget what race I am when playing in 1st person sometimes. I forget to use my powers because it\\'s not worth the time to swap from a shout to an ability that I\\'m not even sure is gonna work\r\n\r\nRMO changes all that. It sets regen values, skill bonuses, powers, racial abilities and even carry weights and movement speeds to be unique for each race. I did my best to make it fun without making it lore-breaking, in many cases, it\\'s far more lore friendly than vanilla. I tried to make it interesting more than anything though, with multiple useful powers and while each race feels unique and is better at A than B, all races are still completely capable of any role/spec you choose to play.\r\n\r\nWhile woodland elves make GREAT archers in RMO, they don\\'t make bad mages either.\r\n\r\nMy plan is to eventually modify every NPC race in the game while adding world bosses/sea monsters. ",
  "categoryId": "34",
  "version": "2.2",
  "author": "sulmithgreysin",
  "createdUnix": "1331746426",
  "updatedUnix": "1332095672",
  "containsAdultContent": false,
  "uploadedBy": "sulmithgreysin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44523",
      "name": "RMO",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31",
      "fileName": "RMO-12907-2-2.7z",
      "uploadedUnix": "1332095672",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/d4f63e73db28aaf8d9e746eb7d7d6d67281c83f1dad0d5cd80ff2e24ec68825b/analysis/1406766548/",
      "changelogHtml": " modified NPC race sizes, giants are bigger, bigger predators, snow bears > black bears, etc <br/> \n modfied the larger races by adding a physical damage resistance <br/> \n altered some of the main NPC races resistances/weaknesses to magic/elemental/etc <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RMO-12907-2-2.7z?fid=44523&ttl=1535775216&ri=8192&rs=8192&setec=2c9452e68636b46aba6d9bbb5f70de3d"
    }
  ]
}