{
  "modId": 12919.0,
  "modName": "Diaries of Training",
  "summary": "This mod adds 3 books to the game which act as master trainers for all 18 skills.\r\nHowever you still have to pay for it and can only train 5 times per level up.\r\n\r\nDiese Mod fuegt 3 neue Buecher in das Spiel, welche als Meistertrainer fuer alle 18 Skills dienen.\r\nAllerdings muss man auch hier bezahlen und kann nur 5mal pro Level trainieren.",
  "descriptionHtml": "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\r\n--------------------------------------------------------------------------------------E N G L I S H -----------------------------------------------------------------------------------\r\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\r\n\r\nUpdate only for [color=orange]V2.5.90[/color]\r\nSince I formerly wanted to let V2.5.90 as it is I decided to even add the whole changes from the other versions into it.\r\nSo the version where the diary formerly relys on copies of the ingame master trainers don\\'t exist anymore.\r\nWhy? Because a shitload of errors can happen if ingame stuff is used which can easily altered by other mods.\r\nI want to avoid errors at any cost and I already got reports of not working training menus for some skills which actually must rely to a mod that alters the trainers in some bad way.\r\nSo since my books has now their very own master trainers and classes it should always be possible to train!\r\nV90 of course has a training limit of 90. (Ehm... I don\\'t say?!)\r\n_____________________________________________________________________________________________________________________________________\r\nFixed an bad grammar issue in the diary of an powerful archmage!\r\nA Crap!\r\nA bad grammar issue...\r\nA powerful archmage...........\r\nAn english skill of totally worse XD\r\n_____________________________________________________________________________________________________________________________________\r\nUpdate!\r\nI\\'ve made two optional versions which allows the book to even go higher in the skill training.\r\nTherefore I completely changed the behaviour of the mod.\r\nI made copies of every base actor master trainer so the original master trainers stay UNTOUCHED!\r\nBecause of this updating from V90 is a bit complicated.\r\nIn order to make the optional version work like intended you got to do the following:\r\n[color=orange][b]UPDATING PROCESS[/b][/color]\r\nDeactive V2.5.90 of Diaries of Training. Load your last savegame (which says it rely on content which isn\\'t available anymore) and save it again.\r\nAfter that install the higher version (100, 255) and get your books from Lucan again.\r\nShould work now!\r\n\r\n[color=orange]It is not recommended to use V255 without an [url=http://skyrim.nexusmods.com/mods/1175//?]uncapper[/url]. I haven\\'t installed one but I also tried it. Even I can train over 100 without any viewable effect except of wasting gold.\r\nI cannot tell how gamebreaking this is but personally I would stay at V100 without an uncapper!\r\nAnd if you use one set the max skill amount at least to 255 or lower the max training amount of my legendary trainer classes with TES5Edit.[/color]\r\n\r\n[color=green]More technical...[/color]\r\nI\\'ve made new trainer classes called \\\"legendary\\\" (not showing up in the training menu) which are completely seperated from the master trainer class. So all master trainers of the base game stay completely untouched since that new class is only used by my base actor copies of that trainers.\r\nI played a bit around with TES5Edit and the maximum training amount.\r\nSetting it to 256 will result in 0 so it seems that this value is a byte value (cannot go higher than 255).\r\nBut at least 255 is possible, I love you TES5Edit :D\r\n\r\nThanks to [url=http://skyrim.nexusmods.com/mods/8866/?]dagincourt88 and his mod[/url] for some hints :)\r\n_____________________________________________________________________________________________________________________________________\r\nReboot!\r\n\r\nAfter I joined the wilderness of Skyrim again I started to play around with the CK.\r\nWith success ^^\r\n\r\nThis mod got now updated.\r\nThe formerly function is still the same with 2 major changes:\r\n\r\n1.) The reference to the master trainers is not pointing directly to the actual person ingame.\r\nI made a new copy of every master trainer and placed him in the Riverwood Trader.\r\nDon\\'t worry, they\\'re all INITIALLY DISABLED so no one will ever see those trainers walking around in Valerius shack.\r\nBut I need them for the books so the training menu can appear.\r\nAnd since all of them have an own unique RefID they wont get mistaken with the real copies of the base actor ingame.\r\nSo hopefully no problems should appear with that.\r\nBut now every training menu should show up.\r\n\r\n2.) I changed Lucans inventory in the formerly version but this time I played around with quests scripts and successfully created a one time script which places the books in his inventory.\r\nSo the only thing what\\'s changed is the Riverwood Trader cell by adding those copies of the base actor trainers.\r\nTherefore this mod is not incompatible with traiding mods which alter the vendors of traders.\r\n\r\nThe BSA file now also contains the script sources. CK isn\\'t actually that difficult as I thought it is.\r\nJust is a bit tedious to make all those script properties :/\r\n\r\nDon\\'t ask me why I update from 2.0 to 2.5. I actually hate file version numbers and just playing around with them :P\r\nI know there is some strict hierachy of using file version numbers but I don\\'t take that so serious.\r\nPersonally I got already experience with V2.5 on the New Vegas Nexus :)\r\n_____________________________________________________________________________________________________________________________________\r\nThis mod adds 3 books to Lucan Valerius the riverwood trader, which have a cost of 0 (actually 1).\r\nBe aware that every book has a weight of 50 so all of them together weigh 150 which makes them quite useless to carry around.\r\nStore them in your home and come back if you want to train.\r\n\r\nThat\\'s it what those books do. They\\'re acting as master trainers for every skill.\r\nDivided in every class (Mage (blue), Warrior (orange), Thief (green)) one book train all 6 skills for the respective class.\r\n\r\nINSTALLTION:\r\nJust use Nexus Mod Manager or move the ESP and BSA manually into your data directory.\r\n\r\n\r\n\r\n\r\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\r\n-------------------------------------------------------------------------------------D E U T S C H -----------------------------------------------------------------------------------\r\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\r\n\r\nUpdate nur für [color=orange]V2.5.90[/color]\r\nZuerst wollte ich V2.5.90 so lassen wie sie ist, habe mich aber dann doch dazu entschlossen die Änderungen aus den anderen Versionen in sie zu übernehmen.\r\nDie Version wo die Tagebücher zuvor auf den echten Meistertrainern aus dem Spiel basierten existiert nicht mehr.\r\nWarum? Weil ein schöner Scheißhaufen an Fehlern passieren kann, wenn Sachen aus dem Hauptspiel verwendet werden, die von anderen Mods überarbeitet werden.\r\nIch möchte Fehler unter allen Umständen vermeiden und habe ja selbst bereits Berichte über nicht funktionierende Trainingmenüs für einzelne Skills erhalten.\r\nWas wohl auf eine Mod zurückzuführen ist, die das Trainingsverhalten auf eine schlechte Art verändert hat.\r\nDa meine Bücher nun ihre ganz eigenen Meistertrainer und Klassen haben, sollte es immer möglich sein damit zu trainieren.\r\nV90 lässt natürlich nach wie vor nur ein Training bis 90 zu. (Ja, was ich nicht sage XD)\r\n_____________________________________________________________________________________________________________________________________\r\nUpdate!\r\nIch habe zwei optionale Versionen erstellt, welche dem Buch erlauben mit dem Feritigkeitentraining sogar noch höher zu gehen.\r\nDeshalb wurde das Verhalten der Mods komplett verändert.\r\nIch habe Kopien der Base Actors eines jeden Meistertrainers erstellt, damit die originalen Meistertrainer UNBERÜHRT bleiben!\r\nDeshalb ist das Updaten von V90 auch etwas kompliziert.\r\nDamit die optionale Version so arbeitet wie sie soll, muss folgendes gemacht werden:\r\n[color=orange][b]Updateprozess[/b][/color]\r\nDeaktiviert V2.5.90 von Diaries of Training. Ladet das letzte Savegame (was sagt es beruht auf Content der nicht länger verfügbar ist) und speichert erneut.\r\nDanach installiert die höhere Version (100, 255) und holt die Bücher von Lucan erneut.\r\nJetzt sollte es funktionieren!\r\n\r\n[color=orange]Es ist nicht empfohlen V255 ohne einen [url=http://skyrim.nexusmods.com/mods/1175//?]Uncapper[/url] zu verwenden. Ich habe keinen installiert habe es aber ausprobiert. Selbst ich kann über 100 trainiern, ohne sichtbarem Effekt außer einer Verschwendung von Gold.\r\nIch weiß nicht wie spielzerstörend das ist, aber persönlich werde ich bei V100 ohne Uncapper bleiben!\r\nWenn einer verwendet wird, sollte der maximale Fertigkeitenlevel zumindestens 255 betragen, oder der maximale Trainigswert meiner legendären Class sollte mit TES5Edit reduziert werden.[/color]\r\n\r\n[color=green]Mehr Technisches...[/color]\r\nIch habe eine neue Trainerklasse namens \\\"legendary\\\" erstellt (wird nicht im Trainingsmenü angezeigt), welche komplett von der Meisterklasse gertrennt wurde. Also bleiben alle Meistertrainer komplett unberührt von diesen Änderungen, da diese neue Class nur von meinen Kopien der Base Actors verwendet wird.\r\nIch habe mich mit TES5Edit etwas mit dem maximal zugelassenen Trainigswert gespielt.\r\nEine Einstellung von 256 führte zum Wert 0, was also darauf schließen lässt, dass es sich um einen Byte-Wert handelt (kann nicht höher als 255 sein).\r\nAber immerhin ist 255 möglich, ein Hoch auf TES5Edit :D\r\n\r\nDanke an [url=http://skyrim.nexusmods.com/mods/8866/?]dagincourt88 und seine Mod[/url] für ein paar Tipps :)\r\n_____________________________________________________________________________________________________________________________________\r\nNachdem ich wieder in die Wildnis von Skyrim eingetaucht bin, habe ich mich entschlossen diese Mod zu übersetzen und zu überarbeiten, da ich seit Langem einmal die deutsche Version von Skyrim spiele.\r\n\r\nZwei grobe Änderungen gebenüber der früheren Version wurden vorgenommen:\r\n\r\n1.) Die Referenz für die Meistertrainer zeigt nicht mehr direkt auf die tatsächlichen Meistertrainer im Spiel, sondern auf Kopien derselben, welche im Flusswald: Handelskontor eingefügt wurden.\r\nKeine Sorge, diese Kopien sind ANFÄNGLICH DEAKTIVIERT und werden deshalb nie im Spiel erscheinen und in der Valerius-Hütte herumlaufen.\r\nAber sie werden für die Bücher benötigt, um das Trainingsmenü erscheinen zu lassen.\r\nDa meine Kopien auch alle eigene RefIDs haben, sollten sie sich nicht mit den eigentlichen Meistertrainer (die ja im Spiel keine Niemande sind) schlagen.\r\nAlso dürften hoffentlich keinerlei Probleme auftreten, aber jedes Trainingsmenü funktionieren.\r\n\r\n2.) Zuvor habe ich die Bücher direkt in das Inventar von Lucan Valerius gelegt, aber inzwischen sorgt ein Script dafür, dass sich diese Bücher in sein Inventar speichern.\r\nDas Einzige was also verändert wurde ist die Flusswald: Handelskontor cell, durch das Einfügen der ganzen Trainerdummys.\r\nDeshalb dürfte sich die Mod mit Handelsmod die das Inventar der Händler verändern nicht schlagen.\r\n\r\nDie BSA-Datei enthält nun ebenfalls die Quell-Scripte. So schwer wie anfangs gedacht ist das CK gar nicht, es ist nur mühsam die ganzen Script-Properties zu setzen :/\r\n\r\nBitte nicht darüber nachdenken, warum ich die Versionsnummer von 2.0 auf 2.5 anhebe ich spiel mich damit nur rum :P\r\nMir ist bekannt, dass es eine Hierachie in der Erhöhung der Versionsnummer gibt, aber ich hab das nie wirklich ernst genommen.\r\nUnd mit V2.5 hab ich auf dem New Vegas Nexus schon genügend Erfahrung gesammelt :)\r\n_____________________________________________________________________________________________________________________________________\r\nDiese Mod fügt Lucan Valerius, dem Händler in Flusswald 3 neue Bücher hinzu, welche 0 Gold (eigentlich 1 Goldstück) kosten.\r\nVorsicht, die Bücher wiegen je 50 also zusammen 150, was es umständlich macht sie mit sich herumzuschleppen.\r\nSie sind dazu gedacht zuhause verstaut zu werden und bei einem Levelaufstieg zum Training zurückzukommen.\r\n\r\nDas ist es was die Bücher tun. Sie fungieren als Meistertrainer für alle 18 Fertigkeiten.\r\nIn Klassen eingeteilt (Magier (blau), Krieger (orange), Dieb (grün)) trainiert ein Buch jeweils 6 Skills für die entsprechende Klasse.\r\n\r\nINSTALLATION:\r\nMit Nexus Mod Manager oder einfach die ESP und BSA-Datei in den Data Ordner verschieben.",
  "categoryId": "28",
  "version": "2.5",
  "author": "AltDunmer",
  "createdUnix": "1331755979",
  "updatedUnix": "1380916333",
  "containsAdultContent": false,
  "uploadedBy": "AltDunmer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000061469",
      "name": "Diaries of Training DV V100",
      "version": "2.5.100",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "16",
      "fileName": "Diaries of Training DV V100-12919-2-5-100.rar",
      "uploadedUnix": "1380891621",
      "modVersion": "2.5.100",
      "virusScanUrl": "https://www.virustotal.com/file/c6aa3d96a139d13cd5633630e8524a7c638546f7e16446d73d6a6925a1f2d27f/analysis/1407744903/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Diaries%20of%20Training%20DV%20V100-12919-2-5-100.rar?fid=1000061469&ttl=1535775235&ri=8192&rs=8192&setec=ae5b75052773d3c6cce614bef6174f8e"
    },
    {
      "fileId": "1000061473",
      "name": "Diaries of Training DV V255",
      "version": "2.5.255",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "16",
      "fileName": "Diaries of Training DV V255-12919-2-5-255.rar",
      "uploadedUnix": "1380891819",
      "modVersion": "2.5.255",
      "virusScanUrl": "https://www.virustotal.com/file/3bd2c4e621d67ee8339086791ad64aae4c77fe221137376b799fd29e8a114f7b/analysis/1407744904/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Diaries%20of%20Training%20DV%20V255-12919-2-5-255.rar?fid=1000061473&ttl=1535775236&ri=8192&rs=8192&setec=bd1674303c963292c3440ea3c946db5d"
    },
    {
      "fileId": "1000061489",
      "name": "Diaries of Training EV V100",
      "version": "2.5.100",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "16",
      "fileName": "Diaries of Training EV V100-12919-2-5-100.rar",
      "uploadedUnix": "1380897126",
      "modVersion": "2.5.100",
      "virusScanUrl": "https://www.virustotal.com/file/f68cd8d633522698342a1edddfe5d8f740cde43247e24072254163290ad06806/analysis/1407745022/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Diaries%20of%20Training%20EV%20V100-12919-2-5-100.rar?fid=1000061489&ttl=1535775237&ri=8192&rs=8192&setec=443178758cef12fe05f039fe371cfdd7"
    },
    {
      "fileId": "1000061493",
      "name": "Diaries of Training EV V255",
      "version": "2.5.255",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "16",
      "fileName": "Diaries of Training EV V255-12919-2-5-255.rar",
      "uploadedUnix": "1380897153",
      "modVersion": "2.5.255",
      "virusScanUrl": "https://www.virustotal.com/file/3bf938fb02ad9a590dc156e39c5b96fbe08ce4feef843187f00bb9ad38e56cdc/analysis/1407745023/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Diaries%20of%20Training%20EV%20V255-12919-2-5-255.rar?fid=1000061493&ttl=1535775237&ri=8192&rs=8192&setec=572af7e7258c09ef7497143b101809b5"
    },
    {
      "fileId": "1000061565",
      "name": "Diaries of Training DV",
      "version": "2.5.90",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "Diaries of Training DV-12919-2-5-90.rar",
      "uploadedUnix": "1380916310",
      "modVersion": "2.5.90",
      "virusScanUrl": "https://www.virustotal.com/file/02bf6e03458bd7a4781c218e1fef729dc532d2bd290c75dea33452ac2898192d/analysis/1407745230/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Diaries%20of%20Training%20DV-12919-2-5-90.rar?fid=1000061565&ttl=1535775238&ri=8192&rs=8192&setec=5bb2f060bf0a4c7b3d39b231ebadf355"
    },
    {
      "fileId": "1000061567",
      "name": "Diaries of Training EV",
      "version": "2.5.90",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "Diaries of Training EV-12919-2-5-90.rar",
      "uploadedUnix": "1380916333",
      "modVersion": "2.5.90",
      "virusScanUrl": "https://www.virustotal.com/file/4618ed2591fb1424e82c3358251efc09b7aedc8eb5573225d35f82b879ebaa7d/analysis/1407745230/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Diaries%20of%20Training%20EV-12919-2-5-90.rar?fid=1000061567&ttl=1535775238&ri=8192&rs=8192&setec=f1ab9a35ec73f95655046a0535ea056d"
    }
  ]
}