{
  "modId": 12928.0,
  "modName": "Sexy Boats v1",
  "summary": "This tiny mod features a retexture of all boats in game, including the Karl",
  "descriptionHtml": "[center][img]http://jamesfreilly.com/sexy-boats.jpg[/img][/center]\r\n\r\n[color=red]Sexy Boats 1.0[/color] \r\n\r\n[center][youtube]AEY3mrCtAno[/youtube][/center]\r\n\r\n[b]DESCRIPTION:[/b] I give you [b]Sexy Boats 1.0[/b], a really tiny mod that retextures all of the boats in Skyrim, including the Emperor\\'s ship, the Katariah. This mod is meant as a companion piece to my other mods - \r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=12308]Sexy Solitude v1[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7241]Sexy Riften v2[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7059]Sexy Whiterun v3[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7484]Sexy Winterhold v1[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7583]Sexy Villages and Towns v1[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7178]Sexy Windhelm v1[/url]\r\n\r\n[color=red][b]Please, if you use and like these or any other files on the Nexus, please endorse as it only takes a second, and it makes us modder folk feel all warm and fuzzy inside! Some of us work for weeks or more on these mods, and all we\\'re asking for in return is a little click of love from ya\\'![/b][/color] \r\n\r\n[b]Why Sexy Boats? Where\\'s Sexy Windhelm 2.0? What about Sexy Markarth? Why do you toy with my emotions so?[/b] \r\n\r\nRelax! They\\'re coming!! I did this as a quickie as I was sick of seeing the rundown vanilla boats on the Sexified docks of Sexy Windhelm, Sexy Riften, and Sexy Solitude. I retextured \\'em with new wood, new rope, new windows and metal (on the Katariah), and replaced a couple of the remaining vanilla textures with the HD versions from Bethesda\\'s HQ textures pack (flags and shields - after sharpening and tweaking the colors a bit). \r\n\r\nIt\\'s a little hard to tell by the screenshots (they\\'re tiny), but the hulls and decks have a weathered, crackled texture on \\'em that is actually a bit more convincing than the dirty green fence texture Bethesda used. I\\'ve also left the scraped off paint bits and gunk on the bigger ship in the Solitude harbor. The Katariah looks in much better shape than vanilla (as should any boat entrusted with transporting the bloody Emperor of Skyrim!), but I actually made the deck textures a little more weathered as the shiny golden maple vanilla textures reminded me of the wood flooring I want (but can\\'t afford) to install in my kitchen.\r\n\r\n[b]Who Should Use This Mod?[/b] - Anyone who uses the Sexy Cities mods. Anyone who hates the vanilla boats. That guy, Bill, if he knows what\\'s good for him.\r\n\r\n[b]Who Shouldn\\'t Use This Mod?[/b] - Everyone else. \r\n\r\nI know some folks won\\'t be able to resist commenting about how these are too clean or unrealistic, but, like I said, these are meant to be paired up with the Sexy Cities mods, which have Sexy docks that match up very well with these sexy boats. This mod will look just plain silly without them, to be honest. While feedback is welcome, some of the feedback I get on my Sexy Mods is just plain mean spirited and makes me feel as though I\\'ve personally assaulted your grandmother with a broom handle. Please. If you don\\'t like it, just move along. No one\\'s forcing anyone to use these (well, except for that Bill guy. You hear me Bill? Man, I...I freakin\\' hate your face). \r\n\r\n\r\n[b]DISCLAIMERS, CONFLICTS, INSTALL NOTES, AND ALL THAT JAZZ[/b]:\r\n\r\nWhile I consider this mod \\\"lore friendly\\\" it is NOT for everyone. Those who like the weathered look of vanilla Skyrim should steer clear. Those who like a more fantastical world, ala Oblivion, The Witcher, and Fable, with more vibrant colors, however, should give this one a try!\r\n\r\nAs with any texture thing I do, it\\'s all for fun and, ultimately, my personal enjoyment. If you don\\'t like it, that\\'s fine, but please don\\'t flame it here as that is AGAINST TOS and [b]your post will be reported[/b]. Constructive criticism only, please! That stands for all mods on the Nexus as the folks who work on these things deserve better than some of the really crap comments I\\'ve seen floating about. This community is better than that!\r\n\r\n[color=red][b]Notes on Using with Bethesda HQ Texture Pack:[/b][/color] This mod, like most of the texture mods, may not work with the Bethesda HQ textures pack unless you do a few tweaks (or simply disable them, which I recommend as there are much better texture mods out than the official ones!). You can find several workarounds  [url=http://forums.nexusmods.com/index.php?/topic/554970-important-info-for-mod-authors-regarding-official-hd-texture-pack] HERE[/url] on the Nexus Forums.\r\n\r\n\r\n[b]NMM INSTALL:[/b] Download with NMM and let it do the install for you OR...\r\n\r\n\r\n[b]MANUAL INSTALL:[/b]  \r\n\r\nStep 1) Copy the \\\"ships\\\" folder out of the zip, and paste it into your \\\"/Data/textures/dungeons folder. (ie: \\\"Steam/steamapps/common/skyrim/Data/textures/dungeons/ships\\\"). If you don\\'t already have a dungeons folder, just copy the dungeons folder to the textures folder. EZ\r\n\r\n\r\n[b]UNINSTALL:[/b] Delete folders or uninstall with NMM.\r\n\r\nPLEASE don\\'t IM me to ask if you can upload this to some site in Russia or China or translate it into the language of the K\\'klung tribe. For the foreseeable future, my files will be Nexus exclusives, and, while I am more than happy to share this with anyone who wants it, I like to have all the files in one place so I can make changes/updates as I see fit, as well as support anyone who has issues. Thanks for understanding. ;)\r\n\r\nThanks to Bethesda,  to  whom  all of  this  stuff belongs in the first place!  ",
  "categoryId": "53",
  "version": "1.0",
  "author": "horrorview",
  "createdUnix": "1331766086",
  "updatedUnix": "1331766222",
  "containsAdultContent": false,
  "uploadedBy": "horrorview",
  "primaryFile": null,
  "files": [
    {
      "fileId": "43413",
      "name": "Sexy Boats v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20577",
      "fileName": "Sexy Boats v1-12928-1-0.zip",
      "uploadedUnix": "1331766222",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9ec739d1712e151b0eecf2defef32338aead0cb9e6d888f267cf36f07f14bcd4/analysis/1406749469/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sexy%20Boats%20v1-12928-1-0.zip?fid=43413&ttl=1535775255&ri=8192&rs=8192&setec=b0cdf2a293e1593248e69f384ce8644a"
    }
  ]
}