{
  "modId": 12927.0,
  "modName": "Ranger Ridge TRADUZIONE ITALIANA",
  "summary": "Traduzione italiana della mod di Eldiabs\r\nTHIS IS ONLY A TRANSLATION OF THE ORIGINAL MOD",
  "descriptionHtml": "[color=red][size=+2][center]NOTICE![/color][/size][/center]\r\n[color=red][size=+1][center]This is only a translation into Italian of the original mod. All credits go to the creator of the [url=http://skyrim.nexusmods.com/downloads/file.php?id=9904]original mod[/url].\r\nA player home geared towards a ranger or hunter play style. Involves a short fetch and kill to obtain key. Read the journal on the chair by the door.\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.[/color][/size][/center]\r\n\r\n[color=green][size=+5][center]UNA PRODUZIONE DRAGONBORN ITALIA[/color][/size][/center]\r\n\r\n[color=green][size=+1]DESCRIZIONE[/color][/size]\r\nUn\\'abitazione per il giocatore che si adatta maggiormente ad un personaggio ranger o cacciatore. Include una piccola missione uccidi e raccogli per ottenerne la chiave. Leggi il diario sulla sedia vicino alla porta.\r\n\r\n[b]v 1.33[/b] \r\nFixed - Auto-storage funziona di nuovo, comunque se avete una versione precedente installata e volete aggiornare alla 1.33 dovrete fare un salvataggio pulito prima di installare la mod di nuovo perché tutto funzioni correttamente. Leggere le istruzioni più in basso se non sapete come effettuare un salvataggio pulito.\r\nAggiunta - Accesso agli oggetti. Ora dovunque utilizziate un laboratorio di alchimia, una forgia, un crogiolo o un incantatore arcano, potrete avere accesso agli oggetti necessari utilizzando il vicino contenitore.\r\nAggiunta - Quest! Adesso potrete trovare il licantropo più facilmente. Prendete semplicemente il diario di Malyon e la missione avrà inizio.\r\nFixed - Il diario non cadrà più attraverso la sedia.\r\n\r\n[u]Segui queste istruzioni per effettuare un salvataggio pulito[/u]:\r\n\r\n1. Carica il tuo salvataggio e entra in un piccolo luogo chiuso. Uno vicino Cima del Ranger potrebbe essere la Distilleria Honningbrew.\r\n2. Effettuate un NUOVO salvataggio. Non sovrascrivete vecchi salvataggi e non effettuate un salvataggio rapido.\r\n3. Uscite dal gioco e disinstallate completamente la mod.\r\n4. Riaprite il gioco caricando il salvataggio appena fatto, dopodiché effettuate un altro salvataggio senza sovrascriverne un precedente e senza salvataggio rapido, proprio come prima.\r\n5. Uscite dal gioco ed installate l\\'ultima versione della mod. Aprite il gioco e caricate l\\'ultimo salvataggio. Per sicurezza effettuate un altro NUOVO salvataggio ed è fatta.\r\n\r\n[b]v 1.3 e successive[/b]\r\nAdesso include l\\'[url=http://skyrim.nexusmods.com/downloads/file.php?id=12468]Automatic Item Storage[/url] di qlhaele.\r\n\r\n[color=green][size=+1]LUOGO[/color][/size]\r\nLa casa è situata vicino al crocevia tra Whiterun e Riverwood. Vai alla Distilleria Honningbrew e guarda verso l\\'incrocio a destra, sulla collina dall\\'altra parte del fiume. Per i meno avventurosi sulla pagina principale è presente uno screenshot con il luogo dove avviene l\\'incontro per ottenere la chiave.\r\n\r\n[color=green][size=+1]INSTALLAZIONE[/color][/size]\r\nQuesta è solo una traduzione, è necessario installare il mod originale prima. Dopo averlo installato sostituisci RangerRidge.esp e RangerRidge.esm con quelli che trovi nell\\'archivio scaricabile dalla pagina di [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]Dragonborn Italia[/url]. \r\n\r\n\r\nTutti i meriti vanno ad [url=http://skyrim.nexusmods.com/modules/members/index.php?id=916280]Eldiabs[/url] per la creazione di questa fantastica mod.\r\nAll credits go to [url=http://skyrim.nexusmods.com/modules/members/index.php?id=916280]Eldiabs[/url] for the creation of this awesome mod.",
  "categoryId": "67",
  "version": "1.33",
  "author": "Demea",
  "createdUnix": "1331765535",
  "updatedUnix": "1331765535",
  "containsAdultContent": false,
  "uploadedBy": "Demea",
  "primaryFile": null,
  "files": []
}