{
  "modId": 12932.0,
  "modName": "Signs and Guardians",
  "summary": "Changes the way the Standing Stones operate for an improved roleplaying experience.",
  "descriptionHtml": "Signs and Guardians: A reimagining of the Standing Stones\r\n\r\nAuthor: Thomas Kaira\r\n\r\n\r\nVersion: 2.2.6\r\n\r\n\r\n=========\r\nChangelog\r\n=========\r\n\r\n05/02/2012: Version 2.2.6\r\n\r\n- Tweaked the Uninstall script for better functionality if the player wishes to return the mod to their load order and prevent an exploit.\r\n\r\n04/27/2012: Version 2.2.5\r\n\r\n - Fixed issue with Hadvar\\'s/Ralof\\'s dialogue commentating on your choice of Guardian not playing if the player selected one of the new Spells.\r\n - Mage\\'s Fury Crash will no longer completely halt the player\\'s Magicka Regen. if the player has taken The Atronach\\'s Portal or The Atronach\\'s Arcana.\r\n - Spell timers for The Mage\\'s Fury Crash and The Warrior\\'s Belligerence Crash were not counting properly.\r\n\r\n04/08/2012: Version 2.2.2\r\n\r\n - Made a few more corrections to spell descriptions.\r\n\r\n03/25/2012: Version 2.2.1\r\n\r\n - Typo correction.\r\n\r\n03/23/2012: v2.2\r\n\r\n - Corrected an error in one of the Lord\\'s abilities.\r\n\r\n03/22/2012: v2.1\r\n\r\n - The Atronach\\'s Portal was reducing the player\\'s Magicka Regen by far too much.\r\n - The Apprentice\\'s Tempest will now affect spell Duration so to benefit spells that have no Magnitude.\r\n\r\n03/21/2012: v2.0\r\n\r\n - Complete overhaul, all Standing Stones now have three blessings to choose from.\r\n - A whole bunch of new powers and abilities are available, some of which are unique.\r\n - The Serpent now allows you to choose which specialization you want to obtain blessings from.\r\n\r\n03/15/2012: v1.1\r\n\r\n - The Lover\\'s Comfort is now a Power instead of an Ability, increasing XP gain by 10% for 5 minutes.\r\n - Added the Lover\\'s Kiss power, paralyzing your opponent for 5 seconds at the cost of 100 points of Stamina.\r\n\r\n\r\n03/14/2012: v1.0\r\n\r\n - Initial Release\r\n\r\n\r\n============\r\nRequirements\r\n============\r\n\r\nSkyrim official patch v1.5.24\r\n\r\nWILL NOT WORK WITH OLDER VERSIONS\r\n\r\n========\r\nOverview\r\n========\r\n\r\nOne of the things that really irked me about Skyrim was the lack of decent choices for you to make about your character\r\nand how he would progress in the world. Sure, it\\'s nice to be free to develop as you see fit, but I feel that one must\r\nstill set up some walls to help keep him focused, while not terribly limiting that freedom to explore abilities and expand.\r\n\r\nSkyrim\\'s Standing Stones, which are carbon copies of Oblivion\\'s Doomstones (even the Creation Kit admits to this), provide\r\nthe player with various blessing that he can take, one at a time, whenever he wants. But I am of the mind that Bethesda\r\nactually meant replacing Birthsigns with the Standing Stones, but the way it is implemented now just doesn\\'t work. Birthsigns\r\nare meant to give you some direction while you build your character, not be a one-off throwaway bonus. I wanted your choice\r\nof Standing Stone to mean something, and that\\'s where we get to this mod.\r\n\r\n\r\n========\r\nFeatures\r\n========\r\n\r\n - The mod divides the Stones into three distinct categories: the Guardians, the Charges, and the Serpent.\r\n\r\n - If you already have an active Standing Stone power when you first install the mod, it will be removed \r\n   automatically and you will be prompted to return to the Guardian Stones to select your Guardian. If you \r\n   don\\'t, then don\\'t worry, the mod will leave you alone.\r\n\r\n - Your first choice is to select your Guardian. This is a very important choice, as it will allow your character\r\n   to favor a specific gameplay archetype (Combat, Magic, or Stealth) and also decides which Charges you may accept\r\n   blessings from.\r\n\r\n - Once you choose your Guardian, there is no going back. It is yours for good, and you cannot change your mind.\r\n   Choose wisely.\r\n\r\n - Each Guardian has three charges (child stones). After choosing a Guardian, you may also obtain blessings from any of their charges\r\n   whenever you wish. You need only find their Standing Stones.\r\n\r\n   The Guardian/Charge relationship is this:\r\n\r\n   Warrior: the Lady, the Lord, and the Steed\r\n   Mage: the Apprentice, the Atronach, and the Ritual\r\n   Thief: the Lover, the Shadow, and the Tower\r\n\r\n   The Serpent is the exception, it stands alone.\r\n\r\n - You get to keep any blessings you obtain, they will not be removed. Just remember that you can\\'t have them all.\r\n\r\n - You can choose between three blessings from every Standing Stone. They are as follows:\r\n\r\n - Guardians:\r\n\r\n - The Mage-\r\n\r\n   The Mage\\'s Favor: Ability - Magic skills increase 20% faster.\r\n   The Mage\\'s Intellect: Ability - Permanent +50 magicka bonus (applied through scripting so the game doesn\\'t see it as a fortification)\r\n   The Mage\\'s Fury: Power - Your Destruction spells are 50% more powerful for 2 minutes, but once effect ends, your Magicka recharges 50% slower for 5 minutes.\r\n\r\n - The Thief -\r\n\r\n   The Thief\\'s Favor: Ability - Stealth skills increase 20% faster\r\n   The Thief\\'s Endurance: Ability - Permanent +50 stamina bonus (applied through scripting so the game doesn\\'t see it as a fortification)\r\n   The Thief\\'s Light Step: Power - Fortifies your Sneak, Lockpick, and Pickpocket skills by 30 for 60 seconds, but stops Health regeneration.\r\n\r\n - The Warrior -\r\n\r\n   The Warrior\\'s Favor: Ability - Combat skills increase 20% faster\r\n   The Warrior\\'s Fortitude: Ability - Permanent +50 health bonus (applied through scripting so the game doesn\\'t see it as a fortification)\r\n   The Warrior\\'s Belligerence: Power - Increases Melee damage by 50% for 2 minutes, but you suffer a 50% loss of Stamina Regen. afterwards.\r\n\r\n - Charges:\r\n\r\n   The Lady -\r\n\r\n   The Lady\\'s Health: Ability - Health Regen. is increased by 35%\r\n   The Lady\\'s Vitality: Ability - Stamina Regen. is increased by 50%\r\n   The Lady\\'s Fervor: Power - Increases Health and Stamina by 100 points for 15 seconds, but stops their regeneration.\r\n\r\n - The Lord -\r\n\r\n   The Lord\\'s Shield: Ability - Increases your Armor Rating by 75.\r\n   The Lord\\'s Trollkin: Ability - Gives you 40% Resistance to Frost, but also 40% Weakness to Fire.\r\n   The Lord\\'s Blood: Power - Convert half of your Stamina into Health.\r\n\r\n - The Steed -\r\n\r\n   The Steed\\'s Strength: Ability - +100 Carry Capacity, and armor doesn\\'t slow you down when worn.\r\n   The Steed\\'s Canter: Power - You can sprint 25% faster.\r\n   The Steed\\'s Kick: Power - Staggers your foes and damages them.\r\n\r\n - The Apprentice -\r\n\r\n   The Apprentice\\'s Ego: Ability - Magicka regenerates twice as fast, but you are 50% weaker to Magic attacks.\r\n   The Apprentice\\'s Pomposity: Power - Steals Magicka from your foes, but also heals them.\r\n   The Apprentice\\'s Tempest: Ability - All spells are 25% more effective, but they cost 25% more Magicka to cast.\r\n\r\n - The Atronach -\r\n\r\n   The Atronach\\'s Arcana: Power - Increases your Magicka by 200 points while slowing your Magicka Regen for 60 seconds.\r\n   The Atronach\\'s Portal: Ability - You can absorb spells, but your Magicka regenerates slower.\r\n   The Atronach\\'s Mirror: Power - Completely drains your opponent\\'s Magicka, stopping them from spellcasting, but also stops your Magicka Regen. for 60 seconds.\r\n\r\n - The Ritual -\r\n\r\n   The Ritual\\'s Ceremony: Power - Allows you to resurrect surrounding dead bodies to fight for you.\r\n   The Ritual\\'s Banishing: Power - Causes all Undead around you to flee for 30 seconds.\r\n   The Ritual\\'s Serenity: Power - Once per day, calms all surrounding foes (but not Machines, Undead, or Daedra) for 30 seconds.\r\n\r\n - The Lover -\r\n\r\n   The Lover\\'s Comfort: Ability - Increases your Stamina Regen. by 25%.\r\n   The Lover\\'s Grace: Ability - You move, attack with dual-wielded weapons, and attack with bows 10% faster.\r\n   The Lover\\'s Kiss: Power - Paralyze your foes for 5 seconds at the cost of 100 Stamina if you hit them.\r\n\r\n - The Shadow -\r\n\r\n   The Shadow\\'s Cloak: Power - 60 seconds of Invisibility.\r\n   The Shadow\\'s Veil: Power - Clouds the minds of your foes and frenzies them.\r\n   The Shadow\\'s Elusion: Power - You become one with the Shadow (Ethereal and Invisible) and time is slowed by 50% for 5 seconds.\r\n\r\n - The Tower -\r\n\r\n   The Tower Key: Power - Once per day, unlock any level lock (but not Key Required locks, for obvious reasons).\r\n   The Tower Warden: Power - For 60 seconds, you have a chance to reflect 50% of damage taken back at your foes.\r\n   The Tower Crenellation: Power - Increases your Sneak Attack multiplier with bows by 2 for 20 seconds.\r\n\r\n - And, of course there is the Serpent, which if you take Him, you can choose to receive three random blessings from the \r\n   specialization of your choosing (Combat, Magic, or Stealth) in addition to his own Blessing, but you will lose all of \r\n   your current Blessings and will lose the ability to interact with the Standing Stones, as well as take The Serpent\\'s \r\n   Curse, decreasing the rate at which skills increase by 25%. \r\n\r\n\r\n============\r\nInstallation\r\n============\r\n\r\nVia Nexus Mod Manager: Download the mod through the Manager and install it as you would any other mod. There is nothing\r\nfancy about the packaging, so it will work without need of any special treatment.\r\n\r\nVia Steam Workshop: Subscribe to the mod in the Workshop, and the Skyrim launcher will download the mod for you\r\nautomatically the next time you start the game.\r\n\r\nVia Wrye Bash: Place the package into your Bash Installers folder, navigate to BAIN, and select \\\"Install\\\" when you find\r\nthe package listed.\r\n\r\nManually: Not recommended.\r\n\r\n\r\n==============\r\nUninstallation\r\n==============\r\n\r\n!!!!!!!!!!!!!!IMPORTANT!!!!!!!!!!!!!!!!\r\n\r\nDue to the method this mod uses in places to modify your stats, you MUST perform this step when uninstalling, or your\r\nstats will be broken:\r\n\r\n - Open the Console, type \\\"startquest doomTKUninstallQuest,\\\" and WAIT until the uninstall script finishes. A message box \r\n   will prompt you when it is done.\r\n\r\n!!!!!!!!!!!!!!IMPORTANT!!!!!!!!!!!!!!!!\r\n\r\nOnce you have performed that step:\r\n\r\nVia Nexus Mod Manager: Deactivate the mod.\r\n\r\nVia Steam Workshop: Unsubscribe.\r\n\r\nVia Wrye Bash: Find the package in BAIN and Uninstall.\r\n\r\nManually: This is why I do not recommend manual installation.\r\n\r\n\r\n============\r\nKnown Issues\r\n============\r\n\r\nNone at this time.\r\n\r\n\r\n=============\r\nCompatibility\r\n=============\r\n\r\nNot compatible with any mods that alter the Standing Stones themselves.\r\n\r\n\r\n===============\r\nLicensing/Legal\r\n===============\r\n\r\n - You are free to alter, expand on, or destroy this mod in any way you see fit. If you wish to share your work, however, \r\n   you MUST contact me and obtain my explicit permission before doing so. Any instances of severe mod destruction will \r\n   not be eligible for technical support until restored to a functional state.\r\n\r\n - Any works that are found to be in breach of the above, the author will receive a single polite request from me to \r\n   remove it from wherever it is being hosted (from all sites it is being hosted on). Failure to respond within 48 hours\r\n   will result in more direct action being taken.\r\n\r\n - DO NOT upload this mod to any site other than those I have personally uploaded it to without my express permission \r\n   given. Any user or site found in violation of this will be considered to be stealing intellectual property and will \r\n   be treated as such. Just because this mod is free does not mean that gives you free reign over what you can do with it. My work, my rules.\r\n\r\n - If I fail to respond to your requests to expand or alter this mod within 30 days, you may consider yourself as having \r\n   my approval to do as you wish, but please note that upload location restrictions still stand.",
  "categoryId": "24",
  "version": "2.2.6",
  "author": "Thomas Kaira",
  "createdUnix": "1331770810",
  "updatedUnix": "1336015260",
  "containsAdultContent": false,
  "uploadedBy": "Thomas Kaira",
  "primaryFile": null,
  "files": [
    {
      "fileId": "43604",
      "name": "Signs and Guardians v1-1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18",
      "fileName": "Signs and Guardians v1-1-12932.7z",
      "uploadedUnix": "1331834034",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6552534d1674ce5ebf8e6eae1092edae9107f15e107ce9b19e7b8a01f6f25f88/analysis/1406750424/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Signs%20and%20Guardians%20v1-1-12932.7z?fid=43604&ttl=1535775264&ri=8192&rs=8192&setec=320af79153a124056da1852c49f5b930"
    },
    {
      "fileId": "58271",
      "name": "Signs and Guardians v2-2-6",
      "version": "2.2.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35",
      "fileName": "Signs and Guardians v2-2-6-12932.7z",
      "uploadedUnix": "1336015260",
      "modVersion": "2.2.6",
      "virusScanUrl": "https://www.virustotal.com/file/498bfafc294a9fd2cd5cd0625817e3d83feb19ed9a9166a2989e0f302486794c/analysis/1406862849/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Signs%20and%20Guardians%20v2-2-6-12932.7z?fid=58271&ttl=1535775265&ri=8192&rs=8192&setec=7cda1d63d13b051927ecfe4d955447cb"
    }
  ]
}