{
  "modId": 12939.0,
  "modName": "A Perfect Circle",
  "summary": "The Companions Guild is an elite fighting force with a hidden power. This mod will bring out their true colors in the form of enhanced abilities and powers. This mod is a work in progress, and modifies NPCs belonging to the Companions Guild.",
  "descriptionHtml": "UPDATED! (see notes at bottom for current changes)\r\nThe Companions Guild is an elite fighting force with a hidden power. This mod will bring out their true colors in the form of enhanced abilities and powers. This mod is a work in progress, and modifies NPCs belonging to the Companions Guild.\r\n\r\nCompanions belonging to the inner \\\"Circle\\\" can now utilize their transformation abilities!\r\n-NPC transforms into werewolf form for 60 seconds\r\n-Transformation occurs when taking enough damage from enemies\r\n-NEW: NPC will try to transform when you do!\r\n-Has a knockback ability\r\n-Has a 3 minute cooldown between uses\r\n\r\nAdditionally, Companions members have had their skills and gear updated\r\n\r\nAela the Huntress\r\n-Now a dual wield and ranged specialist\r\n-added perks for sneak, light armor, ranged, and dual wield\r\n\r\nVilkas\r\n-Added perks for one and two handed, block, and heavy armor\r\n\r\nFarkas\r\n-modified heavy armor trainer profile to give better skills (previously had sneak and speech weights)\r\n-Added perks for one and two handed, block, and heavy armor\r\n-Added Wolf armor to default inventory\r\n\r\nAthis\r\n-added perks that match his skills for heavy armor, dual wield, and sneak\r\n-Athis is now wearing steel armor and wields a sword and knife with ease\r\n\r\nNjada Stonearm\r\n-added perks for one handed, block, and light armor to match her skills\r\n-Njada now wears scale armor (no helm) and wields a skyforge axe and shield\r\n\r\nRia\r\n-added perks for one handed, block, and heavy armor to match her skills\r\n-Ria now wears imperial heavy armor since she is an imperial herself\r\n\r\n\r\nFuture updates will include changes to other Companions members to update their gear/skills\r\n\r\nThis mod is a work in progress. It may not work with other mods that change Companions NPCs. Please submit feedback below and let me know of any bugs you happen upon. Don\\'t forget to rate!\r\n\r\n*******************************************************************************\r\nCURRENT UPDATE: 03/14/2012\r\n-Adjusted health threshold to try and prevent bad transformation.  See notes in \\\"known issues\\\" below\r\n-Changed Farkas and Vilkas reaction to crime.  Fixes issue where Farkas or Vilkas would not transform back\r\n-Changed Farkas Heavy Armor trainer profile to match his skills (previously had bad skills like sneak and Speech)\r\n-Added block and 1h perks to Farkas and Vilkas\r\n\r\nPrevious Update: 03/10/2012\r\n-As requested, added Wolf Armor to Farkas\\' default inventory\r\n-Circle members will now try to tranform when you do while in combat! Let the howling and shredding begin!!!!\r\n-Updated skills, perks, and equipment for Athis, Njada, and Ria\r\n\r\n\r\nPrevious Update: 03/06/2012\r\n-Changed health threshold for transformation. Transformation happens at 40% or less health.\r\n-Modified perks for Aela. She was a bit too powerful at higher levels. Now a bit more balanced.\r\n\r\nKnown Issues:\r\n-NPC sometimes gets stuck in terrain when transforming. Usually will unstick themselves, or fast traveling fixes this.\r\n-Bad transformations (character stuck transforming) occur when the NPC takes too much damage and is staggered or \\\"dies\\\"  To avoid this, keep heavy hitting enemies off NPC while they transform.   (Or give them better armor :P   )\r\n\r\nPlease endorse, leave feedback, and any bugs you encounter!!!\r\n\r\nAlso found on steam workshop http://steamcommunity.com/sharedfiles/filedetails/?id=14704",
  "categoryId": "33",
  "version": "1.5",
  "author": "lunatikfringe",
  "createdUnix": "1331783423",
  "updatedUnix": "1331783570",
  "containsAdultContent": false,
  "uploadedBy": "lunatikfringe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "43472",
      "name": "A Perfect Circle",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "A Perfect Circle-12939-1-5.zip",
      "uploadedUnix": "1331783570",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/144371c11ac5f76905580a89fb2b9d5de985b4a3a3c76b2f9110bdba6a5a179d/analysis/1406749806/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Perfect%20Circle-12939-1-5.zip?fid=43472&ttl=1535775275&ri=8192&rs=8192&setec=8f1852bf2b8efe0d74133084894ec1cb"
    }
  ]
}