{
  "modId": 12960.0,
  "modName": "Stones of Barenziah Quest Markers TRADUZIONE ITALIANA",
  "summary": "Questa è solo una traduzione del file originale di toaDima\r\nTHIS IS ONLY A TRANSLATION OF THE ORIGINAL FILE",
  "descriptionHtml": "[color=red][size=+2][center]NOTICE![/color][/size][/center]\r\n[color=red][size=+1][center]This is only a translation into Italian of the original mod. All credits go to the creator of the [url=http://skyrim.nexusmods.com/downloads/file.php?id=9385]original mod[/url].\r\nStone of Berenziah Quest Marker simply adds quest markers to all 24 of the Stones of Barenziah (Unusual Gems) that you need to find/collect for the \\\"No Stone Unturned\\\" quest.\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.[/color][/size][/center]\r\n\r\n[color=green][size=+5][center]UNA PRODUZIONE DRAGONBORN ITALIA[/color][/size][/center]\r\n\r\n[color=green][size=+1]DESCRIZIONE[/color][/size]\r\nQuesta semplice mod aggiunge la posizione sulla mappa di tutte e 24 le Pietre di Berenziah (gemme insolite) che devi raccogliere nella missione Ricerca Meticolosa. Le posizioni vengono aggiunte soltanto dopo aver raccolto la prima gemma insolita e dopo che Vex ti avrà rivelato la loro vera natura e ti avrà assegnato la missione di recuperarle tutte. \r\ndei dow\r\n\r\n[color=green][size=+1]INSTALLAZIONE[/color][/size]\r\n\r\n[b]UTILIZZANDO IL NEXUS MOD MANAGER[/b]\r\nFai clic sul pulsante Dowload with Manager nella pagina dei download presente su Dragonborn Italia, a cui puoi arrivare tramite la sezione Mirror in alto a destra di questa pagina. Il NMM si occuperà di tutto il resto.\r\n\r\n[b]MANUALE[/b]\r\nScarica l\\'archivio presente nella pagina di Dragonborn Italia raggiungibile tramite la sezione Mirror in alto a destra di questa pagina. Copia il file .esp presente nell\\'archivio nella cartella Skyrim/Data. Ricordati di attivare la mod utilizzando il louncher principale o il NMM. \r\n\r\n\r\nTutti i meriti vanno a [url=http://skyrim.nexusmods.com/modules/members/index.php?id=2258228]toaDime[/url] per la creazione di questa mod.\r\nAll credits go to [url=http://skyrim.nexusmods.com/modules/members/index.php?id=2258228]toaDime[/url] for the creation of this mod.",
  "categoryId": "24",
  "version": "1.3",
  "author": "Demea",
  "createdUnix": "1331816755",
  "updatedUnix": "1331816755",
  "containsAdultContent": false,
  "uploadedBy": "Demea",
  "primaryFile": null,
  "files": []
}