{
  "modId": 12968.0,
  "modName": "Project Legacy",
  "summary": "Project Legacy is a mod that is designed to truly change the way you play The Elder Scrolls V: Skyrim. This mod will include game-changing features such as player-aging, life-expectancy, evolving diseases and viruses and a whole lot more!",
  "descriptionHtml": "Project Legacy is a mod that is designed to truly change the way you play The Elder Scrolls V: Skyrim. This mod will include game-changing features such as player-aging, life-expectancy, evolving diseases and viruses and a whole lot more!\r\n\r\n_______________________\r\n\r\nProjet Legacy is a somewhat ambitious mod. The things I wish to add to this mod will take a lot of time to complete if I do it by myself--so, if you are a modder and you have some time to spare, why not help a brother out?\r\n\r\n_______________________\r\n\r\nFOLLOW DEVELOPMENT PROGRESS ON THE DEV DIARY!\r\n\r\n- Episode 6 (NPC Aging) http://www.youtube.com/watch?v=rHzut3Ul5kA&feature=youtu.be\r\n- Episode 5 (Player Alignment / Moral + Birth Day) http://www.youtube.com/watch?v=uGTZ4XT2L_g\r\n- Episode 4 (Dynamic Scars + Beard Growth) http://www.youtube.com/watch?v=-MAuQ-S1eUY\r\n- Episode 3 (Real-time Beard Growth) http://www.youtube.com/watch?v=vLjGR4zutNI\r\n- Episode 2 (Update Overview) http://www.youtube.com/watch?v=Y2fb77Oc-ZE\r\n- Episode 1 (Preview of features to come) http://www.youtube.com/watch?v=_RsH6AvO5E8&feature=related\r\n\r\nUPDATE:\r\n\r\n22/3\r\nProject Legacy is well on its way into proper development -- so much, in fact, that real game changing elements will be added to the mod in the coming weeks. However, due to the very nature of this mod (being age-centric and all) it will exclusively affect human races. Elves, Khajiit, and other non-human races, will not be affected by this mod.\r\n\r\nMore here: http://ungodlikeproductions.com/project-legacy/news/13-the-legacy-begins.html\r\n\r\n22/3\r\nThe next patch may require you to create a new character if you wish to experience the mod in its entirety. \r\n\r\n18/3\r\nUpdated to v0.01a. The following features have been added:\r\n\r\n- Male Human Player physical 3 stage aging (adult / middle aged / elder)\r\n- Facial Hair Growth (Only with players that don\\'t already have beard)\r\n- Dynamic scarring. (Only male human races)\r\n\r\n17/3\r\nA few changes have been made to the future plans. Check them out!\r\n\r\n17/3\r\nVideo Dev Diary posted. Now you can keep a track of development! Check it out!\r\n\r\n14/3\r\nThe next update will include full physical player aging along with permanent scars and wounds. If you get wounded too often in battle the scars will show as you age.\r\n\r\nThere will be three stages of aging for human players: Adult / Middle Aged / Elder. Each age stage has pros and cons. For instance, an elder will have mana and magika bonuses but be weaker.\r\n\r\n14/3\r\nAs I mentioned earlier. Due to popular demand shouts will remain in the game.\r\n\r\nA few more modders have been recruited to the project and an update is due, hopefully, this Sunday.\r\n\r\n11/3\r\nI\\'ve figured out a way to physically age the player. So your character will whither and wrinkle with age. I am working on this script right now and, hopefully, it should be up in a week or so!\r\n--------------------------------------\r\n\r\nLive Now:\r\nPlayer Aging -\r\nOnce this mod is installed it will work with any save game. The story begins when you are 21 years old and this mod will calculate how old you are according to how many days have passed since the story began.\r\n\r\nA message will pop up on the screen letting you know when your player has aged.\r\n\r\nCurrently there are no affects to aging but I am working on that for the next update.\r\n\r\nThis mod has not been tested with other mods but I don\\'t see how it could cause conflict with any other mods you might have installed.\r\n_______________________\r\n\r\nFuture Plans:\r\nLife & Health:\r\n\r\n\r\n- Hair/Facial hair grows. (DONE!)\r\n- Scars and wounds appear. (DONE!)\r\n- Immortality can be gained through Vampirism (DONE!). \r\n- Player can be permanently wounded.(DONE!)\r\n- Your player will get birthday perks! (DONE!)\r\n- Working NPC Aging System! (DONE!)\r\n- Life expectancy can shorten if a regular and healthy diet is not maintained. (DONE!)\r\n- Players need to sleep at least 8 in-game hours ever two days (48 in-game hours). (DONE!)\r\n\r\n- Player morality. Certain events will have emotional consequences.\r\n- Different races have different life expectancy based on game time.\r\n- Diseases can be contagious and fatal -- in some cases cause pandemics\r\n- Players can freeze to death.\r\n- Players can die of dehydration.\r\n- Players can pass out from exhaustion.\r\n\r\n\r\n\r\nAlcohol:\r\n- Drinking will affect your personality. Are you a ruthless law breaking brute? Then you will most likely be a violent drunk!\r\n- Impairs speech.\r\n- Triggers bizarre dialogues\r\n- Handicaps skills.\r\n- Causes black-out (in which results may vary eg. wake up with a bounty at a random location)\r\n- Causes addiction (become an alcoholic).\r\n\r\nNPC and Friends:\r\n- Will ask for aid in their personal quests.\r\n- Can betray you,\r\n- Will only follow and help you if they think it\\'s worth it.\r\n\r\nFamily:\r\n- Spouse can be kidnapped.\r\n- Children can be adopted or conceived.\r\n\r\nLegacy Game-Play adjustments:\r\n- DND style alignment system.\r\n- Shouts removed. (Changed to: Harder to master)\r\n- Magic is taboo -- not everyone believes in it. You can, however, seek to discover and learn it... but it\\'s challenging.\r\n- Become High King or Jarl -- play as your own child once you die!\r\n- Each play-through affects the story.\r\n\r\n______________________\r\n\r\nVisit the official website: http://ungodlikeproductions.com/",
  "categoryId": "24",
  "version": "0.2.5a",
  "author": "FiLTHYESKiMO",
  "createdUnix": "1331828917",
  "updatedUnix": "1334535042",
  "containsAdultContent": false,
  "uploadedBy": "FiLTHYESKiMO",
  "primaryFile": null,
  "files": [
    {
      "fileId": "53608",
      "name": "Project Legacy",
      "version": "0.2.5a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30813",
      "fileName": "Project Legacy-12968-0-2-5a.rar",
      "uploadedUnix": "1334535042",
      "modVersion": "0.2.5a",
      "virusScanUrl": "https://www.virustotal.com/file/4b8e4099cc02f723a6f279e5d7bff5ecaad1ed5d62133f4932c3ed548afe49f5/analysis/1406818040/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Project%20Legacy-12968-0-2-5a.rar?fid=53608&ttl=1535775324&ri=8192&rs=8192&setec=117c4fc6202ce0796426fe4ba67f2465"
    }
  ]
}