{
  "modId": 12991.0,
  "modName": "More Powerful Shouts Traduzione ITA",
  "summary": "Traduzione in ITA della mod More Powerful Shout di mrstiffy",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/downloads/file.php?id=12139]original mod[/url].\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\n\r\n-Makes harmful shouts like fire breath and frost breath do up to 6x more damage.\r\nThe first word being at least 2x stronger, second 3.5x and the third is 5 to 6x more powerful.\r\n\r\n-Reduces cool down time of most shouts by at least 20 to 50 % depending on shout.\r\n\r\n-Gives Unrelenting Force some physical damage.\r\n\r\n\r\nAll credits go to the creator of the original mod.[/color][/size]\r\n\r\n[color=red][b]ATTENZIONE![/b]\r\nQuesta è solo la traduzione italiana del mod originale che trovate [url=http://skyrim.nexusmods.com/downloads/file.php?id=12139]qui[/url].[/color][/center]\r\n\r\n[center][color=GREEN][size=+4]UNA TRADUZIONE DRAGONBORN ITALIA[/size][/color][/center]\r\n\r\n[color=green][b]DESCRIZIONE[/b][/color]\r\nDato che siete il Dovahkiin, trovo abbastanza ingiusto il fatto di non poter spaccare i culi dei nemici con i nostri urli che, diciamocelo, non sono poi questa gran potenza in combattimento.\r\n\r\nQuesta mod migliora il gameplay degli urli su diversi fronti:\r\n\r\n-Rende gli urli che infliggono danno (come Soffio di Fuoco o Soffio di Gelo) fino a 6 volte più potenti, la prima Parola è almeno 2x più forte, la seconda 3.5 e la terza oscilla da 5x a 6x.\r\n\r\n-Riduce il tempo di rigenerazione degli urli dal 20 al 50%, a seconda dell\\'urlo.\r\n\r\n-Aggiunge qualche danno fisico a Forza Inesorabile.\r\n\r\n[center][color=GREEN]il Mistico Faggio[/color][/center]\r\n\r\n[color=green][b]INSTALLAZIONE[/b][/color]\r\nL\\'installazione di questa mod non necessita del file originale, ma vi invito comunque a dare un\\'occhiata alle varianti che non ho tradotto, in caso ne trovaste una che \\\"fa più al caso vostro\\\".\r\nPotete accedere alla pagina dell\\'autore della mod originale semplicemente cliccando sul link in alto.\r\n\r\n[color=green][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!\r\n",
  "categoryId": "24",
  "version": "1.21",
  "author": "MisticoFaggio",
  "createdUnix": "1331854891",
  "updatedUnix": "1331854891",
  "containsAdultContent": false,
  "uploadedBy": "MisticoFaggio",
  "primaryFile": null,
  "files": []
}