{
  "modId": 13027.0,
  "modName": "Gatherers Paradise",
  "summary": "Gatherers Paradise ist ein großes Playerhome mit vielen Funktionen. Natürlich sind alle bekannten Annehmlichkeiten wie Craftingplätze, Bett, Waffenständer, Bücherregale, Mannequins (es können drei verschiedene Posen eingestellt werden), usw. vorhanden. Es kann in allen Behältern unbedenklich Items gelagert werden und das Gatherers Paradise ist komp",
  "descriptionHtml": "Das Gatherers Paradise besteht aus insgesamt drei Etagen.\r\nIm Erdgeschoss befinden sich:\r\n- Der Thronsaal\r\nIm Thronsaal wird für jede Stadt in der der Spieler Thane ist die enstsprechende Flagge wehen. Außerdem gibt es Flaggen für jede Fraktion der man sich anschließt(Dunkle Bruderschaft etc.).\r\n\r\n- Die Küche/Bar\r\nHier befinden sich zwei Regale in denen Tränke gelagert werden können(wie die Bücherregale), eine Kochstelle und eine Feuerstelle an der aus Skeeverschwänzen verkohlte Skeeverfelle hergestellt werden können.\r\n\r\n- Ein Verzauberkunst- und Alchemielabor\r\nIm Labor steht ein Verzauberkunsttisch und ein Alchemielabor, Bücherregale, ein Trankregal, ein Regal für Schriftrollen und ein Drogenlabor an dem Skooma hergestellt werden kann. Des Weiteren können hier auf Podesten die \\\"Insekten im Glas\\\" ausgestellt werden.\r\n\r\n- Eine Brauerei\r\nin der Brauerei kann aus Honigwaben Honig gepresst werden, aus dem Honig kann dann wiederum Met hergestellt werden. Es gibt drei verschiedene Metsorten die gebraut werden können. Für zwei dieser Sorten muss allerdings erst das entsprechende Rezept gefunden werden.\r\n\r\n- Die Farm\r\nHier können viele verschiedene Pflanzen angebaut werden. Außerdem können im Hühnerstall Hühner ausgebrütet werden.\r\n\r\nIm ersten Stock:\r\n- Die Bibliothek\r\nIn der Bibliothek befinden sich 24 funktionstüchtige Bücherregale, zwei Regale für Schriftrollen, 6 Podeste um jeweils ein Buch auszustellen und ein Sockel um die Schriftrolle der Alten auszustellen.\r\n\r\n- Eine kleine Kapelle\r\nHier befindet sich ein Altar der einem der einem der 9 Götter geweiht werden kann. Wenn der Altar einem Gott geweiht wird erscheint der entsprechende Schrein auf dem Altar an dem man sich den passenden Segen abholen kann. Des Weiteren befindet sich leicht versteckt noch eine kleine Gruft in der Kapelle.\r\n\r\n- Das Schlafzimmer\r\nWie der Name schon vermuten lässt ist hier ein Bett zu finden, einige Schränke und zwei Mannequins.\r\n\r\n- Das Badezimmer\r\nIm Badezimmer ist ein Pool in den man sich gemütlich hineinsetzen kann. Zum Pool gehören zwei Wasserfontainen die an oder aus gestellt werden können. Außerdem ist im Badezimmer noch eine funktionierende Dusche bei der das Wasser an und aus gestellt werden kann.\r\n\r\n- Die Schatzkammer\r\nHier gibt es viele Ausstellungsmöglichekeiten wie z.B. einen Brunnen an dem Dibellastatuen ausgestellt werden können, ein Tisch um die Drachenklauen auszustellen, Sockel für die beiden Augen der Falmer, Drachenpriester-Altar für die Masken (+Holzmaske), eine Wand an der die Halsketten der Götter ausgestellt werden können, funktionale Behälter für Ringe und Edelsteine, einen Altar für Barenziahs Krone und die Steine, Waffendisplays und viele Mannequins.\r\n\r\nDer Keller:\r\n- Lagerraum\r\nIm Lagerraum gibt es viele Regale und Kisten um Items zu lagern.\r\n\r\n- Die Rüstkammer\r\nHier befinden sich viele Waffenständer, Mannequins, Waffendisplays (auch für Dolche), Kisten und ein geheimer Raum für die Daedraartefakte.\r\n\r\n- Die Werkstatt\r\nIn der Werkstatt befinden sich eine Schmiede, ein Amboss, eine Schmelze, eine Werkbank, eine Gerbegestell, ein Hackklotz und ein Schleifstein. Außerdem sind hier noch eine Silberschmiede an der Silbergegenstände hergestellt werden können und Regale für Metallbarren (funktionieren wie Bücherregale) zu finden.\r\n\r\n\r\nIch habe noch einige Ideen die ich gerne umsetzten würde aber noch nicht genau weiß wie ich diese realisieren kann (z.B.Einzug des Partners). Daher werde ich die momentan vorhandenen Funktionen erstmal so belassen und keine neuen hinzufügen. Das wird dann in der nächsten Version kommen. ",
  "categoryId": "67",
  "version": "1.0",
  "author": "Convector05",
  "createdUnix": "1331923949",
  "updatedUnix": "1331924591",
  "containsAdultContent": false,
  "uploadedBy": "Convector05",
  "primaryFile": null,
  "files": [
    {
      "fileId": "43896",
      "name": "Gatherers Paradise",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "186",
      "fileName": "Gatherers Paradise-13027-1-0.rar",
      "uploadedUnix": "1331924591",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4254262bbc92f18e0ae9644bee5915c5eb80189d5dd588c81b43bc1d051565c3/analysis/1406751874/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gatherers%20Paradise-13027-1-0.rar?fid=43896&ttl=1535775440&ri=8192&rs=8192&setec=aaaac68dfc23925fec5d70a856dafcb3"
    }
  ]
}