{
  "modId": 13044.0,
  "modName": "Twin Assassin Companions Summer and Autumn",
  "summary": "Twin Imperial Assassins ",
  "descriptionHtml": "This mod introduces twin sister Imperial assassins Summer and Autumn. They are essential followers, they can be married, and they have different voice types so you can tell them apart should you use a multiple companion mod. Both of these ladies will dual wield by default while using archery for ranged combat, and when left idle near each other they will sometimes engage in brief conversation with each other. You can find them in their rented room at Dead Man\\'s Drink in Falkreath.\r\n\r\nLike all of my other companion mods; Summer and Autumn will loiter around in the area that you dismiss them once you tell them you want to part ways (drop them as a companion). So if you can\\'t find them after you ask them to leave your service make sure to go back to where you left them. I set their AI up this way so that you can leave them in a convenient place and they won\\'t wonder off (you can also have them stay behind in one of your houses until you want them to tag along with you again). Remember that ALL of my companion mods have this feature.\r\n\r\nIMPORTANT NOTE: This mod must have the following mod in order to work correctly:\r\n:::Apachii Sky Hair:::\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10168\r\nIf you have issues with hair colors turning dark when near light sources; download teh vanilla hair option on Apachii\\'s page and that should fix the issue.\r\n\r\nManual Installation:\r\nPlace the zip file\\'s contents into your Skyrim/data folder to install and be sure to activate the ESP and ESM files in your Data Files listing. Ensure that the Apachii Sky Hair ESP and ESM are ABOVE Summer and Autumn\\'s data files in your load order (I\\'d recommend placing their files dead last in the load order so there are no conflicts).\r\n\r\nRecommended (but not required) mods to get them as they appears in the screen shots:\r\n\r\nCBBE V3 (standard body) and the hip texture compatability pack:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2666\r\n\r\nBella\\'s Better Females version 3:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2812\r\n\r\nCover Eyes (eyes 1 file):\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4869\r\n\r\nKiller Keos Skimpy CBBE V2 Armor Set:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3654\r\n\r\nSpecial thanks to Blackie for his CM New Companions mod that includes a top-notch detailed tutorial on how to create Skyrim companions without the face discoloration bug. Get his mod and tutorial (contained in the mod) here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11669\r\n\r\nThe work around I found for the bug with Bella\\'s face mod (the bug involving women looking like they have faint beard stubble on their jawline and chin) is to use the standard Better Faces Version 3, and then apply the \\\"No Shine\\\" option available on her mod page.\r\n\r\nSpecial note: All of my future companions after Divada, Taja, Viin, and Kyia will be made using the Better Females by Bella mod. I switched to another mod set for faces previously due to a bug I couldn\\'t resolve (the issue with females having faint male beard stubble on their faces while using Bella\\'s). I have resolved that issue, so I\\'ll be going back to Bella\\'s for my projects from now on. You DO NOT have to switch to Bella\\'s if you use Envision faces and RANs Headmesh (what I used previously) OR if you use other face mods. All of my companions should work with other face/body mods and vanilla setups unless specifically mentioned in the description.\r\n\r\nThanks for looking at my work, and I hope you enjoy taking Summer and Autumn with you on your adventures. Feedback is welcomed and remember to endorse it if you like it.\r\n\r\nI recommend a manual install of this mod (read me included in the zip file). Install with Nexus Mod Manager at your own risk.",
  "categoryId": "66",
  "version": "1",
  "author": "Grimraven1",
  "createdUnix": "1331937697",
  "updatedUnix": "1331937774",
  "containsAdultContent": false,
  "uploadedBy": "Grimraven1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "43936",
      "name": "Summer and Autumn",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1031",
      "fileName": "Summer and Autumn-13044-1.rar",
      "uploadedUnix": "1331937774",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/3eadb3b69d2f5989881104b05b84853be22894bff4965eb7ee7e47e83df171d2/analysis/1406752031/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summer%20and%20Autumn-13044-1.rar?fid=43936&ttl=1535775470&ri=8192&rs=8192&setec=c9324bd7ac78116104e14b201e5f7b68"
    }
  ]
}