{
  "modId": 13053.0,
  "modName": "Recharge Magicka and Restore Stamina",
  "summary": "Adds four new spells with associated tomes added to leveled lists. Also adds 2 new staves, one for each concentration spell, also added to leveled lists!",
  "descriptionHtml": "This mod adds four new spells; Recharge Magicka, Restore Stamina, Fast Magicka Charge, and Cure Fatigue.\r\n\r\nNEW SPELLS:\r\n+- Recharge Magicka: Apprentice Alteration: Binds latent magicka from thin air. Restores 15 magicka per second.\r\n++- Comes in Staff Form, Staff of Magicka Recharging: Restores 25 magicka per second. Has a charge of 3000 and costs 25 charge per second, literally converting magicka from the staff.\r\n+- Fast Magicka Charge: Adept Alteration: Binds latent magicka from thin air. Restores 60 magicka.\r\n\r\n+- Restore Stamina: Novice Restoration: Focus your energy and cure fatigue. Restores 15 \r\nstamina per second. Costs 25 Magicka per second.\r\n++- Comes in Staff Form, Staff of Vitality: Restores 25 stamina per second. Has a charge of 2000 and costs 25 charge per second.\r\n+- Cure Fatigue: Apprentice Restoration: Focus your energy and cure fatigue. Restores 75 \r\nstamina. Costs 80 Magicka.\r\n\r\nAll these items can be found in loot, chests, or at the appropriate vendors like normal.\r\nAlso the items have been placed in a chest on the top roof tier of the College of Winterhold!(accessible only if you have completed the college quests or use console codes)\r\n\r\nThanks go to:\r\nBethesda for making this awesome game!\r\nThe Nexus",
  "categoryId": "75",
  "version": "1",
  "author": "crazyjoe2k",
  "createdUnix": "1331946522",
  "updatedUnix": "1331946641",
  "containsAdultContent": false,
  "uploadedBy": "crazyjoe2k",
  "primaryFile": null,
  "files": [
    {
      "fileId": "43968",
      "name": "Recharge Magicka and Restore Stamina",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Recharge Magicka and Restore Stamina-13053-1.zip",
      "uploadedUnix": "1331946641",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/6fdec73664e42e161051a0f88cb3505a455a64f573c5239e485f8b2b21331616/analysis/1406752263/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Recharge%20Magicka%20and%20Restore%20Stamina-13053-1.zip?fid=43968&ttl=1535775487&ri=8192&rs=8192&setec=9ab01d91c8d8a3545c904ba415bd9264"
    }
  ]
}