{
  "modId": 13111.0,
  "modName": "Dremora Vampire Companion Tyth",
  "summary": "Female Dremora Vampire Companion Tyth",
  "descriptionHtml": "Tyth is a Dremora Vampire (created due to a Dremora request and curiousity to see if I could create a hybrid race companion). She has some vampire abilities (life drain, etc.) along with racial attributes of a Dremora. Please note that because of this she can ONLY WEAR HEAVY ARMOR. If you equip light armor on her it will not show up and she will remain NAKED and you will get a glimpse of SMURF BUTT until you give her something heavy to wear. She is set up to dual wield (weapons and spells), but note that she will often prefer to use one weapon and one spell (off hand) until her mana is depleted or low. You can find her bathing near the entrance of Bronze Water Cave (location posted in a screen shot above).  The cave entrance is slightly Northwest of Anga\\'s Mill (just remember that she isn\\'t inside of the cave...she\\'s in the water close to the cave entrance).\r\n\r\nManual Installation:\r\nPlace the zip file\\'s contents into your Skyrim/data folder to install and be sure to activate the ESP and ESM files in your Data Files listing.\r\n\r\nShe should also work with a vanilla install of Skyrim, but she will not look like she does in the screen shots. To get her appearance as initially created, you will need the following mods:\r\n\r\nCBBE V3 (standard body) and the hip texture compatability pack:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2666\r\n\r\nBella\\'s Better Females version 3:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2812\r\n\r\nCover Eyes (eyes 1 file):\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4869\r\n\r\nKiller Keos Skimpy CBBE V2 Armor Set:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3654\r\n\r\nSpecial thanks to Blackie for his CM New Companions mod that includes a top-notch detailed tutorial on how to create Skyrim companions without the face discoloration bug. Get his mod and tutorial (contained in the mod) here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11669\r\n\r\nThe work around I found for the bug with Bella\\'s face mod (the bug involving women looking like they have faint beard stubble on their jawline and chin) is to use the standard Better Faces Version 3, and then apply the \\\"No Shine\\\" option available on her mod page.\r\n\r\nSpecial note: All of my future companions after Divada, Taja, Viin, and Kyia will be made using the Better Females by Bella mod. I switched to another mod set for faces previously due to a bug I couldn\\'t resolve (the issue with females having faint male beard stubble on their faces while using Bella\\'s). I have resolved that issue, so I\\'ll be going back to Bella\\'s for my projects from now on. You DO NOT have to switch to Bella\\'s if you use Envision faces and RANs Headmesh (what I used previously) OR if you use other face mods. All of my companions should work with other face/body mods and vanilla setups unless specifically mentioned in the description.\r\n\r\nThanks for looking at my work, and I hope you enjoy taking Tyth with you on your adventures.\r\n\r\nI recommend a manual install of this mod (read me included in the zip file). Install with Nexus Mod Manager at your own risk.",
  "categoryId": "66",
  "version": "1",
  "author": "G",
  "createdUnix": "1332014298",
  "updatedUnix": "1332014354",
  "containsAdultContent": false,
  "uploadedBy": "Grimraven1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44221",
      "name": "Dremora Vampire Tyth",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "147",
      "fileName": "Dremora Vampire Tyth-13111-1.rar",
      "uploadedUnix": "1332014354",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/273877a08f3b6ee6e3328d720ee1f37f8d32f651a938596cdc403165d8e90064/analysis/1406753464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dremora%20Vampire%20Tyth-13111-1.rar?fid=44221&ttl=1535775582&ri=8192&rs=8192&setec=6dd1eee2a1e76956a12e42e222c89fbb"
    }
  ]
}