{
  "modId": 13113.0,
  "modName": "TES5 CK Shortcuts - including Control Tab",
  "summary": "Adds control tab functionality (actually ALT TAB, but using Ctrl-Tab shortcut) in the Skyrim construction kit, via an Autohotkey script. Also adds many shortcuts and the ability to focus back to the previous active window when you close a window.",
  "descriptionHtml": "The analogous mod for the Oblivion CS : tes.nexusmods.com/downloads/file.php?id=25031\r\nForum thread : http://forums.bethsoft.com/topic/1359587-relzbeta-ck-hotkeys-including-control-tab-for-ck/\r\n\r\nName: TES5 CK Shortcuts (including Control Tab)\r\nVersion: 0.95b (beta)\r\nDate: 2011/3/17\r\nCategory: Modding Tools\r\nRequirements: tested with CK 1.4.23 on WIN7 PRO\r\nAuthor : utumno aka Udun\r\nHomepage: http://udunslabs.blogspot.com/\r\nDownload: http://skyrim.nexusmods.com/downloads/file.php?id=13113\r\n\r\n\r\nDescription\r\n===========\r\n\r\nThis release includes one executable, CK_Hotkeys_v0.95b.exe which adds :\r\n    * control tab functionality (actually ALT TAB, but using Ctrl-Tab shortcut) in the Skyrim Construction Kit, using the always handy Autohotkey language.\r\n    * Customizable (via ini file) shortcuts (hotkeys) for various actions (see below).\r\n    * An ini file created in the directory the script is run, CK_Hotkeys.ini.\r\n    * A focus back to previous window feature. By default enabled for all windows. If you find you have problems with some windows loosing focus (namely the NPC window) set OnlyForReferences to 1 in the ini.\r\n\r\n\r\nInstall\r\n=======\r\n\r\nDownload, unzip, save CK_Hotkeys_v0.95b.exe wherever in your drive. Run the exe, open up the CK, switch to it and let the script initialize (takes a couple secs). (If the CK is not running, as long as you leave the default ini settings, the script will wait for the CK).\r\nOne small green icon with an H on it will appear on system tray when you run the exe. By right clicking on it you can exit, pause the script or suspend the hotkeys. The exe will create an ini file in the directory it is run, where you can customize a couple of options.\r\n\r\n\r\nFeatures\r\n========\r\n\r\nCK_Hotkeys_v0.95b.exe :\r\n    * press and hold Ctrl then press Tab to cycle in an Alt Tab way through the CK windows that are open (Render, Cell, Object, References, etc). Shift reverses order. It works like the Alt Tab shortcut in Windows Explorer. Clicking on a window adds it to the stack (even if the script failed to auto-add it).\r\n    * Adds shortcuts, see the ini file section bellow.\r\n    In particular pressing Alt+m toggles the maximize/restore state of the window while Alt+n minimizes it out of your way (to actually minimize it out of your way press Alt+Shift+n). Alt+m is meant to be used with the object, cell, render, script and script\\\\open windows (and a couple of others maybe) which although not having maximize\\\\restore\\\\minimize button they can be maximized and minimized. With other windows, like \\\"Reference\\\", will give a funky result :)\r\n    Also, pressing Cntrl+Shift+r reloads the script. When cpu load is very high this may prove necessary.\r\n\r\n\r\nCK_Hotkeys.ini\r\n==============\r\n\r\n^ stands for Control, + for Shift and ! for Alt.\r\n~ is not part of the hotkeys but a symbol that tells Autohotkey that when the hotkey fires, its key\\'s native function will not be blocked (so wherever you see, for instance, the ~Enter combo, pressing Enter (and NOT the tilde) will fire the hotkey and also send an Enter keystroke). Best to leave it there when I have it.\r\nFor more keys and rules see http://www.autohotkey.com/docs/Hotkeys.htm#Intro.\r\nWhen the CK_Hotkeys_v0.95b.exe script is first run the (default) CK_Hotkeys.ini will be created - and then left alone. If you want to change a shortcut just open the ini and edit the shortcut you want. For instance, replace the line :\r\n\r\nReloadScript=^+r\r\n\r\nwith :\r\n\r\nReloadScript=^!j\r\n\r\nif you want Control+Alt+j to reload the script instead of the default Control+Shift+r. If you want to disable a particular shortcut delete the part after the = sign. For instance :\r\n\r\nReloadScript=\r\n\r\ndisables the Reload Script shortcut.\r\n\r\nFor changes to take effect rerun the exe.\r\nIf you want to revert to the default hotkeys just delete CK_Hotkeys.ini and reload (run) the CK_Hotkeys_v0.95b.exe. A brand new (default) CK_Hotkeys.ini will be created.\r\nThe specific window classes\\' hotkeys take precedence over the global ones (see comments in [GlobalHotkeys] section).\r\nThe ini file I give below is \\\"commented\\\". Do not attempt to comment the actual ini as I don\\'t believe it\\'s possible.\r\n\r\n<CK_Hotkeys.ini>\r\n\r\n   [Settings]\r\n   Exit_on_CS_exit=0         ; if set to 1 the script will exit on CS\\'s exit and not start at all if the CS is not running\r\n   Enable_Shortcuts=1        ; set to 0 to disable all shortcuts (except Control-Tab)\r\n   Show_initialize_tooltip=1 ; set to 0 to disable the tooltip shown on initialization\r\n   EnableRefocus=1           ; set to 0 to disable focusing back on the previous window when closing a window\r\n   OnlyForReferences=0       ; set to 1 to disable ReFocus on all windows except \\\"References\\\" windows\r\n   EvenMoreWins=1            ; set to 0 to disable ReFocus on some windows like find and replace, Quests etc ; if OnlyForReferences==1 this has no effect\r\n\r\n   [GlobalHotkeys]\r\n   ; these will run if any CK window is active (has focus). If a shortcut here conflicts with one in another section however, the other one will take precedence.\r\n   ; for instance ^s won\\'t save the active plugin when a Script Edit window is active - it will save the current script instead (see [ScriptHotkeys] section below)\r\n   ReloadScript=^+r     ; reloads the script (CK_Hotkeys)\r\n   Maximize/Restore=!m  ; meant to be used with the object, cell, render, script and script\\\\open windows (and a couple others maybe)\r\n   Minimize=!n\r\n   ForceMin=!+n         ; minimizes active window and puts it to the bottom of the stack of windows - so when hitting CntrlTab once it won\\'t pop up\r\n                        ; you need to press ^+Tab to see it - found this very useful\r\n   Dialogue=^+d         ; brings up the Dialogue window\r\n   OpenWindows=^+o      ; brings up the Open Windows window\r\n   Preview=^+p          ; brings up the Preview window\r\n   FindRepl=^h          ; brings up the Find and Replace window\r\n   Save=^s              ; brings up the Save window\r\n   Data=^o              ; brings up the Data window\r\n   Preferences=^p       ; brings up the Preferences window\r\n   FindText=^t          ; brings up the Find Text window\r\n   Quests=^+q           ; focuses on the Object window in the Quests list\r\n   Factions=^+f         ; focuses on the Object window in the Factions list\r\n   Packages=^+k         ; focuses on the Object window in the Packages list\r\n   PapyrusManager=^+s   ; brings up the Papyrus Manager window\r\n\r\n   [PapyrusHotkeys]\r\n   ; these hotkeys run when the Papyrus Manager window is active\r\n   DoubleClickPapysusOpenSCR=~Enter  ; press Enter to open the currently highlighted script in the list\r\n   ClosePapyrus=~Esc                 ; DO NOT PRESS THE ~ !!! Just press Esc to exit the Papyrus Manager\r\n   TabPapyrus=Tab                    ; press Tab to jump from control to control in the cell win\r\n\r\n   [Warnings]\r\n   ; these are for \\\"Warnings\\\" windows\r\n   MassOK=delete     ; press delete and the script will keep pressing Yes to chunks of warnings. Works even for thousands of them. The CK may loose focus - it is a CK bug\r\n                     ; Give it time to finish, do not alt tab to another window till it does\r\n   wait=10           ; time in ms to wait before pressing Yes again. Minimum -1 (fastest). Do not set it very high (-1 to 100 is fine)\r\n\r\n   [PrefHotkeys]\r\n   ; this hotkey runs when the Preferences window is active. Takes precedence over the GlobalHotkeys\r\n   PrefConfirm=~Enter    ; press Enter to confirm changes and close pref window (doh)\r\n\r\n   [DataHotkeys]\r\n   ; these hotkeys run when the Data window is active.\r\n   DATact=^Space     ; set (unset if set) as active plugin (the list of plugins must have focus)\r\n   DATcheck=Space    ; check (uncheck) plugin (the list of plugins must have focus) ; thanks to HotKeyIt\r\n\r\n   [Cell]\r\n   ; pressing Enter when keyboard focus is on cell X, in the list of cells (left list in Cell window), loads X\r\n   ; while pressing Enter when focus is on an object in the *X_cell* Objects list (right list in Cell window) focuses on the object in Render win. ; thanks to HotKeyIt\r\n   DoubleClickC=~Enter\r\n   TabC=Tab   ; press Tab to jump from control to control in the cell win\r\n\r\n   [Object]\r\n   ; pressing Enter when keyboard focus (the blue background) is on object X displays the properties of object X\r\n   DoubleClickO=~Enter\r\n   TabO=Tab   ; press Tab to jump from control to control in the object win\r\n\r\n   [Render/CK]\r\n   ; when focus on CK itself or on the Render window\r\n   Havoc=o          ; toggle havoc\r\n\r\n   [PrevHotkeys]\r\n   ClosePrev=~Esc   ; press Esc to close the Preview win\r\n\r\n   [NPCHotkeys]\r\n   NPCok=~Enter     ; press Enter on the active Actor win hits the OK button\r\n   NPCcancel=~Esc   ; press Esc to close the active Actor win\r\n\r\n</CK_Hotkeys.ini>\r\n\r\n\r\nLimitations\r\n===========\r\n\r\nWhen clicking too fast on an object in the object window the window that pops up fails to get detected by my script. By too fast I mean so fast that actually the object window is given focus again instantly, so the object\\'s properties loose focus (and that\\'s not the reason for having been clicked in the first place :). Either double click on the object again (not so fast) or left click on the object\\'s window properties if visible. It will be detected. Now this is what makes it a beta. I need help with windows event programming to save these scripts from betaness !\r\nNB : THOSE SCRIPTS ARE NOT MEANT TO BE USED WITH MULTIPLE CSs ACTIVE.\r\n\r\n\r\nKnown Bugs\r\n==========\r\n\r\nThe ^o shortcut for opening the data window sometimes does not work (window does not appear). Workaround : hit the shortcut (^o) again. A blank data window should appear. Hit Esc and the normal data window should appear.\r\nFocus back works too much sometimes - restrict it via ini if causing problems.\r\nSometimes (on some keyboards ?) some shortcuts do not fire (I had this issue with ^n in script wins). Workaround : reload the script (^+r by default).\r\nA rare bug is that, sometimes, when hitting a hotkey, the perspective in the Render window changes. I have not figured out when exactly this happens - please give me feedback on this one.\r\n\r\n\r\nTo Do\r\n=====\r\n\r\nCorrect limitation and bugs above. Add tab shortcut functionality for more wins. Make the scripts event based.\r\n\r\n\r\nFeedback needed\r\n===============\r\n\r\nThe script relies on sleep times tested on my machine which is rather clean, cpu not under big load etc. Should work fine anyway but I need some feedback on that. And feedback on the workings of the CK from people who are into WinAPI programming would be great. The CK is full of surprises :)\r\n\r\n\r\nChangelog\r\n=========\r\n\r\n0.95b, 2010/5/9 - CK_Hotkeys_v0.95b.exe : Initial release.\r\n\r\n\r\nContact\r\n=======\r\n\r\nMy blog : http://udunslabs.blogspot.com/. Visit for some more info on the project and to post comments. Remember I need feedback ! Also active in the beth forums (utumno).\r\n\r\n\r\nCredits\r\n=======\r\n\r\nThanks to Bethesda for creating Skyrim and the CK we love to patch.\r\nThanks to TESNexus.com/PlanetElderScrolls for the a one-stop-shop resource for authors and players.\r\nThanks to LHammonds for the Readme Generator this file was based on.\r\nThanks to the great Autohotkey community that provided me with tons of useful functions/answers/remarks. In particular I would like to thank HotKeyIt who made half of the functions I use :D Thumbs up guys :)\r\nThanks to all that provided me with feedback in the beth forums !\r\n\r\n\r\nLicensing/Legal\r\n===============\r\n\r\nDonationware (I have still to add a button - but you can still click on the ads at my blog). Ah, yes, I tested thoroughly and anyway it\\'s a harmless script but still backup and blah blah - enable autosave in the CK btw.\r\n",
  "categoryId": "39",
  "version": "0.95b",
  "author": "Utumno aka Udun",
  "createdUnix": "1332016088",
  "updatedUnix": "1332102737",
  "containsAdultContent": false,
  "uploadedBy": "utumno",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44570",
      "name": "CK_Hotkeys_v0_95b_7z",
      "version": "0.95b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "217",
      "fileName": "CK_Hotkeys_v0_95b_7z-13113-0-95b.7z",
      "uploadedUnix": "1332102737",
      "modVersion": "0.95b",
      "virusScanUrl": "https://www.virustotal.com/file/a1aa1324be086dfd8311692d381fe43ad15d1569b366772853e7e3f9002c23dd/analysis/1406766791/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CK_Hotkeys_v0_95b_7z-13113-0-95b.7z?fid=44570&ttl=1535775584&ri=8192&rs=8192&setec=17f295a74211238eeb05f6e93fcc8eb5"
    }
  ]
}