{
  "modId": 13120.0,
  "modName": "Unloveds Follower customization make any NPC a follower spou",
  "summary": "A collection of batches that allows you to make any NPC a follower, marriable, become a mage, where light or heavy armor efficently and more. the point of this mod is to still maintain the feel of a normal follower without you making them overpowered with the setav command. AN example of the usefulness of this mod being if you have a massive boner ",
  "descriptionHtml": "Not so much a mod but just some .txt files that are shortcuts for console commands that let you customize npcs. \r\n\r\nHOW TO USE\r\n1.Open console using the ~ key next to the 1, and below escape.\r\n2.select the ncp you wish to make changes to by clicking on them, or using the \\\"prid xxxxxxxx\\\" command x = reference ID\r\n3.type \\\"bat follower\\\" they should now have the basic follower dialouge. note that this does not work on some npcs that have there own custom voice.\r\n4.If you wish to make them your spouse, type \\\"bat spouse\\\" nothing will show up if you havent talked to maramal in riften about marriage, or if you are not wearing an amulet of mara.\r\n5.Now if you just made some bum off the streets of whiterun your follower, chances are he will get his ass pwnd in battle thats where classes come in. lets say you want to make that bum have stats similar to an assassin like light armor, archery and one handed. type \\\"bat assassinarcher\\\" for an offensive assassin, or if you prefer a defensive one, type \\\"bat assassinlightarmor\\\"\r\n6.For other classes just type \\\"bat\\\" in console along with the name of the .txt file you downloaded.\r\n\r\nAnother note when you change the class of an npc their stats will be scaled to your level.\r\n\r\nINSTALLATION\r\n1.open the .zip file into your skyrim directory\r\n2.play\r\n\r\nCLASS BATCHES THAT HAVE BEEN ADDED\r\nbat assassinlightarmor (defensive assassin)\r\nbat assassinarcher (offensive assassin)\r\nbat battlemage (gives them basic spells)\r\nbat mage (gives more spells than battlemage, not good with armor)\r\nbat nightblade (like battlemage but a thief archtype rather than a warrior, specializes in lightarmor, alteration, and illusion)\r\nbat ranger (specializes in archey, block, onehanded, and light armor)\r\nbat rouge (specializes in onehanded, sneak, and lightarmor but very much)\r\nbat scout (specializes in sneak, archery, lightarmor and restoration)\r\nbat spellsword (same as battlemage just an alternative command)\r\nbat thieflockpick (specializes in lockpicking, sneak, and slightly in lightarmor, archery, and onehanded\r\nbat thiefarcher (specializes in archery, sneak, and lightarmor\r\nbat thiefsneak (specializes in sneak, lightarmor, and slightly in onehanded, and archery\r\nbat warrior1h (specializes in Heavyarmor, onehanded, and block\r\nbat warrior2h (specializes in heavyarmor, and twohanded)\r\n\r\nKNOWN ISSUES\r\nthere may be some stuff screwed up with the mage related files as npcs like warriors dont know any spells by default, and the mage batches give them spells.",
  "categoryId": "66",
  "version": "1.0",
  "author": "UnlovedChildren",
  "createdUnix": "1332020629",
  "updatedUnix": "1332020782",
  "containsAdultContent": false,
  "uploadedBy": "UnlovedChildren",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44248",
      "name": "CustomFollowers",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "CustomFollowers-13120-1-0.zip",
      "uploadedUnix": "1332020782",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/85884cfd84b79258d7252866fa7ad5b5511592998510b1ae2cf7c1c22822de43/analysis/1406764872/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CustomFollowers-13120-1-0.zip?fid=44248&ttl=1535775599&ri=8192&rs=8192&setec=6dde5893a8b1b1bf1998893ecfb54fa3"
    }
  ]
}