{
  "modId": 13128.0,
  "modName": "Wheezes Dungeon Pack 1",
  "summary": "Adds 4 radiant story enabled dungeons to skyrim. Entire development process streamed on my channel: www.twitch.tv/wheeze202",
  "descriptionHtml": "[B]\r\n[size=5]\r\nI stream all of my work on my twitch channel: www.twitch.tv/wheeze202\r\n\r\nI\\'m also leading a big project now, if you want to be a part of it please visit www.luftahraan.com\r\n[/size][/b]\r\n\r\nThis is a dungeon pack made by me.\r\nThere are 4 dungeons all in all that I have put alot of work and passion into. They are all radiant story enabled meaning the game will occasionally generate quests which have their objectives set in these dungeons. This way you can download the mod and, in it\\'s own little way, it will improve the skyrim experience just by that much :)\r\n\r\nPOSSIBLE CONFLICTING MODS:\r\nSounds of Skyrim - Dungeons (skyrimnexus version)\r\nThe Den of Vuspyre\r\nThe Alyed Mysteries\r\n\r\n\r\nIf you want video footage then this is what I recommend:\r\n http://www.youtube.com/watch?v=dYqK_gvIn_0\r\nhttp://www.youtube.com/watch?v=msocM10B-Dc&hd=1 (my video)\r\n\r\n--Dungeons are as following:\r\n\r\nBeldhar Gap:\r\nA cave between Falkreath and Helgen. This cave has barely been touched by humanoids for hundreds of years and has overgrown due to the amount of sunlight being let in. Who knows what this cave might uncover.\r\nBrodual spotlight: http://www.youtube.com/watch?v=1DVnDnrcLlA\r\n\r\nNecrothius Cavern:\r\nA icy underground necromancer hideout. A group of necromancers have been hiding in this cave for a couple of years. The lack of necromancers in skyrim truly begs the question: what in the nine divines could they be doing down there ?\r\nBrodual spotlight: http://www.youtube.com/watch?v=tbvgaOuIz6w\r\n\r\nStormgrad Heights:\r\nA large tomb for ancient nord heroes. The final resting place for 3 Great nord heroes and the soldiers who followed them.\r\nBrodual spotlight: http://www.youtube.com/watch?v=K2Tp6QSBhJU\r\n\r\nGleamstone Trove:\r\nAn abandoned moonstone mine that has been occupied by a group of bandits. They use the scaffolding pre-made and the sheer depth of the mine to keep a good defense.\r\nBrodual Spotlight: http://www.youtube.com/watch?v=RgN4nJ_uOVk\r\n\r\n\r\n\r\n\r\n--Update Log:\r\nv1.4\r\nI found out that I accidentally edited scripts that effected some spellcasters and various water objects. I have undone these modifications. This MIGHT be the problem to all the crashing.\r\nPlease report in the comment section if you are still having these troubles.\r\nv1.3\r\nRemoved a door located in riverwood that I used as a placeholder exit for stormgrad heights.\r\nv1.2\r\nSome chests had an incorrect rotation\r\nA trap was already set off when the player enters the dungeon. Now fixed.\r\nNecromancers in Necrothius Cavern now don\\'t burn to death with the fire damage from the campfires.\r\nv1.1\r\nFixed the easter egg message. People were thinking they found the 60$ easter egg.\r\nv1.0\r\nFull public release\r\n\r\n\r\n\r\n\r\n--Final words:\r\nThis pack took exactly 1 month to create. I worked on it every day. And every single hour was streamed on my channel.\r\nI could not have done this without my twitch channel and my viewers. So please check us out and hopefully join this little community we have created :) (link below)\r\n\r\nWorkshop: http://steamcommunity.com/sharedfiles/filedetails/?id=16688\r\nWheeze\\'s Dungeon Workshop Collection: http://steamcommunity.com/sharedfiles/filedetails/?id=16698\r\nTwitch.tv channel: http://twitch.tv/wheeze202\r\n\r\n--CREDITS:\r\nWheeze\r\nTheBeardedFool - Beta tester\r\nMy twitch.tv viewers - I cannot thank them enough. And there are too many to remember and write down.\r\n\r\n\r\n\r\nEASTER EGG FOUND - It is in the picture where it says \\\"Wheeze\\'s Dungeon Pack #1\\\"\r\nIt\\'s in dragon language and says: You found the easter egg. Add wheeze on steam.",
  "categoryId": "88",
  "version": "1.4",
  "author": "Wheeze",
  "createdUnix": "1332033714",
  "updatedUnix": "1332109329",
  "containsAdultContent": false,
  "uploadedBy": "Mehrunes201",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44615",
      "name": "WDP 1-4",
      "version": "1.4",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "850",
      "fileName": "WDP 1-4-13128-1-4.rar",
      "uploadedUnix": "1332109329",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/37b929085f876dbf3bb2ec9b3445192fa85c12c6477bd9455fad4cda68689184/analysis/1406767105/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WDP%201-4-13128-1-4.rar?fid=44615&ttl=1535775609&ri=8192&rs=8192&setec=720400f99615d0c0acc7b375ddfbff61"
    }
  ]
}