{
  "modId": 13153.0,
  "modName": "Forest Refuge",
  "summary": "Scenic home with locks, Weapon Racks, Display Cases, Book Shelves, and Potion Racks.  4 levels and sleeps up to 5 companions. Potion racks and several table tops that work like bookshelves.",
  "descriptionHtml": "Quiet scenic location for this player home with mining on site.  2 levels above ground provide provide a small footprint that fits in nicely into the forest location.  2 levels below ground that provide all the storage and sleeping requirements for player and multiple followers as well as many display cases and weapon racks.  Several mannequins are provided for armor display as well.\r\nThere is alchemy and enchanting areas in the sub-basement and full smithing and smelting outside.\r\n\r\nShelves and table tops in many areas work like bookshelves to allow you to easily store and display potions, ingredients, and books all on the same shelf or table.\r\n\r\nCan sleep up to 5 followers.  Idle markers should allow followers to stay busy if you have a follower wander mod.  Idle markers are in all areas of the location inside and outside.  I use http://skyrim.nexusmods.com/downloads/file.php?id=9504\r\n\r\nKeys on porch on between doors.\r\n\r\nAll suggestions for enhancements will be considered.\r\n\r\nInstall\r\n=====\r\nBest to use NMM but normal mod procedures will work for install. (There is 1 script file and 1 esp)\r\n\r\nEnhancements\r\n============\r\nMore table tops to place inventory items and expand items that can be stored on tables and shelves\r\nMore mining available on location\r\nIndoor archery range and additional bedrooms to sleep up to 10 followers\r\nAdd shield and weapon rack to basement instead of just single weapon\r\n\r\nKnown bugs\r\n==========\r\nMining can be quirky, sleeping offsite seems to help.  If not attack ore with Pickaxe has worked.\r\n\r\nLocation\r\n=======\r\nNorthWest of Falkreath very near the Half-Moon Mill\r\n\r\nCOC Info\r\n========\r\nExterior location is forestrefugeexterior01\r\nInterior cell is aforestrefuge",
  "categoryId": "67",
  "version": "0.9",
  "author": "Merdynn",
  "createdUnix": "1332063100",
  "updatedUnix": "1333344966",
  "containsAdultContent": false,
  "uploadedBy": "merdynn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "49247",
      "name": "Forest Refuge",
      "version": "0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "245",
      "fileName": "Forest Refuge-13153-0-9.zip",
      "uploadedUnix": "1333344966",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/1fa17fa6697ee63ae911d553d76b49c321bd413c07dc82a237e16c9392dab3b5/analysis/1406792895/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forest%20Refuge-13153-0-9.zip?fid=49247&ttl=1535775692&ri=8192&rs=8192&setec=6e6b74c7abe65b0df1d833e29ba747b0"
    }
  ]
}