{
  "modId": 13150.0,
  "modName": "Viking Armour and Weapons Compilation",
  "summary": "Four types of low fantasy Viking style armour. Plus Viking Warrior Comp that adds weapons of various levels.",
  "descriptionHtml": "Viking Warrior Compilation.ESP released with new Viking weapons! \r\n\r\nThis must be used with The Chronicles of Steel Skyrim mod.\r\n\r\nThe aim of this mod is to allow the player to create more authentic/better looking (low fantasy) Viking characters and are not interested in taking advantage of all the heavy armour perks (you should be able to reach the cap through smithing anyway).\r\n\r\nThis mod is not complete and please let me know if there are any suggestions (including other mods that would improve the compilation), issues or amendements.\r\n\r\nIron smithing - Raider Helm (iron)\r\nSteel Smithing - Vikingr Brynja (body only), Vikingr Helm (Steel)\r\nAdvanced armours - Hauscarls Hauberk (misc), Hauscarls Helm (steel) and light Scale armour (misc)\r\nGlass Smithing required but in Msic catagory - Thanes Armour (Steel) and Thanes Helm (Steel)\r\nDragon smithing - Jarls Armour (Dragon)\r\n\r\nPlanned for later versions:\r\nApply mail texture to female Jarls Armour.\r\n\r\nI recommend using Cloaks of Skyrim mod and The Chronicles of Steel Skyrim weapons mod with this compilation as they go really well with the armour.\r\n\r\nStandalone Vendel Helmet from Hammerwing studios can be found here:\r\n\r\nhttp://skyrim.nexusmods.com/mods/15521\r\n\r\n\r\nPLEASE NOTE:\r\n\r\nViking Warrior Compilation.ESP requires all the files from the Viking Armour Comp and for The Chronicles of Steel Skyrim weapons mod to be downloaded and installed separately. It can be found here:\r\n\r\nhttp://skyrim.nexusmods.com/mods/12506\r\n\r\nIt includes changes to vanilla items and does replace their Meshes and textures so may conflict with mods that do the same:\r\n\r\nIron Axe – Meshes and Texture changed to old Bearded Axe form TCOSS.\r\nSteel Axe - Meshes and Texture changed to Worn Bearded Axe form TCOSS.\r\nSteel BattleAxe - Meshes and Texture changed to Worn 2 HD Bearded Axe form TCOSS.\r\nSteel sword - Meshes and Texture changed to GRAR for TCOSS.\r\nAncient Nord Sword - Meshes and Texture changed to WARP for TCOSS.\r\n\r\nArmour Meshes and Textures replaced:\r\n\r\nIron Armour - Meshes and Texture changed to the same as Vikingr mail.\r\nSteel Armour - Meshes and Texture changed to the same as Thanes mail.\r\n\r\nWeapons Added:\r\nHauscarls Sword – uses the Meshes and Texture of NORLAND sword for TCOSS.\r\nHauscarls Axe – uses Meshes and Texture of Bearded Axe form TCOSS.\r\nHauscarls BattleAxe – uses Meshes and Texture of 2 HD Bearded Axe form TCOSS.\r\nHauscarls Bow – uses Meshes and Texture of Nord bow form TCOSS.\r\n\r\n\r\nThanes Sword – uses the Meshes and Texture of GOTLAND sword for TCOSS.\r\nThanes Axe – uses Meshes and Texture of Bearded Axe fine form TCOSS.\r\nThanes Greatsword – uses Meshes and Texture of 2 HD GOTLAND Sword form TCOSS.\r\nThanes Bow – uses Meshes and Texture of Nord bow fine form TCOSS.\r\n\r\nJarls Sword - uses the Meshes and Texture of NEAGLING sword for TCOSS.\r\nA two handed weapon for Jarls category still to be added in due course.\r\n\r\nThese can all be crafted at the forge and require the same smithing perk tree as the appropriate level armour.\r\n\r\nYou must install TCOSS mod for these weapons to work but if you want to use only these and not the other TCOSS weapons as they are not scaled with the other items in the mod then uncheck the TCOSS.esp plugin. \r\n\r\nI am currently playing with TRO basic needs (a mod I heartily recommend) so I have also adjusted some of the food recipes by removing the need for Salt pile to cook the Rabbit haunch, Chicken breast, Pheasant breast and Salmon as these are light snacks and really don\\'t need salt to be made edible in real life (only better tasting).\r\n\r\nIf you are experiencing CTD\\'s with this mod I recommend you download BOSS at http://skyrim.nexusmods.com/mods/6 and amend you load order as advised.\r\n\r\n====================================\r\nViking Armour Compilation and Viking Warrior Compilation\r\n====================================\r\nAuthor: Laz3456\r\n\r\nVersion: 0.6\r\nJune 22, 2012\r\n\r\n===============\r\n1. INTRODUCTION\r\n===============\r\n\r\nA compilation of various Viking armour type mods. Heavy Stormcloak armour with mail texture, Scale Armour (under misc section once you have advanced armours perk) and Thanes Armour (Ulfric’s clothes) almost equal to Dragonbone Plate armour (less armour but also lighter) which is craftable with Dragon smithing.\r\n\r\nViking Warrior Compliation.ESP requires The Cronicles of Steel real swords mod and includes appropriate weapons for the various levels of armour.\r\n\r\n===============\r\n2. INSTALLATION\r\n===============\r\n\r\nExtract the esp module and the meshes folder into your Skyrim\\\\Data folder and make sure either Viking armour comp.ESP or Viking Warrior comp.ESP (not both) is loaded after Open faced helmets.ESP.\r\n\r\n==================\r\n3. VERSION HISTORY\r\n==================\r\n\r\nv0.1: \r\n\r\nInitial Release. Compilation includes Scaled armour mod, Raider Helmet mod, Chain mail guards mod, Open faced Helmets mod, Stromcloak armour Heavy mod and a re-size of the hornless steel helmet.\r\n\r\nv0.2:\r\nAdded Thanes Armour instead of the Dragonbone Plate replacement.\r\n\r\nv0.3:\r\nThanes armour has craftable Helm, Cuirass, Gauntlets, Boots and Shield\r\n\r\nv0.4:\r\nRenamed Thanes armour to Jarls armour has craftable Helm, Cuirass, Gauntlets, Boots and Shield.\r\nThanes Armour has Helm, Cuirass and Shield\r\nHauscarls Hauberk Cuirass only.\r\nVikingr Brynja Cuirass only.\r\nReduced AV for Stormcloak armour to just below imperial.\r\nAdjusted stats and smithing requirements so armour scales to player development.\r\n\r\nv0.5:\r\nSwapped Thanes (now mail hauberk) and Haucarls Armour (now scale hauberk).\r\nAdded the following helmets.\r\nVikingr Helm. Croc\\'s Nasal Helm\r\nHaucarls Helm. Croc\\'s spectacle Helm\r\nThanes Helm. HammerwingStudio\\'s Viking helm with knot work.\r\nJarls Helm. HammerwingStudio\\'s Viking helm with knot work Vendel version.\r\n\r\nViking Warrior Compilation\r\nv0.6:\r\nAdded compatibility with TCOSS weapons, added my own wepons, amended some food recipes and amended some Vanilla textures of low level items for a more Viking feel.\r\nItmes added:\r\nHauscarls Sword \r\nHauscarls Axe \r\nHauscarls BattleAxe \r\nHauscarls Bow \r\n\r\nThanes Sword \r\nThanes Axe \r\nThanes Greatsword\r\nThanes Bow \r\n\r\nJarls Sword\r\n\r\nVanilla Meshes and textures replaced.\r\nIron axe.\r\nSteel axe.\r\nSteel battleaxe.\r\nSteel sword.\r\n\r\nIron armour.\r\nSteel armour.\r\n==================\r\n3. CREDITS\r\n==================\r\n\r\nshingouki2002 and Waalx – The Chronicles of Steel Skyrim mod for all new wepons.\r\nHammerwingStudios - Viking helm with Knot work and Vendel version of the same.\r\nCroc - Scaled armour mod (Names and some stats modified)\r\nCroc - Viking/Norse Maille mod (Names and some stats modified)\r\nredxavier - Raider Helmet mod\r\nchupacabrax - Chainmail guards mod \r\nMadcat221 - Openfaced helmets mod \r\nLaz 3456 - Stromcloak armour heavy, steel helmet re-size, Thanes Armour, AV stat scaling, Viking Warrior Compilation weapons stats and compilation complier.\r\n",
  "categoryId": "54",
  "version": "0.6",
  "author": "Laz3456",
  "createdUnix": "1332061285",
  "updatedUnix": "1340348272",
  "containsAdultContent": false,
  "uploadedBy": "Laz3456",
  "primaryFile": null,
  "files": [
    {
      "fileId": "47908",
      "name": "Viking Armour Compilation04",
      "version": "0.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "256075",
      "fileName": "Viking Armour Compilation04-13150-0-4.zip",
      "uploadedUnix": "1333022230",
      "modVersion": "0.4",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Viking%20Armour%20Compilation04-13150-0-4.zip?fid=47908&ttl=1535775681&ri=8192&rs=8192&setec=846acae8452a23523e7bd71637e9f431"
    },
    {
      "fileId": "55608",
      "name": "Viking Armour Compilation05",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "278043",
      "fileName": "Viking Armour Compilation05-13150-0-5.rar",
      "uploadedUnix": "1335178422",
      "modVersion": "0.5",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Viking%20Armour%20Compilation05-13150-0-5.rar?fid=55608&ttl=1535775682&ri=8192&rs=8192&setec=60a5c504b7c2e6bf9fd29196b40f0a97"
    },
    {
      "fileId": "69571",
      "name": "Viking Warrior Compilation 06",
      "version": "0.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Viking Warrior Compilation-13150-0-6.rar",
      "uploadedUnix": "1340348272",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/b42e89c650cf3fbe022aba6461bc918a1fdcdc8b3da9f328318360e877255f8e/analysis/1406975417/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Viking%20Warrior%20Compilation-13150-0-6.rar?fid=69571&ttl=1535775682&ri=8192&rs=8192&setec=04cc9222b00b462bf6743d80e7e6b601"
    }
  ]
}