{
  "modId": 13166.0,
  "modName": "Mighty Magick Skyrim",
  "summary": "Mighty Magick, the original TES magic mod, is in Version 4.15&#33;",
  "descriptionHtml": "[center][img]http://i46.tinypic.com/27y7r41.jpg[/img][/center]\r<br />[center][b][size=4]Mighty Magick: Skyrim[/size]\r<br />[size=4]Author: Damar Stiehl[/size]\r<br />[size=4]Version: 4.15[/size]\r<br />[size=4]For Patch Notes, please see the Article section. SKSE and SkyUI are  REQUIRED.[/size][/b][/center]\r<br />\r<br />[center][url=http://www.skyrimgems.com/index.html][img]http://i.imgur.com/hXQSy.png[/img][/url][/center]\r<br />\r<br />[center][color=#548DD4][b]INTRODUCTION[/b][/color][/center]\r<br />[center][i]It does not matter if magic is born in light or in darkness.\r<br />Magic is alive. Its place changes over time and grows along with us.\r<br />Magic is anything you can think of. It can be felt in infinite ways. \r<br />As light, as darkness, as red or as blue.\r<br />Magic... is freedom.[/i][/center]\r<br />Mighty Magick is a TES magic system mod that started as a purely personal creation in the halcyon days of Morrowind. During the Oblivion era, it was among the most popular magic mods despite its flaws. Skyrim takes a much different (and admittedly simplified) approach to magic than its predecessors. While it is not terminally flawed, it is missing some of the beloved old tools that we used in previous TES games. \r<br />\r<br />Given the number of magic mods for Skyrim, you may be wondering if Mighty Magick is right for you. Below are the main design principles of this mod - if you agree, then you just might like MMSk&#33;\r<br />\r<br />[b]1. User Freedom.[/b] While Mighty Magick 4.0 no longer features individual ESP files for each magic school, you still have a significant degree of control over what features you want enabled or disabled, implemented via Mod Configuration Menu.\r<br /> \r<br />[b]2. Authenticity.[/b]  Changes that MMSk introduces are designed to feel like a part of the TESverse. There are no ridiculous or outlandish effects, no Super Sayans or B52s that pop out to carpet-bomb your enemies. If you are an old TES player, you&#39;ll recognize most of them; if you are new, you don&#39;t have to worry about the mod &#34;breaking character&#34; of the Elder Scrolls.\r<br />\r<br />[b]3. Usefulness and usability.[/b]  Magic is a powerful tool, not window dressing. Every spell in your spellbook should produce tangible and important impact upon your game. Spells that produce effects like &#34;1% chance of 10% extra damage vs. white skeevers only during full moon&#34; are a waste of money and spellbook space. A spell should also not be so difficult or produce such inconvenient results to use that it becomes useless. A good example of that would be the vanilla Detect Life spell. Because it is a concentration-type spell, it is next to useless; wouldn&#39;t it be better if it was fire-and-forget so you could just give yourself &#34;spider sense&#34; for a while? MMSk fixes this and similar issues with vanilla spells.\r<br />\r<br />[b]4. Evolution, not obsolescence.[/b]  Having multiple different spells that do exactly the same thing is no fun. It&#39;s also no fun when a spell that you bought and paid for becomes obsolete as your skill grows, and just sits there cluttering your spell list. MMSk is designed so that most (though not all) spells are useful the moment you acquire them, and continue to be useful as you level up and improve your skills. In some cases obsolescence cannot be avoided, because you&#39;d end up with overwhelmingly overpowered and undercosted spells; but even in these situations, you will never have more than a couple obsolete spells when you hit Master level.\r<br />\r<br />[b]5. Balance.[/b]  Useful and powerful does not mean godmode, because godmode ruins the experience just as quickly as being underpowered. There are aspects of vanilla magic system that are subpar or nearly worthless, and then there are some that are stupidly overpowered (like the stagger mechanic, or the Transmute spell). I attempted to reign in some of the more &#34;cheaty&#34; aspects of magic in Skyrim (but rest assured, nothing has been &#34;nerfed to hell&#34;, that&#39;s not my style) while buffing those that are decidedly inferior.\r<br />\r<br />[b]6. Versatility.[/b]  The beauty of TES is that it has always allowed you to break the &#34;character class&#34; mold and forge your own path. You can certainly be a robe-wearing wizard or a classic TES battlemage, but you don&#39;t HAVE to be. Do you enjoy wearing armor and swinging heavy weapons, but would rather not lug them around? Grab the Bound Weapons and Bound Armor spells and a few perks, and summon Daedric gear on demand&#33; Do you want to roleplay a holy paladin, who is the scourge of all things that are offensive in Stendarr&#39;s sight? Pick up School of Restoration in addition to your armor and weapon skills, and smite the undead and daedra with holy light, or become an immovable object inside your Circle of Protection. Or would you rather be an illusionist that uses your opponents&#39; deepest fears to destroy them? The choice is yours, and MMSk gives you all the necessary tools. I took great care to ensure that multiple playstyles are equally supported and each school of magic can theoretically stand on its own. \r<br />\r<br />[color=#FFC000][center][b]If you like the mod, please endorse it, vote for it and consider donating.[/b][/center][/color]\r<br />[center][color=#548DD4][b]COMPATIBILITY:[/b][/color][/center]\r<br />\r<br />Mighty Magick: Skyrim will likely conflict with any mod that does the following:\r<br />\r<br />- Alter any of the playable spells\r<br />- Alters game settings responsible for Dual Casting effectiveness and cost\r<br />- Alters Novice perk in any School of Magick\r<br />- Alters Fortify &lt;magic school&gt; Enchantment and Alchemy Magic Effects\r<br />\r<br />In general, it should play nice with mods that add new spells, shouts and magic effects as long as these mods are loaded after MMSk. Top-to-bottom gameplay overhauls like Requiem will most likely NOT play well with Mighty Magick, but since I don&#39;t use them, I haven&#39;t tested them. If you manage to make MMSk play well with a top-to-bottom overhaul, feel free to post about it&#33;\r<br />\r<br />[center][color=#548DD4][b]INSTALLATION[/b][/color][/center]\r<br />[color=#FF0000][b][center]SKSE AND [color=#FF0000][b]SkyUI ARE ABSOLUTELY REQUIRED[/b][/color].[/center][/b][/color]\r<br />Use the Nexus Mod Manager to download and activate the mod, or simply copy ESPs and BSAs to your Data folder, and activate the from Skyrim Launcher.\r<br />\r<br />[color=#FF0000][b][center]****************************************[/center]\r<br />[center]IMPORTANT NOTE FOR USERS OF MIGHTY MAGICK SKYRIM 3.x:[/center]\r<br />\r<br />Unfortunately, because of many changes that were introduced in MMSk 4.0, the safest option is to completely uninstall MMSk 3.x, install MMSk 4.0 and START A NEW GAME. However, you could also try &#34;cleaning your save&#34;. Follow these instructions - however, you will probably experience CTDs and unforeseen consequences down the road. I haven&#39;t tested this method, so use it at your own risk.\r<br />\r<br />1. COMPLETELY UNINSTALL MMSk 3.x.\r<br />2. Load your save (you will receive a warning that a mod is missing).\r<br />3. Save again into a different slot.\r<br />4. Load this new save and save one more time.\r<br />5. Optionally, you could use one of the tools available on Nexus to clean out scripts added by Mighty Magick 3.x from your save.\r<br />6. Now install MMSk 4.0 and load your latest save.\r<br />\r<br />[center]ONCE MORE: THE SAFEST OPTION IS PROBABLY TO START A NEW GAME.[/center]\r<br />[/b][/color][center][color=#FF0000][b]****************************************[/b][/color][/center]\r<br />[center][color=#548DD4][b]LOAD ORDER[/b][/color][/center]\r<br />Load the individual ESPs of the mod in this order:\r<br />\r<br />[b]1. Mighty Magick Skyrim - Main.esp\r<br />2. Mighty Magick Skyrim - Dragonborn.esp (optional).\r<br />3. Mighty Magick Skyrim - Enchantments Rebalance.esp (optional).\r<br />4. Mighty Magick Skyrim - Artifacts.esp (optional).\r<br />5. Mighty Magick Skyrim - Artifacts Dragonborn.esp (optional).[/b]\r<br />\r<br />In your overall load order, MMSk should be fairly close to the bottom, which will ensure that the changes that it brings are not overridden by other mods. Only load a mod that affects magic-related settings and items after MMSk if you want that mod to take precedence over MMSk. If a change that you expect from MMSk does not appear as described, or doesn&#39;t appear at all, or act strangely - please check your loaded mods and load order first. Often times, a quick load order change fixes issues such as these&#33;\r<br />\r<br />[b][color=#548DD4][center]CONFIGURATION[/center][/color][/b]\r<br />After you enable Mighty Magick and load your game, wait a moment for the configuration menu to register. After this, open Mighty Magick MCM (listed as [b]MMSk [/b]and [b]MMSk - Dragonborn[/b]) and set the confguration options that you want. Each option has helpful highlight text that explains exactly what it does.\r<br />\r<br />[color=#FFC000][center][b]MAIN MODULE OPTIONS:[/b][/center][/color]\r<br />[list][*][size=2][b][color=#FFC000]Distribute New Spell Tomes:[/color][/b][color=#FFC000] you [b]REALLY[/b] want to enable this one, so that new spell books appear in vendor inventories and as world loot. You may have to wait 48 hours for loot and inventories to refresh however.[/color][/size][/*]\r<br />[/list]\r<br />[list][*][size=2][b]Enable &lt;SCHOOL&gt; Magnitude Scaling:[/b] The spells in this school will be 1% more powerful for each skill point, as long as you buy the Novice perk.[/size][/*]\r<br />[/list]\r<br />[list][*][size=2][b]Enable &lt;SCHOOL&gt; Duration Scaling: [/b]The spells in this school will last 1% longer for each skill point, as long as you buy the Novice perk. Applies only to spells that have duration.[/size][/*]\r<br />[/list]\r<br />[list][*][size=2][b]Dual Casting Power Bonus:[/b] use this slider to change how much stronger your spells will be when dual cast. [/size][/*]\r<br />[/list]\r<br />[list][*][size=2][b]Dual Casting Cost Bonus:[/b] use this slider to change how much more Magicka your spells will cost when dual cast.[/size][/*]\r<br />[/list]\r<br />[list][*][size=2][b]Enable Shout Magnitude Scaling:[/b] if enabled, your Dragon Shouts will increase in magnitude based on how many times you Shouted, how many Dragon Souls you absorbed, and on your Health and Stamina.[/size][/*]\r<br />[/list]\r<br />[list][*][size=2][b]Enable Shout Duration Scaling:[/b] if enabled, your Dragon Shouts will increase in magnitude based on how many times you Shouted, how many Dragon Souls you absorbed. Optional, and only works if you also selected Shout Magnitude Scaling.[/size][/*]\r<br />[/list]\r<br />[list][*][size=2][b]Enable Ward Stagger:[/b] if enabled, your Ward spells will stagger enemies who strike them in melee.[/size][/*]\r<br />[/list]\r<br />[list][*][size=2][b]Enable Telekinesis Powerup: [/b]if enabled, Telekinesis will have greater range and items thrown with it will do much more damage.[/size][/*]\r<br />[/list]\r<br />[color=#FFC000][center][b]DRAGONBORN MODULE OPTIONS:[/b][/center][b]\r<br />[/b][/color][list][*][size=2][b][color=#FFC000]Distribute New Spell Tomes:[/color][/b][color=#FFC000] you should enable this option to have access to spells added by the module.[/color][/size][/*]\r<br />[/list]\r<br />[list][*][size=2][b]Adjust Chaos Enchantment Magnitude:[/b] if you are using Mighty Magick Skyrim - Enchantments module, you should enable this option, otherwise the Chaos enchantment will be a lot more powerful than any other enchantment that you can make&#33;[/size][/*]\r<br />[/list]\r<br />\r<br />[b][center][img]http://i57.tinypic.com/nlphrm.png[/img][/center][/b]\r<br />[b]The best way to discover Mighty Magick Skyrim is to play. New spells have been added to every School of Magick. The descriptions of every spell have been reviewed, updated and, if necessary, re-written - and it is fun to discover them as you progress (but if you want to peek ahead, take a look at the spell list PDF). Here you&#39;ll find the descriptions of most important gameplay changes that the mod introduces.[/b]\r<br />\r<br />[center][color=#f1c232][b]Fortify Magic School Enchantment and Alchemy Effects are reversed.[/b][/color][/center]\r<br />This change fixes the &#34;zero-cost spells&#34; exploit that is possible by enchanting multiple pieces of armor with &#34;Fortify &lt;magic school&gt;&#34; effect. Now, [color=#f1c232][b]armor enchantments INCREASE THE MAGNITUDE[/b][/color] of corresponding school&#39;s spells. [color=#f1c232][b]Potions, on the other hand, REDUCE THE COST[/b] [/color]of corresponding school&#39;s spells. So, if you brew a powerful enough potion, you can still cast a zero-cost spell... just not all the time.\r<br />\r<br />To make the difference more apparent, the enchantment effect&#39;s name (which appears under Current Active Effects in Magic menu) is now &#34;[b]Magnify[/b]&#34; instead of &#34;Fortify&#34;.\r<br />\r<br />All &#34;Fortify X&#34; enchantments were previously labeled as members of Restoration school, causing them to benefit from Fortify Restoration potions and enchantments. This created a potential infinite loop of self-stacking. Now, all &#34;Fortify X&#34; enchantments are not members of ANY school of magick, and do not benefit from any effects other than Fortify Enchanting and Fortify Alchemy at creation.\r<br />\r<br />\r<br />[center][img]http://i61.tinypic.com/68h4pe.png[/img][/center]\r<br />[b]\r<br />The School of Destruction [/b]received relatively few changes and additions.\r<br />\r<br />[b]Stagger mechanics have been adjusted to make it less overpowered (though still useful).[/b]\r<br />[list][*]Novice-level spells do not stagger at all (as in Vanilla)[/*]\r<br />[*]Apprentice-level spells have a 25% chance to stagger a target that is under 75% health, 50% chance to stagger a target under 50% health and 95% chance to stagger a target under 25% health.[/*]\r<br />[*]Adept-level spells have a 50% chance to stagger a target that is under 75% health, 75% chance to stagger a target under 50% health and always stagger a target under 25% health.[/*]\r<br />[*]Expert- and Master-level spells always stagger the targets.[/*]\r<br />[*]Lightning spells have a slightly higher chance to stagger the target.  [/*]\r<br />[/list]    \r<br />[b]Changes to the Intense Flames perk:[/b]\r<br />[list][*]Concentration-type spells will terrify the target when the target is below 20% health.[/*]\r<br />[*]Fire-and-forget spells have a 25% chance to terrify the target regardless of its health.[/*]\r<br />[*]Undead, dragons, automatons and daedra are immune to this effect.  [/*]\r<br />[/list]    \r<br />[b]Changes to  the Deep Freeze perk:[/b]\r<br />[list][*]Concentration-type spells will freeze the target when the target is below 20% health.[/*]\r<br />[*]Fire-and-forget spells have a 25% chance to freeze the target regardless of its health.[/*]\r<br />[*]Dragons and those immune to paralysis are immune to being frozen.  [/*]\r<br />[/list]    \r<br />[b]Changes to Disintegrate perk:  [/b]\r<br />[list][*]Concentration-type spells will disintegrate the target when the target is below 15% health.[/*]\r<br />[*]Fire-and-forget spells have a 15% chance to disintegrate the target which is under 75% of health.[/*]\r<br />[*]Dragons and some specially-flagged characters cannot be disintegrated.  \r<br />[/*]\r<br />[/list]\r<br />[b]Changes to Rune spells:[/b]\r<br />[list][*]You can now place 2 runes at a time:[/*]\r<br />[*] Base damage of runes has been reduced slightly. [/*]\r<br />[*]Buying Rune Master perk will now allow you to place a third rune.[/*]\r<br />[/list]\r<br />[b]Other changes:\r<br />[/b][list][*]Curses (&#34;Weakness to &lt;element&gt;&#34; or &#34;Weakness to Magick&#34;) spells are available to students of Destruction.\r<br />[/*]\r<br />[*]Cloak spells (including Dark Elves&#39; Ancestors Wrath) and Wall spells scale as your skill grows and you pick up appropriate perks.[/*]\r<br />[*]Point-blank AoE damage spells are now available at Expert level.[/*]\r<br />[*]Brand-new mass destruction spells available at Master level.[/*]\r<br />[/list]\r<br />[b]Several more spells were changed or removed - you can discover these changes by playing or taking a look at the spell list.\r<br />[/b]\r<br />\r<br />[center] [img]http://i62.tinypic.com/27wy7o3.png[/img][/center][b][b]The School of Alteration [/b][/b]has received many changes and new spells, making it into a powerful utility school itis meant to be.[b]\r<br />\r<br />Changes to the Mage Armor perk:[/b]\r<br />[list][*]When you buy the perk and wear no armor at all, your Armor Rating is naturally increased.[/*]\r<br />[/list]\r<br />[b]Old effects restored:[/b]\r<br />[list][*]Feather/Burden[/*]\r<br />[*]Slowfall\r<br />[/*]\r<br />[*]Resist Element[/*]\r<br />[*]Reflect Damage[/*]\r<br />[*]...and much more&#33;[/*]\r<br />[/list]\r<br />[b]Changes to Transmutation spells:[/b]\r<br />[list][*]Instead of just one Transmute spell, you have an entire suite of them, allowing you to transmute almost anything into almost anything&#33;[/*]\r<br />[*]Transmutation now works on ingots instead of ore, and allows to transmute multiple ingots at a time.[/*]\r<br />[*]If you get lucky, you just might get a surprise... but luck has a flipside too.\r<br />[/*]\r<br />[/list]\r<br />[b]Many more spells were added, changed and removed - you can discover these changes by playing or taking a look at the Spell List.  [/b]\r<br />\r<br />[center][img]http://i60.tinypic.com/2wnpvea.png[/img][/center][b]\r<br />The School of Conjuration[/b] received a substantial overhaul, including a more expansive perk tree.\r<br />\r<br />[list][*]Conjuration spells will no longer be absorbed by your own Absorb Spell effect.[/*]\r<br />[/list]\r<br />[list][*]Bound Armor returns to the School of Conjuration&#33; Summon a full set of Daedric armor (light or heavy depending on your skill) that weighs nothing at all but protects just as well as the real thing&#33;[/*]\r<br />[/list]\r<br />[list][*]Mark/Recall, Divine Intervention and Beacon of Magnus spells are now avaiable to let you travel around Skyrim instantly.[/*]\r<br />[/list]\r<br />[list][*]Reading low-level Conjuration spellbooks will grant you a Lesser Power that allows you to instantly dismiss any summoned creature that you currently have. Tired of your minion? No need to beat him to death, just gracefully dismiss him until you need him again&#33;[/*]\r<br />[/list]\r<br />[list][*]All Atronachs and Elemental Thralls now scale farther with you all the way into level 40+. &#34;Potent&#34; Atronachs scale further than regular ones, and are subtly larger.[/*]\r<br />[/list]\r<br />[list][*]Two options for the Soultrap spell: one that produces a visible projectile and an aura effect on the target creature/NPC, and one that does not use a projectile. Mass Soultrap (Soul Harvest) returns to School of Conjuration as well&#33;\r<br />[/*]\r<br />[/list]\r<br />[list][*]New perks have been added, letting you specialize in summoning daedra or necromancy (or both if you have enough perk points&#33;), improve your minions and control more of them at a time. [/*]\r<br />[/list]\r<br />[list][*]New perks have been added that improve your Bound Armor and Bound Weapons.[/*]\r<br />[/list]\r<br />[b][b]Several spells were added, changed and removed - you can discover [b]by playing or taking a look at the spell list.[/b]\r<br />\r<br />\r<br />[center][img]http://i62.tinypic.com/x5dx7a.png[/img][/center]\r<br />[/b]\r<br />The School of Illusion [/b]received many changes and additions that let you play as an actual illusionist mage, whose main strength lies in manipulating others.\r<br />[b][b]\r<br />Changes to &#34;Influence&#34; spells:\r<br />[/b][/b][list][*]Effects of &#34;Influence&#34; spells (Fury, Fear, Pacify, etc.) will now scale with your Illusion skill and when dual-cast.[/*]\r<br />[/list][b][b]\r<br />Spells returned to their correct School:\r<br />[/b][/b][list][*] Magelight, Candlelight, Paralyze and Mass Paralysis return to Illusion school&#33; They can be purchased from both Illusion and Alteration trainers, but only Illusion skill makes them better. [/*]\r<br />[/list][b][b]\r<br />Changes to Illusion perks:\r<br />[/b][/b][list][*]Perks Hypnotic Gaze, Rage, Aspect of Terror, Kindred Mage, Animage now provide a 25% magnitude bonus to its corresponding effect instead of a flat bonus.[/*]\r<br />[/list][b][b]\r<br />Charm spells:\r<br />[/b][/b][list][*]Don&#39;t just pacify enemies, make them fight for you&#33;[/*]\r<br />[/list][b][b]\r<br />Phantasm spells:\r<br />[/b][/b][list][*] When you cast a Phantasm spell on an enemy, you bring forth a nightmare from your foe&#39;s mind, and give it a ghostly physical form&#33; Phantasms are resistant to physical damage, but vulnerable to magic, and they immediately draw the attention of the enemy you cast it on. Phantasms are somewhat random, but they always pack a punch&#33;\r<br />[/*]\r<br />[/list]\r<br />[b]Phantom Wound spells:[/b]\r<br />[list][*]You don&#39;t necessarily need to hurt your enemies, just CONVINCE them that they are hurt&#33; Phantom Wound spells reduce your foes&#39; maximum health for as long as they last, making even the most powerful opponents into pushovers.\r<br />\r<br />[/*]\r<br />[/list][b]Substantial perk tree changes:[/b]\r<br />[list][*]You will find some perks removed, and their effects rolled into other perks (for example, Quiet Casting is gone; instead, acquiring Illusion Adept perk grants you the ability to cast silently).[/*]\r<br />[*]You will also find new perks, such as Phantasmagoria, which let you project more phantasms, or augment your Illusion spells in other ways&#33;\r<br />[/*]\r<br />[/list][b][b]\r<br />Many more spells were added, changed and removed - you can discover these changes by playing or taking a look at the Spell List.  \r<br />\r<br />[/b][/b]\r<br />[center][img]http://i60.tinypic.com/29dfsxy.png[/img][/center]\r<br />[b]The School of Restoration [/b]is a perfectly valid School of Magick, and it shouldn&#39;t reduce you to a role of a healer alone&#33; Skills and attribute buffs return to Restoration&#39;s repertoire, as well as the means to bring righteous ruin to all things offensive in Stendarr&#39;s sight&#33;\r<br />\r<br />[b]Changes to Ward spells:[/b] \r<br />[list][*]Wards now reflect spells that hit them, and can stagger enemies that strike the ward in melee (only if the MCM option is enabled).[/*]\r<br />[/list]\r<br />[b]&#34;Fortify&#34; spells:\r<br />[/b][list][*][b]Imp[/b]rove your attributes, or your skills with a cast of a spell&#33;[/*]\r<br />[*]You can even grant yourself unearthly alacrity, running as fast as the wind and jumping as tall as treetops&#33; Just be careful on the way down...\r<br />[/*]\r<br />[/list]\r<br />[b]Effects of Turn and Repel Undead spells will now scale with your Restoration skill and when dual-cast.[/b]\r<br />[list][*]  - Turn Undead spell is a single-target spell that will cause a single undead to flee and set it on fire if dual-cast.[/*]\r<br />[*]  - Repel Undead spell is an targeted AoE spell that makes multiple undead flee and sets them on fire if dual-cast.[/*]\r<br />[/list]\r<br />[b]Several spells were added, changed and removed - you can discover these changes by playing or taking a look at the Spell List.    [/b]\r<br />\r<br />[center][img]http://i62.tinypic.com/f4jjhi.png[/img][/center]\r<br />[b]Your Voice powers to scale as your character progresses:[/b] \r<br />[list][*]Shout cooldowns will be reduced as you shout more. At 200 shouts, the cooldown reduction will cap at 20%. Combine with an Amulet of Talos and a Blessing of Talos for a 60% reduction.[/*]\r<br />[*]Your shouts become 1% more powerful for every 10 base Health above 100 (not affected by Fortify Health effect)[/*]\r<br />[*] Your shouts become 1% more powerful for every 10 base Magicka above 100 (not affected by Fortify Magicka effect)[/*]\r<br />[*]Your shouts become 1% more powerful for every 10 base Stamina above 100 (not affected by Fortify Stamina effect)[/*]\r<br />[*]Your shouts become 1% more powerful for every 1 Dragon Soul you absorb[/*]\r<br />[*]Your shouts become 1% more powerful for every 20 times you Shout[/*]\r<br />[*]If enabled in MCM, Shout effect duration will increase as well.\r<br />[/*]\r<br />[/list]\r<br />[b]Changes to individual shouts:\r<br />[/b][list][*]Shout &#34;Elemental Fury&#34; has been renamed to &#34;Windfury&#34; to better match the name with the effect.[/*]\r<br />[*]Shout &#34;Storm Call&#34; will no longer harm your followers.[/*]\r<br />[/list]\r<br />[list][*][b]In order to receive Shout improvements, you must sleep every so often (if you gained anything, you will receive a message &#34;The power of your Thu&#39;um grows...&#34;).[/b][/*]\r<br />[/list]\r<br />[list][*][b]Unlike cooldown cap, there is no cap on possible shout magnitude increase. Sky is the limit, so help you Kyne.[/b][/*]\r<br />[/list]\r<br />[center][font=Comic Sans MS][color=#a61c00][b][size=6][img]http://i59.tinypic.com/rh0aao.png[/img][/size][/b][/color][/font][/center][b]Mighty Magick Skyrim - Artifacts [/b]and [b]Mighty Magick Skyrim - Enchantments Rebalance[/b] modules are completely optional additions to [b]Mighty Magick [/b]experience. The former changes and tweaks nearly every artifact in vanilla Skyrim, making them more interesting and useful. The latter is a &#34;hardcore rebalance&#34; of enchanting system, featuring significant changes to the Enchanting perk tree, some useful new functionality and, yes, major nerfs to beloved exploits used to create godlike gear. \r<br />\r<br />You are absolutely not required to use either module. However, if you do, PLEASE read their respective readmes under the Articles section (if I pasted them here, it would make this page look excessively long even by my standards). I am not responsible for any anguish caused by activating either module without knowing what it adds to your game.\r<br />[center]\r<br />[img]http://i61.tinypic.com/jt9vu0.jpg[/img][/center]\r<br />[b]Mighty Magick Skyrim - Dragonborn Module introduces these changes:[/b]\r<br />\r<br />[list][*]Dragon Aspect can be used more than once a day and lasts 10 minutes.[/*]\r<br />[*]New Runes obey Rune Master perk (+1 rune).[/*]\r<br />[*]Poison rune now works on daedra and dragons and its damage is improved.[/*]\r<br />[*]Corrected Ash Rune duration to 15 seconds as per description[/*]\r<br />[*]Conjure Ash Spawn summons Ash Immolator (30-60) if perk Dread Might is taken.[/*]\r<br />[*]Ash Guardian works like a regular Fire summon, but does not obey Oblivion&#39;s Might perk. Instead, if caster has heartstones, it receives +100 health and +25 Resist Magick.[/*]\r<br />[*]Seeker now obeys Summoner perk and Oblivion&#39;s Might perk. If Oblivion&#39;s Might is taken a High Seeker is summoned instead (20-80).[/*]\r<br />[*]Adjusted cost of Whirlwind Cloak to be in line with other cloak spells. Renamed Cloak of Winds for consistency.[/*]\r<br />[*]Bound Dagger functions the same as other bound weapons (has additional enchantments, lasts forever). Suppresses Magicka by 50.[/*]\r<br />[*]Dremora Merchant (Black Market) duration increased to 60 sec.[/*]\r<br />[*]Dremora Butler duration increased to 60 sec.[/*]\r<br />[*]Conjure Werebear duration increased to 5 min.[/*]\r<br />[*]Mora&#39;s Boon increased in magnitude so it can fully restore even high-level characters.[/*]\r<br />[*]Increased North Wind magnitude to 50.[/*]\r<br />[*]Increased Bones of the Earth duration to 1 minute[/*]\r<br />[*]Increased Root of Power duration to 3 minutes[/*]\r<br />[*]Increased Waters of Life magnitude to 500.[/*]\r<br />[*]Increased Summon Karstaag duration to 5 minutes.[/*]\r<br />[*]Duration of all &#34;Secret of...&#34; powers increased to 1 minute.[/*]\r<br />[*]Chaos Damage: each element chance reduced to 30%.[/*]\r<br />[*]Added MCM option to bring Chaos Damage enchantments in line with other elemental enchantments in MMSk-Enchantments Rebalance.esp.[/*]\r<br />[*]New Spell: Venom Fang. Launches a venomous tendril at your target, dealing 10 poison damage for 10 seconds. Does not work on undead or automatons.[/*]\r<br />[*]New Spell: Walking Bomb. Turns a portion of the target&#39;s blood into corrosive poison. If the target dies while the effect is active, its body is disintegrated into a cloud of flammable gas which then ignites. Does not work on dragons, undead or automatons.[/*]\r<br />[/list]\r<br />[b]Mighty Magick Skyrim - Dragonborn Artifacts introduces these changes:[/b][list][*]Ahzidal, Dukaan, Zahkriisos: now grant 80% resistance to the corresponding element and 100% corresponding element damage boost.[/*]\r<br />[*]Significant changes to the Miraak set. You will only receive the best version of it regardless of what level you are, and it is meant to be worn all together for maximum benefit. In essence, you are not wearing someone&#39;s enchanted pants - you are &#34;wearing Miraak&#34;. Remember, he&#39;s been Dragonborn since before it was cool to be Dragonborn, and was planning to solo Alduin at some point. His outfit, when worn as a set, is probably the be-all-end-all gear for a spellcaster.\r<br />[/*]\r<br />[/list][b][center][color=#548DD4]\r<br />\r<br />NOTES AND KNOWN ISSUES[/color][/center][/b]\r<br />\r<br />[color=#FFC000][list][*] Teleport spells (Mark/Recall, Divine Intervention, Beacon of Magnus) do NOT have any safeguards on them. You can Recall out of Sovngarde if you want, but good luck getting back in without console. (Come to think of it, you could Mark in Sovngarde and visit whenever you wish again. That&#39;s got to be the pinnacle achievement for a Clever Man. AWESOME). Use common sense when casting - if you are in the middle of an event or in a place which you are only supposed to visit once, don&#39;t teleport out. I am not responsible for any issues caused by irresponsible teleporting.[/list]\r<br />\r<br />[list][*] It is quite possible to kill yourself while jumping around with the Alacrity spell (remember what happened with Tarhiel?). Just because you&#39;ve managed to jump up on a house&#39;s roof doesn&#39;t mean that you won&#39;t smash your skull jumping back down. Also, if you don&#39;t pay attention to where you&#39;re going, you can very well wedge yourself in a spot that you can&#39;t get out of. Again, I&#39;m not responsible for any broken bones.[/list]\r<br />\r<br />[list][*] If you have Rune Master perk, have Rune spells equipped in your hands, save the game, quit Skyrim, reload Skyrim and re-load the save, you will notice that you cannot place the third rune anymore. To fix that, unequip the Rune spells and then re-equip them. (I know it&#39;s a very specific sequence of events, but someone WILL ask about it sooner or later).[/list]\r<br />[list][*] If your character dies while affected by Alacrity spell, the effect of it will not wear off and stack, persisting even through save/load. To fix the issue, follow the instructions in the &#34;How to fix the Alacrity issue&#34; article (also included in the 3.12 archive).[/list]\r<br />[/color]\r<br />\r<br />[center][b][color=#548DD4]SPECIAL THANKS[/color][/b][/center]\r<br />\r<br />- Valamyr for plaguing me with ideas and finding bugs\r<br />- OZY9000, Aryeonos and Jwr1992 for nailing obscure bugs in 3.0\r<br />- All my early adopters and testers for trusting in MMSk and taking the plunge\r<br />- All of my bug reporters and feature suggesters\r<br />- Maximluppov for the Dragon Priest meshes\r<br />- Mathiaswagg for the 4.15 NMM Installer\r<br />\r<br />[center][b][color=#548DD4]FAQ[/color][/b][/center]\r<br />Q: Why do I have to check a checkbox in MCM to have the new spells distributed? Can&#39;t you make it automatic?\r<br />A: I could, but doing it through MCM is less prone to bugs that some people reported to me (like the distribution quest looping repeatedly). Plus, if done through MCM, it allows you to restore the leveled lists to their default state if you decide to uninstall the mod.\r<br />\r<br />Q: Where can I buy all the extra spells?\r<br />A: From various spell vendors. Expert and Master spells are only available in Winterhold. Also, if you are lucky, you might find some new books in random loot. \r<br /> \r<br /> Q: How did you add the extra spells to vendors and loot lists?\r<br />A: Dynamically via an MCM script. No more conflicts or looping distribution quests&#33;\r<br /> \r<br />Q: I can&#39;t see the new spellbooks in vendors&#39; inventories.\r<br />A: Make sure that 48 in-game hours have passed since you enabled the mod, checked the appropriate checkbox in the Mod Configuration Menu and your skills are of appropriate level. Master-level spells are not available until you complete the corresponding College of Winterhold quests.\r<br /> \r<br /> Q: Why is Tolfdir selling Candlelight, Magelight and Paralyze spell tomes? I thought they are Illusion now?\r<br /> A: He must be making an extra buck or two on the side. Seriously though, removing them from his inventory is not worth the trouble and potential conflicts.\r<br /> \r<br /> Q: I cannot get into Shalidor&#39;s Maze. I cast Magelight on the sigil, and nothing happens.\r<br /> A: Use the Staff of Magelight that you collected at the beginning of the maze.\r<br /> \r<br /> Q: Some spells look like they were nerfed a lot&#33; Why?\r<br /> A: What you are seeing is base magnitude of the spell. As your skill grows, so does the magnitude. And dual-casting produces an effect that is stronger yet. In most cases, the spell&#39;s magnitude tops out at 5 times its base magnitude when you reach skill level 100 and dual-cast the spell. And that&#39;s even before any helpful perks like Intense Flames.\r<br /> \r<br /> Q: Why all the changes to Transmutation?\r<br /> A: Because the vanilla approach was stupid. First of all, you are transmuting impure ore as opposed to (relatively) pure ingots. That runs contrary to basic &#34;lore&#34; of transmutation. Secondly, if the Dovahkiin, a relative nobody, can transmute iron into gold at will, every schmuck and court wizard would be doing it too; it doesn&#39;t take much to become an Adept of Alteration. Finally, the Iron-Silver-Gold transmutation is pretty specific - why can&#39;t you transmute Iron into Corundum? My system makes it necessary to invest extra funds into additional transmutation spells, and requires leveling up Alteration beyond Adept. However, it gives you a way to mass-transmute up to five ingots at once, and you can also transmute almost anything into anything once you learn all the spells.\r<br /> \r<br /> Q: OK, fine&#33; But why can&#39;t I transmute Steel or Dwemer Alloy?\r<br /> A: Because they are just that - alloys. Everything else is a naturally occurring element, but Steel and Dwemer Alloy are man-made (or mer-made). Science and magic do not mix. And nobody really knows how Dwemer Alloy is made, either. You cannot transmute something you don&#39;t understand.\r<br /> \r<br /> Q: The spell list says that Steadfast Ward has been replaced, but my character still has it in his spellbook&#33;\r<br /> A: Unfortunately, the vanilla Steadfast Ward is in use by many objects in the game, so replacing it would cause many problems. I renamed and repurposed the spellbook that teaches it, so a new character or a character who doesn&#39;t yet know this spell will never have a chance to learn it. But if your existing character already knows it, it will stay with you. If you really can&#39;t stand it, use the console to remove the spell.\r<br /> \r<br /> Q: So I already know a spell, but your spell list says that the spellbook that teaches it also teaches another spell. What do I do?\r<br /> A: Buy another copy of the spellbook and read it. It won&#39;t disappear, so if you&#39;re hard up for cash sell it back and recover some septims.\r<br />\r<br /> Q: Why are &#34;poison&#34;-type spells (Venom Fang, Walking Bomb) only available in Dragonborn?\r<br /> A: Because leave it to the Dunmer (and Mephala, with her arts of sex and murder) to twist Restoration into a weapon.\r<br /> \r<br />Q: I want to uninstall the mod. How do I do that?\r<br />A: Park your character somewhere safe, strip him naked, open console and type &#34;player.dispelallspells&#34;. Uncheck all checkboxes in MCM. Save in a new slot, quit Skyrim, uncheck and delete the ESPs.\r<br /> Q: I found a bug, what do I do?\r<br /> A: Email me at the address at the beginning of the readme.\r<br /> \r<br />Q: That quote in the beginning..?\r<br />A: No, not mine, of course. I&#39;ll let you find out where it came from on your own.\r<br />\r<br /> Q: Will you upload to Steam Workshop?\r<br /> A: No, and don&#39;t ask.\r<br /> \r<br /> Q: Can I re-upload the mod to other sites or translate the mod?\r<br /> A: Ask me first.\r<br /> \r<br /> Q: Can I retool the mod and re-release it or use parts of it in my own PUBLICALLY AVAILABLE mod?\r<br /> A: No, and don&#39;t ask.\r<br />\r<br />Q: R3@d1nG r h@rd&#33; Wh3re vidya?\r<br />A: No, reading is fun and educational, and videos are  a pain to make. If you feel like making a video for me, let me know and I may be able to include it.\r<br />\r<br />[color=black][i]A note about me (in case you bothered to read all this way down):\r<br />I am an old, jaded and sarcastic nerd with a dry sense of humor and a chip on my shoulder. My instructions are not perfect, but I mean what I write; if you choose not to read it, it is hardly my fault. I try very hard not to be the world&#39;s biggest bastard, but if you insist on embarrassing yourself because you can&#39;t be arsed to read what I write, I will gladly help you with that and embarrass you further. You have been warned.[/i][/color]",
  "categoryId": "93",
  "version": "4.15",
  "author": "Damar Stiehl",
  "createdUnix": "1332076013",
  "updatedUnix": "1420004742",
  "containsAdultContent": false,
  "uploadedBy": "DamarStiehl",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000131659",
      "name": "Mighty Magick Spell List",
      "version": "4.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "204",
      "fileName": "Mighty Magick Spell List-13166-4-0.zip",
      "uploadedUnix": "1413725207",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/e0b86eb26d60b2a59eee4ccef2176db92be736490450ece7d735cca3842fdfda/analysis/1413725284/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mighty%20Magick%20Spell%20List-13166-4-0.zip?fid=1000131659&ttl=1535775713&ri=8192&rs=8192&setec=25a200c32a8f936ca852c3463c656070"
    },
    {
      "fileId": "1000140780",
      "name": "Mighty Magick Skyrim 4.15",
      "version": "4.15",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2169",
      "fileName": "Mighty Magick Skyrim 4.15-13166-4-15.zip",
      "uploadedUnix": "1420004742",
      "modVersion": "4.15",
      "virusScanUrl": "https://www.virustotal.com/file/5bbd50795a0278c3969bff5a3d40e5846de07ecaa4f068460a4a9bf3fa1bc3d3/analysis/1420004763/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mighty%20Magick%20Skyrim%204.15-13166-4-15.zip?fid=1000140780&ttl=1535775714&ri=8192&rs=8192&setec=53deb9081f5ad2085658aa7fbd714009"
    }
  ]
}