{
  "modId": 13186.0,
  "modName": "Unlock Spell Modified",
  "summary": "A modfied version of willkydd\\'s Unlock Spell with different graphics and a more \\\"instant\\\" casting method that relies on your Alteration, Destruction and Lockpicking skills to unhinge locks.",
  "descriptionHtml": "I\\'ve been playing around with the Unlock Spell mod to get it to look the way I wanted to and work in a way that I think makes more sense skill-wise. \r\n\r\nThe spell can still be bought from Farengar or found next to the orc librarian at the College of Winterhold. The casting now appears more like a contact spell with the same range as Telekinesis. It is now an Expert level spell costing 170 Magicka. The spell takes into account up to 25 points from Destruction and Lockpicking and the remaining 50 points are calculated by halving your Alteration skill. So at 100 skill in Alteration and 25 in Destruction and Lockpicking you can open Master locks. \r\n\r\nNote: You cannot use this version of the Unlock Spell mod at the same time as willkydd\\'s as both modify the same entries.\r\n\r\nOptional files: For those of you who want the Unlock Spell to rely either solely on Alteration skill or a combination of Alteration and Destruction, optional script files are available. Simply overwrite the existing script files with your preferred version from the Optional Scripts folder..\r\n\r\nThe Alteration only script allows you to unhinge Master locks at 100 skill.\r\nThe Alteration and Destruction combination script allows you to unhinge Master locks at 25 Destruction skill and 100 Alteration skill (Alteration * 0.75).\r\n\r\nUpdate: Version 1.1 contains all optional scripts in one compressed file and all files and references within have been renamed. No other changes.\r\n\r\nCredit goes to willkydd for creating the original Unlock Spell mod. Thank you. I hope you like this modified version! :)",
  "categoryId": "75",
  "version": "1.1",
  "author": "arcanehost1",
  "createdUnix": "1332090596",
  "updatedUnix": "1332265714",
  "containsAdultContent": false,
  "uploadedBy": "arcanehost1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "45131",
      "name": "Unlock Spell Modified",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "68",
      "fileName": "Unlock Spell Modified-13186-1-1.zip",
      "uploadedUnix": "1332265714",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/02e59091339244da09f39508ca18ee92a7984f23a9ed953cf1813803ea17d2e4/analysis/1406769813/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unlock%20Spell%20Modified-13186-1-1.zip?fid=45131&ttl=1535775757&ri=8192&rs=8192&setec=7962e34ca174343f054813bc674a6da6"
    }
  ]
}