{
  "modId": 13193.0,
  "modName": "Harness Resource",
  "summary": "Harness Resource ",
  "descriptionHtml": "I made some simple harnesses but try as I might I cannot get them to work with the weight slider, and as I have just started a new job it doesn\\'t look like I\\'ll have time to learn how.\r\n\r\nSo I thought I would make these models available to anyone who does want to put the time into adding some sexy sexy harnesses to the world of Skyrim.\r\n\r\nI am uploading a 3ds file with all 3 harnesses in it.  The have been unwrapped. And Fitted for CBBE V3.\r\n\r\nPlease enjoy these models and have fun.  I can\\'t wait to see what the community does with them.\r\n\r\nIf you want to change the models at all.\r\n\r\nI should also say that each harness in the 3DS File are one mesh, that is 3 harnesses = 3 meshes, should be obvious once you open the file.  I do all my modeling in Maya and export obj\\'s to 3DS to prep the Nif.  If you would like or need a version of the model were the straps and rings are distinct meshes send me a message and I\\'ll see what I can provide.\r\n\r\nAlso, why not.  I love to model. importing into Skyrim is fun, but I love to model.  If you have some image reference for a harness or something similar and would like someone to take a crack at modeling it let me know.\r\n\r\nProps to Nikitaa for the Dark Lilith armor.\r\n\r\nThanks Caliente, I mean it. Thank you so much.",
  "categoryId": "60",
  "version": "1",
  "author": "Armspree",
  "createdUnix": "1332095299",
  "updatedUnix": "1332095428",
  "containsAdultContent": true,
  "uploadedBy": "armspree",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44520",
      "name": "Harnesses",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "442",
      "fileName": "Harnesses-13193.7z",
      "uploadedUnix": "1332095428",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5094b470112c84f0953aaf68c6db2072100663015d956036d239b2d6f2eedfb1/analysis/1406766546/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harnesses-13193.7z?fid=44520&ttl=1535775765&ri=8192&rs=8192&setec=20e13526df861a83eb7db2c261dfdf3d"
    }
  ]
}