{
  "modId": 13217.0,
  "modName": "Dynamic City Development",
  "summary": "Complete overhaul of merchants and the way they restock in an attempt to create a some what fluxuating economy. Now player trading (and the lack of) effects every city/town merchant.",
  "descriptionHtml": "*UPDATE*---(3/18/2012)----Removed old files and uploaded fix for resell exploit and fix for debug notification I left in Beta. Next Version I\\'ll be adding a Ledger that will allow you to see how much the city has in its treasury. Allowing you to witness its growth due to your trade.\r\n\r\nThe purpose of this mod is to create a more dynamic and enriched economic atmosphere within the realm of \r\nSkyrim. This, its first version, provides a dynamic merchant inventory and gold supply that can only be improved\r\nupon by player trading. If you sell items to a merchant, that merchant then resells the item and makes a profit.\r\nIf you buy items from a merchant, the city takes a tax from the merchant\\'s sale and that goes to improve, slightly,\r\nall merchants in the city.\r\n\r\nFeatures\r\n-All City/Town merchant\\'s stock changes based on city growth\r\n-Growth is effected by player trading\r\n-Over time ALL merchants will slowly lose money without player intervention\r\n(So a merchant at 1000 gold on start, could very well end up with only 100 gold and a weak inventory \r\na few game months later if the player has neglected trade with them. 100G is the floor, there is no ceiling)\r\n-As of now there is no cap to merchant stock, one may be implimented in future depending on testing.\r\n-Merchant\\'s never magically \\\"lose\\\" their gold. If a merchant has 1000 gold today, they will have 1000 gold\r\ntwo days from now after they restock, minus the city\\'s taxes of course.\r\n\r\nThings you should Know\r\n-This is BETA so your feedback is critical, what needs to be adjusted/added/whatever. You can tell me it\\'s\r\nthe worst mod you\\'ve ever played if you\\'d like, I don\\'t care, just please come forward with suggestions.\r\n-All merchants inventory will be wiped upon game start of this mod, so as to create a baseline economy, so\r\nif you have any mods that change merchant\\'s inventory or gold they will not work with this mod.\r\n-All perks and skills that allow you to increase a vendors gold have been disabled, after all you should have\r\nto work to improve their store, not have it handed to you.\r\n-Any items or etc that will allow you to sell items at full value or close to will hurt the merchant and the\r\ncities economy, so I suggest you don\\'t use/wear them. After all I\\'ve never gotten anything free just because\r\nmy shirt is nice.\r\n-If you sell Items to merchant they will sell them within 30mins game time.(If this is too short it can be adjusted)\r\n-Don\\'t buy ReSellCounter\\'s from merchant, they need these in order to profit from selling things your sold to them.\r\n-If feedback is good and suggestions that would benefit this mod are made there will be other versions/features\r\n(Hopefully :))\r\n\r\nThings Expected of you\r\n-FEEDBACK! Let me know what you think. I can\\'t test this all by myself thoughly, so I need to know if you feel\r\nlike City A is growing to slowly or City B is impossible to maintain a healthy economy. Without you this mod \r\nis dead in the water. Your suggestions will be heard, and if implimented you will get an \\\"inspired by\\\" credit.\r\n-Enjoy! :)",
  "categoryId": "69",
  "version": "Beta001",
  "author": "Grudge",
  "createdUnix": "1332108849",
  "updatedUnix": "1332130379",
  "containsAdultContent": false,
  "uploadedBy": "Grudge",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44704",
      "name": "Dynamic City Devlopment Beta001",
      "version": "Beta002",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "55",
      "fileName": "Dynamic City Devlopment Beta001-13217-Beta002.7z",
      "uploadedUnix": "1332130379",
      "modVersion": "Beta002",
      "virusScanUrl": "https://www.virustotal.com/file/41b893243405d828158f020a29cd17b04fae4d3c9ddff0a5de7bb9fa1691ce3e/analysis/1406767507/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20City%20Devlopment%20Beta001-13217-Beta002.7z?fid=44704&ttl=1535775800&ri=8192&rs=8192&setec=6822514709d6a60f3c8bd02c6aa147d0"
    }
  ]
}