{
  "modId": 13219.0,
  "modName": "The Last Defeat of the Dragon Cult",
  "summary": "Delve deep into Laatviik, the anchient temple and fortress used by the very cult which served the dragons in ages long past. It is up to the Dragonborn to discover the power that still dwells here.",
  "descriptionHtml": "Delve deep into Laatviik, the ancient temple and fortress used by the very cult which served the dragons in ages long past. It is up to the Dragonborn to discover the power that still dwells here.\r\n\r\nThis is a medium/large dungeon located in the mountains far south of Helgen. The difficulty scales with your level, except for the final boss so at least level 20 is recommended. Care was taken to be lore-friendly and all backstory is delivered through in-game notes and books. \r\n\r\nFollowers should accompany you inside so Lydia can tag along for this one!\r\n\r\n=====  LORE SPOILERS BELOW =====\r\nAccording to legend, at the end of the great dragon war, a last contingent of the infamous dragon cult was sent to recover a weapon so powerful, it had been locked away; only for use in the more dire of needs. Fortunately for mankind, the cult was wiped out on the steps of the temple, and their powerful weapon was never put to use.\r\nMany ages later, the power hidden away in Laatviik once again stirs. It is the Dragonborn\\'s destiny to retrieve the great sword Hokoronal, they very weapon the cult hoped would turn the tide of the war.\r\n===== END SPOILERS =====\r\n\r\nPlease leave all bug reports and suggestions below, as I will be updating the mod as fixes/improvments become available. \r\n\r\n-----------------------------------\r\n\r\nKnown bugs:\r\nnone\r\n\r\nPossible upcoming additions:\r\nAccompanying questline to the dungeon\r\n\r\n-----------------------------------\r\n\r\nSteam workshop link: http://steamcommunity.com/sharedfiles/filedetails/?id=17076",
  "categoryId": "88",
  "version": "1.0",
  "author": "PaperBoat",
  "createdUnix": "1332110180",
  "updatedUnix": "1332110431",
  "containsAdultContent": false,
  "uploadedBy": "paperboat22",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44619",
      "name": "The Last Defeat v1_0",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "382",
      "fileName": "The Last Defeat v1_0-13219-1.zip",
      "uploadedUnix": "1332110431",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0745abc5090fa772c0b4f1e217cec0f0098cd13aa03a0b3d38a4850df6fbe716/analysis/1406767115/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Last%20Defeat%20v1_0-13219-1.zip?fid=44619&ttl=1535775805&ri=8192&rs=8192&setec=4e672a80fa2d85e09f2c137ee324d8b4"
    }
  ]
}