{
  "modId": 13216.0,
  "modName": "The Vampire FX Project Traduzione ITA",
  "summary": "Modifica drasticamente il gameplay del vampirismo.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/downloads/file.php?id=10898]original mod[/url].\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nThe Vampire FX Project is a WIP effects, ability, and gameplay improvement project for vampires.\r\nAll credits go to the creator of the original mod.[/color][/size]\r\n\r\n[color=red][b]ATTENZIONE![/b]\r\nQuesta è solo la traduzione italiana del mod originale che trovate [url=http://skyrim.nexusmods.com/downloads/file.php?id=10898]qui[/url].[/color][/center]\r\n\r\n[center][color=GREEN][size=+4]UNA TRADUZIONE DRAGONBORN ITALIA[/size][/color][/center]\r\n\r\n[center][img]http://static.skyrim.nexusmods.com/downloads/images/13216-2-1332108966.png[/img][/center]\r\n\r\n[color=green][b]DESCRIZIONE[/b][/color]\r\n\r\nStupenda Mod che migliora a più livelli la giocabilità del vampirismo, rendendo i vampiri molto più vicini a come ci si aspetta dovrebbero essere, in quanto Figli della Notte.\r\n\r\nNuove magie e poteri che assorbono sangue e \\\"nutrono\\\" il vampiro a tutti gli effetti.\r\n\r\nNuovi effetti sonori per le abilità.\r\n\r\nNuovo potere di Evocazione.\r\n\r\nTrasformazione in Nebbia, con possibilità di volare e attraversare oggetti solidi.\r\n\r\nPossibilità di controllare la mente degli NPC e prenderne il controllo diretto, agendo al suo posto e vedendo attraverso i suoi occhi.\r\n\r\nVelocità e danno di caduta ridotti.\r\n\r\nPossibilità di trasmettere il vampirismo ad altri NPC. \r\nSi, avete capito bene! Avete la possibilità di tramandare il vampirismo e tutto ciò che esso comporta come il danno da sole, progressione negli stadi vampirici e la possibilità di nutrirsi autonomamente (ma è ancora in versione BETA, quindi non abusatene).\r\n\r\nNuovi effetti magici.\r\n\r\nNuovi effetti disarmati e da mischia.\r\n\r\nCambio nome della propria razza in \\\"Vampiro\\\".\r\n\r\nNuova sequenza di morte per i vampiri, ora una volta uccisi si trasformano in cenere.\r\n\r\nAl 4°Stadio, se esposti alla luce solare la pelle prende letteralmente fuoco.\r\n\r\nGli altri vampiri sono alleati, e non vi attaccheranno.\r\n\r\nNessuna modifica agli script del vampirismo di base, per una COMPATIBILITA\\' TOTALE con altri mod che gestiscono l\\'avanzamento degli stadi del vampirismo.\r\n\r\n[color=green][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n[color=green][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!",
  "categoryId": "24",
  "version": "1.4",
  "author": "MisticoFaggio",
  "createdUnix": "1332108669",
  "updatedUnix": "1332108669",
  "containsAdultContent": false,
  "uploadedBy": "MisticoFaggio",
  "primaryFile": null,
  "files": []
}