{
  "modId": 13223.0,
  "modName": "CKs Might of the Legion -Truly Epic Battles for WARZONES-",
  "summary": "Adds in over 550 Imperial Legionnaires, a Legion Fort, Boat landing, Militarizes Solitude and much MUCH more. Ever want to lead your own Squad into epic battles? Now here is your chance!",
  "descriptionHtml": "This mod is an addon for WARZONEs and has been released with the kind permission of My Good Eye\r\n\r\nPlease leave a comment and Endorse if you like it!\r\n\r\n[color=green][size=6]Working perfectly! Updates will come when I have more time, so maybe in a week-3 weeks[/size][/color] \r\n\r\nWhen I was playing on my Stormcloak character I loved what the WARZONE mod did to make the game just come alive, but there where not enough Imperials for me to fight and the fights I joined in became utterly one-sided for me. I also thought the game just lacked immersion in how the Empire of Tamriel had no more then 15 troops in any given point, and how me(And this is a level 32 Archer with stormcloak gear..) and 1 companion could run from Windhelm to Solitude, kill every Imperial we see on the way, and then sack Solitude with little effort. This mod changes that! Oh does it fix that...Ever want to command a Group of Stormcloaks, lead your men into battles, and fight the Mighty Imperial Legion?! Now you can!\r\n\r\nThis mod places Legionaries and their encampments at strategic points in the map. I have posted Screenshots of one evening\\'s worth of battle so you can get a feel for what exactly this mod does.\r\n\r\nContents:\r\n- Adds in over 1850 STATIC leveled Imperial Legionnaires. I think \\\"Dynamic leveling\\\" destroys immersion and game-play, so all my Legionnaires are level 15. My mod creates its own NPCs called \\\"Imperial Legionnaire\\\", so don\\'t worry about it effecting NPCs from other mods.\r\n-Also adds in 100 Imperial Captains, these are level 25 with some extra health and with much better gear.\r\n-Adds in 14 Imperial Justicars to Solitude. These elite troops are level 30 with flaming 2handers\r\n-Adds in General Cornelius Scipio to the Battle at Norman\\'s Hill. He Wields the powerful Fulger Securis\r\n-Adds in a Unique Hero Guard Lieutenant Thaddeus Durzo to Solitude, he has some very powerful custom gear.  \r\n-Adds Vice Admiral Grekas to the Imperial Landing point. He has some enchanted elven gear he got in the war fighting the Dominion. \r\n-Adds in Major Antonius Dezmeridian to the Imperial Camp. Has 2 custom made weapons! \r\n-Adds in Major Quintus Caecilius to the Imperial Forward Landing. Has a custom made ring.\r\n \r\n\r\n-Places a massive Garrison at Dragon\\'s Bridge.\r\n-Places a Massive Garrison Outside of and Inside Solitude\r\n-Places a Very Massive Garrison at the Imperial Legion Fort outside of Roariksted\r\n-Adds the massive Battle of Norman\\'s Hill, see Pictures for location\r\n-Adds the Battle of Hjorjiir\\'s Slope, see Pictures for loacation\r\n-Places a Large Garrison at the Imperial Legion Camp in the Tundra\r\n-Places a Medium(Around 40) troops at the Imperial Landing\r\n-Places a Medium Patrol just north of Falkenreth\r\n-Adds Several Small battles between Stormcloaks and Imperials, with Imperials having a large advantage\r\n-Adds several patrols(Around 10-14 troops each) in Strategic locations throughout the map, all on the Imperial owned side\r\n-Adds several Smaller groups of Legionaries throughout the map as well\r\n\r\n\r\nOther notes:\r\n I actually had intended for this mod to be only for my personal use, but I have just been having so much fun with it that I thought I\\'d load it to the Nexus and share it with all of you. I plan on expanding it, but for now consider it done. DL it and give a whirl and tell me what you think! I am open to suggestions and improvements.  I have thoroughly play tested this mod should have no bugs, but if you encounter any please let me know :). \r\n \r\nRight now this mod only adds Imperials, if enough people want me to make a \\\"Might of the Stormcloaks\\\" mod that adds in tons of Stormcloaks to fight I\\'ll do it at some point, I already plan on making one for my own personal use..eventually ;). \r\n\r\nMount and Skyrim?: \r\nHow I have been having a blast is using the More Follower mod grabbing 10 followers, dressing them up as stormcloaks and running into Imperial territory and fighting their Squads. Its been amazingly fun. I also have my own companion mod that adds in 12 companions. The companion\\'s in my companion mod are far superior to other companions in that they all have a full set of relevant perks for there class. When your fighting 70 Imperials with 10 men, you cant afford to have your allies suck. Other then that, they all level with you and fill many different \\\"Archetypes\\\", like Tank, Ranged DPS, Magic DPS, Melee DPS, healer ect ect haha. If you say I play to many MMO\\'s your right ;p, but it makes for REALLY fun Skyrim play. I am going to upload my Companion mod right after this one. Its just a blast leading your men into the fray when your outnumbered 4:1 or greater.\r\n\r\nThis mod could also be fun for people who have stupid OP characters and want to see how many legions of legionnaires it takes to take them down(Assuming they do indeed kill you), hahah\r\n\r\nCompatibility:\r\n\r\nThis mod is a addon to WARZONES - Civil Unrest, and requires it to run(It may work without it, haven\\'t tried). But needless to say, it is completely compatible with WARZONEs.\r\n\r\nI run with over 70 mods and this mod has no conflicts, so you should be fine no matter what else you run. \r\n\r\nRequire mods:\r\nWARZONES by My Good Eye: http://skyrim.nexusmods.com/downloads/file.php?id=9494\r\n\r\n[color=red][size=8]Other Mods by me![/color][/size]\r\n\r\nCKs Improved Windhelm: http://skyrim.nexusmods.com/downloads/file.php?id=15796\r\nAn awesome mod that brings Windhelm to life by adding in 4 new shops, cleans up the streets, and many more improvements! Give it a shot and tell me what you think! \r\n\r\nCK\\'s Companion mod: http://skyrim.nexusmods.com/downloads/file.php?id=13228\r\nAll these companions have perks, level with you, and have weapons that allow them to actually dual wield. Its an awesome mod, go check it out if you need some solid troops! \r\n\r\n\r\n",
  "categoryId": "77",
  "version": "1.05",
  "author": "CrimsonKing158758",
  "createdUnix": "1332112511",
  "updatedUnix": "1334131457",
  "containsAdultContent": false,
  "uploadedBy": "Crimsonking158758",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44636",
      "name": "CKs Might of the LegionOld",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "157",
      "fileName": "CKs Might of the LegionOld-13223.7z",
      "uploadedUnix": "1332112629",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d184c2bc74d783c19c3947d5dc03bb322d4fec7b30159725f16371ff39bbae55/analysis/1406767160/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CKs%20Might%20of%20the%20LegionOld-13223.7z?fid=44636&ttl=1535775811&ri=8192&rs=8192&setec=1912b7f0e408874f708cda152fa161f5"
    },
    {
      "fileId": "44697",
      "name": "CKs Might of the Legion V1-01Old",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "157",
      "fileName": "CKs Might of the Legion V1-01Old-13223.7z",
      "uploadedUnix": "1332129058",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/d184c2bc74d783c19c3947d5dc03bb322d4fec7b30159725f16371ff39bbae55/analysis/1406767451/",
      "changelogHtml": " Slimmed down on NPCs in the fort a bit, for performance reaspons <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CKs%20Might%20of%20the%20Legion%20V1-01Old-13223.7z?fid=44697&ttl=1535775812&ri=8192&rs=8192&setec=ffbf4a888ec0c4a7974d4370b5b4c622"
    },
    {
      "fileId": "44847",
      "name": "CKs Might of the Legion V1-02Old",
      "version": "1.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "214",
      "fileName": "CKs Might of the Legion V1-02Old-13223.7z",
      "uploadedUnix": "1332180970",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/53e3ff0763c9ccaa25167ee41f93af5f2ae2d1441d7e1ba5c4792e0d8594a0f6/analysis/1406768178/",
      "changelogHtml": " Added more NPCs to the Imperial Reach and Hjaal Marsh Warcamps <br/> \n Slight boost to Legionaire and Imperial Captain HP and stats <br/> \n Adds a Imperial Roadblock on a previously unguarded road to Malikarth <br/> \n Added a Squad to guard Karathwasten from the Forsworn <br/> \n Made Thaddeus Durzo\\'s Weapon much better <br/> \n Removed the Imperial Legion Fort map marker from showing up w/o being visited, this is the hardest garison next to solitude, bad place to start ;p <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CKs%20Might%20of%20the%20Legion%20V1-02Old-13223.7z?fid=44847&ttl=1535775812&ri=8192&rs=8192&setec=1a5af0c348da7669456d9b59752e4fc0"
    },
    {
      "fileId": "45179",
      "name": "CKs Might of the Legion V1-03Old",
      "version": "1.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "298",
      "fileName": "CKs Might of the Legion V1-03Old-13223.7z",
      "uploadedUnix": "1332276599",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/15cd707e69306c9014524cbd245e0ad74f47405273031dbf428617b1aa892a1c/analysis/1406770272/",
      "changelogHtml": " Added the Imperial Legion Camp with a Large Garason. It is in the tundra, will poast SS for location <br/> \n Added a new Hero, Major Antonius Dezmeridian, to lead the Garason at the encampment <br/> \n Added a few random small patrols guarding some key points <br/> \n Added more Legionaires to the Falkenrath and Whiterun Imperial camps  <br/> \n Made Thaddeus Durzo\\'s gear better. Made Ageis of Dominion much better, gave him the Facta non Verba, and another boost to Fang of the Empire. He should now be able to give even high level characters a challenge! <br/> \n Changed Thaddeus Durzo\\'s spawn point to be in the Castle Dower courtyard, as oppsed to the old one in the Blue Palace courtyard. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CKs%20Might%20of%20the%20Legion%20V1-03Old-13223.7z?fid=45179&ttl=1535775812&ri=8192&rs=8192&setec=16fce032b6fac72ea4f21d5da1f7665a"
    },
    {
      "fileId": "47483",
      "name": "CKs Might of the Legion V1-04",
      "version": "1.04",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "429",
      "fileName": "CKs Might of the Legion V1-04-13223.7z",
      "uploadedUnix": "1332888019",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/11570bea04448ae0843cb9d43fd1aefbfd43df8d47eeab8b1e354d82bf3316e4/analysis/1406783284/",
      "changelogHtml": " Added The Battle of Hjorjiirs slope <br/> \n Added The Battle of Normans Hill, a massive fight between Imperials and stormcloaks <br/> \n Added General Scipo to the battle of Normans Hill <br/> \n Added a unique weapon to the game, General Scipos Ax <br/> \n Added in the Imperial Forward Landing <br/> \n Added more random battle between Imperials and stormcloaks <br/> \n Added Major Qunitus to command the Imperial forward landing <br/> \n Corrected spelling errors <br/> \n Added a unique item to Major Quintus <br/> \n Unique Heros no longer respawn <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CKs%20Might%20of%20the%20Legion%20V1-04-13223.7z?fid=47483&ttl=1535775813&ri=8192&rs=8192&setec=a3dc4bdf2d04e622e93b4c180bae890f"
    },
    {
      "fileId": "47713",
      "name": "CKs Might of the Legion V1-04 Leveled",
      "version": "1.04",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "429",
      "fileName": "CKs Might of the Legion V1-04 Leveled-13223.7z",
      "uploadedUnix": "1332955873",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/b841e042e1c0936c268815745ab395b91ddc1d69c6c7ca9c314fd4f09c56037e/analysis/1406784423/",
      "changelogHtml": " Added The Battle of Hjorjiirs slope <br/> \n Added The Battle of Normans Hill, a massive fight between Imperials and stormcloaks <br/> \n Added General Scipo to the battle of Normans Hill <br/> \n Added a unique weapon to the game, General Scipos Ax <br/> \n Added in the Imperial Forward Landing <br/> \n Added more random battle between Imperials and stormcloaks <br/> \n Added Major Qunitus to command the Imperial forward landing <br/> \n Corrected spelling errors <br/> \n Added a unique item to Major Quintus <br/> \n Unique Heros no longer respawn <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CKs%20Might%20of%20the%20Legion%20V1-04%20Leveled-13223.7z?fid=47713&ttl=1535775813&ri=8192&rs=8192&setec=9c2bc7ff093c3dd307acce1fbee2ad0e"
    },
    {
      "fileId": "52187",
      "name": "CKs Might of the Legion V1-05 Updated",
      "version": "1.05",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "717",
      "fileName": "CKs Might of the Legion V1-05 Updated-13223.7z",
      "uploadedUnix": "1334131457",
      "modVersion": "1.05",
      "virusScanUrl": "https://www.virustotal.com/file/cad19ec91473ac0583fb10fca918698a5e6a7a15f63cbf3e7ac585624672b49a/analysis/1406809055/",
      "changelogHtml": " Added in the massive Fort Tristan, between Dragon\\'s Bridge and Solitude <br/> \n Added in Fort SouthWatch, between helgen and Falkenrath <br/> \n Added in Fort Virgila, south of Whiterun <br/> \n Added in Fort Albana, some ways east of Dragon\\'s Bridge <br/> \n Added a Large Skrimish north of Whiterun <br/> \n Changed the Jewlry on Imperial Captians to be \\\"Imperial Captian\\'s Ring\\\" and \\\"Imperial Captian\\'s Meddalion\\\". Makes sense to me, and they make good war trophies! <br/> \n Added Luitenant Whilhelm Marx to command Fort Albana, he has some unique gear! <br/> \n Added Luitenant Major Trajan to command Fort Tristan, he has some unique gear and a large collection of trophies from the war with the Thalmor! <br/> \n Added Lord SImon Sinclaire, Luitenant Gregor Stern, and Luitenant Alex Maxwell to Fort Vigila This is a fight that should challenge even the highest leveled players! <br/> \n Added in a huge \\\"Morrowind Style\\\" vault of treasures in Lord Simon\\'s Room in Fort Vigila, for any who are powerful enough to slay him <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CKs%20Might%20of%20the%20Legion%20V1-05%20Updated-13223.7z?fid=52187&ttl=1535775814&ri=8192&rs=8192&setec=f5338c6be9a40f5d5683f3ae18986334"
    }
  ]
}