{
  "modId": 13224.0,
  "modName": "Scaled Armor Retexture",
  "summary": "A Retexture of the Scaled Armor, both Male and Female",
  "descriptionHtml": "\r\n\r\n[b][u]Description[/b][/u]\r\n\r\nAs any retexturing usually starts out, I loved the look of the Scaled Armor. It just fit with my play style, especially [url=http://skyrim.nexusmods.com/downloads/file.php?id=3994]once I found a mod[/url] that replaced the Leather Helmet with a hood. \r\n\r\nThe biggest drawback for me was the female cuirass. It was far too light for my taste. So, I set about changing this to suit my likes. I darkened the leather, changed the fur color a bit to reflect some fur pelts I\\'ve seen growing up (I grew up out in the country, so these things were fairly common). Then I tweaked the metal bits here and there, brightening some of the shinier bits here, darkening the designs there. Before long, I thought that it looked fairly good. So, I looked at the male cuirass. I played around with it as well. Then I started on the boots and gauntlets.\r\n\r\nI looked at it, and then remembered a guard in Falkreath saying, \\\"Scaled Armor, Huh? Shiny.\\\" Well, brown leather with a couple of accents didn\\'t look too shiny to me, so, I went back to Photoshop and changed the scales around. Now, they are metal, and \\\"Shiny.\\\"\r\n\r\nI keep waiting for a higher resolution version to come out in a finished state, but so far there are none that you could call finished. So, I thought that the community here might be interested in what I\\'ve done to fill the void until the more skilled texture artists among us can replace my work with something better. \r\n\r\n\r\n[b][u]Installation[/b][/u]\r\n\r\nDrag and Drop into your main data directory - the folder structure should sync up. Just like that. \r\n\r\n\r\n[b][u]Uninstallation[/b][/u]\r\n\r\nWe all know what files we want to delete by now, right?\r\n\r\n\r\n[b][u]Permissions[/b][/u]\r\n\r\nPlease, just be courteous. If you use it, give credit. Beyond that, I hope it give some of you guys ideas for your own works. \r\n\r\n\r\n[b][u]Thanks[/b][/u]\r\n\r\nBethesda, you\\'ve done it again! My grades, oh how they suffer . . . \r\n\r\n\r\nEnjoy!\r\n",
  "categoryId": "29",
  "version": "1.0",
  "author": "phoenixhunter1985",
  "createdUnix": "1332114276",
  "updatedUnix": "1332114361",
  "containsAdultContent": false,
  "uploadedBy": "phoenixhunter1985",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44641",
      "name": "Retexture",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5036",
      "fileName": "Retexture-13224-1-0.rar",
      "uploadedUnix": "1332114361",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1c2128727348f9beaa94efd90c4d42c6ac5b8fdb8ac397710ccb55c4151b9022/analysis/1406767164/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Retexture-13224-1-0.rar?fid=44641&ttl=1535775815&ri=8192&rs=8192&setec=cf7fbec241a3f0b6d24c8a8bf0d19a78"
    }
  ]
}