{
  "modId": 13228.0,
  "modName": "CKs Companions",
  "summary": "Adds 12 Companions to Whiterun. They all have perks and level with you!",
  "descriptionHtml": "Thank you for downloading this mod, I hope you all enjoy it as much as I have!\r\n\r\n[color=green]If you like it leave a comment and endorse! :)[/color]\r\n\r\n[color=red]As of now this mod has 2 required files, please DL those as well to have the mod work properly[/color] \r\n\r\nJust DL the 2 required mods(Which are awesome mods you should want anyway :) ), and this mod will work perfectly :D.\r\n\r\n\r\nWhat this mod does is add 11 new follower characters to Whiterun and 1 to the Honeybrew meadery. Whats unique about these characters is that they all come with relevant [color=red]PERKS[/color], and shouldn\\'t be useless to you like the normal companion. I also made some custom weapons for these characters. These companions also level with you up till level 80, so they should always be competitive \r\n\r\n2 of them are Vampires, and the rest are Nords/Imperials and Bretons \r\n\r\nI actually based a lot of them off past DnD characters or MMO toons, haha. The weapons I gave some of them make some of them very useful, or even OP lol(I play with my own homebrew More Imperial mod so it balances them out). But if you don\\'t like any weapons just store them away or put them on a wall and never touch them ;)\r\n\r\nNote about Behavior: I built all these characters using the CM companion\\'s tutorial, and they behave like they do. They will wonder around the area you dismissed them in instead of going back to where you found them. They also have clothes as their default outfit, so its easy to customize their gear. Just zone out of a region and there normal gear will equip by default.\r\n\r\nNote about Dual wielding: NPCs can only Dual Wield with a few swords in the game, due to Bethesda actually putting restrictions on most weapons. I made some weapons that copy the normal versions with the exception of this limitation. The weapons that I have modified are Kyouaku\\'s 2 enchanted blades, Claire\\'s Daggers, Cynthia\\'s Swords and Motoko\\'s swords. So if you want them to dual wield, don\\'t loose them ;p. \r\n\r\nNow onto Locations:\r\n\r\n- Malikath(Tanky 2h warrior) and Kyouaku(Heavy or light DW Offensive warrior) are in The Bannered Mare in Whiterun\r\n- Maxwell Steiner(Conjuration/spell-sword Vampire) and Cynthia(DW offensive Melee Vampire) are in the entry room of The Hall of the Dead, in Whiterun\r\n- Galatia(Pure Offensive Fire mage) and Alex Row(Balanced lightning/healing mage) are in Arcadia\\'s Potions, in Whiterun\r\n- Sir Walter(Tanky s/b warrior) and Sir Roland(Tanky Spellsword) are in Warmaiden\\'s, in Whiterun\r\n- Claire Du Mois(Ranger that DW\\'s daggers) and Motoko(Ranger that DW\\'s swords) are in The Drunken Huntsman, in Whiterun\r\n- Paladin Anderson(Tank speced healer) is in the main room in Dragon\\'s Reach, in Whiterun\r\n- Brettoel the Brewer(As/b or 2h tanky warrior) is in the Honey side Meadery, just outside of Whiterun\r\n   \r\n\r\n\r\nUnique Weapons:\r\nMalikath has the Contra Mundum, a great-sword with a powerful enchant that deals 15 frost damage, can stun for 2 seconds, damages 100 magicka and drains 10 stamina. It also has infinite charges. Tis a beast.\r\n\r\nKyouaku has 2 swords that each have a infinite absorb 10 health enchants on them, my attempt at mimicking a DoK From Warhammer Online, lol.\r\n\r\nClaire has a dagger that has a chance to paralyze for 2 seconds. It has infinite charges as well.\r\n\r\n[color=red][size=4]Required Mods[/size][/color]\r\n\r\nCM Companions: Needs this one to run, fantastic mod though :D http://skyrim.nexusmods.com/downloads/file.php?id=11669\r\n\r\nCoolism Hair pack(To get rid of the pink hair glitch): http://skyrim.nexusmods.com/downloads/file.php?id=4400\r\n\r\n[color=red]Other mods by me[/color]:\r\n\r\nCKs Improved Windhelm: http://skyrim.nexusmods.com/downloads/file.php?id=15796\r\nAn awesome mod that brings Windhelm to life by adding in 4 new shops, cleans up the streets, and many more improvements! Give it a shot and tell me what you think! \r\n\r\nCKs Might of the Legion -Truly Epic Battles for WARZONES- This mod is incompatible with the new version of warzones because of a switch from a ESM to a ESP, forgot about this one for now :)\r\n\r\n\r\n\r\n[color=green]The facial mods I use![/color] For those of us who want there companions to look just like mine. They also are just great mods to run IMO:\r\n\r\nBetter Females by Bella: http://skyrim.nexusmods.com/downloads/file.php?id=2812\r\nBetter Males, And I use the younger face version: http://skyrim.nexusmods.com/downloads/file.php?id=2488\r\n",
  "categoryId": "66",
  "version": "1.0",
  "author": "CrimsonKing158758",
  "createdUnix": "1332118548",
  "updatedUnix": "1332118697",
  "containsAdultContent": false,
  "uploadedBy": "Crimsonking158758",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44659",
      "name": "CKs Companions",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3231",
      "fileName": "CKs Companions-13228-1-0.7z",
      "uploadedUnix": "1332118697",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/521969c2208df84cba05ed11f1b8aa2f454ab6e40f2fa8857190951732c72e3d/analysis/1406767329/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CKs%20Companions-13228-1-0.7z?fid=44659&ttl=1535775820&ri=8192&rs=8192&setec=0c24a349bd3c71552d75f7dfd6ce6d77"
    }
  ]
}