{
  "modId": 13239.0,
  "modName": "Auto-save and time",
  "summary": "Custom auto-save triggers, situation-dependant variable TimeScales, in-game and real-world alarm clocks",
  "descriptionHtml": "[center][size=9][color=#ff9900]Auto-save and time[/color][/size][/center]\r<br />\r<br />[b]Version:[/b] 0.8 \r<br />[b]Date:[/b] 11 March 2014 \r<br />[b]Author:[/b] kuertee \r<br />[b]Source:[/b] [url=http://skyrim.nexusmods.com/mods/13239]http://skyrim.nexusmods.com/mods/13239[/url] \r<br />[b]Requirements:[/b] \r<br />[list] [*]Skyrim 1.9[/*] \r<br />[*]Skyrim Script Extender [url=http://skse.silverlock.org/]http://skse.silverlock.org/[/url][/*] \r<br />[/list] \r<br /> \r<br />[url=http://www.skyrimgems.com][img]http://i.imgur.com/yhzxU.png[/img][/url] \r<br /> \r<br />\r<br />Note that a copy of this document exists in the SkyrimDataDocs folder.\r<br />\r<br />[center][size=7][color=#ff9900]Short description[/color][/size][/center] \r<br />\r<br />Custom auto-save triggers, situation-dependant variable TimeScale, in-game and real-time alarm clocks. \r<br />\r<br />[center][size=7][color=#ff9900]Updates since last release (0.705):[/color][/size][/center] \r<br />\r<br />[list] [size=5][color=#ff9900]0.8, 11 March 2014[/color][/size][*]Tweak: HUD: The colour of the central motif indicates your vampiric stage. Its shade of red increases the greater your vampiric stage.[/*]\r<br />[*]New feature: userHUDVisibleFloatingQuestMarkers: Sets the visibility of the floating quest markers in the game world.[/*]\r<br />[*]New feature: userHUDVisibleCompassQuestMarkers: Sets the visibility of the quest markers in the compass.[/*]\r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Updating[/color][/size][/center] \r<br />\r<br />[list=1] \r<br />\r<br />[*]Simply deactivate and uninstall the previous version then install and activate this version. Note that you do not need to stop the mod in-game. If you do, you will lose your accumulated mod-specific data. Let the new version back-up the data of its old version, clean-up the old data (i.e. zero-out) by stopping itself, restart itself and restore the data of the old version.[/*] \r<br />\r<br />[*]If you have Sky UI&#39;s MCM, you can check the settings in Sky UI&#39;s MCM wihtin the game.[/*] \r<br />\r<br />[*]Or check the settings in &#34;DataInikuerteeAutoSaveAndTime.ini&#34;. If you change any of it, execute your changes by typing {bat &#34;inikuerteeAutoSaveAndTime.ini&#34;} (without the brackets) in the console.[/*] \r<br />\r<br />[*]After the update is finished, the message &#34;kuASAT v0.8&#34; will appear.[/*] \r<br />\r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Gameplay changes[/color][/size][/center] \r<br />\r<br />[size=5][color=#ff9900]Auto-saves:[/color][/size] \r<br />\r<br />A save file will be created every 2.5 minutes, at discovery of new location, after clearing a dungeon, at completion of a quest and when the player leaves the combat area. The files will be named autoSaveX, postCombatX, questCompletedX, newLocationX, dungeonClearedX. X will be a sequenced number from 1 to 10. \r<br />\r<br />If you wish to use default-named auto-save files, set userUseNativeSaves to True in the console by typing {SetPQV kuASATQ userUseNativeSaves True}, without the brackets. \r<br />\r<br />Note that when in the Load or Save windows, autoSaveX files will be listed like normal auto-saves. \r<br />\r<br />When using default-named auto-saves, I recommend increasing their number by setting this in your INI file (My DocumentsMy GamesSkyrimSkyrim.ini): \r<br />[SaveGame] \r<br />iAutoSaveCount=10 \r<br />\r<br />I recommend also disabling the game&#39;s default auto-save interval. You can do this by setting the auto-save interval to a large number in your INI file (My DocumentsMy GamesSkyrimSkyrim.ini): \r<br />[SaveGame] \r<br />fAutosaveEveryXMins=60.0000 \r<br />\r<br />Before a save is created, a subtle audio-cue is played. You can turn this off by setting userPreSaveAudioCue to False in the console by typing {SetPQV kuasat userPreSaveAudioCue False} without the brackets in the console. \r<br />\r<br />Note that there are no inherent differences between the custom-named files and the default-named save files. Custom- named files are like save files you create from the console by typing {save Y} where Y is the filename. Default-named auto-save files created by the mod are files created by the game when the Papyrus command, Game.RequestAutoSave (), is issued. Default-named manual save files are created by the game with the Papyrus command, Game.RequestSave (), is issued. \r<br />\r<br />Note that I built this mod off the back of my Oblivion mod Auto-save and Time. And until recently (20 Aug 2012), I didn&#39;t realise that Skyrim has a rare bug where it is constantly saving a game - immediately after you load a game. I did notice that in some of the games I load, the game will immediately do an auto-save. I thought nothing of it - until I saw this: http://youtu.be/N7MkbL8gSxk. I know that it is an old video and the problem may have been fixed inherently by Bethesda. But I still see an auto-save occur immediately after a load. So, it may be best to turn off the default game&#39;s auto-save triggers and interval and let the mod handle them. \r<br />\r<br />[size=5][color=#ff9900]Prompted saves:[/color][/size] \r<br />\r<br />You can optionally be prompted to save the game every number of seconds that userPromptedSaveInterval is set to. By default this is turned off - i.e. set to 0. \r<br />\r<br />When userUseNativeSaves is set to True (its default value), manual saves are named manualSaveX, where X is a sequenced number from 1 to 10. \r<br />\r<br />When userUseNativeSaves is set to False, the saves are created as if you had requested a new save file in the Save window. These default-named saves are safe from both the default auto-save cycle and the custom-named save cycle. \r<br />\r<br />Additionally, you can press B to show both the in-game time and real-time counters and the save prompts. \r<br />\r<br />[size=5][color=#ff9900]Variable TimeScale:[/color][/size] \r<br />\r<br />In combat, or while sneaking: 10 \r<br />\r<br />Indoors, wihtin city areas or when not moving when outdoors: 20 \r<br />\r<br />When travelling on roads: TimeScale increases up to 60 \r<br />\r<br />When travelling cross-country: increases up to 90. \r<br />\r<br />These features &#34;virtually&#34; increase the distance while travelling outdoors because more time will pass while travelling. Survival mods has more of an impact when TimeScale is set high. \r<br />\r<br />Note that this will also advance time quickly. If you have an eat and sleep mod, you may find having to manage it more often - if you are not used to higher-than-normal TimeScales. I suggest my own Eat and Sleep mod. It has an auto-eating and auto-drinking feature that removes the micromanagement of eating/drinking gameplay. \r<br />\r<br />[size=5][color=#ff9900]Immersive Wait:[/color][/size] \r<br />\r<br />You can temporarily increase the TimeScale to 20 times (by default) the current. Press Y (by default) to be presented with the Immersive Wait menu. Choose how long the TimeScale will be set at the increased value. Press Y, again, to revert the TimeScale. Note that entering combat or opening any of these menus will also revert the TimeScale: InventoryMenu, Dialogue Menu, BarterMenu, GiftMenu, Lockpicking Menu, Sleep/Wait Menu, Book Menu, Crafting Menu, Training Menu. \r<br />\r<br />[size=5][color=#ff9900]Immersive clock and time narratives:[/color][/size] \r<br />\r<br />Every 2.5 minutes, you will be notified of the time in-game and a &#34;time narrative&#34;. E.g.: &#34;It&#39;s 2 hours after the rising of the sun. You have been away from Whiterun for 3 days.&#34; The notification can show actual in-game time if you set userShowExactInGameTime to True. By default, it is set to False. E.g.: &#34;It&#39;s 2 hours after the rising of the sun (08:00).&#34; \r<br />\r<br />[size=5][color=#ff9900]Real-world alarm clock:[/color][/size] \r<br />\r<br />Every 10 minutes, you will be notified of how long you&#39;ve been playing for. E.g.: &#34;You&#39;ve been playing for 1:10 minutes.&#34; \r<br />\r<br />[size=5][color=#ff9900]Map[/color][/size]\r<br />\r<br />Hide the quest markers from the compass and/or game world by setting userHUDVisibleFloatingQuestMarkers and/or userHUDVisibleCompassQuestMarkers in the MCM, Ini or the console.\r<br />\r<br />Quest markers on the map are not removed because they are marks an adventurer would make on an actual map.\r<br />\r<br />[size=5][color=#ff9900]HUD[/color][/size]\r<br />\r<br />By default this clock HUD is always shown. Set when it is shown, which elements are shown, its location, and the key that displays it in the INI or MCM. The HUD is a 12-hour clock that shows the hour (day and night), the date of the month, the day of the week and the real-life time.\r<br />\r<br />The colour of the central motif indicates your vampiric stage. Its shade of red increases the greater your vampiric stage.\r<br />\r<br />[img]https://sites.google.com/site/kuertee/skyrim-clock.jpg[/img]\r<br />\r<br />[center][size=7][color=#ff9900]Details[/color][/size][/center] \r<br />\r<br />You can configure this mod with SkyUI&#39;s MCM or in the Console by typing &#34;SetPQV kuasatq {mod data} {value}&#34;. Below are the various mod data that you can change, their default values and a short description of their effects. \r<br />\r<br />userTimeScaleInCombat: default 10 \r<br />userTimeScaleWhileSneaking: default 10 \r<br />userTimeScaleIndoors: default 20 \r<br />userTimeScaleCities: default 20 \r<br />userTimeScaleOutdoorsWhenStopped: default 20 \r<br />userTimeScaleOutdoors: default 90 \r<br />userTimeScaleOutdoorsOnRoad: default 60 \r<br />TimeScale in different situations. Valid values are any positive number. Note that when outdoors and userTimeScaleOutdoorsWhenStopped is set and while travelling, the TimeScale increases by 1 up to either userTimeScaleOutdoors or userTimeScaleOutdoorsOnRoad. However, when stopped, in combat or while sneaking, TimeScale is static at configured value. \r<br />\r<br />userTimeScaleOutdoorsIncrement: default 1\r<br />This is the number TimeScale is increased by when moving outdoors. Increasing this will make time flow faster while moving outdoors.\r<br />\r<br />userAlarmClockInterval: default 600 seconds \r<br />A pop-up message will remind you of how long you&#39;ve been playing the game at the given interval. This value must be in seconds. The default of every 600 seconds is every 10 minutes. \r<br />\r<br />userInGameClockInterval: default 150 seconds \r<br />A message in the top-left corner of the screen will remind you of the time in-game at the given interval. This value must be in seconds. The default of every 150 seconds is every 2.5 minutes. \r<br />\r<br />userShowExactInGameTime: default False \r<br />Set this to True so that the actual in-game time is displayed with the &#34;immersive clock&#34;. \r<br />\r<br />userAutoSaveNewLocation: default True \r<br />userAutoSavePostCombat: default True \r<br />userAutoSaveQuestCompleted: default True \r<br />userAutoSaveDungeonCleared: default True \r<br />Auto-triggers. Set these to either True or False. \r<br />\r<br />userAutoSaveInterval: default 150 \r<br />Auto-save at these intervals. Set to 0 to turn this off. \r<br />\r<br />userPromptedSaveInterval: default 0 \r<br />Prompted save prompt intervals in seconds. Set to 0 to turn this off. \r<br />\r<br />userAllInOneKey: default 48 - B key \r<br />Shows both in-game time, real-time you&#39;ve spent in the game and a request to create a manual or an auto-save. More key codes are here: http://www.creationkit.com/Input_Script#DXScanCodes. \r<br />\r<br />userIncreaseTimeScaleKey: default 21 - Y key \r<br />Shows the Immersive Wait menu. \r<br />\r<br />userIncreaseTimeScaleFactor: default 20 \r<br />This is the factor normal TimeScale is multiplied by when Immersive Wait is active. \r<br />\r<br />userUseNativeSaves: default False \r<br />When False, the save files created are custom-named as autoSaveX, postCombatX, questCompletedX, newLocationX, dungeonClearedX, manualSaveX. When True, the save files are either default-named auto-save files or default-named manual save files. \r<br />\r<br />userNoTimeNarrativePopUps: default False \r<br />Some Time narratives show on pop-ups. Set this to False so that they appear on the top-left corner instead. Note that this is not the pop-up for the real-time alarm clock. \r<br />\r<br />userMaxSaveNumber: default 10\r<br />This DOES NOT limit your auto save files. Instead, it limits the counter that is added to the end of the filename. So, it will limit each auto-save type to the number you set.\r<br />\r<br />userShowHUDMode = 2\r<br />0 = Don&#39;t show. 1 = On the hour or on key-press. 2 = Always (default). 3 = On key-press only.\r<br />\r<br />userHUDShowRealTimeHand = True\r<br />Display real-time hand.&#34;\r<br />\r<br />userHUDShowMonthlyClock = True\r<br />Display game-time monthly lock.\r<br />         \r<br />userHUDLocation = 5\r<br />0 = Top. 1 = Top-right. 2 = Right. 3 = Bottom-right. 4 = Bottom. 5 = Bottom-left. 6 = Left. 7 = Top-left.\r<br />\r<br />userHUDLocationXAdj = 50\r<br />X (horizontal) adj of HUD location.\r<br />\r<br />userHUDLocationYAdj = -50\r<br />Y (vertical) adj of HUD location.\r<br />\r<br />userHUDKey = 49\r<br />Show HUD key. &#34;N&#34;\r<br />\r<br />userHUDVisibleFloatingQuestMarkers = False\r<br />Sets the visibility of the floating quest markers in the game world.\r<br />\r<br />userHUDVisibleCompassQuestMarkers = False\r<br />Sets the visibility of the quest markers in the compass.\r<br />\r<br />\r<br />A configuration file (datainikuerteeAutoSaveAndTime.ini) is provided with the relevant console commands. If you want to change any of the default values above, change them in the INI file then run the file by typing {bat &#34;inikuerteeAutoSaveAndTime.ini&#34;} (without the brackets) in the console. You only need to do this when you want to change the values of the property. Your changes will be saved in your game. \r<br />\r<br />[center][size=7][color=#ff9900]Install[/color][/size][/center] \r<br />\r<br />[list=1] \r<br />\r<br />[*]Use Wrye Bash (http://skyrim.nexusmods.com/downloads/file.php?id=1840) to install this mod. Just drag the package (which is a normal ZIP file) into Wrye Bash&#39;s Installers tab. However, the package is only a normal ZIP file, so if you know the game&#39;s mod file structure, install it manually.[/*] \r<br />\r<br />[*]Change your settings within the game in Sky UI&#39;s MCM or check the settings in &#34;DataIni&#34;. If you change any of it, execute your changes by typing in the console {bat &#34;inikuerteeAutoSaveAndTime.ini&#34;} without the brackets.[/*] \r<br />\r<br />[*]Activate the mod.[/*] \r<br />\r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Uninstall[/color][/size][/center] \r<br />\r<br />[list=1] \r<br />\r<br />[*]In the console, type &#34;SetPQV kuASATQ uninstallNow True.&#34; Or with Sky UI&#39;s MCM, set the uninstallNow toggle to True then exit the menus.[/*] \r<br />\r<br />[*]Wait for a message confirming the uninstallation. Save the game.[/*] \r<br />\r<br />[*]Deactivate the mod with Wrye Bash. If you installed this manually, simply delete all the files you installed. (Wrye Bash keeps track of files used, so installing/uninstalling the mod with it is 100% simpler.)[/*] \r<br />\r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Troubleshooting[/color][/size][/center] \r<br />\r<br />[list] [*]You can reset the mod by typing {SetPQV kuASATQ resetNow True} (without the brackets) in the console. Or with Sky UI&#39;s MCM, set the resetNow toggle to True then exit the menus.[/*] \r<br />[*]When it resets it will ask you either reset all of its data or continue with the current data. Resetting all its data will remove all your configurations and set the mod as if you have first installed it.[/*] \r<br />[*]You can check all the mod&#39;s data by typing {SQV kuASATQ} in the console. You can check if your configurations were set in the mod properly with this.[/*] \r<br />[*]If you find that your changes (with the command SetPQV or from executing the INI) do not appear in the mod, check the command again for spelling errors. Then try again.[/*] \r<br />[*]If you find that resetting (with resetNow) and uninstalling (with uninstallNow) don&#39;t seem to work, the mod may have been suspended. It is best to simply start-over (i.e. reinstall the mod) after a &#34;clean&#34; save.[/*] \r<br />[/list]\r<br />\r<br />[size=5][color=#ff9900]Creating a clean save:[/color][/size]\r<br />\r<br />[list=1] \r<br />\r<br />[*]If you can, uninstall the mod from the console with {SetPQV kuASATQ uninstallNow True}.[/*] \r<br />\r<br />[*]Wait for the mod to confirm the uninstallation. It may take a minute. If no confirmation appears, then simply continue to the next step.[/*] \r<br />\r<br />[*]Save the game manually from the console by typing {save uninstalledMod}.[/*] \r<br />\r<br />[*]Uninstall all the mod&#39;s files (*.ESP, *.PSC, *.PEX) from the game folders. Make sure that none of the mod&#39;s Scripts are left. A mod manager like Wrye is best used for this.[/*] \r<br />\r<br />[*]Load the &#34;uninstalledMod&#34; save.[/*] \r<br />\r<br />[*]Save the game manually again from the console by typing {save cleanSave}. Because all of the mod&#39;s files were removed, all of its data will be &#34;zeroed&#34; in this game.[/*] \r<br />\r<br />[*]Play from this game.[/*] \r<br />\r<br />[/list] \r<br />\r<br />[size=5][color=#ff9900]Script logging[/color][/size]\r<br />\r<br />[list]\r<br />[*]As a last resort, you can also enable script logging and investigate the &#34;DocumentsMy GamesSkyrimLogsScriptPapyrus.0.log&#34; file and/or send them to me. Contact me first either on TESNexus or the official Bethesda forums.[/*]\r<br />[*]To enable script logging, set bEnableLogging, bEnableTrace and bLoadDebugInformation in the Skyrim.INI file. More information about this is in this thread in the official Bethesda Creation Kit Forum: [url=http://forums.bethsoft.com/topic/1345130-having-papyrus-trouble-here-are-some-things-to-try/] http://forums.bethsoft.com/topic/1345130-having-papyrus-trouble-here-are-some-things-to-try/[/url].[/*] \r<br />[*]Then you can set the mod&#39;s specific log operations by setting debugMode to 1 in its MCM.[/*]\r<br />[*]Play the game for 5 minutes or so - enough time for the game to capture enough events.[/*]\r<br />[*]If your logs contain &#34;Suspended stack count is over our warning threshold, dumping stacks:&#34;, then your game is suffering badly. I&#39;ve written a guide on how to clean your game and recover from it in Bethesda&#39;s official forums: [url=http://forums.bethsoft.com/topic/1481687-suspended-stack-count-is-over-our-warning-threshold/]http://forums.bethsoft.com/topic/1481687-suspended-stack-count-is-over-our-warning-threshold/[/url].[/*]\r<br />[*]Then send the the &#34;DocumentsMy GamesSkyrimLogsScriptPapyrus.0.log&#34;, &#34;DocumentsMy GamesSkyrimLogsScriptUserkuASATQs.0.log&#34; to kuertee@gmail.com.[/*]\r<br />[/list]\r<br />\r<br />[center][size=7][color=#ff9900]History[/color][/size][/center] \r<br />\r<br />[list] [size=5][color=#ff9900]0.705, 28 December 2013:[/color][/size][*]New feature: HUD. By default this HUD is always shown. Set when it is shown, which elements are shown, its location, and the key that displays it in the INI or MCM. The HUD is a 12-hour clock that shows the hour (day and night), the date of the month, the day of the week and the real-life time.[/*]\r<br />[*]Tweak: Pop-ups while the any menu is open is delayed until the menu is closed.[/*]\r<br />[*]Tweak: Previously, the mod will try to save while the Dialogue menu is open. The save operation fails. In this version, all save operations are delayed when any menu is open.[/*]\r<br />[*]Bug fix: When finishing combat, the previous version will save the game even if you enter a new combat session. In this version, this save operation is delayed until after the new combat session.[/*]\r<br />[*]Tweak: Guild houses and player homes are now recognised by the Time narratives as locations.[/*]\r<br />[size=5][color=#ff9900]0.704, 10 July 2013:[/color][/size][*]Tweak: You can now change user settings before the main quest is at stage 5 (e.g. before leaving Helgen).[/*]\r<br />[size=5][color=#ff9900]0.703, 30 June 2013:[/color][/size][*]Bug fix: Fixes to the MCM&#39;s ping-back code - again. This will be the last time this bug will resurface - I hope. I found another instance when the RegisterForModEvent () for the ping-back is not registered or loses its registration in the previous version.[/*]\r<br />[size=5][color=#ff9900]0.702, 30 June 2013:[/color][/size][*]Tweak: Some saves were still occuring too soon after a previous save.[/*]\r<br />[*]Bug fix: The time narrative, &#34;You have been away from X city for Y days.&#34;, was incorrectly reporting 1 too many days. Also the narrative for &#34;You have been in the city for Y hours.&#34; had the incorrect amout of hours if you passed through the city, return after a few hours and entered a building. Previously, it counted the hours including when you first passed through - instead of when you entered in the last instant.[/*]\r<br />[*]Bug fix: Fixes to the MCM&#39;s ping-back code - again.[/*]\r<br />[size=5][color=#ff9900]0.701, 16 June 2013:[/color][/size][*]Tweak: When the MCM &#34;pings&#34; the main mod (to check if it has not stalled), it will wait for the &#34;ping-back&#34; for 60 seconds. Previously this was 10 seconds. In normal play, the ping-back only takes a fraction of a second. But during initialisation on a clean install or an update to a new version, the main mod would not have been set-up to listen for the ping from the MCM yet - which causes the MCM&#39;s ping-back test to fail and then presenting it&#39;s &#34;stalled message&#34;. In this version, I&#39;ve increased the time the MCM waits for the ping-back to 60 seconds.[/*]\r<br />[size=5][color=#ff9900]0.7, 15 June 2013:[/color][/size][*]Tweak: Added the 5-second delay between an event and the auto-save for when the audio cue is not used. Previously, the delay was present only when the audio cue was used.[/*]\r<br />[*]Tweak: The main package and the MCM can now be merged manually (with TES5Edit). Removing the reliance on GetFormFromFile () from the MCM discovery code made this possible. In this new version, SendModEvent () is used by the main package and the MCM to &#34;ping&#34; each other.[/*]\r<br />[size=5][color=#ff9900]0.636, 30 April 2013:[/color][/size][*]New feature: userTimeScaleOutdoorsIncrement: Default 1. This is the number TimeScale is increased by when moving outdoors. Increasing this will make time flow faster while moving outdoors.[/*]\r<br />[*]Tweak: Recompiled the main mod with Skyrim&#39;s 1.9 patch and the MCM component with SkyUI&#39;s 3.4 patch.[/*]\r<br />[*]Compatibility: Previously, when in a special form (e.g. Vampire Lord or Werewolf), the script failed. It resumed when the player reverted back.[/*]\r<br />[*]Tweak: Increased the number of detected &#34;road objects&#34; from 74 to 175 that are used for detecting if the player is near a road or not.[/*]\r<br />[*]Tweak: You have to be in combat for about 3 seconds before the combat TimeScale is used. This is so that TimeScale is not immediately changed in case your opponent stops combat immediately after he enters combat - e.g. when my Fight or Fly mod is used.[/*]\r<br />[size=5][color=#ff9900]0.633, 13 February 2013:[/color][/size][*]Tweak: userNoTimeNarrativePopUps: Some Time narratives show on pop-ups. Set this to True so that they appear on the top-left corner instead. Note that this is not the pop-up for the real-time alarm clock.[/*]\r<br />[size=5][color=#ff9900]0.632, 12 February 2013:[/color][/size][*]Tweak: Time narrative: Dark Brotherhood Sanctuary is now a town/city.[/*]\r<br />[*]Bug fix: The key-presses weren&#39;t getting detected when you were sitting down.[/*]\r<br />[*]Bug fix: Time narrative: Now detects fast travelling between cities.[/*]\r<br />[size=5][color=#ff9900]0.631, 2 January 2012:[/color][/size] [*]New feature: Time narrative. E.g. &#34;You have been away from Solitude for X days.&#34;, &#34;You have been riding from Solitude for X hours.&#34;, etc. Set userShowExtraTimeNarrative To False to turn this off. When True, these only show after an amount of time has passed that makes it relevant. E.g. Being away from a city for more than 24 hours. Set userAlwaysShowTimeNarrative so that they appear regardless of this amount of time. E.g. You&#39;ve been away from Solitude for 2 hours.[/*] \r<br />[*]New feature: Similar to the Oblivion version of this mod, TimeScale in cities and towns (i.e. those with the keyword LocTypeCity or LocTypeTown) is set to 20. You can change this setting the value of userTimeScaleCities. You can revert back to the previous behaviour (of the TimeScale increasing while outdoors when in cities) by setting this to 0.[/*] \r<br />[*]New feature: Immersive Wait. You can temporarily increase the TimeScale to 20 times (by default) the current. Press Y (by default) to be presented with the Immersive Wait menu. Choose how long the TimeScale will be set at the increased value. Press Y, again, to revert the TimeScale. Note that entering combat or opening any of these menus will also revert the TimeScale: InventoryMenu, Dialogue Menu, BarterMenu, GiftMenu, Lockpicking Menu, Sleep/Wait Menu, Book Menu, Crafting Menu, Training Menu. Thanks to Lithium Flower for the suggestion.[/*] \r<br />[*]Tweak: Some cave systems that feel like they should be an interior cell are tagged as exterior - triggering the exterior TimeScale. In this version, GetSkyMode () is used in these cells and when it is not set to 3 (full sky), the interior TimeScale is used. Note that this is still not 100% accurate. Some of these cave systems still return a sky mode of 3.[/*] \r<br />[*]Bug-fix: In previous versions, the manual save options, real-time alarm clock, and in-game time clocks were showing during combat.[/*] \r<br />[*]New feature: SkyUI&#39;s MCM (Mod Config Menu) support. The configuration tool is a separate download from my mod&#39;s Nexus files section. It requires Sky UI&#39;s beta 3 version or better which can be downloaded from Sky UI&#39;s thread in Bethesda&#39;s official Skyrim mods forum: http://forums.bethsoft.com/forum/183-skyrim-mods/[/*] \r<br />[*]Tweak: Better key-presses handler. You only need to tap the key once. In previous versions, you needed to hold it down until the menu was open.[/*] \r<br />[*]Tweak: Better handling of While...EndWhile loops when the game first loads or when the mod is uninstalling.[/*] \r<br />[*]Tweak: Removed the internal code for OnMenuMode since it is not required.[/*] \r<br />[size=5][color=#ff9900]0.619, 29 November 2012:[/color][/size] [*]Bug fix: TimeScale lower than 20 was getting set to the game&#39;s default of 20 when you are not moving outdoors rather than the TimeScale that you have set.[/*] \r<br />[*]Tweak: Changed the priority of saves to: quest completion, new location, dungeons cleared, post-combat then auto-save. With the previous order, the post-combat saves were taking over the others because it occured too often.[/*] \r<br />[*]Tweak: Previously, the all-in-one user key was resetting the clock timers so the next message and alarm were counting from the time it was pressed.[/*] \r<br />[size=5][color=#ff9900]0.618, 22 November 2012:[/color][/size] [*]New feature: Before a save is created, a subtle audio-cue is played. You can turn this off by setting userPreSaveAudioCue to False by typing in the console {SetPQV kuasat userPreSaveAudioCue False} without the brackets.[/*] \r<br />[*]New feature:Turn off all TimeScale options by setting userUseTimescales to False by typing {SetPQV kuasatq userUseTimescales False} without the brackets in the console. By default this is set to true. Note that as in previous versions, you can always select which feature you do not want to use by setting its value to 0. This new feature is provided as a simple way to disable all TimeScale options.[/*] \r<br />[*]Tweak: In previous versions, consecutive saves were prevented by delaying the next check for a required save by 5 seconds after a save operation. Since that only delayed the next check, 5 seconds after a save opertion another save could be created because the check determined it needed another one. In this version, those checks were still queried but any required save 5 seconds after a previous save operation are simply ignored. This better prevents the double-up of save operations.[/*] \r<br />[*]Tweak:Previously, using a crafting station will set the TimeScale back to Skyrim&#39;s default of 20. In this version it will either use userTimeScaleIndoors or userTimeScaleOutdoorsWhenStopped (or userTimeScaleOutdoors if you&#39;re not using the increasing outdoor TimeScales feature).[/*] \r<br />[*]Read-me tweak: Changed references to userShowTimesKey to userAllInOneKey - which is the correct variable.[/*] \r<br />[size=5][color=#ff9900]0.616, 8 November 2012:[/color][/size] [*]New feature: You can choose the in-game clock to show the actual in-game time by setting userShowExactInGameTime to True. By default, this is set to False.[/*] \r<br />[*]New feature: Prompted saves: By default, every 15 minutes real-time will prompt you to save the game. You can choose to save it as part of the auto-save cycle, to create a new normal save or to not save the game at this time. &#34;Normal&#34; saves do not have the label &#34;Auto&#34; and are safe from auto-save cycle. Change the default interval by changing userPromptedSaveInterval in INI.[/*] \r<br />[*]New feature: Press B to show both in-game time and the time you&#39;ve spent in the game. And press N to show the Prompted Save dialogue box. You can change these keys by changing userAllInOneKey in the INI or in the console. Valid values for the different keys are here: http://www.creationkit.com/Input_Script#DXScanCodes.[/*] \r<br />[*]New feature: By default, all saves are now custom-named saves. The filenames are autoSaveX, postCombatX, questCompletedX, newLocationX, dungeonClearedX and manualSaveX where X is a sequenced number from 1 to 10. \r<br />Note that when in the Load or Save windows, autoSaveX files will be listed like normal auto-saves. Note that there are no inherent differences between the custom-named files and the default-named save files. Custom- named files are like save files you create from the console by typing {save Y} where Y is the filename. Default-named auto-save files created by the mod are files created by the game when the Papyrus command, Game.RequestAutoSave (), is issued. Default-named manual save files are created by the game with the Papyrus command, Game.RequestSave (), is issued.[/*] [size=5][color=#ff9900]0.603, 21 Aug 2012:[/color][/size] [*]Tweak: Post-combat-save-triggers and TimeScale-changes in regards to combat now work in regards to the player&#39;s immediate &#34;combat area&#34; - rather than whether they are simply in combat. This should address the problem when combat sticks on the player even when opponents are very far away - e.g. when you flee from them. Note that this will not actually stop combat and set the &#34;Is In Combat&#34; flag on the actors to false. This will simply trigger the auto-save and the TimeScale adjustment when the player leaves the combat area.[/*] \r<br />[*]Read-me tweak: You can increase the number of auto-save files your game uses by setting this in your INI file (My DocumentsMy GamesSkyrimSkyrim.ini): [SaveGame] iAutoSaveCount=10[/*] \r<br />[*]Read-me tweak: A configuration file (datainikuerteeAutoSaveAndTime.ini) is provided with the relevant console commands. If you want to change any of the default values above, change them in the INI file then run the file by typing {bat &#34;inikuerteeAutoSaveAndTime.ini&#34;} (without the brackets) in the console. You only need to do this when you want to change the values of the property. Your changes will be saved in your game.[/*] \r<br />[*]Read-me tweak: Note that I built this mod off the back of my Oblivion mod Auto-save and Time. And until recently (20 Aug 2012), I didn&#39;t realise that Skyrim has a rare bug where it is constantly saving a game - immediately after you load a game. I did notice that in some of the games I load, the game will immediately do an auto-save. I thought nothing of it - until I saw this: http://youtu.be/N7MkbL8gSxk. I know that it is an old video and the problem may have been fixed inherently by Bethesda. But I still see an auto-save occur immediately after a load. So, it may be best to turn off the default game&#39;s auto-save triggers and interval and let the mod handle them.[/*] \r<br />[size=5][color=#ff9900]0.5, 19 March 2012[/color][/size] [*]Initial release[/*] \r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Credits[/color][/size][/center] \r<br />\r<br />kuertee in http://www.bethsoft.com/bgsforums/ \r<br />\r<br />[center][size=7][color=#ff9900]Tools Used[/color][/size][/center] \r<br />\r<br />Creation kit - http://www.creationkit.com \r<br />\r<br />[center][size=7][color=#ff9900]Licensing/Legal[/color][/size][/center] \r<br />\r<br />You can do whatever you want with this mod but all I ask in return is that you give me credit. I would also like to be contacted when you include this mod in part or in full in a public release. ",
  "categoryId": "28",
  "version": "0.8",
  "author": "kuertee",
  "createdUnix": "1332142580",
  "updatedUnix": "1394493271",
  "containsAdultContent": false,
  "uploadedBy": "kuertee",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089333",
      "name": "kuertee Auto-save and time 0p705",
      "version": "0.705",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "202",
      "fileName": "kuertee Auto-save and time 0p705-13239-0-705.zip",
      "uploadedUnix": "1388589686",
      "modVersion": "0.705",
      "virusScanUrl": "https://www.virustotal.com/file/ad820833ddeb2347cf75a18fb36e463f78addc4d7f96af8658ab6ee407354864/analysis/1407867488/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuertee%20Auto-save%20and%20time%200p705-13239-0-705.zip?fid=1000089333&ttl=1535775841&ri=8192&rs=8192&setec=60c773b0bb062add51489578c3d68cae"
    },
    {
      "fileId": "1000089334",
      "name": "kuASAT x MCM 0p705",
      "version": "0.705",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "kuASAT x MCM 0p705-13239-0-705.zip",
      "uploadedUnix": "1388589781",
      "modVersion": "0.705",
      "virusScanUrl": "https://www.virustotal.com/file/5c978962a329e6513304d387bd8144d60f0a2cf2aff732518a34c03bb6d43d9c/analysis/1407867489/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuASAT%20x%20MCM%200p705-13239-0-705.zip?fid=1000089334&ttl=1535775842&ri=8192&rs=8192&setec=e911f70593edae4139b5f88abd5ab854"
    },
    {
      "fileId": "1000089335",
      "name": "kuASAT merged with MCM 0p705",
      "version": "0.705",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "217",
      "fileName": "kuASAT merged with MCM 0p705-13239-0-705.zip",
      "uploadedUnix": "1388589882",
      "modVersion": "0.705",
      "virusScanUrl": "https://www.virustotal.com/file/7974d9ed1719b1417308ca54ffd9df98c0531b8622c17df55125818f31ede9d6/analysis/1407867490/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuASAT%20merged%20with%20MCM%200p705-13239-0-705.zip?fid=1000089335&ttl=1535775843&ri=8192&rs=8192&setec=e7d8763cbd12f44e0df8480a93c8b836"
    },
    {
      "fileId": "1000100733",
      "name": "kuertee Auto-save and time 0p8",
      "version": "0.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "205",
      "fileName": "kuertee Auto-save and time 0p8-13239-0-8.zip",
      "uploadedUnix": "1394493052",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/0cf90e70cf2decb9300c21995751a8b86e15162a4f3ce621e40acc7ca3395508/analysis/1407977202/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuertee%20Auto-save%20and%20time%200p8-13239-0-8.zip?fid=1000100733&ttl=1535775843&ri=8192&rs=8192&setec=9080611b87f44d566a0c58ca72aa3efa"
    },
    {
      "fileId": "1000100734",
      "name": "kuASAT x MCM 0p8",
      "version": "0.8",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "15",
      "fileName": "kuASAT x MCM 0p8-13239-0-8.zip",
      "uploadedUnix": "1394493144",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/205b25815e6da8ebc394285794efbce1641722a41a6b13bb067e13776268de25/analysis/1407977222/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuASAT%20x%20MCM%200p8-13239-0-8.zip?fid=1000100734&ttl=1535775843&ri=8192&rs=8192&setec=4978a4a38634355fea376787f43d6ba3"
    },
    {
      "fileId": "1000100735",
      "name": "kuASAT merged with MCM 0p8",
      "version": "0.8",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "220",
      "fileName": "kuASAT merged with MCM 0p8-13239-0-8.zip",
      "uploadedUnix": "1394493271",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/751a9348d8d6439007183c092aa05bacffef19a33188f0916047402ae70b870a/analysis/1407977223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuASAT%20merged%20with%20MCM%200p8-13239-0-8.zip?fid=1000100735&ttl=1535775844&ri=8192&rs=8192&setec=00efa0715e6f7be72466ca653874b129"
    }
  ]
}