{
  "modId": 13238.0,
  "modName": "Skyrim Main Storyline New Bosses",
  "summary": "A rework of the main questline adding bosses where appropriate.",
  "descriptionHtml": "----------------------------NOTICE---------------------------------\r\nI\\'ve learned a lot about the CK over the past few months, and am thinking about re-doing this mod.  It would stay largely the same, but it would be optimized in ways I previously had no knowledge of, and some enemies would be made harder, others easier (to imply a difficulty scale)\r\nIf any of you are against this, I will leave up the old version of the file, and you do not have to update (it won\\'t be mandatory)\r\n-Avenger404-\r\n\r\nIf you choose to download my next-up mod, this file will not be compatible with it!  So please do be aware that you will have to deactivate this mod if you download my new one!\r\n-----------------------------------------------------------------------\r\nHave you ever been wandering around in the main quest and the entirity of it all felt extraordinarily underwhelming, despite what you were supposed to be doing?  Have you ever delved into ancient, empty tombs and felt the excitement and anticipation of a boss of epic proportions waiting anxiously to rip you to shreds, but sadly encountered nothing?  Have you ever powerleveled up to level 50+ to face the grand and epic challenges for the high level that Skyrim has to offer, but found nothing truly worthy of your newfound power?\r\n\r\nIf so, then this is the mod for you, because this is ALL about to change...\r\n\r\nWelcome to my FIRST big revamping mod!  The Main Storyline for Skyrim Revamp!  Today, several dungeons throughout Skyrim\\'s main storyline gain a little more powerful life.  Today, a large number of places visited in the main story get REAL BOSSES!  From Ustengrav to Sovengarde, many of the places in between have become much more difficult to get through.  They get set-levelled bosses which will truly test the DragonBorn\\'s mettle...\r\n\r\nPotential adventurers beware, however, as these new bosses are NOT for the faint of Heart, or low of level.  They may look like ordinary creatures (and until I learn how to texture/skin, they will), but they are much more difficult than their respective counterparts, I assure you!  A warning: if you encounter these bosses on Expert or Master difficulty, you may have to lower your difficulty settings to actually kill them...  (don\\'t worry, I won\\'t tell!)\r\n\r\nOver the course of your adventures, you will eventually come into possession of EXTREMELY POWERFUL weapons and armor, which you and your follower(s) will almost certainly be required to wield in order to defeat the evils the great and terrible Alduin has sent after you...  Don\\'t worry, all playstyles have a set of armor to wear, with 2-handed and heavy armor being favored...\r\n\r\nThis mod is meant to increase the difficulty from Ustengrav onwards, but most players have advanced much farther than this point in the line, but I truly must say that you should play this questline from the point where you first discover Sky Haven Temple, as if you try to play past this point without the item(s) received, you may find progress to be INCREDIBLY difficult...  As there is a conclusion of truly epic proportions in Sovengarde!  It has managed to keep Bethesda\\'s cinematic grace, but up the difficulty and tempo of the fight slightly.\r\n\r\nIf you like this mod - PLEASE comment and endorse!  It truly does inspire us modders to keep working!\r\n\r\nPLEASE TELL ME IF YOU FIND ANY BUGS, AND I WILL DO MY BEST TO FIX THEM!  As always, it is best to make a clean save for this mod, as I do not own every mod out there, and some may have unforeseen results on saves...  You\\'ve been warned...\r\n\r\nINSTALL GUIDE:\r\n\r\nUse NMM\r\nor:\r\nExtract to C://program files(x86)/steam/steamapps/common/skyrim/data\r\n(Make sure the AncientBrothers.esp is loaded first!)\r\n\r\nCHANGELOG:\r\n\r\nv1.0Alpha - Release\r\nv1.01Alpha - Made one of the bosses actually hostile, added some new NPCs to cause some distractions (allowing the player to make an appropriate battle plan), made some NPCs essential who were previously not, fixed a random spawn bug in the final fight\r\nv1.1Alpha - Made some bosses more lore-friendly (removed Dremora), slightly increased Alduin\\'s difficulty in general, added a surprise for those using DeadlyDragons in the final fight\r\nv1.0Beta - Added some lore packages for some bosses, Fixed double-spawn bug on SkyHaven Boss, fixed an enchantment issue on one of the new weapons\r\nv1.5Beta - Made Konahrik more difficult, tweaked all the armor sets, fixed the enchantments issue (should be close to normal now), Modified Alduin and Paarthurnax boss fights\r\nv1.0 - Current Full Release - only small hotfixes due to demand from now on, released an optional version with greater challenges (no loot from the brothers)\r\nv1.0 - Current Full Release - small changes made (made the Thalmor actually aggressive and slightly more deadly)\r\n\r\nREQUIRED MODS:\r\nNone\r\n\r\nRECOMMENDED MODS:\r\nInfinite Enchantments\r\nAny mods changing the male body (should cancel a Creation Kit body model glitch)\r\nDeadly Dragons (Note this is only because I know this mod works)\r\n\r\nINCOMPATIBLE MODS:\r\nAny of the following that are affected stat-wise may have strange side effects - Try working this mod with others at your own risk!\r\nDragon Priests\r\nDraugr\r\nAlduin - Deadly Dragons is compatible, don\\'t know about other dragon mods\r\nThe Ancient Heroes\r\nAncient Dragons - Deadly Dragons is compatible, don\\'t know about other dragon mods\r\nPaarthurnax - Deadly Dragons is compatible, don\\'t know about other dragon mods\r\n\r\nBUGS:\r\nMay cause missing sections of other quest dungeons (please just noclip through the missing places, probably isnt caused by my mod)\r\nSome events are quite large and graphically impressive, and may crash your game (Lower your graphics settings or look away from the events when at all possible to fix this)\r\nEntering Understone Keep in Markarth may cause a CTD - trying to diagnose and fix.\r\n\r\nFULL MOD DESCRIPTION - SPOILERS TO FOLLOW!!! - \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nThis mod adds bosses to the following places:\r\nUstengrav\r\nBoss: Jurgon\\'s Guardian\r\nWhen the imposter stole the horn and left the note, they awakened an ancient guardian of Jurgon Windcaller\\'s tomb.  A guardian you must now fight tooth and nail to survive against (planning to add voiced dialoge)\r\n\r\nThalmor Embassy\r\nBoss: Thalmor High Mage\r\nThis particularly learned mage has been assigned to the Thalmor Embassy.  Their sole purpose is to kill you.\r\nThalmor Interrogator\r\nA mean brute of a fellow, he knows ways to make you hurt in places you didn\\'t even know you had...\r\nTroll Feeders\r\nBig elves who like trolls, and they dont want you hurting their baby...\r\n\r\nTower of Mzark\r\nBoss: High Mage Achela & Dwemer Centurion\r\nThis Thalmor High Mage has delved into the dwemer stories since she was a child.  She plans on resurrecting powerful, ingenious soldiers to introduce to the Thalmor forces, she may or may not have deadly dwarven-clad prototypes at the ready... (will make a questline if interest is shown)\r\n\r\nThroat of the World\r\nBoss: Alduin\r\nAlduin vs Paarthurnax is now a much more grand fight, as the dragons of old are more powerful, and are truly Masters of the Voice.\r\nBoss: Paarthurnax\r\nIf your bloodlust causes you to attempt to slay Paarthurnax, you\\'ll find this old dragon has received a few tweaks to his combatstyle, and you\\'ll really have to work to get rid of him...\r\n\r\nSky Haven Temple\r\nBoss:\r\nAhvar the Drained\r\nThis ancient nord mage hero from long ago has been cursed by a dark mage, and must now serve his will.  Fighting this mage from a distance may be wise, as he can hit you with all 3 destruction schools simultaneously, and does extra damage to those who get close...\r\nDahkoor the Furious\r\nThis tower of a nord hero from long ago has a short fuse, and a heavy axe.  Get too close andy ou will see how Staggering this guy can be!\r\nGalvor the Everlasting\r\nThis nord hero can last forever in a fight, and his sword\\'s abilities may certainly help him with being the survivor of the group...\r\nKulmar the Piercing\r\nThis nord hero of the bow persuasion can run far out of your range, and pelt you with arrows of devastating and extremely tiring force...\r\nTorvuld the Absorbed\r\nThis nord hero revels in bloodlust, he gets more energised as his enemies get weaker.  Many a life he took that was kneeling in front of him, to exhausted to even breathe...\r\nVikskul the Flurry\r\nThis nord hero travels light, and hits fast from afar.  He is also keenly to the persuasion of being a powerful bane to mages...\r\nKonahrik the Cursebinder\r\nSuch powerful, unwilling foes would need a very powerful guardian to keep them in line.  This boss may look like an ordinary dragon priest, but rest assured, he is FAR more powerful!  Even with the equpiment of his slaves, you may find yourself unable to beat him alone...\r\n\r\nSkuldafn\r\nBoss: All 6 brothers\\' spirits\r\nFree the spirits of the 6 ancient heroes so they may be swept to Sovengarde\\'s shores!\r\n\r\nSovengarde\r\nBoss: Alduin\r\nThis ancient foe of the universe now has an army, but he is also far more generously awarded in health (particularly with Deadly Dragons mod...)\r\nBoss: Alduin\\'s army!\r\nDuring the time Alduin has been harvesting souls, he has kept some for a personal army of incredible power.   You\\'ve had a taste of the Ancient Brothers and Konahrik.  How would you like to face all of them simultaneously?  How about adding the other 8 dragon priests just for kicks?  How about two Ancient Dragons who are personal escort to Alduin himself?  And finally, how about a host of unjustly defeated Draugr and dark, corrupted shades manifested by Alduin?  Plus there\\'s a little treat of added difficulty for those brave enough to adventure with Deadly Dragons...\r\nDon\\'t worry though, by this time you will have earned some favors, and some helpers will arrive to give aid at your time of greatest need...\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n-----------------------------------------SPOILERS END HERE!----------------------------------------\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n-------------------OTHER MODS BY ME-----------------------------\r\n\r\nHall of the Warlords\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=14045\r\n\r\nMage Guild Bosses Revamp - Part I\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=16710\r\n\r\n-------------------------------------------------------------------------\r\n\r\nCredits: Bethesda for the awesomeness that is Skyrim\r\n\r\nPlease leave feedback and endorse if you really like it!",
  "categoryId": "35",
  "version": "1.0",
  "author": "Avenger404",
  "createdUnix": "1332142534",
  "updatedUnix": "1335748338",
  "containsAdultContent": false,
  "uploadedBy": "avenger404",
  "primaryFile": null,
  "files": [
    {
      "fileId": "46895",
      "name": "Ancient Brothers esp v1",
      "version": "1.5Beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22",
      "fileName": "Ancient Brothers esp v1-13238.rar",
      "uploadedUnix": "1332721256",
      "modVersion": "1.5Beta",
      "virusScanUrl": "https://www.virustotal.com/file/e978cbadea4e0941cd3ef5f7923aeddf4e23c40fb292b4a7eb1997d819817a99/analysis/1406780223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ancient%20Brothers%20esp%20v1-13238.rar?fid=46895&ttl=1535775839&ri=8192&rs=8192&setec=c8c0fa8f28d690fc9e050b6304b2e6f1"
    },
    {
      "fileId": "54744",
      "name": "Ancient Brothers No New Apparel Version",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "21",
      "fileName": "Ancient Brothers No New Apparel Version-13238-1-0.rar",
      "uploadedUnix": "1334912179",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1ff5fa715425c967cda2a90d7afeae730791dbb56bc98786c9af2a9f70876c75/analysis/1406824837/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ancient%20Brothers%20No%20New%20Apparel%20Version-13238-1-0.rar?fid=54744&ttl=1535775839&ri=8192&rs=8192&setec=f41b66da944186eeea71e0c39fe4aab2"
    },
    {
      "fileId": "57456",
      "name": "Quest Revamp File",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "38",
      "fileName": "Quest Revamp File-13238.rar",
      "uploadedUnix": "1335748338",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/69cf923692c332ba90b6f9948926d1a6f2776bc2435b954e61bd30fd503c2cc3/analysis/1406855262/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Quest%20Revamp%20File-13238.rar?fid=57456&ttl=1535775840&ri=8192&rs=8192&setec=69ce89e93ee3685ef4bec4965e684985"
    }
  ]
}