{
  "modId": 13262.0,
  "modName": "Higher Magic - Soul Tokens",
  "summary": "Allows you to manipulate energy in soul gems and weapons, to a degree",
  "descriptionHtml": "What does this mod do?\r\n--------------------------------------\r\n\r\n\tThis mod adds 2 new types of soul gem\r\n\r\n\tSoul Tokens :\r\n\t---------------------\r\n\t\tThis is more a dust, than an actual soul gem. It is equivilant to one unit of energy that you will find in the soul gems, or weapon charges\r\n\r\n\tSoul Prison :\r\n\t-------------------\r\n\t\tThis is an expensive soul gem construct that is made with a smelter.It is reuseable, and can not be found in the world naturally. You MUST create this soul gem. It is costly, but it will hold any size or type of soul in it (with normal soul trap restrictions)\r\n\r\n\r\n\tThis mod gives 4 different effects, 2 spells, 2 powers.\r\n\t-----------------------------------------------------------------------------\r\n\r\n\tDischarge SoulGem : \r\n\t--------------------------------\r\n\t\tAllows you to effectively drain a properly filled soulgem that you either loot, or buy, from energy. For each point of energy you discharge, you get 1 Soul Token.  (*this does NOT work with trapped soul gems. Looking for a resolution to this.*) When cast, you do not loose the actual soul gem.\r\n\r\n\tRecharge SoulGem :\r\n\t-------------------------------\r\n\t\t Allows you to FULLY refill an empty soul gem that you have. Each point you put in, costs you 1 soul token. Partial fills are NOT possible.\r\n\r\n\tDischarge Weapon :\r\n\t------------------------------\r\n\t\t This allows you to discharge the energy of the weapon in your hand. You get 1 Token for each point of weapon charge in the item.  (This is a power of voice, so you can use it with 2 handed weapons with this.)\r\n\r\n\tRecharge Weapon :\r\n\t-----------------------------\r\n\t\t This allows you to recharge the energy of the weapon in your hand. It costs you 1 token for each point of charge in the item.  (This is a power of voice, so you can use it with 2 handed weapons)\r\n\r\n\tNOTE: With recharge weapon, you can \\\"hypercharge\\\" the energy in the device.  It does not change the overall damage of the device, or other such things, but you can provide additional energy for it to use. So... that sword that normally has 3,000 charge, has that big enchant, and dies out after 8 hits in the fight, and then is useless for the last half... You can Hypercharge it to  have 20,000 charge, so it actually lasts through the fight properly. (Rechargeing it at that point is a totally different issue, but you do have the potential there to canibalize the energy from other items that are otherwise wasted to help get another shot or 3 in)\r\n\r\n===========\r\n\r\nWhere can you find this stuff?\r\n--------------------------------------------\r\n\r\n\tThe powers/spells can be bought from Nelacar, in Winterhold Inn. If you wish to buy them, hit the stone behind his desk, and copies of the spells will be copied to his box, so he will sell them.\r\n\r\n\tThe Soul Token will be produced when you use the spells on weapons and gems.\r\n\r\n\tThe Soul Prison will have to be created by yourself, at any smelter.\r\n\r\n\r\n============\t\r\n\r\nConcept :\r\n\r\n\tI came up with this concept in Oblivion, when I was soul trapping things all over the place. Unfotunately, I got TOOOOO many cases of  \\\"Black Soul Gem (Petty)\\\" to do nothing, so I wanted to fix this issue.  I wanted a method to effectively get the energy out, and have the soul gem able to be used again. I also wanted to be able to use that energy that was discharged, and fill a properly sized gem. ... I DID actively try to get the energy in the first place, after all. I succeeded in Oblivion in this effort, and was happy. When Skyrim came out, I wanted to continue the tradition of this effect.\r\n\r\n\tThe concept of this mod is something that the programmers of the game have effectively tried to neutralize in this one. In Oblivion, they had each soul gem seperately assigned, and the soul trap would give you that type of gem, with that type of soul. If you wanted to discharge it, you could effectively do this without issue by effectively giving you the soul tokens, and an empty gem. In this game however, they credit it to a tag or flag of some form, and I have not been able to find a way to do a proper comparison for the soul trapped in the gem.  (If you know a way to compare the soul in a trapped gem, PLEASE tell me. With this information, I can get this functional properly)\r\n\r\n\tWith this gap of ability to properly compare the gems, and see the soul tag linked,  I had to improvise the solution. The resolution was simple : A refillable soul gem, that was not unique.\r\n\r\n\tWith this mechanic, the game should use the soul gem properly, and naturally. You can discharge the gem to a weapon, and then discharge the weapon with the spells/powers provided. In this manner, it should work with the native soul trapping effects, including the perks, and the natural abilities that are built into the game.\r\n\r\n============\r\n\r\nNotes of Interest :\r\n\r\n*\tThe soul prison is EXPENSIVE! It is an obscure bit of information, and as such, it is something that few know about. I wanted to ensure that this was not exploited without reasonable aspects.\r\n\r\n*\tI DO consider this mod flawed. I want to be able to do checks on the soul trapped in the soul gem, and get that soul out when it was trapped. Unfortunately, the way the set this up, the game recognizes the gem as an empty one. They just slap a tag of some form on it that the game recognizes as a proper soul. Being unable to see or manipulate this flag, I am forced to find a work around. \r\n\r\n* \tAs such, souls that you trap are untouched with these effects. You must discharge this soul to get the energy out. Then you must pry it from the weapon to use it otherwise.\r\n\r\n*\tI consider this a work in progress until I get my proper functionality that I have in my mind,  however, with the setup they have done, I may never get it. With that in mind, this mod is functional, and will allow the base concept to be presented in a functional, if rough and clunky way. As such, I present it to you.\r\n\r\n*\tIf you wish to use a trapped soul gem normally, you can overwrite the gem with soul energy, with the ability to refill the soul gem. It will ignore the tag,  and use your tokens to give you the proper, full soul gem. As such, the gem is NOT wasted, but the energy in the soul gem is.\r\n\r\n*\tIf you use the gem with trapped energy to charge a weapon, it WILL remove the gem, like normal\r\n\r\n* \tEnchanting process has NOT been changed at all. That will still cost a gem, like normal.\r\n\r\n==============\r\n",
  "categoryId": "75",
  "version": "1.1",
  "author": "Pan Dragondagger --- aka -  Rex1029",
  "createdUnix": "1332175298",
  "updatedUnix": "1343325803",
  "containsAdultContent": false,
  "uploadedBy": "Rex1029",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44818",
      "name": "HM Soul Tokens 1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "HM Soul Tokens 1-0-13262.7z",
      "uploadedUnix": "1332175354",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9166865bf532f0e67c4fd13e80a1949de1e456b751cdf23ad35c90574efe4b1d/analysis/1406768042/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HM%20Soul%20Tokens%201-0-13262.7z?fid=44818&ttl=1535775880&ri=8192&rs=8192&setec=2a8456a1fbe047700844c699d6a2e06e"
    },
    {
      "fileId": "44826",
      "name": "Higher Magic Soul Tokens 1-0A",
      "version": "1.0a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18",
      "fileName": "Higher Magic Soul Tokens 1-0A-13262-1-0a.zip",
      "uploadedUnix": "1332177884",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/403a983c610817d13a9c34378b8648bb5258f96f0a09b653e1117c80fb527215/analysis/1406768051/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Higher%20Magic%20Soul%20Tokens%201-0A-13262-1-0a.zip?fid=44826&ttl=1535775881&ri=8192&rs=8192&setec=893ea4736ebcac253cad115fa7d67d1b"
    },
    {
      "fileId": "76748",
      "name": "HM Soul Tokens 1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "HM Soul Tokens 1-1-13262-1-1.7z",
      "uploadedUnix": "1343325803",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/295eb7c407371a67160615d65bafc2cc84c08f88db33f8d1d721a239f3cef7ce/analysis/1407047645/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HM%20Soul%20Tokens%201-1-13262-1-1.7z?fid=76748&ttl=1535775881&ri=8192&rs=8192&setec=c75ca3f090fb0f34716705468e76deb3"
    }
  ]
}