{
  "modId": 13281.0,
  "modName": "Grandmaster - True Unarmed and Unarmored Combat",
  "summary": "Now with faster punching animations&#33; The act of punching raises the Grandmaster skill just like any other combat skill. No need to equip some unusual &#34;fist weapon&#34; or confusing tie-ins with other skills - just start punching bare fisted&#33; Three unarmed power attacks in a row fire a magic attack, AOE stuns on hit, and many other custo",
  "descriptionHtml": "[B][color=yellow]Please read the FAQs below so you&#39;ll know how this works. This is not your typical mod.  \r<br />\r<br />NOTE: This mod replaces the Speechcraft tree.  If you&#39;d like to change that, download and read the instructions in the config file. \r<br />\r<br />I recommend keeping it in it&#39;s own tree because it works as a complete skill replacement.\r<br />A new way (unarmed) to increase the skill has been introduced so it requires it&#39;s own stand-alone tree to really feel right.  But then again, the config gives you the freedom to do what you want, so have at&#33; \r<br />\r<br />I sifted through the animations that come packaged with the game and found some that are faster punches.  These are Bethesda&#39;s animations, not ones I created.\r<br />\r<br />If you enjoy this (or any) mod, please swing back by and click the endorse button.  It&#39;s the closest thing to getting paid we modders get for all of our work, and we really do appreciate it.[/color][/B]\r<br />\r<br />**[B]ATTN: [/B]This mod is only available here on the Nexus.** \r<br />[color=red]\r<br />[url=http://SkyrimGEMS.com][img]http://SkyrimGEMS.com/images/badge_animated.gif[/img][/url]\r<br />[size=4][b](Category: 340 - Combat)[/b][/size]\r<br />***************************\r<br />***   Description\r<br />****************************[/color]\r<br />[color=Deepskyblue]The act of punching raises the Grandmaster skill just like any other combat skill. No need to equip some unusual &#34;fist weapon&#34; or confusing tie-ins with other skills - just start punching bare fisted&#33;\r<br />\r<br />As you work up the perk tree your fists will fire magic effects upon impact.  Shock, fire, or ice - gloves are awarded with the first perk to change the spells used, so the choice is yours&#33;  Specialize in a destruction branch and unleash the fury with your bare fists&#33;  If you want the unarmed damage scaling with no magic, just take the first few perks and wear armor and you&#39;ll still get the scaled unarmed damage, disarms, knockdowns, critical strikes, etc. but with no magic.\r<br />\r<br />Adds unique perks and abilities to unarmed fighting and wearing no armor that can&#39;t be added with the standard ck perk creator but had to be hand scripted.  True unarmed combat is finally a viable option in Skyrim&#33;\r<br />\r<br />This replaces the Speechcraft skill with a new Grandmaster skill. I believe it works best as a standalone tree, but should you feel otherwise, the instructions to change it are in the config file.\r<br />\r<br />Adds visual effects on both the targets and the players depending on which perk fires off. Standard power attacks and unarmed disarming have a subtle puff of dust and an impact noise, chi strikes surround the target in sparks, elemental fist throws a magic attack, when the Sifu perk goes off the player is surrounded in a red glow, when your health drops low a magic shield appears, and just wait till your arrows become supercharged with Chi&#33;[/color]\r<br />\r<br />[color=yellow]If you like it - please click the endorse button and let me know. Thanks&#33;[/color]\r<br />\r<br />[color=red]******* Config Release Notes*****************************************************************[/color]\r<br />There is a new file download available that allows you to tweak the mod in about 100 ways.  \r<br />Open with a text editor.  Instructions are at the top.\r<br />[color=red]***********************************************************************************************************[/color]\r<br />\r<br />[color=red]\r<br />***************************\r<br />***   FAQ\r<br />****************************[/color]\r<br />[list]\r<br />[*]  This mod does not activate until you get hit the first time after installing it.  That very first hit triggers an update that loads the perks and their effects, so make sure you take a hit after you install it.\r<br />[*]  This mod lives almost entirely in the scripts.  If it isn&#39;t working copy the scripts again and put it last in load order.\r<br />[*] Did I mention: *****The Scripts are vital, make sure they&#39;re copied across. All 6 have to get copied**********\r<br />[*]  Health, damage, and stamina regen rate increases all scale by level. For example, inner focus would give 10 bonus health at lvl 1, but gives 68 at lvl 30. \r<br />[*] Unarmed damage gets an additional boost after level 15.\r<br />[*]  I&#39;ve piggy-backed on the Speechcraft skill.  Yes, you can level grandmaster both with standard Speechcraft and your bare fists. No, that can&#39;t be changed. \r<br />[*]  This means that Speechcraft trainers (and books) convert into Grandmaster trainers.\r<br />[*]  On the other hand, enchantments and such that increase Speechcraft have no impact on unarmed damage which is calculated independently in the engine. \r<br />[*] On yet another hand, items enchanted for unarmed will stack on top of the perk bonuses.  Be warned - I didn&#39;t factor enchantments into my damage calculations so you&#39;re going to hit very hard, maybe even a little too hard, if you start stacking unarmed damage enchants.\r<br />[*]  No, you won&#39;t see progress on the skill bar because the number of hits is being tracked in the engine and so the bar doesn&#39;t fill up.  The engine is counting the number of hits you make and fires off a skill-up when you&#39;re reached the required amount for that skill level. Counts the same as any other skill towards level progression.\r<br />[*]  Blocked hits don&#39;t count towards your next skill increase.\r<br />[*]  The jump shield scales from Oak Flesh to Ebony Flesh based on Alteration skill.\r<br />[*]  It may take an arrow or two before the Chi Arrow effects start.  Once they load they stay.\r<br />[*]  The frost and fire gloves will appear in your inventory about 20 seconds after taking the first perk.\r<br />[*]  If you equip the gloves in combat you may see the wrong shield appear due to the multithreaded nature of Skyrim.  Probably best to switch gloves when things are quiet.\r<br />[*]  Before you take the first perk unarmed and unarmored is just vanilla Skyrim.\r<br />[*]  Sometimes the Grandmaster skill will &#34;ding&#34; when you&#39;re not in combat.  This is due to how the engine checks for skill up on a separate timer.  This is normal and the code is doing it&#39;s thing counting your blows.\r<br />[*] The Grandmaster skill ups start at where your Speechcraft is. So a Breaton starts Speechcraft higher than a Dark Elf and would therefore take longer to see his first skill up.\r<br />[*]  Static perk updates like the unarmed damage for Little Dragon or the health bonus for Inner Focus run on a separate timer and are updated every 30-45 seconds.  So when you take the Little Dragon perk it might take a little bit for your damage output to actually increase.  Once they get loaded they stay in place.\r<br />[*]  As long as the description box for clothing doesn&#39;t say heavy or light armor, the item won&#39;t count against the unarmored bonuses and shields.\r<br />[*]  You can wear armor and still use the unarmed damage perks.  Some prefer using armor with this mod and that&#39;s perfectly valid, you still get all the wild unarmed effects, jut not the unarmored bonuses and shields.\r<br />[*] Fist weapons won&#39;t work with this, they&#39;re just one handed weapons with a different model. This is strictly bare-knuckled bruiser stuff.\r<br />[*] The Khajiit unarmed bonus is not used.  After a few levels of Grandmaster it would be irrelevant anyway.  You&#39;ll be hitting plenty hard.\r<br />[*]  Stones have no effect. Grandmaster levels pretty quickly as it is so pick a stone for something else.\r<br />[*]  &#34;Is this compatible with such-and-such mod?&#34;  No clue.  Every mod on this site conflicts with other mods and I&#39;m sure this one is no exception.\r<br />[*]  If you have the first Little Dragon Perk and do not see a special effect when you jump, the engine is NOT running (before the first perk you&#39;ll see nothing). Copy the scripts again.\r<br />[*] You can change many things about the mod to suit your taste in the config file.  You can also break it.  If that happens just recompile the original one and try again.\r<br />[/list]\r<br />\r<br />I&#39;d advise using a sword or something to get to level one because before the first Little Dragon perk it&#39;s just vanilla Skyrim unarmed - which stinks.  After taking those first 3 Little Dragon perks unarmed is a bit overpowered at lower levels, but it scales by level, and should scale nicely after about level 10 and gets a little extra boost after level 15. It&#39;s tough at the lower levels, but as you work your way up the perks you will become quite the fighter. Power attacks are your best friend with this class.  \r<br />\r<br />Final Note:  There is a lot of processing going on during combat, especially as you get higher in Grandmaster perks.  A newer machine should be fine (mine handles it without issue), but if you&#39;re seeing delayed effects like the magic effect delayed going off with Elemental Fist, you can alleviate that by turning the graphics down a bit.\r<br />[color=red]\r<br />********************************\r<br />***   The Perks\r<br />********************************[/color][list]\r<br />All magic effects change based on gloves worn. No gloves will trigger shock effects, frost and fire \r<br />gloves will trigger their respective damage types.\r<br />\r<br />The lower level perks are the foundation for unarmed damage and the higher perks are where things start to get crazy.\r<br />\r<br />[*] Little Dragon (3) : Increases unarmed attack damage, power attacks have a chance to knockdown, incoming damage is reduced when wearing no armor, and a magic shield surrounds the player when their health gets low.  jump 4 times within 5 seconds while wearing no armor and get shielded.  Shield spell scales with Alteration level.\r<br />[*] Precise Strike (3): Chance of unarmed critical strikes raises.\r<br />[*] Penetrating Blow(2): Unarmed attacks ignore a percentage of armor\r<br />[*] Joint Lock(2): Unarmed attacks have a chance to disarm and stagger\r<br />[*] Inner Focus: Bonus health when unarmored, unarmed power attacks cost 25% less and stamina regens faster with no armor and a blocked unarmed strike has a chance of casting a magic attack\r<br />[*] Elemental Fist: Three power attacks in a row on the same target casts a magic attack.\r<br />[*] Chi Strike: Unarmed power attacks have a chance to unleash a devastating strike that drains the targets stamina and magika\r<br />[*] Chi Master: Jumping in sneak mode while in combat slows time, pumping your left fist rapidly while not in combat casts magelight and the right fist casts a heal. The slow time effect is limited to how soon you can do it again to prevent slow motion bunny hopping through combat.\r<br />[*] Serpent Strike: Unarmed attacks in sneak mode fire a magic attack and an AOE stagger. Do not need to be hidden\r<br />[*] Chi Arrow: Chance arrows will throw a magic attack on impact.  Increased arrow damage.Marksman 50 required\r<br />[*] Swan Stance: Reflect damage back to the attacker when unarmored and 10% chance to avoid all damage\r<br />[*] Sifu: Chance of entering a focused state for 5 seconds dramatically increasing unarmed damage.  When you are attacked with magic, there is a chance an instant heal will happen.\r<br />[*] Grandmaster:Unarmed  power attack critical hits now do 3x more damage and incoming damage is reduced by 25% when wearing no armor\r<br />[/list]\r<br />\r<br />[color=red]\r<br />****************************************************************\r<br />***   Troubleshooting and Installation Problems\r<br />****************************************************************[/color]\r<br />[color=yellow]**Special thanks to Loole in Australia for all his testing and being the first to level Grandmaster to 100.\r<br />[list]\r<br />[*] For the old animated version:  According to another post you can remove them if you go to: Computer&gt;Program files&gt;Steam&gt;Steamapps&gt;Common&gt;Skyrim&gt;Data&gt;Meshes and delete the martart file, then go to Actors&gt;character&gt;animations and delete everything in there. Haven&#39;t tried this myself.\r<br />[*] This may never work well on older computers.  It does need some horsepower to run.\r<br />[*] Files created using 7zip, if you&#39;re having problems with WinZip go get 7zip.  It&#39;s free and better than WinZip anyway.\r<br />[*] If you don&#39;t see the Grandmaster perks replace the Speechcraft perks, the mod isn&#39;t enabled.\r<br />[*] The perks don&#39;t take effect immediately.  \r<br />[*] Just to be clear:[B]The perks may take a minute to activate. [/B] So if you take the Little Dragon perk and then immediately go into the console to check your damage it won&#39;t have increased.  Wait 30 seconds and check again. \r<br />[*] If you have another mod that tinkers with unarmed damage you&#39;ll likely see conflicts.\r<br />[*] Many modded clothes still appear as armor to the game - even if you can&#39;t see it in the description.\r<br />[*] If it&#39;s not working at all it&#39;s almost certainly the scripts not being copied correctly. Please, download manually and allow overwite of [B]ALL[/B] the scripts.  \r<br />[*] If it only partially works (flame jump, unarmored perks, but no unarmed damage perks) you didn&#39;t get the ObjectReference script copied across or something else overwrote it.\r<br />[*] If unarmed damage amounts seem to drop unexpectedly, there is most likely another mod trying to change it.\r<br />[*] If it still doesn&#39;t work either everything didn&#39;t get copied or there&#39;s something on your machine preventing it from working. \r<br />[*] It&#39;s impossible for me to troubleshoot or even guess what the thousands of available mods might be doing.\r<br />[/list]\r<br />That&#39;s pretty much the extent of the technical support I can give without coming over to your house and looking at it myself.  \r<br />\r<br />[b]All that said, if you have what you think is a real bug, please by all means post it so I can squash it.[/b]**[/color]\r<br />\r<br />\r<br />[B]Thanks&#33;  And don&#39;t forget to endorse if you liked it&#33;[/B]",
  "categoryId": "73",
  "version": "9.07",
  "author": "leecarter",
  "createdUnix": "1332188569",
  "updatedUnix": "1428805734",
  "containsAdultContent": false,
  "uploadedBy": "leecarter",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000046730",
      "name": "Grandmaster_config",
      "version": "9.07",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "7",
      "fileName": "Grandmaster_config-13281-9-05.7z",
      "uploadedUnix": "1376438622",
      "modVersion": "9.07",
      "virusScanUrl": "https://www.virustotal.com/file/96da56dd18a9e49dda50933dffdf6d721471e285cf597c34c9b74cd57e866f7c/analysis/1407681302/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grandmaster_config-13281-9-05.7z?fid=1000046730&ttl=1535775915&ri=8192&rs=8192&setec=40ad476b5e3d709f807619050753fbed"
    },
    {
      "fileId": "1000047179",
      "name": "GrandMaster_base",
      "version": "9.07",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "313",
      "fileName": "GrandMaster_base-13281-9-07.7z",
      "uploadedUnix": "1376609214",
      "modVersion": "9.07",
      "virusScanUrl": "https://www.virustotal.com/file/045b117d98f24f69093cf3a3041611b6c78ef906726068d27c166ad4ac333374/analysis/1407683547/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GrandMaster_base-13281-9-07.7z?fid=1000047179&ttl=1535775915&ri=8192&rs=8192&setec=5c0f51f79b57c2c6ac62bda84afd2491"
    },
    {
      "fileId": "1000155373",
      "name": "Grandmaster Source Code",
      "version": "9.07",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "16",
      "fileName": "Grandmaster Source Code-13281-9-07.7z",
      "uploadedUnix": "1428805734",
      "modVersion": "9.07",
      "virusScanUrl": "https://www.virustotal.com/file/293f363c3cbb63b84ef42635948feae8c8af28b3af047283acef94e94c6a47e1/analysis/1428805742/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grandmaster%20Source%20Code-13281-9-07.7z?fid=1000155373&ttl=1535775916&ri=8192&rs=8192&setec=7888e35cc2511f07f43f74e6abf935a4"
    }
  ]
}