{
  "modId": 13297.0,
  "modName": "Spellsword Tools of Trade",
  "summary": "GKorr\\'s evil spells for evil spellswords: Kill with style and live to brag about it! New perks Added!",
  "descriptionHtml": "SPELLSWORD TOOLS OF TRADE V2.3 : Gkorr\\'s evil spells for Skyrim 15/4/12 More Fixes, 8 concentration spells added.\r\n\r\nThis is a mod that aims to bring more variety  to the destruction School in skyrim, by adding some simple, but sinister new spells. Most of them are designed to give you more tactical options by weakening and/or breaking your enemies, as you move in for the kill. \r\n\r\nNEW CONCENTRATION SPELLS\r\n\r\nI always found the concentration type spells (flames, sparks, frostbite) very cool and useful for mid/close range combat, but I hated how fast they became obsolete. After using the untempered / unenchanted daedric sword damage per second (14) for comparison  and EXTENSIVE testing, I decided to add apprentice, adept and expert level versions of these spells. The mana cost per second is autoset to ensure balance. The adept and expert version of sparks gain the same \\\"jumping\\\" ability with the adept shock spell. \r\n\r\nDamage per level: \r\n\r\nNovice (vanilla): 8\r\nApprentice:10\r\nAdept:12\r\nExpert:15\r\n\r\nTHE SPELLS\r\n\r\nNOVICE SPELLS\r\n\r\n1. Destroy Resistance : A magical attack that damages the target\\'s armor  by 8 points per second, weakening his damage resistance.\r\n2. Curse The Flesh :  A curse that infects the enemy with Rockjoint , reducing his melee damage by 25% for 30 seconds.\r\n3. Curse the Spirit : Curse your enemy with Witbane, reducing magicka regeneration by 50% for 30 seconds.\r\n4. Curse the Will:  Curse your enemy with Rattles, reducing stamina regeneration by 50% for 30 seconds.\r\n5. Destroy Elemental Resistance : A magical attack that reduces the target\\'s elemental resistance  by 5% per second, making him more susceptible to fire, ice and shock damage.\r\n6. Demonic Enchantment : Enchant your right hand weapon for 60 seconds causing melee damage that bypasses armor.\r\n7. Ice Volley : What is better than an ice spike? Three ice spikes! Launch a volley of 3 ice spikes that cause frost and stamina damage.\r\n8. Poison Cloak :  A magic cloak that does poison damage to enemies in melee range. Poisoned targets take extra damage.\r\n9. Demonic Push : Stagger you opponent for a few seconds. But because that wouldn\\'t be demonic enough, you have 1% chance to kill your victim instantly with this attack.\r\n10. Drain Life : Because there can be no evil character without a life drain spell... \r\n\r\nApprentice Spells\r\n\r\n1.Speed Fiend : Pure hatred for every living (or undead) thing fuels your anger, making you a whirlwind of destruction in battle. The downside is that you neglect your own safety...Ehance your weapon and movement speed by 50% , at the cost of 50 points of armor and fire and frost resistance, for 30 seconds.\r\n\r\n2.Little Bit o\\' Murder: A murderous touch that inflicts unimaginable pain to the victim. Damage your target for 10 points of bleeding damage, paralysing for 3 seconds those who fail to resist. (The spell has no range, you have to touch the target with your spell arm when casting)\r\n\r\n3. Fuel For Fire / Nordic Napalm: A close range fire attack that engulfs the target in flames causing 10 damage for 4 seconds and sets a fire where he stood that burns passers by. \r\n\r\n4.Domination Through Destruction: Your fires burn bright, perhaps a bit too bright... Amplify your destruction damage by 25%, at the cost of 50% reduced melee damage and 50 points of armour for 30 seconds.\r\n\r\n5.Destruction Of Destruction: That enemy spell caster is making you angry, I know. Well not any more. Reduce the power of his destruction spells while increasing their cost by 5% per second.\r\n\r\n6. Cloak Of Pain: Let them come...and taste their own steel. You get 50% chance to reflect 50% of the melee damage you take for 30 seconds.\r\n\r\n7.Blood Price: Pay the price in blood (and magicka) to inflict 25% more melee damage and get increased  critical chance for 30 seconds. The downside is that your life is reduced by 50 points and your destruction spells become useless...\r\n\r\nTHE ADEPT SPELLS:\r\n\r\n1.Forced Submission: When your enemies deny your superiority, force them in to submission by staggering them in a 50 ft explosion centred on yourself.\r\n\r\n2.Cloak Of Wrath: A badass spell sword never runs away....A badass spell sword runs through! for 15 seconds most opponents you touch while sprinting will \\\"kindly\\\" step aside! \r\n\r\nSPELL SWORD TOOLS OF TRADE : Perks \r\n\r\nSpell swords don\\'t benefit from the fighting prowess of a warrior or the sheer magicka potential of a mage. This perk pack aims to make a spell sword class unique and viable by adding 8 new perks to the light armour, one handed, alteration and destruction skill trees, designed exclusively for the spell sword class. These perks have very strict requirements (full light armour, spell on the left hand and sword to the right). in order to enhance the RP element and maintain the game balance. \r\n\r\nThe Perks:\r\n\r\n1. Spell Sword Armour: When in full light armour protection spells like stoneflesh become 50% stronger.\r\n\r\n2. Spell and Sword: when wielding a sword with your right hand, your left hand destruction spells become 25% stronger.\r\n\r\n3.Impure Perfection: When wielding a spell with your left hand, your sword attacks become 25% stronger\r\n\r\n4.Sidestep : When in full light armour, time slows down when an enemy performs a power attack\r\n\r\n5.Spirit Walker: When in full light armour,  your magicka regenerates 50% faster\r\n\r\n6.Sweep Strike: when wielding a spell with your left hand, your sword side power attacks hit all enemies in front of you.\r\n\r\n7. Disarming Strike: When  wielding a spell with your left hand, your sword Standing power attacks have a chance of disarming your enemy.\r\n\r\n8. Elemental protection: When in full light armour, you gain 25% resistance against fire, frost and lightning.\r\n\r\nI am looking forward to your comments and feedback. Until then enjoy the mod!\r\n\r\nI would to like to thank for the inspiration and recommend:\r\n\r\nPERK UP: http://skyrim.nexusmods.com/downloads/file.php?id=9359 An awesome perk overhaul by Slayerjerman, that adds TONS of great perks to the skill tree\r\n\r\nDeft Movement Slow Time Effect by Maleficus04 http://skyrim.nexusmods.com/downloads/file.php?id=6478  An amazing mod that modifies the deft movement perk.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n                                           ",
  "categoryId": "75",
  "version": "v2.3",
  "author": "GKorr",
  "createdUnix": "1332202258",
  "updatedUnix": "1334543002",
  "containsAdultContent": false,
  "uploadedBy": "GKorr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "47768",
      "name": "Spell Sword Tools Of Trade Perks",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4",
      "fileName": "Spell Sword Tools Of Trade Perks-13297-1.rar",
      "uploadedUnix": "1332977413",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/a819768758e47cb0ba9577b4c226556770137ffde67ef77bf424111af8f9f326/analysis/1406784994/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spell%20Sword%20Tools%20Of%20Trade%20Perks-13297-1.rar?fid=47768&ttl=1535775949&ri=8192&rs=8192&setec=c192bb30cc69d5a24b38fc94200c8744"
    },
    {
      "fileId": "53623",
      "name": "GKorrSpellsV23",
      "version": "v2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "GKorrSpellsV23-13297-v2-3.rar",
      "uploadedUnix": "1334543002",
      "modVersion": "v2.3",
      "virusScanUrl": "https://www.virustotal.com/file/40137af07b0ed70324517cdf78d1290a043ef53855fc92280c3e9f08c5a7bd9a/analysis/1406818094/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GKorrSpellsV23-13297-v2-3.rar?fid=53623&ttl=1535775950&ri=8192&rs=8192&setec=38f4a3e0c0762c9e2f42b9667745c0a3"
    }
  ]
}