{
  "modId": 13299.0,
  "modName": "The Morthal Legacy",
  "summary": "\\\"The Morthal Legacy\\\" is a mod which adds content to the small town of Morthal and underlines its thrilling atmosphere.",
  "descriptionHtml": "- Adds three new houses to explore, full of tasks, enemies, loot, vicious ambushes, traps and challenging battles\r\n- One of the new houses is a cosy player house as a reward for you to relax after battle\r\n- Adds an exciting new dungeon with many encounters and enemies\r\n- Adds new guests to the Moorside Inn, one of them a wealthy merchant\r\n- And many more for you to discover\r\n\r\n\r\nDifficulty: This mod is designed for higher level characters\r\n\r\n\r\n\r\n\r\nMore mods to come to bring even more life to Skyrim. My goal is to add mods which don\\'t feel like mods. The new content should flow with Skyrim like its suppost to be there.\r\n\r\nPlease like if you enjoyed playing the mod for a representative rating. Feedback of any kind is always welcome!\r\n\r\n\r\n\r\nSpoiler: You get the key for the new player house (Ellind\\'s Retreat) at the end of the dungeon. The key to Marlah\\'s House is behind it in a basket. The key to the Mysterious House is on a table next to the guard. The entrance to the dungeon is inside the Mysterious House.\r\n\r\n\r\n\r\nKnown Issue: Might conflict with other content adding mods. You won\\'t be able to load your savegame. Unticking them for the time playing this mod is the fastest solution.",
  "categoryId": "53",
  "version": "1.7",
  "author": "Bulkbu",
  "createdUnix": "1332203611",
  "updatedUnix": "1332203965",
  "containsAdultContent": false,
  "uploadedBy": "Bulkbu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "44963",
      "name": "MorthalsLegacy",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "193",
      "fileName": "MorthalsLegacy-13299-1.rar",
      "uploadedUnix": "1332203965",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/dd66dac4efa717fba66bb1465f6e8b7050eac87a815b92b1463a38c9b527363f/analysis/1406768789/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MorthalsLegacy-13299-1.rar?fid=44963&ttl=1535775952&ri=8192&rs=8192&setec=a4d835b2492bd6b568cfbcc9f84b1c9a"
    }
  ]
}