{
  "modId": 13308.0,
  "modName": "Savage Cleave 1_0 By Gigaba",
  "summary": "A Dual wield Sweep perk for Sideways power attacks and standing power attacks, at the cost of 20% dual wield damage.",
  "descriptionHtml": "__This is a Dual wield Sweep perk for Sideways power attacks and standing power attacks, at the cost of 20% dual wield damage.\r\n\r\n__My goal was to make this mod (as well as Guardian Sweep and titan bash) Without making them over-powered, so I split them up, shield users and dual wielders, each with there own places, advantages and disadvantages. It would have been easy to just make 1 one-handed Sweep mod that does everything. but that leads to extreme OP abilities that just make the game dry. so I have been slitting up melee combat into as many different ways as I can, then giving each type its own Sweeping perk each with there own buffs and debuffs to make them more practical. \r\n\r\nHere is the break down for each of the perks:\r\n-SAVAGE CLEAVE is a perk that replaces your Dual Savagery perk. It makes all of your sideways AND Standing power attacks sweep, hitting everyone in front of you. But your weapon damage is reduced by 20% while dual wielding. This is unlock-able at skill level 100.\r\n\r\n-GUARDIAN STRIKE Makes all of your Sideways Power attacks Sweep everyone in front of you and gives you a 25% damage increase, But you MUST be using a shield with your One-Handed Weapon in order to sweep. this perk replaces Paralyzing Strike in the One-Handed Skill tree and is unlock-able at skill level 70.\r\n\r\n-TITAN BASH causes your Shield Bash to hit everyone in front of you... I think that is pretty self explanatory. Replaces Disarming Bash in you Block skill tree and is unlock-able at skill level 70\r\n\r\n__Download Guardian Sweep here:  http://skyrim.nexusmods.com/downloads/file.php?id=12609\r\n(Sweep with 1-handed sword while using a shield)\r\n\r\n__Download Titan Bash here: http://skyrim.nexusmods.com/downloads/file.php?id=13339\r\n(Shield bash sweep that hits everyone in front of you)\r\n\r\nfuture adjustments:\r\n- making the perk visible and usable in the perk tree-----------------(COMPLETE!!)\r\n- making a separate perk for dual wield------------------------------------(COMPLETE!!)\r\n- making shield bash stagger everyone in front of you-----------------(COMPLETE!!)\r\n\r\n\r\nINSTALLATION:\r\n-NMM works like a charm\r\n\r\nFor you manual installerers:\r\n-unzip the folder and put everything into the Skyrim Data folder.\r\n-[Computer/HP(C:)/Program Files/Steam/Steamapps/common/Skyrim/Data]\r\n-don\\'t just put the whole folder into data files after you unzip it, take the contents of the fold and drag/copy & past it into the skyrim data file.",
  "categoryId": "77",
  "version": "1.0",
  "author": "Gigaba",
  "createdUnix": "1332221620",
  "updatedUnix": "1332259150",
  "containsAdultContent": false,
  "uploadedBy": "Gigaba101",
  "primaryFile": null,
  "files": [
    {
      "fileId": "45116",
      "name": "Savage Cleave 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Savage Cleave 1_0-13308-1-0.zip",
      "uploadedUnix": "1332259150",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6e3e0b0671f0bb1f86bf2b94a9f070137dd8ea06cabbd19cc691ad5c0a54baa6/analysis/1406769633/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Savage%20Cleave%201_0-13308-1-0.zip?fid=45116&ttl=1535775977&ri=8192&rs=8192&setec=441a06e5cc502e23e9a559a94d599f2f"
    }
  ]
}