{
  "modId": 13314.0,
  "modName": "Solitude Lighthouse ON",
  "summary": "CAUTION: SPOILERS!\r\nTurn the lighthouse back on after you\\'ve completed the quest \\\"Lights Out!\\\"\r\nDon\\'t look any further if you have not completed this quest.",
  "descriptionHtml": "** CAUTION POSSIBLE SPOILER  **\r\nDo not look further, or download this mod if you have not completed the quest \\\"Lights Out!\\\" with Jaree-Ra in Solitude.\r\n*\r\n*\r\n*\r\n*\r\n*\r\n*\r\n*\r\n*\r\n*\r\n*\r\n*\r\n*\r\n*\r\n*\r\n\r\nThis mod simply replaces the Solitude Lighthouse fire-light. \r\n\r\nI felt pretty guilty after I was foolish enough to participate in Jaree-Ra\\'s evil plans, and I always felt bad that the stupid and lazy lighthouse attendant, Ma\\'zaka, never seemed to notice that the fire was out.  I always worried about other ships along the coast falling victim to the jagged shores of Solitude because of my reckless actions. \r\n\r\nI don\\'t know anything about scripting, so my solution was to create a mod that just adds a new fire to the Solitude lighthouse.   There is no quest or in-game interaction needed with this mod, just drop it into to your Data folder and the next time you visit Solitude the fire should be re-lit.   No need to talk to Ma\\'zaka (he\\'s kind of a lazy putz anyway).\r\n\r\nI have no idea if this mod will conflict with any others, or if it will work for you.   I can see the fire from the balcony at Proudspire Manor and any place in Tamriel where the lighthouse is visible, so it should work for you.  If it doesn\\'t I won\\'t know how to help you, but give it a try if you feel bad about what happened to the crew of the Icerunner, like I do.  It won\\'t bring them back, but perhaps it will prevent some other poor souls from forfeiting their lives because of your selfishness and Jaree-Ra\\'s deceit.\r\n\r\nThis mod comes as-is and I won\\'t be upgrading or changing it, so don\\'t ask.  This mod could break your game, corrupt your save-files, burn your house down and then insult you mother, so install it at your own risk.  If you think it\\'s broken, fix it -- and re-post the fix. If you think you can do better, be my guest.  If you can do something cool with it like create a script that get Ma\\'zaka to re-light it himself, please post it on the Nexus and let me know.\r\n\r\nIn any event, I hope this little mod helps you relieve some of your own guilt about dooming those poor sailors as it has helped me relieve a little of my own...",
  "categoryId": "78",
  "version": "final",
  "author": "Hosidax",
  "createdUnix": "1332232550",
  "updatedUnix": "1332232686",
  "containsAdultContent": false,
  "uploadedBy": "Hosidax",
  "primaryFile": null,
  "files": [
    {
      "fileId": "45049",
      "name": "SLighthouseON",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "SLighthouseON-13314-1.zip",
      "uploadedUnix": "1332232686",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a618b294b0683c9ebac0e864f2057e2925f17b3803217ddc82057df4d9aa99c5/analysis/1406769321/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SLighthouseON-13314-1.zip?fid=45049&ttl=1535775988&ri=8192&rs=8192&setec=ff62ffa98e00c1b0b0d08dc365d9baf0"
    }
  ]
}