{
  "modId": 13326.0,
  "modName": "Argonian Merchants Camp",
  "summary": "A small merchants camp outside the cave when you exit after the Helgen escape.",
  "descriptionHtml": "--Story--\r\n\r\nUpon exiting the cave after your escape from Helgen you notice smoke from behind a rock near you. You investigate and discover the remains of a merchants camp. A campfire, bedroll, cooking spit, a chest and a barrel, and the remains of an Argonian merchant and large, black bear.\r\nThe merchant is laden with loot as is his unlocked chest.\r\n\r\n--What this does--\r\nDepending on whos side you pick when entering the keep in Helgen really decides what kind of loot you\\'ll get. If you choose the Imperial side you really do get feck all, while choosing the Stormcloaks you\\'ll get about 500G+ worth of armor from Imperial Soldiers you kill. \r\nSo I decided, to even out the playing field, throwing a small camp outside the exit would be a good idea. The loot in the chest isnt anything special. Its mostly level appropriate. Theres some wine/beer in the barrel and alchemy ingredients on the merchant. I plan on adding making it a better camp when I have time, as well as a map marker and creating an outdoor player home.\r\n-Note-\r\nChests do not respawn so feel free to store stuff in them. \r\nSame goes for the barrel.\r\n\r\n-Conflicts-\r\nShouldnt conflict with anything unless it changes the landscape at that spot.\r\n\r\n-Issues-\r\nIf you have any issues let me know.",
  "categoryId": "89",
  "version": "1.0",
  "author": "Edg3",
  "createdUnix": "1332254457",
  "updatedUnix": "1332254570",
  "containsAdultContent": false,
  "uploadedBy": "Edg3k",
  "primaryFile": null,
  "files": [
    {
      "fileId": "45096",
      "name": "Main File",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Main File-13326-1-0.rar",
      "uploadedUnix": "1332254570",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/60469acb427abfdb9ee0b00132665ce206af809621c21cefe68552e0676ab3a7/analysis/1406769423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-13326-1-0.rar?fid=45096&ttl=1535776008&ri=8192&rs=8192&setec=0a8585e6ada02b04400b2c40e9a116b0"
    }
  ]
}