{
  "modId": 13329.0,
  "modName": "Nagas Cavern",
  "summary": "Unusual Cave geared for Argonians\r\nLocated behind a waterfall, North of Rorikstead, west from Talking Stone Camp.",
  "descriptionHtml": "-NEW-\r\n**Update 1. 7 @ (5/13/2012)**\r\n-Redid the underwater area, it is now no longer completely underwater and everyone can enjoy the area without drowning.\r\n-Redid the exit tube from the water area to the cavern, it is much easier to get from point A to point B, re-Navmeshed as well\r\n-Added more plants and critters to the water area, lots!\r\n\r\nA lovely video, Exploring the Naga Cavern HD 1080p, made by xBonderx\r\nhttp://www.youtube.com/watch?v=tJISDnr8hQw&feature=channel&list=UL\r\n\r\n*Note*\r\nFollowers will get stuck sometimes and have to be lured to follow you again, just go back to them and eventually they will either follow you or bounce/teleport onto the next Navmesh tiles. This is the best I can do without totally redoing the entire underwater lay-out, I made the mod and tested it the entire time without followers because I don\\'t use them, but for everyone that enjoys them I took the time to painstakingly Navmesh the place for you, so please understand that its not a nice even flow, and not because my Navmesh job is bad, but because I made some very tight spots and areas you have to jump up a little because I wasn\\'t using followers and it didn\\'t seem to matter. So you will have to provoke them into the area you want sometimes because they will not ever JUMP up, and I made a few areas where you have to jump a 1/2 a foot to get over a rock etc... and followers just will not do it, so you have to push them or run ahead of them a little ways and come back towards them, after a few times of this they usually bounce to your location or realize they can walk around the rock. I didn\\'t make the followers AI so I cant help they are dense. =) Enjoy! \r\n\r\nAlso, I plan to add a \\\"Back Door\\\" entrance/exit so you can avoid the water area all together if you like, also to help prevent too many headaches from trying to make the followers , follow. =)\r\n___________________________________________________________________________________________________________________________________\r\n\r\nA cavern abode made for my Argonian but usable by any race in Skyrim.\r\n\r\nThis is my first mod! So it is probably not the most effecient or practical, but its fun and creative. I tried to make a place that felt like somewhere an Argonian would live. Hope you like to get wet!!!\r\n\r\nNagas Cavern is located behind a waterfall north of Rorikstead, west from Talking Stone Camp. A cave system, with plenty of water, waterfalls, plants and critters plus an ambient atmosphere, the entrance leads to an underwater ruins with exotic gardens and creatures which then opens up into a unique player home. Geared for Argonians, but usuable by anyone, it provides all the necessities. As well as plenty of storage containers and trophy display, along with lots of other surprises.\r\n\r\n\r\nContains:\r\n-Fast travel marker to entrance\r\n-A bed\r\n-A cooking pot\r\n-A blacksmith forge\r\n-An anvil\r\n-A smelter\r\n-A grindstone\r\n-A workbench\r\n-A tanning rack\r\n-A wood chopping block\r\n-Two alchemy stations\r\n-Two enchanting stations\r\n-A lot of containers for storage ( all no-respawn )\r\n-3 (5 slot) weapon racks\r\n-4 shield/dual weapon plaques\r\n-9 \\\"miniature\\\" mannequins\r\n-2 bookshelves (77 books storage total)\r\n-removable torch sconces for prefered lighting\r\n\r\n\r\nAlso, provides a bathing area under two small waterfalls with benches and wash basin, a dining/kitchen area, a swamp cooler with clam and barnacle aquariums, a salmon fishery and hatchery and two minnow bowls complete with ornaments, a Hist tree that provides Hist Sap and Resin (both edible) and a regenerating Hist tree (plan to make this so player can pray at the tree and get a skill bonus), a poison and disease shrine, a mysterious ball lighting room (Hist Sap hallucinations, plan to make this a portal room as well) and knickknack shelves with miniatures ( still adding to this), among many other sights for the eyes. Don\\'t forgot to look up, a lot, there are multiple skylight holes and the cavern also has day/night effects. \r\n\r\n**Old Updates**\r\n*Update 1. 5 @ (5/12/2012)*\r\n-Added 2 more torch scones to the crafting area\r\n-Removed the fog in the Hist tree area and replaced it with mist, I like this much better and it doesn\\'t seem to lag as much in there as well\r\n-Added Bonderberry Bushes, a special thanks for Bonder for making a really nice video of the cavern and allowing me to share it\r\n-Added a third fish bowl\r\n-Rearranged some clutter and added some new clutter to the bookshelf room\r\n-Removed a very bright light in the crystal geode to hopefully stop CTD it may have been causing some people\r\n\r\n*Update 1.3 @ (5/6/2012)*\r\n-Fixed some misplaced items\r\n-Added some more decorations and flora\r\n\r\n*Update 1.2 @ (5/6/2012)*\r\n-Added Navmesh throughout the entire cavern\r\n-Added some more decorations and pretty containers\r\n-Changed some terrain in a few spots so followers don\\'t get stuck as much on the newly added Navmesh\r\n\r\n *Update 1.1 @ (5/2/2012)*\r\n-Properly made a lot of objects/items that were meant for decoration only, STATIC! \r\n-Removed activation text on all the minnow/salmon in the fish bowls and all the plants and decorations on the miniature shelf, you can now view these without the annoying \\\"activation\\\" text =)\r\n-Added Some new colored moth/dragonflies/torchbugs in jars as decoration\r\n-Added two new types of torchbugs in the Hist Tree area\r\n*Moon Bug*\r\n*Lightning Bug* \r\nSpecial Thanks and credit to Conquestus and the mod \\\"Butterfliegen\\\"for the new bugs\r\n\r\n\r\n*Update 0.9* @(4/3/2012)\r\n-Rotated the minnow bowl to avoid sun glare from the fireplace skylight\r\n-Underwater mushrooms got horns: \r\n(Two species: \r\nshiny purple Blackmarsh deepwater vortex shrooms\r\nglowy green Blackrose horned shrooms\r\n-Added to the Soul crystal geode, really looks more like a geode now\r\n-Added flicker effects to the hanging lanterns\r\n-Removed the auto-load on torch sconces, they no longer have a torch unless you add one\r\n-Added a rug and changed the banner cover to the Lab building with miniatures\\', added a Omni glow light to the miniature action figure scene\r\n-Added more to miniatures\\' shelves\r\n-Gave the watchers\\' glowy eyes\r\n-Removed some candles\r\n-Added scripts to more clutter objects I missed to prevent Havok Settle and Blocked Activation\r\n\r\n*Update 0.8* @(4/1/2012)\r\n-Redid the new minnow bowl (turned out much better this go round)\r\n-Adjusted the crumbled stairs in the Hist tree area for a much easier path up\r\n-Adujusted some orbs in the Hist tree area\r\n-Covered up some grass in the geode\r\n-Adjusted an eye on the exterior dragon symbol\r\n\r\n*Update 0.7* @(4/1/2012)\r\n-Redid the water tiles in the underwater area. Again I\\'m new to modding and just learned why \\\"snap to grid\\\" wasn\\'t lining things up properly because I didn\\'t set my first tile to (0,0) anyways, now the water tiles have been layed out using snap to grid and angle and no longer have gaps that were causing bluriness and air pockets while underwater, It looks 90% better while underwater now!\r\n-Added some objects to the exterior entrance, symbols-Whale, Snake, Dragon...the watchers...\r\n-Added a second minnow bowl, japanese koi pond theme\r\n-Added more hanging lanterns and vegetation to the hallway between geode and bed/bath area\r\n-Added more crystals in geode\r\n-Added more vegetation to the bare skylight holes\r\n-Redid the lighting and fog and added more vegetation in the Hist Tree area\r\n-Made a few minor decoration changes\r\n\r\n\r\n*Update 0.6* @(3/30/2012)\r\n-Added a water breathing ring called \\\"Aquatic Respiration Ring\\\" for non-Argonian races to be able to enjoy the underwater area without drowning\r\n-Redid the lighting in the underwater area...again\r\n-Made the entrance/exit hole/tunnel from the underwater room much more visible by adding a light source by both of them\r\n-Changed the Eldergleam Sap to \\\"Hist Sap\\\" (just for decoration)\r\n-Changed the Spriggan Sap to \\\"Hist Tree Resin\\\" (edible and gives magic bonuses)\r\n-Added \\\"Jars of Hist Sap\\\" (edible and give full health restore, atm)\r\n-Added fog back to Hist Tree area ( forgot I moved it to rearrange)\r\n-Added a ledge and stump with roots to the regenerating Hist Tree (trying to make this tree look almost dead, but in the process of being revived by magic healing orbs)\r\n-Fixed the minnows in bowl that were swimming through the sides\r\n-Made the Safes non-respawn\r\n-Added another pillar to ramp between the crystal geode room and kitchen/bed area for easier access back up\r\n-Added more clutter to the miniatures\\' shelf\r\n\r\n\r\n*Update 0.5* @(3/27/2012)\r\n-Relocated the XMarkerHeading. New Entrance to cavern is north of Rorikstead, west of the Talking Stone Camp, I found this spot to be much more appealing. The Mapmarker is now a \\\"Grove\\\" / \\\"Pine Tree\\\" symbol\r\n-Made Fast Travel from within the cell possible\r\n-Added a fish egg hatchery\r\n-Added a bowl of freshly hatched minnow complete with sunken ship and viewing bench\r\n-Rearranged the clutter and decorations on the shelves in the laboratory next to crystal geode\r\n-Added more crystals in geode\r\n-Added some crabs (dead ones)\r\n-Enhanced the bathing and bed area\r\n-Added a few more removable torch sconces\r\n-Added a rug near stove to cover up the Potema face\r\n-Added a few signs for decoration\r\n-Adjusted a few light sources\r\n-Added glowing eyes to Jack\r\n\r\n*Future Plans*\r\n-Make it so player can kneel and pray at the regenerating hist tree, which will provide a histskin or some sort of bonus\r\n-Add Navmesh, I\\'m not a big fan of this, but if enough people enjoy this mod I might try to add it, the underwater area and really tight spots might make this very hard (been watching the Navmesh tutorial, I think I might attempt this next)\r\n-Add more miniatures to the knickknack shelf\r\n-The ball lightning room is an unexplained atmospheric electrical phenomenon, or is it magic, or is it a hallucination from eating too much Hist Sap?!?, anyways I plan to make this room into a teleporter/portals to all major cities and holds, not sure how I want to do this yet\r\n\r\n*Update 0.4*\r\nAdjusted the lighting throughout entire cell\r\nRemoved interior fog from Hist tree garden \r\nAdded removable torches in sconces in dark spots\r\nAdded more to the underwater area\r\nAdded more to the ball lighting room for water discharge experiments\r\nAdded steps and more flower gardens and a regenerating Hist tree\r\nAdded 9 mini mannequins\r\nAdded more clutter to miniature shelf\r\n\r\n*Update 0.3*\r\nAdded another secret room\r\nAdded more miniature clutter to shelves\r\nAdded some gourd bushes\r\n\r\n*Update 0.2*\r\n-Added clam and barnacle aquariums onto the swamp cooler\r\n-Added some hanging flower planters in the kitchen/bedroom/bath \r\n-Added small boulders around bed for better seams\r\n-Added more hanging items on the herb rack, trying to get a fish to appear stabbed onto a spear, not working out so far, it keeps falling down\r\n-Added more miniature clutter on shelves in building\r\n-Added DisableHavokOnLoad and BlockActivation scripts on a lot of individual items meant for decoration\r\n-Added more to the Poison and Disease shrine\r\n\r\nAlso please post any comments and let me know what your opinions are, Any feedback and suggestions are welcomed!\r\n\r\nPlease Enjoy! Leave a comment or \\\"Endorse\\\" if you like, that\\'s all I ask!",
  "categoryId": "67",
  "version": "1.7",
  "author": "MsChif",
  "createdUnix": "1332257388",
  "updatedUnix": "1336914161",
  "containsAdultContent": false,
  "uploadedBy": "MsChif",
  "primaryFile": null,
  "files": [
    {
      "fileId": "45113",
      "name": "Nagas Cavern ",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "72",
      "fileName": "Nagas Cavern -13329.zip",
      "uploadedUnix": "1332258295",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/585dc3e655f8987984fd7310da4b7db3f703d9d7b40a327e139543d70b40f11b/analysis/1406769632/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nagas%20Cavern%20-13329.zip?fid=45113&ttl=1535776013&ri=8192&rs=8192&setec=2c67e97166c1c751f151cb749956d934"
    },
    {
      "fileId": "46718",
      "name": "Nagas Cavern 0_4",
      "version": "0.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "81",
      "fileName": "Nagas Cavern 0_4-13329.rar",
      "uploadedUnix": "1332690381",
      "modVersion": "0.4",
      "virusScanUrl": "https://www.virustotal.com/file/c7cbac0bdf046634f212ac23fcc4aa44c07aad7a58e80ea86f42c60888b874b3/analysis/1406779050/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nagas%20Cavern%200_4-13329.rar?fid=46718&ttl=1535776014&ri=8192&rs=8192&setec=0da548daa5eb35b66367afea2036c0c9"
    },
    {
      "fileId": "47349",
      "name": "Nagas Cavern 0_5",
      "version": "0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "86",
      "fileName": "Nagas Cavern 0_5-13329.rar",
      "uploadedUnix": "1332859500",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/a07ba8520672a77f4920a6e2438cee0932fc5b52cb3748e737c0db768ea3987b/analysis/1406782691/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nagas%20Cavern%200_5-13329.rar?fid=47349&ttl=1535776014&ri=8192&rs=8192&setec=0667c679cfaf0ac67593207a6bb3b34e"
    },
    {
      "fileId": "48143",
      "name": "Nagas Cavern 0_6",
      "version": "0.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "88",
      "fileName": "Nagas Cavern 0_6-13329.rar",
      "uploadedUnix": "1333089942",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/4cf59bf5567848f5c56be81c42fd5e05a0fd8a2d60dce37e1064fba1a3e9bcd2/analysis/1406787242/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nagas%20Cavern%200_6-13329.rar?fid=48143&ttl=1535776015&ri=8192&rs=8192&setec=4fda989167251a020df4572cfa7ec6ca"
    },
    {
      "fileId": "58211",
      "name": "Nagas Cavern 1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "538",
      "fileName": "Nagas Cavern 1_1-13329.rar",
      "uploadedUnix": "1335987578",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/72ebff20ca46414a191315117414c179b87c6b7e5d49b46e90f1f7cc9d5f1da5/analysis/1406862129/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nagas%20Cavern%201_1-13329.rar?fid=58211&ttl=1535776015&ri=8192&rs=8192&setec=9dd3c8eef9307f0a9293f69a2ac0453a"
    },
    {
      "fileId": "59177",
      "name": "Nagas Cavern 1_3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5165",
      "fileName": "Nagas Cavern 1_3-13329.rar",
      "uploadedUnix": "1336304129",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/d52757a07cf25235ee4254a950c964e2773aa3df694f3c6c248c086abba54ee5/analysis/1406871787/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nagas%20Cavern%201_3-13329.rar?fid=59177&ttl=1535776016&ri=8192&rs=8192&setec=21bdbd531dbb76f4502aa3e8923e5913"
    },
    {
      "fileId": "60670",
      "name": "Nagas Cavern 1_5",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6639",
      "fileName": "Nagas Cavern 1_5-13329.rar",
      "uploadedUnix": "1336803217",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/0f38632264d466dfb5f7bfb1107c7cff2f52299b97f15229a0f1a00794bcbef9/analysis/1406886553/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nagas%20Cavern%201_5-13329.rar?fid=60670&ttl=1535776017&ri=8192&rs=8192&setec=bc5fd6597a9cfaec9454f3297977581f"
    },
    {
      "fileId": "61010",
      "name": "Nagas Cavern 1_7",
      "version": "1.7",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "7313",
      "fileName": "Nagas Cavern 1_7-13329-1-7.rar",
      "uploadedUnix": "1336914161",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/84d909a71116683fdf60aaa25351b91ac808108ca579ab263b8b71c599b5c8b9/analysis/1406889608/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nagas%20Cavern%201_7-13329-1-7.rar?fid=61010&ttl=1535776018&ri=8192&rs=8192&setec=b208af3d046ff5ee788e9d7bb8d389c9"
    }
  ]
}