{
  "modId": 13338.0,
  "modName": "Fur Magister",
  "summary": "Home of the Master Thief",
  "descriptionHtml": "[center][img]http://i359.photobucket.com/albums/oo37/ferogain/header.jpg[/img]\r\n\r\nFur Magister\r\nv 2.0 by Ferogain\r\n[/center]\r\n\r\n=== Description ===\r\n\r\nJust outside of the Riften South Gate is a comfortable house called Fur Magister (latin for Master Thief) The door is locked yet the key can be found on a skeleton in the bedroom of the Nightingale Hall bedroom (along with a journal explaining things). The house is (imo) VERY lore friendly. By that I mean there are small things in almost every room that a player who has gone through the Thieves Guild questline to completion will recognize. There are however NO specific pieces from the TG quests in this house that I thought were unique (Barenzia\\'s Crown, Eyes of the Falmer, etc). I felt those are in the Cistern and should remain there. But sharp eyed thieves will pick up on other things. \r\n\r\nThe house fits my idea of what the house of a Master Thief would like like. Well appointed and comfortable, but to the naked eye, nothing that stands out screaming A THIEF LIVES HERE. However, there are small things here and there that trained Guild members will spot (hidden desk safe, and of course a secret door to the Masters Sanctum among others) \r\n\r\nPlease give it a try and throw me an endorsement if you like it. Enjoy.\r\n\r\n\r\n=== Features ===\r\n\r\n4 Mannequins\r\n10 Weapon Plaques\r\n6 Weapon Rack slots\r\n12 generic containers\r\n11 Named Containers\r\n5 food/ingredient barrels\r\n7 food/ingredient sacks\r\n1 small display case\r\nCook NPC named Marius (has his own room and schedule and will vend the \\\"Homecooked Meal\\\" to those without spouses, as well as other food items\r\nEnchanting and Alchemy stations (look up for something interesting in that room)\r\nSecret Door in basement leading to Masters Sanctum (the trigger is not hard to find)\r\n\r\n=== Whats NOT in it ===\r\n\r\nSmelter\r\nsharpening wheel\r\nwork bench\r\nbook shelves (the visible type. I added 2 named bookshelf containers like the ones in the Mages Guild however)\r\nBaskets (not ONE!!!)\r\nA crapload of extraneous banners and statues that have NOTHING to do with Nocturnal or the nearest location. (still don\\'t understand why people add those to their houses)\r\n\r\n\r\n=== Installation ===\r\n\r\nUnzip \\\"furmagister2\\\" into your Data file and make sure it is checked when you start your game\r\n\r\n\r\n=== Needed Files ===\r\n\r\nThere is nothing else \\\"required\\\" for the mod, but if you want it to look like the pictures above you must have the following (these other mods are AWESOME however so you should get them anyway)\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=6604]\r\nLittle Baron Paintings 1p0 [/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7241] Sexy Riften v2 by horrorview[/url]\r\n(It was designed with v1 but when I got v2 it looked even better!!)\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=5265]Enhanced Noble Furniture 4x _byMike[/url]\r\n\r\n\r\n=== Known Issues ===\r\n\r\nThere is some slight wall mingling in one wall piece in the Sanctum. Because the size of the pieces was not a perfect fit it was unavoidable.\r\n\r\n\r\n=== Thanks ===\r\n\r\nMAD thanks to jet4571 without whose help I would not have released this puppy!! The exterior meshes were killing me and crashed my CK and he fixed them for me and gave me other great suggestions with several things in the mod (as well as fixing my Dirty Edits, which there *shouldnt* be any now. lol)\r\n\r\nBethesda (of course) for the world we play in\r\n\r\n\r\n\r\n=== Final Thoughts ===\r\n\r\nSkyrim can be a dark and foreboding place at times. And the Master Thief needs a safe place to rest his/her head at night. I hope this is that for you.\r\n\r\nIf you use and like, toss me an \\\"endorse\\\" if you get a chance. Thanks all.",
  "categoryId": "67",
  "version": "2.0",
  "author": "Ferogain",
  "createdUnix": "1332271465",
  "updatedUnix": "1333515575",
  "containsAdultContent": false,
  "uploadedBy": "ferogain",
  "primaryFile": null,
  "files": [
    {
      "fileId": "49934",
      "name": "Fur Magister",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3950",
      "fileName": "Fur Magister-13338-2-0.zip",
      "uploadedUnix": "1333515575",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/b3d3ee294ff10d7009ce0257324f9c98429c0bd62e39d7345117e0ebec579654/analysis/1406796308/",
      "changelogHtml": " Fixed some naming issues <br/> \n Fixed some interior nav-mesh <br/> \n Tweaked Cook AI <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fur%20Magister-13338-2-0.zip?fid=49934&ttl=1535776039&ri=8192&rs=8192&setec=decb504e7b971fe15bf6ec7d8f33c45f"
    }
  ]
}