{
  "modId": 13352.0,
  "modName": "Mini Pet Maker",
  "summary": "Do you ever see wild creatures in Skyrim and think, “If only I could get them to follow me around as if I were their mother...  and if only they were 1/8th their original size...”? Yes? Well,  this mod is for you, my friend.",
  "descriptionHtml": "_________________________ Brokunn\\'s Create Mini Pet Spell _________________________\r\n\r\n==========================================================================\r\nDetails\r\n\r\nYou can acquire the mini pet Spell Tome outside Whiterun, just beyond the flea-ridden Khajiit camp, and past the little river of human sewage (see map above).  Simply cast the spell on almost any creature you would cast a regular spell on, and you\\'ll have an itty-bitty, miniature version of them to love and adore.  After your love is spent, simply cast the very same spell right back at the mini pet, and all your love will be refunded so you can spend it on a new mini pet!  \r\n\r\nSpend your love on up to 6 mini pets at one time!\r\n\r\nSome things to note:\r\n1)  Mini pets are invincible, and should not be targeted/attacked by enemies.  Enemies, however, may be envious of your mini pet and target/attack you in an attempt to steal them.\r\n\r\n2)  The mini pet created may not match the target exactly, especially with humanoids.  This is because the White-Gold Concordant has a clause that outlaws cloning in Tamriel.  Oh, and humanoids will be naked.  Naked, disgusting little people chasing you around.  Think about that a bit before you even try it.\r\n\r\n3)  If you don\\'t see your mini pet right away, DO NOT PANIC.  First, consider the new mini-pet\\'s feelings...  it was just brought into this world, and you\\'re very large and intimidating.  Try casting Detect Life to see if you can locate the little fellow.  Fast travel to an indoor location and see if the mini pet is easier to spot.  It\\'s also possible my crappy spell just didn\\'t work...\r\n\r\n4)  Avoid “noisy” mini pets.  Though a Mammoth mini pet seems like a good idea, the physics of Skyrim dictates that they retain the same mass no matter what their size.  A thundering herd of mini-mammoths following you into town is a great way to get evicted.\r\n\r\n5)  Cast the spell frugally - casting it multiple times in succession will do nothing.  You\\'ll see the special effect if it hits the target successfully (sometimes it is difficult to hit smaller targets, try getting close and facing down at them to cast the spell).\r\n\r\n\r\n\r\n==========================================================================\r\nMedia & Links:\r\n---------------------------------------------------------------------------------------\r\nThis mod is available at:\r\n- Steam: http://steamcommunity.com/sharedfiles/filedetails/?id=17586\r\n- Nexus: http://skyrim.nexusmods.com/downloads/file.php?id=13352\r\n\r\n\r\n\r\n==========================================================================\r\nFuture Updates & Known Issues:\r\n\r\n1)  Foxes don\\'t seem to work (you\\'ll get an invisible one - try casting Detect Life to see it).\r\n2)  The sex of certain creatures is not always attainable, the script defaults to male for now.\r\n3)  Mini Pets set off traps...  \r\n4)  “Large” animals (Mammoths, Dragons, etc) have some strange clipping issues\r\n5)  I can adjust mini pet size and speed on a case by case basis, and have made some tweaks for very large (dragons, mammoths) and very small (chickens, hares) creatures.  If you notice any that need more adjustments, please let me know.\r\n6)  For the love of Mara, I wish I could shut off the mini pet\\'s sound...\r\n\r\n\r\n\r\n==========================================================================\r\nTroubleshooting Guide: http://www.creationkit.com/Mod_Troubleshooting\r\n\r\n\r\n\r\n==========================================================================\r\nSpecial Thanks          \r\n- My wife for forcing me to make this mod...\r\n- Search terms:  Mini Pet Maker, Conjure Mini Pet, Summon Mini Pet, Conjure Pet, Summon Pet, Tiny, Adorable, Absurdly Cute Itty-Bitty Bunnies...\r\n\r\n##########################################################################\r\nDon’t forget to check out my less adorable, but exponentially more practical Conjure Ethereal Horse Spell!\r\n- Steam: http://steamcommunity.com/sharedfiles/filedetails/?id=11235\r\n- Nexus: http://skyrim.nexusmods.com/downloads/file.php?id=9534\r\n\r\n\r\n\r\n==========================================================================\r\nChange Log\r\n__________________ 2012-03-26 Version 1.1\r\n1)  Mini pets should no longer become hostile to the player if attacked (this only works on NEW mini pets, so banish your current pets and re-acquire).\r\n2)  Casting the spell on your existing mini pets now gives you three options: Stay, Follow, and Banish\r\n3)  Made the spell tome a little easier to find by lighting it on fire.  ",
  "categoryId": "83",
  "version": "1.1",
  "author": "Brokunn",
  "createdUnix": "1332289629",
  "updatedUnix": "1332815783",
  "containsAdultContent": false,
  "uploadedBy": "Brokunn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "45239",
      "name": "MiniPet_1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10",
      "fileName": "MiniPet_1_0-13352.7z",
      "uploadedUnix": "1332289673",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/13777c68aa304f0a4e7e350323e77a5ac2c0aa7c513df994aabaaf3c2b504331/analysis/1406770417/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MiniPet_1_0-13352.7z?fid=45239&ttl=1535776063&ri=8192&rs=8192&setec=4425909587578b865a32d7894a3344e4"
    },
    {
      "fileId": "47233",
      "name": "MiniPet_1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "MiniPet_1_1-13352-1-1.7z",
      "uploadedUnix": "1332815783",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5a6c7d68fdd8f9e6ecf8ab4859c190e3e17b75b2929f8bff89f06671ddb8ddfd/analysis/1406782204/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MiniPet_1_1-13352-1-1.7z?fid=47233&ttl=1535776063&ri=8192&rs=8192&setec=bfac0c3e2f418d1daec73cdcdc48d36b"
    }
  ]
}