{
  "modId": 13358.0,
  "modName": "A meticulously balanced hardcore mage experience",
  "summary": "This mod ",
  "descriptionHtml": "Overview:\r\nThis is a mod for the hardcore purist mage.  People who like huge challenges, and want to be rewarded when they succeed.  Despite working on it for my entire skyrim playing time, I haven\\'t released a single version of it because the goal is balance from start to finish.  So it takes weeks to make a full iteration.  So when I say it\\'s been balanced, I mean that I played through the entire game with it twice so far to ensure it meets my own high standards for a hardcore experience.\r\n\r\nSo what exactly does it mean to be a hardcore mage experience.  Well when I think of mages in the classical sense, I think of characters who spend their lives studying the art of magic, to the exclusion of everything else, and as they reach that goal of becoming a master magician, they become gods among men.  My goal here was to recreate that.  \r\n\r\nFully installed without other mods interfering, this mod is hard.  It\\'s built to make you fail to become a superior magician.  Even I have failed with at least two characters.  You will be tempted, and if you diverge from your path, you will find yourself weak, unsuccessful, perhaps even convinced the mod is broken.  And in a way, that means it succeeded in conquering you.  It\\'s not unfair.  All the tools are there to succeed.\r\n\r\nWhat this mod doesn\\'t do is provide a huge number of all powerful spells.  In fact it only adds a couple new spells.  \r\n\r\nSo what can you expect:\r\nWell, your magical skills are very weak at the beginning of the game.  Your magicka regenerates slowly.  Your spells take a while to cast.  You will be penalized for wearing armor, and robes will make it barely tolerable.  The real temptation, if you become a jack of all trades then you will be a master of none and ultimately a lousy magician.\r\n\r\nAs you progress into early mid game, assuming you maintained your focus, you\\'ll suddenly find things beginning to fall into place.  You won\\'t be tempted quite so much.  You\\'ll struggle some against mighty enemies, but you\\'ll begin to feel like a true magician.  You\\'ll itch for each extra bit of power.\r\n\r\nIf you reach mid game, and your character is still viable, you\\'ll be well on your path to succeed.  Spells which may have seemed impossible to use early game are within your grasp.  And then you\\'ll find the truth.. the exploits are gone!  The shortcut to unlimited power is impossible to reach.  No, to continue your path to ultimate power, you must truly become the master mage.  That singular focus on magic, study and practice.\r\n\r\n\r\nInstallation:\r\nExtract all files to your data directory.\r\n\r\nThis mod requires script dragon.\r\n\r\nBecause this mod is entirely focused on balance, and I assume you want that experience, I highly suggest you disable other mods focused on magic based gameplay changes.  \r\n\r\nWhat this mod changes:\r\nPerk trees for all 5 schools of magic.\r\nEnchantments and how they affect your character and the enchanting perk tree\r\nMagicka regeneration rates\r\nRobes, when you can find them and buy them.\r\nSpell power scaling\r\nSpell costs, damage, and leveling factors\r\n\r\nWhile not included in the mod I also highly suggest these mods and gameplay changes in order to \r\nmaintain the balance:\r\nDifficulty - Expert\r\nStarting all skills at level 1\r\n1 perk per level at least up to level 50\r\nElys Uncapper\r\nDeath has consequences and follower skill advancement\r\nKey unlevelled dungeons.\r\n\r\n\r\n\r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "Xanthen",
  "createdUnix": "1332293254",
  "updatedUnix": "1332293254",
  "containsAdultContent": false,
  "uploadedBy": "Xanthen",
  "primaryFile": null,
  "files": []
}