{
  "modId": 13369.0,
  "modName": "Redguard Spellsword Sirenia",
  "summary": "Female Redguard Companion",
  "descriptionHtml": ":::Requested Mod:::\r\n\r\nUpdate: Added a variant to the download page without the Fireball spell (for people that use multiple companions) and without default clothing (she will appear nude but will wear any clothing you give her). Uploaded by request from chemjab1.\r\n\r\nSirenia is a strong and sultry Redguard woman that has traveled to Skyrim in search of fame and adventure during the province\\'s state of chaos and upheaval. She has no qualms sharing the glory with a like-minded soul as long as they\\'re willing to stand beside her rather than treat her like a common maiden. She will aid you with her sword and her spells, she is essential, and she can be married. You can find her resting in The Winking Skeever in Solitude.\r\n\r\nLike all of my other companion mods; Sirenia will loiter around in the area that you dismiss her once you tell her you want to part ways (drop her as a companion). So if you can\\'t find her after you ask her to leave your service make sure to go back to where you left her. I set her AI up this way so that you can leave her in a convenient place and she won\\'t wonder off (you can also have her stay behind in one of your houses until you want her to tag along with you again). Remember that ALL of my companion mods have this feature.\r\n\r\nIMPORTANT NOTE: This mod must have the following mod in order to work correctly:\r\n:::Apachii Sky Hair:::\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10168\r\nIf you have issues with hair colors turning dark when near light sources; download teh vanilla hair option on Apachii\\'s page and that should fix the issue.\r\n\r\nManual Installation:\r\nPlace the zip file\\'s contents into your Skyrim/data folder to install and be sure to activate the ESP and ESM files in your Data Files listing. Ensure that the Apachii Sky Hair ESP and ESM are ABOVE Sirenia\\'s data files in your load order (I\\'d recommend placing Sirenia\\'s files dead last in the load order so there are no conflicts).\r\n\r\nRecommended (but not required) mods to get her as she appears in the screen shots:\r\n\r\nFeatured outfit: Gatti Bondage Type-1 Reinare \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=12803\r\n\r\nCBBE V3 (standard body) and the hip texture compatability pack:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2666\r\n\r\nBella\\'s Better Females version 3:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2812\r\n\r\nCover Eyes (eyes 1 file):\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4869\r\n\r\nKiller Keos Skimpy CBBE V2 Armor Set:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3654\r\n\r\nSpecial thanks to Blackie for his CM New Companions mod that includes a top-notch detailed tutorial on how to create Skyrim companions without the face discoloration bug. Get his mod and tutorial (contained in the mod) here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11669\r\n\r\nThe work around I found for the bug with Bella\\'s face mod (the bug involving women looking like they have faint beard stubble on their jawline and chin) is to use the standard Better Faces Version 3, and then apply the \\\"No Shine\\\" option available on her mod page.\r\n\r\nSpecial note: All of my future companions after Divada, Taja, Viin, and Kyia will be made using the Better Females by Bella mod. I switched to another mod set for faces previously due to a bug I couldn\\'t resolve (the issue with females having faint male beard stubble on their faces while using Bella\\'s). I have resolved that issue, so I\\'ll be going back to Bella\\'s for my projects from now on. You DO NOT have to switch to Bella\\'s if you use Envision faces and RANs Headmesh (what I used previously) OR if you use other face mods. All of my companions should work with other face/body mods and vanilla setups unless specifically mentioned in the description.\r\n\r\nThanks for looking at my work, and I hope you enjoy taking Sirenia with you on your adventures.\r\n\r\nI recommend a manual install of this mod (read me included in the zip file). Install with Nexus Mod Manager at your own risk.",
  "categoryId": "66",
  "version": "1",
  "author": "Grimraven1",
  "createdUnix": "1332309688",
  "updatedUnix": "1334528270",
  "containsAdultContent": false,
  "uploadedBy": "Grimraven1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "45320",
      "name": "Sirenia",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1128",
      "fileName": "Sirenia-13369-1.rar",
      "uploadedUnix": "1332309799",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/a34e44044c02c54ded49ac353ee07c74e876102925832cb8edb96264036528ba/analysis/1406770864/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sirenia-13369-1.rar?fid=45320&ttl=1535776086&ri=8192&rs=8192&setec=454c6dcf363dce75a4cec8eeeb0ebc37"
    },
    {
      "fileId": "53569",
      "name": "Sirenia No Fireball No Default Clothing",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1128",
      "fileName": "Sirenia No Fireball No Default Clothing-13369-1.rar",
      "uploadedUnix": "1334528270",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/42973b29a2df58f42aa9d16c6df43639b6cefa51e1f57bdd93167166a66cdb5e/analysis/1406817723/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sirenia%20No%20Fireball%20No%20Default%20Clothing-13369-1.rar?fid=53569&ttl=1535776087&ri=8192&rs=8192&setec=8e9ce1138caec06491f360c9eaafaf85"
    }
  ]
}