{
  "modId": 13384.0,
  "modName": "Smithing Rebalanced",
  "summary": "Smithing in Skyrim is fun and rewarding, but also has the potential to turn the game into godmode fairly early - before the player even acquires relevant perks. If this is something you enjoy, this mod is not for you. \r\n\r\nIf you would like to reduce the power of Smithing a bit (but without completely gimping it to hell), read on.",
  "descriptionHtml": "Smithing Rebalanced\r\nVersion 1.1\r\nAuthor: Damar Stiehl\r\n\r\nOVERVIEW:\r\n\r\nSmithing in Skyrim is fun and rewarding, but also has the potential to turn the game into godmode fairly early - before the player even acquires relevant perks. If this is something you enjoy, this mod is not for you. \r\n\r\nIf you would like to reduce the power of Smithing a bit (but without completely gimping it to hell), read on.\r\n\r\nCHANGELOG:\r\n\r\nVersion 1.1\r\n\r\n- Added a module that decreases the magnitude of player-made Fortify Smithing potions by 50%.\r\n\r\nVersion 1.0\r\n\r\n- Initial Release\r\n\r\nCOMPATIBILITY:\r\n\r\nThis mod is incompatible with any other mod that modifies:\r\n\r\n- Smithing Perk tree\r\n- Alchemical ingredients that carry Fortify Smithing effect\r\n- Fortify Smithing Alchemical Magickal Effect\r\n- Fortify Smithing Enchantment Effect\r\n\r\nThis mod does NOT add any new recipes, or modify any existing recipes.\r\n\r\nINSTALLATION:\r\n\r\nIMPORTANT: Before installing the mod for the first time or upgrading to a new version, always strip your character of all gear and type \\\"player.dispelallspells\\\" into console. Then, save your game into a new slot.\r\n\r\nTo install, copy the ESPs to your Data Folder and check them in Skyrim launcher.\r\nTo uninstall, uncheck the ESPs and delete them.\r\n\r\nDETAILED DESCRIPTION:\r\n\r\nThis mod is modular, and you can use as many or as few components as you like. Of course, if you choose not to use some of the components, your experience may end up a bit lopsided.\r\n\r\nSmithing Rebalanced - Perk Tree.esp\r\n\r\nThis module changes the Smithing perk tree. The root perk is Steel Smithing, as it is in Vanilla Skyrim. The next perk you MUST get in order to progress is Advanced Armors - this represents your character graduating from just hammering steel and armor plates to crafting comlpex and intricate armors like Scale and Steel Plate.\r\n\r\nAfter purchasing Advanced Armors, you are free to buy ANY OTHER perk in the tree, provided you have the skill. You can pick up Dwarven, Orcish, Glass or Elven Smithing if you\\'d like, or you can just grind your skill to 100 and go straight to Dragon and Ebony Smithing. Daedric Smithing is one exception: you must buy Ebony Smithing perk first, because Daedric weapons and armor are really Ebony with Daedra essence melted in.\r\n\r\nSmithing Rebalanced - Fortify Smithing Potions Increase SmithingMod.esp\r\n\r\nIn Skyrim, Fortify Smithing enchantments and potions work differently. Enchantments increase your skill, and the weapon and armor improvements that result from this obey the skill-based formula (in other words, they are relatively mild). However, Fortify Smithing potions apply their percentage increases directly to the weapon\\'s damage or armor\\'s rating, resulting in outrageously powerful items.\r\n\r\nThis module changes Fortify Smithing alchemy effect so it also fortifies the Smithing skill like the Enchantments do. Taking potions of Fortify Smithing will still give you improved smithing results, but they will not be quite as over the top as under Vanilla rules.\r\n\r\nSmithing Rebalanced - Fortify Smithing Enchantment Restricted.esp\r\n\r\nThis module restricts the player-made Fortify Smithing enchantments to Glove and Necklace slots. You may still find Rings, Clothes and Cuirasses of Fortify Smithing in the world - let\\'s assume they were created by experienced professional enchanters like Sergius Turrianus, and not self-taught amateurs like yourself. This makes these randomly-found items extra-valuable to power-seeking player.\r\n\r\nAlso, if you apply this mod to an existing game, your previously-created Fortify Smithing gear will be just as valid - you just won\\'t be able to make more of it.\r\n\r\nSmithing Rebalanced - Condition Factor Lowered.esp\r\n\r\nThis module reduces the overall degree to which items can be improved with Smithing by about 17%. It makes it more difficult to create Legendary-grade items without high skill and a relevant perk.\r\n\r\nSmithing Rebalanced - Fortify Smithing Potions Magnitude Decreased.esp\r\n\r\nThis module reduces the magnitude of player-made Fortify Smithing potions by 50%.\r\n\r\nFAQ:\r\n\r\nQ: How bad is the nerf?\r\nA: For example, the heaviest-hitting \\\"stock\\\" weapon in Skyrim (a Daedric Warhammer), with all relevant perks (Barbarian rank 5)and fully improved to Legendary by a fully-buffed smith, will produce about 200 pt. of damage per hit. To contrast, under Vanilla rules my character who only had 50 points in Two-Handed weapons and 3 ranks of Barbarian had a Legendary Daedric Greatsword that hit for 360 pts. per hit.\r\n\r\nQ: Why use this mod? Why did you make it? Isn\\'t it fun to WTFBBQPWN everything?\r\nA: After a while, godmodding gets tiresome, and I don\\'t like to artificially limit myself from WITHIN the game.\r\n\r\nQ: I applied the mod to an existing game, and now my Smithing tree is all messed up and some of the perks don\\'t work.\r\nA: Are you missing the Advanced Armors perk? If so, open console and type: player.addperk cb414, or you could just buy the Advanced Armors perk during your next level-up. Once you have the Advanced Armors perk, everything will go back to normal.\r\n\r\nQ: Will I still be able to hit armor cap wearing any armor?\r\nA: Probably yes, but you\\'ll need to buff your Smithing with both Enchants and Potions, and buy relevant Armor perks.\r\n\r\nQ: After I buy Advanced Armors, what\\'s to stop me from just cherry-picking whatever perks I want in the tree? \r\nA: Nothing at all, in fact. That is the whole point. I hate being forced to waste perks - my character will probably never wear Dwarven or Orcish gear. On the other hand, you could roleplay a dedicated smith.\r\n\r\nQ: Your graphic is ugly.\r\nA: Yes, yes it is. I forgot to take a screenshot.",
  "categoryId": "24",
  "version": "1.1",
  "author": "Damar Stiehl",
  "createdUnix": "1332342014",
  "updatedUnix": "1332774185",
  "containsAdultContent": false,
  "uploadedBy": "DamarStiehl",
  "primaryFile": null,
  "files": [
    {
      "fileId": "45407",
      "name": "Smithing_Rebalanced_1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28",
      "fileName": "Smithing_Rebalanced_1_0-13384.zip",
      "uploadedUnix": "1332342099",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/718354a03d1ff2ffb7fc1d9c750b15b42238321e4f3b49ad0d8e99814cd8016f/analysis/1406771285/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Smithing_Rebalanced_1_0-13384.zip?fid=45407&ttl=1535776112&ri=8192&rs=8192&setec=1b5f19d9ae1b8a56b3011f1caf3275ee"
    },
    {
      "fileId": "47062",
      "name": "Smithing Rebalanced",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30",
      "fileName": "Smithing Rebalanced-13384-1-1.zip",
      "uploadedUnix": "1332774185",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/dda1420361263b0fc61df0f4c44ae4886bacf6830149f7831f170f18f353ca70/analysis/1406781183/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Smithing%20Rebalanced-13384-1-1.zip?fid=47062&ttl=1535776113&ri=8192&rs=8192&setec=40483965e8d7b652567abd87a800cc10"
    }
  ]
}