{
  "modId": 13402.0,
  "modName": "81 Nord_9 free perks_No cheats_You get to face Alduin_and ma",
  "summary": "Lv 81 Nord.  Combat specialist with 9 free perks.  All that\\'s left to do is finish the last half of the main quest from Alduin\\'s Bane, do all the civil war quests, and get married.  I have done everything else, and i mean everything. ",
  "descriptionHtml": "My save file after 227 of gameplay.  It’s a level 81 Nord, every skill is at 100.  I have pretty much finished everything in Skyrim.  All that’s left to do is read the elder scroll at the Throat of the World and finish the main quest line from there, do all the civil war quests, and lastly get married.  I’ve have done everything else.  Daedric Quests, check; Companions, check; Thieves Guild, check; College of Winterhold, check; Dark Brotherhood, check.  All those side quests, yup I did those too.  And I have run all those miscellaneous errands from every citizen of skyrim. I have noticed that after some time you will get the option to run the same damn errand again so you will still have the ability to help people out. :P  Oh wait, I must take that back, I did not complete the blasted errand for that dirty Thalmor Ondolemar who wants me to find proof that Ogmund is worshiping Talos.  Fuck that, people should be able worship whoever they want as long as they don’t hurt anyone.\r\nI have not cheated with console commands, cept for once when Delvin wouldn’t accept the Left Eye of the Falmer.  I reloaded another save from 30 minutes earlier before I had entered those dwemer ruins to stop Mercer Frey .  Used “setstage TGLarceny 80” & “additem 0001994f 1” and then gave the blasted eye to Delvin. Because of this there is two of those left eyes, one on display in the thieves guild and one sitting in my house.\r\nThere are a couple bugs with my file. The first is a 15 HP boost that invaded my game early on. I’m sure you’ve heard of this problem before.  So naked I’m M300 H515 S300 instead of M300 H500 S300.  The other bug is the lack of a light blue bar by the One Handed skill tree.  It was the first skill I got to level 100 and I reached that last level by reading a skill book I found and it didn’t max out the blue bar.  I didn’t notice it was bugged until I got other skills to lv 100 and saw all the other skill bars were full.\r\nI recommend using SkyUI because it’s much faster to go through the massive amounts of items in my house. Though you can get away without it cause everything is sorted. The only other mods I used with this one was the shadow striping fix and A quality World Map.\r\n\r\nIf I have one request, it would be that you don’t kill Parthy.\r\n\r\nFeel free to \\\"showracemenu\\\" menu and edit my guy\r\n",
  "categoryId": "43",
  "version": "1.0",
  "author": "MessyMetty",
  "createdUnix": "1332357774",
  "updatedUnix": "1332357774",
  "containsAdultContent": false,
  "uploadedBy": "MessyMetty",
  "primaryFile": null,
  "files": []
}