{
  "modId": 13424.0,
  "modName": "Morrowind - The ashlands",
  "summary": "BETA version",
  "descriptionHtml": "           [img]http://tes.nexusmods.com/imageshare/images/392488-1332374242.png[/img]\r\n\r\n\r\nREAD: This mod is stopped and I don´t really know when will I get back to it, I work as long as I´m inspired but even so I have real life to deal with and little time for gaming so anyone who wishes to continue or use this as a resources feel free to do so :)\r\n\r\n\r\nUPDATE (01-04-2012):BETA 1.5 is up, delete the old esp and put the new esp in.\r\n\r\nUPDATE:2 new areas, enemies and a chitin sword.\r\n\r\nMorrowind the ashlands is a mod I´ve been working on, it is set in the ashlands a place created after the eruption of the red mountain.In this BETA version there is only three areas, the \\\"port\\\" where you enter the ashlands and two ashland areas one of them has two ash skeevers and all the areas have new flora and new weather (Note the weather will begin after a day). \r\n\r\n\r\nThe reason why they are interiors is due to the fact that making exterior worldspaces with the creation kit makes the objects and the world invisible ingame so I decided o make interior cells and still if they get to big they can cause troubles.\r\n\r\nTo get there go to the solitude docks and activate the small boat (check the location image)\r\n\r\nI released this BETA so you can tell me what you think.I´m also looking for someone who would be interest in making quests so PM me if you are interested and have the skill, thank you :)\r\n\r\n[youtube]NkLRm8r4tbY[/youtube]\r\n\r\nCredits:Saiodin for the review of my mod in his youtube series.\r\n\r\nNOTE:I will never upload this mod on steam-workshop nor do I give permission to do so. ",
  "categoryId": "30",
  "version": "BETA",
  "author": "Scot",
  "createdUnix": "1332373011",
  "updatedUnix": "1333306586",
  "containsAdultContent": false,
  "uploadedBy": "scot",
  "primaryFile": null,
  "files": [
    {
      "fileId": "49023",
      "name": "The ashlands - BETA 1 5",
      "version": "BETA",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31679",
      "fileName": "The ashlands - BETA 1 5-13424.rar",
      "uploadedUnix": "1333306586",
      "modVersion": "BETA",
      "virusScanUrl": "https://www.virustotal.com/file/a6379635d22a10921234ebfdadbdd6d4c2d05dee24bbd85b14c39b71de3be079/analysis/1406791822/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20ashlands%20-%20BETA%201%205-13424.rar?fid=49023&ttl=1535776187&ri=8192&rs=8192&setec=05774f1febd21d909c482ce750a1b849"
    }
  ]
}