{
  "modId": 13432.0,
  "modName": "Avalon Armor P_O_C W_I_P Working Resource",
  "summary": "Hellgate London Female Templar Armour Concept",
  "descriptionHtml": "Updates Here (because apparently only 3 Nexus members actually read the whole page)\r\n\r\nv1.0 plus:\r\nSorry (meh not really, but I guess it\\'s polite to say it anyhow) for the lack of recent updates, I decided that my current toon Avalon  (duh!) was the one I was going to use to actually finish the game with (yeah, yeah I know) but I got sidetracked, and then their was butchering every Thalmor I come across (teehee, got a Death Warrant on my ass for that!)\r\n\r\nSo, anyway, I\\'ll call this version 1.0 coz\\' that sounds better than 0.03 and might make people happier if the think it\\'s a more advanced version.\r\n\r\nUpdates:\r\nTweaked the Avalon (Dragonscale in game) and Daedric meshes a bit so that the elbows don\\'t stick out at weird angles any more, but I can\\'t remember weather i modified the textures as well so I\\'ve included them again.\r\n\r\nAdded a \\\"Avalonized\\\" version of the Dark Brotherhood Armor = I know it doesn\\'t look that different from original but the original wasn\\'t bad, just had that awful \\'pot belly\\' look, so I decided to turn it into a \\'Leather Harness and Skinsuit\\\" plus I\\'ve included a shortened version of Kurese\\'s boots from his \\\"Gloria\\\" Armor (http://skyrim.nexusmods.com/downloads/file.php?id=12595)\r\n\r\nAdded \\\"Avalonized\\\" version of the Nightingale Armor, again a \\\"Harness and Skinsuit\\\" type of thing, but I did tweak the Nightingale Logo a bit as well.\r\n\r\nFound an old mod I\\'d created ages ago (yeah\\' like weeks man!) of a Chainmail \\'Yeoman(woman?) Armor, so I decided to include it as well (Replaces the Light Steel Armor in game)\r\n\r\nI\\'ve added a variation of the Dwarven Armor which uses most of the original (bleh!) mesh, I\\'m hoping the guys doing the \\\"Unofficial Skyrim Patch\\\" will actually finish the Female version that BGS started (see the \\'ground\\' model for the female version in game) I\\'m still not 100% happy with it, and the boots <shudder> make it look too much like Anime for my liking, but some may like it. (again forgot the SS\\'s so bare with me a little more)\r\n\r\nEbony Mail = Yet another \\\"Avalonized\\\" mesh, tried to keep the \\'mail\\' part as much as possible and also as with most of my armors (all?) I went for Skin Tight and Sexy without any overtly rude stuff and (in theory) without removing ALL of the \\'armor\\' parts. \r\n\r\nFinally we have a variant of NPR\\'s \\'Diano Armor\\\" I saw this Armor and immediately and Idea came to mind, so I put fingers to mouse and keyboard and came up with a \\\"Barbarian\\'/ Bandit\\\" version. This one was a bit weird to put together because the gloves and boots are actually \\\"Stormcloak\\\" gear, but the armor is classed as \\\"Bandit\\\" (yeah, that was the day the coffee ran out at BGS i guess) but they are all three called \\'Fur\\\" armor in game ?!?!?\r\n\r\nThanks to the following:\r\nDimon99 for his simply mindblowingly sexy body mesh http://skyrim.nexusmods.com/downloads/file.php?id=6709\r\nNavetsea, whose skin textures I based mine on (with a few little extra touches of my own) though not included in any of my files, I do recommend this texture http://skyrim.nexusmods.com/downloads/file.php?id=6554\r\nTigersan(http://skyrim.nexusmods.com/downloads/file.php?id=44) whose normal maps I mash up with sx2rality\\'s (http://skyrim.nexusmods.com/downloads/file.php?id=13377) to create most of my \\'Skinsuit\\\" ***_msn.dds files\r\nKurese for the \\'Gloria Armor, who\\'s boots I love http://skyrim.nexusmods.com/downloads/file.php?id=12595\r\nAnd Finally \r\nNPR for his exotic an sexy \\\"Diano\\\" armor http://skyrim.nexusmods.com/downloads/file.php?id=14670#\r\n\r\nAs I said I can\\'t remember which textures I have updated so their mat be some that aren\\'t any different from previous versions (erm, yeah, sorry)\r\nAs always these are REPLACERS of ingame armors and though they will work in game they aren\\'t really what some would call \\'finished products\\\"\r\n\r\nOh and one last time THERE WILL NOT BE A ADEC VERSION OR CBBE VERSION! Or any other body type version! Period!\r\n\r\nI personally prefer the UNP mesh, although some of my creations actually use the \\'vanilla\\' BGS mesh because that\\'s what works for me. They are provided as is with no promises, but if some one wants to tweak, mod, adjust, repack for NMM or whatever, feel free, just give me some of the credit eh?\r\n\r\nv0.02plus:\r\n\r\nFirstly, a \\'minor\\' update to the Avalon textures, I found an old working file and tweaked that a bit instead of starting from scratch (again) ...\r\n\r\nOrcish Armor:\r\nI was intrigued by the body mod created by \\\"elmanouche, not because I\\'m particularly fond of overly muscular women (nothing against them however! just MPP) but more because, I thought, hmmm, wouldn\\'t it be cool if your Orcish Dovakin(ette?) could have either a normal body if she wanted to be a mage/assassin (blech! you offend Malacath with such a suggestion!)\r\nOr, a true WARRIOR body! But it doesn\\'t really work unless you have some armor! So I decided to make a version of the Orcish Armor (in the \\\"Avalon\\\" style) using his body ...\r\nThe original Body Mesh plus .esp\\'s for replacing default bodies and stuff, can be found here\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=8873\r\n(though obviously a version is already inside the Orcish armor. Duh!)\r\n\r\nAlso included in the download is a \\\"Vanilla\\\" version for those that don\\'t like the Ultra Muscular Look, but still want the armor (Just swap/rename the files as required, both versions textures/normalmaps are included in the 1 textures directory)\r\n\r\nElven Armor:\r\nAgain, in the same theme, the arms looked like twigs sticking out of a tree stump with the whole body changed to the new \\\"Golden Scale\\\" look so I reverted just the arms to basically original with a few texture/gloss/normalmap tweaks.\r\n\r\nInstallation:\r\nYou know the drill, extract to your Skyrim Folder and overwrite when/if prompted, As before the Armor \\\"MESHES\\\" are REPLACERS, but I\\'ve kept the Textures in a separate folder, for easier editing/deleting\r\n\r\nIssues/bugs with 0.02plus:\r\n\r\nAs I\\'ve said before I have no skill whatsoever with 3D modelling, so I cheated with the Orcish Boots and just recoloured/textured the calves to match reasonably closely with the boots (just don\\'t look to close ok! ... But you weren\\'t anyway were you? You were actually admiring her toned glutes in that skin tight armor instead weren\\'t you!)\r\n\r\n..............................................................................................................................\r\n\r\nThe Story:\r\nIn my own opinion the sexiest armor for a female character of all time is the Female Heavy Templar Armour from the game Hellgate:London as worn by the (infamous) Avalon.\r\n(If you don\\'t know who Avalon is or haven\\'t seen the armour before, go see a Doctor, because your probably dead!)\r\nBut if it turns out your not dead, then do a search on the web for Hellgate Hellgate London - Cinematic Trailer (you know were) And you\\'ll see why I like this armour so much\r\n\r\nThe Concept:\r\n(This is in no way a derogatory comment about the fine work done by other mod authors, and this IS just MY opinion only)\r\n\r\nOne of the biggest faults I find with many of the armour mods is that basically they simply cut the crap out of the mesh/texture, and to all intents and purposes, just turn it into a metal/leather Swimsuit/Bikini/Nightie ... So I wanted something that (I) found sexy without just being all skin. Enter Avalon.\r\n\r\nThe Execution:\r\nI\\'ll stare quite clearly that I have absolutely no talent whatsoever with 3D modelling applications, so using such a program to create the armour was out of the question, I also have only slightly more than zero skill at texturing so this work is very basic.\r\n\r\nWith the first iteration of the armour I used the Alpha butchering, cut \\'n\\' paste technique in NifSkope and basically crammed 3 different meshes together (cuirass/greaves/body) \r\nThis is used in the Dwarven and Nord Plate armours\r\n\r\nThe second iteration, I used just the Ebony Armour mesh with a body inside which eases texturing and also is lighter on system resources.\r\n\r\nAs I have tried to show in the title this is a Proof Of Concept only and a Work In Progress only if someone comes up with a really (really! really!) good (and easy) way to improve it, otherwise there probably won\\'t be any updates for a while (if at all)\r\nI post it here in the hopes that a more experienced 3D modeller or texture artist may be inspired to improve upon it themselves and post the results.\r\n\r\nThe Files:\r\nAs I have already stated these files are very rough, although they will work in game, I\\'m hoping someone may want to improve them, as such\r\n\r\nThese are \\\"REPLACERS\\\" for original in game armours, I like everyone in game to wear my creations, so I haven\\'t bothered trying to figure out how to create standalone versions\r\nThe armours are as follows,\r\nFemale Only:\r\n\r\nDwarven Armor (3 mesh version)\r\nNord Plate or \\\"Steel Plate Armor\\\" (3 mesh version)\r\nDaedric Armor (2 mesh version)\r\nAvalon Armor or \\\"Dragon Scale** (2 mesh version)\r\n\r\n** The reason I replaced the dragon scale armour is because that\\'s one of the ugliest in Skyrim, plus it seemed to fit that Avalon\\'s Armor be tough but light so Dragons Scale being a high level \\\"Light\\\" armor seemed just right. (at least that\\'s how I\\'m justifying it to myself)\r\n\r\nNotice: Please do not ask for \\\"This body\\\" version or \\\"That body\\\" version as a flat refusal will often offend!\r\n\r\nFrom memory the I \\'think\\' I put a UNP body inside the Dwarven/Nord armor and, again from memory I \\'think\\' I put a vanilla body inside of the Daedric/Avalon armor. So credit must go to Dimon99 for his UNP body, after some many trial and errors though to get rid of clipping issues, I can\\'t remember exactly\r\n\r\n++ Also included is a simple blackened retexture of the Falmer Quiver and Arrows which replaces the Daedric one, because, well ... Seriously? Is the best BGS could come up with for a Daedric quiver was a black cardboard box ?!?\r\n\r\nBugs/Issues:\r\nThere is some clipping in certain poses/scenes, most noticeable with the Avalon and Nord armours because of the difference between the colours of the \\'armor\\' and \\'body\\'\r\n\r\nBoth files use a \\'body\\' mesh inside of the armor which have totally different Shader properties to other meshes, so their are some issues with lighting in certain environments, particularly around camp fires/ hearths for some reason.\r\nAlso there is seems to be no shadow cast from the \\'body\\' of the armor, I have no idea why, but it\\'s not really a big deal for me.\r\nAny other major issues, let me know and I\\'ll try and help (or ignore) as needed\r\n\r\nCredit also must be given to:\r\nHentai - for the boots from his Jamella Armour, found here\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=8728\r\nesmm40 - for the boots from his his Ebony Samurai-Meng Armour, found here,\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=8676\r\nBecause I like heels on my gals.\r\n\r\nInstallation:\r\nPretty much standard, just extract to your game folder, and overwrite if asked\r\n\r\nUninstall:\r\nRemove the following from \\\"meshes\\\"\r\nDaedric\r\nDragonscale\r\nDwarven\r\nnordplate\r\nAnd the following from \\\"Textures\\\"\r\nAvalon\r\n\r\n",
  "categoryId": "54",
  "version": "0.02a",
  "author": "Perraine",
  "createdUnix": "1332388266",
  "updatedUnix": "1334113523",
  "containsAdultContent": false,
  "uploadedBy": "Perraine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "45593",
      "name": "Avalon Armors All in one",
      "version": "0.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18980",
      "fileName": "Avalon Armors All in one-13432-0-01.rar",
      "uploadedUnix": "1332388568",
      "modVersion": "0.01",
      "virusScanUrl": "https://www.virustotal.com/file/ac7b443a3a5bdac03d745cc1d9281b956106a3a409f0bc7a91e29ef929f6f627/analysis/1406772210/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Avalon%20Armors%20All%20in%20one-13432-0-01.rar?fid=45593&ttl=1535776198&ri=8192&rs=8192&setec=cef8327194081e36cbbf214e7879bbc6"
    },
    {
      "fileId": "48117",
      "name": "Avalon_v0_02_Plus",
      "version": "0.02.plus",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "15169",
      "fileName": "Avalon_v0_02_Plus-13432-0-02-plus.rar",
      "uploadedUnix": "1333081363",
      "modVersion": "0.02.plus",
      "virusScanUrl": "https://www.virustotal.com/file/581a224663768b296cf7704a41bbc22945859e00fa6584f997fa91f7445d6753/analysis/1406787197/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Avalon_v0_02_Plus-13432-0-02-plus.rar?fid=48117&ttl=1535776198&ri=8192&rs=8192&setec=87bab3305d0dea8ab452173fc3b57360"
    },
    {
      "fileId": "52139",
      "name": "Armor_Update_1_0_plus",
      "version": "1.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "44173",
      "fileName": "Armor_Update_1_0_plus-13432-1-0.rar",
      "uploadedUnix": "1334113523",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/38d4f2cd36360cc659c8e295cb6c8c9c9bd6d0d2a61a7bfc4f9d43e7d18e6204/analysis/1406808945/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Armor_Update_1_0_plus-13432-1-0.rar?fid=52139&ttl=1535776199&ri=8192&rs=8192&setec=a8a6d6ec4388733b4165a632c3a45b45"
    }
  ]
}