{
  "modId": 13450.0,
  "modName": "Sustained Spells",
  "summary": "Tired of recasting oakflesh? Annoyed at candlelight cutting out in the middle of a fight? Just generally bored of recasting? Suffer no longer!",
  "descriptionHtml": "NOTICE: I am currently on hiatus untill I sort some stuff out. This mod will not be updated untill I have managed to do so and I may not respond to messages in a timely manner as I will not be visiting nexus very often.\r\n\r\n[size=1]Many thanks to those who have endorsed my work, I appreciate the recognition.[/size]\r\n\r\n===What this mod does===\r\n\r\nYou get two new powers in your powers menu. One is a toggle that means you cast sustained versions of the armor spells, muffle, candlelight, waterbreathing and the cloak spells (don\\'t forget to toggle it off again afterwards, unless you aren\\'t going to want to cast any non-sustained versions of any of the spells above), the other clears all of your sustained spells, this can also be done selectively by casting the spell a second time (either in or out of toggled sustained spell mode) and while that lets you dispel a specific spell it does cost magicka.\r\n\r\nWhat do I mean by sustained spells? Spells still cost magicka to cast, but once you have cast them they will be automatically recast, free of magicka cost, once they end. However in return for this you loose some of your magicka regen, in terms of magicka gained per second you loose the total magicka cost of the spell divided by the duration of the spell, so that over the course of the spell you loose as much magicka as you would have spent casting it (unless your magicka bar is full in which case you are loosing no magicka of course)\r\n\r\nYour magicka regen penulty is updated as you add or remove sustained spells, as your skills advance and as you equip or unequip items with magicka/magicka regen/magical skill enchantments, although it may take up to five seconds for the game to update your magicka regen rate to reflect this. If your magicka regen penulty is ever greater than your magicka regen then the sustained spells will all be dispelled (so nobody can game the system by making alteration spells cost 0 with enchantments, casting dragonhide, and then changing equipment)\r\n\r\n===Compatability===\r\n\r\nThis mod makes changes to all of the spell mentioned, it\\'s simply the addition of a script to each spell (everything else doesn\\'t modify or overwrite anything) and I\\'m not sure how that meshes with other mods, so take it as red that if another mod changes or modifies these spells, there\\'s a good chance that they\\'ll clash, and putting this mod after that one in the load order is likely to make this mod work just fine (although given the complicated ways mods can interact it might not).\r\n\r\n===FAQ===\r\n\r\nQ: Will my skills advance?\r\n\r\nA: Yes. While near as I can tell (although I haven\\'t tested this) the armor spells such as oakflesh and the cloak spells such as flame cloak only give you xp (in vanilla as well as my mod) when cast in combat or when you enter combat with them already cast, certainly if they do give xp when cast out of combat the amount is tiny, and upon entering combat with them active you gain xp in the relevant skills, the same happens with this mod using sustained spells.\r\n\r\nSpell like muffle and waterbreathing give xp when cast, both in and out of combat, I don\\'t know how waterbreathing works but muffle gives it based on the number of people around you, so you may find your illusion skill increasing if you wander around town with muffle sustained as it will be cast every time the normal spell would have ended.\r\n\r\nCandlelight will just give you xp when cast, but the amount is tiny, I accidentally left my game running overnight with candlelight sustained, and I went from level 34 to level 37 in the space of 8 or more hours, not exactly a stunning rate.\r\n\r\nQ: How can I tell how much Magicka regeneration I still have left?\r\n\r\nA: Without going into combat you can\\'t. Trial and error is necessary to see how many of the spells you want to support you can support, and because regen rates change in combat and you may need your magicka for other spells too (including magicka that is no longer being regenerated) trying it out in combat is really the only way of judging what spells to support (afterall, if they\\'re non sustained you can always choose to not recast and use that magicka for something else)\r\n\r\nQ: I just checked my magickaratemult using the console and I seem to remember that magicka gained per second in combat is magickaratemult/100, why is it that the sustained spell I have that would normally last 60 seconds and cost 60 magicka isn\\'t reducing my magickaratemult by 1? Your mod is bugged!!!!\r\n\r\nA: Nope, from what I can tell magicka regen is actually based on magickaratemult and the size of your magicka pool, with magicka rate mult being used to determine how long it takes for your pool to fill (time to fill, while in combat, is 100 seconds with a rating of 100, 50 seconds with a rating of 200, 33 seconds with a rating of 300, etc) my mod takes this into account and adjusts magickaratemult by a value calculated based off of this.\r\n\r\nQ: Why doesn\\'t this include spells like Night Eye, Invisibility and Life/Death Detect?\r\n\r\nA: Night eye is excluded because it\\'s not a vanilla spell unless you are a vampire and there are many many vampire mods out there that make night eye last forever. Invisibility is complicated because it can be dispelled by the player doing something with it active, and finding the appropriate hooks to attatch to my mod so that it knows to not recast invisibility would have been problematic. Life and Death Detect are problematic I\\'m looking into them but to be honest I dont think I\\'ll be adding them. In skyrim their magicka cost is too high to make sustained them practical under the rules I have set up unless you use 100% cost reduction alteration gear which is..... rare, to say the least, so I dont think it will see enough use to be worth my time coding it, I certainly wouldn\\'t use it.\r\n\r\n\r\n===My Other Mods===\r\n\r\nBecome a Vampire - Anytime: http://skyrim.nexusmods.com/downloads/file.php?id=11965\r\nBecome a Werewolf at the start: http://skyrim.nexusmods.com/downloads/file.php?id=11674\r\nEveryone Get Inside! Dragon Attack: http://skyrim.nexusmods.com/downloads/file.php?id=12785\r\nWerepyres: http://skyrim.nexusmods.com/downloads/file.php?id=11503\r\nWerewolf Second howl Toggle: http://skyrim.nexusmods.com/downloads/file.php?id=12017",
  "categoryId": "24",
  "version": "2.0",
  "author": "MGoods",
  "createdUnix": "1332411314",
  "updatedUnix": "1332411385",
  "containsAdultContent": false,
  "uploadedBy": "MGoods",
  "primaryFile": null,
  "files": [
    {
      "fileId": "45672",
      "name": "SustainedSpellsv2_0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "SustainedSpellsv2_0-13450-2-0.rar",
      "uploadedUnix": "1332411385",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/97bda5ba51e86b391cc6730f831aa1f6143af1853db4af719c5e10825705b943/analysis/1406772844/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SustainedSpellsv2_0-13450-2-0.rar?fid=45672&ttl=1535776233&ri=8192&rs=8192&setec=d5f45970208baa98cb6f0b16f9e30d94"
    }
  ]
}