{
  "modId": 13452.0,
  "modName": "Improved Balance and Reduced Tedium for Skyrim",
  "summary": "The goal of this mod is to address major balance issues with Skyrim to ensure a challenging experience at all levels while eliminating aspects that impede enjoyment.  ",
  "descriptionHtml": "The purpose of this mod is to alter the game mechanics of Skyrim to remove major balance flaws and ensure that the game always presents a reasonable challenge.  This is achieved primarily through the reduction in power of the most powerful abilities, but there is some improvement of weak ones as well.  I have also included some changes that I feel improve the game in other ways, mainly by reducing tedium and eliminating aggravating mechanics.  \r\n\r\n\tThe goal is to create a balanced game without fundamentally altering the structure of it.  For example, you will see many changes to specific perks but few to the overall perk structure.  I’m not dead set against more sweeping changes, but I am attempting to solve the problems in simple ways before attempting more complex solutions.  Below is a detailed list of the issues I have identified and what I have done to fix them.\r\n\r\n\r\nIssues and Solution\r\n\r\nIssue:  Players are able to increase their smithing skill to levels that allow them to create godlike items.\r\nSolution:  Removed items that allow buffing the smithing skill past 100, limiting improvement levels to Epic.\r\n\r\nIssue:  Players can reach the maximum physical damage reduction value of 80% far too easily, making many perks and higher level armors completely redundant and trivializing content. \r\nSolution: Greatly reduced the amount of armor added by most perks in addition to the aforementioned changes to smithing skill boosts.\r\n\r\nIssue:  Enchantments stack in overpowering ways\r\nSolution:  The types of allowable enchantments for each slot have been altered to ensure that players cannot achieve overpowered combinations.\r\n\r\nIssue:  It is too easy to reach high levels of magic resistance and thus trivialize fights with mages.\r\nSolution:  The cap for magic resistance has been lowered and most means of increasing resistance have been adjusted to make reaching it far more difficult.\r\n\r\nIssue:  Weapon damage can be increased to ridiculous levels, again making most fights completely trivial. \r\nSolution:  Weapon damage enchantments were severely reduced in power in addition to the changes I made to smithing.\r\n\r\nIssue:  The weight of crafting materials makes inventory management terribly obnoxious by forcing countless trips between crafting stations and storage.\r\nSolution:  Crafting materials have been reduced to zero weight.\r\n\r\nIssue:  Weapon enchantments drain charges at such a rate that players are forced to carry duplicate weapons so that they can save charges for challenging encounters. \r\nSolution:  Increased the number of charges available and made all enchantments drain them at the same rate.  Weapon enchantments reduced in power to compensate.  \r\n\r\nIssue:  Due to inconsistent damage and the way that the enchantment system works, slower weapons are inherently worse than faster ones.\r\nSolution:  Equalized damage and weapon speeds within each skill group.  Differentiated the weapon types with new useful perks that replaced the old, essentially useless, weapon specific perks.  Added a bonus to tempering and enchanting for the slower two-handed weapons.  \r\n\r\nIssue:   Inventory management is made difficult by inconsistent naming and lack of information.\r\nSolution:  Potions and Poisons were renamed so that they are easily sorted and labels have been added to some other items such as Dwemer ores and skill books.\r\n\r\nIssue: Soul gem filling system results in many under-filled gems and non-stack-able gems.  Furthermore, the process of filling gems is tedious and adds nothing to the game.\r\nSolution:  All soul gems found on monsters and in containers are the filled type.  \r\n\r\n\r\n\r\n\r\n------------------------------------------------------------------------------------------------------------\r\nRaw Changelist\r\n\r\nVersion A2\r\n\r\nRaces\r\n\r\n-Breton magic resistance reduced from 25% to 10%\r\n-Nord cold resistance reduced from 50% to 30%\r\n-Dark Elf fire resistance reduced from 50% to 30%\r\n\r\nPerks\r\n\r\n-Magic resistance perks from the alteration tree reduced from 10/20/30% to 8/15/21%\r\n\r\n-Custom Fit armor bonus reduced from 25% to 10%\r\n\r\n-Altered Critical Charge and Great Critical charge to double total weapon damage rather than use the worthless critical hit system\r\n\r\n-Altered Critical Shot to double total weapon damage rather than use the worthless critical hit system and removed both additional ranks.\r\n\r\n-Reworked one-handed tree so that the weapon specific perks are actually useful:\r\n\t-All three weapon specific perk trees have been reduced to a single perk\r\n\t-The remade perks are now available at 50 skill\r\n-Bladesman renamed Weapon Focus: Sword and now adds 15% blocking effectiveness and 50% additional stamina regeneration when using a sword\r\n-Hack and Slash renamed Weapon Focus: Waraxe and now adds a 10% chance to do double damage when using a war-axe\r\n-Bone Breaker renamed Weapon Focus: Mace and now adds a 5% chance to paralyze your target\r\n\r\n-Reworked two-handed tree so that the weapon specific perks are actually useful:\r\n\t-All three weapon specific perk trees have been reduced to a single perk\r\n\t-The remade perks are now available at 50 skill\r\n-Deep Wounds renamed Weapon Focus: Greatsword and now adds 15% blocking effectiveness and 50% additional stamina regeneration when using a sword\r\n-Limbsplitter renamed Weapon Focus: Battleaxe and now adds a 10% chance to do double damage when using a war-axe\r\n-Skullcrusher renamed Weapon Focus: Warhammer and now adds a 5% chance to paralyze your target\r\n\r\n-Regeneration perk in the restoration tree reduced from 50% heal bonus to 25%\r\n\r\n-Frost, Fire, and Storm enchanter perks in enchanting tree replaced with more useful versions:\r\n\t-Fire Enchanter replaced with Elemental Enchanter which now adds 25% damage \tto fire, frost, and shock damage enchantments.\r\n\t-Frost enchanter replaced with Vitality Enchanter which adds 25% to magicka \tand stamina depleting enchantments \r\n\t-Storm enchanter replaced with Vampiric Enchanter which adds 25% to the \tabsorb health enchantment.\r\n\r\nCrafting\r\n\r\n-Shield enchantments modified:\r\n\t-Resist magic, fire, frost, shock, disease, and poison removed from enchant list\r\n\t-Added health regen, stamina, and stamina regen to enchant list\r\n\r\n-Magic resistance enchantments reduced from 10/12/15/17/20/22 to 7/9/12/13/15/17\r\n\r\n-Fire, Frost, and Shock resistance enchantments reduced from 15/30/40/50/60/70 to 18/27/34/38/45/50\r\n\r\n-Resist magic enchantment added to feet slot\r\n\r\n-Enchantment spell schools changed to NONE to prevent use of fortify spell school potions to buff them when creating enchanted items.\r\n\r\n-Added the ability to craft arrows.  Recipes currently use the same materials as daggers and result in 50 arrows.\r\n\r\n-Weapon enchantments now drain charges again, but much more slowly.  The rate is now fixed for all types of enchantments at 3414 charges at max power with a grand soul gem.\r\n\r\n-Added a 50% bonus to tempering for two handed weapons.  Currently this is built into the first perk on the smithing tree.  Later versions will move this to an autogranted perk.\r\n\r\n-Added a 50% bonus to enchanting for two handed weapons.  Currently this is built into the first perk on the enchantment tree.  Later versions will move this to an autogranted perk.\r\n\r\n\r\nItems\r\n\r\n-Added the name of the skill modified to the in-game titles of the various skill enhancing books\r\n\r\n-Dark Brotherhood gloves enchantment reduced from 200% sneak attack damage to 150%\r\n\r\n-Renamed bought/dropped potions to make sorting easier.\r\n\r\n-Replaced empty soul gems with filled soul gems in most loot and vendor lists.  This should reduce the need to constantly use soul trap spells and enchantments.\r\n\r\n-Swords, Maces, and Waraxes now have the same attack speed and damage.  This should make the latter two weapon types viable choices.  \r\n\r\n-Greatswords, Warhammers, and Battle Axes now have the same attack speed and damage.  This should make them all viable choices.  \r\n\r\n-Two handed weapon damage adjusted to be consistent relative to one handed weapons of the same material\r\n\r\n\r\nMagic\r\n\r\n-With the Respite perk, healing spells now add only half as much stamina as they do health\r\n\r\n-Added conditions to Grand Healing stamina effect to prevent it from helping your enemies\r\n\r\n\r\nGeneral\r\n\r\n-Dual casting cost reduced from 280% to 220% to match the 220% spell power.\r\n\r\n-Removed crafting skill-up rate buff from all standing stones.\r\n\r\n-Reduced Lord Stone bonuses from 50 armor / 25% magic resist to 25 armor / 15% magic resist.\r\n\r\n\r\n\r\n\r\nVersion A1\r\nPerks\r\n\r\n-Reduced the effectiveness of the following weapon perks from 20/40/60/80/100 to 10/20/30/40/50:\r\nArmsman (One-Handed), Barbarian (Two-Handed), and Overdraw (Archery) \r\n\r\n-Reduced effectiveness of the following armor perks from 20/40/60/80/100 to 10/19/27/34/40\r\nJuggernaut (Heavy Armor), Agile Defender (Light Armor)\r\n\r\n-Matching Set bonus for light and heavy armor reduced from 20% to 10% (Was shown as 25% in game but was coded as 20%)\r\n\r\n-Well Fitted armor bonus reduced from 25% to 10%\r\n\r\n-The feats that allow smithing with a given material now only give a 50% bonus to improvement rather than 100%\r\n\r\n-Shield Charge will no longer knock back and disable many bosses, preventing it from trivializing boss fights.\t\r\n-Added the immunity to generic bosses but many with unique names will have to be catalogued and modified\r\n\r\n-Shield Charge will also now consume 75 stamina when it knocks down an enemy.  The ability to take an enemy out of the fight for several seconds was too powerful to have no cost.  \r\n\r\n-Steel Smithing perk now requires a smithing skill of 10\r\n\r\n-[Bug Fix] Matching Set (Heavy Armor) now properly recognizes ebony plate armor and applies the armor bonus.\r\n\r\n\r\nCrafting\r\n\r\n-Adjusted the power of some enchantments:\r\n-Fortify Damage enchantments reduced in power from 13/15/20/25/30/35/40 to 7/10/13/16/19/22/25\r\n-Fortify Carry weight doubled\r\n-Weapon Enchantments no longer drain charges\r\n-Fire/Frost/Shock damage enchantments reduced in power from 5/10/15/20/25/30 to 5/8/11/14/17/20\r\n-Frost Damage enchantment slow duration reduced from 3 seconds to 1 second\r\n-Paralyze enchantment proc chance reduced from 25% to 10% \r\n-Absorb Health enchantment reduced in power from 5/10/15/20/25 to 6/8/10/12/14\r\n-Absorb Stamina and Magicka enchantments reduced in power from 10/15/20/25/30 to 9/11/13/15/17\r\n-Drain Magicka enchantment reduced in power from 10/20/30/40/50/60 to 10/16/22/28/34/40\r\n\r\n-Changed the types of items that certain enchantments can be applied to:\r\n\t-Weapon damage enchantments can now only be applied to hand items\r\n\t-Block enchantments can now only be applied to shields\r\n-Reduced spell school magicka cost enchantments can now only be applied to chest and head items\r\n\r\n-Fortify Smithing and Alchemy enchantments zeroed out pending removal of all items that use these from the game.\r\n\r\n-Fortify Smithing and Enchanting removed from alchemy ingredients\r\n\r\n-Added Dragon Forged weapons that are craftable with the Dragon Smithing (renamed from Dragon Armor) perk.  This should solve the problem of light armor users being forced to travel through the heavy armor side of the smithing tree in order to have access to the best weapons.  These are currently listed under the misc category in the smithing menu.  \r\n\r\n\r\nItems\r\n\r\nPruned drop lists of items that I feel are overpowering:\r\n-All wearables and potions that increase crafting skills should no longer be available.  \r\n-Most items that don’t follow the new allowable enchantment lists have been removed.  \r\n\r\n-Crafting materials are now weightless, saving many pointless trips back and forth between stations and storage.  Be warned that it is now (even moreso) possible to increase your weight by crafting heavy things from weightless things.\r\n\r\n-Potions and Poisons weight reduced from .5 to .1\r\n\r\n-Scroll weight reduced from .5 to .1\r\n\r\n-Dragon Claws are now weightless\r\n\r\n-Mining pick and woodcutters axe weights reduced from 10 to 5.\r\n\r\n-Potions of Ultimate XXXX now restore 500 H/M/S rather than 9999\r\n\r\n-[Bug Fix] Ebony Daggers now have 1.3 attack rate like all other daggers. \r\n\r\n-Switched armor values of Daedric and Dragonbone heavy armors so that that there is a reason to get the Dragon Smithing feat.\r\n\r\n-Switched damage values of Dwarven and Orcish weapons so that the higher level Orcish items are better\r\n\r\n-Reduced damage values on Ebony mace and war axe by 1 point each so they fall between Glass and Deadric as the weapon damage progression indicates they should.  \r\n\r\n\r\nGeneral\r\n\r\n-Max resistance to all types of magic reduced from 85% to 75%\r\n\r\n-Leveled actor multipliers changed from .33 / .65 / 1 / 1.25 to .6 / .85 / 1.1 / 1.35 which should result in higher level enemies showing up.  \r\n",
  "categoryId": "24",
  "version": "A2",
  "author": "Evil Iguana",
  "createdUnix": "1332423418",
  "updatedUnix": "1340191398",
  "containsAdultContent": false,
  "uploadedBy": "eviliguana966",
  "primaryFile": null,
  "files": [
    {
      "fileId": "45699",
      "name": "Iguanas Balance Tweaks",
      "version": "A1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "188",
      "fileName": "Iguanas Balance Tweaks-13452-A1.7z",
      "uploadedUnix": "1332423651",
      "modVersion": "A1",
      "virusScanUrl": "https://www.virustotal.com/file/2a55d7f5ef0999cfa83454b26ac91723f177418101c63e5b6dea998dd3a5a86d/analysis/1406773034/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Iguanas%20Balance%20Tweaks-13452-A1.7z?fid=45699&ttl=1535776236&ri=8192&rs=8192&setec=817d5c9fd094cf606e4a6334df8dd509"
    },
    {
      "fileId": "69173",
      "name": "Improved Balance and Reduced Tedium for Skyrim version A2",
      "version": "A2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "408",
      "fileName": "Improved Balance and Reduced Tedium for Skyrim version A2-13452-A2.7z",
      "uploadedUnix": "1340191398",
      "modVersion": "A2",
      "virusScanUrl": "https://www.virustotal.com/file/b4f269df1fc4d291c3868462c29879ab53c588ab376293a93a1790522ebc3b55/analysis/1406971384/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Balance%20and%20Reduced%20Tedium%20for%20Skyrim%20version%20A2-13452-A2.7z?fid=69173&ttl=1535776237&ri=8192&rs=8192&setec=16b949eb33938804c194efab99d96a02"
    }
  ]
}