{
  "modId": 13491.0,
  "modName": "New Epic Boss Fights",
  "summary": "8 new epic boss fights guaranteed to make your character sit on a donut-shaped pillow for the next week.",
  "descriptionHtml": "Travel to the inn in Rorikstead and speak with Dartanian.  He will tell you of an ancient warrior demi-god whose armor and weapons were gifts from the gods.  Complete the quest to kill the 7 epic bosses, and collect a unique set of gear.  (plus one bonus quest)\r\n\r\nThese encounters are designed to challenge high-level characters with maxed out armor...you should die a few times before finding a strategy that works for you.  :)\r\n\r\nAlso,in the Inn, there are 3 new followers...A 7 foot tall orc tank, a Khajiit archer, and a dragon priest mage.  Each has their own custom summonable minions.  It\\'s highly advisable to choose one to fight with you.  Outside the of the inn, you will find a table with potions, a couple of spellbooks with some new conjuration spells (including one that conjures your own 1/4 sized dragon minion), and 3 rings.  If you find the fights too difficult, just wear one of the rings...to help you find your best difficultly level.  I tried to design the mod, so you could do the fighting yourself, or play general with summonable minions.\r\n\r\nKnown bugs:\r\nThe quest markers work sometimes, and sometimes not.  All of the boss locations are marked on the map and are around Rorikstead...you can find them manually if the markers don\\'t show up.\r\n\r\nThe magic effect on Rothgar\\'s boots does not work when you first pick them up from the Giant King.  To get them to work, pick them up, save and exit the game, then reload your save and wear the boots.  The magic effect should work then.\r\n\r\nI need to clean up the dialogue, and add some more custom dialogue voice files, but it should all work.\r\n\r\nPlease report any bugs, and let me know what you think.  Note: The gear, spells and followers are not really intended for use in the vanilla game, as they are way to powerful...but work well with this mod.\r\n\r\n(Edit: I\\'m about to start Part 2 of this mod, and I really need some feedback on how hard these fights were for you...so I know how to adjust them.  Please understand, modders spend hours, days, and sometimes weeks to develop a mod...just for your entertainment...please help us out by letting us know how these mods work for you!  :) )",
  "categoryId": "88",
  "version": "1.0",
  "author": "Macgyver",
  "createdUnix": "1332468766",
  "updatedUnix": "1332469573",
  "containsAdultContent": false,
  "uploadedBy": "Macgyver1958",
  "primaryFile": null,
  "files": [
    {
      "fileId": "45870",
      "name": "EpicBossFights",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9794",
      "fileName": "EpicBossFights-13491-1-0.rar",
      "uploadedUnix": "1332469573",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b0c227f841264db1b7a0f55c6d661f213f90fa52533c24b6033c8a4b7757d955/analysis/1406773991/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EpicBossFights-13491-1-0.rar?fid=45870&ttl=1535776300&ri=8192&rs=8192&setec=ade883c5bbcd6010bb0d571ec1ffbcf6"
    }
  ]
}