{
  "modId": 13519.0,
  "modName": "Better Dragon Armour",
  "summary": "This mod modifies the way dragon armour is created making it harder to create but is now worth wearing over deadric armour",
  "descriptionHtml": "So I really liked dragon armour from the moment I saw it, I levelled my smithing to 100 Making tons of armour and put in hours of work farming materials  only to find out that deadric armour is better. I understood why since deadric armour is harder to create but I never did like the idea of a lower item being better. \r\n\r\nThis mod changes all that, Dragon armour is now much more difficult to get materials for and as such is now more powerful then deadric armour.\r\n\r\nTo create dragon armour now you must aquire Dragon Hearts and Dragon Essence, Dragon hearts are easily found by killing a dragon and will appear in some chests. However Dragon Essence is much harder to come by as it only appears in a few chests through out skyrim. Since there is a chance that they would not appear at all most of these can be found in misc chests rather then specific ones. Dragon Essence exists in about 200 chests and has a 65% chance to spawn.\r\n\r\n\r\nNote: At this stace DragonScale armour has not had values modified.",
  "categoryId": "36",
  "version": "0.90",
  "author": "Lynix112",
  "createdUnix": "1332520821",
  "updatedUnix": "1332520880",
  "containsAdultContent": false,
  "uploadedBy": "lynix112",
  "primaryFile": null,
  "files": [
    {
      "fileId": "46024",
      "name": "BetterDragonArmour090",
      "version": "0.90",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "61",
      "fileName": "BetterDragonArmour090-13519-0-90.rar",
      "uploadedUnix": "1332520880",
      "modVersion": "0.90",
      "virusScanUrl": "https://www.virustotal.com/file/36a546c37d90fcedec1ba742ea7ad0c4b12459bce37c164ca6bc5bc0115b7324/analysis/1406774649/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BetterDragonArmour090-13519-0-90.rar?fid=46024&ttl=1535776349&ri=8192&rs=8192&setec=e8c38ea0bb733b5946791f553c3dd1d8"
    }
  ]
}