{
  "modId": 13517.0,
  "modName": "Dwengar - WIP",
  "summary": "Discover Dwengar, a fully functional Dwemer city hidden deep beneath the world.",
  "descriptionHtml": "EDIT (2/2/2013): So I\\'ve run into a huge problem with this mod. It\\'s just too big to be a feasable mod for most people to run I\\'m afraid. The scale of what I want to do is more akin to that of an expansion pack than a simple mod. If I can figure out how to package it to be much more accessible to others with not-so-fancy computers then I\\'ll do it right away. But for now, I\\'ve shelved this project since I just don\\'t know how to go forwards with it and make it a plausible expansion for people to use AND enjoy without its sheer size crashing their computers all the time. Anyone got any ideas?\r\n\r\nWANTED:\r\n- People with quest design experience.\r\n- People with scripting experience.\r\n- People with voice acting experience.\r\n\r\nThis is a mod about a lost city of Dwemer living in the eponymously named Dwengar. here there is a temple/college devoted to the pursuit of reason, a hydroponic farm, a smithing guild, a new marketplace, and a teleportation system.\r\n\r\nThe goal of this mod is to create a fully functional world beneath Skyrim that is focused on the Dwemer and why a particular city has survived where everyone else vanished.\r\n\r\nWhat is included currently:\r\n1. A series of maps that comprise the city and area of Dwengar. Almost all of which are interior additions with minor world hook-up structures.\r\n\r\n2. A new variety of spells including but not limited to a radioactive pulse, harnessing kinetic energy, and summoning Dwemer automatons to fight for you.\r\n\r\n3. Enchanted items for improving the results of the smithing skill.\r\n\r\n4. A teleportation system to allow for quick travel throughout the city since it\\'s underground.\r\n\r\n5. A Dwemer race. They are pale skinned because the dwemer from morrowind was pale and it seems to make sense that if they live underground most of the time, then their skin color would fade from a lack of exposure to sunlight. I think that people may find this race akin to the lore within an acceptable degree of error.\r\n\r\nWhat is planned to be included:\r\n1. A series of quests for the NPCs in the city.\r\n\r\n2. A main quest that leads the player to the city in the first place.\r\n\r\nWhat is currently being worked on:\r\n1. Finishing some of the maps.\r\n\r\n2. AI scripting and package management\r\n",
  "categoryId": "53",
  "version": "None",
  "author": "Altrunchen",
  "createdUnix": "1332518788",
  "updatedUnix": "1340678078",
  "containsAdultContent": false,
  "uploadedBy": "Altrunchen",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70348",
      "name": "Dwengar",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "725",
      "fileName": "Dwengar-13517-0-1.zip",
      "uploadedUnix": "1340678078",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/58e1ac62c1691e94bc36250e4fb5dd3638adbc9ce8944087b6d30db63070d78c/analysis/1406983325/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwengar-13517-0-1.zip?fid=70348&ttl=1535776346&ri=8192&rs=8192&setec=4e21970556615c0dc52f0ae0141878a5"
    }
  ]
}