{
  "modId": 13536.0,
  "modName": "The Gifted",
  "summary": "A New race to play as called The Gifted",
  "descriptionHtml": "Just a Simple little addon that places a new race called The Gifted for you to play as in Skyrim.\r<br />\r<br />The Gifted are a race of half Man half Mer that, due to their unsual pairing, have developed a deep ethereal hatred that manifests as rage abilities.\r<br />\r<br />This simple mod won&#39;t completely change your skyrim experience but it should spice it up a little for those of you that are a little bored of the original races, without being too over powered.\r<br />\r<br />Features include:\r<br />\r<br />Gifted Rage - your strength and resistance increases as your rage takes over&#33;&#33;\r<br />(Similar to orc berserker rage)\r<br />\r<br />Hate Venting - Spread your hate to everything around you through the medium of FIRE&#33;&#33; (Acts as a low powered fire wall) *might still be a little over powered - will probably update*\r<br />\r<br />Flex of Anger - A bolt of lightning doing damage and sending your foes crazy with rage&#33;&#33; (Combines a low powered lightning bolt with a fury spell) - also staggers the target allowing you to move in a finish them off, or run like a coward :)\r<br />\r<br />Pure Hate - Your hatred fuel&#39;s you giving you 50 points increased stamina\r<br />(Constant power fortifying Stamina 50 points)\r<br />\r<br />Heavy Armor + 10\r<br />Destruction + 10\r<br />Enchanting, one-handed, restoration, smithing + 5\r<br />\r<br />Both directional powers have been given the illusion hand art as i always thought this looked as if it should have been used for an offensive ability - and both can only be used in the left hand because they are intended to compliment one-handed attacks.\r<br />All powers have been done from scratch, there are NO REPLACER&#39;S so no original powers have been change meaning it should be compatible with just about anything and you can still have all the other powers/spell as before.\r<br />I&#39;ve taken care not to impact or change any other powers/races/abilities during the making of this file but please let me know if you find anything.\r<br />\r<br />This is my first attempt at a new race and i was a little unsure how to change the body/head visual&#39;s so if you have any tip&#39;s let me know.\r<br />If someone could do some pic&#39;s of the powers in use it would be great (i&#39;m rubbish at it).\r<br />\r<br />Just drop the esp. into your skyrim data folder as usual or use the nexus managerr. \r<br />\r<br />Thanks - GreenSmirf.\r<br />\r<br />#Edit this file as you see fit, but please give some credit out if you re-post the file - and let me know so i can check out your good work.",
  "categoryId": "34",
  "version": "v1.0",
  "author": "GreenSmirf",
  "createdUnix": "1332534238",
  "updatedUnix": "1332534566",
  "containsAdultContent": false,
  "uploadedBy": "Greensmirf",
  "primaryFile": null,
  "files": [
    {
      "fileId": "46088",
      "name": "The Gifted",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "The Gifted-13536-1-0.zip",
      "uploadedUnix": "1332534566",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e0915c3b3536a8917b4baffb5cd06ec2e0ca5582b4423c6c54b73f2dec7f70d9/analysis/1406775367/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Gifted-13536-1-0.zip?fid=46088&ttl=1535776398&ri=8192&rs=8192&setec=6d83be9271daa88c169ec2dc831d2ffb"
    }
  ]
}