{
  "modId": 13532.0,
  "modName": "Muscle Mod Enabler for Player Character Only",
  "summary": "Well Almost only. A few NPCs will have this body textures if they are set on highest weigth.\r\n\r\n\r\n",
  "descriptionHtml": "NEW VERION OF MOD IS FINISHED\r\nAt the moment I am writing Manual, making pictures. WILL BE RELEASED IN THE WEEKEND\r\n\r\nYou will now be able to totally isolate your character and have a unique body and textureset.\r\nAlso you can have a unique werewolf aswell if you find the right bodymod for that.\r\nAnd if that wasnt enough then I can tell you that if you turn into a Vampire you can have a totally different bodymod and texture even for that\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nUpdate: Enabled the same options for Males and added options for hand textures on both.\r\nNow hand textures can shift with the slider. I also changed name on the mod\r\nMove the dds and msn.dds for body and hands to textures/actors/character/female/RAC/ and /male/RAC/\r\n\r\n\r\nThe first two images shows Vanilla body with Tigersan texture on highest weight setting. The third and fourth shows CBBE body with CBBE Sporty texture on highest weight setting. The large picture shows the CBBE sporty texture on a Vanilla body. In my opinion best choice since it works with the vanilla armor. This mod will not conflict with textures, meshes or anything that doesnt interfere with femalebody formlist, It will work with UNP aswell.\r\n\r\nThe idea behind this mod is to avoid beefing up all NPC females in skyrim. Thus this only enables the use of other texture mods in such way that it more or less only affect your character\r\n\r\nTo do this I duplclated the vanilla femalebody textureset nine times and added it to the femalebody formlist. I then created a new texture set for the muscletexture and added it to the formlist. That way when you use the weigth slider the muscletexture only appears on the highest setting and thus preventing the most NPC females to get it. Its a simple mod but a clever one that solves an issue many have.\r\n\r\nTexture files are stored in textures/actors/character/female/\r\nBy moving the female_1_msn.dds to textures/actors/character/female/RAC/ you will get the effect showed in the pictures.\r\n\r\nTextures are not coming with this mod so you have to download those. Just the file and place it in the RAC directory.\r\nYou will notice the difference at the highest weigth setting. Because of this very few NPC female will have the texture\r\n\r\nThe added pictures shows the muscular woman mod as standard and when my mod is added.\r\nAlso showing the differens on the back between slider 10 and 11\r\n\r\nUpdate to version 2.2 added vanilla files",
  "categoryId": "29",
  "version": "2.3",
  "author": "Basvanbeu",
  "createdUnix": "1332531714",
  "updatedUnix": "1333068199",
  "containsAdultContent": false,
  "uploadedBy": "basvanbeu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "46080",
      "name": "Female Muscle Mod for PC Only",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Female Muscle Mod for PC Only-13532.rar",
      "uploadedUnix": "1332532101",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/6743a30cf1dc65603a3c87f01f81aee46c638f0677146f40569bf98820d6429e/analysis/1406775182/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Female%20Muscle%20Mod%20for%20PC%20Only-13532.rar?fid=46080&ttl=1535776379&ri=8192&rs=8192&setec=82bf7de1a0c288129f22d9763178813a"
    },
    {
      "fileId": "48083",
      "name": "Muscle Mod Enabler PC Only",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12039",
      "fileName": "Muscle Mod Enabler PC Only-13532-1.rar",
      "uploadedUnix": "1333068199",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/715b807a3987da6fc05bc61963c66600bcbc47fcd7a9c02327063f66eb8f11e6/analysis/1406786906/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Muscle%20Mod%20Enabler%20PC%20Only-13532-1.rar?fid=48083&ttl=1535776380&ri=8192&rs=8192&setec=d46638dfbf846677b8d133723928b837"
    }
  ]
}