{
  "modId": 13534.0,
  "modName": "Dragons hunt in Swarms",
  "summary": "Changes the vanilla random dragon encounter to happen more frequently and with more dragons based on random and the player level. ||\r\nDies ist eine Modifikation des Wildnis-Drachen-Überfalls. Basierend auf dem Spielerlevel werden zusätzliche Drachen generiert. ",
  "descriptionHtml": "[b]Dragon Swarms v5 - Teaming up[/b]\r\n\r\n[b]---- Mighty Dragons 3.7a is out: The compatibility version of DS is up now :) ----[/b]\r\n\r\n[center][img]http://skyrim.nexusmods.com/downloads/images/13534-1-1337515833.jpg[/img][/center]\r\nThis is a modification to the dragon wilderness encounter which spawns additional dragons based on the player lvl.\r\n\r\nGerman description, english continues below:\r\n[Dies ist eine Modifikation des Wildnis-Drachen-Überfalls. Basierend auf dem Spielerlevel werden zusätzliche Drachen generiert. Version 5 basiert auf Mighty Dragons 3.5a: Es werden Teams aus den Drachen dieses Mods gebildet, die gut aufeinander abgestimmt sind, je nach Spielerlevel können 2 bis 4 Drachen spawnen. Neu ist auch ein Event in dem 2, später 4 Drachen sich gegenseitig bekämpfen. Außerdem gibt es nun einen Schrein in Weißlauf, an dem man die generelle Wahrscheinlichkeit für Drachenagriffe festlegen kann.\r\n\r\n(Die Debugmessage vom Script ins deutsche zu bringen war relativ einfach, allerdings scheitere ich daran, den Auswahlbildschirm/Objektnamen zu ändern. Wenn jemand weis wie das geht, bitte melden. - Hab ganz tief in die Trickkiste gegriffen: Da ich den Schrein aus der englischen Version nicht überschreiben konnte, habe ich eine Kiste drüber gestellt und den deutschen Schrein da rauf gepackt. ;) Bessere Ideen willkommen)\r\n\r\nDes weiteren gibt es nun ein remake einer alten Version: v2.3. Dies ist eine schmale Version des mods, für Nutzer von Deadly Dragons/Dragons Diversified oder ähnlichen mods, die ohne Mighty Dragons auskommt. Hier wurde lediglich das Vanillaevent modifiziert, damit bis zu 4 Drachen spawnen. Außerdem wurde der neue Zufallsgenerator für die Angriffswahrscherinlichkeit eingefügt.]\r\n\r\n\r\n**************************************************************************************************************************************************************************************\r\n[b]Credits[/b]\r\nBefore i start the description, i want to thank alot of people, who helped Dragon Swarms on the long long way to become a real mod:\r\n[url=http://skyrim.nexusmods.com/modules/members/index.php?id=399963]Is this display name taken?[/url], who allowed to use his genius idea of a real random trigger.\r\n[url=http://skyrim.nexusmods.com/modules/members/index.php?id=1934056]Erkeil[/url], who made the stunning Mighty Dragons 3, which is in fact the base of this mod now and he also did a special \\\"Soft Slighty Edition\\\", just for me :).\r\nkaintfm for sharing some of his pretty cool videos.\r\nspanian77, DrAg0nCrY and all the other people who reported bugs, inquired customisations and gave feedback.\r\n\r\nWithout you, this mod wouldn\\'t exist in the way it does now!\r\n\r\n**************************************************************************************************************************************************************************************\r\n[b]De-/Installation:[/b]\r\nThe new version comes in a all-in-one package:\r\nTake just one bas and esp-file with the same difficulty-tag . Copy both files into your ..\\\\Skyrim\\\\Data-directory.\r\nDelete both files to get rid of the mod.\r\n\r\nFor clean delete of the old-versions files, theres a Readme in the zip-file.\r\n\r\n[b]The new optional package come with it\\'s own readme: Read it, alot of changes concerning installation.[/b]\r\n\r\nLoad Order A: \r\n- Dragon Swarms (v2.3 / v3.2 / v4 / v4.1 insane / v5.1 / v5.1a)\r\n- Dragons Diversified\r\n- Deadly Dragons\r\n- Mighty Dragons\r\n- MD - compatible with Deadly Dragons and-or Dragons Diversified patch BETA\r\n\r\nLoad Order B: \r\n- Dragon Swarms (v2.3 / v3.2 / v4 / v4.1 insane / v5.1 / v5.1a)\r\n- Resilient Dragons\r\n\r\n**************************************************************************************************************************************************************************************\r\n[b]Description[/b]\r\nFor a description of the older versions, check \\\"Miscellaneous\\\" in the download area.\r\n\r\nThis version is a merge of the previous 3.2 and 4.0/1. The idea was, to make the random encounters much more intresting, by creating teams of well-fitting dragons from [url=http://skyrim.nexusmods.com/downloads/file.php?id=13423]Mighty Dragons 3.5a[/url] (it also works with MD3.7a, but you will miss some of the dragons in it). So there is for example a group of an Ai\\'Mul\\'Grah, a Strun\\'Qo\\'Kendov, a Drog\\'Joor\\'aus and a Vokul\\'Fass\\'Zii, which should be pretty hard for a mage. You can use this mod without Mighty Dragons 3, but it would eliminate the intended immersion. Erkeil also made a version with his dragons near vanilla-strength. With the new random-system from [url=http://skyrim.nexusmods.com/downloads/file.php?id=16724]SKREEE - Less Frequent Dragons[/url], the spawnchances are finally what they are supposed to be: Random.\r\n\r\nNow shortly the new features:\r\n- 13 different groups of dragons\r\n- each group contains 2 to 4 dragons\r\n- 3 versions: easy - normal - insane\r\n- new random condition for one of the events to happen\r\n- one completely new event: Dragon vs Dragon (this can also come as a standalone by request)\r\n- easy mode: one event at a time, 10% encounterchance, new events @ lvl 25, 33, 42 and 51\r\n-> especially for this mode, Erkeil made a new \\\"soft\\\"-version of Mighty Dragons 3.5!\r\n- normal mode: one event at a time, 20% encounterchance, new events @ lvl 18, 27, 36 and 45\r\n- insane mode: two events at a time, 40% encounterchance, new events @ lvl 14, 23, 32 and 41\r\n\r\nnew v5.1-features:\r\n- You can now decide what random-chance to use. You find a shrine on the left side of Dragonsreach: Activate it and set your value. (in the zip-file there are two screenshots pointing at the exact spot) You get the same result by consoling \\\"set dsrandompercent to xx\\\" (or just take \\\"getglobalvalue dsrandompercent\\\" to check).\r\n\r\nincluded features from older versions:\r\n- encounters are level-based\r\n- extended leveled character lists: more than 20 dragons of each type are available to kill before a respawn is needed\r\n- added the permission for dragon encounters to happen together with other random encounters\r\n- removed vanilla-cap: You are able to kill more dragons than the amount of days you have spend in the game (replaced with the random-based condition)\r\n\r\nNotes on Dragon vs Dragon:\r\n[spoiler]\r\nI set up an event, inspired by the Dragon-fly-by-event and by Paarthunax telling me there are other dragons like him.\r\nIt contains frost- and fire-dragons fighting each other. (1 of each kind at lower levels, 2 of each kind in the later game) The frostdragons will try to kill you. The firedragons will help you. I didn\\'t do this on purpose, but that goes so far, that everyone in the area considered hostile to the playerfaction will get torched. When there are no enemies left for them, they will fly away. The higherlevel firedragons can spawn atronachs, they\\'ll also help you.\r\nThis event is not meant to give a challenge, it\\'s meant to fill in some immersion.\r\n[/spoiler]\r\n\r\n[b]Dragon Swarms 5.1a for Mighty Dragons 3.7a[/b]\r\nThis is an adaptive version which can\\'t live without Mighty Dragons v3.7a anymore. The package includes all needed esp\\'s and is uploaded on this page as well as on the Mighty Dragons page.\r\nThere are no changes to the v5.1-features. All changes are internal to make both mods compatible.\r\nRead the included Readme for further details.\r\n\r\n[b]v2.3 - slim[/b]\r\nRemake of the v2 of the mod, without all the nasty glitches.\r\n- no leveled lists\r\n- no shrine\r\n- no addtional events\r\n- changed the vanilla event to spawn max 3 optional dragons at level 20/40/60\r\n- replaced GameDaysPassed-Condition with GetRandomPercent <= DSRandompercent. Its 20% per default. To change it, open the console (^) and enter: \\\"set dsrandompercent to xx\\\", where xx is the desired value.\r\n\r\nIt\\'s meant as a compatibility version for user of [url=http://skyrim.nexusmods.com/downloads/file.php?id=13930]Dragons Diversified[/url] by LoginToDownload and [url=http://skyrim.nexusmods.com/downloads/file.php?id=3829]Deadly Dragons[/url] by 3JIou.\r\n\r\n**************************************************************************************************************************************************************************************\r\n\r\n[b]Coming on request:[/b]\r\n- Dragon vs Dragon - event standalone as replacer for Dragon fly by\r\n\r\n**************************************************************************************************************************************************************************************\r\n\r\n[b]Advertising:[/b]\r\n\r\nJust found this nice mod here, and as it has been a request once to determine how often the spawns appear, i wanna share and recommend its usage:\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=16724]SKREEE - Less Frequent Dragons[/url] by Is This Display Name Taken\r\n\r\nI created this mod in the first place to have better benefit from:\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=11623]Spend Dragon Souls For Perks[/url] by DarkSeraphim85 (Gibts es auch auf [url=http://skyrim.nexusmods.com/downloads/file.php?id=17413]Deutsch[/url] von heuseman)\r\n\r\nother fitting mods:\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=12785]Everyone Get Inside - Dragon Attack - Beta[/url] by MGoods\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=3740]Colorful Dragons 3 HD[/url] by Luddemann. In MD3 there are some new textures from Luddemann available, so you won\\'t need these.\r\n[url=http://skyrim.nexusmods.com/mods/18525]Dragonlings - Baby dragon inclusion[/url] by flynnmichael81\r\n\r\nblstrdbstrd suggested to use\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=10591]Resilient Dragons[/url] by Kenomica\r\nand\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=9316]Dragon Drop Reduced Weight[/url] by G-Phoenix\r\n\r\n[color=yellow]Highly recommended with v5.1: [url=http://skyrim.nexusmods.com/downloads/file.php?id=13423]Mighty Dragons 3[/url] by Erkeil.[/color]\r\n\r\n**************************************************************************************************************************************************************************************\r\n\r\n[b]Known issues:[/b]\r\n\r\nIf u experience no dragons spawning at all anymore, first check the following globals via console (^):\r\nGetGlobalValue DragonsReturned (should be 1)\r\nGetGlobalValue MQ106TurnOffRandomDragons (should be 0)\r\n\r\nEpic slowmotion fly-by. Sometimes it can happen that the flying speed of a dragon drops down to NPC-walking speed. As far as i know, nothing in my mod should affect the movement anyhow.\r\nJust mentioning it here, cause it got reported with \\\"dragonrend\\\" as possible trigger. I saw it myself after i accidently pierced a (frost)-blooddragon with a couple of ice-lances.\r\n-> Checked it on google. Its a seldom bug, known since December at least. Yeah, sorta my fault, cause by adding more dragons, you will see the common dragon bugs more often :P\r\n\r\nIt can happen, that when first using v3 on a higher lvl, u run into a large group of dragons. This is, cause none of the events has to complete its cooldown before it has been activated once. U can choose between fight or flight, the swarm shouldn\\'t be to eager to kill you. Be warned: When loading your savegame after installation, it\\'s not a good idea to quicktravel to a populated open area like winterhold. Many (probably important) NPC\\'s could die if u do so.\r\nSimilar for v4: On first load, the events will happen in a row, than they\\'ll follow their timers.\r\n\r\nDragons who r not killed in battle have a script which tells them to fly home to \\\"SkuldafnTopMarker\\\". I suppose it is meant that they get despawned in that place. Anyway it can happen that they don\\'t despawn and circle the sky there for all eternity. In this case, they block an actor on the leveled dragon list and they block the event from happening again, as it only completes if all loaded actors r unloaded. U should take a look there once in a while u get the feeling the event could be blocked, the location is found in the forth screenshot. Be careful as there is a trigger for the random encounter nearby, i once ended up facing 8 dragons there , a wispmother, a sabertooth and a bandit were also drawn into the battle so \\\"this is where the fun begins\\\". good thing is: I found dragons there on only one of my chars and only once in his 42 levels. U shouldn\\'t notice this bug in v3, as there r plenty of actors and events left in case one hangs.\r\n\r\n\\\"Cannot open store for class \\\"QF__01000D67\\\", missing file?\\\"/\\\"error: Unable to bind script QF__01000D67 to WE04COPY0003 (1E000D67) because their base types do not match\\\" or similar messages in the papyrus log.\r\nThese messages where caused by missing files in v3.0/3.1. The second one should be gone with v3.2 where the mentioned scripts have been replaced by some with \\\"speaking\\\" names.\r\nThe first one can presist, due to the scripthandling of skyrim. The (non)-existance of the script could still be mentioned in the save-game. But this message can be ignored, as the those scripts are no longer requiered. \r\n\r\nPlease tell me if u find sth else.\r\n\r\n**************************************************************************************************************************************************************************************\r\n\r\n[b]Conflicts:[/b]\r\n- shouldn\\'t interfere with localisation, at least i hope so. I play Skyrim since it came out and yesterday i noticed for the first time (for real!!) that outdoor-cell-names are displayed on the right upper corner in the game. If you can read \\\"Drachenfeste\\\" there, near the new shrine, this would be my fault, sry.\r\n\r\nConflict granted with anything modifying:\r\n- leveled Dragon lists -> put my mod first in the loadorder, to get the Dragons from the other mod; this could be the case for any mod bringing in new dragons (v3.2/v4)\r\n\r\nNotice about the scripts:\r\nThe scripts delivered by this mod can be considered \\\"peaceful\\\". They just set the references the moment one of the events triggers. There won\\'t be any still running scripts be left behind when u decide to delete the mod. Worst thing to happen r some \\\"missing file?\\\"-errors in papyrus log (those can be ignored).\r\nIts possible that you don\\'t even need the scripts at all, because the events are a copy of a vanilla event and the game should be able to recreate those scripts on demand.\r\n\r\n**************************************************************************************************************************************************************************************\r\n\r\n[b]Legal notes:[/b]\r\nDon\\'t upload on steam, hate them for setting me dry for three days while i was moving to a new flat.\r\nFeel free to use this mod in any other way you wish. I don\\'t care for gold and glory ;)\r\n\r\nGeneral permission granted without the need to ask me to use the \\\"Deutsche Uebersetzung fuer Version 5\\\" (german translation for v5) to make a localized version in your motherlanguage. To get the debugmessage right, open the DS_Settings.psc in an external editor and edit the lines. Open ck (without opening an esp file) go for Gameplay -> Papyrus Script Manager (use filter \\\"ds_s\\\") rightclick -> compile. Get the D-I-Y.pdf in the misc-section for further information where to find the shrine and message.",
  "categoryId": "24",
  "version": "5.1a",
  "author": "Alina Halo",
  "createdUnix": "1332533441",
  "updatedUnix": "1339339260",
  "containsAdultContent": false,
  "uploadedBy": "alinahalo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "46082",
      "name": "Dragon Swarms V1",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Dragon Swarms V1-13534.zip",
      "uploadedUnix": "1332533604",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/72d5a65b9117ce18ff66542d248349951c4826ba9552446bd545474cd80d5144/analysis/1406775362/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20V1-13534.zip?fid=46082&ttl=1535776382&ri=8192&rs=8192&setec=2ec315e934f4ac49006f68a3eeb7cfbe"
    },
    {
      "fileId": "46129",
      "name": "Dragon Swarms V2 - lvlrange as requested by spanian77",
      "version": "2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Dragon Swarms V2 - lvlrange as requested by spanian77-13534.zip",
      "uploadedUnix": "1332540556",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/faef382cc1a0d67fd8b3470dd32ab261b250f547fa3c81a58ebbd4eb5b727f27/analysis/1406775607/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20V2%20-%20lvlrange%20as%20requested%20by%20spanian77-13534.zip?fid=46129&ttl=1535776383&ri=8192&rs=8192&setec=48a0afafeae0010a9ead4ec55ce395b7"
    },
    {
      "fileId": "46827",
      "name": "Optional Dragontimer Remover",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "0",
      "fileName": "Optional Dragontimer Remover-13534.zip",
      "uploadedUnix": "1332709892",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/a4f1cbb7e3d1bb7c11063eb7bc86f300852a794e1a071dfa518909e889659ec7/analysis/1406779768/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Optional%20Dragontimer%20Remover-13534.zip?fid=46827&ttl=1535776383&ri=8192&rs=8192&setec=38d4f0f60c5750057781eb6546287e95"
    },
    {
      "fileId": "47388",
      "name": "More Aggression for vanilla encounter standalone",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "More Aggression for vanilla encounter standalone-13534.zip",
      "uploadedUnix": "1332867975",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1c0fede5551f4cc9e5a9402dcf431c44147dc74d9b2825928149e84a673a2ff9/analysis/1406782926/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Aggression%20for%20vanilla%20encounter%20standalone-13534.zip?fid=47388&ttl=1535776384&ri=8192&rs=8192&setec=2760708ad51ac1aa4131093427b4a360"
    },
    {
      "fileId": "47395",
      "name": "Dragon Swarms V2-1 - spanian77 - more aggressive",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Dragon Swarms V2-1 - spanian77 - more aggressive-13534.zip",
      "uploadedUnix": "1332868875",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/b9ca47795250c4d42e4c657b377035f4615d1ffeb7ccfa803e72c9469e229798/analysis/1406782927/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20V2-1%20-%20spanian77%20-%20more%20aggressive-13534.zip?fid=47395&ttl=1535776384&ri=8192&rs=8192&setec=77b9e1986fa1d85e5e9b40f30ea9a1a2"
    },
    {
      "fileId": "47396",
      "name": "Dragon Swarms V2-2 - spanian77 - really angry",
      "version": "2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Dragon Swarms V2-2 - spanian77 - really angry-13534.zip",
      "uploadedUnix": "1332868925",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/e2b62777b2b0d2eb7bdd90c15e62eb142867f6e27f277f0ee8702f101e23cc1f/analysis/1406782928/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20V2-2%20-%20spanian77%20-%20really%20angry-13534.zip?fid=47396&ttl=1535776385&ri=8192&rs=8192&setec=c2f80a67f2b2f2e2c73fbc2fa12d2cef"
    },
    {
      "fileId": "47397",
      "name": "Dragon Swarms V1-1 - more aggressive",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Dragon Swarms V1-1 - more aggressive-13534.zip",
      "uploadedUnix": "1332869298",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/360529eb757c125fa52ce073f02105959b398079aa88fad113f48e83dde07ac0/analysis/1406782928/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20V1-1%20-%20more%20aggressive-13534.zip?fid=47397&ttl=1535776385&ri=8192&rs=8192&setec=31a1b605b49a475452cbc5530d2423f4"
    },
    {
      "fileId": "47400",
      "name": "Dragon Swarms V1-2 - really angry",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Dragon Swarms V1-2 - really angry-13534.zip",
      "uploadedUnix": "1332869404",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/475923995dc13b064aa47285663a66193ee3e0457c2292d3b8e1259144796e73/analysis/1406782929/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20V1-2%20-%20really%20angry-13534.zip?fid=47400&ttl=1535776386&ri=8192&rs=8192&setec=4b6af6a594851bbf61a4dc04e64f80ca"
    },
    {
      "fileId": "47469",
      "name": "Fly-By to Attack",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Fly-By to Attack-13534.zip",
      "uploadedUnix": "1332884305",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/612a6bdfcfa4135c8b2d918e6b83335e672d8b9eabea72aa315ac11f5a077fd1/analysis/1406783245/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fly-By%20to%20Attack-13534.zip?fid=47469&ttl=1535776386&ri=8192&rs=8192&setec=0e691a0714c10edecfa2de73ba3c4094"
    },
    {
      "fileId": "47747",
      "name": "Timer Remover - Raw - beta",
      "version": "0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "0",
      "fileName": "Timer Remover - Raw - beta-13534.zip",
      "uploadedUnix": "1332965416",
      "modVersion": "0",
      "virusScanUrl": "https://www.virustotal.com/file/9333b8cb2c51a97c5bdcc94d06480cc76ab25588ccd8f82018671cfc84f43f3e/analysis/1406784844/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Timer%20Remover%20-%20Raw%20-%20beta-13534.zip?fid=47747&ttl=1535776386&ri=8192&rs=8192&setec=2961f172c231f71ab75262e5e051093d"
    },
    {
      "fileId": "47757",
      "name": "Optional Timer Cap Remover new Version",
      "version": "2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "Optional Timer Cap Remover new Version-13534.zip",
      "uploadedUnix": "1332970595",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/bab25dec6c51acea708416635b8bce40c99b95138e1679faea4e79c1e02a608c/analysis/1406784913/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Optional%20Timer%20Cap%20Remover%20new%20Version-13534.zip?fid=47757&ttl=1535776387&ri=8192&rs=8192&setec=d0298cefcb85e9384abc243b99c9eab5"
    },
    {
      "fileId": "48511",
      "name": "Extended Dragonlist for V1 and V2",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "Extended Dragonlist for V1 and V2-13534.zip",
      "uploadedUnix": "1333194380",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/235129352b7468b1c0053fb9f13bdfa0742c784f2378a0cb9c7df9a670f241e7/analysis/1406788957/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Extended%20Dragonlist%20for%20V1%20and%20V2-13534.zip?fid=48511&ttl=1535776387&ri=8192&rs=8192&setec=c6b57d60ab3b911a30de79c994450107"
    },
    {
      "fileId": "48904",
      "name": "Dragon Swarms v3-1",
      "version": "3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "Dragon Swarms v3-1-13534.zip",
      "uploadedUnix": "1333285770",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/1263a4925abaa1e0fe9d0533df183cd95ac7c967d693a43aa7a35b7b5a13559e/analysis/1406791207/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20v3-1-13534.zip?fid=48904&ttl=1535776388&ri=8192&rs=8192&setec=57bb11fa9c811efbb16658888071f8d1"
    },
    {
      "fileId": "51742",
      "name": "Vanilla timer with multiple Events",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "Vanilla timer with multiple Events-13534-1-0.zip",
      "uploadedUnix": "1334005074",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e43b3c13b34b8b34b75e44d7ae85ca3493efd7d76d969e4ffa77c2983e689631/analysis/1406806503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vanilla%20timer%20with%20multiple%20Events-13534-1-0.zip?fid=51742&ttl=1535776388&ri=8192&rs=8192&setec=1a14d8be147a98d751e033dbc4dc1dcf"
    },
    {
      "fileId": "53481",
      "name": "Dragon Swarms v3-1 - Easy Mode",
      "version": "3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "Dragon Swarms v3-1 - Easy Mode-13534.zip",
      "uploadedUnix": "1334509911",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/5c7f4854bd43c42d67478e3878388ef3ac16512f0a28611cbc1c855abff1885b/analysis/1406817182/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20v3-1%20-%20Easy%20Mode-13534.zip?fid=53481&ttl=1535776389&ri=8192&rs=8192&setec=ececd6ca5501bd4c34f1fa9244917c60"
    },
    {
      "fileId": "56043",
      "name": "Dragon Swarms v3-2",
      "version": "v3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "Dragon Swarms v3-2-13534.zip",
      "uploadedUnix": "1335305973",
      "modVersion": "v3.2",
      "virusScanUrl": "https://www.virustotal.com/file/3ce1129cf12d5dfa454e6f11911fb61661f83e59216f6192d9203bfe847027de/analysis/1406838847/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20v3-2-13534.zip?fid=56043&ttl=1535776389&ri=8192&rs=8192&setec=4277da53aacaba7f2d51849aca0e0799"
    },
    {
      "fileId": "56052",
      "name": "Dragon Swarms v3-2 - easy mode",
      "version": "3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "Dragon Swarms v3-2 - easy mode-13534.zip",
      "uploadedUnix": "1335307735",
      "modVersion": "3.2",
      "virusScanUrl": "https://www.virustotal.com/file/1e562d16c0af451e88d915eaf9361df737dc251af2bae109e33c7468e618e076/analysis/1406838964/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20v3-2%20-%20easy%20mode-13534.zip?fid=56052&ttl=1535776390&ri=8192&rs=8192&setec=f25c6fc5a157b9fa6ff93d7bfc4fc8f6"
    },
    {
      "fileId": "56527",
      "name": "Dragon Swarms v3-2 - insane mode",
      "version": "3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "Dragon Swarms v3-2 - insane mode-13534.zip",
      "uploadedUnix": "1335462093",
      "modVersion": "3.2",
      "virusScanUrl": "https://www.virustotal.com/file/b1a35c87b1963eb70ad51bbc9d1ff636313e6f7b6a4be5410ec5e1a20ddb30dc/analysis/1406841852/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20v3-2%20-%20insane%20mode-13534.zip?fid=56527&ttl=1535776390&ri=8192&rs=8192&setec=924cf4f21c102f50029cffa96b68e24f"
    },
    {
      "fileId": "56884",
      "name": "Dragon Swarms v4",
      "version": "4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "Dragon Swarms v4-13534-4-0.zip",
      "uploadedUnix": "1335572384",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/3cb121b9fb02b05281ed513847d27ad8065f57dea8e02ab6826222e87c498e03/analysis/1406844315/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20v4-13534-4-0.zip?fid=56884&ttl=1535776391&ri=8192&rs=8192&setec=398bf6361daaff015021bed2864f4131"
    },
    {
      "fileId": "56885",
      "name": "Dragon Swarms v4 - Easy Mode",
      "version": "4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "Dragon Swarms v4 - Easy Mode-13534-4-0.zip",
      "uploadedUnix": "1335572432",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/c4fd4397d87b20a0ffbcaa6349b38a8debdf884fd0e229471886dfc4d4fe5958/analysis/1406844316/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20v4%20-%20Easy%20Mode-13534-4-0.zip?fid=56885&ttl=1535776391&ri=8192&rs=8192&setec=8d2a55708dfdd96a786bbadbbafa50fd"
    },
    {
      "fileId": "56886",
      "name": "Dragon Swarms v4 - Insane Mode",
      "version": "4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "Dragon Swarms v4 - Insane Mode-13534-4-0.zip",
      "uploadedUnix": "1335572460",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/e2e67bb992094e35940805825fc6f0dfd9bd04152d8b8598a8a14f81d9c0c28e/analysis/1406844316/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20v4%20-%20Insane%20Mode-13534-4-0.zip?fid=56886&ttl=1535776392&ri=8192&rs=8192&setec=9a9781a072e5938cdc04d2bc4533ea0c"
    },
    {
      "fileId": "59760",
      "name": "Dragon Swarms v4 - Slow Respawn Mode",
      "version": "4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "Dragon Swarms v4 - Slow Respawn Mode-13534.zip",
      "uploadedUnix": "1336492081",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/6a6bd2677be42f9d0799744c85953b3c9f9ec2e7999beb1322439818800e2223/analysis/1406878022/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20v4%20-%20Slow%20Respawn%20Mode-13534.zip?fid=59760&ttl=1535776392&ri=8192&rs=8192&setec=da055aa9a955332ad67d03f7df2f42f5"
    },
    {
      "fileId": "61115",
      "name": "Dragon Swarms v4-1 - Insane Mode with Random Chance",
      "version": "4.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "Dragon Swarms v4-1 - Insane Mode with Random Chance-13534-4-1.zip",
      "uploadedUnix": "1336946442",
      "modVersion": "4.1",
      "virusScanUrl": "https://www.virustotal.com/file/8d06356b102a8701fc6541b64ad52532415706c1ed51ff3145ac0cd740b5fd6c/analysis/1406890382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20v4-1%20-%20Insane%20Mode%20with%20Random%20Chance-13534-4-1.zip?fid=61115&ttl=1535776393&ri=8192&rs=8192&setec=d3b285ee2b086ebd0670b3413c4b2799"
    },
    {
      "fileId": "62164",
      "name": "All in One - Dragon Swarms v5-1",
      "version": "5.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "617",
      "fileName": "All in One - Dragon Swarms v5-1-13534-5-1.zip",
      "uploadedUnix": "1337378385",
      "modVersion": "5.1",
      "virusScanUrl": "https://www.virustotal.com/file/ef80ac7b2bf7c2359c85e615933f76b1b68078fddc419f8b7b3b8408973ae8c6/analysis/1406900946/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%20in%20One%20-%20Dragon%20Swarms%20v5-1-13534-5-1.zip?fid=62164&ttl=1535776393&ri=8192&rs=8192&setec=76b3b19db8a94645d84c9e9a9078e0eb"
    },
    {
      "fileId": "62206",
      "name": "D-I-Y Guide updated to v5-1",
      "version": "5.1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "515",
      "fileName": "D-I-Y Guide updated to v5-1-13534.zip",
      "uploadedUnix": "1337388395",
      "modVersion": "5.1",
      "virusScanUrl": "https://www.virustotal.com/file/13df36837408cd5379a17ecb6d278e8448fedeb196879ad9dccf4bcfc1b8d667/analysis/1406901546/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/D-I-Y%20Guide%20updated%20to%20v5-1-13534.zip?fid=62206&ttl=1535776394&ri=8192&rs=8192&setec=2023df15ea68e03b324493253cabf277"
    },
    {
      "fileId": "62290",
      "name": "old versions description v2-v4",
      "version": "4.1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "8",
      "fileName": "old versions description v2-v4-13534-4-1.zip",
      "uploadedUnix": "1337422386",
      "modVersion": "4.1",
      "virusScanUrl": "https://www.virustotal.com/file/60bbf60546e9df79cbc1e4934b8c9e8973dc8abca4899a0a83be34ba10dd72ce/analysis/1406902323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/old%20versions%20description%20v2-v4-13534-4-1.zip?fid=62290&ttl=1535776394&ri=8192&rs=8192&setec=e1c0c2279100401e698d943c23a83bd2"
    },
    {
      "fileId": "62517",
      "name": "Dragon Swarms v2-3 slim remake",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Dragon Swarms v2-3 slim remake-13534.zip",
      "uploadedUnix": "1337515196",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/683fae42a25629cdc437a8a01029aee4135fa3a55c0ca88117a6b9e767d64bc1/analysis/1406904603/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%20v2-3%20slim%20remake-13534.zip?fid=62517&ttl=1535776395&ri=8192&rs=8192&setec=e489c0e54bbac3b4d0782eb43703465e"
    },
    {
      "fileId": "62868",
      "name": "Deutsche Uebersetzung fuer Version  5",
      "version": "5.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "14",
      "fileName": "Deutsche Uebersetzung fuer Version  5-13534-5-1.zip",
      "uploadedUnix": "1337630825",
      "modVersion": "5.1",
      "virusScanUrl": "https://www.virustotal.com/file/2d2563b8d2cbca1ea159c95de3964a2b2e803ff124719679881aa0314d50b693/analysis/1406907842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deutsche%20Uebersetzung%20fuer%20Version%20%205-13534-5-1.zip?fid=62868&ttl=1535776395&ri=8192&rs=8192&setec=4a1fac8e265d358358591eef7019f483"
    },
    {
      "fileId": "67122",
      "name": "Dragon Swarms 5-1a for Mighty Dragons 3-7a",
      "version": "3.7a5.1a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3901",
      "fileName": "Dragon Swarms 5-1a for Mighty Dragons 3-7a-13534-3-7a5-1a.zip",
      "uploadedUnix": "1339339260",
      "modVersion": "3.7a5.1a",
      "virusScanUrl": "https://www.virustotal.com/file/8f5deeb56e761e411219ceda0f30bdfdb1cb6e6739f908358595d66c88f7631d/analysis/1406950324/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Swarms%205-1a%20for%20Mighty%20Dragons%203-7a-13534-3-7a5-1a.zip?fid=67122&ttl=1535776396&ri=8192&rs=8192&setec=af3dea0c76b9ba08dbfcfc019d5f15f4"
    }
  ]
}