{
  "modId": 13579.0,
  "modName": "Boire et manger en temps reel - Traduzione italiana",
  "summary": "Traduzione italiana della mod di Gérauld",
  "descriptionHtml": "[center]- Traduzione italiana facente parte del progetto di traduzioni [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]Dragonborn Italia[/url] -\r\n\r\n***[/center]\r\n\r\n[color=#7FFF00][b][right]Attention!\r\nThis is just the italian translation of the original mod. I didn\\'t create it.\r\nYou can find the original mod at [url=http://skyrim.nexusmods.com/downloads/file.php?id=13106]this page[/url]. All credit goes to his creator Gerauld.\r\n\r\nIf you like the mod, go to his page and [I]ENDORSE[/I] him![/right][/b][/color]\r\n\r\n[b][COLOR=yellow]Attention!\r\nC\\'est seulment la traduction italienne du mod original. Je ne l\\'ai pas créé.\r\nVous pouvez trouver le mod original à [URL=http://skyrim.nexusmods.com/downloads/file.php?id=13106]cette page[/URL]. Tout le mérite va à son créateur Gérauld .\r\n\r\nSi vous aimez le mod, allez sur sa page et cliquez ENDORSE![/COLOR][/b]\r\n\r\n\r\n\r\n[center]***[/center]\r\n\r\n\r\n[color=#7FFF00][B]Boire et manger en temps réel - Traduzione italiana[/b][/color]\r\n\r\nVersione BETA\r\n\r\n[color=#20B2AA][B]Contenuto della mod:[/B][/color]\r\n\r\nQuesta mod aggiunge un tocco di realisticità al nostro gioco. \r\nQuando ci troviamo in un combattimento capita spesso di bloccare il gioco, aprire l\\'inventario ed ingurgitare una mole di pozioni, il tutto senza che nel gioco accada nulla. D\\'ora in poi bere una pozione comporterà l\\'attivarsi della sua animazione corrispondente. Quindi, se ci troviamo in un combattimento e vogliamo curarci, sarà meglio prima nascondersi e poi bere la pozione.\r\n*L\\'animazione si ripete tante volte quante le pozioni che bevi\r\n\r\nAltro aspetto interessantissimo è l\\'animazione del cibo e delle bevande alcoliche (diversa da quella delle pozioni):\r\nbevendo numerose bevande alcoliche potremmo raggiungere diversi livelli di ubriachezza, fino a perdere completamente il controllo del nostro personaggio. Il tutto accompagnato da un effetto visivo molto colorato.\r\n\r\nBugs della versione:\r\n- se la pozione ha due effetti, è possibile che il personaggio compia due volte l\\'animazione;\r\n- se il personaggio ha in mano due armi esattamente uguali alla fine dell\\'animazione ne sparirà una;\r\n- al momento non è stato possibile tradurre 2 messaggi che arrivano mentre stai bevendo alcolici, ho contattato l\\'autore per vedere se riusciamo a risolvere il problema.\r\n\r\n[center]***[/center]\r\n\r\n[color=#20B2AA][B]Installazione:[/B][/color]\r\n\r\n[B]Innanzitutto recarsi alla [url=http://skyrim.nexusmods.com/downloads/file.php?id=13106]pagina originale[/url] e scaricare la mod.[/B]\r\n\r\nDopodiché recarsi alla pagina di [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]Dragonborn Italia[/url], consultare la lista \\\"Downloads\\\" (pulsante verde subito sopra la descrizione) e scaricare la mod corrispondente.\r\n\r\nL\\'archivio contiene unicamente il file tradotto, per poter fruire della mod è necessario prima scaricarla dalla pagina originale (assicurandosi di scaricare la versione della traduzione fornita, in alternativa la mod non funzionerà) e poi sostituire il file .esp con quello da noi fornito.\r\n\r\n[center]***[/center]\r\n\r\n[I]Se notate qualche incongruenza o imprecisione nella traduzione, sarò aperto a qualunque suggerimento/critica vogliate pormi.[/I]",
  "categoryId": "51",
  "version": "BETA",
  "author": "Gerauld",
  "createdUnix": "1332598409",
  "updatedUnix": "1332598409",
  "containsAdultContent": false,
  "uploadedBy": "Ichnos",
  "primaryFile": null,
  "files": []
}