{
  "modId": 13597.0,
  "modName": "Forge Equipment",
  "summary": "Forge More Vanilla Equipment & A Few Extras.",
  "descriptionHtml": "Please mod has been replaced by: http://skyrim.nexusmods.com/mods/22290\r\nAll new updates will be applied to Craft Temper Smelt.\r\n\r\nForge Equipment\r\n\r\nOK so I know there are a bunch of other Crafting mods out there, some come and go, some hide and reappear.\r\n\r\nIve tried to cover and complete all Vanilla recipes for Smithing, Tempering, and added Salvage recipes to new items.\r\nTo round out the Forge, Stormcloak Equipment can be crafted right along with complete sets of Imperial equipment.\r\nArtifacts and Uniques can be Replicated without enchantments at the Forge once you have acquired the original to copy from.\r\nA few new pieces of equipment compliment vanilla gear, like Stormcloak Axe, Shield, also Hoods and Leather Robes.\r\nA few fixes to equipment like proper Material Types, visibility issues with Vampires, and clipping issues with hair.\r\nUnblessed Amulets you can craft and enchant to your liking.\r\n\r\nUse this in conjunction with my Salvage Material mod\r\n\r\nI didnt make any notes on my changes (bad E2B2), plus Ive been sitting on this mod for 2 weeks.\r\nIll list my changes from what I remember and peaking at the Details List in the CK :)\r\n\r\nForge:\r\nWood:  Hunting, Longbow, Wooden Staff (broken)\r\n\r\nHide: Saviors Hide Replica\r\n\r\nDraugr: Ancient Nord Battleaxe, Bow, Greatsword, Sword, War Axe\r\n\r\nIron:  Ancient Nord Boots, Cuirass, Gauntlets, Helmet; Executioner Axe\r\n\r\nStudded: Stromcloak Boots, Cuirass, Gauntlets, Helmet; Stormcloak Officer Boots, Cuirss, Bracers, Helmet; Stormcloak Shield, War Axe\r\n\r\nImperial: Imperial Full Helmet, Bow, Light Armor, Light Boots, Light Bracers, Light Helmet, Light Shield, Officer Helmet, Sword, Studded Cuirass\r\n\r\nSteel:  Blades Armor, Boots, Gauntlets, Helmet, Shield, Sword; Scimitar\r\n\r\nLeather:  Adept|Apprentice|Novice Leather Hoods, Adept|Apprentice|Novice|Expert|Master Leather Robes; Nightingale Cuirass, Hood, Gloves, Boots Replicas; Ranger Armor, Hood, Gloves, Boots\r\n\r\nDwarven:  Dragon Priest Dagger, Keening Replica, Spellbreaker Replica\r\n\r\nElven: Elven Gilded Armor, Boots, Gauntlets, Helmet; Elven Hood\r\n\r\nEbony:  Dawnbreaker Replica, Ebony Blade Replica, Ebony Mail Cuirass, Ebony Mesh Hood, Mace of Molag Bal Replica, Masque of Clavicus Vile Replica, Mehrunes Razor Replica, Nettlebane Replica, Nightingale Blade Replica, Nightingale Bow Replica, Rueful Axe Replica, Sanguine Rose Replica, Shield of Ysgramor Replica, Skull of Corruption Replica (broken), Volendrung Replica, Wabbajack Replica (broken), Wuuthrad Replica\r\n\r\nGlass:  Chillrend Replica\r\n\r\nDragon:  Jagged Crown Replica\r\n\r\nDaedric:  Daedric Mesh Hood\r\n\r\nJewelry:  Amulet of Nacromancer Replica, Amulet of Ancient Nord, Amulet of Articulation Replica, Amulet of Elder Council Replica, Unblessed Amulet of Zenithar, Unblessed Amulet of Talos, Unblessed Amulet of Stendarr, Unblessed Amulet of Mara, Unblessed Amulet of Kynareth, Unblessed Amulet of julianos, Unblessed Amulet of Arkay, Unblessed Amulet of Akatosh\r\n\r\nMisc:  Ghostblade Replica, Silver Sword\r\n\r\nI have a mod that removes the charges from all Daedric artifacts, should I include it into this or leave as separate mod?\r\n\r\nV1.00:  Release\r\nv1.01:  Forgot to add fixes from my other unreleased mod. Fix Ebony Shield invisible on Vampire, Moonstone Dragon Priest Mask to proper enchantment, Helm of Yngol Clipping issues, Gloves of the Pugilist to Heavy Armor type. (Use with Weapons and Armor Fixes by Headbomb)\r\nv1.02:  Blades Sword quest condition (like other Blades Equipment). Amulet of Articulation Replica removed Armor value. Amulet of Elder Console Replica added weight. Craft, Temper, Salvage Dragon Priest Daggers (Dwarven Material). Temper Kahvozein Fang. Ebony Mail lowered armor value and price. Temper Shrouded Armor Set.\r\nv1.03: Forgot to select Breton Vampire Race for Ebony Shield Fix, Daedric Bow Impact Fix.\r\nv1.04: Craft, Temper, Salvage Wood Axe, Pick, and new Ancient Nord Light Armor.\r\nv1.05: Completed \\\"Dragonborn\\\" armor as in video, based off Studded Armor, Set is Light Armor; For Unarmed Fighters out there, new Spiked Unarmed Gauntlets with scaled Enchantments; Blades Katana can be crafted if it is in Inventory (you can find 2 before Main quest stuff); Finally added Armored Circlets, they are very much WIP as only Iron is craftable at yet.",
  "categoryId": "24",
  "version": "Final",
  "author": "E2B2",
  "createdUnix": "1332613026",
  "updatedUnix": "1336260955",
  "containsAdultContent": false,
  "uploadedBy": "epbreen",
  "primaryFile": null,
  "files": [
    {
      "fileId": "59045",
      "name": "Forge Equipment",
      "version": "1.05",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "Forge Equipment-13597-1-05.7z",
      "uploadedUnix": "1336260955",
      "modVersion": "1.05",
      "virusScanUrl": "https://www.virustotal.com/file/f55f6d13f4f860f4d29cd59e012fb0a641b85742664653b95b05f620d07050fa/analysis/1406870471/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forge%20Equipment-13597-1-05.7z?fid=59045&ttl=1535776512&ri=8192&rs=8192&setec=2d39173473fe95f5da5bd4841b33f402"
    }
  ]
}