{
  "modId": 136.0,
  "modName": "FINALLY actual fixed female face normal maps",
  "summary": "AS FAR AS I KNOW THIS IS THE ONLY MOD THAT COMPLETELY REMOVES THE \\\"BLOCKY NOSE\\\" EFFECT.It also smooths out the face.\r\n\r\n I am depressed that their character artist didn\\'t fix the artifacting on his normal map bake. so i have done it for him...\r\n\r\ni would not be releasing this except that a few friends requested that i do.",
  "descriptionHtml": "essentially this makes the female face normal maps smoother, fixes the obvious artifact issues, fixes the lighting issues and stops the female faces on all races from having the incredibly annoying normal map artifacts all over them (stuff like the \\\"blocky\\\" nose). i took the base from the other female replacer mod which was better, yet still full of issues (http://skyrimnexus.com/downloads/file.php?id=128) and fixed it.If you want me to remove the file let me know i dont really care once again this is pretty mucha private tweak.\r\nI imported it to Xnormal and manually tweaked it to get rid of its general shittyness. This only fixes the human  females since i CBA to fix the others since the problem there is less obvious. when i have more time ill retexture the faces and fix the specualar maps on the human characters to.\r\n\r\n\r\ni dont deserve much credit since this isnt entirely my creation more a fix.\r\n\r\nif you dont know what normal maps are, or specifically world space normal maps in this case:\r\n\r\nhttp://wiki.cgsociety.org/index.php/Normal_Map\r\n\r\n\r\nthis is basically a private release. \r\n\r\n\r\ndo whatever you want aslong as you give the gentleman here credit/get his permission:\r\n(http://skyrimnexus.com/downloads/file.php?id=128) \r\ndont care if you give me any.",
  "categoryId": "26",
  "version": "sex.0",
  "author": "Sakar",
  "createdUnix": "1321219819",
  "updatedUnix": "1321220011",
  "containsAdultContent": false,
  "uploadedBy": "sacher",
  "primaryFile": null,
  "files": [
    {
      "fileId": "233",
      "name": "Fixed female faces",
      "version": "NOPE.jpg",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5637",
      "fileName": "Fixed female faces-136-NOPE-jpg.rar",
      "uploadedUnix": "1321220011",
      "modVersion": "NOPE.jpg",
      "virusScanUrl": "https://www.virustotal.com/file/91a6b032a4ae99d4347370a913be7c5cd389505fe3bab3afe2d4b6a89f944b83/analysis/1406329337/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fixed%20female%20faces-136-NOPE-jpg.rar?fid=233&ttl=1535752723&ri=8192&rs=8192&setec=072761a4f5d7787cd390a37d6fc52ef8"
    }
  ]
}