{
  "modId": 13616.0,
  "modName": "More mariable women",
  "summary": "Adds some cutsom women. All of them added to the marriage-faction.\r\n4 for now. V1.1: Friends added. Now more people will come to your wedding!\r\n\r\n\r\nI take requests!!",
  "descriptionHtml": "This mod adds new NPCs to the marriage faction. For now there are 4.\r\n\r\nNew Update! V1.1. Complete pack that contains all working spoused I´ve made (4) and with a little update: Relationships added. The four ladies do now have friends, who will come to the wedding. So your wedding shouldn´t look that empty. ;)\r\n\r\nWarning: I´ve experienced a little problem: My spouse of this mod won´t cook for me anymore since the update. I´m not sure if it´s because of the update, because my first vanilla wife had the same problem too after some in-game days. And that was before I installed my very first mod so...\r\nI think divorce (there´s a mod that gives the ability to divorce) and marry her again, could fix the problem. I´ll try that later. If you don´t mind this problem or want to test how it can be fixed, feel free to download. In future, I won´t update any women anymore. I´ll just add more from time to time. \r\n\r\nIt was nice of you if you would test this and look if updating took the option for cooking a meal for you, too. (If you´re already married with a woman of this mod).\r\n\r\nI take requests!\r\n\r\nAlexia: \r\nA beautifull young Imperial woman, who came from Cyrodiil. She was tired of being a servant of the Count of Bruma. Because of living in Bruma since her day of birth, she doesn´t mind the cold in Skyrim. She stood in the first small settlement she saw and helps in a shop there. \r\nThink a bit and you´ll know where she is ;)\r\n\r\nAnja: \r\nA pretty, young Nord woman, who was born in Riften. When she was old enough, her parents decided to leave Riften. Her parents wanted to move to Cyrodiil, but she wanted to stay in Skyrim. Her parents moved to Cyrodiil, even if they didn´t really want to leave their daughter alone, but she was old enough to care for herself. Now she has got a nicely paid job in the tavern of the central town of Skyrim. She helps serving drinks in the evening. This town is being visited by many travelers and benefits from the trading with the south. \r\nIs this enough information to find her?\r\n\r\nAnimiriel:\r\nA really good looking Woodelf, who didn´t want to end as the wife of a fat, old, rich man. She fled from Valenwood. She stood some time in Cyrodiil and liked it there, but the Aldmeri-Alliance made life really hard there, so she moved to Skyrim. But before moving to Skyrim, she had a trip to Morrowind. Things were terrible there. Now she´s serving drinks in a tavern owned by two Argonians. In a town near the border to Morrowind. She dreams of someone who will treat her like a proud woman deserves it. Will you find her? Will you make her dream come true?\r\n\r\nArmelle:\r\nArmelle is a Breton. She moved to Skyrim as soon as she was old enough. She moved to the town that´s the nearest to High Rock: Solitude.\r\nShe likes to go shopping and walking through the city. She´s looking for her great love. Are you her great love?\r\n\r\n\r\nRemoved: Reason: Causes crash!\r\nAhrasa:\r\nA female Khajiit, who traveled with a Khajiit-Caravan. When they were building their camp in front of Windhelm, a group of Stormcloaks came. They said they don´t want Skooma-dealers here and killed all. Only Ahrasa could escape. Now she´s helping at the Sarethi-Farm. She hates that job, but it´s her only possibility to live. That, or somebody who´ll give her a home. Maybe you?\r\n\r\nYou can marry all of them. (Not all at the same time with ONE character of course :D) If you´re already married: At least you´ll get some new refreshing eye-candy. At least in MY opinion they´re really beautifull!",
  "categoryId": "33",
  "version": "1.1",
  "author": "Carimya",
  "createdUnix": "1332628391",
  "updatedUnix": "1336225914",
  "containsAdultContent": false,
  "uploadedBy": "Carimya",
  "primaryFile": null,
  "files": [
    {
      "fileId": "46494",
      "name": "All you need",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "794",
      "fileName": "All you need-13616.zip",
      "uploadedUnix": "1332628538",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c48f47928220919fe4ef55ab24b404c2bc7293083a5169f5e5100e0c8e6eab76/analysis/1406777608/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%20you%20need-13616.zip?fid=46494&ttl=1535776558&ri=8192&rs=8192&setec=0eed1d3f922abcc2ed05c1354a3fba7b"
    },
    {
      "fileId": "50598",
      "name": "Armelle",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "288",
      "fileName": "Armelle-13616.rar",
      "uploadedUnix": "1333715423",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d5c4ad9cffa94cabba48a0192a86e6668b2aee083640b39e2fa7a8ce5ad34416/analysis/1406800444/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Armelle-13616.rar?fid=50598&ttl=1535776559&ri=8192&rs=8192&setec=25570c4d2bc73759d20e4c001f2eec87"
    },
    {
      "fileId": "58889",
      "name": "Completepack with Update",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1082",
      "fileName": "Completepack with Update-13616-1-1.rar",
      "uploadedUnix": "1336225914",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/0d4fabe3a74b307954833a29ed7812453fec1804b17c587be1bef17476784fd2/analysis/1406868904/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Completepack%20with%20Update-13616-1-1.rar?fid=58889&ttl=1535776559&ri=8192&rs=8192&setec=6df45c4d3ae75276047004c03498efc4"
    }
  ]
}