{
  "modId": 13612.0,
  "modName": "Player Chest in Warmaidens in Whiterun",
  "summary": "Very small mod to add a player chest in Warmaiden\\'s Blacksmith in Whiterun.",
  "descriptionHtml": "If you\\'re a new player or someone who just started a new save, this mod is intended to give you somewhere to store your sweet gear and loot while you drum up the money to buy a house. I added the chest in Warmaiden\\'s in Whiterun. As you walk into the shop, the chest is underneath the stairs on the left hand side. I added a rug underneath it and a banner above it to make it more obvious.\r\n\r\nI\\'m 90% sure it\\'s all working fine, but this is the first mod I\\'ve ever made for any game so please be understanding. Give it a test by leaving something in there, exit the shop and wait for 48 hours. If your item is still in there, then I think it all works fine.\r\n\r\nFeel free to repost this as long as you credit me. Send me a comment if something goes wrong, I\\'ll be happy to help.\r\n\r\nComment and/or endorse if you like the mod!  \r\n\r\n______________________________________________________\r\n\r\nInstallation instructions:\r\n\r\nIf you use the Nexus Mod Manager just hit the \\\"download with manager\\\", let it download automatically then just double click the mod in the \\\"mod\\\" section to activate.\r\n\r\nor\r\n\r\nTo download and install manually, hit the manual download button, when you get the folder, unzip it to get to the plugin file inside,  put that plugin file in your Skyrim Data folder. If you\\'re having trouble finding that folder it should in in Steam > steamapps > common > skyrim >data. Then when you start up Skyrim via Steam, hit the box for data files, scroll to find the mod and make sure a tick is next to the mod.\r\n",
  "categoryId": "85",
  "version": "1.0",
  "author": "harveyisbatman",
  "createdUnix": "1332625798",
  "updatedUnix": "1332625949",
  "containsAdultContent": false,
  "uploadedBy": "harveyisbatman",
  "primaryFile": null,
  "files": [
    {
      "fileId": "46479",
      "name": "PlayerChestInWarmaidens",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "PlayerChestInWarmaidens-13612-1.zip",
      "uploadedUnix": "1332625949",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/bb0371c7da75a8bf7c5acfd3d41f51ffd04afdcc14bcdb87c494532d5f901741/analysis/1406777583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PlayerChestInWarmaidens-13612-1.zip?fid=46479&ttl=1535776552&ri=8192&rs=8192&setec=b0c2f55628caafec908748970482cea8"
    }
  ]
}