{
  "modId": 13623.0,
  "modName": "Race Morpher",
  "summary": "Have you ever dreamed of being a Half-Orc with big teeth and still be hailed as a true Nord ? Or you want to be a Half-Elf, a mix between Redguard and Dark Elf ? Maybe you roleplay a Thalmor disguised as a true Nord spying on those pesky Talos-Worshippers.  \r\nWell then this mod is for you.\r\n",
  "descriptionHtml": "This mod enables you to choose any humanoid race you want and turn it into another races looks or a mixed blend of your own desire. All beards, Hairs, Eye shapes, Noses, Eye colours, Skin colours, eyebrows, lips, complexions etc are enabled. This also includes the famous Orc Mouth.\r\nAll races also have each others presets and they start with their original complexions aswell\r\n\r\nMost important: IT DOESN\\'T AFFECT NPCs \r\n\r\nThe mod consists of 9 .esp files and only one should be enabled at a time\r\nRACVanillaMorph\r\nRACBretonMorph\r\nRACDarkElfMorph\r\nRACHighElfMorph\r\nRACImperialMorph\r\nRACNordMorph\r\nRACOrcMorph\r\nRACRedguardMorph\r\nRACWoodElfMorph\r\n\r\nWich .esp you use depends on wich headmorph you wish on your character. You can of course disable the .esp after you created your character and saved it. However you will lose the headmorph in that case. \r\nRACVanillaMorp.esp has the original headmorphs for their races\r\n\r\nRACOrcMorph is a bit special since it has the Orc Mouth enabled for the other races by using a Scar setting. It is the first setting on the slider and it hasnt replaced any vanilla scars so it wont affect any NPCs. You control the size of the mouth with the mouthshape slider. \r\nReason that it is only enabled for this .esp is that without the headmesh of orcs the mouth will look insane.\r\n\r\nThe pictures gives an example of what can be done with the different presets.\r\n",
  "categoryId": "34",
  "version": "1.0",
  "author": "Basvanbeu",
  "createdUnix": "1332631438",
  "updatedUnix": "1332631477",
  "containsAdultContent": false,
  "uploadedBy": "basvanbeu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "46509",
      "name": "RaceAppearanceChanger",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "992",
      "fileName": "RaceAppearanceChanger-13623-1-0.rar",
      "uploadedUnix": "1332631477",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fe82a5291746d1552f199f40291aeaea1b03ed66691ec815877a454e3dbaf7c0/analysis/1406777707/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RaceAppearanceChanger-13623-1-0.rar?fid=46509&ttl=1535776569&ri=8192&rs=8192&setec=0f20ca4c5c93affedee4df5b95f52a5c"
    }
  ]
}