{
  "modId": 13636.0,
  "modName": "Layer Bikini - Violetta Edtion - CBBE UNP",
  "summary": "My edition of anano\\'s superb Layer Bikini mod which incorporates an edited color map (texture) and normal map.  Works with CBBE or UNP as a stand-alone armor, and as a nude replacement for UNP and CBBE via anano\\'s Layer Bikini replacer versions.\r\n\r\nRequires anano\\'s LayerBikini (stand-alone or replacers)",
  "descriptionHtml": "Details:\r\nWell, what can I say... this is my first mod ever, of any sort, for any game.  I was initially inspired to try my hand at modding after seeing anano\\'s amazing Layer Bikini, and realizing that he had freely provided the raw PSD files to allow for easy recoloring/retexturing of it.  It was all a bit confusing at first when trying to figure out which compressions to use, how specular layers work or figuring out the alpha layer is not the same thing as an alpha channel (T_T;), but I feel pretty confident that everything is working properly at this point.\r\n\r\nNo changes were made to the meshes or UV maps since I don\\'t know enough about them to do so. I have edited the cloth\\'s textures, colors, massively edited the flowers, and cleaned up all the fake AO shadowing on  to remove any artifacts (this probably isn\\'t necessary but I\\'m somewhat obsessive compulsive perfectionist ^^;).  For the normal map I\\'ve removed the mesh texture from the colored areas, smoothed out the jaggies and artifacts, tweaked the depth, and heavily modified the specular map changing it to have about 7 different shades of grey, black, and white in different areas; this is most apparent on on the flowers.  The flowers are definitely my favorite part and where most of my effort ended up, and I\\'m hoping to go back and enhance it a little further with it\\'s own normal map texture and better shading, but it is difficult to find the time between work shifts.\r\n\r\nI\\'m hoping to learn about more in the future and update this files quality and if I can figure it out some editing of its actual shapes.  The pictures are very poor for the moment as I wanted to get this up while I had the time. I will attempt to grab some better pics the next time I play and replace them ASAP.  *EDIT:  Done, I\\'ve uploaded several new pictures in the daytime outside, but with Necoco\\'s complexion it\\'s still a bit dark (it\\'s even worse without my ENB preset on!)*  Feel free to add your own images of your own lovely ladies doing battle or looking sexy in their skivvies!\r\n\r\nAgain, this is my first time modding so I apologize if there are any errors, but I haven\\'t personally found any in a week of using it.  If you find any problems please report them immediately, and I will do my best to figure it out and solve it.  \r\n\r\nThe normal map was saved at DXT5 compression (w/ alpha channel that is needed) and the texture/color-map at DXT1a (no alpha channel) so they should be pretty well optimized.  The original 2048x2048 file sizes were kept for both maps.\r\n\r\nThanks for your interest in Violetta Edition and I sincerely hope you enjoy it and your time in Skyrim! \\\\^_^/\r\n\r\n\r\n\r\nInstall:\r\nDownload anano\\'s Layer Bikini, from the following link, which provides three different versions including body mesh & texture replacers for both UNP and CBBE (i.e. the bikini takes the place of you ever being full nude when stripped).  Afterwards, install your previously chosen Layer Bikini version using your preferred method.  Once this is done install Violetta Edition by unzipping it into your main Skyrim folder (NOT in your data folder) and allowing all folder merges and file overwrites when prompted.\r\n\r\nAlternatively you can simply use the NMM by installing anano\\'s mod first, and then mine, allowing all requested overwrites (a total of two).\r\n\r\n*NOTE:  Don\\'t forget to activate anano\\'s ESP file in the launcher or NMM*\r\n\r\n>> anano\\'s Layer Bikini - UNP and CBBE: http://skyrim.nexusmods.com/downloads/file.php?id=7736\r\n\r\n\r\n\r\nUninstall:\r\nOverwrite Violetta Edition with anano\\'s original Layer Bikini files manually or deactivate Violetta Edition with NMM if you installed via it.\r\n\r\n\r\n\r\nConflicts:\r\nAnything added after Violetta Edition that modifies Layer Bikini\\'s texture and/or normal map will conflict.  Anything that modifies the body you are replacing (if using anano\\'s replacers) will overwrite Layer Bikini and render it unusable.\r\n\r\n\r\n\r\nCredits:\r\n* anano -  Anano-san no gensakuhin \\'Layer Bikini MOD\\' arigatou gozaimasu (watashi no romaji gomennasai)!\r\n   Creator of Layer Bikini and all of its awesomeness, and furnishing the PSD files  :D\r\n   http://skyrim.nexusmods.com/downloads/file.php?id=7736\r\n\r\n* Caliente - CBBE body\r\n   http://skyrim.nexusmods.com/downloads/file.php?id=2666 \r\n\r\n* dimon99 - UNP body\r\n   http://skyrim.nexusmods.com/downloads/file.php?id=6709\r\n\r\n* Necoco, my Redguard - for being my model >:D\r\n\r\n\r\n\r\nTools Used:\r\n* Photoshop CS5 \r\n* Wacom Intuos 3 tablet",
  "categoryId": "29",
  "version": "v1.0",
  "author": "GentaiShinigami",
  "createdUnix": "1332647377",
  "updatedUnix": "1332648896",
  "containsAdultContent": true,
  "uploadedBy": "gentaishinigami",
  "primaryFile": null,
  "files": [
    {
      "fileId": "46578",
      "name": "Layer Bikini - Violetta Edition v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1557",
      "fileName": "Layer Bikini - Violetta Edition v1-13636.7z",
      "uploadedUnix": "1332648896",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/624a932c5a65c947221adfda145210da071dc9d71f2da645423aae425abca50d/analysis/1406778199/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Layer%20Bikini%20-%20Violetta%20Edition%20v1-13636.7z?fid=46578&ttl=1535776591&ri=8192&rs=8192&setec=998847300efdd32e1a2d38aff1f8172c"
    }
  ]
}