{
  "modId": 13637.0,
  "modName": "Horse Whisper --- Horse Calling - Horse Locating - Horse Teleporting",
  "summary": "A Shout that allows the last ridden horse to be found and called, or teleported back to the player. No ScriptDragon Required!\r\nEither Places a Map Marker on your Last Ridden Horse and calls the horse to run to you or just calls your Horse to run to you with no map marker or other indications.",
  "descriptionHtml": "[CENTER][URL=http://skyrim.nexusmods.com/mods/19733][IMG]http://i.imgur.com/vrcxcB1.png[/IMG][/URL][/CENTER]\r\nspecial thanks to Hoth for the graphic, please check out his Immersive Armors mod!\r\n[CENTER][URL=http://skyrim.nexusmods.com/mods/23826][IMG]http://www.skyrimgems.com/images/gems_logo_600.png[/IMG][/URL][/CENTER]\r\nalso featured on G.E.M.S.  thank you Ka3m0n!\r\n\r\n\r\n[b]UPDATE 1-22-13[/b]\r\nUploading version of my \\\"improved\\\" Horse Whisper Shout.\r\nI am sick of sitting on it and if someone else enjoys it, I am happy. :)\r\n\r\n[b]The 3 Word Version *Requires* the Latest Skyrim Version (1.8.whatever)[/b]\r\n\r\n[b]The 3 Word version is a tracking only version for now[/b], if enough people want, I will make a \\\"non-tracking\\\" flavor as well.\r\n\r\nShould also be compatible with \\\"Horses for Followers\\\", UFO follower horse, and Convenient Horses (UFO/CH caveat:  this will only find one of them, if you have more than 1 riding follower I\\'m not sure what will happen, but you will get one of them, I\\'m workin on it.)\r\n\r\nThe Shout is now 3 words: 1st word marks your horse on map, 2nd calls your horse, 3rd word teleports your horse and your followers horse back to the player.\r\n\r\n[b]Install of 3 Word Version[/b]\r\nSimply overwrite the old one, when you use the shout again you should learn the other 2 words. The only real difference is the new teleportation effect, other than that it still works the same.\r\n\r\n[b]Uninstall[/b]\r\n--Remove Horse Whisper.esp from <SKYRIM>/Data directory\r\n--Remove EC__QF_SHOUTPlayersHorseLocatorFRAG.pex, EC_HorseFindScript.pex, EC_HorseLocatorSHOUTScript.pex, EC_HorseRetrieverSHOUTScript.pex, and EC_LastRiddenAliasScript.pex from <SKYRIM>/Data/Scripts directory\r\n--Remove EC__QF_SHOUTPlayersHorseLocatorFRAG.psc, EC_HorseFindScript.psc, EC_HorseLocatorSHOUTScript.psc, EC_HorseRetrieverSHOUTScript.psc, and EC_LastRiddenAliasScript.psc from <SKYRIM>/Data/Scripts/Source directory\r\n\r\nIf you are using the Whistling version then also remove <SKYRIM>/Data/Sound/fx/HorseWhisper directory\r\n\r\nI am fairly certain that once the 3 Word version is removed, one should be able to go back to the previous version without any issues.\r\n\r\n[b]One last caveat for all users[/b]\r\nBefore you can teleport both horses you must use the mark or call while the players horse is near the followers horse in the same cell or the followers horse will never get found.\r\nOnce this occurs the followers horse Reference is saved and can be teleported without having to mark or call again (unless, of course, the horses change, then you will have to mark or call again to get the new horses Ref.)\r\n(there are still some notifications present in the code to hopefully help with this)\r\n\r\nA big thanks to GhostWalker71 for helping me test this way back in May 2012! :)\r\n\r\nAnd as always, be careful with your saved games.\r\n[b]</EndUpdateAnnouncement>[/b]\r\n\r\nOk. First let me say I have never used the Horse Whistle Mod, I knew it existed but I had never used it.\r\nI created some custom horses for some other personal mod I made and I wished I had a way to track them. I had those horses set as Cowardly, but really, they seemed to run away too much and too far, and I got sick of looking for them. The Vanilla Horses do the same thing.\r\n\r\nSo learned how to create a quest and a spell that kept track of the custom horses\\' location and would give me a map marker to go and find her.\r\n\r\nI thought, \\\"hmmm I wonder if I could just fill the alias on this quest with the value of \\\"Game.GetPlayersLastRiddenHorse\\\"?\\\" (thanks to Nexus members TunaIsAFish and DangerManzo for helping me figure that one out! :D )\r\nIf I could do that, then I could show ANY player where their last horse was. After a couple of days of fiddling with scripts I have a working implementation of that concept, and it\\'s actually quite polished.\r\n---------------------\r\nThen I remembered \\\"Horse Whistle\\\" again, so I went and looked at it\\'s page on the Nexus here, Since I don\\'t want to release something someone else already made, I wanted to check it out...\r\nI did get the idea of having the horse path back to you (at running speed though) by looking at the description of the Horse Whistle mod... credit where credit is due. Thanks for the idea! :)\r\n\r\nI found some issues with that particular mod, not that they were bad issue, they were just mine.\r\n1. I wasn\\'t about to install script dragon to use it or to see what it actually did.\r\n2. In this mod the horses actually start running when you call them (if your using that flavor of the mod) and/or you get a map marker.\r\n\r\nSo here it is, another way of doing the same thing, that DOES NOT, I repeat, does not, require script dragon in any way.\r\n---------------------\r\nHere is how it works:\r\n\r\nWhen you load this mod you will learn a new Word of Power, Daal, Return.\r\n\r\nWith that new word you can either Track and Call your Last Ridden Horse, or Just Call it with no Map Marker, Depending on which flavor of the mod you are using.\r\nIf you are using the Call flavor, then when you shout it sets your Last Ridden Horse to an Alias on a quest, then sets that as the Objective on the Quest the Horse will \tstart running, yes RUNNING to the player.\r\nWith Tracking the same thing happens, only you can see where the horse is at the same time. If you keep checking your map you can actually see them moving. (and get stuck, stupid AI)\r\n(this can take a while. the AI pathing is crap, we all have found that out, but it will work, from seemingly ANYWHERE on the map (I have tested this))\r\n\r\nThe Quest that tracks all this is a Miscellaneous Quest, and it WILL NOT show up in your quest log until you actually shout. I tried to make this as unobtrusive as possible.\r\nThis also has the advantage of not filling up your quest log with a bunch of \\\"Where\\'s my Horse?\\\" entries if you happen to use it a lot. (also if you never track a horse because you never owned one you will not be bothered by it)\r\n\r\nI do not like having extra junk in my quest logs.\r\n\r\nBut you WILL have to manually check the Miscellaneous Quests in your Journal to have the marker actually show up. I figured this was a decent compromise.\r\n\r\nOnce you shout then you\\'ll get a new objective in the misc category, and the horse will start running towards you (if your using that flavor)\r\n\r\nWhen/If you ride this same horse again, the objective completes, removing the marker and the quest.\r\nThey will run right up to you, though it might take a while, you should be able to just \\\"activate and ride\\\" (tm) :)\r\nGreat for us packrats!\r\n(there is a kind of neat \\\"side effect\\\" to how I made it work, you can sort of \\\"herd\\\" horses, one at a time one always runs away at the end, but it\\'s still sort of fun. :) )\r\n\r\nShout again and it will work again, even if you changed horses or your horse died on her \\\"quest\\\" to find you (if that happens, well, your going to have to get a new one. I\\'m working on a way to find the last one you bought, if it is different than the last ridden.)\r\n\r\nThis unfortunately will not work with Stolen Horses, they don\\'t seem to count. I had visions of a sneaky player who stole a horse for a \\\"job\\\", riding up to some location, jumping off, running inside a building, doing whatever nefarious thing it was they went there to do, then calling their horse back so they could jump back on right outside... It just doesn\\'t seem to work that way... ah well... maybe I\\'ll figure it out, maybe not. :)\r\n\r\n----------------------\r\n\r\n[color=red][B]PLEASE DO NOT DOWNLOAD THE SPELL VERSION OF THIS MOD[/B][/color]\r\n[B]It (and all or most mods that add new spells) will cause your game to crash from the menu screen, [color=red] IF YOU REMOVE IT.[/color]\r\nBasically, once you have the spell version of this mod, your stuck with it, unless you start anew without it.[/B]\r\n\r\n[color=green][B]THE SHOUT VERSION DOES NOT HAVE THIS PROBLEM[/B][/color]\r\n\r\n[B]For those already using the spell version[/B]\r\nI have removed the Spell versions of this, except for one, please use this if you need to reinstall it in order to \\\"fix\\\" this issue.\r\n\r\nI am sorry, I had no knowledge of this bug (which it seems is in the GAME not in all these new spell mods) or I would have never uploaded it.\r\n\r\n---------------------\r\n\r\nThere will be a Non Calling \\\"Locator\\\" version of the Shout that only tracks location, for the one person who said they were using the Horse Locator. I only want to wait to see if there any other issues posted for a day or so.\r\n\r\nThat was all I originally wanted to do, was get a dang marker on my last horse so I could figure out where the stupid thing went!\r\n\r\n---------------------\r\n\r\n\r\n[b]INSTALL[/b]\r\n---------\r\nPick one \\\"flavor\\\" (tracking or not)\r\ncopy all files to \\\"Data\\\" folder\r\n\r\n[color=red]do not download the spell version[/color], it is only there for people who were previously using it, who may need it to recover from the crashing issue caused by removing custom spells from the game.\r\nAgain, the shout version does NOT have this problem at all.\r\n\r\n[b]UNINSTALL[/b]\r\n---------\r\nRemove the files from \\\"Data\\\" folder\r\n\r\n[b]Compatibility[/b]\r\n---------\r\nShould work with ANY other horse mods, all we are tracking here is Players Last Ridden Horse, only stolen horses it seems to not count towards this.\r\nSo you can actually call your War Horse to come help in battle if you need it.\r\n\r\n[b]Restrictions[/b]\r\n--------\r\nDO NOT, I repeat, DO NOT upload this to steam, if Bethesda couldn\\'t figure out how to do this on their own then too bad!\r\nOther than that, feel free to use it, just give credit where credit is due, this took me a while to figure out and get perfected to this point.\r\n\r\n[b]Future Updates[/b]\r\n---------\r\nA Shout Version <--- Done! 3.25.2012\r\n\r\nThese may take a while, but I\\'m still thinking about them...\r\n(possibly) an \\\"Item\\\" version (think of a special flute you have to play or something like that)\r\n(possibly) a way to call another \\\"owned\\\" horse if it is different from the last ridden horse (or you just want a different horse)\r\n\r\n[b]Standard Disclaimer[/b]\r\n------------\r\nThis all works great on my machine, it likely will not on yours.",
  "categoryId": "24",
  "version": "2.5",
  "author": "ride",
  "createdUnix": "1332647399",
  "updatedUnix": "1359057460",
  "containsAdultContent": false,
  "uploadedBy": "r1de",
  "primaryFile": null,
  "files": [
    {
      "fileId": "46575",
      "name": "Horse Wrangle 1_0",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "4",
      "fileName": "Horse Wrangle 1_0-13637.7z",
      "uploadedUnix": "1332647508",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/81951b3d08b5c3b9995e922fdd97853338f02d05e1f560c41a77a0c74fcd5744/analysis/1406778198/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Horse%20Wrangle%201_0-13637.7z?fid=46575&ttl=1535776592&ri=8192&rs=8192&setec=1c05c18552a6b948ac2f2f5e3068dba1"
    },
    {
      "fileId": "46859",
      "name": "Horse Whisper - 1 Word Shout - With Call - With Tracking",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Horse Whisper - Shout - With Call - With Tracking-13637.7z",
      "uploadedUnix": "1332714513",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/731cd2d2a1807da5a91320252a85446acd733b6bb7312087d43d75fabedff6f7/analysis/1406779970/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Horse%20Whisper%20-%20Shout%20-%20With%20Call%20-%20With%20Tracking-13637.7z?fid=46859&ttl=1535776593&ri=8192&rs=8192&setec=40c0ac84fc14e29372445dbed3c10fb9"
    },
    {
      "fileId": "46860",
      "name": "Horse Whisper - 1 Word Shout - With Call - No Tracking",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Horse Whisper - Shout - With Call - No Tracking-13637.7z",
      "uploadedUnix": "1332714571",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bec4d7aa242d106144f3c8bbc3107233734d1abc46aac45b2abba81c190f3d8b/analysis/1406779971/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Horse%20Whisper%20-%20Shout%20-%20With%20Call%20-%20No%20Tracking-13637.7z?fid=46860&ttl=1535776593&ri=8192&rs=8192&setec=82b28a18be23059cb4c444f064b42520"
    },
    {
      "fileId": "47419",
      "name": "Horse Whisper -- 1 Word Shout - No Call - With Tracking",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Horse Whisper -- Shout - No Call - With Tracking-13637.7z",
      "uploadedUnix": "1332873185",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e07aedd8db51e63ae712ee3d0e66ada252e73e46f514f8fdcbeb9e1685e8ef75/analysis/1406783121/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Horse%20Whisper%20--%20Shout%20-%20No%20Call%20-%20With%20Tracking-13637.7z?fid=47419&ttl=1535776594&ri=8192&rs=8192&setec=6c290a210f8e16820ccb0d54acde022e"
    },
    {
      "fileId": "1000004273",
      "name": "Horse Whisper - 3 Word Shout --- No Whistle",
      "version": "2.50",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Horse Whisper - 3 Word Shout --- TEST-13637-2-50.7z",
      "uploadedUnix": "1358908070",
      "modVersion": "2.50",
      "virusScanUrl": "https://www.virustotal.com/file/0b62a59a81b63126444ca2e443e123d686f69f7e0b507cbfc8e034b968c6154d/analysis/1407374247/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Horse%20Whisper%20-%203%20Word%20Shout%20---%20TEST-13637-2-50.7z?fid=1000004273&ttl=1535776594&ri=8192&rs=8192&setec=05c54de1d083fbb575dd1534bafdaeec"
    },
    {
      "fileId": "1000004625",
      "name": "Horse Whisper - 3 Word Shout --- With Whistle",
      "version": "2.50",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "111",
      "fileName": "Horse Whisper - 3 Word Shout --- With Whistle-13637-2-50.7z",
      "uploadedUnix": "1359057460",
      "modVersion": "2.50",
      "virusScanUrl": "https://www.virustotal.com/file/7b9919715a61b401cffa54d03f820fd4bb21fe93f93bacce3660fff349ed548c/analysis/1407376925/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Horse%20Whisper%20-%203%20Word%20Shout%20---%20With%20Whistle-13637-2-50.7z?fid=1000004625&ttl=1535776595&ri=8192&rs=8192&setec=10ba45bd12c2b7335acde47861628b3f"
    }
  ]
}