{
  "modId": 13653.0,
  "modName": "FCSkriptures",
  "summary": "A small, simple mod adding a book containing console commands for in-game use.",
  "descriptionHtml": "This is a small, simple mod that adds a book to the counter top of the Riverwood Trader store. This book contains console commands that can be used during the game. This isn\\'t meant to be a complete list of all commands out there, just a few that I found handy during gaming. I made this mod because I was tired of scattered notes on my desk, and even more tired of having to step out of the game to look up a command on the net. With this mod, you can open the book to the page containing the command you need, and when you open the command console you can still see the open book with the command right there, so you can type it in as you see it. How handy is that? =)\r\n\r\nPart one of the book contains commands that I found useful, such as summoning lost followers back to my side, allowing followers to progress past built in level caps so they would be useful throught the game, and commands for helping with bugged quest items stuck in my inventory.\r\n\r\nPart two of the book contains commands that I thought people would be sure to ask for after I posted this mod. This part contains commands for things such as free gold, free items, and god mode.\r\n\r\nEnjoy!",
  "categoryId": "28",
  "version": "",
  "author": "FattCatt",
  "createdUnix": "1332674482",
  "updatedUnix": "1332675455",
  "containsAdultContent": false,
  "uploadedBy": "FattCatt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "46663",
      "name": "FCSkriptures",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "FCSkriptures-13653-1.zip",
      "uploadedUnix": "1332675455",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/aed5a3ed0cbd91594e90bf52b4b2eaf62bda23dd35d93d0d910c8a6868ec7d17/analysis/1406778628/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FCSkriptures-13653-1.zip?fid=46663&ttl=1535776627&ri=8192&rs=8192&setec=cf7d28481145b61afc299886673721e1"
    }
  ]
}