{
  "modId": 13694.0,
  "modName": "Improved Rahgot Mask",
  "summary": "Improves and creates a unique enchant for the Rahgot Dragon Priest Mask, to make it worthy of being called an artifact.",
  "descriptionHtml": "SE Note: I will likely replicate this mod once the new CK is out.\r<br />\r<br />tl;dr: This is a mod I made for myself primarily, to provide Heavy Armor characters with a mask worth a damn. And the vanilla Rahgot mask was just laughable. This is intended to be a fair and balanced mod. Comments/suggestions are welcome. Endorse if you like it&#33; :)\r<br />\r<br />Compatible with or without Dawnguard; this mod makes no exclusive changes.\r<br />\r<br />===========\r<br />Description\r<br />===========\r<br />The Rahgot Dragon Priest Mask uses a basic Fortify Stamina enchant, which can be done by any Joe Schmoe at an Enchanter&#39;s Station. In fact, it could very well be done BETTER by a decent enchanter. Since all of the Dragon Priest Masks are artifacts with unique properties unavailable to the player character, using either unenchantable bonuses or 3 enchants on one item, this mod brings the Rahgot mask in line with its counterparts.\r<br />\r<br />========\r<br />Changes\r<br />========\r<br />Vanilla: Increases your stamina by 70 points.\r<br />\r<br />This Mod: Stamina regenerates 50% faster, and time between shouts is reduced by 20%.\r<br />\r<br />============\r<br />Compatibility\r<br />============\r<br />Anything that edits the Rahgot mask, ArmorDragonPriestMaskOrichalumHelmet, will not work with this mod.\r<br />\r<br />==========\r<br />Installation\r<br />==========\r<br />Install: Use NexusModManager, or drag the .ESP file into your data folder, and activate through the launcher.\r<br />\r<br />Uninstall: Deactivate/Delete the .ESP file.\r<br />\r<br />=========\r<br />Reasoning\r<br />=========\r<br />Why 50% Stamina Rate? Because there are very few things that do this, and 50% is the highest number you will find on pre-enchanted items. Fortifying stamina is a common enchant. Fortifying the regen rate is rare.\r<br />\r<br />Why 20% Reduced Shout Cooldown? The Morokei mask enchant provides 100% Magicka Regen, and 20% reduced shout cooldown. This gives melee characters an option to obtain a Fortify Shout buff in a Heavy Armor version. Finally, Fortify Shouts is an enchant unavailable to enchanters, putting the mask on par with the other masks (as noted above).",
  "categoryId": "54",
  "version": "1.0",
  "author": "szn",
  "createdUnix": "1332706334",
  "updatedUnix": "1332706567",
  "containsAdultContent": false,
  "uploadedBy": "szn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "46811",
      "name": "ImprovedRahgotMask_1-0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "ImprovedRahgotMask_1-0-13694-1-0.rar",
      "uploadedUnix": "1332706567",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/740743788fdaf9b105b57ff40208d2cea48d4facf7c79fbb5590708a40812a94/analysis/1406779588/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ImprovedRahgotMask_1-0-13694-1-0.rar?fid=46811&ttl=1535776696&ri=8192&rs=8192&setec=a8a9b6816a585866e2359457d75c3f29"
    }
  ]
}