{
  "modId": 1369.0,
  "modName": "FXAA Profiles Manager",
  "summary": "Manages multiple FXAA profiles, keeping track of various d3d9.dll, injFX_Settings.h and shaders.fx. Allows easy restoration of previous settings. Can manage multiple different versions of the Injector. Now includes my own settings for you all to laugh at.",
  "descriptionHtml": "How-to:\r\n\r\n[youtube]4nScEtQ4drM[/youtube]\r\n\r\nFXAA Manager version 4\r\n======================\r\nby OfftheRails\r\n\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=1369\r\n\r\nWith dozens of FXAA Injector profiles uploaded on Skyrim Nexus, picking the right one can be a pain. Changing your mind, even more so. They all require different versions of the FXAA Injector mod, they\\'re all incompatible with each other\\'s settings files, and if you combine two files from different mods then your game will crash to desktop.\r\n\r\n>>What\\'s an FXAA Injector?\r\n\r\nThe short version: Full Screen Approximate Anti-Aliasing Dynamic Link Library Injection.\r\n\r\nThe long version: A collection of files that you copy to your Skyrim folder that prettify your game. You can get sharper textures, better curves, more vibrant colours and shinier shinies. You can also get some pretty mad effects, such as: http://youtu.be/rZ-F4adpc9M\r\n\r\n>>What\\'s this file for?\r\n\r\nIt manages your FXAA profiles. You create a folder for each profile you want to use, then let the script copy the files back and forth.\r\n\r\n>>OK, so what do I have to do?\r\n\r\nFirst, find your Skyrim folder. Probably ...steamapps\\\\common\\\\skyrim\\\\. Got that? Now create a new folder in here*. Call it \\\"FXAA profiles\\\" or something similarly wacky and inventive. Unzip the archive into that folder, so you\\'ve got this readme, the FXAA Manager.ini file and the FXAA Manager.exe (or .ahk) file in ...\\\\common\\\\skyrim\\\\FXAA profiles\\\\. Now, open up the FXAA Manager.ini file in notepad and put your Skyrim folder\\'s location in there. I keep mine in C:\\\\Games\\\\Steam; yours is probably different. Delete my info and replace it with yours.\r\n\r\n*NB you can actually put the profiles folder anywhere you please; just make sure you put the correct path in the ini.\r\n\r\nI\\'ve supplied my own profile to get you started. It\\'s a heavily stylised effect with the saturation bumped waaaay up. This is because I have a very anaemic monitor (Samsung Syncmaster) and I\\'m used to playing on a much more intense TV. If you\\'ve got decent equipment, my preset will probably look like crap - but at least it\\'ll look different from vanilla, leaving you in no doubt that the injector\\'s at least working. What are you still reading this crap for? Go forth and find yourself some profiles! These come in two types:\r\n\r\nType 1 - Ready-to-go\r\nHave a look at http://www.skyrimnexus.com/downloads/file.php?id=131. This is Some_Dude\\'s set of 4 profiles; it\\'s massively popular, and a great way to improve your game. You want the \\\"manual install\\\" version. Download that, save the file to your hard drive, and look inside the archive. You\\'ll see four folders and a readme.txt. Extract all four folders (as well as the readme if you want) into the FXAA profiles folder you created earlier. Now run the Manager, and choose which one you want to use.\r\n\r\nType 2 - Not ready-to-go\r\nNow go to http://www.skyrimnexus.com/downloads/file.php?id=420. This is joey4track\\'s Skyrim Graphic Novel presets. Check the info. Joey\\'s settings require a very specific version of the FXAA injector, which isn\\'t included in his download. Not to worry! Here\\'s what you need to do:\r\n\r\n*Download the files anyway, and extract the folders into the FXAA profiles folder.\r\n*Follow the link provided and download the correct version of the FXAA injector.\r\n*Copy all the files and folders in the injector package into each of the profile folders. You\\'re creating four complete copies of the mod, in effect.\r\n*Run the Manager!\r\n\r\nThose two each contain multiple seperate profiles, sorted into folders. Most of the downloads on the nexus have only a single profile - this must be extracted into its own folder, and then combined with the correct version of the injector, just as you did for each of joey\\'s 4 profiles.\r\n\r\nIf you\\'re using the ENBSeries patch fix (that includes its own d3d9.dll), it will require that you rename FXAA profiles\\' d3d9.dll files to something else. Do so for each FXAA profile you use, and use the Manager to move them back and forth. Just make sure you fill in the replacement filename (probably other_d3d9.dll) in FXAA Manager.ini.\r\n\r\n>>What\\'s this \\\"!Backup\\\" folder all about?\r\nWhen FXAA Manager is first run, it places any files it overwrites into the !Backup folder. That means that if you\\'ve got an FXAA profile active when you first use the Manager, you can always get it back - just use the Manager to select the !Backup folder and your old setting will be restored. Or, manually move the contents of the !Backup folder. You can replace the backups at any time; either by manually copying from the Skyrim folder, or by running FXAA Manager with the line \\\"FirstRun=1\\\" (no quotes) in the [FXAA Manager] section of FXAA Manager.ini\r\n\r\nIf you rename the !Backup folder, you\\'re effectively creating a new profile. So you can edit other people\\'s injFX_Settings.h files to your taste, then save the profile as your own.",
  "categoryId": "62",
  "version": "4",
  "author": "Off the Rails",
  "createdUnix": "1322170117",
  "updatedUnix": "1323113396",
  "containsAdultContent": false,
  "uploadedBy": "Offtherails",
  "primaryFile": null,
  "files": [
    {
      "fileId": "3588",
      "name": "Version 2",
      "version": "2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "778",
      "fileName": "Version 2-1369.7z",
      "uploadedUnix": "1322170914",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/ab87f40e9241e5631bf375ddd32e6e6c8fcecf85dd508db05d756326ef01c9f7/analysis/1406443450/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%202-1369.7z?fid=3588&ttl=1535754904&ri=8192&rs=8192&setec=97979f018bba68748284758a485aa596"
    },
    {
      "fileId": "3678",
      "name": "Version 3",
      "version": "3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "952",
      "fileName": "Version 3-1369.7z",
      "uploadedUnix": "1322185623",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/4f0486e6f968c463fefcbfa7796b2a6843a46c6c249f923e2f622911ef678bd6/analysis/1406444465/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%203-1369.7z?fid=3678&ttl=1535754904&ri=8192&rs=8192&setec=703a3a28e270f4310af8be89793d0231"
    },
    {
      "fileId": "3682",
      "name": "My own preset",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "My own preset-1369.7z",
      "uploadedUnix": "1322185809",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/399a8dc1c362cf3134e3f85c0c3b2542f9a829360a91231057e68406bdc2cd84/analysis/1406444522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/My%20own%20preset-1369.7z?fid=3682&ttl=1535754905&ri=8192&rs=8192&setec=918a55314880ae21bd97908e73ecac50"
    },
    {
      "fileId": "7356",
      "name": "Version 4",
      "version": "4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "952",
      "fileName": "Version 4-1369-4.7z",
      "uploadedUnix": "1323113396",
      "modVersion": "4",
      "virusScanUrl": "https://www.virustotal.com/file/66f844006b396e90aa2d391ea78435392d1530cb9b294dbce30ec3e7b31188df/analysis/1406483043/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%204-1369-4.7z?fid=7356&ttl=1535754906&ri=8192&rs=8192&setec=2079b2a230cb0cbd6d3b03650f2906aa"
    }
  ]
}