{
  "modId": 13707.0,
  "modName": "Lisette - More dialogue and such",
  "summary": "Companion mod to include more dialogue and personality to Lisette",
  "descriptionHtml": "This isnt the first Lisette mod I know but I just decided to upload my take in it. I\\'ve been a fan of Emma\\'s Vilja mod for Oblivion and hence a bit disappointed by the lack of dialogue in companions. At least Mjoll actually has idle one-liners too but other companions, rather bland, especially those not meant to be companions (such as Lisette). This mod seeks to change that for Lisette, and also to ask for help from the community.\r\n\r\nUPDATE\r\nForgot to upload the dialogue scripts, sorry! It\\'s included in the files section now, let me know if there\\'s anymore problems with her joining\r\n\r\nUPDATE 0.55\r\nI\\'ve managed to add a basic voiced introductory dialogue to Lisette so you can talk with her and \\'convince\\' her to join you. I managed to get it working heh\r\n\r\n0.55 FEATURES:\r\n- Basic Introduction Dialogue (10 more lines of dialogue)\r\n- Fixed bugged intro, now fully functional, a bit of polish\r\n\r\n0.4 FEATURES:\r\n- Lisette made companionable / custom class / custom fighting style allowing dual wielding (not tested, just checked the \\'box\\' in CK) / she wears clothes so you can outfit her anyway you want / marriagable / essential / etc and all the other essential companion features\r\n- Added 54 lines of voiced dialogue that fits her bard personality, though this mod does also make her into a bit of a warrior/bard (the voices are from the soundset in the BSA - theres a ton!)\r\n- Includes idle random one-liner chats when adventuring - from humming tunes to random comments to flesh out her personality a bit more.\r\n- Includes a new topic, and you can ask her for rumors around Skyrim and advice about adventuring (which is just for roleplaying reasons). It also includes a sing-anywhere function which is broken :( - and I\\'m trying to find out how to fix it\r\n\r\nCURRENT KNOWN BUGS (Please help!)\r\n- Singing dialogue/triggers is not working outside Winking Skeever\r\n- She still annoying has the old bug of whipping out her flute on random occasions, I\\'ve checked idle animations, ai packages, the bard scripts, I still don\\'t get it, it\\'s currently unfixable unless someone helps me find out what actually triggers bards to play flutes (the triggers I found all have the CurrentFollowerFaction condition != 1 so theoritically Lisette should NOT be playing her flute when she\\'s travelling too, making it very confusing)\r\nWorkaround: I have found a workaround by disabling her and respawning her using the placeatme command on the console, however that seems to make her normal non-companion routine a bit wobbly (but she still manages to go home to the Winking Skeever and be collected later and still be able to sing)\r\n\r\nPLANNED FEATURES IN THE FUTURE (After solving those bugs):\r\n- More dialogue\r\n- Short radiant quest to add her as a companion\r\n- Asking her for possible jobs/contracts in the area\r\n- Scripts to trigger more dialogue options rather than random one-liners\r\n- Old companion feature from Vilja by Emma to let the companion led you places\r\n- Option to change combat styles (1H or Dual/2H/Magic)\r\n\r\n-----------\r\n\r\nINSTALLATION / HOW TO PLAY\r\n\r\n- Make sure you download both the script file and the main file\r\n- Extract the main file to your skyrim folder\r\n- Extract the script file to your skyrim/data folder\r\n- Find Lisette in the Winking Skeever, and talk to her ;)\r\n\r\nNOTE : If updating, you may want to remove the old Sound\\\\Voice\\\\LisetteCKmod.esp\\\\ folder and replace it with the one in the 0.55 version (as it will have some unneeded files there). This is because I had to redo the introductory dialogue and move them to a new quest to get the script working (hence the sound files for the introductory dialogue now have new file names). \r\nIt\\'s not essential, but it\\'s just a suggestion for those who like their Skyrim folders neat and tidy with only what they need.\r\n\r\n-----------\r\n\r\nCREDITS\r\n\r\nBethesda\r\nSkyrim Nexus\r\nThe Modding Community that has been great since Morrowind\r\n\r\n-------------\r\n\r\nNOTES - UPDATE ON MOD PROGRESS\r\nI\\'m going to have to take a break on this mod until someone helps me find a way to solve the current bugs, as I\\'ve come to realise that I can not do this without help. For now the mod is fully playable but with the standard Lisette-bugs (which are really just annoyances), I may however from time to time just add in new features such as new dialogue depending on how frustrating her seemingly-hardcoded random-flute-playing gets.\r\n\r\nPlease message me if you have a solution or a suggestion to the current obstacles - especially the random-flute playing, I\\'ve looked into NPC properties, bard scripts, ai packages, even her cell markers at the winking skeever. I also test the flute playing bug by fast travelling, which she will pull out her flute whenever you do so.\r\n\r\nI have found a workaround by disabling her and respawning her using the placeatme command, however that seems to make her normal non-companion routine a bit wobbly (but she still manages to go home to the Winking Skeever and be collected later and still be able to sing)",
  "categoryId": "66",
  "version": "0.55",
  "author": "Jackal2233",
  "createdUnix": "1332715565",
  "updatedUnix": "1333373441",
  "containsAdultContent": false,
  "uploadedBy": "Jackal2233",
  "primaryFile": null,
  "files": [
    {
      "fileId": "46869",
      "name": "LisetteDialogueModV0-4",
      "version": "0.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18783",
      "fileName": "LisetteDialogueModV0-4-13707.7z",
      "uploadedUnix": "1332716255",
      "modVersion": "0.4",
      "virusScanUrl": "https://www.virustotal.com/file/31cb8cd2af1402e5e5f855cc6d79d9f3e0c752001c4f9e9084e876d2d13f77cd/analysis/1406780053/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LisetteDialogueModV0-4-13707.7z?fid=46869&ttl=1535776716&ri=8192&rs=8192&setec=a5e8105968b946459f9e13d440513954"
    },
    {
      "fileId": "47024",
      "name": "Lisette Dialogue Mod V0-5",
      "version": "0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20127",
      "fileName": "Lisette Dialogue Mod V0-5-13707.7z",
      "uploadedUnix": "1332765965",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/b6de018f83260b0c07440e961a9e37c4a0b0c27b937363458bbba6e831132e5e/analysis/1406780958/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lisette%20Dialogue%20Mod%20V0-5-13707.7z?fid=47024&ttl=1535776716&ri=8192&rs=8192&setec=900bf6187dd82a381f035c5a4a5eb752"
    },
    {
      "fileId": "47046",
      "name": "Lisette Update 0-55 BETA",
      "version": "0.55",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20127",
      "fileName": "Lisette Update 0-55 BETA-13707.7z",
      "uploadedUnix": "1332771674",
      "modVersion": "0.55",
      "virusScanUrl": "https://www.virustotal.com/file/55952875a5510e04287583b24c99442705529d9ba6646eb86ac73701c14fcc31/analysis/1406781026/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lisette%20Update%200-55%20BETA-13707.7z?fid=47046&ttl=1535776717&ri=8192&rs=8192&setec=4121f938612c2b2cee33aa22587599fa"
    },
    {
      "fileId": "49335",
      "name": "Scripts-Must Download",
      "version": "0.55",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Scripts-Must Download-13707-0-55.7z",
      "uploadedUnix": "1333373441",
      "modVersion": "0.55",
      "virusScanUrl": "https://www.virustotal.com/file/5904220fed8a739a0d8a74012589a0f7907c485397c7a850a9f8522881462652/analysis/1406793389/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Scripts-Must%20Download-13707-0-55.7z?fid=49335&ttl=1535776717&ri=8192&rs=8192&setec=8c3fcd9b8549f93f446ba327e5f6aedc"
    }
  ]
}