{
  "modId": 13767.0,
  "modName": "JeffreyLanes Npcs",
  "summary": "Currently adds 12 npc\\'s to the game. 8 merchants and 4 high lvl challange encounter.",
  "descriptionHtml": "Welcome to my first mod ever!\r\n\r\nDiscription: One thing that always bugged me during my times in the Elderscrolls games, was there was never a merchant that could buy as much as i could sell. now i\\'ve used the Rich merchant mod and another one i cant recall it\\'s name atm.. but they made it way to easy to make gold. i could sell to all the vendors in Whiterun and walk away with 100k easy in no time. So what i have done is add 1 npc vendor in each of the walled towns that has between 20 and 30 thousand gold. their are also 3 other vendors added to smaller inns, but they dont have the gold the first 5 do. instead they sell specific things, as i will list below.\r\n\r\nAdded Npcs: location: item stock\r\n\r\nMegiddo - Bannered Mare in Whiterun - Blacksmith stock\r\nVitas - Bee and Barb in Riften - clothing stock\r\nScrewed - Candlehearth hall in Windhelm - Blacksmith stock (she is short, ya might miss her)\r\nLightborn - Winking Skeever in Solitude - food stock\r\nMegidola - Understone keep in Markath - blacksmith stock (is near the blacksmith)\r\n\r\nalso adds \r\n\r\nEveryone - Sleeping Giant inn in Riverwood - sells potions (removing armor set, was ment for low lvls but they cant buy it)\r\nScott Alan - whatever the inn at Rorikstead is called - sells 2 very OP items that cost alot\r\nMegid - inn at Dragonbridge - plants and stuff\r\n\r\nnow at this time, none of them have any conversation topics other then to buy stuff nor do they have coustom voices. those will be coming later after i get all the npc\\'s i want into the game.\r\n\r\nand then we have the challenge npcs... \r\n\r\nNpc 1:Jeffrey lane.\r\n\r\n he is located somewhere near the early parts of the game, but is by no means for the early adventurer. his gear make look humble, but try him.. you may not like what he doeswith them.\r\n\r\nNpc 2: Zetsuei\r\n\r\nyou can find him locked in a cell of some old keep. he wouldnt mind the imprisionment if he had something good to read.\r\n\r\nNpc 3: Hunter Scott\r\n\r\nnear some Dwemer ruins somewhere.. patiantly waiting for his faithful pet to return to him.\r\n\r\nNpc 4: Mskitka\r\n\r\na fiesty lady that was abandoned somewhere by her fellow travelers.. which has left this cats fur in a bind.. she\\'s really mad. she would go after them, but they went south and there is so much water below her cliff.\r\n\r\nNpc 5: Alayian\r\n\r\npoor old elf archer, got lost near the coast and it\\'s so cold. if only his pet, Zero, was still around.\r\n\r\nNpc 6: Zero\r\n\r\nAlayian\\'s lost pet sabrecat. if found please bring him back. last seen chasing some giant.\r\n\r\nEach challenge Npc drops a JeffreyLane\\'s Trophy (as of version 2) they are there jsut to show that you have killed a number of my npcs.\r\n\r\n\r\nInstall just as you would any other mod into the data folder where ever your game is installed. make sure it\\'s enabled and such in the launcher.\r\n\r\nshould have 0 conflicts with any other mods unless they mod the same spots where my npc\\'s are placed. i know nither me or my friend, Scott alan, have had any conflicts so far.\r\n\r\n\r\nAnd before anyone might ask.. each npc is named both after me and my friend, and the others are all named after the characters we played in World of Warcraft. the account maybe inactive, but you maybe able to look them up if you would like, all are on the Llane server aside from Screwed, she is on the Thrall server and her name was changed to Megid. Any forthcoming npc will also follow this naming scheme.. or possibly be named after other people i have played that game with over the years.",
  "categoryId": "33",
  "version": "3",
  "author": "JeffreyLane",
  "createdUnix": "1332789545",
  "updatedUnix": "1332880490",
  "containsAdultContent": false,
  "uploadedBy": "Jeffreylane",
  "primaryFile": null,
  "files": [
    {
      "fileId": "47130",
      "name": "MegMerch",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "MegMerch-13767.7z",
      "uploadedUnix": "1332789727",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/d5cf513bbb4d66832285053482c7d1db19b22e1fc3735806d8ea99f7767b601c/analysis/1406781554/",
      "changelogHtml": " adds 7 new merchants to the game <br/> \n adds 1 high lvl npc to fight in the world <br/> \n adds a few custom items, no new textures or anything tho. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MegMerch-13767.7z?fid=47130&ttl=1535776876&ri=8192&rs=8192&setec=b8c50a667232fab0265db01045c15020"
    },
    {
      "fileId": "47248",
      "name": "MegMerch 2",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21",
      "fileName": "MegMerch 2-13767.7z",
      "uploadedUnix": "1332819729",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/86ebf6e4e34d8e4899c6b068aa89ecb1d7c125d55c9b79bbc7b2374426c88e23/analysis/1406782264/",
      "changelogHtml": " added 1 new merchant to Dragonbridge inn <br/> \n added 3 new challenge npcs to the world <br/> \n added a trophy to each npc for pure collection purpose <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MegMerch%202-13767.7z?fid=47248&ttl=1535776876&ri=8192&rs=8192&setec=84922e82821c086a13a6f6983d87b433"
    },
    {
      "fileId": "47450",
      "name": "MegMerch 3",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25",
      "fileName": "MegMerch 3-13767-3.7z",
      "uploadedUnix": "1332880490",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/8bbb3f7e8e3cfdc7e412a6b92b93c9d78900517c5498d87b38475c3f309163d7/analysis/1406783236/",
      "changelogHtml": " adds 2 more challenge npcs Alayian and Zero <br/> \n changes to perks on most npcs <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MegMerch%203-13767-3.7z?fid=47450&ttl=1535776877&ri=8192&rs=8192&setec=9b8bae9be7fa31ae5b70936ef0cf27a7"
    }
  ]
}