{
  "modId": 13762.0,
  "modName": "Diverse Female Housecarls",
  "summary": "Five attractive housecarls. Five races. Five combat styles. Your houses are unique. Shouldn\\'t your housecarls be also? Each is optional and lore friendly. Updated to v1.1. UFO compatible.",
  "descriptionHtml": "[img] http://skyrim.nexusmods.com/mods/images/13762-1-1379950888.jpg[/img]\r\nDiverse Female Housecarls\r\nVersion 1.1\r\nBy c_striker\r\n\r\nPlease read this entire file as it may save you questions and/or headaches!\r\nNote that ApachiiSkyHair is required for this mod (see details below).\r\nNote this mod is compatible with UFO, just make sure you put it after UFO in the load order (see Conflicts section below).\r\n\r\nThanks for the comments and endorsements! Please feel free to upload pics (I love seeing these girls in action)!\r\n\r\n[color=orange]CHANGE LOG[/color]\r\n===========\r\nv1.0 - Initial Release. Excluded certain eye and lip makeups due to CK bug.\r\nv1.1 - Updated to include full eye and lip makeup using custom tintmasks, plus addition of alternative Sariina (optional files). Also updated this description to include some additional information (see Important Notes and Details).\r\n\r\n[color=orange]DESCRIPTION[/color]\r\n===========\r\nThe purpose of this mod is to provide a richer, more diverse selection of housecarl followers. Each has a unique blend of skills, perks and combat style, and each is optional. You can choose to load any or all to your game. None have a default outfit, meaning you should be able to get them to equip whatever clothing or armor you want. It also means that when you first meet them they will be in their skivvies (or less, depending on whether you use a body replacer), although they will have some equipable armor in their inventory. The replacement housecarls included with this mod are as follows:\r\n\r\n[color=yellow]Brit Ronaan in Solitude (Wood Elf):[/color]\r\n-------------------------------------------\r\nBorn in Cyrodiil, Brit moved to Skyrim following the tragic and mysterious death of her father, a man alleged to have been secretly affiliated with the Blades. An accomplished archer, Brit honed her skills in the western regions of Skyrim, participating in numerous campaigns against the Forsworn. Rumored to be on the Thalmors\\' watch list, Brit prefers to keep a low profile and is extremely quick and agile with her bow. In addition to archery, she is highly proficient in light armor and sneak.\r\nClass: Scout\r\nCombat Style: Human Missile\r\nKey Perks: Quick Shot, Ranger, various light armor and sneak perks\r\n\r\n[color=yellow]Darva in Whiterun (Redguard):[/color]\r\n-------------------------------------\r\nBorn and raised in Skyrim, Darva has spent most of her life in Whiterun hold. Like many Redguards, Darva is competent in the use of one-handed weapons. Unlike most though, she is even more proficient with two-handed weapons. Give her a war axe and she\\'ll go to work. But give her a greatsword or battleaxe and she becomes a work of art. Other strengths include heavy armor and archery.\r\nClass: Two-Handed Warrior\r\nCombat Style: Human Boss 2H\r\nKey Perks: Barbarian (Rank 2), Champions Stance, Muffled Movement\r\n\r\n[color=yellow]Ilsanor in Windhelm (Nord):[/color]\r\n----------------------------------\r\nA native of Skyrim, Ilsanor grew up on her family\\'s farm in Eastmarch hold. She returned to the farm with supplies one evening to find a pair of Imperial Legion deserters beating her father and abusing her mother. The soldiers immediately turned their attentions to young Ilsanor, and both her parents were killed trying to intervene. During the skirmish, however, Ilsanor managed to gain control of one of the soldier\\'s swords, which she successfully turned against him. The second soldier dropped his sword and ran from the scene, fleeing for the hills. Though shaken and covered in blood, Ilsanor tracked him for several hours in the snow before surprising and brutally killing him. In addition to fueling recruitment for the Stormcloaks, the incident caused Jarl Ulfric to take a personal interest in Ilsanor, and it was he who made sure she received formal combat training. Ilsanor won\\'t speak of her past, but she still carries the swords used to avenge her parents. An accomplished dual wielder, Ilsanor is a whirling dervish of death and destruction, and you should take care to give her ample room to operate. She is also proficient in heavy armor, archery and sneak.\r\nClass: Orc Warrior (trust me)\r\nCombat Style: Mercer Frey Melee\r\nKey Perks: Dual Flurry (Rank 1), Dual Savagery, Fighting Stance, various sneak perks\r\n\r\n[color=yellow]Mira in Riften (Breton):[/color]\r\n-----------------------------\r\nA former resident of Honorhall Orphanage, Mira learned from an early age how to fend for herself on the streets. Her good looks and charm often get her into places she wouldn\\'t otherwise be able to go. When those assets aren\\'t enough to also get her out, she relies on her one-handed weapon and a working knowledge of the arcane arts. Swinging a weapon with her right hand while casting magic with her left, Mira is a formidable spellsword and can be a valuable ally in combat. Her primary skills are one-handed, destruction (fire) and heavy armor. Secondary skills include conjuration, restoration and sneak.\r\nClass: Spellsword\r\nCombat Style: Human Magic\r\nKey Perks: Fighting Stance, Hack & Slash (Rank 1), Recovery (Rank 2), Regeneration, various spell cost perks, various sneak perks\r\n\r\n[color=yellow]Sariina Silver-Blood in Markarth (Imperial):[/color]\r\n----------------------------------------------------\r\nBorn and raised in Cyrodiil, where her father was a commander in the Imperial Legion, Sariina married into the powerful Silver-Blood family three years ago. Resented as an outsider by many in the family, Sariina\\'s outspoken advocacy of better treatment and conditions for mineworkers was seen as a bad influence on her husband, who promised his young bride he would look into things. When he was killed by a cave-in during a related mine inspection, his relatives openly blamed Sariina for his death and she was ostracized by the family. Thanks to her father\\'s early influence, Sariina is well trained in one-handed weapons and light armor. Her real specialty however is blocking, and she is known for her ability to use her shield as an offensive weapon. Though blessed with a sultry voice, Sariina is a woman of few words. Unlike the others, she is not equipped to respond to housecarl-specific dialogue, so will be unable to answer questions about what it means to be a Thane or what a housecarl does. But since she\\'s unlikely to be your first housecarl, I don\\'t expect that should be a problem. When you tell her you need to exchange items with her, she will dutifully give you access to her inventory but will remain silent. If you like hearing your housecarl say things like \\\"Honor to you, Thane\\\" or \\\"I am sworn to carry your burdens\\\", then Sariina is not your girl. But then she isn\\'t used to being in a subservient role, so perhaps you could cut her some slack?\r\nClass: Rogue\r\nCombat Style: Human Boss 1H\r\nKey Perks: Power Bash, Disarming Bash, Block Runner, Fighting Stance, various light armor and sneak perks\r\n\r\n[color=orange]IMPORTANT NOTES AND DETAILS[/color]\r\n============================\r\nUnlike the vanilla housecarls, this mod ensures that each of your replacement housecarls has a unique blend of skills, perks and combat style. They still level up with you, but their range has been modified. The minimum levels vary from 10 to 20, and their maximum level is 60.\r\n\r\nAs noted above, I have given each replacement housecarl a number of perks, not with the intention of unbalancing the game, but rather to emphasize and encourage their particular combat style. Hence Ilsanor\\'s dual wielding perks, Sariina\\'s bashing perks, etc. Also, because only a handful of an NPC\\'s skills can increase as they level up, certain housecarls have been given certain perks to help make up for an underdeveloped skill, such as sneak.\r\n\r\nIt is important to note that, although they are supposed to, housecarls typically do not level up with your player. In fact, their level is set the moment the player enters the same cell the housecarl is based in, even if the two don\\'t meet until much later in the game. The housecarl\\'s level is noted in your saved game, and because the saved info takes priority, your game will use it instead of referencing the Skyrim master file or the esp file. You can force the housecarl to level up properly by resetting them with console commands (see Potential/Known Bugs section below), but the main reason I draw attention to this is that you may well want to use these replacement housecarls with one or more previously saved games, and those saved games may still retain info from one or more vanilla housecarls. While the replacements will show up and function properly, their stats (class-dependent skills and attributes) will be the vanilla housecarl\\'s stats that are retained by your save game (which doesn\\'t realize you\\'ve changed the NPC\\'s class). Thus, in order to get your replacement housecarl to properly reflect their given skill-set in your previously saved games, you need to make a one-time correction to their class via the console. To do this, simply hit the tilde key to open the console, target your housecarl by left clicking on her, then without the quotations type \\\"setclass <classID>\\\" where <classID> is the game\\'s reference ID for your housecarl\\'s assigned class (use 0001317D for Brit, 0001CE15 for Darva, 0002A477 for Ilsanor, 00013177 for Mira, and 00013180 for Sariina), then hit enter, then hit the tilde key again to exit the console. I purposely used existing classes in the Skyrim master file (rather than creating custom classes) so that it would be easy for you to do this. The housecarl most adversely affected if you allow her to get stuck in the one-handed warrior class is Mira. Although she indeed wields a one-handed weapon, she also uses magic and, while she would still be effective, her arsenal of spells would be limited due to the fact that one-handed warriors only have base-level magic skills. As such, if you want to enable her to cast the higher level spells in her spell list, you will need to correctly set her class as noted above. Note: this class correction is only necessary if you are launching this mod with a pre-mod saved game.\r\n\r\nSo that they can wear whatever clothing and armor you want them to, these housecarls have no default outfit. However, particularly if you are using this mod with a pre-mod saved game, there is a chance when you meet or reactivate them that a set of steel armor may magically appear in their inventory (from ghosts of housecarls past). If they do have extra armor appear in their inventory, or perhaps an extra set of weapons, you can just remove it from them and they should then equip whatever other armor/clothing they have. Also, the only way to get them to wear something when they are not in follower mode would be for me to assign them a default outfit, but then they would refuse to equip anything else that did not have a higher armor rating, so flexibility comes at the expense of modesty. Note: when you first meet or reactivate them as a follower you may need to give them a piece of equipment (any weapon or apparel) to prompt them to equip their existing inventory.\r\n\r\nOpposite gender animations (which accounted for the vanilla housecarls\\' butch stance) have been removed.\r\n\r\nAs with vanilla, I have kept these replacement housecarls protected but not essential. This is because I don\\'t think they should be immortal. Yes, I realize it\\'s frustrating when you heroically manage to win some epic battle and then look around with your arms raised in triumph only to see that, oh crap, Lydia is dead and you\\'ll have to reload and do it all over again. But situational awareness is a key component of the game, and frustration can be replaced by exhilaration on those rare occasions when you manage to save your housecarl\\'s bacon. She\\'s willing to put her life on the line for you, so I think it\\'s only fair that you should look out for her as well.\r\n\r\nAs noted above, each of these housecarls is optional. Each lady comes with a plug-in (.esp) file and a BSA file, both of which go in your Skyrim Data folder. The BSA file contains their face data files. If you don\\'t want to use one of the housecarls, simply disable the appropriate plug-in file by unchecking it in Data Files before launching Skyrim. Disabling the plug-in automatically disables the BSA, so if you prefer to use Lydia instead of Darva, you can leave Darva unchecked and let her files sit in your data folder without worrying about them having any affect on Lydia. This way you can use only the replacement housecarls you want, and can vary your choices by game (for example, if like me you have multiple games ongoing with different player characters, you can use Lydia in one while using Darva in another). I realize doing it this way requires more files, but I thought people would prefer flexibility to an all or nothing alternative.\r\n\r\nNew with v1.1, I am including an alternative version of Sariina. She has darker skin and silver hair (see the screenshot). This is the hair color I originally wanted to give her, but I went with a darker shade in the initial release due to the black bug issue encountered in Apachii\\'s initial release of her hair mod. Now that Apachii has released version 1.1 of SkyHair, which fixes the black bug issue, I am offering my preferred version of Sariina. Of course, beauty is in the eye of the beholder, so I am offering this as an option. This version\\'s files are clearly marked as optional, but they will be included in the data folder along with the original version of Sariina. Just make sure you have only one of the Sariina plug-in files checked in the Data Files menu before launching Skyrim, as having both Sariinas checked would cause a conflict.\r\n\r\nA couple of notes about Mira: First, although her class dictates that heavy armor is a major skill and that her light armor skill will never increase above a base level of 15, I have given Mira the powerful light armor perk of Agile Defender (Rank 5). This means she gets a 100% bonus to the armor rating of any equipped light armor. I did this so that, if you prefer, you can outfit her in light armor without worrying about it leaving her vulnerable. This perk allows her to swing both ways (so to speak) when it comes to armor, particularly at lower levels. Her heavy armor skill will increase as she levels up, so she will still get more benefit from heavy armor. But she should be able to hold her own in light armor, particularly if you use your smithing skills to improve her armor at the forge. Second, if you think Mira is too powerful, feel free to take one or both of her enchanted items away from her. I gave her these to boost her magicka because I expected there would be some people who, unlike yourself, would not have the patience to read this entire file and would perhaps fail to correct Mira\\'s class in their saved game, meaning she would be forever stuck with the 50 magicka inherited from Iona (the vanilla housecarl she replaces), which is not much for a Spellsword to work with. By taking away one or both of her enchanted items, you can reduce Mira\\'s magicka reserves, thereby reducing the frequency with which she can cast her more powerful spells.\r\n\r\nThis is the first real mod I have uploaded for public consumption, so constructive feedback will be much appreciated. Also, if you like the mod please endorse it as this will encourage others to check it out.\r\n\r\n[color=orange]POSSIBLE/KNOWN BUGS[/color]\r\n=====================\r\nThe weight bug. This is a bug that can occur whenever an NPC\\'s weight is edited in the CK. It is not caused by this mod. The bug causes a visible break at the neckline between the head and body. Fortunately, this can be easily fixed in the console by resetting the NPC\\'s weight and scale. If you get the weight bug, enter the console by hitting the tilde (~) key, then left click the mouse on your housecarl and type (without quotations) \\\"setnpcweight <value>\\\", where <value> is the NPC\\'s weight (use 40 for Brit, 50 for Mira and Sariina, 60 for Ilsanor, and 99 for Darva), then hit enter, then type \\\"setscale .98\\\", hit enter again and then hit the tilde key again to exit the console. Then (this is important) save your game, get completely out of Skyrim and then get back in and load your game and you should not have the problem any more. If you don\\'t get completely out after saving your game, the bug can recur when you enter a new cell. If necessary, you should only have to do this correction once for any housecarl that is affected. Also, don\\'t panic if your housecarl\\'s face tint settings change when you enter the commands. This will fix itself when you reload your saved game.\r\n\r\nFailure of housecarls to level with the player. As mentioned above, housecarls do not always level properly with the player because their info is stored in your saved game and is not updated when your player levels. Think of your saved game as a customs agent. When your housecarl first enters Skyrim, the agent scans their passport and creates a profile for future reference. This takes place when your agent first sees the housecarl, which is when your player first enters the cell in which the housecarl is based (i.e., when your player first enters the hold capital, which can be long before you initially meet the housecarl). The only way to get your agent to re-check the housecarl\\'s passport and update their profile is to have the housecarl leave and re-enter Skyrim. To do this, take from your housecarl any of the items you have given her and release her from follower mode. Then, before she walks away, enter the console, target the housecarl, and without quotations type \\\"disable\\\" and hit enter (you will see her immediately disappear from your game). While still in the console, type \\\"enable\\\" and hit enter again, then close the console. When you close the console she will reappear before you and your saved game should update her level and attributes (this will not affect her class). You can force your housecarl to level each time your player does, but I would suggest you simply do so each time you activate her as a follower (or at least about every ten levels).\r\n\r\nPurple hair bug. I had one reported instance of Mira having purple hair. I was able to replicate this problem and believe it was due to the fact Apachii made changes to the hair mesh in connection with her v1.1 update (which was after I created this mod). My v1.1 is completely compatible with Apachii\\'s v1.1, so as long as you are running the latest version you should not encounter this bug.\r\n\r\n[color=orange]MODS USED[/color]\r\n==========\r\nThe only mod required for this mod is ApachiiSkyHair. Okay, technically it\\'s only required for 3/5 of this mod, but who wants less than half a mod?\r\n* \\\"ApachiiSkyHair\\\" by Apachii: http://skyrim.nexusmods.com/downloads/download.php?id=46722\r\nI expect you already have one or more face mods you like to use, but if you want the housecarls to look exactly like they do in the screenshots then you\\'ll have to use the same ones I use, as follows:\r\nFace:\r\n* \\\"Better Females by Bella\\\": http://skyrim.nexusmods.com/downloads/download.php?id=9747 (\\\"No make up just improved textures\\\" version)\r\n* \\\"Beauty Faces by NecKros\\\": http://skyrim.nexusmods.com/downloads/download.php?id=6226 (specular map only)\r\n* \\\"No More Blocky Faces\\\" by Xenius: http://skyrim.nexusmods.com/downloads/download.php?id=13714 (I use version 1.3)\r\nI use a blend of these three mods. Install No More Blocky Faces first, then Bella\\'s mod, then take only the specular map (femalehead_s.dds) from the NecKros mod and use it to replace the one from Bella.\r\nThe specular map is located in the following folder: textures\\\\actors\\\\character\\\\female\r\nEyes:\r\n* \\\"Natural Eyes\\\" by nevenbridge: http://skyrim.nexusmods.com/downloads/download.php?id=11110 (human eyes only)\r\n* \\\"High Quality Eyes\\\" by Xenius: http://skyrim.nexusmods.com/downloads/download.php?id=1385 (elf eyes only) \r\nHair:\r\n* \\\"Straight hair retexture\\\" by navetsea: http://skyrim.nexusmods.com/downloads/download.php?id=13007\r\nOptional armor mods shown in screenshots and recommended:\r\n* \\\"Snow Leopard Forsworn\\\" by Rekicker: http://skyrim.nexusmods.com/downloads/download.php?id=6406 (non-replacer version)\r\n* \\\"Ancient Nord Edit CBBE v3\\\" by Echo 1162: http://skyrim.nexusmods.com/downloads/download.php?id=37127\r\n\r\n[color=orange]INSTALLATION (MANUAL)[/color]\r\n=====================\r\n1. Extract the files of this mod to a temporary location (you can use 7zip: http://www.7-zip.org, to unzip them) and check the folder structure.\r\n2. Copy all the files included in the Data folder into your Skyrim data folder, located in the Steam folder structure within your program files, typically: \\\\Steam\\\\SteamApps\\\\common\\\\Skyrim\\\\Data\r\n3. Launch Skyrim and make sure the appropriate plug-in files are checked in the Data Files menu before you play the game.\r\n\r\n[color=orange]CONFLICTS[/color]\r\n==========\r\nI expect this mod will conflict with any mod that makes appearance/trait changes to all the housecarls. However, as noted above, each of these housecarls has their own esp file and you can choose which ones to use. Thus, if you currently use a mod that changes only Lydia, you should be able to exclude Darva from your installation of this mod and still use any of the other four housecarls without conflicts (theoretically!).\r\n\r\nI have tested this mod with UFO and had no issues. Just make sure you follow fLokii\\'s installation instructions, which include disabling my esp files until after you get his mod installed and working properly. Then re-check the DFH files in your Skyrim Data Files menu, making sure they are below UFO in the load order, and you should be good to go (you\\'ll still need to make the one-time class correction and perhaps weight bug correction to correct your save file). You will get the benefit of UFO\\'s features, including the training and stat screen features for the housecarls. The only feature of UFO that I know my mod will override is the removal of level caps on the housecarls, but my caps are 60 (vs vanilla\\'s 50), which should be more than adequate for housecarls (as discussed on comments page). You MUST place my files below UFO to ensure your housecarls have the right appearance, class, equipment, perks, combat style, etc.\r\n\r\n[color=orange]CONTACT[/color]\r\n========\r\nIf you need to contact me, please do so by leaving a comment at the mod\\'s thread.\r\n\r\n[color=orange]CREDITS[/color]\r\n=======\r\nThanks to Bethesda for the Elder Scrolls Series of games.\r\nThanks to LHammonds for the Readme Generator this file was based on: http://hammondslegacy.com/obmm/tools_readme_generator1.asp\r\nThanks to the modders mentioned above for their efforts and improvements to the game.\r\nThanks to Nexus and the modding community for the access, tools and resources.\r\n\r\n[color=orange]TOOLS USED[/color]\r\n===========\r\nBethesda\\'s Creation Kit and related Archive Creation Tool\r\nNPC Editor by Foretrenty (used in creating custom tintmasks)\r\n7zip - http://www.7-zip.org/\r\n\r\n[color=orange]LICENSING/LEGAL[/color]\r\n===============\r\nIn the unlikely event you wish to use my characters in your own mod, please give me credit.\r\n\r\n\r\n",
  "categoryId": "66",
  "version": "1.1",
  "author": "c_striker",
  "createdUnix": "1332782418",
  "updatedUnix": "1333419455",
  "containsAdultContent": false,
  "uploadedBy": "c_striker",
  "primaryFile": null,
  "files": [
    {
      "fileId": "47100",
      "name": "Diverse_Female_Housecarls",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3613",
      "fileName": "Diverse_Female_Housecarls-13762.7z",
      "uploadedUnix": "1332782721",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/119b37bbcac69c106ed7c0bced85b944739dac9ad77d4796ee631c7ce3bae55e/analysis/1406781541/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Diverse_Female_Housecarls-13762.7z?fid=47100&ttl=1535776864&ri=8192&rs=8192&setec=666810fc0471b51a872dc2e0d1bea720"
    },
    {
      "fileId": "49520",
      "name": "Diverse_Female_Housecarls_v1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3552",
      "fileName": "Diverse_Female_Housecarls_v1_1-13762-1-1.7z",
      "uploadedUnix": "1333419455",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/23dce384312b48ae679bc8a50a15110ee8a980f0add1be8a2362e07373f3323f/analysis/1406794450/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Diverse_Female_Housecarls_v1_1-13762-1-1.7z?fid=49520&ttl=1535776864&ri=8192&rs=8192&setec=69e017f6e8918d86cd07381d4ff53b29"
    }
  ]
}