{
  "modId": 13772.0,
  "modName": "Breton Heroine 2",
  "summary": "This game save is a redo of \\\"Breton Heroine\\\" with a kinder expression and a thinner face.",
  "descriptionHtml": "You already know all about Vilja for Oblivion, right? \r\n\r\nI read recently that Vilja\\'s creator, Emma at Lovkullen.net (http://lovkullen.net/Emma/Skyrim), is working on a new Vilja for Skyrim. Emma will probably work on the Skyrim Vilja for weeks or months before Version 1.0 is ready to release.\r\n\r\nThe release of Skyrim Vilja is one of the things I am most looking forward to. Emma\\'s Oblivion Vilja is (IMHO) the most amazing NPC ever created. \r\n\r\nAlthough Emma\\'s Skyrim Vilja might not be ready to release yet, Vilja already looks to be very different from nearly all the other NPCs in Skyrim.\r\n\r\nTake a look at this pre-release screenshot. Emma\\'s Skyrim Vilja looks cheerful; almost happy.\r\n\r\nhttp://lovkullen.net/Emma/Skyrim/ScreenShot33_cr.jpg\r\n\r\nOne of the things I REALLY DON\\'T LIKE about Skyrim is that all the characters look so grim.\r\n\r\nEmma\\'s Skyrim Vilja inspired me to rework my own Avatar, which I previously posted as \\\"Breton Heroine.\\\"\r\n\r\nIn trying to create a cheerful-looking character, I discovered that it is very difficult--nearly impossible--to create a cheerful-looking character with Bethesda\\'s frustratingly limited character-creation tools.\r\n\r\nIt\\'s almost impossible to create an attractive-looking character, for that matter, but that\\'s a different problem.\r\n\r\nBreton Heroine 2 looks happier than Breton Heroine, but she still doesn\\'t look happy. There\\'s still a sadness around her eyes I couldn\\'t get rid of, but at least she looks kinder and more sympathetic than my original Breton Heroine.\r\n\r\nEmma\\'s Vilja, on the other hand, is a happy Breton. Maybe there\\'s something in the Construction Kit that would help. I need to get into the Construction Kit anyway.\r\n\r\nIf anyone can create a Breton avatar that looks happy--and please feel free to use either of my game saves as a starting point--I\\'d like to see it. You might even consider uploading your game save to skyrimnexus, if only so the rest of us could see exactly how you set the character-creation sliders.\r\n\r\nIf you cover up Breton Heroine 2\\'s brow and eyebrows with long bangs she looks happy. ApachiiSkyHair offers several options. Apachii hair 14 covers up Breton Heroine 2\\'s forehead with long bangs and adds a Hollywood-looking pony tail that makes her look not only happy but glamorous: ApachiiSkyHair; http://skyrim.nexusmods.com/downloads/file.php?id=10168\r\n\r\n\r\nI don\\'t consider most of the ApachiiSkyHair hairdos lore-friendly, unless somebody in Skyrim has invented some kind of charcoal hair-dryer. I suppose you could attach a bellows to blow hot air out of a forge or a fire, but I don\\'t think anybody has thought of that yet.\r\n\r\nAll these hundreds of years, and still no good hairdressers in Tamriel.\r\n\r\nExcept Apachii. And maybe Coolsims.\r\n\r\nEnjoy.",
  "categoryId": "43",
  "version": "1.0",
  "author": "Herbivore",
  "createdUnix": "1332793474",
  "updatedUnix": "1332793945",
  "containsAdultContent": false,
  "uploadedBy": "herbivore",
  "primaryFile": null,
  "files": [
    {
      "fileId": "47157",
      "name": "Breton Heroine 2",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1622",
      "fileName": "Breton Heroine 2-13772.zip",
      "uploadedUnix": "1332793945",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/a305cd09da9f8a943d4b470d4b956fc611dc7102a31f0da40e817a1549a64491/analysis/1406781672/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breton%20Heroine%202-13772.zip?fid=47157&ttl=1535776884&ri=8192&rs=8192&setec=0da1e13739a126a94871c8a2a8a02f7c"
    }
  ]
}