{
  "modId": 13782.0,
  "modName": "SCA - Skyrim Character Archetypes",
  "summary": "This mod adds both custom and preconfigured archetypes to the game. Preconfigured archetypes have been taken from the official PRIMA guide. You can choose 2 primary and 2 secondary skills which will grant you bonus experience (25 and 15 percent). You can also choose 6 different perks that will given for free once you meet the skill requirements (ev",
  "descriptionHtml": "[B][SIZE=6]Please endorse if you liked this file[/SIZE][/B]\r\n\r\n[B][SIZE=6]BETA Information[/SIZE][/B]\r\nALWAYS backup your saves and be prepared to find bugs because this mod is still in beta. Please send any suggestions, comments or bugs via PM or the comments section. I feel the mod is a lot more stable than v0.3.0, I can not however guarantee future versions will be compatible with current versions. I would also like some advice on the in-game menu\\'s as far as text goes, maybe better wording of certain elements as I am not a native English speaker.\r\n\r\nHOW TO USE:\r\nEither create a new character and activate the statue, or level up a skill with an existing character\r\n\r\nCommands to help with testing:\r\nincpcs [Skill] - Level up a skill (i.e. incpcs Destruction) \r\n\r\nKnown issues:\r\n- The mod will trigger early if you level up a skill before reaching the statue\r\n\r\n[B][SIZE=6]Information[/SIZE][/B]\r\nThis mod adds both custom and preconfigured archetypes to the game. Preconfigured archetypes have been taken from the official PRIMA guide. You can choose 2 primary and 2 secondary skills which will grant you bonus experience (25 and 15 percent). You can also choose 6 different perks that will given for free once you meet the skill requirements (even if you do not meet the prerequisite).\r\n\r\n[B][SIZE=6]Installation[/SIZE][/B]\r\nSkyrim Nexus (Manual):\r\n1. Download the archive\r\n2. Unpack everything to \\\"Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\" (x64)\r\nor \\\"Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\" (x86)\r\n3. Launch skyrim and choose Data Files\r\n4. Check \\\"Load\\\" in front of \\\"SCA - Skyrim Character Archtypes\\\"\r\n5. Start the game\r\n\r\n[B][SIZE=6]Mod Compatibility[/SIZE][/B]\r\nThis mod should only cause issues if another mod edits the same area inside Helgen Keep\r\n\r\n[B][SIZE=6]Changelog[/SIZE][/B]\r\nI have removed some previously available information from this page as it was no longer up to date, please use the in-game menu\\'s or book for information about the mod.\r\n\r\n[B]Version 0.3.8 BETA[/B]\r\n- Fixed the archetype configuration screen appearing on skill level up even though the mod was already configured\r\nNOTE: This bugfix should not cause any issues with previous versions\r\n\r\n[B]Version 0.3.7 BETA[/B]\r\n- Added a \\\"statue\\\" taken from Calcelmo\\'s Tower which now acts as the activator for the mod (see images)\r\n- Added statistics to each PRIMA archetype choice\r\n- Tweaked other small parts of the menu\r\n- The book is no longer needed and not given automatically, it\\'s now on the ground next to the \\\"statue\\\" Note: The book no longer acts as the activator for the mod, this means that you will have to level up a skill if you want to activate it on an existing character.\r\n\r\n[B]Version 0.3.0 BETA (Complete rewrite)[/B]\r\n- The ability to create a custom class\r\n- Primary skills gain a 25 percent experience bonus (previously 60)\r\n- Secondary skills gain a 15 percent experience bonus (previously 40)\r\n- Reduced experience can now be configured in-game (5 to 50 percent, 5% increments)\r\n- Bonus and reduced experience shown in the Magic Effects menu\r\n\r\n[B]Version 0.2.0[/B]\r\n- Perks are now granted after choosing an archetype, the mod previously only checked on skill level up\r\n- Now checks if an archetype has been chosen at skill level up\r\n- Improved scripting, reducing the size of the mod\r\n\r\n[B]Version 0.1.2[/B]\r\n- Repackaged the mod, a script refused to be packed inside the .bsa file\r\n\r\n[B]Version 0.1.1[/B]\r\n- Initial release",
  "categoryId": "73",
  "version": "v0.3.8b",
  "author": "QuietusPlus",
  "createdUnix": "1332804997",
  "updatedUnix": "1333581718",
  "containsAdultContent": false,
  "uploadedBy": "QuietusPlus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "50138",
      "name": "SCA - Skyrim Character Archetypes v0_3_8b",
      "version": "0.3.8b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21",
      "fileName": "SCA - Skyrim Character Archetypes v0_3_8b-13782-0-3-8b.zip",
      "uploadedUnix": "1333581718",
      "modVersion": "0.3.8b",
      "virusScanUrl": "https://www.virustotal.com/file/42e3c81d28217a07067abdd7eaf70e56b443258be08a8b03cc9fb6d2266f90a9/analysis/1406797684/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SCA%20-%20Skyrim%20Character%20Archetypes%20v0_3_8b-13782-0-3-8b.zip?fid=50138&ttl=1535776909&ri=8192&rs=8192&setec=07adc01c2b727f6cb0d8f6c926476d84"
    }
  ]
}