{
  "modId": 13825.0,
  "modName": "TTC - Tamriel Trade Centre - ALPHA",
  "summary": "This is a mod which adds the world trade centre to the game. I have named it Tamriel Trade Centre or TTC for short.",
  "descriptionHtml": "This is a mod which adds the world trade centre to the game. I have named it Tamriel Trade Centre or TTC for short. It is currently in ALPHA stage. If you wish to please feel free to track the mod.\r\n\r\nCreated by: [url=http://www.youtube.com/spambrie1111999]spambrie[/url], [url=http://www.youtube.com/thejaffinator1]thejaffinator[/url] & [url=http://www.youtube.com/thefatbot41]fatbot41[/url]\r\n\r\n[size=14][u]Inside TTC[/u][/size]\r\nI will upload spider-diagrams of the ideas to help you better understand them.\r\n\r\nBank - Interest, Loans, Deposit & Withdraw, Reapers\r\nMarketplace - Buy your own shop, shop advertising, tax, different shops (eg. Pawnbrokers, Armour...)\r\nStorage Rooms - Main room, Additional rooms can be bought(see image)\r\nManagers Office - Quests, reaper for hire, fixing storage locks, buying shop, delivering large sums of money\r\n[size=14][u]Stages[/u][/size]\r\nALPHA - Drawings and ideas, starting to create dialogue and main building structure.\r\nBETA - Main structure complete, dialogue no voices. Some areas may not be completed\r\nFINAL - All areas completed, only bug fixes for updates.\r\nOOA - Out of Action, no longer working on mod or doing updates\r\n\r\nDuring ALPA stage help will be needed I may also ask for ideas for NPCs, shops etc.\r\n\r\n[size=14][u]Designs[/u][/size]\r\nPlease view the images for designs and building plans. If you have better ideas please say in the comments and I may make changes.\r\n\r\n[size=14][u]Quests[/u][/size]\r\nTo receive quests you must go speak to the manager. (Quests are in order of availability)\r\n\r\nReaper for hire - You must take some possessions of a drunk worth 300 gold. You can steal them, persuade him to give them up or kill him and take them. You then have to sell the items and make 300 gold. You can alternatively just give the manager 300 gold to start with.\r\n\r\nFixing storage locks - Some of the locks have been broken in the storage room. You must repair them using the special tool the manager gave you.\r\n\r\nBuying a shop - The manager will give you a book on how to use your shop after you pay him 3,000 gold.\r\n\r\nDelivering money - The manager is trusting you to deliver large sums of money to a man. Until you give the man the money you will not be allowed to enter the Trade Centre.\r\n\r\n[size=14][u]Help[/u][/size]\r\nHelp with this mod will be much appreciated. I do not need anyone to build the mod for me but I may need help since I am not the best with the Creation Kit. Ideas for quests and other things will be greatly appreciated. This part of the page may change depending on what help I need. (eg. Voice Actors, Papyus help). If you give me a really great idea I will put you in the credits.\r\n[size=14][u]Thank You to...[/u][/size]\r\nBethesda - For this brilliant game\r\nNexus - For a wonderful website and community\r\nTheJaffinator - co-creator\r\nFatbot41 - co-creator",
  "categoryId": "25",
  "version": "0.1",
  "author": "Spambrie_TheJaffinator_Fatbot41",
  "createdUnix": "1332872795",
  "updatedUnix": "1332955147",
  "containsAdultContent": false,
  "uploadedBy": "spambrie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "47712",
      "name": "TTC MOD - Version ALPHA 0-1",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "136",
      "fileName": "TTC MOD - Version ALPHA 0-1-13825.zip",
      "uploadedUnix": "1332955147",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/6b03e6c1d5e1ec0679747ab266c788c59d648bda29889d518a9b21b810931ea6/analysis/1406784373/",
      "changelogHtml": " Initial release <br/> \n to run please type coc \\\"ttcreception\\\" in the console <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TTC%20MOD%20-%20Version%20ALPHA%200-1-13825.zip?fid=47712&ttl=1535776971&ri=8192&rs=8192&setec=e5fc6ee33004c2e128432dabb865ba33"
    }
  ]
}