{
  "modId": 13839.0,
  "modName": "Basic Smithing Perk",
  "summary": "Changes the Steel Smithing perk into a Basic Smithing Perk that adds all the lower level weapon and armor materials into the perk so that they may be double upgraded like all the higher tier materials.",
  "descriptionHtml": "This mod has been ported to the Skyrim Special Edition - if you would like to use this mod in that version of the game it can be found [url=http://www.nexusmods.com/skyrimspecialedition/mods/9972][color=#ff0000][b]&gt;&gt;HERE&lt;&lt;[/b][/color][/url]\r<br />\r<br />This mod changes the Steel Smithing perk into a Basic Smithing perk that affects all the low level weapons and armor you will most likely find and be using on your character in the early stages of playing the game.  All the weapon and armor materials that Bethesda didn&#39;t add into the perk as &#39;double upgradable&#39; in the base game are included here as follows:\r<br />\r<br />[color=#00ff00][b]Draugr\r<br />Draugr Honed\r<br />Fur\r<br />Heavy Imperial\r<br />Hide\r<br />Iron\r<br />Iron Banded\r<br />Leather\r<br />Light Imperial\r<br />Stormcloak\r<br />Studded\r<br />Studded Imperial\r<br />Wood[/b][/color]\r<br />\r<br />Nothing else is changed, Steel weapons and armor are still affected by the perk and function normally and purchasing the perk with one of your level up points allows you to progress up the Smithing skill tree just as you can in the base game.  Naturally, it should be obvious that this new perk becomes the required perk for all further higher level perks in the standard Smithing perk constellation.\r<br />\r<br />[color=#ff0000][b]** NOTE **[/b][/color]   This is not a bugfix or overhaul type mod so any special and/or unique weapons or armor types and sets that you think should work that have not been configured to use the standard low level material keywords in the base game by Bethesda will continue to NOT be affected by this perk.\r<br />\r<br />Examples:  Blades armor, Thieves guild armor\r<br />\r<br />[color=#ff7700][size=4][b]Installation[/b][/size][/color]\r<br />\r<br />Standard install, use the mod manager of your choice to install or just drop the esp file into your Data directory manually and activate it.\r<br />\r<br />[color=#ff7700][size=4][b]Removal[/b][/size][/color]\r<br />\r<br />Deactivate the file and then delete the esp.  Shouldn&#39;t have any affect on save games.\r<br />\r<br />[color=#ff7700][size=4][b]Compatibility[/b][/size][/color]\r<br />\r<br />Obviously, any other mod that edits the standard Steel Smithing perk will be incompatible with this mod.  Nothing bad will happen (probably) if you do so, just note that you&#39;ll only get the changes from the mod you load last as usual - the rule of &#34;Last Loaded Mod Wins&#34; is the law of the land as always.",
  "categoryId": "73",
  "version": "1.1",
  "author": "Urtho",
  "createdUnix": "1332882715",
  "updatedUnix": "1335324309",
  "containsAdultContent": false,
  "uploadedBy": "Urtho",
  "primaryFile": null,
  "files": [
    {
      "fileId": "56084",
      "name": "Basic Smithing Perk",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Basic Smithing Perk-13839.7z",
      "uploadedUnix": "1335324309",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/eab5ebb6f517f691a080920f82adfca03dc2d3a3345071b2139d06f4c014941f/analysis/1406839322/",
      "changelogHtml": " Removed some unintentional edits to Bandit (Fur) armor <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Basic%20Smithing%20Perk-13839.7z?fid=56084&ttl=1535776989&ri=8192&rs=8192&setec=3161adcf50b95045f964bbc90fa99123"
    }
  ]
}