{
  "modId": 13851.0,
  "modName": "Skyrim Hardcore Overhaul",
  "summary": "Built for all those Uber Dragonborns out there looking for a greater challenge.",
  "descriptionHtml": "[img]http://static.skyrim.nexusmods.com/downloads/images/13851-1-1332899648.jpg[/img]\r\n\r\n\r\nI designed this mod for myself originally to give a much greater challenge to Skyrim. I\\'ve modded my game to uncap skills to 300 because i enjoy feeling the huge level of progression with my character. I\\'m not really into mods that increase difficulty through limiting crafting and so on. After playing Skyrim for some time now with all the classics, warzones, wars, deadly dragons ect. on master difficulty with pises X8 intensity, i still found myself looking for greater challenges with some of the named bosses and other high level mobs. So, I\\'ve revamped many of them with higher resistances, damage, immunites, and the strongest will even regenerate. \r\n\r\nMobs altered are Draugr Deathlords, Falmer Shadowmaster, Bandit Chiefs, Arch mages of any kind, Alkir Warriors, Vigilants of Stendarr, werewolves, Ancient and higher Vampires, and more. Many of the mobs and named npcs faced in the Daedric Artifact quest have been altered. Some mobs in the main story line have been altered as well. Didn\\'t touch any dragons. I\\'m assuming most people interested in this are using deadly dragons or some other dragon mod already. \r\n\r\nGave them all an armor class of 500-600, magic resistance 60-70%, poison resists up to 80%, health regeneration from 0.8%-1.1% per second. Increased their level so they are static between 60-80. Increased their weapon and magic damage anywhere from 2-4 times as much.\r\n\r\nGave many of them immunity to paralysis, and strong unrelenting force. Because mobs certainly aren\\'t challenging when they are spammed with paralysis.\r\n\r\n\r\nThis mod is a continuing wip for anyone looking to challenge their uber Dragonborn! \r\n\r\nIf anyone has any mobs or named npcs they noticed weren\\'t changed they\\'d like to see altered let me know. \r\n\r\nAnd don\\'t forget to endorse if you enjoy the suffering as much as I do:)\r\n\r\nThanks to Bethesda for greating such incredible games. ",
  "categoryId": "79",
  "version": "1.0",
  "author": "Goth79",
  "createdUnix": "1332898561",
  "updatedUnix": "1332898826",
  "containsAdultContent": false,
  "uploadedBy": "Goth79",
  "primaryFile": null,
  "files": [
    {
      "fileId": "47522",
      "name": "Skyrim Hardcore Overhaul",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "274",
      "fileName": "Skyrim Hardcore Overhaul-13851-1-0.rar",
      "uploadedUnix": "1332898826",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/375689f2ee420996e51c4139f8999154a5c30da31a5cef421c357116d23f2cb6/analysis/1406783538/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Hardcore%20Overhaul-13851-1-0.rar?fid=47522&ttl=1535777020&ri=8192&rs=8192&setec=d19e7253eee19a2cc39d460461c74783"
    }
  ]
}