{
  "modId": 13859.0,
  "modName": "MarasEyeManor",
  "summary": "Player home off the bank of Mara\\'s Eye Pond overlooking the White River. ",
  "descriptionHtml": "The house includes:\r\n13 mannequins\r\n15 weapons plaques (3 shield, 12 single weapon)\r\n10 weapons racks\r\n18 fully functioning bookshelves in library\r\n6 dagger display cases (fully functioning)\r\n3 full sized display cases (fully functioning)\r\nplenty of player owned chests, wardrobes, etc.\r\n\r\nMAIN LIVING AREA\r\nIn the main living area you will find two bedrooms, the library, dining hall, great hall to display your armor and weapons. The house is fully decorated complete with an indoor waterfall in the entry room.\r\n\r\nBASEMENT\r\nThe basement includes an area for enchanting and alchemy with plenty of shelves filled with ingredients. You will also find area for smithing with a forge, smelter, tanning rack, grinding wheel, workbench and chopping block. As a bonus there is shelving full of ingots, leather and leather strips to help you get those smithing skill points up. There are chests to store items for enchanting alchemy etc.\r\n\r\nKITCHEN\r\nThe kitchen has a cooking pot for cooking. Lots of ingredients laying about and plenty of leveled sacks and barrels to pull from.\r\n\r\nPOOL HOUSE\r\nMostly for novelty as of yet. I have plans to add a script to either the pool or the steam room to remove disease etc. Want to give SpiralDynasty credit as the inspiration for the pool. Inspired me to come up with the steam room idea.\r\n\r\nCompatibility:  Should be fully compatible although I designed the lighting with RCN (realistic colors and nights) installed so vanilla installs might be brighter than normal. \r\n\r\nKnown issues: Books removed directly from the bookshelf result in duplicates (no matter how many times I tried resizing the trigger boxes) and there are just too many to fix by hand now that they are covered by other triggers and collision boxes. I had to check full LOD on the exterior and one of the terrain features to ensure they show up in game. Followers should have no problems entering however, with the newest bug supposedly with the navmesh there may be CTD (I got one or two) on loading. It is very rare however so I decided to keep the navmeshes in place for followers. Hopefully the next patch will fix this and there won\\'t be a need to change it at all.\r\n\r\nHouse is unlocked so no key required. \r\nThis place took me a while to put together. I tried to pay attention to the details to create a unique player space that is as functional as it is a fun place to go back to. I hope you enjoy it. Any comments suggestions are welcome as well as screenies. \r\n\r\nIf you plan on reusing my house please give credit that is all I ask. Otherwise do whatcha want!\r\n\r\n*Updates*\r\n\r\n1.1: Added a chest next to forge, 5 new mannequins (1 in stairway to basement and 4 in basement) and subtle smoke FX to forge.\r\n",
  "categoryId": "67",
  "version": "1.1",
  "author": "CraZed",
  "createdUnix": "1332907047",
  "updatedUnix": "1335320372",
  "containsAdultContent": false,
  "uploadedBy": "Sigil77",
  "primaryFile": null,
  "files": [
    {
      "fileId": "47586",
      "name": "maraseyemanor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "246",
      "fileName": "maraseyemanor-13859-1-0.rar",
      "uploadedUnix": "1332914257",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/67f5c377aed93a303597ece2fc6a4bdf44f8b4edef8c5d6efed963773b3390aa/analysis/1406783826/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/maraseyemanor-13859-1-0.rar?fid=47586&ttl=1535777031&ri=8192&rs=8192&setec=92223e4931080e987f9523b6b0f2ad6a"
    },
    {
      "fileId": "56074",
      "name": "maraseyemanorV1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "246",
      "fileName": "maraseyemanorV1_1-13859.rar",
      "uploadedUnix": "1335320372",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/a0fda3f28cd45381c80f717a9e00f4361d44edcdffb6836144f7c561fbfb64ba/analysis/1406839265/",
      "changelogHtml": " Added Chest next to forge. <br/> \n Added 5 new mannequins. 1 at bottom of stairway to basement. 4 in basement. <br/> \n Added subtle smoke FX to forge. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/maraseyemanorV1_1-13859.rar?fid=56074&ttl=1535777032&ri=8192&rs=8192&setec=29558cc36d46e8eb9332aa7ea21ac0a9"
    }
  ]
}