{
  "modId": 13854.0,
  "modName": "Skyrim Music Expansion - Infinity Engine Classics",
  "summary": "An expansion to the musical landscape of Skyrim using classics from the old Infinity Engine games: the Baldur\\'s Gate series and Icewind Dale series.",
  "descriptionHtml": "[IMG]http://i717.photobucket.com/albums/ww179/satma08/SME-IE_Banner.png[/IMG]\r\n\r\n Description\r\n ===========\r\n One of the great things about Skyrim is, undeniably, its well-crafted music. From the legendary theme that blew everyone away since December 2010, to the meticulous attention to detail paid in fleshing out what fight scene music plays out when, it is easy to see the importance and strength Jeremy Soule\\'s work lends to this RPG masterwork, and it is surely a credit to the genre as a whole.\r\n\r\n But how much more could it be if it were joined by some of the greatest pieces of yesteryear? That is the project I have begun - to fold the great music of RPGs past into Skyrim in seamless fashion. This is no mere dump of old soundtracks into the game: each piece has been fitted precisely into the places that I decided it most belonged. Combat music from the RPGs of yesteryear will play in the rotation along with the pieces you know already, with only the most epic of those old pieces being reserved for dragon battles. Different songs will play in different terrain, recalling the environments of the games of old while complimenting Skyrim present.\r\n\r\n This is the Skyrim Music Expansion.\r\n\r\n\r\n Details\r\n =======\r\n This chapter of Skyrim Music Expansion deals strictly with the Infinity Engine series of games: the Icewind Dale series and the Baldur\\'s Gate series. They have been implemented in a fashion to produce a seamless and enriched musical experience.\r\n\r\n Install\r\n =======\r\n 1. Copy the .esp file to (install folder)\\\\Skyrim\\\\Data\\\\\r\n 2. Copy either the BG, IWD, or both folders to \\\\Skyrim\\\\Data\\\\Music\r\n 2. Open your Mod List using the program of your choice, and select EITHER BG_Music (for JUST Baldur\\'s Gate music), IWD_Music (for JUST Icewind Dale music), or IWD+BG_Music (for both).\r\n\r\n Uninstall\r\n =========\r\n 1. Start Oblivion Launcher, click Data Files, uncheck the .esp file(s).\r\n 2. Delete the .esp file from \\\\Skyrim\\\\Data\\\\\r\n 3. Delete the BG and/or IWD folders from \\\\Skyrim\\\\Date\\\\Music\\\\\r\n\r\n\r\n Incompatibility\r\n ===============\r\n This mod will be incompatible with any other mod which modifies the Music Types in Skyrim, likely including Personalized Music - Add your own music to Skyrim by No_Aardvarks_Allowed.\r\n\r\n\r\n History\r\n =======\r\n 3/25/2012: Made BG_Music_v1\r\n 3/27/2010: Made everything else\r\n\r\n None\r\n\r\n Licensing/Legal\r\n ===============\r\n While the music in this mod is technically under copyright, it is not being sold as a soundtrack independent of the game itself, so falls under a grey area. It should be noted that Inon Zur, in his own discography, links to downloads of some of his older work; while he does not link to IWD2 or TOB, I presume that this is mainly because of inaction rather than intent to restrict their distribution. It should also be noted that these are not complete soundtracks nor are they at the highest possible quality; tracks have been omitted, and quality has been restricted.",
  "categoryId": "61",
  "version": "2.1",
  "author": "SATMA",
  "createdUnix": "1332902622",
  "updatedUnix": "1332908993",
  "containsAdultContent": false,
  "uploadedBy": "SATMA",
  "primaryFile": null,
  "files": [
    {
      "fileId": "47569",
      "name": "Skyrim Music Expansion - Infinity Engine v2-1",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "641276",
      "fileName": "Skyrim Music Expansion - Infinity Engine v2-1-13854-1.rar",
      "uploadedUnix": "1332908993",
      "modVersion": null,
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Music%20Expansion%20-%20Infinity%20Engine%20v2-1-13854-1.rar?fid=47569&ttl=1535777024&ri=8192&rs=8192&setec=b7ebddb1682496b68e55c08090afd8d8"
    }
  ]
}