{
  "modId": 13885.0,
  "modName": "Bug Fixes for Player Homes",
  "summary": "fixes a multitude of glitches in Hjerim and Proudspire Manor. More homes will be added when I buy them in game and inspect them!",
  "descriptionHtml": "Fixed multiple bugs in Proudspire Manor. \r\n\r\n-The three common chairs on the third floor are now properly replaced when purchasing the Living Room set. \r\n\r\n-Removed All of the cobwebs in the basement when the Enchanting upgrade is purchased. \r\n\r\nNot sure why some were left but it just didn\\'t look right. Now it looks like its been properly cleaned. \r\n\r\n-Fixed some flashing textures in the master bedroom near the safe, and, behind the mannequins near the Enchanter.\r\n\r\n--==UPDATE==--\r\n\r\nIf your like me, you spot glitches very easily and once its been noticed it can never be unnoticed. You also cringe every time you come across one of these. Whether it be a floating tree/bush, or two textures that don\\'t align properly. Thankfully Skyrim doesn\\'t have anywhere near the amount of these issues that Fallout 3 did. But, they are still around. \r\n\r\nAfter purchasing Hjerim for the first time, I absolutely loved it. Most spacious house in the game, the secret room, tons of weapon plaques and display cases, tons of mannequins! \\\"This house is awesome!\\\" I thought. But after a few minutes in the place I started to notice the bugs. \r\n\r\nTextures inside of each other so both flash because they are trying to be the one on top, the misaligned chunk in the ceiling letting you look out into the void, the long vertical rope standing behind the master bed. The rugs were clipping inside floor beams... on and on and on!\r\n\r\nThis mod fixes all of those! To save time, Only 2 fixes were shown in the screenshots section. All screenshots are included with the download plus a description of each bug as the screenshot name. This mod IS compatible with other mods that modify Hjerim. Tested with Windhelm Hjerim Armory and Storage Upgrade (http://skyrim.nexusmods.com/downloads/file.php?id=9992)\r\n\r\nIf there are any bugs that I missed let me know and I\\'ll get to them ASAP. Please show them to me by taking a screenshot of it and submitting it to this page. I\\'ll also be doing the other purchasable houses after I buy/upgrade/examine them. This is not the first mod I\\'ve made. I have made a multitude of private mods for myself and friends. This one however, is the first one I am releasing to the Nexus. So please download and enjoy!",
  "categoryId": "95",
  "version": "1.1",
  "author": "Kataous",
  "createdUnix": "1332948950",
  "updatedUnix": "1333165499",
  "containsAdultContent": false,
  "uploadedBy": "Kataous",
  "primaryFile": null,
  "files": [
    {
      "fileId": "47691",
      "name": "Hjerim Fixes",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7339",
      "fileName": "Hjerim Fixes-13885.zip",
      "uploadedUnix": "1332951724",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/70bf59db5d6d9f48d103e314a754c1055fee6e2b5f7585acd13b0dd214b552ba/analysis/1406784258/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hjerim%20Fixes-13885.zip?fid=47691&ttl=1535777067&ri=8192&rs=8192&setec=f5ae3712ff4938e5c7a40d8c5e631683"
    },
    {
      "fileId": "48416",
      "name": "Bug Fixes for Player Homes",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Bug Fixes for Player Homes-13885-1-1.zip",
      "uploadedUnix": "1333165499",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d40f9c1fe11da43e452e89ddbb41220f5000b2f24a32950324c4a946e956fd60/analysis/1406788503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bug%20Fixes%20for%20Player%20Homes-13885-1-1.zip?fid=48416&ttl=1535777068&ri=8192&rs=8192&setec=97aa2d656f95011d13b91dd0d1e3c0be"
    }
  ]
}