{
  "modId": 13889.0,
  "modName": "Falling Spells",
  "summary": "This mod adds a ring and spells to the game which will slow your descent and prevent you from getting killed or creating damaging shockwaves when you hit the ground. Currently includes Slow Fall, Flame Fall and Storm Fall",
  "descriptionHtml": "User Guide\r\n======================================================================\r\nThe ring can be made at a forge using a gold ingot. Simply equip the ring when you want to prevent falling damage and unequip when your done. It will also slow down time as you fall.\r\n\r\nBoth the Slow fall and Flame fall spell tomes can be found at the Riverwood Trader but I hope to expand this.\r\n\r\nSlow fall will slow time once cast and prevent damage being taken when you hit the ground. The spell will wear off after 10 seconds or once you have landed, which ever occurs first.\r\n\r\nFlame fall does not slow time as you fall but will cause a fiery shockwave once you land. The shockwave will damage nearby NPCs aswell as knocking them over. You will not take any damage from the fall once you land either. The spell will wear off after 10 seconds or once you have landed, which ever occurs first.\r\n\r\nStorm fall does not slow time as you fall but will cause a electrical shockwave once you land. The shockwave will damage nearby NPCs aswell as draining mana. You will not take any damage from the fall once you land either. The spell will wear off after 10 seconds or once you have landed, which ever occurs first.\r\n\r\nRelease News\r\n======================================================================\r\nLatest release fixes the damage being caused by the slow fall ring and spells\r\n\r\nBugs\r\n=======================================================================\r\nNot currently seeing anything major myself but let me know if you come across any\r\n\r\nAims\r\n======================================================================\r\nCreating a levitation spell\r\nAdding the Spell tomes to more vendors throughout Skyrim instead of just in Riverwood.\r\nMore shockwave variants (frost, rock, fus ro dah)\r\nA propel spell which will allow you glide forwards as you fall\r\n\r\nFeedback\r\n======================================================================\r\nThis mod was originally posted on to Steam Workshop\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=17328\r\n\r\nIf you have any suggestions/bugs then please feel free to comment and Ill do my best to address them",
  "categoryId": "75",
  "version": "",
  "author": "Madrilous",
  "createdUnix": "1332950016",
  "updatedUnix": "1332952604",
  "containsAdultContent": false,
  "uploadedBy": "Madrilous",
  "primaryFile": null,
  "files": [
    {
      "fileId": "47698",
      "name": "Falling Spells V1-0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Falling Spells V1-0-13889-1-0.zip",
      "uploadedUnix": "1332952604",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cf5bfc97c7aeaf87305acb6c5607293057f19b19fd8a5bb2b12a6787bcfe0845/analysis/1406784262/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Falling%20Spells%20V1-0-13889-1-0.zip?fid=47698&ttl=1535777076&ri=8192&rs=8192&setec=3af3eb5a28200dfb103df960e62c99e8"
    }
  ]
}