{
  "modId": 13892.0,
  "modName": "Mana Bomb",
  "summary": "Ladies and Gentleman... for all of us who love to fight hordes of enemies but hate to get stuck when they swarm you, I present... the Area-Of-Effect Fus-Ro-Dah Spell: MANA BOMB!",
  "descriptionHtml": "Ladies and Gentleman... for all of us who love to fight hordes of enemies but hate to get stuck when they swarm you, I present... the Area-Of-Effect Fus-Ro-Dah Spell: MANA BOMB!\r\n\r\nEnough with the catchy intro. Let\\'s do this.\r\n\r\nFirst of all, this spell can be bought by talking to Farengar, in Whiterun or by going to the Archmage\\'s quarters in the College of Winterhold (it\\'s on the floor).\r\n\r\nNow, what is this? When you fire this spell you send an enourmous blast of energy that pushes everything and everyone away. It does not inflict damage (well, probably except fall damage), but NPCs will see this as an attack and guards, for example, will start to attack you if you do this on a city. It is very useful when you\\'re fighting a ton of Draugrs at the same time and you can\\'t even move because they have surrounded you. In those cases all you have to do is deploy the bomb and watch them fly (and then, if you still feel unsafe, you are free to run away).\r\n\r\nIts charge time is not very big (1 sec) and its effects are really cool to watch (and useful, in my opinion!), but it does cost quite a bit of mana. If you think this is unbalanced please say it in the comments. I tried to make this cool but still not making fights too easy.\r\n\r\n---\r\nVERSIONS:\r\n\r\n1.01 - Added the spell tome to the Archmage\\'s quarters\r\n1.00 - First release\r\n\r\n---\r\nKNOWN BUGS:\r\n\r\n- When you release the spell without moving you will briefly see a dialog saying you can pick up the \\\"Mana Bomb Explosion\\\". I have no idea why this is happening. Until I figure this out please just ignore it.\r\n\r\n\r\nHope this is cool and useful!",
  "categoryId": "75",
  "version": "1.01",
  "author": "Alexandre Truppel",
  "createdUnix": "1332951568",
  "updatedUnix": "1332951811",
  "containsAdultContent": false,
  "uploadedBy": "truppelito",
  "primaryFile": null,
  "files": [
    {
      "fileId": "47692",
      "name": "Mana Bomb",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "997",
      "fileName": "Mana Bomb-13892-1-01.zip",
      "uploadedUnix": "1332951811",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/ab606201976ae5b3d479f0bd12fe432fca28e7127e2cb234cef85bb42510f24a/analysis/1406784260/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mana%20Bomb-13892-1-01.zip?fid=47692&ttl=1535777081&ri=8192&rs=8192&setec=49c27007bc08f095aa5673dccea441f4"
    }
  ]
}