{
  "modId": 1390.0,
  "modName": "Red Stormcloaks for Solitude",
  "summary": "Replaces the Solitide Guard/Stormcloak tunic from being brown to being a nice Deep, rich red.",
  "descriptionHtml": "Bare in mind this is my first time ever trying this kind of thing.\r\n\r\nThe Imperials favor Red, and I favor Red, and I like the storm-cloak armor look, so I replaced the brown with Red, figured it made sense, accidently made it look cleaner, no dirt, and not so tatterd at the edges.. by accident, but the empire probably funds its troops better, and solitudes streets are much nicer then most cities.\r\n\r\nInstallation - simply move the Texture folder into your datafolder, merge it with an already existing Texture folder if needed.\r\n\r\nUninstallation - Go into Data, Textures, Armor, Stormcloaks then remove the three folders marked with solitude-blah-de-blah-blah in the folder, I\\'ll get the exact names later.\r\n\r\nA small note, you may notice on the First and Second Image the Neck-scales are different for the Argonian that nothing to do with this mod, thats this one here - http://www.skyrimnexus.com/downloads/file.php?id=981\r\n\r\n\r\nI\\'m not all to good with this, though to improve on this.. perhaps that trim at the hem of the tunic could be made a nice gold or black, the leggings black, the scales a darker coal-type color perhaps.. andthe sleeves under the chainmail made invisible. I don\\'t even know how to do invisible textures :< I\\'m somewhat content with how it is for now, but these improvemants wouldn\\'t go amiss!\r\n\r\nNote: this works for both genders. helmates done up nice too.",
  "categoryId": "54",
  "version": "",
  "author": "Vearos",
  "createdUnix": "1322175712",
  "updatedUnix": "1322175994",
  "containsAdultContent": false,
  "uploadedBy": "Vearos",
  "primaryFile": null,
  "files": [
    {
      "fileId": "3620",
      "name": "Redstormcloaksinsolitude",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "664",
      "fileName": "Redstormcloaksinsolitude-1390-1.rar",
      "uploadedUnix": "1322175994",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/b5ee4e589646437737836d3297103687767f73e4c5b382d5b3b426ca7810f26e/analysis/1406443803/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Redstormcloaksinsolitude-1390-1.rar?fid=3620&ttl=1535754948&ri=8192&rs=8192&setec=1296b76adaf0a6cd0ae43c4f3ef093b1"
    }
  ]
}