{
  "modId": 13975.0,
  "modName": "Resource Bonanza",
  "summary": "The Resource Bonanza is a resource hub for players to collect any imaginable material for crafting and craft it within the same zone.",
  "descriptionHtml": "The Resource Bonanza is a resource hub for players to collect any imaginable material for crafting and craft it within the same zone. Resource Bonanza is a dungeon that resides in Whiterun, allowing for a crafting room with a mine shaft built into it. There is a map marker available for quick travel to the Resource Bonanza which faces you away from the sewer door entrance on teleport. \r\n\r\nThe crafting area has chests available for tradeskills that contains just about every item you could need for Alchemy, Blacksmithing, Tanning, Woodcutting, and Cooking. In this area is also the furniture required to craft with, so you can gather any necessary materials and then make an item in the same room! After a long day of gathering ore in the mine shaft, you can take a trip back up to the surface and smelt those ore into ingots and make glorious equipment! However, if you\\'re one who does not mind the lack of challenge to craft, there are chests easily available with ores and ingots.\r\n\r\nThe mine shaft is intended to be used for unlimited ore gathering in one location thanks to a script provided by TheONLYPantha, which you can get [url=file.php?id=9215]here[/url].\r\n\r\nAlong with crafting needs, there are two new NPCs that are available within the Resource Bonanza, which are Vance the Barkeep and David the Thunder. Vance is a vendor that sells various armors and weapons based on your level and has a base amount of 20,000 gold, so you can sell anything to him without worrying about his gold limit. David is a custom companion that will soon be voiced (or so I hope!), and should bring quite an enjoyable atmosphere to your adventures with him.\r\n\r\nIf you have any recommendations for additional features to my Resource Bonanza, please feel free to share your thoughts.",
  "categoryId": "73",
  "version": "1.0.1",
  "author": "Wigglez",
  "createdUnix": "1333051091",
  "updatedUnix": "1333053928",
  "containsAdultContent": false,
  "uploadedBy": "Wigglez",
  "primaryFile": null,
  "files": [
    {
      "fileId": "48038",
      "name": "Resource Bonanza v1-0-0 Release",
      "version": "1.0.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "72",
      "fileName": "Resource Bonanza v1-0-0 Release-13975.rar",
      "uploadedUnix": "1333051215",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/882c501703989bd666ed9a63b331487187ae0d8ca1fee673e532902fd1cade7a/analysis/1406786526/",
      "changelogHtml": " Initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Resource%20Bonanza%20v1-0-0%20Release-13975.rar?fid=48038&ttl=1535777220&ri=8192&rs=8192&setec=a6e7923b65532061a9fcea4004faabc8"
    },
    {
      "fileId": "48045",
      "name": "Resource Bonanza",
      "version": "1.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "72",
      "fileName": "Resource Bonanza-13975-1-0-1.rar",
      "uploadedUnix": "1333053928",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/f250c8e33d9530c31031f687b67f10adb4ea4362c62762f596fe78cd403f9ccc/analysis/1406786584/",
      "changelogHtml": " Fixed vendor gold <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Resource%20Bonanza-13975-1-0-1.rar?fid=48045&ttl=1535777220&ri=8192&rs=8192&setec=f529716f454c1395df9e3f532c54e891"
    }
  ]
}