{
  "modId": 13971.0,
  "modName": "Summon Ball Lightning",
  "summary": "Drawing upon the powers of both Conjuration and Destruction magics, draw raw energy from the Elemental Planes and channel it into an unstable ball of electricity that distracts, stuns, shocks, and knocks down your foes.",
  "descriptionHtml": "Description\r\n===========\r\nDrawing upon the powers of both Conjuration and Destruction magics, draw raw energy from the Elemental Plains and channel it into an unstable ball of electricity that distracts, stuns, shocks, and knocks down your foes.\r\n\r\nAlso available on Steam Workshop:\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=19914\r\n\r\nLocation\r\n========\r\nFind the spell tome on Farengar\\'s desk in Dragonreach. \r\n\r\nTips\r\n=====\r\nThis spell is VERY random. I\\'ve had it take out entire groups of enemies in seconds, and I\\'ve had it leave even weak monsters almost unscathed. Its initial cast cost is quite low but without the Destruction Master perk it will suck your Magicka dry in seconds. Generally I had the best luck dropping this in a room full of enemies, then backing away and letting them try to attack it. You can also drop it, then stand near it, kiting around and letting it deal damage for you. \r\n\r\nDetails\r\n=======\r\nThis spell creates a Ball Lightning at the target location. Think of it as sort of a super-hazard, or possibly a bug zapper.\r\n\r\nBall Lightning is invulnerable to damage but has a duration of 30 or 60 seconds, based on the Elemental Potency perk.\r\n\r\nThe Ball Lightning will randomly strike nearby foes with Thunderbolt, draining 80 Magicka per strike (40 with Destruction Mastery). If you have Shock Augmentation, \r\nfoes will be staggered or knocked down. \r\n\r\nAnyone that come in contact with the Ball Lightning has a high chance of being struck by lightning and flung a considerable distance. If this happens, they will also be stunned, dropping them out of combat. They\\'ll also be blinded, permanently reducing their detection range.\r\n\r\nAnyone stupid enough to attack the Ball Lightning will get zapped repeatedly.\r\n\r\nThe Ball Lightning will explode after its duration, causing a knockdown.\r\n\r\nIt will continuously drain your Magicka for its duration, but will drain less with Destruction Mastery.  If you run out of Magicka, the Ball Lightning will explode immediately. \r\n\r\nThe Summoner perks correctly affect the maximum casting distance.\r\nAugmented Shock level 1 causes a stagger of nearby foes with each strike.\r\nAugmented Shock level 2 causes a knockdown of foes struck.\r\nElemental Potency increases the duration of the ball.\r\nDestruction Mastery halves the Magicka drain and the cost of each strike.\r\nThe Disintegrate perk... well, works ;)\r\n\r\nIncompatibility\r\n===============\r\nStealth Magic will apply a damage bonus to the Thunderbolt strikes and sometimes will display \\\"Stealth Magic Attack\\\" inappropriately. It doesn\\'t cause any actual problems, though.\r\n\r\nKnown Issues or Bugs\r\n====================\r\nTHIS SPELL IS VERY SCRIPT-INTENSIVE. That means you need a fast CPU (NOT graphics card!) for it to work right. Slow CPUs will result in casting glitches, particularly if you cast it repeatedly.\r\n\r\nSometimes the lightning bolts in the appearance animation get \\\"stuck\\\" and fire repeatedly throughout the duration of the ball. This doesn\\'t cause problems but it does make a lot of noise. Doesn\\'t happen often.\r\n\r\nThe more dead enemies there are, the less often the Thunderbolt fires. This is due to the fact that Game.GetRandomActorFromRef() does not distinguish between dead and living actors, so I have to filter it after the fact. There doesn\\'t seem to be a way around this.\r\n\r\nIf the ball is cast an extreme distance away (farther than you\\'d be able to do so without using console commands) it can cause a CTD. \r\n\r\nTechnical\r\n=========\r\nThis spell uses a Summoned invisible actor to place a few statics at the target location. It places a series of mostly random invisible activators and uses these as both casters and targets. Because of an engine bug in how the lightning projectiles work, I have to cycle through a series of activators, rather than cast all the bolts from the actor. The script uses Game.GetRandomActorFromRef() to get a target, then only strikes if the target is not dead, a child (no sense targeting an invulnerable actor), in bleedout or the player. Otherwise it just creates a little Sparks bolt that deals minimal damage. In each loop, the script also checks for anyone within 100 units of the ball\\'s center and PushActorAways them.  \r\n\r\nInstallation\r\n=======\r\n\r\n1. Extract this archive to any folder and then copy the contents to Skyrim\\'s Data folder.\r\n2. Start Skyrim, click Data Files, and enable the ElemBallLightning.esp file.\r\n\r\nOr simply use Nexus Mod Manager. ;)\r\n\r\nUninstall\r\n=========\r\n\r\n\r\n1. Start Skyrim Launcher, click Data Files, uncheck the ElemBallLightning.esp file(s).\r\n2. Delete the files/folders associated with the mod.\r\n\r\nSkyrim\\\\Data\\\\ElemBallLightning.esp\r\nSkyrim\\\\Data\\\\Scripts\\\\ELEMSummonBallLightningActorScript.pex\r\nSkyrim\\\\Data\\\\Scripts\\\\ELEMBallLightningZapScript.pex\r\n\r\nOr just use Nexus Mod Manager.\r\n\r\nUpgrade\r\n=======\r\nJust overwrite everything, no problem.\r\n\r\nHistory\r\n=======\r\n0.5b, 2012/03/31 – Initial release to Nexus and Steam.\r\n\r\nContact\r\n=======\r\nverteiron@gmail.com\r\n\r\nCredits\r\n=======\r\nThanks to Bethesda for creating Skyrim and the Creation Kit.\r\nThanks to Valve for providing an easy way to take my first baby steps in mod publishing.\r\nThanks to NexusMods for showing me the RIGHT way to publish mods.\r\n\r\nTools Used\r\n==========\r\n7-Zip\r\nReadme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r\nCreation Kit\r\n\r\nLicensing/Legal\r\n===============\r\n\r\nYou must contact me and obtain my permission before re-packaging any part of\r\nthis mod. If I do not respond within 2 weeks, feel free to do whatever you\r\nlike with this mod.",
  "categoryId": "75",
  "version": "0.5b",
  "author": "Verteiron",
  "createdUnix": "1333045764",
  "updatedUnix": "1333228860",
  "containsAdultContent": false,
  "uploadedBy": "verteiron",
  "primaryFile": null,
  "files": [
    {
      "fileId": "48713",
      "name": "SummonBallLightning05b",
      "version": "0.5b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "SummonBallLightning05b-13971-0-5b.7z",
      "uploadedUnix": "1333228860",
      "modVersion": "0.5b",
      "virusScanUrl": "https://www.virustotal.com/file/936f3cdb7009ec8a52733a47924a65a7f2c68da0495dce34006c7b12743166bf/analysis/1406790157/",
      "changelogHtml": " Initial upload to Skyrim Nexus and Steam <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SummonBallLightning05b-13971-0-5b.7z?fid=48713&ttl=1535777215&ri=8192&rs=8192&setec=8d2b07b8239b2dcca5cf6981e7c5324e"
    }
  ]
}