{
  "modId": 13997.0,
  "modName": "Illia Companion -Red Hot Ice Mage- CBBEv3 and UNP -NSFW-",
  "summary": "An Illia to take home to mum, shes got dark red hair and bright green eyes and a fighting spirit that would make any Irishman proud&#33; UNP and CBBEV3 Versions available. ",
  "descriptionHtml": "Illia ver. 1.0 The Fighting Irish Elemental Ice Mage... \r<br />\r<br />***Caveat***: I attempted to Sandbox her in Darklight Tower, this is just that, an attempt. She could be anywhere based on the progression of your game. I have not tried this on her as a spouse so your results may vary there too. She is possibly one of the most difficult NPC Followers in the game because well she really isn&#39;t suppose to be a long-term follower. She might as well be called an Advanced User Companion. \r<br />\r<br />Try Typing Console Command: (~) (player.moveto 0004b22e) which should bring you to her. \r<br />\r<br />First, thank you for stopping by or trying out my mod. I have always liked Illia and found it\r<br />disappointing when Bethesda made her a one shot follower after completing \r<br />Darklight Towers. I have tried very hard to make her mechanically work besides her \r<br />obvious and much needed (in my humble opinion) makeover. I will warn you \r<br />now that this mod will have bugs when it comes to making her stay as your \r<br />companion. This is why there are only two Illia mods on the whole of the \r<br />Nexus currently (Now three). It is nearly impossible to permanently make her your \r<br />follower once you dismiss her even with the bat file I have included with \r<br />this mod. You still may have to click on her and type (setrelationshiprank player 4) in console \r<br />if any period of time has elapsed since you last carried her on a quest or took\r<br />out exploring. The only way I know to potentially keep her around permanently is to \r<br />marry her. If that appeals to you please continue on...  \r<br />\r<br />I would suggest and have used a multiple spouse mod called &#34;Multiple \r<br />Marriages-Spouse Dress Up-Rehousing-And More - WIP by Dudestia_wchen&#34; \r<br />\r<br />(http://skyrim.nexusmods.com/downloads/file.php?id=9378) \r<br />\r<br />It has an odd little quest to get it started but hey it works and works well. Illia \r<br />hopefully won&#39;t leave you ever again and it helps with some of the strange behavior she may\r<br />exhibit as a regular follower.  Author says its compatible with Followers Can Relax as well&#33;\r<br />\r<br />Stats: I have given her Calculated mechanics at level 30 but all of her spells and perks are the same as in-game. (Why mess with a good thing?)\r<br />Inventory: Dagger and NO CLOTHES&#33;&#33;&#33; She will appear nude. \r<br />Voice: Same as in-game\r<br />Hair: Custom Red hair coloring by me with style by (*)Apachii Hair\r<br />Eyes: Bright Green (*)RANs Eyeliner\r<br />Replacer - v1_0\r<br />Face: (*)Bella&#39;s Better Female Faces - Makeup Version 1 with No Shine\r<br />Body: (*)Dimonized UNP or CBBEV3 (I use (*)Navtsea&#39;s UNP body mod over it for more muscle tone.), (*)Glosstech v05 No Shine.\r<br />\r<br />If there is an (*) Asterisk by the named items above you will &#34;need&#34; these files to make her look like my mod of Illia in the images I uploaded.\r<br />\r<br />Easy Install: Use NMM or manually install the BSA, ESP and BAT Files in your Skyrim Data Folder. \r<br />\r<br />***Using the Bat File is simple. place the &#34;Follower&#34; file in your Skyrim Data file and then in-game hit ~ for the console and simply click on Illia&#39;s character so her number appears and then type in console &#34;bat follower&#34; (without quotation marks) and you are done. She will follow you all over and then hopefully return to Darklight Tower when you dismiss her.*** (NOTE) You still may have to type (setrelationshiprank player 4 ) even after you use the bat file to make her follow you again. \r<br />\r<br />If there is an (*) Asterisk by the named items above you will &#34;need&#34; these files to make her look like my mod of Illia in the images I uploaded.\r<br />\r<br />*One Important Note* To get the hands to match in Navetsea&#39;s mod you need to copy the meshes from the Dimonized UNP MAIN folder to your Data Meshes Folder then overwrite with Navetsea&#39;s file. If you think this is a pain in the ass, just use the Dimon mod without Navetsea&#39;s mod. If you want a better looking body, female nether region and like your ladies fit, Navetsea has an excellent mod and is recommended&#33; \r<br />\r<br />***(POSSIBLE FIXES IF SHE IS DISPLAYING STRANGE BEHAVIOR)***\r<br />\r<br />Anytime a mod is created from an existing nontypical-companion NPC they can be buggy. Here are a few fixes you can try.\r<br />\r<br />Try loading a new save and then closing the game and restarting Skyrim. \r<br />\r<br />Console Commands: You have to click on her first in console to show her reference number (0004b22e).\r<br />\r<br />Use command in console (setrelationshiprank player 4) \r<br />\r<br />Console command for marriage (addfac 19809 1) and the above console command to set relationship rank after it.\r<br />\r<br />Use the optional bat file included with this mod.\r<br />\r<br />For a list of various console commands look here; http://www.uesp.net/wiki/Skyrim:Console\r<br />\r<br />My take on Makeup on Female and Male NPC&#39;s not being &#34;Lore Friendly&#34;\r<br />\r<br />There are a lot of people playing this game that think the use of make-up is not lore friendly and so they are hesitant about using character mods like mine that use makeup or beautification mods. I would ask you to consider these following historical tidbits in relation to being lore friendly. Makeup is documented to have been used by the Ancient Egyptians over 10,000 years ago by paleontologists. Makeup was also documented to be in use by the Greeks, Romans and other ancient societies, including tribal body and face painting by Ancient Briton and Germanic tribes. To me it is completely plausible for makeup to be used in Skyrim given Bethesda supplied it and used it in the game on its own NPC&#39;s. Inescapably Skyrim&#39;s lore is tied to our history in some way shape or form, the latest &#34;trend&#34; of having NPC&#39;s look more natural is more likely a current trend in modern use of makeup and not a direct reflection on the lore of this game or any game that that bases its lore partially on human medieval and ancient history. It is inarguable that Skyrim spans the times from early man to the late 16th century with the various in-game elements it provides us. Note the use of mammoths and saber tooth cats and then fast forward to some of the more modern items in the game such as steel bear traps (which were recorded to be first in use in the late 16th century). It is perfectly fine and period to this game to have your characters kicking ass in black eyeliner, eye shadow and red lipstick. Don&#39;t let someone tell you it isn&#39;t lore friendly because it really is. Given the choices of races we have in Skyrim it may not only be lore friendly but very plausible on some characters depending on their status and rank within their society. In the end it is completely your choice on how you want your NPC&#39;s and PC&#39;s to look. I personally am not interested in having androgyny rule my game so I opted to creating and sharing my own female characters that cannot be mistaken for anything else. \r<br />\r<br />Thanks for reading,\r<br />\r<br />FalmerBane",
  "categoryId": "66",
  "version": "1.0",
  "author": "FalmerBane",
  "createdUnix": "1333087865",
  "updatedUnix": "1333406898",
  "containsAdultContent": true,
  "uploadedBy": "FalmerBane",
  "primaryFile": null,
  "files": [
    {
      "fileId": "48133",
      "name": "IIllia Companion -Red Hot Ice Mage- UNP Version",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2222",
      "fileName": "IIllia Companion -Red Hot Ice Mage- UNP Version-13997.7z",
      "uploadedUnix": "1333087959",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7d764076018a9e14018b6ee1b5cc948fa22a20a13ee1b4f20f88318ee2104931/analysis/1406787124/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/IIllia%20Companion%20-Red%20Hot%20Ice%20Mage-%20UNP%20Version-13997.7z?fid=48133&ttl=1535777257&ri=8192&rs=8192&setec=9e2130c469007593dfeb19dec4ea8053"
    },
    {
      "fileId": "49465",
      "name": "IIllia Companion -Red Hot Ice Mage- CBBEV3 Version",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2224",
      "fileName": "IIllia Companion -Red Hot Ice Mage- CBBEV3 Version-13997-1-1.zip",
      "uploadedUnix": "1333406898",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/47f20b834ee822edc85a9bb4b1d29b55b78cc80cd5cfe779b26b51a00b488bd7/analysis/1406794086/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/IIllia%20Companion%20-Red%20Hot%20Ice%20Mage-%20CBBEV3%20Version-13997-1-1.zip?fid=49465&ttl=1535777257&ri=8192&rs=8192&setec=f9aa8b1f68350c7a25ed8b8c58bcb154"
    }
  ]
}