{
  "modId": 14001.0,
  "modName": "Marry My Wife",
  "summary": "Here I put together a lot of things I wanted out of Lydia, the housecarl. Now she looks better, can\\'t be killed, is a ranged class and more.",
  "descriptionHtml": "Using my lovely wife as a reference, I gave everyone\\'s favorite housecarl, Lydia, a make over. But hey, it\\'s not just the looks that have changed.\r\n\r\nHere is a list of changes I made to her:\r\nFirst and foremost, she is now Essential, and can not be killed.\r\n\r\nI changed her name to my wifes favorite RP character name, Arryanna.\r\n\r\nClass from Warrior to Ranger\r\n\r\nFighting style to Missile\r\n\r\nDefault Gear to some simple leather armor (no weapons)\r\n\r\nEquiped with elven bow, elven sword, elven shield, and 100 elven arrows (you will need to supply her with arrows. A small price to pay not having a default bow. Followers tend to use the crap default over a better one in their inventory.)\r\n\r\nChanged her dialogue for trading to \\\"What would you like me to carry?\\\" Sounds way less unhappy, not befitting such a follower! Now she cooks, fights, and carries your stuff with no complaints! (Wish THAT part was real)\r\n\r\nChanged her level cap to 100. Please note, to bring her to your current level as your progress through the game, dismiss her, open the console, select her, type \\\"disable\\\" (no quotes), then \\\"enable\\\" (no quotes), and then close the console. And she is now your level, yay!\r\n\r\nOh, and as a bonus, she wears a sexy nighty to sleep!\r\n\r\nThis is my first addon, feedback is appreciated! Enjoy it, as I may have signed my death warrent creating this...",
  "categoryId": "66",
  "version": "1.1",
  "author": "Elite Goliath",
  "createdUnix": "1333104631",
  "updatedUnix": "1333314350",
  "containsAdultContent": false,
  "uploadedBy": "elitegoliath",
  "primaryFile": null,
  "files": [
    {
      "fileId": "49072",
      "name": "Marry My Wife",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "49",
      "fileName": "Marry My Wife-14001-1-1.zip",
      "uploadedUnix": "1333314350",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/432766d2a4448c8b2b87497021107a6c4576a60cacb0ce95b4a97ded10e7b4fe/analysis/1406792008/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Marry%20My%20Wife-14001-1-1.zip?fid=49072&ttl=1535777261&ri=8192&rs=8192&setec=e09d7af6ae50d809040d4fd9228d58f0"
    }
  ]
}