{
  "modId": 14003.0,
  "modName": "Hvergelmir&#39;s Redesigned Housecarls - HRH",
  "summary": "Hvergelmirs Redesigned Housecarls - HRH is first and foremost created for my own personal use, so if you don&#39;t like what you see here then move on.\r<br />The intention is to give all Housecarls in Skyrim (and perhaps later expand the mod to give all unique followers) a visual overhaul to make them a bit more interesting and pleasing to look at ",
  "descriptionHtml": "[img]http://lthot.dk/har/header_hrh.png[/img]\r<br />\r<br />[img]http://lthot.dk/har/change_log.png[/img]\r<br />[color=#af8c46]01-05-12 - v0.3 update[/color]\r<br />Improved Lydia and Argis tint masks. Lydia now has less dark lips.\r<br />\r<br />[color=#af8c46]16-04-12 - v0.2 update[/color]\r<br />Gave Argis a visual overhaul. Changed Lydia to be more true to vanilla Skyrim appearance.\r<br />\r<br />[color=#af8c46]30-03-12 - v0.1 initial release[/color]\r<br />Gave Lydia a visual overhaul.\r<br />\r<br />[img]http://lthot.dk/har/introduction.png[/img]\r<br />Hvergelmirs Redesigned Housecarls - HRH is first and foremost created for my own personal use, so if you don&#39;t like what you see here then move on.\r<br />The intention is to give all Housecarls in Skyrim (and perhaps later expand the mod to give all unique followers) a visual overhaul to make them a bit more interesting and pleasing to look at - all while (attempting) to not stray too far from the original design.\r<br />To archive this HRH does what most other mods of this style does, change facial features, make-up and possibly even hairstyle. But, here is the part that most of these mods does NOT do. I&#39;ve made my own higher resolution tint mask (the mask applied on top of the face texture that has the make-up data). The result is much more detailed and interesting make-up tint mask than the default generated one.\r<br />\r<br />Not only that, but HRH makes each Housecarl Essential (unable to die) and giving them the ability to level alongside you past the default lvl 50 cap.\r<br />\r<br />[img]http://lthot.dk/har/what_it_does.png[/img]\r<br />[img]http://lthot.dk/har/dot.png[/img] Each Housecarl will be given a major (or minor) visual overhaul to make them more pleasing or interesting to look at - give them a bit more unique look.\r<br />[img]http://lthot.dk/har/dot.png[/img] A higher resolution hand painted tint mask (make-up) is given to each Housecarl.\r<br />[img]http://lthot.dk/har/dot.png[/img] Housecarls are now Essential, ergo they cannot die.\r<br />[img]http://lthot.dk/har/dot.png[/img] Removed Housecarls level cap so they can level past the default 50.\r<br />[img]http://lthot.dk/har/dot.png[/img] Housecarls still wear Nordic Steel as default armor, but it is unequipable and removable.\r<br />\r<br />HRH is for you if you&#39;ve grown weary of the boring looks of the vanilla housecarls. It is of course subjective whether or not you&#39;ll find these new looks an improvement or not - each to their own, right?\r<br />\r<br />[img]http://lthot.dk/har/current_progress.png[/img]\r<br />[img]http://lthot.dk/har/dot.png[/img][color=#00aa00]Lydia - Completed[/color]\r<br />Lydia now has less masculine face features. Instead of the previous black / dark lips she now has a dark purple tint (I may change this later). She has more feminine eyebrows.\r<br />\r<br />[img]http://lthot.dk/har/dot.png[/img][color=#00aa00]Argis the Bulwark - Completed[/color]\r<br />Argis has been given a some minor changes to his face, no monkey lips and no huge nose (but still somewhat large). The major change lays in the face tint mask, he now has a unique viking tattoo.\r<br />\r<br />[img]http://lthot.dk/har/dot.png[/img][color=#aa0000]Calder[/color]\r<br />\r<br />[img]http://lthot.dk/har/dot.png[/img][color=#aa0000]Iona[/color]\r<br />\r<br />[img]http://lthot.dk/har/dot.png[/img][color=#aa0000]Jordis the Sword-Maiden[/color]\r<br />\r<br />[img]http://lthot.dk/har/plans_and_ideas.png[/img]\r<br />[img]http://lthot.dk/har/dot.png[/img] Perhaps expand to other followers in the future.\r<br />[img]http://lthot.dk/har/dot.png[/img] Perhaps make the appearances more unique with more unique face tint masks.\r<br />[img]http://lthot.dk/har/dot.png[/img] Perhaps expand even further to a &#34;beautiful people&#34; mod? Who knows...\r<br />\r<br />[img]http://lthot.dk/har/faq.png[/img]\r<br />[img]http://lthot.dk/har/q.png[/img] Why is my Housecarl naked?\r<br />[img]http://lthot.dk/har/a.png[/img] Because I removed the &#34;standard&#34; outfit so you can remove or replace armor with any appeal of your preference. Housecarls will now appear naked until you&#39;ve opened their trade window and closed it again. If that doesn&#39;t work you should get same result by re-equipping any of their armor or clothes.\r<br />\r<br />[img]http://lthot.dk/har/q.png[/img] My Housecarl doesn&#39;t look different, but has a gray face.\r<br />[img]http://lthot.dk/har/a.png[/img] This is a load order issue, make sure HRH load AFTER any other mod that changes Housecarls. Put HRH in the bottom of your load list.\r<br />\r<br />I&#39;ll put any relevant question you may have here that could enlighten other users.\r<br />\r<br />[img]http://lthot.dk/har/installation_and_uninstallation.png[/img]\r<br />It is recommended to install Hvergelmirs Redesigned Housecarls - HRH with Nexus Mod Manager.\r<br />\r<br />To manually install Hvergelmirs Redesigned Housecarls - HRH, use either WinRar or 7zup to extract the files to: [b]Steamsteamappscommonskyrim[/b]\r<br />If asked to override, click yes. Please keep in mind this will override any other face tints you&#39;ve currently have installed.\r<br />\r<br />To manually uninstall Hvergelmirs Redesigned Housecarls - HRH, delete the facetint folder inside textures found here: [b]Steamsteamappscommonskyrimdatatexturesactorscharacterfacegendata[/b]\r<br />Please keep in mind this will delete any other face tints you currently have installed. If you know what you&#39;re doing you can enter the facetint folder and delete each tint mask manually as you see fit.\r<br />\r<br />I have a bunch of highly recommended (but not required) mods to be used with HRH (HRH was designed with these mods):\r<br />[img]http://lthot.dk/har/dot.png[/img] [url=http://skyrim.nexusmods.com/downloads/file.php?id=2666]Calientes Female Body Mod Big Bottom Edition -CBBE-[/url] - Either CBBE or UNP\r<br />[img]http://lthot.dk/har/dot.png[/img] [url=http://skyrim.nexusmods.com/downloads/file.php?id=6709]DIMONIZED UNP female body[/url] - Either CBBE or UNP\r<br />[img]http://lthot.dk/har/dot.png[/img] [url=http://skyrim.nexusmods.com/downloads/file.php?id=6554]CBBE skin texture V2 V3 plus Thepal and UNP compatible[/url] - face and body textures.\r<br />\r<br />Feel free to test with other face and body models and textures. If successfully working and looking fine you&#39;re welcome to inform me so I can consider them as recommendations.\r<br />\r<br />[img]http://lthot.dk/har/credits.png[/img]\r<br />This may seem cliché, but thanks to Bethesda for creating the Elder Scrolls series.\r<br />Thanks to every one of you so far that have endorsed any of my mods&#33;\r<br />Thanks to every one of you so far that have voted for any of my mods&#33;\r<br />\r<br />[img]http://lthot.dk/har/distribution_permission.png[/img]\r<br />You may not under any circumstances use my facetint textures for a mod of your own without my explicit written permission.\r<br />If you see this mod distributed at any other place than on SkyrimNexus that is NOT found in the mirrors list, it is being distributed illegally. Please contact me here if you find such case. If the website is in a foreign language that you speak, it would be of great help for me if you contacted them yourself and notified them of this on my behalf.\r<br />\r<br />[img]http://lthot.dk/har/additional_information.png[/img]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=3261]Hvergelmir&#39;s Armor Retexture - HAR[/url] is my first public released TES mod. I have previously done personal retexturing jobs for Morrowind and Oblivion (though nothing major). As this is my first mod release, I&#39;d like you people to go easy on me and support me in any way possible.\r<br />Some of you may notice the above average quality of my texture mod, there&#39;s a simple explanation for that. I&#39;m a professional graphic designer and artist. I am also a system developer though it is irrelevant in this connection.\r<br />I appreciate any help and ideas you may have to improve this mod - just don&#39;t bomb me with your personal preferences and concerns. This is my mod after all, and I&#39;ll be doing it my way.\r<br />\r<br />I am open to suggestions and collaboration work on other mods, got any great ideas feel free to contact me. My strong side is mainly (re)texturing, but I am flexible and should be suitable for other jobs.\r<br />\r<br />[img]http://lthot.dk/har/other_mods.png[/img]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=3261]Hvergelmir&#39;s Armor Retexture - HAR[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=7045]Hvergelmir&#39;s Shield Retexture - HSR[/url]\r<br />Hvergelmir&#39;s Redesigned Housecarls - HRH\r<br />\r<br />Read my profile page if you want to know more about me.\r<br />- Hvergelmir",
  "categoryId": "33",
  "version": "v0.3",
  "author": "Hvergelmir",
  "createdUnix": "1333108187",
  "updatedUnix": "1335867008",
  "containsAdultContent": false,
  "uploadedBy": "lthot",
  "primaryFile": null,
  "files": [
    {
      "fileId": "57774",
      "name": "HRH",
      "version": "v0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "441",
      "fileName": "HRH-14003-v0-3.rar",
      "uploadedUnix": "1335866940",
      "modVersion": "v0.3",
      "virusScanUrl": "https://www.virustotal.com/file/e5c765df319993ae3390456452dfd1a991b93ba2657a3083ec88cf83af55ff56/analysis/1406858348/",
      "changelogHtml": " Improved Lydia and Argis tint masks. <br/> \n  Lydia now has less dark lips. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HRH-14003-v0-3.rar?fid=57774&ttl=1535777263&ri=8192&rs=8192&setec=c49a867dadb8968a4982b30b6b97ba51"
    },
    {
      "fileId": "57775",
      "name": "HRH - BSA archive version",
      "version": "v0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "370",
      "fileName": "HRH - BSA archive version-14003-v0-3.rar",
      "uploadedUnix": "1335867008",
      "modVersion": "v0.3",
      "virusScanUrl": "https://www.virustotal.com/file/b9ca4e9f0dd8b0a68fcfe1fab1e843ef15ffc8f8dadef0ed95cbc61ddd313163/analysis/1406858349/",
      "changelogHtml": " Improved Lydia and Argis tint masks. <br/> \n  Lydia now has less dark lips. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HRH%20-%20BSA%20archive%20version-14003-v0-3.rar?fid=57775&ttl=1535777263&ri=8192&rs=8192&setec=e274e19373e6736b69ae99194373945d"
    }
  ]
}