{
  "modId": 14013.0,
  "modName": "Alteration and Restoration Redux",
  "summary": "Wards and Armor spells have always seemed a little off to me... why bother leveling mage armor when you can just use Dragonhide? Why cant healing spells damage undead? Why are durations so short, and why can\\'t we at least use helmets with mage armor (for dragon masks). If you\\'re anything like me, you\\'ve been using many different mods to address",
  "descriptionHtml": "Wards and Armor spells have always seemed a little off to me... why bother leveling mage armor when you can just use Dragonhide? Why can’t healing spells damage undead? Why are durations so short, and why can\\'t we at least use helmets with mage armor (for dragon masks). If you\\'re anything like me, you\\'ve been using many different mods to address these issues, with limited satisfaction. This mod aims to increase usability and make sense of Alteration and Restoration spells   so that they are relevant all game long while minimizing the stress of constantly maintaining enchantments, along with an number of optimizations and improvements.\r\n\r\nAlso available on Steam Workshop: http://steamcommunity.com/sharedfiles/filedetails/?id=19532\r\n\r\nFEATURES (v1.06):\r\n-Grand Healing now also damages undead.\r\n-Tooltips updated on healing spells to indicate the damage dealt is equal to half the healing amount of the spell to undead.\r\n\r\nMOD FEATURES:\r\nALTERATION CHANGES:\r\nMage Armor:\r\n- Now gives 2x, 3x, 4x armor rating (instead of 2x,2.5x,3x)\r\n\r\nDuration of spells:\r\n-All “flesh” spells are now 2 minutes in duration including Dragon hide(see below for changes)\r\n\r\nDragonhide\r\n-No longer raises your armor immediately to the cap.\r\n-125 armor (500 armor with mage armor - see theory crafting)\r\n-Is now a one-handed spell, 1.5 second cast time.\r\n\r\nStability perk:\r\n-In addition to increasing duration by 50% now passively adds armor based on your Alteration skill\r\n-70% of your Alteration skill (70 max)\r\n-Shows up on active affects like you would expect any other buff to.\r\n\r\nHelmets:\r\n-No longer checked with Mage armor perk\r\n\r\nRESTORATION CHANGES:\r\n\r\nAdded \\\"Cure Disease\\\"(Added in v1.05)\r\n-Apprentice skill level, 0.5 second charge cast, 225 base mana\r\n-Can be bought from Restoration trainer(Colette) at the Mages Guild in Windhelm\r\n-Can be found at random places in the world, typically shrines and Mage\\'s books shelves(Some are, Farengar\\'s main side room, Archmages quarters, Whiterun\\'s Temple of Kynerath, and more)\r\n-Note: It is MEANT to be expensive at 225 mana. Cure Disease was not put in the game so that it would make players use the potions more often. 225 mana is peanuts for a mage, but requires at LEAST having 25 restoration and apprentice perk to be cast(96 mana-ish). If you want to be able to cast it in the field as a non-mage, it needs to be hard to cast.\r\n\r\nHealing spells and undead\r\nTargeted healing spells will now harm undead for 50% of the healing amount instead of doing nothing. This is a classic RPG element that I felt was missing largely from the original game. Picking up Necromage will further increase this damage.\r\n\r\nNecromage perk(Updated in v1.05):\r\n-On top of it\\'s normal affect, it now also reduces the Hp cost of Equilibrium by 33% per second(-8 hps)\r\n-This opens up the ability to play a \\\"Blood Mage\\\" while also giving a little boost to an otherwise underrated perk.\r\n-Fixed gameplay bug where if the PC was a vampire all his enchantments became 25% better(This was in vanilla at the oversight of the dev\\'s. Some of you may be upset by this change, but this perk breaks a lot of game systems and has serious balance issues - 100% Magic Absorbtion being one of them, and ultimately - this mod is about balance as much as it is about choice). (Added in v1.05)\r\n\r\nWards\r\n-All wards now cost 50% less per second (To encourage use but not make fortify restoration obsolete)\r\n-Block perks now affect wards(See theorycrafting for reasoning):\r\n-With the “Deflect arrow” perk, wards make you immune to arrows while channeling the spell. \r\n-You must charge your ward for about half a second before the arrow protection kicks in with lesser ward. Higher level wards will reduce this charge time. This was done to be make it so you couldn\\'t \\\"Catch\\\" arrows that were already in the air just like with spells. (Added in v1.05)\r\n-Main block perk(shield wall) will now increase your wards protection by 10% per level\r\n-NOTE: I updated shield wall’s tooltip to accurately reflect what it actually changes. In game it says it scales as 20/25/30/35/40%. This is not accurate and actually scales at 10% per level. This was not something I changed(you can find the same information on the wiki), I just updated the tooltips to reflect what values they really change.\r\n\r\nTHEORYCRAFTING:\r\n\r\nArmor spells:\r\nBecause Dragonhide was an instant 80% this made getting mage armor worthless and it really just didn’t make much sense. Because of this, I changed it to be 150 armor (which can then total to 500 with max Mage armor). This adds a sense of consistency missing from the original system. This coupled with the new stability perk which can grant 70 armor at max level of alteration will put you at the armor cap and back at the 80% reduction. This makes for a more interactive and choice-driven way to hit the armor cap (of 667 for mages due to the \\\"hidden\\\" value of armor granting a bonus 25 to your armor rating - See the UESP on armor rating for more information) that makes more sense and feels seamless. The other 100 armor will most likely come from using a shield(something that many mages did anyways, as it does not affect mage armor in vanilla.)\r\n\r\nHelmets:\r\nThe removal of helmets from Mage armor is purely an aesthetic one. In my opinion the helmet is the most important aesthetic element of any character and the freedom of choice to dictate how you want to look should trump anything else.\r\n\r\nDuration(Updated in v1.02):\r\nDuration increasing mods is not a new or revolutionary idea, but one that demanded to be included in this kind of mod. 60 seconds is simply too often to be wasting magicka on what is essentially armor. 2 minutes is a good sweet spot between usability and the creators original intent and makes those duration perks slightly more enticing.\r\n\r\nWards and Blocking:\r\nWards were incorporated into the blocking tree simply because it makes sense that wards should be utilized in relatively the same way. Wards are used for projecticle/spells and shields for melee, with the pinnacle of both being the artifact “Spell breaker” which is the best of both worlds. This makes for a seamless transition from shield/ward to “Spell breaker” that feels very natural and conducive to the players sense of progression.\r\n\r\nTO DO:\r\nUser requests\r\nBugs if they arise\r\nBalance if necessary\r\n\r\nTHE REDUX SERIES:\r\nThis is a new series of mods I have planned that simply make some of the worse perks more in line with the rest in the tree. These are designed to be small mods that allow the user to pick and choose what they feel needs a little brushing up. These won\\'t be massive overhauls, just very small mods changing one area of gameplay.\r\n\r\nCHANGELOG:\r\nv1.02\r\n\r\nAdded Necromage: \r\n-On top of normal affect(Extra damage to undead), also reduces Equilibrium’s health cost by 10 per second.\r\n-This opens up the ability to play a \\\"Blood mage\\\" while also giving players a reason to pick up a slightly under rated skill. (Especially if you are a vampire)\r\n\r\nFlesh Spell Durations:\r\n-Flesh spells now last 2 minutes (down from 5 - made duration extending perks/enchantments useless)\r\n\r\nCheck out my development blog and other popular mods!:\r\nhttp://aertyr.tumblr.com/post/19128825167/aertyrs-list-of-all-created-work\r\n\r\nPLEASE CONTACT ME ON STEAM WORKSHOP FOR IMMEDIATE BUG REPORTS/REQUESTS",
  "categoryId": "93",
  "version": "v1.06",
  "author": "Aertyr",
  "createdUnix": "1333124272",
  "updatedUnix": "1351128754",
  "containsAdultContent": false,
  "uploadedBy": "Aertyr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "48225",
      "name": "Alteration and Restoration Redux",
      "version": "v1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "Alteration and Restoration Redux-14013.zip",
      "uploadedUnix": "1333124390",
      "modVersion": "v1.00",
      "virusScanUrl": "https://www.virustotal.com/file/3a3b00346653c885f6e22e507f668cacbbc00cf5f8e00e6e045a1fab6b704166/analysis/1406787726/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alteration%20and%20Restoration%20Redux-14013.zip?fid=48225&ttl=1535777279&ri=8192&rs=8192&setec=fdec1932d5ef7e8b79f5a47e4dcd1f33"
    },
    {
      "fileId": "48401",
      "name": "Alteration and Restoration Redux102",
      "version": "v1.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Alteration and Restoration Redux102-14013-v1-02.zip",
      "uploadedUnix": "1333162962",
      "modVersion": "v1.02",
      "virusScanUrl": "https://www.virustotal.com/file/e0061296599f50e56ab306a0e9207e3395a7ffe597b4a2ec54a8ba960cc0cce5/analysis/1406788386/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alteration%20and%20Restoration%20Redux102-14013-v1-02.zip?fid=48401&ttl=1535777279&ri=8192&rs=8192&setec=a9e38609eff94bf015f6c01305502fad"
    },
    {
      "fileId": "49209",
      "name": "Alteration and Restoration Redux105",
      "version": "v1.05",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "Alteration and Restoration Redux105-14013-v1-05.zip",
      "uploadedUnix": "1333338976",
      "modVersion": "v1.05",
      "virusScanUrl": "https://www.virustotal.com/file/07a013548d78c7cff5bd54b09eb36d18290caeabcc62c81ee3a3d7e8f4f75d61/analysis/1406792724/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alteration%20and%20Restoration%20Redux105-14013-v1-05.zip?fid=49209&ttl=1535777280&ri=8192&rs=8192&setec=df84a86dff487a261fb61ce53e190009"
    },
    {
      "fileId": "95655",
      "name": "Alteration and Restoration Redux106",
      "version": "v1.06",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Alteration and Restoration Redux106-14013-v1-06.zip",
      "uploadedUnix": "1351128754",
      "modVersion": "v1.06",
      "virusScanUrl": "https://www.virustotal.com/file/0a2a90aa281fc1799778b96a1462a99e7abde4d4439dff282285c816cd7958c5/analysis/1407235084/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alteration%20and%20Restoration%20Redux106-14013-v1-06.zip?fid=95655&ttl=1535777280&ri=8192&rs=8192&setec=9845749837cb1aac7f2cf1926d22d127"
    }
  ]
}