{
  "modId": 14021.0,
  "modName": "Zions Khajiit Guild",
  "summary": "{Adds a new guild to Skyrim.} Zion\\'s Guild was started by a group of Khajiits looking to make a fortune on their arena. 2.5hrs of quests, 4 repeatable quests. Weapons, Potions and shiny things. Hope you enjoy.",
  "descriptionHtml": "This MOD adds about 2.5 hours of Quests, New weapons to Smith (Pending you have completed the appropriate quest in the MOD), A new SHOUT to learn (Lighting Breath), 2 New Alchemy Ingrediants (Zions Life Root & Snozzberries), 3 Different Repeatable Quick Fire Challenges (Arena type mini quests that let you fight various \\\"bad guys\\\", Dragons, and Vanilla Mobs), Once main quest line is completed by the player all of the NPC\\'s in the guild (Except for Hazy) will give the option to be a Follower. 4 new followers total. A new Smithing Material used to make the new weapons \\\"Eternium\\\". 2 Radiant repeatable quests to aquire either a Potion from Magnis, or Eternium from Hazy. Magnis\\' potions buff 1 ability of your choice for 1 hour by 40%. All custom voice over work, No vanilla voice\\'s used for the NPCs added in this MOD. When you complete the Main quest line for the MOD you will end up in a \\\"New\\\" home for the ZKG crew and the Alchemy table in Magnis\\' room grants the user a 50pt Buff to their alchemy, and also when you use Spigett\\'s Enchanting table you get a 50pt buff to your Enchanting. When you first load your game with this MOD enabled it should auto start a quest and place an objective marker to the location to begin the adventure. \r\n************************************************************************\r\nFor full info and walk throughs refer to our home page\r\nhttp://www.zionskhajiitguild.tk/\r\n************************************************************************\r\nInstallation: \r\nEasy Mode via Nexus Mod Manager - Download with manager then double click it when it shows up in your mods tab list. Window should pop up saying ZKG was successfully installed etc...\r\n if you prefer manual then download, extract to your skyrim/data/ folder. Enable mod in Launcher. Ensure ZKG.esp is checked. Play, kill, win... Might be listed as Zions Khajiit Guild in the launcher but that should be a no brainer at that point. . . right. ? . ? . \r\n************************************************************************\r\nUninstall:\r\nDelete the following files from your Skyrim/Data/ Directory\r\nZKG.esp\r\nZKG.bsa\r\n************************************************************************\r\nThanks to MundaneRaptor for all your continuing work and help with the writing of the dialogue. He is working over time to make the actors come to life and clean up my horid audio recording. <3\r\n************************************************************************\r\n\r\n************************************************************************\r\nDifficulty ~ Medium / Hard. I try to make all encounters rely on some potion usage, and taking advantage of your abilities. I am not a fan of just auto attacking basically and winning. \r\n************************************************************************\r\nSince Patch 1.6 went live and ESP\\'s no longer cause NavMesh issues this mod and all required files are now in 2 files. ZKG.esp & ZKG.bsa\r\nSince Patch 1.7 In order to get custom NPC dialogues to work, you must load your game with the MOD. Make a save. Exit skyrim. Relaunch and load your new save you just made with the MODs running and Dialogues will work as intended.\r\n************************************************************************\r\nNote: This mod is not Lore friendly. There are repeatable quests such as summoning a dragon to kill and /farm if you want etc. . . It is intended to be a challenge and fun. The total exploiting of this to just farm mats , dragon souls though does technically consider this mod a cheat. So be for warned and I hope that part of it does not take you completely out of the immersion. The later ones are very tough on the harder difficulties even for the maxed out skills so have fun and i would love to see videos if you enjoy doing that thing. Much love as always and enjoy. \r\n************************************************************************\r\n************************************************************************\r\nVoice Actor Credits\r\n************************************************************************\r\nTee - Zionistic / IronLionZion\r\nMagnis - MundaneRaptor\r\nAlunAar - MundaneRaptor- \r\nHazy - Zionistic\r\nSpigett - BJ The DJ\r\nOld Man Dol - Zionistic\r\nPG 4 - Zionistic \r\nDren - Zionistic\r\nAlunAara - MundaneRaptor\r\nSodir - Michael Marino (The greatest Language arts teacher ever. Yes ever. ReadiT)\r\nV. Jr - My nephew (The best nephew ever)\r\n************************************************************************",
  "categoryId": "25",
  "version": "2.3",
  "author": "Iron Lion Zion",
  "createdUnix": "1333135179",
  "updatedUnix": "1357373964",
  "containsAdultContent": false,
  "uploadedBy": "ironlionzion4444",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000000077",
      "name": "Zions Khajiit Guild",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "43554",
      "fileName": "Zions Khajiit Guild-14021-2-3.rar",
      "uploadedUnix": "1357373964",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/eb3d939f1984c5794a95fd2a5053bc4c172b03de5f8bab7ef39a03bb4b45ad4e/analysis/1407337940/",
      "changelogHtml": " Undeleted and Disabled via Tes5Edit 30 misc Edits during production <br/> \n Removed 60+ bad edits that had refs floating around via Tes5Edit <br/> \n Added just the cleaned trimmed ESP as an optional download so people do not have to re download the .bsa <br/> \n Went through every ref made by this mod 1 by 1 to ensure complete cleaning not just the base filter in Tes5Edit <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Zions%20Khajiit%20Guild-14021-2-3.rar?fid=1000000077&ttl=1535777296&ri=8192&rs=8192&setec=b982daf0b2df376164126148259e2104"
    }
  ]
}