{
  "modId": 14026.0,
  "modName": "Skyrim - Directors Cut - German",
  "summary": "Die Erweiterung Skyrim - Director's Cut hat es sich zum Ziel gemacht, die deutsche Version von The Elder Scrolls V: Skyrim so gut es geht zu verbessern. Vorrangig geht es darum, fehlende Übersetzungen nachzuholen und Texte und Begriffe so anzupassen, dass sie auch zu den vorherigen Teilen der Reihe passen.",
  "descriptionHtml": "[center]\n<br />\n<br />[size=3][url=http://www.scharesoft.de/joomla/index.php?option=com_remository&amp;Itemid=27&amp;func=fileinfo&amp;id=2500][b]Download nur über ElderScrollsPortal.de[/b][/url][/size][/center]\n<br />\n<br />\n<br />Die [i]Erweiterung Skyrim - Director's Cut[/i] hat es sich zum Ziel gemacht, die deutsche Version von The Elder Scrolls V: Skyrim so gut es geht zu verbessern. Vorrangig geht es darum, fehlende Übersetzungen nachzuholen und Texte und Begriffe so anzupassen, dass sie auch zu den vorherigen Teilen der Reihe passen. Mit den beiliegenden inoffiziellen Patches werden zudem eine Vielzahl Fehler des eigentlichen Spiels, die die offiziellen Patches noch nicht korrigiert haben, behoben. Mit der Erweiterung könnt ihr außerdem alle englischsprachigen Texturen nun in deutscher Sprache vorfinden.\n<br />\n<br />\n<br />\n<br />[b][size=3]\"Diese Mod-Kombination aus dem Unofficial Skyrim-Patch der Community und einer verbesserten Übersetzung verbessert das Rollenspiel deutlich.\"[/size][/b]\n<br />- [i]PC Games, 06/2012[/i]\n<br />\n<br />\n<br />\n<br />Viele von euch wissen sicher, dass ich (Scharesoft) zusammen mit Deepfighter an der Übersetzung von The Elder Scrolls V: Skyrim beteiligt waren und wir bereits im Vorfeld viel Arbeit in das Spiel gesteckt haben. Genaueres dazu könnt ihr in der [url=http://www.scharesoft.de/news/artikel/die-deutsche-uebersetzung-von-skyrim-wir-waren-dabei.html]dazugehörigen Newsmeldung[/url] nachlesen. Insgesamt waren wir sehr zufrieden mit der guten deutschen Übersetzung des Spiels. Natürlich gab es aber während der Übersetzungsarbeiten kleinere Dinge, die wir gerne anders gehabt hätten, doch vieles war zeitlich einfach nicht mehr möglich oder anderes hatte Priorität. \n<br />\n<br />Mit der Erweiterung [i]Skyrim - Director's Cut[/i] möchten wir zusammen mit euch die Übersetzung des Spiels und alles was damit zusammenhängt so gut es geht verbessern. Wir gehen hier die Sachen an, die aus zeitlichen Gründen für die Übersetzer und Betatester nicht mehr möglich waren. Durch den Zusammenschluss mit den inoffiziellen Patches werden außerdem Fehler des eigentlichen Spiels korrigiert, die durch den offiziellen Patch noch nicht abgedeckt werden. \n<br />\n<br />Weitere sinnvolle Vorschläge und Verbesserungsideen sind jederzeit gerne gesehen! \n<br />\n<br />\n<br />[youtube]PWWR6n6QPYc[/youtube]\n<br />\n<br />\n<br />\n<br />[b][size=4]Features[/size][/b]\n<br />\n<br />Im Folgenden könnt ihr eine kleine Übersicht über die Features der Erweiterung finden. Einige von ihnen können optional aktiviert werden.\n<br />\n<br />[list][*]Fehlerhafte oder fehlende Übersetzungen in Dialogen, Gegenständen, Büchern, Orten und vielem mehr aus Skyrim, Dawnguard, Hearthfire und Dragonborn werden korrigiert.\n<br />[*]Inhaltliche Fehler werden falls möglich behoben, so dass das Spiel lorekonform wird.\n<br />[*]Deutschsprachige Texturen für alle Schilder, Karten und vieles weitere, die so gut wie möglich den originalen Texturen entsprechen.\n<br />[*]Sehr viele Fehler des Spiels, sogenannte Bugs, werden durch die inoffiziellen Patches behoben. Sie ergänzen den offiziellen Patch von Bethesda und werden immer an die aktuelle Version von Skyrim und den Addons angepasst.\n<br />[*]Viele weibliche NPCs tragen nun auch weibliche Namen (Beispiel: Statt Soldat der Sturmmäntel heißt es nun Soldatin der Sturmmäntel).\n<br />[*]Nordnamen tragen nun keine unpassenden Bindestriche mehr (Beispiel: Statt Silber-Blut heißt es nun Silberblut).\n<br />[*]Optional erhalten die Regionen eindeutige Namen. So erscheint bei Speicherständen oder Türen nicht mehr nur Himmelsrand, sondern stattdessen die passende Region (Beispielsweise Fürstentum Winterfeste oder Dämmerstern). Unter anderem wird dadurch das Auffinden der richtigen Speicherstände vereinfacht.\n<br />[*]Die Möglichkeit, Zwerge in Dwemer sowie Malachit in Vulkanglas umzubenennen.\n<br />[*]Korrekturen für das hochauflösende Texturenpaket von Bethesda (High Resolution Texture Pack) in einem eigenständigen Download.\n<br />[*]Neue deutsche Stringdateien mit der korrigierten Übersetzung als Grundlage für Modder und ihre eigenen Plugins und Übersetzungen. \n<br />[*]Die Fehler der Update.esm wurden ebenfalls korrigiert, so dass sie bedenkenlos mitgeladen werden kann.\n<br />[*]Modularer Aufbau, so dass Inhalte des Plugins nach eigenen Wünschen aktiviert oder deaktiviert werden können. Die einzelnen Dateien werden weiter unten genauer beschrieben.\n<br />[/list][size=4][b]\n<br />Download des Plugins\n<br />\n<br />[/b][/size]Wir empfehlen den Download über die Seite Scharesoft.de, da nur dort die vollständige Version mit allen zusätzlichen Inhalten zu finden ist.[list][*][url=http://www.scharesoft.de/joomla/index.php?option=com_remository&amp;Itemid=27&amp;func=fileinfo&amp;id=2500][b]Download über Scharesoft.de[/b][/url] (Vollständige Version)\n<br />[*][url=http://steamcommunity.com/sharedfiles/filedetails/?id=19576]Download über den Steam Workshop[/url] (Abgespeckte Version ohne optionale Inhalte)\n<br />[/list][b]\n<br />Optionales[/b][list][*][url=http://www.scharesoft.de/joomla/index.php?option=com_remository&amp;Itemid=27&amp;func=fileinfo&amp;id=2614][b]Fix für das High Resolution Texture Pack[/b][/url]\n<br />[/list]\n<br />Weitere Informationen, [b]Installationshinweise[/b] sowie Screenshots findet ihr in der [url=http://www.elderscrollsportal.de/ressourcen/skyrim-directors-cut-sdc.2500/field?field=readme][b]ausführlichen Online-Readme[/b][/url].",
  "categoryId": "95",
  "version": "5.6",
  "author": "Scharesoft sowie Ypselon und weitere",
  "createdUnix": "1333138360",
  "updatedUnix": "1511168863",
  "containsAdultContent": false,
  "uploadedBy": "Scharesoft",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74659",
      "name": "Skyrim - Directors Cut",
      "version": "5.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Skyrim - Directors Cut - Readmes-14026-1-07.7z",
      "uploadedUnix": "1342433283",
      "modVersion": "5.2",
      "virusScanUrl": "https://www.virustotal.com/file/e120a357020a2dc5de75b43632aef440c3a143346ab6a93e0f2d99ae2a88df3b/analysis/1407025935/",
      "changelogHtml": " -\tWolfspelz wurde in Eiswolfspelz umbenannt (sehr alter Fehler)\r<br />-\tKorrektur einiger Rüstungsteile die Knappen und Ritter vertauscht hatten\r<br />-\tUnofficial Skyrim Legendary Patch auf 3.0.7 aktualisiert <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20-%20Directors%20Cut%20-%20Readmes-14026-1-07.7z?fid=74659&ttl=1535777302&ri=8192&rs=8192&setec=9b3249cdd5246e06806d63c36c0357b2"
    },
    {
      "fileId": "1000244019",
      "name": "Skyrim - Directors Cut",
      "version": "5.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10",
      "fileName": "Skyrim - Directors Cut-14026-5-3.7z",
      "uploadedUnix": "1494500100",
      "modVersion": "5.3",
      "virusScanUrl": "https://www.virustotal.com/file/5b6e2d0fa5ad1cf956893b5ee0fe0fcd02c602124a2a45d42354242dfab1a5d7/analysis/1494500343/",
      "changelogHtml": " - Komplette Überprüfung und Anpassung sowie Korrekturen an den Strings\r<br />- Einige Anpassungen in den Audiofiles, damit sie besser zu den Strings passen\r<br />- Auf Unofficial Skyrim Legendary Patch 3.0.9f3 aktualisiert (Anpassung der Sprachdateien, Korrektur der Übersetzung)\r<br />- Neue Malachit zu Vulkanglas.esp (Nun mit aktualisierten Einträgen, Malachit wurde durch Vulkanglaserz ersetzt) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20-%20Directors%20Cut-14026-5-3.7z?fid=1000244019&ttl=1535777302&ri=8192&rs=8192&setec=22ce53c3c77993ffde11d50bdb96967f"
    },
    {
      "fileId": "1000260144",
      "name": "Skyrim - Directors Cut",
      "version": "5.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Skyrim - Directors Cut-14026-5-5.7z",
      "uploadedUnix": "1511168863",
      "modVersion": "5.6",
      "virusScanUrl": "https://www.virustotal.com/file/78d565779a4a3a91945bbad5d52f10300a04682bcb730f24bb669a00b80e29ac/analysis/1511169062/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20-%20Directors%20Cut-14026-5-5.7z?fid=1000260144&ttl=1535777303&ri=8192&rs=8192&setec=6e1c5ee5aa1a240d4931ef49908b075b"
    }
  ]
}