{
  "modId": 14038.0,
  "modName": "Owned",
  "summary": "This fixes theft and ownership bugs, plus removes ownership of cells and objects related to an NPC upon their untimely demise.",
  "descriptionHtml": "[b]NOTE: This mod is no longer being maintained, as I don\\'t have the time.  Anyone is free to pick it up.[/b]\r\n\r\n[size=10][b]OWNED![/b][/size]\r\n\r\n\r\n[size=3][i]\\\"It\\'s not theft if they\\'re already dead!\\\"[/i][/size]\r\n\r\nThis mod fixes theft and ownership issues, as well as removing ownership of places (cells) and things (objects) owned by an NPC when they die.  For example, if you murder a shopkeeper, all of their goods are up for grabs without the stigma of theft.  You can even sleep in their bed once they\\'re out of the way.\r\n\r\nIf you like this mod, please check out my ambiance noise realism mod, [url=http://skyrim.nexusmods.com/downloads/file.php?id=12621]Quieter World[/url].\r\n\r\n\r\n[size=5][b]Demo:[/b][/size]\r\n\r\nUser [url=http://skyrim.nexusmods.com/modules/members/index.php?id=4044339]Memorablelol[/url] was gracious enough to create a video demonstrating this mod.  Check it out [url=http://www.youtube.com/watch?v=awblcSrZEjw]here[/url]!\r\n\r\n\r\n[size=5][b]Change log:[/b][/size]\r\n\r\n1.1:  Ownership changes applied in all cells, towns, outside world.\r\n1.0:  Initial Release with changes applied in all Interior cells.\r\n\r\n\r\n[size=5][b]Known issues:[/b][/size]\r\n\r\nThe game doesn\\'t always apply the ownership flags correctly, so sometimes houses have items up for grabs but Potions aren\\'t.  It\\'s a bug in the game itself.\r\n\r\n\r\n[size=5][b]What this mod does:[/b][/size]\r\n\r\nWhen a \\\"head of faction\\\" NPC dies, a script runs to remove ownership over each and every individual cell and object owned by the NPC.\r\n\r\nI\\'ve fixed a number of cases of \\'Unnecessary Ownership\\'.  For instance, the Markath \\\"Hag\\'s Cure\\\" apothecary shop has ownership over ingredients in several dungeons and even other towns for no apparent reason.  What would otherwise be free loot is \\\"stolen\\\" by the player.  I\\'ve removed ownership of those so they are now free to pick up.\r\n\r\nI also removed redundant ownership rights over objects where the cell\\'s owner would have had ownership over the objects anyways.  This was primarily to ease my own data entry suffering and to not bog down the ownership removal script, saving performance.\r\n\r\n\r\n[size=5][b]What this mod does NOT do:[/b][/size]\r\n\r\nThis does not make \\\"essential\\\" NPC\\'s or children killable.  However, this script will run when they die (if they have any stuff).  I recommend you get a mod that does that.  Sorry, I don\\'t have any particular recommendations yet.  \r\n\r\nThis also does not go back and remove ownerships on NPC\\'s already killed, so its best to start a new game when using this.\r\n\r\n\r\n[size=5][b]Installation:[/b][/size]\r\n\r\nCopy the Owned.esp and the Scripts\\\\Owned_*.pex files to your Skyrim data directory as it is in the archive.  If the scripts aren\\'t in the right place, it won\\'t work.\r\n\r\nIf you just want the massive number of ownership changes as bug fixes, just install the owned.esp without the Scripts\\\\*.pex files.\r\n\r\n\r\n[size=5][b]Uninstallation:[/b][/size]\r\n\r\nRemove the installed files.  There is no way to go back and reinstate removed ownerships.\r\n\r\n\r\n[size=5][b]FAQ (READ THIS BEFORE ASKING)[/b][/size]\r\n\r\nQ: I added another mod that added new items and its theft to pick it up.  Why doesn\\'t this mod work with it?\r\n\r\nA: I\\'ll have to do a \\'compatibility addon\\' for it.  Unfortunately there\\'s no way in the scripting API to get a list of an NPC\\'s owned objects and apply the ownership removal based on that.  It has to be manually defined *sad face*.   For instance, the Midas compatibility allows the player to pick up the owners book without it being theft.\r\n\r\n\r\nQ: Why can I just take crops from farmers?  Can\\'t you make that stealing?\r\n\r\nA: I wish, but its a limitation with the game.  Crops are considered Tree objects, which don\\'t have any concept of ownership.  I\\'m looking into alternatives, though.\r\n\r\n\r\nQ: I\\'m in a mine where I can pick up anything except for a couple odd items.  I killed the foreman and the couple odd items can now be picked up, as expected thanks to this mod.  What gives with the other objects?  Why wasn\\'t it theft before?\r\n\r\nA: I believe this is actually a bug in the game.   All objects in the cave (cell) should be owned by a particular person or faction, but for whatever reason they aren\\'t.  I can\\'t see any reason in the editor why it is that way.  I think this is actually a bug in the game or Creation Kit.  This is definitely on my TODO list for further investigating.\r\n\r\n\r\nQ: I killed a family\\'s father and left the poor widow alive.  Why doesn\\'t she take ownership of the house and stuff?\r\n\r\nA:  Its a limitation in the game.  The way this mod should work would be to remove ownership once an entire faction (family) is dead.  Unfortunately, Bethesda didn\\'t give us modders any faction functions to tell if there are members in a faction (ie, array foo[] = Faction.GetMembers() ).  If that existed, then I could do a check to see if the faction has anyone alive and remove dead members to reduce the member count.  Alas... picking the \\\"head\\\" of the faction as the owner was the next best solution.  Maybe in the future I can uses SKSE or a a future method to do this (looking at you Bethsoft).\r\n\r\n\r\nQ: So I killed that father and now the wife just stands outside the front door to the house at night. \r\n\r\nA: Oh, that\\'s bad.  Please tell me about these things and other odd NPC behavior.  This mod shouldn\\'t prevent people from entering their house.\r\n\r\n\r\n[size=5][b]TODO/Known Issues:[/b][/size]\r\n\r\n1) [s]Fix ownership issues in the outside world.  I am actually going to add ownership to a number of objects immediately around caves and houses.  It doesn\\'t make sense that food barrels next to a house are free to pick clean.  There\\'s another 20 hours to sink into this task, so I\\'ve pushed it off for the next release.[/s] Done!  \r\n\r\n2) Figure out and fix issues where objects are \\\"owned\\\" but yet it isn\\'t theft to pick it up.  I believe this is actually a bug in the game itself.\r\n\r\n3) Some NPC\\'s are not running the scripts for some no good reason.  (Ex: Endarie in Solitude)\r\n\r\n\r\nCredit to RegentEagle for creating the original mod in Fallout 3.  I missed the mod so much, I had to make it for Skyrim.",
  "categoryId": "24",
  "version": "1.1.0",
  "author": "senorblackbean",
  "createdUnix": "1333150980",
  "updatedUnix": "1334626361",
  "containsAdultContent": false,
  "uploadedBy": "senorblackbean",
  "primaryFile": null,
  "files": [
    {
      "fileId": "48352",
      "name": "Owned 1_0_0",
      "version": "1.0.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "313",
      "fileName": "Owned 1_0_0-14038.7z",
      "uploadedUnix": "1333151067",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/7143c4fdaf0bf22bec6243dbf8eb2fc4f8ebb50f4673bb1776cb9d70fb9ee273/analysis/1406788210/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Owned%201_0_0-14038.7z?fid=48352&ttl=1535777340&ri=8192&rs=8192&setec=1017362c496528baa1344182bff59f21"
    },
    {
      "fileId": "53869",
      "name": "Owned 1_1_0",
      "version": "1.1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "544",
      "fileName": "Owned 1_1_0-14038-1-1-0.7z",
      "uploadedUnix": "1334626091",
      "modVersion": "1.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/30ff55ed63e27e8343d02fa83f1d9c2b014d1ee163376b6f487191123ab34e2c/analysis/1406819464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Owned%201_1_0-14038-1-1-0.7z?fid=53869&ttl=1535777340&ri=8192&rs=8192&setec=0494895b7253d961b9c386cdc55fa14d"
    },
    {
      "fileId": "53872",
      "name": "Owned-Midas Compatibility",
      "version": "1.0.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6",
      "fileName": "Owned-Midas Compatibility-14038-1-0-0.7z",
      "uploadedUnix": "1334626361",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/fd74070f7efeacb202a3d939f456c9a5a74f97079a2a11c147c7b5a632dea1fb/analysis/1406819468/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Owned-Midas%20Compatibility-14038-1-0-0.7z?fid=53872&ttl=1535777341&ri=8192&rs=8192&setec=92fccab4bb6c80c0e955d3338f3a3707"
    }
  ]
}