{
  "modId": 14044.0,
  "modName": "Invisibility Heal and Speed Boost Spell",
  "summary": "A new spell that heals the caster, makes them invisible and boost their speed for 30 seconds.",
  "descriptionHtml": "This mod adds an Illusion spell that is learnt from a book.\r\n•\tThis spell will stealth, heal and boost a player speed for 30 seconds.(All at once/Simultaneously)\r\n•\tThe spell in learnt from a tome that is in a boat at \\\"Mara\\'s Eye Pond\\\" South East from Windhelm. (See pictures included).\r\n•\tAnyone can learn it there is no high skill needed and the spell cost next to nothing to cast.\r\n\r\nInstallation\r\nThe file is in ESP form so just use NMM to install it then select the ESP file then you are set to go.\r\nOr alternatively download the file un-zip then put in the “Data” folder. (You should know the drill by now!)\r\nCompatibility\r\nShould be no issues with other spells as it uses new speed, invisibility and restore-health effect from the Creation Kit and doesn’t change the vanilla ones.\r\n\r\nThis is my first ever mod so if you like it please post a comment.  I hope you enjoy the MOD\r\nAny advice would be greatly appreciated.\r\nIf you think the mod is good and wish to use it please ask me in the comments. \r\nI have some ideas for new mods but I have no idea how to do them.  Input would be helpful; or just make them if you can.\r\n1.\tAs I play an archer I would love a mod that turns the player invisible when they Crit with a bow. (Perhaps a 5% chance to Crit with additional multipliers of 10%, 20% etc in the perk tree).  Invisibility would confuse the enemy and the archer could manoeuvre behind them and start attacking again or run away.\r\n2.\tAn arrow teleport spell (Like the Ranger one in Guild Wars 2) so a player can get out of trouble quickly or just move swiftly from place to place.  The archer fires an arrow and where it lands the player is teleported.\r\n3.\tA shield spell that is cast whenever an archer pulls the sting back on a bow. (This could use stamina or magika up so a player has to release the arrow if they do not want to lose their stamina or magika). \r\n",
  "categoryId": "75",
  "version": "1.0",
  "author": "Jimmytrouser",
  "createdUnix": "1333158420",
  "updatedUnix": "1333158859",
  "containsAdultContent": false,
  "uploadedBy": "jimmytrouser",
  "primaryFile": null,
  "files": [
    {
      "fileId": "48382",
      "name": "All-In-One New Invisibility Health and Speed Boost Spell",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "All-In-One New Invisibility Health and Speed Boost Spell-14044-1-0.7z",
      "uploadedUnix": "1333158859",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2373486454c5a48c6460e62e808320b54ec9264e69f7a45ee138db5a49d90f35/analysis/1406788359/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All-In-One%20New%20Invisibility%20Health%20and%20Speed%20Boost%20Spell-14044-1-0.7z?fid=48382&ttl=1535777356&ri=8192&rs=8192&setec=9094964a1afd1c01973059ef39ed3cf0"
    }
  ]
}