{
  "modId": 14045.0,
  "modName": "Hall of the Warlords",
  "summary": "High Level Dungeon featuring difficult bossfights!",
  "descriptionHtml": "-----------------------------------------NOTICE-----------------------------------------------\r\nI\\'ve been doing my homework, and as it turns out the NavMesh issue is one that is related directly to the Creation Kit that Bethesda is working on.  The NavMesh bugs out on second entry (I redid my navmesh by hand, and still had the same stupid results) so you do have to do this dungeon in one go.  I\\'ll do what I need to do to fix this issue as soon as Bethesda releases a fix on their end.  So sorry for the inconvenience, and I hope you all can see what I was trying to accomplish!\r\n-Avenger404-\r\n\r\nWith the release of my next mod this file will be \\\"obsolete\\\" and WILL NOT be compatible with my new file.  If you choose to download my new mod, it won\\'t be compatible with this one!\r\n--------------------------------------------------------------------------------------------------\r\nWelcome, young Dragonborns!  Today, I see many of you have almost come to the full extent of your potential!  I also see that fire of the passion of combat slowly draining from your eyes.  Although Skyrim has sensed this, and has released several beasts, wars, dragons, and bosses of increased abilities, I see none of you feel you have earned a REAL challenge...  This changes now.\r\n\r\nToday, an ancient and primal hall has awakened - the Hall of the Warlords.  This hall extends from the so-called \\\"Companions Guild\\\" in Jorrvaskr.  Kodlak Whitemane has not made aware the dungeon to the Circle - for he fears it would be too much for them and they would, inevitably, die.  If a certain wanderer happens to barge in and take a look for themselves, he cannot stop you...\r\n\r\nInside, you will meet the Hall Watchman, who stands guard at the entrance to make sure none of the other Champions try to make an escape.  I find it is best NOT to tamper with him...  He has also left you notes and rations before each fight - take care to read them...\r\n\r\nWARNING:  This content is high-level, and the fights get harder as you get deeper into the dungeon!  Don\\'t worry, there are no puny, backstabbing traps to worry about.  These Warlords only rely on their combat prowess to keep intruders out...  I expect this to only be level 70+ material.  If you beat it at a lower level, I didn\\'t make it hard enough!!\r\n\r\n---------------------------------NOTE----------------------------------------\r\nI will try to make a preview of the dungeon for upload to YouTube fairly soon (once I get this new software working)\r\nIf these guys are still \\\"too easy\\\" I will be working on a \\\"Very Hard\\\" version of the dungeon for those who need a slightly more hardcore experience...\r\n\r\n------------------------------FEATURES---------------------------------------\r\n5 hard boss fights of increasing difficulty to truly test your Dragonborn\\'s abilities!  You\\'ll need all the shouts, potions, armor, weapons, spells, and mods you can get!  The bosses do scale, but the base limit is 70, so they may appear to stay the same.  Be aware, however, that from 70-80, their levels will scale exponentially!\r\n\r\nDecent loot and a new Sword!  1h and 2h variants\r\n\r\n-----------------------------INSTALL---------------------------------------\r\nUse Nexus Mod Manager or:\r\n\r\nExtract to C://program files (x86)/steam/steamapps/common/skyrim/data\r\n\r\n----------------------------REQUIRED MODS-----------------------------------\r\nNone!\r\n\r\n-------------------------INCOMPATIBLE MODS----------------------------\r\nAny mods making significant changes to Jorrvaskr (particularly the basement)\r\n------------------------------CHANGELOG--------------------------------------\r\nv1.0 - Release\r\nv1.1 - Minor bugfixes\r\nv2.0 - Reworked over half the dungeon, made all bosses much more difficult, Added more dynamic events to the final bossfight (not working 100% perfect yet, but wanted to release an update for feedback), reworked NavMesh to work a little more smoothly, added optimization\r\n\r\n-----------------------------BUGS--------------------------------\r\n-Second entry may cause all the bosses to be mis-spawned (working on this)\r\n^ I will do what I can, but it turns out this is a CK flaw, which Bethesda is working on fixing, so I\\'ll do whatever I can, but for now the mis-spawned bosses are going to stay that way.\r\n-No music cues aside from combat - so it will be disturbingly quiet...\r\n-Currently some missing game textures (should be patched in the next update)\r\n-Final fight is not 100% perfect in funcionality yet, but is still much more challenging than before...\r\n\r\n-----------ADVANCED DESCRIPTION (SPOILERS TO FOLLOW)------------\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n-Hall Watchman\r\nCurrently impossible to fight.  He is the champion of the Hall, and is the only thing keeping the champions inside the hall.  He will help guide you through the dungeon through notes left in Rations Chests.\r\n\r\n-Supreme Necromage\r\nWell-practiced in the vile art of necromancy, he and his two assistants will primarily use magic to aid in your demise.  The room is filled with powerful corpses, so he will never run out of back-up...\r\n\r\n-Dremora Warlord\r\nThe supreme Dremora in Skyrim by no doubt!  He attacks purely with melee, and will make you suffer if you\\'re too close!  Beware his atronachs, as their lives are linked to oblivion itself, and should they die, the fight will get much more challenging!  Note that upon the Warlord\\'s death, his minions will NOT be pleased, and the fight will NOT be over!\r\n\r\n-Trio of Death\r\nAn ultra-powerful mage, ranger, and meleer await in the next fight.  Think you can take them on, and live to tell the tale?\r\n\r\n-Wrath of the Shadows\r\nThere may appear to be only one Berserker boss in this room, but be sure to look behind you, as the assassin will strike from the darkness...\r\n\r\n-Max\r\nHe is Max - capable of anything, and able to kill you single-handedly.  Do not underestimate his power, or control of the dungeon and those within!\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n----------------------------SPOILERS END HERE!--------------------------------------------\r\n\r\n\r\n\r\n\r\n\r\n---------------------OTHER MODS BY ME---------------------------------\r\nSkyrim Main Storyline New Bosses \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=13238\r\n\r\nMage Guild Bosses Revamp Part I\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=16710\r\n\r\n\r\n-----------------------CREDITS-----------------------------\r\n\r\nAll credit to Bethesda for Creation Kit and Skyrim!\r\n\r\n-",
  "categoryId": "88",
  "version": "2.0",
  "author": "Avenger404",
  "createdUnix": "1333158937",
  "updatedUnix": "1333567340",
  "containsAdultContent": false,
  "uploadedBy": "avenger404",
  "primaryFile": null,
  "files": [
    {
      "fileId": "48383",
      "name": "HalloftheWarlordsv1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "70",
      "fileName": "HalloftheWarlordsv1-14045.rar",
      "uploadedUnix": "1333158984",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a8443720c83e675cff8cea451022c87c1e5a0b78d863c6cbb9a4f89bd137bd27/analysis/1406788359/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HalloftheWarlordsv1-14045.rar?fid=48383&ttl=1535777358&ri=8192&rs=8192&setec=2108848fb22bb2bd7d69efd6dfa287bc"
    },
    {
      "fileId": "48732",
      "name": "HalloftheWarlords - Old -",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "71",
      "fileName": "HalloftheWarlords - Old --14045.rar",
      "uploadedUnix": "1333234815",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/25400f9375ac7e6493652e2bf736f3fa769f3b11208fc8db3df684d39b123e0b/analysis/1406790187/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HalloftheWarlords%20-%20Old%20--14045.rar?fid=48732&ttl=1535777358&ri=8192&rs=8192&setec=9640219663639a34af24ff34487634eb"
    },
    {
      "fileId": "50092",
      "name": "Hall of the Warlords v2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "96",
      "fileName": "Hall of the Warlords v2-14045-2-0.rar",
      "uploadedUnix": "1333567340",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/7c875d5165506ee0d9ee446b38bc12dae018bab14479a61a93359da265ffe696/analysis/1406797231/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hall%20of%20the%20Warlords%20v2-14045-2-0.rar?fid=50092&ttl=1535777359&ri=8192&rs=8192&setec=8a60d72331aeeacb5516b26aaa834ce9"
    }
  ]
}