{
  "modId": 14078.0,
  "modName": "Essen Lodge Player Home",
  "summary": "Medium to large sized player home located in the Rift.",
  "descriptionHtml": "[img=center]http://i1241.photobucket.com/albums/gg510/Krucify77/EL1.png[/img]\r\n\r\n[color=#D4A017][font=\\\"Segoe Script\\\"][size=18]Description[/font][/color][/size]\r\n\r\nEssen Lodge, is a player home that i designed to my liking. It has all the features you need and want. Located in the lovely autumn inspired Rift not far from the river. It has great scenic views and a logical layout. Essen Lodge is a bee farm with a long family history. My wife designed and wrote the background story for this mod. The story is brought to you, of course through books located inside the home.\r\n\r\n[color=#FF0000][font=\\\"Segoe Script\\\"][b]If you like this mod, please endorse. As with all modders, it gives us incentive to keep going. =)[/b][/font][/color]\r\n\r\n[color=#FF0000][font=\\\"Segoe Script\\\"]No God items[/font][/color]\r\nIf you can pick up an item it will not re-spawn except for flowers. I gave no books except for static books (which is for decoration only) for the people who want to earn their books like me . House is decorated well enough but left room for player to decorate themselves. Most items are static and if there is something you do not like use the console, then click the item, and type disable.\r\n\r\n[color=#FF0000][font=\\\"Segoe Script\\\"][b]To get access to the home go to Breezehome and you will find the key along with a note, lying in the floor in front of the door.[/b][/font][/color]\r\n\r\n[color=#D4A017][font=\\\"Segoe Script\\\"]Outside Features[/font][/color]\r\n\r\nMap marker\r\nSensible layout\r\nBeautiful scenery\r\nGarden\r\nWood Chopping Block\r\nOutside lighting at night\r\nBeehives\r\nGladimus\\' burial site\r\nSeparate home for hired hands\r\nMuch more\r\n\r\n[color=#D4A017][font=\\\"Segoe Script\\\"]Inside Features[/font][/color]\r\n\r\n3 Entrances, (Main Entrance, Rear Deck Entrance, Convenient Basement Entrance)\r\nPlenty of storage (Non Re-spawning)\r\nRealistic lighting w/ Removable lighting in basement (Lighting is based off of vanilla, so if you use a mod you may get different effects)\r\nWindows work with day and night cycle\r\nMerchant\r\nDining area\r\nKitchen with cooking spit\r\nFull working library with more than enough space to hold every book in the game including notes and journals\r\nMaster and guest bedroom\r\nWash basins\r\nBasement with full crafting area (grindstone, tanning rack, workbench, blacksmith forge and smelter) \r\nSeparate room for alchemy and enchanting\r\nAll 10 shrines available\r\nDragon priest mask storage\r\nArmory with 26 weapon racks, 4 dagger display cases, 4 weapon display cases, 4 Shield Racks, 7 weapon plaques, and 10 mannequins\r\nTwo hired hands, Shoal and Madison, they (sandbox) work outside during the day unless it\\'s raining, at which point they will sandbox inside the home. Both can be followers up to level 81 and both can be married.  Shoal is a two-handed warrior and Madison is a destruction mage.  \r\nSpouse compatiable after wedding and can move in from any other Bethesda home.\r\n100% navmeshed inside and out.\r\n\r\n[color=#D4A017][font=\\\"Segoe Script\\\"]Known Issues[/font][/color]\r\n\r\nBethesda\\'s navmesh problems still exist. I recommend running on version 1.5.26. Nav-mesh currently works, sort of. However, if you go a few cells away and come back to the house the nav-mesh will stop working and actors will stand in place.  If you run on version 1.5.24 you will CTD while trying to enter the home.  Navmesh problems is Bethesda\\'s issue, not mine.\r\n\r\nMannequins like to move around.  Again, Bethesda\\'s issue not mine.  If they are out of place, exit and entering the cell will usually fix the problem.  There are a few mods out there that correct this issue.\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=10652]Vanilla Mannequin Script Fix[/url] Good mod to fix most of the mannequin issues.\r\n\r\nBookshelves work properly, however i have noticed if you put all large books on a shelf, they will some times disperse when you re-enter the home. Try to randomize the size of the books you put on the shelf and all should be okay.\r\n\r\nIf you see floating grass outside this is an issue with the creation kit and the game not updating properly, however there is a temporary fix for this.  To get the grass to update in your game properly, open up your Skyrim.ini and Skyrimprefs.ini and at the bottom of the grass section add these lines: \r\n\r\nbAllowLoadGrass=0\r\nbAllowCreateGrass=1\r\nbDrawShaderGrass=1\r\n\r\n[color=#D4A017][font=\\\"Segoe Script\\\"]Conflicts[/font][/color]\r\n\r\nWill conflict with any other mod that edits the same cells. \r\nWill conflict with any other mod that alters the wedding/spouse move in option.\r\nNo other conflicts that come to mind.\r\n\r\nIf you find any issues or conflicts, post the issue and i will sort it out.\r\n\r\n[color=#D4A017][font=\\\"Segoe Script\\\"]Install/Un-install[/font][/color]\r\n\r\nUse Nexus Mod Manger (Recommend).\r\nTo manually install unpack to your data directory, usually located in your steam directory.\r\n\r\n[color=#D4A017][font=\\\"Segoe Script\\\"]Current Version =[/font][/color] [color=#1589FF][font=\\\"Segoe Script\\\"]1.5.1[/font][/color]\r\n\r\n[color=#1589FF][font=\\\"Segoe Script\\\"]V1.5.1[/font][/color] - Changed the LOD values for the home. I do not know whether this will fix the disappearing house for everyone.\r\n[color=#1589FF][font=\\\"Segoe Script\\\"]V1.5[/font][/color] - Fixed issues with the weapon racks for real this time. Also, optimized the house. You might get some stuttering going into the basement as it loads. It\\'s either that or a trapdoor/load screen. [color=#FF0000][font=\\\"Segoe Script\\\"][b]Again, I highly recommend removing your weapons off the wall weapon racks before updating.[/b][/font][/color]\r\n[color=#1589FF][font=\\\"Segoe Script\\\"]V1.4[/font][/color] - Fixed issues with weapon racks.\r\nThanks goes to RavenWhitehawk.\r\n[color=#1589FF][font=\\\"Segoe Script\\\"]V1.3[/font][/color] - The random walls was actually stairs, where the mesh had got changed. Fixed, and all the walls are now properly stairs again. =) \r\nAgain, thanks goes to RavenWhitehawk for bringing it to my attention.\r\n[color=#1589FF][font=\\\"Segoe Script\\\"]V1.2[/font][/color] - Fixed issue where a wall piece was showing in random cells. \r\nThanks goes to RavenWhitehawk\r\n[color=#1589FF][font=\\\"Segoe Script\\\"]V1.1[/font][/color] - Fixed Honeyside door issue. Thanks goes to BravoOskar\r\n\r\n[color=#D4A017][font=\\\"Segoe Script\\\"]Thanks goes out to...[/font][/color]\r\n\r\nNexusmods, without them, there would be nothing to share. \r\nBethesda, for a truly awesome game.\r\nMy wife, for all her hard work and patience with me.\r\n\r\nAnd most important, you guys, without you guys who would i share with? haha",
  "categoryId": "67",
  "version": "1.5.1",
  "author": "Krucify",
  "createdUnix": "1333204981",
  "updatedUnix": "1333852657",
  "containsAdultContent": false,
  "uploadedBy": "Krucify",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51104",
      "name": "Essen Lodge - No NPCs",
      "version": "1.5.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "678",
      "fileName": "Essen Lodge - No NPCs-14078-1-5-1.7z",
      "uploadedUnix": "1333852581",
      "modVersion": "1.5.1",
      "virusScanUrl": "https://www.virustotal.com/file/4f69b5bcde6273b9871d77a25d28ac67f54454b03157f93419cbeed920ea1803/analysis/1406803185/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Essen%20Lodge%20-%20No%20NPCs-14078-1-5-1.7z?fid=51104&ttl=1535777414&ri=8192&rs=8192&setec=12a0542043069466ee9077ae8b0375eb"
    },
    {
      "fileId": "51105",
      "name": "Essen Lodge",
      "version": "1.5.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "679",
      "fileName": "Essen Lodge-14078.7z",
      "uploadedUnix": "1333852657",
      "modVersion": "1.5.1",
      "virusScanUrl": "https://www.virustotal.com/file/04b4b79a57d55c1e766847687cbb1d05139439434a53d45f254277ff1bb05a93/analysis/1406803189/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Essen%20Lodge-14078.7z?fid=51105&ttl=1535777414&ri=8192&rs=8192&setec=2a76c8174c789d3be4d2247777a3270f"
    }
  ]
}