{
  "modId": 14102.0,
  "modName": "1521 Textures",
  "summary": "Tired of the same textures for each item set? Look no further....",
  "descriptionHtml": "1521 textures for you to play with in the CS. These textures are already in the game. Bethesda only made some for you to use. Now you have 1521 more. What I did was this. I used a bsa browser to unlaod all the texures stored in the texture bsa. I then made texture sets for the dds files. All with the CS only no other program was needed or needed to use these files. There are no folders to install its just a blank ESP with new textures. Thanks to Kalell a ESM is also available for those of you with existing esps. \r\n\r\nHow to use the esp. The esp is just a blank esp with the texture sets added. So it can be used to make a house or dungeon from scratch.  Just change the name of the esp to what ever you want and start from there. \r\n\r\nThe esm needs to be checked and your existing esp the active one. Open your esp and your ready to change textures that will hold when starting the game. \r\n\r\nWhen starting the game  you only need to check the esp to load. It will draw files from the esm thats in your sky directory to rendor from.\r\n\r\nWhy did I make this Esp. Simple really it started with the pottery. I saw pottery with shapes that I liked but there where only a couple with the same textures.  The other pottery textures would clash with the house or dungeon I was making. I saw a vidio that told how to make a new creature with just texture changes. You might have seen it the rainbow chicken.That got me thinking and I started playing around with the the texture set that bethesda already made. I have a wall with a eye texture on it in one of my Keeps. Well needless to say after fooling around with each texture set I wanted more and here they are now.\r\n\r\nThe planter pictures are the Solitude big planters with new textures on them. The first, one of many effects ingame. This is a blood splatter effect texture now on the planter. The second planter is a mural from a nord ruin. The last planter has a cloud texture on it. Now for the wardrobes. Thats right those are nobel wardrobes with new textures. Three nobel round tables with new textures. The table looks are awfull I know, I just grabed a file to show you what could be done. Then a custom table I made using 2 items that where not ment to be used in that way. But it works. Also with new textures. Then the last one thats a nord burial chamber with new textures and 2 floor panals one to cover the grate in the center and the second as a ceiling. all with new textures.The alcoves can be used to place mannequins The read me gose into more details on how to use this texture set and what texture sets where used to make the wardrobes. Surprised the heck out of me when I back tracked the texture sets to see what they would normally go on.\r\n\r\nJust remember as it says in the read me certain textures will not work with some items. Also you will see seams and blurred pixels on some items. If you can live with the pixel textures use it. If not try something else \r\n\r\n\r\nSpecial thanks to Kalell for making the esm. I would also like to thank Wyspr for letting me know about the mistakes I made.\r\n\r\nHave fun and happy modding. ",
  "categoryId": "29",
  "version": "1",
  "author": "looknot",
  "createdUnix": "1333237087",
  "updatedUnix": "1333510710",
  "containsAdultContent": false,
  "uploadedBy": "Looknot",
  "primaryFile": null,
  "files": [
    {
      "fileId": "49819",
      "name": "Readme",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Readme-14102-1.rar",
      "uploadedUnix": "1333483796",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/d142198c7578e0b3c272783366dd28443321fbe14e586c91fd2439923ac4efcd/analysis/1406795751/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Readme-14102-1.rar?fid=49819&ttl=1535777453&ri=8192&rs=8192&setec=e63b88ec1b8915e4b8580bf59f4b087b"
    },
    {
      "fileId": "49915",
      "name": "1521 ESM",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22",
      "fileName": "1521 ESM-14102-1.rar",
      "uploadedUnix": "1333510571",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/26f82fac5f1576d4fdae85d24c56863d40dbcaa94f7e2f166dad0861c1ef4818/analysis/1406796262/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/1521%20ESM-14102-1.rar?fid=49915&ttl=1535777453&ri=8192&rs=8192&setec=9fbdceb90af6184dbf4d19e88c3db1ac"
    },
    {
      "fileId": "49917",
      "name": "1521 ESP",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22",
      "fileName": "1521 ESP-14102-1.rar",
      "uploadedUnix": "1333510710",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/8fdffda1d61a69e3edb2caca76346c4f79a8b068dad23e90ca52368f71ffe0ab/analysis/1406796263/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/1521%20ESP-14102-1.rar?fid=49917&ttl=1535777454&ri=8192&rs=8192&setec=89747bea1310329314d298f316caa179"
    }
  ]
}