{
  "modId": 14119.0,
  "modName": "The J and C Pleasure Factory",
  "summary": "So you like kinky gear and body piercings? The J & C Pleasure Factory has you covered! Drop on in and see what grabs your attention!",
  "descriptionHtml": "**STOP AND READ THIS PLEASE! Update 18:05 4/1/12**\r\n\r\nUploaded a new \\\"house1.esp\\\" file which corrects problems with \\\"invisible houses.\\\" The new entrances are located in Whiterun, Riften, and Solitude. Please look at the screenshots for the Whiterun location by the Skyforge.\r\n\r\n***Warning: Adult Content*** Nexus forums rules are in effect - \\\"If you don\\'t like it, say nothing and pass in silence.\\\" \r\n\r\n***STOP! IMPORTANT READ ME!***\r\n\r\nBefore anything else is said, if you are running \\\"jammersslavegear.esp or zastra\\'s (sp?) restraints mods\\\" you MUST delete it along with the \\\"Jammer\\\" folder under Skyrim/meshes before installation. Failure to follow these instructions will result in the \\\"Pleasure Factory\\\" not working correctly!\r\n\r\n******************************\r\n\r\nWelcome to the v0.9 beta of the J & C Pleasure Factory! Cyanure and I both put a lot of hours and long nights into getting this mod ready for testing. If you wish to see us continue to expand this mod, let us know if you\\'re enjoying it. Also, we love screenshots of other people running mods we create. Nothing gives us a greater sense of satisfaction than seeing other peoples \\\"action shots.\\\"  Please take a small amount of time and post them for us to see.\r\n\r\nThe Pleasure Factory can most easily be accessed by visiting the entrance located by the Skyforge in Whiterun. There are also two other locations to enter or exit from, but we\\'ll let you discover them for yourselves. At this time Masters J & C are busy overseeing the construction of the Factory, so captives Tania and Cherry currently sell most of the \\\"cool\\\" gear. Their hours are 14:00 to 23:00 hours. \r\n\r\nThere is a mage follower in the Factory who is naturally submissive and looking for a new master! All you have to do is figure out which NPC it is and how to access her; it will be up to you to \\\"outfit\\\" her with gear. (Accessories are not included) She\\'s quite a powerful mage btw, and please let us know how she works out. (This is a beta test after all) We have plans for more \\\"natural submissives\\\" in future expansions. \r\n\r\n\r\n\r\n*NEW SINCE \\\"MASTER J\\'S V2.3 MOD*\r\n\r\n\r\nThe Factory dungeon itself. (Still a massive WIP)\r\nThe amount of gear available to purchase has doubled.\r\nGear can be purchased at 10 level increments. (Still a massive WIP) \r\nGlow maps on roughly half of the equipment. (Indicates \\\"magical\\\" gear) \r\nSeparate gear designed for fighters, mages etc. \r\nNew characters Master C and his personal captive, Tania is introduced. \r\nWerewolf bodyguards. (Male and female) \r\nA \\\"new\\\" follower to beta test.\r\nCrafting stations are available inside. \r\n\r\n*Known Issues*\r\n\r\nThe Factory is fully navmeshed, but we recommend leaving followers outside at this time. Everyone is having problems making navmeshes function correctly; we aren\\'t any different. \r\n\r\n3 of the captives body and head texture files do not match; it\\'s a CK bug. (Do you see a theme emerging here?)\r\n\r\nMining captives/NPC\\'s etc sometimes appears to float off the ground a little.\r\n\r\nThere is a \\\"random factor\\\" in the code which makes merchants sell level 10+ gear, well randomly.  We aren\\'t sure how to bypass this yet or if it\\'s even possible. Just check back every 24 hours and the \\\"stuff\\\" will eventually be available for purchase. If you see a \\\"rare\\\" item, grab it, because it might be a while before it\\'s available again. \r\n\r\n*Future Plans*\r\n\r\nA series of quests involving \\\"fugitive\\\" recovery etc with voice over\\'s, very much like a proper \\\"guild.\\\" \r\nAt least 2 more captive followers with different skill sets; probably more.\r\nA proper bar and exotic dancing room.\r\nThe introduction of more Mistress\\', two of which are already in development.\r\nA full dungeon to fight your way through with rewards for completing it.\r\nCustom music files for different \\\"cells\\\" in the Factory.\r\nStandardized merchants selling crafting supplies.\r\nOf course, more \\\"gear\\\" designs. \r\nVampires will be included once we work out their differences with the Werewolves. (grin) \r\nTorture, err \\\"play room.\\\" \r\nTattoo vendors.\r\nCustom races.\r\nUpgradable gear.\r\n\r\n*REQUIRED/HIGHLY RECOMMEND MODS*\r\n\r\nCaliente\\'s CBBEv3 mod. I have included matching meshes for all the gear, but texture files are not included.\r\n\r\nFemale Werewolves are in the factory. We highly suggest you use this mod or it will decrease your overall enjoyment of our mod; it can be downloaded here:\r\n\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10989\r\n\r\n*INSTALLATION*\r\n\r\nAs previously mentioned, uninstall all parts of the old body piercing/kinky gear mod no matter the version. (see the beginning of this post) Copy and paste the \\\"data\\\" folder along with the \\\"house1.esp\\\" file into your skyrim directory. The mod should now be working properly. \r\n\r\n*PERMISSIONS*\r\n\r\nCyanure and I (Jammer) reserve all rights to the ideas, characters, textures, and objects located in this mod. If you wish to use something from our mod in a separate project, ask us first!\r\n\r\n*WE ARE LOOKNG FOR A CODER*\r\n\r\nIf you really like this mod and know how to code for Skyrim, consider joining our team! We are also a few weeks away from needing voice actors for various personalities. (male and female) If you\\'re interesting in participating, let us know so we can put you on the list. Perks will include getting to name the character you\\'re willing to \\\"act\\\" etc. (Mistress ___  as an example) \r\n",
  "categoryId": "69",
  "version": "v0.9c",
  "author": "Cyanure and Jammer",
  "createdUnix": "1333258149",
  "updatedUnix": "1333325030",
  "containsAdultContent": true,
  "uploadedBy": "jammer2006",
  "primaryFile": null,
  "files": [
    {
      "fileId": "48814",
      "name": "J and C Pleasure Factory",
      "version": "v0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "43276",
      "fileName": "J and C Pleasure Factory-14119-v0-9.rar",
      "uploadedUnix": "1333258692",
      "modVersion": "v0.9",
      "virusScanUrl": "https://www.virustotal.com/file/c7eb8b8b95d9e8b72506b354700646a0b41270f7c40a08afa32be1eda8e0b526/analysis/1406790680/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/J%20and%20C%20Pleasure%20Factory-14119-v0-9.rar?fid=48814&ttl=1535777476&ri=8192&rs=8192&setec=33e1f9b65ba9f8f883a02a30ce9cd578"
    },
    {
      "fileId": "48859",
      "name": "J and C Pleasure Factory corrected esp location",
      "version": "v0.9b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "43278",
      "fileName": "J and C Pleasure Factory corrected esp location-14119-v0-9b.rar",
      "uploadedUnix": "1333271618",
      "modVersion": "v0.9b",
      "virusScanUrl": "https://www.virustotal.com/file/51ddb24d0aef7f1673a436843a5dd6c6473830f650e4bfbe270cbf4bf9ef3c2c/analysis/1406790937/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/J%20and%20C%20Pleasure%20Factory%20corrected%20esp%20location-14119-v0-9b.rar?fid=48859&ttl=1535777476&ri=8192&rs=8192&setec=ace7dc758aff3515f149e1d7600a2987"
    },
    {
      "fileId": "49127",
      "name": "House1 esp bug update",
      "version": "v0.9c",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "230",
      "fileName": "House1 esp bug update-14119-v0-9c.rar",
      "uploadedUnix": "1333325030",
      "modVersion": "v0.9c",
      "virusScanUrl": "https://www.virustotal.com/file/5adb75890b1cee4d735d6dadc9f6bfb21e0426e5891712d7ce1285f481115330/analysis/1406792366/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/House1%20esp%20bug%20update-14119-v0-9c.rar?fid=49127&ttl=1535777477&ri=8192&rs=8192&setec=055d427adbf6459d2d8ff163212811bf"
    }
  ]
}