{
  "modId": 14141.0,
  "modName": "Uthgerd von Wolfe - Goddess of the Moon -NSFW- CBBE UNP",
  "summary": "This character mod is somewhat of a tribute to the late actress Elizabeth Brooks best known for her role in \\\"The Howling\\\" as Marsha Quist the sultry female werewolf. CBBEV3 or UNP body available now. ",
  "descriptionHtml": "Uthgerd von Wölfe {Goddess of the Moon}\r\n\r\nFirst, thank you for stopping by and checking out my mod. Vanilla\\'s Uthgerd is ugly as sin (IMHO) and I set my mind on correcting that. While I was at it I looked around for not so famous celebs that I might borrow a few facial features from. This character mod is somewhat of a tribute to actress Elizabeth Brooks (RIP) best known for her role in \\\"The Howling\\\" as as Marsha Quist the sultry sexy female werewolf. It was one of my favorite movies as a kid and besides who could ever forget that werewolf sex scene! :) Then I thought how cool would it be to have a super hot female companion that could transform into a werewolf! I found a mod that allows you to do just that and the link is provided below. I played with various spells (mostly removing them) and perks but to no avail she wont use them in beast form. What she does do is destroy people with her claws and she does that very well! \r\n\r\nNecessary and optional files: HUGE Props to Brevi for making this mod!!!\r\n\r\nOptional files for your new companion to take beast form. \r\n\r\nThese mods below will make her take Beast Form, I didn\\'t make them so if you run into issues look to their page for support. I am using Werewolf Followers currently and it is working perfectly for me with my Uthgerd mod. Please check his page for any other possible mod conflicts. I am using Followers Can Relax along with it and have had no issues so far. \r\n\r\nJUST A COMPANION CHANGER: Old version: Werewolf followers by Brevi \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11459 \r\n\r\nREALLY REALISTIC: New version: Tales of Lycanthropy - Werewolf Overhaul by Brevi/ spwned\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=12687\r\n\r\nI also used this Female Werewolf mod with the authors smaller breast optional file. You can see my images on how it looks. Dogs, wolves, coyotes and other canines have nipples and so should female werewolves (in my humble opinion). Nuff said... ;)\r\n\r\nFemale Werewolf by Moutarde421 http://skyrim.nexusmods.com/downloads/file.php?id=10989 \r\n\r\nThe mechanics are the changed up for this character. She is a 1 handed fighter now and has increased sneaking abilities. I also gave gave her a player ally relationship and default follow player AI. Theoretically you should still have to fight her to win her friendship but I have not started a new game to test it out. If she still needs that questline completed before she follows you she may be very difficult if you are using a lower level character. You will most likely need some serious muscle and lots of health and stamina potions. ;)\r\n\r\nStats: I have given her Calculated mechanics at level 30 See Screen Shot\r\nInventory: Enchanted Ebony War Axe of Absorb health, House Key and Pocket Items and NO CLOTHES!!! She will appear nude. \r\nVoice: Female Sultry in honor of Ms. Brooks\\'s renowned sultry voice (at the cost of her normal and somewhat annoying dialog)\r\nHair: Custom chestnut hair by me to closely match Ms. Brooks hair using (*)Apachii Hair Style #7\r\nEyes: Hazel Green (*)RANs Eyeliner Replacer - v1_0\r\nFace: (*)Bella\\'s Better Female Faces - Makeup Version 1 with No Shine\r\nBody: (*)Dimonized UNP or CBBEv3 (I use (*)Navtsea\\'s UNP body mod over it for more muscle tone.), (*)Glosstech v05 No Shine.\r\n\r\n(I know  some of you dislike this hairstyle because it hides the boobies. If I get enough requests I may do an alternate version that\\'s more voyeur friendly.)\r\n\r\nIf there is an (*) Asterisk by the named items above you will \\\"need\\\" these files to make her look like my mod of Uthgerd in the images I uploaded.\r\n\r\nEasy Install: Use NMM or manually install the BSA, ESP Files in your Skyrim Data Folder. \r\n\r\n*One Important Note* To get the hands to match in Navetsea\\'s mod you need to copy the meshes from the Dimonized UNP MAIN folder to your Data Meshes Folder then overwrite with Navetsea\\'s file. If you think this is a pain in the ass, just use the Dimon mod without Navetsea\\'s mod. If you want a better looking body, female nether region and like your ladies fit, Navetsea has an excellent mod and is recommended! \r\n\r\nMy take on Makeup on Female and Male NPC\\'s not being \\\"Lore Friendly\\\"\r\n\r\nThere are a lot of people playing this game that think the use of make-up is not lore friendly and so they are hesitant about using character mods like mine that use makeup or beautification mods. I would ask you to consider these following historical tidbits in relation to being lore friendly. Makeup is documented to have been used by the Ancient Egyptians over 10,000 years ago by paleontologists. Makeup was also documented to be in use by the Greeks, Romans and other ancient societies, including tribal body and face painting by Ancient Briton and Germanic tribes. To me it is completely plausible for makeup to be used in Skyrim given Bethesda supplied it and used it in the game on its own NPC\\'s. Inescapably Skyrim\\'s lore is tied to our history in some way shape or form, the latest \\\"trend\\\" of having NPC\\'s look more natural is more likely a current trend in modern use of makeup and not a direct reflection on the lore of this game or any game that that bases its lore partially on human medieval and ancient history. It is inarguable that Skyrim spans the times from early man to the late 16th century with the various in-game elements it provides us. Note the use of mammoths and saber tooth cats and then fast forward to some of the more modern items in the game such as steel bear traps (which were recorded to be first in use in the late 16th century). It is perfectly fine and period to this game to have your characters kicking ass in black eyeliner, eye shadow and red lipstick. Don\\'t let someone tell you it isn\\'t lore friendly because it really is. Given the choices of races we have in Skyrim it may not only be lore friendly but very plausible on some characters depending on their status and rank within their society. In the end it is completely your choice on how you want your NPC\\'s and PC\\'s to look. I personally am not interested in having androgyny rule my game so I opted to creating and sharing my own female characters that cannot be mistaken for anything else. \r\n\r\nThanks for reading,\r\n\r\nFalmerBane",
  "categoryId": "66",
  "version": "1.0",
  "author": "FalmerBane",
  "createdUnix": "1333286586",
  "updatedUnix": "1333407037",
  "containsAdultContent": true,
  "uploadedBy": "FalmerBane",
  "primaryFile": null,
  "files": [
    {
      "fileId": "48936",
      "name": "Uthgerd von Wolfe UNP Version",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "765",
      "fileName": "Uthgerd von Wolfe UNP Version-14141-1-0.7z",
      "uploadedUnix": "1333291226",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c86066eb9c9a85e574a87b59960dd9c525d14da9c42b32ce69fbd151b6687848/analysis/1406791383/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Uthgerd%20von%20Wolfe%20UNP%20Version-14141-1-0.7z?fid=48936&ttl=1535777511&ri=8192&rs=8192&setec=bdbd293d15d7f7e8b93045f42763e1cb"
    },
    {
      "fileId": "49468",
      "name": "Uthgerd von Wolfe CBBEV3 Version",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "763",
      "fileName": "Uthgerd von Wolfe CBBEV3 Version-14141.zip",
      "uploadedUnix": "1333407037",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f058088981d9b9354dc4838eaa49ac517242959750a355e4189cafe1d5008b32/analysis/1406794088/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Uthgerd%20von%20Wolfe%20CBBEV3%20Version-14141.zip?fid=49468&ttl=1535777511&ri=8192&rs=8192&setec=28d7809d9cdfd7c4f712d3edb47f14b2"
    }
  ]
}