{
  "modId": 14175.0,
  "modName": "The secret of steel",
  "summary": "This mod change the complete leveled item list so that there are no longer \\'fantasy\\' (elven, dwarven, orcish … etc) weapons and armor in the game. Only iron, steel, plate, scaled weapons and armor (and hide and leather of course). ",
  "descriptionHtml": "[size=+2][b] The secret of steel[/b][/size]\r\n\r\n[i]\\'The secret of steel has always carried with it a mystery. You must learn its riddle, Conan. You must learn its discipline. For no one - no one in this world can you trust. Not men, not women, not beasts. This you can trust. [Points to sword] \\' [/i] \r\n(From Conan the Barbarian)\r\n \r\n[size=+1][b]This mod change the complete leveled item list so that there are no longer \\'fantasy\\' (elven, dwarven, orcish, etc) weapons and armor in the game. Only iron, steel, plate, scaled weapons and armor (and hide and leather of course). [/b][/size]\r\n\r\nOk, there are still some of this fantasy items in the world, but they are very rare now. You can only get them if A) some npc`s or chests have a weapon or armor set in its inventory. For example, if a Talmor has an elven set, he still carries elven weapons and armor. Same thing with Daedra and so on. B) You craft it. You can still craft these items.\r\n\r\nI only changed the leveled items, so that e.g. bandits or dungeon chests or a blacksmith don`t generate random \\'fantasy\\' weapons and armor anymore. So this stuff should be very rare with this mod but it should still be possible to get them. \r\n\r\nThis mod may not be everyone\\'s thing, but for me there was too much of these \\'fantasy stuff\\' in the world. I couldn t understand why there are thousands of e.g. dwarven weapons (if you reached a specific level) in the world although the Dwemer extinct a long time ago. \r\n\r\n[size=+1][b]Please note: I don`t tested the mod so far. It should work but I have to play with it first, to be sure. Therefore I take no responsibility for possible troubles ;-) [/b][/size]\r\n\r\nAnd don`t expect that the weapons and armor are gone once you activated this mod. [size=+1][b]They only stop to spawn[/b][/size], but every piece of weapon and armor which is in your (save) game still remains if you activate this mod. \r\n",
  "categoryId": "78",
  "version": "1.0",
  "author": "Althir",
  "createdUnix": "1333313056",
  "updatedUnix": "1333313115",
  "containsAdultContent": false,
  "uploadedBy": "Althir",
  "primaryFile": null,
  "files": [
    {
      "fileId": "49062",
      "name": "The secret of steel",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "The secret of steel-14175-1-0.rar",
      "uploadedUnix": "1333313115",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cce44f1c2a77139d841afbd1f28b082a5911303e43c6c8a4ffee96e7c8eae66f/analysis/1406792001/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20secret%20of%20steel-14175-1-0.rar?fid=49062&ttl=1535777592&ri=8192&rs=8192&setec=2109edd1bb8591de33655f767b8c0b11"
    }
  ]
}