{
  "modId": 14174.0,
  "modName": "Cultura Espansa",
  "summary": "New Books in Italian Language\r\n\r\nNuovi libri completamente in italiano!",
  "descriptionHtml": "[color=red]Cultura Espansa adds new unique books in Skyrim. The books are in Italian language and are divided into several categories: riddles, narrative, irony, reviews of famous poems and diaries that lead to rewards (a kind of treasure hunt). The books are sold by a new merchant excluding books containing solutions of riddles, whose location is the last riddle of the book of riddles. I have been meaning to expand the mod in the future with new books, in Italian. My knowledge of English will not allow me to translate them decently, but if someone wants to translate it, please contact me.[/color]\r\n\r\n[center][img]http://static.skyrim.nexusmods.com/downloads/images/14174-1-1333312724.jpg[/img][/center]\r\n\r\n[center]questa è la prima release, se trovate qualche errore, segnalatemelo![/center]\r\n\r\n[color=green][size=+1]DESCRIZIONE[/color][/size]\r\nCULTURA ESPANSA aggiungerà circa una quarantina di nuovi libri originali e completamente in italiano che andranno a sommarsi a quelli già presenti nel gioco!\r\n\r\nI libri potranno essere acquistati da un nuovo mercante (vedere le immagini per la locazione) e sono livellati per essere venduti solo ad un determinato livello del vostro personaggio.\r\n\r\nNello scrivere i libri ho pensato di coprire più generi possibili, così li ho divisi in categorie:\r\n\r\n- LIBRI DI NARRATIVA\r\nAmate le storie? Avete già spazzolato tutto quello che avete trovato in giro? Bene, godetevi allora queste nuove storie, più o meno serie\r\n\r\n- LIBRI SPENSIERATI\r\nE che diamine, qualcuno doveva pur pensare ai barbari! Prendendo spunto da uno spassoso libro già visto in Oblivion, ecco un corso accelerato di alfabetizzazione dedicato alla classe più rozza che ci sia... almeno prima del corso! \r\n\r\n- CACCIA AL TESORO \r\nUna serie di diari dei quali solo il primo troverete in vendita. Questo darà il via alla ricerca di tutti i diari successivi, nascosti nelle lande di Skyrim, naturalmente con un\\'adeguata ricompensa per chi riuscirà ad arrivare alla fine del percorso!\r\n\r\n- INDOVINELLI \r\nPAtiti degli indovinelli? Non vi resta che acquistare questi libri! In ogni volumi troverete una serie d\\'indovinelli e l\\'ultimo vi porterà dritti a scoprire la locazione del premio più ambito: Il libro delle soluzioni!\r\n\r\n- GUIDE\r\nNon riuscite a trovare un santuario, una maschera, un urlo o altro ma non avete voglia di uscire a guardare le soluzioni? Queste guide fanno al caso vostro. Ovviamente è inutile aggiungere che si tratta di spoiler enormi!\r\n\r\n- POESIA\r\nPer concludere, un pensiero agli amanti della poesia. Avete mai pensato se Angiolieri, Lorca, Carducci o altri fossero natii di Whiterun? Eccovi delle personali rivisitazioni di note poesie riadattate in quel di Skyrim!\r\n\r\n\r\n\r\n[color=green][size=+1]INFO[/color][/size]\r\nNei file troverete anche un archivio rar contenente le immagini delle locazioni dei libri nascosti, nel caso in cui non riusciate a trovarli!\r\n\r\nInoltre vorrei ricordarvi che questa è una mod \\\"aperta\\\", nuovi libri verranno implementati in futuro se quest\\'idea verrà apprezzata. \r\n\r\nInfine se avete voglia di contribuire, aggiungendo vostre \\\"opere\\\" contattatemi pure! \r\n\r\n[color=green][size=+1]INSTALLAZIONE[/color][/size]\r\n- Nexus mod manager\r\nLo sapete no? E allora che ve lo dico a fare!\r\n\r\n- Manuale\r\nCopiare i file all\\'interno dell\\'archivio nella cartella \\\"data\\\".\r\n\r\n[color=green][size=+1]RINGRAZIAMENTI[/color][/size]\r\nUn ringraziamento speciale va ai ragazzi del  [url=http://tes.forumfree.it]TES FORUM[/url] , autori delle guide originali che ho inserito nei miei libri e che potrete consultare in versione estesa sul loro forum! \r\n\r\n\r\n\r\n\r\n...E RICORDATEVI CHE QUESTA MOD FA PARTE DEL PROGETTO [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url], DOVE POTRETE TROVARE MOLTE TRADUZIONI DELLE MOD PIÙ SVARIATE!\r\n",
  "categoryId": "28",
  "version": "0.1",
  "author": "klop",
  "createdUnix": "1333312688",
  "updatedUnix": "1333322404",
  "containsAdultContent": false,
  "uploadedBy": "klopklop",
  "primaryFile": null,
  "files": [
    {
      "fileId": "49068",
      "name": "Locazioni",
      "version": "0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3564",
      "fileName": "Locazioni-14174-0-1.rar",
      "uploadedUnix": "1333313738",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/7ff5ebf272545b259a618f01e2d231685463d0ec12c3bc7dd23e048eb46d2457/analysis/1406792007/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Locazioni-14174-0-1.rar?fid=49068&ttl=1535777590&ri=8192&rs=8192&setec=10ccca0a47b2c0c1542cb14029373023"
    },
    {
      "fileId": "49115",
      "name": "Cultura Espansa",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2976",
      "fileName": "Cultura Espansa-14174.rar",
      "uploadedUnix": "1333322404",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/56e8e2558857264cf39607ebdddcda3029515d04ecef000c31d3fd61b7c97ef4/analysis/1406792362/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cultura%20Espansa-14174.rar?fid=49115&ttl=1535777591&ri=8192&rs=8192&setec=fde2528ac28cd2e7e6339d3673ca4ac3"
    }
  ]
}