{
  "modId": 14192.0,
  "modName": "Animated Enchantment Effects V2_0 Shadow of Death",
  "summary": "Adds new Animated Enchantments to Skyrim.  \r\nCurrently adds 2 enchantments, based on Fire damage and Soul Trap.",
  "descriptionHtml": "Animated Enchantment Effects(AEE) Version 2.0: \r\n\r\nThis update includes everything from Beta Version to current, so only download the main file.  This mod will add 2 new full animated, and stand alone enchantments, to your game. No default enchantments are replaced, so you can still use any base enchantment on any weapon type that you wish. However, the new AEE should only be used on the weapon type they were designed for, they will work on any weapon in the game, but the meshes will not fit properly. The new AEE must be learned before they can be used to enchant weapons, just like default Skyrim enchantments. To learn them, the mod features unmarked mini quests, one for each AEE. To keep things fun, I won\\'t spoil anything here, but I will give all the details on how to obtain them in the optional downloadable txt file. I will post the starting point of each mini quest to get you started. The 2 AEE currently included are: The Flames of Oblivion, and The Shadow of Death. These are based off Skyrim\\'s base enchantments, fire damage and soul trap, but are very different from the games default effects. The changes are not just visual, extra effects have to added as well, such as lighting, sound fx, and changes in the spells. This mod is still a WIP, so please report any bugs, and please give feedback in the comments section. I try to rework the mod based off feedback when ever possible, which is why I ask you comment. I\\'ve made many changes already from previous versions due to feedback given in comments section. \r\n\r\nNOTES:\r\n\r\n-V2.0 uses a new learning system, this should fix all CTD issues, if you never had CTD, this wont affect you.\r\n\r\n-Please don\\'t post asking for help finding items, all information will be included in the downloadable txt.\r\n\r\n-The mini quest for learning Shadow of Death is tricky...if you got pissed looking for the book in Flames of Oblivion...I recomment you grab the txt file ;)\r\n\r\n-Unfortunatly, I cannot make the effect meshes work for all weapon types, to do so would require an extreme amount of work, and would clutter up the game\\'s UI badly.\r\n\r\n-I still need feedback on the weapons and enchantments, base properties, do they feel overpowered, or even underpowered?\r\n\r\n-I\\'ve checked, rechecked and checked again, as far as I know there should be no conflicts with other mods, but if you find one let me know, the only thing I can think of would be something that alters a lot of spells info.\r\n\r\n-Shadow of Death requires two new items to craft, I have added these items to various locations around Skyrim, you can hunt them down, check the cheaters txt, or if you look really close you can find everything you need in one place.\r\n\r\n-Still a WIP, if the mods is well recieved, I will add more content.\r\n\r\n-I\\'m looking for a talented video editor, if you would like to help please let me know.\r\n\r\n-Also looking for help with an idea for a script, anyone know how you could apply trapped souls directly to an item\\'s charge?\r\n\r\n\r\n\r\nThanks for downloading, if you have any questions feel free to ask. Below is a basic summary of each AEE, and the starting info on learning them, if you want to go in with no help at all skip this section.(no major spoilers posted, just where to start)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nFlames of Oblivion: This is a fire based attack which burns the target just like the default enchanment, the damage is higher though, and it\\'s much better to look at. This might give a slight preformance hit in very large groups, but you shouldnt really notice. This mini quest starts with a book you must find hidden in Winterhold.\r\n\r\n\r\nShadow of Death: This is a two effect enchantment. first off, it is a sould trapping enchantment. Just have the proper soul gem equiped, and the target will fill it when it dies. The second part of the enchantmnet, is a raise effect. It can raise almost any dead npc back to life, which will then protect the player. This is triggered by contact, so it can be triggered, when the weapon strikes and npc and kills it, or when the player strikes an already dead npc on the ground, or it can even trigger when the player strikes an npc who isnt killed by the hit, for example if your target it standing over a dead npc and you strike, but your target doesnt die, the dead npc on the ground may be reanimated . This mini quest starts with a note left inside the inn located Whiterun.\r\n\r\n",
  "categoryId": "75",
  "version": "2.0",
  "author": "Foster",
  "createdUnix": "1333330355",
  "updatedUnix": "1336487126",
  "containsAdultContent": false,
  "uploadedBy": "foster xbl",
  "primaryFile": null,
  "files": [
    {
      "fileId": "49194",
      "name": "AnimatedEffects",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6654",
      "fileName": "AnimatedEffects-14192.zip",
      "uploadedUnix": "1333335199",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cbc47c6c2f0b659678c9739e668f80f2786124c16f06e699566dc0dd6c102f3e/analysis/1406792711/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AnimatedEffects-14192.zip?fid=49194&ttl=1535777632&ri=8192&rs=8192&setec=f5ebfff91af62dbd57d96a135471118d"
    },
    {
      "fileId": "49327",
      "name": "CheatersResource",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "CheatersResource-14192.zip",
      "uploadedUnix": "1333370985",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5f86ab83b893642d1fba82e11562629ef73df77f444fcbd3cc7ae3d6c529c0cd/analysis/1406793387/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CheatersResource-14192.zip?fid=49327&ttl=1535777633&ri=8192&rs=8192&setec=134756a5aee7ce14a64e7af5d8f7cd82"
    },
    {
      "fileId": "57083",
      "name": "Animated Enchantment Effects v2_0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10841",
      "fileName": "Animated Enchantment Effects v2_0-14192-2-0.zip",
      "uploadedUnix": "1335639410",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/49fe3f2f583ac3d40174a530215e9658c0d613b8eb39fe3cad067b69c4675c3a/analysis/1406851708/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Animated%20Enchantment%20Effects%20v2_0-14192-2-0.zip?fid=57083&ttl=1535777633&ri=8192&rs=8192&setec=97ec746a88a8f3accdab02310833a3d4"
    },
    {
      "fileId": "59742",
      "name": "Cheaters Txt UPDATED",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Cheaters Txt UPDATED-14192-2-0.zip",
      "uploadedUnix": "1336487126",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/14137797a4263371c448b34abb1806d9a4cd3155f8dd0c7ad45861c50aea6215/analysis/1406877553/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cheaters%20Txt%20UPDATED-14192-2-0.zip?fid=59742&ttl=1535777634&ri=8192&rs=8192&setec=df95b1dbb6e2631455232980716c7328"
    }
  ]
}