{
  "modId": 14203.0,
  "modName": "Tim the Blacksmith",
  "summary": "A handy \\\"other\\\" Master Blacksmith",
  "descriptionHtml": "Years ago the great Eorland Grey-Mane, took an apprentice. His name was Tim. He studied long and hard under his master, and learned quickly. Many years passed, and Eorland decided he was ready to be named a Master Blacksmith in his own right. All he had to do was forge his masterpiece. A blade of such beauty that all evil doers who looked upon its might would tremble in fear, and all those of good heart would be bolstered by its greatness. As Tim set out to work on this wonder, he was suddenly struck from behind, and pushed to his fiery death in the Sky Forge.\r\n\r\nEorland, overcome with grief, never took another apprentice, and the killer was never found. Today the ghostly spirit of Tim wanders Whiterun in search of his unknown assasin. Even in this non-corporeal form he has retained his vast blacksmithing knowledge, and teaches any who request it.\r\n\r\n\r\n===== Non RP Explanation =====\r\n\r\nThis mod adds a ghost NPC to Whiterun who will teach the player Master Level Blacksmithing (to the game max 90). I always hated that you had to be a companion to get Eorland to teach you. I mean, I couldn\\'t think of a good enough reason why the Arch Mage or Master Thief should have a need to be a Companion. So this fixes that. He can usually be found around the base of the Sky Forge or around Jorvaskr.\r\n\r\nEnjoy. ",
  "categoryId": "33",
  "version": "1.0",
  "author": "ferogain",
  "createdUnix": "1333347469",
  "updatedUnix": "1333347587",
  "containsAdultContent": false,
  "uploadedBy": "ferogain",
  "primaryFile": null,
  "files": [
    {
      "fileId": "49254",
      "name": "Tim the Blacksmith",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Tim the Blacksmith-14203-1-0.zip",
      "uploadedUnix": "1333347587",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b6d5c11ca882a448adbe39472595b3bc54694a458ccac98edfcddd8c45c7c72a/analysis/1406792912/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tim%20the%20Blacksmith-14203-1-0.zip?fid=49254&ttl=1535777669&ri=8192&rs=8192&setec=aac40a8be0c5846045e5ea0ff5636d18"
    }
  ]
}