{
  "modId": 14208.0,
  "modName": "Crafting Compatible - Armoury of Tamriel",
  "summary": "This is a standalone version of Baratan\\'s Crafting 300 - Armoury of Tamriel mod. It is designed for compatibility with other mods that affect any aspect of crafting. This mod adds massive variety to the weapon structure in Skyrim. ",
  "descriptionHtml": "[b]Contents[/b]\r\nI - Credits\r\nII - Description\r\nIII - Installation and Files\r\nIV - Compatibility and Load Order\r\nV - Version History\r\nVI - Contact, Bugs, and Suggestions\r\n\r\n[b]Credits[/b]\r\nCredit for the new textures and object files goes to [b]Baratan[/b]. \r\nOriginal idea comes from Baratan\\'s [url=http://skyrim.nexusmods.com/downloads/file.php?id=2933]Crafting 300 - Armoury of Tamriel[/url].\r\n\r\nI highly recommend you use the original Crafting 300 mod unless you have a compatibility problem. The original version includes a complete overhaul and improvement of the smithing system, as well as lots of unique items.\r\n\r\n[b]Description[/b]\r\nThis mod does the following things.\r\n- Makes weapon material and style independent. This allows the creation of Orcish style iron weaponry, or Elven style ebony weaponry, as well as many others. This separation adds approximately 500 new weapons to the game.\r\n- Adds varieties of arrows in a similar manner to weapons. About 80 new arrow varieties.\r\n- Adds crafting and tempering recipes for all new weapons. Recipes have been updated from vanilla to be more consistent across materials and styles, as well as more realistic. There may be a vanilla recipe version in the future.\r\n- Updates vanilla weapons with nice new textures. \r\n- Makes very large lists of items in the Smithing menu. The items are well-organized within the Smithing menu, but be warned, there are a lot of items. \r\n\r\nThis mod does NOT do the following things.\r\n- Add weapons to leveled loot lists or vendors. The only way to get the new weapons is by crafting, for now. The reason for this is to provide maximum compatibility with other mods that may affect leveled loot lists. If you want to find the new weapons in the game, you\\'ll have to use the original Crafting 300 mod. \r\n- Modify the Smithing perk tree or experience gain. \r\n- Add new weapon meshes. The new weapons are all based off vanilla Skyrim models, but with updated textures, normal maps, UV maps, environment maps, etc.\r\n\r\n[b]Installation and Files[/b]\r\nThere are three files available. \r\n\r\nCrafting Compatible Full - This includes the textures and the plugin. If in doubt, download this file. Doesn\\'t include the extras file. \r\nCrafting Compatible Plugin Only - This includes just the plugin file. You can use this if you have previously downloaded Baratan\\'s Crafting 300 - Armoury of Tamriel mod. However, if you deactivate his mod with NMM, it will remove the necessary files. So you\\'ll need to leave it activated and just disable (uncheck) the .esp, or take some appropriate actions to ensure that ALL the folders named 300(material type) located in meshes\\\\weapons and textures\\\\weapons in the Skyrim Data folder are still there with their original paths.\r\nCrafting Compatible Extras - This includes vanilla arrow recipes, Silver Sword and Greatsword recipes, and the Imperial Sword recipe. The reason for this separation is the fact that these recipes are common in other mods. If they were included in Crafting Compatible, there would be duplicate recipes. If you have CCO, you don\\'t need this file. If in doubt, also download this file.\r\n\r\nInstallation with Nexus Mod Manager\r\n1. Download appropriate files with NMM.\r\n2. Activate the appropriate files in NMM.\r\n3. Make sure the appropriate plugin(s) are checked in the Skyrim launcher Data Files dialog.\r\n\r\nManual Installation\r\n1. Download appropriate files.\r\n2. Extract the archive to the Data folder in the Skyrim folder, probably buried in Steam somewhere.\r\n3. Activate the plugin in the Skyrim launcher Data Files dialog.\r\n\r\nIf weapons aren\\'t showing up in game, it\\'s probably because the texture and mesh files aren\\'t in the right place. Textures and Meshes folders in the Full installation need to go directly in the Skyrim Data folder. \r\n\r\n[b]Compatibility and Load Order[/b]\r\nThis mod just adds new recipes and weapons to the game, so it should be compatible with just about anything. However, since it also modifies vanilla weapon names and recipes, you may get some inconsistencies if you load things after this mod. Everything should still work, and you can probably fix the issue by loaded Crafting Compatible after any relevant mods.\r\n\r\nThis mod was designed with Headbomb\\'s [url=http://skyrim.nexusmods.com/downloads/file.php?id=8003]Complete Crafting Overhaul[/url] in mind. All the recipes match those, so you\\'re all set if you use CCO. If you do use CCO, be sure to load Crafting Compatible AFTER CCO. In the future, I may make a version that uses vanilla recipes, since some people don\\'t like CCO\\'s recipes. \r\n\r\nThe arrow names in Crafting Compatible were designed to work with Headbomb\\'s [url=http://skyrim.nexusmods.com/downloads/file.php?id=2730]Better Sorting[/url] mod, which I highly recommend. If you don\\'t use that, then it\\'s possible that you\\'ll have all sorts of different arrow names, but everything should still work. \r\n\r\nWhen in doubt, load Crafting Compatible AFTER other stuff.\r\n\r\n[b]Version History[/b]\r\n1.0 - Initial release. Added all combinations of weapon styles and materials. Added all combinations of arrow styles and materials. Changed the magnitude of the Silver material bonus against undead from +20 damage to +5 damage due to ease of crafting Silver weapons.\r\n\r\n[b]Contact, Bugs, and Suggestions[/b]\r\nFeel free to post any bugs you encounter or suggestions you have in the comments. I\\'m very open to making modifications based on what people want.\r\nFeel free to PM me as well, or you can email me at moldyviolinist AT gmail ",
  "categoryId": "55",
  "version": "1.0",
  "author": "moldyviolinist",
  "createdUnix": "1333352892",
  "updatedUnix": "1333394103",
  "containsAdultContent": false,
  "uploadedBy": "moldyviolinist",
  "primaryFile": null,
  "files": [
    {
      "fileId": "49316",
      "name": "Crafting Compatible Full ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "341804",
      "fileName": "Crafting Compatible Full -14208.7z",
      "uploadedUnix": "1333366649",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Crafting%20Compatible%20Full%20-14208.7z?fid=49316&ttl=1535777678&ri=8192&rs=8192&setec=874da30468fc280b8854623a003eb0b0"
    },
    {
      "fileId": "49422",
      "name": "Crafting Compatible Plugin Only",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "48",
      "fileName": "Crafting Compatible Plugin Only-14208-1-0.7z",
      "uploadedUnix": "1333394042",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/95e757042785449bd4c8b97fa90e8359a682f1f3425873606a4d0cfed7075bcc/analysis/1406793847/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Crafting%20Compatible%20Plugin%20Only-14208-1-0.7z?fid=49422&ttl=1535777679&ri=8192&rs=8192&setec=2cc8b20abbbd3458c76b654d44593456"
    },
    {
      "fileId": "49423",
      "name": "Crafting Compatible Extras",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Crafting Compatible Extras-14208-1-0.7z",
      "uploadedUnix": "1333394103",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8d9753e76bdd628fa8698cc9a5246ba4338179691b12605e4a043fe14e065daa/analysis/1406793847/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Crafting%20Compatible%20Extras-14208-1-0.7z?fid=49423&ttl=1535777679&ri=8192&rs=8192&setec=2459cd5feb7e002c648e226e354e2bf7"
    }
  ]
}