{
  "modId": 14210.0,
  "modName": "Destruction Damage Enchantment",
  "summary": "adds a fortify destruction damage enchantment to Skyrim. ",
  "descriptionHtml": "This simple mod adds a fortify destruction damage enchantment to the game. I think the biggest problem with destruction spells is that their damage can\\'t be modified like with melee and marksman attacks, while melee attacks can be amplified greatly though enchanting and smithing, destruction magic can only be modified in terms of magicka consumption rather then damage. This mod was intended to make the enchantment skill more worth while for mages by adding a destruction damage enchantment to the game which mirrors the fortify marksman, two-handed, and one-handed enchantments that are already available in the game. Enchanted items with the Fortify Destruction Damage Enchantment can be found is several locations listed below.\r\n\r\n\r\nLocations:\r\n\r\n  The Gloves of Destruction can be found in the midden dark at the college of winterhold. \r\n\r\n  Another Gloves of Destruction can be found at Hag\\'s End \r\n  \r\n  The Fur shoes of Destruction can be found if Farengar\\'s room, by his bed, in Dragonsreach.\r\n\r\n\r\nInformation:\r\n \r\nThe enchantments on the items are weak, and are intended for disenchanting and use by skilled enchanters.\r\n\r\nWith a level 100 maxed out enchantment skill you should get a 40% damage bonus, like other fortify damage enchantments.\r\n\r\nI recommend playing as a spell-warrior with this mod; using a  one-handed melee weapon and destruction magic, though the mod works great playing as a pure mage as well.",
  "categoryId": "75",
  "version": "1",
  "author": "Bebop_Monkey_X",
  "createdUnix": "1333356499",
  "updatedUnix": "1333356690",
  "containsAdultContent": false,
  "uploadedBy": "Bebop_Monkey_X",
  "primaryFile": null,
  "files": [
    {
      "fileId": "49276",
      "name": "Destruction Damage Enchantment",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Destruction Damage Enchantment-14210.rar",
      "uploadedUnix": "1333356690",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/68d50a054f9c2d70607516f91355635895c53c1e51b1905b21850b2574cdab18/analysis/1406793062/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Destruction%20Damage%20Enchantment-14210.rar?fid=49276&ttl=1535777681&ri=8192&rs=8192&setec=72e84b26cf04a20658c8da49f24c0413"
    }
  ]
}