{
  "modId": 14215.0,
  "modName": "CM Boethiah Sacrifice",
  "summary": "Adds a non-essential follower to the road leading to Boethiah\\'s shrine.",
  "descriptionHtml": "CM Boethiah Sacrifice\r\n\r\nWHAT THIS MOD DOES: Adds a non-essential follower to the road leading to Boethiah\\'s shrine.\r\n\r\nLONGER DESCRIPTION: If you use any mod that makes Skyrim\\'s followers essential, you will be unable to complete Boethiah\\'s quest which calls for you to sacrifice them at the altar. This mod solves that problem by adding a non-essential follower to the road leading up to the shrine. The follower is named Brigitta and she has been stripped of all AI behavior, so she should stay right where she is. Additionally, having a potential follower right there by the shrine keeps you from having to travel elsewhere to find one, and it also saves you from having to sacrifice existing (and more fleshed out) Bethesda followers.\r\n\r\nUSAGE: If you already have a follower (and don\\'t have a mod which increases the max number you can take), dismiss them. Once you\\'re on the quest to visit Boethiah\\'s shrine, simply travel there and search for Brigitta on the road. Her disposition is already maxed out at 100 so she should immediately offer to join you when you open her dialogue. Take her a little further up the hill, meet with Boethiah\\'s representative and continue the quest. You\\'ll be instructed what to do from there.\r\n\r\nSPECIAL NOTE: When I first did this quest, I was confused about how to properly make the sacrifice. If this is your first time on the quest, you might want to note the following:\r\n\r\n\\\"She will give you the Blade of Sacrifice to make the sacrifice with. Lead any non-essential follower to the shrine and activate command mode (holding \\'use\\' or via the \\\"I need you to do something\\\" conversation option). Highlight the pillar and you should see \\\"Use the Pillar of sacrifice\\\". Tell them to do this and they will move towards it and be pulled in and stuck to it. If the follower is essential, he will not trigger the pillar.\\\" -From UESP.net\r\n\r\nINSTALLATION: Simply drop the plugin into your Skyrim Data folder. Make sure CM Boethiah Sacrifice.esp is checked in the Data Files menu of your Skyrim launcher.\r\n\r\nCONFLICTS: This mod will not conflict with any existing mods. All it does is add a non-essential NPC to the road leading to Boethiah\\'s shrine.\r\n\r\nBUGS: None that I\\'m aware of. Please post in the Nexus comments section if you find any.\r\n\r\nPERMISSIONS:\r\n\r\nDo not upload this mod to any website without permission from Cutthroat Mods.  Uploads to Steam Workshop are not permitted and will never be approved.  Translations into other languages are permitted  provided this Readme is included as is in English along with any translated versions.  Translated files can be uploaded to any website except Steam Workshop.  Permissions to do translations are not required.  If you have any questions or concerns please send email to cutthroatmods@hotmail.com. \r\n\r\n\r\nRevision History\r\n================\r\n\r\nVersion 1.1 - Brigitta is now a complete follower in case you want her as a companion.\r\n\r\nVersion 1.0 - Initial release.  Originally intended only as a sacrifice.\r\n\r\n\r\n\r\n",
  "categoryId": "66",
  "version": "1.1",
  "author": "Cutthroat Mods",
  "createdUnix": "1333371523",
  "updatedUnix": "1333477173",
  "containsAdultContent": false,
  "uploadedBy": "Blackie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "49329",
      "name": "CM Boethiah Sacrifice v_1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "113",
      "fileName": "CM Boethiah Sacrifice v_1_0-14215.7z",
      "uploadedUnix": "1333371681",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/361969d4eec2d99a3eb3fdd9fd4a8d428ed76073d9e8f43b4ddc2a427530c674/analysis/1406793389/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CM%20Boethiah%20Sacrifice%20v_1_0-14215.7z?fid=49329&ttl=1535777688&ri=8192&rs=8192&setec=decafb64e063712397649ce9aee839b1"
    },
    {
      "fileId": "49778",
      "name": "CM Boethiah Sacrifice v_1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "113",
      "fileName": "CM Boethiah Sacrifice v_1_1-14215-1-1.7z",
      "uploadedUnix": "1333477173",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e998aff02c3620737152aca736d536d7a05aeb71a42eef6e608585dfa7568d36/analysis/1406795405/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CM%20Boethiah%20Sacrifice%20v_1_1-14215-1-1.7z?fid=49778&ttl=1535777689&ri=8192&rs=8192&setec=deedc4ff426d7b60591423d2fbc2aed9"
    }
  ]
}