{
  "modId": 14229.0,
  "modName": "Brawler Unarmed Combat",
  "summary": "Adds a few items and perks to flesh out and balance unarmed combat without changing it too much from vanilla.",
  "descriptionHtml": "-I\\'m taking a break from Skyrim, so I won\\'t be updating this for a little while unless someone points out a specific problem. The permissions have been changed; feel free to alter /incorporate/whatever this mod (but don\\'t just upload it as-is somewhere else), just link back here to give credit. If you feel the damages need to be changed, they\\'re all under enchantments, named EnchArmorFortifyUA<type> (eg., EnchArmorFortifyUAIron for iron). Just change the magnitude of the enchantment effect.\r\n\r\nBrawler v0.9\r\n\r\nNew in 0.9:\r\n-Fist wraps have a chance to crit for a couple extra damage.\r\n-Fist wraps cannot be disarmed\r\n-Gave the fist wraps a model, but it is invisible. The inventory should now show a blank object instead of the previous object, and if you accidentally drop fist wraps you should be able to fumble around for the invisible object and pick it back up.\r\n-Added bound fist wraps. Farengar sells the spell tome. They will gain soul trap/banishing/etc from conjuration perks. Mystic binding adds 5 fire damage.\r\n\r\n-Note that the installation now involves meshes and not just the esp.\r\n\r\n\r\nThe Mod:\r\n\r\nExpands unarmed combat by adding fist weapons and unarmed talents. I wanted to keep the feel of vanilla unarmed combat while making it a little more viable and balanced. Most changes are geared towards light armor users, but the hand wraps should enable heavy armor users with the Fists of Steel perk to use weapon enchantments with their punches.\r\n\r\nThis not a monk mod. I made this mainly for myself and to learn my way around the creation kit, and I just wanted to punch things. If you are looking for a monk mod, I recommend looking at this project, which is much more ambitious than mine:\r\nhttp://forums.nexusmods.com/index.php?/topic/626294-wip-way-of-the-monk-unarmed-overhaul/\r\n\r\n\r\nWhat this mod changes:\r\n\r\n-Khajiit and Argonian innate 10 unarmed damage set to 4 like every other race.\r\n\r\n-Khajiit racial bonus changed to +5 instead of +15 unarmed damage. To balance this, Khajiit were given 20% frost resist. They have fur, so this made the most sense to me. Feel free to make a suggestion if you think it should be something else.\r\n\r\n-New perk in the Sneak tree: Cheap Shot. Unarmed sneak attacks do 4x normal damage. Added parallel to Backstab with identical requirements.\r\n\r\n-New Items:\r\n\r\nKnuckle weapons: one for each smithing type. They add unarmed damage. They can\\'t be enchanted. Each can be made at a forge (under jewelry) if the applicable smithing perk is present, and are equipped in unnamed slot 60.\r\n\r\nMaterial: Damage added:\r\nIron 10\r\nSteel 14\r\nElven 20\r\nDwarven 21\r\nScale 26\r\nOrc 27\r\nGlass 34\r\nEbony 36\r\nDaedric\t40\r\nDragon 46\r\n\r\nA side note on damages: In vanilla, Khajiit have 22 unarmed damage right from the start. With this mod, Khajiit have 9 base unarmed damage and  Steel Knuckles raise that to 23. Fists of Steel and the enchantment from Gloves of the Pugilist are not altered and can still be used.\r\n\r\nAlso added a Fist Wrap item. This is actually a weapon, and can hold weapon enchants, but does unarmed damage. It adds no damage (aside from any enchantments it has) and can be made at the forge with leather strips. The damage displayed in the inventory is actually your total unarmed damage, and will reflect any knuckle items/racial bonuses/etc you have.\r\n\r\nSilver-Infused Fist Wraps can also be crafted with a smithing skill of 45. These do additional damage to undead. They work exactly the same as the silver swords.\r\n\r\nNote: The fist wraps will be invisible if you drop them, but they are there. Move the cursor around until it gives you the option to pick them back up.\r\n\r\nNew Spell:\r\n\r\n-Bound Fist Wraps: These work exactly like the standard fist wraps, but are summoned. They benefit from all conjuration perks, though Mystic Binding has to work differently since they don\\'t have any damage of their own. Instead they gain 5 fire damage from mystic binding.\r\n\r\n\r\nInstallation:\r\nJust put the .esp file and meshes folder into your data folder. To uninstall, delete the esp file and the \\\"fist wraps\\\" folder under data/meshes/.\r\n\r\nOther notes:\r\n-Punching out someone\\'s soul is rather satisfying.\r\n-The Fist Wrap is a one-handed item and thus can be used with a shield (or spell, axe, whatever) in the offhand. Using some sort of skill-gaining offhand might make up some of the progression lost from not using any weapon skill, if that bothers you.\r\n-The new Fist items use the gold/silver ring models because I know nothing about that kind of thing. If you want to help me get actual knuckle weapon models in here, I would be very happy.\r\n-I could use input on the damage. I\\'ve started a new character to see how the damage feels compared to my past characters, but I could use other opinions.\r\n\r\nVersion: This is marked as a pre-1.0 version since I\\'m still testing it but it seems pretty stable. The only remaining issues are the invisible hand wraps and damage testing.\r\n\r\nCompatibility: The items shouldn\\'t cause issues with any mods since they are completely new. The Sneak tree was altered though, and that could conflict with other mods that do the same.\r\n-The Sneak tree conflict isn\\'t easily avoided, though you could simply add the Cheap Shot perk via console. If it\\'s an issue for a specific mod, let me know and I\\'ll see about making a compatible version.\r\n-For users with a mod that uses unnamed slot 60 for some other item, only one or the other will be able to be equipped. If this is an issue I may make an alternate version.\r\n-Adding the spell tome to Farengar\\'s shop might overwrite another mod\\'s changes to it. Just have this mod load after the other, buy the tome, then have the other load after this one to get its changes back.\r\n\r\n\r\n\r\nOlder updates:\r\n\r\nUpdate 0.8:\r\n\r\n-Added Silver Infused Fist Wraps. Does bonus damage to undead.\r\n-Changed silver knuckles to Daedric. (So if you made silver knuckles in a previous version you now have Daedric ones in your inventory)\r\n-Dragon damage was incorrect and has been fixed.\r\n\r\n\r\nUpdate 0.7:\r\n\r\nKnuckle damage is now added via enchantment instead of ability. For the player, this means that the damage increase will be shown on the item in-game, no perks are required to use them, and console commands are no longer necessary for existing characters. From a modder\\'s standpoint, this means that the damage can be tweaked more easily.\r\n\r\nUpdate 0.6:\r\n\r\nKnuckle items no longer use the ring slot. They\\'ve been moved to the unnamed slot 60. If this conflicts with a mod you\\'re using let me know and I\\'ll make an alternate version. They can\\'t be enchanted (the fist wraps still can). I\\'d like to combine the knuckles and wraps into one item, but this will work for now.\r\n\r\nUpdate 0.5:\r\n\r\nFist wraps are now silent for purposes of sneaking and have a (very) small chance to stagger. Looking into adding the damage to the fist wraps and having \\\"studded\\\" versions of those instead of using ring slots, but that\\'s not implemented yet.",
  "categoryId": "77",
  "version": "0.9a",
  "author": "Brawler",
  "createdUnix": "1333391436",
  "updatedUnix": "1333859606",
  "containsAdultContent": false,
  "uploadedBy": "brawlermod",
  "primaryFile": null,
  "files": [
    {
      "fileId": "49441",
      "name": "Brawler0dot5",
      "version": "0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "Brawler0dot5-14229.zip",
      "uploadedUnix": "1333398293",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/6949bb63d098adcd84bd897ebc7b47564f1f0f0e0bec21dd8d6e1d499bff1630/analysis/1406793962/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brawler0dot5-14229.zip?fid=49441&ttl=1535777711&ri=8192&rs=8192&setec=c47bdf8b0787c23b2253060ff3062875"
    },
    {
      "fileId": "49503",
      "name": "Brawler0dot55",
      "version": "0.55",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "Brawler0dot55-14229.zip",
      "uploadedUnix": "1333417500",
      "modVersion": "0.55",
      "virusScanUrl": "https://www.virustotal.com/file/46888daa981dd726075d05c430e8d83c044fc1ef10fd570eb00ec765461c738b/analysis/1406794402/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brawler0dot55-14229.zip?fid=49503&ttl=1535777711&ri=8192&rs=8192&setec=975aaec95df5e66ef81396af774e9f69"
    },
    {
      "fileId": "49538",
      "name": "Brawler0dot6",
      "version": "0.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "Brawler0dot6-14229.zip",
      "uploadedUnix": "1333422853",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/c5556abc2d9b8a6dfaf05c42aa586476ad9df3a658609d13bedbee5cf2749fea/analysis/1406794504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brawler0dot6-14229.zip?fid=49538&ttl=1535777711&ri=8192&rs=8192&setec=238ca05ee04a84eeea7e15e00de2b1f4"
    },
    {
      "fileId": "49761",
      "name": "Brawler0dot7",
      "version": "0.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "Brawler0dot7-14229.zip",
      "uploadedUnix": "1333476205",
      "modVersion": "0.7",
      "virusScanUrl": "https://www.virustotal.com/file/dd84d92c63500664068f14db31a3f1b65df942f52e444f2f3225631e4b658b98/analysis/1406795352/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brawler0dot7-14229.zip?fid=49761&ttl=1535777712&ri=8192&rs=8192&setec=70d3e5ae1281362ed4138a6729c56301"
    },
    {
      "fileId": "50159",
      "name": "Brawler0dot8",
      "version": "0.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "Brawler0dot8-14229.zip",
      "uploadedUnix": "1333589910",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/8824090050395dc10406caab350d156a135cf3bc76b9fad7a273924298134daa/analysis/1406797796/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brawler0dot8-14229.zip?fid=50159&ttl=1535777712&ri=8192&rs=8192&setec=ae23047432a1f06725eac6a7e571fad6"
    },
    {
      "fileId": "51119",
      "name": "Brawler0dot9",
      "version": "0.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "110",
      "fileName": "Brawler0dot9-14229.zip",
      "uploadedUnix": "1333857614",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/af4097b02cf28799d9e1d354384eb800627117c7d57a5ef6b217cdb36f4796d2/analysis/1406803266/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brawler0dot9-14229.zip?fid=51119&ttl=1535777713&ri=8192&rs=8192&setec=2a85ae49d76b4c26469521356ce8bb99"
    },
    {
      "fileId": "51131",
      "name": "Brawler0dot9a",
      "version": "0.9a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "108",
      "fileName": "Brawler0dot9a-14229-0-9a.zip",
      "uploadedUnix": "1333859606",
      "modVersion": "0.9a",
      "virusScanUrl": "https://www.virustotal.com/file/e2195a62be7e8cbdbc6f2acfa80b1ccc9fdc9e28c7f05121ccd04224058b2fc5/analysis/1406803443/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brawler0dot9a-14229-0-9a.zip?fid=51131&ttl=1535777713&ri=8192&rs=8192&setec=c3de90e46f4668eb93e45c2109617192"
    }
  ]
}