{
  "modId": 14261.0,
  "modName": "Clintsters Dovahkiin Lodge",
  "summary": "A large player house in the Rif with a stable and a new player horse",
  "descriptionHtml": "[img]http://static2.nexusmods.com/15/images/110/1529766-1333407172.jpg[/img]\r<br />\r<br />[img]http://static1.nexusmods.com/15/images/110/1529766-1340405482.jpg[/img]\r<br />\r<br />Name: Clintsters Dovahkiin Lodge\r<br />Version: 1.2\r<br />Category: Abodes - Player Home\r<br />Author: Clintster74\r<br />\r<br />[color=red][size=6]Please leave a comment if:[/size][/color]\r<br />You like the mod\r<br />You want to endorse the mod\r<br />You have a question about the mod\r<br />You are leaving a bug report\r<br />You have a constructive critique\r<br />\r<br />DO NOT leave a comment if:\r<br />You don&#39;t like the mod\r<br />You don&#39;t think it&#39;s lore friendly\r<br />You don&#39;t think it fits into your game\r<br />The textures are not to your preference\r<br />You are here to argue or verbally abuse other users or me&#33;\r<br />\r<br />If these guidelines are not followed, the Nexus moderation team will be contacted, and you will be dealt with accordingly. Thank You\r<br />\r<br />[color=blue][size=6]Description:[/size][/color]\r<br />A large player house locked in the Rift Region with its own player horse with armor.\r<br />\r<br />[color=blue][size=6]Details: [/size][/color]\r<br />In the basement you will find the main display room,full crafting, Alchemy and Enchanting room, a pool that is fed by the river   that you can sit and swim in and a bathroom with a tub you can sit in and a toilet you can sit on.\r<br />On the main floor there is a bedroom with three single beds, a kitchen with cooking pot and sitting area. A large room with two setting areas, a dining area and a display wall.\r<br />On the top floor you find a three bedrooms one with two double beds, one with one double bed the master bedroom and a sitting.\r<br />\r<br />[color=blue][size=6]Location[/size][/color]\r<br />West of Riften, half way between Faldar&#39;s Tooth and Treva&#39;s Watch on the north side of the river. Or North of heartwood mill across the river. Please see screen shot\r<br />\r<br />[color=yellow][size=6]What’s in the house:[/size][/color]\r<br />Six three row book shelves holding eighteen books per row.\r<br />Five one row book shelves holding eighteen books.\r<br />Sixteen mannequins.\r<br />Ten large weapons display cases.\r<br />Two small weapons display cases.\r<br />Twenty eight weapons racks.\r<br />Thirteen weapons plaques.\r<br />Ten shield plaques (shield only for the life of me I could not get the weapon part to work)\r<br />\r<br />[color=yellow][size=6]Crafting[/size][/color]\r<br />Cooking pot in the kitchen.\r<br />Alchemy work bench.\r<br />Enchanting work bench.\r<br />Blacksmith work bench.\r<br />Smelter.\r<br />Smiting Forge.\r<br />Blacksmith sharpening wheel.\r<br />Tanning rack.\r<br />\r<br />[color=blue][size=6]Outside:[/size][/color]\r<br />There is a front and back door to the house, a stable with a player horse (Draco set to essential) and a dock on the river\r<br />\r<br />[color=red][size=4]I will say this once and once only the house is locked and needs a key, the stable is locked and needs a key. There is a note on the step of the front door read the note to find the key to the house doors. Look through the house for a note with the location of the key to the stable[/size][/color] \r<br />\r<br />[color=red][size=6]Installation: [/size][/color]\r<br />Down load the file to the folder of your choice and unpack.\r<br />Navigate to:\r<br />C:Program FilesSteamSteamAppscommonskyrimData\r<br />For 64bit users:\r<br /> C:Program Filesx86SteamSteamAppscommonskyrimData \r<br />Drag and drop or copy and paste the .esp and meshes and textures folders and allow for overwrite\r<br />To uninstall remove the .esp, open the meshes folder and remove the Clintster74 folder same thing for the textures.\r<br />\r<br />[color=red][size=6]Requirements[/size][/color]\r<br />A legal copy of Skyrim patched to 1.6.89.0\r<br />\r<br />[color=red][size=6]Updated 1.2.1[/size][/color]\r<br />This is a small update, in playing the game I found a few rugs that were floating and a small gap between the house and the ground most may never notices but it drove me nuts so I fixed it. I also add a couple more weapons racks, plaques and few more shield plaques, because I was running out of them.\r<br />Just make a clean save outside of the house and copy the new .esp to your data folder.\r<br />For first time down loaders you will still need 1.2 main file for the meshes and textures.    \r<br />\r<br />[color=red][size=6]Updated 1.2[/size][/color]\r<br />Dimonized UNP Female body by Dimon99 if you use the female armon in this mod. found hear   [url=http://skyrim.nexusmods.com/mods/6709]UNP Body[/url]\r<br />This update fixes:\r<br />The exterior Navmesh problems; your followers will now follow you out the front or back door and not end up on the rocks to the right of the house.\r<br />The skin tone mismatch on the mannequins.\r<br />Addeds:\r<br />A bridge across the river making it easier to access the house.\r<br />A garden.\r<br />Ivy to the stone fence around the house and some flower pots/planters to the exterior.\r<br />Flower pots/planters to the interior.\r<br />One mannequin to the main floor.\r<br />Four large, seven small weapons display cases five weapons racks and three chests to the basement.\r<br />A new texture for Draco’s armor to match the new Dovah Armor.\r<br />Two dogs, Sassy and Abby (mother and daughter) Sassy is a house dog that will not follow you she is there just to guard the house, Abby will follow you she is set to essential and aggressive her speed has been set to 150. There are two small bugs with Abby, the first is, you have to talk to her twice to open her dialog the first time and the option to get her to follow you is not there tell her to wait then talk to her again (this will be the third time) and the option to follow you will be there, the second is the game bug with the stray dogs if you dismiss her you can’t get her to follow you again.\r<br />  \r<br />In trying to keep with the Dovahkiin/Dragonborn/Dragon Slayer theme of my house and the Nordic lands of the Skyrim, and that I play a Nord archer I have include a retexture of the heavy steel armor (changed to light armor) with three (deferent)  enactments on each piece of armor.  I made a female version of the armor using a mesh from “fgem” (see credits below) and made it to work will all races and the weight slider. There is only one set of armor, it can’t be purchased or crafted it is one of a kind. It can be improved by smiting with the same materials and skills as the steel armor \r<br />                    Helmet  Gauntlets   Boots     Cuirass    Shield\r<br />Value             1000      1000           1000       3400        1100\r<br />Weight                3          3                5          25             8\r<br />Armor rating       35         20              20          52           38\r<br />I have also taken the Nord hero weapons and retextured them and put three (same) enactments on them each of the four weapons. \r<br />\r<br />The arrows can be at a forge with firewood, quill and dragon bones. There are 250 arrows in one of the barrels in the basement the barrel next to it (top two right side as you look at them) has some quills in it. I have also added arrows and quills in some of the chest in the dungeons they are not available at vendors.\r<br />\r<br /> I made the armor and weapons to fit my game and style of play and chose the enactments for the same reasons, I will not alter or change the armor or weapons, [size=4]don’t ask[/size]. \r<br />In CK            Battle Axe:     war axe:    Greatsword:     Sword:     Bow:     Arrow: \r<br />Value                     900             750              1500         1100      1500            10\r<br />Weight                    20               11                 16              9          7\r<br />Damage                   28               18                 25             17        24            26\r<br />Crit dmg                  10                 6                  9              6          9\r<br />Speed                    .09               .09               .95              1          2.0000\r<br />I am including the read-me I made for what was a privet version of the mod with all the armor and weapons stats in the zip file.\r<br />\r<br />To install the update:\r<br />If you have items in the two nightstands at the back door remove them (the night stands have been removed) if you have items in the two barrels on the top row right end of the rack (as you are looking it) remove them the barrels have been renamed and new items put in them.\r<br /> \r<br />[color=orange][size=6]Credits:[/size][/color]\r<br />Bond123:\r<br />For the red bed spread (if you use this texture you must give credit to Bond)\r<br />Mystikhybrid:\r<br />For the horse armor Found hear\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=13348]Horse Armor[/url]\r<br />You must get permission from Mystikhybrid to use his horse armor.\r<br />Fgem:\r<br />For the female heavy steel armor mesh, from her Skimpy Armor set UNP UNPB – replacer and Standalone mod (making the women of Skyrim sexer one outfit at a time) found hear\r<br />[url=http://skyrim.nexusmods.com/mods/16050]Skimpy Armor Set[/url]\r<br />You must get permission from fgem for the mesh.\r<br />\r<br />[color=orange][size=6]Thanks to:[/size][/color]\r<br />Bond123 and Clintmich for pre testing V1.0 \r<br />Bond123 and Brendan62 for pre testing V1.2 and a lot of behind the scenes help. \r<br />Clintmich\r<br />For walking me through on how to add color and screen shots to the description.\r<br />\r<br />Bethesda\r<br />The nexus sites the best place to share mods and find help in modding.\r<br />\r<br />Tools used:\r<br />CK\r<br />Photo shop CS5\r<br />Gimp\r<br />Nifscope\r<br />\r<br />Bug’s: \r<br />As noted above with Abby\r<br />\r<br />Legal and Licensing:\r<br />You may use assets in this mod (except as noted above) in your own mod, just give me credit for my textures and models\r<br />You may not alter the mod for re upload.\r<br />You may not upload any of my assets to any other hosting site, this mod and my assets are for the Nexus And Skyrim Real Estate only&#33;&#33;&#33;&#33;&#33;.\r<br />Thanks for looking\r<br />Clintster74\r<br />",
  "categoryId": "67",
  "version": "1.2.1",
  "author": "Clintster74",
  "createdUnix": "1333425374",
  "updatedUnix": "1341426291",
  "containsAdultContent": false,
  "uploadedBy": "clintster74",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69731",
      "name": "Clintsters Dovahkiin Lodge V1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "58918",
      "fileName": "Clintsters Dovahkiin Lodge V1_2-14261-1-2.7z",
      "uploadedUnix": "1340408191",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/eb1a88ba5844f745ee86f1e87cf055f554961a369d5d885a7034c9ee13403368/analysis/1406976913/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Clintsters%20Dovahkiin%20Lodge%20V1_2-14261-1-2.7z?fid=69731&ttl=1535777759&ri=8192&rs=8192&setec=d51362a75a4529e3136684fdf74c552a"
    },
    {
      "fileId": "72167",
      "name": "Clintsters Dovahkiin Lodge v1_2_1",
      "version": "1.2.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "542",
      "fileName": "Clintsters Dovahkiin Lodge v1_2_1-14261-1-2-1.7z",
      "uploadedUnix": "1341426291",
      "modVersion": "1.2.1",
      "virusScanUrl": "https://www.virustotal.com/file/2f7bae70300786e41c626cd764c5d9f480f1b62da71c21b3f2d48aa2588f7d2a/analysis/1407001051/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Clintsters%20Dovahkiin%20Lodge%20v1_2_1-14261-1-2-1.7z?fid=72167&ttl=1535777760&ri=8192&rs=8192&setec=6dfd92c3ea98a5535edb57d4e86ceeee"
    }
  ]
}