{
  "modId": 14272.0,
  "modName": "Jenna -Just Jenna- CBBEV3 Jordis Replacer -NSFW-",
  "summary": "Jenna used to be Jordis the Housecarl of Solitude. I just did a revamp and rename nothing fancy but she turned out pretty sweet. ",
  "descriptionHtml": "Jenna\r\n\r\nJust a remake of Jordis the Sword Maiden. I will let you figure who she is named after and yeah she\\'s an actress of sorts. :D She seems crazy fast when running and has incredible sword skills. I cant remember her perks but she is set to essential. Unfortunately when I renamed the files I lost the ability to further edit her or look up her config (trial and error) but she works great! (the Scotch probably had something to do with it too). Nothing has changed in her AI and yes you still have to buy Proudspire, help 5 people out in Solitude and become Thane if you wish to possess her. This may make gathering all those Septims a little less painful knowing what\\'s waiting for you  when you can afford Proudspire. ;) \r\nHave fun with her and let me know what you think! \r\n\r\nNOTE: *****If you currently have a modded HousecarlSolitude.esp and Jordis\\'s Meshes (facegoem) and Textures (facetint) in files in your Skyrim Data folder you may want to remove them or uninstall your previous Jordis mod or you can expect crashes!*****\r\n\r\nThese mods are used in my screenies; You will need all but the Hentai Armor if you want her to look similar. \r\n\r\nApachii Hair with my custom blonde coloring\r\nBella\\'s Better Faces - with makeup #1 and no shine\r\nCaliente\\'s - Curvy Body \r\nNavetsea\\'s - CBBE Skin, muscle and thin landing strip mods\r\nLogRaam\\'s The Eyes of Beauty - Light Blue Eyes \r\nRan\\'s Eyeliner \r\nHentai Mixed Armor by MAK\r\nMonoS94\\'s - Glosstech No Gloss V5\r\n\r\nInventory: From what I can remember she may have her standard sword but she wont have clothes. *Nude* on arrival... \r\n\r\nMy take on Makeup on Female and Male NPC\\'s not being \\\"Lore Friendly\\\"\r\n\r\nThere are a lot of people playing this game that think the use of make-up is not lore friendly and so they are hesitant about using character mods like mine that use makeup or beautification mods. I would ask you to consider these following historical tidbits in relation to being lore friendly. Makeup is documented to have been used by the Ancient Egyptians over 10,000 years ago by paleontologists. Makeup was also documented to be in use by the Greeks, Romans and other ancient societies, including tribal body and face painting by Ancient Briton and Germanic tribes. To me it is completely plausible for makeup to be used in Skyrim given Bethesda supplied it and used it in the game on its own NPC\\'s. Inescapably Skyrim\\'s lore is tied to our history in some way shape or form, the latest \\\"trend\\\" of having NPC\\'s look more natural is more likely a current trend in modern use of makeup and not a direct reflection on the lore of this game or any game that that bases its lore partially on human medieval and ancient history. It is inarguable that Skyrim spans the times from early man to the late 16th century with the various in-game elements it provides us. Note the use of mammoths and saber tooth cats and then fast forward to some of the more modern items in the game such as steel bear traps (which were recorded to be first in use in the late 16th century). It is perfectly fine and period to this game to have your characters kicking ass in black eyeliner, eye shadow and red lipstick. Don\\'t let someone tell you it isn\\'t lore friendly because it really is. Given the choices of races we have in Skyrim it may not only be lore friendly but very plausible on some characters depending on their status and rank within their society. In the end it is completely your choice on how you want your NPC\\'s and PC\\'s to look. I personally am not interested in having androgyny rule my game so I opted to creating and sharing my own female characters that cannot be mistaken for anything else. \r\n\r\nThanks for reading,\r\n\r\nFalmerBane",
  "categoryId": "66",
  "version": "1.0",
  "author": "FalmerBane",
  "createdUnix": "1333446722",
  "updatedUnix": "1333446829",
  "containsAdultContent": true,
  "uploadedBy": "FalmerBane",
  "primaryFile": null,
  "files": [
    {
      "fileId": "49642",
      "name": "Jenna Companion CBBEV3",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "828",
      "fileName": "Jenna Companion CBBEV3-14272-1-0.zip",
      "uploadedUnix": "1333446829",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4efafbe4910d74547aa8da4b2f3fba328ee52aae8183cd3bc6a62e4cec31c47b/analysis/1406794992/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jenna%20Companion%20CBBEV3-14272-1-0.zip?fid=49642&ttl=1535777778&ri=8192&rs=8192&setec=bc0cc8fb5063ded6f9b4a14663de935d"
    }
  ]
}