{
  "modId": 14292.0,
  "modName": "Markarth Undercity BETA",
  "summary": "\\\"Markarth Undercity\\\" adds several hours of quality playtime and is a mod of extensive addon-like size.",
  "descriptionHtml": "\\\"Markarth Undercity\\\" adds several hours of quality playtime and is a mod of extensive addon-like size.\r\n\r\nMOD CONTENT:\r\n-Adds a huge network of areas under the city of Markarth\r\n-Adds an epic main quest guiding you through the depths of Undercity\r\n-Adds several side quests of different length and complexity\r\n-Adds several new, learnable recipes for weapons of surperior quality\r\n-All enemies had a complete overhaul with adjusted abilities, hitpoints and overall strength. You will only encounter completely custom made enemies!\r\n-Adds dozens of new items, like potions, ingrediences, weapons, armor, staffs, ammunition, spells and jewelry\r\n-Adds pages after pages of background story about the excavation of Undercity\r\n-Adds three new merchants\r\n-Adds two new followers\r\n-And many more for you to discover\r\n\r\n\r\nDIFFICULTY: \r\n-This mod is balanced for higher level characters. Master will now be truely masterful, only recommended for very well equipped characters. Adept will work for most high level characters with decent gear and appropriate tactics. (please don\\'t forget to use shouts, potions and poisions) Novice might be appropriate for mid-level character with decent gear.\r\n\r\n\r\nSPOILER: \r\n-New weapons and armor are very good but not better than highly tweaked crafted gear. Any new buffs are rare consumables with temporary effects only. Therefore, this mods does not harm Skyrim\\'s balancing\r\n-Quests are oftenly started by reading notes, journals or books. Any keys you might need are easy to find or highlighted by questmarkers\r\n-Sheyla and Qadarji have rare artifacts for offer\r\n-Added a playthrough to answer all your questions\r\n\r\n\r\nDEVELOPMENT: \r\n-All areas and quests are finished for now, tested and as far as I can tell free of bugs. However, an area like an underground city can always be extended with new, optional areas, new side quests, new items, area overhauls and voice acting. Stay tuned!\r\n\r\nKNOWN ISSUES: \r\n-As all mods, it might conflict with other content adding mods\r\n-Due to the well known \\\"navmesh bug\\\" of patch 1.5 some savegames might crash with this mod.Try loading different savegames or untick other mods for the time playing Markarth Undercity. However, there isn\\'t much I can do at the moment but to wait for Bathesda\\'s next patch. Please be patient if you\\'re encountering any CTDs. \r\n-Please don\\'t comment about known issues\r\n\r\nMISC:\r\n-My goal is to add mods which don\\'t feel like mods. The new content should flow with Skyrim like its suppost to be there\r\n-Please like if you enjoyed playing the mod for a representative rating\r\n-A special thanks goes to hellcat5 and all people at the Bathesda forum who helped me to solve problems\r\n\r\n",
  "categoryId": "88",
  "version": "1.0",
  "author": "Bulkbu",
  "createdUnix": "1333463990",
  "updatedUnix": "1333712022",
  "containsAdultContent": false,
  "uploadedBy": "Bulkbu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "49706",
      "name": "MarkarthUndercity",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "946",
      "fileName": "MarkarthUndercity-14292.rar",
      "uploadedUnix": "1333464050",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/74dc9da2ecaf55584c8ddb51255b4341fda6d3a544de779e7190713278c0d233/analysis/1406795251/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MarkarthUndercity-14292.rar?fid=49706&ttl=1535777804&ri=8192&rs=8192&setec=258faa716406ef610314e8658e403437"
    },
    {
      "fileId": "50583",
      "name": "Markarth Undercity Beta ESM",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "915",
      "fileName": "Markarth Undercity Beta ESM-14292-1.rar",
      "uploadedUnix": "1333712022",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4490aba8d6696c613a72ea1bba9940b0c95f411f1ce1ca1d7532530aeb94181f/analysis/1406800385/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Markarth%20Undercity%20Beta%20ESM-14292-1.rar?fid=50583&ttl=1535777805&ri=8192&rs=8192&setec=c769f65442f23c2b6e5cea4e4dab74a9"
    }
  ]
}