{
  "modId": 14329.0,
  "modName": "Shining Restoration - Restoration Overhaul",
  "summary": "A complete overhaul of the Restoration, making it a respectable branch of magic worth using.",
  "descriptionHtml": "Skyrim\\'s Restoration skill has always seemed lacking to me, in terms of overall thought and effort Bethesda put into it. It seems to me they just threw a bunch of random ideas, skills, and perks into a blender and stuffed it into the game. This is why most people will not use Restoration past its typical healing spells. This mod tries to change that, making the Restoration skill a great help in combat, being the great support magic and the ultimate weapon against the undead. As Collette likes to say, \\\"Restoration is a perfectly valid school of magic.\\\" Now that is actually true. I think she will be proud.\r\n\r\n[u]Changes[/u]\r\n- Increased the power of all wards by 50%, and added an Expert level ward, the Grand Ward. \r\n- All Turn Undead spells changed to Banish Undead, which instantly kills an undead within a certain level and absorbs its soul (Soul Trap effect). Level is not changed by Necromage perk.\r\n- Added 2 Apprentice and Adept level Circle of Protection spells, named Holy Circle and Shielding Circle, which makes undeads within a certain level flee and set them on fire for a long period of time.\r\n- Increased the power of Master Restoration spell.\r\n- Changed the structure of the Restoration perk tree so that it wasn\\'t just random branches sticking out of nowhere. \r\n- Added a new perk, Savior, which enables Healing spells to heal every ally around you, like the Grand Healing effect. (Has not gotten this to work, not sure why this is.)\r\n- Renamed Close Wounds to Great Healing, since Close Wounds just sounds stupid.\r\n\r\n[u]Future Plans[/u]\r\nI really want to get the new perk working, but I\\'m tried and tested for day, and it simply would not work. Anyone who knows how to do this please help me out here. It would be greatly appreciated. I will take any suggestions, so send me your ideas!\r\n\r\n[u]Known Bugs[/u]\r\n- The menu displays the Circle skills all as Expert skill, but they are corresponding to their own level perks (adept and apprentice restoration). Not sure why this is, but I really can\\'t fix it. \r\n- There can possibly be bugs with the Banish undead skills on very weak enemies or on low difficulties, where the soul trap won\\'t activate. It\\'s hard to explain why, but please tell me if you do have the problem.\r\n- Please report any bugs you find!\r\n\r\nThe robe I used in the screenshots are a retex of the Psiijic Robe by myself. If you like it, check out the mod here: http://skyrim.nexusmods.com/downloads/file.php?id=13235",
  "categoryId": "93",
  "version": "1.0",
  "author": "Ting",
  "createdUnix": "1333507580",
  "updatedUnix": "1333507720",
  "containsAdultContent": false,
  "uploadedBy": "tinghshi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "49906",
      "name": "Shining Restoration",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Shining Restoration-14329-1-0.rar",
      "uploadedUnix": "1333507720",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/739a50cf510345835fbbde6f31858fd9d209cb9d85e3fb722eda152ad8a31915/analysis/1406796077/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shining%20Restoration-14329-1-0.rar?fid=49906&ttl=1535777861&ri=8192&rs=8192&setec=df6a9421ca670f91d0eb79b535bf1378"
    }
  ]
}