{
  "modId": 14368.0,
  "modName": "Camilla Valerius Replacer - Fire Mage -NSFW- CBBE and UNP",
  "summary": "Want a hotter looking Camilla and tired of hearing about that damned claw? I used features from actress Ava Mendes\\'s face and a darker skin tone on Camilla Valerius. She is a level 50 Adept Elemental Fire Mage. CBBEV3 and UNP Versions available. ",
  "descriptionHtml": "Sexy Camilla Replacer - Elemental Fire Mage Companion  \r\n\r\n********File updated 05/10/11, cleaned up her AI and her files. She should work much better now. You still may need the bat file to help her follow you and it is included. Should work with all bodies now!********\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=17079]Consuelo de Montoya[/url] Standalone version of this mod added 05/14/2012\r\n\r\nI got tired of hearing about that damned claw every time I went to the Riverwood Trader. That and Vanilla\\'s Camilla always looked like she was perpetually sucking on a straw to me. I decided to give her a little more \\\"spice\\\" and used a few facial features from the beautiful actress Ava Mendes (Fast and Furious 2 and Ghost Rider) and think my remake turned out rather well. I tried to keep her young looking and lean so her settings put her at about 5\\'6-7\\\" (.96) tall and her weight around 120-5 lbs (39) her skin is much darker than the Vanilla Camilla (see pics). \r\n\r\nNOTE: *****If you currently have a modded CamillaValerius.esp and Camilla\\'s Meshes (facegoem) and Textures (facetint) in files in your Skyrim Data folder you may want to remove them or uninstall your previous Camilla mod or you can expect crashes!*****\r\n\r\nThese mods are used in some of my screen shots; You will need all but the Hentai Mixed Armor if you want her to look similar. Once you have her do what you want... :) \r\n\r\nVoice: Female Eventone\r\nShe arrives Nudes!!! \r\nApachii Hair with my custom blonde coloring\r\nBella\\'s Better Faces - with makeup #1 and no shine\r\nCaliente\\'s - Curvy Body or Dimon99\\'s UNP Body\r\nNavetsea\\'s - CBBE Skin, muscle and thin landing strip mods \r\nRan\\'s Eyeliner \r\nHentai Mixed Armor by MAK\r\nMonoS94\\'s - Glosstech No Gloss V5\r\nWeapon is an fire enchanted Elven dagger\r\n\r\n***Note***: You will have needed to complete the Claw Quest for Lucan at the Riverwood Trader before Camilla will follow you! Thanks Nermal!\r\n\r\nFloating head fix: Because I changed her weight versus the Vanilla version you may get a gap at the neck upon first installing this mod. Here is a simple fix should this be something you are experiencing. Open console click on Camilla type in console setnpcweight 39, hit enter do a new save game then close and restart game. Should be fixed now.\r\n\r\n\r\nEasy Install: Use NMM or manually install the BSA, ESP and BAT Files in your Skyrim Data Folder. \r\n\r\n***Using the Bat File is simple. place the \\\"Follower\\\" file in your Skyrim Data file and then in-game hit ~ for the console and simply click on Camilla\\'s character so her number appears and then type in console \\\"bat follower\\\" (without quotation marks) and hit enter. You should see the follow me dialog. \r\n\r\nMy take on Makeup on Female and Male NPC\\'s not being \\\"Lore Friendly\\\"\r\n\r\nThere are a lot of people playing this game that think the use of make-up is not lore friendly and so they are hesitant about using character mods like mine that use makeup or beautification mods. I would ask you to consider these following historical tidbits in relation to being lore friendly. Makeup is documented to have been used by the Ancient Egyptians over 3,500 years ago by paleontologists. Makeup was also documented to be in use by the Greeks, Romans and other ancient societies, including tribal body and face painting by Ancient Briton and Germanic tribes. To me it is completely plausible for makeup to be used in Skyrim given Bethesda supplied it and used it in the game on its own NPC\\'s. Inescapably Skyrim\\'s lore is tied to our history in some way shape or form, the latest \\\"trend\\\" of having NPC\\'s look more natural is more likely a current trend in modern use of makeup and not a direct reflection on the lore of this game or any game that that bases its lore partially on human medieval and ancient history. It is inarguable that Skyrim spans the times from early man to the late 16th century with the various in-game elements it provides us. Note the use of mammoths and saber tooth cats and then fast forward to some of the more modern items in the game such as steel bear traps (which were recorded to be first in use in the late 16th century). It is perfectly fine and period to this game to have your characters kicking ass in black eyeliner, eye shadow and red lipstick. Don\\'t let someone tell you it isn\\'t lore friendly because it really is. Given the choices of races we have in Skyrim it may not only be lore friendly but very plausible on some characters depending on their status and rank within their society. In the end it is completely your choice on how you want your NPC\\'s and PC\\'s to look. I personally am not interested in having androgyny rule my game so I opted to creating and sharing my own female characters that cannot be mistaken for anything else. \r\n\r\nThanks for reading,\r\n\r\nFalmerBane",
  "categoryId": "66",
  "version": "1.0",
  "author": "FalmerBane",
  "createdUnix": "1333568482",
  "updatedUnix": "1336661524",
  "containsAdultContent": true,
  "uploadedBy": "FalmerBane",
  "primaryFile": null,
  "files": [
    {
      "fileId": "60152",
      "name": "Camilla Valerius Replacer Fire Mage Auto Level",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1479",
      "fileName": "Camilla Valerius Replacer Fire Mage Auto Level-14368.7z",
      "uploadedUnix": "1336626357",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6396c1dffa8f30a5b8d1f8f2cf386279ad5031c8268f70875a27c18801d7d38d/analysis/1406881748/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Camilla%20Valerius%20Replacer%20Fire%20Mage%20Auto%20Level-14368.7z?fid=60152&ttl=1535777929&ri=8192&rs=8192&setec=362758071e720537f5fe42889d4e06c0"
    },
    {
      "fileId": "60155",
      "name": "Camilla Valerius Replacer Fire Mage Calculated",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1479",
      "fileName": "Camilla Valerius Replacer Fire Mage Calculated-14368-1-1.7z",
      "uploadedUnix": "1336626435",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/652d6e0be0d9efdcfdb83fc5afb78b279fe89cecf2744676b644b77686fb3b44/analysis/1406881749/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Camilla%20Valerius%20Replacer%20Fire%20Mage%20Calculated-14368-1-1.7z?fid=60155&ttl=1535777929&ri=8192&rs=8192&setec=813869a521197f5888c5534b34de8643"
    },
    {
      "fileId": "60229",
      "name": "Camilla Valerius Replacer Elemental Fire Mage ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1480",
      "fileName": "Camilla Valerius Replacer Elemental Fire Mage -14368.7z",
      "uploadedUnix": "1336661443",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3cccb01360853b77f3035b59f74640f28627e9ec73997c1dc47523274af085f6/analysis/1406882511/",
      "changelogHtml": " Updated to work a little better, I also added two versions each main and optional files <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Camilla%20Valerius%20Replacer%20Elemental%20Fire%20Mage%20-14368.7z?fid=60229&ttl=1535777930&ri=8192&rs=8192&setec=6c9d2eb745c085017e4d535fdf6baa31"
    },
    {
      "fileId": "60231",
      "name": "Camilla Valerius Replacer - Fire Mage Auto Level",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1480",
      "fileName": "Camilla Valerius Replacer - Fire Mage Auto Level-14368.7z",
      "uploadedUnix": "1336661524",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6fd74e8fafd2a9c7bff195041e9f66e24003d2a8448f2220d316644c01b7e914/analysis/1406882523/",
      "changelogHtml": " Updated to work a little better, I also added two versions each main and optional files <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Camilla%20Valerius%20Replacer%20-%20Fire%20Mage%20Auto%20Level-14368.7z?fid=60231&ttl=1535777930&ri=8192&rs=8192&setec=176751454e3ceb645e06f7e95145f6cb"
    }
  ]
}