{
  "modId": 14369.0,
  "modName": "DCW isles restored still WIP",
  "summary": "not as epicly huge as the other one started out but will get their",
  "descriptionHtml": "to get to this mod there is a door at the base of the stairs to the skyforge you can use to enter\r\n\r\n\r\n\r\n\r\nit isnt as huge as the other DCW file started out, but my creation kit deleted all my other work for some strange reason. so this file i started out with the part of the world i was going to upload before the creation kit happened, this mod aim\\'s to create a new world(s) for you the player to explore and RP in, this mod will have everything for any arch type you play ranging from nobleman, and knight to necromage and just pure evil, and ETC...... \r\n\r\nthis file has elements from the other dcw file while adding new ideas i brought  to the table also adds a small taste to come of the underground world simply known as the undercombs, with the climate of blackreach with the -DCW- style building this will be a great place to explore, this map also has a few rooms that are simi done, you can find these rooms in the mages tower ( the tower with a working door and is near the statue of the nord fighting a dragon)  \r\n\r\nyou will see 3 rows of something cut into one of the mountain sides these will be ( when done) a small village and if you couldn\\'t piece together the top one yet its going to be an arena ( not finished) but will be complete with traps that the npc crowd will set off to hurt either you or the combatants.\r\n\r\n(((NEXT UPLOAD))))\r\n-more to the arena!\r\n-more inside area\\'s\r\n-more to the -DCW- castle\r\n-rooms for undercombs\r\n-a near functioning marketplace\r\n\r\n(((FUTURE UPLOADS))))\r\n-anything i can come up with\r\n-FAN ideas (message me if you want your idea\\'s in this mod) ((if your idea is added into this mod you WILL get credit for your idea or if you want your mod into this one. ans if i make a quest into your idea you will have a NPC named after you!!)\r\n-quest\\'s\r\n-epic battles which will put you at the edge of your chairs\r\n-and much much much more\r\n\r\n(((COMPLETION UPLOAD))))\r\nthe world spaces will be almost fully done (minus all the quests those will take time to voice act :)   )\r\nthe main world space i aim to be as big if not bigger than skyrim\\'s world space\r\n3-5 other world spaces that fits everyones needs from the noble knight to the evil mage and beyond.\r\ndungeons and temples and caves will be hand crafted (some i will make similar to some of skyrim\\'s but those will tie into the main story of the mod)\r\nnew hold\\'s ( which depending on which one your gona side with ) you can be the jarl or the hold and possibly be the ruler of this mod\r\nnew custom armors for you to enjoy ((hint grey warden, hawk champion))\r\nand many more.",
  "categoryId": "30",
  "version": "V.2",
  "author": "NINVUS",
  "createdUnix": "1333570932",
  "updatedUnix": "1333571704",
  "containsAdultContent": false,
  "uploadedBy": "ninvus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "50104",
      "name": "-DCW- isles RES",
      "version": "V.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "177",
      "fileName": "-DCW- isles RES-14369-V-2.rar",
      "uploadedUnix": "1333571704",
      "modVersion": "V.2",
      "virusScanUrl": "https://www.virustotal.com/file/1a7b86c14baeb7bd5edcd92d1ec35990bc648f2600084b41d40224da657862a8/analysis/1406797347/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/-DCW-%20isles%20RES-14369-V-2.rar?fid=50104&ttl=1535777931&ri=8192&rs=8192&setec=c6a2dd37da1e4a17b7c1f02cedbf4811"
    }
  ]
}