{
  "modId": 14365.0,
  "modName": "Non Combat Skills Dont Contribute to Player Level",
  "summary": "Script Dragon plugin to automatically stop Non Combat skills from contributing to player level. Also allows player to temporarily prevent any skill gains contributing to player level, via key press.",
  "descriptionHtml": "[heading][size=6][center][color=orange]Non Combat Skills Don\\'t Contribute to Player Level[/color][/center][/size][/heading]\r\n[size=1][center][*]a Script Dragon Plugin[/center][/size]\r\n\r\n--Requires ScriptDragon by Alexander Blade: [url=http://alexander.sannybuilder.com/?category=other&altname=skyrim_script_dragon]Download link[/url]\r\n\r\n[heading][size=3][color=#3CB371]Purpose[/color][/size][/heading]\r\nLike to train your blacksmithing(alchemy/enchanting etc) up high, but don\\'t want to gain 10 levels in the process? Tired of becoming horribly under powered against enemies because you focused on too much on your non-combat skills?  The original XSO and GSC plugins had this feature, (among others) but have become out-dated. This plugin breaks this feature out into a stand alone plugin that should not need to be updated (so no more issue with compatibility due to patches). Also, it improves the functionality a bit (before it didn\\'t work for lockpicking, skill trainers, persuades/bribes, etc).\r\n\r\n\r\n[heading][size=4.5][color=#00C5CD][u]Features:[/u][/color][/size][/heading]\r\n[list][*]Implements the feature to disable Non Combat Skills (Smithing, Enchanting, Alchemy Speechcraft, Lockpicking etc) from counting towards player character level-up.\r\n[*]Further allows user to take control via keypress, to turn on/off leveling for all skills, and assume manual control if so desired.\r\n[*]Basically re-implements (and improves upon) this feature from past mods XSO and GSC\r\n[/list]\r\n\r\n[heading][size=4.5][color=orange][u]Usage:[/u][/color][/size][/heading]\r\n[size=1.5][list][*]plugin has 3 modes, that user can switch between via keypress.\r\n[*]by default it is in AUTO leveling mode, where the plugin will automatically disable leveling for Non-combat skills.\r\n\r\n[*]pressing key (default k) switches to leveling OFF mode, where NO skill gains will contribute to leveling.\r\n[*]pressing button again switches to leveling ON mode, where ALL skill gains will contribute (just like Vanilla Skyrim)\r\n[*]pressing button again switches back to AUTO leveling mode.\r\n\r\n[*]Notifications are given in the Notification section (top left) to acknowledge mode switches, and when leveling is automatically enabled/disabled.\r\n[*]the game actually disables leveling via the console, and so you can see this if you open up the console to examine the commands.\r\n\r\n[*]the plugin operates on a 1second timer, so keypressed may take up to 1second to be recognized (still seems fairly responsive).  If you press it multiple times fast, only the first press registers. So if you want to press it in a row do it at 1 second intervals[/list]\r\n[/size]\r\n\r\n\r\n[heading][size=4.5][color=red][u]Disclaimer About Script Dragon[/u][/color][/size][/heading]\r\n[size=2]Script Dragon is very powerful, but also very dangerous (potentially). It doesn\\'t let you make mods, so much as full Windows Programs (that happen to have easy access to Skyrim\\'s scripting innards). This is a very dirty way of doing it, but it also works. What this means is that by downloading/using a SD plugin, you are downloading just another program to your computer, that has the potential to do all the same nasty things/risks that entails (eg. virus, spyware, logging, steal personal information, etc). Obviously this is a SD plugin, so I\\'m not saying don\\'t use this, I am just acknowledging the concerns as after using it, I am fully aware of them.\r\n\r\nSpecifically, to make this plugin work, I actually had to go around what little limits Script Dragon has. This is a windows program, and I am not a windows programmer (nor do I enjoy/want to be) so that probably isn\\'t the wisest decision. I took some precautions with this, but probably not enough. Shouldn\\'t cause any problems but you never know. I was certainly running \\\"fast and loose\\\".  I wanted this functionality for myself, and so I\\'m sharing it in case any others want. But it\\'s certainly not \\\"100% tested safe\\\".  The standard disclaimers apply.[/size]\r\n\r\n\r\n\r\n[heading][size=4.5][color=#3CB371][u]Background:[/u][/color][/size][/heading]\r\n[size=2]First there was the [url=http://skyrim.nexusmods.com/downloads/file.php?id=1992]XSO SD Plugin[/url] which was a handy way to customize some game settings, but also had some interesting extra features. Ones of most interest to me were the ability to change the level progression rate, perk distribution at level up, and allow some Non-combat skills to not count towards leveling.  As such things go in the modding community, the original author disappeared and the mod was abandoned/unsupported, due to the nature of Script Dragon, it quickly caused issues of compatibility with new patches to the game etc.\r\n\r\nEnter in the [url=http://skyrim.nexusmods.com/downloads/file.php?id=6469#content]GSC SD Plugin[/url] where a user of XSO took it upon themselves to take up the torch so to speak, and make their own version with almost all the features, and definitely all the features mentioned above. In a beautiful twist of irony, the same user disappeared/abandoned the new mod, which caused the same issues of compatibility.\r\n\r\nAfter a bit of digging, it was discovered that many of the \\\"Game settings\\\" the mod(s) changed could be changed by users themselves, manually entering them into the console (` key). Even those pertaining to leveling rates.  If one put them into a Skyrim batch scripted, this could be made less painful via the use of the \\\"bat\\\" console command.  However this was further improved with the use of [url=http://skyrim.nexusmods.com/downloads/file.php?id=5217]Kvalyr\\'s ZAutoexec SD plugin[/url], that allows you to automatically execute batch scripts at startup. Which can provide the same functionality as those aspects of XSO/GSC, but without the compatibility issues.\r\n\r\nFurther, the perk distribution functionality can be duplicated by using the [url=http://skyrim.nexusmods.com/downloads/file.php?id=1175]Community Uncapper mod[/url] to specify how many perks are gained at each level. This mod uses SKSE which doesn\\'t have the compatibility issues that can plague ambitious Script Dragon plugins.\r\n\r\nThe only functionality that was left was for non combat skills not contributing to level up. Enter this mod, where I unfortunately had to take it upon myself. However this mod was made with specific care to not have compatibility issues, and should not need updating due to Skyrim or Script Dragon version changes.  So using this mod, in conjunction with the other two should provide the most useful features of XSO/GSC.\r\n\r\nFor those that don\\'t like Script Dragon mods due to issue with lag time in version updates, I encourage you to look at this utility, [url=http://skyrim.nexusmods.com/downloads/file.php?id=12744]Skyrim Unplugged[/url] that takes care of the issue by stopping Skyrim from auto-patching, so you can keep playing your old version until all your plugins/mods are updated.[/size]\r\n\r\n\r\n[heading][size=4.5][color=#3CB371][u]Requirements:[/u][/color][/size][/heading]\r\n[list][*]Skyrim any version\r\n[*]ScriptDragon any version[/list]\r\n*Note: I haven\\'t tested other versions other then the last few, but I can\\'t see why not.\r\n\r\n\r\n[heading][size=4.5][color=orange][u]Installation:[/u][/color][/size][/heading][size=2]\r\n0. Install like a regular Script Dragon plugin. If you don\\'t know how\t/what that is, then you probably shouldn\\'t be using this. That being said...\r\n1. Extract DisableSkillLeveling.asi and DisableSkillLeveling.ini from the zip file to your Script Dragon Plugins folder (I use Skyrim\\\\data\\\\asi)\t\r\n2. Edit the DisableSkillLeveling.ini file in any text editor to change the key used to toggle the mode in-game commands to be executed and to enable/disable notifcations.\t\r\n3. Source code, and project files can be found in the archive in the \\\"source\\\" folder, for any that might be curious.\r\n[/size]\r\n\r\n[heading][size=4.5][color=#3CB371][u]Issues:[/u][/color][/size][/heading]\r\n[list][*] Due to the nature of how this plugin functions, it does not actually stop non-combat skills from leveling, specifically. What it does is detect when those skills may be gained and then temporarily disables leveling for all skills.  This generally works quite nicely, however it is not 100% foolproof. Specifically if you are in conversation with an NPC who is NOT the closest person too you (eg. in a crowd), then the \\\"auto-disable-dialogue\\\" will not engadge. Ie. You speechcraft gains due to persuade/intimidate etc, will count. So will skill trainors.  So make sure you are always standing closest to the person you are talking with, or use the manually toggle (via keypress) to force it on/off if the auto \\\"misses\\\".\r\n[*]Skill trainors will be detected as dialogue. Any skills trained will thus not count, even if they are non-combat. Not much I can do about this, which is why there is a manual mode that you can toggle on/off, to get the desired effect. (eg. switch to Levelling ON mode, so that training one-handed will contribute to level\r\n[*]Skill books technically count as \\\"menu-mode\\\" and so leveling would be disabled. However the script works on a 1second timer, and generally the skill gain happens so fast that the script can\\'t disable in time.  So skill books WILL contribute to player level. Again if you desire different results, use this manual toggle for this specific (and usually rare) instance.\r\n[*]One should notice that if you aren\\'t gaining levels due to non-combat skills, then you will be leveling slower (which is the point!), but a side effect is you will get less perks, especially if you want to spend your leveling perks on said non-combat skills. This mod is designed to duplicate/replace functionality found in the original XSO/GSC mod(s). As mentioned above, those mods had other features, one of which was the ability to modify the perk distribution (how many perks, and how often you earn them). It is recommended to use all the mods suggested above, to get all of the functionality, so that you can tweak your perks so that this is no longer an issue. (Generally that mod gave you a slower leveling curve, that non-combat skills could disrupt, so it allowed you to stop them from contributing to leveling, and increase the amount of perks to offset the slower leveling).\r\n[/list]\r\n\t\r\n[heading][size=4.5][color=#3CB371][u]Planned Features:[/u][/color][/size][/heading]\r\n[list][*]Fix any bugs if it doesn\\'t work, otherwise NONE\r\n[*]I didn\\'t want to write this mod, as it\\'s not my strength, so it was made so that it had to be done once and then left alone.\r\n[*]the game does send it\\'s command via the console, this can be seen. This might be a bit spammy, for those people that use the console, although I like it as it adds transparency (you can see exactly what this plugin is doing).  There is the potential to do this another way where it\\'s hidden.[/list]\r\n\t\r\n\r\n[heading][size=4.5][color=#3CB371][u]Update History:[/u][/color][/size][/heading]\r\n[list][*]v1.01 Added config file option to disable notifcations (April 9th 2012)\r\n[*]v1.0\tInitial Release (April 5th-sh 2012)[/list]\r\n\r\n\t\r\n\r\n=====================================\r\nRedistribution, Licence & Disclaimer:\r\n=====================================\r\n\r\nModifications of this script are allowed only where this notice is included, the author\\'s \r\ncopyright is acknowledged and credit is given to the original author of the script (aggies11).\r\n\r\nTHIS SOFTWARE IS PROVIDED BY THE AUTHOR \\\"AS IS\\\" AND ANY EXPRESS OR IMPLIED\r\nWARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\r\nFITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR\r\nCONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\r\nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\r\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\r\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\r\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF\r\nADVISED OF THE POSSIBILITY OF SUCH DAMAGE.",
  "categoryId": "73",
  "version": "1.01",
  "author": "aggies11",
  "createdUnix": "1333564421",
  "updatedUnix": "1334014189",
  "containsAdultContent": false,
  "uploadedBy": "aggies11",
  "primaryFile": null,
  "files": [
    {
      "fileId": "50102",
      "name": "Disable Skill Leveling v1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "58",
      "fileName": "Disable Skill Leveling v1-0-14365.zip",
      "uploadedUnix": "1333570351",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2f4308425f41849bcbc874251663f03913f7488539c27d520a99fcae25adc24c/analysis/1406797345/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Disable%20Skill%20Leveling%20v1-0-14365.zip?fid=50102&ttl=1535777926&ri=8192&rs=8192&setec=f3b30cde5ed5cf0fae41d4a9747986e1"
    },
    {
      "fileId": "51786",
      "name": "Disable Skill Leveling v1-01",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "59",
      "fileName": "Disable Skill Leveling v1-01-14365-1-01.zip",
      "uploadedUnix": "1334014189",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/6ddc372c2cec81075a26ce229208a73c3a78d005e806ffe83c1f0a10dfa7a220/analysis/1406806696/",
      "changelogHtml": " added config file option to hide/show notifications <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Disable%20Skill%20Leveling%20v1-01-14365-1-01.zip?fid=51786&ttl=1535777926&ri=8192&rs=8192&setec=f4e45450773528bcabe261a9848c0a71"
    }
  ]
}