{
  "modId": 14371.0,
  "modName": "Skill Grinding Cap",
  "summary": "The Skill Grinding Cap is based on the idea that there is only so much you can learn in a day.  After you sleep on it, (or 24 hours), you\\'ve had a chance to process what you\\'ve learned, you go back to normal, ready to learn more.  \r\n",
  "descriptionHtml": "Version 2.0.1 is here!!!\r\n===========================\r\nIt is strongly recommended that you make a uninstall the previous version, and make a clean save, before installing any updates.\r\n===========================\r\n\r\nThe Skill Grinding Cap is based on the idea that whether it\\'s your brains or muscles or spirit involved, there is only so much you can learn in a day.  \r\nAfter you sleep on it, (or 24 hours), you\\'ve had a chance to process what you\\'ve learned, you go back to normal, ready to learn more.  \r\n\r\nThis mod is for those who feel that near-endless \\\"skill grinding\\\" is immersion breaking.  This puts a limit on that.\r\n\r\n\r\nWhat it is:\r\n===========\r\nA Skill Grinding Cap is a type of Perk.  It is applied as the Magic Effect of a Spell that is cast on the player each time you increase a skill. The Skill Grinding Caps were reverse-engineered from the Stading Stones, but the effects work in the opposite direction.\r\n\r\nThere are now 5 Skill Leveling Inhibition Curves to choose from.  \r\nSLIC 1 .............................. 100%  (One and done.)\r\nSLIC 2 ....................... 75%, 100%\r\nSLIC 3 ................. 67%, 90%, 100%\r\nSLIC 4 .......... 50%, 75%, 90%, 100%  (The original inhibition curve.)\r\nSLIC 5 ... 50%, 75%, 87%, 95%, 100%\r\n\r\nEach one is applied to the player by a Spell --> Effect --> Perk combo for each value listed above\r\n\r\n\r\nIn addition to choosing which Skill Leveling Inhibition Curve to use, you also get to choose whether or not sleep will reset (lift) any caps, and how much sleep it will take to do so.\r\n\r\nFurthermore, you get to choose whether or not being awake long enough can lift any caps, and how long awake it will take, too.\r\n\r\n=========================================================================================\r\nCAUTION!!!  Do not set BOTH sleep and time awake to zero, or the Skill Grinding Caps will never get lifted.\r\n=========================================================================================\r\n\r\n\r\n\r\nHow it works:\r\n============\r\nThe first time you play after installing, you will have a Skill Grinding Cap Note added to your inventory.  Read that note to set the Skill Grinding Cap Options:\r\n\r\n\r\nOptions:\r\n-------\r\nFirst up, you choose whether you want to set a Skill Leveling Inhibition Curve for each skill individually, or by skill group (combat, magic, thief), or just use one for all skills.\r\n\r\nSecond off, you choose how much sleep it will take to reset any caps.  From 0 hours (sleep will not reset the caps), up to 8 hours.\r\n\r\nThridly, you choose how long you need to be awake to reset any caps.  From 0 hours (being awake will not reset caps), up to 24 hours.\r\n\r\nAnd finality, you get to choose whether to put the Skill Grinding Cap Note away unread (cancelling choices made).  Or if you\\'re keeping your choices, you have another choice whether to put the note back into your inventory, so you can change the settings later, or to destroy the note.  If you destroy the note, the settings are permanent.\r\n\r\n\r\n\r\n\r\n\r\nContents:\r\n======================\r\n1 Script .pex Compiled script file.\r\n1 Script .psc The script source file is included.\r\n1 Readme file\r\n1 Plugin .esp The Bethesda Plugin Data File, which itself contains the following...\r\n\r\n1 Quest Hidden, just for the script to be attached to.\r\n1 Book - The Skill Grinding Cap Note - to activate the options messages.\r\n126 Spells        -- 1 for each Skill Leveling Inhibition Curve percentage (50, 67, 75, 87, 90, 95, 100) so that\\'s 7 for each skill, and there are 18 skills.\r\n126 Magic Effects -- 1 for each Spell above\r\n126 Perks         -- 1 for each Magic Effect above\r\n\r\n(All of the items in the Creation Kit have a \\\"SGC\\\" prefix.)\r\n\r\n\r\n\r\n\r\nNMM Install (recommended)\r\n============\r\n1.  Click on the Download with NMM button on the File seciton.\r\n2.  In the Nexus Mod Manager, click on the Skill Grinding Cap entry in the Mods section.\r\n3.  Click the \\'Activates the Selected Mod\\' button on the left side toolbar.\r\n\r\n\r\nNMM Manual Install\r\n==================\r\n1.  Use the regular download link, and save the file someplace you can find it easily.\r\n2.  In NMM, click the top button on the left side toolbar, the \\\"Add Mod From File\\\" button.  In the dialog that opens, go to where you saved the file above and select it.\r\n3.  In the Nexus Mod Manager, click on the Skill Grinding Cap entry in the Mods section.\r\n4.  Click the \\'Activates the Selected Mod\\' button on the left side toolbar.\r\n\r\n\r\nNon-NMM Install\r\n============\r\n1.   Download the file manually.  \r\n2.   Extract the contents of the .7z file into your Skyrim Data folder.\r\n\t  (The SkillGrindCap.esp file must be in your ...\\\\Skyrim\\\\Data folder,\r\n\t  and the SkillGrindingCapScript.pex file must be in your ...\\\\Skyrim\\\\Data\\\\Scripts folder,\r\n\t  the SkillGrindingCapScript.psc file in the ...\\\\Skyrim\\\\Data\\\\Scripts\\\\Source folder is nice to look at if you want to see how it was written.)\r\n3.   Make sure the Skill Grinding Cap is checked (activated) in the Skyrim Data Files.\r\n\r\n\r\nNMM Uninstall\r\n=========\r\n1.  Start the Nexus Mod Manager.\r\n2.  Click on the Skill Grinding Cap name in the Mods section.\r\n3.  Click the Deactivate button.\r\n4.  Click the \\'Deletes the Selected Mod\\' button on the left side toolbar.\r\n5.  Make sure the \\'SkillGrindingCapScript.pex\\' file was removed from the ...Skyrim\\\\Data\\\\Scripts folder.  Delete it if it is there.\r\n6.  Make sure the \\'SkillGrindingCapScript.psc\\' file was removed from the ...Skyrim\\\\Data\\\\Scripts\\\\Source folder.  Delete it if it is there.\r\n\r\nNon-NMM Uninstall\r\n============\r\n1.  Open Windows Explorer and navigate to the ...Skyrim\\\\Data folder.\r\n2.  Delete the \\'SkillGrindCap.esp\\' file.\r\n3.  Navigate to the ...Skyrim\\\\Data\\\\Scripts folder.\r\n4.  Delete the \\'SkillGrindingCapScript.pex\\' file.\r\n5.  Navigate to the ...Skyrim\\\\Data\\\\Scripts\\\\Source folder.\r\n6.  Delete the \\'SkillGrindingCapScript.psc\\' file.\r\n\r\n\r\n\r\nIncompatibility\r\n===============\r\nThe Skill Grinding Cap mod, only adds items (Spells, Magic Effects, Perks, 2 scripts, a Book, and a Quest) and does not change any vanilla items or values.  So, it should be compatible with just about any other mod, as long as the other mod doesn\\'t add an item with the same name.  (That should be reasonably unlikely.)\r\n\r\nThe change made to the players Skill Advancement rates are done through multiplication, applied by a temporary Perk.  Another mod that modifies the Skill Advance rate (aka Skill Experience Gained Multiplier, aka Skill Experience Points), will either overwrite, or be overwritten, (depending on load order) or have the effects add together.  (i.e. multiply 0.25 by 0.5 and you get 0.125)\r\n\r\n\r\n\r\nHistory\r\n=======\r\n1.0 - April 04, 2012 - Initial release.\r\n1.1 - April 08, 2012 - Bug fix.  The Smithing, Sneak and Speech Skill Grinding Cap Perks were incorrectly Setting the Value of the Skill Advance to 0.5, 0.25, 0.1 and 0 for Level 1, 2, 3 and 4, respectively, instead of multiplying the skill advance by those amounts.  Fixed.  (Thanks to Fraquar for finding this.)\r\n2.0 - July 05, 2012 -- Major new release.  Options for which skill inhibition curve to use.  Options for how much sleep is needed to reset caps.  Options for how much time awake is needed to reset caps.\r\n2.0.1 -- July 06, 2012 -- A couple of bug-fixes (called it Archery instead of Marksman where it mattered, handled 0 time awake better), and all 216 Magic Effects are now flagged as Detrimental and show up red in the Active Effects now, like they should.\r\n\r\n\r\n\r\nFuture Plans:\r\n============\r\nNew ideas and new inspirations have appeared in the comments.  Version 3 is now a glimmer in my eye.\r\n\r\nContinuing goals...  \r\nI intend for this to remain a one .esp file mod.  (Plugin slots are a limited resource, I don\\'t want to use up more than necessary.)\r\n\r\n\r\n\r\nContact Info:\r\n============\r\nI\\'ll be monitoring the comment forum for this mod.\r\nYou can find me on the SkyrimNexus as \\'CalenEllefson\\',\r\nand on the BethSoft forums as \\'Calen Ellefson\\'\r\n\r\n\r\n===============\r\nPrivately, you can do whatever you want with this mod (you will anyhow).\r\nPublically, I want this mod to be exclusively available on the Skyrim Nexus.  \r\nOtherwise, what I ask in return is that you give me credit if you are inspired \r\nby any part of this mod.\r\n\r\nThis mod was originally inspired by a conversation in the [url=http://skyrim.nexusmods.com/downloads/file.php?id=12140]Epic Glory[/url] discussion forum.  \r\n",
  "categoryId": "73",
  "version": "2.0.1",
  "author": "CalenEllefson",
  "createdUnix": "1333572082",
  "updatedUnix": "1341616688",
  "containsAdultContent": false,
  "uploadedBy": "CalenEllefson",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51389",
      "name": "Skill Grinding Cap",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1411",
      "fileName": "Skill Grinding Cap-14371-1-1.7z",
      "uploadedUnix": "1333917747",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e3cfd03251fd83c6a03337e85352ade7acb365b97b8ae6c3f9d75bc26758b581/analysis/1406815052/",
      "changelogHtml": " Bug fix.  The Smithing, Sneak and Speech Skill Grinding Cap Perks were incorrectly Setting the   Value of the Skill Advance to 0.5, 0.25, 0.1 and 0 for Level 1, 2, 3 and 4, respectively, instead of multiplying   the skill advance by those amounts.  Fixed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skill%20Grinding%20Cap-14371-1-1.7z?fid=51389&ttl=1535777934&ri=8192&rs=8192&setec=5fe6775ec690574670a6b65f0a086aac"
    },
    {
      "fileId": "72659",
      "name": "Skill Grinding Cap 2_0_1",
      "version": "2.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "117",
      "fileName": "SGC 2_0_1-14371-2-0-1.7z",
      "uploadedUnix": "1341616688",
      "modVersion": "2.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/86810c59bd174a0a3f727741a7ce80a504b3ab24006cbf49a5eef0e97122046b/analysis/1407006251/",
      "changelogHtml": " All Magic Effects now flagged as Detrimental, and thus will show up red in Active Effects. <br/> \n Bug-Fix -- Called the skill \\\"Archery\\\" instead of \\\"Marksman\\\" where it mattered. <br/> \n Bug-Fix -- Corrected handling of a Time Awake setting of 0 hours. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SGC%202_0_1-14371-2-0-1.7z?fid=72659&ttl=1535777934&ri=8192&rs=8192&setec=be278a7c49b6c35fb71017da8340fdc9"
    }
  ]
}