{
  "modId": 14402.0,
  "modName": "WiS IV - Italiano-B-Gone Fix",
  "summary": "Changes all Italian words added by War in Skyrim IV back into English.",
  "descriptionHtml": "BEFORE USING THIS MOD\r\n----------------------------------\r\nPlease be warned: This patch is intended for the 4.6 version of Wars in Skyrim IV. It MAY or MAY NOT work for other 4.X versions: use at your own risk.\r\nIt changes many records, and will cause conflicts with other mods unless you put this DIRECTLY AFTER the WiS plugin in your load order, and update your Bashed Patch to incorporate the changes.\r\n\r\nWHAT IS THIS FOR?\r\n--------------------------\r\nWars in Skyrim, now sadly delisted, was a fantastic mod. But whichever way you cut it, it was what we modders call a \\\"dirty\\\" mod: it changed many records that it had no business changing, including spell names, world spaces, and weapons. As a result, many people started finding Italian-named creatures, items and locations in their games.\r\n\r\nThis is a small patch intended to revert to English all of the records WiS renamed into Italian. If you ever encountered chickens named \\\"Gallus\\\" or picked up a \\\"Torcia\\\" to light your way, this patch will fix it.\r\n\r\nNote: This patch does NOT fix any other bugs found in WiS. It ONLY fixes translation issues.\r\n\r\nINSTALLING\r\n----------------\r\nSimply drop this esp into your Data folder. Use your favourite mod manager to place it directly after your active WiS plugins in the load order, and activate it.\r\n\r\nTHANK YOU\r\n----------------\r\nThank you for all of your hard work and time spent creating WiS, Alexandrox. It truely is a must-have mod for many people, myself included, and I\\'m saddened that modding burnt you out. I hope you\\'ll return someday and bring WiS back; it may not be the mod we [i]deserve[/i], but it is the mod we [b]need[/b]. :)",
  "categoryId": "24",
  "version": "0.1",
  "author": "Moogiefluff",
  "createdUnix": "1333628289",
  "updatedUnix": "1333628289",
  "containsAdultContent": false,
  "uploadedBy": "Moogiefluff",
  "primaryFile": null,
  "files": []
}