{
  "modId": 14400.0,
  "modName": "Ranger Cabins",
  "summary": "A mod that adds cabins in various locations for Ranger type characters to live in. \r\nIts inspired by the Ranger\\'s Apprentice series of books, which I think are brilliant.",
  "descriptionHtml": "A mod that adds cabins in various locations for Ranger type characters to live in. \r\nIts inspired by the Ranger\\'s Apprentice series of books, which I think are brilliant.  If you are looking for a more fitting attire I highly reccomend NoseGoblin\\'s Assassins Rangers and Thieves armor mod over on the nexus http://skyrim.nexusmods.com/downloads/file.php?id=4632\r\nIf you don\\'t want it to replace your DB armour standalone versions are available, just search \r\n\\\"Ranger\\\" on the nexus.\r\n\r\nThis has been on the Steam Workshop since the day the Creation Kit was released, I\\'ve finally got around to \\\"porting\\\" it over.\r\n\r\nFeatures:\r\n\r\nA cabin in each Hold free for the taking, you just have to find it.  Most have stables and all have an anvil, wood cutting block, workbench, grindstone, tanning rack and alchemy table.\r\nCustom retextured arrows and some tweaked damage vanilla weapons in a secret location which can be discovered in the screenshots.\r\n\r\nIf the Navmesh bug is ever fixed (they mentioned that they might fix it in the Bethesda modding podcast) I will endeavour to sort out the navmeshes in each cabin so followers can go in and out properly.\r\n\r\nAll the containers should be safe to store items in. \r\nThe cabins are free, you just have to find them.\r\n\r\nTo do so look at the map screenshots.\r\n\r\n======\r\nInstallation:\r\n\r\nExtract the \\\"Data\\\" folder of the 7-Zip archive to your Skyrim folder so it merges with the Data folder.  Err, that should do it!\r\n====\r\nCabin Descriptions\r\n====\r\nFalkreath: The typical cabin in the woods. Has a stable, there is lots of wildlife nearby and it\\'s \r\nwithin easy reach of Falkreath and Riverwood.\r\n\r\nRiften: Set in the autumnal forests of the Rift.  Offers a small garden on top of the basic \r\nservices.  An easy walk from Riften or Shor\\'s Stone.\r\n\r\nEastmarch: Lying in the shadow of the falls on the White River.  This cabin has a stable and is \r\nset in an attractive bend in the river just sheltered from the road.  Not too far from Windhelm or \r\n\r\nWhiterun.\r\nWinterhold:  Right on the coast, fishing is the best source of food in this location.  There isn\\'t a \r\nstable as the terrain is somewhat unsuitable for horses.\r\n\r\nThe Pale: High in the mountains of the Pale, this cabin receives cold weather and plenty of it.  \r\nExtra firewood is provided in the stable.  Despite being in the next hold it\\'s actually closest to \r\nWhiterun.\r\n\r\nHjaalmarch:  Just off the marches into the pine forests this cabin has a stable and all the basic \r\nservices.  About equal distances to Morthal and Dawnstar.\r\n\r\nWhiterun: At the base of a small-ish mountain it gets sheltered from behind.  Good views of the \r\ntundra and you may even see some mammoths if you are lucky.  Has a stable and it is about equal distance from Whiterun and Rorikstead.\r\n\r\nThe Reach: High in the mountains of the Reach the screenshots look prettier than ever, although that might be my new ENB mod.... \r\nHas a stable and is closest to Markarth.\r\n\r\nHaafingar: On the Northern coast of Haafingar this cabin has a stable and several archery targets at varying ranges.  Mind the Horker neighbours.  Closest city is Solitude.\r\n\r\n============\r\nChangelog\r\n============\r\n\r\nV1: Created Falkreath Cabin\r\nV1.1: Re-did lighting. Added Tanning Rack, Alchemy Station, Wall ornaments, Grindstone and \r\nArchery Target.\r\nV1.2: -Added Cabin in The Rift with small garden and crafting hub.\r\n-Added an anvil and workbench to Falkreath cabin; placed these in a wee hub next to the \r\narchery target.\r\n-Minor aesthetic adjustments to the Falkreath Cabin.\r\n-New preview image.\r\nV1.2.1 -Small Update\r\n-Added wood chopping blocks outside each cabin\r\n-Cleaned up some of the riften exterior foliage\r\n-Added more wildlife spawns around the Falkreath cabin (The riften cabin exterior navmesh is \r\nplaying up so I haven\\'t done anything there yet).\r\nV1.3 -Added Eastmarch Cabin\r\nV1.4 -Added Winterhold Cabin.\r\n          Added wood chopping block at Eastmarch cabin.\r\n          Added stable to Falkreath cabin.\r\nV1.5 -Added \\\"The Pale\\\" (Dawnstar) cabin.  \r\n        -Added chimney smoke to all cabins.\r\n        -Fixed minor placement issues.\r\nV1.6 -Added Hjaalmarch Cabin.\r\n        -Added some more light to the Pale cabin exterior. \r\n        -Felt like updating the logo, so I did.\r\n        -Added some cheesy descriptions of the cabins to the description ;)\r\nV1.7 -Added Whiterun Cabin.\r\n        -Added some lore based weapons in a secret place that you have to work out for yourself.\r\n        -Custom arrows as part of the weapon set (Thanks again to Deandra from UESP)\r\n        -Tweaks to lighting in the cabins (was looking a bit dark to me but I AM using realistic lighting so it may be a bit bright for non RL users?\r\nV1.8 -Finally I did the Reach Cabin, almost reached the crazy targets I set myself!\r\n        -Made the arrows craftable, they appear in the \\\"Misc\\\" crafting part and I tried to make the recipes similar to that of the popular craftable arrows mod.\r\n        -Also tried to add the arrows to blacksmith vendors but I\\'m not sure if it worked out or not.\r\nV2.0 -Added Haafingar Cabin.  \r\n       -Put chimney smoke on the Reach cabin.\r\n       -Had cup of tea and Jaffa Cakes.\r\n\r\nWell thanks for all the support while I made this mod.  It was one of the first on the Steam Workshop and to be honest I think some of its popularity can be attributed to that.\r\nThis was my first \\\"proper\\\" mod, released to the world and downloaded by more than just 5 people and the neighbours cat.\r\nI intend to explore some new ideas when I have the time, there may be one final update to Ranger Cabins and if I have bugs to fix I will endeavour to do so but that aside its goodbye for now.\r\n\r\nThanks to Deandra from the UESP Forums for the splendid custom arrows.\r\nThanks to John Flanagan for the inspiration of all things Ranger.\r\nAnd finally thanks to Bethesda for their (mostly working) Creation Kit and game.\r\n",
  "categoryId": "67",
  "version": "2.0",
  "author": "Jakarius",
  "createdUnix": "1333620401",
  "updatedUnix": "1333620493",
  "containsAdultContent": false,
  "uploadedBy": "Jakarius321",
  "primaryFile": null,
  "files": [
    {
      "fileId": "50232",
      "name": "Ranger Cabins 2_0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1049",
      "fileName": "Ranger Cabins 2_0-14400-2-0.7z",
      "uploadedUnix": "1333620493",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/be12cca8afee55f980d3f6ff93d65d72ca3ed391057abf363529e31cd16a2e70/analysis/1406798284/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ranger%20Cabins%202_0-14400-2-0.7z?fid=50232&ttl=1535777991&ri=8192&rs=8192&setec=65c6ec2cf07197b41f7578cd5367c7be"
    }
  ]
}