{
  "modId": 14505.0,
  "modName": "Houses Free and Furnished",
  "summary": "This mod makes it so all the vanilla Skyrim player-owned homes belong to you and have all the upgrades applied.  You can use this as a cheat mod or something to fix a glitched house buying quest.",
  "descriptionHtml": "Mod:  Houses Free and Furnished 1_1\r\nGame:  TES V: Skyrim\r\nAuthor:  David Brasher                                          \r\nDate:  4/7/12                   \r\n************************************************************************\r\nCONTENTS                          \r\n************************************************************************\r\n1. Information on the Mod\r\n2. Installation\r\n3. Version History\r\n4. Conflicts, Known Issues, and Troubleshooting\r\n5. Copy Status and Credits\r\n************************************************************************\r\n1. INFORMATION ON THE MOD           \r\n************************************************************************\r\n\t   This mod makes it so all the vanilla Skyrim player-owned homes belong to you and have \r\nall the upgrades applied.  You can use this as a cheat mod or something to fix a glitched \r\nhouse buying quest.\r\n\t  \r\n\t   The five houses are:\r\n\r\nBreezehome - Whiterun\r\nHjerim - Windhelm\r\nHoneyside - Riften\r\nProudspire Manor - Solitude\r\nVlindrel Hall - Markarth\r\n\r\n\t   You own the houses and have the upgrades from the time you activate the mod or start \r\na new character.  The doors are not locked and you and your spouse can move right in.\r\n\r\n\t   The main version of the .esp may cause issues with the quest \\\"Blood on the Ice\\\" at \r\nHjerim.  So you can choose to use the alternate .esp which does not give you Hjerim and cannot\r\ninterfere with the quest, or you can use the main version of the .esp and install a patch to \r\nclean up the yucky stuff in Hjerim after the quest is over, if the game does not do it \r\nautomatically.\t\t        \r\n************************************************************************\r\n2. Installation                           \r\n************************************************************************\r\n\t   Choose what you want to install:\r\n\r\n(If you are confused by all this or have no preferences or issues, just install this first one.)\r\n(1) Houses Free and Furnished.esp:  The main and default .esp  Gives you the five houses free and \r\n\t\tfurnished.  May cause problems with Hjerim and the \\\"Blood on the Ice quest.\\\"\r\n\t        This version requires that its scripts be installed.\r\n\r\n(2) Houses Free and Furnished but Not Hjerim.esp:  Only gives you four houses, but does not cause\r\n\t        any problems with the \\\"Blood on the Ice\\\" quest.  This version requires that a\r\n\t\tdifferent set of scripts be installed than the default version.\r\n\r\n(3) Houses Free and Furnished Hjerim Cleaned Up Patch.esp:  Use in conjunction with \\\"Houses Free and \r\n\t\tFurnished.esp.\\\"  Install after the \\\"Blood on the Ice\\\" quest if the gory stuff \r\n\t\tdoesn\\'t go away, or use before the quest if you choose not to play it.  This \r\n\t\tpatch does not require any additional scripts.   \r\n\r\n           Extract (decompress) the .esp and scripts to your Skyrim directory.  \r\n(It will be something like *Installation directory*\\\\Skyrim\\\\SteamApps\\\\common\\\\Skyrim\\\\Data)\r\nMark the box next to the Plugin in your mod manager.\r\n \r\n           Alternately, extract someplace else.  Then move the .esp and scripts to Skyrim\\\\Data.  \r\nMark the box next to the plugin in your mod manager.\r\n\r\n\t   If you use the main file (1) and the patch (3) then your load order must be manually set \r\nup like this because the patch is not mastered so Wrye Bash will not warn you if you are installing \r\nthings wrong:\r\n\r\nHouses Free and Furnished.esp\r\nHouses Free and Furnished Hjerim Cleaned Up Patch.esp\r\n\r\n\t   Mod removal:  You will need to remove the .esps and the scripts.  You will need to either \r\nreinstall your backup vanilla Skyrim script \\\"qf_housepurchase_000a7b33.pex/\r\nqf_housepurchase_000a7b33.pcs\\\" or install the contents of the \\\"Scripts - Uninstallation\\\" folder \r\nincluded in the download.\r\n************************************************************************\r\n3. Version History    \r\n************************************************************************\r\nV 1.1  4/7/12   Added Hjerim cleaned up patch and variant without Hjerim.  More modcleaning.  \r\n\t\tChanged documentation. Changed packaging.\r\nV 1.0  4/6/12   Initial release.   \r\n************************************************************************\r\n4. Conflicts, Known Issues, and Troubleshooting\r\n************************************************************************\r\n\t   You probably shouldn\\'t use this mod.  It is here as a last resort for if all else \r\nfails.\r\n\r\n\t   This mod was built primarily as a bugfix mod for people with unexplained house \r\npurchasing glitches that could not be fixed by console.  It was built to deal with situations\r\nwhere the questcoding and scripting has clearly failed, so it can not be constructed in an\r\nelegant fashion using lots of scripting and questcoding to fix things, because if the original\r\nscripting questcoding is failing, any new scripting questcoding would be expected to fail on \r\nthese same problem computers/load orders/savegames.\r\n\r\n\t   This mod does not fit quite right with Hjerim, the house in Windhelm, because it is\r\ninvolved with the  crime-solving Blood on the Ice.  You will encounter anomalies such as gory\r\nstuff in your nice house, your door suddenly being locked, and you having to pick it, the quest \r\nnot working right, and not having the gory stuff automatically removed from your house after\r\nthe quest is completed.\r\n\r\n\t   This mod was designed primarily as a bugfix mod to install after things go wrong, \r\nand the quest in Hjerim was something that occurred before the time period for which this mod \r\nwas designed to be used.\r\n\r\n\t   To provide options in dealing with this situation, a patch has been made which \r\nyou can install at the point when you want the gory stuff to go away.  (like after you complete\r\nthe quest for instance.)  There is also a variant which gives you the four other houses. but\r\ndoes not give you Hjerim free and furnished so that the mod cannot cause any problems with the \r\nquest.\r\n\r\n\t   I have mostly left the housecarl stuff alone.  So in some cases that part of the \r\nhouse will not be furnished until you become a thane and acquire a housecarl.\r\n\r\n\t   This mod might interfere with the quests to become a thane.  That has not been \r\ntested yet.\r\n  \r\n\t   This mod pretty much uses the hand grenade approach rather than the rapier approach.\r\nVarious people have one house purchasing quest or another glitch out and they can\\'t fix it with \r\nconsole codes.  So what do I do?  I go berserk and say, \\\"Well fine then!  If the flipping stupid \r\njunk software won\\'t work, then I am going to take all my marbles and go home!\\\"  (And I will \r\nstomp my feet noisily on the way out and slam the door too.)  Instead of fixing the little \r\nproblem, I just tried to fix any and all possible house buying problems in one fell swoop.  \r\n\\\"Fine be that way!  Here!  Take all the houses!  Take all the upgrades!\\\"  (Sometimes I have \r\ntrouble with responding to adversity in a proportional fashion.)\r\n\r\n\t   This mod ends up being a cheat mod because it gives out thousands of Septims of \r\nreal estate and furniture for free.  But a gamer could choose to use it more as a bug-fix mod.\r\nHe or she could only take possession of a particular house after trying to complete the required\r\nquest and only then activate this mod if there are problems that can\\'t be overcome with console \r\ncodes.  And then the player could just take possession of the single house rather than all five.  \r\n\r\n\t   This mod has only been lightly tested.  \r\n\t\r\n\t   If you locate a bug, contact David Brasher on TES Nexus so that the situation can be\r\nexamined and can hopefully be fixed. \r\n************************************************************************\r\n5. Copy Status and Credits           \r\n************************************************************************\r\nCredits:  Bethesda for making Skyrim in an open format anyone can mod.\r\n\t\t\r\nCopy Status:  Public domain with no limitations.  You may use things from this mod in your own \r\nmod and distribute it.  You do not need to credit me or notify me.           \r\n************************************************************************\r\n************************************************************************\r\n************************************************************************\r\n************************************************************************",
  "categoryId": "68",
  "version": "1.1",
  "author": "David Brasher",
  "createdUnix": "1333738748",
  "updatedUnix": "1333825664",
  "containsAdultContent": false,
  "uploadedBy": "David Brasher",
  "primaryFile": null,
  "files": [
    {
      "fileId": "50701",
      "name": "Houses Free and Furnished 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "Houses Free and Furnished 1_0-14505.7z",
      "uploadedUnix": "1333738818",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c0f5c6377529a8d4dafac8b5876e0c98846c3793adcf4be0c66624f9fea85a90/analysis/1406800998/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Houses%20Free%20and%20Furnished%201_0-14505.7z?fid=50701&ttl=1535778183&ri=8192&rs=8192&setec=fadfd2ab03b52a0a52e591e7e393a720"
    },
    {
      "fileId": "50985",
      "name": "Houses Free and Furnished 1_1 ",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17",
      "fileName": "Houses Free and Furnished 1_1 -14505-1-1.7z",
      "uploadedUnix": "1333825664",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/21887dc97852f0f633f27533ba7ff1324ff55634de9b1af7b92b8f63f951fdb4/analysis/1406802604/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Houses%20Free%20and%20Furnished%201_1%20-14505-1-1.7z?fid=50985&ttl=1535778183&ri=8192&rs=8192&setec=8f3c3eb10d42bbe5382b5f86f44b55b7"
    }
  ]
}