{
  "modId": 1450.0,
  "modName": "Plynxs No Motion Sickness",
  "summary": "Removes camera sway from noncombat sprinting and removes the subtle head camera bobbing in first and third person that can lead to nausea, vertigo, and motion sickness. Also includes tips.",
  "descriptionHtml": "--------------------------------------------------------------\r\n[b]No Motion Sickness Mod[/b]\r\n--------------------------------------------------------------\r\n\r\nThis mod reduces motion sickness by eliminating camera bob in first and third person modes. It also eliminates the massive camera sway in non-combat sprinting modes. \r\n\r\nOther ways of describing the problem (to help with searching): Skyrim makes me dizzy, shaky cam, turn off headbob, Skyrim makes me feel sick.\r\n\r\n[b]Update[/b]\r\n--------------------------------------------------------------\r\n\r\nThe feedback I\\'ve gotten has been gratifying; thanks for your stories of how this made Skyrim playable for you.\r\n\r\nFor the people who report a few lingering problems, these are most likely caused by the crafting cameras, especially enchanting and alchemy. Crafters in those two skills can spend a long time on those screens without realizing it, and the background swims around very subtly the whole time. The crafter version of the mod removes the camera sway for both of these crafts. It will still swim around for smithing, smelting, tanning, and other crafts, but the time generally spent on those screens is generally much less.\r\n\r\n[b]Other helpful tips for motion sickness[/b]\r\n--------------------------------------------------------------\r\n\r\nHere are some other tips to help with reducing or eliminating motion sickness while playing Skyrim:\r\n\r\n[b]Increase FOV to 90[/b]\r\n\r\nAn increased field of view gives you more visual context in which to interpret your movements, reducing motion sickness. 90 or more is a good value. My wife used 92 and it helped her a lot. \r\n\r\nAlthough there is a console command to set your fov, it only applies to the current session. You can edit your ini files for a permanent change. Be careful which .ini files you edit. The correct ones are NOT in your steamapps folder, but rather in your documents folder (usually c:\\\\users\\\\yourname\\\\documents\\\\my games\\\\skyrim). The following is quoted from user \\\"kingofsorrow\\\" on the evga forums:\r\n\r\n     [b]1[/b]. In the SkyrimPrefs.ini file, add the following line to the [General] section at the bottom: \r\n          fDefaultFOV=XX  \r\n  \r\n     [b]2[/b]. Then, open the skyrim.ini file, and add the following 2 lines to the [Display] section: \r\n          fDefaultWorldFOV=XX  \r\n          fDefault1stPersonFOV=XX.XXXX  \r\n  \r\n     [b]3[/b]. Get in the game, load your savegame, press ~ and type FOV XX. Press ~ again to close the console. Save and exit.\r\n\r\n     [b]4[/b]. Now load your game and the FOV will never default back. \r\n\r\n     [i]Where XX is your preferred FOV[/i]\r\n\r\n[b]Disable Mouse Acceleration[/b]\r\n\r\nMouse acceleration, on by default, creates a slight delay after you stop moving your mouse which can lead to a sense of dizziness since the world does not stop moving right away after you have willed it to stop. In the SkyrimPrefs.ini file, find under the [Controls] section bMouseAcceleration=1, and set it to 0.\r\n\r\n[b]Ensure Consistent High Frame Rate[/b]\r\n\r\nSkyrim still looks amazing on lower detail settings, and the improvement in frame rate can help with motion sickness. Frame rate variability can lead to disorientation. If you have an extremely powerful computer and graphics card, you can use a frame rate limiter to ensure a consistent frame rate (you can find such a tool on a Skyrim mod site).\r\n\r\nAnother important point about Skyrim frame rates is that unlike most games, Skyrim is much more likely to be CPU-bound, so if your graphics card is great but your CPU is a little older, you may be getting low framerates anyway. A modest overclock can send framerates from 25fps to 60fps if you are using a Core 2 Duo. The way you can tell if your framerate is CPU-bound is to go to a place with a number of NPCs walking around (like Solitude or Whiterun) and check your frame rate. Then lower your graphics settings to LOW--if there is not a significant frame rate improvement, then you are most likely CPU-bound and need a faster CPU or could benefit dramatically from just a touch of overclocking.\r\n\r\n[b]Reduce Mouse Sensitivity[/b]\r\n\r\nIn your SkyrimPrefs.ini file, you can add the following two settings (right below bMouseAcceleration)\r\n\r\nfMouseHeadingYScale=0.0100\r\nfMouseHeadingXScale=0.0100\r\n\r\nThis does two things. One, it lets you set sensitivities outside the range of the slider in the game. Two, it allows you to set the x and y axes to similar linear sensitivities. Some people become disoriented if a defined amount of mouse movement in one direction produces a different amount of onscreen movement than another direction.\r\n\r\n\r\nEven with all this, there is still a constant \\\"I\\'m on a boat\\\" camera sway built into the game. It\\'s noticable in 1st person mode, and in 3rd person mode it is very subtle and many miss it, although either way it can make you feel nauseated or have vertigo after playing a while. That is what this mod is for.\r\n\r\n\r\n[b]Installation[/b]\r\n--------------------------------------------------------------\r\n\r\nPlace the contents inside your Skyrim\\\\Data folder.\r\n\r\n[b]Changelog[/b]\r\n--------------------------------------------------------------\r\nCrafting version - A new version that also disables the special crafting cameras for alchemy and enchanting.\r\n- Added tip about CPU\r\n0.91 - Update that fixes 3rd person sprinting sway for female characters\r\n\r\n\r\n[i]- Plynx[/i]",
  "categoryId": "51",
  "version": "0.91",
  "author": "Plynx",
  "createdUnix": "1322205078",
  "updatedUnix": "1325612082",
  "containsAdultContent": false,
  "uploadedBy": "dplynx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "3775",
      "name": "PlynxsNoMotionSickness",
      "version": "0.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "157",
      "fileName": "PlynxsNoMotionSickness-1450.zip",
      "uploadedUnix": "1322205214",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/fa53978c7a4cd0d8184f4c782b30a947801ddded69ad771c88985b0f13defa5d/analysis/1406445543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PlynxsNoMotionSickness-1450.zip?fid=3775&ttl=1535755051&ri=8192&rs=8192&setec=a1441ccc32754344d3f45cb6419ae5b4"
    },
    {
      "fileId": "3904",
      "name": "PlynxsNoMotionSickness v0_91",
      "version": "0.91",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "163",
      "fileName": "PlynxsNoMotionSickness v0_91-1450.zip",
      "uploadedUnix": "1322247781",
      "modVersion": "0.91",
      "virusScanUrl": "https://www.virustotal.com/file/7adefc62c9ff5b7cc1eaab093487458b71c53dc5af9ee9e358c2dc367c13a7aa/analysis/1406447043/",
      "changelogHtml": " Update that fixes 3rd person sprinting sway for female characters. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PlynxsNoMotionSickness%20v0_91-1450.zip?fid=3904&ttl=1535755052&ri=8192&rs=8192&setec=91435e75eb4eed63b8347808f6d4c67a"
    },
    {
      "fileId": "16259",
      "name": "PlynxsNoMotionSickness v0_91 Crafting Edition",
      "version": "0.91.Craft",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "162",
      "fileName": "PlynxsNoMotionSickness v0_91 Crafting Edition-1450-0-91-Craft.zip",
      "uploadedUnix": "1325612082",
      "modVersion": "0.91.Craft",
      "virusScanUrl": "https://www.virustotal.com/file/d6a3727d7ca35bb203aed921907cd87e4f13a3793e3a947aee3d2f1054a217ca/analysis/1406579672/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PlynxsNoMotionSickness%20v0_91%20Crafting%20Edition-1450-0-91-Craft.zip?fid=16259&ttl=1535755052&ri=8192&rs=8192&setec=31857fe8d183119e984114339e67a055"
    }
  ]
}