{
  "modId": 14514.0,
  "modName": "Katixas Skill Lock Cap",
  "summary": "Allows you to set a cap for each skill.",
  "descriptionHtml": "Allows you to set a cap (limit) for each skill individually, avoiding any unwanted gains reading books, or with normal use, preventing level up using skills you don\\'t want in your template, for example.\r\n\r\nDESCRIPTION\r\n----------------------\r\nAllows you to set a cap for each skill. Once the cap is reached for an specific skill, it cannot be trained (learned) further, until this cap is increased or removed.\r\n\r\n[center][youtube]6UAsDd-WEQ8[/youtube][/center]\r\n\r\nQUESTIONS\r\n----------------------\r\n** Does this remove default cap?\r\nNo. You can set the skill cap to \\\"default\\\", and this mod will not control it so it will go as far as your game or other mods allow.\r\n** Does this manipulate skill values?\r\nNo. It\\'s not a cheat system. Anyway, if you have 21 Destruction from skill books read, or because at game start you cast some spells, and now you lock it to 15, then the mod will decrease its value. If you set the cap to 75, you will have to train it.\r\n** Why would I want to lock skill progress?\r\nSome people like to have a character profile with certain skills, leaving some skills completely unused, some of them just barely used, and some as main/major skills. This mod is for those who want a customized template. I post some examples below.\r\n\r\n\r\nHOW TO USE\r\n----------------------\r\nIn Whiterun you will find The Book of Knowledge, next to the Talos Shrine (outside Jorrvaskr). If starting a new character, you can find this same book at Helgen Keep, over the same table where the Dragonborn book and the big backpack are.\r\n\r\nUsing it will open a skill configuration wizard. You will be able to choose the following skill caps for each skill individually: 0, 15, 30, 40, 50, 60, 75, 90 and Default. This last value is considered as \\\"no limit\\\", meaning that it will not be monitored, so you will be able to train it as this mod didn\\'t exist\r\n\r\nOnce you use the book, the skills with higher value than the choosen cap will get lowered to cap value. For instance, if you have 57 sneaking and set it locked at 50, then the skill will lower to 50, and it will not progress anymore when used (unless you increase this cap or remove it setting to \\\"default\\\").\r\n\r\n\r\nEXAMPLES OF USES FOR THIS\r\n-----------------------------------------------\r\nIf you are playing ...\r\n- ... a warrior and don\\'t want him to learn any form of magic, just set all schools to 15. Any magic book you read won\\'t give you skill progress, neither level progress.\r\n- ... a mage which carries a steel dagger and uses it on emergencies (even if moving it like a monkey), could want to lock OneHanded to 30, or even 15, to avoid gains or getting too good at it.\r\n- ... a warrior who likes to craft a sword from time to time, but it\\'s no expert smith, may want to lock at 40-50.\r\n- ... a mage who likes to Sneak only on dark dungeons, and you don\\'t want him to get too good, lock it at 50.\r\n- ... a dumb muscled warrior tank who has no idea of speechcraft, should not be able to intimidate or persuade with his voice, neither learn speech when buying or selling anything. Lock it at 15.\r\n\r\n\r\nMAGIC EFFECTS\r\n--------------------------\r\nThis mod does not limit magic effects. If you have One-Handed at 17, and set the cap to 30, you can use a +20 potion and it will be set to 37 for the duration of the potion. This mod caps the base / real skill.\r\n\r\n\r\nUNINSTALL CONSIDERATIONS\r\n------------------------------------------\r\nNone.\r\nDisabling this mod will also disable any caps set.\r\n\r\n\r\nCHANGELOG\r\n----------------------\r\nClick version number.\r\n\r\n\r\nTO-DO\r\n----------------------\r\nFix any issues I may find around.\r\n\r\n\r\nNOTES\r\n----------------------\r\nPlease report any issues you may find. As always with any mod that modifies character properties, create a new savegame once you enter the game, so you can roll back if something back happens.\r\n\r\nI would also like to thank \\\"henkyhenk\\\" on SkyrimNexus for pointing me on the right direction for avoiding skill progress.\r\n\r\nThanks, have fun!\r\n\r\n\r\nSteam Workshop Link:\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=21248",
  "categoryId": "73",
  "version": "2.1.0a",
  "author": "Katixa",
  "createdUnix": "1333746043",
  "updatedUnix": "1336066567",
  "containsAdultContent": false,
  "uploadedBy": "katixa",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51290",
      "name": "Katixas Skill Lock OLD 2-0-2",
      "version": "2.0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Katixas Skill Lock OLD 2-0-2-14514.7z",
      "uploadedUnix": "1333901234",
      "modVersion": "2.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/74fbd91367f34699840569d1cc8418c14105afad1313743b72f2369fb1829a2b/analysis/1406804223/",
      "changelogHtml": " There is a new option in the Book of Knowledge, allowing the player to list current skill caps. <br/> \n Changes to skill caps are done right after using the book, instead of waiting to the next check. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Katixas%20Skill%20Lock%20OLD%202-0-2-14514.7z?fid=51290&ttl=1535778203&ri=8192&rs=8192&setec=26c090e7b190e6eb6e56847a2cc66f90"
    },
    {
      "fileId": "58215",
      "name": "Katixas Skill Lock OLD 2-1-0",
      "version": "2.1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9",
      "fileName": "Katixas Skill Lock OLD 2-1-0-14514.7z",
      "uploadedUnix": "1335989548",
      "modVersion": "2.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e7673a2cdd054679d66d203b3882fb2d8d2ab557a6020f522273dd84e100be1e/analysis/1406862130/",
      "changelogHtml": " New minimum for skill cap is 0 (zero). <br/> \n Information messages about current skill caps changed. Now it only shows capped skills, not all. <br/> \n Added a copy of the Book of Knowledge at Helgen Keep, in the room with some cells, over the same table where the backpack and Dragonborn book are. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Katixas%20Skill%20Lock%20OLD%202-1-0-14514.7z?fid=58215&ttl=1535778204&ri=8192&rs=8192&setec=b797502efe02afcae43921eff0f698e7"
    },
    {
      "fileId": "58374",
      "name": "Katixas Skill Lock",
      "version": "2.1.0a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Katixas Skill Lock-14514-2-1-0a.7z",
      "uploadedUnix": "1336066567",
      "modVersion": "2.1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/b35b43d9d8606f68bccc712c36e3cb8945084d8eb2ae83d4e61888b108416f85/analysis/1406863622/",
      "changelogHtml": " Just a quick fix for something I missed on the previous update. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Katixas%20Skill%20Lock-14514-2-1-0a.7z?fid=58374&ttl=1535778204&ri=8192&rs=8192&setec=9b84ba8e2617f518d632dbaee173cd50"
    }
  ]
}