{
  "modId": 14524.0,
  "modName": "A Big Mistake--A Voiced Adventure",
  "summary": "This is my all that I currently have of the MOD which I intended for the Skyrim Nexus mod contest. more than 60% of the MOD is missing, or incomplete; However, since I no life&#39;d this for 2 months, I wanted it to be judged in the contest nonetheless.",
  "descriptionHtml": "This mod is currently a work in progress; however, as-is, it stands as my submission for the Nexus Mod Competition. \r<br />\r<br />I will be continuing to work on this Mod until it is finished, however, this will likely be a while.\r<br />\r<br />So, General Notes:\r<br />\r<br />This Mod adds:\r<br />\r<br />*A Cave to the Vanilla Game\r<br />*A new dungeon consisting of several interiors and small custom worldspace area.\r<br />*9 Fully Voice* acted characters to the game. Totaling over 150 lines of added dialogue.\r<br />*A New Quest Entitled &#34;A Big Mistake&#34;\r<br />*Intended to be lore-friendly and lore-enhancing.**\r<br />\r<br />\r<br />\r<br />\r<br />*There are a few lines of combat dialogue that I would have liked to add, but was unable to get in a short time-frame. However, there is still a decent bit of combat dialogue.\r<br />\r<br />** If anyone does play this, and finds something inconsistent with Lore, I would appreciate if it was pointed out to me.\r<br />\r<br />\r<br />DISCLAIMER:\r<br />\r<br />This Version of the Mod is intended solely of use by judges and other mod authors involved with the Skyrim Nexus contest. This is not a complete work, and as a result still contains some bugs. Please Back up your saves, I am not responsible for damage to saves caused by this mod. \r<br />\r<br />\r<br />Notes: You can start &#34;A Big Mistake&#34; by entering Whiterun after having defeated Alduin. You MUST defeat Alduin (essentially beat the main quest) before you can start the quest.\r<br />\r<br />Warning: The first 2 rooms of the dungeon have been play tested (aimed at creating challenging, but possible fights for Level 50+ Characters ) But the final confrontation is not finished, and as such will play out very differently in the final release version. Also as a result of this, the encounter has not been play-tested much with-out god mode, and may prove a serious challenge, or even impossible. Again be warned that the dungeon is intended for players 50+. \r<br />\r<br />Author Note: \r<br />Also, most of the story aspects of the quest have been implemented, and as the author I would prefer it not be played in its current form. If you must play it. Be warned that you are not getting nearly the experience of playing the final release version of the mod. \r<br />     While this is not the final release version, and a lot of the content is incomplete or missing I hope that you guys see where I am trying to go with it, and appreciate it. I am sorry if some things don&#39;t look the best, the entirety of this mod was done on a relatively weak Toshiba Satellite. \r<br />\r<br />If you have any issues downloading and setting up the MOD for proper play, please let me know.\r<br />\r<br />\r<br />P.S. Flashback to the Authors Note: Please don&#39;t play this if you don&#39;t like spoilers.",
  "categoryId": "35",
  "version": "0.5",
  "author": "Brandon Snider and Austin Snider",
  "createdUnix": "1333754532",
  "updatedUnix": "1333758525",
  "containsAdultContent": false,
  "uploadedBy": "bls61793",
  "primaryFile": null,
  "files": [
    {
      "fileId": "50767",
      "name": "A Big Mistake ",
      "version": ".5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "52738",
      "fileName": "A Big Mistake -14524--5.7z",
      "uploadedUnix": "1333758525",
      "modVersion": ".5",
      "virusScanUrl": "https://www.virustotal.com/file/448fa04257f97c96e13dd0b5dc6c4aa3c834766f8615a45191b8464d951d743c/analysis/1406801398/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Big%20Mistake%20-14524--5.7z?fid=50767&ttl=1535778226&ri=8192&rs=8192&setec=b4d634d53c614980bd0a8097bd2b68df"
    }
  ]
}