{
  "modId": 1452.0,
  "modName": "BMC - Catriona Savegame",
  "summary": "Nord female at the very start of the game, no cheat items, no political decisions made, nothing, play her how you want, would be interesting to see screen shots of how she turned out for others compared to my original persona, maybe for you she will became a mage or a master thief?  I went the heavy armoured two handed paladin route.",
  "descriptionHtml": "I\\'m not happy with the amount of clones in this game due to the severely (seriously, we can\\'t even adjust nose width?) limited character gen as such I didn\\'t intend to upload this but a friend asked me to so I figured I may as well.\r\n\r\nShe\\'s was my second character, my first being my traditional male Nord called Sven who was a light armour sword and board user, for Catriona I went as heavy armour with two hander.\r\n\r\nThis save is immediately after you first gain control of your character entering the first tower but before you have chosen to follow either the Imperial or Stormcloak ally to allow skill distribution as you see fit.\r\n\r\nThe two images supplied are as follows, the main image is of \\'My\\' Catriona outfitted appropriately, the second is from inside character generation from multiple angles so you get an idea of what she looks like in normal lighting.\r\n\r\nIt has to be said I am using some texture mods/fixes as listed below, all available on skyrimnexus.\r\n\r\nNo More Blocky Faces + LUEF patch by Xenius & arlekin\r\nDetailed Faces by Xenius\r\nDetailed Bodies by Xenius\r\nHigh Quality Eyes by Xenius\r\n\r\nI don\\'t use the lips mod however despite testing it so be warned that does change the appearance quite dramatically, I just wanted a more natural un-made up look for this character where I felt the lips mod looked more like lipstick with my settings.",
  "categoryId": "43",
  "version": "1.0",
  "author": "Badmagic",
  "createdUnix": "1322205680",
  "updatedUnix": "1322205964",
  "containsAdultContent": false,
  "uploadedBy": "Badmagic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "3776",
      "name": "BMC Catriona 7z",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2844",
      "fileName": "BMC Catriona 7z-1452.7z",
      "uploadedUnix": "1322205964",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cc22009c4c0df84fc9ce778beeafee5cbf550656bcd41a662225317f561af558/analysis/1406445544/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BMC%20Catriona%207z-1452.7z?fid=3776&ttl=1535755057&ri=8192&rs=8192&setec=230592a568c86d65065840436c53bc82"
    }
  ]
}