{
  "modId": 14558.0,
  "modName": "The Descent",
  "summary": "This mod adds in a quest and a nice outdoor player home along with plenty of treasure with is found in massive caverns with a lot of ground to explore.",
  "descriptionHtml": "DESCRIPTION: \r\n                      I\\'ve decided to add in a quest which is started at an excavation site near Nilheim. To start the quest just pick up and read the note on the table and follow down into the depths. I also added in an outdoor player home.\r\n\r\nTHE QUEST:\r\n                  The quest unfortunately will not pop up in your journal because I don\\'t have time to figure out all the scripts but it is a very straight forward quest. Note there is a huge battle so if you are running slow it may cause a problem. The quest itself is told in the notes and there is a small story but I didn\\'t really put a finished to it because its up to you figure out how this may have come to be.\r\n\r\nPLAYER HOME:\r\n                     The player home is up from Darkwater Pass and down from Snapleg Cave. You don\\'t have to do the quest to receive the player home. This place includes pretty much everything from all the smithing equipment, alchemy, enchanting, display case, weapon racks, dragon mask holders, and mannequins. The rocks next to the steps on your way up to the player home may not load the first time but don\\'t worry, they will eventually.\r\n\r\nUPDATES:\r\nv.2 The placement for certain items was tweaked\r\n\r\nv.3 Fixes the Telrav quest, a few navmesh tweaks, and some placement items.\r\n\r\nWARNINGS:\r\n               Note this works on my computer so if your having problems... I don\\'t know sorry. If i find anything wrong I will update eventually. Though if for some reason when you exit the last cavern back to Skyrim your game might crash. If it does just reload Skyrim and load up your last quicksave or autosave and should be fine. Can\\'t figure out why it does this. \r\n\r\nINSTALLATION: \r\n                Install with NMM or manually and extract the file to your Skyrim Data folder. Also should load this with a fresh save just to be safe.\r\n\r\n\r\nCOMPATABILITY:\r\n                      So far found that the Quest - And the Realms of Daedra conflicts.\r\n\r\nNOTES: \r\n           If anyone finds that this doesn\\'t work with there computer or mods and they want to make an update or patch, feel free to.\r\n\r\n",
  "categoryId": "35",
  "version": "V.3",
  "author": " NIckelback56",
  "createdUnix": "1333783611",
  "updatedUnix": "1334180022",
  "containsAdultContent": false,
  "uploadedBy": "Nickelback",
  "primaryFile": null,
  "files": [
    {
      "fileId": "52416",
      "name": "The Descent V3",
      "version": "V3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1150",
      "fileName": "The Descent V3-14558-V3.zip",
      "uploadedUnix": "1334180022",
      "modVersion": "V3",
      "virusScanUrl": "https://www.virustotal.com/file/04d41f7b86497405c9cee36d29f67a8a9b9e0a18ef39b3eae84ddfa46da6dc2e/analysis/1406810530/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Descent%20V3-14558-V3.zip?fid=52416&ttl=1535778276&ri=8192&rs=8192&setec=7165145a8dafed26492271c37572ae09"
    }
  ]
}