{
  "modId": 14553.0,
  "modName": "Saved Game - Vlad Mihawk",
  "summary": "My first mod ever, a Saved Game of my new character, an Ashen, Vlad Mihawk. ",
  "descriptionHtml": "Well I\\'ve been around the Nexus a long time, always checking out the new mods. And I thought it\\'s time I contributed something myself, even if it\\'s something only as small as a Saved Game, since I have no modding experience whatsoever.\r\n\r\nThis is a Saved Game of a new character I created, when making him I decided to give him some resemblance with Dracule Mihawk from the hit anime One Piece. I love the show and \\\"Hawkeyes Mihawk\\\" is one of my favorite characters. And when I was through making him, I thought to myself, \\\"Hey, this looks really good!\\\" So I decided to upload it here on the Nexus for others to enjoy. He is an Ashen, so you will have to have the Ashen race mod by Seren4XX to use this. Which I highly recommend. Of course it goes without saying I take no credit for the race mod whatsoever! And thanks to Seren4XX for uploading it to the Nexus! \r\n\r\nThe Saved Game takes place right at the point where you are about to be lead to the Chopping Block, so it\\'s right at the beginning of the game for you to do whatever you want with him. Just make sure to keep him well fed, give him lots of rest, ect. XD\r\n\r\nIf for any possible reason you would want to use this character in your own mod, I don\\'t mind one bit! :) Although please give credit to me for the character and of course Seren4XX for the awesome race mod!\r\n\r\nFeedback and Constructive Criticism would be very welcome! Endorse if you enjoyed the mod and thanks to all who downloaded!\r\n",
  "categoryId": "43",
  "version": "1.0",
  "author": "Electric0eye",
  "createdUnix": "1333775810",
  "updatedUnix": "1333776099",
  "containsAdultContent": false,
  "uploadedBy": "Electric0eye",
  "primaryFile": null,
  "files": [
    {
      "fileId": "50829",
      "name": "Vlad Mihawk ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1141",
      "fileName": "Vlad Mihawk -14553-1-0.rar",
      "uploadedUnix": "1333776099",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ae6bf5aeb2a1af1c552169c6d9aa8dba203836df9820f80cb642ed4f5914f0ad/analysis/1406801777/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vlad%20Mihawk%20-14553-1-0.rar?fid=50829&ttl=1535778269&ri=8192&rs=8192&setec=f07fe6ca92aaf61845a8b6b2dc21def4"
    }
  ]
}