{
  "modId": 14560.0,
  "modName": "dragonpowerupmod_Nuovi Urli per i draghi",
  "summary": "This mod gives the dragons new abilities, for example: heal themself, summon other mobs and sometime shout thunderbolts!\r\n",
  "descriptionHtml": "DESCRIZIONE ITALIANA:\r\n\r\nQuesta mod è disponibile sia in italiano che in inglese ed è un \\\"WIP\\\" in quanto continuerò ad aggiungere nuove cose fino a che mi riterrò soddisfatto :)\r\nHo creato questa mod per rendere i draghi una vera sfida, e non solo grossi lucertoloni sputafiamme...\r\nOra i draghi potranno lanciare magie, come le evocazioni e le cure, disporranno inoltre (ad alti livelli) di un urlo che richiamerà una tempesta del loro elemento.\r\nInseriti inoltre draghi di tipo elettrico, capaci di lanciare fulmini, e i draghi giovani, piu piccoli e deboli dei loro simili più esperti :)\r\nCosa offre la mod:\r\nAggiunti Urli di cura\r\nAggiunti Urli di difesa (Mantelli di fuoco ghiaccio ed elettrico di vari livelli)\r\nAggiunto Urlo elettrico (2 tipi, 5 livelli per tipo)\r\nAggiunti urli di evocazione (atronach e sacerdoti del drago, a breve altri draghi)\r\nAggiunto nuovo tipo di drago, Drago del Fulmine (lvl 30+) con relative resistenze\r\nHo aumentato i punti vita di ogni drago, fatemi sapere se sono troppi o troppo pochi :9\r\nIncreased the standard resistence of all dragonsAumentate le resistenze elementali di ogni drago\r\nAggiunti Urli \\\"StormCall\\\" speciali per ogni drago di alto livello (a seconda dell\\'elemento del drago)\r\n\r\nSe i draghi risultassero troppo deboli riferitemelo, su questa mod o sulla sua versione inglese in modo che possa migliorarli (sono molto ben accetti anche suggerimenti sulle abilità che vorreste dare ai nostri amati lucertoloni alati)\r\nAl momento non sono disponibili meshes speciali per i nuovi tipi di drago ma spero di riuscire a crearne qualcuna prima o poi :)\r\n\r\nENGLISH DESCRIPTION:\r\n\r\nItalian Modder, sorry for bad english :)\r\n\r\nThis mod is a WIP, because i\\'m still adding things, but i want to have some opinions from other players, especially about the dragons HP value.\r\nHave anyone ever noticed that the dragons in skyrim are \\\"a little\\\" to weak? Come on! They are big, ancient, they \\\"SPEAK MAGIC\\\" and no one of them knows a single basis magic spell? The only thing they can do is scream fire and ice around?\r\nThis mod gives the dragons new abilities, for example: heal themself, summon other mobs and sometime shout thunderbolts!\r\n\r\nI created this mod do change dragons into a more interesting enemy, by not only adding tons of damage and HP to them. In my tests it worked good, but i need other players to test it too, or i\\'ll become crazy.\r\nThe mod is from italian version of skyrim, but I changed the dragon\\'s name from italian to english.\r\n\r\nI\\'ve added 3 more dragon species,\r\nYung dragon\r\nThunder dragon\r\nGreath Dragon\r\nWith new skills and powers, and strengthened the others.\r\nI hope everyone enjoys them.\r\n\r\nTell me if you like this mod and if you want me to continue updating.\r\nAnd please, if you like it, vote for me (I like stars :D)\r\n\r\nAdded Healing shouts (3 types, 3 levels for each type)\r\nAdded Defensive shouts (fire-, ice- and thundercloack of various levels)\r\nAdded Electric shouts (2 types, 5 levels for each type)\r\nAdded Summoning shouts (atronach of fire/ice/storm and dragon priest)\r\nAdded Thunder dragon (lvl 30)\r\nAdded lightning resistence to the thunder tipe dragon\r\nIncreased the HP of all dragons, tell me what you think about that change, after you tested it\r\nIncreased the standard resistence of all dragons\r\nAdded StormCall type spells to each high level dragon (based on element)\r\n\r\n\r\n[youtube]R0CsdtM_4fE[/youtube]",
  "categoryId": "77",
  "version": "1.0",
  "author": "Yuren",
  "createdUnix": "1333785910",
  "updatedUnix": "1334163802",
  "containsAdultContent": false,
  "uploadedBy": "aldoeroby",
  "primaryFile": null,
  "files": [
    {
      "fileId": "50847",
      "name": "dragonpowerupmod_ENG",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "78",
      "fileName": "dragonpowerupmod_ENG-14560.rar",
      "uploadedUnix": "1333786068",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9db5e25c01ed3318761731ea4d738557e5a44509855ba1379234930fe465f4aa/analysis/1406801838/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/dragonpowerupmod_ENG-14560.rar?fid=50847&ttl=1535778282&ri=8192&rs=8192&setec=fb88eb82124268ee5abaa78fcd7da429"
    },
    {
      "fileId": "52348",
      "name": "dragonpowerupmod_ITA",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "78",
      "fileName": "dragonpowerupmod_ITA-14560-1-0.rar",
      "uploadedUnix": "1334163802",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1f6b2c61269cef0093f2296abadc9268b1fc691f9fc8433409520fd7ad13f1b5/analysis/1406810104/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/dragonpowerupmod_ITA-14560-1-0.rar?fid=52348&ttl=1535778283&ri=8192&rs=8192&setec=98a4ab3396034ccea51cb7cf877ed4c1"
    }
  ]
}