{
  "modId": 14601.0,
  "modName": "Frost Giants",
  "summary": "Adds Frost Giants with 12+ Frost Giant Camps to your game.  Frost Giants have Unique Racial Abilities and Frost Attacks.  Current Version Comes with Ice Mammoths as Frost Giant Allies",
  "descriptionHtml": "FROST GIANTS\r\n\r\nThank you to SomeoneSuperior for making a mod spotlight for the mod:\r\n[youtube]yenHbVnh7rQ[/youtube]\r\n\r\n\r\nThis will add the Frost Giant race to your game.  Frost Giants will be encountered in specific locations which by default will be visible on your map and can be traveled to.  This will not affect vanilla giants or their camps in any way.  \r\n\r\nFrost Giants have unique racial abilities such as strong frost  resistance, and perhaps some weaknesses that you may be able to figure out and exploit.  Some camps will have Ice Mammoths that serve a similar function to the vanilla mammoths with vanilla giants.  Many Frost Giants will also carry weapons unique to their race other than the vanilla giant club.  Giants come in varied appearances, sizes, strengths, and many are leveled.  \r\n\r\nTextures on Giants, their Outifts, and Mammoths are all 2K\r\n\r\nThis mod was in beta for weeks and was accidentally deleted so I\\'m calling this version 1.0.  If anyone finds bugs or has constructive feedback I would love to hear it.  Many bugs have been rooted out and locations have been optimized for giant mobility, NPC encounters, and to reduce giants and/or mammoths getting stuck in weird places.  \r\n\r\nThanks to BlackJack90 and LaserWerewolf for help in the development process.  \r\n\r\n\r\n\r\nIf you  also want to add FIRE GIANTS to your game then check out my other mod:\r\n\r\n[URL=http://skyrim.nexusmods.com/downloads/file.php?id=11790] FIRE GIANTS [/url]\r\n\r\n\r\nTo further improve your Skyrim Giant experience I recommend combining this mod with the \\\"Height adjusted races with true giants\\\" mod by EvilDeadAsh34.  That mod will not alter anything with the Frost Giants but if and when you see some Frost Giants getting in fights with Vanilla Giants, then the fights will appear to be more fair.  My default Frost Giant sizes are closer to EvilDeadAsh34\\'s but not the same, and Frost Giants have varied heights.\r\n\r\n[URL=http://skyrim.nexusmods.com/downloads/file.php?id=7587] HEIGHT ADJUSTED RACES WITH TRUE GIANTS [/url]\r\n",
  "categoryId": "83",
  "version": "1.0",
  "author": "XRC",
  "createdUnix": "1333830347",
  "updatedUnix": "1333830744",
  "containsAdultContent": false,
  "uploadedBy": "exray catt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51004",
      "name": "Frost Giants",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29423",
      "fileName": "Frost Giants-14601-1-0.rar",
      "uploadedUnix": "1333830744",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/55cd4ba596782398aa812c8fba85fc13515912d62cba9c36c72e85e5616c6046/analysis/1406802747/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Frost%20Giants-14601-1-0.rar?fid=51004&ttl=1535778347&ri=8192&rs=8192&setec=a26af04e55d7d8009ec2af54de6e3717"
    }
  ]
}