{
  "modId": 14607.0,
  "modName": "Better White Phial Effects",
  "summary": "This mod improves and balances the effects of the White Phial. The White Phial is supposed to be an ancient artefact, not a mediocre potion. Now the White Phial actually has some use.",
  "descriptionHtml": "[COLOR=orange][b]=Description=[/b][/COLOR]\r\nYou go on a quest to find an ancient relic, only to find it damaged. You risk your life climbing to The Throat of the World, stealing from the giants, and fighting the Forsworn to repair it.\r\n\r\nFinally, your quest is done, and the Phial is restored. As a reward, it becomes yours. Filled with underpowered effects.\r\n\r\nThis mod attempts to fix that, and make the White Phial truly the powerful artefact it was supposed to be.\r\n\r\nLatest Skyrim patch required!\r\n\r\n[COLOR=orange][b]=Changes to the Phial=[/b][/COLOR]\r\nFirst of all, all the versions of the Phial are now worth 1,200 septims, if you decide to sell it for some reason.\r\n\r\nEffects may vary with mods such as Skyrim Redone, e.g. Light Weaponry instead of One Handed, and nerfed Resist Magic effect.\r\n\r\nHere are the new effects compared to the old ones.\r\n\r\n[b]\\\"I\\'d like it to have the power of healing.\\\"[/b]\r\n[b]Vanilla -[/b] Restore 100 points of health.\r\n[b]Mod -[/b] Completely restores Health. Restores 75 Magicka and Stamina. Cures diseases and poisons.\r\n\r\n[b]\\\"I want to resist the forces of magic.\\\"[/b]\r\n[b]Vanilla -[/b] 20% Magic resistance for 60 seconds.\r\n[b]Mod -[/b] 30% Magic resistance for 120 seconds. 20% chance to absorb hostile spells for 60 seconds.\r\n\r\n[b]\\\"I want to be tougher in battle.\\\"[/b]\r\n[b]Vanilla -[/b] Stamina is increased by 20 points for 300 seconds.\r\n[b]Mod -[/b] Stamina is increased by 50 points for 180 seconds. Stamina regenerates 100% faster for 180 seconds.\r\n\r\n[b]\\\"I want to strengthen my magical skills.\\\"[/b]\r\n[b]Vanilla -[/b] Magicka is increased by 20 points for 300 seconds.\r\n[b]Mod -[/b] Magicka is increased by 50 points for 180 seconds. Magicka regenerates 100% faster for 180 seconds.\r\n\r\n[b]\\\"I want to deal more damage in battle.\\\"[/b]\r\n[b]Vanilla -[/b] 50% more One-Handed weapon damage for 60 seconds.\r\n[b]Mod -[/b] Bows, One-Handed, Two-Handed, and Destruction spells deal 50% more damage for 60 seconds.\r\n\r\n[b]\\\"I want to be better hidden in the shadows.\\\"[/b]\r\n[b]Vanilla -[/b] You are 20% harder to detect for 60 seconds.\r\n[b]Mod -[/b] Invisibility for 12 seconds. You are 40% harder to detect for 180 seconds.\r\n\r\n[b][url=http://skyrim.nexusmods.com/mods/18594]Want The White Phial to refill any potion you wish, or you just want to realign it to another effect? Then get this great mod by Armada![/url][/b]\r\n\r\n[COLOR=orange][b]=Installation=[/b][/COLOR]\r\nDownload file. Either manually drop the .esp and activate it, or use the Nexus Mod Manager.\r\n\r\n[COLOR=orange][b]=Uninstallation=[/b][/COLOR]\r\nJust deactivate and remove the .esp file.\r\n\r\n[COLOR=orange][b]=Compatibility=[/b][/COLOR]\r\nThis mod will conflict with those that edit the Phial\\'s effects. If so, load this mod last for compatibility.\r\n\r\n[COLOR=orange][b]=Version History=[/b][/COLOR]\r\n[b]2.0 -[/b] Updated for the latest Skyrim patch. Made the effects less overpowered, more similar to the vanilla in the sense that they are more intense but have a shorter duration.\r\n[b]1.0 -[/b] Mod Released.",
  "categoryId": "94",
  "version": "2.0",
  "author": "Omeletter",
  "createdUnix": "1333832491",
  "updatedUnix": "1378209756",
  "containsAdultContent": false,
  "uploadedBy": "Omeletter",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000051943",
      "name": "BetterWhitePhialEffects",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "BetterWhitePhialEffects-14607-2-0.rar",
      "uploadedUnix": "1378209756",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/5c5b8e109793c4d18ee934ed0d2f0e5d79d5d2b8b1052894441ec556b5ed84c5/analysis/1407707412/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BetterWhitePhialEffects-14607-2-0.rar?fid=1000051943&ttl=1535778354&ri=8192&rs=8192&setec=89ab6a50177c78fb5e73f1f6041f1b98"
    }
  ]
}