{
  "modId": 14619.0,
  "modName": "Imperial Faction Pack_ArbitraryFA_Imperial",
  "summary": "ArbitraryFA - Imperial.esm : Portable consumables used from inventory such as a hammer for tempering or bellows for smelting; new recipes to condense crafting materials and lighten your inventory. Portable camp gear such as a Cot to sleep in and a Utility Bench for crafting; and new traps. Imperial followers and better stat Armors/Weapons.",
  "descriptionHtml": "ArbitraryFA - Imperial.esm : Portable consumables used from inventory such as a hammer for tempering or bellows for smelting; new recipes to condense crafting materials and lighten your inventory. Portable camp gear such as a Cot to sleep in and a Utility Bench for crafting; and new traps. Imperial followers and better stat Armors/Weapons.\r\n\r\nFull detail can be found at the forum topic:\r\nhttp://forums.nexusmods.com/index.php?/topic/638852-imperial-faction-pack-pre-release-notes/\r\n\r\n--- MOD ADDS/CHANGES SYNOPSIS ---\r\n1) Imperial Scout, Mage, and Soldier Auxiliary followers in the entrance of Castle Dour.\r\n2) Castle Dour changed to CWImperialFaction. Changes a bed downstairs to player owned with a chest next to it named Imperial Scout Chest. Adds a Cooking Pot to the stove.\r\n3) Adds Temper-able Imperial weapons with Elven stats and Penitus Oculatus armor with Scaled stats. Req. Advanced Armors Perk. Set Name: Imperial Regalia\r\n4) Adds crafted [Camp] recipes, dropped from inventory -> enter sneak mode & activate.\r\n5) Adds 1 use consumable [Kit] recipes used (activated) from inventory.\r\n6) Adds 1 use consumable [Condensed] recipes used (activated) from inventory.\r\n7) Adds crafted [Trap] recipes, dropped from inventory -> enter sneak mode & activate.\r\n\r\n--- ADDED BY THIS MOD ---\r\n--- (1) Camp Gear - drop from inventory -> enter sneak mode & activate.\r\n- \\\"[Camp] Imperial Cot” - Bed\r\n- \\\"[Camp] Stool” -\r\n- \\\"[Camp] Utility Bench” - Tanning Rack + Utility Pack\r\n- \\\"[Camp] Utility Pack” - Unique Workbench used exclusively to make “[Condensed] Raw …” & “[Trap] …” recipes in the field (can be used directly from inventory as well, but is not a consumable)\r\n--- (2) Crafted Field Kits - 1 time use (Activate the item from inventory, exit inventory menu, craft away wherever you are; once you activate one of the [Kit] used is removed like a consumable) Forge or [Camp] Utility Bench:\r\n- \\\"[Kit] Arms Hammer\\\" (Temper Weapons/Grindstone) 1.3 lb\r\n- \\\"[Kit] Armor Tongs\\\" (Temper Armor/Workbench) 0.7 lb\r\n- \\\"[Kit] Bellows\\\" (Smelter) 3.0 lb\r\n- “[Kit] Saw” - weigh 0.3 pounds ea, upon equipping/activating the player receives 7 firewood and 1 “[Kit] Saw” is removed from inventory. The idea is rather than carrying around 7 heavy logs, you only carry a light saw which can be used to gather the logs around you in the wilderness.\r\n--- (3) Crafted Condensed Packs - 1 time use consumables to consolidate weight\r\nTanning Rack\r\n- “[Condensed] Ingots - Basic” 3.0LB : 2xLeather Strips, 9xIron Ingot, 9xSteel Ingot\r\n- “[Condensed] Ingots - Aesthetic” 0.3LB : 2xLeather Strips, 3xSilver Ingot, 3xGold Ingot\r\n- “[Condensed] Leather” 1.0LB : 2xLeather Strips, 21xLeather, 21xLeather Strips\r\n- “[Condensed] Field Kit” 3.0LB : 2xLeather Strips, 1x[Kit] Bellows, 3x[Kit] Armor Tongs, 3x[Kit] Arms Hammer, 1x[Kit] Saw\r\n[Camp] Utility Pack\r\n- “[Condensed] Raw Iron” 0.7LB : 1xLeather Strips, 9xIron Ore\r\n- “[Condensed] Raw Leather” 0.3LB : 1xLeather Strips, 13xLeather\r\n- “[Condensed] Raw Strips” 0.1LB : 1xLeather Strips, 13xLeather Strips\r\nDuring the CW Questline the player does not really have a fix/convenient domicile, rather the PC travels between the Hold’s Camps, Forts, Capitals, and HQ. To combat this I introduce recipes with the concept the PC consolidates or redistributes his/her inventory (pack/backpack). If you have ever been hiking you may have made a few adjustments to belts, harnesses, distribution of weight, etc. and this simple rearrangement may help to lift some burden and give the sense of a lighter load; Of course the weight of the Condensed items added is greatly exaggerated.\r\nSo for instance: “[Condensed] Ingots - Basic” recipe requires 9-Iron Ingots, 9-Steel Ingots, and 2-Leather Strips (for the adjustments). Upon activating the misc sack item “[Condensed] Ingots - Basic” from your inventory you will receive 9xIron Ingots, 9xSteel Ingots and the misc item “[Condensed] Ingots - Basic” representing the adjustments to your inventory bag will disappear. So you gain everything you put into the recipe when you use it aside from a few leather strips *yet* rather than carrying around the weight of those 18 ingots you only have to carry around the misc item “[Condensed] Ingots - Basic” which weighs next to nothing and you will only need to take the ingots from the consolidated pack when you need them.\r\n--- (4) Traps - Crafted with “[Camp] Utility Pack”; drop from inventory -> enter sneak mode & activate\r\n- “[Trap] Imperial Tripwire” - Knocks down actors who walk through the trap (Not triggered by PlayerFaction)\r\n- “[Trap] Packed Tripwire” - ! Please do not have more than 1 “[Trap] Imperial Tripwire” in your inventory or in the same cell at a time! Use a “[Camp] Utility Pack” or “[Camp] Utility Bench” to create a “[Trap] Packed Tripwire” which is opened thru inventory by activating the item, just like [Condensed] pouches. This will avoid many issues and bugs.\r\n\r\n--- NOTES ---\r\n1) If misc items added by this mod stop working for whatever reason when you attempt to activate/equip them from inventory try dropping all of that item from your inventory, pick them up, and then try to activate them again.\r\n2) All items are crafted from a Forge, Tanning Rack, or [Camp] Utility under the “Imperial” category.\r\n\r\n--- FUTURE PLANS ---\r\n--- (1) Similar to the “[Condensed]” packs, I will introduce “[Voucher]”s which will be made from a much larger sum of crafting materials (Ingots, Ore, Leather) and weigh 0. You will be able to redeem a “[Voucher]” from an Imperial Quartermaster (Which I plan to station at every Fort as well, just like they are at the camps).\r\n--- (2) [Kit] Saw - I would like to make it so while in an exterior cell the screen will dim and after an in-game hour passes the player receives 7 firewood.\r\n--- (3) Craftable cooking fire that burns out after 3 hours, will also try to make something (if not this item) compatible with Hypothermia (Having issues with the fire not changing meshes each hour as I want it to)\r\n\r\n--- --- ---\r\nI am actually in the process of mapping out other factions, beginning with the Imperial Legion. That is the reason the name of my first file is \\\"ArbitraryFA - Forsworn\\\" (Arbitrary Faction Additions - Forsworn). Because I intended, or perhaps anticipated, ArbitraryFA - ... to be a theme of a mod series I release. The Forsworn to be honest, aside from being my fav faction, was the faction I wished to play at the time and having no experience with the CK the Forsworn Faction Pack mod was my experiment and orientation to modding. ArbitraryFA - Forsworn was my first mod.\r\nI expect future mod releases concerning arbitrary faction additions like Forsworn Faction Pack; most however will likely be much lighter mods than my first (I really went all out with the word arbitrary), like the Imperial Legion, because they already have a vanilla/initial foundation in the game. The Forsworn did not, and I built it essentially from scratch.\r\n--- --- ---\r\n\r\nThe mod will be based around how I play; and have similar adaptations/aspects to and stems from my mod\r\nForsworn Faction Pack\r\nNexus: http://skyrim.nexusm...le.php?id=12436\r\nSteam: http://steamcommunit...tails/?id=15401\r\n\r\nSome of the ardent and prevalent mods I will be using in conjunction with my game-play as an Imperial include…\r\nWARZONES - Civil Unrest by MyGoodEye:\r\nWars in Skyrim IV by Alexandrox:\r\nImp\\'s More Complex Needs:\r\nFrostfall - Hypothermia, Camping, Survival:\r\nCamping Kit of the Northern Ranger: ",
  "categoryId": "25",
  "version": "",
  "author": "Malzen333",
  "createdUnix": "1333839928",
  "updatedUnix": "1333840050",
  "containsAdultContent": false,
  "uploadedBy": "Malanity333",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51047",
      "name": "Imperial Faction Pack _ ArbitraryFA _ Imperial",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1490",
      "fileName": "Imperial Faction Pack _ ArbitraryFA _ Imperial-14619-1.zip",
      "uploadedUnix": "1333840050",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4600d7c652583bd2819b461ff14993dccdfae1151957ed43ff6e81b53d2fb57a/analysis/1406802980/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imperial%20Faction%20Pack%20_%20ArbitraryFA%20_%20Imperial-14619-1.zip?fid=51047&ttl=1535778377&ri=8192&rs=8192&setec=41e4aaceb2c6b0bd361772165aa0de6b"
    }
  ]
}