{
  "modId": 14637.0,
  "modName": "Dovahkiin Keep",
  "summary": "A Keep fit for any Dovahkiin. Beta stages. Must download.",
  "descriptionHtml": "Dovahkiin Keep BETA 1.0 Trailer:\r\n[youtube]P_QyNG7g2Lg[/youtube]\r\n\r\nFeatures:\r\n- 30+ Mannequins, Racks, Plaques, Bookshelves.\r\n- Seperate Cell Bedroom, Throne, Armory etc\r\n- Door to Each House in the game (Only one active atm, balancing in next update.)\r\n- Dragon-Priest Mask Holder \r\n- Much more, Watch Trailer.\r\n\r\nRead FAQ before asking questions please.\r\n\r\nThis is the Dovahkiin Keep in very early stages of Beta. I don\\'t have as much time as I would like to work on this lately so things are coming together fairly slowly. Eventually I plan to implement customizable guards, rivalry keeps, alternative storage racks like potions racks and holders for all your claws and much much more. For now you have all the necessities including 30+ Racks/Plaques/Mannequins, Storage and way more bookshelves then you could ever need.\r\n\r\nStay up to date by watching the video below which will change as development persists, I plan to release an update for this mod every week much like I did with my Dovahkiin Hideout. \r\n\r\nMy Update Vlog on this project and all my other ones, this will update weekly.\r\n[youtube]Jn9ckCH7FxQ[/youtube]\r\n\r\nFAQ & Reminder:\r\nThis is Beta. Many things are unfinished, if you are looking for a complete house that will not be getting constant updates then this is not the best one for you.\r\n\r\nQ. Why do all the Doors not work?\r\nA. Only one door is working. I find the doors to all the houses to be game breaking and because of this I am creating a quest for each door that you will have to complete to open all the doors to their individual houses/cities.\r\n\r\nQ. How do I get there?\r\nA. Type \\\"COC Dovahkeepinterior\\\" in console. OR find it in the wilderness, watch the video for clues.\r\n\r\nQ. Why is this or this broken?\r\nA. Because it is Beta, you\\'re testing it and a lot of things you find broken I don\\'t know about them. Let me know either in my Vlog or in the Comments here. I may not reply but I will read it.",
  "categoryId": "67",
  "version": "1.0BETA",
  "author": "Shawk",
  "createdUnix": "1333854025",
  "updatedUnix": "1333854322",
  "containsAdultContent": false,
  "uploadedBy": "Shawkab",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51107",
      "name": "DovahkiinkeepBETA1_0",
      "version": "1.0BETA",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "228",
      "fileName": "DovahkiinkeepBETA1_0-14637-1-0BETA.rar",
      "uploadedUnix": "1333854322",
      "modVersion": "1.0BETA",
      "virusScanUrl": "https://www.virustotal.com/file/3f8313022f9e0566171fc0dc59b589dbef59bd5b43f3c9c9579fc1f422a833b6/analysis/1406803263/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DovahkiinkeepBETA1_0-14637-1-0BETA.rar?fid=51107&ttl=1535778408&ri=8192&rs=8192&setec=de9ebf5c0fe32ca3a8dbc79b2ce7f7d2"
    }
  ]
}