{
  "modId": 14646.0,
  "modName": "Performance and Quality ENB",
  "summary": "An ENB config specifically to shut up all the \\\"ENB looks good but runs crappy even on high end PCs\\\" noise. Offers best quality visuals for best possible performance. Currently WIP and feedback/suggestions are welcome. ",
  "descriptionHtml": "[color=yellow][b] LATEST UPDATES [/b] [/color]\r\nVersion 1.0 final released. Fixed character skin issues. Added very subtle bloom and lensflare upon popular requests. Unless there is a significant new ENB released with major features, this is going to be the last release for this mod. \r\n\r\nAlso added a brief readme file with text ripped straight out of this description. \r\n\r\nReuploaded the file with character skin fixes. Simply redownload the mod if you\\'re unhappy with how the skins on characters looked in v0.9.\r\n\r\nv0.9b released for public testing! UP TO 25% PERFORMANCE INCREASED COMPARED TO PREVIOUS VERSION depending on the scene.\r\n\r\nThis is the version that should make almost everyone happy. Not only does it LOOK a lot better than 0.8b, but it runs faster too! Don\\'t believe me? Wait until the video is posted or just download now and try for yourself. \r\n\r\n[color=yellow][b]IMPORTANT NOTE, MUST READ BEFORE DOWNLOAD:[/b][/color] If you have ANY issues with the blue glare, underwater effects, darkness at night or other problems, READ THIS FAQ BELOW!\r\n\r\n[color=yellow][b]FAQ[/b][/color]\r\n[b][Q]I DONT LIKE THE LENSFLARE! IT MAKES ME FEEL LIKE IM TRIPPING ON MUSHROOMS! [/b]\r\nA:In v0.8 there is an optional ini file in the Remove Lensflare folder that you can use instead of the default one IF YOU DO NOT WANT THE BLUE GLARE/Lensflare Effects that are visible during the day. This is how the game should look with that file in use: http://skyrim.nexusmods.com/downloads/images/14646-1-1334115336.jpg\r\n\r\n[b][Q]I can\\'t see anything underwater with this mod enabled! Also, still tripping on mushrooms.[/b]\r\n\r\nUnderwater visibility bug: change bDoDepthOfField= to 0 in your skyrimprefs.ini - That should fix it. Also try installing the unofficial skyrim patch. \r\n\r\n[b][Q]HOLY CRAP IM TRIPPING BALLS. Also, this mod makes my game crash upon launch/Does not load at all/I can\\'t enable it no matter how many times I bang my gigantic genitals on the shift and F12 keys.[/b]\r\nA: Check the discussion thread in the forum for this mod. A lot of people had a variety of different reasons for crashing, but it was mostly some hardware-manufacturer-created programs running in the background that needed to be closed before running the game. Also make sure that you download the correct d3d9.dll file from the install notes below. \r\n\r\n[b][Q]WHY THE HELL ARE THERE BLACK BORDERS ON THE TOP AND BOTTOM OF THE SCREEN? I AM ALREADY RUNNING AT 640X480 FOR ****s SAKE! \r\nA: There is an optional enbeffect.FX file in the downloads section. You can download that and replace the default one with it to remove the black borders. Everything else will remain the same. \r\n\r\n[b][Q] You promised brighter nights, yet I can\\'t see crap with your mod enabled. I WANT MY MONEY BACK![/b]\r\nA: I cannot stress this enough: Please uninstall any other lighting mods such as URWL or realistic lighting MANUALLY. Which means that not only do you have to disable and delete them from Nexus Mod manager, you also have to dig into the game\\'s folder and delete their config files or anything that is left behind. This has happened to one user before who was then able to enjoy the bright nights feature so do make this effort if you want the same. \r\n[b][Q] There is a weird pattern on the grass everywhere. You broke my game! [/b]\r\nA: Actually, that\\'s another bug introduced in patch 1.5. No fix for that yet. People get it even without using this ENB so it has nothing to do with the mod. \r\n\r\n[b][Q] The depth of field effect isn\\'t letting me zoom in on my character\\'s face! HOW THE HELL AM I TO FAP TO MY MODDED HENTAI HOTTIE NOW?[/b]\r\nA: You need to zoom out at least two levels for your character to not get blurred. You can still get in very close by typing the console command fov 65  - If you don\\'t want your character to get blurred on the race edit menu, type TFC before going into the menu, position the camera in front of your character\\'s face and then use the showracemenu command to edit the face from that camera angle. \r\n\r\n[b][Q] You have flawless, beautiful skin. O_O What is your secret? [/b]\r\nA: I exfoliate after shaving, avoid aftershaves and skin products that contain alcohol and apply cucumber extract regularly. Also, good sleep and exercise helps. \r\n\r\nWhat? The title is FREQUENTLY ASKED QUESTIONS. -_-\r\n\r\n[color=yellow][b]Features:[/b][/color]\r\n\r\nSSAO: \\\"Soft\\\" SSAO that offers high performance WITHOUT DARKENING THE IMAGE TOO MUCH. This is an important factor because most SSAO-enabled ENBs make it impossible to see anything at night. Nights are still dark when using this mod but only to a realistic extent. \r\n\r\nBRIGHTER NIGHTS: No longer do you have to worry about having pitch dark nights like all the other ENB Tweaks. v0.7b offers the best possible visibility at night while keeping things moody and having all effects enabled. Check out the screenshots and try it for yourself. Feedback is welcome. \r\n\r\nAdvanced Depth of Field: Tried my best to keep it as little distracting as possible. You can still edit the EnableDepthOfField=true to \\\"false\\\" to disable it in the enbseries.ini file. \r\n\r\nBest balance between performance and image quality: I uploaded this mod to shut up all the \\\"ENB looks good but runs crappy even on high end PCs\\\" and \\\"ENB is only good for taking screenshots\\\" noise. Offers best quality visuals for best possible performance. \r\n\r\nCurrent status: WIP. Still tweaking. Feedback is welcome but you need to have working knowledge of tweaking ENB configs yourself if you are to send any. \r\n\r\n[color=yellow][b]NEWS[/b][/color]\r\n\r\n-v1.0 released. Final version. See Latest News section at the top. \r\n\r\n-v0.9b released. Performance and image quality improvements. See video section for details. \r\n\r\n-v0.9b COMING SOON! WITH PERFORMANCE IMPROVEMENTS! YAYY!\r\n\r\n-Version 0.8b released. Celebratory timelapse video: [youtube]1l1tn9gs0IE[/youtube]\r\n\r\n-NEW IN VERSION 0.7b: BRIGHT NIGHTS! This is the only ENB tweak that gives you perfect visibility at night while keeping all the pretty effects enabled! Watch: \r\n[youtube]KDYmN5i8CGk[/youtube]\r\n\r\n-Important updates: The latest version of URWL makes the nights darker. Do not enable URWL if you want to avail the brighter nights features of this mod. \r\nExample (bottom is with URWL): http://imgur.com/a/IRFOv\r\n\r\n-Underwater visibility: This is a bug caused by Skyrim\\'s 1.5 patch. Install the unofficial patch to fix the problem or give up on all ENBs altogether. \r\n\r\n-Video of various environments (footage from v0.5b): \r\n[youtube]4OelWsU1Spo[/youtube]\r\nShadows are a bit jittery in the video. I fixed the issue later on and you can too if you want to follow the steps at the bottom of this description. \r\n\r\n\r\n\r\n[color=yellow][b]IMPORTANT: Installation notes[/b][/color]\r\nDownload ENB version 102 Tatsudoshi here:  http://www.enbdev.com/download_mod_tesskyrim.htm \r\nExtract to your Skyrim folder.\r\nDownload this mod.\r\nExtract to skyrim folder.\r\nIf asked to replace any files, select yes.\r\n\r\nMake sure you have this value set in your skyrimprefs.ini file : \r\nbFloatPointRenderTarget=1\r\nTo fix blocky shadows, see the notes at the bottom of this description. \r\nDelete any custom sunglare textures from your textures folder. The file name is sunglare.dds\r\nDelete any other lighting mods that you have installed MANUALLY. Which means you have to go into the folders and delete their files, not just through NMM. \r\n\r\n[color=yellow][b]UPDATES[/b][/color]\r\n\r\nv1.0 released. Last update that addresses all known issues. \r\n\r\nVersion 0.8b released! Significantly reduced glare effects (try them out!), warmer colours, better specular highlights at night, added optional file that completely removes daytime lensflare effects.\r\nNot compatible with URWL or any other lighting mods. Everyone seems hell bent on wanting to make nights darker. ;/\r\n\r\n0.7b \\\"Test\\\" version released with brighter nights. Now you can enjoy all of ENBSeries effects while playing the game safely at night without the hindrance of looking at a black screen. \r\n\r\nNew in 0.7b: SSAO is higher than 0.5b, but lower than 0.6. Helps the night scenes a lot. \r\nHigher quality clouds, moon lighting at night. \r\nHigher quality specular lights at night. Have your character stand in front of a light source at night to see the difference. \r\nTweaked night time lensflare effects. Brighter light sources give off more lensflare while smaller sources shouldn\\'t give off any at all now. \r\n\r\n0.7b *COMING SOON* - BRIGHTER NIGHTS! The only effect-heavy ENB mod that doesn\\'t give you crappy, blinded pitch dark nights! Have a sneak peak: [IMG]http://i.imgur.com/QOYCGl.jpg[/IMG]\r\n\r\n0.6b: Increased the SSAO sampling range value slightly thanks to feedback from Kyokushinoyama. Please test it out on your own and let me know if there are any suggestions. I will be happy to have a look at them. \r\n\r\nUpdate#2: \r\nAdded optional enbeffect.fx file that removes the black bars. Thanks to Metuz for this. \r\n\r\nFuture updates: Further tweaking lensflare effects. Maybe create 3 presets for various SSAO intensities. Tweaking DOF. \r\n\r\n[color=yellow][b]Recommended Mods[/b][/color]\r\nTESV Acceleration layer: http://skyrim.nexusmods.com/downloads/file.php?id=4387 (Currently hidden. Dear author, GIVE US THE GOODS, MAN!)\r\n\r\nUnofficial skyrim patch 1.0 <- gave me a huge FPS boost. http://skyrim.nexusmods.com/downloads/file.php?id=19#content\r\n\r\n[color=yellow][b]How to fix blocky shadows in Skyrim[/b][/color]\r\nSet shadow quality to medium in the game\\'s launcher options. \r\nLaunch the game once and exit it.\r\nEdit skyrimprefs.ini and add/change to the following values:\r\n\r\niShadowMapResolution=4096\r\niShadowMapResolutionSecondary=4096\r\niShadowMapResolutionPrimary=4096\r\niBlurDeferredShadowMask=5 \r\n\r\nSetting to medium decreases the shadow distance. If you want to keep it that way, then that is fine as you get higher performance. But if you want to increase it then you can add to the following values:\r\nfShadowDistance=xxxx.xxxx  - The higher, the better. I suggest something like 3500 or 4000. \r\n\r\n\r\nAgain, any feedback is welcome as long as you have working knowledge of tweaking ENB. Kindly PM me if you do. ",
  "categoryId": "62",
  "version": "1.0",
  "author": "HBogard",
  "createdUnix": "1333866155",
  "updatedUnix": "1334544870",
  "containsAdultContent": false,
  "uploadedBy": "HBogard",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51277",
      "name": "Remove Black Bars",
      "version": "0.6b",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "12",
      "fileName": "Remove Black Bars-14646-0-6b.rar",
      "uploadedUnix": "1333897860",
      "modVersion": "0.6b",
      "virusScanUrl": "https://www.virustotal.com/file/b4b91433913b2d54252c8e3ef8d31bc343ce498ce3bece121e849bb0bdadd546/analysis/1406804179/",
      "changelogHtml": " Increased SSAO slightly <br/> \n Added optional enbeffect file to remove black bars (see downloads) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Remove%20Black%20Bars-14646-0-6b.rar?fid=51277&ttl=1535778423&ri=8192&rs=8192&setec=3465a24cb9320e155e03be14d941fb11"
    },
    {
      "fileId": "51708",
      "name": "High quality and performance ENB Core Files Now with Bright Nights",
      "version": "0.7b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "276",
      "fileName": "High quality and performance ENB Core Files Now with Bright Nights-14646.rar",
      "uploadedUnix": "1333999214",
      "modVersion": "0.7b",
      "virusScanUrl": "https://www.virustotal.com/file/9418274a5c4e5be71d5a370eeb9fd6ed990e8a05a760b6946209c4093411b72b/analysis/1406806344/",
      "changelogHtml": " Brighter nights (see description video) <br/> \n Better lighting and specular highlights at night <br/> \n reduced SSAO <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/High%20quality%20and%20performance%20ENB%20Core%20Files%20Now%20with%20Bright%20Nights-14646.rar?fid=51708&ttl=1535778424&ri=8192&rs=8192&setec=9a1da2c74524e5b89b7c99f04811006f"
    },
    {
      "fileId": "52165",
      "name": "High Quality And Performance ENB 08",
      "version": "0.8b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "45",
      "fileName": "High Quality And Performance ENB 08-14646.rar",
      "uploadedUnix": "1334126121",
      "modVersion": "0.8b",
      "virusScanUrl": "https://www.virustotal.com/file/7ba96f2afce460b14ac6dbdb4e01a030c041a0ef1a028d761cfce099c81a8b2f/analysis/1406808962/",
      "changelogHtml": " Even better specular highlights at night <br/> \n Reduced lensflare effects significantly <br/> \n Added optional file to completely remove lensflare <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/High%20Quality%20And%20Performance%20ENB%2008-14646.rar?fid=52165&ttl=1535778424&ri=8192&rs=8192&setec=ad72d4e63d29017d5b6c2317c2402088"
    },
    {
      "fileId": "52996",
      "name": "Performance and Quality ENB 09",
      "version": "0.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35",
      "fileName": "Performance and Quality ENB 09-14646.zip",
      "uploadedUnix": "1334360533",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/6761da6125868e466e6802a5b3ec3b1b1846e046a187e6e5fa89f65126bcce96/analysis/1406814244/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Performance%20and%20Quality%20ENB%2009-14646.zip?fid=52996&ttl=1535778425&ri=8192&rs=8192&setec=4ca940ece92dad9ad07d81ee3620914c"
    },
    {
      "fileId": "53630",
      "name": "Performance and Quality ENB Final",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "37",
      "fileName": "Performance and Quality ENB Final-14646-1-0.zip",
      "uploadedUnix": "1334544870",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f1789188b875de634b6d9681a33c6e53ec61149aedf110848ea0f72993693289/analysis/1406818118/",
      "changelogHtml": " Final version. <br/> \n Resolved all known and possibly fixable issues. <br/> \n Added back some very subtle glare and bloom effects.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Performance%20and%20Quality%20ENB%20Final-14646-1-0.zip?fid=53630&ttl=1535778426&ri=8192&rs=8192&setec=e537747633fc82b609440d9299ad5c89"
    }
  ]
}