{
  "modId": 14650.0,
  "modName": "Tuer les personnages essentiel du jeu Kill most of the game",
  "summary": "Ce mod est créé dans le seule but de donner un petit côté sadique au jeux =)\r\nThis mod is created in the only goal to give a little sadistic side to play =)",
  "descriptionHtml": "Ce mod : Tuer les personnages essentiel du jeux sert exactement à ce que le nom indique nous pouvons tuer les personnages qui sont indispensable dans le jeux par exemple ; Ulfric,Vignar,Laila, les 4 vieux grises-barbes et les légate et plein d\\'autre mes ce mod est encore en préparation si il y a des NPC manquant veuillez me les faires parvenir.\r\nRègle : ATTENTION !!! Je ne suis pas responsable de vos sauvegarde si vous voulez tuer des personnages essentiel sans abîmé votre gameplay veuillez faire une sauvegarde du genre \\\"RP\\\".\r\nThis mod: Kill the characters essential of games is exactly what the name says we can kill the characters that are essential in such games; Ulfric, Vignar, Laila, the four old gray-beards and Legate and full of my other mod is still being prepared if there are NPC missing please send me the faires.\r\nRule: CAUTION! I am not responsible for your backup if you want to kill people without essential ruined your gameplay please make a backup like \\\"RP\\\".",
  "categoryId": "33",
  "version": "1.0",
  "author": "Macleone",
  "createdUnix": "1333870549",
  "updatedUnix": "1334578476",
  "containsAdultContent": false,
  "uploadedBy": "Macleone",
  "primaryFile": null,
  "files": [
    {
      "fileId": "53710",
      "name": "Kill most of the game",
      "version": "1.4.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7508",
      "fileName": "Kill most of the game-14650-1-4-2.rar",
      "uploadedUnix": "1334578476",
      "modVersion": "1.4.2",
      "virusScanUrl": "https://www.virustotal.com/file/cf9daf7e76878909434a1140eafd1f4ab86a888d0b753f4dc78089ddad85df0a/analysis/1406818638/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kill%20most%20of%20the%20game-14650-1-4-2.rar?fid=53710&ttl=1535778430&ri=8192&rs=8192&setec=3ed1d37ab21a049d93638af56c67836f"
    }
  ]
}