{
  "modId": 14660.0,
  "modName": "TheWinterhawks Black Wolf Lodge Playerhouse",
  "summary": "A cozy, not small, but very functional playerhouse with lots of safe storage room and bookshelves in hunting lodge style. Comes with stables, four custom horses, a few dogs and Anouk the farm maiden. Offers some little gimmicks and has a book special: One (free source) book of a famous author was added in a series, and TheWinterhawk wrote a little ",
  "descriptionHtml": "Finally a new update is available for the popular Black Wolf Lodge playerhouse. The BWL has been my first mod and I released it about one year ago. Now, a full year later with much more modding experience, some very annoying bugs were ironed out, so I hope you guys enjoy the worked over version 3.1 even more, than you did the old ones. Thanks for downloading and don\\'t forget to endorse, please. =)\r\n\r\n[color=orange][b]\r\n************************************************************************************************************************\r\n\r\nUPDATE INFO 03/11/13: What\\'s new on BWL v3.1?\r\n\r\n- player bed gives well-rested bonus now\r\n- an additional follower bed was implemented\r\n- followers sticking in ground when leaving the house is finally fixed... yay!!!\r\n- Anouk and Loki will back off a little, when following\r\n- Sigyn, Bragi and the horses will no longer go mad on you when they witness you hitting Anouk or Loki by accident\r\n- Lighting indoors has been adjusted to be a tiny little bit more realistic\r\n- now bards can play in your house\r\n- Anouk wears no longer a Nocturnal hood. Her default sleep outfit was taken out. If she still wears it. Leave her, fast travel far away, wait for the cell to respawn and visit back. She should no longer wear the hood then.\r\n- And finally for your delight... an archery target and a practice dummy were added behind the house. They DO NOT give you any boni or experience. They are for keyboard/hud battle training purpuses only!\r\n\r\n************************************************************************************************************************[/b][/color]\r\n\r\nUPDATE 06/23/2012: Little INFO on BWL v3.0 custom horses: If you use the Conventient Horses mod v3.1 and want one of those horse armors included in that mod, you can assign them easily to the BWL custom hoses. You don\\'t even have to spawn saddled horse versions from the console, just go through the menu of Convenient Horse Power for the player horse and Myrkvind, Svadilfari, Balder or Heimdall will wear the armor from Convenient Horses Mod v3.1 that you choose! It works, so to speak is fully compatible! It\\'s not compatible with higher versions of CH anymore, because the author changed horse races in a way, that makes using custom horses with cusom saddles impossible.\r\nUPDATE 04/25/12 Black Wolf Lodge v3.0 with unique horse and dog (has 2 additional dogs now) textures, more idle and patroll markers in the house for spouses. Anouk got more AI packages and sleeps in the house at night. MEET new dog Sigyn and her puppy Bragi! Choose one of the horses Balder, Heimdall, Myrkvind or Svadilfari and spawn yourself a saddled version via console! Also has three more food containers.\r\nUPDATE 04/15/12 Black Wolf Lodge v2.0 makes Loki recruitable, new player bed skin, nicer memorial area\r\nUPDATE 04/08/12 1:30 am, Germany: Completely new BSA archive uploaded\r\nUPDATE 04/08/12 Uploaded a completely new manual .rar archive that should include all scripts now.\r\nUPDATE 04/08/12 QuestFix separate file, so Anouk will give you the key now.\r\nUPDATE 04/08/2012 v1.0 with fixed BSA Archive!\r\nRelease Date: 04/08/2012 V1.0\r\n\r\n************************************************************************************************************************\r\n\r\nADDITIONAL UPDATE INFO on BWL v3.0:\r\nI finally managed to assign new textures to creatures in the CK. Had some trouble first to figure it out. Loki has a family now and the dogs and the horses have unique skins. The horses on the paddock will be „naked“, but you can spawn each of the 4 horses via console, having a vanilla saddle, which you can also retexture.\r\n\r\nJust put your saddle.dds and saddle_n.dds into the folder data\\\\textures\\\\actors\\\\horse\\\\bwlhorse and rename the files to saddleLnF.dds and saddleLnF_n.dss. This change will only affect the four custom horses! By only changing textures you can only use saddle retextures, that refer to the vanilla saddle.nif! No imperial saddle or custom horse armors. If you want one of these you\\'d have to change the saddle.nif in data\\\\meshes\\\\actors\\\\horse\\\\bwlhorse and rename it to saddleLnF.nif.\r\n\r\n[color=yellow][b][size=3]VERY IMPORTANT for users who update from v2.0 to v3.0 or v3.1:\r\nIF YOU USED A HORSE MOD WITH INVENTORY/SADDLE BAGS FOR ONE OF THE 4 HORSES, PLEASE GET YOUR STUFF OUT OF THE HORSES FIRST, BEFORE YOU UPGRADE TO v3.0! WITH THE UPDATE TO BWL v3.0 THE 4 VANILLA HORSE MODELS WILL BE GONE FROM THE PADDOCK!!![/b][/color][/size]\r\n\r\n************************************************************************************************************************\r\n\r\nInfo on potentially getting stuck NPCs:\r\n\r\nJust a note for NPCs potentially getting stuck for Dragon Rising quest:\r\nWe (I and my husband) tested the house each on a new character. The NPCs seem to stop at the Khajit camp sometimes, where I didn\\'t touch anything in the CK, so I don\\'t know why they would stop there.\r\n\r\nWe both just ran to the spot where we should meet with Irileth and waited 1 or 2 ingame hours by pressing T. Irileth and the soldiers then appeared. So, if anyone should face problems in this situation, you don\\'t have to disable the mod. Just press T to wait a little. Or log out and in again. (Don\\'t forget to save). =)\r\n\r\n************************************************************************************************************************\r\n\r\nBefore we begin, a warmly recommendation:\r\n\r\n[color=orange][b]\r\nPLEASE, MAKE USE OF THE README.txt BEFORE INSTALLING TO AVOID KNOWN GAME BUGS AND TO MAKE THE MOD RUN WITHOUT PROBLEMS! (Large object issues)[/color][/b]\r\n\r\n************************************************************************************************************************\r\n\r\n[color=orange][b]THE HOUSE:[/b][/color]\r\n\r\nIn the central location of Whiterun you\\'ll find (only a few steps away from the stables) the beautiful Black Wolf Lodge. This playerhouse has two floors and comes with stables and a paddock. It has  a couple of NPCs attached to the exterior: farm maiden Anouk, who is looking after the horses, and Loki, the farm dog and his little family. There are also 4 horses, called Balder, Heimdall, Svadilfari and Myrkvind. There are 5 chickens as well.\r\n\r\nThe house offers a great functionality. There\\'s plenty of room to store your items, all of them respawn safe. Not all chests look like chests, many of them are disguised as clutter items, so wander around the house to find all the functional places, where you can properly manage your goods and chattels! For instance the potions can be stored in potion bottles, but only the biggest bottle of a set will be activateable. Or the scroll, that is positioned on top, is activateable. Sounds confusing? Don\\'t worry, just take your time to discover the Black Wolf Lodge. Soon enough you\\'ll have no problems in finding the places, where to store your stuff.\r\nA couple of gimmicks await you, too. ^^\r\n\r\nIf you love to collect books, then this house might be for you. You have storage room for 168 books visible and 132 invisible plus 6 copies of respawn-safe winterhold bookcases.\r\n\r\nInside the house you\\'ll also find some new books as a surprise. Look out for them! A special series was written for you by me, and you\\'ll find a complete work of a well-known writer as well. The text of his work was taken from thefreelibrary.com. Enjoy!\r\nhttp://www.thefreelibrary.com/\r\n\r\nOutside the house there is a fully provided crafting area. Inside the house are more crafting tables. You\\'ll find EVERYTHING YOU NEED either inside or outside the house. The chests in the exterior can only be opened with keys. Find them! ;)\r\n\r\nThe Black Wolf Lodge comes with a map marker and you can travel from inside the house. It has Navmesh, so you can take a follower in.\r\n\r\n[color=orange][b]You\\'ll obtain the house by a little quest. Just travel around and wait for the courier!\r\nPLEASE, TURN ON DIALOGUE SUBTITLES AFTER THE COURIER HAS TALKED TO YOU. YOU CAN TURN THEM OFF, AFTER YOU HAVE RECEIVED THE KEY TO THE HOUSE.[/b][/color]\r\n\r\n************************************************************************************************************************\r\n\r\nPlease, consider:\r\n\r\nI\\'ve spent really a lot of time with building this house and many, many hours were frustrating, because the CK had bugs, or I didn\\'t find the proper information needed, so my work was stuck at that point and I had to take care about a diffrent matter first. If you have never worked with the CK, then you can not know how frustrating it can be at times. Thank God I\\'m armed with a whole lot of patience. Otherwise this work would not exist! So, please, before you start complaining, think of this first! If you\\'re having problems with the house, the readme.txt will be a big help! Use it! If you can do it better, DO it, instead of making other people\\'s work bad, please. ;)\r\n\r\nI really hope, that at least some of you enjoy my work. Thank you! =)\r\n\r\n************************************************************************************************************************\r\n\r\n\r\nList of functional items:\r\n\r\n- alchemy table\r\n- enchanting table\r\n- cooking spot\r\n- forge\r\n- sharpening wheel\r\n- workbench\r\n- smelter\r\n- tanning rack\r\n- woodchopping block\r\n- all 10 altars scattered across the house (one outside)\r\n- 4 rideable horses (without saddle)\r\n- 1 recruitable ranger NPC (hope to activate Loki, so you can have a dog follower either)\r\n- 3 mannequins\r\n- 4 display cases\r\n- 3 weapon racks (x2, x3, x4)\r\n- 11 weapon plaques (4 of them for shields and two weapons)\r\n- about 20 non-respawning cupboards/dressers, etc.\r\n- 17 non-respawning obvious chests inside, 3  non-respawning obvious chests on the outside\r\n- 31 non-respawning disguised chests inside, 1  non-respawning disguised chest outside, \r\n- 4 non-respawning barrels inside , 3 non-respawning barrels outside\r\n- around 8 non-respawning sacks inside\r\n- 1 safe (key required)\r\n- 7 useable obvious (normal) bookshelves with room for 168 books!\r\n- 11 hidden bookshelves with room for another 132 books!\r\n- 6 bookcases (like in winterhold, but respawn safe copies) if you need more space for books ;)\r\n\r\n************************************************************************************************************************\r\n\r\nNow a word about my work:\r\n\r\n1. I\\'m a bloody beginner with the creation kit. I\\'ve started literally from 0. So, if anything goes wrong, I have warned you. ;) However, the last 4 weeks I put all my time into this project. I tried and gave my best, always searching the internet hours and hours for the best solution. It\\'s not perfect and due to many problems I had to abandon some of my ideas. At this point I want to give utterance to the fact, that the creation kit is incredibly buggy, and often it is no fun to work with it at all. Due to that fact I also abandoned some ideas, others I couldn\\'t abandon, so if you experience bug it is very likely, that the problem is within the CK. I\\'m surely far beyond from being perfect, but I have an overview now about which problems come from CK and which not. More about that in the readme.txt!\r\n\r\n2. I built this playerhouse for myself. Once I put all the work into it, I thought it would be a waste not to offer it to the public. But it wasn\\'t meant for public in first place. So, please don\\'t ask me to change this or that. If you want the house different, feel free to make a copy and change what you want to be changed. If you should release your works to public, please name me and link to this site. Fair enough, huh? ;)\r\n\r\n3. Though my English might be quite well, it is not my mother tongue, so be patient with me, if I don\\'t understand your problem right away, or if you find any spelling/grammar errors. =)\r\n\r\n4. The .esp was done in a German CK, so I\\'m afraid some of your housing items will have German language now. Whenever it was possible (e.g. for copies), I renamed chests and stuff, but I\\'m sure there will be some German remains. Maybe someone with an English CK can do a re-translation file or something? Feel free! =)\r\n\r\n************************************************************************************************************************\r\n\r\nWARNING: FRAMERATE MIGHT GO DOWN!\r\n\r\nThe file and the house as such is NOT SMALL. Despite the recommendations I used clutter NOT SPARINGLY!!! Due to this fact on a weaker computer you may experience lag! Therefore I relinquished to use shadow casting lights. If you experience bad lag, before abandoning the house, (though you\\'d so much love to live in there), use the readme.txt and follow the instructions. Maybe it helps!!! Please, have a little patience with the house and try it out. ;)\r\n\r\nFor any problems you experience, just read the readme.txt. Everything you need to know is in there!\r\n\r\n************************************************************************************************************************\r\n\r\nAbout the screenshots:\r\n\r\nI use realistic lighting and have some mods, that change the appearance of some items like furniture. So, if you see something in my mod, that you want, just ask. I did NOT include the changes into my mod! So you\\'ll have to get it seperately.\r\nDue to realistic lighting, my screenshots are probably darker than what you\\'ll have in your game. If you use no light mod, your house will be brighter. I tried to find a light ambience, that satisfies light mod users as well as non-light mod users. But don\\'t forget, I made this house for myself, so no guarantee, that your house lighting looks well. If you want a different lighting, feel free to make a copy and change the light. ;)\r\n\r\nThe shots were taken in that way, that they would tease you a bit, but would not necessarily offer the whole beauty at once. So, just try out the playerhouse and see it with your own eyes. ;)\r\n\r\n************************************************************************************************************************\r\n\r\n[color=orange][b]Compatibility with other mods:[/color][/b]\r\n\r\nEvery mod, that changes the Whiterun 14(3,-3) or 15(3,-4) exterior cells and the wilderness (2,-3) ; (2,-4) and (2,-5) cells CAN give you trouble!!! It doesn\\'t need to though! Try it out. It depends on your mods and possibly the load order.\r\nHowever, no original triggers or functionality to any original markers were touched. I only had to move a giant marker slightly in wilderness (2,-5) so the giants wouldn\\'t be running right into my house.\r\n\r\nIncompability was reported with \\\"Rabbit\\'s Foot Caravan\\\". Thanks to user Syscrusher for the info! =)\r\n\r\nThe unique custom horses don\\'t seem to respond well to the \\\"Better Horses\\\" mod. Alas, there\\'s nothing I can do about it. I myself have switched to \\\"Convenient Horses\\\" for the moment. The custom horses work really fine with it.\r\n\r\nNo problems should occur with „Lanterns of Skyrim“ mod. Indeed the Black Wolf Lodge lanterns are taken from that mod and have been woven into the scenery to fit „Lanterns of Skyrim“ perfectly, because I think it\\'s an adorable mod!\r\n\r\nWith any other mod, the Black Wolf Lodge SHOULD function. I use myself about 100 Mods and have no problems running it. XD\r\n\r\n************************************************************************************************************************\r\n\r\nKnown issues: (Please, make use of the readme.txt for more information!)\r\n\r\n- Anouk has darker face color ? Bethesda fix\r\n- Some weapon plaques don\\'t work properly (stuck weapons) ? Bethesda fix, or putting plaques somewhere else (the greenish walls give the problems due to invisible wall parts)\r\n- horses sometimes spawn outside the stable, i guess bugged navmeshes, can\\'t seem to help it\r\n- followers sometimes have problems with navmesh, I guess, that is because at some spots, the house is quite narrow. Navmesh in general is something Bethesda has to fix.\r\n\r\n************************************************************************************************************************\r\n\r\n[color=orange][b]CREDITS:[/b][/color]\r\n\r\nMy first credits go out to [color=yellow]WillieSea[/color] from TESAlliance. He has helped me with two questions, \r\none about converting clutter to statics in NifScope, and the other was a scripting question. \r\nThank you again, Willie!\r\nAlso from TESA: big thanks to  [color=yellow][b]Artisanix[/b][/color] for another script help!\r\n[color=orange]http://tesalliance.org/forums/index.php[/color]\r\n\r\nA great tribute goes out to all the tutorial makers out there. Without all you guys this project would not have been possible! I learned a whole lot from you, but unfortunately there are too many of you to mention. Lots of youtubers did a great job, having the answers to my questions in their video tutorials, and the TESA tutorial was a great help either, especially considering the navmesh. Alas, the CK wiki was often not very helpful or confusing (but sometimes helped, too), so thankies to the Big Maker, that you all share this time with me on this planet. =)\r\n\r\nSpecial thanks go out to youtuber  [color=yellow]doughamil[/color] for his courier quest tutorial. Was a huge help!\r\n[color=orange]http://www.youtube.com/watch?v=iustaHoHnEE&feature=relmfu[/color]\r\n\r\nI already mentioned the „Lanterns of Skyrim“ mod. I took some copies of the lantern and the light in there and placed them around my lodge, so they would fit in the scenery with \\\"Lanterns of Skyrim“ perfectly. Credits and special thanks go out to  [color=yellow]mannygt[/color] for this beautiful work! (I didn\\'t use a script, though.) Please, take a look at his wonderful mod:\r\n[color=orange]http://skyrim.nexusmods.com/downloads/file.php?id=12451[/color]\r\n\r\nI used  [color=yellow]AlienSlof\\'s[/color] Skeever retex for a wallmount. In the Black Wolf Lodge v3.0 I have also used some of her lovely horse retextures for Balder, Heimdall, Svadilfari and Myrkvind. She has more really beautiful work out there. Go and see it!\r\n[color=orange]http://www.slofslair.co.uk/index.php?page=modarticle&modarticle/id=63ce3yfpjrb[/color]\r\nSlof is back with her works on the Nexus! Check her horse skins here: [color=orange]http://skyrim.nexusmods.com/mods/18602/[/color]\r\n\r\n[color=yellow]Blary[/color] has changed the business ledger to show two different pages, I used his .nif model for my work and attached my own page designs to it. Thank you Blary! Great work! You can find the .nif file here:\r\n[color=orange]http://skyrim.nexusmods.com/downloads/file.php?id=14134[/color]\r\n\r\nThe unique texture for the leather and fur saddle I would have liked to use for my custom horses was made by [b]Sedryn![/b] Alas, I couldn\\'t integrate it in my mod, because Sedryn didn\\'t respond by now. So I have no permission. But you can find the saddle and much more of his wonderful work at:\r\n[color=lightblue]http://skyrim.nexusmods.com/downloads/file.php?id=3200[/color]\r\nDon\\'t miss it! ;)\r\n(Once you have the leather and fur saddle texture you can replace it as mentioned above.)\r\n\r\nA mod I didn\\'t use for my work, but that I highly recommend is the \\\"Spouses can live everywhere\\\" mod by [b]Emma[/b]. Since my house is not spouse-friendly you might want to use her mod. ;)\r\n[color=lightblue]http://skyrim.nexusmods.com/downloads/file.php?id=11370[/color]\r\n\r\n\r\nI really hope I have not forgotten to mention anybody. If I did, please, drop me a note, so I can add you to my credits list. Apologies in advance! X_X\r\n\r\n************************************************************************************************************************\r\n\r\nHave fun with my house, and good luck with the cell buffer, so you can play the house lag free. =)\r\n\r\n\r\n************************************************************************************************************************\r\n\r\n[color=orange][b]PERMISSION NOTES:[/b][/color]\r\n\r\nFor permission notes use the readme.txt or use the nexus button!\r\n\r\n************************************************************************************************************************\r\n\r\n[color=orange][b]My Other Mods:[/b][/color]\r\n\r\nIf you\\'re interested in my other works, I\\'d be glad to see/read you on one of the following pages:\r\n\r\n[color=lightblue][b]- TheWinterhawks Black Wolf Lodge[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/14660\r\n--> An upper class/noble playerhouse with horse stables, dogs and a farm maiden npc\r\n\r\n[color=lightblue][b]- TheWinterhawks Hunter Saddle With Variants[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/22755\r\n--> 3 hunter saddle variants\r\n\r\n[color=lightblue][b]- No More Stupid Dog Comments[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/21225\r\n--> Stops NPCs from saying: \\\"Stupid Dog!\\\"\r\n\r\n[color=lightblue][b]- TheWinterhawks Hunting Dog Retex[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/21293\r\n--> 4 similar variants to choose from (replacer only)\r\n\r\n[color=lightblue][b]- TheWinterhawks Dog Retex - Spots[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/26360\r\n--> A white dog puppy with black spots (available as retex and standalone)\r\n\r\n[color=lightblue][b]- Ice Floes - Travel the Polar Sea Dry-Shod[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/26194\r\n--> No more swimming in half frozen water to get to several locations, incl. Serpent\\'s Stone\r\n\r\n[color=lightblue][b]- TheWinterhawks Romantic Hut - Lunds Hut Overhaul[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/28352\r\n--> Small lore-friendly player house for Dovahkiin and his love\r\n\r\n[color=lightblue][b]- TheWinterhawks Decently Recolored Whiterun - Retexture[/b][/color]\r\nhttp://skyrim.nexusmods.com/mods/28599/\r\n--> Gives Whiterun a warmer, more cultivated look",
  "categoryId": "67",
  "version": "v3.1",
  "author": "TheWinterhawk",
  "createdUnix": "1333886123",
  "updatedUnix": "1363037814",
  "containsAdultContent": false,
  "uploadedBy": "TheWinterhawk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51232",
      "name": "TheWinterhawks Black Wolf Lodge",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9953",
      "fileName": "TheWinterhawks Black Wolf Lodge-14660.rar",
      "uploadedUnix": "1333886501",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5ab01f80e46de79f2e0be9192dddfb4636614611a19e4f3cb927f5ef06f83051/analysis/1406803695/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TheWinterhawks%20Black%20Wolf%20Lodge-14660.rar?fid=51232&ttl=1535778446&ri=8192&rs=8192&setec=5a2698d265475add8c509fba92c6e33e"
    },
    {
      "fileId": "51276",
      "name": "Black Wolf Lodge without bsa DATA Directory only",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9313",
      "fileName": "Black Wolf Lodge without bsa DATA Directory only-14660.rar",
      "uploadedUnix": "1333897472",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/25c00d984389b1727199733c68a54a0cacdf7a6cd4fcb247ea707e40660aa6f1/analysis/1406804178/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Wolf%20Lodge%20without%20bsa%20DATA%20Directory%20only-14660.rar?fid=51276&ttl=1535778446&ri=8192&rs=8192&setec=16aee52bbb5db2435cb08dde0eabc5df"
    },
    {
      "fileId": "51283",
      "name": "Black Wolf Lodge v1_0 with BSA archive fixed",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5387",
      "fileName": "Black Wolf Lodge v1_0 with BSA archive fixed-14660.rar",
      "uploadedUnix": "1333899903",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/012951c41d028beaa1640ed7ce29226eadb53632b002ef2743ab7323a3698ce4/analysis/1406804184/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Wolf%20Lodge%20v1_0%20with%20BSA%20archive%20fixed-14660.rar?fid=51283&ttl=1535778446&ri=8192&rs=8192&setec=384480c4ecba261f44e1df07f06ea585"
    },
    {
      "fileId": "51336",
      "name": "QuestFix File for obtaining the key",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "QuestFix File for obtaining the key-14660.rar",
      "uploadedUnix": "1333908824",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d3bfdc9e383f5a443dfa09a4372f8817bf0d77ad2326effc43670a3dc4110e3c/analysis/1406804527/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/QuestFix%20File%20for%20obtaining%20the%20key-14660.rar?fid=51336&ttl=1535778447&ri=8192&rs=8192&setec=c9ddd1aaea228019f0e5675cab0a5791"
    },
    {
      "fileId": "51352",
      "name": "Black Wolf Lodge DATA Directory complete v1_1 without BSA",
      "version": "v1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9654",
      "fileName": "Black Wolf Lodge DATA Directory complete v1_1 without BSA-14660.rar",
      "uploadedUnix": "1333911097",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/842e8a98a51627de75aa95454fe68b3ab849aa770aa98545bd29cf3eb28c829d/analysis/1406804594/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Wolf%20Lodge%20DATA%20Directory%20complete%20v1_1%20without%20BSA-14660.rar?fid=51352&ttl=1535778447&ri=8192&rs=8192&setec=4d684c6874ae97397923ad3bdf4472c1"
    },
    {
      "fileId": "51445",
      "name": "Black Wolf Lodge v1_1 new BSA archive complete",
      "version": "v1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9947",
      "fileName": "Black Wolf Lodge v1_1 new BSA archive complete-14660.rar",
      "uploadedUnix": "1333927634",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/1056a679cf579c07cca2290c2320d7d039a39dc3deda0658aa3ae633797323fe/analysis/1406805159/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Wolf%20Lodge%20v1_1%20new%20BSA%20archive%20complete-14660.rar?fid=51445&ttl=1535778448&ri=8192&rs=8192&setec=cd9e5ef7482c804f90ede910df595f16"
    },
    {
      "fileId": "53452",
      "name": "Blackwolflodge v2_0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10373",
      "fileName": "Blackwolflodge v2_0-14660.rar",
      "uploadedUnix": "1334502116",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/c7fae6380e3cbe7d2816c878a34ec1fe04ec159d2ddf2e5c251e843d0d769d0c/analysis/1406817016/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blackwolflodge%20v2_0-14660.rar?fid=53452&ttl=1535778448&ri=8192&rs=8192&setec=fc9a8dee234feb5732013a3403de0f50"
    },
    {
      "fileId": "56276",
      "name": "Black Wolf Lodge v3_0  Before updating read description",
      "version": "v3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20187",
      "fileName": "Black Wolf Lodge v3_0  Before updating read description-14660.rar",
      "uploadedUnix": "1335388504",
      "modVersion": "v3.0",
      "virusScanUrl": "https://www.virustotal.com/file/dfb2adac656e866cc6e9fb809fb16c7a4391af923229ae5007d3a293fa8e33b1/analysis/1406840502/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Wolf%20Lodge%20v3_0%20%20Before%20updating%20read%20description-14660.rar?fid=56276&ttl=1535778449&ri=8192&rs=8192&setec=367a9686f4fc26ab30a3446ed59e606e"
    },
    {
      "fileId": "1000016792",
      "name": "Black Wolf Lodge v3_1 BSA archive",
      "version": "v3.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20222",
      "fileName": "Black Wolf Lodge v3_1 BSA archive-14660-v3-1.rar",
      "uploadedUnix": "1363037814",
      "modVersion": "v3.1",
      "virusScanUrl": "https://www.virustotal.com/file/daca72733077a10ef8d673ea5c70ebd781978cce882d17c75f9feaf1d350316b/analysis/1407465046/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Wolf%20Lodge%20v3_1%20BSA%20archive-14660-v3-1.rar?fid=1000016792&ttl=1535778449&ri=8192&rs=8192&setec=a9b66017179f4b0a834d816dada8e700"
    }
  ]
}