{
  "modId": 14679.0,
  "modName": "Your Farmhouse - Skyrim Architect",
  "summary": "What secrets await inside a seemingly perfect farmhouse situated outside Whiterun. A beautiful new player home with a classic Skyrim \\'rural feel\\', A lot of time has been put into this, so thanks to everyone who downloaded!",
  "descriptionHtml": "This is the first of many player houses I\\'ll be making for the nexus (hopefully), so any feedback/constructive criticism would be great! I am very new to the creation kit community but I wanted to give something back. I also have a youtube account to showcase my player homes so people can see what they\\'re getting! (video will be up for this one shortly). If you subscribe, you will be able to see whenever I have a new home out for download :P\r\nThe house is a small farmshack with homely features and a few utilities - if you\\'re one of the people who like god items in every chest then step away now. There are two weapon display cases, a few plaques, smithing/crafting tools, a cooking spit, and a chopping block. There is also a guard dog :D.\r\nThere may well be a secret area for the curious with a few more instruments in it!\r\nThe house can be found south of Whiterun, but there is a screenshot there for all the lazy people :P\r\n\r\n- SkyrimArchitect",
  "categoryId": "67",
  "version": "Version1",
  "author": "SkyrimArchitect",
  "createdUnix": "1333900655",
  "updatedUnix": "1333901099",
  "containsAdultContent": false,
  "uploadedBy": "IGNITEDBABYT14",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51288",
      "name": "Your Farmhouse - SkyrimArchitect",
      "version": "Version1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Your Farmhouse - SkyrimArchitect-14679-Version1.rar",
      "uploadedUnix": "1333901099",
      "modVersion": "Version1",
      "virusScanUrl": "https://www.virustotal.com/file/d64de828dae103801ef3b11e44a1681ad273279683914ec6828023cdeed370f9/analysis/1406804222/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Your%20Farmhouse%20-%20SkyrimArchitect-14679-Version1.rar?fid=51288&ttl=1535778475&ri=8192&rs=8192&setec=282fedc1040788185581c2b0f9425c12"
    }
  ]
}