{
  "modId": 14681.0,
  "modName": "Tomb of the Volkihar",
  "summary": "New player home, for your evil vampire/necromancer characters :) Little free form vampire hunting quest for those of you so inclined :)",
  "descriptionHtml": "\t=== Tomb of the Volkihar 1.0 ===\r\n\r\n\t\t\t\t\t\t\t==By Niallbob==\r\n\r\n==Description==\r\n---------------\r\n\r\nWelcome to my very first mod!\r\n\r\nI couldn\\'t find a mod on the nexus which could be my perfect vampire home :( This mod adds a semi-lore friendly vampire tomb, which can be used as\r\na player home, or for those of you who despise the undead, it can kick off a personal quest to hunt down the Volkihar vampires of Skyrim!\r\n\r\nUsed as a player home, it has a bedroom with storage chests and an alchemy/enchanting table, a prison, a torture room, pretty cool entrance hall/council chamber for the Volkihar \r\ncouncil with appropriate trap. Be careful how you enter the tomb! You\\'ll receive a note when you start which should point you in the direction of the tomb (if you cant work out where it\r\nis, there is a screenshot on the nexus).\r\n\r\nI have tried to personalise it as much as I could. It does look like an evil place to spend the day sleeping.\r\n\r\nAs this is my first mod and I dont know how popular it will be, I will not be updating it very regularly. It\\'s quite simple to personalise it on your own in the CK though :)\r\n\r\nThe vampire hunt quest is not a scripted quest, its a freeform quest that does not appear in your journal. It essentially adds a note to the vampire boss in the tomb,\r\nwhich will point you in the direction of the other Volkihar vampires in Skyrim.\r\n\r\n\r\n\r\n==Installation==\r\n\r\nExtract the .esp to your data folder or use the NMM.\r\n\r\n\r\n\r\n==Conflicts==\r\n\r\nAgain, as this is my first mod I cannot gaurantee no conflicts, although I cant see where there would be any. Other than the space the entrance takes up in the external world.\r\n\r\n\r\n\r\n==Permissions==\r\n\r\nYou can use this mod or parts of it for whatever you like. I only ask that you state me as the author of the original mod \r\nand let me know if your using it in your mod, so I can check and see how you\\'ve made it cooler :)\r\n\r\n\r\n\r\nThats all folks.\r\n\r\nNiall\r\n\r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "Niallbob",
  "createdUnix": "1333902032",
  "updatedUnix": "1333902102",
  "containsAdultContent": false,
  "uploadedBy": "Niallbob",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51294",
      "name": "Tomb of the Volkihar",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "80",
      "fileName": "Tomb of the Volkihar-14681-1-0.7z",
      "uploadedUnix": "1333902102",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/10c33e3db50bb26bffc2a975aa2a3a4b08fd1e31ecb2e58389f24f5b2c201194/analysis/1406804227/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tomb%20of%20the%20Volkihar-14681-1-0.7z?fid=51294&ttl=1535778478&ri=8192&rs=8192&setec=61de05665c0e2d1f942595ca77b73f7e"
    }
  ]
}