{
  "modId": 14695.0,
  "modName": "Lore-friendly light armor vanilla hoods-  Standalone",
  "summary": "I\\'ve loved the vanilla hoods, they go with a huge variety of armor, and wanted them to work with armor perks.  No one\\'s done it until now, I have no idea why.  You\\'ll find lots of hood resources, but I\\'ve done the work for you to make the vanilla hoods fit into your game too :)",
  "descriptionHtml": "Simply put, I\\'ve created three new items recognized by the game as light armor, based off of leather helmets to maintain lore friendliness.  \r\n\r\nThe models I\\'ve used are the Novice, Apprentice, and Adept hoods (tan, red, blue) from the vanilla game which I\\'ve altered to be viewed by the game as light leather armor.  They are standalone, made with vanilla materials, balanced to leather armor, and fully upgradeable.  They are immediately available to be crafted from any forge.\r\n\r\nYou can now wear circlets with these hoods!  Be warned, however, that the Dragon Priest masks are considered \\\"circlets\\\" and can be worn with these hoods now with some interesting clipping issues.\r\n\r\n--------\r\nVersion History\r\n\r\n1.00 - Original file\r\n1.0a - Circlets now wearable with hoods.\r\n\r\n--------\r\n\r\nNo possible conflicts unless using overhaul mods, these hoods are new items based on vanilla materials and have no perk requirements to construct.  If you find a conflict please let me know, but I really really doubt you will.\r\n\r\n--------\r\nInstallation:\r\n\r\nNMM :D   \r\n\r\nOr, if you prefer to do everything the hard way, simply extract the .7z to obtain the .ESP, and place that manually in your Data folder in Skyrim\\'s directory.  The location will vary for some people, but usually you\\'ll find it in C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim.\r\n\r\n--------\r\n\r\nShameless self-promotion;  My username is Bucky_Ohare on Reddit.com, I also happen to be a moderator for r/skyrimmods.  Our community enjoys showcasing good mods and I guarantee that if you spend some time with us, you\\'ll find something you never expected and suddenly be willing to kill to obtain :P  We also try to help with basic mod troubleshooting and finding good mods on request.  I highly recommend you stop by!\r\n\r\n--------\r\n\r\nThank you Bethesda, for managing to turn your image around from the Horse Armor DLC debacle into the pinnacle of light and a reason to believe in some game studios.  You\\'re the hero we hope to deserve.  \r\n\r\nThis mod is SKRYIMNEXUS exclusive.  I will not load/host to steam\\'s workshop (sorry Gabe.)  If you decide to use my material you must do two things;\r\n\r\nMention me, Bucky_Ohare, in a positive light.  Also, continue my shameless subreddit advertising.  ",
  "categoryId": "54",
  "version": "1.0a",
  "author": "Bucky_Ohare",
  "createdUnix": "1333908897",
  "updatedUnix": "1334787006",
  "containsAdultContent": false,
  "uploadedBy": "CAPTBuckyOhare",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51338",
      "name": "Reinforced Hoods",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Reinforced Hoods-14695.7z",
      "uploadedUnix": "1333909015",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/f9d382f60030afc2f66320ad0e0ed60c61b70e922c19547d672bb5a5cb5d8282/analysis/1406804527/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Reinforced%20Hoods-14695.7z?fid=51338&ttl=1535778507&ri=8192&rs=8192&setec=a1335d9fe6eb8efb4f6de7ed2267f5f3"
    },
    {
      "fileId": "54422",
      "name": "Reinforced Hoods 1a",
      "version": "1.0a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Reinforced Hoods 1a-14695-1-0a.7z",
      "uploadedUnix": "1334787006",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/f9d382f60030afc2f66320ad0e0ed60c61b70e922c19547d672bb5a5cb5d8282/analysis/1406822898/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Reinforced%20Hoods%201a-14695-1-0a.7z?fid=54422&ttl=1535778508&ri=8192&rs=8192&setec=0ce1d3d89967a408bfd5ebf23c9f2ada"
    }
  ]
}