{
  "modId": 14709.0,
  "modName": "Daedric Mage Armor by Natterforme",
  "summary": "This is a Nexus Exclusive. Adds a set of unique standalone armor intended for high level mage players. Let loose your inner Daedra&#33;",
  "descriptionHtml": "Name: Daedric Mage Armor by Natterforme\r<br /> Version: 1.5\r<br /> Date: 4/8/2012\r<br /> Category: Weapons and Armor\r<br /> Recommended: Skyrim Mod Manager\r<br /> Author(s): Natterforme\r<br /> Source: http://www.tesnexus.com/downloads/file.php?id=8440\r<br /> \r<br />Description\r<br /> ===========\r<br /> This is a Nexus Exclusive. Adds a set of unique standalone armor intended for high level mage players. Let loose your inner Daedra&#33;\r<br /> \r<br />Location\r<br /> ========\r<br /> The only way to obtain the armor at this time is through the Crafting forge with the Daedric smithing Perk. \r<br />Update: You can now obtain all versions of the armor from the crafting forge without the Daedric smithing perk at the cost of extra Daedra Hearts on each crafted piece. \r<br />\r<br />Details\r<br /> =======\r<br /> THIS IS A NEXUS EXCLUSIVE&#33; NO STEAM SUPPORT WILL BE OFFERED AT THIS TIME&#33; IF I FIND THAT THIS HAS BEEN UPLOADED TO STEAM WITHOUT MY PERMISSION I WILL NOT BE LENIENT TOWARDS THE UPLOADER(S). YOU HAVE BEEN WARNED&#33;&#33;&#33; \r<br />\r<br />It is highly recommended that you download and install Daedric Armor and weapon Improvement by Garryg. It is not required to use this mod but it is a high quality daedric armor retexture and is featured in my screenshots of this mod ingame. It is intended that this mod be played with it. You can also feel free to use a Daedric retexture of your choice. The armor retexture can be found here:\r<br /> \r<br />http://skyrim.nexusmods.com/downloads/file.php?id=3104&navtag=file/images.php?id=3104&tab=3\r<br />\r<br />It is also highly recommended that you incorporate Skyrim Extended Glow-Daedric Armor by Xanshio. It is a high quality glow map enhancer that can be used with any Daedric retexture mod and comes in a variety of colors&#33; It can only improve you experience using this mod and future updates of this mod will include screenshots using it&#33;^^ The mod can be found here:\r<br />\r<br />http://skyrim.nexusmods.com/mods/21570/?tab=2&navtag=/ajax/modimages/?user=0|:|id=21570\r<br />\r<br /> \r<br />This mod adds a Daedric Mage Cuirass, gloves, boots, and several hood options. This mod is intended for higher level mages or end game players. There are several types of cuirasses, two types of gloves and six hood options. All pieces come in the three armor types of nonarmor, light armor, and heavy armor. The non armor version has no armor rating but can use perks that benefit mages. It does not need a special perk to craft but it needs ebony ingots to prevent the player from getting the armor too early. The light armor version has the stats of ebony and requires the glass smithing perk to craft. The heavy version has the stats of Daedric and requires the relevant perk. There are two sets of gloves, one armored and one not. They are identical in terms of their stats and the only differences are cosmetic. There are six types of hoods: one that shows the face, one that does not, one that does not show the face with a pair of glowing eyes, a masked version that shows the face, a masked version that does not show the face, and a masked version that does not show the face with the eye glow. The cuirass comes in several varients: a version with pauldrons and bags, a version with pauldrons but no bags, a version with bags with no pauldrons, and a version with neither.\r<br />\r<br />This mod is usable by both genders.\r<br />\r<br />If you believe that the stats are too high then you can either increase your difficulty or manually change the stats yourself for your personal game. I wanted to make the crafting requirements higher too, since once you get near the end game you can pretty much afford anything you want.\r<br /> \r<br />Since I do not change the Daedric textures, this means that this mod is almost completely compatible with any Daedric Armor retexture mod. I say almost because not every retexture is red and black like my clothing on my mage armor.\r<br />\r<br />For a Russian translation of this mod, you can look here:\r<br />\r<br />http://modgames.net/load/249-1-0-10979\r<br />\r<br />For a Spanish translation of this mod you can look here:\r<br />\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=17591\r<br /> \r<br />\r<br />Install\r<br /> =======\r<br /> You can either download this mod with the Nexus mod manager or download the files and extract into the Skyrim data folder. Be sure to check the tick box in your data files section on the Skyrim launcher.\r<br /> \r<br />\r<br />Uninstall\r<br /> =========\r<br /> Either use Nexus Mod Manager to remove the files or manually remove them from you Skyrim/Data folder. \r<br />\r<br />Upgrade\r<br /> =======\r<br /> I plan to upgrade and improve this mod over time as I fix bugs, think of new ideas, become more adapted to the CK, and so on. Be sure to check back in once and awhile for updates. Be sure to completely uninstall any previous versions of this mod before upgrading though.\r<br /> \r<br />I will not take responsibility for corrupted save games or lost save games. Get into the habit of backing up your saves to protect your game data. Ignore at your own risk&#33;\r<br />\r<br />Incompatibility\r<br /> ===============\r<br /> I do not see why this mod would be incompatible with other mods but it is always a possibility. Anything that fundamentality changes the Journeyman mage clothes or Daedric Armor will probably be incompatible, since I rely on vanilla textures and normal maps where ever possible. The armor itself is completely standalone and does not replace any vanilla components.\r<br /> \r<br />Known Issues or Bugs\r<br /> ====================\r<br /> \r<br />-There is no masked hood option for Argonians and Khajiits. They looked really bad every time I tried it. This may or may not change in the future. You can still use masked hoods that do not show the head.\r<br />-Part of the glove mesh on the wrists does not show up properly, even though there is no reason for it. This is a problem on both genders. This can not be fixed because adding parts of the arm to the forearms of the daedric armor will cause unavoidable heavy clipping.\r<br />-Hoods that used to work for both Argonians and Khajits no longer work. There does not appear to be a reason for this. Headless versions continue to work however, and new glowing eye versions are compatible with beast races. Reverting back to previous versions and using those resources does not seem to work.\r<br /> \r<br />History\r<br /> =======\r<br /> \r<br /> 8/15/2012- Version 1.5\r<br /> -Removed the need of a black soul gem for temporing some pieces of the armor.\r<br /> -Renamed all items to make more sense. Items called ARMORED have been renamed to HEAVY ARMOR. The armor is divided based on its armor type and called NONARMOR, LIGHT ARMOR, and HEAVY ARMOR respectively. This includes Recipe and Temporing names to match.\r<br /> -Removed useless extra hood items for beast races and incorporated them properly into the appropriate system used for such items. This reduces inventory item clutter.\r<br /> -Renamed Gauntlets to Gloves.\r<br /> -Removed Alternate version of the armor. \r<br /> -There is no longer a need to have extra Daedra Hearts to craft the armor pieces. Each piece now only requires 1 heart.\r<br /> -Tweaked Recipes to be more consistant.\r<br /> -Light Armor version added. Stats are equal to Ebony. Requires glass smithing perk to craft. Other crafting materials are the same.\r<br /> -Tweaked stats of Heavy Armor version to have equivalent stats to Daedric in both weight and armor rating.\r<br /> -Added a set of the Non Armor version with the prefix TEST for mod testing use. Can not be upgraded or enchanted. Costs nothing to craft all pieces. This is more for my personal use than anything else.\r<br /> -NPCs will no longer believe that the player is naked.\r<br /> -Added an armored version of the gloves. Changes are purely cosmetic and are the same both in crafting requirements and stats as the original pair of gloves.\r<br /> -Added glow to armored version of gloves.\r<br /> -Added two new hoods. One is masked with no head with eyes that glow red. The other is the same but without the mask.\r<br /> -Added glow maps to the glowing eyes versions of the hoods.\r<br /> -Added a pauldroned version of the armor without bags.\r<br /> -Added a pauldronless version of the armor without bags. Referred to ingame as Spikeless.\r<br /> -Fixed some hidden clipping issues on the male and female models.\r<br /> -Fixed lighting issues on parts of the cuirasses.\r<br /> \r<br /> 6/14/2012- Version 1.4\r<br /> -Fixed issues causing clothing items to not take advantage of the Mage armor skill perk. Should now work properly.\r<br /> \r<br /> 4/23/12-Version 1.35\r<br /> -Fixed the issue causing the armor to not be able to take advantage of the Mage Armor skill perk. All clothing armors should now take advantage of the perk. Heavy armor versions still take advantage of the Heavy Armor perk and are unaffected by this change.\r<br /> \r<br />4/22/12-Version 1.3\r<br /> -Fixed an issue causing the normal version of the female armor to disappear when worn.\r<br /> -Fixed an issue causing the female version of the armor cause an immediate and guaranteed CTD when worn.\r<br /> -Resolved a problem where the normal version of the armor cuirass was not appearing in the crafting tables for the unarmored clothing version of the item set.\r<br /> \r<br />4/21/12-Version 1.25\r<br /> -Fixed the issue where wearing alternate gloves and gauntlets would cause your character to disappear. This has been fixed for all versions and all varients. You can now wear any gloves or gauntlets that you want without fear of interference or disappearing character bodies.\r<br /> -Removed unnecessary clothing duplicates that got on the mesh by accident on the male model.\r<br /> -More mesh reweighting to reduce clipping. This seems to never end :/.\r<br /> \r<br />4/20/12-Version 1.2\r<br /> -Added versions of the armor without spiked paundrons. This new version is is available for both genders and all races.\r<br /> -Added ARMORED and Alternate versions of the version without the spiked pauldrons.\r<br /> -Added all varients of the new version to the crafting and tempering tables.\r<br /> -Fixed more general mesh clipping all around.\r<br /> -Skirts are now in sync with itself and will not clip through the legs. This causes the tail end of the daedric cuirass to clip through them however.\r<br /> -Added more accessories to the belts to both versions of the armor and all of the varients. Also included are items such as scrolls and tube cases that I could not add before now because I did not know how add static meshes properly to armor meshes. \r<br />Accessories include:\r<br /> -additional pouches\r<br /> -scrolls and document cases\r<br /> -adjusted the positions of existing pouches and money bags\r<br />-Players &#39;should&#39; be able to use the unarmored versions of the mage armor to take advantage of the Mage Armor skill perk. I say should because I am not quite sure if the solution I came up with will fix the problem. Please let me know if the problem persists, so that I can try to find the correct solution.\r<br />-Mesh weight adjustments to reduce stretching.\r<br />\r<br /> 4/12/2012-Version 1.15\r<br /> \r<br />-Fixed problem causing the male and female cuirass to not appear at all when worn.\r<br /> -Fixed (hopefully) an issue causing the boots to have a heavy specularity, giving them a plastic appearance.\r<br /> -Added an ALTERNATE method of crafting the armor pieces. The pieces can now be crafted immediately without the Daedric Smithing Perk. This method requires, however, 5 Daedric Hearts per armor piece to be crafted. This makes some of the pieces not worth their base materials item cost. I believe that this is fair though, since it isnt requiring that mage characters need to spend perk points to obtain the armor through the first method. Since daedric hearts are not as valuable as perk points and are more readily available and more numerous, I think that this is a fair compromise. It is also easier than having a Master level condition in either Conjuration or Destruction, which is what I considered doing. This other method was rejected because I understand that not all mages use Conjuration or Destruction to max it out and it would result in the same situation of requiring players to have Daedric Smithing. The standard method of having the Daedric smithing perk still is an available option for heavy fighters or battle mages who have focused on smithing on all pieces.\r<br /> \r<br />4/12/2012- Version 1.1\r<br /> -Fixed the issue causing the human female maskless hoods to not appear properly. They have been removed and replaced with a working model.\r<br /> -Reweighted parts of the male meshes to remove clipping between the belt and sash with the daedric body underneath when straffing left or right.\r<br /> -Cut part of the daedric mage armor on the legs to eliminate clipping with the boot meshes. Should not affect most boots and shoe options that cover up to the knee area.\r<br /> -Fixed an issue that was causing the mage skirt to be see through. Mesh should now be double sided on affected skirts.\r<br /> -Moved parts of the meshes to reduce clipping areas around the chest.\r<br /> -Reweighted some items to not deform on the body either while moving or at idle anymore. This most readily affects chest straps.\r<br /> -Price of the Mage boots on both versions have been increased to be worth more than the cost of their components.\r<br /> -ARMORED versions of the mage armor now cost +1 Ebony Ingot more to craft on each piece than their unarmored counterparts.\r<br /> -ARMORED versions of the mage armor pieces now require +1 filled Black Soul Gems in order to temper at the workbench crafting station. To be clear, daedric mage armor pieces now require a filled black soul gem in addition to an ebony ingot in order to improve its status.\r<br /> \r<br />4/8/2012- Version 1.05\r<br /> -Added an armor version of every armor piece with Heavy Armor stats. Near Daedric stats.\r<br /> -Non armored version are considered clothing and have no armor rating. Same as before.\r<br /> -All armored versions of the armor pieces are both craftable and temperable.\r<br /> -Armored versions can be Identified by an ARMORED tag before their name ingame and at the end of their ID tag in the CK. Crafting and temporing recipes use identical naming conventions.\r<br /> \r<br />4/8/2012- Version 1.0 Initial Release\r<br /> \r<br />Contact\r<br /> =======\r<br /> You can find me on the Nexus Forums here as Natterforme.\r<br /> \r<br />Credits\r<br /> =======\r<br /> -Thank you to Xanshio for giving me permission to use his resources which, when modified, gave the really cool glowing eye look to two of the maskes^^.\r<br /> -A big thank you to Omesean and Korodic for their extensive advice and beta testing.\r<br /> -Credits to Garryg for his Daedric armor retexture, which gives this mage armor so much more life than its vanilla counterpart.\r<br />-Thanks to jakethesoup64 for his mod review video&#33;\r<br /> -A big thank you to Brodual for featuring this armor mod in their Skyrim Mod Spotlight Review video&#33;\r<br /> -Thank you Eriko for translating my mod into Russian&#33;\r<br /> -Thank you Obla for translating my mod into Spanish&#33;\r<br /> -Thanks to Bethesda for creating Skyrim.\r<br /> -Thanks to SkyrimNexus.com for the a one-stop-shop resource for authors and players.\r<br /> -Thanks to LHammonds for the Readme Generator this file was based on.\r<br /> -Thanks to all of you who have encouraged me and have supported this armor mod since I first put up screenshots of it back in December 2011 and January 2012.\r<br /> -I thank you all for your patience with me^^.\r<br /> -Thanks to God for creating us all. Amen.\r<br /> \r<br />Tools Used\r<br />==========\r<br />7-Zip - http://www.tesnexus.com/downloads/file.php?id=15579\r<br />Blender - http://www.tesnexus.com/downloads/file.php?id=12248\r<br />NIFSkope - http://niftools.sourceforge.net/wiki/NifSkope\r<br />Oblivion Mod Manager - http://www.tesnexus.com/downloads/file.php?id=2097\r<br />Paint.NET - http://www.tesnexus.com/downloads/file.php?id=11909\r<br />Photoshop - http://www.adobe.com/products/photoshop/\r<br />Readme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r<br />\r<br /> Licensing/Legal\r<br /> ===============\r<br /> This is a Skyrim Nexus Exclusive.\r<br />\r<br /> You MUST contact me before you do anything with this mod in any form for any reason. This includes language translations. I will NOT be providing Steam Workshop support at this time. I do not feel comfortable with their legal policies towards modding so I will not use it. I will not support or endorse its use at this time. If I want it to be on Steam, I will do so myself. If you see this on Steam, LET ME KNOW&#33; I will not support any version of this mod found on Steam. I will not accept any childish excuse about &#34;sharing&#34; with the community. If you refuse to respect my wishes, I can not, in good faith, respect yours.\r<br />\r<br /> -Natterforme\r<br /> ",
  "categoryId": "54",
  "version": "1.5",
  "author": "Natterforme",
  "createdUnix": "1333924891",
  "updatedUnix": "1345067513",
  "containsAdultContent": false,
  "uploadedBy": "Natterforme",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51430",
      "name": "Initial Release Version 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4270",
      "fileName": "Initial Release Version 1_0-14709.zip",
      "uploadedUnix": "1333924948",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3b305dd86b8ea8d7a3ccd4fb4f0d49c67f6818a56b28c59fec8e8a3f0e38bd0c/analysis/1406805130/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Initial%20Release%20Version%201_0-14709.zip?fid=51430&ttl=1535778523&ri=8192&rs=8192&setec=0310c4d7bb9df44483bad2240ea955cc"
    },
    {
      "fileId": "51525",
      "name": "Daedric Mage Armor Version1_05",
      "version": "1.05",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4271",
      "fileName": "Daedric Mage Armor Version1_05-14709.zip",
      "uploadedUnix": "1333947921",
      "modVersion": "1.05",
      "virusScanUrl": "https://www.virustotal.com/file/777ae44ec86dc7387c11588b23ab7fc93433490025b2b1e15fc1aa7d3d6d681b/analysis/1406805512/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Mage%20Armor%20Version1_05-14709.zip?fid=51525&ttl=1535778523&ri=8192&rs=8192&setec=7b699d7ce982639802008efb86e0edf0"
    },
    {
      "fileId": "52514",
      "name": "Daedric Mage Armor ver1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4258",
      "fileName": "Daedric Mage Armor ver1_1-14709.zip",
      "uploadedUnix": "1334210001",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ff36f9a013cffa2a867ffb745a82997d0b210d429ebf3db0202e01050515dca2/analysis/1406811263/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Mage%20Armor%20ver1_1-14709.zip?fid=52514&ttl=1535778525&ri=8192&rs=8192&setec=4451af21496751e99410036acce014a9"
    },
    {
      "fileId": "52755",
      "name": "Daedric Mage Armor Version 1_15",
      "version": "1.15",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4259",
      "fileName": "Daedric Mage Armor Version 1_15-14709.zip",
      "uploadedUnix": "1334291594",
      "modVersion": "1.15",
      "virusScanUrl": "https://www.virustotal.com/file/7e774f59e764360799636f94858e5ff773e9561b33bcfaae1d74313b6387b066/analysis/1406812857/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Mage%20Armor%20Version%201_15-14709.zip?fid=52755&ttl=1535778525&ri=8192&rs=8192&setec=2b17a7314dd22fd897012bc35459c954"
    },
    {
      "fileId": "54974",
      "name": "Daedric Mage Armor ver1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5689",
      "fileName": "Daedric Mage Armor ver1_2-14709.zip",
      "uploadedUnix": "1334981815",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/4b99db40d20cc3bc08c3ba2b367833e9665ad09de10665e1b552183ba42d6c63/analysis/1406826186/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Mage%20Armor%20ver1_2-14709.zip?fid=54974&ttl=1535778526&ri=8192&rs=8192&setec=d1f5c7e84261b81dc2839a34875b1884"
    },
    {
      "fileId": "55201",
      "name": "Daedric Mage Armor ver1_25",
      "version": "1.25",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5687",
      "fileName": "Daedric Mage Armor ver1_25-14709.zip",
      "uploadedUnix": "1335044197",
      "modVersion": "1.25",
      "virusScanUrl": "https://www.virustotal.com/file/0a92a5f4d072374ca2b00dd125b6d0a58d690e4a1b22b3d3db7e35feebe86548/analysis/1406827386/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Mage%20Armor%20ver1_25-14709.zip?fid=55201&ttl=1535778526&ri=8192&rs=8192&setec=2ab52e70bad2a4ec37b308656a51a662"
    },
    {
      "fileId": "55519",
      "name": "Daedric Mage Armor ver1_3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5642",
      "fileName": "Daedric Mage Armor ver1_3-14709.zip",
      "uploadedUnix": "1335144386",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/cd5a476c9395774dfa47fd1fb1ec13da3fea5335de8cf299bd1730e9b0fdf779/analysis/1406829582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Mage%20Armor%20ver1_3-14709.zip?fid=55519&ttl=1535778527&ri=8192&rs=8192&setec=fb29a5e6ced1c416031d38a834c55794"
    },
    {
      "fileId": "55727",
      "name": "Daedric Mage Armor ver1_35",
      "version": "1.35",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5643",
      "fileName": "Daedric Mage Armor ver1_35-14709-1-35.zip",
      "uploadedUnix": "1335207500",
      "modVersion": "1.35",
      "virusScanUrl": "https://www.virustotal.com/file/3dd20c771e93dfcb145c9d231365f6a2a07a93e17e9873a579d85d52d1dede1b/analysis/1406831903/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Mage%20Armor%20ver1_35-14709-1-35.zip?fid=55727&ttl=1535778527&ri=8192&rs=8192&setec=fb0f21de275976dfeecc5fca06f2a295"
    },
    {
      "fileId": "67974",
      "name": "Daedric Mage Armor ver1_4",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5643",
      "fileName": "Daedric Mage Armor ver1_4-14709-1-4.zip",
      "uploadedUnix": "1339696903",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/22a840d81fe1de30f6c9e6caaffe060a6d46941301fbe49cf947342318894b93/analysis/1406958966/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Mage%20Armor%20ver1_4-14709-1-4.zip?fid=67974&ttl=1535778528&ri=8192&rs=8192&setec=c9f2cf845ae090f317425727d2d5c6ee"
    },
    {
      "fileId": "81891",
      "name": "Daedric Mage Armor Version 1_5",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8138",
      "fileName": "Daedric Mage Armor Ver1_5-14709-1-5.zip",
      "uploadedUnix": "1345067513",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/4dce54002fdf7d9fe564ca762d49164ab6b598f51c83fa7a08ab338cb448341b/analysis/1407099726/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Mage%20Armor%20Ver1_5-14709-1-5.zip?fid=81891&ttl=1535778528&ri=8192&rs=8192&setec=c9532cb5eb41ee4b2a58d33a75b71693"
    }
  ]
}