{
  "modId": 14727.0,
  "modName": "Skyrim 40000 - Weapons Pack",
  "summary": "17 weapons from the Warhammer 40,000 universe in Skyrim (2 Ranged, 15 melee)",
  "descriptionHtml": "17 weapons from the Warhammer 40,000 universe in Skyrim\r<br />\r<br />2 Ranged - Bolt Pistol & Plasma Pistol\r<br />---Now raise Archery skill, and have scaling damage linked to current Archery rank\r<br />---Bonus damage for stealth shots (Sneaking + undetected - make that first shot count)\r<br />---Exploding projectiles\r<br />---Bolt rounds cause impact & stagger\r<br />---Single shots more effective then auto-fire\r<br />\r<br />15 melee weapons - \r<br />The Thunderhammer(1h), a larger, longer Demonhammer(2h), Hellblade(2h), Scaris Claymore(2h), Crozius(1h), Chaos Blade(long 1h dagger), PowerSword(1h) and Chaos Power Sword(1h), Chaos Warhammer(1h), Chaos Waraxe(1h), Chaos Chainaxe(1h, unanimated), Nemesis Falchion(1h), and a Halberd(long 1h spear) join the excellent animated Chainswords(1h, Chaos and Imperial) --- (The Powersword has been replaced, and that model is now used for the Nemesis Falchion, which fits the shape and colors better.)\r<br />\r<br />---More to come---\r<br />\r<br /># Made at Forge, under Misc, for gold, no perks needed\r<br /># Can be dual wielded, except Demonhammer, Hellblade, and Scaris Claymore\r<br /># Kill moves work normally, even ranged ones\r<br /># Unenchanted\r<br /># Effects added by script (pistols only so far)\r<br /># Bolt pistol bolt is too fast to see, this is not an accident\r<br /># Items are scaled for use with a 1.2 scaled actor\r<br />\r<br />-Stats subject to change and balancing, ongoing\r<br />\r<br />-The armors in the pics are of two of the incredible new textures created by reschu0\r<br />\r<br />--------------------------------------------------\r<br />Main mod file - http://skyrim.nexusmods.com/downloads/file.php?id=13506\r<br />--------------------------------------------------\r<br />Chaos armor pack - http://skyrim.nexusmods.com/downloads/file.php?id=15592\r<br />--------------------------------------------------\r<br />\r<br />--------------------------------------------------\r<br />Known issues:\r<br />No blood effects\r<br />Default textures, will be upgraded over time\r<br />The huge value on the pistols is a result of the enchantment, not the value in CK\r<br />Pistols are held at an angle, and look odd in 3rd person - This is due to being tied to the staff animations. I can make them look &#39;normal&#39; in 3rd, but then they point at the feet to shoot - so they have been optimized for 1st person aiming/view until new animations can be created\r<br />---------------------------------------------------\r<br />\r<br />***********************************************************************************\r<br />I did not create these meshes or textures, I have only compiled and further edited them with permission from the creators. \r<br />\r<br />Acey/Pirate has granted the use of his awesome animated Dwemer Autoblade, now modified and included\r<br />\r<br />The Thunderhammer and Demonhammer models were originally created by ghosu, from the Nexus. These models are my modifications to the longer-handled &#39;Slightly Oversized&#39; version created by Mx-T. Used with permission from both artists.\r<br />\r<br />The Chaos Blade is an excellent dagger model posted by BlutKult as a resource, and the texture is my modification of the very helpful blank texture provided.\r<br />\r<br />The Nemesis Falchion is the Phantom Sword Model by KrimeMinister, posted as a resource, provided proper credit was given and the mesh was not altered. The texture I pieced together using the very helpful blank layout he provided.\r<br />\r<br />The Crozius is made from the hilt of the Insanity&#39;s Empire Longsword, used with permission, and the handle of the Steel Warhammer, by Bethesda\r<br />\r<br />Several of the new items are from the 40k collection for Fallout 3 by roland3710, used with permission. Additional credits to the contributing artist below:\r<br />\r<br />The Bolt and Plasma Pistol models were created by Obiwan, and converted to Fallout by EdCase (Textures by reschu0 & sounds by fuyuki359)\r<br />\r<br />The Chaos Powersword, Waraxe, Warhammer, and Hellblade are the Pegasus weapons by Gorgonzola3000 \r<br />\r<br />The Chaos Chainaxe is from the Daemon assets by Zenl\r<br />\r<br />The Scaris Claymore is the Arkey&#39;s Valor by m_arts and Usher \r<br />\r<br />The new halberd is the Etna&#39;s spear by Nick Cureton \r<br />\r<br />The Powersword is the Tesla Sword model by The SH0CKER\r<br />\r<br />My thanks to Kmikaz3 for posting the code samples I modified in order to apply the stagger effect, and the proper scaling + advancement of the Archery skill. The syntax and proper placement were key to making this work.\r<br />\r<br />My sincere gratitude to Bethesda for Fallout, Skyrim, the Creation Kit, and Elder Scrolls - To Games-Workshop for my nearly life-long addiction to Warhammer 40,000 and To Valve, for Steam and the Steam Workshop, which got me into this. This is a mod for a retail game, made from assets I do not own, as all mods are. This is a free, publicly available mod, and will never be sold or profited from. I intend no infringement upon the rights of the companies who&#39;s assets are used here, and will of course comply with their wishes.\r<br />***********************************************************************************\r<br />\r<br />Scripters rejoice&#33; - A new set of training videos has been made by richardbmiller2 that finally gives comprehensive details on Object-Oriented Papyrus scripting - this is paid-training level information, and I am learning a LOT :)\r<br />http://www.youtube.com/richardbmiller2\r<br />\r<br />Want to learn to model? A very helpful start-to-finish series is available from ghosu\r<br />(German and English versions available)\r<br />http://www.youtube.com/user/LeckerHamster\r<br />\r<br />This web site is completely unofficial and in no way endorsed by Games Workshop Limited and all associated marks, names, races, race insignia, characters, vehicles, locations, units, illustrations and images from the Warhammer 40,000 universe are either ®, TM and/or © Copyright Games Workshop Ltd 2000-2012, variably registered in the UK and other countries around the world. Used without permission. No challenge to their status intended. All Rights Reserved to their respective owners. (&lt;- Official required disclaimer wording for completely UNOFFICIAL mod use)\r<br />\r<br />v1.4.1 - Minor update to add improved pistol textures by reschu0, and correct Chaos Blade into dagger class",
  "categoryId": "55",
  "version": "1.4.1",
  "author": "TheycallmeQ",
  "createdUnix": "1333939848",
  "updatedUnix": "1336332910",
  "containsAdultContent": false,
  "uploadedBy": "BlueFreakQ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "56782",
      "name": "Skyrim 40000 - Weapons Pack 1_4",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "57644",
      "fileName": "Skyrim 40000 - Weapons Pack 1_4-14727.rar",
      "uploadedUnix": "1335539985",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/76c06961172c604171214f37e2762d47f71bf96bd404074c709c7a29563ac452/analysis/1406843601/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%2040000%20-%20Weapons%20Pack%201_4-14727.rar?fid=56782&ttl=1535778556&ri=8192&rs=8192&setec=1cf3c9a5f335a8e758f3633de7b09719"
    },
    {
      "fileId": "59306",
      "name": "Skyrim 40000 - Weapons Pack",
      "version": "1.4.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "58397",
      "fileName": "Skyrim 40000 - Weapons Pack-14727-1-4-1.rar",
      "uploadedUnix": "1336332910",
      "modVersion": "1.4.1",
      "virusScanUrl": "https://www.virustotal.com/file/e984e1fb92f0780e4617fc55d1e75efb43a3a40b24c64ddad203b76868f974fd/analysis/1406873058/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%2040000%20-%20Weapons%20Pack-14727-1-4-1.rar?fid=59306&ttl=1535778556&ri=8192&rs=8192&setec=2eda1d032dfa402313424008125f4c4c"
    }
  ]
}