{
  "modId": 14758.0,
  "modName": "Draconic Dictionary",
  "summary": "Three lore friendly books: a draconic dictionary, a list of shouts with translations and a guide to all of the word walls in Skyrim.",
  "descriptionHtml": "&#34;Words of the Dov&#34; is a lore friendly draconic dictionary containing every known draconic word in the Elder Scrolls universe and a translation of the draconic script. Sources include the Prima &#34;Official Game Guide,&#34; The Unofficial Elder Scrolls Pages (http://www.uesp.net/wiki/Lore:Draconic_Language), and the in-game book &#34;Dragon Language: Myth No More.&#34; I made it for a mod I&#39;m working on, but thought I&#39;d share it.\r<br />\r<br />The title page (pictured above) translates to &#34;ROT DO FAAL DOV. NAAL JUN FAAL KRIL,&#34; or &#34;Words of the Dragonkind, by King Olaf the Brave.&#34;\r<br />\r<br />&#34;Words of Power&#34; contains all but one of the Thu&#39;um and their translations. Dragonrend has been omitted to keep it lore-friendly.\r<br />\r<br />&#34;Word Walls&#34; is a guide to every word wall in Skyrim with translations of each. They are listed by location: this is imperfect because most locations can have more than one wall message, depending on what words the player character already knows. For example,  the wall at Angarvunde could have any of three different messages containing one of the three words in Animal Allegiance. For the sake of immersion, the in-game author of the book would not have listed multiple walls in one location, so I simply assigned each wall to a location in the order they are printed in the Prima Official Guide. So if you go to Angarvunde, you could find the wall containing the word &#34;Raan,&#34; which is the one &#34;Word Walls&#34; places there, but if you already know &#34;Raan,&#34; you will actually find the wall containing &#34;Mir&#34; or &#34;Tah&#34; instead.\r<br />\r<br />This plugin places all three books in High Hrothgar on the altar full of candles just inside the front doors. \r<br />\r<br />Installation: Use Nexus Mod Manager or install manually. \r<br />\r<br />Manual Installation: Extract the 7-zip file and drop the Data folder into Computer/Program Files(x86)/Steam/Steamapps/Common/Skyrim.\r<br />\r<br />Update 2.0: Added &#34;Word Walls,&#34; by General Talos. All three books are included in one file.\r<br />\r<br />Update 1.1: Mined Paarthurnax&#39;s dialogue for more words and added them. Added 3rd file, &#34;Words of Power,&#34; which contains both &#34;Words of the Dov&#34; and a new book, &#34;Rotmulaag,&#34; by Paarthurnax, that lists all of the shouts except Dragonrend (to keep it lore friendly).\r<br />\r<br />Only download this file from the Skyrim Nexus&#33; If you find/found it anywhere else, I didn&#39;t put it there and can&#39;t guarantee the quality of its contents. Please do not upload this mod to other sites. If you wish to use it as a resource in your own mod, feel free to do so; no need to ask for my permission. I only ask that you credit me.\r<br />\r<br />If you would like to translate this mod into another language, you may, but please contact me so I can link to your alternate language version, and please link to this file as well.\r<br />\r<br />Thank you, and enjoy&#33;\r<br />\r<br />Wolfgang",
  "categoryId": "27",
  "version": "2.0",
  "author": "Wolfgang",
  "createdUnix": "1333980242",
  "updatedUnix": "1338446706",
  "containsAdultContent": false,
  "uploadedBy": "Lysanias",
  "primaryFile": null,
  "files": [
    {
      "fileId": "64743",
      "name": "Words",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Words-14758-2-0.7z",
      "uploadedUnix": "1338446706",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/a377b5daa7f624d83505283b490f1b9ecb569cbd76c393a4bb890e1dc5fc7a2e/analysis/1406927103/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Words-14758-2-0.7z?fid=64743&ttl=1535778622&ri=8192&rs=8192&setec=ebe4776ec821eb36d160c2d1596a4530"
    }
  ]
}