{
  "modId": 14784.0,
  "modName": "Breezehome basement with testinghall - all items",
  "summary": "This mod greatly improves breezehome in whiterun by adding a small detailed basement which is also a testinghall - in other words, has every item in the game, and more cut items, sorted and catagorised for you. Whenever you want you can just go into your basement and pick up any in game item at your disposal....",
  "descriptionHtml": "This mod greatly improves boring old breezehome by adding a detailed basement to it.... which, in fact, has every item in the game sorted and catagorised for you, for easy access!! Yes, any item you need, right at your disposal in your private basement!!!! Also please note that these screenshots are very bad quality, the textures look very poor in these photos but the in game graphics and textures look completely fine and normal - even better if you have the \\'\\'high resolution texture pack\\'\\' mod. \r\n\r\nHave you ever wanted a random item, that you couldn\\'t pick up before?\r\nHave you ever misplaced or lost an item that you valued and couldn\\'t get it back?\r\nHave you ever needed a random piece of rare loot for a small quest?\r\nHave you ever seen an in-game item and didn\\'t know how to obtain it?\r\nHave you ever wanted to add to your personal collection of things quickly?\r\nHave you ever wanted the best spells, scrolls, potions, weapons, and armor without all the effort?\r\nHave you ever wandered what items Bethesda made, and removed from the game - didn\\'t make the cut?\r\n\r\nFIND ALL OF THEM AND MORE - HERE, IN YOUR PRIVATE TESTINGHALL IN YOUR BREEZEHOME BASEMENT!!\r\n\r\nCredits: Project Grotto @ The Grotto Team\r\nLead Designer: Rex Jones - http://www.steamcommunity.com/id/GrottoRex\r\nLead Producer: Jack Geraghty - http://www.steamcommunity.com/id/GrottoJack\r\n\r\nTHANK YOU FOR YOUR SUPPORT",
  "categoryId": "67",
  "version": "1.000",
  "author": "Rex Jones",
  "createdUnix": "1333998620",
  "updatedUnix": "1333998620",
  "containsAdultContent": false,
  "uploadedBy": "rexjones",
  "primaryFile": null,
  "files": []
}