{
  "modId": 14794.0,
  "modName": "Crafting - Create Steel from Iron Ingots",
  "summary": "Adds recipes to smelt a steel ingot from an iron ingot plus either coal or charcoal, and to craft charcoal from firewood.",
  "descriptionHtml": "Have you ever been annoyed that you can create a steel ingot from iron ore, but you can\\'t create steel from an iron ingot?   Especially since that\\'s the way blacksmiths do it in the real world?  Well, now you can!\r\n\r\nThis mod adds recipes to smelt a steel ingot from an iron ingot plus either coal or charcoal, and to craft 3 charcoal from a firewood.   If you have the basic smithing skill, you can create a steel ingot from only 1 iron ingot; without any skill, you create a steel ingot from 2 iron ingots.\r\n\r\nCompatibility:  Since this mod only adds new recipes, it is compatible with everything.   If there is another mod that has a recipe for creating steel from iron ingots, you will simply see two recipes; there will be no conflict between them.\r\n\r\nInstallation:  Standard.  Either use NMM, or simply add the esp to your Data/ folder and enable it.  Load order is unimportant.\r\n\r\nUninstall:  Either remove or de-activate Crafting-CreateSteelFromIronIngots.esp from your Data/ folder.  There should be no issues of savegame incompatibility.\r\n\r\nDesign notes:  In the real world, blacksmiths normally create steel from iron ingots, rather than directly from iron ore, and there is no loss of metal in the process.  Likewise, medieval smiths normally used charcoal rather than coal for fuel and carbon, as charcoal can be created from wood in any forest (charcoal burning was a serious medieval job), while coal mining is regional and didn\\'t really become major until the industrial revolution.   I assume that Bethesda chose to only allow steel to be created from iron ore rather than iron ingots to keep it rare, but that seems silly to me, as steel weapons and armor should be the norm among humans.\r\n\r\nCredits:  This mod was inspired by and is intended to complement Complete Crafting Overhaul (http://skyrim.nexusmods.com/downloads/file.php?id=8003), which contains recipes to create steel from iron ore and either coal or charcoal, and to create coal from firewood.  However, this mod can be used completely independently of CCO or any other crafting mod.\r\n\r\nScreenshot Notes:  I am using Valdacil\\'s Item Sorting (http://skyrim.nexusmods.com/downloads/file.php?id=4873), which is why the names are \\'Ingot: Steel\\' rather than \\'Steel Ingot\\', etc.\r\n\r\nPermissions:  Other modders should feel free to incorporate these recipes into their own mods, without seeking my permission.",
  "categoryId": "28",
  "version": "1.0",
  "author": "GalenZ",
  "createdUnix": "1334012022",
  "updatedUnix": "1334012169",
  "containsAdultContent": false,
  "uploadedBy": "GalenZ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51770",
      "name": "Crafting-MakeSteelFromIronIngots",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Crafting-MakeSteelFromIronIngots-14794-1-0.7z",
      "uploadedUnix": "1334012169",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8f196b9626faf79c88b61c791b96314a2166401db60a4c73d834d0642cc391f7/analysis/1406806624/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Crafting-MakeSteelFromIronIngots-14794-1-0.7z?fid=51770&ttl=1535778681&ri=8192&rs=8192&setec=d3e5d4035dfa89d73f9b985652efdf8c"
    }
  ]
}