{
  "modId": 14799.0,
  "modName": "Bilskirnir",
  "summary": "Bilskirnir is a player abode, and a true Nordic hall located in Rorikstead, overviewing the village and surrounding area.",
  "descriptionHtml": "This mod has been abandoned as I no longer have time to work on it. If anyone cares to continue development you are free to do whatever you want with it. I would&#39;ve liked to see it become more than it is, but I just don&#39;t have the time. Contact me if you&#39;re interested.\r<br />\r<br />******NOTE: ALWAYS READ CHANGE LOG BEFORE UPDATING******\r<br />\r<br />Note: I&#39;m looking for a seasoned modder who would be willing to take a look at my mod and help me fix this rendering issue I&#39;m experiencing. If anyone sees this and has a few minutes to spare just to take a look it, please message me or post in the discussion. Thanks.\r<br />\r<br />--------------\r<br />Description\r<br />--------------\r<br />Bilskirnir is a player abode, and a true Nordic hall located in Rorikstead, overviewing the village and surrounding area. Said once to have been the home of one of Ysgramor&#39;s greatest followers, Thor, a true hero of Skyrim, the hall now lies silent, almost forgotten, as no one has been able to gain access to the halls of Bilskirnir for centuries. Legend has it that only a true hero of Skyrim can open its doors, and the peoples of Rorikstead has long awaited the time where such a hero will once again grace the World with his or her presence. Are you that hero? If you can open the doors of Bilskirnir, its halls will be yours, and the peoples of Rorikstead will know the legends of old were true.\r<br />\r<br />The hall is built in the same style as Jorvaskr as the original owner was one of the first companions. The hall also had the Skyforge style forge built, but it did not receive the same legendary status as it is not touched by the Gods in the same manner.\r<br />\r<br />----------------\r<br />Change Log\r<br />----------------\r<br />Version 2.3\r<br />*Keep save game, and empty your mannequins and weapon plaques (not racks) prior to updating*\r<br />&bull;   Added Bilskirnir journal\r<br />&bull;   Modified mannequins and weapon plaques due to some bugs (make sure you remove your items from weapon plaques (not racks) and mannequins before updating&#33;)\r<br />&bull;   Redecorated some interior (Note: Due to the amount of redecoration I&#39;ve done it would be a good idea to keep a save from before you update so you can recover anything that may have gone missing)\r<br />&bull;   Added backyard and exterior clutter\r<br />&bull;   Added stables \r<br />\r<br />Version 2.2\r<br />&bull;   Fixed the &#39;locked empty chest&#39; bug*\r<br />* This bug caused several chest across Skyrim to take on the properties of empty Bilskirnir chests. In order to fix it I have replaced the offending chests in Bilskirnir with new safe ones. Be sure to empty your chests, save, exit, and then update. Not emptying your chests will cause you to lose whatever is stored in them.\r<br />\r<br />Version 2.1a\r<br />&bull;   Fixed the &#39;weird lights over Rorikstead&#39; bug.\r<br />\r<br />Version 2.1\r<br />&bull;   Adjusted interior navmesh\r<br />&bull;   Modified exterior pool and added clutter\r<br />&bull;   Added some interior clutter\r<br />\r<br />Version 2.0\r<br />&bull;   Added Navmesh\r<br />&bull;   Added exterior pool\r<br />\r<br />Version 1.2\r<br />&bull;   Added some interior decor\r<br />&bull;   Adjusted interior lighting\r<br />&bull;   Fixed upstairs weapon rack\r<br />\r<br />Version 1.1\r<br />&bull;   Added well to exterior\r<br />&bull;   Added chopping block to exterior\r<br />&bull;   Added pool to exterior\r<br />&bull;   Added trees to exterior\r<br />&bull;   Fixed weapon racks\r<br />\r<br />Version 1.0 released on 04/09/2012.\r<br />\r<br />--------------------\r<br />Author&#39;s Notes\r<br />--------------------\r<br />This is primarily a work for my own pleasure, designed to suit my needs and taste. It is a work in progress and will not be finished until I can&#39;t think of anything more to add. It is a labor of love, and I&#39;ll take all the time needed to make this a great player abode. I&#39;ll be more than happy to listen to any feedback, comments and suggestions posted here on the Nexus. I&#39;ll also consider any requests for adding/removing certain features or changes to design provided it&#39;s within my capabilities and suits my taste. Again, any assistance in trouble shooting is most welcome. This mod is currently in the first release version, and there are many things to come, which will all make Bilskirnir a great hall.\r<br />\r<br />\r<br />-----------------------\r<br />Current Features\r<br />-----------------------\r<br />Bilskirnir is laid out with a great hall, a kitchen, an armory, a dining hall, a crafting room, a man cave, a small office area and a sleeping area. It currently has basic features such as:\r<br />&bull;   Complete smithing area\r<br />&bull;   Chopping block\r<br />&bull;   Enchanting table\r<br />&bull;   Alchemy table\r<br />&bull;   Cooking spit\r<br />&bull;   Bed\r<br />&bull;   Weapon racks and plaques\r<br />&bull;   Mannequins\r<br />&bull;   Ambient music and light\r<br />&bull;   Outdoor seating are with pool and firepit\r<br />&bull;   Backyard with vegetable and flower garden\r<br />&bull;   Stables\r<br />\r<br />-------------------------------\r<br />Known Issues and Bugs\r<br />-------------------------------\r<br />People have experienced some issues in regards to certain parts of the exterior not being properly rendered, but I have as of yet been unable to determine what the cause is. Again, feedback in terms of how this can be solved is much appreciated. Currently the best work-around is to save and load the game, refreshing the objects and making them render properly.\r<br />\r<br />I was also made aware of this mod making a weird disconnect of some locations in the Windhelm barracks. I currently don&#39;t know what causes this, but I&#39;ll do some trouble shooting.\r<br />\r<br />Any bugs reported will be appreciated and I&#39;ll do my best to fix them immediately.\r<br />\r<br />-----------------\r<br />Future Plans\r<br />-----------------\r<br />&bull;   Activatable bookshelves\r<br />&bull;   Activatable display cases\r<br />&bull;   More work on the exterior\r<br />&bull;   More work on the interior\r<br />&bull;   Anything reasonable suggested by users \r<br />\r<br />---------------------\r<br />Install/Uninstall\r<br />---------------------\r<br />Copy Bilskirnir.esp to your Skyrim data folder, most likely C:&#92;Program Files (x86)&#92;Steam&#92;SteamApps&#92;common&#92;skyrim&#92;Data, either manually or using NMM or similar mod manager tool and make sure it’s activated in the launcher.\r<br />To uninstall, simply delete the .esp file.\r<br />\r<br />-------------------------------------------------------------\r<br />Disclaimer: Bilskirnir does NOT have 540 rooms.\r<br />-------------------------------------------------------------",
  "categoryId": "67",
  "version": "2.3",
  "author": "Phoss",
  "createdUnix": "1334016862",
  "updatedUnix": "1335717702",
  "containsAdultContent": false,
  "uploadedBy": "Phoss",
  "primaryFile": null,
  "files": [
    {
      "fileId": "55797",
      "name": "Bilskirnir v2_2",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "158",
      "fileName": "Bilskirnir v2_2-14799-2-2.zip",
      "uploadedUnix": "1335231510",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/bb9ca418fade3e0f245614d18d8792630c07248aeaf6d0bdfd4f3b71d6e10896/analysis/1406832976/",
      "changelogHtml": " Fixed the \\'locked empty chests\\' bug. Make sure you empty all your indoor chests before updating! <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bilskirnir%20v2_2-14799-2-2.zip?fid=55797&ttl=1535778689&ri=8192&rs=8192&setec=c7b9b0152af5f6fc5d13e9389790daab"
    },
    {
      "fileId": "57334",
      "name": "Bilskirnir v2_3",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "176",
      "fileName": "Bilskirnir v2_3-14799-2-3.7z",
      "uploadedUnix": "1335717702",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/aa729f36d30c10586395c31dc4a40a165d394df4154dc707b8cffd5393c8b780/analysis/1406854157/",
      "changelogHtml": " Added Bilskirnir journal <br/> \n Modified mannequins and weapon plaques due to some bugs (make sure you remove your items from weapon plaques (not racks) and mannequins before updating!) <br/> \n Redecorated some interior (Note: Due to the amount of redecoration I\\'ve done it would be a good idea to keep a save from before you update so you can recover anything that may have gone missing) <br/> \n Added backyard and exterior clutter <br/> \n Added stables <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bilskirnir%20v2_3-14799-2-3.7z?fid=57334&ttl=1535778689&ri=8192&rs=8192&setec=33bf35e33a640bb3202e846e9c829b3a"
    }
  ]
}