{
  "modId": 14796.0,
  "modName": "Paladin Spell Pack - Version 1_3_1",
  "summary": "The Paladin Spell Pack provides players with fourty-three new Restoration spells.\r\nThese spells will allow players more options for game play style choices in many situations.\r\n",
  "descriptionHtml": "[center][IMG]http://i43.tinypic.com/9saqvq.jpg[/IMG]\r\n[size=4][b]The Paladin Spell Pack provides players with fourty-three new Restoration spells.[/size][/b][/center]\r\n\r\n\r\n[size=3][b][u]Information[/size][/b][/u]\r\n\r\nThere are many different spells to Fortify Spellpower, Melee Damage, Attack Speed, Critical Chance, Stagger Chance, Armor, Resistance, and the three base stats, Health, Stamina, and Magicka. As well as new healing spells and new damaging spells in the style of the Restoration school. \r\n\r\nThe spells have all been added to the \\\"leveled item lists\\\". They will appear at appropriate vendors when you have the correct skill level in order to remain consistant with Skyrim\\'s default spell aquisition system. They can also appear as loot drops anywhere in the game.\r\n\r\nThese spells will allow players more options for game play style choices in many situations.\r\n\r\nThese spells have been balanced into the game by magicka cost, skill level, perks, and power to the best of my ability but may still need some finishing touches. Please feel free to voice your opinion in the comments section.\r\n\r\nThe spells provided are listed below with a short description.\r\n\r\n\r\n[size=3][b][u]Master Level Spells[/size][/b][/u]\r\n\r\nAegis ---- Fortifies the caster\\'s Block, Heavy Armor, Light Armor, and Damage Resistance by 25% for 60 sec (Perks: Mastery)\r\n\r\nDivine Resistance ---- Fortifies the caster\\'s resistance to Disease and Poison by 75% for 60 sec (Perks: Mastery)\r\n\r\nElemental Protection ---- Fortifies the caster\\'s resistance to Fire, Frost, and Shock by 60% for 60 sec (Perks: Mastery)\r\n\r\nFortify Health ---- Fortifies the caster\\'s Health by 100 points for 60 sec (Perks: Mastery)\r\n\r\nFortify Magicka ---- Fortifies the caster\\'s Magicka by 100 points for 60 sec (Perks: Mastery)\r\n\r\nFortify Stamina ---- Fortifies the caster\\'s Stamina by 100 points for 60 sec (Perks: Mastery)\r\n\r\nFortify Alteration Spellpower ---- Fortifies the power of the caster\\'s Alteration spells by 30% for 60 sec (Perks: Mastery)\r\n\r\nFortify Attack Speed ---- Fortifies the casters Attack Speed with melee weapons and Draw Speed with bows by 30% for 60 seconds. (Perks: Mastery)\r\n\r\nFortify Conjuration Spellpower ---- Fortifies the power of the caster\\'s Conjuration spells by 30% for 60 sec (Perks: Mastery)\r\n\r\nFortify Critical Chance ---- Fortifies the caster\\'s Critical Hit chance by 25% for 60 sec (Perks: Mastery)\r\n\r\nFortify Destruction Spellpower ---- Fortifies the power of the caster\\'s Destruction spells by 30% for 60 sec (Perks: Mastery)\r\n\r\nFortify Illusion Spellpower ---- Fortifies the power of the caster\\'s Illusion spells by 30% for 60 sec (Perks: Mastery)\r\n\r\nFortify Stagger Chance ---- Doubles the caster\\'s chance to stagger an opponent with Bows for 60 sec (Perks: Mastery)\r\n\r\nFortify Weapon Damage ---- Fortifies the caster\\'s One-Handed, Two-Handed, and Unarmed Damage by 30% for 60 sec. (Perks: Mastery)\r\n\r\nGreater Healing ---- Heals the caster for 20 points per second while channeled (Perks: Dual-Cast, Regeneration, Respite)\r\n\r\nRejuvenation ---- Regenerates 5 health and Stamina per second for 60 seconds (Perks: Dual-Cast, Regeneration)\r\n\r\nDivine Sanctuary ---- The caster becomes pure energy and is Invincible for 15 seconds but loses all Stamina. (Perks: Mastery)\r\n\r\nPrayer - Restores 20 Magicka per second for 30 seconds in exchange for equal Stamina (Perks: Mastery)\r\n\r\nDivine Light ---- Burns undead with the light of the Divines for 12 damage per sec for 20 sec (Perks: Dual-Cast, Mastery)\r\n\r\nDivine Word ---- Divine power staggers the target momentarily (Perks : Mastery)\r\n\r\nEpidemic ---- Drives targets within a 40 foot radius insane with sickens. Causing them to attack at random and take 4 damage per second for 15 seconds (Perks: Dual-Cast, Mastery)\r\n\r\nSacred Ground ---- Turns the area into Sacred Ground causing 60 damage to all undead in a 40 foot radius (Perks: Dual-Cast, Mastery)\r\n\r\nDivine Smite ---- Smites undead targets causing 120 damage when struck. Causes half damage to living targets. (Perks: Dual-Cast, Mastery)\r\n\r\nDivine Aura ---- Causes 15 damage per second to undead targets in melee range for 20 seconds (Perks: Dual-Cast, Mastery)\r\n\r\nBanish Undead ---- Sends target Undead back to Oblivion (Perks: Mastery)\r\n\r\nGreater Lay on Hands ---- Causes 40 damage per second to undead on touch while channeled. Causes half damage to living targets (Perks: Dual-Cast, Mastery)\r\n\r\n\r\n[size=3][b][u]Expert Level Spells[/size][/b][/u]\r\n\r\nDivine Word ---- Divine power staggers the target momentarily (Perks: Expert)\r\n\r\nDispel Other ---- Removes all positive and negative magical effects from the target (Perk: Expert)\r\n\r\n\r\n[size=3][b][u]Adept Level Spells[/size][/b][/u]\r\n\r\nResist Disease ---- Fortifies the caster\\'s resistance to Disease 35% for 45 sec (Perks: Adept)\r\n\r\nResist Poison ---- Fortifies the caster\\'s resistance to Poison 35% for 45 sec (Perks: Adept)\r\n\r\nResist Fire ---- Fortifies the caster\\'s resistance to Fire 35% for 45 sec (Perks: Adept)\r\n\r\nResist Frost---- Fortifies the caster\\'s resistance to Frost 35% for 45 sec (Perks: Adept)\r\n\r\nResist Shock ---- Fortifies the caster\\'s resistance to Shock 35% for 45 sec (Perks: Adept)\r\n\r\nLesser Fortify Health ---- Fortifies the caster\\'s Health by 50 points for 45 sec (Perks: Adept)\r\n\r\nLesser Fortify Magicka ---- Fortifies the caster\\'s Magicka by 50 points for 45 sec (Perks: Adept)\r\n\r\nLesser Fortify Stamina ---- Fortifies the caster\\'s Stamina by 50 points for 45 sec (Perks: Adept)\r\n\r\nLesser Rejuvenation ---- Regenerates 3 health and Stamina per second for 45 seconds (Perks: Dual-Cast, Regeneration)\r\n\r\nLesser Divine Light ---- Burns undead with the light of the Divines for 8 damage per sec for 15 seconds (Perks: Dual-Cast, Adept)\r\n\r\nLay on Hands ---- Causes 20 damage per second to undead on touch while channeled. Causes half damage to living targets (Perks: Dual-Cast, Adept)\r\n\r\nLesser Sacred Ground ---- Turns the area into Sacred Ground causing 30 damage to all undead in a 40 foot radius (Perks: Dual-Cast, Adept)\r\n\r\nSmite ---- Smites undead targets causing 80 damage when struck. Causes half damage to living targets (Perks: Dual-Cast, Adept)\r\n\r\n\r\n[size=3][b][u]Apprentice Level Spells[/size][/b][/u]\r\n\r\nDispel ---- Removes all positive and negative magical effects from the caster (Perk: Apprentice)\r\n\r\n\r\n[size=3][b][u]Novice Level Spells[/size][/b][/u]\r\n\r\nLesser Lay on Hands ---- Causes 10 damage per second to undead on touch while channeled. Causes half damage to living targets (Perks: Dual-Cast, Novice)\r\n\r\nLesser Smite ---- Smites undead targets causing 30 damage when struck. Causes half damage to living targets (Perks: Dual-Cast, Novice)\r\n\r\n\r\n[size=3][b][u]Install Information[/size][/b][/u]\r\n\r\nDownload and install using the Nexus Mod Manager\r\n\r\nor\r\n\r\nDownload and extract the .7zip archive. Place the .esp file into the /Data folder of your Skyrim directory. Place the RajResTeleportSCR.pex file into /Data/Scripts and the RajResTeleportSCR.psc file into /Data/Scripts/Source in your Skyrim directory.\r\n\r\n\r\n[size=3][b][u]Version Information[/size][/b][/u]\r\n\r\n1.1 - Added the spelltomes to the leveled item lists so they will appear on appropriate vendors and as drops from creatures and chests at Expert level Restoration (75) and above. They appear to be working from the testing I have been able to do myself but please report any issues. I also fixed the problem with the sound FX of Greater Healing.\r\n\r\n1.2 - Adjusted the cost of the spelltomes to be more like the ones in the game. Added Novice, apprentice, Adept, and Expert level spells, and changed some of the damaging spells to do half damage to living targets. Reduced the magicka cost of Rejuvenation. Added all new items to vendor and loot lists. Renamed some spells to reflect their power (\\\"Smite\\\" at the Master Level is now \\\"Divine Smite\\\" for example). This was a lot of new additions and I can only test so much myself. Please report any bugs.\r\n\r\n1.3 - Incresed the damage of all three levels of the \\'Smite\\' spell and both versions of the \\'Divine Light\\' Spell. Reduced the effect of Elemetal protection to 60%. Reduced the effect of \\'Fortify Weapon Speed\\' to 30%. Removed the Paralizing effect from the \\'Prayer\\' spell and  incresed it\\'s casting time to keep it balanced. Made all three versions of \\'Smite\\' a slow moving projectile instead of a touch spell. Made \\'Divine Word\\' a projectile instead of a touch spell. Added one new spell \\'Divine Sanctuary\\'.  Removed cheat chest from behind the Bannered Mare. Please report any bugs.\r\n\r\n1.3.1 - Resolved an issue that was causing CTDs for players without Dawnguard installed. \r\n\r\n[u]Other Notes[/u]\r\nNo longer supported. I do not plan to purchase Hearthfire due to a personal distaste for the product and so cannot mod with the new content. This mod should still work with unexpanded Skyrim (and Dawnguard if noted as such). Sorry for any inconvenience but with this game being almost a year old I feel it\\'s time to move on to newer modding horizons. Thank you to everyone who downloaded and enjoyed my Skyrim mods. I hope to see you all again in other mod workshops. Best wishes!",
  "categoryId": "75",
  "version": "1.3.1",
  "author": "KahjiitRaj",
  "createdUnix": "1334012728",
  "updatedUnix": "1346281289",
  "containsAdultContent": false,
  "uploadedBy": "KahjiitRaj",
  "primaryFile": null,
  "files": [
    {
      "fileId": "56340",
      "name": "Paladin Spell Pack -OLD 1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18",
      "fileName": "Paladin Spell Pack-14796.7z",
      "uploadedUnix": "1335401394",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2203c853ef90defc76a3b3033d2c0727ff83be621cbe824e509decadf0669acb/analysis/1406840882/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Paladin%20Spell%20Pack-14796.7z?fid=56340&ttl=1535778684&ri=8192&rs=8192&setec=b4e34f1252dfbc5c8f1df6c4ffd61e86"
    },
    {
      "fileId": "84921",
      "name": "Paladin Spell Pack 1_3",
      "version": "1.3",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "20",
      "fileName": "Paladin Spell Pack 1_3-14796-1-3.7z",
      "uploadedUnix": "1346193325",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/9a87e511dfc958939e54612fdfc868fca36cf43ba9b0e4eefed83ba412e27fd3/analysis/1407128882/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Paladin%20Spell%20Pack%201_3-14796-1-3.7z?fid=84921&ttl=1535778684&ri=8192&rs=8192&setec=1111399b001ef65257fbe099d7910329"
    },
    {
      "fileId": "85179",
      "name": "Paladin Spell Pack 1_3_1",
      "version": "1.3.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19",
      "fileName": "Paladin Spell Pack 1_3_1-14796-1-3-1.7z",
      "uploadedUnix": "1346281289",
      "modVersion": "1.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/5a1cfc1c01d3dfa33bcced57d9e583ccab40475f03987eca9c0bd60b768268a9/analysis/1407131705/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Paladin%20Spell%20Pack%201_3_1-14796-1-3-1.7z?fid=85179&ttl=1535778685&ri=8192&rs=8192&setec=53dccd2c469db4ae899cd48eeaea96ff"
    }
  ]
}