{
  "modId": 14826.0,
  "modName": "Custom Songs for Playable Instruments - Two musicians",
  "summary": "Remix of the original pieces played by the bards in Skyrim so that it sounds as if two musicians play together. Can be used to let Dovahkiin play music with his compagnion.",
  "descriptionHtml": "==========\r\nDescription\r\n==========\r\nThe download contains sound files that can be used as custom songs for the great mod  \\\"Playable Instruments - Play and Bash\\\" by planexuser (see http://skyrim.nexusmods.com/downloads/file.php?id=9375 ).\r\nThe remix sounds as if two musicians play together the pieces usually played solo by the bards in Skyrim. You can use them if You want to let Your Dovahkiin play music together with one compagnion. There are different combinations of two instruments (lute, flute, drum) in 21 instrumentals. Also included are 4 songs accompanied by drums (female singer, only in GERMAN).\r\n\r\n[youtube]eS-x58bVjoM[/youtube]\r\n\r\nExtended version: http://www.youtube.com/watch?v=KYTZ2CLcLjk\r\n\r\nI\\'m not a musician so be mild when judging my work ;)\r\n\r\n=========\r\nInstruction\r\n=========\r\nDon\\'t install the mod with the nexus mod manager!\r\n- \\\"Playable Instruments - Play and Bash\\\" by planexuser (see http://skyrim.nexusmods.com/downloads/file.php?id=9375 ) has to be installed.\r\n- Choose the songs You like by listening to the mp3-files in the \\\"Samples\\\" folder and note their names\r\n- Rename the equivalent xwm-files in the \\\"XWM\\\" folder to \\'BardVoiceCustom01.xwm\\', \\'BardVoiceCustom02.xwm\\',... (for maximum number of custom songs see instructions for \\\"Playable Instruments\\\"!)\r\n- Place the renamed files under the folder:\r\n<YourSkyrim>\\\\Data\\\\Sound\\\\Fx\\\\Mus\\\\Bard\\\\PlayableInstrumentsCustom\\\\\r\n- To prepare a custom song in the game equip Dovahkiin and the compagnion with the playable instruments that fit to the custom song You want them to perform. Make sure that the compagnion only has one playable instrument otherwise it will be random which one will be used. The compagnion should be standing and in idle mode when the songs starts to join the performance as a band member.\r\n- To start the perfomance if the custom song follow the instructions for \\\"Playable Instruments\\\":\r\n\r\n\\\"You can start singing by reading songbooks.\r\n1. Open your songbook that you are going to sing <for custom songs choose the Enigmatic Songbook which has the same volume number that you gave to the xwm-file>\r\n2. Wait few seconds. Message appears in upper-left corner of your screen.\r\n3. Close your inventory. The song will start.\\\"\r\n\r\n\r\n--------\r\nCredits:\r\n\\\"Playable Instruments - Play and Bash\\\" by planexuser\r\nBethesda for the music pieces\r\nAudacity (remixing)\r\nMultiXwm by Vikichan (conversion)",
  "categoryId": "61",
  "version": "1.0",
  "author": "oblivix",
  "createdUnix": "1334047459",
  "updatedUnix": "1334048023",
  "containsAdultContent": false,
  "uploadedBy": "oblivix",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51878",
      "name": " Custom Songs for Playable Instruments - Two musicians",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22343",
      "fileName": " Custom Songs for Playable Instruments - Two musicians-14826.rar",
      "uploadedUnix": "1334048023",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/b766789416e8938d49b11267cb921b46f0b55228bfe17871f6f374736eff1379/analysis/1406807118/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/%20Custom%20Songs%20for%20Playable%20Instruments%20-%20Two%20musicians-14826.rar?fid=51878&ttl=1535778735&ri=8192&rs=8192&setec=ab8beed2f0059d08255923a0c7bb591e"
    }
  ]
}