{
  "modId": 14824.0,
  "modName": "Better Elven Armor and Elven Gilded Armor",
  "summary": "Overhauls the HD elven armor textures, and adds an entire new set for elven gilded armor, including new textures.",
  "descriptionHtml": "This mod is also available on [url=http://steamcommunity.com/sharedfiles/filedetails/?id=21648]Steam Workshop[/url]\r\n\r\nDo you love the look of Elven Armor but wish it looked a bit less dark and grimy (especially if you have the High Res Texture Pack installed)? Perhaps you\\'d even like your Elven Gilded Armor to actually look... gilded?\r\nIf so, then this mod is the answer to your wishes!\r\n\r\n=================\r\nWhat this Mod Does:\r\n=================\r\n\r\nFor unknown reasons, the Elven Armor textures in the official High Res Texture Pack were a lot darker than the original textures, which is particularly noticeable on the gauntlets and boots.\r\n\r\nI began making this mod with the simple intention to adjust the new High Res textures to more closely match the color, lightness and contrast of the original textures, but somewhere in this process I decided to fix another issue relating to the Elven Armor set: the Elven Gilded Armor.\r\n\r\nElven Gilded Armor is an armor that feels out of place amidst the other types of armor, which is perhaps because it was never properly implemented as intended: in the Skyrim.esm (Elder Scrolls Master) file, there can be found references to a full set of elven gilded armor, so it seems that at some stage this armor set was either forgotten or deliberately pushed to the wayside, and only a single piece of the set managed to make it into the finished game.\r\n\r\nThis mod adds a full set of Elven Gilded Armor that can be crafted at the smithing forge, including Helmet, Boots, Gauntlets, Armor & Shield.\r\nElven Gilded Armor offers slightly more protection than regular Elven Armor, being half-way between the Elven and Glass armor sets, and identical to the Scaled armor set in terms of the protection it offers.\r\nEach piece of Elven Gilded Armor requires roughly the same materials to craft as regular Elven Armor plus 1-2 Gold Ingots, and it can also be improved at the Smithing Armor Bench using Gold Ingots. As a result of the Gold used in its creation, Elven Gilded Armor weighs slightly more than regular Elven Armor (but still less than Scaled or Glass armor), and accordingly fetches a higher sale price than Elven Armor.\r\nElven Gilded Armor also distinguishes itself visually, living up to its name in that it shines like highly polished gold!\r\n\r\nFull sets of Elven Gilded Armor can be found being worn by Thalmor troops from levels 24-35, and may be purchased from Niranye, the dunmer merchant in the marketplace near the blacksmiths in the city of Windhelm, from level 24+. Blacksmiths will also have a chance of carrying gold bars in their merchant inventory from level 18+.",
  "categoryId": "54",
  "version": "1.0",
  "author": "QuickFox",
  "createdUnix": "1334046552",
  "updatedUnix": "1334046839",
  "containsAdultContent": false,
  "uploadedBy": "QuickFox",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51872",
      "name": "Elven Gilded Armor v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8508",
      "fileName": "Elven Gilded Armor v1-14824-1-0.7z",
      "uploadedUnix": "1334046839",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/982759d2180778fff35b5c1e082f28e33cc68b3b8d958e715b3de06d88a4a90a/analysis/1406807110/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elven%20Gilded%20Armor%20v1-14824-1-0.7z?fid=51872&ttl=1535778730&ri=8192&rs=8192&setec=e997605b9a1f628f21e6c009dbab34e6"
    }
  ]
}