{
  "modId": 14866.0,
  "modName": "Ninthnos Black-Grudge-Enemy-ValentineSisterStoryContinuation",
  "summary": "He needs to end the bloodline.",
  "descriptionHtml": "\tNOTE: This is a continuation of the Valentine Sister\\'s Story, if you haven\\'t read the first part, here is the link :D :\r\n\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=14307\r\n\r\nFOR FULL EXPERIENCE OF THIS MOD, PLEASE USE VALENTINE SISTERS MOD. :D\r\n******************************************************\r\n\r\nStory: He knew he would be the greatest of the Greybeards when he reports to the others about what Hrethon did. It was the only way for he knew he could not match the talent of Hrethon. His name was Ninthnos. He was even younger than Hrethon. He wanted to lead the Greybeards but he couldn\\'t for it was impossible if someone was greater than him.\r\n\r\nAtlast, Hrethon was banished because of the forbidden love. Ninthnos knew he can now establish himself as the head of the greybeards. Everything went well according to his plan until Paarthurnax had a vision. A vision that can destroy all he had worked for. Paarthurnax gathered the greybeards and told them of the vision. Paarthurnax said that they should prepare for the coming of the greatest greybeard that will lead all them and it would come from the line of Hrethon. Paarthurnax does not know when but he knew it would come. Ninthnos was stunned. He could not utter a single word. His soul was filled with anger. The next day no one saw Ninthnos, he suddenly disappeared for a day.\r\n\r\nNinthnos knew what to do, he had to kill Hrethon. He went down the seven thousand steps to Riverwood. He saw Hrethon fishing along the river. He could not kill him out in the open. He waited that night and sneaked inside the peaceful home. He saw Hrethon lying down with his wife Synthi. With a silent slash of an iron dagger, he killed Hrethon. Ninthnos left Synthi with her dead husband beside her. It was Ninthnos\\'s greatest mistake for Synthi was already pregnant with Belladayna. \r\n\r\nBelladayna grew without a father. She was told of stories about her father and how he was banished. She knew it was only Ninthnos who would do such murder. She wanted to avenge her father\\'s death. With the journals that was left of her father, she learned and tried to master the thu\\'ums. She trained and trained until she was almost as good as her father. She decided it was time to avenge Hrethon\\'s death.\r\n\r\nBelladayna went up the seven thousand steps to High Hrothgar and challenged Ninthnos to a duel. Ninthnos was shocked and realized that right infront of him was the daughter of Hrethon. Though lesser than Hrethon, Belladayna still defeated Ninthnos but could not kill him. Ninthnos fled from High Hrothgar. \r\n\r\nInto the woods Ninthnos ran. He knew it was impossible for him to become the leader of the Greybeards now, but he didnt stop there. When he fled into the woods, he was attracted to a witch who uses the illusion of beauty. He fell into the trap. The witch bore a son. Ninthnos took care of his son and he knew what he wanted for his son to be, the next leader of the Greybeards.\r\n\r\nHe could not deafeat Belladayna. He needed help. He asked help from the Daedric gods. With all the gifts he received from them he became unstoppable. It was time for him to end Hrethon\\'s bloodline. He went back to Riverwood. \r\n\r\nOdds was against him again for he found out through the neighbors that Belladayna died while giving birth to her third daughter. He went in Belladayna\\'s abandoned house and saw Hrethon\\'s journals and got it, so no one else will know the thu\\'ums. He set fire to house and left.\r\n\r\nHe mastered all the secrets of Hrethon\\'s thu\\'ums and became more powerful than he is already. Then one silent afternoon he asked himself the questions like, \\\"How will I find the children of Belladayna?\\\" \\\"I do not know their faces.\\\" \\\"How can the bloodline still produce a leader of the Greybeards when I have the journals?\\\" \\\"No one except the Greybeards can master the thu\\'ums now.\\\" Then it hit him. He now realized who he needed to find. \\\"There is none, except one. The Dragonborn.\\\"\r\n\r\n******************************************************\r\nLocation: Infront of Whiterun (Open field), Skyrim, Tamriel, Nirn, Mundos. (Not that specific still? XD Anyway the exact location is in the image. :D)\r\n******************************************************\r\n\r\nNinthnos Black-Grudge\r\n\r\n\\\"So I heard, the Dragonborn is in contact with the Companions...\\\"\r\n\r\nDescription:\r\n\r\nRace: Nord\r\nCombat Style: The way of the Thu\\'um\r\nLevel: 100\r\n\r\n(If you want a comparison, he is like a Greybeard, all greybeards are lvl 100, with Daedric artifacs as armor and weapon. XD Difficulty settings in your options should be used when you are low level or don\\'t if you are that badass. XD)\r\n\r\nHP: 2139 Magicka: 1050 Stamina: 1446\r\n\r\nInventory: (THIS IS WHY, YOU SHOULD KILL HIM :>)\r\n\r\nMasque of Clavicus Vile\r\nEbony Mail (Not Ebony Armor.)\r\nEbony Blade (Not Ebony Sword. This one looks like a katana.)\r\nMehrune\\'s Razor\r\nSkeleton Key\r\n25,000 Gold\r\nDaedric Gauntlets\r\nDaedric Boots\r\n\r\n**BUT HERE IS THE THING**\r\nSkills:\r\nFast Healing\r\nConjure Storm Antronach\r\nDisarm Shout\r\nUnrelenting Force Shout\r\nIce Form Shout\r\nFrost Breath Shout\r\nFire Breath Shout\r\nDismay Shout\r\n\r\n******************************************************\r\n\r\nNo other mods needed for this one. :)\r\n\r\nNOTE: He is not wearing the helmet in the pic because I used a No Helmet mod. :)\r\n\r\n******************************************************\r\n\r\nENJOY AND HAVE FUN!!! ;)\r\n",
  "categoryId": "33",
  "version": "1.1",
  "author": "Tomy",
  "createdUnix": "1334075238",
  "updatedUnix": "1334075491",
  "containsAdultContent": false,
  "uploadedBy": "AvGeek",
  "primaryFile": null,
  "files": [
    {
      "fileId": "51989",
      "name": "Ninthnos Black-Grudge",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Ninthnos Black-Grudge-14866-1.rar",
      "uploadedUnix": "1334075491",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d9aaacd2b5a7c0001cd50517df5f4d1051a4ee019c61b3e1bc3c3dbffa634f2c/analysis/1406807782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ninthnos%20Black-Grudge-14866-1.rar?fid=51989&ttl=1535778794&ri=8192&rs=8192&setec=2472ef6fa4904e3454fb25df9a6bca01"
    }
  ]
}