{
  "modId": 14868.0,
  "modName": "SCMP-Skyrim Community Mod Project",
  "summary": "Calling all modders! What will YOU do?",
  "descriptionHtml": "A project I started for my little brother (Mod fanatic) It started out as a simple gag, then grew into more. A normal human from a modern setting is hurled through reality, crashing into Tamriel. Campy, yes. Fun? Maybe. The real goal of this is that I would like to see more skilled modders unleash the true power of the Creation Kit.\r\n\r\nThe aforementioned goofiness is second to what I wish for this mod to be (why else would I upload it?) If you try it, and like it, I will continue to work on it. I tried my hardest to get the spells to be exiting and fun, but I need help tweaking and balancing them out.\r\n\r\nAll of the new items, spells, and concept pieces are on a set of corpses littered around the front entrance to Riverwood.\r\n\r\nSo far include\r\n-3 \\\"new\\\" spells (recycled CK effects)\r\n-1 new power\r\n-1 unique Silver Longsword\r\n- A new item \\\"Writ of Credit\\\" a sort of bond issued by the East Imperial Trading Company\r\n-1 Unique Katana\r\n- and a set of notes from the pretentious jackass who found himself in Tamriel without a clue of what to do.\r\n\r\n\r\nCheesy, I know. And Riverwood? Bah everyone dumps their mods there. Eventually I will spread them out, and add the Bonds to levelled lists, but for now, enjoy! \r\n\r\nTo intall, just dump the .esp into your data folder and activate using your choice of launcher.",
  "categoryId": "85",
  "version": "1.00",
  "author": "Maserbeam",
  "createdUnix": "1334077068",
  "updatedUnix": "1334077234",
  "containsAdultContent": false,
  "uploadedBy": "Maserbeam",
  "primaryFile": null,
  "files": [
    {
      "fileId": "52002",
      "name": "Base File for SCMP",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Base File for SCMP-14868-1-00.rar",
      "uploadedUnix": "1334077234",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/8db4f324eeba2a6d6830e16b2de53eaf67b6d634e52f1d368e21804ad2561b6a/analysis/1406807824/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Base%20File%20for%20SCMP-14868-1-00.rar?fid=52002&ttl=1535778796&ri=8192&rs=8192&setec=66c28c87f8a142702772b01463585956"
    }
  ]
}