{
  "modId": 14886.0,
  "modName": "Skyrim Total Immersion Guide",
  "summary": "A guide to getting the most immersive Skyrim possible ",
  "descriptionHtml": "Welcome to the Skyrim Total immersion guide\r\n\r\nIn this guide you will learn how to make your game as realistic and immersive as possible.\r\nI got the idea to make this after reading over STEP, but wanted to take it a bit farther.\r\nI added it here because I know a lot of people only visit the downloads section, and never the forums or such, but I will be adding this to the forums as well.\r\nDon\\'t forget to download all the dependencies for the mods, Script Dragon and SKSE are two I know you\\'l need.\r\n\r\nCredits go to all of the fantastic modders that made these wonderful mods. I\\'ve made none of them and I take credit only for making a list of them. Go endorse these mods to support their wonderful creators!\r\n\r\n\r\nUpdates:\r\n4/24 - Been busy at work so I\\'ve bound to miss a few good immersion mods, been trying to keep up. Added a few mods to the list and I may have removed a couple, hard to remember when I haven\\'t been home much in a week >_<\r\n\r\n4/16 - Fixed some grammar mistakes (I wrote it at 4am, sorry bout that ;) )\r\n\r\nAdded  mods:\r\nLight up the night - People Have Torches\r\nAlthirs enhanced companion and drivable carriage commands\r\nSpouse Life\r\nAnd many more!\r\n\r\nRemoved mods: SHARPE - Housecarls. Causes housecarls\\'s armour to vanish completely. Might work fine on its own, but with the mods in this guide, has errors.\r\n\r\nIt seems I forgot to add Hypothermia! That was one of the core files! I\\'ve updated it now.",
  "categoryId": "78",
  "version": "1.0",
  "author": "Hooker Heels",
  "createdUnix": "1334093876",
  "updatedUnix": "1335244697",
  "containsAdultContent": false,
  "uploadedBy": "HookerHeels",
  "primaryFile": null,
  "files": [
    {
      "fileId": "55850",
      "name": "STIG",
      "version": "1.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "124",
      "fileName": "STIG-14886-1-0-1.zip",
      "uploadedUnix": "1335244697",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/ba5be8a60750151799a3cf9fb05c388f6049606e4985abaa1c8805cfdbc7eb26/analysis/1406833395/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/STIG-14886-1-0-1.zip?fid=55850&ttl=1535778827&ri=8192&rs=8192&setec=15a20f5901769aa0c25ce44aee0acd03"
    }
  ]
}