{
  "modId": 14933.0,
  "modName": "Simple Teleport Magic",
  "summary": "This is a simple teleport magic that allows you to utilize \\\"Mark and Recall\\\" style teleport with multiple markable slots.",
  "descriptionHtml": "[b][size=7][color=dodgerblue]Simple Teleport Magic[/b][/size][/color]\r\n\r\n\r\n\r\n\r\n\r\n[b][size=5][color=lightskyblue]Description[/b][/size][/color]\r\n\r\nThis is a simple [b]\\\"Mark and Recall\\\"[/b] style teleport magic I created as a component for a different mod. I know there are many teleportaion magics out there in Nexus(I found it out after finishing the mod. lol). This might not be a greatest mod out there but I decided to upload it anyway since I spent a lot of time in this.\r\n\r\n\r\n\r\n[b][size=5][color=lightskyblue]What it does[/b][/size][/color]\r\n\r\nThis mod basically adds a teleport magic with different configurations you can do in-game. The magic is a \\\"Mark and Recall\\\" style which you set the detination beforehand and use the spell to teleport to pre-defined location.\r\n\r\nSome of the features are\r\n\r\n[list] [*]10 markable location slot \r\n\r\n[*]Return to original location \r\n\r\n[*]Autosave before/after teleportation \r\n\r\n[*]Teleport with followers(Theoratically [b][color=red]unlimited[/b][/color] number of followers) \r\n\r\n[*]View marked location with spell\r\n\r\n[*]View marked location on your map/compass and check the markers status if they\\'re enabled or disabled (Newly added feature)\r\n\r\n[*]Summon your followers to your location (Newly added feature)  [/list]\r\n\r\n\r\nOnce installed, the mod will place a stone near Breezehome, where you can purchase the spell. (Refer to picture for exact location)\r\n\r\n\r\n\r\n\r\n\r\n[b][size=5][color=lightskyblue]Spell List[/b][/size][/color]\r\n\r\n\r\n[img]http://skyrim.nexusmods.com/downloads/images/14933-1-1334688375.png[/img]\r\n\r\n[b][size=3][color=lightskyblue]Teleport Main Spell[/b][/size][/color]\r\n\r\nUnlike the previous version of the spell, now there is only one spell that can be used to Mark/Clear locations and Recall/Return to locations. This spell will also include 2 extra feature. One is Summon Followers, which will summon all of your current registered followers to your location. The other is the Show Marker, which will place bright orb of light at the marked location. Instead of being concentration spell, now it is a turn on/off spell which can be operated with the touch of a button. Now this spell introduces more limitations than previous version in order to discourage abuse of the spell. The spell will also now cost around 3000 golds depending on your level. \r\n\r\n[list][*]You can mark/clear up to 10 locations. No limit on where mark can be placed other than proximity of each other.\r\n\r\n[*]You can teleport to locations marked previously. \r\n\r\n[*]You can teleport back to your original location.\r\n\r\n[*]Your followers will teleport with you if you have enough Magicka for them.\r\n\r\n[*]You can summon your followers to your location.\r\n\r\n[*]You can view your marked location. The spell will place bright orb of light so you can see it from distance.\r\n\r\n[*]The spell will now provide experience in Alteration according to mana usage.\r\n\r\n[*]Spell now does not require Magicka to initiate. But if you do not have enough Magicka when you select Recall/Return or Summon option, you will not be able to execute the spell.\r\n\r\n[/list]\r\nSpellbook cost : 3000 (Purchased at the Setting Stone)\r\nMagicka cost : Recall - [80 + (10 X # of follower)],  Summon - [40 + (10 X # of follower)]   \r\nMagicka costs half with perk \\\"Alteration Adept\\\"\r\nSingle-hand spell\r\nSchool : Alteration\r\nRequired skill : Alteration 25\r\n\r\n\r\n\r\n\r\n\r\n[img]http://skyrim.nexusmods.com/downloads/images/14933-2-1334688377.png[/img]\r\n\r\n\r\n[b][size=3][color=lightskyblue]Register Follower spell (This spell stays unchanged)[/b][/size][/color]\r\n\r\nRegister Follower spell will allow you to register(mark) your followers so they can teleport with you. Cast this spell while pointing your crosshair at your follower you wish to register. If you have successfully registered your follower with this spell, a notification will show saying that follower will now follow your teleport. If you use this spell on a follower who is not currently following you, or any other person, it will say they are not following you and will not register them. If you dismiss a follower, they will not teleport with you even if they are registered with this spell. If you want to unregister any follower, just cast the spell again on them and it will unregister them from the spell, and will show a message saying they will not follow your teleport any longer. ([b][color=red]Note[/b][/color] : They have to be currently following you in order for them to unregister) This spell can (theoratically) register unlimited amount of followers.\r\n\r\nSpellbook cost : It is not acquirable from Farengar any longer. Please see Setting Stone section.\r\nMagicka cost : 5\r\nSingle-hand spell\r\nSchool : Alteration\r\nRequired skill : Alteration level 25\r\n\r\n\r\n\r\n\r\n[img]http://skyrim.nexusmods.com/downloads/images/14933-3-1334688377.png[/img]\r\n\r\n\r\n[b][size=3][color=lightskyblue]Setting spell[/b][/size][/color]\r\n\r\nAutoSave Setting spell is now replaced with Setting spell, which includes the AutoSave setting within itself. Setting and feature for AutoSave feature stays same as before. AutoSave\\'s default is still \\\"autosave before every teleportation\\\". Can be turned off or replaced with new saves instead. Setting spell now includes setting for Proximity limitation, as well as activation of the new feature \\\"Map Marker\\\". This spell also includes simple status report of your spell\\'s system. For detail, please see Setting Stone section.\r\n\r\nSpellbook cost : It is not acquirable from Farengar any longer. Please see Setting Stone section.\r\nMagicka cost : None\r\nLesser Power\r\nSchool : None\r\nRequired skill : None\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n[img]http://skyrim.nexusmods.com/downloads/images/14933-1-1334688640.jpg[/img]\r\n\r\n\r\n[b][size=5][color=lightskyblue]Setting Stone[/b][/size][/color]\r\n\r\nThe setting stone for this spell is located behind Breezehome in Whiterun, alongside the castle wall. Please refer to the picture if you\\'re having hard time finding it. This stone is basically the \\\"Command Center\\\" of the spell. You can add, remove spell as you see fit, or change settings of the spell. When you activate the stone for the first time, you\\'ll be asked to purchase the spell. When you\\'ve bought the spell, you\\'ll be given access to further feature of the spell. First, you\\'ll be given the choice to add or remove the 3 spells included in the mod. Which are\r\n\r\n[list][*]Teleport Main Spell - Used for Mark/Recall/Summon\r\n[*]Register Follower Spell - Used to register followers for teleportation\r\n[*]Setting Spell - Basically a portable version of the Setting Stone, only without add/remove spell function[/list]\r\n\r\nThere\\'s also a setting menu which you can change various setting of the spell. This setting menu can also be accessed with the Setting Spell, which can be acquired from this stone. Currently changeable settings are,\r\n\r\n[b][size=2][color=Dodgerblue]Proximity setting[/b][/size][/color]\r\nWhenever you place a mark on the location, you have a 1000 Game Unit(approaximately 20 feet) distance limit on how close the marks can be placed each other. Also, marker itself reserves the radius of distance of 400 Game Unit(approaximately 8 feet) from itself. Within this radius, you cannot teleport to the respective marker, but you can teleport back to original location. Which means, you can be within 1000 GU(Game Unit) away from the marker, and still be able to teleport to the marker you\\'re close by, although you won\\'t be able to place another marker there. And when you\\'re within 400 GU(Game Unit) range of the marker, you won\\'t be able to teleport to that marker, but instead, you\\'re allowed to teleport back to your original location. For easier understanding, I\\'ve included the diagram below.\r\n\r\n[img]http://skyrim.nexusmods.com/downloads/images/14933-1-1334683592.png[/img]\r\n\r\nBasically, you cannot mark new locations in [b][color=dodgerblue]blue circle[/b][/color]. And you cannot teleport to the respective marker within [b][color=red]red circle[/b][/color]. You can, however, teleport to another [b][color=red]red circle[/b][/color] from a [b][color=red]red circle[/b][/color]. You can ONLY teleport back to original location if you\\'re within [b][color=red]red circle[/b][/color].\r\n\r\nHowever, with the Proximity setting, this limit can be changed. Currently there is 2 options. \r\n\r\n[list][*]Marker placement limit can be switched between 1000 GU, and 2000 GU\r\n[*]Marker effective range can be switched between 400 GU, and 800 GU\r\n[*]Return teleport limit can be turned off to allow you to teleport to original location from anywhere in Skyrim[/list]\r\n\r\n\r\n[b][size=2][color=Dodgerblue]Map Marker Setting[/b][/size][/color]\r\n\r\nMap Marker can be activated here and then later be disabled, or enabled through this menu. Map Marker will activate a permenant quest to allow you to see which marker is placed where, and which marker is enabled/disabled by using quest objectives. In order to use this feature, first activate this feature through this menu, and activate/highlight the quest from your journal. And it will show all the currently placed marker on your map/compass. Within the quest description, it will also tell you which marker is enabled/disabled. Disabling this feature will remove all the quest objectives and quest from your journal and can be enabled again through this menu.\r\n\r\n\r\n[b][size=2][color=Dodgerblue]AutoSave Setting[/b][/size][/color]\r\n\r\nThe game can now be auto-saved before teleport, as well as after teleport. The default setting is set to auto-save before teleport(recall and return) is performed, will do nothing after teleport. The setting can be changed here to either save after teleport and don\\'t save before teleport, or save before teleport and don\\'t save after teleport. Or it could be set to save both before and after the teleport. You can either choose to create new save file each time teleport is performed, or just use auto-save.\r\n\r\n[b][size=2][color=Dodgerblue]Status Report[/b][/size][/color]\r\n\r\nThis menu will show you simple basic status report of the spell. \r\n[list][*]Currently enabled/disabled markers\r\n[*]Number followers registered with the spell\r\n[*]Current proximity limitation setting\r\n[*]AutoSave feature\\'s current setting[/list]\r\n\r\n\r\nAll of the features under \\\"Setting\\\" menu from Setting Stone, can also be accessed through \\\"Setting\\\" lesser power.\r\n\r\n\r\n\r\n\r\n\r\n\r\n[b][size=5][color=lightskyblue]Installation[/b][/size][/color]\r\n\r\nInstallation is very simple. You could either,\r\n\r\n[list] [*]Download with Nexus Mod Manager and activate them.\r\n\r\n[*]Download manually and add to Nexus Mod Manager, and then activate them.\r\n\r\n[*]Download manually, extract the files, and place both .bsa and .esp file in the Skyrim/Data/ folder manually and activate them on the launcher.\r\n\r\n[/list]\r\n[b][size=2][color=red]If you\\'re updating from 0.9 version, please follow instructions below instead.[/b][/size][/color]\r\n\r\nBecause of the major changes in spell system and its scripts, it is highly recommanded to have clean save file before you update the mod. This does [b][color=red]NOT[/b][/color] mean you need to start new game. All you need to do is,\r\n\r\n[list][*]Uninstall and remove the old version 0.9.\r\n[*]Run the game, load your save file. Ignore warning about \\\"missing contents\\\". You\\'ll be fine.\r\n[*]When the game loads, create new save file, and then exit the game.\r\n[*]Now install and activate the new version.\r\n[*]Load your new save file, and start playing. [/list]\r\n\r\n(You will need to purchase the spell again from the Setting Stone for 3000 golds if you\\'re updating from 0.9.)\r\n\r\n\r\n\r\n\r\n[b][size=5][color=lightskyblue]Compatibility[/b][/size][/color]\r\n\r\nCompatible with [url=http://skyrim.nexusmods.com/mods/14037]UFO - Ultimate Follower Overhaul[/url]\r\nCompatible with [url=http://skyrim.nexusmods.com/mods/26393]Vilja in Skyrim[/url]\r\n\r\nThere is some issues with Deus Mons, and Riverside Lodge. Please see Known Issues section.\r\n\r\nShould be compatible with any other mod. Please report if there is any compatibility issues.\r\n\r\n\r\n\r\n\r\n\r\n[b][size=5][color=lightskyblue]Known Issues[/b][/size][/color]\r\n\r\n[list][*]Apparently followers will teleport with you even when you did not register them with [b][color=silver]\\\"Register Follower\\\"[/b][/color] spell. I am unsure what\\'s causing this but they will appear at random entry point(door) in the cell(room, city, or dungeon) player has teleported to. When you register the followers with the spell though, they will work nicely and will appear right next to you instead of some random door of somebody\\'s house. \r\n\r\n[*]This spell can be very over powered depending on your use, and can possibly break your game or quest. So please use this responsively. I didn\\'t place any safety measures on purpose, so you can have maximum freedom with it. You can even place location marker in Pelagius\\' mind, or even Sovengarde and return there later on. The rule of thumb I would like to suggest you is that you don\\'t use this while in quest and/or dungeon, unless you\\'re absolutely sure you won\\'t break the game/quest and won\\'t miss anything.\r\n\r\n[*]Currently there is a CTD issues with Deus Mons(Living Room cell), and Riverside Lodge(Whole interior cell) when teleporting from their affected cells to city exterior(ex: Whiterun, Solitude). Other than this combination (Deus Mons living room -> City exterior, Riverside Lodge interior -> City exterior), it works nicely. Please keep in mind, this is the issue caused by the cells themselves, as this issue is persistant with every single teleportation mods out there.\r\n\r\n[*]-Solved- The spell is currently unaffected by Alteration skill or perks, and will not reduce the Magicka cost even if you have high Alteration skill level.\r\n\r\n[*]Please let me know if you find any.[/list]\r\n\r\n\r\n\r\n\r\n[b][size=5][color=lightskyblue]Change Log[/b][/size][/color]\r\n\r\n1.2 -\r\n\r\n[list][*]Fixed to work with companion Vilja. (Might work with DLC companion, have not tested.)\r\n[*]Added the option to disable teleport for followers. (May still be summoned with the option disabled)\r\n[*]Magicka cost of the spell can now be lowered to half if player has \\\"Alteration Adept\\\" perk.\r\n[*]Player can now track \\\"Original locaiton\\\" on the map by using map marker feature, like other markers.\r\n[/list]\r\n\r\n1.1 -\r\n\r\n[list][*]Game can now be auto-saved BEFORE teleport. Auto-save for after teleport still is possible, but now the default setting for auto-save after teleport is changed to \\\"No Action\\\", and auto-save before teleport is set to auto-save as default. Setting can be changed at Setting Stone or Setting Spell.\r\n[/list]\r\n\r\n1.0.1 -\r\n\r\n[list][*]Removed spell from Farengar and instead, made it purchasable from the Stone directly.\r\n[/list]\r\n\r\n1.0 - \r\n\r\n[list][*]Joined Mark/Clear, Recall/Return, Show Marker spell into a single spell with menu system.\r\n[*]Added new feature Map Marker, allowing you to see which marker is placed where.\r\n[*]Added new feature Summon Follower, allowing you to summon your registered followers to your location.\r\n[*]Added various setting options.\r\n[*]Added a Setting Stone, which can be used to change the setting of the spell.\r\n[*]Added Setting spell, which contains all the setting menus of Setting Stone. (Can be acquired from Setting Stone) \r\n[*]Spell now costs no Magicka to initiate, but will cost Magicka when Recall/Return/Summon command is initiated. \r\n[*]Spell now give proper experience to Alteration according to mana use of the spell.[/list]\r\n\r\n0.9 - \r\n\r\n[list][*]Initial release\r\n[/list]\r\n\r\n\r\n[b][size=5][color=lightskyblue]Credits[/b][/size][/color]\r\n\r\nBethesda for such an epic game and tool\r\n\r\nSpecial thanks to [url=http://skyrim.nexusmods.com/modules/members/index.php?id=229639]Benrahir[/url] for Beta testing and suggestions. Couldn\\'t have done it without him.\r\n\r\nAll of you guys using the mod. I hope you enjoy it. :)",
  "categoryId": "75",
  "version": "1.2",
  "author": "arinbell",
  "createdUnix": "1334161207",
  "updatedUnix": "1361441450",
  "containsAdultContent": false,
  "uploadedBy": "arinbell",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54042",
      "name": "Old file",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20",
      "fileName": "Old file-14933.7z",
      "uploadedUnix": "1334689719",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/505716f40756ae77b853b6634e4ba63b2e16773a8a115e4d0f7a8c78ba59d3e3/analysis/1406820428/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Old%20file-14933.7z?fid=54042&ttl=1535778915&ri=8192&rs=8192&setec=2006130930065df18c2defeadb46619d"
    },
    {
      "fileId": "54934",
      "name": "Old file",
      "version": "1.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "21",
      "fileName": "Main File-14933-1-0-1.7z",
      "uploadedUnix": "1334970306",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/074e64cd794e5a9f7578f6df44bd4eaca67df0fe29f356133c28c692121315ad/analysis/1406826021/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-14933-1-0-1.7z?fid=54934&ttl=1535778915&ri=8192&rs=8192&setec=85e26480ea9ae8774f589020b1fa3172"
    },
    {
      "fileId": "107006",
      "name": "Old file",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22",
      "fileName": "Main File-14933-1-1.7z",
      "uploadedUnix": "1356246457",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/52da0c0d080f259a6e61a88780c994bcdee30ffe4a3bb97fef0c569335e801bc/analysis/1407318631/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-14933-1-1.7z?fid=107006&ttl=1535778916&ri=8192&rs=8192&setec=8c73ba692c3183d721bf391e4ba56bd2"
    },
    {
      "fileId": "1000011767",
      "name": "Main File",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22",
      "fileName": "Main File-14933-1-2.7z",
      "uploadedUnix": "1361441450",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/40329864c42b96e995a2c9d65ff0ead262b6b18cbf76091e7fb1436bd8cf707f/analysis/1407430810/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-14933-1-2.7z?fid=1000011767&ttl=1535778916&ri=8192&rs=8192&setec=09544940bc4d3056b653c0d1f96775ab"
    }
  ]
}