{
  "modId": 14957.0,
  "modName": "Dovahouse - Breezehome Replacer",
  "summary": "A new player house to replace the default Breezehome property.",
  "descriptionHtml": "My second mod is my take on the \\\"Dovahouse\\\", a player house which in this case replaces Breezehome in Whiterun. The house requires no key, and contains a full blacksmithing suite, an alchemy lab and an enchanting table along with some storage and a bed.\r\n\r\nThere are one or two lighting issues, and the taxidermy bear has no physical geometry so you can pass right through it. The banner is prone to clipping too. If you spot any more issues please let me know, I\\'m still learning how to use the Creation Kit so I\\'m not really proficient yet, any pointers would be much appreciated.\r\n\r\nPlease endorse if you like it, check out my other mod too.\r\nConstruction comments are encouraged!\r\n______________________________________________________\r\n\r\nInstallation instructions:\r\n\r\nIf you use the Nexus Mod Manager just hit the \\\"download with manager\\\", let it download automatically then just double click the mod in the \\\"mod\\\" section to activate.\r\n\r\nor\r\n\r\nTo download and install manually, hit the manual download button, when you get the folder, unzip it to get to the plugin file inside, put that plugin file in your Skyrim Data folder. If you\\'re having trouble finding that folder it should in in Steam > steamapps > common > skyrim >data. Then when you start up Skyrim via Steam, hit the box for data files, scroll to find the mod and make sure a tick is next to the mod.",
  "categoryId": "67",
  "version": "1.0",
  "author": "harveyisbatman",
  "createdUnix": "1334182535",
  "updatedUnix": "1334182656",
  "containsAdultContent": false,
  "uploadedBy": "harveyisbatman",
  "primaryFile": null,
  "files": [
    {
      "fileId": "52425",
      "name": "My Nice House",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "My Nice House-14957-1.zip",
      "uploadedUnix": "1334182656",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a2153db352390b39e9aa2211bfed2f8fa6a5d3c0e551516a68964eb2513f7c4c/analysis/1406810535/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/My%20Nice%20House-14957-1.zip?fid=52425&ttl=1535778967&ri=8192&rs=8192&setec=a00b3a1e082373495e0df21d454b0521"
    }
  ]
}