{
  "modId": 14950.0,
  "modName": "Convenient Horses",
  "summary": "Horses for followers with scripted follower AI behavior and advanced features, mounted combat for followers, horse armor, mounted combat horse charge, dynamic faction relations, cinematic horse call, horse whistle, mounted conversations and herb gathering, horse inventory, fast dismount and much more. Maximum compatibility. Powered by SKSE.",
  "descriptionHtml": "[heading][color=Red][b]IMPORTANT: Before uninstalling the mod disable it via console (StopQuest CH) or scripts will remain in your save&#33;[/b][/color]\r<br />[color=Orange][b]WARNING: It is your responsibility not to leave horses in Solstheim, Soul Cairn, Blackreach or near fort Dawnguard as horses cannot pass through zoning points by themselves.[/b][/color][/heading]\r<br />[img]http://static-6.nexusmods.com/15/images/110/621184-1336864338.jpg[/img]\r<br />[url=http://skyrim.nexusmods.com/mods/26704][img]http://static-2.nexusmods.com/15/images/110/621184-1353430987.jpg[/img][/url]\r<br />[url=http://skyrim.nexusmods.com/mods/25097][img]http://static-6.nexusmods.com/15/images/110/621184-1360150268.jpg[/img][/url]\r<br />[center]\r<br />[youtube]DCwIyZiCUy8[/youtube]\r<br />[youtube]cT10wEd31Ao[/youtube]\r<br />[youtube]R38dfMkx7eI[/youtube]\r<br />\r<br />[url=http://www.skyrimgems.com][img]http://SkyrimGEMS.com/images/badge_featured_500.png[/img][/url][/center]\r<br />\r<br />\r<br />[heading]Features[/heading]\r<br />[list]\r<br />[*] Horses for followers (UFO, AFT and EFF compatible, up to 15 followers&#39; horses, scripted AI, advanced features).\r<br />[*] Mounted combat for followers&#33;\r<br />[*] Horse equipment (new saddles and horse armor for both player and followers).\r<br />[*] Mounted combat horse charge with customizable physics.\r<br />[*] Mounted combat auto loot.\r<br />[*] Instant horse call with auto mounting.\r<br />[*] Horse whistle.\r<br />[*] Mounted conversations and corpse looting.\r<br />[*] Mounted herb harvesting.\r<br />[*] Fast dismounting with automatic combat weapon draw.\r<br />[*] Shared horse inventory with easy access.\r<br />[*] Switchable faction relations (friendly or neutral).\r<br />[*] Smart horse follow.\r<br />[*] Horse combat AI behavior selection (cowardly or foolhardy).\r<br />[*] Selective horse invulnerability and health/stamina/speed bonuses.\r<br />[*] Easy configuration via menu buttons and easy key customization.\r<br />[*] Multi Tap or Bound Key control modes (Bound Key requires SKSE).\r<br />[/list]\r<br />\r<br />\r<br />[heading]Getting Started[/heading]\r<br />[u][b]Installation:[/b][/u]\r<br />[list=1]\r<br />[*] Make sure that you properly remove any previous versions of this mod by stopping the quest via console and making a clean save (see troubleshooting).\r<br />[*] Update Skyrim to minimum version 1.9.32.0.\r<br />[*] Install [url=http://skse.silverlock.org]SKSE[/url] 1.6.15+ if you want to use advanced features and key bindings. If you need help with installing and running SKSE see [url=http://youtu.be/xTGnQIiNVqA]this video[/url]. SKSE is not required for this mod to work.\r<br />[*] You can now download, install and use Convenient Horses.\r<br />[/list]\r<br />\r<br />[u][b]Uninstallation (for making a clean save when upgrading see troubleshooting section below):[/b][/u]\r<br />[list=1]\r<br />[*] Open console and type (StopQuest CH) to release all running scripts. Make sure you DO NOT do this while factions are being updated or any other mod actions are in the process.\r<br />[*] Save the game to a new slot. All previous saves made with the mod active are considered to be dirty saves and are not safe to be used with any newer versions of this mod released in the future.\r<br />[*] Uninstall the mod.\r<br />[/list]\r<br />\r<br />[u][b]Configuration:[/b][/u]\r<br />Before you begin using the mod take a few moments to go through the configuration process. You can access configuration menu in-game by using the &#34;Convenient Horses&#34; power or through SkyUI-MCM interface. If you want to use BoundKey mode make sure you bind the keys first. If you want horses for your followers you will have to enable that feature first.\r<br />\r<br />[u][b]Control Modes:[/b][/u]\r<br />[list]\r<br />[*] Bound Key: Use five custom key bindings for Talk/Loot, Harvesting, Inventory, Fast Dismount and Follow Toggle. Requires SKSE and Gamepad disabled. If requirements are not met mod will automatically disable Bound Key mode and choose Multi Tap mode.\r<br />[*] Multi Tap: Use activate button (by default: Keyboard E, Gamepad A) to activate the horse specific number of times (like double click in Windows). Single tap to mount/dismount, dismounted double tap to open inventory, dismounted triple tap to toggle follow, mounted multi tap to talk/loot/harvest. This mode makes mounting/dismounting less responsive in order to be able to detect the number of taps and delay can be tweaked from configuration menu.\r<br />[/list]\r<br />\r<br />\r<br />[heading]Compatibility Guide For Modders:[/heading]\r<br />Convenient Horses v4.4+ uses modified Horse.nif and Shadowmere.nif models in order to incorporate new animation behaviors for hiding horse mane when armor is on.\r<br />If you are just adding new skins for default horse models you should download these modified files (found at the bottom of downaload page) or extract them from &#34;Convenient Horses.bsa&#34;. Put the models to &#34;SkyrimDataMeshesActorsHorseCharacter Assets&#34; folder and in Creation Kit in your custom ArmorAddon skin open the model to edit texture sets and assign your custom manetail texture set to a new Horse:4/Shadowmere:4 node. This will make sure that tail texture does not return to default when horse armor is on. You can then distribute your mod as usual as it will work the same even if user does not have these new CH horse models.\r<br />If your mod has new horse models then manetail mesh needs to be separated into two distinct meshes, new controllers added and new animation behavior links must be injected. This might be a bit complicated for you but you can ask me to do it for you, I&#39;d be glad to do so. I would first separate manetail mesh into mane and tail and then edit the nif file and add neccessary links and controllers. You can then assign manetail texture to newly created node and normally use it and distribute altered nif file with your mod. It will be compatible with Convenient Horses v4.4 armors and will work without any problems even if one is not using CH.\r<br />\r<br />\r<br />[heading]Feature Dscriptions[/heading]\r<br />[u][b]Followers&#39; Horses (order of preference):[/b][/u]\r<br />[list]\r<br />[*] [url=http://skyrim.nexusmods.com/mods/12933]EFF - Extensible Follower Framework[/url] by Expired\r<br />[*] [url=http://skyrim.nexusmods.com/mods/14037]UFO - Ultimate Follower Overhaul[/url] by fLokii\r<br />[*] [url=http://skyrim.nexusmods.com/mods/15524]AFT - Amazing Follower Tweaks[/url] by Dheuster\r<br />[/list]\r<br />Supporting vanilla followers and up to fifteen followers from either of these mods. Installed mod will be detected automatically so there is no need for any additional tweaking. This feature is disabled by default and has to be enabled in configuration menu.\r<br />Once enabled each follower will be provided with a personal named horse that nobody else can ride. If horse is killed a new one will be provided. This whole system is automatic and you don&#39;t have to worry about their horses at all. When you mount mod will make sure they do too and same goes for dismount. Complex scripting is used in order to be able to control their AI, make mounting/dismounting more responsive and add features like horse call and fast dismount in combat.\r<br />Few notes about UFO: If you use UFO 1.2b or higher you can disable its horses by talking to Skulvar the hostler at Whiterun stables via &#34;You know...&#34; dialogue. There is also incompatibility with UFO relax mode so do not use it while followers&#39; horses are enabled.\r<br />\r<br />You can choose which horse each follower will ride via &#34;I want you to ride...&#34; dialogue topic or use configuration menu to select global horse skin type and horse armor which will apply to all followers&#39; horses. Horse types and horse armor assigned via dialogue will be remembered for each follower even if they are dismissed. Serana is the only follower that cannot have horse chosen for her, until Dawnguard main quest line is completed.\r<br />\r<br />Bethesda didn&#39;t expect NPCs actively using the horses so they made a slight mistake with horse mounted combat camera changes and its conditioning. You will experience mounted combat camera reset to riding position when followers mount the horse and swithching back and forth when they draw or sheathe weapons in mounted combat. This is not possible to fix because camera behavior is hard coded and only way to work around the problem is to re-draw or re-sheathe the weapon yourself. Convenient Horses can re-draw the weapon for you if you enable that option in config. If you use SKSE, camera position will be updated without re-drawing the weapon and you can also manually force camera to update by pressing &#34;Horse Follow Toggle&#34; key in BoundKey mode while mounted.\r<br />\r<br />[u][b]Mounted Combat For Followers:[/b][/u]\r<br />By default game does not support mounted NPCs using weapons in any way. I worked really hard on this feature which is something that is not supposed to work in this game at all. Every attack and every detail is simulated and heavily scripted from the point of followers drawing the weapon while riding to sheathing it. Scripted behavior include combat target selection, collision distance detection, timing attack animations, left/right attack decision, use of mounted power attacks, taunting of opponents at start of combat and voice exertions. Each follower will be given special melee weapon for the purpose of mounted combat which deal no damage and produce no hit effects in order to leave that behavior to be simulated by the script, otherwise they would miss the attacks 90% of the time. These weapons are modified variants of regular weapon materials and types: Iron, Steel, Elven, Dwarven, Orcish, Glass, Ebony, Daedric and Dragonbone. Weapon choice is made for each follower at the beginning of each mounted combat session by matching their current weapon material and type. If they don&#39;t have melee weapon equipped or it cannot be matched then script will decide which weapon type is best for their skill set and material will be chosen according to player&#39;s level which is purely cosmetic. Mounted combat damage is not related to weapon material but only to weapon type, follower skills, magical buffs, game settings, opponent armor rating and player level modifier to base damage which simulate weapon material and smithing upgrades. If you play on different difficulty settings and find damage too low or too high you can alter the final damage percentage via config where you can go as low as no damage and up to 300% but I advise to leave it at 100% for balance because damage will increase as you level up anyway.\r<br />\r<br />[u][b]Horse Equipment:[/b][/u]\r<br />Horse equipment is a cosmetic addition which consists of new saddle and horse armor designs. Equipment can be changed via configuration menu, separately for player&#39;s horse and followers&#39; horses. I collected meshes from other popular standalone mods and altered them until I was satisfied with the final design and quality. Mesh alterations include many fixes to incorrect shaders, missing vertex colors and complete bone weight repaint for all meshes - some saddles have even been completely redesigned. Those who prefer the original meshes can always use them as a replacement because file names and textures are left unchanged.\r<br />\r<br />Standard game equipment:\r<br />[list]\r<br />[*] Bareback (no saddle).\r<br />[*] Nordic saddle.\r<br />[*] Imperial saddle.\r<br />[*] Dark Brotherhood saddle.\r<br />[/list]\r<br />[url=http://skyrim.nexusmods.com/mods/19936]More Saddles[/url] by Laup26:\r<br />[list]\r<br />[*] Traveler saddle.\r<br />[*] Bard saddle.\r<br />[*] Hunter saddle.\r<br />[*] Knight saddle.\r<br />[*] Big Game Hunter saddle.\r<br />[*] Dawnguard saddle.\r<br />[/list]\r<br />[url=http://skyrim.nexusmods.com/mods/13348]Horse Armors for Skyrim[/url] by Mystikhybrid - Gabriel Gullbergh:\r<br />[list]\r<br />[*] Leather armor.\r<br />[*] Nordic armor.\r<br />[*] Dwemer armor.\r<br />[*] Ebony armor.\r<br />[*] Daedric armor.\r<br />[*] Dragonbone armor.\r<br />[/list]\r<br />[url=http://skyrim.nexusmods.com/mods/38548]Sethai and Elthrai Horse Armors[/url] by Christian Paskota:\r<br />[list]\r<br />[*] Elthrai armor.\r<br />[*] Sethai armor.\r<br />[/list]\r<br />\r<br />[u][b]Mounted Combat Horse Charge:[/b][/u]\r<br />Horse can charge at other actors if sprinting during mounted combat, knocking them and dealing damage. Horse charge is actually a scripted simulation, everything from collision detection to physics. Many of these settings can be tweaked through the use of predefined presets or fully customized via MCM menu. Five presets are named using Golf terms of ball strike mechanics as analogy: Chip, Flop, Top, Punch and Drive. They have been designed to be used with standard horse speeds. Later presets use as much as two times the push force and if combined with high horse speeds, because base push force is derived form current horse movement speed, the results can become exaggerated.\r<br />Damage done can also be configured and consists of flat base damage plus percentage of target&#39;s maximum health. Final damage is affected by target&#39;s armor rating. Charging is considered an assault unless final damage is zero.\r<br />There are two types of penalities that horse can suffer from. Stamina cost percentage determine how much stamina horse loses for each knocked target while speed penalty simulates recoil by slowing the horse.\r<br />\r<br />[u][b]Horse Call:[/b][/u]\r<br />Before you can start using a horse call you must buy Horsecaller&#39;s Horn from any stable master for 500 gold. Once you buy the horn Horse Call ability will be available as a power. Use it to call your horse and you should appear mounted after a short cinematic. Only works in Tamriel outdoor worldspace, when not in combat. Avoid using it in tight and closed locations. Followers will also use Horse Call and it is fully synchronized if you are the initiator. If you have [url=http://skyrim.nexusmods.com/mods/26704]Convenient Horse Herding[/url] mod installed use your horse call power while sneaking and you will be able to call any horse from your herd by its name. It is your responsibility not to leave horses in Solstheim, Soul Cairn, Blackreach or near fort Dawnguard as horses cannot pass through zoning points by themselves.\r<br />\r<br />[u][b]Horse Whistle:[/b][/u]\r<br />Alternative and more lore friendly way of calling your horse and is best used if horse is set not to follow you or if using smart follow mode and horse stops following due to location filtering. There are no tricks used here to speed up the process so horse should come to you eventually by using standard game AI pathing. Waiting one hour game time will speed up the process if horse is too far away. Horse Whistle is available as a power but in order to obtain it you will need to learn how to whistle and that is something that you will have to find out on your own through the regular gameplay.\r<br />\r<br />[u][b]Mounted Conversations And Corpse Looting:[/b][/u]\r<br />This doesn&#39;t work by targeting with crosshair as you might suspect but by using a radius search method. You must pay attention to the relative position between the target actor and your horse ([url=http://static.skyrim.nexusmods.com/mods/images/14950-1-1334851020.jpg]see picture[/url]). You can also talk to mounted actors because if horse has been found as a target additional search will be performed in order to find the person who might be riding it. With the inclusion of mounted combat and possibility to kill opponents while riding, in order to make things more convenient you may loot dead bodies the same way you would initiate in conversation with live actors. In case of using Multi Tap control mode this feature is shared with Herb Harvesting and will take precedence over it if any of the valid actors has been found.\r<br />\r<br />[u][b]Mounted Herb Harvesting:[/b][/u]\r<br />Similar to mounted conversations this feature works by scanning for nearby harvestable. Due to the nature of script functions returning only one plant at a time and without possibility to filter out harvested ones I had to code for multiple passes and each pass scanning different sector around the player. If you&#39;re using Multi Tap control mode you can keep tapping to harvest while moving and if you stop moving then attempt will be made to collect all nearby herbs in one pass. Bound Key mode allows continuous harvesting if button is being held and uses even more sophisticated logic. One more addition to Bound Key mode is &#34;Consolidate&#34; option which disables Harvest key and assigns it as a secondary function to Mounted Conversations (similar to how Multi Tap mode combines these two features by prioritizing talk/loot over harvesting).\r<br />\r<br />[u][b]Fast Dismounting:[/b][/u]\r<br />This doesn&#39;t add any new custom animations but intercepts the default dismount animation instead and replaces it with jump animation or weapon draw animation if in combat, while translating the rider behind the horse at the same time, giving an illusion of jumping off the horse back. In Multi Tap mode this will replace the default dismount action and can be configured to work all the time, only in combat or competely disabled. Bound Key mode uses separate key for fast dismount. If being used during mounted combat it will force the game to ignore weapon sheathe animation in order to perform fast dismount without any delays.\r<br />\r<br />[u][b]Horse Inventory:[/b][/u]\r<br />All items will be stored in a remote container called Large Horse Sack. By default it allows unlimited capacity but you can set custom carry weight limit in config and then mod will access main container via remote actor called Small Horse Sack. Bound Key mode allows remote inventory access to help with the issue of being over-encumbered when you want to take all the items in order to sell them to a merchant or store in your house. Remote inventory access only works while in major cities, shops, player houses, guild houses, castles and inns.\r<br />There is additional feature in BoundKey mode for quick transfer of common crafting materials. Materials are broken into three categories, each for corresponding profession: Alchemy, Blacksmithing and Enchanting. Opening horse inventory via quick transfer menu will always directly access Large Horse Sack, bypassing any carry weight limit. To access quick transfer menu hold down modifier key while opening horse inventory. Modifier key is dynamic and choosen in following order: 1.Alt, 2.Ctrl, 3.Shift depending on which keys are in use by standard CH features so first available key is always used. If all three modifier keys are already bound to CH features then this feature will not work.\r<br />\r<br />[u][b]Hot Air Balloon Kit:[/b][/u]\r<br />This useful item can be crafted at any forge under misc section. If carried in inventory it will be automatically deployed when over-encumbered which gives 10000 carry weight for 5 minutes.\r<br />\r<br />[u][b]Faction Relations:[/b][/u]\r<br />When you first time load the mod new friendly faction relations will be established and horse should never attack or participate in combat. This is a lengthy procedure because there are over thousand of factions and it might take up to a minute to complete. You will be notified of the progress and it is best not to save the game while faction relations are being updated but you may continue to play normally. If you use a battle mount or wish to turn off this feature you can queue for faction relation update by using the configuration menu. Followers&#39; horses are also affected by these faction relations. Faction relations will update automatically if new factions from supported mods/DLCs are detected on game load.\r<br />\r<br />[u][b]Smart Horse Follow:[/b][/u]\r<br />By default horses will not follow their owners. Can be toggled via Follow key if using Bound Key mode or dismounted Triple Tap if using Multi Tap mode. Additional option is available in config menu where you can choose between Smart and Always. &#34;Smart&#34; means that horses will temporarily stop following if their owners are sneaking or within a specific location (more than 200 handpicked locations like bandit camps, forsworn camps, giant camps, hagraven nests, military camps/forts, orc strongholds, ship wrecks, etc.). You can also select one of three presets (Short, Medium, Long) which forces the horse to maintain the specific distance when following you.\r<br />\r<br />[u][b]Horse Combat AI Behavior:[/b][/u]\r<br />While there are only two options (Cowardly and Foolhardy) they change a great deal of how your horse will perform when it comes to combat situations. It is best used in combination with faction relations to achieve desired results. Cowardly will never initiate in combat, will always flee from threats and will not help anyone in combat. Foolhardy will attack enemies on sight, will never flee from combat, will help friends/allies and will have its damage increased as 20+PlayerLevel. For example having friendly faction relations and foolhardy behavior will result in horse that does not participate in combat but also does not flee from other combatants. On the other hand if you set factions to netural, keep foolhardy behavior and enable horse follow it then becomes a fearless battle companion.\r<br />\r<br />\r<br />[heading]Tips & Tricks[/heading]\r<br />[list]\r<br />[*] Hold &#34;Walk&#34; key when you want to make short turns while riding a horse. Very useful when standing near the edge of a cliff, need to position better for a melee weapon swing in mounted combat or want to do quick 180 degree turn for another Horse Charge run.\r<br />[/list]\r<br />\r<br />\r<br />[heading]Troubleshooting[/heading]\r<br />[u][b]False Errors:[/b][/u]\r<br />Some people like to dig into script logs or use third-party tools to scan mods for dirty edits. Note that I always check script logs for errors and while some of them are normal to appear on game load (e.g. &#34;error: File &#34;XFLMain.esm&#34; does not exist or is not currently loaded.&#34;) if you find any error in log related to CH that repeats itself many times after one game load then you probably have problems with old scripts being stuck in your save because you did not follow the update or clean save procedure.\r<br />Unique Frost use CH as dependancy and some third-party tools might report missing RACE records. This is completely normal and should be ignored.\r<br />&#34;Identical to master&#34; records related to horse skins reported by TES5Edit are there on purpose and should not be cleaned.\r<br />\r<br />[u][b]Compatibility:[/b][/u]\r<br />[list]\r<br />[*] Conflicts with Better Horses, Horse Inventory or similar mods which deal with activation blocking on the horse.\r<br />[*] Conflicts with mods that use Variable01 actor value on followers, which is used by CH to store horse skin and armor selection.\r<br />[*] Minor conflicts with mods that alter default horse skin armor addons (not re-texture mods). Conflict will cause horse tail to be always black when using horse armors.\r<br />[*] Must be loaded after SkyTEST-RealisticAnimals&Predators.esp if you want dynamic mane on SkyTEST&#39;s wild horses.\r<br />[/list]\r<br />\r<br />[u][b]Finding Source Of The Problem:[/b][/u]\r<br />Mod has been thoroughly tested through the lengthy beta test period. If you experience any kind of problems then you should check for any of the following:\r<br />[list]\r<br />[*] Requirements - Skyrim v1.9.32.0+ and optional SKSE v1.6.15+. Make sure your game is up to date and SKSE script files installed correctly (PEX script files are inside .DataScripts folder in the SKSE archive). Most common problem with this is that mod cannot load if Skyrim is too old, some of the features are not working and that you cannot dismount.\r<br />[*] Conflicts - With so many mods available it is not possible to know which ones are in conflict. Similar mods or mods that put scripts on the horse might cause a conflict and some conflicts can even cause CTDs. Having too many scripts running or scripts that are not optimized or badly coded can slow Papyrus down and leave litle to no free resources for Convenient Horses to work properly (you might experience delays and bad responsiveness). Only way to find out is to disable all other mods and then enable half by half until you pinpoint the source of the problem.\r<br />[*] Dirty Save - Can be caused by other mods you used in the past as well as previous versions of this mod that are not uninstalled correctly by following instructions. Start a new game with a new character and try to replicate the problem. If everything works fine then you know it was the problem with a dirty save.\r<br />[*] Something Else - Sometimes people come here to report problems related to horses and mounted animations. While their concerns are logical they were always wrong to come here and it was always another mod causing the problem. Simply remove this mod by following the instructions and see if you still have the problem.\r<br />[/list]\r<br />\r<br />[u][b]Script Latency Issues:[/b][/u]\r<br />Convenient Horses will not work properly if you&#39;re suffering from increased script latency. Latency Test is provided with the mod and is a good way to see if Papyrus event manager is responsive or not. Latency should at best stay below 50ms and never peak above 100ms. Increased script latency is usually related to dirty saves and build up of unexecuted code which can prevail even after the mod that was causing it has been removed.\r<br />SKSE 1.6.7+ has come with the way of cleaning orphaned OnUpdate() events from saved games which should help in fighting the save bloat. SKSE console command &#34;ClearInvalidRegistrations&#34; should be called when game is loaded and it will attempt to process all queued events that are stuck in the save. This might take hours depending on amount of bloat. You can queue this command to execute automatically on each game reload by adding following lines to DataSKSEskse.ini file:\r<br />\r<br />[General]\r<br />ClearInvalidRegistrations=1\r<br />\r<br />\r<br />[u][b]Save Game Cleaning:[/b][/u]\r<br />[list=1]\r<br />[*] Load the save you want to make clean.\r<br />[*] Release the running scripts by typing in console (StopQuest CH).\r<br />[*] Overwrite the save.\r<br />[*] Repeat steps 1, 2 and 3 for all saves you want to make clean.\r<br />[*] Disable/Uninstall the mod in mod manager.\r<br />[*] Load the saves you made in step 3 and overwrite them again one by one, this time without the mod being loaded.\r<br />[/list]\r<br />If you were upgrading the mod with clean save procedure everything you&#39;ve set up in config will be lost along with horse call power and whistle quest. To regain these powers artificially use console to change few global values (set CHBuyHornCompleted to 1) and (set CHLearnWhistleCompleted to 1). After you change these values restart the quest by typing (StopQuest CH) followed by (StartQuest CH) and you will gain access to these powers as if you had gained them the natural way. I strongly recommend not to use this procedure if you are installing the mod for the first time as you gonna miss the real fun of learning the whistle.\r<br />\r<br />\r<br />[heading]Credits[/heading]\r<br />[list]\r<br />[*] KahjiitRaj as author of Oblivious Horses.\r<br />[*] Expired as author of Extensible Follower Framework.\r<br />[*] Dheuster as author of Amazing Follower Tweaks.\r<br />[*] fLokii as author of Ultimate Follower Overhaul.\r<br />[*] Laup26 as author of More Saddles.\r<br />[*] Mystikhybrid - Gabriel Gullbergh as author of Horse Armors of Skyrim.\r<br />[*] agovideo as author of Inferno Sword.\r<br />[*] Gopher as advertiser.\r<br />[*] lorelai2009 as a best supporter and beta tester.\r<br />[*] Devoted fans.\r<br />[/list]\r<br />\r<br />\r<br />[heading]Change Log[/heading]\r<br />[list]\r<br />V5.0:[*] Added more horse equipment options. New saddles available that are my own interpretation of ones from More Saddles mod. Even though they are not the same meshes they share the same file path and names so it is possible to easily replace them with meshes from original mod. Includes all existing game saddles and bareback option. Old armor meshes have been smoothed and few shaders corrected.\r<br />[*] Redesigned horse charge. It is now much more responsive and should knock targets as soon as sprinting starts. Customizable SFX, damage, stamina cost and physics simulator parameters (heading angle tolerance, heading force dissipation, push force amount, angle of elevation, speed penalty). Simulator parameters can be configured individually in MCM only or anyone can use one of 5 available presets.\r<br />[*] Added support for latest version of Ultimate Follower Overhaul mod.\r<br />[*] Added missing crafting materials from Danwguard and HearthFires to quick transfer blacksmithing list.\r<br />[*] Removed bound key mode gamepad limitation. Gamepad keys can be configured through MCM only.\r<br />[*] Fixed crash that was caused by dynamic speed feature on followers&#39; horses which was producing invalid horse speed values.\r<br />V4.9:[*] Added optional horse inventory weight limit. Mod will still use good old container for unlimited storage but... if using weight limit then all items will be transfered from that container to a temporary actor when accessing inventory and then transfered back when inventory menu is closed. This item transfer is instant and transparent to the player. It has to be done because it is not safe to keep items stored on an actor but there is no other way to limit the weight and have that information relayed to UI. Item ownership is preserved but not displayed when browsing actor&#39;s inventory. Other features that are directly related to horse inventory (auto loot stash and quick inventory transfer) will still work the same by dealing with main container directly which means that weight limit will only have effect when manually transfering items (UI will grey-out items in your inventory if there is not enough storage capacity for their weight). You can always access the container directly via quick transfer menu and for clarification &#34;Horse Sack&#34; container now has a new name &#34;Large Horse Sack&#34; while temporary actor&#39;s inventory will show as a &#34;Small Horse Sack&#34;.\r<br />[*] Added whistle quest override option (available through MCM config only). It can suspend whistle learning quest and grant horse whistle power but will do nothing if learning quest has already been completed.\r<br />[*] Added full support for SkyTEST mod. When updating faction relations SkyTEST custom factions will be included. SkyTEST horse models updated to support dynamic mane and CH must be loaded after SkyTEST for this to work.\r<br />[*] Added factions from Falskaar and Wyrmstooth mods.\r<br />[*] Faction relation update now triggers automatically if new factions from supported mods/DLCs are detected on game load. Due to this change everyone who update CH to v4.9 will have their faction relations updated to friendly.\r<br />[*] Turning off &#34;disable horse tracking&#34; option will now restore last ridden horse without the need of mounting.\r<br />[*] Fixed advanced auto loot leaving all items unequipped on dead actors.\r<br />[*] Fixed followers being stuck on the horse if they were using a torch. This is a game bug and to prevent it all torches are removed from followers when mounting and given back when they dismount. Does not work with custom carriable lights.\r<br />V4.8:[*] Added Elthrai and Sethai horse armors by gechbal.\r<br />[*] Added support for Interesting NPCs mod.\r<br />[*] Added basic support for Wyrmstooth mod.\r<br />[*] Removed auto horse inventory recovery on horse death. Items were never stored on the horse anyway so ride a new horse to allow access or manually recover items via config.\r<br />V4.7.3:[*] Added basic support for Falskaar mod.\r<br />[*] New dialogue topic for followers: &#34;You seem to be stuck on the horse.&#34;. It will instantly reload follower 3D which fixes the common animation behavior problems. Use it when follower cannot dismount or is misplaced. Dialogue will not appear if follower is dismounted or in combat. You can also activate follower&#39;s horse to talk to the mounted follower, which is useful in case of misplacement.\r<br />[*] Configuration power is now hidden by default.\r<br />[*] Fixed bug where learn whistle dialogue would not show if horse tracking has been disabled in config.\r<br />V4.7.2:[*] Fixed bug with advanced auto loot marking items as stolen.\r<br />v4.7.1:[*] Fixed bug with advanced auto loot retrieving non-playable items. New method uses a temporary container as intermediator. All items are transfered at once from a corpse to that container (this is where non-playable items are ignored by the game and are left on the corpse), then advanced auto loot can safely be performed by retrieving the items from a temporary container one by one. Any remaining items that were not looted are then transfered back to the corpse. There is only a minor side-effect to a new method where all playable items are unequipped from a corpse uppon moving them to a temporary container so dead NPCs will end up being naked if they were wearing playable equipment. If you were affected by this bug and need to clear inventory from non-playable items then see troubleshooting.\r<br />[*] Fixed bug with new camera fix not working after followers are done performing mounted combat. For some reason game would not restore camera to a correct position unless given some time to settle, in this case 500ms has proved to be just enough time to wait before attempting to correct it.\r<br />[*] Fixed bug where followers&#39; horses would continue to follow their owners even if they were restricted by a smart follow behavior.\r<br />v4.7:[*] New feature for followers called Deferred Dismount. Before attempting to dismount themselves, followers will wait for player to move away specific distance from the own dismount point or set amount of time has passed. This feature will prevent followers from dismounting when player wants to dismount temporarily to interact with the nearby environment (e.g. mine an ore deposit).\r<br />[*] New feature that disables game&#39;s horse tracking to prevent horse from being moved on fast travel (requires SKSE). By default game keeps track of last ridden horse and having this feature enabled will force game to &#34;forget&#34; which horse player was using when it is not being ridden. Might affect mods that rely on game&#39;s horse tracking system.\r<br />[*] Extended and improved mounted combat auto loot feature (requires SKSE). You can now set auto loot mode to basic (the old way of opening inventory contents each time enemy dies) or advanced (use of filter conditions to perform automatic looting without interrupting the gameplay). Filter conditions include following categories: ingredients, animal hides, ores and ingots, ligts and torches, food and drinks, potions, poisons, books (with min gold value), spell tomes (all or unknown only), recipes, scrolls, soul gems, precious gems, keys, ammo and equipment (all-in-one: clothing, armor, weapons and jewelry). For each category you can set to auto loot directly to player&#39;s inventory or auto stash to horse inventory. Equipment category have additional settings to filter out non-enchanted items or set minimum gold value per weight (note that enchanted item gold value is calculated by the mod and might be slightly different from what game displays due to use of functions that round enchantment effect cost values to nearest integer).\r<br />[*] New feature for quick inventory transfer of common crafting materials (requires SKSE and BoundKey mode). Materials are broken into three categories, each for corresponding profession: Alchemy, Blacksmithing and Enchanting. To access quick transfer menu hold down modifier key while opening horse inventory. Modifier key is dynamic and choosen in following order: 1.Alt, 2.Ctrl, 3.Shift depending on which keys are in use by standard CH features so first available key is always used. If all three modifier keys are already bound to CH features then this feature will not work.\r<br />[*] New craftable item: Hot Air Balloon Kit. Can be crafted at any forge under misc section and if carried in inventory will be automatically deployed when over-encumbered. Once deployed it will provide with additional 10000 carry weight for 5 minutes and one kit is destroyed in the process. Main reason behind making this is to supplement new quick inventory transfer feature to prevent being slowed down when large amount of materials is transfered to player&#39;s inventory and allow normal movement between crafting stations. Because it works on global level it can also be used to move large quantity of items from one home to another without being burdened or simply allow to carry more items for a short amount of time. This feature is not optional so if you don&#39;t want to use it simply don&#39;t craft any kits or don&#39;t carry them with you.\r<br />[*] Improved Camera Fix feature. It will now try to use new SKSE function to fix the camera position without re-drawing the weapon which works seamlessly with any number of followers and you will hardly notice any camera movement. It will automatically roll back to old behavior of re-drawing the weapon if SKSE is not installed. Additionally you can manually trigger the camera fix by using &#34;Horse Follow Toggle&#34; bound key while mounted if you have SKSE, which is useful in situations when NPCs other than CH followers are triggering the camera bug.\r<br />[*] New bound key inventory &#34;Absolute&#34; access option for full unconditional access from anywhere.\r<br />[*] Bound key mode now uses key registration event system instead of listening for key presses ~30 times per second which greatly reduce stress on Papyrus and ensures that key presses are detected every time regardless of script latency.\r<br />[*] Tweaked horse follow behavior. Followers&#39; horses will no longer escort if follower is waiting or relaxing, will wait instead. Player&#39;s horse follow distances increased by 15 feet to give more room. Player&#39;s horse will use travel procedure instead of follow procedure if set to cowardly behavior or horse tracking is disabled. Travel procedure makes horse horse movmement less dynamic (always walk if close, jog/run if further away) and prevents auto-movement on fast travel (if horse tracking is not disabled game will move horse on fast travel anyway).\r<br />[*] Added new hand-picked locations from Dragonborn DLC to allow horse smart follow behavior in Solstheim.\r<br />[*] Added support for upcoming companion Arissa mod by Chesko.\r<br />[*] MCM menu now use string table stored in text files that are located in DataInterfaceTranslations folder. When translating, use advanced editor like notepad++ and make sure that text files are saved using &#34;UCS-2 Little Endian&#34; encoding. Use single TAB character to separate translations from keywords.\r<br />[*] Fixed minor issue with horse call where game would misplace the horse and not respect the given coordinates.\r<br />V4.6:[*] Added basic Dragonborn DLC support. Horse can be called and ridden in Solstheim (it is your responsibility not to leave horses in Solstheim, Soul Cairn, Blackreach or near fort Dawnguard as horses cannot pass through zoning points by themselves). Also supports new herbs and recognizes new factions (don&#39;t forget to update faction relations).\r<br />[*] New SkyUI mod configuration integration. Old configuration power can be hidden through MCM.\r<br />[*] Added new options for bound key horse invetory access (Local, Travel and Remote). Local blocks access if not near the horse. Travel will fast travel to the horse, open inventory and fast travel back to initial location if horse is not near and invetory key is being held for a second. Remote will instantly open inventory regardless of distance. Location restrictions still apply so you can&#39;t access inventory e.g. while in dungeons.\r<br />[*] Added horse inventory recovery option in configuration menu.\r<br />[*] Added horse charge collision checks on Z axis. It is no longer possible to hit targets if they are above or below the horse. It was initially left out on purpose to reduce number of calculations but it had proven to cause issues for some people (e.g. charging under the bridge could hit targets above). To compensate for increased script time and it having varying effect on different computers new configuration option has been added called &#34;Impact Precognition Time&#34; where you can fine tune premature hit event execution (impact precognition time is projected time in milliseconds that should take horse to reach the calculated collision distance moving at current velocity). Angular and positional validity checks are also being made at the beggining of hit event and they too take some computational time so if you reduce precognition time bellow certain threshold (e.g. &lt;50 millseconds) successful hit might fail to evaluate. Decrease if targets are being hit by invisible wall. Increase if hit is never occuring or is being delayed.\r<br />[*] Instead of being loaded on demand, horse charge impact sounds should now be kept in memory at all times to prevent delayed playback.\r<br />[*] Removed recorded reverb and improved quality of horse whine sound that can be heard when horse spots the player after using a whistle.\r<br />[*] Fixed bug where companion Valfar would not get into a delta formation after using horse call.\r<br />[*] Fixed a bug with bound key mode where consolidated harvesting would not work if harvesting key was left unbound.\r<br />[*] Fixed nordic horse armor not displaying game shaders on fur parts.\r<br />V4.5:[*] Removed all dependencies. There will be now one version supporting all future expansions in any combination. All expansion resources are now gathered via script and injected into CH on each game load. I had to go this route or I would have to make and maintain numExpansions² different versions of CH to support all possible combinations which is overkill and I could barely keep two different versions up to date with the mod of this complexity.\r<br />[*] Added Horse Call horse selection feature support from Convenient Horse Herding mod. To access the horse selection from CHHerding use Horse Call power while sneaking and once you select the horse it will be called instead of your current horse. You must have CHHerding installed for this to work.\r<br />[*] Increased compatibility with two custom follower mods. Valfar 1.4+ will now ride a horse (remove CH Valfar patch if installed). Hoth will now use his bonestaff in mounted combat.\r<br />[*] Reworked horse charge: better collision detection, hit physics are more realistic and will not go crazy when using higher horse speeds, horse will be slowed on hit for a moment, hit sound is more bassy, removed top sprint speed requirement so it should be easier to hit if target is close and no more charge animation which allows using mounted combat attacks during charge.\r<br />[*] Bound Key horse inventory easy access will now always instantly open instead of holding the key for teleport to the horse. Location restrictions still apply.\r<br />[*] Invulnerable mode is replaced with Protection mode which can be set to either essential or invulnerable. Those who didn&#39;t like the unlimited stamina when horse was invulnerable can now set protection mode to essential which only prevents horse from dying.\r<br />[*] Horse stat bonuses are now applied via script. Increased max health and stamina bonuses from 500 to 1000. Health, stamina and speed bonuses can now be changed by interval of 1. These changes also prevent horse death when health bonus ability is dispelled on unload (e.g. when player enters unrideable worldspace) and horse was wounded for more than its base health at that moment.\r<br />[*] When stopping the quest an inventory recovery confirmation dialog will show. You should then close the console before doing anything else and choose whether you want to recover the items or leave them stored so that quest can finish the shutdown procedure. This is to allow items to stay stored if you are just updating the mod or restarting the quest. If you are stopping the quest to uninstall the mod or make a clean save you should then allow the item recovery.\r<br />[*] Removed player spoken dialogue from horse whistle. Horse will now whine when it spots the player.\r<br />[*] Horse armors will not apply unless horse is default race. This should prevent outfit removal of cart horses or other custom race mounts.\r<br />[*] Nordic horse armor now use correct cubemap texture.\r<br />[*] Fixed bug with follower mounted combat where no damage would be dealt if target was not attacking the follower.\r<br />[*] Removed load message toggle and no messages will be displayed unless control mode has been changed.\r<br />[*] No more missing dialogue when mod is installed on clean save.\r<br />V4.4:[*] Dynamic horse mane. New animation behaviors are integrated with Horse.nif and Shadowmere.nif which allows mane toggle via script. Custom horse models will need same integration or mane will be visible when armor is on.\r<br />[*] Horse armor mechanics overhaul. Horse armor is no longer applied by changing horse race which removes all compatibility issues with custom horse outfit mods. Dynamic horse mane is now used to hide mane when armor is on.\r<br />[*] Fixes and tweaks of all horse armor meshes. Weight painting from scratch on all horse armors to remove clipping and streching - armor plates should now be rigid and will not deform while horse is moving. Increased size of rear armor plates, most noticeably on ebony and daedric horse armors. Added missing environment map and tweaked shader parameters for ebony horse armor so it should look more like ebony now. Replaced red edges on daedric horse armor with distinctive animated red glow and also added eye glow.\r<br />[*] Followers&#39; horses will now swap skins/armor instantly.\r<br />[*] Serana can now ride regular horses after quest line has been completed.\r<br />V4.3:[*] New feature: Latency Test. Performs event manager response tests to see how well Convenient Horses would run. There are two types of tests, local and gameplay. Local test will run in config menu for set amount of time and will trace the performance details to the script log and display the end results in form of a on-screen message. Gameplay test will run until you enter the config menu again and will print latency notification every few seconds. This should help people with poor script latencies hunt down the problematic mods or game events. Do not enter the menu or open console during the local test or you will get bad results.\r<br />[*] New feature: Camera Fix. Script will attempt to fix mounted combat horse camera position by fast re-drawing the weapon on player. Bug is caused when followers mount the horse or sheathe weapons after mounted combat. There is no way to check the camera position so whole procedure is intuitive and fix will be attempted on known bug triggers. The more followers are recruited the greater the delay before fix is attempted in order to prevent weapon re-draw spam, because each follower will attempt to trigger the fix procedure and with the delay in place each new trigger will override the previous one. Works best with just one follower.\r<br />[*] Prefer riding option can now also be toggled by talking to followers and selecting the dialogue topic &#34;...should follow me on foot.&#34; or &#34;...should follow me on the horse.&#34;. You can talk to any follower and it will apply to all followers. Additionally activating the follower&#39;s horse while follower is riding it will engage in coversation with the follower in order to make targeting easier. New dialogue will only appear when in rideable zones and when player is on foot.\r<br />[*] Config menu now runs in one event procedure instead of two. This should prevent some people from being stuck after using the config due to script lag.\r<br />[*] Added 4th preset for follower&#39;s horse call distance. They can now run even further instead of using horse call.\r<br />[*] Horse Call black screen fade is now available again and can be turned on in config, due to popular request. Fade speed will now take only 1 second instead of old 4 seconds because since the recent changes it takes much less time to mount the horse after blowing the horn.\r<br />[*] Added mounted harvesting support for harvestables from Soul Cairn.\r<br />[*] Player&#39;s horse is no longer intermediator when using horse inventory therefore no items are stored on the horse anymore. All items are now directly stored in a remote container &#34;Horse Sack&#34; and they will still be recovered when horse dies or quest is stopped. This change drastically improves compatibility with mods that rely on contents of horse inventory and also fixes the problem with some items being flagged as stolen or lost. Only &#34;downside&#34; is that there is no more weight limit which cannot be changed for containers.\r<br />[*] Followers can now be harmed in mounted combat.\r<br />[*] Changed follower mounting conditions. Will not attempt to mount if attacking the player, sandboxing, knocked, bleeding out, swimming, falling, talking, synced, etc. These changes also fix the problem where followers would not mount their horses under normal circumstances.\r<br />[*] Removed Blackreach from Smart follow mode location filters because it is considered as rideable zone in Dawnguard. Also added Blackreach support to vanilla version.\r<br />[*] Armored horse mane now use vanilla normal map texture in order to save mere 300K of video memory.\r<br />[*] Fixed an issue where followers would fail to sheathe weapons after mounted combat if animation graph could not respond at that time.\r<br />[*] Fixed a bug with horse call formation where if horse call has been used immediatelly after entering rideable zone followers would fail to receive new coordinates and would go to the previously used formation location instead.\r<br />[*] Fixed problem where followers would in some situations remain on the horse/dismounting and would not be moved with the player when entering a dungeon or a city.\r<br />[*] Fixed a bug where using fast dismount with weapons drawn would remove weapon from hand if mounted combat camera was reset due to game bug when followers mount their horses or sheathe weapons while riding. Weapon draw animation will now always play to prevent this issue, even if weapon is already drawn.\r<br />V4.2:[*] Alternative vanilla variant of this version is available for download. Both Dawnguard and Vanilla users can now enjoy new features.\r<br />[*] New feature: Mounted Combat For Followers&#33; It wasn&#39;t easy making it so I&#39;d like to hear a feedback or simply share your feelings. See description for details.\r<br />[*] No more instant spawning horses and black screens. Each time horse is called or recalled a magic visual effect will enhance the experience for both player&#39;s horse and followers&#39; horses.\r<br />[*] Follower behavior overhauled. Much better mounting/dismounting/horsecall response if using fewer followers and horses are spawned before followers finish blowing the horn in order to make mounting faster.\r<br />[*] No more realistic/convenient/instant modes, it now defaults to realistic but there is new option called Horse Recall if you don&#39;t want horses to stick around.\r<br />[*] Each time horse needs to be spawned or teleported followers will use a horse call.\r<br />[*] Follower&#39;s automatic horsecall minimum distance can be tweaked by selecting one of three presets. If horse is closer than minimum distance followers will go on foot otherwise they will blow the horn.\r<br />[*] New riding option for followers: Prefer Riding. If enabled followers will always ride regardless of player.\r<br />[*] Removed behavior presets and replaced them with two toggleable settings: Auto Retaliate (engage enemies in combat automatically even if player is riding with weapons sheathed) and Combat Escape (break combat if player ride with weapons sheathed). If Auto Retaliate is enabled Combat Escape will not work to prevent conflict between these two features.\r<br />[*] Followers&#39; horses will not collide with weapons or projectiles anymore. This feature is forced for script procedure safety reasons and cannot be \r<br />turned off.[*] Followers cannot be made invulnerable anymore. Instead, they will not collide with weapons or projectiles while riding or being controlled by the script. This feature is forced for script procedure safety reasons and cannot be turned off.\r<br />[*] Improved Alsvid combat behavior. It will no longer attack and will just charge at the target instead. Instead of exploding after few seconds it will now try to reach the target. Explosion damage scales with player level increasing for every 10 levels to make it usable in late game. Explosion will leave flame on the ground at the place of explosion that will deal damage to enemies who pass through it. Only enemies take damage from explosion and releated fire effects.\r<br />[*] Horses will no longer follow to Castle Volkihar if using Smart follow mode.\r<br />[*] Auto loot will now work properly if enemies were killed by followers and the Alsvid&#39;s explosion.\r<br />[*] Followers will be forced to dismount if they were dismissed or told to wait while riding and will no longer be stuck on the horse.\r<br />[*] Followers will no longer try to escape from combat if player is swapping weapons during mounted combat.\r<br />[*] Fixed a bug where regular followers would be given Alsvid as random horse of choice.\r<br />[*] Fixed a bug where under some circumstances Dark Brotherhood followers could not sit on the horse.\r<br />[*] Fixed a bug where config menu would never display and character become permanently stuck if auto run was active.\r<br />V4.1:[*] Added Serana support with unique horse behavior (experimental). She will ride the Alsvid, the unique bone mount.\r<br />[*] Item recovery will not work on summoned horses anymore.\r<br />[*] Disabled follower auto draw weapon with player to prevent mod problems, instead of clearing teammate status.\r<br />[*] Teammate status change reverted to prevent possible problems with other mods.\r<br />[*] Changed the way packages are conditionalized by using faction ranking instead of actor values to prevent issues with follower mods.\r<br />V4.0:[*] Dawnguard is now required to run this version.\r<br />[*] Added support for Arvak and other summoned horses. Summoned horses will not count as regular horses and they will only share following features: horse charge, fast dismount, horse speed tweaks and mounted conversations/harvesting.\r<br />[*] Added support for new rideable zones: Blackreach, Soul Cairn and Dayspring Canyon.\r<br />[*] New feature: Auto Loot. Enemies killed in mounted combat will have their inventory automatically opened. Maximum range 100ft. Can be disabled in config.\r<br />[*] New option: Dynamic Speed. Followers will ride faster if they are further away from the player in order to catch up more easily. Speed is tweaked according to distance between the follower and the player and is fully dynamic.\r<br />[*] Horse Call black screen fade can now be turned off.\r<br />[*] Whistle and follow toggle player animations can now be turned off for uninterruptible gameplay.\r<br />[*] Follower Ignore Combat feature has been renamed to Follower Behavior in order to avoid confusion and better descriptions have been made. Two behavior presets are called Fighter and Supporter.\r<br />[*] Follower riding invulnerability can now be toggled separatelly.\r<br />[*] Followers should now properly dismount when in combat if using Fighter behavior preset (previously known as Ignore Combat: OFF).\r<br />[*] Followers should no longer assist player in killing their own horses. They will now defend them.\r<br />[*] Followers should no longer dismount if their parent cell unloads. You could usually notice this if they fall behind too much after which they get teleported behind the player and use the horn.\r<br />[*] Followers that were in process of mounting/dismounting while player was entering a new zone will now be moved near player as soon as they are finished. You no longer need to wait for followers to dismount before entering the city or a dungeon.\r<br />[*] Followers will no longer be counted as teammates and draw their weapons while in the process of mounting. Multi-follower mod users are not aware of this issue because these mods already disable synchronized weapon draw.\r<br />[*] Removed fast travel code because new Skyrim version takes care of mounted actors that are following the player.\r<br />[*] Removed Inventory Transfer option, it is now always enabled. Other horse inventory mods should not be used anymore.\r<br />[*] Removed Disabled control mode. You now must decide between Multi Tap and Bound Key mode.\r<br />[*] Fixed bug with unbound keys triggering related functions.\r<br />[*] Fixed bug with fast dismount that was introduced with addition of crossbows.\r<br />[*] Reduced whistle volume further by 2dB.\r<br />[/list]",
  "categoryId": "83",
  "version": "5.0",
  "author": "Alek",
  "createdUnix": "1334177551",
  "updatedUnix": "1387304076",
  "containsAdultContent": false,
  "uploadedBy": "mitchalek",
  "primaryFile": null,
  "files": [
    {
      "fileId": "67814",
      "name": "Convenient Horses v1_0 to 3_0_RC3 Pack",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2006",
      "fileName": "Convenient Horses v1_0 to 3_0_RC3 Pack-14950-.zip",
      "uploadedUnix": "1339615055",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0268e2c7b484a8fcc0b9ba5904eef48f16101755f08771fcfa0b68f18a13b640/analysis/1406957106/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v1_0%20to%203_0_RC3%20Pack-14950-.zip?fid=67814&ttl=1535778948&ri=8192&rs=8192&setec=fcea7bfb4df59c26c4143010379a5be8"
    },
    {
      "fileId": "67822",
      "name": "Convenient Horses v3_0",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "496",
      "fileName": "Convenient Horses v3_0-14950-3-0.zip",
      "uploadedUnix": "1339619517",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/c6b4c01280e62555ac71ade94b99ff91fe0eade2b289c8766638720739676647/analysis/1406957224/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v3_0-14950-3-0.zip?fid=67822&ttl=1535778948&ri=8192&rs=8192&setec=3829ef896c4d82a7e0cd4c6c910e7b12"
    },
    {
      "fileId": "68924",
      "name": "Convenient Horses v3_1",
      "version": "3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23687",
      "fileName": "Convenient Horses v3_1-14950-3-1.zip",
      "uploadedUnix": "1340063625",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/6590fc0a2840ab2c397bd6db24542507f3864f3d7647e34db61c75380b3a22d8/analysis/1406968631/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v3_1-14950-3-1.zip?fid=68924&ttl=1535778949&ri=8192&rs=8192&setec=b07c6d923e4acdd99f125484bab901a1"
    },
    {
      "fileId": "69015",
      "name": "Convenient Horses v3_1 Armor Clipping Fix",
      "version": "3.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7500",
      "fileName": "Convenient Horses v3_1 Armor Clipping Fix-14950-3-1.zip",
      "uploadedUnix": "1340115730",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/568584a43299e447a78508856a793c71386fe196afc4ae5ab73d90b0871f2609/analysis/1406969711/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v3_1%20Armor%20Clipping%20Fix-14950-3-1.zip?fid=69015&ttl=1535778949&ri=8192&rs=8192&setec=a516af61cee42faa32511fb314b6ec2b"
    },
    {
      "fileId": "69019",
      "name": "Convenient Horses v3_1 Alternative Skin Textures",
      "version": "3.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7281",
      "fileName": "Convenient Horses v3_1 Alternative Skin Textures-14950-3-1.zip",
      "uploadedUnix": "1340116316",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/bd88b8af4c8c2ca56410c13387e2281874fea8854bcdbce9c3349f6c282131b0/analysis/1406969768/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v3_1%20Alternative%20Skin%20Textures-14950-3-1.zip?fid=69019&ttl=1535778950&ri=8192&rs=8192&setec=c016ad5ab747324afc9449af9b2ebfbf"
    },
    {
      "fileId": "71621",
      "name": "Convenient Horses v3_2_2",
      "version": "3.2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28169",
      "fileName": "Convenient Horses v3_2_2-14950-3-2-2.zip",
      "uploadedUnix": "1341221031",
      "modVersion": "3.2.2",
      "virusScanUrl": "https://www.virustotal.com/file/91248913d563c7bfd7231ce29db9eb292246b1ef7b3a9bce129264f02e936f37/analysis/1406996234/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v3_2_2-14950-3-2-2.zip?fid=71621&ttl=1535778950&ri=8192&rs=8192&setec=0305bdc6ebefd682cd719f4b71068817"
    },
    {
      "fileId": "74655",
      "name": "Convenient Horses v3_3",
      "version": "3.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28188",
      "fileName": "Convenient Horses v3_3-14950-3-3.zip",
      "uploadedUnix": "1342432185",
      "modVersion": "3.3",
      "virusScanUrl": "https://www.virustotal.com/file/709471c2e79f246a2bc507e8d39003feb0457e6635f514d66e78b31725452f27/analysis/1407025891/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v3_3-14950-3-3.zip?fid=74655&ttl=1535778951&ri=8192&rs=8192&setec=e370056f4769bf04829319ba1166bcc2"
    },
    {
      "fileId": "77135",
      "name": "Convenient Horses v3_3_1",
      "version": "3.3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28188",
      "fileName": "Convenient Horses v3_3_1-14950-3-3-1.zip",
      "uploadedUnix": "1343494501",
      "modVersion": "3.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/e728422e3bbeea3af5864da616b46d8d97374565327325ab4e9f5e649d0937a7/analysis/1407052212/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v3_3_1-14950-3-3-1.zip?fid=77135&ttl=1535778951&ri=8192&rs=8192&setec=9def63a7070afcb71452fbd4b2a0ea27"
    },
    {
      "fileId": "77602",
      "name": "Convenient Horses v3_3_2",
      "version": "3.3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28189",
      "fileName": "Convenient Horses v3_3_2-14950-3-3-2.zip",
      "uploadedUnix": "1343643513",
      "modVersion": "3.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/62986c9ac7d71038176d3d851cb1bea02dd5220f33da06b27565eea9df681ec2/analysis/1407057076/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v3_3_2-14950-3-3-2.zip?fid=77602&ttl=1535778952&ri=8192&rs=8192&setec=69ab4fffcf311a80722ba0f3ef50533b"
    },
    {
      "fileId": "79322",
      "name": "Convenient Horses v4_0 - Dawnguard",
      "version": "4.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28193",
      "fileName": "Convenient Horses v4_0 - Dawnguard-14950-4-0.zip",
      "uploadedUnix": "1344289165",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/924feb4f78d185479833bda24528e4d1a39e3555b3690a511194984be567def3/analysis/1407075324/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_0%20-%20Dawnguard-14950-4-0.zip?fid=79322&ttl=1535778952&ri=8192&rs=8192&setec=1d700a8679057492c0d5911f518c9825"
    },
    {
      "fileId": "80431",
      "name": "Convenient Horses v4_1 - Dawnguard",
      "version": "4.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "29287",
      "fileName": "Convenient Horses v4_1 - Dawnguard-14950-4-1.zip",
      "uploadedUnix": "1344633581",
      "modVersion": "4.1",
      "virusScanUrl": "https://www.virustotal.com/file/874f675193eb0e6099d91a0a1c0faafd8b16986c1876382d693f2837f75d104f/analysis/1407086130/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_1%20-%20Dawnguard-14950-4-1.zip?fid=80431&ttl=1535778953&ri=8192&rs=8192&setec=5bc9d93f89d80d1af9968401875b99b8"
    },
    {
      "fileId": "82993",
      "name": "Convenient Horses v4_2 - Dawnguard",
      "version": "4.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "29418",
      "fileName": "Convenient Horses v4_2 - Dawnguard-14950-4-2.zip",
      "uploadedUnix": "1345473476",
      "modVersion": "4.2",
      "virusScanUrl": "https://www.virustotal.com/file/2ff419c23d50ddb2c640bc9e84e5818c31e0eddfb1815b696542f81541d037ef/analysis/1407109935/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_2%20-%20Dawnguard-14950-4-2.zip?fid=82993&ttl=1535778953&ri=8192&rs=8192&setec=3b54a38329a4d648576222339b5c3d5c"
    },
    {
      "fileId": "83064",
      "name": "Convenient Horses v4_2 - Vanilla",
      "version": "4.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28195",
      "fileName": "Convenient Horses v4_2 - Vanilla-14950-4-2.zip",
      "uploadedUnix": "1345494579",
      "modVersion": "4.2",
      "virusScanUrl": "https://www.virustotal.com/file/81f6c859633205d647cfb354ad27d55027b6f02cec9ca0a69428852dfc462d99/analysis/1407110549/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_2%20-%20Vanilla-14950-4-2.zip?fid=83064&ttl=1535778954&ri=8192&rs=8192&setec=75c405de5c3c7c1046a49d1d475c93f1"
    },
    {
      "fileId": "83648",
      "name": "Convenient Horses - Unique Frost",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6138",
      "fileName": "Convenient Horses - Unique Frost-14950-.zip",
      "uploadedUnix": "1345717010",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7f0037179afe0df16df6ee935f381f98e15565b92511ea7464a3b634c78b0f77/analysis/1407116306/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20-%20Unique%20Frost-14950-.zip?fid=83648&ttl=1535778954&ri=8192&rs=8192&setec=aaeab03b5e50eaf57c8b80d7c6149a99"
    },
    {
      "fileId": "85700",
      "name": "Default Teammate Weapon Draw Distance",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "Default Teammate Weapon Draw Distance-14950-.zip",
      "uploadedUnix": "1346491948",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/25c32aaeac8b8f8d654f49b0b98852edebb70cdf0b6795f9027be43dfeb46ba1/analysis/1407137470/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Default%20Teammate%20Weapon%20Draw%20Distance-14950-.zip?fid=85700&ttl=1535778955&ri=8192&rs=8192&setec=f5734121036f83853e5a02b416ee6f23"
    },
    {
      "fileId": "86246",
      "name": "Convenient Horses v4_3 - Dawnguard",
      "version": "4.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "29202",
      "fileName": "Convenient Horses v4_3 - Dawnguard-14950-4-3.zip",
      "uploadedUnix": "1346695002",
      "modVersion": "4.3",
      "virusScanUrl": "https://www.virustotal.com/file/3d19138209c9132c59316af1a0e9d239933540ce54f9a625fea3bd47607e1bbb/analysis/1407143666/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_3%20-%20Dawnguard-14950-4-3.zip?fid=86246&ttl=1535778955&ri=8192&rs=8192&setec=13945f8cf8cb7c66434adfbd8a890d44"
    },
    {
      "fileId": "86247",
      "name": "Convenient Horses v4_3 - Vanilla",
      "version": "4.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "27978",
      "fileName": "Convenient Horses v4_3 - Vanilla-14950-4-3.zip",
      "uploadedUnix": "1346695432",
      "modVersion": "4.3",
      "virusScanUrl": "https://www.virustotal.com/file/d872b90417d3e3bc294ee8ec1b7720e924208675d3a399dd9da5e0501328424d/analysis/1407143679/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_3%20-%20Vanilla-14950-4-3.zip?fid=86247&ttl=1535778956&ri=8192&rs=8192&setec=d8a7b2bb9dcc6285281a92311ae975b1"
    },
    {
      "fileId": "92362",
      "name": "Convenient Horses v4_4 - Dawnguard",
      "version": "4.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "27106",
      "fileName": "Convenient Horses v4_4 - Dawnguard-14950-4-4.zip",
      "uploadedUnix": "1349537549",
      "modVersion": "4.4",
      "virusScanUrl": "https://www.virustotal.com/file/79cc76996fd96d987bd0c3b6840583d2b67eaaa7dac983e87e2d7427e8b9cd17/analysis/1407206848/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_4%20-%20Dawnguard-14950-4-4.zip?fid=92362&ttl=1535778956&ri=8192&rs=8192&setec=0183c3f85bbe8e6134b928fb1c73ad72"
    },
    {
      "fileId": "92363",
      "name": "Convenient Horses v4_4 - Vanilla",
      "version": "4.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "26105",
      "fileName": "Convenient Horses v4_4 - Vanilla-14950-4-4.zip",
      "uploadedUnix": "1349537885",
      "modVersion": "4.4",
      "virusScanUrl": "https://www.virustotal.com/file/22be42066a575c0dae5fe8882e8b41f54eb134993f1ceb4028641bb5f8dc3100/analysis/1407206874/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_4%20-%20Vanilla-14950-4-4.zip?fid=92363&ttl=1535778957&ri=8192&rs=8192&setec=513399df02db17960e9a70e79fbef832"
    },
    {
      "fileId": "92536",
      "name": "Convenient Horses v4_4 - Horse Models",
      "version": "4.4",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "724",
      "fileName": "Convenient Horses v4_4 - Horse Models-14950-4-4.zip",
      "uploadedUnix": "1349602682",
      "modVersion": "4.4",
      "virusScanUrl": "https://www.virustotal.com/file/41543bd410072095f0511727aa6687033f06987ab39eb76aa0a81cb651f15d7c/analysis/1407207976/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_4%20-%20Horse%20Models-14950-4-4.zip?fid=92536&ttl=1535778957&ri=8192&rs=8192&setec=95cd1520a7f8c8534376c8a963375da8"
    },
    {
      "fileId": "100721",
      "name": "Convenient Horses v4_5",
      "version": "4.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "27988",
      "fileName": "Convenient Horses v4_5-14950-4-5.zip",
      "uploadedUnix": "1353432362",
      "modVersion": "4.5",
      "virusScanUrl": "https://www.virustotal.com/file/f57bb4b1b386c0cd96c71e6b2fd6d4b204ffcc211c1a3dce6def6247c977cb2c/analysis/1407271282/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_5-14950-4-5.zip?fid=100721&ttl=1535778958&ri=8192&rs=8192&setec=7686db3627aa0509768c6ffdc1a02965"
    },
    {
      "fileId": "103516",
      "name": "Convenient Horses - Faster Sprint",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8",
      "fileName": "Convenient Horses - Faster Sprint-14950-.zip",
      "uploadedUnix": "1354814500",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/8a9aed616cdc736bada9124894c36accf06c5f56dd202ff95d5f8e41df5010b5/analysis/1407293226/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20-%20Faster%20Sprint-14950-.zip?fid=103516&ttl=1535778958&ri=8192&rs=8192&setec=103454257ae6c741c9e9e264e265d485"
    },
    {
      "fileId": "1000007517",
      "name": "Convenient Horses v4_6",
      "version": "4.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "27834",
      "fileName": "Convenient Horses v4_6-14950-4-6.zip",
      "uploadedUnix": "1360148714",
      "modVersion": "4.6",
      "virusScanUrl": "https://www.virustotal.com/file/d3c8f386fcdee94e0dcdeb8dc6155887631b95c78043289ce59bdccf1406865a/analysis/1407400323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_6-14950-4-6.zip?fid=1000007517&ttl=1535778958&ri=8192&rs=8192&setec=4e3d1cfc76984c14a2f56bd05840e8c5"
    },
    {
      "fileId": "1000033039",
      "name": "Convenient Horses v4_7",
      "version": "4.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28201",
      "fileName": "Convenient Horses v4_7-14950-4-7.zip",
      "uploadedUnix": "1370514532",
      "modVersion": "4.7",
      "virusScanUrl": "https://www.virustotal.com/file/5bf6c9566db2818414511f4be4deb57a40e6ccd821e77de542e7f731828276e7/analysis/1407594200/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_7-14950-4-7.zip?fid=1000033039&ttl=1535778959&ri=8192&rs=8192&setec=d0fa0210b83a7050ef570b2763619023"
    },
    {
      "fileId": "1000037527",
      "name": "Convenient Horses v4_7_1",
      "version": "4.7.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28202",
      "fileName": "Convenient Horses v4_7_1-14950-4-7-1.zip",
      "uploadedUnix": "1373127293",
      "modVersion": "4.7.1",
      "virusScanUrl": "https://www.virustotal.com/file/1f0c915165f1aa6d02fd653cfc3906d434f2eb9570d21553471ca95e9e6356d0/analysis/1407632980/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_7_1-14950-4-7-1.zip?fid=1000037527&ttl=1535778959&ri=8192&rs=8192&setec=60d0f5dce8d36df3ff073f222d2efee7"
    },
    {
      "fileId": "1000037925",
      "name": "Convenient Horses v4_7_2",
      "version": "4.7.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28203",
      "fileName": "Convenient Horses v4_7_2-14950-4-7-2.zip",
      "uploadedUnix": "1373316851",
      "modVersion": "4.7.2",
      "virusScanUrl": "https://www.virustotal.com/file/d611ce241a7f107b9821b6d2e52cfc3363ee696ac5f996cc66a8c6146405228a/analysis/1407635662/",
      "changelogHtml": " Fixed bug with advanced auto loot marking items as stolen. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_7_2-14950-4-7-2.zip?fid=1000037925&ttl=1535778960&ri=8192&rs=8192&setec=358764ef300697e71bcdf8406c6349b8"
    },
    {
      "fileId": "1000039069",
      "name": "Convenient Horses v4_7_3",
      "version": "4.7.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28201",
      "fileName": "Convenient Horses v4_7_3-14950-4-7-3.zip",
      "uploadedUnix": "1373904039",
      "modVersion": "4.7.3",
      "virusScanUrl": "https://www.virustotal.com/file/51ac4e885c9e1247478759eebc63643d1a7572d19ab864c0b70f317cd77dfd26/analysis/1407645192/",
      "changelogHtml": " Added basic support for Falskaar mod.\r<br />\r<br />New dialogue topic for followers: \"You seem to be stuck on the horse.\". It will instantly reload follower 3D which fixes the common animation behavior problems. Use it when follower cannot dismount or is misplaced. Dialogue will not appear if follower is dismounted or in combat. You can also activate follower&#39;s horse to talk to the mounted follower, which is useful in case of misplacement.\r<br />\r<br />Configuration power is now hidden by default.\r<br />\r<br />Fixed bug where learn whistle dialogue would not show if horse tracking has been disabled in config. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_7_3-14950-4-7-3.zip?fid=1000039069&ttl=1535778960&ri=8192&rs=8192&setec=4e37e266f8d0b70116744d3b4947604b"
    },
    {
      "fileId": "1000051621",
      "name": "Convenient Horses v4_8",
      "version": "4.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "38293",
      "fileName": "Convenient Horses v4_8-14950-4-8.zip",
      "uploadedUnix": "1378111473",
      "modVersion": "4.8",
      "virusScanUrl": "https://www.virustotal.com/file/5e14d4caf024537ba2962bd22ed982adab5a3d2d1bb66aacdd1072acc5131265/analysis/1407705994/",
      "changelogHtml": " Added Elthrai and Sethai horse armors by gechbal. <br/> \n Added support for Interesting NPCs mod. <br/> \n Added basic support for Wyrmstooth mod. <br/> \n Removed auto horse inventory recovery on horse death. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_8-14950-4-8.zip?fid=1000051621&ttl=1535778961&ri=8192&rs=8192&setec=48a32ca507490ef98beeff4bbc7688db"
    },
    {
      "fileId": "1000062960",
      "name": "Convenient Horses v4_9",
      "version": "4.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40102",
      "fileName": "Convenient Horses v4_9-14950-4-9.zip",
      "uploadedUnix": "1381167899",
      "modVersion": "4.9",
      "virusScanUrl": "https://www.virustotal.com/file/08819ab22cb35a9cee7302ef3deba55e4b9f5f9bab6af6623eda5963b6e038a6/analysis/1407749016/",
      "changelogHtml": " Added optional horse inventory weight limit. Mod will still use good old container for unlimited storage but... if using weight limit then all items will be transfered from that container to a temporary actor when accessing inventory and then transfered back when inventory menu is closed. This item transfer is instant and transparent to the player. It has to be done because it is not safe to keep items stored on an actor but there is no other way to limit the weight and have that information relayed to UI. Item ownership is preserved but not displayed when browsing actor&#39;s inventory. Other features that are directly related to horse inventory (auto loot stash and quick inventory transfer) will still work the same by dealing with main container directly which means that weight limit will only have effect when manually transfering items (UI will grey-out items in your inventory if there is not enough storage capacity for their weight). You can always access the container directly via quick transfer menu and for clarification \"Horse Sack\" container now has a new name \"Large Horse Sack\" while temporary actor&#39;s inventory will show as a \"Small Horse Sack\".\r<br />\r<br />Added whistle quest override option (available through MCM config only). It can suspend whistle learning quest and grant horse whistle power but will do nothing if learning quest has already been completed.\r<br />\r<br />Added full support for SkyTEST mod. When updating faction relations SkyTEST custom factions will be included. SkyTEST horse models updated to support dynamic mane and CH must be loaded after SkyTEST for this to work.\r<br />\r<br />Added factions from Falskaar and Wyrmstooth mods.\r<br />\r<br />Faction relation update now triggers automatically if new factions from supported mods/DLCs are detected on game load. Due to this change everyone who update CH to v4.9 will have their faction relations updated to friendly.\r<br />\r<br />Turning off \"disable horse tracking\" option will now restore last ridden horse without the need of mounting.\r<br />\r<br />Fixed advanced auto loot leaving all items unequipped on dead actors.\r<br />\r<br />Fixed followers being stuck on the horse if they were using a torch. This is a game bug and to prevent it all torches are removed from followers when mounting and given back when they dismount. Does not work with custom carriable lights. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v4_9-14950-4-9.zip?fid=1000062960&ttl=1535778961&ri=8192&rs=8192&setec=f84bd02c3c63a2b5fc738f5416b213ce"
    },
    {
      "fileId": "1000087178",
      "name": "Convenient Horses v5_0",
      "version": "5.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "53246",
      "fileName": "Convenient Horses v5_0-14950-5-0.zip",
      "uploadedUnix": "1387304076",
      "modVersion": "5.0",
      "virusScanUrl": "https://www.virustotal.com/file/03ee17aa9b24b790962ea2c7ed8c8f9e6c5458dc3f751282198a18337ab2fc0e/analysis/1407846670/",
      "changelogHtml": " Added more horse equipment options. New saddles available that are my own interpretation of ones from More Saddles mod. Even though they are not the same meshes they share the same file path and names so it is possible to easily replace them with meshes from original mod. Includes all existing game saddles and bareback option. Old armor meshes have been smoothed and few shaders corrected.\r<br />\r<br />Redesigned horse charge. It is now much more responsive and should knock targets as soon as sprinting starts. Customizable SFX, damage, stamina cost and physics simulator parameters (heading angle tolerance, heading force dissipation, push force amount, angle of elevation, speed penalty). Simulator parameters can be configured individually in MCM only or anyone can use one of 5 available presets.\r<br />\r<br />Added support for latest version of Ultimate Follower Overhaul mod.\r<br />\r<br />Added missing crafting materials from Danwguard and HearthFires to quick transfer blacksmithing list.\r<br />\r<br />Removed bound key mode gamepad limitation. Gamepad keys can be configured through MCM only.\r<br />\r<br />Fixed crash that was caused by dynamic speed feature on followers&#39; horses which was producing invalid horse speed values. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20v5_0-14950-5-0.zip?fid=1000087178&ttl=1535778962&ri=8192&rs=8192&setec=9f561e8093cf993a64259d1d8883e78c"
    }
  ]
}