{
  "modId": 14976.0,
  "modName": "Atlas Map Markers for Skyrim Blackreach Dawnguard and Dragonborn",
  "summary": "FEATURES Over 700 new map markers to discover, 470 Skyrim + 130 Dawnguard + 80 Dragonborn + 26 Blackreach&#33; Shrines, Shops, Dungeon Exits, Innkeepers, Important Places, Ore Mines, Farms, Wilderness, Lost Books, Khajiit Caravans, Player Homes, Temples, Treasure Map Loot, Waterways, Markets, Lumber Mills, Dragon Mounds, Easter Eggs, Secrets ",
  "descriptionHtml": "[center][b][heading][color=#ecdc60][size=3]Explore Like Never Before&#33;[/size][/color][/heading][/b]\r<br />[color=#dd7826][b]Donation Thank You[/b][/color]\r<br />Chris D \r<br />John N\r<br />\r<br />Please ENDORSE if you like this mod.[/center]\r<br />\r<br />============================================================================================================================\r<br />FEATURES - OVER 700 NEW MAP MARKERS FOR EXISTING LOCATIONS\r<br />============================================================================================================================\r<br />\r<br />[*]Over 470 locations in Skyrim. Discover hard to find Skill Books, Camps, Dungeon Exits and Places of Importance and more.\r<br />[*]Over 130 locations for Dawnguard with world maps of Soul Cairn and Forgotten Vale and you can fast travel in both areas. \r<br />[*]Over 25 locations in Blackreach with a world map and fast travel in the area\r<br />[*]Over 80 locations for Dragonborn. Includes Gem Geodes.\r<br />[*]The Official Prima Skyrim Legendary Game Guide was the primary resource of information, Lore friendly location names.\r<br />[*]All locations are enabled and ready to discover by default. (see the lists below)\r<br />[*]Locations can be configured using the setup guides found in the Riverwood Trader, Millions of possible combinations.\r<br />[*]Locations can be displayed as Default, Undiscovered, Discovered or they can be Removed.\r<br />[*]Each location will appear on the compass when you are within range of it like normal.\r<br />[*]20 quest related locations (in bold) that only appear when Skyrim calls for it.\r<br />[*]All ore mines have their ore type inserted into the mine names. Example...Gloombound Ebony Mine.\r<br />[*]Adds hours of extra game play for Skyrim adventurers by marking some of the most unique locations in Skyrim.\r<br />[*]Discover treasure map loot, shrines, unique items, wilderness loot, farms, caves, ore mines and so much more.\r<br />[*]Optional Support Mods including map menus with smaller, evenly sized icons, Special version for SkyUI users.\r<br />[*]New Legendary version that combines the 5 core Atlas mods together into One ESP file.\r<br />[*]All files are stand alone mods, they are not dependent on each other.\r<br />\r<br />\r<br />============================================================================================================================\r<br />DESCRIPTION\r<br />============================================================================================================================\r<br />Exploration is a huge part of Skyrim and there are many locations that can be hard to find and easy to miss. These mods\r<br />help by adding map markers to hundreds of locations. I only added the map markers to these areas. All areas are part of\r<br />the standard game and the DLC&#39;s. It will help you find treasure maps, shrines, dragon mounds, campsites, animal dens,\r<br />burial sites, skill books and lots of unique locations scattered across Skyrim. None of these locations are inside,\r<br />they are all outside in the open world. It will not add the icons to the map until you discover each location.\r<br />\r<br />\r<br />============================================================================================================================\r<br />SETUP GUIDES\r<br />============================================================================================================================\r<br />Use the Setup Guides to further customize your experience by adding or removing extra locations. You can modify\r<br />locations individually, in groups or All in One. They are all optional, you choose what you want. Setup Guides are on\r<br />the fireplace mantle in the Riverwood Trader in Riverwood. Locations have been grouped into different category types\r<br />for easier selection. Extra locations are NOT listed in the official guide as Primary or Secondary Locations, they are\r<br />included for your convenience. The scripts are for the setup guides only and run when the guide is active and then it\r<br />terminates. It does not run in the background or store any settings.\r<br />\r<br />\r<br />[color=#69622a]==================================================================================================================================================[/color]\r<br />[color=#ecdc60][b]ATLAS MAP MARKERS v1.7[/b][/color][color=#69622a] - Core mod - May 16 2014[/color]\r<br />[color=#69622a]===================================================================================================================================================[/color]  [color=#ddd48d][list][*]474 new map markers added\r<br />[*]Requires Skyrim v1.9.32\r<br />[*]Everything is enabled except Faction Camps and Treasure Map Loot\r<br />[*]Locations can be configured using the setup guide in the Riverwood Trader\r<br />[*]Keyed shortcut into the Ragged Flagon that bypasses one load screen\r<br />[*]The Riverwood Trader is enabled to allow faster access to the Setup Guides\r<br />[/list][/color][color=#69622a]Per Hold = Haafingar(x8), Hjaalmarch(x19), Winterhold(x23), The Pale(x17), The Reach(x28), Whiterun(x24), Eastmarch(x21), Falkreath(x36), The Rift(x26)[/color][color=#ecdc60][SECONDARY x202][/color]Clam Digger&#39;s Camp, Dwarven Rubble, Mistwatch Folly, Treasure Hunter&#39;s Camp, Hunter&#39;s Camp(x11[b]+2[/b]), Bandit Camp(x4), Forsworn Ambush Camp, Hunter&#39;s Overlook, Treasure Island, Juliano&#39;s Fallen, Spider Trap, Expired Alchemist, Howling Wolf&#39;s Folly, Dwarven Arch, Mournful Giant, Wolf Den, Puzzling Pillar Ruins, Ruined Troll and Wispmother&#39;s Well, Pinemoon Bear Lair, Incautious Bather, Yisra&#39;s Beachside Combustion, Barnacle Boat, Wayward Peak Summit, Sabre Cat&#39;s Lair, A Bandit&#39;s Book, The Iceberg Explorer, Medresi&#39;s Camp, Pincushion Peter, Dwarven Rubble, Bandit&#39;s Hovel, [b]Khajiit Caravan Massacare[/b], Windhelm Attack Camp, Nordic Burial Ruins, Forsworn Camp(x3), Toadstool Ring, Frozen Mammoth, Bandit&#39;s Shack, Solitude Attack Camp, Bloodied Bandit, Wet Bones, Northwind Chest, Wild Animal Den(x6[b]+1[/b]), [b]The Mauled Refugees[/b], Skeleton&#39;s Strong Box, Dead Mammoth, Karth River Henge, A Peddler&#39;s Misfortune, Dwarven Monument, Altar in the Woods, Mammoth Graveyard, Hunter and Hunted, Riverside Bandit Camp, Lair of the Wispmother, Toppled Tower, The Headless Skeleton, Sabre Cat Ravine, Burning Caravan, Swallowed Skeleton, Lucky Lorenz&#39;s Shack, Big Log Bridge, Ambushed Caravan, Totem to the Dragon, Altar of Xrib, Troll Den, Necromancer&#39;s Bluff, Bloodied Box, Adventurer&#39;s Campsite, Exposed Miner, Fisherman&#39;s Camp(x2), The Chill, Sabre Cat Rock, Hagraven Camp, Sunken Fishing Boat, Trapped for Eternity, King of the Mudcrabs, Dwarven Rubble, Dark Elf&#39;s Grave, Rundi&#39;s Mistake, Prospector&#39;s Shack, Swamp Pond Massacre, Alchemist&#39;s Camp, Cronvangr Summoning Altar, Trapper&#39;s Dilemma, The Poultry Reanimator, Smuggler&#39;s Alcove, Brush Strongbox, Haul of the Horkers, Miner&#39;s Camp, Draugr Burial Mound, Lost Treasure, Sacrificial Altar, The Three Sentinels, A Bloody Trail, Fetid Pond, Summoning Stones, Bear Cave, Horker Standing Stones, Hunter&#39;s Last Stand,  Mara&#39;s Eye Stones, The Silvermoon, Ill-Gotten Gains, Tumbledown Tower, [b]Lover&#39;s Camp[/b], Cradle Stong Crag, Ghost Barrow, Seven Thousand Steps, Reachman&#39;s Altar, Nordic Burial Grove, Burning Farmhouse, Collapsed Burial Mound, Fisherman&#39;s Island, The Conjuror&#39;s Altar, Avalanche Pass, Frost Troll Den(x3), Witchmist Sulphur Pool, Black Arts Burial, River Rapids Treasure Chest, Sunken Barrow, Darkwater Overhang, Two Pine Ridge, Reachwind Burial Mound, The Indigestible Emerald, Lad of the Lake, Shoreline Lover&#39;s Tent, Juniper Tree Ruins, Bandit Bridge, Riverwood Folly, Smuggler&#39;s Den, Shoreline Bandit Camp, Conjuror&#39;s Caravan, Whiterun Attack Camp, Wood Cutter&#39;s Camp, Sunken Treasures, Shrines(x20[b]+1[/b]) and Dragon Mounds(x22)\r<br />\r<br />[color=#ecdc60][EXTRAS x272][/color]\r<br />[color=#ddd48d](x38)Dungeon Exits - Alternate ways into dungeons[/color] - Volskygge Peak, Ysgamors Tomb, Ironbind Barrow, [b]Stillborn Cave[/b], Snow Veil Sanctum, Yngol Barrow, Mzinchaleft Gatehouse, Mzulft Aedome, Darkwater Pass, Ilinaltas Deluge, Bleak Falls Sanctum, Trevas Watch Escape Tunnel, White River Watch, Haemars Shame, Bthardamz, Forelhost Balcony, Labyrinthian Tribune, Raldbthar, Jophet&#39;s Folly Sea Cave, Helgen Escape Tunnel, Robbers Cove, Blind Cliff Bastion, Abandoned Cave, Greenwall Cave, Halted Stream Pit, Abandoned Prison, Reeking Cave, Rannveigs Fast, Alftand Ruined Tower, Dwarven Storeroom, Fort Snowhawk, Embershard Mine, Fort Neugrad, Fort Sunguard, Potema&#39;s Secluded Chamber, Shreikwind Overlook, Solitude Arch, Fort Sungard Bloody Pit\r<br />[color=#ddd48d](x11)Farms - Find useful crops to pick[/color] - Cowflop, Lemkil&#39;s, Fellstar, Lylvieve&#39;s, Mor Khazgur, Riverwood, Kynesgrove, Corpselight, Skulvar&#39;s, Narzulbur, Dushnikh Yal\r<br />[color=#ddd48d](x6)Halls of the Dead - Temples for the deceased[/color] - Falkreath, Windhelm, Whiterun, Markarth, Solitude, Riften\r<br />[color=#ddd48d](x15)Innkeepers - Places to eat, drink and rest[/color] - Vilemyr, Dead Mans Drink, Winking Skeever, Four Sheilds Tavern, Moorside Inn, Windpeak Inn, Frozenhearth, Silver-Blood Inn, Bannered Mare, Frostfruit Inn, Sleeping Giant Inn, Candlehearth Hall, Braidwood Inn, Bee and Barb, Haelga&#39;s Bunkhouse\r<br />[color=#ddd48d](x6)Khajiit Caravan Campsites - Buy, sell and fence your goods[/color] - Ri&#39;saad&#39;s Campsites(x2), Ah&#39;kari&#39;s Campsites(x2), Ma&#39;dran&#39;s Campsites(x2)\r<br />[color=#ddd48d](x19)Lost Skill Books - Hard to find skill books[/color] - Summit Stash, Birch Book, Cliffside Seclusion, Cold Meditation, Fallen Tree, Hollow Find, Island Knowledge, Left Behind, Lost in the Maze, Miners Loss, Mountain Supplies, Peak Plunder, Roadside Ruins, Runaway Cart, Scenic Tower, Steamed Goods, Stumped, Surplus Goods, Tiny Alcove, Log of Learning, Summit Stash\r<br />[color=#ddd48d](x6)Lumber Mills - Get wood&#33;[/color] - Riverwood, Dragon Bridge, Marshdeep, Deadwood, Temba Wide-Arm&#39;s, Markarth Mill and Forge\r<br />[color=#ddd48d](x4)City Market Districts - Many shopkeepers in one area[/color] - Whiterun, Riften, Windhelm, Solitude\r<br />[color=#ddd48d](x14)Underground Ore Mines - Find precious metals[/color] - Iron-Breaker, [b]Redbelly[/b], Mor Khazgur, Steamscorch, Quicksilver, Cidhna, Fenn&#39;s Gulch, Sanuarach, Dushnikh, Fort Fellhammer, Goldenrock, Rockwallow, Halted Stream, [b]Knifepoint[/b]\r<br />[color=#ddd48d](x36)Places of Importance - Major structures and useful places[/color] - Jorrvaskr, Cult of the Dragon Priests, Castle Dour, Bards College, Windhelm Docks, Skyforge, Jarls Longhouse(x2), The White Hall, New Gnisis Cornerclub, Plankside, Hall of Elements, Falions House, Silus Vesuius House, Northstar Port, Dwarven Convector, Honorhall Orphanage, Goldenglow Estate Sewer, Ragged Flagon Abandoned Sewer, Dwarven Storeroom, Shalidor&#39;s Maze, [b]Skuldafn[/b], Treasury House, Dawnstar Lighthouse, Great Porch, Halls of Attainment and Countenance, Arch-Mage Quarters, Calixto&#39;s House of Curiosities, Lod&#39;s Blacksmithing\r<br />Penitus Oculatus Outpost, Thalmor Headquarters, [b]Kilkreath Ruins[/b], Alvors Blacksmithing, [b]Dawnstar Sanctuary[/b], Rustleif&#39;s Blacksmithing\r<br />[color=#ddd48d](x5)Player Homes - Thane rewards that can be purchased[/color] - Breezehome, Hjerim, Proudspire Manor, Vlindrel Hall, Honeyside\r<br />[color=#ddd48d](x23)Shopkeepers - Buy and sell goods[/color] - Warmaidens, Riverwood Trader, Grey Pine Goods, Grave Concoctions, Thaumaturist&#39;s Hut, Birnas Oddments, Sadri&#39;s Used Wares, Hag&#39;s Cure, Mortar and Pestle, Elgrims Elixirs, Drunken Huntsman, Angeline&#39;s Aromatics, Arcadia&#39;s Cauldron, Arnleif and Sons Trading Company, The White Phial, Belethor&#39;s General Goods, Blacksmith Quarters, Fletcher Fihada, Pawned Prawn, Radiant Raiment, The Scorched Hammer, Solitude Blacksmith, Bits and Pieces\r<br />[color=#ddd48d](x17)Shrines[/color] - 7000 Steps Emblems(x10), Akray, Dibella, [b]Mara, Akatosh[/b], Talos(x3)\r<br />[color=#ddd48d](x5)Temples of the Gods[/color] - Mara, Dibella, The Divines, Kynareth, Talos\r<br />[color=#ddd48d](x11)Treasure Map Loot - Find any map location[/color] - All 11 Treasure Map loot locations and key\r<br />[color=#ddd48d](x11)Waterways - Bodies of water[/color] - Darkwater River, Karth River, Lake Geir, Lake Honrich, Lake Ilinalta, Lake Yorgrim, River Hjaal, River Yorgrim, White River, Sea of Ghosts, Treva River\r<br />[color=#ddd48d](x45)Wilderness - Small structures, loot and other oddities[/color] - Morthal Cemetery, Cliffside Hunter Camp, Arcwind Ruins, Arcwind Barrow, Arcwind Altar, Forgotten Stash, Pirates Wreckage, Hunters Camp, Lost to the Current, Forgotten Pirate, Old Homestead, Truis Camp, Offering Altar, Top of the World, [b]Lost Load[/b], Land Grab , Three Billy Goats Gruff, Toadstool Ring, Dragon Feeding Grounds, Ennodius&#39;s Camp, Bandit Thief, Bounty Island, Misty Goods, Nimble Gains, Trolls Loss, River Luck, Wet Plunder, Ruined Henge, Lucky Log, Stone Goods, River Loot, Sulphur Stash, Pillar Gains, Crossroads Cart, Corner Stash, Capsized, Swept Away, Waterfall Alcove, Woods Cutters Loss, Archers Perch, Wild Animal Den, Northern Henge, Standing Stone Ruins, Sacked Bandit, [b]War Camp, Imperial Shipment, Stormcloak Shipment[/b]\r<br />\r<br />[color=#ecdc60][SETUP GUIDE OPTIONS x7][/color]\r<br />Show Secondary, Show Civil War Camps(x16), Show Treasure Map Loot(x11), Obtain a key to the Abandoned Sewer, Fix for Dawnguard, Fix for Unofficial Skyrim Patch, Fix for Dragonborn \r<br />\r<br />[color=#69622a]===================================================================================================================================================[/color]\r<br />[color=#ecdc60][b]ATLAS BLACKREACH v1.0[/b][/color][color=#69622a] - Core mod - Jan 20 2013[/color]\r<br />[color=#69622a]===================================================================================================================================================[/color][color=#ddd48d][list][*]26 new map markers added\r<br />[*]Requires Skyrim v1.9.32\r<br />[*]Includes a Blackreach world map with fast travel\r<br />[*]All locations are ready to discover, there is no setup guide\r<br />[/list][/color][color=#69622a]Per Hold = Blackreach(x26)[/color][color=#ecdc60]\r<br />[PRIMARY x6][/color]\r<br />Great Lifts of Alftand, Raldbthar and Mzinchaleft, Mzinchaleft Gatehouse, Raldbthar Deep Market, Alftand Cathedral\r<br />\r<br />[color=#ecdc60][SECONDARY x20][/color]\r<br />Reeking Tower, Sinderion&#39;s Field Laboratory, Silent Ruin, Hall of Rumination, Pumping Station, Debate Hall, Silent City Catacombs, War Quarters, Farm Overseer&#39;s House, Tower of Mzark, Derelict Pumphouse, Wispmother&#39;s Dark Plunder, Dwarven Shrine, Troll Den, Falmer Mining Camp, Vulthuryol&#39;s Gong, Blackreach Arena, Reeking Tower Overlook, Hall of Rumination Balcony\r<br />\r<br />[color=#69622a]===================================================================================================================================================[/color]\r<br />[color=#ecdc60][b]ATLAS DAWNGUARD v1.3[/b][/color][color=#69622a] - Core mod - May 16 2014[/color]\r<br />[color=#69622a]===================================================================================================================================================[/color]\r<br />[list][color=#ddd48d][*]134 new map markers added\r<br />[*]Requires Skyrim v1.9.32 and the Dawnguard DLC\r<br />[*]Includes Forgotten Vale and Soul Cairn world maps with fast travel\r<br />[*]Everything is enabled except Wilderness Caches\r<br />[*]Locations can be configured using the setup guide in the Riverwood Trader\r<br />[*]Primary locations are always enabled and can not be changed\r<br />[*]Per Hold = Soul Cairn(x56), Forgotten Vale(x67), Skyrim(x11)\r<br />[/color][/list][color=#ecdc60][PRIMARY x14][/color]Falmer Warmonger, Portal to Volkihar Ruins, The Boneyard, Tabernacle of the Ideal Masters, The Shriveled Forest, The Floating Citadel, Portal to Darkfall Passage, Wayshrine of Sight, Wayshrine of Learning, Wayshrine of Resolution, Glacial Crevice, Wayshrine of Radiance, Inner Sanctum Entrance, Falmer Temple, Auriel&#39;s Chapel\r<br />\r<br />[color=#ecdc60][SECONDARY x106][/color]\r<br />Path of Souls, The Black Chapel, Mournful Soul, Black Church, Arvak&#39;s Rider, Barrier Wall, Black Gatehouse, Crystal Folly, Durnehviirs Rooftop,Steps of the Barrier Wall South, Totem to the Ideal Masters, Heavens Arc Point, Black Sanctuary, Black Monastery,Black Gatehouse(x4), Black Folly, Lost Structure, Black Bethel, Dark Battlements(x3), Black Mausoleum, Cemetery Gatehouse(x5), Cemetery Altar, The Soul Husk Merchant, Black Temple, Black Minster, Steps of the Barrier Wall North, Black Rectory, Heavens Wand Point, Keepers Chapel, Boneyard Citadel, Soul Pool Camp, Husk Pasture, Keepers Altar, Reapers Lair, Unwary Adventurer, Black Cloister, Soul Pool Fountain, St Jiub the Eradicator, Obsidian Hall, Arvak&#39;s Altar, Black Tower, Foundation Altar, Pilgrims Path, Sabre Cat Lair, Frost Troll Den(x2), Auriels Lookout, Ruby Dragon Portal, The Heavy Chest, Forgotten Vale Cave, Frost Spider Attack, Sprawled Skeleton, Ice Falls Alcove(x2), Waterfall to Darkfall Grotto, Upper Fissure Walls, Snow Path to Frozen Lake, Snowbound Skeletons, Emerald Paragon Portal, Forgotten Vale Overlook, Waterfall Chest, Frozen Lakeshore, The Frozen Lake, Word Wall, Pilgrims Path, Frost Giant Lair(x4), Paragon Portal Platform, Natural Bridge, Fissure Ledges, Falmer Camp, Falmer Camp and Graveyard, Natural Fissure Bridge, Mining Remains, Sharpslope Cave Upper and Lower, Steep Slope,  Falmer Village(x2), Natural Bridges, Falmer Hut, Fledgling Nest, Frozen Lake Ridge, Entrance to Glacial Crevice, Glacial Crevice Exit, Southwest Vale Scar, Overexuberant Ore Extractor, Falmer Fissure Village(x3), Fissure Tunnel West and East, Wayshrine Falmer Camp, Bridge to Inner Sanctum\r<br />\r<br />[color=#ecdc60][EXTRAS x14][/color] - Dayspring Canyon, Ferryman Gort, Ferryman Jolf, Mossy Glen Cave East & West, Ruined Docks, Dimhallow Cavern, [b]Refugee Camp[/b], Ruunvald Temple, Sunken Shipwreck, Icy Swim, Volkihar Courtyard, Bone Pile, Snow Lake\r<br />\r<br />[color=#ecdc60][SETUP GUIDE OPTIONS x3][/color]\r<br />Show Secondary, Show new Forgotten Vale/Skyrim map markers(x2), Show Wilderness Caches(x9)\r<br />\r<br />[color=#69622a]===================================================================================================================================================[/color]\r<br />[color=#ecdc60][b]ATLAS DRAGONBORN v1.1[/b][/color][color=#69622a] - Core mod - May 16 2014[/color]\r<br />[color=#69622a]===================================================================================================================================================[/color]\r<br />[list][color=#ddd48d][*]85 new map markers added\r<br />[*]Requires Skyrim v1.9.32 and the Dragonborn DLC\r<br />[*]Everything is enabled except Gem Geodes and Hidden Peaks\r<br />[*]Locations can be configured using the Setup Guide in the Riverwood Trader\r<br />[*]Per Hold = Solstheim(x84), Skyrim(x1)\r<br />[/color][/list][color=#ecdc60][SECONDARY x40][/color]\r<br />Spiky Grass Island, The Ever-Abandoned Ship, Waterfall and Grazing Netch, Mudcrab Tidal Pool, Riekling Chest,The Fisherman&#39;s Haul, Reikling Barrel Hoard, Horker Iceberg, White Ridge Barrow Hut, Forgotten Spoils, Desolate Hunter&#39;s Camp, Shrine of Zenithar, Dragon Mound(x2), Giant Nirnroot Island, Reikling Outpost Island, Lurker Ambush(x3), [b]Temple of Miraak Secret Exit[/b], Driftwood Isle, Isle of Basalt, Reavers Folly, [b]Bloodskal Corpse[/b], Shrine of Kynareth, Condcinder Cave Exit, Miners Lament, Spider Nest(x2), Hrodulf&#39;s Last Stand, Gold Miners Floodgate, Dunmeri Camp, Spriggan Grove, Ashfallow Reaver Camp, Impact Crater(x2), Bloodied Grave, Dusty the Silt Rider, Basalt Causeway, Miner Immolation\r<br />\r<br />[color=#ecdc60][EXTRAS x38][/color]\r<br />Coldcinder Cave, Fahlbthar Grand Hall, White Ridge Sanctum, Oslaf&#39;s Garden, Severin Manor, The Retching Netch, Great Hall, Raven Rock Mine, Northern Maiden(x2), Shamans Hut, Tel Mithryn Kitchen, Tel Mithryn Steward, Telvanni Wizards Tower, Alor&#39;s House, Glover the Blacksmith, Ienth&#39;s Farm, Baldour the Blacksmith, Tel Mithryn Apothecary, Daedric Temple, Harstrad River, Iggnir River, Islid River, Lake Fjalding, Damp Chest, Docked Wreckage, Dragon Offerings, Sunken Boat, Sunken Chest, Dead Explorer, Expired Riekling, Explorer Remains, Feast of the Hoppers, Hillside Gains, Missing Cargo, Shoreline Massacre, Slippery Slope, Tel Mithryn Graveyard, Waterfall Chest, Wild Plunder\r<br />\r<br />[color=#ecdc60][SETUP GUIDE OPTIONS x3][/color]\r<br />Show Secondary, Show Gem Geodes(x7), Show Hidden Peaks(x4)\r<br />\r<br />[color=#69622a]===================================================================================================================================================[/color]\r<br />[color=#ecdc60][b]ATLAS HEARTHFIRE v1.0[/b][/color][color=#69622a] - Core mod - Dec 09 2012[/color]\r<br />[color=#69622a]===================================================================================================================================================[/color]\r<br />[color=#ddd48d][list][*]Requires Skyrim v1.9.32 and the Hearthfire DLC\r<br />[*]Changes the player built home icons to match all other player homes from Atlas Map Markers\r<br />[/list][/color]\r<br />\r<br />[color=#184c17]===================================================================================================================================================[/color]\r<br />[color=#4ec74b][b]OPTIONAL SUPPORT MODS[/b][/color]\r<br />[color=#184c17]===================================================================================================================================================[/color]\r<br />[color=#4ec74b]ATLAS LEGENDARY v1.0[/color][list][*]Requires Skyrim v1.9.32, Dawnguard DLC, Hearthfire DLC, and the Dragonborn DLC\r<br />[*]Combines Atlas Map Markers, Atlas Blackreach, Atlas Dawnguard, Atlas Hearthfire and Atlas Dragonborn into one ESP file\r<br />[*]Locations can be configured using the Setup Guides in the Riverwood Trader\r<br />[/list][color=#4ec74b]ATLAS COMPASS TWEAKS v1.0[/color][list][*]Requires Skyrim v1.9.32\r<br />[*]Makes minor changes to the default compass to reduce the clutter. Increased fading by 50%, Decreased Range by 25%, Reduced icon size by about 30%.\r<br />[/list][color=#4ec74b]ATLAS MAP FOR SKYUI v1.0[/color][list][*]Requires Skyrim v1.9.32 and SkyUI v4.1\r<br />[*]This is a [u]Modified[/u] SkyUI map menu with smaller map icons\r<br />[*]Not compatible with other mods that want to change map.swf\r<br />[/list][color=#dd333b][list][b][*]If SkyUI is [u]not loaded[/u] during startup, Skyrim will crash(CTD) when loading the map\r<br />[/b][*][b]This is for SkyUI users only&#33;[/b]\r<br />[/list][/color][color=#4ec74b]ATLAS MAP DEFAULT COLORS v1.0[/color][list][*]Requires Skyrim v1.9.32\r<br />[*]Alternate map menu with evenly resized smaller icons, default colors, no bottom bar.\r<br />[*]Not compatible with other mods that want to change map.swf\r<br />[*]Not compatible with SkyUI&#39;s map search feature.\r<br />[*]To use with SkyUI, go to the SkyUI MCM Menu/Advanced/SWF Version Checking and untick the Map Menu option to disable the warning message.\r<br />[/list][color=#4ec74b]ATLAS MAP SOME COLORS v1.0[/color][list][*]Requires Skyrim v1.9.32\r<br />[*]Alternate map menu with evenly resized smaller icons, some colors, no bottom bar.\r<br />[*]Not compatible with other mods that want to change map.swf\r<br />[*]Not compatible with SkyUI&#39;s map search feature.\r<br />[*]To use with SkyUI, go to the SkyUI MCM Menu/Advanced/SWF Version Checking and untick the Map Menu option to disable the warning message.\r<br />[/list][color=#4ec74b]ATLAS OPEN CITIES v1.7[/color][list][*]Requires Skyrim v1.9.32 and Open Cities v1.05\r<br />[*]This is a modified version of Atlas Map Markers for the Open Cities mod\r<br />[*]This is for users of Open Cities only&#33;\r<br />[*]Read the Open Cities Notes below\r<br />[/list][color=#4ec74b]ATLAS LEGENDARY OCS v1.0[/color][list][*]Requires Skyrim v1.9.32, Open Cities v1.05, Dawnguard DLC, Hearthfire DLC, and Dragonborn DLC\r<br />[*]This is a modified version of Atlas Legendary for the Open Cities mod\r<br />[*]This is for users of Open Cities only&#33;\r<br />[/list][color=#4ec74b]ATLAS WORLD ENCOUNTERS v1.11[/color][list] [*]Requires Skyrim v1.9.32\r<br />[*]Adds a very simple onscreen message in the upper left when a World Encounter has been triggered. \r<br />[*]There are 95 possible Offical World Encounters in Skyrim. Even more if you have the DLC&#39;s.They can happen all over Skyrim and sometimes you may not even know it is taking place near you. Some are moving and some are static scenes. They could be in the direction you are heading as well. It will not tell you where to go, only that it is taking place because you set off the event.\r<br />[/list][color=#136067]===================================================================================================================================================[/color][color=#70c1c8][b]UPGRADING[/b][/color][color=#136067]===================================================================================================================================================[/color][list][*]Always backup your save games and INI files before trying new mods or edits.\r<br />[*]As of 1.7 almost all locations are enabled from the start. You will need to use the Setup Guide to reconfigure some locations.\r<br />[/list][color=#4db2bb]CORE ATLAS  MODS[/color][list][*]Just overwrite the old files and your done. Your current discoveries will not be effected.\r<br />[/list] [color=#4db2bb]CORE TO LEGENDARY[/color][list][*]Requires a new game or clean save free of Atlas mods\r<br />[*]Core mods and the optional Legendary version are not compatible\r<br />[/list][color=#4db2bb]HOW TO CREATE A CLEAN SAVE[/color]Load your game, and move to a location away from any map markers and outside of Riverwood Trader. Save and exit the game. Not quicksave. Deactivate any Atlas mods you installed and remove any ESPs from your Data folder and remove all Atlas scripts. Load the save you just created and save it again in a new slot. Install Legendary and enable in your mod manager. Load the save and play, you will need to rediscover all locations.[color=#136067]===================================================================================================================================================[/color][color=#70c1c8][b]INSTALLATION[/b][/color][color=#136067]===================================================================================================================================================[/color][color=#4db2bb]NEXUS MOD MANAGER[/color][list][*]Preferred method \r<br />[*]See Nexus Mod Manager Notes below\r<br />[/list][color=#4db2bb]MANUAL[/color][list][*]Copy the chosen .ESP files to your Skyrim/Data/ folder\r<br />[*]Copy the chosen .PEX files to your Skyrim/Data/Scripts/ folder\r<br />[*]Copy the chosen map.SWF file to your Skyrim/Data/Interface/Exported/ folder\r<br />[*]Overwrite all old files if asked.\r<br />[*]Make sure the EPS&#39;s are enabled in the launcher or mod manager. There is no load order\r<br />[/list][color=#136067]===================================================================================================================================================[/color][color=#70c1c8][b]COMPATIBILITY[/b][/color][color=#136067]===================================================================================================================================================[/color][list][*]These mods should work with most other HUD, quest or compass mods.\r<br />[*]They only add more map markers to the world map to discover.\r<br />[*]Mods that add map markers to the same locations are not advised.\r<br />[/list][color=#4db2bb]WORKS WITH THESE MODS[/color][list][*]A Quality World Map - With Roads by IcePenguin\r<br />[*]Warburgs 3D Paper World Map by Warburg (optional maps may conflict)\r<br />[*]Open Cities Skyrim by Arthmoor (use Atlas Open Cities)\r<br />[/list][color=#136067]===================================================================================================================================================[/color][color=#70c1c8][b]FAQ[/b][/color][color=#136067]===================================================================================================================================================[/color]Q..I have map markers for Blackreach, Soul Cairn or Forgotten Vale on the Skyrim world map.A..Move Atlas down in your load order. You have another mod that edits the world space.Q..Are you going to add MCM menusA..Maybe some day but right now the answer is NOQ..SkyUI gives me an error message when I use the maps with no bottom bars.A..These maps are Not compatible with SkyUI&#39;s map search feature. To use this with SkyUI, go to the SkyUI MCM Menu/Advanced/SWF Version Checking and untick the Map Menu option to disable the warning message.Q..When I open the setup guides, I don&#39;t see any menusA..Make sure you have the scripts properly installedQ..Can I use the modified SkyUI map without using the ESP files? I am using SkyUI.A..Yes. All Atlas files are stand alone mods and do not require any other Atlas file to function.Q..When I fast travel to a new location within a city, I end up in some weird world with no buildings.A..You installed the incorrect version for the Open Cities mod. Reinstall Atlas to fix.\r<br />[color=#136067]===================================================================================================================================================[/color]\r<br />[color=#70c1c8][b]NEXUS MOD MANAGER NOTES[/b][/color]\r<br />[color=#136067]===================================================================================================================================================[/color]\r<br />NMM is terrible with version numbers and will often tell people they need to update the mods when none are available. The only file that will always be correct is Atlas Map Markers. All of the other files will always show as needing an update unless they are the same version number. This is a problem with NMM, it does not check the versions of the files, only the mod version. As long as the version shown in the &#34;Name&#34; and &#34;Version&#34; columns is the same, you are fine. The &#34;Latest Version&#34; column will always show the version for the latest Atlas Map Markers only. When NMM asks to Upgrade, I select &#34;No&#34; then &#34;Yes to All&#34;. I don&#39;t use NMM and can only help so much with a tool I don&#39;t use.\r<br />\r<br />[color=#136067]===================================================================================================================================================[/color]\r<br />[color=#70c1c8][b]OPEN CITIES NOTES[/b][/color]\r<br />[color=#136067]===================================================================================================================================================[/color]\r<br />Both Atlas Map Markers(AMM) and Atlas Open Cities(AOC) share the same file name. This will allow you try or switch to AOC and not loose everything you had discovered. Only the locations within the 5 major cities will change. Just open up the Setup Guide and select the locations you want to repopulate the cities with. If you dont want to use AOC, you can switch back to AMM your discoveries will still be intact.\r<br />Existing Open Cities(OCS) users can just load AOC before OCS and begin exploring.\r<br />\r<br />[color=#136067]===================================================================================================================================================[/color]\r<br />[color=#70c1c8][b]MY OTHER SKYRIM MODS and SPECIAL THANKS[/b][/color]\r<br />[color=#136067]===================================================================================================================================================[/color]\r<br />[url=http://skyrim.nexusmods.com/mods/32413] Lower Workbench Hammer Sounds[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/32317] Lower Grindstone Sounds[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/32261] Lower Mining and Pickaxe Sounds[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/2345] Reduce Grass Density[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/15991] Vanity Camera Rotation Speed[/url]\r<br />\r<br />Thanks to Vicn for donating his world maps of Blackreach, Forgotten Vale and Soul Cairn\r<br />Thanks to 0z9x8c7v for all his work creating the first NMM installer for Atlas\r<br />Thanks to Schlangster for allowing me to modify his SkyUI map.swf\r<br />\r<br />[color=#70c1c8][b]If you like any authors mod, please support them and endorse it to keep the community alive, they deserve it. Thank You[/b][/color]",
  "categoryId": "42",
  "version": "1.7",
  "author": "Kronixx",
  "createdUnix": "1334204716",
  "updatedUnix": "1400280758",
  "containsAdultContent": false,
  "uploadedBy": "kronixx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000109324",
      "name": "Atlas Map Markers v1-7 Complete",
      "version": "1.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4043",
      "fileName": "Atlas Map Markers v1-7 Complete-14976-1-7.7z",
      "uploadedUnix": "1400280758",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/2404acc48d3223efc7896f4d6bbd7f0620c4149688c8a37f0890f82b8fe1652d/analysis/1408080032/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Atlas%20Map%20Markers%20v1-7%20Complete-14976-1-7.7z?fid=1000109324&ttl=1535778992&ri=8192&rs=8192&setec=a4836485ebb6a158140d00ab16ae584f"
    }
  ]
}