{
  "modId": 15033.0,
  "modName": "Avirkhalmn-Dwarven Fortress",
  "summary": "Reclaim the lost Dwarven stronghold of Avirkhalmn! Includes new recipes, explosive arrows, and a small sidequest to gain even more powerful artifacts, like the Amulet of Ysgramor!",
  "descriptionHtml": "DWARVEN FORTRESS\r\nby Abvxyzackattack\r\nVersion 1.0\r\nCategory: Abodes\r\n\r\n[img] http://static.skyrim.nexusmods.com/downloads/images/15033-1-1334380828.jpg [/img]\r\n\r\nOverview:\r\n\r\nAbout two months ago, I tried to release it, but it came with bad results, mostly the demand came in for more things. So I decided to revamp up the fortress even more, and make it twice as kickass! :D\r\n\r\nThis mod adds a large Dwarven Fortress east of Solitude that the player can use as a home, as well as a small optional quest you can go on to locate an ancient set of artifacts. \r\n\r\nIt is highly recommended not to fast travel to Avirkhalmn for the first time, as it will spawn you in the middle of a battlefield.\r\n\r\nTo reclaim Avirkhalmn, you need to fight your way through the Falmer and Dwemer automatons battling throughout the fortress. It is recommended to be above level 25 to try this battle, as the Dwemer automatons are very difficult, but tgm can work magic, can\\'t it? :)\r\n\r\nIf you want to start the mini-quest, head to the northeast of Avirkhalmn, and look for the research camp. The quest is relatively simple, but it does take a little bit of smarts to figure out where exactly the artifacts are.\r\n\r\n[img] http://skyrim.nexusmods.com/downloads/images/15033-1-1334422292.jpg [/img]\r\n\r\nHistory behind the Dwarven Fortress:\r\n\r\nAvirkhalmn was constructed around ME 50 by a Snow Elf named Azragael, in conjunction with Dwemer engineers like Kagrenac and Radac Stungnthumz. They studied the stars and even the Gods themselves as they created their mass array of technology. They even took in ancient Nordic scholars, who were interested in assisting and learning from them. Following the Dwemer dissapearance of 1E 700, Azragael\\'s whereabouts became unknown. Some believe that he dissapeared with the Dwarves too, as he shared their ideology. Others believe that he simply went into hiding in his massive fortress. Throughout the years, it has been home to few people, as the automatons have kept them at bay. Rumor has it that a rouge conjurer made their way into the fortress and modernized the equipment for themselves. Since the War of the Crag, the Falmer have fought hard trying to reclaim these ruins, but have been held off at the gates by the Dwemer automaton guardians...until now...\r\n\r\n\r\n[img] http://skyrim.nexusmods.com/downloads/images/15033-2-1334422292.jpg [/img]\r\n\r\nFeatures:\r\n\r\n-Several observation decks and chambers, especially designed for those days you feel like gazing at the beauty of Skyrim, or just want to sit inside and chill for a while\r\n-Multiple buildings and work areas with enchanting tables, alchemy labs, and lots and lots and lots (I think you get the point) of mannequins, containers, weapon racks, bookshelves.\r\n-A forgeyard with a forge, smelter, tanning racks, grinding stone, and work bench\r\n-A new crafting object, called a baking oven, which is used to create a whole new selection of foods, ones that can\\'t be made over a pot and fire\r\n-Specially crafted Dwarven Explosive Arrows that you can make at the forge. You need the Dwarven smithing perk, along with Dwarven metal ingots, Dwarven oil, leather straps, and dwarven arrows. Very good for crowd control and/or super tough opponents\r\n-New selection of recipes for cooking and baking, along with a new added vanilla ingredient \\\"Sugar Pile\\\"\r\n-A Dwemer mining platform that extracts quicksilver out of the ground once every three days, and can be used along with iron ore and snowberries to make Dwarven oil.\r\n\r\nComing soon:\r\n\r\n-The Aldmeris Simulatory: A massive portal to an engineered realm designed by the Dwemer themselves which models the Elven beliefs to the lost continent of Aldmeris!\r\n-The Automaton Forge: A mini-factory which will create Dwarven Automatons to follow your command! (I need to learn a few more things in Papyrus)\r\n\r\nBUT THESE WON\\'T BE ARRIVING IF YOU DON\\'T SUPPORT THIS MOD! DOWNLOAD IT TODAY, AND HELP SHOW ME THAT THESE PROJECTS ARE WORTH MAKING! I\\'VE SPENT A LOT OF TIME MAKING THIS SO FAR, AND I DON\\'T WANT IT TO BE ALL FOR NOTHING!\r\n\r\nCommentaries:\r\n\r\n-I finished this mod nearly two weeks ago (besides some finishing touches), and have sent it to ten other people to play test it. THERE IS NOTHING WRONG WITH IT! If something goes wrong for you, YOU are the one doing something wrong! Apologies for sounding like an a$$hole, but the last time I submitted this, my page got flooded by comments from one guy that was having problems, so it looked like something was wrong with it :/",
  "categoryId": "67",
  "version": "1.0",
  "author": "Abvxyzackattack",
  "createdUnix": "1334275907",
  "updatedUnix": "1334275985",
  "containsAdultContent": false,
  "uploadedBy": "ABVXYzackattack",
  "primaryFile": null,
  "files": [
    {
      "fileId": "52712",
      "name": "Dwarven Fortress",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "572",
      "fileName": "Dwarven Fortress-15033.rar",
      "uploadedUnix": "1334275985",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2bb0c7d723377501f646368a9e5bb94f742a8f9a2cacba37a0fba2238ddf18c3/analysis/1406812641/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwarven%20Fortress-15033.rar?fid=52712&ttl=1535779102&ri=8192&rs=8192&setec=e703e601a9cf8b18ec55d17c45809e2d"
    }
  ]
}