{
  "modId": 15042.0,
  "modName": "Troll Bane Armor R18Pn 06 Diano Retex NSFW",
  "summary": "Re-imagined the R18Pn 06 Diano Armor by Kurese",
  "descriptionHtml": "The concept:\r\nI really liked the look of this armor, but as I had already crated my own variant of the Daedric Armor I wasn\\'t going to use it, then I had an epiphany about what it could look like with a few changes to the textures ... Troll Bane was the result. The theory is that a Barbarian Warrior Princess should have some sort of trophy for the carcasses she has left about Tamriel, so we have Troll Bones, Bear Fur and MudCrab Shells ... Plus (although we don\\'t actually see them) There must be \\\"Mama\\' trolls and \\'Papa\\' trolls and as a consequence \\'Rug Rat\\' trolls so there is a \\\"Baby Troll Skull\\\" on there as well.\r\n\r\nThe files:\r\nIt\\'s no different from Kurese\\'s original in any significant way as far as the mesh goes, all I really did was remove the skirt. The textures however are all original, created completely from scratch, It\\'s not perfect or great or stunning, but I\\'m pretty happy with how it turned out\r\n\r\nThe execution:\r\nAs I said all I really did was remove the skirt and then using the UV map as a guide I set about changing it into a \\'barbaric\\' version. Using textures borrowed almost entirely from BGS\\'s textures.bsa plus a screenshot of the troll skull , I layered and merged and pasted and blended to get close to the look I wanted. The mask in the _n.dds could probably still do with a little more work and the \\'fur\\' could probably do with a little more alpha blending around the edges, but I don\\'t have the patience to go into that much detail, if someone else wants to, please feel free.\r\n\r\nWARNINGS: READ ALL THIS FIRST !!!\r\n\r\nThis REPLACES the following files:\r\n\r\n1) Bandit Armor 2 (bandit2f_0.nif and bandit2f_1.nif) called \\'Fur Armor\\\" in Skyrim, which I think is the long fur skirt and fur \\'boob tube\\' armor, which I rarely saw used in game, but if that\\'s your favourite then don\\'t install this mod.\r\n2) Bandit Helmet (hatf_0.nif and hatf_1.nif) Called \\\"Fur Helmet\\\" in game, which was essentially just a dead rabbit draped over your characters head, so replaced it with the Sons of Talos Bear Skull Helmet. Way cooler IMHO\r\n3) The boots are probably the most controversial change so read carefully.\r\nThe \\'Fur Boots\\\" in Skyrim are actually the \\'Stormcloak Boots\\\" (yeah go figure, what were you thinking BGS?) and these boots are also worn by many town guards, so if you don\\'t want them replaced with the new ones don\\'t install this mod. REMEMBER (if you don\\'t already know) that the Stormcloak boots are the same mesh for both Male and Female! Personally I think the guards look pretty good with the new boots, but you may not ... You have been warned!\r\n\r\n4) I\\'ve also added a quick and dirty retex to replace the \\'Hide\\' shield with a Troll Body Part Buckler shield. The whole package looks really cool when combined with Forsworn weapons.\r\nI\\'m hoping some adventurous modder will come along and maybe create a standalone version with recipes that include troll skulls and bear fur and mudcrab chitin (similar to what was done with the \\'more craftables\\' smithing/weapon mod which allows you to create Forsworn Weapons\r\n\r\nCredit, Tools and Thanks:\r\nKurese for the \\'Diano\\' Mesh, original here http://skyrim.nexusmods.com/downloads/file.php?id=14670\r\n\r\nKureses\\'s (and most of my meshes are based on the UNP body so thanks also to Dimon99\r\n\r\nNifskope\r\nPaint.net\r\nFO3Archive Utility\r\nBethesda (I guess)\r\nNexus\r\n\r\nYou can do whatever you like with this, use it, don\\'t use it. mod it, whatever ... Just please give me some of the credit if you do.\r\n",
  "categoryId": "54",
  "version": "1.0",
  "author": "Perraine",
  "createdUnix": "1334281789",
  "updatedUnix": "1334281951",
  "containsAdultContent": false,
  "uploadedBy": "Perraine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "52731",
      "name": "Troll Bane Armor and Shield",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7410",
      "fileName": "Troll Bane Armor and Shield-15042-1-0.rar",
      "uploadedUnix": "1334281951",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/36cc130b9d9ccd48089cc26c814aa0c8b7b3627fe9c72da991bc7ce9320c4ca6/analysis/1406812653/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Troll%20Bane%20Armor%20and%20Shield-15042-1-0.rar?fid=52731&ttl=1535779110&ri=8192&rs=8192&setec=bd193f2952eacf832c079fd16bdae78e"
    }
  ]
}