{
  "modId": 15097.0,
  "modName": "Daeas The Mistress of Death NSFW",
  "summary": "Necromantic Female Nord Companion ",
  "descriptionHtml": "This mod is a personal tribute of sorts to fantasy artists I\\'ve always loved and admired. Artists such as Louis Royo, Frank Frazetta, and Boris Vallejo are the ones responsible for my love of medieval fantasy and its darker, sexier side. I admit this companion is a bit different than what I normally do in means of the attire, but after looking at some of my old art books I just had to do this one.\r\n\r\nDaeas is a powerful companion that will fear enemies, hurl bolts of lightning, turn corpses to ash, drain life essence, re-animate fallen enemies, and wield a one handed weapon of your choice. She is cold and pale like the fallen snows of Skyrim, but is faithful to those who prove worthy and treat her well. She is proof that even a cold heart can be a loving one, and should you dare to ask she may just be your bride.\r\n\r\nHer skills and perks lie in light armor, one handed melee, conjuration, destruction, and heavy armor (lower than light armor but she can still use heavy should you prefer it).\r\n\r\nYou can find her inside The Halls of the Dead of Windhelm.\r\n\r\nLike all of my other companion mods; Daeas will loiter around in the area that you dismiss her once you tell her you want to part ways (drop her as a companion). So if you can\\'t find her after you ask her to leave your service make sure to go back to where you left her. I set her AI up this way so that you can leave her in a convenient place and she won\\'t wonder off (you can also have her stay behind in one of your houses until you want her to tag along with you again). Remember that ALL of my companion mods have this feature.\r\n\r\nIMPORTANT NOTE: This mod must have the following mod in order to work correctly:\r\n\r\n:::Apachii Sky Hair:::\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10168\r\nIf you have issues with hair colors turning dark when near light sources; download teh vanilla hair option on Apachii\\'s page and that should fix the issue.\r\n\r\nManual Installation:\r\nPlace the zip file\\'s contents into your Skyrim/data folder to install and be sure to activate the ESP and ESM files in your Data Files listing. Ensure that the Apachii Sky Hair ESP and ESM are ABOVE Daeas\\' data files in your load order (I\\'d recommend placing Daeas\\' files dead last in the load order so there are no conflicts).\r\n\r\nRecommended (but not required) mods to get her as she appears in the screen shots:\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nFeatured outfit mods: \r\nLady of Death for CBBE V3\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=13761\r\n                                  &\r\nCloaks of Skyrim (Black Linen Cloak)\r\n http://skyrim.nexusmods.com/downloads/file.php?id=12092\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nCBBE V3 (standard body) and the hip texture compatability pack:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2666\r\n\r\nBella\\'s Better Females version 3:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2812\r\n\r\nCover Eyes (eyes 1 file):\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4869\r\n\r\nKiller Keos Skimpy CBBE V2 Armor Set:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3654\r\n\r\nSpecial thanks to Blackie for his CM New Companions mod that includes a top-notch detailed tutorial on how to create Skyrim companions without the face discoloration bug. Get his mod and tutorial (contained in the mod) here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11669\r\n\r\nThe work around I found for the bug with Bella\\'s face mod (the bug involving women looking like they have faint beard stubble on their jawline and chin) is to use the standard Better Faces Version 3, and then apply the \\\"No Shine\\\" option available on her mod page.\r\n\r\nSpecial note: All of my future companions after Divada, Taja, Viin, and Kyia will be made using the Better Females by Bella mod. I switched to another mod set for faces previously due to a bug I couldn\\'t resolve (the issue with females having faint male beard stubble on their faces while using Bella\\'s). I have resolved that issue, so I\\'ll be going back to Bella\\'s for my projects from now on. You DO NOT have to switch to Bella\\'s if you use Envision faces and RANs Headmesh (what I used previously) OR if you use other face mods. All of my companions should work with other face/body mods and vanilla setups unless specifically mentioned in the description.\r\n\r\nThanks for stopping by, and I hope you enjoy taking Daeas with you on your adventures.\r\n\r\nI recommend a manual install of this mod (read me included in the zip file). Install with Nexus Mod Manager at your own risk.\r\n\r\nThe ENB I use (which is why there\\'s a difference in screen shots as opposed to previous companion releases) is Cinematic Lighting ENB which you can check out here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4142\r\n\r\nRemember to endorse files from the Nexus if you like them...it\\'s a small notion of thanks that all modders appreciate. Thanks for taking the time to look over my mods and I hope you enjoy them.\r\n\r\nNote to other modders: Feel free to use any of my companions to compliment/show off your mods if you like my work. If you have custom armor or weapons, feel free to use any of my companions to model them for you. I\\'m a firm believer that modders working together equals more mods for all of us to enjoy.",
  "categoryId": "66",
  "version": "1",
  "author": "Grimraven1",
  "createdUnix": "1334342341",
  "updatedUnix": "1334342446",
  "containsAdultContent": true,
  "uploadedBy": "Grimraven1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "52924",
      "name": "Daeas The Mistress of Death",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1117",
      "fileName": "Daeas The Mistress of Death-15097-1.rar",
      "uploadedUnix": "1334342446",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/0bd3abe133834fb5bc469992ce266844e29025c9963f8c38d8e31f67a47880c6/analysis/1406813914/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daeas%20The%20Mistress%20of%20Death-15097-1.rar?fid=52924&ttl=1535779202&ri=8192&rs=8192&setec=9c814fbaeee5a0ca369d145d229803df"
    }
  ]
}