{
  "modId": 15110.0,
  "modName": "Sworn To Serve",
  "summary": "Adds the ability to have followers swear oaths to you and become your Housecarls.",
  "descriptionHtml": "Sworn to Serve\t\r\n\r\n\r\nIntroduction\r\n\r\nI didn\\'t really like how your housecarls were just assigned to you without any say in the matter on your part, so I thought I\\'d change it up a bit. This mod adds the functionality to attain oathmen/housecarls/knights who are sworn to your service like they were in the 9th century. I tried to make it as compatible as possible with other mods like UFO but this is a beta so we\\'ll see how they play together.\r\n\r\nHow it Works\r\n\r\nFairly simple really. It adds a craftable Signet Ring for your character that you can craft and give to your current follower through a dialogue where they swear an oath to you and are then added to a new universal housecarl faction. There is a test NPC named Finan in Embershard Mine that you can test it on, or use Faendal or any of the other followers.\r\n\r\nInstallation\r\n\r\nJust drag and drop into your data directory.\r\n\r\n\r\nSuggestions & Questions\r\n\r\nPost them in the thread at the Bethesda forums or in the Nexus comments page and I\\'ll do my best to respond in a timely manner. If there\\'s something that needs to be asked over PM then I\\'m open to it, but try to keep it in the thread if possible.\r\n\r\n\r\nCompatibility\r\n\r\nI tried to make this as compatible as possible with mods like UFO but there may be come issues, go ahead and post them on the comments page or the bethsoft thread and I\\'ll take a look at a compatibility patch.\r\n\r\nUsage\r\n\r\nYou can use any of this work in your own mods as long as credit is given. Understand that new versions will be released and as such I\\'m not responsible for any compatibility issues that come from old versions.\r\n\r\n\r\nCredits\r\n\r\nBethesda for the game/Creation Kit\r\n",
  "categoryId": "24",
  "version": "BETA",
  "author": "Jehoram",
  "createdUnix": "1334360086",
  "updatedUnix": "1334360353",
  "containsAdultContent": false,
  "uploadedBy": "Jehoram",
  "primaryFile": null,
  "files": [
    {
      "fileId": "52995",
      "name": "Sworn to Serve",
      "version": "BETA",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Sworn to Serve-15110-BETA.7z",
      "uploadedUnix": "1334360353",
      "modVersion": "BETA",
      "virusScanUrl": "https://www.virustotal.com/file/2a435d278fd481643042ccad46a7d705faffc1c0a6e937027be123e11da0d517/analysis/1406814243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sworn%20to%20Serve-15110-BETA.7z?fid=52995&ttl=1535779227&ri=8192&rs=8192&setec=1c160df2ad7fc339d9bd82f2c69fbb7b"
    }
  ]
}