{
  "modId": 15136.0,
  "modName": "SkyrimX",
  "summary": "More challeging Gameplay, More Enemies: GERMAN ONLY : Viele Gegner und Gegnergruppen des Spiels werden erweitert, Lücken in den Stufen der Gegnerarten zueinander durch neue zwischenvarianten aufgefüllt. Für Spieler und Charakter bedeutet dies, ein schwierigeres, forderndes Gameplay ohne neue und vielleicht störende Inhalte.  Viele Gegnerarten in sp",
  "descriptionHtml": "Skyrim X : Challenging Gameplay u. mehr Gegner\r\n===============================================================================\r\nZum Namen des Projektes: Damit die Modifikation in der Dateiliste am Ende stand, habe ich schlicht alles in ?SkyrimZ ? Modifikation? benannt, finde aber \\\"SkyrimX\\\" irgendwie ansprechender, ohne, das ich eine Idee als Projektnamen dabei hatte. Vielleicht \\\"Skyrim Extra\\\" oder \\\"Skyrim Zusatz\\\"? Damit ich in den Modifikationen meine neuen Einträge übersichtlich sehen kann, beginnen diese entweder also mit \\\"Z\\\" oder \\\"00\\\" in der Bezeichnung der Einträge und Listen.\r\nEntgegen den schon vorhandenen und sicher noch kommenden Monstermods, Overhauls und Balancings, mag ich es eher kleiner, übersichtlicher und ohne Dutzende neuer Inhalte, die für mich die Spielbalance doch irgendwie stören. Auch will ich bewusst keine irgendwie nicht passenden, neuen Gegner oder andere Dinge.\r\nAlso habe ich angesetzt und das vorhandene im Spiel mir angeschaut und überlegt, was mich am meisten gestört hat. Da ich als Spieler auch immer gerne mir Modifikationen zusammengestellt habe, sind die wichtigen Punkte als einzelne Lösungen enthalten. So kann ausgewählt werden, was als Modifikation genutzt werden soll. Ziel war eine kleine Erweiterung, die ein etwas schwierigeres Spiel ermöglicht, ohne dass zu viel geändert erscheint. Alles soll sich in das bestehende und die Welt einfügen und passen. Daher auch keine neuen Gegnermodelle und neuen Inhalte. Das bestehende des Spiels wird lediglich etwas aufgebohrt. Ganz gleich, ob Neueinsteiger oder alter Recke: diese Modifikation kann einfach zum Spiel genutzt werden, ohne das sich irgend etwas spürbares als die Schwierigkeit ändert.\r\nDie Schwierigkeit lässt sich schwer beschreiben und die Anforderung steigen nur langsam an: so wird nicht schon in niederen Stufen der Recke von einer Vielzahl unmöglich starker Gegner überrollt. Ziel ist, so ab der 25. Spielstufe merklich etwas mehr und schwierigere Gegner einbringen. Ab Stufe vierzig soll das dann voll ausgebaut sein. Normalspieler in den Stufen bis 25 werden also kaum merklich etwas spüren, während jene Helden von Gut und Böse (40+) doch etwas mehr zu kämpfen haben. Insgesamt ist das Spiel so moderat aber in späteren Stufen doch fordernd.\r\n\r\nLoot:\r\n-------------------------------------------------------------------------------\r\nDas Loot bei Gegnern ist das Gleiche wie bei den Grundarten geblieben. Das bedeutet bei den Bärenbeispielsweise, dass diese eben Bärenfelle verlieren. Es wurden keine neuen Gegenstände eingeführt um nichts im Spiel durcheinanderzubringen. Wenn für eine Quest Bärenfelle bestimmter Art gesucht werden müssen, wäre es fatal, wenn zahlreiche neue eingeführt werden würden. Der zweite Grund ist, das diese kleine Modifikation schnell mal abgeschaltet werden kann, wenn es zu schwer erscheint oder ein paar Mehr Gegner anders stören, ohne dass nun neue Inhalte verloren gehen.\r\n\r\nMehr Gegner:\r\n-------------------------------------------------------------------------------\r\nAuf Anregung und Wunsch ist Skyrim X etwas erweitert für Spieler mit Begleitern und höheren Stufen. Verschiedene Kreaturen und Gegner können und in höheren Stufen unterschiedlich oft in kleinen Gruppen auftauchen. Wölfe etwas früher als Banditen beispielsweise. Mit Stufe 15 können unter Umständen schon einmal drei Wölfe angetroffen werden. Banditen hingen vielleicht höchstens zwei, vielleicht in höheren Stufen dann sogar drei und mehrere. Zusammen mit den neu eingefügten Zwischenstufen vieler Gegner ist der Spieler und sind seine möglichen Begleiter etwas mehr gefordert, ohne das es gefühlt unfair erscheint. Um Quests und Eroberungen nicht zu gefährden, sind keine Söldner und kritische Gegner berührt. Im Notfall kann für eine Mission schnell die Datei deaktiviert werden.\r\n\r\n\r\nGegnervarianz\r\n-------------------------------------------------------------------------------\r\nIch habe mich bemüht, neuen Gegnervarianten entsprechende Namen zu vergeben. Dabei musste ich einen Kompromiss zum bestehenden finden aber auch eben die neuen Gegner kennzeichnen. Wölfe zum Beispiel können als \\\"Eiswolf\\\", \\\"Frostwolf\\\" und \\\"Firnwolf\\\" auftauchen. Alles sind so gesehen Eiswölfe aber zur Unterscheidung eben im Namen unterteilt. Andere Tier wie Bären tragen dann \\\"Bären-Ältester\\\" als Zusatz um diese zu kennzeichnen. Alles weiterhin Bären, nur eben unterteilt im Namen um ihre Stärke und Gefärhlichkeite rkennen zu können. Diese Art, Gegner zu unterscheiden, stammt aus etlichen Modifikationen schon aus OBlivion kommend, ich habe das übernommen.\r\n\r\nNeuverteilung Gegner\r\n-------------------------------------------------------------------------------\r\nMit SkyrimX ist es möglich, schon früher etwas gefährlicheren Gegner zu begegnen. Es gibt intern Listen für eine Vielzahl an Gegnern. In diesen Listen tauch vereinfach dargestellt ein Skever und Wolf in Stufe 1, ein Bär in Stufe 5 und ein Säbelzahntiger in Stufe 10 auf. Ich habe dies für viele Gegnerarten (meist Tiere) weitergehend geändert: Eine Solche Gegnerliste trägt nun drei bis vier Listen in sich, die je nach Stufe des Spieler genutzt werden um eine Neu- und Umverteilung der Gegner zu ermöglichen. So kann ein Spieler in den ersten Spielstufen Mehr Wölfe antreffen aber auch mal seltener einen Bären. In höherer Spielstufe, so um 10 herum, trifft er mehr Wölfen aber auch mehr an Bären. Ab der 15 Spielstufe werden mehr Wölfe und Bären auftauchen aber nun auch Säbelzahntiger. Das Auftauchen einiger Gegnerarten wurde also neu verteilt und gemischt, ohne es komplett zu verändern. Für einen Spieler bedeutete dies, etwas mehr normale Gegner aber doch schon etwas stärkere anzutreffen. Dies bringt mehr Herausforderung in das Spiel aber auch etwas mehr an Zufall. Eine interessante Mischung gefühlt in er Spielwelt selber. Die Gegnerverteilung ist nun viel ausgeglichener als zuvor (ohne Änderung erschienen zu bestimmten Stufen mehr einer Art Gegner, jetzt mit der Änderung zufällige mit gleichen / anderen Chancen).\r\n\r\nVorgehensweise:\r\n-------------------------------------------------------------------------------\r\nMeine Vorgehensweise: Kurz umrissen, habe ich festgestellt, das zum Beispiel einige Gegner in den Listen nicht genug in hohe Stufen hineinreichen oder zwischen den einzelnen und vorhandenen Gegnereinträge in Stufen zu große Abstände zueinander klaffen. Genau hier habe ich angesetzt. Um mein Vorgehen vereinfacht zu erklären, drei (vereinfachte) Beispiele meiner Ansätze:\r\n\r\nBeispiel 1: Wölfe und Bären: Schneewölfe sind stärker als die normalen. Schneebären stärker als die normalen Bären. Warum also nicht zum Beispiel die normalen Wölfe um ein, zwei Varianten erweitern, die eben die Stärken und Werte der Eiswölfe tragen? Oder nach dem nornalen Bären einen in die normalen Listen einsetzen, der eben auch so gefährlich wie ein Schneebär ist aber in den Stufen später auftritt?\r\nBeispiel 2: Die Draugr: Da gibt es welche in den Listenstufen 1, 6, 13, 21 und 30. Reicht aus. Aber was spricht dagegen, aus den der Stufe 6 welche für die Spielstufe 10 zu erstellen? Und aus jenen der Stufe 13 Gegner der Stufe 17. Und nach der Stufe 12 noch welche für die Spielstufe 26. Und schon sieht diese Liste dann so aus: 1, 6, 13, 17, 21, 25. Dabei orientieren sich die Werte dieser \\\"neuen\\\" Draugr an den zwischen den niederen und nächsthohen. Also eine völlige Zwischenstufe. Spielerisch markant wird dies, wenn der Charakter als hochstufiger Held auf niedere Gegner dieser Art trifft: als Stufe 18 Recke zum Beispiel, trifft er nicht mehr auf die viel zu leichten Draugr der Spielstufe 13, sondern etwas gehoben in Werten, jenen der Stufe 17. Daher sind also die Abstände der Gegner nicht mehr zu groß und diese Gegner nicht mehr so leicht zu besiegen.\r\nBeispiel 3: Wölfe und Skelette empfand ich einfach als viel zu leicht. So habe ich die normalen Wölfe einfach um 15% und die Skelette um 45% verbessert. Die Wölfe sind nur ein klein wenig zäher, Skelette nun doch so etwas wie ein Gegner.\r\nUm das Spiel dann noch zu erweitern, habe ich auch Gegner wie Zwergensphären und Zwergenspinnen als Beispiel etwas verstärkt und um ein, zwei Varianten erweitert. Im gesamten wird und wurde so vorgegangen, dass die wichtigen Feinde gesichtet wurden und wenn zu große Stufensprünge zwischen der einen und nächsten Kreatur festgestellt wurde, neue Zwischengegner eingestellt. Gegner in Stufe 1 und der folgende in Stufe 26 sind ein viel zu großer Sprung. Das muss ausgeglichener funktionieren. Ein Spieler Stufe 25 langweilt such über jene Gegner der ersten Stufe. Das ist nun entsprechend abgeschwächt.\r\n\r\nZusatzdatei(en)\r\n-------------------------------------------------------------------------------\r\nSkyrimX - Iems Sorted: Benennt Pfeile in \\\"Pfeile: Material\\\" um, Erz in \\\"Erz: Material\\\", Edelsteine werden mit einem \\\"*\\\" vorangestellt vermerkt, Heiltränke in \\\"#Heiltrank + Wirkung\\\" umbenannt und ein paar weitere, kleine Änderungen um das Inventar übersichtlicher und mehr zusammengefasst anzuzeigen. Einfach mal ausprobieren und bei Nichtgefallen wieder deaktivieren.\r\n\r\n",
  "categoryId": "24",
  "version": "1.07",
  "author": "Norbert der dicke Drache",
  "createdUnix": "1334409066",
  "updatedUnix": "1335528218",
  "containsAdultContent": false,
  "uploadedBy": "NorbertDrache",
  "primaryFile": null,
  "files": [
    {
      "fileId": "56736",
      "name": "SkyrimX",
      "version": "107",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "91",
      "fileName": "SkyrimX-15136-107.7z",
      "uploadedUnix": "1335528218",
      "modVersion": "107",
      "virusScanUrl": "https://www.virustotal.com/file/03bac7a6e20632ed99fc13a24d2c4ed626b509735c9cd3879813daba38d00723/analysis/1406843355/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyrimX-15136-107.7z?fid=56736&ttl=1535779303&ri=8192&rs=8192&setec=cc8e8930a53f8d1f4482f509525a9734"
    }
  ]
}