{
  "modId": 15163.0,
  "modName": "Greybeard Exile Murkain",
  "summary": "Greybeard Hybrid Companion",
  "descriptionHtml": "Requested by    :::ayjaytee16:::\r\n\r\nUPDATE: Added a less powerful version where his spell casting and related perks have been removed. He will now only use the Greybeard and Monk AI package actions. Just don\\'t expect him to be rolling shouts constantly. The Greybeard AI uses shouts sparingly and you also have to account for the long cooldowns they have. Regardless, people wanted a weaker version so here it is. Make sure to use ONLY ONE of the versions of this companion and don\\'t mix files between them when installing.\r\n\r\nAs the Greybeards sat atop the snowy peaks while Skyrim slowly destroyed itself; one of their number grew tired of standing by and doing nothing. Murkain was a Greybeard and gifted in the uses of the Voice, but he tired of their passive philosophies that offered nothing to help his homeland. The Nord blood in his veins called for him to take action, so he abandoned his robes and set forth into Skyrim in search of the Dragonborn. Perhaps together they could work to undo the chaos and bring peace to a land divided. He believed that the Dragonborn was the answer, but he also believed that a savior shouldn\\'t have to act alone in such a dangerous world.\r\n\r\nMurkain Possesses the master level of several shouts (Unrelenting Force, Fire Breath, Disarm, etc.) and also possesses powerful fire and lightning spells. He has perks invested in Destruction, one handed weapons, light armor, mage defense (mage armor), and comes with a mace and an offensive staff as well as soul gems to keep it charged up. And for those of you who simply can\\'t resist his manly silver locks, he can be married.\r\n\r\nYou can find him inside Candlehearth Hall of Windhelm.\r\n\r\nLike all of my other companion mods; Murkain will loiter around in the area that you dismiss him once you tell him you want to part ways (drop him as a companion). So if you can\\'t find him after you ask him to leave your service make sure to go back to where you left him. I set his AI up this way so that you can leave him in a convenient place and he won\\'t wonder off (you can also have him stay behind in one of your houses until you want him to tag along with you again). Remember that ALL of my companion mods have this feature.\r\n\r\nRecommended (but not required) to get him as he appears in the screen shots:\r\n\r\nCover Eyes (eyes 1 file):\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4869\r\n\r\nBeyond the eye mod above; Murkain should work just fine with community body and face mods and should also work fine with vanilla Skyrim.\r\n\r\nSpecial thanks to Blackie for his CM New Companions mod that includes a top-notch detailed tutorial on how to create Skyrim companions without the face discoloration bug. Get his mod and tutorial (contained in the mod) here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11669\r\n\r\nThanks for stopping by, and I hope you enjoy taking Murkain with you on your adventures.\r\n\r\nI recommend a manual install of this mod (read me included in the zip file). Install with Nexus Mod Manager at your own risk.\r\n\r\nThe ENB I use (which is why there\\'s a difference in screen shots as opposed to previous companion releases) is Cinematic Lighting ENB which you can check out here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4142\r\n\r\nRemember to endorse files from the Nexus if you like them...it\\'s a small notion of thanks that all modders appreciate. Thanks for taking the time to look over my mods and I hope you enjoy them.\r\n\r\nNote to other modders: Feel free to use any of my companions to compliment/show off your mods if you like my work. If you have custom armor or weapons, feel free to use any of my companions to model them for you. I\\'m a firm believer that modders working together equals more mods for all of us to enjoy.",
  "categoryId": "66",
  "version": "1",
  "author": "Grimraven1",
  "createdUnix": "1334434719",
  "updatedUnix": "1334517724",
  "containsAdultContent": false,
  "uploadedBy": "Grimraven1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "53219",
      "name": "Murkain the Exile",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "170",
      "fileName": "Murkain the Exile-15163-1.rar",
      "uploadedUnix": "1334434774",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/4a200a14fc1d3defdc8d42f1179d54a6a37443aa33e6ee59aba593e07594b2a3/analysis/1406815576/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Murkain%20the%20Exile-15163-1.rar?fid=53219&ttl=1535779368&ri=8192&rs=8192&setec=9c188259e998b9d02438c02a1d14e40c"
    },
    {
      "fileId": "53519",
      "name": "Murkain Nerfed Version",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "170",
      "fileName": "Murkain Nerfed Version-15163-1.rar",
      "uploadedUnix": "1334517724",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/d0822329d0fa674a01797b91f91fb291bd63feff7cc8661d02875be6e1f42f84/analysis/1406817375/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Murkain%20Nerfed%20Version-15163-1.rar?fid=53519&ttl=1535779369&ri=8192&rs=8192&setec=c8f1ecf48800edf9f604e227be2af5b3"
    }
  ]
}