{
  "modId": 15181.0,
  "modName": "Nord Archer Sako Proudmane",
  "summary": "Female Archer Companion",
  "descriptionHtml": "Requested by   :::P210:::\r\n\r\nUPDATED: Added an optional version where she levels from level 8 to level 80 instead of level 50 to level 80. Use one version or the other; do not combine both zip files!\r\n\r\nUPDATE 2: Ponytail variant added by request. Level scaling is from 8 to 80 like the aforementioned update above.\r\n\r\nAlone, cold, naked, and hungry; Sako fled from the Forsworn camp where her captors resided. They wished to make a slave out of such a free spirit, but some spirits will do anything to elude rusted bars and forged locks. She ran as fast as her feet could carry her over grass and stone alike until her eyes grasped the entrance to the old Kolskeggr Mine not far from Markarth. Within this mine she would hide from her former captors. She would attempt to arm herself. She would make her last stand. If only the Divines would send someone to even the odds... \r\n\r\nSako is a Nord Archer with perks in stealth, archery, one handed weapons, light armor, lockpicking, and will level with your character from level 50 to level 80 (apologies for the previous typo of her going from 8 to 80; she is intended to be a Companion for higher level characters or while playing on a hard difficulty). She is essential, she can be married, and her light-hearted spirit should make ease of your long travels.\r\n\r\nLike all of my other companion mods; Sako will loiter around in the area that you dismiss her once you tell her you want to part ways (drop her as a companion). So if you can\\'t find her after you ask her to leave your service make sure to go back to where you left her. I set her AI up this way so that you can leave her in a convenient place and she won\\'t wonder off (you can also have her stay behind in one of your houses until you want her to tag along with you again). Remember that ALL of my companion mods have this feature.\r\n\r\nIMPORTANT NOTE: This mod must have the following mod in order to work correctly:\r\n\r\n:::Apachii Sky Hair:::\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10168\r\nIf you have issues with hair colors turning dark when near light sources; download teh vanilla hair option on Apachii\\'s page and that should fix the issue.\r\n\r\nManual Installation:\r\nPlace the zip file\\'s contents into your Skyrim/data folder to install and be sure to activate the ESP and ESM files in your Data Files listing. Ensure that the Apachii Sky Hair ESP and ESM are ABOVE Sako\\'s data files in your load order (I\\'d recommend placing Sako\\'s files dead last in the load order so there are no conflicts).\r\n\r\nRecommended (but not required) mods to get her as she appears in the screen shots:\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nFeatured outfit mod: \r\nNightshade Armor (UNP mod but works with CBBEv3...see screenshots)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=12070\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nCBBE V3 (standard body) and the hip texture compatability pack:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2666\r\n\r\nBella\\'s Better Females version 3:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2812\r\n\r\nCover Eyes (eyes 1 file):\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4869\r\n\r\n\r\nSpecial thanks to Blackie for his CM New Companions mod that includes a top-notch detailed tutorial on how to create Skyrim companions without the face discoloration bug. Get his mod and tutorial (contained in the mod) here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11669\r\n\r\nThe work around I found for the bug with Bella\\'s face mod (the bug involving women looking like they have faint beard stubble on their jawline and chin) is to use the standard Better Faces Version 3, and then apply the \\\"No Shine\\\" option available on her mod page.\r\n\r\nSpecial note: All of my future companions after Divada, Taja, Viin, and Kyia will be made using the Better Females by Bella mod. I switched to another mod set for faces previously due to a bug I couldn\\'t resolve (the issue with females having faint male beard stubble on their faces while using Bella\\'s). I have resolved that issue, so I\\'ll be going back to Bella\\'s for my projects from now on. You DO NOT have to switch to Bella\\'s if you use Envision faces and RANs Headmesh (what I used previously) OR if you use other face mods. All of my companions should work with other face/body mods and vanilla setups unless specifically mentioned in the description.\r\n\r\nThanks for stopping by, and I hope you enjoy taking Sako with you on your adventures.\r\n\r\nI recommend a manual install of this mod (read me included in the zip file). Install with Nexus Mod Manager at your own risk.\r\n\r\nThe ENB I use (which is why there\\'s a difference in screen shots as opposed to previous companion releases) is Cinematic Lighting ENB which you can check out here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4142\r\n\r\nRemember to endorse files from the Nexus if you like them...it\\'s a small notion of thanks that all modders appreciate. Thanks for taking the time to look over my mods and I hope you enjoy them.\r\n\r\nNote to other modders: Feel free to use any of my companions to compliment/show off your mods if you like my work. If you have custom armor or weapons, feel free to use any of my companions to model them for you. I\\'m a firm believer that modders working together equals more mods for all of us to enjoy.",
  "categoryId": "66",
  "version": "1",
  "author": "Grimraven1",
  "createdUnix": "1334454592",
  "updatedUnix": "1334524992",
  "containsAdultContent": false,
  "uploadedBy": "Grimraven1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "53275",
      "name": "Sako Proudmane Auto Level 50 to 80",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "404",
      "fileName": "Sako Proudmane Auto Level 50 to 80-15181.rar",
      "uploadedUnix": "1334454661",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/fda4d7bc58f02fca95b5603be7fc9514fc0d9fcdc7bba9521e47ff8d22aff9e0/analysis/1406816049/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sako%20Proudmane%20Auto%20Level%2050%20to%2080-15181.rar?fid=53275&ttl=1535779401&ri=8192&rs=8192&setec=00a60290a44c57b56eecb3d482cfb7e9"
    },
    {
      "fileId": "53416",
      "name": "Sako Proudmane level 8 to 80",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "250",
      "fileName": "Sako Proudmane level 8 to 80-15181.rar",
      "uploadedUnix": "1334495768",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/0eb29cab8012ec3d4cea3aeed098b65ef37aa4aa510dee5b5e50819372f7a069/analysis/1406816828/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sako%20Proudmane%20level%208%20to%2080-15181.rar?fid=53416&ttl=1535779401&ri=8192&rs=8192&setec=0e35fffe77bc8dffdf47084d8531f451"
    },
    {
      "fileId": "53557",
      "name": "Sako Ponytail Variant",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1013",
      "fileName": "Sako Ponytail Variant-15181-1.rar",
      "uploadedUnix": "1334524992",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b55a3445a04472cd1b88934060bca2e4ede3dc3721c88bc75d040284faaefe59/analysis/1406817685/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sako%20Ponytail%20Variant-15181-1.rar?fid=53557&ttl=1535779402&ri=8192&rs=8192&setec=4cea74ba4b5ff6e09cf7f4712dd1377b"
    }
  ]
}