{
  "modId": 15190.0,
  "modName": "Power Potions",
  "summary": "Power Potions adds twenty new potion types to the game with powerful effects. Fifty all together counting the Potion, Draught, Philter, and Elixier Versions. These  potions  have fun and interesting effects like Teleports, God Mode, Dispel, Absorption, Night Eye , regenerate over time , and several unique combat buffs.",
  "descriptionHtml": "[center][IMG]http://i44.tinypic.com/smsizb.jpg[/IMG][/center]\r\n\r\n[size=3][b][u]Description[/size][/u][/b]\r\n\r\nPower Potions adds twenty new potion types to the game with powerful effects. Fifty all together counting the Potion, Draught, Philter, and Elixier Versions. These  potions  have fun and interesting effects like Teleports, God Mode, Dispel, Absorption, Night Eye , regenerate over time , and several unique combat buffs.\r\n\r\nThese potions have been integrated into the game so that they will appear just like normal potions on vendors, enemies, as general clutter, and in containers that normally have potions. There are  four different version of each type of potion (with the exception of Dispel and the Teleport Spells) that will become available when you reach the correct levels. Potions will appear at level 10 and above,  Draught at level 20 and above, Philters at level 30 and above, and Elixirs at level 40 and above. Dispel and Teleport potions are available after level 10.\r\n\r\nThe potions and their effects are listed below with a short description.\r\n\r\n\r\n\r\n[size=3][b][u]Potions and Effects (X = Magnitude, Y = Duration)[/size][/u][/b]\r\n\r\n\r\nDispel - Removes all positive and negative magical effects when consumed.\r\n\r\nDivinity - Makes you Invincible and give you limitless Health, Magicka, and Stamina for Y seconds.\r\n\r\nFeline Sight - Improved night vision for Y seconds.\r\n\r\nAbsorption - Absorbs X% of spell damage and converts it to Magicka for Y seconds.\r\n\r\nHaste - Fortifies your Attack Speed with melee weapons and Draw Speed with bows by X% for Y seconds.\r\n\r\nStaggering - Increases your chance to Stagger an opponent with bows by X% for Y seconds.\r\n\r\nAccuracy - Fortifies your Critical Hit Chance by X% for Y seconds.\r\n\r\nBrawler - Fortifies your Unarmed damage by X% for Y seconds.\r\n\r\nRejuvenation Health - Regenerates X Health per seconds for Y seconds.\r\n\r\nRejuvenation Magicka - Regenerates X Magicka per seconds for Y seconds.\r\n\r\nRejuvenation Stamina - Regenerates X Stamina per seconds for Y seconds.\r\n\r\nTeleport Dawnstar - Teleports you to Dawnstar\r\n\r\nTeleport Falkreath - Teleports you to Falkreath\r\n\r\nTeleport Markarth - Teleports you to Markarth\r\n\r\nTeleport Morthal - Teleports you to Morthal\r\n\r\nTeleport Riften - Teleports you to Riften\r\n\r\nTeleport Solitude - Teleports you to Solitude\r\n\r\nTeleport Whiterun - Teleports you to Whiterun\r\n\r\nTeleport Windhelm - Teleports you to Windhelm\r\n\r\nTeleport Winterhold - Teleports you to Winterhold\r\n\r\n\r\n[size=3][b][u]Installation[/size][/u][/b]\r\n\r\nDownload and install using the Nexus Mod Manager\r\n\r\nor\r\n\r\nDownload and extract the .7zip file. Place the .esp file into the /Data folder in your Skyrim directory. Place the GodModeTest.pex and GoldenEggTeleportWhterun.pex into the /Data/Scripts folder and the GodModeTest.psc and GoldenEggTeleportWhterun.psc into the /Data/Scripts/Source folder in your Skyrim directory.\r\n\r\n[size=3][b][u]Notes[/size][/u][/b]\r\n\r\nThese potions are not craftable through alchemy. I had intended to make them craftable but I am afraid of skewing the balance of that crafting system by adding or changing ingredients. They can, however, be obtained in every other way that potions can be obtained.\r\n\r\nThis is a final release version of this file. I will not be adding more potions to the list or making any changes or improvements beyond basic bug fixes or minor tweeks. This is a small and quick side project that I decided to share because I thought some of you may find it fun to play with. I hope you will enjoy it!\r\n\r\nPlease report any bugs or other issues in the comments section.\r\n\r\n\r\n[size=3][b][u]Version info[/size][/u][/b]\r\n\r\n1.1 - Fixed spelling errors\r\n\r\n1.2 - Fixed more spelling errors\r\n\r\n[u]Other Notes[/u]\r\nNo longer supported. I do not plan to purchase Hearthfire due to a personal distaste for the product and so cannot mod with the new content. This mod should still work with unexpanded Skyrim (and Dawnguard if noted as such). Sorry for any inconvenience but with this game being almost a year old I feel it\\'s time to move on to newer modding horizons. Thank you to everyone who downloaded and enjoyed my Skyrim mods. I hope to see you all again in other mod workshops. Best wishes!",
  "categoryId": "94",
  "version": "1.2",
  "author": "KahjiitRaj",
  "createdUnix": "1334461289",
  "updatedUnix": "1334492701",
  "containsAdultContent": false,
  "uploadedBy": "KahjiitRaj",
  "primaryFile": null,
  "files": [
    {
      "fileId": "53397",
      "name": "Power Potions",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "Power Potions-15190-1-2.7z",
      "uploadedUnix": "1334492701",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/69820525d84b42099c7714923e776be60f3ddeb62d8c86f96613728339926a25/analysis/1406816825/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Power%20Potions-15190-1-2.7z?fid=53397&ttl=1535779418&ri=8192&rs=8192&setec=4626965fcb8697d4cc38c5691a608739"
    }
  ]
}