{
  "modId": 15236.0,
  "modName": "FCResurrect",
  "summary": "Adds a Resurrection Spell that can be obtained in whiterun or winterhold",
  "descriptionHtml": "After trying to find a mod that can revive fallen followers and not being able to find one that actually worked for me I created this mod that will resurrect an NPC that is healed by the following amount based on your restoration level.\r\nbetween  0 and 24 the target will revive and be healed to 10%\r\nbetween 25 and 49 the target will revive and be healed to 20%\r\nbetween 50 and 54 the target will revive and be healed to 30%\r\nbetween 55 and 59 the target will revive and be healed to 40%\r\nbetween 60 and 64 the target will revive and be healed to 50%\r\nbetween 65 and 69 the target will revive and be healed to 60%\r\nbetween 70 and 74 the target will revive and be healed to 70%\r\nbetween 75 and 79 the target will revive and be healed to 80%\r\nbetween 80 and 89 the target will revive and be healed to 90%\r\nbetween 90 and above the target will revive and be healed to 100%\r\n\r\nWhere it Can Be Found \r\nUsing the Main file the spell comes in two forms tome or scroll both can be gotten in whiterun or the collage in winterhold Using the optional file and no other mod that replaces the LitemScroll forms it may be found randomly at other vendors or as loot.\r\n\r\n one scroll can be found free in whiterun.\r\n\r\nDo not waste your scrolls on animals or undead this will only resurrect people the same group that can be made into dead thrall/reanimated ones and was mainly intended to resurrect dead followers or a quest required npc that ocasionaly gets killed by dragons/bandits/etc. \r\nIF the Target is dismembered or turned into ashes it probably wont be able to be resurrected.\r\n\r\n\r\nHow it works\r\ncreates a new spell called Resurrection found Under restoration\r\nWhen executed it will resurrect any npc target that could have been reanimated using the normal spells that makes them a follower only this one leaves them back in there normal state that means if you resurrect an enemy it will attack you again.\r\nduring the resurrection process the standard inventory contents are transfered to a hidden container in a dummy cell then back to the npc after the resurrect command is given to avoid loosing items you have given a follower when resurrecting them.\r\n\r\nKnown Bugs.\r\n\r\nNPC that spawn dead can not be resurrected they will fall dead again as they are programed to be dead at spawn.\r\nNPC that are actually containers llike the ones found in that pit where the vampires are will not resurrect or will just stand there after being resurrected.\r\nSome random NPCs that are encountered like Frightened Woman that tells you where mystwatch is may follow you around untill you execute EVP in the console on them not shure why as the resurrect effect is supposed to do this at its end so far have only ran into 2 npc that do this the one mentioned and one of the ones outside of riften.  Added a utility.wait at effect finish followed by EVP to hopefully fix this\r\n\r\nDue to the way the npcs handle clothes they will respawn with the default clothes back in thier inventory even if it was looted before being resurrected.(in the editor the characters have 3 slots normal clothes, sleeping clothes, and the normal inventory this is what causes the clothes to be back if they were looted before resurrecting.) Added lines to hopefully prevent this.\r\n\r\nSome NPC characters that set quest variables for dialogue to refer to them as dead may still be talked about as dead for example if the player revives the leader that is killed at the end of the war whatever side you chose the side that lost thier leader will still have the dialogue of them being dead or if it checks to see if the character ever died instead of is currently dead.\r\n\r\nUpdate V2\r\n\r\nAdded the line to make them give the response they give when being healed after they are resurrected.\r\nIncreased the delay 1 second so the animation progresses a bit further before the script resurrects them\r\nAdded a delay at the end before the EvaluatePackage command is issued to give a bit more time before the followers run off for you to talk to them as the game auto fires them on death.\r\n\r\n\r\nUpdate V3\r\n\r\nThe same file as before but with the extra changes crazyjackal discovered removed. I still have no idea how the locations other than whitrun got changed and all I changed there was adding the scroll on the desk in the room with the enchanter.\r\n\r\n\r\nUpdate V4\r\n\r\n1) Added a menu when it first runs where you can select to have the mod install the spell to use either scroll only, book only, or both scroll and book (the menu will still pop up once if you already use the mod and will only effect if the scrolls respawn if you select book only method existing ones will still be in the game.\r\n\r\n2) fixes a small bug that sometimes the resurrected would jump to a different spot instead of right where they were standing at the end of the animation.\r\n\r\n3) Placed some of the spawns as corpses npcs in a form list so they resist the spell rather than turn into a standing corpse the ones that show up using corpse or dead in the id filter in the Creation Kit or use those as a template. Some will still do this as they are not marked and some that were walking around sometimes do this anyway I have posted a picture showing one in the Creation Kit  and how it is flagged that I believe to be causing this to happen. Added an isdead check. if the npc is still a corpse after the resurrect command it will be replaced be a new actor from the same base object. The original will be sent to WIDeadBodyCleanupCell.\r\n\r\n4) Had it add the scroll to the  LItemScroll00Skill item if one of the scroll options was selected so hopefully it will show up as random loot or at vendors that sell that item throughout the game.\r\n\r\nNote\r\nIf a mod does not include the script source then no one else can customize that script for themselves. \r\nThough this is may be good for those that do not want someone else editing and releasing mods that they made without permission it makes it impossible to check some of the original scripts that came with the game or look into the cause of some conflicts between mods and learn  some of the syntax showing how to implement any commands not covered in the web pages about using the Creation Kit.  for example how the basic part of Reanimate works or most any of the spells. \r\n\r\nThe name.pex is the compiled version found in data\\\\scripts the name.psc found in data\\\\scripts\\\\source is needed by the creation kit to edit the scripts.  It also means that modders that want to allow their mods to be customized by those using them have to include extra files in the download. For example fcteresurrectscr.psc as well as the file fcteresurrectscr.pex\r\n\r\nVersion 5\r\n\r\nAdded lines to temp disable player controls move player into a dummy cell and back renable player controls this will appear as a brief black screen during the spell this seems to fix the ctd when talking to them immediately after resurrecting them.\r\n\r\nChanged a line in WIDeadBodyCleanupScript line was\r\n\r\nbool function checkForCleanup()\r\n\t\r\n\tif IsInFaction(WI.WINoBodyCleanupFaction)\r\n; \t\tdebug.trace(\\\"WIDeadBodyCleanupScript\\\" + self + \\\"In Faction WINoBodyCleanupFaction so NOT cleaning up body.\\\", 1)\r\n\t\t;do nothing\r\n\t\treturn true ;bail out of while loop\r\n\t\t\r\n\tElseif Is3DLoaded() == False\r\n\r\nchanged to \r\nbool function checkForCleanup()\r\n\t\r\n\tif IsInFaction(WI.WINoBodyCleanupFaction) || IsDead() == 0\r\n; \t\tdebug.trace(\\\"WIDeadBodyCleanupScript\\\" + self + \\\"In Faction WINoBodyCleanupFaction so NOT cleaning up body.\\\", 1)\r\n\t\t;do nothing\r\n\t\treturn true ;bail out of while loop\r\n\t\t\r\n\tElseif Is3DLoaded() == False\r\n\r\nthis should fix some of them to not vanish or cleanup if they have been brought back to life.\r\n\r\n\r\nVersion 6\r\n\r\nThanks to Profe for reminding me about the relationship rank I should have thought about that variable the first version of the mod and Nemulus for reminding me about cleaning the mod the creation kit it seems changes some things that are not even looked at sometimes as well as leaves some changes that were removed in the mod.\r\n\r\nIn this version it will set a variable to the relationship rank when starting and then sets the relationship rank back after the resurrect command is given.\r\n\r\nBasicly added the lines below in the appropriate locations\r\n\r\nInt Property frel  Auto  \r\n\r\nfrel = akTarget.GetRelationshipRank(Game.GetPlayer())\r\n\r\nakTarget.SetRelationshipRank(Game.GetPlayer(), frel)\r\n\r\nAdded a fade to black that covers the player being moved to a dummy cell and back this eliminated the ctd of saving right after resurrecting that still happened after I cleaned the mod.\r\n\r\nVersion 7\r\nTweaked the fade to black to better cover the item removal and return as well as the cell change from and back. \r\n\r\nAdded the below listed variables to the ones that are stored before resurrecting and reset to the stored value after.\r\n\r\n HealRate \r\n MagickaRate \r\n StaminaRate \r\n attackDamageMult \r\n SpeedMult \r\n WeaponSpeedMult \r\n CarryWeight \r\n CritChance \r\n MeleeDamage \r\n UnarmedDamage \r\n VoicePoints \r\n VoiceRate \r\n DamageResist \r\n PoisonResist \r\n FireResist \r\n ElectricResist \r\n FrostResist \r\n MagicResist \r\n NormalWeaponsResist \r\n Paralysis \r\n Invisibility \r\n NightEye \r\n DetectLifeRange \r\n WaterBreathing \r\n WaterWalking \r\n JumpingBonus \r\n WardPower \r\n\r\n Aggression \r\n Confidence \r\n Energy \r\n Morality \r\n Mood \r\n Assistance \r\n WaitingForPlayer \r\n\r\n OneHanded \r\n TwoHanded \r\n Marksman \r\n Block \r\n Smithing \r\n HeavyArmor \r\n LightArmor \r\n Pickpocket \r\n Lockpicking \r\n Sneak \r\n Alchemy \r\n Speechcraft \r\n Alteration \r\n Conjuration \r\n Destruction \r\n Illusion \r\n Restoration \r\n Enchanting \r\n Magicka \r\n Stamina \r\n Health \r\n\r\nVariable01\r\nVariable02\r\nVariable03\r\nVariable04\r\nVariable05\r\nVariable06\r\nVariable07\r\nVariable08\r\nVariable09\r\nVariable10\r\n\r\nVersion 8\r\n\r\nAdded an alternate animation option now when starting you can choose between the existing animation or the restoration animation the only difference will be the swirling animation both will still stand up. Note if yo want the new animation without reinstalling the mod open the console and type\r\nprid xx00aa77 ; xx will be replaced by where you have the mod in the load order\r\nsetav variable10 1\r\n\r\ntweaked the fade/out and added sound during the blackout portion\r\n\r\nadded a line that should make hostile npc take a little longer before becoming hostile again after resurrection.\r\n\r\nMade a change to how the health variable is handled that might fix the stacking health issue some reported cant actually test as I have been unable to reproduce the error.\r\n\r\nedit\r\nRe uploaded ver8 after finding the file header count was off after making an edit in TESVSnip to remove forms that the creation kit altered even though I did no editing to them and correcting the error.\r\n\r\nVersion 9\r\nThis version includes the ability to resurrect the standard player horses from the base game.\r\nThis should also allow Sinding to be resurrected.\r\nThis was done by adding form list fcteexceplist the target is now checked and if it fails the checks previously done to see if it resists it will then check if its in this list and will resurrect them without using the standup animation.\r\n\r\nVersion 10\r\nYou will need to remove the old files fcresurrectquestscr.pex, fcteresurrectscr.pex and the psc files with the same name in this version they are in a bsa file. This is version 9 with the previously mentioned change and the removal of the player being moved to a dummy cell and back for those having issues with lost followers.",
  "categoryId": "75",
  "version": "8",
  "author": "fcterryb",
  "createdUnix": "1334507666",
  "updatedUnix": "1371885034",
  "containsAdultContent": false,
  "uploadedBy": "fcterryb",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103768",
      "name": "FcteResurrectv7",
      "version": "7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22",
      "fileName": "FcteResurrectv7-15236-7.zip",
      "uploadedUnix": "1354942322",
      "modVersion": "7",
      "virusScanUrl": "https://www.virustotal.com/file/e480ae0b744aaed66d8b4918b99d18688e0ef525e52674de5bc083428e928fd4/analysis/1407294662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FcteResurrectv7-15236-7.zip?fid=103768&ttl=1535779480&ri=8192&rs=8192&setec=22000e0ea9fb38811c26717af405224d"
    },
    {
      "fileId": "1000013451",
      "name": " FcteResurrectv8",
      "version": "8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23",
      "fileName": " FcteResurrectv8-15236-8.zip",
      "uploadedUnix": "1361911389",
      "modVersion": "8",
      "virusScanUrl": "https://www.virustotal.com/file/5a8d345ecc1fdc0229db7cdf0a6dbc83e9a4bdb90dcb4e1b0b37dfe40699fd30/analysis/1407441157/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/%20FcteResurrectv8-15236-8.zip?fid=1000013451&ttl=1535779480&ri=8192&rs=8192&setec=a518e421574410c500ac331873c0cc12"
    },
    {
      "fileId": "1000019567",
      "name": "FcteResurrectv9",
      "version": "9",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "24",
      "fileName": "FcteResurrectv9-15236-9.zip",
      "uploadedUnix": "1364001790",
      "modVersion": "9",
      "virusScanUrl": "https://www.virustotal.com/file/c11a9a54108c793c737caabd5be5ad26e0a0db2a821fb79f640359932602ebdd/analysis/1407483663/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FcteResurrectv9-15236-9.zip?fid=1000019567&ttl=1535779481&ri=8192&rs=8192&setec=46de168b3faeac8e1b615d7b86cca210"
    },
    {
      "fileId": "1000035270",
      "name": "fcresurrect10",
      "version": "10",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "23",
      "fileName": "fcresurrect10-15236-10.zip",
      "uploadedUnix": "1371885034",
      "modVersion": "10",
      "virusScanUrl": "https://www.virustotal.com/file/13cde90a79f88241449642d9efe16eaa2e24c03a99c294c50ae0ad999eda76f2/analysis/1407612613/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/fcresurrect10-15236-10.zip?fid=1000035270&ttl=1535779481&ri=8192&rs=8192&setec=94abb690aa83ee1bdb90172055671702"
    }
  ]
}