{
  "modId": 15239.0,
  "modName": "STEP - Skyrim Total Enhancement Project TRADUZIONE ITALIANA",
  "summary": "Traduzione italiana del file STEP - Skyrim Total Enhancement Project di TheCompiler\r\nTHIS IS ONLY A TRANSLATION OF THE ORIGINAL MOD",
  "descriptionHtml": "[color=red][size=+2][center]NOTICE![/color][/size][/center]\r\n[color=red][size=+1][center]This is only a translation into Italian of the original mod. All credits go to the creator of the [url=http://skyrim.nexusmods.com/downloads/file.php?id=11]original mod[/url].\r\nSTEP is an extensive, step-by-step and always updated guide to enhancing TESV Skyrim with the actual best mods, tweaks and settings; the focus is quality, non quantity. \r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.[/color][/size][/center]\r\n[color=green][size=+5][center]UNA PRODUZIONE DRAGONBORN ITALIA[/color][/size][/center]\r\n\r\n[color=green][size=+1]Novità[/color][/size]\r\n[b]09 Maggio 2012[/b] - Aggiornato alla v2.1.1b; aggiornati tutti i tag ed i link alle traduzioni (se esistenti).\r\n[b]20 Aprile 2012[/b] - Aggiornato il tag della mod \\\"Categorized Favorites Menu-Mods Compatibility Config\\\" a [u]non tradotto[/u] invece che [u]non richiede traduzione[/u]. Aggiornati anche alcuni tag e corretti piccoli errori. \r\n[b]19 Aprile 2012[/b] - Aggiornata l\\'intero STEP-2 con i link alle traduzioni o i vari tag. Il tag \\\"in sospeso\\\" sta a significare che la traduzione sta per uscire a breve. \r\n[b]17 Aprile 2012[/b] - Aggiornato lo STEP-2B della versione italiana con tag riguardanti le traduzioni (se esistente, se non è necessaria ecc.) e i link a queste se presenti. Ulteriori sezioni saranno aggiornate prestissimo!\r\n[b]20 Marzo 2012[/b] - L\\'autore ha cominciato a lavorare sul nuovo aggiornamento della guida. Ci vorrà ancora un po\\' perché dopo l\\'aggiornamento alla versione 1.5 di Skyrim molte mod hanno avuto bisogno di un aggiornamento. \r\n\r\n[color=green][size=+1]DESCRIZIONE[/color][/size]\r\nSTEP è una guida sempre aggiornata per migliorare il nostro TESV: Skyrim con le migliori mod attuali, modifiche e le impostazioni migliori; l\\'obiettivo è la qualità, non la quantità.\r\nQuesta è una guida fatta di suggerimenti, niente di più. Potete installare le mod suggerite se volete, ma non c\\'è niente di obbligatorio. Inoltre ho provato a rimanere il più vicino possibile alla versione Vanilla di Skyrim sia nel migliorare la qualità grafica che nel sistemare i problemi del gioco. \r\nCome detto è una guida fatta di suggerimenti. Suggerimenti nati dal lavoro di una persona che ha messo insieme i suggerimenti e le idee di centinaia di utenti che hanno collaborato alla riuscita di questa guida. \r\nPotete utilizzare quindi questa guida come esempio per poi utilizzare scelte vostre più consone al vostro gusto e al vostro impianto, oppure utilizzare le informazioni consigliate nella guida. \r\n\r\n[color=green][size=+1]COME OTTENERE STEP[/color][/size]\r\nNella sezione \\\"mirrors\\\" in alto a sinistra è presente il link alla community DragonBorn Italia.\r\nNavigate alla sezione \\\"Files\\\" della community e cercate STEP. Scaricatelo e nell\\'archivio troverete la guida in formato pdf. \r\nPer leggerla vi servirà [url=http://get.adobe.com/it/reader]Adobe Reader[/url] o [url=http://blog.kowalczyk.info/software/sumatrapdf/download-free-pdf-viewer.html]Sumatra PDF[/url], entrambi freeware. \r\n\r\n[color=green][size=+1]NOTE ALLA TRADUZIONE[/color][/size]\r\nQuesta traduzione è stata autorizzata dall\\'autore della guida originale TheCompiler. Essendo questa la prima versione tradotta ho omesso tutta la parte riguardante i vari aggiornamenti effettuati alla guida, parte che comincerò a includere dalla prossima versione in poi. \r\nI link alle mod presenti nello STEP-2 sono tutti in Inglese, ho tradotto la guida non tutte le mod presenti in essa. Sono in inglese anche i link che indirizzano a guide specifiche, video o alla pagina Facebook ufficiale. \r\nSono rimasti in inglese anche i nomi delle varie mod, non credo di dover spiegazioni su questo. \r\nNelle parti più avanzate della guida vi capiterà di incontrare parole inglesi, questo perché nel linguaggio informatico ci sono termini non traducibili che vengono utilizzati universalmente nella loro versione inglese. Se desiderate chiarimenti prima di buttare tutto per aria vi consiglio di fare un giro su Wikipedia per capirne il significato o in seconda chance di contattare me, sarò lieto di darvi una mano o di chiarire i vostri dubbi. \r\nSottolineo che tutte le modifiche ai file .ini che saranno elencate più avanti nella guida sono in inglese e così devono rimanere. Tali file sono sempre in inglese non importa in quale lingua giochiate.\r\nSe avete consigli, osservazioni, lamentele o se notate errori ecc. non esitate a contattarmi o a lasciare un commento sulla pagina della traduzione. Come sottolinea giustamente l\\'autore di questa guida, questo è il progetto di una comunità e senza una comunità attiva si procederebbe molto più lentamente. \r\nLasciatemi chiudere con un grande ringraziamento a TheCompiler che mi ha permesso di tradurre il suo lavoro ed ha permesso a tutti coloro che non hanno una sufficiente conoscenza dell\\'inglese di fruire dei suoi consigli. \r\n[b]Demea[/b].\r\n\r\n[color=green][size=+1]Una nota riguardante i tuoi (essenziali) suggerimenti:[/color][/size]\r\n\\\"[i]Io ho accesso alle novità riguardanti le nuove mod proprio come voi. Laddove possibile aggiungere informazioni riguardanti:\r\n- test fatti sulla mod in questione (non limitatevi ai soliti commenti “sembra bello dalle immagini”);\r\n- test abbastanza approfonditi da essere sicuri che un determinato bug possa essere eliminato o no;\r\n- commenti che includano specificamente il perché quella mod la considerate bella;\r\n- commenti specifici sul perché considerate che la mod rimanga fedele all\\'idea originale di Skyrim e, se così non fosse, perché considerate che vada installata   lo stesso;\r\n- dove possibile sottolineare ogni incompatibilità scoperta dopo aver testato la mod.\r\n\r\nAltrimenti dovrò vedermela con venti raccomandazioni di nuove mod al giorno, e dovrei fare tutti i test da solo. \r\n\r\nInoltre, ho sempre bisogno di qualcuno che lavori con me e che mi aiuti a catalogare tutti i suggerimenti. Se desiderate aiutare contattatemi privatamente con una lista dei suggerimenti fatti dagli utenti nei giorni passati, sarete ringraziati sulla pagina ufficiale di STEP ;). [/i]\\\" TheCompiler\r\n\r\n[center][color=green][size=+1]RINGRAZIAMENTI SPECIALI:[/color][/size][/center]\r\n[center]Bethesda Softworks – per questo gioco fantastico.\r\nTutti i modders – per le mod raccomandate nello STEP-2.\r\nL\\'intera comunità del Nexus – per il supporto.\r\nLa piccola comunità di STEP – per i suggerimenti e l\\'aiuto fornito\r\nSome_Dude e il team di sviluppo dell\\'FXAA PP Injector – per l\\' FXAA PP Injector, sul quale si basa l\\'iCCC di TheCompiler.\r\nKiraKatRou – per il logo della guida.\r\n\r\nUn ringraziamento davvero speciale va a [b][url=http://skyrim.nexusmods.com/modules/members/index.php?id=2547509]TheCompiler[/url] (Daniel)[/b], l\\'autore di questa guida, senza il quale probabilmente avremmo molti più problemi e non sfrutteremmo al massimo il nostro TESV: Skyrim, quindi GRAZIE!!![/center]",
  "categoryId": "79",
  "version": "2.1.1b",
  "author": "Demea",
  "createdUnix": "1334508581",
  "updatedUnix": "1334508581",
  "containsAdultContent": false,
  "uploadedBy": "Demea",
  "primaryFile": null,
  "files": []
}