{
  "modId": 15249.0,
  "modName": "Khajiit Follower - Spouse Companion Pair",
  "summary": "Khajiit Custom NPC Companion pair of Followers-Spouses. 1 Male. 1 Female.",
  "descriptionHtml": "[center]\r<br />[size=8]\r<br />[color=orange]\r<br />Khajiit Follower & Spouse Companion Pair\r<br />[/color]\r<br />[/size][/center]\r<br />[center]\r<br />[url=http://imgur.com/61JBnW9][img]http://i.imgur.com/61JBnW9.jpg?1[/img][/url][/center]\r<br />\r<br />====================================\r<br />Foreword\r<br />====================================\r<br />\r<br />Mysteriously, Skyrim shipped with no Khajiit or Bosmer NPCs who could be spouses. No marriageable Khajiit and Bosmer were available (as of 04/15/2012) in Vanilla Skyrim when I created the first rendition of this mod.\r<br />To my knowledge, at that point, there were no Khajiit and a few Bosmer Custom NPCs available who can be BOTH Followers and Spouses. Therefore, to answer this gap and discrimination against Bosmer and Khajit races, I created this duo mod.\r<br />I split it up into two mods. The Khajiit pair of one male and one female NPCs are included in this mod. The Bosmer pair of one male and one female NPCs in my accompanying mod. As of Version 2.0, both male and female characters are downloaded together as one package.\r<br />\r<br />[color=yellow]\r<br />====================================\r<br />VERSION 2.0 CK METHOD\r<br />====================================\r<br />[/color]\r<br />[Replaces OUTDATED NPC Editor and ESM/ESP Methods in Log History File]\r<br />Everything works. All Follower and Spouse functions work. 100% tested and verified. Still, please do report any bugs/glitches/odd behavior, etc.\r<br /> \r<br />Name: RI&#39;DOSAN\r<br />Location: FALKREATH - DEAD MAN&#39;S DRINK INN\r<br />Gender: MALE\r<br />Archetype: WARRIOR\r<br />Class: CombatWarrior1H\r<br />Combat Style: csForswornBerserkerLow [This is the Dual-Wielding style, one-handed swords preferrably]\r<br />Specialization: Blademaster\r<br />Skills: One-Handed\r<br />CLOTHES/ARMOR: Steel Armor. Prefers any Heavy Armor.\r<br />INVENTORY: Two Scimitars\r<br />APPEARANCE: Orange Red Fur [Lion?]. Hair Type: Apachii Hair Male Khajiit 01. EyeColor: Khajiit Gold. Height: 1.07. Weight: 100.\r<br />SETUP: Unique, Essential, Doesn&#39;t Affect Stealth Meter, Aggressive, Foolhardy(never flees combat).\r<br />STATS: Start LVL 10, Max LVL 99. 150 Speed. 150 Health offset, 150 Magicka offset, 200 Stamina offset. \r<br />PERKS: LightFoot, MuffledMovement, QuietCasting, Recovery50, MagicResistance30, Regeneration\r<br />\r<br />Name: S&#39;FEENA\r<br />Location: FALKREATH - GRAVE CONCOCTIONS\r<br />Gender: FEMALE\r<br />Archetype: MAGE\r<br />Class: CombatSfeena [Custom Class: Only Restoration spells and progression. Relies on Staves to do damage]\r<br />Combat Style: csCombatSfeena [Custom Combat Style: Highest priority 10 on Staves, Magic, and Long Distance. 0 on Melee, Shouts, etc]\r<br />Specialization: Staffmaster Cleric\r<br />Skills: Restoration primarily, Conjuration\r<br />CLOTHES/ARMOR: Desert Redguard Clothes\r<br />APPEARANCE: White Fur [Snow Leopard?]. Hair Type: Apachii Hair Female Khajiit 12. EyeColor: Khajiit Blue. Height: 0.97. Weight: 0.\r<br />INVENTORY: Staff of Sparks [Can use any Destruction or Conjuration staff. Most Illusion, Restoration, or Alteration staves are not used]\r<br />SETUP: Unique, Essential, Doesn&#39;t Affect Stealth Meter, Aggressive, Foolhardy(never flees combat).\r<br />STATS: Start LVL 10, Max LVL 99. 0 Weight Scale. 150 Speed. 150 Health offset, 200 Magicka offset, 150 Stamina offset. \r<br />SPELLS: Healing Left Hand, Healing Right Hand, Fast Healing Left Hand, Grand Healing Left Hand, Greater Ward Left Hand, Oakflesh Left Hand, Stoneflesh Left Hand, Ebonyflesh Left Hand, Heal Other\r<br />PERKS: LightFoot, MuffledMovement, QuietCasting, MageArmor30, MagicResistance30, Recovery30, Regeneration, Restoration Novice-Master\r<br />\r<br />====================================\r<br />REQUIRED MOD [Master File]\r<br />====================================\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=10168]Apachii Sky Hair[/url] by apachii\r<br />Note: Be sure to have a total of 3 Apachii Sky Hair files (main, males, and females). Otherwise, no custom hairs&#33;\r<br />\r<br />====================================\r<br />INSTALLATION\r<br />====================================\r<br />\r<br />For ease of use, download and install using [url=http://www.nexusmods.com/skyrim/mods/modmanager/?]Nexus Mod Manager[/url].\r<br />For manual install, simply extract the contents of the archive into your Data folder.\r<br />For proper mod sorting, BOSS is no longer supported. BOSS version 3.0 is effectively LOOT. So now, as of 12/06/2014, I recommend LOOT for load order sorting: [url=http://loot.github.io/]LOOT[/url]\r<br />\r<br />-Installation: \r<br />    A. NMM: Just click &#34;Download with Manager&#34;\r<br />    B. Manual: Unpack and Drop the ESP file and the Meshes/Textures folders under your Data folder with other ESP files and folders\r<br />\r<br />-Uninstallation:\r<br />    A. NMM: Just click &#34;Unsubscribe&#34; and/or &#34;Delete&#34;\r<br />    B&gt; Manual: Just delete the BosmerCompanion.ESP under Data and the BosmerCompanion.esp folders in the Meshes and Textures folders.\r<br />\r<br />Meshes location: \r<br />meshes&#92;actors&#92;character&#92;facegendata&#92;facegeom&#92;AIBosmerCompanions.esp\r<br />Textures location:\r<br />textures&#92;actors&#92;character&#92;facegendata&#92;facetint&#92;AIBosmerCompanions.esp\r<br />\r<br />--------------------------------------------------------------------------------------\r<br />Conflicts: None Known\r<br />--------------------------------------------------------------------------------------\r<br />\r<br />====================================\r<br />ACQUISITION\r<br />[Where to find these custom NPCS?]\r<br />====================================\r<br />\r<br />RI&#39;DOSAN LOCATION:     FALKREATH - DEAD MAN&#39;S DRINK INN\r<br />S&#39;FEENA LOCATION:     FALKREATH - GRAVE CONCOCTIONS\r<br />\r<br />====================================\r<br />MODS RECOMMENDED\r<br />====================================\r<br />\r<br />muppetpuppet [url=http://www.nexusmods.com/skyrim/mods/9782/?]Moonpath to Elseweyr[/url]\r<br />NOTE: I just find it great to take these Khajit followers/spouses into this mod. Should be real fun&#33; I haven&#39;t yet played this mod, but certainly am looking forward to it&#33; )))\r<br />\r<br />----------------------------------------------------------------------------------------\r<br />CHARACTER ENHANCEMENT MODS (BODY, HAIR, FACE, EYES, ETC) - Reflected on Screenshots\r<br />----------------------------------------------------------------------------------------\r<br />Note: My laptop sucks, your screenshots will prolly look better\r<br />\r<br />apachii [url=http://skyrim.nexusmods.com/downloads/file.php?id=10168]Apachii Sky Hair[/url]\r<br />mrLenski [url=http://www.nexusmods.com/skyrim/mods/5941/?]Coverkhajiits[/url]\r<br />\r<br />\r<br />----------------------------------------------------------------------------------------\r<br />\r<br />\r<br />======================\r<br />THE CHARACTERS\r<br />======================\r<br />Read on about my backstories for this character duo. Completely optional. \r<br />[quote]\r<br />Khajiit Pair\r<br />\r<br />RI&#39;DOSAN\r<br />Background: Ri&#39;dosan is a proud Khajiit warrior. Inside this rather large Khajiit beats a calm soldier&#39;s heart, a profession shunned by most Khajiit. Yet, the best guards are warriors not thieves after all. And Ri&#39;dosan&#39;s family have proven themselves to be the choicest stock of Elsewyr royal Vanguard, for generations.\r<br />\r<br />The elders of Ri&#39;dosan&#39;s clan saw to it that his skills did not go to waste in Elsewyr alone. So they assigned him to escorting a royal cleric on an important mission into Skyrim. &#34;For the good of Elsewyr and its alliance with the Thalmor&#33;&#34;, they clamored. Ri&#39;dosan didn&#39;t need no further explanation. He just craved for the next adventure.\r<br />\r<br />Thus, Ri&#39;dosan recently passed through Moonpath, a mystical gateway to Elsewyr. In defense of his escort, Lady S&#39;feena, he braved the horrors, single-handedly vanquishing them down. Yet, he didn&#39;t come without a few bruises which he is now licking off at an inn in Falkreath. Now, Ri&#39;dosan is leisurely drinking away the bad memories from that harrowing exit from Moonpath at Dead Man&#39;s Drink Inn.\r<br />\r<br />Friend: S&#39;feena. The reclusive, serene Cleric, whom Ri&#39;dosan is tasked to protect at all costs, keeps her lips tight about the full nature of her business in Skyrim. Unlike most nosy Khajiits like the infamous M&#39;aiq bloodline, Ri&#39;dosan is perfectly content with not knowing the full ramifications of his mission. At this, S&#39;feena is much relieved, but somehow restless still. Ri&#39;dosan is puzzed by all her fidgeting and tail-twirling. The woman just can&#39;t seem to get her act straight. \r<br />\r<br />Love Interest: Possibly the Dragonborn, if the player so wishes. If the Dragonborn (player) is not interested in Ri&#39;dosan, he will develop more than just a vocational relationship with his consort, S&#39;feena. Smoothly, they will settle together and  work on solidifying trade links from Skyrim through Moonpath to Elsewyr, thus helping both of their noble houses.\r<br />\r<br />\r<br />--------------------------------------------------------------------------------------\r<br />\r<br />\r<br />S&#39;FEENA\r<br />Background: S&#39;feena is a Thalmor-loyalist Khajiit staffmaster cleric. She is bound on a secret mission into Falkreath. She has been provided with the dependable Captain Ri&#39;dosan as her guard escort, from the ranks of the venerable Royal Vanguard itself&#33;\r<br />\r<br />He single-handedly ensured smooth passage through through Moonpath from Elsewyr. Having traversed this treacherous passage, S&#39;feena visited the local Falkreath apothecary shop, the Grave Concoctions, to ameliorate Ri&#39;dosan&#39;s wounds with some healing salves to augment her formidable Clerical healing that already sealed the gravest of Ri&#39;dosan&#39;s wounds.\r<br />\r<br />While full details of S&#39;feena&#39;s mission are hidden, her House&#39;s checkered past may shed light on some of it. Skooma trade dropped sharply in several provinces. Many Khajiit merchants thought that the Gold-White Concordat would settle differences between the Cyrodillic and Aldmerri empires, paving way for trade to flourish. However, this cold war is proving to be stifling for the economy of Elsewyr. To survive, most Khajiit houses fell back on what every Khajiit is best at - sneaking, back-stabbing, and assassinating. Thus, the Khajiit nobles mustered their dwindling resources and arms, only to prey on what little of Skooma trade trickled from beyond Elsewyr. Her family included, ashamedly.\r<br />\r<br />Therefore, the powers that be in Elsewyr allowed for one and only one chance for her House&#39;s redemption. She is that chance. S&#39;feena is determined not to let slip this chance through her fingers, like the myriad, fine sands of Elsewyr tend to do.\r<br />\r<br />Friend: Ri&#39;dosan. The gallant Ri&#39;dosan hails from a noble lineage. Throughout the Skooma trade debacle, the unflinching stock of Ri&#39;dosan&#39;s House did not falter, did not resort to any dirty tactics. Their business dealings remained impeccable; their promises remained fulfilled. In Ri&#39;dosan&#39;s infallible character (a rarity in most Khajiit men), S&#39;feena finds strength, vigor, and most importantly trust. \r<br />\r<br />Love Interest: Possibly the Dragonborn, if the player so wishes. If the Dragonborn (player) is not interested in S&#39;feena or Ri&#39;dosan, S&#39;feena will gravitate towards Ri&#39;dosan&#39;s strong, steadfast character. \r<br />She will steadily disclose her growingly meowing affections for him and he will gently purr back mutually. [/quote]\r<br />\r<br />\r<br />====================================\r<br />FILE LOG HISTORY\r<br />====================================\r<br />OLD VERSIONS 1.6, 1.5, 1.0. Optional read.\r<br />\r<br />[quote]NOTE: The voices are generic male and female voices, not Khajiit voices. As you most have probably guessed, Khajiit voice types do not support marriage functions because there are no dialogue or voiceover acting (VAs) for them. \r<br />I tried to find fitting voices to the character looks and RP stories as best I could.\r<br />\r<br />Version 1.6 [Old OUTDATED NPC Editor Method & ESM for Characters Structure -- DO NOT USE&#33;&#33;&#33;] 04/21/2012\r<br />1) FIX: BOTH Followers can now dual wield, if you give them 2 swords or daggers. Before, they weren&#39;t able to. So now you can fashion them into melee assassins, if you so wish. Both start with two daggers, if wanting dual wield instead of archery with bow and arrow. Just remember to unequip weapons of which style you don&#39;t want.\r<br />2) Both Followers default outfit is TREATED as clothing, even if it looks like armor. So you can still equip them how you like. This new way however the Followers retain their battle-ready gear, instead of being in travelling drab.\r<br />On the Horizon: Before 2.0 quests, I&#39;m planning to implement VA for at least the male Bosmer, Enver Camoran, covering all Follower and Spouse function dialogue with custom voice. VA will be provided by myself for now. Still, I&#39;m looking for experienced male VA to voice this Follower.\r<br />CALL OUT to any interested female VAs to voice the Bosmer female, Sihaya Ankaran.\r<br />\r<br />Version 1.5 [Old OUTDATED NPC Editor Method & ESM for Characters Structure -- DO NOT USE&#33;&#33;&#33;] 04/19/2012\r<br />For version 1.5, NPCs start out with instantly available Follower and Marriage functions. No hassle, no quests. Version 3.0 will add quests.\r<br />For most people, version 1.5, should be more than enough to fulfill the present gap in Bosmer followers/spouses, I hope&#33; ^_^\r<br />1) FIX: ESM package structure fixes the Head Tint problem where the head tint was different from the rest of the body\r<br />2) ADVANTAGE: NPCs start with clothes, so now they&#39;re upgradeable with armor of your choosing. Allows for flexibility. Version 1.0 was stuck with the original armors most of the time.\r<br />3) ADVANTAGE: NPCs stay in current location. They don&#39;t go back to original location. Wherever you last left them, there they&#39;ll stay. Version 1.0 had them go back all the way to the first location where you found them, Editor location. This isn&#39;t ideal.\r<br />4) Downside: Both NPCs of the Pair get installed. No more choice in installing one or the other. \r<br />5) Both characters are auto-level up version. NPCs will level up same as player, but from level 5 to 120\r<br />Note: This doesn&#39;t mean you have to recruit or play with the other you don&#39;t want. However, what it does mean is better preparation for Quests since now not only these featured Bosmer &#34;main&#34; NPCs but also any supporting quest NPCs would be under the same managerial umbrella.\r<br />\r<br />Version 1.0 (Unsupported Direction because of inherent flaws of this design) 04/15/2012\r<br />1) Advantage: STAND-ALONE ESP structure. Choose your character. Each character separate from the other in the pair.\r<br />2) FLAW: NPCs have the Head Tint issue where their heads are a jarringly different color than the rest of the body. Fixed in version 1.5\r<br />3) Disadvantage: NPCs start out with a preset armor that is difficult to replace since it&#39;s decent. Limited Player customization and flexibility in equipping these NPCs. Fixed in version 1.5\r<br />4) Disadvantage: When discarded, NPCs went back to Editor location, the original location of their spawn. Fixed in version 1.5[/quote]\r<br />\r<br />================================================================\r<br />V3.0 FUTURE DEVELOPMENT\r<br />quests/dialogue/scripting(no VAs for now, sorry)\r<br />================================================================\r<br />[quote]\r<br />Upcoming Version 3.0\r<br />Motive: My aim is to bring greater Thalmor presence into Skyrim, to represent their side through these Bosmer and Khajiit pairs of followers/spouses, via their dialogue/quests/story arcs. \r<br />More than just providing bare-bones Bosmer & Khajiit custom NPC Followers/Spouses (base updated version 2.0), I&#39;d like to develop the Thalmor story more with quests coming for these pairs with version 3.0, that is if I ever get to it however, lawls.\r<br />\r<br />Priority #1: Loyalty Quests\r<br />(Version 3.0)\r<br />Choice Pathway A (Anti-Thalmor): NO Thalmor Faction standing for ALL NPCs (since most players are anti-Thalmor, I think). If this Quest choice is chosen, then both the Player and these NPCs stay unfriendly with Thalmor.\r<br />Choice Pathway B B (Pro-Thalmor): YES Thalmor Faction standing for ALL NPCs. This version will be my mod&#39;s &#34;canon lore&#34; version for these characters. If this Quest choice is chosen, then both the Player and these NPCs become friendly with Thalmor.\r<br />\r<br />If player wishes to recruit this custom NPC as Follower or Spouse, then a Loyalty quest will have to be completed to get the Player to the trusted level of Ally, from whence one can both recruit the NPC as a Follower or propose marriage for the NPC to become a Spouse.\r<br />I&#39;ll work in a quest to gain their friendship/trust status first, before being able to recruit and/or marry them.\r<br />Ideally, I&#39;d like the quest to be more than just giving one gold coin (FavorsBeggarsFaction), instead through some quest to explore or kill some stuff.\r<br />\r<br />So, I now picture this Loyalty Quest bifurcating into two possible, diametrically opposed choices, A: Anti-Thalmor and B: Pro-Thalmor. So, Enver gets still has ONE Loyalty Quests but TWO different VERSIONS of the quest, depending on Player choice. Sihaya still gets just ONE Loyalty Quest, but TWO different VERSIONS of the quest, depending on Player choice. Thus, in essence, there are FOUR different available quests, for replayability sake. This way, the Player advances to Ally level with the said NPC and is able to propose marriage, having earned the NPC&#39;s trust (Ally level). Also, the Player&#39;s and NPC&#39;s Thalmor standing gets corrected.\r<br />\r<br />Thalmor Start (upcoming version 3.0) - meant for Player use, to be aligned with pro-Thalmor NPCs in this version\r<br />ALTERNATIVE: Instead of starting in the Thalmor Embassy as in that mod, here&#39;s a way to become Thalmor while still experiencing the standard game start in Helgen:\r<br />Just bring up the console with the tilde key (~) and type in the following:\r<br />\r<br />player.addtofaction 00039f27 0\r<br />\r<br />The above command adds Player to ThalmorFaction, making them not attack you\r<br />(For the sake of immersion, I do this at the ride towards Helgen, but arguably you can do so at any time, but the earlier the better)\r<br />\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />\r<br />\r<br />Priority #2: Personal and Group Aftermath Quests\r<br />(Version 3.0, both Quest versions A and B) - ALL Characters are DEPENDENT on their Paired FRIEND -\r<br />-If player marries this particular NPC (ex: Enver), then the following Aftermath effects will fire:\r<br />The Player-Married NPC&#39;s (ex: Enver&#39;s) friend (ex: Sihaya) will stay at Friend level with the NPC (ex: Enver). Some time after the Player&#39;s marriage to this particular NPC (ex: Enver), the NPC will offer a Personal Aftermath quest to conclude their individual story arc.\r<br />Therefore, 2 Personal Aftermath quests/story conclusions will be available for each sub-version, meaning 4 Personal Aftermath quests total.\r<br />\r<br />-If player marries an NPC who is not this particular NPC (ex: Enver) or its direct friend (ex: Sihaya), then the Group Aftermath effects will fire, including the Group Aftermath quest\r<br />Group Aftermath effects: the pair (ex: Enver and Sihaya) will get married (Married level). Moreover, they&#39;ll move in together into a common cell that will be their new home (custom-place hopefully). Once married and settled in, they will offer their final dual-shared (meaning if you ask either partner, it&#39;ll be the same quest) Aftermath quest and the Player would be able to join that quest, as a way to conclude their Group story arc (WIP2)\r<br />Again, these Aftermath quests will vary for each character pair now based on the sub-version used. Therefore, there will be 2 quests (one for the Bosmer pair, the other for the Khajiit pair) for version A, and 2 quests for version B, for a total of 4 Aftermath quests.\r<br />As you can tell, this structure allows for lots of flexibility. For example, if Player married Enver, than the player can do Enver&#39;s Personal Aftermath quest, including the Khajiiti pair&#39;s dual-shared Group Aftermath quest (since Player did not marry any of the Khajiits). And vice versa.\r<br />\r<br />At Version 3.0, I&#39;ll consider this mod finished per my vision, having established fully-fledged Bosmer/Khajit Followers/Spouses, complete with Loyalty and Aftermath bifurcating quests. Without the Thalmor political stance, it would be much easier, just a single Loylaty and single Aftermath quest per character though.\r<br />\r<br />Only improvement could be adding Voice-Overs, so I&#39;m giving a shout-out to the community if anybody is willing and able to recite all the dialogue lines (including vanilla/standard Follower/Spouse lines, in addition to original quest lines). Your input will be welcome for collaborative work on this project.\r<br />For example, if the mod author for Willow Companion from Fallout New Vegas is around Skyrim, I&#39;d appreciate her voicing the female characters. I can voice the males or find better community male VAs. Or, I can also romantically wait for my future wife and record her as my Sihaya(Desert Rose). Twill be fun&#33;\r<br />Also, I may add new adventures to these characters, if there&#39;s interest and time.[/quote]\r<br />\r<br />--------------------------------------------------------------------------------------\r<br />\r<br />Have fun&#33; Don&#39;t forget to endorse if you like this ;) This was my 1st mod in Skyrim YAY&#33; So please be gentle ^_^\r<br />\r<br />----------------------------------------------------------------------------------------------------------------\r<br />\r<br />[center]Check out my accompanying mod too[/center]\r<br />\r<br />[center]Bosmer Follower-Spouse Companion Pair[/center]\r<br />[center]\r<br />[url=http://www.nexusmods.com/skyrim/mods/15245/?tab=2&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodfiles%2F%3Fid%3D15245&pUp=1][img]http://i.imgur.com/M1YU6uw.jpg?1[/img][/url][/center]\r<br />\r<br />===============================\r<br />Thanks\r<br />===============================\r<br />\r<br />Thanks to Nexus sites for having this helpful website for beginner modders&#33;\r<br />[UPDATED CK Method]\r<br />Best Guide I&#39;ve found online on the new CK Method. Thanks FaeriexDecay for directing me to this treasure trove&#33;\r<br />http://hubpages.com/hub/Hot-to-Turn-Your-Skyrim-Character-into-a-Follower#\r<br />\r<br />[OUTDATED NPC Editor and ESM/ESP Methods]\r<br />Especially this link on Creating Followers: http://www.youtube.com/watch?v=AlepT3rQ8LI&feature=youtu.be&hd=1 \r<br />And thanks to Google user &#34;RighthandedMan25&#34; for guiding me into the right direction\r<br />\r<br />Thanks to Bethesda for Skyrim and Creation Kit\r<br />Thanks to faeriexdecay&#39;s support and artistic intervention, my originally lame-looking Bosmers, especially the female Bosmer, have improved graphically. Thanks for your assistance, faerie&#33;\r<br />Thanks to Blackie&#39;s CM New Companions mod&#39;s helpful &#34;CM Creating Custom Companions&#34; notepad file. Corroborated by forum talk, I&#39;ve been able to fix the annoying Head Tint issue, as well as improve my mod substantially. Kudos to faeriexdecay for directing me to him&#33; You both saved me lots of frustration, I&#39;m sure&#33;\r<br />Thanks a bunch to BravoOskar for answering my questions and getting issues resolved. I&#39;d like to collaborate and learn more from him. His Custom NPC mods are light years better than mine in many ways, especially graphically.\r<br />Thanks goes to all the patient modders out there who delivered all these great mods and instigated me to try my hand at modding. This is just the beginning, I hope :)\r<br />\r<br />NomadicAI7 12/10/2014",
  "categoryId": "66",
  "version": "2.0",
  "author": "NomadicAI7",
  "createdUnix": "1334516109",
  "updatedUnix": "1418270433",
  "containsAdultContent": false,
  "uploadedBy": "NomadicAI7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000138337",
      "name": "AI Khajiit Companions Version 2.0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "811",
      "fileName": "AI Khajiit Companions Version 2.0-15249-2-0.rar",
      "uploadedUnix": "1418188687",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/8de605638b3b389a2d23fc1dc087546fb7d3239af07643e0685a646ccf47de16/analysis/1418188745/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AI%20Khajiit%20Companions%20Version%202.0-15249-2-0.rar?fid=1000138337&ttl=1535779499&ri=8192&rs=8192&setec=db7c6a50118038956eab57581f82172f"
    },
    {
      "fileId": "1000138435",
      "name": "AI Khajiit Companions Version 2.0 Khajiit Voices for MFVM",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "811",
      "fileName": "AI Khajiit Companions Version 2.0 Khajiit Voices for MFVM-15249-2-0.rar",
      "uploadedUnix": "1418270433",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/274df84ae9a4ad962db93fd9cdfb3599103096f92eced92346c98f6698e46b83/analysis/1418270464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AI%20Khajiit%20Companions%20Version%202.0%20Khajiit%20Voices%20for%20MFVM-15249-2-0.rar?fid=1000138435&ttl=1535779499&ri=8192&rs=8192&setec=5bf25e8d51a7093522dffe21374e49d8"
    }
  ]
}