{
  "modId": 15245.0,
  "modName": "Bosmer Follower - Spouse Companion Pair",
  "summary": "Bosmer Custom NPC Pair of Follower-Spouse. Male: Enver. Female: Sihaya.",
  "descriptionHtml": "[center]\r<br />[size=8]\r<br />[color=green]\r<br />Bosmer Follower & Spouse Companion Pair\r<br />[/color]\r<br />[/size][/center]\r<br />[center]\r<br />[url=http://imgur.com/M1YU6uw][img]http://i.imgur.com/M1YU6uw.jpg?1[/img][/url][/center]\r<br />\r<br />====================================\r<br />Foreword\r<br />====================================\r<br />\r<br />Mysteriously, Skyrim shipped with no Bosmer and Khajiit NPCs who could be spouses. No marriageable Bosmer and Khajiit were available (as of 04/15/2012) in Vanilla Skyrim when I created the first rendition of this mod.\r<br />To my knowledge, at that point, there were no Khajiit and a few Bosmer Custom NPCs available who can be BOTH Followers and Spouses. Therefore, to answer this gap and discrimination against Bosmer and Khajit races, I created this duo mod.\r<br />I split it up into two mods. The Bosmer pair of one male and one female NPCs are included in this mod. The Khajiit pair of one male and one female NPCs in my accompanying mod. As of Version 2.0, characters are downloaded together as one package.\r<br />\r<br />[color=yellow]\r<br />====================================\r<br />VERSION 2.0 CK METHOD\r<br />====================================\r<br />[/color]\r<br />[Replaces OUTDATED NPC Editor and ESM/ESP Methods in Log History File]\r<br />Everything works. All Follower and Spouse functions work. 100% tested and verified. Still, please do report any bugs/glitches/odd behavior, etc. \r<br />\r<br />Name: ENVER CAMORAN\r<br />Location: RIVERWOOD - SLEEPING GIANT INN\r<br />Gender: MALE\r<br />Archetype: ARCHER\r<br />Class: Ranger\r<br />Specialization: Sniper\r<br />Skills: Archery, One-Handed\r<br />APPEARANCE: Face and Body Color 221-221-221 (Fair White complexion). Hair Type: ApachiiHairMELF06. EyeColor: Wood Elf Elder. Height: 1.05\r<br />INVENTORY: Bow, arrows, daggers. CLOTHED Hood-less Thieves Guild armor (Valenwood Farstriders)\r<br />COMBAT STYLE: CombatNightingale (favors Archery and One-Handed), csForswornBerskerLow (allows for dual wielding for melee daggers/swords)\r<br />SETUP: Unique, Essential, Doesn&#39;t Affect Stealth Meter, Aggressive, Foolhardy(never flees combat).\r<br />STATS: Start LVL 10, Max LVL 99. 65 Weight Scale. 150 Speed. 150 Health offset, 150 Magicka offset, 200 Stamina offset. \r<br />PERKS: LightFoot, MuffledMovement, QuietCasting, Conjuration Novice-Master, TwinSouls, ConjurationDoubleCast\r<br />SPELLS: Command Animal, Conjure Familiar Right Hand, Fast Healing Left hand\r<br />\r<br />Name: SIHAYA ANKARAN\r<br />Location: RIVERWOOD - SLEEPING GIANT INN\r<br />Gender: FEMALE\r<br />Archetype: ARCHER\r<br />Class: Ranger\r<br />Specialization: Spotter\r<br />Skills: Archery, One-Handed\r<br />APPEARANCE: Face and Body Color 221-221-221 (Fair White complexion). Hair Type: ApachiiHairFELF58. EyeColor: Wood Elf Emerald. Height: 1.00\r<br />INVENTORY: Bow, arrows, daggers. CLOTHED Hood-less Thieves Guild armor (Valenwood Farstriders)\r<br />COMBAT STYLE: CombatNightingale (favors Archery and One-Handed), csForswornBerskerLow (allows for dual wielding for melee daggers/swords)\r<br />SETUP: Unique, Essential, Doesn&#39;t Affect Stealth Meter, Aggressive, Foolhardy(never flees combat).\r<br />STATS: Start LVL 10, Max LVL 99. 100 Weight Scale. 150 Speed. 150 Health offset, 150 Magicka offset, 200 Stamina offset. \r<br />SPELLS: Command Animal, Conjure Familiar Right Hand, Fast Healing Left hand\r<br />PERKS: LightFoot, MuffledMovement, QuietCasting, Conjuration Novice-Master, TwinSouls, ConjurationDoubleCast\r<br />\r<br />====================================\r<br />REQUIRED MODS [Master Files]\r<br />====================================\r<br />1) [url=http://skyrim.nexusmods.com/downloads/file.php?id=10168]Apachii Sky Hair[/url] by apachii\r<br />Note: Be sure to have a total of 3 Apachii Sky Hair files (main, males, and females). Otherwise, no custom hairs&#33;\r<br />\r<br />2) [url=http://www.nexusmods.com/skyrim/mods/13722/?]The Eyes of Beauty[/url] by Log Raam\r<br />Note: Be sure to have both the Eye of Beauty mods installed (main, Elves expansion). Otherwise, no custom green eye color for Sihaya&#33;\r<br />\r<br />Be sure to have BOTH of these mods installed.\r<br />\r<br />I was finally able to figure out how to make custom eyes/eye color and custom hair color to show up on characters. Read the spoilered blurb to find out&#33; I&#39;m also going to post this finding on the forums, to help others out, and to save somebody else the headache.\r<br />TLDR: Skyrim Creation Kit fails to recognize more than a set number of Master Files. Manual TESVnipping is required to force the ESP to recognize its other Masters. Then everything gets utilized as it should.\r<br />[quote]\r<br />1) Use RaceMenu to create character\r<br />2) Use SPF to save character as an NPC file\r<br />3) Set up Master files in CK, not only Skyrim.ESM and Update.ESM, but also any Hair, Eyecolor, or Haircolor mods you use:\r<br />For myself:\r<br />Hair mod: Apachii Sky Hair, 3 files (main, males, females)\r<br />Eyecolor mod: The Eyes of Beauty\r<br />Haircolor mod: Need to get one\r<br />Only then, save as your CustomCharacter.ESP\r<br />4) In CK, create your character\r<br />4) Once done creating character&#39;s essential information, Import NPC file saved by earlier SPF command\r<br />5) Set custom Eye/hair color from drop-down menu\r<br />6) Save. Export Face textures via Ctrl+F4. Save again right after\r<br />\r<br />NOW, the simple trick to getting the Eye/hair colors recognized&#33;\r<br />\r<br />7) Use TESVnip to open your ESP\r<br />8) Using TESVnip, Add Master to your ESP, any missing... like Eye/Hair color mods\r<br />Note: For some reason, CK only loads and recognizes ONE other master besides Skyrim.ESM and Update.ESM. With the above method, one forces the new ESP to recognize and thus access the other Master files\r<br />\r<br />9) Open the ESP in CK as if going to edit it\r<br />10) When loading, you can see that your new Master files added on by TESVnip get finally recognized in CK. That&#39;s it&#33; Don&#39;t do anything more, exit out and the custom eye/hair colors should be in game on your custom character\r<br />Otherwise, CK saves... and loses the new Master files again\r<br />[/quote]\r<br />\r<br />====================================\r<br />INSTALLATION\r<br />====================================\r<br />\r<br />For ease of use, download and install using [url=http://www.nexusmods.com/skyrim/mods/modmanager/?]Nexus Mod Manager[/url].\r<br />For manual install, simply extract the contents of the archive into your Data folder.\r<br />For proper mod sorting, BOSS is no longer supported. BOSS version 3.0 is effectively LOOT. So now, as of 12/06/2014, I recommend LOOT for load order sorting: [url=http://loot.github.io/]LOOT[/url]\r<br />\r<br />-Installation: \r<br />    A. NMM: Just click &#34;Download with Manager&#34;\r<br />    B. Manual: Unpack and Drop the ESP file and the Meshes/Textures folders under your Data folder with other ESP files and folders\r<br />\r<br />-Uninstallation:\r<br />    A. NMM: Just click &#34;Unsubscribe&#34; and/or &#34;Delete&#34;\r<br />    B&gt; Manual: Just delete the BosmerCompanion.ESP under Data and the BosmerCompanion.esp folders in the Meshes and Textures folders.\r<br />\r<br />Meshes location: \r<br />meshes&#92;actors&#92;character&#92;facegendata&#92;facegeom&#92;AIBosmerCompanions.esp\r<br />Textures location:\r<br />textures&#92;actors&#92;character&#92;facegendata&#92;facetint&#92;AIBosmerCompanions.esp\r<br />\r<br />--------------------------------------------------------------------------------------\r<br />Conflicts: None Known\r<br />--------------------------------------------------------------------------------------\r<br />\r<br />====================================\r<br />ACQUISITION\r<br />[Where to find these custom NPCS?]\r<br />====================================\r<br />\r<br />LOCATION: RIVERWOOD - SLEEPING GIANT INN\r<br />\r<br />\r<br />===============================\r<br />MODS RECOMMENDED\r<br />===============================\r<br />\r<br />Spirit Guardian - New Bosmer Power (Both sub-versions) - changes Bosmer power of Command Animal to a summoned spiritual Bear instead (much more reliable)\r<br />\r<br />----------------------------------------------------------------------------------------\r<br />CHARACTER ENHANCEMENT MODS (BODY, HAIR, FACE, EYES, ETC) - Reflected on Screenshots\r<br />----------------------------------------------------------------------------------------\r<br />Note: My laptop sucks, your screenshots will prolly look better\r<br />\r<br />apachii [url=http://skyrim.nexusmods.com/downloads/file.php?id=10168]Apachii Sky Hair[/url]\r<br />LogRaam [url=http://www.nexusmods.com/skyrim/mods/13722/?]The Eyes of Beauty[/url]\r<br />mrLenski [url=http://skyrim.nexusmods.com/downloads/file.php?id=3563]Coverwomen[/url] - Look_4 + Seamless UNP Version 2.2\r<br />mrLenski [url=http://skyrim.nexusmods.com/downloads/file.php?id=4869]Covereyes[/url]\r<br />\r<br />----------------------------------------------------------------------------------------\r<br />\r<br />\r<br />======================\r<br />THE CHARACTERS\r<br />======================\r<br />Read on about my backstories for this character duo. Completely optional. \r<br />[quote]\r<br />Bosmer Pair\r<br />\r<br />ENVER CAMORAN\r<br />Background: Enver is a Thalmor-loyalist Bosmer agent of the Aldmerri Dominion. However, in his heart of hearts, Enver wishes the best for ALL Mer (elf) folk, including the Orsimer (orcs), any surviving Dwemer (dwarves) and even the Khajiit. \r<br />\r<br />He despises the Humans passionately and revels in any chance at killing them. He winces everytime he has to kill fellow Mer. Enver despises the humanfolk so, partly because of his noble lineage to the Camoran dynasty but more so because of Collovian destruction of most of his family and relatives. He is a surviving prince of a dying nobility, marked by his unusually white and fair complexion for a Bosmer. This light complexion hints at a possible Ayelid and even Snow Elf lineage. In order to preserve his house, Enver decided to redirect House Camoran&#39;s efforts into a new, bright direction - that of unification of ALL mer, and the Thalmor allies were the best means to reach those ends. Or so Enver thinks...\r<br />\r<br />With regards to dragons in Skyrim, Enver is sent by the Aldmerri Dominion with the task of tracking any and all dragon sightings. He is to find some way to utilize these great beasts to the favor of all Mer folk.\r<br />\r<br />With regards to the Skyrim Civil War, Enver pretends to just be a Bosmer refugee who isn&#39;t satisfied with Altmer leadership. Through Thalmor espionage and Aldmerri political finesse, Enver was purposefully set up to be &#34;caught&#34; alongside Jarl Ulfric near Helgen, in order to penetrate the enemy further, being more authentic and believable.\r<br />Enver is to rendezvous with another accomplice of his in the village of Riverwood. From there, his best bet would be to destabilize the region as much as possible, through work in Thieves Guild and other assassinations. Enver would make sure that the Stormcloaks gain the upper hand, but at a terrible price, weakening both Skyrim and the Empire.\r<br />This way the Empire is weakened, but Skyrim can not survive for long in isolation from the rest of Tamriel. Sooner or later, in this scenario, Skyrim will buckle in to Mer domination, and the Age of Man will have come to pass. The barbaric and systematic destruction of the Ayelids at the hands of Talos and his unwashed, uncouth ilk would have been rectified.\r<br />\r<br />Version 3.0 Relationship Quests\r<br />Friend: Enver is not alone in his quest for Mer unification and protection. He is accompanied by a childhood friend of his, of equally noble birth - Sihaya Ankaran. Like him, she too has unusually fair complexion, hinting at possible Ayelid or Snow Elf heritage. Despite all odds, House Ankaran had stood alongside House Camoran, and such loyalty does not go unnoticed. Their parents have long wished these two brazen wildhearts to join together in matrimony.\r<br />However, both Enver and Sihaya are too idealistic and passionate for settling in just yet. They have a great vision ahead of them and they tackle it with full force. These two love-birds still manage to do so with fine swagger (on the part of Enver) and strutting (on the part of Sihaya). Sihaya is Bosmer beauity incarnate, petite and sultry, with an attitude to match.\r<br />\r<br />Love Interest: The Dragonborn, if the player so wishes. If the Dragonborn (Player) does not marry either Enver or his friend Sihaya, then Enver will naturally propose to his comrade-in-arms Sihaya. They will marry happily and settle in somewhere together. \r<br />\r<br />------------------------------\r<br />\r<br />NOTE:\r<br />Enver is actually my MAIN character in my Skyrim playthrough. The strongest impetus for this mod for me was to create a Bosmer gal to accompany my previously lonely Bosmer dude on his adventures.\r<br />Since Bethesda failed to provide Bosmer marriageable NPCs. I took it into my own hands to correct this grave error, le gasp&#33;\r<br />\r<br />-------------------------------\r<br />\r<br />\r<br />SIHAYA ANKARAN\r<br />Background: Sihaya is a Thalmor-loyalist Bosmer agent of the Aldmerri Dominion. Sihaya is Bosmer beauity incarnate, petite and sultry, with an attitude to match. \r<br />\r<br />Like Enver, Sihaya wishes the best for ALL Mer (elf) folk, including the Orsimer (orcs), any surviving Dwemer (dwarves) and even the Khajiit. She is less hesitant than Enver in killing fellow Mer, however.\r<br />She points out to Enver every time that the Bosmer are as much to blame for the demise of House Camoran as are the humans. She believes humans may still be useful and helpful. At this, Enver fumes vehemently.\r<br />Sihaya prides herself on steering Enver from his House&#39;s dark past to a brighter future direction, that of unification of ALL mer. Unlike Enver, Sihaya distrusts the Altmer members of Thalmor leadership.\r<br />With her cunning and seductive manipulations, she aims to turn not only Enver but other Bosmer noble clan families away from Altmer domination, to remain sovereign, yet united, not melded completely, as Enver envisions.\r<br />She is worried that Thalmor sending out two Bosmer nobles into the wilds of Skyrim is just a ploy to cut down further the rungs of succession in Valenwood, to make it easier for divisive Altmer elements to seize power, if Enver and Sihaya were somehow &#34;conveniently&#34; lost in their mission in Skyrim.\r<br />Therefore, unlike the more naive Enver, Sihaya keeps her blade and arrow poised equally ahead as well as keeping her guard up towards Thalmor direction. She is protective of Enver and wishes that no harm comes to him.\r<br />\r<br />With regards to the Skyrim Civil War, Sihaya is less concerned with human affairs and more with Mer affairs. She is always thinking of how to turn the Dunmer over to their side. \r<br />Perhaps underscoring the living conditions in Windhelm&#39;s Gray Quarter would do it? Or perhaps agitating Winterhold&#39;s populace against the College, whilst secretly siphoning off the College&#39;s Dunmer members?\r<br />Opportunities, opportunities ... oh so many opportunities Enver misses, being so focused on that human civil war that is usually uninteresting to tge common Mer of Skyrim.\r<br />\r<br />Sihaya always mocks Enver for his &#34;portrayal&#34; of a refugee. He gruffly scoffs back. She corrects him anyways. Their lives depend on the charade. And she&#39;s a Mistress of Illusion.\r<br />She knew she would have been the better &#34;prisoner&#34; for Helgen infiltration, but Enver protectively declined her direct involvement. She let him be. She will await his rendezvous in Riverwood.\r<br />\r<br />\r<br />Friend: Despite his silly shortcomings, Enver has the makings of a future King of Valenwood, the ambitious Sihaya thinks, and with her rightful place as Queen. Only an adventurer of greater renown and character may swoon this wily Bosmer lady from the likes of the stalwart Enver of House of Camoran.\r<br />For now however, she is more than content with Enver&#39;s fine swagger and teasing him with her luscious strutting. \r<br />\r<br />Love Interest: The Dragonborn, if the player so wishes. If the Dragonborn (Player) does not marry either Sihaya or her friend Enver, then Sihaya will gleefully jump into Enver&#39;s arms and nudge him ever so expertly towards marriage. She will see to settling that restless, wanderlust-enfused soul of Enver down, somewhere tranquil and serene.\r<br />\r<br />------------------------------\r<br />\r<br />NOTE:\r<br />I was very unsatisfied with my version 1.0 female Bosmer. Luckily for me, with help from fellow community members (Niborino and BravoOskar), I was going to a better track.\r<br />However, it wasn&#39;t until faeriexdecay showed her support and timely assistance that I was able to get the look I&#39;ve wanted for this character. \r<br />Without further ado, version 1.5 presents this female Bosmer&#39;s new look. All credit for the look DUE to faeriexdecay. Couldn&#39;t have done it without her help&#33; Thanks and kudos&#33;\r<br />Now only to add her Llisabeth character as another Bosmer to this growing mod. I&#39;m thinking to create more Bosmer companions perhaps.\r<br />\r<br />-------------------------------\r<br />[/quote]\r<br />\r<br />\r<br />====================================\r<br />FILE LOG HISTORY\r<br />====================================\r<br />OLD VERSIONS 1.6, 1.5, 1.0. Optional read.\r<br />\r<br />[quote]NOTE: The voices are generic male and female voices, not Bosmer voices. As you most have probably guessed, Bosmer voice types do not support marriage functions because there are no dialogue or voiceover acting (VAs) for them. \r<br />I tried to find fitting voices to the character looks and RP stories as best I could.\r<br />\r<br />Version 1.6 [Old OUTDATED NPC Editor Method & ESM for Characters Structure -- DO NOT USE&#33;&#33;&#33;] 04/21/2012\r<br />1) FIX: BOTH Followers can now dual wield, if you give them 2 swords or daggers. Before, they weren&#39;t able to. So now you can fashion them into melee assassins, if you so wish. Both start with two daggers, if wanting dual wield instead of archery with bow and arrow. Just remember to unequip weapons of which style you don&#39;t want.\r<br />2) Both Followers default outfit is TREATED as clothing, even if it looks like armor. So you can still equip them how you like. This new way however the Followers retain their battle-ready gear, instead of being in travelling drab.\r<br />On the Horizon: Before 2.0 quests, I&#39;m planning to implement VA for at least the male Bosmer, Enver Camoran, covering all Follower and Spouse function dialogue with custom voice. VA will be provided by myself for now. Still, I&#39;m looking for experienced male VA to voice this Follower.\r<br />CALL OUT to any interested female VAs to voice the Bosmer female, Sihaya Ankaran.\r<br />\r<br />Version 1.5 [Old OUTDATED NPC Editor Method & ESM for Characters Structure -- DO NOT USE&#33;&#33;&#33;] 04/19/2012\r<br />For version 1.5, NPCs start out with instantly available Follower and Marriage functions. No hassle, no quests. Version 3.0 will add quests.\r<br />For most people, version 1.5, should be more than enough to fulfill the present gap in Bosmer followers/spouses, I hope&#33; ^_^\r<br />1) FIX: ESM package structure fixes the Head Tint problem where the head tint was different from the rest of the body\r<br />2) ADVANTAGE: NPCs start with clothes, so now they&#39;re upgradeable with armor of your choosing. Allows for flexibility. Version 1.0 was stuck with the original armors most of the time.\r<br />3) ADVANTAGE: NPCs stay in current location. They don&#39;t go back to original location. Wherever you last left them, there they&#39;ll stay. Version 1.0 had them go back all the way to the first location where you found them, Editor location. This isn&#39;t ideal.\r<br />4) Downside: Both NPCs of the Pair get installed. No more choice in installing one or the other. \r<br />5) Both characters are auto-level up version. NPCs will level up same as player, but from level 5 to 120\r<br />Note: This doesn&#39;t mean you have to recruit or play with the other you don&#39;t want. However, what it does mean is better preparation for Quests since now not only these featured Bosmer &#34;main&#34; NPCs but also any supporting quest NPCs would be under the same managerial umbrella.\r<br />\r<br />Version 1.0 (Unsupported Direction because of inherent flaws of this design) 04/15/2012\r<br />1) Advantage: STAND-ALONE ESP structure. Choose your character. Each character separate from the other in the pair.\r<br />2) FLAW: NPCs have the Head Tint issue where their heads are a jarringly different color than the rest of the body. Fixed in version 1.5\r<br />3) Disadvantage: NPCs start out with a preset armor that is difficult to replace since it&#39;s decent. Limited Player customization and flexibility in equipping these NPCs. Fixed in version 1.5\r<br />4) Disadvantage: When discarded, NPCs went back to Editor location, the original location of their spawn. Fixed in version 1.5[/quote]\r<br />\r<br />================================================================\r<br />V3.0 FUTURE DEVELOPMENT\r<br />quests/dialogue/scripting(no VAs for now, sorry)\r<br />================================================================\r<br />[quote]\r<br />Upcoming Version 3.0\r<br />Motive: My aim is to bring greater Thalmor presence into Skyrim, to represent their side through these Bosmer and Khajiit pairs of followers/spouses, via their dialogue/quests/story arcs. \r<br />More than just providing bare-bones Bosmer & Khajiit custom NPC Followers/Spouses (base updated version 2.0), I&#39;d like to develop the Thalmor story more with quests coming for these pairs with version 3.0, that is if I ever get to it however, lawls.\r<br />\r<br />Priority #1: Loyalty Quests\r<br />(Version 3.0)\r<br />Choice Pathway A (Anti-Thalmor): NO Thalmor Faction standing for ALL NPCs (since most players are anti-Thalmor, I think). If this Quest choice is chosen, then both the Player and these NPCs stay unfriendly with Thalmor.\r<br />Choice Pathway B B (Pro-Thalmor): YES Thalmor Faction standing for ALL NPCs. This version will be my mod&#39;s &#34;canon lore&#34; version for these characters. If this Quest choice is chosen, then both the Player and these NPCs become friendly with Thalmor.\r<br />\r<br />If player wishes to recruit this custom NPC as Follower or Spouse, then a Loyalty quest will have to be completed to get the Player to the trusted level of Ally, from whence one can both recruit the NPC as a Follower or propose marriage for the NPC to become a Spouse.\r<br />I&#39;ll work in a quest to gain their friendship/trust status first, before being able to recruit and/or marry them.\r<br />Ideally, I&#39;d like the quest to be more than just giving one gold coin (FavorsBeggarsFaction), instead through some quest to explore or kill some stuff.\r<br />\r<br />So, I now picture this Loyalty Quest bifurcating into two possible, diametrically opposed choices, A: Anti-Thalmor and B: Pro-Thalmor. So, Enver gets still has ONE Loyalty Quests but TWO different VERSIONS of the quest, depending on Player choice. Sihaya still gets just ONE Loyalty Quest, but TWO different VERSIONS of the quest, depending on Player choice. Thus, in essence, there are FOUR different available quests, for replayability sake. This way, the Player advances to Ally level with the said NPC and is able to propose marriage, having earned the NPC&#39;s trust (Ally level). Also, the Player&#39;s and NPC&#39;s Thalmor standing gets corrected.\r<br />\r<br />Thalmor Start (upcoming version 3.0) - meant for Player use, to be aligned with pro-Thalmor NPCs in this version\r<br />ALTERNATIVE: Instead of starting in the Thalmor Embassy as in that mod, here&#39;s a way to become Thalmor while still experiencing the standard game start in Helgen:\r<br />Just bring up the console with the tilde key (~) and type in the following:\r<br />\r<br />player.addtofaction 00039f27 0\r<br />\r<br />The above command adds Player to ThalmorFaction, making them not attack you\r<br />(For the sake of immersion, I do this at the ride towards Helgen, but arguably you can do so at any time, but the earlier the better)\r<br />\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />\r<br />\r<br />Priority #2: Personal and Group Aftermath Quests\r<br />(Version 3.0, both Quest versions A and B) - ALL Characters are DEPENDENT on their Paired FRIEND -\r<br />-If player marries this particular NPC (ex: Enver), then the following Aftermath effects will fire:\r<br />The Player-Married NPC&#39;s (ex: Enver&#39;s) friend (ex: Sihaya) will stay at Friend level with the NPC (ex: Enver). Some time after the Player&#39;s marriage to this particular NPC (ex: Enver), the NPC will offer a Personal Aftermath quest to conclude their individual story arc.\r<br />Therefore, 2 Personal Aftermath quests/story conclusions will be available for each sub-version, meaning 4 Personal Aftermath quests total.\r<br />\r<br />-If player marries an NPC who is not this particular NPC (ex: Enver) or its direct friend (ex: Sihaya), then the Group Aftermath effects will fire, including the Group Aftermath quest\r<br />Group Aftermath effects: the pair (ex: Enver and Sihaya) will get married (Married level). Moreover, they&#39;ll move in together into a common cell that will be their new home (custom-place hopefully). Once married and settled in, they will offer their final dual-shared (meaning if you ask either partner, it&#39;ll be the same quest) Aftermath quest and the Player would be able to join that quest, as a way to conclude their Group story arc (WIP2)\r<br />Again, these Aftermath quests will vary for each character pair now based on the sub-version used. Therefore, there will be 2 quests (one for the Bosmer pair, the other for the Khajiit pair) for version A, and 2 quests for version B, for a total of 4 Aftermath quests.\r<br />As you can tell, this structure allows for lots of flexibility. For example, if Player married Enver, than the player can do Enver&#39;s Personal Aftermath quest, including the Khajiiti pair&#39;s dual-shared Group Aftermath quest (since Player did not marry any of the Khajiits). And vice versa.\r<br />\r<br />At Version 3.0, I&#39;ll consider this mod finished per my vision, having established fully-fledged Bosmer/Khajit Followers/Spouses, complete with Loyalty and Aftermath bifurcating quests. Without the Thalmor political stance, it would be much easier, just a single Loylaty and single Aftermath quest per character though.\r<br />\r<br />Only improvement could be adding Voice-Overs, so I&#39;m giving a shout-out to the community if anybody is willing and able to recite all the dialogue lines (including vanilla/standard Follower/Spouse lines, in addition to original quest lines). Your input will be welcome for collaborative work on this project.\r<br />For example, if the mod author for Willow Companion from Fallout New Vegas is around Skyrim, I&#39;d appreciate her voicing the female characters. I can voice the males or find better community male VAs. Or, I can also romantically wait for my future wife and record her as my Sihaya(Desert Rose). Twill be fun&#33;\r<br />Also, I may add new adventures to these characters, if there&#39;s interest and time.\r<br />[/quote]\r<br />\r<br />--------------------------------------------------------------------------------------\r<br />\r<br />Have fun&#33; Don&#39;t forget to endorse if you like this ;) This was my 1st mod in Skyrim YAY&#33; So please be gentle ^_^\r<br />\r<br />----------------------------------------------------------------------------------------------------------------\r<br />\r<br />[center]Check out my accompanying mod too[/center]\r<br />\r<br />[center]Khajiit Follower-Spouse Companion Pair[/center]\r<br />[center]\r<br />[url=http://www.nexusmods.com/skyrim/mods/15249/?tab=4&&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fcomments%2F%3Fmod_id%3D15249%26page%3D1%26sort%3DDESC%26pid%3D0%26thread_id%3D648414&pUp=1][img]http://i.imgur.com/61JBnW9.jpg?1[/img][/url]\r<br />[/center]\r<br />\r<br />\r<br />===============================\r<br />Thanks\r<br />===============================\r<br />\r<br />Thanks to Nexus sites for having this helpful website for beginner modders&#33;\r<br />[UPDATED CK Method]\r<br />Best Guide I&#39;ve found online on the new CK Method. Thanks FaeriexDecay for directing me to this treasure trove&#33;\r<br />http://hubpages.com/hub/Hot-to-Turn-Your-Skyrim-Character-into-a-Follower#\r<br />\r<br />[OUTDATED NPC Editor and ESM/ESP Methods]\r<br />Especially this link on Creating Followers: http://www.youtube.com/watch?v=AlepT3rQ8LI&feature=youtu.be&hd=1 \r<br />And thanks to Google user &#34;RighthandedMan25&#34; for guiding me into the right direction\r<br />\r<br />Thanks to Bethesda for Skyrim and Creation Kit\r<br />Thanks to faeriexdecay&#39;s support and artistic intervention, my originally lame-looking Bosmers, especially the female Bosmer, have improved graphically. Thanks for your assistance, faerie&#33;\r<br />Thanks to Blackie&#39;s CM New Companions mod&#39;s helpful &#34;CM Creating Custom Companions&#34; notepad file. Corroborated by forum talk, I&#39;ve been able to fix the annoying Head Tint issue, as well as improve my mod substantially. Kudos to faeriexdecay for directing me to him&#33; You both saved me lots of frustration, I&#39;m sure&#33;\r<br />Thanks a bunch to BravoOskar for answering my questions and getting issues resolved. I&#39;d like to collaborate and learn more from him. His Custom NPC mods are light years better than mine in many ways, especially graphically.\r<br />Thanks goes to all the patient modders out there who delivered all these great mods and instigated me to try my hand at modding. This is just the beginning, I hope :)\r<br />\r<br />NomadicAI7 12/10/2014",
  "categoryId": "66",
  "version": "2.0",
  "author": "NomadicAI7",
  "createdUnix": "1334514201",
  "updatedUnix": "1418006103",
  "containsAdultContent": false,
  "uploadedBy": "NomadicAI7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000138134",
      "name": "AI Bosmer Companions Version 2.0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "845",
      "fileName": "AI Bosmer Companions Version 2.0-15245-2-0.rar",
      "uploadedUnix": "1418006103",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/6b485b1bf337302b4acb266c333a522b09118c18279b39e8d36841c41b7dd4c8/analysis/1418006164/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AI%20Bosmer%20Companions%20Version%202.0-15245-2-0.rar?fid=1000138134&ttl=1535779494&ri=8192&rs=8192&setec=3ff45be183af4e4b75876d6a879cfd9d"
    }
  ]
}