{
  "modId": 15264.0,
  "modName": "Hedge Knight Armor Retexture",
  "summary": "A retexture of the great Hedge Knight armor set, making it a bit less colorful; the robe is now black, the previously blue/green bits are now brown/tan, etc.",
  "descriptionHtml": "Hedge Knight Armor Retexture version 1.0\r\nA MOD for TES V: Skyrim by LieutenantHawk\r\n\r\nI really like Hothtrooper44\\'s Hedge Knight armor set, but some of the textures didn\\'t quite cut it for me. I didn\\'t like the color of the original robe, the leather bits, and a few other things, so I made some fixes and alterations. I think the armor overall looks better as a set now.\r\n\r\n\r\n--{Features}--\r\n\r\nA retexture of the Hedge Knight armor set. The robe is now black and grey, and the chainmail has been made to match that which is on the actual armor. All of the previously blue/green leather and cloth bits have been made brown and tan. I replaced the insignia with the coat of arms of the Holy Roman Empire. \r\n\r\nThe helmet textures weren\\'t touched, which is why I didn\\'t wear it in the screenshots. It doesn\\'t fit my Argonian head anyway. XD\r\n\r\n\r\n--{Installation}--\r\n\r\nCopy the \\\"Textures\\\" folder to your \\\"Skyrim\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\" folder. When prompted to overwrite files, say yes.\r\n\r\n\r\n--{Bugs/Conflicts}--\r\n\r\n The only thing this MOD does is overwrite the original textures of the armor set, so I can\\'t imagine any.\r\n\r\n\r\n--{Copyright}--\r\n\r\nDo NOT redistribute this MOD. It is only partially my work, therefore I can\\'t give anyone permission to copy or reupload it.\r\n\r\n\r\n--{Credits}--\r\n\r\nBethesda Softworks for making the epicness that is Skyrim. \r\nHothtrooper44 and those whom he accredited for the meshes and original textures.\r\nMyself for the modified textures included here.\r\n\r\nIf you like this MOD, endorsements are always appreciated and I do love seeing screenshots of my stuff in action!\r\n\r\n\r\nTo contact me: The most obvious way would be via Skyrim Nexus, but I am also on DeviantART and Yahoo under the same name.",
  "categoryId": "54",
  "version": "1.0",
  "author": "LieutenantHawk",
  "createdUnix": "1334532646",
  "updatedUnix": "1334532719",
  "containsAdultContent": false,
  "uploadedBy": "LieutenantHawk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "53595",
      "name": "Hedge Knight Armor Retexture",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4048",
      "fileName": "Hedge Knight Armor Retexture-15264-1-0.7z",
      "uploadedUnix": "1334532719",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a455eecc77e442e23ed3620a4d7ef18c600b884ce528d15c1ce05adb42a9636e/analysis/1406817851/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hedge%20Knight%20Armor%20Retexture-15264-1-0.7z?fid=53595&ttl=1535779522&ri=8192&rs=8192&setec=6239dde8897c63b325a270335d512216"
    }
  ]
}