{
  "modId": 15261.0,
  "modName": "The Walking Dead Zombie Apocalypse -WIP-",
  "summary": "THE WALKING DEAD\r\nThis Mod adds countless zombies or \\\"walkers\\\" to the land of Skyrim, these ferocious, unarmed Creatures are simple alone, but once they\\'ve got a herd going you\\'ll be quickly over run",
  "descriptionHtml": "       \r\n[color=\\\"#006400\\\"][font=\\\"Impact\\\"]THE WALKING DEAD[/font][/color] \r\n \r\nWell fine folks, does the Beta Work please tell me it doesn\\'t crash?\r\n\r\nNEXUS ONLY\r\n\r\nI\\'m sorry to say that this project is over, with alot of bugs, if anyone wishes to continue it, would love to see it, with some credits to me, depending on how much you changed\r\n\r\n1) Description\r\n2) Video Link\r\n3) Contents\r\n4) Things to come\r\n5) Ramblings\r\n6) Advised Mods\r\n7) Requests\r\n8) Special Thanks\r\n                                 \r\n\r\n1)\r\nThe World Of Skyrim Has Been Attacked. . . .\r\nBy A Plague Of Zombies. . . .\r\nOnce Dead, They Begin To, Move Again. . . . .\r\nAnd Begin To Roam The World Of Skyrim. . . . . .\r\n\r\n*NEW* Scrivener07\\'s Alternative start, allowing for 3 new start\\'s:\r\n1) Helgen (do not use) REALLY BUGGY\r\n2) As a traveler from Cyrodiil (easy start)\r\n3) Whiterun prison (hardcore)\r\n\r\nThank you everybody who endorsed, 12 is pretty brilliant\r\n\r\nThis Mod gives you a completely new experience, with more of a survival theme, the world plunged into darkness, with roaming horrors everywhere\r\n\r\nThe Story:\r\nDepending on your alternative start descision, you\\'ll either be on the road from Cyrodiil, nearest town Falkreath, or alternatively in Whiterun prison, where you must break out and run from the city or die. . .\r\nYou have been dumped directly into a world destroyed by the walking dead. The Main quest line begins at Riverwood, where you must help them retrieve a book from whiterun then Blazum, the leader tells you a secret. . . . .\r\n*SPOILER*:\r\nHe is a part of an elite squad of Rangers, Sothid Rangers of the south (future mod planned for these rangers) he tells you of some notes scattered throughout the holds of the wereabouts of an ancient sword of meridia, to slay the dead. . . once all nine pieces are found, (locations in readme) a book on the wereabouts can be crafted, follow the clues to the Pitch Black Grotto of Meridia, here you will find the GreatSword Of The Dead, Wielding This Sword can only but improve your chances of survival good luck!\r\n\r\nMore Story in Falkreath\r\nA man named darvin is looking for his brother, darvin is in falkreath, his brother was last known to be in a tower next to bleakfalls barrow, pick up the note from the front room, freddy, his brother should spawn, bring freddy back to Falkreath.\r\nYou also gain the new player home of the tower\r\n*Spoiler Over*\r\n\r\nUPDATED:\r\nAdds an island of salvation, sothid rangers, stone of becoming a walker, Cheat Book and much more including walker attacks in wilderness and home\r\n\r\nSo I\\'ve added an alternative start, and 2.6 is up, with fixed face texture, other minor bugs, but i need feedback guys, does it work? Endorsements are always nice\r\n\r\n\r\n2)\r\nhttp://www.youtube.com/watch?v=fcp3h1ruLx4\r\n\r\n3)\r\nThis is What i\\'ve got so far:\r\nA World plunged into chaos\r\nSword Of The Dead + Quest\r\nSurvivors scattered- mainly just whiterun area\r\nRiverwood Homebase + Followers + Quest(hoping to make more)\r\nThe Ability to relocate the survivors of riverwood\r\nPlayable Walker Race, simply type \\\"bat walker\\\" into console to integrate\r\nFalkreath survivour camp + Quest\r\nPlayer Home - Next to Bleakfall\\'s Barrow, theres a tower, has all the home utensils and space for riverwood survivors to relocate to.\r\nThe INFECTION disease, only works on death, and wont work on player. . . . yet\r\nNew following system\r\nTime to read the dialogue\r\nNew Island\r\nSothid Rangers\r\n\r\n\r\n4)\r\nThings to come :\r\nMore Mini Quests – 50% done\r\nMore Emersive Walker Positions - Got a good plan 80% done\r\nMain Quest with cure - 0% done\r\nAlternative start?\r\n\r\n\r\n5)\r\nHad a plan, what about a -before the infection breaks out mod- More basic, but is for a simple fighting mod\r\n\r\nAs with all quest mods it is advised to keep a save before playing, or make a new save altogether. .\r\n\r\n6)\r\nAdvised mods to get this with:\r\nImps More Complex Needs - Emersive Survival\r\nCamping mod of some sort - could be useful\r\n\r\n7)\r\nI would appreciate some images of my mod, my computer is too slow so images are difficult for me to take (The video shows its slowness). also any bugs, its difficult for me to test it out\r\n\r\n8)\r\nSpecial thanks to:\r\ndonker316- Though you thought you had memory loss your advice on the faces worked\r\nripvanwinkle111-Creator of RTS Skyrim, Gave me the info on how to make walkers and bandits raid Riverwood and improved the survivors following system\r\nscrivener07-Corrected my infection script, which was quite vital in the running of the mod\r\nHE ALSO MADE THE ALTERNATIVE START\r\n\r\n\r\n\r\n",
  "categoryId": "35",
  "version": "2.5",
  "author": "Chuckmccaw",
  "createdUnix": "1334526886",
  "updatedUnix": "1341690141",
  "containsAdultContent": false,
  "uploadedBy": "chuckmccaw",
  "primaryFile": null,
  "files": [
    {
      "fileId": "72833",
      "name": "Walking Dead - Origin",
      "version": "2.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15628",
      "fileName": "Walking Dead - Origin-15261-2-5.rar",
      "uploadedUnix": "1341690141",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/73047afdd81392d69cddd157e90c39c0e7f331b85484087da092644bb97ff51e/analysis/1407008290/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Walking%20Dead%20-%20Origin-15261-2-5.rar?fid=72833&ttl=1535779517&ri=8192&rs=8192&setec=bd44499b63cff018ae17b909e1bdaf28"
    }
  ]
}