{
  "modId": 15270.0,
  "modName": "Teutonic Legion Retexture",
  "summary": "Black and white Teutonic-esque retexture of the Imperial Legion. Banners and armor sets have been recolored.",
  "descriptionHtml": "Teutonic Legion Retexture version 0.8\r\nA MOD for TES V: Skyrim by LieutenantHawk\r\n\r\nWhile I love the Roman Empire and its costumery, I don\\'t quite like the fact that the Imperial Legion resembles them so closely. I wanted to give them a different feel. Since I can\\'t modify or make meshes myself, I decided to do what I can--which is to retexture stuff. About a dozen hours in Photoshop later, I had modified all of the Legion\\'s armor sets to have a color scheme more akin to the Teutonic Knights. While the style of the armor is still Romanesque, they are now black and white rather than crimson. I honestly think they look more intimidating now.\r\n\r\n\r\n--{Features}--\r\n\r\nComplete retexture of all of the Imperial Legion\\'s armor sets. The faction\\'s colors have been switched to black and white, chainmail textures are swapped out, plate armor bits have had the greenish tint removed, and on the light/medium armors, certain previously leather parts are now colored black/white to give a more uniformed look.\r\n\r\nIn the future I want to do the Penitus Occulatus armor as well as the Solitude guards. I also wanted to make the Stormcloaks look like Lithuanian soldiers, who were one of the Teutonic Knights\\' main enemies. For now I\\'m going to take a break from this mod, though.\r\n\r\nNOTE: The two \\\"Reference\\\" screenshots are only examples of what inspired me to make this MOD. They aren\\'t intended to be representative of what\\'s included here, though once I gain more experience I will try to replace the Legion\\'s armor meshes altogether with something closer to what you see in the references.\r\n\r\n\r\n--{Installation}--\r\n\r\nCopy the \\\"Textures\\\" folder to your \\\"Skyrim\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\" folder. If prompted to overwrite files, say yes.\r\n\r\n\r\n--{Bugs/Conflicts}--\r\n\r\n This MOD will not work with any other that modifies the Imperial Legion\\'s armor.\r\n\r\n\r\n--{Copyright}--\r\n\r\nDo NOT redistribute this MOD.\r\n\r\n\r\n--{Credits}--\r\n\r\nBethesda Softworks for making the epicness that is Skyrim. \r\nMyself for the modified textures included here.\r\n\r\nIf you like my work, endorsements are always welcome, and I love seeing screenshots of it in action!\r\nThis MOD works well alongside my Teutonic Coin retexture: http://skyrim.nexusmods.com/downloads/file.php?id=5260\r\n\r\nTo contact me: The most obvious way would be via Skyrim Nexus, but I am also on DeviantART and Yahoo under the same name.",
  "categoryId": "54",
  "version": "0.8",
  "author": "LieutenantHawk",
  "createdUnix": "1334541454",
  "updatedUnix": "1334541548",
  "containsAdultContent": false,
  "uploadedBy": "LieutenantHawk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "53617",
      "name": "Teutonic Legion Retexture",
      "version": "0.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11830",
      "fileName": "Teutonic Legion Retexture-15270-0-8.7z",
      "uploadedUnix": "1334541548",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/dc3f69b02f4b26634ef10d48f3b5e0bd4686523bb44021928cd8b41a4d7711b0/analysis/1406818092/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Teutonic%20Legion%20Retexture-15270-0-8.7z?fid=53617&ttl=1535779533&ri=8192&rs=8192&setec=d8887161febd0da341180f5dcf58925f"
    }
  ]
}