{
  "modId": 15282.0,
  "modName": "Items Tomb",
  "summary": "Unearth an interesting story about the unfortunate fate, and need of a long lost hero of Skyrim.  Features a well made dungeon with voice-acted characters to interact with.",
  "descriptionHtml": "The following mod is an ALMOST FULLY VOICE-ACTED dungeon adventure.  Created for your enjoyment!\r\n\r\nA dungeon or tomb that I came up with.  Took my time with it, so I hope you\\'re pleased.  This is my first mod, so any helpful comments are welcome.\r\n\r\nv. 1.02 = hopefully fixed error where there was no speech when talking to Item & Bade.\r\nv. 1.01 = added map marker\r\n\r\nItem was a traveler of old that arrived under odd circumstances.  For years people wondered just where he came from, but never got the answers.  Now you can get some.  Venture to Item\\'s tomb and meet the man himself, well what is left of him at least.\r\n\r\nThe hero of old needs your help--after all, you\\'re the hero of today.  Find the tomb located in the highland area where forsworn dwell.  A door is built into the rock face, but be sure to talk to a pathetic little man outside on the ground first.  Your journey through Item\\'s Tomb has just begun!!\r\n\r\nIf you are looking to get the full experience of the mod then please READ THE JOURNALS scattered about in Item\\'s upper chamber (where he is located).  They give a lot of back story and are fairly well written.  There are 4 different journals. Enjoy!\r\n\r\nCreated by Brometheous\r\n",
  "categoryId": "88",
  "version": "1.02",
  "author": "Brometheous",
  "createdUnix": "1334567864",
  "updatedUnix": "1334719698",
  "containsAdultContent": false,
  "uploadedBy": "Brometheous",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54158",
      "name": "Items Tomb",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10512",
      "fileName": "Items Tomb-15282-1-02.7z",
      "uploadedUnix": "1334719698",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/94eb33b5ab4931992112317d9655e8f1cebb26bf47f499def70d3b3897de16e1/analysis/1406821179/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Items%20Tomb-15282-1-02.7z?fid=54158&ttl=1535779549&ri=8192&rs=8192&setec=d03857ef0a55c378ef519b73fae11ebd"
    }
  ]
}