{
  "modId": 15297.0,
  "modName": "Planeswalker Magic by SPACEWALK",
  "summary": "Planeswalker Magic is a mod I\\'ve created to mainly teleport the player to various locations in Skyrim.",
  "descriptionHtml": "Description\r\n===========\r\n\r\nPlaneswalker Magic is a mod I\\'ve created to add some new and modified spells to Skyrim.  Though I am in the early stages of the mod, Planeswalker Magic will likely be themed to deal mostly with trasporting the player to various places, both near and far distances.  Hence the name, Planeswalker.  I am a novice modder at the moment, but I definitely have plans to further update this mod with newer and better spells as I continue to learn the inner-workings of the Skyrim Creation Kit.\r\n\r\nThis Beta release includes a couple of \\\"Homeward\\\" spells that allow the player to travel to the front door of various vanilla player homes in Skyrim.  Imagine being able to teleport from within a dungeon right to your front door without having to first find your way out of said dungeon, fast travel to a town, and then run all the way to your house.\r\n\r\n\r\nHow To Acquire Planeswalker Spells\r\n==================================\r\n\r\nFor now, go to The Drunken Huntsman in Whiterun.  There, you\\'ll find Lena Wellenko.  She\\'ll sell you the spell tomes for them if you have the money.  She will only sell from 8am-8pm, though.\r\n\r\nI\\'ve already started an area beneth Whiterun where Lena will sell her wares, but for now it is not accecible to you guys via any doors or anything like that.  I still have bugs to work out in the cell - like, why the heck do skeletons keep spawning in there?\r\n\r\nShe also sells lots of other magic related stuff that is from the vanilla game.  When you go to purchace my creations, you\\'ll want to look for:\r\n\r\nSpell Tome: Homeward, Breezhome - Teleports you to the front door of Breezhome in Whiterun from any location.\r\n\r\nSpell Tome: Homeward, Proudspire - Teleports you to the front door of Proudspire Manor in Solitude from any location.\r\n\r\nSpell Tome: Homeward, Vlindrell - Teleports you to the front door of Vlindrel Hall in Markarth from any location.\r\n\r\nSpell Tome: Conjure Wisp Lady - Conjures a Wisp Mother to help you in combat\r\n\r\nApprentice Robes of the Shell - A set of Mage robes that gives the player some armor protection.\r\n\r\nYeah, so it\\'s just a handful of things at the moment, but as I stated above, there will be updates for Planeswalker Magic.\r\n\r\n\r\nInstallation\r\n============\r\n\r\nSimply copy the contents of the Data folder into your Skyrim/Data directory and activate the \\\"Planeswalker Magic.esp\\\" file.\r\n\r\n\r\nUninstallation\r\n==============\r\n\r\nDectivate \\\"Planeswalker Magic.esp\\\" and delete the copied files.\r\n\r\n\r\nBugs/Known Issues\r\n=================\r\n\r\n- Crashes or game won\\'t start:  You may need to use the \\\"Dovahkiin Siren.esm\\\" file I\\'ve included.  The Dovahkiin Siren was not supposed to be a part of this mod but I accidentally saved this mod while using my Dovahkiin Siren mod as a reference and as a result, Planeswalker Magic now has a depencency on that esm file.  For the time being, I don\\'t know how to get rid of this dependency, so if you have problems, just copy and activate the included \\\"Dovahkiin Siren.esm\\\" file as well as the main Data files I mentioned earlier.\r\n\r\n- Wisp Lady:  I haven\\'t looked much into it yet, but it seems nearly every time I summon the Wisp Lady, two or three more \\\"Shades\\\" show up and sometimes they attack me.  I haven\\'t figured out if it\\'s a problem with my mod or if the Wisp Lady is summoning them and they have no affiliation with the player.\r\n\r\n- The Shop:  The Planeswalker Magic Shop already exists in this mod but there is still work to be done on it.  A problem I\\'m having is that skeletons keep spawning in the cell when I enter.  I don\\'t know what\\'s causing it, but I won\\'t affect you guys right now, since you can\\'t go there yet.  Any ideas with this one would be of great help.\r\n\r\nThese are the only two bugs I\\'ve come across so far, but if you find any others, please let me know.  Also, if anyone can help me solve any of the mentioned bugs, send me a message.\r\n\r\n\r\nPlease leave feedback.\r\n\r\n\r\n- SPACEWALK\r\n\r\n\r\nIMPORTANT NOTICE\r\n=================\r\nMy Mod, \\\"Planeswalker Magic\\\" is in no way affiliated with the popular card game, Magic: The Gathering by WIZARDS OF THE COAST LLC.   No infringement is intended by my use of the trademarked term, \\\"Planeswalker\\\".",
  "categoryId": "75",
  "version": "0.9Beta",
  "author": "SPACEWALK",
  "createdUnix": "1334584864",
  "updatedUnix": "1334590830",
  "containsAdultContent": false,
  "uploadedBy": "SPACEWALK",
  "primaryFile": null,
  "files": [
    {
      "fileId": "53720",
      "name": "PlaneswalkerMagic-by-SPACEWALK-0_9Beta",
      "version": "0.9Beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1611",
      "fileName": "PlaneswalkerMagic-by-SPACEWALK-0_9Beta-15297-0-9Beta.zip",
      "uploadedUnix": "1334585024",
      "modVersion": "0.9Beta",
      "virusScanUrl": "https://www.virustotal.com/file/b5389728b8ca65c516aad01a9b2e18d1981ae3dc34aefa9277d7a9117766c5ad/analysis/1406818753/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PlaneswalkerMagic-by-SPACEWALK-0_9Beta-15297-0-9Beta.zip?fid=53720&ttl=1535779575&ri=8192&rs=8192&setec=c63249763243b821b9144335fda892bd"
    },
    {
      "fileId": "53735",
      "name": "PlaneswalkerMagic-09BetaReupload",
      "version": "0.9Beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1611",
      "fileName": "PlaneswalkerMagic-09BetaReupload-15297-0-9Beta.zip",
      "uploadedUnix": "1334590830",
      "modVersion": "0.9Beta",
      "virusScanUrl": "https://www.virustotal.com/file/d1b7ec3feb48e50c2f0f44ac1ccc00a8eeecf4df2c04deca8156157e3785e629/analysis/1406818810/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PlaneswalkerMagic-09BetaReupload-15297-0-9Beta.zip?fid=53735&ttl=1535779576&ri=8192&rs=8192&setec=abd90d7013d76e45251ba105b0835aa9"
    }
  ]
}