{
  "modId": 15313.0,
  "modName": "Skyrim&#39;s Treasure Chests",
  "summary": "This mod adds several chests across the world of Skyrim. These chests contain lots of items of all categories for the player to use. You want weapons and armour sets? Smithing materials? Ingredients for all those wonderful potions and lethal poisons? Gems? Supplies for your enchanting needs? Look no further&#33;",
  "descriptionHtml": "[font=Arial]=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=\r<br />\r<br />&#34;The mod &#34;Skyrim - Chests Of Fun&#34; adds several chests across the world of Skyrim. These chests contain lots of items of all categories for the player to use. v1.0 started out with a chest in each main inn of the nine holds. Every future update will be a chest with new items added to a minor inn.&#34;\r<br />\r<br />Well, this story is very nice, but only reflects a more outdated release. &#34;Skyrim&#39;s Treasure Chests&#34; is the latest edition of this mod. New file name, and even more features than ever before. It&#39;s only going to get bigger. Stay tuned&#33;\r<br />\r<br />=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=\r<br />\r<br />v1.0 - Original release:\r<br />\r<br />This mod will never be available to the public because after I had published it to a select few people, I made a few changes which resulted in v1.1. Next to a chest in each hold&#39;s main inn, this version already contained a chest in the Riverwood inn and the Dragon Bridge inn.\r<br />\r<br />\r<br />\r<br />[b]THIS VERSION IS NO LONGER AVAILABLE ON THE INTERNET.[/b]\r<br />\r<br />-     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -\r<br />\r<br />v1.1 - Update:\r<br />\r<br />Added a chest for enchanters to the New Gnisis Cornerclub in Windhelm.\r<br />\r<br />\r<br />\r<br />[b]THIS VERSION IS NO LONGER AVAILABLE ON THE INTERNET.[/b]\r<br />\r<br />-     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -\r<br />\r<br />v1.2 - Update:\r<br />\r<br />Added a chest to Rorikstead&#39;s Frostfruit Inn. This chest contains four different versions of Kodlak Whitemane&#39;s armour: Light and Heavy unenchanted and light and heavy enchanted. This means you can pick what you like the most. All pieces of armour can be tempered. There are also two swords in the chest. Again, one unenchanted and one enchanted.\r<br />\r<br />Added Kodlak Whitemane&#39;s brother, Karstav Whitemane, to the meadhall of the companions, Jorrvaskr. He is a companion NPC to the player.\r<br />\r<br />\r<br />\r<br />[b]THIS VERSION IS NO LONGER AVAILABLE ON THE INTERNET.[/b]\r<br />\r<br />-     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -\r<br />\r<br />v1.9 - Major update:\r<br />\r<br />It took quite some time, but this mod has received lots of work since the previous v1.2 release. However, I didn&#39;t upload it until now. The biggest changes include remade content from the original release on a large scale and some new chests with new items in the inns of smaller settlements, even all the way to Riften&#39;s Ragged Flagon. That particular chest contains one new weapon variant for each of the following four daedric artefacts: Dawnbreaker, Mehrunes&#39; Razor, Volendrung and the mace of Molag Bal. I&#39;ve also added a chest that is not present in any inn whatsoever. This chest contains the amulets of all gods and is placed in the Temple of the Divines in Solitude. This was intended as an extra resource for the official Hearthfire DLC, since these amulets can be a little hard to get while you might want to fully expand your personal collection of shrines in your own house. This doesn&#39;t mean that this mod now requires Hearthfire to be installed. It still runs on nothing more than the base game of Skyrim, as no content of DLC&#39;s is involved in the creation of this mod.\r<br />\r<br />*Note that some items have received a new item ID and some items have been totally removed to be replaced by a completely new version. Most items, if not all, from the original mod have had their stats adjusted to be far less overpowered. I&#39;ve decided to stick as much as possible to daedric quality stats for weapons and armour, so it fits in a lot better with the game. As a result of this, any original enchantments should have far less power than before as well, which should make using the enchanted versions of weapons and armour more interesting. I may decide to continue working on these issues if I feel like the enchanted equipment is still too powerful.*\r<br />\r<br />***It is strongly recommended to upgrade from the previous version v1.2 to the new version v1.9.***\r<br />\r<br />***IMPORTANT: Get rid of any custom weapons, armour and clothing that was already present in v1.2 BEFORE updating the mod. Failing to do so might result in saved game malfunctioning, because the v1.9 update has changed a lot of the original custom items this mod offers. Changed item ID&#39;s in particular can cause problems if any custom items of V1.2 are not fully removed from the player&#39;s inventory before updating.***\r<br />\r<br />\r<br />\r<br />[b]THIS VERSION IS NO LONGER AVAILABLE ON THE INTERNET.\r<br />\r<br />-    -    -    -    -    -    -    -    -    -    -    -    -    -    -    -    -    -\r<br />\r<br />[/b]v2.0 - Update (10th of august, 2016):\r<br />\r<br />True to my word on the 3rd of august, I&#39;ve released the v2.0 update in a week after letting you fine people know that I was making good progress on the update. With that comes a word of advice. Officially, the update is still around 90% done. The remaining 10% takes a bit longer than expected, but that doesn&#39;t stop me from releasing a vastly improved version of the mod. The new file name is &#34;Skyrim&#39;s Treasure Chests&#34;. IMPORTANT: Remove everything associated with older versions of the mod. Though the file name is different from v1.9, item ID&#39;s are still the same.\r<br />\r<br />\r<br />Changes include:\r<br />\r<br />-New installation requirements. All DLC&#39;s, Hearthfire excluded, are now a mandatory requirement\r<br />  if you want to use this mod.\r<br />-Another rework of the power of the enchantments. Enchantment power has been reduced.\r<br />-The blacksmiths of Riverwood, Whiterun, Solitude and Windhelm have everything related to\r<br />  smithing for sale. All types of ores and ingots can now be bought from these people, along with\r<br />  plenty of leather and leather strips. In Riverwood, there&#39;s a key to a respawning chests for sale\r<br />  that offers access to a supply of Daedra hearts.\r<br />-Chests have had their contents redistributed across more chests to minimize the chaotic\r<br />  effect of having to look through everything in one or two chests to find the item you want.\r<br />-Weapons and armour can now be crafted as well, instead of only being tempered. Look in\r<br />  the Daedric section of the smithing menu. As stated before, I tried to stick to Daedric quality\r<br />  as much as possible, WeapMaterial & ArmorMaterial have been adjusted on custom items to\r<br />  reflect that goal.\r<br />-Five new custom NPC&#39;s have been added to Red Road Pass a short distance away from Dawnstar.\r<br />  Tread carefully as these NPC&#39;s are *NOT* followers. They guard a chest filled with Septims. You\r<br />  are to exterminate the whole camp if you wish to take the prize in peace. Borgazar the Insane\r<br />  wields a battle axe and can use Unrelenting Force, Helius the Firemaster wields a sword and fire\r<br />  spell, Uranus the Swift dual wields two daggers (one of which enchanted), Aerius the Wolfmaster\r<br />  wields a war axe along with a shield and Maneater (A big a** ice wolf) never leaves his handler&#39;s side.\r<br />  Add to that the original inhabitants of Red Road Pass, one giant and one mammoth, and you know\r<br />  it is not going to be easy to claim that chest of Septims. It is for this reason that the road coming\r<br />  from Dawnstar has been remade to have some extra distance between you and the camp if you\r<br />  don&#39;t intend to engage. Just follow the roadsigns for a safe(r) passage.\r<br />-Added a new spell to the game called &#34;Voice of Sithis&#34;. The corresponding spell tome can be found in\r<br />  the jarl&#39;s residence in Dawnstar. It is a more than adequate calm spell that you can probably use\r<br />  against anything you encounter ingame. However, don&#39;t put your money on that against any NPC that\r<br />  I have created. They tend to be level 100 or more when it comes to (boss) NPC&#39;s.\r<br />\r<br />\r<br />\r<br />It´s important to note that, given the updates this mod has received since its introduction, the pictures that are currently online show an outdated mod as those were the pictures from when this mod was first introduced. But I personally find completing the last bits to be more important than uploading new images. They´ll come when v2.1 is released.\r<br />\r<br />=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=\r<br />[/font]\r<br />News update (25th of february 2017):\r<br />\r<br />Having less time to mod for now, the v2.1 update is delayed until further notice. While close to being finished, I can&#39;t guarantee when it&#39;ll be uploaded.",
  "categoryId": "28",
  "version": "v2.0",
  "author": "King Rick",
  "createdUnix": "1334596431",
  "updatedUnix": "1470851673",
  "containsAdultContent": false,
  "uploadedBy": "King Rick",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000216503",
      "name": "Skyrim&#39;s Treasure Chests",
      "version": "v2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1327",
      "fileName": "Skyrim's Treasure Chests-15313-v2-0.rar",
      "uploadedUnix": "1470851673",
      "modVersion": "v2.0",
      "virusScanUrl": "https://www.virustotal.com/file/33ebc27e4dc44d010702d32e5b431a87392c7d591b730601800956e3aaf6907f/analysis/1470862682/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%27s%20Treasure%20Chests-15313-v2-0.rar?fid=1000216503&ttl=1535779605&ri=8192&rs=8192&setec=7b3f0a729ee22bef578d29cba887f27c"
    }
  ]
}