{
  "modId": 15314.0,
  "modName": "Skyrim - The three divine brothers",
  "summary": "Adds three new companion NPC&#39;s to the game, plus one EXTREMELY powerful dragon.",
  "descriptionHtml": "[font=Arial][size=2]This mod adds three new companion NPC&#39;s to the game. Their starting location is Solitude&#39;s Blue Palace. Their names are Zeus, Poseidon and Hades. Don&#39;t anger any of them because even if they are meant as companions, if you provoke them, they can and most likely will kill you with their divine powers. It&#39;s best to direct those powers towards your enemies.\r<br />\r<br />Taking one of them with you on your journey&#39;s couldn&#39;t be any easier. You just visit the Blue Palace and tell one of them to follow you.\r<br />\r<br />=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=\r<br />\r<br />v1.0 - Original release (16th of april, 2012):\r<br />\r<br />Added the companions Zeus, Poseidon and Hades to Solitude&#39;s Blue Palace. Each of the companions possesses a unique set of armour with a unique weapon. The enchantments on those items are all the same. Each of them have the dragonrend and unrelenting force shouts. Their spell differs. Zeus uses lightning, Poseidon ice and Hades fire.\r<br />\r<br />[b]THIS VERSION IS NO LONGER AVAILABLE ON THE INTERNET.[/b]\r<br />\r<br />-     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -\r<br />\r<br />v1.1 - Update(s) (17th of april, 2012):\r<br />\r<br />Fixed a minor mistake in the inventory of Hades. He accidentally had 100 armour pieces instead of his unique 100 &#34;Arrows of Hades&#34;. A special thank you to DukeMordred for letting me know of this minor mistake.\r<br />\r<br />Changed each spell effect to the wall variant.\r<br />\r<br />Created a unique faction for the three divine brothers. This means they cannot, accidentally or on purpose, attack each other anymore.\r<br />\r<br />[b]THIS VERSION IS NO LONGER AVAILABLE ON THE INTERNET.[/b]\r<br />\r<br />-     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -\r<br />\r<br />v1.2 - Update(s) (18th of april, 2012):\r<br />\r<br />Added the arch-enemy of the brothers to the game. It is the Skyrim version of the titan Kronos and he is displayed as an ancient dragon. He is respawning so you can kill him multiple times. You can find him south of Septimus Signus&#39; Outpost. But beware, if you fast travel to the outpost, you appear in immediate attack range of Kronos.\r<br />\r<br />Made a few minor changes to several player factions so they&#39;d be considered an enemy of the Faction of Kronos, ID A11KronosFaction. If I wouldn&#39;t have done that, Kronos wouldn&#39;t have attacked the player and anyone/anything around him/her unless he was attacked. Since Kronos is a major enemy, it wouldn&#39;t be right to have him half non-aggressive.\r<br />\r<br />Added the chest of Perseus, son of Zeus, to the Blue Palace in Solitude. This chest contains armour and a weapon that can aid you very well in the defeat of Kronos. A little help is needed there, believe me. The armour is available in both light and heavy versions and both the armour and weapon can be improved. The armour can be worn by both men and women, despite the fact that the armour is linked to Perseus. The chest also contains a book, titled &#34;Greek Divine Legends&#34;.\r<br />\r<br />[size=2][b]THIS VERSION IS NO LONGER AVAILABLE ON THE INTERNET.[/b][/size]\r<br />\r<br />[size=2]-   [/size][size=2]  -     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -     -[/size]\r<br />\r<br />v1.3 - Update(s) (10th of november, 2014):\r<br />\r<br />Added facial data from the Meshes and Textures maps. Placing this data in the corresponding maps of the Skyrim data folder should solve the issue of dark(er) coloured faces, thus making sure you no longer have to manually export facial data yourself by using the creation kit.\r<br />\r<br />[b]THIS VERSION IS NO LONGER AVAILABLE ON THE INTERNET.[/b]\r<br />\r<br />[size=2]-   [/size][size=2] -    -    -    -    -    -    -    -    -    -    -    -    -    -    -    -    -[/size]\r<br />\r<br />v1.4 - Update(s) (19th of may, 2016):\r<br />\r<br />Only a very small update this time. Seeing as how the brothers allow any player committed crime to take place, it seemed only right to adjust their settings so they wouldn&#39;t affect the stealth meter. That&#39;s the only thing that has changed.\r<br />\r<br />=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=x=\r<br />\r<br />[/size]Planned update:\r<br />\r<br />I plan to add a few monsters to the game world. They&#39;ll be in the more remote places, so you won&#39;t stumble into them by accident. Like Kronos near the outpost of Septimus Signus, these monsters will be extremely powerful and shouldn&#39;t be fought with without some divine aid.[/font]",
  "categoryId": "66",
  "version": "v1.4",
  "author": "King Rick",
  "createdUnix": "1334597413",
  "updatedUnix": "1463688018",
  "containsAdultContent": false,
  "uploadedBy": "King Rick",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000207092",
      "name": "Skyrim - The three divine brothers",
      "version": "v1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "33",
      "fileName": "Skyrim - The three divine brothers-15314-v1-4.rar",
      "uploadedUnix": "1463687940",
      "modVersion": "v1.4",
      "virusScanUrl": "https://www.virustotal.com/file/6c5dcb30c8508412cb047836446bc7cfa9095a003f8f255b49602c31aa9cd0e5/analysis/1463687942/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20-%20The%20three%20divine%20brothers-15314-v1-4.rar?fid=1000207092&ttl=1535779607&ri=8192&rs=8192&setec=f21c431c0329c6f5677afa091b6b0f21"
    },
    {
      "fileId": "1000207093",
      "name": "Skyrim - TTDB Facial Data",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "529",
      "fileName": "Skyrim - TTDB Facial Data-15314-.rar",
      "uploadedUnix": "1463688018",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3bbebd23cf69896fe99dc58717211b7594cb983a7f49a4ba996ae747885fa1f5/analysis/1463688063/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20-%20TTDB%20Facial%20Data-15314-.rar?fid=1000207093&ttl=1535779607&ri=8192&rs=8192&setec=4f759b0f7c73c7afd0e31dda05da8a32"
    }
  ]
}