{
  "modId": 15324.0,
  "modName": "MMO -- The Minimalist Magic Overhaul",
  "summary": "Minimalist Magic Overhaul attempts to rebalance and \\\"fix\\\" the Skyrim magic experience in the most unintrusive way possible.  Rather than making sweeping changes to the way magic works in the game, specific problems have been targeted and addressed (hopefully) in a way that works unobtrusively and seamlessly with the vanilla magic system. Several ",
  "descriptionHtml": "MINIMALIST MAGIC OVERHAUL (MMO)\r\n\r\nOVERVIEW\r\n\r\nMinimalist Magic Overhaul attempts to rebalance and \\\"fix\\\" the Skyrim magic experience in the most unintrusive way possible.  Rather than making sweeping changes to the way magic works in the game, specific problems have been targeted and addressed (hopefully) in a way that works unobtrusively and seamlessly with the vanilla magic system. Several of the changes in MMO take the form of bugfixes; many others are what I would consider to be annoyance fixes.  The remainder of the changes are attempts to make the various magic-user playstyles viable on roughly equal footing.\r\n\r\nHOW IS MMO DIFFERENT FROM OTHER MAGIC OVERHAULS?\r\n\r\nMMO is different from the other overhauls I\\'m aware of in a couple of ways.  First, MMO is not an attempt to remake Oblivion\\'s magic system or Morrowind\\'s magic system, or create some new mechanic for casting and scaling magic.  I felt that Skyrim\\'s magic system was basically fun, but with a few key flaws. Perk trees are altered as minimally as possible, and there are relatively few new spells added (currently only feather spells).  Second, MMO does not drastically increase the power of spellcasting in Skyrim.  Every other magic overhaul I have seen increases spellpower across the board by at least 100% at the top end; while it is arguable that Destruction needed this boost, other magic schools certainly did not, and a huge power boost actually makes some schools (Illusion, for instance) arguably overpowered.  Rather than increasing spellpower across the board and amplifying the power of some game systems that were already fine to improve the ones that were weak, instead, targeted adjustments have been made to improve specific areas of spellcasting that are weak or tedious in the vanilla system, most notably: Necromancy, protective spell durations, pure (unarmored) mage viability, Illusion magic play in dungeons (i.e., around undead/automatons), master-level spell casting times, and Destruction finishing perks. \r\n\r\nDETAILS\r\n\r\nMMO is broken up into five ESPs: they are all optional, although they are intended to be used together.  In addition, tejon\\'s Simple Skyrim Spell Scaling Solution is strongly recommended.  I have balanced MMO to work with it, and tSSSSS goes a long way to further improve the utility of (particularly) Destruction spells.  I do plan to eventually release a sixth ESP that overhauls Enchanting and Items as tSSSSS does, but for the time being, tSSSSS does an excellent job and works well with MMO.  Below are the nitty-gritty details for the five MMO modules.\r\n\r\nMMOAlterationChanges.esp\r\n\r\n-Dragonhide is now a shield spell like the other \\\"flesh\\\" spells.  It can now be cast one-handed, and casting time has been changed from 3 seconds to .5 seconds to bring it in line with the other shield spells.\r\n-Duration of several spells have been changed:\r\n\r\nDragonhide\t\t30 -> 180\r\nEbonyflesh\t\t60 -> 180\r\nIronflesh\t\t60 -> 180\r\nOakflesh\t\t            60 -> 180\r\nStoneflesh\t\t60 -> 180\r\nWaterbreathing\t\t60 -> 180\r\n\r\n-Mage Armor perk changed from an increase of 2x/2.5x/3x to 2x/3x/4x base protection\r\n-Mage Armor perk now also grants 5%/10%/15% elemental (fire/frost/shock) resistance when unarmored.  This is the equivalent of a free maxed-out resist enchant at Rank 3 Mage Armor, so non-armor wearers effectively have an extra enchantment slot now.\r\n-Mage Armor perk skill requirements changed from 30/50/70 to 30/60/90 to prevent mage armor outpacing smithed armor.\r\n-A flat 20 points of armor was added to each rank of the flesh spells to add an alternative to wearing armor at low levels (pre-Mage Armor) and boost the high end a touch.  Dragonhide now provides 150 points of base armor rather than a fixed level of physical damage mitigation.\r\n\r\nOakflesh\t\t            40 -> 60\r\nStoneflesh\t\t60 -> 80\r\nIronflesh\t\t80 -> 100\r\nEbonyflesh\t\t100 -> 120\r\nDragonhide\t\t80% mitigation -> 150 armor\r\n\r\n-Stability Perk has been increased from 1.5x unperked duration to 2.0x unperked duration, to bring it in line with similar perks in other schools.\r\n-New Perk: Pure Mage.  2 Ranks.  Requirements: Mage Armor & 40/80 Alteration (Ranks 1/2).  While not wearing armor, the power of all spells is increased by 10/20%.\r\n-New Spell (Apprentice): Feather: Carrying capacity is increased by 25 for 300 seconds.\r\n-New Spell (Adept): Lighten Load: Carrying capacity is increased by 50 for 300 seconds.\r\n-New Spell (Expert): Effortless Carry: Carrying capacity is increased by 75 for 300 seconds.\r\n\r\nMMOConjurationChanges.esp\r\n\r\n-New Perk added between Novice Conjuration & Necromancy.  Dark Influence (2 Ranks, Min Conjuration 30 & 60) increases the max level of corpses that can be reanimated by 25/50%.\r\n-Fixed Perk text on Necromancy to explicitly say double duration for raised corpses rather than just \\\"greater duration\\\".\r\n-Changed spell description text for all reanimate spells to indicate max level for raised corpses.\r\n-Duration Changes:\r\n\r\nBound Battleaxe \t            120 -> 180\r\nBound Bow \t\t120 -> 180\r\nBound Sword\t\t120 -> 180\r\nConjure Dragon Priest\t60 -> 90\r\nConjure Dremora Lord\t60 -> 90\r\nConjure Familiar\t            60 -> 90\r\nConjure Flame Atronach\t60 -> 90\r\nConjure Frost Atronach\t60 -> 90\r\nConjure Storm Atronach \t60 -> 90\r\nDread Zombie\t\t60 -> 300\r\nRaise Zombie\t\t60 -> 300\r\nReanimate Corpse\t60 -> 300\r\nRevenant\t\t60 -> 300\r\n\r\n-Raise Spells now have significantly longer durations than Summon Spells.  Rationale: Raise spells require a component (dead body) that summon spells do not, and due to this, these spells often would expire before another enemy could even be found to engage.  Now they should be a legitimate alternative to summon spells (5 minute base duration; 10 minute duration with Necromancy perk).\r\n-Fixed summoning spells so that having the atronach stone active would not cause them to fail.\r\n\r\nMMODestructionChanges.esp\r\n\r\n-Impact changed to only stagger 50% of the time\r\n-Runes now benefit from Augmented Flames/Frost/Shock.\r\n-Runes now also benefit from Intense Flames/Deep Freeze/Shocked Silence (formerly Disintegrate).\r\n-The Illusion perk Aspect of Terror no longer affects fire damage.\r\n-Intense Flames has been changed.  Instead of a Fear effect, the perk has a 20% chance to apply a 25% Weakness to Fire for 5 seconds (30% Weakness with 2/2 Augmented Flames).  This weakness stacks with itself however many times you can apply it in 5 seconds (testing indicates that the limit is probably around 3 applications, given unlimited mana and rapid-fire single-casting from both hands).  The amount of weakness applied also scales with +spell power and +destruction power effects.  As a bonus, the perk *should* now affect daedra, undead, and automatons, unlike vanilla Intense Flames (although for some reason I have not yet figured out, it doesn\\'t seem to be doing so).\r\n-Deep Freeze has also been changed.  The effect remains the same (temporary paralysis), but instead of only happening when the target is down to <20% health, Deep Freeze has a 10% chance to trigger whenever a frost spell is cast.  Paralysis duration has been increased from 3s to 5s.\r\n-Disintegrate has been renamed \\\"Shocked Silence\\\".  The perk no longer does additional damage;  it now grants a 10% chance to silence the target for 10s whenever a lightning spell is cast.\r\n-Casting times on Master-level spells have been reduced from 3s to 1.5s.\r\n\r\nMMOIllusionChanges.esp\r\n\r\n-Illusion spells now affect daedra, undead, and automatons by default, but only for half the duration that they affect non-daedra/undead/automatons.  (So base Calm will now last 15 seconds on Draugr, e.g.).  Rationale: these enemies are so common as to be ubiquitous, and Illusion mages being unable to affect them at all until skill level 90 was a crippling drawback.  \r\n-Master of the Mind has been changed to grant full duration to spells used against those types of enemies, and the minimum skill required for it has been lowered from 90 to 80.\r\n-The rate at which Muffle improves the Illusion skill has been toned down significantly.\r\n-Calm/Frenzy/Fear spells are now *resistable*!  That\\'s right -- in the vanilla game, there was no chance for a valid target to resist your fury spell.  Although I consider this to be a fix more than a change, it was a necessary fix given the new ways to increase your spell power;  otherwise, an Illusion mage with a low-level skill and some Novice spells bought in Riverwood could frenzy everything in the game without any risk at all.\r\n\r\nMMORestorationChanges.esp\r\n\r\n-Recovery Rank 2 skill requirement changed from 60 to 50 (as it was originally intended in the CK).\r\n-Recovery now provides an additional 25%/50% magic regeneration if player is wearing no armor.\r\n\r\nINSTALLATION\r\n\r\nUse your favorite mod manager (recommended!) or copy the ESPs to your Skyrim/Data folder.  A new game is recommended, but not required.  Be aware that if you install MMO on an old game, if your character already had the Recovery Perk, you will need to remove the perk then re-add it using the console to get the benefits of the new pure mage version.\r\n\r\nCOMPATIBILITY\r\n\r\nThis mod alters most of the spell school trees and many of the spells and effects.  Any other mods that alter these are likely to cause conflicts.  Mods that alter dual-casting values will be compatible (so long as that\\'s all they change), and mods that add spells (but do not touch perk trees or existing spells) are likely to work as well.  I suspect that Mighty Magick\\'s smooth spell power scaling module will work fine with MMO too, although I have not tested it (and please don\\'t bug me about it if it doesn\\'t work).  Finally, you do not need (and should not use) Conjuration & Summoning Fixes with MMO -- MMO already contains these changes.\r\n\r\nUPDATES\r\n\r\nI am pretty busy in real life, and I am also fairly new to modding, so be aware that some time may elapse between updates;  also, there are some things I just won\\'t know how to do or will be unwilling to change for design philosophy reasons.  Sorry about that!  But I have tested MMO while developing it, and I believe it to be stable and reasonably bug-free as is.\r\n\r\nFAQs/SOME DESIGN RATIONALE\r\n\r\nQ: Why didn\\'t you alter the Dual Casting cost/power?\r\nA: There\\'s no easy way that I\\'m aware of to have such a change affect only Destruction spells.  While I agree that Dual-Casting is not a great deal, mana-wise or DPS-wise, for Destruction, it is a very powerful tool elsewhere, especially for Illusion spells.  Other overhauls that change dual casting power to (for instance) 3.0x make low-level Illusion spells extremely powerful; for instance a simple fury spell would be able to frenzy level 18 targets when dual cast, and with the skill-level 40 perk Kindred Mage, an illusion caster would be able to frenzy level 48 (!!!) NPCs with a spell that can be purchased in Riverwood.  When combined with the changes made to Illusion here, such a change in dual casting power would make most encounters trivial.\r\n\r\nQ: Why didn\\'t you add smooth scaling based on skill level?\r\nA: It\\'s something I\\'m still considering adding in an optional ESP.  But for now, the idea was to keep as close to the vanilla experience as possible while closing some holes and fixing some problems.  Smooth scaling would change magic pretty significantly from vanilla.\r\n\r\nQ: Why add Feather spells?  Why not add Unlock or Fortify X or Mark/Recall?\r\nA: Feather was easy to do and seemed like an uncontroversial addition (and I kept the power of the spell at what seemed to be a reasonable level).  Unlock has the power to negate an entire skill and perk tree with a single spell.  Fortify spells have lots of potential problems and seem out of place in the Skyrim system.  There\\'s already a good Mark/Recall mod out there if you need one of those.  I might conceivably add a couple of other spells that seem uncontroversial (Fade Other, Shield Other, that sort of thing), but for now, let\\'s see how this works.\r\n\r\nQ: Where do I get the Feather spells?\r\nA: They have been added to vendor/container leveled lists and should show up in treasure chests and on vendors like any other spell.  A vendor refresh will likely be required before they do show up on existing games, however.\r\n\r\nKNOWN ISSUES\r\n\r\n-Alchemy and Enchantment strength are affected by the Pure Mage perk.\r\n-Runes currently do not have the ability to trigger Deep Freeze/Intense Flames/Shocked Silence.\r\n\r\nCHANGELOG\r\n\r\nv1.1a\r\n-----\r\n-Reverted Pure Mage fix.  It caused more problems than it solved.  Pure mage *will* affect potion/enchantment strength until I can come up with a better solution.\r\n-Fixed runes being set off as soon as they were cast.  Unfortunately, to do this, I had to make it so runes cannot trigger Deep Freeze/Intense Flames/Shocked Silence.\r\n\r\nV1.1\r\n----\r\n-Fixed Pure Mage so that it would not affect Enchantment/Alchemy strength.\r\n\r\n",
  "categoryId": "93",
  "version": "1.1",
  "author": "Jeffreybar",
  "createdUnix": "1334610346",
  "updatedUnix": "1335577477",
  "containsAdultContent": false,
  "uploadedBy": "jeffreybar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "53812",
      "name": "SkyrimMinimalistMagicOverhaulv1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18",
      "fileName": "SkyrimMinimalistMagicOverhaulv1-15324.rar",
      "uploadedUnix": "1334610426",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/31ac201ca090f0e56a271ba8564260bebecc256b62f00df3e200846e9bf9dd08/analysis/1406819167/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyrimMinimalistMagicOverhaulv1-15324.rar?fid=53812&ttl=1535779624&ri=8192&rs=8192&setec=42de92c4fc0c324e98d4f9fb0591dd43"
    },
    {
      "fileId": "54129",
      "name": "SkyrimMinimalistMagicOverhaulv1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "19",
      "fileName": "SkyrimMinimalistMagicOverhaulv1_1-15324.rar",
      "uploadedUnix": "1334709874",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c67554386a6468079481d390fc9f3d1dfc6aeffb2edb51a41a195b1dc967b5b2/analysis/1406821087/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyrimMinimalistMagicOverhaulv1_1-15324.rar?fid=54129&ttl=1535779625&ri=8192&rs=8192&setec=70713a3025ed330230632c8a096b6f9b"
    },
    {
      "fileId": "54929",
      "name": "SkyrimMinimalistMagicOverhaul_v1_1_a",
      "version": "1.1.a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19",
      "fileName": "SkyrimMinimalistMagicOverhaul_v1_1_a-15324-1-1-a.rar",
      "uploadedUnix": "1334966084",
      "modVersion": "1.1.a",
      "virusScanUrl": "https://www.virustotal.com/file/2afd647335347224395596fd67642d613d7be2928bf35022b82ab2cf1b7e299c/analysis/1406826014/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyrimMinimalistMagicOverhaul_v1_1_a-15324-1-1-a.rar?fid=54929&ttl=1535779625&ri=8192&rs=8192&setec=ba563f591440366042959dcb95ee9fd4"
    },
    {
      "fileId": "56897",
      "name": "ShockedSilenceScript",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "ShockedSilenceScript-15324-1.rar",
      "uploadedUnix": "1335577477",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2823c29387d183d2338dad54c51c9d1bae02d316de05bee0cd1e1e055cbf512a/analysis/1406844387/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ShockedSilenceScript-15324-1.rar?fid=56897&ttl=1535779626&ri=8192&rs=8192&setec=68dccc30604a6accdcde353da2e57f45"
    }
  ]
}