{
  "modId": 15332.0,
  "modName": "Dwemer Armory",
  "summary": "A place to store your stuff, convenient and easy.",
  "descriptionHtml": "Do you like to collect things in Skyrim? Do you throw them all over your house? No? Do you have everything in a few chests, and then feel like moving in Skyrim is almost as painful as moving IRL? If so, the Dwemer Armory is for you!\r\n\r\nWith 300 individually labeled chests, 190 weapon racks, 116 weapon and shield plaques, 60 mannequins, and 24 weapon displays, storing your stuff was never so much fun.\r\n\r\nNow I know what you\\'re thinking, \\\"300 chests and 190 weapon racks?!?! This place must be HUGE!\\\" Well you\\'re right, it is huge...BUT, there is a \\\"control panel\\\" added by the dwemer that will instantly move you to strategic points around the armory. There are levers all over the armory that will instantly take you back to the control panel! Believe me, there is no better way to store you stuff than the Dwemer Armory.\r\n\r\nBut the Dwemer wouldn\\'t be satisfied with a normal armory, oh no. There\\'s also a wall mounted map that the dwemer used to transport, well I won\\'t go into the details here, but suffice to say it\\'s alot easier to get around Skyrim if you\\'re leaving from the armory.\r\n\r\nYou can find a spell tome near the river in Riverwood that will teleport you to the Dwemer Armory no matter where you are (a second copy can also be found in the Spell Tomes bookcase), which is quite conveinent when you\\'re at the end of another dungeon crawl and don\\'t really feel like slogging your way back out. Also, there is a spell tome called \\\"Return from Dwemer Armory\\\" (found on top of the black soul gem cabinet), which will take you back to the last place you teleported from. (Very nice if you\\'re facing down a room full of Drugar and forgot to bring Dawnbreaker with you).\r\n\r\nAnd there\\'s a garden, too, with dwemer grow lights :) And 10 of the chests are refrigerated for storing food!\r\nOh, and a full crafting area, and the storage containers for the crafting area are near the stations that use them! Oh, and the Standing Stones are there for when you need a pick me up before smithing (warrior), or enchanting (mage), or making potions (thief). Also there are three mini-mannequins for storing your crafting gear on (wouldn\\'t want to get your armor dirty now would we?)\r\n\r\nAlso there are the shrines to the 9 divines (and Nocturnal for your thieving types).\r\nOh yeah, and there are 6 large, individually labeled safes for storing your most important stuff.\r\n\r\nOne last thing, it\\'s fully navmeshed (as you can see by Lydia, who seems to get lost when she\\'s following me, but somehow manages to get herself into a few of the pictures), so feel free to bring your followers.\r\n\r\n*** Special thanks to Kat for all her ideas and beta testing, the finished product wouldn\\'t be nearly as good without her help.\r\n\r\n** Credit also goes to harry.bridge for keeping after me to make it even more epic, and for troubleshooting too.\r\n\r\nStill to do:\r\nSome level of automatic storage\r\n\r\nMap available here:\r\nhttp://www.robbfesig.com/",
  "categoryId": "22",
  "version": "1.3",
  "author": "RNFesig",
  "createdUnix": "1334623000",
  "updatedUnix": "1335398023",
  "containsAdultContent": false,
  "uploadedBy": "rfesig",
  "primaryFile": null,
  "files": [
    {
      "fileId": "56327",
      "name": "Dwemer Armory",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "95",
      "fileName": "Dwemer Armory-15332-1-3.zip",
      "uploadedUnix": "1335398023",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/dab2c5179afb158a66809d627458ca8f0d108ebb0886da0f3d718476e74ec02b/analysis/1406840813/",
      "changelogHtml": " Added a bedroom and bath, bottom middle button on the control panel takes you there. <br/> \n Added a wood chopping block outside the main door <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwemer%20Armory-15332-1-3.zip?fid=56327&ttl=1535779646&ri=8192&rs=8192&setec=c8ba0843d229abb405a861cd215ba815"
    }
  ]
}