{
  "modId": 15335.0,
  "modName": "Gifts Of Akatosh",
  "summary": "Overpowered items for when you need some easy killin\\' time.",
  "descriptionHtml": "Updated 4/4/2012 (Now includes the Divine Craftsman of Akatosh Amulet, +400 to smithing, enchanting, and alchemy)\r\n\r\nNOTICE:\r\nYou may have to remove the items and put them back on if you were wearing them when your computer downloaded the updates to get all the effects.\r\n\r\nNear Riverwood there is a chest and a stone. These items were given by Akatosh, the father of all dov.\r\n\r\nHere\\'s a list of the current modifications of the Gifts of Akatosh. \r\n\r\nStone of Akatosh:\r\nResets all your skill points to 1, so you can re-learn your skills. Re-learning your skills lets you level higher and gives you additional perk points to use. You will not be able to use a new perk point on a skill until you have met the required level to achieve that perk, so use the stone wisely. (Save before use at a minimum).\r\n\r\nRing of Akatosh:\r\nMagic from all schools costs nothing to cast, immunity to poison, disease, fire, shock, frost, and magic.\r\n(This ring with going to be \\\"The One Ring\\\" from LOTR. Someone beat me to posting the mod, so I became bitter and made it an overpowered ring instead. That\\'s what started me down this path in the first place)\r\n\r\nAmulet of Akatosh:\r\nSneak fortified 100 points, archery fortified 100 points, Dark Brotherhood backstab bonus, wearer moves silently and can breathe underwater.\r\n(This amulet was going to be called \\\"Amulet of the Sniper Assassin\\\" originally)\r\n\r\nArmor of Akatosh (Light & Heavy):\r\n600 base rating, +400 to health, 400% health regen, 400% to light and heavy armors.\r\n\r\nHelmet of Akatosh (Light & Heavy):\r\n450 base rating, +400 to magicka, 400% magicka regen, 0 cooldown time between shouts\r\n\r\nGauntlets of Akatosh (Light & Heavy):\r\n450 base rating, One-handed, two-handed, and unarmed damage fortified 400% (You know you want to punch a dragon to death)\r\n\r\nBoots of Akatosh (Light & Heavy):\r\n450 base rating, +400 to stamina, +400 carry weight, 400% stamina regen, no fall damage (Needed for when you use your portal gun).\r\n\r\nShield of Akatosh (Light & Heavy):\r\nForify blocking 100%, blocks all magic (via Greater Ward), lights enemies in melee range on fire.Blocking magic and lighting your enemies on fire only occur when the shield is raised.\r\n\r\n\r\nArrows of Akatosh:\r\n100 base damage, 4 times faster travel than normal arrows. Can knock opponents around. 65535 arrows are available in the chest.\r\n\r\nBow of Akatosh:\r\n400 base damage, absorb 100 points of health, stamina, and magicka. Draw speed 2x fast than other bows.\r\n\r\nAxe, Sword, Greatsword, Warhammer, and Daggers of Akatosh:\r\n400 base damage (Dagger base 200), 150 points fire damage, 150 points shock damage, victims are paralyzed, chance to turn undead.\r\nNow also strikes fear into the lucky enemies you haven\\'t killed yet...\r\n\r\nStaff of Akatosh (Enchantment name \\\"WizardStick\\\"):\r\n150 points lightning damage (for 6 seconds), 100 points fire damage (for 6 seconds), 100 points frost damage.\r\nProjectile fires at extreme speed, no more leading the target, just point and shoot.",
  "categoryId": "40",
  "version": "2.2",
  "author": "RNFesig",
  "createdUnix": "1334625905",
  "updatedUnix": "1334626123",
  "containsAdultContent": false,
  "uploadedBy": "rfesig",
  "primaryFile": null,
  "files": [
    {
      "fileId": "53870",
      "name": "Gifts of Akatosh",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2043",
      "fileName": "Gifts of Akatosh-15335-2-2.zip",
      "uploadedUnix": "1334626123",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/823cd7d61f34e8e164f4e75cb1e36fae85a52cac21feb1fbc7451a24143e7521/analysis/1406819467/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gifts%20of%20Akatosh-15335-2-2.zip?fid=53870&ttl=1535779652&ri=8192&rs=8192&setec=7f4bb271439791964f4485b933e516f3"
    }
  ]
}