{
  "modId": 15348.0,
  "modName": "PJs Forget Spell",
  "summary": "Allows you to \\\"forget\\\" a spell removing it permanently from your spell book.  Use this to declutter the number of spells you know.",
  "descriptionHtml": "*** Look for my new spell compendium to come out in a couple weeks featuring 15+ new unique scripted spells! ***\r\n\r\nVersion 1.0\r\n\r\nCreates a spell that allows you to forget other spells in your spellbook, including custom ones from other mods.  Useful if you are finding your spellbook cluttered with too many spells.\r\n\r\nTo use, cast the spell and you will have 60 seconds to cast another spell.  A message box will appear and ask if you want to delete the spell.  Saying yes will remove it from your spellbook.  The spell will cast briefly before deletion so make sure you are in a safe place and not pointed towards any friendlies for hostile spells.\r\n\r\nSpell tome can be found on the counter in the Sleeping Giant Inn in Riverwood, see screenshot for exact location if you cannot find it.\r\n\r\nKNOWN ISSUE:\r\nCannot delete starting spells at this time since they are treated differently than those spells learned manually.  If enough interest I can try and figure out the easiest way to alleviate this issue however there are other mods out there that delete these spells.\r\n",
  "categoryId": "75",
  "version": "1.0",
  "author": "pjyelton4476",
  "createdUnix": "1334641865",
  "updatedUnix": "1334641916",
  "containsAdultContent": false,
  "uploadedBy": "pjyelton4476",
  "primaryFile": null,
  "files": [
    {
      "fileId": "53906",
      "name": "PJs Forget Spell",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "PJs Forget Spell-15348.rar",
      "uploadedUnix": "1334641916",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9bbcd574ca5d29990897cd839d5057524d73c7e7b16e0a55d876d1cda4fe29e1/analysis/1406819705/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PJs%20Forget%20Spell-15348.rar?fid=53906&ttl=1535779674&ri=8192&rs=8192&setec=ab87a74973a898c49481273407a9223e"
    }
  ]
}