{
  "modId": 15340.0,
  "modName": "Breezehome Garden",
  "summary": "Adds a small garden to the back of the Breezehome player house. ",
  "descriptionHtml": "This mod adds a small garden to the back area of Breezehome. \r\n\r\nI always hated how empty it was and wanted to put something back there that might actually be useful. I know there are some purists out there that feel like crops shouldn\\'t be in a city, but I don\\'t agree. This isn\\'t a full blown farm, these are much smaller plants that I feel fit in well with a city environment. If they can have cows and chickens in a city, they certainly can have a small garden with useful things. Besides, Honeyside in Riften has a garden, why not Breezehome? That being said, if you are one of these purists that don\\'t agree, feel free not to download the mod. =)\r\n\r\nThis mod is a modification of the original mod designed by Jedijas. He was nice enough to make this mod, per my requests on the Message Boards. I was originally unable to figure out the Creation kit, but after his initial work, I was able to figure out how to make it more towards the vision I had in my head. It\\'s just a small mod, but it wouldn\\'t have been possible without his work, so I must give credit where it is due. If you\\'re interested in checking out that mod, you can find it here: http://skyrim.nexusmods.com/downloads/file.php?id=15174   \r\n\r\n(Please Note: The mod is the same name, so it will replace his file if you are attempting to drag it into the data folder. If you wish to save his mod, please make a backup or be prepared to re-download.)\r\n\r\nThis mod does not alter Breezehome interior in any way. In fact, the only thing that was removed from  the exterior of Breezehome was a single bush on the left side of the house. I purposely left the area to the right of the house clear as to not interfere with many mods that add a basement entrance. \r\n\r\nHopefully, someone else out there will find this mod useful. Oh, and go easy on me, this is the first mod I\\'ve ever shared. Thanks for reading!\r\n\r\n\r\nManual Installation Instructions: Simply drag the esp file into the \\\"DATA\\\" folder in your Skyrim folder. By default, this should be in \\\"Steam>Steamapps>Common>Skyrim>Data\\\"\r\n\r\nManual Instructions for Uninstall: Simply delete the esp file. Thats it.\r\n\r\n\r\n~Jagoros",
  "categoryId": "67",
  "version": "1",
  "author": "Jagoros",
  "createdUnix": "1334627562",
  "updatedUnix": "1334627781",
  "containsAdultContent": false,
  "uploadedBy": "Jagoros",
  "primaryFile": null,
  "files": [
    {
      "fileId": "53877",
      "name": "BreezehomeGarden",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "BreezehomeGarden-15340-1.zip",
      "uploadedUnix": "1334627781",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/ec997ee7e5a977377cacfd545f79371458168eb81bb261190d95ab3e181f2444/analysis/1406819472/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BreezehomeGarden-15340-1.zip?fid=53877&ttl=1535779660&ri=8192&rs=8192&setec=23afb600f2b0fdae6b8980460e59490a"
    }
  ]
}