{
  "modId": 15367.0,
  "modName": "Sell Stolen Goods to any Merchant",
  "summary": "Allows you to barter stolen goods with any merchant.",
  "descriptionHtml": "[font=\\\"Arial Black\\\"] [color=red] [size=5] This mod is no longer needed since I was told that you just have to type [/font] [/color] [/size][size=5][font=\\\"Arial Black\\\"]\\\"player.modav BypassVendorStolenCheck 1\\\"[/size][/font][font=\\\"Arial Black\\\"] [color=red] [size=5] in the console to get the same effect as this mod[/font] [/color] [/size]\r\n\r\n\r\nWhat I really wanted to do:\r\n\r\nIt really bothered me that you could not barter stolen goods with any merchant, because, how do they know that the goods are stolen?\r\nSo I wanted to make every merchant in Skyrim a possible fence, so that you could just sell your stolen goods to any merchant without having to obtain the Investor and Fence perks first.  But I could not find out how to do it. \r\n\r\nWhat I did:\r\n\r\nI made a workaround that removes the requirement of having to invest before being able to barter stolen goods, so that you can barter stolen goods with anyone once you have the Fence perk. \r\nI have also added a \\\"cheat\\\" that gives you the Fence perk (if you don\\'t already have it), which you (obviously) need to be able to barter stolen goods. And of course you don\\'t HAVE to cheat to get the perk, you could just get it the normal way to if you like, but this is just a faster way to get the mod to work =).\r\n\r\nHow to install:\r\nJust extract the files into your Skyrim\\\\Data folder.\r\nIn game, open the console and type:\r\nBat Fence\r\nto get the Fence perk, if you don\\'t already have it.\r\n\r\nHow to uninstall:\r\n(If you want to remove the Fence perk)\r\nOpen the console and type:\r\nBat RemoveFence\r\nOtherwise just remove the files from the Data folder.\r\n\r\nBugs/Issues:\r\nNone that I know of, please report to me if you find some.\r\n\r\nPermissions:\r\nPlease ask me before uploading this somewhere else.\r\n\r\n-------------------------------------------------------------------------------------------------------------------\r\nI\\'m gonna see if I can find another way to do this without having to cheat your way to it, but right now I don\\'t have a clue how I could go about doing it. I really made this mod months ago, I did not upload it until now because I didn\\'t feel like it was completely done. But maybe you will enjoy it the way it is. Feel free to leave suggestions or give me some advice on how I can improve it!",
  "categoryId": "69",
  "version": "1.0",
  "author": "Togetic",
  "createdUnix": "1334671418",
  "updatedUnix": "1334671990",
  "containsAdultContent": false,
  "uploadedBy": "Togetic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "53993",
      "name": "Fence Mod",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Fence Mod-15367-1-0.7z",
      "uploadedUnix": "1334671990",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2d711374f2f4b60e0e972292ffb08b767b8c5cb842d74165f203eeea4d0f15cc/analysis/1406820142/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fence%20Mod-15367-1-0.7z?fid=53993&ttl=1535779708&ri=8192&rs=8192&setec=c99eb77adb5103f7b3d04db8218eaee1"
    }
  ]
}