{
  "modId": 15395.0,
  "modName": "Ragged Flagon alternate entrance-exit",
  "summary": "Lore friendly exit/entrance to the Ragged Flagon",
  "descriptionHtml": "[size=15][center] Ragged Flagon Thieves Exit/Entrance[/center][/size]\r\n\r\nIf you have ever played with the CK then you might have noticed that the interior cell piece for the Ragged Flagon in Riften doesn\\'t have a floor in the \\\"well\\\" underwater. And that it leads to a small underwater tunnel. This mod simply removes the added floor pieces in the Ragged Flagon well (I am not calling it a cistern so as not to confuse it with the \\\"Cistern\\\" cell, even though thats what it is) and adds an exit at the bottom. It is sort of like the \\\"hidden\\\" room in Proudspire Manor. The exit takes you completely out of Riften and spits you out at the dock area south of town. \r\n\r\nThere are a couple of other mods out that give you an alternate way in/out of the Ragged Flagon, but this one seems a bit more lore friendly to me. It\\'s perfect for that RP thief who does not want ANYBODY to see him/her going into or out of the Thieves Guild. I mean sure, you are gonna get a bit wet, but you do what you gotta do when your a talented Cutpurse.\r\n\r\nNOTE: there is no additional lighting under the water at the exit, so if you use a mod that makes everything darker, then I suggest having a light source when you dive down. It\\'s a tad dark down dere.\r\n\r\nThanks for giving her a look and heres to a long and fruitful thieving career.\r\n\r\n\r\n \r\n\r\n",
  "categoryId": "90",
  "version": "1.0",
  "author": "Ferogain",
  "createdUnix": "1334703873",
  "updatedUnix": "1334703938",
  "containsAdultContent": false,
  "uploadedBy": "ferogain",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54106",
      "name": "Ragged Flagon Exit-Entrance",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Ragged Flagon Exit-Entrance-15395-1-0.zip",
      "uploadedUnix": "1334703938",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c857b85837190b422ca6952aa319bb1fa2425a9f8daeba4d677cc103cd7599ba/analysis/1406820970/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ragged%20Flagon%20Exit-Entrance-15395-1-0.zip?fid=54106&ttl=1535779752&ri=8192&rs=8192&setec=b3d327d4cccf4af476467752cc4ec918"
    }
  ]
}