{
  "modId": 15420.0,
  "modName": "Circle Companions Revised",
  "summary": "This mod makes some changes to Jorrvaskr\\'s Inner Circle members/followers, as I believe they should have been. Kodlak & Vilkas remain unchanged, Farkas & Aela the Huntress both wear the Wolf Armor set as their default armor. The armor persists after dismissing these followers. Aela\\'s facial features received an overhaul.",
  "descriptionHtml": "[b]This Mod is discontinued. The Farkas issue it was supposed to fix is expertly handled in the [url=http://skyrim.nexusmods.com/mods/19]Unofficial Skyrim Patch[/url]. You are advised to use that patch.[/b]\r\n\r\n[u][b]GENERAL INFORMATION:[/b][/u]\r\n\r\nHail, Dovahkiin!\r\n\r\nThis is my second plugin ever created, after I made the [url=http://tes.nexusmods.com/downloads/file.php?id=7752]Rosethorn Hall of Conquest [/url] mod years ago for TES IV: Oblivion.\r\n\r\nThe mod makes some changes to Jorrvaskr\\'s Inner Circle members/followers, as I envision they should have been. I like the Companions faction as well as I like consistency and uniforms, and so I was a bit disappointed that two members of the Inner Circle were not wearing the incredible looking Wolf Armor set and thus were not properly identifying themselves as full members. Hence I made this small mod for myself in an attempt to change this.\r\n\r\nFarkas & Aela the Huntress now wear the Wolf Armor set as their default armor. Both of them also received a Skyforge Steel Sword as their main weapon. No stats of these characters have been changed nor has their essential settings or scripts been tampered with. While having them as a follower you can still equip Farkas & Aela with armor of your choosing as long as it has better stats, but upon dismissal they will revert back to the Wolf Armor set of the Companions.\r\n\r\nAela\\'s facial features also received an overhaul in order to make her - in my opinion - more attractive for a potential spouse, by using [url=http://skyrim.nexusmods.com/downloads/file.php?id=10168]Apachii\\'s SkyHair[/url] mod.\r\n\r\n[b][u]REQUIREMENTS:[/b][/u]\r\n\r\nThe following epic hair mod is [u]obligated[/u] to be used in combination with the Circle Companions Revised plugin.\r\n[list]\r\n[*] [url=http://skyrim.nexusmods.com/downloads/file.php?id=10168]Apachii\\'s SkyHair[/url].\r\n[/list]\r\n[b][u]RECOMMENDED:[/b][/u]\r\n\r\nIf you would prefer to have Aela the Huntress exactly like in the screenshot, I recommend to also use the following excellent mod for additional makeup features for females. Without this mod, Aela\\'s skin tones and makeup will be more plain.\r\n[list]\r\n[*] [url=http://skyrim.nexusmods.com/downloads/file.php?id=2812]BellaGail\\'s Better Females by Bella (Makeup Version 2)[/url]. This mod will impact all female faces, but Makeup Version 2 will still do it in a subdued and lore-friendly way. Other Makeup Versions can be installed, according to your personal preference.\r\n[/list]\r\n[b][u]INSTALL:[/b][/u]\r\n\r\nInstallation through Nexus Mod Manager is recommended. It is advised to dismiss Farkas or Aela before installing this mod and to make a separate, clean savegame. Manual installation is as follows:\r\n[list]\r\n[*] Install [url=http://skyrim.nexusmods.com/downloads/file.php?id=10168]Apachii\\'s SkyHair[/url] mod.\r\n[*] (Optional) Install BellaGail\\'s [url=http://skyrim.nexusmods.com/downloads/file.php?id=2812]Better Females by Bella[/url] mod.\r\n[*] Download and place CircleCompanionsRevised.esp in your .../Skyrim/Data folder.\r\n[*] Start Launcher and enable CircleCompanionsRevised.esp under Data Files.\r\n[*] Start game!\r\n[/list]\r\n[b][u]UNINSTALL:[/b][/u]\r\n[list]\r\n[*] Delete CircleCompanionsRevised.esp from .../Skyrim/Data folder.\r\n[/list]\r\n[b][u]KNOWN ISSUES:[/b][/u]\r\n[list]\r\n[*] Upon re-acquiring Farkas & Aela the Huntress as followers for the first time after the installation of this mod, both will have their old vanilla default outfits in their inventory (not worn!), which can be traded to the PC. This is a result of their hidden outfit scripts which cannot be found or altered. This only happened once and after I removed the items from their inventory they never came back, even after dismissing them and hiring them again. Aela the Huntress will have 2 pieces of Ancient Nord Armor, Ancient Nord Boots and Ancient Nord Gauntlets in her inventory. Farkas will have Steel Armor, Steel Nordic Gauntlets, Steel Cuffed Boots and potentially an Iron Greatsword in his inventory.\r\n[/list]\r\n[b][u]CONFLICTS:[/b][/u]\r\n[list]\r\n[*] Known to cause conflict with Ultimate Follower Overhaul.\r\n[*] Likely conflicts with other mods who change the appearance & inventory of followers, those of Farkas & Aela the Huntress in particular. Proceed with caution and take notice of your load order. Some might be compatible, others might not.\r\n[/list]\r\n[b][u]CREDITS:[/b][/u]\r\n\r\nExtra thanks and consideration for these excellent modders:\r\n[list]\r\n[*] [url=http://skyrim.nexusmods.com/modules/members/index.php?id=283148]Apachii[/url].\r\n[*] [url=http://skyrim.nexusmods.com/modules/members/index.php?id=2501668]BellaGail[/url].\r\n[/list]",
  "categoryId": "66",
  "version": "1.0",
  "author": "Neri",
  "createdUnix": "1334742800",
  "updatedUnix": "1334743189",
  "containsAdultContent": false,
  "uploadedBy": "Neri",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54220",
      "name": "Circle Companions Revised",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Circle Companions Revised-15420-1-0.7z",
      "uploadedUnix": "1334743189",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/09db32e6a7ac2defd484dbcc3c082fc3b765d0968295202d948ed307c71e62bf/analysis/1406821623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Circle%20Companions%20Revised-15420-1-0.7z?fid=54220&ttl=1535779789&ri=8192&rs=8192&setec=6ff9d625f0d4a43d270e3998b3a6eea1"
    }
  ]
}