{
  "modId": 15458.0,
  "modName": "Malkieri Armor - Standalone - Wheel of Time",
  "summary": "This is a \\\"Wheel of Time\\\" inspired armor set based on the original Blades armor combined with resources from other mods.",
  "descriptionHtml": "This is a \\\"Wheel of Time\\\" inspired armor set based on the original Blades armor combined with resources from two other mods.\r\n\r\nThe armor can only be crafted at the Skyforge and requires the Advanced Smithing perk. It is under the steel smithing category and requires steel, quicksilver, and leather strips. It is currently only available in Light Armor form and is certain to be overpowered, though not outrageously so. If you want to avoid the \\\"overpoweredness\\\" of it for balance\\'s sake, you could simply choose not to improve the armor.\r\n\r\n\r\n\r\n\r\nFuture work is tenuously planned, but only in the event that my modding skills increase enough to do the ideas justice. I\\'d rather bring no mods to the community rather than bad ones. That said, if anyone wants to take the reins on any of these ideas and create them independently, feel completely free to do so. I only ask that you send me a link so I can add it to this description.\r\n\r\nFuture ideas:\r\nHadori (the leather cord all Malkieri proudly wear)\r\nHeron Marked Sword (a one handed sword that gives bonuses for using it without a shield)\r\nAdd a version of the armor with the \\\"golden crane in flight\\\" insignia on the breast\r\n\r\n\r\n\r\n\r\n\r\nSources:\r\n\r\nThe \\'crested\\' helmet mesh is from Samurai Blades Armor by zyuu:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=7618\r\n\r\nAll other meshes were extracted from Skyrim - Meshes.bsa using Ethatron\\'s BSAopt:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=247\r\n\r\nAll of these meshes were edited by myself, as needed, using NifSkope:\r\nhttp://niftools.sourceforge.net/wiki/NifSkope\r\n\r\nThe textures used in this mod were edited by me, but the originals from which I started are those found in Blades Armor Onimusha Reskin by Fulchrum:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2560\r\n\r\nTo edit the textures, I used GIMP and the associated GIMP-DDS plugin:\r\nhttp://www.gimp.org/\r\nhttp://code.google.com/p/gimp-dds/",
  "categoryId": "54",
  "version": "1.0",
  "author": "deadfables",
  "createdUnix": "1334793289",
  "updatedUnix": "1334793480",
  "containsAdultContent": false,
  "uploadedBy": "deadfables",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54435",
      "name": "Malkieri Armor v1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5441",
      "fileName": "Malkieri Armor v1-15458-1.7z",
      "uploadedUnix": "1334793480",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e75a29bb947f963a0d0c3344397c0e4b57590bfeb8636db4c56950371d7ff4b0/analysis/1406822950/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Malkieri%20Armor%20v1-15458-1.7z?fid=54435&ttl=1535779898&ri=8192&rs=8192&setec=4f5997eaf429507daa3b23a607898ad3"
    }
  ]
}