{
  "modId": 15468.0,
  "modName": "Talent Tweak",
  "summary": "Removes skill requirements from most perks and adds a few tweaks to the trees.",
  "descriptionHtml": "Have you ever gotten a level up and can\\'t find a good place to spend that perk point? You can bank it until you skill up after grinding or you can drop it into a tree you just don\\'t use that much. Either way it makes leveling a chore. \r\n\r\nThe fix? Separate skills from perks. Use skills to incrementally improve your character and perks to build your character\\'s specialization. \r\n\r\nFeatures at a glance:\r\n- Removes skill requirements from most perks, build your character from the ground up.\r\n- Tweaks the positioning of one or two perks into a more logical flow.\r\n- Adds one overlooked perk to the Speech tree. \r\n\r\nFeatures in depth:\r\n\r\nSkill requirements have been removed from all perks except;\r\n- Shadow Warrior (sneak) now requires a Sneak skill of 50 (down from 100) \r\n- Unbreakable (lockpicking) retains its requirement for a Lockpicking skill of 100. \r\n- Extra Pockets (pickpocket) retains its requirement for a Pickpocket skill of 50 and changes its position up in the tree to now require Misdirection.\r\n\r\nPerk trees remain largely unchanged except;\r\n- Smithing: Both Ebony and Glass Smithing lead to Daedric Smithing and Daedric is now required to move on to Dragon Smithing.\r\n- Stealth: Deadly Aim Has been shifted down and now only requires the first rank of Stealth. Backstab now leads directly to Assassin\\'s Blade. \r\n- Speech: A new perk, Intrigue, has been added alongside Allure. Where Allure makes prices 10% better with the opposite sex, Intrigue makes prices 10% better with the same sex. Both Perks require Haggling and either one will lead back to bribery.\r\n\r\nInstallation - Copy the .esp to your Data folder and activate or download with the Manager.\r\n\r\nConflicts - Due to it\\'s nature this will conflict with just about any mod that changes perks. It should, however, work with just about anything else. My best suggestion is to make a save backup and give it a whirl.",
  "categoryId": "73",
  "version": "1.00",
  "author": "S1lent0ne",
  "createdUnix": "1334811551",
  "updatedUnix": "1334811677",
  "containsAdultContent": false,
  "uploadedBy": "S1lent0ne",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54477",
      "name": "Talent Tweak 1_00",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19",
      "fileName": "Talent Tweak 1_00-15468-1-00.zip",
      "uploadedUnix": "1334811677",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/4e5313595d0609edc803be30fcd8e5f2adc3b8c056d31e5730d54575bc6fd710/analysis/1406823264/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Talent%20Tweak%201_00-15468-1-00.zip?fid=54477&ttl=1535779916&ri=8192&rs=8192&setec=1f8687dca2efccb942cf89a0214b5b9f"
    }
  ]
}