{
  "modId": 15467.0,
  "modName": "Dragon Merchant with Buyable Dragon Souls",
  "summary": "This mod adds a FRIENDLY DRAGON MERCHANT that will sell you Dragon souls for a varying price. At max speech they\\'re around 7700 gold unless you use enchants for bartering. You need the Merchant perk for them to show up in his bartering window. At 100% barter enchants it goes to about 5250 gold.  The Dragon merchant has 25,000 gold for bartering.",
  "descriptionHtml": "Link to original mod:\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=21322\r\n\r\nThe purpose of this mod is to have a place to unload all of your miscellaneous junk into a merchant and buy dragon souls for use in mods like ones that allow you to convert Dragon souls into perk points.  Things like that.  Some perks cost 80,000 gold depending on the mod you\\'re using, and the bartering enchants / effects you might have on.  The lowest I could get the dragon soul gems to go to was 5250, which I think is fair.\r\n\r\nTHIS IS A NEXUS VERSION OF MY STEAM WORKSHOP MOD\r\n\r\nThis mod adds a FRIENDLY DRAGON MERCHANT that will sell you Dragon souls for a varying price. At max speech they\\'re around 7700 gold unless you use enchants for bartering. You need the Merchant perk for them to show up in his bartering window.\r\n\r\nThings you should know:\r\n1. If his gold goes over 33,000 (I think), his Gold WILL be bugged. Sell him some things first if you want to get your Gold back when buying Dragon Soul Gems.\r\n2. YOU NEED THE MERCHANT PERK TO BE ABLE TO BUY THE DRAGON SOUL GEMS\r\n3. He is South of Mehrune\\'s Dagons\\' shrine. A map marker is in the pictures.\r\n4. The Dragon Soul Gem is considered a potion. \\\"Drink\\\" it to acquire a soul.\r\n\r\nRevised version:\r\nTHE DRAGON SHOULD BE PASSIVE TO \\\"SOME\\\" ENEMIES NOW. Dragons won\\'t aggro him, bandits won\\'t aggro him. Followers won\\'t attack him UNLESS you order them to. You can\\'t attack him (isGhost command) etc. He should be relatively laid-back now.\r\n\r\nBut: If he\\'s still flying around, reset him with console commands:\r\n\r\nType \\\"help Yuvonsmoliin\\\" in console and you\\'ll find an ID. Then type \\\"Resetreference (Yuvonsmoliin\\'s ID)\\\" then \\\"Ressurect (Yuvonsmoliin\\'s ID)\\\" to refresh him. If you can\\'t talk to him still, don\\'t fret. Just fast travel then come back to him.\r\n\r\nCredit for the consumable Dragon Souls script goes to someone named Arthorious on 4chan\\'s /vg/.  It would not be possible without him.",
  "categoryId": "33",
  "version": "1.3",
  "author": "MrCasual",
  "createdUnix": "1334807741",
  "updatedUnix": "1334807834",
  "containsAdultContent": false,
  "uploadedBy": "MrCasual",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54465",
      "name": "Dragon Merchant with Buyable Dragon Souls",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29",
      "fileName": "Dragon Merchant with Buyable Dragon Souls-15467-1-3.rar",
      "uploadedUnix": "1334807834",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/89ddcd1f7f798942fe422d05581f5ba7f8da8426cdcd05ed395bbf1a05dfa171/analysis/1406823255/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Merchant%20with%20Buyable%20Dragon%20Souls-15467-1-3.rar?fid=54465&ttl=1535779913&ri=8192&rs=8192&setec=2b617b7fff0f683ca47cea60c8facdd4"
    }
  ]
}