{
  "modId": 15517.0,
  "modName": "Zigurdz Brutal Combat",
  "summary": "Brutal Combat adds a new Combo Mechanic to the game through which the warrior aspect of gameplay is enhanced. ",
  "descriptionHtml": "[img]http://img135.imageshack.us/img135/5508/bannerds.jpg[/img]\r\n[font=\\\"Arial Black\\\"] [size=\\\"4\\\"] Brutal Combat adds a new Combo Mechanic to the game through which the warrior aspect of gameplay is enhanced. A previews version of the MoD with the same theme was launched a few weeks ago for testing and bug fixing (“Path of the BattleMaster”). \r\nThis mod additionally adds 3 new abilities/spells: Weapon Throw, Recuperate and Dodge.\r\nThe Mod is built for warrior combat in general and works for any type of melee weapon.\r\n\r\n[color=\\\"#8B0000\\\"]How this works:[/color]\r\nMelee combat in vanilla Skyrim consists in swinging your weapon at the enemy or doing directional Power Attacks (back, front, standing, side) at the cost of stamina. Of course other factors come in such as blocking and bashing while blocking (which also costs stamina). What this MoD does is add new animations and effects (on top of the standard combat moves) triggered conditionally by a combo mechanic. \r\nWhile in combat, the player can “dance” through 4 stances: Vengeful, Relentless, Reckless and Savage.\r\n\r\n[color=\\\"#8B0000\\\"]Reckless to Savage:[/color]\r\nIn order to trigger the Reckless stance, the player must build up frenzy by performing consecutive weapon swings (non-power attacks). Each swing will increase attack speed by and amount up to double (x2) the attack speed. After 5 weapons swings, Recklessness will be triggered and the player will receive no recoil for hitting enemies which block. Additionally, attacks are sweeping attacks (hitting all enemies in a cone in front of the player). In order to sustain frenzy, the player must continuously swing his weapon. 5% of the max stamina will be depleted with each swing while in Recklessness Stance. If the player has no more stamina, HEALTH will be drained instead. The Frenzy effect can be consumed by performing a Power Attack or cooling down. \r\nPower Attacking while in Reckless Stance will trigger the Savage Stance which unlocks a new set of special animations depending on movement direction. These special attacks deal bonus damage and incapacitate the enemy. \r\n\r\n[color=\\\"#8B0000\\\"]Vengeful to Relentless:[/color]\r\nTriggering the Vengeful Stance can be done by performing a Power Attack (not when in frenzy). Vengeful Stance lasts for 10 seconds and blocking incoming attacks will counter and hit the aggressor back. Additionally, directional attacks will trigger new special attacks which can stagger or knock back hostiles.\r\nPerforming a Power Attack while in Vengeful Stance will trigger the Relentless Stance which unlocks a new set of special animations depending on movement direction. These special attacks deal bonus damage and incapacitate the enemy. \r\nIn other words, in order to trigger certain special attacks, the player must do a sequence of normal attacks or power attacks.\r\n\r\n In order to get started, try any variation of consecutive power attacks and keep in mind:\r\nNormal weapon Swings x 5 -> Reckless Stance -> Power Attack -> Savage Stance -> directional Normal Attack -> awesome finishing move -> Win\r\nPower Attack -> Vengeful Stance -> directional Normal Attack -> awesome special attack -> Power Attack -> Relentless Stance -> directional Normal Attack -> awesome finishing move -> Win\r\n\r\n[color=\\\"#8B0000\\\"]Combo Ex: [/color]\r\n2Hwep:\r\n\tPummel: Any Power Attack -> Forward Normal Attack.\r\nPummel + Dragon Swipe: Any Power Attack -> Forward Power Attack -> Forward Normal Attack.\r\nPummel +  Saber Pounce: Any Power Attack -> Forward Power Attack -> Backwards Normal Attack.\r\n\r\n[color=\\\"#8B0000\\\"]Throw Weapon:[/color]\r\nEquip it as a shout and on use it will throw your equipped right hand weapon towards your cursor. Enemies caught in its path will be incapacitated and damaged for and amount proportional to the target’s missing health and weapon distance travel (the less health the target has, the more the damage. The longer it travels the more the damage). The damage done will be returned as Health to the Player.\r\nYour weapon will not be lost, it will only be unequipped and you will have to manually reequip it. \r\n[color=\\\"#8B0000\\\"]Recuperate:[/color]\r\nEquip it as a shout and on use it will restore health and stamina over 10 seconds if the player is out of combat and is not moving.\r\n[color=\\\"#8B0000\\\"]Dodge:[/color]\r\nEquip it as a shout and on use it will perform dodge moves depending on your movement direction. Enemies close to the player will be slightly staggered, interrupting their weapon swings during the animation. (works best for 2h Axes and Maces. For some reason the animations don’t always trigger for 2h swords and 1h weapons)\r\n\r\n[youtube]fD3GBKkeU8k&context=C4de1e35ADvjVQa1PpcFNwSDdJ23qW0QhDlnBmx4BFEmiZbOT1BAg=[/youtube]  \r\n\r\n[color=\\\"#8B0000\\\"]How to Install:[/color]\r\n -Extract everything in your Data folder or use the manager.\r\n -Make sure you have the 1.5 version installed. (important)\r\n\r\n[color=\\\"#8B0000\\\"]How to Activate the MoD in-game:[/color]\r\nGo to Whiterun Stables and from there to the Khajiit camp nearby. There’s a creak close to the khajiit camp. You will find a book floating in the water. Read it and you will learn all the necessary spells.\r\n(or type in help battlemaster and use the book’s ID with player.additem ID 1)\r\nYou can toggle Brutal Combat on and off in-game by casting the “Brutal Combat Toggle” spell.\r\n\r\n[color=\\\"#8B0000\\\"]Misc:[/color]\r\nYou can break out of a combo or attack animation by tapping the CTRL key (default Sneak key).\r\n\r\n[/size][/font]",
  "categoryId": "24",
  "version": "0.2",
  "author": "Zigurd",
  "createdUnix": "1334879851",
  "updatedUnix": "1334880078",
  "containsAdultContent": false,
  "uploadedBy": "zigurd88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54684",
      "name": "BrutalCombat1",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24",
      "fileName": "BrutalCombat1-15517-0-2.rar",
      "uploadedUnix": "1334880078",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/7d31a0c748356610fe66176d363ed2af06dfa9996bd1c0adef28c24df3d6dba1/analysis/1406824389/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BrutalCombat1-15517-0-2.rar?fid=54684&ttl=1535779998&ri=8192&rs=8192&setec=bc5ea3a44e61f8a30cec934a22238210"
    }
  ]
}