{
  "modId": 15515.0,
  "modName": "Shadow Play - Sneak and Stealth rebalance mod",
  "summary": "This mod makes sneaking MUCH harder and more fun by rebalancing NPC values, perks, skills and enchants. It fixes many vanilla bugs and perk conflicts. All is balanced around the Realistic Lighting mod to provide proper visuals for shadows and light - you see where you can hide !",
  "descriptionHtml": "[CENTER][SIZE=7][FONT=Impact][COLOR=#ff0000]Shadow Play[/COLOR][/FONT][/SIZE][/CENTER][CENTER][COLOR=#ff0000][B]v1.1[/B][/COLOR][/CENTER]\r\n\r\n[COLOR=#ffc000][SIZE=4]What does this mod do?[/SIZE][/COLOR]\r\nThis all-in-one mod is an approach to make stealth gameplay more tactial and harder. You will have to stay in shadows, avoid lights, sneak slowly and plan your moves. The challenge comes from staying undetected, not from having overkill damage. NPCs are pretty smart now and won\\'t react dumb like in Vanilla. To achieve that, I modified values, changed, added and exchanged obsolete perks, enchants and abilities while staying close to vanilla as possible. To make it even harder you can use my \\\"Torches For Skyrim\\\" mod, alerted NPCs use those things on alarms!\r\nAlso I fixed a TON of vanilla perk incompatibilities, so you won\\'t be undetectable anymore ! It is a real but fair challange now, don\\'t cry if you can\\'t do it ! \r\n\r\n[SIZE=3][COLOR=##FFFF00][B]All is balanced around the Realistic Lighting mod (default install) to provide proper visuals for light and shadow, so you know when you can hide and when not. Don\\'t forget to grab Realistic Lighting! There is a feature video of ShadowPlay, just click on the videos tab.[/COLOR][/B][/SIZE]\r\n\r\n[SIZE=4][COLOR=#ffc000]Features & basic knowledge:[/COLOR][/SIZE]\r\n-Muffle is your NO.1 stat, then comes Sneak. Stack those up as much as you can. There are balanced out jewelry, boots, gauntlets, helms and enchants to serve you\r\n-SHIFT SHIFT SHIFT sneak, don\\'t even try to run in stealth mode until you maxed your gear/perks/skills !!! Sneak-walk speed is increased, make use of it\r\n-Complete rebalance of everything needed to provide challenging sneaking. It\\'s much harder than my first beta release ! I hate casual difficulties !\r\n-All sneak important enchants are now precise. It tells you the percentage of muffle etc. - a good endgame value is 70%+ muffle, 60% sneak (perks + enchants)\r\n-The need to stack sneak enchants will make your character weaker, balancing out OP endgame in a passive way. No direct damage mods were applied\r\n-Lights are dangerous. Staying close to light sources will give you a hard time. Movement around lights increases enemy detection rate even more\r\n-Sneaking sound is MUCH more important. Light weight armor is best, heavy makes much more noise. Use SHIFT-sneaking \r\n-Combat sound is important. Daggers make nearly no noise, swords have a nice radius and 2H can be heard across a river ! You may want \\\"Extra Hotkeys\\\" mod for a quick dual-wield swap.\r\n-Alerted NPCs have increased detection rates and WILL find you in shadows if you don\\'t stop after 1-2 bow shots, kill fast or die/run. Searchtime and alarmed state increased a bit\r\n-NPCs in general have a much bigger interaction radius and perception skill, I warned you !\r\n-New perk \\\"Dark Eye\\\" to check your enemies armor+hp, it replaces the now obsolete \\\"Silence\\\". Use Dark Eye in rooms with multiple enemies to prevent frustrating moments when you hit something you can\\'t kill fast and everything gets alarmed\r\n-Cooldown added to Shadow Warrior perk to prevent abusing (30 sec)\r\n-Conditioned and Unhindered perks overhauled. Effects are same like before (speed+carryweight) but it won\\'t break armor based detection formulas\r\n-Automated script to repair your vanilla saves if you are not starting a new game, still a new game is recommended\r\n\r\n....that\\'s all you need to know for now, discover the rest - if you find problems, please report in comments. Just one thing, the best setup you can find:\r\n\r\nPerks: 25% Muffle and 40% Sneak\r\nBoots: 25% Muffle + 10% Sneak\r\nRings: 10% Muffle\r\nNecklace: 10% Muffle\r\nGauntlets: 15% Sneak\r\nHelmet: 10% Sneak (from uniques only, no disenchant)\r\n\r\nTOTAL: 70% Muffle + 75% Sneak\r\nYou can use Muffle Spells for additional +15%\r\n\r\n\r\n[SIZE=4][COLOR=#ffc000]Installation, take your time - this is needed if you have tons of mods:[/COLOR][/SIZE]\r\nIf you don\\'t use many mods: \r\n-Install Realistic Lighting with default settings: http://skyrim.nexusmods.com/downloads/file.php?id=7654\r\n-Install this mod with Nexus Mod Manager\r\n-If you like your sneaking even harder, install my second mod: http://skyrim.nexusmods.com/downloads/file.php?id=15648 AND USE the install method below !\r\n\r\nIf you use many mods, this is THE ONLY WAY to have a proper installation - thats NOT ONLY for this mod, it\\'s the proper way:\r\n-Download BOSS tools to optimize your load order on the fly http://skyrim.nexusmods.com/downloads/file.php?id=6\r\n-Copy the BOSS main folder to your Skyrim folder (...\\\\common\\\\Skyrim\\\\BOSS\\\\Boss.exe)\r\n-Download & Install Wrye Bash, tick Skyrim checkbox: http://skyrim.nexusmods.com/downloads/file.php?id=1840\r\n-Start Wrye Bash, on bottom left you have small icons - mouse over and find BOSS, then start BOSS\r\n-A HTML List pops up. In current Wrye Bash version you have to sort your Mods in Wrye Bash according to the BOSS html file\r\n-Red marked Wrye entries need a redate (same timestamps), rightclick the red stuff, file -> redate\r\n-When all is sorted and nothing red, rightclick somewhere in wrye bash. File -> New Bashed Patch\r\n-Rightclick Bashed Patch file and choose to rebuild. Just click create patch button\r\n-Check the bashed patch file and load last - DONE\r\n\r\n[SIZE=4][COLOR=#ffc000]Issues & why Vanilla fails:[/COLOR][/SIZE]\r\nSkyrim has a VERY dirty way to manage actor values and settings. And this was the NO.1 reason why I made this mod - others just changed things and never looked on synergy between values and perks. But I fixed everything now - and found workarounds to vanilla unlogics ! For example, when you skill Illusion the perk \\\"Kindred Mage\\\" will add massive values to your muffle spell and render your toon undetectable by sound. Same goes for armor perks Unhindered / Conditioned, they set armor weight to zero breaking armor-noise detection formulas. Or the silence perk itself, which added 100% silence so you never needed any muffle enchants or other perks....all this and much more is FIXED. No more heavy armor full-dmg enchant rampage - you will be happy if you can do it in light armor \r\n\r\nI spent days to discover how values are changed and as a result I made a small script which starts the first time you load this mod. \r\nThings which were unfixable are mentioned in a popup box when your game starts - only applies to old games, never mind for new games.\r\nBasically, all vanilla muffle / sneak enchanted items should be trashed and vanilla learned enchants avoided. They are 50% broken and 50% overpowered - couldn\\'t believe how Bethesda did their work! This script will full-auto reset all important values to vanilla, scan your perks, remove and readd perks you have to refresh things. If you load this mod last in your load order, there should be no problems.\r\n\r\nYour character will be naked after this script has run. To verify if all went fine do this in your console while naked:\r\nplayer.getav MovementNoiseMult\r\nIt should be 1.0 if you don\\'t have MuffledMovement perk, 0.75 if you do. Also check:\r\nplayer.getav sneakmod\r\nIt should be set to 0 when naked.\r\n\r\nIf you ever see MuffledMovement noise value below zero, something is broken. It\\'s balanced out so you can\\'t reach sneak-sound immunity ever and zero means immunity.\r\nOh, English is not my native language, so have mercy :>",
  "categoryId": "24",
  "version": "1.1",
  "author": "black",
  "createdUnix": "1334878736",
  "updatedUnix": "1337001806",
  "containsAdultContent": false,
  "uploadedBy": "Black-",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54784",
      "name": "ShadowPlay-v09",
      "version": "v0.9beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "ShadowPlay-v09-15515.zip",
      "uploadedUnix": "1334924884",
      "modVersion": "v0.9beta",
      "virusScanUrl": "https://www.virustotal.com/file/c562ef8e9be939d0caf3751f9e09510f3632d63194a1bd0d9bfc60350f118b78/analysis/1406825042/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ShadowPlay-v09-15515.zip?fid=54784&ttl=1535779994&ri=8192&rs=8192&setec=7f0873da2b5d8ad01fe6dcbae175a541"
    },
    {
      "fileId": "54803",
      "name": "ShadowPlay-v091",
      "version": "0.91beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "ShadowPlay-v091-15515.zip",
      "uploadedUnix": "1334932589",
      "modVersion": "0.91beta",
      "virusScanUrl": "https://www.virustotal.com/file/e971bdb0df0f47df4b7951e2f3bdd7c53f99b6bd3f15290d62e30378c9e5bc26/analysis/1406825115/",
      "changelogHtml": " -updated Muffled Movement description to match the effect <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ShadowPlay-v091-15515.zip?fid=54803&ttl=1535779995&ri=8192&rs=8192&setec=223933cee951a63d3dbb4aafbd788787"
    },
    {
      "fileId": "61264",
      "name": "Shadow Play",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "Shadow Play-15515-1-1.rar",
      "uploadedUnix": "1337001806",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2f44806c01188b74cb56e9ee42149eb74361d2fe10f02e256bbac4bee5fb27a0/analysis/1406891922/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shadow%20Play-15515-1-1.rar?fid=61264&ttl=1535779995&ri=8192&rs=8192&setec=2cde9ade29ef72c7d3cf69333a8fa0be"
    }
  ]
}