{
  "modId": 15525.0,
  "modName": "Secret prayers",
  "summary": "A helpless Nord named Grimnir and his family were arbitrary attacked by the Thalmor because of the accusations that they secretly worshipped Talos. Can you help him get his revenge on the Elves?",
  "descriptionHtml": "\\\"Secret prayers\\\" - A quest by ToS-Master\r\n\r\n== Introduction to the plot ==\r\nA helpless Nord named Grimnir and his family were arbitrary attacked by the Thalmor because of the accusations that they secretly worshipped Talos. Can you help him get his revenge on the Elves?\r\nThis quest offers you:\r\n-three alternate endings\r\n-two new interiors\r\n-a follower and loot as reward\r\n\r\nThe quest is located southeast of Dragon Bridge. Follow the river and you can\\'t miss the house. See the screenshot-map for details.\r\n\r\n== Personal statement ==\r\nDue to my passion of creating quests for Oblivion I wanted to use my experience and bring it to the next level. This is my first quest for Skyrim. It began as a test, to see what has changed in the Creation Kit compared with the Construction Set and I think it worked out very well (as you can see in the screen shots).\r\nOf course the quest contains dialouge. But since I am too shy to speak I recorded for every line 15 seconds of beautyfull silence ;)\r\n\r\nI would also like to thank my beta-testers Mormegil & SilverReaver, for wasting their time for my annoying skype calls ;)\r\n\r\n== Alternate downloads ==\r\nI started with creating a German version of the mod, but due to the fact that the skyrim nexus is global, I translated the mod into English. The German version still exists and is finished (it would be a waste not to upload it). BUT, if you use the nexus to download the \\\"Main file\\\", you\\'ll get the English version.\r\nNote that there will neither be any support nor updates for the German version. The German version equals Version 1.0 of this mod.\r\nDownload the Germen version here: http://depositfiles.com/files/w440cvnid\r\n\r\nThis file is also available in the Steam workshop: http://steamcommunity.com/sharedfiles/filedetails/?id=1059129\r\n\r\n== FAQ ==\r\nQ: How do I install this mod\r\nYou install this mod like any other mod. Click on the green \\\"subscribe\\\" button. Next time you start skyrim the launcher will automatic download and update this mod.\r\nQ: How do I uninstall this mod\r\nSince this mod doesn\\'t affect any important laws of skyrim, just unsubscribe and delete the mod file from your folder.\r\nQ: Since the last update the mod doesn\\'t work anymore.\r\nReinstall the mod. If that doesn\\'t work try loading a savegame that you\\'ve created before you installed the mod.\r\nQ: If I choose a topic wile talkting, there will be about 10 seconds of nothing, and after that the dialouge continues.\r\nAt the current version there is no voice recorded. Change settings, so subtitles are enabled. Try talking again, you should be able to read the text now.\r\n\r\n== Changelog ==\r\nV1.0\r\nCreated the quest",
  "categoryId": "35",
  "version": "1.0",
  "author": "ToS-Master",
  "createdUnix": "1334905504",
  "updatedUnix": "1334905906",
  "containsAdultContent": false,
  "uploadedBy": "ToSMaster",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54734",
      "name": "Data files for the quest",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4434",
      "fileName": "Data files for the quest-15525-1-0.rar",
      "uploadedUnix": "1334905906",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ca16612ad077ff08cafc9814416cc86648a97fae07447c02fa0e904c28e71751/analysis/1406824830/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Data%20files%20for%20the%20quest-15525-1-0.rar?fid=54734&ttl=1535780019&ri=8192&rs=8192&setec=b133df9ebba1c1f9c1f5db9138a644b2"
    }
  ]
}