{
  "modId": 15576.0,
  "modName": "Wood Elf Archer Conjurer Pixie Windcaller",
  "summary": "Petite Wood Elf Companion Pixie Windcaller",
  "descriptionHtml": "Requested by   :::kalinowski:::\r\n\r\nAptly named for her small size; Pixie was always the child that was underestimated and often overlooked due to her small stature. It\\'s also why she exerted more effort and dedication into mastering her crafts and why she\\'s more than capable at what she does. She might be a small woman with a small bow, but rest assured that her arrows sting all the same.\r\n\r\nShe has perks and skills developed towards archery and summoning, light armor, heavy armor (though light armor is her best of the two), sneaking, and stealth.\r\n\r\nShe has the ability to summon elemental-based minions, but will most often play preference to archery (as requested). \r\n\r\nShe can be married, and you can find her taking a break at The Riverwood Trader in Riverwood.\r\n\r\nAs per the request of the person this mod was made for; Pixie will appear nude when you first meet her. This was done so that she will wear any clothing as well as any armor you give to her. If she appear to be normal height, talking to her and having her join you should cause her to resize to the proper height.\r\n\r\nShe will also auto level from level 8 to level 80. She comes with an Elven bow and matching arrows just in case you adopt her at a low level and don\\'t quite have the resources to provide her with a decent weapon yet. \r\n\r\nLike all of my other companion mods; Pixie will loiter around in the area that you dismiss her once you tell her you want to part ways (drop her as a companion). So if you can\\'t find her after you ask her to leave your service make sure to go back to where you left her. I set her AI up this way so that you can leave her in a convenient place and she won\\'t wonder off (you can also have her stay behind in one of your houses until you want her to tag along with you again). Remember that ALL of my companion mods have this feature.\r\n\r\nIMPORTANT NOTE: This mod must have the following mod in order to work correctly:\r\n\r\n:::Apachii Sky Hair:::\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10168\r\n\r\nIf you have issues with hair colors turning dark when near light sources; download teh vanilla hair option on Apachii\\'s page and that should fix the issue.\r\n\r\nManual Installation:\r\nPlace the zip file\\'s contents into your Skyrim/data folder to install and be sure to activate the ESP and ESM files in your Data Files listing. Ensure that the Apachii Sky Hair ESP and ESM are ABOVE Pixie\\'s data files in your load order (I\\'d recommend placing Sako\\'s files dead last in the load order so there are no conflicts).\r\n\r\nRecommended (but not required) mods to get her as she appears in the screen shots:\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nFeatured outfit mod: \r\nRemodeled Armor CBBEv3 (Leather Bikini from this mod is shown)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=13004#\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nCBBE V3 (standard body) and the hip texture compatability pack:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2666\r\n\r\nBella\\'s Better Females version 3:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2812\r\n\r\nCover Eyes (eyes 1 file):\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4869\r\n\r\n\r\nSpecial thanks to Blackie for his CM New Companions mod that includes a top-notch detailed tutorial on how to create Skyrim companions without the face discoloration bug. Get his mod and tutorial (contained in the mod) here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11669\r\n\r\nThe work around I found for the bug with Bella\\'s face mod (the bug involving women looking like they have faint beard stubble on their jawline and chin) is to use the standard Better Faces Version 3, and then apply the \\\"No Shine\\\" option available on her mod page.\r\n\r\nSpecial note: All of my future companions after Divada, Taja, Viin, and Kyia will be made using the Better Females by Bella mod. I switched to another mod set for faces previously due to a bug I couldn\\'t resolve (the issue with females having faint male beard stubble on their faces while using Bella\\'s). I have resolved that issue, so I\\'ll be going back to Bella\\'s for my projects from now on. You DO NOT have to switch to Bella\\'s if you use Envision faces and RANs Headmesh (what I used previously) OR if you use other face mods. All of my companions should work with other face/body mods and vanilla setups unless specifically mentioned in the description.\r\n\r\nThanks for stopping by, and I hope you enjoy taking Pixie with you on your adventures.\r\n\r\nI recommend a manual install of this mod (read me included in the zip file). Install with Nexus Mod Manager at your own risk.\r\n\r\nThe ENB I use (which is why there\\'s a difference in screen shots as opposed to previous companion releases) is Cinematic Lighting ENB which you can check out here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4142\r\n\r\nRemember to endorse files from the Nexus if you like them...it\\'s a small notion of thanks that all modders appreciate. Thanks for taking the time to look over my mods and I hope you enjoy them.\r\n\r\nNote to other modders: Feel free to use any of my companions to compliment/show off your mods if you like my work. If you have custom armor or weapons, feel free to use any of my companions to model them for you. I\\'m a firm believer that modders working together equals more mods for all of us to enjoy.",
  "categoryId": "66",
  "version": "1",
  "author": "Grimraven1",
  "createdUnix": "1334956868",
  "updatedUnix": "1334956944",
  "containsAdultContent": false,
  "uploadedBy": "Grimraven1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54906",
      "name": "Pixie Windcaller",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "546",
      "fileName": "Pixie Windcaller-15576-1.rar",
      "uploadedUnix": "1334956944",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/53ba84f0e634f04d26e22f7349d3d533299cbb00e246b9902fda82e3ec78cbc9/analysis/1406825781/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pixie%20Windcaller-15576-1.rar?fid=54906&ttl=1535780107&ri=8192&rs=8192&setec=42442fcfb457de4d8b9ec9d208ac9c96"
    }
  ]
}