{
  "modId": 15587.0,
  "modName": "Evolving Followers _ Uthgerd the Unbroken Daedric Manbreaker",
  "summary": "This mod edits and upgrades the follower Uthgerd the Unbroken with an amazing new evolving effect. Not only will she gain new abilities but her look will also change to match.  See has she goes from simple nord warrior to Daedric empowered juggernaut.",
  "descriptionHtml": "[IMG]http://fc02.deviantart.net/fs70/f/2012/111/9/f/uthgerd_banner_alpha_lowrez_by_lurkergg-d4x4phc.png[/IMG]\r<br />\r<br />Updates&#33; 1/31/2014\r<br />\r<br />Wow, almost 2 years since I originally uploaded this mod and I finally get around to updating it. I want to thank everyone who has been using this mod and for all the support I have gotten from it. \r<br />\r<br />Over the years I kept getting messages from fans wondering when I would update and questions about the mode. \r<br />\r<br />I just uploaded a bug fix and slight alteration update. Here is what is different in version 1.1\r<br />\r<br />1. Bug fixes( No more crashing when you attempt to change your race, you should now be able to recruit Uthgerd at early and later levels and fixed size issues that show up if you remove the mod.)\r<br />\r<br />2. Rebalanced Uthgerd and reworked how she levels with the player. She no longer has the fire Aura (that was causing fist fight issues), she gains heavy armor and two handed weapon bonuses as she levels and she know carries around a copy of the Summon manbreaker spell for the player to learn.\r<br />\r<br />3. Added a glowing eye effect for her later forms (Credit goes to Dumle35 http://www.nexusmods.com/skyrim/mods/21232/? for the glowing eye textures.\r<br />\r<br />4. Changed her ingame name from unbroken to manbreaker.\r<br />\r<br />5. Added some face gen files in hopes of fixing the greyface issue. Please be aware that this is still very hit and miss due to the nature of the race changing she does and the mods you may have installed.\r<br />\r<br />Mod Decription\r<br />\r<br />This mod edits and upgrades the follower Uthgerd the Unbroken with an amazing new evolving effect. She is now Uthgerd the Manbreaker. Not only will she gain new abilities but her look will also change to match.  See has she goes from simple nord warrior to Daedric empowered juggernaut.\r<br />\r<br />\r<br />Exact list of what this mod does\r<br />\r<br />- Changes the way Uthgerd looks at all levels. She initially will look younger then the default game look but depending on your level she will also start to grow horns and grow taller.\r<br />\r<br />- Massive overal on her abilities, skills and Combat Style. \r<br />\tHer original form has her in a class that levels her one handed weapon and block skills while her combat style was that of a two-handed weapon bandit boss. I made a new class and combat style for her that fits her two-handed weapon aggressive battle demon theme. I changed her to be essential, so she will not die. That being said do not expect her to do all the work for you. She can do pretty dam awesome at higher levels, but she will need the gear to do it. The more you invest in her the better she will do, like any follower. At higher levels she even has a magic resistance to help her tank for reckless fireball throwing dragonborns.\r<br />\r<br />- Added passive abilities and summon spells for her to use. At later levels she will be able to summon special &#34;manbreaker&#34; dremoras. These demons last two minutes and have the same stats as the normal summoned Dremora.\r<br />\r<br />Things that may be added in the future.\r<br />\r<br />- New weapon just for her\r<br />\r<br />- Lore friendly Version and Barbarian versions planned for release. \r<br />\r<br />- Other changes depending on feedback \r<br />\r<br />\r<br />Reuirements: (YOU MUST HAVE THESE MODS)\r<br />\r<br />Calientes Female Body Mod Big Bottom Edition -CBBE- by Caliente http://skyrim.nexusmods.com/downloads/file.php?id=2666\r<br />\r<br />\r<br />ApachiiSkyHair by Apachii http://skyrim.nexusmods.com/downloads/file.php?id=10168\r<br />\r<br />\r<br />Quick F.A.Q\r<br />\r<br />&#34;She doesn&#39;t have a HEAD&#33;&#33;&#33;?&#34;\r<br />If you can still see her teeth, then simple leave or enter a building. Making sure where ever you end up has enough room for her transformation effect. She should have a head after that. If it continues try the console command &#34;setnpcweight 100&#34; and make sure you click her in the console command mode before using the command.\r<br />\r<br />&#34;She is bald.&#34;\r<br />You do not have Apachiiskyhair installed correctly or at all then. \r<br />\r<br />&#34;My Game crashes&#34; or &#34;She doesn&#39;t have a body&#33;&#34;\r<br />Same as above, you do not have Calientes Female Body Mod Big Bottom Edition -CBBE- installed correctly or at all. \r<br />\r<br />&#34;So, whats with the name &#34;Manbreaker&#34;?&#34;\r<br />Its a inside joke. Someone called her &#34;butterface&#34; when I mentioned I used her as a follower. One thing lead to another and the name just kind of stuck. May or may not stay in the future.\r<br />\r<br />&#34;She couldn&#39;t solo the dragon for me&#33;&#33; :( &#34;\r<br />Working as intended.\r<br />\r<br />&#34;Are you going to make my Fav follower . . . . mod soon?&#34;\r<br />No idea what follower I might change or make next.\r<br />\r<br />&#34;Who did that Awesome artwork?&#34; \r<br />I did, I draw under the same name &#34;LurkerGG&#34;. If you do seek me out on the web BE WARNED, WHAT HAS BEEN SEEN CAN NOT BE UNSEEN&#33;&#33;&#33; (I draw NSFW stuff)\r<br />\r<br />Credits for models and skins used in the mode (I got permission to use all of them)\r<br />\r<br />MaikCG and laxi2610 for the daedric armor remodeling http://skyrim.nexusmods.com/downloads/file.php?id=6316 and http://skyrim.nexusmods.com/downloads/file.php?id=5162\r<br />\r<br />Fgem for the awesome female muscle texture http://skyrim.nexusmods.com/downloads/file.php?id=14460\r<br />\r<br />Dumle35 for the awesome glowing eye textures http://www.nexusmods.com/skyrim/mods/21232/?\r<br />\r<br />NPR for the awesome horn models http://www.process-productions.com/f...770#post645770\r<br />\r<br />\r<br />\r<br />Thanks go to \r<br />\r<br />Apachii for the hair style mod http://skyrim.nexusmods.com/downloads/file.php?id=10168\r<br />\r<br />Caliente for their awesome mod Calientes Female Body Mod Big Bottom Edition -CBBE- http://skyrim.nexusmods.com/downloads/file.php?id=2666\r<br />\r<br />foretrenty for making a fast and easy way to make bsa files with his NPC editor http://skyrim.nexusmods.com/downloads/file.php?id=4554\r<br />\r<br />",
  "categoryId": "66",
  "version": "1.1",
  "author": "LurkerGG",
  "createdUnix": "1334972469",
  "updatedUnix": "1391220042",
  "containsAdultContent": true,
  "uploadedBy": "LurkerGG",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54946",
      "name": "Manbreakerv1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13475",
      "fileName": "Manbreakerv1-15587-1-0.zip",
      "uploadedUnix": "1334972710",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ddd9db49c347222e9ca4b134a24121981437fb96e3a260880950a13c8ed52cc9/analysis/1406826029/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Manbreakerv1-15587-1-0.zip?fid=54946&ttl=1535780120&ri=8192&rs=8192&setec=23a48ebd0dcd08534a22d15cbce80138"
    },
    {
      "fileId": "1000094522",
      "name": "ManbreakerV1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24051",
      "fileName": "ManbreakerV1_1-15587-1-1.zip",
      "uploadedUnix": "1391220042",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5d9e8e500b72a52ecc17970e22cb17859271320becc190bbb40be5ca25cf9448/analysis/1407911720/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ManbreakerV1_1-15587-1-1.zip?fid=1000094522&ttl=1535780120&ri=8192&rs=8192&setec=b4bdee52b21d6fb08a3079c964544f76"
    }
  ]
}