{
  "modId": 15583.0,
  "modName": "Einithars Lantern",
  "summary": "Looking for a refillable Oil Lantern? \r\n\r\nYou just found it.",
  "descriptionHtml": "                                  [IMG]http://i.imgur.com/o5Hid.png[/IMG]\r\n\r\nHead to Calcelmo in Understone Keep, Markarth. He has just received a shipping container from an old friend in High Rock via the East Empire Company. It contains something you might be interested in....\r\n\r\n\r\nThis Mod adds an oil burning lantern into your game with a small backstory on how it came to exist, but you will probably have to craft it...\r\n\r\n\r\nit also adds a new type of torch, a \\\"used torch\\\" which can be soaked in oil to use in an emergency if you lose your lantern!\r\n(I hear Belethor has been stocking up on them...)\r\n\r\n\r\nThe lantern has a long but finite fuel range and will run out after a given time, meaning you have to refil it with lantern oil!\r\n\r\n\r\n\r\n....Lantern oil?\r\n\r\n\r\nThere is a journal in Calcelmo\\'s recent package, have a flick through it to understand a little more :)\r\n\r\n\r\n\r\nyou should only ever need one lantern, so there is no need to have multiple lanterns in your inventory, just oil. \r\n\r\nfuture updates will include new animations for holding / sheathing the lantern and some texture work on the old lanterns. they are using the vanilla textures for now. \r\n\r\nthere may also be an update adding the ability to break a lantern making it unusable. (purely for the immersion nuts)\r\n\r\n\r\ntime to go crawling through those dwarven dungeouns with a bit of troll hunting on the way home!\r\n\r\n\r\n\r\nNOTE: This mod has the most effect when using any \\\"darker nights\\\" mod. There are a few to choose from, i use realistic lighting but other choices are out there. Any of them should be fine!\r\n\r\n\r\n\r\nHUGE thanks to: \r\n\r\nseventyfour over at the BethSoft Forums, for lending his Talos like papyrus powers to this project.\r\n\r\nGunner6999 for assistance in bug fixing and scripting assistance.\r\n\r\nsupernastypants for beta testing, and for making the video for this mod!\r\n\r\nVvardenFellow for beta testing and teaching me the wonders of Photoshop. Alpha channels be damned!\r\n\r\nmannygt for designing the new cover picture. kudos.\r\n\r\ndj2005 for helping to find the bug.\r\n\r\nAnybody who deserves credit that has been forgotten.\r\n\r\nand of course Bethesda for fuelling my modding addictions since 2005. \r\n\r\n\r\n[b]CHANGELOG:\r\n\r\nUpdate 1.0a; - Bug fix for Lantern oil / Spelling correction in Journal/Guide.[/b]\r\n\r\n\r\nPERMISSIONS:\r\n\r\nScripts, i feel should be shared for others to learn from. Do with them as you will. \r\n\r\nMeshes and textures however CANNOT be used in any other mod unless i give you explicit permission, regardless of how long it takes. If you don\\'t hear from me, you can\\'t use them.\r\n\r\n[IMG]http://i.imgur.com/SjPWn.jpg[/IMG]\r\n ",
  "categoryId": "27",
  "version": "1.0a",
  "author": "born2bkilled",
  "createdUnix": "1334971786",
  "updatedUnix": "1335737432",
  "containsAdultContent": false,
  "uploadedBy": "born2bkilled",
  "primaryFile": null,
  "files": [
    {
      "fileId": "57426",
      "name": "Update Alpha",
      "version": "1.0a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4880",
      "fileName": "Update Alpha-15583-1-0a.zip",
      "uploadedUnix": "1335737432",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/7e5b49560ab02f21eb57a2be994e9b429d602baaf7c1b05d4b640dfce7bbcec8/analysis/1406854927/",
      "changelogHtml": " Fixed bug with Lantern Oil <br/> \n Spelling correction in Einithars Journal / Guide. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Update%20Alpha-15583-1-0a.zip?fid=57426&ttl=1535780115&ri=8192&rs=8192&setec=ea5e018dd7d0d4bbfb65a7ab84d2844a"
    }
  ]
}