{
  "modId": 15590.0,
  "modName": "Imani Suda -Redguard Follower- Sister to Saadia NSFW",
  "summary": "Imani is for all intents and purposes a standalone version of my Saddia mod. She is the twin sister to Saadia (Iman) and is such in her relationship settings. I have kept her identical to my Saadia except for her weight, makeup, eyebrows and hair color. She possesses the same combat statistics as my original Saadia with a few more perks.  She can b",
  "descriptionHtml": "Imani is for all intents and purposes a standalone version of my Saddia mod. She is the twin sister to Saadia (Who was originally Iman of the House of Suda per game lore) and is such in her relationship settings. I have kept her identical to my Saadia except for her weight, makeup, eyebrows and hair color. She possesses the same combat statistics as my original Saadia with a few more perks added. She can be located in Dragon Bridge at the Four Shields Tavern. \r\n\r\nShe will be nude when you find her (as usual). \r\nShe is the same height as Saadia only a bit slimmer. \r\nShe has loose pocket items and a steel dagger in her inventory. \r\nShe is non-essential and calculated to level 40, she should auto level with the player from that point forward.  \r\n\r\nPlease let me know what you think in the comments section, this is my second standalone but so far so good, she does what I have set her up to do. :)",
  "categoryId": "66",
  "version": "1.0",
  "author": "FalmerBane",
  "createdUnix": "1334976952",
  "updatedUnix": "1334978589",
  "containsAdultContent": true,
  "uploadedBy": "FalmerBane",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54967",
      "name": "Imani Suda",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1131",
      "fileName": "Imani Suda-15590.7z",
      "uploadedUnix": "1334978589",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5ff678cdb98b3fb7ffd323b54e50df424be7f6eb4ee81b997e2faacdac830e73/analysis/1406826131/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imani%20Suda-15590.7z?fid=54967&ttl=1535780124&ri=8192&rs=8192&setec=89a5194d15f991e313d17d6df3b8df2e"
    }
  ]
}