{
  "modId": 15596.0,
  "modName": "Forsworn Retex Compilation",
  "summary": "Compilation of my own personal retextures for the female forsworn outfit. There are currently 5, Wolf, Tigress, Snow Tigress, Snow Leopard, and Cow, but I will most likely be adding more.",
  "descriptionHtml": "This is a Compilation of my own personal retextures for the female forsworn outfit. There are currently 5, Wolf, Tigress, Snow Tigress, Snow Leopard, and Cow, but I will most likely be adding more including but not limited to...\r\n\r\nLeopard\r\nLion\r\nWhite Lion\r\nBear (Cave, Mountain, Snow)\r\nFox\r\nGoat\r\n\r\nOnce again, I did not alter the helmet for the outfit, because I believe that you could get a much better selection from [url=http://skyrim.nexusmods.com/downloads/file.php?id=5865]83Willow\\'s mod[/url].\r\n\r\nIf you have any other suggestions feel free to put them down in the comments. Btw, I will not be doing any topless options, open an image editor and do it yourself please. I will do slightly skimpier options if they are wanted enough, but for now, this is what you get.\r\n\r\nAlso, I do not have the know how, time, or will to make these non-replacers and/or individual outfits, if anyone would be kind enough to do it feel free, just please respect the work I put into doing these by not reuploading the texture files anywhere.\r\n\r\nOne more thing, just for anyone that wants to know, I AM using CBBE armor meshes, but this will not affect the overall appearance of the texture on other armor meshes/bodies.",
  "categoryId": "54",
  "version": "1",
  "author": "Tier1Dusty",
  "createdUnix": "1334986415",
  "updatedUnix": "1334987249",
  "containsAdultContent": false,
  "uploadedBy": "Tier1Dusty",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54993",
      "name": "Forsworn Compilation",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13417",
      "fileName": "Forsworn Compilation-15596-1.zip",
      "uploadedUnix": "1334987249",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/5127e2ccbb7febc4602040ca28f424a1cb85da2266d7de06f5b55092d4165a18/analysis/1406826207/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forsworn%20Compilation-15596-1.zip?fid=54993&ttl=1535780138&ri=8192&rs=8192&setec=c90a5eddb3ebced01fcc850fdb4dd17a"
    }
  ]
}