{
  "modId": 15592.0,
  "modName": "Skyrim 40000 - Chaos armor",
  "summary": "40k in Skyrim - Chaos Marine Armor (WIP) \r<br />\r<br />8 sets of non-replacing Chaos Marine armor from the Warhammer 40,000 system. \r<br />Armor pieces grant power armor bonuses, but can still be enchanted by the player ",
  "descriptionHtml": "40k in Skyrim - Chaos Marine Armor (WIP) \r<br />\r<br />8 sets of non-replacing Chaos Marine armor from the Warhammer 40,000 system. \r<br />Armor pieces grant power armor bonuses, but can still be enchanted by the player \r<br />\r<br />Expanded details available - http://skyrim-40000.wikispaces.com/Skyrim+40000\r<br />\r<br />Chaos has sent the Khorne Berserkers (World Eaters), Emperor&#39;s Children, Iron Warriors, Death Guard. Black Legion, Night Lords, Thousand Sons, & Word Bearers to claim this world.\r<br />\r<br />(Why are some more detailed? Because reschu0 has been hard at work creating vastly improved, high-detail textures - and is responsible for the awesome new look of the Khorne Berserkers, as well as the Iron Warriors and the Emperor&#39;s Children&#33; More will be updated in time.)\r<br />\r<br />Forgable (under Misc), and temperable, even when enchanted\r<br />Enchantments removed to allow player enchanting. - However each armor piece grants an appropriate ability to represent powered armor (via script)\r<br />Works for males and females of all races (though Argonians and Khajiit still have a protruding tail.)\r<br />Armors require no perks, and only gold to forge/improve during testing.\r<br />Stats and abilities are strong, appropriate - but OP. Balancing forthcoming and ongoing.\r<br />\r<br />-------------------------------------\r<br />Main Mod - http://skyrim.nexusmods.com/downloads/file.php?id=13506\r<br />-------------------------------------\r<br />The Weapons Pack - http://skyrim.nexusmods.com/downloads/file.php?id=14727\r<br />-------------------------------------\r<br />\r<br />% Known issues: \r<br />Modeling errors (armors disappear if dropped, gauntles do not display in inventory unless spun, Armor shows over text) Nothing that hampers 1st or 3rd person use, however it will be corrected. \r<br />\r<br />***********************************************************************************\r<br />I did not create these meshes or textures, I have only compiled and further edited them with permission from the creators. These files were created for New Vegas by akindain, and modified for Skyrim by zhaihouxi, both from the Nexus. A special thanks to akindain for not only creating these assets, but for generously releasing them as a modder&#39;s resource - This mod would not be possible without him&#33;\r<br />\r<br />reschu0 has been hard at work creating vastly improved, high-detail textures - and is responsible for the awesome new look of the Khorne Berserkers, as well as the Iron Warriors and the Emperor&#39;s Children&#33;\r<br />\r<br />My sincere gratitude to Bethesda for Skyrim, the Creation Kit, and Elder Scrolls - To Games-Workshop for my nearly life-long addiction to Warhammer 40,000 and To Valve, for Steam and the Steam Workshop, which got me into this. This is a mod for a retail game, made from assets I do not own, as all mods are. This is a free, publicly available mod, and will never be sold or profited from. I intend no infringement upon the rights of the companies who&#39;s assets are used here, and will of course comply with their wishes.\r<br />***********************************************************************************\r<br />\r<br />Scripters rejoice&#33; - A new set of training videos has been made by richardbmiller2 that finally gives comprehensive details on Object-Oriented Papyrus scripting - this is paid-training level information, and I am learning a LOT :)\r<br />http://www.youtube.com/richardbmiller2\r<br />\r<br />Want to learn to model? A very helpful start-to-finish series is available from ghosu\r<br />(German and English versions available)\r<br />http://www.youtube.com/user/LeckerHamster\r<br />\r<br />This web site is completely unofficial and in no way endorsed by Games Workshop Limited and all associated marks, names, races, race insignia, characters, vehicles, locations, units, illustrations and images from the Warhammer 40,000 universe are either ®, TM and/or © Copyright Games Workshop Ltd 2000-2012, variably registered in the UK and other countries around the world. Used without permission. No challenge to their status intended. All Rights Reserved to their respective owners. (&lt;- Official required disclaimer wording for completely UNOFFICIAL mod use)",
  "categoryId": "54",
  "version": "1",
  "author": "TheycallmeQ",
  "createdUnix": "1334978729",
  "updatedUnix": "1334978939",
  "containsAdultContent": false,
  "uploadedBy": "BlueFreakQ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "54969",
      "name": "Skyrim 40000 Chaos armor",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29991",
      "fileName": "Skyrim 40000 Chaos armor-15592-1.rar",
      "uploadedUnix": "1334978939",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/8b8ac62a74f52d6445cc4e1a63299748fcc5c4ce8471be2ef6091cfca06962f5/analysis/1406826158/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%2040000%20Chaos%20armor-15592-1.rar?fid=54969&ttl=1535780127&ri=8192&rs=8192&setec=64c12b8c2944e8c6d5c74eb5fc56954a"
    }
  ]
}