{
  "modId": 15603.0,
  "modName": "Klimmek the Small Time Trader of Ivarstead",
  "summary": "Simply allows Klimmek to trade in miscellaneous items. ",
  "descriptionHtml": "Description:\r\nI made this for myself because I felt that Ivarstead needed someone who dabbles in trade but I like to upload what I make just in case someone else might find it useful. Klimmek seemed to me to be the perfect candidate since he talks of bringing supplies to the monks and is the only person in the town that really doesn\\'t seem to have a purpose or role in the community. \r\n\r\nIvarstead is a very small and secluded town, so his funds are minimal and so is his merchandise. But any pilgrim or wanderer called to climb the 7000 steps should find some of what he carries useful and might be grateful to be able to sell atleast some of the loot from the various dungeons and wild-life found in the area without having to travel to Riften or Whiterun first. You will find that he has a modest selection of potions, armor, and weapons. Mostly things that would be useful to a typical hunter. He also has a small selection of various other things such as precious gems and raw minerals as well as animal skins that he likely found in the mountain streams and from the local wild life nearby. \r\n\r\nInstallation:\r\nVery simple. It\\'s just an esp so extract into your skyrim data folder and activate. \r\n",
  "categoryId": "69",
  "version": "",
  "author": "stars2heaven",
  "createdUnix": "1334994567",
  "updatedUnix": "1334994697",
  "containsAdultContent": false,
  "uploadedBy": "stars2heaven",
  "primaryFile": null,
  "files": [
    {
      "fileId": "55013",
      "name": "Klimmek the Small Time Trader of Ivarstead",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Klimmek the Small Time Trader of Ivarstead-15603.zip",
      "uploadedUnix": "1334994697",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0ef4649012808d21818877d07acff4889807f5c79ffde8ccb7c7af363b64cfc5/analysis/1406826320/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Klimmek%20the%20Small%20Time%20Trader%20of%20Ivarstead-15603.zip?fid=55013&ttl=1535780151&ri=8192&rs=8192&setec=6fcbd71a28651ccb73c6938170e02268"
    }
  ]
}