{
  "modId": 15600.0,
  "modName": "Breton Bosmer Half-Elf",
  "summary": "Small simple race mod. Body mod, vampire, and werewolf compatible.",
  "descriptionHtml": "Update\r\n\r\nSince I recently got everything up again, I decided to make a simple update to the mod, or more specifically the Race Compatibility mod that comes packed with it. I updated the package to include [url=http://skyrim.nexusmods.com/mods/24898]this version[/url] of the mod to make it more compatible with, not just Dawngaurd, but many player made mods as well. If you have the Unofficial Patch it will detect it automatically and install an additional patch to further increase compatibility. If there are any issues, let me know, I only did a small test to make sure it worked, so leave a comment with any issues. \r\n\r\n\r\nThis is what you think it is, a mix race mod like any other, but between Breton and Bosmer. I found this combination the most visually appealing, and honestly is a little interesting none the less. It is very stable with no known glitches, and you have the perk of being able to use the eyes of either Man races or Bosmer (but restricted to Bosmer hair as other hairs don\\'t fit the skull). Feel free to make up any story you want as to how your own half-elf came to be. Bretons are Altmer but mostly Nede (at least half), so where Bretons are more Man then Mer, this makes them more Mer then Man.  As you may expect their skills are a mix between the two races, making them effective at either magic or stealth. I think I chose the best of each race and their stats are as follows:\r\n\r\nArchery - 10\r\nSneak - 5\r\nRestoration - 5\r\nLight Armor - 5\r\nAlchemy - 5\r\nAlteration - 5\r\n\r\nThey have a natural resistance to magic by 15%, poison by 25%, and disease by 25%.\r\nTheir racial power is Hidden Magicka, which once per day refills your magicka by half of it\\'s base value (it doesn\\'t count enchantment bonus for example). I\\'m hoping this isn\\'t too much early on, but later on it may simply not be enough once you use more enchantments. Kind of fits in with a lot of racial powers in that respect....\r\n\r\nThis mod only uses in game graphic resources so all body mods including textures are compatible. In fact I recommend [url=http://skyrim.nexusmods.com/downloads/file.php?id=2332]Younger Characters[/url] for a close to vanilla feel but make people look their age (including you). You can also use [url=http://skyrim.nexusmods.com/downloads/file.php?id=6709]UNP[/url], or any other body mod. Hair mods should also work thanks to the mod bellow. Note that the screenshots were not taken with any graphics mod, except the official highres pack. \r\n\r\nThis mod comes with [url=http://skyrim.nexusmods.com/downloads/file.php?id=10165]this mod[/url] or else it simply won\\'t work. It\\'s a universal mod many race mods use to allow werewolf and vampire scripts to function properly for custom races and allow other custom races to work along side each other. I myself have three custom races that depend on the mod running peacefully along side each other, and so will any custom race built around it. \r\n\r\nThis mod comes with 10 presets for male and females each (like vanilla races) but they\\'re mostly just there, a lot of them won\\'t fit a lot of peoples tastes as they aren\\'t overly done and I\\'m guessing most of you would rather make their own face. While I made most of them my friend Somotonai created almost all of the female presets, so if you like them thank him, if not it\\'s his fault. They look better with the mod I linked above. ",
  "categoryId": "34",
  "version": "1.1",
  "author": "Searyan",
  "createdUnix": "1334991216",
  "updatedUnix": "1360831571",
  "containsAdultContent": false,
  "uploadedBy": "Sean_s",
  "primaryFile": null,
  "files": [
    {
      "fileId": "55004",
      "name": "Half-Elf 1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73",
      "fileName": "Half-Elf-15600-1-0.zip",
      "uploadedUnix": "1334991302",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/509a3532bab16a0f2c3d1ae0c2cf917cb2a57e76c84c83061d54cda47b4b6aa1/analysis/1406826307/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Half-Elf-15600-1-0.zip?fid=55004&ttl=1535780144&ri=8192&rs=8192&setec=7a07c08a3b6fabc5567cb694750cc332"
    },
    {
      "fileId": "1000009724",
      "name": "Half-Elf 1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "63",
      "fileName": "Half-Elf 1-1-15600-1-1.zip",
      "uploadedUnix": "1360831571",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c02e8b3b993ac87e36ace57cb84301b270916ded5ec06120fb01cc747302caa2/analysis/1407416751/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Half-Elf%201-1-15600-1-1.zip?fid=1000009724&ttl=1535780144&ri=8192&rs=8192&setec=1da27ccaca18f30072be0c64d8d10df4"
    }
  ]
}