{
  "modId": 15629.0,
  "modName": "Imperial Followers by Jedo",
  "summary": "Adds a group of imperial followers to Skyrim",
  "descriptionHtml": "I made this mod for myself mostly and thought it may be useful to others, even though there are plenty of follower mods out there already. I couldn\\'t find one that did exactly this. Please note the current bugs in the bug section though.\r\n\r\n\t[size=18][center]IMPERIAL FOLLOWERS[/size]\r\nby Jedo[/center]\r\n\r\n=============================\r\nAnnouncements\r\n=============================\r\n\r\n*Hello all, just to let you know that I am not supporting this mod. I simply don\\'t have the time and I myself do not use these followers that much at the moment.\r\n\r\n\r\n*This mod hasn\\'t been taken care of  due to lack of time and there are still a few annoying bugs left. I will try and take care of it when I have the time. However as I am tied in other projects it will not be anytime soon\r\n\r\n*1.3 released, I added the rest of the horses and also a Roman-type standard to one of the followers. I hope that doesn\\'t offend the lore too much.\r\n[color=RED] [b]IMPORTANT[/b]: IF YOU ARE UPDATING FROM AN EARLIER VERSION[/color] there may be some naked guys in the camp. You need to either restart the mod (by disabling it and doing a clean save and then enabling it again) or, even simpler, just wait until the game resets the NPCs by opening the console with ` and typing \\\"set timescale to 1000000\\\" or something like that. Be careful with he amount of zeros. You should do this from inside somewhere.\r\n\r\nVersion 1.2 released. With people\\'s help I changed it so the horses of the followers do not leave.\r\n\r\nVersion 1.1 released. I tried navmeshing the camp and I think I had mixed success.\r\nAlso now the heavy armor soldiers will use the owned horses in the camp if you are using the Horses for Followers mod or another such follower horses mod\r\n\r\n=============================\r\nMods description and location \r\n=============================\r\n\r\nThis mod adds 16 Imperial soldiers-followers to a camp in Skyrim by means of a mini-quest, in an attempt to make the Imperial officer rank mean something. It\\'s sort of a personal bodyguard unit.\r\n\r\n[b]After you reach a certain point in the Civil War campaign (read: after \\\"False Front\\\" mission) there will be an Imperial messenger hanging out next to general Tullius at the Solitude castle and he will explain everything to you.[/b]\r\n\r\n\r\n[b][color=RED] The mod works on its own, but it is meant to be used as follows [/color]:\r\n1. Get yourself one of the mods that increase the minimum follower count (otherwise you will only be able to recruit one follower at a time) and that adds group dialogue options (or else you will go through hell trying to dismiss a large number of followers). I use this one: [url=http://skyrim.nexusmods.com/downloads/file.php?id=12933]http://skyrim.nexusmods.com/downloads/file.php?id=12933[/url]\r\n2. If/once you get the above Extensible Follower Framework mod, you may want to go to its in-game options and set the followers importance to \\\"Protected\\\" or \\\"Essential\\\" or their health won\\'t regenerate (...at all. Sorry, it\\'s a bug I have with EFF) \r\n3. If you want the followers to use the horses, get a mod that enables them to do so, such as this one: [url=http://skyrim.nexusmods.com/mods/11193]http://skyrim.nexusmods.com/mods/11193[/url] [/b] \r\n\r\n\r\nBY default, the soldiers are not essential and will die, but I did make them respawn because they tend to die a lot at the camp where they spawn due to Skyrim\\'s bugs and other mechanics. I wanted to make them unique little pals so you would care about losing them, but I guess you can\\'t have everything.\r\n\r\nHalf of the followers are lightly armored archers and the rest are heavily armored one-handed melee. All of them should be leveled to the player.\r\n\r\nWhen dismissed, the followers return to the camp you first find them at and resume their training, drinking and sanboxing around.\r\n\r\nObviously if you chose the rebel side early on in the game, the mod\\'s not for your character (it\\'s probably not going to work since it is linked to an event in the Imperial campaign and not in the SC campaign).\r\n\r\nIf you have followers with you on horseback, stick to the roads. If I go across the country I find that they fall behind and their horses get lost and then you can\\'t find their horses.\r\n\r\n=============================\r\nInstallation instructions\r\n=============================\r\n\r\nCopy the contents of the zip folder file into the data folder in your Skyrim directory. Click yes if Windows asks you whether you want to merge folders. On the game startup screen click \\\"data files\\\" and click the checkboxes next to the mods.\r\n\r\n\r\n=============================\r\nBugs/problems: PLEASE READ THIS BEFORE REPORTING IN COMMENTS\r\n=============================\r\n\r\n[b][color=RED] I. Sometimes the Imperial messenger will not appear in the office of Tullius even though you have completed the Imperial campaign. If this happens to you try the following:\r\n\r\na. exit and then re-enter the castle. OR\r\nb. Restart Skyrim and reload the game (just reloading a save won\\'t work)[/color][/b]\r\n\r\nDo not CoC to SolitudeCastleDour directly! If you do, you have to do step a. (see above)\r\n\r\n\r\nII. When on horseback the followers cannot fast travel with you with their horses. That is the limitation of Horses for Followers mod I think. And when they follow you on horses, they can get lost easily and then you loose the horses, so be careful with that.\r\n\r\n\r\nIII. if you are updating from an earlier version of the mod, you may need to make your game reset the NPCs. See the tricks described above.\r\n\r\nIV. It appears that the enemy NPCs spawning near the camp are not supposed to be there and are somehow caused by my mod - probably the markers I use for setting patrol routes for the soldiers. I have no idea why it is like this, but I will try to fix it when I have the time. Sorry about that one - it\\'s an annoying bug.\r\n\r\n\r\nIf everything else fails, try an earlier version of the mod. There isn\\'t much change in between them.\r\n\r\nIf something else doesn\\'t work or you think I missed, please let me know and I will fix and reupload.\r\n\r\n=============================\r\nConflicts\r\n=============================\r\n\r\nThis mod may conflict with any mod that adds property near Dragon Bridge.\r\n\r\n\r\n=============================\r\nPlans for future versions\r\n=============================\r\n\r\nI am going to try and integrate this with my Roman armour mod so that you get a little Roman special bodyguard unit that will use black cloaks, the standard, etc. As it seems that the only quest of interest to me at the moment (and apparently most others) is the civil war quest, it is time to make this a unit that can wreak havoc on the remaining insurgency.\r\n\r\n\r\n=============================\r\nLegal\r\n=============================\r\n\r\nThe usual give-credit honor system if you are going to use this mod in yours.\r\n\r\n\r\n=============================\r\nCredits:\r\n=============================\r\n\r\nMeeeeeeeeeeee...too egocentric?",
  "categoryId": "33",
  "version": "1.3",
  "author": "Jedo Dre",
  "createdUnix": "1335026310",
  "updatedUnix": "1345633012",
  "containsAdultContent": false,
  "uploadedBy": "Jedo_Dre",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81049",
      "name": "Imperial Followers by Jedo",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2119",
      "fileName": "Imperial Followers by Jedo-15629-1-1.zip",
      "uploadedUnix": "1344789709",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/156e5afceeea36c01b065bf8771e9ea51fcb172e57eeba7e2d405170360bb27f/analysis/1407091684/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imperial%20Followers%20by%20Jedo-15629-1-1.zip?fid=81049&ttl=1535780196&ri=8192&rs=8192&setec=670d493108502131c5a23d1b5951223d"
    },
    {
      "fileId": "81826",
      "name": "Imperial Followers by Jedo",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2119",
      "fileName": "Imperial Followers by Jedo-15629-1-2.zip",
      "uploadedUnix": "1345051204",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/6dd5e23cb5b8be5174ba2c13744064486abcd5606a6689eed4d6128607df7a48/analysis/1407099008/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imperial%20Followers%20by%20Jedo-15629-1-2.zip?fid=81826&ttl=1535780197&ri=8192&rs=8192&setec=8be5e68370fc7406d1a13e47d7087589"
    },
    {
      "fileId": "83403",
      "name": "Imperial Followers by Jedo",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8218",
      "fileName": "Imperial Followers by Jedo-15629-1-3.zip",
      "uploadedUnix": "1345633012",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/dcf03b48be110e014af43b7ed9919e1efd7ab00299702f798f5e15f341a647b3/analysis/1407114021/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imperial%20Followers%20by%20Jedo-15629-1-3.zip?fid=83403&ttl=1535780197&ri=8192&rs=8192&setec=c6a2bc04a72dd6053957c9e95ccd8cc7"
    }
  ]
}