{
  "modId": 15633.0,
  "modName": "Beautiful Characters Savegames",
  "summary": "Several natural looking, beautiful characters for you to download.",
  "descriptionHtml": "[center][img]http://i47.tinypic.com/24parnc.png[/img][/center]\r\n\r\n[center][b]Enter Vjarkell Castle! Due to an unfortunate series of events this castle has lost its rightful owner and has fallen into the hands of evil. It is up to the dragonborn to slay the evil that shadows over Vjarkell Castle and claim the castle for him or herself.[/b]\r\n\r\nI love the Dawnguard DLC. The Dawnguard Headquarters remind me of the castles of TES III: Morrowind and we get to see the Forgotten Vale, which has to be the most beautiful and scenic place in an Elder Scrolls game ever. I combined Dawnguard Castle and Ancient Falmer architecture to create what I think is a unique and fitting castle for your dragonborn and his companions to enjoy. Let me know if you like it or if you think something is still missing![/center]\r\n\r\n[center][img]http://i49.tinypic.com/2nte15d.png[/img][/center]\r\n\r\n[color=#FF3232][b]Updating from version 1.0/1.5:[/b] Due to a number of problems some of the containers needed to be reset. Also, the mannequins in the living area have been worked on. I\\'m really sorry for the inconvenience, but trust me, you\\'ll get a better mod in return. Also, I promise that I won\\'t do this again:[list]\r\n[*]Remove anything important from the three barrels in the kitchen area.\r\n[*]Remove anything important from the existing bookshelves in the halls.\r\n[*]Remove anything important from all of the mannequins in the living area.[/list][/color]\r\n\r\n[color=#64FFFF][b]Version 2.0 released![/b][list]\r\n[*]Delve even deeper into the history surrounding Vjarkell Castle in the all new quest \\'Frozen in Ice\\', featuring a brand new area including Daedric shrines, new interesting NPC\\'s, unseen scenery, an unlockable merchant, a treasury and more goodness I\\'m not revealing here. The quest starts upon entering the Castle Halls, so you might want to leave and enter there if you saved your game in the halls.\r\n[*]Enjoy your brand new kitchen in the Vjarkell Dungeons!\r\n[*]The hidden area in the living room (beneath the firewood) now features a prison and some torturing tools for all you evil types.\r\n[*]Fixed bookshelf related CTD\\'s.\r\n[*]Removed a few mannequins to kill some annoying problems.\r\n[*]Countless cosmetic fixes and upgrades.[/list][/color]\r\n\r\n[b]Castle Features:[/b][list]\r\n[*]Combination of the awesome Dawnguard HQ & Ancient Falmer architecture\r\n[*]Fully furnitured and functional player house, thought out & detailed\r\n[*]Situated in one of the most scenic areas in any Elder Scrolls game to date: The Forgotten Vale\r\n[*]Satisfies all your crafting, cooking, sleeping, drinking, storing, collecting, worshipping & bathing needs\r\n[*]Safe storage (no respawning containers)\r\n[*]Ancient Falmer Treasury including a real Snow Elf merchant from times long forgotten\r\n[*]Including backstory and easter eggs\r\n[*]As lore respecting as possible\r\n[*]Infrastructure: Teleporting spells and discoverable map markers\r\n[*]NavMesh: The entire structure including dungeons has been NavMeshed. Your followers follow you everywhere.[/list]\r\n\r\n[b]Coming up:[/b][list]\r\n[*]NPC\\'s[/list]\r\n\r\n[center][img]http://i50.tinypic.com/308jw39.png[/img][/center]\r\n\r\n[b]Required for this mod:[/b][list]\r\n[*]The Dawnguard DLC\r\n[*][url=http://skyrim.nexusmods.com/mods/10652]This fix here[/url] to prevent annoying mannequin bugs. Really, install this.[/list]\r\n\r\n[b]Used for screenshots:[/b][list]\r\n[*]Cinematic Lighting ENB by HeliosDoubleSix, available [url=http://skyrim.nexusmods.com/mods/4142]here[/url].[/list]\r\n\r\n[center][img]http://i48.tinypic.com/1088ara.png[/img][/center]\r\n\r\n[list][*]As always I recommend using the Nexus Mod Manager. Download the mod and simply click install. Manual installation: Place the .esp file, the /Scripts, the /Meshes and the /Textures folder in your /Data folder.\r\n[*]Enter the Forgotten Valley, climb up to the Frozen Lake and you\\'ll notice the castle right away. Fight the Frost Giant to gain entry. The quest starts when you first enter the castle.\r\n[*]For the teleport spell: Check the bar in the private quarters.\r\n[*]For the hidden areas: Complete the quest, check the Dibella statue in the pantheon and look beneath the pile of firewood in the living room.[/list]\r\n\r\n[center][img]http://i45.tinypic.com/34dh9w8.png[/img][/center]\r\n\r\n[center][youtube]91z4S8BRQ9M[/youtube][/center]\r\n[center][youtube]KF3GkbibVCU[/youtube]   [youtube]W_iM9CfATjc[/youtube][/center]\r\n\r\n[center][img]http://i48.tinypic.com/2euo4mq.png[/img][/center]\r\n\r\n[list][*]Eldiabs for [url=http://skyrim.nexusmods.com/mods/11618]this modders resource[/url]. Besides that, his mods are awesome too and were an inspiring experience for me.\r\n[*]Oaristys & Tony67 for [url=http://skyrim.nexusmods.com/mods/16525]this modders resource[/url]. I used the treasury meshes. Thank you guys! You are awesome.\r\n[*]Blary for [url=http://skyrim.nexusmods.com/mods/16525]this modders resource[/url]. The meshes are a welcome addition for kitchen designing. Many thanks.\r\n[*]Everyone featuring this mod in YouTube videos. The effort you guys make leaves me speechless.\r\n[*]All the community members thinking with me and suggesting new features in the messages. Keep them coming![/list]\r\n\r\n[center][url=http://skyrim.nexusmods.com/mods/11222][img]http://i47.tinypic.com/ev291w.png[/img][/url][/center]",
  "categoryId": "43",
  "version": "1.01",
  "author": "PyHarmonic",
  "createdUnix": "1335028448",
  "updatedUnix": "1335028505",
  "containsAdultContent": false,
  "uploadedBy": "PyHarmonic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "55137",
      "name": "Savegame collection",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22813",
      "fileName": "Savegame collection-15633-1-0.rar",
      "uploadedUnix": "1335028505",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ca06544684f76ccd9d8bf74d69c46422a06486895da87d2fe905511411eecbc4/analysis/1406826921/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Savegame%20collection-15633-1-0.rar?fid=55137&ttl=1535780205&ri=8192&rs=8192&setec=31009337ec7af99e411934f8834a9684"
    }
  ]
}