{
  "modId": 15654.0,
  "modName": "Astronomy of Tamriel",
  "summary": "Adds a book that helps you find the constellations!",
  "descriptionHtml": "A simple mod which was influenced by a mod on the Nexus that makes the constellations more noticeable in the night sky.\r\n\r\n[u]What it does:[/u]\r\nAdds a book entitled \\\"The Astronomy of Tamriel\\\" to the Winterhold College, and all the major cities that helps you find the constellations in the sky. I don\\'t want to spoil it too much, so just open the book and find out for yourself ;). The books are located in the library (naturally) and the Court Wizard rooms ~ well, more like where the Arcane tables are at.\r\n\r\nAlso, the books in Skyrim are weird because they follow basic HTML coding, but you don\\'t know when a page starts or ends. As a result, the bottom of some pictures got cut off. I would love to have each page look like \\\"The Ritual\\\" page, but alas, I don\\'t know how. And don\\'t say use pagebreak code, because that sent everything on the right pages - the book would be well over 14 pages!\r\n\r\n[u]Mods that go good with this:[/u]\r\nEnhanced Night Skyrim (A must have for anyone)\r\nSpookyJs Slightly Improved Constellations (http://skyrim.nexusmods.com/downloads/file.php?id=1832)\r\n\r\n[u]Incompatibilies:[/u]\r\nAny mod that alters the area in which the books are placed. I use a lot of mods, and none alter the areas; so for now, there shouldn\\'t be any.\r\n\r\n[u]Special Thanks:[/u]\r\nSpookyJ\r\n(For pointing out that the Mage is a sort of \\\"North Star\\\" - and getting me to make this mod through mutual interests)\r\nCptJoker71\r\n(He made Enhanced Night Skyrim)\r\nBethesda\r\n(I hear they made Skyrim)\r\n\r\n[u]Any other information that keeps me from copyright stuff?[/u]\r\nThe pictures of the constellations came from the Skyrim Wiki.\r\nThe map was made be me in photoshop.\r\nThe text was written by me.\r\n\r\n[u]Permissions:[/u]\r\nPretty much the same as every other mod. Don\\'t do stuff with the mod without my permission (except download it...), source me after I give you permission, blah blah all that jazz.",
  "categoryId": "85",
  "version": "v0.1",
  "author": "vertex23",
  "createdUnix": "1335053965",
  "updatedUnix": "1335054043",
  "containsAdultContent": false,
  "uploadedBy": "vertex23",
  "primaryFile": null,
  "files": [
    {
      "fileId": "55232",
      "name": "The Book",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2166",
      "fileName": "The Book-15654-0-1.rar",
      "uploadedUnix": "1335054043",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/f27267ed4cb71c47cdbdb61125fe25e0474549a43aa892e7931662fbeae9ea10/analysis/1406827572/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Book-15654-0-1.rar?fid=55232&ttl=1535780239&ri=8192&rs=8192&setec=776c7ac2df9953fd3bdbbf85c59014e4"
    }
  ]
}