{
  "modId": 15659.0,
  "modName": "The Undercity",
  "summary": "A new city due west of Whiterun, nestled on a small mountain.",
  "descriptionHtml": "The Undercity - by Borjoyzee\r<br />Catagory - Cities and Towns\r<br />\r<br />[font=impact][size=4][b][u]NOTE[/u][/b] --- I&#39;m burnt out on Skyrim and the CK, and I&#39;m abandoning this mod. If anyone with [u]good CK knowledge and experience[/u] wants to take over The Undercity, send me a PM.[/size][/font]\r<br />\r<br />[u]1.8 NOW AVAILABLE&#33;[/u] See change log. (Where it says &#34;Changes&#34; on the end tab. And the blue 1.8 in the download segment) And a new article I quickly wrote explaining it better.\r<br />\r<br />Mod has been cleaned with TES5Edit, the only edits that remain are the intended ones, like the entrance and it&#39;s navmesh. \r<br />\r<br />[color=yellow][font=Segoe Print][center][size=6][b][u]~ Description ~[/u][/b][/size][/center][/font][/color]\r<br />Welcome to the Undercity, a new city located entirely underground. Has just about nearly everything a city should have and one would expect. I grew tired of travelling from city to city looking for the things I needed, not to mention travelling from city to city trying to sell all the items in my inventory. That&#39;s the main focus of this mod, the merchants, and they sell more than your average merchant in your average city. Although there is a little more to the place which I will describe in greater detail a little later. There are also NPC&#39;s wandering around, but for now these guys are there just to flesh out the city and give it that little bit of life, I plan on giving them simple quests in later versions. All in all there are around 32 new cells, and even more NPC&#39;s. The entrance to the city is located west of Whiterun, you will be able to see the map marker but not able to fast travel to it, and is situated on a small mountain (See screenshots for location).\r<br />\r<br />\r<br />[color=yellow][font=Segoe Print][center][size=5][b][u]Merchants[/u][/b][/size][/center][/font][/color]\r<br />Some merchants sell items that were not usually playable but given new ID&#39;s so not to conflict with anything, and some like the weapon and armour merchant sell unenchanted version of Daedric items. There are merchants for just about everything and all start their routines from 8 in the morning until 8 in the evening:\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Garr&#39;s Bookshoppe[/b][/size][/font][/color] - Garr&#39;s Bookshoppe - Sells a more extensive range of books. (I could never find the full sets for the likes of A Dance in Fire.) Also sells the rest of the books from Oblivion not included in Skyrim. Started on Morrowind books, but there&#39;s still more to do. In his collection he owns a book detailing all the skill-trainers in Skyrim.\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Blacksmith[/b][/size][/font][/color] - Only sells ore, ingots and animal pelts, all the things for crafting.\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Haileys Apothecary[/b][/size][/font][/color] - Sells potions and ingredients. Also sells potions for increasing your attributes (Health, Magicka, Stamina and Carry Weight) by 10. These are expensive (speechcraft affects the price) and she doesn&#39;t sell a lot. On a table are 6 potion combiners, here you can combine health and magicka potions into one elixir that has both effects. For example a weak health and a weak magicka potion can be combined to make an weak elixir that restores both health and magicka. There&#39;s one for every strength of potion, weak to ultimate.\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]A Cut Above[/b][/size][/font][/color] - Mostly clothing, well all clothing. And some items which are not usually playable, but made playable and given new ID&#39;s so won&#39;t conflict with anything.\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Tools O&#39; War[/b][/size][/font][/color] - Weapons and armour merchant. No enchanted items, but everything else. Sells unenchanted versions of Daedric items, and other things that were not usually playable.\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Brewers Fayre[/b][/size][/font][/color] - A tavern, sells all beverages and the waitress sells food. Some NPC&#39;s come in here at certain times of day. Frank the bard will play music, and does requests&#33; Rent a room from Mallory, it&#39;s the guest room on the top floor.\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Underhanded Techniques[/b][/size][/font][/color] - An ex-brotherhood assassin sells things here you might expect from an assassin. Daggers and poisons. Speaking of poison, he brought back the poisoned apples idea from Cyrodiil, and Languorwine. Who knows how. Both do the same thing as the poisoned apples from Oblivion, so don&#39;t consume them, though they&#39;re are not as powerful you might be able to outlast the poison with enough healing items and/or magic. They are classed as food items so NPC&#39;s might be inclined to consume them.\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Essential Gubbins[/b][/size][/font][/color] - Mainly things for home decoration, and has a really extensive list of wierd curio. Again, each one given new ID&#39;s to not conflict with anything. The owner has recently got his scaly hands on a forbidden tome, best not to ask how. It&#39;s located in his store somewhere so you&#39;ll have to find it, but be careful. It will teach you a new power to summon a ghostly merchant. For now, please don&#39;t summon the merchant while he&#39;s already summoned, just wait for him to disappear before summoning him again. In the next version this will be fixed so&#39;s you can&#39;t summon him when he&#39;s already summoned. Also his inventory resets every time he&#39;s summoned, so anything you sell to him will be gone the next time you summon him.\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Vacant House[/b][/size][/font][/color] - A thief that, while he doesn&#39;t sell anything but lockpicks and thiefy items, he will buy stolen items. He&#39;ll trade for longer than the other merchants, until his beauty sleep.\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Fletchers Paradise[/b][/size][/font][/color] - An archer, sells the things you would expect. No enchanted bows but sells all others. And arrows, the more powerful the less he sells. Also armour and trinkets fit for an archer, not to mention potions and poisons to aid that. Lastly he sells fire, frost, shock, fear, disarming, paralyze, force (knocks opponents down), Icy Tomb (Envelops opponents in ice) and health absorption arrows.\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Undercity Magicka[/b][/size][/font][/color] - Three mages that sell all but the most powerful spells, the ones which have to be obtained elsewhere. Also selling soul gems, staves and scrolls. In here there is also a device known as the Time Transmuter, using this you you be able to alter the pace of time flow, (How fast day and night pass in-game) and there are 4 settings to choose from. Lastly there is a permanent Nirnroot growing here kept going by magicka, once picked it will remain and you get a Nirnroot but it will not be pickable again for a day or two, so come back later. Also one of the mages sells Mark & Recall spellbooks, a Weakness to Magicka spellbook, Reflect Damage book. And Conjure Skeleton spellbooks, three different types of conjurable skeleton spells, one is a melee fighter, one is an archer and one is a mage. They are leveled so get better along with you.\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Sammuels Lapidary[/b][/size][/font][/color] - A recent merchant selling all types of jewelry, gems and Gold/Silver ore. He also owns a gold and silver mine.\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Undercity Petshop[/b][/size][/font][/color] - There are three available pets to buy, a brown bear called Chompy, and sabre cat called Gorefang, and a grey wolf called Redmaw. (Only three pets for now, there&#39;s two more cages that are empty so in future I may add a couple more to them) To purchase all you have to do is approach their cages and press the button, you will be given some info and how much they cost to buy if you want one, which is 1000 gold coins. They are leveled with you and are essential. Click on them once to have them follow, then again to bring up the commands, which are just simple follow, wait and dismiss. When you dismiss them, they will return to the petshop. The owner also sells some spelltomes associated with animals, the command animal spelltome has been given to her instead, and she sells four conjure animal tomes, a black wolf, and black bear, a sabre cat and one that summons four disease riddled rats.\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Hermit[/b][/size][/font][/color] - A new merchant who has set up a home in an icy cave. The purpose of this guy is to instead sell all (or most of) the unique items which can be found and stolen from the various homes and shops in the Undercity, if you don&#39;t want to steal them. (As the only way to rid the stolen tag from them is to sell them and re-buy) Just buy them from him instead. There is also a secret in this place, see if you can find it. \r<br />\r<br />[color=yellow][center]_   _  _ _ ___________________________________________ _ _  _   _[/center][/color]\r<br />\r<br />Each merchant has more gold than your usual merchant, but not too much. Also some may have a unique item hidden or locked up in display cases in their homes somewhere...if you&#39;re so inclined. Each merchant has dialogue, and some might want things. Or offer things. Rarely, I&#39;ve noticed the merchants seem to enjoy going walkabout, they shouldn&#39;t but they do. Their AI tells them to remian in their shops at all times, but, sometimes they completely disappear for some reason. I don&#39;t know the cause but, to counter this, I have placed &#34;Summon Merchant&#34; buttons on the counter of each merchants shop that will summon them back to where they should be. Obviously there&#39;s no need to use them if they are right there where they should be, so only use it if they have mysteriously vanished.\r<br />\r<br />[color=yellow][font=Segoe Print][center][size=6][b][u]~ Other things ~[/u][/b][/size][/center][/font][/color]\r<br />There is a house you can buy. It&#39;s a little on the expensive side at 40000 (4 or 5 thousand more the Solitude&#39;s fully upgraded house), but considering the features it has, it&#39;s well worth it. And let&#39;s be honest, money isn&#39;t hard to come by. There are auto-sorters for most types of things, except arms and armour. A full library (10 bookcases). All crafting amenities. A modest display room. Two bedrooms, one for you the other for anyone else. A spellbook that teaches you a spell that can teleport you back to the house, and a way to get back to where you last cast the spell, purely for convenience. And a few little surprises. There is also a scroll-making station, it requires rolls of paper and depending on the power of the scrolls spell, different strength filled soul-gems. The rolls of paper can be made from ruined books. To buy the house, there is a blue flag near the entrance. Click on it and if you have enough, you will be given the option to buy. As soon as you do you get the key and the flag disappears. Oh and as for spouses moving in, well, in order for that to work with player added houses a vanilla script must be altered or so I heard, which is something I&#39;m not willing to do, seeing as other mods might also alter this script and result in incompatibilities at best. But [url=http://skyrim.nexusmods.com/mods/11370]this[/url] mod may be what you are looking for, &#34;Spouses Can Live Everywhere&#34;.\r<br />\r<br />If you don&#39;t want to buy the house but want a place that offers more places to display your best armour and weapons, you can use the museum to display them instead. It has 14 mannequins and even more plaques for weapons, staffs and shields. Use the light switches to turn lights on an off to clearly see what you display. You can get there from the Understreets.\r<br />\r<br />A Bath House from which you can also get to from the Understreets. Contains a large pool, bath, and a sauna. A few people chill out here also, and I never gave them any clothing so if you have nude mods they&#39;ll be completely naked.\r<br />\r<br />There is a Hall of the Dead. The keeper there has a thing for skulls, so much so in fact that he will pay you for human and troll skulls. Go and ask him about it.\r<br />\r<br />Certain merchants sell portable crafting items. To use you must favorite the item, assign it a hotkey number and use it by hotkey only. Technically, they are pieces of armour which was the only way I could do it, but they don&#39;t take up a slot so can be used with any armour. I tried to place them with merchants that make the most sense, example the mages sell a portable soul gem for enchanting.\r<br />\r<br />There&#39;s a library split into two rooms, each one has 8 bookshelves, and each bookshelf can store 18 books. In total 288 books are storable.\r<br />\r<br />Guards walk around the city and the Undercity has a full crime and punishment system, so if you get caught being naughty off to the Undercity prison with you&#33; You could just serve your time but if you&#39;re up to it, there may be a way to escape...\r<br />\r<br />All other NPC&#39;s have their own abode in the Understreets, but as I said they are here for now just to give the place some life. They just sandbox around walking, sitting, drinking, eating, sleeping etc. In later versions I plan on giving some of them quests, but that&#39;s for later.\r<br />\r<br />There are 3 possible companions to take with you. One is a warrior, plain and simple, an ex-oculatus soldier and wields a large executioner axe. One is a pure archer but has some skill with blades. And the other is a necromancer, focusing on reanimating/manipulating the dead and conjures a Frost Atronach, uses frost magic and has some healing spells.\r<br />\r<br />Need some ore? Get yourself in the mine and get hacking&#33; The place can be treacherous, and mind the other miners.\r<br />\r<br />Don&#39;t touch the &#34;friendly&#34; skeevers whatever you do, you never know what you&#39;ll get.\r<br />\r<br />In the middle of the main city area on an island is a wishing well that you can throw some different items into, some coins are the first and obvious choice and something which everyone should have, and will give you a 100 point health buff for the same duration as a shrine blessing. But there are 3 other items you can throw in and I&#39;ve leave these as a surprise, since the items will only show if you have them.\r<br />\r<br />Need some training? In the Understreets there are two training rooms. First up is the lockpick training room, with 5 re-lockable containers, 1 for each skill level. There is a respawning chest but with a limited supply of lockpicks. If you fancy a challenge, enter into the training and assault course&#33; These halls are absolutely BRIMMING with danger&#33; Traps, enemies, pitfalls, you name it. Save before you start because you will be hurting at the end, so healing items and magic are a must. There is a prize waiting for those with enough skill who finish&#33; If anyone has any trouble getting through, [url=http://www.youtube.com/watch?v=aBwRWfmm0CI]here is how to do it.[/url]\r<br />\r<br />Navmeshed? Yes, of course. With so many NPC&#39;s, had to be. Each cell (30 odd) is navmeshed, error-checked, cover-edged (ask if you want to know what that means, it&#39;s boring trust me but necessary) and finalised (Makes followers follow you through each cell).\r<br />\r<br />[color=yellow][center]___________________________________________________[/center][/color]\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Future plans[/b][/size][/font][/color] - Plenty, and now that the city stuff is all but done, quests for the NPC&#39;s, a display room or 2 with mannequins and weapon plaques, new items, spells etc. Anything that comes to me whilst playing. \r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Bugs/Incompatabilities[/b][/size][/font][/color] - Will probably be incompatable with any mod that places something near the entrance, though I don&#39;t know of any yet, but there may be. Also cannot say what future mod may put there*\r<br />\r<br />*It was gonna happen sooner or later. Unfortunately, it&#39;s not compatible with [url=http://skyrim.nexusmods.com/mods/33766/] this mod.[/url] The entrances are in exactly the same place so I&#39;ve been told, though I haven&#39;t checked it out myself.\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Install[/b][/size][/font][/color] - Put the esp. and bsa. files into your data folder. If that&#39;s too much bother, use NMM. I don&#39;t use NMM but it should work ok. Though you may get an error with NMM, I&#39;ve seen it dozens of times with other peoples mods, it&#39;s a problem apparently. It will work eventually, just keep trying and maybe wait for a while. Please, if that happens, there&#39;s no need to tell me. (If you read this far....)\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Translations[/b][/size][/font][/color] - [url=http://skyrim.nexusmods.com/downloads/file.php?id=17637]Czech Translation[/url] - [url=http://skyrim.nexusmods.com/mods/28812]Traduction Française/French Translation[/url]\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Translation requests[/b][/size][/font][/color] - If you want to translate this mod, you can. No need to ask but if you give me a link to where you upload it I will put the link here.\r<br />\r<br />[color=yellow][font=Segoe Print][size=3][b]Credits[/b][/size][/font][/color]\r<br />Bethesda - For the game and a buggy CK&#33; haha just kidding.\r<br />Nexus - For a great place to upload mods.\r<br />Justinother - for help at bethy forums for the timescale script.\r<br />Oaristys - For a modders resource pack.\r<br />Darkrder - For a painting resource pack.\r<br />SpiralDynasty - For the animal companion tutorial.\r<br />dj2005 - Testing.\r<br />\r<br />Anyone else I may have missed.",
  "categoryId": "53",
  "version": "1.8",
  "author": "Borjoyzee",
  "createdUnix": "1335057630",
  "updatedUnix": "1374610105",
  "containsAdultContent": false,
  "uploadedBy": "borjoyzee",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000030172",
      "name": "The Undercity 1_7",
      "version": "1.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13133",
      "fileName": "The Undercity 1_7-15659-1-7.7z",
      "uploadedUnix": "1368735145",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/f13ed0d3aca9afa5e94098839c5b10bc5351df7663f841bf26a32edddc16f377/analysis/1407571896/",
      "changelogHtml": " All merchants now have dialogue. <br/> \n Additions, changes, adjustments, etc... <br/> \n Cleaned with TES5Edit. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Undercity%201_7-15659-1-7.7z?fid=1000030172&ttl=1535780249&ri=8192&rs=8192&setec=a9999eb25c412a9f0a96550409e39776"
    },
    {
      "fileId": "1000040285",
      "name": "Undercity 1_8",
      "version": "1.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14629",
      "fileName": "Undercity 1_8-15659-1-8.7z",
      "uploadedUnix": "1374610105",
      "modVersion": "1.8",
      "virusScanUrl": "https://www.virustotal.com/file/9710d1e161fc1196294ead1bcb3199d52c9cfe040cd1c76c17de82d433314aac/analysis/1407653870/",
      "changelogHtml": " Added a museum for your goodies <br/> \n Added a bath house to chill out in <br/> \n Spell: Conjure Spiders <br/> \n Spell: Conjure Zombie <br/> \n Spell: Panacea <br/> \n Spell: Enhanced Mark. Place up to four marks. <br/> \n Spell: Enhanced Recall. Recall back to those four. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Undercity%201_8-15659-1-8.7z?fid=1000040285&ttl=1535780249&ri=8192&rs=8192&setec=47d2f9fe6182766e7fe459d60b6944b2"
    }
  ]
}