{
  "modId": 15652.0,
  "modName": "83Willows 101BugsHD TRADUZIONE ITALIANA",
  "summary": "Traduzione italiana del file 83Willows 101BugsHD Butterfly Dragonfly Luna-Moth Torchbug di 83willow.\r\nTHIS IS ONLY A TRANSLATION OF THE ORIGINAL MOD",
  "descriptionHtml": "[color=red][size=+2][center]NOTICE![/color][/size][/center]\r\n[color=red][size=+1][center]This is only a translation into Italian of the original mod. All credits go to the creator of the [url=http://skyrim.nexusmods.com/downloads/file.php?id=4955]original mod[/url].\r\n83Willows 101BugsHD Butterfly Dragonfly Luna-Moth Torchbug adds 26 new insects and ingredients plus HD retextures all the Vanilla insects.\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.[/color][/size][/center]\r\n[color=green][size=+5][center]UNA PRODUZIONE DRAGONBORN ITALIA[/color][/size][/center]\r\n\r\n[color=green][size=+1]DESCRIZIONE[/color][/size]\r\n83Willows 101BugsHD Butterfly Dragonfly Luna-Moth Torchbug aggiunge 26 nuovi insetti ed i relativi ingredienti. Inoltre fornisce nuove textures HD per gli insetti della versione Vanilla del gioco. \r\nGli insetti aggiunti sono:\r\n15 diversi tipi di Farfalle/Falene;\r\n11 diversi tipi di Libellule;\r\n2 nuovi tipi di insetti.\r\n\r\nGli insetti della versione Vanilla a cui è stato rifatto il look sono:\r\nLucciole, Farfalle, Libellule, Api e Formiche! \r\n\r\n[color=green][size=+1]INSTALLAZIONE[/color][/size]\r\nCome prima cosa dovete installare la mod originale di 83Willow. Utilizzate la versione che preferite:\r\nSe avete un impianto abbastanza potente scaricate il file 83Willows 101BUGs V4 HighResolution che fornisce textures ad alta risoluzione;\r\nse preferite textures a risoluzione più bassa scaricate il secondo file 83Willows 101BUGs V4 LowerResolution.\r\nI due file presenti nella sezione \\\"optional\\\" forniscono differenti quantità di \\\"produzione\\\" degli insetti del gioco. Questo significa che nei luoghi in cui è prevista una certa quantità di insetti, con questo file ne troverete molti di più. Ancora una volta se preferite textures ad alta risoluzione scaricate il pacchetto HighResolution, altrimenti LowerResolution. \r\nUna volta installata la mod originale cliccate sulla sezione Mirror in alto a sinistra su questa pagina e navigate fino alla nostra community Dragonborn Italia. Lì nella sezione download troverete il plugin da scaricare e copiare nella cartella Skyrim/Data. Quando vi chiederà di sovrascrivere il file cliccate \\\"Copia e sostituisci\\\". Nell\\'archivio troverete due file .esp. L\\'unica differenza tra i due è il nome, però per chiarezza è preferito aggiungerli entrambi così sarà più facile per voi sostituire il file. Copiate nella cartella Data soltanto uno tra i due a seconda se avete scaricato la versione HQ o normale della mod originale. \r\nBuon gioco.\r\n\r\n\r\n\r\n\r\nTutti i meriti vanno [b][u]alla più gentile dei modder di sempre[/u] [u][url=http://skyrim.nexusmods.com/modules/members/index.php?id=938388]83Willow[/url][/b][/u] per la creazione di questa fantastica mod.\r\nAll credits go to [b][u]the kindest modder ever[/u] [u][url=http://skyrim.nexusmods.com/modules/members/index.php?id=684492]83Willow[/url][/b][/u] for the creation of this awesome mod.",
  "categoryId": "83",
  "version": "4.1",
  "author": "Demea",
  "createdUnix": "1335050816",
  "updatedUnix": "1335050816",
  "containsAdultContent": false,
  "uploadedBy": "Demea",
  "primaryFile": null,
  "files": []
}