{
  "modId": 15658.0,
  "modName": "Skyrim Weapon Positioning - Weapons on Back",
  "summary": "Designed for Armed to the Teeth, this mod moves the position of your one handed sword to one beside your two handed weapon so you have both together, at the same time in decent positions. Adds an additional Dagger position which places it on your right boot, where a dagger should be, depending on how you use it. Also contains optional vertical weap",
  "descriptionHtml": "[color=red]Came by to slip in a little note: I am sorry but I no longer will be updating this mod. Most people know this already. I don&#39;t have the time at the moment. Please do not send me PM&#39;s regarding SSE or questions about positioning, simply because I no longer mod Skyrim and have done not so in years so my knowledge is now lacking.[/color]\r<br />\r<br />- Skyrim Weapon Positioning -\r<br />\r<br />[img]http://i88.photobucket.com/albums/k169/Metal-Gear-REX/title.jpg[/img]\r<br />\r<br />(Excuse my lousy layout skills. If my file should be somewhere else, I&#39;m fine with it being moved lol)\r<br />\r<br />****************\r<br />Important - RECOMMENDED MODS&#33;\r<br />****************\r<br />\r<br />This mod was initially designed to compliment Dahaka002011/EwokJedi/Mergweq&#39;s Armed to the Teeth&#39;s primary function. Thus I hugely suggest you download/install AttT below BEFORE my mod, after reading the mods frontpage as it is very important you do so, and download the additional mod below this.\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=9614\r<br />\r<br />Zeridian&#39;s mod makes MANY custom weapons from other mods function with Armed to the Teeth. It covers the two weapons in my screenshots which are part of the LOTR blades pack, but Zeridian&#39;s mod also covers Jaysus&#39; swords and MANY others. This is also a must, like AttT, if you want to get the best result of using my mod.\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=15373\r<br />\r<br />***********\r<br />DESCRIPTION\r<br />***********\r<br />\r<br />This mod essentially moves the position of your one handed sword from your hip and onto your back. It also adjusts the two handed weapons position to work in accordance with this. Why? Because once you manage to get them working with Armed to the Teeth (mentioned in the Recommended Mods section above), they sit together nicely as seen in the screenshots. Otherwise, I believe the two weapons would clip and would become annoying. There is the choice of a new dagger position as well which places it on your right boot, where a dagger should be, depending on how you use it. \r<br />\r<br />Also, there is the option for another alternate position which places your one handed and two handed weapons side by side, vertically. You can also have a quiver which is straight as well. While it is not entirely realistic, it looks okay and to an extent, you could pull it off in real life anyways... maybe, lol.\r<br />\r<br />I tried to cover compatibility for some of the more popular mods out there which have skeletons edits too. By default this mod contains compatibility for AttT (to an extent, as I was unable to test the shields as they seem to be bugged right now), but also my mod  has compatibility for:\r<br />\r<br />Ning99&#39;s Female Skeleton http://skyrim.nexusmods.com/downloads/file.php?id=11064\r<br />dDefinder1&#39;s Realistic Ragdolls and Force http://skyrim.nexusmods.com/downloads/file.php?id=601 - When you are using dDefinder&#39;s RRaF, ensure you install the version you want, before you install this mods version. This will ensure you have your desired esp. Mine only really does cover the realistic ragdoll skeleton though.   \r<br />Hl84&#39;s Well Placed Weapons and Quivers http://skyrim.nexusmods.com/downloads/file.php?id=7716 - Already present under AttT&#39;s file section, but mine has been modified for my weapon positions. \r<br />\r<br />I have adjusted some of the quivers and the bows for these mods, to try and sort out the floating weapon issues. However, people need to keep in mind clipping cannot be truly avoided. When it comes to clipping it is a game of COMPROMISE and a situation filled with DEPENDENCIES. When a quiver position is edited for one specific quiver, it affects others which could make them literally float in mid-air. Some quivers are simply too big, such as the Dwarven quiver or Glass, which hugely dig into the back of your character. Hint hint: Someone should release a smaller quiver mod.\r<br />\r<br />\r<br />Clipping and hovering is possible, depending on weapons, armours and quivers. I have tried to minimalize this without going to either extreme. This definitely does count for beast races and sometimes males. Probably does for females as well. It comes down to armour. Maybe in the future I will try to tweak them to improve it somewhat, but right now I&#39;m tired of editing skeletons and testing, especially going back and forth then finding out when it works for a certain piece of armour, it doesn&#39;t for another.\r<br />\r<br />\r<br />I recommend you read through the FAQ as well, this is because it WILL address issues you WILL - once you come across one or two, which is likely - consider commenting on and questioning. These issues include only having one weapon on your back, clipping (weapon, armour, skeleton), skeleton types and skeleton compatibility, heavenly hovering weaponry, realism, equipping sounds, suggestions and finally, feeling badass.\r<br />\r<br />* Please bear in mind I am relatively new to the Skyrim modding front, so I really do not know everything there is to do with skeletons. This definitely means animations and sounds as well, as I have only edited the skeletons. So I&#39;m fairly limited in what I know and what I can do right now. *\r<br />\r<br />********************\r<br />INSTALLATION PROCESS\r<br />********************\r<br />\r<br />Installation through Nexus Mod Manager is HIGHLY recommended, especially for customization options. You should know what to do in that area. Add the file on the NMM menu, then go to install and you&#39;ll be presented with options and such.\r<br />You can install manually if you really want to, but it just means you need to know what you&#39;re doing. When you open up the file you&#39;ll see many folders. The folders are organized in regards to the skeletons, from there you open up the desired skeleton folder and you&#39;ll then be presented with folders which are named appropriately. It becomes a simple copy and paste job after that. If you really do need to install manually and seriously need help in regards to manual installation, place a comment in the comments section and I will get around to assisting you in more detail. \r<br />\r<br />***\r<br />FAQ\r<br />***\r<br />\r<br />#1\r<br />You: \r<br />Why don&#39;t I have two weapons on my back, and a dagger on my boot, like in your pictures? I can only equip one but not both.\r<br />\r<br />Me: \r<br />Someone missed the recommended mods section above. You need Armed to the Teeth first, to allow all your weapons to appear at the same time. You also need the Vanilla pack. Not only that, depending on what weapons you&#39;re using, you need Zeridian&#39;s weapon patches.\r<br />\r<br />#2 \r<br />You:\r<br />When I equip my one handed sword, or dagger, I hear no sound&#33;\r<br />\r<br />Me:\r<br />In order to have your character draw their one handed sword from their back, instead of their hip, I used the same animation you use for two handed weapons. While this approach works, it also means for some reason equip sounds do not work for the &#39;new&#39; animations. Nockchaa had this same issue with his mod. I was hoping to be able to find a fix myself but it seems more &#39;complicated&#39; than that right now. Hopefully I can find out a way to fix this as it seems weapon sounds are assigned certain animations which also depend on the actual weapon. Right now, I don&#39;t know how to fix this. You can remove the &#39;custom&#39; animations if you want but at the cost of your character equipping from the wrong area, look further down in the FAQ. As for the Dagger equip animations, which oddly enough have sounds, those were the best I could get in relation to the Daggers position on the lower leg.\r<br />\r<br />#3\r<br />You:\r<br />Some of my weapons clip through my armour and/or boots. Some even clip through my head&#33;\r<br />\r<br />Me: \r<br />Unfortunately, in order to try and prevent hovering weapons and quivers and get the idea I had in my head the way I wanted it, I moved the weapons closer to your character. As a result, there was a higher risk of clipping. I did however attempt to try and have the best of both worlds and reduce the clipping but also have less hovering. I should note clipping and weapon hovering is also largely dependent on the armour and the weapon you are using. Some fit perfectly and do not clip, some do. If you have big hair, it is naturally going to clip. Little I can do about it. If Skyrim had hair with proper physics, then this would not be an issue at all. You would&#39;ve thought in this day and age basic hair physics would be a default function of any game.   \r<br />\r<br />#4\r<br />You: The tip of the dagger seems to &#39;drag&#39; on the ground.\r<br />\r<br />Me: Comes down to the size of the actual dagger. Skyrim&#39;s daggers, apart from the Iron Dagger, are quite big for &#39;daggers&#39;, or maybe the proportions of Skyrim&#39;s characters and such are odd. They remind me of smaller sized machetes. Regardless, this means they can&#39;t properly rest on your boot like I wanted them to. Each model is different I can&#39;t cater to one specific one or the others suffer. Maybe in the future I will add a variation which just moves the dagger to be above your knee. What you have now currently is the best I could manage before it looked weird and moved away from my original idea.\r<br />\r<br />#5\r<br />You: My weapons and quivers are blessed, they are hovering.\r<br />\r<br />Me: Like the issue above, it does largely depend on A) The weapon B) The Armour. Some quivers/weapons are nicely sized meaning they won&#39;t clip and will nicely sit wherever they are placed. Some will not. Some armours have their own invisible forcefield preventing weapon connection. Depending on the armour, sometimes it can actually move the weapons away despite my skeleton trying to move them closer. An example of this would be the Eisen or Silverlight armour. Try them out and see how your weapons do in fact move away from your character. I have no idea why this is, but I cannot do anything about it. If I did, it would mean all the weapons would be really clipping into your character when you are using something else, again depending on the armour and weapon.\r<br />\r<br />#6\r<br />You: My other two handed weapons are looking strange when I unequip them.\r<br />\r<br />Me: An unfortunate side effect of having all two handed weapons assigned to one position node. Until someone decides to separate two handed swords, hammers and axes, I once again cannot do anything. You are the mercy of the game and the only options you have before you. \r<br />\r<br />#7\r<br />You: I have a suggestion. Can I put forth such a thing?\r<br />\r<br />Me: Of course. If I&#39;m able to, have the time and slightly like the idea, I would not have an issue with making it a &#39;reality&#39;. \r<br />\r<br />#8\r<br />You: This mods skeleton conflicts with another skeleton I&#39;m using. I want to use some of this mods weapon positions, but I also want to use the other mod as it has a (example: dagger position) ________ I like. \r<br />\r<br />Me: Just ask and I&#39;ll see what I can do.\r<br />\r<br />#9\r<br />You: I&#39;d like to remove the equipping animations you added to this mod for the Dagger/One handed sword.\r<br />\r<br />Me: Go to your Data folder in your Skyrim folder. Then meshes/actors/character/animations. There you will find, depending on what you installed, 1hm_equip, 1hm_unequip, dag_equip and dag_unequip. Delete the desired files for the default animations to return. \r<br />\r<br />#10\r<br />You: Some of these weapon positions aren&#39;t realistic. I mean, we aren&#39;t able to carry everything around like Arnie in the Commando film. \r<br /> \r<br />Me: I know, but no one is forcing you to use them all, or use any of them. I have my own favourites but I figured other people might like the alternate positions I tried out, regardless of the aspect of realism. If you can let such things slip and allow your own imagination to take hold, it won&#39;t bother you. Just like how nothing seems to be holding up quivers or weapon scabbards. Strange... O___o\r<br />\r<br />\r<br />#10\r<br />You: MGR, I feel badass with my two swords lined up so nicely on my back. While Nazeem in Whiterun still gives me the impression he thinks he&#39;s above me, I know he secretly fears my presence when he sees the two hefty blades I carry&#33; \r<br />\r<br />Me:  That&#39;s great. I felt... roughly the same way once I managed to get the swords in a position I liked. However, unless you turn god mode on, it is possible you can still die so try not to get carried away. No lolligagging&#33; \r<br />\r<br />*******\r<br />CREDITZ - All original mods can be found on http://skyrim.nexusmods.com/\r<br />*******\r<br />\r<br />Dahaka002011/EwokJedi/Mergweq, for Armed to the Teeth, the AttT skeleton and the tutorial video which got me onto this path\r<br />Zeridian, for his AttT custom weapon mod featured and recommended in this readme\r<br />Ning99, for the original Female Skeleton\r<br />dDefinder1, for the original Realistic Ragdolls and Force mod and skeleton\r<br />Hl84, for the original Well Placed Weapons and Quivers skeleton\r<br />Isilmeriel, for his two LoTR blades featured in my screenshots\r<br />Bethesda, for whatever needs crediting when it comes to Bethesda\r<br />Nockchaa, for the Quiver adjustment on his mod\r<br />\r<br />***********\r<br />PERMISSIONS\r<br />***********\r<br />\r<br />If you choose to edit this mod, please be sure to notify me through PM and give the appropriate credits before you upload this to Nexus (which is the only place it should be right now) as your own. My edits are my own. Other ORIGINAL authors edits are THEIRS.\r<br />Follow the conditions below as well, as other authors have different permissions, especially AttT. \r<br />\r<br />Other user&#39;s assets\r<br /> Some assets in this file belong to other authors. You will need to seek permission from these authors before you can use their assets \r<br />Upload permission\r<br /> You cannot upload this file to other sites. You must contact me for permission, and other authors depending on their conditions.   \r<br />Conversion permission\r<br /> You are not allowed to convert this file to work on other games under any circumstances. Also depends on other authors conditions.  \r<br />Modification permission\r<br />You are allowed to modify my files and release bug fixes or improve on the features so long as you credit me as the &#39;original&#39; creator. In addition to other authors conditions. \r<br />Asset use permission\r<br /> You are allowed to use the assets in this file without permission as long as you credit me. In addition to other authors conditions. ",
  "categoryId": "55",
  "version": "2.0",
  "author": "Metal-Gear-REX",
  "createdUnix": "1335056085",
  "updatedUnix": "1336829775",
  "containsAdultContent": false,
  "uploadedBy": "Metal-Gear-REX",
  "primaryFile": null,
  "files": [
    {
      "fileId": "55249",
      "name": "Skyrim Weapon Positioning",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1763",
      "fileName": "Skyrim Weapon Positioning-15658.zip",
      "uploadedUnix": "1335061036",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bedd89da32cc2e121f73c0c648e39f9d9ea63ff1c4adb5044b4ec561791d1b83/analysis/1406827783/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Weapon%20Positioning-15658.zip?fid=55249&ttl=1535780245&ri=8192&rs=8192&setec=12cb474ba14fba27d43a33b38aa24c0a"
    },
    {
      "fileId": "56250",
      "name": "SWP skeleton_x117 Compatibility",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "32",
      "fileName": "SWP skeleton_x117 Compatibility-15658-1-0.zip",
      "uploadedUnix": "1335380573",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5251f6f0a2bb67fb84b32b5a328d299b4dcc07f4f9fa24e58bf0ad8f6edc96ba/analysis/1406840298/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SWP%20skeleton_x117%20Compatibility-15658-1-0.zip?fid=56250&ttl=1535780245&ri=8192&rs=8192&setec=9f28215e606eff87856ad935b53c2835"
    },
    {
      "fileId": "56251",
      "name": "SWP Nockchaa 1HD Weaps Quiver Compatibility",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "65",
      "fileName": "SWP Nockchaa 1HD Weaps Quiver Compatibility-15658-1-0.zip",
      "uploadedUnix": "1335380652",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/134a18cf5de414ee8c2b47122ed864e4ceee780ed322e4d461a6d50feb9aca5e/analysis/1406840343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SWP%20Nockchaa%201HD%20Weaps%20Quiver%20Compatibility-15658-1-0.zip?fid=56251&ttl=1535780246&ri=8192&rs=8192&setec=503c0c043967a5fbb9dd8713c89500b1"
    },
    {
      "fileId": "56279",
      "name": "SWP TwinSwords Lower Back Dagger Ning99 Skeleton DEFUNCT",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "SWP TwinSwords Lower Back Dagger Ning99 Skeleton DEFUNCT-15658.zip",
      "uploadedUnix": "1335388923",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/261234d159398db626f01cf5061b5ef2e293448f5524a9907f656e5f501b7eb6/analysis/1406840503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SWP%20TwinSwords%20Lower%20Back%20Dagger%20Ning99%20Skeleton%20DEFUNCT-15658.zip?fid=56279&ttl=1535780246&ri=8192&rs=8192&setec=5cae238a7fa58be222bd871390bd2951"
    },
    {
      "fileId": "56435",
      "name": "SWP TwinSwords Lower Back Dagger Ning99 Skeleton",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "13",
      "fileName": "SWP TwinSwords Lower Back Dagger Ning99 Skeleton-15658.zip",
      "uploadedUnix": "1335432476",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/a92a4de6c1d8d15e1e2c810da6615dcd55d4974d6400ad2ba3cc543f80fcddbc/analysis/1406841424/",
      "changelogHtml": " Vanilla skeleton path issue fixed. <br/> \n Well Placed Quivers Dagger only mesh fixed <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SWP%20TwinSwords%20Lower%20Back%20Dagger%20Ning99%20Skeleton-15658.zip?fid=56435&ttl=1535780247&ri=8192&rs=8192&setec=12072e4dbb58956bc23ce8eeea9f438c"
    },
    {
      "fileId": "60753",
      "name": "Skyrim Weapon Positioning v2",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1765",
      "fileName": "Skyrim Weapon Positioning v2-15658-2.zip",
      "uploadedUnix": "1336829775",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/3af0788080a8a2c85050ec6eab2fce85ff14496371f47a58a9197618d054e135/analysis/1406887088/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Weapon%20Positioning%20v2-15658-2.zip?fid=60753&ttl=1535780247&ri=8192&rs=8192&setec=a7641d873ccc1c18a70162346266bd97"
    }
  ]
}