{
  "modId": 15650.0,
  "modName": "Mountainside Castle Remade",
  "summary": "A better remake of the mod \\\"Mountainside Castle\\\"",
  "descriptionHtml": "This mod is essentially a remake of my first mod \\\"Mountainside Castle\\\". I\\'ve taken quite a bit more time with this and things should be much better.\r\n\r\nThis is a single-cell, meaning there are no loading screens when you travel the entirety of the castle. The entire mod comes with approximately 58 NPC\\'s, including villagers, servants and guards.\r\n\r\nThe castle contains:\r\n- Prison\r\n- Dining Hall, with throne in the same room\r\n- Armory (display room, forge, mannequins, training room)\r\n- Bedrooms (contains 3)\r\n- Servant\\'s Quarter\\'s\r\n- Kitchen\r\n-Tavern\r\n-War Room\r\n- Barracks\r\n- Library\r\n- Alchemy & Enchanting Labs\r\n\r\nThere are vendor NPC\\'s placed in the kitchen and Tavern section of the castle as well as a blacksmith down near the forge. The village also has a tavern which has a vendor, an alchemy shop and a blacksmith.\r\n\r\n\r\nTO INSTALL:\r\n1. Click \\\"Download with manager\\\" at the top of this page or in the files section.\r\n2. Once NMM starts up, it will download the mod. click on the mod once it\\'s finished downloading\r\n3. That\\'s it, just check and make sure that Mountainsidecastleesm and MSCesp are both activated.\r\n\r\n1. if that does not work or you do not have Nexus Mod Manager, Click \\\"Download Manually\\\".\r\n2. Once the file finishes its download, open up the rar file and you should see 2 files.\r\n3. If you installed Skyrim like the majority of people, navigate your way until you reach this location in the files \\\"C:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\"\r\n4. Make sure you\\'re in the Data folder of your Skyrim game, once there, place the 2 files from that rar you downloaded into this folder.\r\n5. Activate both files.\r\n6. That\\'s it you\\'re done.\r\n\r\n\r\nSpecial thanks to miketheratguy for helping me by testing the mod repeatedly to help make it better for release.\r\n\r\nAlso if any of you find bugs please let me know, I would certainly like to make this the best mod possible. Or if you happen to discover that some other mods don\\'t seem to function right with this mod, let me know as well.\r\n\r\n",
  "categoryId": "68",
  "version": "1.0",
  "author": "Megabliss7116",
  "createdUnix": "1335045631",
  "updatedUnix": "1335045631",
  "containsAdultContent": false,
  "uploadedBy": "megabliss7116",
  "primaryFile": null,
  "files": []
}