{
  "modId": 15666.0,
  "modName": "Daedric Armor - without pauldrons",
  "summary": "Standalone Version:\r\nCraft it, improve it, enchant it!.\r\n\r\nIt removes the huge pauldrons in the standard female and male Daedric armor and allows a better look when using hoods and bows (IMHO)\r\n\r\nIt uses HD textures created by GarryG, but once intalled you can use your own (if you know how to do it properly)",
  "descriptionHtml": "Stand alone/NMM version available.\r\nTo be completele clear:\r\nAs of version 1.0 GarryGs mod IS NO LONGER REQUIRED FOR THE MOD TO WORK. However this mod uses his textures wich are awesome and I highly recomend downloading his mod to have an even look on all daedric armors. (he has glowing and non glowing versions).\r\n\r\nCraft it, improve it, enchant it!.\r\n\r\nThe armor is a little lighter, tougher and pricey than regular daedric, it also needs almost the same ingredients as the regular daedric armor (-1 ebony ingot +1 silver ingot).\r\n\r\nI\\'ve tested it enough to release it, but of course, if anyone has a problem please let me know.\r\nIt still uses the same textures from GarryGs mod wich are HD and IMO much better than Vanilla.\r\n\r\nDESCRIPTION:\r\n-----\r\nV1.0 Standalone version NO ADITIONAL FILES REQUIRED!\r\n-----\r\nThe armor is called \\\"Daedric Silver set\\\"\r\nStandalone non replacing version. You can craft, improve and enchant the armor. Textures are still the ones from the gallery but any\r\nDaedric texture replacer should work if you know what to do (except maybe if you want the \\\"daedric glow\\\").\r\n\r\nINSTALLATION:\r\nUse Nexus mod Manager\r\nor\r\nExtract the contents of the file in the Skyrim\\\\Data directory\r\n\r\nNOTE:\r\nIll be more than glad to answer as many questions, comments and complaints (as long as they\\'re civil), just keep in mind that im still \r\nlearning, so please be as patient and respectfull as you can.\r\n\r\nTHANKS & CREDITS TO:\r\nGarryG, For his amazing work.\r\nBethesda, for creating such an amazing and engaging game.\r\n\r\n-------------------------------------------------------------------------------------\r\nREPLACER INFO BELOW: \r\n(this info applies to older versions (0.1 and 0.2) wich are replacers \r\nand will change ALL daedric armors in the game)\r\n-------------------------------------------------------------------------------------\r\n\r\n\r\nVer. 0.2 ADDED MALE REPLACER \r\nIs still a replacer but I promise I\\'ll do a craftable NMM friendly version soon. For those that dont mind replacing all Daedric Armors in game and were asking for a male version, well.. there you go!.\r\n\r\nENGLISH DESCRIPTION\r\n(Im not that good at english so excuse me with that)\r\n--------------------\r\nI love Daedric armor, but unfortunately the pauldrons are HUGE!, wich might get in your way on first person (if you play with an open FOV). In third person the biggest issue involves bows, because every time you draw an arrow it seems like the pauldrons will poke your eyes out!.\r\n\r\nSo, since I know a little 3DMAX and I\\'ve been playing and enjoying Skyrim for a while I decided that instead of whining and crying about it I should start learning about this wonderfull thing thats called modding.\r\n\r\nAnd after a while my respect for this comunity and all their members grew exponentially \\'cause this thing isnt easy at all.\r\n\r\nDESCRIPTION:\r\nThis is a very simple mesh replacer for the female version (male coming soon) of the \\\"Daedric Armor and weapon Improvement\\\" by GarryG\r\n\r\nIt removes the pauldrons in the standard female Daedric armor and allows a better look when using hoods and using bows (IMHO)\r\n\r\nI think it can be used as armor replacer for other mods (with the correct file renaming), \r\nbut havent tried it, so do it at your own discretion.\r\n\r\nREQUIREMENTS:\r\n\\\"Daedric Armor and weapon Improvement\\\" by GarryG\r\nLINK: http://skyrim.nexusmods.com/downloads/file.php?id=3104\r\n\r\nAny file archiver that opens 7zip files\r\n7zip (obviously the best choice)\r\nhttp://www.7-zip.org/\r\n\r\nINSTALLATION:\r\nSince this is an armor replacer, and Im new to modding it requires a manual install, but as I learn more about this i\\'ll be updating to a NMM compatible file.\r\n\r\n1.-Download and install \\\"Daedric Armor and weapon Improvement\\\"\r\n2.-Download my mod\r\n3.-Extract the contents to your skyrim data directory and replace both .nif files in the data\\\\mesh\\\\armor\\\\daedric directory.\r\n4.-Enjoy (and keep your eyeballs in place).\r\n\r\nNOTE:\r\nIll be more than glad to answer as many questions, comments and complaints (as long as they\\'re civil), just keep in mind that im still learning, so please be as patient and respectfull as you can.\r\n\r\nTHANKS & CREDITS TO:\r\nGarryG, For his amazing work.\r\nBethesda, for creating such an amazing and engaging game.\r\n\r\nSPANISH DESCRIPTION\r\n-------------------\r\nAdoro las armaduras Daedricas, pero desafortunadamente las hombreras son GIGANTES!, esto suele ser un problema porque se \\\"meten\\\" en la camara en primera persona (cuando se usa un FOV o angulo de vision abierto). En tercera persona, el mayor problema sucede cuando se utilizan arco y flecha, pues cada vez que se tensa el arco parece que la hombrera le va a sacar un ojo al personaje!.\r\n\r\nEntonces, ya que se un poco de 3DMAX y he venido jugando y disfrutando de Skyrim por un buen tiempo, decidi que en vez de chillar y criticar, deberia empezar a aprender acerca de este maravilloso mundo del modding.\r\n\r\nY lo primero que paso fue que mi respeto por esta comunidad y todos sus miembros crecio exponencialmente porque no es nada facil hacer esto.\r\n\r\nDESCRIPCION:\r\nEste es un remplazo de modelo muy simple, para la version femenina (pronto la masculina) de \\\"Daedric Armor and weapon Improvement\\\" de GarryG.\r\n\r\nElimina las hombreras de las armaduras daedricas en personajes femeninos dandole un mejor \\\"look\\\" cuando se utilizan capuchas y archo y flecha\r\n\r\nCreo que el modelo se puede utilizar con otras texturas pero no lo he intentado, asi que si quieren intentarlo lo hacen bajo su propia responsabilidad.\r\n\r\nREQUERIMIENTOS\r\n\\\"Daedric Armor and weapon Improvement\\\" by GarryG\r\nLINK: http://skyrim.nexusmods.com/downloads/file.php?id=3104\r\n\r\nCualquier programa de compresion que soporte archivos 7ZIP\r\n7zip (obviamente la mejor opcion)\r\nLINK: http://www.7-zip.org/\r\n\r\nINSTALLACION:\r\nya que este es un remplazo del modelo 3D y debido a que soy nuevo en el tema, se requiere una instalacion manual, pero a medida que aprenda mas,\r\nsubire una version compatible con el NMM.\r\n\r\n1.-Descargar e instalar \\\"Daedric Armor and weapon Improvement\\\"\r\n2.-Descargar mi mod\r\n3.-Extraer los contenidos al directorio skyrim\\\\data y reemplayar los 2 archivos .nif en el directorio data\\\\mesh\\\\armor\\\\daedric \r\n(no conozco la estructura de directorioss en instalacion castellana, asi que no puedo dar soporte en ese caso)\r\n4.-Disfruten\r\n\r\nNOTE:\r\nEstare mas que complacido de atender sus preguntas, comentarios y quejas (mientras sean decentes), solo tengan en cuanta que aun estoy aprendiendo, asi que por favor sean tan pacientes y respetuosos como les sea posible.\r\n\r\nAgradecimiento y credito a:\r\nGarryG, For his amazing work.\r\nBethesda por crear un juego maravilloso y atrapador.",
  "categoryId": "54",
  "version": "1.0",
  "author": "JIM_SLIDER",
  "createdUnix": "1335074993",
  "updatedUnix": "1335161831",
  "containsAdultContent": false,
  "uploadedBy": "SLIDER78",
  "primaryFile": null,
  "files": [
    {
      "fileId": "55281",
      "name": "Daedric Armor-without pauldrons",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "124",
      "fileName": "Daedric Armor-without pauldrons-15666.7z",
      "uploadedUnix": "1335075267",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/89c7146ac65ca2d2f15feba41f606d6c054dd73ddc25632b72669e85c5fa6a10/analysis/1406827940/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Armor-without%20pauldrons-15666.7z?fid=55281&ttl=1535780256&ri=8192&rs=8192&setec=50a85ec2f39293b2c33ed8db8066e5bf"
    },
    {
      "fileId": "55395",
      "name": "Daedric Armor-without pauldrons - Male and Female",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "240",
      "fileName": "Daedric Armor-without pauldrons - Male and Female-15666.7z",
      "uploadedUnix": "1335114401",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/57ac4b6f5806a8f11bae25b27af6032b7aa8f7b86f35394e1672dec1307889de/analysis/1406828666/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Armor-without%20pauldrons%20-%20Male%20and%20Female-15666.7z?fid=55395&ttl=1535780256&ri=8192&rs=8192&setec=d569fa1aab4a0a311c487039aef42650"
    },
    {
      "fileId": "55573",
      "name": "Main File - Standalone Male and Female",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16049",
      "fileName": "Main File - Standalone Male and Female-15666-1-0.7z",
      "uploadedUnix": "1335161831",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/36a0cb101e0b9730e7a6b15043e50cf9d1501da29e5e4d80f8fa078171d6df85/analysis/1406830286/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File%20-%20Standalone%20Male%20and%20Female-15666-1-0.7z?fid=55573&ttl=1535780257&ri=8192&rs=8192&setec=d3c3c186a93e1eccc108d574ad804850"
    }
  ]
}