{
  "modId": 15710.0,
  "modName": "Advanced Armours",
  "summary": "What is included in this mod currently is Steel Plate Bows, Bonemold bows and arrows and armour + shield  (which is under Elven Smithing), Ironhide Armor under Hide Smithing, and Bonemold Ingots (made from bonemeal). Updates are regular.",
  "descriptionHtml": "This mod is a work-in-progress. What is included in this mod currently is Indoril Cuirass, Bonemold bows and arrows and armour + shield (which are all made under Elven Smithing), Ironhide Armor under Hide Smithing, Steel plate bows(under steel Smithing), Iron plate Helmet (under iron Smithing) and Bonemold Ingots (made from bonemeal). The \\'Advanced Armour Perk\\' IS needed to obtain these. Also note that all armours are craftable at the forge and are now added to the level list so you sould see some NPC using these items around lvl 20+.\r\n\r\nI am hoping to add more armour for both genders, and to add weapons, creatures and some new items to help you create your own armours. Please be aware also that though I am a noob, I am progressively getting better and hope this will show later in this mod.\r\n\r\nDuring your playtime, you may notice that your armours change. This is because I will update them when I feel the need to, for the purpose of enchancing them. (Though I do want to make the Bonemold armour more like Morrowind\\'s, for NOW this is the best I can do). Updates are hoping to be regular. Thank you! =) \r\n\r\nAlso on the steam Workshop >>> http://steamcommunity.com/sharedfiles/filedetails/?id=22067&searchtext=",
  "categoryId": "54",
  "version": "1.0",
  "author": "PandaPaws",
  "createdUnix": "1335116498",
  "updatedUnix": "1337087416",
  "containsAdultContent": false,
  "uploadedBy": "elkali",
  "primaryFile": null,
  "files": [
    {
      "fileId": "61459",
      "name": "Advanced Armor",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "82628",
      "fileName": "Advanced Armor-15710.rar",
      "uploadedUnix": "1337087416",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/d4329a8574494701ddeb928c0c40edafae2384016fbef2b9ee02e4bfa0f01bc3/analysis/1406894059/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Advanced%20Armor-15710.rar?fid=61459&ttl=1535780350&ri=8192&rs=8192&setec=6c550e89e0a27a9ce688adf53c28c28c"
    }
  ]
}