{
  "modId": 15737.0,
  "modName": "Deep Followers",
  "summary": "Adds followers that have stories behind them and interact with the world. Real characters instead of hollow fighting robots. WIP.",
  "descriptionHtml": "THIS MOD IS IN ALPHA but it has no bugs.\r\n_________________________________________________________________________________________\r\nDescription:\r\n\r\nFor now, this mod adds two essential followers to the game:\r\n\r\nElandil, Bosmer Ranger, located at New Gnisis Corner Club in Windhelm. He can cast a spriggan spell when in close range. If you want him to use the bow but also wants him to fight melee when the enemy is nearby, make sure to give a bow that is stronger than the melee weapon, otherwise he\\'ll go melee all the time. Good at One-Handed, Archery, Light Armor and Sneak.\r\n\r\nMora Marth, Breton Spellsword, located at Candlehearth Hall in Windhelm. She\\'s proficient at most destruction spells, but also uses her good old fashioned sword when things get to close quarters. She can heal herself when in need and can cast Chain Lightining when in a high level. Good at One-Handed, Heavy Armor, Destruction and Restauration.\r\n\r\nThe intention of this is mod is to have followers that \\\"matter\\\", not just some fighting robots. (unfortunatelly, it is what they are at this stage.)  They will talk, have a deep story, interact, and perharps maybe romance.\r\n_________________________________________________________________________________________\r\nW.I.P:\r\n\r\nI\\'m currently working on the quest to unlock Elandil as a follower. I\\'ll voice act him for the momment, but i\\'ll need your feedback on it because I have a Gisele Bündchen accent (well, maybe not so strong as hers).\r\n\r\n_________________________________________________________________________________________\r\nFuture:\r\n\r\n- Quests to unlock them as followers.\r\n- Complex and interesting stories behind them.\r\n- Loads of interaction with the Dragonborn.\r\n- Lots of interaction with the scenario, making comments, telling jokes, giving advices.\r\n- Interaction with quests, same as above.\r\n- Interaction between them.\r\n- Voice acting.\r\n- More NPC followers.\r\n_________________________________________________________________________________________\r\nRecommended:\r\n\r\nUFO - Ultimate Follower Overhaul [http://skyrim.nexusmods.com/downloads/file.php?id=14037]\r\nWhy? Because it is an excellent mod, allows you to have up to 15 followers, allows you to manage your followers skills and equipment and much more. Check it out.\r\n_________________________________________________________________________________________\r\nHelp Needed:\r\n\r\nWhile I do stuff in the CK, I\\'m not explendid at creating a nice storyline for the NPCs. Of course that with time something great will come out, but it would be helpful to have some lines ready for the characters.\r\nSo, if you want to create a story or sidequest for Elandil, Mora Marth or another follower i have not created yet, be my guest, I\\'ll use as long as it is interesting.\r\n\r\nI\\'ll probably need some voice actors aswell in the future. A nice microfone, an accent not so strong and a lot of free time and good will (cause once you get started, you\\'ll have to voice act everything until that one character is finished, and that may take months.) will do the trick. \r\n\r\nSo, to set things straight, if you\\'d like to help, I\\'ll need:\r\n\r\n- An interesting storyline for the characters. Must contain a small quest (8 steps max) to unlock the NPC as a follower, the biografy of the NPC and at least some 70 lines or more of dialogue. (This is just the basic dialogue. I plan on having MUCH MORE lines for each one of the characters.)\r\n\r\n- In the future, I\\'ll need voice actors. This is not urgent since the story lines are not completed yet.",
  "categoryId": "66",
  "version": "0.1",
  "author": "lelyanra",
  "createdUnix": "1335159679",
  "updatedUnix": "1335161865",
  "containsAdultContent": false,
  "uploadedBy": "lelyanra",
  "primaryFile": null,
  "files": [
    {
      "fileId": "55574",
      "name": "Deep Followers",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "42",
      "fileName": "Deep Followers-15737-0-1.7z",
      "uploadedUnix": "1335161865",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/88b3cb16aa0299c64ece347eb998541fdf6d9710766601caf8386466b6158f31/analysis/1406830287/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deep%20Followers-15737-0-1.7z?fid=55574&ttl=1535780402&ri=8192&rs=8192&setec=143f6bc9d45bc0bd8ab00d40623656d8"
    }
  ]
}