{
  "modId": 15758.0,
  "modName": "The Mace of Sauron",
  "summary": "Have you ever wanted to smack someone silly how about across the room to the wall and then into. Has your follower ever pissed you off to the point you just want them to fly away well read the message below agree and understand it and the continue to find out how to rane with the Mace of Sauron\r\n",
  "descriptionHtml": "read under news for the meaning of c at the end of latest versions\r\n\r\nHave you ever wanted to smack someone silly how about across the room to the wall and then into. Has your follower ever pissed you off to the point you just want them to fly away well read the message below agree and understand it and the continue to find out how to rane with the Mace of Sauron\r\n\r\n-How it works-\r\nThe Mace of Sauron is pretty strait forward if you’ve seen the first lord of the rings movie you already know what it douses. Sure it was the rings power then but here we don’t really care we just like through people off the throat of the world and watching them pass high hrothgar before touching once. If you really want a taste go to YouTube and fins the fellowship of the ring intro.\r\n\r\n-OMG thats overpower-\r\nactually yes and no\r\nyes its the dark lords mace what the hell do you expect and\r\nno because ive programmed it to about half the speed of your average mace.\r\n\r\n-News-\r\nDerangedhk417 has agreed to help in minor parts of mod\r\n\r\nforgot to update this i stoped updating this along time ago people but through many messees reading comments and just out of bordum ive decided that im going to continue this mod but uner a new name. becasue my last project of the closest balrog to date was shut down i decided it i didnt want my hours of wrok to go t waste so now im going to expand this mod to now your going to fight the balrog, sauron, saurmon, golom, and possible smog (its a game about dragons he wouldn\\'t make a list of hard to make. and rewards ranging from a skill to turn into the balrog the mace of sauron, sauroons armor saurons ring, sauromons staff and much more. and the best part new and custom skins and meshses all around.\r\n-instillation- \r\nExtract into your data folder or use nmm\r\n\r\n-how do I get the mace-\r\nOriginally for the small group who helped test there was a chest (location is different but still there for the lazy ones ad so you can dual wield) but now if you go to sky alter (dragon burial ground north of whiterun) and walk north you will find a door inside you will fight what is left of his army’s from the third era and then fight off with the big man himself for ultimate power. WARNING if you fight him strait up you can and WILL die bring lots of health potions I used 9 greater health potion just fighting him all minions dead. (NOTE:once sauron is dead hes dead he is unique and will not respawn unless you remove and the redownload the mod(or upgrade) i surgest at his death loot him.(may make him respawn once this mod is 100%done by my standerds)\r\n\r\n-change log-\r\n1.0\r\ninitial realease\r\n0.1-0.36\r\nso many change from base origin file at beta start i dont even want to think about it\r\n(origanal dungeon looks noting like this one)\r\n-Conflicting mods-\r\nNone plz post comment if you find one\r\n\r\n-still to come-\r\n[ ] Nazgul\r\n[ ] retexed mace\r\n[ ] new armor for sauron\r\n[ ] new dungeon to play with your new weapon and ring\r\n[ ] retexed ring\r\n[ ] better effects on ring (more like the one ring in the book series(slow time, invisibility, improve damage)\r\n[ ] bug fixes as they arise\r\n[ ] second version of the mod giving sauron the power he’s known for (aka making him hold the actual mace so he can punch you off a cliff like a rag doll)\r\n[ ] Epic fight music while in dungeon\r\n\r\n-Questions-\r\nsend me a private chat if you want permission or just post a bug conflict or other question in the comments I check and respond commonly.\r\n\r\nSpecial thanks to derangedhk417 for partnership in past and hopefully future.\r\n\r\nI plan this mod to make m last one look like a needle in a massive fargen haystack so please endorse and enjoy",
  "categoryId": "55",
  "version": "1.0c",
  "author": "Sorydrew",
  "createdUnix": "1335187487",
  "updatedUnix": "1335187615",
  "containsAdultContent": false,
  "uploadedBy": "Sorydrew",
  "primaryFile": null,
  "files": [
    {
      "fileId": "55640",
      "name": "Mace of Sauron Irealese",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "110",
      "fileName": "Mace of Sauron Irealese-15758-1-0.rar",
      "uploadedUnix": "1335187615",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7e5c8cb1bfb5e1b7280732fad75c974bc55b755d1617a64b0f92e9e3cf4a7706/analysis/1406830994/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mace%20of%20Sauron%20Irealese-15758-1-0.rar?fid=55640&ttl=1535780431&ri=8192&rs=8192&setec=b855f7140db74fdaa76c8ae14cbbf1bc"
    }
  ]
}