{
  "modId": 15762.0,
  "modName": "Celtic Katana - Lore-Friendly",
  "summary": "This mod aims to make InsanitySorrow\\'s Celtic Katana as lore-friendly as possible with help from the community",
  "descriptionHtml": "This project aims to make InsanitySorrow\\'s [url=http://skyrim.nexusmods.com/downloads/file.php?id=15389]Celtic Katana[/url] as lore-friendly as possible with the help of the community. So I\\'d appreciate any feedback =)\r\n\r\nInstallation:[list]\r\n[*] Simply load with NMM or extract manually into Skyrim\\'s data folder.\r\n[*] If you wish to pick another colour. Browse the \\\"Colour\\\" folder and paste the respective \\\".esp\\\" into the \\\"data\\\" folder.\r\n[/list]\r\n\r\nAcquisition (spoiler):[list]\r\n[*] Just like the original, the weapons are crafted at the forge.\r\n[*] Alternatively, you can use the the console to get the weapons. Use the \\\"help\\\" command to get the ID codes, then \\\"player.additem\\\" to get the weapons. The weapons are called: Nordic Katana, Nordic Dai-Katana, Nordic Tanto.\r\n[/list]\r\n\r\nChanges from the original mod:[list]\r\n[*] Renamed weapons to respect lore.\r\n[*] Added flavour description.\r\n[*] Removed other coloured versions and left the most plausible style, giving it a more unique feel and unclogging the forge. Optionally, you can still chose the colour by replacing the *.esp file manually. A NMM install wizard might be added later for this in the future.\r\n[*] The reach of the Dai-Katana was the same as a one handed sword. The length was changed to match two handed swords.\r\n[*] Cleaned up any excessive entries, particularly ones that may conflict with other mods, namely Dawnguard and Heartfire (Worldspace: 0000003c).\r\n[/list]\r\n\r\nLore:[list]\r\n[*] The mysterious Akaviri were Men from the Akavir continent, who are believed to have disappeared because of conflicts with the the vampiric snake-folk of Tsaesci.\r\n[*] Little is known about them other than the fact that they seem to heavily mirror Earth\\'s Asian culture through their buildings, armour and weapons, like the katana.\r\n[*] However, despite similarities, note that the game does not take place on Earth, so there is no Asian continent or culture in the game lore, neither is there any Celtic civilization or culture.\r\n[*] Anyway, it is well known that the Akaviri have invaded Tamriel on numerous occasions throughout history, leaving much of their legacy behind.\r\n[*] On one such occasion, after the Akaviri raiders had been defeated, Emperor Reman recruited many of them into his service. Some even served as chief advisors, administrators and military trainers.\r\n[*] Thanks to the Akaviri, the restructured Imperial legions easily overwhelmed almost every region in Tamriel.\r\n[*] The katanas and dragonscale armour came from Akavir, as did the banners and military dress of Septim\\'s shock troops, the renowned Blades. The Blades\\' armour is itself a combination the Imperial and Akaviri armour.\r\n[*] After countless attempts, the smiths finally manufactured a set of deadly blades that mastered Nordic and Akaviri fine craftsmanship in harmony.\r\n[/list]\r\n\r\nTo do:[list]\r\n[*] Consider implementing Lorecraft compatibility. Crafting Akaviri Weapons would require reading a book. Crafting Nordic/Akaviri weapons would require learning the regular steel weapons from Lorecraft and the Akaviri book.\r\n[/list]\r\n\r\nCredits:[list]\r\n[*] InsanitySorrow for Celtic Katana v1.2\r\n[*] The Elder Scrolls for the assets\r\n[*] Wikia, UESP and the community for the lore\r\n[*] TES5Edit and the Creation Kit for the tools of the trade\r\n[/list]",
  "categoryId": "55",
  "version": "0.5",
  "author": "Cutz",
  "createdUnix": "1335191509",
  "updatedUnix": "1351462965",
  "containsAdultContent": false,
  "uploadedBy": "Cutz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "55773",
      "name": "v0_3_3b",
      "version": "0.3.3b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6776",
      "fileName": "Celtic Katana - Lore-Friendly-15762.7z",
      "uploadedUnix": "1335221691",
      "modVersion": "0.3.3b",
      "virusScanUrl": "https://www.virustotal.com/file/eae88ecb24389a415c3036a24ef5811032ed0a259d76fc4cbd0dd91cf76acef5/analysis/1406832668/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celtic%20Katana%20-%20Lore-Friendly-15762.7z?fid=55773&ttl=1535780436&ri=8192&rs=8192&setec=9fdcdc5e550389006bef6632098cc554"
    },
    {
      "fileId": "96346",
      "name": "v0_5",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6778",
      "fileName": "Celtic Katana - Lore-Friendly-15762-0-5.7z",
      "uploadedUnix": "1351462965",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/f59c5cafc7d03d6d3c55b585ead91afff3b641b215e1847472bb8e3644ac0514/analysis/1407239827/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celtic%20Katana%20-%20Lore-Friendly-15762-0-5.7z?fid=96346&ttl=1535780436&ri=8192&rs=8192&setec=5b9d8c1a1fc0caebfc10aa25e7aa4786"
    }
  ]
}