{
  "modId": 15777.0,
  "modName": "Lucien Lachance - Spectral Assassin NO GHOST",
  "summary": "As the title says, this is a \\\"remake\\\" of the Spectral Assassin to look like Lucien Lachance in Oblivion. Not my idea, just a remodeling of Real Lucien MOD.",
  "descriptionHtml": "ENGLISH:\r\n\r\nThis is a MOD which change the appearance of the Spectral Assassin into a human Lucien Lachance. This is not my idea, the original is here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11695\r\nNow, the Spectral Assassin has his proper name (Lucien Lachance) and he dress a black robe with the gauntlets and boots from the Ethereal Armor (Dark Brotherhood). I give him the Blade of Woe and better Stats, so in combat he\\'s better than before.\r\nIf you have a problem with this one, report me the issue, but I\\'ve tested this personally.\r\nYou need to activate just ONE ESP, not both of them. If you prefer the old Lucien, activate the LucienLachance.esp, if you prefer to seen his face and hair, activate the LucienLachance(NoHood).esp\r\nThat\\'s it. Thank you ^^\r\n\r\n\r\n\r\nESPAÑOL:\r\n\r\nBien, éste es un MOD que te permitirá ver al Asesino Espectral sin su textura fantasma y vestido como el miembro de la Hermandad Oscura que antes fuera en Oblivion: Lucien Lachance.\r\nLe he cambiado el nombre al suyo propio, le he puesto los guantes y las botas Etéreas de la Hermandad Oscura junto con una túnica negra (y, según el ESP que decidas activar, le verás con o sin capucha). Ahora tiene un arma mejor y unos atributos que le hacen más fuerte así que en combate no se te morirá a la primera de cambio.\r\nPara tener a Lucien con capucha activa el esp normal, para verle mejor la cara y el pelo, activa el esp en el que pone (NoHood).\r\nCualquier duda o problema me lo comentáis.\r\nPor cierto, ésta no es mi idea, el original está aquí, yo sólo lo he mejorado un poco:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11695\r\nGracias ^^\r\n",
  "categoryId": "66",
  "version": "",
  "author": "CathyLink",
  "createdUnix": "1335202417",
  "updatedUnix": "1335202481",
  "containsAdultContent": false,
  "uploadedBy": "CathyLink",
  "primaryFile": null,
  "files": [
    {
      "fileId": "55702",
      "name": "Lucien Lachance",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Lucien Lachance-15777-1.rar",
      "uploadedUnix": "1335202481",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5bf595ead0968609108dc9de775e37d74e24578e0db487211dd77bc760877404/analysis/1406831728/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lucien%20Lachance-15777-1.rar?fid=55702&ttl=1535780478&ri=8192&rs=8192&setec=0ab2c26e6f76be7e1dd38e87323959ce"
    }
  ]
}