{
  "modId": 15788.0,
  "modName": "Dwemer style Player House",
  "summary": "Dwemer style player house currently in early Alpha, and just designing the inside at the moment.",
  "descriptionHtml": "Dwemer style player house.\r\n\r\nThis is my first mod, and therefore I am going to be putting a lot of work into this, and also I will be experimenting a lot. That means that nothing you will be seeing at the moment will ever be final, and not untill I actually fully release this mod is it going to be fully done.\r\n\r\nCurrent Status :\r\n\r\nI have currently made an outline for how big I want it to be complete with a cave and large hallways to both an upcomming balcony and a future basement. Also I am currently working on designing the interior and could use some feedback on what you feel is necessary and what you would like to see beeing done in this dwemer style home!\r\n\r\nThere is no exterior and I don\\'t know exactly where I am going to put it yet, if you have some suggestions, please do leave it in the comments!\r\n\r\nThis also means that there is no way to enter it without using the console command : \\\"coc newmap\\\"\r\n\r\nI have thought about quests and npcs for this area, however since I have no experience with either of these features if anyone could help me with this I would be forever grateful!\r\n\r\nREMEMBER!\r\nI am not done, this is only a very early alpha to show you what my plans are for how big it will be, what style it is, and a request for any help that you can give me would be awesome!\r\n\r\n",
  "categoryId": "67",
  "version": "0.1",
  "author": "Andelanoth",
  "createdUnix": "1335219130",
  "updatedUnix": "1335219240",
  "containsAdultContent": false,
  "uploadedBy": "Andelanoth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "55768",
      "name": "Dwemer Style Player House",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Dwemer Style Player House-15788-0-1.rar",
      "uploadedUnix": "1335219240",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/1d77ca49d92df769bae5e6ff37fbd01a7d3980c8f54ec778b67877aa19212a54/analysis/1406832612/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwemer%20Style%20Player%20House-15788-0-1.rar?fid=55768&ttl=1535780497&ri=8192&rs=8192&setec=a4c674fa6243d32bb6c4973ae20e26fb"
    }
  ]
}