{
  "modId": 15801.0,
  "modName": "Berts Breezehome Cellar",
  "summary": "Adds an open (no loadscreen) cellar to Breezehome with a full set of crafting and smithing tools plus displays for armour, weapons, dragon masks and dragon claws!",
  "descriptionHtml": "Final, final version posted! (No, really!! Definitely!! Probably!?)\r\nThis version fixes a small bug which made the mannequins keep undressing! I also took the opportunity to add a default to the mannequins and bookshelf functions so any books already in the shelves when the function is first used will now be sent straight to the book chest & any armour on mannequins will be sent to the Light Armour chest the first time, from then on any armour added using the new function will be sent back to the chest it came from! If upgrading from V.1.3 just uninstall that and install this, if you have any heavy armour on mannequins and use the self-dressing function, remove it first or it\\'ll be put in the Light Armour chest!\r\nIf upgrading from a previous version (1.2 or lower) a clean install will be [u]required[/u]. Load up all goods from the cellar, empty all new bookshelves and chests in the old potions room, grab your keys from the chest by the fire-pit and any bug jars you may have placed in the grotto then exit the house, make a full save and quit, uninstall the previous version, reload/continue and save again to remove the old version from your save-file then quit again and install the new version.\r\nIf installing for the first time, just install using NMM or copy [u]all[/u] files from the data folder in the zip into your game install data folder. No other requirements!\r\nOff you go!\r\nbert\r\np.s. Be sure to read [u]all[/u] the info below!!\r\n\r\n[u]Latest News!![/u]\r\nWell, here it is folks, the latest, and Final update 1.3!\r\nThis version no longer contains the greenhouse for compatibility with my Remodeled mod, you can still grab the latest (and also final for that one too!) version at the link below!\r\nThe garden grotto is still included and has a slight upgrade, just to let you have a sneek-peek at what to expect, while the cellar [u]is[/u] finished the grotto will still be upgraded and posted in the Updates section and will just replace the grotto files without touching the house itself!\r\nThe grotto is [u]not[/u] pre-selected during install, be sure to tick it if you want it (not to be ticked if using the Remodel!). There is no longer a patch for the grotto, you now have to collect the bug jars!!\r\n\r\nA note to translators! Due to TESVSnip being pulled I am still exploring different methods to make translating as easy as possible, for now I\\'m afraid the only way is to open the 1.3.esp in the CK and translate all the message boxes, trigger (activator) names and container names! In the mean-time if anyone wants to translate the readme I would be gratefull and it would be added to the bottom of the page and added to the Misc section on the Files tab!\r\nIMPORTANT !!!!!!!!!!!! BE SURE TO READ ALL INFO BELOW !!!!!!!!!!! IMPORTANT\r\n---------------------------------------------------------------------------------------------------------------------------\r\n\r\n[img]http://i1144.photobucket.com/albums/o487/Stuart_Goddard/BBCNewLogoW.jpg[/img]\r\n\r\n[color=\\\"#00FF00\\\"][font=\\\"Comic Sans MS\\\"][size=\\\"5\\\"]Bert\\'s Breezehome Cellar[/size][/font][/color]\r\n[color=\\\"#00FF00\\\"]\r\nAlso Available in:\r\n[url=http://skyrim.nexusmods.com/mods/17975]Polish by dopalacz[/url] V.1.2 Only\r\n&\r\n[url=http://skyrim.nexusmods.com/mods/22248]Spanish by DaWul[/url] V.1.1 Only\r\n-------------------------------------------------------------------------------------------------\r\n\r\nOther Mods By Me!\r\n\r\n[url=http://skyrim.nexusmods.com/mods/8922]Berts Breezehome Remodeled[/url]\r\nA full remodel of Breezehome including interior, exterior and cellar & so much more!\r\n\r\n[url=http://skyrim.nexusmods.com/mods/15806]Berts Breezehome Garden[/url]\r\nA new garden grotto added to Whiterun available as a standalone or connected to the vanilla Breezehome & is also pre-packed with my Cellar & Remodeled mods.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/29942/]Berts Breezehome Greenhouse[/url]\r\nA stand-alone version of the greenhouse thats included with Berts Breezehome Remodel\r\n(A highly recommended addition for this mod!!!!)\r\n\r\n[url=http://skyrim.nexusmods.com/mods/29665]Remo\\'s Display Spells[/url]\r\nA collection of spells aimed specifically at making your house a home.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/25239/#]Berts Hearthfire Dairy Goods Upgrade[/url]\r\nAn upgrade for the dairy goods side of the Hearthfire DLC.\r\n-------------------------------------------------------------------------------------------------\r\n\r\nBert\\'s Breezehome Cellar - Final Version 1.3\r\n\r\nI know that what follows is a serious wall of text but it is HIGHLY recommended you take a few minutes to read through it all. Falure to do so will likely result in a loss of goods!!!!!!\r\n\r\nThis mod adds an open (no loadscreen) cellar to Breezehome in Whiterun.\r\nIf upgrading from a previous version, this mod needs a clean install!\r\nLoad up everything from the cellar, the bookshelves & chests in the old potions room and the key chest by the front door and place it in any of the original containers in the house, grab any bug jars you may have placed in the grotto, exit the house and make a full save then quit and uninstall the previous version, reload/continue and save again to remove all traces of the previous version from your save-file then install this newer version and off you go!\r\n\r\nChanges to the vanilla house:\r\n\r\nThe potions room is now a small library (potions room must still be bought from the steward for the new bookshelves and chests to appear!) unless you are using Hearthfire and have changed it to a child\\'s room, in which case the new bookshelves and chests automatically disable themselves. Be aware that if you change to the childs room any books & notes already in these will most likely be lost! Be sure to empty them first!!\r\nThe original chest in the old potions room is now designated as the Autosort chest for books as this chest remains even if the room has been changed to a child\\'s room. All bookshelves are now linked to this chest, when a bookshelf is crouch-activated you will be presented with a menu to select which type of books you want displayed on that particular shelf and when you exit this shelf will be AutoFilled with the selected type. NOTE: The first time you use this function on any shelf, that shelf MUST be empty, else those books will be lost!!! Once you have used the function at least once any further uses will automatically move the current books back to the book chest. This function is NOT compatible with the Unlimited Bookshelves mod!!\r\nThe barrel from under the stairs has been moved next to the bookshelves by the fire-pit for quickly dropping off goods that wont Super-Sort or you just don\\'t want stored at the moment.\r\nOn top of the barrel you will also find the Super-Sorter which, once you have set all the Autosort lists, will automatically store all your goods into the appropriate containers.\r\nIncluded with the Super-Sorter is the Instant Inventory Restocker which you can activate and add up to 20 different items from the following chests, Light & Heavy Arrows, Potions, Poisons, Special Brews, scrolls, Soul-Gems. Once added, when you activate the Super-Sorter, these goods will be removed from your inventory and stored in the appropriate containers then the amount you selected when you added them to the IIR will be replaced in your inventory so you always have the desired amount of consumables!\r\nA small chest has been placed on the bookshelf for storing used keys.\r\nClaude. Claude is your new pet mini Troll! He likes to hang around the fire-pit where he has a bail of bedding hay, a bowl of food and a bowl of water. Claude can be turned off & on in the Master Ledger under the cellar stairs. When turned off his bedding and bowls will also disappear!\r\nLess noticable changes:\r\nLydia now uses the whole house including the crafting benches in the cellar instead of just sitting at the end of your bed all the time (which she still likes to do now and again!).\r\nThe stairs no longer catch 2 or 3 from the top!\r\nThe fire-pit no longer causes shadow striping!\r\n\r\n\r\nThe Cellar:\r\nCrafting/Smithing.\r\nThe cellar contains a full set of crafting/smithing stations, including the Potions Table from upstairs. Each crafting/smithing station is connected to the appropriate chests and will AutoGet your crafting/smithing materials when activated and return them to their chests when done!\r\nThe Smelting Pot will AutoGet from the Ore Chest, the Anvil, Sharpening Wheel & Armour Ugrade Bench will AutoGet from all the smithing area chests except the Ore chest and will also AutoGet Daedra Hearts, Hawk Feathers & Hagraven Feathers from the Ingredients Barrel, the Tanning Rack will AutoGet from the Pelts & Leathers Chests, the Enchanting Table will AutoGet your Soul-Gems, it will also take count of how many Soul-Gems you have to begin with and replace that amount in your inventory when done, the Potions Table will AutoGet from the Ingredients Barrel.\r\n\r\nMannequins.\r\nThere are a total of 10 Mannequins in the cellar, 4 full sized and 6 Mini Mannys. Each Mannequin can be crouch-activated to open a menu which will allow you to select from 10 default types of armour and you can also set 5 user defined sets for it to wear. When setting a user defined set you will first be asked what type of armour it is, Light or Heavy, the Mannequin will not AutoGet armour from the Enchanted chests, you will then be asked to close the Mannequin and another, hidden, chest will open and you must then place the armour first (you must have the desired set in your inventory during setup), after the armour has been added you can then add helmet, gauntlets, boots and shield in any order, this is just so the manny doesn\\'t end up naked except for a pair of boots as it only checks that the first item in the list exists! You must then place that set in the selected chest and from then on any manny can use that user set! There is also a Random option which, when selected, will have the manny roll a dice (so to speak) and select any of the defaults or user sets (if any are set) to wear. If the manny rolls a set that isn\\'t available it will roll again a maximum of 10 times, if no sets are available it will keep what it has on (if it is not naked) and notify you that there were \\\"None Found!\\\". It is recommended not to use this function on too many mannys untill you have a LOT of armour! When set to Random the manny will also roll the dice every time you enter the house and switch to a new set allowing you to display many armour sets on a limited number of mannequins! NOTE: Like the bookshelves when using this function for the first time the current manny MUST be naked else you\\'ll lose it\\'s current armour!!! Once this function has been used at least once on the current manny subsequent uses will return the current armour back to the last chest it AutoGot from!\r\nDue to a loss of frame-rate when being played on lower-end systems when near the mannequins there is also a switch in the Master Ledger to turn off the Mini Mannys. Be sure to remove any armour before-hand or it will be lost!!! If the manny is set to random select an unused user set or select a default set and remove by hand to stop it trying to wear armour when disabled so none get lost!!\r\n\r\nWeapon Racks/Plaques:\r\nThere are a total of 50 standard weapon racks in the cellar, 10 of which are designated for what I like to call the \\\"Wall Of Staffs\\\", though any weapon can be placed in them. The remaining 40 are split into groups of 5 per wall segment, above each of which are dual weapon/shield plaques. Each \\\"segment\\\" has a button which, when pressed, will provide a menu from which to choose between 8 default weapon types, again these do not AutoGet from the enchanted chests! Once an option is selected the 5 weapon racks, both weapons on the dualweapon/shield plaque and the appropriate shield type will be AutoGot from the chests and placed on the racks/plaques. Unlike the bookshelves and mannequins, if there are already weapons/shields on these they will not be lost though you will end up with multiple items in the same place, just hit the button again and select \\\"Clear\\\" to replace the weapons/shield in their chests then remove the existing weapons/shield by hand and reset the display.\r\nThere are a further 2 dual weapon/shield plaques & 2 single weapon plaques in the smithing area.\r\nAs well as all that there are also 12 Dagger Display Cases, these will take any weapon but, other than a few of the maces, anything else will just stick through the sides!\r\n\r\nAutoSorts.\r\nIn the house the only chest that has AutoSorts is the book chest. In the cellar all chests will AutoSort except the Smithing Aids, Enchanting Aids & Potions Aids chests.\r\nOf the chests that do AutoSort, to start with, all chests start with empty lists, these lists can be filled by hand by selecting \\\"Add\\\" in each chests options menu but most have base lists which can be filled either by selecting \\\"Fill\\\" in each chests option menu or by using the Master Ledger to fill all lists in one go! I advise using the Master Ledger to get them all out of the way, though I will point out that this takes my system about 5 minutes!! There are a LOT of lists! Lists 0 to 10 take the longest as these are the weapons & armour which are quite large! Once the lists are filled with the base objects you can then add or remove any item to any list. Due to the way the lists work adding items takes no time at all but removing items means the list has to be copied to a temp list, skip the object you are removing, finish copying the list across then copy the whole thing back again (thanks Bethesda!!) which can take a while for armour and weapons that you want to be wearing/carrying, but once done it\\'s done! You will find that not everything is added to the lists straight away, this is because I avoided adding mission objects, which would break the AutoSorts because they can not be removed from your inventory, and unique/one-off items as I thought you might like to be aware that you\\'ve bagged something unique! The game can not tell the difference between standard unenchanted weapons/armour or player enchanted so these items all go into the standard chests!\r\nAny player made potions/poisons must be added to the potions/poisons chests list by hand as the game doesn\\'t recognise them as such without using keywords which would break the ability to remove things from the lists!\r\nSome of the chests do not have default lists as these are for things that may be added/used by mods. These chests are:\r\nHorn/Feather/Tusks chest & Misc Smithing 01/02 chests in the smithing area, the Paper chest above the Enchanting Table and the Special Brews chest on the potions shelf.\r\nAll chests that have AutoSort menu\\'s can have items added or removed to/from their lists and these lists are then used by the Super-Sorter!\r\nOnce you have set all your lists to your preferences you can then disable/enable the AutoSorts in the Master Ledger so you do not have to close the AutoSort menus every time you open a chest, though the Super-Sorter will still use the lists and the AutoGets will still AutoGet at the crafting/Smithing stations!\r\n\r\nDragon Claws, Masks & Skull Keys.\r\nOn one side of the cellar is a set of shelves with spaces for you to display these goodies collected throughout the game. The Dragon Masks each have their own bust and the Dragon Claws and Skull Keys can either be placed by hand in their respective places or you can just hit the button for all that you have to be set out instantly!\r\n\r\nThe Master Ledger.\r\nThe Master Ledger is the control center for this mod and alows you to customize certain aspects as explained above!\r\nTo recap:\r\n\r\nClaude------------------Turns Cluade and his bedding & bowls on or off.\r\nAutoSorts¬\r\n----On/Off--------------Turns the AutoSort menus on all of the chests on or off.\r\n----Fill All Lists------Fills all Autosort lists with default items (for those lists which have default items!).\r\nMini Mannys-------------Turns the Mini Mannys on or off\r\n\r\nAnd that\\'s about it (I think!).\r\nIf you have any problems/questions head to the comments section!\r\n\r\nHave fun, and...\r\nA simple rule to remember when using the new functions on the bookshelves & manneqiuns, if in doubt clean it out!\r\n\r\nMany thanks to IsharaMeradin for her easy-to-follow guide for 1st/3rd person checking!\r\nhttp://skyrim.nexusmods.com/mods/25936#content\r\nLazyTomcat for his excellent translations!!\r\nqlhaele for making his excellent autosort scripts available, which i then shamelessly\r\nand ruthlessly tore apart and rebuilt in my sledgehammer scripting!!!¬\r\nAutomatic Item Storage\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=12468\r\n\r\nI hope you enjoy using this mod as much as i have making it!!\r\nberticus0001 ;-)\r\n\r\n[center]A look at an earlier version by robiehn[/center]\r\n[center][youtube]AcwF5LLG05o[/youtube][/center]\r\n[/color]",
  "categoryId": "67",
  "version": "Final.1.3.1",
  "author": "berticus0001",
  "createdUnix": "1335236231",
  "updatedUnix": "1359327234",
  "containsAdultContent": false,
  "uploadedBy": "berticus0001",
  "primaryFile": null,
  "files": [
    {
      "fileId": "55812",
      "name": "Berts Breezehome Cellar",
      "version": "BBC.1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "30",
      "fileName": "Berts Breezehome Cellar-15801.zip",
      "uploadedUnix": "1335236382",
      "modVersion": "BBC.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/05f7eaa09d75a8f34647507e22b35821605932041b14b2d99ed6faf2022c9238/analysis/1406833144/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Berts%20Breezehome%20Cellar-15801.zip?fid=55812&ttl=1535780518&ri=8192&rs=8192&setec=7c957ae5d8dc3fcbc4075c0373271f87"
    },
    {
      "fileId": "55813",
      "name": "Berts Breezehome Cellar German Language Addon",
      "version": "BBC.G",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Berts Breezehome Cellar German Language Addon-15801.zip",
      "uploadedUnix": "1335236495",
      "modVersion": "BBC.G",
      "virusScanUrl": "https://www.virustotal.com/file/28280a578883baa382861fb69562880bc52da20173a754cc64977a08530f320e/analysis/1406833144/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Berts%20Breezehome%20Cellar%20German%20Language%20Addon-15801.zip?fid=55813&ttl=1535780519&ri=8192&rs=8192&setec=2bb0b44b5a028548056d93a214d8e294"
    },
    {
      "fileId": "65783",
      "name": "Berts Breezehome Cellar V_1_1",
      "version": "BBC.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1217",
      "fileName": "Berts Breezehome Cellar V_1_1-15801-BBC-1-1.7z",
      "uploadedUnix": "1338771335",
      "modVersion": "BBC.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9002cce1bf6accdda591a0f8bf95c4ab17261fbfa4a74903a7d87bb93a88edae/analysis/1406936482/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Berts%20Breezehome%20Cellar%20V_1_1-15801-BBC-1-1.7z?fid=65783&ttl=1535780519&ri=8192&rs=8192&setec=9e7706701d187814db33f52181ffcb23"
    },
    {
      "fileId": "81071",
      "name": "Berts Breezehome Cellar v_1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "917",
      "fileName": "Berts Breezehome Cellar v_1_2-15801-1-2.7z",
      "uploadedUnix": "1344793242",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/2d8840ebe9db8004a348d05344c7fb6b49568eb503883e42f3947712329c8d62/analysis/1407091745/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Berts%20Breezehome%20Cellar%20v_1_2-15801-1-2.7z?fid=81071&ttl=1535780520&ri=8192&rs=8192&setec=bf62d8601925ce32ae57214005ba3980"
    },
    {
      "fileId": "1000004328",
      "name": "Berts Breezehome Cellar Final 1_3",
      "version": "Final.1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "833",
      "fileName": "Berts Breezehome Cellar Final 1_3-15801-Final-1-3.7z",
      "uploadedUnix": "1358937498",
      "modVersion": "Final.1.3",
      "virusScanUrl": "https://www.virustotal.com/file/28cff0e7d7f5b7fc54bfbe7323d888c92ceda6da812a7598df0a52a2f4d05a22/analysis/1407374596/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Berts%20Breezehome%20Cellar%20Final%201_3-15801-Final-1-3.7z?fid=1000004328&ttl=1535780520&ri=8192&rs=8192&setec=e80f77d436c73f8d2226f45c0d94a063"
    },
    {
      "fileId": "1000005331",
      "name": "Berts Breezehome Cellar Final 1_3_1",
      "version": "F.1.3.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "829",
      "fileName": "Berts Breezehome Cellar Final 1_3_1-15801-F-1-3-1.7z",
      "uploadedUnix": "1359327234",
      "modVersion": "F.1.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/598ad7efb55eafb7a585cd696ab5ec3209a8695467f2a7f4dc2a90fa61f9c837/analysis/1407382760/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Berts%20Breezehome%20Cellar%20Final%201_3_1-15801-F-1-3-1.7z?fid=1000005331&ttl=1535780521&ri=8192&rs=8192&setec=32636d3d9fb32a664ae7f8d772b6654e"
    }
  ]
}