{
  "modId": 15809.0,
  "modName": "Racial Perks Instead of Skills",
  "summary": "Replaces the starting skill bonuses for each race with free perks.",
  "descriptionHtml": "[b]Racial Perks Instead of Skills[/b]\r\n(or, Clockwork\\'s Perky Races)\r\n\r\n[b] = Update Note = [/b]\r\nWhoops. So, if you have versions 1.0a or 1.0b, they likely don\\'t work. For all of the reading I did learning to use this clunky Creation Kit, no where did it say: \\\"Hey guess what, your mod totally works on your computer, but won\\'t work anywhere else, because we thought it would be hilarious to make scripts count as external assets that you have to pack separately. Shh, don\\'t tell anyone. It\\'ll be fun to watch people who have used other game toolsets fumble around like brainless idiots.\\\" \r\n\r\nI\\'m mostly certain I have 1.0c setup, working and in such a state that the mod manager will handle it properly. If not, well, there\\'s a lot more letters left in the alphabet, though I\\'m really hoping 1.0z will not be necessary.\r\n\r\n[b] = The Quick and Dirty = [/b]\r\nReplaces the starting skill bonuses for each race with free perks.\r\n\r\n[b] = Why it is? = [/b]\r\nEach race starts with bonuses in several skills.  While I appreciate Bethesda\\'s choice of not making any race the \\\"must have\\\" for any particular play style, I quickly found these bonuses entirely ignorable.  I felt they, to put it bluntly, suck.  To put it diplomatically, I am of the opinion that racial skill bonuses are not sufficiently conducive to expressing my character\\'s racial and cultural predisposition to an ability or vocation.  I am unimpressed that my Breton\\'s rich and mythical manmer heritage\\'s expertise in the forbidden arts of conjuration amounts to 5 minutes of power leveling when I wasn\\'t looking.  Yet on the flip side of the coin, neither would I like to feel that my Nord will always be the inferior Conjurer, simply for not having the genetic foresight of being born Breton.\r\n\r\n[b] = What it is? = [/b]\r\nWith the above in mind, I chose to drop the near-meaningless skill increases and replace them with something more meaningful, but still ultimately achievable by any race: Perks!  Redguards are natural warriors with unmatched prowess in small arms combat?  +10 in One-handed and +5 in Block skills?  Ha!  Wipe that and try two ranks of Armsman and one rank of Shield Wall instead.  Bosmer are peerless archers?  Not with a puny +10 to Archery they\\'re not.  Let\\'s replace that with two ranks of Overdraw.  Now they get a beefy +40% damage and are one step closer to all those other Archery perks.\r\n\r\nThis mod removes all racial skill bonuses and replaces them with those base-line perks at the bottom of the tree that no one really wants to take because they\\'re boring but we do so anyways because they\\'re so effective.  A +5 bonus equates to the first perk in that skill\\'s tree.  A +10 becomes two ranks in that perk, or both the Novice and Apprentice perks for trees that drag their first perk out into a lengthy train.  Yes, this means your +10 skills will grant perks for which you technically don\\'t qualify because of a low skill level.  Don\\'t fret, the game is perfectly fine with this so long as you are.\r\n\r\n[b] = What we get? = [/b]\r\nThe +35 worth of skill bonuses have been removed.  In their place, you get perks.  Those perks are:\r\n\r\n[list][*][b]Altmer (High Elves):[/b] Novice Illusion, Apprentice Illusion, Novice Alteration, Novice Conjuration, Novice Destruction, Enchanter, Novice Restoration\r\n[*][b]Argonian:[/b] Novice Locks, Apprentice Locks, Novice Alteration, Agile Defender, Light Fingers, Novice Restoration, Stealth\r\n[*][b]Bosmer (Wood Elves):[/b] Overdraw (2 ranks), Stealth, Alchemist, Agile Defender, Novice Locks, Light Fingers\r\n[*][b]Breton:[/b] Novice Conjuration, Apprentice Conjuration, Novice Restoration, Alchemist, Novice Alteration, Novice Illusion, Haggle\r\n[*][b]Dunmer (Dark Elves):[/b] Novice Destruction, Apprentice Destruction, Alchemist, Novice Alteration, Novice Illusion, Agile Defender, Stealth\r\n[*][b]Imperial:[/b] Novice Restoration, Apprentice Restoration, Shield Wall, Novice Destruction, Enchanter, Juggernaut, Armsman\r\n[*][b]Khajiit:[/b] Stealth (2 ranks), Alchemist, Overdraw, Novice Locks, Light Fingers, Armsman\r\n[*][b]Nord:[/b] Barbarian (2 ranks), Shield Wall, Agile Defender, Armsman, Steel Smithing, Haggle\r\n[*][b]Orc:[/b] Juggernaut (2 ranks), Shield Wall, Enchanter, Armsman, Barbarian, Steel Smithing\r\n[*][b]Redguard:[/b] Armsman (2 ranks), Novice Alteration, Overdraw, Shield Wall, Novice Destruction, Steel Smithing[/list]\r\n\r\n\r\n[b] = Installation = [/b]\r\nThere are no special, out of the ordinary installation measures here.  Both automatic and manual installs work and are similar to most other mods.\r\n\r\nIf you have the Nexus Mod Manager, there\\'s not much to it.  Click the \\\"Download with Manager\\\" button up top and [url=http://wiki.tesnexus.com/index.php/Installing_Mods_Using_NMM]follow the usual magic steps[/url].  This method comes recommended by myself and most of the community.\r\n\r\nIf you are installing manually, download the latest zip file and extract the \\\"Racial Perks Instead of Skills.esp\\\" and \\\"Racial Perks Instead of Skills.bsa\\\" files into your Skyrim Data folder (often found in your Steam installation folder under \\\"steamapps\\\\common\\\\skyrim\\\\Data\\\").  From the Skyrim launcher, choose \\\"Data Files\\\", place a check mark next to \\\"Racial Perks Instead of Skills\\\" and press OK.\r\n\r\n\r\n[b] = Q & A = [/b]\r\n[b]Q:[/b] Will this work with my existing saved game?\r\n[b]A:[/b] Yes, but it will not de-level the racial skill bonuses.  You will get the free perks in addition to them.\r\n\r\n[b]Q:[/b] Is this mod compatible with other racial mods?\r\n[b]A:[/b] To remove the skill bonuses, I had to edit the files for each player race.  Therefore, mods that also modify those races will conflict here.  The only changes I made were removing those starting skill bonuses, so if there\\'s some other race mod you really, really like, go ahead and load it later in the list.  You\\'ll just end up with both skill bonuses and perk bonuses.\r\n\r\n[b]Q:[/b] Does this mod conflict with any other mods?\r\n[b]A:[/b] You may have problems with mods that change how you start a new game.  The mod waits until the game grants you access to your skill menu to give the free perks.  In the default campaign, this happens when your hands are unbound.  If a mod does not lock these menus prior to letting you pick a race, you may end up with Nord perks instead.  I personally use \\\"Alternate Start - Live Another Life\\\" by Arthmoor ([url=http://skyrim.nexusmods.com/downloads/file.php?id=9557]link[/url]) without problems, but have not tested others.\r\n\r\n[b]Q:[/b] Will this work with custom races?\r\n[b]A:[/b] Not in the slightest.  It should have no meaningful effect on them what so ever.\r\n\r\n[b]Q:[/b] Will this unbalance the game?\r\n[b]A:[/b] It is capable of doing so, I suppose.  I would imagine that getting 7 free perks is more useful than getting 35 skill points, but less so than you might think.  It could potentially give you a leg up at the lower levels, but if it\\'s a perk of which you are making significant use, then you probably would\\'ve taken it by level 3 anyways.  I say just enjoy the extra breathing room and take a few more perks you might have passed over, just for the fun of it.  If you\\'re the type to make full use of every advantage given to you, you\\'re probably already one-shotting dragons on master difficulty and don\\'t need my help \\\"unbalancing\\\" Skyrim.\r\n\r\n[b]Q:[/b] Will having the extra possible skill-ups allow me to level beyond the maximum of level 81?\r\n[b]A:[/b] No.  Skill-ups contribute towards a level up based on the level of the skill.  Higher level skills are worth more.  By level 81, those 35 extra skill-ups ranging from 16 to 25 are just a drop in the bucking, and aren\\'t enough to reach level 82.\r\n\r\n[b]Q:[/b] What if I encounter a problem?\r\n[b]A:[/b] At this stage, this isn\\'t a highly tested mod and I\\'m not a big time modder.  I do my modding mostly for myself, and share bits and pieces as I feel I\\'ve made something someone might like.  I\\'m also pretty new to this whole thing.  So, if you think you found a problem, you likely found a problem.  Leave a comment on this page, or shoot me a message on the forums, and I\\'ll have a look.\r\n\r\n\r\n[b] = File History = [/b]\r\n[b]1.0d[/b] - April 25, 2012\r\n[list][*]Fixed a minor problem where by starting a game with this mod installed, saving prior to receiving the racial perks (ie, before you hands become unbound), uninstalling the mod, then continuing the game could leave a lingering loop behind.\r\n[/list]\r\n[b]1.0c[/b] - April 24, 2012\r\n[list][*]Added missing scripts.  Oops.  This Creation Kit really needs better documentation.\r\n[/list]\r\n[b]1.0b[/b] - April 24, 2012\r\n[list][*]Cleaned out some lingering records that didn\\'t need to be there.\r\n[/list]\r\n[b]1.0a[/b] - April 24, 2012\r\n[list][*]First Upload\r\n[/list]",
  "categoryId": "34",
  "version": "1.0d",
  "author": "Clockwork Bard",
  "createdUnix": "1335249664",
  "updatedUnix": "1335340650",
  "containsAdultContent": false,
  "uploadedBy": "ClockworkBard",
  "primaryFile": null,
  "files": [
    {
      "fileId": "56058",
      "name": "Racial Perks Instead of Skills 1_0c",
      "version": "1.0c",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51",
      "fileName": "Racial Perks Instead of Skills 1_0c-15809.zip",
      "uploadedUnix": "1335310462",
      "modVersion": "1.0c",
      "virusScanUrl": "https://www.virustotal.com/file/991985c6748edab21c71d86c23ed3a4ce5f9b886ffed8202e2f24b5c18b92d0d/analysis/1406839026/",
      "changelogHtml": " Added missing scripts.  Oops.  This Creation Kit really needs better documentation. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Racial%20Perks%20Instead%20of%20Skills%201_0c-15809.zip?fid=56058&ttl=1535780534&ri=8192&rs=8192&setec=0944b18c2431c1c39e3859e9bc9452fe"
    },
    {
      "fileId": "56135",
      "name": "Racial Perks Instead of Skills 1_0d",
      "version": "1.0d",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "51",
      "fileName": "Racial Perks Instead of Skills 1_0d-15809-1-0d.zip",
      "uploadedUnix": "1335340650",
      "modVersion": "1.0d",
      "virusScanUrl": "https://www.virustotal.com/file/b316d10e8534d9c8816849c49a1fa208f7112da51fbbd6670ff3ea28e9b5ac3e/analysis/1406839628/",
      "changelogHtml": " Fixed a minor problem where by starting a game with this mod installed, saving prior to receiving the racial perks (ie, before you hands become unbound), uninstalling the mod, then continuing the game could leave a lingering loop behind. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Racial%20Perks%20Instead%20of%20Skills%201_0d-15809-1-0d.zip?fid=56135&ttl=1535780535&ri=8192&rs=8192&setec=761c447485e47e475e5a8e14bbb6fd67"
    }
  ]
}