{
  "modId": 15800.0,
  "modName": "The Great House Indoril - Reborn",
  "summary": "Join the once huge guild the Great House Indoril, and go to war against the Thalmor, Survive the assassination attempts from the An-Xileel and even call upon the Daedric Princes themselves and ask for assistance.",
  "descriptionHtml": "House Indoril was one of the initial six Great Houses of Morrowind. After being founded during the early part of the First Era, Indoril was one of the strongest Houses with vast political power and many Indoril nobles holding influential positions, due to its close ties to the Tribunal. It was the House of Chimer hero Lord Indoril Nerevar. Duke-Prince Indoril Brindisi Dorom ruled Mournhold during its destruction by Mehrunes Dagon.\r\nThe House\\'s period of influence and power came to an abrupt halt at the end of the Second Era. After the Armistice between Lord Vivec and Tiber Septim in 2E 896, many of House Indoril\\'s leading figures chose to commit suicide rather than accept the Empire. The Lord High Councilor of the Grand Council, himself an Indoril, rejected the treaty, and refused to step down. He was then assassinated in a plot, and replaced by a Hlaalu noble. Emboldened by the success of their new Imperial allies, House Hlaalu embraced the opportunity to settle some old scores with House Indoril, and a number of local councils and land holdings changed hands in the bloody feuds that followed. These events saw House Indoril rapidly lose power, and it was left severely weakened during the period of transition to Imperial rule.\r\nThe remaining members of House Indoril retreated into positions in the Tribunal Temple hierarchy. The predominately Indoril militant order, the Ordinators, protects Vivec and other Temple and Indoril holdings. Its main resources being tied up in Guard duty and the maintenance of defenses against Dagoth Ur, House Indoril, although not without influence, is far from its former glory.\r\nCurrently, House Indoril has no territorial holdings on the island of Vvardenfell. Indoril District occupies the heartland of mainland Morrowind, with lands south of the Inner Sea including the city of Almalexia or Mournhold, and the town of Necrom on the eastern coast with its City of the Dead. Indoril territory borders House Dres and the Deshaan Plain.\r\n\r\nDuring the terrible Red Mountain eruption, many Dunmer fled to Skyrim in search for safety, including few members of House Indoril. Though when the Aldmeri Dominion knew they were here, they soon sent a squad of Thalmor to \\\"Negotiate\\\" a peace treaty. This treaty included no Daedra worship, the dismantle House Indoril and hand over Indoril owned regions to the Dominion. Well the Dunmer didn\\'t surrender like the Bosmer did. They went to war!\r\n\r\nWhen the An-Xileel sent a brute force of Argonians to conquer Morrowind, they believed all the Great Houses fell apart. Well after they found that to be false, they sent assassins and mercenaries to kill any Indoril members, still to this day do the Assassins come knocking at your door. You will need to have a sharp eye, these Argonian bastards can jump from anywhere... \r\n\r\n\r\n\r\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------",
  "categoryId": "25",
  "version": "V0.01",
  "author": "Dunmeri Dovahkiin",
  "createdUnix": "1335235538",
  "updatedUnix": "1335235538",
  "containsAdultContent": false,
  "uploadedBy": "dunmeridovahkiin",
  "primaryFile": null,
  "files": []
}