{
  "modId": 15848.0,
  "modName": "GeneralMikes 1337 Blacksmith",
  "summary": "Allows any vanilla armor to be improved to the stats of the best armor in its weight class, allowing low level items to be used late game. Also works with replacer mods like KillerKeo\\'s, MAK\\'s, or other similar armor mods.",
  "descriptionHtml": "Have you grown attached to a certain piece of armor?  Maybe the one you had your first epic dragon battle in.  Or maybe the one you were wearing when you first met your husband/wife.  Or maybe just one that you think is really badass looking, or maybe something you downloaded a cool retex/remodel mod for.  But now that you\\'re level 50something or higher, you can\\'t use it anymore because it\\'s armor rating is so crappy you get OHK\\'d by the first bear or troll you come across.  My mod lets high-level players use whatever armor they like the most, without having to worry about how weak it is.\r\n\r\nOf course, making fur as hard as dragon scales is no easy task.  Only the most skilled and experienced blacksmiths can do it.  Master smiths can\\'t do it.  Smiths that produce legendary gear might not even be able to do it.  Only 1337 blacksmiths can.\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nOkay so enough of all the promo stuff, here\\'s how this actually works.  First, you need to max the Blacksmithing skill tree.  All the light armor perks, all the heavy armor perks, the Dragon smith perk, and the Arcane Blacksmith perk.  Since you need the Dragon smith perk, that means you have to have 100 Blacksmith skill.\r\n\r\nOnce you have the skill and perks, there\\'s the materials.  A 1337 blacksmith can take the strength of all the materials available and combine them into a single substance - the 1337sauce.  Specifically, 5 Dragonbones, 5 Dragonscales, 5 pieces of Leather, 5 of every metal ingot, and 1 Daedra Heart will produce 5 vials of 1337sauce.  To create 1337 quality armor, combine 1 vial of 1337sauce with the armor you want to improve.  All crafting can be done at your neighborhood Forge/Anvil.\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nSupport:\r\nSupport will be provided through the Skyrim Nexus\\' Comments tab and through PM.  The work involved in producing this mod was very repetitive and tedious, so I\\'m sure I messed something up.  If you notice a problem with a recipe, or some stats are off, or anything else, feel free to post a comment and I\\'ll try to fix it for the next version. \r\n\r\nCurrently only vanilla armors are supported.  If there is enough demand, I will consider doing the vanilla weapons.  Likewise, I may do a few quick patches for custom weapons/armors from the Nexus or other mod sites on a case-by-case basis.\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nVersion History:\r\n02.00 - 20/05/12 - BIG UPDATE. Fixes for Blades Gauntlets and Elven Guilded Cuirass names.  Changed 1337Sauce recipe to no longer require a Daedra Heart (they are too rare; the balance was not where I wanted it to be) - 1337Sauce now craftable 1 at a time.  Recipes only appear if you have the item in your inventory (finally).  Lastly, there will now be 2 main files, 1 that makes your helmet invisible (inspired by this mod: http://skyrim.nexusmods.com/downloads/file.php?id=6515), and 1 normal file (coming soon) - NOTE: CHOOSE ONLY 1 OF THE MAIN FILES!\r\n01.01 - 28/04/12 - Added fixes for Fur Cuirass name and Daedric Helmet recipe.\r\n01.00 - 24/04/12 - Initial Release.\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n",
  "categoryId": "54",
  "version": "2.00",
  "author": "GeneralMikeIII",
  "createdUnix": "1335306312",
  "updatedUnix": "1337544574",
  "containsAdultContent": false,
  "uploadedBy": "GeneralMikeIII",
  "primaryFile": null,
  "files": [
    {
      "fileId": "57076",
      "name": "Vanilla Armors",
      "version": "01.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "Vanilla Armors-15848.7z",
      "uploadedUnix": "1335634876",
      "modVersion": "01.01",
      "virusScanUrl": "https://www.virustotal.com/file/19cfab6b61f3a5027726e3106d58ae756111231bc98f0d5da311d50e4f257298/analysis/1406851622/",
      "changelogHtml": " Fixed Fur armor not showing up as \\\"1337 Fur Armor\\\" after upgrading. <br/> \n Fixed Daedric helmet recipe. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vanilla%20Armors-15848.7z?fid=57076&ttl=1535780609&ri=8192&rs=8192&setec=6022cf8aff4a087586ea3afa8f154665"
    },
    {
      "fileId": "62608",
      "name": "Armors - Invisible Helmets",
      "version": "02.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "Armors - Invisible Helmets-15848.7z",
      "uploadedUnix": "1337544574",
      "modVersion": "02.00",
      "virusScanUrl": "https://www.virustotal.com/file/de34c364ad8be5b40bd6a645d636148ab8a9eefcef9c91e65eea3851f3920a25/analysis/1406905621/",
      "changelogHtml": " Fixed Blades Gauntlets and Elven Guilded Cuirass name not updating after upgrading. <br/> \n Removed Daedra Heart from 1337Sauce recipe. <br/> \n Recipes only appear if you have the necessary armor piece in your inventory. <br/> \n Added 2nd main file that makes all 1337 helmets invisible.  Download only 1 main file. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Armors%20-%20Invisible%20Helmets-15848.7z?fid=62608&ttl=1535780609&ri=8192&rs=8192&setec=458103aa08a1cac66a6a5612ef07b455"
    }
  ]
}