{
  "modId": 15858.0,
  "modName": "RP Game - Noble Nord",
  "summary": "You\\'re a Nord of deceased noble family who was fleeing to Hammerfell through Skyrim. However you got caught crossing the road by Imperial patrols.",
  "descriptionHtml": "This is NOT a mod, it\\'s a setup/ backstory for your character in Skyrim which can affect what choices you make and how you play the game.\r\n\r\nPlease do not complain that it\\'s too restricting. This is also an immersion guide for people who don\\'t know or have trouble with setting up a RP character.\r\n\r\nThe set of rules that I recommend following: http://j-u-i-c-e.hubpages.com/hub/roleplaying-skyrim\r\n\r\nCredits: j-u-i-c-e\r\n\r\nI may be including modded files in the future that help with the true immersion.\r\n\r\nNOTE: If you use this setup as a guide, keep in mind that the character\\'s story, age and race should follow the TES lore for hardcore RP players, however it is not absolutely necessary.\r\n\r\nName: Any (Example: Stefal)\r\n\r\nAge: Any (Lore: 32)\r\n\r\nGender: Any (Example: Male)\r\n\r\nHeight: 1.87m/6”1\r\n\r\nWeight: 82kg/180lb\r\n\r\nD.O.B: 29th Sun’s Dawn, 4E169\r\n\r\nClass: Warrior or Ranger\r\n\r\nProfession: Blacksmithing or Alchemy\r\n\r\nBirthplace: Windhelm, Skyrim\r\n\r\nFamily: Nobles. He/She is from a noble Nordic family who came to Cyrodiil as refugees of The Forsworn Rebellion during The Great War.\r\n\r\nFriends: The man who is freaking out at the start.\r\n\r\nBackstory: Stefal’s family was somewhat famous in Skyrim before they left. In Cyrodiil they began leading a peaceful life with Stefal’s father stepping into a career of politics which guaranteed his family’s safety. Shortly after arrival in Cyrodiil Stefal’s mother opened a fine clothing store in Bruma. However, as The Great War raged on, Cyrodiil became a centre point of battle. During the attack on Bruma, Stefal’s family and nobles house was destroyed leaving Stefal and his friend to fend for themselves for many years. Stefal and his friend fled to Hammerfell through Skyrim, hoping that they could stay close to the mountains and not be detected by Imperial Troops. However they got caught whilst crossing a main road by an Imperial prison convoy. The Imperials, recognized them as refugees from Cyrodiil, captured them and added them to the cart, and so our story begins...",
  "categoryId": "78",
  "version": "1.0",
  "author": "Jago01",
  "createdUnix": "1335336990",
  "updatedUnix": "1335336990",
  "containsAdultContent": false,
  "uploadedBy": "Jago01",
  "primaryFile": null,
  "files": []
}