{
  "modId": 15880.0,
  "modName": "Finally a Playable Draugr",
  "summary": "This mod allows you to play as a Draugr Blade.  Ancient dragonslayers with their own unique description, racial abilities and skills.",
  "descriptionHtml": "FIRST ON SKYRIM NEXSUS!!! VERSION 1.1 IS HERE! Double eyes fixed, Double mouths fixed and dagger animations fixed!!!\r\n\r\nDAWNGUARD NOT SUPPORTED!\r\n\r\nIMPORTANT::: Everyone, I have done all I can do for this mod.  It still has a problems, killcams are crappy. DO NOT USE SETRACE COMMAND use SHOWRACEMENU or every single character in the game will have glowing blue eyes!  Anyone who has a better understanding of NIFSCOPE should tell either tell me what node effects the killcams, anyone with monster modding experince should tell me what the draugr uses as a first person skeleton.  The kill cams and the first person view is beyond my ability to fix.  Anyone who can fix it is free to, just be sure to credit me as the orginal author and inform me so I can enjoy it as well.  If anyone knows HOW to fix these issues but doesn\\'t want to do the work, tell me how and I will.\r\n\r\n{Not an update you must delete the old files and .esp and install this, sorry if you have to start over!}\r\n\r\nThis is the newest version.  In this version the skeleton is wholly new; built from scratch using a skeleton that supports daggers.  The first person camera is an issue I\\'ve spent HOURS trying to fix but unfortunately I cannot.  Skyrim uses two seperate Skeletons for first and third person cams.  Actors have a first person pathing that allows you manipulate the camera angle with NIFscope; the Draugr is a monster and doesn\\'t contain a pathing for first person nor a node for first person camera.  If anyone has any ideas, knows what skeletons draugr use for the first person cam or has found an alternative solution to this issue PLEASE INFORM ME!  It\\'s infuriating to spend hours working on something only to be defeated by a mesh!!!\r\n\r\nRelease notes:  Double eyes GONE, Double mouths GONE and dagger animations INCLUDED!  You will no longer be treated as a redguard!  Hadvar won\\'t know WHAT to say about you, he\\'ll just ask what to do with you!!!  You are now the SAME size as conventional Draugrs, you\\'ll be able to fit throught tight hallways.  \r\n\t\r\nKnown Issues:  I haven\\'t been able to activate kill cams, I\\'m not sure if that has to do with the other mods I have or not; let me know.  First person cam is INFURIATING!!!  It\\'s tolerable for others I\\'m sure but I\\'ve spent hours trying to fix it but I can\\'t.  If you look up you\\'ll see the inside of your head and if you look down you\\'ll see your armor (at least I think that\\'s what it is.)  \r\n\r\nIMPORTANT: You can select hair styles, beards and scars; just select a preset first.  Works for both genders.  You cannot morph the face beyond this because technically the draugr has NO FACE, at leat according to the cration kit.  Don\\'t worry though is quite visible and quite... Well it\\'s Draugr, very Draugr...\r\n\r\nInstallation:  Should be NMM compatible now.  Otherwise just drag and drop the folder and the esp to skyrim directory and select yes when it asks you to merge.\r\n\r\nCompatibility:  This mod does NOT effect ANY variables in the game.  It is a completely customized race and doesn\\'t effect the Draugr roaming the crypts AT ALL.  It should be compatible with any mods.  Retextured draugrs SHOULd effect your characters by retexturing them to just load that .esp after this (if applicable) after this.  THAT IS NOT TESTED!  Any mods you have other that cosmetic one that effect normal draugrs, will NOT effect your character.\r\n\r\nConclusion:  This is my first mod; I like Draugrs and I wanted to play as one.  If you feel the same download it, play it and have fun.  Don\\'t reuse this mod without my permission.  Don\\'t like it, ohh well.  Move on to the next mod.\r\n\r\nThank you and enjoy your new pet corpse!\r\n-ecremer\r\n\r\n ",
  "categoryId": "34",
  "version": "2.0",
  "author": "ecremer",
  "createdUnix": "1335371337",
  "updatedUnix": "1335674993",
  "containsAdultContent": false,
  "uploadedBy": "ecremer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "57216",
      "name": "Playable Draugr",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24",
      "fileName": "Playable Draugr-15880-2-0.zip",
      "uploadedUnix": "1335674993",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/4a544928e2f79f8ecdb13bcd257a5b8e3babe461ce77e81b8a65c2475dfda8dc/analysis/1406853004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Playable%20Draugr-15880-2-0.zip?fid=57216&ttl=1535780672&ri=8192&rs=8192&setec=f7dca4f4bad08681f21ba769b3cfe864"
    }
  ]
}