{
  "modId": 15911.0,
  "modName": "Winterscale Armor - DELETED",
  "summary": "New suit of light armor based on Ulfric\\'s Clothes.",
  "descriptionHtml": "[size=5][color=red]FEATURED IN SKYRIM MODS WEEKLY: BITS \\'N\\' BOBS - WEEK#6[/size][/color]\r\n\r\n[youtube]KF334TA1RcU[/youtube]\r\n\r\nUPDATES: \r\n\r\n* 05/07/12 - base silver-grey scaled HD textures are finished (but not posted until i finish the other colors). I used the textures from the Bethesda HD Texture Pack as a base to work from. To my surprise, the gloves and boots texture files were only 512x512 pixels, and were included in Bethesda\\'s HD texture pack. With these smaller resolution textures I scaled them up to 2048x2048 to match the armor textures. I am now working on the color variations (Bronze-Gold, and maybe a couple others; black, blue, red?). I will also do the open faced female variant in HD as well as a variant sporting the imperial dragon (Skyrim) logo on the chest.\r\n\r\n[size=6][color=blue]WINTERSCALE ARMOR[/size][/color]\r\n\r\nThis mod adds (at the moment) two new light armor coats to the game, which are available VIA crafting at any forge (may also be tempered, found in the DRAGON tab) provided you are able to craft dragonscale and dragonbone armors. They work for both male and females of all races (vanilla body right now, I plan on doing a CBBE version once I figure out how). I am also planning on doing an HD version, though there may be some slight variations depending on if I can remember exactly how I did things the first time, all those months ago). Currently there are two color variations available (you no longer need the optional file as both are included as crafting options at the forge); the Winterscale which is a silver-white color and the Summerscale which is more gold-bronze colored. I have another dark blue variation in the works as well, but so far it\\'s not looking quite right, as the blue is too vibrant.\r\n\r\nFor stats it\\'s just below Dragonscale in order to make it a viable play option nearer to end game, and in the interest of keeping things balanced (am pondering the idea of creating another slightly more powerful, enchanted set). I\\'ve used the hood and mask from the Dark Brotherhood as the hood for the females, and have used the Thalmor hood for the males (texture for the Thalmor hood was originally used on another hood mod found here on Nexus which I added the scale texture to, which has since been turned into something else or taken down, if anyone knows which mod it\\'s from please let me know so I can give credit.)\r\n\r\n[b][color=blue]INSTALLATION:[/b][/color]\r\n-Open the archive\r\n-Copy files into your DATA folder, overwrite where necessary.\r\n\r\n-to uninstall delete the \\\"dragonskin\\\" folder from the meshes and textures folders, and remove the Winterscale ESP\r\n\r\nDon\\'t forget to endorse if you enjoyed the mod.\r\n\r\n",
  "categoryId": "54",
  "version": "0.1",
  "author": "hideouscircus",
  "createdUnix": "1335409521",
  "updatedUnix": "1335898830",
  "containsAdultContent": false,
  "uploadedBy": "hideouscircus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "57137",
      "name": "Winterscale Armor NEWEST",
      "version": "v1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "18425",
      "fileName": "Winterscale Armor NEWEST-15911-v1-0.rar",
      "uploadedUnix": "1335657214",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/99801951bcb5e56cf1d6d2ff3909cb0822059841f9a4697f0155b46045e14cef/analysis/1406852083/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Winterscale%20Armor%20NEWEST-15911-v1-0.rar?fid=57137&ttl=1535780716&ri=8192&rs=8192&setec=fb40c58d333d9bbd54e19513441f535f"
    },
    {
      "fileId": "57913",
      "name": "Alternate Open Faced Female Hoods",
      "version": "",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "165",
      "fileName": "Alternate Open Faced Female Hoods-15911-1.rar",
      "uploadedUnix": "1335898830",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/b4112839a71bdf8de5755c2dfbe7f1456f83e8d55d100646347673f701a5c404/analysis/1406859669/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternate%20Open%20Faced%20Female%20Hoods-15911-1.rar?fid=57913&ttl=1535780716&ri=8192&rs=8192&setec=e3341af812f3cb9b93aeeaed8c619c31"
    }
  ]
}