{
  "modId": 15922.0,
  "modName": "CRMOD Academic Experiment - Finished",
  "summary": "This is a scientific experiment I\\'m conducting as a part of my master thesis that I \\'m currently writing at Aalborg University Copenhagen (AAUC). It involves a custom level you will play in and a custom character you will play as in the experiment.",
  "descriptionHtml": "Testing is over however you can still be a part of the experiment and contribute to further research by participating.\r\nThis is a scientific experiment I\\'m conducting as a part of my master thesis that I \\'m currently writing at Aalborg University Copenhagen (AAUC). It involves a custom level you will play in and a custom character you will play as in the experiment.\r\n\r\nI cannot tell you much about the experiment before the test since that would compromise the data. But I can tell you the story in the test: You are a man that have been sentenced to death and therefore thrown down into a cave. Here you are to die a horrible death by starvation. This is however not the way you see it. You will find a way out and avenge your wife who was killed by the very same people that put you in this place. It is now your quest to survive, find a way out of there and avenge your loved ones. The test level takes from 2-10 min depending on you.\r\n\r\nTo be able to participate in this experiment you should be able to run the game at the highest graphical setting. Not any ini file tweaks just the normal high setting that comes with the game.\r\nIf you have any other MODs installed that effect graphical settings these should be turn off while testing.\r\nYou may NOT change the POV of the character!\r\nThe main character might look weird, but do not be alarmed it is part of the test.\r\nYou now have to choose one of the save games that will load you into the cave and start the experiment. You place the chosen save file in your Skyrim save folder (C:\\\\Users\\\\”yourname”\\\\Documents\\\\My Games\\\\Skyrim\\\\Saves). It is important that you only use one of the save files since it will make you biased if you try both. If you prefer doing the installation automatically you can go here: http://steamcommunity.com/sharedfiles/filedetails/?id=19960849\r\n\r\nSave file CRMOD01:\r\nhttp://dl.dropbox.com/u/438930/Skyrim/CRMOD01.ess \r\n\r\nSave file CRMOD02\r\nhttp://dl.dropbox.com/u/438930/Skyrim/CRMOD02.ess \r\n\r\nWhen you have completed the test level you should answer the questionnaire located here:\r\nhttps://docs.google.com/spreadsheet/viewform?formkey=dEk1emZmNHBxSkxpTVZRdlpRdFhnRWc6MQ\r\n\r\nPlease contact me if you have any questions/problems regarding the test or related material.\r\n\r\nThe thesis is done and can be downloaded here if you like to read it:\r\nhttp://dl.dropbox.com/u/438930/Reports/Investigating%20the%20connection%20between%20visual%20detail%20and%20character%20identification.pdf\r\n\r\nBest regards\r\nDaniel Lauritzen\r\ndlauri08@student.aau.dk",
  "categoryId": "24",
  "version": "1.0",
  "author": "Dreckel",
  "createdUnix": "1335433294",
  "updatedUnix": "1335435287",
  "containsAdultContent": false,
  "uploadedBy": "Dreckel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "56438",
      "name": "CRMOD Academic Experiment",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7263",
      "fileName": "CRMOD Academic Experiment-15922-1-0.rar",
      "uploadedUnix": "1335435287",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7c9f0df05f600927ec127cf134635a4fe60553211bfb265e5c6901cb6a0b4c35/analysis/1406841487/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CRMOD%20Academic%20Experiment-15922-1-0.rar?fid=56438&ttl=1535780738&ri=8192&rs=8192&setec=a03c666b2c668d97c05b42df9e2e5d18"
    }
  ]
}