{
  "modId": 15963.0,
  "modName": "ESP - Expanded Skyrim Presets",
  "summary": "Adds 390 new presets to the character creation menu, including over 300 NPC faces. From Aela to Ysolda, from Arnbjorn to Ulfric, from Isran to Serana, all your favorites are here, plus much more. All races covered. New update adds 15 Dawnguard faces plus more originals. Screenshots tell the story. Dawnguard not required.",
  "descriptionHtml": "[img] http://skyrim.nexusmods.com/mods/images/15963-1-1380129566.jpg[/img] \r\nESP - Expanded Skyrim Presets\r\nVersion 1.1\r\nBy c_striker\r\n\r\n\r\n[color=orange]DESCRIPTION[/color]\r\n===========\r\nThis mod adds 390 new presets to Skyrim\\'s character creation menu. Updated version includes 318 NPC\\'s from the original game, 15 NPC\\'s from Dawnguard, and 57 original faces. From Aela to Ysolda, from Arnbjorn to Ulfric, and from Isran to Serana, all the popular NPCs are here. Whether you wish to play as your favorite NPC or simply want a greater variety of presets from which to build your character, this mod gives you plenty of choices. Consistent with Skyrim\\'s population, Nords have the largest group of presets, but all the playable vanilla races are represented. This mod does not overwrite any of the 200 vanilla presets, so following installation your total number of preset options will be 590.\r\n\r\nPlease review the posted screenshots to see all the included faces. To minimize download time, I have provided versions both with and without screenshots. The versions without screenshots still include this description file, which catalogs all the presets, plus you can also simply save the screenshots to your PC, as they may prove handy for visual reference. In the index below, each race\\'s new presets start with position 11 for each gender (after the 10 vanilla presets). For various reasons, the presets are not necessarily in alphabetical order.\r\n\r\nNOTE: The main file makes certain Dawnguard-dependent content available to other races (Serana and Valerica hairs to human races, glowing vampire eyes to humanoid races). As such, the main file is dependent on the Dawnguard master file. However, I have included an optional version that excludes these items and does not require Dawnguard, but still includes the Dawnguard faces.\r\n\r\n[color=yellow]IMPORTANT: IF YOU HAVE DAWNGUARD INSTALLED, DOWNLOAD THE MAIN FILE. IF YOU DO NOT HAVE DAWNGUARD, DOWNLOAD THE OPTIONAL (NONDEPENDENT) VERSION. THE MAIN FILE WILL NOT WORK WITHOUT DAWNGUARD, BUT THE OPTIONAL FILE WILL.[/color]\r\n\r\nBoth file versions include the Dawnguard faces, and both make the non-glowing vampire eyes (as used by Serana) and the Dark Elf Unique eyes (as used by Karliah) available to non-beast races.\r\n\r\nAs always, constructive feedback is appreciated. If you like the file, please endorse it.\r\n\r\nIf you want your characters to look exactly as they do in the screenshots then you\\'ll need to use the same mods I do (listed further below), but the NPC presets included here have exactly the same settings as the vanilla NPCs so, regardless of mods, their appearance will be the same as your in-game NPC.\r\n\r\n\r\n[color=orange]CHANGELOG[/color]\r\n=========\r\nv1.0 - Original release, included 345 new presets.\r\nv1.1 - Update adds 45 additional presets, including 15 Dawnguard faces.\r\n\r\n\r\n[color=orange]INDEX OF INCLUDED PRESETS[/color] \r\n==========================\r\n\r\n[color=yellow]Argonian[/color]\r\n------------\r\nFemale (AF11-AF19): Deeja, From-Deepest-Fathoms, Keerava, Takes-In-Light, Shahvee, Original AF1, Wujeeta, Original AF2, Original AF3\r\nMale (AM11-AM24): Deekus, Derkeethus, Gulum-Ei, Jaree-Ra, Madesi, Neetrenaza, Scouts-Many-Marshes, Stands-In-Shallows, Talen-Jei, Teeba-Ei, Veezara, Watches-The-Roots, Deep-In-His-Cups, Original AM1\r\n\r\n[color=yellow]Breton[/color]\r\n----------\r\nFemale (BF11-BF34): Cairine, Daighre, Delphine, Eola, Fianna, Julienne Lylvieve, Lisette, Mena, Mirabelle Ervine, Muiri, Senna, Vigilant Carcette, Vivienne Onis, Voada, Original BF1, Original BF2, Original BF3, Modhna, Sorine Jurard, Original BF4, Original BF5, Original BF6, Original BF7, Original BF8\r\nMale (BM11-BM38): Adeber, Alain Dufont, Amaund Motierre, Anton Virane, Belethor, Braig, Cedran, Cosnach, Cynric Endell, Pelagius the Mad, Sheogorath, Dalan Merchad, Degaine, Delacourt, Delvin Mallory, Duach, Eltrys, Ennoc, Etienne Rarnis, Mercer Frey, Morven, Odvan, Rahd, Rondach, Maurice Jondrelle, Original BM1, Original BM2, Original BM3\r\n\r\n[color=yellow]Dark Elf[/color]\r\n----------\r\nFemale (DF11-DF23): Karliah, Gabriella, Brelyna Maryon, Jenassa, Irileth, Aduri Sarethi, Aranea Ienith, Dinya Balu, Idesa Sadri, Synda Llanith, Voldsea Giryon, Original DF1, Original DF2\r\nMale (DM11-DM21): Malur Seloth, Savos Aren, Veren Duleri, Romlyn Dreth, Arvel the Swift, Belyn Hlaalu, Original DM1, Erandur, Indaryn, Malyn Varen, Original DM2\r\n\r\n[color=yellow]High Elf[/color]\r\n----------\r\nFemale (HF11-HF22): Arivanya, Curwe, Meridia, Elenwen, Faralda, Niranye, Reldith, Taarie, Original HF1, Original HF2, Minorne, Original HF3\r\nMale (HM11-HM28): Ancano, Aringoth, Calcelmo, Hircine, Linwe, Melaran, Muril, Nelacar, Nerien, Nurelion, Ondolemar, Quaranir, Rulindil, Tandil, Ulundil, Viarmo, Original HM1, Original HM2\r\n\r\n[color=yellow]Imperial[/color]\r\n-----------\r\nFemale (IF11-IF32): Adrianne Avenicci, Aia Arria, Camilla Valerius, Carlotta Velentia, Constance Michel, Original IF1, Ganna Uriel, Pantea Ateia, Ria, Safia, Sosia Tremellia, Vaermina, Valga Vinicia/Gilfre, Vex, Vittoria Vici, Original IF2, Helgen Imperial Captain (Prima), Original IF3, Original IF4, Original IF5, Original IF6, Original IF7\r\nMale (IM11-38): Adonato Leotelli, Aerin, Cicero, Commander Caius, Commander Maro, Calixto Corrium, Clavicus Vile, Lucien Lachance, Ennodius Papius, Gaius Mauro, Gallus (Nightingale Sentinel), Gavros Plinius, General Tullius, Marcurio, Dirge, Mallus Maccius, Pavo Attius, Proventus Avenicci, Quintus Navale, Reburrus Quintilius, Rune, Salvianus, Severio Pelagia, Sorex Vinius, Varnius Junius, Vantus Loreius, Original IM1, Original IM2\r\n\r\n[color=yellow]Khajiit[/color]\r\n---------\r\nFemale (KF11-KF21): Ahkari, Atahba, Mephala, Khayla, Ra\\'zhinda, Shavari, Original KF1, Tsavani, Zaynabi, Original KF2, Original KF3\r\nMale (KM11-KM21): Dro\\'marash, J\\'datharr, J\\'zargo, Kharjo, Ma\\'dran, M\\'aiq the Liar, Original KM1, Ma\\'randru-jo, Ri\\'saad, Original KM2, Original KM3\r\n\r\n[color=yellow]Nord[/color]\r\n-------\r\nFemale (NF11-NF69): Aela the Huntress, Alva, Annekke Crag-Jumper, Astrid, Betrid Silver-Blood, Breya, Bryling, Danica Pure-Spring, Elisif the Fair, Hunter, Faida, Fastred, Gerdur, Gisli, Gormlaith Golden-Hilt, Haelga, Hermir Strong-Heart, Hillevi Cruel-Sea, Iona, Jordis the Sword-Maiden, Lydia, Hroki, Idgrod the Younger, Ingrid, Ingun Black-Briar, Jala, Karita, Lisbet, Maven Black-Briar, Mjoll the Lioness, Grete the Bard, Margret, Narri, Nilsine Shatter-Shield, Njada Stonearm, Olda, Olfina Gray-Mane, Orla, Legate Rikke, Sapphire, Sorli the Builder, Susanna the Wicked, Svana Far-Shield, Sylgja, Uthgerd the Unbroken, Ysolda, Original NF1, Original NF2, Original NF3, Alfhild Battle-Born, Sigrid, Fura Bloodmouth, Hestla, Ingjard, Katria, Serana, Valerica, Original NF4, Original NF5\r\nMale (NM11-NM63): Arnbjorn, Asbjorn Fire-Tamer, Avulstein Gray-Mane, Balgruuf the Greater, Brynjolf, Captain Aldis, Captain Lonely-Gale, Bjorlam (Carriage Driver), Eorlund Gray-Mane, Falk Firebeard, Farengar Secret-Fire, Farkas, Felldir the Old, Galmar Stone-Fist, Hadvar, Hakon One-Eye, Heimvar, Helvard, Hemming Black-Briar, Belrand, Erik the Slayer, Stenvar, Vorstag, Argis the Bulwark, Calder, Hrongar, Igmund, Jon Battle-Born, Kjeld, Kodlak Whitemane, Maul, Lokir, Party Carriage Driver 2, Sovngarde Bard, Ysgramor, Alding the Pirate, Ralof, Skjor, Skulvar Sable-Hilt, Sven, Goldenglow Gate Guard, Thrynn, Torolf, Ulfberth War-Bear, Ulfric Stormcloak, Unmid Snow-Shod, Vekel the Man, Vilkas, Original NM1, Original NM2, Siddgeir, Lord Harkon, Original NM3\r\n\r\n[color=yellow]Orc[/color]\r\n-----\r\nFemale (OF11-OF20): Arob, Borgakh the Steel Heart, Gharol, Lash gra-Dushnikh, Shel, Ugor, Urog, Urzoga gra-Shugurz, Yatul, Original OF1\r\nMale (OM11-OM23): Balagog gro-Nolob, Chief Burguk, Dushnamub, Gat gro-Shargakh, Ghorbash the Iron Hand, Gularzob, Chief Larak, Lurbuk, Chief Mauhulakh, Moth gro-Bagol, Mul gro-Largash, Chief Yamarz, Original OM1\r\n\r\n[color=yellow]Redguard[/color]\r\n-------------\r\nFemale (RF11-RF23): Ahlam, Anwen, Faleen, Jonna, Atmah, Nocturnal, Saadia, Saffir, Tonilia, Urwa, Original RF1, Jayri, Original RF2\r\nMale (RM11-RM23): Ahtar, Atafalan, Azzada Lylvieve, Alik\\'r Template, Endon, Fihada, Maramal, Nazeem, Nazir, Razelan, Original RM1, Isran, Original RM2\r\n\r\n[color=yellow]Wood Elf[/color]\r\n------------\r\nFemale (WF11-WF24): Anuriel, Brelas, Bandit 2, Bandit 5, Bandit 6, Nimriel, Nivenor, Adventurer, Wylandriah, Original WF1, Original WF2, Beleval, Galathil, Original WF3\r\nMale (WM11-WM24): Anoriath, Orchendor, Dervenin, Erindur, Faendal, Gadnor, Gelebros, Malborn, Niruin, Syndus, Ungrien, Valindor, Thaer, Original WM1\r\n\r\n\r\n[color=orange]ADDITIONAL NOTES[/color]\r\n=================\r\nCustom skin tones and makeup tints are not available in the character creation menu, so in these cases (Nocturnal for example) I have used the closest shade available.\r\n\r\nDue to the tempermental/buggy nature of the CK, I have noticed rare instances where some makeup tints may not initially appear on the preset, but these tints can be added in the character creation process. The screenshots were all taken without making any cosmetic changes in the creation menu, so what you see in the screenshot is what you\\'ll get in-game.\r\n\r\nMy personal tip for quickly creating an attractive character: If you can\\'t find a preset that jumps out at you, try ignoring the hair, eyebrows, eye color and makeup as you review them and instead focus on the type and relative position of the eyes, nose and mouth (these are the hardest features to get right). If you can find a face that already has an attractive presentation of these features, then the toughest work is already done. You can then experiment with other elements without worrying about screwing things up. I\\'m no expert, but that\\'s what works for me.\r\n\r\nAlso, don\\'t discount characters that have rough/aged complexions or are covered by face paint. Rolling back the years or scrubbing off the paint can often reveal attractive features.\r\n\r\n[color=yellow]If you like my work, feel free to check out my other mod, \\\"Diverse Female Housecarls\\\": http://skyrim.nexusmods.com/downloads/download.php?id=49520. I am also currently working on a follower/faction/questline mod, sneak peek screenshot of which can be found here: http://skyrim.nexusmods.com/images/265133. I also have a series of NPC clone saves out there, but all the characters in those files are now covered by this preset mod.[/color]\r\n\r\n[color=orange]POSSIBLE/KNOWN BUGS[/color]\r\n=====================\r\nNo bugs that I\\'m aware of. But due to the volume of presets, you may notice a lag here and there. In particular, you may have to wait a few seconds for the naming menu to pop up after you\\'ve finished crafting your character, so please be patient.\r\n\r\n\r\n[color=orange]MODS USED[/color]\r\n===========\r\nNo other mods are required, but if you want your characters to look exactly like they do in the screenshots then you\\'ll have to use the same ones I use, as follows:\r\nFace:\r\n* \\\"Better Females by Bella\\\": http://skyrim.nexusmods.com/downloads/download.php?id=9747 (\\\"No make up just improved textures\\\" version)\r\n* \\\"Beauty Faces by NecKros\\\": http://skyrim.nexusmods.com/downloads/download.php?id=6226 (specular map only)\r\n* \\\"No More Blocky Faces\\\" by Xenius: http://skyrim.nexusmods.com/downloads/download.php?id=13714 (I use version 1.3)\r\nI use a blend of these three mods. Install No More Blocky Faces first, then Bella\\'s mod, then take only the specular map (femalehead_s.dds) from the NecKros mod and use it to replace the one from Bella.\r\nThe specular map is located in the following folder: textures\\\\actors\\\\character\\\\female\r\nEyes:\r\n* \\\"Natural Eyes\\\" by nevenbridge: http://skyrim.nexusmods.com/downloads/download.php?id=11110 (human eyes only)\r\n* \\\"High Quality Eyes\\\" by Xenius: http://skyrim.nexusmods.com/downloads/download.php?id=1385 (elf eyes only) \r\nHair:\r\n* \\\"Straight hair retexture\\\" by navetsea: http://skyrim.nexusmods.com/downloads/download.php?id=13007\r\n\r\n\r\n[color=orange]INSTALLATION (MANUAL)[/color]\r\n=======================\r\n1. Extract the files of this mod to a temporary location (you can use 7zip: http://www.7-zip.org, to unzip them) and check the folder structure.\r\n2. Copy the one file included in the Data folder into your Skyrim data folder, located in the Steam folder structure within your program files, typically: \\\\Steam\\\\SteamApps\\\\common\\\\Skyrim\\\\Data\r\n3. Launch Skyrim and make sure the appropriate ESP plug-in file is checked in the Data Files menu before you play the game.\r\n\r\n[color=orange]CONFLICTS[/color]\r\n==========\r\nBecause it has to add each preset to its applicable race in order for it to be visible  in the character creation menu, this mod will likely conflict with any other mod that changes races. This means it will likely conflict with other preset mods and with mods that alter racial abilities. These conflicts can be overcome by placing the ESP mod last in load order and activating it only long enough to create a new character. Once your new character has been saved, and its race and other chargen settings are safely retained in your save game, you can then deactivate my mod or shift it to load before any conflicting mod so that the latter can then dictate.\r\n\r\n[color=orange]CONTACT[/color]\r\n=========\r\nIf you need to contact me, please do so by leaving a comment at the mod\\'s thread.\r\n\r\n[color=orange]CREDITS[/color]\r\n=======\r\nThanks to Bethesda for the Elder Scrolls Series of games.\r\nThanks to LHammonds for the Readme Generator this file was based on: http://hammondslegacy.com/obmm/tools_readme_generator1.asp\r\nThanks to the modders mentioned above for their efforts and improvements to the game.\r\nThanks to Nexus and the modding community for the access, tools and resources.\r\n\r\n[color=orange]TOOLS USED[/color]\r\n===========\r\nBethesda\\'s Creation Kit\r\n7zip - http://www.7-zip.org/\r\n\r\n[color=orange]LICENSING/LEGAL[/color]\r\n================\r\nIn the unlikely event you wish to use my original characters in your own mod, please give me credit.\r\n",
  "categoryId": "26",
  "version": "1.1",
  "author": "c_striker",
  "createdUnix": "1335490165",
  "updatedUnix": "1346624035",
  "containsAdultContent": false,
  "uploadedBy": "c_striker",
  "primaryFile": null,
  "files": [
    {
      "fileId": "56661",
      "name": "ESP_v1_0_NoScreenshots_Old",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "312",
      "fileName": "ESP_v1_0_NoScreenshots_Old-15963.7z",
      "uploadedUnix": "1335498132",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e673bdccc5ce21660970d4423dfc0540c2ff9adfef0ebe19f35d6b946f4117c5/analysis/1406842950/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESP_v1_0_NoScreenshots_Old-15963.7z?fid=56661&ttl=1535780811&ri=8192&rs=8192&setec=87fc8917abc8ec16a502e2936518f557"
    },
    {
      "fileId": "56664",
      "name": "ESP_v1_0_Complete_Old",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24430",
      "fileName": "ESP_v1_0_Complete_Old-15963.7z",
      "uploadedUnix": "1335499314",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d717680778e99cf96bd46e93976b978e0b1f3403d9e1c01f11841d46ec9b5433/analysis/1406842997/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESP_v1_0_Complete_Old-15963.7z?fid=56664&ttl=1535780811&ri=8192&rs=8192&setec=e6a31af4922680b029c5b6209438b68c"
    },
    {
      "fileId": "58089",
      "name": "ESP_v1_0_Complete",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24276",
      "fileName": "ESP_v1_0_Complete-15963-1-0.7z",
      "uploadedUnix": "1335947596",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c1611936616510e0466d978beeb34b17bf36dff5807a060a0e80f2d933e0c708/analysis/1406860890/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESP_v1_0_Complete-15963-1-0.7z?fid=58089&ttl=1535780812&ri=8192&rs=8192&setec=47640653313d956ae15bf16cfd8cef2a"
    },
    {
      "fileId": "58090",
      "name": "ESP_v1_0_NoScreenshots",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "158",
      "fileName": "ESP_v1_0_NoScreenshots-15963-1-0.7z",
      "uploadedUnix": "1335947956",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1722ae013ef9c1159b0197238a93209cb4aa1577ccabed4c08abc554d094dd43/analysis/1406860925/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESP_v1_0_NoScreenshots-15963-1-0.7z?fid=58090&ttl=1535780812&ri=8192&rs=8192&setec=194961949c24b2e50e76e002c1284a2c"
    },
    {
      "fileId": "86058",
      "name": "ESP_v1_1_Nondependent",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "27210",
      "fileName": "esp_v1_1_nondependent-15963-1-1.rar",
      "uploadedUnix": "1346621000",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4742ea482fd2557d3bfe56f28fdfdc9118962d33fe5173e8efbc72713c1bc6b9/analysis/1407141736/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/esp_v1_1_nondependent-15963-1-1.rar?fid=86058&ttl=1535780813&ri=8192&rs=8192&setec=c05bb6e806d1d1490b33f9290400509b"
    },
    {
      "fileId": "86070",
      "name": "ESP_v1_1_NondependentNoScreenshots",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "188",
      "fileName": "ESP_v1_1_NondependentNoScreenshots-15963-1-1.rar",
      "uploadedUnix": "1346623405",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b31428b050925c3b8a91651f3ece630e248967a0d4d161dc3d6fa524d105078a/analysis/1407141785/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESP_v1_1_NondependentNoScreenshots-15963-1-1.rar?fid=86070&ttl=1535780813&ri=8192&rs=8192&setec=9762991e834b5b848bcef2d160a6a216"
    },
    {
      "fileId": "86071",
      "name": "ESP_v1_1_NoScreenshots",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "187",
      "fileName": "ESP_v1_1_NoScreenshots-15963-1-1.rar",
      "uploadedUnix": "1346623575",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/42b7bb96f9c969d299837162800f2de75128a9822f9a003056ee31609cb5331f/analysis/1407141844/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESP_v1_1_NoScreenshots-15963-1-1.rar?fid=86071&ttl=1535780814&ri=8192&rs=8192&setec=e4578c61e3e99355e190bd26a7923c0e"
    },
    {
      "fileId": "86072",
      "name": "ESP_v1_1_Complete",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27209",
      "fileName": "ESP_v1_1_Complete-15963-1-1.rar",
      "uploadedUnix": "1346624035",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/490cae84dd0c6b03df3ae2d59f71b621ec38b9ad0083e4b8d89a83f310cfef34/analysis/1407141856/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESP_v1_1_Complete-15963-1-1.rar?fid=86072&ttl=1535780815&ri=8192&rs=8192&setec=40f09ad2f8188ea3af84e6ec6031a44b"
    }
  ]
}