{
  "modId": 16017.0,
  "modName": "The Okaazah - Player-Owned Ship with Crew and Travel System",
  "summary": "The Okaazah is a new alternative to landlocked homes.  You now own a ship with full living and crafting facilities, working cannons, and a crew&#33;\r<br />Now in the form of a Masterfile for improved compatibility and upgrade-ability, including a special bridge plugin for Dawnguard&#33;",
  "descriptionHtml": "[heading][color=red]IMPORTANT - READ BEFORE UPGRADING:[/color][/heading]\r<br />\r<br />In order to improve compatibility with other add-ons (like Dawnguard) and to facilitate future upgrades, the mod is now a Masterfile.\r<br />\r<br />If you are upgrading to the Masterfile version from any version 3.1 or earlier, [b]YOU MUST REMOVE ANY ITEMS YOU HAVE STORED ANYWHERE ON THE SHIP, AND MOVE YOUR SPOUSE OUT, OTHERWISE THEY WILL BE LOST.[/b]  Once the Masterfile is loaded, it will be safe to move them back in.\r<br />\r<br />Packaged with the Masterfile is the Update Plugin, through which all fixes, tweaks, and new additions will come.  This is so you do not have to move all your equipment out of the ship and then back in with every new update.  Those who are updating from version 4.0 to 4.1 should not have to worry about this, since the masterfile itself is virtually unchanged, and the game will not know the difference.  That being said, do exercise caution, and back up your saves before upgrading.\r<br />After activating the mod with the NMM, look in the &#34;plugins&#34; tab and make sure both the &#34;okaazah.esm&#34; and &#34;okaazah_update.esp&#34; files are there in your load list.\r<br />\r<br />[line]\r<br />[color=yellow][heading]DEVELOPMENT LOG - DECEMBER 2013:[/heading][/color]\r<br />\r<br />[color=yellow][b]Here is a preview of the retextured ship[/b][/color]\r<br />\r<br />[img=center]http://static.skyrim.nexusmods.com/mods/images/16017-1-1365809110.jpg[/img]\r<br />\r<br />\r<br />[line]\r<br />[heading]DESCRIPTION:[/heading]\r<br />\r<br />Can&#39;t find a house in the game that suits you?  I know I couldn&#39;t.  So, I created my own place to live - the Okaazah (draconic for &#34;Sea Hunter&#34;), and now I&#39;m sharing it with you.  Once the pride of the Imperial fleet, the Okaazah has been stolen, salvaged, lost, and re-named many times, and has finally been stranded on Skyrim&#39;s north coast, captainless - until the Dragonborn came along.\r<br />\r<br />The ship is moored off of the north coast, just northwest of Solitude - you can fast-travel to it straight away.  It boasts full facilities for smithing, alchemy, and enchanting, as well as several mannequins and plenty of weapon racks.  In the Captain&#39;s Quarters you&#39;ll find even more storage, including several bookshelves, and a player-owned bed.  \r<br />\r<br />Also, there is an optional Dawnguard Extension for those who own the DLC.  This plugin adds a new ship location near Castle Volkihar, which becomes available after you either accept or refuse Lord Harkon&#39;s offer.  The new location is accessed by activating the Chalices found near the movement maps on the ship&#39;s deck and in the Captain&#39;s Quarters.  You can also find three new plants in the garden and a new ingredient in the alchemy/enchanting/shrine room.\r<br />The latest Dawnguard extension includes two new crew members, one for each side of the Dawnguard questline - Haegnar, a vampire hunter, and Talvila, a vampire.  After either joining or refusing Lord Harkon, one of these two will appear on board the ship, depending on which side you choose.  Both are followers who level with you, as well as merchants.\r<br />\r<br />[line]\r<br />[heading]LATEST VERSION:[/heading]  \r<br />v4.1 - fixed some issues with books clipping into furniture\r<br />- added a secret door for use by NPC&#39;s.  This is intended so your spouse can find their way to/from the ship so you don&#39;t have to teleport them with console commands, and so once I make some of the crew into followers, they can find their way back when dismissed.  All of my tests so far have yielded positive results, but if you have issues with it, let me know and I&#39;ll see what I can do.\r<br />\r<br />[heading]DAWNGUARD EXTENSION:[/heading]  \r<br />v1.1\r<br />- The Dawnguard extension now includes two new potential crew members, one Dawnguard, and one Vampire.  Once you have picked a side, the appropriate member will appear on board.  They are both followers and merchants.\r<br />- Added a Soul Husk to the ship&#39;s garden.\r<br />\r<br />[line]\r<br />[heading]MAIN FEATURES:[/heading]\r<br />\r<br />Your crewmembers are: [list]\r<br />[*]Rilus Selveran, the ship&#39;s first officer and a defector from the Imperial Legion\r<br />[*]Eradrath, an Altmer mage (sells Soul Gems and Spell Tomes)\r<br />[*]Gorlug Mor-Shuk, an Orcish blacksmith (sells weapons and armor)\r<br />[*]A&#39;Jimei, a Khajiit merchant (general goods vendor)\r<br />[*]Borruf, the quartermaster (sells food and drink)\r<br />[*]Fidaeri, a Bosmer ranger and alchemist (sells potions and ingredients)\r<br />[*]Sharida, a Redguard warrior\r<br />[*]Varyn Olo, a Dunmer archer\r<br />[*]Dives-In-Silence, an Argonian spellsword\r<br />[*]Lukira, a bard who will play you songs on request\r<br />[*]Krund, the mysterious prisoner in the ship&#39;s brig\r<br />[/list]\r<br />The Dawnguard Extension will give you one of two new members:[list]\r<br />[*]Haegnar, a vampire hunter who is a follower and sells Dawnguard merchandise\r<br />[*]Talvila, a Vampire, also a follower, who sells vampire merchandise.[/list]\r<br />\r<br />Other features include: [list]\r<br />[*]Working cannons&#33;  Later you&#39;ll have plenty of things to shoot with them\r<br />[*]A map behind the ship&#39;s wheel that lets you move the ship between several set destinations.  I couldn&#39;t get it as close to Dawnstar, Winterhold, or Windhelm as I&#39;d like (due to the water being so shallow), so you&#39;ll have to make do with the rowboats in some locations to get to shore.[/list]\r<br />[*] To access the Castle Volkihar location added by the Dawnguard extension, activate the Blood Chalice found in the Captain&#39;s Quarters, or any of the maps on the ship&#39;s deck.\r<br />\r<br />[line]\r<br />[heading]FUTURE PLANS:[/heading]\r<br />\r<br />[list]\r<br />[*] Introduction of the Radiant Sea Battle System (RSBS), providing a variety of new encounters at sea while sailing between destinations\r<br />[*] A means of recruiting followers into your crew.  They will live aboard the ship and can be assigned to defend the ship&#39;s deck in sea battles.  You can also choose an animal follower to be the ship&#39;s Mascot.\r<br />[*] Some of the crew members will become available as followers (and some as marriage candidates) immediately upon acquiring the ship.\r<br />[*] Many small enhancements to the existing interior space - improved lighting, additional mannequins and storage, busts for the Dragon Priest Masks, display racks for the Elder Scroll and Dragon Claws. \r<br />[*] A good, stable version of the previously buggy rowboat/oar boarding system.\r<br />[*] A whole new lower deck to accommodate additional features.\r<br />[*] An overhaul of the ship&#39;s travel system.  For the thousandth time, no, real-time sailing is not feasible for this mod, SKSE or not.  I have simply been streamlining the code used for movement, and making the feature easier to expand upon.\r<br />[*] A custom retexture of the ship&#39;s exterior, to make it visually distinct from the Katariah.\r<br />[*]There will be a short quest to complete to acquire the ship.  Also, the most complete side quest, the one centered around Krund, will be finished (since I don&#39;t want to waste the voice files I&#39;ve already gotten&#33;).  Two other side quests will be finished as well, since they mostly involve collecting items (which can be made to randomly spawn in dungeons).\r<br />[*] Some new features which were originally intended to be quest rewards will now be able to be looted from enemy ships, or purchased from Rilus Selveran or Eradrath with gold.\r<br />[*] New weapons, items, and spells which will be loot drops attainable from sea battles.\r<br />[*] New utilities and devices onboard the ship.\r<br />[*] Implementation with the marriage dialogue to allow your spouse to move into the Captain&#39;s Cabin.  This one may not make it in, as I have already tried to make it work, in many different ways, but with consistently disappointing results.  If you still want to try, I recommend using the [url=http://skyrim.nexusmods.com/downloads/file.php?id=11370]&#34;Spouses Can Live Everywhere&#34; plugin[/url], and making sure it loads AFTER this mod.  \r<br />I&#39;ve added in a secret door for use by your spouse only, intended to give them easy access to the ship.  The door seems to work, but is still being tested.  If it doesn&#39;t there are a couple ways around it - A) if your spouse is also your follower, and you lead them into the Quarters before asking them to move, or B) you teleport your spouse to you while you are in the cabin using the Console (open the console, click on them, close the console.  Travel to the Captain&#39;s Quarters, then enter &#34;moveto.player&#34;).  \r<br />The secret door should also allow them to move out on their own if you wish to move them to another house.  If it doesn&#39;t work, you&#39;ll have to either get them to follow you out, or teleport them again. [/list]\r<br />\r<br />DLC Support:\r<br />- Dawnguard: [list]\r<br />[*] A new system allowing you to swap out the new followers\r<br />[*] Serana can be recruited into your crew upon completing &#34;Kindred Judgment.&#34;\r<br />[*] Additional rare RSBS loot items. [/list]\r<br />- Hearthfire: [list]\r<br />[*] New crafting facilities will be added to the ship\r<br />[*] Support for adopted children to live on board.  \r<br />[*] Lukira, the bard&#39;s repertoire will be expanded. [/list]\r<br />- Dragonborn: [list] \r<br />[*] Ship locations to be added around the coast of Solstheim (Raven Rock, Tel Mithryn, Skaal Village, Northshore Landing)\r<br />[*] An unlockable staff enchanter and Spider Imbuer on board\r<br />[*] Two new crew members\r<br />[*] Frea can be recruited into your crew upon completing &#34;At the Summit of Apocrypha&#34;\r<br />[*] Even more new RSBS rare loot items [/list]\r<br />- Falskaar: [list] \r<br />[*] A ship location at the Falskaar Docks, unlocked upon completing &#34;Passage Home&#34; [/list]\r<br />- Wyrmstooth: [list]\r<br />[*] A ship location at the Wyrmstooth Docks, unlocked when you first journey to the island.\r<br />[/list]\r<br />\r<br />[line]\r<br />[heading]PERMISSIONS:[/heading]\r<br />\r<br />If you wish to make a translated version of this mod, please PM me so I can give my approval.  A Russian translation has already been done and is out there on the web, but so far no other languages have been covered.\r<br />\r<br />Since this mod is in .esm format, it is possible to made other plugins for it, as if it were one of the official DLC&#39;s.  If, on the off-chance that anyone decides to make one, please contact me and send me the file so I can test it myself.  The same applies if anyone wishes to make a compatibility bridge between this mod and their own.\r<br />\r<br />[line]\r<br />[heading]KNOWN BUGS:[/heading]\r<br />[list]\r<br />[*]I&#39;ve run into a problem during testing where the ship&#39;s crew would somehow appear in the water near the ship rather than on the ship itself, or in the rowboat.  This shouldn&#39;t occur on the current version of the mod, but be wary.\r<br />[*]Occasionally, when the ship moves, the crew&#39;s AI packages become confused, leaving them standing in one spot like they&#39;ve forgotten their stage cues until you move the ship again.\r<br />[*]Aforementioned issues with having your spouse live on board - they will likely not move to the ship themselves, and sometimes have problems getting through the door to the Quarters, even though the navmesh checks out.\r<br />[*]Some people have reported the ship disappearing entirely when they come near.  Mods which improve the behavior of LOD may (or may not) help keep this from happening.  I do not have this issue on my game, so unfortunately, I am unable to test it myself.\r<br />[*]This mod is not always horse-friendly, so I&#39;d advise being careful if you take your horse with you on the ship.  Conjurable horses like Arvak don&#39;t apply.\r<br />[*]Sometimes, characters will glitch into Krund&#39;s cell to use his chair and idle markers.  A possible fix has been worked out for this, and will be released with the next update\r<br />[/list]\r<br />[line]\r<br />[heading]CONFLICTS:[/heading]\r<br />\r<br />The vast majority of mods should be compatible with this one.  I&#39;m running well over 100 on my game with no conflicts.  Of course, checking with BOSS/Wrye Bash can&#39;t hurt if you want to be absolutely sure.\r<br />\r<br />The only vanilla quest that has undergone any real changes is the one that handles marriage dialogue.  The changes aren&#39;t apparent yet, but they will be in later versions.  As such, it is recommended that you set any mods that also affect marriage dialogue to load AFTER both the master file and the updater plugin.\r<br />Some of the quests that handle generic dialogue have been given very tiny changes, but nothing more than an extra conditional added to a couple dialogue lines which allows one of my NPC&#39;s to say them, as well as the vanilla NPC&#39;s they were intended for.  It is extremely unlikely that any conflicts will arise from these, unless you are using another mod that completely re-does generic dialogue.\r<br />The main, Civil War, and Guild questlines have not been touched.  If you&#39;re having a problem with any of those, then it has nothing to do with this mod.\r<br />\r<br />This mod alters relatively few vanilla Skyrim cells, and most are out at sea, off the northern coast.  The highest-risk area for conflicts is near the Solitude Docks, so exercise caution with mods that alter this area.  You may get crashes, or some very strange clipping of meshes.\r<br />Aside from the placement of a handful of actors, no further alterations to vanilla cells are planned.  \r<br />\r<br />The mods &#34;Wyrmstooth&#34; and &#34;Sea of Ghosts&#34; have proven to be compatible.  I have yet to test any other mods that change the Solitude Docks area to any significant degree.\r<br />\r<br />[line]\r<br />[heading]PAQ: (Preemptively Answered Questions)[/heading]\r<br />\r<br />[color=yellow]Q: Can you make it so the ship can be sailed in real-time?[/color]\r<br />A:  Sorry guys, but this isn&#39;t going to happen.  \r<br />The answer is no.  \r<br />One hundred percent, all the time, absolutely [b]no.[/b]\r<br />The scene of the ship arriving at Solstheim in the upcoming DLC held a teeny tiny bit of promise for a while, but it still doesn&#39;t account for the deck clutter, the crew that work on the deck, the doors, and the navmesh.\r<br />Some of those COULD be worked around with SKSE.  However, there is simply no way to account for a couple of them.  For instance, door markers (the ones that appear yellow in the CK, which indicate where an actor will warp to when they use a load door) cannot be moved with script.  I&#39;ve tried, and it doesn&#39;t work.\r<br />And navmesh.  Oh, the navmesh.  There is no way on Earth, Nirn, Oblivion, or Sovngarde to update navmesh in real-time.  No script extender can correct this.  It&#39;s an engine limitation, and is something that will not be changed until future Fallout or Elder Scrolls titles are released years from now.  Even that&#39;s just conjecture.\r<br />Without the navmesh in the proper place on the ship&#39;s deck, several other things stop working, namely the doors, the crew, and the player&#39;s followers.  I&#39;d have to completely scrap numerous features of the mod and completely screw over its stability just to make one new feature (which is ultimately little more than a gimmick, and also fairly useless) work properly.\r<br />Then, instead of hearing about the lack of real-time sailing, I would be receiving complaints about how users lost their followers mid-journey, or how they wish the crew could come back on deck, or how the activator used to access the ship&#39;s interior broke their game.\r<br />\r<br />So once again, [b]no, there will never be real-time sailing.[/b]  Please stop asking me about it.\r<br />\r<br />[color=yellow]Q:  Will it conflict with/does it require Dawnguard or Dragonborn?[/color]\r<br />A: The mod requires neither DLC, but will soon have bridge patches available to aid in cross-compatibility. \r<br />\r<br />Version 4.0 and later will not cause conflicts, but problems with earlier versions have been reported.\r<br />\r<br />[color=yellow]Q:  I don&#39;t like how you made Crewmember X.  Can you replace them with a Y, or alter them so that they Z?  And then can you plz retexture this to fit my roleplay?  Kthx[/color]\r<br />A:  I will not change or replace crew members on request, unless there is a bug or glitch that is adversely affecting gameplay.  For instance, there have been reports of the crew having the &#34;Dark Faces&#34; bug where their face and body colors don&#39;t match, so this will be addressed in the next version.\r<br />I will not customize the crew to suit your own personal canon/lore/preferences.  Tailoring it to one specific user&#39;s desires wouldn&#39;t be quite so fair on the couple thousand others who use this mod, now would it?  \r<br />The core of the mod is a .esm file, so you can make your own modifications to them with the CK if it&#39;s that important to you.\r<br />However, the crew [i]are[/i] being given backstories, quests, and interactions, and tweaks so that they can become followers/marriage candidates in version 5.0.\r<br />On a side note, the Civil War is dumb.  The Thalmor win either way.\r<br />\r<br />[color=yellow]Q:  Can you put in some sort of mechanic where you have to acquire the ship, as opposed to it being &#34;just there for you?&#34;[/color]\r<br />A:  This one&#39;s currently in the works, and will definitely be part of version 5.0 and onwards.  It will be relatively simple, though, since part of the canon is that the ship&#39;s previous captain was recently killed by a dragon, and they&#39;ve been without proper leadership for a while.\r<br />\r<br />[color=yellow]Q:  Can you put a ship location in &lt;place&gt;?[/color]\r<br />A:  I am trying to keep this mod within reasonable bounds of lore-friendliness.  A giant galleon sitting in a small lake with much of its hull clipping into the ground doesn&#39;t fall within those bounds.  Believe me, I wish the lakes and rivers near, say, Riften or Morthal were larger and deeper, but as it is, they just can&#39;t accommodate the ship&#39;s hull.\r<br />&#34;Why not just edit the terrain in the lakes,&#34; you ask?  Because mods that change the shape of the land are notorious for causing conflicts.  If you have any other mods that alter ANY objects nearby, all you would get would be CTD&#39;s if you got close.  Or, if you&#39;re lucky, plants and rocks suspended unnaturally in the air or under water.\r<br />On the lighter side of things, version 5.0 will come with improved support for Dawnguard, as well as support for Dragonborn, adding ship locations near Castle Volkihar and around Solstheim.\r<br />\r<br />[color=yellow]Q:  It&#39;s just a copy of the Emperor&#39;s ship&#33;[/color]\r<br />A:  Good for you, you played the Dark Brotherhood questline.  I&#39;m sorry if I don&#39;t feel like building a whole new ship interior from scratch when one already exists that I can edit and adapt to suit my own needs.\r<br />\r<br />[color=yellow]Q:  When will this &#34;next big update&#34; you keep mentioning be released?[/color]\r<br />A:  When it&#39;s damn well ready.  I have real-world obligations, and even minor upgrades need extensive testing.  This will likely be the final stage of the mod, so I don&#39;t have this albatross (or whatever the Tamrielic equivalent of an albatross is) hanging over me any longer.  I expect I&#39;ll need to do a few minor fixes after 5.0, but once those are taken care of, all the essentials will be in place.\r<br />\r<br />[line]\r<br />[heading]CHANGELOG:[/heading]\r<br />\r<br />v4.0  - The mod is now a Masterfile for improved compatibility and modularity\r<br />- Update plugin offers new bug fixes, such as fixing some non-disabling clutter and buggy wall mounts\r<br />- Dawnguard extension adds new ship location at Castle Volkihar, plus new plants and ingredients on board\r<br />v3.1 - Fixed some buggy weapon racks\r<br />- Added a Cooking Pot behind the bar where Borruf works\r<br />- The usable travel map in the Captain&#39;s Quarters is now the larger, wall-mounted map rather than the one on your desk.\r<br />v3.0  - Smoothed over the stairs, so actors should no longer &#34;stick&#34; when walking on them\r<br />- Added in some missing AI packages to the crew\r<br />- Fixed the Rowboat transport system for getting to and from the ship without fast-travelling\r<br />- Shrines for all Nine Divines can be found in the Enchanting/Alchemy room\r<br />- Added a Ship-Movement map in the Captain&#39;s Quarters, on the writing desk\r<br />- deleted some broken NPC greetings\r<br />- fixed the Windhelm trapdoor\r<br />v2.1 - removed Nirnroot and fixed disappearing wall bug\r<br />v2.0 - added crew members and movement system, and new features to ship&#39;s interior\r<br />v1.0 - original upload",
  "categoryId": "67",
  "version": "v4.1",
  "author": "Kingston3K",
  "createdUnix": "1335579256",
  "updatedUnix": "1346120738",
  "containsAdultContent": false,
  "uploadedBy": "TheAmazingDerpMan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "56904",
      "name": "Okaazah rev0",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "205",
      "fileName": "Okaazah rev0-16017.zip",
      "uploadedUnix": "1335579327",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/32ea32adf10668364efd012715e9556fa69f4d987a2a8a7932bb73e99366d5f4/analysis/1406844424/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Okaazah%20rev0-16017.zip?fid=56904&ttl=1535780901&ri=8192&rs=8192&setec=c9554e81fa64f09d56b21be04dcaffb2"
    },
    {
      "fileId": "58519",
      "name": "Okaazah rev1",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "487",
      "fileName": "Okaazah rev1-16017.zip",
      "uploadedUnix": "1336115189",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/a2c2f31b7a746a49b3586ad327ae1e7bee2c44dc2673de3ef9966363d3be06ff/analysis/1406864945/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Okaazah%20rev1-16017.zip?fid=58519&ttl=1535780902&ri=8192&rs=8192&setec=69759648dd9980ca600df4dd5b536f4f"
    },
    {
      "fileId": "59055",
      "name": "Okaazah rev1-1",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "488",
      "fileName": "Okaazah rev1-1-16017-2-1.zip",
      "uploadedUnix": "1336265757",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/be3af6e9537194bd2fc39e3d9d43c5106685597fd9e630e6684060e3868a9da7/analysis/1406870533/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Okaazah%20rev1-1-16017-2-1.zip?fid=59055&ttl=1535780902&ri=8192&rs=8192&setec=067eab10d22b67e88f7e9524fd24b93b"
    },
    {
      "fileId": "71316",
      "name": "Okaazah rev2",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "491",
      "fileName": "Okaazah rev2-16017-3-0.zip",
      "uploadedUnix": "1341097499",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/645eb767b6142ca7742b68ede4141d78a014bb0462668181c1ff2871832a6c95/analysis/1406992943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Okaazah%20rev2-16017-3-0.zip?fid=71316&ttl=1535780903&ri=8192&rs=8192&setec=73054f87e16b7ae8dff6b44493d71452"
    },
    {
      "fileId": "72708",
      "name": "The Okaazah v3-1",
      "version": "v3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "492",
      "fileName": "The Okaazah-16017-v3-1.zip",
      "uploadedUnix": "1341638472",
      "modVersion": "v3.1",
      "virusScanUrl": "https://www.virustotal.com/file/dde6d77a95c51383fa8820b33b6288bba8cf4b69c9f9c00f854fc48c6618527b/analysis/1407006905/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Okaazah-16017-v3-1.zip?fid=72708&ttl=1535780903&ri=8192&rs=8192&setec=9886cc18934fdfa98d79c3148651fcdf"
    },
    {
      "fileId": "84239",
      "name": "Okaazah Masterfile",
      "version": "v4.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "687",
      "fileName": "Okaazah Masterfile-16017-v4-0.zip",
      "uploadedUnix": "1345938610",
      "modVersion": "v4.0",
      "virusScanUrl": "https://www.virustotal.com/file/ac66b214511d0ef4505991d08b2b687c1156e75c02d2d45a9c4c2488fb0e72e0/analysis/1407121744/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Okaazah%20Masterfile-16017-v4-0.zip?fid=84239&ttl=1535780904&ri=8192&rs=8192&setec=98520b963b15ad5b5b3fbc0a28a93134"
    },
    {
      "fileId": "84240",
      "name": "Okaazah Update Plugin v1",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "Okaazah Update Plugin-16017-v1-0.zip",
      "uploadedUnix": "1345938698",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9e75764a55ecff5fb588278f706a0a253d5343c16212bbfcdd98a3166caa1036/analysis/1407121802/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Okaazah%20Update%20Plugin-16017-v1-0.zip?fid=84240&ttl=1535780904&ri=8192&rs=8192&setec=9b79b79ac0146d5154b7643a772a00e6"
    },
    {
      "fileId": "84241",
      "name": "Okaazah Dawnguard Extension v1",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "970",
      "fileName": "Okaazah Dawnguard Extension-16017-v1-0.zip",
      "uploadedUnix": "1345938800",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d623d6f7872de169df50f0920cf8539361901ce37633bfe179b0abff8f440a7f/analysis/1407121803/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Okaazah%20Dawnguard%20Extension-16017-v1-0.zip?fid=84241&ttl=1535780905&ri=8192&rs=8192&setec=86fd15f52600904d0fba5de49731f355"
    },
    {
      "fileId": "84745",
      "name": "Okaazah Masterfile and Update Plugin v4-1",
      "version": "4.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "777",
      "fileName": "Okaazah Masterfile and Update Plugin-16017-4-1.zip",
      "uploadedUnix": "1346120630",
      "modVersion": "4.1",
      "virusScanUrl": "https://www.virustotal.com/file/2bba0766c9b6cdf6997f877946765a6f658dd58554e1af634204179a3ef41c6a/analysis/1407127092/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Okaazah%20Masterfile%20and%20Update%20Plugin-16017-4-1.zip?fid=84745&ttl=1535780905&ri=8192&rs=8192&setec=1ac73dfb11ee261d7089da8d2b55ec8a"
    },
    {
      "fileId": "84747",
      "name": "Dawnguard Extension",
      "version": "v1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "972",
      "fileName": "Okaazah Dawnguard Extension-16017-v1-1.zip",
      "uploadedUnix": "1346120738",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/847d0a197375d3e486878aa3adc076d0b479bfb3e2187a749212b63564ab0452/analysis/1407127144/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Okaazah%20Dawnguard%20Extension-16017-v1-1.zip?fid=84747&ttl=1535780905&ri=8192&rs=8192&setec=0fb1d8b34638a185eaa23ee53c626989"
    }
  ]
}