{
  "modId": 16012.0,
  "modName": "Glass Mage Armor by Natterforme",
  "summary": "This is a Nexus Exclusive. Adds a set of unique standalone armor intended for medium to higher level mage players. ",
  "descriptionHtml": "Name: Glass Mage Armor by Natterforme\r\n Version: 1.0\r\n Date: 4/27/2012\r\n Category: Weapons and Armor\r\n Recommended: Skyrim Mod Manager\r\n Author(s): Natterforme\r\n Source: \r\n \r\nDescription\r\n ===========\r\n This is a Nexus Exclusive. Adds a set of unique standalone armor intended for medium to higher level mage players. \r\n \r\nLocation\r\n ========\r\n The armor can be crafted at any forge under certain conditions. \r\n\r\nDetails\r\n =======\r\n THIS IS A NEXUS EXCLUSIVE! NO STEAM SUPPORT WILL BE OFFERED AT THIS TIME! IF I FIND THAT THIS HAS BEEN UPLOADED TO STEAM WITHOUT MY PERMISSION I WILL NOT BE LENIENT TOWARDS THE UPLOADER(S). YOU HAVE BEEN WARNED!!!\t\r\n \r\n This mod needs to have the High Resolution Texture Pack installed in order to work. You do not need it activated, you simply need it installed in your Data textures folder in order to take advantage of resources. \r\n\r\nThis mod uses heavily modified glass armor textures provided, with permissions, by JESSETIN3. He has several high quality glass retexture mods available here:http://skyrim.nexusmods.com/modules/members/index.php?id=519553\r\n\r\nHis textures are not required to be installed for this mod to work, as his mod is a replacer and my mod is a stand alone with altered and added textures. You should still consider downloading his mods though, as they are high quality.\r\n\r\nThere are several ways to obtain the armor set and it comes in three different colors. The colors provided in the initial release are:\r\n\r\n-Skyrim Vanilla\r\n-Ashlander Silver\r\n-Outlander Gold\r\n\r\nEach color varient can be used either in conjuction with a combination of the other two color choices or on its own. You do not need to download different files or overwrite your textures folder when you want to change your color retexture. Each color comes with its own .esp file, which you can check or uncheck in your data files section on the Skyrim launcher. The items have been named ingame differently so that you can more easily discern which color is which.\r\n\r\nNote: The Skyrim Vanilla version uses vanilla Skyrim resources to find its texture paths so there is no seperate texture folder for it. \r\n\r\nThere are several ways to obtain the armor, each with different varients depending on your method of crafting. Each armor piece comes with a Light Armor option and a Non-Armor option. The Light Armor option must be crafted at the forge with the Glass armor smithing perk and will give you a boost to the Light Armor skill perk tree. The Non-Armor version can be crafted at the forge without the need for the Glass Smithing perk and will give a boost to the Mage Armor Skill perk tree. This option requires that each piece of armor to be crafted needs an additional 4 Greater Filled Soul Gems in addition to its normal requirement for a total of 5 each. This is to make up for the fact that you do not need the Glass Smithing Perk in order to craft it. Pieces crafted with the Glass Smithing Perk will have the Prefix ARMORED before its name and will have an armor rating equivalent to that of glass armor. It is treated as Light Armor when walking or running ro sneaking. The clothing versions have no armor rating and are treated as clothing when walking or running or sneaking.\r\n \r\nInstall\r\n =======\r\n You can either download this mod with the Nexus mod manager or download the files and extract into the Skyrim data folder. Be sure to check the tick box in your data files section on the Skyrim launcher.\r\n \r\n\r\nUninstall\r\n =========\r\n Either use Nexus Mod Manager to remove the files or manually remove them from you Skyrim/Data folder. \r\n\r\nUpgrade\r\n =======\r\n I plan to upgrade and improve this mod over time as I fix bugs, think of new ideas, become more adapted to the CK, and so on. Be sure to check back in once and awhile for updates. Be sure to completely uninstall any previous versions of this mod before upgrading though.\r\n \r\nI will not take responsibility for corrupted save games or lost save games. Get into the habit of backing up your saves to protect your game data. Ignore at your own risk!\r\n\r\nIncompatibility\r\n ===============\r\n This armor set is standalone and should not conflict with other armors or changes. If you find that it does conflict with another mod, please notify me through PM and I will look into solving the issue. However, please exhaust all efforts to determine the cause of the conflict before contacting me, as to give me as clear of a picture as possible of what the problem is.\r\n \r\nKnown Issues or Bugs\r\n ====================\r\n-Each piece of head gear is assigned to a specific race. Depending on your character, you must make sure that you are crafting the correct piece that goes with your race in order to ensure compatibility. If you are not wearing the headgear appropriate to your character\\'s race, it is guarenteed to look incorrect.\r\n\r\n-Under certain lighting conditions, the skirts appear to be ragged or messed up. This is not the case in most lighting conditions but since I do not use lighting mods I can not guarentee that this armor will look good in X,Y,Z lighting mod.\r\n \r\n-There are a lot of armor, recipe, and tempering forms. It is entirely possible that I missed one here or there or that I messed up the conditions for crafting and what not. Please let me know if you notice a problem.\r\n\r\nHistory\r\n =======\r\n\r\n4/27/2012-Version 1.1 \r\n-Fixed issue causing the Vanilla version to appear incorrectly.\r\n\r\n 4/27/2012- Version 1.0 Initial Release\r\n \r\nContact\r\n =======\r\n You can find me on the Nexus Forums here as Natterforme.\r\n \r\nCredits\r\n =======\r\n Thanks to Omesean for his continued input, advice, and consultation.\r\n Thanks to JESSETIN3 for allowing me to use his retextures as a base for my Morrowind style retextures.\r\n Thanks to Bethesda for creating Skyrim.\r\n Thanks to SkyrimNexus.com for the a one-stop-shop resource for authors and players.\r\n Thanks to LHammonds for the Readme Generator this file was based on.\r\n Thanks to all of you who have encouraged me and have supported this armor mod since I first put up screenshots of it back in December 2011 and January 2012.\r\n I thank you all for your patience with me^^.\r\n Thanks to God for creating us all. Amen.\r\n \r\nTools Used\r\n==========\r\n7-Zip - http://www.tesnexus.com/downloads/file.php?id=15579\r\nBlender - http://www.tesnexus.com/downloads/file.php?id=12248\r\nNIFSkope - http://niftools.sourceforge.net/wiki/NifSkope\r\nNexus Mod Manager \r\nPaint.NET - http://www.tesnexus.com/downloads/file.php?id=11909\r\nPhotoshop - http://www.adobe.com/products/photoshop/\r\nReadme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r\n\r\n Licensing/Legal\r\n ===============\r\n This is a Skyrim Nexus Exclusive.\r\n\r\n You MUST contact me before you do anything with this mod in any form for any reason. This includes language translations. I will NOT be providing Steam Workshop support at this time. I do not feel comfortable with their legal policies towards modding so I will not use it. I will not support or endorse its use at this time. If I want it to be on Steam, I will do so myself. If you see this on Steam, LET ME KNOW! I will not support any version of this mod found on Steam. I will not accept any childish excuse about \\\"sharing\\\" with the community. If you refuse to respect my wishes, I can not, in good faith, respect yours.\r\n\r\n -Natterforme\r\n ",
  "categoryId": "54",
  "version": "1.05",
  "author": "Natterforme",
  "createdUnix": "1335569584",
  "updatedUnix": "1335582691",
  "containsAdultContent": false,
  "uploadedBy": "Natterforme",
  "primaryFile": null,
  "files": [
    {
      "fileId": "56877",
      "name": "Glass Mage Armor ver1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28952",
      "fileName": "Glass Mage Armor ver1_0-16012.zip",
      "uploadedUnix": "1335569975",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d9a42f189a53fcea941008adc75cb5aa064ae13160319f832cda5a1caf62509b/analysis/1406844207/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Glass%20Mage%20Armor%20ver1_0-16012.zip?fid=56877&ttl=1535780894&ri=8192&rs=8192&setec=db16226ad51585ba5586b63befcd41b6"
    },
    {
      "fileId": "56917",
      "name": "Glass Mage Armor ver1_05",
      "version": "1.05",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28952",
      "fileName": "Glass Mage Armor ver1_05-16012-1-05.zip",
      "uploadedUnix": "1335582691",
      "modVersion": "1.05",
      "virusScanUrl": "https://www.virustotal.com/file/dc25deff1647e792b25581a9cbd79e9f7e43b2f1d6bbe59b21218c3b0e185462/analysis/1406844691/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Glass%20Mage%20Armor%20ver1_05-16012-1-05.zip?fid=56917&ttl=1535780894&ri=8192&rs=8192&setec=0512e122eb7ea569d6dbfc1d5d2f6cac"
    }
  ]
}