{
  "modId": 16022.0,
  "modName": "PJs Spell Compendium for Skyrim",
  "summary": "New spells: Darkness Blade Storm, Web, Sleet!  Adds 18+ completely unique spells unlike anything else in the game.  Use telekinesis on enemies, summon earthquakes, tornados and acid rain, jump to new heights, conjure magically heat sinking missiles, and many more!",
  "descriptionHtml": "Remember to endorse and/or vote if you like this mod and want me to develop even more complex and interesting spells!  Endorsing lets me know you like what I have done so far and encourages me to continue!  Also, don\\'t forget to leave feedback in the comments section to let me know what you like, don\\'t like, or if you have any new spell ideas.\r\n\r\n[Size=14][color=ff6666]Whats New in Version 1.21:[/color][/size]\r\nScripts correctly placed in folders fixing issues with darkness and magic missiles spells\r\n\r\n[Size=14][color=ff6666]Whats New in Version 1.2:[/color][/size]\r\n[color=ff6666]New Spell![/color]:\r\nDarkness: Illusion of darkness around the player causing confusiong and disorientation for your enemies.  You can see them but they can\\'t see you!\r\n[color=ff6666]Spell Updates[/color]:\r\n-Fixed bug with Magic Missiles causing only one missile type to show up, not all four missile types will show up randomly\r\n-No more cooldown for Magic Missiles\r\n- Damage increase and accuracy for many area of effect spells including Acid Rain, Blade Storm, Lightning Columns, Fire Spouts and Magic Missiles\r\n\r\n[Size=14][color=ff6666]Whats New in Version 1.1:[/color][/size]\r\n[color=ff6666]New Spells![/color]:\r\nBlade Storm: Summons a whirlwind of daggers flying around your current spot, slicing and dicing anyone foolish enough to come close to you.  Demo of the spell are here http://www.youtube.com/watch?v=tmv3j5N0TFc and here http://www.youtube.com/watch?v=HmM0JOcjf8Q\r\nSleet Storm: Summons a storm that drops icy sleet down on your enemies.  Anyone hit is frozen completely for two seconds.  Demo of spell here http://www.youtube.com/watch?v=hA0ccpkpHiM\r\nWeb: Creates a sticky web at the targets location trapping and immobilizing the target and anyone close by.  Demo here http://www.youtube.com/watch?v=CKc59pECyK8\r\n\r\n[color=ff6666]Spell Updates[/color]:\r\nAssasins Rush: Damage changed to be a percentage of the targets full health, not current health.  This will make killing with this spell much easier\r\nDecoy: No longer able to pickpocket your decoy\r\nFire Spouts: Area damage increased, should hit enemies far more often now\r\nLightning Columns: Area damage increased, should hit enemies far more often now\r\nMagic Missiles: Cooldown reduced and number of missiles increased\r\nTelekinesis: Stutter had been practically eliminated, although to make this happen the movement speed had to be reduced a little bit.  If the enemy is not thrown now he/she will be thrown backwards at spell end.  Damage done also now scales with your alteration skill.  Example here http://www.youtube.com/watch?v=pLKtIm58V-o\r\n\r\n[color=ff6666]Coming Soon![/color]:\r\nNew spells including Darkness, Tsunami, Health Leach spell using Magic Missile mechanics, illusion spell turning target into a scared child, and a few others\r\n\r\n\r\nPlease watch trailer for demonstration of each of the spells.\r\n\r\n\r\n[size=24][color=blue][b][center]PJ\\'s Spell Compendium[/center][/b][/color][/size]\r\n\r\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n[size=14][b]Trailer:[/b][/size]\r\n\r\n[center][youtube]42zfuTdFAIc[/youtube][/center]\r\n\r\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n[b][color=#ff6666]What does it do?[/color][/b]\r\nThis mod introduces a collection of 18+ unique scripted spells to aid in your conquest of Skyrim.  These spells range from utilitarian spells such as adding capability to jump to new heights to spells that call on the massive desctruction of earthquakes and acid rain.  Ever wanted to use telekinesis on an enemy?  Well now you can!  Pick them up and fling them in any direction.  I went out of my way to create unique spells that are unlike anything else found in the game or other spell mods.  Those tend to only emphasize the stereotype of the magic user being a glass cannon shooting spells that may all look different but effectively simply do the same thing.  With my mod you can knock down foes continuously with an earthquake, jump to the top of a rooftop, swap places with a hiding enemy, create a decoy to fool a monster, sneak behind and stab an opponent, have a magic user\\'s own magic blow up in his face, summon magical missiles that track enemies no matter where they run, and many more!  If you played the first year of Oblivion you may remember my mod which added many similar spells, in fact many of those spells can now be found in Skyrim proper such as traps, meteor storm, rapid fire, push, cloaks, and lightning strike.\r\n\r\nWhere can these spells be found?  After being expelled from the Winterhold College for the practice of these dangerous and unpredictable spells the mage Phineus Jamison can now be found peddling the tomes in the cellar of the Frozen Hearth in Winterhold town.  All spells are balanced to the best of my ability, however it must be noted that I have not played very far into Skyrim so have not tried every spell in every situation.  If you find a spell is overpowered or underpowered please let me know and I will see what I can do in future updates.  If you simply want to try the spells out without requirements just to see how they play look at the cheats section below for directions.\r\n\r\nI am still creating new spells and will update often as more become available.  If you have any suggestions please let me know!\r\n\r\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n[b][color=6666ff]Installation:[/color][/b]Install using your favorite mod manager, everything should go where it is supposed to go.  If done manually, make sure you follow the same file structure as what is found in the compressed file.\r\n[b][color=6666ff]Uninstall:[/color][/b]Uninstall using your mod manager.  If it must be done manually, make sure to delete out every file in every folder that starts with the letters PJ.\r\n[b][color=6666ff]Compatibility:[/color][/b]  I used all of my own objects so this mod should not conflict with any other magic mod such as Midas or Phenderix.  Only possible conflict is if a mod modified the cellar of the Frozen Hearth in Winterhold.\r\n\r\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n[size=14][b][heading]Spell List[/heading][/b][/size]\r\n\r\n[color=66ff66]Telekinesis[/color]:  Traps your enemy in a stasis field of electricity allowing you to move around them around and eventually fling them in any direction you like.  To fling, simply move your target quickly left, right, up or down and watch as they are flung in that direction.  Minor damage is done to the enemy depending on direction flung with downward providing the most damage, upward the second most, and left/right the least.  Use this spell to drop enemies off cliffs, into the water, or simply to move them out of the way.\r\n\r\n[color=66ff66]Magic Missiles[/color]:  Summon orbs of magic that surround you and seek out and follow enemies in every direction eventually dealing random types of damage including fire, ice, electricity, and paralysis.  Higher conjuration levels produce higher number of missiles.  If no target is found after a certain amount of time the missiles will disappear.  Due to the high desctructive power of these missiles this spell can only be cast once every 30 seconds.\r\n\r\n[color=66ff66]Tornado[/color]:  Creates a vortex of wind surrounding your enemy, incapacitating them as they are flung around and around.  Enemies caught in the tornado are invincible til the spell wears out.  Very useful for crowd control.\r\n\r\n[color=66ff66]Earthquake[/color]:  Summon a massive earthquake causing all enemies around you to consistently stumble and fall to the ground.  Higher conjuration levels increase these chances.  Use this spell to cause havoc then mop of the pieces with your weapons while your foes try to regain balance.  Does not affect friendlies.\r\n\r\n[color=66ff66]Hurricane[/color]:  Summon a hurricane with winds strong enough to push away and knock over your enemies.  The higher your conjuration score the higher the probability of knockdown.  The wind direction depends on your initial direction while casting the spell.  Not castable indoors.  Use this spell to keep enemies away while you pummel them with other spells or arrows.  Does not affect friendlies.\r\n\r\n[color=66ff66]Fire Spouts[/color]:  Creates spouts of fire from the ground at random locations around you causing massive damage to anyone caught in the flames and minor damage to those who step into the fires left behind.  The spouts consistently jump around you and higher desctruction levels will produce more spouts.  The spouts will not affect friendlies but the remaining fires will although noone will blame you for them.\r\n\r\n[color=66ff66]Lightning Columns[/color]:  Creates columns of lightning that move randomly around you causing massive damage to anyone who stands in their way.  Higher destruction levels will produce more columns.  These columns do not affect friendlies and this spell is not castable indoors.\r\n\r\n[color=66ff66]Acid Rain[/color]:  Creates a storm that rains down acid rain on your enemies causing damage to health and damage resistence.  Higher destruction levels create more rain.  Does not affect friendlies and is not castable indoors.\r\n\r\n[color=66ff66]Assassin\\'s Rush[/color]:  Teleport behind your enemy dealing massive sneak damage.  The higher your sneak attribute the higher the damage, up to 75% of the enemies initial health.  Only castable with a dagger in your main hand.\r\n\r\n[color=66ff66]Decoy[/color]:  Creates a decoy of yourself that fools enemies into attacking it.  After several seconds the decoy will explode throwing enemies close by to the ground.  Great for crowd control or escaping.  Decoy will be equipped in default armor due to the difficulty in figuring out what armor the user is currently wearing.  If anyone knows of a way to do this easily please let me know since it would add to the illusion.\r\n\r\n[color=66ff66]Backfire[/color]:  All enemy magic users have a chance of having their own magic backfire in their face propeling them backwards.  Doesn\\'t cause damage but does stun the enemy.  The higher your alteration score the higher the probabilty of backfire up to 100% for 100 alteration.  Does not affect friendlies.\r\n\r\n[color=66ff66]Clone[/color]:  Create smaller clones of your enemy that will attack.  Comes in three flavors depending on the number of clones you plan on summoning.  Imagine the confusion of being attacked by three mini versions of yourself!\r\n\r\n[color=#66ff66]Jump[/color]:  Allows the user to jump to amazing heights.  Comes in three flavors, Jump 1 is 10 feet, Jump 2 is 30 feet, Jump 3 is 100 feet.  While the spell does propel you forward a little bit keep moving forward during the fall to move even farther.\r\n\r\n[color=66ff66]Swap[/color]:  Swaps places between you and your enemy.  See an enemy in a spot you want to get to?  Swap with them!  Want to be extra creative?  Jump to a high out of the way spot then swap places with an enemy, effectively taking them out of the battle.\r\n\r\nHave too many spells in your book?  Look for my mod PJ\\'s Forget Spell to start deleting out useless spells that are wasting space in your spell book.\r\n\r\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n[size=14][b][heading]FAQ:[/b][/heading][/size]\r\n[b][color=yellow]Q:Why doesn\\'t spell XYZ cause more damage or why can I drop someone 100 feet with telekinesis and yet they live?[/b][/color]\r\nA: I want very much for this to be a balanced and useful spell mod, as such I am trying to steer clear of spells that effectively end up being instakill.  While fun to play with at first it makes the game far too easy if you can simply point at any enemy and just kill them.  That is why some of my spells have a random effect on them, such as lightning columns or magic missiles.  While very powerful, there is no guarantee you will hit what you want to hit.  This is also why I have to turn off damage for such spells as Tornado and Telekinesis since even a five foot fall can sometimes kill the strongest warrior depending on what type of mood the havoc engine is in.  While I am open to changing spells to cause more damage to actually make them useful, I will never go down the route of instakill if I can help it.\r\n\r\n[b][color=yellow]Q: Any plans for quests to aquire these spells instead of having Phineus simply sell them?[/b][/color]\r\nA: Errr... maybe.  To be honest with family and work I  only have at most a few hours a week to spend and I would MUCH rather spend that time experimenting and trying out new spell concepts than debugging and getting frustrated with the quest system in the creation kit.  Not to say this wouldn\\'t happen, just saying this isn\\'t a very high priority for me right now.  If someone else would like to tackle this for me let me know and we can talk.\r\n\r\n[b][color=yellow]Q: Can you make this new visual effect?[/b] [/color] \r\nA: Again, maybe...  I have very limited knowledge of how to muck with custom meshes, pretty much the simple things such as changing colors or sizes.  If your idea is only a slight tweak of an existing model or can be done within the confines of the creation kit through scripts or shaders then its possible, otherwise don\\'t hold your breath.  Again, if someone wants to help out in this realm I am open for suggestions.\r\n\r\n[b][color=yellow]Q: My spell visuals such as telekinesis are a little choppy, why?[/b][/color]\r\nA: When I worked with Oblivion I was able to do calculations and updates every frame. This is not the case with Skyrim unfortunately.  What does this mean?  Well, for some of the spells that require more math and constant updates (Telekinesis, Magic Missiles and possibly a couple others) the visuals may get a little choppy if your computer can\\'t handle it.  When your computer gets bogged down memory wise the game may only call my scripts once every 5-10 frames and there is nothing I can do about that.  If you already have a low frame rate due to your visual settings or from other memory intensive mods, you might have problems with a couple of these spells.  If you look at my videos you will see I have a problem due to the video recording software I am using sucking up a lot of my framerate.  In game for me these spells work much smoother without the video recording tool.  If this becomes a serious problem for a lot of people I will see what I can do to possibly streamline these effects, otherwise I suggest lowering some of your game visual requirements and disabling hefty texture mods.\r\n\r\n[b][color=yellow]Q: Any chance you can have other spellcasters cast these spells?[/b] [/color]\r\nA: Eventually I would like to do this to balance the scales.  The one problem is most of my spells are not spammable and it is not easy to get the AI to not try and spam the same spell over and over again.  Not unsolvable, just a pain to get it to work right.\r\n\r\n[b][color=yellow]Q: What spells are you currently working on?[/b] [/color] \r\nA:  More illusion based spells such as darkness, confusion, and similar.  Also trying to make a convincing tsunami spell although I am having trouble coming up with what one would accomplish.  Also more telekinetic type spells and earth type spells.  Again, any ideas for new spells or ways to improve the current spells let me know!\r\n\r\n[b][color=yellow]Q: I have a spell idea and/or bug with a current spell![/b][/color]\r\nA: Great, let me know!\r\n\r\n--------------------------------------------\r\n\r\n[size=14][B][heading]Cheats[/heading][/b][/size]\r\n\r\nIf you want to gain the spells without paying for them and with low magicka costs and maximum power, use the console.  For example, if you wanted Magic Missiles at full power, press the \\'`\\'key, type help \\\"Magic Missiles\\\".  You\\'ll see a list of spells and magic effects.  Take the number/letter combination after the spell and type player.addspell xxxxxx where the x\\'s are the number/letter combination found in the last step.  Then mod your conjuration skill to max and set to god mode and have fun!\r\n\r\nExample:\r\nPress \\'`\\'\r\nhelp \\\"Magic Missiles\\\"\r\nSPELL(\\\"Magic Missiles\\\") 2A4422BB\r\nplayer.addspell 2A4422BB\r\nplayer.modav conjuration 100\r\ntgm\r\n\r\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n[size=14][B][heading]Thanks:[/heading][/b][/size]\r\nTo all those who have helped in the forums.  Also big thanks to the people of Riverwood who were electrocuted, flamed, and tossed all in the name of spell research.",
  "categoryId": "75",
  "version": "1.21",
  "author": "pjyelton4476",
  "createdUnix": "1335590351",
  "updatedUnix": "1338870433",
  "containsAdultContent": false,
  "uploadedBy": "pjyelton4476",
  "primaryFile": null,
  "files": [
    {
      "fileId": "56930",
      "name": "PJs Spell Compendium",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "90",
      "fileName": "PJs Spell Compendium-16022.rar",
      "uploadedUnix": "1335590407",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7713973274e983fb4a234aa873f55f82eaf397b0806c52a1667b46a8e0009645/analysis/1406844723/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PJs%20Spell%20Compendium-16022.rar?fid=56930&ttl=1535780912&ri=8192&rs=8192&setec=bcf237cb8f6df157fbabebe8110a304e"
    },
    {
      "fileId": "57231",
      "name": "PJs Spell Compendium v1_01",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "87",
      "fileName": "PJs Spell Compendium v1_01-16022.rar",
      "uploadedUnix": "1335678318",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/3dee2b2a93b509848c5624bbadc757fb82b632823325d0fbcb233bfaf7d3a046/analysis/1406853123/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PJs%20Spell%20Compendium%20v1_01-16022.rar?fid=57231&ttl=1535780913&ri=8192&rs=8192&setec=b43802769caae09474f174a4974a0961"
    },
    {
      "fileId": "62249",
      "name": "PJs Spell Compendium For Skyrim 1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "543",
      "fileName": "PJs Spell Compendium For Skyrim 1_1-16022.rar",
      "uploadedUnix": "1337402445",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d885a36d75392f8ad0a436f328012f447a7fd2c83363df82ab5b57443a10b004/analysis/1406901902/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PJs%20Spell%20Compendium%20For%20Skyrim%201_1-16022.rar?fid=62249&ttl=1535780913&ri=8192&rs=8192&setec=e2bec3c7948cce3b418476670d649419"
    },
    {
      "fileId": "64877",
      "name": "PJs Spell Compendium for Skyrim v1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "559",
      "fileName": "PJs Spell Compendium for Skyrim v1_2-16022.rar",
      "uploadedUnix": "1338494416",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/dcbade233a4692fc9173a576508ce7d38bc5c1cc6d6557ecde789626eaf0c095/analysis/1406928391/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PJs%20Spell%20Compendium%20for%20Skyrim%20v1_2-16022.rar?fid=64877&ttl=1535780914&ri=8192&rs=8192&setec=b66aba3ff1e646f70aa2fecd87841bf6"
    },
    {
      "fileId": "66015",
      "name": "PJs Spell Compendium v1_21",
      "version": "1.21",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "567",
      "fileName": "PJs Spell Compendium v1_21-16022-1-21.rar",
      "uploadedUnix": "1338870433",
      "modVersion": "1.21",
      "virusScanUrl": "https://www.virustotal.com/file/f0b58279e8125cab55315c32aed16e6bc1206f083c78e60ef4747992a1a9352c/analysis/1406939299/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PJs%20Spell%20Compendium%20v1_21-16022-1-21.rar?fid=66015&ttl=1535780914&ri=8192&rs=8192&setec=74248b92651ba72a2f03af3fc4a9d9c4"
    }
  ]
}