{
  "modId": 16079.0,
  "modName": "GRRL Vanilla Armor and Clothes",
  "summary": "This is a armor and clothing replacer for the GRRL body shape",
  "descriptionHtml": "The GRRL body now has clothes and some armor.  This is a WIP, so expect more conversions as I get time and the proper permissions.  All these were made using Caliente\\'s amazing Bodyslide tool, and Moonballz spectacular sliders. \r\n\r\nI highly recommend every living organism to install and play around with BodySlide.  If Baby Jesus made a Skyrim mod, it would be something like this.  Cause I think it is magic, or some sort of Voodoo.  \r\n\r\nAny who, GRRL and these armors are all based on CBBE.  So if it works for CBBE then it works for GRRL.  \r\n\r\nI recommend first installing my GRRL body found here: http://skyrim.nexusmods.com/downloads/file.php?id=12707\r\n\r\nIncluded are Navetsea\\'s awesome textures, but his newest textures are even better, and have a million options.  Get them here:  http://skyrim.nexusmods.com/downloads/file.php?id=6554 \r\n\r\nUnzip my file, and drop the Data folder found inside into your Skyrim folder, and overwrite if need be.  BOOM!  Your done.  There is also a \\\"optional\\\" folder, which is explained in the README.  It contains the GRRL preset for BodySlider, and what not.  If you are not going to use Bodyslide then you can ignore it.  \r\n\r\nThanks to Caliente for basically doing everything, and MoonBallz (RIP) for doing everything else.  I did the GRRL body, and Navetsea has provided the textures for GRRL.  United we rise, divided we fall.  Peace out! \r\n\r\n\r\n\r\n  ",
  "categoryId": "54",
  "version": "P.N.03",
  "author": "tonicmole",
  "createdUnix": "1335669292",
  "updatedUnix": "1335669797",
  "containsAdultContent": true,
  "uploadedBy": "tonicmole",
  "primaryFile": null,
  "files": [
    {
      "fileId": "57203",
      "name": "GRRL Armor and clothes",
      "version": ".03",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "34181",
      "fileName": "GRRL Armor and clothes-16079--03.zip",
      "uploadedUnix": "1335669797",
      "modVersion": ".03",
      "virusScanUrl": "https://www.virustotal.com/file/5a99bf972131fd2d516cc9eaa739c38a40c00dcb2b764cb1adb5a365886247df/analysis/1406852953/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GRRL%20Armor%20and%20clothes-16079--03.zip?fid=57203&ttl=1535781001&ri=8192&rs=8192&setec=141bf2e935cce1bf5cf093966f235dd9"
    }
  ]
}