{
  "modId": 16097.0,
  "modName": "Khajiit Marriage And Follower Mod",
  "summary": "You want to marry Khajiit in Skyrim? Who says you can&#39;t?",
  "descriptionHtml": "You want to marry Khajiit in Skyrim? Who says you can&#39;t? \r<br />\r<br />---\r<br />\r<br />EDIT:\r<br />To any and all who experience CTD and are trying out the Optional Files, please do report back if it works out. I&#39;m trying to figure out if the method I used to remove dependencies is viable. Thanks&#33;\r<br />\r<br />Also: Am dropping off the face of the Nexus again, because University. Not that this [i]will[/i] impact anyone in particular, but just in case.\r<br />\r<br />--- \r<br />\r<br />Hello. I have no excuses. Except: Bethesda kept breaking my heart (and my mod) with all their DLCs.\r<br />However&#33; With ESO, there probably won&#39;t be any more DLCs, so lo and behold, at long bloody last.\r<br />...I still don&#39;t know if I uploaded this correctly though.\r<br />Apologies to all who waited, gave up, hopefully found something better, was using a miraculously working older version and had it suddenly deleted, etc. etc. etc.\r<br />\r<br />PS: I still don&#39;t have voice actors, m(_ _)m\r<br />\r<br />--- \r<br />\r<br />DESCRIPTION: \r<br />This mod is exactly what it says on the tin, simple and easy. You can now marry any of the Caravan Khajiit or J&#39;zargo without any console commands. If you want Ma&#39;iq, or anycat else, use the console commands. My logic, don&#39;t ask. After learning about marriage from Maramal, go talk to the head of the Caravan Khajiit, Ri&#39;saad, for a little enlightenment on the eligibility of Khajiit in Skyrim. The Caravan members will all immediately be available, but J&#39;zargo will need you to finish up his quest.\r<br />\r<br />The bugs that apply to the original marriage system still apply, and I&#39;ve decided not to crack my head over a problem I didn&#39;t cause. This means you&#39;ll probably have to chase your Khajiit down to select your house choice. And if you have them live with you, Lover&#39;s Comfort may not apply. Choose to live with your Khajiit instead, and the objective to live with him or her will appear. If your Khajiit has a house, perfect. If they&#39;re from a caravan, I&#39;ve added a dialogue option to help you finish up without stalking them across Skyrim. Just talk to them and select the appropriate dialogue. It should be pretty obvious.\r<br />\r<br />Also, there&#39;s additional dialogue for female Khajiit followers, so that it&#39;s actually possible to have female Khajiit followers. Not that there are any. Console&#33;\r<br />\r<br />I didn&#39;t debug particularly thoroughly but there shouldn&#39;t be any compatibility issues or bugs. You can drop a comment, but I just, I just seriously gave up. The source files are all in there, if anyone wants instructions, in fact, PM me and have them with my thanks.\r<br />\r<br />---\r<br />\r<br />FAQ:\r<br />\r<br />What do I do?\r<br />Talk to Ri&#39;saad after learning about marriage from Maramal, and select &#34;What do the Skyrim Khajiit think of marriage?&#34;. Follow through, then court your Khajiit as per normal.\r<br />\r<br />My Khajiit spouse is freezing at the altar?\r<br />Save on the spot and reload, the scene will have skipped ahead to your vows and you can proceed.\r<br />\r<br />My Khajiit just walked away after the ceremony?\r<br />Vanilla bug, just chase him or her down.\r<br />\r<br />My Khajiit spouse lives in the caravans, how do I visit his/her &#39;house&#39;?\r<br />Talk to him or her while he or she is in the caravan, and select &#34;So, this is what it&#39;s like in the caravans.&#34;\r<br />\r<br />Lover&#39;s Comfort doesn&#39;t turn up?\r<br />Try sleeping over once with the Caravans (you&#39;ll have to catch them when they&#39;re set up and sleep in one of their bed rolls). Otherwise, vanilla bug, I don&#39;t know either.\r<br />\r<br />I want to marry J&#39;zargo or Ma&#39;iq, though?\r<br />Finish his quest, and he&#39;ll warm up to you. Console for Ma&#39;iq, not because I can&#39;t do it for you, but because he&#39;s not part of the Caravans and so the logic doesn&#39;t add up in my head.\r<br />\r<br />My game is crashing to desktop (CTDing). Help?\r<br />I programmed this mod over all the DLCs, ie Skyrim Legendary Edition. I thought this would be the way to go for a CTD-less experience, but apparently not. I&#39;ve tried removing the dependencies and have uploaded the test files on my Nexus page. I /will/ upload them here, but only if they work because Steam doesn&#39;t quite allow multiple files under the same Workshop entry. Please do use the Nexus download: all you have to do is unzip the file into your Data folder, even if you&#39;re not using their Mod Manager. And if you&#39;re still a little phobic of non-Workshop mods, please bear with me in the meantime.",
  "categoryId": "66",
  "version": "3.01",
  "author": "Clarota",
  "createdUnix": "1335701733",
  "updatedUnix": "1407667922",
  "containsAdultContent": false,
  "uploadedBy": "clarota",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000119222",
      "name": "KMM3",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "607",
      "fileName": "KMM3-16097-3-0.rar",
      "uploadedUnix": "1406309482",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/04971a3008b729596cfca73c3d301cc463e01022598e5de44ab295ed0b7bdd53/analysis/1406331420/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/KMM3-16097-3-0.rar?fid=1000119222&ttl=1535781038&ri=8192&rs=8192&setec=184584d878e1f8eee36d0c3794054836"
    },
    {
      "fileId": "1000119293",
      "name": "Khajiit Marriage (And Follower) Mod",
      "version": "3.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "606",
      "fileName": "KMM3-16097-3-01.rar",
      "uploadedUnix": "1406345215",
      "modVersion": "3.01",
      "virusScanUrl": "https://www.virustotal.com/file/6ad916e13eda694e34377ae1a4b65d148cc14036c92ea1076f5a78b21cdf23ac/analysis/1406345225/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/KMM3-16097-3-01.rar?fid=1000119293&ttl=1535781039&ri=8192&rs=8192&setec=c0e73b448b7f20bfbd0c7a85ef3d12bd"
    },
    {
      "fileId": "1000121008",
      "name": "Khajiit Marriage (And Follower) Mod - NoDLC",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "301",
      "fileName": "Khajiit Marriage (And Follower) Mod - NoDLC-16097-.rar",
      "uploadedUnix": "1407441874",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c8e9b5f6da95a901fdf4a209f9f1ac9d8bc5e4adf4ac12e5b8f65fb8a6ad3678/analysis/1408175992/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Khajiit%20Marriage%20%28And%20Follower%29%20Mod%20-%20NoDLC-16097-.rar?fid=1000121008&ttl=1535781040&ri=8192&rs=8192&setec=d91f91e9bb629ea28a1433f45e58c521"
    },
    {
      "fileId": "1000121298",
      "name": "Khajiit Marriage (And Follower) Mod - HearthfireOnly",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "302",
      "fileName": "Khajiit Marriage (And Follower) Mod - HearthfireOnly-16097-.rar",
      "uploadedUnix": "1407667922",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2452c961f4574062b4a357527306e8447fa787444855ccb55b3016c0cc5a9f4f/analysis/1407668034/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Khajiit%20Marriage%20%28And%20Follower%29%20Mod%20-%20HearthfireOnly-16097-.rar?fid=1000121298&ttl=1535781040&ri=8192&rs=8192&setec=388919e2ca6928c8d790bdfa5af8113c"
    }
  ]
}