{
  "modId": 16114.0,
  "modName": "Skyrim Survival Suite - Armure - FR",
  "summary": "Refonte totale des talents d\\'armure légère et d\\'armure lourde dans un soucis de cohérence et de liberté.",
  "descriptionHtml": "[center][IMG]http://img440.imageshack.us/img440/8349/sssheader.jpg[/IMG][/center]\r\n\r\nSkyrim Survival Suite est un projet visant à la création de nombreux plugins destinés à rendre Bordeciel plus immersif et plus réaliste. Chaque plugin aura pour but de gérer un aspect précis de gameplay, tout en étant bien entendu compatible avec tous les autres. Il n\\'est pas question à un seul moment de dénaturer le jeu d\\'origine ni même de vraiment ajouter du contenu, mais plutôt d\\'utiliser les éléments présents dans le jeu pour leur donner une nouvelle utilité.\r\n\r\nvoir aussi :\r\n[b][size=4][url=http://skyrim.nexusmods.com/downloads/file.php?id=12324]Skyrim Survival Suite - Nourriture et sommeil[/url][/size][/b]\r\n[b][size=4][url=http://skyrim.nexusmods.com/downloads/file.php?id=16499]Skyrim Survival Suite - Survie[/url][/size][/b]\r\n\r\n[color=red][size=5][b]***Attention ce mod n\\'en est encore qu\\'au stade de la beta (et c\\'est aussi pour recueillir avis et retours que je le met à disposition)***[/b][/size][/color]\r\n\r\n[B][size=6]S[/size][size=5]kyrim [/size][size=6]S[/size][size=5]urvival [/size][size=6]S[/size][size=5]uite - Armure[/B][/size]\r\n\r\n[size=3][B]Notes de mise à jour[/B][/size]\r\n[size=4][b]0.1.1 :[/b][/size] Correction du talent Grand fardeau qui indiquait une augmentation de la capacité de charge de 20% alors qu\\'elle n\\'était que de 20 (valeur, pas pourcentage). Désormais elle est de 50 et la description indique la bonne valeur.\r\nNouveau système d\\'acquisition des talents : désormais, en plus du système habituel (obtenir une certaine valeur dans une des deux compétences associées) il est possible de débloquer les nouveaux talents en obtenant une certaine valeur (inférieure de 25%) dans les deux compétences en même temps (voir image ci-dessous).\r\n\r\n[center][img]http://img163.imageshack.us/img163/580/explaini.jpg[/img][/center]\r\n\r\nAvec ce plugin, tous les talents des catégories Armure Lourde et Armure Légère ont été réorganisés et modifiés. Certains sont même supprimés et d\\'autres encore ajoutés. Bien que les compétences Armure lourde et Armure légère éxistent toujours et fonctionnent d\\'une manière identique, les catégories de talents qui leur étaient associées ont quand à elles été supprimées et remplacées par deux nouvelles : [b]Port d\\'armure[/b] remplace Armure lourde alors que [b]Défense[/b] remplace Armure légère.\r\n\r\n[size=4][b]Port d\\'Armure[/b][/size] se focalise sur les armures elles-même et les talents augmentent l\\'efficacité de ces dernières, de la même manière que les deux catégories de talents d\\'armure originales. La grande différence concerne la non-distinction entre armure légère et lourde pour la majorités des talents placés ici : vous pouvez très bien mélanger des pièces d\\'armure de plusieurs types sans pour autant ne plus être efficace en combat. Mais vous pouvez aussi choisir de vous focaliser sur un type d\\'armure précis en sélectionnant les talents adéquats. Une armure composite et/ou incomplète ou une armure complète et/ou uniforme : tout est pris en charge !\r\nPour débloquer l\\'accès aux talents de cette catégories, vous devez faire évoluer vos compétences Armure lourde et/ou Armure légère (il n\\'existe pas de compétence Port d\\'armure).\r\n\r\n[img]http://img259.imageshack.us/img259/7842/armurek.jpg[/img]\r\n\r\n[b][0] Encaissement (5) :[/b] Augmente la valeur d\\'armure des armures lourdes et légères de 20/40/60/80/100 %.\r\n[b][20/15] Parade assurée (1) :[/b] La parade est plus efficace de 10 % si vous portez des gants d\\'armure lourde ou légère.\r\n[b][20/15] Amortissement (1) :[/b] Permet de subir uniquement la moitié des dégâts lors de chutes en cas d\\'équipement de bottes d\\'armure lourde ou légère.\r\n[b][40/30] Inébranlable (1) :[/b] -50 % de déséquilibre en cas d\\'équipement d\\'un plastron d\\'armure lourde ou légère.\r\n[b][40/30] Gardien avisé (1) :[/b] Deux fois moins de chances de subir un coup critique si vous portez un casque d\\'armure lourde ou légère.\r\n[b][60/45] Conditionnement (1) :[/b] Les pièces d\\'armure lourdes ou légères que vous revêtez pèsent deux fois moins lourd et vous ralentissent deux fois moins.\r\n[b][75/55] Défense spécialisée (1) :[/b] +15 % de bonus d\\'armure en cas d\\'équipement d\\'un seul type d\\'armure (lourde ou légère) à la fois.\r\n[b][75/55] Panoplie (1) :[/b] +15 % de bonus d\\'armure en cas d\\'équipement d\\'une armure complète.\r\n[b][100/75] Défense composite (1) :[/b] 20 % de bonus d\\'armure supplémentaire en cas d\\'équipement d\\'au moins une pièce d\\'armure lourde et d\\'au moins une légère.\r\n[b][100/75] Panoplie complète (1) :[/b] 20 % de bonus d\\'armure supplémentaire en cas d\\'équipement d\\'un ensemble d\\'armure complet et uniforme.\r\n\r\n[size=4][b]Défense[/b][/size] concerne la défense traditionelle et ne mise pas sur l\\'armure elle-même, mais plutôt sur son absence ! En sélectionnant les bons talents votre personnage devrait être capable de se battre sans armure, en compensant une résistance moindre par d\\'autres avantages comme une plus grande mobilité et des chances d\\'esquiver les coups par exemple. Ces talents peuvent également se montrer intéressant pour ceux qui souhaitent ne pas avoir une armure complète, en combinant certains de ces talents avec ceux de Port d\\'armure, laissant ainsi un grand choix de personalisation.\r\nPour débloquer l\\'accès aux talents de cette catégories, vous devez faire évoluer vos compétences Furtivité et/ou Parade (il n\\'existe pas de compétence Défense).\r\n\r\n[img]http://img62.imageshack.us/img62/9982/dfense.jpg[/img]\r\n\r\n[b][0] Endurance (5) :[/b] La vigueur se régénère 15/30/45/60/75 % plus vite tant que vous ne portez pas plus d\\'une pièce d\\'armure lourde.\r\n[b][20/15] Sens éveillés (1) :[/b] 10 % de chances d\\'éviter tous les dégâts d\\'une attaque au corps à corps si vous ne portez pas de casque d\\'armure et pas plus d\\'une pièce d\\'armure lourde.\r\n[b][25/20] Légèreté (1) :[/b] Permet de subir uniquement la moitié des dégâts lors de chutes si vous ne portez aucune pièce d\\'armure.\r\n[b][40/30] Grand fardeau (1) :[/b] Votre capacité de port est augmentée de 50 tant que vous ne portez pas de plastron d\\'armure et pas plus d\\'une pièce d\\'armure lourde.\r\n[b][50/40] Esquive (1) :[/b] Deux fois moins de chances de subir un coup critique si vous ne portez aucune pièce d\\'armure.\r\n[b][50/40] Second souffle (1) :[/b] La vigueur se régénère 25 % plus vite tant que vous ne portez aucune pièce d\\'armure.\r\n[b][60/45] Frappes éclair (1) :[/b] Vous frappez 10% plus vite avec les armes tant que vous ne portez pas de gants d\\'armure ni plus d\\'une pièce d\\'armure lourde.\r\n[b][75/55] Frappes libérées (1) :[/b] Vous infligez 10% de dégâts en plus avec les armes tant que vous ne portez aucune pièce d\\'armure.\r\n[b][80/60] Marchevent (1) :[/b] Vous vous déplacez 10% plus vite en combat tant que vous ne portez pas de bottes d\\'armure et pas plus d\\'un pièce d\\'armure lourde.\r\n[b][100/75] Insaisissable (1) :[/b] 50 % de chances de ne subir que la moitié des dégâts d\\'une attaque de corps à corps si vous ne portez aucune pièce d\\'armure.\r\n\r\n[b][size=4]Ajustements necéssaires :[/size][/b] Etant donné qu\\'il est impossible de créer de nouvelles compétences ou de modifier en profondeur celles déjà existantes, j\\'ai du me débrouiller avec ces dernières, le soucis étant que modifier les catégories de talents n\\'a aucun effet sur les compétences elles-mêmes. Pour ce qui est de la catégorie Défense j\\'ai donc du faire le choix de débloquer les différents talents non pas avec la valeur d\\'Armure légère mais avec la Parade et/ou la Furtivité (compétences qui m\\'ont semblé les plus pertinentes pour représenter une défense \\\"active et subtile\\\" et qui sont de toute façon deux compétences que votre personnage développera certainement s\\'il souhaite se battre sans armure ou avec une armure modérée).\r\nD\\'un autre coté, les talents de Port d\\'armure sont quand à eux liés aux deux compétences d\\'armure originales, ce qui est logique et ne devrait pas poser de problème.\r\n\r\n[size=3][B]Installation :[/B][/size] placez le contenu de l\\'archive .Zip dans le dossier data puis activez le plugin de la façon habituelle (ou laissez le nexus mod manager faire son boulot). Si vous aviez placés des points dans les talents d\\'armure légère et/ou lourde, ceux ci seront malheureusement supprimés, ainsi je vous recommande soit d\\'utiliser ce mod sur une nouvelle partie, soit d\\'utiliser un autre mod qui permette de réinitialiser ses points de talents, comme [url=http://skyrim.nexusmods.com/downloads/file.php?id=3665][b]Paid Perk Reset[/b][/url].\r\n[size=3][B]Désinstallation :[/B][/size] Décochez le plugin dans la liste, de la façon habituelle.",
  "categoryId": "24",
  "version": "0.1.1",
  "author": "Helghast",
  "createdUnix": "1335722836",
  "updatedUnix": "1336150082",
  "containsAdultContent": false,
  "uploadedBy": "Helghast",
  "primaryFile": null,
  "files": [
    {
      "fileId": "58630",
      "name": "SSS - Armure",
      "version": "0.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "SSS - Armure-16114-0-1-1.zip",
      "uploadedUnix": "1336150082",
      "modVersion": "0.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c7dcbf1bf7bc19ea717aa0c58014f1224a88faf8294d11476580f0600cd17928/analysis/1406866382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSS%20-%20Armure-16114-0-1-1.zip?fid=58630&ttl=1535781075&ri=8192&rs=8192&setec=ed1fa22d692682c92293edb35ecdc06c"
    }
  ]
}