{
  "modId": 16132.0,
  "modName": "God-Gear and Glory Bookset",
  "summary": "This mod simply adds a bookset that shows many tips, techniques, and tricks for making the most powerful weapons and armor in the game. No cheats, no mods... just technique. The methods it describes would even work on consoles. I made this because I was tired of alt-tabbing between Skyrim and various Crafting sites to look up stuff. ",
  "descriptionHtml": "This mod simply adds a bookset that shows many tips, techniques, and tricks for making the most powerful weapons and armor in the game. No cheats, no mods... just technique. The methods it describes would even work on consoles (a textfile is included in the archive). I made this because I was tired of alt-tabbing between Skyrim and various Crafting sites to look up stuff. Now they are all in-game.\r\n\r\nYou\\'ll find the books sitting on the workbench outside Warmaiden\\'s smithy in Whiterun.\r\n\r\nUPDATE: You can preview the entire contents of these books [url=http://steamcommunity.com/sharedfiles/filedetails/?id=122671215]in my guide on Steam Workshop[/url].\r\n \r\nUPDATE: I\\'ve split the book into three volumes. Once you know how to do the techniques you can sell volumes one and two for gold, and keep volume III which has the cheatcodes.\r\n\r\n In a vanilla game, without using exploits, your weapons can hit for 500+ damage each and you can be immune to magic or cast 0-mana-cost Master spells from any school, without wasting a single Perk point. And if you are willing to stretch the rules a bit, it discusses several exploits so you can create weapons that hit for 100,000 damage or more, or give 1000-point armor bonuses, and so forth. You can even turn \\\"stock\\\" gear into \\\"god\\\" gear without any smithing/enchanting skills, just a little alchemy.\r\n\r\n This mod does not alter any aspect of gameplay. It\\'s **just** a book that shows you what to do. Whether or not you choose to use the exploits is your choice. I merely describe the method. If you know of any other tricks of the crafting trade, feel free to post them and maybe I\\'ll include them in a future update.\r\n \r\nTechniques Discussed:\r\n \r\n1) Basic \\\"Game legal\\\" Method - This is the method most crafting sites claim makes the strongest gear possible. They\\'re wrong, but its still good to know the basics.\r\n \r\n2) Restoration Re-Clothing Technique - Shows how to boost power of all existing gear by using Restoration Potions.\r\n \r\n3) Resto-Repeater Exploit - Make super-powerful alchemy and smithing gear using multiple Resto potions, and max out Alchemy, Smithing, Speech, and Enchanting (and get rich) in the process.\r\n \r\n4) Resto-Chugger Exploit - Turn any clothing item enchant in the game into mega-god-gear simply by taking several Resto potions in the right order, no need to level any crafting, works at any character level.",
  "categoryId": "27",
  "version": "",
  "author": "Arodicus Snaux",
  "createdUnix": "1335736393",
  "updatedUnix": "1335736508",
  "containsAdultContent": false,
  "uploadedBy": "Arodicus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "57419",
      "name": "God-Gear and Glory Bookset",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "164",
      "fileName": "God-Gear and Glory Bookset-16132-1-1.7z",
      "uploadedUnix": "1335736508",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d95eb286ab4747a765d993f5c8651d2659d1f795f4566ee42c7a0b28e9b5379a/analysis/1406854864/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/God-Gear%20and%20Glory%20Bookset-16132-1-1.7z?fid=57419&ttl=1535781099&ri=8192&rs=8192&setec=ddcdf0028e4ce5d26452edebefd3a4e7"
    }
  ]
}