{
  "modId": 16130.0,
  "modName": "Heavy Oblivion Style Witcher Plated Imperial Soldiers",
  "summary": "This mod replaces the Imperial Armour in the game with re textured versions of the Northern Kingdoms Plate",
  "descriptionHtml": "As soon as I saw Lord of War\\'s incredible port of the Northern Kingdoms Armour, I just knew something had to be done about those silly, dress wearing Imperial Soldiers. \r\n\r\nThe Legion now looks like they mean business! This mod revives the Oblivion style heavy guards we once knew and loved.\r\n\r\nPlease note that this is mainly a visual overhaul. No stats have been changed. The models of every piece of Imperial armour has been replaced (with a few items made for General Tullius). If I was to go in and beef up the armour, the Imperials would pretty much rape in the Civil War campaign. \r\n\r\nIn other words, the armour has the stats of Imperial Light/Studded/Heavy/Tullius Armour = it sucks but looks pretty sweet! As a result, it is incompatible with any other imperial armour mod.\r\n\r\nIf it turns out that everyone wants the stats to reflect the badassness then I encourage you to jump into the CK and play around!\r\n\r\nPlease enjoy the fruits of my ANZAC Day holiday and weekend. And have a nice day.\r\n\r\nOh and I haven\\'t had a lot of time to play with it in the game. Please upload a few snazzy photos and vids. Love your work ;)\r\n\r\nIMPORTANT NOTE!!!! The ground models are the wrong models and are super shiny. Remain Calm! I\\'m working on fixing this ;)\r\n",
  "categoryId": "29",
  "version": "1.00",
  "author": "Das_Reich aka Quad",
  "createdUnix": "1335735731",
  "updatedUnix": "1335736306",
  "containsAdultContent": false,
  "uploadedBy": "Das_Reich",
  "primaryFile": null,
  "files": [
    {
      "fileId": "57415",
      "name": "Heavy Oblivion Style Witcher Plated Imperial Soldiers",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11636",
      "fileName": "Heavy Oblivion Style Witcher Plated Imperial Soldiers-16130-1-00.7z",
      "uploadedUnix": "1335736306",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/73ee177ae7b7130f2dd2d3d3de3ea7fb1430449fe434e9728d15f59313e888ce/analysis/1406854812/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Heavy%20Oblivion%20Style%20Witcher%20Plated%20Imperial%20Soldiers-16130-1-00.7z?fid=57415&ttl=1535781096&ri=8192&rs=8192&setec=6a3f5670202817817e105b9b84ee3c20"
    }
  ]
}