{
  "modId": 16139.0,
  "modName": "Fishing In Skyrim",
  "summary": "Adds working fishing nets, \\\"dynamite\\\" fishing, and other goodies to Skyrim. Stop trying to grab fish with your bare hands! Look for a free net in a rowboat on the Riften canal, or talk to local general-goods vendors and apothecaries in Riverwood, Whiterun, Riften and Windhelm. \r\n",
  "descriptionHtml": "Adds working fishing poles, nets, dwarven boomfishing, working fishing gear, and many other fishing-themed goodies to Skyrim. Stop trying to grab fish with your bare hands! Look for a free pole and net in a rowboat on the Riften canal, or talk to local general-goods vendors and apothecaries in Riverwood, Whiterun, Riften and Windhelm. \r\n\r\nUPDATE 0.92: Skyrim 1.7 Compatibility fix\r\nUPDATE 0.91:  Many new features, bug fixes, new items, and balances have been added:\r\n\r\n-----------------------------------------------------------------------------------------------------------\r\nWORKING POLES and BAIT: There are currently 3 qualities of poles - all of which can be crafted at any smithy or are sometimes sold at several vendors across Skyrim. Quality affects the distance you can cast, and the time you must wait to get a nibble.\r\n\r\nUse the \\\"Fishing: Use Pole\\\" Lesser Power to plant your pole along a shoreline near some fish. You must then add bait to it by clicking on it and placing something on the \\\"hook\\\". The hook will accept most types of meat, bugs, and other fish, making this a great way to get rid of an undesired food item or ingredient for a chance at getting a better one.\r\n\r\nDifferent fish prefer different kinds of bait, so again, you\\'ll have to experiment to see what works. (If you have the right bait, and the right region, you have at least a 60% chance to catch the fish you are looking for).\r\n\r\n-----------------------------------------------------------------------------------------------------------\r\nREGIONAL FISHING: \r\n\r\nCertain fish prefer certain regions. River Betties, for instance, thrive around the Riften and Dawnstar docks, and Longfin have been spotted along their migratory route near Solitude. You\\'ll learn in time which fish prefer which regions, making sportsfishing or hunting for ingredients much less random than before.\r\n\r\nSightings of the elusive Blackreach Albino Catfish are on the rise, which should be of particular interest to Alchemists. Likewise, the very rare fungal jellyfish has been spotted along the northern coasts, despite the frigid waters, often getting entangled in nets.\r\n\r\n\r\n-----------------------------------------------------------------------------------------------------------\r\nFISHING NETS: \r\n\r\nThese can be purchased from certain vendors, or crafted at a Tanning Rack. You can carry and deploy several nets at once, stripping a lake or stream of all fish in a frightfully rapid manner. ...Overfished areas typically need 24-36 game-hours to recover.\r\n\r\nToss your nets using \\\"Fishing: Throw Net\\\" Lesser Power, aiming up or down to adjust distance. Your net will fly out a short distance, and if it splashes in deep enough water, will snatch up all the nearby critterfish, plus any others lurking in the depths that you might not see. Try to get the net in the middle of a large group of fish for the best experience, or take your chances dredging the polluted, fishless regions of the world, looking for lost treasures. Regional fishing rules apply here too, so keep your eyes open.\r\n\r\nNets attract slaughterfish, which are instantly killed by slivers of poisonous horker-tusk hooks embedded in the fibres. This has a small chance of damaging your net, which can be repaired at any Tanning Rack with a few leather strips.\r\n\r\n\r\n-----------------------------------------------------------------------------------------------------------\r\nBOOMFISHING:\r\n\r\nThose pesky dwarves adapted their explosive ballistae and catapult missiles into deadly shock-and-awe aquatic weapons. Originally intended for the Falmer Wars, someone quickly realized they could be used to stun fish en masse as well, providing a convenient foodsource for soldiers in the field... well, caves. \r\n\r\nBoth \\\"Fishin\\' Rods\\\" and Mines send out a massive shockwave guaranteed to stun anything in the area, including fish, insects(!), and unwary travellers. They also inflict three specific damage types: Magical Fire at the very core, regular fire damage within the actual fireball area, and physical/impact damage from the shockwave which decreases in intensity the further you get from ground zero.\r\n\r\nThrow them using \\\"Fishing: Throw Dwarven Rod\\\" or \\\"Fishing: Deploy Mine\\\" Lesser Powers. The rods are thrown like a basic grenade... no problems there... but the mines, if used on land, must be rolled towards the target - its best to get a  running start, drop it, then run like hell the other way... they are equivalent to the Civil War catapult missiles in power.\r\n\r\n\r\n-----------------------------------------------------------------------------------------------------------\r\nFISHING VENDOR\r\n\r\nThanks to numerous complaints that there were no working Poles in Skyrim, I\\'ve added one. His name is Rybek Kupiecski, a respected crafter of fishing poles, recently sucked into Skyrim through a wormhole from his home outside Warsaw. He has taken up residence at the Solitude lumber mill, which provides a ready supply of quality wood for his poles, and fish for his belly.\r\n\r\n--------------------------------------------------------------------------------------------------------------\r\nSPELLS\r\n\r\n\\\"Detect Fishing Hole\\\" has been added as a spell, if you are lucky enough to find a copy of \\\"The Old Orc and the Sea\\\" laying about. When cast, the locations of nearby fish spawning grounds are revealed, and fish in the vicinity are illuminated for you night-fisher types. Try looking in the Winterhold Library, or check with Rybek Kupiecski at the Solitude lumber mill to see if he has an old copy laying about.\r\n\r\n--------------------------------------------------------------------------------------------------------------\r\nMISC\r\n\r\nSeveral lost relics and other treasure can also be found, particularly when trolling nets in polluted waters. You don\\'t get as many fish, and you get a lot of junk... but other items can be found here as well...\r\n\r\nDwarven children used to play with marvelous toys, including the fragile Dwarven Flying Fish, which would fly about the head of its owner like a real fish does in water. The Flying Fish would break if actually immersed in water, however, to the disappointment of many a bathing child. How many are lost forever in the lakes and rivers of Skyrim is unknown.\r\n\r\nThere are rumors of lucky fishing gear items scattered about the world for those who know where to look. Look for particularly lucky people along the riversides for a start.\r\n\r\nCheat books are still available for a limited time in the Riften fishery, sitting on a barrel. Shame on you!\r\n\r\n\r\n\r\n----------------------------------------------------------------------------------\r\nCOMPATABILITY\r\n\r\nCompatible with Blitz\\'s excellent \\\"Improved Fish - New Fish - More Spawning\\\" http://skyrim.nexusmods.com/downloads/file.php?id=14320 and other mods which add \\\"CritterFish\\\". \r\n\r\nAlso recommended: There is, at long last, a working rowboat mod. It\\'s a bit rough right now ( it\\'s more like waterwalking with a boat sliding under you) but shows promise, and works fine with my fishing mods. http://steamcommunity.com/sharedfiles/filedetails/?id=88580670\r\n\r\n\r\n\r\nTranslators will have an easier time now - the hints and messages that used to be embedded in code are now properties attached to a statue on the special  \\\"FishingCell\\\" location. We currently have translations in Spanish, German, Russian, and Chinese. More are welcome - just ask.\r\n\r\n----------------------------------------------------------------------------------\r\n\r\nDEDICATION - and a warning to gamers....\r\n\r\nThis mod is dedicated to my fiance, Kiersten, who passed away in April, one week before her 22nd birthday. She loved Skyrim and sushi, so what began as a birthday present evolved into a memorial to her life. The new species of fish this mod adds are named after things she loved, and I am in the process of adding a small fishing camp populated by her Skyrim toons, so she can live on in the fantasy world she loved. A book will be added in a future version explaining all the symbolism added in the module, for those who care about the backstory.\r\n\r\nKiersten died from something called Deep-Vein Thrombosis (DVT), which is a blood clot you get from sitting in one position for too long. Gamers are at high risk for DVT - she died after playing MW3 for 11 hours. The only warning sign she had was a cramp in her leg. Two hours later, she was dead.\r\n \r\nThe best way to avoid DVT is simple: Save your game, stand up, and walk around for 2-3 minutes every 3 or 4 hours. Go to the fridge, pee, look out the window, play with your pet...anything, just MOVE. That simple action would have saved her life: it could save yours.\r\n \r\nWhen deep vein thrombosis symptoms occur, they can include: \r\n• Swelling in the affected leg, including swelling in your ankle and foot.\r\n• Pain in your leg; this can include pain in your ankle and foot. The pain often starts in your calf and can feel like cramping or a charley horse.\r\n• Warmth over the affected area.\r\n• Changes in your skin color, such as turning pale, red or blue.\r\n \r\nWhen to see a doctor\r\n If you develop signs or symptoms of deep vein thrombosis, contact your doctor for guidance.\r\n\r\nIf you develop signs or symptoms of a pulmonary embolism — a life-threatening complication of deep vein thrombosis — seek medical attention immediately.\r\n\r\n The warning signs of a pulmonary embolism include:\r\n• Unexplained sudden onset of shortness of breath\r\n• Chest pain or discomfort that worsens when you take a deep breath or when you cough\r\n• Feeling lightheaded or dizzy, or fainting\r\n•Rapid pulse\r\n•Sweating\r\n•Coughing up blood\r\n•A sense of anxiety or nervousness\r\n \r\n\r\nShould you encounter a Khajit named Lillani in your travels, know you just met the spirit of a truly good person. She will be missed.",
  "categoryId": "24",
  "version": "1.00",
  "author": "Arodicus Snaux",
  "createdUnix": "1335740805",
  "updatedUnix": "1367787977",
  "containsAdultContent": false,
  "uploadedBy": "Arodicus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "59397",
      "name": "Fishing In Skyrim Beta",
      "version": "0.85",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "936",
      "fileName": "Fishing In Skyrim Beta-16139-0-85.7z",
      "uploadedUnix": "1336354888",
      "modVersion": "0.85",
      "virusScanUrl": "https://www.virustotal.com/file/675b25aae865cdfd6398eb29a96fe5725a9ccf6f304e09019e00055bb399c31b/analysis/1406873764/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fishing%20In%20Skyrim%20Beta-16139-0-85.7z?fid=59397&ttl=1535781109&ri=8192&rs=8192&setec=7e0597244fc69be8ec57831459d5dae5"
    },
    {
      "fileId": "68990",
      "name": "Fishing In Skyrim 089",
      "version": "0.89",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1270",
      "fileName": "Fishing In Skyrim-16139-0-89.zip",
      "uploadedUnix": "1340096389",
      "modVersion": "0.89",
      "virusScanUrl": "https://www.virustotal.com/file/2be1029799f80159f9ca464f68d0e407501519c84410022a1c171a42185bd764/analysis/1406969466/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fishing%20In%20Skyrim-16139-0-89.zip?fid=68990&ttl=1535781109&ri=8192&rs=8192&setec=ba2a27a78c121f12ce2751eb8edaa9e7"
    },
    {
      "fileId": "72074",
      "name": "Fishing In Skyrim 90",
      "version": "0.90",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "931",
      "fileName": "Fishing In Skyrim-16139-0-90.7z",
      "uploadedUnix": "1341398476",
      "modVersion": "0.90",
      "virusScanUrl": "https://www.virustotal.com/file/ff9bbef8b1f803ee0b64a17adfd73bb3c2513159af5533271b722f03092b0b8b/analysis/1407000248/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fishing%20In%20Skyrim-16139-0-90.7z?fid=72074&ttl=1535781110&ri=8192&rs=8192&setec=192fb0a968f225f2a4785022cbc44e1f"
    },
    {
      "fileId": "78361",
      "name": "Fishing in Skyrim 092",
      "version": "0.92",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1991",
      "fileName": "Fishing in Skyrim 092-16139-0-92.7z",
      "uploadedUnix": "1343955308",
      "modVersion": "0.92",
      "virusScanUrl": "https://www.virustotal.com/file/93306860d32c8e9a6e159ca620de852a85e712077c019fce2084b560060f98ea/analysis/1407065227/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fishing%20in%20Skyrim%20092-16139-0-92.7z?fid=78361&ttl=1535781110&ri=8192&rs=8192&setec=173b985ad75880b889909b056e948a3f"
    },
    {
      "fileId": "1000028310",
      "name": "Fishing In Skyrim",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8847",
      "fileName": "Fishing In Skyrim-16139-1-00.7z",
      "uploadedUnix": "1367787977",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/e057c6b44bbe10603bbf5703cc4c5b96de37c28f9e04c08a4004c24aab974964/analysis/1407556761/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fishing%20In%20Skyrim-16139-1-00.7z?fid=1000028310&ttl=1535781111&ri=8192&rs=8192&setec=f3c0068a7b917e3aef8bd3bb49bf8e7e"
    }
  ]
}