{
  "modId": 16161.0,
  "modName": "Bards Questing in Tombs",
  "summary": "You thought the Bards College quest series was short and stupid?  Well now it has more quests and is longer, but is still just as stupid.\r\n",
  "descriptionHtml": "Mod:  Bards Questing in Tombs 1_1\r\nGame:  TES V: Skyrim\r\nAuthor:  Dysfunctional Mod Team                                          \r\nDate:  5/8/12                   \r\n************************************************************************\r\nCONTENTS                          \r\n************************************************************************\r\n1. Information on the Mod\r\n2. Installation\r\n3. Version History\r\n4. Conflicts, Known Issues, and Troubleshooting\r\n5. Copy Status and Credits\r\n************************************************************************\r\n1. INFORMATION ON THE MOD           \r\n************************************************************************\r\n\t   You thought the Bards College quest series was short and stupid?  Well now it has more \r\nquests and is longer, but is still just as stupid.\r\n\r\n\t   To start the mod, go to the Bards College in Solitude and talk to the new NPCs.  There are\r\nmultiple quest-givers.  One quest at a time will be available from them.  You do not actually have to \r\nbe a member of the Bards College to receive the quests.  the quests can be done before, during, or\r\nafter the original Bards College quests.\r\n\r\n\t   The mod is fully voice-acted.\r\n\r\n\t   The mod adds three new quests alongside the four original ones.\r\n\r\n\t   The first quest-giver is a male Imperial who often hangs around in the kitchens.  The \r\nsecond quest-giver is a female Breton who often hangs around in the classrooms. The third quest-giver \r\nis a male Orc who often hangs around in the library.\t   \r\n\r\n\t   The quests involve going into tombs full of nasty violent things like draugr and looking \r\nfor lost musical instruments and other such inconsequential items.  Isn\\'t that what being a bard is \r\nall about?\t   \t   \r\n************************************************************************\r\n2. Installation                           \r\n************************************************************************\r\n           Extract (decompress) the .esp, Scripts, Textures, Meshes, and Sound folders to your Skyrim \r\ndirectory.  (It will be something like *Installation directory*\\\\Skyrim\\\\SteamApps\\\\common\\\\Skyrim\\\\Data)\r\nMark the box next to Bards Questing in Tombs in your mod manager.\r\n \r\n           Alternately, extract files someplace else.  Then move the .esp, Scripts, Textures, Meshes, \r\nand Sound folders to Skyrim\\\\Data.  Mark the box next to the plugin in your mod manager.\r\n************************************************************************\r\n3. Version History    \r\n************************************************************************\r\nV 1.1    5/8/12    Fixed issue where one of the quests would not show as complete in the log when \r\n\t \t   finished.\r\nV 1.0    4/29/12   Initial release. Three quests.   \r\n************************************************************************\r\n4. Conflicts, Known Issues, and Troubleshooting\r\n************************************************************************\r\n\t   Skyrim is not reliable for mod usage like Oblivion was.  In Oblivion, if a mod worked\r\nright, it could generally be used and work right on any computer.  But with Skyrim, there are lots of\r\nreported cases where mods that work right for almost everyone else do not work on particular computers.  \r\nNo explanation has been found.  So if this mod does not work on your computer, but you have installed \r\nit right, then you should just give up and go play another mod.\r\n\r\n\t   This mod could conflict with other Bards College mods.  This mod includes a bugfix to make\r\nit so the instruments from the vanilla Bard College quests are not quest items and may be dropped.\r\n\r\n\t   If your computer is lagging bad, the quest dialog may not be available when it is supposed \r\nto be.  You may be able to get past this by shutting down Skyrim, turning off unneeded programs, and \r\nrestarting Skyrim.  (You may get a short window at the beginning when your game has not bogged down \r\nyet. \r\n\r\n\t   It would be better if the voice actor learned how to act, but there is nothing anyone can \r\ndo about his voice.\r\n\r\n\t   This mod needs more play-testing.  The play-tester on our team is not so fast and not so\r\nthorough.   \r\n\r\n\t   I, Scorpian02, the Team Lead, have been having horrible personnel problems in this modding \r\nproject.  This has seriously degraded the quality and size of this mod.  For some reason that I can\\'t \r\nunderstand, I am having difficulty recruiting and retaining team members.  My voice actor and \r\nplay-tester are threatening to quit.  My dungeon builder, Clueless Punk, quit without giving the\r\nrequired two-weeks notice!  That jerk didn\\'t even turn in his work before leaving, and the work was \r\nlost to the project.  I am most certainly not going to give him a good reference in his search for a \r\nnew situation.  I am having to blackmail my quest-coder to work for me.  He hates my guts and would \r\nleave the project in a heartbeat, but I am blackmailing him into working for me.  I know one of his \r\ndark secrets and have threatened to tell the world about it!  He is insufferable, and I can\\'t stand him \r\nand his shoddy workmanship!  It is a shame that I can\\'t find another, and better, quest-coder to work \r\nfor me.  For some reason, the quest-coders I try to recruit aren\\'t interested in working with me. But I \r\nown this one quest-coder and intend to force some work out of him.\r\n\r\n\t   I just can\\'t find any decent modders to recruit to this project.  The ones I have are no \r\ngood.  They don\\'t know what they are doing.  They are slow and lazy.  They lack vision and can\\'t see \r\nthe big picture.  But that can\\'t really be expected of such dull, common people.  But worst of all, they \r\nwon\\'t follow my orders!  When I give an order, I expect it to be followed!  It is not their place to be \r\nquestioning my judgment.  Who do they think they are?  I demand respect and obedience!\r\n\r\n\t   So if you are a qualified modder who would like to work on a modding project with an \r\neffective leader who knows how to get things done, we would be glad to have you as part of our project.  \r\nJoin now before all the positions are taken!\r\n\t\r\n\t   If you locate a bug, contact David Brasher on TES Nexus so that the situation can be\r\nexamined and can hopefully be fixed. \r\n************************************************************************\r\n5. Copy Status and Credits           \r\n************************************************************************\r\nCredits:  Scorpian02 - Team Lead\r\n\t  Freddy the Noob - Voice Actor\r\n\t  David Brasher - Questcoder/Scripter, Uploader/Caretaker\r\n\t  Sloth Girl - Play-testing\r\n\r\n\t  Bethesda for making Skyrim \r\n\t\t\r\nCopy Status:  Public domain with proper attribution and courtesy notification.  You may use things from \r\n\t  this mod in your own mods and distribute them if you give credit to Scorpian02, the Team Lead,\r\n\t  the brains of this project, and the only member of this project who is worth a darn.  You don\\'t\r\n\t  need to list the other team members in your credits, because this is my mod, and they don\\'t \r\n\t  deserve any credit, the worthless slackers!\r\n************************************************************************\r\n************************************************************************\r\n************************************************************************\r\n************************************************************************",
  "categoryId": "25",
  "version": "1.1",
  "author": "Dysfunctional Mod Team",
  "createdUnix": "1335762415",
  "updatedUnix": "1336548344",
  "containsAdultContent": false,
  "uploadedBy": "David Brasher",
  "primaryFile": null,
  "files": [
    {
      "fileId": "57496",
      "name": "Bards Questing in Tombs 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16590",
      "fileName": "Bards Questing in Tombs 1_0-16161.7z",
      "uploadedUnix": "1335763358",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7a27cb68e25209dbaf2b7df45eefa95a0130b91f25910103ac32095b6c105fd8/analysis/1406855769/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bards%20Questing%20in%20Tombs%201_0-16161.7z?fid=57496&ttl=1535781141&ri=8192&rs=8192&setec=75c18a7426783be9f71b137c1abfa315"
    },
    {
      "fileId": "59934",
      "name": "Bards Questing in Tombs 1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16590",
      "fileName": "Bards Questing in Tombs 1_1-16161-1-1.7z",
      "uploadedUnix": "1336548344",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/3c42db993d8aa7b274499a59db3a399538b36d3c9533b4df8622cac5992cffb3/analysis/1406879888/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bards%20Questing%20in%20Tombs%201_1-16161-1-1.7z?fid=59934&ttl=1535781142&ri=8192&rs=8192&setec=1e05adf7b1bd871e7e8fbeff76e8fe4b"
    }
  ]
}