{
  "modId": 16188.0,
  "modName": "Fleetford",
  "summary": "Fleetford is a player home within an inn and a full surrounding settlement complete with traders, followers etc. The location is between Whiterun and Windhelm (by Darkshade and Cradlecrush Rock).",
  "descriptionHtml": "[font=&#34;Palatino Linotype&#34;][color=#FFFF00][line]\r<br />\r<br />[b]PLEASE NOTE: This mod is no longer actively supported. [/b]\r<br />\r<br />There were some changes I wanted to make but to cut a long story short I&#39;ve lost the source files for the scripts and redoing them is more work than I&#39;m prepared to do. The latest uploaded version of the mod is stable (yes it has &#34;dirty&#34; edits, but they&#39;re just &#39;Identical to Master&#39; records and no reason they should cause any serious issues (worst effect here is they may override other mods changes to those same records, but any mod that changes the same records is likely to be incompatible anyway). THE MOD WORKS, AND IS STABLE, SO IF YOU WANT IT THEN USE IT, but there won&#39;t be any support, updates or changes now. I&#39;m working on something new, similar but better.\r<br />\r<br />IF ANYONE WANTS TO TAKE OVER THIS MOD AND DO SOMETHING WITH IT... FEEL FREE, JUST GIVE CREDIT FOR THE ORIGINAL WORK.\r<br />\r<br />Massive thanks to all who helped and supported this mod. \r<br />\r<br />[line][/color]\r<br />\r<br />\r<br />\r<br />\r<br />[color=#FFFF00][size=3][B]INTRODUCTION:[/B][/size][/color]\r<br />\r<br />Fleetford is a player home, and full surrounding settlement located on the road to Windhelm from Whiterun, between Darkshade and Cradlecrush Rock. The mod works equally well if you are looking for a new home in Skyrim, or just want to add another town and trading hub to the map. The town has the following features: \r<br />\r<br />- Purchasable and upgradable/customisable player home in The Honey Drum Inn. Lots of safe storage, plus full crafting set up and the usual assortment of fully functional bookshelves, weapon racks and mannequins. Clutter is generally low value with a few more useful items, and the emphasis is on quality and design rather than having 1,000 mannequins and a vast empty castle.\r<br />- Inn\r<br />- Apothecary\r<br />- Mage Trader (Destruction trainer)\r<br />- Khajiit Trader (Sneak Trainer)\r<br />- Blacksmith (Smithing Trainer)\r<br />- General Store\r<br />- 2 x Custom Followers\r<br />- Trading Hunter\r<br />- Choice of horse outside, and shrines in player home\r<br />- Choice of factional guards\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[color=#FFFF00][size=3][B]INSTALLATION:[/B][/size][/color]\r<br />\r<br />Either install with Nexus Mod Manager or extract the file to your Skyrim Data folder with the zip program of your choice (WinZip, 7Zip etc) and say “yes” if you are prompted to merge folders or overwrite files. The easiest way to uninstall is if you’re using Nexus Mod Manager, just deactivate the mod. If you installed manually then full uninstall details can be found in the Appendix at the end of the readme file.\r<br />\r<br />If extracting manually to a different location first, then all of the extracted files should be moved to your main Skyrim/Data directory. \r<br />\r<br />The ONLY files contained in the Fleetford v1.4 download are:\r<br />- The Fleetford.esp file which makes the changes to Skyrim.\r<br />- Textures and Meshes folders which contain the files needed for the people of Fleetford, and some objects like the Inn&#39;s sign, to display correctly in game. \r<br />- Scripts and Sound folders needed to make the house-key purchase work.\r<br />- The readme file.\r<br />\r<br />If you are upgrading from a previous version then I would recommend starting a new game to do so. In all honesty there should be no problem just installing the new version and carrying on with an old game, but I am not recommending that you do so because I cannot be 100% sure. The safest way to do this would be to remove EVERYTHING from the player home weapon-racks, mannequins and containers, save your game somewhere away from Fleetford, uninstall the old Fleetford version, wait a week in-game and then install the new version. \r<br />\r<br />[color=#FF0000]When you first load a save that was made before you installed this mod you need to do the following to make sure the key purchase scripts work:\r<br />- load the savegame\r<br />- re-save it\r<br />- reload the save you just made\r<br />[/color]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[color=#FFFF00][size=3][B]FULL TOWN GUIDE:[/B][/size][/color]\r<br />\r<br />[color=#FFFF00]1- The Honey Drum Inn (including Loft & Cellar)[/color]\r<br />PLAYER HOME\r<br />24hr FOOD & DRINK VENDOR\r<br />APOTHECARY TRADER\r<br />\r<br />The Honey Drum is a fully functioning Inn and player home, although there are staff and customers in the bar area, all containers on all floors of the inn are safe for you to store your loot in. Consider all 3 floors your home. Food and drink are served 24 hours a day by the Argonian Mahei-Dar and his son Julan, while Apothecary services are available in the Inn from 8am-8pm from Mahei-Dar&#39;s wife Ahneeva.\r<br />\r<br />The player home offers all crafting stations, and a selection of bookshelves, weapon-racks and mannequins in addition to plentiful safe-storage options and a bed with well-rested bonus.\r<br />\r<br />The keys to the Loft (your main &#39;living&#39; and &#39;display&#39; area) and Cellar (your main &#39;crafting&#39; area) are on sale at Ajakz Emporium for 1250 gold, and 2500 gold respectively. So you can have somewhere to live for a low price straight away, and access to the crafting features when you have a little more money. For those who really don&#39;t want to pay there is a strongbox hidden somewhere around Fleetford which also contains all of the keys.\r<br />\r<br />\r<br />[color=#FFFF00]2 – The Blue Moonstone[/color]\r<br />BLACKSMITH TRADER & SMITHING TRAINER\r<br />CUSTOM SPELLSWORD FOLLOWER\r<br />\r<br />Fleetford&#39;s Blacksmith is run by the Bosmer Geldriian and her apprentice the Dunmer Miaren. Rumour has it that Miaren is far more suited to using an axe than forging one though. The Smith is open from 8am-8pm but Geldriian rarely turns away a customer at any hour if they have gold in their pockets, and she can also provide Smithing training.\r<br />\r<br />\r<br />[color=#FFFF00]3- Ajakz Emporium[/color]\r<br />PAWNBROKER\r<br />\r<br />Ajakz Emporium has all your random needs occasionally covered. Come to buy whatever a traveller has just sold, sell on your own old junk, or even just to see the oddity of an Orcish shopkeeper being nearly polite to people. Like Geldriian, if you can find Ajakz in the store, he&#39;ll likely serve you whatever the hour if there&#39;s a profit to be made.\r<br />\r<br />\r<br />[color=#FFFF00]4- Kaasha & Ra&#39;ksa[/color]\r<br />KHAJIIT TRADER & SNEAK TRAINER\r<br />CUSTOM DUAL WIELDING FOLLOWER\r<br />\r<br />Open whenever they&#39;re awake. Or you can always disturb them if they&#39;re sleeping, but have you tried to wake a sleeping cat? Kaasha is the brains of the operation, and also offers Sneak training, while her cousin Ra&#39;ksa prefers to be on the road with his scimitars swinging.  \r<br />\r<br />\r<br />[color=#FFFF00]5 – The Hermitage[/color]\r<br />MAGICAL GOODS & DESTRUCTION TRAINING\r<br />\r<br />Fleetford&#39;s resident grumpy old man. No official opening times, just pray to Stendarr that the old man is in a good enough mood to not send you back out the door with an ice-spike through your knee. The old master is a great source of knowledge in the Destruction school of magic and carries many useful supplies for the aspiring Mage or enchanter.\r<br />\r<br />\r<br />[color=#FFFF00]6 – Etienne&#39;s Workshop[/color]\r<br />TOWN CUSTOMISATION OPTIONS\r<br />(See &#39;Customised Features&#39; below).\r<br />\r<br />Even more reclusive than The Hermit. Few have even seen Etienne. All that is known is he is a Breton, who built the forge and water system in the Honey Drum, and the machinery in this workshop, which is now the only means of communicating with him. The workshop offers a large amount of customisation options for the player home and town, and the key is on sale at Ajakz Emporium for 5000 gold.\r<br />\r<br />\r<br />[color=#FFFF00]7 – Guard Tower & Undertower Barracks[/color]\r<br />FLEETFORD&#39;S PROTECTORS\r<br />(See &#39;Customised Features&#39; below).\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[color=#FFFF00][size=3][B]CUSTOMISED FEATURES:[/B][/size][/color]\r<br />\r<br />All of the customisable options can be set up in the &#39;Etienne&#39;s Workshop&#39; building, over the river from the Honey Drum Inn. Just select which options you would like using Etienne&#39;s machines and a message will be sent to the reclusive Etienne who will instantly and mysteriously carry out your wishes.\r<br />\r<br />If a button or lever has &#39;Option&#39; in its name then only ONE choice may be selected, and is not changeable after selection. If you wish to &#39;try before you buy&#39; then I would recommend making a save before you select any custom options, and have a good look around after making your choices to be sure you are happy with them.\r<br />\r<br />You can of course have different options in each of your games if you play with multiple characters, but once selected you cannot change your mind in any particular game.\r<br />\r<br />The features which can currently be customised are:\r<br />\r<br />[color=#FFFF00][b]Colour/type of horse[/b][/color] – This set of levers controls which type of horse will be available for your use outside the inn. Pull a lever – get that horse.  Only one option may be selected, and you cannot reselect even if your chosen horse dies.\r<br />\r<br />[color=#FFFF00][b]Main shrine in player home[/b][/color] – These buttons are used to select which god&#39;s shrine (and amulet) you would like delivered to the shrine area in the Honey Drum Loft. Choose any one of the 8, but you can only choose one, and you cannot change your mind later.\r<br />\r<br />[color=#FFFF00][b]Secondary shrine in player home[/b][/color] – These buttons are used to select which shrine (from Talos or Nocturnal) you would like delivered to the secondary/concealed shrine area in the Honey Drum Loft (behind the suspicious panel beneath your main shrine). Again, only one may be selected, and you cannot change later.\r<br />\r<br />[color=#FFFF00][b]Factional guards[/b][/color] – This set of buttons controls which faction you would like to move into the Undertower Barracks to keep watch over Fleetford. There are 3 guards and a guard captain for each choice, and this option also adds further custom elements (banners etc) to both the exterior of the Guard Tower and the Undertower Barracks. Again – only one option may be selected in each of your games, and this choice is not changeable at a later time.\r<br />\r<br />[color=#FFFF00][b]Add Alchemy Table to Loft[/b][/color] – Adds an alchemy table to the loft, in addition to the one in the Inn.\r<br />\r<br />[color=#FFFF00][b]Add Enchanting Table to Loft[/b][/color] – Adds an enchanting table to the loft, in addition to the one in the Cellar.\r<br />\r<br />[color=#FFFF00][b]Add Ancestral Items To Cellar[/b][/color] – Adds a set of armour and swords to the cellar. (Enchantable and improvable with steel ingots).\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[color=#FFFF00][size=3][B]COMPATIBILITY:[/B][/size][/color]\r<br />\r<br />The mod should run fine anywhere in your load order. There should be no specific compatibility issues with any other mods, unless they also edit the same exterior cells, mods known to conflict (i.e you CANNOT use them at the same time as they all alter the same places):\r<br />\r<br />- Ranger Cabins 2_0 \r<br />- Older versions of Expanded Towns and villages\r<br />- Gleaming Falls\r<br />\r<br />There should be no compatibility issue with any texture packs etc, but if you&#39;re using texture replacers, foliage replacers, ENBs etc then you won&#39;t see this as it was designed. This was designed to be used with vanilla textures and lighting.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[color=#FFFF00][size=3][B]KNOWN ISSUES/WARNINGS:[/B][/size][/color]\r<br />\r<br />[b]This is a large mod, which makes a lot of changes to one external area in Tamriel. Running a lot of large mods can cause issues, even if there is no compatibility issue between the mods. [/b]\r<br />\r<br />- Some users are experiencing issues with the keys, and key purchase. I cannot replicate these errors, and currently believe this is caused by issues beyond my control (e.g Skyrim being it&#39;s twitchy old self, or the &#39;large mods&#39; issue) and not a problem with the mod itself or anything I can fix.\r<br />\r<br />- Possibility of frame rate drop/stuttering, particularly in the exterior. This only affects a minority of users, and in most cases is not serious (comparable to places like Whiterun or Windhelm).\r<br />\r<br />- Bed GIVES Well Rested perk, but does not DISPLAY Well Rested message.\r<br />\r<br />\r<br />\r<br />\r<br />[color=#FFFF00][size=3][B]OPTIONAL BRIGHTER INTERIORS ESP[/B][/size][/color]\r<br />\r<br />Substantially brightens all of the Fleetford interiors. This was developed with [url=http://skyrim.nexusmods.com/mods/18202]Enhanced Motion Picture ENB[/url] including [url=http://skyrim.nexusmods.com/mods/12454]Dark Dungeons for ENB[/url] and [url=http://skyrim.nexusmods.com/mods/13049]Imaginator[/url]. It still needs more work, but this will never be perfect as all ENBS are different, it is mostly being developed for my own personal use, I am only sharing it to enable as many people as possible to use this mod, as many ENBs make the Fleetford interiors so dark they are unusable. The interiors and lighting themselves were designed for running Skyrim without an ENB.\r<br />\r<br />\r<br />\r<br />\r<br />[color=#FFFF00][size=3][B]CHANGELOG/WHAT&#39;S NEW FOR v1.4[/B][/size][/color]\r<br />\r<br />- Remeshed wilderness cell from scratch to avoid deleted navmesh issue\r<br />- Fixed North marker in Hermitage cell\r<br />- Changed map marker to town\r<br />- Completely reworked exterior lighting (night only)\r<br />- Gave lore-friendly names to all existing NPCs where appropriate\r<br />- Reinstated and repositioned or found use for all previously deleted vanilla references\r<br />- Much work on landscaping\r<br />- Usual minor tweaks and corrections\r<br />- Rebalanced existing NPC levels (less powerful)\r<br />- Increased Apothecary trader inventory\r<br />- Added skooma/moon sugar to Khajiit trader inventory\r<br />- Added new General Store and trader NPC\r<br />- Added new home for Argonian bar staff/apothecary and moved them out of the cellar\r<br />- Made home available by purchase instead of free (2 keys, 1250 gold for Loft, 2500 gold for Cellar, to keep initial purchase price low, but overall cost balanced with vanilla)\r<br />- Added &#34;Etienne&#39;s Workshop&#34; as an in-game customisation area (key purchase for access - 5000 gold)\r<br />- Removed initial availability of shrines and crafting stations from Loft, added ability to re-enable them (with choice of shrine) via Etienne&#39;s Workshop\r<br />- Removed initial availability of horse, added ability to enable and choose horse via Etienne&#39;s Workshop\r<br />- Added new &#34;Undertower&#34; interior for guards\r<br />- Added custom guard NPCs (choose from 6 different sets via Etienne&#39;s Workshop, each with 3 guards and a guard captain)\r<br />- Added set of &#34;custom&#34; armour and swords available in the Cellar enabled via Etienne&#39;s Workshop\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[color=#FFFF00][size=3][B]CHANGELOG/WHAT&#39;S NEW FOR v1.3[/B][/size][/color]\r<br />\r<br />- squashed the appearing signs/rings bug, this is 100% fixed\r<br />- removed all accidental changes to other cells, substantially &#34;cleaned&#34; mod \r<br />- added a bridge to the hermitage and renavmeshed for this\r<br />- simplified/fixed or removed some exterior lights/spawn points\r<br />- fixed female khajiit training dialog\r<br />- fixed/allowed access through cellar gate\r<br />- reworked my NPC spell lists\r<br />- retextured exterior chimneys to better match existing building&#39;s stone\r<br />- slightly repositioned NPC spawn points so that if navmesh bug strikes they should be in better positions\r<br />- various small fixes: removed blank notebook, renamed &#34;false back panel&#34; that was a front not a back etc etc\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[color=#FFFF00][size=3][B]WITH GRATEFUL THANKS TO[/B][/size][/color]\r<br />\r<br />karrakaz, lv000, Werne, TheLoveDrug, Nealileo (and Chris who doesn&#39;t come here), all of whom have helped a lot with testing and suggestions, as well as everyone who has taken the time to comment on or endorse this mod.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[center][B]CURRENTLY ONLY AVAILABLE AT THE NEXUS - PLEASE DO NOT UPLOAD THIS FILE TO THE STEAM WORKSHOP UNTIL SUCH TIME AS THE WORKSHOP IS ADEQUATELY MODERATED[/B]\r<br />[/center][/font]",
  "categoryId": "53",
  "version": "v1.4",
  "author": "tetradite",
  "createdUnix": "1335811260",
  "updatedUnix": "1344531425",
  "containsAdultContent": false,
  "uploadedBy": "tetradite",
  "primaryFile": null,
  "files": [
    {
      "fileId": "57644",
      "name": "Fleetford v1-2",
      "version": "v1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1488",
      "fileName": "Fleetford v1-2-16188.7z",
      "uploadedUnix": "1335815216",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/e9c4a7403192e9e32ff60485267d6d74e9d3bcefc5da17d119c12108f9716ee2/analysis/1406857153/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fleetford%20v1-2-16188.7z?fid=57644&ttl=1535781182&ri=8192&rs=8192&setec=edd5d43cee475b5c0834786bd9c0d175"
    },
    {
      "fileId": "59865",
      "name": "Fleetford v1-3",
      "version": "v1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1478",
      "fileName": "Fleetford v1-3-16188-v1-3.7z",
      "uploadedUnix": "1336522564",
      "modVersion": "v1.3",
      "virusScanUrl": "https://www.virustotal.com/file/dd221bd0a3901f1710a67fedee8e74be82976570470e841036dc2223f1ec6617/analysis/1406879173/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fleetford%20v1-3-16188-v1-3.7z?fid=59865&ttl=1535781182&ri=8192&rs=8192&setec=e471ccb548d2a8e5e83eab85e87ac591"
    },
    {
      "fileId": "78555",
      "name": "Fleetford v1-4",
      "version": "v1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19845",
      "fileName": "Fleetford v1-4-16188-v1-4.7z",
      "uploadedUnix": "1344030909",
      "modVersion": "v1.4",
      "virusScanUrl": "https://www.virustotal.com/file/e4f7da0528ccf6db41ff07b2f34cd482c6816c487a37085c803eab88bed2c8ec/analysis/1407067287/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fleetford%20v1-4-16188-v1-4.7z?fid=78555&ttl=1535781183&ri=8192&rs=8192&setec=d373a4a6327e3188d4b4c5a849bea0a8"
    },
    {
      "fileId": "78836",
      "name": "Fleetford v1-4b Brighter Interiors",
      "version": "v1.4b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "288",
      "fileName": "Fleetford v1-4b Brighter Interiors-16188-v1-4b.7z",
      "uploadedUnix": "1344129697",
      "modVersion": "v1.4b",
      "virusScanUrl": "https://www.virustotal.com/file/6e6abf7c90b42367a8ed8b276793b7458c48037fb1468a400002c3c3a6a9dd57/analysis/1407070392/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fleetford%20v1-4b%20Brighter%20Interiors-16188-v1-4b.7z?fid=78836&ttl=1535781183&ri=8192&rs=8192&setec=812041032a5cdb2a0d45585bed545a03"
    },
    {
      "fileId": "80071",
      "name": "Fleetford v1-4b2 Brighter Interiors",
      "version": "V1.4b2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "288",
      "fileName": "Fleetford v1-4b2 Brighter Interiors-16188-V1-4b2.7z",
      "uploadedUnix": "1344531425",
      "modVersion": "V1.4b2",
      "virusScanUrl": "https://www.virustotal.com/file/341bf41064fbafb5a838d92ce7a8813d91c52f2d3f789d2afeaa12c83f31a459/analysis/1407082925/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fleetford%20v1-4b2%20Brighter%20Interiors-16188-V1-4b2.7z?fid=80071&ttl=1535781183&ri=8192&rs=8192&setec=31fc8b9fe8d99c753c8e8998893d12f3"
    }
  ]
}