{
  "modId": 16194.0,
  "modName": "RH Psijic Archmage Robes Switcher BETA",
  "summary": "Switches the Psijics\\' and Archmage\\'s Robes",
  "descriptionHtml": "[center][b][u]ROGUE HALLOW\\'S\r\nPSIJIC / ARCHMAGE ROBES SWITCHER[/b][/u]\r\n\r\nBETA 0.2\r\nmod first published [b]04.30.2012[/b]\r\ncurrent version published [b]05.01.2012[/b]\r\n\r\nRogue Hallow(tm)[/center]\r\n\r\n[center]_______________________________________________________________________________[/center]\r\n\r\n[u]NEWS[/u]\r\n[b]05.01.12:[/b] A fresh version of the mod is now available for download.  This update reduces the chance of stray mod conflicts, and includes a set of custom color schemes for your brand new Archmage\\'s clothing!\r\n\r\n[b]04.30.12:[/b] The file has been uploaded and is ready to try out.  Please leave any feedback in the Comments section or send me a PM!\r\n\r\n\r\n[u]OVERVIEW[/u]\r\nI always liked the robes worn by the Psijic Monks, and was not very fond of the ones worn by Savos Aren and given to the player when s/he becomes the Archmage.  I felt that the frilled, patched Archmage robes actually matched the clandestine Psijics fairly well, and that their own very fine robes would suit the somewhat pretentious Savos Aren perfectly.  So I decided to switch them.\r\n\r\n\r\n[u]WHAT IT DOES[/u]\r\nThis simple mod swaps the models for the Psijic Robes and Archmage\\'s Robes.  The Psijic monks will wear robes that resemble the Archmage\\'s Robes in the vanilla game, and Savos Aren will wear robes resembling those originally worn by the monks.\r\n\r\nIf/when the player becomes the Archmage, they will receive a set of clothing that uses the original Psijic models.  This includes a robe, separate hood, gloves, and boots.  They will still be called Archmage\\'s Robe, Archmage\\'s Hood, etc.\r\n\r\n* The Archmage\\'s Robe has the magicka regeneration and spellcasting cost bonuses as normal.\r\n\r\n* The Archmage\\'s Hood has the magicka fortification bonus found on the original robes.  It can be worn separately from the robes and has been modified to allow circlets to be worn with it.\r\n\r\n* The Archmage\\'s Boots have a resistance to shock enchantment, like those originally worn by Savos Aren.\r\n\r\n* The new Archmage\\'s Gloves have an alchemy bonus enchantment.\r\n\r\nIn addition to this, the mod package includes several alternate color schemes for the new Archmage\\'s clothing, as well as PSD files so you can assemble your own color schemes (knowledge of Photoshop or GIMP is required).  See the screenshots for examples of the new color schemes!\r\n\r\n\r\n[u]ITEM CODES[/u]\r\nIf you load this mod after you have finished the College of Winterhold questline and you want to have all of the Archmage\\'s clothing items, here are the codes you can use to add them to your inventory using the console command [color=yellow]player.additem baseID #[/color]:\r\n\r\nArchmage\\'s Robes w/o hood: 0007C932\r\nArchmage\\'s Hood: 00065B99\r\nArchmage\\'s Boots: 0007C92E\r\nArchmage\\'s Gloves: 00065B9D\r\n\r\n\r\n[u]KNOWN ISSUES AND CONFLICTS[/u]\r\nThis mod will conflict with any other mod that changes the Archmage Outfit or the Psijic Monk Outfit.  It will also conflict with any mod that changes the individual articles of clothing found in those outfits.  Finally, there will be conflicts with any mod that changes the Papyrus script named \\\"TIF__00107E3D\\\", which is the quest script that gives the player the Archmage\\'s clothing and key at the end of the College of Winterhold questline.\r\n\r\nThere should NOT be any conflict with mods that change Savos Aren or the Psijic monks directly, or with any mod that alters the Archmage\\'s Quarters cell.\r\n\r\nPlease note that this mod works best if it is installed before you meet either Savos Aren or the Psijic monks.  If it is activated after you have met these characters, they may be wearing some or all of their original outfits.  However, either way, you should still receive the Archmage\\'s clothing with the new models at the end of the College of Winterhold questline.\r\n\r\n\r\n[u]FUTURE PLANS[/u]\r\n* Optimize downloadables for NMM\r\n\r\n* Add a script determining what Savos Aren and the Psijics are wearing and changing them if necessary\r\n\r\n* Add an optional version that gives the player the entire Archmage outfit upon loading the mod, as long as they have finished the College of Winterhold questline\r\n\r\n* Add an optional \\\"cheat\\\" version that gives the player the entire Archmage outfit upon loading the mod, regardless of whether they have finished the College of Winterhold questline or not\r\n\r\n\r\n[u]LEGAL & CREDITS[/u]\r\nMod created by Rogue Hallow\r\n\r\nPrograms used:\r\nCreation Kit\r\nNotepad++\r\nG.I.M.P.\r\n\r\nThanks to:\r\nBethesda and the makers of [i]Skyrim[/i]\r\nThe creators and maintainers of the Skyrim Nexus\r\n\r\nPlease do not use this mod in your own mod or upload it to any site but the Nexus without the express permission of its author, Rogue Hallow.\r\n\r\nNo assets from any other game were used in the making of this mod.",
  "categoryId": "60",
  "version": "BETA2",
  "author": "Rogue Hallow",
  "createdUnix": "1335818263",
  "updatedUnix": "1335857838",
  "containsAdultContent": false,
  "uploadedBy": "roguehallow",
  "primaryFile": null,
  "files": [
    {
      "fileId": "57658",
      "name": "RH Psijic Archmage Robes Switcher Beta1",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "RH Psijic Archmage Robes Switcher Beta1-16194.zip",
      "uploadedUnix": "1335819309",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/ee7d7321bf297ed5cbbc88055f880aabb93a8593abe7a29ebfdc4cebed021150/analysis/1406857267/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RH%20Psijic%20Archmage%20Robes%20Switcher%20Beta1-16194.zip?fid=57658&ttl=1535781189&ri=8192&rs=8192&setec=9e7b4b7914c5c0b016a97358290f5304"
    },
    {
      "fileId": "57754",
      "name": "RH Psijic Archmage Robes Switcher",
      "version": "BETA2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "43514",
      "fileName": "RH Psijic Archmage Robes Switcher-16194-BETA2.zip",
      "uploadedUnix": "1335857838",
      "modVersion": "BETA2",
      "virusScanUrl": "https://www.virustotal.com/file/f7dd977ead1687d33f7a9b9e1580d9921a0b57cd27f8aa37d5d74624371d622f/analysis/1406858175/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RH%20Psijic%20Archmage%20Robes%20Switcher-16194-BETA2.zip?fid=57754&ttl=1535781189&ri=8192&rs=8192&setec=f775d59dd0d5d61da6df5ec723c998f7"
    }
  ]
}