{
  "modId": 16209.0,
  "modName": "Vocaloid Hatsune Miku",
  "summary": "This mod is meant to be a full-blown extension of the original \\\"MikuMod\\\" by LT@3DM. It adds Clothing / Armor and Weapons so that players can play as Hatsune Miku from Helgen Keep onwards. ",
  "descriptionHtml": "[COLOR=#ff00cc][SIZE=6][B]Detailed Description / Information[/SIZE][/COLOR][/B]\r\nFor those who do not know about Vocaloid or Hatsune Miku and are curious about them, the last section of this overview includes a brief summary of official information about both. The game modding and Vocaloid communities are two successful examples of consumer generated media (CGM), so it seems quite logical to combine the creative efforts from the two areas.\r\n\r\n[CENTER][COLOR=#00cccc][SIZE=5]\\\"No one knows the power of the Voice, or Thu\\'um, better than those who are the embodiment of it: the Vocaloids.\\\"[/SIZE][/COLOR]\r\n[COLOR=#0099ff][SIZE=4]-- Unknown sage of the Bard\\'s College in Solitude[/SIZE][/COLOR][/CENTER]\r\n\r\n\r\nDemo 01\r\n(sorry about the audio echo -- I accidentally left the mic on during recording)\r\n\r\n[YOUTUBE]IT3Nttw4VpQ[/YOUTUBE]\r\n\r\nDemo 02\r\n(better audio than Demo 01 + includes a brief look at some crafting recipes at the end)\r\n\r\n[YOUTUBE]lzh_avvcouM[/YOUTUBE]\r\n\r\n\r\nThe following information covers the original mod and the greatly extended features of my mod.\r\n\r\n[COLOR=#0099cc][B]Original Mod (\\\"MikuMod.esp\\\") by LT@3DM[/B][/COLOR]\r\nThe original Hatsune Miku mod by LT@3DM (aka \\\"MikuMod.esp\\\") allowed players to use armor/outfit pieces (DragonPriest wooden mask, cuirass, and boots) in order to change their character to appear as Miku while playing Skyrim. An update to the mod added the negi weapon that is Miku\\'s character item (sometimes called a leek, but negi is actually a spring onion in Japan). The first version of the mod was a replacer, but the update offered the mod as a non-replacer. My extension of the original mod uses the non-replacer version.\r\n\r\nThe original mod was quite nice, but it suffered from several limitations due to being released prior to the official Creation Kit toolset, as well as certain choices regarding the properties of the pieces of equipment. This caused it to only offer the appearance of being Miku without any attempt at balancing the new content so that the player could actually play through the game as her. For example, the damage for the negi weapon in the original mod was 64, but the highest base damage for one-handed swords in Skyrim is 14 or so. Also, there was no provision for the negi being any weapon other than a sword (e.g., there was no way to play Miku as a mage using a staff or dual-wielding staves). Finally, the armor outfit was set to values roughly equal to Ebony, and neither weapons nor armor could be upgraded.\r\n\r\n[COLOR=#0099cc][B]Vocaloid Hatsune Miku by AiTenshi1[/B][/COLOR]\r\nMy mod extends the original in many ways. The intent is to allow the player to use the new equipment to play as Vocaloid Hatsune Miku almost from the very beginning of the game. Once the player enters Helgen Keep and is freed by either Hadvar or Ralof (depending on who you followed into the Keep), the player will have access to one of two respawning chests with some of Miku\\'s equipment in it. If you choose to follow Ralof, you\\'ll have to defeat the initial band of Imperial soldiers before gaining access to the chest because it is located in the room with the other chests and beds. The other respawning chest is located in Whiterun if you are curious.\r\n\r\nMiku\\'s outfit has been matched to each type of basic armor, as well as cloth-based outfits for unarmored characters (e.g., mages). Likewise, her Negi weapon has been matched to the various types of basic one-handed weapons, as well as the various staves used by mages. \r\n\r\nBoth armor and one-handed Negi weapons can be created and/or upgraded depending on the character\\'s Smithing skill. Negi staves can be created by converting normal staves, and the unarmored cloth-based outfits can be converted from existing College of Mages robes, circlets (converted to Miku\\'s Mask), and the few enchanted boots depending on the character\\'s Enchanting skill. Unenchanted robes, Masks, and boots can be crafted from common materials. Some of the items require additional elements (e.g., Negi weapons require leeks as part of their recipe).\r\n\r\nPlease note that the general approach for this mod is a bit different than creating a unique, custom Vocaloid race. Players will still choose a default race from the very beginning of the game, and they will still get the same default abilities, spells, etc. However, this approach should avoid any conflicts, or at least most conflicts, including alternate starts or custom races from other mods, because you are simply wearing a different outfit rather than changing inherent character traits.\r\n\r\n[COLOR=#0099cc][B]Clothing / Armor[/B][/COLOR]\r\n* Miku\\'s outfit pieces (i.e., Mask, Cuirass, and Boots) are available in the following Heavy Armor material types, including crafting and tempering, depending on the Smithing skill of the character:\r\n[LIST]\r\n[*]Iron\r\n[*]Steel\r\n[*]Steel Plate\r\n[*]Dwarven\r\n[*]Orcish\r\n[*]Ebony\r\n[*]Daedric\r\n[*]Dragonplate\r\n[/LIST]\r\n* Miku\\'s outfit pieces (i.e., Mask, Cuirass, and Boots) are available in the following Light Armor material types, including crafting and tempering, depending on the Smithing skill of the character:\r\n[LIST]\r\n[*]Hide\r\n[*]Leather\r\n[*]Elven\r\n[*]Scaled\r\n[*]Glass\r\n[*]Dragonscale\r\n[/LIST]\r\n* I have not included enchanted versions of the armor at this time because I do not think it is needed, but we will see.\r\n* Miku\\'s outfit pieces (i.e., Mask, Clothes, and Boots) are available as a form of unechanted, unarmored Clothing by crafting the pieces from common materials.\r\n* The enchanted versions of Mage College Robes, including the Archmage Robes, can be converted into enchanted versions of Miku\\'s Clothes via crafting, depending on the Enchanting skill of the character.\r\n* I have not included either Necromancer or Warlock robes at this time as I do not think it is needed, but we will see.\r\n* The few examples of enchanted versions of the unarmored Boots, including the Archmage Boots, can be converted into enchanted versions of Miku\\'s Boots via crafting, depending on the Enchanting skill of the character.\r\n* The various enchanted versions of Circlets can be converted into Miku\\'s Mask via crafting, depending on the Enchanting skill of the character.\r\n\r\n[COLOR=#0099cc][B]Weapons[/B][/COLOR]\r\n* Negi swords are available in the following material types, including crafting and tempering recipes, depending on the Smithing skill of the character:\r\n[LIST]\r\n[*]Iron\r\n[*]Steel\r\n[*]Orcish\r\n[*]Dwarven\r\n[*]Elven\r\n[*]Glass\r\n[*]Ebony\r\n[*]Daedric\r\n[/LIST]\r\n* Negi versions of the various Mage Staves are available via crafting by converting an acquired staff into a Negi that has the same properties as the original staff.\r\n\r\n[COLOR=#0099cc][B]Miscellaneous[/B][/COLOR]\r\n* Leeks have been added to all leveled lists for food using Cabbage as the guideline (i.e., the Cabbage lists were mirrored and edited to include Leeks, then the new Leek lists were added to the lists for randomly found food). The original leveled lists for food did not include Leeks as a possible item, thus leading to Leeks being one of the rarer food items in the game (see the UESP Wiki entry for Leek). However, since Negi weapons require Leeks for crafting, I felt that it was important to include them (not to mention it makes much more sense in the game world).\r\n* I have included a couple of small fixes that I noticed when I was going through the one-handed weapons data specifics, but that have not yet been included in the Unofficial Skyrim Patch. These fixes are outlined below and I have reported them to the USKP team on the bugs web site. The changed values match all other one-handed weapons values for that particular weapon type.\r\n\r\n[LIST]\r\n[*]Weapon Name: Iron Sword \r\n[*]Weapon Stat: Critical % \r\n[*]Original Value: 0.00 \r\n[*]Changed Value: 1.00 \r\n[/LIST]\r\n\r\n[LIST]\r\n[*]Weapon Name: Ebony Dagger \r\n[*]Weapon Stat: Speed \r\n[*]Original Value: 1.00 \r\n[*]Changed Value: 1.30 \r\n[/LIST]\r\n\r\n[LIST]\r\n[*]Weapon Name: Orcish Waraxe \r\n[*]Weapon Stat: Critical % \r\n[*]Original Value: 0.00 \r\n[*]Changed Value: 1.00 \r\n[/LIST]\r\n\r\n[LIST]\r\n[*]Weapon Name: Orcish Waraxe \r\n[*]Weapon Stat: Speed \r\n[*]Original Value: 1.00 \r\n[*]Changed Value: 0.90 \r\n[/LIST] \r\n\r\n[COLOR=#0099cc][B]Disclaimer and PhD Dissertation Research Information[/COLOR][/B]\r\nI do not have any abilities in 3D CG art and modeling, nor do I have any time to create new assets even if I did have the skills. Likewise, I do not have any skills or time for scripting. Actually, I do not currently have experience in using the Vocaloid software, but it is intended for both average users and professional musicians. Of course, people who have such skills or are interested in obtaining them are welcome to contact me to help with the project. I would love to hear from someone who has skills that might make the mod even better!\r\n\r\nI am currently pursuing my doctoral degree in technology with a concentration in technology studies. I am a doctoral candidate (i.e., I have completed all the required coursework), and I am starting on my formal dissertation proposal and research during the summer 2012 semester. This project is related to my dissertation topic. Some people have asked me about additional details regarding my dissertation research. The details are still being worked out, of course, but I have offered a general summary in the ReadMe file. For anyone who is only interested in the mod itself, please feel free to skip this information.\r\n\r\n\r\n[COLOR=#ff00cc][SIZE=6][B]Installation[/SIZE][/COLOR][/B]\r\nRegarding load order, I always load this mod near the end. However, technically speaking, it is a clothing / armor / weapon mod that adds new outfits and a new weapon, so it should be okay to load it wherever you normally load such mods. Usually, such mods tend to be higher up in the load order, typically placed before environment and character / companion / NPC mods.\r\n\r\n[COLOR=#0099cc][B]Wrye Smash / Bash[/B][/COLOR]\r\n[LIST]\r\n[*]Copy the [B]Vocaloid Hatsune Miku.7z[/B] compressed file package into your Bash Installers folder.\r\n[*]Open your Wrye tool and click the Installers tab. The Vocaloid Hatsune Miku package should appear in your list of packages.\r\n[*]Install as usual for Wrye Installers.\r\n[*]Activate the mod by checking its check box in Wrye.\r\n[*]The [B]ReadMe[/B] file is an HTML file located in Skyrim/Data/Docs ([B]Vocaloid Hatsune Miku.html[/B]).\r\n[*]The [B]ReadMe[/B] for the [B]original mod[/B] is included for reference and can also be found in Skyrim/Data/Docs.\r\n[/LIST]\r\n\r\n[COLOR=#0099cc][B]Nexus Mod Manager (NMM)[/B][/COLOR]\r\n[LIST]\r\n[*]Click on the [B]Download With Manager[/B] link to add the [B]Vocaloid Hatsune Miku.7z[/B] compressed file package to your NMM mods list.\r\n[*]Install as usual for NMM installation.\r\n[*]Activate the mod by checking its check box in NMM.\r\n[*]The [B]ReadMe[/B] file is an HTML file located in Skyrim/Data/Docs ([B]Vocaloid Hatsune Miku.html[/B]).\r\n[*]The [B]ReadMe[/B] for the [B]original mod[/B] is included for reference and can also be found in Skyrim/Data/Docs.\r\n[/LIST]\r\n\r\n[COLOR=#0099cc][B]Manual[/B][/COLOR]\r\n[LIST]\r\n[*]Click on the [B]Download Manually[/B] link to download the [B]Vocaloid Hatsune Miku.7z[/B] compressed file package to your computer\\'s hard drive.\r\n[*]Move the 7z compressed file package into a separate folder and extract its contents. [I]Please note that I never recommend a direct extraction into your Skyrim/Data folder[/I].\r\n[*]Copy the contents of the extracted Data folder into your Skyrim/Data folder. If asked to overwrite anything, reply \\\"Yes,\\\" but this should not occur with this mod since its files are all unique.\r\n[*]Activate the mod by checking its check box in your launcher or mod manager of choice.\r\n[*]The [B]ReadMe[/B] file is an HTML file located in Skyrim/Data/Docs ([B]Vocaloid Hatsune Miku.html[/B]).\r\n[*]The [B]ReadMe[/B] for the [B]original mod[/B] is included for reference and can also be found in Skyrim/Data/Docs.\r\n[/LIST]\r\n\r\n[COLOR=#ff00cc][SIZE=6][B]Uninstallation[/SIZE][/COLOR][/B]\r\nIf you are using Wrye\\'s tools for mod management and to create a Bashed Patch.esp, you might wonder whether or not you need to rebuild your Bashed Patch after removing this mod. However, since this mod only adds the Leeks to the loot leveled lists and does not remove anything, no Bash Tags are used and it should not be necessary to rebuild your Bashed Patch. You can verify this by reviewing the log that was created when you built your Bashed Patch.esp. The log is found in Skyrim/Data/Docs and is named the same as your Bashed Patch file.\r\n\r\n[COLOR=#0099cc][B]Wrye Smash / Bash[/B][/COLOR]\r\n[LIST]\r\n[*]Deactivate the mod by unchecking its check box in Wrye.\r\n[*]Uninstall as usual for Wrye Installers.\r\n[*]If desired, delete the package from the Wrye Installers tab to remove the mod entirely (aside from any backup copies stored elsewhere on your hard drive, of course).\r\n[/LIST]\r\n\r\n[COLOR=#0099cc][B]Nexus Mod Manager (NMM)[/B][/COLOR]\r\n[LIST]\r\n[*]Deactivate the mod by unchecking its check box in NMM.\r\n[*]Uninstall as usual for NMM Mods.\r\n[*]If desired, delete the package from the NMM Mods tab to remove the mod entirely (aside from any backup copies stored elsewhere on your hard drive, of course).\r\n[/LIST]\r\n\r\n[COLOR=#0099cc][B]Manual[/B][/COLOR]\r\n[LIST]\r\n[*]Deactivate the mod by unchecking its check box in your launcher or mod manager of choice.\r\n[*]Delete all of its files from the Data folder and any subfolders contained in the mod\\'s 7z compressed file package.\r\n[/LIST]\r\n\r\n[COLOR=#ff00cc][SIZE=6][B]Incompatibility / Conflicts[/SIZE][/COLOR][/B]\r\n[LIST]\r\n[*]There are no known conflicts with this mod. It uses unique files and is not a replacer, so it should be very compatible with other mods. \r\n[*]It does change the loot leveled lists slightly in order to include Leeks, so there is a small chance that another mod might change the same lists and thus conflict.\r\n[/LIST]\r\n\r\n[COLOR=#ff00cc][SIZE=6][B]Known Issues / Bugs[/SIZE][/COLOR][/B]\r\n[COLOR=#0099cc][B]Known Issues[/B][/COLOR]\r\n[LIST]\r\n[*]I have attempted to use the available assets to create versions of the waraxe and mace so that players can choose whichever one-handed perk path they desire. However, the assets that came with the original mod were for one-handed swords and have some type of error when changed to either waraxes or maces. They work fine as one-handed swords, of course, and they even work fine as staves. However, both the waraxe and the mace disappear from Miku\\'s right hand when the assets are changed to Negi versions. They appear okay in her left hand, but not her right. Someone with skills in 3DCG modeling would have to correct this problem in order for me to offer these weapon options. If anyone is interested in working on this issue, please contact me.\r\n[*]The Negi versions of Mage Staves use the Negi Sword assets because that is what is available from the original mod. This works as far as animation and combat, but it also means that the alternate textures are the ones for Swords, not the ones for the original Staves. If anyone wants to remake the Negi assets as Staves with the various alternate textures from the originals, please contact me.\r\n[*]Miku\\'s synthesizer sleeves are not shown in 1st person view. This appears to be due to a lack of assets in the original mod, so I cannot do anything about it at this point. Someone with skills in 3DCG modeling would have to create the 1st person perspective of Miku\\'s arms and hands in order to correct this issue. This would be a form of \\\"Miku Gloves\\\" just as the current assets consist of \\\"Miku Cuirass\\\" (or \\\"Miku Clothes\\\") for the body, \\\"Miku Mask\\\" for the face, and \\\"Miku Boots\\\" for the legs and feet. If anyone is interested in working on this issue, please contact me.\r\n[/LIST]\r\n\r\n[COLOR=#0099cc][B]Bugs[/B][/COLOR]\r\nThere are no known bugs at this time. Please contact me via the official Bethesda forums if you think you have discovered a bug.\r\n\r\n[COLOR=#ff00cc][SIZE=6][B]Future Plans / Ideas[/SIZE][/COLOR][/B]\r\nI have offered several ideas about the possible evolution of the mod, as well as other potential mods similar to this one, in the ReadMe file. The following list is simply the topics I have considered, but there are probably many more.\r\n\r\n[LIST]\r\n[*]Voice Files\r\n-- Shouts\r\n-- Combat\r\n-- Alchemy\r\n-- Enchanting\r\n-- Lockpicking\r\n-- Looting\r\n-- Many more!\r\n[*]New Vocaloid Characters / Mods\r\n[*]Music Files / Mods\r\n[*]Custom Classes / Races\r\n[*]New Outfits / Armor / Magic\r\n[/LIST]\r\n\r\n[COLOR=#ff00cc][SIZE=6][B]Changelog / Version History[/SIZE][/COLOR][/B]\r\n\r\n[B]1.0.0.0 Initial Release [2012 / 04 / 30][/B]\r\n[LIST]\r\n[*]Official public release\r\n[*]Out of alpha / beta testing\r\n[*]Added Light Armor version of outfits\r\n[/LIST]\r\n\r\n[COLOR=#ff00cc][SIZE=6][B]Tools Used[/SIZE][/COLOR][/B]\r\n[LIST]\r\n[*]Bethesda\\'s official Creation Kit toolset\r\n[*]Wrye Smash / Bash\r\n[*]FRAPS\r\n[*]Windows Movie Maker\r\n[*]aTubeCatcher\r\n[*]Any Audio Converter\r\n[*]Bulk Rename Utility\r\n[*]GIMP\r\n[*]IrfanView\r\n[/LIST]\r\n\r\n\r\n\r\n[COLOR=#ff00cc][SIZE=6][B]License and Usage Information[/B][/SIZE][/COLOR]\r\nPlease review the following information regarding reuse, alteration, distribution, etc., and contact me if there are any questions. \r\n\r\nThe information may seem a bit more extensive than similar info offered for other mods, but that is partly because the rights to the use and distribution of Hatsune Miku\\'s name and character image are owned by her creator, Crypton Future Media, Inc., located in Sapporo, Japan. CFM allows and encourages consumer generated content creation via a licensing and business model very similar to the Creative Commons license, but that doesn\\'t mean that any and every use is okay (e.g., commercial use must be approved by CFM, and certain other requested uses such as political messages have been denied by CFM in the past). \r\n\r\nThis is similar to how Bethesda Softworks allows and encourages specific mods for their games, too, but does not openly support certain other uses (e.g., killable children is a taboo topic on the official Bethesda forums).\r\n\r\n[COLOR=#0099cc][B]License: Creative Commons, CC BY-NC-SA[/B][/COLOR]\r\nThis mod is released under the Creative Commons License, Attribution-NonCommercial-ShareAlike 3.0 Unported\r\n[URL=http://creativecommons.org/licenses/by-nc-sa/3.0/legalcode]http://creativecommons.org/licenses/by-nc-sa/3.0/legalcode[/URL]\r\n\r\nIt might be more useful to review a simple, user-friendly version of the above license. However, please note that the following user-friendly version does not replace the actual license nor does it constitute an actual license. It merely offers a non-legal version to assist with understanding the license itself.\r\n[URL=http://creativecommons.org/licenses/by-nc-sa/3.0]http://creativecommons.org/licenses/by-nc-sa/3.0[/URL]\r\n\r\nI have offered a reprint of the user-friendly version below, slightly edited for the specific use of user-created game mods.\r\n\r\n\r\n[COLOR=#0099cc][B]You are free to:[/B][/COLOR]\r\n\r\n* [B]Share[/B] -- to copy, share and distribute the mod\r\n* [B]Remix[/B] -- to adapt the mod\r\n\r\n[COLOR=#0099cc][B]Under the following conditions:[/B][/COLOR]\r\n\r\n* [B]Attribution[/B] -- You must attribute the mod in the manner specified by the author or licensor (but not in any way that suggests that they endorse you or your use of the mod).\r\n* [B]Noncommercial[/B] -- You may not use this mod or any of its elements for commercial purposes.\r\n* [B]Share Alike[/B] -- If you alter, transform, or build upon this mod, you may distribute the resulting work only under the same or similar license to this one.\r\n\r\n[COLOR=#0099cc][B]With the understanding that:[/B][/COLOR]\r\n\r\n* [B]Waiver[/B] -- Any of the above conditions can be [URL=http://wiki.creativecommons.org/Frequently_Asked_Questions#Can_I_change_the_terms_of_a_CC_license_or_waive_some_of_its_conditions.3F]waived[/URL] if you get permission from the copyright holder.\r\n\r\n* [B]Public Domain[/B] -- Where the mod or any of its elements is in the [URL=http://wiki.creativecommons.org/Public_domain]public domain[/URL] under applicable law, that status is in no way affected by the license.\r\n\r\n* [B]Other Rights[/B] -- In no way are any of the following rights affected by the license:\r\n-- Your fair dealing or [URL=http://wiki.creativecommons.org/Frequently_Asked_Questions#Do_Creative_Commons_licenses_affect_fair_use.2C_fair_dealing_or_other_exceptions_to_copyright.3F]fair use[/URL] rights, or other applicable copyright exceptions and limitations;\r\n-- The author\\'s [URL=http://wiki.creativecommons.org/Frequently_Asked_Questions#I_don.E2.80.99t_like_the_way_a_person_has_used_my_work_in_a_derivative_work_or_included_it_in_a_collective_work.3B_what_can_I_do.3F]moral[/URL] rights;\r\n-- Rights other persons may have either in the work itself or in how the work is used, such as [URL=http://wiki.creativecommons.org/Frequently_Asked_Questions#When_are_publicity_rights_relevant.3F]publicity[/URL] or privacy rights.\r\n\r\n* [B]Notice[/B] -- For any reuse or distribution, you must make clear to others the license terms of this mod. The best way to do this is with a link to the web page above just as I have done here.\r\n\r\n\r\n\r\n[COLOR=#0099cc][B]Courtesies[/B][/COLOR]\r\nWhile the license above [I]allows[/I] modification and redistribution for noncommercial purposes, I\\'d [I]prefer[/I] to keep it under my control for now. Therefore, please try to contact me before modifying or redistributing it. \r\n\r\nBesides, I like to hear from people who have new ideas as it helps to motivate me and helps to generate new collaborative creative efforts!\r\n\r\n[COLOR=#ff00cc][SIZE=6][B]License: Additional Resources[/B][/SIZE][/COLOR]\r\nIn addition to the above licensing details, the following information may be required for certain types of uses and/or distribution (e.g., anything commercial in nature, certain sensitive social topics such as political messages, etc.).\r\n\r\n(Please note that information on Crypton Future Media\\'s English web page for Hatsune Miku is somewhat outdated now as her popularity and awards have continued to escalate since the page was first created).\r\n\r\n[COLOR=#0099cc][B]Crypton Future Media, Incorporated[/B][/COLOR]\r\nAs I mentioned above, the use and distribution rights for [URL=http://www.crypton.co.jp/mp/pages/prod/vocaloid/cv01_us.jsp]Hatsune Miku\\'s[/URL] name and character image are owned by her creator, [URL=http://www.crypton.co.jp]Crypton Future Media, Inc.[/URL], located in Sapporo, Japan, and cannot be used for commercial purposes without their permission.\r\n\r\n[COLOR=#0099cc][B]Yamaha Corporation[/B][/COLOR]\r\n[URL=http://vocaloid.com/en]Vocaloid(TM)[/URL] is a trademark of [URL=http://www.yamaha.com]Yamaha Corp.[/URL]\r\n\r\n\r\n[COLOR=#ff00cc][SIZE=6][B]Credits and Contact Information[/B][/SIZE][/COLOR]\r\nI just wanted to offer some appreciation to the following companies and/or individuals for their contributions to this mod.\r\n\r\n[COLOR=#0099cc][B]Credits[/B][/COLOR]\r\n* [B]Bethesda Softworks[/B] and [B]Bethesda Game Studios[/B] for creating a great game!\r\n* [B]Wrye[/B] for creating an indispensable mod management and assistance tool!\r\n* [B]Yamaha Corp.[/B] for creating the Vocaloid singing synthesis technology!\r\n* [B]Crypton Future Media, Inc.[/B] for creating Hatsune Miku and the other CFM Vocaloids!\r\n* All credit for the original art assets and the original \\\"MikuMod.esp\\\" goes to [B]LT@3DM[/B]. My mod simply greatly extends the ingame usage! Please note that I have been unable to contact LT@3DM despite searching extensively for contact information for the original author, including on the original Chinese BBS thread (the author is Chinese, or at least the original thread for the mod is Chinese). I am offering the mod to the community as it simply extends the original work\\'s functionality, but I will be happy to remove it if requested to do so.\r\n\r\n[COLOR=#0099cc][B]Contact Information[/B][/COLOR]\r\nThe best way to contact me is via the [URL=http://forums.bethsoft.com/topic/1370784-relz-vocaloid-hatsune-miku]official Bethesda forums[/URL]. I am there fairly often under the username, [I][URL=http://forums.bethsoft.com/user/383732-aitenshi1]AiTenshi1[/URL][/I], and any PMs are forwarded to my main email account. I\\'ll try to respond within 24 hours barring any real life obstacles.\r\n\r\n\r\n[COLOR=#ff00cc][SIZE=6][B]About Vocaloid and Hatsune Miku[/SIZE][/COLOR][/B]\r\nAs you absorb the following information, you may notice that there is a great deal of similarity between the creative efforts within the game modding community and the creative efforts within the Vocaloid community.\r\n\r\nVocaloid is a singing synthesis software technology developed by Yamaha Corporation in a joint effort with Pompeu Fabra University in Spain. It is somewhat analogous to speech synthesis software, but it is intended for singing, thus making it more difficult to create speech using the software. Vocaloid was first announced by Yamaha in 2003 and the first commercial products featuring the software went on sale in 2004. The first Vocaloid products were Leon and Lola, and they were created by a United Kingdom company, Zero-G.\r\n\r\nThe Vocaloid software requires a \\\"voice bank\\\" of phonemes (i.e., the \\\"pieces\\\" of our language such as vowel and consonants sounds and various complex compound sounds made up of vowels + consonants, inflections, elongations, etc.). A user can input a melody and lyrics into the software, as well as various vocal effects such as vibrato, tremolo, etc. The software\\'s synthesis engine will accept the melody, lyrics, and effects from the user\\'s input, access the voice bank, and sing the song for you.\r\n\r\nHere is a video interview with Eiji Hirasawa, the man who composed the very first song for demonstrating Vocaloid Hatsune Miku, \\\"Hoshi no Kakera\\\" (\\\"Star Shard\\\"). This song was originally entitled, \\\"Ballade,\\\" but was later changed to \\\"Hoshi no Kakera.\\\" As you can see in the interview, the GUI looks like a player piano paper roll.\r\n\r\nInterview with Eiji Hirasawa, composer of \\\"Hoshi no Kakera\\\" (\\\"Star Shard\\\") featuring Hatsune Miku\r\n\r\n[YOUTUBE]9lfPseUzzJs[/YOUTUBE]\r\n\r\n\r\nThe second version of the software, Vocaloid2, was released in 2007. The third version, Vocaloid3, went on sale in September 2011. Although the first two versions were only offered in Japanese and English, Vocaloid3 features support for several additional languages. Here is a Yamaha\\'s official Vocaloid web site (English version), including a promotional video from Yamaha that was made for the launch of Vocaloid3.\r\n\r\n[URL=http://vocaloid.com/en]Yamaha\\'s Vocaloid Web Site (English)[/URL]\r\n\r\nCrypton Future Media, Inc. in Sapporo, Japan was one of several companies, including the aforementioned Zero-G, that had been creating Vocaloid voice banks. Their first two Vocaloid products were Meiko and Kaito, and were created using the first version of the software. With Vocaloid2, Crypton\\'s CEO, Hiroyuki Itoh, decided to launch a \\\"Character Vocal Series\\\" line of products. His idea was to hire voice actors for the recordings rather than singers because the software could handle the singing as long as the voice bank of phonemes was recorded well. In addition, his intention with the \\\"Character Vocal Series\\\" was to create avatars for each voice bank so that the products were personified. He felt that this would help people relate to the music more easily.\r\n\r\nThe first product of Crypton\\'s Character Vocal Series (CV01) was Hatsune Miku. She is actually a personification of Yamaha\\'s DX-7 synthesizer, the first commercially successful synthesizer that was featured in various hit songs during the 1980s. Hatsune Miku went on sale on August 31, 2007, and the rest, as they say, is history, a history that continues to be created right now. According to a recent report on NHK, she has sold 70,000 units (i.e., she has 70,000 song writers working to create her music), and a consultant for the Nomura Research Institute estimates that the total value for her goods and services exceeds 10 billion yen (approximately 100 million $US).\r\n\r\nCrypton supported the idea of bottom-up, user-created content by creating a content sharing web site called PiaPro (\\\"Peer Production\\\") and launching their own Vocaloid music label, KarenT, so that Vocaloid music producers could gain visibility for their works. The timing of Miku\\'s release was serendipitous, too, because NicoNico Douga (Japan\\'s version of YouTube) was just gaining popularity, just as YouTube was in America. Companies could see what content was most popular and license it for use in games, CDs, DVDs, figures, books, etc. without needing to do market research and reaching questionable conclusions about target market demographics. \r\n\r\nConsider a company such as YouTube where the content is created for free by the users, not by a company employee. Vocaloid, particularly Hatsune Miku, has exploded in popularity by supporting the same idea, empowering users to create and rate content. Just as Bethesda has acknowledged game mods and included various mod concepts in successive Elder Scrolls games, Hatsune Miku has proven to companies that the users and consumer audiences are the best judges of what the market wants.\r\n\r\nSongs featuring Hatsune Miku began hitting the top ten on Japan\\'s Oricon music charts in 2009 and continue to do so today. Her songs have also hit the top of the world charts for digital download services such as iTunes, and Billboard magazine\\'s January, 2011 issue listed her as one of their select artists to watch during the upcoming year. They were right, too. Miku continued to win awards and popularity around the world during 2011 and 2012, and became the spokesperson for both Toyota\\'s 2011 Corolla in America and Google Chrome in Japan. Her English voice bank is due out sometime in 2012.\r\n\r\nMany of Miku\\'s most popular songs are fast-paced, techno-pop types of music, but she and the other Vocaloids can actually sing almost anything. It all depends on the skill of the producer, after all. For example, she has sung opera songs, and she has even sung some songs in English using her Japanese voice bank! In fact, the English Vocaloids from Zero-G, Prima and Tonio, are specifically intended to be opera singers. There are accents for any language, after all, even within a specific country, so we can look at Vocaloids speaking or singing outside of their native language or their typical music genre(s) as simply being a different type of accent.\r\n\r\nHere is one of Miku\\'s early ballads, \\\"Izumi no Megami\\\" (\\\"Goddess of Spring\\\") (English subtitles in this version). This song and the accompanying promotional video for it seem to fit rather well with The Elder Scrolls game world.\r\n\r\n\\\"Izumi no Megami\\\" (\\\"Goddess of Spring\\\") (English sub) featuring Hatsune Miku\r\n\r\n[YOUTUBE]BVYTpHV8y88[/YOUTUBE]\r\n\r\n\r\nOriginally, Yamaha did not offer their own Vocaloid products, and instead simply licensed the technology to various companies who wanted to create a product using it. They started offering some of their own Vocaloid voice banks after Hatsune Miku exploded into a global phenomenon and launched the \\\"Vocaloid Movement\\\" (aka the \\\"Hatsune Miku Movement\\\").",
  "categoryId": "60",
  "version": "1.0.0.0",
  "author": "AiTenshi1",
  "createdUnix": "1335841820",
  "updatedUnix": "1335842394",
  "containsAdultContent": false,
  "uploadedBy": "AiTenshi1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "57728",
      "name": "Vocaloid Hatsune Miku",
      "version": "1.0.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7469",
      "fileName": "Vocaloid Hatsune Miku-16209.7z",
      "uploadedUnix": "1335842394",
      "modVersion": "1.0.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/254c90ba78ecf4615c9aa14c0d53ec90d40fdb327f95c2d6d8c5b788b90fe9c1/analysis/1406857992/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vocaloid%20Hatsune%20Miku-16209.7z?fid=57728&ttl=1535781210&ri=8192&rs=8192&setec=dc61f8ac06d36f38f5d424cad41f7178"
    }
  ]
}