{
  "modId": 16243.0,
  "modName": "A Vlindrel Hall Refurbished",
  "summary": "Vlindrel hall was my favorite house in Skyrim because of the dwemer architecture but i was dissapointed in the furnishings and storage space so i refurnished it a bit more to my liking added some more displays throughout the house plaques, manniqans, weapon racks and more than enough display cases. also added more lighting and just a more general u",
  "descriptionHtml": "BEST USED WITH http://skyrim.nexusmods.com/downloads/file.php?id=4236  By Decembria nicer textures, screenshots were taken with this mod WARNING quote\\\" Aurielius \r\nThat mod of Vindrel Hall (that you have linked to) replaces textures in ALL Dwemer ruins, something one might want to consider before implementing.\\\" \r\n\r\nfixing shelves for autofill going to use \\\"unlimited bookshelves\\\" by \\\"da5id2701\\\" http://skyrim.nexusmods.com/downloads/file.php?id=10891 adding more containers and fixing some minor lighting issues adding a few light switches and moving the crafting area in the front around a bit will have an update out tomorrow sometime, appreciate the feedback\r\n\r\n\r\nVlindrel hall was my favorite house in Skyrim because of the dwemer architecture but i was dissapointed in the furnishings and storage space so i refurnished it a bit more to my liking added some more displays throughout the house plaques, manniqans, weapon racks and more than enough display cases. also added better lighting and just a more general upscale feel to the place. forge sharpener enchanting station alchemy station and a tanning rack are all included, There will be updates coming out for people who would like a bit more clutter in the house plates bowls cups etc also i will be filling out the armory and the potions /enchants room with more misc. useable clutter ingridients soul gems etc... and will be adding lightswitches. this is an esp only file so i did not include a readme. i took special care with this mod so that you wont get a FPS hit while ur walking around your house ",
  "categoryId": "67",
  "version": "",
  "author": "SnowCrash",
  "createdUnix": "1335889410",
  "updatedUnix": "1335890579",
  "containsAdultContent": false,
  "uploadedBy": "SnowCrash9231",
  "primaryFile": null,
  "files": [
    {
      "fileId": "57867",
      "name": "Vlindrel Hall refurbished",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Vlindrel Hall refurbished-16243-1.7z",
      "uploadedUnix": "1335890579",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/cad0fd9397eb7f28831613ea468d6a6028bc591ecd7b15bdf6f49b1e9d9a6ac1/analysis/1406859248/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vlindrel%20Hall%20refurbished-16243-1.7z?fid=57867&ttl=1535781256&ri=8192&rs=8192&setec=161f37669076fadace7f1f2c73a4498c"
    }
  ]
}