{
  "modId": 16289.0,
  "modName": "Dovas Rest",
  "summary": "Down with Loading Screens!!!! this a re-imagined version of my Cavern Isles player home, completely without any loading screens. It exists fully in the open world ",
  "descriptionHtml": " Ok- something is wrong with this mod in that everytime I fix the missing landscape textures (by editing each affected cell and applying the change before saving the mod itself) the landscape textures will reappear, but other landscape textures will disappear. So basically I am playing a game of musical chairs with these textures. Frankly, I am not really interested in this mod, I ported it out of my original cell on a request from a friend, and didn\\'t think it would be this much of a hassle to troubleshoot. That being said, I do not want to leave a glitched mod posted on Nexus. I will be removing this mod in about a week (today is Monday May 7th) just in case someone wants to download this for their own private use/ fix attempt/ whatever.\r\n\r\nThank you to all who expressed interest, and my apologies to those who were hoping this would get fixed.\r\n\r\nThis is a redesign of my Cavern Isle player home, set completely in the wide open world of Tamriel, meaning it exists fully loaded in the wilderness when you come upon it, no load screens! it is a full feature home stretched over a series of small islands in a lake. The home has all the crafting stations (including a smelter), lots of decorations, shrines to all the divines, 5 mannequins, a cooking area, sleeping areas, lots of storage and even a few merchants in a camp at the back with a whole lot of gold to spend on all your useless junk. (being in the open world, watch out for dragon flyby\\'s)\r\n\r\nIf you like it, check out my original home at:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11411\\\\\r\n\r\nAnd thanks to Svallbard for the embedded video showcasing this mod.\r\n\r\nversion 1.2 - lots of visual improvements, landscaping, terraforming, etc....\r\n\r\nversion 1.01 - Bug fix, map marker should be visible to anyone, just can\\'t fast travel to it until you discover it.\r\n\r\nversion 1.00 - initial remake of my Cavern Isle, might need a bit of refining",
  "categoryId": "67",
  "version": "1.2",
  "author": "Darkfrost5",
  "createdUnix": "1335931893",
  "updatedUnix": "1336181498",
  "containsAdultContent": false,
  "uploadedBy": "darkfrost5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "58343",
      "name": "Dovas Rest",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "95",
      "fileName": "Dovas Rest-16289-1-2.zip",
      "uploadedUnix": "1336057937",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/d136e61580ff9bd3a553d4a4388367b59f6123131dcf3e6affed8d0c34212824/analysis/1406863327/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovas%20Rest-16289-1-2.zip?fid=58343&ttl=1535781320&ri=8192&rs=8192&setec=97fecd57354c6d6511168810123d5eff"
    },
    {
      "fileId": "58767",
      "name": "Dovas Rest Roof",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "95",
      "fileName": "Dovas Rest Roof-16289-1-2.zip",
      "uploadedUnix": "1336181498",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/b61c2382947d826f9f703530d290adcb617ea9ebe10b353578d9e881207adc0e/analysis/1406867653/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovas%20Rest%20Roof-16289-1-2.zip?fid=58767&ttl=1535781320&ri=8192&rs=8192&setec=4bffe575aa887d6ae79b20bec1e3cf63"
    }
  ]
}