{
  "modId": 16282.0,
  "modName": "Castle Grey",
  "summary": "An enormous castle set high atop a mountain and overlooking the waterfalls and rivers flowing past Dragonbridge.  Castle Grey has been designed to have everything a player could want; spectacular views, a bright sumptious interior and storage in abundance.  ",
  "descriptionHtml": "An enormous castle set high atop a mountain and overlooking the waterfalls and rivers flowing past Dragonbridge.  Castle Grey has been designed to have everything a player could want; spectacular views, a bright sumptious interior and storage in abundance.  \r\n\r\nhttp://www.youtube.com/watch?v=Fr9OcnddHsI   for a great video tour of the castle - thanks insane0hflex for making the video!\r\n\r\nhttp://www.youtube.com/watch?v=GBvNfS0v3mU   Bits \\\"n\\\" Bobs published by Brodual has featured Castle Grey in their Week #7 review at the end of the video.  Thanks Brodual!\r\n[youtube]GBvNfS0v3mU[/youtube]\r\n\r\n-----------------------------------------------------------------------------------------------------------------------\r\nIMPORTANT NOTICE!!!!!!\r\nPlease remove all your books from the bookshelves in the library.  There is a chest you can store them in temporarily.  I will need to rebuild all the bookshelves completely for the next update as I cannot figure out what is causing some of them to delete books.  I am very sorry for the inconvenience.  \r\n\r\n-----------------------------------------------------------------------------------------------------------------------\r\nNOTICE\r\nIf you are experiencing CTD or other problems with Castle Grey please see the TROUBLESHOOTING section below.  If you post that you are having CTD but don\\'t tell me what you have tried to fix it I will not respond to your post.  If you don\\'t know how to download/use files from Nexus please read the Nexus Wiki.  Castle Grey is also on Steam Workshop at http://steamcommunity.com/profiles/76561198054653879/myworkshopfiles?appid=72850\r\n\r\nOn Nexus I have included a folder entitled \\\"GreyFaceFix\\\". Open it and copy the CastleGrey.esp FOLDER inside to Skyrim/Data/Textures/Actors/Character/FaceGenData/FaceTint.  This should get rid of the grey face look on NPCs in the castle.\r\n-----------------------------------------------------------------------------------------------------------------------\r\n\r\nThe castle contains:\r\nArmoury:\r\n\t~~all crafting stations\r\n\t~~24 mannequins\r\n\t~~108 weapon racks\r\n\t~~13 weapon/shield plaques\r\n\t~~11 weapon plaques\r\n\t~~20 chests in the crafting area\r\n\t~~20 dagger displays\r\n\t~~Merchant Kir\\'Tis by the smelter\r\nKitchen:\r\n\t~~4 chests \r\n\t~~multiple barrels\r\nPantry:\r\n\t~multiple barrels and sacks\r\nLibrary:\r\n\t~~bookshelves for 1200 books \r\n\t~~1 chest\r\nMaster Bedroom:\r\n\t~~5 chests\r\n\t~~3 dressers\r\nGuest Bedrooms:\r\n\t~~2 dressers per room\r\nEntryway:\r\n\t~~2 mannequins\r\nBarracks:\r\n\t~~2 guards on the bridge outside that will fight mobs.  They are NOT invincible!\r\nThrone Room/Galleries:\r\n\t~~20 mannequins\r\n\t~~mask busts\r\n                  ~~all shrines\r\n                  ~~all stones\r\nAll chests and containers are set to no-respawn.  I will NOT be changing any of the existing rooms or containers except to fix bugs so you can safely store all your items.\r\n--------------------------------------------------------------------------------------------------------------\r\n\r\nBecause of the size of the castle there are several loading doors to the different areas.  A map marker is southwest of Dragonbridge and does not need discovery.  I have plans to rework the guest bedrooms doors in a future update.  I KNOW they are oversized.  I have many ideas for future content but welcome all suggestions.  The bookshelves in the library are being wonky.  They will store books just fine, but if you enter and exit the bookshelf repeatedly some of them delete books.  Please be assured I will fix them and try to make sure you don\\'t lose any books but I recommend you move all your books to the chest in the library till this is done.  Yes, there are stairs in the pantry that end in a blank wall!  This is for future content.\r\n\r\n---------------------------------------------\r\nUpdate 1.5\r\nAdded a fully enclosed courtyard to the main entrance of the castle.\r\nAdded stables and a blacksmith merchant to the outer bailey.\r\nAdded guards at the gates and front entrance.\r\nFixed multiple wall bugs that were reported.\r\nFixed conflicts with Thieve\\'s Guild quests and Bleakfalls Barrows.\r\nFixed the merchant chest in the armoury.\r\nReplaced the shield in the armoury that kept falling on the floor.  \r\n\r\nUpdate 1.4\r\nAdded a main staircase, throne room and side galleries.  Fully navmeshed.\r\nAdded 20 mannequins to the galleries.\r\nAdded more NPCs to the castle.\r\nGuards patrolling the bridge area are now carry torches.\r\nFixed the pots in the library to be non-collidable.\r\nFixed the lexicon in the library so you cannot pick it up.  (It breaks a quest if you do)\r\n\r\nUpdate 1.3 \r\nAdded a barracks and guards. \r\nAdded walls and a bridge across the river so you can walk/ride to Castle Grey from Dragonbridge now. Guards patrol this area.\r\nPut in an addition to the pool which connects to the lower balcony.\r\nThe barracks lead to the kitchen and the armoury to make it a bit easier to navigate the castle.\r\nThe 2 lower outside doors are now functional.\r\nFixed some lights that were flickering.\r\nNavmesh is done for the kitchen and storeroom.\r\nFixed (I hope)the shield and axe in the armoury that kept falling on the floor.\r\n\r\nUpdate 1.2\r\nFixed mannequin in entryway to activate.\r\nAdded full kitchen space with NPC\\'s and chests for storage.\r\nAdded NPC\\'s to various parts of the castle - will add more as I see how these behave.\r\nAdded merchant NPC Kir\\'Tis to Armoury.\r\n\r\nUpdate 1.1\r\nFixed 2 missing dagger cases in the Armoury.\r\nAdded 4 more weapon/shield plaques in the Armoury.\r\nAdded navmesh to all existing areas of the castle.\r\nChanged mannequins in Entryway to normal interactive mannequins.  (They were supposed to be static, non-interactive wearing full sets of armour but they kept disappearing)\r\n----------------------------------------------------------------------------------------------------------------\r\n\r\n\r\n------TROUBLESHOOTING------ \r\n\r\nIf you are experiencing CTD:\r\nMany times loading a new mod will cause CTD on your first login.  Don\\'t give up.\r\n1. Make a backup file of your saved games (somewhere outside the Skyrim folder).\r\n2. Please make sure you don\\'t have another mod loaded that uses the same worldspace.  Castle Strunmah is built on the same coords and will conflict.\r\n3. Try setting this mod to load first in the list of data files on your launcher page and then load the game from an OLD (not your current save you are playing) clean hard save (not an auto save), fast travel anywhere on the map, walk around for a few seconds, and THEN fast travel to Castle Grey. \r\n4. If none of this works or you get CTD as soon as you try to load any saved game, try to console command into the Castle.  Hit the \\\"~\\\" tilde key and type coc castlegrey then hit enter.  If you load outside the front door of the castle you have a mod that conflicts.\r\n5. Disable all mods but Castle Grey, then add each mod in one at a time after a good login.  At some point you will figure out which mod is conflicting.  I know this is time consuming but it\\'s the only way, sorry.\r\n6. If all this fails you may have corrupted files from the Bethesda 1.5 patch.  Make a backup of your saved games (somewhere outside the Skyrim folder).  Uninstall and reinstall Skyrim.  \r\n\r\nIf followers won\\'t follow:\r\nThis is a known navmesh issue that will have to be fixed with a patch to the Creation Kit by Bethesda.   You will not lose your followers.  Just fast travel anywhere and they will be right by your side!\r\n\r\nIf outside parts of the castle won\\'t load:\r\nThis is also a known issue and needs to be fixed with a patch to the Creation Kit.  You can save your game and relog and this will usually fix the problem.\r\n\r\nAaack, my mannequins are walking!\r\nThis is also a Creation Kit bug.  Walking out a load door and back in usually fixes it.\r\n\r\nThis mod conflicts with other mods:\r\nI have no way to control what other modders do.  If they build a mod and change vanilla asset files their mod may conflict with the game and with other mods.  Nothing I can do. \r\n\r\nKnown conflict:\r\nThis mod conflicts with Castle Strunmah as they both occupy the same worldspace.\r\n\r\nThere are things in the castle you don\\'t like:\r\nThere are console commands that allow you to remove or add anything.  You will have to look up in the Wiki for the exact commands.   \r\n---------------------------------------------------------------------------------------\r\nCastle Grey is the intellectual property of Holth2004.  You may NOT use Castle Grey for anything but your own gameplay.   You may NOT change the name, use any part of the castle or NPCs in it for public use.  You may NOT add your characters, dialogue or anything else to it for public use.  You may NOT make a new mod for public use even if you do not change any part of the castle.  You may NOT redistribute or upload this mod in any form on any site.\r\n---------------------------------------------------------------------------------------\r\nI read all the comments posted even if I don\\'t always respond.  Suggestions for future updates are always welcome although I cannot implement them all.  I am not responsible if a dragon eats your homework!  Please enjoy the castle.\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "68",
  "version": "1.5",
  "author": "Holth2004",
  "createdUnix": "1335912987",
  "updatedUnix": "1337464590",
  "containsAdultContent": false,
  "uploadedBy": "Holth2004",
  "primaryFile": null,
  "files": [
    {
      "fileId": "57988",
      "name": "Castle Grey v1-2",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "276",
      "fileName": "Castle Grey v1-2-16282.zip",
      "uploadedUnix": "1335915818",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/40b673a1db1449c545a97cfe3a16ed20813c4ae6112a2f785aa477b17fc089a9/analysis/1406860143/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Grey%20v1-2-16282.zip?fid=57988&ttl=1535781311&ri=8192&rs=8192&setec=690057edd6a66b827cbb3df8fd0f53bb"
    },
    {
      "fileId": "58203",
      "name": "Castle Grey v1-3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "274",
      "fileName": "Castle Grey v1-3-16282.zip",
      "uploadedUnix": "1335983676",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/2df6eefe6b7104bedae7ad7e865e48478275b798b3c70604f518f15deb428c90/analysis/1406862012/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Grey%20v1-3-16282.zip?fid=58203&ttl=1535781311&ri=8192&rs=8192&setec=732d9984a5e6e1ea73df379a68cf436a"
    },
    {
      "fileId": "59036",
      "name": "Castle Grey v1-4",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "377",
      "fileName": "Castle Grey v1-4-16282.zip",
      "uploadedUnix": "1336257140",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/215290f2383eef9aee193b544c4ac72ea2bb26fb4c112caf729543f956564592/analysis/1406870410/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Grey%20v1-4-16282.zip?fid=59036&ttl=1535781312&ri=8192&rs=8192&setec=1caa6430fcd47e7109a2b00d57067fb6"
    },
    {
      "fileId": "62395",
      "name": "Castle Grey v1-5",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "506",
      "fileName": "Castle Grey v1-5-16282-1-5.zip",
      "uploadedUnix": "1337464590",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/40a892aab3e961a9be58ea718eb30604dc5d66ed72eef0c3486ce6cd44a161fb/analysis/1406903355/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Grey%20v1-5-16282-1-5.zip?fid=62395&ttl=1535781312&ri=8192&rs=8192&setec=96505c9f0cdecde3f15d13affdeab509"
    }
  ]
}