{
  "modId": 16322.0,
  "modName": "Greatsword of Destiny",
  "summary": "Greatsword of Destiny",
  "descriptionHtml": "Included is the esp for both the soulfrost greatsword and the Greatsword of Destiny. This sword is the epic version of the Soulfrost Greatsword which you have to use to create the Greatsword of Destiny. \r\n\r\nThis is the one I promised everyone on Steam I would also post here. You must have both files for it to work and the swords can only be forged in skyforge. If you have the mods to make your game much more challenging and find that you are not pleased with the swords you are using you can use this instead.\r\n\r\nIt is over powered for normal combat from the get go but against the dragons and elite characters from other mods it is great. The soulfrost greatsword is already enchanted when you make it and can\\'t be tempered but now you can use it to make the Greatsword of Destiny which is enchantable and temperable.\r\n\r\nI am happy to give credit to marktrompie01 for bringing this sword to the game.\r\n\r\nLast thought is if anyone could figure out how to make the sword on fire when drawn for combat it would make it really awesome.",
  "categoryId": "55",
  "version": "",
  "author": "marktrompie01 ",
  "createdUnix": "1335976164",
  "updatedUnix": "1335976476",
  "containsAdultContent": false,
  "uploadedBy": "Amarise",
  "primaryFile": null,
  "files": [
    {
      "fileId": "58167",
      "name": "GSDestiny",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6838",
      "fileName": "GSDestiny-16322-1.rar",
      "uploadedUnix": "1335976476",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/c9e202910bf00d873adff7ac867bd332d28d8de6f68e6eed9d064d1d605d12cb/analysis/1406861648/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GSDestiny-16322-1.rar?fid=58167&ttl=1535781385&ri=8192&rs=8192&setec=99c40fc5be4b96bac51fff7a16804407"
    }
  ]
}