{
  "modId": 16343.0,
  "modName": "Bible",
  "summary": "Adds a Christian Bible which gives a new blessing like the shrines in temples and is also portable. With instructions to edit text to whatever you\\'d like it to be.",
  "descriptionHtml": "[font=\\\"Palatino Linotype\\\"]\r\n[color=#FFFF00][size=3][B]DESCRIPTION[/B][/size][/color]\r\n\r\nThis mod adds a Christian Bible to the Temple of the Divines in Solitude (turn left and go upstairs as you enter). Reading the Bible gives you a new blessing (\\\"The Blessing of The Lord\\\") and removes diseases much like the shrines to Mara, Talos etc.\r\n\r\nThe Blessing of The Lord also gives you 10% faster stamina regeneration.\r\n\r\nIF YOU CHOSE TO TAKE THE BIBLE AWAY WITH YOU THEN IN ORDER TO ACTIVATE THE BLESSING IN FUTURE YOU WILL NEED TO READ THE BOOK WHEN IT IS NOT IN YOUR INVENTORY. I.E DROP IT, THEN READ IT AND PICK IT UP AGAIN. \r\n\r\nI had to make at least SOME attempt to make this fit in with the game lore - so The Bible here is presented as the incomplete work of a Breton scholar, who has discovered this ancient and forgotten or little known religion and collected what fragments of it\\'s teachings he could.\r\n\r\nThere are currently 3 Bible quotations in the readable text of the book - ones which seemed appropriate to Skyrim, or I just couldn\\'t resist including. But I am not a religious man of any persuasion and do not claim my choices as representative of the faith. If you would like to edit these to something you prefer then you are more than welcome to edit this mod for yourself. Please do not request that I change the verses for you (unless I\\'ve made any spelling errors etc).\r\n\r\nSimply:\r\n\r\n- Open the creation kit\r\n- File/Data\r\n- In the new window double-click \\\"Skyrim.esm\\\" then \\\"Bible.esp\\\". Click \\\"set as active file\\\" then \\\"ok\\\"\r\n- Wait AGES for everything to load\r\n- In the Object Window where it says \\\"filter\\\" type \\\"bible\\\", and scroll that window down to the bottom and click on \\\"*All\\\"\r\n- Double click on \\\"SJOGBible\\\" on the right hand side of the Object window\r\n- Type whatever you want the text to be in the big \\\"Book Text\\\" window (see the pictures if you\\'re lost I\\'ve done a screengrab)\r\n- Click Ok when you\\'re done and save.\r\n\r\nAs far as I am aware the current quotations are from KJV.\r\n\r\n(Made by request for MagnetDrake)\r\n\r\n\r\n\r\n\r\n[color=#FFFF00][size=3][B]INSTALL[/B][/size][/color]\r\n\r\nEither use Nexus Mod Manager or download the zip file manually and extract all of its contents to the Skyrim \\\"Data\\\" directory.\r\n\r\n\r\n\r\n\r\n[color=#FFFF00][size=3][B]KNOWN ISSUES[/B][/size][/color]\r\n\r\nDoes not display correct texture in inventory view.[/font]",
  "categoryId": "40",
  "version": "v1.0",
  "author": "Tetradite",
  "createdUnix": "1335998435",
  "updatedUnix": "1335998568",
  "containsAdultContent": false,
  "uploadedBy": "tetradite",
  "primaryFile": null,
  "files": [
    {
      "fileId": "58243",
      "name": "Bible v1-0",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "114",
      "fileName": "Bible v1-0-16343-v1-0.7z",
      "uploadedUnix": "1335998568",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/275319ff803443074d160e5d3082d15e9567be1cb5c826d57d16bbc8f783817c/analysis/1406862564/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bible%20v1-0-16343-v1-0.7z?fid=58243&ttl=1535781421&ri=8192&rs=8192&setec=4a9a9ed52ebe6b65020036a3638837da"
    }
  ]
}