{
  "modId": 16389.0,
  "modName": "Lupin Tower",
  "summary": "This is a very large player home with a tower and some underground levels.  It is located high on top of a mountain just east of Markarth.  It is a very lushly decorated home with all the crafting stations, storage, and displays anyone could wish for.  Spouse and Follower friendly.\r\n",
  "descriptionHtml": "This is a very large player home with a tower and some underground levels.  It is located high on top of a mountain just east of Markarth.\r\n\r\nThis home is completely navmeshed and compatible with followers and spouses.  If you have trouble with the external tower and other graphics not appearing on the mountain (including parts of the mountain itself), just fast travel to and from Lupin House a couple of times and they will finally appear.  This is a bug within the Creation Kit (thanks Bethesda).\r\n\r\nThis home is lavish and expansive and includes:  \r\n\r\n    * All crafting, smithing, enchanting and alchemy stations and equipment\r\n    * A garden pool room for relaxing with shrines, fireflies and butterflies\r\n    * An underground mushroom garden leading to...\r\n    * An underground pool/spa area\r\n    * A complete tower level for displays with 27 manekins and 65 weapon racks\r\n    * Large dining hall with mounted displays and fireplace and a secret door leading to...\r\n    * Dwemer elevator down to the basement/dungeon\r\n    * A basement/dungeon for whatever nefarious deeds or storage\r\n    * A large bedroom with entry hall, library area, fireplace, and mounted animal displays\r\n    * A posh bathroom with 2-person hot-tub/bathtub.  Your follower/spouse and yourself can sit inside\r\n    * Tower top access with table and chairs for enjoying the view\r\n    * Several dragon statues, mounted animals and mechanicals\r\n\r\nPlease don\\'t touch the skeletons in the dungeon or they will crumble into a pile (unless you want them that way - they\\'re just previous tenants).  I couldn\\'t find a way to fix this.  I have kept navmeshes away from them so followers won\\'t accidentally bump them.  They can very well fall to bits all on their own.  (sorry)\r\n\r\nIf you don\\'t like the idea of having a giant werewolf statue (or other things) in the dungeon, you can remove them with the console.  The house was made for my character, Lupin, who is a werewolf.\r\n\r\nINSTALLATION:  Copy the LupinHouse DD.esp file and the Meshes folder to your Skyrim Data folder.  Place a checkmark to activate the mod in either your mod manager or Skyrim game.\r\n\r\nThere is an optional folder included for replacing the texture of all manekins in the game with a more friendly woodgrain texture instead of the dark, scary, dirty looking original texture.  Use it or not as you wish.  To use just move the textures folder inside to your Skyrim Data folder.\r\n\r\nMOD REMOVAL:  Make sure all characters and possessions are removed from the house and make saves with them safely away and off the mountain.  Uncheck the boxes in the game menu or your mod manager and/or delete the mod.\r\n\r\nAt this time I don\\'t know of any mods which conflict with this one.  There are no scripting changes anywhere.\r\n\r\n\\\"Spouses Can Live Everywhere\\\" (spousetocustomhome.esp) mod by Amgepo and Emma works well here.\r\n\r\nIn my game I am using horrorview\\'s mod \\\"Sexy Winterhold College\\\" ---- so the photos I\\'ve posted  have textures from that mod on the tower architecture.  Yours may differ slightly if you don\\'t use the mod, but it\\'s not important.  It is a nice mod though.\r\n\r\nLupin\\'s House is finished and will not be updated or changed unless there are gross errors or conflicts.  So please don\\'t ask for more stuff.\r\n\r\n\r\nPlease do not upload this mod elsewhere without permission.  Feel free to mod this mod for yourself if you want to make changes, but do not upload the modded mod or parts of the mod either.  Thanks.\r\n\r\nIf anyone wants to translate this mod into their language and post it here, that is fine with me.  Please do not post it on the Steam site.\r\n\r\nIf you like it, please endorse it!\r\n\r\nWheeter\r\n\r\n",
  "categoryId": "68",
  "version": "1.0",
  "author": "Wheeter",
  "createdUnix": "1336092379",
  "updatedUnix": "1336092493",
  "containsAdultContent": false,
  "uploadedBy": "wheeter",
  "primaryFile": null,
  "files": [
    {
      "fileId": "58467",
      "name": "Lupin Tower",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1991",
      "fileName": "Lupin Tower-16389-1-0.zip",
      "uploadedUnix": "1336092493",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/98e77c685f9e071389c34bbe2e7d958c2f4656fe11c97169269e35faf21bf1cb/analysis/1406864465/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lupin%20Tower-16389-1-0.zip?fid=58467&ttl=1535781501&ri=8192&rs=8192&setec=ffc123555b3b74937489b7bf3ee6cb5c"
    }
  ]
}