{
  "modId": 16411.0,
  "modName": "Skyrim Monster Mod Replacers - Lore Friendly and Others",
  "summary": "This add-on to Skyrim Monster Mod removes some of the lore-unfriendly creatures from the Skyrim Monster Mod levelled lists.  Now also available as a strictly purist lore-friendly version.\r<br />",
  "descriptionHtml": "[img]http://static-3.nexusmods.com/15/mods/110/images/16411-1-1401278926.jpg[/img]\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/16411-2-1401278926.jpg[/img]\r<br />-----------------------------------------------------------------------------------------------\r<br />UPDATE: Skyrim Monster Mod is now available again from [url=http://skyrim.nexusmods.com/mods/35631]http://skyrim.nexusmods.com/mods/35631[/url].  These replacers have not yet been updated and checked for compatibility - I&#39;ve had reports that the replacers work fine with the latest version of the main mod - but to be on the safe side, if you&#39;re already using v12 alongside my replacers, don&#39;t update to Reborn v1.1 until I&#39;m able to get a new replacer out.\r<br />This mod REQUIRES Skyrim Monster Mod v10 or v12 and will not work without it.  NOTE:  The master mod is currently unavailable from the Nexus.  Due to Nexus policy (the author of the original mod has been banned) it is not permitted to provide a link to where the mod can now be found - but it is easy enough to find by searching elsewhere online.  These replacers are intended for those people who have already downloaded the main file.\r<br />\r<br />[youtube]v_nFlgeggC8#t=0m42s[/youtube]\r<br />Skip to 40 seconds on the above video for the relevant info, or click [url=http://www.youtube.com/watch?feature=player_embedded&v=v_nFlgeggC8#t=0m42s]here[/url] to play full-screen.\r<br />(This is a very old video, but does a great job of introducing the mod).\r<br />\r<br />\r<br />If currently using an earlier version of Lore-Friendly - You must deactivate &#34;SkyMoDawn.esp&#34; and &#34;SkyMoMod_lists.esp&#34; if you have either active.  I will not be using the skymomod_lists name any longer, and each file will have its own name for the sake of clarity.  \r<br />\r<br />If currently using Lore-Friendly v10 - make sure you deactivate the v10 replacer esp before activating the new one.  \r<br />\r<br />You will still not be able to run multiple replacers at the same time - if you have more than one activated, whichever loads latest will be the changes you see in your game.\r<br />\r<br />Wrye Bash users only:  If using a bashed patch you may want to remove the tags from the original SkyMoMod.esm or remove it from merging leveled lists manually otherwise the removed creatures may still be merged into your bashed patch.  Whichever replacer you use from here should be tagged/merged delev.\r<br />\r<br />-----------------------------------------------------------------------------------------------\r<br />\r<br />This mod is compatible with the vast majority of mods that do not edit default leveled lists.  \r<br />It is not compatible with Monster Wars, Monster Mod Additions/New Items/Conjurations, and is not likely to be compatible with any other variant of Skyrim Monster Mod as they add creatures and ingredients deleted by these replacers back into the game.  If you have any other mod that edits default lists, then unless you use Wrye Bash to merge the lists, you would see creatures/items from whichever mod is later in your load order.\r<br />\r<br />[color=red]IMPORTANT: If updating from default Skyrim Monster Mod, or an earlier version of these replacers, you MUST go to a safe interior location with no creatures before activating this mod.  When inside this safe location you MUST wait for 31 days to allow the creatures outside to depopulate/despawn and allow the replacer to make the necessary removals without crashing your game.  (Press the wait key - usually &#34;T&#34; to do this.)  After waiting, save your game.  Quit Skyrim, activate the replacer, and load your save game.  You may want to wait further to allow the lists to repopulate with the new creatures.  It is now safe to go outside and enjoy the new creatures&#33;[/color]\r<br />\r<br />Two main versions available - Purist Lore-Friendly (a very strict version), and Standard Lore-Friendly (friendlier than normal SkyMoMod, but not as strictly lore-friendly as the purist version).  \r<br />\r<br />Details of standard version first - if you&#39;re more strict about lore please scroll down to (2) for details of purist lore-friendly version.    \r<br />\r<br />Alternative versions if your&#39;re not fussed abut lore but just want to remove just Triceratops, just Witcher creatures, or just Dragons, are in the files section - along with a range of other files.\r<br />\r<br />--------------------------------------------------------------------------------------------------------\r<br />\r<br />(1) STANDARD LORE-FRIENDLY VERSION v12.1\r<br />\r<br />--------------------------------------------------------------------------------------------------------\r<br />\r<br />INSTALLATION\r<br />-------------------\r<br />\r<br />Install manually or via NMM.\r<br />IMPORTANT: Before activating the mod, go to a safe interior location (such as an inn or player house).  If you are already using any version of SkyMoMod, wait for 31 days inside that safe interior location in order to allow the cells outside to despawn any creatures that may be removed/edited by this replacer.  Save your game, quit and activate the replacer, and load your save game.  Once you have done this (or if you have not been using any version of SkyMoMod before), you may want to wait 31 days further to allow the lists to repopulate with the creatures from this replacer.\r<br />\r<br />------------\r<br />\r<br />NEW IN v12.1 - \r<br />\r<br />- Dwarven Mech Spiders removed from Spider faction, added to Dwarven Automaton faction to help prevent in-fighting.\r<br />- Dwarven Spiders removed from creature faction (kept in Dwarven Automaton faction).\r<br />- Low-level Dwarven Mech Spiders removed Centurion death items (which could include grand soul gems - overpowered loot at low levels) and given Dwarven Spider loot.\r<br />- Low-level Steel Centurions removed Centurion death items and given Dwarven Sphere loot.\r<br />- Higher-level Dremora Mistresses given appropriate perks to match male equivalents. \r<br />\r<br />\r<br />\r<br />NEW IN v12.0 -\r<br />\r<br />*NEW* Creatures added - Giant insects (giant ant, giant scorpion, giant insect).  Giant Scorpion previously seen in Daggerfall.\r<br />*NEW* Creature added - Black Reach Creeper - renamed as &#34;Mutated Falmer Beast&#34;\r<br />*NEW* Creature added - Draugr Warrior - renamed as Undead Warrior\r<br />*NEW* Creature added - Necromancer - renamed as Lich\r<br />*NEW* Creatures added - new skeletons, draugr\r<br />*NEW* Creatures removed from v12: Raven, Raven Elder - due to queries over assets used in the main mod.\r<br />*NEW* Creature removed from v12: Daedroth (short-headed version).  Traditional daedroth still remains in the game.\r<br />*NEW* Weapons added - Daedric Sword renamed as Ancient Nord Sword.\r<br />\r<br />\r<br />The following creatures which are most out of place in Elder Scrolls lore have been removed from the Monster Mod:\r<br />Triceratops\r<br />Mammoth Young (as it is bald - a baby Elephant rather than Mammoth)\r<br />Abomination\r<br />Nekker\r<br />Giant Cyclops\r<br />Draco Griffon\r<br />Parasite\r<br />Cyclops\r<br />Therium\r<br />Elemental\r<br />Cave Lurk\r<br />Creeper\r<br />Dragon Spawn\r<br />\r<br />Other creatures have been renamed or edited as follows to make lore-friendlier :\r<br />\r<br />General behaviour tweaks.\r<br />Adjustments to lists - Daedra (daedroth, hunger, winged twilight, morphoid) now removed from werewolf and several outdoor lists (it doesn&#39;t make sense for so many daedra to be loose outside). Added to atronach and dremora lists. You should now see daedra in more plausible locations than versions prior to v9. Greater Bonewalkers removed from outdoors lists (they should be haunting tombs) and added to draugr lists.\r<br />\r<br />\r<br />Carrion Roach - made slightly smaller (0.25 rather than 0.4) to improve perceived quality of mesh/texture.\r<br />\r<br />Ice Witch - renamed as Fryse Hag (as in Morrowind: Bloodmoon). For information about the witches and hagravens of Skyrim, I have added a new book in-game called &#34;Hagravens of Skyrim&#34; (added to book lists, so will appear on traders/bookshelves). Removed 2 of her 3 staffs. Allowed male characters to wear the skimpy armor (was otherwise inexplicably replaced by steel armor in original SkyMoMod) but beware you will also grow breasts and lose a little weight&#33;\r<br />\r<br />Draco Dragon - renamed as Dragonling. For information about dragonlings, their relationship to true dragons and an explanation of their appearance, I have added a new book called &#34;Dragonlings of Tamriel&#34; (added to book lists). Slowed to 60% speed.\r<br />\r<br />Shark - The default SkyMoMod shark tends to headbutt the player and do no damage. This version makes sharks swim away from the player. Sharks in cold climes are small, and generally more afraid of people than larger sharks in tropical regions.\r<br />\r<br />Hunger - Removed from Werewolf faction and added to Daedra faction. Boosted magicka, given special Paralysis attack to match ability in Oblivion: Shivering Isles (now working correctly - was not set up correctly prior to v9). Added Daedra heart death item. Also added drain stamina disease (to match drain fatigue in Morrowind) to add more of a challenge - it drains all stamina, so used ranged combat, be quick, or carry plenty of cure disease potions. Resized slightly.\r<br />\r<br />Snow Devil - added back to the lore-friendly replacer, renamed as Kamal Snow Demon. These are creatures referred to in lore books, but never seen in-game. &#34;Kamal&#34; means &#34;Snow Hell&#34;. This could be an actual Kamal Snow Demon, or another creature (variant were-animal) mistaken for one but still named it by the people of Skyrim. I have added a new book in-game (written in-character as always, and available in book lists) to explain this.\r<br />\r<br />Dagon - renamed as Descended Sleeper (Ascended Sleepers were seen in Morrowind, they have devolved over the years). Added shock spells. Dagon Tentacles death item renamed as Sleeper Tentacles, removed from vendoritem food and added to vendoritem ingredient, and added alchemy effect.\r<br />\r<br />Balrog - renamed as Daggerfall Gargoyle (very similar in looks to Gargoyle in Daggerfall, and renamed for this version due to the Gargoyle added in Dawnguard - the two species may or may not be related) - Resized to 0.6. Removed atronach loot/death items. Enabled large sword carried by gargoyle as playable, but increased weight to over 100 to compensate for the increased damage caused by the sword.\r<br />\r<br />Dark Raven - renamed as Hagraven, as appears to be a tiny version of a hagraven. Increased to normal size.\r<br />\r<br />Dwemer Mech Spider - renamed as Dwemer Spider.\r<br />\r<br />Black Widow - renamed as Spider. Removed Frostbite death item as is not a Frostbite Spider&#33; Made slightly smaller (0.8) to improve perceived quality of mesh/texture.\r<br />\r<br />Ghost Wolf - renamed as Spectral Wolf (in honour of Oscuro&#39;s Oblivion Overhaul). Removed wolf loot (you can&#39;t get a pelt from a ghost&#33;), added ghost loot.\r<br />\r<br />Reaper Spirit - renamed as Winged Gloom Wraith, removed wisp volley spell and increased magicka, added frost cloak & icy spear spells. Removed Wisp death items and given ghost death items.\r<br />\r<br />Necro Mage - renamed as Flesh Atronach, as looks just like the Flesh Atronachs from Oblivion. Added to Daedra faction and added void salts loot. Previous versions prior to v9 would not attack correctly - this has now been corrected, and they now use hand-to-hand attacks as expected.\r<br />\r<br />Wild Cat - made cowardly and unagressive, helps nobody (well it is a cat&#33;), removed aggro radius. Resized to 0.75 as quality of mesh/texture appears better when smaller. Now correctly runs away - in versions prior to v9 he just stood there looking confused.\r<br />\r<br />Living Flame - renamed as Fire Atronach.\r<br />\r<br />Black Hills Goblin - renamed as Goblin.\r<br />\r<br />Wraith (Grim Reaper version) - renamed as Gloom Wraith.\r<br />\r<br />Raptor - renamed as Feral Lizard Man Brawler (Lizard Men were in Arena - unrelated to Argonians these are feral and primitive beasts).\r<br />\r<br />Daedric Prince (Baphomet) - renamed as Daedra Knight. Removed from vampire faction & added to Daedra faction.\r<br />\r<br />Vampire Priestess (Lilith) - renamed as Ascended Vampire Ancient (as in previous games).\r<br />\r<br />Dragon Daedroth (Dragon Man) - renamed as Blood Daedroth.\r<br />\r<br />Rot Fiend - renamed as Greater Bonewalker (as in Morrowind). Removed draugr axe weapon and slowed to 25% speed to give shambling undead appearance. Given bone meal death item, absorb spells, resist frost/fire, and ability to give brain rot disease (as close to Morrowind as possible).\r<br />\r<br />Drowner - renamed as Ghoul (as in Arena).\r<br />\r<br />Death Naga and Ice Naga - renamed as Serpent Wraith.\r<br />\r<br />Treant - renamed as Spriggan Patriarch. Given Spriggan sounds & death items.\r<br />\r<br />Tree Spirit - renamed as Ethereal Spriggan.\r<br />\r<br />Sea Dragon and Sea Drake - renamed as Sjoorm. Removed dragon loot as these are not technically dragons.\r<br />\r<br />River Naga - renamed as Lesser Sjoorm.\r<br />\r<br />Glass Atronach - renamed as Glass Golem (Golems were in Arena/Daggerfall as mage constructs).\r<br />\r<br />Harpy 1 - renamed as Winged twilight (from Morrowind), removed from hagraven faction and added to daedra faction. Optional retexture to purple as in Morrowind in texture folder. Added void salts and daedra heart. Removed spells.\r<br />\r<br />Harpy 2 (bird-like version) - renamed as Transformed Hagraven.\r<br />\r<br />Undead Raven - renamed as Corrupted Hag, as looks like partially-tranformed Hagraven with something gone wrong in the transformation process. Removed Falmer weapons and sounds and given Hagraven sounds.\r<br />\r<br />Drake - renamed as Dragonling (Dragonlings refer to all overgrown lizards - first seen in Daggerfall).\r<br />\r<br />Death Golem - renamed as Iron Golem (as seen in Arena). Removed random loot, and give iron loot to match his appearance; iron ingots, 3 woodcutter&#39;s axes to resemble his hands, and iron cuirass. Removed centurion steam breath spell.\r<br />\r<br />Bone Horror - renamed as Spider Shambles (Shambles is a form of mismatched skeletons, first seen in Shivering Isles.) Resized to be human bones size, and given human skull and bonemeal loot.\r<br />\r<br />Bullvore - renamed as Ogrim.\r<br />\r<br />Witch - renamed as Hag. Appears to be in an early stage of Hagravren transformation, or could simply be a variant Fryse Hag (from Bloodmoon).\r<br />\r<br />Arachas - resized to be smaller, renamed as Chaurus Spider.\r<br />\r<br />Troll Bones - renamed as Troll Skeleton.\r<br />\r<br />Poison Shade - renamed as Wraith. Added ectoplasm death item.\r<br />\r<br />Werebear - changed to bear sounds (was Sabrecat in original SkyMoMod). Added bear death items.\r<br />\r<br />Spider Daedra - renamed to Daedra Spiderling (as in Oblivion). Resized to be smaller, as the mesh looks more detailed and the positioning of the human face works better when resized to be a small Spiderling.\r<br />\r<br />Shade Atronach - renamed as Thunderstorm Atronach as looks and behaves like a dark thundercloud variant of a Storm Atronach.\r<br />\r<br />Spirit Atronach - renamed as Lesser Frost Atronach as looks more like an icy version of the flame atronach. Removed ectoplasm & shock spell, and given Ice Spike spell and Frost Atronach death items and sounds instead.\r<br />\r<br />Dark Spirit - renamed Blood Skeleton, removed ghost loot and added skeleton loot. Optional retexture - removed bright blue and retextured to be dark and bloody.\r<br />\r<br />Zombie - renamed as Corrupted Dragon Priest Acolyte as looks & behaves like a mutated Dragon Priest. Added dragon priest death items.\r<br />\r<br />Scamp - resized to 0.75, removed from Falmer faction and added to Daedra faction. Removed falmer weapons & falmer poison perk. Changed combat style for some varieties to prefer magic, boosted magicka and made to use magic fire attacks. Removed Falmer death items and added Daedra heart.\r<br />\r<br />Flesh Golem - renamed as Zombie.\r<br />\r<br />Arch Daemon - renamed as Morphoid Daedra, as has similarities in looks to the Morphoid Daedra in Battlespire. Given Daedra heart death item.\r<br />\r<br />Ogre - removed weapon loot drops, added gold and gems loot drops instead to match typical Oblivion Ogre loot. Removed from Werewolf faction and added Troll sounds.\r<br />\r<br />Feral Afflicted - renamed as Peryite&#39;s Afflicted. Speed slowed to 30%.\r<br />\r<br />Hell Hound - removed Vampire death items.\r<br />\r<br />Wraith (Grim Reaper version) - renamed as Reaper. We now precedence for this name in lore with the Reaper as featured in Dawnguard.\r<br />\r<br />Vampire Lich - renamed as Ascended Vampire Ancient. Removed dragon priest loot and faction, and added vampire loot and faction. Given vampire drain spells and vampire diseases.\r<br />\r<br />Vampire Priest - renamed as Dragon Priest Guard. Removed from Vampire lists and added to Draugr Boss lists.\r<br />\r<br />\r<br />\r<br />All other creatures added by SkyMoMod and not mentioned above are still in the game - they have not been removed or edited in any way.\r<br />\r<br />\r<br />\r<br />\r<br />Loot changes: Drakes and Sjoormen removed dragon death items (dragon bones and scales) as they are not technically dragons, and dragon loot is overpowered for them.\r<br />\r<br />Machette - renamed as Machete (the correct spelling).\r<br />\r<br />Ripper - renamed Wraith Sword.\r<br />\r<br />Vampiric Staff - renamed as Staff of Ice Shard as not always carried by a vampire, and casts Ice Spike spell&#33;\r<br />\r<br />Draugr Bloody Axe - renamed as Bloody Axe, as not always carried by Draugr. Allowed to drop as loot from all carriers.\r<br />\r<br />Daedric Sword - renamed as Ancient Nord Sword.\r<br />\r<br />\r<br />\r<br />---\r<br />\r<br />INSTALLATION -  Install Skyrim Monster Mod first from http://skyrim.nexusmods.com/downloads/file.php?id=9694 (NO LONGER AVAILABLE), then COPY ESP TO SKYRIM/DATA FOLDER.\r<br />\r<br />\r<br />\r<br />\r<br />-------------------------------------------------------------------------\r<br />\r<br />(2) PURIST LORE-FRIENDLY v10 for Skyrim Monster Mod v10\r<br />\r<br />--------------------------------------------------------------------------\r<br />\r<br />This is the same as the Standard Lore-Friendly, but with additional creatures removed.\r<br />\r<br />UPDATED TO v.12.2 - NOW COMPATIBLE WITH MONSTER MOD v12.\r<br />\r<br />*NEW* Creatures added - Giant insects (giant ant, giant scorpion, giant insect).  Giant Scorpion previously seen in Daggerfall.  Precedence for many types of large insects in lore.\r<br />*NEW* Creature removed from main v12 file - Black Reach Creeper.\r<br />*NEW* Creature added - Draugr Warrior - renamed as Undead Warrior\r<br />*NEW* Creature added - Necromancer - renamed as Lich\r<br />*NEW* Creature added - Gar - looks like a variant species of unspecified Slaughterfish so renamed as Slaughterfish.\r<br />*NEW* Creatures added - new skeletons, draugr\r<br />*NEW* Creature name change - Dremora Mistresses, previously renamed as Dremora Markynaz are now renamed to generic &#34;Dremora&#34; as are leveled and of unspecified rank.  Daedra are equal opportunities employers, no need to specify that are are female in the name&#33; :-)\r<br />*NEW* Creatures removed from v12: Raven, Raven Elder - due to queries over assets used in the main mod.\r<br />*NEW* Creature removed from v12: Daedroth (short-headed version - does not look like a daedroth).  Traditional daedroth still remains in the game.\r<br />*NEW* Weapons added - Daedric Sword renamed as Ancient Nord Sword.\r<br />*NEW* Dwarven Mech Spiders removed from Spider faction, added to Dwarven Automaton faction to help prevent in-fighting.\r<br />*NEW* Dwarven Spiders removed from creature faction (kept in Dwarven Automaton faction).\r<br />*NEW* Low-level Dwarven Mech Spiders removed Centurion death items (which could include grand soul gems - overpowered loot at low levels) and given Dwarven Spider loot.\r<br />*NEW* Low-level Steel Centurions removed Centurion death items and given Dwarven Sphere loot.\r<br />*NEW* Higher-level female Dremora given appropriate perks to match male equivalents. \r<br />\r<br />\r<br />\r<br />Changelog v10:\r<br />Creatures in v10: Warrior Giant (originally named Giant Ogre), Raven, Raven Elder.\r<br />Hagravens book updated to explain new Raven and Elder Raven.\r<br />Factions adjusted for dwemer constructs - should no longer keep fighting each other.\r<br />Hell Hound removed from wolf lists and added to Atronach, Conjurer and Undead lists.\r<br />Cleaned in TES5Edit\r<br />\r<br />The following creatures have been removed from the Monster Mod:\r<br />\r<br />Draco Dragonling\r<br />Dark Falmer/Dark Falmer Beasts\r<br />Glass Atronach\r<br />Shade Atronach\r<br />Bullvore/Ogrim\r<br />Cyclops\r<br />Abomination\r<br />Dagon/Sleeper\r<br />Death Naga\r<br />Daedric Prince (Baphomet)\r<br />Dragon Daedroth (Dragonman)\r<br />Werecat\r<br />Drakes\r<br />Alpha Drake\r<br />Drowner/Ghoul\r<br />Mammoth Young (Baby Elephant)\r<br />Fire Giant\r<br />Fire Wraith\r<br />Gargoyle\r<br />Ice Giant\r<br />Giant Cyclops\r<br />Draco Griffon\r<br />Hyena\r<br />Ice Naga\r<br />Treant/Patriarch\r<br />Parasite\r<br />Raptor\r<br />River Naga/Sjoorm\r<br />Nekker\r<br />Wild Cat\r<br />Sea Dragon\r<br />Sea Drake\r<br />Poison Shade\r<br />Arachas\r<br />Snow Devil\r<br />Tree Spirit\r<br />Triceratops\r<br />Elemental\r<br />Bone Horror\r<br />Therium\r<br />*NEW* Giant Brute removed\r<br />\r<br />Also removed: New books (&#34;Dragonlings of Tamriel&#34; and &#34;Snow Demons&#34;).\r<br />\r<br />New change from v8 - Spirit Atronach (edited to be Lesser Frost Atronach) now added back to purist version.\r<br />\r<br />Other creatures renamed as in the standard lore-friendly replacer (see the above info on standard replacer for details).\r<br />\r<br />Other amendments from Standard:\r<br />Dremora Mistress - renamed as Dremora Markynaz (in Oblivion the only female dremora were at Markynaz rank.)\r<br />\r<br />\r<br />Other creatures remaining in the purist replacer include all variations of:\r<br />Daedroth (now called Daedroth, not Werecrocodile. Dragon Daedroth has been removed.)\r<br />Durzog (there were Durzogs in Tribunal)\r<br />Guar (there were Guars in Morrowind)\r<br />Ogre (there were Ogres in Oblivion)\r<br />Giant Boar (there were boars in Oblivion, and tusked bristlebacks in Bloodmoon)\r<br />New Animals (bears, wolves, skeevers)\r<br />New Dwarven Constructions (Dwarven Guardians, Dwarven Spiders)\r<br />New Falmer variants, but not Dark Falmer (I would argue that they represent the fallen Snow Elves in various stages of devolution)\r<br />New Giants (other than Fire and Ice Giant which have been removed)\r<br />New Mudcrabs\r<br />New Dragons\r<br />New Draugr\r<br />New Skeletons\r<br />New Spriggans\r<br />New Trolls\r<br />New Werewolves\r<br />\r<br />----------------------------------------------------------------\r<br />----------------------------------------------------------------\r<br />\r<br />Spawn locations haven&#39;t been amended as yet, but there shouldn&#39;t be anything too much out-of-place.  Please give feedback on this for future versions.\r<br />\r<br />Installation: Install Skyrim Monster Mod first from http://skyrim.nexusmods.com/downloads/file.php?id=9694 and select the replacer you want.  Only one replacer will work - if you use multiple replacers, you will only see the changes from the one that loads later in your modlist.\r<br />\r<br />Traduction Française par Deldwath: http://skyrim.nexusmods.com/downloads/file.php?id=16633\r<br />\r<br />All credits go to Dogtown1 for Skyrim Monster Mod and the original creators of the creatures as credited in the Skyrim Monster Mod readme.\r<br />\r<br />\r<br />Disclaimer: I haven&#39;t tested this very thoroughly, and there may be errors and/or lore unfriendly creatures that I haven&#39;t yet removed. If you find any errors or see any creatures that you believe should be removed, please let me know and I&#39;ll have a look when I next update. \r<br />\r<br />\r<br />\r<br />",
  "categoryId": "83",
  "version": "12.2",
  "author": "jackstarr",
  "createdUnix": "1336125141",
  "updatedUnix": "1360071103",
  "containsAdultContent": false,
  "uploadedBy": "jackstarr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103319",
      "name": "Skyrim Monster Mod Lore-Friendly Standard v10",
      "version": "10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "32",
      "fileName": "-Skyrim Monster Mod Lore-Friendly Standard v10-16411-10.zip",
      "uploadedUnix": "1354701415",
      "modVersion": "10",
      "virusScanUrl": "https://www.virustotal.com/file/e02e55b75582dcc9be181babdad19889b2f0e41f9e2bf35ab0d42765d68adb7f/analysis/1407291964/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/-Skyrim%20Monster%20Mod%20Lore-Friendly%20Standard%20v10-16411-10.zip?fid=103319&ttl=1535781562&ri=8192&rs=8192&setec=bd9eed103017655107d90147b642a0cd"
    },
    {
      "fileId": "103324",
      "name": "Skyrim Monster Mod - Lore-Friendly Standard but with added Cyclops v10",
      "version": "10",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "31",
      "fileName": "Skyrim Monster Mod - Lore-Friendly Standard but with added Cyclops v10-16411-10.zip",
      "uploadedUnix": "1354702461",
      "modVersion": "10",
      "virusScanUrl": "https://www.virustotal.com/file/aef6fa1e9f908e2d9ec5609ab7945989775c19626a91d40ce195a731d0fe4a81/analysis/1407292033/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Monster%20Mod%20-%20Lore-Friendly%20Standard%20but%20with%20added%20Cyclops%20v10-16411-10.zip?fid=103324&ttl=1535781562&ri=8192&rs=8192&setec=905cfb5dd6c1ee7d9f75f993b2aa91b5"
    },
    {
      "fileId": "104560",
      "name": "Skyrim Monster Mod Standard Lore-Friendly v9",
      "version": "9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35",
      "fileName": "Skyrim Monster Mod Standard Lore-Friendly v9-16411-9.zip",
      "uploadedUnix": "1355213377",
      "modVersion": "9",
      "virusScanUrl": "https://www.virustotal.com/file/7ce2280559a02ba74e72075035ae1d1ca54da356fb2913b1ac173cbb827c3b66/analysis/1407299582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Monster%20Mod%20Standard%20Lore-Friendly%20v9-16411-9.zip?fid=104560&ttl=1535781563&ri=8192&rs=8192&setec=b9bf4637d5339d8af945d596a13bed2d"
    },
    {
      "fileId": "104561",
      "name": "Skyrim Monster Mod Purist Lore-Friendly v9",
      "version": "9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "34",
      "fileName": "Skyrim Monster Mod Purist Lore-Friendly v9-16411-9.zip",
      "uploadedUnix": "1355213482",
      "modVersion": "9",
      "virusScanUrl": "https://www.virustotal.com/file/243b362c54b25a0d7dfbd1dd7e78e59a0b8609b6757263c6d43344f01706fde2/analysis/1407299582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Monster%20Mod%20Purist%20Lore-Friendly%20v9-16411-9.zip?fid=104561&ttl=1535781563&ri=8192&rs=8192&setec=69fb7a5fa91717177ed19e37dc4fd6ce"
    },
    {
      "fileId": "1000002718",
      "name": "Skyrim Monster Mod Lore-Friendly Standard v12",
      "version": "12",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "38",
      "fileName": "Skyrim Monster Mod Lore-Friendly Standard v12-16411-12.zip",
      "uploadedUnix": "1358338377",
      "modVersion": "12",
      "virusScanUrl": "https://www.virustotal.com/file/671761692a5cd33a20fed69e9ff5b8bae6fc4437e7d4c1376067ea4321f3ab3e/analysis/1407356343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Monster%20Mod%20Lore-Friendly%20Standard%20v12-16411-12.zip?fid=1000002718&ttl=1535781564&ri=8192&rs=8192&setec=197c444c4ea2a9265c579722af2a00aa"
    },
    {
      "fileId": "1000005002",
      "name": "Auto Repair and Auto Recharge Ring_v2_90",
      "version": "2.90",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "42",
      "fileName": "Skyrim Monster Mod Lore-Friendly Standard v12-1-16411-12-1.zip",
      "uploadedUnix": "1359217551",
      "modVersion": "2.90",
      "virusScanUrl": "https://www.virustotal.com/file/2512cd4a26f15c844b0fb6b688946883ec619e81df110eb11cabdd20ef014e6f/analysis/1407380101/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Monster%20Mod%20Lore-Friendly%20Standard%20v12-1-16411-12-1.zip?fid=1000005002&ttl=1535781565&ri=8192&rs=8192&setec=552a727fcb351325d93d8f41bd4fc17a"
    },
    {
      "fileId": "1000005496",
      "name": "Skyrim Monster Mod Lore-Friendly Purist - v12-2",
      "version": "12.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "36",
      "fileName": "Skyrim Monster Mod Lore-Friendly Purist - v12-2-16411-12-2.zip",
      "uploadedUnix": "1359383104",
      "modVersion": "12.2",
      "virusScanUrl": "https://www.virustotal.com/file/d5a50477fbe804c9d935cb6c1e452d040f33d6ec54a5fb4a9db7b235cafc6567/analysis/1407383831/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Monster%20Mod%20Lore-Friendly%20Purist%20-%20v12-2-16411-12-2.zip?fid=1000005496&ttl=1535781565&ri=8192&rs=8192&setec=22828158a9a9cd183c88c81ec483eaf3"
    },
    {
      "fileId": "1000007256",
      "name": "Skyrim Monster Mod Lore-Friendly Standard v12-1 with Dragons removed",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35",
      "fileName": "Skyrim Monster Mod Lore-Friendly Standard v12-1 with Dragons removed-16411-2-1.zip",
      "uploadedUnix": "1360071020",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/39680604a9e14144abc6646f2250c1a568471918dc694c8f64fa732c3fc6c7ec/analysis/1407398599/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Monster%20Mod%20Lore-Friendly%20Standard%20v12-1%20with%20Dragons%20removed-16411-2-1.zip?fid=1000007256&ttl=1535781566&ri=8192&rs=8192&setec=a9c92d7919c38365b73af470cee7c251"
    },
    {
      "fileId": "1000007257",
      "name": "Skyrim Monster Mod Lore-Friendly Purist - v12-2 with Dragons removed",
      "version": "12.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "36",
      "fileName": "Skyrim Monster Mod Lore-Friendly Purist - v12-2 with Dragons removed-16411-12-2.zip",
      "uploadedUnix": "1360071103",
      "modVersion": "12.2",
      "virusScanUrl": "https://www.virustotal.com/file/2f3cf9b0c20f933f8f8f88e28f548908245c218d80d9cc19b6de96c184a25218/analysis/1407398600/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Monster%20Mod%20Lore-Friendly%20Purist%20-%20v12-2%20with%20Dragons%20removed-16411-12-2.zip?fid=1000007257&ttl=1535781567&ri=8192&rs=8192&setec=d5e02dd64c448e970857da57d1091f44"
    }
  ]
}