{
  "modId": 16410.0,
  "modName": "The Wanderers Surcoat",
  "summary": "A standalone retexture of the Iorveth outfit from The Witcher 2, adjusted to fit in with the visuals and lore of Skyrim",
  "descriptionHtml": "First shown in the promotional images and videos for \\\"The Dance Of Death,\\\" I have had many requests to release my personal retexture of the Iorveth Light Armour set, ported into Skyrim from The Witcher 2 by L0rdOfWar. So, at the first opportunity I began working on making it standalone, and now here we are! \r\n\r\nThe Wanderer\\'s Surcoat is a lore-friendly male and female light armour featuring the sigils of (most of) the major Holds of Skyrim across the chest. The outfit comes in both male and female variants, but unfortunately the female bodies aren\\'t rigged with CBBE or UNP, though it will function fine with them installed. I only customised the textures and created the new item in-game, the full credit for the porting and rigging of the meshes goes to L0rdOfWar, so i\\'d strongly suggest you head on over to [url=http://skyrim.nexusmods.com/downloads/file.php?id=5588]the original Mod page[/url] and endorse it for his efforts! The meshes themselves are property of CDProjekt, who have been generous enough to freely allow porting of their models from The Witcher 2 into other games. As if we needed any more reasons to buy The Witcher 2...\r\n\r\n[center]____________________________________________________________________________________________________________________________________[/center]\r\n\r\n[b][u]Obtaining the Surcoat:[/b][/u]\r\nThe outfit can be crafted under the \\\"Steel\\\" smithing section, without any perks, for the following:\r\n\r\n-1 Linen Wrap\r\n-2 Steel Ingot\r\n-1 Steel Dagger\r\n-4 Leather\r\n-4 Leather Strips\r\n\r\nAn enchanted version of the Surcoat can be crafted using the above recipe, with the addition of 3 filled Grand Soul Gems. The enchantment provides a 10% discount with vendors, 20 additional carrying capacity and 20 extra stamina. Both versions of the outfit are upgradeable, the standard version for an Orichalum Ingot, and the enchanted version for an Orichalum Ingot and a filled Greater Soul Gem.\r\n\r\nNote:The mod contains the outfit ONLY, the default Iorveth boots and gloves are not included, and neither are any of the boots or gloves featured in the screenshots. The gloves and boots shown in the screenshots are from [url=http://skyrim.nexusmods.com/downloads/file.php?id=1040]The Art of Magicka[/url] mod, though many vanilla meshes also work well with the set, such as the Leather boots and Hide bracers.\r\n\r\n[center]____________________________________________________________________________________________________________________________________[/center]\r\n\r\nThis page will be updated shortly with more images and a more adequate description. Thanks for your patience, and I appreciate any and all feedback!\r\n\r\n-Daedalus-AI\r\n\r\n[center]____________________________________________________________________________________________________________________________________[/center]\r\n\r\nDon\\'t forget to check out my Killmove mod, [url=http://skyrim.nexusmods.com/downloads/file.php?id=10906]The Dance Of Death [/url]\r\n\r\n[center]____________________________________________________________________________________________________________________________________[/center]",
  "categoryId": "54",
  "version": "0.1",
  "author": "DaedalusAI",
  "createdUnix": "1336121369",
  "updatedUnix": "1336121530",
  "containsAdultContent": false,
  "uploadedBy": "AzarelHrafin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "58541",
      "name": "Wanderers Surcoat v0-1",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6097",
      "fileName": "Wanderers Surcoat v0-1-16410-0-1.7z",
      "uploadedUnix": "1336121530",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/ae2eeb943f536c4e143ed5b5e77743b5279468a28780499cc7efd68a95bfc7e7/analysis/1406865188/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wanderers%20Surcoat%20v0-1-16410-0-1.7z?fid=58541&ttl=1535781560&ri=8192&rs=8192&setec=96a5201e9822ac1db555a114c40c5668"
    }
  ]
}