{
  "modId": 16436.0,
  "modName": "Flying Mod- Become The Dragon 2_0 Beta",
  "summary": "Fly around as a dragon WITHOUT THE USE OF CONSOLE COMMANDS! ",
  "descriptionHtml": "Flying Mod: Become The Dragon 2.0 Beta\r\nBy: ElSte17\r\n\r\n[youtube]oFVXJZRmzrI[/youtube]\r\n\r\nSpecial Credit: PorroOne and DarkenDe for translation code platform and references.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nInstall:  Merge the Data folder into your skyrim Data folder.\r\n\tCheck the Flying Mod Become The Dragon 2_0 Beta.esp file before starting the game\r\n\r\nTo use the save game, go to Documents/MyGames/Skyrim/Saves and drop the save file in there.\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nDescription: \r\nBecome a dragon and fly around without using console commands! (For followers of my previous version, this means you no longer have to type BAT commands every time you want to go up, down, left, right, or take off.  For the time being, landing DOES require ONE bat file, but boohoo I\\'ll get that worked out and fixed ASAP so don\\'t complain about the title being misleading anymore :p )\r\n\r\nAfter a breakthrough in coding by PorroOne (see his Flying Mod Beta), I have adjusted his code to apply to Dragon flight as well.  This mod is\r\nessentially an adjustment to PorroOne\\'s mod at the moment, though I will quickly be developing it into a better functioning\r\nflying mod for dragons and will be creating quests and other things to go along with it.  Thus, the 2.0 Beta version was created.\r\nNote: PorroOne\\'s original code was used as a platform with his permission, and I have since adjusted it so that it is barely\r\nrecognizable except for the translation part.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nIMPORTANT:  Follow these steps to allow the mod to work without crashing (not sure if all of these are totally necessary, but do them to make sure).\r\n\r\n1.  Load game.\r\n\r\n2.  Unequip weapons.\r\n\r\n3.  Equip a shout that is similar to a dragon breathing fire/frost.\r\n\r\n4.  Go into console and type \\\"bat init\\\" -->  You should now be a Dragon\r\n\r\n5.  Exit console and create a new save game.\r\n\r\n6.  Load this save game (this stores your race as a dragon)\r\n\r\n7.  If using my save file, go to favorites and equip the Flying Ring.\r\n\r\n8.  If not using my save file, go to the Sky Forge in White Run and craft a Flying Ring (no materials required).\r\n\r\n9.  Go to open space.\r\n\r\n10.  Go to invetory and make the Flying Ring a favorite (for faster access).\r\n\r\n11.  Equip the ring from the favorites menu.  Exit favorites menu.\r\n\r\n12.  Do not press anything, wait for the Dragon to take off and start flying.  Do not try to change between first and\r\n\tthird person view during take off.\r\n\r\n13.  Once dragon starts moving, you are free to control it. \r\n\r\n(Scroll back all the way on wheel to see full view of dragon)\r\n\r\nTo Land:\r\n\r\n14.  For realistic landing, fly close to ground.\r\n\r\n15.  Go to favorites menu (pauses game) and unequip ring. Before leaving favorites menu, enter the Console.\r\n\r\n16.  Type \\\"bat land\\\"\r\n\r\n17.  Exit Console, exit favorites menu.\r\n\r\n18.  You are now on the ground and free to move around.\r\n\r\nTo fly again, repeat steps 11-13.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nNote:  This mod owes a ton of credit to PorroOne and DarkenDe for their coding.  I could not have adjusted PorroOne\\'s\r\nhuman flying code to work for dragons without the foundation of code he provided me.  \r\n\r\nThis Mod might crash if you are using any of the following mods (you might have to uninstall them):\r\n\r\nWeredragon\r\nDragon Curse\r\nMaster Shape Shifter\r\n\r\nAny mod that might conflict with flying scripts or dragon transformations.\r\nPrevious versions of Flying Mod: Become The Dragon\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nThis is a Beta version, so there will probably be unexpected crashing for some people for reasons I have yet to find out.\r\nPlease report these issues in the comments section IF YOU ARE SURE YOU HAVE FOLLOWED ALL THE INSTRUCTIONS CORRECTLY.\r\n\r\nI will hopefully be adjusting the mod so that you do not need any sort of Console commands to land very soon.  The\r\nissue is minor and shouldn\\'t be hard to figure out.  Other issues, such as wing flapping and autoequipped shouts should\r\nalso be added shortly.\r\n\r\nEnjoy :) ",
  "categoryId": "83",
  "version": "2.0Beta",
  "author": "ElSte17",
  "createdUnix": "1336157857",
  "updatedUnix": "1336157956",
  "containsAdultContent": false,
  "uploadedBy": "ElSte17",
  "primaryFile": null,
  "files": [
    {
      "fileId": "58649",
      "name": "Flying Mod Become The Dragon 2_0 Beta",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10560",
      "fileName": "Flying Mod Become The Dragon 2_0 Beta-16436-1.rar",
      "uploadedUnix": "1336157956",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/de0880a299f5f14a41ad618b584c145810c71aeb2e74b3bc62954ea7f65132ab/analysis/1406866627/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Flying%20Mod%20Become%20The%20Dragon%202_0%20Beta-16436-1.rar?fid=58649&ttl=1535781608&ri=8192&rs=8192&setec=da9898dfb1965adeb8a8bc997e4a2546"
    }
  ]
}