{
  "modId": 16431.0,
  "modName": "Argonian Warpaints",
  "summary": "Eighteen standalone warpaints for male and female Argonians.",
  "descriptionHtml": "Faded gills got you down?  Throat sack not attracting the opposite sex?  Look no further! People will literally stop in the street as you walk by. Argonian\\'s will gaze at you with jealousy. They may even have to invent some form of eye protection to stop the average farmer from being blinded by your utter fantasticness.\r\nDisclaimer: Use of these paints may lead to itching, scratching, vomitting, mood swings, scale rot, water lung, disorientation, dizziness and flocks of geese (don\\'t ask).\r\n\r\nNow I\\'ve got my need for stupid introductions out the way; the premise:\r\nI love playing Argonian characters but found the warpaint selection a tad limited for a tribal race.  All the current warpaint mods seem to focus on human characters so I thought I\\'d add my efforts to the pot. These are all standalone and they all work with both male and female characters.  Hope you enjoy them!\r\n\r\nManual installation:\r\nUnpack the winzip into your Skyrim data folder.\r\n\r\nManual Uninstallation:\r\nDelete the following files:\r\n-ksArgonianWarpaints.esp\r\nDelete the following folders:\r\n-ksArgonianWarpaint\r\n\r\nPermissions:\r\nSo long as proper credit is given for everything used, these are free resources.  Please do provide credit if you use something though, it\\'s just polite =]\r\n\r\n[u]Other awesome mods for lizard-lovers:[/u]\r\n-\\\"Better male argonians eyes\\\" by Derok:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=5258&navtag=file/images.php?id=5258&tab=3\r\n\r\n-\\\"Drachis Argonians Mod- WIP\\\" by Drachis:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=981&navtag=file/images.php?id=981&tab=3\r\n\r\n-\\\"Argonian Snake Eyes\\\" by Drachis:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=830&navtag=file/images.php?id=830&tab=3",
  "categoryId": "29",
  "version": "2",
  "author": "Kibblesticks",
  "createdUnix": "1336149396",
  "updatedUnix": "1336149396",
  "containsAdultContent": false,
  "uploadedBy": "kibblesticks",
  "primaryFile": null,
  "files": []
}