{
  "modId": 16445.0,
  "modName": "Hunting Bow and Long Bow Craftable",
  "summary": "Makes the Long Bow and Hunting Bow craftable",
  "descriptionHtml": "Description: I made this mod for myself because I had multiple crafting/upgrading enabler mods for the vanilla weapons and armors, yet none of them included the hunting or long bow.  I didn\\'t want to download another total crafting overhaul because it would clutter my crafting screen with things that I already have recipes for, so i made this. This may be useful to you if you find yourself in my situation.\r\n\r\nSide notes: Yes I know this is mind numbingly simple and yes I know it has already been done in other mods, I\\'m just making a small version to fit in with larger mods.  If I find anything else that slipped through the cracks of my other crafting mods, I might upload a recipe for it.\r\n\r\nInstallation: Put the .esp in your data folder, wasn\\'t that hard.\r\n\r\nPermission: Honestly, you can do whatever you want with this.  If you use this, some credit would be nice but this is such a simple mod that I really don\\'t expect it.  If you want to give someone credit,a shout out to Bethesda in your readme or description would be nice.\r\n\r\nCredits: Bethesda for Skyrim\r\nAny modders who make crafting mods for all of the lovely things you do",
  "categoryId": "28",
  "version": "1",
  "author": "RaisTheWolf",
  "createdUnix": "1336168080",
  "updatedUnix": "1336168625",
  "containsAdultContent": false,
  "uploadedBy": "RaisTheWolf",
  "primaryFile": null,
  "files": [
    {
      "fileId": "58691",
      "name": "Craft2Bows",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Craft2Bows-16445-1.7z",
      "uploadedUnix": "1336168625",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/313ed3279d1c4fc7db9b8de1e65e5673582cff793457bc13469dd0ca9910251b/analysis/1406866864/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craft2Bows-16445-1.7z?fid=58691&ttl=1535781624&ri=8192&rs=8192&setec=37a6302eae9dc6ed35ac675200ee8702"
    }
  ]
}