{
  "modId": 16461.0,
  "modName": "Descent Into Madness",
  "summary": "Epic Madness/Dementia Mod with Unique voiced Characters and scenarios, dungeons and 2 hours of added game play. ",
  "descriptionHtml": "[center]Jesus 3 years and a few months into me modding and he reviews my first ever mod... \r<br />Welp, publicity for Discworld I&#39;ll take it, Check the hell out of my youtube for other videos of Discworld, a entirely insane New Lands mod, also check out Dragon Break 1 and 2[/center]\r<br />\r<br />[center][size=4]Discworlds newest trailer[/size]\r<br />\r<br />[youtube]OxJvubxtqTo[/youtube]\r<br />\r<br />[size=3]Dragon Break Episode 1 Bad Wolf Trailer[/size]\r<br />\r<br />[youtube]ndv6WYqm-fE[/youtube][/center]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />IF YOU HAVE HEARTHFIRE DOWNLOAD THIS\r<br />http://skyrim.nexusmods.com/mods/27053\r<br />\r<br />\r<br />-Appreciate all the d/l&#39;s and endorsements, leave a comment let people know how fun it was as well :P plus it bumps it-\r<br />[font=Comic Sans MS][size=6][color=deeppink]Descent Into Madness is a split quest epic mod in the Sheogorath scheme of TES adding over a hour of game play for each side. To start your epic journey Take a nap in your bed at Breezehome, you need it you&#39;re tired. [/color][/size][/font]\r<br />[size=4][color=crimson] FFS if you download please comment, did you like not like, I HAVE LOW SELF ESTEEM LET ME KNOW&#33;&#33;&#33;&#33; :P [/color][/size]\r<br />[size=1][color=darkslategray]Actually for full disclosure I have severe narcissism fueled by a insane superiority complex and random bouts of megalomania, under no circumstance say you liked the mod cause then I may be forced to masturbate to pictures of myself[/color][/size]\r<br />[size=5][color=gold]Level Dynamic after level 15[/color][/size]\r<br />[u]Over 350 unique audio files, hundreds of scripts and dozens of epic scenes and unique characters await you in this Epic journey into madness or dementia.[/u]\r<br />\r<br />\r<br />[youtube]3REdQszHqnk[/youtube]\r<br />\r<br /> Dementia below\r<br />[youtube]75P87N4_68A&feature=plcp[/youtube]\r<br />\r<br />Madness below,\r<br />[youtube]zPwAVlPAaRU&feature=plcp[/youtube]\r<br />\r<br />Version 1.2 fixes\r<br />Nothing, the mod was fucking perfect to begin with &#33;&#33;&#33;&#33;\r<br />\r<br />[color=violet][size=4]Hundreds of hours of work went into making this 99% bug free and a fun, enjoyable, and memorable experience[/size]\r<br />Full Playthrough videos might be uploaded in the future, but as of now the mod is to epic to give it all away.\r<br />\r<br />If you are using UNP Download and install the optional files to fix Nimbly, it should work otherwise she is apparently a mess lol, which works in the scheme of the mod imo\r<br />\r<br />I do recommend [url=http://skyrim.nexusmods.com/downloads/file.php?id=2666]CBBE[/url]\r<br />\r<br />[size=7]THIS IS REQUIRED, Something fucked up and w/o apachii hair you get hosed, thanks to reubertels for informing me.  [url=http://skyrim.nexusmods.com/downloads/file.php?id=10168]Apachii Hair[/url][/size]\r<br />Sorry about the week wait on that, I had tested it w/o Apachii before finalization, but I bet just turning off the ESP wasn&#39;t enough, after deleting the actually files in the meshes and textures I ended up with hard crashes on game startup. So Apachii is now required :P\r<br />\r<br />Although they are not necessary to actually play the mod, and who doesn&#39;t have CBBE anyway[/color]\r<br />\r<br />\r<br />[size=6]UPDATE 1.2\r<br />== NAVMESH BUG, I was not aware of this while making the mod and have found a fix that realistically can&#39;t be done in post-production. When you return to Madness or Dementia quick save and restart the game, I apologize for the inconvenience.[/size]\r<br />[size=4][color=tomato]WARNING- NOT A LORE FRIENDLY MOD SCHNARF SCHNARF\r<br />-WARNING- SAVE OFTEN, I HAD 0 RESTRAINT ON KILL SCRIPTS ON MY TRIALS\r<br />-WARNING- SAVE OFTEN IF YOU ARE ON A LOWER END MACHINE, SOME DUNGEONS ARE INTENSE\r<br />-Not so grave WARNING- This will replace nightingale some padded and jarl clothes with other armor graphics but only while the mod is active, if you have other armor in your data folder it will over-wright anything in my BSA but the odds of a compatibility issue are negligible-[/u][/color][/size]\r<br />\r<br />[color=gold]Also this is kind of unbalanced but it shouldn&#39;t be in the too hard department ever, I taught myself the CK over the last month so I kind of had to keep refining crap I already did. If a real programmer looked at this he&#39;d be like WTF, it has redundancies for its redundant redundancies. Hehe Also because of something buggy in the ESM Captain Jack is a pussy half the time and unkillable the other half. If bethesda actually used this for creating Skyrim I want to know their suicide rate. But really props to them, the CK is unbelievably powerful and I have only scratched the surface thus far.\r<br />\r<br />The next mod being storyboarded should add 8-15 hours of gameplay with a epic campaign across entirely new areas of map. I could seriously use help with landscape, dungeon design etc, also to make that work would be help in how to integrate one esp with another though probably duplicating a cell from a esp with another active would work.[/color]\r<br />\r<br />\r<br />Installation\r<br />-Unzip and put Descentintomadness2.esp and bsa into your data folder\r<br />-NPC&#39;s.esm is included but as far as I can tell it does not need to be active although you might want to just in case\r<br />\r<br />-Uninstall simply delete above 3 files\r<br />\r<br />Compatability issues\r<br />[color=crimson]-Follower extender scripts and their ilk, disable to play the mod, sorry for the inconvienence, I have no idea why it would interfere, could be ad simple as a script rename or something way more complicated, will check in the future.[/color]\r<br />-Armors might be different depending on armor mods you have installed but will only visually affect characters int he mod\r<br />-Will update as we find any\r<br />\r<br />Bugs\r<br />-The usual skyrim pathing AI bugs, 9 times out of 10 they tend to work themselves out in-game.\r<br />-Possible script/graphical bugs but there are dozens of redundancies in place.\r<br />-(Random) Minor AI bug at end of Dementia chain, it just screws with map marker for end of quest, get off your ass and find the Jarl yourself&#33;&#33;&#33;\r<br />-On a load of a new character after doing part of the mod on a different character, things bug out, restart of game client neccesary, no feasable way around it, on death reloads etc have no issues.\r<br />\r<br />Have fun and please comment if you liked it, the rest of you can fuck off, that was hundreds of hours of work :P\r<br />\r<br />\r<br />If you need to get ahold of any of the voice actors for voices you like in game, get in touch with me, I heard Jay is up for doing lots of sex scenes&#33;&#33;&#33;\r<br />\r<br />\r<br />\r<br />[size=5][color=lawngreen]CREDS\r<br />My man Jay for all his hard work and voiceovers, he made my life incredibly easy in some aspect and in others he wouldn&#39;t stop sending me voice files for one crazy Jarl, give him some love. \r<br />James (Jay) Appleyard\r<br />[url=http://www.appleyard-voiceovers.webeden.co.uk]Jay[/url]\r<br />  @JaysVoiceOvers\r<br />\r<br />My girl Jordie, for voiceovers and one hell of an uplifting and energy inducing voice, she was my cup of coffee in the mornings and kept me upbeat sometimes. \r<br />Jordie Wierenga  -- Plutorealm on the forums\r<br />\r<br />\r<br />Props to Gorgina for voiceovers and also being upbeat and keeping my company whilst I was scripting and wanting to commit seppeku \r<br />Gorgina Ward  [url=http://www.youtube.com/NekoLucaCosplay]Youtube Channel[/url]\r<br />\r<br />To Melissa for Voiceovers and stepping up at a late stage when I needed someone. \r<br />Melissa Morgan\r<br /> [url=http://www.melissa-morgan.com]Melissa[/url]\r<br />\r<br />For Sarahs amazingly insane Swedish voice, is it just me or do they sound nuts by default in that language?\r<br />Sarah Maynard-Enoch\r<br />\r<br />The band [url=https://www.facebook.com/AutumnStay] Autumn Stay [/url] for Trailer music\r<br />\r<br />\r<br />\r<br />My man fg109 for saving my life on scripts and helping prop me up till I learnededed myself\r<br />\r<br />Grimraven1 for character modeling as well as encouragement along this insane route\r<br />\r<br />Scrivener07 for his papyrus reference, couldn&#39;t have attempted this without it\r<br />\r<br />jojjo for allowing use of his Silverlight armor in my mod\r<br />\r<br />maniczombie for use of his posh mudcrabs in my mod\r<br />\r<br />Zotman12/Hentai for use of Succubus armor and hentingale[/color][/size]",
  "categoryId": "35",
  "version": "1.2",
  "author": "Me ",
  "createdUnix": "1336183867",
  "updatedUnix": "1355050223",
  "containsAdultContent": true,
  "uploadedBy": "Darren83",
  "primaryFile": null,
  "files": [
    {
      "fileId": "58776",
      "name": "Descent into Madness",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "91076",
      "fileName": "Descent into Madness-16461-1-0.zip",
      "uploadedUnix": "1336184710",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9078ef62c15c8b2f5ffff2e7238b958339f2d53675bf4d7fd31ce364dbced947/analysis/1406867787/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Descent%20into%20Madness-16461-1-0.zip?fid=58776&ttl=1535781664&ri=8192&rs=8192&setec=61fbf0f5df715b9d9b03c6a66ab2e04e"
    },
    {
      "fileId": "58785",
      "name": "TryforNMM Descent into Madness",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "91075",
      "fileName": "TryforNMM Descent into Madness-16461.zip",
      "uploadedUnix": "1336186902",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7db076f4ab5c7f8b1498a703bd0ab2c9d0594bb6fe629fcabd97655223f0ea1d/analysis/1406867814/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TryforNMM%20Descent%20into%20Madness-16461.zip?fid=58785&ttl=1535781665&ri=8192&rs=8192&setec=1ce7017ce8c2bd40f4daecb7a513f3ea"
    },
    {
      "fileId": "58958",
      "name": "UNP FIX",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "738",
      "fileName": "UNP FIX-16461.zip",
      "uploadedUnix": "1336239722",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b8e72b0ac3bb45ab8fec6fd2ae68c40377b131805a53500e7a9c456d0fb34cbd/analysis/1406869689/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UNP%20FIX-16461.zip?fid=58958&ttl=1535781665&ri=8192&rs=8192&setec=95b88ff49538cba6ab18f9a87927df35"
    },
    {
      "fileId": "104027",
      "name": "Descent Vanilla Compatible",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "82902",
      "fileName": "Descent Vanilla Compatible-16461-1-1.zip",
      "uploadedUnix": "1355050223",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/81c6e09343b911563e695bf0ed5d2e1253046f2dd7dd43b101397e5974e56854/analysis/1407296392/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Descent%20Vanilla%20Compatible-16461-1-1.zip?fid=104027&ttl=1535781665&ri=8192&rs=8192&setec=4df44954e893dcd9399e156c1b8f93fe"
    }
  ]
}