{
  "modId": 16481.0,
  "modName": "Deadly Dragons Spells",
  "summary": "Optional plugin for Deadly Dragons.",
  "descriptionHtml": "[center]\r<br />[img]http://www.skyrimnexus.com/imageshare/images/1614960-1327572901.png[/img]\r<br />\r<br />[color=orange][b]This mod is unsupported now. New (and I hope better) mod can be found [url=http://www.nexusmods.com/skyrim/mods/35339/?]here[/url][/b][/color]\r<br />\r<br />[color=lightblue][size=4][b][u]Spells[/b][/u][/size]\r<br />\r<br />Currently, this mod adds 65 books with base spells and 40 improvements for these spells. You can purchase all spells from Kroin, a new merchant in the Arcanaeum, Winterhold College, and then you may improve learned spells in the Hall of the Elements.[/color]\r<br />\r<br />[youtube]6-LRp0eyMv4[/youtube]\r<br />[youtube]aMCz2dHkQog[/youtube]\r<br />[youtube]_ySNNmpiQg8[/youtube]\r<br />[img]http://skyrim.nexusmods.com/imageshare/images/1614960-1336851491.png[/img]\r<br />[font=&#34;ComicSansMS&#34;][size=5][u][b]Spells[/b][/u][/size]\r<br />\r<br />[size=4]Decay[/size]\r<br />Curses the target with agony, causing X damage per sec over 16 sec.\r<br />\r<br />[size=4]Doom[/size]\r<br />Curses the target, causing X damage per sec over 12 sec.\r<br />\r<br />[size=4]Drain Soul[/size]\r<br />Drains the soul of the target, causing inversely proportional damage to the target&#39;s health. If the target dies while being drained, fills a soulgem.\r<br />\r<br />[size=4]Life Leech[/size]\r<br />Absorb X health per second from the target. Lasts 12 sec.\r<br />\r<br />[size=4]Shadow Form[/size]\r<br />Reduces damage taken by 20% and allows your summoned skeletons to explode upon death. Only one Form can be active at any one time.\r<br />\r<br />[size=4]Soul Link[/size]\r<br />Binds your soul with target&#39;s soul for 30 sec. Each time the target hits you, Soul Link deals X damage to the target.\r<br />\r<br />[size=4]Soul Swap[/size]\r<br />Consumes your Decay, Doom and Life Leech from the target. For 20 sec afterwards, the next target you cast Soul Swap on will be afflicted by consumed spells. You cannot Soul Swap to the same target.\r<br />\r<br />[size=4]Summon Undead[/size]\r<br />Summons skeleton-warrior/-berserker/-archer for 60 seconds.\r<br />\r<br />[size=5][u][b]Upgrades[/b][/u][/size]\r<br />\r<br />[size=4]Doom[/size]\r<br />Each rank increases a chance for Decay to restore 2% of your total health on each tick by 10%. Increases a chance for Doom to spawn a skeleton-warrior by 25% if the target dies while Doom is active.\r<br />\r<br />[size=4]Maledictory[/size]\r<br />Each rank increases the damage of Doom, Decay and Life Leech by 20%.\r<br />\r<br />[size=4]Necromancer[/size]\r<br />Each rank increases the health and damage of Skeleton-warrior, Skeleton-archer and Skeleton-berserker by 25%, and allows you to control additional skeleton.\r<br />\r<br />[size=4]Spiritualist[/size]\r<br />Each rank increases the damage of Soul Link spell by 33%. In addition, your Soul Swap leaves your damage-over-time spells behind on the target you Soul Swapped from.\r<br />\r<br />[size=4]Torment[/size]\r<br />Each rank increases the duration of Decay, Doom and Life Leech by 2 sec. In addition, your Life Leech will also absorb magicka and stamina.\r<br />[img]http://skyrim.nexusmods.com/imageshare/images/1614960-1336851555.png[/img]\r<br />[size=5][u][b]Spells[/b][/u][/size]\r<br />\r<br />[size=4]Bottomless bag[/size]\r<br />Bottomless bag. Requires a dragon soul to activate.\r<br />\r<br />[size=4]Charm[/size]\r<br />Charmed target will not attack you for up to 15 sec. Only one target can be charmed at a time\r<br />\r<br />[size=4]Arcane Form[/size]\r<br />Increases Magicka regeneration by 20% and reduces Magicka cost for all spells by 10%. Only one Form can be active at any one time.\r<br />\r<br />[size=4]Antimagic Zone[/size]\r<br />Places stationary Antimagic Zone that reduces spell damage done to the caster inside it by 10%.  Lasts for 20 sec.\r<br />\r<br />[size=4]Energy Shield[/size]\r<br />Creates a shield of energy that will nullify incoming damage from elemental attacks. Lasts 30 sec.\r<br />\r<br />[size=4]Arcane Power[/size]\r<br />Consumes a dragon soul, increasing your spell damage by 35%.  Lasts for 60 sec.\r<br />\r<br />[size=4]Sleep[/size]\r<br />Puts enemies to sleep, rendering them immobile for 30 sec or until awakened by an attack. Only one target can be forced to sleep at a time\r<br />\r<br />[size=4]Transmute[/size]\r<br />Transmutes 100 gold to random item.\r<br />\r<br />[size=4]Mentor[/size]\r<br />Your follower learns the spell equipped in your right hand. Has no effect when in combat.\r<br />\r<br />[size=4]Unlearn[/size]\r<br />Your follower unlearns the spell equipped in your right hand. Has no effect when in combat.\r<br />\r<br />[size=4]Erase[/size]\r<br />You forget the spell equipped in your right hand. Has no effect when in combat.\r<br />\r<br />[size=4]Study Prey[/size]\r<br />Study your prey from a distance.\r<br />\r<br />[size=5][u][b]Upgrades[/b][/u][/size]\r<br />\r<br />[size=4]Absorption[/size]\r<br />Each rank increases the damage absorbed by Energy Shield by 25%.\r<br />\r<br />[size=4]Arcane Mind[/size]\r<br />Each rank increases the Magicka regeneration granted by Arcane Form by 20%.\r<br />\r<br />[size=4]Coma[/size]\r<br />Each rank increases the time before the target can be awakened by damage by 3 sec.\r<br />\r<br />[size=4]Spell Barrier[/size]\r<br />Each rank increases the spell damage reduction of Antimagic Zone by 10%.\r<br />[img]http://skyrim.nexusmods.com/imageshare/images/1614960-1336848291.png[/img]\r<br />[size=5][u][b]Spells[/b][/u][/size]\r<br />\r<br />[size=4]Corpse Explosion[/size]\r<br />Explodes all corpses within a 70 ft radius, dealing 100 poison damage in a 15 ft area. Each explosion restores 3% of your total Magicka.\r<br />\r<br />[size=4]Death Rift[/size]\r<br />Summons a death rift at your feet. Upon recast, instantly teleports you to rift location. You can have only one Death Rift active at a time.\r<br />\r<br />[size=4]Death Grasp[/size]\r<br />Draws the target toward the caster. 20 sec cooldown.\r<br />\r<br />[size=4]Decimate[/size]\r<br />Attempts to kill the target, causing X disease damage if the targets at or below 15% health. If the target dies from this spell, your next Decimation will inflict 100% more damage. 12 sec cooldown.\r<br />\r<br />[size=4]Hand of Molag Bal[/size]\r<br />Summons a falling meteor down upon the target,  dealing X disease damage.\r<br />\r<br />[size=4]Enslave[/size]\r<br />Enslaves the soul of a dead target, forcing it to fight for you for 30 sec.\r<br />\r<br />[size=4]Poison Bolt[/size]\r<br />Sends a poison bolt at the enemy, causing X poison damage.\r<br />\r<br />[size=4]Poison Blast[/size]\r<br />A poison explosion in a 15 ft radius that deals X poison damage.\r<br />\r<br />[size=5][u][b]Upgrades[/b][/u][/size]\r<br />\r<br />[size=4]Deadly Rift[/size]\r<br />Targets in area you teleported from take disease damage over time. Each rank increases total damage by 30.\r<br />\r<br />[size=4]Lifebane[/size]\r<br />Each rank increases the damage done by your Hand of Molag Bal, Decimation, Poison Bolt and Poison Blast spells by 10%.\r<br />\r<br />[size=4]Deathbringer[/size]\r<br />Each rank increases the target&#39;s health percentage at which Decimation can be applied by 10%.\r<br />\r<br />[size=4]Death Embrace[/size]\r<br />Each rank increases the amount of meteors summoned by Hand of Molag Bal spell by 1.\r<br />[img]http://skyrim.nexusmods.com/imageshare/images/1614960-1336851596.png[/img]\r<br />[size=5][u][b]Spells[/b][/u][/size]\r<br />\r<br />[size=4]Fire Blast[/size]\r<br />A blast of fire that deals X points of damage. Targets on fire take extra damage.\r<br />\r<br />[size=4]Fire Bomb[/size]\r<br />Ignites the target for X points of damage each second for 8 sec. After 8 sec, the target explodes and deals fire damage in a 15 ft radius.\r<br />\r<br />[size=4]Fire Wave[/size]\r<br />A wave of fire that deals X damage. Targets on fire take extra damage.\r<br />\r<br />[size=4]Soul Fire[/size]\r<br />Deals X points of fire damage. Each time you cast Soul Fire, your spell damage is increased by 10% and magicka cost is increased by 10%. Stacks up to 3 times and lasts for 8 sec.\r<br />\r<br />[size=4]Volcano[/size]\r<br />Volcanic fissures form in the ground, emitting deadly geysers of molten flame at randon location for 20 sec.\r<br />\r<br />[size=4]Hellfire[/size]\r<br />Burns the ground at the target&#39;s feet, causing X fire damage each second for 10 sec to all enemies in a 15 ft radius. Instantly kills enemies at or below 20% health.\r<br />\r<br />[size=5][u][b]Upgrades[/b][/u][/size]\r<br />\r<br />[size=4]Pyromancer[/size]\r<br />Each rank increases the damage of Soul Fire, Fire Blast, Fire Wave, Fire Bomb and Volcano by 10%.\r<br />\r<br />[size=4]Firestarter[/size]\r<br />Each rank increases a chance to increase your fire damage by 50% for 10 sec every time you cast Soulfire, Fire Blast, Fire Wave and Fire Bomb by 5%.\r<br />\r<br />[size=4]Volcano[/size]\r<br />Each rank decreases the time between Volcano&#39;s Firebolts by 0.5 sec. \r<br />\r<br />[size=4]Impact[/size]\r<br />Each rank increases a chance to knockdown your target with Soulfire, Fire Blast, Fire Bomb, Fire Wave and Volcano by 10%. \r<br />[img]http://skyrim.nexusmods.com/imageshare/images/1614960-1336851651.png[/img]\r<br />[size=5][u][b]Spells[/b][/u][/size]\r<br />\r<br />[size=4]Ice Blast[/size]\r<br />Deals X frost damage to the target and then emits a wave of frost that deals X damage to all enemies in a 30 ft radius.\r<br />\r<br />[size=4]Frost Wave[/size]\r<br />A wave of frost that deals X points of frost damage to Health and Stamina.\r<br />\r<br />[size=4]Frost Hammer[/size]\r<br />Deals X points of frost damage to Health and Stamina.\r<br />\r<br />[size=4]Ice Lance[/size]\r<br />A spear of ice that does X points of frost damage to Health and Stamina. Deals triple damage to frozen targets.\r<br />\r<br />[size=4]Frost Orb[/size]\r<br />Summons a frost orb that lasts for 20 sec and casts Ice Lance at your targets.\r<br />\r<br />[size=5][u][b]Upgrades[/b][/u][/size]\r<br />\r<br />[size=4]Cryomancer[/size]\r<br />Each rank increases the damage of Frost Bolt, Ice Lance, Frost Wave, Ice Blast and Frost Hammer by 10%.\r<br />\r<br />[size=4]Deep Freeze[/size]\r<br />Each rank increases a chance to freeze your target with Frost Bolt, Frost Wave, Frost Hammer and Ice Blast by 5%.\r<br />\r<br />[size=4]Piercing Ice[/size]\r<br />Each rank increases a chance to deal double damage to your target with Frost Bolt, Frost Wave, Ice Blast and Frost Hammer by 5%. \r<br />\r<br />[size=4]Frost Fever[/size]\r<br />Each rank increases a chance to apply Frost Fever effect to your targets with Frost Bolt, Ice Lance, Ice Blast, Frost Wave and Frost Hammer by 10%. Frost Fever deals additional frost damage over 10 sec.\r<br />\r<br />[size=4]Frost Orb[/size]\r<br />Each rank allows you to summon additional Frost Orb.\r<br />\r<br />[size=4]Shatter[/size]\r<br />Each rank increases a chance to instantly kill frozen target with Frost Hammer by 10%.\r<br />[img]http://skyrim.nexusmods.com/imageshare/images/1614960-1337021873.png[/img]\r<br />[size=5][u][b]Spells[/b][/u][/size]\r<br />\r<br />[size=4]Spirit Bond[/size]\r<br />Binds the spirit of the target. Every time you cast Binding Heal, Revelation or Recuperation, these spells will be cast on the binded target.\r<br />\r<br />[size=4]Attract[/size]\r<br />You pull the spirit of the bounded target to you, instantly moving them directly in front of you.\r<br />\r<br />[size=4]Binding Heal[/size]\r<br />Restores X health.\r<br />\r<br />[size=4]Recuperation[/size]\r<br />Restores X health.\r<br />\r<br />[size=4]Revelation[/size]\r<br />Restores X Magicka.\r<br />\r<br />[size=4]Revive[/size]\r<br />Brings a dead ally back to life with 10% of base health and magicka. The target cannot be resurrected more than once in a day.\r<br />\r<br />[size=4]Divine Protection[/size]\r<br />Protects you and the bounded target from all damage and spells for 5 sec. The target cannot be protected again for 60 sec.\r<br />\r<br />[size=4]Flash of Light[/size]\r<br />Blasts the target with light, causing X healing to an ally or X damage to an enemy.\r<br />\r<br />[size=4]Divine Light[/size]\r<br />Emits a dazzling light in all directions, applying Flash of Light to all targets within 25 ft.\r<br />\r<br />[size=5][u][b]Upgrades[/b][/u][/size]\r<br />\r<br />[size=4]Priest of Mara[/size]\r<br />Each rank increases effectiveness of your Binding Heal, Recuperation and Flash of Light by 10%.\r<br />\r<br />[size=4]Divine Plea[/size]\r<br />Each rank increases the initial health and magicka amount of resurrected target by 30%.\r<br />\r<br />[size=4]Divine Intervention[/size]\r<br />Each rank increases the duration of Divine Protection by 5 sec.\r<br />\r<br />[size=4]Lightbringer[/size]\r<br />Each rank increases a chance to critically heal with your Binding Heal, Recuperation and Divine Light by 10%.\r<br />[img]http://skyrim.nexusmods.com/downloads/images/16481-4-1336706649.png[/img]\r<br />[size=5][u][b]Spells[/b][/u][/size]\r<br />\r<br />[size=4]Earth Strike[/size]\r<br />Deals X magic damage and throws the target away.\r<br />\r<br />[size=4]Petrify[/size]\r<br />Turns the enemies to stone, immobilizing them but also making them more difficult to damage. Lasts 10 sec.\r<br />\r<br />[size=4]Nature&#39;s Wrath[/size]\r<br />Imbues the target&#39;s weapon, increasing damage by 10% when hit by any attack. This effect can stack up to 5 times. Lasts 45 sec.\r<br />\r<br />[size=4]Regrowth/Wild Growth[/size]\r<br />A wave of healing energy rapidly restores X health per second to the caster/target for 12 sec. \r<br />\r<br />[size=4]Mend/Rejuvenation[/size]\r<br />Heals the caster/target over time for 10 sec. When Mend/Rejuvenation expires, the caster/target is instantly healed for 50. \r<br />\r<br />[size=4]Wild Form[/size]\r<br />Increases poison resistance by 50. Opponents in melee range take 10 points poison damage per second. Only one Form can be active at any one time.\r<br />\r<br />[size=4]Swarm[/size]\r<br />Deals X poison damage per second for 6 sec. \r<br />\r<br />[size=4]Envenom Weapon[/size]\r<br />Coats your weapon with poison that deals additional X damage. Drains 50 Magicka to sustain the spell. Lasts until cancelled.\r<br />\r<br />[size=4]Mana Totem[/size]\r<br />Summons a mana totem at the caster location for 15 sec, restoring 10 Magicka each 3 seconds in a 30 ft radius.\r<br />\r<br />[size=4]Corrosion[/size]\r<br />Corrodes target&#39;s armor, reducing damage resistance by X for 10 sec. \r<br />\r<br />[size=5][u][b]Upgrades[/b][/u][/size]\r<br />\r<br />[size=4]Pressure[/size]\r<br />Each rank increases total damage of Petrify spell by 40.\r<br />\r<br />[size=4]Maim[/size]\r<br />Each rank increases the critical hit chance of Swarm and Earth Strike spells by 10%.\r<br />\r<br />[size=4]Ravage[/size]\r<br />Each rank increases the maximum stacks for Nature&#39;s Wrath spell by 1.\r<br />\r<br />[size=4]Revitalize[/size]\r<br />Each rank increases the effectiveness of your nature&#39;s spells by 10%. Your nature&#39;s healing-over-time spells have a chance to apply Gift of Nature buff on each tick. This effect reduces magicka cost for nature&#39;s healing spells by 50% for 10 sec.\r<br />\r<br />[size=4]Gift of Nature[/size]\r<br />Your Regrowth and Wild Growth restores additional 1/2/3% if the target&#39;s health drops below 35%. Your Rejuvenation and Mend spells apply a Briar Ward, reflecting incoming melee damage back to attacker for 8 sec. \r<br />[img]http://skyrim.nexusmods.com/downloads/images/16481-1-1336706020.png[/img]\r<br />[size=5][u][b]Spells[/b][/u][/size]\r<br />\r<br />[size=4]Shock Charge[/size]\r<br />An electrical blast that deals X shock damage in a 10 ft radius. \r<br />\r<br />[size=4]Eye of Storm[/size]\r<br />Summon an immortal Eye of Storm from the atmosphere at the target for 20 sec.\r<br />\r<br />[size=4]Lightning Totem[/size]\r<br />Summons a lightning totem at the caster location that repeatedly attacks an enemy with chain lightning. Lasts 15 sec.\r<br />\r<br />[size=4]Storm Surge[/size]\r<br />When activated, each enemy that hit you will be struck with lightning.\r<br />\r<br />[size=4]Shock Totem[/size]\r<br />Summons a shock totem at the caster location for 15 sec. Shock totem emits an electrical wave each 2 sec that deals X points of damage.\r<br />\r<br />[size=4]Thunder Strike[/size]\r<br />A bolt of lightning that does X shock damage to Health and Magicka.\r<br />\r<br />[size=5][u][b]Upgrades[/b][/u][/size]\r<br />\r<br />[size=4]Stormbringer[/size]\r<br />Each rank increases the damage of Thunderstrike, Overload, Backfire, Eye of Storm and Shock Charge by 10%.\r<br />\r<br />[size=4]Static Charge[/size]\r<br />Each rank increases a chance for Static Charge to occur by 8%. Static Charge causes a Thunderstrike or Shock Charge spell you cast to trigger an Overload spell on the same target.\r<br />\r<br />[size=4]Backfire[/size]\r<br />Each rank increases the damage of Storm Surge&#39;s backfire spell by 10.\r<br />\r<br />[size=4]Precision[/size]\r<br />Each rank increases a chance to hit the target for Eye of Storm by 10%.\r<br />\r<br />[size=4]Totemic Mastery[/size]\r<br />Each rank increases the duration of Shock Totem and Lightning Totem by 50%.\r<br />[img]http://skyrim.nexusmods.com/downloads/images/16481-5-1336706649.png[/img]\r<br />[size=5][u][b]Spells[/b][/u][/size]\r<br />\r<br />[size=4]Battle Shout[/size]\r<br />Bolsters the spirit of your allies and provide a large bonus to health and damage to all allies within its area of effect for 15 sec.\r<br />\r<br />[size=4]Howl of Terror[/size]\r<br />Your howl heralds the doom of your enemies, shattering their nerves and the strength of their attack diminishes for 10 sec.\r<br />\r<br />[size=4]Adrenaline Rush[/size]\r<br />Activates when health drops below 35% and boosts life regeneration for 6 sec. 60 sec cooldown.\r<br />\r<br />[size=4]Recklessness[/size]\r<br />Grants your attacks an additional 30% chance to critically hit, but increases all damage taken by 30%. Lasts 12 sec. 60 sec cooldown.\r<br />\r<br />[size=4]Battle Rage[/size]\r<br />Each enemy hit has a chance of sending you into a battle rage that adds bonus damage to attacks for 10 sec.\r<br />\r<br />[size=4]Hunting Stance[/size]\r<br />A hunting stance, that increases movement speed.  If the caster is struck, he will be dazed. Only one stance can be active on you at any one time.\r<br />\r<br />[size=4]Battle Stance[/size]\r<br />A battle stance that increases damage by 10% and grants additional armor rating. Only one stance can be active on you at any one time.\r<br />\r<br />[size=5][u][b]Upgrades[/b][/u][/size]\r<br />\r<br />[size=4]Shouts[/size]\r<br />Each rank increases the duration of Battle Shout by 50%. Each rank increases damage reduction for Howl of Terror by 10%.\r<br />\r<br />[size=4]Warfare[/size]\r<br />Each rank increases the bonus damage of Battle Rage effect by 10%.\r<br />\r<br />[size=4]Efficiency[/size]\r<br />Each rank decreases Adrenaline Rush and Recklessness cooldown by 10 sec.\r<br />\r<br />[size=4]Discipline[/size]\r<br />Each rank increases the speed bonus for Hunting Stance by 20%. Each rank increases the armor bonus for Battle Stance by 50.\r<br />[/font]\r<br />[b][u]Credits:[/b][/u]\r<br />\r<br />[color=lightblue]Description & Readme: [url=http://www.skyrimnexus.com/modules/members/index.php?id=3224445]I2edShift[/url]\r<br />User Support: [url=http://skyrim.nexusmods.com/modules/members/index.php?id=3436742]Oyabankyuubi[/url]\r<br />Deadly Dragons logo: [url=http://skyrim.nexusmods.com/modules/members/index.php?id=3168938]SilversParlor[/url][/color]\r<br />\r<br />[color=red] Sorry for my English in comments and many thanks to [b]I2edShift[/b] for this awesome description.[/color][/center]",
  "categoryId": "75",
  "version": "Final",
  "author": "3JIou",
  "createdUnix": "1336218059",
  "updatedUnix": "1339831229",
  "containsAdultContent": false,
  "uploadedBy": "3jiou",
  "primaryFile": null,
  "files": [
    {
      "fileId": "61521",
      "name": "Deadly Dragons Console 4-4-6",
      "version": "4.4.6",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "3",
      "fileName": "Deadly Dragons Console 4-4-6-16481-4-4-6.rar",
      "uploadedUnix": "1337106733",
      "modVersion": "4.4.6",
      "virusScanUrl": "https://www.virustotal.com/file/7ca81d7952daef65e7074967234deb2cf299762bd79916e6a479eacb5f6d46fa/analysis/1406894823/",
      "changelogHtml": " Volcano, Frost Orb and Lightning Totem fixed <br/> \n Light spells added <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deadly%20Dragons%20Console%204-4-6-16481-4-4-6.rar?fid=61521&ttl=1535781691&ri=8192&rs=8192&setec=4305cb572ef5a329e81eb8728dcb58fe"
    },
    {
      "fileId": "68300",
      "name": "Deadly Dragons Spells v4-5-5",
      "version": "4.5.5",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "3751",
      "fileName": "Deadly Dragons Spells-16481-4-5-5.zip",
      "uploadedUnix": "1339831229",
      "modVersion": "4.5.5",
      "virusScanUrl": "https://www.virustotal.com/file/c09a81c465b456190dd2ad9f280717c451b857620633e89bf14f8f92652ecc1f/analysis/1406962508/",
      "changelogHtml": " Revelation fixed <br/> \n Adrenaline Rush fixed <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deadly%20Dragons%20Spells-16481-4-5-5.zip?fid=68300&ttl=1535781692&ri=8192&rs=8192&setec=d51cd1f32d13605af4295202a59b1672"
    }
  ]
}