{
  "modId": 16484.0,
  "modName": "Memorial for a Friend - RIP Elder Scrolls Single Player",
  "summary": "This mod is my way of giving the \\\"Finger\\\" to Zenimax Online for raping the Elder Scrolls Series.",
  "descriptionHtml": "Important Notice / Update\r\n=======================\r\n\r\nAdmins have very kindly allowed this mod to stay on Nexus. Comments will however be disabled.\r\nIf they wish for me to remove it immediately, i will comply with no questions asked.\r\n\r\nTo everyone who has PM me, thank you very much for your kind support, i may not be able to reply to everyone, but know that i appreciate it very much.\r\n\r\nSpecial Thanks to Maise for a very beautiful screenshot of Dagon Eso\\'s fate :D\r\n(You can view it under the Images Tab)\r\n\r\nPLEASE DO NOT POST THIS MOD ON ANY OTHER WEBSITES OR REVIEW VIDEOS. \r\nI don\\'t want to give the wrong impression that im trying to seek attention. I just want it to silently sit in Nexus.\r\n\r\nIf you feel very strongly about this, please take the time to send your opinion to Zenimax Online via the below link. I implore you \r\nnot to flame/redicule/insult them, but state your opinion in a mature and polite way, and maybe, just maybe they might listen.\r\n\r\nhttp://www.zenimaxonline.com/contact.php\r\n\r\n\r\nMod Description\r\n===============\r\nWith the announcement of The Elder Scrolls Online created by Zenimax Online,\r\ni personally feel it has VIOLATED every virtue that the Elder Scrolls Series have upheld.\r\n\r\nNo longer are you the chosen one, where everyone and their mother are now the Dovahkiin.\r\nYou will have an emperor of Tamriel whose name is LegolasXXXX or LeegooLaXXWTF\r\n\r\nNo more will the story be weaved around you, no more will characters sing your praises.\r\nNight after night, all you will hear is \\\"WTFOMGBBQNOOB Y IZ UR TANKZ/HEALZ/DPS SO SUXXZORZZ!!!! GTFO!!!!\\\"\r\n\r\nThe most frightening thing that will happen is, the Single Player Elder Scrolls will be \r\nforever banished, and only Elder Scrolls Online will be the only one you can play. \r\n\r\nParanoid Much? Hardly.\r\n\r\nProof 1: WoW is the reason why we will NEVER see a Warcraft 4 again.\r\n\r\nProof 2: Did you enjoy KOTOR? Want to know the fate of Darth Revan? Play SWTOR then. \r\nBioware had stated that SWTOR is KOTOR 3,4,5,6,7 etc. No more single player.\r\n\r\nProof 3: This one is abit old. Remember the Ultima Series? Remember how cool was Ultima 7 Black Gate or Ultima Underworld? UO came and put an end to all this. The once highly respected Origin Systems is now merely another name for EA\\'s online platform. It ended the Wing Commander Series too. Very sad.\r\n\r\nEnjoy Skyrim while you still can. It may very well be the last Elder Scrolls Single Player made.\r\n\r\nI do understand that Pete Hines have recently tweeted that the MMORPG does not affect the current or future status of the Elder Scrolls series. \r\nBut think again, he\\'s only 1 of the many employees of Bethesda. Whats to stop his Big Bosses from laying off / merging Todd Howard\\'s team and \r\nfocus all efforts on the MMORPG if it generates bucketloads of cash for them in the future? Think about it, its not too far-fetched.\r\n\r\nDo you also not feel pissed off that they have been working on this MMORPG since 2007 by a studio whom the fans have NEVER had any contact with and all of a sudden they appear, shove this abomination into our faces and say \\\"WOO!! Elder Scrolls Online is ready, and we\\'ll launch it in 1 year!!\\\" Seriously WTF!!\r\n\r\n\r\nMy Reaction / My purpose for this mod\r\n=================================\r\nAnger, Disbelief, Disappointment, Despair.\r\nEspecially after reading the leaked 19 page Game Informer article, all hope is lost.\r\nIt is merely another WoW clone, and is EVERYTHING the Elder Scrolls series has worked so hard to fight against.\r\n\r\nI mean COME ON!!! JUST LOOK at this first official released ESO image\r\nhttp://media1.gameinformer.com/imagefeed/featured/bethesda/elderscrolls/online/hub/watermarked.jpg\r\n\r\nHow is it ANY DIFFERENT from the images of these games below?\r\nMore power to you if you know what games these images are from without lookin at the URLs.\r\n(Yea yea, i know, the last image isn\\'t an MMO yet but you get my point.)\r\n\r\nhttp://www.riftgame.com/img/media/screenshots/ss326/ss326-full.jpg\r\nhttp://www.vgrevolution.com/wp-content/uploads/2009/12/SWTOR12011013.jpeg\r\nhttp://l3cdn.funcom.com/aoc/screenshots/conan4-800x600.jpg\r\nhttp://web.cdn.eamythic.com/sites/wrathofheroes.com/cms/images/screenshots/ss06-04-02-2012.jpg\r\nhttp://www.amalur.com/sites/default/files/Reckoning-Bulwark.jpg\r\n\r\nAnyway I figured, why not channel these unpleasant feelings of mine into crafting a mod.\r\nA mod that while showcasing my feelings, yet let me learn more about modding at the same time, a creative outlet for this horror i feel.\r\n\r\n\r\nWhat This Mod Does:\r\n==================\r\nIt places a activatable gravestone at the side of Dragonreach in Whiterun.\r\nYou can refer to the images for exact location of this gravestone.\r\nRight now it does nothing much, but just a memorial that displays a message when activated.\r\n\r\nThere is also a killable Dremora hanging around the place. His name is Dagon Eso and he\\'s\r\nthere to tell you a \\\"Story\\\". Go punch him in the face :)\r\n\r\n\r\nUPDATE LOG:\r\n===========\r\n\r\nv1.2a - Dagon Eso\\'s dialogue bug is solved. His messages will not fly past fast anymore.\r\nI\\'ve also touched up his dialogue so it flows a lil more smoothly now. But...he still does \r\nnot auto initiate combat at the end of the conversation. Still reading up on how to do that.\r\n\r\nCredits to Seidenweber\\'s solution to rename all WAV to FUZ\r\nhttp://forums.bethsoft.com/topic/1347417-dialogue-troubles/page__p__20346206#entry20346206\r\n\r\nv1.2 - Dagon Eso has proper dialogue now. At the end of the dialogue, it should end correctly.\r\nHOWEVER, there is a bug now. All of his speeches fly past WAY TOO FAST and its impossible to read what he says. \r\n\r\nv1.1 - Added a Dremora named Dagon Eso. (No prizes for guessing what Eso means ;)\r\nYes im aware his name also sounds like \\\"Asshole\\\". (Thanks Jerry for this name!!)\r\n\r\nI have no idea why we used Dagon tho, i guess it sounds appropriate for a Dremora.\r\nHe\\'s hanging around the grave at the moment, testing out dialogue scripting now.\r\nAnd yes he\\'s killable. So kill him, multilate him, do what you want with him.\r\n\r\nv1.0 - Initial Release\r\n\r\n\r\nFuture Planning:\r\n==============\r\nI am new to modding and scripting, and while i hate for this memorial to be created,\r\ni would still want to expand it slowly, basically learning new scripting/modding techniques\r\nand crafting them into this mod.\r\n\r\nHere are some stuffs i have planned to do:\r\n\r\n1) Change the message box so it will have lines and spacing like how the shrines\r\nleading up to High Hrothgar works. Still reading up on how to do this.\r\n\r\n2) Move the Gravestone to another remote location, preferably an instanced cave or something and of course beautify it.\r\n\r\n3) DONE - Put a Dremora NPC as an enemy and name him \\\"The Elder Scrolls Online\\\"\r\nThis is for players to vent who feels the same way as me, who will have a chance to \\\"Kill\\\" it\r\nThere will be dialogues of course, tho not voice acted.\r\n\r\nThe point of this mod is for me to pour my hate and utilize it in a creative fashion.\r\nIf you do not like it, please do not download it. If you do download it, i appreciate your support and may the Nine Divines smile upon you :)\r\n\r\n\r\nCredits:\r\nBethesda Game Studios for bringing us the wonderful Elder Scrolls series.\r\nSkyrim Nexus for providing a very easy and user friendly interface for modders to upload their work.\r\n\r\nDisclaimer:\r\nThis Mod does not represent the views of both Bethesda or Skyrim Nexus.\r\nThey have nothing to do with this mod, and all views are of my own.",
  "categoryId": "74",
  "version": "v1.2a",
  "author": "Phyber",
  "createdUnix": "1336225453",
  "updatedUnix": "1336371611",
  "containsAdultContent": false,
  "uploadedBy": "Phyber",
  "primaryFile": null,
  "files": [
    {
      "fileId": "58888",
      "name": "RIPElderScrolls",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "RIPElderScrolls-16484.zip",
      "uploadedUnix": "1336225739",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/394ad26326a99f728c857c3233b676ed41473df54c5caf777ffe67fe3b3d6e25/analysis/1406868842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RIPElderScrolls-16484.zip?fid=58888&ttl=1535781697&ri=8192&rs=8192&setec=1c752d931a51edaaa978cb79186ef013"
    },
    {
      "fileId": "58950",
      "name": "RIPElderScrollsV1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "RIPElderScrollsV1_1-16484.zip",
      "uploadedUnix": "1336238774",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/cf31b5eb24b24e8bd14f07fe028b2a37d69b15f714cba94755248b79c0674a90/analysis/1406869624/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RIPElderScrollsV1_1-16484.zip?fid=58950&ttl=1535781698&ri=8192&rs=8192&setec=99a892ac7fb628b7bad68fdc0c74755e"
    },
    {
      "fileId": "59137",
      "name": "RIPElderScrollsV1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "RIPElderScrollsV1_2-16484.zip",
      "uploadedUnix": "1336301033",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/13e0f015f31a87000ffb250e5840f4ee2dddc9ac5498aa64f62b55bb495edc44/analysis/1406871243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RIPElderScrollsV1_2-16484.zip?fid=59137&ttl=1535781698&ri=8192&rs=8192&setec=431787581f751e3eb2afd829f6e778fd"
    },
    {
      "fileId": "59434",
      "name": "RIPElderScrollsV1_2a",
      "version": "1.2a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2561",
      "fileName": "RIPElderScrollsV1_2a-16484-1-2a.zip",
      "uploadedUnix": "1336371611",
      "modVersion": "1.2a",
      "virusScanUrl": "https://www.virustotal.com/file/f8b4d2bb391eaad66ed68b337e849b6f885b28f954b0f8d78f28d6dcc6234f47/analysis/1406874244/",
      "changelogHtml": " Dagon Eso\\'s Dialogue Bug is now solved. His messages should stay on alot longer. <br/> \n Also fixed up dialogue structure so the conversation flows alot smoother now. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RIPElderScrollsV1_2a-16484-1-2a.zip?fid=59434&ttl=1535781698&ri=8192&rs=8192&setec=d86d28e764c9dbe2f2b59041ebc43980"
    }
  ]
}