{
  "modId": 16508.0,
  "modName": "Radonious House",
  "summary": "This mod is a fairly large house place in Whiterun behind \\\"The Bannered Mare\\\". It includes it\\'s own map marker also.",
  "descriptionHtml": "Description:\r\nEver get tired of small Breezehome in Whiterun? This mod adds a new player home to Whiterun. This is my first mod ever so please be generous. \r\nLocation:\r\nThe house is located behind \\\"The Bannered Mare\\\" and the key is right outside the door. When you enter please read the welcome books on both the first and second floor. This will help you find your way around the house.\r\nRooms Includes:\r\nA Dining Room, A Kitchen, Living Room, a Downstairs Master Bedroom, and a Hidden Treasury.\r\nUpstairs Rooms Include:\r\nThree seperate crafting rooms, a Display Room, A Master Bedroom, A Bathroom which includes a pool/bath, shower, and toilet.  Read below if you would NOT like to find the treasury on your own. \r\nOthers:\r\n Includes a new bow called the \\\"Scorcher\\\" and a arrow named \\\"Dalton\\'s Arrow\\\". Three new types of drinks are included in the Freezer (In the kitchen). Also includes Soap, Shampoo, and Conditioner for the Shower.\r\nCredits:\r\nAll of the light switches used in this mod was created by WilliamSea, and i take no ownership of them. Please report bugs or errors, Enjoy!\r\n                    \r\n           *STOP READING IF YOU WANT TO FIND THE SECRET TREASURY ON YOUR OWN*\r\n           *STOP READING IF YOU WANT TO FIND THE SECRET TREASURY ON YOUR OWN*\r\nAlright, to find the secret treasury you must go to the main floor and then find the bedroom on the far left side of the house. On the right side of the room open the closet and backpanel, you should see a brick wall if you have done this correctly. On the left side of the room there is a plant with a backboard behind it. Move the backboard which should reveal a golden button. Press the button and this should move the brick wall. Move down the stairs and enjoy :D. Also if you wish to get back up the stairs faster there is a transport button at the bottom of the stairs.",
  "categoryId": "67",
  "version": "1",
  "author": "Dalton2264",
  "createdUnix": "1336241002",
  "updatedUnix": "1336241895",
  "containsAdultContent": false,
  "uploadedBy": "Dalton2264",
  "primaryFile": null,
  "files": [
    {
      "fileId": "58970",
      "name": "Radonious House",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7891",
      "fileName": "Radonious House-16508-1.rar",
      "uploadedUnix": "1336241895",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/cb3db0b5926fb7a7af34fc3e8265d0bd312a9b3dcd3db470662ff611f840c031/analysis/1406869815/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Radonious%20House-16508-1.rar?fid=58970&ttl=1535781732&ri=8192&rs=8192&setec=d72330d3814bdd2d95ccbc13f28cd7f3"
    }
  ]
}