{
  "modId": 16521.0,
  "modName": "Explorer Dungeon Pack",
  "summary": "This is a dungeon pack catering to dedicated explorers. Contained within are 4 high-quality, expansive, and lore-friendly dungeons scattered throughout the land of Skyrim that will challenge new and experienced adventurers alike. Each is hand crafted with much attention paid to detail and lore-friendliness. Every dungeon is also radiant quest enabl",
  "descriptionHtml": "[youtube]iOPpXsOTKhc[/youtube]\r\n\r\nThis is a dungeon pack catering to dedicated explorers. Contained within are 4 high-quality, expansive, and lore-friendly dungeons scattered throughout the land of Skyrim that will challenge new and experienced adventurers alike. Each is hand crafted with much attention paid to detail. Every dungeon is also radiant quest enabled.\r\n\r\n--------------------------------------\r\n\r\nDungeon Descriptions:\r\n\r\nMurkwater Cavern-\r\nThis large cave was once a hideout for smugglers shipping goods into Skyrim. Several years ago, as the men were unloading a high-value shipment from Cyrodiil, a flash flood killed everyone inside. Since then, no one has ventured inside to claim the smugglers\\' treasure, as many villagers have reported eerie lights coming from within.\r\nDifficulty: 3/5\r\nLength: 4/5\r\n\r\nCragrock Spire-\r\nThis ancient nordic monument is situated high atop a mountain in the middle of the tundra. A group of bandits have been excavating underneath in search of treasure, but found a nasty surprise when they uncovered a buried nordic catacomb. The remaining bandits and their leader have since been camped in the tower above.\r\nDifficulty: 5/5\r\nLength: 2/5\r\n\r\nRunar\\'s Retreat-\r\nThis mansion was once owned by a wealthy trader from Markarth. Recently it was attacked by forsworn, who overwhelmed the nobleman\\'s guards and have since been occupying the structure. It is said that the forsworn were able to gain an alternate entrance to flank the guards, however none survived to tell the tale.\r\nDifficulty: 4/5\r\nLength: 3/5\r\n\r\nWayfinders Watch-\r\nThis icy cave on the north shore of Skyrim was one of the first sights seen by the nord pilgrims who sailed across the Sea of Ghosts from Atmora thousands of years ago. For years, it has been inhabited by a group of vampires who have performed grotesque experiments on their innocent victims. \r\nDifficulty: 4/5\r\nLength: 4/5\r\n\r\n--------------------------------------\r\n\r\nKnown Bugs:\r\n- The exterior of Cragrock Spire sometimes fails to load. This can be fixed by reloading a save or fast traveling away and back.\r\n- Some have experienced crashes due to conflicts with other mods. If you get CTDs with the mod installed, try moving it to the top of the load order for a possible fix. Also try using the ESP+ESM combo version located in the downloads section. Place both files in your data folder and start the game normally.\r\n\r\n--------------------------------------\r\n\r\nChangelog:\r\n\r\nVersion 1.0- Initial public release.\r\n\r\n--------------------------------------\r\n\r\nI\\'ve spent countless hours making sure each of these dungeons is as perfect as possible. Your downloads and ratings are much appreciated! If you encounter any bugs or have suggestions, feel free to leave reports in the comments. Thank you!\r\n\r\nSpecial thanks to Darnoc for the mod video. If you enjoyed, feel free to subscribe to his channel!",
  "categoryId": "88",
  "version": "1.0",
  "author": "PaperBoat",
  "createdUnix": "1336246612",
  "updatedUnix": "1336317092",
  "containsAdultContent": false,
  "uploadedBy": "paperboat22",
  "primaryFile": null,
  "files": [
    {
      "fileId": "58997",
      "name": "ExplorerPack_v1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "540",
      "fileName": "ExplorerPack_v1_0-16521-1-0.zip",
      "uploadedUnix": "1336246756",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/61827dd429ce58812d97d72f6d997fa77e9d1261e75936e35054349701897f58/analysis/1406870071/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ExplorerPack_v1_0-16521-1-0.zip?fid=58997&ttl=1535781752&ri=8192&rs=8192&setec=545f21e50bebd038ae3150e842409c8e"
    },
    {
      "fileId": "59234",
      "name": "ExplorerPack_v1_0_ESP_ESM",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "529",
      "fileName": "ExplorerPack_v1_0_ESP_ESM-16521.zip",
      "uploadedUnix": "1336317092",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5dc86496d0bf89efe37afe19296e9370ee85e800cc2aa2708240b2a8391717ae/analysis/1406872443/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ExplorerPack_v1_0_ESP_ESM-16521.zip?fid=59234&ttl=1535781752&ri=8192&rs=8192&setec=1cd21c04969dc74811520e33f314f6c7"
    }
  ]
}