{
  "modId": 16539.0,
  "modName": "Ultimate Castle Defense BETA",
  "summary": "Defend your castle against waves of enemies! Upgrade your castle, hire soldiers, upgrade soldiers, gather resources, buy barricades, and upgrade your own weapons and armor. ",
  "descriptionHtml": "The highly anticipated Ultimate Castle Defense mod is here!\r\n\r\nTHIS IS A BETA. THERE WILL BE BUGS. PLEASE DON\\'T OVERWRITE YOUR OLD SAVES. I also wouldn\\'t continue playing Skyrim on a save you played the mod on, as future versions of the mod may not work.\r\n\r\nIF YOU ARE PLAYING THE NEWEST VERSION AND HAVE PREVIOUSLY PLAYED AN OLD VERSION YOU MUST LOAD A SAVE FROM BEFORE THE MOD WAS LOADED OR THE NEW VERSION MAY NOT WORK CORRECTLY.\r\n\r\n\r\nChangelog:\r\n\r\nUpdate v1.5\r\n-There are now 4 different bosses! They are: Dragons, Dragon Priests, Dwarven Centurions, and Werewolf Savages.\r\n-Enemy spawning should be improved.\r\n-No more LOD in the Castle Defense worldspace (thought it may have been causing problems).\r\n-The courier is now dead, and located outside of Whiterun by the stables (the courier may have been causing problems). You can find Leo\\'s Note on his body. Alternatively, you can fast travel directly to the island or to Leo\\'s Boat without doing anything.\r\n-You now have to use the power to bring up the menu, and it should be much harder to break.\r\n-Fighter upgrades no longer break the menu.\r\n-General menu improvements, such as errors with wording.\r\n-You are no longer asked if you want to buy another soldier.\r\n-Barricade system redone to be more efficient.\r\n-Ending should work better, and you should always get the key to Leo\\'s House\r\n-The -UCD Configuration- tool should always add itself to the player if removed.\r\n\r\n-Todo in v1.6:\r\n-Fix grass indoors (can be fixed with a restart).\r\n-Fix save issues (if anyone has any idea why this may be happening, please let me know).\r\n-Implement better courier system.\r\n-Add an option for soldiers to guard resource gatherers (this was implemented, but wasn\\'t working properly).\r\n-Other stuff I\\'m forgetting.\r\n\r\n\r\nUpdate v1.4\r\n-Round spawning should be fixed now. I found what looked like the problem, fixed it, and a friend and I both tested it and had no problems.\r\n-Added additional armor types and the ability to choose the armor class you start with and want to buy.\r\n-Armor is no longer forcefully attached to the player and their follower. If your follower doesn\\'t like the armor, they won\\'t wear it.\r\n-You now deposit items you wish to be able to buy back, and the rest get stored until the gamemode is over.\r\n-The upgrade menu is now considered a lesser power and operated with the Z key (or your power key). Consequently, barricades and soldiers are now placed with the Z key.\r\n-Navmesh over the lump on the first part of the tower was improved.\r\n-Enemies should no longer go in water.\r\n-You will now receive the key to Leo\\'s House the first time you play through.\r\n-Enemies no longer spawn on the tower walls.\r\n-Tower upgrades should work correctly without breaking the game.\r\n-As always, remember to load a save that hasn\\'t touched the mod when you play this and any new version in beta.\r\n\r\nUpdate v1.3\r\n-Spawning should be fixed. If not there is now an option in the config menu on the second page called \\\"Fix Round\\\" that should fix it.\r\n-You can now use the boat to leave the island at any time.\r\n-Fast travel should work now when the gamemode is off. If it doesn\\'t, it will reenable once you travel back to Skyrim via the boat.\r\n-Castle upgrades should work perfectly now, but if they don\\'t let me know.\r\n-You should always get your items back when the gamemode ends now.\r\n-Redesigned the main script to be more efficient and work better.\r\n-MAKE SURE YOU LOAD A SAVE FROM BEFORE THE MOD WAS LOADED BEFORE PLAYING THIS VERSION.\r\n\r\nUpdate v1.2\r\n-Round spawning issues should be completely fixed. ONLY the required amount of enemies will spawn, and the max enemies alive changes based on difficulty and round number again.\r\n\r\nUpdate v1.1\r\n-Enough enemies should always spawn to complete the round now, although more than necessary may spawn.\r\n-Ending should work.\r\n-5 rounds before ending instead of 10.\r\n-Player can no longer kill their own soldiers.\r\n-Courier should work and not break the game.\r\n\r\n\r\nVideo by Saiodin:\r\n[youtube]JDptuehsfo4[/youtube]\r\n\r\nVideo by l1nkown:\r\n[youtube]Lpm3wzVCVxc[/youtube]\r\n\r\nVideo by Rooster Teeth:\r\n[youtube]b6XZW7QuKio[/youtube]\r\n\r\n\r\nInstructions: \r\n\r\nThere is a boat in Northern Dawnstar. You should be able to fast travel directly to it. The boat will take you to an island that serves as the main playing area for this mod. Alternatively, you can start a mini quest by finding the courier\\'s body outside of the Whiterun Stables. If you have a follower, they will come to the island and will be upgraded with you.\r\n\r\n\r\nGameplay: \r\n\r\nDefend your castle against waves of enemies. Upgrade your castle, hire soldiers, upgrade soldiers, gather resources, buy barricades, and upgrade your own weapons and armor. \r\n\r\nYou can fully customize the gameplay via a menu labeled \\'-UCD Configuration-\\' under Armor. You can customize the enemy type, change round settings (round total, max alive, increment, etc), change difficulty, add game modifiers, toggle dragon bosses, change the weather, and enable or disable the tower defense gamemode. In order to unlock most of the menu, you must beat the initial 5 rounds.\r\n\r\nAfter completing the initial 5 rounds, you can receive a demo of my upcoming \\'Sandbox\\' mod. This demo lets you place furniture and tamed creatures (that follow you upon activation). You get it by entering the castle in the basement of Leo\\'s House.\r\n\r\n\r\nBugs: \r\n\r\nKeep in mind that this is a beta, and there will be bugs. I will be updating this mod and adding new features all the time, so keep an eye out. If you wish to report a bug, please do so on the forums at http://www.zombiegamer.net/ucd.php or email me at cahard08@cardmail.louisville.edu.\r\n\r\nSome known bugs include:\r\n\r\n-Upgrading armor and weapons after buying back original items may cause certain weapons and armor to be removed.\r\n-You will be charged twice if you upgrade to the same thing twice.\r\n-Balancing still needs some work. Mages are a bit overpowered.\r\n-Attackers may be a little slow noticing barricades.\r\n-Some other stuff I\\'m forgetting.\r\n\r\n\r\nThanks:\r\n\r\nThanks for the support everyone, and thanks for putting up with all my BS! I honestly didn\\'t mean to lie about the release date so many times, but things went wrong and bugs needed to be fixed.\r\n\r\nI\\'ve put in a lot of hours making this, so I hope you enjoy it! I\\'ve pretty much been working on it without ANY sleep the past couple of days.. In fact, I\\'m about to pass out as I write this.. :P",
  "categoryId": "24",
  "version": "1.5",
  "author": "TittyKitty",
  "createdUnix": "1336271148",
  "updatedUnix": "1337212931",
  "containsAdultContent": false,
  "uploadedBy": "TittyKitty",
  "primaryFile": null,
  "files": [
    {
      "fileId": "59926",
      "name": "Ultimate Castle Defense OLD",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10205",
      "fileName": "Ultimate Castle Defense OLD-16539.zip",
      "uploadedUnix": "1336547197",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/2a9b61649d0bc8ac0720fee6a2100f71e3722f2faaac29a1d9e3017fec7e45ac/analysis/1406879778/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ultimate%20Castle%20Defense%20OLD-16539.zip?fid=59926&ttl=1535781782&ri=8192&rs=8192&setec=d829369631f9d7e2155e2f34b8c1736d"
    },
    {
      "fileId": "61743",
      "name": "Ultimate Castle Defense",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9864",
      "fileName": "Ultimate Castle Defense-16539-1-5.zip",
      "uploadedUnix": "1337212931",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/f7e12790502590eac125b29fdf4a75a3024a81327de50110cb07760a8d6b7613/analysis/1406897228/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ultimate%20Castle%20Defense-16539-1-5.zip?fid=61743&ttl=1535781783&ri=8192&rs=8192&setec=7231487046c8f764ce4ac2b7328be187"
    }
  ]
}