{
  "modId": 16534.0,
  "modName": "Sunrise Retreat",
  "summary": "Places a Player home overlooking Rorikstead.",
  "descriptionHtml": "Sunrise Retreat\r\n\r\nSunrise Retreat is my wife’s house mod just up the hill from Rorikstead.  She made it specifically to her tastes and for her needs.  Sunrise Retreat is a smaller, lore friendly home that has all of the crafting amenities, a library, and places for the horse and dog.  This home is follower friendly and all of the containers both inside and outside are safe and do not respawn. It is fully furnished with a few rooms and finished basement and no loading screens. Also a working Mara and Arkay shrine. The key is hidden on the property of this pretty gem.\r\n\r\n======\r\nThis is my wife’s first ever mod for ANY game she has ever played. She learned the CK, watched videos, and worked on this for 2 weeks just because she wanted “her” house for Skyrim. I am so proud of her.\r\n\r\nThe house is modeled after Honeyside, but that is where the similarities stop. She has scoured over every inch of this home inside and out. Attention to detail was a foremost, fixing any little bug she can find, tweaking this and that. She has even gone and recreated the outside part of the house from scratch! Why, because some times the house would show up, sometimes not, even with LOD checked, also the default Honeyside model has a roofed style skylight, which the inside does not reflect.\r\nThis was a joy for her, sometimes frustrating, and a joy for me to watch her mod for the first time.\r\n\r\n====\r\nNote from my Wife :)\r\nHello everyone!  E2B2’s wife here and I’d like to personally thank you all for your support of my very first mod!  My main goal is to make my house feel like a functional, modest home where you have a reason to move through the rooms and enjoy the view on the way.  Of course I have an ace up my sleeve, so to speak, because I’m able to bounce my ideas off my very loving and supportive husband whom I absolutely adore.\r\n====\r\n\r\nMods in screenshots:\r\nFXAA Vanilla Enhanced by jellinn (http://skyrim.nexusmods.com/downloads/file.php?id=384)\r\n   or\r\nFXAA Post Process Injector by some_dude Option 3 (http://skyrim.nexusmods.com/downloads/file.php?id=131)\r\nSexy Riften v2 by horrorview (http://skyrim.nexusmods.com/downloads/file.php?id=7241)\r\nSexy Villages and Towns by horrorview (http://skyrim.nexusmods.com/downloads/file.php?id=7583)\r\nColorful Lights - No Shadows - More FPS by TRoaches (http://skyrim.nexusmods.com/downloads/file.php?id=10789)\r\nAnd a Big thank you to Modders Resource-Weapon Racks-Bookshelves-Plaques-Mannequins by Eldiabs (http://skyrim.nexusmods.com/downloads/file.php?id=11618)\r\n\r\nv1.00: Release\r\nv1.01: Front Door Fixed. Placed Bones on the Dog Bed. Put a Safe in the Bedroom.\r\nv1.02: Noticed a minor offset in a interior wall causing a sliver of \\\"void\\\" to be visible.\r\n\r\nBug:\r\nCreepy mannequin strikes a pose.\r\n",
  "categoryId": "67",
  "version": "1.02",
  "author": "E2B2",
  "createdUnix": "1336267133",
  "updatedUnix": "1337031825",
  "containsAdultContent": false,
  "uploadedBy": "epbreen",
  "primaryFile": null,
  "files": [
    {
      "fileId": "61345",
      "name": "main",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "111",
      "fileName": "main-16534-1-02.7z",
      "uploadedUnix": "1337031825",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/323a49e7901cd00e7354fa781f7a5ddf49281499e526bb622820ab02c6258a89/analysis/1406892728/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/main-16534-1-02.7z?fid=61345&ttl=1535781776&ri=8192&rs=8192&setec=0b41a48528113b50eb122e735b85fae0"
    }
  ]
}