{
  "modId": 16553.0,
  "modName": "Harvest Overhaul",
  "summary": "Ever wondered what happens to the other 2 Deathbells after you harvest them, or 5 Nightshades, or a dozen of Flowers? Where do they go if you only harvest one, does the Dragonborn throw them away? Do you want to get an appropriate amount after you harvest flora, but at the same time keep the game balanced? If yes, then this is the mod for you&#33;",
  "descriptionHtml": "[b][color=#6d9eeb][u]Update - 6th of May, 2017[/u] - It&#39;s been 5 years since the upload of this mod. I am very grateful for the attention it has received and I thank everyone who took their time to try it out. I can safely say that I will not be coming back to update it for any reason for I no longer have an interest in Skyrim or modding as a whole. I am not sure whether Xubarku will be active in any way either - a big thanks to him for making important updates to the mod.\r<br />\r<br />With that said, it&#39;s time for me to update the permissions - feel free to use any assets from this mod in your own work, make any updates/bug fixes, or make your own variations of this mod [/color][/b][b][color=#6d9eeb]if you&#39;re uploading to the Nexus (however, if an asset from this mod is originally from another mod, you might have to check permissions of that mod also). Send me a link via private messaging, I&#39;d love to see what you guys come up with.\r<br />\r<br />-Omeletter[/color][/b][b][color=#6d9eeb]\r<br />[/color]\r<br />\r<br />[color=#ffa500]This mod is featured on Skyrim GEMS&#33;[/color][/b] \r<br />\r<br />[url=http://www.skyrimgems.com/][img]http://www.skyrimgems.com/images/gems_logo.png[/img][/url]\r<br />\r<br />[img]http://static2.nexusmods.com/15/mods/110/images/16553-1-1336300594.jpg[/img]\r<br />\r<br />[color=orange][b]=Description=[/b][/color]\r<br />Have you ever wondered what happens to the other two Deathbells after you harvest it, or five Nightshades, or a dozen of Mountain Flowers? Where do they go if you only harvest one, does the Dragonborn throw them on the floor and walks away? Do you want to get an appropriate amount after you harvest flora, but at the same time keep the game balanced? If yes, then this is the mod for you.\r<br />\r<br />Harvest Overhaul is probably the only mod of its kind. This mod allows you to harvest a realistic amount of ingredients, while keeping the balance of Skyrim, and not conflicting with other mods. Every plant and flower (but not ingredients) has been tweaked to yield a realistic amount of ingredients, but with the element of luck. This mod also allows you to gain a surplus of ingredients if you harvest everything in sight, while in Vanilla harvesting everything on sight was a requirement if you wanted to level your Alchemy without visiting shops or training.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/33296/]I also recommend the mod Harvesting Animation for added immersion and realism.[/url]\r<br />\r<br />Harvest Overhaul also takes the size of the plant into consideration. For example, you can get up to 5 mountain flowers from a single bush, the minimum being 1. You can harvest up to 12 mountain flowers from a cluster of 3 bushes, with the minimum being 3. The yield most of the times is consistent, and generally around, or below half of maximum yield. Receiving 4-8 Mountain flowers is quite common. \r<br />\r<br />Two optional modes which reduce yields harvested per plant are available. The &#34;lite mode&#34; reduces all flora by half, excluding plants with a max yield of two. The &#34;pseudo lite mode&#34;, on the other hand, only reduces the yields of spiky grasses and mountain flowers, which have the highest yields of all plants species. The two modes can be used simultaneously.\r<br />\r<br />The chance of yielding the maximum amount of ingredients can be increased with the &#34;Green Thumb&#34; alchemy perk. The perk usually doubles (or even a bit more) the chance of receiving the maximum amount of ingredients. Whether that makes the perk more useful than Vanilla or less depends on what ingredients you&#39;re harvesting.\r<br />\r<br />If you&#39;re not sure if Green Thumb perk is functioning correctly, type in &#34;GetGlobalValue HarvestOverhaulPerk&#34; in the console (without quote marks). If the value is 0, then Green Thumb perk is not taking effect, if the value is 1, then the effect of Green Thumb is applied correctly.\r<br />\r<br />If you want to find out more about chances and amounts of harvesting certain ingredients before using this mod, download the optional &#34;Data Tables&#34; and look through them. They show the chance of harvesting each ingredient from a plant, and the amount you could possibly harvest. However, the tables and readmes are already included with the main file, just look through the archive.\r<br />\r<br />[b]Version 2.0 now features [color=orange]Dawnguard[/color] and [color=orange]SkyRe[/color] support&#33;[/b]\r<br />[b]Version 2.5 now features [color=orange]Dragonborn[/color] support&#33;[/b]\r<br />[b]Version 2.8 now features [color=orange]MCM[/color] support&#33;[/b]\r<br />\r<br />\r<br />[img]http://static2.nexusmods.com/15/mods/110/images/16553-2-1336300596.jpg[/img]\r<br />\r<br />[color=orange][b]=Harvest Overhaul - Creatures=[/b][/color]\r<br />Harvest Overhaul - Creatures is a separate mod in the same style, but for Creatures. I made it so this mod has a lesser element of luck, and more realism. It is standalone from Harvest Overhaul, meaning Harvest Overhaul is not required to run this mod. This mod affects &#34;Death Lists&#34; of creatures and a few containers, rather than flora, meaning there are possible conflicts. This was the main reason to keep it separate.\r<br />\r<br />Some general themes:\r<br />\r<br />- I have removed random gold and gems on animals. I am not a huge fan of the ability to kill a bear and pull 9 Septims out of its ass.\r<br />\r<br />- If an animal should logically have something, it does. You can now get spriggan sap from spriggans, and can loot up to four tusks off of a mammoth.\r<br />\r<br />- There are exceptions, but usually you at least have a chance (varies depending on the creature) to get more than one of an item from a creature. Again, this is done with a certain logic. Hawks will have multiple feathers, rabbits have two (hind)legs, but deer will always only have one set of antlers.\r<br />\r<br />Please see the data tables for a complete list of changes and optional features.\r<br />\r<br />As of version 2.0, there is an optional file with Dawnguard support&#33; Since Dawnguard has similar enemies to the vanilla game, e.g Bonemen = Skeletons, Vale Sabrecat = Sabrecat, etc. the drops are quite similar to what has been said above. Other changes include removing random money from creatures that obviously couldn&#39;t have had it, like Chaurus Hunters, or again, Deer.\r<br />\r<br />As of version 2.5, there is Dragonborn support&#33;\r<br />\r<br />\r<br />\r<br />[color=orange][b]=Installation=[/b][/color]\r<br />I strongly recommend using the Nexus Mod Manager to install this and every other mod out there. You will be presented with a menu where you can choose what files to install. To be safe from any conflicts, load the .esp files after any others that could possibly change flora.\r<br />\r<br />The use of BOSS is recommended to resolve load order conflicts, but does not necessarily guarenteed perfection. TES5edit can be used to trouble shoot any issue, and failing that, please feel free to make a post on the forum.\r<br />\r<br />An [b][color=orange]important[/color][/b] note. To get full use of all features and options, the [url=http://skse.silverlock.org/]Skyrim Script Extender (SKSE)[/url] and [url=http://www.nexusmods.com/skyrim/mods/3863/]SkyUI[/url] are required.\r<br />\r<br />Additionally, Harvest Overhaul requires the use of the [url=http://www.nexusmods.com/skyrim/mods/19/]Unofficial Skyrim Patch[/url], [url=http://forums.nexusmods.com/index.php?/topic/981701-critter-script-bugfix/]Steve40&#39;s critter script bugfix[/url], [b]or[/b] the [url=http://www.nexusmods.com/skyrim/mods/31268/]Flora Respawn Fix[/url] for salmon to be correctly harvested. I personally use the latter, as it also decouples flora respawns and cell resets, allowing plants to regrow without forcing you to avoid a cell for X amount of days so it can reset. That said, any of those mods will work fine. Just make sure you have one.\r<br />\r<br />\r<br />\r<br />[color=orange][b]=Uninstallation=[/b][/color]\r<br />Just remove the .esp  and .bsa files. If you&#39;re uninstalling a version from before 2.8, you will also need to remove loose scripts. There aren&#39;t any permanent glitches caused by the removal of this mod. I again suggest using NMM to do so.\r<br />\r<br />If the mod is not quite to your taste, it would be nice if you posted a comment telling me how to improve this mod.\r<br />\r<br />\r<br />\r<br />[color=orange][b]=Version History=[/b][/color]\r<br />2.8.2 Fixed an issue with the pearl toggle, added a few more lootable items. Kinks with the RND patch should all be ironed out. See 2.8.2 readme for full notes.\r<br />2.8.1 Fixed issue with the installer.\r<br />2.8 Many changes. New loot modes for HO, and new recipes/loot for HOC. Patches updated. See the readmes for more information. MCM menus added.\r<br />2.7.1 - Fixed issue with BAIN/NMM installer.\r<br />2.7 - Dawnguard and Dragonborn only creature plugin added. Dragonborn creature now a standalone. Salmon Roe Optional.\r<br />2.6 - Less cluttered installation, Chicken, Pheasants, and corrected Master File order&#33; Thanks, Xubarku.\r<br />2.5 - Dragonborn support&#33; Thank you Xubarku&#33;\r<br />2.1 - Hearthfire support&#33; Sorry for the long delay.\r<br />2.0 - Dawnguard support&#33; SkyRe support&#33; BAIN Install Support&#33; Minor balance changes in Harvest Overhaul. Snowberries, clams, and potatoes, to be exact.\r<br />1.5 - Changes to Harvest Overhaul Creatures, mostly by request.\r<br />1.1 - Added another option - always a maximum amount of ingredients harvested for Harvest Overhaul.\r<br />1.0 - Mod Uploaded.\r<br />0.1-1.0 - Mod is being worked on, and tested in-game for balance.\r<br />\r<br />\r<br />\r<br />[color=orange][b]=Compatibility=[/b][/color]\r<br />Harvest Overhaul is possibly the only mod out there that does this kind of thing, but Harvest Overhaul Creatures modifies certain death lists of animals, meaning small conflicts can arise with mods that change/add creatures. When in doubt, load this mod at the end of the load order.\r<br />\r<br />\r<br />Mods which do not require patches\r<br />\r<br />- [url=http://www.nexusmods.com/skyrim/mods/16084/]Ars Metallica[/url]: Load BEFORE Harvest Overhaul and Harvest Overhaul Creatures. All incompatibilities will be automatically fixed.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/11163/]Frostfall[/url]: Cured hide recipes are automatically enabled when Frostfall is detected. The stews for HOC will grant the exposure resist buff. Load order does not matter.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/33201/]Hunterborn[/url]: Should be entirely compatible in a couple different ways. Use the HOC MCM menu to disable things you don&#39;t want added, and then fine tune things with the more thorough and compatibility orientated menu of Hunterborn.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/51473/]iNeed[/url]: Full compatibility automatically through iNeed. Load order does not matter.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/31268/]Flora Respawn Fix[/url]: Use the HO version of Flora Respawn Fix, installed as a replacer rather than a patch. Load AFTER HO and install as usual for FRF.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/17416/]Wearable Lanterns[/url]: Some optional recipes can be enabled in HOC for lantern oils and candles. Load order does not matter.\r<br />- Hearthfire: Automatically detected, and the new items are integrated into both HO and HOC. Load order does not matter.\r<br />- Harvest Overhaul Creatures: If both HO and HOC are installed, new items from HOC can be enabled on various flora. For instance, pheasants will have down feathers. Load order does not matter.\r<br />- Dragonborn and Dawnguard: Install the correct version.\r<br />\r<br />\r<br />Mods which require patches\r<br />\r<br />- [url=http://www.nexusmods.com/skyrim/mods/26228/]Realistic Needs and Diseases[/url]: Use the new patch INSTEAD of the RND_AnimalLoot plugin, and load after HOC and RND. If you don&#39;t want the patch for some reason, simply load RND_AnimalLoot after HOC instead, and disable the appropriate settings in HOC.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/9286/]SkyRe[/url]: Fixes Green Thumb conflict. Make sure the patch is loaded after both SkyRe and HOC.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/23771/]skyBirds[/url]: Again, just make sure the patch is after both skyBirds and HOC.\r<br />- [url=http://www.nexusmods.com/skyrim/mods/10639/]Imp&#39;s More Complex Needs[/url]: New meats and food not really supported. I&#39;m waiting on the new version of Imp&#39;s to be released, which hopefully is soon. I&#39;ve been waiting a long time for that version. Rest assured that when it comes out, making a patch will be a high priority for me (Xubarku). \r<br />\r<br />The patch currently available fixes an issue with recipe and loot yields. If not touched, you could end up making up to 48 cuts of cooked meat from a single horker&#33; Load this after IMCN to fix the issue.\r<br />\r<br />If you find a compatibility issue, then please notify me, and I will try to resolve it.\r<br />\r<br />\r<br />\r<br />[color=orange][b]=Translations=[/b][/color]\r<br />Since Harvest Overhaul edits harvestable flora, the naming of it stays in English no matter what language version of Skyrim you are using. Harvest Overhaul Creatures doesn&#39;t have this problem, as it doesn&#39;t touch animals in any way.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/31655]German Translation by Verodor[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/18051]Spanish Translation by LuncV[/url]\r<br />\r<br />[url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/recolte_amelioree.php]French Translation by Oaristys[/url]\r<br />[url=http://www.confrerie-des-traducteurs.fr/forum/viewtopic.php?t=12487]French Forum Page[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/46190/]Czech Translation by Khenyk[/url]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/48838/]Brazilian Portuguese Translation by BrawlM1[/url]\r<br />\r<br />\r<br />\r<br />[color=orange][b]=Special Thanks=[/b][/color]\r<br />Thanks to fg109 for helping me out with the scripting&#33; Without his help, I wouldn&#39;t have gotten the Green Thumb perk to function as I intended it to.\r<br />A massive thank you to Xubarku for creating the Dragonborn compatibility patches and answering user questions in the comments&#33; Thank you&#33;\r<br />Thanks to Brumbek for letting me look through his FOMod file so I could make the NMM install menu&#33;\r<br />Thanks to Oaristys, LuncV and Verodor for providing translations of this mod&#33;\r<br />Also a big thank you to those who have decided to endorse this mod&#33;\r<br />\r<br />\r<br />\r<br />[color=orange][b]=Permission=[/b][/color]\r<br />Do not reupload this mod or parts of it on the Nexus or any other site&#33; (Contact me first through a PM here on the Nexus) However, if you want to make a translated version, then please continue, but only upload it on the Nexus. It would be nice to notify me as well so I could link to it from here.\r<br />\r<br />[b][color=#6d9eeb][u]Update - 6th of May, 2017[/u] - Please read the notice at the top of this page - permissions have been updated.[/color][/b]\r<br />\r<br />\r<br />\r<br />[color=orange][b]=Other=[/b][/color]\r<br />You can make a difference to this mod&#33; Please comment if you have any ideas and suggestions, or if you found something unbalanced. I will be happy to fix issues and I will make some optional versions if requested.",
  "categoryId": "94",
  "version": "2.8.2.0",
  "author": "Omeletter and Xubarku",
  "createdUnix": "1336300511",
  "updatedUnix": "1391975588",
  "containsAdultContent": false,
  "uploadedBy": "Omeletter",
  "primaryFile": null,
  "files": [
    {
      "fileId": "59140",
      "name": "Harvest Overhaul 1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "39",
      "fileName": "Harvest Overhaul 1-0-16553.rar",
      "uploadedUnix": "1336301477",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b7a72fcafc756efe5e6c22e8f5079375a558947e80b594075b0c7cd12b73806f/analysis/1406871244/",
      "changelogHtml": " Mod Uploaded. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harvest%20Overhaul%201-0-16553.rar?fid=59140&ttl=1535781810&ri=8192&rs=8192&setec=58d7e522039fb3cae48f773399e87f3a"
    },
    {
      "fileId": "60702",
      "name": "Harvest Overhaul 1-1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "47",
      "fileName": "Harvest Overhaul 1-1-16553-1-1.rar",
      "uploadedUnix": "1336815553",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4cf770fb28338fa25e5f899e6e598788b8e856a8b71afacad526d0291ce64afe/analysis/1406886724/",
      "changelogHtml": " Added another option - always a maximum amount of ingredients harvested for Harvest Overhaul. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harvest%20Overhaul%201-1-16553-1-1.rar?fid=60702&ttl=1535781810&ri=8192&rs=8192&setec=dd3587d556053da93f14645043f526cd"
    },
    {
      "fileId": "71423",
      "name": "Harvest Overhaul 1_5",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "46",
      "fileName": "Harvest Overhaul 1_5-16553-1-5.rar",
      "uploadedUnix": "1341146650",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/e162721fa4a52f2d09eaa8e11f9e87cdc027a9e2af71a64d90d23d4f928113bd/analysis/1406993893/",
      "changelogHtml": " Changes to Harvest Overhaul Creatures, mostly by request. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harvest%20Overhaul%201_5-16553-1-5.rar?fid=71423&ttl=1535781811&ri=8192&rs=8192&setec=f5a6e0a3db16071597d71f958655c6fd"
    },
    {
      "fileId": "85762",
      "name": "Harvest Overhaul 2_0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "45",
      "fileName": "Harvest Overhaul 2_0-16553-2-0.rar",
      "uploadedUnix": "1346516792",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/6d9e71e9b4c715638ce5446dc8d631bbb40811cc370a3448c025222d40e4c8e9/analysis/1407138664/",
      "changelogHtml": " Dawnguard support&#33; SkyRe support&#33; BAIN Install Support&#33; Minor balance changes in Harvest Overhaul. Snowberries, clams, and potatoes, to be exact. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harvest%20Overhaul%202_0-16553-2-0.rar?fid=85762&ttl=1535781811&ri=8192&rs=8192&setec=399040dfdcf4152a77baab6f2840a025"
    },
    {
      "fileId": "107839",
      "name": "Harvest Overhaul 2_1",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "48",
      "fileName": "Harvest Overhaul 2_1-16553-2-1.rar",
      "uploadedUnix": "1356614225",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/c8a1d74cb10f90930dc297980f1fa73ac9a5a42491e5219a14bb108d5ea958a9/analysis/1407324366/",
      "changelogHtml": " Hearthfire support&#33; Sorry for the long delay. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harvest%20Overhaul%202_1-16553-2-1.rar?fid=107839&ttl=1535781811&ri=8192&rs=8192&setec=546a7cb6ec1c6b011cc817b04dc52edd"
    },
    {
      "fileId": "1000017956",
      "name": "Harvest Overhaul 2_5",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "52",
      "fileName": "Harvest Overhaul 2_5-16553-2-5.rar",
      "uploadedUnix": "1363436646",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/26b170f1a2be41e867329aff1b9aae8b6a66d17c2e2186c292a60830872bd07a/analysis/1407472745/",
      "changelogHtml": " Dragonborn support&#33; Thanks to Xubarku for making the patches&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harvest%20Overhaul%202_5-16553-2-5.rar?fid=1000017956&ttl=1535781812&ri=8192&rs=8192&setec=e3080ba7bb62fdd5e6845d2fcd24128b"
    },
    {
      "fileId": "1000017957",
      "name": "ReadMe and Data Tables for 2_5",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "27",
      "fileName": "ReadMe and Data Tables for 2_5-16553-2-5.rar",
      "uploadedUnix": "1363436706",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/9953042d8b68aed93e156d565593998b3645c2ea16596dbfae733e4419b73ecb/analysis/1407472745/",
      "changelogHtml": " Dragonborn support&#33; Thanks to Xubarku for making the patches&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ReadMe%20and%20Data%20Tables%20for%202_5-16553-2-5.rar?fid=1000017957&ttl=1535781812&ri=8192&rs=8192&setec=225cd9505f810aa6f2f503c88e165c7d"
    },
    {
      "fileId": "1000019666",
      "name": "Harvest Overhaul 2_6",
      "version": "2.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "91",
      "fileName": "Harvest Overhaul 2_6-16553-2-6.rar",
      "uploadedUnix": "1364038148",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/23a844ab0dadf652b8a311a9d9084bb56006e192bfe47b797baa35c65359154b/analysis/1407484388/",
      "changelogHtml": " Less cluttered installation, Chicken, Pheasants, and corrected Master File order&#33; Thanks, Xubarku. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harvest%20Overhaul%202_6-16553-2-6.rar?fid=1000019666&ttl=1535781813&ri=8192&rs=8192&setec=d9ea7b0e61ac82f5ff207c67458bf083"
    },
    {
      "fileId": "1000024898",
      "name": "Harvest Overhaul 2_7",
      "version": "2.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "38",
      "fileName": "Harvest Overhaul 2_7-16553-2-7.7z",
      "uploadedUnix": "1366174114",
      "modVersion": "2.7",
      "virusScanUrl": "https://www.virustotal.com/file/d308cd2db7b215dd4b0025b4d76b6749ba6a01059db75baf5aa67c7672887005/analysis/1407526265/",
      "changelogHtml": " Dawnguard and Dragonborn only creature plugin added. Dragonborn creature now a standalone. Salmon Roe Optional. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harvest%20Overhaul%202_7-16553-2-7.7z?fid=1000024898&ttl=1535781813&ri=8192&rs=8192&setec=a9324fadadf3d248883a6b2154a77321"
    },
    {
      "fileId": "1000024978",
      "name": "Harvest Overhaul 2_7_1",
      "version": "2.7.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "38",
      "fileName": "Harvest Overhaul 2_7_1-16553-2-7-1.7z",
      "uploadedUnix": "1366216805",
      "modVersion": "2.7.1",
      "virusScanUrl": "https://www.virustotal.com/file/7b60d87b41984d92f5f2b024b42ed8ea9619fdfec0548ad62ed820bb55d5db62/analysis/1407527046/",
      "changelogHtml": " Fixed issue with NMM/BAIN installer. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harvest%20Overhaul%202_7_1-16553-2-7-1.7z?fid=1000024978&ttl=1535781814&ri=8192&rs=8192&setec=7bfdcaa3b718317d5edf3ff1d180cbe4"
    },
    {
      "fileId": "1000036309",
      "name": "SkyRe preDawnguard compatibility patch",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "SkyRe preDawnguard compatibility patch-16553-.7z",
      "uploadedUnix": "1372467685",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0fe9fd5cce3a5ef61422142802f736e379a11152ecfef7045f4e1d41731c74ef/analysis/1407621035/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRe%20preDawnguard%20compatibility%20patch-16553-.7z?fid=1000036309&ttl=1535781814&ri=8192&rs=8192&setec=40b87a4deca74814d2e76b37d055b5b5"
    },
    {
      "fileId": "1000090568",
      "name": "Harvest Overhaul 2_8",
      "version": "2.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "142",
      "fileName": "Harvest Overhaul 2_8-16553-2-8.7z",
      "uploadedUnix": "1389246830",
      "modVersion": "2.8",
      "virusScanUrl": "https://www.virustotal.com/file/8947447c6d0a0cdb63a882df3721b517ffd1ff5854dec291aed68b3f549b1a39/analysis/1407878529/",
      "changelogHtml": " Too many to list. Consult the Readmes in the download section. In brief: <br/> \n Optional new harvest modes to control amount of flora. <br/> \n Optional new meats and recipes for Creatures. <br/> \n Updated patches. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harvest%20Overhaul%202_8-16553-2-8.7z?fid=1000090568&ttl=1535781815&ri=8192&rs=8192&setec=ed0d254930945341ab18d63a8bfdc6d4"
    },
    {
      "fileId": "1000090570",
      "name": "Readme and Data Tables for 2_8",
      "version": "2.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "93",
      "fileName": "Readme and Data Tables for 2_8-16553-2-8.7z",
      "uploadedUnix": "1389246967",
      "modVersion": "2.8",
      "virusScanUrl": "https://www.virustotal.com/file/114d1279bc7133f5b642fd0e8734918929d37e420369c23f7a481c97231283a5/analysis/1407878531/",
      "changelogHtml": " Too many to list. Consult the Readmes in the download section. In brief: <br/> \n Optional new harvest modes to control amount of flora. <br/> \n Optional new meats and recipes for Creatures. <br/> \n Updated patches. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Readme%20and%20Data%20Tables%20for%202_8-16553-2-8.7z?fid=1000090570&ttl=1535781815&ri=8192&rs=8192&setec=b6db17079f5f62483323243fe393edec"
    },
    {
      "fileId": "1000090622",
      "name": "Harvest Overhaul 2_8_1",
      "version": "2.8.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "142",
      "fileName": "Harvest Overhaul 2_8_1-16553-2-8-1.7z",
      "uploadedUnix": "1389283232",
      "modVersion": "2.8.1",
      "virusScanUrl": "https://www.virustotal.com/file/33b3210c10950c278336321971d15c4ab8fa1eda54d4ee0f33ef05224b68e63b/analysis/1407878960/",
      "changelogHtml": " I broke the installer. Again. Fixed now. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harvest%20Overhaul%202_8_1-16553-2-8-1.7z?fid=1000090622&ttl=1535781815&ri=8192&rs=8192&setec=fb748a84ed9b3419e05a60118835f75b"
    },
    {
      "fileId": "1000095987",
      "name": "Readme and Data Tables for 2_8_2",
      "version": "2.8.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "109",
      "fileName": "Readme and Data Tables for 2_8_2-16553-2-8-2.7z",
      "uploadedUnix": "1391910985",
      "modVersion": "2.8.2",
      "virusScanUrl": "https://www.virustotal.com/file/ca42790696a4b4fc5d65c86c8deb72e0015a4e1d64ba6a5b1d83f9de3ab07ca0/analysis/1407924855/",
      "changelogHtml": " Fixed multiple issues with the RND patch. <br/> \n Overhauled how pearls were given/fixed pearl globals. <br/> \n Tweaked chances for human flesh. <br/> \n Added a couple more harvestable containers. <br/> \n Other stuff. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Readme%20and%20Data%20Tables%20for%202_8_2-16553-2-8-2.7z?fid=1000095987&ttl=1535781816&ri=8192&rs=8192&setec=2d4e3a6c5deb2f944eb447aaff98d24c"
    },
    {
      "fileId": "1000095988",
      "name": "Harvest Overhaul 2_8_2",
      "version": "2.8.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "160",
      "fileName": "Harvest Overhaul 2_8_2-16553-2-8-2.7z",
      "uploadedUnix": "1391911144",
      "modVersion": "2.8.2",
      "virusScanUrl": "https://www.virustotal.com/file/89e0294585e39b7703ca2968df9bf2f9526b622001e9fd949bd955a7665c27b8/analysis/1407924857/",
      "changelogHtml": " Fixed multiple issues with the RND patch. <br/> \n Overhauled how pearls were given/fixed pearl globals. <br/> \n Tweaked chances for human flesh. <br/> \n Added a couple more harvestable containers. <br/> \n Other stuff. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harvest%20Overhaul%202_8_2-16553-2-8-2.7z?fid=1000095988&ttl=1535781816&ri=8192&rs=8192&setec=761b3b7ea51f3cef3a31a9947632edf8"
    },
    {
      "fileId": "1000096161",
      "name": "Harvest Overhaul 2_8_2_0",
      "version": "2.8.2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "159",
      "fileName": "Harvest Overhaul 2_8_2_0-16553-2-8-2-0.7z",
      "uploadedUnix": "1391975588",
      "modVersion": "2.8.2.0",
      "virusScanUrl": "https://www.virustotal.com/file/d7b561e023a1258f34a3aed5fcec80277ec589ef9cb0db871297a13e60165a34/analysis/1407926462/",
      "changelogHtml": " Fixed issue with master list for Harvest Overhaul - Dawnguard. No other changes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harvest%20Overhaul%202_8_2_0-16553-2-8-2-0.7z?fid=1000096161&ttl=1535781817&ri=8192&rs=8192&setec=670c97e97795b0c951034991b1e1969a"
    }
  ]
}