{
  "modId": 16580.0,
  "modName": "IMAGINATOR - Outil de controle visuel - Traduction francaise",
  "summary": "Modifiez absolument toutes les teintes et variations de couleurs dans votre jeu.",
  "descriptionHtml": "All credits goes to MGE for his work. I\\'ve just translated his mod.\r\n\r\nCe mod est une traduction du mod \\\"[url=http://skyrim.nexusmods.com/downloads/file.php?id=13049]IMAGINATOR - Visual Control Device[/url]\\\" par MGE, tous les mérites lui reviennent donc.\r\n\r\n\r\n[b][u]Qu\\'est-ce qu\\'IMAGINATOR ?[/b][/u]\r\n\r\n\r\nIMAGINATOR est un stand-alone, c\\'est-à-dire qu\\'il peut être utilisé seul, c\\'est aussi outil de modification d\\'image, mais directement en jeu.\r\n\r\nIl vous permet de contrôler divers éléments comme la Luminosité, Contraste, Saturation, la luminosité du ciel, les rayons du soleil, le flou et la teinte tout en ayant un menu facile à naviguer.\r\nJamais auparavant vous n\\'avez eu tant de pouvoir ! Sérieusement.\r\n\r\n[u][b]Qu\\'est-ce que ça fait ? [/b][/u]\r\n\r\n\r\nDès l\\'activation du mod, vous obtiendrez un sort qui se nomme \\\"Invoquer IMAGINATOR\\\". Assignez le sort à une main et utilisez-le.\r\n\r\nVous avez 4 OUTILS dans le menu d\\'IMAGINATOR :\r\n\r\nCONTRASTOR : Fourni des ajustements progressifs de LUMINOSITÉ, CONTRASTE et de SATURATION. Considérez cela comme le \\\"tout-en-un\\\" où vous pouvez ajuster nos préréglages à votre goût.\r\n\r\nTEINTOR : Ajoute un assortiment d\\'options de couleurs en vous permettant un contrôle complet sur l\\'ajout de ROUGE, VERT, BLEU, JAUNE, ORANGE, MAGENTA et CYAN !\r\n\r\nCINEMAGIC: Prenez vous pour \\\"Dieu\\\" en ayant un contrôle total sur la LUMINOSITÉ du ciel, la puissance des RAYONS SOLAIRES (et lunaires) ainsi que sur le FLOU de l\\'image globale.\r\n\r\nMODÈLES DE COULEURS PRÉDÉFINIS : 9 palettes de couleurs prédéfinies complexes pour améliorer le ton (plus à venir!). Les pré-réglages sont empilables et combinables pour des combinaisons infinies. Nous avons fourni une belle gamme de pré-réglages, à vous de choisir. Utilisez-les «tel quel» ou améliorez-les et ajustez-les à l\\'aide de CONTRASTOR, Teintor et / ou CINEMAGIC !\r\n\r\nToutes les options sont empilables. Cliquez une fois pour un ajustement mineur, cliquez à nouveau pour augmenter, et à nouveau pour augmenter encore plus!\r\n\r\nMélanger, tester et profitez-en !\r\n\r\nVous pouvez désactiver tous les effets dans le menu principal, ou vous pouvez désactiver les effets de chaque outil séparément.\r\n\r\n[b][u]EFFETS COMBINABLES, vous dîtes ?[/b][/u]\r\n\r\nOuaip.\r\n\r\nLes effets présent dans chaque partie du menu sont COMBINABLE les uns avec les autres et vous permettent en parallèle de contrôler l\\'image de vôtre jeu. Utilisez-en un ou tous en même temps.\r\n\r\nTrop brillant ? Assombrissez.\r\nTrop de contraste ? Baissez-le.\r\nPas assez de couleur ? Ajoutez un peu de saturation.\r\nNos préréglages vous plaisent mais sont trop colorés ? Ce sont des bases pour vous aider à travailler l\\'image ! Diminuer un peu la saturation.\r\n\r\nJe ne suis pas mathématicien, mais c\\'est presque une quantité infinie de possibilités, et tout ça à partir d\\'un menu charmant et commode. \r\n\r\n[b][u]ET NIVEAU COMPATIBILITÉS ?[/b][/u]\r\n\r\nBon, voici le deal avec IMAGINATOR :\r\n\r\nVeuillez prêter attention :)\r\n\r\nIMAGINATOR fonctionnera avec presque n\\'importe quel mod et ne nécessite aucun pré-requis.\r\n\r\nIMAGINATOR fonctionnera avec les ENB. Cependant, il y a bien trop de \\\"variations\\\" d\\'ENB pour nous permettre de toutes les tester.\r\n\r\nIMAGINATOR fonctionnera également avec le FXAA activé. Il faudra probablement travaillé les injecteurs, mais encore une fois, trop nombreux à tester.\r\n\r\nIMAGINATOR fera des merverilles avec \\\"Realistic Lightning\\\" ...et c\\'est même hautement recommandé de les combiner.\r\n\r\nIMAGINATOR utiliser les ajustements d\\'image EN JEU, et en tant que tel, il lui faudra très peu de mémoire. IMAGINATOR est vraiment un bonheur pour votre FPS.\r\n\r\nBien qu\\'IMAGINATOR est mod qui ne pose pas de problème, n\\'oubliez pas de faire des sauvegardes régulières et de sauvegarder avec d\\'activer n\\'importe quel mod !\r\n\r\nSi vous avez une incompatibilité avec un mod, veuillez nous le faire savoir dans la section commentaires et nous verrons de quoi il en retourne. Une chose à faire avant de signaler une incompatibilité serait d\\'inverser les mods contradictoires possibles dans l\\'ordre de chargement. Si vous voyez que ça fonctionne, faites-le nous savoir que nous puissions en informer les autres.\r\n\r\nSi vous n\\'avez pas reçu le SORT au démarrage du mod, vous pouvez vous le donner vous-même en entrant un code dans la console. Entrez ce code : \\\"player.addspell 01000D75\\\" (Sans les guillemets). Je ne l\\'ai pas essayé, mais c\\'est le FORMID du sort que vous avez besoin.\r\n\r\n\r\n[b][u]TROP D\\'OPTIONS ?[/b][/u]\r\n\r\nAllons donc! Mais soyez prévenus:\r\n\r\nIMAGINATOR vous offre tellement d\\'options que vous pouvez vous retrouver à regarder les nuages &#8203;&#8203;pour un peu trop longtemps. Ha !\r\n\r\nChaque mod météo interagit différemment avec ces paramètres , afin de choisir ce qui vous plaît !\r\n\r\n\r\n[b][u]TRÈS BIEN ! PAR OÙ DOIS-JE COMMENCER ?[/b][/u]\r\n\r\nVoici ce que je recommande.\r\n\r\nChoisissez premièrement votre PRE-REGLAGES (Si vous le souhaitez). les PRE-REGLAGES offrent une plus grande \\\"complexité\\\" de couleur, et vous permet de contrôler les teintes d\\'ombres et de surbrillance. Si vous souhaitez une PRE-REGLAGES un peu plus prononcé, cliquez à nouveau.\r\n\r\nEnsuite mélangez à volonté avec CONSTRASTOR.\r\n\r\nSi vous voulez un peu de couleur supplémentaire, allez dans TEINTOR.\r\n\r\nEt si vous voulez voir quelque chose de magique, ajuster le CIEL, les RAYONS SOLAIRES et expérimentez avec CINEMAGIC pour couronner le tout !\r\n\r\nVous n\\'êtes pas OBLIGÉ de procéder ainsi, mais si vous souhaitez des conseils, là vous en avez.\r\n\r\n\r\n[b][u]ORDRE DE CHARGEMENT :[/b][/u]\r\n\r\nEn théorie, IMAGINATOR peut aller n\\'importe où. Dans la pratique, je l\\'ai mis après tout le reste.\r\n\r\n\r\nMISE A JOUR à partir de versions précédentes : Rappelez-vous, il est toujours préférable de mettre à jour en utilisant une sauvegarde propre. Un environnement propre ainsi qu\\'une sauvegarde propre avant la première utilisation du mod est vivement conseiller. C\\'est le mieux pour la plupart des mods, à mon avis.",
  "categoryId": "62",
  "version": "V1C",
  "author": "Deldwath",
  "createdUnix": "1336327016",
  "updatedUnix": "1336327077",
  "containsAdultContent": false,
  "uploadedBy": "Deldwath",
  "primaryFile": null,
  "files": [
    {
      "fileId": "59281",
      "name": "IMAGINATOR - Outil de controle visuel",
      "version": "V1C",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "58",
      "fileName": "IMAGINATOR - Outil de controle visuel-16580-V1C.7z",
      "uploadedUnix": "1336327077",
      "modVersion": "V1C",
      "virusScanUrl": "https://www.virustotal.com/file/ed2fb74609bf064051361d0b27c71038c85d35ad9cae6a33fa72b8ed510e347c/analysis/1406872804/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/IMAGINATOR%20-%20Outil%20de%20controle%20visuel-16580-V1C.7z?fid=59281&ttl=1535781869&ri=8192&rs=8192&setec=4f62baa56fac010c0a587ca001a9d42c"
    }
  ]
}