{
  "modId": 16609.0,
  "modName": "Sigilo Realista",
  "summary": "Este mod hace más difícil ser realmente sigiloso, necesitando especializarse en ello para lograr resultados.",
  "descriptionHtml": "SIGILO REALISTA\r\nAutor: Greeny\r\nVersión: 1.0\r\n\r\nDESCRIPCIÓN:\r\n===========\r\nSe han rebalanceado el sistema de sigilo para que, a la hora de querer pasar desapercibido, tenga bastante más importancia diversos detalles: el peso de la armadura, el ruido provocado por el personaje, la iluminación de la zona… Los NPCs podrán verte a mayor distancia, así que cuidado con los vigías.\r\n\r\nCon estas variaciones, si quieres que tu personaje sea realmente sigiloso, prepáralo para ello con equipo ligero, y sigue cierta lógica, buscando las sombras, evitando las líneas de visión y el ruido. Y, por supuesto, mejorando Discreción, cuyo valor se convierte en fundamental con este mod.\r\n\r\nPor otro lado, se ha resuelto una de las absurdeces más grandes del juego. ¿No estás cansado de que, tras matar sigilosamente a un enemigo, su compañero mire a un lado a otro durante unos segundos para acabar culpando al viento o a su imaginación de lo ocurrido? A partir de ahora, los enemigos estarán muchísimo más tiempo alerta tras ver a un caído, tras ser atacados o tras verte. Te buscarán con más ahínco, así que procura ser realmente sigiloso y planear bien tus ataques si no quieres ser descubierto.\r\n\r\nFinalmente, olvídate de las indicaciones que te avisan si has sido detectado o no. Tendrás que estar alerta, tanto a los movimientos como a los sonidos, para saber cuándo estás en peligro.\r\n\r\n\r\nINSTALACIÓN:\r\n===========\r\n1- Extrae \\\"SigiloReal.esp\\\" en la carpeta Data.\r\n2- Actívalo en el Lanzador del juego.\r\n3- ¡A jugar!\r\n\r\n\r\nDESINSTALACIÓN:\r\n==============\r\n1- Simplemente, borra \\\"SigiloReal.esp\\\" de la carpeta Data.\r\n\r\n\r\nINCOMPATIBILIDADES:\r\n==================\r\nNinguna conocida.\r\n\r\n\r\nBUGS CONOCIDOS:\r\n==============\r\nNinguno.\r\n\r\n\r\nCONTACTO:\r\n========\r\n\\\"Greeny\\\" en los foros de DLAN.\r\n\\\"Greenyaduna\\\" en Skyrim Nexus.\r\n\r\n\r\nPERMISOS:\r\n========\r\nPara cualquier redistribución o uso del mod como parte de otro, contacta con el autor original.\r\nNo olvides citar al autor del mod en cualquier web.\r\n\r\n\r\n-------------------------------------------\r\nENGLISH DESCRIPTION:\r\nHave been rebalanced stealth system so that, when trying to go unnoticed, be far more important points of detail: the weight of the armor, the noise caused by the character, the illumination of the area ... The NPCs may see a greater distance, so watch the watchers.\r\n\r\nWith these changes, if you want your character to be really sneaky, prepare it for it with light equipment, and follows a certain logic, searching the shadows, avoiding the sight lines and noise. And of course, improving Discretion, whose value becomes critical with this mod.\r\n\r\nOn the other hand, it has solved a larger absurdities from the game. Tired about enemies blaming the wind or its imagination of what happened? From now on, the enemies will be much longer alert after seeing a fall after being attacked or after seeing you.\r\n\r\nFinally, forget about the signs that warn you if you have been detected or not. You will have to be alert, as both movements to sounds so you know when you are in danger.",
  "categoryId": "24",
  "version": "1.0",
  "author": "Greeny",
  "createdUnix": "1336347529",
  "updatedUnix": "1353279462",
  "containsAdultContent": false,
  "uploadedBy": "Greenyaduna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "59354",
      "name": "Sigilo Realista",
      "version": "Beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Sigilo Realista-16609-Beta.rar",
      "uploadedUnix": "1336347572",
      "modVersion": "Beta",
      "virusScanUrl": "https://www.virustotal.com/file/0a264dd67b70665998651215c440b4c8ac1b7cd70874dc7ea83820f429935837/analysis/1406873536/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sigilo%20Realista-16609-Beta.rar?fid=59354&ttl=1535781912&ri=8192&rs=8192&setec=225512d9a351a660b064d3d3b1369c04"
    },
    {
      "fileId": "100374",
      "name": "Sigilo Realista 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Sigilo Realista 1_0-16609-1-0.rar",
      "uploadedUnix": "1353279462",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6c4f0dfc260580542a48112e187e1d71a019e334e1ce9ca6e7db0bb2bd83d0cf/analysis/1407268866/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sigilo%20Realista%201_0-16609-1-0.rar?fid=100374&ttl=1535781913&ri=8192&rs=8192&setec=7d124354fd1dc6ec23338d25541f5746"
    }
  ]
}