{
  "modId": 16617.0,
  "modName": "Better Archmage Quarters inside the College of Winterhold",
  "summary": "More cosy quarters and true to the original feel: no more home sounding like a ruin, new mannequins/gallery, small study area, bookshelves, weapon racks, crafting area...",
  "descriptionHtml": "====================================================================================\r<br />BETTER ARCHMAGE QUARTERS by: Karrakaz\r<br />\r<br />v1.5\r<br />\r<br />====================================================================================\r<br />\r<br />\r<br />Hello everyone&#33; I&#39;m glad to finally share with you the modifications I made for my own character&#39;s favorite place to live: the Arch-Mage quarters&#33; Don&#39;t hesitate to leave comments and feedback&#33; Please, read this description, especially the troubleshooting section before reporting any issue in the comments. Thanks.\r<br />\r<br />A French translation is [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/bordeciel/habitations/meilleurs_quartiers_de_larchimage.php]available here[/url], thanks to Clarwarrior.\r<br />\r<br />\r<br />\r<br />\r<br />======================================================================\r<br />\r<br />BETTER ARCH-MAGE QUARTERS FEATURES:\r<br />\r<br />======================================================================\r<br />\r<br />\r<br />This mod aims to provide a more detailed Arch-Mage quarters, hopefully true to original style. I hope this mod feels more like vanilla enhanced and not like &#34;hey, a shiny mod&#33;&#34;. It contains:\r<br /> \r<br />- A smithing area, to support all the battlemages around here, including a tanning rack, an anvil (forge), a workbench and a strongbox + an ingots chest to store your crafting materials ;\r<br />\r<br />- A small study area, with a tiny desk, lectern, and two working activable bookshelves for you to store the documents you&#39;ll find all around Skyrim and a closed bookshelf for all your notes and recipes ;\r<br />\r<br />- In front of the study area, where the original quarters contains shelves filled with food, I added a small cooking pot ;\r<br />\r<br />- Adds display options to Archmage quarters with 8 mannequins, 1 shield rack and 2*5 weapon racks. For people who don&#39;t like the mannequins or their behavior, a no mannequin version is available ;\r<br />\r<br />- All changes made without deleting any original container, so you can install this mod without fear of losing items. No dirty delete of original content. Only a few items were moved out of the quarters and safely disabled ; \r<br />\r<br />- And some other details like :\r<br />\r<br />* changing the ambient music from ruin to tavern sound (not sounding too weird actually, tavern music fits quite well and gives a more homy feeling to the quarters) ;\r<br />\r<br />* the lighting comes from real light source and not from nowhere, except in the tree area where there are the magic lights ; \r<br />\r<br />* adding some decoration on the walls ;\r<br />\r<br />*  I also added on the bed the unhooded version of the Archmage robes, that otherwise can only be obtained using console commands. The vanilla hoodless robes are designed as having less enchantment compared to the hooded version, simply because you can wear a circlet and have another enchantment slot. It&#39;s a balance issue. If you want to change the hoodless robe enchantment, check [url=http://skyrim.nexusmods.com/mods/4360]50 Magicka Hoodless Archmage fix[/url] ;\r<br />\r<br />* Small shrines to Julianos and Akatosh, providing working blessings improving magicka and shouts ;\r<br />\r<br />* Finally, a strongbox has been added to the alchemy lab for ingredient storage. It also now contains an alchemy box and a potion chest. \r<br />\r<br />\r<br />Note: New containers and Arch-Mage unhooded robes are set to be owned by the Arch-Mage faction and don&#39;t respawn (so a player that is not Arch-Mage cannot use them). Mannequins, weapon racks and bookshelves are player owned and don&#39;t require to be Arch-Mage to be used (they are the same than the ones used in player homes). Self control is required here ;)\r<br />And nope&#33; The high level items appearing on the screenshots on mannequins/display racks are not a part of the mod (well, I doubt anyone wondered, but just in case...). \r<br />\r<br />\r<br />I have no other idea for improving this mod. I don&#39;t want to overdo the quarters and break the original feeling of the place. Nonetheless, I&#39;ll do my best to update and fix the mod in case any issue or bug is reported.\r<br />\r<br />\r<br />\r<br />\r<br />========================================================================\r<br />\r<br />INSTALLATION & TROUBLESHOOTING\r<br />\r<br />========================================================================\r<br />\r<br />\r<br />[u]INSTALL/UNINSTALL[/u]\r<br />\r<br />- To install, either use Nexus mod manager button, or download manually the mod, then open the nexus manager and select the &#34;add mod from file option&#34; or put KRZ-BetterArchmageQuarters.esp and .bsa inside your Skyrim/data folder. \r<br />To uninstall, use mod manager or delete the files above in your data folder.\r<br />Don&#39;t forget to activate the mod with NMN, or with a manual install, to make sure to check the mod .esp via Skyrim launcher/data files is properly loaded.\r<br />\r<br />No need for a clean save before or after install. Since version 1.4, the resources used by this mod are packed into a .bsa file, so you won&#39;t have to override any other mod using the same resources, so it&#39;s an easy install and uninstall process ; \r<br />\r<br />TO INSTALL BE SURE TO BE OUTSIDE THE QUARTERS&#33; This is important for the mannequins/bookshelves/weapon racks scripts that otherwise could fail to trigger properly. Or if you are in the quarters, leave the cell then re-enter, this will properly fire the scripts. \r<br />\r<br />If you ever decide to uninstall this mod, don&#39;t forget to take all your loot and items from the storage in the quarters, and save outside the quarters, before uninstalling the mod. If you don&#39;t, any item stored in containers added by my mod will be lost if you don&#39;t take them before uninstalling. \r<br />\r<br />\r<br />[u]RECOMMENDED MODS:[/u]\r<br />\r<br /> - To avoid any wandering/weird moving mannequin, I highly recommend to use [url=http://skyrim.nexusmods.com/downloads/file.php?id=10652]the vanilla mannequin fix[/url] mod by SLucky. I use it (I use the statue option) and all my mannequins work properly (vanilla and modded ones). Your even get the possibility to add poses to the mannequins. This mod nicely solves an original game problem ;\r<br />\r<br />- To fast travel to the quarters, I highly recommend using [url=http://skyrim.nexusmods.com/downloads/file.php?id=2723]Player Home Map Markers[/url] ;\r<br />\r<br />- To further decorate the quarters, you can use the awesome [url=http://skyrim.nexusmods.com/mods/12643]interior decorating[/url] mod by Little Baron. \r<br />\r<br />- To make your followers live there, you can use [url=skyrim.nexusmods.com/downloads/file.php?id=14037]UFO[/url] + [url=http://skyrim.nexusmods.com/mods/18045]Your home is my home[/url] + [url=http://skyrim.nexusmods.com/mods/11370]Spouse can live everywhere[/url]. \r<br />\r<br />\r<br />[u]KNOWN BUGS OR POTENTIAL ISSUES:[/u]. \r<br />\r<br />I have only tested this mod with my Arch-Mage character. It is possible that for other characters, some items might fall on the ground etc. Just pick them if they annoy you. There should be nothing major, the mod works for people having already visited the quarters and for people who visit it for the first time. \r<br />\r<br />I have left untouched all quest markers, so my mod should not interfere with the College questline.  Some users have already reported completing the college questline with no problem with this mod installed. \r<br />\r<br />I have not edited the navmesh, so don&#39;t fear the navmesh bug with this mod (anyway, all mod related navmesh problems should be fixed from patch 1.6 and onwards). I didn&#39;t delete any original content. Simply disabled a very tiny number of items in a safe way. \r<br />\r<br />Sometimes, when entering the quarters, the mannequins might not show the armors you gave them. As I replied to a comment, this a normal vanilla behavior. Seems you didn&#39;t enter the cell for a while, thus setting the respawn trigger, it happened to me once or twice when my character was busy around Skyrim and didn&#39;t visit the quarters for a while. The containers, mannequins and weapons racks don&#39;t respawn and are safe, but the cell (because of the garden that needs to respawn for new alchemy ingredients to appear) has the default respawn time trigger (if I remember correctly, it&#39;s 10 days). I could remove this time reset, but that would prevent alchemy users from using the garden, so I decided to let the quarters the way Bethesda intended. It&#39;s armless, you just need to remove one item from the mannequin and give it back to it for the mannquins to reequip all that is in it&#39;s inventory. \r<br />\r<br />\r<br />As it is, this mod is bug free as far as I know. \r<br />\r<br />\r<br />[u]COMPATIBILITY WITH OTHER MODS:[/u]\r<br />\r<br />This mod should be compatible with pretty much anything, except obviously with mods revamping the Archmage quarters. Might or might not work with College overhauls, depending on how much they change the Archmage quarters. You can test and see how it turns out ingame.\r<br />\r<br />Texture mods like [url=http://skyrim.nexusmods.com/mods/7484]Sexy Winterhold[/url] or  [url=http://skyrim.nexusmods.com/mods/607]HD 2K Textures[/url] will all be compatible because this mod does not modify the original textures. \r<br />\r<br />\r<br />\r<br />========================================================================\r<br />\r<br />CHANGELOG:\r<br />\r<br />========================================================================\r<br />\r<br />\r<br />v1.5: added a patch made by [url=http://skyrim.nexusmods.com/users/949490]Expresate[/url] (who deserves Kudos for this) which fixes bookshelves by adding collision boxes, thus preventing books from falling. I also fixed a misplaced carpet. Checked the plugin with TES5Edit. No need for a clean save, simply update and keep playing.\r<br />By request, uploaded a no mannequin alternative file, returning the entrance hall to it&#39;s vanilla state. \r<br />\r<br />v1.4: by request, added a cooking pot. Added an Ingot chest in the smithing area, added an alchemy box and a potion chest in the alchemy area, added a crystal ball and some new decoration in front of the Archmage bed. Revamped lighting to be brighter for people using ENBs (tested with The Wilds ENB). And some small backstage changes like packing the mod into a .bsa file and removing any unnecessary edit or resource from bsa and esp files ;\r<br />\r<br />v1.3: by request, added a shrine to Akatosh and a shrine to Julianos (providing interesting blessings for mage characters) ; moved the lectern ; added a closed bookcase near the desk in the study area for recipes and notes ; tweaked the lighting in the entrance/corridor area for better lighting of the mannequins. Added some decoration, removed some clutter (mainly baskets invading the original quarters). \r<br />\r<br />v1.2 : tweaked sound effects to really make the windy/ruin sound effect disappear. \r<br />\r<br />v1.1: Revamped smithing area and removed the smelter. Changed alchemy satchel on the alchemy lab into a strongbox. People who had stored anything in the satchel (users of version 1.0 of the mod) should remove their ingredients before updating. Sorry for the inconvenience.\r<br />\r<br />v1.0: release version\r<br />\r<br />\r<br />\r<br />\r<br />========================================================================\r<br />\r<br />CREDITS:\r<br />\r<br />========================================================================\r<br />\r<br />\r<br />Karrakaz - mod creator. You can use this file and enhance it, just give proper credit to me and the authors from the resources used in this mod. Thanks. \r<br />\r<br />[url=http://skyrim.nexusmods.com/users/949490]Expresate[/url] who gently fixed the collision boxes of the bookshelves added by my mod. Kudo&#33;\r<br />\r<br />Blary for his [url=http://skyrim.nexusmods.com/downloads/file.php?id=14134]Openbooks resource mod[/url] and his [url=http://skyrim.nexusmods.com/mods/14135]bookset resource [/url];\r<br />\r<br />Oaristys and Tony67 for new meshes from the [url=http://skyrim.nexusmods.com/mods/16525]modders resource pack[/url] like the alchemy box, ingots chest and few other items ;\r<br />\r<br />Eldiabs for preventing me to kill my computer in frustration with his invaluable [url=http://skyrim.nexusmods.com/downloads/file.php?id=11618]activator resource[/url].\r<br />\r<br />\r<br />\r<br />\r<br />==============================\r<br />\r<br />NOTE:\r<br />\r<br />==============================\r<br />\r<br />\r<br />Mods used in the screenshots: \r<br />\r<br />- [url=http://skyrim.nexusmods.com/downloads/file.php?id=5265]Enhanced Noble Furniture 4x by Mike[/url] (I love the red cover for beds, if you don&#39;t use it, your bed will have default color) ;\r<br />\r<br />- [url=http://skyrim.nexusmods.com/downloads/file.php?id=13931]Dovakhiin relaxes too by wgstein[/url] (screenshots where my character reads a book and is sitting/lying on the bed) ;\r<br />\r<br />- I used both normal Vanilla lighting  and [url=http://skyrim.nexusmods.com/mods/21123]The Wilds ENB[/url] to take the screenshots, in order to show the difference between vanilla lighting and ENB. If you use another mod modifying the lighting, the quarters might not look the same than in the screenshots. \r<br />\r<br />- My character uses : [url=http://skyrim.nexusmods.com/mods/7305]UNP Female armors[/url] for the Archmage robes ; [url=http://skyrim.nexusmods.com/mods/3563]Coverwomen[/url] look #3 for the skin texture and [url=http://skyrim.nexusmods.com/mods/10168]Apachii SkyHair[/url] for the hairstyle.\r<br />\r<br />\r<br />Have fun&#33;",
  "categoryId": "25",
  "version": "1.5",
  "author": "Karrakaz",
  "createdUnix": "1336353803",
  "updatedUnix": "1368479512",
  "containsAdultContent": false,
  "uploadedBy": "karrakaz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000002801",
      "name": "Better Archmage Quarters",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11181",
      "fileName": "Better Archmage Quarters-16617-1-5.7z",
      "uploadedUnix": "1358371371",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/15393e56024fc5e0e7e709fd7eacaf3a8498f1eca1949629d855256b9d9e3faf/analysis/1407357009/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Archmage%20Quarters-16617-1-5.7z?fid=1000002801&ttl=1535781933&ri=8192&rs=8192&setec=cabf39c234cb63e760bc7a3745aeb894"
    },
    {
      "fileId": "1000029743",
      "name": "Alternative No Mannequin Version",
      "version": "1.5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "11181",
      "fileName": "Alternative No Mannequin Version-16617-1-5.7z",
      "uploadedUnix": "1368479512",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/f7b5f83533a7873e6e661e26999a0b126b95dfe4cfbf8fcb5a799c84551b7ff9/analysis/1407568452/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternative%20No%20Mannequin%20Version-16617-1-5.7z?fid=1000029743&ttl=1535781934&ri=8192&rs=8192&setec=bd2a60598e2ecbacfd89fd5cab1d7e65"
    }
  ]
}