{
  "modId": 16612.0,
  "modName": "Skyrim NPCs reimagined -WIP-",
  "summary": "A revision of several NPC\\'s that I felt were hastily done or just didn\\'t like aesthetically.",
  "descriptionHtml": "[font=\\\"Arial\\\"][size=\\\"2\\\"]I came back to Skyrim after some time and  decided to have another go at it.  This time, I wanted to use some of  the Followers I ignored previously, but when I got them again, I  realized why I never liked them in the first place.\r\n\r\nThankfully,  the CK came out (as well as a whole bunch of other great mods), so I  decided to remake some of the characters to look a bit better and to  fill niche roles that were generally ignored, or inconvenient to fill.\r\n\r\n\r\n[center]**********UPDATE**********\r\nVersion 1.2 is out!  With it comes Uthgerd, Mjoll, and Alpha Lydia (I\\'ll explain below).  Also, stat tweaks, Perks, and unique combat styles and leveling for each individual follower!\r\n********************[/center]\r\n\r\n\r\n\r\n[/size][/font][center][font=\\\"Arial\\\"][size=\\\"5\\\"][b]Release notes:[/b][/size][/font][/center]\r\n\r\n[font=\\\"Arial\\\"][size=\\\"2\\\"][b][u]Uthgerd the Unbroken[/b][/u]\r\nI loved Uthgerd in vanilla Skyrim.  She boxed, she wielded a greatsword, she came with plate armor and even gave you 100 septims if you could knock her out.  What\\'s not to like?!\r\n\r\nActually, there\\'s quite a bit not to like...  for starters, she\\'s not even set up for 2h weapons.  In vanilla Skyrim, she\\'s a 1h combat class.  Second, her stats are pretty mediocre and I found her to be pretty easy to break, contrary to her name.  I also thought that a tough girl should look tough and Bethesda took the easy way out by giving a relatively bland looking girl a scar and some wrinkles and calling it a day.\r\n\r\nStats:  I thought that if she had a 2h sword but 1h stats, I should pick one of the two and set up her up for it...  but as I progressed with her remake, I decided since you get her early enough in the game (potentially she can be your 1st follower without even doing any real quests), why not make her whatever she needs to be?  So I did.  She levels 1h, 2h, Block, and Heavy Armor evenly.  She\\'ll tank, she\\'ll DPS, she\\'ll do whatever you need.  Also, I gave her a bit of a boost in defense and resistances so she can carry to the higher levels regardless of how you equip her.  To make it even better, take away her shield and she can dual wield for you if you don\\'t have a suitable 2h weapon for her.\r\n\r\nLooks:  Take away the scar and the plate armor and she looks like a grandma.  Believe me, I did - just to make sure...  Not liking the idea of Uthgerd the Elderly, I set out to make her look tough without the wrinkles.  Broken nose, pursed lips, manly jaw, low brow, they\\'re all there.  Then I did some research on bad-ass Norse warrior women and if Conan taught me anything, it\\'s that their women love braids, face-paint, and fighting.  Only the fighting part sounded like Uthgerd, so I gave her the other two.\r\n\r\n[b][u]Mjoll the Lioness[/b][/u]\r\nNot really much to say here.  Her character and presence are really top notch.  I really just wanted to play with her stats a bit to make her different than the other four 2h warriors we have.\r\n\r\nStats:  I wanted her to feel like a Lioness: relentless and unwavering.  To accomplish that, I gave her Tower of Strength so she\\'s harder to stagger, Champion Stance for more stamina, and Sweep to hit everyone in front of her with sideways power attacks.  Now she\\'s harder to stop, can chase and hit you longer, and isn\\'t scared to take everyone at once...  just like a Lioness should be.\r\n\r\nLooks:  Her features weren\\'t \\\"bad.\\\"  But her head was shaped wrong.  Honestly, it would be impossible for a human being to have a head like hers.  Pretty much all you\\'re going to notice with Mjoll is a little more proportion and symmetry.  And I\\'m good with that.  She was a standout NPC to me and I wanted to keep her like she is.  Oh - I did change her hair...  but only to an almost identical model that isn\\'t so flat...  gives her a wilder \\\"I\\'m a Lioness\\\" kind of subtlety.\r\n\r\n[b][u]Alpha Lydia:  Whiterun Housecarl[/b][/u]\r\nIn my opinion, Lydia is a staple character to Skyrim.  She\\'s everyone\\'s first Housecarl, she\\'s sworn to carry our burdens, etc. etc.  Most of us know Lydia better than any other follower.  As a matter of fact, her hair model is called \\\"Lydia Hair\\\" in my mind.  Whenever I see another NPC with it, I think, \\\"They have Lydia Hair.\\\"  That\\'s how ingrained she is in my mind...  so changing her is like changing the title of the game...  to me, at least.  So why include her?  Read on.\r\n\r\nStats:  This is the main reason I included her.  There are plenty of sword and board followers in the game but she is our first.  I really wanted her to be a good 1h/shield follower, while being a bit different than Calder, for example.  So I took one route with him, but with Lydia, I made her pretty reliable as a strong tank that depends on her armor and a bit of offense to deal with most situations.  She has a 20% buff to Armor and 1h damage, so she\\'ll be as strong as her equipment, but a bit more reliable later in the game or if you use mods that increase the difficulty of encounters.\r\n\r\nLooks:  Seriously, the only thing I did here was lower the intensity of her make-up.  That\\'s all.  She just had so much on and it was distracting, so I toned it down a couple notches.\r\n\r\n[b][u]Other tweaks in v1.2[/b][/u]\r\nHousecarls\r\n*Calder now has increased armor and blocking effectiveness at the cost of damage.\r\n*Argis gains weapon bonuses based off the 2h he is wielding.  When wearing all light armor he has increased stamina regeneration and a chance to avoid melee damage.\r\n*Iona has massive boosts to her ability to sneak.\r\nCompanions\r\n*Farkas ignores a large percentage of enemy armor when wielding a war hammer.\r\n*Vilkas has the Devastating blow perk, giving him slightly increased power attack damage with a chance to decapitate enemies.\r\n*Aela has a chance to stagger enemies she hits with arrows.\r\nOther\r\n*All followers cap at level 81\r\nAll files loaded into 1 .esp file!  Am still working to get \\\"optional appearances\\\" sorted out using this method.\r\n*Dual wielding definitely works, just make sure that Iona, Jordis, or Uthgerd do not have a shield in their inventory.\r\n*Certain NPC\\'s have different default outfits to better suit the changes in their stats.\r\n\r\n\r\n\r\n\r\n\r\n[b]v1.0 Jordis The Sword-Maiden\r\n\r\n[u]Jordis The Sword-Maiden:  Housecarl[/u][/b][u]\r\n[/u]She  was a little difficult for me.  On the one hand, Bethesda did a very  good job on her appearance and her character, and her name is really  cool too.  On the other hand, she plays like any other Housecarl - sword  and board with heavy armor.  The truth is, bringing her along was a  question of blondes vs. brunettes to me...  Lydia being the brunette.   But she had so much potential with such a cool name!\r\n\r\nWhat I  wanted to do with her was take her attitude and her name and totally run  with it.  I made her true to her name and focused her entire character  on being the best at using swords.  Stat-wise, she levels 1h faster than  any other follower and her heavy armor skill is right up there with  Calden.  The trade-off is her archery and block skills are lacking and  she has absolutely no business sneaking.  I\\'ve properly set her up so  that if she doesn\\'t have a shield in her inventory she [i]will[/i] dual wield her swords.  She also comes with the Dual Flurry perk, which together means she swings faster and hits more often.\r\n\r\nHer  looks are what took me the longest time.  I didn\\'t want to change the  general feel Bethesda gave to her, but at the same time, I feel they  slightly missed the mark.  First off, let me say that her facial  structure is almost completely unchanged.  I did change her hair and  mouth to make her look a little younger, and changed her eyes from  bright green to light green for realism sake.  The reason for the  changes was that after running around all over western Skyrim, doing  several dungeons, and pretty much getting into fights everywhere in  between, her attitude and personality reflected that of an excited and  confident, young prodigy.  With that in mind, I lowered her from max  weight to about 50% and gave her a ponytail, as I thought it made her  look a bit younger and sportier.  The other thing I did was remove  almost all of her make-up.  I felt she didn\\'t need it, and it distracted  me from the \\\"Natural Beauty\\\" that Bethesda already gave her.  I did,  however, spend about three hours working on her complexion to give her  very natural shades and minor discolorations that would be typical of  someone who lives in a cold environment, but also suffers from intense  heat (it\\'s a cold/hot effect that produces red marks around the face)  from wearing heavy armor.  I also changed her mouth as I felt this one  not only relayed her confidence, but had a young smile that fit her  voice appropriately.\r\n\r\nThis one was quite a bit of work, and the changes on her are [i]extremely[/i] subtle, but I\\'m really happy with how she came out.\r\n[b]\r\n\r\n\r\n\r\n\r\nv1.1 Companions[/b][/size][/font][font=\\\"Arial\\\"][size=\\\"2\\\"]\r\n\r\n*Added Aela, Farkas, and Vilkas\r\n\r\n[u][b]Aela the Huntress:  Companion[/b][/u]\r\nIt  seems to me that Bethesda really wanted her to be a standout character  in the game, hence the Ancient Nord Armor, Marksmanship Training, and  marriage options.  Problem is, she levels 1h, Archery, and light armor,  but comes equipped with heavy armor...?  She also has this terrible  complexion, long and bony face, pursed lips, and it almost feels like  that put that face-paint on to cover up the shoddy job they did with  her.\r\n\r\nFirst off, her stats:  I found a leveling scheme in the CK  that actually allows her to max Archery, Heavy Armor, 1h, and Block.  I  thought this was nice since she is really the only Follower that prefers  a bow, but wears heavy armor.  She\\'s perfect for sieging forts and  strongholds and can hold her own if she gets aggro from you.\r\n\r\nSecond,  her looks:  I kept her hair and the Werewolf eyes, but pretty much  ditched everything else.  She\\'s a Nord, so having prominent features is a  must.  I gave her a strong nose and jaw-line, healthy cheekbones, and a  decent brow line.  I shrunk her chin a bit as it was way too long, and  changed her lips to be slightly more appealing.\r\n\r\nHer Face Tattoo  is a mix between two vanilla tattoos:  One straight across her eyes, and  another that goes from her eyes, down the side of her face, and to her  neck.  Got rid of her acne and then called it a day.\r\n\r\nPlenty of  archers in the game, but now we have one who prefers heavy armor and can  potentially have a hairier chest than you!  :O\r\n\r\n\r\n\r\n\r\n[u][b]Farkas and Vilkas:  Companions[/b][/u]\r\nAh,  the brothers in arms.  I always laugh at these two because they look  like they put on their goth makeup in the morning and then went and  worked out for 6 hours.  They just look so bad.  And the structure of  their faces is seriously copy and pasted on about 15 other NPC\\'s.\r\n\r\nLet\\'s  go stats first again:  Vilkas remains unchanged.  Heavy armor and 2h  swords.  Check.  Farkas, however, wears heavy armor and weilds a 2h  sword, but levels 1h and Smithing?  Makes no sense.  I fixed him so he  properly levels 2h and Heavy armor.  Why?  He\\'s one of the first  Followers you can get in the game and I think a 2h Warrior is nice to  have early.\r\n\r\nLooks:  I wanted to accomplish 2 things with them -  Look like brothers, and have a feral, or beastial look about them.  I  designed them to share the exact same bone structure, have the same  lips, and nose as well.  The eyes are a bit different, Vilkas has  \\\"smarter\\\" eyes, but they do have the same silver \\\"Werewolf\\\" color.   Where they are different, is Farkas looks more feral - unkempt beard and  hair, whereas Vilkas is clean cut.  \r\n\r\nLastly, Vilkas talks about  regretting becoming a Werewolf during a few dialogues, so I added a nice  big scar across Farkas\\' face to kind of tell a story about why.   Thought that was a nice touch.\r\n\r\n\r\n\r\n[b]v1.1[/b]\r\n\r\n*Added two more NPC\\'s, Eola and Faendal.\r\n*Removed original files as the directory path for the meshes folder was wrong.  Should be fine now.\r\n\r\n\r\n[b][u]Eola:  Markarth Follower[/b][/u]\r\nWhere  to begin?  One of, if not [i]the[/i] strongest follower in the game.   Atronachs right when you get her and Daedra later on?  Sign me up.  Oh  wait, there\\'s one problem:  she\\'s just so hard to look at...   she shows  up wearing bandit armor, face dirty like a beggar, and bright red  lipstick to top it all off...  and what\\'s with the completely random  face-paint?  The more I do this, the more I think Bethesda used a random  generator to make some of these characters.\r\n\r\nFirst off, her voice  doesn\\'t match her appearance at all.  She sounds put together, almost  regal.  Kudos to the voice-actress because underneath the regalia,  there\\'s even a sense of something sinister going on (aside from eating  people to death, of course).  With that in mind, the first thing I  wanted to do was change her hair.  The short and white together feels  better.  Carries the regalia from her voice, but keeps a bit of  rebelliousness about it.\r\n\r\nNext was her make-up.  Traded in the  lipstick and generic face-paint for blood red smears on her eyes.  I  didn\\'t want any other color on her face to distract from it.  On top of  that, I moved her blind eye to the right side to match it up with the  scar I gave her instead of those terrible dirt stains.  I feel like  there is a story behind it, and the scar adds to the mystery of it.\r\n\r\nLastly, her stats.  I didn\\'t touch them....  she\\'s just so strong.  Honestly, if you\\'ve recruited her you:\r\nA) are one sick and evil Dragonborn.\r\nB)  don\\'t need any other followers.  She honestly clears entire dungeons by  herself, leaving you to loot corpses as you follow along behind her.\r\n\r\n\r\n\r\n[b][u]Faendal:  The Lover[/b][/u]\r\nThe  pictures I have of the \\\"New Faendal\\\" honestly don\\'t do any justice to  him in-game.  You just have to have that first conversation with him to  notice the absolutely enormous difference between the two.  Why?\r\n\r\nLook  at vanilla Faendal, he\\'s pushing 60...  at least!  How is he even in  the runnings for Camilla?  Well, aside from being one of two bachelors  in town...  I guess he\\'s Sven\\'s competition by default.\r\n\r\nAnyway, I  made him look a bit younger.  Gave him the slightest sunburn and a nice  workin\\'-at-the-mill beard.  Not a full-on beard, mind you.  Just enough  to fit in a bit better with the big Nords he lives by.  I also gave him  a stronger nose and chin (as opposed to the old scrooge nose he had),  and changed his lips to a younger looking smile.  I really like it.\r\n\r\n\r\n\r\n[b]v1.0[/b]\r\n*Initial Release\r\n\r\n[u][b]Calder:  Windhelm Housecarl[/b][/u]\r\nTo  be honest, he looked like a farmer to me and I\\'m sorry, but I hated the  chops.  I recreated his appearance to better fit a seasoned warrior as I  pictured a Housecarl from Windhelm would be - a little older and a bit  rough, but with an experienced and confident look about him.  I did like  the idea of another sword and board Housecarl, and it also fit my idea  nicely so I left his stats unchanged.\r\n\r\n\r\n\r\n[u][b]Argis the Bulwark:  Markarth Housecarl[/b][/u]\r\nWhen  I first saw Argis I thought, \\\"oh look, it\\'s Ralof with a goatee and  some facepaint.\\\" Once again, another follower that I completely ignored.\r\n\r\nI  brought him closer to his Nord base stats which are 2h and light armor -  and with that in mind, I fashioned him as a young, Norse barbarian. I\\'m  pretty happy with the way he came out.\r\n\r\n\r\n\r\n[u][b]Iona:  Riften Housecarl[/b][/u]\r\nLet\\'s face it, she was butch and we already had Lydia and Jordis who have the same exact stats... so why bother?\r\n\r\nWith the CK, however, I was able to not only change her looks, but her playstyle as well - which I did.\r\n\r\nShe  now specializes in dual-wielding and sneak, which I thought appropriate  for a Riften Housecarl - perfect for bringing along on Thief Guild and  Dark Brotherhood missions. I tweaked her appearance a bit to fit that  idea.\r\n\r\nI did want to keep her prominent features intact, however, so I kept her strong bone structure around her face.\r\n\r\n****as  a side note, you may need a mod like Amazing Follower Tweaks by  Dheuster to get her to dual-wield initially, or if you ever swap out any  gear.  The whole Vanilla follower equip system is just too buggy deal  with consistently****\r\n****This will be fixed in the next version of  her release.  I figured out how to make it so as long as she doesn\\'t  have a shield equipped, she will always dualwield.****\r\n\r\n\r\n\r\n\r\n\r\nI have more to add, and will do so soon, so please keep checking as I will update often!\r\nComing Next:\r\nAdelaisa Vendicci\r\nMjoll The Lioness\r\nUthgerd The Unbroken\r\nJ\\'zargo\r\nLydia - alpha rework, mainly focusing on stats\r\nJordis (finished)\r\nEola (finished)\r\nFaendal (finished)\r\nThe Companions (finished)\r\n\r\nI definitely won\\'t be doing [url=\\\"http://skyrim.nexusmods.com/downloads/file.php?id=16000\\\"]Jenassa[/url] as 83willow has already remade her remarkably and is what I use!  Below is the link if you want to use it, which I recommend.\r\n\r\n\r\n\r\n\r\n [/size][/font][center][font=\\\"Arial\\\"][size=\\\"5\\\"][b]INSTALLATION:[/b][/size]\r\n[/font][/center][font=\\\"Arial\\\"][size=\\\"2\\\"]Just  drop everything in your Skyrim/Data folder.  For the changes to stats  to take effect in-game, make sure the .esp files are checked in your  NMM.\r\n\r\n\r\n\r\nLast thing:  If you are using a mod like Ultimate Follower Overhaul, which I recommend, the .esp from this mod needs to be BELOW it in the list.\r\n\r\n\r\nThe screenshots were taken using the following mods:\r\n[url=\\\"http://skyrim.nexusmods.com/downloads/file.php?id=10277\\\"]Omegared99 - Armor Compilation [i]by Omegared99[/i][/url]\r\n[url=\\\"http://skyrim.nexusmods.com/downloads/file.php?id=3563\\\"]Coverwomen [i]by mrLenski[/i][/url]\r\n[url=\\\"http://skyrim.nexusmods.com/downloads/file.php?id=6684\\\"]Lore Friendly Armor Pack [i]by rahman530[/i][/url]\r\n[url=\\\"http://skyrim.nexusmods.com/downloads/file.php?id=6709\\\"]DIMONIZED UNP female body [i]by dimon99[/i][/url] (NSFW)\r\n[url=\\\"http://skyrim.nexusmods.com/downloads/file.php?id=4784\\\"]High Resolution Scars [i]by Xenius[/i][/url][/size][/font]",
  "categoryId": "33",
  "version": "1.2",
  "author": "Ghimel",
  "createdUnix": "1336348554",
  "updatedUnix": "1336886221",
  "containsAdultContent": false,
  "uploadedBy": "ghimel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "59450",
      "name": "NPCs Reimagined v1-1",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "437",
      "fileName": "NPCs Reimagined v1-1-16612.7z",
      "uploadedUnix": "1336379404",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/5337f5acd8827d93f0aadad5e85ed5c058cd143b6020063cb1dfe0b06ce811cd/analysis/1406874366/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NPCs%20Reimagined%20v1-1-16612.7z?fid=59450&ttl=1535781917&ri=8192&rs=8192&setec=fae0489db98f132ce21a793420fb224c"
    },
    {
      "fileId": "59589",
      "name": "The Companions",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "653",
      "fileName": "The Companions-16612.7z",
      "uploadedUnix": "1336421441",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0bd4ad70b875f0de5074e6b4d2cadf19948fd0b62d5ba1151e3a8460e28fa174/analysis/1406875983/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Companions-16612.7z?fid=59589&ttl=1535781918&ri=8192&rs=8192&setec=a5bec0511b2f4851ae0cb50aca6b1a56"
    },
    {
      "fileId": "60040",
      "name": "Jordis Remade",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "241",
      "fileName": "Jordis Remade-16612-1-0.7z",
      "uploadedUnix": "1336589589",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6e5aa44028781bceae5c3561e3ff20d0faa9b8b8aae3db68bd69aef53c78a623/analysis/1406880782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jordis%20Remade-16612-1-0.7z?fid=60040&ttl=1535781918&ri=8192&rs=8192&setec=7a3a25a3ca3a3281f4b380b65b41bcc7"
    },
    {
      "fileId": "60101",
      "name": "Aela Optional",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "168",
      "fileName": "Aela Optional-16612-1-0.7z",
      "uploadedUnix": "1336611516",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b17873844df8b43d60f651c109c4adcd749d4ad24c1dfedee0d1c7f0a8faf981/analysis/1406881364/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aela%20Optional-16612-1-0.7z?fid=60101&ttl=1535781919&ri=8192&rs=8192&setec=2ec31439984b514b907735e429bae171"
    },
    {
      "fileId": "60912",
      "name": "SkyNPCsReimagined",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1598",
      "fileName": "SkyNPCsReimagined-16612-1-2.7z",
      "uploadedUnix": "1336886221",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/f1b7dae05fee45c99ba48b6d9d4579c9042c83fc101084fef5149a1e284e1ff2/analysis/1406888586/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyNPCsReimagined-16612-1-2.7z?fid=60912&ttl=1535781919&ri=8192&rs=8192&setec=827dfdc638d60f65fa5b51d468ed55c6"
    }
  ]
}