{
  "modId": 16630.0,
  "modName": "Economia de Guerra",
  "summary": "Remodela la economía del juego, haciendo más difícil hacerse rico.",
  "descriptionHtml": "ECONOMÍA DE GUERRA\r\nAutor: Greeny\r\nVersión: 1.0\r\nFecha: 27-8-12\r\n\r\n\r\nDESCRIPCIÓN:\r\n===========\r\nAdmitámoslo, hacerse rico en Skyrim es relativamente fácil. Las recompensas muchas veces son desorbitadas respecto a la misión, además de ilógicas. ¿Qué hace ese pobre campesino, que apenas tiene para un pantalón decente, dándote 200 monedas de oro?\r\n\r\nCon \\\"Economía de Guerra\\\", conseguir cada moneda será todo un esfuerzo. El oro que recibes tras cada misión se ha reducido a menos de una décima parte, por lo que, por ejemplo, si antes lograbas 250 monedas por completar una tarea, ahora quizás tengas que conformarte con 40.\r\n\r\nNo solo eso: prepárate para pagar en condiciones por cualquier cosa que quieras. Las casas son el triple de caras, y las reformas que puedes hacer en ellas cuestan el doble. Contratar un mercenario cuesta ahora 1000 monedas de oro en lugar de las 500 anteriores. Si quieres un caballo, págalo a dos veces y media su valor anterior.\r\n\r\nPor otro lado, los comerciantes serán más duros contigo. Concretamente, te venderán su mercancía aproximadamente tres veces más cara que antes, y comprarán tus objetos a un precio tres veces inferior de lo usual.\r\n\r\n¿Qué se busca con todo esto? En primer lugar, ahora cada moneda de oro es una auténtica recompensa, lo que obliga a pensar muy bien en qué invertir tu tesoro. ¿Quieres esa nueva espada, o prefieres comprarte un par de pociones de curación? ¿O deberías hacerte con esas botas de acero para reemplazar tus viejas botas?\r\n\r\nEn segundo lugar, las recompensas en \\\"especie\\\" se hacen más apetecibles. Recibir ese viejo yelmo de familia pasa de ser una compensación sin valor a un fantástico premio por tus esfuerzos.\r\n\r\nEn tercer lugar, ayuda a la inmersión y al realismo. Ahora no todo el mundo parecerá rico viendo las recompensas que dan. ¿Casi 1000 monedas por matar a un pobre diablo incapaz de defenderse, cuando puede contratar por ese mismo precio a dos mercenarios seguramente mejores asesinos que tú?\r\n\r\nEn cuarto lugar, Elocuencia aumenta su importancia enormemente en cuanto al trato con comerciantes.\r\n\r\nEn último lugar, como efecto secundario, se mejora todo lo relativo a los crímenes y robos. Ahora es más fácil sentirse tentado a robar (y más gratificante invertir niveles en Abrir Cerraduras, Robo y Discreción), pero también es más difícil pagar el precio de ser un criminal si te descubren.\r\n\r\n\r\nINSTALACIÓN:\r\n===========\r\n1- Extrae \\\"ECGuerra.esp\\\" en la carpeta Data.\r\n2- Actívalo en el Lanzador del juego.\r\n3- ¡A jugar!\r\n\r\n\r\nDESINSTALACIÓN:\r\n==============\r\n1- Simplemente, borra \\\"EcGuerra.esp\\\" de la carpeta Data.\r\n\r\n\r\nINCOMPATIBILIDADES:\r\n==================\r\nNinguna conocida.\r\n\r\n\r\nBUGS CONOCIDOS:\r\n==============\r\nNinguno.\r\n\r\n\r\nCONTACTO:\r\n========\r\n\\\"Greeny\\\" en los foros de DLAN.\r\n\\\"Greenyaduna\\\" en Skyrim Nexus.\r\n\r\n\r\nPERMISOS:\r\n========\r\nPara cualquier redistribución o uso del mod como parte de otro, contacta con el autor original.\r\nNo olvides citar al autor del mod en cualquier web.\r\n\r\n\r\n\r\n--------------------------------------\r\nENGLISH DESCRIPTION:\r\nAdmittedly, getting rich in Skyrim is relatively easy. The rewards are often exorbitant to the mission, as well as illogical. What does this poor peasant who just has to decent pants, giving you 200 gold coins?\r\n\r\nWith this mod, each coin will get quite an effort. The gold you receive after each mission has been reduced to less than one tenth. The houses are three times more expensive, and reforms cost twice. Hire a mercenary now costs 1000 gold instead 500. If you want a horse, pay it to two and a half times its previous value.\r\n\r\nOn the other hand, merchants will be harder you. Specifically, you will sell your merchandise about three times more expensive than before, and buy your items at a price three times lower than usual.\r\n\r\nWhat is the aim of all this? First, now every gold coin is a true reward, which forces you to think very well what to invest your treasure. Want that new sword, or would you rather buy a couple of healing potions? Or you should get those steel boots to replace your old ones?\r\n\r\nSecond, the no-coin-rewards  become more important. Get that old helmet goes from being a value without compensation to a fantastic prize for your efforts.\r\n\r\nThirdly, it helps the immersion and realism. Now not everyone seems rich.\r\n\r\nFourth, Eloquence greatly increases its importance in dealing with marketers.\r\n\r\nFinally, as a side effect, the mod will improve everything about the crimes and theft. Now it\\'s easy to be tempted to steal, but also more difficult to pay the price of being a criminal if you get caught.",
  "categoryId": "24",
  "version": "1.0",
  "author": "Greeny",
  "createdUnix": "1336388097",
  "updatedUnix": "1346073078",
  "containsAdultContent": false,
  "uploadedBy": "Greenyaduna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "59467",
      "name": "Economia de Guerra - Beta",
      "version": "Beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "Economia de Guerra-16630-Beta.rar",
      "uploadedUnix": "1336388130",
      "modVersion": "Beta",
      "virusScanUrl": "https://www.virustotal.com/file/ef6d7cff38ad8ad4225f814755e8805ea03dd95f84545745bc718ce219fd49a6/analysis/1406874602/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Economia%20de%20Guerra-16630-Beta.rar?fid=59467&ttl=1535781964&ri=8192&rs=8192&setec=fd1259c637ab240caf0d7ba9e4559199"
    },
    {
      "fileId": "84609",
      "name": "Economia de Guerra 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Economia de Guerra 1_0-16630-1-0.rar",
      "uploadedUnix": "1346073078",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cc26650ca3d2b272575f6f8779c2d0bc0fa736398f032ec1095adc853baf6cf5/analysis/1407125702/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Economia%20de%20Guerra%201_0-16630-1-0.rar?fid=84609&ttl=1535781965&ri=8192&rs=8192&setec=73183f436a7db46da63ae36b2e4cdc7a"
    }
  ]
}