{
  "modId": 16656.0,
  "modName": "Non-Automatic SkillBooks - German",
  "summary": "Skillbücher können nun aufbewahrt und später gelesen werden!\r\nÜbersetzung der Original-Mod \\\"Non-Automatic SkillBooks\\\" von Griptzion",
  "descriptionHtml": "Beschreibung:\r\n=============\r\n\r\n\r\nAutor: Griptizon\r\nVersion: 2.0\r\nSprachversion: Deutsch\r\nDateigröße: ca. 260 KB\r\nÜbersetztung: LilaMue\r\nDatum: 6.5.2012\r\n\r\n\r\nDownload: Via \\\"MIRROR\\\"\r\n\r\n\r\nDiese Mod verändert die Skillbücher durch ein Skript insofern, dass man beim Aufheben eines solchen nun in einem Menü auswählen kann, ob man sich diesen\r\nFertigkeitspunkt sofort vergeben oder eventuell für einen späteren Zeitpunkt aufheben möchte.\r\nDie Original-Mod von Griptizon findet ihr hier Skyrim Nexus in englischer Sprache:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=16463\r\n\r\n\r\nEs gibt 2 Versionen dieses Plugins:\r\n\r\n1. (Normal)... mit den bisher üblichen Buchtiteln\r\n2. (Better)... ändert den Buchtitel insofern, dass nun im Titel zusätzlich die jeweilige Fertigkeit angeführt ist, wie in Griptizon\\'s früherer \\'Better skill books\\'-Mod.\r\nDer Autor hatte im Original den Skill jeweils am Anfang des Titels in eine Klammer gesetzt.\r\nWarum ich es in einen Bindestrich verändert habe? Ganz einfach, ich finde es so schöner. :)\r\n\r\n\r\nVorteile:\r\n------------\r\n- generell ist es nun angenehmer, zumindest in Hinblick auf die Bücher selbst bestimmen zu können, wann man eine Fertigkeit steigern möchte.\r\n- Durch die 2. Version erkennt ihr sofort, um welchen Skill es sich handelt, was aus den Titeln selbst oft nicht hervorgeht, und es erspart euch möglicherweise,\r\neinen früheren Speicherpunkt laden zu müssen.\r\n\r\n\r\nKonflikte:\r\n--------------\r\nEs gibt Komplikationen, wenn ihr während eines Games zwischen den beiden Versionen der Mod wechseln wollt. Anscheinend erkennt die andere Version dann nicht,\r\nwelche Bücher schon gelesen wurden.\r\nIch selbst habe die Erfahrung gemacht, dass, wenn ihr die Mod ladet, und schon gelesene Skillbücher in euerm Inventar habt, diese dann nicht als gelesen erkannt werden.\r\nJedoch ist es möglich, diese dann einfach wegzulegen, oder halt noch mal zu lesen. \r\n\r\n\r\nÜbersetzung:\r\n-------------------\r\nBeide Versionen sind komplett ins Deutsche übersetzt. Außerdem habe ich alle! Verbesserungen von \\\"Skyrim Directors Cut\\\" in dieser Übersetzung mit berücksichtigt,\r\nund ebenfalls Fehler in den deutschen Buchtexten in beiden Versionen des Plugins wieder berichtigt. \r\n\r\n\r\nHinweis zum Laden des Plugins:\r\n--------------------------------------------\r\n... findet ihr in der von mir beigefügten Beschreibung.\r\nDarunter ebenfalls eine genaue Erläuterung zur Ladereihenfolge in Zusammenhang mit \\\"Skyrim Directors Cut\\\" und meiner \\\"Skyrim Balancing Mod\\\".\r\n\r\n\r\n\r\nNeu in Version 2.0:\r\n--------------------------\r\n- entspricht der Version 2.0 von Griptzion, Skripte verändert\r\n- Skills in den Büchertiteln wieder in Klammern gesetzt, sodass sie gleich zu Beginn auftauchen\r\n\r\nAchtung:\r\nEin Wechsel von der Vorgänger-Version zur Version 2.0 ist auch nicht in einem laufenden Spiel möglich, da die Skripte und die Abfrage komplett anders aufgebaut sind. Mit der Version 2.0 sollte ein neues Spiel begonnen werden, es könnte allerdings auch funktionieren, die alte Version auszuhaken, einen sauberen Speicherpunkt zu machen und dann die Version 2.0 zu laden, was ich selbst allerdings nicht getestet habe.\r\nWenn ihr gerade mit der älteren Version spielt, und es funktioniert wunderbar, dann würde ich in dem Fall raten, einfach dabei zu bleiben. \r\n\r\n\r\nVerwendete Tools:\r\n---------------------------\r\n- Creation Kit\r\n- Skyrim StringLocalizer\r\n\r\n\r\nLizenz: \r\n----------\r\nIch habe dieses Plugin lediglich übersetzt. \r\nWen jemand Teile davon verwenden möchte, solltet ihr euch bitte an Griptizon wenden.\r\n\r\n\r\nDanksagung an:\r\n----------------------\r\n* Bethesda für Skyrim, meiner Meinung nach ein Meisterwerk!\r\n* Griptizon für diese tolle Verbesserung!\r\n* PlanB für seine Hilfe bezüglich des Skyrim StringLocalizers!\r\n\r\n",
  "categoryId": "24",
  "version": "2.0",
  "author": "LilaMue",
  "createdUnix": "1336414836",
  "updatedUnix": "1336414836",
  "containsAdultContent": false,
  "uploadedBy": "LilaMue",
  "primaryFile": null,
  "files": []
}