{
  "modId": 16660.0,
  "modName": "Scarves of Skyrim",
  "summary": "This is a Nexus Exclusive. This is a port of two classic Oblivion mods: Scarves&#33; by KrimsynKane and selected scarves from Tona&#39;s Mod Store by Tona.\r<br /> ",
  "descriptionHtml": " \r<br />Name: Scarves of Skyrim\r<br /> Version: 1.0\r<br /> Date: 5/7/2012\r<br /> Category: Clothes\r<br /> Recommended: Skyrim Mod Manager\r<br /> Author(s): Natterforme\r<br /> Source: \r<br /> \r<br />Description\r<br /> ===========\r<br /> This is a Nexus Exclusive. This is a port of two classic Oblivion mods: Scarves&#33; by KrimsynKane and selected scarves from Tona&#39;s Mod Store by Tona.\r<br /> \r<br />Location\r<br /> ========\r<br /> The only way to currently obtain the scarves is to gather the necessary crafting materials and craft the scarf at a crafting forge. Any forge will do. The scarves can be found under the Misc Section in the Crafting Forge.\r<br /> \r<br />Details\r<br /> =======\r<br /> THIS IS A NEXUS EXCLUSIVE&#33; NO STEAM SUPPORT WILL BE OFFERED AT THIS TIME&#33; IF I FIND THAT THIS HAS BEEN UPLOADED TO STEAM WITHOUT MY PERMISSION I WILL NOT BE LENIENT TOWARDS THE UPLOADER(S). YOU HAVE BEEN WARNED&#33;&#33;&#33;   \r<br /> \r<br /> This mod adds ports of two Oblivion Mods. The first is Scarves&#33; by KrimsynKane. The second is the scarves from the Tona&#39;s Mod Store, by Tona. KrimsynKane has given me permission to port his Scarves&#33; from Oblivion. Tona, the maker of the scarves from the Tona&#39;s Mod Store, allows for the modification of his material so long as I show proper credit towards him/her and his/her contributers contributions to the original mod. The Credits section will provide the full list of contributers to this mod, both for the Skyrim port and the original mod. The readmes from both mods are provided in a seperate folder as part of your download, and have been left unaltered from their original state. \r<br /> \r<br /> Each mod port can be used independantly of one another and do not require the other to work. Conversely, you can use both ports without having a problem of one conflicting with another. The scarves can be used by both genders and should be usable by all races. The scarves use the 44 body slot which makes them compatible with most cloak mods, such as Capes of Skyrim and Nivea&#39;s Winter is Coming mod. It is not guaranteed to work with every mod or every piece of clothing. Clipping with heavy armor is going to happen but the scarves should be fine for most sets of clothes. The scarves from both ports have been modified in Blender, but only so much as to allow them to fit onto the Skyrim body meshes and to prevent them from clipping with the body and most sets of clothing. Tona&#39;s Scarves were originally one sided faces, which meant that if you looked at them from the front you could see through them as if they werent there. This wasnt a problem in Oblivion, as it could read a one sided face without a problem but the mesh had to be duplicated and have its faces reversed in order for this onesided see throughness to be removed.\r<br /> \r<br /> The mod provides a lot of content. The original Scarves&#33; mod came with 20 colors and each color came in a long and short version. This has been preserved in the Skyrim port. The original colors are listed here:\r<br /> \r<br /> -Black\r<br /> -Blue\r<br /> -Blue Flowers\r<br /> -Candy Cane\r<br /> -Crimson\r<br /> -Forest\r<br /> -Gold\r<br /> -Grey\r<br /> -Green\r<br /> -Hogwarts\r<br /> -Indigo\r<br /> -Lavender Flowers\r<br /> -Lumber Jack\r<br /> -Navy Blue\r<br /> -Plaid\r<br /> -Red\r<br /> -Red and Black\r<br /> -Red Flowers\r<br /> -Violet\r<br /> -White\r<br /> \r<br /> I wanted to port the original material, but I also wanted to add more to the original and make it better&#33; To do this I have expanded upon the original colors and added my own. Some of them go with the atmosphere of Skyrim. Others fit into the story of the game by adding new scarves for Guilds and regional areas such as cities and towns. Here is a list of colors that I have added into the Skyrim port:\r<br /> \r<br /> -Black and White Stripes\r<br /> -Blue and White Stripes\r<br /> -Chocolate\r<br /> -Christmas\r<br /> -College of Winterhold\r<br /> -Dark Brotherhood\r<br /> -Dark Brown\r<br /> -Dawnstar Fog\r<br /> -Green and White Stripes\r<br /> -Hjaal March Pine\r<br /> -Markarth Watch\r<br /> -Pink and White Stripes\r<br /> -Purple and White Stripes\r<br /> -Riften Royal\r<br /> -Solitude Honor\r<br /> -Stormcloak Blue\r<br /> -Thieves Guild\r<br /> -Whiterun Gold\r<br /> -Winterhold Ice\r<br /> -Yellow and White Stripes\r<br /> \r<br /> This effectively doubles the amount of scarves available to the player. Each of the 40 scarves has its own unique crafting recipe. Some require alchemical ingredients or everyday materials whereas others require a combination of different scarves. All of the scarves can be upgraded at the Temperoring Workbench and are treated as clothing items(non armor). Due to the amount of scarves, there will not be an option to have the scarves in an armor class anything other than non-armor.\r<br /> \r<br /> Tonas Scarves come in three different types: Muffler, Muffler version 2, and Boa(knit). For the original release I will only be uploading the original colors from Oblivion. In future releases, I plan on vastly adding to this though, as Tona&#39;s scarves allow for more flexibility than the original Scarves&#33; mod, which in turn will allow me to add many more colors and combinations of colors. New colors, special Guild and Faction scarves, as well as Holiday packs are to be expected^^. The original colors are as follows:\r<br /> \r<br /> Muffler:\r<br /> \r<br /> -Bear\r<br /> -Black\r<br /> -Green\r<br /> -Khaki\r<br /> -Linen\r<br /> -Pink\r<br /> -Red\r<br /> -Wbk striped (White and Black Striped)\r<br /> -White\r<br /> -Yellow\r<br /> \r<br /> Muffler version 2(Boa in the Original)\r<br /> \r<br /> \r<br /> -Black\r<br /> -Brown\r<br /> -Grey\r<br /> -Kuma(Bear)\r<br /> -St Black (Black and White Striped)\r<br /> -St Blue (Blue and White Striped)\r<br /> -St Pink (Pink and White Striped) \r<br /> -White\r<br /> \r<br /> Mufffer Knit Version\r<br /> \r<br /> -Black\r<br /> -Brown\r<br /> -Grey\r<br /> -Red\r<br /> -St Black (Black and White Striped)\r<br /> -St Blue (Blue and White Striped)\r<br /> -St Pink (Pink and White Striped) \r<br /> -White\r<br /> -Yellow\r<br /> \r<br /> As with the Scarves&#33; port, all of the ported scarves have their own unique crafting recipes. Some of these require alchemical ingredients or combinations of other scarves. Many of all of the scarves need a base scarve to create new ones. This might sound a little confusing but it should be very straight forward once you begin crafting them for yourself^^. All of Tonas Scarves can be used by both genders and hopefully all races. As with the Scarves&#33; port, clipping is to be expected on certain types of armor but the vast majority of clothes will be usable with this mod.\r<br /> \r<br /> If you have a color that you would like to see added to the list of colors, or if you would like to see a specific Guild, Faction, city, town, or quest related scarf that I have not already added, feel free to leave me the suggestion in a comment and I will consider it in a future update. This does not guarantee that it will be included, but I do listen your opinions and I consider the opinions of others important. I cant think of everything^^. If your suggestion is used in a future update, then your name will be added to my list of credits.\r<br />  \r<br />Install\r<br /> =======\r<br /> You can either download this mod with the Nexus mod manager or download the files and extract into the Skyrim data folder. Be sure to check the tick box in your data files section on the Skyrim launcher.\r<br /> \r<br />\r<br />Uninstall\r<br /> =========\r<br /> Either use Nexus Mod Manager to remove the files or manually remove them from you Skyrim/Data folder. \r<br />\r<br />Upgrade\r<br /> =======\r<br /> I plan to upgrade and improve this mod over time as I fix bugs, think of new ideas, become more adapted to the CK, and so on. Be sure to check back in once and awhile for updates. Be sure to completely uninstall any previous versions of this mod before upgrading though.\r<br /> \r<br />I will not take responsibility for corrupted save games or lost save games. Get into the habit of backing up your saves to protect your game data. Ignore at your own risk&#33;\r<br />\r<br />Incompatibility\r<br /> ===============\r<br /> \r<br /> This mod should not be incompatible with other mods, as everything has its own unique item ID and all of the meshes and textures have their own seperate folders. Since this mod does not rely on vanilla textures or meshes, I can not foresee a problem with that area either. However, if you notice a problem with this mod and another mod, then feel free to tell so that I can look into it. Please be sure to be as detailed in your explaination of the problem, as I can only work with what I have to go on.\r<br />  \r<br />Known Issues or Bugs\r<br /> ====================\r<br /> There are no known issues at this time. Clipping is to be expected with certaion types of armor and gear. Any item that uses the 44 item slot will either cause these scarves to be unequiped if equiped, or will be unequiped if you equip a scarf. Most, but not all, cloak mods use the 45 slot so you shouldnt have to worry about one removing the other at this point.\r<br /> \r<br />History\r<br /> =======\r<br /> \r<br /> 5/7/2012- Version 1.0 Initial Release\r<br /> \r<br />Contact\r<br /> =======\r<br /> You can find me on the Nexus Forums here as Natterforme.\r<br /> \r<br />Credits\r<br /> =======\r<br /> -KrimsynKane for allowing me to port his Scarves&#33; mod to Skyrim.\r<br /> -Tona for permitting in his/her terms of use to allow me to freely modify his/her material with proper credit and thus allow me to port his scarves, mufflers, and boas to Skyrim.\r<br /> -Kikaimegami for her contributions in texture work on the original version of Scarves&#33;.\r<br /> -Lady N for her contributions in texture work on the original version of Scarves&#33;.\r<br /> -Thank you the following individuals for their contributions to the Tona&#39;s mod Store mod, as directly reproduced from the provided original readme:\r<br /> \r<br />-Exnem&#39;s Female EyeCandy Body Replacer\r<br />-RAIAR&#39;s HG EyeCandy Body\r<br />-REFRAIN&#39;s HGEC Like A Bab\r<br />-Vanilla Beans&#39;s Script\r<br />-Ookami-Shonen&#39;s Script\r<br />-And All Senior Modders\r<br />\r<br />-Thank you to Brokefoot, for providing me with a tutorial to add gnd meshes to Skyrim, which allowed me to use the original gnd meshes from the original mods in Oblivion.\r<br />-Thank you to Omesean, for your continued support and advice^^.\r<br />- Thanks to Bethesda for creating Skyrim.\r<br />- Thanks to SkyrimNexus.com for the a one-stop-shop resource for authors and players.\r<br />- Thanks to LHammonds for the Readme Generator this file was based on.\r<br />- I thank you all for your patience with me^^.\r<br />- Thanks to God for creating us all. Amen.\r<br /> \r<br />Tools Used\r<br />==========\r<br />7-Zip - http://www.tesnexus.com/downloads/file.php?id=15579\r<br />Blender - http://www.tesnexus.com/downloads/file.php?id=12248\r<br />NIFSkope - http://niftools.sourceforge.net/wiki/NifSkope\r<br />Oblivion Mod Manager - http://www.tesnexus.com/downloads/file.php?id=2097\r<br />Photoshop - http://www.adobe.com/products/photoshop/\r<br />Readme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r<br />\r<br /> Licensing/Legal\r<br /> ===============\r<br /> This is a Skyrim Nexus Exclusive.\r<br />\r<br /> You MUST contact me before you do anything with this mod in any form for any reason. This includes language translations. I am not opposed to changes or addons or language translations. I simply want to be aware of what is going on. I will NOT be providing Steam Workshop support at this time. I do not feel comfortable with their legal policies towards modding so I will not use it. I will not support or endorse its use at this time. If I want it to be on Steam, I will do so myself. If you see this on Steam, LET ME KNOW&#33; I will not support any version of this mod found on Steam. I will not accept any childish excuse about &#34;sharing&#34; with the community. If you refuse to respect my wishes, I can not, in good faith, respect yours.\r<br />\r<br /> -Natterforme",
  "categoryId": "60",
  "version": "1.0",
  "author": "Natterforme",
  "createdUnix": "1336419638",
  "updatedUnix": "1336426382",
  "containsAdultContent": false,
  "uploadedBy": "Natterforme",
  "primaryFile": null,
  "files": [
    {
      "fileId": "59616",
      "name": "Scarves of Skyrim Ver1dot0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "56919",
      "fileName": "Scarves of Skyrim Ver1dot0-16660-1-0.zip",
      "uploadedUnix": "1336426382",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7678bee59564480c5e5b0bdac5d6d3fef4915313ddd84b097a5ae2550f3a0acb/analysis/1406876176/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Scarves%20of%20Skyrim%20Ver1dot0-16660-1-0.zip?fid=59616&ttl=1535782009&ri=8192&rs=8192&setec=96c188e9c50f20f81e922ffc43ebb41d"
    }
  ]
}