{
  "modId": 16668.0,
  "modName": "The Spice of Life - NPC Body Variety",
  "summary": "This mod will allow many of your favorite followers, spouses, and dozens of other NPCs to use their own individual body models and textures.  Change them to fit their individual personalities and looks!  Make your favorite characters truly unique!  After all... variety is The Spice of Life!",
  "descriptionHtml": "Hello, and thank you for taking an interest in my mod!  This is my very first contribution to the Nexus and to modding at large, so I hope I haven\\'t made too many rookie mistakes.  However, I\\'ve been taking advantage of the talents of modders here on the Nexus for many years, and I\\'ve finally made something that I felt was worthy enough to share.  Soooo, I cleaned it up as best I could and packaged it up.  I hope my humble efforts make your gaming experience better!\r\n\r\n\r\n[center][color=deepskyblue][size=4][b]The Spice of Life[/b][/size][/color][/center]\r\n\r\nSo, what will this mod allow you to do?\r\nIn simple terms, it allows you to individually assign bodies, textures, and skeletons to dozens of NPCs.  Variety is the Spice of Life after all, is it not?  \r\n\r\nThis mod came about primarily for two reasons:\r\nFirst was that I wanted to individualize my favorite characters and companions so that, beneath the armor, they wouldn\\'t be virtual carbon-copies of every filthy bandit in Skyrim.  To make them feel, even just a little bit, like they were their own unique entities instead of just another mannequin with a different face painted on.\r\n\r\nSecondly, there is a multitude of wonderful, beautiful body replacers and textures floating about the Nexus and I had a really difficult time choosing which one I wanted to use.  I wished I could use them all!\r\n\r\nSince accomplishing my second wish would, in turn, grant my first, I set about finding a solution.\r\n\r\n\r\n[center][color=cyan][size=2][b]How Does It Work?[/b][/size][/color][/center]\r\n\r\nThis mod is very simple.  It has three basic parts:\r\n1. The file \\\"The Spice of Life.esm\\\" creates a multitude of custom, individualized races as a resource.\r\n2. The TSoL.esp files contain actual changes to the NPCs records that alter their race to one added by the master file.\r\n3. A bunch of folders to contain meshes and textures in the proper places.\r\n\r\n\r\n[center][color=cyan][size=2][b]What DOESN\\'T this mod do?[/b][/size][/color][/center]\r\n\r\nThis mod contains no nudity on its own.  I do not have permission to distribute other people\\'s body models, so this mod will only install _vanilla_ resources.  HOWEVER -- the main purpose is to incorporate many different bodies into the game, nude or otherwise.  So if you want your nude meshes and textures, all you have to do is place your own into the appropriate folders and overwrite the vanilla ones, easy as pie.  Customizing your own NPCs is the whole point, after all ;)\r\n\r\nAlso, this mod does not individualize any male characters.  Sorry.  Not only is it rather a lot of work for something I\\'m not personally interested in doing, but there is a dearth of male bodies and textures compared to female ones.  Consequently it is much less interesting, and there is comparatively little variety or individuality gained by doing it IMO.  For anyone interested in making such a thing, however, the links at the bottom of the page (particularly Luchaire\\'s tutorial) will tell you what you need to know to create it!\r\n\r\n\r\n[center][size=2][color=cyan][b]Installation[/b][/size][/color][/center]\r\n\r\n[size=2][color=coral][i]New installation procedure![/i][/color][/size]\r\n[color=coral]1)[/color] Nice and easy! Simply download and install them with NMM.  You\\'ll need at least 2 files if you want to change any NPCs:\r\n\\\"The Spice of Life.esm\\\" and any one of the \\\"TSoL\\\" esp files.\r\nThe master file can be used by itself if you simply want new races to use for your own plugin.\r\n\r\nBe aware: \\\"TSoL - All NPCs.esp\\\" package will overwrite any of the other esp\\'s.  If you want to convert all the NPCs but also want to use one or more of the \\\"Nicer Faces\\\" packages, install the \\\"All NPCs\\\" package first, then overwrite it with the others.  Also, place \\\"All NPCs\\\" earlier in the load order.\r\n\r\nAt this point the mod will be functional, but probably not quite where you want it to be if you are using a body replacer such as CBBE or UNP.\r\nThe steps below are optional and may be obvious to people who are familiar with body swapping; they\\'re just to help you get your body models into the game.\r\n\r\n[color=coral]2)[/color] Copy the body & hand meshes from your favorite body into the folders for the individual NPC\\'s.\r\nThese are located in: \\\"meshes\\\\actors\\\\character\\\\Adelaisa\\\", \\\"\\\\Annekke\\\", \\\"\\\\Aela\\\", etc.\r\n\r\nIf you already have a body replacer, those meshes will be in: \\\"meshes\\\\actors\\\\character\\\\character assets\\\\\\\"\r\nHowever, you can use any mesh you like for any character.  Make sure they\\'re named properly (they should overwrite the files already inside the folders).  You can copy body replacers for as many or as few of the NPCs as you wish, the rest will simply stay vanilla.\r\n\r\n[color=coral]3)[/color] Now do the same for the body & hand textures; copy them to the character folders in \\\"textures\\\\actors\\\\character\\\" just as with the meshes.\r\nIf you already have a body replacer, the textures will be in \\\"textures\\\\actors\\\\character\\\\female\\\".\r\nIf you use different body models for different NPCs, make sure to put textures in each folder that are compatible with their bodies; any weird-looking texture issues are probably caused by this.\r\n\r\nNow you\\'re done!\r\n\r\n\r\n[center][color=cyan][size=2][b]Un-Installation[/b][/size][/color][/center]\r\n\r\nUninstall with NMM, or if you installed manually, delete \\\"The Spice of Life.esm\\\", TSoL esp files, all the new folders named after specific NPCs, and the dds/nif files in the facegendata folder.\r\nDone!\r\n\r\nTechnically you should be able to leave the NPC folders in place if you want (i.e. if you plan to re-install), they don\\'t do anything but take up space when the esp\\'s aren\\'t enabled (although you should remove the facegendata).\r\n\r\n\r\n[center][color=cyan][size=2][b]What Are All These Files For?[/b][/size][/color][/center]\r\n\r\n[color=white][b][u]The Spice of Life.esm[/u][/b][/color] - Provides records for 60 new races that each use their own unique bodies, textures, and skeletons.  You need this one.\r\n\r\n[color=white][b][u]TSoL - All NPCs.esp[/u][/b][/color] -  Changes 60 different NPC records to each use one of the provided bodies:\r\nAdelaisa, Adrianne, Aela, Ahlam, Alfhild Battle-born, Alva, Angi, Annekke, Aranea\r\nBorgakh, Brelyna\r\nCamilla Valerius, Carlotta Valentia\r\nEola\r\nFaida, Fastred\r\nGerdur, Ghorza, Grelka\r\nHaelga, Hroki\r\nIdgrod the Younger, Illdi, Illia, Indara, Ingun, Iona\r\nJenassa, Jordis, Julienne\r\nKarita, Karliah\r\nLisbet, Lisette, Lydia, Lynly Star-sung\r\nMjoll the Lioness, Muiri\r\nNarri, Nilsine Shatter-Shield, Niranye, Nivenor, Njada Stonearm\r\nOlfina Gray-mane, Orla\r\nRia\r\nSaadia, Sapphire, Senna, Shahvee, Sigrid, Susanna the Wicked, Sylgja\r\nTormir\r\nUthgerd the Unbroken\r\nVex, Vittoria Vici, Vivienne Onis\r\nYsolda\r\n\r\n[color=white][b][u]TSoL - Housecarls[/u][/b][/color] - Changes only the female housecarls to use their own bodies (Iona, Jordis, and Lydia).\r\n\r\n[color=white][b][u]TSoL - Marryable Followers[/u][/b][/color] - Gives marriable followers individual bodies (not including the Housecarls).\r\nThis includes Aela, Borgakh, Brelyna, Jenassa, Mjoll, Njada, Ria, and Uthgerd.  The \\\"Nicer Faces\\\" version is the same, except that it cleans the dirt off of the dirty faces and makes them younger-looking (the morphs are unchanged).\r\n\r\n[color=white][b][u]TSoL - Non-Marryable Followers[/u][/b][/color] - Gives your platonic woman-adventurer friends unique bodies.\r\nThis includes Adelaisa, Annekke, Aranea, Eola, and Illia.  Once again, \\\"Nicer Faces\\\" washes those who need it in the Fountain of Youth.\r\n\r\n[color=white][b][u]TSoL - Marryable Non-Followers[/u][/b][/color] - Gives stay-at-home spouses unique bodies.\r\nThis includes Camilla, Ghorza gra-Bagol, Muiri, Orla, Senna, Shahvee, Sylgja, and Ysolda.  \\\"Nicer Faces\\\" makes faces nicer.\r\n\r\n\r\n[center][color=cyan][size=2][b]Version History[/b][/size][/color][/center]\r\n\r\n1.00: Initial release.  Adds 59 new races for NPCs, provided .esp files to enable some or all of them.\r\n1.01: Updated .esp files so that they could be installed with NMM, no manual file-copying required.\r\n1.02: Updated .esp files again to correct a filename error that caused missing textures.\r\n1.03: Added one more Race/NPC (Vex) to bring the total to an even 60.  Updated .esm and TSoL - All NPCs.esp files.\r\n1.04: \\\"The Spice of Life.esm\\\" updated to fix texture/hand model bug on various NPCs.\r\n\r\n\r\n[center][color=cyan][size=2][b]Compatibility[/b][/size][/color][/center]\r\n\r\nThe .esm should not conflict with anything at all, it simply adds races that can be used by mods.  The only problem I can imagine is if people add races with the same names (the races are named after the NPCs, e.g. AelaRace, MjollRace, etc.).\r\n\r\nHowever, .esp\\'s that change an NPCs face (such as from Skyrim NPC Editor), change their race, or turn them into followers or marriage candidates and the like, will conflict.   BUT... if you\\'re willing to muck about in the CK a little, I will give detailed instructions further down on how to incorporate \\\"facelift\\\"-type mods.  It is not overly difficult.  Making followers into marriage candidates and followers is not difficult either, and can even be [url=http://www.gamefaqs.com/boards/615805-the-elder-scrolls-v-skyrim/61242343]done by console[/url].\r\n\r\nThis mod plays well with Ultimate Follower Overhaul (UFO) as long as my mod is loaded afterwards.  Some functionality will be lost, but most will be intact.  See UFO for details.\r\n\r\nThis mod also should generally be compatible with other Race mods.  In fact I use and recommend [url=http://skyrim.nexusmods.com/downloads/file.php?id=5968]Unique Bodies[/url] by raintrw.  His mod allows different body and face data by race to add even more variety and realism for all the NPCs not covered by this mod.\r\n\r\n\r\n[center][color=cyan][size=2][b]Potential Problems[/b][/size][/color][/center]\r\n\r\n[color=coral]1.[/color] \\\"[i]My companion\\'s face is all dark and is missing my pretty war paint![/i]\\\"\r\n\r\nThis is actually a bug with Skyrim -- the game seems not to properly use the tints and such set in the character records, they must be exported separately.  This is why the \\\"facegendata\\\" folders are included: they contain meshes and textures exported by the CK for each mod.\r\n\r\nFirst, be sure that those are installed in the correct folder.\r\nNext, if you downloaded more than one .esp, be sure that any others are installed AFTER \\\"All NPCs\\\", and that they are later in the load order as well.\r\nFinally, be sure that no other mod is altering that character.  If you have facegendata for Mjoll installed from Mod X and Mod Y also alters Mjoll, she is going to look funny.  Load the one you have facegendata for last.\r\n\r\n(As a side note, I was able to get Lydia working without any facegen files and without a dark face.  I have no idea how, I spent hours and hours comparing her records with others and looking over other mod resources.  If someone else can see what is going on, we may end up with a solution to the dark face bug!)\r\n\r\n\r\n[color=coral]2.[/color] \\\"[i]Someone is missing their body![/i]\\\" or \\\"[i]Someone\\'s body is all shiny and blue![/i]\\\"\r\n\r\nYour textures and/or meshes are not installed in the right place, or are named incorrectly.\r\nThe folders are simply named after the characters first names (for example, Aela\\'s meshes should go into \\\"Meshes\\\\Actors\\\\Character\\\\Aela\\\").  Meshes should be named:\r\nfemalebody_0.nif\r\nfemalebody_1.nif\r\nfemalehands_0.nif\r\nfemalehands_1.nif\r\nfemalefeet_0.nif\r\nfemalefeet_1.nif\r\nskeleton_female.nif\r\nThe _0 and _1 are for the light weight and heavy weight meshes, respectively.\r\n\r\nThe textures should be named:\r\nfemalebody_1.dds\r\nfemalebody_1_msn.dds\r\nfemalebody_1_s.dds\r\nfemalebody_1_sk.dds\r\nfemalehands_1.dds\r\nfemalehands_1_msn.dds\r\nfemalehands_1_s.dds\r\nfemalehands_1_sk.dds\r\n\r\n\r\n[color=coral]3.[/color]\\\"Why do some people look like burnt-up corpses?  Why do women have man-hands?\\\"\r\n\r\nYou have an old version of the .esm that had an unintentionally modified copy of the NakedSkin record.  Download \\\"The Spice of Life v1.04\\\" or later and use that .esm instead.\r\n\r\n\r\n[color=coral]4.[/color] \\\"I installed it and put a new body in my NPCs folder, but they aren\\'t changing!\\\"\r\n\r\nYou likely have another mod that is making some change to that character\\'s NPC record and overwriting this mod.  It could be a mod that makes them marriable, or it could be something that alters their appearance (such as from the Skyrim NPC Editor), or even something that gives them a skill or item that they don\\'t normally have.  Disable any such mods and see if that helps.  If an appearance mod is causing trouble and you\\'d like to keep the face, see my instructions on importing a face, below.\r\n\r\n\r\n[center][color=cyan][size=2][b]Creating Your Own Bodies[/b][/size][/color][/center]\r\n\r\nIf you like the idea of individualized bodies, I [i]highly recommend[/i] trying out Caliente\\'s amazing utility \\\"BodySlide\\\".  It can be downloaded from the [url=http://skyrim.nexusmods.com/downloads/file.php?id=2666]main CBBE page[/url].  It is very simple to use, and allows non-modelers to come as close as they will ever come to designing their own bodies.  [b]moonballz[/b] has even sweetened the deal with a mod to [url=http://skyrim.nexusmods.com/downloads/file.php?id=11920]add a bunch of extra sliders[/url] for even more variety!\r\n\r\nStep 1: Download and install BodySlide according to instructions.\r\nStep 2: Go to Data/CalienteTools/BodySlide (or wherever you installed it) and run BodySlide.exe\r\nStep 3: Choose a body from the \\\"Outfit/Body\\\" pulldown menu (CalienteBody is standard).\r\nStep 4: Either choose a preset from the \\\"Preset\\\" pulldown menu or use the sliders to shape your own body.\r\nStep 5: Ctrl+click the \\\"Create Bodies\\\" to put a new set of femalebody.nif\\'s in the BodySlide directory.\r\nStep 6: Copy-paste the femalebody_0.nif and femalebody_1.nif files into the folder for your desired NPC.\r\n\r\nIf you want, you can also click \\\"Save Preset\\\" so you can save the slider positions for later in case you want to adjust them or create the .nif files again.\r\n\r\n\r\n[center][color=cyan][size=2][b]Using Your Own Faces[/b][/size][/color][/center]\r\n\r\n[color=coral]Notice to modders: If you have created a face or faces for one or more of the NPCs in my mod, I absolutely give you permission (nay, [i]encourage![/i]) you to make a version that uses the Master file from this mod so that you can customize them from top to bottom with a fitting body and texture of your choosing (or even your own design, if you use BodySlide).  All I ask is credit and, if you please, a link to this mod :)[/color]\r\n  \r\nNow... I\\'ve stuck with vanilla face morphs with this mod.  While some of the characters have the option to have cleaner or younger faces and whatnot, their facegen sliders have not been touched.  Unfortunately, if you have a mod that gives a character a new face, it is not compatible with this mod (it will either overwrite, or be overwritten).  However, you CAN incorporate it into this mod if you follow the steps below.  I\\'ll try to be detailed.  It\\'s a little tedious, but not at all difficult.\r\n\r\n[color=coral]Part 1: Making your new face into a Player-selectable preset[/color]\r\n1. You will need the Creation Kit.  Download and properly install it if you have not.\r\n\r\n2. Start the CK.  Go to File -> Data and select:\r\n   - Skyrim.esm\r\n   - The .esp for your NPC\\'s face-changer\r\n   - Any other esm files your esp needs (look on the right under \\\"Parent Masters\\\")\r\nClick \\\"Set as Active File\\\" to set your face\\'s .esp active and click \\\"OK\\\".  The CK will think for a while and probably spit out an error message about parent spaces; just click \\\"Yes to All\\\", you can safely ignore it.\r\n\r\n3. In the \\\"Object Window\\\", click on \\\"Actors\\\" and scroll down until you find your NPC.  Double-click on the name and, when the window opens up, click the checkbox for \\\"Is Chargen Face Preset\\\".  Click OK.\r\n\r\n4. Open the \\\"Character\\\" tree and click \\\"Race\\\", then double-click whatever your NPC\\'s race normally is.  Use the arrows to find the \\\"Preset NPCs\\\" tab (be sure the radio button on the top of the window has female selected).  While keeping the window open, go back to the Object Window, and go up to Actor->Preset; there should be a preset listed with the NPCs name.  Drag-and-Drop it into the list on the Race\\'s Preset tab.  Click OK, then File -> Save.\r\n\r\n[color=coral]Part 2: Creating a .npc file to store your re-designed face[/color]\r\n5.  Now start up the game with the TSoL.esp(s) and .esm disabled and your face-changer\\'s esp enabled.  Open the console and use the \\\"showracemenu\\\" command.  Select whatever race your preset is under, move the Preset slider until you find the face you wanted, then finish/name your character.\r\n\r\n6. Open the console again and type \\\"spf XXXX\\\", where \\\"XXXX\\\" is the name of the character.  This creates an XXXX.npc file in the Skyrim directory.  Exit the game.\r\n\r\n7. Open XXXX.npc with notepad and delete the \\\"Race:\\\" entry (it should be on the 2nd line), then save it.\r\n\r\n[color=coral]Part 3: Creating a new plug-in for your NPC with their new Face & Race[/color]\r\n8. Re-start the CK.  Go to File -> Data... and select Skyrim.esm, Update.esm, and The Spice of Life.esm.  Don\\'t make an active file, just click OK.\r\n\r\n9. Find the character whose face you want to change under \\\"Actor\\\" and double-click.  First arrow over to \\\"Character Gen Parts\\\" and make note of hair style, eye color, and eyebrow style under \\\"Base Head Parts\\\" as they don\\'t seem to get set correctly on custom races.  Click the checkbox on the bottom titled \\\"Head\\\" so you can see what\\'s going on.\r\n\r\n10. In the \\\"Traits\\\" tab, select the custom race for your NPC from the pulldown.  This will automatically reset the face to a default.  Now, on at the top of \\\"Character Gen Parts\\\" click the button that says \\\"Import\\\" and choose the .npc file you made earlier.\r\n\r\n11. If you need to put the hair or eyes back to normal or whatnot, keep the character window open.  In the Object Window open Character->HeadPart, then find the correct body pieces on the list and Drag-and-Drop them into the Head Parts list in the character window.  When done, click OK.\r\n\r\n12. Go to File -> Save and name your new .esp whatever you like.\r\n\r\n13. Select your NPC in the Actor window and hit ctrl-F4.  This will export the NPCs face data into the facegendata folders (and overwrite whatever is already there).  Be sure \\\"Is CharGen Face Preset\\\" is not checked, or it will not export the data.\r\n\r\nCongratulations, you\\'re done!  Use this newly created esp [i]instead[/i] of the original face replacer, and load it [i]after[/i] the files from this mod.  Now you have a character with a new face AND a unique body :)\r\n\r\n\r\n[center][color=cyan][size=2][b]Acknowledgements[/b][/size][/color][/center]\r\n\r\nThank you very much to [b]Luchaire[/b] for writing this [url=http://grotto.moddersrealm.com/index.php?topic=12723.0]great, illustrated tutorial[/url] on creating custom-textured races, and to [b]d_rail1602[/b] for linking to it and giving instructions on how to change the models as well.  Thank you also to [b]angelmeats[/b], who generously worked with me and provided some of his own modding resources to help me iron things out, and to [b]raintrw[/b] for his [url=http://skyrim.nexusmods.com/downloads/file.php?id=5968]Unique Bodies[/url] project which got me started on this.  I really haven\\'t done anything special with this mod, I\\'ve only done some legwork with the instruction of others.\r\n\r\nAlthough they are not included in this mod, thank you to EVERY modder who designs custom bodies and textures for this game (and hair and eyes, too!), you are all much more talented artists than I.  There are too many to mention all of them, but the ones featured in my own screenshots are [b]Caliente[/b]\\'s CBBE (altered with BodySlide) with [b]XdyeXD[/b]\\'s [url=http://skyrim.nexusmods.com/downloads/file.php?id=6232]Alternative CBBE Texture[/url], [b]dimon99[/b]\\'s UNP with [b]navetsea[/b]\\'s textures, [b]arison_c[/b]\\'s [url=http://skyrim.nexusmods.com/downloads/file.php?id=12179]Rebirth Body[/url], [b]Thor925[/b] and the [b]TnT[/b] team\\'s Hera body, and [b]brurpo[/b]\\'s [url=http://skyrim.nexusmods.com/downloads/file.php?id=5290]Babe Mk-V Body[/url].  Hopefully this mod encourages people to make some use of and appreciate the lesser-known bodies available here on the Nexus, they are all beautiful and all have their appropriate places.\r\n\r\nFor anyone curious, my screenshots also show [b]apachii[/b]\\'s ApachiiSkyHair (on Jordis), [b]YellowPaint[/b]\\'s [url=http://skyrim.nexusmods.com/downloads/file.php?id=15403]Jordis face change[/url] morph, [b]Axeface[/b]\\'s [url=http://skyrim.nexusmods.com/downloads/file.php?id=8331]Mjoll Facelift[/url] (war paint slightly altered by myself), and [b]NomadicAl7[/b]\\'s [url=http://skyrim.nexusmods.com/downloads/file.php?id=15905]Sultry Brelyna Maryon[/url] morph, and last but not least, my personal favorite face skin, [b]necKros[/b]\\'s [url=http://skyrim.nexusmods.com/downloads/file.php?id=1329]Beauty Faces for females[/url].",
  "categoryId": "29",
  "version": "1.04",
  "author": "Gawdzila",
  "createdUnix": "1336434328",
  "updatedUnix": "1336687103",
  "containsAdultContent": true,
  "uploadedBy": "Gawdzila",
  "primaryFile": null,
  "files": [
    {
      "fileId": "59705",
      "name": "TSoL - All NPCs - EZ Install Fixed",
      "version": "1.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7431",
      "fileName": "TSoL - All NPCs - EZ Install Fixed-16668.7z",
      "uploadedUnix": "1336461377",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/21480db51b845d06d3db41663a2ccf7802178c55335c17c7ae8ccb576aa6a33c/analysis/1406876889/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TSoL%20-%20All%20NPCs%20-%20EZ%20Install%20Fixed-16668.7z?fid=59705&ttl=1535782021&ri=8192&rs=8192&setec=38568ee50ed1e77554c8ceed54cad002"
    },
    {
      "fileId": "59706",
      "name": "TSoL - Housecarls",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4522",
      "fileName": "TSoL - Housecarls-16668.7z",
      "uploadedUnix": "1336462714",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/db99373017a28ee0110b7792f0dd296e131cc25e55c203035c41582afbe865a4/analysis/1406883729/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TSoL%20-%20Housecarls-16668.7z?fid=59706&ttl=1535782021&ri=8192&rs=8192&setec=7152005c21aa835d235bb211eaaa409e"
    },
    {
      "fileId": "59707",
      "name": "TSoL - Marriable Followers",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5245",
      "fileName": "TSoL - Marriable Followers-16668.7z",
      "uploadedUnix": "1336463251",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/1c8e5e9614166380e58192b9d7adcd2ab0ae1b916b7b3a977223b316b42318b2/analysis/1406876945/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TSoL%20-%20Marriable%20Followers-16668.7z?fid=59707&ttl=1535782022&ri=8192&rs=8192&setec=c2b41792e91199c7c1b3ec6c20ee642c"
    },
    {
      "fileId": "59708",
      "name": "TSoL - Marriable Followers - Nicer Faces",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5099",
      "fileName": "TSoL - Marriable Followers - Nicer Faces-16668.7z",
      "uploadedUnix": "1336463669",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/1cf5e5e51ef3d8ee96560ec680f68c1560002ecef5ac8e07485be8e7662b94c7/analysis/1406876951/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TSoL%20-%20Marriable%20Followers%20-%20Nicer%20Faces-16668.7z?fid=59708&ttl=1535782022&ri=8192&rs=8192&setec=68cbc4bee0195cba1261bd410c4d0e11"
    },
    {
      "fileId": "59710",
      "name": "TSoL - Marriable Non-Followers",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4906",
      "fileName": "TSoL - Marriable Non-Followers-16668.7z",
      "uploadedUnix": "1336464815",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/a4f3825419b60c9c6bd5fcf5a70750a383ebec63ad3c66fd74156764e44f0cad/analysis/1406877006/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TSoL%20-%20Marriable%20Non-Followers-16668.7z?fid=59710&ttl=1535782023&ri=8192&rs=8192&setec=29702168bfd4101ce7fb6c40a394a23c"
    },
    {
      "fileId": "59711",
      "name": "TSoL - Marriable Non-Followers - Nicer Faces",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4854",
      "fileName": "TSoL - Marriable Non-Followers - Nicer Faces-16668.7z",
      "uploadedUnix": "1336465124",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/c41820c663eb76dc5948963c3da489dda436e72a4e76b1e2d8d365c69649dd17/analysis/1406877009/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TSoL%20-%20Marriable%20Non-Followers%20-%20Nicer%20Faces-16668.7z?fid=59711&ttl=1535782024&ri=8192&rs=8192&setec=e9dc91e093f244c7e79a498d178cf950"
    },
    {
      "fileId": "59712",
      "name": "TSoL - Non-Marriable Followers",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4754",
      "fileName": "TSoL - Non-Marriable Followers-16668.7z",
      "uploadedUnix": "1336465685",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/d89ca5d61c3ed3ddaf0a3a5e1bf34d6780caf3017b29d27a06aeeb8417bd7cd1/analysis/1406877014/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TSoL%20-%20Non-Marriable%20Followers-16668.7z?fid=59712&ttl=1535782024&ri=8192&rs=8192&setec=5e1b7485f5e82eef20c89cadbe8ef8a7"
    },
    {
      "fileId": "59713",
      "name": "TSoL - Non-Marriable Followers - Nicer Faces",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4701",
      "fileName": "TSoL - Non-Marriable Followers - Nicer Faces-16668.7z",
      "uploadedUnix": "1336466046",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/dced5d4eb8aa8dac285c503b472c7a246e13bbfcc816ebfdf72c8f2b68cd7f84/analysis/1406877065/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TSoL%20-%20Non-Marriable%20Followers%20-%20Nicer%20Faces-16668.7z?fid=59713&ttl=1535782025&ri=8192&rs=8192&setec=759bd2be93ee5b1251a86af4d3b96a50"
    },
    {
      "fileId": "59965",
      "name": "TSoL - All NPCs v103",
      "version": "1.03",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7476",
      "fileName": "TSoL - All NPCs v103-16668-1-03.7z",
      "uploadedUnix": "1336562616",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/d64532b376000aa256c8f6f9ca36e4ee26e045874bc933f0eab64dc085875bab/analysis/1406880248/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TSoL%20-%20All%20NPCs%20v103-16668-1-03.7z?fid=59965&ttl=1535782025&ri=8192&rs=8192&setec=d0190b6093df9e42a09dbe47ae74478a"
    },
    {
      "fileId": "60323",
      "name": "The Spice of Life v104",
      "version": "1.04",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25",
      "fileName": "The Spice of Life v104-16668.7z",
      "uploadedUnix": "1336687103",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/f242c35e283de467e885553cd78aa110c8297dd05eec1d9e6887bcac376843f8/analysis/1406883378/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Spice%20of%20Life%20v104-16668.7z?fid=60323&ttl=1535782026&ri=8192&rs=8192&setec=0724d5a62153d048eb38ce5f64f479fa"
    }
  ]
}