{
  "modId": 16672.0,
  "modName": "Dovahkiin Powers Up by programkira",
  "summary": "Creates the Dovahkiins Armor set using the daedric armor skins, it comes pre enchanted and with special stats, the weight of each item is reduced by half and also comes with an armor buff that can only come from a true Dragonborn. This mod is OP but with my improvements to come, it will be more balanced.",
  "descriptionHtml": "Creates the Dovahkiins Armor set using the daedric armor skins, it comes pre enchanted and with special stats, the weight of each item is reduced by half and also comes with an armor buff that can only come from a true Dragonborn. This mod is OP but with my improvements to come, it will be more balanced. This is because when I make the smithing recipe and make the items dis-enchantable the recipe will require a mix of rare ingredients and sizeable, but feasable quantities of them. If you want to get the items, simply open your console and type \\\"help Dovahkiin 0\\\" with out the \\\" \\\" marks and the use player.additem _________ # to get the items added to your inventory. I have not tried using a code to add the enchantments to my character, but that should work as well.\r\n\r\nIn the future, I plan to make a special dungeon with a special quest that will test you abilities as the Dragonborn as only a true Dovahkiin is wrthy of wearing this armor set with ring and amulet. The trials you will have to face will be immense and will test your battle strategy and survival skills as I want you to embrace the difficulty of what a dragonborn must face as he/she struggles for their life against incredible enemies. Essentially, the Dovahkiin will face an army in this quest but as the enemies get stronger, there becomes even more of them untill the very end when the Dragonborn must face an enemy so powerful that he/she/it requires no security, the best security this oss needs  is that they are there.\r\nor at least that is what I hope, but I dont know how it will turn out as i first need to make a smithing recipe and enchanting recipe for the items so if any of you know how or of a great tutorial of how to make one, please send it to me, you will be mentioned and thanked for your contribution to helping me make this mod into something lore friendly and exceptional.",
  "categoryId": "75",
  "version": "1.0",
  "author": "programkira",
  "createdUnix": "1336438958",
  "updatedUnix": "1336618178",
  "containsAdultContent": false,
  "uploadedBy": "programkira",
  "primaryFile": null,
  "files": [
    {
      "fileId": "59862",
      "name": "Dovahkiin Powers Up",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Dovahkiin Powers Up-16672-1-0.zip",
      "uploadedUnix": "1336521804",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4f1b3af3ea6ee3d5c3202b4b9401f0c3067c64d085c0c02dc6806ebdaa2ac15a/analysis/1406879162/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovahkiin%20Powers%20Up-16672-1-0.zip?fid=59862&ttl=1535782035&ri=8192&rs=8192&setec=321786c22f3c6f22f028d1352c04bac6"
    },
    {
      "fileId": "60128",
      "name": "Dovahkiin Powers Up Update 1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Dovahkiin Powers Up Update 1-16672-1-1.zip",
      "uploadedUnix": "1336618178",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/810acaa4755ce49fbc3bb3a09ecb7c6b1cf810236f990f69de6111f8663889b3/analysis/1406881568/",
      "changelogHtml": " Added smithing recipies for all armor pieces <br/> \n Added Tempering recipies <br/> \n Added the ability to craft Filled Grand SoulGems at a smelter, but they require a lot of materials to make it less OP <br/> \n Added smithing recipies for amulet and ring <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovahkiin%20Powers%20Up%20Update%201-16672-1-1.zip?fid=60128&ttl=1535782036&ri=8192&rs=8192&setec=f4e4d686a3c27d203b7981682250ce22"
    }
  ]
}