{
  "modId": 16691.0,
  "modName": "Vampiric Thirst",
  "summary": "Do you love playing vampire characters but just like me found the vanilla vampirism incomplete and not very interesting? Can you say &#34;afterthought&#34;? &#34;Vampiric Thirst&#34; offers to change that by challenging the way you&#39;re used to playing a vampire in Skyrim. It is not just an improvement: almost everything has been redone from scra",
  "descriptionHtml": "[center][color=gold][b][size=16]Vampiric Thirst: Dawnguard Edition is now available&#33;\r<br />This version is old, buggy, obsolete and no longer supported, please use Dawnguard Edition instead&#33;[/size][/b][/color]\r<br />http://skyrim.nexusmods.com/mods/24222/[/center]\r<br />\r<br />[center][color=darkred][b][size=16]~~~~~~~~~~~~~~~~~~~~\r<br />&#34;Vampiric Thirst&#34; by Miss Leeches\r<br />~~~~~~~~~~~~~~~~~~~~[/size][/b][/color][/center]\r<br />\r<br />Do you love playing vampire characters but just like me found the vanilla vampirism incomplete and not very interesting? Can you say &#34;afterthought&#34;? &#34;Vampiric Thirst&#34; offers to change that by challenging the way you&#39;re used to playing a vampire in Skyrim. It is not just an improvement: almost everything has been redone from scratch&#33;\r<br />\r<br />[center][color=darkred][b][size=16]~~~~~~~~~~~~~~~~~~~~\r<br />Description and features\r<br />~~~~~~~~~~~~~~~~~~~~[/size][/b][/color][/center]\r<br />\r<br />&#34;Vampiric Thirst&#34; is Skyrim vampirism rewritten from scratch. It strives to preserve the feeling that Bethesda originally intended but functions in a completely different way. Those of you who are familiar with mods like &#34;Vampiric Hunger&#34; for Morrowind, &#34;Unholy Darkness&#34; for Oblivion or &#34;Vampire the Masquerade: Bloodlines&#34; game will feel very much at home with the systems of deteriorating blood, ageing, progressive development of abilities and versatility of hunting methods but it also introduces some unique features of its own and makes those systems fit into Skyrim and utilises some solutions that weren&#39;t technically possible before.\r<br />\r<br />Specifically mod offers the following:\r<br />- [b]New hunger system[/b] based on blood instead of time with 6 stages that come with some penalties and perks. Keep well fed and you may even be able to walk in sunlight without the fear of death for some time but beware starvation for it can drive you insane&#33;\r<br />- [b]Sunlight damage[/b] that is dynamically calculated based on weather, time of day, state of hunger and even brightness&#33; Yes that means you can actually use shadows to diminish sunlight damage now&#33;\r<br />- [b]Ageing[/b] that increases your innate advantages and potency of many vampiric powers with five attainable stages out of ten that are available to NPC vampires but... who knows? Perhaps I have a future update in mind to make the rest playable too ^^ It takes in all about 9 months of game time to mature from Fledgling to Bloodkin.\r<br />- [b]Vampiric experience and 18 powers[/b] that can be unlocked as you advance&#33; Some of them are vanilla abilities redone to be more interesting and others are brand new. Most of them get more powerful as you age.\r<br />- [b]Hunting and feeding[/b] systems that cater to different playstyles: stealthy, social, brutal and even magically inclined vampires all will find something for themselves. Fully animated&#33;*\r<br />- [b]Qualities and flavours of blood[/b] that give you a reason to think about your &#34;diet&#34; and over time recognise and reward your taste and unique palette&#33;\r<br />- [b]Designed for compatibility[/b] with other mods, easy to add support for custom races (instructions below) and already prepared for future updates and new features I&#39;m going to add.\r<br />\r<br />* for now most of the animations are just unarmed finishers warming the seat for real feeding idles that will hopefully become available someday. Sadly I cannot make new animations.\r<br />\r<br />[center][color=darkred][b][size=16]~~~~~~~~~~~~~~~~~~~~\r<br />Updates\r<br />~~~~~~~~~~~~~~~~~~~~[/size][/b][/color][/center]\r<br />\r<br />[b]08 May 2012[/b]: 1.1 version released&#33; Please remove the older one&#33; It looks like everything worked incorrectly as an esm (and I have no idea why&#33;) The esp version should fix it. I&#39;m sorry for the trouble&#33;\r<br />[b]08 May 2012[/b]: 1.2 version released&#33; It fixes a small problem with seduction dialogue disappearing and makes it so wearing closed helmets and gags prevents feeding (correctly this time ^^)\r<br />[b]08 May 2012[/b]: 1.21 version released&#33; It fixes a wrong condition in the main script, you should be able to get the power unlocking menu now&#33; (You can use the menu hotfix instead if you already have version 1.2)\r<br />[b]09 May 2012[/b]: 1.25 version released&#33; Changing into vampire should no longer start you out starved (you will now receive a starting amount of blood depending on your health) and adds the feed key functionality as a lesser power for those who for some reason can&#39;t or don&#39;t want to use the hotkey.\r<br />[b]10 May 2012[/b]: 1.3 version released&#33; Now it&#39;s possible to store blood if you have empty bottles&#33; Additionally racial blood quality bonuses and penalties should apply correctly now and Vampiric Drain should correctly give you experience upon killing your victim. By request it also allows to feed on sleeping children but removes the ability to seduce them (because that&#39;s just gross&#33;)\r<br />[b]10 May 2012[/b]: 1.31 version released&#33; Now daylight speed debuff should work right (reduce your attack speed by 50%) and bottling paralysed victims&#39; blood should become possible too&#33;\r<br />[b]11 May 2012[/b]: 1.35 version released&#33; I tweaked the new vampire&#39;s sight shader to be clearer, rebalanced &#34;Necrotic Flesh&#34; to be more useful, allowed the cost of &#34;Vampiric Drain&#34; to be reduced by the novice Destruction perk and fixed &#34;Extended Perception&#34; so now time slows down for both player and the world like it was supposed to. Also hopefully bite tokens on npcs will clear correctly now while player is away&#33;\r<br />[b]11 May 2012[/b]: 1.36 version released&#33; Now some npcs should no longer die after feeding if they shouldn&#39;t die after feeding.\r<br />[b]13 May 2012[/b]: 1.37 version released&#33; It extends the functionality of the feed hotkey to allow feeding on sleeping victims (previously only available on activation) and on fresh corpses (dead no longer than an hour). Additionally I changed some feeding conditions so hopefully custom races should have no problems now (IF you followed the instructions from the &#34;Compatibility notes&#34; part below properly&#33;)\r<br />[b]30 May 2012[/b]: 1.5 version released&#33; The feeding system as well as blood loss recovery for npcs have been streamlined for easier management and less impact on performance. Feeding now damages the victim by a percentage of total health instead of flat values. Blood loss has been redone completely from scratch.  The rate of recovery is also now based on percentages (24 hours allow the victim to recover about 50% of total health but she or he will not regain natural regeneration until all blood loss damage has healed) IMPORTANT: The new system uses &#34;Variable01&#34; and &#34;Variable08&#34; actor values to track recovery status so conflicts with other mods that use them may occur&#33;\r<br />[b]31 May 2012[/b]: 1.52 version released&#33; Weird things with hunger should no longer be happening if [url=http://skyrim.nexusmods.com/downloads/file.php?id=12625]No Boring Sleep-Wait Menu[/url] is used, a description error has been corrected (age stages in active magic effects should now correctly display the Illusion bonus) and the ageing function has been cleaned up of redundant conditions. Due to a serious possible conflict detected the blood loss recovery system is now using the unused &#34;Fame&#34; actor value instead of &#34;Variable01&#34;.\r<br />Also a configuration file is now included that allows to control things like the rate of ageing, sun damage and so on. To use it you just need to edit the text file to your liking and type &#34;bat mslVampiricThirst&#34; in console.\r<br />[b]03 June 2012[/b]: 1.6 version released&#33; Bottling blood should now be possible again. Additionally there are three new big features:\r<br />- Diablerie&#33; By draining powerful vampires (bosses or normal vampires of level equal or greater than yours) of their last drop of blood you can take a shortcut to power. Each diablerised vampire speeds up your ageing by one day. I&#39;m planning on expanding this feature in future updates&#33;\r<br />- Non lethal hostile feeding&#33; Now the &#34;v&#34; key has 2 modes: if you have your weapon drawn, fists raised or magic prepared combat or sneak feeding will act normally (default to draining enemies to death) but if your weapons are sheathed you will now receive the same menu of feeding options as other feeding methods, it will still be treated as assault but your victim will drop unconscious after that&#33; (This feature is experimental&#33; Your input will help me improve it so please share your impressions and experiences&#33;)\r<br />- Blood status hotkey&#33; It&#39;s &#34;b&#34; by default but can be changed to anything you desire in the configuration file&#33; When pressed it will display how much blood you have left in your blood pool.\r<br />[b]03 June 2012[/b]: 1.61 version released&#33; I forgot to put the latest scripts in the previous version, fixed now&#33; Additionally the debug update function should be more thorough now (type &#34;set mslVTUpdate to 0&#34; in console if you have problems with hotkeys, sun damage or don&#39;t have the essential &#34;Undeath&#34; ability)\r<br />\r<br />[center][color=gold][b][size=16]~~~~~~~~~~~~~~~~~~~~\r<br />Planned features\r<br />~~~~~~~~~~~~~~~~~~~~[/size][/b][/color][/center]\r<br />\r<br />- &#34;Masquerade&#34; system that tracks how well hidden your vampiric nature is in each Hold\r<br />- More varied age stage benefits\r<br />- A few new powers\r<br />- Expansion of the diablerie system\r<br />- Ability for 5-stage vampires to attain advanced age stages in a plausible way by following a questline full of mystery, intrigue and delving into Tamrielic lore\r<br />- New systems for advanced ages to make playing older vampires a different experience\r<br />- Redressing of a few scripts to make the mod more translation friendly\r<br />\r<br />[center][color=darkred][b][size=16]~~~~~~~~~~~~~~~~~~~~\r<br />Requirements and recommendations\r<br />~~~~~~~~~~~~~~~~~~~~[/size][/b][/color][/center]\r<br />\r<br />Skyrim Script Extender (version with Papyrus support&#33;) MUST be installed&#33; So far this mod uses only a couple little functions of it but it&#39;s going to be more and more dependent on SKSE functions as they become available.\r<br />You can find it under this link:\r<br />http://skse.silverlock.org/\r<br />\r<br />If you think that the &#34;dialogue&#34; parts disappear too fast use &#34;Fuz Ro D-oh - Silent Voice&#34; by shadeMe:\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=14884\r<br />\r<br />It&#39;s not a requirement but if you&#39;re like me and love you vampires pretty the mod &#34;Vampire Face Less Sunken Cheeks&#34; by devacore is just for you:\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=16506 \r<br />\r<br />And speaking of pretty you may want to install &#34;Vampire Face Fixes&#34; by bluedanieru too&#33;\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=13490 \r<br />\r<br />[center][color=darkred][b][size=16]~~~~~~~~~~~~~~~~~~~~\r<br />Installation\r<br />~~~~~~~~~~~~~~~~~~~~[/size][/b][/color][/center]\r<br />\r<br />[color=red]1. IMPORTANT&#33; If you are installing it on an existing character who&#39;s already a vampire you MUST use the &#34;mslVampiricThirstVampirismUpdater.esp&#34; from the optional download along with the main file the first time you run the game&#33; After it&#39;s done converting your character to VT vampirism you can uncheck it.[/color]\r<br />2. Unpack the archive and drop the files found inside into your Skyrim &#34;Data&#34; folder\r<br />3. Make sure to have the lastest version of Skyrim Script Extender (http://skse.silverlock.org/ ) installed&#33;\r<br />4. Make sure to put &#34;mslVampiricThirst.esp&#34; near the end of your load order and check it active in whatever plugin manager you use\r<br />6. ???\r<br />7. Profit&#33;\r<br />8. Also if you come across any problems please report them immediately&#33;\r<br />\r<br />[center][color=darkred][b][size=16]~~~~~~~~~~~~~~~~~~~~\r<br />Gameplay\r<br />~~~~~~~~~~~~~~~~~~~~[/size][/b][/color][/center]\r<br />\r<br />Before we get to the details there are some important things that you may want to know&#33; You may want to tone down your timescale a little if it&#39;s at the default value. The system is smart and adjusts to whatever timescale you have but you may find that with 20 (default) you run out of nighttime very quickly and you get hungry almost too fast to manage&#33; The mod was mostly tested on timescales 8, 10 and 14 and I&#39;d recommend setting it to one of those values (I&#39;m using 8 personally). Simply bring up the console with the tilde  key and type &#34;set timescale to X&#34; (where &#34;X&#34; put your desired value)\r<br />Another thing is the hotkey used for most feeding interactions. By default it&#39;s &#34;v&#34; but if you&#39;d like to use another key you can change it using your console. Type &#34;set mslVTKeyFeed to X&#34; (where &#34;X&#34; put the scancode for your desired key)\r<br />A list of scancodes is here: http://geck.bethsoft.com/index.php/IsKeyPressed , for example the code for &#34;v&#34; is 47 and for &#34;f&#34; it&#39;s 33. So typing &#34;set mslVTKeyFeed to 16&#34; in the console will change the feed key to &#34;q&#34;)\r<br />\r<br />[b]Vampire abilities:[/b]\r<br />Vampirism gives many benefits and advantages over common mortals but also crippling weaknesses that make it as much a blessing as a curse. If you like vampires to be invincible godlings with nothing to fear and nothing they can&#39;t do you will be very disappointed with this mod&#33; Actually&#33; Consider it a &#34;hardcore mode&#34; for vampires ^^\r<br />As undead creatures vampires:\r<br />- Are [b]immune to poison and disease[/b]\r<br />- Grow more [b]resistant to cold[/b] as they age\r<br />- Can [b]breathe underwater[/b] (or actually don&#39;t need to breathe at all)\r<br />- Move a lot [b]faster[/b] than mortals\r<br />- Do not tire easily ([b]increased stamina regeneration[/b])\r<br />- Gain special [b]affinity with stealth and Illusion magic[/b]\r<br />But those blessings are offset by:\r<br />- A [b]deadly weakness to sunlight and fire[/b] (200% at first but it&#39;s possible to diminish it with the right diet and powers)\r<br />- [b]No natural health regeneration[/b]\r<br />- [b]Halved effectiveness of healing spells[/b] used on them\r<br />- [b]Vulnerability to silver[/b]\r<br />- [b]Being affected by all spells designed to harm the walking dead[/b]\r<br />\r<br />[b]Vampiric powers:[/b]\r<br />As seen above vampires are not very impressive just like that and but that is not really their greatest strength. Raw ability is what werewolves are all about. For vampires I wanted something different and more interesting. And so I put the fun not in what they are but what they can do: powers. It&#39;s a broad collection of unique abilities based on TES lore, a tinge of &#34;Vampire the Masquerade&#34; and maybe a little little bit of &#34;Bloodrayne&#34; plus my own ideas. They range from the ability to control mortal minds to brief surges of astonishing strength to powerful and strange magics drawn from blood. Using them makes you hungrier but the things they can do are well worth the cost. They are divided into toggleable (you can switch them on and off and they drain your blood continuously) instant (that drain blood when they&#39;re activated and usually have an immediate effect) and rites (blood rituals that have a slightly long casting time and need blood to activate as well as for whatever they do but they also belong to the most powerful powers available) as well as basic (mostly redressed vanilla powers that need to be unlocked before advanced are available), advanced (more sophisticated or specialised uses of the powers) and combined (that blend two or more types of powers together, not available in the first release but I&#39;m planning to include them in the future&#33;)\r<br />They powers available so far are:\r<br />\r<br />Subtlety - Mesmerism:\r<br />- [color=red][b]Seduction[/b][/color] [u](Basic. Instant)[/u]: a vampire begins developing her or his hypnotic abilities by learning to put the victim into a state of high suggestibility in which she or he can be easily manipulated. A brief eye contact, entrancing whisper or light touch is enough to put a victim in this state making her or him docile and very vulnerable to simple suggestions that do not overtly violate her or his sense of morality or survival instinct. Being harmed immediately brings the victim out of this trance.\r<br />- [color=red][b]Entrancement[/b][/color] [u](Advanced. Instant)[/u]: a vampire can deepen the trance of a victim already under Seduction to turn her or him into a willing slave who will mindlessly follow the vampire and strive to fulfil the master&#39;s every wish (sometimes even without the master&#39;s consent...) but any physical harm that befalls the victim will still break the spell.\r<br />\r<br />Subtlety - Deception:\r<br />- [color=red][b]Embrace of Shadows[/b][/color] [u](Basic. Toggleable)[/u]: one of the least refined but undeniably useful powers of Deception that a vampire can learn is the ability to simply vanish from sight and remain like that for a very long time.\r<br />- [color=red][b]Veil of the Night[/b][/color] [u](Advanced. Toggleable)[/u]: although underwhelming for the many vampires of simple minds and desires those who prefer to err on the side of finesse and delicacy find this ability indispensable. Staying out of bright light allows them to become as subtle as the shadows that conceal them by enhancing their charm, subterfuge and elusiveness.\r<br />\r<br />Subtlety - Senses:\r<br />- [color=red][b]Vampire&#39;s Sight[/b][/color] [u](Basic. Toggleable)[/u]: the ability to see in the dark is one of the most basic, most universal and most intrinsic advantages of vampirism. As nocturnal predators all vampires have a natural affinity for it.\r<br />- [color=red][b]Blood Sense[/b][/color] [u](Basic. Toggleable)[/u]: all vampires can smell blood (although that sense normally is only acute enough to be reliable when they&#39;re hungry) and all can taste and discern different flavours of it but they can still choose to hone this sense even further. This power allows to detect the presence of fresh blood in vicinity as well as assess its quality and the owner&#39;s vitality. Connoisseurs of quality blood and those who take care not to drain their victims to death find this ability indispensable.\r<br />\r<br />Might - Potence:\r<br />- [color=red][b]Deadly Strength[/b][/color] [u](Basic. Toggleable)[/u]: even the most innocently looking vampire can prove capable of astonishing and very often lethal feats of strength. This ability allows to cause devastating damage and carry the heaviest burdens.\r<br />- [color=red][b]Ferocious Surge[/b][/color] [u](Advanced. Instant)[/u]: no matter if a vampire is one of the Cyrodilic masters of camouflage thriving in comforts of high society or a monstrous wretch haunting the sewers beneath a city, all of them are voracious beasts of prey in one way or another. This powers helps to bring that vicious animal to the fore for a brief time and let it wreak carnage.\r<br />\r<br />Might - Reflexes:\r<br />- [color=red][b]Extended Perception[/b][/color] [u](Basic. Toggleable)[/u]: most if not all breeds of vampires possess some innate agility that an average mortal would have difficulty to match but it is certainly not the end of a vampire&#39;s potential. With this ability a vampire can sharpen her or his awareness and react to danger with uncanny swiftness and precision.\r<br />- [color=red][b]Celerity[/b][/color] [u](Advanced. Instant)[/u]: for a brief time a vampire can become so fast that to outside observers she or he seems no more than a flash that vanishes from one place and a moment later appears in another leaving a trail of corpses in between.\r<br />\r<br />Might - Fortitude:\r<br />- [color=red][b]Vigor Mortis[/b][/color] [u](Basic. Toggleable)[/u]: a vampire&#39;s undead body no longer functions like a living person&#39;s. Its heart doesn&#39;t beat, blood doesn&#39;t flow and tissue does not regenerate on its own. But with this ability a vampire is able to use the vitality carried by the living blood she or he has consumed to return her or his body to a semblance (or mockery) of life that allows it to mimic some of those vital functions. While this power is active it returns functionality to certain organs and heals the vampire&#39;s flesh whenever she or he suffers injury.\r<br />- [color=red][b]Necrotic Flesh[/b][/color] [u](Advanced. Toggleable)[/u]: this power is the flipside of Vigor Mortis that emphasises and enhances the vampiric body&#39;s cadaverous qualities instead of mimicking life. It makes the vampire&#39;s flesh resistant to the sensation of pain as well as physical damage and fire but for some puzzling reasons does not protect at all against silver, wood or weapons of Daedric origin.\r<br />\r<br />Magic - Blood Magic:\r<br />- [color=red][b]Vampiric Drain[/b][/color] [u](Basic. Spell)[/u]: this spell allows a vampire to drain the lifeforce of a living being and use it to heal her or his own flesh. Additionally if a victim is killed by this power it may also sate the vampire&#39;s hunger.\r<br />- [color=red][b]Sanguine Nexus[/b][/color] [u](Advanced. Rite)[/u]: by performing a brief but very draining rite a vampire can dramatically increase her or his capacity for holding blood but at the cost of getting hungry much faster. No blood mage performs this ritual lightly but it can offer huge power to someone who knows what she or he is doing and prepares well.\r<br />\r<br />Magic - Mortuus Sanguine:\r<br />- [color=red][b]Corpse Marionette[/b][/color] [u](Basic. Instant)[/u]: also known as &#34;Vampire&#39;s Servant&#34; this ability allows a vampire to temporarily raise a corpse to do her or his bidding by splashing it with a few drops of her or his blood.\r<br />- [color=red][b]Shambling Hordes[/b][/color] [u](Advanced. Rite)[/u]: a powerful but potentially very costly ritual that allows a vampire to raise all corpses nearby as her or his servants by seeding the ground on which they lie with her or his blood.\r<br />\r<br />Magic - Sarx Sorcery:\r<br />- [color=red][b]Rending Claws[/b][/color] [u](Basic. Toggleable)[/u]: the first steps a vampire makes on this path is usually learning to adapt the features of predatory animals such as an eagle&#39;s talons or asp&#39;s tongue. In this particular case the claws allow to inflict terrible bleeding wounds and cut through armour with fearsome ease.\r<br />- [color=red][b]Mistform[/b][/color] [u](Advanced. Instant)[/u]: for a brief time a vampire can vaporise into mist and become impervious to harm but at the same time unable to inflict it. The mist is too cool and heavy to fly but it can hover over the ground and move wherever the vampire desires. However being submerged in water dissolves this form forces the vampire out of it.\r<br />\r<br />And many, many more to come&#33; I have some ideas already and I&#39;m also open to suggestions&#33;\r<br />\r<br />[b]Feeding:[/b]\r<br />\r<br />Many ways of acquiring blood are possible for characters with different talents and sensibilities. The &#34;v&#34; key is used by default to initiate most of the new feeding interactions.\r<br />- You can invade your prey&#39;s homes and feed on them in their sleep\r<br />- You can use your charms to to get into their good graces and personal space\r<br />- You can use the &#34;Vampiric Drain&#34; spell of Blood Magic to kill your foes and claim their lifeforce\r<br />- You can sneak upon them and use the &#34;v&#34; key to drain them dry before anyone can notice\r<br />- You can tear their throats open in the heat of combat using the &#34;v&#34; key\r<br />- You can feed without fear of retaliation on those you have paralysed with poison or magic using the &#34;v&#34; key\r<br />- And if you can restrain them the &#34;v&#34; key will also allow you to drain them safely\r<br />- Or if you do not wish to feed immediately you can store your victims&#39; blood for later if you have empty bottles available&#33;\r<br />\r<br />Be careful with your feeding though&#33; Your victims need a long time to recover from blood loss and it can kill them. Additionally wounds from vampire bites cannot be healed with magic&#33; That makes feeding on your followers generally a very bad idea but if having some expendable bag of warm blood following your around can still help you in times of need or out in the wilderness...\r<br />\r<br />[b]Blood and hunger:[/b]\r<br />\r<br />Hunger in &#34;Vampiric Thirst&#34; is no longer based just on time passed but it actually keeps track of the blood you drink and spend to power your unholy abilities. You do not need blood to survive: a vampire can live indefinitely with blood in their system or not but the hunger is not something you can just ignore. If you do it will turn you into a mindless beast able to think only of its thrist and willing to do anything for a small droplet of blood. Various effects accompany the six stages of hunger you can enjoy or suffer. Being fully fed (above 90% of your maximum blood pool) will make you immune to sunlight while letting yourself go hungry will inflict many detrimental  conditions such as diminishing your magicka regeneration and sociability, inability to use your powers, increased sun damage as well as certain mixed blessings like sharpening your senses, increasing your chance of successfully draining foes in combat at the cost of making it harder to seduce them, making animals fear you and undead treat you as one of their own and so on...\r<br />\r<br />Blood also comes with different flavours and qualities&#33; At first your taste will not be refined enough to benefit or suffer from most of them but as you sample different genders and races and find your favourites their blood will become more nourishing to you and you may even gain special bonuses from your favoured flavours if you are picky enough&#33; But at the same time your tolerance for blood you avoid will become weaker and the flavours will at first become less nourishing and further down the way even poisonous&#33; Every vampire develops and refines her unique taste over time.\r<br />\r<br />Blood always deteriorates naturally over time and using your vampiric abilities can make your tummy growl a lot sooner. But while you are sleeping it can slow down the rate at which you get hungry. Vampires can go on without sleep forever but most prefer to sleep during daytime to conserve their strength.\r<br />\r<br />[b]Ageing and experience:[/b]\r<br />\r<br />Vampires begin their new life hungry, confused and weak. The first week is a nightmare that very few of them manage to survive. They are slaves to never ending hunger that reminds of its presence faster than they can find new prey to drain to death and add to their loooong trail of corpses. But after some time things get better. The vampire eventually either meets a horrid end or learns to survive and slowly master her hunger. Generally after about a year a vampire is considered &#34;no longer a baby&#34; and has enough control over herself that accidents happen only by her negligence. The title of &#34;Bloodkin&#34; means that her bloodline is ready to recognise her as perhaps a little more than a worthless mistake. That is not the end of a vampire&#39;s growth but the remaining development is not playable because a normal game isn&#39;t likely to last several hundred years ^^\r<br />\r<br />But I am also planning to release an &#34;alternative start&#34; mod that will make it possible to roleplay the game as a more mature vampire at stages from 6 to 9 or even 10&#33; (With some special features that come with the advanced age...)\r<br />\r<br />Age increases the effectiveness of many unlockable powers and increases a vampire&#39;s natural speed, stamina regeneration, resistance to frost and affinity with stealth and Illusion.\r<br />\r<br />Aside from ageing there also exists another kind of development: experience. It&#39;s independent of age and can only be gained by feeding, using your powers and doing other &#34;vampiric&#34; things. From time to time if you gain enough experience you will receive points to spend on unlocking new powers.\r<br />\r<br />[center][color=darkred][b][size=16]~~~~~~~~~~~~~~~~~~~~\r<br />Known bugs and issues\r<br />~~~~~~~~~~~~~~~~~~~~[/size][/b][/color][/center]\r<br />\r<br />- When using &#34;Veil of the Night&#34; the magic effect shows the bonus but the skills tab doesn&#39;t. I don&#39;t know what&#39;s causing it but that&#39;s just a cosmetic issue. The power works exactly as intended behind the scenes. Your increased skill levels won&#39;t show but they are there&#33;\r<br />- When assessing the quality of Imperials with &#34;Blood Sense&#34; the message prints their race in ALL CAPS. I&#39;m not sure why that is either. All the other races&#39; names show correctly. But that&#39;s also just a cosmetic issue and perhaps only happens to me.\r<br />- There&#39;s a brief hiccup when Mistform ends. That&#39;s another puzzling thing&#33; I think it has something to do unequipping the invisible wholebody suit I put on player. Nothing serious but I&#39;ll be trying to make the transition a little smoother.\r<br />- While in mistform the outline of your character&#39;s weapon may still hover in the air. That&#39;s something I couldn&#39;t get around without using the vanilla invisibility shader (which messes up character&#39;s eyes&#33;) and I din&#39;t want that. It&#39;s just a visual glitch.\r<br />- Mistform will unequip your helmet. Sorry, I needed to do that to make the player&#39;s form completely invisible (it doesn&#39;t look very good otherwise&#33;)\r<br />- The vanilla Illusion perks &#34;Hypnotic Gaze&#34; and &#34;Kindred Mage&#34; do in fact increase the effectiveness of Mesmerism powers but those bonuses don&#39;t show in their descriptions (I don&#39;t know why)\r<br />- Custom races may still have problems even if you followed my compatibility procedure detailed below. Sadly I cannot do anything about it alone. The creators of those races must be persuaded to leave the mechanisms governing vanilla vampirism ALONE or they will continue to conflict with most if not all vampirism overhauls&#33;\r<br />\r<br />[center][color=darkred][b][size=16]~~~~~~~~~~~~~~~~~~~~\r<br />Compatibility notes\r<br />~~~~~~~~~~~~~~~~~~~~[/size][/b][/color][/center]\r<br />\r<br />This mod is not compatible with anything that changes the &#34;PlayerVampireQuestScript&#34; script, &#34;PlayerVampireQuest&#34; quest, &#34;VampireFeed&#34; perk and &#34;VampirePoisonResist&#34;, &#34;VampireHuntersSight&#34;, &#34;VampireVampirism&#34; spells. So that probably means any other vampire mods. Also the following actor values are used by this mod to track blood loss recovery for npcs: &#34;Fame&#34; and &#34;Variable08&#34;.\r<br />\r<br />It IS compatible with any race overhauls (it doesn&#39;t modify vampire races) and even can be made to work with custom races if you just follow the couple simple steps below&#33;\r<br />\r<br />How to make a custom race compatible with Vampiric Thirst?\r<br />1. Open Creation Kit (download it from Steam if you don&#39;t have it)\r<br />2. Load both &#34;mslVampiricThirst.esp&#34; and whatever mod contains the race you want to make compatible. MAKE SURE that the custom race has both a mortal and vampire version&#33;\r<br />3. Locate &#34;mslVTRacesFL&#34; and &#34;mslVTRacesVampiresFL&#34; under Miscellaneous-&gt;FormList and open them both.\r<br />4. Now find the race you want to make compatible under Character-&gt;Race and drag its mortal version into &#34;mslVTRacesFL&#34; and its vampire version into &#34;mslVTRacesVampiresFL&#34; (it won&#39;t work if either mortal or vampire version is missing&#33;)\r<br />5. Make sure that both versions of the race have the exact same index in both formlists&#33;\r<br />6. Press &#34;OK&#34;\r<br />7. Save your plugin&#33;\r<br />8. Open &#34;Wrye Bash&#34; (http://skyrim.nexusmods.com/downloads/file.php?id=1840)\r<br />9. Right click your plugin with the modified formlists and choose &#34;Add Master...&#34;\r<br />10. Select &#34;mslVampiricThirst.esp&#34; in the window that appears and click &#34;Open&#34;\r<br />\r<br />And now your custom race should be able to turn into a vampire&#33;\r<br />\r<br />[center][color=darkred][b][size=16]~~~~~~~~~~~~~~~~~~~~\r<br />Permissions, contact and support\r<br />~~~~~~~~~~~~~~~~~~~~[/size][/b][/color][/center]\r<br />\r<br />[color=red]This mod is Skyrim Nexus exclusive. If you see it uploaded anywhere else it means I haven&#39;t uploaded it there and for this reason I am not responsible for any issues it may cause, incompatibilities or outdatedness. Also if you see it uploaded on Steam Workshop PLEASE inform me immediately&#33; I do not agree to the terms and conditions of that service and summarily refuse to allow any of my work to be hosted there&#33;[/color]\r<br />\r<br />You have permission to freely use and modify this mod for personal use but I would be grateful if you informed me of any derivative works you&#39;d like to publish based on it. If you receive no answer in a week consider my permission granted just remember to give me credit.\r<br />\r<br />You can contact me on Skyrim Nexus (http://skyrim.nexusmods.com/modules/members/index.php?id=3927495) and that&#39;s also where you will find the newest version of the mod&#33;\r<br />\r<br />[center][color=darkred][b][size=16]~~~~~~~~~~~~~~~~~~~~\r<br />Credits\r<br />~~~~~~~~~~~~~~~~~~~~[/size][/b][/color][/center]\r<br />\r<br />- I&#39;d like to thank Bethesda Softworks for providing Creation Kit and creating my second ^^ favourite series of games&#33;\r<br />- Valstein0 for the original improved ashpile textures that I modified for my sexy new vampire dust\r<br />- Madmole (Unholy Darkness for Oblivion), Qarl (Underworld for Morrowind), Zennorious (Vampiric Hunger for Morrowind) for making vampirism in past Elder Scrolls games a lot more fun to play&#33;\r<br />- Vampire the Masquerade franchise by White Wolf. It was the first thing that made me fall in love with vampires and I still love it&#33;\r<br />- Nexus for the huge and very prolific modding community it has created&#33;\r<br />- All the nice people continuing to report bugs and issues and contributing new ideas&#33;",
  "categoryId": "79",
  "version": "1.61",
  "author": "Miss Leeches",
  "createdUnix": "1336487871",
  "updatedUnix": "1338766237",
  "containsAdultContent": true,
  "uploadedBy": "MsLeeches",
  "primaryFile": null,
  "files": [
    {
      "fileId": "59753",
      "name": "Invisiblity eye fix",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "Invisiblity eye fix-16691-1-0.7z",
      "uploadedUnix": "1336489377",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b2987d066f73f5c5633641bfed65ca6d500cacbfe28922aa52d56f15d43f28a9/analysis/1406877672/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Invisiblity%20eye%20fix-16691-1-0.7z?fid=59753&ttl=1535782069&ri=8192&rs=8192&setec=be5b1b8a5d58fd37b3b02c103bdd6368"
    },
    {
      "fileId": "59780",
      "name": "Vampiric Thirst 1-1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1807",
      "fileName": "Vampiric Thirst 1-1-16691.7z",
      "uploadedUnix": "1336500392",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5a0fdfb7c35bd31b2f32e256a89a72ed811643df057495f7ccd7fd295fad0945/analysis/1406878323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20Thirst%201-1-16691.7z?fid=59780&ttl=1535782070&ri=8192&rs=8192&setec=19d4e5948aad929b82bb18501d028934"
    },
    {
      "fileId": "59815",
      "name": "Vampiric Thirst 1-2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1806",
      "fileName": "Vampiric Thirst 1-2-16691.7z",
      "uploadedUnix": "1336506780",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/b327b32e536b7bdf56e3e20ad7d2c95c1105c6af2d37dbbb3c3a586f18deb5ec/analysis/1406878624/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20Thirst%201-2-16691.7z?fid=59815&ttl=1535782071&ri=8192&rs=8192&setec=68fd3b9d63668fc8a4bbd4b12cc4bbc8"
    },
    {
      "fileId": "59827",
      "name": "Vampirism Updater",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Vampirism Updater-16691.7z",
      "uploadedUnix": "1336509738",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/076655f21eac807e37fffd319889492740d8b6dc774a3081e1c85264a4076bf7/analysis/1406878745/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampirism%20Updater-16691.7z?fid=59827&ttl=1535782071&ri=8192&rs=8192&setec=986a06ea601632b2f185f971121355c3"
    },
    {
      "fileId": "59835",
      "name": "Vampiric Abilities menu hotfix for version 1-2",
      "version": "1.21",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "Vampiric Abilities menu hotfix for version 1-2-16691.7z",
      "uploadedUnix": "1336515138",
      "modVersion": "1.21",
      "virusScanUrl": "https://www.virustotal.com/file/a4c20cabc4c82f1a7f552a45f6afdeb0cbda96612c9413b94cee329322b9851b/analysis/1406878922/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20Abilities%20menu%20hotfix%20for%20version%201-2-16691.7z?fid=59835&ttl=1535782072&ri=8192&rs=8192&setec=b6376cfd8afa1c73a960f57310b8b63f"
    },
    {
      "fileId": "59838",
      "name": "Vampiric Thirst 1-21",
      "version": "1.21",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1808",
      "fileName": "Vampiric Thirst 1-21-16691.7z",
      "uploadedUnix": "1336515890",
      "modVersion": "1.21",
      "virusScanUrl": "https://www.virustotal.com/file/195b122e076974a59cec0793f9f816017744865b10fd03c742939fb4b29f7f8b/analysis/1406878986/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20Thirst%201-21-16691.7z?fid=59838&ttl=1535782072&ri=8192&rs=8192&setec=ac5e48c7d29c19535c34f50d9fa70bb7"
    },
    {
      "fileId": "59932",
      "name": "Vampiric Abilities update for 1-2 and 1-21",
      "version": "1.25",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40",
      "fileName": "Vampiric Abilities update for 1-2 and 1-21-16691.7z",
      "uploadedUnix": "1336547890",
      "modVersion": "1.25",
      "virusScanUrl": "https://www.virustotal.com/file/b4bd8ee9b9e1ef46cb9a865decd61a61d0531eb7317fc96614b6f0c34a6442f5/analysis/1406879823/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20Abilities%20update%20for%201-2%20and%201-21-16691.7z?fid=59932&ttl=1535782072&ri=8192&rs=8192&setec=18b96c9daa7e8ce235aef8c69f4770de"
    },
    {
      "fileId": "59933",
      "name": "Vampiric Thirst 1-25",
      "version": "1.25",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1808",
      "fileName": "Vampiric Thirst 1-25-16691.7z",
      "uploadedUnix": "1336548014",
      "modVersion": "1.25",
      "virusScanUrl": "https://www.virustotal.com/file/e5c6c88cede2cf03d003a7e1795da1cae760c6f47101a1f5af482a48cace9d78/analysis/1406879826/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20Thirst%201-25-16691.7z?fid=59933&ttl=1535782073&ri=8192&rs=8192&setec=70263797fe3ef704461d92dca2d59c00"
    },
    {
      "fileId": "60051",
      "name": "No helmet impendiment",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "0",
      "fileName": "No helmet impendiment-16691.7z",
      "uploadedUnix": "1336592759",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ace51700c3ad5a07119d3d3746c05477786da3d2e33ec4a6fb344013006615e2/analysis/1406880852/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20helmet%20impendiment-16691.7z?fid=60051&ttl=1535782073&ri=8192&rs=8192&setec=15202abead984011921e330e8b200708"
    },
    {
      "fileId": "60247",
      "name": "Vampiric Thirst 1-3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1808",
      "fileName": "Vampiric Thirst 1-3-16691.7z",
      "uploadedUnix": "1336665051",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/8dfb64567f5cf0c310560678363551bc184c68a9d25b3ee978140d192c318d2a/analysis/1406882588/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20Thirst%201-3-16691.7z?fid=60247&ttl=1535782074&ri=8192&rs=8192&setec=9d1d12acac3057789ae6375fab1135b7"
    },
    {
      "fileId": "60263",
      "name": "Vampiric Thirst 1-31",
      "version": "1.31",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1808",
      "fileName": "Vampiric Thirst 1-31-16691.7z",
      "uploadedUnix": "1336670988",
      "modVersion": "1.31",
      "virusScanUrl": "https://www.virustotal.com/file/328393c3af4c44991fe34adeb9ee4b9a4ba36d352505b6ac7f8a5dbbae5ccb42/analysis/1406882841/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20Thirst%201-31-16691.7z?fid=60263&ttl=1535782074&ri=8192&rs=8192&setec=fabc5fb0b0db03a9e3f6fddf77dc6c35"
    },
    {
      "fileId": "60432",
      "name": "Vampiric Thirst 1-35",
      "version": "1.35",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1808",
      "fileName": "Vampiric Thirst 1-35-16691.7z",
      "uploadedUnix": "1336728183",
      "modVersion": "1.35",
      "virusScanUrl": "https://www.virustotal.com/file/676604f4160b877ca61bc92e4a99956d3e947f341b837d39d6f3763ff4acc109/analysis/1406884451/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20Thirst%201-35-16691.7z?fid=60432&ttl=1535782075&ri=8192&rs=8192&setec=9ab0cd984f46a088b4f5d71ebe3b3069"
    },
    {
      "fileId": "60504",
      "name": "Vampiric Thirst 1-36",
      "version": "1.36",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1807",
      "fileName": "Vampiric Thirst 1-36-16691.7z",
      "uploadedUnix": "1336751434",
      "modVersion": "1.36",
      "virusScanUrl": "https://www.virustotal.com/file/fcf831d30801365b3340bf84651090ebee326ffe4cdd755f7249930dd598fac7/analysis/1406885226/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20Thirst%201-36-16691.7z?fid=60504&ttl=1535782075&ri=8192&rs=8192&setec=78ca5c1a027cd6f92ffa1347b07649c4"
    },
    {
      "fileId": "60995",
      "name": "Vampiric Thirst 1-37",
      "version": "1.37",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1808",
      "fileName": "Vampiric Thirst 1-37-16691.7z",
      "uploadedUnix": "1336911505",
      "modVersion": "1.37",
      "virusScanUrl": "https://www.virustotal.com/file/381134227f10ed3fb73244fb4fd577358d0cce0b152fbd5e541415f512b6a1e6/analysis/1406889485/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20Thirst%201-37-16691.7z?fid=60995&ttl=1535782076&ri=8192&rs=8192&setec=1babd0de26d8dc8ccb5c3c5819df8221"
    },
    {
      "fileId": "64636",
      "name": "Vampiric Thirst 1-5",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1808",
      "fileName": "Vampiric Thirst 1-5-16691.7z",
      "uploadedUnix": "1338405458",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/5405b9a12028c4fba985a9f9c3c9f003a31b3b0d29745d57916b3ca2bae16181/analysis/1406926034/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20Thirst%201-5-16691.7z?fid=64636&ttl=1535782077&ri=8192&rs=8192&setec=c09d2e1c7fb26536f8013a5cb40ec973"
    },
    {
      "fileId": "64826",
      "name": "Vampiric Thirst 1-52",
      "version": "1.52",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1808",
      "fileName": "Vampiric Thirst 1-52-16691.7z",
      "uploadedUnix": "1338480522",
      "modVersion": "1.52",
      "virusScanUrl": "https://www.virustotal.com/file/570e1853ff346b12e6ef8b1189cc5479c0cad7a1513bb002a77d4eee2e7a12e1/analysis/1406927946/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20Thirst%201-52-16691.7z?fid=64826&ttl=1535782078&ri=8192&rs=8192&setec=b8865d3e0f262257de941b4ed1538e02"
    },
    {
      "fileId": "65608",
      "name": "Vampiric Thirst 1-6",
      "version": "1.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1810",
      "fileName": "Vampiric Thirst 1-6-16691.7z",
      "uploadedUnix": "1338717718",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/17605585ba74359f599147b3b330292ed5230106ba711a0dca02eb4239c710c5/analysis/1406934786/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20Thirst%201-6-16691.7z?fid=65608&ttl=1535782079&ri=8192&rs=8192&setec=1ce4c2b18cde0e60d0e99242daf6bbe4"
    },
    {
      "fileId": "65773",
      "name": "Vampiric Thirst 1-61 - current version-",
      "version": "1.61",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1811",
      "fileName": "Vampiric Thirst 1-61 - current version--16691-1-61.7z",
      "uploadedUnix": "1338766237",
      "modVersion": "1.61",
      "virusScanUrl": "https://www.virustotal.com/file/6931039dfde3104f9f6730049895e51f3965ff18f13886e9eb10339f1fb4e813/analysis/1406936344/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20Thirst%201-61%20-%20current%20version--16691-1-61.7z?fid=65773&ttl=1535782080&ri=8192&rs=8192&setec=5608a6bcc9cf5d9a5566f925b1b9f898"
    }
  ]
}