{
  "modId": 16705.0,
  "modName": "Categorized Favorites Menu - Apocalypse Spell Pack",
  "summary": "A CFM setting which is made to support the Apocalypse Spell Package Mod, made by EnaiSiaion",
  "descriptionHtml": "First of, to use this mod you need to download the Categorized Favorites Mod, made by favmenumodder. When you are done with that and you use any mod which adds new items or spells you notice that they wont show up in the favoritesmenu.\r\n\r\nWith this file, which is completly based on whickus\\' Categorized Favorites Menu - Extreme Compatibility Config, all those new weapons, spells, armors or powers are shown in the right section.\r\n\r\nAs whickus is currently working on an update for his Config, in which he will include support for the Apocalypse Spell Package, this config differs from his, as I added a few new sections in the Abilities and the Magic. Those changes are made to increase the userfriendliness of the navigation through this menu for all the Apocalypse users.\r\n\r\nChanges from whickus\\' config:\r\n\r\n-I added the \\\"Epic Spell\\\" section to the \\\"Abilities\\\" category which includes all those spells which can only be used once a day like Archon, Dreadking and such.\r\n-I added a extra list to all the Schools of Magic: the Toggle section which will include all Toggle based spells which come with Apocalypse.\r\n\r\nLeave a comment if I misplaced something or if you are having any problems.\r\n\r\nLinks:\r\n\r\nCategorized Favorites Menu: \r\n\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4862\r\n\r\nCategorized Favorites Menu - Extreme Compatibility Config: http://skyrim.nexusmods.com/downloads/file.php?id=15797\r\n\r\nApocalypse Spell Package:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=16225",
  "categoryId": "42",
  "version": "1.0",
  "author": "xXRegnierXx",
  "createdUnix": "1336505892",
  "updatedUnix": "1336506213",
  "containsAdultContent": false,
  "uploadedBy": "xXRegnierXx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "59807",
      "name": "Categorized Favorites Menu - Extreme Compatibility Config - Apocalypse Spell Package",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Categorized Favorites Menu - Extreme Compatibility Config - Apocalypse Spell Package-16705.rar",
      "uploadedUnix": "1336506213",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a84d5fb165aa7c3960ddf3a0e87bcc6a9a74fce95b845eaf76ef34dbdffff9d0/analysis/1406878622/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Categorized%20Favorites%20Menu%20-%20Extreme%20Compatibility%20Config%20-%20Apocalypse%20Spell%20Package-16705.rar?fid=59807&ttl=1535782101&ri=8192&rs=8192&setec=646ef3c412f39e6ce536b164617b92ca"
    }
  ]
}