{
  "modId": 16703.0,
  "modName": "Lakeside Hideaway",
  "summary": "A medium sized player home on the shores of Lake Ilinalta. Inside holds many unique features and storage, as well as everything you need for crafting.",
  "descriptionHtml": "[center][size=18][color=#7FFFD4][b]This mod will be taking a hiatus for quite I while, I may come back to it I may not. I will be having a child soon and do not know if I will have to time to work on this mod anymore. I am sorry to those of you have been following me from the start.[/b][/color][/size][/center]\r\n\r\n[center][color=#7FFFD4][b]IF YOU ARE UPGRADING FROM ANY VERSION BEFORE 1.6 - You need to take everything out of the house, save while outside the house, delete the old .esp file, start the game up and save again without the hideaway on, then apply the update. Doing it this way deletes all traces of the old file and gives you a fresh clean update. If you don\\'t take everything out first you will lose all of your stuff.[/b][/color][/center]\r\n\r\n[center][color=#7FFFD4][b] SPECIAL THANKS GOES TO [url=http://skyrim.nexusmods.com/modules/members/index.php?id=1177069]RAYEK[/url] FOR ALL OF HIS HELP IN FIXING THE NAVMESHES AND MANNEQUINS![/b][/color][/center]\r\n\r\n[center][color=#7FFFD4][b][url=http://skyrim.nexusmods.com/downloads/file.php?id=17790]\\\"Pro ceske hrace - Stahnete si tento soubor od Azariana, ktery byl tak hodny a udelal preklad meho modu.[/url][/b][/color][/center]\r\n\r\n\r\n[center][size=18][color=#7FFFD4][b]------{ VIDEOS }------[/b][/color][/size][/center]\r\n\r\n[center][color=#7FFFD4] Skyrim Mods : Week #24 by MxR [/color][/center]\r\n[center][youtube]Lpm3wzVCVxc[/youtube][/center]\r\n[center]~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*[/center]\r\n\r\n\r\n[center][color=#7FFFD4] Skyrim Mods Weekly: Bits \\'n\\' Bobs - Week #8 by Brodual [/color][/center]\r\n[center][youtube]Hbqve-c98H4[/youtube][/center]\r\n[center]~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*[/center]\r\n\r\n\r\n[center][color=#7FFFD4] Skyrim Real Estate: # 1 by insane0hflex [/color][/center]\r\n[center][youtube]oA2t7dePu-U[/youtube][/center]\r\n[center]~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*[/center]\r\n\r\n\r\n[center][color=#7FFFD4] Semanal de Mods #5 by johnnySQS [/color][/center]\r\n[center][youtube]OJ4owsT-DTU[/youtube][/center]\r\n[center]~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*[/center]\r\n\r\n\r\n[center][color=#7FFFD4][b]#################################################################################[/b][/color][/center]\r\n\r\n\r\n[center][size=18][color=#7FFFD4][b]------{ EXTERIOR }------[/b][/color][/size][/center]\r\n\r\nFrom the road you will see the shoreline as well as the docks to your private jetty, located on your right are the stables nestled in a small alcove against the cliff face, cozy but with enough room for your steed and tack. On the dock is a nice fishing spot with some ranged targets on the small islands. from the docks up to the main entry way you will come upon Stran your loyal guard dog, he will keep out any unwanted guests to your new home or will faithfully follow you wherever you lead. The foliage of the surrounding trees and shrubs help conceal the hideaway from any prying eyes that may go by on the road.\r\n\r\n\r\n[center][size=18][color=#7FFFD4][b]------{ ENTRYWAY }------[/b][/color][/size][/center]\r\n\r\nUpon entering the hideaway you descend down a short passageway to the main cavern, along the back wall a grand entryway is carved into the stone, in the grand foyer you will find an elaborate display area for your masks and dragon claws, throughtout the hideaway manniquins are set into their pwn private alcoves. A special feature is the twin pillars of light that stand tall on the back wall the foyer, more than just a focal point they are a special constant enchantment that keeps the water from the nearby lake out so the hideaway remains dry at all times.\r\n\r\n\r\n[center][size=18][color=#7FFFD4][b]------{ ATRIUM }------[/b][/color][/size][/center]\r\n\r\nAs you proceed into the main atrium, you are spoiled with a grand view of the gardens reflected in marble pools of water on the floor, each corner holds its own array of blooms as well as a small cascade of water to keep them growing strong. To your left is the kitchen, the right is the smith and straight ahead leads to the main living areas.\r\n\r\n\r\n\r\n[center][size=18][color=#7FFFD4][b]------{ KITCHEN & MORE }------[/b][/color][/size][/center]\r\n\r\nTo your left is the kitchen space, a warm fire in the hearth keeps a stew bubbling hot while the evening meal is laid out along the counter tops ready for serving. Lots of storage can be found in the shelves of the counter, supplies from the local town scattered along the counters and walls. on the back wall in a small alcove is the sink, dishes from last nights meal still waiting to be washed. \r\n\r\nOn the right is the Alchemy/Enchanting Labs, in a large pot grows all the needed soul gems for your enchanting work as well as notes and books scattered along the bench. On the back wall rests two casks, each containing a special starting agent to enhance any magickal work. along the counter in the middle are some baskets and crates containing recently gathered ingredients ready of potion making, tools for potions are laid out and ready to be used, the many books and notes needed are gathered around the table. In the alcove nearby holds a shelf full of sorted potions that have been completed.\r\n\r\nIn the center of the room the evening meal has been served up and is still piping hot as it sits on the table waiting to be eaten.\r\n\r\n\r\n[center][size=18][color=#7FFFD4][b]------{ SMITHY }------[/b][/color][/size][/center]\r\n\r\nOn your left as your enter the smithy you see the grand forge, impressive and taking up most of the back of the room it burns brightly, the coals red hot and ready for use, a tanning rack sits near the door and a grindstone rests next to the rinse basin. on the back wall in the center of the room is the smithing bench. here notes, supplies and references can be found as well as lots of storage for your ingots, pelts, ore, gems, hides and any other materials you may need. Continuing along the wall you see the smelter and work bench, completing your arsenal of everything you need to create some of the best weapons possible.\r\n\r\n\r\n[center][size=18][color=#7FFFD4][b]------{ LIVING QUARTERS }------[/b][/color][/size][/center]\r\n\r\nLocated at the very back of the hideaway are the living quarters. The path splits as you past the atrium with the library to your left and your companions bedroom to your right, your warm bed awaits you just past to doors in the center.\r\n\r\n[center][size=18][color=#7FFFD4][b]------{ MASTER SUITE }------[/b][/color][/size][/center]\r\n\r\nThe master bedroom is warmed by twin fireplaces in the corners as you enter the room. on the right in a private alcove the master bed is built directly into the wall in order to retain heat through the night, on the left is the doorway into the sauna as well as a ladder leading up to a private armory. plenty of storage and chests can be found in this room to contain any horde. on the back wall is a doorway leading to a small cavern patio surrounded by rushing water.\r\n\r\n[center][size=18][color=#7FFFD4][b]------{ BATH & SAUNA }------[/b][/color][/size][/center]\r\n\r\nThe double doors on the left of the master suite holds the grand spa, a large steaming pool of natural water holds prominence on the back wall. In the corner near the entrance sits a small changing area and privy. On either side of the center of the room are two cascading showers to rinse off before settling in for a long soak. The very center of the room holds a large sauna to rest and enjoy the soothing heat. With enough room for you and your guests the spa is so much more than just a place to wash up.\r\n\r\n[center][size=18][color=#7FFFD4][b]------{ LIBRARY }------[/b][/color][/size][/center]\r\n\r\nThe library is a cozy room lined with shelves ready to hold your vast colection of books, a fireplace on the center wall warms the room and provides ample light to curl up and read in one of two armchairs in the center of the room. On the back wall a large desk contains many needed writing supplies as well as storage for any parchement or keys you come across.\r\n\r\n\r\n[center][size=18][color=#7FFFD4][b]------{ COMPANION SUITE }------[/b][/color][/size][/center]\r\n\r\nTo the right in the hall is the companions suite, a small table with drinks sits on the wall near the door, two warm beds rest close to the fire and in the corner a rug has been rolled out for your four legged guests (Stran maybe?) quiet and mostly unadorned it provides a calm place to settle in and recover from travel.\r\n\r\n\r\n\r\n[center][color=#7FFFD4][b]#################################################################################[/b][/color][/center]\r\n\r\n\r\n[center][color=#7FFFD4] =================================={ SPECIAL THANKS TO }================================== [/color][/center]\r\n\r\n[center] Blary - [url=http://skyrim.nexusmods.com/downloads/file.php?id=14134]Openbooks[/url] - [url=http://skyrim.nexusmods.com/downloads/file.php?id=14135]Booksets[/url] - [url=http://skyrim.nexusmods.com/downloads/file.php?id=14133]Food containers[/url] - [url=http://skyrim.nexusmods.com/downloads/file.php?id=14136]Potion Shelf[/url][/center]\r\n[center] Darkrider - [url=http://skyrim.nexusmods.com/downloads/file.php?id=12394]Celtic Decor 1[/url][/center]\r\n[center] Oaristys - [url=http://skyrim.nexusmods.com/downloads/file.php?id=16525]Modders Resource Pack[/url][/center]\r\n[center] Volek - [url=http://skyrim.nexusmods.com/mods/6683]Oriental Rugs[/url][/center]\r\n[center] Tamira - [url=http://skyrim.nexusmods.com/mods/22018]New Plants[/url][/center]\r\n[center] Fox - [url=http://skyrim.nexusmods.com/mods/21370]FOX Furniture[/url][/center]\r\n[center] Runspect - [url=http://skyrim.nexusmods.com/mods/26132]Modders resource[/url][/center]\r\n[center] Sjogga on the forums for his tutorials, they are what helped me set up the claw holders and invisible chairs[/center]\r\n\r\n\r\n[center][color=#7FFFD4] ================================================================================ [/color][/center]",
  "categoryId": "67",
  "version": "v2.0",
  "author": "Sulya Tamagen",
  "createdUnix": "1336503027",
  "updatedUnix": "1374765185",
  "containsAdultContent": false,
  "uploadedBy": "ArtsyCat",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013980",
      "name": "Lakeside Hideaway V1-8",
      "version": "V1.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "143816",
      "fileName": "Lakeside Hideaway V1-8-16703-V1-8.zip",
      "uploadedUnix": "1362085367",
      "modVersion": "V1.8",
      "virusScanUrl": "https://www.virustotal.com/file/dc4afe15b20bd6ab368482ba280782be3284f2cb485eb1fd27f52ce61c0657b7/analysis/1407444556/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeside%20Hideaway%20V1-8-16703-V1-8.zip?fid=1000013980&ttl=1535782098&ri=8192&rs=8192&setec=374cec524d64d8f27312dad64483d185"
    },
    {
      "fileId": "1000040691",
      "name": "Lakeside Hideaway V2-0",
      "version": "v2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "344841",
      "fileName": "Lakeside Hideaway V2-0-16703-v2-0.rar",
      "uploadedUnix": "1374765185",
      "modVersion": "v2.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeside%20Hideaway%20V2-0-16703-v2-0.rar?fid=1000040691&ttl=1535782098&ri=8192&rs=8192&setec=01f6c23a2129a78e6e2767eb982771bc"
    }
  ]
}