{
  "modId": 16710.0,
  "modName": "Mage Guild Bosses Revamp - Part I-Beta",
  "summary": "A difficulty increase of the Mage Guild\\'s various bosses throughout the questline.",
  "descriptionHtml": "--------------------------------------------NOTICE--------------------------------------------\r\nWhen my next mod is released, this file won\\'t be compatible with it.  If you download my next release, you\\'ll have to deactivate this mod!\r\n-Avenger 404\r\n-------------------------------------------------------------------------------------------------\r\n\r\nHello and welcome to my 2nd instalment of \\\"Boss additions\\\" to the main quests of Skyrim!  Today, we revisit the Mage\\'s Guild questline, and make almost all the bosses in the story leading up to the infamous Ancano a bit more challenging - giving all the bosses new abilities, spells, and perks to keep your up-and-coming Archmage on his/her toes!\r\n\r\nBut you may be wondering to yourself - why is there a Part 1?  Well allow me to explain.  I didn\\'t feel Ancano was climactic enough as a \\\"final boss\\\" of the questline, and served all right as a \\\"rite of passage\\\" for you as the Archmage, but I\\'m sure some of you feel as I do, an Archmage needs a bit more than one pesky Thalmor mage to beat down to prove their worth...  So I will be adding in another part to the questline, which takes place right after the events of the Vanilla quest.  But be forewarned, when released, this next quest will show NO mercy!\r\n\r\nSome of the more keen of you adventurers may find a dungeon (near Winterhold, it is currently unmarked) and can begin pre-emptively exploring it, but please do have a backup save ready for when the quest is active, as then the dungeon will make sense! :p\r\n\r\nI decided to release part 1 first, instead of a massive plethora of content all at once to make sure everything works, and then I can make small fixes while I work on my version of the final quest, which will be released in the same file!\r\n\r\nA few things to note about the new dungeon, the NavMesh bug is currently active, and there is nothing I can do about that.  Followers won\\'t follow you into some parts of the dungeon, so you will be on your own for now.  And the enemies are very, very tough!  I expect that these monsters will be nothing compared to the final bossfight I\\'m still working on.  Over-all I want people to test the playability of the dungeon with a fresh perspective, please tell me if there\\'s anything you notice that \\\"isn\\'t right\\\"  there are quite a few loose ends I\\'m still working on, but this dungeon is totally optional, and is up to you to find...\r\n\r\nAs for the rest of the mod, please tell me how the bosses perform, as I would like feedback on: overall performance, issues (if any), appropriate difficulty scaling, and anything else you can think of!  This is Beta, so be forewarned, and make a clean save for this mod!\r\n\r\nEnjoy!\r\n-Avenger404-\r\n\r\n---------------------------------------Required Mods---------------------------------------------\r\nNone!\r\n----------------------------------Incompatible Mods---------------------------------------------\r\nMods affecting any of the bosses in the college questline (including Morokei) may be a problem\r\n-------------------------------------Extra Details--------------------------------------------------\r\nBosses changed:\r\nThe Caller\r\nMorokei\r\nEstormo\r\nAncano\r\n-----------------------------------Recommended Mods-------------------------------------------\r\nInfinite Enchantments\r\n------------------------------------Other Mods By Me---------------------------------------------\r\nSkyrim Main Storyline New Bosses\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=13238\r\nHall of the Warlords\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=14045\r\n----------------------------------------Credits------------------------------------------------------\r\nBethesda for Skyrim and the Creation Kit\r\nA BIG thanks to fg109 for all your help on the forums!  Would not be this far without your help!",
  "categoryId": "35",
  "version": "1",
  "author": "avenger404",
  "createdUnix": "1336509649",
  "updatedUnix": "1336509866",
  "containsAdultContent": false,
  "uploadedBy": "avenger404",
  "primaryFile": null,
  "files": [
    {
      "fileId": "59828",
      "name": "College Questline Revamp Part I",
      "version": "1Beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "99",
      "fileName": "College Questline Revamp Part I-16710-1Beta.rar",
      "uploadedUnix": "1336509866",
      "modVersion": "1Beta",
      "virusScanUrl": "https://www.virustotal.com/file/bdcbb5eb54afc01118ca1e9880adabb17cf39d473c6e6a7f0b467e6bb2ba4e4b/analysis/1406878803/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/College%20Questline%20Revamp%20Part%20I-16710-1Beta.rar?fid=59828&ttl=1535782110&ri=8192&rs=8192&setec=8e07cbc041c005026d5cd8f787b753ee"
    }
  ]
}