{
  "modId": 16721.0,
  "modName": "Demonics ENB Adjustments",
  "summary": "ENB settings that I have been using for awhile.  A mix and mash of various ENB files with tweaks here and there.  I deserve perhaps a small percent of the credit.  A lot of the settings were taken from others.  Regardless,  I hope they prove useful to some of you looking for an amazing graphical experience.  ",
  "descriptionHtml": "PLEASE NOTE:\r\n-This is not my mod!I have simply edited the files to obtain the look that I wanted. ALL CREDITS go to Boris Vorontsov for the ENB Series Graphic Enhancement. \r\n\r\n-I am not permitted to include the d3d9.dll file. If you do not have it, please download it from the ENB website: http://enbdev.com/download_en.htm\r\n\r\n-SharpShooter\\'s DOF adjustments have been used here (with various tweaks).\r\n\r\n-There are a few mods used in the pictures with the inclusion of this mod. Anything different you see, such as the clouds, the trees, the textures, etc, are from various mods found around the site and in no way belong to or were created by me.\r\n\r\n-I have taken reference from various other ENB files to achieve an exact look, such as Matso, Sharpshooter, and HD6\\'s adjustments.  Most of the files were used as bases, mixed together and mashed with tweaks here and there.  \r\n\r\n-If this absolutely murders your FPS, please tell me in the comments and I will post a less demanding version.\r\n\r\nHere are the ENB settings I have been using for a long time.  I\\'ve decided to release them to the public.  I hope you enjoy them just as much as me.  \r\n\r\nINSTALLATION:\r\n1. Download the file\r\n2. Open the .RAR\r\n3. Extract all files into your main Skyrim directory\r\n(program files>steam>steamapps>common>Skyrim)\r\n4. Enjoy  \r\n  ",
  "categoryId": "62",
  "version": "1.0",
  "author": "Boris Vorontsov SharpShooter Matso HD6 ",
  "createdUnix": "1336538907",
  "updatedUnix": "1336539642",
  "containsAdultContent": false,
  "uploadedBy": "demonic790",
  "primaryFile": null,
  "files": [
    {
      "fileId": "59906",
      "name": "Demonic ENB",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "51",
      "fileName": "Demonic ENB-16721-1-0.rar",
      "uploadedUnix": "1336539642",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e0f1f7d0304d51d0863712447904e9bfbc6ccf35f394315cc6c1ce0e90fec620/analysis/1406879522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Demonic%20ENB-16721-1-0.rar?fid=59906&ttl=1535782275&ri=8192&rs=8192&setec=227592624b0087a286ec93001fdc4621"
    }
  ]
}