{
  "modId": 16782.0,
  "modName": "Work a Steady Job as a Blacksmith",
  "summary": "This mod lets you roleplay as a blacksmith with unlimited randomly generated crafting tasks you can do for profit.",
  "descriptionHtml": "Mod:  Readme - Work a Steady Job as a Blacksmith 0_5 Alpha WIP\r\nGame:  TES V: Skyrim\r\nAuthor:  Blacksmith Job Project Team                                     \r\nDate:  5/9/12                   \r\n************************************************************************\r\nCONTENTS                          \r\n************************************************************************\r\n1. Information on the Mod\r\n2. Installation\r\n3. Version History\r\n4. Conflicts, Known Issues, and Troubleshooting\r\n5. Copy Status and Credits\r\n************************************************************************\r\n1. INFORMATION ON THE MOD           \r\n************************************************************************\r\n\t   This mod lets you roleplay as a blacksmith with unlimited randomly generated crafting \r\ntasks you can do for profit.\r\n\r\n\t   In vanilla Skyrim, you can\\'t really roleplay as a blacksmith because the activity\r\ncosts money rather than yielding a profit.  The cost of materials is so high, and the values that\r\nvendors will pay you for finished items is so low, that you may lose money every time you craft\r\nan item.  This is enough to make you give up on being a peaceable and honest tradesman and go be \r\nan adventurer.  (A bandit of sorts.)\r\n\r\n\t   With this mod, an Orc smith named Gorgob, who works for Warmaiden\\'s in Whiterun, will \r\nassign you tasks for what you need to craft in order to fill orders from customers.  Most of the\r\ntasks will involve having you craft items made from iron, steel, hide, or leather. \r\n\r\n\t   The orders that you fill by crafting these weapons or pieces of armor will pay you 10% \r\nmore gold than the material costs of producing the weapons or armor, assuming that you bought the\r\ncheapest materials and processed them to make the items.  If you buy iron ingots instead of iron \r\nore, your profits will be decreased.  Corundum ore is so expensive that it is cheaper to buy steel \r\ningots than to smelt your own.  If you go mining for ore and hunting for hides, your profits will \r\nbe increased.  If you go adventuring a lot, you could collect so many wolf hides that you would not\r\nneed to buy leather or leather strips.  \r\n\r\n\t   You will sell the items to Gorgob through dialog rather than selling them through the \r\nmerchant minigame to a vendor.  This way you will get the higher price with the 10% profit that \r\nthis mod uses rather than the loss you can expect in the original game.  This will also complete\r\nthe task so you can ask for a new one.\r\n\r\n\t   In order to sharpen or temper the weapons you are assigned to make, you will need to\r\nuse the new grindstone over by the city wall.  The original grindstone near the blacksmith shop\r\nwill not perform this task.\r\n\r\n\t   This mod uses voiced dialog.\r\n\r\n\t   Gorgob will only conduct business while he is at the blacksmith shop during business \r\nhours.  At other times he likes to go to the tavern or elsewhere and does not want to be bothered.\r\n\r\n\t   While using this mod, if you use really cheap weapons and armor, you might accidentally\r\nsell them to Gorgob if you are not careful.  You can avoid this problem by tempering or enchanting\r\nthe items or by buying some decent gear.\r\n\r\n\t   This mod could be well suited to a player who wants to play as a more peaceful \r\ncharacter who is not necessarily all that good in combat.  But it could also be used by an \r\nadventurer character who wants a vacation from questing and dungeon crawling or by an adventurer\r\nwho does smithing as a sideline and wants that activity to pay rather than cost.  You could use\r\nthis mod to roleplay as a townsperson who rarely ventures outside the city walls into the \r\nfrightening world, or at the other end of the spectrum, you could roleplay as a miner and hunter\r\nwho ventures far and wide seeking ore and animal hides to take back to the shop to make into items. \r\n************************************************************************\r\n2. Installation                           \r\n************************************************************************\r\n           Extract (decompress) the .esp and the .bsa to your Skyrim directory.  \r\n(It will be something like *Installation directory*\\\\Skyrim\\\\SteamApps\\\\common\\\\Skyrim\\\\Data)\r\nMark the box next to \\\"Work a Steady Job as a Blacksmith.esp\\\" in your mod manager.\r\n \r\n           Alternately, extract files someplace else.  Then move the .esp and .bsa \r\nto Skyrim\\\\Data.  Mark the box next to the plugin in your mod manager.\r\n************************************************************************\r\n3. Version History    \r\n************************************************************************\r\nV 0.5    5/9/12   Public Alpha WIP.   \r\n************************************************************************\r\n4. Conflicts, Known Issues, and Troubleshooting\r\n************************************************************************\r\n\t   The mod is only partway built, but team members are busy with their jobs and will have\r\nless time to devote to the mod for awhile.  So it was decided to upload the portion that was \r\nfinished.  Right now, the mod mainly just has tasks related to making iron and steel weapons.  \r\nThe ordinary armor tasks have not all been set up added yet.  No tempered armor tasks have been \r\nset up yet.  Enchanted weapon tasks are still on the drawing board and would add one more layer\r\nof enjoyable complexity to the crafting process.\r\n\r\n\t   The portion of the mod which is accessible to the gamer has been play-tested and is \r\npresumed to be free of bugs, stable, and free of loose ends.  But the random nature of this mod \r\nmakes it hard to test everything.  The part of the mod which is under construction is blocked off\r\nand not reachable by players.\r\n\r\n\t   This mod should be compatible with most of the various smithing overhauls that are \r\navailable, although some of them could throw off the balance of this mod and make it too easy or \r\ntoo hard.\r\n\r\n\t   The Skyrim game engine does not readily support what we are trying to do here.  The\r\ngame cannot readily sense, for purposes of questcoding, whether a weapon is tempered or not.  So\r\nthis is why there is a special grindstone which you have to use to make sharpened and tempered \r\nweapons.  When you have the proper materials, it does it automatically without using the minigame.\r\n\r\n\t   This mod probably needs more play-testing.\r\n\r\n\t   If you locate a bug in this mod, contact David Brasher of the Blacksmith Job Project\r\nteam on TES Nexus so that the issue can be examined and hopefully fixed.\t   \r\n************************************************************************\r\n5. Copy Status and Credits           \r\n************************************************************************\r\nCredits:  \r\n\tthe Blacksmith Job Project Team:\r\n\t   Freddy the Noob - Team Lead, Voice Actor\r\n\t   David Brasher - Questcoder/Scripter, Uploader/Caretaker\r\n\t   Clueless Punk - Playtester\r\n\t   Sloth Girl - Playtester\r\n\r\n\tBethesda for making Skyrim in an open format anyone can mod.\r\n\t\t\r\nCopy Status:  Public domain with proper attribution and courtesy notification.  You may distribute\r\n\tthis mod or mods you made using things from this mod as long as you give credit to the authors \r\n\tand send notification to David Brasher on Skyrim Nexus stating that you have done this.      \r\n************************************************************************\r\n************************************************************************\r\n************************************************************************\r\n************************************************************************",
  "categoryId": "25",
  "version": "0.5",
  "author": "Blacksmith Job Project Team",
  "createdUnix": "1336629267",
  "updatedUnix": "1336630148",
  "containsAdultContent": false,
  "uploadedBy": "David Brasher",
  "primaryFile": null,
  "files": [
    {
      "fileId": "60170",
      "name": "Work a Steady Job as a Blacksmith 0_5",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4552",
      "fileName": "Work a Steady Job as a Blacksmith 0_5-16782-0-5.7z",
      "uploadedUnix": "1336630148",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/6a71d351c413eaaa73f93e968f72622f4a89dbc36349ad5015d6c7368a96d130/analysis/1406881992/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Work%20a%20Steady%20Job%20as%20a%20Blacksmith%200_5-16782-0-5.7z?fid=60170&ttl=1535782387&ri=8192&rs=8192&setec=438897e22b269d2e59791f8dafa81f6b"
    }
  ]
}