{
  "modId": 16825.0,
  "modName": "Dovaheim The Prologue",
  "summary": "This is the teaser for my new mod, Dovaheim which will be out tomorrow.\r\nCONTAINS SPOILER",
  "descriptionHtml": "\r\n[size=18]Dovaheim The Dungeons is out[/size]\r\n\r\n\r\n\r\n\r\nCONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS--CONTAINS MAIN QUEST SPOILERS\r\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\nI present you the teaser of my new mod, Dovaheim, It\\'s intended to be a new dungeon for high level players who have completed the main quest (lvl 50-70), I tried to made the mod as much lore friendly as I could so here you are the mod\\'s history.\r\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nDovaheim, by Esbern, Grandmaster of the Blades\r\n\r\nProbably you don\\'t know anything about Dovaheim, but I will tell you its history.\r\n\r\nWhen you used the Elder Scroll in the time wound of the Throat of the World you change the history forever, you created another time world with a new Dovahkiin. This Dovahkiin acomplised his prophecy, but he didn\\'t kill Paarthurnax. After killing Alduin and returning from Sovengarde, both of them made an strong alliance and became ready to start a war between friendly and opposing dragons. While, in Skyrim, the war was raging, Ulfric asked for help to Dovahkiin, and thanks to the dragons help the civil war was fastly concluded, and a fragile peace between the Empire and Skyrim was accorded. Ulfric was crowned the new Skyrim king and Dovahkiin and Paathurnax continued killing and recruiting new dragons to their army. This army becames popular also between mortals, Dovahkiin supporters as the Companions, the Dark Brotherhood and the Greybeards founded the Dovahkiin Order.\r\n\r\nThis events weren\\'t ignored to the rest of the world. The civil war wasn\\'t a disaster for the Imperium, because they surrender when they saw the dragons against them, Tulius was ejecuted as symbol of a new peace, and Tito Mede II died in strange circumstances, because of that, the major part of the Imperium soldiers went home to prevent a war with the Thalmor. This last ones were angry about the war fate and they saw Skyrim as the perfect objective for their conquest. So here started the Skyrim Great War. At the begining, a huge army of Thalmor wiped out several Skyrim\\'s important cities, as Ulfric wasn\\'t able to defend them properly. The Dovahkiin Order, now named the Dovah Order (as dragons are now an important part) took a vital place in the war: A lot of soldiers joined it, and the order became the most powerful army in Skyrim. \r\nDovahkiin asked all the Skyrim orders and factions to become unite and defeat the invaders, as a result, two years later, the war was concluded, the Thalmors were annihilated, the High Elven royalty was killed in mysterious circumstances and Dovahkiin became the most important person in Skyrim. \r\nBut still he didn\\'t have the King title so, he duels Ulfric, killing him with his Thu\\'um as Ulfric did with Torygg in the past. Dovahkiin himself built Ulfric\\'s tomb as a prize for his honor.\r\n\r\nTo magnify his power, Dovahkiin ordered to build the biggest castle ever in Skyrim, that\\'s why five years later, Dovaheim was refered as Dovahkiin\\'s heart.\r\n\r\nDuring those years he obtained the Magnus Eye from the Winterhold College, now destroyed by Dessan\\'s (Dovahkiin\\'s warlock) power. Paarthurnax, Dessan, Angeir and Dovahkiin were able to convert the Magnus Eye in the Dovah Orb, an artifact that could control the will of all dragons, due to this, all the remaining dragons joined Paathurnax and Dovahkiin.\r\n\r\nDue to the Aldmer\\'s defeat, the Imperium started a war with them, beating them and claiming again their power as the major faction in Tamriel. But the war cost the life of Tito Mede II \\'s succesor. An Imperium without Emperor, the deadliest weapon to be used by a person. Dovahkiin claimed the Emperor title with the support of the most Tamriel regions, but the Elder Council from the Imperium and the Blades didn\\'t agree and started a cruel war against them. The Dovah Order couldn\\'t stand the whole Imperium army and was reducted to Dovaheim, but this fortress contained more power than the Imperium thought and in the Riften battle, the Imperium lost a half of their army due to the Dovah Orb. After a few months, Dovaheim was sourrounded, but that was another trap, Dessan closed a magic wall around it and Dovahkiin and Paarthurnax started to charge the Orb for a warp through time, thanks to the Elder Scroll that Dovahkiin had. \r\n\r\nIf they conclude their action, a vast remain of the Dovah Order, now reinforced with Draugs, will apear in this time, in the middle of a dying Imperium and a fragile country, you are the only who could prevent this.\r\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n--Mod features--\r\nThis prologue just take part in actual Skyrim, but some parts of the future have now warped by Time Wounds, as the Ulfric\\'s Tomb, where this mod starts\r\n\r\nTomorrow, Dovaheim will be unlocked with more than 2 hours of challeging gameplay, including new enemies, new companions, difficult decisions and a differen\\'t kind of bosses.\r\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n--Important Info--\r\nThe mod starts in Ulfric\\'s tomb (you can fast travel there, its located in the North of Windhelm), by reading the book and the note which are in the chest.\r\n\r\nThis teaser only will take you 20 minutes, but this will be a good prologue.\r\n\r\nThe Dovaheim portal is not a bug, It would be included tomorrow.\r\n\r\nThis is a difficult mod, you should be at least 50 (with the best equpment) to beat it, and remember you cannot bring a companion with you (Mod bad behaviour, and it would differ the history, as it\\'s though to be a challenge for the dragonborn)\r\n\r\nIf you use the console, this mod is not fun, I do my best doing it as a balanced one so don\\'t cheat, you will miss a lot of features.\r\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n--Known Bugs--\r\nNone \r\n\r\n\r\nBE READY FOR DOVAHEIM",
  "categoryId": "88",
  "version": "1.0",
  "author": "Kenta150",
  "createdUnix": "1336683171",
  "updatedUnix": "1336685116",
  "containsAdultContent": false,
  "uploadedBy": "Kenta150",
  "primaryFile": null,
  "files": [
    {
      "fileId": "60308",
      "name": "Dovaheim The Prologue",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "178",
      "fileName": "Dovaheim The Prologue-16825-1-0.rar",
      "uploadedUnix": "1336683768",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9d3f5afa39ad2d16e0d3a1d511095e6f600b912e8462220083b2f8adc8ca5feb/analysis/1406883304/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovaheim%20The%20Prologue-16825-1-0.rar?fid=60308&ttl=1535782472&ri=8192&rs=8192&setec=207617e02e3c80eccd2e07657a19d710"
    },
    {
      "fileId": "60309",
      "name": "Dovaheim The Prologue reuploaded",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "178",
      "fileName": "Dovaheim The Prologue reuploaded-16825-1-1.rar",
      "uploadedUnix": "1336685116",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9d3f5afa39ad2d16e0d3a1d511095e6f600b912e8462220083b2f8adc8ca5feb/analysis/1406887032/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovaheim%20The%20Prologue%20reuploaded-16825-1-1.rar?fid=60309&ttl=1535782472&ri=8192&rs=8192&setec=0a52005641db8aa6c5b3ff08f60466cd"
    }
  ]
}