{
  "modId": 16828.0,
  "modName": "Ulfric Overhaul - Better Dialogue and Follower Options",
  "summary": "Unlocks dialogue options unavailable before and adds follower options for those that gain his trust. ",
  "descriptionHtml": "[color=pink]Inspired by the seemingly abandoned project by phanoica-immanion, I decided to see if I couldn&#39;t make a follower Ulfric that would continue to offer his services and who was completely voiced with his own voice. In building this, and rooting around his files I discovered several dialogue bits that appeared to be inaccessible or only available during very easily missed windows in the course of the game.\r<br />\r<br />So I fixed that too. \r<br />\r<br />[u]Features[/u]:\r<br />Now Completely UFO friendly. See notes.\r<br />New dialogue options for those that have fulfilled certain requirements.\r<br />New slightly less annoyed-sounding greeting for those he trusts once the war is finished.\r<br />For a -sizable- fee, he will accompany the player on their adventures - if he trusts them.\r<br />Fully commandable, (trade, wait, do this, dismiss).\r<br />Fully voiced with his own glorious voice.\r<br />New, somewhat younger appearance \r<br />\r<br />\r<br />I only changed his appearance because the 40+ complexion just looks like lines of dirt to me. Nothing big, and no CC required. I literally only changed his complexion and hairstyle. However, I recommend [url=http://skyrim.nexusmods.com/downloads/file.php?id=2488]Better Males[/url] by Chris57 and Favored Souls to get your Ulfric to look exactly like this. \r<br />\r<br />An optional file is now available that will re-apply his vanilla look if desired. See the optional files section below for more info on them.\r<br />\r<br />[u]Notes/Troubleshooting:[/u]\r<br />- Works with all DLC so far. Tested: Dawnguard, Hearthfire, Dragonborn.\r<br />- In most cases you will have to become his Thane to get him to like you well enough outside of console commands. Winning the war for him alone isn&#39;t enough. You can ask him to come with you as long as you have the money (5000g) and a relationship rank of 3 or higher. The option will not appear at all otherwise.\r<br />- Now fully compatible with and benefits from [url=http://skyrim.nexusmods.com/downloads/file.php?id=14037]Ultimate Follower Overhaul[/url] by fLokii. [Tested with v1.2i] Simply install the version of the main file that is marked for UFO. ((Please see special updating instructions if you are updating from v1.00 with UFO active&#33;)) Note: After dismissal he will probably decide to wander around his keep and do his daily Jarl duties in his underwear due to him being a custom follower. This can be fixed by simply letting him know...\r<br />- It is also fully compatible with [url=http://skyrim.nexusmods.com/downloads/file.php?id=9504]Followers Can Relax[/url] by King Coin (as of v5.2 at least). The dialogue he responds with isn&#39;t voiced but I&#39;m afraid there isn&#39;t much I can do about that.\r<br />- There are probably some crazy things that occur if you have him as a follower during certain civil war events. Keep that in mind if you have the option to bring him along with the war still raging.\r<br />- He can and will use his shouts when he&#39;s fighting bad guys with you. Take care not to get caught in the crossfire and shouted off a cliff. \r<br />- The (also apparently abandoned) Marry Ulfric mod by phanoica-immanion will cause issues if you&#39;ve used it to marry Ulfric. Even if you have removed that mod, those issues will linger as a result of his spouse status and it will result in conflicts with this mod that will render him unhirable through normal mean. Currently I have no solution for this. You can use console commands to force him into this mod&#39;s quest alias and enjoy the follower benefits it offers, but he will not offer his hireling services through dialogue if you&#39;ve used that mod.\r<br />- Known Issue: Playerfollowercount apparently still won&#39;t increase if he&#39;s hired as one of multiple followers. *headdesk* Still haven&#39;t ironed that out completely it seems, but he no longer leaves a negative number when he departs. If he is the lone follower, the count works fine. \r<br />- This mod was crafted from the ground up and is my first mod where I had to wrassle with scripts, so please let me know of any issues not mentioned. If you&#39;re an experienced scripter and can offer pointers on how to fix any issues that have cropped up, or notice anything in the code that could cause issues in the future, I welcome such advice. \r<br /> [/color]\r<br />\r<br />[color=orange][u]Updates[/u]:\r<br />[2.02a] (UFO version only)\r<br />-Hotfix for new additions to UFO v1.2c+. \r<br />[2.02]\r<br />-Fixed the bug where the playerfollowercount wasn&#39;t correctly registering his presence when you hired him. It still won&#39;t add to the count if he is one of multiple followers, but he&#39;ll no longer leave a negative number when you dismiss him.\r<br />-Did some mod cleaning to reduce file size and ck clutter. \r<br />[2.01]\r<br />-Fixed bug where Ulfric developed a troublesome addiction to horse riding when in the presence of a follower-marked horse. \r<br />-Added UFO mastered version of the main file. This will allow Ulfric to relax and ride horses alongside you as per UFO&#39;s custom behaviors. \r<br />[2.00]\r<br />-Fixed issues with UFO compatibility by giving him his own quest.\r<br />-Fixed minor typos on some subtitles.\r<br />-Increased his hireling fee to something more befitting a Jarl&#39;s services. He now costs 5k. \r<br />[1.00]\r<br />-Release version.\r<br />\r<br />[u]Future Plans[/u]\r<br />Marriage: I do want to add this, but I am very OCD about the dialogue and want it fully voiced. Unfortunately there isn&#39;t much to work with at all. I&#39;ve combed through everything and I keep hoping he&#39;ll get some more dialogue to use in DLCs, but so far - no such luck. So unless there is a believable Ulfric impersonator in the house, I dunno how doable this will be to my own satisfaction. [/color]\r<br />\r<br />[color=cyan][u]Install / Uninstall / Update Instructions[/u]:\r<br />-To install ~ Select the file version that suits your needs and extract contents to data folder or use the NMM&#33; Load Order should always be [b]above[/b] UFO and any Ulfric appearance-altering mods. This may make it incompatible with wrye patch. I&#39;m sorry about that. \r<br />-To uninstall ~ Dismiss Ulfric, exit game and remove files manually or via NMM.\r<br />-To Update - Use NMM or extract contents to data folder, overwriting all files when prompted. \r<br />[b]IMPORTANT NOTE: If you used v1.00 with UFO active, make sure you have a clean save according to the instructions in RED below before installing the update or you run a good chance of losing the option to hire him&#33; He will also very likely be wandering around in his bloomers but that can be fixed by telling him he&#39;s nekkid.[/b]\r<br />\r<br />[u]Optional Files & Alternate Version:[/u]\r<br />-Alternate Main File UlfricOverhaulForUFO: Self explanatory. Only install and play with this version if you have UFO installed and active as it requires UFO present to function and will cause CTD at the loading screen without it. Even though UFO is this file&#39;s master, you should still set KTNUlfric.esp ABOVE it in the load order, or you will experience quirky follower behavior from vanilla followers.\r<br />-Optional File CWBattleUlfric: There is actually a clone Ulfric that shows up for a whole 20 seconds to give the pep talk before the Battle for Solitude. I have no idea why, since the normal Ulfric is the one who fights inside. Anyways, this file will make it so that this clone looks like the Ulfric you&#39;ll see in this mod.\r<br />-Optional File OriginalRecipeUlfric: Contains appearance files for those that prefer the vanilla Ulfric look. Requires the main file to function as its only a face re-alteration. If you use this optional file, you will not need the CWBattleUlfric one. Be sure to place this file below KTNUlfric.esp in the load order.\r<br />[/color]\r<br />\r<br />[color=red][u]Getting a Clean Save if you used v1.00 with UFO active[/u]\r<br />Here is how to harmlessly release Ulfric from your service and have a clean save so that you can safely update this mod from v1.00 to newer versions. I&#39;m very sorry for the hassle, but from here on out this won&#39;t be needed.\r<br />\r<br />[b]**Again, This is only required for those that updating that were using v1.00 of this mod with UFO active and Ulfric as a current follower.**[/b]\r<br />\r<br />-Dismiss all other followers, take him to the Palace of Kings, save and exit the game.\r<br />-Disable (do not uninstall) UFO.\r<br />-Reload the save and dismiss Ulfric. \r<br />-Depending on what order you hired him in, Ulfric may wander away from you after a few seconds on his own instead, and go about his usual business (this is why you should bring him to the Palace, so you can catch him. He will still be considered a follower when you talk to him. \r<br />      -If this happens, Open console and select him or type prid 0001b131\r<br />      -Once you have his number active (Make sure its the one above, otherwise you got some motes or the throne active) type in these 2 commands: \r<br />       addfac 0005c84e -1 \r<br />       addfac 000bd738 -1\r<br />       -Close console. Talk to Ulfric to test. He should no longer have follower commands and be rehirable if you desire. \r<br />-Open console and type show playerfollowercount. It should be 0. If it isn&#39;t, type playerfollowercount to 0 or rehire and dismiss him. \r<br />-Save the game. You now have a clean save as far as this mod is concerned. However, just to be on the safe side I strongly recommend reactivating UFO, then following the failsafe uninstall steps to completely remove it so that you will have a totally clean save. This is to avoid conflicts - such as the glitch that may render you incapable of hiring more than one vanilla follower. \r<br />-Once you have completely removed UFO via Tina and have a totally clean save, then you can reinstall it and update this mod to its compatible versions. [/color]\r<br />\r<br />[u]Recommended & Pictured Mods:[/u]\r<br />*[url=http://skyrim.nexusmods.com/downloads/file.php?id=2488]Better Males[/url] by Chris57 and FavoredSoul - to get the exact appearance.\r<br />*[url=http://skyrim.nexusmods.com/downloads/file.php?id=14037]Ultimate Follower Overhaul[/url] by flokii - it is the follower enhancing mod I use so of course I think everyone else should to. \r<br />*[url=http://skyrim.nexusmods.com/downloads/file.php?id=9504]Followers Can Relax[/url] by KingCoin - This was my &#39;relax&#39; mod of choice for followers until UFO acquired the option. Fully compatable with this mod, so I highly recommend it. \r<br />*[url=http://skyrim.nexusmods.com/downloads/file.php?id=5744]Ulfric Armour Mod[/url] by Laz3456 - Use this to make his original outfit offer decent armor rating.\r<br />*[url=http://skyrim.nexusmods.com/downloads/file.php?id=16625]Teddy Bears[/url] by Tamira and Arion - because everyone needs a teddy bear now and then.\r<br />*[url=http://skyrim.nexusmods.com/downloads/file.php?id=14513]Khajiit Speak[/url] by mjharper. I use this so any screenshots uploaded by me will have khajiit flavored player dialogue. A must have for khajiit enthusiasts.\r<br />*[url=http://skyrim.nexusmods.com/downloads/file.php?id=8468]Fair Khajiit[/url] by Rainwhisker - a very detailed unique khajiit follower, and a fine role model for perfect follower hopefuls like my Ulfric.",
  "categoryId": "33",
  "version": "2.02",
  "author": "trukittn",
  "createdUnix": "1336685671",
  "updatedUnix": "1339017184",
  "containsAdultContent": false,
  "uploadedBy": "trukittn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "60315",
      "name": "UlfricOverhaul_v100",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "171",
      "fileName": "UlfricOverhaul_v100-16828.zip",
      "uploadedUnix": "1336685899",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/c5df1713d983a3ce3c08579b51b9cfc21dde326b726433105e3590c7ed2f6f42/analysis/1406883307/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UlfricOverhaul_v100-16828.zip?fid=60315&ttl=1535782474&ri=8192&rs=8192&setec=c8920d19c504ee69ae3d482747db55a4"
    },
    {
      "fileId": "60320",
      "name": "CWBattleUlfric",
      "version": "1.00",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "321",
      "fileName": "CWBattleUlfric-16828.zip",
      "uploadedUnix": "1336686666",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/90fafbcd84fba42dbf2365fe171f048a1e378a831fc342e08ed19705bd0cfe67/analysis/1406883377/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CWBattleUlfric-16828.zip?fid=60320&ttl=1535782475&ri=8192&rs=8192&setec=b6494653fe00128cb0480e3f8dcbc4ae"
    },
    {
      "fileId": "60406",
      "name": "OriginalRecipeUlfric",
      "version": "1.00",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "61",
      "fileName": "OriginalRecipeUlfric-16828-1-00.zip",
      "uploadedUnix": "1336718881",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/302f1855b88865d18efdf08f4ae6f543a296d28c9c44d93949960a4bf58ac75a/analysis/1406884223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OriginalRecipeUlfric-16828-1-00.zip?fid=60406&ttl=1535782475&ri=8192&rs=8192&setec=24215e20e654af8c1f92f637beed89f0"
    },
    {
      "fileId": "62944",
      "name": "UlfricOverhaul_v200",
      "version": "2.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "179",
      "fileName": "UlfricOverhaul_v200-16828.zip",
      "uploadedUnix": "1337662134",
      "modVersion": "2.00",
      "virusScanUrl": "https://www.virustotal.com/file/9c4940b12b7c08cef36850ce51afba1baf413d3b631874b4d51b8afde3cf3f0a/analysis/1406908667/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UlfricOverhaul_v200-16828.zip?fid=62944&ttl=1535782476&ri=8192&rs=8192&setec=f24f6e7f31e55e00b36532c70e511b51"
    },
    {
      "fileId": "63043",
      "name": "UlfricOverhaul_v201",
      "version": "2.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "179",
      "fileName": "UlfricOverhaul_v201-16828.zip",
      "uploadedUnix": "1337716547",
      "modVersion": "2.01",
      "virusScanUrl": "https://www.virustotal.com/file/0f1b9273f8b5000120448ef016621abede5a355542dfd7e264512277d576940a/analysis/1406909683/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UlfricOverhaul_v201-16828.zip?fid=63043&ttl=1535782476&ri=8192&rs=8192&setec=9f33b1b6aec06922ff5376116007dd81"
    },
    {
      "fileId": "63052",
      "name": "UlfricOverhaulForUFO_v201",
      "version": "2.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "179",
      "fileName": "UlfricOverhaulForUFO_v201-16828.zip",
      "uploadedUnix": "1337721104",
      "modVersion": "2.01",
      "virusScanUrl": "https://www.virustotal.com/file/1cb69ad0c0ed1c9132f532f9d73acdf9fb94de6ed5073c71c2087d45af2c711e/analysis/1406909763/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UlfricOverhaulForUFO_v201-16828.zip?fid=63052&ttl=1535782477&ri=8192&rs=8192&setec=8e287368e7ba8276cf61e1b419f7a13f"
    },
    {
      "fileId": "65920",
      "name": "UlfricOverhaul_v202",
      "version": "2.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "176",
      "fileName": "UlfricOverhaul_v202-16828-2-02.zip",
      "uploadedUnix": "1338838865",
      "modVersion": "2.02",
      "virusScanUrl": "https://www.virustotal.com/file/1a456365ba61dbe2242a2cc98d42104442af8d12e4ef6788b22e56f5d4d2a186/analysis/1406938142/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UlfricOverhaul_v202-16828-2-02.zip?fid=65920&ttl=1535782477&ri=8192&rs=8192&setec=7b369034917e79e623f0a9c4712956cc"
    },
    {
      "fileId": "65921",
      "name": "UlfricOverhaulForUFO_v202",
      "version": "2.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "176",
      "fileName": "UlfricOverhaulForUFO_v202-16828.zip",
      "uploadedUnix": "1338838963",
      "modVersion": "2.02",
      "virusScanUrl": "https://www.virustotal.com/file/840ff8f5cccde2ae0fb32d958ff0dfa5425e0ce8981c1df85a876a25102ce7fb/analysis/1406938143/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UlfricOverhaulForUFO_v202-16828.zip?fid=65921&ttl=1535782478&ri=8192&rs=8192&setec=0f47ae475af5d83fe43929eb40db4f4f"
    },
    {
      "fileId": "66404",
      "name": "UlfricOverhaulForUFO_v202a",
      "version": "2.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "176",
      "fileName": "UlfricOverhaulForUFO_v202a-16828-2-02.zip",
      "uploadedUnix": "1339017184",
      "modVersion": "2.02",
      "virusScanUrl": "https://www.virustotal.com/file/f2dcf2dcc2bc63019fefe343bd0503da70dbc7e57347399926b546c9d53bdf46/analysis/1406943305/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UlfricOverhaulForUFO_v202a-16828-2-02.zip?fid=66404&ttl=1535782478&ri=8192&rs=8192&setec=4cc95f0528de6308db29f17206debbdb"
    }
  ]
}