{
  "modId": 16843.0,
  "modName": "The Lord of Illusion - Ring",
  "summary": "",
  "descriptionHtml": "Please endorse this if you like it, thanks!\r\n\r\nAn artifact has been uncovered and is now in the possession of the College of Winterhold\\'s Illusion master trainer, Drevis Neloren. This ring - the Grandmaster Illusionist\\'s Ring - grants the wearer with enhanced Fear, Frenzy, and Calm abilities. Drevis will kindly sell you this ring for a small fortune.\r\n\r\nWhat it does:\r\n\r\nThose crappy illusion effects that only seem to affect enemies of a much lesser level than you will no longer be so crappy. This adds a magnitude of your illusion skill, multiplied by 0.6, to the existing effects.\r\n\r\nExample 1 - Fear spell (enemies up to lvl 9) with level 20 illusion skill\r\n9 + (20 * 0.6) = Fear spell now affects level 21 enemies\r\n\r\nExample 2 - Mayhem Spell (25 mag), Animage Perk (8 mag), Rage Perk (12 mag), lvl 100 illusion\r\n25 + 8 + 12 + (100 * 0.6) = 105 magnitude against an animal (Level 100 Animal) with all relevant perks and max illusion skill\r\n\r\nThis mod is designed to be balanced and effective in vanilla as well as with difficulty mods such as leveled enemies.\r\n\r\nALCHEMISTS!!!!!\r\n\r\nI wanted to increase the magnitude of the frenzy and fear effects in potions, but this ring has no affect on poisons :(\r\n\r\nOh wait. . . I just upped the effects for each ingredient with fear or frenzy effects so that now they are more powerful bwahahahaha!!! (5x more powerful - see glorious screenshot)\r\n\r\nThere are 2 screenshots, if you want the more powerful frenzy and fear poisons, then you need to get you some Alchemy Apparatuses!\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=14970\r\n\r\n___________________________________________________________________\r\nPermissions:\r\n\r\nI feel like this, or something like it, should replace the related perks in the illusion tree because the vanilla ones are terrible. If anyone would like to use this in their own work, feel free. Give me some credit if you are so inclined.\r\n\r\nDo not upload this to steam or any other site, pretty please",
  "categoryId": "93",
  "version": "1.01",
  "author": "tg08096",
  "createdUnix": "1336700202",
  "updatedUnix": "1336700886",
  "containsAdultContent": false,
  "uploadedBy": "tg08096",
  "primaryFile": null,
  "files": [
    {
      "fileId": "60364",
      "name": "Lord of Illusion - Ring",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Lord of Illusion - Ring-16843-1-01.rar",
      "uploadedUnix": "1336700886",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/ca7a2844d19ae39c831e6ef6cf0e48bdb80a936925e504cd1ebe8f6dec1f43e1/analysis/1406883847/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lord%20of%20Illusion%20-%20Ring-16843-1-01.rar?fid=60364&ttl=1535782515&ri=8192&rs=8192&setec=7dbb6eb3122f72f016690f75cdfd1948"
    }
  ]
}