{
  "modId": 16859.0,
  "modName": "Freedom Or Gore Island and Haunted Race",
  "summary": "New Island and race.",
  "descriptionHtml": "This adds a new world into Skyrim and a new race. The island is called \\\"Freedom Or Gore\\\" and the new race is called haunted daedric. Basically for the haunted daedric mod I had an idea. Why not making a werewolf wear daedric armor? So I tried but failed. Then I searched on the web what I did wrong and found an answer. But when I tried doing it again, it stilled did not work. The first time preview showed nothing but the second time the preview showed a daedric armor that looked like someone had banged a metal mallet and twisted and melted. It had this strange retarded look. But then I got an idea. Why not make a race featuring a daedric armor? So when players became a haunted daedric, they had this evil like corrupted look. But when this is tried in game, the walking and sprinting animations look really weird. Plus because this race was first generated from a werewolf race it looked worse!\r\n\r\n\r\n________________________________World____________________________________________________\r\nAny way the new world I placed looks awesome. Maybe for some people. When I wrote World I didn\\'t meant I remade the entire of Skyrim and Tamriel. I meant new islands. The reason why I said world was because it was not linked into Skyrim or Tamriel and the islands is surrounded by water. A lot! Sadly your going to have to make or perfect the navmesh for the islands/world because: 1. I don\\'t know how.    2. I didn\\'t want to waste time perfecting every little bit of the island. So if you are able to make the navmesh for the island and post it I would be grateful but you must at least give me a little credit. I have technically not made a door linking to the islands/world but you can access it by typing coc freezingdepths or without the s at the back. When you enter the world there will be five islands. Two that are linked by terrain. Two close that are close to one and one that has huge hills/mountains. The one in the centre that is the one with icey textures has 3 forges, an enchanting table and a chest featuring a powerful sword and bow. The one with mountains a lot, is supposedly to be called a lair of some dragon so if you are editing maybe you can make a dungeon featuring a quest that requires killing a dragon. So you can call it \\\"Lair Of (name of dragon)\\\". The one with ice textures is called freezing depths. The one with a huge hole that has water is called, I really don\\'t know I forgot. You can rename it if you want. The one that has only one house and pataches of grass is called Mini Island I think. And the last one? I don\\'t know. I don\\'t even know there was a fifth one til I entered the game.\r\n\r\n\r\n_______________________Extra_____________________________________________________________\r\nAside from the two mods this also actually adds another race called Hybrid Khajiit. If you seen my other files, Hybrid Argonian, Hybrids and Hybrid Race then you would know what this mod is about. It simply adds a khajiit race that has the power to turn into a Hybrid. I don\\'t know if the size is as big as Hybrid Argonian transformation but I think there may be new textures to the werewolf.\r\n\r\nThanks for reading!\r\n\r\n________________________________Update___________________________________________________\r\nThere now is two doors, a new race, a new weapon, new awkward place and three new different types of creatures. \r\n\r\nThe first door is located close to the skyforge just walk up the steps and enter the room. The second is in dragonsreach. Walk up the steps there will be a small nordic ruin. Use the door.\r\n\r\nThe new race is Hybrid Khajiit which includes Hybrid Form.\r\n\r\nThe new weapon is a daedric bow that is powerful.\r\n\r\nThe new place is a room I mentioned close to the skyforge.\r\n\r\nThe three creature types are shrunked hargravens, argonian greybeards and dwarven centurion. All shrunked. The greybeards and centurions are a team. A powerful team. And the hargraven is pathetic.\r\n\r\n\r\nRead the Changes.txt for full details.\r\n",
  "categoryId": "68",
  "version": "4.5",
  "author": "Ajw",
  "createdUnix": "1336729633",
  "updatedUnix": "1336753754",
  "containsAdultContent": false,
  "uploadedBy": "q9u5m",
  "primaryFile": null,
  "files": [
    {
      "fileId": "60445",
      "name": "Island and Race",
      "version": "4.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "96",
      "fileName": "Island and Race-16859-4-00.zip",
      "uploadedUnix": "1336731115",
      "modVersion": "4.00",
      "virusScanUrl": "https://www.virustotal.com/file/3fa20bb11426b52c8a024db53a501cfe6a97b888c711ec17d826e90b03938c88/analysis/1406884510/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Island%20and%20Race-16859-4-00.zip?fid=60445&ttl=1535782550&ri=8192&rs=8192&setec=9398007caa89a02b97e6ea1502ee0e92"
    },
    {
      "fileId": "60507",
      "name": "Update",
      "version": "4.5",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "148",
      "fileName": "Update-16859-4-5.rar",
      "uploadedUnix": "1336753754",
      "modVersion": "4.5",
      "virusScanUrl": "https://www.virustotal.com/file/2badeade7df8300b48cccb233b799850f67f619b687ba8a9679615133f30b9b6/analysis/1406885227/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Update-16859-4-5.rar?fid=60507&ttl=1535782550&ri=8192&rs=8192&setec=6ecb08f8cff8ff4cfcafbe5cafd72c4a"
    }
  ]
}