{
  "modId": 16861.0,
  "modName": "Dalls_Nord_Hero_Armor",
  "summary": "Nord_Hero_Armor is full set of enchanted armor you can make (blacksmith) yourself. As this Armor set - its components comes in, varying levels of quality and protective enchantment you will have choice of crafting them to fit your own preferences.",
  "descriptionHtml": "---README---\r\n\r\nfor DALLs - Nord_Hero_Armor\r\n\r\nv1.0\r\n\r\n10/05/2012\r\n\r\nNord_Hero_Armor is full set of enchanted armor you can make (blacksmith) yourself. As this Armor set - its components comes in, varying levels of quality and protective enchantment you will have choice of crafting them to fit your own preferences.\r\n\r\nThese legendary Steel Armors have been traditionally worn by ancient Nord warriors. Unfortunately art of making and enchanting them, as far as vanilla game goes, was lost long time ago but luckily for us some of these forgotten steel crafting recipes n authentic (armor enchantment) template runes have been recently found and now we can craft them again - in their full - unsurpassed glory. Runic templates for these enchantments (runes are magically etched into every piece of armor) are still quite scarce, so don\\'t expect to find them on some ready to buy sale or all in one place. All blacksmiths and some other merchants will have some on sale but majority of them you will find along the way - in your usual loot. \r\n\r\nThere are three known grades of these ancient runes. How this enchantments work - we still don\\'t know for certain. Regardless, it is quite obvious that each rune grade is intended for different class / level of warrior as they produce varying degrees of improvement. Once you have them - together with all other (required for crafting) materials - any blacksmith workbench will do. Naturally, you need to know how to craft Steel (arms n armors) as well.\r\n\r\nIf you want other (in-game) Hero Armors to look same check / use my Nord_Hero mod.\r\n\r\nTo install you need to navigate to your Steam/SteamApps/common/skyrim - game folder and paste / drag n drop in it my Data (mod) folder. Allow overwrite!    \r\n\r\nIf you don\\'t like them, simply delete / remove my (mod) .esp and files from Data/ (meshes n textures) DallsGear/armor/draugr.\r\n\r\nBugs/conflicts: none known.\r\n\r\nUse:\r\nFree to use but if any files included (therein) are to be used for modding ask me for permission!\r\n\r\nEnjoy and try to remember - if you like it even in a part - to give endorsement! \r\n\r\nThanks to Bethesda for really great game.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Dall",
  "createdUnix": "1336731805",
  "updatedUnix": "1336732207",
  "containsAdultContent": false,
  "uploadedBy": "Dall",
  "primaryFile": null,
  "files": [
    {
      "fileId": "60449",
      "name": "Dalls_Nord_Hero_Armor",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15609",
      "fileName": "Dalls_Nord_Hero_Armor-16861-1.7z",
      "uploadedUnix": "1336732207",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/69f19eb09d2fadef2206e0d212e3d2e2b8f45ca9382b9cb0c3a34d2fd4485823/analysis/1406884521/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Nord_Hero_Armor-16861-1.7z?fid=60449&ttl=1535782553&ri=8192&rs=8192&setec=87cbbc236c94a7ba349c9692be0924e0"
    }
  ]
}