{
  "modId": 16881.0,
  "modName": "DOVAHEIM The Dungeons",
  "summary": "-CONTAINS SPOILER-\r\n\r\nIn Dovaheim, you will face a new Dragonborn, created by you when you used the Elder Scroll, now is your tiem to stop him and prevent the total defeat of the world as you know it.",
  "descriptionHtml": "[size=24]CONTAINS MAIN QUEST SPOILERS[/size]\r\n\r\n**This year im going to be very busy, so i think I will not develop this mod more because it takes me long time, but, i have everything written, designed etc etc the only thing is making it with CK, if someone wants to help me we will develop it together**\r\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\nHere is the first part of Dovaheim, this time, is The Dungeons, you have to go into them looking for the Dungeon Master who owns The Dragon Temple key.\r\n\r\nThe Dungeons is the beggining of this mod, it will explain you some parts about the history, but the next parts would be more related each time (To see an increasing history development)\r\n\r\n**Now working in the next part, thanks for the support!**\r\n\r\n[size=9]Dovaheim\\'s History[/size]\r\n[color=\\\"red\\\"]\r\nDovaheim, by Esbern, Grandmaster of the Blades\r\n\r\nI will tell you of Dovaheim\\'s history.\r\n\r\nWhen you used the Elder Scroll at the time wound on the Throat of the World, you did not only change history forever. You also created another timeline, a world with a different Dovahkiin. This Dovahkiin fulfilled the prophecy, but he did not kill Paarthurnax. After slaying Alduin and returning from Sovngarde, both he and Paarthurnax forged a strong alliance. Together with dragons that had joined their cause, they prepared to wage war against the dovah that still defied them. \r\n\r\nMeanwhile in Skyrim, civil war was raging. Ulfric Stormcloak beseeched the Dovahkiin for aid. With many dragons on the Dovahkiin\\'s side, the conflict could end swiftly and the Empire was forced to negotiate a fragile peace with Skyrim. Jarl Ulfric was crowned the new High King. The Dovahkiin and Paarthurnax, however, continued recruiting dragons into a mighty army – and slaying any dovah that refused to join.\r\n\r\nThe army soon attracted men and mer as its recruits, with the Companions, the Dark Brotherhood and the Greybeards becoming the Dovahkiin\\'s chief supporters. Together, the three founded the Dovahkiin Order.\r\n\r\nThe rest of Tamriel did not fail to take note of these developments. Despite losing the war, the Empire was at least spared crushing defeats when they surrendered soon after witnessing the might of the dragons arrayed against them. General Tulius was executed as a gesture of the new peace, and Tito Mede II died in strange circumstances. This left the bulk of the Imperial army to trudge home to face another threat – this time from the Thalmor.\r\n\r\nUlfric\\'s victory had left Thalmor enraged as they considered Skyrim the next perfect conquest for the Aldmeri Dominion. The Thalmor marshalled their forces, and in a decisive move, wiped out several of Skyrim\\'s major cities after High King Ulfric failed to defend them. And so began the wintry province\\'s own Great War.\r\n\r\nBy then, soldiers were flocking to join the Dovahkiin\\'s forces who had also taken to calling themselves the Dovah Order. Now leading the most powerful army in Skyrim, the Dovahkiin called on the guilds and factions to unite and defeat the invaders.\r\n\r\nTwo years later, the Thalmor were annihilated, as were their Altmeran royalty in equally mysterious circumstances. The Dovahkiin was unquestionably the most powerful man in Skyrim – but he was not High King. The day dawned when he challenged Ulfric to a duel, killing the latter with his Thu\\'um just as Ulfric had done with High King Torygg. It was the Dovahkiin who built Ulfric\\'s Tomb as a monument to his moment of ascension.\r\n\r\nTo further his power, the Dovahkiin ordered the construction of the largest castle ever to be built in Skyrim. Five years later, Dovaheim would be referred to as the Dovakiin\\'s heart. During those years, he acquired the Eye of Magnus from Winterhold College, now destroyed by Dessan, the Dovahkiin\\'s court warlock. Paarthurnax, together with Dessan, Angeir and the Dovahkiin, shaped the Eye of Magnus into the Dovah Orb, an artifact that could control the will of all dragons. Fearing this artifact, the last remaining dovah yielded.\r\n\r\nBut it was not over. Taking advantage of the Thamor\\'s defeat, the Imperials struck back in yet another war, regaining their status as a major power in Tamriel. When the resulting conflict claimed the life of Tito Mede II\\'s successor, the Dovahkiin sought to seize “the deadliest weapon ever to be wielded by a man” - the crown. He demanded the title of Emperor, saying he had Tamriel\\'s support, but the Imperial Council and the Blades rejected his claim and marched against him.\r\n\r\nThe Dovah Order could not withstand the combined might of the Imperial Army and was pushed back to Dovaheim. Unknown to them, the fortress contained more power than the Empire anticipated when they lost half their troops to the Dovah Orb during the battle for Riften. Months later, Dovaheim was finally surrounded, but this was another trap. Dessan sealed the fortress with a magical wall.\r\n\r\nI believe the Dovahkiin and Paathurnax are charging the Orb for a warp through time, using the Elder Scroll the Dovahkiin had acquired to summon reinforcements.\r\n\r\nIf they succeed, the armies of the Dovah Order – reinforced with draugr, will appear in your timeline. Between a dying Empire and a fragile country, you are the only one who can stop them now.\r\n\r\n\r\n[/color]\r\n[size=9]Mod features[/size]\r\n\r\nIn this mod you will find a part of the Dovaheim castle (as the other parts aren\\'t still open) The Dungeons, they contain combat but they feature something much difficult: Trials. You will have to use your head, memory, and Skyrim knowledge if you want to survive, also you need a strong character (50-70). Also a well balanced item could be finded here for your character, remarkable loor for each class in each part!\r\nThe average time for this mod is 2 hours, if people endorse it, in july it could easily be 8 hours of quality gameplay, as everything is already though, but it\\'s not easy to run in the game haha.\r\n\r\nTo start the mod, go to Ulfric\\'s Tomb by minimap or locate it at north Windhelm\r\n\r\n[size=9]Future expansions[/size]\r\nThe Dragon Temple: The outcome of the Draug Army into actual Skyrim, you will have a limited time to prevent the army warp to your time. It will feature more history information and different kind of battles.\r\nIf you want me to do this, I need 20 endorse before\r\n\r\nThe Archmage Sanctum: Archmage Dessan\\'s refugee, spiritual challenges in there, mixed with a lot of magic flavour, exotic enemies and NIGHMARES. Discover what happened to Winterhold college and the source of Dovahkiin power\r\nIf you want me to do this, I need 30 endorse before\r\n\r\nThe Dovahkiin Tower: The best part of the mod, fight against the most though bosses ever, which are not just strong creatures, they are charismatic ones. A vast variety of Flash Backs which will allow you to become part of the Dovaheim history, including epic battles and the answers to your questions.\r\nAlso features Dovahkiin himself.\r\nIf you want me to do this, I need 40 endorse before\r\n\r\n[size=9]Important information[/size]\r\n\r\nPLAY THIS MOD IN REGULAR DIFFICULTY, some bosses would be in a bad behaviour if not.\r\n\r\n\r\nIf you downloaded the prologue yesterday i\\'m afraid you will have to uninstall it and redone what you did with whis file (I\\'m sorry) or not redone and use console unlock in Dovaheim exterior door (the first after the portal)\r\n\r\nYou have to take in count that i\\'m not a professional, so everything is not perfect, the bugs it have (they are below) I wasn\\'t able to remove them, but they don\\'t affect the gameplay much.\r\n\r\nI strongly recomend to be in the levels I recomend (50-80) and having completed the main quest, also COMPANIONS ARE NOT ALLOWED, or the mod can be in strange behaviour.\r\n\r\n[size=9]Known Bugs[/size]\r\n\r\nI don\\'t know why the hell you can not go back after you enter the dungeon (Dovahkiin Prison for being exact), but it\\'s possitive too because it remembers you that you cannot go back (Good pressure for a Dungeon, isn\\'t it?)\r\nWhen you face The Beast, it\\'s suposed by the mod lore you cannot kill it with the blade or magic (although you can) so if you want to experiment better that part, wear no clothes and just the torch, and do the right thing in the right moment (you will know). Another bug related to it is that sometimes, it gets stuck after you pass the second door, you can make it keep following you (you need to if you want to complete the dungeon) so be sure he pass the door.\r\n\r\nSometimes in the Jail hall some prisoner is out of the cell (No correction possible) but is not a big problem.\r\n\r\nIn laberintic parts, the walls are not always well connected (IT\\'s impossible to spend 4 hours with it), they are just 8 or 10 small grey lines, dont care about them.\r\n\r\nIf your game crashes, reload it first.\r\n\r\nIf you notice another bug, tell me by message :D\r\n\r\n\r\n[size=9]Notes[/size]\r\n\r\n*SPOILERS*\r\nA lot of players have had the same problem when facing Ghurkor, I thouhg that everybody will undertand why a Dragonborn is needed to defeat the beast but the answer is this, you have to bring the beast to the stone bridge and: FUS ROH DAH! Then go down with the stairs and get the key :D. \r\n\r\nIf the laberinth becomes impossible, open the console º and type unlock in the door.\r\nYou have to know that Dovaheim would be a huge mod if there is a good support after it, because I have many things to do and I don\\'t want to risk a lot of time for just a few downloads, you have to understand me, also I look for a veteran modder to help me with the ideas, I have all the mod done in paper (I promise you this is the top of the iceberg, the next are EPIC) so I will accept any help you can bring me",
  "categoryId": "88",
  "version": "1.4",
  "author": "Kenta150",
  "createdUnix": "1336762591",
  "updatedUnix": "1338553855",
  "containsAdultContent": false,
  "uploadedBy": "Kenta150",
  "primaryFile": null,
  "files": [
    {
      "fileId": "60550",
      "name": "Dovaheim The Dungeons",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "635",
      "fileName": "Dovaheim The Dungeons-16881.rar",
      "uploadedUnix": "1336763610",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e8bd7504b383bb815c8a1a588a48e059e15a42bd44dafffadb7506c969af0fa7/analysis/1406885643/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovaheim%20The%20Dungeons-16881.rar?fid=60550&ttl=1535782590&ri=8192&rs=8192&setec=8e5635e915a97f477d55f3a9d698d539"
    },
    {
      "fileId": "65056",
      "name": "DOVAHEIM The Dungeons BUG FIXED",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "636",
      "fileName": "DOVAHEIM The Dungeons BUG FIXED-16881-1-4.rar",
      "uploadedUnix": "1338553855",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/c88ae79d24a68683b952c8de55d54d804d71f8aa41ac155b5f3e623fc7b59086/analysis/1406929447/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DOVAHEIM%20The%20Dungeons%20BUG%20FIXED-16881-1-4.rar?fid=65056&ttl=1535782590&ri=8192&rs=8192&setec=c61bcd695f977c23458a0aecc4e795c6"
    }
  ]
}