{
  "modId": 16901.0,
  "modName": "Lore-Friendly Starting Stats and Encumbrance",
  "summary": "Small mod designed to subvert the vanilla stats distribution at the beginning of the game. Mod assigns lore-friendly starting values to Health, Stamina, Magicka, Carryweight, and MoveSpeed based on your character\\'s chosen Race and Gender. Also changes encumbrance to be more realistic.",
  "descriptionHtml": "Lore-Friendly Starting Stats and Encumbrance\r\nVersion 1.20 Expanded Statistics Edition\r\nBy Sukeban\r\n\r\nI. Introduction\r\nII. What This Does\r\nIII. Gender Factor\r\nIV. Overview of New Stats\r\nV. Encumbrance\r\nVI. Install + Uninstall\r\nVII. Thanks + Credits\r\n\r\n[b]I. Introduction[/b]\r\n\r\nHave you ever wondered why a lumbering Orc chieftain runs faster than a fleet little Wood Elf? Or have you ever found it unrealistic that your character begins the game able to carry around 300 units of weight? How about that High Elves and Nords begin the game with the same size mana pool? \r\n\r\nIf you answered \\\"Yes!\\\" to any of these questions, then this mod is for you!\r\n\r\nAnd if you do like the idea of this mod, check out my lore-friendly crafting, loot, and economy overhaul mod here: http://skyrim.nexusmods.com/downloads/file.php?id=16715\r\n\r\n[b]II. What This Mod Does[/b]\r\n\r\nThis mod blows up the vanilla 100/100/100 starting distribution of stats by assigning new, lore-friendly values to the various races and genders. The new values are based upon the starting skill bonuses of the races, as well as that race\\'s role in the TES lore. Affected beginning stats are: Health, Stamina, Magicka, Carryweight, MoveSpeed, WeaponSpeed, CritChance, Prices, Mass, NoiseMult, ShoutMult, and Unarmed Damage.\r\n\r\nStats are scaled along a varying axis ranging from 0-200, meaning that no character will receive a starting stat value higher or lower than these two extremes. No skill allocations have been touched by this mod I do not want to dictate what you do with your character. I have taken care only to change \\\"physical attribute\\\" stats rather than trying to enforce a particular \\\"class\\\" or \\\"skillset\\\" on a given race. Certainly, the beginning stats lend themselves better to some \\\"skillsets\\\" than to others, but where you begin is certainly not the \r\n\r\nThis mod is intended for those interested a slightly more comprehensive role-playing experience, where your race matters a bit more to your character than a handful of skill points.\r\n\r\n[b]III. Gender Factor[/b]\r\n\r\nGender is also introduced as a role-playing factor. I am aiming for immersion and balance here, so I have taken the conventional view that men are generally stronger (health/carryweight) and sturdier (stamina) than women. Women, as far as this mod is concerned, are treated as being more intelligent (magicka) and faster (movespeed) than men. For this mod, this means that women receive +20 magicka in relation to men and move 5% faster. However, they are also -20 stamina, health, and carryweight in relation to their male counterparts. That, of course, isn\\'t 100% balanced, but--let\\'s be real--it would probably be easier to be a male in the Middle Ages than it would to be a female. This reflects that.\r\n\r\nWomen are, however, better at \\\"sneakier\\\" skills or those requiring greater dexterity. Thus, they have a better relationship with stealth and with weapon speed. They are also \\\"luckier\\\" (CritChance) than males and receive better prices. Hopefully this should compensate for their (in-game) physical statistical limitations.\r\n\r\n[b]IV. Overview of New Stats[/b]\r\n\r\nRather than list every new statistical constellation, I will state the archetypes that the races have been crafted to resemble:\r\n\r\nA. Orcs -- Strong and mighty warriors, slow tanks with little time for magick\r\nB. Wood Elves -- Swift and agile, a glass cannon that relies on outrunning foes rather than fighting toe-to-toe\r\nC. High Elves -- Haughty and intelligent, magick users with a disdain for the fray\r\nD. Dark Elves -- Skilled in both combat as well as magicks, relatively swift\r\nE. Bretons -- Highly proficient in magic, but vulnerable in melee\r\nF. Imperials -- Proficient in most everything, but an expert in none\r\nG. Redguards -- Consummate athletes, able to sprint for ages, but burning with a hate of magick\r\nH. Nords -- Resilient and hardy, master warriors who do not care much for magick\r\nI. Argonians -- Wise and strong, able to command magicks as well as wield a blade\r\nJ. Khajiits -- Excellent runners with combat prowess, can wield magicks in a pinch\r\n\r\n[b]V. Encumbrance[/b]\r\n\r\nThe second portion of this mod is straight-forward. Worn equipment is functionally lighter than carried equipment. Worn equipment weighs 40% less than carried equipment.\r\n\r\nYou may also have noticed that all of the new racial carryweights are WAY lower than they are in vanilla. This is because I\\'ve set the default carryweight (what I imagined my \\\"vanilla\\\" to be) to be 60 for females and 80 for males. Think about it, that is already a lot to carry on your person. Having backpacked, I can say that lugging 80 pounds on your back for dozens of miles is way draining. Carrying 300 on your back is just unrealistic. These weights are heavy, but doable, for both genders. And obviously, you may raise it via levels. \r\n\r\nIn any case, I intend to expand this section more when I actually know how. I would like to make equipped weapons weigh 60% less than carried weapons as well as limit the amount of items that a character can carry. What I mean is that I would like to set it up so that your character may only carry the armor he/she is wearing as well as ONE other piece of each armor type: boots, helmet, gauntlets, cuirass, shield. I would also like to set it up so that a character may only carry ONE two-handed weapon as well as ONE one-handed weapon, ONE dagger, and ONE bow. I would also like to place a ceiling on the amount of ingredients and potions that a character can carry. All in due time, however. If anybody knows how to dynamically re-weight a weapon (I assume with scripts, but cannot find the right function), please do let me know :)\r\n\r\n[b]VI. Installation + Uninstallation[/b]\r\n\r\nFor right now there are two different install procedures depending on the character you\\'d like to make the lore-friendly changes to.\r\n\r\nOn Existing Character:\r\n\r\nVery easy. If manually installing (what I do), just copy the .esp into your Skyrim\\\\Data folder and the two scripts into your Data\\\\Scripts folder. The install will run when you first load up your game and will make the changes. You will get a message saying \\\"You are a [Gender] [Race]!\\\" upon successful install. Save you game and go adventuring.\r\n\r\nOn New Character:\r\n\r\nPlace the .esp and scripts into your Data folder like in the above example, but un-check the mod to load before loading up Skyrim. Go through your character selection procedure and then save at your first opportunity (preferably before entering Helgen dungeon). Then check the mod in your mod loader and reload your save. You will then receive the modified stats upon game load. Currently working on adding an item that you can use to toggle this, but for now this is a working workaround.\r\n\r\nTo Uninstall:\r\n\r\nBring up the developer\\'s console by using the tilde (\\\"~\\\") button on your keyboard. Then type \\\"help lore\\\" and you will see the Quest ID for \\\"Lore-Friendly Stats Undo.\\\" Then type \\\"Setstage [QUEST ID] 0\\\" and it will undo the Lore-Friendly changes. Upon successful uninstall, you will see \\\"Lore-Friendly Stats Uninstalled!\\\" You may then save your game and proceed as if nothing had ever happened.\r\n\r\nRemove the .esp and the scripts from your Data and Data\\\\Scripts folder. \r\n\r\nSha-bam, you are done!\r\n\r\n[b]VII. Credits + Thanks[/b]\r\n\r\nBig thanks to nycz for his \\\"More Realistic Carrying\\\" mod which served as the inspiration for this mod. \r\n\r\nAlso to ekroemer for his \\\"EK_LimitedItems\\\" mod which contains some functionality that I would like to work toward and expand upon in this mod.",
  "categoryId": "24",
  "version": "1.20",
  "author": "Sukeban",
  "createdUnix": "1336788364",
  "updatedUnix": "1337114417",
  "containsAdultContent": false,
  "uploadedBy": "sukeban",
  "primaryFile": null,
  "files": [
    {
      "fileId": "61098",
      "name": "LFSSAE -- Expanded Statistics Edition",
      "version": "1.10",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "66",
      "fileName": "LFSSAE -- Expanded Statistics Edition-16901-1-10.7z",
      "uploadedUnix": "1336938936",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/58642e65704fbb8be47922c03e3a4333f271d0e35b2e7d72f5895520cab8e4e0/analysis/1406890203/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LFSSAE%20--%20Expanded%20Statistics%20Edition-16901-1-10.7z?fid=61098&ttl=1535782624&ri=8192&rs=8192&setec=d46822a6c04dca8c8813f4e44fbd9dce"
    },
    {
      "fileId": "61549",
      "name": "LFSSAE -- Expanded Statistics Edition Version 1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "LFSSAE -- Expanded Statistics Edition Version 1_2-16901-1-2.7z",
      "uploadedUnix": "1337114417",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/10400ebf0716b5b4bfcc597263bfc1d0869ba0d4062a889fe7446c39011cc466/analysis/1406895063/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LFSSAE%20--%20Expanded%20Statistics%20Edition%20Version%201_2-16901-1-2.7z?fid=61549&ttl=1535782625&ri=8192&rs=8192&setec=b01a74d6f7ef9f25d595617b8107762e"
    }
  ]
}