{
  "modId": 16912.0,
  "modName": "Celebriton - ARTISTIC SPARKLING VISUAL 1j - ENB113 RLwC",
  "summary": "Using latest ENB v0.112 KAGE. Featured Clear Vivid Sparkling image style, SSAO, Bokeh DoF, HD6&#39;s Post Processing, Detailed Shadow, Sharpening (optional), Glossy Body, etc. Available both High Quality and Performance option. There are also Optional setting for LED TV to take advantages LED TV picture quality over the plain PC monitor.",
  "descriptionHtml": "Celebriton&#39;s\r<br />ARTISTIC SPARKLING VISUAL\r<br />ENB 113 setting\r<br />\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=16912\r<br />\r<br />PS: Try playing using LED TV or Original calibration as possible. Actually, this ENB mod specially made for LED TV or PC Monitor with Video/TV mode.\r<br />\r<br />\r<br />********************************\r<br />\r<br />[url=http://www.flickr.com/photos/44121327@N03/7370926150/][img]http://farm6.staticflickr.com/5330/7370926150_157848afcd_z.jpg[/img][/url]\r<br />[url=http://www.flickr.com/photos/44121327@N03/7370926150/]New Sky - Dusk[/url] by [url=http://www.flickr.com/people/44121327@N03/]Celebriton[/url], on Flickr\r<br />\r<br />NEW SKY FEATURES in version 1i:\r<br />\r<br />It&#39;s not the ENB&#39;s sky&#33; that most people see it in any ENB mods.\r<br />Sky that feel emitting light and blooming.\r<br />Detailed clouds texture with right transparency that perfectly blended in with the blue-reddish background of sky.\r<br />Perfect rain and snow sky, with sunlight lurking between the dark clouds.\r<br />Perfect reddish dusk and dawn transition with blinding sunset and sunrise.\r<br />Colorful starry night that designed to be used together with galaxy or stars mods.\r<br />ENB 113 sunrays&#33; with powerful maximum effect, combined with amazing colorful sunglare.\r<br />\r<br />\r<br />********************************\r<br />\r<br />\r<br />RECENT NEWS\r<br />\r<br />June 25, 2012\r<br />Uploaded Mystical Natural Visual Preview 1.\r<br />\r<br />After gaining a lot of experience and knowledge. Understanding the theories of ENB and realistic natural lighting. I created a new ENB mod that is more &#34;right and proper&#34;, no extreme heavy path like Artistic Sparkling Visual. Basically it mildly enhanced, to preserve the well-build graphic by Bethesda, but enhanced to make it look awesome thru ENB. So everything, from the day, night, dusk, dawn, fog, rain, snow, interior and dungeon, everything will look proper and right, with no &#34;distortions, broken and anomalies&#34; in other ENB that took extreme heavy path.\r<br />\r<br />I choose the name Mystical Natural Visual, because of these consideration:\r<br />Mystical: It look a bit of Mystical because I use a bit high bloom. Combined with exterior natural fog, and the way mountain and sky blended in naturally, create a &#34;Mystical&#34; feeling and look.......well, short off. You must see it by yourself.\r<br />Natural: It means, I took natural mild path when enhancing this ENB, as I explained above, to preserve the well-build graphic by Bethesda. Unlike, the previous Artistic Sparkling Visual, where I use my own vision in the brain, then enforcing the config to fulfilling the vision. This time, I put the config as first priority and then push it as far as it can go, without destroying the config, that produced many &#34;distortions, broken and anomalies&#34; here and there, that most users probably didn&#39;t aware.\r<br />\r<br />This is a complete new ENB, a pure ENB, with no additional esp mod required. But you can still add your favorite visual mod, like Real Rain, More Dynamic Shadow, Remove Ambient Interior Fog, etc for example. It doesn&#39;t need Dark Dungeon for ENB too, because I can manage to make darker dungeon thru pure ENB.\r<br />\r<br />For monitor calibration. It more forgiving, it was build using my original calibration, but look best on LED TV (standard mode).\r<br />\r<br />This is still a preview. I can say 95% complete, but still need more further testing to discover any wrong things. If it finished, I&#39;m planning to create a new thread for it. For now, I just put it here.\r<br />\r<br />I hope people will like it. \r<br />\r<br />\r<br />June 22, 2012\r<br />Uploaded version 1j PC Monitor (Preview 2).\r<br />\r<br />Recalibrate the interior and dungeon. I darkened the interior a lot and smoothing the dungeon contrast. I also darkening the bright night a bit. You can see the screenshot below:\r<br />\r<br />[url=http://www.flickr.com/photos/44121327@N03/7415032082/][img]http://farm8.staticflickr.com/7272/7415032082_3128b80830.jpg[/img][/url]\r<br />[url=http://www.flickr.com/photos/44121327@N03/7415032082/]Inside Dungeon - Ysolda[/url] by [url=http://www.flickr.com/people/44121327@N03/]Celebriton[/url], on Flickr\r<br />\r<br />[url=http://www.flickr.com/photos/44121327@N03/7415031830/][img]http://farm8.staticflickr.com/7248/7415031830_c189384390.jpg[/img][/url]\r<br />[url=http://www.flickr.com/photos/44121327@N03/7415031830/]Interior - Food on Table[/url] by [url=http://www.flickr.com/people/44121327@N03/]Celebriton[/url], on Flickr\r<br />\r<br />\r<br />June 21, 2012\r<br />Uploaded version 1j PC Monitor (Preview 1).\r<br />\r<br />ATTENTION: I use Pixel Format: Studio Limited RGB, and I insist that you use it too when playing Skyrim with my ENB mod for PC Monitor. I notice Limited RGB have better color and smoother contrast than the Full RGB. Limited RGB also look better in other games as well. Full RGB has a very serious problem with the ugly black mud for dark area. You can change the Pixel Format from your nVidia/ATi control panel.\r<br />\r<br />I reworked again the PC Monitor calibration. I think, this time is perfect, as you can see the screenshot below. I love it&#33;&#33;&#33; What you see here now, is what you get. As long as it has the same brightness and contrast when you view the screenshot below and when you play Skyrim. Still need more time for testing.\r<br />\r<br />[url=http://www.flickr.com/photos/44121327@N03/7408644180/][img]http://farm9.staticflickr.com/8006/7408644180_bee50064ce.jpg[/img][/url]\r<br />[url=http://www.flickr.com/photos/44121327@N03/7408644180/]Riverwood - Daylight[/url] by [url=http://www.flickr.com/people/44121327@N03/]Celebriton[/url], on Flickr\r<br />\r<br />\r<br />I also reworked the night, to be brighter. I made it to anticipate the Dawnguard DLC, playing as a vampire and spend most of the time during night. So I brighten it to make it easier to play during night. I still need your comments about it, I fear may be it&#39;s a bit too bright.\r<br />\r<br />[url=http://www.flickr.com/photos/44121327@N03/7408643554/][img]http://farm8.staticflickr.com/7107/7408643554_36876ace13.jpg[/img][/url]\r<br />[url=http://www.flickr.com/photos/44121327@N03/7408643554/]Morthal Swamp - Night[/url] by [url=http://www.flickr.com/people/44121327@N03/]Celebriton[/url], on Flickr\r<br />\r<br />I also made some changes in interior and dungeon, to make it less bright. I haven&#39;t finish edit it, that is why I upload it as a preview. I still need your comments about it.\r<br />\r<br />\r<br />********************************\r<br />\r<br />INTRODUCTION\r<br />\r<br />This is my personal ENB setting based on my own taste, and I want to share it with everyone. If you ever use ENB setting like Realistic Skyrim HD, Superb-RL, Sharpshooter&#39;s Extreme Graphic Vision , you will notice a similar style. Clear vivid color, strong light, and high contrast. Yes, I like this kind of style very much.\r<br />\r<br />I started to edit ENB setting because of my personal quest to fix Black Fog problem that plagued many ENB mods out there. In the middle of the processes, I rethink why don&#39;t I just create an ENB setting that I like. And here it is&#33;\r<br />\r<br />My aim is not creating a photo realistic ENB, but instead a very good looking ENB as possible with my limited knowledge and skills. With all good looking effects available. Although I still depend on some realistic rules, like very bright sunlight, almost pitch black night, dark dungeon, etc.\r<br />\r<br />I&#39;m sorry for a bit rough low quality screenshot. It was taken using my old low spec PC. If you captured a very high quality screenshot, please be free to upload it. I hugely appreciate it.\r<br />\r<br />\r<br />********************************\r<br />\r<br />FEATURES:\r<br />\r<br />Recalibrate to ENB 112\r<br />This ENB made for the first time for ENB 102, but later upgraded to ENB 110 and 111. Recalibrated to suit ENB 111 new lighting configuration and activated ENB 111&#39;s detailed shadow feature.\r<br />\r<br />Clear Vivid Color\r<br />My ENB setting doesn&#39;t use any color palette, like brownish rustic color for example. The color is crystal clear as what it is, with some boast to make it more vivid.\r<br />\r<br />Sparkling Strong Light\r<br />Strong light is the main feature of my ENB setting. I purposely create it that way, so strong to produce a bit of sparkling effect. Strong light combined with vivid color create amazing image as you can see in the screenshots.\r<br />\r<br />Artistic Contrast\r<br />I purposely adjusted the contrast a bit higher. Higher contrast combined with vivid color make the image bolder. The interior and dungeon, combined with Further Dark Dungeon and More Dynamic Shadows mods, carefully adjusted to maximize the artistic light-shadow effect.\r<br />\r<br />No Black Fog\r<br />My first quest is to fix Black Fog problem, as the result, this ENB free from any Black Fog during snow, rain and foggy day. This eye candy weather effect even look more amazing with ENB and Sparkling Clear Light.\r<br />(PS: ENB 111 destroyed a bit the fog effect in the game, with some anomaly.)\r<br />\r<br />Amazing Sky\r<br />Both in the day light and night, the sky probably the best looking part in the game.\r<br />\r<br />Reddish Dusk and Dawn\r<br />Seeing the sunset and sunup in Skyrim with reddish sunlight lurking behind the cloud and mountain, that is the amazing moment I want to bring it here.\r<br />\r<br />Strong Big Sunglare\r<br />Forget realistic sunglare, I like very strong big sunglare effect with some colorful eyecandy effect. Combined with reddish sunlight, it makes dusk and dawn look very beautiful.\r<br />\r<br />Matso&#39;s latest Bokeh Deep of Field\r<br />I&#39;m hugely falling in love with Bokeh, a must have feature&#33; I remove the grainy effect to make a crystal clear Bokeh DoF effect.\r<br />\r<br />Almost consistence body glossiness\r<br />Glossy body combined with ENB 111&#39;s detailed shadow, makes the character more 3D and rounded. Carefully adjusted to make almost consistence or stable glossy look, in outdoor and indoor, day and night. that doesn&#39;t make the world look wet too. (More glossiness available in Optional)\r<br />\r<br />\r<br />********************************\r<br />\r<br />INSTALLATION:\r<br />\r<br />Open the RAR file. Extract all files in the folder &#34;Main Files&#34; to your Skyrim installation folder, where TESV.exe file located. Replace all when asked. Make sure the folder structure intact with the &#34;Data&#34; folder.\r<br />\r<br />\r<br />OPTIONS:\r<br />\r<br />If my ENB make the game run very slow, you can switch to low quality preset. Just replace the files with the provided ones. In the RAR file, you can find two presets:\r<br />\r<br />- High Quality HQ &lt;-- Default\r<br />(Slow SSAO + HQ Bloom + HQ sharpening + Extreme Detailed Shadow + Complex Indirect Lighting)\r<br />\r<br />- Low Quality LQ\r<br />(Fast SSAO + LQ Bloom + LQ sharpening + Medium Detailed Shadow + Indirect Lighting)\r<br />\r<br />You won&#39;t see much different between two. Both have the same image style and characteristic. But High Quality have slightly improvement over the Low Quality. The light has a bit more volume, the sharpening effect look better and detailed shadow more sharp. But it doesn&#39;t mean Low Quality is a bad left-behind. I use it for playing everyday because my PC is not strong enough. I guarantee Low Quality look great too.\r<br />\r<br />\r<br />CONFIGURING SKYRIMPREFS.INI\r<br />\r<br />If haven&#39;t configure your skyrimprefs.ini before, make sure this parameters are there:\r<br />\r<br />bFloatPointRenderTarget=1\r<br />bDoHighDynamicRange=1\r<br />bUseBlurShader=1\r<br />\r<br />I highly recommended to find configured skyrimprefs.ini made by some experts in Skyrim Nexus, to maximize your GPU potential.\r<br />\r<br />\r<br />********************************\r<br />\r<br />MUST INSTALLED MODS:\r<br />\r<br />This mods below, must be installed and enabled. I set the Artistic Sparkling Visual based on these mods. Without them, it will be crippled with strange inappropriate anomalies.\r<br />\r<br />Imaginator\r<br />I strongly recommended to increase the sunlight one to three level (I use one), to give a bit of sunlight during the rain, snow and fog, since they lack of sunlight. It add a bit more contrast and also make overall image look very beautiful.\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=13049\r<br />\r<br />WATER - Water And Terrain Enhancement Redux\r<br />There are several water mod out there, but I use WATER by OpticShooter.\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=13268\r<br />\r<br />Further Dark Dungeon for ENB\r<br />It made the dungeon to use night setting, a big help for ENB modder to make dungeon look perfect. My ENB dungeon setting are based on this.\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=12454\r<br />\r<br />More Dynamic Shadows and Striping Fixed\r<br />It change a lot of lights in indoor and dungeon. From vanilla boring light into dynamic shadow light. You should see the shadow effect on the wall and floor, it&#39;s impressive. My ENB setting is made based on this too.\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=8262\r<br />\r<br />Sunglare\r<br />Included in the RAR file.\r<br />(I forget the name, creator and link of this sunglare. I already search it for a week. If someone know him, please inform me&#33; I will include it for a sample now, but once I know the name, I will remove it from the rar and move it to highly recommended mod.)\r<br />\r<br />Dramatic Clouds\r<br />Best Clouds texture so far. You should see it for yourself&#33;\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=4910\r<br />\r<br />Torch of Everlasting with Dynamic Shadows\r<br />The best torch mod so far&#33; It came with many options too choose, from light brightness, light distance radius, light color, to dynamic shadow. The dynamic shadow feature didn&#39;t work after patch 1.5.26.\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=4764\r<br />\r<br />HIGHLY RECOMMENDED MODS:\r<br />\r<br />Highly recommended mods can be installed or not. But I highly recommended to installed for better experience, you won&#39;t regret it.\r<br />\r<br />Revamped Exterior Fog\r<br />At the outdoor, there are a thin fog that makes objects and mountain at far away, a bit smoky and less vivid. This mod remove that thin fog and makes outdoor look very vibrant.\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=9930\r<br />\r<br />Remove Ambient Internal Fog\r<br />The same with above exterior fog, but it&#39;s for indoor. Indoor room and dungeon look very vibrant now.\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=9571\r<br />\r<br />More Snow\r<br />My ENB setting free from Black Fog problem. So why don&#39;t use mods to enchance the effect to the maximum. I recommend More Snow. It came with many options, from snow density to the fog thickness. I use maximum setting to get a blizzard&#33;\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=8328\r<br />\r<br />More Rain\r<br />More Rain came from the same creator of More Snow, but this time for rain. It also came with many option, including the wind effect. I use the maximum setting as usual, for the tropical rain storm&#33;\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=8562\r<br />\r<br />Standalone SMAA\r<br />For the best Anti-Aliasing.\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=16233\r<br />\r<br />Parallax Texture\r<br />Did you know that ENB since version 108 above support Parallax? It will make the texture a more in depth look and feel. Technology awareness people, don&#39;t need to think twice, grab it now&#33;\r<br />\r<br />\r<br />LOAD ORDER\r<br />\r<br />Use Nexus Mod Manager (http://skyrim.nexusmods.com/content/modmanager/) to organize the load order, this is my load order:\r<br />\r<br />RealisticLighting.esp\r<br />RealisticLightingPatch .esp\r<br />Further Dark Dungeons For ENB.exp\r<br />More Dynamic Shadows.esp\r<br />RemoveAmbientInteriorFog.esp\r<br />RevampedExteriorFog.esp\r<br />MoreRainWindy66percent.esp\r<br />MoreSnowWindyand150percentLessView.esp\r<br />WATER.esp\r<br />WATER - Get Wet.esp\r<br />IMAGINATOR - Visual Control for Skyrim.esp\r<br />Torch of Everlasting - Warm Edition (2x Radius - Default Brightness).esp\r<br />\r<br />Please correct me if I&#39;m wrong. Make sure the mods are at the most bottom of the load order list, to make sure no unwanted interference from the other mods. \r<br />\r<br />\r<br />********************************\r<br />\r<br />UPDATE HISTORY\r<br />\r<br />2012 06 21\r<br />Uploaded v1j Preview for PC Monitor\r<br />Reworked the PC Monitor calibration\r<br />Brighten the night\r<br />Darken the interior and dungeon\r<br />\r<br />2012 06 01\r<br />Recalibrate the interior for More Dynamic Shadow v2.9.\r<br />\r<br />2012 06 01\r<br />Updated to ENB 113\r<br />Released version 1i for LED TV and original.\r<br />New sky technique for 1i\r<br />\r<br />2012 05 31\r<br />Released version 1hb Original calibration.\r<br />Released version 1hb for LED TV.\r<br />\r<br />2012 05 30\r<br />Released the version 1hb Preview 1 for PC monitor.\r<br />And Preview 2 as technical demo of the new sky technique.\r<br />\r<br />2012 05 28\r<br />Perfected the calibration between for the TV and LED TV.\r<br />Increased the sunlight brightness a bit.\r<br />\r<br />2012 05 21 (version 1g 112)\r<br />Updated to latest ENB 112 (May 18, 2012)\r<br />Reworked the sky.\r<br />And some minor tweaks..\r<br />\r<br />2012 05 18 (version 1f 111)\r<br />Updated to latest ENB 111 (May 16, 2012).\r<br />Add a little bit glossiness to the body.\r<br />Activated Complex Indirect Lighting (Indirect Lighting for LQ).\r<br />\r<br />2012 05 15 (version 1e 111)\r<br />Updated to ENB 111 (May 15, 2012).\r<br />Fixed the corrupted interior setting.\r<br />\r<br />2012 05 14 (version 1d 110)\r<br />Back again to ENB 110. (I learned some ENB 110 characteristic)\r<br />Recalibrating to ENB 110 (this time is right&#33;).\r<br />Readjusting many things, especially the sky and background mountain.\r<br />\r<br />2012 05 13 (version 1c 102)\r<br />Back again to ENB 102.\r<br />I notice ENB 110 downgrade the lighting, my ENB setting lost the sparkling charm. So I return to ENB 102.\r<br />\r<br />2012 05 13 (version 1b 110)\r<br />Recalibrating the interior and dungeon for ENB 110 KAGE.\r<br />\r<br />2012 05 12 (version 1a 110)\r<br />Updated to ENB 110 KAGE.\r<br />Fixed green-water-bug and grass-line-bug-thing. Thank you to RememberBuilding7.\r<br />\r<br />2012 05 12 (version 1 102)\r<br />First upload. :D\r<br />\r<br />\r<br />********************************\r<br />\r<br />PERMISSION\r<br />\r<br />Well, I&#39;m a free and tolerance person.\r<br />You can do whatever you want with my ENB setting. Modify it, take some codes, get inspired from, etc.\r<br />But don&#39;t forget to give a credit to me, and may be to inform me too, if you like, so I can see your awesome creation too.\r<br />\r<br />\r<br />********************************\r<br />\r<br />CREDIT\r<br />\r<br />Boris Vorontsov for the ENB, special big thank you for him.\r<br />Realistic Lighting with Customization team for the RLwC.\r<br />HD6 for his amazing enbeffect.fx.\r<br />Matso for Bokeh DoF.\r<br />The creators of Skyrim Enhanced Shaders FX (my first), Realistic Skyrim HD, Superb-RL, Sharpshooter&#39;s Extreme Graphic Vision and Stakado Realistic and Cinematic ENB. I used this ENB settings in the past and get a lot of inspiration from them.\r<br />Kyokushinoyama, for his advice and support. ",
  "categoryId": "62",
  "version": "1j",
  "author": "Celebriton",
  "createdUnix": "1336813928",
  "updatedUnix": "1341046391",
  "containsAdultContent": false,
  "uploadedBy": "celebriton",
  "primaryFile": null,
  "files": [
    {
      "fileId": "60722",
      "name": "CELEBRITON Artistic Sparkling Visual ENB v1",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1814",
      "fileName": "CELEBRITON Artistic Sparkling Visual ENB v1-16912.rar",
      "uploadedUnix": "1336821497",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0c62e51d626b50e31bdd562a741d52232b9777ecd527a2313a8375ce1f9208a1/analysis/1406886851/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CELEBRITON%20Artistic%20Sparkling%20Visual%20ENB%20v1-16912.rar?fid=60722&ttl=1535782641&ri=8192&rs=8192&setec=18dcfc443188e1a21c21ca4ba343f981"
    },
    {
      "fileId": "62739",
      "name": "Optional - Sharpening",
      "version": "1g",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5",
      "fileName": "Optional - Sharpening-16912.rar",
      "uploadedUnix": "1337588148",
      "modVersion": "1g",
      "virusScanUrl": "https://www.virustotal.com/file/d060f333e3f04db34fb4dcdb91db9f9cf5c71ce4ff6ec4644ddc7a5e82b5e792/analysis/1406906703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Optional%20-%20Sharpening-16912.rar?fid=62739&ttl=1535782641&ri=8192&rs=8192&setec=cc7d961028073e1eff390ad0734a5244"
    },
    {
      "fileId": "64515",
      "name": "Artistic Sparkling Visual - v1hb Preview 2 - for PC Monitor",
      "version": "1hb",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1304",
      "fileName": "Artistic Sparkling Visual - v1hb Preview 2 - for PC Monitor-16912.rar",
      "uploadedUnix": "1338355166",
      "modVersion": "1hb",
      "virusScanUrl": "https://www.virustotal.com/file/1bb005943c56a9e7c12f860f1734c966fecec5c5ca5b3634e6bf22eb98254eda/analysis/1406924824/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Artistic%20Sparkling%20Visual%20-%20v1hb%20Preview%202%20-%20for%20PC%20Monitor-16912.rar?fid=64515&ttl=1535782642&ri=8192&rs=8192&setec=5a461ae9fbcb34557791ab79bb71a0f0"
    },
    {
      "fileId": "64516",
      "name": "Artistic Sparkling Visual - v1hb Preview 1 - for PC Monitor",
      "version": "1hb",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1304",
      "fileName": "Artistic Sparkling Visual - v1hb Preview 1 - for PC Monitor-16912.rar",
      "uploadedUnix": "1338355791",
      "modVersion": "1hb",
      "virusScanUrl": "https://www.virustotal.com/file/8ae9dc59d52059b9d8d8eea9d9bc9fcd7ec01cf71ea9d0b14150f505c052980e/analysis/1406924826/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Artistic%20Sparkling%20Visual%20-%20v1hb%20Preview%201%20-%20for%20PC%20Monitor-16912.rar?fid=64516&ttl=1535782642&ri=8192&rs=8192&setec=ddea05abca00f8ddb6b18127ab251af7"
    },
    {
      "fileId": "64606",
      "name": "Artistic Sparkling Visual - v1hb - for LED TV",
      "version": "1hb",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1309",
      "fileName": "Artistic Sparkling Visual - v1hb - for LED TV-16912.rar",
      "uploadedUnix": "1338393011",
      "modVersion": "1hb",
      "virusScanUrl": "https://www.virustotal.com/file/cdbc7177629420dc5490353db51955d54c79705a5d439be11cbe2dbb0a17abd9/analysis/1406925665/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Artistic%20Sparkling%20Visual%20-%20v1hb%20-%20for%20LED%20TV-16912.rar?fid=64606&ttl=1535782643&ri=8192&rs=8192&setec=bcb839d604e0a07c0a3079103f562d01"
    },
    {
      "fileId": "64610",
      "name": "Artistic Sparkling Visual - v1hb - Original",
      "version": "1hb",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1310",
      "fileName": "Artistic Sparkling Visual - v1hb - Original-16912.rar",
      "uploadedUnix": "1338393878",
      "modVersion": "1hb",
      "virusScanUrl": "https://www.virustotal.com/file/efbee049e4e71b155b323341871b8468499f8543bfe09d72300fda00ac32eb6f/analysis/1406925732/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Artistic%20Sparkling%20Visual%20-%20v1hb%20-%20Original-16912.rar?fid=64610&ttl=1535782643&ri=8192&rs=8192&setec=05e0e3aa08a18bdcff7dd833f32152df"
    },
    {
      "fileId": "64775",
      "name": "Artistic Sparkling Visual - v1i - for LED TV",
      "version": "1i",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1310",
      "fileName": "Artistic Sparkling Visual - v1i - for LED TV-16912.rar",
      "uploadedUnix": "1338462126",
      "modVersion": "1i",
      "virusScanUrl": "https://www.virustotal.com/file/06e3140c6365519105d5adf536a66dd57183db45a36a236eeaac616c0c6d9641/analysis/1406927464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Artistic%20Sparkling%20Visual%20-%20v1i%20-%20for%20LED%20TV-16912.rar?fid=64775&ttl=1535782644&ri=8192&rs=8192&setec=1d1128fa9c99737bba64ce736f2667c9"
    },
    {
      "fileId": "64776",
      "name": "Artistic Sparkling Visual - v1i - Original",
      "version": "1i",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1310",
      "fileName": "Artistic Sparkling Visual - v1i - Original-16912.rar",
      "uploadedUnix": "1338462234",
      "modVersion": "1i",
      "virusScanUrl": "https://www.virustotal.com/file/57d18005ceb9e50b2a27ad7845baca7bd8a4a4f166c49075b9daf1f58699ef4d/analysis/1406927467/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Artistic%20Sparkling%20Visual%20-%20v1i%20-%20Original-16912.rar?fid=64776&ttl=1535782644&ri=8192&rs=8192&setec=dcdf1c22c6a380a3f322da00db65606c"
    },
    {
      "fileId": "65018",
      "name": "Artistic Sparkling Visual - v1i - for PC Monitor 1 - New Sky",
      "version": "1i",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1310",
      "fileName": "Artistic Sparkling Visual - v1i - for PC Monitor 1 - New Sky-16912.rar",
      "uploadedUnix": "1338526922",
      "modVersion": "1i",
      "virusScanUrl": "https://www.virustotal.com/file/a6c852ad2cc55c4785d8e63090007de157c23132a8971575dd7eb8e74d8b194e/analysis/1406929153/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Artistic%20Sparkling%20Visual%20-%20v1i%20-%20for%20PC%20Monitor%201%20-%20New%20Sky-16912.rar?fid=65018&ttl=1535782644&ri=8192&rs=8192&setec=7f0cb1be1dce306594c6325a38ce0cec"
    },
    {
      "fileId": "65019",
      "name": "Artistic Sparkling Visual - v1i - for PC Monitor 2 - Old Sky",
      "version": "1i",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1310",
      "fileName": "Artistic Sparkling Visual - v1i - for PC Monitor 2 - Old Sky-16912.rar",
      "uploadedUnix": "1338527392",
      "modVersion": "1i",
      "virusScanUrl": "https://www.virustotal.com/file/ecca9fe049bc68894af692ef99232c930cb85c1504c231f2b0a81062c9763071/analysis/1406929155/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Artistic%20Sparkling%20Visual%20-%20v1i%20-%20for%20PC%20Monitor%202%20-%20Old%20Sky-16912.rar?fid=65019&ttl=1535782645&ri=8192&rs=8192&setec=d78e7334949742316ba1c26729f35d7f"
    },
    {
      "fileId": "65878",
      "name": "Artistic Sparkling Visual - v1ia - for LED TV",
      "version": "1ia",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1310",
      "fileName": "Artistic Sparkling Visual - v1ia - for LED TV-16912-1ia.rar",
      "uploadedUnix": "1338822647",
      "modVersion": "1ia",
      "virusScanUrl": "https://www.virustotal.com/file/1f905227bf395dea115b05cca87ca7d6441a21a2ad5babf352fff947dda02b61/analysis/1406937543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Artistic%20Sparkling%20Visual%20-%20v1ia%20-%20for%20LED%20TV-16912-1ia.rar?fid=65878&ttl=1535782645&ri=8192&rs=8192&setec=aca651a08e5b55a8fcc96736121800ff"
    },
    {
      "fileId": "65880",
      "name": "Artistic Sparkling Visual - v1ia - Original",
      "version": "1ia",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1310",
      "fileName": "Artistic Sparkling Visual - v1ia - Original-16912-1ia.rar",
      "uploadedUnix": "1338822832",
      "modVersion": "1ia",
      "virusScanUrl": "https://www.virustotal.com/file/5014586e1f6a5f81948e0ba859a2b2ad7afb0f410d8bac6516b4bca213ac92ae/analysis/1406937546/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Artistic%20Sparkling%20Visual%20-%20v1ia%20-%20Original-16912-1ia.rar?fid=65880&ttl=1535782646&ri=8192&rs=8192&setec=75e2639b1508685c37ce7981070e9f4a"
    },
    {
      "fileId": "65882",
      "name": "Artistic Sparkling Visual - v1ia - for PC Monitor",
      "version": "1ia",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1310",
      "fileName": "Artistic Sparkling Visual - v1ia - for PC Monitor 1 - New Sky-16912-1ia.rar",
      "uploadedUnix": "1338823394",
      "modVersion": "1ia",
      "virusScanUrl": "https://www.virustotal.com/file/e460676aec146abefba5dc0d9e8097751eccc26f2a07bf2bec736ea32075b9b9/analysis/1406937605/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Artistic%20Sparkling%20Visual%20-%20v1ia%20-%20for%20PC%20Monitor%201%20-%20New%20Sky-16912-1ia.rar?fid=65882&ttl=1535782646&ri=8192&rs=8192&setec=d91dce8ce7b95d498f0422ef1a73301d"
    },
    {
      "fileId": "69430",
      "name": "Artistic Sparkling Visual - v1j - for PC Monitor - Preview 2",
      "version": "1j",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1806",
      "fileName": "Artistic Sparkling Visual - v1j - for PC Monitor - Preview 2-16912-1j.rar",
      "uploadedUnix": "1340299274",
      "modVersion": "1j",
      "virusScanUrl": "https://www.virustotal.com/file/8f1d2d01708f73d69af24ecb4661b16eef9f69e1fba515e4f088d132e0dac39c/analysis/1406973845/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Artistic%20Sparkling%20Visual%20-%20v1j%20-%20for%20PC%20Monitor%20-%20Preview%202-16912-1j.rar?fid=69430&ttl=1535782647&ri=8192&rs=8192&setec=665ea500325235dc6e64229be9f2566c"
    },
    {
      "fileId": "71216",
      "name": "Mystical Natural Visual - Preview 2",
      "version": "Prev2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31",
      "fileName": "Mystical Natural Visual - Preview 2-16912-Prev2.rar",
      "uploadedUnix": "1341046391",
      "modVersion": "Prev2",
      "virusScanUrl": "https://www.virustotal.com/file/091e5b7e3a8cba744a343e8c4d9f0ca57fc616c3380c7a55e19d89e931a1f419/analysis/1406991902/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mystical%20Natural%20Visual%20-%20Preview%202-16912-Prev2.rar?fid=71216&ttl=1535782647&ri=8192&rs=8192&setec=8102d4a26e0c4b23c39a24b78dc0ad23"
    }
  ]
}