{
  "modId": 16942.0,
  "modName": "Leveling Perks Original",
  "summary": "Now available on the Nexus by popular request.\r\nPerks level up with you. Rather than constantly dumping perks into the bottom of the tree, most lower level perks will level up with your skills all the way to 100.",
  "descriptionHtml": "Put simply: Perks level up with you. Rather than constantly dumping perks into the bottom of the tree, most lower level perks will level up with your skills all the way to 100. This keeps the early perks from being overpowered, while freeing up more room to spread some perks around, and often making in more rewarding to reach level 100 of a skill. I made this because I had 5 or so perk mods and still wasn\\'t getting everything I wanted from them. There are some other changes throughout like the ability to place up to five runes at level 100 destruction if you have the rune master perk. Detailed list of all changes below. If I don\\'t mention a perk, I didn\\'t alter it, and if I say something like \\\"up to\\\" that means you reach that ability at very high levels of the applicable skill, typically 100. Reccomended for new and low-level characters. Higher level players will need to use console commands if they wish to regain perk points used up on now useless perks, but the latest update has removed effects of unused perks, making it much easier to import a higher level character without becoming instantly overpowered.\r\n\r\nNow available in \\\"Lite.\\\" Vanilla perk effects only, automatically grants advanced perks after buying the base perk and reaching the required level. \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=16943\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=15390\r\n\r\nArchery:\r\nOverdraw - Bows do up to 100% more damage.\r\n\r\nCritical Shot - Critical chance = 1/3 your archery skill, critical damage scales\r\n\r\nSteady Hand - zooming slows time by up to 75%\r\n\r\nHunter\\'s Discipline - Recover up to 80% of arrows\r\n\r\nBlock:\r\nShield Wall - Blocking is up to twice as effective\r\n\r\nQuick Reflexes - Removes requirement to be blocking when power-attack starts\r\n\r\nElemental Protection - Reduces elemental damage by up to 70%\r\n\r\nDeadly bash - Scales up to 10x bash damage\r\n\r\nHeavy Armor:\r\nJuggernaut - Scales up to +100% armor ranking\r\n\r\nOne-Handed:\r\nArmsman - Attacks do up to 100% more damage\r\n\r\nFighting stance - Power atack stamina reduced by up to 75%\r\n\r\nHack and Slash - Will automatically scale through old ranks when levels are reached\r\n\r\nBonebreaker - Scales to ignore up to 100% of armor\r\n\r\nBladesman- Critical change and damage scale, up to 25% change and 200% damage\r\n\r\nDual Flurry - Scales up to increase speed\r\n\r\nTwo-Handed:\r\nBarbarian - Attacks do up to 100% more damage\r\n\r\nChampion\\'s Stance - Power attacks cost up to 70% less stamina\r\n\r\nLimbsplitter- Automatically moves through old ranks after purchasing first perk\r\n\r\nDeep Wounds- Up to 25% change of doing up to 200% Critical Damage\r\n\r\nSkullcrusher - Warhammers ignore up to 100% of armor\r\n\r\nSmithing:\r\nSteel Smithing - name changed to Basic Smithing - Adds Iron and leather items to tempering bonus.\r\n\r\nSmithing tree has full wraparound, every perk can be learned after learning the one above or below it.\r\n\r\nBonus of 30% to tempering upon reaching 100 (hidden perk, doesn\\'t need to be bought)\r\n\r\nAlteration:\r\nNovice Alteration - Scales cheaper novice spells, up to free\r\n\r\nApprentice Alteration - Scales cheaper apprentice spells, up to free\r\n\r\nMage Armor - Exact effects of previous perks, but automatically scales up when you reach that level.\r\n\r\nMagic Resistance -Exact effects of previous perks, but automatically scales up when you reach that level.\r\n\r\nAdept Alteration - Starts the same, cost drops to 25% at level 100\r\n\r\nStability - Spells last up to twice as long\r\n\r\nConjuration:\r\nNovice Conjuration -Scales cheaper novice spells, up to free\r\n\r\nApprentice Conjuration - Scales cheaper apprentice spells, up to free\r\n\r\nSummoner - Scales up to 4X distance\r\n\r\nNecromancy - Now scales up to triple duration\r\n\r\nAtromancy - Now scales up to triple duration\r\n\r\nAdept Conjuration - Starts the same, cost drops to 25% at level 100\r\n\r\nTwin Souls- Now called Kindred Souls, grants up to 4 atronachs/reanimated dead. Becomes accessible at level 80.\r\n\r\nDestruction:\r\nNovice Destruction -Scales cheaper novice spells, up to free\r\n\r\nApprentice Destruction - Scales cheaper apprentice spells, up to free\r\n\r\nAugmented Flames, Frost, Shock - Scale up to double damage\r\n\r\nRune Master - Place runes up to ten times farther away and place up to 5 runes\r\n\r\nAdept Destruction - Starts the same, cost drops to 25% at level 100\r\n\r\nIllusion:\r\nNovice Illusion -Scales cheaper novice spells, up to free\r\n\r\nAnimage - Scales up levels\r\n\r\nApprentice Illusion - Scales cheaper apprentice spells, up to free\r\n\r\nHypnotic Gaze - Scales up levels\r\n\r\nKindred Mage - Scales up levels\r\n\r\nAdept Illusion -Starts the same, cost drops to 25% at level 100\r\n\r\nAspect of Terror - Scales up levels\r\n\r\nRestoration:\r\nNovice Restoration - Scales cheaper novice spells, up to free\r\n\r\nRegeneration- Scales up to double\r\n\r\nApprentice Restoration - Scales cheaper apprentice spells, up to free\r\n\r\nRecovery - Magicka regenerates up to twice as fast\r\n\r\nAdept Restoration - Starts the same, cost drops to 25% at level 100\r\n\r\nWard Absorb- Scales up to absorb all incoming spells\r\n\r\nEnchanting:\r\nEnchanter- Scales up to double enchantment strength\r\n\r\nFire, Frost, Storm Enchanter - New single Elemental Enchanter perk, all of these scale\r\n\r\nExtra Effect - Now allows 3 effects\r\n\r\nAlchemy:\r\nAlchemist - Potions are up to 100% stronger\r\n\r\nPhysician - Restorative potions are up to 100% stronger\r\n\r\nPoisoner - Poisons are up to 100% stronger\r\n\r\nBenefactor - Beneficial potions are up to 100% stronger\r\n\r\nExperimenter - Learn up to 4 effects from eating an ingredient\r\n\r\nConcentrated Poison - Poisons last for up to 5 hits\r\n\r\nLight Armor:\r\nAgile Defender - Scales up to 100% higher armor rating\r\n\r\nLockpicking:\r\nNovice Locks - Novice sweet spot gets progressively bigger\r\n\r\nApprentice Locks - Apprentice sweet spot gets progressively bigger\r\n\r\nAdept Locks - Adept sweet spot gets progressively bigger\r\n\r\nPickpocket:\r\nLight Fingers - Up to double pickpocket chance\r\n\r\nSneak:\r\nStealth - Up to 50% harder to detect while sneaking\r\n\r\nDeadly Aim - Sneak attacks with bows do extra damage (scales from 6-12x)\r\n\r\nSpeech:\r\nHaggling - Scales up to 40% better prices\r\n\r\nMaster Trader - Merchants now gain 2000 gold\r\n\r\nEverything I tested is working, but there\\'s a lot here, so I didn\\'t get to all of it. If you notice any bugs please notify me. Feel free to make suggestions. If I like it and it\\'s possible, I\\'m willing to keep tweaking.",
  "categoryId": "73",
  "version": "",
  "author": "Matope",
  "createdUnix": "1336856182",
  "updatedUnix": "1336951427",
  "containsAdultContent": false,
  "uploadedBy": "jaredsh2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "61136",
      "name": "Leveling Perks",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "40",
      "fileName": "Leveling Perks-16942-1.zip",
      "uploadedUnix": "1336951427",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/731f24e0c30ff5198920254877144ce2f4a49ba52db238db801101ed24265ef0/analysis/1406890569/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Leveling%20Perks-16942-1.zip?fid=61136&ttl=1535782686&ri=8192&rs=8192&setec=cd1669976546838b0d65cc16c932e6dc"
    }
  ]
}