{
  "modId": 16962.0,
  "modName": "memory lost champion of the divines -Epic start-",
  "summary": "this currently allows you to start out side of helgen with just imperial armor and a amulet of extream enchanting and smithing. you are lvl 100 with 1000 hp 500 mag 250 stam and 500 carry weight and all perks, spells, and dragon shouts  ulocked (not learned thats up to you).but currently under production is making a whole expansion pack for the gam",
  "descriptionHtml": "You find yourself waking up in a wagon no memory of what happened or for that matter anything at all about your life. The only thing you have to go off of your old life is a amulet around your neck, a vast knowledge of weaponry, and a strange language running through our head. but as you escape your captures and a dragon. you find you know more than your original thoughts.\r\n\r\nThis allows you to start out side of helgen with just imperial armor and a amulet of extreme enchanting and smithing. You are lvl 100 with 1000 hp, 500 mag, 250 stam, and 500 carry weight and all perks, spells, and dragon shouts unlocked (not learned that’s up to you).\r\n\r\ndue to my partner leaving im going extreamly slow and haven\\'t got much done of late when it comes to meshes and textes all im missing is a helmet a door all but one of the 6 bosses (or 7 with the little contact we have between a team of now about 6 or 7 counting the consoltants and peaple helping toss ideas around we are still arguing on another boss or 2) and the minor minon who i will not be moved off of making but wont mind surgestions for a name change(currently imp)\r\n seeing as the missing partner has about 2ce as much meshes as i have listed the mod snt going anywhere this month this last week ive gone chapter by chapter and gotten new improvments in but its at the point where i ccant mve on much with out my partner or someone new to help make animations and meshes currently i can make all but 2 dungeons and all but 2 boss rooms which will most likly be done at end of 2 weeks but as of now unless  can get help dont expect it this month and actually if its not done by end of summer which right now is a 50 50 i wont be releasing it till after the offical expansion goes live so i can add crossbows (i tried already and relized after a day of work why try when bethesda is going to do it any way) so dont go bashing or crying over my passed posts and be patiant or help make the mod we will except you with open arms\r\n\r\n\r\nLink to full mod (beta): tba\r\n\r\n\r\n\r\n___news___(of the beta)\r\n\r\nCurrent planned release date: 7/?/12   (Subject to change)\r\n\r\nremoved first 100 lines on this section to lower the lamount or reading on this page\r\nadded light and dark element to the equation (thus extension on time)\r\nmade invisible wall so ou cant go past x bondrys\r\nfixed bug with lava ground\r\nadded new pah ways to the textures and meshes to make editing eaysier and faster\r\nfixed bug where if you step on lava you cant get off\r\nmade female lava armor\r\nmade male and female water armor - helm nifskope says its to big so i need to fin a diffrent way in\r\nmade male and female earth armor - head mesh is messing up left and right\r\nmde ne higher res lava armor\r\ntesting is finally over and althoug we have hit break through after break through on this mod i\\'m puching i back another 2 weeks to releive sress on me and partner\r\nLost account info so sorry I haven’t posted news of late\r\nfixed lava in fire temple not dealing damage\r\nbalrog scipts added\r\nFixed the floor bug when using graphics upgrades \r\nChanged wind boss to a spiritual dragon working on him personally now\r\nBalrog was not high res enough so we put him back through meshing should be out this weekend \r\nRemoved the thought of beta because no one bothered so we are just taking the five we got and passing the file around (if you want to test what we got post a comment)\r\nLava armor now mostly supported for females.\r\n\r\n\r\n_Instillation-IMPORTANT PLZ READ_\r\nto install \r\n1.extract somewhere any were really\r\n2.rename to what you want your character to be\r\n3.move file to your save game bin (normally stored at (my documents/my games/skyrim/saves))\r\n4.enter game and walk forward until you see alduin fly over head and the person next to you stops talking type \r\ntgm\r\nthen\r\nshowracemenu\r\ninto your console and edit the character to  how you want them to look\r\n5.enjoy\r\nNote: seeing a message saying things have been removed is normal just hit yes and move one it only happens once\r\n\r\n\r\nplease report any problems\r\n\r\n\r\nThings i may do to make it a actual mod\r\nadd unique items(Done)\r\nadd enemies and a rival who know your past.(later)\r\nmake a new armor and weapon set for the character(done done done done not done)\r\nmake a alternate start point(done)\r\n\r\ncredits\r\ndudeguy1070 for making a bat file to make the amulet",
  "categoryId": "40",
  "version": "1.0e",
  "author": "Sorydrew",
  "createdUnix": "1336881206",
  "updatedUnix": "1336881346",
  "containsAdultContent": false,
  "uploadedBy": "Sorydrew",
  "primaryFile": null,
  "files": [
    {
      "fileId": "60906",
      "name": "Epicstart",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1194",
      "fileName": "Epicstart-16962-1-0.rar",
      "uploadedUnix": "1336881346",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8d548a7fc8aa779b25cba8373164e78ef34fb035bd53f9a3a549e68eaf8de444/analysis/1406888523/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Epicstart-16962-1-0.rar?fid=60906&ttl=1535782711&ri=8192&rs=8192&setec=a2203a855b81a0fabd60cc78382ecc9f"
    }
  ]
}