{
  "modId": 16971.0,
  "modName": "Werewolf Affinity",
  "summary": "A multi-tiered werewolf overhaul, making Beast Form more useful - and influential - as you use it.",
  "descriptionHtml": "[img]http://skyrim.nexusmods.com/imageshare/images/483451-1336891980.png[/img]\r\n\r\nWerewolf Affinity is a flexible, gameplay-focused werewolf overhaul.  When initialized it has only minor changes compared to standard werewolves, but using Beast Form abilities allows the curse to assert itself more and more.  This results in a more useful Beast Form, but turns your option to feed on corpses into an increasingly-strong need.  By managing your affinity, lycanthropy can play as large or as small a part in a character as you prefer.\r\n\r\n\r\n=================================\r\nInstallation/Uninstallation\r\n=================================\r\nRequires: A program capable of unpacking .rar files.\r\n\r\nExtract WerewolfAffinity.rar to your Skyrim/Data folder, select \\'Data Files\\' from the Skyrim launcher and check the box beside WerewolfAffinity.esp.\r\n\r\nTo uninstall this plugin, just uncheck it from the Data Files section of Skyrim\\'s launcher.  Do NOT uninstall this plugin while in Beast Form, or while werewolves you have infected are in Beast Form.\r\n\r\n\r\n===============\r\nAffinity\r\n===============\r\nDepending on your affinity, there are five different types of werewolf you can be.\r\n     Type 1 Werewolf: 0-19% affinity.  Similar to standard lycanthropy.  You can enter Beast Form once a day for a limited time, and extend that time by feeding on human/elf corpses.  You do, however, have access to the new Beast Form abilities.\r\n\r\n     Type 2 Werewolf: 20-39% affinity.  You can still only enter Beast Form once a day, but you can enter Beast Form faster and remain in it for as short or long a time as you wish.  However, if you exit Beast Form before feeding you will suffer stat penalties for a day, or until you feed.  You can interact with the world normally (except for lockpicking and crafting, which remain off-limits) in Beast Form, and regain some health regeneration.\r\n \r\n     Type 3 Werewolf: 40-59% affinity.  You can enter and exit Beast Form freely and regenerate some more health, but will suffer hunger effects if you go 36 hours without feeding.  From Type 3 on, hunger effects are not just stat penalties, but include an hourly chance of going berserk and attacking the first potential meal you see.\r\n  \r\n    Type 4 Werewolf: 60-79% affinity.  You can summon up to three previously-infected werewolves with your howl and your regeneration continues to increase, but you will suffer hunger effects if you go a day without feeding.\r\n\r\n\tType 5 Werewolf: 80-100% affinity.  Your Beast Form is undetectable when moving slowly in darkness and you regenerate still faster, but will suffer hunger effects if you go 12 hours without feeding.\r\n\r\nYour affinity changes in the following ways:\r\n+1% affinity for entering Beast Form.\r\n+3% affinity for every hour spent in Beast Form.\r\n+5% affinity for howling or feeding.\r\n-1% affinity for every two hours spent outside of Beast Form.\r\n\r\nThus, if a day goes by where you spend an hour in Beast Form and feed once, you would have a net -2% change in affinity.  If you howled once as well, that would go up to a +3% change.  As you can see, it\\'s much easier to increase your affinity than decrease it, especially once feeding becomes more important.\r\n\r\n\r\n================\r\nAbilities\r\n================\r\nWerewolf Affinity adds three Lesser Powers for standard use.  The standard Beast Form scripts have been reworked to enable the menus without messing up play, so they can be accessed through hotkeys or the Magic menu.\r\n\r\n     Werewolf Bite: Deals damage based on your level and can turn equal- or lower-level targets into werewolves.  Dextrous players can use it as a third \\'hand\\' for their melee attacks.  The infection takes a full day to sink in.\r\n \r\n    Werewolf Howl: Frightens people similarly to the standard Howl of Fear, and forces any nearby werewolves you have infected into Beast Form.  If you are a Type 4 werewolf or higher, you can call up to three of the highest-level werewolves you have infected from anywhere in Skyrim.  Any werewolves you force into Beast Form will go back to their day-to-day life when you exit Beast Form, or leave the area.  If you want your summonable pack-mates to follow you into a different area, you will need to howl again.\r\n \r\n    Werewolf Senses: Toggles a Detect Life effect, and a dynamic Night Eye that will toggle itself on and off based on the available lighting.  The threshold for how much darkness is needed to enable Night Eye can be changed via console.\r\n\r\n\r\n====================\r\nMiscellaneous\r\n====================\r\n     Changed the werewolf attack and impact sound effects.  They\\'re still forceful and wolfish, but it does away with the constant *GROAR*SPLOTCH* of standard werewolves.\r\n\r\n     Forward Power Attacks no longer knock opponents down, and sprinting attacks now deal less damage.  Sprinting attacks still knock opponents down, as do backhand attacks (both hands at once).\r\n\r\n     Werewolves now have a leveled Resistance to Damage effect to go along with their Fortify Unarmed Damage effect.\r\n \r\n    Since multiple transformations are no longer necessary, the Ring of Hircine instead holds your affinity constant and allows you to change it to whatever you want.\r\n \r\n    Since the howls\\' old effects have migrated to Lesser Powers, the Totems of Hircine now provide passive buffs.  The Totem of Fear (default) increases your Stamina regeneration, the Totem of the Hunt increases unarmed damage and the Totem of Brotherhood increases the number of pack-mates you can summon by 2 (so 5 at Type 4+, and just the two below that).\r\n\r\n     Your items will now be automatically re-equipped upon exiting Beast Form.  Thanks to the Nexus\\' Korodic and CobraxXx, whose scripts I more-or-less lifted wholesale to accomplish this.\r\n \r\n    Non-Beast Form werewolves now get along reasonably with their Beast Form kin, as well as other wolves.\r\n\r\n\r\n=======================\r\nConsole Commands\r\n=======================\r\nSet WerewolfAffinity to X: Changes your affinity to X, a number between 0 and 100.  Note that your werewolf type will not actually update until the game would normally increment your affinity, such as when you enter Beast Form.\r\n \r\n    Set WerewolfAffinityTutorials to 0: Disables the tutorial messageboxes that crop up during play.  They don\\'t say anything that this description doesn\\'t, but they can be useful reminders and help you understand the visual effects.\r\n \r\n    Set WerewolfAffinityThirdPerson to 1: Stops Werewolf Affinity from automatically putting you back in first-person mode when you exit Beast Form.\r\n \r\n    Set WerewolfAffinityReequip to 0: Stops Werewolf Affinity from re-equipping all of your items when you exit Beast Form.\r\n \r\n    Set WerewolfAffinityNightEyeThreshold to X: Changes the light level (0-100) required for Werewolf Senses\\' dynamic Night Eye to activate, with lower numbers meaning darker areas.  Defaults to 15.  At 0, the Night Eye effect is disabled entirely.\r\n \r\n    Set WerewolfAffinityInfectedChat to 1: Lets any werewolves you infect use their normal dialogues while in Beast Form.\r\n  \r\n   Set WerewolfAffinityInfectedCivilized to 0: Causes any werewolves you infect to hate other Beast Form werewolves until they\\'re forced into Beast Form.  Stopping them from attacking you requires one to permanently replace their crime faction, so there is a good reason you may not want to let this plugin mess around so heavily.\r\n  \r\n   Set WerewolfAffinityUniquePackmates to 0: Prevents unique werewolves you infect from being added to your summonable pack, so you can only draw pack-mates from bandits and other such people.  During testing unique actors had some behavior problems when summoned into your pack.  It should all be running smoothly now, but better safe than sorry.\r\n\r\n\r\n================================\r\nKnown Bugs/Compatibility\r\n================================\r\n-This mod will conflict with any mod that changes the Beast Form race stats, the werewolf feed perk, the Beast Form Power, the Werewolf Faction or the Player Werewolf Quest.\r\n -This mod does not fix the Beast Form killcam bugs, so you may still occasionally experience graphical awkwardness when finishing an enemy off.    \r\n\r\n=================\r\nThanks To\r\n=================\r\n-Bethesda Softworks for the game, the modding tools, the modding wiki, the fishy-sticks, etc.\r\n  -[url=http://skyrim.nexusmods.com/modules/members/index.php?id=360983]Korodic[/url] and his partner-in-scripting [url=http://skyrim.nexusmods.com/modules/members/index.php?id=3122624]CobraxXx[/url], who kindly sent me and walked me through the scripts from their [url=http://skyrim.nexusmods.com/downloads/file.php?id=13905]Werewolf Aftermath Re-Equipper[/url] so I could rip it off.\r\n\r\n\r\n=================\r\nChangelog\r\n=================\r\nV1.0: May 13, 2012\r\n-Initial release.",
  "categoryId": "24",
  "version": "v1.0",
  "author": "LoginToDownload",
  "createdUnix": "1336890653",
  "updatedUnix": "1336890711",
  "containsAdultContent": false,
  "uploadedBy": "LoginToDownload",
  "primaryFile": null,
  "files": [
    {
      "fileId": "60923",
      "name": "WerewolfAffinity10",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "118",
      "fileName": "WerewolfAffinity10-16971-v1-0.rar",
      "uploadedUnix": "1336890711",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8abfb4914800d49240d6f39add6c7ac90a60f6b184d15f01112dd74ddce94621/analysis/1406888717/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WerewolfAffinity10-16971-v1-0.rar?fid=60923&ttl=1535782730&ri=8192&rs=8192&setec=e735d9f9bf7f1568ac0d8dd60013c7c7"
    }
  ]
}