{
  "modId": 17001.0,
  "modName": "TF TRO Resturant Bundle Patch",
  "summary": "This is a patch ment for the alchohol overhaul and Wolferoo\\'s recipes for total realism basic needs mod. Among other things ^_^",
  "descriptionHtml": "-after all this time i forgot to thank all the authors O_O-\r\n\r\nMansh00ter because well what will skyrim be without his need mod?\r\nWolferoo for his awsome food\r\nSharaniskhan for making drinking that sooo much funner in skyrim\r\nscot for making some seperated default soups instead of one same soup texture\r\nliv2die8 making a crap load of various soups and stews and...and cassaroles?\r\nhookerheel changing the pot and default soup textures into a yummy looking stew\r\nlast becuase I felt it neccesary Wolf-of-the-Azar becuase I frickin love the dawgs...not as much as ze catz ;3\r\n\r\nPlease endorse their stuff as it is awsome!\r\n\r\n==Newsflash!==\r\n\r\nGot it working and I\\'ll share, please follow the step by step guide.\r\n\r\n1. Download the list of 4 things below include both on number 4\r\n\r\n2. install them in data folder on your skyrim directory. All soup textures must be in the| skyrim/data/textures/clutter/RareGame |directory.\r\n\r\n3. enable those mods via nexus modmanager or wyrebash must be those two preferably wyre bash. \r\n\r\n4. load your game and head to a nearby tavern/bar that sells food and drink like the Bannered Mare in Whiterun. stand in front of the door and save then enter it after and loo at the food stuff on sell buying is not neccessary just proving a point.\r\n\r\n5. Ok, disable all of the mods i mention and leave my mod standing ((before the other modders eat me up please endorse their stuff cuase i did it becuase i liked it so i combined them abit T_T)) so basically the stuf in my mod file EXCEPT the cannibal one, that one still not ready.\r\n\r\n6. Ensure that my mod is at the bottom of the list for load order and load your game enter you tavern resturant and order food. TA-DA! meshes/texture for new soups might need fixing but i\\'ll do that soon. Just need to ensure the path is right in creation kit simple as that. thank you for waiting and trying it.\r\n\r\n7. This one ticks me off, You\\'ll need the creation kit and load Skyrim.esm, Update.esm, both TRO_BasicNeeds.esm & esp, and set my tf-tro basic bundle.esp as active and for these foods i tried to add you\\'ll need to remind the game its mesh path which blows me away, it\\'s not repeatitive i think. and can be found in magic ((simply highlit magic with a click and sort by editor id.)) \r\n\r\n((all are .nif are in raregame folder))\r\n1. aaaabeefbean = BlackBeanSoup.nif\r\n2. aaaaFoodcheesecassarole = PatatoSoup.nif\r\n3. aaaaFoodchickennoodle = Minastone.nif\r\n4. aaaaFoodginger = CarrotGinger.nif\r\n5. aaaanoodle = Roman.nif\r\n6. aaatomherb = RedPepper.nif\r\n7. aaameatnoodle = BeanNoodle.nif\r\n8. aaaHotchili = RedMeatSoup.nif\r\n((again sorry for making you guys do this hope it was worth it cause this is my first))\r\n\r\n\r\n*\r\n\r\n-if this works i\\'ll work on food poisoning immunity on beast races bosmer ((green pact followers only)) and orcs...normal defualt civil races will have to wait\r\n\r\n-Update #2- I have made eola sell now and not hurt her ai path but still included the older esp just in case ((be sure to save before entering thejarl\\'s palace in markarth, chose one or the other NOT both eps and check esm-\r\n Also fixed a effect problem in which cooked meat ((not raw)working on that)) should carry its normal tro effect\r\n\r\nFirst and foremost be sure to thank everyone who made the mods below and endorse them for making the patch hopefully epically awsome.\r\n\r\nDescription: This is a patch ment for the alchohol overhaul and Wolferoo\\'s recipes for total realism basic needs mod. Among other things ^_^. So far its under the testing stage and will require a the main mods/textures and/or meshes to work properly.\r\n\r\n((remember to thank and endorse their nice stuff))\r\nThorough Explained installation: download the total realism mode here\r\n\r\n1: http://skyrim.nexusmods.com/downloads/file.php?id=10843 \r\n\r\nAll woferoo\\'s recipes except the simple recipes at \r\n\r\n2: http://skyrim.nexusmods.com/downloads/file.php?id=1368  \r\n\r\nThe alcohol overhaul from\r\n\r\n3: http://skyrim.nexusmods.com/downloads/file.php?id=13696 \r\n\r\nThe soup textures here  \r\n\r\n4: http://skyrim.nexusmods.com/downloads/file.php?id=12118 \r\n& \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6107 \r\n\r\nManually placing the LAST texture textures in the followed path looking like: skyrim/data/textures/clutter/RareGame . and for the alternative soup textures thats required to prevent invisable soups and add more realistic variety and optionally download this:\r\n\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=13808 for the beef stew since its missing as well + the puke soup texture is gross\r\n\r\nroundup repeat: \r\n1: Wolfs mod installed but NOT checked ((not yet anyways)) in nmm \r\n2. AWSOME ALCAHOL OVERHAUL MOD Installed but not checked in nmm\r\n3. install the tree soup textures the rare game in the clutter folder as a secured secondary location \r\n4. Am i missing anything else? Oh yeah un check the tro esp i made an esm instead\r\n5. fiddle the load order and if the last two ESP go behind or before my esp\r\n6. Drag the esm on the bottom of the esm list in nmm\r\n7. drag the esp ((mine)) at the bottom list making sure not one esp is beneath it in nmm\r\n\r\nHopefully i\\'ll get it right not bad for my first mod / patch yay me! \r\n\r\nside-note changed the goat roast to an ox leg roast to look different from the lavender leg and other \\\"ambitious\\\" tweaks \r\n\r\nFuture mod & tweak intentions:\r\n\r\n1. Shop furnishes at player homes ((so you can actually make it look shopish sign included))\r\n2. Proper soup eating animations ((where did the bread comefrom lol wheres my beef stew o_o))\r\n3. wolfs cannibalistic and mushroom food sold at the bar at namira\\'s shrine and purchasable accessory like ring/circlet/amulet for those not of orc or beast race ((yeah i went there and done that >89 nyomnomnomnom))\r\n4. Khajiit/Argonian, Orcs & \\\"native\\\" Bosmer ((meaning they follow the Green Pact in rp if your character goes that way : http://www.uesp.net/wiki/Lore:Green_Pact )) will eat raw food without harm as default. Maybe the Vaalsark race too, if i\\'m motivated: found here http://skyrim.nexusmods.com/downloads/file.php?id=13561 ... that being said the other races must be willing to complete the taste of death  and buy an amulet from eola if it works til then be patient and no nagging.\r\n5. I see a online version mod but not a PRIVATE online version just for you and friends maybe at the end i\\'ll work on that and share my own version of a password protected private server version.\r\n6. 2x lute songs, 2x drum plays & a maybe a flute theme for battle flutes mod\r\n\r\nPost anything wrong just don\\'t complain that it doesn\\'t work please be detailed its not supposed to work perfectly yet and its only sold at inns for resturant food",
  "categoryId": "84",
  "version": "1.3.test",
  "author": "tigerfrenzy",
  "createdUnix": "1336940482",
  "updatedUnix": "1351624497",
  "containsAdultContent": false,
  "uploadedBy": "tigerfrenzy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "96710",
      "name": "Tz Tro Resturant Stuff",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Tz Tro Resturant Stuff-17001-1-5.zip",
      "uploadedUnix": "1351624497",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/cdb8922c6a4db0738dafee0f4700b3d584af1dc6de787ad3120503e1d5f6a069/analysis/1407242657/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tz%20Tro%20Resturant%20Stuff-17001-1-5.zip?fid=96710&ttl=1535782785&ri=8192&rs=8192&setec=6e7376933603c9511a3933cc05753c4e"
    }
  ]
}