{
  "modId": 17036.0,
  "modName": "Lotr Nazgul Race Beta",
  "summary": "Adds the playable race of the Nazgul to the game. \r\nThis a beta version for all of the lotr and skyrim fans to test, and give some background about the mod in order for me to improve it. ",
  "descriptionHtml": "Lotr Nazgul Race Beta Update2\r\n\r\nNew Features:\r\n\r\nCraftable Morgul Blade in Whiterun at the Skyforge on the \r\nSteel craftable weapons.\r\nThe Morgul Blade comes with an enchantment that does \r\n300 points of damage and if the character dies it will soul\r\ntrap the victim and turn it into a ghost figure in this \r\ncase a Wraith that will be your slave for one day.\r\nThe blade only has the power for one strike; so if the \r\ncharacter is more powerfull you will need to recharge\r\nthe Morgul Blade and hit i\\'m untill it dies in order to\r\nbecome a wraith.\r\nTo fully recharge the Morgul Blade you will need a filled\r\nGrand Soul Gem or a Black Soul Gem or Azura\\'s Star or it\\'s\r\nblack version.\r\n\r\nCraftable Spell Tome that adds a Spell to Summon your Nazgul\r\nHorse at the Skyforge in Whiterun in the Misc section.\r\n\r\nChanges since the last update:\r\n\r\nChanged the Black Breath Spell into a power that you can use\r\nonce a day that creates a poison cloak that damages your\r\nopponents 50 points for 60 seconds.\r\n\r\nChanged the Detect life and the Detect death Spells into\r\none; so now you can detect both the living and the dead at\r\nthe same time.\r\n\r\nDeleted the NightStalker\\'s Footsteps Spell and the Champion\r\nof the Night because i think they didn\\'t fitted well with\r\nthe Nazgul lore of lotr.\r\n\r\n\r\nIMPORTANT: For this update you must have the Dwanguard Dlc.\r\n\r\n\r\nINSTALL: Just place the Data folder into your skyrim folder\r\nand overwritte the old files. \r\n\r\nNazgul Race Beta Mod\r\n\r\nThis mod is for all the Lotr and Skyrim fans; and adds the\r\nnazgul race to Skyrim.\r\nThis mod is a Beta and is for you to test and give me\r\nbackground about the mod.\r\nSo if you tested the mod go on ahead and add a comment to \r\nthe mod page and tell me what you thoutght about the mod.\r\n\r\n\r\nDescription of the Nazgul Race:\r\n\r\nSkill Bonus\r\n\r\nDestruction - 10\r\n\r\nIllusion - 10\r\n\r\nLight Armor - 5\r\n\r\nOne Handed - 5\r\n\r\nTwo Handed - 5\r\n\r\n\r\n\r\nSpecials\r\n\r\n\r\nNazgul Ability - Gives you 100% resistance to Frost and \r\nPoison.\r\n\r\nResist Disease - Gives you 100% resistance to disease.\r\n\r\nNazgul Night Eye - Gives you Night Vision for 60 sec.\r\n\r\nNazgul Magic Protection - Absorbs 50% of the magicka from \r\nhostile spells for 60 sec.\r\n\r\nChampion of the Night - Illusion spells cast by a Nazgul \r\nare 25% more powerful.\r\n\r\nNazgul Fear - Creatures and people up to level 28 flee \r\nfrom combat for 30 sec.\r\n\r\nNazgul Detect Life\r\n\r\nNazgul Detect Dead\r\n\r\nNazgul Black Breath - Absorbs 25 points of Stamina, Health\r\nand Magicka per second from the target.\r\n\r\nNightstalker\\'s Footsteps - Nazgul are 25% Harder to detect\r\nwhen sneaking.\r\n\r\nWeakness to Fire - Gives you 100% Weakness to Fire.\r\n\r\n\r\nNazgul Gear:\r\n\r\nDaedric Boots\r\n\r\nDaedric Gauntlets\r\n\r\nNazgul Hooded Black Robes (Doesn\\'t show the face of your \r\ncharacter).\r\n\r\nRing of Men - Increases your Magicka by 70 points.\r\nMagicka regenerates 100% faster.\r\n\r\nThe Nazgul Gear is located in Helgen in the Warden\\'s chest.\r\nAt the beginning of the game you have to follow Hadvar the\r\nimperial soldier to the helgen Keep. Inside of the room\r\nyou enter is the Warden\\'s chest where your gear is located.\r\n\r\nNazgul Horse - Your Nazgul Horse is located at the exit \r\nof the cave in Helgen.\r\n\r\nDescription of the aspect of the Race:\r\n\r\nSince i started this mod i\\'ve tried several things to make\r\nthe race look more like the Nazgul from lotr.\r\nI\\'ve tried to make the race invisible; but when i put the \r\ngear on the Character it also makes it invisible so i \r\ncouldn\\'t give them the aspect of the nazgul with robes.\r\nI\\'ve tried also making them look like a Ghost; but also\r\nwhen i equipped the character, the gear would also have\r\nthe ghostly effect.\r\nSo i\\'ve come up with the idea of giving them the look \r\nof the Wraiths at Weathertop when frodo puts the ring and\r\ngets stabed by the morgul Blade.\r\nSo i\\'ve made them look old and White skinned with long hair\r\nand demon eyes.\r\nI also gave the race the voice of the Draug to give it a \r\nmore evil feeling.\r\n\r\nDescription of the Gear:\r\n\r\nThe gear i\\'ve put in the mod are the daedric boots and \r\ngauntlets because i think are the ones that look more \r\nlike the ones that the nazgul add in the movies.\r\nThe Robes are the same as the black hooded ones in the game\r\nbut with the twist that it does not make the face of the \r\ncharacter visible, making them look more like the ones from\r\nthe Nazgul.\r\nI\\'ve tried to make a standalone version of the greybeards\r\nrobes in black without messing with the vanilla ones, i \r\nchanged the textures of the robe and the hood to black\r\nand manage to make the robe Black but the hood staid \r\nwith the same color of the vanilla version and i tried a lot  \r\nof stuff but it didn\\'t work out; and so not to delay the \r\nmod too much i made with the normal black hooded robes of\r\nthe vanilla skyrim.\r\n\r\nThe Ring i added to the gear represents the one that sauron \r\ngave each men making them the nazgul.\r\nI called it the Ring of Men and gave it a powerfull\r\nenchantment that combines the most powerfull fortify\r\nmagicka and regenerate magicka from the game.\r\n\r\nI didn\\'t add the sword or the morgul blade because there \r\nare already mods that add craftable versions of nazgul \r\nweapons, and so that is one of the things you will have to \r\ndo to make your Nazgul more authentic.\r\n\r\nDescription of the Powers:\r\n\r\nNazgul Ability:\r\n\r\nThis power adds the nazgul 100% resistance to Frost and \r\npoison. \r\n\r\nI gave this power to the race because when i read about the\r\nnazgul there where several references about them being\r\nresistant to cold, and being a wraith they couldn\\'t be \r\npoisened.\r\n\r\nResist Disease:\r\n\r\nI gave the race also this power because of the nature of\r\nthe nazgul of being a wraith they wouldn\\'t have diseases.\r\n\r\nNazgul Night Eye:\r\n\r\nThis one is just to give the feeling of the vision of the\r\nnazgul and granting them a better vision in the dark.\r\n\r\nNazgul Magic Protection:\r\n\r\nI gave this one because i read that the nazgul had \r\nresistance to magic but not all and some of the magic \r\nweapons in lotr affected the Nazgul.\r\n\r\n\r\nChampion of the Night:\r\n\r\nThis one is to give more power to the nazgul when casting\r\nillusion spells.\r\n\r\nNazgul Fear:\r\n\r\nThis one is because the greatest power of the Nazgul was\r\nfear and it has the same power of the most powerfull fear\r\nspell in the game.\r\n\r\nNazgul Detect Life and Dead:\r\n\r\nI added this power because the nazgul could sense living \r\nthings and being undead they could sense each other \r\nand other undead.\r\n\r\nNazgul Black Breath:\r\n\r\nThis power is similar to the Drain Life spell from the \r\nVampires but a little more powerfull.\r\nI added the black breath with the same effects beacause\r\nit sucks life from your opponents and adds the similar \r\neffect that it add in the lotr lore.\r\n\r\n\r\nNightstalker\\'s Footsteps:\r\n\r\nI gave this one because in some way the nazgul seemed to\r\nbe always sneaking when looking for the Ring.\r\n\r\nWeakness to fire:\r\n\r\nObviously this is the most disadvantage feature of your \r\ncharacter and applies to the lotr lore.\r\n \r\n\r\nFuture plans for the mod:\r\n\r\nAdding the other eight nazgul to the mod either as \r\nsummonable or has a follower.\r\n\r\nAdding summon spell for your horse.\r\n\r\nAdding better robes and gear.\r\n\r\nAdding the real nazgul Voice.\r\n\r\nAdding severall sugestions from the comments.\r\n\r\nThanks for reading! If you like my idea go on ahead and \r\ntest the mod and feel free to comment and give ideas to\r\nthe mod. \r\n\r\nInstallation:\r\n\r\nJust copy the NazgulRace.esp file to your Skyrim Data Folder and  activate it  in the data files menu or in the mod mannager launcher.\r\n\r\nNazgul Greybeards Update\r\n\r\nThis Mod Update adds BlackGreyBeards Robes that you can\r\nfind in the Warden\\'s Chest in Helgen where the Previous\r\nNazgul Gear Was found. You can also craft them in a tanning \r\nrack; and there is an enchanted version that you can craft\r\nat the Skyforge in Whiterun.\r\n\r\nI Changed the Fear spell and added craftable spelltomes\r\nof more powerfull versions for you to create has you \r\nget more powerfull in the game. \r\nI Changed this feature in order to make the game more \r\nchallenging for you and give you the feeling that you \r\nget more powerfull has you progress.\r\n\r\nI Added a craftable spelltome that gives you a spell to \r\nsummon the other eight nazgul but just for 60 sec; in order\r\nto make you have a power but not a great advandage over the\r\ngame.\r\n\r\nI Changed the fire weakness to 50% and the frost resistance\r\nto 50%.\r\n\r\nThe Spells have the nazgul screech sound to give your \r\npowers a nazgul feel.\r\n\r\n\r\nI completed the female version just to give it a more \r\ncomplete look.\r\n\r\nImportante: The Black Greybeards replace the vanilla ones \r\nin the Game.\r\n\r\nI Hope you enjoy the new update; and don\\'t forget to \r\ncomment and give feedback.\r\n\r\nTo install just place the files in you skyrim data folder\r\nand overwritte the old ones.\r\n\r\n\r\n\r\n  \r\n \r\n",
  "categoryId": "34",
  "version": "",
  "author": "Sergeynest",
  "createdUnix": "1336998143",
  "updatedUnix": "1344955309",
  "containsAdultContent": false,
  "uploadedBy": "Sergeynest",
  "primaryFile": null,
  "files": [
    {
      "fileId": "61249",
      "name": "Nazgul Race Beta",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2908",
      "fileName": "Nazgul Race Beta-17036-1.rar",
      "uploadedUnix": "1336998267",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7f92b82286fa914b253ccf0d300f48296f43772a7780acd55a7e9466209e994b/analysis/1406891830/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nazgul%20Race%20Beta-17036-1.rar?fid=61249&ttl=1535782838&ri=8192&rs=8192&setec=95c1fd1bfec04f7148f938c9179f3cb8"
    },
    {
      "fileId": "61460",
      "name": "Nazgul Race Update1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4543",
      "fileName": "Nazgul Race Update1-17036-1.rar",
      "uploadedUnix": "1337087521",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/a7d39e28db8b75f34f1056a695e8ff2d1a479be00894338b7b14edd52a7a870e/analysis/1406894044/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nazgul%20Race%20Update1-17036-1.rar?fid=61460&ttl=1535782838&ri=8192&rs=8192&setec=c3b366e28d249126e2e10ba969825c4e"
    },
    {
      "fileId": "65422",
      "name": "Nazgul Greybeards Update",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5037",
      "fileName": "Nazgul Greybeards Update-17036-1.rar",
      "uploadedUnix": "1338656010",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/504307c7180df8ea5b243ab314b942f988f89be4b86130e28781dde2b9b52861/analysis/1406932535/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nazgul%20Greybeards%20Update-17036-1.rar?fid=65422&ttl=1535782839&ri=8192&rs=8192&setec=bc16e01c66b50a046440763109801c63"
    },
    {
      "fileId": "81536",
      "name": "Nazgul Race Beta Update2",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6800",
      "fileName": "Nazgul Race Beta Update2-17036-2.rar",
      "uploadedUnix": "1344955309",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/da5866e5ca7637e8665ef1d05fc1bc630a582e5d6a86b60a9b4c934750becdf3/analysis/1407096196/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nazgul%20Race%20Beta%20Update2-17036-2.rar?fid=81536&ttl=1535782839&ri=8192&rs=8192&setec=8d177675537befdb4477674ba71b26bf"
    }
  ]
}