{
  "modId": 17069.0,
  "modName": "The Crafting Manual",
  "summary": "Lazgar Morn, a legendary crafter, has had his manual stolen and is willing to show whoever gets it for him some of his old secrets",
  "descriptionHtml": "Lazgar Morn was born a poor orc boy.  As all orcs are, he was taught to smith.  He stood out as a great smith from a young age.  Soon smiting wasn’t enough for him and he turned to alchemy and enchanting.  As his skills grew, he became too good to learn anything from living in the stronghold.  He crafted himself a mace and headed to Markarth.  He shaped silver there until one day when he was contacted by a guild.  They revealed themselves to be in need of some high quality armor and weapons.  He agreed to join them as their smith.  He started out just crafting the guilds needs but as the guild started to grow, he started to take on apprentices.  As the number of apprentices grew he couldn’t train them all manually, so he created a teaching manual and enchanted it with a spell that would enhance the reader with skills equal to Lazgar’s.  But, as a precaution, only Lazgar knew the activation spell.  When an apprentice would pass his trials, Lazgar would use his book to enhance his apprentices skills.  One year a very impatient dremora signed up as an apprentice.  His name was Inganar.  He didn’t want to wait for his trials, so he tried to use the book himself.  As he was trying to figure out the spell, Lazgar caught him.  He was then thrown out but he said he’d be back for that book.  Lazgar shrugged and went back inside for some bread and warm mead.  Three years later Lazgar woke up and found his manual gone.  He found more of a nuisance than a problem, but headed out to find someone to go get it for him anyway.  He ended up in Whiterun since, being the main trade hub, lots of people pass through.  People passing through means mercenaries passing through.  He took up residence in the drunken huntsman and waited there for someone desperate enough to get his manual for him.  \r\n\r\nDescription:\r\nThis is a quest that sends you to retrieve Lazgar\\'s manual.  It\\'s a simple fetching quest but it does have some harder enemies.  If you fetch it for him he will \\\"show you some of his crafting secrets,\\\" which means he will completely train you in the crafting skills.  I know that might seem overpowered but I love to create new characters.  Unfortunately, every time I created a new one, I had to grind up those crafting skills.  I created this quest so that I wouldn\\'t have to do that over and over again, because grinding up crafting skills was my least favorite part of Skyrim.  I tried to make this immersion by providing a back story and a quest.  The back story is also included in the game as a book titled, Biography of Lazgar Morn.  You can find it scattered around Whiterun.  \r\n\r\nI uploaded a voice folder which should fix the voice problem, I hope.  Just put it in the voice folder located at skyrim/data/sounds/voice.  ",
  "categoryId": "35",
  "version": "1.1",
  "author": "SoldierForSkyrim",
  "createdUnix": "1337035078",
  "updatedUnix": "1337372626",
  "containsAdultContent": false,
  "uploadedBy": "SoldierForSkyrim",
  "primaryFile": null,
  "files": [
    {
      "fileId": "61354",
      "name": "Lazgar Morns Manual",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "Lazgar Morns Manual-17069-1.zip",
      "uploadedUnix": "1337035154",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/1bf4fdf7d71556a88e2f1084b1f5d48fc858159c8aa16d16eadabc78308fdd6d/analysis/1406892853/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lazgar%20Morns%20Manual-17069-1.zip?fid=61354&ttl=1535782883&ri=8192&rs=8192&setec=f14a012fd961c99af8010393a827d13f"
    },
    {
      "fileId": "62149",
      "name": "Lazgar Voice",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "Lazgar Voice-17069-1-1.zip",
      "uploadedUnix": "1337372626",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1bf4fdf7d71556a88e2f1084b1f5d48fc858159c8aa16d16eadabc78308fdd6d/analysis/1406900711/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lazgar%20Voice-17069-1-1.zip?fid=62149&ttl=1535782884&ri=8192&rs=8192&setec=f4838b1ca13645093e0ef6eff0c641c2"
    }
  ]
}