{
  "modId": 17108.0,
  "modName": "Greater Ore Veins",
  "summary": "Mineral ore veins will now have more resources, allowing you to mine longer.",
  "descriptionHtml": "I found it fairly immersion-breaking that I could easily deplete an entire vein of ore in less than one game hour, and then still see NPCs continue to hack away at it.  At the same time, I realized that this was done for the sake of game balance.  If you had an infinite vein, then it would pretty much devalue both the ore and the gemstones that you would receive.\r\n\r\nI settled on a compromise.\r\n\r\nThis mod increases the number of ore pieces that you can get from a vein from 3 to 15.  \r\n\r\n\r\n[b]INSTALLATION[/b]\r\nNMM should be able to do its thing.\r\n\r\nCurrently, this mod is just a script file.  There is no .esp file.  If you wish to do a manual install, unzip the archive in your DATA folder and make sure the new script gets dropped in the /scripts folder there.\r\n\r\n\r\n[b]CONFLICTS[/b]\r\nI am unaware of any conflicts at this time.  If you find any, please report them and I will see about a fix.\r\n\r\n\r\n\r\n[b]FUTURE VERSION PLANS:[/b]\r\nMaybe if I\\'m inspired enough to do a future version, I\\'ll work on trying to make different ore veins provide you with different outputs to preserve the rarity of certain ores, and possibly even a random range.  (For example, ideally you may get 10-15 pieces from an iron vein, but only 1 to 4 from a gold vein.)\r\n\r\n\r\n[b]BUG & IDEA REPORTING:[/b]\r\nIf you experience any issues with this mod, PLEASE let me know!  If you find an ore node that doesn\\'t quite work right, let me know where it was located and what kind of ore it was.  \r\n\r\nIf you have suggestions concerning game balance, please comment.  The line between game balance and immersion is very thin.",
  "categoryId": "24",
  "version": "1.0",
  "author": "American Jackal",
  "createdUnix": "1337096762",
  "updatedUnix": "1337097026",
  "containsAdultContent": false,
  "uploadedBy": "Erisine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "61486",
      "name": "Greater Ore Veins",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Greater Ore Veins-17108-1-0.zip",
      "uploadedUnix": "1337097026",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b813e77217fb6da9bb37e1b78eea28aedca82e490326ac32b34fb5359c48c330/analysis/1406894292/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Greater%20Ore%20Veins-17108-1-0.zip?fid=61486&ttl=1535782978&ri=8192&rs=8192&setec=d6181782a26d3dc234f606be0c8659da"
    }
  ]
}