{
  "modId": 17102.0,
  "modName": "Imperial Shadowbane Cuirass",
  "summary": "Forged by a Daedric Prince for the Imperials in Solitude! Its a simple mod AND tribute to the Imperial Heavy Armor Cuirass! Please read the description for more info....",
  "descriptionHtml": "*****ITS A SIMPLE MOD AND A TRIBUTE TO THE AWESOME LOOKING \\\"VANILLA\\\" IMPERIAL HEAVY ARMOR CUIRASS!***** Please read the description for more info....\r\n\r\n\r\n****Special Notice: If you dont want the \\\"Pure Black Armor Color\\\" Just Copy the \\\"Imperial_Shadowbane_Cuirass.esp\\\" (Texture folder is NOT needed for mod to be functioning) to your \\\"Data\\\" folder =) this way the Imperial Armor will be \\\"Vanilla\\\" in color but you will still have the IMP Shadowbane Cuirass with improved stats ****\r\n\r\n**HOW TO INSTALL MOD: UNRAR/UNZIP THE FILE ANYWHERE YOU WANT TO AND THEN COPY THE FOLDER \\\"textures\\\" TO YOUR SKYRIM \\\"Data\\\" FOLDER (CHOOSE YES IF ASKED TO COPY AND REPLACE), NEXT, COPY \\\"Imperial_Shadowbane_Cuirass.esp\\\" TO YOUR \\\"Data\\\" FOLDER AND ENABLE THE FILE IN \\\"DATA FILES\\\" IN THE LAUNCHER, DONE =)**\r\n\r\n\r\nForged by a Daedric Prince for the Imperials in Solitude, the Imperial Shadowbane Cuirass - Its a recolor of the Imperial Heavy Armor to Pure Black with enhanced stats (values), it looks very evil and is all black!\r\n\r\nFeatures:\r\n\r\nPure Black Imperial Heavy Cuirass named: IMP Shadowbane Cuirass\r\n\r\nEnhanced Protection (Much better armor HP, Weight: 50 Value: 38760) vs vanilla Imperial Heavy Armor and enchanted with:\r\n\r\n \\\"You are able to move more quietly, and opponents that get too close take 5 points poison damage per second\\\"\r\n\r\n\r\nYou can find the Imperial Shadowbane Cuirass in a Locked Chest (Master) at Solitude in Castle Dour HQ, look at pictures to see where it is, its very easy to find the chest with the armor, the armor comes in 10 (Ten) Sets, as a bonus all Imperial Heavy Armor parts also comes in the chest in 10 (Ten) sets.",
  "categoryId": "54",
  "version": "1.0",
  "author": "DarkIncLegion and VelociraptorGTX",
  "createdUnix": "1337087182",
  "updatedUnix": "1337087350",
  "containsAdultContent": false,
  "uploadedBy": "DarkIncLegion",
  "primaryFile": null,
  "files": [
    {
      "fileId": "61458",
      "name": "Imperial Shadowbane Cuirass",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2335",
      "fileName": "Imperial Shadowbane Cuirass-17102-1-0.rar",
      "uploadedUnix": "1337087350",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2149e1212689242df0010f707724129ab6f30086ed09db0c97098e1e13a4bb60/analysis/1406893986/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imperial%20Shadowbane%20Cuirass-17102-1-0.rar?fid=61458&ttl=1535782969&ri=8192&rs=8192&setec=75740b1600f94a83251aaaae8ac9d44c"
    }
  ]
}