{
  "modId": 17155.0,
  "modName": "The Ring Of Kitsune",
  "summary": "Unleash the power of Foxfire with the Ring of Kitsune!",
  "descriptionHtml": "================\r\nDescription\r\n================\r\n\r\nUnleash the power of Foxfire with the Ring of Kitsune!\r\n\r\nBased on the story of the Oni-Kitsune, the mythical Fox-Demon of Japanese folklore, The Ring Of Kitsune is a unique enchanted ring with dark and special hidden magic effects that activate when the caster is truly in danger of dying. For more details, read on...\r\n\r\n\r\n================\r\nWhat Does It Do?\r\n================\r\nWhen equipped, The Ring Of Kitsune does nothing... until you\\'re on the verge of death.\r\n\r\nAt 33% health, there is a 20% chance that any subsequent damage you take will automatically trigger the spell \\\"Kitsune\\'s Vengance.\\\" Kitsune\\'s Vengance staggers and damages opponents close to the caster with a small explosion, cloaks the bearer of the ring in fire, fortifies their destruction skill by 10 points, heals 1 additional point of health per second and offers a 50% resistance to all fire damage. This effect lasts for 45 seconds.\r\n\r\nHowever, there is more to the ring as well. Instead of the Kitsune\\'s Vengance, there is a 5% chance that the greater power \\\"Kitsune\\'s Wrath\\\" will be triggered instead. Kitsune\\'s Wrath triggers a large, damaging explosion, cloaks the bearer of the ring in fire, fortifies Destruction by 15 points, provides 100% immunity to fire damage, heals 2 additional points of health per second, and equips spell \\\"Foxfire\\\" to the player\\'s hands. Foxfire is a high-damage, close-range concentration fire spell which ignores fire resistance and lasts for 1.65 seconds, and burns targets for 3 seconds. If you have the Destruction Dual-Casting perk, them dual-casting Foxfire launches 6 fireballs which create small, blinding explosions on impact. While Kitsune\\'s Wrath is active, the menu cannot be opened. This effect also lasts for 45 seconds.\r\n\r\n================\r\nHow Do I Get It?\r\n================\r\nThe Ring Of Kitsune is a special enchanted ring which is created at the Atronach Forge using the following\r\n-1 Black Soul Gem\r\n-1 Fire Salt\r\n-1 Daedra Heart\r\n-1 Charcoal\r\n-1 Ebony Ingot\r\n-1 Fox Pelt\r\n\r\nThe crafting recipe, as well as a backstory for the ring, can be found on the table at the entrance to the Atronach Forge.\r\n\r\n================\r\nFrom the Author\r\n================\r\nThis mod was a fun project for me, a way to enjoy learning new skills in the CK and combining all of the techniques I have learnt since I started modding to create something a little different which helped me greatly with understanding and appreciating the CK and its many features and functions. Consequentially, there won\\'t be a great deal of updating going on (unless there\\'s bugs with it) since I\\'ve already learnt the lessons I wanted to learn during this project, and have begun turning the new skills to my older mods.\r\n\r\nAlso, apologies in advance for the terrible image quality. I accidentally added an extra 0 when resizing the images, and got a bit over-zealous with the shrinking. XD It\\'s 2am in the morning now, so I\\'m going to bed. I\\'ll do some new images later.\r\n\r\nThanks for checking it out,\r\nDaedalus-AI\r\n================\r\nCredits\r\n================\r\n\r\nThanks to johnwayne1930, for the high-res Ring of Khajiiti diffuse texture that The Ring of Kitsune is based on.\r\nThanks to Bethesda, for reasons that should be obvious.",
  "categoryId": "75",
  "version": "1.0",
  "author": "DaedalusAI",
  "createdUnix": "1337178883",
  "updatedUnix": "1337178989",
  "containsAdultContent": false,
  "uploadedBy": "AzarelHrafin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "61669",
      "name": "The Ring Of Kitsune 1-0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3259",
      "fileName": "The Ring Of Kitsune 1-0-17155-1-0.7z",
      "uploadedUnix": "1337178989",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a8dbde6ca6ea1d8b3cb9c8e1cb9b97b19b3539e96f9a06ce0a6d155b53c842ad/analysis/1406896389/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ring%20Of%20Kitsune%201-0-17155-1-0.7z?fid=61669&ttl=1535783046&ri=8192&rs=8192&setec=4d22d891440c27de43a25abf4a019be3"
    }
  ]
}