{
  "modId": 17165.0,
  "modName": "A Breton Witchunter follower Samhair",
  "summary": "This mod adds to the Skyrim Gameworld a female Breton Witchunter named Samhair that can be found in Jorrvaskr in Whirerun.",
  "descriptionHtml": "Name: A Breton Witchunter follower Samhair\r\nVersion: 1.1\r\nDate: 06/Apr/2012\r\nCategory: Companions\r\nRequired : Apachii SkyHair \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10168\r\nRecommended: Nexus  Mod Manager\r\nAuthor: eamico\r\nSource: http://www.tesnexus.com\r\n\r\nFirst of all, I apologize for my bad English.       \r\n       \r\nIntroduction.\r\nSince Oblivion, I always desired to have mu custom companions. Unfortunately, my scripting skill was not enough to manage a decent and stable script, so I was forced to use CM Companion Mod to have custom NPC  by my side, helping me in fighting Daedra. I was not too happy, but this was enough for me. Today, I am in condition to do my followers for Skyrim.  I like to share them with community. \r\nThis is one of them. \r\nI hope you can enjoy travelling Skyrim in good company. \r\n\r\n\r\nDescription\r\n===========\r\nThis mod adds to the Skyrim Gameworld a female Breton Witchunter named Samhair that can be found in Jorrvaskr in Whirerun.\r\nShe can be married.\r\nThere are 2 versions: Not essential and essential.\r\nUse only one version!\r\n\r\nHelp, endorsement and screenshots are welcome.\r\n\r\n\r\nLocation\r\n========\r\nJorrvaskr in Whirerun. \r\n\r\nDetails\r\n=======\r\nThis is my first attempt to do a complete mage companion. Samhair was rebuilded starting from zero and she is very different from first version: she has another hairstile, but primarily she has her own Class, as well as her own combat style, and a complete set of glass armor in her inventory, and also a good sword, and a staff. Samhair 1.0 was a knight that in some occasion can use spell, while Samhair 1.1 is a mage that currently use magic and sword without much thinking abuout it. \r\nLight armour, one hand sword and staffs are preferred, in particular a combination of them.\r\nThe A.I. was simplified, to have less problem in finding her when dismissed, her speed was reduced to 100 by requests of community, and her circlet existed no more. \r\n\r\nWhith precision:\r\nShe can level up with player from level 5 to level 100.\r\nVoice: Female Sultry .\r\nClass: Combat Witchunter. (Custom)\r\nCombat Style: Witchunter. (Custom)\r\n\r\nBasic stats at level 5:\r\nOne-handed       22\r\nTwo-handed       15\r\nArchery             15\r\nBlock                 15\r\nSmithing             15\r\nHeavy Armour      17\r\nLight Armour        22\r\nPickpocket          15\r\nSneak                 15\r\nAlchemy              20\r\nSpeech               20\r\nAlteration           22\r\nConjuration        27\r\nDestruction        22\r\nIllusion               20\r\nRestoration        25\r\nEnchanting         15\r\n\r\nSpeed       100\r\n\r\n\r\nWe can discuss until tomorrow about the look of this NPC. I don\\'t think that it is important. This is a follower mod, so it is important, in my opinion, to focus efforts on functions of the NPC, not on the look. If possible, it is right  to give a good appearance to new followers, but it is a secondary thing.\r\nThe appearance of this NPC remember the face of Lisette the bard, this is an evidence. I started from this face to do this follower, but nothing have been changed on original Lisette. This NPC have another ID and another AI. I have tested all versions for many hours, and all works in clear way. You can consider her as you want, the sister of Lisette, or a similar NPC, or a Lisette mod or whatever you want; it don\\'t matter to me. She will help you in your travels. This is the goal. \r\nPlease, avoid useless comments on the look of this NPC!\r\nShe live in Jorrvaskr and there she will come back when dismissed. I like this function, I will not change it. \r\nThere are 2 versions of this file. You must choose only one, according to your preferences.\r\n\r\nI use these mods to help functions of my followers:\r\n\r\n1) multFollowers0.4b; it is useful bo build a team of followers.\r\n\r\n2) CM Companion Level Mod; here is the link:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=13790\r\nThis mod will update the companion\\'s skills to their current level to keep pace with the player, so they will ever be good fighters.\r\n\r\n3) Ask Follower Skill; here is the link:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10675\r\nThis mod can make you know all abilities of your followers.\r\n\r\n\r\nIn my system are installed these aesthetic  mods:\r\n\r\nCBBE V3 (standard body) and the hip texture compatability pack:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2666\r\n\r\nBella\\'s Better Females version 3:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2812\r\n\r\nCover Eyes (eyes 1 file):\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4869\r\n\r\nJoseph Anthonys Lip Gloss for Better Females by Joseph Anthony\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=13860\r\n\r\nNo More Blocky Faces by Xenius\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=30\r\n\r\nIf you don\\'t use this combination of mods, her look will be different from the look of the screenshots.\r\n\r\n\r\n\r\n\r\nInstall\r\n=======\r\n\r\nI like very much Nexus Mod Manager, it is perfect for me. I suggest to use it, but....your choice.\r\n\r\nPick which method you are going to use for installation:\r\n\r\nNexus Mod Manager Installation\r\n- = or = -\r\nManual installation \r\n\r\nNexus Mod Manager installation:\r\nDownload the file with Nexus Mod Manager. Activate it. Done.\r\n\r\nManual Installation:\r\nPlace the zip file\\'s contents into your Skyrim/data folder to install and be sure to activate the ESP and ESM files in your Data Files listing.\r\n\r\nNMM downloading problem.\r\nI have seen that in early hours after uploading a file, NMM can not give the possibility to download new files using the button \\\"download with manager\\\". An error message says that file do not exist. After one or two hours, the problem is automatically solved. I don\\'t know why this happens, maybe it is related to high traffic that Nexus server is forced to tolerate. \r\n\r\nIn this case, you can follow these instructions:  \r\n1) Download the file manually.\r\n2) Open NMM.\r\n3) Hit the black arrow located in the left high button and choose \\\" Add Mod from file\\\".\r\n4) Locate and select the file that you have downloaded manually. \r\n5) Hit \\\"open\\\" button.\r\n6) From Mod\\'s  list, select the created file and activate it. Done.\r\n\r\n\r\n\r\nUninstall\r\n=========\r\nPick which method you are going to use for uninstall based on how you installed it:\r\n\r\nNexus Mod Manager Uninstall\r\n- = or = -\r\nManual Uninstall\r\n\r\nNexus Mod Manager Uninstall\r\nOpen Nexus mod Manager and deactivate the file EASamhair. Done.\r\n\r\n\r\nManual Uninstall\r\n\r\nRemove the zip file\\'s contents from your Skyrim/data folder to uninstall and be sure to deactivate the ESP and ESM files in your Data Files listing.\r\n----------------\r\n\r\n\r\nUpgrade\r\n=======\r\n\r\nUpgrading from version 1.0: It is necessary to remove all items from inventory of Samhair 1.0 before upgrading to version 1.1, then deactivate version 1.0 and activate version 1.1. If you do not follow the instructions, all itms in your inventory will be lost.\r\n\r\n\r\n\r\nIncompatibility\r\n===============\r\nNone known.\r\n\r\nKnown Issues or Bugs\r\n====================\r\nSamhair has an hairstyle taken from Apachii SkyHair; if you have not installed it, your game will CTD. \r\nIf you decide to marry her, it is better to tell her where she can live with you BEFORE she leaves the temple in Riften.\r\nThis follower was developed to work with Multi followers, CM Companion Level mod and Ask Follower Skills. Running it with these mods means keeping it clear and bug free.\r\nThis do not means that it can\\'t be used under UFO;  I haven\\'t UFO, so I cannot say what can happen if you use it under UFO itself.\r\nTalking of load order, it is fundamental to run this file AFTER UFO itself, this can avoid best part of eventual problems.\r\nI can\\'t see any reason to develop a version specifically to run with UFO. If my files are clear without it, eventual problems are to be considered of UFO itself, not mine. \r\n\r\n\r\n\r\nYou can also download my other mods:\r\n\r\nA Nord Warhammer follower Ithilwhen\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=16651\r\n\r\nA Cute Redguard Follower Calypso\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=13744\r\n\r\nA Nord Warrior Follower Shanya\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=12893\r\n\r\nA Wood Elf Archer follower Glaween\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=13258\r\n\r\nA Wood Elf Ranger follower Sharwyn\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=15940\r\n\r\nA Woodelf Archer follower Cinthowen\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=15198\r\n\r\n\r\nHistory\r\n=======\r\n1.0, 2012/04/06 - Initial release.\r\n1.1, 2012/May/09 - Samhair converted to Magic follower. \r\n\r\nContact\r\n=======\r\nYou can find me on TESNexus as eamico\r\nYou can send me an email here: eamico@tiscali.it\r\n\r\nCredits\r\n=======\r\n\r\nThanks to Bethesda for creating Skyrim.\r\nThanks to TESNexus.com for the a one-stop-shop resource for authors and players.\r\nSpecial thanks to Blackie for his CM New Companions mod that includes a top-notch detailed tutorial on how to create Skyrim companions without the face discoloration bug. Get his mod and tutorial (contained in the mod) here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11669\r\nThanks to Apachii for Apachii SkyHair\r\nThanks to LHammonds for the Readme Generator this file was based on.\r\nThanks to God for creating us all.\r\n\r\nTools Used\r\n==========\r\nNexus Mod Manager\r\nReadme Generator - http://lhammonds.game-host.org/obmm/tools_readme_generator1.asp\r\n\r\nLicensing/Legal\r\n===============\r\nYou can do whatever you want with this mod but don\\'t complain to me if it doesn\\'t work or your PC blows up.\r\n\r\n\r\n",
  "categoryId": "66",
  "version": "1.1",
  "author": "eamico",
  "createdUnix": "1337185885",
  "updatedUnix": "1337186035",
  "containsAdultContent": false,
  "uploadedBy": "eamico",
  "primaryFile": null,
  "files": [
    {
      "fileId": "61689",
      "name": "EASamhairE_1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "383",
      "fileName": "EASamhairE_1_1-17165-1-1.7z",
      "uploadedUnix": "1337185971",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/00d05785418d3d4aad676591496257cb5c52eefda5a71839c9a343d133e15e19/analysis/1406896564/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EASamhairE_1_1-17165-1-1.7z?fid=61689&ttl=1535783065&ri=8192&rs=8192&setec=b4c9954a9acea413830c8f66c40c35fa"
    },
    {
      "fileId": "61690",
      "name": "EASamhairNE_1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "379",
      "fileName": "EASamhairNE_1_1-17165-1-1.7z",
      "uploadedUnix": "1337186035",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/64723927fc5932bf4d38ad156d05e393d9e41e81b060731b59509e6f47f51cd8/analysis/1406896565/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EASamhairNE_1_1-17165-1-1.7z?fid=61690&ttl=1535783065&ri=8192&rs=8192&setec=fdd1eb43b21ffa3c3314c5d7d12f44fa"
    }
  ]
}