{
  "modId": 17163.0,
  "modName": "Hot Male Housecarls",
  "summary": "ALL MALE\r<br />\r<br />New look for two Skyrim male Housecarls Argis and Calder\r<br />Male replacers for Lydia, Iona and Jordis\r<br />New AI - full use of player home, eat, sleep\r<br />Different fighting style and class for every housecarl with matching set of perks they will gain while levelling up together with your PC.",
  "descriptionHtml": "[center][size=+2][color=#7CFC00]What this mod does:[/color][/size][/center]\r<br />\r<br />This mod gives new appearance for two Skyrim&#39;s male Housecarls Argis and Calder and makes the three female Housecarls male, also this mod fixes several Housecarl related bugs and adds some tweaks to improve immersion. \r<br />\r<br />Details:\r<br />- All the Housecarls are auto levelled, meaning they will level up and gain perks together with your character.\r<br />- All the Housecarls have new advanced AI, they will sleep, eat and use equipment in the house.\r<br />- All the Housecarls will now once a day go out of their homes to visit the marketplace. So if your Housecarl is not at home, go to the market. \r<br />- All the Housecarls have different Class and Fighting style and new appropriate set of perks. \r<br />- Housecarls&#39; dialog is fixed to be not so frequent and annoying. No more &#34;I am your sword and your shield&#34; remarks 100 times a day.\r<br />- Your Housecals will now greet you properly, when you enter your house. No more immersion breaking remarks like &#34;I hope you&#39;re not planning any trouble&#34;.\r<br />- All the Housecarls don&#39;t affect stealth meter, and will not trigger traps in dungeons.\r<br />- All the Housecarls are essential while not following (any follower mod you use controls this while they are following).\r<br />- All the Housecarls have male stance (if they are not being controlled by another mod or corrupted savegame data).\r<br />- All the Housecarls have different height, in general they are taller than typical Nord men. Their weight I left exactly as it is in vanilla Skyrim.\r<br />- All the Housecarls have clothes (prisoner pants) as their default outfit and  appropriate levelled armour placed in their inventory.\r<br />[center][/center]\r<br />\r<br />\r<br />[center][size=+2][color=#7CFC00]Combat style and class details about every housecarl:[/color][/size][/center]\r<br />[u]Argis the Bulwark (Markarth Housecarl)[/u]\r<br />Class: Combat Warrior 2H\r<br />Combat Style: Boss 2H\r<br />Preffered Armor: Heavy Armor\r<br />Preffered Weapons: Two Handed Weapons\r<br />Base ID: 000A2C8C\r<br />Ref ID: 000A2C92\r<br />\r<br />[u]Calder (Windehelm Housecarl)[/u]\r<br />Class: Combat Ranger\r<br />Combat Style:  Missile\r<br />Prefferered Armor: Light Armor\r<br />Preffered Weapons: Bow, One Handed\r<br />Base ID: 000A2C90\r<br />Ref ID: 000A2C96 \r<br />\r<br />\r<br />The three male Housecarls who are replacing females:\r<br />\r<br />[u]Ludwig (Whiterun Housecarl )[/u], replaces Lydia\r<br />Class: Combat Nighblade\r<br />Combat Style: 1H, Dual Weild\r<br />Preffered Armor: Light Armor\r<br />Preffered Weapons: One Handed Weapons\r<br />Base ID: 000A2C8E\r<br />Ref ID: 000A2C94\r<br /> \r<br />[u]Hjoor the Sword Master (Solitude Housecarl),[/u] replaces Jordis \r<br />Class: Combat Warrior 1H \r<br />Combat Style: Boss 1H\r<br />Preffered Armor: Heavy Armor \r<br />Preffered Weapons: One Handed Weapon and Shield\r<br />Base ID: 000A2C8F\r<br />Ref ID: 000A2C95 \r<br />\r<br />[u]Joonas (Riften Housecarl)[/u], replaces Iona.\r<br />Class: Combat Rogue\r<br />Combat Style: 1H, Dual Weild\r<br />Preffered Armor: Light Armor\r<br />Preffered Weapons: One Handed Weapons\r<br />Base ID: 000A2C91\r<br />Ref ID: 000A2C93\r<br />Joonas can open locks if you ask him to do so. At first he starts with most simple locks, but if you take him with you on your Skyrim adventures he will level up and his lock picking skill will grow.\r<br />\r<br />\r<br />[size=+2][color=#7CFC00][center]Required and Recommended mods:[/center][/color][/size]\r<br />\r<br />[color=#7CFC00]Requirements:[/color]\r<br />None\r<br />\r<br />[color=#7CFC00]Recommwnded mods:[/color]\r<br />- [url=http://skyrim.nexusmods.com/mods/12933]Extensible Follower Framework by Expired[/url] -multi-follower mod, enhances your followers&#39; behaviour, fixes a lot of follower related bugs and much more.\r<br />- [url=http://skyrim.nexusmods.com/mods/16542/?]Blood on the Ice Fix - Purchase Hjerim by mageesty[/url] - bugfix mod that allows you to purchase Hjerim and have Calder as your Housecarl, even if you were not able to previously make Blood on Ice quest.\r<br />- [url=http://skyrim.nexusmods.com/mods/27815/?]Fine Face Textures for Men[/url] - High resolution face texture replacer for male characters.\r<br />- If you don&#39;t like the changes I made to the classes and combat styles, or you want your Housecarls to have different ones, you can always use Follower Framework to change the combat style, I also recommend this mod [url=http://www.nexusmods.com/skyrim/mods/34473/?]Housecarls Are Tanks by elite403[/url] if you would like your Housecarls to be real bodyguards.\r<br />\r<br />[size=+2][color=#7CFC00][center]Installation and uninstallation:[/center][/color][/size]\r<br />\r<br /> It is recommended to use NMM for Installation and Uninstallation of this mod&#39;s files. [url= http://skyrim.nexusmods.com/mods/modmanager//?]Get Nexus mod Manager here[/url]\r<br />If you need instructions for manual installation and uninstallation, please refer to Readme file that is included in the mod archive.\r<br />\r<br />Note that if you have separate Housecarl&#39;s files (not the full pack) you must tell NMM to install every next file normally(by clicking &#34;NO&#34;) and overwrite files(click &#34;YES&#34;). You cannot double-click in NMM to install every file -- NMM can&#39;t see the difference between mods coming from the same download page and thinks they are all the same mod. You must install every file in NMM using the green arrow button, then tell it to install normally by clicking &#34;No,&#34; then tell it to overwrite files by clicking &#34;Yes to all&#34;.\r<br />\r<br />[color=#7CFC00]Load order:[/color]\r<br />This mod&#39;s ESP/s should be loaded after UFO in the load order. If you use EFF or AFT the load order shouldn&#39;t matter.\r<br />\r<br />\r<br /> [color=#7CFC00]How to upgrade from the previous version:[/color]\r<br />\r<br /> 1. Before upgrading, remove all items you want to keep from your housecarl&#39;s inventory.\r<br /> 2. Dismiss your housecarls.\r<br /> 3. Save your game.\r<br /> 4. Uninstall old version.\r<br /> 5. Install new version.\r<br /> 6. Start Skyrim and re-hire your housecarls.\r<br /> \r<br />Sometimes the Housecarls need to be &#34;recycled&#34; for all the changes to take place. \r<br /> To recycle the housecarl do the following:\r<br /> 1. take everything from housecarls inventory.\r<br /> 2. Open the console and click on the actor (you ill see the ref ID appeared on the top of the console).\r<br /> 3. Type [recycleactor] without brackets, hit ENTER and exit the console.\r<br />[center][/center]\r<br />\r<br />[center][color=#7CFC00][size=+2]Compatibilities and incompatibilities:[/size][/color][/center]\r<br />\r<br />-- This mod modifies Housecarls&#39; NPC records directly, you can bet it will conflict with any other mod that does the same. This includes UFO, which is an NPC mod (even though it is not advertised as such) because it alters Housecarls NPC records directly. As a result, if you are running UFO, this mod&#39;s plugins (and as a matter of fact any mods that alter Vanilla followers NPC records such as beautification mods) must all come after UFO in your load order or you will get the infamous grey head bug. Also If you use UFO it might happen that your male housecarls, who are replacing females will be forced by UFO to female animations. All you can do is clean your saves and switch to another follower framework. I recommend using [url=http://skyrim.nexusmods.com/mods/12933/?]Extensible Follower Framework by Expired[/url], because it makes all necessary changes by scripts and does not edit NPC records directly as UFO does.\r<br />\r<br /> -- This mod should not conflict with any mods that change Housecarls at runtime via scripting or quests. So aside from warning about this mod&#39;s plugin/s needing to be below UFO in the load order, this mod is compatible with all follower control mods, such as UFO,  AFT and EFF. \r<br />\r<br />[center][color=#7CFC00][size=+2]Disclamers:[/size][/color][/center]\r<br />\r<br />I am not taking any requests concerning this mod. It is offered as it is. Please refrain from asking me to change combat style, class, perks or to make some changes that fit your play style. Use Follower Framework to do that.\r<br />\r<br />\r<br />\r<br />[color=#7CFC00][size=+2][center]Known Issues, FAQ and troubleshooting[/center][/size][/color]\r<br />\r<br />-- If you already encountered one or more female housecarls in your game, there&#39;s always a possibility that the female stance data got into your savegame and it is now in your save as a form of corruption. IT WILL OVERRIDE the new stance data from my mod causing the males who are replacing females to have feminine walking style. In this case it&#39;s recommended to start a new game with this mod loaded and it should be fine. If you are to far in your game and you want to install the mod - you might need to clean your saves from female stance data, so that your new male housecarls walk like men again. Please read the following information on how exactly you can do that.\r<br />\r<br />[color=#7CFC00]How to fix the stance data (walking style) for the Housecarls you&#39;ve already met in game:[/color]\r<br />\r<br />1. Take everything of value from your housecarl&#39;s inventory, dismiss your housecarls.\r<br />2. Save the game and quit.\r<br />3. Download [url=http://www.nexusmods.com/skyrim/mods/52363/?]Save game script cleaner[/url]\r<br />4. Open your save wehere your housecarl is NOT following you in that tool.\r<br />5. At the bottom on the right you will find a little window for RefIDs. You must enter [b][u]BaseID[/u][/b] of your housecarl there and click Delete and save.\r<br />6. Done. Load your cleaned saved game and go search for your housecarl, the walking style problem should be fixed now.\r<br />\r<br />\r<br />-- If you use this mod and see a gap between the neck and the body, it is because your saved game contains changes to the NPC&#39;s weight - changes made in the console with the setnpcweight command, or changes made by a previous mod. I left Housecarls&#39; weight exactly as it is in vanilla Skyrim, so this issue is not caused by my mod, but by your savegames. To fix that issue you will need to clean your saves from these data.\r<br />\r<br />[color=#7CFC00]How to fix Neck GAP for the Housecarls you&#39;ve had modified before by another mod or by console commands:\r<br />[/color]\r<br />1. Take everything of value from your housecarl&#39;s inventory, dismiss your Housecarl.\r<br />2. Save the game and quit.\r<br />3. Download [url=http://www.nexusmods.com/skyrim/mods/52363/?]Save game script cleaner[/url]\r<br />4. Open your save wehere your housecarl is NOT following you in that tool.\r<br />5. At the bottom on the right you will find a little window for RefIDs. You must enter RefID and BaseID of your housecarl there and click Delete and save.\r<br />6.Load your cleaned saved game, open the console and entered PRID [refID of your Housecarl] and hit enter. The RefID should now be displayed at the top of your console window.\r<br />7. When you got the RefID of your housecarl displayed in console type ENABLE and hit ENTER.\r<br />8. Done. Go search for your housecarl, the neck gap problem should be fixed now.\r<br />\r<br />[color=#7CFC00]Q: I&#39;ve installed a few more mods and my houscarls are females again, WTF?[/color]\r<br />A: It means that you&#39;ve installed some mods which edit Housecarl NPC&#39;s records and now you have a conflicting mod installed.  Remember: there is no such thing as a plugin file that changes an NPC just a little bit. If NPC is changed in any way - ALL the NPC&#39;s data is stored inside every NPC data record. So, a mod that just changes an NPC&#39;s voice will will also include all the other vanilla data about that NPC, including their sex and appearance data and thus potentially conflict with another mod that attempts to change the same NPC record. That is why your housecarls are back to female. If you want to keep those conflicting mods - you can try to reinstall my mod files over all those mods you have installed (don&#39;t forget to overwrite everything when you&#39;re reinstalling) and then move Hot Male Housecarls ESP files to the very end of your load order, so that HMH esp files go AFTER the conflicting mod esp files in your load order, but it might not be enough to prevent mod conflicts.  If you want to avoid this in the future - be careful with the mods you&#39;re about to install, and check what exactly they do and what records they change before installing them.\r<br />\r<br />[color=#7CFC00]Q: I&#39;ve cleaned this mod with TES5Edit and now...[/color]\r<br />A: This mod has been already cleaned with TES5Edit. Please do NOT try to clean it yourself.\r<br />\r<br />[color=#7CFC00]Q: I&#39;ve lost my housecarl, how can I find him?[/color]\r<br />A: Try to use &#34;moveto &lt;actor ref ID&gt;&#34; console command to move Player to specified actor.\r<br />E.g. ~ player.moveto 000A2C94 will teleport you to Ludwig.\r<br />NOTE: do not use &#34;placeatme&#34; command, because it makes a copy of the actor. Which is NOT the same NPC.\r<br />I also recommend [url=http://www.uesp.net/wiki/Skyrim:Console]UESP Wiki Entry on the Skyrim Console[/url]\r<br />\r<br />[color=#7CFC00]Q: I am heaving a &#34;gray head bug&#34;, what have I done wrong?[/color]\r<br />A: As it&#39;s been stated in the Compatibilities and Incompatibilities section: This mod will conflict with any other Housecarl mods. And by Housecarl mods, I mean any kind of plugin file that attempts to modify anything about the housecarls in question. This is because there is no such thing as a plugin file that changes an NPC just a little bit. If NPC is changed in any way - ALL the NPC&#39;s data is stored inside every NPC data record. So, a mod that just changes an NPC&#39;s voice will will also include all the other vanilla data about that NPC and thus potentially create the grey head bug (and other bugs) when used with my mod. \r<br />Remember:\r<br />- Changing your body replacer, skin or face texture [i]will not cause the grey head bug[/i], although it could be responsible for slight variations in skin tone and/or wrist, ankle and neck seams.\r<br />- You will get the grey head bug if there is a previously installed housecarl mod in your game and it comes after my mod in the load order. Make sure to uninstall any other housecarl mods completely, before installing my mod and keep my mod&#39;s file at the end of your load order.\r<br />- You will still get the grey head bug if there was a previously installed housecarl mod and you did not tell NMM to overwrite files when you were installing mod. Make sure to tell NMM to OVERWRITE the files.\r<br />- You most probably will  have a grey head bug if you  ever used SetNpcWeight console command on your housecarls NPCs in your game before.  If you used SetNPCWeight on an NPC and then saved your game - you gave your NPC the grey head bug and it is now in your game save as a form of corruption.  Because you savegame now contains FaceGenData of the NPC you used these commands on. This facegendata can and WILL override facegendata from mods. \r<br />\r<br />[color=#FF0000]Remember: NEVER use SetNpcWeight and SetSkale console commands on your NPCs. It corrupts your saves and conflicts with mods&#39; abilities to control how NPC is supposed to behave and look like.\r<br />[/color]\r<br />So, if your game saves already contain characters that you had used the console command, SetNPCWeight or SetSkale on, you have most probably corrupted your game saves and the NPCs will have the gray head bug, neck gap bug, wrong stance and other bugs as a result. You might not see it at first, but when you install another beautification mod for this NPC it will all come out.\r<br />To clean your saves from this type of corruption please refer to the &#34;How to fix Neck GAP&#34; cleaning method described above.\r<br />\r<br />[color=#7CFC00][center][size=+2]List of the mods used on the screenshots:[/size][/center][/color]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=13486]Winter Is Coming[/url] \r<br />[url=http://www.nexusmods.com/skyrim/mods/39983/?]Regal Huntsman Armor by DreamBurrow[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/25476/?]Evil MasterMind Armor by Satyr ZeroFrost[/url][url=http://www.nexusmods.com/skyrim/mods/54672/?]Rough Leather Armor by atomec[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/38386/?]Contractor and Mavari Armors by Zerofrost Satyr[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/14913/?]Scout Armor by Gunvarian and doodaboom[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/27064/?]KDCirclets Redone by zzjay and harokyang[/url]\r<br />\r<br />[center][color=#7CFC00][size=+2]Thanks and Credits:[/size][/color][/center]\r<br />First of all HUGE thanks to my friend [url=http://www.nexusmods.com/skyrim/users/3325399/?]migal130[/url], without whom none of my mods would ever come to existence, for all his help and expertise and ofc for his [url=http://www.nexusmods.com/skyrim/mods/15808/?]Migal&#39;s Housecarls Beauties[/url] mod, that was an inspiration for creating Hot Male Housecarls.\r<br />Thanks to VectorPlexus - for the help and useful advices.\r<br />Thanks to yapi75 - for encouragement and inspiration.\r<br />Thanks to Apachii - for her friendship, and for her great Apachii Sky Hair mod and for all her advices and help.\r<br />Thanks to Lapiz Lazuli, Peggy, Geonox, Apachii,  for the hair meshes from the Apachii Sky Hair mod.\r<br />Thanks to LogRaam for the textures from [url=http://www.nexusmods.com/skyrim/mods/13722/?]The Eyes Of Beauty by Gabriel Mailhot[/url]\r<br />Thanks to [url=http://www.nexusmods.com/skyrim/users/3123219/?]missjennabee[/url]  for the textures from  Improved Eyes mod.\r<br />Thanks to [url=http://www.nexusmods.com/skyrim/users/1669135/?]Montymack[/url] - for stance fixing method.\r<br />Thanks to [url=http://www.nexusmods.com/skyrim/users/3509980/?]kiparisova[/url] for nice screenshots and testing.\r<br />Thanks to all my Nexus friends for support.\r<br />Thanks to the creators of 7zip.\r<br />Thanks to NifTools team for Nifskope\r<br />Thanks to creators of Blender\r<br />Thanks to Bethesda for creating Skyrim.\r<br />Thanks to LHammonds for [url=http://hammondslegacy.com/obmm/tools_readme_generator1.asp]Readme Generator[/url] this file&#39;s description and readme was based on.\r<br />And last but not least many thanks to the Nexus Network, for providing and maintaining such a great place for modders to share their work.",
  "categoryId": "33",
  "version": "2.2",
  "author": "urshi",
  "createdUnix": "1337184328",
  "updatedUnix": "1426270879",
  "containsAdultContent": false,
  "uploadedBy": "urshi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000120705",
      "name": "Hot Male Housecarls full pack - Version 2.2",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10376",
      "fileName": "Hot Male Housecarls full pack Version 2.2-17163-2-2.7z",
      "uploadedUnix": "1407240904",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/b6cfb850a3aa2ad476df355752e5bc92078159a731f3c441c9d935263ae9042c/analysis/1407246376/",
      "changelogHtml": " Fixed wrong weight for Clader that was accidentally changed. <br/> \n Added new Readme to the Mod archives. <br/> \n Added separate download files for every Housecarl. <br/> \n Vanilla hair Version of the mod is not supported any more. All the files have need removed from the mod page. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hot%20Male%20Housecarls%20full%20pack%20Version%202.2-17163-2-2.7z?fid=1000120705&ttl=1535783058&ri=8192&rs=8192&setec=49fc1ce22b8611d73dc8df850ebd3cf3"
    },
    {
      "fileId": "1000120746",
      "name": "Only Markarth Housecarl -ARGIS the Bulwark - Version 2.2",
      "version": "2.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2535",
      "fileName": "Only Markarth Housecarl -ARGIS the Bulwark - Version 2_2-17163-2-2.7z",
      "uploadedUnix": "1407272648",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/b06b9f04ab2ddd1fd07a8939547eebf0cb3e6d9336dea3cbe08d90530db83c19/analysis/1407272737/",
      "changelogHtml": " Fixed wrong weight for Clader that was accidentally changed. <br/> \n Added new Readme to the Mod archives. <br/> \n Added separate download files for every Housecarl. <br/> \n Vanilla hair Version of the mod is not supported any more. All the files have need removed from the mod page. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Only%20Markarth%20Housecarl%20-ARGIS%20the%20Bulwark%20-%20Version%202_2-17163-2-2.7z?fid=1000120746&ttl=1535783058&ri=8192&rs=8192&setec=911753b0d8f29499b21240519e795224"
    },
    {
      "fileId": "1000120747",
      "name": "Only Riften Housecarl -JOONAS- replaces Iona - Version 2.2",
      "version": "2.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1101",
      "fileName": "Only Riften Housecarl -JOONAS- replaces Iona Version 2_2-17163-2-2.7z",
      "uploadedUnix": "1407272776",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/559538cb036a9da50c4b488afac9fb9a0d23a3b8a00f8d8e3547b91031334765/analysis/1408175235/",
      "changelogHtml": " Fixed wrong weight for Clader that was accidentally changed. <br/> \n Added new Readme to the Mod archives. <br/> \n Added separate download files for every Housecarl. <br/> \n Vanilla hair Version of the mod is not supported any more. All the files have need removed from the mod page. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Only%20Riften%20Housecarl%20-JOONAS-%20replaces%20Iona%20Version%202_2-17163-2-2.7z?fid=1000120747&ttl=1535783059&ri=8192&rs=8192&setec=0ae1e1ca6c8ecc01af5590dc150594b6"
    },
    {
      "fileId": "1000120748",
      "name": "Only Solitude Housecarl -HJORR- replaces Jordis - Version 2.2",
      "version": "2.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1334",
      "fileName": "Only Solitude Housecarl -HJORR- replaces Jordis - Version 2_2-17163-2-2.7z",
      "uploadedUnix": "1407272892",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/35f5224195db6defad2289d50e9a0e48cda5777c1432f6f4220d67461eb4299c/analysis/1408175237/",
      "changelogHtml": " Fixed wrong weight for Clader that was accidentally changed. <br/> \n Added new Readme to the Mod archives. <br/> \n Added separate download files for every Housecarl. <br/> \n Vanilla hair Version of the mod is not supported any more. All the files have need removed from the mod page. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Only%20Solitude%20Housecarl%20-HJORR-%20replaces%20Jordis%20-%20Version%202_2-17163-2-2.7z?fid=1000120748&ttl=1535783059&ri=8192&rs=8192&setec=716e8933631240ed9ef0b0a0cb13aa5a"
    },
    {
      "fileId": "1000120750",
      "name": "Only Whiterun Housecarl -LUDWIG- replaces Lydia - Version 2.2",
      "version": "2.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1365",
      "fileName": "Only Whiterun Housecarl -LUDWIG- replaces Lydia - Version 2_2-17163-2-2.7z",
      "uploadedUnix": "1407273000",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/475e3a23ce73d790fe047927c3ab5caa3340efc77b4c4dddc5c4ecf38a008ff2/analysis/1407273092/",
      "changelogHtml": " Fixed wrong weight for Clader that was accidentally changed. <br/> \n Added new Readme to the Mod archives. <br/> \n Added separate download files for every Housecarl. <br/> \n Vanilla hair Version of the mod is not supported any more. All the files have need removed from the mod page. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Only%20Whiterun%20Housecarl%20-LUDWIG-%20replaces%20Lydia%20-%20Version%202_2-17163-2-2.7z?fid=1000120750&ttl=1535783060&ri=8192&rs=8192&setec=9b8da5383909f42a723fb99ad4bb6ef4"
    },
    {
      "fileId": "1000120752",
      "name": "Only Windhelm Housecarl -CALDER- Version 2.2",
      "version": "2.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4991",
      "fileName": "Only Windhelm Housecarl -CALDER- Version 2.2-17163-2-2.7z",
      "uploadedUnix": "1407273315",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/80ebabee78ed127e65630b4585f341336cf0e34c743af35d276aa2e4d614e071/analysis/1407273383/",
      "changelogHtml": " Fixed wrong weight for Clader that was accidentally changed. <br/> \n Added new Readme to the Mod archives. <br/> \n Added separate download files for every Housecarl. <br/> \n Vanilla hair Version of the mod is not supported any more. All the files have need removed from the mod page. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Only%20Windhelm%20Housecarl%20-CALDER-%20Version%202.2-17163-2-2.7z?fid=1000120752&ttl=1535783060&ri=8192&rs=8192&setec=cf5beb405215bd458d25967a1500bb3a"
    },
    {
      "fileId": "1000151343",
      "name": "Hot Male Housecarls as character presets",
      "version": "2.2",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "8",
      "fileName": "Hot Male Housecarls as character presets-17163-2-2.7z",
      "uploadedUnix": "1426270879",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/b537b7330f1e0ba11393734345b6bc5ebaaedc4a4e7800ddfb5d20fd9c9cf7fb/analysis/1426270922/",
      "changelogHtml": " Fixed wrong weight for Clader that was accidentally changed. <br/> \n Added new Readme to the Mod archives. <br/> \n Added separate download files for every Housecarl. <br/> \n Vanilla hair Version of the mod is not supported any more. All the files have need removed from the mod page. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hot%20Male%20Housecarls%20as%20character%20presets-17163-2-2.7z?fid=1000151343&ttl=1535783061&ri=8192&rs=8192&setec=f74e8400e97ebcfe8dddd3a2a807c7c0"
    }
  ]
}