{
  "modId": 17176.0,
  "modName": "Cavern Isles Sanctuary",
  "summary": "Continuation  and expansion of DarkFrost5\\'s gorgeous Cavern Isles player home. Look for marker just south of Whiterun, past Pelagia Farm.\r\nAugust 11, 2013--bugs fixed. Cleaned and repacked with textures and scripts. Requires reoval of personal items if you are updating. Lots of new features! Cleaned with TES5Edit.",
  "descriptionHtml": "ALL VERSIONS AFTER 4.1  REQUIRE SKRIM.ESM, UPDATE.ESM, DAWNGUARD.ESM AND DRAGONBORN.ESM. CLEANED WITH TES5Edit.\r\nIf you lack the DLCs, then I suggest you try an older version.\r\n\r\nTHANK YOU ERENAR for your help, troubleshooting and testing. YOU ARE AWESOME!\r\n\r\nCavern Isles Sanctuary is a continued development of the beautiful Cavern Isles originally created by Dark Frost 05.It is located just south of Whiterun, past Pelagia Farm.\r\n\r\nMy hope is to create a lush and peaceful retreat for the Dovahkhin to relax after a long day of bloodshed, thievery, and world domination. It is generally lore-friendly, but absolute purists will probably prefer to live somewhere else. \r\n\r\nThis version expands on my goal for a unique, mostly lore friendly, but very useful player home. To that end, this version adds a number of unique visual and role-playing enhancements, as well as crafting and display resources.  I am indebted to the following script and modder\\'s resource creators who generously shared their work and creativity:\r\n\r\nBlary\\'s [url=http://skyrim.nexusmods.com/mods/30599/?]Alchemy Clutter Resource[/url]\r\nOaristys [url=http://skyrim.nexusmods.com/mods/16525/?]Modder\\'s Resource Pack[/url]\r\nOarhal\\'s [url=http://skyrim.nexusmods.com/mods/12395//?]Training Dummies[/url] (script modified for CIS)\r\nRunspect\\'s [url=http://skyrim.nexusmods.com/mods/26132/?]Resources for Modders[/url]\r\nSjogga\\'s [url=http://forums.nexusmods.com/index.php?/topic/754151-tutorials-without-youtoob/]Nexus forum Scripting tutorials[/url]\r\nTamira\\'s [url=http://skyrim.nexusmods.com/mods/36969/?]Stroti Resource Pack[/url]\r\nTeuffel\\'s [url=http://skyrim.nexusmods.com/mods/36499/?]Modular Crafting Table[/url]\r\n\r\nNew Features:\r\nCrafting: New Alchemy and Enchanting tables, New Staff Crafting table.\r\nDisplays:  New Displays for Dragon masks (fireplace) Dragon Claws and Elder Scrolls (Dwemer Balcony). My goal here was to create displays that do not look like they are waiting for items your player does not realize exit, so they utilize existing space.\r\nFurniture and Decoration: This version makes use of the new DLC resources and modder\\'s resources to increase the rustic fee of the home while increasing it\\'s uniqueness. \r\nRoleplay: A shower that makes your player feelgood (small temporary bonuses and cure disease), and practice targets that (slightly) improve your skills with blades, bows or destruction magic. (The effects of this are lowered in order to support a more realistic playing style)\r\n\r\nIn addition, Cavern Isles Sanctuary continues to offer a LOT of weapons displays, bookcases, mannikins, safe storage, shrines, merchants, includes Navmesh and sleeping for up to 3 followers, a complete crafting area, and more. At this time it does not need to be purchased.\r\n\r\nUnlike the original, Cavern Isles Sanctuary has no vampire or werewolf related items, most of the cheat items removed, more greenery, and three new Kajiit, each with 25k and merchandise that respawns. It also now includes much more space and display for your books and weapons.\r\n\r\nIf you prefer the original, I believe it will remain on NMM, but will no longer be supported. Likewise, if you prefer my older versions, I will keep them listed, but the most recent version is the only one I will offer support for.\r\n\r\nConsidering for the next update: A bartender, space for more followers. Have any ideas/suggestions? Speak up, maybe I will include it in a future update. Find a problem? Please let me know!\r\n\r\nHave nice pics of CIS? Please submit them so I can post them! (It is obvious I could use the help here, folks!)\r\n\r\n100% of the credit for the idea and original execution go to DarkFrost5. 100% of the blame for any mistakes or changes that you don\\'t like in this version belong to me. \r\n\r\nNOTE: Change log has been moved, appropriately, to the change log...\r\n\r\nThis mod should be broadly compatible. I know of no conflicts, as long as you have the required .esms.\r\nAs this mod is not recognized by BOSS, I suggest you place it with any other house mods, or use TES5Edit to determine the proper placement for your mod list. Personally I have this mod below Frostfall and Static Mesh Improvement Mod, but above Skyrim Flora Overhaul, and most everything else (weapons/armor mods, NPC mods, Skyre, etc.)\r\n\r\n--GG",
  "categoryId": "67",
  "version": "4.5",
  "author": "DarkFrost5     Georgiegril",
  "createdUnix": "1337204966",
  "updatedUnix": "1376283268",
  "containsAdultContent": false,
  "uploadedBy": "Georgiegril",
  "primaryFile": null,
  "files": [
    {
      "fileId": "82348",
      "name": "CavernIslesSanctuary",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "83",
      "fileName": "CavernIslesSanctuary-17176-3-0.7z",
      "uploadedUnix": "1345249498",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/de7bd4aeb84f4ab70fbcffef931485d253978a0a984cc276258f099b96bc65de/analysis/1407103865/",
      "changelogHtml": " Added new room with lots of display areas, bookshelves, bar/den, targets, shower and bear cub <br/> \n Adjusted lighting for more natural look <br/> \n Fixed main cavern bookshelves to prevent books falling out <br/> \n Added minor changes in main room for atmosphere and better perfomance <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CavernIslesSanctuary-17176-3-0.7z?fid=82348&ttl=1535783084&ri=8192&rs=8192&setec=aec62169eae731f564daf72695f37166"
    },
    {
      "fileId": "95569",
      "name": "Cavern Isles Sanctuary",
      "version": "3.1Alt",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "83",
      "fileName": "Cavern Isles Sanctuary-17176-3-1Alt.7z",
      "uploadedUnix": "1351092177",
      "modVersion": "3.1Alt",
      "virusScanUrl": "https://www.virustotal.com/file/81996b0109825aa68ed74972aab35c25be9a6618d3690320d4e6296f0779fbf2/analysis/1407234375/",
      "changelogHtml": " 24.October.2011 Reverts lighting to DarkFrost05\\'s orginal lighting template. May be better suited for ENB users. Not as bright as 3.0Alt <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cavern%20Isles%20Sanctuary-17176-3-1Alt.7z?fid=95569&ttl=1535783085&ri=8192&rs=8192&setec=40adbf4a0948101d4c63153d7af661e3"
    },
    {
      "fileId": "1000046264",
      "name": "Cavern Isles Sanctuary",
      "version": "4.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5866",
      "fileName": "Cavern Isles Sanctuary-17176-4-5.7z",
      "uploadedUnix": "1376283268",
      "modVersion": "4.5",
      "virusScanUrl": "https://www.virustotal.com/file/8fbe234174b92834a99eba5391dcd1be7a2526c7cdb6244300d2d483afff8ff2/analysis/1407679367/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cavern%20Isles%20Sanctuary-17176-4-5.7z?fid=1000046264&ttl=1535783085&ri=8192&rs=8192&setec=01b1b04925f399592744862d5da558a8"
    }
  ]
}