{
  "modId": 17188.0,
  "modName": "Complete HD Dovahkiin Armor Texture",
  "summary": "The complete set of armor the Dovahkiin wears in the trailers, in HD !! It includes Studded armor, Iron gauntlets, Iron boots, and Iron helmet. ",
  "descriptionHtml": "Hi all,\r\n\r\nI think there is only one serious HD retexture here on the nexus for the studded armor (http://skyrim.nexusmods.com/downloads/file.php?id=1322), and one for the iron armor parts the Dovahkiin wears... Even though those two mods are wonderful, they were simply not to my taste. \r\n\r\nSo I decided a few days ago I would learn what a DDS is, what a normal map does, etc. And here is what I did !! So I am more than a noob to texture editing... I nevertheless managed to create from scratch all the iron parts. \r\n\r\nIMPORTANT NOTICE: For the studded armor, all the credits go to Bernabn. But his mod does not include the shoulder plate engraving that is so cool to me. It has just a flat grey texture as you can see in the picture. So I did change that. It took me a few hours to achieve what I wanted...\r\n\r\nThis way you have the complete armor set you need to look like The dovaahkiin, in HD !!\r\n\r\nI hope you will enjoy and all comments and suggestions (and maybe endorsments) are welcome :-)\r\n\r\nInstallation: as usual, just extract to your skyrim folder.\r\n\r\nEDIT: I realized that the size of the images I uploaded don\\'t do justice at all, please give it a try and see them in-game!",
  "categoryId": "54",
  "version": "1.0",
  "author": "zezzz",
  "createdUnix": "1337222687",
  "updatedUnix": "1337223282",
  "containsAdultContent": false,
  "uploadedBy": "zezzz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "61773",
      "name": "Dovahkiin HD",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12413",
      "fileName": "Dovahkiin HD-17188.zip",
      "uploadedUnix": "1337223282",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c45159994a7a5ea33749cd916b68ba33974531aadfa603328e1a04e329ebf987/analysis/1406897473/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovahkiin%20HD-17188.zip?fid=61773&ttl=1535783111&ri=8192&rs=8192&setec=d154ea26b235260eb956d91484000cf1"
    }
  ]
}