{
  "modId": 17249.0,
  "modName": "Xynn and Camilla Shureshot companions and Vampire Familiar f",
  "summary": "Archer and fire mage companions in Breezehome and a \\\"familiar\\\" for Vampire feeding upstairs!",
  "descriptionHtml": "Xynn and Camilla Shureshot companions and the Dragonborn Familiar for Vampires\r\nHere\\'s some things I made while goofing around learning a little about the creation kit and figured I\\'d share in case anyone finds them useful:\r\n\r\nXynn is a fire using mage I made from scratch. Fire is fun, so why not. \r\n\r\nCamilla Shureshot is a re-do of Camilla from the Riverwood Trader as an archer companion with a few cosmetic changes. Basically, she got tired of being a boring trader and decided to go out and follow the dragonborn. Note that the regular Camilla is still in the game and this does not over-write her.\r\n\r\nThese two are conveniently sitting in the Breezehome at the table by the entrance and will go back there when dismissed. They start with some vanilla stuff, but can be equipped with better items as you see fit. I\\'ve used them for a while and they seem to work well. \r\n\r\nThey should level up with your character. I make no guarantees since I\\'m not an expert. They don\\'t seem to be \\\"uber\\\" unbalanced companions and I didn\\'t want them to be. Hey they make nice house decorations if nothing else!\r\n\r\nI also added a \\\"Dragonborn Familiar\\\" that is in a state of slumber in the bed upstairs in Breezehome. This makes feeding more convenient for the Vampires among us (you know who you are). \r\n\r\nI use coverwomen version1, UNP and the UNP neckseam tex-blend setup, and recommend those mods to make things look better. I also recommend the UFO ultimate followers overhaul to make things easier and give you more control. I gave the UNP Witch armor and UNP Jewelry to Xynn for one of the screenshots. You can search the Nexus and find any of those fine mods and more. \r\nInstallation: Drag and drop the esp file into your data folder and thats it.\r\n\r\nPossible conflicts: Any mods that mess with Breezehome. \r\n",
  "categoryId": "66",
  "version": "1",
  "author": "rahv",
  "createdUnix": "1337303433",
  "updatedUnix": "1337303613",
  "containsAdultContent": true,
  "uploadedBy": "rahvensr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "61981",
      "name": "Xynn and Camilla and Familiar",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2300",
      "fileName": "Xynn and Camilla and Familiar-17249-1.rar",
      "uploadedUnix": "1337303613",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/307968bc6229e0fa81387ecfcff5b958973837582f3952c3ab05846c174f9b80/analysis/1406899449/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Xynn%20and%20Camilla%20and%20Familiar-17249-1.rar?fid=61981&ttl=1535783197&ri=8192&rs=8192&setec=5fe765f89ffd94ffa09adbd3544348d6"
    }
  ]
}