{
  "modId": 17260.0,
  "modName": "Berserker Race",
  "summary": "Introduces a new playable race to Skyrim\r\n\r\nWARNING !\r\nMy English is very bad XD",
  "descriptionHtml": "Introduction:\r\n\r\nI\\'m a fan of Nordic culture, and I love the legend of the berserkers in particular. So I decided to create my own race based on my vision of these warriors.\r\n\r\nDescription:\r\n\r\nA long time ago, there were powerful and cruel gods. Humans feared these gods, but there were those who loved and sought glory in the bloodiest battles, they were the Berserkers!\r\nA race barbarous and violent, that use the bears and wolves as symbolos of his strength.\r\nThey have the power to enter into frenzy during the fighting, creating havoc and fear!\r\n\r\nThis breed is a little higher than the Norse normal (1.07 tall men and women 1.05)\r\nThe male voice has thicker than normal.\r\nWomen have voices fiercest.\r\n\r\nThey are strong and determined so I suggest starting the game already hard at level >=D\r\n\r\nInitial attributes:\r\n\r\nTwo hands 10\r\nOne hand 10\r\nSmithing  5\r\nLight armor 10\r\nHeavy armor 10\r\n\r\npowers:\r\n\r\nBerserker rage (is the same as the orcs)\r\n\r\nresistances:\r\n\r\n50% resistance to freezing (such as the Nordic)\r\n\r\n50% resistance to diseases with the ability bravely bear\r\n\r\nBonus:\r\n\r\nA little bonus HP regeneration during combat, it helps to compensate for the lack of defense by using two-handed weapons and light armor.\r\n\r\ninstallation:\r\n\r\nput the contents of the folder berserker within the data folder where the game was installed, or use the Nexus Mod Manage.\r\n\r\nKnown issues:\r\n\r\nI do not know why but whenever I try to use the command showracemenu the second time after the creation of the character\\'s hair and beard of the character does not change, only after you select the tab for random body they will appear again but it always ends the fading effect bravery bear from the list.\r\n\r\nSo I suggest NOT USING option showracemenu after the character is already ready.\r\nIf anyone knows how to fix it please help me =/\r\n\r\nthis is my first mod, I hope you enjoy\r\nsuggestions are welcome\r\n\r\n\r\n",
  "categoryId": "34",
  "version": "1.0",
  "author": "Guardian300",
  "createdUnix": "1337319826",
  "updatedUnix": "1337319993",
  "containsAdultContent": true,
  "uploadedBy": "guardian300",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62012",
      "name": "BerserkersRace",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "BerserkersRace-17260-1-0.rar",
      "uploadedUnix": "1337319993",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c341038e317e8be914e6911ee35ddac8feffbe46b2d597a6016f57cd39734d08/analysis/1406899746/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BerserkersRace-17260-1-0.rar?fid=62012&ttl=1535783212&ri=8192&rs=8192&setec=ef311093bc80dddbaaed3b420cddb725"
    }
  ]
}