{
  "modId": 17273.0,
  "modName": "Cheat Engine Perk Point Amount Editor",
  "summary": "Edit your perk points! This is a Cheat Engine table which enables you to edit your amount of unallocated perk points.",
  "descriptionHtml": "With this file you are able to edit the amount of unallocated perk points.\r\n\r\nFor those who are familiar with Cheat Engine this is all information they needed. So enjoy.\r\n\r\nFor those who aren\\'t familiar with Cheat Engine here is a quick tutorial:\r\n\r\nFirst of all it is required to download and install the Cheat Engine program. \r\n(find it at: http://cheatengine.org/)\r\n\r\n1. After downloading the Perk Points Editor file place or copy anywhere, desktop, my documents,... etcetera etcetera.\r\n2. After the installation of Cheat Engine double click on the Perk Points Editor.CT file.\r\n   Cheat Engine will now open with the preloaded table.\r\n3. Start Skyrim and load a savegame.\r\n4. After the game is loaded Alt+Tab back to your desktop.\r\n5. Now click on the green/red-flashing button (you can find it in the top-left corner beneath the menu).\r\n6. In the pop-up that opens select the Skyrim process and click on Open (usually the Skyrim process is underneath the Cheat Engine process if you opened Cheat Engine before you started Skyrim)\r\n7. Now Cheat Engine asks if you want to keep the table that already was opened. Choose yes.\r\n8. Now you can use the Record that is in the lowest textbox by right-clicking it.\r\n9. After the right-click on the record the right-click menu shows up. Move your mouse over the Change Record option, a second menu will reveal itself.\r\n10. In the second menu click on Value (this actually represents the amount of unallocated perk points so if you are a double-checker, check if this matches your in-game amount of unallocated perk points).\r\n11. You are now able to edit the amount of perk points. Put in the amount of points you wanted to add.*\r\n12. Click on Ok.\r\n13. Alt+Tab back to the game.\r\n\r\nYou\\'re set and ready to put those newly gane perk points to work. Enjoy!\r\n\r\n*After further testing I found out that it is limited to a value of 255, you can put in a value higher than 255 but it will give you another amount then what you had put in (can be a local issue so tell me if you\\'re not experiencing this problem).",
  "categoryId": "40",
  "version": "1.0",
  "author": "TauwTech",
  "createdUnix": "1337356723",
  "updatedUnix": "1337357115",
  "containsAdultContent": false,
  "uploadedBy": "tauwtech",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62103",
      "name": "Cheat Engine Perk Points Editor",
      "version": "V1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Cheat Engine Perk Points Editor-17273-V1-0.zip",
      "uploadedUnix": "1337357115",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b090f428d57df2c4da12bb953601370ddc98efa12fb2efe2e6a950261e8b7d49/analysis/1406900285/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cheat%20Engine%20Perk%20Points%20Editor-17273-V1-0.zip?fid=62103&ttl=1535783232&ri=8192&rs=8192&setec=c72d3ab710b3fc275dbfffdd9eb815a7"
    }
  ]
}