{
  "modId": 17276.0,
  "modName": "Nightingale Shiv",
  "summary": "Once you have completed the \\\"Trinity Restored\\\" quest for the Thieves Guild (the one where you get the Nightingale equipment), you will be able to craft the Nightingale Shiv at a local blacksmith. The dagger was custom made and I used textures from the Nightingale Blade to help it blend well with the rest of the Nightingale equipment. I did my bes",
  "descriptionHtml": "-----------------------------------------------------------\r\n\r\nVersion 1.5\r\n\r\nLatest Version as of: 5-15-2012, 11:30 AM CST\r\n\r\n-----------------------------------------------------------\r\n\r\nIntro:\r\nOnce you have completed the \\\"Trinity Restored\\\" quest for the Thieves Guild (the one where you get the Nightingale equipment), you will be able to craft the Nightingale Shiv at a local blacksmith. The dagger was custom made and I used textures from the Nightingale Blade to help it blend well with the rest of the Nightingale equipment. I did my best to make this dagger strong but realistic, not game-breaking. It can be scaled to adapt to the player\\'s level at a blacksmith. \r\n\r\n-----------------------------------------------------------\r\n\r\nCrafting:\r\nThe dagger is crafted from the Ebony Smithing category, but does not require the Ebony Smithing perk. However, tempering the dagger DOES require the Arcane Blacksmith perk, as well as an Ebony Ingot and a Quicksilver Ingot. The recipe for the base-level dagger is as follows:\r\n\r\n1 x Leather Strips\r\n1 x Ebony Ingot\r\n1 x Quicksilver Ingot\r\n1 x Deathbell\r\n1 x Void Salts\r\n\r\n-----------------------------------------------------------\r\n\r\nScaling: \r\nThe scaling basically requires the previous version of the dagger and the two ingots required for tempering. As the player reaches higher levels, more versions of the dagger will appear in the smithing menu. The dagger is NOT leveled like other vanilla weapons, like the Nightingale Blade, and cannot be scaled via the other scaling mods. \r\nThis is because I don\\'t really know my way around the creation kit very well, yet, and I just did this over the last day or so. Also, as you level your character, more recipes will be visible in the Ebony Smithing category. The one with the highest stats corresponds to the appropriate scale for your character. Again, this is a little bit of an eyesore if you do a lot of smithing, but I pretty much started this stuff on Friday.\r\n\r\nHowever, scaling of the Nightingale Shiv does not require another mod. Just go to the blacksmith and craft whatever version is currently available. Also, if you lose the upgraded version of the dagger (or just want another one), you can just craft another one.\r\n\r\nScaling occurs at the same levels as the other Nightingale weapons (1, 19, 27, 36, 46) and also for levels 57 and 69. The stat ranges are given below.\r\n\r\nStat:_____________________(Value-Range)_____(Incremental Increase upon Scale-Up)\r\nBase Damage:................................(6 - 12).........................................(+1)\r\nCrit Damage:...................................(4 - 10).........................................(+1)\r\nEnchantment Strength:...................(5 - 35)........................................ (+5)\r\nSell Value:...................................(500 - 2000)...................................(+250)\r\n\r\n\r\nJust for comparison, here is a list of daggers whose Base Damage is equal to that of the Nightingale Shiv within the indicated level ranges.\r\n\r\nCategory_____(Level-Range)\r\nOrcish....................(1 - 18)\r\nDwarven...............(19 - 26)\r\nElven....................(27 - 35)\r\nGlass....................(36 - 45)\r\nEbony...................(46 - 56)\r\nDaedric.................(57 - 68)\r\nBlade of Woe.......(69 - Cap)\r\n\r\n-----------------------------------------------------------\r\n\r\nInstallation:\r\nJust extract the NightingaleShiv.esp from the download into your \\\"…commom\\\\skyrim\\\\Data\\\" folder. \r\n\r\nCompatibility:\r\n-There are no known compatibility conflicts. The dagger is completely new and nothing is replaced.\r\n-No other mods are required for use.\r\n\r\nKnown Issues:\r\n-Some players experience issues with placing the dagger on weapon racks, plaques, weapon cases, etc.  The cause is unknown at this time, but being investigated.\r\n\r\n\r\nChange Log:\r\n-Version 1.5: 5-15-2012, 11:30 AM CST - Fixed issue with not being able to craft first level dagger and made the enchantment last longer.\r\n-Version 1.4: 5-15-2012, 8:20 AM CST - Attempted to fix size and rotation issues.\r\n-Version 1.3: 5-14-2012, 10:00 PM CST - Fixed blood texture floating above weapon.\r\n-Version 1.2: 5-14-2012, 10:00 AM CST - Adjusted weapon rotation and size to fit 1st Person view more accurately.\r\n-Version 1.1: 5-13-2012, 9:00 PM CST - Changed weapon type from “sword” to “dagger”. \r\n\r\n-----------------------------------------------------------\r\n\r\nEnd Notes:\r\n\r\nThis mod can be considered a work in progress in that I will try to fix what I can if any problems arise.\r\nIf you would like to use this mod or any of the objects/textures included, just let me know, first. \r\n\r\nI hope you guys enjoy the Nightingale Shiv!\r\nPlease feel free to post comments and such. I want to know what you guys think and how I can make this mod better.",
  "categoryId": "55",
  "version": "1.5",
  "author": "Dr3vvn45ty",
  "createdUnix": "1337365686",
  "updatedUnix": "1337452216",
  "containsAdultContent": false,
  "uploadedBy": "dr3vvn45ty",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62366",
      "name": "Nightingale Shiv",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2316",
      "fileName": "Nightingale Shiv-17276-1-5.zip",
      "uploadedUnix": "1337452216",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/6c56e3da2812589c56c6d85dd7983887b6524194eac7eec4a32f48a5aba4f1f5/analysis/1406903052/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nightingale%20Shiv-17276-1-5.zip?fid=62366&ttl=1535783238&ri=8192&rs=8192&setec=6fe8cfb61f83c1026fe21b345a228c04"
    }
  ]
}