{
  "modId": 17289.0,
  "modName": "Sleeping Tree Sanctuary",
  "summary": "Sleeping Tree Sanctuary is a unique player home comprised of large floating islands in the sky.  It has an airship transport, a quest, and a rich back story.  Follow the quest to discover and unlock this mythical area.  The design is based off of the lore behind the origins of the Sleeping Tree.",
  "descriptionHtml": "Name: Sleeping Tree Sanctuary\r<br />Version: 1.2\r<br />Date: 7/14/2012\r<br />Category: Abodes\r<br />Author(s): ElDiabs (Designed the entire abode in all its wonder)\r<br />Manilla Turtle (Scripted stuff to make exciting things happen)\r<br />\r<br />[color=red]Update[/color]: I&#39;ve added a secret in version 1.2 with a reward that many people have been asking for -- can you find it?\r<br />\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/20316/?tab=3&navtag=/ajax/modimages/?user=0|:|id=20316]German Translation[/url]\r<br />[url=http://www.tesbbs.com/threads/955]Chinese Translation[/url] - external site\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/27754/?]Follower Friendly Add-on[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/48781/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D48781%26preview%3D&pUp=1]Improved Crafting Add-on[/url]\r<br />\r<br />[center][IMG]http://img801.imageshack.us/img801/320/sts12descpage.jpg[/IMG][/center]\r<br />\r<br />[center][youtube]BN9d-5PJJA0[/youtube] [youtube]-5mIKqW0Qbs[/youtube][/center]\r<br />\r<br />This home includes a neat quest to discover it, Automatic Item Storage for your convenient storing needs, and an airship transport that takes you to all the major cities and more.  Details are below.\r<br />\r<br />Remember to back up your saves, just in case. If you did not read this warning, placed here and in the known issues section, bummers&#33;\r<br />\r<br />Please read the description before asking questions about bugs or issues you are having. Check the known issues/bugs and version sections below for possible solutions. \r<br />\r<br />Also, this is a Nexus only mod, omitting translations to a point, but never on Steam Workshop. I would prefer you put the translation on the Nexus though, but it is not required.\r<br />\r<br />Description\r<br />===========\r<br />Discover Sleeping Tree Sanctuary and the gooey center within.\r<br />[IMG]http://www.lightalivephotography.com/img/s3/v44/p204120754-3.jpg[/IMG]\r<br />\r<br />Details\r<br />=======\r<br />\r<br />[color=silver][u]Notes on the quest[/u][/color]\r<br />\r<br />The quest can be challenging for low-level characters, so I suggest you be at least level 20 before starting it.  With a little finesse though, even a low level character can make it.\r<br />\r<br />The quest is started by a courier.  All you should need to do is go about your normal gaming business and he&#39;ll find you eventually.  If you want the courier to find you quicker, head towards one of the five major cities.\r<br />\r<br />[color=red]Important note:[/color] There&#39;s an odd bug that no doubt many people will experience.  At a certain point in the quest the dialogue may get &#39;stuck&#39; and not allow you to select a topic when speaking to The Keeper.  The solution is to go to a different cell and come back.  The fastest way is to just run into sleeping tree cave and back out.  Saving and reloading may also fix the problem.\r<br />\r<br />Also, if your subtitles aren&#39;t turned on, you won&#39;t be able to read The Keeper&#39;s responses.  Just a heads up, it&#39;s not required. You&#39;ll still know what&#39;s going on without subtitles.\r<br />\r<br />[color=silver][u]Notes on the airship[/u][/color]\r<br />\r<br />First of all: no, it doesn&#39;t actually fly in real time, sorry.  Instead, it teleports you with a fancy scene in between - still pretty cool, trust me.\r<br />\r<br />Using the airship should be pretty straightforward; pull some levers, push some buttons, and voila&#33; You&#39;re on your way.  One useful note: anything you put into the chests on the airship will move with you when you travel, so this should make the task of moving your stuff into Sleeping Tree Sanctuary a lot easier.\r<br />\r<br />The airship recall pedestal requires a key to use.  You can find it in conference room area of the living quarters.\r<br />\r<br />[color=silver][u]Notes on auto storage[/u][/color]\r<br />\r<br />Sleeping Tree Sanctuary also includes [url=http://skyrim.nexusmods.com/downloads/file.php?id=12468]Automatic Item Storage[/url].  If you&#39;ve used it before in other mods by Eldiabs you&#39;ll probably notice this version is a bit more fancy shmancy.  There are many new features, but most notable for people who don&#39;t want to use it is the ability to turn it off.  Just active one of the auto storage chests while sneaking to open up the alternate menu, you can then choose to enable/disable specific categories of the menu or the entire thing.\r<br />\r<br />There&#39;s also an item access feature added to each workbench.  This means that when you store your items in the connected container of each respective workbench, the stored items will become available to you when you activate that workbench.  For example: after you store your ingredients in the ingredient shelf, all you need to do is activate the alchemy workbench and the ingredients will automatically be moved to your inventory while you use it, and then put back when you&#39;re done.  There&#39;s a similar setup for the forge, smelter, cooking pot, tanning rack, and enchanting table.\r<br />\r<br />[u]New in version 1.2[/u]\r<br />\r<br />You can now toggle the auto storage menu for each individual container on or off. To do so, just activate the container while sneaking and select the enable/disable button. This also works for the item specific containers (e.g. crafting storage)\r<br />\r<br />Armor and weapon storage has been added&#33; This is a bit experimental, so any feedback would be helpful. Any of the containers with the full auto storage script can be switched to the Armor and Weapons mode at will. Just activate the container while sneaking and select the Switch Modes button; this container will now use the Armor and Weapons menu instead. ONLY that specific container will be affected, so you can set which ones you want to use it individually.\r<br />There are some tutorials in game that explain how it works, but read on if you want some details now.\r<br />\r<br />There are two seperate lists, one for armor, and one for weapons. They each start out initially empty. To add items that you&#39;d like to have auto stored for you just select the Add Items button, close the menu, and deposit the items you want into the new container menu that pops up. ANY item should be able to be added to the list, so feel free to add items to the armor or weapons list that aren&#39;t armor or weapons.  You can reset either list by selecting the Reset List button.\r<br />\r<br />**Minor note:  If you use [url=http://skyrim.nexusmods.com/mods/8655]SMIM[/url], don&#39;t select the option with the animated barrels.  This will cause a delay with the custom storage and might prevent it from opening at all.\r<br />\r<br />Versions\r<br />=========\r<br />This mod comes in two versions: the quest version, and the non quest version.\r<br />[ul]\r<br />[*]Quest Version: This is the full version with the quest.  As noted above, the quest is started by a courier.\r<br />[*]Non Quest Version: This version disables the quest.  If you use this version, all you need to do is head over to sleeping tree camp and use the dais portal to get to the sanctuary.\r<br />[/ul]\r<br />\r<br />[IMG]http://www.lightalivephotography.com/img/s3/v43/p144912557-3.jpg[/IMG]\r<br />[IMG]http://www.lightalivephotography.com/img/s3/v38/p446263122-3.jpg[/IMG]\r<br />[IMG]http://www.lightalivephotography.com/img/s3/v41/p516613958-3.jpg[/IMG]\r<br />[IMG]http://www.lightalivephotography.com/img/s3/v43/p157187277-3.jpg[/IMG]\r<br />[IMG]http://www.lightalivephotography.com/img/s3/v42/p148949758-3.jpg[/IMG]\r<br />[IMG]http://www.lightalivephotography.com/img/s3/v43/p339274087-3.jpg[/IMG]\r<br />[IMG]http://www.lightalivephotography.com/img/s3/v44/p299938088-3.jpg[/IMG]\r<br />Check out the screens page for more.\r<br />\r<br />Recommended\r<br />=============\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=14812]Bamboo[/url] and [url=http://skyrim.nexusmods.com/downloads/file.php?id=10312]Tree and Foliage[/url] were used for some of the plants. Take the time to endorse them please.\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=11370]Spouses Can Live Everywhere[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=9504]Followers Can Relax[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=10652]Vanilla Mannequin Script Fix[/url] - Recommend Alternative version \r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=9131]Female Mannequins[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=14393]Custom Storage Spells[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=14947]Teleportation Spell With Menu[/url]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=10891]Unlimited Bookshelves[/url] needed to use alcoves and additional shelves.\r<br />\r<br />Future plans\r<br />==========\r<br /> - I will probably be adding more auto storage for weapons, armor, potions and whatnot.\r<br /> - Recruitable NPCs may be added in the future as an alternate version.  Also, I&#39;ll see about getting companions to follow you up to the sanctuary.\r<br />\r<br />Install\r<br />======\r<br />1. Use NMM (recommended).  Select the version you want in the installer and click finish.\r<br />Or\r<br />2. Manually install the contents of the Data folder, also install one esm from either the Quest or Non Quest folder.\r<br />\r<br />Uninstall\r<br />=========\r<br />Make sure to save outside of the cell being uninstalled. If you save inside of a cell and uninstall the mod controlling that cell , all manner of oddness will most definitely occur.\r<br />\r<br />Upgrade\r<br />=======\r<br />Back up your saves. There are known bugs with upgrading mods...unfortunately. Keep this in mind when upgrading to a newer esm.\r<br />\r<br />Make sure to save outside of the cell being upgraded.\r<br />\r<br />1. Unless otherwise stated in the download description, uninstall old version with NMM and install and activate new version...easy stuff. Updates may just be overwrites and not require the entire mod to be uninstalled first.\r<br />2. Manually remove old esm, bsa, and voice files from Skyrim/Data folder. Install new ones. Or just overwrite.\r<br />\r<br />Incompatibility\r<br />===============\r<br />Expanded Towns and Settlements.esp - Tore my hair out for hours trying to figure this one out. They don&#39;t share any cells in common. No idea what causes the issue.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/19447#]Sneak Tools[/url] reportedly causes an issue with being able to activate the Sanctuary&#39;s forges.  Using console to disable the fire effect on the anvil should solve the problem.\r<br />\r<br />Users of [url=http://skyrim.nexusmods.com/downloads/file.php?id=9494]Warzones[/url] - It is recommended that you disable the Sleeping Tree Camp warzone, otherwise the epic battles will probably get in the way as you try to complete the quest.  To do so, open console(~) and type: set wzonesselectsleepingtree to 0\r<br />Make sure you do this before you reach sleeping tree camp or enemies may have already spawned there.\r<br /> \r<br />Known Issues or Bugs\r<br />====================\r<br />Remember to back up your saves, just in case. \r<br />\r<br />- Like I stated above, your dialogue might get stuck when talking to The Keeper.  Just run into sleeping tree cave and back out and it should be fixed.  Not sure what causes the issue, and I don&#39;t feel like redoing a large portion of the quest to fix it, so oh well.  Since I posted this warning twice people shouldn&#39;t be complaining about it in the comments, right?  If you do I&#39;ll just have slap you through the interwebs.\r<br />\r<br />- If for some reason the dais portal doesn&#39;t work for you, you can get to the sanctuary by opening console(~) and typing: coc eld_sts\r<br />\r<br />You can then use the airship to get there and back again.\r<br />\r<br />- Lower end machines may experience lag or performance issues in some areas. Also, random lag may accur in interior sections. I&#39;ve had this with many mods. Solution is to save, exit, and reload. Works every time.\r<br />\r<br />- For the time being follower will not accompany you up the portal.\r<br />\r<br />- Will be dark for some enb setting and realistic lighting users. I built this according to the bethesda lighting, which is quite nice in my opinion. Also, enbs usually mess up foggy imagespaces. Use enbs if you wish, although it is not recommended while in the cells this mod contains.\r<br />\r<br />- Upon first entering into living quarters cell, mannequins and weapon racks may behave strangely. Simply leave the cell and re-enter.  For much better mannequins, download SLuckyD&#39;s and Daemonjax&#39;s [url=http://skyrim.nexusmods.com/downloads/file.php?id=10652]Vanilla Mannequin Script Fix[/url]. If you need to reset the mannequins (floating and such), go to their pedestal and click the activator. The mannequin’s position will be reset to its default location.\r<br />\r<br />- Random CTDs when going through doors multiple times. Bethesda bug introduced in 1.5\r<br />\r<br />History\r<br />=======\r<br />v1.2\r<br />The largest portion of this update is a secret. Can you find it?\r<br />Auto storage has been enhanced, read the notes on auto storage for more information.\r<br />Added back button to destination selection on airship\r<br />Made the quest a little easier to follow in a later stage\r<br />Modified the Airship Recall stand so the power core picks up automatically\r<br />I altered the script for the dais fall effect. This should hopefully prevent people from dying as often as a result of not being caught properly.\r<br />\r<br />\r<br />v1.1\r<br />Added a device at the sanctuary that allows you to &#34;call&#34; the airship to the port if it&#39;s not already there.\r<br />Improved the destination selection buttons so that you can no longer choose a destination you&#39;re already at.\r<br />Fixed the minor issue with the airship disappearing before you get teleported.\r<br />Made it so you can&#39;t jump out of the airship when in the travel segment.\r<br />I laerned to splel&#33;\r<br />The geode veins should now give soul gems instead of corundum ore - unfortunately, the changes won&#39;t take effect unless you make a clean save.  For all new users it should work fine.\r<br />\r<br />v1.0\r<br />Initial Release\r<br />\r<br />Credit\r<br />==========\r<br />muppetpuppet - Palm models and textures\r<br />scot - Bamboo model and texture\r<br />Daemonjax - critterspawn script fix\r<br />\r<br />Tools Used\r<br />==========\r<br />Creation Kit\r<br />TESVSNip\r<br />7-Zip - http://www.tesnexus.com/downloads/file.php?id=15579\r<br />Readme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r<br />\r<br />I don&#39;t accept donations for my work, but I do endorse donations to [url=http://www.childsplaycharity.org]Child&#39;s Play[/url].\r<br />\r<br />Eldiabs&#39; other player homes:\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=11803][IMG]http://www.lightalivephotography.com/img/s11/v35/p911117993-4.jpg[/IMG][/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=9904][IMG]http://www.lightalivephotography.com/img/s11/v36/p920078971-3.jpg[/IMG][/url]\r<br />\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=9064][IMG]http://www.lightalivephotography.com/img/s3/v44/p990809500-3.jpg[/IMG][/url]\r<br />\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=8197][IMG]http://www.lightalivephotography.com/img/s11/v35/p861080018-3.jpg[/IMG][/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=8197][IMG]http://www.lightalivephotography.com/img/s11/v35/p545306029-3.jpg[/IMG][/url]",
  "categoryId": "67",
  "version": "1.2",
  "author": "Manilla Turtle - Eldiabs",
  "createdUnix": "1337384798",
  "updatedUnix": "1342308963",
  "containsAdultContent": false,
  "uploadedBy": "qlhaele",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62178",
      "name": "Sleeping Tree Sanctuary v1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7865",
      "fileName": "Sleeping Tree Sanctuary v1_0-17289.7z",
      "uploadedUnix": "1337385073",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3ad4fcad53a6b2a679cbab1d2df32b72b245b3811a64d122623cb2a5974b1336/analysis/1406901197/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sleeping%20Tree%20Sanctuary%20v1_0-17289.7z?fid=62178&ttl=1535783259&ri=8192&rs=8192&setec=bf5e73493b03b0639d16921770ac1ca3"
    },
    {
      "fileId": "63183",
      "name": "Sleeping Tree Sanctuary",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6987",
      "fileName": "Sleeping Tree Sanctuary-17289-1-1.7z",
      "uploadedUnix": "1337791344",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/11f5439354f065f82f57589709f2ac659b0f9681e9a07edc4777acf6084386ac/analysis/1406910910/",
      "changelogHtml": " Added a device at the sanctuary that allows you to \\\"call\\\" the airship to the port if it\\'s not already there. <br/> \n Improved the destination selection buttons so that you can no longer choose a destination you\\'re already at. <br/> \n Fixed the minor issue with the airship disappearing before you get teleported. <br/> \n Made it so you can\\'t jump out of the airship when in the travel segment. <br/> \n I laerned to splel! <br/> \n The geode veins should now give soul gems instead of corundum ore - unfortunately, the changes won\\'t take affect unless you make a clean save. For all new users it should work fine. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sleeping%20Tree%20Sanctuary-17289-1-1.7z?fid=63183&ttl=1535783259&ri=8192&rs=8192&setec=41d3596a0718c87e65f2ea1536855603"
    },
    {
      "fileId": "74317",
      "name": "Sleeping Tree Sanctuary",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14334",
      "fileName": "Sleeping Tree Sanctuary-17289-1-2.7z",
      "uploadedUnix": "1342308963",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/2c32f7ff9e93388730cf235012885080b5dac93abf1e6749422a0bb8b468b84c/analysis/1407022781/",
      "changelogHtml": " The largest portion of this update is a secret. Can you find it? <br/> \n Auto storage has been enhanced, read the notes on auto storage for more information <br/> \n Added back button to destination selection on airship <br/> \n Made the quest a little easier to follow in a later stage <br/> \n Modified the Airship Recall stand so the power core picks up automatically <br/> \n I altered the script for the dais fall effect. This should hopefully prevent people from dying as often as a result of not being caught properly. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sleeping%20Tree%20Sanctuary-17289-1-2.7z?fid=74317&ttl=1535783260&ri=8192&rs=8192&setec=faf99bf836884422e429c04b3e985e1c"
    }
  ]
}