{
  "modId": 17284.0,
  "modName": "NewStart_ Stormcloak Mage Coming soon_ Hopefully tomorrow",
  "summary": "Changes the gear you get at the beginning of the game as well as changing some little things in Helgen Keep.",
  "descriptionHtml": "Before you say anything about this, I know its probably been done before, but I decided to put my own spin on this.\r\n\r\nWith that out of the way, let me describe what this mod(s) does. It edits the beginning equipment you get at the beginning of the game by replacing the armor and weapon with a different set that suits someones way of fighting. Right now, I only have the imperial side ready, but I will have some for people who go with the stormcloaks at the beginning. \r\n\r\nThe files that I have uploaded right now change these things:\r\nNew Start-Imperial Heavy-  Changes the imperial light armor that you get at the beginning to imperial heavy armor, the cuirass and boots are in the chest that is marked by the marker and the the helmet is in the chest where the light helmet was. The guantlets are located on one of the beds, like some imperial guard just tossed it there and forgot about it. The \\\"already\\\" dead person, the one where you would get the stormcloak intial gear, where you find the first 2 stormcloaks you fight, has been switched to light imperial gear, because techanically when you go with the imperial guard, you don\\'t know who the person is. \r\n\r\nNew Start-Imperial Mage-  Changes the Imperial Light Armor that you get at the beginning to the mage gear you get  when you are at the torture chambers in Helgen Keep. The rope is found in the main chest, the one with the quest marker, with the helgen key, dagger, and normal boots. While the hood and the spark spell is found where the imperial Light Helmet would have been. The \\\"already\\\" dead person, the one where you would get the stormcloak intial gear, where you find the first 2 stormcloaks you fight, has been switched to light imperial gear, because techanically when you go with the imperial guard, you don\\'t know who the person is. And the mage that was in torture chamber should now be a dead stormcloak, with a weaker version of a iron sword and stamina potion next to him.\r\n\r\nNew Start-Imperial Mage-  Changes the Stormcloak Armor that you get at the beginning to a set of stormcloak heavy gear, a modified set of the Stormcloak Bear gear. The cuirass and boots are found on Gunjar, the dead stormcloak. While the glove are found lying along side him. While the helmet is in the cart in the hallway immediately out of the room. The mage that is in torture chamber is still the same.\r\n\r\nStormcloak mage start coming soon!\r\n\r\nThat is so far what I have, please leave a comment, to tell me what you think, and enjoy. Also if you think I should add anything to it, please tell me and I might add it depending if I can do it. :D\r\n",
  "categoryId": "28",
  "version": "1.0",
  "author": "MegamanOmega91",
  "createdUnix": "1337376376",
  "updatedUnix": "1353554995",
  "containsAdultContent": false,
  "uploadedBy": "MegamanOmega91",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62156",
      "name": "NewStart-ImperialMage",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1199",
      "fileName": "NewStart-ImperialMage-17284-1-0.zip",
      "uploadedUnix": "1337376686",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f31c8639a3bee3111d6554d58856acf3411ade63f493a6b3bbfb71fd0a1a816f/analysis/1406900839/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NewStart-ImperialMage-17284-1-0.zip?fid=62156&ttl=1535783250&ri=8192&rs=8192&setec=d988153230858e40e5477eb931596d95"
    },
    {
      "fileId": "62157",
      "name": "New Start- Imperial Heavy",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1626",
      "fileName": "New Start- Imperial Heavy-17284-1-0.zip",
      "uploadedUnix": "1337376858",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f68f02df08568d5e86bb9f5c7c7b16d0d16d680dfaabfbcc03e2bdf3e02c4b8d/analysis/1406900886/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Start-%20Imperial%20Heavy-17284-1-0.zip?fid=62157&ttl=1535783251&ri=8192&rs=8192&setec=4cad9b79d8f85e5528a86560a3fce71e"
    },
    {
      "fileId": "100986",
      "name": "New Start Imperial Heavy",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "New Start Imperial Heavy-17284-1-0.zip",
      "uploadedUnix": "1353554995",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/25a1395564f0680a61fc4f81f6546afcc42e39c76ceb311469ee229c435d8ebd/analysis/1407273142/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Start%20Imperial%20Heavy-17284-1-0.zip?fid=100986&ttl=1535783251&ri=8192&rs=8192&setec=bde1a4abcf94f05a4081543b92ee3780"
    }
  ]
}