{
  "modId": 17286.0,
  "modName": "Hardcore Encumbrance",
  "summary": "Gameplay mod designed for players wanting a more realistic, immersive take on Carryweight, Movement, and Encumbrance. Dynamically scales character movement speed based upon the percentage of Carryweight used, as well as highly regulates the amount of items that may be carried by the PC. Aim is to make the Dovahkiin back into a human being.",
  "descriptionHtml": "Hardcore Encumbrance\r\nVersion 0.88beta\r\nBy Sukeban\r\n\r\nI. Introduction\r\n2. What This Mod Does\r\n3. Planned Additions (aka Why This Is Still Beta)\r\n4. Install + Uninstall\r\n5. Recommended Mods\r\n6. Credits and Thanks\r\n\r\n\r\n[b]I. Introduction[/b]\r\n\r\nHave you ever been playing Skyrim and then taken a step back, realizing that the Dovahkiin is sprinting with over three-hundred units of encumbrance on his or her back? Have you ever played a survival-horror game and taken satisfaction out of planning your loadout carefully and managing your inventory after every enemy encounter?\r\n\r\nIf you\\'ve answered \\\"Yes!\\\" to either of these questions, then this mod is for you.\r\n\r\nAlso if you\\'ve answered yes, please do check out my other mods, all based-upon the premise of being as realistic and lore-friendly as possible:\r\n\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=16901\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=16715\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=17002\r\n\r\n[b]II. What This Mod Does[/b]\r\n\r\nThis mod makes managing your inventory into serious business. It is designed to combat the urge to horde useless items that you \\\"someday might use\\\" in favor of the bare essentials for combat and survival.\r\n\r\nThis mod dynamically adjusts the player\\'s movement speed based upon the raw percentage of their max inventory that they are carrying. It means that carrying 115/120 inventory is much more detrimental to your speed than carrying a spare 30/120. These percentages are scaled against lore-friendly racial and gender benchmark values and are used to calculate the player\\'s final movement speed. \r\n\r\nMovement speed is updated after every addition or subtraction from the player\\'s inventory. The floor value for movement speed is 70% of vanilla movespeed. However, if you become over-encumbered by more than 25% of your maximum carryweight, you will no longer be allowed to move until you manage your inventory and drop some items. This is so because I always thought it was lame that the player could walk even with 999 units in his inventory and 30 ebony cuirasses stashed in an invisible bag. This means that over-encumbered means OVER-encumbered, meaning that you better drop some weight if you plan on going anywhere.\r\n\r\nThe mod also places a ceiling on the number of items that a player may carry. No more lugging around 4 ebony cuirasses in an invisible bag. Rather, the player is held to strict limits on what he or she may carry. In time, I will work on getting this to be player-determined, but for now the max numbers are what I consider to be realistic:\r\n\r\nA. 1 complete set of light armor\r\nB. 1 complete set of heavy armor\r\nC. 2 daggers for dual-wielding\r\nD. 1 of any other one-handed weapon\r\nE. 1 of any two-handed weapon\r\nF. 1 bow-type weapon\r\n\r\nThere are also ceilings placed on more mundane things like books, arrows, scrolls, potions, ingredients, and soul gems, just to name a few of the others. None of the limits are intended to be annoying or frustrating, but rather to be a reflection of what I consider to be doable for a physically strong person to carry. \r\n\r\n[b]III. Planned Additions (aka Why This Is Still Beta)[/b]\r\n\r\nThis is the bare-bones of the functionality that I have desired since Skyrim released. However, I would like to do more. \r\n\r\nIn future updates, I will be adding scaled weights for equipped weapons and armors, because I think that carrying equipment that you are wearing/carrying in a scabbard is functionally much easier than carrying something unequipped. I will be adding a -50% weight to all equipped weapons and armors. That will also help free up some room in inventory for carrying un-equipable items, ingredients, and miscellaenous items.\r\n\r\nBeyond that, I would also like to modify stamina usage to play a more significant role in the day-to-day life of the player. I will be doing things like disallowing stamina regen when jogging (doesn\\'t really make sense to me, jogging for hours definitely DOES NOT restore your stamina, walking and resting does). Also to disallow regen when swinging a weapon/in combat to return to a more realistic or Morrowind/Daggerfall type stat regen configuration. \r\n\r\nUltimately, I would like to introduce some sort of a Daggerfall-style \\\"Medical\\\" stat that allows for regen and repair of the player\\'s stats. That is well down the road, however. I have much more Papyrus to learn before I can hope to make that happen.\r\n\r\n[b]IV. Install + Uninstall[/b]\r\n\r\nIf manually installing, merely drag the .esp into your Skyrim\\\\Data folder and the three scripts into your Data\\\\Scripts folder. \r\n\r\nTo uninstall, simply do the reverse.\r\n\r\nNOTE: Since this is a beta release, I highly recommend testing this mod out on a backed-up save. Features and scripts are likely to be changed, and I am not yet sure how that will affect characters saved using different versions of the mod. Therefore, I recommend this mod for testing purposes and experimentation to see if you like it and categorically NOT on a character that you plan on using for the long-haul.\r\n\r\nAs such, there is no uninstallation package yet written for restoring movespeed, carryweight, etc. You can do this via console, of course, but it is not included in these scripts.\r\n\r\n[b]V. Recommended Mods[/b]\r\n\r\nThis mod is designed to be a sister mod to my Lore-Friendly Starting Stats mod, a mod that assigns starting statistical values to characters based upon their race + gender\\'s place in the TES lore. As such, this mod is meant to play nicely with the reduced carrying weight capacity and movement speeds that are found in that mod.\r\n\r\nIf not using that mod, I recommend using wolfmark\\'s excellent Skyrim Speeds mod to adjust your movement speed down a little bit. His .NET application allows you to set all the speeds in Skyrim as per your own personal tastes.\r\n\r\n[b]VI. Thanks and Credits[/b]\r\n\r\nFirst and foremost, a MASSSSSIVE \\\"Thank You!\\\" to fg109 for his invaluable assistance with scripting for this mod. Functionality would either be massively gimpy or nonexistent without his help. Seriously, the man is a scripting demigod.\r\n\r\nAlso huge thanks to Leeira and a preemptive endorsement of their upcoming carryweight adjustment mod. If you do not feel like this mod is quite your cup of tea, then look no further than their mod for similar functionality without quite the same borderline masochistic bent as this mod :D\r\n\r\nAnd finally thank you to YOU, my intrepid beta testers :D Any and all issues that crop up for you, please do report them. I am looking to squash bugs and address issues ASAP.",
  "categoryId": "24",
  "version": "0.88beta",
  "author": "Sukeban",
  "createdUnix": "1337379862",
  "updatedUnix": "1337379955",
  "containsAdultContent": false,
  "uploadedBy": "sukeban",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62166",
      "name": "SkBBP - Hardcore Encumbrance VERSION_088Beta",
      "version": "0.88beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "SkBBP - Hardcore Encumbrance VERSION_088Beta-17286-0-88beta.7z",
      "uploadedUnix": "1337379955",
      "modVersion": "0.88beta",
      "virusScanUrl": "https://www.virustotal.com/file/3adf2c5788813841c244edb8a88158a1d0101cc4bbc8bfed2d2e5c4609abc6ec/analysis/1406901005/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkBBP%20-%20Hardcore%20Encumbrance%20VERSION_088Beta-17286-0-88beta.7z?fid=62166&ttl=1535783255&ri=8192&rs=8192&setec=956dd87396bb0033de47a3bb5de8d706"
    }
  ]
}