{
  "modId": 17299.0,
  "modName": "Stony Ridge Home Revised",
  "summary": "A player home with all the essentials needed with all new textures inside the home.  Has a snowy scenery located southwest of Windhelm near Mara\\'s Eye Pond.",
  "descriptionHtml": "I am merging this mod with my original mod.  It can be found at the following link.  http://skyrim.nexusmods.com/downloads/file.php?id=15575 Stony Ridge Player Home   \r\n\r\n[b]Stony Ridge[/b] is a medium to full size player home with all the essentials you need to store your items and show off your favorite armor.  Home is completely re-textured on the inside.[b]Around level 30 or more is recommended to obtain the house.[/b]  Home has a gorgeous view of the mountains and located southwest of Windhelm near Mara\\'s Eye Pond.\r\n\r\nIn E201, an alchemist named Satyr was very much into his work.  He devoted his life to find the perfect potion that would make a name for himself.  Unfortunately, that came with a huge price.  He lost his wife, his two kids, and more importantly his humanity.  \r\n\r\n[b][color=yellow]Features[/color][/b]\r\n-100% non respawning storage containers\r\n-100% Nav-meshed \r\n-12 mannequins\r\n-30+ weapon holders\r\n-4 shield plaques\r\n-4 dagger cases\r\n-Plenty of space for all your books\r\n-Dragon priest mask holders\r\n-Alchemy and enchanting room with plenty of storage\r\n-Full forge area in basement\r\n-All 10 shrines are available and with easy access\r\n\r\n[color=red]Comments and suggestions are welcomed.  If you like the file please endorse.  Thank you.[/color]\r\n\r\n[color=yellow]Conflicts[/color]\r\nNo conflict with any other mods, just ones that alter the same cells.\r\n\r\n[color=yellow]Instal/Uninstall[/color]\r\nUsing Nexus Mod Manager is the easiest way or put file in Data folder located in your Steam directory.\r\n\r\n[color=yellow]Versions[/color]\r\n1.0-Main file\r\n\r\nThanks goes out to Bethesda for an awesome game and to Nexus Mod Manager for letting the public have options to make the game even better.  Also, thanks to my husband for his help and putting up with my aggravation when things weren\\'t going so well.",
  "categoryId": "67",
  "version": "1.0",
  "author": "Janisa",
  "createdUnix": "1337396779",
  "updatedUnix": "1337396779",
  "containsAdultContent": false,
  "uploadedBy": "Janisa",
  "primaryFile": null,
  "files": []
}