{
  "modId": 17327.0,
  "modName": "Hjerim House Improvements WIP",
  "summary": "Improvements to the Hjerim Player Home. [WIP]",
  "descriptionHtml": "[WIP] Hjerim House Improvements.\r\n\r\nIMAGES UPLOADED WITH EACH UPDATE\r\n\r\nCURRENT VERSION: 0.2                   My creation kit is currently fucking up and refusing to let me save. Goddam Bethesda.\r\n\r\nPurchasable after the completion of \\\"Blood on the Ice\\\" quest, Hjerim is the second most expensive house, yet in many eyes, the best. However, upon furnishing, it seems somewhat lacking. This mod aims to further develop the furnishings of the home, adding a few extras on the way, without making it wholly unrealistic (i.e adding on a basement that\\'s the size of a whole new house full of a ridiculous amount of unnecessary junk). \r\n\r\nWORK IN PROGRESS. IF YOU FIND A GLITCH, PLEASE POST IT ON THE DISCUSSION THREAD\r\n\r\n-CURRENTLY WORKING ON: Adding more bookcases into the house, mainly in the study area. These things are a bastard to make. The books just keep flying off.\r\n\r\n0.2 Current Improvements:\r\n-Added an extra weapon rack and two extra mannequins on the second floor.\r\n-Added a top floor to the house, accessible from a ladder from the second floor, to become a study of sorts, at a later date.\r\n-Added a landing railing upon the top of the first flight of stairs.\r\n-Added a back door/tunnel (whatever you want to call it) to the back of the house, allowing for quick access to the world outside of Hjerim and Windhelm. \r\n-Added a Quick Travel marker to the door outside the walls of Windhelm.\r\n-Modified the cooking fire in the kitchen. As it was, the fire was simply burning inside a square of stone bricks, on top of the wood floor. A stone base has been added so the fire no longer burns atop the wood without alighting it.\r\n-Added extra lighting to second floor.\r\n\r\nCOMING IN V0.3\r\n-Addition of a balcony for the main bedroom.\r\n-Tweaked the ladder to negate player collision with the roof.\r\n-Addition of more bookcases\r\n\r\nFuture Developments:\r\n-Development of the back room, containing the alchemy and enchanting workstations. More storage facilities here.\r\nFurther Development of the second floor, adding more mannequins, weapon racks, weapon storage chests and display cases.\r\n-Development of the top floor of the house into a fully fledged study, i.e more bookcases, a desk and other study like things.\r\n\r\nPotential Developments:\r\n-Smithing capabilities to be built into (or onto) the house. Undecided as where to place them yet.\r\n-A garden\r\n-Miscellanious features, such as a bathroom.. for all those times your character needs to excrete...\r\n-Users are welcome to suggest other features into the mod!",
  "categoryId": "67",
  "version": "0.2",
  "author": "JDCG",
  "createdUnix": "1337442265",
  "updatedUnix": "1337442546",
  "containsAdultContent": false,
  "uploadedBy": "blue ate red",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62336",
      "name": "Hjerim House Improvements",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Hjerim House Improvements-17327-0-2.rar",
      "uploadedUnix": "1337442546",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/0c91a50e54b051c29fb8636014cbad3d744bf6e24896beacd41434a8c7af3343/analysis/1406902811/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hjerim%20House%20Improvements-17327-0-2.rar?fid=62336&ttl=1535783335&ri=8192&rs=8192&setec=65d9fbc36d0ea6cda8e1c17ef91378f0"
    }
  ]
}