{
  "modId": 17334.0,
  "modName": "LF - Tactical Magic Combat",
  "summary": "You know how it is, youre fighting for your life against some abomination of nature and even though you have been in combat hundreds of times before, you keep forgetting to cast the Iron skin spell before you get your skin cleaved from your bones...\r\nWell fret no more because this mod is for YOU!",
  "descriptionHtml": "[u][color=#ff0000][font=\\\"impact\\\"][size=8]LF - Tactical Magic Combat:[/size][/font][/color][/u]\r\n\r\n[size=3]You know how it is, youre fighting for your life against some abomination of nature and even though you have been in combat hundreds of times before, you keep forgetting to cast the Iron skin spell before you get your skin cleaved from your bones...\r\nWell fret no more because this mod is for YOU! Yes you (no dont point at yourself thats just weird).[/size]\r\n\r\n[heading][b][font=\\\"impact\\\"][size=6][color=#00ffff]This mod comes with 4 new powers.[/size][/color][/font][/b][/heading]\r\n\r\n[size=3][color=#00ffff][b]Preparation[/b]:[/color]\r\nYou prepare yourself for battle, store a spell you think you may need when combat begins.\r\n\r\n[color=#00ffff][b]Foresight[/b]:[/color]\r\nYou try to foresee the coming events, store a spell and consider when to use it during battle.\r\n\r\n[color=#00ffff][b]Contingency[/b]:[/color]\r\nYou have a battle contingency prepared, store a spell then chose your target and when to use it during battle.\r\n\r\n[color=#00ffff][b]Precognition[/b]:[/color]\r\nYou have a vision of the future, store a spell then chose your exact target and when is best to use it during battle.[/size]\r\n\r\n[size=6][color=#ff0000][font=\\\"Impact\\\"]Example:[/font][/color][/size]\r\n[size=3]- Activate one of these powers for example [color=#00ffff]Contingency[/color].\r\n- Choose your target as \\\"[color=#00ffff]Nearest Enemy within line of sight.[/color]\\\"\r\n- Choose activation condition as \\\"[color=#00ffff]When my health is less than 50% in battle.[/color]\\\"\r\n- Cast chosen spell, for example \\\"[color=#00ffff]Pacify[/color]\\\".\r\nWhen you next enter combat the [color=#00ffff]Contingency[/color] script will be constantly monitoring your health percentage and as soon as you reach 50% of your maximum or lower the script will search for the nearest opponent and your chosen spell \\\"[color=#00ffff]Pacify[/color]\\\" will be automatically cast at the target for free.\r\n\r\nIf you have ever played [b][color=#00ffff]Baldurs Gate II[/color][/b] you will know exactly what I was aiming for when I created this Mod. Ever since I first started modding back in Morrowind days and I have wanted to creature AD&D style magic and spells in my other favourite games.\r\n\r\nSo if you want your summoned minion to have a flame shield whenever you fight undead, or you want to let those pesky spell casters know you mean business when they hit you with their magic, or you just like to start battles with a friendly fireball to the face, this is the mod you want![/size]\r\n\r\n[size=6][color=#ff0000][font=\\\"Impact\\\"]Lore / Balance:[/font][/color][/size]\r\n[size=3]I have tried to make this as lore friendly as possible in all the messages and descriptions, obviously the whole idea of this came from another RPG so its not going to be perfect.\r\n\r\nThere is a [color=#00ffff]3%[/color] chance any projectile spells stored will miss their intended target, this is not an exact statistic just an average of my compiled testing.\r\n\r\nAs these spells are cast for free, cast instantly and even targeted for you where applicable I had to try and balance it out as best I could. Therefore no ritual spells, no dual cast modifications, no powers, shouts or abilities are allowed to be [color=#00ffff] \\\"stored\\\"[/color]. Also after each use there is a cool down period which is longer for the higher end powers, the timer is in real world minutes but if you sleep in a bed the timer is instantly reset. When all is said and done its all tactics, what you think you will need and when you will need it, I dont see a reason to penalize a player to much who actually thinks and plans ahead.\r\n\r\nAlso if a target enemy is chosen under any condition be it a heavy armour wearing opponent or just the nearest enemy, the player needs to have [color=#00ffff]Line Of Sight[/color] to that enemy and within [color=#00ffff]160 feet [/color]for the spell to fire. This was created for two reasons.\r\n1. I did not want to risk an enemy on a different level of the dungeon to the player to be effected by spells when the player didnt even know they were there.\r\n2. The player only has to see the enemy for a split second but it only makes sense the player needs to be aware of the enemy before releasing the stored spell.[/size]\r\n\r\n[size=6][color=#ff0000][font=\\\"Impact\\\"]Where to get it:[/font][/color][/size]\r\n[size=3]To get these awesome powers you need to go and see [color=#00ffff]Bersi[/color] in the [color=#00ffff]Pawned Prawn in Riften[/color], he will only sell you the power tomes if you are of sufficient experience though.\r\n[color=#00ffff][b]Preparation[/b][/color]: Level 2+\r\n[color=#00ffff][b]Foresight[/b][/color]: Level 10+\r\n[color=#00ffff][b]Contingency[/b][/color]: Level 20+\r\n[color=#00ffff][b]Precognition[/b][/color]: Level 30+\r\n\r\nAlternatively, go into the Pawned Prawn, bring up your command console, type [b]TCL[/b], turn around and walk through the door/wall behind you were you will find a pedestal. Click it to activate and receive all the powers with no cost or level requirement.[/size]\r\n\r\n[size=6][color=#ff0000][font=\\\"Impact\\\"]Project Notes:[/font][/color][/size]\r\n[size=3]I have spent over 8 weeks on this project, I had most of it working within the first two weeks or so but trying to make it compatible with all other spell mods out there, making it user friendly for everyone one who doesnt think exactly like me and testing the powers with said spell mods has taken me a very long time.\r\nA few weeks ago I was stumped by the bizarre scripting logic and links to the CK, then I saw on the Nexus the Apocalypse mod by EnaiSiaion. Needless to say my heart sank and I actually felt sick to my stomach because not only did they release a mod with [color=#00ffff]\\\"Contingency\\\"[/color] in it there were also dozens of other amazing spells included and I thought \\\"Great spent weeks on a project and now someone has not only released it way before I was ready but its 100 times better!\\\".\r\n\r\nFortunately after playing the Apocalypse mod I realised my Contingency was completely different and more in line with the original from [color=#00ffff]Baldurs Gate II[/color].\r\nThis gave me a much needed kick up the backside and got me working hard on this project.\r\n\r\nThere is an in-depth README included with this mod and on the Nexus.\r\n[b][u]Please for the love of all that is good and holy [color=#ff0000]READ THE READ ME[/color] before posting a question[/u][/b], I have spent the better part of 3 hours writing the read me and this information during this project and I would rather all that time and effort not gone to waste.[/size]\r\n\r\n[size=6][color=#ff0000][font=\\\"Impact\\\"]Scripts:[/font][/color][/size]\r\n[size=3]I have included all the source files for the scripts I have written as I strongly believe in share and share alike, I have had great help form the modders on the forums and the wiki so am more than willing to give something back. If you find my scripts useful or inspiring please let me know if I can help with anything else. There are a lot of comments and descriptions in the scripts to help anyone follow them and the read me has pretty much every other bit of information you should need plus reasons for my work arounds etc.[/size]\r\n\r\n[size=6][color=#ff0000][font=\\\"Impact\\\"]Requirements:[/font][/color][/size]\r\n[size=3]Only one requirement, [b][color=#00ffff]Common Sense[/b][/color].\r\nIf you do not have this basic human state of mind this mod will not work for you and you will just end up getting frustrated and banging your head against the screen, and then suing me for causing you massive head trauma.[/size]\r\n\r\n[size=6][color=#ff0000][font=\\\"Impact\\\"]Compatibility:[/font][/color][/size]\r\n[size=3]I have tried my best during this project to make it as compatible as possible for all other spell mods, to this extent I have only used [b]one[/b] single vanilla reference in the game. The Pawned Prawn in Riften where you can buy the power tomes. I have set the script on the pedestal to remove itself once the player has all four powers so as not to have the script running forever.\r\n\r\nObviously some combinations wont work when trying this mod with others, you will get some strange results. E.g:\r\n-Dont cast a [color=#00ffff]Contingency [/color]which targets an NPC and you choose Midas\\' Shapeshift Wolf because that\\'s just madness!\r\n-Alternatively, casting [color=#00ffff]Precognition[/color], choosing an enemy spell caster as the target and using [color=#00ffff]Apocalypse[/color] illusion spell [color=#00ffff]Befuddle[/color] works really well.\r\n[/size]\r\n\r\n[size=6] [color=#ff0000][font=\\\"Impact\\\"]Language:[/font][/color][/size][size=3]\r\nThere are no other versions in other languages, if anyone wishes to convert my mod to another language they are more than welcome. All the messages are in there own message objects so it should be pretty straight forward to translate.\r\n[/size]\r\n\r\n[size=6] [color=#ff0000][font=\\\"Impact\\\"]Suggestions:[/font][/color][/size][size=3]\r\nIf you have a suggestion or idea to make this mod even better please let me know in a comment and if enough people agree with you (by using red up on the commented suggestion) I will do my best to make the changes/improvements.\r\n[/size]\r\n\r\n[size=6] [color=#ff0000][font=\\\"Impact\\\"]Future plans:[/font][/color][/size]\r\n[size=3] If this mod becomes popular and you (the good people of the Nexus) would like me to create the other Contingency spell from Baldurs Gate II [color=#00ffff]\\\"Chain Contingency\\\"[/color] where you can store 3 spells for casting at a chosen target and when, then I will do my best to make this possible.\r\n[/size]\r\n\r\n[size=6] [color=#ff0000][font=\\\"Impact\\\"]Install / Uninstall:[/font][/color][/size][size=3]\r\nThe main file is the LFContingency.Esp and the archive file LFContingency.BSA both of these files need to be put into your *\\\\Skyrim\\\\Data folder. Once in the correct location you should see it appear in your load order, just tick it and you are ready to go.\r\n\r\nTo uninstall I suggest removing any spell effects from my Mod on the player character, for example any of the storage powers or the cool down effect. To remove any of the [color=#00ffff]Storage Powers[/color] still active just activate any of the storage powers again and select \\\"[color=#00ffff][X] Cancel[/color]\\\".\r\nTo remove the [color=#00ffff]Cool Down[/color] effect either wait a long time or sleep in a bed. Once all effects are off your player character de-select any storage powers you have active under \\\"Powers\\\". Now just delete the two files associated with my mod and you should be clear.\r\n[/size]\r\n\r\n[size=6] [color=#ff0000][font=\\\"Impact\\\"]Version:[/font][/color][/size][size=3]\r\n21/05/2012 - Fixed minor bug with Contingency and Precognition setting option to monitor stats. V1.1\r\n19/05/2012 - Main file released V1.0[/size]\r\n\r\n[size=6] [color=#ff0000][font=\\\"Impact\\\"]Legal:[/font][/color][/size][size=3]\r\nBy downloading this Mod you agree not to sue, threaten, maim, slice, poison, stab or otherwise attack the creator or his works if any damage is caused to your computer, version or Skyrim, save game or physical body.\r\nI do not own or otherwise have any stake or interest in Bioware or the Baldurs Gate trademark.[/size]\r\n\r\n[size=6] [color=#ff0000][font=\\\"Impact\\\"]Special Thanks:[/font][/color][/size][size=3]\r\nAll these people have helped me in one way or another (even if they don\\'t know it) so deserve a special \\\"Thank You!\\\"\r\n\r\n[color=#00ffff]From the Creation Kit Boards:[/color]\r\nCipscis, JustinOther, RandomNoob, Il Ducey, SLuckyD, Alexander J. Velicky, Redwood Elf, Taewon, Amethyst Deceiver, MoopusMaximus.\r\n\r\n[color=#00ffff]From the Creation Kit Wiki:[/color]\r\nKahmul, Cipscis (again).\r\n\r\n[color=#00ffff]From the Nexus:[/color]\r\nCalientes, Nikitaa, Xilver, Phenderix, EnaiSiaion, Concept83, 3Jiou.\r\n\r\n[color=#ff0000]And of course a big thank you to my wife and two and a half  year old son, if it wasn\\'t for them going to sleep so early each night I would never get so much time to play on my Computer :-) [/color][/size]\r\n\r\n[size=6][b]Contingency:[/b][/size]      [size=3] [Excerpt from Baldurs Gate II Manual]\r\n\r\n[b]Range:[/b] Sight of caster\r\n[b]Saving Throw[/b]: None\r\n[b]Casting Time[/b]: 1 turn \r\n[b]Area of Effect[/b]: Special\r\n[b]Duration[/b]: 1 day/level\r\nUpon casting this spell, the wizard is allowed to choose a spell out of his repertoire of known spells. One spell level for every three levels of the caster is allowed up to 18th level or 6th level spells. Once the spell is chosen the caster is allowed to choose a condition of some kind from the list provided. The starting condition can be anything from reaching 10% of his/her hit points to an enemy being sighted. Once this starting condition is satisfied the spell that was chosen will be cast automatically. \r\nFor example, a 12th level wizard could place the spell stoneskin in a contingency with the starting condition being \\\"the wizard reaches 50% of his hit points\\\". Then in combat once the wizard is reduced to 50% of his hit points or below, stoneskin would be immediately cast upon him. This requires no action by the wizard, it happens automatically and instantaneously. The limitation of this spell is that the target of the spell placed in the contingency must be the caster, therefore it cannot be an offensive spell and cannot target any other party members. Only one contingency may be placed on a caster at a time.\r\n[/size]\r\n[url=http://en.wikipedia.org/wiki/Baldur\\'s_Gate_II:_Shadows_of_Amn] Baldur\\'s Gate II Wiki [/url]\r\n",
  "categoryId": "75",
  "version": "1.1",
  "author": "Leon Fenten",
  "createdUnix": "1337449831",
  "updatedUnix": "1337556579",
  "containsAdultContent": false,
  "uploadedBy": "leonfenten",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62360",
      "name": "LFContingency",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6419",
      "fileName": "LFContingency-17334.zip",
      "uploadedUnix": "1337450006",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fe52ecb32f30f6ab663f75924d333ed7d7b57e029113693ea7495ee506c9325b/analysis/1406903048/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LFContingency-17334.zip?fid=62360&ttl=1535783345&ri=8192&rs=8192&setec=b06b1bfff288fbab040fee04382446e9"
    },
    {
      "fileId": "62605",
      "name": "LFContingency REQUESTED",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6419",
      "fileName": "LFContingency REQUESTED-17334.zip",
      "uploadedUnix": "1337544125",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7857fc70a5641dd2249a018017e017acef077d0ac0125a6e5b8c543e4f6ef12a/analysis/1406905566/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LFContingency%20REQUESTED-17334.zip?fid=62605&ttl=1535783345&ri=8192&rs=8192&setec=cad1d0c1750eff4af53221b252000c8c"
    },
    {
      "fileId": "62666",
      "name": "LF Contingency",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6419",
      "fileName": "LF Contingency-17334-1-1.zip",
      "uploadedUnix": "1337556394",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/de591192e892608e10c5802e491cec0751771be78823363cd53d1ce12cf81100/analysis/1406906107/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LF%20Contingency-17334-1-1.zip?fid=62666&ttl=1535783347&ri=8192&rs=8192&setec=f4707daac44448398ae6a471b8f03347"
    },
    {
      "fileId": "62667",
      "name": "LF Contingency OPTIONAL",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6419",
      "fileName": "LF Contingency OPTIONAL-17334.zip",
      "uploadedUnix": "1337556579",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/8a725dc4a670fca6d6388b698a9c402a3df0d5b192db7f34fbc5e3e18ed5c6fa/analysis/1406906120/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LF%20Contingency%20OPTIONAL-17334.zip?fid=62667&ttl=1535783347&ri=8192&rs=8192&setec=91bfd4e7078d06c3e61f57d5e17f327f"
    }
  ]
}