{
  "modId": 17337.0,
  "modName": "CM Moths",
  "summary": "This mod changes monarch butterflies into snow moths and blue butterflies into frost moths.",
  "descriptionHtml": "Mod Name: CM Moths\r\nAuthors: Cutthroat Mods\r\nVersion: 1.0\r\n\r\nDescription:\r\nEast of Morthal there\\'s a little settlement called Stonehills. It\\'s at the foot of the mountains and it\\'s VERY snowy.  When I saw a monarch butterfly I thought \\\"That\\'s strange.  Must be an error.\\\"  When I saw more and more and more, accompanied by blue moths as well....  Well, Bethesda had pushed my suspension of disbelief beyond the breaking point.  I can accept flowers and butterflies in a more temperate region like Whiterun or the Rift, but come on.  Snowy mountains?\r\n\r\nThis mod changes monarch butterflies into snow moths and blue butterflies into frost moths.  It also re-textures them.  The snow moths are white, the frost moths are a very light blue.  They may look a bit like the luna moths, but they don\\'t glow.  These are not nocturnal creatures, but replacements of the daytime butterflies.  It also changes the names of the associated alchemy ingredients to \\\"snow moth wing\\\" and \\\"frost moth wing\\\".  Inventory images also changed to the colors of the new moths.  Finally (though this is a small thing) it removes the reference to butterflies in the book \\\"Herbalist\\'s Guide to Skyrim\\\".  If I discover other non-spoken references to butterflies, they can be changed in a future version.\r\n\r\nDoes changing monarch butterflies to snow moths make insects in the frozen wastes of Skyrim any more realistic?  No.  But as I\\'m not aware of any real creatures called \\\"snow moth\\\" or \\\"frost moth\\\", it re-establishes just a tiny bit of that suspension of disbelief (for me, at least).  Perhaps they\\'re semi-magical creatures, beautiful and ethereal beings that give birth to rumors of \\\"faeries\\\" in far away lands.  I can accept this a lot more readily than I can accept the idea of real butterflies that are all too familiar to me in the blistering summer months, fluttering around amid the snow storms and -28 degree Celsius temperatures (wind chill factor included) of Skyrim.\r\n\r\nFAQ:\r\nQ: Does this mod change the alchemy effects of the butterfly wings?\r\nA: No.  It only changes the names of the wings.\r\n\r\nQ: Does this mod make it practically impossible to tell the difference between the two types of butterflies from a distance?\r\nA: Not practically, but almost practically.  It\\'ll be more of a challenge to distinguish between them now, yes.  But if you\\'re like me and you just pick everything in site and then sort it out later, it won\\'t really matter.\r\n\r\nQ: I\\'ve found another reference to butterflies in the game.  Can you fix this to keep the mod consistent?\r\nA: Absolutely.  PM username Blackie on the Nexus forums.  As long as it\\'s not a spoken dialogue reference, we should be able to change it.\r\n\r\nQ: I found some dragonflies in a cold-looking area.  Can you change those too?\r\nA: My goal was to replace the real world monarch and blue butterflies with something slightly more fantastical, but I think making white dragonflies would be going too far.\r\n\r\nQ: Will you make a version that keeps the monarch and blue butterflies in the temperate regions and only adds the new moths to the cold regions?  It seems silly to have \\\"snow\\\" and \\\"frost\\\" moths in areas where there\\'s no snow or frost.\r\nA: Good point.  However, I like to have a clean game without a ton of physical changes to the landscape and exterior cells.  Such a mod would require a lot of changes and is way beyond the scope of this mod.  The white and light blue (almost white) moths certainly aren\\'t out of place in a temperate region.  All that might be considered out of place are the names.  However, I don\\'t think the non-snowy areas are necessarily \\\"warm\\\"; they just don\\'t get a lot of snow.  They might not be any more hospitable for our friendly monarchs and blues than the foothills of a Skyrim mountain.  So the semi-magical, cold-weather moths come to save the day, and we could always say their names are based on what they remind people of (snow and frost), rather than the climate they inhabit.\r\n\r\nInstallation:\r\nPlace the folder and files into your Skyrim Data folder.\r\n\r\nKnown Issues:\r\nNone that I\\'m aware of.\r\n\r\nIncompatibility:\r\nAny mod that changes the following textures in the textures/effects folder: fxmothmonarch and/or fxmothblue.  Any mod that changes the monarch butterfly, blue butterfly or their associated alchemy ingredients in the game itself.  Any mod that changes the book \\\"Herbalist\\'s Guide to Skyrim\\\".\r\n\r\nTools Used:\r\nElder Scrolls Creation Kit, Paint Shop Pro, DXTBmp.\r\n\r\nCredits:\r\nBethesda for the base textures.\r\nDarkSaber9000 for the readme generator used to make this text file.\r\n(See: Skyrim Mod Readme Generator by DarkSaber9000 at http://skyrim.nexusmods.com/downloads/file.php?id=17182)\r\n\r\nPermissions:\r\nCM Moths was created by Cutthroat Mods and is furnished as is without promises or guarantees to be bug free or conflict free.  Any bugs inherent in the game engine or Creation Kit are not the responsibility of Cutthroat Mods.  \r\n\r\nDo not upload this mod to any website without permission from Cutthroat Mods.  Uploads to Steam Workshop are not permitted and will never be approved.  Translations into other languages are permitted  provided this Readme is included as is in English along with any translated versions.  Translated files can be uploaded to any website except Steam Workshop.  Permissions to do translations are not required.  If you have any questions or concerns please send email to cutthroatmods@hotmail.com. \r\n\r\n\r\nRevision History:\r\n\r\nVersion 1.0 - Initial release.",
  "categoryId": "85",
  "version": "1.0",
  "author": "Cutthroat Mods",
  "createdUnix": "1337452701",
  "updatedUnix": "1337452885",
  "containsAdultContent": false,
  "uploadedBy": "Blackie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62367",
      "name": "CM Moths 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "CM Moths 1_0-17337-1-0.7z",
      "uploadedUnix": "1337452885",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7aeeab82c4a6951536b618e6d1d4cdb6c5067fd49d191aadd5fe2876e8a38998/analysis/1406903103/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CM%20Moths%201_0-17337-1-0.7z?fid=62367&ttl=1535783351&ri=8192&rs=8192&setec=95c8302502e986f905aa790353418552"
    }
  ]
}