{
  "modId": 17335.0,
  "modName": "Mannequin Follower",
  "summary": "A follower who is a mannequin.  Find him in the Midden underneath the College of Mages.",
  "descriptionHtml": "Mod:  Readme - Mannequin Follower 1_0\r\nGame:  TES V: Skyrim\r\nAuthor:  David Brasher                                          \r\nDate:  5/19/12                  \r\n************************************************************************\r\nCONTENTS                          \r\n************************************************************************\r\n1. Information on the Mod\r\n2. Installation\r\n3. Version History\r\n4. Conflicts, Known Issues, and Troubleshooting\r\n5. Copy Status and Credits\r\n************************************************************************\r\n1. INFORMATION ON THE MOD           \r\n************************************************************************\r\n\t   A follower who is a mannequin.  Find him in the Midden underneath the College of Mages.\r\n\r\n\t   Beneath the College of Mages in Winterhold is the mysterious and unsavory Midden.  \r\nApprentices are not allowed to go down there, but when have rules like that ever stopped mage \r\napprentices?\r\n\r\n\t   There are all sorts of nasty things lurking down there in the cold damp passageways and \r\nrooms.  Mages go down there to carry out experiments they are not allowed to do in the sight of \r\ntheir instructors.  Some of them go down there to indulge their taste for unholy and perverted \r\nhobbies.  If students at college have contraband, they don\\'t hide it in their rooms where the \r\nprofessors could find it.  They go down and hide it in the Midden.\r\n\r\n\t   One young mage apprentice figured out how to make a golem of wood to be his servant.  He\r\nworked long and hard on this project and was very pleased with his success.  But he was not allowed\r\nto be working on this line of research, so he never led his creation out of the Midden where it had \r\nbeen built.  He would go down there to study it, train it, and have it perform tasks for him.\r\n\r\n\t   This young mage had to have been pretty bright to figure out how to create such a thing.  \r\nBut he was not bright enough to stay out of trouble.  While assisting one of his friends with another \r\nsort of unauthorized experiment, something went wrong and they both died a fiery and gruesome death.\r\n\r\n\t   The mannequin waited and waited for his master to return.  He never found out what had \r\nhappened.  He felt abandoned and rejected.  His creator didn\\'t want him anymore.  He was not good\r\nenough.  Nobody loved him.  Some mages who stumbled across him in the Midden saw him, cried out in \r\nfear and ran away.  One of them cast destruction spells at him.  He began to hate the world.  He \r\nwanted everyone else to be as miserable as he was.  He wanted to kill.\r\n\r\n\t   For years and years he lurked in the cold and the mist in the dark dirty Midden.  He \r\nmissed his creator terribly and thought fondly of his visits in the old days when he had just been\r\nmade.  If only he could find a new master who would not draw back in revulsion upon viewing his\r\nmalformed countenance.  If only there was someone who loved him.  Someone who would guide him and\r\ntake care of him.  Someone he could love and faithfully serve.\r\n\r\n* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *   \r\n\r\n\t   The follower in this mod does not use the original follower system.  You can have him \r\nfollow you in addition to the single vanilla Skyrim follower and single vanilla Skyrim dog follower \r\nthat you can have follow you in an unmodded game.  \r\n\t  \r\n\t   The mannequin follows these commands:  \\\"Join Me\\\", \\\"Wait\\\", \\\"Follow\\\", \\\"Share\\\" and \\\"Dismiss.\\\"\r\n\r\n\t   The mannequin is the strong silent type.  He really doesn\\'t have much of anything to say.\r\n\r\n\t   The mannequin will sneak when you sneak and draw weapons when you draw weapons.\r\n\r\n\t   Be careful if you dismiss your mannequin from your party and tell him to go home.  He will \r\nfeel rejected and abandoned once again, just like when his creator left him and never came back.  He \r\nwill likely go berserk and start attacking innocent people.  So if you dismiss him from your party, \r\nyou might want to take him back to the Midden first or else dismiss him in an unpopulated area.\r\n \t        \r\n************************************************************************\r\n2. Installation                           \r\n************************************************************************\r\n           Extract (decompress) the .esp and .bsa to your Skyrim directory.  (It will be something like \r\n*Installation directory*\\\\Skyrim\\\\SteamApps\\\\common\\\\Skyrim\\\\Data)\r\nMark the box next to the Mannequin Follower.esp in your mod manager.\r\n \r\n           Alternately, extract files someplace else.  Then move the .esp and .bsa to Skyrim\\\\Data.  Mark \r\nthe box next to the plugin in your mod manager.\r\n************************************************************************\r\n3. Version History    \r\n************************************************************************\r\nV 1.0    5/19/12   Initial release.   \r\n************************************************************************\r\n4. Conflicts, Known Issues, and Troubleshooting\r\n************************************************************************\r\n\t   Mannequins in Skyrim are really buggy.  They tend to move around when you aren\\'t watching them.\r\nWhen you come back to your house, your mannequin is often not where you left him and he might be levitating.\r\nI was ticked off at this and thought, \\\"If mannequins are going to misbehave and move around when they are \r\nsupposed to just be standing there displaying my armor, then maybe I will just make a mannequin companion\r\nto be my follower.  He can move around all he wants to and go dungeon crawling with me.  He can still \r\ndisplay my trophy armor, and my display will go wherever I go and all the townsfolk can look at it and \r\nadmire it.\\\"\r\n\r\n\t   This mod could conflict with mods that edit the Midden.\r\n\r\n\t   The mod \\\"Advanced Mannequins\\\" conflicts with this mod and breaks its functionality.\r\n\r\n\t   If you get too many followers, you will get lag, and AI problems, such as followers standing \r\naround instead of helping fight. \r\n\r\n\t   If you have too many followers in narrow hallways, you will get stuck.\r\n\r\n\t   The game becomes too easy when you use too many followers.\r\n\r\n\t   If there is too much lag going on at the moment, the dialog options the mannequin has will not be \r\navailable.  Do something to reduce the lag.  Maybe go to another cell where less stuff is going on. \r\n\r\n\t   There is a shortcut that many people don\\'t know about to get your vanilla Skyrim followers to do \r\nmiscellaneous tasks for you.  You can aim your crosshairs at your follower and press and hold down the key \r\nassigned to the \\\"activate\\\" function. (The \\\"E\\\" key by default.)  Do NOT use this shortcut with the mannequin.  \r\nHe will be stuck in this mode and will never follow you again.  You will break your game and need to load up \r\nan old savegame or else permanently stop using the mannequin follower.  I believe that much of this part of \r\nthe game is hardcoded, and I have not figured out if a solution is even possible.\r\n\r\n\t   There is a neckseam problem with the vanilla Skyrim mesh.  It is on the back of the mannequin\\'s \r\nneck and can sometimes be seen depending on what is being worn.\r\n\t\r\n\t   If you locate a bug, contact David Brasher on TES Nexus so that the situation can be\r\nexamined and can hopefully be fixed. \r\n************************************************************************\r\n5. Copy Status and Credits           \r\n************************************************************************\r\nCredits:  Bethesda for making Skyrim in an open format anyone can mod.\r\n\t\t\r\nCopy Status:  Modders resource.  Public domain with proper attribution.  You should list the author in \r\n\t      your credits if you distribute mods with content from this mod.  You may use things from \r\n\t      this mod in your own mods and distribute them.  You are not required to ask permission to\r\n\t      use things from this mod and not required to notify the author that you have used things \r\n\t      from this mod.          \r\n************************************************************************\r\n************************************************************************\r\n************************************************************************\r\n************************************************************************",
  "categoryId": "66",
  "version": "1.0",
  "author": "David Brasher",
  "createdUnix": "1337451652",
  "updatedUnix": "1337451769",
  "containsAdultContent": false,
  "uploadedBy": "David Brasher",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62363",
      "name": "Mannequin Follower 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Mannequin Follower 1_0-17335-1-0.7z",
      "uploadedUnix": "1337451769",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4c0ab0107dd2c17704259df7759b00d955f5bdff02bd1c1c0987730b710a2c05/analysis/1406903049/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mannequin%20Follower%201_0-17335-1-0.7z?fid=62363&ttl=1535783348&ri=8192&rs=8192&setec=d0584dc78e0e75ef6f799f808b356687"
    }
  ]
}