{
  "modId": 17336.0,
  "modName": "SEOP - Skyrim Enhanced Options",
  "summary": "With this tool I aim to create a clone of Skyrim Options window with far more detailed settings, extra options and tweaks without compomising the user-friendly interface, minimal design, compact file size and functionality to get the most out of this awesome game.",
  "descriptionHtml": "[center][img]http://s16.postimage.org/ygtk0ppth/baslik.png[/img][/center]\r\n\r\n\r\n\r\n[img]http://s14.postimage.org/lwobipeo1/whatis.png[/img]\r\nThe vanilla options window in Skyrim lacks quite a lot of vital things so the users are forced to browse \\\"Skyrim.ini\\\" and \\\"SkyrimPrefs.ini\\\" files, edit them individually by finding values among a long list. I aim to solve this problem by creating a clone of Skyrim Options window with far more detailed settings, extra options, tweaks without compomising the user-friendly interface, minimal design, compact file size and functionality to get the most out of this awesome game. You won\\'t need to touch your .INI files for tweaking again because everything will be under your control thanks to SEOP. Storing and loading custom .ini files, extra options for low-end and high-end PCs are among the features of this tool. \r\n\r\n[img]http://s14.postimage.org/y45u5hoqp/features.png[/img]\r\n[ul]\r\n[*]Über graphics preset for hardcore gamers: If Ultra wasn\\'t enough for you, get ready for Über option! SEOP unleashes Skyrim\\'s vanilla graphics settings and provides Über option for shadows,decals,particles and more! \r\n[*] Suggested Hardware: SEOP checks your settings and tells you which hardware runs your game fluidly and how much video ram you need instead of detecting your hardware and forcing settings according to them. Nobody can change your settings without asking you first because you\\'re the boss!\r\n[*]Makes Skyrim more suitable for very old and high-end PCs: The View Distance tab was enhanced to provide more variety in distance control. Now you can set the item, actor, object, light fade distance values lower or higher than vanilla Skyrim values with a click of button.\r\n[*]Manage your settings: Built-in profile manager allows you to create unlimited profiles each tied to a different settings preset. SEOP stores your profiles categorized and clean. For instance you won\\'t have to deal with decreasing or increasing graphics after overclocking or while on battery. Simply create profiles for your settings and load back when needed!\r\n[*]No more INI tweaking: SEOP has all the important settings that vanilla Skyrim options lacks. So you won\\'t be looking for SkyrimPrefs.INI and Skyrim.INI any further. \r\n[*] Provides expert tweaks: Set your default FOV, enable/disable crosshair or compass,quest marks, disable Bethesda intro.\r\n[*]Other features: Change audio settings and controls, German and Turkish language support and many more..\r\n[/ul]\r\n\r\n[img]http://s18.postimage.org/69q62mbo9/dev.png[/img]\r\n\r\nI added the Alpha version for testing purposes. Please DO NOT judge this utility by looking at its current state. The finalized version will have much more features with a better, polished interface.\r\n\r\nCurrently SEOP is in v0.50 Alpha stage and it is semi-functional. It reads your settings and reflects them on the interface but [u]partly write your settings to original INI files[/u]. I\\'m still working out kinks and fixing the bugs. Soon the beta version will be available for download. The beta will be a full featured version so expect no less.\r\n\r\nIf you would like to contribute to the project you can download the ALPHA version and test it on your computer. Please inform me if you find any bugs and make sure you include the information to reproduce the bug. You may also visit my blog: caganscorner.blogspot.com Thank you!\r\n\r\n[center][img]http://s13.postimage.org/9otcbidc7/line.png[/img][/center]\r\nCHANGE LOG (you can find the complete change log in the main file):\r\n\r\n[b]Alpha 0.55[/b]\r\n\r\n-Some typos fixed.\r\n-Clicking Save&Play now saves your settings as it should.\r\n-Clicking default now restores your settings back to default as it should.\r\n-You\\'ll see a notification at the bottom of Seop\\'s window if your profile is loaded successfuly.\r\n-Compatibility with other ini editors (i.e. skyrim configurator) has been improved. \r\n-Disable Autosave feature of Skyrim removes all autosave features. But in SEOP, it is represented as if it only disables autosave interval. This bug has beeen fixed.\r\n-Low,Medium,High,Ultra,Über buttons now command all graphical settings.\r\n\r\nKnown issues\r\n-Showing/hiding Bethesda intro doesn\\'t work.",
  "categoryId": "39",
  "version": "v0.55",
  "author": "Cagan Celik",
  "createdUnix": "1337452136",
  "updatedUnix": "1338113056",
  "containsAdultContent": false,
  "uploadedBy": "CaganTheMan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "63955",
      "name": "SEOP - Skyrim Enhanced Options",
      "version": "0.55",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "193",
      "fileName": "SEOP - Skyrim Enhanced Options-17336-0-55.rar",
      "uploadedUnix": "1338113056",
      "modVersion": "0.55",
      "virusScanUrl": "https://www.virustotal.com/file/5c6c37b93a70ac6b4a43057379414d76c9b1b90de67eda603e9c1c74a632e676/analysis/1406918223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SEOP%20-%20Skyrim%20Enhanced%20Options-17336-0-55.rar?fid=63955&ttl=1535783350&ri=8192&rs=8192&setec=bf551d0331847d029022a38c6d2746cc"
    }
  ]
}