{
  "modId": 17353.0,
  "modName": "The Revenge of Colette - Powers and Spells for Discerning Adventurers",
  "summary": "ABANDONED MOD. I am now updating Shouts Unleashed instead. http://skyrim.nexusmods.com/mods/38034/?",
  "descriptionHtml": "[b]ABANDONED MOD. I am now updating [url=http://skyrim.nexusmods.com/mods/38034/?]Shouts Unleashed[/url] instead. It\\'s a lot less mechanically \\\"quirky\\\" and goes with straight up function instead.[/b]\r\n\r\n[center][img]http://i.imgur.com/U3H9G.png[/img][/center]\r\n[center]Stances & Tactical Combat - Lore & Adventure Friendly - Support for Hybrids and Pures - Focused Spell List - Constant Balance Updates\r\n\r\n[url=http://www.reddit.com/r/skyrim/comments/v5uf8/mod_the_revenge_of_colette_powers_magic_spells]Vote us up on Reddit![/url][/center]\r\n\r\nWelcome to The Revenge of Colette, where every school is a perfectly valid school of magic! Though there are many good spell packages available for Skyrim, it is my firm belief that The Revenge of Colette cannot settle for being merely good - we\\'re out here to be the best. That means we do things a little differently here:\r\n[b]This mod has been abandoned for another project. I\\'ve dropped a lot of the quirky, heavily scripted effects for smoother/less temperamental performance and focused purely on Shouts. Please visit [url=http://skyrim.nexusmods.com/mods/38034/]Shouts Unleashed[/url].[/b]\r\n\r\n[center][youtube]V08-wutux_c[/youtube] [youtube]_p5SVW0nhR8[/youtube][/center]\r\n\r\n[center][img]http://i.imgur.com/Ziv14.png[/img][/center]\r\n• [b]Everyone\\'s Magical![/b] The Revenge of Colette can lay sole claim to the creation of Magic Stances, techniques which enhance mages and take hybrid spellcaster gameplay to the next level. We\\'ve added a handful of carefully selected spells equipped to the voice key - not on the shout cooldown - to make full use of this.\r\n• [b]Combo Power![/b] Use the unique Focus system to chain together your attacks for maximum awesome - just make sure to carefully weigh when you use your abilities so they\\'re not wasted.\r\n• [b]Immersive and Entertaining![/b] We believe that good spell design does not have to conflict with lore-friendly spell design, and each and every one of our spells is written with the principle that it should look cool in a movie, make sense in a book, and be fun in a game.\r\n• [b]Small Spell List![/b] The Revenge of Colette is made with a handful of heavily-vetted spells, so you won\\'t find yourself overwhelmed with an overly unfamiliar spell list. Each of these few spells is intended to be worth the time it took to draw them and the time it will take to sheath them later.\r\n• [b]Adventure![/b] Every single one of the new spells in Revenge of Colette comes in a fully readable tome or on a piece of paper that adds to the feel of the world, and the spells aren\\'t located at vendors, but throughout the world.\r\n• [b]Ease![/b] ...But if you don\\'t want to go all over Skyrim, I\\'ve included a method to just get everything from the get-go, no restrictions. Just look up \\\"Debugger\\'s Revenge\\\" in the command console - grab that book, open it, you\\'ll get every single book written for this mod.\r\n\r\n[center][img]http://i.imgur.com/KowrT.png[/img][/center]\r\nA Revenge of Colette exclusive feature, stances benefit every type of combat gameplay there is. They will change the way you play, the way you look at your spells, and - for Destruction Mages - the meaning of your elemental specializations. They all follow a basic gameplay structure:\r\n\r\n[b]Voice Button:[/b] Typically increases focus by one, has additional benefit. Nine-second cooldown.\r\n[b]Unleash:[/b] Press the Voice Button while you have maximum focus.\r\n[b]Power[/b] and Bow Attack: Costs 2 to 6 focus (depending on stance) and unleashes a powerful benefit.\r\n[b]Melee Attacks:[/b] Add one focus.\r\n[b]Bow Bashes:[/b] Add two focus.\r\n[b]Cast Spell:[/b] Add two focus.\r\n[b]Passive:[/b] Passive perk benefit in this stance.\r\n\r\nTo learn the stances, you must first read Aela\\'s Note in Jorrvaskr. Use the spell it teaches you at each of the seven places of power - then while the spell is active, shoot a full power arrow into the sun.\r\n\r\nThe locations of the seven stances are detailed along with the rest of the spells in the next section. In-game, you get a handy guide with each of your stances that will explain how to make best use of them, so don\\'t worry if you feel a little overwhelmed!\r\n\r\n[b]Known Issue Alert![/b]\r\nStances will not function correctly with the perk that gives bleed damage to axes. While a stance is active, the bleed perk will not function. This is okay, because that perk is terrible and you shouldn\\'t take it anyway.\r\n\r\n[font=helvetica][size=3][b]Ansei\\'s Return (Quest)[/b][/size][/font]\r\n[b][Spell] Visions of the Sun Soul:[/b] Once you\\'ve completed your quest and have learned all seven stances, this spell continues to be useful, allowing you to clear away clouds and inclement weather to get a perfect view of the sun, moons, or stars.\r\n\r\n[font=helvetica][size=3][b]Sybille\\'s Revenge (Destruction)[/b][/size][/font]\r\n[size=\\\"1\\\"]\\\"There are worse things than death.\\\"[/size]\r\n[b]In-Game Hint Location:[/b] Table by Sybille\\'s usual place in the Blue Palace.\r\n\r\n[b][Stance] Pyroclasmic Might:[/b]\r\n- Meditation (Ignite): Recovers 20% Magicka, gain 1 focus. Can only be used once every nine seconds.\r\n- Unleash (Prominence): Release a blast of power, knocking away most creatures within 25 feet. They may take significant damage from falling.\r\n- Melee Attack: Gain 1 focus.\r\n- Bow Bash: Gain 2 focus.\r\n- Spellcast: Gain 2 focus.\r\n- Power Attack: Spend 2 focus to deal 50% extra damage and knockback the target.\r\n- Power Shot: Spend 2 focus to deal 50% extra damage and knockback the target.\r\n- Passive (Lingering Flames): Periodic fire damage from spells and enchantments lasts ten times as long.\r\n- Location: The Atronach Stone\r\n\r\n[b][Stance] Glacial Serenity:[/b]\r\n- Meditation (Chill): Immune to damage and have 100% Magicka absorb for 2 seconds. Gain 1 Focus. Can only be used once every nine seconds.\r\n- Unleash (Frigid): Nearby creatures are disarmed and 50% more vulnerable to frost damage for 2 minutes. Multiple casts stack.\r\n- Melee Attack: Gain 1 focus.\r\n- Bow Bash: Gain 2 focus.\r\n- Spellcast: Gain 2 focus.\r\n- Power Attack: Spend 2 focus to slow the target.\r\n- Power Shot: Spend 2 focus to slow the target.\r\n- Passive (Lingering Frost): Slowing effects last four times as long.\r\n- Location: The Tower Stone\r\n\r\n[b][Stance] Thundering Speed:[/b]\r\n- Meditation (Spark): Places a nest of lightning at your feet. This spark staggers anyone who walks into it. Gain 1 Focus. Can only be used once every nine seconds.\r\n- Unleash (Blitz): Increase Power Attack Damage, Spell Magnitude, and Stamina and Magicka Costs for both by 33% for 6 seconds.\r\n- Melee Attack: Gain 1 focus.\r\n- Bow Bash: Gain 2 focus.\r\n- Spellcast: Gain 2 focus.\r\n- Power Attack: Spend 2 focus to slow time by 40% for 6 seconds.\r\n- Power Shot: Spend 2 focus to slow time by 40% for 6 seconds.\r\n- Passive (Sudden Shock): Shock spells and enchantments deal 33% more damage.\r\n- Location: Deep Folk Crossing\r\n\r\n[b][Spell] Entropy:[/b] Short-range frost concentration spell, one-handed. Steals 60 health/sec. 5% chance of flash paralysis every second on the target. Has a 0.5s cast time but a high magicka cost. Located in a cell in the Solitude Jail.\r\n[b][Spell] Heatwave:[/b] Long-range fire and forget. One-handed. Staggers the targets and hits them with 100% Magic Vulnerability for 15 seconds. Augmented Flames increases to 150%. Pyroclasmic Might stance extends to 150 seconds. Deals no damage. Cannot be dualcast. Located in the start of Shadowgreen Cavern\r\n[b][Spell] Static Cling:[/b] Short-range two-handed concentration spell with a 1.5s cast time. Roots you, makes you heal from shock damage, deal high damage to anyone in melee range and grips/holds the nearest target in melee range. You can throw them at the end of the cast. Located at Thalmor Justicar HQ in Solitude.\r\n\r\n[font=helvetica][size=3][b]Colette\\'s Revenge (Restoration)[/b][/size][/font]\r\n[size=1]\\\"Restoration is a [u]perfectly valid[/u] school of magic!\\\"[/size]\r\n[b]In-Game Hint Location:[/b] Colette\\'s Room in the College.\r\n\r\n[b][Stance] Radiant Flash:[/b]\r\n- Meditation (Light): You recover 15% health. Improves with perks. Gain 1 Focus. Can only be used once every nine seconds.\r\n- Unleash (Miracle): You and nearby allies recover 50% Health immediately. Works with perks. Destroys all nearby undead at 40% health or lower.\r\n- Melee Attack: Gain 1 focus.\r\n- Bow Bash: Gain 2 focus.\r\n- Spellcast: Gain 2 focus.\r\n- Power Attack: Spend 2 focus to deal 50% extra damage. Undead targets are turned.\r\n- Power Shot: Spend 2 focus to deal 50% extra damage. Undead targets are turned.\r\n- Passive (Reflection): Ward spells cost 50% less magicka and reflect projectile spells. If used with Mirror Ward, doubles the magnification strength.\r\n- Location: The Shrine of Meridia\r\n\r\n[b][Spell] Noble Sacrifice:[/b] Frees captured souls from soul gems, granting you a boon. Located on the top of a bandit tower halfway between Bleak Falls and Riverwood.\r\n[b][Spell] Sanctified Blood:[/b] Use your health to slow and damage nearby undead. Turns undead of any level while concentrating. This spell can be found in Colette\\'s room itself.\r\n[b][Spell] Smothering Radiance:[/b] Fires a beam that overloads the target\\'s heart. This spell can be found at Boethiah\\'s Sacellum near Windhelm. Requires 60 Restoration to learn.\r\n[b][Spell] Mystic Circle:[/b] Create a sanctuary that heals you when attacked by anyone not in the sanctuary. This spell can be found at the Shrine to Mara inside of Nightcaller Temple. Requires 90 Restoration to learn.\r\n[b][Spell] Mirror Ward:[/b] Two-handed ward reflects enemy spells at magnified damage, knocks back melee attackers. This tome is located at the Beacon of Stendarr near Riften. Requires 90 Restoration to learn.\r\n\r\n[font=helvetica][size=3][b]Tolfdir\\'s Revenge (Alteration)[/b][/size][/font]\r\n[size=\\\"1\\\"]\\\"Fascinating, simply fascinating!\\\"[/size]\r\n[b]In-Game Hint Location:[/b] Tolfdir\\'s Room in the College.\r\n\r\n[b][Stance] Clarity Wave:[/b]\r\n- Meditation (Continuum): For four seconds, halve the cost of all spells. Gain 1 Focus. Can only be used once every nine seconds.\r\n- Unleash (Transcendence): Become a ghost immune to all damage for six seconds. Affected by perks.\r\n- Melee Attack: Gain 1 focus.\r\n- Bow Bash: Gain 2 focus.\r\n- Spellcast: Gain 2 focus.\r\n- Power Attack: Spend 6 focus to create a singularity that sucks in nearby creatures for several seconds.\r\n- Power Shot: Spend 6 focus to create a singularity that sucks in nearby creatures for several seconds.\r\n- Passive: None\r\n- Location: Solitude Lighthouse Exterior\r\n\r\n[b][Spell] Spectral Hound:[/b] Turn into a ghost dog that moves fast and can carry more weight. Reagent improves the spell. This tome is located in Jorrvaskr Basement.\r\n[b][Spell] Barkflesh Curse:[/b] Weakens the victim, and may turn them into a tree, permanently. Reagent improves the spell. This tome is located in the Eldergleam Sanctuary, by Sond.\r\n[b][Spell] Synthesize Varla Stone:[/b] Create soulgem substitutes that don\\'t require you to kill people. This tome is located in the Thalmor Headquarters in Solitude.\r\n[b][Spell] Spatial Shenanigans:[/b] Strip the target naked and steal all their non-quest stuff. Also make them fall. This tome is located in Haelga\\'s Room at the Bunkhouse in Riften. Requires 90 Alteration to learn.\r\n\r\n[font=helvetica][size=3][b]Drevis\\' Revenge (Illusion)[/b][/size][/font]\r\n[size=\\\"1\\\"]\\\"So does that mean you can see me?\\\"[/size]\r\n[b]In-Game Hint Locations:[/b] Nightcaller Temple and Drevis\\' Room in the College.\r\n\r\n[b][Stance] Chaos Omen:[/b]\r\n- Meditation (Flicker): Immediately become invisible and muffled for six seconds. Gain 1 Focus. Can only be used once every nine seconds.\r\n- Unleash (Doom): Living creatures and people within 80 feet are spontaneously filled with dread; if the magical influence is not removed within forty-five seconds, they die of brain failure. Master of the Mind cannot affect this ability\r\n- Melee Attack: Gain 1 focus.\r\n- Bow Bash: Gain 2 focus.\r\n- Spellcast: Gain 2 focus.\r\n- Power Attack: Spend 2 focus to enrage the target, increasing their swing speed but sharply dropping their movement and magicka. Benefits from perks.\r\n- Power Shot: Spend 2 focus to enrage the target, increasing their swing speed but sharply dropping their movement and magicka. Benefits from perks.\r\n- Passive (Aglay): 10% chance to ignore melee or spell damage.\r\n- Location: Geirmund\\'s Hall Exterior\r\n\r\n[b][Spell] Foolhardy:[/b] Buffs the targets for 30 seconds with increased health, stamina, and confidence; when the effect ends, they take damage equal to 150% the damage they took while the buff was active.\r\n[b][Spell] Dream Eater:[/b] Daze a target who is not in combat, making them oblivious to anything but taking damage. Feed off of their Magicka. Requires 35 Illusion to learn.\r\n[b][Spell] Autohypnosis:[/b] Retreat into the sanctum of your own mind. When you return, you may receive a minor heal. Your mind has some interesting things in it... Requires 60 Illusion to learn.\r\n[b][Spell] Kleptomagicka:[/b] Steal the target\\'s knowledge of magic, silencing them for 60 seconds and improving your own spells. Requires 90 Illusion to learn.\r\n\r\n[font=helvetica][size=3][b]Falion\\'s Revenge (Illusion)[/b][/size][/font]\r\n[size=\\\"1\\\"]\\\"These arts are a pathway to many abilities some consider to be... unnatural.\\\"[/size]\r\n\r\n[b][Stance] Shadow Self:[/b]\r\n- Meditation (Center): Marks where you stand with your soul.\r\n- Unleash (Kismet): Immediately return to where you last Centered yourself.\r\n- Melee Attack : Gain 1 focus.\r\n- Bow Bash: Gain 2 focus.\r\n- Spellcast: Gain 2 focus.\r\n- Power Attack: Spend 4 focus to deal double damage with a Bound or Mystic Weapon.\r\n- Power Shot: Spend 4 focus to deal double damage with a Bound or Mystic Weapon.\r\n- Passive (Spirit Blade): Improve your Bound and Mystic Weapons based on your Conjuration skill. Requires a minimum of 35 Conjuration.\r\n- Location: The Ritual Stone\r\n\r\n[font=helvetica][size=3][b]Installation[/b][/size][/font]\r\nTo install, simply unpack the mod and drop it into your Data folder. Whenever you feel you don\\'t want to use the mod or uninstall it, get rid of any files that begin with the words \\\"ColettesR\\\" :)\r\n\r\n[center][img]http://i.imgur.com/V7ZTI.png[/img][/center]\r\nThis is not a list of every mod I like or use or would recommend; this just handles the mods that I think are pertinent to this mod, particularly (but not only) its sense of balance.\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=16225]Apocalypse Spell Package, by EnaiSiaion[/url]\r\nGives a fantastic array of new spells. I\\'ll be aiming to build my spells around what Enai offers, rather than to replace. He also offers a much larger selection, while I focus on a handful of multipurpose spells.\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=1269]PISE (Pluto\\'s Improved Skyrim Experience), by Pluto[/url]\r\nImproves the Enemy AI.\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=2700]Duel - Combat Realism, by LogRaam[/url]\r\nAdds depth to the melee combat system, making stamina more important.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/17232]Vibrancy ENB Series[/url]\r\nI\\'m not really the sort of person into most ENBs, but this one caught my eye - it\\'s very pretty and pretty good on the resource situation, and the mod authors are nice people.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/18765]Ergonomics\\' Revenge[/url]\r\nMy own little control map for the 360 Controller. I personally find it more suitable for combat than most of the ones uploaded here, and it\\'s what I playtest with.\r\n\r\n[center][img]http://i.imgur.com/rZIu4.png[/img][/center]",
  "categoryId": "75",
  "version": "4.1",
  "author": "AstralFire",
  "createdUnix": "1337471077",
  "updatedUnix": "1340971751",
  "containsAdultContent": false,
  "uploadedBy": "AstralFire",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70327",
      "name": "The Revenge of Colette v4_0",
      "version": "v4.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "236",
      "fileName": "The Revenge of Colette v4_0-17353-v4-0.rar",
      "uploadedUnix": "1340668422",
      "modVersion": "v4.0",
      "virusScanUrl": "https://www.virustotal.com/file/f1221bc9295a0fe3affbd4eb5863f15ff401228526e3096d825a620727fc3cf0/analysis/1406983086/",
      "changelogHtml": " All Inner Magic skills have been deprecated, as they&#39;ve been absorbed into the stances. They still exist in game code to prevent errors, but will eventually be removed. <br/> \n On loading into the game, you will have these abilities removed from your spell list. <br/> \n Corrected a critical error in Autohypnosis that prevented it from working accurately. <br/> \n I added a crapton of stuff, dudes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Revenge%20of%20Colette%20v4_0-17353-v4-0.rar?fid=70327&ttl=1535783372&ri=8192&rs=8192&setec=8938f3928e2659242b50db897dfafa88"
    },
    {
      "fileId": "70387",
      "name": "The Revenge of Colette v4_0_a",
      "version": "v4.0a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "235",
      "fileName": "The Revenge of Colette v4_0_a-17353-v4-0a.rar",
      "uploadedUnix": "1340713758",
      "modVersion": "v4.0a",
      "virusScanUrl": "https://www.virustotal.com/file/72f838136dc58b2acd92ffdcb3645594c248db3d88240260d43aabf284dde5d7/analysis/1406983807/",
      "changelogHtml": " Bugfixes <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Revenge%20of%20Colette%20v4_0_a-17353-v4-0a.rar?fid=70387&ttl=1535783372&ri=8192&rs=8192&setec=1148eb6a2541e7e099b181767e8dac28"
    },
    {
      "fileId": "70576",
      "name": "The Revenge of Colette v4_0_b",
      "version": "v4.0b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "237",
      "fileName": "The Revenge of Colette v4_0_b-17353-v4-0b.rar",
      "uploadedUnix": "1340798990",
      "modVersion": "v4.0b",
      "virusScanUrl": "https://www.virustotal.com/file/4e02362b0de3eb451d16f6b15145dd746d94eed072f28e9a46cd099cd486a99f/analysis/1406985843/",
      "changelogHtml": " Casting spells outside of combat while in a stance will no longer increase Focus. <br/> \n Stances now end (not merely run out of charges) when it&#39;s been sixty seconds since the last Focus building or spending abilities. <br/> \n Stance Tomes now teach the End Stance power, which allows the player to exit the stance system completely as if they had just waited sixty seconds. <br/> \n Power Shots from bows gained some wiggle room in case people misjudged whether or not their bow was fully drawn. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Revenge%20of%20Colette%20v4_0_b-17353-v4-0b.rar?fid=70576&ttl=1535783373&ri=8192&rs=8192&setec=1893852f18858d5fc0b375dcb8c1fc6c"
    },
    {
      "fileId": "70762",
      "name": "The Revenge of Colette v4_1",
      "version": "v4.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "239",
      "fileName": "The Revenge of Colette v4_1-17353-v4-1.rar",
      "uploadedUnix": "1340897907",
      "modVersion": "v4.1",
      "virusScanUrl": "https://www.virustotal.com/file/468f8db1a07bf6db5f792df980418cbf4b1136b7fa8c98a555e4c6c8cad1ede2/analysis/1406988004/",
      "changelogHtml": " Three new spells added to Destruction: Heatwave, Entropy, and Static Cling. <br/> \n Fixed a bug which would cause the Axe perks to break stances. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Revenge%20of%20Colette%20v4_1-17353-v4-1.rar?fid=70762&ttl=1535783373&ri=8192&rs=8192&setec=9e6ae6a913e1eb9310dd3ca9ea23ca56"
    },
    {
      "fileId": "71003",
      "name": "-BETA- The Revenge of Colette v4_1_a",
      "version": "v4.1a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "236",
      "fileName": "-BETA- The Revenge of Colette v4_1_a-17353-v4-1a.rar",
      "uploadedUnix": "1340971751",
      "modVersion": "v4.1a",
      "virusScanUrl": "https://www.virustotal.com/file/fc8c28981089b1dd48be9238deed7e017035bc43a9f6fcf31bed1d7cf8a3067c/analysis/1406990134/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/-BETA-%20The%20Revenge%20of%20Colette%20v4_1_a-17353-v4-1a.rar?fid=71003&ttl=1535783374&ri=8192&rs=8192&setec=79289fc37fe6155f84b76fa267761b41"
    }
  ]
}