{
  "modId": 17352.0,
  "modName": "Honour of the Orcs - Orc overhaul",
  "summary": "A Orc overhaul, with followers, enemies, bosses, and your own Orcish longhouse!",
  "descriptionHtml": "Hello everyone, I have made another new mod! This mod is based around orc\\'s. I thought the game needed more orc followers so here you are! Right then, wish me luck as i try to make this lore friendly lol, \\'Clears throat\\'. \r\n\r\nDuring the wars between Akavir and Tamriel(True story), Countless number of orc\\'s were involved dues to their combat skills. any slightly off lore, The lands of Orsinium Created their own elite unit. These soldiers went on a undercover mission in to Akavir to kill a high ranking General. While they were sneaking in the tree\\'s outside the camp, they were jumped by the Akavir\\'s. These Akavir\\'s however did not want war, they wanted to escape, and promised to show the orc\\'s their combat ways to help fight Akavir with Akavir. The orc\\'s escorted them back to Orsinium. The Akavir then went on to train Military units the ways of combat with their swords and armour, and how to build buildings in their way. Few Know this (non)fact and the rest of Tamriel just assume the orc\\'s invented it themselves. But every orc remembers what happened.\r\n\r\nI know that was pretty much a load of un-lore rubbish, but there has to be a story don\\'t there?\r\n\r\nAs for frost orc\\'s, lets just say they used the power of ice to \\\"Enhance\\\" themselves.\r\n\r\n--------------V 1.0-----------------\r\n\r\nThe Followers-\r\n\r\nShuji-Gro-Bah - A Orc who honours Ancient traditions. Found in the alchemists shack. Has a unique Akarivi katana called \\\"Shuji\\'s Honour sword\\\", enchanted with absorb health. Levels with player. Wears blue robes and orcish boots. Enemies with Kotar\r\n\r\nGro-Gro-Huh - A Beast of a frost orc, levels with player, Found at Dead Men\\'s Respite fighting off Rabid Plague Khajiit\\'s. he has a Cold enchanted ebony war axe and ebony armour without helm\r\n\r\nEager orc\\'s - Two orc\\'s, found in Bee and barb in Riften and Bannered mare in Whiterun. Random armour and weapons.\r\n\r\nKotar - A Large orc. Found at Winterholds jarl\\'s long house. Has set of iron armour with no helm and a unique orcish great sword called \\\"Kotar\\'s sword\\\", with no abilities. Enemies with Shuji.\r\n\r\nEnemy\\'s-\r\n\r\nBlood red Fred - A huge Blood red orc, found in Honeystrand Grove near the alchemists shack, along with other, smaller samurai orc\\'s. He is armed with a unique Akarivi Katana call \\\"Fred\\'s blood red\\\" Which does fire damage, don\\'t go after this guy if you are bellow lvl 25 (His level) On his Body there will be \\\"Blood red freds skull\\\" which is worth 7000 septims.\r\n\r\nHetario Samurai - Light red samurai orc\\'s, armed with Akarivi katana\\'s. Dressed in red and white robes, boots and either a falmer, orcish or no helmet. Also found at honeystrand grove.\r\n\r\n--------------V 2.0-----------------\r\n\r\nFollowers - \r\n\r\nEager orc - One more Eager orc added to Winking Skeever.\r\n\r\nEnemy\\'s -\r\n\r\nDinosaur Derek - Found at Yogrim overlook, he is level 35, has a unique sword called \\\"Dino Dereks Razor\\\" which is enchanted with fear. He is guarded by Hetario Samurai.\r\n\r\nAnd now, for a very special Suprise!\r\n\r\nYour own Longhouse!!!\r\n\r\nYour longhouse called \\\"Honour Longhouse\\\" Can be found near Whiterun (See Pictures) Outside there is a fully functioning Forge. Inside there is a cooking spit, enchanting table, alchemy lab, 2 tables for followers to eat and drink, a room with 3 beds for followers, and your own room with a weapon plaque above the bed. All containers are safe to use. Have fun!\r\n\r\n--------------Bugs-----------------\r\n\r\n-The longhouse world model will not appear until you enter the door, then come back out again (Conformation please?)\r\n\r\n- Weapon rack dont work\r\n\r\n-The dresser has 12 of every ingot in (Not intended)\r\n\r\nThats as far as I know, tell me if theres more.\r\n",
  "categoryId": "66",
  "version": "2.0",
  "author": "Madcrazy56",
  "createdUnix": "1337469746",
  "updatedUnix": "1337544224",
  "containsAdultContent": false,
  "uploadedBy": "madcrazy56",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62412",
      "name": "Honour of the Orcs V 1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1299",
      "fileName": "Honour of the Orcs V 1-17352.rar",
      "uploadedUnix": "1337469819",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/401a4df7fd78d27143a9188968d89fed0475d6276d7fef57e44e92c831bd430d/analysis/1406903474/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Honour%20of%20the%20Orcs%20V%201-17352.rar?fid=62412&ttl=1535783370&ri=8192&rs=8192&setec=a7825a47bea152c5a5e58e0d7ba84fde"
    },
    {
      "fileId": "62606",
      "name": "Honour of the orcs V 2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1627",
      "fileName": "Honour of the orcs V 2-17352-2-0.rar",
      "uploadedUnix": "1337544224",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/9de230dbf7f1bf9040fbff993693e47f3c68557c224145abbf29d1a66cd55764/analysis/1406905568/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Honour%20of%20the%20orcs%20V%202-17352-2-0.rar?fid=62606&ttl=1535783371&ri=8192&rs=8192&setec=d4938369d8fa2b42ec73e9f602affd88"
    }
  ]
}