{
  "modId": 17360.0,
  "modName": "Claimants Mark aka a Respawn Blocker",
  "summary": "This will let you set up a marker that will prevent NPC respawns in a given location.",
  "descriptionHtml": "With this mod, you can set up a maker that will toggle the cleared marker on a space every 15 seconds. As a result, if you wait at least 15 seconds (not in menu) for each 10 days that you rest, it will prevent a respawn in that area. If you wait 10 days straight, you may still experience one. This is an experiment on how to prevent spawns from inside the game and will let you effectively claim an area as your own.\r\n\r\nClaimant\\'s Right\r\nA Mod by Draxis aka Vince Von Graff\r\n\r\nInstallation - Drop it all in your data folder and activate the mod in your preferred mod program or at the splash screen on start up.\r\n\r\n\r\nThis mod is very simple, and is a bit of a thought experiment. You can find the claimant\\'s marker in a chest on the steps of the Sleeping Giant Inn in Riverwood. To set it up, you activate it and then hit set up. Then activate the mark (it will appear as a rug). This will prevent a cell reset wherever the marker is. The script runs every 15 seconds, so if you wait 10 days straight, you may still get a respawn, if this proves to be an issue, I can change it.\r\nTo pick up the mark, sneak and activate it. \r\n\r\nThis mod doesn\\'t give you possession over items in the space. It doesn\\'t kill all actors. It is a very simple mod and I don\\'t plan to do much with it, but it should work for allowing you to take over an area that you are interested in. Have fun.\r\n\r\nDraxis",
  "categoryId": "28",
  "version": "1.0",
  "author": "Vince Von Graff aka Draxis",
  "createdUnix": "1337477876",
  "updatedUnix": "1337478572",
  "containsAdultContent": false,
  "uploadedBy": "Vince Von Graff",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62432",
      "name": "Claimants Mark",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "Claimants Mark-17360-1-0.zip",
      "uploadedUnix": "1337478572",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a7bd896736ebb2a8adaeb68de497dac160504404b4b6c5d663004f5deab850c7/analysis/1406903704/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Claimants%20Mark-17360-1-0.zip?fid=62432&ttl=1535783383&ri=8192&rs=8192&setec=7574e959fb85baa334b6b094d40535d7"
    }
  ]
}