{
  "modId": 17371.0,
  "modName": "TCSO - Total Carryweight System Overhaul",
  "summary": "Have you ever wondered where your character puts all this stuff he carries with him? Carrying dozens of weapons, armors and so on and still being able to fight? Maybe you are strong enough to carry 10 swords at once, but where to store them? If this questions sound familiar to you and you want to make your gameplay as immersive as possible.",
  "descriptionHtml": "IMPORTANT: Please READ the installation instructions AND FOLLOW them.\r\n\r\n-----------------------Mod Description----------------------------------\r\nHave you ever wondered where your character puts all this stuff he carries with him? Carrying dozens of weapons, armors and so on and still being able to fight? Maybe you are strong enough to carry 10 swords at once, but where to store them? If this questions sound familiar to you and you want to make your gameplay as immersive as possible, my mod is ideal for you.\r\n\r\n1. Instead of just looking for the weight, I have capped the number of items of a specific type you can carry with you. If you are carrying to many items of one type, you get an invisible item that adds 1000 weight to make you overloaded. If you want to know which weight you are truly carrying simply ignore the 1 at the beginning and you will see the true weight (for example 110 or whatever).\r\nThe concrete numbers are:\r\n2 Daggers\r\n2 Onehanded-Weapons (Pickaxes and Woodcutteraxes do not count towards these values)\r\n1 Twohanded-Weapon (Pickaxes and Woodcutteraxes do not count towards these values)\r\n2 Bows\r\n2 Sets of light armor\r\n1 Set of heavy armor\r\n20 Potions/Poisons\r\n10 Books\r\n30 Arrows\r\nMisc items are still handled by weight and not by count.\r\nAll numbers can be changed independently via the ingame book menu.\r\n\r\n2. The starting MaxCarryWeight of different races are changed to:\r\nArgonians 100\r\nBreton 110\r\nDarkElf 105\r\nHighElf 90\r\nImperial 110\r\nKhajit 85\r\nNord 120\r\nOrc 130\r\nRedguard 120\r\nWoodelf 110\r\n\r\n3. The Steedstone only grants 30 instead of 100 MaxCarryWeight increase.\r\n\r\n4. Potions and Enchantments which increase MaxCarryWeight are lowered to about half their vanilla value.\r\n\r\n5. Bagpacks added (They are not my work but from the sabre gear backpack mod. Check Thanks at the bottom of this page). The backpacks can be crafted (leather). The resource cost is nearly doubled compared to the original mod.\r\nA \\\"packed traveler\\\" is added to the Bannered Mare in Whiterun. She sells the backpacks for 2000-4000 gold (at lvl 15 speechcraft).\r\nUse the standard Survivors bag if you no not want the bag to display on you character (the effects still take place).\r\n\r\n6. A book is added to the player when the mod is first loaded. It is called \\\"Weight Of The World\\\". When reading, it gives menus to select you own values (my recommended ones are marked).\r\n\r\n7. You can use the book menu to pause or reset the mod (only actual item count is reset, the MaxItemCount numbers you have changed are untouched).\r\n\r\n------------------ Installation Instructions----------------------------------\r\nVERRY IMPORTANT: Before enabling the esp, load your savegame, put all you are carrying into a container. Then save, quit the game, enable the esp and load your newly created save. Then simply open the container and take back your things.\r\nThis is only necessary when installing the mod because I do not know a way to classify the items in the players inventory. This should not be asked too much for a big Carrysystem Overhaul.\r\n\r\nNMM\r\nIt is best to download the esp and the script with the NMM. The NMM automatically puts everything where it belongs.\r\n\r\nManual Installation\r\nDownload the archive and unpack it. Put the esp in you Data folder and the scripts into your Data\\\\Scripts folder. Activate the esp in the launcher.\r\n\r\n\r\n------------------ Uninstallation Instructions----------------------------------\r\nJust remove the esp and the script, it will not damage your savegame.\r\n\r\n\r\n------------------Compatibility----------------------------\r\nThis mod should be compatible with everything.\r\nIf you want to use a mod that changes something about vanilla bound weapons, load my mod before it, so that my changes will be overwritten. This will make it nescessary to decrease the actual weapon count manual (via the book menu).\r\n\r\n\r\n------------------ Things to do----------------------------------\r\n- Find a way to change the MaxCarryWeight increase when choosing stamina while leveling up from 10 to 5 without changing the health and magicka increase.\r\n- Maybe slow your attacks down when you are nearly carrying as much as you can (weight-wise).\r\n- Make an NPC that the player can hire. He comes with you and takes loot but does not fight. He might bring this loot back to your horse or even sell it. Of course you will have to pay a loan for him.\r\n- Limit the number of ingredients. BUT: ingredients do not share a common keyword. My script works via keywords and I would have to change all ingredients and add a keyword, which would make my mod incompatible with many alchemy mod.\r\nSo I am not going to do this as long as I will not find a different way to check if a picked up item is an ingredient.\r\n\r\n\r\n------------------ Known issues----------------------------------\r\n- When you are carrying too many items of one type (lets say 3 onehanded-swords) and put one sword into a chest, it first says the vanilla game message \\\"you are carrying too much\\\", then my own massage \\\"you are no longer carrying too much\\\". The game recognizes that you are no longer overloaded and it\\'s no big bug, the message is just annoying and may be confusing.\r\nIt does not occur when simply dropping the item to the ground.\r\n- When you use the enchanter to destroy items, the script does not recognize it. You will have to manually use the book menu to decrease the number of items the script thinks you have: So if you destroy a onehanded sword, simply open the decrease menu, choose onehanded and the onehanded count in the script will be decreased by one.\r\n\r\nIf you find any bugs or have ideas to make my mod better please let me know!\r\n\r\n\r\n----------------Thanks----------------------------------------\r\nTreasureChest, tumbajamba and DVAted - For the permission to use and adjust their [url=file.php?id=12583]Sabre Gear Backpack mod[/url] to my mod.\r\nFurther I would like to thank everyone who helped me with ideas or answered my questions.\r\nFg109, mojodajojo, kuertee, corlagon37, tox2ik, sukeban, MarethRavenlocke and everyone I forgot",
  "categoryId": "78",
  "version": "0.3",
  "author": "Leeira",
  "createdUnix": "1337501362",
  "updatedUnix": "1343324136",
  "containsAdultContent": false,
  "uploadedBy": "Leeira",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62473",
      "name": "TCSO_0_1",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28",
      "fileName": "TCSO_0_1-17371.7z",
      "uploadedUnix": "1337502174",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/779a97f00d1e40e833d7e265d68af0fc938382699f155a07bae6a3cee1f83835/analysis/1406904123/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TCSO_0_1-17371.7z?fid=62473&ttl=1535783399&ri=8192&rs=8192&setec=bb1de8bac8b0da131b4b3f03f3a7410b"
    },
    {
      "fileId": "63056",
      "name": "TCSO_0_2",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4017",
      "fileName": "TCSO_0_2-17371-0-2.7z",
      "uploadedUnix": "1337722333",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/b99896dcef6981f2e74825dbf805eafb802451675e7f458c7464ccfbe3f31a6a/analysis/1406909766/",
      "changelogHtml": " Added a book to change the number of MaxItemCounts. Look at point 6. <br/> \n MaxArrowCount demoved because it was bugged. See known issues. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TCSO_0_2-17371-0-2.7z?fid=63056&ttl=1535783399&ri=8192&rs=8192&setec=66cd17a13d0b8952ccea9f80214ac200"
    },
    {
      "fileId": "76743",
      "name": "TCSO_0_3",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4020",
      "fileName": "TCSO_0_3-17371-0-3.7z",
      "uploadedUnix": "1343324136",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/b991585334e3c4374a3ef293fe9f57baad64a90cd12db3e44db68e5ab45ab26a/analysis/1407047586/",
      "changelogHtml": " - Some cleanup to speed the script up <br/> \n - Spellbook problem solved (They no longer count towards your book number at all) <br/> \n - A more comfortable menu (for example you can now see which maximum values are set) <br/> \n - You can reset or pause (and of course restart) the mod ingame from the new menu <br/> \n - ArrowCount is back in, as the script now recognizes arrows you shoot properly <br/> \n - Vanilla BoundWeapons work properly. Modded ones do not (use the workaround described in the next point) <br/> \n - Workaround for the Enchanter: After destroying gear, simply open the book menu and use the decrease menu to decrease the number of items the script thinks you are carrying <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TCSO_0_3-17371-0-3.7z?fid=76743&ttl=1535783400&ri=8192&rs=8192&setec=32e667bf73c4359f6099c749a80785d1"
    }
  ]
}