{
  "modId": 17406.0,
  "modName": "Towns and Villages Enhanced - Villages",
  "summary": "Enhances many of Skyrim\\'s small villages!",
  "descriptionHtml": "V0.6 Bug fixes\r\n\r\nThis is a W.I.P mod that adds new levels of detail to the towns and villages around Skyrim, Immersing you in stunning scenery, and adding functionality to the rather boring and useless villages. This is to compliment my other mod, which will change city exteriors (Currently only Whiterun, check it out at http://steamcommunity.com/sharedfiles/filedetails/?id=68135774) \r\n\r\nFollow me on twitter for News on my upcoming Mod, The Rocky Isles (It\\'s pretty massive! :D)\r\nhttps://twitter.com/#!/AplestormyMods\r\n--------------------------------------------------------------------------------------------------------------\r\nShors Stone is Done! Check it out! Pics are up! :]\r\n\r\nTowns Changed:\r\n\r\nRorikstead - Done: Now looks much better, a shrine of Talos was added along with a statue, and a mill. Many foliage items and rocks have been placed, along with new light sources around the city (Shown in pictures!) CHICKENS! And a cow... \r\n\r\nRiverwood - Will probably leave this place alone :( \r\n\r\nDragon Bridge - Done: A heck of a lot more detail, guards, buildings, rocks, trees, shrubs, flowers, effects, animals, archatecture, lighting etc. This is probably the most \\\"Rescource Heavy Town.\\\" Many more light sources have been added, as the town seemed quite dull and dark (Especially after the Pines....) There are also more guards, and checkpoints, to make it seem more like an Imperial Village, which it is. \r\n(You cannot access the building at the moment, It\\'s on the cliff edge near the bridge, some new NPC\\'s will be coming to Live inside it, and maybe even a quest) Secret Chest ;)\r\n\r\nKarthwasten - Done: Many more plants, re-textured the town, added a forge, general enhancement :) Didn\\'t put as many trees, as it didn\\'t really fit Karthwasten very well.. \r\n\r\nIvarstead - Done: Looks way better now, new guard towers and guards, tonnes of trees, shrubs, rocks, new bridge, More BlackSmithing tools, including workbench, anvil, grindstone (No forge as of yet) extended the road, added new light sources, etc :D Next up, Dragons Bridge! \r\n\r\nShors Stone - General Enhancement for this tiny village :) Plus a new merchent coming soon... :D Lights are everywhere, as well as forests, shrubs, rocks etc. Also lots of ingrediants usefull for alchemists! Looks much better :) \r\n\r\n---------------------------------------------------------------------------------------------------------------------\r\n\r\nIssues:\r\nSome bugs have been found :[ Incompatability with More village Animals (But don\\'t worry, I\\'ve added quite a few myself :D) Incompatabilities with Mods that extend villages such as Ivarstead Expanded (Causes CTD) For the most part, you\\'re fine, and the different mods just merge the Cells together. \r\nFPS drops of 1-5 Fps are expected, depending on you\\'re PC specifications, due to the increased number of items in rendered cells. I had a maximum drop of 4 Fps in Rorikstead with a Phenom II X4 965 and 560ti. \r\n\r\nRecommended Mods:\r\nI recommend the Sexy Towns mod (Seen in the pic) for best results with mine, any lighting mod (Im using the RNB Pure Mod) or foliage mod will greatly benefit too. \r\n\r\n-----------------------------------------------------------------------------------------------------------------------\r\n\r\nPlease comment, rate and favourite! :) And report any bugs found in the comment section below! I read every post :D\r\n\r\nOn the Steam Workshop too: http://steamcommunity.com/sharedfiles/filedetails/?id=68336872",
  "categoryId": "62",
  "version": "1",
  "author": "Aplestormy",
  "createdUnix": "1337529944",
  "updatedUnix": "1339108105",
  "containsAdultContent": false,
  "uploadedBy": "aplestormy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "66595",
      "name": "TownsandVillagesEnhancedV06",
      "version": "0.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "472",
      "fileName": "TownsandVillagesEnhancedV06-17406-0-6.zip",
      "uploadedUnix": "1339108105",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/bc895eec8fb871c188cfdd25f56e0ae0b96f0fed258c41625d78fbb7970345b5/analysis/1406945403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TownsandVillagesEnhancedV06-17406-0-6.zip?fid=66595&ttl=1535783456&ri=8192&rs=8192&setec=25265a87a2d46971d22116c3c0034ccd"
    }
  ]
}