{
  "modId": 17419.0,
  "modName": "Rebena Te Ra - Player House - Beta",
  "summary": "Rebena is a Player house mod for TESV: Skyrim. It has a Dwemer theme \r<br />and includes three main parts, a tower, a hall, and a Laboratory. It also Houses a Magic Anomaly Follower.\r<br />It is located in the northern area of the reach and is immediately available for quick travel.",
  "descriptionHtml": "Rebena (Player House) \r<br />Version 0.98 (Beta)\r<br />\r<br />What&#39;s inside\r<br />- Rebena Te Ra Player house:\r<br />Smithing utilities\r<br />Alchemy alter, and recipes for Remedy, Aetherius Draght, and Drop Dead Poison\r<br />Alchemy Cloner set for 6 specific items(respawns at normal 10 day interval)\r<br />Enchanting utilities\r<br />Atronach Forge, and recipes excluding Dadric arms/armor\r<br />Bed with Dragonpriest Busts as Headboard\r<br />27 Mannequins\r<br />12 Large scripted display cases\r<br />4 small scripted dagger display cases\r<br />12 double wepon and shield plaques\r<br />25 single weapon plaques\r<br />9 tall scripted book shelves and one single shelf scripted book shelf\r<br />4 weapon racks\r<br />\r<br />- Forsaken Grotto:\r<br />Small dungeon containing many enemies and a boss holding the key to the house. \r<br />\r<br />- Vodahmin, Magic Anomaly Follower:\r<br />Uses a slightly buffed Lightning Cloak spell in combat\r<br />\r<br />- Alter of Peryite:\r<br />An alter to the Daedric prince of pestilence and tasks\r<br />\r<br />In depth Description:\r<br />\r<br />        Rebena is a Player house mod for TESV: Skyrim. It has a Dwemer theme \r<br />and includes three main parts, a tower, a hall, and a Laboratory. \r<br />It is located in the northern area of the reach and is immediately available for quick travel. It has a lot of display capabilities and is made to be filled, so horde those books, collect piles of gems or skulls, and fill up this beautiful, but cozy home.\r<br />\r<br />   The Tower houses the Dovahkiin&#39;s Room, a shrine to Akatosh, \r<br />and many bookshelves. it also includes busts for Dragon Preist masks. It can either have Natural lighting coming in the windows, or the sconces can be lit to provide brighter lighting using a lever.\r<br /> \r<br />   The hall is a Dwemer workshop styled smithery, all tools necessary for \r<br />smithing are provided here. All areas include some display furniture(mannequins, display cases, plaques etc.). More containers have been added, and there&#39;s even an empty trough in which to pile any esoteric collectibles you might horde.\r<br />\r<br />   In the lab there is an Alchemy area on the first floor. There are two places to harness materials, a water area with natural growing plants, and a cloner, that houses six specific ingredients in order to provide the means to make six of each of three different general use potions and a poison whose recipes are sitting on the Alchemy alter. I&#39;ve done this to provide a nice little supply of easy to make potions for those who don&#39;t wish to delve deep into academical studies, but there are many other materials available for those who do. \r<br />The upper area of the lab houses an Atronach Forge and Enchanting Alter, including a book that details all the non-Daedric recipes for the forge for easy reference.\r<br />\r<br />   ﻿In the Attic you will find a plethora of mannequinns, weapon plaques and storage for all you hard core collectors. the back of the attic also houses the Alter of Peryite.  Placing multitudes of 10 skulls at his alter will give you 5 stages of an increasingly stronger boost to your \r<br />disease resistance and Magic resistance.\r<br />\r<br />   ﻿Forsaken Grotto is the new dungeon marked on the map initially but not immediately available for quuick travel. I recomend lvl 16+ character on adept difficulty, if closer to 16 makes sure you bring fire offenses ;). There&#39;s a journal in the dungeon adding a little lore.\r<br />\r<br />\r<br />Animal Follower:\r<br />Vodahmin, is a Magic Anomaly follower who you can find on the Atronach Forge. He uses your typical Ice wraith fighting style but also casts a lightning cloak spell whenever in battle.\r<br />\r<br />\r<br />Installation: \r<br />Simply extract to the Data folder. This mod adds an edited version of a vanilla mesh and plugin file. All items are named with the prefix &#34;RB12&#34;\r<br />\r<br />\r<br />Future plans:\r<br />No known issues.\r<br />A merchant with high gold available in or near the entrance of the house to make it a one stop destination for unloading your loot.\r<br />\r<br />\r<br />\r<br />Current known Issues:\r<br />[s]-I haven&#39;t managed to get rid of invisible collision geometry in the lab that prevents actors from falling through holes near the Atronach Forge.[/s]\r<br />-Have not tested Atronach Forge as far as the effects of Sigil stone.(Otherwise it works)\r<br />-You must put all eight Dragon priest masks on their busts at Labarynthian first, if you place them all in the house you will get no ninth mask and the game will think you have, so the bust in Labarynthian won&#39;t open. Just make sure you get the final mask before putting all eight in the house.\r<br />-Vodahmin won&#39;t have the option to fallow you until you ask him to stand his ground first, and sometimes must be talked to by pressing A twice.\r<br />- Alter of Peryite will mess up if you place any miscellaneous object inside that&#39;s not a human skull and will permanently be there.\r<br />- Blessing of peryite works but displays disease resistance amount under the Resist Magic active effect in the menu.\r<br />- I can&#39;t seem to activate the alter on another computer and trying to place non books on a bookshelf brings up the sam message that displays at the alter when trying to place non skulls.\r<br />\r<br />Recommended mods that go well with this one:\r<br />Dwarven Mechanical Equipment http://skyrim.nexusmods.com/mods/14060\r<br />Make animated Dwarven weapons and shields\r<br />Dwarven Certified http://skyrim.nexusmods.com/downloads/file.php?id=10442]\r<br />Make Dwarven Centurion followers\r<br />\r<br />Refrences:\r<br />Rebena Te Ra is a reference to the location in Final Fantasy Crystal Chronicles of the same name.\r<br />Momir Vig is a Simic Mage from the TCG Magic the Gathering.\r<br />Vodahmin, means forgotten, or unremembered in the Dragon Language.",
  "categoryId": "67",
  "version": ".98",
  "author": "Ruecian",
  "createdUnix": "1337543245",
  "updatedUnix": "1410192478",
  "containsAdultContent": false,
  "uploadedBy": "Ruecian",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62603",
      "name": "Rebena Beta",
      "version": "0.90",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "603",
      "fileName": "Rebena Beta-17419-0-90.7z",
      "uploadedUnix": "1337543548",
      "modVersion": "0.90",
      "virusScanUrl": "https://www.virustotal.com/file/1cd5f373e99ebc267c2beb2fbea2f74a8b87b0ea551420924f077dcd5d03cd59/analysis/1406905511/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rebena%20Beta-17419-0-90.7z?fid=62603&ttl=1535783478&ri=8192&rs=8192&setec=fbbc7f6246fb3c0da0b9949e57a9b278"
    },
    {
      "fileId": "99675",
      "name": "Rebena Te Ra",
      "version": "0.95",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "628",
      "fileName": "Rebena Te Ra-17419-0-95.7z",
      "uploadedUnix": "1353007406",
      "modVersion": "0.95",
      "virusScanUrl": "https://www.virustotal.com/file/b5582966ff955e1054a12590b47244d5b8d67228fa9ecd4084be67d9eaf470b9/analysis/1407264305/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rebena%20Te%20Ra-17419-0-95.7z?fid=99675&ttl=1535783478&ri=8192&rs=8192&setec=1d6266bfc4f4b53fcbe5f6353ee75cd9"
    },
    {
      "fileId": "1000126031",
      "name": "Rebena Te Ra 0.98",
      "version": ".98",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10152",
      "fileName": "Rebena Te Ra 0.98-17419--98.7z",
      "uploadedUnix": "1410192478",
      "modVersion": ".98",
      "virusScanUrl": "https://www.virustotal.com/file/860584b578457b98c443aa39127496909784fbbbdf23e27102f933f6c52cb521/analysis/1410192550/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rebena%20Te%20Ra%200.98-17419--98.7z?fid=1000126031&ttl=1535783478&ri=8192&rs=8192&setec=57a6e893c3d200677425e68fd4f5235e"
    }
  ]
}