{
  "modId": 17425.0,
  "modName": "The Tree of Vjaas",
  "summary": "\\\"Theobotanics believe the Tree\\'s roots stretch out to the furthest reaches of Skyrim...\r\nThey also claim it has pretty decent living accomodations and central heating, but that\\'s just a legend.\\\"",
  "descriptionHtml": "This is a work in progress. There will be stuff added regularly, but since I will not be working on it fulltime, it will take weeks, maybe months before I can claim it is truly finished. *\r\n\r\nBe sure to endorse this mod if you like it! It\\'s good for my peace of mind and my ongoing motivation to update :)\r\n\r\nThe Tree consist of several parts:\r\n\r\n-The Tree of Vjaas:\r\nThe entry part of the dwelling, the \\\"lobby\\\", if you will. This is meant to be a pretty run-up towards the house.\r\nIt will also serve as a hub later on. Cave systems and tunnels will lead to several other trees, located all over Skyrim. It\\'s an alternative to fast-travel for the more \\\"real-time\\\" adventurers. For now, the only way into the Tree is located more or less half a mile northwest of Whiterun. It should also be marked on your map.\r\n\r\n-The Heart of the Tree:\r\nThe more conventional \\\"house\\\" part. I plan to put everything in there with which the player can interact:\r\nBeds, weapon racks, mannequins, forge, whetstone, chillout room, an apothecary, an indoor garden with a wide range of herbs, tanning rack, vendors, pets and much more...\r\n\r\n-The Veins of the Tree:\r\nA hidden pathway leading deeper into the Roots. I cannot vouch for the safety of this location, for I havent been there myself to chase away all that dwells below.\r\n\r\n\r\n*All future updates are locked away behind doors and gates. Feel free to check from time to time which ones have opened up, revealing new content...\r\n\r\n---------------------------------------------------------------------------------------------------------------------\r\n°Update 15th May 2012\r\n\r\n_ Added furniture to weapons room\r\n_Complete overhaul of lighting and effects\r\n_Fixed disappearing trees.\r\n_Added more plants, vines and stones\r\n_Cleaned up bit\r\n\r\n\r\n---------------------------------------------------------------------------------------------------------------------\r\n°Update 23th May 2012\r\n\r\n_Started adding NPCs (some are functional, some not)\r\n\r\nBrian McBrian - Brian is an avid collector of random stuff, He\\'s just moved in so try not to mind all the mess. It already bugs him, so dont disturb him too much, he\\'s probably in a bad mood already. (For now, you should be able to sell him stuff)\r\n\r\nKreeteec - a rather stoic spriggan, Doesn\\'t say much, doesn\\'t do much...yet. Well, at least she made herself quite comfortable. (Not active yet)\r\n\r\nHorkie - Aah, who doesnt love Horkie, the lovable horker. Don\\'t get too close though, he bites.\r\n\r\n_Closed the door which eventually leads to the Veins of the Tree because its an unfinished area\r\n\r\n_Added a Tanning rack to the Fireplace room (Thx @VornskrPackLeader for reminding me\r\n\r\n----------------------------------------------------------------------------------------------------------------------\r\n°Update 10th July 2012\r\n\r\n_New Tree outdoor environment (stairs, plants, etc)\r\n_Added more details to the Fireplace-room\r\n_Fixed Brian to buy everything (also gave him more money)\r\n_Unpacked most of the boxes in \\\"Brian\\'s Shoppe of Curious Itemry\\\"\r\n_Named Horkie, well... Horkie :)\r\n_Removed some candles for optimization\r\n_Dug up a fossil of the Terrible Jetgeared Goatbird, on display in Brian\\'s shop\r\n\r\n\r\n\r\nIt is advised to leave and re-enter the tree after update to avoid inconsistencies.",
  "categoryId": "67",
  "version": "10.07.2012",
  "author": "Vjaas",
  "createdUnix": "1337552965",
  "updatedUnix": "1341957082",
  "containsAdultContent": false,
  "uploadedBy": "vjaas",
  "primaryFile": null,
  "files": [
    {
      "fileId": "73496",
      "name": "The Tree of Vjaas - 10072012",
      "version": "10.07.2012",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "129",
      "fileName": "The Tree of Vjaas - 10072012-17425-10-07-2012.rar",
      "uploadedUnix": "1341957082",
      "modVersion": "10.07.2012",
      "virusScanUrl": "https://www.virustotal.com/file/4961097f4e0ad4a42c9c2a97c8771f79a73cd39e28735369501438bf1a3a1098/analysis/1407014825/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Tree%20of%20Vjaas%20-%2010072012-17425-10-07-2012.rar?fid=73496&ttl=1535783490&ri=8192&rs=8192&setec=f20791fcebf2b5ea86dcbc609ffdd065"
    }
  ]
}