{
  "modId": 17438.0,
  "modName": "Adaptive Night Eye",
  "summary": "An alternative to the vanilla Night Eye - one where your eyes actually adjust to the dark instead of you having to cast a silly spell just to use your own pupils.",
  "descriptionHtml": "\r<br />This mod would be better scripted. Anyone who wants to is welcome to taking over this project. Link back here for reference or not, I don&#39;t really care. I don&#39;t really mod anymore, I just don&#39;t have time. This is just something I played around with for a while. If anyone else gets enjoyment out of it, that&#39;s awesome.\r<br />\r<br />[color=#ff0000][size=4][b]I don&#39;t work on mods anymore. This mod is old and may be buggy. Please read the uninstall info if you have trouble with night eye staying on. This mod probably will not work with lighting mods such as Climates of Tamriel, but may work with ENB.\r<br />\r<br />Anyone is welcome to edit or redo this mod and upload anywhere if they can get it working better. Good luck&#33;[/b][/size][/color]\r<br />\r<br />Features\r<br />=========================\r<br />Now your Khajiit/Vampire/Werewolf character can roam Skyrim freely without\r<br />having to cast a silly spell to use their natural ability to adjust their pupils\r<br />in the dark. This mod replaces the default Night Eye with a new Lesser Power, \r<br />which when casts lasts a virtually infinite time, and simply activates its effects \r<br />in lighting conditions which are dark around your character. This will work in \r<br />dungeons or interiors as well as outdoors at night. It is affected by light sources \r<br />nearby as well, such as torches and campfires, and spells.\r<br />\r<br />The effect has been adjusted so that there are no noises when it\r<br />activates/deactivates, and the overall effect is now just a brightness\r<br />elevation along with %70 of normal saturation and a bit less contrast .\r<br />(this gives it a feel of natural night vision, as opposed to night vision goggles. ) \r<br />\r<br />There is now an option for having a red tinted Werewolf Night Eye. This was\r<br />proposed by godzilla90fan, and they provided this link as credit to the original\r<br />concept: http://skyrim.nexusmods.com/downloads/file.php?id=11804\r<br />\r<br />This effect will activate indoors in dark corners and such. Sorry if this\r<br />bothers you, I tried my best to tune it so it would react appropriately to the\r<br />conditions. It works by detecting the light cast on your character - not by adapting \r<br />to the light you are seeing with your camera view. You can always toggle the \r<br />effect by casting the Lesser Power again, and reactivate it later by casting again.\r<br />\r<br />Rings:\r<br />There are three rings added to the game. All three do the same thing - while\r<br />wearing them they give you the adaptive Night Eye ability. One is placed in a\r<br />location which is easy to get to, yet hard to find unless you know right where\r<br />it is - for immersion purposes and those who want to find the rings as treasure.\r<br />For people who want them as treasure, without having to look in at the spoilers\r<br />to find where they are, they are in locations in which you will find them if you\r<br />are keeping an eye out for treasures in 2 locations you are likely to visit if\r<br />you are on quests/hunting for lore artifacts.\r<br />--------------------------------------------------\r<br />\r<br />Options\r<br />=========================\r<br />There are several options for you to pick from\r<br />They will be in their own folders after you extract the .zip\r<br />You can install them manually, or through NMM thanks to jaime74 \r<br />\r<br />Only use one option at a time, of course.\r<br />--------------------------------------------------\r<br />\r<br />No Tint\r<br />--------------------\r<br />This is just a mild brightening and slight desaturation effect.\r<br />--------------------------------------------------\r<br />\r<br />Red Tint Werewolf Night Eye\r<br />--------------------\r<br />This was proposed by godzilla90fan, and they provided this link as credit to \r<br />the original concept: http://skyrim.nexusmods.com/downloads/file.php?id=11804\r<br />\r<br />This activates when you transform, and \r<br />deactivates when you transform back again. It&#39;s an ability, and it may \r<br />not work as well as the Lesser Power Night Eye available to other races.\r<br />I did my best to balance the tint and provide enough brightness while\r<br />not making it look too pinkish.\r<br />--------------------------------------------------\r<br />\r<br />Blue Grey Tint \r<br />--------------------\r<br />This was proposed by jaime74\r<br />The effect is mild and not as pronounced as the default skyrim Night Eye.\r<br />Less saturation and a slightly blue tint to the effect.\r<br />--------------------------------------------------\r<br />\r<br />None of the effects available in this mod have blurred edges.\r<br />--------------------------------------------------\r<br />\r<br />Spoilers\r<br />========================= \r<br />\r<br />Rings:\r<br />Location 1 (easy to get to) http://i49.tinypic.com/289x98i.jpg\r<br />Location 2 http://i45.tinypic.com/2poa5aw.jpg\r<br />Location 3 http://i47.tinypic.com/6sx45e.jpg\r<br />--------------------------------------------------\r<br />\r<br />\r<br />Codes\r<br />=========================\r<br />ID codes tell Skyrim what an object/item/spell whatever is. Skyrim uses load\r<br />order to organize its ID codes, so you will need to find the load order code\r<br />(two digits) which corresponds with your mod (in this case AdaptiveNightEye.esp)\r<br />I use Nexus Mod Manager to find the load order. I&#39;m sure there are other ways\r<br />as well, if I find a way I&#39;ll let you know.\r<br />\r<br />Night Eye Lesser Power for your custom races (Same for both Editions)\r<br />--------------------\r<br />The ID is XX000D74 ( &#34;XX&#34; being the load order digits )\r<br />The console code is:\r<br />player.addspell XX000D74\r<br />\r<br />Rings\r<br />--------------------\r<br />The ID is XX000D6D ( &#34;XX&#34; being the load order digits )\r<br />The console code is:\r<br />player.additem XX000D6D 1\r<br />Or replace the 1 with any number you want\r<br />--------------------------------------------------\r<br />\r<br />Version 1.02\r<br />========================= \r<br />Fixed the Werewolf red tint option. It is now an ability, and activates when you \r<br />transform into a Werewolf, and cancels when you transform back.\r<br />\r<br />Thanks to jaime74 now there is the option to download and install with the NMM manager.\r<br />The options will be accessible via an installation menu through NMM. \r<br />Thanks a lot&#33;\r<br />\r<br />If you have any suggestions or know how to make something work better, feel free\r<br />to comment or message me :)\r<br />--------------------------------------------------\r<br />\r<br />Compatibility \r<br />========================= \r<br />This mod will conflict with any mod changing the entries of powers in races with Night Eye.\r<br />\r<br />This mod as it is will not behave properly with mods such as Climates of Tamriel, which alter the levels of light cast on the player during certain conditions. \r<br />\r<br />I plan to make this mod more easy to customize so that conflicts such as that can be circumvented. However for now, I have made a guide about how to change the values easily on your own using the Creation Kit. You can download the guide in the downloads section.\r<br />\r<br />If you find anything which conflicts with this mod, I&#39;d appreciate it if you would\r<br />leave a comment mentioning which mods conflict. Thanks :)\r<br />--------------------------------------------------\r<br />\r<br />Notes: \r<br />========================= \r<br />Before you disable this mod I suggest you save after disabling the effect\r<br />by toggling the Lesser Power or taking off the ring. I have had an\r<br />experience with the global value for Night Eye being on staying in the save\r<br />file, resulting in the Night Eye effect being on when you go back to your save.\r<br />if you end up with this problem you can fix it by casting the default Skyrim Night Eye\r<br />lesser power (with the mod still uninstalled.) *In no circumstances have I encountered \r<br />this mod breaking/corrupting saves or causing any other kind of damage in my own game, \r<br />and there is absolutely no reason it should to my knowledge. \r<br />--------------------------------------------------\r<br />If you have trouble with this mod I would highly suggest loading it last in\r<br />your load order, or try lowering it until you get success.\r<br />--------------------------------------------------\r<br />I plan to make this mod more easily customizable. I want to make it so that \r<br />you can change the settings in game either by a menu or by the console. \r<br />Not everyone will have the same results from this mod because some people \r<br />use mods which alter the values for LightLevel cast on the character. One I \r<br />know of is Climates of Tamriel. I don&#39;t know how long it will take before I can \r<br />complete that, so in the meantime I have created a guide to making changes to \r<br />this mod on your own using the Creation Kit. It&#39;s really easy but it&#39;s a lengthy \r<br />guide so I have uploaded it here for you to download and read. :) \r<br />\r<br />Change log\r<br />========================= \r<br />Version 1.01:\r<br />- Now with a tiny update to the text associated with the night eye effect.\r<br />The description of the Lesser Power is now:\r<br />&#34;___ eyes are capable of adapting to see well in dark conditions.&#34;\r<br />The ___ being your race, or if you use the generic Lesser Power for \r<br />your custom race, simply &#34;your.&#34; This is to make it easy to tell if the mod\r<br />is showing up in your game.\r<br />\r<br />Version 1.0:\r<br />This is likely the final release. I was learning how to script to make a custom script\r<br />for this mod to make it better, but I realized that it would not really improve anything. \r<br />I learned more about the conditions available to apply in the Creation Kit gui, and \r<br />I believe that now this mod is as close to perfection as I am able to achieve for now.\r<br />\r<br />If you have any suggestions or know how to make something work better, feel free\r<br />to comment or message me :)\r<br />\r<br />Beta version 2.0:\r<br />This version has lessened brightness, and saturation in the effect. It also has \r<br />much smoother transitions. Releasing a new option: Lesser Power edition - rather \r<br />than using an Ability for the effect, the character gets a Lesser Power which acts the \r<br />same way - but is toggle - able.\r<br />\r<br />Beta version 1.9:\r<br />Unreleased, tuning and testing. Might as well release the\r<br />changes here in 2.0 (nice clean number) alongside the Lesser Power option.\r<br />\r<br />Beta version 1.8:\r<br />Mild tuning, lesser brightness in the effect\r<br />\r<br />Beta version 1.7r (rings):\r<br />This is the same as Beta version 1.7 except I&#39;ve brought the\r<br />rings back.\r<br />\r<br />Beta version 1.7:\r<br />Removed fail safe as it was as I had suspected pointless and\r<br />redundant afterall, and I added some minor tuning.\r<br />\r<br />Beta version 1.6:\r<br />Added a failsafe to ensure that it acts the way it is supposed \r<br />to. I tseems very redundant to me, but it seems to improve \r<br />stability none the\r<br />less.\r<br />\r<br />Beta version 1.5:\r<br />Panicking and trying to get it to work after it suddenly \r<br />stopped&#33; Now it does work, and seems to be working very well&#33;\r<br />\r<br />\r<br />Beta version 1.4:\r<br />Refining and tuning the mod. Less bright effect, more sensible\r<br />adaptation conditions. No more rings included, I couldn&#39;t get them to\r<br />act properly. Sorry&#33;\r<br />\r<br />Beta version 1.3:\r<br />Attempting to create more stability with the effect (reports of it\r<br />stopping randomly)\r<br />\r<br />Beta version 1.2:\r<br />Added the ability to Vampires/Werewolves\r<br />\r<br />Beta version 1.1:\r<br />Added smooth transitions to the effect\r<br />\r<br />Beta version 1: \r<br />Added the ability to Khajiits and added the three rings",
  "categoryId": "78",
  "version": "1.03",
  "author": "Estioarem",
  "createdUnix": "1337590204",
  "updatedUnix": "1345812018",
  "containsAdultContent": false,
  "uploadedBy": "estioarem",
  "primaryFile": null,
  "files": [
    {
      "fileId": "63962",
      "name": "Adaptive Night Eye Beta 2-0 -- OLD --",
      "version": "Beta2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1327",
      "fileName": "Adaptive Night Eye Beta 2-0 -- OLD ---17438.zip",
      "uploadedUnix": "1338117509",
      "modVersion": "Beta2.0",
      "virusScanUrl": "https://www.virustotal.com/file/cdf7ffe7c88dd1bbadad4faaf52c3a30083338b674aada89856f4951fccb395c/analysis/1406918285/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Adaptive%20Night%20Eye%20Beta%202-0%20--%20OLD%20---17438.zip?fid=63962&ttl=1535783513&ri=8192&rs=8192&setec=ba157375ef9d26278cd0e4662a758775"
    },
    {
      "fileId": "74537",
      "name": "Adaptive Night Eye",
      "version": "1.03",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5957",
      "fileName": "Adaptive Night Eye-17438-1-03.zip",
      "uploadedUnix": "1342387531",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/8660cdc6771b972329e86faef959c0e074c2581f5e96ed38c2d5c214a71e673c/analysis/1407025028/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Adaptive%20Night%20Eye-17438-1-03.zip?fid=74537&ttl=1535783513&ri=8192&rs=8192&setec=614829c738800f3d89be7ed11fc8c50b"
    },
    {
      "fileId": "83897",
      "name": "A guide to making your own changes to this mod",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6",
      "fileName": "A guide to making your own changes to this mod-17438-.zip",
      "uploadedUnix": "1345812018",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/e44c98cd22c182efcbae0203bf5cec817265c5655c95dd35486a768b476b0b5b/analysis/1407118466/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20guide%20to%20making%20your%20own%20changes%20to%20this%20mod-17438-.zip?fid=83897&ttl=1535783514&ri=8192&rs=8192&setec=0defd7a5c3891ebfd35655a8a3fc5b40"
    }
  ]
}