{
  "modId": 17472.0,
  "modName": "Ritual Stone Servant",
  "summary": "Make Ritual Stone a lesser power and res an army",
  "descriptionHtml": "I was trying to make Ritual Stone act like Vampire Servant. Also wanted it to be a Lesser Power so one can cast it more then once a day. I compared the two powers and did not find any differences. Time to test, I cast it on a pile of dead bandits. Only one becomes my minion. Hmm, ok why not all three in the pile? I cast again, and the other one rises under my control, but to my surprise my current minion did not die. I cast on the last in the pile, and it too is under my control. How far can I take this I thought.\r\nAfter clearing out a fort I had about eighteen minions. It is crazy, but I thought I would put it out there for others. It is up to you to restrain yourself from creating an army, but it sure is fun to have a mini army attacking a dragon, or a group of Daedra (thanks OCS). It even works on animals and lasts for 2 Game hours.\r\nBrings back memories of Necromancer in GuildWars.\r\n\r\nI do not plan any updates, as it does what I original wanted, raise at least one dead multiple times a day. The army part is just a fun side effect.",
  "categoryId": "75",
  "version": "1",
  "author": "E2B2",
  "createdUnix": "1337646372",
  "updatedUnix": "1337646469",
  "containsAdultContent": false,
  "uploadedBy": "epbreen",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62914",
      "name": "main file",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "main file-17472-1.7z",
      "uploadedUnix": "1337646469",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/54b805672eaa4538bde957d5bd99b69a22097111ca74d6a51962b647d4864cf3/analysis/1406908329/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/main%20file-17472-1.7z?fid=62914&ttl=1535783566&ri=8192&rs=8192&setec=d130261671d46233a78905c94f219692"
    }
  ]
}