{
  "modId": 17479.0,
  "modName": "Viable Faction Armour",
  "summary": "A simple, tiny mod that increases the armour rating of Imperial, Hold Guard and Stormcloak armour sets so that they are at least equivalent to commonly encountered, early-game, non-faction armour, and thus you can wear your faction armour in early-mid game without disadvantaging yourself by not wearing Leather instead.",
  "descriptionHtml": "A simple mod that increases the armour rating of Imperial, Hold Guard and Stormcloak armour sets so that they are at least equivalent to commonly encountered, early-game, non-faction armour, and thus you can wear your faction armour in early-mid game without disadvantaging yourself by not wearing Leather instead.\r\n\r\nAlso on Steam Workshop: [url=http://steamcommunity.com/sharedfiles/filedetails/?id=73085642]http://steamcommunity.com/sharedfiles/filedetails/?id=73085642[/url]\r\n\r\nI was always disappointed that the faction armours - whether the Scale Mail of Hold Guards, the Padded-look Stormcloak armours or the range of Imperial Legion Armours - were all really under-powered compared to a run-of-the-mill set of Hide, Studded or Leather armour that is available to the player virtually as soon as she gets to Riverwood and has access to a forge.\r\n\r\n---------------------------------------------------------\r\n\r\n1.1 Update: Tweaks Stormcloak Officer Armour: this was previously unchanged as an omission. Little change was actually needed; it was already a decent light armour. The overall set has received +2 armour rating, making it lie a bit closer to elven than leather armour in the scale of things.\r\n\r\n---------------------------------------------------------\r\n\r\n\r\nImperial Faction pieces:\r\n\r\nThe Imperial heavy armour set is now equivalent to standard Steel Armour.\r\nThe Imperial light armour set is now equivalent to standard Leather Armour.\r\nImperial Heavy and Light Shields now match Steel and Hide Shields respectively.\r\nThe Imperial Studded Cuirass (obtained via selecting the Medium option) is now slightly better than standard Leather Armour, but not as good as Elven etc.\r\n\r\n\r\nStormcloak Faction Pieces:\r\n\r\nThe Stormcloak armour set is now much better than standard Hide Armour, and only slightly worse than standard Leather Armour (re: Stormcloak vs Imperial balancing).\r\n\r\n(1.1) Stormcloak Officer Armour is now slightly tweaked up to match the overall balance upwards; the set receives +2 armour rating overall, still setting it inferior to Elven armour but closer to Elven than Leather/Imperial Light.\r\n\r\n\r\nSkyrim Hold Guard Factions Pieces:\r\n\r\nHold Guards\\' Scale Mail-style armour is now equivalent to standard Leather Armour; as is their helmet to its analogue. Their shields did not require a boost.\r\n\r\n\r\nIf anyone thinks a smaller separate faction needs a similar overhaul and I\\'ve derped and forgotten it, leave me a comment and I\\'ll take a look. Hopefully once I get my mesh-editing skills up to date, some extra faction variants will be in order in addition.",
  "categoryId": "54",
  "version": "1.1",
  "author": "Friar Chris - credited The Doctor in esp file",
  "createdUnix": "1337659215",
  "updatedUnix": "1344651571",
  "containsAdultContent": false,
  "uploadedBy": "FriarChris",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62943",
      "name": "Viable Faction Armour",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Viable Faction Armour-17479-1-0.rar",
      "uploadedUnix": "1337659590",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1fd02c07265984f632dc1bc985c66ca1b62ec0aa068053e8609f7990dc244de6/analysis/1406908666/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Viable%20Faction%20Armour-17479-1-0.rar?fid=62943&ttl=1535783575&ri=8192&rs=8192&setec=ec643605c265867f7164fc2c43e7b5e7"
    },
    {
      "fileId": "80499",
      "name": "Viable Faction Armour",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Viable Faction Armour-17479-1-1.rar",
      "uploadedUnix": "1344651571",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7f09eb229aaa4f16c87f83b2186f04adc773bf6cf784475c76816ecd7b79ba2e/analysis/1407086736/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Viable%20Faction%20Armour-17479-1-1.rar?fid=80499&ttl=1535783576&ri=8192&rs=8192&setec=1c331ab24910a5a64370be0fdf2bad14"
    }
  ]
}