{
  "modId": 17513.0,
  "modName": "Spell- Channel Energy",
  "summary": "Adds a spell that temporarily boosts your magicka regeneration, but prevents you from recovering stamina.",
  "descriptionHtml": "When playing as a mage, I rarely used stamina for anything but sprinting and constantly had to wait in the middle of a battle for my magicka to recharge. Because of this, I created a spell which temporarily lowers your stamina regeneration by 100% while letting you regenerate magicka 100% faster in return. The spell is great for mages who use Destruction magic who don\\'t flee from combat.\r\n\r\nAbout the spell:\r\n-It is a novice level Alteration spell that costs about as much magicka to cast as stoneflesh. The magicka cost can be halved with the Novice Alteration perk.\r\n-The effects last 60 seconds and can be increased to 90 seconds with the Stability perk.\r\n-LOCATION: The spell can be found in Ustengrav. It is on the floor at the shrine where the player should receive the Horn of Jurgen Windcaller.\r\n-While under the effects of this spell, it may still be possible to passively recover stamina through the use of perks or potions.\r\n\r\nInstallation:\r\n-Copy the .esp into your Data folder.\r\nOR\r\n-Use the Nexus Mod Manager. This mod IS NMM compatible.\r\n\r\nKnown Bugs:\r\n-NONE KNOWN. I didn\\'t find any bugs while testing this. If you find any bugs, please report them in the comments so I can try to fix them.\r\n\r\nThis is my first Skyrim mod so feedback is welcome. I would like to know how I did.",
  "categoryId": "75",
  "version": "1.0",
  "author": "RiftRipper",
  "createdUnix": "1337732382",
  "updatedUnix": "1337732471",
  "containsAdultContent": false,
  "uploadedBy": "RiftRipper",
  "primaryFile": null,
  "files": [
    {
      "fileId": "63066",
      "name": "First Release",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "First Release-17513-1-0.7z",
      "uploadedUnix": "1337732471",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/dd0431871e7ce4661800637e52ed305f383cdb70879c99beda0513d951b683db/analysis/1406909943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/First%20Release-17513-1-0.7z?fid=63066&ttl=1535783621&ri=8192&rs=8192&setec=c8f05a9c13c4144af1fafa18d3f991b1"
    }
  ]
}