{
  "modId": 17525.0,
  "modName": "Cozier Breezehome",
  "summary": "Series of mostly minor changes to Breezehome to make it a little more home-like.",
  "descriptionHtml": "Ok, there are a ton of Breezehome mods out there, so let me begin with what this mod does NOT do: It doesn\\'t add any floor space, secret rooms, crafting areas, or magic portals to Sovngarde.\r\n\r\nHere are the highlights of what it DOES do:\r\n- Bedroom: Makes a minor upgrade to the bed (Common to Upper) with the bedroom upgrade. Removes the dresser and adds a wardrobe where the table used to be (seriously, 18 goddamn tables in vanilla Breezehome). Removes Common end tables (containers) and replaces with Noble end tables (furniture).\r\n\r\n-Loft: Removes another freakin\\' table and replaces it with a small wardrobe (looks like a chest to me, but the CK labels it a wardrobe. Removed some of the wall baskets and replaced them with shelves/clutter. Added dagger display case and a candle to the small, thin table by Lydia\\'s room.\r\n\r\n-Alchemy lab: Gone. There\\'s an alchemy bench 2 doors down at Arcadia\\'s. Re-purposed as a den. Replaces alchemy bench with a larger table/desk, adds a couple of mounted heads to the wall, and replaces the redundant chair in the room with a side board and dagger display case. A couple of very minor surprises to help justify the cost of the room/assuage shock of loosing alchemy crafting space. Bookshelf and chest were unchanged.\r\n\r\nDining area: Ok, who here thinks cooking over an open fire in the middle of the living room is a bad idea? Me too. Moved all the food related stuff to the back of the first floor and tried to make that part of the house more meaningful than some clutter that keeps you from getting the den a little faster. A lot of little tweaks here, but I think the end result is lovely. \r\n\r\nLiving room: Removed fire pit and added some extra chairs to make it feel like maybe the Dovahkiin occasionally entertains guests in between dragon slayings (after Lydia clears the dishes, the Dragonborn shows his ability set stuff on fire with his breath. Always a crowd pleaser). Removed another table. Moved a lot of stuff around. Got rid of some stuff. Added a little too. \r\n\r\nAgain, in most cases stuff was just moved. The things that were removed were redundant and content was only added if it seemed like it made sense to do so. Overall, I feel like this makes Breezehome a little more like a place where the Thane of Whiterun lays his head down.\r\n\r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "HyphenC",
  "createdUnix": "1337763158",
  "updatedUnix": "1337763203",
  "containsAdultContent": false,
  "uploadedBy": "HyphenC",
  "primaryFile": null,
  "files": [
    {
      "fileId": "63116",
      "name": "Cozier Breezehome",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "Cozier Breezehome-17525-1-0.zip",
      "uploadedUnix": "1337763203",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2c19564f5b332ea09c62fa6414f8f8d3140b76aafae333296b7bf61603a91540/analysis/1406910368/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cozier%20Breezehome-17525-1-0.zip?fid=63116&ttl=1535783636&ri=8192&rs=8192&setec=6b56f91a9c7224f020a60c3e842e11e7"
    }
  ]
}