{
  "modId": 17613.0,
  "modName": "More Daedra Hearts Update",
  "summary": "Two different paths to the same goal, adding more daedra hearts to the game.",
  "descriptionHtml": "What Skyrim is missing is more daedra to grab those damned hearts. This mod dooesn\\'t add more daedra to the game as I have no idea what I am doing with the creation kit. Instead, it makes Arcadia of Arcadia\\'s Cauldron in Whiterun carry more daedra hearts (7 total every two days). It also increases the chances she will have them in stock.\r\n\r\nThis mod comes at a cost however. As I said I dont really understand modding and this mod may have bugs (I have not encountered any so fa)r. This mod should be fully compatible with any other mods out there unless it changes any files for Arcadia\\'s chest. What you lose is all the other rare items Arcadia would carry. She still has a vast inventory but it has been altered.\r\n\r\nThe alternative file adds the ability to loot a single daedra heart from a slain dragon. Dragons will drop daedra hearts like dremoras (one for every dragon slain). In my opinion, this option keeps a balance to the game. Makes killing dragons more rewarding and interesting. Those who would say this is incompatible with the lore I would disagree with you. Keep an open mind and active imagination. Akatosh is the creator of dragons and the dragon fires that keep the daedra in the planes of oblivion. It would be reasonable to assume that Akatosh and his dragons are the sworn enemies of the daedric princes and their daedra. You recieve the daedra hearts from the stomach contents of the dragons. Nuf said.\r\n\r\nIn any case, I\\'ve created this mod to be a sort of workaround for the lack of dremora in the game and the bug I\\'m currently experiencing where dremora no longer spawn at a certain shrine. Until Bethesda or someone with better modding skills can fix that problem, I believe this is a reasonable alternative. Enjoy!\r\n\r\nNOTE: Both mods work together but in order to keep the daedra heart relatively rare I suggest using one or the other.",
  "categoryId": "85",
  "version": "Updated",
  "author": "DiabolusXNihilo",
  "createdUnix": "1337893076",
  "updatedUnix": "1337909275",
  "containsAdultContent": false,
  "uploadedBy": "DiabolusXNihilo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "63462",
      "name": "More Daedra Hearts",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "More Daedra Hearts-17613.zip",
      "uploadedUnix": "1337893193",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/54e699c3aeb63aae96790b52c213d77d1e76d9a0db98210e317bb787504fd11b/analysis/1406913488/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Daedra%20Hearts-17613.zip?fid=63462&ttl=1535783784&ri=8192&rs=8192&setec=403b50f39299c19bb07be5ec85ca0dac"
    },
    {
      "fileId": "63494",
      "name": "Dragon Hearts",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "Dragon Hearts-17613-1.zip",
      "uploadedUnix": "1337909275",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/bc073f68f594af817672f5a845f50a86780031a004a04a792951a8a636f2e62f/analysis/1406913785/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Hearts-17613-1.zip?fid=63494&ttl=1535783785&ri=8192&rs=8192&setec=2fb3ad9b5106a6d611edeb46808f606e"
    }
  ]
}