{
  "modId": 17620.0,
  "modName": "Sonia Master Mage",
  "summary": "Download this mod and add to your game Sonia. Sonia is a Master Mage with many special features, from following you, helping you in everyday task and being your wife. Have a blast!",
  "descriptionHtml": "[center][size=5][color=yellow][b]SONIA MASTER MAGE[/b][/color][/size]\r\n\r\n[size=3][color=orange][b][u]FOR MUTUAL CONVENIENCE:[/u] [i]READ THE MANUAL BELOW BEFORE INSTALLING[/i][/b][/color][/size]\r\n\r\n\r\n\r\n[color=pink][size=6][b]- Important Notes -[/b][/size][/color][/center]\r\n\r\nHello guys! Welcome to Skyrim ;) I\\'ve been for the last days testing and scripting in Skyrim. Getting to know how Papyrus works. It\\'s cool. :)\r\nFirst let me say that this Sonia is completly different from Sonia in Fallout. I\\'m making her from scratch so I want her with a new look, other behaviors and slightly different personality than from her Fallout versions. She is not a girl anymore she is a gorgeous Master Mage ;)\r\nI will make in the future subtle references to her Fallout life :)\r\n\r\nYou can enjoy Sonia\\'s presence in [url=http://fallout3.nexusmods.com/mods/4724]Fallout 3[/url] and in [url=http://newvegas.nexusmods.com/mods/38048]Fallout New Vegas[/url].\r\n\r\nLet me tell you that as before on my previous mods, Sonia will be developed on my spare time with much care. But you need to be patient and give time until I release new stuff or correct possible problems.\r\n\r\n[color=red]Sonia Master Mage v0.3:[/color]\r\nI\\'ve been correcting those things reported in the comments. Problem about the AI packages is that Sonia sometimes doesn\\'t recognize what is around her, so she doesn\\'t interact with objects, for what I looked for it\\'s a common problem with the navmesh bug in the creation kit. I could have a little help on this matter if anyone knows how to fix it.\r\nI added her Magic Menu. Since I need a great deal of time doing her dialogue and spells options, I release now with only her Adept Destruction spells. It doesn\\'t have all spells, I choose that ones that don\\'t consume a lot of magicka. It\\'s just easier for now to do like this, simpler, and it will be good to release and let everyone test to see if I\\'m doing this spell system alright.\r\nWhat I will be doing in the next phase is showing spells depending on Sonia\\'s magic skill level. So once she has enough destruction points for example expert spells they will show up automatically in the magic menu, as with every other magic skill. That\\'s what I\\'m aiming for with the Magic Menu. :) I also did an option for her to cast invisibility spell while sneaking and added Light Foot perk for trap protection. ;)\r\nIn the next versions I will continue developing the magic menu and create clothes menu and fate menu as much as fixing possible problems.\r\n\r\n[color=red]Sonia Master Mage v0.1:[/color]\r\nI\\'m releasing Sonia companion first public version. She is very basic and in her early stages. But right now she can be your follower and do everything a regular game follower does and she can be your wife. I\\'m using the game system so you must not have a follower or a wife to be able to choose her. There are mods out there that take these limitations, so I won\\'t be doing that. No need to change anything if is not broken and I do like the simplicity of both systems in Skyrim.\r\nI\\'ve already done her beautiful looks, dialogue structure, default robe and other stuff that is important to have from the start.\r\nThe first feature I\\'ve implemented is her Training option, that will make you Train in all different Magic skills.\r\n\r\nSince she is in the beginning I need you to give me strength for her developing, give me feedback and alert me if you find any broken stuff. :))  \r\n\r\n\r\n\r\n[center][color=pink][size=6][b]- Description -[/b][/size][/color][/center]\r\n\r\nDownload this mod and add to your game [color=orange]Sonia[/color]. Sonia is a Master Mage with many special features, from following you, helping you in everyday task and being your wife. Have a blast!\r\n\r\n\r\n\r\n[center][color=pink][size=6][b]- Install -[/b][/size][/color][/center]\r\n\r\n[b]Requirements:[/b]\r\n- Skyrim (1.5 version)\r\n\r\n[b]Recommended mods to have her just like in the photos (face and body):[/b]\r\n- [url=http://skyrim.nexusmods.com/downloads/file.php?id=6709]DIMONIZED UNP female body[/url]\r\n- [url=http://skyrim.nexusmods.com/downloads/file.php?id=3563]Coverwomen - Seamless UNP Look 2[/url]\r\n\r\n[color=red][b]INSTALL THE LATEST SONIA MASTER MAGE NMM VERSION[/b][/color]\r\n\r\nWhen installing a new version is a good policy to first uninstall the old version and clean your saved game.\r\n\r\n\r\n\r\n[center][color=pink][size=6][b]- FAQ -[/b][/size][/color][/center]\r\n\r\n[color=yellow][b]Q:[/b] I installed the mod and I\\'m having a problem with the mod that I can\\'t find a solution.[/color]\r\n[color=orange][b]A:[/b] Before letting me know about it, I want you to know that 90% of the reasons for mods not working as announced are:\r\n1 - Not installing the mod correctly,\r\n2 - Not using the game version required,\r\n3 - Having some other mod conflicting with it\\'s behavior formulas.\r\nSo before saying it\\'s broken, read this description, ensure that everything is in it\\'s place and/or deactivate other mods that may be conflicting and activate them in order until you find the one that is causing it. If the problem still continues then tell me and I will help out the best I can.[/color]\r\n\r\n[color=yellow][b]Q:[/b] What was your inspiration when you did the new Sonia in Skyrim?[/color]\r\n[color=orange][b]A:[/b] I wanted to change her looks so that they could relate better to her Master Mage status. She is not a girl anymore and this time I tried to make her look similar to my wife ;) Enjoy her beauty! :) [/color]\r\n\r\n\r\n\r\n[center][color=pink][size=6][b]- Details -[/b][/size][/color][/center]\r\n\r\n[b][color=red][u][FROM HERE ON THE INFORMATION CONTAINS SPOILERS][/u][/color][/b]\r\n\r\nWhen you activate Sonia Master Mage and load your game it will place Sonia in your Skyrim world. You can meet her at Dragonsreach in Whiterun.\r\nShe is a Master Mage and a possible follower and wife to the player. She is an aggressive good looking ally/lover to the player. She will always take good care of the player. Her friends/enemies are always the same as the player. All her options will be available from start and the player can buy from her a Summon Sonia spell that can be used to teleport her back to his location. Her options can be accessed in dialogue as any default follower or wife. Her dialogue uses a very simple structure that makes it easier to interact. Some options in her dialogue become limited when she is combat. When she leaves you she will go back to Dragonsreach or your main home (if she is your wife). If for some reason you let her die, her summon spell will be removed from your spells.\r\nYou will find her really easy to handle and her options easy to navigate through.\r\n\r\nSo take good care of her because she will definitely take good care of you ;)\r\n\r\n[b][color=yellow]MENU STRUCTURE:[/color][/b]\r\nWhat are you selling? - Barter menu (limited in combat)\r\nSpeaking about... - Goes to her options menu\r\n- Magic - Magic menu that has Sonia\\'s Magic options\r\n- Training - Trains player in Magic arts\r\n- Fate - Sonia\\'s Essential option\r\n\r\n[b][color=yellow]CHARACTERISTICS:[/color][/b]\r\n[color=orange]FACTIONS:[/color] Follower and Wife (at the same time)\r\n[color=orange]STATS:[/color] Auto-Level with player stats and with minimum of level 25\r\n[color=orange]AI Attributes:[/color] Aggressive, Foolhardy, Helps Allies, Happy and Any Crime\r\n[color=orange]AI Behavior:[/color] Sandbox, Eat and Sleep \r\n[color=orange]PERKS:[/color] Light Foot Perk for trap protection\r\n[color=orange]SPELLS:[/color] Selected via Magic Menu and default ones are Chain Lightning on left hand and Ice Storm on right hand\r\n[color=orange]CLOTHES:[/color] Sonia\\'s Magic Robe. She will wear anything\r\n[color=orange]WEAPONS:[/color] None. She will use any weapon\r\n[color=orange]SHOP:[/color] She sells many Magic and Enchanted goods including her Sonia\\'s Magic Robe and Summon Sonia spell\r\n[color=orange]SPECIAL FEATURES:[/color]\r\n-- Fixes Followers Bows problem in two methods: first for all followers by removing \\\"followerhuntingbow\\\" alias from \\\"DialogueFollower\\\" quest dialogue, fixing the occurrence that adds them to the followers inventory when they start following the player - second if you have other mod conflicting with DialogueFollower that undoes my changes, I also did a script to remove them everytime they are added to Sonia\\'s inventory\r\n-- Magic menu that you can easily select which spells she uses in both right and left hand [u](Adept Destruction spells - more in the next version)[/u]\r\n---- Close wounds and ironflesh option that when active she will automatically cast when her health gets below 20%\r\n---- Heal player option that when active she will automatically cast when his health gets below 40% (only casts when she is following player)\r\n---- Invisibility sneaking option that when active she will cast invisibility spell for 120 seconds while sneaking\r\n-- Training menu where the player can learn with her all Magic skills\r\n-- Fate menu with option to change her essential flag\r\n-- Dialogue menus with proper [Go Back]\r\n-- Options Alert Message System\r\n\r\nThe best way to find out her options is to play it and see for yourself!\r\n\r\n[b][color=yellow]CLOTHES:[/color][/b]\r\n[b]Sonia\\'s Magic Robe:[/b]\r\n- Fortify Destruction: 30 points\r\n- Fortify Magicka: 30 points\r\n- Increase Magicka Regenerate: 150%\r\n\r\n[b][color=yellow]LOCATION:[/color][/b]\r\n[b]Sonia:[/b]\r\n  - Dragonsreach in Whiterun\r\n\r\n\r\n\r\n[center][color=pink][size=6][b]- Troubleshooting -[/b][/size][/color][/center]\r\n\r\nNo issues so far.\r\nPlease let me know if you find any in the comments section.\r\n\r\nMy mod is made to work with any other mod, as it only creates new data and doesn\\'t change existing one. But it is still dependent on the follower and marriage systems of the game. So you should choose wisely which mods to install since there are many that change important things without prior warning. Consequently damaging other mods. Mine is (other) mod friendly! I guarantee. ;)\r\n\r\n\r\n\r\n[color=pink][size=5][b]Some Words[/b][/size][/color]\r\n\r\nI would like to thank everyone that comes to me supporting RWK and Sonia since FO3 version. I\\'ve been around for sometime and it\\'s been a pleasure learning how to basic mod in Bethesda games. When I started I had no knowledge whatsoever in any kind of modding and scripting. This really grown in me a lot with help and support from many good people.\r\nI don\\'t get much free time nowadays since I have what every family man has, responsibilities. So it\\'s much appreciated your support (endorsements, kudos or simply thanks)  to keep me interested and investing my few minutes on PC on this special mod.\r\n\r\n\r\n[color=pink][size=5][b]Contact[/b][/size][/color]\r\n\r\nSend me a PM here.",
  "categoryId": "33",
  "version": "0.41",
  "author": "Stirred",
  "createdUnix": "1337904226",
  "updatedUnix": "1339097876",
  "containsAdultContent": false,
  "uploadedBy": "Stirred",
  "primaryFile": null,
  "files": [
    {
      "fileId": "64876",
      "name": "Sonia Companion 0-4",
      "version": "0.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2149",
      "fileName": "Sonia Companion 0-4-17620.rar",
      "uploadedUnix": "1338494142",
      "modVersion": "0.4",
      "virusScanUrl": "https://www.virustotal.com/file/4f3733f8b89df7b6553262606bdd72ab542261fcb16908866c3a21496aa23aba/analysis/1406928390/",
      "changelogHtml": " Added Magic menu option to Heal herself <br/> \n Added Magic menu option to Heal Player <br/> \n Added Fate menu to change her essential flag <br/> \n Increased her min level to 25 <br/> \n Fixed her Combat style when she wouldn\\'t cast any spells <br/> \n Added Options Alert Message System to show you which options you are selecting <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sonia%20Companion%200-4-17620.rar?fid=64876&ttl=1535783791&ri=8192&rs=8192&setec=16cf08e5370684e357e20365c5430d38"
    },
    {
      "fileId": "66563",
      "name": "Sonia Companion 0-41",
      "version": "0.41",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2149",
      "fileName": "Sonia Companion 0-41-17620-0-41.rar",
      "uploadedUnix": "1339097876",
      "modVersion": "0.41",
      "virusScanUrl": "https://www.virustotal.com/file/0387b23daf43f234204f856e83f23e0c290f986b5e7f54b6278d00a98e1c5c21/analysis/1406945226/",
      "changelogHtml": " Fixed Sonia\\'s Robe not showing up on her vendor list <br/> \n Fixed AI Packages not working (?) <br/> \n Changed her location to Dragonsreach <br/> \n Added event on load to prevent her from getting undressed when changing cells <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sonia%20Companion%200-41-17620-0-41.rar?fid=66563&ttl=1535783792&ri=8192&rs=8192&setec=33d8c38d8e09305f05e6fbcb4c1e948b"
    }
  ]
}