{
  "modId": 17634.0,
  "modName": "Moon-and-Star Ring - Morrowind Lore Friendly",
  "summary": "Moon-and-Star Ring - Nerevarine\\'s Test (Lore Friendly Edition).\r\nAdds the Morrowind artifact to Skyrim, but if you are not the Nerevarine now, wearing it will be fatal...",
  "descriptionHtml": "This is a lore-friendlier version of Moon-and-Star - a Morrowind artifact for Skyrim by PrivateEye\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=13220] http://skyrim.nexusmods.com/downloads/file.php?id=13220 [/url]\r\n\r\nNew version by jackstarr\r\nv0.5 \r\n\r\nCredits: Model and textures were created by PrivateEye.\r\nNew script and implementation: By jackstarr with thanks to helpers at the Bethesda Creation Kit forum.\r\n\r\nThis mod adds the ring Moon-And-Star from Morrowind to the world of Skyrim.  In Morrowind, this ring has been created by Kagrenac and \\\"blessed\\\" by Azura as a test for the true Nerevarine, reincarnation of Nerevar.  The ring will kill any person that is not the true Nerevarine, but will grant fortify personality and speechcraft if you are the real Nerevar reborn and are able to wear it.\r\n\r\nThe ring has been placed in a secure Strongbox (expert lock level) at the Shrine of Azura.\r\n\r\nIf you are not the Nerevarine, you will die immediately. You get a message saying \\\"You are a false Nerevarine, and must die!\\\" and your character is killed straight away.\r\n\r\nYou are able to pick up the ring, look at it in your inventory, sell it for some quick cash, or even possibly reverse pickpocket in the hope of your victim deciding to wear the ring!\r\n\r\n\r\nThis is the standard setting for this mod, as we don\\'t have any evidence from Bethesda that the original Nerevarine from Morrowind is dead, and therefore his reincarnation would not be appropriate.  However...\r\n\r\n-----\r\nIf you want to roleplay as the Nerevarine with this version of the mod - now you can! This is a completely optional feature and you must access this via the console.  Bring up the console, and type:\r\nhelp nerevarine\r\n\r\nYou will see a few options - one of which refers to a perk.  This is the one you want.  The actual code will depend on your load order, but will end in 00331E.  Type the code you see in the console:\r\nplayer.addperk xx00331E\r\n(replace the xx with the first two letters of the number that you see in the console)\r\n\r\nThis adds a perk called \\\"Nerevarine\\\" - adding resist disease 100% (\\\"Neither blight nor age can harm him\\\") and also serves the purpose of setting up a condition to be tested when wearing the ring.\r\n\r\nIf you have added the Nerevarine perk and you try to equip the ring, you get a message saying \\\"You are the true Nerevarine!\\\" and you get fortify speech 10% while wearing the ring (the original in Morrowind boosts speechcraft by 5% and personality by 5%, so this is the closest I could manage). \r\n\r\nAlternatively, PrivateEye\\'s original version of the mod also allows you to roleplay as the Nerevarine.\r\n\r\n\r\nINSTALLATION:\r\nUse NMM, or manually add the MoonAndStarRing esp and the meshes, scripts and textures folders to your Skyrim data directory.\r\n\r\nUNINSTALLATION:\r\nIf you used NMM to install, simply deactivate and delete via NMM.  Make sure you delete via NMM as well as deactivate.  It is NOT enough to just deactivate mods with scripts in Skyrim.  Scripts may still be running. \r\nIf you installed manually, make sure you remove MaSCurseEffectReal.pex from the Scripts subdirectory of the skyrim Data folder.\r\n\r\n\r\nVersion history:\r\nv0.5 Added meshes/textures to this download - earlier versions required downloading PrivateEye\\'s mod before installing this one.  Now everything is all included in this one file.\r\nv0.2 Added optional perk\r\nv0.1 Initial release",
  "categoryId": "92",
  "version": "0.5",
  "author": "jackstarr",
  "createdUnix": "1337927730",
  "updatedUnix": "1346174106",
  "containsAdultContent": false,
  "uploadedBy": "jackstarr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "63523",
      "name": "Moon And Star - Not The Nerevarine - Lore Friendly Edition",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "Moon And Star - Not The Nerevarine - Lore Friendly Edition-17634.zip",
      "uploadedUnix": "1337930663",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/eb43d21ac6a0d15f27904bfd41382f4356071c7016c24c3389b6cd070efafe92/analysis/1406914024/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Moon%20And%20Star%20-%20Not%20The%20Nerevarine%20-%20Lore%20Friendly%20Edition-17634.zip?fid=63523&ttl=1535783815&ri=8192&rs=8192&setec=b360039254e07c2dd76e7df82b0ddea7"
    },
    {
      "fileId": "63827",
      "name": "Moon-And-Star-Ring - Nerevarines Test",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Moon-And-Star-Ring - Nerevarines Test-17634-0-2.zip",
      "uploadedUnix": "1338059355",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/2a075d37567122546a425d262ae666e3db686f5e233f8e05bd46ff0ccf5c8007/analysis/1406917099/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Moon-And-Star-Ring%20-%20Nerevarines%20Test-17634-0-2.zip?fid=63827&ttl=1535783815&ri=8192&rs=8192&setec=bbee2b6cabdc3078a9e3b8b7a9cd2208"
    },
    {
      "fileId": "84859",
      "name": "Moon-and-Star Ring - Nerevarines Test",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "628",
      "fileName": "Moon-and-Star Ring - Nerevarines Test-17634-0-5.zip",
      "uploadedUnix": "1346174106",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/99e0b61d6af35b115f4be2c658fa3ca1ebd899acc0a11f77f8603dd7fe8b3d33/analysis/1407128289/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Moon-and-Star%20Ring%20-%20Nerevarines%20Test-17634-0-5.zip?fid=84859&ttl=1535783816&ri=8192&rs=8192&setec=2433ad126bb00619c2ff59a8a1491d26"
    }
  ]
}