{
  "modId": 17632.0,
  "modName": "The Way of the Voice",
  "summary": "Small, simple mod that adds various options for reducing the rebuild time between shouts. The aim of this mod is to make shouting a bigger part of the game and closer to a more viable style of combat/gameplay for your character.",
  "descriptionHtml": "Small, simple mod that adds various options for reducing the rebuild time between shouts. The aim of this mod is to make shouting a bigger part of the game and a more viable style of combat/gameplay for your character.\r\n\r\nNOTE: I encourage you to download all the various options and try them all out! But I recommend only having one activated at a time, as they will conflict with each other. I can\\'t foresee any conflicts with other mods though!\r\n\r\nFile 1 (The Way of the Voice): Changes the \\\"Time reduced between shouts\\\" effect on Amulets of Talos from 20% to 60%. Coupled with the \\\"Blessing of Talos\\\" from Talos shrines, that\\'s 80% reduced time between shouts! \r\n\r\nFile 2 (The Way of the Voice - Option 2): Places an amulet called \\\"Windcaller\\'s Talisman\\\" at the foot of the word wall on the Throat of the World that reduces the time between shouts by 70%. Adding the blessing from a Shrine of Talos makes it 90%. (Amulets of Talos stay at 20% reduction.)\r\n\r\nFile 3 (The Way of the Voice - Option 3): Probably the most balanced of the three files. Now the blessings from Shrines of Talos reduce the time between shouts by 50% while Amulets of Talos reduce the time between shouts by 40%. This option adds more of a roleplaying flavour by giving your character a reason to pray to Talos as often as possible in order to reap the full benefits of this now-powerful blessing.\r\n\r\nThrough your choice of file and different combinations of blessings, you can now have the time between your shouts reduced by 20, 40, 50, 60, 70, 80, or 90%! Very powerful and simple customization for such a little mod! Now you can find your own middle-ground between balance and role-playing.\r\n\r\nYou can finally play like a real Dragonborn, and ONLY use shouts in combat! Those old Greybeards would be proud.\r\n\r\nI was tired of hesitating when using the really interesting shouts like Call Dragon, Call of Valour, and Storm Call and wanted my shouts to have more of an impact on my playstyle than before. The cooldown on some of them was just TOO LONG. I never reduced the time between shouts all the way to 100% though because I did not want this mod to be cheap or exploitative, and I wanted the shouts to remain strategic and lore-friendly. Besides, you still have to learn the words and kill the dragons yourself ;)\r\n\r\nLet me know if there are any problems. Pretty easy installation, just choose a file, download it, and put the .esp file(s) in your Skyrim data folder; Or make it even easier by downloading with the mod manager.\r\n\r\nNOTE: If you go with the second file, try to pick up the talisman before pissing off Paarthurnax; only because the following fight could very possibly knock the talisman off the mountain or even worse: through the game-world.\r\n\r\nP.S.: This is my first mod uploaded on this site and my first Skyrim mod. As I said, it\\'s rather simple, but any support - and more importantly, any FEEDBACK - would be very encouraging :)",
  "categoryId": "77",
  "version": "3.0",
  "author": "Vuavu",
  "createdUnix": "1337926149",
  "updatedUnix": "1338102580",
  "containsAdultContent": false,
  "uploadedBy": "Vuavu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "63519",
      "name": "The Way of the Voice",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "The Way of the Voice-17632-1-0.7z",
      "uploadedUnix": "1337926807",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/60d43c333221f68b9231b0d92de24323c01424b6bf110dbeb5bc337ebc71158b/analysis/1406914022/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Way%20of%20the%20Voice-17632-1-0.7z?fid=63519&ttl=1535783812&ri=8192&rs=8192&setec=c384eeab2980badb465168b26f344900"
    },
    {
      "fileId": "63926",
      "name": "The Way of the Voice - option 2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "The Way of the Voice - option 2-17632-2-0.7z",
      "uploadedUnix": "1338097574",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/5fa8e6225f4b26251442b3ae5efd41dc49610f79ccc81c2de09f251f6b27036f/analysis/1406917924/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Way%20of%20the%20Voice%20-%20option%202-17632-2-0.7z?fid=63926&ttl=1535783812&ri=8192&rs=8192&setec=c697fba1e5165236df965e6bfabb976c"
    },
    {
      "fileId": "63937",
      "name": "The Way of the Voice - Option 3",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "The Way of the Voice - Option 3-17632-3-0.7z",
      "uploadedUnix": "1338102580",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/5057f4f5aa5b3b233d5c821c1eb269014b77b2e42fdba580986108ecf9526a8f/analysis/1406917984/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Way%20of%20the%20Voice%20-%20Option%203-17632-3-0.7z?fid=63937&ttl=1535783813&ri=8192&rs=8192&setec=7b80ebe7450b2c1434e348cd66ae1285"
    }
  ]
}