{
  "modId": 17642.0,
  "modName": "Phenotypes for CBBE",
  "summary": "This mod creates four different phenotypes (body types) in Skyrim, giving old women old looking bodies in the process. They all use the in-game body-size slider correctly, effectively tripling the variety of bodies. Three of the bodies are playable by the player and are randomly distributed among NPCs. The fourth body type is used by all old women.",
  "descriptionHtml": "[color=#ff0000]IF YOU\\'RE TOO LAZY TO READ THE WHOLE DESCRIPTION AT LEAST READ THIS:[/color] Firstly, take the time, it\\'s only 5 minutes out of your day and it will prevent a lot of potential confusion. If you\\'re really set on not reading the rest of the description, all you need to do to install CBBE, and then go to the download tab and install either one of DD3\\'s Body Packs or Caliente\\'s Body Pack over it. I really recommend you get one my body pack (DD3\\'s Body Packs) and not Caliente\\'s, because the three bodies in mine were specifically made to be noticeably different from each other. There\\'s an image comparison of the body packs in the pictures tab. \r\n\r\n[color=#990099]<><><><><><><><><><><><><><><><><><><><>\r\n[size=5]DD3\\'s Phenotypes for CBBE[/size]\r\n<><><><><><><><><><><><><><><><><><><><>[/color]\r\n[i][b]v0.6[/b][/i]\r\n\r\nSections\r\n[list][*]Description\r\n[*]Installation\r\n[*]Known Issues/Incompatibilities\r\n[*]How to install custom bodies using BodySlide - Now easier with PhenotypeMaker!\r\n[*]Changelog\r\n[*]Credits and Thanks[/list]\r\n\r\n\r\n[color=#990099][u][size=3]Description[/size][/u][/color]\r\n\r\nFirst, a summary of the features:\r\n[list][*]Phenotypes for all the ladies of Skyrim, adding lots of variety\r\n[*]Old women have old women bodies\r\n[*]Phenotypes weighted by job (barmaids will tend towards more curvy bodies, while working class women like farmers or miners will usually have slimmer variants)\r\n[*]Scripted version assigns phenotypes to each person and makes sure they only equip armor that \\\"fits\\\"\r\n[*]All of the vanilla armors that Caliente has converted for CBBE are supported (for the scripted version, everyone can equip all unsupported armor)\r\n[*]Choice between Caliente\\'s original bodies (Vanilla, Slim, Curvy) or mine, created with bodyslide. My bodies were created to be somewhat realistic while still having that touch of unrealistic fantasy-girl look. I also have an even more realistic pack available. See images for comparison\r\n[*][color=#00ff99]Planned features...[/color]\r\n[*]Add functionality for ALL vanilla armors (currently waiting for Caliente to convert them to CBBE and BodySlide)\r\n[*]Add (semi)lore-friendly user-created armors and phenotype functionality for them. This requires outfits that have BodySlide support (and have a male model). Hopefully this will be more common when Caliente finishes the tutorial she\\'s making.\r\n[*]Possibly add phenotypes for males... I think this would be cool (who doesn\\'t wanna see big ol\\' burly barbarian-type dudes sometimes?) but it\\'s sort of unrealistic, unless I find three male bodies and their associated vanilla armor conversions (I\\'d do it myself but I\\'m no pro modeller and importing skyrim nifs to blender seems like it requires more hoop-jumping than a circus)\r\n[*]Find better way to handle scripting (it works fine most of the time, but it COULD be less buggy and that bothers me)\r\n\r\nThis mod creates three different phenotypes (body types) in Skyrim (females only for now), both for the player to choose from, and distributed randomly among NPCs. The three body types will use the in-game body-size slider correctly as well, effectively tripling the variety of bodies. In addition, elderly women of Skyrim have bodies that suit their age, instead of looking like spry young women from the neck down. All vanilla clothes and armor that have been converted by Caliente [url=http://skyrim.nexusmods.com/downloads/file.php?id=12273]here[/url] have been included, and more will be added as they are converted. For each of these clothes and armors, there are three separate items, like so (using studded armor as an example):\r\n\r\n\\\"Studded Armor\\\"     - Body 1\r\n\\\"Studded Armor [S]\\\" - Body 2\r\n\\\"Studded Armor [V]\\\" - Body 3\r\n\r\nEquipping these will basically morph you into the appropriate body type. If you install the scripted version, you can choose a body type and you can\\'t equip armor or clothing that doesn\\'t fit. This brings me to the various options for the mod.\r\n\r\n\r\n[u][i]First option - Nonscripted/Scripted[/i][/u]\r\n\r\nNonscripted: The player and all the NPCs have Body 1 when no armor is equipped to them. You and all NPCs can wear any armor or clothing, wearing the one with the appropriate tag will make you appear to have that body type. [color=#008000]Pros: Should be compatible with nearly all mods (see compatibility section for details)[/color] [color=#cc0000]Cons: It\\'s a little strange for a dead NPC to suddenly drop (or gain) 3 cup sizes when you loot their armor off of them, and you don\\'t get to see bodies 2 or 3 in the nude. This version gives old women young bodies.[/color]\r\n\r\nScripted: You choose a body type when a save is first loaded or a new game is started with this mod activated. From this point on, you can\\'t equip armor that doesn\\'t match your body type. When no armor is equipped, you\\'ll have your appropriate body type: if you chose \\\"slim\\\" or \\\"voluptuous\\\", you\\'ll automatically be equipped with an \\\"outfit\\\" that is simply a naked body (don\\'t drop this object as it may screw up the mod) anytime my scripts notice that you\\'re either naked or wearing armor that doesn\\'t fit. NPCs will be randomly be assigned a body type as well, and should also have their appropriate body type when naked. Old women have their appropriate bodies all the time as well. [color=#008000]Pros: It\\'s cooler. Old women don\\'t stick out as having bodies way too nice for their age. I\\'ve tested it quite a bit and works as intended as far as I\\'ve seen.[/color] [color=#cc0000]Cons: This option is a BETA, meaning if it causes mayhem (crashes your game, breaks your save, doesn\\'t play nice with other mods, randomly undresses people, etc) don\\'t come crying to me, I warned you. Don\\'t be scared off, it\\'s worked well for me so far, I\\'m just sayin.[/color]\r\n\r\n\r\n[u][i]Second option - Body types: Calinte\\'s/Mine/Yours[/i][/u]\r\n\r\nCaliente\\'s: \\\"Vanilla\\\" as Body 1, \\\"Slim\\\" as Body 2, \\\"Curvy\\\" as Body 3.\r\n\r\nMine: Uses bodies I made in BodySlide using CB++ (you can find CB++ at [url=http://www.loverslab.com/showthread.php?tid=6900]LoversLab[/url]). \\\"Average\\\" as Body 1, \\\"Slim\\\" as Body 2, \\\"Voluptuous\\\" as Body 3. These are just bodies made according to my tastes, thought I\\'d share ;) (Note I use the word \\\"Average\\\" for lack of a better word... More of a bottom-heavy body. See pics for comparison) \r\n\r\nYours: By replacing the right meshes in your Data folder, you can mix and match any bodies for phenotypes exactly to your liking using bodies and clothing/armor models you made in BodySlide. Detailed instructions further down.\r\n\r\n\r\n[color=#990099][u][size=3]Installation[/size][/u][/color]\r\n\r\n1.) You need the right textures. Install the textures from [url=http://skyrim.nexusmods.com/downloads/file.php?id=2666]CBBE[/url]. If you already have CBBE installed in its entirety, that\\'s fine too, you\\'ll just need to overwrite some of it later.\r\n\r\n2.) In the downloads section of this mod, download and install either \\\"Phenotypes - Caliente Bodies\\\" OR \\\"Phenotypes - DD3 Bodies\\\". If you want to use custom bodies (made in BodySlide, etc) then install either pack, and scroll down for detailed instructions on how to install custom bodies.\r\n\r\nBONUS: If you installed the DD3 body pack, you can also install [url=http://skyrim.nexusmods.com/downloads/file.php?id=7093]NoMaaM Breathing Idles[/url] and the skeletons from [url=http://skyrim.nexusmods.com/downloads/file.php?id=4888]CCHSBHC - BBP[/url] for extra bouncing! ;)\r\n\r\n3.) Activate \\\"Phenotypes - Main.esp\\\"\r\n\r\n4.) If you want to use scripted mode, install [url=http://skse.silverlock.org/]SKSE[/url], and activate \\\"Phenotypes - Scripted.esp\\\" (Make sure to load it AFTER \\\"Phenotypes - Main.esp\\\")\r\n\r\n\r\n[color=#990099][u][size=3]Known Issues/Incompatibilities[/size][/u][/color]\r\n\r\n[u][i]Known Issues[/i][/u]\r\n\r\nMajor: [list][*](Scripted version only) I suspect that very strange things might happen if you give a companion an armor that doesn\\'t fit them, up to and including crashing Skyrim... Untested.[/list]\r\nMinor: [list][*](Scripted version only) NPCs with no clothes.\r\n[*]Clipping with some armors for my body types, especially for \\\"Slim.\\\"[/list]\r\n\r\n[u][i]Incompatibilities[/i][/u]\r\n\r\nWill interfere with any mod that edits leveled lists for clothing and armor (changes levels at which different armors appear). The scripted version MAY additionally interfere with mods that edit any of the converted armors and clothes.\r\n\r\n\r\n[color=#990099][u][size=3]How to install custom bodies - Now easier with PhenotypeMaker![/size][/u][/color]\r\n\r\nREQUIRES: BodySlide v1.3 and the vanilla armors addition for BodySlide, both released by Caliente. Also, for a bunch more sliders, you can download CB++ by stuffed_bunny. (For links, scroll down to the credits section)\r\n\r\n1.) Make the bodies you want using BodySlide, and save them as presets. (I\\'m not going to give a tutorial for installing and using BodySlide, that\\'s been covered elsewhere by better teachers than I.)\r\n\r\n2.) Go to the download page for this mod, download \\\"Phenotypes - Custom Bodies Kit\\\", and install using NMM, or extract to your Skyrim/Data Folder. (Even the empty folders: PhenotypeMaker needs the folder structure set up already in order to run correctly)\r\n\r\n3.) BatchBuild all the vanilla clothing and armor the body you want for your phenotype (If you have multiple phenotypes you want to install, just do one for now).\r\n\r\n4.) Run PhenotypeMaker.exe, which should be in your Data folder. Follow the prompts.\r\n\r\n5.) Repeat steps 3 and 4 for any additional body types, EXCEPT for \\\"Average\\\" phenotype: For that, see step 6. Note: PhenotypeMaker overwrites any existing phenotype installed under that name. Meaning, if you like my \\\"Slim\\\" phenotype, but want to make your own \\\"Voluptuous\\\" and \\\"Average\\\" phenotypes, install my body pack, then follow these steps for \\\"Voluptuous\\\" and \\\"Average\\\", but not \\\"Slim\\\".\r\n\r\n6.) To install the \\\"Average\\\" phenotype, simply BatchBuild it AFTER you\\'re done with all the other body types, no need to run PhenotypeMaker. (If you decide to go back and change one of the other phenotypes, you will have to BatchBuild the \\\"Average\\\" one again as well.)\r\n\r\n\r\n[color=#990099][u][size=3]Changelog[/size][/u][/color]\r\n\r\n[b]v0.61[/b]Updated scripts to (hopefully) fix save breaking issue (scripted version only, obviously).\r\n[b]v0.6[/b] Scripted version now gives old women proper old women bodies. \\\"DD3\\'s Body Pack - Realistic\\\" added. Fixed a problem in DD3\\'s Body Pack where all three forsworn armors used the same body type. Added custom phenotypes kit.\r\n[b]v0.51[/b] Updated DD3 bodies to have a more realistic waist. Included required ESPs with body packs.\r\n[b]v0.5[/b] Released\r\n\r\n\r\n[color=#990099][u][size=3]Credits and Thanks[/size][/u][/color]\r\n\r\nBethesda for making Elder Scrolls, and for giving us the tools to make the games whatever we want!\r\nCaliente for [url=http://skyrim.nexusmods.com/downloads/file.php?id=2666]CBBE[/url] and [url=http://skyrim.nexusmods.com/downloads/file.php?id=12273]Calientes Vanilla Armor for CBBE[/url]\r\nstuffed_bunny for [url=http://www.loverslab.com/showthread.php?tid=6900]Bodyslide CB++[/url]\r\nMe :D\r\n",
  "categoryId": "29",
  "version": "0.61",
  "author": "DrummerD3",
  "createdUnix": "1337947274",
  "updatedUnix": "1339744365",
  "containsAdultContent": true,
  "uploadedBy": "DrummerD3",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68101",
      "name": "Phenotypes - DD3 Realistic Body Pack",
      "version": "0.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6708",
      "fileName": "Phenotypes - DD3 Realistic Body Pack-17642-0-6.7z",
      "uploadedUnix": "1339743851",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/ea50d6435c02b4dd3e3944efc40e023681a356d24fa37f57545ecde0185e00d2/analysis/1406960227/",
      "changelogHtml": " Scripted version now gives old women proper old women bodies. <br/> \n \"DD3&#39;s Body Pack - Realistic\" added. <br/> \n Added the custom bodies kit. <br/> \n Fixed a problem in DD3&#39;s Body Pack where all three forsworn armors used the same body type. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Phenotypes%20-%20DD3%20Realistic%20Body%20Pack-17642-0-6.7z?fid=68101&ttl=1535783831&ri=8192&rs=8192&setec=3577768c6624fa7a7e967ff29c8bc0d1"
    },
    {
      "fileId": "68102",
      "name": "Phenotypes - DD3 Body Pack",
      "version": "0.61",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6889",
      "fileName": "Phenotypes - DD3 Body Pack-17642-0-61.7z",
      "uploadedUnix": "1339743920",
      "modVersion": "0.61",
      "virusScanUrl": "https://www.virustotal.com/file/124fe26f4cf6383c631720e64082ad306f3c1617710dc70e40a20139cfc7e383/analysis/1406960235/",
      "changelogHtml": " Updated scripts to (hopefully) not break saves (scripted version only, obviously). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Phenotypes%20-%20DD3%20Body%20Pack-17642-0-61.7z?fid=68102&ttl=1535783832&ri=8192&rs=8192&setec=2cbc80edc325ee49806e4230d785b602"
    },
    {
      "fileId": "68104",
      "name": "Phenotypes - Caliente Body Pack",
      "version": "0.61",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6131",
      "fileName": "Phenotypes - Caliente Body Pack-17642-0-61.7z",
      "uploadedUnix": "1339744086",
      "modVersion": "0.61",
      "virusScanUrl": "https://www.virustotal.com/file/fd626f2f9bab52474b52749e6ee90a1f306a74d0114db6f965695208d5ab78e6/analysis/1406960285/",
      "changelogHtml": " Updated scripts to (hopefully) not break saves (scripted version only, obviously). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Phenotypes%20-%20Caliente%20Body%20Pack-17642-0-61.7z?fid=68104&ttl=1535783832&ri=8192&rs=8192&setec=f1712f87fe8ec0c4a2553312cc3876a2"
    },
    {
      "fileId": "68105",
      "name": "Phenotypes - Custom Bodies Kit",
      "version": "0.61",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "58",
      "fileName": "Phenotypes - Custom Bodies Kit-17642-0-61.7z",
      "uploadedUnix": "1339744242",
      "modVersion": "0.61",
      "virusScanUrl": "https://www.virustotal.com/file/552ff04e75db37272dbb1546ffaee0df6a08b877034926efed78afd757145c32/analysis/1406960285/",
      "changelogHtml": " Updated scripts to (hopefully) not break saves (scripted version only, obviously). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Phenotypes%20-%20Custom%20Bodies%20Kit-17642-0-61.7z?fid=68105&ttl=1535783833&ri=8192&rs=8192&setec=c6a7ab286ed5f522867b0f02bb933134"
    },
    {
      "fileId": "68106",
      "name": "Update to v0_61",
      "version": "0.61",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "8",
      "fileName": "Update to v0_61-17642-0-61.rar",
      "uploadedUnix": "1339744365",
      "modVersion": "0.61",
      "virusScanUrl": "https://www.virustotal.com/file/4b9cdc22c6bce251e869d5124142b669857ba318910955c7376b5f35f293667f/analysis/1406960286/",
      "changelogHtml": " Updated scripts to (hopefully) not break saves (scripted version only, obviously). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Update%20to%20v0_61-17642-0-61.rar?fid=68106&ttl=1535783833&ri=8192&rs=8192&setec=88872205f7c70010b29db8901161f91f"
    }
  ]
}