{
  "modId": 17685.0,
  "modName": "Better WARZONES Soldier Uniforms",
  "summary": "This mod makes Imperial and Stormcloak armies in the WARZONES mod have more variety in their armour.",
  "descriptionHtml": "[b]=Description=[/b]\r\n\r\nWhile WARZONES is one of my favourite mods, I found that the Imperial/Stormcloak uniforms are lacking in any variation. There was a mod to fix this issue, but it wasn\\'t quite to my tastes since it adds armors to the game, rather than using the vanilla ones. So, I created my own mod.\r\n\r\nNote, you have to use WARZONES or else this mod will not make any changes. This mod doesn\\'t include any files from the WARZONES mod.\r\n\r\n[b]There\\'s also a Cloaks of Skyrim compatible version included.[/b]\r\n\r\nThese are the new uniforms. Weapons stay the same.\r\n\r\n[b]=Imperials=[/b]\r\n\r\n[b]Imperial Archer:[/b] Full Imperial Light armor. Also, there is a small chance of them having a shield. I hated how they always pulled out a shield and transformed into a regular soldier.\r\n\r\n[b]Imperial Soldier - Light:[/b] 3/4 times the spawned Imperial soldiers will have a light set. This set includes Studded Imperial armor, Light Imperial helmet, Heavy Imperial gauntlets and boots, and if they happen to spawn with a shield, Light Imperial shield.\r\n\r\n[b]Imperial Soldier - Heavy:[/b] 1/4 times the spawned Imperial soldiers will have a heavy set. This set includes Full set of Heavy Imperial equipment, and if they happen to spawn with a shield, Heavy Imperial Shield.\r\n\r\n[b]Imperial Mage:[/b] Light Imperial boots, 50% chance of having Light Imperial bracers, A novice level magic robe (higher chance of getting simple Novice Robes than specialised, e.g. Destruction Robes) and a high chance of having a hood, either Novice hood or an unenchanted hood.\r\n\r\n[b]Imperial Commander:[/b] Full set of Heavy Imperial armor, including the shield. The helmet is different from Heavy Soldiers\\' helmets, it can either be an Imperial Officer\\'s helmet or an extremely rare vanilla Closed Imperial helmet (not so rare now).\r\n\r\n[b]=Stormcloaks=[/b]\r\n\r\n[b]Stormcloak Archer:[/b] a Stormcloak Cuirass, 4/5 chance of a Hide helmet, 1/5 chance of a Scaled helmet, Stormcloak boots, Stormcloak gloves, and a small chance of having a shield.\r\n\r\n[b]Stormcloak Soldier:[/b] Stormcloak Cuirass and helmet, 3/4 times Iron boots and gauntlets, 1/4 times standard Stormcloak boots and gloves. The shield is not a part of their outfit, but their weapon list, so it is left unchanged.\r\n\r\n[b]Stormcloak Mage:[/b] Stormcloak Boots, 50% chance of having either Scaled bracers or Stormcloak gloves, and robes/hoods work the same way as Imperial Mages\\' robes/hoods.\r\n\r\n[b]Stormcloak Commander:[/b] Stormcloak Officer\\'s (Bear) Cuirass and helmet. 2/3 chance of having Steel boots and gauntlets, 1/3 chance of having Bear boots and gauntlets.\r\n\r\n[b]=Also=[/b]\r\nBoth factions\\' commanders have a 25% chance of having a low or a mid level enchanted ring.\r\n\r\n[b]=Installation=[/b]\r\nInstall through NMM, you will be presented with a small window whether to choose default or a Cloaks of Skyrim compatible version. Make sure this mod\\'s .esp file is loaded after all the WARZONES files in the load order!\r\n\r\nIf you are using Cloaks of Skyrim, make sure this mod is loaded after Cloaks.esp!\r\n\r\n[b]=Uninstallation=[/b]\r\nJust uninstall using NMM. Simple as that.\r\n\r\n[b]Permissions/Legal[/b]\r\nThis mod doesn\\'t contain anything from WARZONES (or Cloaks of Skyrim), so this mod is perfectly fine to upload. WARZONES is an .esm file (master file) and this is a .esp (plugin) that uses WARZONES as a \\\"master\\\", meaning this mod only edits that master file.\r\n\r\nThanks to Wrye Bash, I managed to set a Cloaks.esp as a master file for this mod, meaning I do not include anything from Cloaks of Skyrim either.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Omeletter",
  "createdUnix": "1338027940",
  "updatedUnix": "1338028650",
  "containsAdultContent": false,
  "uploadedBy": "Omeletter",
  "primaryFile": null,
  "files": [
    {
      "fileId": "63742",
      "name": "Better WARZONES Soldier Uniforms v1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "74",
      "fileName": "Better WARZONES Soldier Uniforms v1_0-17685.rar",
      "uploadedUnix": "1338028650",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0750ea405fca6ed0898e3aa049198efbae9c2e77b90ba1edad91c770f3575374/analysis/1406916193/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20WARZONES%20Soldier%20Uniforms%20v1_0-17685.rar?fid=63742&ttl=1535783908&ri=8192&rs=8192&setec=9b908ccd5105ebbecb95afc712be3cff"
    }
  ]
}