{
  "modId": 17711.0,
  "modName": "Dice Game in Taverns",
  "summary": "This mod adds a dice game that you can play at taverns.",
  "descriptionHtml": "Mod:  Readme - Dice Game in Taverns 1_2\r\nGame:  TES V: Skyrim\r\nAuthor:  Freddy the Noob\\'s Mod Team                                     \r\nDate:  12/19/12                   \r\n************************************************************************\r\nCONTENTS                          \r\n************************************************************************\r\n1. Information on the Mod\r\n2. Installation\r\n3. Version History\r\n4. Conflicts, Known Issues, and Troubleshooting\r\n5. Copy Status and Credits\r\n************************************************************************\r\n1. INFORMATION ON THE MOD           \r\n************************************************************************\r\n\t   This mod adds a dice game that you can play at taverns.\r\n\r\n\t   Some other video games have included games that you can play at taverns when you want\r\nto relax in the evenings when it is too dark to go adventuring and you are weary of killing things\r\nand even more weary of having things try to kill you.  Some people have complained that video game\r\ntaverns really aren\\'t very fun places to hang around in.  Your character can drink, but you as the \r\nplayer don\\'t actually get a buzz.  You can eat, but you can\\'t actually taste the food.  The NPCs\r\naren\\'t very good conversationalists and seem to say the same things over and over.  (Maybe that\r\npart is realistic.  I have encountered real-life drunks who repeat themselves.)  I guess you can \r\nlisten to the bard play \\\"Ragnar the Red\\\" over and over all night long.  Sometimes it is enough to \r\nmake you just want to go bed early or leave the silly tavern and go adventuring in pitch darkness.\r\n\r\n\t   So this mod adds a dice game that you can play to while away the long evening and maybe \r\nwin some gold.  It is a rather modest addition to the tavern, but it may help make it a more \r\ninteresting place to spend time at.\r\n\r\n\t   In the main tavern of each hold capital, you will find a male Wood Elf by a table with a \r\npair of dice on it.  You can talk to him to learn the rules of the dice game he is running, or to \r\ncollect your winnings if he doesn\\'t automatically give them to you before you click on him.\r\n\r\n\t   To play the game, you click on the dice that are laying on the table.  This rolls them.\r\nA bet of 10 gold is deducted from your inventory each time you roll.  During the process of playing\r\nthe game, the amount of gold you have will be periodically flashed in the upper left corner of the \r\nscreen so that you can track whether you are winning or losing without entering your inventory menu.\r\n\r\n\t   The object of the game is to get as high of dice rolls as you can to win bigger amounts.\r\nDifferent things happen according to what number you roll:\r\n\r\n7 or lower - You lose the gold you bet.\r\n8 - You get your bet returned to you with no gain or loss.\r\n9-10 - You win double the amount of gold you bet.\r\n11 - You win triple the amount of gold you bet.\r\n12 - You win quadruple the amount of gold you bet.\r\n\r\n\t   The dice are not loaded.  If the randomizing programming of Skyrim is functioning \r\ncorrectly, the game is a true simulation of a pair of dice being rolled.  The numbers should \r\ntherefore come up with the same frequency they would in the real world.\r\n\r\n\t   Beware though.  You should gamble responsibly.  The Wood Elves running this game are \r\ndoing it for profit.  They have connections with the Thieves Guild.  In this case, they are not \r\nactually doing anything dishonest.  The game is just set up so that the odds favor the house and \r\nnot the gambler over the long term.  The gambler knows the rules of the game and can evaluate the\r\nodds and decide whether or not to play.  Games like this use complicated reward schemes to make it\r\nmore difficult to calculate the odds of winning.  In this case, the game offers about a 95% \r\nreturn rate. \r\n\r\n\t   This mod uses custom voiced dialog and dice rolling sound effects.\r\n\r\n\t   So if you are looking for a mod that adds play value to the taverns, and if you are \r\nfeeling lucky and are excited about the prospect of winning a lot of gold, then you might enjoy\r\nthis mod.\r\n************************************************************************\r\n2. Installation                           \r\n************************************************************************\r\n           Extract (decompress) the .esp and the .bsa to your Skyrim directory.  \r\n(It will be something like *Installation directory*\\\\Skyrim\\\\SteamApps\\\\common\\\\Skyrim\\\\Data)\r\nMark the box next to \\\"Dice Game in Taverns.esp\\\" in your mod manager.\r\n \r\n           Alternately, extract files someplace else.  Then move the .esp and .bsa \r\nto Skyrim\\\\Data.  Mark the box next to the plugin in your mod manager.\r\n************************************************************************\r\n3. Version History    \r\n************************************************************************\r\nV 1_2    12/19/12   Added Born2bKilled\\'s improved dice textures.\r\nV 1_1    6/3/12     Fix to stop dice-rolling sound from occurring when dice not rolled because you \r\n\t\t    have no money to bet.\r\nV 1_0    5/26/12    Initial release.   \r\n************************************************************************\r\n4. Conflicts, Known Issues, and Troubleshooting\r\n************************************************************************\r\n\t   Since the Skyrim 1.5 update, mods like this one that use custom voiced dialog no longer \r\nwork right.  It is not known whether Bethesda will ever fix the problems it introduced.\r\n\r\n\t   Possible workarounds:  Install the mod. Load Skyrim with the mod active, but don\\'t try to \r\nplay it yet because the dialog may not be present yet.  Save the game.  Exit Skyrim.  Load Skyrim.\r\nPlay the savegame you saved.  Chances are that the dialog will now be present.  This is not a \r\ncertainty however.\r\n\r\n\t   Custom voiced dialog does not work well with Skyrim.  You might try tricks such as \r\nunpacking the .bsa and using loose files, using .fuz files or using .wav + .lip files.  Different \r\ncomputers seem to react differently, and I don\\'t know how to predict which computers which mods will \r\nwork on.\r\n\r\n\t   One option would be to remove the voice acting and use a mod or method to just have \r\nsilent dialog.  It is a shame that Skyrim is so buggy and unreliable.  Sad that people go to lots of\r\ntrouble to build mods and then not have them work right on all computers other than their own.\r\n\r\n\t   Don\\'t spend too much time trying to make this mod work on your computer.  If it is not \r\nworking, maybe you should just give up.  There are other mods out there that you could play.\r\n\r\n\t   In play-testing with this old mod on the new version of Skyrim on a computer that built the \r\nmod, the voiced dialog always worked when it was a reaction to a dice role, but it usually did not \r\nwork if I asked about how to play the game.  I would click on the name of the topic and nothing would \r\nhappen.  I would just be frozen looking at the dice elf.  I would have to push a button to escape and \r\nbe able to do another action.  But once in awhile the dialog would work properly.  Some theorize that \r\nthis type of Skyrim issue is related to lag and processor overload.  Skyrim can make the most powerful \r\ncomputers lag, and very slight lag that you can\\'t even notice while moving or fighting may be enough \r\nto derail dialog and scripting on a random and intermittent basis.     \r\n\r\n\t   It is expected that this mod will place a bit of a processor load on weaker computers and\r\nit is possible that they could have CTDs while the dice game is being played.  (Although this was \r\nnot witnessed in play-testing.)\r\n\r\n\t   Mods with scripting and persistent references increase savegame file size.  At some point\r\nit is possible that a particular savegame could become too large and could start suffering serious\r\nproblems and become unusable.\r\n\r\n\t   The dice are not animated because the mod team has no 3-D animator.\r\n\r\n\t   The dice game and its features are rather simple because the mod team has no heavy-duty\r\nscripter.\r\n\r\n\t   This mod adds the dice game to the main tavern in each hold capital.  It is not present in \r\nthe secondary taverns in hold capitals and in taverns in small villages. \r\n\r\n\t   There could be object placement conflicts with other mods which edit the taverns.  \r\n     \r\n\t   This mod probably needs more play-testing.\r\n\r\n\t   If you locate a bug in this mod, contact David Brasher of Freddy the Noob\\'s Mod Team\r\non TES Nexus so that the issue can be examined and hopefully fixed.\t   \r\n************************************************************************\r\n5. Copy Status and Credits           \r\n************************************************************************\r\nCredits:  \r\n\tFreddy the Noob\\'s Mod Team:\r\n\t   Freddy the Noob - Team Lead, Voice Actor\r\n\t   Born2bkilled - Modeling, Texturing\r\n\t   David Brasher - Questcoder/Scripter, Uploader/Caretaker\r\n\t   Clueless Punk - Object Placement\r\n\t   DungeonCrawler - Playtester\r\n\r\n\tBethesda for making Skyrim in an open format that anyone can mod.\r\n\t\t\r\nCopy Status:  Public domain with proper attribution and courtesy notification.  You may distribute\r\n\tthis mod or mods you made using things from this mod as long as you give credit to the authors \r\n\tand send notification to David Brasher on Skyrim Nexus stating that you have done this.      \r\n************************************************************************\r\n************************************************************************\r\n************************************************************************\r\n************************************************************************",
  "categoryId": "28",
  "version": "1.2",
  "author": "Freddy the Noobs Mod Team",
  "createdUnix": "1338064340",
  "updatedUnix": "1355950277",
  "containsAdultContent": false,
  "uploadedBy": "David Brasher",
  "primaryFile": null,
  "files": [
    {
      "fileId": "63836",
      "name": "Dice Game in Taverns 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1827",
      "fileName": "Dice Game in Taverns 1_0-17711-1-0.7z",
      "uploadedUnix": "1338064526",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/78e104626c1f155a0b2a06574e1d9fc19414d44b86ecf8afc12d537356b0b9e5/analysis/1406917145/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dice%20Game%20in%20Taverns%201_0-17711-1-0.7z?fid=63836&ttl=1535783976&ri=8192&rs=8192&setec=6027c112156afc8abdb72444864669f2"
    },
    {
      "fileId": "106239",
      "name": "Dice Game in Taverns 1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2605",
      "fileName": "Dice Game in Taverns 1_2-17711-1-2.7z",
      "uploadedUnix": "1355950277",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/ea7376a62b93e4410af59c424992161d3eb6fb1e72ae8f21e2647e7b2b3fdbd5/analysis/1407312429/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dice%20Game%20in%20Taverns%201_2-17711-1-2.7z?fid=106239&ttl=1535783977&ri=8192&rs=8192&setec=98c94007f1fb0981b8136998a405fa68"
    }
  ]
}