{
  "modId": 17739.0,
  "modName": "Skottorps Proudspire - 2nd Edition",
  "summary": "My take on the Proudspiremanor",
  "descriptionHtml": "Warning!  Has a conflict with heartfire, see comment section. This isn\\'t something I\\'m likly to fix in a near future since I\\'m busy with studies.\r\n\r\n\r\nUpdate;\r\n\r\nFixed the navmesh bug. Unfortunally, this means that those of you who downloaded the original mod (containing only an .esp file) will have to delete that file and redownload. If you\\'ve placed itmes in the manor you should remove them and save outside the manor to be sure they don\\'t get lost, or start over from an older save.\r\n\r\n\r\n\r\nRead This first! And it\\'s never a bad idea to back up your saves.\r\n\r\nThe weapon plaques behind the mannequins (the bow plaque in the picture) works one way only; you can mount a weapon but not dismout it again. Also, you might have to mount your weapons in a special sequence to get them all up since some seems to block others (make a quick save and experiment a little)\r\n\r\nThe same goes for some of the shield plaques in the stair house.\r\n\r\nThis is also my first time creating navmeshes so I\\'dont promise they are perfect, but they seem to work for me so far.\r\n\r\nAlso, I recomend always using the basment entrance to avoid moving mannequins (if they do, simply activate them and add/remove a piece of armour).\r\n\r\nThe female mannequins ain\\'t my creation and isn\\'t included but can be found here; http://skyrim.nexusmods.com/downloads/file.php?id=9131\r\n\r\n\r\nMod Description;\r\n\r\nRefurnishes the Proudspire manor in Solitude and adds two minor rooms; a food storage and a \\\"secret\\\" room (don\\'t worry, you\\'ll find it). The basement now has a kitchen, a full smithy, enchanting and alchemy working area (I wont claim I\\'m the first to come up with the idea, but do check out the alchemy cabinets). Second floor is now dining hall showroom with several mannequins/weapon plaques. Top floor has a libery and bedroom.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nCredit\\'s;\r\nGhaunadaur for puting me on the right track to solve the CTD/navmesh bug when modding player homes.",
  "categoryId": "67",
  "version": "1.0",
  "author": "Skottorp",
  "createdUnix": "1338106147",
  "updatedUnix": "1338289603",
  "containsAdultContent": false,
  "uploadedBy": "Skottorp",
  "primaryFile": null,
  "files": [
    {
      "fileId": "64379",
      "name": "Proudspire - 2nd edition",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "97",
      "fileName": "Proudspire - 2nd edition-17739-1.rar",
      "uploadedUnix": "1338289603",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d0ef827e036dcf61c217959dfe565ff376ca20dc7f99ef6b05c76b7f33178b79/analysis/1406923204/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Proudspire%20-%202nd%20edition-17739-1.rar?fid=64379&ttl=1535784036&ri=8192&rs=8192&setec=228a8f303ca97b0317c26d784263af86"
    }
  ]
}