{
  "modId": 17915.0,
  "modName": "Craftable Vanilla Weapons and Armor",
  "summary": "Allows you to craft weapons and armor that are otherwise uncraftable after doing the quests associated with the items.",
  "descriptionHtml": "Craftable Vanilla Weapons & Armor\r\n\r\nCVW&A is a mod I have been searching for but could not find. I decided to \r\n\r\nmake it after getting frustrated with having all these cool looking weapons \r\n\r\nand armors but no way to craft them and therefore enchant them with what I \r\n\r\nwant to enchant them with. At first it was going to be just the Nightingale \r\n\r\ngear but after looking at all the weapons and armor that should be \r\n\r\ncraftable but are not I decided to make this addon and distribute it on \r\n\r\nNexus.\r\n\r\nWhat this mod does is allows you to craft almost all the noncraftable \r\n\r\nweapons and armors in Vanilla Skyrim as long as you do the required \r\n\r\nprerequisites mostly a quest tied to the item in question.\r\n\r\nThere is no notice to say you learned the recipe that is something I \r\n\r\ncould not figure out but I will work on adding that part in a future \r\n\r\nupdate... Maybe (It will depend on how well received this mod is.)\r\n\r\nThis should not be unbalanced at all. I tried to keep everything balanced. \r\n\r\nAlthough I did up the damage or crit or armor rating on some items. If you \r\n\r\nfeel something is unbalanced let me know and I will go back and change it. \r\n\r\n\r\nAny bugs or adverse reactions to anything to do with this mod just let me know and I will try to fix and update it A.S.A.P.\r\n\r\n\r\nOK so what was it I did you ask?\r\n\r\nFor Armor here is what i did.\r\n\r\nNightingale Armor and Weapon Set \r\nCraftable after you take the oath and become a guardian of the Twilight \r\n\r\nSepulcher during the quest \\\"Trinity Restored\\\". Requires Daedric \r\nBlacksmithing and Advanced Blacksmithing and Arcane Blacksmithing.\r\n\r\nRedgaurd clothes \r\nAre now changed to armor and is craftable after you complete \\\"In My Time Of \r\nNeed\\\" and help Saadia or your race is Redguard.\r\n\r\nGreybeard Gear \r\nIs now armor and craftable after you return the horn during the quest \\\"The \r\nHorn of Jurgen Windcaller\\\". Requires Advanced Armorsmithing.\r\nThis might not work please let me know so I can fix it.\r\n\r\nMasque of Clavicus Vile \r\nCraftable after you complete \\\"A Daedra\\'s Best Friend\\\" and choose to not \r\nkill Barbas. Requires Advanced Armorsmithing and Daedric Armorsmithing.\r\n\r\nAncient Shrouded Armor \r\nCraftable after completing the quest \\\"Locate the Assassin of Old\\\". Requires \r\nAdvanced Black Smithing and Arcane Blacksmithing.\r\n\r\nCicero\\'s Gear \r\nIs now armor and craftable after you complete \\\"The Cure for Madness\\\" and \r\nlet Cicero live and acquire Dawnstar Sanctuary. Meeting him outside will \r\ngive you the recipe to craft his armor. Requires Advance Smithing\r\n\r\nExcecutioner gear \r\nCraftable after you complete \\\"Kill the Bandit Leader\\\" for Ahtar. Requires \r\nAdvance Smithing. I also gave the Axe some crit and upped the damage a few \r\nboth for the vanilla and my version.\r\nThis might not work please let me know so I can fix it.\r\n\r\nSavior\\'s Hide \r\nCraftable after you comeplete \\\"Ill Met By Moonlight\\\". Doesn\\'t matter wether \r\nor not you let Sinding live or kill him since it\\'s possible to get both \r\nring and hide.\r\n\r\nEbony Mail \r\nMade into light armor and is craftable After you complete \\\"Boethiah\\'s \r\nCalling\\\" Requires Daedric Smithing.\r\n\r\nSpike Shield (Targe Of The Blooded)\r\nNothing special needed to craft this shield just Steel Smithing.\r\n\r\nTorturer\\'s Hood (The hood the torturer is wearing at the beginning of the \r\ngame.)\r\nNothing special needed here just the mats.\r\n\r\n\r\n\r\nHere is what I did for weapons.\r\n\r\nAkaviri Katana\r\nCraftable and nothing special needed here just Steel Smithing.\r\n\r\nGhost Axe, Bow and Sword \r\nCraftable after you complete \\\"The Staff of Magnus\\\" Requires Arcane \r\nBlacksmithing and Advanced Blacksmithing.\r\n\r\nBlade of Woe \r\nCraftable after completing \\\"Destroy the Dark Brotherhood!\\\" or \\\"With Friends \r\nLike These...\\\" \r\n\r\nDawnbreaker \r\nCraftable after finishing \\\"The Break of Dawn\\\" Requires \\\"The Break of Dawn\\\" \r\nRequires Daedric smithing and Arcane Smithing.\r\n\r\nBlade of Sacrifice \r\nCraftable after finishing \\\"Boethiah\\'s Calling\\\" \r\nRequires Daedric Blacksmithing.\r\n\r\nBlade of Woe\r\nCraftable after you complete \\\"Death Incarnate\\\" or kill Astrid to start the \r\nquest \\\"Destroy the Dark Brotherhood!\\\"\r\nRequires Steel Smithing.\r\n\r\nBlade Of Ysgramor\r\nCraftable after you become the Harbinger of The Companions.\r\nRequires Steel Smithing and Advanced Smithing.\r\n\r\nDragon Priest Dagger\r\nRequires Ebony Smithing.\r\n\r\nEbony Blade\r\nCraftable after you complete \\\"The Whispering Door\\\"\r\nRequires Ebony Smithing.\r\n\r\nGiant Club\r\nCraftable after you complete \\\"The Cursed Tribe\\\"\r\nRequires Steel Smithing.\r\n\r\nKeening\r\nCraftable after you complete \\\"Arniel\\'s Endeavor\\\".\r\nRequires Dwemer Smithing and Arcane Smithing\r\n\r\nMehrunes Razor\r\nCraftable after you complete \\\"Pieces of the Past\\\". And choose to kill \r\nSilus.\r\nRequires Daedric Smithing and Arcane Smithing\r\n\r\nSanguine Rose\r\nCraftable after completing \\\"A Night To Remember\\\"\r\nRequires Arcane Smithing and Daedric Smithing.\r\n\r\nSkull of Corruption\r\nCraftable after completing \\\"Waking Nightmare\\\" It does not matter whether or \r\nnot you decide to kill Erandur.\r\nRequires Daedric Smithing and Advanced smithing.\r\n\r\nVolendrung\r\nCraftable after completing \\\"The Cursed Tribe\\\"\r\nRequires Arcane Smithing, Daedric Smithing\r\n\r\nIf anything is unbalanced wrong or just plain dumb let me know This is my \r\n\r\nfirst mod EVER and I know it will have issues so please let me know.\r\n\r\nThanks to the people at Nexus and Bethesda forums that replied to my posts and pointed me in the right direction\r\n\r\nFuture Plans:\r\nA notice saying \\\"You have learned a new Smithing recipe\\\"\r\nBalance tweaks (Changing some of the armor ratings as feedback is given.)\r\n?\r\n?",
  "categoryId": "36",
  "version": "1.0alpha",
  "author": "lolbored",
  "createdUnix": "1338427321",
  "updatedUnix": "1338463777",
  "containsAdultContent": false,
  "uploadedBy": "lolbored",
  "primaryFile": null,
  "files": [
    {
      "fileId": "64782",
      "name": "Craftable Vanilla Weapons and Armor 1_0 alpha",
      "version": "1.0alpha",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Craftable Vanilla Weapons and Armor 1_0 alpha-17915-1-0alpha.7z",
      "uploadedUnix": "1338463777",
      "modVersion": "1.0alpha",
      "virusScanUrl": "https://www.virustotal.com/file/460b56baa43b66c6e69cce692270c96563933750d8d80c39b9eeca529ea5ec51/analysis/1406927473/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20Vanilla%20Weapons%20and%20Armor%201_0%20alpha-17915-1-0alpha.7z?fid=64782&ttl=1535784353&ri=8192&rs=8192&setec=65228ce6f11812e671d927c2400b3ae8"
    }
  ]
}