{
  "modId": 17923.0,
  "modName": "Tomb of Trials",
  "summary": "Deep within Winterhold Barrow, there is a secret that will bring you great power and wealth. Tell me adventurer… are you strong enough, cunning enough, and daring enough to face the Tomb of Trials? (a custom dungeon and quest, player level 20+ recommended)",
  "descriptionHtml": "-------------------------\r\nCurrent Version 1.1\r\n-------------------------\r\nDeep within Winterhold Barrow, there is a secret that will bring you great power and wealth. Tell me adventurer... are you strong enough, cunning enough, and daring enough to face the Tomb of Trials? Will you prevail against the many challenges within? Or, will you join the ranks of the fallen?\r\n\r\n-------------------------\r\n1) Quest Information\r\n-------------------------\r\nThe quest will begin either when the player 1) first sleeps after installing the mod, or 2) upon the player entering the Winterhold Barrow dungeon. The Winterhold Barrow location is a new playable dungeon created by yours truly, and located up the path behind the jarls hut and to the left in the mountainside. The quest is approximately 30 minutes long, and will test all of your abilities, and is unlike any dungeon currently in the game. The quest rewards include a powerful sword beyond any of the player\\'s enchantment abilities (leveled), a book of lore, and generic loot scattered throughout chests in the dungeon. Player level 20+ recommended.\r\n\r\n---------------------\r\n2) Compatibility\r\n---------------------\r\n\r\nNo known issues with v1.1\r\n\r\n---------------------\r\n3) Changelog\r\n---------------------\r\nVersion 1.1\r\n\r\n-Fixed compatibility issues with Moonpath and Beyond Skyrim Mods\r\n-Fixed Soulgems Stuck in Player Inventory. (Made them no longer quest items)\r\n-Fixed Doors so that the Player can\\'t get locked out of main room. (Added pullchains)\r\n-Fixed some CTDs and missing texture errors.\r\n\r\n---------------------\r\n4) Author\\'s Note\r\n---------------------\r\n\r\nThanks for your interest, and please rate and comment if you enjoy! - Matt Donatelli (mattdonatelli.com)\r\n\r\nSpecial thanks to Daniel Hensey for contributions to the writing and lore in this mod.",
  "categoryId": "88",
  "version": "1.1",
  "author": "Matt Donatelli",
  "createdUnix": "1338442879",
  "updatedUnix": "1342636361",
  "containsAdultContent": false,
  "uploadedBy": "TheMaineMan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "75165",
      "name": "Tomb of Trials",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2015",
      "fileName": "Tomb of Trials-17923-1-2.zip",
      "uploadedUnix": "1342636361",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/1fdfdd91b820ee1a314a48900e43a97ded4b8231cafa85cfdc0151e8ca61f4fc/analysis/1407031504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tomb%20of%20Trials-17923-1-2.zip?fid=75165&ttl=1535784365&ri=8192&rs=8192&setec=6818606faeb4e0e7a1f986dd068fdee1"
    }
  ]
}