{
  "modId": 17945.0,
  "modName": "Free Choice of Starting Equipment - NO CHEATING",
  "summary": "Places a chest in Helgen Keep, that offers weapon of your choice, but keeps the game fair.",
  "descriptionHtml": "Have you ever been mad about following Ralof or Hadvar, but having only one opinion - Iron Sword or War Axe? This mod fixes it. It adds a chest with Iron Weapons, Imperial Heavy Armor and Stormcloak Light Armor. There is also something for mages, like a spelltome, two scrolls and robes. The chest is placed in the second room, which you enter when following Ralof and which you pass through when following Hadvar.\r\n\r\nThe chest offers:\r\nWeapons:\r\nImperial Bow\r\nImperial Sword\r\nIron Arrows (50)\r\nIron Battleaxe\r\nIron Dagger (2)\r\nIron Greatsword\r\nIron Mace\r\nIron Sword (2)\r\nIron War Axe\r\nIron Warhammer\r\nArmor:\r\nImperial Heavy Armor Set\r\nStormcloak Cuirass + Fur accessories\r\nIron Shield\r\nHide Shield\r\nUnenchanted Robe\r\nBoots\r\nScrolls:\r\nScroll of Fireball (2)\r\nSpell Tomes:\r\nSpell Tome: Oakflesh\r\nMisc.:\r\nTorch\r\n\r\nThis mod is not a cheating mod, it just gives the player an opinion to choose a weapon, as it should be in an RPG. \r\n\r\nAnd if you have problem, that you would like to take all the things, but still keep the game fair, imagine there are only items you need ;).\r\n\r\nA note about the spell tomes and all that:\r\nI have just finished a pure mage playthrough and i must admit, that playing without alteration isn\\'t easy. And if somebody has got a problem that the Scroll, the Spell Tome, or the Robes are in the chest, please go leave it to the topic \\\"Mages are N00by and Should not come close to warriors\\\", because this is a kind of racism, or rather classism :D and i dont allow it here.\r\n\r\n",
  "categoryId": "28",
  "version": "1.1",
  "author": "Modger99",
  "createdUnix": "1338481660",
  "updatedUnix": "1338481660",
  "containsAdultContent": false,
  "uploadedBy": "Modger99",
  "primaryFile": null,
  "files": []
}