{
  "modId": 17965.0,
  "modName": "Niflheim - House of Dark Mists",
  "summary": "After the battle of Moesring, the Falmer took up refuge with the Dwemer.  However, the Falmer sought to find something that they could use to get vengence for the Nords killing their beloved Snow Prince...",
  "descriptionHtml": "After the battle of Moesring, the Falmer took up refuge with the Dwemer. However, the Falmer sought to find something that they could use to get vengence for the Nords killing their beloved Snow Prince...\r\n\r\nAfter receiving a message from Calcelmo about an ancient Dwemer ruin he\\'s recently located the key to, you head off to get the key then to explore Niflheim, the House of Dark Mists.\r\n\r\nInsipred from the Nordic realm of the dead, ruled over by Hel. Further explores the stories of the Dwemer, Falmer, and the Psijic Monks. After you defeat the dungeon, you can use it as a permanent home, all upgrades included.\r\n\r\nIn Nordic Mythology, Niflheim means \\\"\\'dark mist home.\\\" I have a huge fascination with the Dwemer and Falmer, and the overall feel of the Dwemer / Falmer areas in game. So, I decided to make a place through which we can further explore what happened to the Dwarves, the Falmer, and a few other things.\r\n\r\n\r\n--------------------\r\nQuest Requirements - \r\n--------------------\r\n\r\nNOTE - I built this to fit into the game as though Bethesda created it themselves, therefore to play this quest you must have completed certain tasks in game. Those are:\r\n\r\n1. level 25 character\r\n2. Finished \\\"Nimhe, the Poisoned One\\\" quest for Calcelmo (Available at any level)\r\n\r\nIf you have attained level 25 and have killed Nimhe for Calcelmo then you\\'ll get a letter from Calcelmo that starts the quest.\r\n\r\n---------------\r\nQuest Rewards - \r\n---------------\r\n\r\n- Ring of Regrowth (regenerates Mana, HP, and Stamina at a HUGE rate)\r\n\r\n- GhostRing (Turns the player into a Ghost and makes friends with the Falmer ghosts)\r\n\r\n- SpellBook: Conjure Ghost Dragon\r\n\r\n- Hidden Armor set with special attributes\r\n\r\n- New Player Home Areas:\r\n- Forge / Armory\r\n- Tanning rack\r\n- Smelter\r\n- Blacksmith Forge\r\n- Workbench\r\n- Sharpening Wheel\r\n- Enchanting Workbench\r\n- 2 chests for materials\r\n- 10 Weapon Display Cases\r\n- 10 empty mannequins\r\n- 10 outfitted mannequins\r\n- 16 weapon racks\r\n- Dragon Priest Mask Alter\r\n- Combat Training Room with 2 mannequins you can cast spells at or attack that will level your skills\r\n- Archery Range (mini game you can use to level marksmanship or any damage based spell)\r\n\r\n- Garden / Library\r\n- variety of plants\r\n- variety of bugs\r\n- chest to store potions with all potion recipes\r\n- apothecary sachel for ingredients\r\n- Alchemy Workbench\r\n- ghost dragon room\r\n- shrine room for the 9 divines\r\n- 4 weapon display cases\r\n- 18 empty book shelves\r\n- chest of all normal books\r\n- chest of all spell books\r\n- chest of all skill books\r\n- atronach forge with the 13 doomstones\r\n- chest with all atronach forge recipes\r\n- operating instructions book at atronach forge\r\n- chest for materials for atronach forge\r\n- bedroom\r\n\r\n-----------------\r\nDeveloper Notes -\r\n-----------------\r\n\r\nI\\'ve created new mechanisms while developing Niflheim. Feel free to explore every nook, all the little spaces, because I\\'ve hidden stuff all over the place for mine and your playing pleasure. I have two completely voiced (high quality audio) NPCs. I did a lot of research for the appropriate lines to make this as lore friendly as I could manage. If you want to play something that seems like it could fit into the Elder Scrolls, have a look at this. I\\'ve spent about 3 months total working to make this the best experience I can manage at this point. Enjoy and please rate this!\r\n\r\n\r\n---------\r\nCredits - \r\n---------\r\n\r\nSPliCeR - huge assistance with research about everything related to Dwemer\r\n\r\ntheycallmeQ - for throwing interesting ideas at me, and for re-texturing some armor for the mod.\r\n\r\nThirteenOranges - for driving me to research things I didn\\'t know about regarding the scripting objects. He didn\\'t either... ;)\r\n\r\njim.jimlawrence85 - for letting me blabber to him about my coding issues and understanding them, playtesting, and for trying to give me new ideas for resolving the coding issues.\r\n\r\nevoLucian - voice of Karkeli (Elijah Lucian <elijahlucian@gmail.com>)\r\n\r\nplay testers - Player Two, dudeitzchronic, Reaper\r\n\r\n\r\nThanks everyone!\r\n\r\n\r\n---------------------\r\nTroubleshooting\r\n---------------------\r\n\r\nUnfortunately not all modders are coders. So, when they make mods, they don\\'t know how to consider memory or instancing conflicts against other modders while making their mod. That causes all the issues mod players experience.\r\n\r\nIf this doesn\\'t work for you, try having it at the top of your loaded mods. if that doesn\\'t work, try having it as the only loading mod. Usually that will fix it. There\\'s a limitation on how much memory TESV.exe will allow for .ESP files. So, at times, you\\'ll have to select different mods to load when you want to try something new. I hope this helps. If you need further assistance, please tell me how many mods you have loaded, and what the load order is.",
  "categoryId": "88",
  "version": "1.0.7",
  "author": "hellcat5",
  "createdUnix": "1338502382",
  "updatedUnix": "1345692280",
  "containsAdultContent": false,
  "uploadedBy": "hellcat5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68544",
      "name": "Niflheim - Skyrim 1_6 update patch",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12828",
      "fileName": "Niflheim - Skyrim 1_6 update patch-17965-1-3.zip",
      "uploadedUnix": "1339920069",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/0c94ac430e542ef176e87e86c3c1ea27a9fadefe2033b84677924ec60254e0e0/analysis/1406964553/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Niflheim%20-%20Skyrim%201_6%20update%20patch-17965-1-3.zip?fid=68544&ttl=1535784426&ri=8192&rs=8192&setec=7dfda95be4b522f2fbf286ceba27d2aa"
    },
    {
      "fileId": "83584",
      "name": "Niflheim - House of Dark Mists - Dawnguard update",
      "version": "1.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18085",
      "fileName": "Niflheim - House of Dark Mists - Dawnguard update-17965-1-7.zip",
      "uploadedUnix": "1345692280",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/e6b44959eb2d081e74e2d5ceeed9d9ec50d710a089b57b145a5b1c54ddb4635f/analysis/1407115649/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Niflheim%20-%20House%20of%20Dark%20Mists%20-%20Dawnguard%20update-17965-1-7.zip?fid=83584&ttl=1535784426&ri=8192&rs=8192&setec=09e429375cf9b96b43464759d2badce1"
    }
  ]
}