{
  "modId": 17982.0,
  "modName": "Nicoleta Cosmina",
  "summary": "Adds a new follower into the game, location that can be found riverwood.",
  "descriptionHtml": "This mod adds the follower Nicoleta Cosmina into the game. Now the reason I made her was I always thought it was funny that Riverwood is part of Whiterun Hold, but didn\\'t get any guards to defend it till you tell Whiterun about the dragon. Towns like Rorikstead had guards before, but not Riverwood. So I made a follower who when not following you patrols Riverwood, but I also made her female because it seemed to me there is a lack of female Whiterun Guards in the hold.\r\n\r\nNow here\\'s more about her. Nicoleta Cosmina is a wood elf, who patrols whiterun in the whiterun guard outfit minus the helmet. She has a imperial bow and imperial shield because in my opinion, she would probably side with the empire, but also because those weapons are neither to strong nor to weak at the beginning of the game, she also autolevels with the player and is set to essential. She patrols whiterun in the early morning to late afternoon, goes to a quite place behind the mill after and then goes back to Faendals place to sleep and eat. I made both her and Faendal Cousins. She has a custom class, made to balance her physical abilities, but also will slowly learn restoration skill as well so she can use her healing spell better. If you want me to see what her class looks like and what basic perks i gave her please look at the pictures above.\r\n\r\nAlso every wednesday, she will leave town at the time she would go behind the mill to relax to visit the grave of her dead father which is located just a little ways from the bridge of riverwood.\r\n\r\nREQUIRED MOD:\r\nApachi Skyhair: http://skyrim.nexusmods.com/downloads/file.php?id=10168\r\nIt is a MUST, otherwise she WILL be bald.\r\n\r\nRecommended Mods:\r\nBetter Females by Bella: http://skyrim.nexusmods.com/downloads/file.php?id=2812\r\nCalientes Female Body Mod Big Bottom Edition -CBBE-: http://skyrim.nexusmods.com/downloads/file.php?id=2666\r\nTheir not needed, but if you want her to look like what she looks like in the screenshots, thats what I use.\r\n\r\nMy Other Mods:\r\nCave story: http://skyrim.nexusmods.com/downloads/file.php?id=15266\r\nKatsumi Aiko: http://skyrim.nexusmods.com/downloads/file.php?id=16840\r\nKaraValentia: http://skyrim.nexusmods.com/downloads/file.php?id=15850\r\n\r\nIf there are any bugs in the file, please let me know in a pm or leave a comment so I can fix it.\r\n\r\nCredits:\r\nApachii for his awesome hair mod.\r\nBethesda for making skyrim and the creation kit\r\nSkyrim Nexus for a place to share mods.\r\n\r\nAlso please leave a comment and tell me how you like it. :D",
  "categoryId": "66",
  "version": "1.0",
  "author": "MegamanOmega91",
  "createdUnix": "1338515171",
  "updatedUnix": "1338515490",
  "containsAdultContent": false,
  "uploadedBy": "MegamanOmega91",
  "primaryFile": null,
  "files": [
    {
      "fileId": "64950",
      "name": "Nicoleta",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "954",
      "fileName": "Nicoleta-17982-1-0.zip",
      "uploadedUnix": "1338515490",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bb65ff203f878ec8b1d8201833bb5fa6feefccd300609895ae8a68072d1db2bb/analysis/1406928966/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nicoleta-17982-1-0.zip?fid=64950&ttl=1535784469&ri=8192&rs=8192&setec=839b57e8c67268be3e5d7993313440e6"
    }
  ]
}