{
  "modId": 17987.0,
  "modName": "More Dynamic Injuries",
  "summary": "Injuries and treatments, for you and the rest of Skyrim. Combat just got that much more brutal.",
  "descriptionHtml": "[center][IMG]http://i.imgur.com/FN95G.png[/IMG][/center]\r\n\r\n[center][IMG]http://i.imgur.com/cC6Am.png[/IMG][/center]\r\n\r\n\r\n\r\n\r\n[center][color=red][size=5]The following translations are available.[/size][/color]\r\n\r\n[size=4][url=http://skyrim.nexusmods.com/mods/20184]German[/url][/center][/size]\r\n\r\n\r\n\r\n[center][IMG]http://i.imgur.com/BGzbo.png[/IMG][/center]\r\n\r\n-\tSkyrim version 1.6.89.0.1 or later. Previous versions WILL NOT WORK. Please don’t bother asking for help if you have an earlier version of Skyrim, as I guarantee you your issues are being caused by your game being out of date.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n[IMG]http://i.imgur.com/tnBnE.jpg[/IMG]\r\n[center][IMG]http://i.imgur.com/O7MoP.png[/IMG][/center]\r\n\r\nQ: Does this mod conflict with XXX?\r\nA: No. All changes made by this mod are isolated and will not interfere with anything any other mods wish to do.\r\n\r\nQ: The merchants aren’t stocking the items! What gives?\r\nA: Due to a bug in how the game handles items being added to containers via script, you will not see the items available for sale on the first barter session. Exit the barter menu and check back again, and they should be there.\r\n\r\nQ: Why are items not showing up on the Crafting menu?\r\nA: The list culls itself to keep from being too huge (there are a lot of items on it). If you do not see an item available, it means you do not have the required materials to craft the item.\r\n\r\nQ: When I start the mod, I immediately “die of blood loss!” What happened?\r\nA: The scripts did not load properly. Download the “Loose Scripts” file and use it instead (not available on Steam Workshop, unfortunately, due to the extremely rigid file type restrictions). If you still die, check your game version. Make sure you have at least 1.5.24, otherwise I will not help you with your problems until you update your game.\r\n\r\nQ: Help! The mod is busted and I can’t get to the Config menus! What do I do?!\r\nA: Open the console and type in “Set INJEmergencyUninstall to 1” (or any number you want that is not 0). This will immediately shut the mod down and allow you to safely remove it from your load order.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n[IMG]http://i.imgur.com/tnBnE.jpg[/IMG]\t \r\n[center][IMG]http://i.imgur.com/Zu5uE.png[/IMG][/center]\r\n\r\nSkyrim is a harsh place. Fights for survival are not uncommon; be it between Bandits and travellers, to Imperials vs. Stormcloacks, to even simply you vs. the bitter cold. Only the strong survive in the wilderness. And survival is not easy.\r\n\r\nAnd with this mod, it will get that much more difficult. Fighting is brutal, and can leave one’s body torn and broken. Healing spells can help, but they can only get you so far. As you sustain more severe injuries, which progress from not-terribly-noticeable to lethal, you will need to seek medical attention from somewhere other than your spellbook.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n[IMG]http://i.imgur.com/tnBnE.jpg[/IMG]\r\n[center][IMG]http://i.imgur.com/DB6me.png[/IMG][/center]\r\n\r\n    - Fixed Bug: Removed some old Debug entries.\r\n \r\n    - Optimization: NPC Tracker scripts have been removed, as per my decision that they were too problematic to be kept. They will not be returned ever, so please refrain from asking. Follower tracking will remain, though. This is a roleplay mod, not a combat mod. Keeping these sorts of details on minor actors is completely unneeded.\r\n\r\n    - Feature Change: The mod no longer performs internal reductions for burns and frostbite based on your resistances. The game already performs damage reduction for these and the mod uses damage taken as its baseline for all calculations, so the extra debuffs were unnecessary.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n[IMG]http://i.imgur.com/tnBnE.jpg[/IMG]\r\n[center][IMG]http://i.imgur.com/MBlwr.png[/IMG][/center]\r\n\r\n\r\nMultiple new injury types\r\n\r\nAside from your basic cuts and bruises, you will now have to deal with burns, frostbite, blood loss, and broken bones.\r\n\r\nHealth is now your damage tolerance, or how much immediate damage you can take before you die of shock trauma. Healing spells, Drain and Fortify Health effects all improve (or decrease) this value as is normal in the game. It also represents your body’s physical conditioning. More health (unmodified) means you can take more punishment… to a point. \r\n\r\nYour Injury level is how much long-term damage was caused to your muscle tissue from cuts and bruises. If not too severe, they will heal themselves over time. If they get particularly bad, though, then you will be required to intervene and stitch up those deep wounds before you bleed out. Healing spells don’t close wounds, they help reduce pain and shock trauma and allow you to continue on in a fight for longer. Bad injuries will have a negative effect on your Health, too, so keep them in check.\r\n\r\nBeing hit with particularly heavy weapons results in blunt force trauma, which is not too healthy for your skeleton. Take too many blows on the arm from a warhammer, and you’ll find yourself unable to use that arm, on account of it being broken and crippled. If you break an arm, you cannot equip anything (not even spells) to that hand. Break both arms and that fight’s over (run or die, your choice). Subsequently, breaking a leg will severely handicap your ability to move around; your overall speed will drop significantly. Break both legs, and not only do you lose even more of your agility, but now you are stuck walking, and in very big trouble.\r\n\r\nBoth if these wounds cause immediate blood loss (external and internal bleeding, respectively). If your injuries get too severe, however, you will begin bleeding out. If you do nothing, you will find your vision blurring, your Stamina falling, and your body weakening. Left untreated, you will die. When you are not bleeding out, your blood will slowly replenish itself over time.\r\n\r\nPlay with fire, you get burned. Taking damage from flames will result in you receiving burns of increasing severity. When they get too severe, you will be in indescribable pain, resulting in you losing health progressively over time instead of regenerating it. Getting badly shocked by a lightning spell will also burn you, so keep an eye out.\r\n\r\nThe extreme cold of Skyrim is just as much an enemy as those bandits you killed five minutes ago. Be it a freezing spell, or taking a dive into the Sea of Ghosts, you will find the temperature of your extremities dropping. Fast. Nip this in the bud and get your temperature back up by getting out of the cold, else you will find yourself slogging about sluggishly in the snow unable to use your hands on account of your fingers being frozen. You’ll need outside help at this point. But don’t worry; in this world of Alchemy and potions, the need amputation is quite rare.\r\n\r\nIt’s not just you who is in danger of a horrible, bloody, and painful death. Everyone is, be it your grandmother, your adventuring companion, or that bandit you are now fighting.\r\n\r\nYou can find all this information in-game stored in a handy guide book called Surviving Skyrim: Field Medicine. You will be prompted to pick up a copy when you load up the mod. It is from this guide you can configure this mod’s many injuries. If you are feeling things are too easy, you can turn the damage rates up all the way to five times the default. And if you are feeling overwhelmed, turn the rates down all the way to one-fifth the default. This guide is available in any general store.\r\n\r\nYou can check on your injuries using your Treat Injuries Shout. Tap your Shout key to see and treat your own injuries, or hold it down to see your follower’s injuries.\r\n\t \r\n\r\n\r\nTreatments\r\n\r\nMinor wounds (50 and above, or anything greater than 0 for limbs) of any type will heal themselves over time. If you find they are getting too severe, take a rest and let them heal up. You can also apply first-aid with a healing spell, but you will only heal your injuries if you are also healing your Health.\r\n\r\nFor severe wounds, you will need stitches to fix them. They are available from your local apothecary, or craftable using sinew and a lockpick. Once stitched, your injuries will heal themselves, but be careful you don’t get into any strenuous activities. You don’t want to tear your stitches or you’ll lose all your hard work.\r\n\r\nIf you don’t have stitches, you can bandage the wound to slow the bleeding. You can make them yourself using some linen wraps and alcohol (nord mead or any wine) or buy them from your local Apothecary. Once bandaged, your blood loss rate will be permanently slowed until you can get the wounds treated.\r\n\r\nAnd if all else fails, a leather strip tourniquet can slow the bleeding for a short time, perhaps long enough for you to find help.\r\n\r\nBroken bones will need a splint to help set the bone properly. You can buy them, again, from your local apothecary, or you can make them yourself given you have the knowhow and the needed items (firewood and 5 leather strips). \r\n\r\nFor severe burns, you will need burn cream, available at your local apothecary or craftable by mixing together three of any ingredient containing a Resist Frost effect (or three of one and one batch of Frost Salts). Once applied, your burns will be soothed, and will be healed over time.\r\n\r\nFor severe frostbite, warming cream is needed. Buy it from your local apothecary or make it yourself using three of any ingredient containing a Resist Fire effect (or three of one and one batch of Fire Salts). Once applied, you will feel immediate relief, and your frostbite will go away over time.\r\n\r\nAll medical supplies can be found for sale at your local apothecary, or you can make them yourself by using your Craft Medical Supplies power. You will only be able to see the recipes you are currently capable of making, so don’t be surprised if this list is empty when you open it.\r\n\r\nYou can only fully treat your injuries while outside of combat. In combat, you may apply bandages and tourniquets, but nothing else.\r\n\r\nYour followers will automatically treat their own injuries so long as they have the appropriate medical supplies. You need only keep them supplied.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n[IMG]http://i.imgur.com/tnBnE.jpg[/IMG]\r\n[center][IMG]http://i.imgur.com/aTdYP.png[/IMG][/center]\r\n\r\nSteam Workshop users: The mod will be automatically downloaded and installed for you when you next start the game (through the normal launcher) once you subscribe to it on the Workshop page.\r\n\r\nWrye Bash users: The mod is provided in a BAIN-friendly format so that you may quickly drop it into your Installers folder and install.\r\n\r\nNexus Mod Manager users: Nexus Mod Manager will be able to handle the packaging of this mod on its own, you won’t need to do anything fancy. Just convert it into an FOMOD and install.\r\n\r\nIf you use none of the above: Just drag and drop the provided files into your Skyrim\\\\Data folder.\r\n\r\nOnce you have installed the mod, you will need to initialize it (you will receive an Objective for this if you installed the mod correctly). To do this, go to any General Store and buy the book “Surviving Skyrim: Field Medicine.” Read it, and you will receive the prompt to activate the mod. Once activated, you may reconfigure the mod at any time by using the book.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n[IMG]http://i.imgur.com/tnBnE.jpg[/IMG]\r\n[center][IMG]http://i.imgur.com/dQP3m.png[/IMG][/center]\r\n\r\nThis mod will handle everything that needs doing for updating the mod for you. You need do nothing outside of downloading the new version.\r\n\r\nFor users of 1.1: before you update, if you managed to obtain a copy of the Guide Book, please drop it before you update to allow for the scripts to reset themselves correctly.\r\n\r\n\r\n\r\n\r\n\r\n\r\n[IMG]http://i.imgur.com/tnBnE.jpg[/IMG]\r\n[center][IMG]http://i.imgur.com/tLbnO.png[/IMG][/center]\r\n\r\n[center][IMG]http://i.imgur.com/vK3zJ.png[/IMG][/center]\r\n\r\nThe Uninstall function is located in the Configuration menus. Use it before continuing.\r\n\r\nSteam Workshop users: First, unsubscribe. You will then need to manually delete the files the mod provided, which are: More Dynamic Injuries.BSA and More Dynamic Injuries.ESP.\r\n\r\nWrye Bash users: Very easy, just navigate to the package in your installers tab and choose Uninstall.\r\n\r\nNexus Mod Manager: Again, very easy. Just deactivate the mod.\r\n\r\nIf you use none of the above: Simply follow the steps for Steam Workshop minus the need to unsubscribe.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n[IMG]http://i.imgur.com/tnBnE.jpg[/IMG]\r\n[center][IMG]http://i.imgur.com/6oGcv.png[/IMG][/center]\r\n\r\nThe mod’s default damage and healing rates are balanced towards a difficulty level of Adept. If you play at a higher difficulty, you may find yourself getting injured a bit too quickly. Thankfully, this mod’s damage and healing rates are fully configurable. Just enter your Injury Options menu and select Configure. You will be able to modify both the Global rates and the rates for the specific injuries from there.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n[IMG]http://i.imgur.com/tnBnE.jpg[/IMG]\r\n[center][IMG]http://i.imgur.com/oCG1c.png[/IMG][/center]\r\n\r\nIncompatible with any other injury mod.\r\n\r\nShould be compatible with any other non-injury related mod out there.\r\n\r\nMod makers: if you provide new weapons for NPCs to use, your mod will be compatible with this one so long as you follow proper Keyword conventions with your weapon mods. Just make sure your weapons have the correct WeapType Keywords and there will be no problems.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n[IMG]http://i.imgur.com/tnBnE.jpg[/IMG]\r\n[center][IMG]http://i.imgur.com/Q7U7H.png[/IMG][/center]\r\n\r\nFall damage currently does not cause any injuries. This was attempted, but I was forced to abandon it due to problems with the detection conflicting with the rest of the mod’s internals.\r\n\r\nInjury data on minor NPCs is lost when they are unloaded. This was originally planned to be addressed, but those plans were abandoned to avoid overtaxing the Papyrus VM, which is quite sensitive. Due to script overhead issues, this cannot be addressed. \r\n\r\nAnimations may be slightly delayed. This is because Papyrus is slow and cannot perform instantaneous reactions. Nothing can be done about this.\r\n\r\nIf you are using mods that allow you to have multiple followers, only one follower at a time will be tracked. Due to the need to keep my processing footprint down, I am not going to address this. Blame Papyrus for being sensitive; if I go any further, I fear I might start interfering with other peoples’ mods.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n[IMG]http://i.imgur.com/tnBnE.jpg[/IMG]\r\n[center][IMG]http://i.imgur.com/vODX7.png[/IMG][/center]\r\n\r\nFor the maximum realism experience, it is recommended you run these mods alongside:\r\n\r\n[center][url=http://skyrim.nexusmods.com/mods/10639]Imp’s More Complex Needs[/url][/center]\r\n[center][url=http://skyrim.nexusmods.com/mods/11163]Frostfall[/url][/center]\r\n\r\nYou may use any other Primary Needs or hypothermia mods you wish; these two are simply the most comprehensive and were what this mod was made to be played with.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n[IMG]http://i.imgur.com/tnBnE.jpg[/IMG]\r\n[center][IMG]http://i.imgur.com/gFWK8.png[/IMG][/center]\r\n\r\n- You are free to alter, expand on, or destroy this mod in any way you see fit. If you wish to share your work, however, you MUST contact me and obtain my explicit permission before doing so. Any instances of severe mod destruction will not be eligible for technical support until restored to a functional state.\r\n- Any works that are found to be in breach of the above, the author will receive a single polite request from me to remove it from wherever it is being hosted (from all sites it is being hosted on). Failure to respond within 48 hours will result in more direct action being taken.\r\n- DO NOT upload this mod to any site other than those I have personally uploaded it to without my express permission given. Any user or site found in violation of this will be considered to be stealing intellectual property and will be treated as such. Just because this mod is free does not mean that gives you free reign over what you can do with it. My work, my rules.\r\n- If I fail to respond to your requests to expand or alter this mod within 30 days, you may consider yourself as having my approval to do as you wish, but please note that upload location restrictions still stand.\r\n- Compatibility patches: If you do not repackage any of this mod’s assets, you are free to upload these AFTER you have PMed me (you need not wait for a reply, I just want to know you made one, and the message might get lost in a thread).\r\n- Translators: please simply PM me if you wish to translate this mod. If you wish to upload the translated version to one of my current mirrors, you may consider my answer to be “yes” outright. If you wish to upload elsewhere, though, you must obtain my permission to do so. All I wish to know is that the mod is being translated, and anyone who wishes to do so has my approval.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n[IMG]http://i.imgur.com/tnBnE.jpg[/IMG]\r\n[center][IMG]http://i.imgur.com/yXUWZ.png[/IMG][/center]\r\n\r\n-v1.1.6: 06/18/2012\r\nFixed Bug: Removed some old Debug entries.\r\nOptimization: NPC Tracker scripts have been removed, as per my decision that they were too problematic to be kept. They will not be returned ever, so please refrain from asking. Follower tracking will remain, though. This is a roleplay mod, not a combat mod. Keeping these sorts of details on minor actors is completely unneeded.\r\nFeature Change: The mod no longer performs internal reductions for burns and frostbite based on your resistances. The game already performs damage reduction for these and the mod uses damage taken as its baseline for all calculations, so the extra debuffs were unnecessary.\r\n\r\n-v1.1.5: 06/16/2012\r\nGeneral fixes for the menus.\r\nFollowers will no longer continuously cycle between Bleedout enter/exit animations while bleeding.\r\nThe mod will now pause and reset itself on updating if you do not have the Guide Book in your inventory.\r\nPrevented Blood Loss ImageSpace Modifier from being erroneously triggered when your follower’s blood level returned to acceptable levels.\r\nRemoved Shout and split it into two Lesser Powers, as you would not be able to use it if you had previously used a Shout requiring cool-down.\r\nStopped the mod from causing NPC idle animations to stutter.\r\nUninstalling the mod will now require you clean-save. You may reinstall any time after without issue.\r\nPrevented the player from treating any injuries while the mod is paused.\r\nIt is now possible to give your follower medical supplies through the Follower Injuries menu, in case you find yourself unable to talk to them.\r\nThe Guide Book acquisition has been made a bit less touchy. Copies to the book can be found on the counter in the local General Stores for you to buy (or in Inns for towns without a general merchant). You can find a copy at every major settlement in Skyrim and Riverwood.\r\n\r\n\r\n- v1.1: 06/14/2012\r\nNPCs will now be affected by all injuries the player can sustain, and will suffer all ill effects.\r\nTreat your follower’s injuries. This is done simply by giving them medical supplies. Do that, and they will take care of the rest.\r\nNew animation events for being injured and for breaking your arms and legs.\r\nVampire Blood Drain spells are now recognized and have their own injury calculations (you will lose more blood than normal).\r\nWerewolves will now heal 4 times faster and be injured 4 times slower while in beast form, but if you are a werewolf, you will not receive the sleep healing bonus.\r\nInjuries were not being sustained from traps.\r\nDawnstar Alchemist was not on the list for receiving medical items.\r\nBlood loss calculations were increasing exponentially instead of linearly depending on your injury severity.\r\nVampires are no longer allowed to die from blood loss.\r\nNew recipes for Burn Cream and Warming Cream. Any ingredient with Resist Fire and Resist Frost effects may now be used.\r\nNew recipe for stitches. Harvest sinew from animal hides and use it to make your stitches.\r\nYou can now use Wine and Alto Wine to craft your bandages.\r\nIt is now possible to apply bandages and tourniquets during combat. You will still need to wait until combat is over to stitch yourself up, though.\r\nMenus have been overhauled. The mod now comes with an internal guide book (read it) that you can use to access the configuration options. And the former Injury Options power now is solely used to access the Crafting menu. Treat Injuries is now a Shout. Quickly press your Shout key to treat your own injuries, or hold it to check your companion’s injuries.\r\nMaximum limit for user configuration increased from 2.5 to 5.\r\n\r\n- v1.05: 06/01/2012\r\nDamage and healing calculations rebalanced.\r\nTweaked Wait/Sleep/Travel healing for while medicine is applied to prevent possible exploit.\r\nA couple miscellaneous changes.\r\n\r\n- v1.01: 05/31/2012\r\nMinor debug update.\r\n\r\n- v1.0: 05/31/2012 \r\nInitial Release\r\n",
  "categoryId": "24",
  "version": "1.1.6",
  "author": "Thomas Kaira",
  "createdUnix": "1338521665",
  "updatedUnix": "1340074249",
  "containsAdultContent": false,
  "uploadedBy": "Thomas Kaira",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68949",
      "name": "More Dynamic Injuries v1-1-6",
      "version": "1.1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "101",
      "fileName": "More Dynamic Injuries v1-1-6-17987-1-1-6.7z",
      "uploadedUnix": "1340074220",
      "modVersion": "1.1.6",
      "virusScanUrl": "https://www.virustotal.com/file/86eb10ab31d964cd6aefeba16e009885a5c26e7ed5a2cc4afed09becbc014ef8/analysis/1406968923/",
      "changelogHtml": " Removed some old Debug entries. <br/> \n NPC Tracker scripts have been removed, as per my decision that they were too problematic to be kept.  <br/> \n The mod no longer performs internal reductions for burns and frostbite based on your resistances (unnecessary). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Dynamic%20Injuries%20v1-1-6-17987-1-1-6.7z?fid=68949&ttl=1535784477&ri=8192&rs=8192&setec=66ac18ae94d20b659b885aab2a4401a4"
    },
    {
      "fileId": "68950",
      "name": "More Dynamic Injuries v1-1-6 Loose Scripts",
      "version": "1.1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "100",
      "fileName": "More Dynamic Injuries v1-1-6 Loose Scripts-17987-1-1-6.7z",
      "uploadedUnix": "1340074249",
      "modVersion": "1.1.6",
      "virusScanUrl": "https://www.virustotal.com/file/048e60099a39e8b3d2fda2bd790ec7403e062c125c836fd33b46637d1771160b/analysis/1406968924/",
      "changelogHtml": " Removed some old Debug entries. <br/> \n NPC Tracker scripts have been removed, as per my decision that they were too problematic to be kept.  <br/> \n The mod no longer performs internal reductions for burns and frostbite based on your resistances (unnecessary). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Dynamic%20Injuries%20v1-1-6%20Loose%20Scripts-17987-1-1-6.7z?fid=68950&ttl=1535784477&ri=8192&rs=8192&setec=0f429b2d3f43eaec97cf02a6059d44e1"
    }
  ]
}