{
  "modId": 17994.0,
  "modName": "Hunters Redoubt - Player Home with Quest",
  "summary": "Adds a detailed new Player Home on a hill near Falkreath. The Estate is gained by completing the Quest \\\"Bhatars Heritage\\\" in the Dead Man`s Drink in Falkreath.",
  "descriptionHtml": "[img]http://static.skyrim.nexusmods.com/downloads/images/17994-2-1338550156.jpg[/img]\r\n\r\n[size=+2][color=red][b]IMPORTANT[/b][/color][/size]\r\nThis Mod is currently in BETA. If you find Bugs, comment them.\r\n\r\n\r\n[b][u][color=black]Recommended[/color][/u][/b]\r\n\r\n- [url=http://skyrim.nexusmods.com/downloads/file.php?id=15105ENB]Sharpshooter\\'s Extreme Graphics Vision ENB[/url]\r\nBest ENB so far (my Opinion), also used to take the Screenshots.\r\n\r\n- [url=http://skyrim.nexusmods.com/downloads/file.php?id=17605]Claralux[/url]\r\nAwesome lighting effects, be sure to check that out.\r\n\r\n- [url=http://skyrim.nexusmods.com/downloads/file.php?id=15094]ScenicCarriages[/url]\r\nOne of the best Mods i\\'ve ever seen. Awesome feeling to travel like this.\r\n\r\n- [url=http://skyrim.nexusmods.com/downloads/file.php?id=12693]Einherjar Armor[/url]\r\nMost preferred armor mod, be sure to check that out too!\r\n\r\n\r\n\r\n[b][u][color=black]Description[/color][/u][/b]\r\n\r\nPlayer Home/Estate near Falkreath, which is gainable through the Quest \\\"Bhatars Heritage in Falkreath. The Questgiver, Bhatar, is located in Falkreath\\'s Tavern Dead Man\\'s Drink.\r\n\r\n[img]http://skyrim.nexusmods.com/downloads/images/17994-1-1338551525.jpg[/img]\r\n\r\nAfter completing the Quest, the House is found on a Hill above the Dark Brotherhood Sanctuary in Falkreath, for more Detail look at the Screenshots.\r\n\r\nThe Estate consists out of 4 parts, the Exterior, the Interior, the Basement and the Rooftop.\r\nOutside, there is a Forge, a Workbench, a Grinding Wheel and a Tanning Rack. There is also seating furniture, including one bench near the Waterfall. Beside these, there is your own House Merchant, which sells from 08:00 to 10:00 goods and also drives you to every hold Capital.\r\n(ScenicCarriages not compatible yet, will hopefully fix this soon!)\r\n\r\nInside, there are 3 Mannequins, Weapon Racks, Display Cases, Arcane Enchanter and a Map of Skyrim.\r\nIn the Basement, there is 1 Mannequin, Fireplace, Alchemy Table, and a lot of Sovngarde Mead!\r\nOn the Rooftop, there is a Bedroll for sleeping under the Stars and some Furniture.\r\n\r\n\r\n[b][u][color=black]Installation[/color][/u][/b]\r\n\r\nI HIGHLY recommend to use NexusModManager to install. Its the easiest way of installing it.\r\nBut if you want to install it manually, drop the .ESP and the .BSA in your Skyrim Data Folder, then activate them in NMM or Steam.\r\n\r\n\r\n[b][u][color=black]Deinstallation[/color][/u][/b]\r\n\r\nIf you have installed it with NexusModManager, deinstall it by double-clicking on the mod\\'s name.\r\nIf you have installed it manually, delete the Hunter`s Redoubt.esp and the Hunter`s Redoubt.bsa in your Skyrim Data Folder.\r\n\r\n\r\n[b][u][color=black]Known Issues or Bugs[/color][/u][/b]\r\n\r\nRight now, there are no Issues or Bugs, except the the Carriage Horse, which is a little bit anxious sometimes (doesn\\'t stand on it\\'s original place).\r\n\r\n\r\n[b][u][color=black]History[/color][/u][/b]\r\n\r\nv1.0 (01.06.12)\r\nInitial Release\r\n\r\n\r\n\r\n[b][u][color=black]Credits[/color][/u][/b]\r\n\r\nCreated by Karasho\r\nScripted by Karasho\r\nVoiceActed by Karasho\r\n\r\n\r\n\r\n[size=+2][b][u][color=black]Last Words[/color][/u][/b][/size]\r\n\r\nIf anyone could need help with his or her Mod, write me a Message on the Nexus!\r\n\r\nThanks to Bethesda for their awesome Game Skyrim and their Creation Kit!",
  "categoryId": "67",
  "version": "BETA1.1",
  "author": "Karasho",
  "createdUnix": "1338546751",
  "updatedUnix": "1338546751",
  "containsAdultContent": false,
  "uploadedBy": "Karasho",
  "primaryFile": null,
  "files": []
}