{
  "modId": 18011.0,
  "modName": "UPS Portable Camp",
  "summary": "Portable camp with interior",
  "descriptionHtml": "New in version 0.87\r\n\r\n- Add small pet - Gosha The Firefly with bonus. \r\n- Remake interior (delete portrait, add map)\r\n- Remake marker\\'s texture\r\n\r\nIMPORTANT!!! UPDATE INFO!!!\r\n\r\nMod contain more scripts, and for update it need full reinstallation!\r\n\r\n- Take all of your things from tent and cupboard\r\n- Deactivate mod in launcher\r\n- Remove all old files of mod (bsa and esp) from data\r\n- Save without it in separate slot\r\n- Boot this save, save once again in new slot. (All without any files of mod in data folder!) \r\n- Install new version and activate. \r\n\r\nSorry for this method, but if you want good work, make so. Skyrim saves have old notes from mods and scripts long.\r\n\r\nHOW TO PLAY\r\n\r\nThis small mod will facilitate your life among the wild nature. You receive the book automatically when entrance in game. From this tome you learn a spell - Portable Camp.\r\n \r\n1. When you want install your camp, take spell and apply it to the ground. You must see stone marker. Marker shows, in this place an equal surface - if you see, the surface is strongly bent concerning a marker, you can place it in other place, if you want, certainly. This is not important, only for aesthetic. Marker have light effect for mods with very dark nights.\r\nYou can remove marker with option \\\"Remove\\\", if you want replace it in other position.\r\n \r\n2. Activate the marker and see the menu of objects which you can establish. Menu points, as wood chopping block or fire, visible when you have in your inventory necessary things. You CAN place every object from menu in INTERIOR (cave, ruin and others)\r\n\r\nWOOD CHOPPING BLOCK - You don\\'t can make fire without firewood in your inventory. For make firewood you must places and use wood chopping block. And for wood chopping block\\'s installation you need the woodchopper axe in your inventory. Activate chopping block and make firewood.\r\n\r\nFIRE - you can choose two versions of fire: small fire, as default, for cooking pot and warm, and big fire for security, brightly shines the district, frightens off animals, can put damage! When you want turn it off, be careful.\r\n\r\nTENT - tent is not standard for Skyrim. This is closed and have interior. If you activate the door - you go to little room with two beds, two chairs and small cupboard. All objects is companion-friendly. Lantern is activator, and can be more brightly or more dimly.\r\n\r\nSEAT - if you choose seat, you have a seat. Companions can use it. You can make so many seats, how many will wish - for every your companion.\r\n\r\nCOOKING POT - when you choose small fire, you can activate it and install cooking pot. Only one pot can you install for one fire. Big fire don\\'t have this option, because it is very big and dangerous.\r\n\r\nBEDROLL - portable bedroll, if you want sleep in every place, not in tent only.\r\n\r\nPET - Gosha The Firefly is your little friend with bonus. Activate jar, and Gosha fly with nice sound. When you listen it 15 minutes (of game time, not real), you have a bonus - The Inspiration effect (+5 to health, magika and stamina to one hour). You can take bonus once per day. \r\n\r\n3.INTERIOR and EXTERIOR different\r\nWhen you want make seat, fire and pot in cave - you have stone seat, metallic pot furniture, and your fire need 4 firewood. \r\nWhen you want make seat, fire and pot in nature exterior - you have wood seat, wood pot furniture, and your fire need 6 firewood.\r\nWhen you want make seat, fire and pot in living interior - you have chairs, wood pot furniture, and your fire need 6 firewood.\r\nThis was make for realism.\r\n\r\n4. When you want go, activate every object and remove. Ashes will be gone in a day. You can store the things in tent, when mod is active. If you want uninstall the plugin, take your things from interior and cupboard!\r\n\r\nINSTALLATION\r\n\r\nFor install: place Data folder from archive to your Skyrim folder. Activate UPS Camp.esp in launcher. \r\nFor uninstall: take your things from interrior and cabinet! Deactivate esp and remove UPS Camp.esp and archive UPS Camp.bsa\r\n\r\nKnown defects and conflicts\r\n\r\nScripts and things in plug-in is unique, but woodchopper axe modifiers are bad for it. Frostfall can make bug with this axe. if boot order change don\\'t help, deactivate one from plugins.\r\nExit marker allways place as in CS, and you\\'ll exit from tent, how marker stay - face from tent, to tent or left... odd))) it\\'s NOT bug.\r\n\r\nCREDITS:\r\n\r\nUmbakano Jr - scripts\r\nPetrovich - models (remodelling and modelling) and idea \r\nSiegrun aka Moorichka - textures, english version\r\n\r\nThanks Bethesda for Skyrim\r\nThanks for friends from all world!\r\nThanks nexus community for requests and ideas\r\n\r\nLEGAL\r\nYou DON\\'T can reupload this mod on other sites!!! English version for nexus only. Russian - see Russian.txt.\r\nYou DON\\'T can use every content from this mod for others plugins or change it.\r\n\r\nSorry for my bad english :))) salut from Russia!",
  "categoryId": "67",
  "version": "0.87",
  "author": "Umbakano Jr Petrovich Siegrun",
  "createdUnix": "1338574139",
  "updatedUnix": "1342385653",
  "containsAdultContent": false,
  "uploadedBy": "Moorichka",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74529",
      "name": "UPS Portable Camp 087 fixed",
      "version": "0.87",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7171",
      "fileName": "UPS Portable Camp 087 fixed-18011-0-87.7z",
      "uploadedUnix": "1342385653",
      "modVersion": "0.87",
      "virusScanUrl": "https://www.virustotal.com/file/ecb12e4600f2424412ea049ffe6428fa94cdf1034b8436ea5dfc8c8a79d001a0/analysis/1407024966/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UPS%20Portable%20Camp%20087%20fixed-18011-0-87.7z?fid=74529&ttl=1535784522&ri=8192&rs=8192&setec=d3c1162fc99b91161d3a0cd5357fb20b"
    }
  ]
}