{
  "modId": 18037.0,
  "modName": "Craft Unenchanted Rings and Amulets",
  "summary": "Adds new amulets and rings to the forge list, using models from the divines amulets and a few others.",
  "descriptionHtml": "This mod is supposed to be very, very simple...\r\n\r\nIt just adds versions of a few amulets already present in the game to the jewelry list on the forge, with new names, to avoid confusions with the vanilla versions. All of them ready for your enchanting pleasures.\r\n\r\nThose are:\r\n- Amulet of the Elder Council (renamed as Amulet of Elders)\r\n- Ancient Nord Amulet (renamed as Nord Amulet)\r\n- The three broken versions of the Ancient Nord Amulet (renamed as Nord Amulet Fragment)\r\n- Necromancer Amulet (renamed as Amulet of the Unliving)\r\n- Amulet of Persuasion (renamed as Amulet of Thieves)\r\n- Amulet of Akatosh (renamed as Pendant of Akatosh)\r\n- Amulet of Arkay (renamed as Pendant of Arkay)\r\n- Amulet of Dibella (renamed as Pendant of Dibella)\r\n- Amulet of Julianos (renamed as Pendant of Julianos)\r\n- Amulet of Kynareth (renamed as Pendant of Kynareth)\r\n- Amulet of Mara (renamed as Pendant of Mara)\r\n- Amulet of Stendarr (renamed as Pendant of Stendarr)\r\n- Amulet of Talos (renamed as Pendant of Talos)\r\n- Amulet of Zenithar (renamed as Pendant of Zenithar)\r\n- Ring of Namira (renamed as Ring of the Dead)\r\n- Hircine\\'s Ring (renamed as Ring of Wolves)\r\n\r\nNow i\\'m kinda lazy, so all you need to craft them is a single septim, sorry about that. But also, be aware that their value is also that of a single septim, so you won\\'t be able to craft your way to richness with those amulets and rings. They\\'re just supposed to add some variety to your charachter\\'s enchanted jewerly.\r\n\r\nv1.2 note: there was an issue with the pendant of julianos (and, in fact, with the vanilla amulet of julianos) showing the wrong model when worn by female characters, namely, showing the elder council amulet. This new version should fix this issue, but just for the pendant of julianos, as I didn\\'t want to change things from the vanilla game, as it could conflict with other mods. However, if someone wants that fixed as well, just tell me, via mp or the comments section and i think i will made a fixed version of the amulet of julianos, possibly as an separate file\r\n\r\nv1.1 note: If you are using version 1.0 you should update with the new file ASAP. v1.0 is essentially broken. Thanks to user TESYL for noting. When i made the items i forgot to add a fundamental line to the new items, resulting in them not being recognisable by the game as amulets (or any equipment, in fact) the new version fixes that.\r\nAlso, removed a leftover description to the Ring of Wolves.\r\n\r\nfuture updates: I don\\'t believe there will be any, not until i get my paws on Dawnguard. then we\\'ll see what new amulets, if any, Bethesda will give us. Please, check it out then. Two months or so, I guess.\r\nWell, I suppose I will update it if someone finds another bug, but I hope not; \r\n\r\npermissions: Use the files as you see fit. I won\\'t begrudge anyone who modifies the file.\r\nIf you do, some credit is nice, but i won\\'t haunt your house when i die if you don\\'t.",
  "categoryId": "27",
  "version": "1.2",
  "author": "blueshound",
  "createdUnix": "1338605604",
  "updatedUnix": "1339713149",
  "containsAdultContent": false,
  "uploadedBy": "blueshound",
  "primaryFile": null,
  "files": [
    {
      "fileId": "65799",
      "name": "AmuletsAndRingsv11",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "AmuletsAndRingsv11-18037-1-1.rar",
      "uploadedUnix": "1338780314",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ec28c3df9e797a224eabe26d03ee5f66ff2945191e47f76f76e2564df666c8bc/analysis/1407092600/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AmuletsAndRingsv11-18037-1-1.rar?fid=65799&ttl=1535784589&ri=8192&rs=8192&setec=7850880daea8f84e97f9d64f81803839"
    },
    {
      "fileId": "68032",
      "name": "AmuletsAndRingsv12",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "AmuletsAndRingsv12-18037-1-2.rar",
      "uploadedUnix": "1339713149",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/14eab2426f09adfced4c6226034b31981db0d0a47c778f74d57c516ed8b04bbe/analysis/1406959562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AmuletsAndRingsv12-18037-1-2.rar?fid=68032&ttl=1535784589&ri=8192&rs=8192&setec=f397561553b3a121ce21cf304a30f8a4"
    }
  ]
}