{
  "modId": 18036.0,
  "modName": "ENB insane0h",
  "summary": "ENB insane0h - with Godrays, detailed shadows & shadow fixes, and parallax mapping support\r\n",
  "descriptionHtml": "ENB insane0h - with Godrays, detailed shadows & shadow fixes, and parallax mapping support\r\n\r\n[img]http://i.imgur.com/NfRs5.jpg[/img]\r\n\r\n\r\nAn ENB preset utilizing the latest 0.113 ENB to add godrays/sunrays, detailed shadows and shadow fixes, SSAO, dark nights, bright days, all to form a superior gaming experience.\r\n\r\n\r\n:::::Features:::::\r\nUtilizes ENB 0.113, which supports Parallax Mapping and Detailed Shadows (look at screenshots)\r\nAdds godrays/sunrays/Crepuscular rays    http://en.wikipedia.org/wiki/File:Crepuscular_rays_at_Sunset_near_Waterberg_Plateau_edit.jpg\r\nhttp://en.wikipedia.org/wiki/File:Crepuscular_rays_09-11-2010_1.jpg\r\nGreat performance for amazing visuals\r\nGreat looking environments, especially in Falkreath Hold\r\nLife-like skin texture and hair\r\nDark nights (I\\'d recommend getting CLARALUX and Wearable Lanterns)\r\nSky and sun are very realisticTM\r\nSeveral options for DoF/SSAO - quality, compromise, performance (WIP having issues with SSAO)\r\nA fantasy temperature biome themed atmosphere and environment (proper for Skyrim)\r\nSimilar to Sharpshooter\\'s Extreme Vision\r\n\r\n\r\n:::::Description:::::\r\nENB insane0h is a blend of Sharpshooter\\'s Extreme Vision, Pure ENB, and Superb ENB, to achieve a look that is cinematic and fantasy-like, all the while trying to not stray away too far from \\\"realism\\\".\r\n\r\nThis ENB is based on real northern Canadian \\\"lighting\\\" values, where I compared dozens of photos I took last year in the Yukon, Canada, to similar ingame locations and screenshots. The Rift looks like Kluane during fall, Whiterun plains look like the plains to the north of Dawson Creek, and Falkreath looks like the forests of the Yukon and British Columbia. The sky and clouds also look like late summer/early fall.\r\n\r\n\r\nENB insane0h uses ENBseries v0.113 by Boris Vorontsov, most of the credit belongs to him and the ENBSeries team. I only tweaked some values, which anybody can do with relative ease. You need to download the latest 0.113 ENB and copy the d3d9.dll in order for this mod to work. Uploading the d3d9.dll file to the nexus is prohibited, and is not included in download on the nexus. Goto the website below and navigate to the downloads, then TESV Skyrim, then click the little arrow pointing down.\r\nhttp://www.enbdev.com\r\n:::::Video:::::\r\n\r\n\r\n[youtube]pKPV4w3P7lc[/youtube]\r\nMore vids:\r\nhttp://www.youtube.com/watch?v=OVbvfRDICq0\r\nhttp://www.youtube.com/insane0hflex\r\n\r\n:::::Notes:::::\r\n* SSAO in ENB insane0h is disabled due to some transparency issues. Will fix this weekend. Currently ENB insane0h v1.0 has no SSAO. So expect a loss of 8-10 FPS.\r\n* You may want to set the ingame brightness (Menu>Settings>Display) to 50 (halfway).\r\n* I disabled bloom, due to my personal prefences. You can however enable it by changing this line to true in the enbseries.ini - EnableBloom=false. Open up the enbeffects or enbseries with any text editor to do so.\r\n* The video above will not show the true ingame darkness, the video codecs will slaughter it and make it look all nasty with constrasty/artifact pixels everywhere. Looks like a real night.\r\n*Press Shift+12 to toggle ENB insane0h on or off. Do this if an area is too dark/bright or if you need a FPS boost (like if you are in combat with a dragon or a lot of necromancers/spellcasters).\r\n* Please note that some locations/cells use day time templates, where they should use night time ones, or vice versa. This is not a problem with ENB insane0h, its one that Betheseda is responsible for. If anyone is aware of a fix, please let me know =)\r\n*ENB insane0h was made entirely by using text editors, but there is a program out there developed by NAME called ENB config tool**** and you can easily adjust your preferences using that program. You can find it here: LINK TO ENB CONFIG MOD\r\n* If you dislike the brightness/saturation, I\\'d recommend getting Imaginator by MGE, which allows you to change different settings in game so you don\\'t have to mess around with enb ini values yourself, if you prefer. There is no impact to performance using Imaginator with ENB insane0h.\r\n\r\n\r\n:::::The download includes:::::\r\n\r\nSeveral options for Depth of Field (Heavy, Light, Heavy DoF & Bokeh, Light DoF & no Bokeh) WIP\r\nand ReAL Sun v3 - my own sunglare texture (though you don\\'t have to use it)\r\nWIP: Performance friendly SSAO configurations (Slow, Fast, None) - coming soon\r\n\r\n:::::Installation:::::\r\n1. Extract the archive and put all of the files into your Skyrim install folder, where the SkyrimLauncher.exe is located.\r\n\r\n2. Next, download the ENB series, version 0.113 by Boris Vorontsov, from this page:\r\nhttp://www.enbdev.com/ \r\nAfter unzipping the enbseries 0113 archive, go into the WrapperVersion folder and copy the file named d3d9.dll, and place the d3d9.dll into your Skyrim directory.\r\nYou may also use the injector version if you prefer, just copy the d3d9.dll and the enbinjector.exe and place it in your skyrim directory. I only use the wrapper version, however, and have never used the enbinjector.\r\n\r\n3. Now, start up your Skyrim via the Launcher (in steam, don\\'t  use SKSE), and the launcher should \\\"re-detect\\\" your settings. Adjust the resolution, AA, AO settings to what you had before. Now exit the game or launcher.\r\n\r\n4. Go to SkyrimPrefs.ini in your My Documents\\\\My Games\\\\Skyrim and change these values\r\nbFloatPointRenderTarget=1  (needed!!!!or else SSAO and other effects won\\'t work!)\r\nbTreesReceiveShadows=1\t   (optional, but heavily recommended, some perfomance hit)\r\nbDrawLandShadows=1\t   (optional, but heavily recommended, some performance hit)\r\n\r\n5. (optional)And finally, I recommend getting these following mods:\r\nRevamped Exterior Fog \r\nRemove Ambient Interior Fog\r\nEnhanced Distant Terrain\r\nEnhanced Distant Detail\r\nImaginator\r\nWearable Lanterns (almost necessary to explore at night!)\r\nCLARALUX\r\nWater Redux (then install ReAL Water, my personal HD water texture)\r\nSkyrim 2K HD or Skyrim Realistic Overhaul\r\nVurt\\'s Floral Overhaul\r\nOsmodius\\' Parallax Mods (for the major cities of Skyrim)\r\nParallax Rocks\r\nLush Trees\r\nLush Grass\r\n\r\n:::::Additional Tweaks to Consider:::::\r\n* Change your resolution based on your framerate. I play at 1080p with 35-40 FPS with ENB insane0h, FXAA  and high shadows. You can always lower your resolution to 720p and still have a great experience.\r\n* Want no DoF? Go to enbseries.ini and change EnableDepthOfField=true to false, improves performance.\r\n* Want no SSAO?(major performance killer), go to enbseries.ini and change EnableAmbientocclusion=true to false, really improves performance (10-15FPS).\r\n* Want to use vanilla post processing?(ie retain the colors of vanilla skyrim), go to enbseries.ini and change\r\nUseOriginalObjectsProcessing=false, to true\r\nUseOriginalPostProcessing=false, to true\r\nUsePaletteTexture=true, to false\r\n* Detailed Shadows also reduces FPS, go to enbseries.ini and change EnableDetailedShadow=true, to false.\r\n\r\n:::::Credits:::::\r\nCredits go to Boris Vorrontsov and his ENBSeries development team for developing ENB and ENB 0.113\r\nMatso for the DoF 2.0.5 code ENB insane0h utilizes.\r\nA lot of ENB settings were derived from Sharpshooter\\'s ENB, then adapted to use 0.113 ENB, so most of the ENB ini tweaks credit goes to Sharpshooter\r\nOther sources of ini tweaks/configuration values that I liked are from\r\nPure ENB\r\nSuperb ENB\r\nAnd I learned a great deal from the ENB documentation provided by Tapioks, from his Pure ENB download.\r\n\r\n:::::Additional mods that I use and recommend to enhance your graphical experience:::::\r\nWater Redux (then install ReAL Water, my personal HD water texture)\r\nSkyrim 2K HD\r\nOsmodius\\' Parallax Mods (for the major cities of Skyrim)\r\nParallax Rocks\r\nLush Trees\r\nLush Grass\r\nReAL Sun\r\nSun and Clouds Textures\r\n\r\n\r\n\r\nThanks for reading the ReadMe (so many don\\'t!).\r\nI put a lot of time and effort into making ENB insane0h, and enhancing others gaming experience is what I look forward to the most.\r\n\r\nCheers, and enjoy,\r\n\r\nsvaalbard/insane0hflex\r\n\r\nAlso, feel free to check out my youtube channel. I make videos about Skyrim and other games, but mainly its Skyrim Mod reviews, features, showcases, gameplay and commentary (Let\\'s Play), etc.\r\n\r\nhttp://www.youtube.com/insane0hflex\r\n\r\nRemember, the 0 is a zero, not the vowel \\'O\\' . However, its still pronounced insane-oh-flex.\r\n\r\n\r\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++",
  "categoryId": "62",
  "version": "v1",
  "author": "insane0hflex",
  "createdUnix": "1338602179",
  "updatedUnix": "1338677067",
  "containsAdultContent": false,
  "uploadedBy": "svaalbard",
  "primaryFile": null,
  "files": [
    {
      "fileId": "65224",
      "name": "ENB insane0h v1",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "199",
      "fileName": "ENB insane0h v1-18036.zip",
      "uploadedUnix": "1338602327",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3002b8052b75a4b5df3ae88aaf246b1b1d7ddd2930848b08e94f19d944360941/analysis/1406930949/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ENB%20insane0h%20v1-18036.zip?fid=65224&ttl=1535784587&ri=8192&rs=8192&setec=faf423f3e8553f27f2431f8d579b221e"
    },
    {
      "fileId": "65510",
      "name": "ENB insane0h v1_5 - good performance",
      "version": "v1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28",
      "fileName": "ENB insane0h v1_5 - good performance-18036-v1-5.zip",
      "uploadedUnix": "1338677067",
      "modVersion": "v1.5",
      "virusScanUrl": "https://www.virustotal.com/file/cbfbbdb98e3b944d8b914838eebca13922410ab1485c98093d24ba75d5586640/analysis/1406933403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ENB%20insane0h%20v1_5%20-%20good%20performance-18036-v1-5.zip?fid=65510&ttl=1535784588&ri=8192&rs=8192&setec=af76d2cbeed78ebc6aeecd00247fd257"
    }
  ]
}