{
  "modId": 18044.0,
  "modName": "Way of the Sword - Skyrim Katana Revised",
  "summary": "The purpose of this mod is to add a level of authenticity to the Japanese-inspired swords featured in the game (including how they sound), make them a more unique weapon type, and make a number of related add-ons, tweaks, and fixes, while staying true to the game\\'s lore and visual style.",
  "descriptionHtml": "[center][img] http://skyrim.nexusmods.com/imageshare/images/552224-1338618918.png [/img][/center]\r\n\r\nThe purpose of this mod is to add a level of authenticity to the Japanese-inspired swords featured in the game (including how they sound), make them a more unique weapon type, and make a number of related add-ons, tweaks, and fixes, while staying true to the game\\'s lore and visual style.\r\n\r\n[color=bisque][b]Feedback and endorsements are always appreciated.[/b][/color]\r\n\r\n[color=silver][size=4]| LATEST NEWS |[/size][/color]\r\n\r\nOptional file added.\r\n\r\nI added an optional file that lowers the loudness of additional sfx that play when you unsheathe enchanted weapons. This is something I use myself in combination with my mod as well as some others that change weapon sfx. The volume is balanced using the sfx in this mod as reference. Thought some of you guys may find this usefull. Keep in mind that this affects [i]all[/i] weapons.\r\n\r\nVersion 1.3 released.\r\n\r\nThe grip has been completely redesigned. The wrap is 3D and the braid follows the correct pattern (i.e. it alternates and the sides are asymmetrical, unlike vanilla). Menuki is replaced with the empire/dragonborn symbol (also in full 3D), which makes sense for the faction in service of the empire and the dragonborn. All related textures are updated to match the new model and are much more detailed and photorealistic than before.\r\n\r\nFun fact: Apart from having blade geometry that makes absolutely no sense for any functional sword, Japanese or otherwise, vanilla Skyrim katana are actually dull. The \\\"cutting\\\" edge is something like 3mm thick. Sure, you could still beat people to death with it, but cut - not so much.\r\n\r\nEnjoy.\r\n\r\n[color=silver][size=4]| MOD FEATURES |[/size][/color]\r\n\r\nThe complete current list of features is as follows:\r\n\r\n[color=bisque][b]Two-handed Akaviri/Blades swords[/b][/color] - \\\"Blades Greatswords\\\" are added to the game. These swords have longer blades than the one-handed variants and come without the groove (and, therefore, are heavier). The weight, reach, speed, damage, and stagger are balanced to match these characteristics. Effectively, the swords are fast and have good DPS, but lack the reach and stagger of the typical two-hander in the game. A couple of these swords are placed in logical locations in the game. (For exact stats and item placement see readme).\r\n\r\n[color=bisque][b]Authentic sound effects[/b][/color] - All swords that this mod adds or alters come with authentic draw/sheathe sound effects. I have recorded and edited these myself, using a real sword - a weapon, not a wall hanger. Same as in vanilla, there are three different \\\"draw\\\" sounds that the game chooses between randomly. Unlike vanilla, there are also three different \\\"sheathe\\\" sounds (in vanilla there is only one). I matched SFX to animations (mainly velocity, which affects both loudness and length of sounds); therefore, one- and two-handed swords have different sound effect.\r\n\r\nI tried my best to approximate the loudness level and keep it at a sensible level but the SFX in this game are not exactly realistic, and finding a good reference point has proven to be somewhat difficult. After some testing and tweaking, I find that the current loudness level is [i]reasonably[/i] accurate overall.\r\n\r\n[color=bisque][b]Revised models and textures[/b][/color] - The sword model has been completely reworked. The blade geometry is a lot closer to reality and the blade textures are based on high res. photos of real swords. The grooves on the swords that have them are done in 3D. Some smaller parts are also redesigned (e.g. the habaki is now properly shaped, 3D seppa are added). The blade length is around  72 cm / 28.3 in and 80 cm / 31.5 in for one- and two-handed swords respectively.\r\n\r\nThe grip has been completely redesigned. The wrap is 3D and the braid follows the correct pattern (i.e. it alternates and the sides are asymmetrical, unlike vanilla). Menuki is replaced with the empire/dragonborn symbol (also in full 3D), which makes sense for the faction in service of the empire and the dragonborn. All related textures are updated to match the new model and are much more detailed and photorealistic than before. \r\n\r\nThe scabbard model has been remade with a noticeably higher polygon count. It is more properly shaped/sized and there is now a small gap between the scabbard and the guard when the sword is fully sheathed, as one might expect. Metal elements are gone, which is partially a question of aesthetics, but the original actually had metal on the [i]inside[/i] of the scabbard\\'s mouth as well. The scabbard is now black and looks more like lacquered wood. The wrap textures are more detailed.\r\n\r\nAlso, NPCs should now always wear scabbards, not just the naked swords.\r\n\r\n[color=bisque][b]Adjusted wearing position and grip[/b][/color] - One-handed sword wearing position is changed to a more sensible one (which is still reasonably aligned with the draw/sheathe animations). This change actually affects [i]all[/i] one-handed swords. Blades Swords are now held right below the guard for seemingly obvious reasons.\r\n\r\n[color=bisque][b]Forgeable Blades swords[/b][/color] - Both one- and two-handed variants can be forged once \\\"Alduin\\'s Wall\\\" is completed (and, thus, you have full access to Sky Haven), provided that you have the Steel Smithing perk.\r\n\r\n[color=bisque][b]Rebalanced one-handed Blades swords[/b][/color] - All one-handed Akaviri swords are slightly quicker but also slightly less likely to cause your opponent to stagger. This is so that they stand out from the other weapon types a bit. (For exact stats changes see readme).\r\n\r\n[color=bisque][b]Fixed/rebalanced Dragonbane[/b][/color] - Lv.27-35 version of Dragonbane will now have the appropriate enchantment strength. All versions now scale more consistently overall. The damage of all versions is increased by 1 so that the weakest one you can get is not weaker than the base Blades Sword. (For exact stats changes see readme).\r\n\r\n[color=bisque][b]Fixed/rebalanced Ebony Blade[/b][/color] - Ebony Blade is now considered to be a two-handed weapon in every respect. Its speed, reach, and stagger are somewhere between the two-handed Blades sword and a typical two-hander. Base damage is increased slightly. (For exact stats changes see readme).\r\n\r\nThis mod makes changes to both the weakened version of the Ebony Blade that you can normally obtain in unmodified game as well as the \\\"true\\\" version that is hinted at but doesn\\'t appear in the unmodified game. The changes to the latter are intended for use with [url=http://skyrim.nexusmods.com/downloads/file.php?id=10437]Full Ebony Blade[/url] by Glitchfinder or other mods that allow you to obtain the \\\"true\\\" version. You can also use the console to get it, of course.\r\n\r\n[color=silver][size=4]| FUTURE PLANS |[/size][/color]\r\n\r\nThings I\\'ll get around to when time permits:\r\n\r\n- [b]One or two unique swords[/b]\r\n- [b]Authentic swing sound effects[/b]\r\n- [b]Further model improvements[/b]\r\n- [b]Further texture improvements[/b]\r\n- [b]Tweaks/fixes based on feedback[/b]\r\n\r\nThings [i]not[/i] to get high hopes for:\r\n\r\n[color=silver][b]Two-handed swords that are not carried on the back[/b][/color] - This game does not aspire to realism in any way and there is only so much one can do to change the mechanics on which it is based. There are 2 feasable ways of achieving this that I can think of at this time. 1st involves making ALL 2h weapons being carried on the waist/hip; considering how oversized most of them are, this is not a good overall solution. 2nd has to do with adding scripts that dynamically change the sword from 2h to 1h and vice versa depending on what you are doing with it. There are several problems/challenges with this approach, however:\r\n \r\n1) Script triggers - specifically, it\\'s easy to make the sword inherently 1h. When you draw the sword (using 1h draw animation, obviously), a script would trigger that changes it to 2h. By the time the sword is out, it should be 2h. But what about the reverse? If you now sheathe the sword, by the time you could make the script that changes it to 1h trigger, the 2h sheathe animation will have already started.\r\n \r\n2) Script delays - say you manage to create a script that somehow overcomes the above problem. Using custom scripts to achieve the above could create delays and make the whole experience very unresponsive because of how the game handles these things. Worst case scenario (many mods and different scripts running), it could take several seconds before the animation triggers from the time you pressed the button.\r\n \r\n3) Transitions between animations - using 1h animations for drawing/sheathing and 2h for idle and combat means that your character will make unnatural jerky movements during the transitions from one to the other.\r\n \r\n[b]If anyone has constructive ideas on how to overcome these issues or knows a better solution, I\\'m open to suggestions.[/b]\r\n\r\n[color=silver][b]One-handed swords carried edge up[/b][/color] - As far as I can tell, this one would require custom animations and Bethesda hasn\\'t provided us with a straighforward way of adding new animations to the game. There are workarounds but they have limitations and could potentially cause a number of issues.\r\n\r\nHowever, I don\\'t really see this one as that much of a problem. One can simply assume that the sword is a tachi, or a katana worn \\\"tachi style\\\". This is in fact a very viable assumption. Without going into detail, consider two things: 1 - the (real life) time period Skyrim\\'s setting roughly corresponds to, and 2 - the circumstances of the typical encounters and the common mode of transportation (which as of v1.6 also includes combat elements).\r\n\r\n[color=silver][size=4]| COMPATIBILITY |[/size][/color]\r\n\r\nThe mod will obviously conflict with anything that modifies the same game resources. Notably, this includes skeleton .nif files.\r\n\r\nCompatibility patch is provided for those (like me) who use [url=http://skyrim.nexusmods.com/downloads/file.php?id=601]Realistic Ragdolls and Force[/url] by dDefinder.\r\n\r\nIf you are using some other mod that modifies the skeleton files, Skulltyrant may have a fix for you. Be sure to check out his [url=http://skyrim.nexusmods.com/downloads/file.php?id=16712]Custom Skeleton Replacers[/url].\r\n\r\n[color=silver][size=4]| INSTALLATION |[/size][/color]\r\n\r\nUse Nexus Mod Manager\r\n\r\nOR\r\n\r\nExtract all the folders and the \\\"Way of the Sword.esp\\\" file to your \\\".../Skyrim/Data\\\" folder. Don\\'t forget to activate the .esp in the launcher.\r\n\r\nIf you are using Realistic Ragdolls and Force by dDefinder, download the patch from the optional files section. When both Realistic Ragdolls and Force and Way of the Sword are installed (in either order), extract the patch to \\\".../Skyrim/Data\\\" and allow it to overwrite existing files.\r\n\r\n[color=silver][size=4]| UNINSTALLATION |[/size][/color]\r\n\r\nRemove all the files that come with this mod from your \\\".../Skyrim/Data\\\" folder.\r\n\r\nIf you had this mod installed together with Realistic Ragdolls and Force and want to keep using the latter, replace the 4 conflicting files that you had to overwrite during installation with the ones that come with Realistic Ragdolls and Force. Or simply reinstall Realistic Ragdolls and Force.\r\n\r\n[color=silver][size=4]| VERSION HISTORY |[/size][/color]\r\n\r\nV1.3 - Redesigned grip in 3D with realistic geometry and textures\r\nV1.2 - Completely reworked sword model geometry and blade textures.\r\nV1.1 - Redesigned hilt. A number of model/texture tweaks and fixes.\r\nV1.0a - Additional SFX post processing. Lowered loudness a bit.\r\nV1.0 - Initial release.",
  "categoryId": "55",
  "version": "1.3",
  "author": "Seven Black",
  "createdUnix": "1338618683",
  "updatedUnix": "1341674738",
  "containsAdultContent": false,
  "uploadedBy": "Seven7Black",
  "primaryFile": null,
  "files": [
    {
      "fileId": "65288",
      "name": "WotS - Realistic Ragdolls Patch",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "41",
      "fileName": "WotS - Realistic Ragdolls Patch-18044-1-0.rar",
      "uploadedUnix": "1338623083",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c38c59944e8aead2a960e63771835af51a0c53799f2c92209663cbd3de5d170e/analysis/1406931394/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WotS%20-%20Realistic%20Ragdolls%20Patch-18044-1-0.rar?fid=65288&ttl=1535784598&ri=8192&rs=8192&setec=1298250a00df86fd025f5d89a42233d4"
    },
    {
      "fileId": "69843",
      "name": "Way of the Sword v1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9949",
      "fileName": "Way of the Sword-18044-1-2.rar",
      "uploadedUnix": "1340465590",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/b45a02e6c8682fd9a3565a682097bf160a9b72d4f411a45fda9140707fa4dd04/analysis/1406978179/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Way%20of%20the%20Sword-18044-1-2.rar?fid=69843&ttl=1535784599&ri=8192&rs=8192&setec=9ec6d363ec319dfd709b10889829de1d"
    },
    {
      "fileId": "72574",
      "name": "Way of the Sword",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9655",
      "fileName": "Way of the Sword-18044-1-3.rar",
      "uploadedUnix": "1341584710",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/da82d6780f4b69ec59452a722341e5b68132a26be7bd5c5c167895bca185aec9/analysis/1407005384/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Way%20of%20the%20Sword-18044-1-3.rar?fid=72574&ttl=1535784599&ri=8192&rs=8192&setec=df79da224664e09fa5162e30cff8a437"
    },
    {
      "fileId": "72784",
      "name": "WotS - Quieter Enchantment SFX",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "740",
      "fileName": "WotS - Quieter Enchantment SFX-18044-1-0.rar",
      "uploadedUnix": "1341674738",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/55c278fb6c35bf2446f26c83b979893d20a7504500ab27276f82d466f067b649/analysis/1407007626/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WotS%20-%20Quieter%20Enchantment%20SFX-18044-1-0.rar?fid=72784&ttl=1535784600&ri=8192&rs=8192&setec=22a4532695babd834cc9f16c4fead79a"
    }
  ]
}