{
  "modId": 18057.0,
  "modName": "SidratsUStore",
  "summary": "a Beta version of a proof of concept modders resource, for automatic inventory storing based on item type.  A-Z Library that you stock yourself.  Get out there pack rats! Enjoy. Please provide feedback.",
  "descriptionHtml": "IN GAME\r\n\r\nButtons and containers for all vanilla items.\r\n\r\nThere are ten chests for weapons\r\n12 chests for armour\r\n10 chests for the other item types (ingredients, food, ore, ingots, soul gems, potions, poisons, rings amulets and diadems etc)\r\n\r\nSeven bookshelves, featuring 15 book slots per shelf.  These aren\\'t your normal bookshelf though.  It\\'s sorted alphabetical, and to make it easier, just drop one or two books in to the chest and it will be done for you.  Got more than a few books, well press the button and it\\'ll sort it out.\r\n\r\nSkill books live on the last two cases.\r\nBooks will appear when you activate the shelf.\r\nExtra copies, spell tomes, notes and most diaries will be stored safely in the chest.\r\n\r\nPlus a rather nifty safe to store precious stones and two types of ingots - Items stored here will be represented in an attractive display case.  Complete the set and feel smug and at one with your inner-bling.\r\n\r\nConstruction Set\r\n\r\nFeel free to de-construct scripts for your own pleasure.  There\\'s also a bookshelf outside of the playable area for your copying and pasting pleasure.  15 books maximum per shelf (18 is just too annoying to get to work)\r\n\r\nMini-site\r\n\r\nFeaturing more screen shots and relevant news\r\nhttps://sites.google.com/site/eveindustrialorganiser/sidrats-skyrim-mod-home-page\r\n\r\nDisclaimer\r\n\r\nI am in no way responsible for corrupt files, lost hours or being caught in the rain.\r\n\r\n\r\nThanks go to:\r\nBethesda Game Studios for the awesomeness of releasing construction sets for free and their support for the modding community.\r\n\r\nThe excellent tutorial which any new coder should watch and learn from http://www.youtube.com/watch?v=Rpb925uNeG8&feature=youtu.be&hd=1\r\n\r\nThe conversation, distraction and immense help from those across steam, nexus, and Tes: Alliance forums.",
  "categoryId": "67",
  "version": "0.09",
  "author": "Sidrat Flush",
  "createdUnix": "1338637710",
  "updatedUnix": "1338638697",
  "containsAdultContent": false,
  "uploadedBy": "Sidrat2009",
  "primaryFile": null,
  "files": [
    {
      "fileId": "65333",
      "name": "Sidrats U Store",
      "version": "0.09",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "42",
      "fileName": "Sidrats U Store-18057-0-09.rar",
      "uploadedUnix": "1338638697",
      "modVersion": "0.09",
      "virusScanUrl": "https://www.virustotal.com/file/fd4efbc32a0a395c35ec0ebd45ac0aa3878aa483ad25ead800bdadb36e17d4a5/analysis/1406931663/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sidrats%20U%20Store-18057-0-09.rar?fid=65333&ttl=1535784623&ri=8192&rs=8192&setec=e836955901d640d343328f790c05fe8c"
    }
  ]
}