{
  "modId": 18088.0,
  "modName": "The Menagerie and the Madman",
  "summary": "This is a very lore-friendly quest mod. On the road south of Riften, you will find The Marvelous Mudcrab, a strange shop run by an old man and his talking Mudcrab, Muck. This man, Greygrin the Enigmatic (voiced), has had an important artifact stolen from him: The Onyx Visage.",
  "descriptionHtml": "This is a very lore-friendly quest mod. On the road south of Riften, you will find The Marvelous Mudcrab, a strange shop run by an old man and his talking Mudcrab, Muck. This man, Greygrin the Enigmatic (voiced), has had an important artifact stolen from him: The Onyx Visage. It is your task to track down the thief, Rugan, by following the notes that he has left behind. Along the way, you will find three skill books, which tell the tales of Aagheist the Damning, an evil deity from the same void as Sithis, and Fjorin and the Four, a legendary band of Nord warriors. These tales become very relevant as it becomes clear that Rugan means to resurrect Aagheist in Fjorin\\'s Tomb. Fjorin\\'s Tomb is a high-difficulty dungeon composed of five mini-boss style encounters and two big boss encounters. Once the Onyx Visage has been retrieved and returned to Greygrin, the Dovahkiin will be faced with a choice: Embrace the evil and power of the Onyx Visage, or destroy it for the betterment of the world?\r\n(In the dungeon, the doors are locked. This IS intentional. The keys are hidden in each room, and you have to search for them. Don\\'t worry, there is a trick to it, discussed in the Tips & Tricks section, if you want to know now.)\r\n\r\n\r\nTIPS & TRICKS:\r\n\r\nIF YOU WANT MORE OF A CHALLENGE, DO NOT READ\r\n\r\n\r\n\r\n--In Fjorin\\'s Tomb, each room has a skeletal arm that points in the direction of the key to the next room.\r\n\r\n--Safeer\\'ack is an archer enemy, but his axe still hits hard. Keep him switching weapons by attacking from mid range and moving towards and away.\r\n\r\n--When fighting the brothers Odaaris & Kajad, kill Kajad first. He summons Frost Atronachs, but has substantially lower health.\r\n\r\n--In the encounter with Fjorin\\'s Band of Twenty, use the portcullis to divide your enemies into smaller, more manageable numbers.\r\n\r\n--In the encounter with Fjorin the Bloodied, keep your distance. If you can draw him to the swinging mammoth skull trap and get him to activate it, he is dispatched with ease.\r\n\r\n--Son of Haagur has a great amount of health, which regenerates very quickly. To prevent him from regenerating, get him to stand on the fire geysers.",
  "categoryId": "88",
  "version": "1.3",
  "author": "Whygonedjinn",
  "createdUnix": "1338659644",
  "updatedUnix": "1339295493",
  "containsAdultContent": false,
  "uploadedBy": "whygonedjinn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "67029",
      "name": "The Menagerie and the Madman",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27248",
      "fileName": "The Menagerie and the Madman-18088-1-3.zip",
      "uploadedUnix": "1339295493",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/33d0ba4d60f69c2f285dcb71b791d30ad1cfd882906205752df47f05d856f558/analysis/1406949497/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Menagerie%20and%20the%20Madman-18088-1-3.zip?fid=67029&ttl=1535784695&ri=8192&rs=8192&setec=e65c3103903606d0babffe1155ed15d6"
    }
  ]
}