{
  "modId": 18102.0,
  "modName": "Rika Battleborn - Level 60 Nord",
  "summary": "This is Rika~! Shes level 60 and ready to go with a few mods~!",
  "descriptionHtml": "Her name is Rika Battleborn. She was born into the Battleborn household 22 years ago. One day her family took her to the woods because they thought she was possessed by a Daedric Prince. She would claw at the walls until her fingernails bled and she would sometimes use a voice that sounded demonic and scratchy. The family left her there in the woods to die alone.. They tried to forget the whole thing.. What they didnt expect was that she will return someday.. Today is that day.. She has lost all of her memory of being in the family as they left her in the woods at 3 years of age. Now, Rika lives a nice, quiet, and peaceful life in the house she loves to call Breezehome that she acquired from Jarl Balgruuf of Whiterun. \\\"The Hardest Thing In Life Is Remembering Who You Really Are.. Are You A Monster Or A Human?..\\\" - Rika Battleborn (Age 16)\r\n\r\nShe requires the latest update and a few other things~\r\nMods Required:\r\nCBBE v3\r\nXenius Character Enhancement\r\nFreckles mod by.. I cant remember right now but im sure if you just search \\\"Freckles\\\" in the search box you\\'ll find it.. hmmm...\r\n\r\n^^ You should be able to find those here~ I did, lol. Well, hope you guys enjoy her~ Shes finished the main quest and owns Breezehome. I finally got some screenshots! ^^ Lol. It took me FOREVER!! But it was all worth it in the end!! ",
  "categoryId": "43",
  "version": "",
  "author": "Ellis Lucas",
  "createdUnix": "1338681235",
  "updatedUnix": "1338681491",
  "containsAdultContent": false,
  "uploadedBy": "elliscountryboy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "65529",
      "name": "Rika Battleborn",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1949",
      "fileName": "Rika Battleborn-18102.rar",
      "uploadedUnix": "1338681491",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2d28b7385c65a824a3221c99efabd30fb2bf7060de09de1dd0a5526167c17002/analysis/1406933708/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rika%20Battleborn-18102.rar?fid=65529&ttl=1535784713&ri=8192&rs=8192&setec=6ca01f4e8523c39ea408f2feb5c8577e"
    }
  ]
}