{
  "modId": 18106.0,
  "modName": "Guarded Borders",
  "summary": "Adds a few small camps on the borders of the game world.",
  "descriptionHtml": "Quoth TV Tropes\\'s WMG page on the game: \\\"There will be a logical reason for why you can\\'t cross borders this time. Since Todd Howard already said you are arrested and awaiting execution for crossing the border in this game, it makes sense you won\\'t cross the borders, seeing as they\\'re locked down for the duration of the Civil War, and with Skyrim being a mountainous county, one CAPABLE of stopping people trying to border hop, they block the border with mountains except for a couple passes with Insurmountable Waist High Fences that happen to be heavily guarded. Voila, border guards, logical reason not to cross the border, better immersion. (and if Bethesda doesn\\'t do this, I\\'m sure some modder eventually will.)\\\"\r\n\r\nWell, let\\'s make that a self-fulfilling prophecy, shall we?\r\n\r\nThis mod adds camps around the gates to Morrowind, Cyrodiil, and Hammerfell (outside Stendarr\\'s Beacon, south of Helgen, and south of Falkreath respectively) to serve as a border guard in order to keep the civil war from spilling into the neighbouring lands. I hope to add a similar camp to High Rock, as well as possibly naval blockades around High Rock and Morrowind, in the future. Suggestions are welcome.\r\n\r\nNote that it is recommended that you use this mod with a method of disabling borders, such as editing the .ini or with Unlimited Tamriel, if you want to check out the Morrowind border outpost. The designated border is just a little outside the camp, so without those mods, you can see it but not go in and interact with it. The Cyrodiil and Hammerfell camps work fine without it.\r\n\r\nNote that the caped soldiers in the screenshots are from Cloaks of Skyrim and are NOT included - they won\\'t have capes unless you have that mod. However, I\\'ve gotten permission from hothtrooper44 to use his wonderful Redguard Knight set for the soldiers from Hammerfell, so the models ARE included in this mod. Thank you for letting me use your models, hothtrooper!\r\n\r\nHave fun!\r\n\r\nRevision 2 - June 2, 2012. This is a big one. I\\'ve corrected the border south of Falkreath, so now it is properly listed as the border to Hammerfell. The Imperial soldiers have been moved to their proper place south of Helgen, with a new camp being created for them. I\\'ve also changed the names of these locations from \\\"border patrol\\\" to \\\"border outpost\\\", per suggestion.\r\nRevision 1 - April 13, 2012 - Added a border camp to Cyrodiil.\r\nInitial Release - April 8, 2012",
  "categoryId": "89",
  "version": "3",
  "author": "Captain Lhurgoyf",
  "createdUnix": "1338687134",
  "updatedUnix": "1338687257",
  "containsAdultContent": false,
  "uploadedBy": "CaptainLhurgoyf",
  "primaryFile": null,
  "files": [
    {
      "fileId": "65536",
      "name": "Guarded Borders",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19857",
      "fileName": "Guarded Borders-18106-3.zip",
      "uploadedUnix": "1338687257",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/26a7df652495b3b0c2b57c250af177af11fc63f54dd835b4b5a4211a1e3b6945/analysis/1406933892/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Guarded%20Borders-18106-3.zip?fid=65536&ttl=1535784724&ri=8192&rs=8192&setec=674009ce397d2d99f54ee0af76d46864"
    }
  ]
}