{
  "modId": 18104.0,
  "modName": "Thermopylae",
  "summary": "Help the Spartans defeat Xerxes horde! New world space based on Thermopylae, unique landscape textures, over 2,500 hand placed objects, over 1,500 NPCs to slaughter! Greek style player home, new armor, weapons, followers, factions, spells and secrets!",
  "descriptionHtml": "[b][size=+3]Foreword by Leonidas[/size][/b]\r\n\r\nYou bring the crowns and heads of conquered kings to my city steps. You insult my queen. You threaten my people with slavery and death! Oh, I\\'ve chosen my words carefully, Persian. Perhaps you should have done the same! \r\nPersian messenger: this is madness! This is Skyrim!?\r\nLeonidas: Skyrim…? THIS IS SPARTA!\r\n\r\nA video by Tyrannicon\r\n[youtube]4ct1668FUKs[/youtube]\r\n\r\n[b][size=+4]Important:[/size][/b]\r\n\r\nDue to the patrol AI, I suggest waiting ingame until Sunday night at about 8pm before going to Thermopylae. Once there head over to the Spartan camp and read the literature provided on the table:\r\n\r\nLeonidas’s book contains a rough guide to patrol times\r\n\r\nArtemis’s book contains contingencies in case you think you’ve run into a problem. \r\n\r\nDilios’s book contains helpful console commands.\r\n\r\n\r\nFor those who used my last mod, this mod supersedes it, as such its files are no longer necessary. Delete:\r\n\r\nSpartanv10.esm, spartanv10.bsl, and spartanv10.bsa\r\n\r\n(They won’t conflict, but just delete them anyway)\r\n\r\nAlso it is recommended you type “sifh 1” into the console to remove friendly fire – I think you have to do this every time you load a save.\r\n\r\nThis mod also changes shaved hair to bald hair, you were warned!\r\n\r\n[b]Update[/b]\r\n1.01 : Just edited that navmesh to make sure followers can go back and forth to Thermopylae. You may still need to wait an hour in Thermopylae for followers to show up, this is because they go through the marker, which is not beside the door - they have to run to it!\r\n\r\n1.01 - Lite: This optional file simply lowers the number of persians that spawn. It also slightly weakens the Spartans against the persians. The spartan faction has a perk that means it deals more damage to members of the persian faction while also reciving less damage; it was this perk that was weakened, not the level of the spartans generaly.\r\n\r\nA video by Aretino:\r\n[youtube]4kYGQ8jVkYs[/youtube]\r\n\r\n\r\n[b][size=+3]Description[/size][/b]\r\n\r\nAn inter-dimensional time portal has opened up at the top of Dragontooth crater. This portal transports you to Thermopylae. Once here you’ll fight alongside the Spartans and Arcadians doing battle with Xerxes and his Persian hordes. \r\n\r\nThis is my second mod; it adds the world space of Thermopylae. I’ve used new landscape textures to make sure my world space is unique and has a different feel than that of Skyrim. I’ve hand placed over 2,500 items, objects and effects–from the fish in the sea, the ants on the ground to the birds in the sky. It also contains some 1,500 NPCs.\r\n\r\nI’ve organised all the NPCs to run patrols that roughly follow what happens in the movie, as such there is a *start* time. To get the most out of this mod go to Thermopylae on Sunday at 8pm, head over to the Spartan camp and read the literature on the table.\r\n\r\n\r\n[b][size=+3]What does this mod add? Here’s a list:[/size][/b]\r\n\r\nThermopylae world space based on the movie 300.\r\n\r\nCharacter presets of Leonidas, Dilios, Stelios, Artemis, Astinos, Daxos for Nord, Bretan and Imperial.\r\nCharacter presets of Xerxes, Xerxes’s emissary and Xerxes’s messenger for redguards.\r\n\r\nCompanions: Leonidas, Dilios Stelios, Artemis, Astinos, Daxos, Spartan Warrior, Arcadian Warrior and a couple of other Arcadians.\r\n\r\nArmours: Spartan armour, immortal armour, Persian armour, Tribesman armour, Persian mystic robes, Xerxes’s armour, Spartan shield, wicker shield and a few other shields.\r\n\r\nWeapons: Spartan spear, Persian swords, spears, Xerxes’s Staff\r\n\r\nSpells: conjure Persian, conjure immortal, conjure Uber immortal, and conjure Spartan.\r\n\r\nSecrets: there are 6 Blood chests spread over the Thermopylae world space, they have good loot and many contain unique spells (i.e. the above mentioned spells) etc.\r\n\r\nPlayer owned home: tried to stick to a Greek style, it’s situated at the top of a mountain with a nice balcony to take in the sunset. It has all the essentials, mannequins, weapon rack, book cases, alchemy worktop, enchanting worktop, tanning rack, smelter, work bench, grindstone, furnace, cooking spit and storage. The key has to be found!\r\n\r\nUnique NPC’s and enemies: last time I checked there were about 40 unique looking Npcs.\r\n\r\nUnique enchantments: Xerxes has a few, not over powered though.\r\n\r\nNew factions: The Spartan faction and the Persian faction.\r\n\r\nNew perks: Its unplayable, but Spartan members of the Spartan faction (Arcadian’s are members of the faction too) have a perk which decreases the damage they take from members of the Persian faction and also increases the damage they deal to the Persian faction. Meaning these followers won’t be overpowered in skyrim, but they’ll be able rip some Persians apart.\r\n\r\nLeonidas should shout “This is Sparta” when he uses unrelenting force. Though he doesn’t seem to say it all the time, I’ve noticed.\r\n\r\nI’ve added patrols to loosely match how the film played out.\r\n\r\nThere are two shops to stock up on potions. \r\n\r\n\r\n[b][size=+3]Location:[/size][/b]\r\n\r\nRiverwood…. Ahahaha only joking, I’d never put it there! Head to the top of dragontooth crater.. now jump off. Actually though, the portal is at the end of the mossy cliff overhang. The portal is close enough to the cliff to catch you, if you walk off or even if you jump off- you can’t miss it, well unless you jump off in the wrong place.\r\n\r\n\r\n[b][size=+3]Requirements[/size][/b]\r\n\r\nVersion 1.5 or above of skyrim\r\n\r\n\r\n[b][size=+3]Installation[/size][/b]\r\n\r\nJust drop the data folder into you Skyrim folder and make sure the esp is activated.\r\n\r\n\r\n[b][size=+3]Bugs[/size][/b]\r\nThe LOD generation on the creation kit is bugged; it’s made the LOD at the beach look odd. It’s also made some odd looking land out in the sea. I’d try to generate it in oscope but it won’t display any plugins, any thoughts?\r\n\r\nSometimes the patrols don’t reach their intended destination. Technically most of them have the same route just at a different time, so if one patrol can do it I don’t see why some of them stop. Any help? As a quick fix just either leave the area and come back or wait for an hour or two. \r\n\r\n\r\n[b][size=+3]FAQ[/size][/b]\r\n\r\n[b]Will there be dragons?[/b]\r\n\r\nNo. Having said that deadly dragons events still happen here, so I suggest turning them off while you’re here. Any dragon that has attacked me here has clipped through the terrain-I’ve no idea how to stop that. The walk-able areas are navmeshed and they still fly through it.\r\n\r\n[b]The Spartans are angry with me and won’t follow me.[/b]\r\n\r\nType  “setrelationshiprank <acterID> 4” that should make them friendly again.\r\n\r\n[b]How big is Thermopylae?[/b]\r\n\r\nBigger than a hold’s capital city; but smaller than a hold. In short - big enough.\r\n\r\n[b]Is this world full of resources?[/b]\r\n\r\nIf you’re looking for a cheap mod with 100 ebony ore to mine, you’ve come to the wrong place. There’s some ore, food, animals for hides and a few alchemy ingredients. However I think I did overdo the potions in the shops..\r\n\r\n[b]Where are the keys to the house?[/b]\r\n\r\nIn a Blood chest.\r\n\r\n[b]The Spartans keep attacking me.[/b]\r\n\r\nYep, you should have typed “sifh 1” into the consol at the start.\r\n\r\n[b]Is all the new armour craftable?[/b]\r\n\r\nOnly the Spartan armour is craftable, there should be plenty of the other armour on corpses and to be honest I\\'ll not be making it craftable, hard enough to find stuff in the menus as it is.\r\n\r\n[b]The immortals are too strong![/b]\r\n\r\nThey are meant to be, I did give them a 50% weakness to fire to help people out.\r\n\r\n[b]What does Xerxes’s armour enchantment do?[/b]\r\n\r\nIt’s the same as the imperial passive power that gives more gold from chests etc.\r\n\r\n[b]Where are the new spells?[/b]\r\n\r\nThe spell tomes for the spells can be found in blood chests.\r\n\r\n[b]Is there anything out in the water?[/b]\r\n\r\nNo, would have taken twice as long to build the mod-really no need for it. There are however some Npcs on the boats.\r\n\r\n[b]When I knock enemies into the water they just tread water?[/b]\r\n\r\nI’ve Navmeshed the coast, so there’s no reason why they shouldn’t swim back to land-they just don’t. I don’t think they even swim in vanilla Skyrim, must be a bug with the game.\r\n\r\n[b]Spartans won’t attack Persians on the cliffs?[/b]\r\n\r\nI found that Spartans were far less likely to fall into the water when I experimented with navcut collision walls. Its far better off this way than the annoyance of having Spartans fall into the water.\r\n\r\n[b]When does the area respawn?[/b]\r\n\r\nI should be the same as vanilla skyrim exteriors, so 30 days? I don’t think I can change that without changing a game setting. There are other mods that speed this time up.\r\n\r\n[b]Can I use your textures for my mod?[/b]\r\n\r\nYes, but ask me first I’d like to see where they are being used.\r\n\r\n\r\n\r\n\r\n[b][size=+3]A little help?[/size][/b]\r\n\r\nThis mod is still a bit rough in my opinion, I’ve done as much as can with this mod, without assistance. I’ve a very crude spawning system and haven’t built any new meshes for it myself, though I have tried to retexture existing things. If anyone would like to make some new armours, monsters or weapons for this mod; that would be greatly appreciated. Also if anyone knows how to script NPCs to spawn at certain times, I’d need them to help me. 8D\r\n\r\n\r\n[b][size=+3]Recommendations:[/size][/b]\r\n\r\n\r\nYou don’t need any of these mods to run mine, but I feel that they definitely add to the value of the Thermopylae mod:\r\n\r\nExtensible follower framework, Get this mod:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=12933 \r\n\r\nMore muscular men texture normal is actually really good to use with the Spartan armor.\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4145 \r\n\r\nThis should clean up dead NPCs and their weapons:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4528\r\n\r\nWarzones also has a performance pack which seems to clean up dead NPCs and their weapons.(I tend to use it)\r\n\r\nThis mod allows melee fighters to hit multiple targets:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=8324\r\n\r\nCrimson Tide for more/better blood:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=12798\r\n\r\nMultiple summons, use the spells in my mod with this to summon armies:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6093\r\n\r\n\r\n\r\n[b][size=+3]Disclaimer:[/size][/b]\r\n\r\nDo not upload this mod anywhere without specific permission from me. Do not upload this mod on Steam Workshop Ever.\r\n\r\n\r\n\r\n[b][size=+3]Thanks to:[/size][/b]\r\n\r\nDavis237834 for his Spartan shield:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=5134\r\n\r\nSolidus2845 for his Spartan armour:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2198\r\n\r\nThe Spear mesh was made by Hel Borne and ZuSkunks, the texture by Sushiyant:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=13218 \r\n\r\nI got the swords, halberd and some shields from an open resource-arcania armory. It was on the nexus but I can’t find it now.\r\n\r\nFull bald hair by Galika:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3518\r\n\r\nLurtzello for his Shout:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=1294\r\n",
  "categoryId": "30",
  "version": "2",
  "author": "vlad550077",
  "createdUnix": "1338682770",
  "updatedUnix": "1379354253",
  "containsAdultContent": false,
  "uploadedBy": "vlad550077",
  "primaryFile": null,
  "files": [
    {
      "fileId": "65545",
      "name": "Thermopylae",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "92343",
      "fileName": "Thermopylae-18104-1.7z",
      "uploadedUnix": "1338693667",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/0c6d377ac7b679ed904b93a7f6ca5799f6ca514a61b53221d332bb022d625aca/analysis/1406934073/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thermopylae-18104-1.7z?fid=65545&ttl=1535784716&ri=8192&rs=8192&setec=4597cac16e13b510633a0545434975c5"
    },
    {
      "fileId": "65672",
      "name": "Thermopylae update",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2302",
      "fileName": "Thermopylae update-18104-1-01.7z",
      "uploadedUnix": "1338738583",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/d40880e359587061c1a6c4d0788aa2f2440d36de854ed9e82aee67cf8c9eaf41/analysis/1406935504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thermopylae%20update-18104-1-01.7z?fid=65672&ttl=1535784717&ri=8192&rs=8192&setec=099929dbeb7edcd4da8bb893020815fc"
    },
    {
      "fileId": "66884",
      "name": "Thermopylae - Lite",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2301",
      "fileName": "Thermopylae - Lite-18104-1-01.7z",
      "uploadedUnix": "1339243483",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/ab1fc508b326d0cac215297bd248d8a59286c569c37a3de3de91997d80c10ffb/analysis/1406948223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thermopylae%20-%20Lite-18104-1-01.7z?fid=66884&ttl=1535784717&ri=8192&rs=8192&setec=760330e9510feb0ba22abf69eea8bbd7"
    },
    {
      "fileId": "67226",
      "name": "Cheat map of blood chest locations",
      "version": "v1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4272",
      "fileName": "Cheat map of blood chest locations-18104-v1.7z",
      "uploadedUnix": "1339369438",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/27efaa687035a6f7ee386054268062f9a255c6d9c9498a2f7aa1da73174d8051/analysis/1406951526/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cheat%20map%20of%20blood%20chest%20locations-18104-v1.7z?fid=67226&ttl=1535784718&ri=8192&rs=8192&setec=a4e4b42927df913e5c11b992918e7499"
    },
    {
      "fileId": "1000055916",
      "name": "Thermopylae version 2",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "123603",
      "fileName": "Thermopylae version 2-18104-2.7z",
      "uploadedUnix": "1379354034",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/11605b51eee89d8c38d7eec49ae69f6a1217575337568babb4a731aa07ca5f4d/analysis/1407725257/",
      "changelogHtml": " Update 2.\r<br />\r<br />Persians now die when they try to swim in water, no more fishing them out of the sea.\r<br />\r<br />Updated the Spartan armour, new meshes for open face helmet, armour, shield and boots while textures were updated.\r<br />(models made by jinkazama2k7, check his imperial armour replacer at \"http://skyrim.nexusmods.com/mods/41836/?\")\r<br />\r<br />Updated Leonidas and Stelio&#39;s faces.\r<br />\r<br />Removed fire bolt staves from the persian mystics since other npcs were using them.\r<br />\r<br />Removed fire breath from persian mystics and weakened their magic damage.\r<br />\r<br />Persian generals *should* now mount thier horses when advancing towards the Hot Gates.\r<br />\r<br />Allowed fast traveling within Thermopylae worldspace.\r<br />\r<br />Added 5 extra Spartans, non essential and all followers.\r<br />\r<br />Now all generically named Spartans are non-essential and can be a follower.\r<br />\r<br />Spartan warriors are now essential but not followers, changed since Extensible Follower Framework doesn&#39;t work on non unique NPC&#39;s anymore.\r<br />\r<br />Added some ignitable oil to the persian camp.\r<br />\r<br />Added map marker for the Dark Cave.\r<br />\r<br />Fixed a bug that prevented upgrading of the spartan spear.\r<br />\r<br />Removed two auto load doors from the beach that should never have been there.\r<br />\r<br />Immortals now do their night attack on Monday night/Tuesday morning around 2am. Since their AI didn&#39;t want to work at the time I wanted it to.\r<br />\r<br />Reduced the damage Spartans deal to persians and increased thier defence agaisnt persians, to help balance them.\r<br />\r<br />Added a Hardcore option.\r<br />\r<br />Light option:25 persians per wave\r<br />\r<br />Normal option: 50 persians per wave\r<br />\r<br />Hardcore option: 100 persians per wave (make sure you have a good pc, mine can only handle it for so long then with the amount of bodies and more NPC spawning it gets too much for mine)\r<br />\r<br /> <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thermopylae%20version%202-18104-2.7z?fid=1000055916&ttl=1535784718&ri=8192&rs=8192&setec=798d30db6bdea2d9c2bb344a2c52c4e6"
    },
    {
      "fileId": "1000055918",
      "name": "Thermopylae version 2 - Light option",
      "version": "2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2316",
      "fileName": "Thermopylae version 2 - Light option-18104-2.7z",
      "uploadedUnix": "1379354147",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/07c7ec1e1c6d3370a759760d648aa0b2ec4568e2080c403f643178496df6f6b0/analysis/1407725259/",
      "changelogHtml": " Update 2.\r<br />\r<br />Persians now die when they try to swim in water, no more fishing them out of the sea.\r<br />\r<br />Updated the Spartan armour, new meshes for open face helmet, armour, shield and boots while textures were updated.\r<br />(models made by jinkazama2k7, check his imperial armour replacer at \"http://skyrim.nexusmods.com/mods/41836/?\")\r<br />\r<br />Updated Leonidas and Stelio&#39;s faces.\r<br />\r<br />Removed fire bolt staves from the persian mystics since other npcs were using them.\r<br />\r<br />Removed fire breath from persian mystics and weakened their magic damage.\r<br />\r<br />Persian generals *should* now mount thier horses when advancing towards the Hot Gates.\r<br />\r<br />Allowed fast traveling within Thermopylae worldspace.\r<br />\r<br />Added 5 extra Spartans, non essential and all followers.\r<br />\r<br />Now all generically named Spartans are non-essential and can be a follower.\r<br />\r<br />Spartan warriors are now essential but not followers, changed since Extensible Follower Framework doesn&#39;t work on non unique NPC&#39;s anymore.\r<br />\r<br />Added some ignitable oil to the persian camp.\r<br />\r<br />Added map marker for the Dark Cave.\r<br />\r<br />Fixed a bug that prevented upgrading of the spartan spear.\r<br />\r<br />Removed two auto load doors from the beach that should never have been there.\r<br />\r<br />Immortals now do their night attack on Monday night/Tuesday morning around 2am. Since their AI didn&#39;t want to work at the time I wanted it to.\r<br />\r<br />Reduced the damage Spartans deal to persians and increased thier defence agaisnt persians, to help balance them.\r<br />\r<br />Added a Hardcore option.\r<br />\r<br />Light option:25 persians per wave\r<br />\r<br />Normal option: 50 persians per wave\r<br />\r<br />Hardcore option: 100 persians per wave (make sure you have a good pc, mine can only handle it for so long then with the amount of bodies and more NPC spawning it gets too much for mine)\r<br />\r<br /> <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thermopylae%20version%202%20-%20Light%20option-18104-2.7z?fid=1000055918&ttl=1535784719&ri=8192&rs=8192&setec=9f994c31ad7852b619594c7cb3eb1933"
    },
    {
      "fileId": "1000055920",
      "name": "Thermopylae version 2 - Hardcore option",
      "version": "2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2322",
      "fileName": "Thermopylae version 2 - Hardcore option-18104-2.7z",
      "uploadedUnix": "1379354253",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/6a6a105d866393ec0ff7e60d191bae5b25c7eeb347acead73d275fcfc51b5f99/analysis/1407725261/",
      "changelogHtml": " Update 2.\r<br />\r<br />Persians now die when they try to swim in water, no more fishing them out of the sea.\r<br />\r<br />Updated the Spartan armour, new meshes for open face helmet, armour, shield and boots while textures were updated.\r<br />(models made by jinkazama2k7, check his imperial armour replacer at \"http://skyrim.nexusmods.com/mods/41836/?\")\r<br />\r<br />Updated Leonidas and Stelio&#39;s faces.\r<br />\r<br />Removed fire bolt staves from the persian mystics since other npcs were using them.\r<br />\r<br />Removed fire breath from persian mystics and weakened their magic damage.\r<br />\r<br />Persian generals *should* now mount thier horses when advancing towards the Hot Gates.\r<br />\r<br />Allowed fast traveling within Thermopylae worldspace.\r<br />\r<br />Added 5 extra Spartans, non essential and all followers.\r<br />\r<br />Now all generically named Spartans are non-essential and can be a follower.\r<br />\r<br />Spartan warriors are now essential but not followers, changed since Extensible Follower Framework doesn&#39;t work on non unique NPC&#39;s anymore.\r<br />\r<br />Added some ignitable oil to the persian camp.\r<br />\r<br />Added map marker for the Dark Cave.\r<br />\r<br />Fixed a bug that prevented upgrading of the spartan spear.\r<br />\r<br />Removed two auto load doors from the beach that should never have been there.\r<br />\r<br />Immortals now do their night attack on Monday night/Tuesday morning around 2am. Since their AI didn&#39;t want to work at the time I wanted it to.\r<br />\r<br />Reduced the damage Spartans deal to persians and increased thier defence agaisnt persians, to help balance them.\r<br />\r<br />Added a Hardcore option.\r<br />\r<br />Light option:25 persians per wave\r<br />\r<br />Normal option: 50 persians per wave\r<br />\r<br />Hardcore option: 100 persians per wave (make sure you have a good pc, mine can only handle it for so long then with the amount of bodies and more NPC spawning it gets too much for mine)\r<br />\r<br /> <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thermopylae%20version%202%20-%20Hardcore%20option-18104-2.7z?fid=1000055920&ttl=1535784719&ri=8192&rs=8192&setec=a3145eb700bd8d50a27a0f75f3ad5bfc"
    }
  ]
}