{
  "modId": 18114.0,
  "modName": "Knights of the Nine",
  "summary": "Either become a knight that shows the merciful side of the Nine divines or else become a knight that shows that not only are the gods to be loved, but they are to be feared! Spread the light of their grace or else the darkness of their wrath",
  "descriptionHtml": "FACEBOOK!\r\nI now have a facebook page! So now you can easily get mod updates, chat to me, give me ideas, sketches, organize  mod projects or anything really. You may even on occasion get access to betas so I can get feedback before releasing final mods. This is the best place to message me as Nexus and steam workshop have limited messaging capability so on here I will always have a record of conversations:)\r\nhttps://www.facebook.com/pages/Maty743-Modder/531811283537450?ref=hl\r\n\r\nARE YOU AN EXPERIENCED MODDER WHEN IT COMES TO QUEST LINES AND USING THE CK? IF YOU WOULD LIKE TO CONTRIBUTE TO THIS MOD OR HAVE QUEST IDEAS PLEASE SEND ME A MESSAGE.\r\n\r\nEither become a knight that shows the merciful side of the Nine divines or else become a knight that shows that not only are the gods to be loved, but they are to be feared! Spread the light of their grace or else the darkness of their wrath\r\n\r\nIf you like please go to my steam workshop file and rate and favorite there too :)\r\n\r\n/////////////////////\r\n\r\nWHAT TO DO\r\n\r\nHead just north of the Tower stone which is west of Winterhold. You will need to defeat a Knights of the Nine ghost guardian to be proven worthy of using the armor and weapons. This guardian can then be summoned by the player by using the conjure book found in his ghostly remains. You can then find the armors at another location from reading the note on the ground (SPOILER: dark armor and light armors etc under water in 2 chests at Pilgrams trench)\r\nTo forge the enchanted armor you will need certain amulets for each item (please note that you need the Talos book from chest instead of Talos amulet). You will also need the steel smithing perk.)\r\n\r\n//////////////////\r\n\r\nKNOWN ERRORS (please let me know of more)\r\n\r\nDO NOT DROP HELMET ON GROUND. YOU WILL LOSE IT! It can only be placed in menus like chests manikins etc. If you do lose it dont worry just go into console (~) and type... \r\nhelp \\\"knights of the nine helmet\\\" 0 T\r\nhen numbers and letters will apear above where you typed (xxxxxx). Next type into the console... \r\nplayer.additem xxxxxx 1 \r\nnow helmet is in menu again :) \r\n\r\n////////////////\r\nDonators.\r\nA huge thank you to users that have decided to make a donation. It is really appreciated. Thanks!\r\n- FelxcolossiCXx \r\n- Tfig2110\r\n\r\n////////////////\r\n\r\nFUTURE PLANS\r\n\r\nAt this stage this is only really a content mod and lacks a storyline or quests. I plan to improve this in the future. As steam seems to have a limit of 100mb for mods any new content will most likely be in sub mods as this mod barely fitted to 100mb and I had to downsize alot of textures (these items I want to create are new shield and mace at this stage). Other projects I am working on is a sub mod for this which will be orientated around mage aspects, and horse armor. Mithril armor and my other knights mod that is similar to this.\r\n\r\n///////////////\r\n\r\nCREDITS\r\n\r\nThankyou to Zenl for letting me use his cape mesh as a base for my modified version. http://skyrim.nexusmods.com/downloads/file.php?id=11784\r\n\r\nthanks to hucifer for letting me use his 2H sword mesh and base texture http://skyrim.nexusmods.com/downloads/file.php?id=6006\r\nThanks to Lazarus89 for  1H sowrd mesh and base texture http://oblivion.nexusmods.com/mods/40660\r\n\r\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\Permissions/////////////////\r\nThe assets that I created in this mod are now able to be used as modders recourses but with a few guidelines to be followed.\r\n1. If you use some of these assets you must clearly credit in the mod description and include the link as well.\r\n2. You cannot re-release this exact mod just as it is as your own unless it is a language translation.\r\n3. You cannot release as a armor mod based on Knights of the nine armor. (As I still have plans for this in the future). You can how ever make quests for knights of the nine.\r\n4. If you use my assets then give someone else permission to use your assets you must inform them that they have to credit as well. \r\nFeel free to message me about any of these points\r\n",
  "categoryId": "54",
  "version": "2.6.1",
  "author": "Maty743",
  "createdUnix": "1338704119",
  "updatedUnix": "1340983533",
  "containsAdultContent": false,
  "uploadedBy": "maty743",
  "primaryFile": null,
  "files": [
    {
      "fileId": "65579",
      "name": "Knights of the Nine",
      "version": "2.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "57089",
      "fileName": "Knights of the Nine-18114-2-6.rar",
      "uploadedUnix": "1338704728",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/ace80c8bb0d153dfdc5a3b94196ce057e64e899ede8edcb0012df956059e2483/analysis/1406934395/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Knights%20of%20the%20Nine-18114-2-6.rar?fid=65579&ttl=1535784749&ri=8192&rs=8192&setec=15b4dca9e541fa4f5e60c13f03b5e79b"
    },
    {
      "fileId": "66763",
      "name": "Knights of the nine",
      "version": "2.6.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "122154",
      "fileName": "Knights of the nine-18114-2-6-1.zip",
      "uploadedUnix": "1339202419",
      "modVersion": "2.6.1",
      "virusScanUrl": "https://www.virustotal.com/file/752bb6f4ac4b4140b59fd58bfb95b6ae9aefd304ca06c419d8349ece8f2b30af/analysis/1406947187/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Knights%20of%20the%20nine-18114-2-6-1.zip?fid=66763&ttl=1535784749&ri=8192&rs=8192&setec=e84b1c01bc0e58ff8a7ce6a455b8b7f6"
    },
    {
      "fileId": "71043",
      "name": "New KOTN update 30 june",
      "version": "2.6.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "122154",
      "fileName": "New KOTN update 30 june-18114-2-6-1.zip",
      "uploadedUnix": "1340983533",
      "modVersion": "2.6.1",
      "virusScanUrl": "https://www.virustotal.com/file/b49b39cdbc9b9f032adfc940f80771387d7a35a255f7b31a8f427087fb1d297a/analysis/1406990510/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20KOTN%20update%2030%20june-18114-2-6-1.zip?fid=71043&ttl=1535784750&ri=8192&rs=8192&setec=3268c906e202bcb1f48e2ee655b71ca1"
    }
  ]
}