{
  "modId": 18146.0,
  "modName": "ETK The Streets Of Whiterun",
  "summary": "Makes the city more beautiful; organic; vivid and perhaps a mystic approach of WR in order to match with the mod 7K Better Whiterun - City Under Construction - BETA \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=15776\r\n\r\n",
  "descriptionHtml": "1/IF NO ONE CAN LEAVE A COMMENT WELL IT IS NOT MY FAULT, BUT NEXUS FAULT (web bug) which sucks because it only there i have posted that mod.\r\nPlease; write to me (PM) if you are experiencing problems with that mod, having suggestions, question or anything else, and I am sincerely sorry for that inconvenience\r\n2/ I have to stop modding for a while, but I plan to continue that mod later...so far did not want overkill the city by bringing too many trees and plants, but since someone asked, yes, the mod add more than 50/60 trees and a lot of plants and vegetation. (I tried to make the all to match with the flora around WR, in order to stay in the flore around the city).\r\n3/ That mod does not work for open cities mod at least for that version so far - \r\n4/ That mod had been made for the 7K Better Whiterun - City Under Construction - BETA mod for my own game, and I did not really to post it because of that. However; after 7k/theFPSmachine told me he was looking for seeing it, I decided to post it for him to see it, and eventually and eventually for the ones who could or would enjoy it too.\r\n\r\nSo, if you like or use this mod please don\\'t forget to endorse it. (I am not running after endorsements, but it\\'s still encouraging, believe it or not...)\r\n\r\n--------------------------------\r\n\r\nETK Better Whiterun V1.42 \r\n\r\nOr\r\n\r\nETK The Streets Of Whiterun for 7K Better Whiterun - City Under Construction - BETA - BY 7K -TheFPSmachine \r\n\r\n --------------------------------\r\n\r\nI first made that mod in order to merge it with the FPSmachine project. 7K Better Whiterun - City Under Construction - BETA - BY 7K -TheFPSmachine http://skyrim.nexusmods.com/downloads/file.php?id=15776 for my own game and pleasure. \r\n\r\nHowever; my mod can be used as a Standalone as well.\r\n\r\n//MOTIVATION//\r\nThis is my version of Whiterun, you like it or not, i don\\'t care (lol!) - I decided to mod Skyrim like I did with others games for my own games, and I consequently tried to bringing a lot change stuff in order to make the game the way I like - meaning beautiful -\r\n I like artistic contrasts, and I always combine or merge stuff together for getting new structures, buildings, and else and I like nature and medieval cities as well- \r\nMy inspiration came that most cities had some history behind, or have been build on the top of something else, ruins of another civilisation or else...I also wanted to bring more \\\"nature\\\" approach for that city with a difference of layout for its different district - Richer or poorer - The rich side has more terrasses, fountains and gardens, the poorer districts are more industrial (7K Mods with maket and trad).\r\nI know that Bethesda tried to give a LOTR plain of Rohan approach for Whiterun and its surrondings, but the Vanilla version ressemble too much at a hamelet with a castle in the middle, and they did not really bring a vivid city full of details and life neither. My point is that the Vanilla version of the city is a dead place to me, and it does not give me the feeling to run around or walkabout in the Streets of the city - The fault is because while playing the game and was listening that in game piece of music “the streets of Whiterun\\\", and I really had the feeling that although that piece of music is so beautiful to my ears, well, the Whirerun Vanilla version of the city is empty and the streets of whiterun give me the felling the really \\\"Whiterun away\\\" from it, which is sad. \r\nIn short, in my opinion, the all VR vanilla city looks like a draft without live and is seriously missed colors, - It makes me believe that the designers could have spend more time to give more depth to that city. WR, in my opinion, is the poorest executed city of the entire game and its looks unfinished in its final Vanilla version. It also does not give that feeling to stay around, or even visiting that city at all. In short and somewhat WR Vanilla does not really match with my expectation and with that piece of music, and it does not even honor it by its design.\r\nI used photographs of some medieval villages from France, England for my inspiration, or still used some drawing or illustrations from divers books, and I tried to make it match with the Bethesda ressources what a Celtic, Darkage city could have been looking in the 5 or 6 century AD .\r\n\r\nAlso, as I am currently using theFPSmachine WR under construction that I really like, and I am following up for his new WR updates, I consequently decided bringing  a more organic touch to the City but (I did not want to make it sounds like a wooden forest neither) in order to contrasting with his version of the city, which is a more trading and more industrial version of the WR City. As a surprise both mods (ABWR and mine) work perfectly together, they contrast but the result is interesting, so I decided to build my mod around the ABWR City under construction mod in order to play my game, and try to respect to combinaison of both mods.\r\n\r\nNote: My mod can still be used as a Standalone as well, but I strongly recommend to use it with the 7k WR under construction BETA since I made it in keeping in mind that both mods could be merged in some point or someday together. \r\n\r\nMy future plan are that people like that WR city and want to stay and visit it for its beauty, secrets, treasures and history. As soon as I have time, i shall update that mod with new stuff such as dungeons and else.\r\n\r\nINCLUDED IN THAT MOD so far:\r\n\r\nWell a ridiculous number of Stuff.\r\n\r\nNew additions such as a lot of Green/yellow, and brown colors, 50/60 additional Trees, stones, a lot of plants plants and 3 fountains. Once again everything had been done for matching with WR under construction BETA. (except for a Statue...) \r\n\r\nI kept all the Vanilla Layout for the City, and I did not move any building or else. I just did a lot of additions and make-up (a lot of make-up) in order to give a organic feeling to the city such as\r\n\r\nA new make-up for most of Vanilla RW buildings \r\nA new make-up for entrance of the city (You can go on the top of the Gate by stairs on the side of the gate) - in short I kept the same gate of the Vanilla, but used new stuff to make it look different and more effective as city gate entrance.\r\n\r\nThe same for the rest of the city:\r\n\r\n//WR Market//\r\n-A Patio/ terrace for the BannerMarre tavern. (I always wanted to put a terrace around that building anyhow.\r\n- A new make-up for the Tavern (It looks more medieval)\r\n- A make-up for the well of the plazza.\r\n- I also tried to expend the original market around the well\r\n-A fishery Stand (No NPC yet)\r\n-A funerary Stand  - just because people die in WR - (No NPC yet)\r\n-A Bakery Stand (No NPC yet) - i shall try to make a bakery building with a baker craft later, so far the building is there but no inside yet\r\n-A little green house full of engredient just (Behind the market) with a little fountain inside.\r\n-A make-up for the well in order to make that it looks like more as medieval a well should look.\r\n\r\n//SKYFORGE//\r\n\r\n-A new make-up for Skyforge (Barbarian/Warriors Style) in the middle of old castle ruin...my intention was to make it that the skyforge had been there for ages with a lot of history behind, and it had been a succession of divers blacksmiths, warriors, and mystic. \r\n\r\n//UPPER WR DISTRICTS//\r\n\r\n-A Dibella fountain (vs Talos statue for WR under constructions)\r\n-Some plantations for gardens around the houses to make that district a bit richer that the rest of the city.\r\n-A make up for WR cemetery... \r\n\r\n//UP TO DRAGONREACH//\r\n\r\n-Make up of the stairs up to the Dragon Reach castle (Kept the vanilla structure but the all stuff look Different now)\r\n-Make-up for first pool. (Added Statues and Stuff)\r\n\r\n//DRAGONREACH//\r\n\r\n-Garden and fountains around the Castle (No polished the garden on the left side of the castle yet)\r\n-Make-up for the Bridge of the castle.\r\n-Make-up for pool around the castle. (Added Fountains, boat and other stuff)\r\n-A new underwater makeup with more plants and else.\r\n\r\n+ I added a lot of other stuff including Chicken, Rabbits, birds and else in order to make the city a bit more vivid.\r\n\r\n\r\nLOAD ORDER \r\nSo far it does not really matter, but i usually load my mod BEFORE the ones of FPSmachine ( WR fortified, WhiterunREVISION,and the RRBetter WR interiors).\r\n\r\nNOTE: So far only the fountains does not match with my Dibella fountain and the Statue of Talos of WhiterunREVISION fuse together. I personally removed his statue and his scrub for my fountain for my game, but in some point I shall give an edited version without my fountain for the ones who wants to keep the statue of Talos of 7K version instead. \r\n\r\nAs the 7k WR city under construction was looking forward to see my work, I wrote some days ago to TheFPSmachine (7K) Better Whiterun - City Under Construction - BETA that if he likes my mod, he can include it on his project as a complementary or optional file - However he did not responded and is not really giving feedback on users regarding his latest WR updates - I know that he is busy with his new River hood project right now. \r\n\r\n\r\nFuture WR Updates:\r\n\r\nExpending outside the city and make a W.R. suburb around some other mods in order to make it compatible.\r\n\r\nIf i have time: Hidden Dungeons, treasures, secret and Mini quests inside the city:\r\n\r\n\r\n-COMPABILITY:\r\n\r\n-ABWR (7K, TheFPSMachine project) totally compatible except for one Statue district 3\r\n-Skyrim Sewers (I recommend that mod) totally compatible\r\n-exo WR Cave house (I recommend that mod)  totally compatible\r\n-WR outskirts  (I recommend that mod) totally compatible)\r\nAnd some other stuff such as mods that add merchants or followers, or else.\r\n\r\nCompatible also with because I run them with my mod for my game.\r\nPet of Skyrim\r\nRats\r\nBirds of Skyrim (My mod only brings VANILLA birds idles, rabbits and chicken)\r\nS.I.M (Npcs)\r\n\r\n\r\nNOT REALLY SURE OF THE RESULT:\r\n\r\nSexy WR (I do not like it for my own , but as i know it\\'s popular, i am curious to see the result, if anyone use my mod and sexy please post pictures) \r\n\r\nNOT COMPATIBLE\r\n\r\n-The Garden of Whiterun (can work together, but both have too much material and you get a big CTS after a while)\r\n-WR Green (Could work, but not sure about the layout of the trees)\r\n- Pine of WR (Work together, but it\\'s too much green, plants and trees)\r\n- Bert Breezhome (Interior can match with my mod only i believe, but not the outside, since i made up a different make up for the exterior of the breezhome - Anyway, his mod offers a lot of .esp files to pick from anyway and as his greenhouse for the Breezhome is an optional esp, so you can still use it with my exterior, only if you don\\'t use the ABWR city under construction, since the Bert Breezehome greenhouse is going to fuse with a market stand from ABWR).\r\n- IN General my mod won\\'t be compatible with other mods that bring trees or other stuff. (Like mentioned above they could match their trees + my trees and plants would be too much trees and stuff and certainly CTS after a while).\r\n\r\nFPS and performance:\r\nBecause of the ridiculous amount of stuff, it could be that some could complain of a FPS drop, however; since my super computer died, i am using a really outdated computer that can barely run Skyrim on it, and which had a terrible video card for making that mod - When i run the test with some other mods (mentioned above) inside the city, and it is not too bad - So, i do think that it could be too bad on new systems and recent computer.\r\n\r\nMODDER RESSOURCES:\r\n\r\nI wished  I have more time and made my own mesh and texture for my mod, but so far, I only used Vanilla racecourses, and I only combined them together such as display cases open for the greenhouse, some beams from the castle combined with some other stuff to make a new make up bridge or terrace and etc..., if you see something different, new building or else, and wonder where i got it or want the same for your mod, well, just open the C.K. and you can see how I combined stuff together - that require time, patience and imagination. \r\n\r\n\r\nCREDIT\r\n\r\nI seriously got my inspiration by the madbane mod the Garden of Whirerun mod for different stuff, and some layout for some trees, birds, ideas and other stuff i like in his mod, but I really liked his  his Dibella Fountain in the middle of the plaza and got tollway into it for my own mod, so kudos for him -- (In fact, such fountain or a Statue (or at least something) should have been in the original game instead of that nothing circle in the middle of the city)...Anyway; I thanks him by graving me that feeling and motivation for building my WR mod.\r\n\r\nCredits for \\\"madbane\\\" and the Gardens of WR for inspiration and some Layouts.\r\nCredits for \\\"Bert\\\" for its concept of Greenhouse (Breezehome mod). I was trying to do a fish-tank the same way for my fishery, but I gave-up and Ipreferred do a greenhouse instead like Bert did for his breezehome, maybe I shall do that fish tank later.\r\n\r\n\t",
  "categoryId": "62",
  "version": "V1.42",
  "author": "ETK",
  "createdUnix": "1338740092",
  "updatedUnix": "1339137063",
  "containsAdultContent": false,
  "uploadedBy": "etkerkin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "65681",
      "name": "ETK Whiterun for 7K WR under construction BETA ",
      "version": "v1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "229",
      "fileName": "ETK Whiterun for 7K WR under construction BETA -18146-v1.rar",
      "uploadedUnix": "1338740443",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/97dfe042a1cabe56f079e9d193530ac024e065216b429636be7c5a2ebec546f8/analysis/1406935562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ETK%20Whiterun%20for%207K%20WR%20under%20construction%20BETA%20-18146-v1.rar?fid=65681&ttl=1535784794&ri=8192&rs=8192&setec=c696483c9f0d40bfbc431084c0f63f7b"
    },
    {
      "fileId": "66024",
      "name": "ETK Better Whiterun ",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "202",
      "fileName": "ETK Better Whiterun -18146-1-1.rar",
      "uploadedUnix": "1338872213",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/8f652603ccad4ecbb2b71e4477a27ee2d556ba8c08cafaeccf6e7a70494efc3c/analysis/1406939415/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ETK%20Better%20Whiterun%20-18146-1-1.rar?fid=66024&ttl=1535784794&ri=8192&rs=8192&setec=96fc7a5f5a932adfe2486ec353c7b514"
    },
    {
      "fileId": "66447",
      "name": "ETK Better Whiterun V13",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "257",
      "fileName": "ETK Better Whiterun V13-18146-1-3.rar",
      "uploadedUnix": "1339035093",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/df9218feec2c4f1eed94460aeb74648d4e5282b83df08b088c2a5fffb71753f5/analysis/1406943843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ETK%20Better%20Whiterun%20V13-18146-1-3.rar?fid=66447&ttl=1535784795&ri=8192&rs=8192&setec=74ae281f7ba82327eb48d53f6163f69d"
    },
    {
      "fileId": "66453",
      "name": "ETK Better Whiterun V131",
      "version": "1.31",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "257",
      "fileName": "ETK Better Whiterun V131-18146-1-31.rar",
      "uploadedUnix": "1339038899",
      "modVersion": "1.31",
      "virusScanUrl": "https://www.virustotal.com/file/6a0bcc4c31916f23c3305e61ec73c3a5221620784b166f7697eb57999ba184a4/analysis/1406943964/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ETK%20Better%20Whiterun%20V131-18146-1-31.rar?fid=66453&ttl=1535784795&ri=8192&rs=8192&setec=37676b7cb8f2e94398b743a0309592fd"
    },
    {
      "fileId": "66616",
      "name": "ETK Better Whiterun V14",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "275",
      "fileName": "ETK Better Whiterun V14-18146-1-4.rar",
      "uploadedUnix": "1339119680",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/95eee8e69966483e2833a4f23b34b8e22a46ab50ff4b6d77eff48502d5e725ba/analysis/1406945601/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ETK%20Better%20Whiterun%20V14-18146-1-4.rar?fid=66616&ttl=1535784796&ri=8192&rs=8192&setec=200ad282bd7644e3c20443eab9abaec7"
    },
    {
      "fileId": "66623",
      "name": "ETK Better Whiterun V141",
      "version": "1.41",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "275",
      "fileName": "ETK Better Whiterun V141-18146-1-41.rar",
      "uploadedUnix": "1339123669",
      "modVersion": "1.41",
      "virusScanUrl": "https://www.virustotal.com/file/5ca4e708cf61b0bd9be3e8d2fb29125555886a1fae910d85ab1b4107c021292c/analysis/1406945648/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ETK%20Better%20Whiterun%20V141-18146-1-41.rar?fid=66623&ttl=1535784796&ri=8192&rs=8192&setec=26706e14ec8ec860686e165a0ff9177d"
    },
    {
      "fileId": "66637",
      "name": "ETK Better Whiterun V142",
      "version": "1.42",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "257",
      "fileName": "ETK Better Whiterun V142-18146-1-42.rar",
      "uploadedUnix": "1339137063",
      "modVersion": "1.42",
      "virusScanUrl": "https://www.virustotal.com/file/18eaaee62cb0cb61b9ecad71cac6df146460a8c562fa6015353ab8454d05d863/analysis/1406945764/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ETK%20Better%20Whiterun%20V142-18146-1-42.rar?fid=66637&ttl=1535784797&ri=8192&rs=8192&setec=cf49e46faad46ea450f0154dc6be7c7f"
    }
  ]
}