{
  "modId": 18164.0,
  "modName": "Yune the Whisper",
  "summary": "This mod adds a new NPC to Dragonreach in Whiterun. ",
  "descriptionHtml": "[b][color=limegreen][i]Remember to Endorse if you like this mod[/i][/color][/b]\r<br />\r<br />Here&#39;s a little something that&#39;s been sitting on my laptop for awhile now. This NPC was originally part of a larger mod, but I lost time to work on it so I&#39;m releasing as a separate mod.\r<br />\r<br />[b][size=4]=Description=[/size][/b]\r<br />This mod adds a new NPC to Dragonreach in Whiterun. \r<br />\r<br />Yune the Whisper is a female Altmer, a potential follower, a potential spouse, a spell vendor, and a trainer in Destruction magic. She also sells a few custom rings that protect the wearer in combat(Only in combat) at &#39;fair&#39; prices. If you check her inventory you&#39;ll find that she&#39;s wielding a very dangerous(or harmless) dagger named &#39;Snake Fang&#39;. She starts the game at level 10 regardless of the player&#39;s level, and will reach a maximum level of no more than 100. She already knows quite a few spells, mostly destruction, and has the light foot perk which prevents her from setting off pressure plates(she&#39;ll leave that part to you). In combat, she will likely cast spells rapidly because of her large magicka reserve. If you get her too early, she&#39;ll likely steal your exp.\r<br />\r<br />Yune&#39;s quite a bit shorter than most Altmer, and nicer personality wise(She&#39;ll treat like an old friend and maybe even give you random gifts). She is a ranking member of the Collage of Whinterhold so killing her will get you kicked out(temporarily). \r<br />\r<br />[b]=Known Issues=[/b]\r<br />She may be missing some simple dialogue, but her basic follower commands should be fully voiced.\r<br />\r<br />[b]=Compatibility=[/b]\r<br />This mod only adds content to the game so it should be compatible with everything.\r<br />\r<br />[b]=Installation=[/b]\r<br />Install with NMM\r<br />or\r<br />Drop the Esp and Bsa files into your skyrim dictionary.",
  "categoryId": "33",
  "version": "1.0",
  "author": "Rinobi",
  "createdUnix": "1338754982",
  "updatedUnix": "1338759942",
  "containsAdultContent": false,
  "uploadedBy": "Rinobi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "65758",
      "name": "Yune the Whisper",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Yune the Whisper-18164-1-0.rar",
      "uploadedUnix": "1338759942",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e1211160ffdb83523a1c5ccb4aadf1c528ae5b9a1aaf09266620d5fd9641c2ee/analysis/1406936223/",
      "changelogHtml": " Initial Release. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Yune%20the%20Whisper-18164-1-0.rar?fid=65758&ttl=1535784819&ri=8192&rs=8192&setec=99aad6c4e64e42a1d53707eb07025046"
    }
  ]
}