{
  "modId": 18191.0,
  "modName": "WIP Helheimr  Deeps",
  "summary": "Helheimr - Viking\\'s Frozen Inferi",
  "descriptionHtml": "BANNER: NEW VER TEMPORARY FREEZED DUE TO OTHER COMMITMENTS!\r\n\r\nChangeLog:\r\n\r\nVersion 1.3\r\n•navmesh completed \r\n•added many building\\'s interiors \r\n•this version is playable in all his lenght \r\n•found and fixed many bugs and collison problems \r\n•there wont be added more cells, this is a final version of the ambientation \r\n•added clutter in the keep\\'s cell \r\n•populated remaining cells \r\n\r\nVersion 1.2\r\n•replaced npcs causing fps drop in helgrind cell \r\n•fixed collision problems in the halls cell \r\n•fixed missing textures \r\n•new tower above the fortress itself for an higher view point with interiors too \r\n•new fortress\\' interiors populated and navmeshed \r\n\r\nVersion 1.1\r\n•added bosses & monsters \r\n•added new navmesh to fit new monsters \r\n•added stuff around \r\n•fixed some portals\\' bug \r\n•added an outer watchtower and a chasm upper entrance \r\n•fixed Helgrind entrance portla bug \r\n•fixed ladders bug adding new doors \r\n•fixed upper lighthouse entrance bug removing stalag icicles obstacles \r\n\r\nVersion 1.0\r\n•no navmash, no monsters, only ambientations \r\n\r\n\r\n ENJOY!!!!!!!!\r\n\r\n\r\nDescription:\r\nThe realm of Hel is, in Norse cosmology, one of the nine worlds where dwell the dead.\r\nIt is the abode of the dead queen of Hel and it\\'s also known as Helheimr.                                        \r\nThe Queen looks horrifying, in part by the look cadaverous, lives in the palace without any ease, and sleeps on a bed named \\\"bed of death.\\\"  \r\nHel is the lower realm and inferior of all worlds, and is described as a plain, dark and cold, windy and battered by the rains.\r\nThe people who inhabit the shadows are guilty of serious crimes (treason, murder), but also the souls of those who died without glory or disease.\r\n\r\nYou can acces this dungeon by typing \\\" coc AAAAA\\\" by console or just discover the entrance somewere in an ancient ruined Nor Dwelling House :)\r\nActually i\\'m populating this mod with common Skyrim Monster Mod\\'s monsters so to work properly you have to download  it first ( http://skyrim.nexusmods.com/downloads/file.php?id=9694 )\r\nin a near future all bosses and monsters will be replaced with unique one but i dont kknow yet if will be added a single monster esp or just added to Skyrim Monster Mod.. :D\r\n\r\n[spoiler]\r\n\r\nWHAT IS ALREADY DONE:\r\nthe ambients vary between caves, falls and catacombs and a great underworld fortress with replaced texture for a more immersive and unique features, actually the world is devided into 6 huge cells and some minor but meanwhile i\\'m workig on adding clutter i\\'m asking the community if there is anyone able to create quests and unique events to add for immersion!\r\n \r\nENCOUNTERS DESCRIPTION:\r\n\r\nBOSSES:\r\n - Hel, The Frozen Queen: her appearance is described as half-black and half-flesh coloured having a gloomy and down-cast appearance\r\n - Garmr, Hel\\'s Guardian: With the aspect of a giant evil dog with the chest marked with conspicuous spots of human blood and firmly tied to a chain;\r\n- Modgudr, Gjallarbrú\\'s Golden Bridge Guardian: she\\'s an ice giantess with unique armor (maybe ancient nord but recolored with dark and icy aspect), with skin color some kind of blue as draugr\\'s skin, but she\\'s a bit more muscolar and her traits ar some kind of sharp, hard and impassive.\r\n- Nidhoggr, Corpse Bane: is an infernal serpent who deliver ruin on dead\\'s corpse scattered on the Corpse Shore Nástrandir.\r\n \r\nCOMMON MONSTERS:\r\n- Frozen soul: restless souls that hang over the deep caves and ice labyrints in Hel \r\n- Frozen warriors: undead corpse who hang over the lost halls of hel\r\n- Frozen Skeletons: restless skeletons frozen in they\\'re decay\r\n- Frozen Presence: ghosts of men died for old age and disease can\\'t access the Valhalla and wander through the wastelands of Helheimr aimlessly \r\n- Serpent Demon: small version of Nidhoggr they hang up into the Serpent\\'s Hall throwing venom on the souls who rests there for penitence based on a rectile race quiet small but they are grouped always in large numbers\r\n- Glacial Shade: spirit of pure icy wind that goes around tormenting lost souls.\r\n\r\nFUTURE PLANS: \r\nadd unique bosses, monsters and may be a quest line throwing you in an adventure through Hel to recover your loved (may be your wife if you got merried ingame) from death\\'s embrace;\r\ni\\'m doing historic researchs for a more accurate visual atmosphere and may be add legendary viking armors and weapons!\r\nobviously i need modellers and people practice of papyrus to do that..i\\'ve not the skills to do it by myself!\r\nfinished this i\\'m planning to do the other infernal viking world of Múspellsheimr Flames world with the same proposition of the previous one \r\n\r\nSUGGESTIONS AND CRITICS ARE WELCOME, WRITE HERE OR CONTACT ME IF YOU ARE INTERESTED!\r\ncontact me even if you can do only one of those mod proposals because you are welcome anyway \r\n \r\nThis is a WIP file and is displayed only as a preview, please dont use this as a modder resource except for personal usage\r\n\r\ncredits:\r\nto dogtown1 for his huge work on Skyrim Monster Mod  for helping create (WIP) unique monsters for this mod, actually i\\'m populating this mod with common Skyrim Monster Mod\\'s monsters so to work properly you have to download  it first ( http://skyrim.nexusmods.com/downloads/file.php?id=9694 )\r\nendorse and votes are obviously welcome for both :D\r\n\r\n",
  "categoryId": "88",
  "version": "1.3",
  "author": "Mybad",
  "createdUnix": "1338804555",
  "updatedUnix": "1339774324",
  "containsAdultContent": false,
  "uploadedBy": "mybad",
  "primaryFile": null,
  "files": [
    {
      "fileId": "67978",
      "name": "Helheimr Deeps",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "420",
      "fileName": "Helheimr Deeps-18191-1-3.zip",
      "uploadedUnix": "1339698023",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/77755536b6c7c8ce36795e39ca073ea05406d80a635b4e5b2001d55cc9f58427/analysis/1406958972/",
      "changelogHtml": " added many building&#39;s interiors  <br/> \n this version is playable in all his lenght <br/> \n found and fixed many bugs and collison problems <br/> \n there wont be added more cells, this is a final version of the ambientation  <br/> \n added clutter in the keep&#39;s cell <br/> \n populated remaining cells <br/> \n navmesh completed <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Helheimr%20Deeps-18191-1-3.zip?fid=67978&ttl=1535784853&ri=8192&rs=8192&setec=6cad3a727881062b3b39754949a13421"
    },
    {
      "fileId": "68190",
      "name": "Helheimr Deeps update",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "427",
      "fileName": "Helheimr Deeps update-18191-1-3.zip",
      "uploadedUnix": "1339774324",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/90222a2563448085f5f62f432a4e149a96769b8947cbb549081d06a8587cf5f7/analysis/1406961243/",
      "changelogHtml": " added many building&#39;s interiors  <br/> \n this version is playable in all his lenght <br/> \n found and fixed many bugs and collison problems <br/> \n there wont be added more cells, this is a final version of the ambientation  <br/> \n added clutter in the keep&#39;s cell <br/> \n populated remaining cells <br/> \n navmesh completed <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Helheimr%20Deeps%20update-18191-1-3.zip?fid=68190&ttl=1535784853&ri=8192&rs=8192&setec=3ccef640e27cebfffbc45e507234ef1d"
    }
  ]
}