{
  "modId": 18218.0,
  "modName": "Hiromi Kamiko and her brother",
  "summary": "Adds a new Redguard follower to the game, which can be found in Ivarstead, the town at the base of the 7000 steps.",
  "descriptionHtml": "This follower mod adds the redguard warrior women, Hiromi Kamiko to Ivarstead, as I thought that Ivarstead needed something besides, of course, the 7000 steps which after awhile is really that exciting. It also adds her brother, but more on that in a bit. She should also be marriagble, if I did it right, and also she will not have the grey face bug that befalls many followers that are made in the Ck. She will be in the red farm dress, when she does not follow you, but wear Glass Armor when she does follow you. Also since she is redguard, she has the curved sword. She also has a Custom class and one custom spell, which I will elaborate more on in a sec. She should also auto-level with the player starting at level 5, since thats when your most likely going to be in Ivarstead for the first time, I presume.\r\n\r\nThe brother also has a custom class, wears the redguard uniform without the hat, uses a steel shield and the redguard sword.To see the perks and the custom classes, gave him and his sister please look at the pictures above.\r\n\r\nAs of right now, she will only stay in  town, but I\\'m thinking of making one day a week, she will travel the 7000 steps up to a point. Her schedule as of right now is, sleep from midnight to 8 in the inn, eat in the inn from 8-9, work at some smithing tools, which I added to Ivarstead for her to work at from 9 to 7(Of course, in terms of lore, she bought the smithing tools herself to help keep the town safe from bandits, bears, and stuff), and then she eats and talks to people in the inn from 7 to midnight.\r\n\r\nNow some back story for her and her brother. Now when she was growing up in Hammerfell, Her and her brother, Hiroki Kamiko were inseparatable, they played together, trained in one-handed combat together, and goofed off together. Then one day when they were grown up, bandits attacked there village, they both helped defend there village against the bandits, which they did win but with a price. Hiroki was killed, but before he gave up the ghost, he connected his soul to a spell tome and gave it to his sister so they could always be together. After the bandit attack Hiromi left her village and journeyed through Tamrial, eventually settling down in Ivarstead in Skyrim making weapons for the guards there or anyone willing to defend the town if it ever was attacked by bandits. Also whenever she is in danger, she will summon her brother to help her.\r\n\r\nRequired Mods:\r\nThere is None.\r\n\r\nRecommended Mods:\r\nBetter Females by Bella: http://skyrim.nexusmods.com/downloads/file.php?id=2812\r\nCalientes Female Body Mod Big Bottom Edition -CBBE-: http://skyrim.nexusmods.com/downloads/file.php?id=2666\r\nNot needed, but to get what I used in the screenshot, thats what I used. Also even though I don\\'t have a picture of it the retexture of the glass armor I used is....\r\nTribal Might Armor HD -Glass Armor Rehaul:http://skyrim.nexusmods.com/downloads/file.php?id=10235\r\n....this.\r\n\r\nMy Other Mods:\r\nCave story: http://skyrim.nexusmods.com/downloads/file.php?id=15266\r\nKatsumi Aiko: http://skyrim.nexusmods.com/downloads/file.php?id=16840\r\nKaraValentia: http://skyrim.nexusmods.com/downloads/file.php?id=15850\r\nNicoleta Cosmina: http://skyrim.nexusmods.com/downloads/file.php?id=17982\r\nNewStart: http://skyrim.nexusmods.com/downloads/file.php?id=17284\r\n\r\nIf there are any bugs in the file, please let me know in a pm or leave a comment so I can fix it.\r\n\r\nCredits:\r\nBethesda for making skyrim and the creation kit\r\nSkyrim Nexus for a place to share mods.",
  "categoryId": "66",
  "version": "1.0",
  "author": "MegamanOmega91",
  "createdUnix": "1338851824",
  "updatedUnix": "1338852276",
  "containsAdultContent": false,
  "uploadedBy": "MegamanOmega91",
  "primaryFile": null,
  "files": [
    {
      "fileId": "65980",
      "name": "Hiromi Kamiko ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "978",
      "fileName": "Hiromi Kamiko -18218-1-0.zip",
      "uploadedUnix": "1338852276",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2232b0621f9abc729c09bb4fffb171f6cf75aa9e62e2533705ca2b9beb9b3d78/analysis/1406938695/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hiromi%20Kamiko%20-18218-1-0.zip?fid=65980&ttl=1535784915&ri=8192&rs=8192&setec=7b9d7cd1c853b6a5e0f94e1d94b59677"
    }
  ]
}