{
  "modId": 18225.0,
  "modName": "Balanced atronachs and better Dead thralls now with forest atronachs",
  "summary": "Balances the elemental atronachs to all be equally leveled and powerful, while retaining uniqueness among them. Also removes the \\\"human only\\\" handicap on the dead thrall spell.\r\nNow adds a conjurable Forest Atronach (Spriggan) :D",
  "descriptionHtml": "Like conjuration, and like fire, but find the flame atronach at a severe disadvantage to the others? \r\n\r\nWorry no longer! This mod balances each atronach, but keeps them unique as well, without any single one being overly powerful. The flame atronach yields a fast speed with high stamina, the storm atronach boasts a slight speed decrease but high magic and slighlty above average health, while the frost atronach rounds it off with a slow speed, but high health. (Note: when I say atronachs, I mean atronachs and there Thrall counterparts e.g flame atronach and flame thrall both are rebalanced)Finally, the spell tomes for the 3 have been equally priced.\r\n\r\n\r\nDownload now and help end the fight against Daedra rascism today! :D (and while you\\'re at it, show those stendarr vigilaties what for) ;)\r\n\r\nAnd while I was at it updating atronach\\'s and stuff, I figured the dead thrall\\'s needed me to remove an absurd handicap; That\\'s right: The dead thrall spell now works on just about ANY creature. Yes, you can haz permanent troll bodyguards. Have fun.\r\n\r\nUPDATE: Added forest atronachs. They\\'re conjurable spriggans and come in every flavor as regular atronachs (Potent and Thrall version). With the initial purpose of this mod in mind, they are balanced with the others. They are added to leveled lists so you can find a forest atronach spell tome by just adventuring and looting, or you can buy it off of mages who sell conjuration related spells like Farengar in Dragonsreach or Phinis Gestor at the college. Also added a book to titled \\\"Atronachs of Oblivion and beyond\\\" onto Farengars desk that will give a small yet informative description of every atronach, including the forest one. Being conjuration reading material, it will also increase your conjuration skill by one level :D That is all. Now go and Kill some Vigilants of Stendarr.\r\n\r\nEXTRA UPDATE: Decided to give the Forest Atronach more spells. While I was at it, I fixed the Sanguine Rose not working while you had the elemental potency perk.\r\n\r\n\r\nWorkshop link: http://steamcommunity.com/sharedfiles/filedetails/?id=22320",
  "categoryId": "78",
  "version": "1.3",
  "author": "grasscid",
  "createdUnix": "1338861290",
  "updatedUnix": "1354421254",
  "containsAdultContent": false,
  "uploadedBy": "grasscid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "65996",
      "name": "Balanced Atronachs",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Balanced Atronachs-18225-1-1.rar",
      "uploadedUnix": "1338861502",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/92c6a35445495f5b49e9ea5362daf345898efc3423c7ef5d446158774ec93fd8/analysis/1406938984/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Balanced%20Atronachs-18225-1-1.rar?fid=65996&ttl=1535784925&ri=8192&rs=8192&setec=696170df39c1562371784d0f9e09ac78"
    },
    {
      "fileId": "102698",
      "name": "Balanced Atronachs ",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Balanced Atronachs -18225-1-5.rar",
      "uploadedUnix": "1354421254",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/5d47bb7aa08fa53b85ba44055cad588d24037ec578783faad6bedfba64eb2c82/analysis/1407288014/",
      "changelogHtml": " Reduced Forest Atronach&#39;s health to compensate for outstanding magic <br/> \n Removed Forest Atronach&#39;s healing spells; only the potent versions are able to use them now. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Balanced%20Atronachs%20-18225-1-5.rar?fid=102698&ttl=1535784926&ri=8192&rs=8192&setec=baf8f6023bf9dde86129864c26ed7d72"
    }
  ]
}