{
  "modId": 18232.0,
  "modName": "Lady Of The Lake Mercenaries",
  "summary": "Adds a secret hideout complete with npcs.",
  "descriptionHtml": "ATTENTION: I AM NOT UPDATING THIS MOD, IT WILL STAY AS IS.\r\n\r\nThis is my first mod I ever made and I would appreciate any feedback. Please report any bugs to me and I\\'ll do my best to fix them. First thing I\\'m going to do is tell you what mods are required in order for it to work properly, then give you a basic description, and finally give you a little background on each npc.\r\n\r\n\r\nRequired Mods To Have:\r\n\r\n+ ApachiiSkyHair - http://skyrim.nexusmods.com/downloads/file.php?id=10168\r\n+ Light and Heavy Armor Circlets - http://skyrim.nexusmods.com/downloads/file.php?id=4405\r\n+ Khajiit Cat Ears - Craftable headwear - http://skyrim.nexusmods.com/downloads/file.php?id=14205\r\n+ Mystic Tails - http://skyrim.nexusmods.com/downloads/file.php?id=13995\r\n+ Higher Magic - Children Character (otherwise Liza will be useless as a follower, she\\'ll still follow you without it though, but she won\\'t fight  and armor won’t show up, also a note if you have the skimpy armor mod also just a warning the armor is going to look funny on her) -  http://skyrim.nexusmods.com/downloads/file.php?id=8234\r\n+ Killer Keos Skimpy CBBE V2 Armor Set (at least the Divine Huntress file) - http://skyrim.nexusmods.com/downloads/file.php?id=3654\r\n\r\n\r\nBasic Description Of The Mod:\r\n\r\nIn the mod I\\'ve taken advantage of the lady in the lake easter egg and created something to go with it so it’s not just an interesting site. This mod includes a secret hideaway for the mercenaries of Skyrim. There is a small quest you get from the courier delivering you a letter. The letter is written by the founder of the mercenary group that inhabits the hideout. It states how find the entrance and explaining the place a bit, I\\'m  not going to say too much about what\\'s in the letter, I\\'m hoping you\\'ll read the letter for yourself. The hideout itself is pretty basic but it has a good amount of npcs and some things to interact with. The npcs include 2 vendors and 10 different mercenaries. All of the npcs except Cavia, Marcanda, and Za\\'Kazan are marriable (You might be able to force them to marry you but I don\\'t suggest it.). Every npc in this mod is marked as essential and all the followers have Light Foot Perk. I\\'ve tried to make each npc different and unique in their own way, so you wouldn’t feel like they\\'re all the same plus each one has their own backstory which is what I\\'m going to talk about next.\r\n\r\n\r\nBackstories Of The Npcs:\r\n\r\n+ Cavia (Imperial) - She is the founder of the Lady Of The Lake Mercenaries. She started it a few years ago with her childhood friend, Marcanda.  Both were mercenaries themselves until they decided to put down their blades and go through with this plan to make a mercenary group. She can be found standing at the bar inside the hideout, buying and selling your goods.\r\n+ Marcanda (Dark Elf) - She is the Co-Founder of the Lady Of The Lake Mercenaries. After listening to her childhood friend’s idea to create a mercenary group, she agreed to put down blade and help her. She can be found in the kitchen of the hideout where she\\'s always cooking for all the mercenaries.\r\n+ Liza (Breton Teenager) - This girl being one of the main reasons Cavia decided to start the group in the first place. A few years ago Liza was living as an orphan on the streets of Markarth, until Cavia and Marcanda walked by this poor girl and decided to help her. Despite her childish looks she\\'s actually pretty grown up and is perfectly capable of following you in your adventures. (She is actually in the child race but she is taller and has a more mature voice then children.)\r\n+ Dassiree (Argonian) - Dassiree came from Black Marsh awhile back, when he came to Skyrim there was a kind stranger that let him live with her.  But what he didn\\'t realize was she was a vampire who just planned on getting in good with him and then draining his body dry of his blood. When the day came that the vampire finally stuck, she left him near death but what she didn\\'t know is that he ended up having enough energy to recover. After that he became a vampire himself. He\\'s always carrying around the hatred for the vampire. He\\'s tried finding her but never succeeded. Once he realized the chase was useless he came to the hideout.\r\n+ Farash (Redgaurd) - Farash has been a mercenary ever since he could remember. After all it\\'s in his blood. He comes from a long line of mercenaries. Originally from Hammerfell, he\\'s traveled all over selling his services until he decided to settle with the other mercenaries at the Lady Of The Lake.\r\n+ Vanka (Wood Elf) - Having living in Skyrim her whole life no one knows the land better than her or at least that’s what she likes to believe.  She always enjoyed taking jobs that sent her into the forests, it always made her feel like it was where she was supposed to be. There was a short period of time in her life where she stopped selling her services and went to live in the woods. But she eventually got bored of being settled down so she decided to get back into the business. But times had changed and she heard of this new group of mercenaries building up so she set out to join.\r\n+ Za\\'kazan (Khajiit) - Za\\'kazan originally came to Skyrim as a caravan guard. Back home he was known for his thieving antics. Soon after arriving in Skyrim he grew bored of the life of a caravan guard. So he left the caravan and went on doing the one thing he knew best, being a thief. A few times he had been approached by members of the thieves guild wanting him to join, but he declined every time. Because of this the guild decided to ruin his name as a thief, this caused him to have to give it up. Shortly after giving up thieving he came to Lady Of The Lake.\r\n+ Garohk (Orc) - Once Garohk was old enough to do things for himself he decided to leave the stronghold. At first he settled down with a friendly blacksmith and began training as a smith until the blacksmith\\'s house was burned down by some bandits. Both of them luckily were unhurt but had nowhere to go, so they parted ways. Garohk started to wander around Skyrim until one day when he was stopped at an inn he got into conversation with a mercenary. This life intrigued him and he figured this new mercenary group was a good way to start this new life.\r\n+ Kriss and Sarkana (High Elves) - Kriss and Sarkana are brother/sister and twins. Since birth these two have done everything together. Both are ex-Thalmor. They left because they felt like the Thalmor were going too far with their views. They are the first two members of the mercenary group after it was formed. They still keep their old Thalmor armor because they feel more comfortable in it than any other armor for reasons unknown. Although being twins they prefer different styles of fighting, Kriss purely loves the destruction magic while Sarkana is a spellsword.\r\n+ Sinclair (half breed of Nord and Khajiit) - Sinclair\\'s mother was a nord and her father was a khajiit. She and her parents lived a very secluded life because her parents were afraid of what people would think of Sinclair. Sinclair for the most part looks like a nord. Her khajiit body parts include ears, a tail, and her teeth. Her teeth are quite unnoticeable while her ears and tail are in plain sight. Soon after becoming a woman she no longer wanted to live the secluded life and against her parents will she left. She always gets strange looks wherever she goes but she doesn’t mind, she knows she\\'s different and doesn\\'t care what others think. She actually happened by the mercenaries of Lady Of The Lake by accident. She was just looking at the landmark when Cavia appeared from the hidden door. They engaged in conversation then Cavia brought up an offer for Sinclair to join. She gladly accepted, she was tired of not really having a place to call home anymore anyways.\r\n+ Hallquist (Nord) - Hallquist is a dragonborn, more of a drunken one. Soon after finding out he was dragonborn he decided he couldn\\'t handle it so he resorted to drinking his life away. He decided to join with the Lady Of The Lake because he knew he could get all the drinks he wanted for free. After finding out what he was and seeing how much he drank, Cavia decided to name him the drunken dragonborn, and the name just stuck. (He is modeled after the dragonborn found in the game trailer, he can use unrelenting shout as well.)",
  "categoryId": "28",
  "version": "",
  "author": "gigimdv",
  "createdUnix": "1338869430",
  "updatedUnix": "1338871585",
  "containsAdultContent": false,
  "uploadedBy": "gigimdv",
  "primaryFile": null,
  "files": [
    {
      "fileId": "66019",
      "name": "Lady Of The Lake Mercenaries",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5912",
      "fileName": "Lady Of The Lake Mercenaries-18232-1.zip",
      "uploadedUnix": "1338871585",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f768f8a139b2ea38df2fc51160f203eda9016f99abe0044abb654c1386826b2c/analysis/1406939358/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lady%20Of%20The%20Lake%20Mercenaries-18232-1.zip?fid=66019&ttl=1535784941&ri=8192&rs=8192&setec=f43303edd1dff20446a8f52fea3559dc"
    }
  ]
}