{
  "modId": 18230.0,
  "modName": "A Fallen Servant - Companion Quest",
  "summary": "Companion priestess with quest. You can choose to follow the teachings of Kynareth to set her soul free or bind her soul to your own. Fully voice acted, includes a small quest with lore. ",
  "descriptionHtml": "=================================================\r<br />I have no plans to finish this mod. Please see comment section if interested in continuing.\r<br />=================================================\r<br />\r<br />I was stupid... I fell in love...\r<br />\r<br />Locked in an ancient temple, a young priestess frozen in time waits in vain for the presence of Kynareth to return. A hero (or villain) stumbles upon the forgotten holy ground and learns the story of love and betrayal, a fallen servant crying out to a deaf divine. Will he cleanse her spirit or bend her to his will? And what of the necromancer that got away from Nature&#39;s justice? He is still brooding in his prison waiting to be unleashed. Every action has a consequence, and two powerful entities are watching your every move. The webspinner smiles. Should you pull but one thread and it all would fall apart. Which path shall you choose?\r<br />\r<br />-----------------------------------------------------------------------------------\r<br />QUEST DESCRIPTION\r<br />\r<br />This starts out as a companion quest (and story) to get a follower priestess named Aella - you have multiple options, and you can even choose to not have her follow you at all. It&#39;s a quest with a start and an end, but it will feed into more quests (see release dates below) eventually involving Kynareth and the necromancer Cyphrex - and eventually (*crosses fingers*) a true faction quest, like the dark brotherhood or thieves guild. Instead of trudging through all of the trivial tasks at first, you get the backstory first and then take on a leadership role with the ability to take the faction in several directions with different purposes. If you choose to side with Kynareth you would be reinstating the Order of the Daughters, and lead as either a guy or girl, but your underlings would all be aspiring female undead hunters. Should you side with Cyphrex, you will be the second in command in his cult, more of a tactical leader than a vision leader in the other faction. You will command various necromancers and be in charge of returning the lair to its former glory. I&#39;d also like to give options with that, depending on who you are playing and your tastes - give a choice of location like: cave, fort, normal looking city - then additional choices of where you&#39;d like certain things placed. You&#39;d also get to decide how the outer world would see you - just a normal looking place to blend in with society or an obvious stronghold.\r<br />\r<br />====================================\r<br />\r<br />CURRENT FEATURES:\r<br />---------------\r<br />New worldspace\r<br />New Companion - must unlock with quest - multiple ways to unlock depending on your type of character\r<br />\r<br />[img]http://i1248.photobucket.com/albums/hh493/cynsterStar/CyphreSmall.png[/img]\r<br />\r<br />\r<br />CURRENT RELEASES\r<br />===================\r<br />Current Version\r<br />-------------------------------------------------\r<br />* Learn the backstory from Aella - Decide whether you want to free her or bind her soul to your own. Gain a potential follower either undead or a powerful priestess. \r<br />-------------------------------------------------\r<br />-----------------------------------------------\r<br />BETA Soul Sapping / Soul Pouring (Released on BETA - see my other mod files to try it out)\r<br />Necromancer revamp of the way souls are trapped - keeping the current system for enchantments but adding an additional gameplay change for necromancers to be able to do more with souls, including linking souls to avoid death, applying souls to HP, resurrecting by casting your soul into others. Also including an in-game tutorial on how to use it.\r<br />-----------------------------------------------------------------------------\r<br />\r<br />UPCOMING RELEASES\r<br />=====================\r<br />Release V2\r<br />----------------\r<br />* Encounter Cyphrex\r<br />* Be taught the true art of necromancy (soul sap/soul pour) given to the player in a quest. Cyphrex will teach you in game how to use this feature.\r<br />* I&#39;ll also be adding field notes from Aella for the full back story (I wasn&#39;t sure at first if someone would want to be stuck in a dialogue with her going over the entire story - so she kind of summarizes it)\r<br />---------------------------------------------------------------------------\r<br />Release V3 \r<br />-------------\r<br />* Kynareth agents to be added to track down the player much like hired thugs would - if you choose to complete the quest by binding her soul to yours.\r<br />* Encounter the goddess Kynareth and unlock the worldspace you find Aella in - will make it lush and green and a retreat/player home.\r<br />--------------------------------------------------------------------------\r<br />Release V4\r<br />----------------\r<br />* Factions with Cyphrex and Kynareth - Order of the Daughters and Cyphrex&#39;s cult. Lots of dialogue and story, plenty of quest content similar to thieves guild or dark brotherhood.\r<br />=======================================================\r<br />\r<br />NOTES:\r<br />Please let me know if you encounter any bugs&#33; I will work to fix them as they are found. This mod is currently in BETA stage until enough people test and give positive feedback that they did not encounter bad bugs.\r<br />========================================\r<br />\r<br />WORKING BUG FIX LIST\r<br />=====================\r<br />1. Fix the worldspace map, add collision barriers\r<br />2. Activator trigger that adds the bottle of water to your character instead of having to pick up a bottle\r<br />3. Fix the grey face\r<br />4. Add something for the &#34;wait and pray&#34; - not decided on exactly what to do yet.\r<br />5. Add much more dialogue in the quest - kind of rushed through it to get a working version (you don&#39;t know the half of it... had to restart 3 times from scratch because of a dialogue bug that kept popping up and basically ruining the quests.)\r<br />6. Fix spoken follower dialogue (wait, follow, etc.)\r<br />\r<br />HELP&#33;\r<br />=====\r<br />Q: How do I start the quest?\r<br />A: You need to go to the location I have in the screenshots to find Aella - once you talk to her, the quest starts. Depending on what you say to her, you may or may not encounter the entire quest. If you want to go through her quest and save her soul, you&#39;ll be doing some tasks for her - if you just want a quick companion, you can bind her to yourself, but they both will have consequences later on.",
  "categoryId": "35",
  "version": "V1.2",
  "author": "Cynster",
  "createdUnix": "1338867302",
  "updatedUnix": "1340247826",
  "containsAdultContent": false,
  "uploadedBy": "Cynster",
  "primaryFile": null,
  "files": [
    {
      "fileId": "66013",
      "name": "Aella",
      "version": "V1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "65511",
      "fileName": "Aella-18230-V1-0.zip",
      "uploadedUnix": "1338868147",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3b2ca31cf36bb25a28412fc9fae3efac388b7400d02292b8fd1b7d7e059a1552/analysis/1406939282/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aella-18230-V1-0.zip?fid=66013&ttl=1535784936&ri=8192&rs=8192&setec=6f0fbd93d532151c0d05fbc86f9024e6"
    },
    {
      "fileId": "66143",
      "name": "AellaPreset1",
      "version": "OV1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "308",
      "fileName": "AellaPreset1-18230.zip",
      "uploadedUnix": "1338930037",
      "modVersion": "OV1",
      "virusScanUrl": "https://www.virustotal.com/file/a5f8d13cc6ec4f2875ee3020fc2120cddebba9e5c68f53e4f440f26d37dd4812/analysis/1406940848/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AellaPreset1-18230.zip?fid=66143&ttl=1535784936&ri=8192&rs=8192&setec=1f9dce58f79769d1d340baef8f8dd6da"
    },
    {
      "fileId": "66775",
      "name": "AellaMinorRls1_2",
      "version": "V1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "60555",
      "fileName": "AellaMinorRls1_2-18230-V1-2.zip",
      "uploadedUnix": "1339207358",
      "modVersion": "V1.2",
      "virusScanUrl": "https://www.virustotal.com/file/414ac660625d9584dc448263b789db642b4a0e829b44a686a51bbe8fba65fdee/analysis/1406947276/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AellaMinorRls1_2-18230-V1-2.zip?fid=66775&ttl=1535784937&ri=8192&rs=8192&setec=4909ddf971e367b32b4df377ec68c034"
    },
    {
      "fileId": "69315",
      "name": "CompressedSoundFiles",
      "version": "V0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5293",
      "fileName": "CompressedSoundFiles-18230-V0-1.zip",
      "uploadedUnix": "1340247826",
      "modVersion": "V0.1",
      "virusScanUrl": "https://www.virustotal.com/file/846af5b32a47d56d985a3bfad30bcc299f776a7fc977aedf873fad4332e171da/analysis/1406972802/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CompressedSoundFiles-18230-V0-1.zip?fid=69315&ttl=1535784937&ri=8192&rs=8192&setec=2f8b823787fc84b7a611e39c1616dade"
    }
  ]
}