{
  "modId": 18248.0,
  "modName": "Attractive Spouses",
  "summary": "This mod changes the NPC&#39;s in the Potential Spouse Faction to a more physically pleasing appearance.",
  "descriptionHtml": "[img]http://i28.photobucket.com/albums/c226/angel235229/Cover.jpg[/img]\r<br />\r<br />[color=&#34;#00BFFF&#34;]OVERVIEW[/color]\r<br />==================================\r<br />I recently started playing a female character, and I was ready to have her marry a handsome, dashing young man. So she journeyed forth to find this lucky bachelor.  She searched and searched... And searched some more. There was no handsome young man to sweep her off of her feet. I was extremely disappointed by the lack of attractive potential husbands. They were either old, dirty, or just weird looking. Then I realized that a lot of the female potential spouses could use a little makeover too. So I created this mod to take care of that problem.\r<br />\r<br />[color=&#34;#00BFFF&#34;]WHAT THIS MOD DOES[/color]\r<br />==================================\r<br />This mod changes the appearance of all of the NPC&#39;s in the Potential Spouse faction (Excluding Argonians). While some have only received minor tweaks, others have received full makeovers. These tweaks include:\r<br />-\tFacial Reconstruction\r<br />-\tRedone Makeup and Paint\r<br />-\tVaried Height Changes (Taller men, shorter women)\r<br />-\tVaried Weight Changes\r<br />\r<br />This mod does not turn them into supermodels, however. Lore and personality was put into consideration while recreating each character. This mod does not change any of the makeup or skin textures and does not use any custom textures.\r<br />\r<br />[color=&#34;#00BFFF&#34;]RECOMMENDED MODS[/color]\r<br />==================================\r<br />These mods are not necessary to make the mod work, but I highly recommend them. The screenshots were taken using these mods, so if you want them to look exactly like they do in the images, you will need to download these mods.\r<br /> - [url=file.php?id=3563]Coverwomen[/url] (I used version 4 but I don&#39;t think it matters which)\r<br /> - [url=file.php?id=4141]Geonox High Res Face for Men[/url] (I used the smooth version)\r<br /> - [url=file.php?id=4869]CoverEyes[/url]\r<br /> - [url=file.php?id=2666]Caliente&#39;s CBBE[/url]\r<br />\r<br />[color=&#34;#00BFFF&#34;]INSTALL[/color]\r<br />==================================\r<br />Use NMM to easily install the mod, so you can safely install and uninstall it. If you&#39;d prefer to install manually, extract the Attractive Spouses.esp, mesh and texture files to your Skyrim Data folder... Easy as pie. ...Well, eating pie. Making pie is pretty hard. &gt;.&gt;\r<br />If you have custom NPC mods, you will want to reinstall them after installing this mod, and override when asked to.\r<br />When uninstalling, be sure to remove the meshes and textures that came with this mod. Otherwise, the NPC&#39;s heads will look strange.\r<br />\r<br />[color=&#34;#00BFFF&#34;]LOAD ORDER[/color]\r<br />==================================\r<br />Since most of the potential spouses are also potential followers, this mod needs to be placed under any follower mods, like [url=file.php?id=14037]UFO[/url]. If you have any custom face morph mods that effects potential spouses, such as [url=file.php?id=16000]83Willows - Jenassa[/url], you will want to place it below Attractive Spouses.\r<br />\r<br />[color=&#34;#00BFFF&#34;]KNOWN ISSUES[/color]\r<br />==================================\r<br />-\tHirelings such as Marcurio and Jenassa may reset to their default appearance if you are using mods like, Spouses can Live Everywhere. It only effects hirelings as far as I can tell, and loading Attractive Spouses after SCLE or a similar mod in the load order usually fixes this. I am not sure if this has any effect on Spouses Can Live Everywhere with those particular NPCs or not.\r<br />\r<br />-\tA neck seam may appear on some of the NPC&#39;s. It&#39;s not very noticeable, and only seems to show on very few of them. Still trying to figure out if this has something to do with the textures or the head meshes.\r<br />\r<br />",
  "categoryId": "33",
  "version": "1.0",
  "author": "Aranas23",
  "createdUnix": "1338900832",
  "updatedUnix": "1338901957",
  "containsAdultContent": false,
  "uploadedBy": "Aranas23",
  "primaryFile": null,
  "files": [
    {
      "fileId": "66073",
      "name": "Attractive Spouses",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17076",
      "fileName": "Attractive Spouses-18248-1-0.rar",
      "uploadedUnix": "1338901957",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5a712ea97b6b553caed584ee514b35e965599cd6732df36a500105e7967795f5/analysis/1406940191/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Attractive%20Spouses-18248-1-0.rar?fid=66073&ttl=1535784960&ri=8192&rs=8192&setec=489d267fb1c189027f6e66f11f4a98ea"
    }
  ]
}