{
  "modId": 18250.0,
  "modName": "SkyJubs Invisible Helmets - No Helmet Mod - Hide Helmet Mod",
  "summary": "Hides all kind of worn headdresses (english + german version). Customize yourself, which helmets you want to hide, or just choose out of three sets. Plugins for Dawnguard and Dragonborn. Compatible with all popular Mods (SkyRe, Cloaks of Skyrim etc.). In addition: Modded Armor Plugins (f.e. for \\\"Immersive Armors\\\" by Hothtrooper44)",
  "descriptionHtml": "[img]http://img854.imageshack.us/img854/8830/banner4h.jpg[/img]\r\n[color=red][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=red][size=4][b]Introduction[/b][/size][/color][/font]\r\n\r\nHi there everyone! English is not my native language, however, I hope you can understand, what I\\'m writing. In the last few months (since Oct 2012) I had a lack of time to work on the mod, but (for now) I\\'m back and try to implement all the requests I found in my comment section. \r\nLet me say that I feel honored that so many people downloaded my mod so far and obviously enjoy it - I never thought that I\\'ll get more than a couple of clicks. For the future I hope you all have much fun playing Skyrim - with my mod or without it.\r\n\r\n[color=red][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=red][size=4][b]Auto Installer: SkyJubs Invisible Helmets[/b][/size][/color][/font]\r\n\r\nSince the 10th of March, there is an auto-installer of my mod online. It\\'s now the only file in the main file section, so it\\'s easy to find ;) It should guide you, step by step, through the installation process, so everything should be self-explanatory. The auto-installer include all main mod versions and all plugins I made so far. If you don\\'t use the Nexus Mod Manager or just don\\'t want to use the auto-installer, you have to pick the old separate files, like before. \r\n\r\n[color=red][b]What does this mod do?[/color][/b]\r\nSo this mod hides the chosen helmets (hoods, hats, masks...) of Skyrim vanilla, if you wear them with your skyrim character. The whole main mod is fully compatible to all three official expansions (Dawnguard, Hearthfire, Dragonborn) and, as far as I know, popular mods of other nexus users. \r\n\\\"SkyJubs Invisible Helmets\\\" comes in many different versions, which you can easily customize with the auto-installer. The most important difference between the versions are the \\\"Aesthetic\\\" and the \\\"Vanilla\\\" mode. \r\nThe Aesthetic-Mode allows you to wear a circlet to your invisible helmet, while the Vanilla-Mode (equal to Skyrim Vanilla) don\\'t let you do this. Besides that, there are four different main mod versions, which make it possible to hide just some groups of helmets or even specific headdresses. \r\n\r\nIf I missed any helmet, just post it in the comment section and I will update the files as soon as possible. Please make sure you put down the correct in-game-name of the helmet, so I can find it quickly in the Creation Kit.  \r\n\r\n[color=red][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=red][size=4][b]Separate main mod files for version 1.5[/b][/size][/color][/font]\r\n\r\nFor an installation without the auto-installer, you have to choose between four main mods. Please use only one of them at the same time. You find them in the main mod file section. Also note, that for the separated files at this time only the version 1.5 is avaiable. \r\nThe four main mod versions are: \r\n\r\n[list]\r\n[*][b]SkyJubs_Invisible_Helmets_Eng_Main_AllHeaddress:[/b] Hides all helmets, masks, hoods, hats and crowns of Skyrim vanilla.  \r\n[*][b]SkyJubs_Invisible_Helmets_Eng_Main_OnlyHelmets:[/b] Hides only the helmets and masks of Skyrim vanilla, not the hoods, hats and crowns. \r\n[*][b]SkyJubs_Invisible_Helmets_Eng_Main_OnlyFullHelmets:[/b] Hides only those helmets of Skyrim vanilla, which covers the whole face of the character.\r\n[*][b]SkyJubs_Invisible_Helmets_Eng_Main_ModularKit:[/b] Customize by yourself, which helmets you want to hide, with 101 different ESP-Files.[/list]\r\nIf you want to hide the few helmets too, which are added with the Dawnguard and/or the Dragonborn expansion, you have to download and install the Dawnguard- and/or the Dragonborn-Plugin. If you use the Modular Kit, you don\\'t have to install my Dawnguard/Dragonborn-Plugins, because the Dawnguard- and Dragonborn-Helmets are already included in the Package as separate ESP-Files (look at the Read Me of the Modular Kit for detailed informations). \r\n\r\nFurthermore this mod don\\'t has the glitch of many former \\\"No Helmet\\\"-Mods, through which you can wear more than one helmet at a time (the \\\"vanilla falmer helmet glitch\\\" is also corrected). But, because this is all about aesthetics, in all main mod versions (except the Modular Kit) you can wear a circlet in addtion to a worn (but invisible) helmet or mask. If you don\\'t like that idea, please use the Modular Kit. There you can only wear an invisible helmet or a circlet (like it would be normally, if this mod wouldn\\'t be used). \r\nTo say it another way: All main mod versions (except the Modular Kit) of 1.5 use the \\\"Aesthetics Mode\\\", the Modular Kit itself use the \\\"Vanilla Mode\\\" (the two modes are described above, at the informations of the auto-installer). \r\n\r\n[color=red][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=red][size=4][b]Important notes[/b][/size][/color][/font]\r\n\r\nPlease read those notes carefully! They should answer most of the questions. \r\n\r\n[color=red][b]Load order:[/color][/b] Put this mod (and all of my plugins you use) at the last positions of the load order in your Nexus Mod Manager, so that it can work properly (my plugins after my main mod!). Also make sure, that you have updated Skyrim to the newest version number, before using my mod. \r\n\r\n[color=red][b]Extended compatibility:[/color][/b] I try to make the mod compatible with all popular Nexus Mods (such as SkyrimRedone, HN66s Earrings, Left Hand Rings, Cloaks Of Skyrim, Bandolier). The problem is, that all these mods use different \\\"Biped Objects\\\", so that my mod has to \\\"sneak around\\\" the objects, that the other modders choosed. For now it should be compatible with all mods named before. If someone notice, that my mod got problems with a popular mod, please let me know and I try to fix it. \r\n\r\n[color=red][b]Skyrim Redone:[/color][/b] SkyRe is popular – I know, everybody knows. But for other modders, it’s not only popular, but a problem, because it changes nearly everything of the game, so it conflicts with nearly every other mod. For my mod, there is a solution to get invisible helmets (my mod function) and the changed helmets stats (SkyRe function) – many thanks to the user LOCSTA, who found out about it. It goes like this: You have to combine [url=http://skyrim.nexusmods.com/mods/29375][b][color=white]“SkyRe ReProccer Compatibility Patches” by qotsafan[/color][/b][/url] with my mod. The load order should be the following: 1. My mod / 2. ReProccer / 3. qotsafan IA6-Patch. I didn’t test it by myself (I don’t use SkyRe), but for LOCSTA it works, so it should work for everyone else. \r\n\r\n[color=red][b]Incompatibility:[/color][/b] This mod is \\\"incompatible\\\" with every other mod, which directly influences the vanilla stats of helmets, hats, hoods or masks (not just their appearance). So what means \\\"incompatible\\\"? The \\\"...\\\" means, that it shouldn\\'t force any crashes, even if you mix them up. If you got a mod (such like \\\"SkyrimRedone\\\") that modifies the stats of the vanilla helmets, you can use it even together with my mod. If you put my mod on a load position after (!) the other mod, the helmets disappear and my mod works with full function. In this case you just have to pass on the helmet stat changes of the other mod. \r\nAlso, for some reason, this mod is incompatible with \\\"You are not the Dragonborn\\\" by frodone. \r\n\r\n[color=red][b]And the essential question: Who will lose his helmet with this mod?[/color][/b]\r\nQuick answer: Everyone in the whole game. I was asked several times in the comment section, if I can change my mod, so that only helmets worn by the player are invisble, while the NPC helmets stay visible. Unfortunately this is, as far as I know, impossible. Both, player and NPCs, use the same ARMOR-Items and in case you want to make them invisible, you have to change themselves (in specific: their biped objects). If you change them, this changes affect every character in the game, not only the player. So sorry, at this point, I can\\'t do anything about it. \r\n\r\n[color=red][b]Version history:[/color][/b]\r\n[list]\r\n[*][b]Version 1.6:[/b] With this version the mod get an auto-installer, which guides through the installation of the different mod versions\r\n[*][b]Version 1.5:[/b] Mod splitted in four main mod options now; New biped object slot; so far no bugs reported\r\n[*][b]Version 1.4:[/b] Fixed the \\\"Novice Hood\\\"-Bug (if you worn this before, the character was bald)\r\n[*][b]Version 1.3:[/b] Now compatible with \\\"Cloaks of Skyrim\\\". Split in two versions (1.3 and 1.3v) from now on, one for Vanilla and one for Dawnguard users. \r\n[*][b]Version 1.2:[/b] Some changes, that makes the mod compatible with the mod \\\"HN66s Earrings by humannature66\\\"\r\n[*][b]Version 1.1:[/b] Add some forgotten helmets to the mod. Crowns will no longer disappear, if they are treated as \\\"circlets\\\".\r\n[*][b]Version 1.0:[/b] Basic version. [/list]\r\n[color=red][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=red][size=4][b]Plugin contents: [/b][/size][/color][/font]\r\n\r\nThe plugins hide helmets from armors of other modders - or better: my plugins SHOULD do this. I got not much time to test this through. So please, try it, if you want, and report, if I have to change something. \r\nIf you use the auto-installer, the plugins are already included in this package. If you use the separated files, you have to download and install the plugin for the particular armor mod additionally to one of my main mod versions. \r\nHere is the list of those armor mods, for which I offer a no-helmet-plugin: \r\n\r\n[list]\r\n[*][url=http://skyrim.nexusmods.com/mods/16474][color=white][b]\\\"Deadly Dragons Armory\\\" by 3JIou[/b][/color][/url]\r\n[*][url=http://skyrim.nexusmods.com/mods/24941][color=white][b]\\\"Dragonbone Ebonsteel Armor\\\" by Dreogan[/b][/color][/url]\r\n[*][url=http://skyrim.nexusmods.com/mods/28287][color=white][b]\\\"Dragon Knight Armor\\\" by Hothtrooper44[/b][/color][/url]\r\n[*][url=http://skyrim.nexusmods.com/mods/19733][color=white][b]\\\"Immersive Armors\\\" by Hothtrooper44[/b][/color][/url]\r\n[*][url=http://skyrim.nexusmods.com/mods/28580][color=white][b]\\\"Inquisitor Set\\\" by Newermind43[/b][/color][/url]\r\n[*][url=http://skyrim.nexusmods.com/mods/12629][color=white][b]\\\"Male Cleric Armor\\\" by NULL9 and Syndharos[/b][/color][/url]\r\n[*][url=http://skyrim.nexusmods.com/mods/20077][color=white][b]\\\"Tribunal Robes and Masks\\\" by Zairaam and Natterforme[/b][/color][/url]\r\n[*][url=http://skyrim.nexusmods.com/mods/13486][color=white][b]\\\"Winter Is Coming - Cloaks\\\" by Nivea[/b][/color][/url][/list]\r\nI try to keep the plugins up to date, but if the other modders update their armors, I perhaps have to change my plugin. So if you notice, that one of the plugins don\\'t work properly, just leave a comment and I will fix this. \r\nThe credits for their great texture work goes to them alone! Especially Hothrooper is IMHO a freaking genius! Just install one or all of the mods named above, after that, you have to install my plugin in order to hide the helmets of the set. Move my plugin in the load order after the armor-esp\\'s of the original mods - then everything should just work fine: You got their armors, but see the head of your character, even if you wear their helmets. \r\n\r\n[color=red][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=red][size=4][b]Hideable Helmets: [/b][/size][/color][/font]\r\n\r\n[b]List of all Skyrim Vanilla helmets (In-Game-Names) which you can hide with my mod:[/b] Adept Hood, Alik\\'r Hood, Ancient Nord Helmet, Ancient Shrouded Cowl, Apprentice Hood, Archmage\\'s Robe, Blades Helmet, Chef\\'s Hat, Cowl, Daedric Helmet, Dragonplate Helmet, Dragonscale Helmet, Dwarven Helmet, Eastmarch Guard Helmet, Ebony Helmet, Elven Helmet, Elven Light Helmet, Falkreath Guard\\'s Helmet, Falmer Hemet, Fine Hat, Forsworn Headdress, Fur Helmet, Glass Helmet, Guild Master\\'s Hood, Hat, Helm of Yngol, Helmet of the Old Gods, Hevnoraak, Hide Helmet, Hjaalmarch Guard\\'s Helmet, Hooded Black Mage Robes, Hooded Black Robes, Hooded Brown Robes, Hooded Green Robes, Hooded Grey Robes, Hooded Mage Robes, Hooded Monk Robes, Hooded Necromancer Robes, Hooded Red Robes, Hooded Thalmor Robes, Imperial Helmet, Imperial Light Helmet, Imperial Officer\\'s Helmet, Iron Helmet, Jester\\'s Hat, Konahrik, Krosis, Leather Helmet, Leather Hood, Linwe\\'s Hood, Mage Hood, Markath Guard\\'s Helmet, Masque of Clavicus Vile, Morokei, Mourner\\'s Hat, Nahkriin, Nightingale Hood, Novice Hood, Orcish Helmet, Otar, Pale Guard\\'s Helmet, Penitus Oculatus Helmet, Psiijic Hood, Ragged Cap, Rahgot, Redguard Hood, Riften Guard\\'s Helmet, Scaled Helmet, Shrouded Cowl, Shrouded Cowl Maskless, Shrouded Hood, Solitude Guard\\'s Helmet, Steel Helmet, Steel Plate Helmet, Stormcloak Helmet, Stormcloak Officer Helmet, Thieves Guild Hood, Vokun, Volsung, Whiterun Guard\\'s Helmet, Winterhold Guard\\'s Helmet, Wolf Helmet, Wooden Mask, Worn Shrouded Cowl\r\n\r\n[b]List of all Dawnguard Expansion helmets (In-Game-Names) which you can hide with the Dawnguard-Plugin of this mod:[/b] Dawnguard Full Helmet, Dawnguard Helmet, Falmer Hardened Helm, Falmer Heavy Helm, Shellbug Helmet\r\n\r\n[b]List of all Dragonborn Expansion helmets (In-Game-Names) which you can hide with the Dragonborn-Plugin of this mod:[/b] Ahzidal, Ahzidal\\'s Helm of Vision, Blackguard\\'s Hood, Bonemold Helmet, Chitin Heavy Helmet, Chitin Helmet, Cultist Mask, Deathbrand Helm, Dukaan, Dunmer Outfit, Improved Bonemold Helmet, Miraak, Mirrak\\'s Robes, Morag Tong Hood, Nordic Carved Helmet, Skaal Hat, Skaal Villager\\'s Outfit, Stalhrim Helmet, Stalhrim Light Helmet, Temple Priest Hood, Visage of Mzund, Zahkriisos\r\n\r\nThe helmets which can be hided with the plugins for the other armor modders (like Hothtrooper) aren\\'t listed here separately.\r\n\r\n[color=red][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=red][size=4][b]Für alle deutschsprachigen User des Nexus: [/b][/size][/color][/font]\r\n\r\nHi, die deutschsprachige Unterstützung des Mods ist nun wieder gänzlich gewährleistet. Ihr findet alle deutschen Dateien (alle vier Main Mods sowie die beiden Erweiterungs-Plugins) unter der Rubrik \\\"Miscellaneous\\\" in der \\\"File section\\\". Ich habe diese Sonderrubrik gewählt, um alle deutschen Dateien gesondert und übersichtlich zur Verfügung stellen zu können und somit Verwechselungen mit den englischen Pendants vorzubeugen. \r\nEinen großen Dank richte ich an den User \\\"McGuffin\\\", der mir mit seinem \\\"TESVTranslator - SkyrimStringTranslator\\\" viel Zeit gespart hat und es mir vereinfachte, die englische Version in eine deutsche umzuwandeln. Ich hoffe, dass dies zu keinen Problemen führt (ich habe zuvor noch nicht mit dem Tool gearbeitet) und bitte euch deutschsprachige Nutzer meines Mods um Feedback, so dass ich sicher sein kann, dass alles einwandfrei funktioniert und es keine Übersetzungsfehler gibt. \r\n\r\n[color=red][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=red][size=4][b]My Mods on the Nexus[/b][/size][/color][/font]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/34239][color=red][b]SkyJubs Main Menu Aesthetics - Background Replacer Mod[/color][/b][/url]\r\nYou\\'re bored of the same, old, black main menu background of Skyrim? Then you perhaps want to take a look at this beauty: A classy series of overhauled pictures and wallpapers all around Skyrim in three different color moods - all implemented in particular auto-installers. And on top: A main menu randomizer, which gives you the option to get changing backgrounds every time you start the game. Easy to install, nice to look at - worth a try.  \r\n\r\n[url=http://skyrim.nexusmods.com/mods/31703][color=red][b]SkyJubs Grand Investor - Endless Investments Mod[/color][/b][/url]\r\nDid you ever wonder why you can invest only one single time in the stores all around Skyrim? Or did you notice, that the perk „Investor“ was partially bugged, so that many, many merchants of the game don’t offer you the investment dialogue sequence? \r\n„SkyJubs Grand Investor“ tries to solve all this – and add much more. \r\n\r\n[url=http://skyrim.nexusmods.com/mods/18250][color=red][b]SkyJubs Invisible Helmets – No Helmet Mod[/color][/b][/url]\r\nYou see it here ;-) Hope you like it. \r\n\r\n[color=red][size=5]________________________________________[/size][/color]\r\n\r\n[font=Book Antiqua][color=red][size=4][b]Credits: [/b][/size][/color][/font]\r\n\r\nThank you, Aemil1, alinahalo, Astor1977, asuraz, B14CKBIRD, Breesensee92, Cajete, Caridor1, chevenga, ChiaraFee, Chroniac, Claysson2, Enthalith, eSoDian, flatline23, Gabbagandalf666, GeoPiroi, GibbetFish,Goukai999, greggles466, grotte, happyfinesad, hoangsh12, Icesmith, javamonsoon2o2p, jimmydalton, Joevil, kafkaspawn, KeltuShadowfang, kevkas, Kiwarui, Koutetsu1985, lebyzantin, leeonheart, Liaen, LOCSTA, looooots, Mahlzeit88, mazzyfireball, nurmi90, panzersnapdragon1, PCGirl, Peronia, Phaileen, Plattfisch, pokerr2121, Porcelyn, Pzypro, RedeemerAZ, sansai, Shamanzs23, starfire42, stephen4567, stilly0469, Supertron, Th3Dude, thetaprime, thewonderbrah, TimeNoise, TJberzerker, vegeta0585, velaxun, VyxenRat, Wolfiefang, xpSyk, Zagnos, Zephyrna and zerydl, for all your patience, support and feedback. \r\n\r\nAlso I want to thank 3JIou, Newerwind43, Dreogan, Null9, Syndharos, Zairaam and Natterforme, for doing great texture works with their own armor mods, and McGuffin for his time-saving tool \\\"TESVTranslator - SkyrimStringTranslator\\\". \r\n\r\nSpecial thanks goes to Hothtrooper44 (for the greatest armor mod on the nexus and all the hints and explanations given to me), Nivea (for her WIC armors and for teaching me some mod skills) and Vuradic (who was the first \\\"No-Helmet-Modder\\\" on the nexus and who had linked his abondened mod to this site). \r\n\r\nHave fun\r\nJDB ",
  "categoryId": "54",
  "version": "1.6c",
  "author": "Jubeldibub",
  "createdUnix": "1338905050",
  "updatedUnix": "1365607248",
  "containsAdultContent": false,
  "uploadedBy": "Jubeldibub",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000005600",
      "name": "SkyJubs_Invisible_Helmets_Eng_Main_AllHeaddress",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "SkyJubs_Invisible_Helmets_Eng_Main-18250-1-5.rar",
      "uploadedUnix": "1359416576",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/19ac5d27935ca9e00c40168e964ef6d81ef221831494682f326516e3eb22f281/analysis/1407384666/",
      "changelogHtml": " Complete Overhaul, so far no bugs reported <br/> \n Mod splitted in four main mod options now <br/> \n New biped object slot <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Eng_Main-18250-1-5.rar?fid=1000005600&ttl=1535784965&ri=8192&rs=8192&setec=c57b6550cb58a1c5f91faca108c77f03"
    },
    {
      "fileId": "1000005606",
      "name": "SkyJubs_Invisible_Helmets_Eng_Plugin_DragonKnightArmor",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "SkyJubs_Invisible_Helmets_Eng_Plugin_DragonKnightArmor-18250-1-5.rar",
      "uploadedUnix": "1359416842",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/4532e9180335edf51c3941df3e0e30a0d867908b47ef9c623e9395f51ce2b7d2/analysis/1407384667/",
      "changelogHtml": " Complete Overhaul, so far no bugs reported <br/> \n Mod splitted in four main mod options now <br/> \n New biped object slot <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Eng_Plugin_DragonKnightArmor-18250-1-5.rar?fid=1000005606&ttl=1535784966&ri=8192&rs=8192&setec=62c4c0096c20602ae2035427b7869292"
    },
    {
      "fileId": "1000005672",
      "name": "SkyJubs_Invisible_Helmets_Eng_Main_OnlyFullHelmets",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "SkyJubs_Invisible_Helmets_Eng_Main_OnlyFullHelmets-18250-1-5.rar",
      "uploadedUnix": "1359444021",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/080efcabd713911d37f849d6098adb476aefa4e8601f53effb55ce0dba615e91/analysis/1407385212/",
      "changelogHtml": " Complete Overhaul, so far no bugs reported <br/> \n Mod splitted in four main mod options now <br/> \n New biped object slot <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Eng_Main_OnlyFullHelmets-18250-1-5.rar?fid=1000005672&ttl=1535784967&ri=8192&rs=8192&setec=9f94d757b1b4b722c5483eba4eb3aa6c"
    },
    {
      "fileId": "1000005673",
      "name": "SkyJubs_Invisible_Helmets_Eng_Main_OnlyHelmets",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "SkyJubs_Invisible_Helmets_Eng_Main_OnlyHelmets-18250-1-5.rar",
      "uploadedUnix": "1359444075",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/8e0a06d0f8f83cfab0c3e40c8f9924b473569b04f7acdd4b3a7c542693399be7/analysis/1407385382/",
      "changelogHtml": " Complete Overhaul, so far no bugs reported <br/> \n Mod splitted in four main mod options now <br/> \n New biped object slot <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Eng_Main_OnlyHelmets-18250-1-5.rar?fid=1000005673&ttl=1535784967&ri=8192&rs=8192&setec=f04f56ff9abdb5f5ea5a9641dcd2649b"
    },
    {
      "fileId": "1000005700",
      "name": "SkyJubs_Invisible_Helmets_Eng_Plugin_Dawnguard",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "SkyJubs_Invisible_Helmets_Eng_Plugin_Dawnguard-18250-1-5.rar",
      "uploadedUnix": "1359464557",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/fc7dfac172a2c682707847dfc489e335c1930b8a35fee12bdd92166f7e7bf700/analysis/1407385637/",
      "changelogHtml": " Complete Overhaul, so far no bugs reported <br/> \n Mod splitted in four main mod options now <br/> \n New biped object slot <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Eng_Plugin_Dawnguard-18250-1-5.rar?fid=1000005700&ttl=1535784968&ri=8192&rs=8192&setec=7e70d6714615d5e6353e260a0d86c15a"
    },
    {
      "fileId": "1000007329",
      "name": "SkyJubs_Invisible_Helmets_Eng_Plugin_Dragonborn",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "SkyJubs_Invisible_Helmets_Eng_Plugin_Dragonborn-18250-1-5.rar",
      "uploadedUnix": "1360095017",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/85237adcb007f82b8b451fd9e3e8172aab8ea174a8f8f080f0f97ac610c9f033/analysis/1407399122/",
      "changelogHtml": " Complete Overhaul, so far no bugs reported <br/> \n Mod splitted in four main mod options now <br/> \n New biped object slot <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Eng_Plugin_Dragonborn-18250-1-5.rar?fid=1000007329&ttl=1535784968&ri=8192&rs=8192&setec=ad6fbc7557068cfc630500a5bc5f6864"
    },
    {
      "fileId": "1000007330",
      "name": "SkyJubs_Invisible_Helmets_Eng_Main_ModularKit",
      "version": "1.5b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "567",
      "fileName": "SkyJubs_Invisible_Helmets_Eng_Main_ModularKit-18250-1-5b.rar",
      "uploadedUnix": "1360095109",
      "modVersion": "1.5b",
      "virusScanUrl": "https://www.virustotal.com/file/7dae892cab5d5a5f5a0ee474761d2a7f6d79e2e22d7dd3f78423a7170aa941fe/analysis/1407399124/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Eng_Main_ModularKit-18250-1-5b.rar?fid=1000007330&ttl=1535784969&ri=8192&rs=8192&setec=dd727f2ba58592319def5bf670485c2b"
    },
    {
      "fileId": "1000007571",
      "name": "SkyJubs_Invisible_Helmets_Ger_Main_AllHeaddress",
      "version": "1.5",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "8",
      "fileName": "SkyJubs_Invisible_Helmets_Ger_Main_AllHeaddress-18250-1-5.rar",
      "uploadedUnix": "1360168337",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/3694a4661e22744ee500e26f4b1a55cbb871b192c947fce456452c76b33d8028/analysis/1407400723/",
      "changelogHtml": " Complete Overhaul, so far no bugs reported <br/> \n Mod splitted in four main mod options now <br/> \n New biped object slot <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Ger_Main_AllHeaddress-18250-1-5.rar?fid=1000007571&ttl=1535784969&ri=8192&rs=8192&setec=62c2530322aa3107c95a4f3c5131edb1"
    },
    {
      "fileId": "1000007572",
      "name": "SkyJubs_Invisible_Helmets_Ger_Main_OnlyFullHelmets",
      "version": "1.5",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "8",
      "fileName": "SkyJubs_Invisible_Helmets_Ger_Main_OnlyFullHelmets-18250-1-5.rar",
      "uploadedUnix": "1360168366",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/4e1f791cc779f44f5442542b0a60711af7d8ea59cb6a13e34fb2a539c28f7d37/analysis/1407400863/",
      "changelogHtml": " Complete Overhaul, so far no bugs reported <br/> \n Mod splitted in four main mod options now <br/> \n New biped object slot <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Ger_Main_OnlyFullHelmets-18250-1-5.rar?fid=1000007572&ttl=1535784970&ri=8192&rs=8192&setec=fa23aad584787dcf1896205f551b07d9"
    },
    {
      "fileId": "1000007573",
      "name": "SkyJubs_Invisible_Helmets_Ger_Main_OnlyHelmets",
      "version": "1.5",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "8",
      "fileName": "SkyJubs_Invisible_Helmets_Ger_Main_OnlyHelmets-18250-1-5.rar",
      "uploadedUnix": "1360168386",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/5289adb55506fafba3c148a384ba561921b388e0142a56ade7c47a63ac98b91f/analysis/1407400863/",
      "changelogHtml": " Complete Overhaul, so far no bugs reported <br/> \n Mod splitted in four main mod options now <br/> \n New biped object slot <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Ger_Main_OnlyHelmets-18250-1-5.rar?fid=1000007573&ttl=1535784970&ri=8192&rs=8192&setec=7bd1316fa921dbd31f1e84c27996de72"
    },
    {
      "fileId": "1000007574",
      "name": "SkyJubs_Invisible_Helmets_Ger_Main_ModularKit",
      "version": "1.5b",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "593",
      "fileName": "SkyJubs_Invisible_Helmets_Ger_Main_ModularKit-18250-1-5b.rar",
      "uploadedUnix": "1360168413",
      "modVersion": "1.5b",
      "virusScanUrl": "https://www.virustotal.com/file/f727770b5e1e686e5a8eab15e67270424506479371303ec51185ef024286fc75/analysis/1407400866/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Ger_Main_ModularKit-18250-1-5b.rar?fid=1000007574&ttl=1535784971&ri=8192&rs=8192&setec=0cd26d17ec5075b047a46a373979d612"
    },
    {
      "fileId": "1000007575",
      "name": "SkyJubs_Invisible_Helmets_Ger_Plugin_Dawnguard",
      "version": "1.5",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1",
      "fileName": "SkyJubs_Invisible_Helmets_Ger_Plugin_Dawnguard-18250-1-5.rar",
      "uploadedUnix": "1360168444",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/d51220d7bc43e77597059cfe4610685b5cc1f4ea5fb8ffe2ab0c182d8e90ab22/analysis/1407400867/",
      "changelogHtml": " Complete Overhaul, so far no bugs reported <br/> \n Mod splitted in four main mod options now <br/> \n New biped object slot <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Ger_Plugin_Dawnguard-18250-1-5.rar?fid=1000007575&ttl=1535784971&ri=8192&rs=8192&setec=7a621421f0a1140e45652da7794982c9"
    },
    {
      "fileId": "1000007576",
      "name": "SkyJubs_Invisible_Helmets_Ger_Plugin_Dragonborn",
      "version": "1.5",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "4",
      "fileName": "SkyJubs_Invisible_Helmets_Ger_Plugin_Dragonborn-18250-1-5.rar",
      "uploadedUnix": "1360168463",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/e448a53bc683ede94941f4b1a7d2ae8b12b43a124a3416d94443a9daafa4f6da/analysis/1407400868/",
      "changelogHtml": " Complete Overhaul, so far no bugs reported <br/> \n Mod splitted in four main mod options now <br/> \n New biped object slot <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Ger_Plugin_Dragonborn-18250-1-5.rar?fid=1000007576&ttl=1535784972&ri=8192&rs=8192&setec=aa0820048a75f3cb98346bede606b1c4"
    },
    {
      "fileId": "1000008740",
      "name": "SkyJubs_Invisible_Helmets_Eng_Plugin_ImmersiveArmors",
      "version": "1.5a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35",
      "fileName": "SkyJubs_Invisible_Helmets_Eng_Plugin_ImmersiveArmors-18250-1-5a.rar",
      "uploadedUnix": "1360517593",
      "modVersion": "1.5a",
      "virusScanUrl": "https://www.virustotal.com/file/c155f549a3859a7de077cf396fd86dff8effc38399236a406e125edcea5ed9d1/analysis/1407409751/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Eng_Plugin_ImmersiveArmors-18250-1-5a.rar?fid=1000008740&ttl=1535784972&ri=8192&rs=8192&setec=dbdbb4ce44b169f7a00d365594f9416e"
    },
    {
      "fileId": "1000008766",
      "name": "SkyJubs_Invisible_Helmets_Ger_Plugin_ImmersiveArmors",
      "version": "1.5",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "33",
      "fileName": "SkyJubs_Invisible_Helmets_Ger_Plugin_ImmersiveArmors-18250-1-5.rar",
      "uploadedUnix": "1360521423",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/a57459664addc20cb10d0766eefd3e727a929b6bf8b08282c67ed590853d2213/analysis/1407409868/",
      "changelogHtml": " Complete Overhaul, so far no bugs reported <br/> \n Mod splitted in four main mod options now <br/> \n New biped object slot <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Ger_Plugin_ImmersiveArmors-18250-1-5.rar?fid=1000008766&ttl=1535784973&ri=8192&rs=8192&setec=0dddc96112cf05b22f0810d9f301e51f"
    },
    {
      "fileId": "1000010602",
      "name": "SkyJubs_Invisible_Helmets_Eng_Plugin_InquisitionSet",
      "version": "1.5a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "SkyJubs_Invisible_Helmets_Eng_Plugin_InquisitionSet-18250-1-5a.rar",
      "uploadedUnix": "1361116180",
      "modVersion": "1.5a",
      "virusScanUrl": "https://www.virustotal.com/file/13763a09f4d15b3918d00cd81d83a159f794c470e50893dc63afd96e28c0e1be/analysis/1407422643/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Eng_Plugin_InquisitionSet-18250-1-5a.rar?fid=1000010602&ttl=1535784973&ri=8192&rs=8192&setec=328c49030990f4692d59e96993de5571"
    },
    {
      "fileId": "1000010603",
      "name": "SkyJubs_Invisible_Helmets_Eng_Plugin_DragonboneEbonsteel",
      "version": "1.5a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "SkyJubs_Invisible_Helmets_Eng_Plugin_DragonboneEbonsteel-18250-1-5a.rar",
      "uploadedUnix": "1361116281",
      "modVersion": "1.5a",
      "virusScanUrl": "https://www.virustotal.com/file/0af2fe0e2b26a9bc030428beb6a37c5fec75e6f15ca6dae22cfa455e28dca0c6/analysis/1407422643/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Eng_Plugin_DragonboneEbonsteel-18250-1-5a.rar?fid=1000010603&ttl=1535784974&ri=8192&rs=8192&setec=ec1758d81d2e3aa470baeee25fb79f9b"
    },
    {
      "fileId": "1000010605",
      "name": "SkyJubs_Invisible_Helmets_Eng_Plugin_WinterIsComing",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9",
      "fileName": "SkyJubs_Invisible_Helmets_Eng_Plugin_WinterIsComing-18250-1-5.rar",
      "uploadedUnix": "1361116337",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/925707966dcbaf33ce33839c12275037a9c50b05984e9023c2f0a5f63436ce2f/analysis/1407422649/",
      "changelogHtml": " Complete Overhaul, so far no bugs reported <br/> \n Mod splitted in four main mod options now <br/> \n New biped object slot <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Eng_Plugin_WinterIsComing-18250-1-5.rar?fid=1000010605&ttl=1535784974&ri=8192&rs=8192&setec=b100979cbab5628cc2d7e5f1a4d588e8"
    },
    {
      "fileId": "1000011530",
      "name": "SkyJubs_Invisible_Helmets_Eng_Plugin_MaleClericArmor",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "SkyJubs_Invisible_Helmets_Eng_Plugin_MaleClericArmor-18250-1-5.rar",
      "uploadedUnix": "1361381775",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/fbabf15d06ab433ea13b11cdc852ba83412c14098055aa11a15e2e2e325e50d8/analysis/1407429174/",
      "changelogHtml": " Complete Overhaul, so far no bugs reported <br/> \n Mod splitted in four main mod options now <br/> \n New biped object slot <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Eng_Plugin_MaleClericArmor-18250-1-5.rar?fid=1000011530&ttl=1535784974&ri=8192&rs=8192&setec=6af9dd9f2569557e545558129a6d0cbe"
    },
    {
      "fileId": "1000017920",
      "name": "SkyJubs_Invisible_Helmets_Eng_AutoInstaller",
      "version": "1.6b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7494",
      "fileName": "SkyJubs_Invisible_Helmets_Eng_AutoInstaller-18250-1-6b.rar",
      "uploadedUnix": "1363429143",
      "modVersion": "1.6b",
      "virusScanUrl": "https://www.virustotal.com/file/d969b1817299d0aa7b28d4a5b84ec2a40d9f8353662e5e55c1fae5dbfb8fe6ad/analysis/1407472448/",
      "changelogHtml": " Bug-Fix: The Masque of Clavicus Vile is now implemented in the Modular Kit Version of the Installer <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Eng_AutoInstaller-18250-1-6b.rar?fid=1000017920&ttl=1535784975&ri=8192&rs=8192&setec=882c3bf61b2166e02c8561406988863a"
    },
    {
      "fileId": "1000023601",
      "name": "SkyJubs_Invisible_Helmets_Eng_AutoInstaller",
      "version": "1.6c",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7497",
      "fileName": "SkyJubs_Invisible_Helmets_Eng_AutoInstaller-18250-1-6c.rar",
      "uploadedUnix": "1365607248",
      "modVersion": "1.6c",
      "virusScanUrl": "https://www.virustotal.com/file/202b1b4796585f40d21f7f113c7518ee0bb8816fa8916f90498420458eaeae55/analysis/1407515537/",
      "changelogHtml": " Bug-Fix: The \"Masque of Clavicus Vile\" is now implemented in all versions included in the installer <br/> \n Modded armor support: The installer now supports the mod \"Tribunal Robes and Masks by Zairaam and Natterforme\" <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyJubs_Invisible_Helmets_Eng_AutoInstaller-18250-1-6c.rar?fid=1000023601&ttl=1535784975&ri=8192&rs=8192&setec=68d8890ef96de130fecc4cad68b180c8"
    }
  ]
}