{
  "modId": 18254.0,
  "modName": "Sleeping - Fast Travel - and Waiting Dangers - Trad Italiana",
  "summary": "This is only a translation into Italian of the original mod.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/downloads/file.php?id=12452]original mod[/url].\r\nThe original mod adds possible combat encounters while Sleeping, Waiting, and while either Fast Traveling or using a Public Carriage (non scenic). An in-game utility in the form of \\\"The Sandman\\\" is provided to allow the player to set his own odds.\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size]\r\n\r\n[color=red][b]ATTENZIONE![/b]\r\nQuesta è solo la traduzione italiana del mod originale che trovate [url=http://skyrim.nexusmods.com/downloads/file.php?id=12452]qui[/url].[/color][/center]\r\n\r\n[center][color=GREEN][size=+4]UNA TRADUZIONE DRAGONBORN ITALIA[/size][/color][/center]\r\n\r\n[color=green][b]DESCRIZIONE[/b][/color]\r\nDormire è una pratica senza senso? Ora non più! Da un momento all\\'altro potrete essere svegliati da un\\'incredibile varietà di malintenzionati! Lo stesso vale per i viaggi veloci. Inoltre è possibile modificare tutte le impostazioni grazie ad un incantesimo.\r\n\r\n[color=green][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n[color=green][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!\r\n",
  "categoryId": "78",
  "version": "2.5",
  "author": "klop",
  "createdUnix": "1338909722",
  "updatedUnix": "1338909722",
  "containsAdultContent": false,
  "uploadedBy": "klopklop",
  "primaryFile": null,
  "files": []
}