{
  "modId": 18258.0,
  "modName": "Professions",
  "summary": "Performing the duties of your chosen profession gives you a bonus to Health, Magicka and Stamina. You will feel guilty neglecting your responsibilities resulting in penalties.",
  "descriptionHtml": "[center][size=9][color=#ff9900]Professions[/color][/size][/center] \r<br />\r<br />[b]Version:[/b] 0.801 \r<br />[b]Date:[/b] 10 March 2014 \r<br />[b]Author:[/b] kuertee \r<br />[b]Source:[/b] [url=http://skyrim.nexusmods.com/mods/18258]http://skyrim.nexusmods.com/mods/18258[/url] \r<br />\r<br />[b]Requirements:[/b] \r<br />[list] [*]Skyrim 1.9[/*] \r<br />[*]Skyrim Script Extender [url=http://skse.silverlock.org/]http://skse.silverlock.org/[/url][/*] \r<br />[/list] \r<br />[b]Options:[/b] \r<br />[list] [*]Activities affects your exhaustion, hunger and thirst in Eat and Sleep [url=http://skyrim.nexusmods.com/mods/13246]http://skyrim.nexusmods.com/mods/13246[/url].[/*]\r<br />[/list]\r<br /> \r<br />[url=http://www.skyrimgems.com][img]http://i.imgur.com/yhzxU.png[/img][/url]  \r<br /> \r<br />\r<br />Note that a copy of this document exists in the SkyrimDataDocs folder.\r<br />\r<br />[center][size=7][color=#ff9900]Short description[/color][/size][/center] \r<br />\r<br />Performing the duties of your chosen profession gives you a bonus to Health, Magicka and Stamina. You will feel guilty neglecting your responsibilities resulting in penalties. \r<br />\r<br />[center][size=7][color=#ff9900]Updates since last release (0.706)[/color][/size][/center] \r<br />\r<br />[list] [size=5][color=#ff9900]0.801, 10 March 2014:[/color][/size][*]Bug fix: userShowMessages now affect the Explorer and Adventurer bonus messages.[/*]\r<br />[*]Tweak: You can view the descriptions of the different professions without being forced to change your current profession.[/*]\r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Updating[/color][/size][/center] \r<br />\r<br />[list=1] \r<br />\r<br />[*]Simply deactivate and uninstall the previous version then install and activate this version. Note that you do not need to stop the mod in-game. If you do, you will lose your accumulated mod-specific data. Let the new version back-up the data of its old version, clean-up the old data (i.e. zero-out) by stopping itself, restart itself and restore the data of the old version.[/*] \r<br />\r<br />[*]If you have Sky UI&#39;s MCM, you can check the settings in Sky UI&#39;s MCM wihtin the game.[/*] \r<br />\r<br />[*]Or check the settings in &#34;DataInikuerteeProfessions.ini&#34;. If you change any of it, execute your changes by typing {bat &#34;inikuerteeProfessions.ini&#34;} (without the brackets) in the console.[/*] \r<br />\r<br />[*]After the update is finished, the message &#34;kuP v0.706&#34; will appear.[/*] \r<br />\r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Gameplay changes[/color][/size][/center] \r<br />\r<br />Performing the duties of your chosen profession gives you a bonus to Health, Magicka and Stamina. You will feel guilty neglecting your responsibilities which results in penalties. \r<br />\r<br />Eight hours of work results in peace of mind for seven days. The more days you have, the better the bonus. With seven days, the bonus is +25 to Health, Magicka and Stamina. With one day, the bonus is +4. This bonus decreases every day. Ignore these duties and the bonuses will turn into penalties. There is a -4 penalty in the first day of penalty. At seven days, there is a -25 penalty. You cannot have more than 7 days of bonuses or less than 7 days of penalties. \r<br />\r<br />[size=5][color=#ff9900]Profession Bonus[/color][/size] \r<br />\r<br />You can be one of nine professions. Each profession has several activites. Doing any of these activities increases your peace of mind. This peace of mind is &#34;Profession Bonus&#34;. Profession Bonus are measured in hours. For every 8 hours spent doing a job results in 160 hours (i.e. the rest of the week, i.e. (7 days * 24 hours) - 8 hours = 160 hours) of Profession Points. Note that you are free to do any job for any profession. But doing a job of your chosen profession results in better Profession Bonus for less time. \r<br />\r<br />[size=5][color=#ff9900]Profession Points[/color][/size] \r<br />\r<br />You can change your profession if you do the job of another enough times. But you lose efficiency and interest in your profession as you gain efficiency and interest in another. You will notice this because the amount of Profession Bonus you accumulate while performing a job will change. For every job you perform, a message will be displayed notifying you of the amount of Profession Bonus you gained for the amount of time lost. Note that changing into another profession will take quite a while. You have to truly ignore the activities of the profession you are trying to leave and make an effort of performing the activities of the profession you are trying to enter. \r<br />\r<br />[size=5][color=#ff9900]Example[/color][/size] \r<br />\r<br />As a hunter, when you loot an animal&#39;s hide, you will lose 1 hour of time but gain 20 hours of Profession Points. When you tan that hide into leather, you will lose 1 hour of time but gain another 20 hours of Profession Points. Because bartering is a job for the merchant profession, when you sell that hide, you lose 5 minutes bartering but gain some Profession Points for it. Additionally, you will gain a small amount of bartering proficiency. However, as you increase in bartering skills, you lose some hunting skills. \r<br />\r<br />[size=5][color=#ff9900]Professions[/color][/size] \r<br />\r<br />These are the professions, the activites associated with them, and the amount of time each job takes. Note that you do not need to perform the activities in one block of time. Every time you perform any of these activities will result in a Profession Bonus. \r<br />\r<br />[img]https://sites.google.com/site/kuertee/professions-activities-time-lost.jpg[/img]\r<br />\r<br />Skill bonuses and penalties (from enchantments like Blacksmith&#39;s potion or from damage like Head injuries from my Battle fatigue and injuries mod) affect the time penalties and Profession bonuses. Skill bonuses decrease the time penalties and penalties increase them. Skill bonuses increase the Profession bonus and penalties decrease the Profession bonus. Listed below are the skills used for each activity: \r<br />\r<br />[img]https://sites.google.com/site/kuertee/professions-skills-adjusts-time-penalty.JPG[/img]\r<br />\r<br />[size=5][color=#ff9900]Example[/color][/size] \r<br />\r<br />As an alchemist, I need to mix 16 potions (8 hours of work) to get 7 days of Profession Bonus. \r<br />\r<br />As a weaponsmith, I get 7 days of Profession Bonus for creating 6 weapons and improving 4 of them. \r<br />\r<br />[size=5][color=#ff9900]Adventurer and explorer professions[/color][/size] \r<br />\r<br />Additionally, because you are essentially an adventurer, you have an inherent need to explore and quest. Adventurer and Explorer are passive professions. Discovering new locations adds 3 hours to your Profession Points. And completing quests adds 6 hours. \r<br />\r<br />[size=5][color=#ff9900]Jack of all trades[/color][/size]\r<br />\r<br />By default, you are a jack of all trades and the profession that generates Profession Bonus most efficiently (i.e. your Profession) will change over time. However, as a penalty to being a master of none, you never gain the same efficiency as when you are specialised. Internally, you can have up to 10 points of activity in a Profession. By being a jack of all trades, you can never have more than 7.5 in any Profession.\r<br />\r<br />Set userJackOfAllTrades to False with the MCM, in the console or with the INI to play as a specialist.\r<br />\r<br />[size=5][color=#ff9900]Specialist[/color][/size]\r<br />\r<br />Your specialised profession will never change. However, as a penalty to being a specialist, activities of other professions will never surpass the efficiency of activities in your speciality. By being a specialist, you can accumulate up to 10 points of activity in your Profession. However, the other professions are capped at 7.5.\r<br />\r<br />[size=5][color=#ff9900]Clothing bonus[/color][/size]\r<br />\r<br />Activities can take up to 25% less time and generate up to 25% more Profession Bonus when the appropriate clothing is worn while performing an activity.\r<br />\r<br />Alchemists and Enchanters\r<br />any enchanted robes, any enchanted light headwear or no headwear, any enchanted light gauntlets or gloves, and any enchanted boots.\r<br />\r<br />Armourer and Weaponsmiths\r<br />blacksmith&#39;s clothes*, appropriate headwear* or no headwear, any light gauntlets, and any light boots.\r<br />*Blacksmith&#39;s clothes and headwear have the word &#34;smith&#34; in their name or &#34;ModelPath&#34;.\r<br />\r<br />Cooks\r<br />appropriate clothes, appropriate headwear* or no headwear, no handwear and any shoes.\r<br />*Cook&#39;s clothes and headwear have the word &#34;cook&#34;, &#34;chef&#34;, &#34;bar&#34; or &#34;wench&#34; in their name or &#34;ModelPath&#34;.\r<br />\r<br />Hunters\r<br />fur, hide or leather armour but not scaled or studded armour, appropriate headwear* or no headwear, any light gauntlets and any light boots.\r<br />*If userHuntersClothingBonusIsArmour is True, hunters&#39; clothes have the word &#34;bandit&#34;, &#34;fur&#34;, &#34;hide&#34;, &#34;leather&#34; in their name or &#34;ModelPath&#34;.\r<br />*If userHuntersClothingBonusIsArmour is False, Cook&#39;s clothes and headwear have the word &#34;cook&#34;, &#34;chef&#34;, &#34;bar&#34; or &#34;wench&#34; in their name or &#34;ModelPath&#34;.\r<br />\r<br />Lumberjacks\r<br />appropriate clothes*, no headwear, any light gauntlets and any light boots.\r<br />*Lumberjacks&#39; clothes have the word &#34;farm&#34; in their name or &#34;ModelPath&#34;\r<br />\r<br />Merchants\r<br />fine clothes*, no headwear, any gloves or no handwear, and any shoes.\r<br />*Merchant&#39;s clothes have the word &#34;fine&#34; or &#34;merchant&#34; in their name or &#34;ModelPath&#34;.\r<br />\r<br />Miners\r<br />miner&#39;s clothes*, appropriate headwear or no headwear, any light gauntlets and any light boots.\r<br />*Miner&#39;s clothes and headwear have the word &#34;miner&#34; in their name or &#34;ModelPath&#34;.\r<br />\r<br />Scholars\r<br />no armour, no headwear, any gloves and any shoes.\r<br />\r<br />[size=5][color=#ff9900]Eat and sleep mod synergy[/color][/size] \r<br />\r<br />Exhaustion, hunger and thirst from Eat and Sleep [url=http://skyrim.nexusmods.com/downloads/file.php?id=13246] http://skyrim.nexusmods.com/downloads/file.php?id=13246[/url], are affected by the activities. \r<br />\r<br />[center][size=7][color=#ff9900]Details[/color][/size][/center] \r<br />\r<br />Doing any of the activities is a time-sink. You will lose that time in the game. But in exchange is a handy bonus and peace of mind while adventuring. \r<br />\r<br />You can change to a different profession immediately by typing {setpqv kuPQ chooseProfessionNow True} without the brackets in the console. \r<br />\r<br />You can also list the activity points of all professions by typing {setpqc kuPQ showProfessionsNow True}.\r<br />\r<br />You can configure this mod with SkyUI&#39;s MCM or in the Console by typing &#34;SetPQV kuPQ {mod data} {value}&#34;.Below are the various mod data that you can change, their default values and a short description of their effects. \r<br />\r<br />[list] [*]You can change the amount of time a job takes.[/*] \r<br />[*]You can remove the job&#39;s in-game time penalty. The time will still be used for calculating the amount of the bonus but it will not be removed from your game any more.[/*] \r<br />[*]You can remove the bonus from the mod, if you wish. Profession Bonus will not be applied but the amount of the Profession Bonus (It&#39;s in hours, remember?) will still be used to stave of the penalties. Do 8 hours of work and you will be free from penalties for the rest of the week.[/*] \r<br />[*]You can remove the penalties from the mod. So you never get the penalties. You can ignore your responsibilities as long as you wish. Doing them will still give you the bonus.[/*] \r<br />[/list] \r<br />\r<br />The configuration options are in DataInikuerteeProfessions.ini. Change any of the settings in this file. Then execute this batch file by typing {bat &#34;inikuerteeProfessions.ini&#34;} without the brackets in the console. You only need to do this once at every change. The changes will be saves in your game. \r<br />\r<br />The default crafting times are: \r<br />\r<br />[list]\r<br />[*]Mixing potions: 0.5 hours[/*]\r<br />[*]Cooking: 1 hour[/*]\r<br />[*]Armour and weapon crafting: 1 hour[/*]\r<br />[*]Armour and weapon improvement: 0.5 hours[/*]\r<br />[*]Enchanting and disenchanting: 1 hour[/*]\r<br />[*]Tanning: 1 hour[/*]\r<br />[*]Skinning: 1 hour[/*]\r<br />[*]Leather stripping: 0.25 hours[/*]\r<br />[*]Mining: 0.25 hours[/*]\r<br />[*]Smelting: 1 hour per ingot[/*]\r<br />[*]Woodchopping: 0.25 hour[/*]\r<br />[*]Using the sawmill: 0.25 hours to put the log in place and 0.25 to cut it[/*]\r<br />[*]Learning a spell/reading a skill book: 1 hour[/*]\r<br />[*]Reading: seconds spent reading * userTimeScaleReading (default 20)\r<br />Every 1 minute in real-time spent reading is converted to 20 minutes in-game time.Note that you need to spend more than userSecondsRequiredForReading (default 30 seconds) reading for the activity to produce Profession Bonus.[/*][*]Learning from a trainer: 1 hour[/*]\r<br />[*]Harvesting: 0.25 hours[/*]\r<br />[/list]\r<br />\r<br />An INI called kuerteeProfessionsHighCraftingTimes.ini is provided that sets crafting activites to take up more time. Execute the INI by typing {bat &#34;inikuerteeProfessionsHighCraftingTimes.ini&#34;} (without the brackets) in the console to get these times:\r<br />\r<br />[list]\r<br />[*]Mixing potions: 1 hour[/*]\r<br />[*]Cooking: 1 hour (unchanged from default)[/*]\r<br />[*]Armour and weapon crafting: 8 hours[/*]\r<br />[*]Armour and weapon improvement: 4 hours[/*]\r<br />[*]Enchanting and disenchanting: 4 hours[/*]\r<br />[*]Tanning: 4 hours[/*]\r<br />[*]Skinning: 8 hours[/*]\r<br />[*]Leather stripping: 0.25 hours (unchanged)[/*]\r<br />[*]Mining: 0.25 hours (unchanged)[/*]\r<br />[*]Smelting: 1 hour per ingot (unchanged)[/*]\r<br />[*]Woodchopping: 0.25 hour (unchanged)[/*]\r<br />[*]Using the sawmill: 0.25 hours to put the log in place and 0.25 to cut it (unchanged)[/*]\r<br />[*]Learning a spell/reading a skill book: 4 hours[/*]\r<br />[*]Learning from a trainer: 8 hours[/*]\r<br />[*]Harvesting: 0.25 hours[/*]\r<br />[/list]\r<br />\r<br />A configuration file (datainikuerteeProfessions.ini) is provided with the relevant console commands. If you want to change any of the default values above, change them in the INI file then run the file by typing {bat &#34;inikuerteeProfessions.ini&#34;} (without the brackets) in the console. You only need to do this when you want to change the values of the property. Your changes will be saved in your game. \r<br />\r<br />[center][size=7][color=#ff9900]Install[/color][/size][/center] \r<br />\r<br />[list=1] \r<br />\r<br />[*]Use Wrye Bash (http://skyrim.nexusmods.com/downloads/file.php?id=1840) to install this mod. Just drag the package (which is a normal ZIP file) into Wrye Bash&#39;s Installers tab. However, the package is only a normal ZIP file, so if you know the game&#39;s mod file structure, install it manually.[/*] \r<br />\r<br />[*]Change your settings within the game in Sky UI&#39;s MCM or check the settings in &#34;DataIni&#34;. If you change any of it, execute your changes by typing in the console {bat &#34;inikuerteeProfessions.ini&#34;} without the brackets.[/*] \r<br />\r<br />[*]Activate the mod.[/*] \r<br />\r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Uninstall[/color][/size][/center] \r<br />\r<br />[list=1] \r<br />\r<br />[*]In the console, type &#34;SetPQV kuPQ uninstallNow True.&#34; Or with Sky UI&#39;s MCM, set the uninstallNow toggle to True then exit the menus.[/*] \r<br />\r<br />[*]Wait for a message confirming the uninstallation. Save the game.[/*] \r<br />\r<br />[*]Deactivate the mod with Wrye Bash. If you installed this manually, simply delete all the files you installed. (Wrye Bash keeps track of files used, so installing/uninstalling the mod with it is 100% simpler.)[/*] \r<br />\r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Troubleshooting[/color][/size][/center] \r<br />\r<br />[list] [*]You can reset the mod by typing {SetPQV kuPQ resetNow True} (without the brackets) in the console. Or with Sky UI&#39;s MCM, set the resetNow toggle to True then exit the menus.[/*] \r<br />[*]When it resets it will ask you either reset all of its data or continue with the current data. Resetting all its data will remove all your configurations and set the mod as if you have first installed it.[/*] \r<br />[*]You can check all the mod&#39;s data by typing {SQV kuPQ} in the console. You can check if your configurations were set in the mod properly with this.[/*] \r<br />[*]If you find that your changes (with the command SetPQV or from executing the INI) do not appear in the mod, check the command again for spelling errors. Then try again.[/*] \r<br />[*]If you find that resetting (with resetNow) and uninstalling (with uninstallNow) don&#39;t seem to work, the mod may have been suspended. It is best to simply start-over (i.e. reinstall the mod) after a &#34;clean&#34; save.[/*] \r<br />[/list]\r<br />\r<br />[size=5][color=#ff9900]Creating a clean save:[/color][/size]\r<br />\r<br />[list=1] \r<br />\r<br />[*]If you can, uninstall the mod from the console with {SetPQV kuPQ uninstallNow True}.[/*] \r<br />\r<br />[*]Wait for the mod to confirm the uninstallation. It may take a minute. If no confirmation appears, then simply continue to the next step.[/*] \r<br />\r<br />[*]Save the game manually from the console by typing {save uninstalledMod}.[/*] \r<br />\r<br />[*]Uninstall all the mod&#39;s files (*.ESP, *.PSC, *.PEX) from the game folders. Make sure that none of the mod&#39;s Scripts are left. A mod manager like Wrye is best used for this.[/*] \r<br />\r<br />[*]Load the &#34;uninstalledMod&#34; save.[/*] \r<br />\r<br />[*]Save the game manually again from the console by typing {save cleanSave}. Because all of the mod&#39;s files were removed, all of its data will be &#34;zeroed&#34; in this game.[/*] \r<br />\r<br />[*]Play from this game.[/*] \r<br />\r<br />[/list] \r<br />\r<br />[size=5][color=#ff9900]Script logging[/color][/size]\r<br />\r<br />[list]\r<br />[*]As a last resort, you can also enable script logging and investigate the &#34;DocumentsMy GamesSkyrimLogsScriptPapyrus.0.log&#34; file and/or send them to me. Contact me first either on TESNexus or the official Bethesda forums.[/*]\r<br />[*]To enable script logging, set bEnableLogging, bEnableTrace and bLoadDebugInformation in the Skyrim.INI file. More information about this is in this thread in the official Bethesda Creation Kit Forum: [url=http://forums.bethsoft.com/topic/1345130-having-papyrus-trouble-here-are-some-things-to-try/] http://forums.bethsoft.com/topic/1345130-having-papyrus-trouble-here-are-some-things-to-try/[/url].[/*] \r<br />[*]Then you can set the mod&#39;s specific log operations by setting debugMode to 1 in its MCM.[/*]\r<br />[*]Play the game for 5 minutes or so - enough time for the game to capture enough events.[/*]\r<br />[*]If your logs contain &#34;Suspended stack count is over our warning threshold, dumping stacks:&#34;, then your game is suffering badly. I&#39;ve written a guide on how to clean your game and recover from it in Bethesda&#39;s official forums: [url=http://forums.bethsoft.com/topic/1481687-suspended-stack-count-is-over-our-warning-threshold/]http://forums.bethsoft.com/topic/1481687-suspended-stack-count-is-over-our-warning-threshold/[/url].[/*]\r<br />[*]Then send the the &#34;DocumentsMy GamesSkyrimLogsScriptPapyrus.0.log&#34;, &#34;DocumentsMy GamesSkyrimLogsScriptUserkuPQs.0.log&#34; to kuertee@gmail.com.[/*]\r<br />[/list]\r<br />\r<br />[center][size=7][color=#ff9900]History[/color][/size][/center] \r<br />\r<br />[list] [size=5][color=#ff9900]0.706, 28 December 2013:[/color][/size][*]New feature: Clothing bonus: Activities can take up to 25% less time and generate up to 25% more Profession Bonus.\r<br />Alchemists and Enchanters: any enchanted robes, any enchanted light headwear or no headwear, any enchanted light gauntlets or gloves, and any enchanted boots.Armourer and Weaponsmiths: blacksmith&#39;s clothes*, appropriate headwear* or no headwear, any light gauntlets, and any light boots.*Blacksmith&#39;s clothes and headwear have the word &#34;smith&#34; in their name or &#34;ModelPath&#34;.Cooks: appropriate clothes, appropriate headwear* or no headwear, no handwear and any shoes.*Cook&#39;s clothes and headwear have the word &#34;cook&#34;, &#34;chef&#34;, &#34;bar&#34; or &#34;wench&#34; in their name or &#34;ModelPath&#34;.Hunters: fur, hide or leather armour but not scaled or studded armour, appropriate headwear* or no headwear, any light gauntlets and any light boots.*If userHuntersClothingBonusIsArmour is True, hunters&#39; clothes have the word &#34;bandit&#34;, &#34;fur&#34;, &#34;hide&#34;, &#34;leather&#34; in their name or &#34;ModelPath&#34;.*If userHuntersClothingBonusIsArmour is False, Cook&#39;s clothes and headwear have the word &#34;cook&#34;, &#34;chef&#34;, &#34;bar&#34; or &#34;wench&#34; in their name or &#34;ModelPath&#34;.Lumberjacks: appropriate clothes*, no headwear, any light gauntlets and any light boots.*Lumberjacks&#39; clothes have the word &#34;farm&#34; in their name or &#34;ModelPath&#34;Merchants: fine clothes*, no headwear, any gloves or no handwear, and any shoes.*Merchant&#39;s clothes have the word &#34;fine&#34; or &#34;merchant&#34; in their name or &#34;ModelPath&#34;.Miners: miner&#39;s clothes*, appropriate headwear or no headwear, any light gauntlets and any light boots.*Miner&#39;s clothes and headwear have the word &#34;miner&#34; in their name or &#34;ModelPath&#34;.Scholars: no armour, no headwear, any gloves and any shoes.[/*][*]Bug fix: The previous one or two versions stopped the detection of Hunterborn skinning. Fixed now. Also, there are no time penalty to skinning while Hunterborn is active.[/*]\r<br />[*]Bug fix: The harvesting bonus was getting applied even if the player wasn&#39;t sneaking.[/*]\r<br />[*]Tweak: Supports crafting even if the player animation is not locked. E.g. when mods open a crafting menu even if the player is not forced to an animation. E.g. when cooking or mixing potions in my Simple Camping mod&#39;s campfires.[/*]\r<br />[*]Bug fix: Bartering now requires that at least the Dialogue Menu or the Barter Menu is open. Previously, acquiring or losing items at the same time as acquiring or losing gold triggered was detected as a bartering activity. This allowed the mod to detect the trades that occured outside the Barter Menu. However, the mod also detected the act of storing gold in containers and then immediately recovering an item also as a bartering activity. The extra check for either of the menus fixes this bug.[/*]\r<br />[size=5][color=#ff9900]0.704, 27 October 2013:[/color][/size][*]Tweak: Rewrote the detection of crafting station. In this version, the object under your crosshair is used to determine the activity. Previously Scripts were attached to crafting stations dynamically filled into Aliases.[/*]\r<br />[*]Tweak: Time penalties and accumulation of Profession points are triggered when you are seated. Time penalties and Scholar Profession bonuses from reading books are now applied while seated. Previously, they were applied after you get up off the seat. Note that the game doesn&#39;t differentiate between the player sitting or the player locked in a crafting station. The mod had to do other checks to determine if the player is actually seated or is using a crafting station.[/*]\r<br />[*]Bug fix: Previously, the time penalty reported in the top-left corner didn&#39;t show the adjustment from your skills - even if the correct and the adjusted time penalty was added to the in-game time.[/*]\r<br />[*]Bug fix: Previously, when your skills are penalised below 0 (e.g. from Battle fatigue and injuries), no time penalties were recorded. In this version, time penalties are capped at twice the normal penalty. Remember that certain skills lend to the efficiency of different activities. This fix applies to when your skill is injured due to a disease, spell or injury from a mod.[/*]\r<br />[*]Bug fix: Taking coin purses while sneaking registered as harvesting.[/*]\r<br />[size=5][color=#ff9900]0.702, 15 October 2013:[/color][/size][*]Bug fix: Setting the ingredients or ore multipliers to 1 will actually remove any items you accumulate.[/*]\r<br />[size=5][color=#ff9900]0.701, 9 October 2013:[/color][/size][*]New feature: Harvesting while sneaking produces Alchemy points and takes 0.5 hours. Also, ingredients harvested (while sneaking) are multiplied by 3. Change this by setting userHarvestedIngredientsMultiplier. Note that these do not happen when harvesting while standing.[/*]\r<br />[*]New feature: Training produces Scholar points and takes 1 hour.[/*]\r<br />[*]New feature: Because ore veins get depleted quickly, mined ores are multiplied by 3. Change this by setting userMinedOreMultiplier.[/*]\r<br />[*]Bug fix: Accumulated reading time penalty and other time penalties from random events - hopefully fixed.[/*]\r<br />[*]Tweak: You can now change user settings before the main quest is at stage 5 (e.g. before leaving Helgen).[/*]\r<br />[*]Tweak: The main package and the MCM can now be merged manually (with TES5Edit). Removing the reliance on GetFormFromFile () from the MCM discovery code made this possible. In this new version, SendModEvent () is used by the main package and the MCM to &#34;ping&#34; each other.[/*]\r<br />[size=5][color=#ff9900]0.641, 1 April 2013:[/color][/size][*]Tweak: Recompiled the main mod with Skyrim&#39;s 1.9 patch and the MCM component with SkyUI&#39;s 3.4 patch.[/*]\r<br />[*]Bug fix: The previous version killed the detection of wood chopping and mining. This was a bug that I missed in the last update. Thanks to anasuelli for reporting it.[/*]\r<br />[*]Bug fix: The lever part of the sawmills were getting detected only on some sawmills.[/*]\r<br />[*]Compatibility: Future proof skinning detection. Previously, I detect if the pelt has the Keyword VendorItemHide AND from which dead actor it came from - which made mods that change skinning but move the items from the carcass to the player immediately compatible. (e.g. The Realisitc Skinning mod ([url=http://skyrim.nexusmods.com/mods/32841]http://skyrim.nexusmods.com/mods/32841[/url]) was compatible in previous versions of the mod.) In this version, I also check if the pelt was received while the player is in animation state. This makes it compatible with mods like the Hunterborn mod ([url=http://skyrim.nexusmods.com/mods/33201]http://skyrim.nexusmods.com/mods/33201[/url]) which simply adds pelts to the player without them coming directly from the carcass. Note, however, that this compatibility fix does not directly detect any 3rd-party mods like Hunterborn. I simply tweak my detection so that it is compatible with as many instances of skinning as possible. What this means is that you&#39;ll need to manually remove my mod&#39;s time sink for skinning or remove Hunterborn&#39;s own time sink.[/*]\r<br />[*]Compatibility: Previously, when in a special form (e.g. Vampire Lord or Werewolf), the script failed. It resumed when the player reverted back.[/*]\r<br />[size=5][color=#ff9900]0.638, 12 February 2013:[/color][/size][*]New feature: Jack of all trades: By default, you are a jack of all trades and the profession that generates Profession Bonus most efficiently (i.e. your chosen Profession) will change over time. However, as a penalty to being a master of none, you never gain the same efficiency as when you are specialised. Internally, you can have up to 10 points of activity in a Profession. By being a jack of all trades, you can never have more than 7.5 in any Profession. Change this by setting userJackOfAllTrades to either True or False with MCM, in the console or with the INI.[/*]\r<br />[*]New feature: Specialist: Your specialised profession will never change. However, as a penalty to being a specialist, activities of other professions will never surpass the efficiency of activities in your speciality. By being a specialist, you can accumulate up to 10 points of activity in your Profession. However, the other professions are capped at 7.5. Change this by setting userJackOfAllTrades to either True or False with MCM, in the console or with the INI.[/*]\r<br />[*]Compatibility: Frostfall. Previously, the mod had no specific code to address Frostfall. It was only somewhat supported. Time would be taken and Profession bonus generated but their occurences were inconsistent. In this version, code were tweaked and added to fully support Frostfall. So creating items in the portable crafting stations should work properly in this version. Also, in previous versions packing up the portable crafting stations took time and produced Profession Bonus. Fixed in this version.[/*]\r<br />[*]Bug fix: Learning a spell from a book is reactivated. This feature was disabled in previous versions because I found that gaining spells from sources that are not books (e.g. from Vampirism) triggered the reading activity event. This was because I was using the Spells learned Statistics for the detection of this activity. In this version, that Statistics is still used but only after you activated a book rather than a constant monitor of the Statistics like in the previous version.[/*]\r<br />[*]Bug fix: Previously, reading a book would take up too much time (more than 2 hours) sometimes. Fixed in this version.[/*]\r<br />[*]Bug fix: Skinning should only occur when taking items with the Keyword VendorItemAnimalHide from dead creatures with the Keyword ActorTypeAnimal. Previously, I was checking against dead actors in the PredatorFaction or PreyFaction. Some NPCs (particularly hunters) may have this Keyword.[/*]\r<br />[*]Tweak: Reprogrammed the finding of crafting stations. This should now detect the use of sawmills better. Previously, detecting of its use failed most times.[/*]\r<br />[size=5][color=#ff9900]0.637, 24 January 2013:[/color][/size] [*]New feature: Skill bonuses and penalties (from enchantments like Blacksmith&#39;s potion or from damage like Head injuries from my Battle fatigue and injuries mod) affect the time penalties and Profession bonuses. Skill bonuses decrease the time penalties and penalties increase them. Bonuses increase the Profession bonus and penalties decrease the Profession bonus. Listed below are the skills used for each activity: \r<br />Skill - ActivityAlchemy - mixing potions and cookingEnchanting - enchanting / disenchantingOne-handed or Two-handed (which ever is greater) - mining and wood cuttingMarksman - skinningSmithing - armour and weapon smithingMarksman or Smithing (which ever is greater) - tanning and stripping leatherSpeechcraft - bartering and reading* - There is no bonus or penalty from skill for refining ore or using a sawmill.[/*][*]Bug-fix: Previously, the time penalty for reading a book was sometimes multiplied by the number used to track the number of items produced for another activity resulting in a large amount of time penalty.[/*] \r<br />[*]Tweak: Reworked the interface with Eat and sleep to use SendModEvent () - a much cleaner method than the previous version.[/*] \r<br />[*]New feature: SkyUI&#39;s MCM (Mod Config Menu) support. The configuration tool is a separate download from my mod&#39;s Nexus files section. It requires Sky UI 3.1.[/*] \r<br />[*]Tweak: Unplayable armour, which is used by modders as a token, is ignored by the mod.[/*] \r<br />[*]Tweak: Better handling of While...EndWhile loops when the game first loads or when the mod is uninstalling.[/*] \r<br />[size=5][color=#ff9900]0.633, 16 December 2012:[/color][/size] [*]Tweak: Reworked the OnItemAdded () and OnItemRemoved () events to minimise spam from the game when a very many number of items are added or removed by the game. E.g. When Delphine takes all your inventory before you infiltrate the Thalmor Embassy.[/*] \r<br />[*]Bug-fix: Sometimes, acquiring items from vendors or containers would give you bonuses from professions associated with a nearby crafting station. E.g. Selling items to the Whiterun Mage would produce Alchemy bonuses because the player was close to the Alchemist station. This version fixes this by using SKSE&#39;s OnMenuOpen (&#34;Crafting Menu&#34;) and OnMenuClose (&#34;Crafting Menu&#34;) to flag when the player is actually crafting. (I didn&#39;t know of these functions until just before the last release when I used it with &#34;Book Menu&#34; to detect when the player is actually reading. Previous version used inaccurate methods to check for when the player is crafting.)[/*] \r<br />[size=5][color=#ff9900]0.630, 4 December 2012:[/color][/size] [*]Compatibility fix: This version now works with my mod Battle fatigue and injuries (BFaI). Previously, for it to work with BFaI, you needed to have my mod Eat and Sleep installed at least (i.e. not activated).[/*] \r<br />[*]Tweak: Skill books read is now detected and has a 1 hour penalty but generates Profession bonus of the same value as when new spells are learned.[/*] \r<br />[*]Tweak: More accurate detection of time spent on books. Also, books in the game world are now detected properly. In previous versions, only books you have not previously read are detected in the game world. Note that in previous versions, all books read from your inventory are detected.[/*] \r<br />[*]Tweak: Removed the internal code for OnMenuMode since it is not required.[/*] \r<br />[size=5][color=#ff9900]0.627, 22 November 2012:[/color][/size] [*]Bug fix: Books and notes (e.g. Recipes, maps) in the game world now generate Profession bonus. In the last version, only books in your inventory generated Profession bonus. However, there is still a bug: re-reading a book in the game world will not generate the bonus. But this bug doesn&#39;t exist when books are read from you inventory.[/*] \r<br />[*]Bug fix: Better calculation of time spent reading books.[/*] \r<br />[*]Tweak: The number of hours spent reading is used as a multiplier for its effects in Eat and Sleep.[/*] \r<br />[*]Bug fix: Eat and sleep synergy: Spamming crafting items now pass the correct amount of items produced to Eat and sleep.[/*] \r<br />[size=5][color=#ff9900]0.626, 18 November 2012:[/color][/size] [*]New feature: Scholar profession. Reading books, maps, recipes and any readable note will produce Profession Bonus. userTimeScaleReading (default 20) is used to convert real-time spent reading a book into in-game time. You need to spend at least 30 seconds reading a book to get the scholar bonus. You can change this by setting userSecondsRequiredForReading in the INI.[/*] \r<br />[*]New feature: Learning a spell takes 1 hour (by default). Change this by setting userTimePenaltyLearnSpell in the console or in the INI.[/*] \r<br />[*]New feature: Activities from this mod now affect exhaustion, hunger, and thirst in my mod Eat and Sleep [url=http://skyrim.nexusmods.com/downloads/file.php?id=13246]http://skyrim.nexusmods.com/downloads/file.php?id=13246[/url].[/*] \r<br />[*]New feature: You can change to a different profession immediately by typing {setpqv kuPQ chooseProfessionNow True} without the brackets in the console.[/*] \r<br />[*]Bug-fix: Disenchanting and enchanting activities were sometimes not detected. This version fixes that.[/*] \r<br />[*]Tweak: You can now vary the amount of time an activity takes by setting its minimum time penalty in the INI. By default this is set off, so you need to change the INI. Just remember that you need to run the INI after by typing in the console {bat &#34;inikuerteeProfessions.ini&#34;} or {bat &#34;inikuerteeProfessionsHighCraftingTimes.ini&#34;} - depending on which you prefer. Thanks to NariusV for his suggestion&#33;[/*] \r<br />[*]Tweak: I&#39;ve lowered the Adventurer and Explorer Bonuses again to 6 and 3 hours, respectively. I found the previous bonuses to high allowing me to neglect my profession. This went against the purpose of this mod, which was to make the user take a break from adventuring.[/*] \r<br />[*]Tweak: An INI called kuerteeProfessionsHighCraftingTimes.ini is provided that sets crafting activites to take up more time than the default. Execute the INI by typing {bat &#34;inikuerteeProfessionsHighCraftingTimes.ini&#34;} (without the brackets) in the console to get these times: \r<br />[list]\r<br />[*]Mixing potions: 1 hour[/*]\r<br />[*]Cooking: 1 hour (unchanged from default)[/*]\r<br />[*]Armour and weapon crafting: 8 hours[/*]\r<br />[*]Armour and weapon improvement: 4 hours[/*]\r<br />[*]Enchanting and disenchanting: 4 hours[/*]\r<br />[*]Tanning: 4 hours[/*]\r<br />[*]Skinning: 8 hours[/*]\r<br />[*]Leather stripping: 0.5 hours (unchanged)[/*]\r<br />[*]Mining: 0.25 hours (unchanged)[/*]\r<br />[*]Smelting: 1 hour per ingot (unchanged)[/*]\r<br />[*]Woodchopping: 0.25 hour (unchanged)[/*]\r<br />[*]Using the sawmill: 0.25 hours to put the log in place and 0.25 to cut it (unchanged)[/*]\r<br />[*]Learning a spell: 4 hours[/*]\r<br />[/list][/*][size=5][color=#ff9900]0.62, 21 Aug 2012:[/color][/size] [*]Bug-fix: Profession Bonuses from hunting and improving weapons and armour are reenabled in this version. They weren&#39;t working in the previous version.[/*] \r<br />[*]Tweak: When removing the Adventurer and Explorer bonuses by setting them to 0 in the INI, the messages for them still showed - albeit with 0 values. This version removes these messages when they are turned off.[/*] \r<br />[*]Tweak: Adventurer bonuses are now only 12 hours. And Explorer bonuses are now only 6. The previous values were simply too high offsetting the original purpose of this mod - which is to get the user to take a break from adventuring. If you had changed these values previously, your values will persist after the update. Otherwise, the previous values of 24 and 12 will be changed to 12 and 6.[/*] \r<br />[size=5][color=#ff9900]0.614, 7 Aug 2012:[/color][/size] [*]Bug-fix: Spamming the production of items now penalise your time and accumulate your Profession Bonus correctly. In previous versions, the mod would skip items produced when you create them too quickly.[/*] \r<br />[*]Bug-fix: Losing time and acquiring Profession Bonus while an animation is playing while not performing a profession action doesn&#39;t happen in this version anymore. E.g. in the last version, eating when animated will give you a profession bonus and put forward the time.[/*] \r<br />[*]New feature: Adventurer is a passive profession. Completing quests adds 24 hours to your Profession Points. This doesn&#39;t have a time penalty. Change this bonus in the INI file or via the console.[/*] \r<br />[*]New feature: Explorer is a passive profession. Discovering new locations adds 12 hours to your Profession Points. This doesn&#39;t have a time penalty. Change this bonus in the INI file or via the console. Thanks to Faresh for his suggestion.[/*] \r<br />[size=5][color=#ff9900]0.612, 10 July 2012:[/color][/size] [*]Tweak: Only items with the keywords VendorItemAnimalHide and VendorItemAnimalPart will trigger the hunting action. Previously any ingredients would trigger it - so taking mushrooms from dead cats was previously a hunting action. Not in this version.[/*] \r<br />[*]Tweak: Bartering. Sometimes transfering gold and items into and from containers would be detected as bartering. In this version, only non-looted gold and while the game world is paused will the exchange of items be detected as bartering. Also in previous versions, losing an item and gaining gold at quest completion was detected as bartering. Fixed in this version also.[/*] \r<br />[*]Tweak: Streamlined the detection of crafted items. E.g. in previous versions, the mod doubled-up the dection of one action sometimes. In this version, this will not happen.[/*] \r<br />[size=5][color=#ff9900]0.611, 19 June 2012:[/color][/size] [*]Tweak: Updating versions now restore your previous game data (e.g. your profession, accumulated bonuses and penalties, etc.).[/*] \r<br />[*]Tweak: Hides must come from creatures in the predator and prey factions. Otherwise, they are categorised as loot. E.g. hides from giants will not be counted as butchering/skinning them.[/*] \r<br />[*]Tweak: Taking an animal&#39;s hide and taking another body part (e.g. sabre cat&#39;s fur and tooth) should only penalise you one lot of time - even if both actions add to your Profession Points. Previously, time was getting deducted twice - one for each item.[/*] \r<br />[size=5][color=#ff9900]0.61, 11 June 2012:[/color][/size] [*]Tweak: Detection of crafting station. In previous versions, if you were getting bonuses for Hunting or bartering even if you were in a crafting station pointed to the crafting station not getting detected. I tweaked how this is performed in this version.[/*] \r<br />[*]Bug-fix: Loot potions and ingredients off draugr was getting counted as butchering for the hunter profession. In this version, this action doesn&#39;t.[/*] \r<br />[size=5][color=#ff9900]0.5, 6 June 2012:[/color][/size] [*]Initial release.[/*] \r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Credits[/color][/size][/center] \r<br />\r<br />kuertee in http://www.bethsoft.com/bgsforums/ \r<br />\r<br />[center][size=7][color=#ff9900]Tools Used[/color][/size][/center] \r<br />\r<br />Creation kit - http://www.creationkit.com \r<br />\r<br />[center][size=7][color=#ff9900]Licensing/Legal[/color][/size][/center] \r<br />\r<br />You can do whatever you want with this mod but all I ask in return is that you give me credit. I would also like to be contacted when you include this mod in part or in full in a public release. ",
  "categoryId": "24",
  "version": "0.801",
  "author": "kuertee",
  "createdUnix": "1338916984",
  "updatedUnix": "1394443948",
  "containsAdultContent": false,
  "uploadedBy": "kuertee",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000089403",
      "name": "kuertee Professions 0p706",
      "version": "0.706",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "74",
      "fileName": "kuertee Professions 0p706-18258-0-706.zip",
      "uploadedUnix": "1388615694",
      "modVersion": "0.706",
      "virusScanUrl": "https://www.virustotal.com/file/cae8fb575185ea2e49d1c388aeb6022645ddebe39d0e69735dc019524eddb180/analysis/1407867978/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuertee%20Professions%200p706-18258-0-706.zip?fid=1000089403&ttl=1535784987&ri=8192&rs=8192&setec=cc0d4ffd1bb84a30f1be10b3c38ceaa9"
    },
    {
      "fileId": "1000089404",
      "name": "kuP x MCM 0p706",
      "version": "0.706",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16",
      "fileName": "kuP x MCM 0p706-18258-0-706.zip",
      "uploadedUnix": "1388615831",
      "modVersion": "0.706",
      "virusScanUrl": "https://www.virustotal.com/file/9706009f834ce31e5276cd848397d39c19b9e23ffbc939aa5458d5cb38f3c4b6/analysis/1407867978/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuP%20x%20MCM%200p706-18258-0-706.zip?fid=1000089404&ttl=1535784988&ri=8192&rs=8192&setec=ea491a2da7cc729067235abdeae80cf5"
    },
    {
      "fileId": "1000089405",
      "name": "kuP merged with MCM 0p706",
      "version": "0.706",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "89",
      "fileName": "kuP merged with MCM 0p706-18258-0-706.zip",
      "uploadedUnix": "1388615920",
      "modVersion": "0.706",
      "virusScanUrl": "https://www.virustotal.com/file/d28ca5cb2dd2db9de8502e6bcc373880bfa944b58e88866b8633f27c55fc4a09/analysis/1407867979/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuP%20merged%20with%20MCM%200p706-18258-0-706.zip?fid=1000089405&ttl=1535784988&ri=8192&rs=8192&setec=d4eecefd220591059d11056c40fcc7dc"
    },
    {
      "fileId": "1000100650",
      "name": "kuertee Professions 0p801",
      "version": "0.801",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "74",
      "fileName": "kuertee Professions 0p801-18258-0-801.zip",
      "uploadedUnix": "1394443576",
      "modVersion": "0.801",
      "virusScanUrl": "https://www.virustotal.com/file/2571efb162c2e2dd3462c4eb56f91cab94f97cd3627f985fb6aa18592e1518b3/analysis/1407976027/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuertee%20Professions%200p801-18258-0-801.zip?fid=1000100650&ttl=1535784988&ri=8192&rs=8192&setec=f614cba669dc0e56fb77abd3fd0b474c"
    },
    {
      "fileId": "1000100651",
      "name": "kuP x MCM 0p801",
      "version": "0.801",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "16",
      "fileName": "kuP x MCM 0p801-18258-0-801.zip",
      "uploadedUnix": "1394443760",
      "modVersion": "0.801",
      "virusScanUrl": "https://www.virustotal.com/file/dacc1580e51eb8daf5e399e2b4c21f6189e44900ca3adec480772ca904dd147c/analysis/1407976325/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuP%20x%20MCM%200p801-18258-0-801.zip?fid=1000100651&ttl=1535784989&ri=8192&rs=8192&setec=b02a78e64fb3c26dff488a2f11d663f9"
    },
    {
      "fileId": "1000100652",
      "name": "kuP merged with MCM 0p801",
      "version": "0.801",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "90",
      "fileName": "kuP merged with MCM 0p801-18258-0-801.zip",
      "uploadedUnix": "1394443948",
      "modVersion": "0.801",
      "virusScanUrl": "https://www.virustotal.com/file/51904ac8371683e32e44d7af5adba8a7e75f242bad2b9d1ec5cc55c7b238f7c5/analysis/1407976326/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuP%20merged%20with%20MCM%200p801-18258-0-801.zip?fid=1000100652&ttl=1535784989&ri=8192&rs=8192&setec=c92cb1b628df4ca371500d83309e2b1e"
    }
  ]
}