{
  "modId": 18273.0,
  "modName": "Winterhold College Improved",
  "summary": "This Mod Adds an entire new floor to the college of winterhold&#39;s main tower as well as drastically improving the Archmage quarters while at the same time adding autochests, additional apparel A Marketplace/Dininghall and numerous little tweaks to improve gameplay and immersion.  ",
  "descriptionHtml": "[b][size=4]Description:[/size][/b]\r<br />So I&#39;m sure Many of you were like me when you played through the Winterhold college storyline and were a little bit bummed and thought... Really? That&#39;s it?  This is a mod for all of you out there who were dissatisfied with the steril feeling of the College of Winterhold.  The goal of this mod was to expand the school a little and make it a little more sociable.  I did this by adding a whole new floor to the main tower in the college of winterhold with a central dining area & shops.  I also dressed up the Archmage Quarters to make them a more viable player home which can be fast traveled to via a magic well at the top of the archmages tower.   Originally this mod was also programmed to also be spouse friendly but with the hearthfire dlc the coding just became too complicated to function reliably so it has been stripped out in favor of stability. \r<br />\r<br />That being said I highly recommend the &#34;My Home is Your Home&#34; mod.  It sets the spouse and follower homes better than I could even hope to. You can even specify where they sleep where they work or instead of sleeping you can have them guard an area. \r<br />\r<br />You can find the mod Here:\r<br />http://skyrim.nexusmods.com/mods/18045\r<br />\r<br />[b][size=4]Other Recommended Mods:[/size][/b]\r<br />\r<br />I also highly recommend the  &#34;Unlimited Bookshelves&#34; Mod.  This mod allows you to put anything on shelves&#33; and many many more books&#33;\r<br />http://skyrim.nexusmods.com/mods/10891\r<br />\r<br />Another good mod is the &#34;Interesting NPCs&#34; mod.  This adds a slew of NPCs to Skyrim and 3 new mages to the college of winterhold.  One in the Hall of attainment, and 2  in the archaneum (unless they&#39;re out drinking in town of course ;) \r<br />You can find it here:\r<br />http://skyrim.nexusmods.com/mods/8429\r<br />\r<br />And lastly to complete the Winterhold experience I recommend the mod &#34;Expanded Winterhold Destruction Ruins&#34;  it really adds quite a bit to the Winterhold experience as well by making winterhold look like it used to be a great city to rival Solitude but crumbled into the sea during the event 200 years before.  There is also a crypt and an undergroundcity to explore as well&#33;\r<br />You can find the mod Here:\r<br />http://www.nexusmods...im/mods/30554/?\r<br />\r<br />*************************************************************\r<br />[b][size=4]Installation Instructions:[/size][/b]\r<br />*************************************************************\r<br />\r<br />IF YOU ARE UPGRADING -  FOLLOW THESE STEPS:\r<br />(Note: Some of these steps you can only do before installing the mod so if you are seeing these instructions for the first time and didn&#39;t do these steps then you may want to reload the previous version of this mod and follow these instructions so you&#39;re not picking up a bunch of books or running around naked.)\r<br />\r<br />1) Remove all personal items from the Archmage Quarters (especially bookshelves and containters)\r<br />2) Remove your Psiijic Robes (If you have any on)\r<br />3) Fast travel to whiterun (or any city far away from winterhold)\r<br />4) Save & Quit\r<br />5) Uninstall Old version of this mod\r<br />6) Install New Version\r<br />7) Start Skyrim & Load your new save\r<br />8) open console and type &#34;PCB&#34; then hit enter\r<br />9) While still in the console and type &#34;resetinteior WinterholdCollegeArchmageQuarters&#34; then hit enter. (this is particularly necessary if you plan to run this mod with &#34;Immersive College of Winterhold as it resets stubborn furniture, markers and havok objects.)\r<br />10) Travel back to Winterhold and Use this mod normally. \r<br />\r<br />\r<br />IF INSTALLING FROM SCRATCH:\r<br />\r<br />1) Go to whiterun\r<br />2) Install this mod via NMM\r<br />3) Go back to winterhold and Enjoy\r<br />\r<br />\r<br />PATCH PROPER LOAD ORDERS IF INSTALLING PATCHES:\r<br />\r<br />ELFX + Winterhold Improvements:\r<br />1) ELFX files\r<br />2) Winterhold Improvements \r<br />3) WI_ELFX_Patch.esp\r<br />\r<br />ELFX + Immersive College of Winterhold + Winterhold Improvements:\r<br />1) ELFX files\r<br />2) Immersive College of Winterhold files (don&#39;t use his ELFX patch. Use the one below instead.) \r<br />3) Winterhold Improvements \r<br />4) WI_CWI_ELFX_patch.esp\r<br />\r<br />Immersive College of Winterhold + Winterhold Improvements:\r<br />1) Immersive College of Winterhold files \r<br />2) Winterhold Improvements \r<br />3) WI_CWI_patch.esp\r<br />\r<br />\r<br />******************************************************************\r<br />[b][size=4]Change Log from version 1.5:[/size][/b]\r<br />******************************************************************\r<br />\r<br />Archmage Quarters:\r<br />1) Re-Arranged entrance and Stairway layout so that it is using the correct window/stairs setup and modified other floors accordingly\r<br />2) Moved bookcases to accomodate stairway/window corrections. (Sorry :/ )\r<br />3) Added 2 more bookcases to make up for moving the damn bookcases around again.\r<br />4) Added swanky wall map\r<br />5) Added new &#34;kitchen&#34; divider for privacy (with shelves)\r<br />6) Added new &#34;bathroom&#34; divider for privacy\r<br />7) Added new Case Display Wall\r<br />8) Upgraded bet to Swanky 4 post bed with drapery\r<br />9) Changed a few kitchen items around so there was more food there\r<br />10) Added &#34;NavCut&#34; objects to allow NPCs to navigate better in Archmage Quarters\r<br />11) Added &#34;Options Ledger&#34; to allow for disabling/enabling some of the new features.\r<br />12) Added &#34;Archmage&#39;s Journal Volume 1&#34; detailing his first 20 years as Archmage & letter from deceased Archmage telling you information to start a short new quest to get some fancy pants battlemage robes ;)\r<br />13) Removed previous Psiijic Robes. Why?  BECAUSE YOU DIDN&#39;T EARN THEM&#33; :p\r<br />\r<br />\r<br />Dining Hall:\r<br />1) Added new door for getting to Archmage Quarters\r<br />2) Tweaked lighting profile Slightly\r<br />\r<br />Midden Ice Labyrinth (New Quest Area):\r<br />1) Added new &#34;Ice Labyrinth&#34; area accessible within the Midden dark via the Vanilla Ice cave exit. (Exit now goes to Labyrinth)\r<br />2) The Ice labyrinth is my first attempt at a maze and it is a short quest to have you earn the Psiijic robes.  It is meant to be confusing and challenging to get through and I intentionally did not opt to do quest markers in order to make it more challenging.  My hope is that it takes you at least 1-3 hrs to fully explore the maze... hopefully with an hr or 2 of beating your head against your keyboard trying to find your way through. However I&#39;ve littered the maze with many rewards that hopefully make the effor worth while. ;)\r<br />\r<br />Please let me know how your experience with this new quest & content goes. I&#39;m particularly interested in if it was hard enough for you? Did you get lost? How long did it take you to complete? Did you cheat to get through it? Were the Bosses tough enough? Did you enjoy the backstory for the Archmage?\r<br />\r<br />************************************************\r<br />[b][size=4]Ledger Options:[/size][/b]\r<br />************************************************\r<br />\r<br />1) Disable/Enable Entrance Furniture - Option to remove furniture from entrance to make room for wall clock in the &#34;Immersive Winterhold&#34; mod.\r<br />2) Disable/Enable Kitchen Divider - Disables kitchen divider & shelves.\r<br />3) Disable/Enable Bathroom Divider - Disables Bathroom divider\r<br /> \r<br />\r<br />**************************************************************\r<br />[b][size=4]Uninstallation Instructions:[/size][/b]\r<br />**************************************************************\r<br />\r<br />1) Remove all of your items from all Bookshelves, Shelves, Display racks/cases/plaques, Mannequins & Containers from both the Archmage quarters AND the Dining Hall/Forum.\r<br />2) Uninstall mod via Nexus mod manager or Unsubscribing from steam.\r<br />\r<br />\r<br />[b][size=4]Recent Updates:[/size][/b]\r<br />\r<br />- Fixed NPC pathing to dining hall and archaneum so they don&#39;t go through archmage quarters (had to move the bookshelves in order to make this happen.  I hope you guys weren&#39;t too infuriated with the books on the floor :/)\r<br />- Fixed hoods to work with frostfall\r<br />- Removed Marriage scripts\r<br />- Made all Ghost weapons upgradable\r<br />- Added a smelter and tanning rack to exterior. \r<br />\r<br />[b][size=4]Features:[/size][/b]\r<br />\r<br />1. Improved the Archmage quarters and made it a viable Player home\r<br />- Added 14 new player chests\r<br />- 4 Autostorage chests (all Items)\r<br />- 1 Autostorage Food chest\r<br />- 1 Autostorage Gem chest\r<br />- 1 Autostorage Crafting Chest\r<br />- 1 Autostorage Ingredients chest\r<br />- 6 Static chests\r<br />- Added 2 strong boxes for enchanting/alchemy apparel\r<br />- Added 2 Mannequins\r<br />- Added 8 Weapon Plaques (6 single item 2 triple item)\r<br />- Added a 6 weapon wall rack\r<br />- put auto access scripts on both the Enchanter & alchemy table (so you can store all your items in the chest and when you use the enchanter it will pull from the chest as well as your inventory... trust me... its Awesome.\r<br />- Adds a Tanning rack with auto Access script\r<br />- Fills player closet with one of each type of new mage robe (see below)\r<br />- 5 bookshelves\r<br />- 2 Winterhold bookshelves\r<br />\r<br />2. Put The Archmage&#39;s tower on the Map so you can fast travel to the rooftop of the college and put a Magicka fountain up there (In my mind I like to think of it as a teleportation node) \r<br />\r<br />3. ADDED AN ENTIRE DINING HALL AND MARKETPLACE&#33; This part is a biggie. I added an entire new floor to the college&#39;s main tower above the Aracaneum and below the archmage quarters, which acts as a central Market and dining hall for the college. Included are:\r<br />\r<br />- A Tailor that specializes in Magical Robes (Also sells new robes... see below for details)\r<br />- An Enchanting shop what specilizes in spells, soul gems and Staves\r<br />- A Blacksmith specializing in weapons and bows with workbench, small forge, sharpening wheel and \r<br />Autostorage chest for crafting items... oh yeah and all of those crafting stations are all scripted to auto access from the crafting chest ;) (we&#39;re all about convenience here at Sku11M0nkey Productions =)\r<br />- A General Merchant\r<br />- An Alchemist shop\r<br />- a food vendor\r<br />- a bartender\r<br />- Most NPCs will stop in to eat at different points of the day (main mealtimes are 12pm and 6 pm but a select few will stop in and eat at odd hrs because of their schedules/personalities)\r<br />- All the merchants start to kick back and mill around the place after 8 pm (hey they gotta have time off \r<br />sometime... However even on their &#34;Time Off&#34; you can still buy from =) \r<br />- Stealing from or killing a merchant will get you kicked out of the college as well as get the ire of the shop keeper. \r<br />- All New shop owners will recognize you as the Archmage of the college and greet you appropriately. \r<br />\r<br />4. New Robes, fixes & tweaks:\r<br />\r<br />- Player gets a set of Archmage robes without the hood (all abilities still retained in robes)\r<br />- player gets a set of Psijic robes in his closet\r<br />- New Mage Robes:\r<br />- Buffs Archmage robes slightly to 20% in all skills + 125% magicka regen\r<br />- Blue Mage robes = 150% magicka regen\r<br />- Black Mage Robes = Destruction spells cost 20% less + 125% magicka regen\r<br />- Grey Mage Robes = Illusion spells cost 20% less + 125% magicka regen\r<br />- Brown Mage Robes = Alteration spells cost 20% less + 125% magicka regen\r<br />- Green Mage Robes = Conjuration spells cost 20% less + 125% magicka regen\r<br />- Red & White Mage Robes = Restoration spells cost 20% less + 125% magicka regen\r<br />- Nocturnal Destruction Robes (Female Only) = Destruction spells cost 20% less + 125% magicka regen\r<br />- Nocturnal Hood (Female only) - no enchantment\r<br />- Red, blue, green, brown, Grey & black matching hoods (all with no enchantments so player can enchant as desired)\r<br />- Most Mage hoods now allow wearing of a circlet as well as the hood\r<br />- Playable Greybeard Robes, Boots, Hood all with 20% boost in shout recovery time\r<br />- Exterior Smelter for smelting ingots (to the right of the exteior entrance to the hall of elements)\r<br />- Exterior Tanning rack for you to use when you are a fledgling mage (to the left of the exterior entrance to the hall of elements near the trapdoor to the midden)\r<br />- Buffed the Drainheart, Drainspell, and Drainblood ghost weapons by making them upgradable and lighter.  They will only upgrade as well as honed draugr weapons but they are much faster as I wanted them to match their vanilla ghostly weights. (3 libs for a battle axe&#33; you should be able to swing that sucker fast&#33;)\r<br />\r<br />\r<br />[b][size=4]Bugs/Workarounds that may come up:[/size][/b]\r<br />\r<br />1)  &#34;I don&#39;t get any dialogue options to move my spouse to any of my hearthfire homes&#33;&#34; - More than likely it is an incompatibility with the previously recommended mod &#34;Spouses can live everywhere&#34; mod.  Unfortunately that mod alters the vanilla RelationshipSpouseHouseScript and it hasn&#39;t been updated for hearthfire, therefore it doesn&#39;t show those dialogue options.  If you have that mod then you should remove it and replace it with the &#34;my home is your home&#34; mod recommeneded above.   However there is the slim possibility that the script is somehow recorded in your save file.  If this is the case FIRST EMPTY THE ARCHMAGE QUARTERS OF ALL VALUABLES. Then simply temporarily disable this mod. While disabled move your spouse to your hearthfire house then re-enable this mod afterwards.  (if the error still occurs then it&#39;s definitely not this mod causing it)\r<br />\r<br />2) This mod is buggy I hate you&#33; --- Well now you just hurt my feelings&#33;  Before you unsubscribe in anger, try loading my mod last in the data files list (or close to last as possible) that will prevent it from conflicting with other mods... most of the time...  And if that doesn&#39;t fix it please report what you&#39;re experiencing in a constructive manner and I&#39;ll look into it =)\r<br />\r<br />Thanks for all your patience and support everyone&#33;&#33;&#33;\r<br />\r<br />INSTALLATION NOTES:\r<br />\r<br />1) For a smooth installation without conflicts, load this mod last in your data files list and then place any mage robes or any appearance/texture mods after it. (I.E. I have to load my brelyna appearance mods after Winterhold Improved)\r<br />\r<br />2) This mod may conflict with other Winterhold mods Particularly the archmage quarters, Arcanium & rooftop. or any mods that effect Mage robes etc. Again set Winterhold Improved to load last then load your other Winterhold mods after it.\r<br />\r<br />NOTEs:\r<br />\r<br />- The girl in the photo is a revamped version of Brelyna Maryon who you can marry in the vanilla game. Her face mods are not included However her robes are (see Nocturnal robes) If you like her look you can check out &#34;Better looking Brelyna&#34; by Clockwork BETA:http://skyrim.nexusmods.com/downloads/file.php?id=8316 \r<br />\r<br />CREDITS:\r<br />\r<br />- Bethesda for making such an awesome game.\r<br />- SPARTAN VI for making the Armored Battlemage Robes (http://skyrim.nexusmods.com/downloads/file.php?id=3386 )\r<br />- Manilla Turgle for making the Automatic Item Storage & access scripts: http://skyrim.nexusmods.com/downloads/file.php?id=12468",
  "categoryId": "67",
  "version": "1.7.4",
  "author": "Sku11M0nkey",
  "createdUnix": "1338931220",
  "updatedUnix": "1401785625",
  "containsAdultContent": false,
  "uploadedBy": "Sku11M0nkey",
  "primaryFile": null,
  "files": [
    {
      "fileId": "66157",
      "name": "Winterhold Improved V1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4883",
      "fileName": "Winterhold Improved V1_0-18273.zip",
      "uploadedUnix": "1338933858",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3c39b4ee509d3da3bb3182be6eb0919101656abf23e8bfccc5e1d279328bcc6b/analysis/1406941026/",
      "changelogHtml": " In the beginning there was nothing... and then the improved winterhold was born in all its glory. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Winterhold%20Improved%20V1_0-18273.zip?fid=66157&ttl=1535785018&ri=8192&rs=8192&setec=258c0292776976ded63d9e425f2c9ccd"
    },
    {
      "fileId": "66256",
      "name": "Winterhold Improved V1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4883",
      "fileName": "Winterhold Improved V1_1-18273.zip",
      "uploadedUnix": "1338958859",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/66a255c1aed28586f38c325d59a204816e3899349b2672eda236b9cfcb347dc8/analysis/1406941763/",
      "changelogHtml": " Fixed the issue with new mage robes appearing everywhere in skyrim <br/> \n buffed the Drainspell bow and added fancy drainspell arrows.... that are invisible.  Hey nobody&#39;s perfect. <br/> \n Fixed a few item statistics. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Winterhold%20Improved%20V1_1-18273.zip?fid=66256&ttl=1535785018&ri=8192&rs=8192&setec=e3bdcd44bf5cbda4ca018a29d005618c"
    },
    {
      "fileId": "66460",
      "name": "Winterhold Improved v1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4884",
      "fileName": "Winterhold Improved v1_2-18273-1-2.zip",
      "uploadedUnix": "1339043264",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/76a06903426ac2521cdcef6238c593d96f44e1b9fa601fc3ab3f0cbea4959bbb/analysis/1406944088/",
      "changelogHtml": " Attempted to fix the occasional glitch where spouse runs off to proudspire manor or Vindrel hall instead of the archmage quarters. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Winterhold%20Improved%20v1_2-18273-1-2.zip?fid=66460&ttl=1535785019&ri=8192&rs=8192&setec=2ec321e17bd6c1441833411d8f31389b"
    },
    {
      "fileId": "1000014636",
      "name": "Winterhold Improved v1_5",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "275",
      "fileName": "Winterhold Improved v1_5-18273-1-5.zip",
      "uploadedUnix": "1362300820",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/fb99cc161a1211dd581bda83c5ebcfec19fe9d88aa08f335f88fd4b36b2573ef/analysis/1407449644/",
      "changelogHtml": " Fixed NPC pathing to dining hall and archaneum so they don&#39;t go through archmage quarters <br/> \n Removed Marriage scripts due to Hearthfire conflict and to make mod more stable across the board. I encourage all users to use the \"My home is your home\" mod.  It works much better. <br/> \n  buffed All drainspell weapons(made speed correspond with weight) and upgradable at sharpening wheel with ectoplasm (same as the vanilla game&#39;s ghost sword) <br/> \n Fixed Greybeard&#39;s robes so that they functioned properly and removed them from Archmage quarters. They are now in an appropriate lore friendly location. <br/> \n Cleaned mod out thoroughly with TES5Edit - it is completely Error and dirty edit free. <br/> \n Made Psiijic robes separate from Armored Psiijic robes so user had both versions. <br/> \n Removed master illusion text from dining hall <br/> \n Added a secret new unique magical item to the game... and no I&#39;m not gonna tell where it is. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Winterhold%20Improved%20v1_5-18273-1-5.zip?fid=1000014636&ttl=1535785019&ri=8192&rs=8192&setec=dae6a6fc4f8d4ab7e120a7c720d0b869"
    },
    {
      "fileId": "1000091314",
      "name": "Winterhold_Improvements_v1_7_4",
      "version": "1.7.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17755",
      "fileName": "Winterhold_Improvements_v1_7_4-18273-1-7-4.zip",
      "uploadedUnix": "1389611719",
      "modVersion": "1.7.4",
      "virusScanUrl": "https://www.virustotal.com/file/5865f18f0d05a8fba3209a545c16f1e9b8fa193b5238a6d6c742541366fde624/analysis/1407884620/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Winterhold_Improvements_v1_7_4-18273-1-7-4.zip?fid=1000091314&ttl=1535785020&ri=8192&rs=8192&setec=c53febe777d1573d6513bdab41bf2cb4"
    },
    {
      "fileId": "1000091315",
      "name": "Winterhold Improvements ELFX patch",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Winterhold Improvements ELFX patch-18273-1-1.zip",
      "uploadedUnix": "1389611782",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e6513078aab7a86027a9938f6ac15ef438737cd82954529d747ca6d3519e43c6/analysis/1407884620/",
      "changelogHtml": " Fixed the issue with new mage robes appearing everywhere in skyrim <br/> \n buffed the Drainspell bow and added fancy drainspell arrows.... that are invisible.  Hey nobody&#39;s perfect. <br/> \n Fixed a few item statistics. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Winterhold%20Improvements%20ELFX%20patch-18273-1-1.zip?fid=1000091315&ttl=1535785020&ri=8192&rs=8192&setec=1983f670f8cdc4ec2b7369a387723798"
    },
    {
      "fileId": "1000091316",
      "name": "Immersive Collage of Winterhold Compatibility Patch",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "91",
      "fileName": "Immersive Collage of Winterhold Compatibility Patch-18273-1-1.zip",
      "uploadedUnix": "1389611830",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/978143cdb5827fa1cb5235c825cc2fe09b28b9df2f882984364fc8820bc88569/analysis/1407884622/",
      "changelogHtml": " Fixed the issue with new mage robes appearing everywhere in skyrim <br/> \n buffed the Drainspell bow and added fancy drainspell arrows.... that are invisible.  Hey nobody&#39;s perfect. <br/> \n Fixed a few item statistics. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20Collage%20of%20Winterhold%20Compatibility%20Patch-18273-1-1.zip?fid=1000091316&ttl=1535785021&ri=8192&rs=8192&setec=94a4157f73092a867c99caeb1fa70440"
    },
    {
      "fileId": "1000091317",
      "name": "Immersive College of Winterhold Plus ELFX compatability patch",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "102",
      "fileName": "Immersive College of Winterhold Plus ELFX compatability patch-18273-1-1.zip",
      "uploadedUnix": "1389611892",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2ff578f5353fceecce7d05bd0336e318807771de87cc9c16785635adf40cf0ad/analysis/1407884711/",
      "changelogHtml": " Fixed the issue with new mage robes appearing everywhere in skyrim <br/> \n buffed the Drainspell bow and added fancy drainspell arrows.... that are invisible.  Hey nobody&#39;s perfect. <br/> \n Fixed a few item statistics. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20College%20of%20Winterhold%20Plus%20ELFX%20compatability%20patch-18273-1-1.zip?fid=1000091317&ttl=1535785021&ri=8192&rs=8192&setec=4034bb62416d6c60a2df961207c137ed"
    },
    {
      "fileId": "1000111640",
      "name": "Immersive College of Winterhold 2_0 which is compatible with patch. (TEMPORARY UNTIL NEXT PATCH)",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "81150",
      "fileName": "Immersive College of Winterhold 2_0 which is compatible with patch.-18273-2-0.7z",
      "uploadedUnix": "1401785625",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/0af670b88fad285083e3845873c47bb729fa1f21cbfb07755fa159f9ebcd28a9/analysis/1408110494/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20College%20of%20Winterhold%202_0%20which%20is%20compatible%20with%20patch.-18273-2-0.7z?fid=1000111640&ttl=1535785021&ri=8192&rs=8192&setec=79e0aef18383c9e8c9bfe89c5bd15e33"
    }
  ]
}