{
  "modId": 1832.0,
  "modName": "SpookyJs Slightly Improved Constellations",
  "summary": "Changes the skyrimconstellations1.dds skyrimconstellations2.dds to make the constellations stand out better against the night sky, by making the tiny indecipherable stars of the major constellations larger and brighter.",
  "descriptionHtml": "This mod changes the skyrimconstellations1.dds skyrimconstellations2.dds to make the constellations stand out better against the night sky, by making the tiny indecipherable stars of the major constellations larger and brighter.\r\n\r\nFancying myself a bit of an amateur cartographer, I was thrilled when I learned that in Skyrim, at long last, constellations would return to the Aetherius. What better way to get the most of that fanseh cloth map than to turn off the compass and quest markers, and rely on the heavens to guide me on my latest journey through the land of Tamriel? Reading the sun Magnus took some getting used to, as it actually rises and sets a few degrees north of east and west (does this mean that Tamriel is on the Southern hemisphere of Nirn? Why is the north colder, then? Enigma!), but eventually I got the hang of it. The real problem came at night when The Aetherius, beautiful as it was, failed to present me with any distinguishable characteristics to discern direction. What a disappointment after all of the anticipation of stargazing and constellation hunting! The moons Masser and Secunda seemed to rise in the extreme north east and set in the far south east, so by keeping them on your right you could theoretically tell which direction was north, but not with any real accuracy. This simply wouldn\\'t do. So I made this mod. \r\n\r\nFor now, it\\'s a work in progress, but since I\\'m by no means an artist, I don\\'t intend to put much more into it, when it functions well enough to allow me to enjoy playing the game. Instead I\\'m just putting it out there without the bells and whistles, and maybe some of the more creative amongst you will be inspired to improve on it, maybe adding a bit more colour or shape to the stars (I only used plain light blue dots of varying size which still looks fine on ultra settings, but could be made to look so much better).\r\n\r\nNotes :\r\n\r\nI didn\\'t edit the actual shape of the constellations at all. They\\'re still vanilla and mesh with the lore. \r\n\r\nThe Dwemer Star Map some of you may be familiar with is mostly accurate (Gasp! A printout of that on some canvas paper + the preorder cloth map = magic!). \r\n\r\nThe raised hand of The Mage constellation acts as a sort of north star. It is approximately 2 degrees west of north, so if you can find the mage constellation at night, you can see roughly where north is.\r\n\r\nI recommend using one of the enhanced sky mods. They look great and otherwise the constellations might stand out too much (with vanilla sky).\r\n\r\nInstallation :\r\n\r\nExtract .zip and merge with Data folder, you know the drill. If these textures were deleted, I\\'m pretty sure the game would revert by default to vanilla textures without a problem, but you may want to backup your files before installing just in case. As always, I take no responsibility if this mod crashes your game, destroys you computer, steals your dog, etc. but there shouldn\\'t be any problems, and it should jive with other mods unless they edit the skyrimconstellations1.dds and skyrimconstellations2.dds in your game > Data > Textures > Sky folder.\r\n\r\nFeel free to use this mod for inspiration or resources, or anything else as long as it isn\\'t uploaded to any pay site, but please give me credit, and as always support The Nexus!",
  "categoryId": "74",
  "version": "1",
  "author": "SpookyJ",
  "createdUnix": "1322454487",
  "updatedUnix": "1322455302",
  "containsAdultContent": false,
  "uploadedBy": "spookyjohnathan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "4778",
      "name": "SpookyJs Slightly Improved Constellations",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24",
      "fileName": "SpookyJs Slightly Improved Constellations-1832-1.zip",
      "uploadedUnix": "1322455302",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ea174e199078df93be237874548e44b4b490132ea0e352ed389ab60f0e55fcc2/analysis/1406457903/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SpookyJs%20Slightly%20Improved%20Constellations-1832-1.zip?fid=4778&ttl=1535755651&ri=8192&rs=8192&setec=0d907313866020b8888428dd647a4ff7"
    }
  ]
}