{
  "modId": 18328.0,
  "modName": "A mace of power",
  "summary": "A mace that makes people fly, with a story.\r\nFull of physics engine ragdoll goodness.",
  "descriptionHtml": "You love the physics engine? Love to see those ragdolls fly as you pummel your way through a town? Well you\\'ve come to the right place.\r\n\r\nNOTICE: Read at least one of the books before picking up the mace. (actual read not skyrim read = open, close)\r\n\r\nThis mod is for 2 types of players:\r\n1) The run and murder everyone style player ( Will love this weapon )\r\n2) Someone who wants an extra storyline and is willing to read a little.\r\n\r\nThis features a mace Bazhun (Wrath weapon in the language of the dragons). The mace has an interesting little twist, it makes people fly as you hit them just like the werewolf hit, now in a weapon!\r\n\r\n[ABOUT]\r\nI don\\'t know if this has been made before but bleh, well if you enjoy it comment/endorse.\r\n\r\nI am working on a quest line at the moment as well, but I am busy with exams etc etc.. Will have dungeons and more story, but a lot of literature probably so if you\\'re the type of gamer who likes reading story then that will be for you.\r\n\r\nThe quest line will explain who Indoro\\'al is to Skyrim and more information about the Bazhun, but the story will revolve around Indoro\\'al. It will feature dungeons and probably a bigger battle.\r\n\r\n[LOCATION]\r\n(I just discovered that somehow he also travels Skyrim killing travelers so if he is not on the location at the picture you may encounter a posessed orc on your travels)\r\n\r\nNear Riverwood, towards Whiterun. The place where you go up to Bleak Falls Barrow with the wolves. See on the pictures for the exact location.\r\n\r\nAlso a word of warning, this weapon is quite powerful so if you just started out and are lvl 1, you\\'ll probably get smited since you have to fight for the weapon.",
  "categoryId": "55",
  "version": "1.0",
  "author": "AxilioN",
  "createdUnix": "1339006161",
  "updatedUnix": "1339006312",
  "containsAdultContent": false,
  "uploadedBy": "Axilion",
  "primaryFile": null,
  "files": [
    {
      "fileId": "66377",
      "name": "Bahzun",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Bahzun-18328-1-0.rar",
      "uploadedUnix": "1339006312",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cd3498efb4e2235c117fbc8e4bea1c4e61ca6a7e788230373372f053ec82d2c2/analysis/1406943004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bahzun-18328-1-0.rar?fid=66377&ttl=1535785100&ri=8192&rs=8192&setec=c52bb30c2799f1b98e37c603e8486166"
    }
  ]
}