{
  "modId": 18338.0,
  "modName": "Lotr Wandering Nazgul Stay off the Roads",
  "summary": "This Mod adds the Nine Nazgul Wandering the roads of Skyrim with the single purpose of slaying the Dovahkiin!",
  "descriptionHtml": "Wandering Nazgull Stay off the Roads Update 1\r\n\r\nNEW FEATURES AND CHANGES:\r\n\r\nThe Nazgul Black Breath is now a shout instead of being\r\na spell; it does 50 points of damage for 5 seconds, \r\nparalizes for 3 seconds and causes fear up to level 31 for\r\n60 seconds and has a time recovery of 30.\r\n\r\nGuards are now enemies and will attack the Nazgul.\r\n\r\nBandits are now allies and creatures are neutral.\r\n\r\nThe Nazgul are now stronger and share the same stats has \r\nthe Dragons from the vanilla game.\r\n\r\nYou have now nine different rings to collect from the nazgul;\r\neach with its own enchantment.\r\n\r\nThe Witch King has now a different outfit to stand out from\r\nthe other Nazgul and it also carries an enchanted crown and\r\na mace.\r\n\r\nThe Morgul Blade now when striking causes 10 points of damage\r\nfor 60 seconds and its victim when hit will now turn into a\r\nghost figure or wraith as long as the enchantment lasts.\r\n\r\nI Hope you all enjoy the new changes in this new update and\r\nonce again don\\'t forget to comment about the mod and give \r\nideas or constructive critics to help the mod improve.\r\nAlso if you really like this mod don\\'t forget to endorse;\r\nits always nice to know that your work was not in vain.\r\n\r\n\r\nInstalling the mod is very simple; just place the data folder\r\nin your skyrim folder and check if the WanderingNazgul.esp is\r\nactivated in your data files menu.\r\nIf you have the previous version just overwrite the old files.\r\n\r\nIMPORTANTE: IF YOU HAVE DOWNLOADED THE PREVIOUS VERSION YOU MUST FIRST DEACTIVATE THE OLD MOD AND MAKE A CLEAN SAVE AND THEN OVERWRITE THE OLD FILES FOR THE NEW ONES AND CONFIRM IF THE NEW ESP FILE IS ACTIVATED SO THAT THE DIFFICULTY CHANGES AND SCRIPTING ARE APPLIED IN YOUR NEW SAVE.\r\n\r\nWandering Nazgul Stay of the Roads Mod:\r\n\r\n1 - Introdution\r\n\r\n2 - Mod Features\r\n\r\n3- Installation\r\n\r\n4 - Future of the mod\r\n\r\n5 - Credits\r\n\r\n\r\n1 - Introduction: First of all thanks for downloading and i\r\nhope you enjoy playing the mod;has i did creating and playing\r\nit has well. Since i\\'m working on my nazgul race mod; has\r\ni did for oblivion i rememberd that there was also a\r\ngreat mod that was called wandering nazgul for oblivion;\r\nand imagined that a remake of this mod would great for \r\nskyrim and for the lotr fans has i am.\r\nSo after two weeks of working on my spare time i managed to\r\nfinish it.\r\n\r\n2 - Mod features: This mod adds the nine nazgul to skyrim,\r\n and thei\\'re objective is to wander skyrim and kill you.\r\nI\\'ve think i managed to make them cover almost all of \r\nSkyrim, so be on the look out.\r\nThey are powerfull creatures but have different levels; so\r\nthere will be stronger and weaker nazgul; this will depend\r\nalso on your level, but they have minimal and maximal levels;\r\nso if you are low level you can also encounter a very powerfull\r\nnazgul or even the witch king who is the most powerfull of course. \r\nEach one will have it\\'s one loot except for they\\'re remains.\r\nHas for they\\'re gear; they have Nazgul steel sword and dagger that\r\nhave ebony stats. The steel dagger\\'s have an enchantment\r\nthat damagesyour fatigue to give the feel of the morgul \r\nblade; and the witch king\\'s sword has a fire damage enchantment.\r\nThis weapons are vanilla for now but has i get permition of\r\nother modders to use they\\'re work has a resource for the mod\r\ni will update the mod. \r\nThey will mostly travel by horse, but you can also encounter\r\nthem on foot.\r\n\r\nIMPORTANT: The Textures will replace the vanilla Greybeards\r\nRobes changing they\\'re color to Black.\r\n\r\n3 - Installation: Installating the mod is very easy; just \r\nplace the files  on your skyrim data folder and activate\r\nthe Wandering Nazgul esp file. If you have my nazgul race\r\nmod don\\'t be suprised if the computer asks you if you want\r\nto overwritte the existing files, because this mod shares\r\nsome of the same files.\r\n\r\n4 - Future of the mod: I will try to update it in any way\r\ni can; and if someone is interested in helping in updating\r\nthis mod send me a message.\r\nAlso i would like for you to give me feedback about the mod,\r\nin order for me to have an idea of what is your opinion on\r\nit. If you really enjoyed the mod don\\'t forget ot endorse.\r\n\r\n5 - Credits: I Give credits go to Solo 077 for original\r\nidea of the mod.\r\n\r\n\r\n ",
  "categoryId": "83",
  "version": "",
  "author": "Sergeynest",
  "createdUnix": "1339016646",
  "updatedUnix": "1345209456",
  "containsAdultContent": false,
  "uploadedBy": "Sergeynest",
  "primaryFile": null,
  "files": [
    {
      "fileId": "66433",
      "name": "Wandering Nazgul Stay off the Roads",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8648",
      "fileName": "Wandering Nazgul Stay off the Roads-18338-1.rar",
      "uploadedUnix": "1339026105",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a5591022aa28265ddaa52e9cd057bb37926fb36a895c6541acddd7f4f35f0e34/analysis/1406943675/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wandering%20Nazgul%20Stay%20off%20the%20Roads-18338-1.rar?fid=66433&ttl=1535785113&ri=8192&rs=8192&setec=2ea567e7674bd51c05001045ff207571"
    },
    {
      "fileId": "82224",
      "name": "Wandering Nazgul Stay off the Roads Update 1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9637",
      "fileName": "Wandering Nazgul Stay off the Roads Update 1-18338-1.rar",
      "uploadedUnix": "1345209456",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/1e40e4edbfe0d40e77ed0d8715e714183b12254976137a82892b9ca020014fd9/analysis/1407102907/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wandering%20Nazgul%20Stay%20off%20the%20Roads%20Update%201-18338-1.rar?fid=82224&ttl=1535785114&ri=8192&rs=8192&setec=ec04c8745190e07cc0d243da637cea53"
    }
  ]
}