{
  "modId": 18340.0,
  "modName": "General Stores - storage resource for packrats",
  "summary": "General Stores provides a cloud storage layer for Skyrim with a wide variety of powerful access activators.  Incredibly easy to use and makes inventory management a joy!  Weapons, Soulgems, Books, Ore, virtually everything a packrat NEEDS can be stored and accessed from anyplace you call home.  ",
  "descriptionHtml": "[Center][Img]http://skyrim.nexusmods.com/mods/images/18340-1-1339200860.jpg[/img][/Center]\r\n[size=3][center][color=yellow][b][i]A modder\\'s resource for fast, safe, storage from anywhere in Skyrim.[/i][/b][/color][/center][/size]\r\n\r\n[heading][color=Springgreen]Latest News[/color][/heading]\r\n\r\nv2.3 is the end of development for General Stores.  Smoothed over what I thought were the remaining rough spots in the mod, leaving it stable and balanced.  Hope you all put it to good use.\r\n\r\nIf you enjoy [URL=http://skyrim.nexusmods.com/mods/25422]Craftable Cloud Storage[/url], a compatible update is now available.  Newly available DLC compatibility patches allow seamless use of DLC extensions with CCS.\r\n\r\nI started playing around with Dawnguard and have posted my tweaks as [URL=http://skyrim.nexusmods.com/mods/30221]DawnGuard(GS)[/url].  If you are familiar with GS you probably know what to expect, but there are a few specials like instant classification of all new content and an uber-sweet Paragon display.  Go check it out.\r\n\r\nI have updated [URL=http://skyrim.nexusmods.com/mods/25154]Hearthfire Automated Storage [/url] for compatibility with GS 2.3  For both my faithful users, be sure to clean out the old scripts as directed for best results.\r\n\r\nAnyone using a combination of CCS, DG, or HF should install one of the new compatibility patches.\r\n\r\nFor intuitive keyboard control of menu\\'s, I highly recommend ecirbaf\\'s [URL=http://skyrim.nexusmods.com/mods/28170]Better MessageBox Controls[/url] \r\n\r\n[heading][color=Springgreen]What is it?[/color][/heading]\r\n\r\nGeneral Stores adds a cloud storage layer to Skyrim.  12 Primary Storage Lockers provide secure, cross-mod storage, accessible through a wide variety of highly automated and attractive activators. These activators function just like regular chests in-game, with many styles to fit any decor and playing style.  Whether you want OCD levels of dedicated containers, a single autosort chest, or even a fully outfitted underground storage room, General Stores has you covered.\r\n\r\n[heading][B][Center]All resources in this mod can be implemented with drag and drop simplicity.  Absolutely NO scripting is required.[/center][/B][/heading]\r\n\r\n[list][*] Scripted access gives superfast menu-diven bulk transfers to and from your inventory.  Open an alchemy activator and with two clicks you\\'ve stored all the ingredients you are carrying.  Trudge across the breadth of Skyrim unencumbered to another home with an alchemy activator and with two clicks have immediate access everything previously stored.  \r\n[/list]\r\n[list][*] Activators can be placed anywhere in any mod as many times in as many places as you care to, allowing direct access to your supplies from everywhere in the known universe.  Multiple styles of activators are provided for each storage Type giving you more flexibility in layouts.  Some are meant to sit on shelves, others floor standing.  Different meshes, identical access.  All can be re-sized to fit your needs.  Custom activator styles are easy to create as well.\r\n[/list]\r\n[list][*] Heuristic Learning Containers adapt to all DLC and mod added items.  Once stored, new items are recognized and supported for sorting and bulk transfers.  FINALLY, repetitive stress has been banished forever!\r\n[/list]\r\n[list][*] Dedicated activators for each storage Type emphasize world interaction.  This is no one button rinse cycle.  You go to your Crafting Stores to manage your crafting supplies.  You have your Enchanting Stores near [U]all[/u] your enchanting tables.  You can put a Potion Stores next to your alchemy station for brewing and another by the door to stock up before adventuring.  You interact with your environment efficiently, making inventory management engaging and immersive, not RSI inducing tedium.  \r\n[/list]\r\n[list][*] Of course if you prefer a one button rinse cycle, General Stores has that too.  Literally.  And a General Stores Master Chest which features autosorting and access to everything from a single activator.\r\n[/list]\r\n[list][*] If you have any modding skills at all, you can add General Stores to ANY mod in 12 minutes or less.  Really.  Just drag activator objects to where you want them, save and go play.  CK does a pretty good job at initial object placement.  Perfection, as you are no doubt aware, takes somewhat longer.\r\n[/list]\r\n[heading][color=Springgreen]12 Primary Lockers:[/color] [B]Dedicated activators provide menu-driven access[/b][/heading]\r\n[list][*][color=Darkturquoise]Books & Papers Library[/color] \t: Store All, Store One Copy, Gather Spell Tomes, Browse Library, Exit\r\n[/list]\r\n[list][*][color=Darkturquoise]Crafting Stores[/color]       : Store All, Smithing, Smelting, Tanning, Gemstones, Exit\r\n[/list]\r\n[list][*][color=Darkturquoise]Food Stores[/color] \t        : Store All, Store Raw, Pantry, Cooked Foods, Raw Foods, Spices, Exit\r\n[/list]\r\n[list][*][color=Darkturquoise]Alchemy Stores[/color]  \t        : Store All, Keep one, Take Cooking Items, Inspect Stores, Exit \r\n[/list]\r\n[list][*][color=Darkturquoise]Scroll Stores[/color]  \t        : Store All, Keep One, Keep Three, Inspect Scrolls, Exit \r\n[/list]\r\n[list][*][color=Darkturquoise]Potion Stores[/color]\t\t: Store All, Buffs, Poisons, Restoratives, Distillation, Liquid Assets, Exit\r\n[/list]\r\n[list][*][color=Darkturquoise]Enchanting Stores[/color]\t\t: Stash Grand Souls, Stash Gems, Grab Empties, Soul Fusion, Check Stash, Exit\r\n[/list]\r\n[list][*][color=Darkturquoise]Armor Stores[/color]\t\t: All Armor, Heavy, Light, Unarmored, Shields, Unclassified, Exit \r\n[/list]\r\n[list][*][color=Darkturquoise]Weapon Stores[/color]\t\t : All Weapons, One-Hand, Two-Hand, Archery, Staffs, Unclassified, Exit\r\n[/list]\r\n[List][*][color=Darkturquoise]Stolen Goods[/color] \t\t        : (No Menu or Type restrictions)\r\n[/list]\r\n[list][*][color=Darkturquoise]Treasures[/color]\t\t: (No Menu or Type restrictions)\r\n[/list]\r\n[list][*][color=Darkturquoise]Follower\\'s Gear[/color]\t\t: (No Menu or Type restrictions)\r\n[/list]\r\n[heading][color=Springgreen]Minimalist Activators:[/color] [B]Maximum access with a minimal footprint[/b][/heading]\r\n[B][color=Darkturquoise]Unburden Fountain (one-click rinse cycle)[/color][/b] - Unloads and sorts all crafting, alchemy, filled grand souls, books, and raw foods\r\n\r\n[B][color=Darkturquoise]General Stores Master Chest:[/color] - Single activator with access to [U]everything[/u][/b]\r\n[list][*] [U]Unburden[/u] - Same as Unburden Fountain above\r\n[*] [U]Autosort[/u] - Add any items to a single chest and they will autosort to appropriate lockers.\r\n[*] [U]Manual Inspection[/u] - Menu driven direct access to all 12 lockers plus Armor and Weapon OCD sets\r\n[*] [U]Stash Cash[/u] - Store your extra gold in the Treasures locker\r\n[/list]\r\n[B][color=Darkturquoise]Storage Cistern Trapdoor[/color][/b] - Adds access to a lore friendly storage cistern which can be placed under any building. Access to all 12 locker and all OCD sets. While the Trapdoor may look and function as a door, it is actually an activator so you can drag/drop it and not worry about setup and Navmesh.  Sorry, no followers.\r\n\r\n[heading][color=Springgreen]OCD Container Sets:[/color] [B]Direct access to lower level sorting synched with the primary lockers.[/b][/heading] \r\n[B]Pantry Set for Food Stores:[/b] (3 styles)\r\n[list][*] [color=Darkturquoise]Raw Foodstuffs [/color] \r\n[*] [color=Darkturquoise]Prepared Foodstuffs [/color]\r\n[*] [color=Darkturquoise]Salt and Ingredients[/color] (items shared with alchemical stores)\r\n[/list]\r\n[B]Workshop Set for Crafting Stores:[/b] (2 styles)\r\n[list][*] [color=Darkturquoise]Smithing[/color] \r\n[*] [color=Darkturquoise]Smelting[/color] \r\n[*] [color=Darkturquoise]Tanning[/color] \r\n[/list]\r\n[B]Potion Set: [/b](2 styles)\r\n[list][*] [color=Darkturquoise]Buffs[/color] \r\n[*] [color=Darkturquoise]Poisons[/color] \r\n[*] [color=Darkturquoise]Restoratives[/color] \r\n[/list]\r\n[B]Armorer Set: [/b](2 styles)\r\n[list][*] [color=Darkturquoise]Heavy Armor[/color] \r\n[*] [color=Darkturquoise]Light Armor[/color] \r\n[*] [color=Darkturquoise]Shields[/color] \r\n[*] [color=Darkturquoise]Unarmored[/color] \r\n[/list]\r\n[B]Weapons Set: [/b](rack style only)\r\n[list][*] [color=Darkturquoise]One-Handed[/color] \r\n[*] [color=Darkturquoise]Two-Handed[/color] \r\n[*] [color=Darkturquoise]Archery[/color] \r\n[*] [color=Darkturquoise]Staffs[/color] \r\n[/list]\r\n[heading][color=Springgreen]Special Bonus Activators:[/color][/heading]\r\n[Center][Img]http://static.skyrim.nexusmods.com/mods/images/18340-1-1339428099.jpg[/img][/Center]\r\n\r\n\t[color=Darkturquoise]Dragon Claw Displays[/color] - Placeable Dragon Claw displays are a resource for more advanced modders. While placed like storage activators, the modder must set a script property for proper function.  If you can do vanilla racks, these are [U]much[/u] easier!  Placed claws are Havok immune until picked up by the player.\r\n\r\n\t[color=Darkturquoise]Bug Jar Displays[/color] - Placeable Bug Jar displays are another resource for more advanced modders. They function identically to the dragon claw displays, except they display the bug jars.  You still need to set a property on these.\r\n\r\n\t[color=Darkturquoise]Alchemists Mortar[/color] - A placeable Mortar & Pestle scripted to grind Mammoth Tusks into powder and skulls into bonemeal. Yes its a little OT, but I stumbled across a stack of these rummaging around Anise\\'s basement so I thought I\\'d throw one in as a bonus while supplies last.\r\n\r\n\t[color=Darkturquoise]Panic Button[/color] - A dwemer button located in the cistern can be used to correct problems with your game.  Using this activator will remove all user-added items from the formlists used for sorting and return those items to player inventory if stored.  This can be used to reset misidentified items or solve problems caused by disabled mods.  Use with caution.\r\n\r\n[heading][color=Springgreen]Compatibility:[/color][B] No worries, Mate![/b][/heading]\r\nThe GeneralStores.esm master has only a microscopic footprint, adding a small amount of new content walled off from the rest of the game.  By itself, it makes no changes to nor has any interaction whatsoever with anything in Skyrim.  All items stored during gameplay are held by the esm, NOT by esp applications.  \r\n\r\n[color=yellow][Center][B]So long as GeneralStores.esm remains active, it will continue to safeguard your valuable gear.[/b][/center] [/color]\r\n\r\nBottom line is this master will not cause conflicts and it CANNOT lose your stuff.  Compatible mods can be reset or swapped around at will with complete peace of mind.  If heaven forbid a patch file you are tweaking goes bad, the demo or any compatible mod can be activated to regain immediate access to your stores.  Anytime.  Anywhere.  You can\\'t buy that kind of security, but you can download it here for free.\r\n\r\n[heading][color=Springgreen]Heuristic Learning Containers:[/color][B]The ultimate in compatibility[/b][/heading]\r\nNo matter what mix of mods you chose, General Stores can adapt.  All storage (except soulgems) is configured to learn new items as you store them.  Items already stored in primary lockers may not be recognized until removed and re-stored.  Some containers support re-classification if you mess up.\r\n\r\n[B][U]Autosorter:[/b][/u]\r\nThe autosorter classifies items based on keywords if available.  Artifacts, named weapons, and special armor are autosorted as Treasures. Auto-classification of Food and Crafting items is limited due to game restrictions.  Unclassified items are returned to the autosorter chest, so always check back after sorting completes.  These items may be classified by directly adding to primary lockers or OCD sets.  \r\n\r\n[B][U]Weapons, Armor, Books, Scrolls, Potions, Ingredients:[/b][/u]\r\nAuto-classified when added to primary lockers or autosorted.\r\n\r\n[B][U]Food:[/b][/u]\r\nThe Foodstores primary locker is not heuristic.  Use the OCD Pantry set to classify new food items.  Alchemy ingredients used for cooking can be classified as well.\r\n\r\n[B][U]Crafting:[/b][/u]\r\nThe Crafting Stores primary locker is not heuristic.  Use the OCD workshop set containers to classify new crafting items.\r\n\r\n[B][U]Armor:[/b][/u]\r\nUnclassified armor can be viewed from the menu and manually added to the appropriate OCD container.\r\n\r\n[B][U]Weapons:[/b][/u]\r\nUnclassified weapons can be viewed from the menu and manually added to the appropriate OCD container.\r\n\r\n[heading][color=Springgreen]How to install:[/color][/heading]\r\nOpen the archive and copy [color=yellow][B]GeneralStores.bsa[/b][/color] and [color=yellow][B]GeneralStores.esm[/b][/color] to your \\\\data directory. Do not copy any of the folders.  Enable GeneralStores.esm in the launcher of your choice.  Load order doesn\\'t really matter. BOSS will recognize and place the GeneralStores.esm\r\n\r\n[Center][B]If you have been linked here from another mod requiring General Stores, you are done!  Go and explore your new home.[/Center][/B]\r\n\r\nIf you want to use the sample house mod, go to the [color=Darkturquoise]\\\\Optional Sample Home Mod[/color] folder and copy [color=yellow][B]AnisesCabin(GS).esp[/B][/color] to your \\\\Data directory. This mod will add access to a ton of storage from Anise\\'s cabin (west of Riverside), a wretched shack you can move into early in the game. You still have to kill Anise, but you know you want to.\r\n\r\nFor insights on how to use this mod with the Creation Kit, browse the [color=Darkturquoise]\\\\HelpfulHowtoScreenshots[/color] folder for some helpful, how-to screenshots.\r\n\r\nIf you are a modder and you are seeing [color=#FF0000]<[/color][b][color=#FFFFFF]![/color][/b][color=#FF0000]>[/color] in the Creation Kit , go to the  [color=Darkturquoise]\\\\Optional Unpacked BSA Files[/color] folder and copy the meshes, scripts, and textures folders to your \\\\Data directory.  Accept all overwrite notices.  They are safe.\r\n[heading][color=Springgreen]Real Estate Shopping?[/color][/heading]\r\n[B]All of these fine homes are [U]perfect[/u] for packrats. Best of all, your stuff is already moved in![/b]\r\n\r\n[List]\r\n[*] [URL=http://skyrim.nexusmods.com/mods/15272]Skyrim Adventurer\\'s Tent [/url] by HerrBaron \r\n[*] [URL=http://skyrim.nexusmods.com/mods/19297]Niire\\'s Honeyside [/url] by Niire \r\n[*] [URL=http://skyrim.nexusmods.com/mods/19690]Niire\\'s Proudspire [/url] by Niire \r\n[*] [URL=http://skyrim.nexusmods.com/mods/19974]Niire\\'s Hjerim [/url] by Niire \r\n[*] [URL=http://skyrim.nexusmods.com/mods/20023]Dovahkiins Basement[/url] by kuhlserv \r\n[*] [URL=http://skyrim.nexusmods.com/mods/10340]Castle Dovah-WIP[/url] by Aralore \r\n[*] [URL=http://skyrim.nexusmods.com/mods/22147]Geir Manor[/url] by Jackrabb1t \r\n[*] [URL=http://skyrim.nexusmods.com/mods/25282]Breezehome[/url], [URL=http://skyrim.nexusmods.com/mods/25283]Honeyside[/url], [URL=http://skyrim.nexusmods.com/mods/25236]Proudspire[/url],  [URL=http://skyrim.nexusmods.com/mods/25316]Vindral Hall[/url] by elGrecoLoco \r\n[*] [URL=http://skyrim.nexusmods.com/mods/25364]Fort Dawnguard[/url] and [URL=http://skyrim.nexusmods.com/mods/25343] Hearthfire[/url] by funkfanatic \r\n[*] [URL=http://skyrim.nexusmods.com/mods/25306]Auogrimr[/url] by Bullfye\r\n[*] [URL=http://skyrim.nexusmods.com/mods/25526]General Stores for Winterhold Students[/url] by quantumbutterfly\r\n[*] [URL=http://skyrim.nexusmods.com/mods/25947]A More Organized Luxury Suite feat General Stores[/url] by Natilde\r\n[*] [URL=[http://skyrim.nexusmods.com/mods/23915]WitchRaven Barrow[/url] by The Vampire Dante\r\n[*] [URL=http://skyrim.nexusmods.com/mods/26016]Shezries Lakeview Hearthfire Kitchen[/url] by Shezrie\r\n[*] [URL=[http://skyrim.nexusmods.com/mods/28228]Solitude Tree House Shack[/url] by Mentha\r\n[*] Don\\'t forget the optional homes on this page, [URL=http://skyrim.nexusmods.com/download/68362]Asteria Airship - General Stores Edition[/url] and [URL=http://skyrim.nexusmods.com/download/99854]Harveys Honeyside[/url].\r\n[/list]\r\n\r\nIf you are planning on modding Hearthfire, [URL=http://skyrim.nexusmods.com/mods/25154]\tHearthfire Automated Storage [/url] provides excellent baseline extensions.\r\n\r\nFor the ability to add activators dynamically while playing, \r\n[List]\r\n[*] [URL=http://skyrim.nexusmods.com/mods/25422]Craftable Cloud Storage[/url] by Harvey2112 \r\n[/list]\r\n\r\nSprechen sie Deutsch? Pandur79 hat eine [URL=http://skyrim.nexusmods.com/mods/21486]Übersetzung[/url].\r\n\r\n[heading][color=Springgreen]Changelog:[/color][/heading]\r\nAll versions are backwardly compatible.  Items stored under earlier versions are fully accessible under later releases.\r\nWhen updating, always clear out loose files (filter scripts on xGSx and delete).  Always keep GeneralStores.esm enabled.\r\n\r\nv2.3 Final, final update \r\n\r\n - Foodstores menu revised: [Store All, Store Raw, Pantry, Cooked Foods, Raw Foods, Spices, Exit]\r\n - Craft store menu revised:[Store All, Smithing, Smelting, Tanning, Gemstones, Exit]\r\n - New Potion stores activator:  Crate & Barrel\r\n - New Food stores activator:  Crate & Barrel\r\n - New Autosort activator:  Direct access to the autosort chest without using the master chest menu.\r\n - Revised \\\"Soul Fusion\\\" menu adds the capability to fuse soulgem fragments into a black soulgems.\r\n - Revised Potion \\\"Distillation\\\" algorithm fixes inconsistencies and ties availability to player level\r\n - Master chest \\\"Stash Cash\\\" menu adds \\\"Fast Cash\\\" option to retrieve 2000 gold.\r\n - Certain quest related books removed from autostore (\\\"favor\\\" books and Elder Scrolls)\r\n - Unburden no longer automatically stores scrolls\r\n - Enchantment Stores \\\"Grab Empties\\\" no longer retrieves soulgem fragments\r\n - Display stand scripts re-written again so things don\\'t drop and roll around before being placed.\r\n - More NIF optimization\r\n\r\nv2.21 [S]Final update[/s]  \r\n\r\n - Completely re-written potion handling.  Much faster on player brews.\r\n - Revised Potion Menu [Store All, Buffs, Poisons, Restoratives, Distillation, Liquid Assets, Exit]\r\n - New Potion OCD sets:  Buffs, Poisons, Restoratives (featuring bottles by exray catt)\r\n - Revised Gem Stores menu [Stash Grand Souls, Stash Gems, Grab Empties, Soul Fusion, Check Stash, Exit]\r\n - Dragon Claw displays now WORK for EVERYONE!  Claws will lose \\\"quest\\\" status so be careful with them.\r\n - Panic Button activator added to cistern.  Use with caution to reset new user added items from sorting.\r\n - Cistern display stands now have unique reference IDs (not MyClawDisplay etc.).\r\n - Limited navmesh added to cistern to support wayward followers such as Vilja who insist on following you in.\r\n - Anise\\'s Cabin updated to add Potion OCD bottles to alchemy workstation.\r\n\r\nv2.13 [S]Final update[/s] \r\n\r\n - Potions menu adds \\\"Distill Restoratives\\\" which consolidate lesser restore potions into stronger brews.\r\n - SoulGems menu adds \\\"Soul Fusion\\\" which consolidates smaller souls into available larger unfilled gems.\r\n - New effects for Dragonclaw display stands.\r\n - New effects for Bugjar display stands.\r\n - New effect for One-Click Rinse.\r\n - Updated Soulgem Box now floats a lesser gem instead of jewel.\r\n - Cistern adds a light toggle for a brighter option.\r\n - Updates MammothMortar to Alchemist Mortar - Grinds skulls into bonemeal as well.  Model slightly smaller.\r\n - Smithing Stores renamed Crafting Stores.  OCD Craft set now OCD Workshop set.\r\n - AnisesCabin(GS) sample home updated\r\n - minor tweaks and fixes.\r\n\r\nv2.0 Major update \r\n - Heuristic learning containers automatically adapt to DLC and Mod added content.\r\n - OCD Pantry Set for Foodstores - Raw, Prepared, Salt&Ingredients\r\n - OCD Craft set for Smithing Stores - Smithing, Smelting, Tanning\r\n - OCD Armorer set - Heavy, Light, Shields, Unarmored\r\n - OCD Weapons set - One-Hand, Two-Hand, Archery, Staffs\r\n - One click rinse cycle - unloads all smithing, ingredients, books, scrolls, grand souls and raw foods\r\n - General Stores master chest - features includes unburden, autosort, menu access to lockers and gold storage.\r\n - Storage Cistern - Placeable trapdoor provides access to pre-built storage room.\r\n - Books menu adds \\\"Gather Spelltomes\\\" option.\r\n - New Menu for Armor Stores.\r\n - New Menu for Weapon Stores.\r\n - New Bug Jar Display\r\n - Unique activator sounds added.\r\n - Various and sundry enhancements.\r\n\r\nv1.5 minor update\r\n - New Potion Stores Menu (HUGE HT to Sollar for making this possible)\r\n - New Bug Jar Display Racks - Noble and Ruins\r\n - Minor tweaks\r\n - All meshes optimized for stability and reduced load.\r\n - BookStack Mesh fix (HT @berticus0001)\r\n - Gemstand textures now included (reduced size transparent textures from tyco1709)\r\n - Screenshots removed from distribution.  View them here instead.\r\n\r\nv1.4 minor update\r\n - New storage locker for Magical Staffs\r\n - New rack activator for Weapon stores\r\n - New rack (dummy) activator for Armor stores\r\n - Spelling correction on Smithing Stores menu\r\n - Desktop books activator made fully static\r\n - Scroll rack activator made fully static\r\n - Scroll stand activator trimmed to facilitate stacking and packing.\r\n - Updated scripts properly close containers.  Big thanks to HerrBaron for the fix.\r\n\r\nv1.3 minor update\r\n - Dragon Claw display stands added\r\n - Smithing stores menu revised.  Now:  Store All, Grab Smithing, Grab Smelting, Grab Tanning, Inspect Stores\r\n - Internal naming standardized (more or less).\r\n - New activators for Food, Smithing, Scrolls, and Stolen Goods based on outstanding meshes from Oaristys\r\n - All StolenGoods activators updated with gems.\r\n - Alternative mesh for Treasures added.\r\n - Minor updates to AnisesCabin(GS).esp.\r\n\r\n9June2012 \r\n - Compatibility patch added to Optional Files: Asteria Airship - General Stores Edition\r\n\r\nv1.2 minor update\r\n - GemStand havok corrected and transparency added to gems\r\n - Re-stuctured object naming for ease of use.\r\n - New treasure chest activators\r\n - New bookshelf style activators for books, smithing and potions \r\n - Minor compatibility tweaks for AnisesCabin(GS)\r\n - BSA cleaned and compressed.\r\n\r\nv1.1 minor update\r\n - Adds 4 new storage lockers; Armor, Weapons, Follower Gear, and Treasures\r\n - Adds 2 new activators for smithing and alchemy\r\n - updates AnisesCabin(GS) demo mod with access to the new lockers.\r\n - Rebuilt BSA now useable for gameplay.\r\n - Optional unpacked BSA files added to main package.  BSA handling in CK seems wonky of late. \r\n\r\nv1.0 Initial release\r\n[heading][color=Springgreen]How it works:[/color][/heading]\r\nGeneralStores.esm is a master file that adds an inaccessible cell containing 12 storage lockers dedicated to specific inventory types. Each storage locker is referenced by one or more activator objects using scripts. FormLists are heavily used to identify the Type and to drive the various bulk-transfer menu functions. Keywords (if available) are used to add new items to the formlists. Directly adding new items to storage lockers will update Formlists as well.\r\n\r\nDragon Claw (and Bug Jar) displays function similarly to the vanilla rack displays. On activation, claws are removed from player inventory, dropped (for reference), then placed to the correct node on the display rack. Havok is suspended on the claws while displayed, but the claws may still be picked up by the player.\r\n[heading][color=Springgreen]How to Use:[/color][/heading]\r\nFor modders, here\\'s some simple steps:\r\n\r\n1)  Backup the mod you are editing!!  For best results, create a new copy, i.e. MyHouseMod(GS).esp and edit that.\r\n\r\n2)  Be sure Creation Kit is multi-master enabled (Google \\\"bAllowMultipleMasterLoads=1\\\").  Select the GeneralStores.esm and set your house esp to active.  If you wish to edit vanilla locations, make no active selection.\r\n\r\n3)  In cell view, open the house cell you wish to add containers to.\r\n\r\n4)  In object view, filter on \\\"xGSx\\\" (without quotes) and select activators.\r\n\r\n5)  Select an activator and drag/drop it into your cell.  Fiddle with placement until you are happy.  Repeat as desired.\r\n\r\n6)  Double check that you placed only [b]ACTIVATORS[/b] and not [b]CONTAINERS[/b] (check usage counts).  If you place new instances of the containers, your mod will not work.  There can be only one.\r\n\r\n7)  Save, exit and enable in your launcher.\r\n\r\n8)  Go explore your upgraded home.  \r\n[heading][color=Springgreen]Advanced usage tips:[/color][/heading]\r\n* Placing Dragon Claw displays requires two additional steps beyond simple drag and drop.  First, you must name the display object you placed in your cell (use [U]MyClawDisplay[/u]) then save.  Open again, tab to scripts, and edit MyClawDisplay property to match your object.  Auto-fill \\\"should\\\" work if you followed my naming advice.  [B]Do Not[/b] re-size the stands! \r\n\r\nNOTE:  Claw displays function like weapon racks and store the claws LOCALLY.  Claws are [B]NOT SHARED[/b] between homes and [B]THEY ARE NOT PROTECTED[/b].  If claws drop onto the floor or hang in mid-air, you forgot to set the property.   \r\n\r\n* Bug Jar Displays work just like the Dragon Claw Displays except the property you need to edit is called MyBugDisplay.  \r\n\r\n* You do not need to put every activator into every home.  Some variety is nice.  On the other hand, there is no limited to how many activators you can add.  Sometime they just look nice.  Doesn\\'t hurt that they are functional too.\r\n\r\n* After living in your home for an while, you might want to fire up the CK and make some tweaks to your layout.  You can delete activators and add new ones without effecting your stored gear.  Sometimes you need to do a hard reset for moved items.  Go ahead, your stuff is safe.\r\n\r\n* If you are modding a player home you have already visited with your save, try using search\\\\replace to override an existing object with a GeneralStores activator to remove the \\\"memory\\\" of that object in the cell.  If the item has since moved from its editor position, all bets are off.  Shove all your gear into storage lockers and do a hard reset.  Couldn\\'t be easier.\r\n\r\n* If you are bored with my activators, then roll your own.  Virtually any mesh with collision will work.  Select the activator you want to change and open it for editing.  Change the name of the activator to something new.  Save as new (NOT rename).  Open your new object and change the NIF to point to your preferred NIF file.  You can cut\\\\paste NIF paths from objects in CK without unpacking the BSAs.\r\n\r\n* Check out Oaristys\\' [URL=http://skyrim.nexusmods.com/mods/16525]Modders Resource Pack[/URL] for lots of great objects you can use as activators.\r\n\r\n* If you plan to release a mod incorporating GeneralStores, CK will insist on adding GeneralStores resources and scripts to your BSA. These are completely unnecessary and could potentially cause conflicts.  I highly recommend using Ethatron\\'s BSAopt to clean extraneous junk from your BSA.\r\n[heading][color=Springgreen]Restrictions:[/color][/heading]\r\nGeneral Stores is free for anyone to use per the following restrictions:  \r\n\r\nNo restrictions on private usage.\r\n\r\nFor released mods, modders [I]may[/i] include the runtime contents if credit is given, but are [B]strongly encouraged to link to this page[/b] instead, assuring all players are using the most current version of this resource.  \r\n\r\nGeneralStores resources may not be used separate from the General Stores package. A usage exception is granted for modders to use GS meshes in non-GS enabled mods if a GS enabled version is also available.\r\n\r\nThis file must not be uploaded to Steam, in whole or in part.  It can\\'t really, not without breaking.  General Stores is an ESM master which is not supported on the workshop.\r\n[heading][color=Springgreen]Credits:[/color][/heading]\r\nJustinOther for his [URL=http://skyrim.nexusmods.com/mods/8066]Bag of Holding[/URL] mod.  I learned most everything I needed to know about Papyrus by reverse engineering his work.\r\nSollar for solving the brewed potions limitation that had stumped this chump.\r\nBlary for his beautiful meshwork.  A number of his ideas and products are incorporated into the included activators.\r\nOaristys for some more brilliant meshwork, most of which have collision!\r\ntyco1709 for his [URL=http://skyrim.nexusmods.com/mods/5554]Transparent Soulgems[/URL]\r\nexray catt for resources on loan from [URL=http://skyrim.nexusmods.com/mods/18799]Radiant and Unique Potions and Poisons HD[/URL].\r\nBarrels and Bread enhanced thanks to [URL=http://skyrim.nexusmods.com/mods/8655]Static Mesh Improvement Mod - SMIM[/url] by Brumbek (which includes photo textures from the free site Mayang) \r\nEthatron for the [URL=http://skyrim.nexusmods.com/mods/247]BSA optimizer[/URL].  CK does just a horrid job of packing.\r\n",
  "categoryId": "82",
  "version": "2.3",
  "author": "Harvey2112",
  "createdUnix": "1339018203",
  "updatedUnix": "1358623605",
  "containsAdultContent": false,
  "uploadedBy": "Harvey2112",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68362",
      "name": "Asteria Airship - General Stores Edition v1-4",
      "version": "1.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "233",
      "fileName": "Asteria Airship - General Stores Edition v1-4-18340-1-4.7z",
      "uploadedUnix": "1339854922",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/a1ba279768eb17bc1df528e5c52f691c1a2bbc460a5c5120efa98568fc47e666/analysis/1406962983/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Asteria%20Airship%20-%20General%20Stores%20Edition%20v1-4-18340-1-4.7z?fid=68362&ttl=1535785117&ri=8192&rs=8192&setec=ff4db9276e55ce21b853059ba34b46b9"
    },
    {
      "fileId": "78089",
      "name": "General Stores v1-5",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "32367",
      "fileName": "General Stores v1-5-18340-1-5.7z",
      "uploadedUnix": "1343840506",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/518dfb326f86af420779130e983a9ea8783682c623b56748b96707e7b55603b5/analysis/1407062241/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/General%20Stores%20v1-5-18340-1-5.7z?fid=78089&ttl=1535785118&ri=8192&rs=8192&setec=cfe0a4690a0843eccd99c3ac407c20f2"
    },
    {
      "fileId": "90159",
      "name": "General Stores v2-0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "42439",
      "fileName": "General Stores v2-0-18340-2-0.7z",
      "uploadedUnix": "1348451811",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/a98f6b5f3c7702ec97107f6608ea322d89c80a0df2b193bf65dcf7ee4aaebf2c/analysis/1407184298/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/General%20Stores%20v2-0-18340-2-0.7z?fid=90159&ttl=1535785118&ri=8192&rs=8192&setec=97e1bdd1bd67b3e9e31e735e9475c3a2"
    },
    {
      "fileId": "93438",
      "name": "General Stores_v2-13",
      "version": "2.13",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40687",
      "fileName": "General Stores_v2-13-18340-2-13.7z",
      "uploadedUnix": "1350048557",
      "modVersion": "2.13",
      "virusScanUrl": "https://www.virustotal.com/file/97f1f8b76279c7e80696b0547f6d2bc767bb91e5f10ca27f80527c25c7c36df7/analysis/1407217365/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/General%20Stores_v2-13-18340-2-13.7z?fid=93438&ttl=1535785119&ri=8192&rs=8192&setec=540b55f39041390f2c8d7d165927f176"
    },
    {
      "fileId": "99854",
      "name": "Harveys Honeyside",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1050",
      "fileName": "Harveys Honeyside-18340-1-0.7z",
      "uploadedUnix": "1353087949",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/705e121e443d98159c4cf296053c0d9a659ee5e3704f603b71bc1b90e0e7a436/analysis/1407265326/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harveys%20Honeyside-18340-1-0.7z?fid=99854&ttl=1535785119&ri=8192&rs=8192&setec=6bbc61601845caed67b0a35c4d3396e6"
    },
    {
      "fileId": "107465",
      "name": "General Stores v2-21",
      "version": "2.21",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "64946",
      "fileName": "General Stores v2-21-18340-2-21.7z",
      "uploadedUnix": "1356444677",
      "modVersion": "2.21",
      "virusScanUrl": "https://www.virustotal.com/file/1bb82adfa66254e08bf0957c5fbb39662c64335637774c0b72c2d97901baa3aa/analysis/1407321921/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/General%20Stores%20v2-21-18340-2-21.7z?fid=107465&ttl=1535785120&ri=8192&rs=8192&setec=f0acd3d0c7ef725a0babe86b25864c3f"
    },
    {
      "fileId": "1000003494",
      "name": "General Stores v2-3",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "73182",
      "fileName": "General Stores v2-3-18340-2-3.7z",
      "uploadedUnix": "1358622458",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/dc2fc096d41b4665c3b42b8f7f93c001e7b041c7c42b01ad97496a5146442668/analysis/1407361648/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/General%20Stores%20v2-3-18340-2-3.7z?fid=1000003494&ttl=1535785120&ri=8192&rs=8192&setec=1923d7372aad2e0f2e5a47d243b3a705"
    },
    {
      "fileId": "1000003505",
      "name": "General Stores_v2-3 runtime",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "42878",
      "fileName": "General Stores_v2-3 runtime-18340-2-3.7z",
      "uploadedUnix": "1358623605",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/df08814a3c6ed60d002046bb5f3ec679eb9ce2c7e70a8c892e150edddb0c1b70/analysis/1407361662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/General%20Stores_v2-3%20runtime-18340-2-3.7z?fid=1000003505&ttl=1535785121&ri=8192&rs=8192&setec=077a431598681a18cddb7b3c0e90af53"
    }
  ]
}