{
  "modId": 18350.0,
  "modName": "Ultimate Performance for Low End Rigs UPDATED",
  "summary": "This will allow virtually any pc to run skyrim with stability, decent textures and without game breaking CTD\\'s. Full guide for tweaks for any level of graphic quality, INI\\'s FOR LOW END PC\\'s ONLY\r\nNOW UPDATED WITH SUPPORT OF NEXUS MEMBERS!!!",
  "descriptionHtml": "DON\\'T FORGET TO ENDORSE IF THE INI\\'s OR THE GUIDE HELPED YOU!!! :)\r\n\r\nFULL GUIDE IS FOR ANYONE WHO WANTS TO IMPROVE STABILTY.  YOU CAN USE THESE UTILITIES AND OPTIONS FOR ANY LEVEL OF SKYRIM GRAPHIC QUALITY.  INI\\'s ARE FOR LOW END PC\\'s ONLY.\r\n{Full Guide is also a Text File in the main download}\r\n\r\nWARNING:  YOU USE THESE OPTIONS AT YOU OWN RISK!  I\\'ve fully tested everything here and so long as you follow my instructions you will be fine.  Making mistakes in windows can damamge your system; be careful and if you DON\\'T know ask me.  If you DON\\'T feel comfortable DON\\'T do it.  REMEMBER people use common sense and Google cuz\\' Google is your Friend.  \r\n\r\nIntroduction:\r\n\r\nIf you are like me and have spent hours tweaking you ini and trying performance enhancing mods \r\nonly to be defeated by skyrims CPU/GPU guzzling gameplay, you\\'ve come to the right place.  Are \r\nyour settings on low, shadows off, resolution downsized and still feeling the burn of an \r\ninadequate rig?  You have three choices; buy a new computer, upgrade your current one OR try \r\nthese ini\\'s and the freeware I recommend.  Believe me; I\\'ve tried EVERYTHING and this was the \r\nonly thing that worked.\r\n\r\n\r\n\r\nFirst of all lets post my specs:\r\n\r\nCPU: Pentium(R) Dual-Core CPU E6600 Codename: Wolfdale @3.06GHz\r\nGPU: Intel(R) G41 Express Chipset with 128MBs of Dedicated VRAM\r\nRAM: 2.87 GBs of usable RAM\r\nOS: Windows 7 Home Premium Service Pack 1\r\nNOTE: I run Skyrim on windows Vista service pack two compatibility mode. (Right click on \r\nTES5.exe and click troubleshoot compatibility and follow the prompts.)\r\n\r\nAccording the Fraps I NEVER fall below 13fps; even in the middle of the most expansive frays the \r\npopular mod \\\"WARZONES\\\" has to offer. I don\\'t suffer from microstutters, freezes or CTDS; though \r\nI do get the occasional memory spike.\r\n\r\nMy Mods:\r\n\r\nWhat I DON\\'T use:\r\nScript Dragon: Never tried it\r\nSkyboost: REALLY wish I could but again not compatible with the new Patch\r\nFPS Limiter: Not necessary for me at least\r\nBackground Booster: No effect for me\r\nENBS: None I\\'ve used boost my performance though they will work if you like\r\n4gb Patch: No longer necessary after patch 1.3 I believe.\r\n\r\nWhat I DO use:\r\n\r\nPerformance Related:\r\nSKSE: EDIT!!  Now Compatible with new patch, I will be using it soon.  Those who want directions for utilizing game booster+SKSE just message me.\r\nUnofficial Skyrim Patch\r\nInterior and Dungeon Fog Remover\r\nRemove Ambient Interior Fog\r\nColorful LIghts No Shadows\r\nSkyrim Performance PLUS-Pine Needles, Rainfall, Snowfall and Aspen Leaves FX\r\nReduced Vanilla Textures\r\n\r\nGeneral Gameplay: \r\nDuel Combat Realism\r\nDeadly Dragons\r\nWarzones Civil Unrest\r\n\r\nNONE OF MY PERFORMANCE RELATED MODS OR GENERAL MODS ARE REQUIRED TO GAIN A SUBSTANTIAL BOOST!\r\n\r\nBOOSTERS I USE:\r\n\r\nREADY BOOST (Windows Option, For windows 7/Vista)(SUPER HIGHLY RECOMMENDED)\r\nReady boost is an option that adds instant RAM (It\\'s not really RAM, it\\'s increased caching space) to your computer.  All you need is a compatible USB memory card with at least 4Gbs of space.  I use a 16Gb Scandisk.  To use plug in your usb, got to \\\"My Computer\\\".  Right click on your USB cards icon and go to properties and select the ready boost tab on the top.  Select \\\"Use this device\\\" and max out the slider then select apply.  NOTE: not all USB cards are compatible google readyboost to find the requirements, it\\'s good to have a USB card that exceeds the 4gb mark because some of the memory in certain cards is NOT usable.  For instanse: My 16Gb scandisk has only 14.9Gbs of usable space.\r\n-Thanks to Dhegonus for this option \r\n\r\nGame Booster 3: (Newest Beta Version, Freeware) {SUPER-HIGHLY RECOMMEND}\r\n\r\nThis utility will close all other applications to allow skyrim to take all the CPU/GPU You have \r\nto offer.  It also offers numerous other utilities like making videos, recording fps and taking \r\nscreenshots.  It\\'s Freeware {Not for long though!} Just add the TES5.exe or whatever you use to \r\nlaunch skyrim to the game box, configure you settings and press boost and launch!\r\n\r\nTopWinPrio: (Freeware) {Super-Highly RECOMMEND}\r\n\r\nThis Utility sets the priorities for you in task manager and will boost ANY active window to \r\nyour chosen speed.  I personally set mine active Apps to High and my inactive ones to below \r\nNormal.  DO NOT USE IDLE OR REALTIME SETTINGS; this could have drastic reprocussions, like an \r\narrow in the knee for your computer!!!  This app runs in the background and BOOSTS EVERYTHING \r\nYOU ARE CURRENTLY USING.\r\n\r\nAlternative to TopWinPrio:\r\n\r\nCTRL+ALT+DELETE at Skyrim Main menu and open the task manager; find the skyrim process and set the priority yourself.  Reputed to cause instability in some cases, though it works fine for me.  This will save memory but it can be bothersome at times.  It will not work with Game boosters \\\"Launch Game of Desktop\\\" configuration so just leave that box Unchecked.\r\n-Thanks again to Kadath\r\n\r\nIst Quickres Freeware Version: (Freeware)  {Highly Recommended}\r\n\r\nThis Application uses hotkeys to force your monitor to to a smaller resolution even if it isn\\'t \r\nsupported.  This will drastically reduce the pixelation of my smaller resolution INI and make \r\nthe game look a whole lot better while maintaining the performance boost.  This runs constantly \r\nand basically merges with you diplay options.  To set the hotkeys to your preference, find the \r\nicon in your task bar, right click and go to options; select 640x480 and set your kotkey.  Next \r\nselect the keyboard tab and find the set the previous video mode hotkey.  That is all you will \r\nneed.  Set it to 640x480 before playing the game with your hotkey and then use your second \r\nhotkey to return to your original resolution!\r\n\r\nUTILITIES I USE {Optional}:\r\n\r\n\r\nNOTE: \r\n\r\nEveryone who thinks that Skyrim\\'s performance is solely based upon graphics, mods or ini\\'s; this \r\nwill blow you away.  Skyrim\\'s performance is not solely based upon it\\'s self-contained options \r\nand subleties.  It\\'s also based on you computer\\'s efficiency.  You NEED to have an adequate disk \r\ncleaner, defragmenter and prefferably a registry repair utility In order to maintain performance.\r\n\r\nCCleaner (Freeware): \r\n\r\nGlorified Disk Ceanup that allows you to personalize the amount of deleted info.  It work FAR \r\nbetter that the integrated windows alternative.\r\n\r\n\r\nMy Defrag (Freeware): (Super Highly Recommended)\r\nThis utility is unique in that it relocates frequently used files (Like Skyrim) to the beginning of your hard disk making it far less work for your rig to find and load.  Depending upon you rig it can subtantially boost performance and decrease load times.  This defragmenter is far more powerful and I would recommend running the \\\"System Disk Monthly\\\" the first time and then analyzing and selecting a more appropriate option based on your fragmentation.  Running heavy defragments TOO frequently can damage you drive, be careful.\r\n-THANKS TO KADATH!\r\n\r\n\r\nSmart Defrag 2(Freeware):OUTDATED!!! \r\n\r\nGlorified Disk Defragmenter that works FAR faster and does a FAR better job than it\\'s windows \r\ncounterpart.\r\n\r\n\r\n\r\nOPTIMIZING WNDOWS:\r\n\r\nStep 1: Performance Based PC\r\nGo to Start/Control Panel/System and Security/System/Advanced System \r\nSettings/Performance/Advanced Tab/Performance Settings\r\n-If you followed the path correctly you should be in the performance options menu!\r\nUnder the visual effects tab Select \\\"Adjust for best performance\\\" then apply. This should make \r\nyou computers interface look older.\r\n\r\n-Next Go to the advance options tab at the top you should see a box that says Virual Memory.\r\nClick \\\"change\\\". Now uncheck the box that says \\\"Automatically manage paging file size for all \r\ndrives\\\".  Select Custom size and size your Intial and maximum paging in relation to your sytem \r\nRAM in MBs. based on this formula.\r\n\r\nSafe Formula: Safe for all users\r\n\r\nIntial: Your RAM x 1.5 =\r\nMaximum=Intial\r\nFor Example:\r\n3Gbs(My RAM)x1.5=4500\r\nIntial=4500\r\nMaximum=4500\r\n-Thanks to Kadath for this Formula\r\n\r\nDangerous Formula: This formula is for advance windows users who have the ability to \\\"fix\\\" memory as having a different values for the maximum and intial paging size can lead to corruption.  USE AT YOUR OWN RISK. \r\n-Thanks to Kadath for this info \r\n\r\nIntial: Your RAM x 1.5 = \r\nMaximum: Your RAM x 3 =\r\nExample: \r\n3GBs(My RAM) x 1.5 = 4500MBs (My intial Paging size)\r\n3GBs(My Ram) x 3 = 9000MBs (My Maximum Paging size)\r\n\r\nYour computer will need to restart for this to take effect offering you the the perfect chance \r\nto update BIOS.\r\n\r\nBIOS:\r\n\r\nWhile in the intial screen press delete to enter BIOS setup.  Look for a option to increase you \r\ndidicated VRAM; this may vary based on your computer.  My maximum is 128MBs which is still very \r\npoor.  Increase this to your maximum then save and then save and quit.\r\n\r\nDrivers:\r\n\r\nGo to Start/Control Panel/System and Security/System\r\nOpen the Device manager.  \r\nGo down the drop down list of every installed device on your cpu and press the small + next to \r\nit; each of these subcategories has a driver.  Right click on them one by one and select update \r\ndriver information; now click search automatically for updated driver software.  Let it run a \r\nmoment and follow the prompts if it finds a better driver.\r\n\r\nFFDSHOW: \r\n\r\nThe FFDshow Codec come with many newer pcs; this codec can cause CTDs and freezing in Skyrim.  Uninstall it and be done with it.\r\n\r\nCompatibility:\r\n \r\nRight click on TES5.exe and select properties; go to compatibility.  I run Skyrim in in \r\ncomapatibility mode for windows vista Service pack 2, that is up to you but it seems to make the \r\ngame more stable.  Next select Disable Visual Themes, Disable desktop composition and disable \r\ndisplay scaling on high DPI settings.  Last select run this program as administrator.  Click \r\napply.  Use these settings (except for windows vista compatibility mode) for whatever you may \r\nuse to launch skyrim.  SKSE, GAME BOOSTER ETC.\r\n\r\nDONE!!!\r\n\r\nYou may want to try skyrim out now.  You may not even need my INI\\'s if you\\'ve taken these steps \r\nand you pc is better than mine(NOT SAYING MUCH!!!).  Leave all you current settings alone and \r\nlaunch skyrim.  If your game works better then great!  Don\\'t bother with these INI\\'s unless you \r\nare still unstable.\r\n\r\nINI\\'s:  These INI\\'s go in you Skyrim folder located in my documents/my games/skyrim.  BE SURE TO \r\nSAVE YOUR ORIGINALS!  Also backup mine incase you 1.patch the game 2.Steam does it for you :( \r\n3.you tweak them and screw up 4: you want to try someone else\\'s ini 5.The launcher overwrites \r\nthem.\r\n\r\nThese INI\\'s are made to cater to LOWER END PC\\'s.  If you have a middle end rig and my previous \r\noptions and utilities didn\\'t help LOWER YOU RESOLUTION BUT KEEP YOUR CURRENT SETTINGS.  These INI\\'s degrade graphic quality and resolution for inproved fps and stability.  You CAN modify the ini directly to your tastes but the launcher WILL fully overwrite them if used to tweak the ini. \r\nYou can modify certain options from the ingame menu.\r\n\r\nTHIS IS NOT EYECANDY PEOPLE; this is decent looking FUNCTIONALITY!\r\n\r\nI will offer support to individuals who message me (and on the comments page to a certain \r\n\r\nextent).\r\n\r\nI hope this helps;\r\nBest of Luck and Nerevar guide you to stable gameplay Dovahkiin,\r\necremer ",
  "categoryId": "28",
  "version": "Final",
  "author": "ecremer",
  "createdUnix": "1339043074",
  "updatedUnix": "1339043261",
  "containsAdultContent": false,
  "uploadedBy": "ecremer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "66459",
      "name": "FULL GUIDE PLUS INIs",
      "version": "Final",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "FULL GUIDE PLUS INIs-18350-Final.zip",
      "uploadedUnix": "1339043261",
      "modVersion": "Final",
      "virusScanUrl": "https://www.virustotal.com/file/b8ab415f55cffea62b7cbd9686b66551334dbc55b6c57c71bfb99bed47bbaa3a/analysis/1406944084/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FULL%20GUIDE%20PLUS%20INIs-18350-Final.zip?fid=66459&ttl=1535785139&ri=8192&rs=8192&setec=6fdfc7f128c1949021db89d9b77ff7d7"
    }
  ]
}