{
  "modId": 18393.0,
  "modName": "Custom Triss Dresses",
  "summary": "This adds a couple of edited versions of Triss Merigold\\'s outfit from The Witcher 2 into Skyrim. They\\'re dresses!",
  "descriptionHtml": "Update: I\\'ve uploaded a fix for the shiny mantle problem. I\\'m not entirely sure if it will work, because I didn\\'t have the problem myself, but I\\'m hoping for the best.\r\n\r\nSo a word of warning before anything else; This is the first mod I\\'ve uploaded to the Nexus. Hopefully I haven\\'t mucked anything up, done anything wrong, or forgotten any files in the download or whatever, but the chance is there. Anyways:\r\n\r\nYeah, this is pretty much Triss\\' outfit with a long skirt and some variations on top of that. Because of the way the skirt is rigged, it\\'ll look a bit weird if you sit down or get on a horse or really do anything more than basic combat and running around. On the other hand, the skirt looks pretty good when you\\'re running around because it doesn\\'t do that awkward \\\"glued to the legs\\\" thing that most long robes or skirts do in Skyrim. \r\n\r\nAlso, there isn\\'t any weight slider support. I\\'ve messed around with it a bit, but I can\\'t get it working right. So for now (and probably forever), these dresses are one-size-fits-all.\r\n\r\nThe armour is located in a respawning chest around the back of Breezehome in Whiterun, as shown in the screenshots.\r\n\r\nConflicts: \r\nThe armour itself shouldn\\'t conflict with anything, but anything that seriously rearranges Whiterun or the exterior of Breezehome might mess with the chest. Or visa versa, I dunno.\r\n\r\nCredits:\r\n- CD Projekt for the original Triss armor meshes and textures, and Fraper for the port to Skyrim.\r\n- Psyke23 and Oldholo for their retextures (http://skyrim.nexusmods.com/downloads/file.php?id=4708).\r\n- KURESE for their Torumekian Armor (http://skyrim.nexusmods.com/downloads/file.php?id=16870), from which I pulled the mantle for the one dress.\r\n- Bethesda for making a game that is easy enough to mod.\r\n\r\nLegal Stuff? I don\\'t know, I\\'ve just seen this on everything else involving stuff from the witcher. Here goes:\r\n\r\nThe original Triss armor concept, mesh and textures are owned and copyrighted by CD Projekt and used here with permission.\r\nThe Witcher is a trademark of CD Projekt. All rights reserved.\r\nhttp://www.cdprojekt.com/\r\nI, The creator of this mod, am in no way associated with CD Projekt or CD Projekt RED.\r\n\r\nYou may not publicly distribute this mod anywhere else without permission.\r\nYou may not publicly distribute derivates of this mod without permission.\r\nYou may alter and/or extract portions of this mod for your personal usage to your liking.\r\nYou must always give credits to CD Projekt RED and everyone in the credits list above.\r\n\r\nFor the most part, if you want to use anything in this mod for anything, just make sure you give credit to the people that made the resources involved.\r\n\r\nDo not upload this to the steam workshop under any circumstances, but if you want to upload it elsewhere for whatever reason, shoot me a PM and I\\'ll probably be okay with it.",
  "categoryId": "54",
  "version": "1.0",
  "author": "RedeadSoldier",
  "createdUnix": "1339140974",
  "updatedUnix": "1339731797",
  "containsAdultContent": false,
  "uploadedBy": "RedeadSoldier",
  "primaryFile": null,
  "files": [
    {
      "fileId": "66645",
      "name": "RedeadTrissV1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16427",
      "fileName": "RedeadTrissV1-18393-1-0.7z",
      "uploadedUnix": "1339141090",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/195d51f3cffd874b210694745ec09526f2578700f38419fd9b6ad24f00fbe3e4/analysis/1406945830/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RedeadTrissV1-18393-1-0.7z?fid=66645&ttl=1535785209&ri=8192&rs=8192&setec=938049b82ff20dd733a16df376cd3992"
    },
    {
      "fileId": "68079",
      "name": "Shiny Fur Fix",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "2948",
      "fileName": "Shiny Fur Fix-18393-.zip",
      "uploadedUnix": "1339731797",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0dd404a39e6a8f6f1313214fa38a8fae304719871ffd96c49484e2e803331825/analysis/1406960045/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shiny%20Fur%20Fix-18393-.zip?fid=68079&ttl=1535785209&ri=8192&rs=8192&setec=6202b8de2417c0a1a31221586f438c9e"
    }
  ]
}