{
  "modId": 18408.0,
  "modName": "Argonian Racial Enhancements",
  "summary": "Enhances the Argonian race and abilities.",
  "descriptionHtml": "As I have a Argonian Character which I play on occasion, mostly due to being an actual \\\"Dragonborn\\\" type lizard-guy... I slowly became aware of the unarmed fighting style and actual appearence of the lizardpeople and realised that although they are amphibian/reptilian... mostly reptilian I think because of horns, scales and teeth..\r\nThey should have had extra unarmed damage and armor bonus at all times.\r\n\r\nSo I created a small .esp file here that added extra abilities for Argonians everywhere.\r\n\r\nWhat this mod does is:\r\n\r\n+ adds 8 points of unarmed damage, a clone of the Khajiit claws ability as that adds 15 points but though a little bit less as Argonians, in my experience use thier claws less than Khajiits.\r\nAnother reason of this is Argonians, whist fighting hand to hand use thier claws when fighting as do Khajiits. They use the same attack animations but only do the same damage as human/Elven races. This did not make sense or was fair for the swamp dwellers so I created this.\r\n\r\n+ 10% Damage resistance: Argonian Scales.\r\nArgonians are covered in a thick layer of scales and hard skin due to thier reptillian nature and appearence and horns in places but yet, they are purly asthetic and surve no purpose but to make Argonians, look like Argonians.\r\nIf 10% Damage resistance is too much, I will cut it down to say.... 5%.\r\nEven if you dont play as an Argonian, this will still add a little realism and even Lore to Argonian companions/enermies as it surely will make them a little harder to kill.\r\n\r\nI did not touch anything else in the racial abilities nor anything else in the game.\r\nPlease give futher suggestions for enhancements please:\r\n\r\nThis is surely likely to conflict with anyother mod that alters the Argonian Race.\r\nThis abilities are also placed on the Argonian Vampire race if your thinking also.\r\n\r\nThanks.",
  "categoryId": "24",
  "version": "1",
  "author": "Beth",
  "createdUnix": "1339163941",
  "updatedUnix": "1339187875",
  "containsAdultContent": false,
  "uploadedBy": "nofear88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "66726",
      "name": "Argonian Racial Enhancements",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Argonian Racial Enhancements-18408-1.rar",
      "uploadedUnix": "1339187875",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/1867fc7e5487b45a76a9280082284f645b9bdee4a44076ba006869bb07048429/analysis/1406946782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Argonian%20Racial%20Enhancements-18408-1.rar?fid=66726&ttl=1535785231&ri=8192&rs=8192&setec=7d5579bbe3b6353ad8ac069b14112e3c"
    }
  ]
}