{
  "modId": 18419.0,
  "modName": "Elsweyr Island Home and New Sea Creatures _WIP _",
  "summary": "Adds tons of new sea creatures to Skyrim and a Tropical Island Home in Elsweyr.  ",
  "descriptionHtml": "[img]http://static.skyrim.nexusmods.com/mods/images/18419-3-1339178875.jpg[/img]\r\n\r\nUpdate:  Re-releasing because the maintenance ruined my last release and barely anyone saw it :(.\r\nI\\'ve also added the basis of the outside of the player home.  You can\\'t go inside yet. \r\nTextures will be redone eventually.  Please be patient, it\\'s hard to do this all on my own.  \r\nWill eventually be teaming up with Blitz from the other fish mod, who has done Fresh Water fish.\r\n\r\nUpdate: All tropical fish have been removed from the cold Skyrim waters ( have left in the new fish such as the tuna and bocaccio in the cold waters) and have instead been placed in the new tropical Elsweyr Island Getaway. The island is a work in progress and will feature a new player home and lot\\'s of decorations, perhaps eventually a village. You can access the island via a ship outside the Solitude Lighthouse. Just climb aboard and go into the trap door.\r\n\r\nAlso, many textures have been darkened. Future updates will fix the shark animations a bit. Remember, this is a work in progress so there isnt much on the island yet! Hope you enjoy!\r\n\r\nUpdate: The Island is a work in progress. I will make a player house and other stuff, and I will decorate the waters with the tropical fish that people have complained (justifiably) don\\'t belong in Skyrim\\'s waters. The island will be based in Elsweyr, so it is lore friendly.\r\nAlso, don\\'t worry about the colors from the picture. The textures/colors will be changed to better fit into the feel of skyrim.\r\n\r\nElsweyr Island Home and New Sea Creatures-- By ElSte17\r\nBranching out from the regular Aquatic Life Overhaul and adding a climate-friendly location player home to put all of my tropical fish and sharks.  This mod also adds new cold water fish and sharks to Skyrim\\'s waters.\r\n\r\nLocations Mostly Complete So Far:\r\nSolitude Docks\r\nOcean near Solitude Docks\r\nWindhelm Docks and nearby Ocean area\r\nElsweyr Island Getaway\r\n\r\nTypes of Life so far (all the same model, different sizes):\r\nYoung Shark\r\nShark\r\nGreat White Shark\r\nSandbarshark\r\nAngel Shark\r\nBlue Marlin\r\nHumpback Red Snapper\r\nHumphead Wrasse\r\nJellyfish\r\nGuitarfish\r\nSheep Head\r\nKelp Bass\r\nLeopard Shark\r\nSharksucker\r\nYellowtail Clownfish\r\nMangrove Red Snapper\r\nNorthern Bluefin Tuna\r\n\r\nPlease note that the Sharks use the slaughterfish animations and behavior, which is why they don\\'t move around as realistically as you might like. Please do not complain, as I don\\'t know how or if it\\'s even possible, nor am I interested at the moment, in trying to custom-animate every fish. \r\n\r\nAlso note that the non-hostile fish (the majority of the one\\'s I\\'m adding soon) use the vanilla \\\"salmon\\\" animations/behavior so they don\\'t do much more than swim around stupidly. Eventualy I\\'ll get to adding ingredients linked to these fish so that you can catch them and eat them.\r\n\r\nRunning list of what I have completed for the next update (this will take some time):\r\n\r\n\r\nTo come?:\r\nCoral Reef\r\nShrimp\r\nLobsters\r\nDifferent types of crabs\r\nStarfish\r\nCod\r\nPalette Surgeon\r\nSkipjack Tuna\r\nYellowfin Tuna\r\n\r\n\r\nMost of these will come quickly because I am converting them from an Oblivion mod. Things such as eels, other sharks, dinosaur sea creatures, squids, etc. will take a much longer time. I will also consider doing an overhaul of a part of Skyrim and convert it to a \\\"tropical\\\" environment where most of these fish will blend in better.\r\n\r\n\r\nFor a quick Shark encounter, take a swim in the water by the Solitude Docks ;) .\r\n\r\nWhat\\'s to come? If people endorse, I will know they are interested, and I will continue to add new sea creatures to the waters of Skyrim.\r\n\r\n\r\nHope you guys enjoy, please endorse!\r\n\r\n\r\nInstall: Use NMM or merge the data folders and check the .esp file.",
  "categoryId": "67",
  "version": "1.0.03Beta",
  "author": "ElSte17",
  "createdUnix": "1339178793",
  "updatedUnix": "1339180134",
  "containsAdultContent": false,
  "uploadedBy": "ElSte17",
  "primaryFile": null,
  "files": [
    {
      "fileId": "66716",
      "name": "Elsweyr Island Home and New Sea Creatures",
      "version": "1.0.03Beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "33573",
      "fileName": "Elsweyr Island Home and New Sea Creatures-18419-1-0-03Beta.rar",
      "uploadedUnix": "1339180134",
      "modVersion": "1.0.03Beta",
      "virusScanUrl": "https://www.virustotal.com/file/3e8914dbec3cd93e5bd0974c778e26d0d24cdf4e656f75be5b185a82de120980/analysis/1406946585/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elsweyr%20Island%20Home%20and%20New%20Sea%20Creatures-18419-1-0-03Beta.rar?fid=66716&ttl=1535785252&ri=8192&rs=8192&setec=df6615a2c92086c14d09f8ee0a4b3cd0"
    }
  ]
}