{
  "modId": 18509.0,
  "modName": "Teleport Room",
  "summary": "A dwarven room containing teleports to all major settlements within Skyrim. Now with Dawnguard version.",
  "descriptionHtml": "[b][u][size=5][b]None of my mods may be used in ANY paid mods, if you have permission to use this mod from me you do NOT have permission to use it in a sale.[/b][/size]\r<br />\r<br />Skyrim Teleport Room - Version 1.3[/u][/b]\r<br />\r<br />While the coming of the dragons has dominated conversations throughout Skyrim, it is by no means the only event that is unfolding. Whether by coincidence or not, a number of platforms near major cities and other settlements have recently become active. It is said that walking into the blue flame will cause one to emerge into a large dwarven room, where similar structures allow instantaneous travel to locations around Skyrim.\r<br />\r<br />[b][u]This is a proof of concept[/u][/b]\r<br />\r<br />There are already a few teleport mods out there. Those that I have tried require the player to activate a stone or other object in order to be teleported. This felt unsatisfactory, so this mod aims to provide a more natural teleport experience where walking into the teleport will automatically teleport the player from an outside location to the teleport room, or vice versa. I have used the MinUse versions of the auto load doors to prevent every NPC from using the teleports as a short cut in their travels.\r<br />\r<br />The issue here is that the auto load door (used when entering a cave, for example) covers an area that is larger than the trigger zone that I want. So I have placed teleports by rock formations and (in the teleport room) closed chambers so that I can bury the auto load door in order to restrict the area where teleportation is triggered.\r<br />\r<br />I have placed an elevator in the middle of the teleport chamber. It leads to a hallway and a few rooms that were formerly a dwelling for those that maintained the teleport room, complete with lighting and clutter. It includes a full set of crafting stations. There is an exit to the outside world at a point that I would consider useful, but I&#39;ll leave it up to the player to find out where. The teleport room itself has some basic lighting:- I felt the pristine look worked much better, although I did add some raised floor pieces at one of the corners to help players get their bearings.\r<br />\r<br />If anyone can tell me how to reduce the trigger range for an auto-load door (I believe after much experimentation that it is hard-coded into the game engine somewhere) I will be eternally grateful&#33;\r<br />\r<br />This mod is follower friendly - followers will teleport around the world with the player.\r<br />\r<br />I have made my best efforts to avoid conflicts with other mods. Tested with a completely vanilla Skyrim install to ensure that no items from other mods made it into this mod.\r<br />\r<br />[b][u]Install/Uninstall[/u][/b]\r<br />\r<br />[b]Only one of SC01Teleports.esp or SC01TeleportsDawnguard.esp may be active. Activating both will probably cause horrible things to happen&#33;[/b]\r<br />\r<br />[b]Install[/b] - Copy SC01Teleports.esp and/or SC01TeleportsDawnguard.esp to your Skyrim&#92;Data folder.\r<br />[b]Uninstall[/b] - Delete SC01Teleports.esp and/or SC01TeleportsDawnguard.esp from your Skyrim&#92;Data folder.\r<br />\r<br />[b][u]Teleport Locations[/u][/b]\r<br />\r<br />Dawnstar\r<br />Dragon Bridge\r<br />Falkreath\r<br />Helgen\r<br />Ivarstead\r<br />Karthwasten\r<br />Markarth\r<br />Morthal\r<br />Riften\r<br />Riverwood\r<br />Rorikstead\r<br />Shor&#39;s Stone\r<br />Solitude\r<br />Whiterun\r<br />Windhelm\r<br />Winterhold\r<br />\r<br />Additional Teleports for Dawnguard version:\r<br />Fort Dawnguard\r<br />Castle Volkihar\r<br />\r<br />\r<br />[b][u]Update Log[/u][/b]\r<br />\r<br />0.1  - Original proof of concept.\r<br />0.11 - Fixed issue with teleport room up elevator resulting in player falling through floor.\r<br />0.2  - Repurposed the teleport hallway as a delapidated teleport caretaker&#39;s quarters, mainly to try my hand at lighting and cluttering.\r<br />1.0  - Final release version. Some lighting applied to the teleport room. Increased teleport light level. Raised floor added at one corner.\r<br />1.1  - Fixed a few things I noticed when using this mod on a day-to-day basis. In the Teleport Room I removed the small rubble on the floor (it was obviously above the floor level when watching followers walk through it), dimmed the two ceiling lights and changed the light in the elevator to a shadow light. Also fixed the autoload door in Winterhold (would show &#34;Teleport Room&#34; when I was on the rock behind the teleporter, which was not my intent. It&#39;s not perfect now, but it&#39;s better than it was).\r<br />1.2 - Some improvements for Whiterun teleport. New Dawnguard version added with larger teleport room and additional teleports to Fort Dawnguard and Castle Volkihar.\r<br />1.3 - Updated for Skyrim 1.8 and cleaned with TES5Edit.\r<br />\r<br />[b][u]Credits[/u][/b]\r<br />\r<br />Thanks to Bethesda for Skyrim, and the Creation Kit without which this would not be possible.\r<br />ElminsterAU, Zilav and Sharlikran for the TES5Edit utility.\r<br />To all the modders out there who have added to the enjoyment of this game.\r<br />\r<br />[b][u]Permissions[/u][/b]\r<br />\r<br />Feel free to make use of this mod. All I ask for is to be credited.\r<br />Please DO NOT upload this mod to any other site. The Steam Workshop has some particularly nasty verbiage in their terms and conditions that basically hands over all rights to Valve.",
  "categoryId": "88",
  "version": "1.3",
  "author": "Arizona_Steve",
  "createdUnix": "1339292261",
  "updatedUnix": "1352429049",
  "containsAdultContent": false,
  "uploadedBy": "Arizona_Steve",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98196",
      "name": "Teleport Room",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1086",
      "fileName": "Teleport Room-18509-1-3.7z",
      "uploadedUnix": "1352428996",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/fa4976a6770e99b372abc320b77106b040e26ab13fca86c949180a0b542f8c6c/analysis/1407254879/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Teleport%20Room-18509-1-3.7z?fid=98196&ttl=1535785414&ri=8192&rs=8192&setec=3b0959c6173b2f5bd04084eb655dbb9a"
    },
    {
      "fileId": "98197",
      "name": "Teleport Room for Dawnguard",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1178",
      "fileName": "Teleport Room for Dawnguard-18509-1-3.7z",
      "uploadedUnix": "1352429049",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/5935000fe78d8404e3466981bf8f075c29772e3fc88f053d0936d843b1de13ed/analysis/1407254880/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Teleport%20Room%20for%20Dawnguard-18509-1-3.7z?fid=98197&ttl=1535785414&ri=8192&rs=8192&setec=2836a83735ebe3bacbb8b99976f65f7c"
    }
  ]
}