{
  "modId": 18524.0,
  "modName": "MoWs und DoDs Tic Tac Toe Wetten",
  "summary": "Diese Mod fuegt vier NPCs mit Spieltischen ein an denen man das bekannte Spiel Tic Tac Toe spielen kann und bei einem Gewinn je nach Einsatz belohnt wird. Die NPCs sind voll vertont und stellen die Gegenspieler dar.\r\nGerman voiced Tic Tac Toe Mini Game.",
  "descriptionHtml": "[heading]MoWs & DoDs Tic Tac Toe Wetten [/heading]\r\n[youtube]rTCVFqkIa1o[/youtube]\r\n\r\n[color=yellow]Beschreibung[/color]\r\n\r\nDas Glücksspiel hält Einzug in Himmelsrand. Kommt und besucht vier Spielstände. Vier Spielmeister stehen in Rifton, Markarth, Einsamkeit und Weißlauf mit ihren Spieltischen und erwarten euch. Spielt ein einfaches Spiel bekannt unter den Namen Tic Tac Toe, Kreis und Kreuz oder Dodelschach. Macht einen Einsatz und wettet auf euren Gewinn. Mit nur etwas Glück könnt ihr euren Einsatz verdoppeln. Wäre doch gelacht, wenn das nicht zu schaffen ist. \r\n\r\nDiese Mod fügt vier NPCs mit Spieltischen ein an denen man das bekannte Spiel Tic Tac Toe spielen kann und bei einem Gewinn je nach Einsatz belohnt wird. Die NPCs sind voll vertont und stellen die Gegenspieler dar.\r\n\r\n[youtube]Om5ZCziEA4I[/youtube]\r\n\r\n[color=yellow]English Description[/color]\r\n\r\nThis modification adds a Tic Tac Toe mini game to Skyrim where you can make a bet and if you are lucky and win the game you get up to a double of your bet. The mod is completly in german, but if you want to play it anyway simply go to Riften, Markarth, Solitude or Whiterun, find the gamble booth, usaly near the market, place your wager in the chest called \\\"Einsatztruhe\\\" and speak to the emcee and say that you are ready (\\\"Bin soweit\\\"). Now the beginner will be drawn and the game starts. Activate a button to make your turn. At the end if you were lucky you\\'ll find your win inside the chest or an empty chest when you loose. Septims count with their full value, any other items half of their value if any, enchanted items only with their base value.\r\n\r\n\r\n[color=yellow]Installation[/color]\r\n\r\nDas Plugin beinhaltet:\r\n- Readme.txt\r\n- MoWs&DoDsTicTacToeWetten.esp\r\n- MoWs&DoDsTicTacToeWetten.bsa\r\n\r\nDas Archiv bitte entpacken und vollständig in den Ordner Skyrim\\\\\\\\Data\\\\\\\\ extrahieren (ohne die *.txt).\r\nNach der Installation im Skyrim-Launcher die  MoWs&DoDsTicTacToeWetten.esp aktivieren und das Spiel wie gewohnt starten.\r\nZur Deinstallation bitte die oben aufgeführten Dateien manuell aus dem Data-Ordner löschen.",
  "categoryId": "28",
  "version": "1.0",
  "author": "dirtyolddunmer and Master of Worlds",
  "createdUnix": "1339326090",
  "updatedUnix": "1339326496",
  "containsAdultContent": false,
  "uploadedBy": "dirtyolddunmer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "67099",
      "name": "MoWs und DoDs Tic Tac Toe Wetten ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21438",
      "fileName": "MoWs und DoDs Tic Tac Toe Wetten -18524-1-0.7z",
      "uploadedUnix": "1339326496",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/18a25c69605e0aa47936be1bd50c678c7cd2ac7b01ff0287d7738eda8bc99299/analysis/1406949972/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MoWs%20und%20DoDs%20Tic%20Tac%20Toe%20Wetten%20-18524-1-0.7z?fid=67099&ttl=1535785442&ri=8192&rs=8192&setec=5c6015834fe01bb7cef762379ab95345"
    }
  ]
}