{
  "modId": 18569.0,
  "modName": "Place holder",
  "summary": "Camping Kit Plus",
  "descriptionHtml": "[center]\r\n[img]http://www.clan-tkcfiles.com/images/ckmod.png[/img]\r\n[img]http://www.clan-tkcfiles.com/images/quote.png[/img]\r\n[youtube]iHyE1xGbWYY[/youtube] [youtube]iRpsR0t6N7c[/youtube]\r\n[youtube]LGnCah2rk7I[/youtube]\r\n[img]http://www.clan-tkcfiles.com/images/header000.png[/img]\r\n[/center]\r\nAre you looking for camping gear that isn\\'t overpowered and stays true to Tamriel lore? Do you want the ability to hunt game while you sleep? Do you want to be able to setup your camp the way YOU want? If you answered \\\"yes\\\" to any of those questions, then look no further!\r\n\r\nThis is a set of camping gear packaged together nicely into two types of portable kits and is designed for those who are traveling Skyrim and want to sleep out in the wild. You can place each piece of your camp (the tent, the bedroll, the fire, etc) exactly where you want it, and then \\\"activate\\\" each marker to turn them into the real thing. Selecting \\\"pack up camp\\\" will instantly put everything back into your kit. No messy cleanup required!\r\n\r\nIt also boasts a robust trapping system allowing you to live off the land! Simply bait your traps, come back in a few hours, and hopefully you caught something! The trapping system takes into account both location and type of bait used. So use your wits as a skilled, knowledgable hunter and don\\'t be left out in the cold without a bear hide to keep you warm at night.\r\n\r\nWith the 1.4 update Camping Kit of the Northern Ranger now includes the ability to \\\"enter\\\" your tent. No more sleeping in the rain and snow, stay safe and warm inside your tent and sleep through the night like a baby.\r\n[center]\r\n[img]http://www.clan-tkcfiles.com/images/header005.png[/img]\r\n[/center]\r\n[color=#7b8e54]Version 1.4.3[/color]\r\n1) Created support for Skyrim Beta 1.6, added backwards compatability with previous versions of Skyrim.\r\n2) Updated the way traps are deployed - you still make the trap from your kit, but now you click it in inventory instead of dropping it.\r\n\r\n[color=#7b8e54]Version 1.4.2[/color]\r\n1) Added navmesh to interior tent to support NPC movement inside of the tent.\r\n\r\n[color=#7b8e54]Version 1.4.1[/color]\r\n1) Various bug fixes. \r\n[center]\r\n[img]http://www.clan-tkcfiles.com/images/header003.png[/img]\r\n[/center]\r\n[color=#7b8e54]The standard camping kit contains:[/color]\r\n1) Two Bedrolls (One for you, one Extra)\r\n2) Tent\r\n3) Campfire (can be ignired and doused for some Roleplaying fun)\r\n4) Cooking pot\r\n5) 3 Compact Camping Chairs\r\n6) 4 Leather Screens or Partitions\r\n7) An Animal Pelt\r\n8) The ability to make, bait and arm traps to capture hides and raw foods\r\n8) The ability to enter the tent.\r\na) A barrel inside the tent where you can configure your tent (click barrel to see the menu).\r\n\r\n[color=#7b8e54]The Imperial camping kit contains:[/color]\r\n1) Two Bedrolls\r\n2) A smaller tent\r\n3) A campfire\r\n4) Cooking Pot (Smaller)\r\n5) Two compact camping chairs\r\n6) 3 Leather Screens\r\n\r\nI also created a store to purchase these just outside of Riverwood (see below) with some books I wrote. This particular version does not include this store, rather you may find the kits for free underneath the staircase at the Riverwood Trader. Note that there are three versions, one with the original camping kit, one with the trader SELLING the kits, and one where you just pick the items up under the staircase.\r\n[center]\r\n[img]http://www.clan-tkcfiles.com/images/header001.png[/img]\r\n[/center]\r\nFirst pick which mod you want. The traditional one adds a new store called the Amberwood Camping Shop, which has some RPGish stuff and is a marker for future expansion. You can buy the kit here. If you\\'re a purist or just hate the idea of a new house being added to the game, use the second file, which simply adds the Camping Kit for sale at the Riverwood Trader (In Riverwood of course).\r\n\r\n[color=#7b8e54]Method #1 NMM)[/color]\r\nDownload using Nexus Mod Manager, then simply double click the mod to install.\r\n\r\n[color=#7b8e54]Method #2 Manual)[/color]\r\nIt\\'s pretty easy, download, unzip then just drag and drop the contents of my data folder into your skyrim data folder. It will add the scripts into the scripts folder, and the esm into the data folder.\r\n[center]\r\n[img]http://www.clan-tkcfiles.com/images/header002.png[/img]\r\n[/center]\r\n[color=#7b8e54]Amberwood Camping Shop Version[/color]\r\nThis is the traditional version, where you purchase the camping kit, for a reasonable price, in the Amberwood Camping Shop, located just outside Riverwood (The starting town) near the bridge leading out of town.\r\n\r\n[color=#7b8e54]Riverwood Trader Version[/color]\r\nThis is the alternate version that allows you to purchase the camping kit at the Riverwood Trader instead. This is for players who do not want to have the camping shop available in the game, but still wanted the camping features.\r\n\r\nActivate by clicking the camping kit in your inventory list, and it will automatically be removed from your inventory and placed in the general area in front of your character. Use the camping kit and follow the menu to build your very own camp exactly how you want it by dragging each marker (using the \\'E\\' key). You\\'ll notice many of the items can be further customized, such as setting the height (moving them up or down for best positioning) or even changing the angle.\r\n\r\nFor traps, definitely check out the video on Nexus or Steam, however the concept is fairly simple. Just click the trap in your inventory, and it will deploy to the ground beneath you. Then activate the trap by pressing \\'E\\', and you will bait the trap. The bait works like you were using a chest or a barrel - just transfer the piece of bait from your inventory to the trap. Now click the trap again (by pressing \\'E\\') and you will be able to arm the trap. After this is done, you\\'ll see an animation and you are all set. Come back in 1-4 hours and your trap will have sprung, hopefully with some bait.\r\n[center]\r\n[img]http://www.clan-tkcfiles.com/images/header006.png[/img]\r\n[/center]\r\n[color=#756473]Issue:[/color] If you can\\'t find the house to buy the kit.\r\n[color=#7b8e54]Solution:[/color] First be sure that you enabled the ESM file. You wouldn\\'t believe how many times I\\'ve got a new mod and for one reason or another forgot to enable it!\r\n\r\n[color=#756473]Issue:[/color] When you left click the camping marker in your inventory, the item does not deploy.\r\n[color=#7b8e54]Solution:[/color] Did you copy the scripts folder correctly? Remember my scripts need to be in your data/scripts folder.\r\n\r\n[color=#756473]Issue:[/color] I installed the Amberwood Camping Shop version and don\\'t see the shop.\r\n[color=#7b8e54]Solution:[/color] Make sure you enabled the mod.\r\n\r\n[color=#756473]Issue:[/color] The camping kit isn\\'t working when I left click it in my inventory.\r\n[color=#7b8e54]Solution:[/color] That probably means you didn\\'t copy the scripts folder correctly for some reason. Just go back and verify your scripts folder contains the ckcamping scripts.\r\n\r\n[color=#756473]Issue:[/color] Help! I upgraded and now things seem weird or off or broken.\r\n[color=#7b8e54]Solution:[/color] Remember the saying \\\"Rebooting solves 99% of the problems?\\\". I\\'ve solved so many of my own personal modding problems (even using other mods) by doing the following (this is really good to try)\r\na) Uncheck the mod\r\nb) Load your game. Bypass the nag message telling you that this save uses content which is no longer available.\r\nc) You\\'ll now notice you do not have the camping kits. Save your game, and exit.\r\nd) Check the mod back, optionally you can reinstall the mod.\r\ne) Load the game again, and buy the camping kit. It should \\\"reboot\\\"\r\nf) If no luck, send me an e-mail or post on here. I\\'ll look at it right away.\r\n[center]\r\n[img]http://www.clan-tkcfiles.com/images/ckhrbar.png[/img]\r\n[/center]",
  "categoryId": "78",
  "version": "0.1",
  "author": "nbtc971",
  "createdUnix": "1339373217",
  "updatedUnix": "1339373217",
  "containsAdultContent": false,
  "uploadedBy": "nbtc971",
  "primaryFile": null,
  "files": []
}