{
  "modId": 18571.0,
  "modName": "Alpine Lodge resource-abode",
  "summary": "Alpine Lodge is a cross between a modders\\\\\\' resource and a player abode.  It adds a completely different atmosphere to the game. NOT LORE FRIENDLY.",
  "descriptionHtml": "ALPINE LODGE\r\n\r\n===========================\r\nUPDATES\r\n===========================\r\n1.1 (Oct 2012)\r\nChanged...Teleporting runes are now in the \\\"Scrolls\\\" section of the player inventory.  They are equipped and cast just as scrolls are.  This was due to some funky behaviour when moving them about and due to losing references to the runes...which made them eventually disappear which naturally broke them.\r\nFixed...Corrected some snap-to-grid errors.\r\nFixed...Adjusted some of the bridge pieces.\r\nFixed...Placement of the AlpineLodge.esp file in the archived 7-zip file is now correct.\r\n\r\n===========================\r\nDESCRIPTION\r\n===========================\r\nEnter the Riverwood Trader to begin the mini-quest that explains Alpine Lodge.\r\n\r\nAlpine Lodge is sort of a cross between a lavish player abode and a modders\\' resource.  The player can simply use it as a player abode and enjoy all of its amenities.  Or a modder can utilise it for further development.\r\n\r\nAs it stands, aside from the tiny quest to obtain the key and journal directions, it is a latent player house...meaning there are no quests involved, nor enemies to overcome or any puzzles to solve.  \r\n\r\nThe purpose of this mod is to create a completely different atmosphere and inject it into Skyrim.  Many new \\\"building materials\\\" were created with a more colourful and modern look than what is included in the stock game of Skyrim.  \r\n\r\nThat being said, many will note that this mod was not what they would call \\\\\\\"lore-friendly\\\\\\\".  The style is decidedly NOT mediaeval or native to Skyrim.  Those who are strictly adherant to lore, and must have everything fit the style of the game, will probably want to pass on this mod.\r\n\r\nIn anticipation of any negative comments regarding the non-lore aspects of this mod, please avoid commenting with same in the comments.  We already know---and have properly warned---about this.  If you don\\'t like what the mod is, the simple solution is to pass on by.\r\n\r\n\r\n===========================\r\nINSTALLATION and REMOVAL\r\n===========================\r\nVERSION 1.0 ONLY --- TEMPORARY NOTICE:  The \\\"AlpineLodge.esp\\\" was accidentally left in the root folder, rather than being placed in the \\\"data\\\" folder where it belongs.  Just move it to the data folder, and the game will pick it up normally.\r\n\r\nFirst of all \\\"bBorderRegionsEnabled=0\\\" must be in your \\\"Skyrim.ini\\\" file.  If you have \\\"bBorderRegionsEnabled=1\\\", change it.\r\n\r\n------->>> IMPORTANT NOTICE <<<------\r\nIf the previous version of this mod is already installed, do the following: \r\nFirst, be sure to remove anything you wish to keep from the mod\\'s cells, and also move your character out and away from the any of the mod\\'s cells.  \r\nThen make a save.  \r\nNow disable this mod and reload the save (ignore the error message).\r\nMake another new save. \r\nThen, re-install the mod as per the usual procedures below.\r\nReload the last save you made. \r\nFailing to follow this procedure will break the teleporters.\r\n---------------------------\r\n\r\nThen the usual procedures....  \r\n\r\nIf installing manually, copy and paste the \\\\\\\"data\\\\\\\" folder and its contents into your Skyrim install folder (by default: \\\"C:\\\\program files(x86)\\\\Steam\\\\Steamapps\\\\Common\\\\Skyrim\\\\\\\")\r\nIf you are updating, make sure you choose \\\"yes\\\" when asked if you want to merge or overwrite files and folders.\r\n\r\nIf using a mod manager that can pick up the \\\"7z\\\" file, follow the methods indicated by the mod manager.\r\n\r\nEnable the mod by ticking the box next to \\\"AlpineLodge.esp\\\" in the launcher.\r\n\r\n\r\nUninstalling is the reverse of the above.\r\n\r\n\r\n===========================\r\nCOMPATIBILITY\r\n===========================\r\n\r\nDAWNGUARD:  This has been tested for several hours in conjunction with Dawnguard.  So far, there have been no incompatibilites with Dawnguard.\r\n\r\nCurrently we know of no incompatibilities with existing mods.  If you are using a mod that installs any objects or alters the Tamriel landscape around the border of Cyrodiil and Skyrim south of Fort Neugrad, it may conflict with this one.\r\n\r\nThe mod was designed to leave as small a footprint as possible on the playable worldspace.  In addition to the larger area mentioned above, it modifies to an extremely miniscule degree the following Tamriel locations:  Just south of Riften behind the back wall of the Jarl\\\\\\'s establishment.  Just south of Riverwood as you leave the south gate and turn west.  And the delivery boy is placed inside the Riverwood Trader, and remains there with stock dialogue for the remainder of the game (or until this mod is uninstalled).\r\n\r\n\r\n===========================\r\nCREDITS and PERMISSIONS\r\n===========================\r\nPaintings:\r\nPaintings (and frames) are courtesy of Artisanix from the TESAlliance site.  Thank you, Artisanix for creating them and providing them as a resource for modders.  Anyone else interested in including the paintings in their works, please visit Artisanix\\'s page here: http://tesalliance.org/forums/index.php?/files/file/1241-skyrim-paintings-and-frames/\r\n\r\nLift Sound Effects:\r\nCourtesy of BBC royalty free sound effects library.\r\n\r\nGeneral Construction and Modelling:\r\nTravis Moran, BC Canada\r\n\r\nQuest Creation, Texturing, Modelling, and Navmesh:\r\nAndrew Clements, BC Canada\r\n\r\nScripting and Mine Creation:\r\nWayne DeRaad, Wyoming USA\r\n\r\nClutter and Finishing Touches:\r\nNancy Krantz, BC Canada\r\n\r\nVoice of Delivery Boy (voice didn\\'t quite match, but he had fun with his line):\r\nBobby (Neighbour\\'s boy), BC Canada\r\n\r\nBeta Testing:\r\nLaughingMan008...Thanks for your help LaughingMan.\r\n\r\nAnd of course the countless wonderful minds that lurk about the Nifskope, Nexusmods, and Bethsoft forums.  Without you people (way way way too many to list), we would have been helpless.\r\n\r\nGame and Creation Kit tool:\r\nBethesda...bless their hearts for being modder friendly.\r\n\r\nInvaluable Tools:\r\nNifskope\r\n3DS Max\r\nPhotoshop\r\nTESVSnip\r\nNifUtilits\r\nUnFuzer\r\nWrye Bash\r\nCreation Kit\r\nA brain or two\r\n\r\nUSAGE:\r\nAs usual, and as with all of our mods, anyone is welcome to use any part of our creations however they would like.  No credits or permissions are needed.  If even only one person enjoys it, that\\\\\\'s good enough for us.  \r\n\r\nPlease note again, that two aspects of this mod are NOT our creations.  The paintings and frames were created by Artisanix, and the sound effects are from the BBC library, as mentioned above.  \r\n\r\n====================================\r\nNOTES And BUGS --->Spoiler Alert<---\r\n====================================\r\nLift issues:\r\nIf you ride the lift in third-person view, there is a glitch as the lift begins descending.  It\\'s almost as if the game briefly changes from third to first-person and back again very quickly.  Oddly, this does not occur on ascent...only descent.\r\n\r\nCompanions and followers will NOT ride the lift.  They will follow you via the spiral ramp if you use the lift however.  Mr. DeRaad, who did most of the scripting, has indicated he will look at the possibility of adding NPCs to the lift.  I am not going to press him as he is an older man and only did the current scripting for me because he is my dad\\'s best friend from university.\r\n\r\nMine:\r\nThe mine was intended to be a sort of maze...So, if you get lost, it\\'s intentional.  The idea was to have the player feel lost at least a few times while exploring and mining the mine.  Naturally, once a player has gone through it a couple of times, they won\\'t get lost any more.  But of course they can keep on mining ores as long as they wish.  We looked at the possibility of making the mine dynamic so that upon each entry, the layout would be different. But I guess you can imagine the massive work that would be.\r\n\r\nThere is no Navmesh in the mine area.  Followers will not go in there.  I can\\'t see any compelling reason for them to need to follow in there unless you want to modify the mine area to include items/creatures they could interact with.  It wouldn\\'t be too hard to install Navmesh in the mines if you so desire...We just didn\\'t choose to do so.\r\n\r\nUsage suggestions:\r\nThis mod might be ideal for a person who wants to use it as a headquarters for a new quild.  With secret entrances and an isolated location, it makes for a unique hideout.\r\n\r\nThis mod is the ideal player home.  If a person were to add a few resident merchants, it might even be more like a mini-village.\r\n\r\nInitial Mini-Quest:\r\nIt is possible to by-pass this quest and access the Alpine Lodge straightaway by entering via one of the secret entrances...and thereby avoid the longish journey through Helgen and Fort Neugrad and up the mountain to the Alpine Lodge.  There is a spare key kept in the strongbox at the front desk of the Alpine Lodge.\r\n\r\nEagle Room and Raven Room:\r\nComes from Haida tradition. All Haidas are either Eagle or Raven moiety depending on what our mothers are (i.e. A Raven mother has Raven children).  We are supposed to only marry the opposite moiety.  Like since I am Raven, I would marry Eagle (which I did actually...but not at all because of this custom).  And all of my children will be Eagle.\r\n\r\nMountaintop Location and general inspiration:\r\nComes from a combination of my Oblivion mod called \\\"Sky Summit Lodge\\\" and the Oblivion add-on called \\\"Wizards Tower/Frostcrag Spire\\\".  The location of Alpine Lodge was supposed to be approximately where the Frostcrag Spire was/is in Oblivion.  But actually it\\'s more to the west (Maybe around just north of where Bruma is).\r\n",
  "categoryId": "28",
  "version": "1.1",
  "author": "Travis Moran et al",
  "createdUnix": "1339376391",
  "updatedUnix": "1350930955",
  "containsAdultContent": false,
  "uploadedBy": "haidaboy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "67250",
      "name": "AlpineLodge",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "89741",
      "fileName": "AlpineLodge-18571-1-0.7z",
      "uploadedUnix": "1339377725",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/05c6b325f90011b89b3df62290145a8fa83e775e83734cdea3d76c74295874c6/analysis/1406951780/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AlpineLodge-18571-1-0.7z?fid=67250&ttl=1535785510&ri=8192&rs=8192&setec=ebfd4a95946cef17dd05feac92be880f"
    },
    {
      "fileId": "95206",
      "name": "Alpine Lodge Update 1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "89582",
      "fileName": "Alpine Lodge Update 1-1-18571-1-1.7z",
      "uploadedUnix": "1350930955",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2f0e72d4ad628b2874c4246a2880f7ce14d501e672978f09bc7a650ef8eb1d74/analysis/1407232294/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alpine%20Lodge%20Update%201-1-18571-1-1.7z?fid=95206&ttl=1535785511&ri=8192&rs=8192&setec=982ffb0d7ee9c9810f26889c0c4366b1"
    }
  ]
}