{
  "modId": 18575.0,
  "modName": "Amethyst Hollows Dreamworld",
  "summary": "Amethyst Hollows is a large residential estate that exists in a dreamworld with interactive features such as a functional shooting range and dynamically switchable scenery, as well as player-clone re-skinnable mannequins.",
  "descriptionHtml": "[img]http://static.skyrim.nexusmods.com/images/3196427-1351305716.jpg[/img]\r\n(Photo by [url=http://skyrim.nexusmods.com/images/102408]Hammypal[/url])\r\n\r\n[color=red][b]\r\n**********************************************************************************************\r\n\r\nIMPORTANT NOTE - FOR USERS RUNNING SKYRIM PATCH 1.7, THERE IS A NEW DIALOGUE BUG. IF YOU ARE GETTING DIALOGUE GLITCHES (NO DIALOGUE MENU SHOWS UP), SAVE THE GAME, QUIT TO MAIN MENU AND RELOAD THE SAVE. IT SHOULD WORK AGAIN.\r\n\r\n**********************************************************************************************[/b][/color]\r\n\r\nAmethyst Hollows is a large residential estate that exists in a dreamworld which can only be accessed by consuming a hallucinogenic potion called Amethyst Torpor.\r\n\r\nAmethyst Hollows contains interactive features such as a functional shooting range and dynamically switchable scenery, as well as player-clone re-skinnable mannequins.\r\n\r\nFull back-story text as seen in-game in Raefik\\'s Journal: [url=https://docs.google.com/document/d/1c5eu033l-gLS9VhH7pU1fk0eUdpjMfMbpTa8CzfSr6E/edit]Read Here.[/url]\r\n\r\n[b][color=red]Requirements:[/color]\r\nSteam-enabled copy of Skyrim (non-pirated) - scripts/folders might not work properly unless Skyrim was originally installed via steam (does not need to be online). Otherwise use at your own risk.\r\nSkyrim patched to AT LEAST 1.6 or higher.\r\nSkyrim.esm and Update.esm must be enabled.[/b]\r\n\r\n* This mod is not recommended to be used with lower-end systems.\r\n** If you are using ENB, the lighting may vary drastically and in some cases, affect the lighting of this mod negatively.\r\n\r\n[b][color=red]Recommended mods:[/color][/b]\r\nThis mod was designed with the following mods in mind (but not required) - Make sure you grab the latest versions:\r\n[url=http://skyrim.nexusmods.com/mods/7654]Realistic Lighting with Customization[/url] To match Amethyst Hollows\\' lighting style with the rest of Skyrim\r\n[url=http://skyrim.nexusmods.com/mods/2812]Better Females by Bella[/url] To get Antoinette, Annastasia and Eurielle to appear as originally intended\r\n[url=http://skyrim.nexusmods.com/mods/14037]Ultimate Follower Overhaul[/url] or [url=http://skyrim.nexusmods.com/mods/9504]Followers can Relax[/url] To take advantage of NPC Idle points inside the palace and the wharf\r\n[url=http://skyrim.nexusmods.com/mods/11370]Spouses Can Live Anywhere[/url] If you want an easy way to move your spouse into the Palace\r\n[url=http://skyrim.nexusmods.com/mods/17174]Pinup Poser[/url] AND [url=http://skyrim.nexusmods.com/mods/11811]FNIS Behavior files v2.1[/url] To take advantage of mannequin pose changing (\\\"Change Pose\\\" option won\\'t have any effect otherwise).\r\n\r\n*Note: Mannequin mods have no effect, Amethyst Hollows uses proprietary mannequins.\r\n\r\n*DISCLAIMER: This mod contains content that mildly features implied hallucinogenic drug use (non-illicit). It is not my intent to condone or glorify substance abuse in any way.\r\n\r\n\r\n[img]http://static.skyrim.nexusmods.com/images/3196427-1351305743.png[/img]\r\n[color=red] - Dynamic selectable scenery:[/color] Change the indoor scenery of the main living area with a push of a button.\r\n[color=red] - Shooting range:[/color] Functional moving target dummies that track your score depending on body part hit as well as distance (Rewards Gold, Silver or Bronze trophy and achievement).\r\n[color=red] - Personalized mannequins:[/color] Re-skinnable mannequins allow you to change the appearance to an exact clone of your character.\r\n[color=red] - Proprietary furniture:[/color] Redesigned crafting stations, Weapon displays, Bookshelves, Jewel box displays.\r\n[color=red] - Auto-storage:[/color] Storage closet with organized bins, and conveniently located access points for easy item management.\r\n[color=red] - NPC service personnel:[/color] Bartender, bard, chef, housekeeping, merchants.\r\n[color=red] - Dining area:[/color] Restaurant style lounge where you will be waited on and served.\r\n[color=red] - Sunset Wharf:[/color] Outdoor beach with permanent sunset view (Vampire-friendly sunlight, Follower-relax-friendly idle points).\r\n\r\n\r\nView changelog for version notes (click on version number next to the Endorsements stats).\r\n\r\n[b][color=red]Upcoming features:[/color][/b]\r\n - Learn Amethyst Hypnosis spell - Concentrated dose of Amethyst Torpor that places up to 12 non-essential NPCs (must have vanilla generic voice type) under a spell that sends them into the hollows and fills a chosen role (like a trainer, assistant.... concubine lol)\r\n - BlackJack card game - Test your hand against Laars the bartender for a friendly game of blackjack with wagering.\r\n - Extended armory section connected to the shooting range that will house additional mannequins and weapon racks.\r\n - Hunting grounds - A wooded exterior with matching sunset views, where you can select which type of prey to hunt and optionally mount your kill\\'s head on a plaque.\r\n - Equestrian track - Scores based on time and jump accuracy.\r\n - Additional scenery for the Lounge - Possibly. No promises. I\\'m already pushing the limit for what the CK can handle on the palace interior so this may not be possible, but ideally i would also like to add a snowy scene and falling leaves scene if possible.\r\n\r\n\r\nOther languages:\r\n[url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/bordeciel/habitations/le_creux_damethyst.php]French[/url] - Translated by Felberyn\r\n[url=http://skyrim.nexusmods.com/mods/19506]German[/url] - Translated by Nahkin\r\n[url=http://skyrim.nexusmods.com/mods/22042]Chinese[/url] - Translated by Creed007\r\n\r\nPlease refer to ReadMe for additional info.\r\n** This mod was NOT edited by TesVSnip in any way.\r\n\r\n\r\n[img]http://static.skyrim.nexusmods.com/images/3196427-1351334369.png[/img]\r\n[color=\\\"red\\\"]NMM[/color]\r\n1. Download with NMM or download manually then add mod from file.\r\n2. Install.\r\n\r\n\r\n[color=red]Manual[/color]\r\n1. Download manually.\r\n2. Extract the 7z file and its contents.\r\n3. Drag contents into Skyrim\\\\Data and merge/overwrite when prompted.\r\n4. Enable BOTH amethysthollowsmaster.esm AND amethysthollowsupdate.esp.\r\n\r\n\r\n[color=red]Uninstalling[/color]\r\nFor a permanent uninstall (as in you don’t ever plan to use the mod again). This methos will ensure a SAFE AND CLEAN uninstall process that will reduce your risk of having a corrupted save game.\r\n\r\n1. First and foremost, remove anything from the Amethyst Hollows area that you want to keep (uninstalling will cause all of those items to vanish), including any followers you have “relaxing” in the area.\r\n\r\n2. Exit the area into a safe location, such as a vanilla exterior in Skyrim. Wait in-game about 3-4 days. Save your game. Quit Skyrim.\r\n\r\n3. Download and install the UNinstaller Files from the Optional files section (unpack and drag contents into Skyrim/Data). Overwrite everything when prompted.\r\n\r\n4. Re-load your save game, wait an additional 24 hours in-game. Save and exit.\r\n\r\n5. Delete the following ONLY:\r\nAmethystHollowsMaster.esm\r\nAmethystHollowsUpdate.esp\r\nAmethystHollowsUpdate.bsa\r\n\r\nDO NOT delete the scripts files. Deleting scripts from any scripted mod will cause permanent errors in your save game FOREVER (this goes for ANY mod, unless it has a specific uninstall feature that allows you to delete scripts afterward)\r\n\r\n** If you ever uninstall another mod that contains a significant amount of scripts, please ask the mod author for similar uninstall files and safe uninstall procedure. If they are unaware of this issue, refer them to this article in the CK Wiki: http://www.creationkit.com/Save_File_Notes_(Papyrus)\r\n\r\n\r\n[img]http://static.skyrim.nexusmods.com/images/3196427-1351334416.png[/img]\r\n[color=red]Known issues:[/color]\r\n - There is a large transparent white square that appears over the Hollows wharf area at around 12 midnight (skyrim game-time), and lasts for a few seconds. This is actually part of the game\\'s built in physical Sun, but unfortunately I am unable to suppress it entirely.\r\n\r\n - It may actually be possible to have your Mannequin clone show up at Temple of Mara as a wedding guest. Hilarious, but harmless. The mannequin will eventually make its way back to the Hollows, but if you do not want to wait for it, you can disable that mannequin and then create a new one in its place. You will not lose any of the armor it was wearing.\r\n\r\n - If you are using the Change pose feature for mannequins with Pinup Poser installed, the mannequin will be \\\"alive\\\" and blink or even turn its head to look at you while holding the pose. Some may find this disturbingly creepy, I personally think it\\'s cute LOL. In any case, you can always revert back to Statue mode by selecting Reset Position, but its pose will be reset to the default standing pose.\r\n\r\n\r\n[color=red]How do I find the place?[/color]\r\n\r\nYou should receive the quest objective as soon as you start the mod. The location is inside a waterfall in Darkwater River just below Nilheim (directly across from the Darkwater Pass exit). You must complete the initial quest in order to qualify for ownership.\r\n\r\n[color=red]Does this mod work with followers?[/color]\r\n\r\nYes. This mod will allow any number of followers to come into the dreamworld with you. It was designed to be used with follower mods that allow them to relax and roam about.\r\n\r\n[color=red]I play as a Vampire, Is this home safe?[/color]\r\n\r\nThe exterior and interior sunset is artificial. In this dreamworld, it does not act as a real sun would. I have set the sun damage output of the unique weather system at 0%, so it should be totally safe for vampires. If you are using a mod such as Belua Sanguinare, you can deactivate the temple shrines by speaking with Raefik about upgrading the home (you may need to speak with him more than once for it to appear in the dialogue).\r\n\r\nYou may still receive notifications (and verbal complaints from Serana) about weakness in daylight while in the Sunset Wharf docks during in-game day time, but the artificial sun actually does no damage and you will not incur any negative magic effects.\r\n\r\n[color=red]How does the Auto-storage system work?[/color]\r\n\r\nFirst head over to the kitchen and open the storage closet. Read the book \\\"Hoarding Addiction and Recovery\\\" to gain a new power \\\"Raefik\\'s Denial\\\". The power will let you access the auto storage system from anywhere in the world.\r\n\r\nOnce you place an item (any item) into any of the containers marked \\\"Auto-Storage\\\" the item will be automatically sent into its appropriate container. For example if you drop a sword into the Leather bin, it will be sorted into the Weapons bin automatically. This is a one-way transfer (you will not be able to retrieve it from the same menu once its been dropped), you will have to retrieve it manually from the weapon bin. This system is not meant to be used as an on-the-fly auto-sort-and-retrieval, it is mainly for those of us who have hoarding OCD and need a quick and easy way to dump loot into storage containers.\r\n\r\nYou can optionally use the pull-chain located on the right hand wall of the storage closet to turn the auto storage system on/off.\r\n\r\n*Note: if an item does not have the proper keyword, or it was created with an incorrect filing in the CK, the item will be sent to the Miscellaneous container instead.\r\n\r\n[color=red]How does the Amethyst Beacon and map work?[/color]\r\n\r\nPlace the beacon in any exterior or interior by dropping it from your inventory. the place where you are standing when you drop the beacon will be marked and an option to travel to it will now appear on the map in the Palace. You can pick up the beacon and drop it in a new place if you want to change the travel location.\r\n\r\n[color=red]It\\'s too dark and/or lights are flickering on/off[/color]\r\n\r\nThis mod was designed with Realistic Lighting in mind, and it\\'s lighting effects are designed to match those. It was also designed with no ENB installed, so installing an ENB mod may cause some unexpecting lighting results. But more importantly, as a whole, the palace interior is already very resource-intensive, so lower end graphics cards may have a hard time keeping up.\r\n\r\n[color=red]It\\'s too expensive. I can\\'t afford the cost of the palace.[/color]\r\n\r\nIt is actually possible to get the house legitimately for free (quest-related).\r\n\r\n[img]http://static.skyrim.nexusmods.com/images/3196427-1351334444.png[/img]\r\nJustinOther, RandomNoob and all the hooligans and regulars at the Bethsoft official CK forums, whose help was invaluable in my learning of Papyrus scripting language.\r\n\r\nFelberyn for [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/bordeciel/habitations/le_creux_damethyst.php]French translation[/url]\r\nNahkin for [url=http://skyrim.nexusmods.com/mods/19506]German translation[/url]\r\nEriko for Russian translation\r\nCreed007 for [url=http://skyrim.nexusmods.com/mods/22042]Chinese translation[/url]\r\n\r\nAlso to [url=http://skyrim.nexusmods.com/mods/16028]Rayek\\'s End[/url] which greatly inspired me to fancy-up the crafting furniture. This mod is a must-have for small sized hideouts.\r\n\r\n[color=red]Permissions:[/color]\r\nI have made all of my script source available for anyone to see so that it may benefit the community as a whole and we can all learn from each other. I encourage ALL modders to do the same. You are free to use any of my source code, but please at least mention me in a credit somewhere. You are free to use any of my assets packaged with this mod EXCEPT for custom made textures (the vanilla re-colors are ok). If you are unsure, feel free to ask me.\r\n\r\n\r\n[img]http://static.skyrim.nexusmods.com/images/3196427-1351334760.png[/img]\r\n[youtube]PrP8Z-e8J9M[/youtube][youtube]OYKmLJJ6R1Y[/youtube]\r\n[youtube]KjJ8iZHa0Vk[/youtube][youtube]uWZF9dDf0ow[/youtube]",
  "categoryId": "67",
  "version": "1.5",
  "author": "AmethystDeceiver",
  "createdUnix": "1339380812",
  "updatedUnix": "1346912659",
  "containsAdultContent": false,
  "uploadedBy": "AmethystDeceiver",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70569",
      "name": "Amethyst Hollows CLEAN UNINSTALLER FILES",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "29",
      "fileName": "Amethyst Hollows CLEAN UNINSTALLER FILES-18575-.7z",
      "uploadedUnix": "1340795865",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/802863f3cd848d7f15238f98deea1e8a96fe7f7169794bd2b0431428a90f7330/analysis/1406985783/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Amethyst%20Hollows%20CLEAN%20UNINSTALLER%20FILES-18575-.7z?fid=70569&ttl=1535785517&ri=8192&rs=8192&setec=09924e9bfee996535d4e58bfacdcf41e"
    },
    {
      "fileId": "70571",
      "name": "Amethyst Hollows - V1-5",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26060",
      "fileName": "Amethyst Hollows - V1-5-18575-1-5.7z",
      "uploadedUnix": "1340796153",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/5d7a4e68196692d8e0a6cf057be0ddc2748a00d6306b9810220cae9ffcf356c7/analysis/1406985796/",
      "changelogHtml": " Mannequin feature added: Rotate clockwise incrementally. <br/> \n Mannequin Reset Position now resets all your pose, position and rotation settings back to default <br/> \n Fixed several item sorting errors for Auto-Storage <br/> \n Minor script optimizations <br/> \n Amethyst Beacon now works in indoor locations <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Amethyst%20Hollows%20-%20V1-5-18575-1-5.7z?fid=70571&ttl=1535785518&ri=8192&rs=8192&setec=4706508d57172902a123bf2d8b037d19"
    },
    {
      "fileId": "86730",
      "name": "Temporary patch for broken PinupPoser mannequin poses",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "220",
      "fileName": "Temporary patch for broken PinupPoser mannequin poses-18575-.7z",
      "uploadedUnix": "1346912659",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3a3d1b8b8904dd68ea685636eeea662248509a0ec0bc2025df84daeda705ce79/analysis/1407148573/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Temporary%20patch%20for%20broken%20PinupPoser%20mannequin%20poses-18575-.7z?fid=86730&ttl=1535785518&ri=8192&rs=8192&setec=58f118eab695b05495117930694ba8ae"
    }
  ]
}