{
  "modId": 18576.0,
  "modName": "Rendspire Palace",
  "summary": "I wanted one place to live and store everything. Rendspire Palace is a very large, very detailed, player owned palace with an equally large hidden armory and more safe storage than you\\'ll ever need. The palace occupies its own worldspace which can be accessed through a cave called \\\"Providence\\\" south of Whiterun (fast travel enabled).",
  "descriptionHtml": "This mod is no longer being supported - please refer to \r\nRendspire Palace Reborn\r\nhttp://skyrim.nexusmods.com/mods/23134\r\n\r\nIf you\\'re running version 2.0 or 2.1, I would recommend upgrading to Rendspire Palace Reborn using the address above. Unfortunately, version 2.0 & 2.1 both contain bad edits to navmesh in the Tamriel worldspace, which may cause a few unrelated bugs. These issues have since been corrected in Rendspire Palace Reborn.\r\n\r\nIMPORTANT:  If you\\'re running an older version of Rendspire Palace, please reference the \\\"Notes\\\" section when upgrading to version 2.1\r\n\r\nVersion 2.1 change notes:\r\n- Added weapon snapping in the form of hidden weapon mounts to most all of the palace display cases to help prevent Havok from throwing around weapons on display.  Please reference the \\\"Notes\\\" section below for important information about this feature.\r\n- Resized the tilted display cases to make them a little bit larger.\r\n- Lowered the height of the Armory display cases.\r\n- Added additional mannequins to the Great Hall and the Armory.\r\n- Added a bit of additional storage to the Lord\\'s Chamber.\r\n- Various clutter and lighting changes.\r\n\r\n\r\nVersion 2.0 change notes:\r\n- Added navmesh to the entire palace.\r\n- Added palace guards, prisoners and NPC\\'s with full AI packages.  There\\'s 18 unique NPC\\'s, including seven potential followers, a palace merchant, bartender, blacksmith, fence, bard, and a vampire who wants to kill you.\r\n- Rebuilt and simplified the Tamriel worldspace hookup.\r\n- Split the sub-level into two seperate cells to improve performance, given the addition of palace guards.\r\n- Added a palace training room (new cell) off of the sub-level east to replace the old training room in the south wing which I converted into a bedroom.\r\n- Teleport stones now require a key to unlock.\r\n- Added a teleport stone in Whiterun next to Olava\\'s house that links up with Providence.\r\n- Made the palace a little bit brighter.\r\n- Lots of minor changes to clutter.\r\n- Increased the size of the armory display cases.\r\n- Removed patch requirement.  This mod no longer requires any patches, however I have not tested it below 1.6.  It is compatible with Dawnguard.\r\n\r\n\r\nVersion 1.1 change notes:\r\n- Added a small cave called “Providence” as an intermediary between the Tamriel worldspace and the canyon to address a number of potential issues… most notably the floating grass issue.\r\n- Moved the exterior convenience teleport stones from the Tamriel worldspace into a secret room in Providence.\r\n- Turned off full LOD on exterior objects in Tamriel worldspace.\r\n- Cleaned a few very minor things I missed when cleaning the previous version.\r\n- Made the teleport stones smaller (I think they look better smaller)\r\n- Added / edited clutter including a few extra containers and display cases\r\n\r\n\r\n\r\n\r\nI wanted one place to live and store everything. Rendspire Palace is a very large, very detailed, player owned palace with an equally large hidden armory and more safe storage than you\\'ll ever need. The palace occupies its own worldspace which can be accessed through a cave called \\\"Providence\\\" south of Whiterun (fast travel enabled).  Though the home is free, the hidden armory is guarded by a high-level, ancient vampire who doesn\\'t like you very much.\r\n\r\n\r\nPlease be aware that this mod is really designed for high performance computers.  The interior cells have a lot of clutter and are not optimized due to shared walls, etc.\r\n\r\n\r\nContainers meant for storage throughout the palace are marked \\\"(Safe)\\\". You\\'ll find them mainly in the south wing library, the office in the north wing, the Lord\\'s Chamber and the Armory. The palace cells will reset, and I can\\'t promise that containers not marked as safe won\\'t respawn, so you\\'ve been warned.  (Loose items on mannequins, plaques, display cases, or on the floor or whatever, do not disappear when the cell resets.)\r\n\r\n\r\nThe palace itself is massive, and therefore I\\'ve added teleport stones which can be used to fast travel between important rooms. As of version 2.0, these teleporters now require a key held by the armory\\'s vampire.\r\n\r\n\r\n\r\n\r\nLOCATION:\r\nRendspire Palace is located south of Whiterun in the Canyon of Tears. Fast travel is enabled.\r\n\r\nINSTALLATION:\r\nSee the \\\"Notes\\\" section below for important information about upgrading a previous version to version 2.1.  For new installs, copy the \\\"Data\\\" folder to your \\\"Data\\\" folder and activate the esp, or feel free to use NMM (recommended).  As of version 2.0, there are meshes and textures included.\r\n\r\nPERMISSIONS:\r\nYou can do whatever you want with this mod.  Just, please give me any due credit.\r\n\r\n\r\n\r\n\r\nNOTES:\r\n\r\n- Rendspire Palace version 2.1 must be launched from a clean save in order to prevent a bug with the weapon snapping display cases.  This means that if you\\'re running a previous version of Rendspire Palace (prior to 2.1), you need to deactive it, save the game with the esp deactivated, and launch version 2.1 from the save that has the original file deactived.  Please keep in mind that you WILL lose anything previously stored in Rendspire Palace during this process... so make sure you take anything you don\\'t want to lose before deactivating any older versions.  I realize this isn\\'t terribly convinient when upgrading, but I couldn\\'t find another way around this issue.\r\n\r\n- The weapon snapping feature of the display cases is accomplished using hidden weapon mounts, which does have a few oddities.  Maces sink into the display case a bit, and magical staffs don\\'t quite fit completely into the case.  Additionally, the display cases are not meant for non-weapon items... attempting to store things manually in the display case could potentially cause some issues with the weapon snapping and therefore I wouldn\\'t recommend it.\r\n\r\n- While in the canyon, the compass displays the directions incorrectly. If anyone knows how to fix this, please let me know.\r\n\r\n- The entrance to the hidden armory is located in the Lord\\'s Bedroom behind a hidden door. The false back displays the text that states you can activate it to open, however in reality it requires you to pull on the chain that\\'s hidden behind a banner in the room. I\\'m not sure how to make that text disappear.\r\n\r\n- The teleport stone TO Whiterun allows you to use it without the key.  I\\'m sure it probably has to do with location, but I\\'m not sure how to fix it yet.\r\n\r\n- Parts of the Rendspire Worldspace and the hiddin armory do not have navmesh.  This is on purpose, folks.  Just be aware that your followers can\\'t follow you EVERYWHERE... most everywhere, though.\r\n\r\n- Magnus Gaul is an Orc follower who loves you and will give you access to Orc strongholds without really any effort on your part... kind of an unintended consequense of adding an Orc follower, I guess.\r\n\r\n\r\n\r\n\r\nIf you like this mod but are looking for something a bit smaller, check out my edits to the Honeyside home in Riften:\r\nhttp://skyrim.nexusmods.com/mods/edit/?id=20959",
  "categoryId": "68",
  "version": "2.12",
  "author": "Shoeski11",
  "createdUnix": "1339383412",
  "updatedUnix": "1339977354",
  "containsAdultContent": false,
  "uploadedBy": "Shoeski11",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68719",
      "name": "Rendspire Palace - No NPCs or Navmesh",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "296",
      "fileName": "Rendspire Palace-18576-1-1.rar",
      "uploadedUnix": "1339977354",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/fe451aef52f97384f7745866fc140633ff961936b181e0a88c11f1438aaf5a9a/analysis/1406966410/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rendspire%20Palace-18576-1-1.rar?fid=68719&ttl=1535785519&ri=8192&rs=8192&setec=34e5afcee997780027cfbaa014255aec"
    }
  ]
}