{
  "modId": 18585.0,
  "modName": "Shortswords for Skyrim",
  "summary": "Adds new shortswords to the game. Perfect for players who look for a weapon to fill the gap between the normal sword and the dagger.\r\nThe mod contains 10 different blades!",
  "descriptionHtml": "[url=https://twitter.com/PrvtIPrivateEye][img]http://i.imgur.com/N4B7zRX.png[/img][/url]\r\n[img]http://i.imgur.com/ODQjr.jpg[/img]\r\n\r\n[size=8]Attention![/size]\r\nNow that [url=http://skyrim.nexusmods.com/mods/21120]Heavy Armory[/url] has been released, I won\\'t be updating this mod anymore. Heavy Armory also includes my shortswords, so there\\'s no real reason not to get it. I advice switching over to that mod now and deactivating this one to make sure you always have support if a problem with the mod occurs.\r\nOf course, you can keep using this mod, but I won\\'t be updating it anymore.\r\n\r\n[youtube]xbDWv2wVXrk[/youtube]\r\n[b]Featured on Skyrim Mod Spotlight![/b]\r\n\r\n[img]http://i.imgur.com/Tub2a.png[/img]\r\nLooking for a German version? It\\'s right [url=http://skyrim.nexusmods.com/mods/20243]here[/url]!\r\nThanks to powerbenny1706 for translating!\r\n\r\n[size=5]What is it about?[/size]\r\n\r\nDid you ever miss the shortswords that disappeared from the Elder Scrolls series after Oblivion?\r\nOr are you looking for a weapon to fill the gap between the dagger and the normal sword?\r\nThan this is your mod!\r\nThe shortsword will make a fine weapon for any assassin or thief who needs an extra combat weapon.\r\nAlso spellblades, battlemages and other hybrid fighter classes who can\\'t carry a heavy weapon with them will find these blades useful.\r\n\r\nThe shortsword is one of the latest victims of the \\\"simplifaction\\\" in the Elder Scrolls series, as they were left out in Skyrim.\r\nWorry no more now, because this mod brings them back!\r\nThere are 14 different kind of shortswords. Besides the \\\"standard\\\" iron, steel, orcish, dwarven, elven, glass, ebony and daedric, you will also find Draugr, Silver and Imperial shortswords.\r\nAll swords can be crafted at any forge under the relevant smithing categories and upgraded at the grindstone.\r\nMost can also be found in shops, on npc\\'s or in loot. Every shortsword shows up in the world around the same level a normal sword of that material would (iron shortsword can be found from the start, but ebony and daedric will be very rare and only found in late game)\r\nAncient Nord shortswords will be found in the hand of Draugr and in loot. They are about 4x as rare as normal Draugr weapons.\r\nImperial shortsword can be used by Imperial soldiers. About 1 in 4 soldiers will wield a shortsword.\r\nThe Silver shortsword can be wielded by Silver Hands, but also this one is more rare than a normal silver sword.\r\n\r\nIn stats, shortswords are pretty much right in between swords and daggers.\r\nThey are lighter and swing faster than normal blades, but also do less damage and have shorter range.\r\nShortswords swing x1.15 faster than normal swords (daggers are x1.3 faster than swords).\r\nBut beware! Shortswords are not as silent as daggers and will make you easier to detect!\r\n\r\nThe shortswords were made with bits and parts of different existing Skyrim swords and daggers to make sure they would fit into the game.\r\nI\\'ve done my best to make every sword look different the from already existing weapons, while still making them recognisable as part of a weapon set.\r\nAll shortswords also use the standard Skyrim textures (for the longsword/greatsword/dagger). So if you use any replacement textures in your game, they will also be applied to these new shortswords.\r\n\r\n[img]http://i.imgur.com/Tub2a.png[/img]\r\n[size=5]Skills and Perks[/size]\r\n\r\nShortswords are one-handed weapons and use the one handed weapon skill. Just as with any one-handed weapon, this skill has influence on how much damage you do with a shortsword.\r\nUsing a shortsword will also level your one-handed skill. But shortswords don\\'t count as normal (long)swords; they count as daggers. \r\nSo what perks do and don\\'t affect the shortsword?\r\nShort answer: any perk daggers benefit from, also benefits the shortswords!\r\n\r\nOne-handed:\r\n-the Bladesman perk. Only affects normal sword. Daggers and shortswords don\\'t get any benefits.\r\n\r\nSneak:\r\n-Assassin\\'s Blade. Greatly increases the sneak damage multiplier when attacking with a shortsword.\r\n\r\n[img]http://i.imgur.com/Tub2a.png[/img]\r\n[size=5]Important installation info[/size]\r\n\r\nThere are 2 files up for download. The \\\"normal\\\" mail file, and the non-leveled list version of the .esp\r\nYou won\\'t need to touch this second .esp version to play this mod.\r\nIf you want the shortswords to show up in shops and on npc\\'s, the main file is all you need.\r\nTo install, just copy the data folder to your main Skyrim directory. For most (steam) players this will be at:\r\n(Drive letter:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim)\r\nAll thats left to do is activate the shshortswords.esp and start the game!\r\n\r\nIf you want to play the mod without the changed leveled lists, first download the main file and install as normal.\r\nThen download the no-lvllist file and copy it to your data folder. It will tell you to overwrite the .esp. Just click ok.\r\nNow you can play the mod without any leveled list changes!\r\nActivate the plugin and enjoy.\r\n\r\nIf you use the NMM, you can just download both files that way. Activate the main file first, and then the non-level version. NMM should put all files in the right spot.\r\n\r\n[img]http://i.imgur.com/Tub2a.png[/img]\r\n[size=5]Changelog[/size]\r\n\r\nV 1.0\r\nInitial release\r\n\r\nV 2.0\r\nAdded shortswords to various leveled lists. They should show up in loot, in the hands of npc\\'s (mostly bandits) and in shops.\r\nIf you want to use these swords without them popping up into any leveld lists (for compatability reasons for example) there\\'s a seperate .esp you can use.\r\nShortswords use normal sword animations, but now count as daggers and benefit from the Backstab and Assassin\\'s Blade perks.\r\n\r\nV 2.1\r\nAdded 2 new swords! The Silver and Imperial shortsword.\r\nAlso most of the existing sword meshes were tweaked or changed. The swords are now a bit more bulky and longer. The Daedric shortsword was made again from scratch.\r\n\r\nV 2.2\r\n4 New swords! Draugr, Draugr Honed, Nord Hero and Skyforge Steel! Added to crafting and/or leveled lists.\r\nThe range of all sword has been increased slightly. \r\nIron sword mesh was tweaked.\r\n\r\n[img]http://i.imgur.com/Tub2a.png[/img]\r\n[size=5]Future Plans[/size]\r\n\r\n- adding more enchanted weapon variaties to the leveled lists\r\n- Adding new shortsword models\r\n\r\n[img]http://i.imgur.com/Tub2a.png[/img]\r\n[size=5]Compatibility[/size]\r\n\r\nMy mod changes a lot of leveled lists and will conflict with any mod that changes the same lists.\r\nThat\\'s why I uploaded a second .esp that removes all leveled list changes while the shortswords are still craftable at the forge.\r\nThis way, players who use another leveled list changing mod can still use my mod at the same time (the shortswords just wont show up in shops or on any npc\\'s).\r\nI will try to increase compatibilty with any major mod out there so players can use both mods side by side. This will take some time though, so please be patient.\r\n\r\nWhich mods are compatible and which arent?\r\n\r\n- [url=http://skyrim.nexusmods.com/mods/1002]Jaysus[/url]\r\nSmall conflict. \r\nJaysus changes a few imperial leveled lists. If you load Jaysus after my mod, my Imperial shortswords will only very rarely show up on Imperial soldiers. You\\'ll still find them normally in loot though!\r\nYou can use both together if you wish, without too much trouble.\r\n\r\n- [url=http://skyrim.nexusmods.com/mods/9959]Lorecraft[/url]\r\nIncompatible\r\nLorecraft changes the entire crafting system.\r\n\r\n- [url=http://skyrim.nexusmods.com/mods/9286]SkyRe[/url]\r\nMy Shortswords are intergrated into SkyRe! You won\\'t even need my Shortsword mod anymore.\r\n\r\n- [url=http://skyrim.nexusmods.com/mods/1601]Tytanis[/url]\r\nLittle to no conflicts that I could find.\r\n\r\n- [url=http://skyrim.nexusmods.com/mods/3871]Weapons of the third era[/url]\r\nNo conflicts.\r\n\r\nIf you know of any other mods, please let me know.\r\n\r\nAlso check out [url=http://skyrim.nexusmods.com/mods/1840]Wrye Bash[/url].\r\nThis tool can increase the compatibilty between mods by (for instance)  merging leveled lists.\r\nIf you want to use shortswords but are using an incompatible mod too, this may be the way to fix it.\r\nDon\\'t ask me how it works though. I don\\'t use Wrye Bash myself so I wouldn\\'t even eb able to tell you. There\\'s a detailed how-to on the Wrye Bash mod page.\r\n\r\n\r\n[img]http://i.imgur.com/Tub2a.png[/img]\r\nPlease also check out my other mods :)\r\nHere are the latest:\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=17534]Sixth House Bell Hammer[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=17096]Chrysamere[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=16637 ]Ashland Amulets[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=15579]BiPolar Blade[/url]\r\n\r\nFor more, check [url=http://skyrim.nexusmods.com/modules/members/index.php?id=887024]my profile[/url]",
  "categoryId": "55",
  "version": "2.2",
  "author": "PrivateEye",
  "createdUnix": "1339414395",
  "updatedUnix": "1340095288",
  "containsAdultContent": false,
  "uploadedBy": "PrivateEye",
  "primaryFile": null,
  "files": [
    {
      "fileId": "67555",
      "name": "Shortswords_Main",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "204",
      "fileName": "Shortswords_Main-18585-2-0.7z",
      "uploadedUnix": "1339496467",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/ced95750a8fe1e0ae0ef7c1339131f0d53a3acb080ae4a9f4da16174816d4b52/analysis/1406954525/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shortswords_Main-18585-2-0.7z?fid=67555&ttl=1535785530&ri=8192&rs=8192&setec=e48c0eb779c614ae7b403de3cf999d01"
    },
    {
      "fileId": "68132",
      "name": "Shortswords_Main",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "308",
      "fileName": "Shortswords_Main-18585-2-1.7z",
      "uploadedUnix": "1339749803",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/5202dcbdeaf5ec35d33f3fb935a9a13aef82c6b971f3692f0aa69c424ebd04d5/analysis/1406960588/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shortswords_Main-18585-2-1.7z?fid=68132&ttl=1535785531&ri=8192&rs=8192&setec=0da77c8784cdccf0e415cb797f939e9e"
    },
    {
      "fileId": "68987",
      "name": "Shortswords_main",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "328",
      "fileName": "Shortswords_main-18585-2-2.7z",
      "uploadedUnix": "1340095198",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/a321fe97dde28c7dae44c8196f09a8560a1751ffe4d92762c19197b782dde241/analysis/1406969409/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shortswords_main-18585-2-2.7z?fid=68987&ttl=1535785531&ri=8192&rs=8192&setec=e6c369aaa013d4cbe97d5d97351fe0b8"
    },
    {
      "fileId": "68989",
      "name": "Shortswords_NoLvlLists",
      "version": "2.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Shortswords_NoLvlLists-18585-2-2.7z",
      "uploadedUnix": "1340095288",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/dec51791ef0bf9387317f7a64a94d7990ecbe624d69a33c71f10643d76922247/analysis/1406969464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shortswords_NoLvlLists-18585-2-2.7z?fid=68989&ttl=1535785532&ri=8192&rs=8192&setec=5a0025af03c0082387c54849b6af6f7f"
    }
  ]
}