{
  "modId": 18615.0,
  "modName": "Vagabond Armor - Italian translation",
  "summary": "This is only a italian translation of the original mod by hothtrooper44.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/mods/13230]original mod[/url].\r\nThe original mod adds a lore friendly, stand alone, light armor set for males.\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size]\r\n\r\n[color=red][b]ATTENZIONE![/b]\r\nQuesta è solo la traduzione italiana del mod originale che trovate [url=http://skyrim.nexusmods.com/mods/13230]qui[/url].[/color]\r\n\r\n[/center]\r\n\r\n[center][IMG]http://skyrim.nexusmods.com/imageshare/images/3656551-1338665313.png[/IMG][/center]\r\n\r\n\r\n[center][color=GREEN][size=+4]UNA TRADUZIONE DRAGONBORN ITALIA[/size][/color][/center]\r\n\r\n[color=green][b]DESCRIZIONE[/b][/color]\r\nQuesta mod aggiunge una splendida armatura per ranger che si può creare alla forgia sotto alla categoria Borchiato. Quest\\'armature equivale ad un armatura di vetro come statistiche e peso in modo che non sia super potente, ma che si integri bene con il gioco. L\\'armatura è disponibile in tre versioni: con finiture rosse, grigie o di pelle. Ai personaggi di razze animali (Argoniani e Khajiit) è consigliato di utilizzare l\\'armatura con un elmo differente, per via della forma della testa il cappuccio di quest\\'armatura non si integra bene con la razza. Il cappuccio dei Nightingale o della Fratellanza Oscura sono ottime alternative. Oppure si possono utilizzare mod come [URL=http://skyrim.nexusmods.com/mods/12177]No Helmets Required[/URL] (tradotto in italiano) o [URL=http://skyrim.nexusmods.com/mods/562]No Helmet Mod[/URL].\r\n\r\n[color=green][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n[color=green][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!\r\n",
  "categoryId": "54",
  "version": "5",
  "author": "gouki89",
  "createdUnix": "1339445003",
  "updatedUnix": "1339445003",
  "containsAdultContent": false,
  "uploadedBy": "gouki89",
  "primaryFile": null,
  "files": []
}