{
  "modId": 18617.0,
  "modName": "Redguard Knight Armor - Italian translation",
  "summary": "This is only a italian translation of the original mod by hothtrooper44.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/mods/13500]original mod[/url].\r\nThe original mod adds a lore friendly, stand alone, light and heavy armor set for males.\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size]\r\n\r\n[color=red][b]ATTENZIONE![/b]\r\nQuesta è solo la traduzione italiana del mod originale che trovate [url=http://skyrim.nexusmods.com/mods/13500]qui[/url].[/color]\r\n\r\n[/center]\r\n\r\n\r\n[center][color=GREEN][size=+4]UNA TRADUZIONE DRAGONBORN ITALIA[/size][/color][/center]\r\n\r\n[color=green][b]DESCRIZIONE[/b][/color]\r\nQuesta mod aggiunge l\\'armatura del cavaliere redguard che si può creare alla forgia sotto alla categoria Acciaio. Quest\\'armature equivale ad un armatura del drago come statistiche e peso, è potente, ma nei limiti imposti dal gioco. L\\'armatura è disponibile in due versioni: pesante e leggera. Inoltre è possibile averla con o senza cappa. Ai personaggi di razze animali (Argoniani e Khajiit) è consigliato di utilizzare l\\'armatura con un elmo differente, per via della forma della testa l\\'elmo di quest\\'armatura non si integra bene con la razza. L\\'elmo base redguard è un ottima alternativa, oppure si possono utilizzare mod come [URL=http://skyrim.nexusmods.com/mods/12177]No Helmets Required[/URL] (tradotto in italiano) o [URL=http://skyrim.nexusmods.com/mods/562]No Helmet Mod[/URL]. All\\'interno di questa mod è compresa anche una scimitarra che ha le statistiche di una spada daedrica.\r\n\r\n[color=green][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n[color=green][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!",
  "categoryId": "54",
  "version": "4",
  "author": "gouki89",
  "createdUnix": "1339446645",
  "updatedUnix": "1339446645",
  "containsAdultContent": false,
  "uploadedBy": "gouki89",
  "primaryFile": null,
  "files": []
}