{
  "modId": 18619.0,
  "modName": "Vanguard Armor - Italian translation",
  "summary": "This is only a italian translation of the original mod by hothtrooper44.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/mods/16238]original mod[/url].\r\nThe original mod adds a lore friendly, stand alone, heavy armor set for males and females.\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size]\r\n\r\n[color=red][b]ATTENZIONE![/b]\r\nQuesta è solo la traduzione italiana del mod originale che trovate [url=http://skyrim.nexusmods.com/mods/16238]qui[/url].[/color]\r\n\r\n[/center]\r\n\r\n\r\n[center][color=GREEN][size=+4]UNA TRADUZIONE DRAGONBORN ITALIA[/size][/color][/center]\r\n\r\n[color=green][b]DESCRIZIONE[/b][/color]\r\nQuesta mod aggiunge l\\'armatura dell\\'avanguardia. Pre forgiare quest\\'armatura è richiesto il perk di \\\"Armature Avanzate\\\" ed è come forgiare un armatura di piastre d\\'acciaio come statistiche e peso in modo che sia abbastanza potente per affrontare ogni stadio di gioco. La particolarità di questa mod è che contiene uno script che cambia l\\'elmo da aperto a chiuso a seconda se si è in posizione di combattimento o meno, questa è una nota innovativa che accresce di molto l\\'immersività del gioco. Per chi non gradisce però può sempre utilizzare la versione alternativa che contiene i due elmi (aperto e chiuso) separati eindipendenti. Ai personaggi di razze animali (Argoniani e Khajiit) è consigliato di utilizzare l\\'armatura con un elmo differente, per via della forma della testa l\\'elmo di quest\\'armatura non si integra bene con la razza. Una tiara o un cappuccio di pelliccia sono due valide alternative. Oppure si possono utilizzare mod come [URL=http://skyrim.nexusmods.com/mods/12177]No Helmets Required[/URL] (tradotto in italiano) o [URL=http://skyrim.nexusmods.com/mods/562]No Helmet Mod[/URL].\r\n\r\n[color=green][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n[color=green][b]DISINSTALLAZIONE[/b][/color]\r\nSe utilizzate la versione che apre e chiude l\\'elmo automaticamente, prima di disinstallare la mod, aprite la console premendo il tasto \\\\ e digitare \\\"StopQuest VanguardArmor\\\" (senza le virgolette) e infine premete invio. Ora potete disinstallare normalmente la mod.\r\nNB: Nel caso in cui vogliate reinstallarla successivamente, dopo averlo fatto aprite la console e digitate \\\"StartQuest VanguardArmor\\\" per riavviare lo script che apre e chiude l\\'elmo automaticamente.\r\n\r\n[color=green][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!",
  "categoryId": "54",
  "version": "3",
  "author": "gouki89",
  "createdUnix": "1339448933",
  "updatedUnix": "1339448933",
  "containsAdultContent": false,
  "uploadedBy": "gouki89",
  "primaryFile": null,
  "files": []
}