{
  "modId": 18628.0,
  "modName": "A Cold Intense ENB Config",
  "summary": "A very cold and intense ENB config. This is heavy in bloom (used in the right way.) And will be sure to enhance your skyrim experience!",
  "descriptionHtml": "[IMG]http://i872.photobucket.com/albums/ab281/shivanthing/skyrim-20120612-015254.png[/IMG]\r\n\r\nREUPLOADED EVERYTHING WITHOUT SOURCE FILES DUE TO COPYRIGHT ISSUES!!! READ INSTALLATION INSTRUCTIONS TO GET THIS TO WORK!\r\n\r\nNOTE- Some other mods were used in the screenies, such as warzones, skyrim HD 2k, and a variety of other things I can\\'t mention. The credit for those mods goes to their respective authors, and I take no credit for them, I take credit only for the config.\r\n\r\nNOTE-This mod limits skyrims framerate to 40! And for good reason! Too high a framerate can cause the mouse to stutter with ENB VERY badly, especially in dungeons!\r\n\r\nLeave a comment I love them! :D If anything can be improved, let me know! :D\r\n\r\nI REALLY RECOMMEND YOU USE THE MAIN VERSION OVER THE LESSENED BLOOM V2. The lessened bloom version can look... odd, but nontheless! It does its job properly.\r\n\r\nA very intense ENB config. I made a \\'personal\\' rustic config. And I decided it was time for a change of flavor, rather than having a rustic look. This time I went for a cold look, it brings out the colors in a much different way. \r\n\r\nTo say the least, after a run through with my previous config, im proud to say that this one has more polish than the previous one. You may find some of the effects to be overbearing at times. But in a way that\\'s the point of this (and the previous) config. \r\n\r\nSo, here comes the long haul!\r\n\r\n---WHAT THIS IS--\r\nA very intense ENB config, sunshafts shine through the trees so vividly you can probably count each and every shaft. The colors are cold during the day and night. Dungeons are lit brightly in areas- but very dark in others. Kill cams are often more than not- very epic and filled with special effects. Nights are bluish, daytime scenarios have a variety of colors filtered onto them. Evenings and mornings are gorgeous red and orange. SSAO is used but not overused, bloom may be over-bearing for some so there is an optional \\'less bloom\\' config. (Although it doesnt do much to help, but it may help some.)\r\n\r\n---WHAT THIS DOES---\r\nGives a greater sense of depth, makes dynamic lights very pretty, darkens shadows at night and in dungeons to further a sense of depth. (Nothing mage light cant fix- and it isnt impossible to see.)\r\n\r\n---WHAT THIS IS NOT---\r\nThis is not a realistic config, I\\'ve seen so many \\'realistic\\' configs that im going to crap a rainbow and ride it to sovngard just to tell the nords what the modding community is doing to their land. (No offense to anyone here, most of the realistic configs are good, that was just a JOKE {maybe not a funny one, but hey, it works!}) This isnt a SUPER VIVID FANTASY LAND config either. While it is vivid, (and can be very vivid at times) there\\'s a mix between vivid moments and serene moments where the lighting is just right.\r\n-------------------------------------------------------------------------\r\n\r\nNOTE FOR SHADOWS-You may find dungeon shadows and night shadows very dark- this is for a reason- to bring out the dynamic lights and give a GREAT sense of depth. If you really want to see something pretty just cast magelight and not only will your \\'seeing in the dark\\' problems be solved, but you\\'ll also be given a nice light show.\r\n\r\n---INSTALLATION---\r\nJust drop the contents of the RAR in your root directory, if you got a current skyrim ENB config, back it up. If you don\\'t have software to open RAR files go grab winrar from here. Copy the address into your address bar.\r\n\r\nhttp://www.rarlab.com/\r\n\r\n After you install those contents, go to boris vorontsov\\'s website and get the ENBinjector.exe. It can be found here. Copy and paste the link into your address bar. Drop this into your root directory as well.\r\n\r\nhttp://www.enbdev.com/download_injector_generic.htm\r\n\r\nHOW TO USE\r\nJust run the enbinjector.exe before running skyrim and you\\'re done!\r\n--------------------------------\r\nMODS I RECOMMEND\r\nThe following mods actually, really go good with this ENB config.\r\n\r\n---More Rain--- This really makes the game more immersive.\r\n\r\n---More Snow--- If you don\\'t mind carrying a torch and spouting out some magelight, this will REALLY bring out the atmosphere.\r\n\r\n---Skyrim HD 2k Textures--- Get ALL of them if you have at least 1gb graphics ram! (or 2gb, I have a 2 gig radeon 6950 and I run these at 1.5GB being used most of the time.\r\n\r\n---Project Parallax--- Get it with 2k HD textures to further bring out the atmosphere!\r\n-------------------------------\r\n\r\n\r\n[IMG]http://i872.photobucket.com/albums/ab281/shivanthing/skyrim-20120612-010239.png[/IMG]\r\n\r\n[IMG]http://i872.photobucket.com/albums/ab281/shivanthing/skyrim-20120612-010758.png[/IMG]\r\n\r\n[IMG]http://i872.photobucket.com/albums/ab281/shivanthing/skyrim-20120612-020749.png[/IMG]",
  "categoryId": "62",
  "version": "1.3",
  "author": "Shivanthing",
  "createdUnix": "1339471736",
  "updatedUnix": "1339714863",
  "containsAdultContent": false,
  "uploadedBy": "shivanthing",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68040",
      "name": "Cold ENB V3 MAIN",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "652",
      "fileName": "Cold ENB V3 MAIN-18628-1-3.rar",
      "uploadedUnix": "1339714730",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/55d94c15e4fc2f29bf942028bc06ed811afd72c43587b4bb9aeb9ea5479c6e73/analysis/1406959662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cold%20ENB%20V3%20MAIN-18628-1-3.rar?fid=68040&ttl=1535785602&ri=8192&rs=8192&setec=5f92b9f0e61a7bdefc4ea204a1c1f790"
    },
    {
      "fileId": "68041",
      "name": "Cold ENB V3 But with less sunrays With Updated Shadows",
      "version": "1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "652",
      "fileName": "Cold ENB V3 But with less sunrays With Updated Shadows-18628-1-3.rar",
      "uploadedUnix": "1339714805",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/7d1f38f53682bcd8a85adc09c97d418aa10fdcc12fb25eba473051a1875b1046/analysis/1406959663/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cold%20ENB%20V3%20But%20with%20less%20sunrays%20With%20Updated%20Shadows-18628-1-3.rar?fid=68041&ttl=1535785602&ri=8192&rs=8192&setec=8c90f10c9760486fb5badf5c93a826df"
    },
    {
      "fileId": "68042",
      "name": "Cold ENB NOT AS MUCH BLOOM V3 With Updated Shadows",
      "version": "1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "652",
      "fileName": "Cold ENB NOT AS MUCH BLOOM V3 With Updated Shadows-18628-1-3.rar",
      "uploadedUnix": "1339714863",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/147b0f69cfb403e3f7fa684f82c06a07bbe30c9a46e573d7bb3608533b9b5f56/analysis/1406959683/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cold%20ENB%20NOT%20AS%20MUCH%20BLOOM%20V3%20With%20Updated%20Shadows-18628-1-3.rar?fid=68042&ttl=1535785603&ri=8192&rs=8192&setec=3b393d952013cfcf905d1890ae237e47"
    }
  ]
}