{
  "modId": 18620.0,
  "modName": "Dragonhide Robes - Italian Translation",
  "summary": "This is only a italian translation of the original mod by hothtrooper44.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/mods/18296]original mod[/url].\r\nThe original mod adds a lore friendly, stand alone, heavy armor, light armor, or cloth armor set for all genders and races.\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size]\r\n\r\n[color=red][b]ATTENZIONE![/b]\r\nQuesta è solo la traduzione italiana del mod originale che trovate [url=http://skyrim.nexusmods.com/mods/18296]qui[/url].[/color]\r\n\r\n[/center]\r\n\r\n\r\n[center][color=GREEN][size=+4]UNA TRADUZIONE DRAGONBORN ITALIA[/size][/color][/center]\r\n\r\n[color=green][b]DESCRIZIONE[/b][/color]\r\nQuesta mod aggiunge un set di pelle di drago, disponibile in tre versioni: armatura pesante, armatura leggera e vesti. La versione pesante ha le statistiche dell\\'armatura completa del drago, quella leggera dell\\'armatura a scaglie di drago e le vesti hanno i valori a 0 in modo che i maghi possano utilizzarle. La versione leggera e pesante richiedono il perk per forgiare armature del drago e possono essere create in qualsiasi forgia. Le vesti si possono creare senza bisogno di perk al cavalletto per la conciatura. I set hanno due opzioni per l\\'elmo: uno con il cappuccio e uno con la corona del drago e possono essere utilizzati da tutte le razze.\r\n\r\n[color=green][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n[color=green][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!",
  "categoryId": "54",
  "version": "2",
  "author": "gouki89",
  "createdUnix": "1339449999",
  "updatedUnix": "1339449999",
  "containsAdultContent": false,
  "uploadedBy": "gouki89",
  "primaryFile": null,
  "files": []
}