{
  "modId": 18621.0,
  "modName": "Insanitys Celtic Katana - Italian translation",
  "summary": "This is only a italian translation of the original mod by InsanitySorrow.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/mods/15389]original mod[/url].\r\nThe original mod adds a lore friendly, stand alone, celtic katana.\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size]\r\n\r\n[color=red][b]ATTENZIONE![/b]\r\nQuesta è solo la traduzione italiana del mod originale che trovate [url=http://skyrim.nexusmods.com/mods/15389]qui[/url].[/color]\r\n\r\n[/center]\r\n\r\n[center][IMG]http://img403.imageshack.us/img403/4550/celtickatanatitle.png[/IMG][/center]\r\n\r\n\r\n[center][color=GREEN][size=+4]UNA TRADUZIONE DRAGONBORN ITALIA[/size][/color][/center]\r\n\r\n[color=green][b]DESCRIZIONE[/b][/color]\r\nQuesta mod aggiunge una stupenda katana celtica, il modder ha creato un modello e delle texture da zero. La katana è disponibile con il manico in quattro versioni: blu, marrone, rosso e nero. Si puà ottenere forgiandola dalla sezione Acciaio. Richiede più materiali della spada delle Blade, ma è leggermente più forte, inoltre è possibile migliorarla alla mola. In questa mod sono contenute anche quattro versioni di Dai-katana (katana a due mani) e di Tanto (pugnale).\r\n\r\n[color=green][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n[color=green][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!",
  "categoryId": "55",
  "version": "1.2",
  "author": "gouki89",
  "createdUnix": "1339450894",
  "updatedUnix": "1339450894",
  "containsAdultContent": false,
  "uploadedBy": "gouki89",
  "primaryFile": null,
  "files": []
}