{
  "modId": 18649.0,
  "modName": "Natural Talents v2 - Racial Bonuses Overhaul",
  "summary": "Natural talents removes starting racial skill bonuses and replaces them with XP bonuses and relative effectiveness, thereby giving you an edge throughout your entire skyrim experience instead of a slight bonus for level 1-3 and making the races act as more of an RPG class system. ",
  "descriptionHtml": "===================\r\nVERSION 2.0 IS HERE!\r\n===================\r\n\r\nNew in v2.0:\r\n\r\n- All racial skills are now given a bonus to their effectiveness. This is because it was pointed out to me that after all the racial skills reach 100, this mod becomes pointless. Now you can feel like your Bosmer is better with a bow, your Nord is better with battleaxes and your Khajiit is better at sneaking thanks to their natural talents for the entire experience in Skyrim. \r\n\r\n============\r\nDESCRIPTION\r\n============\r\n\r\nNatural talents removes starting racial skill bonuses and replaces them with XP bonuses and relative effectiveness, thereby giving you an edge throughout your entire skyrim experience instead of a slight bonus for level 1-3 and making the races act as more of an RPG class system. \r\n\r\nPersonally, I don\\'t believe in racial stereotypes but seeing as bethesda seems to half-heartedly disagree; I figure \\'in for a penny in for a pound\\'!\r\n\r\nIn all seriousness, I always thought it was pointless to have skill bonuses according to race that can become largely irrelevant after the first few levels. In life, being \\'a natural\\' at a skill lets you learn it quicker than most, it doesn\\'t just mean you start out being slightly better at something - that would only represent previous training. To that end, I have removed all the racial bonuses and replaced them with a bonus to XP and effectiveness with all racial skills, giving 10% extra instead of a starting +10 and 5% extra instead of a starting +5.\r\n\r\n============\r\nTHE BONUSES\r\n============\r\n\r\nAltmer\r\n+10% Illusion\r\n+5% Alteration\r\n+5% Conjuration\r\n+5% Destruction\r\n+5% Enchanting\r\n+5% Restoration\r\n\r\nArgonian\r\n+10% Lockpicking\r\n+5% Alteration\r\n+5% Light Armour\r\n+5% Pickpocket\r\n+5% Restoration\r\n+5% Sneak\r\n\r\nBosmer\r\n+10% Archery\r\n+5% Alchemy\r\n+5% Light Armour\r\n+5% Lockpicking\r\n+5% Pickpocket\r\n+5% Sneak\r\n\r\nBreton\r\n+10% Conjuration\r\n+5% Alchemy\r\n+5% Alteration\r\n+5% Illusion\r\n+5% Restoration\r\n+5% Speech\r\n\r\nDunmer\r\n+10% Destruction\r\n+5% Alchemy\r\n+5% Alteration\r\n+5% Illusion\r\n+5% Light Armour\r\n+5% Sneak\r\n\r\nImperial\r\n+10% Restoration\r\n+5% Block\r\n+5% Destruction\r\n+5% Enchanting\r\n+5% Heavy Armour\r\n+5% One-Handed\r\n\r\nKhajiit\r\n+10% Sneak\r\n+5% Alchemy\r\n+5% Archery\r\n+5% Lockpicking\r\n+5% One-Handed\r\n+5% Pickpocket\r\n\r\nNord\r\n+10% Two-Handed\r\n+5% Block\r\n+5% Light Armour\r\n+5% One-Handed\r\n+5% Smithing\r\n+5% Speech\r\n\r\nOrc\r\n+10% Heavy Armour\r\n+5% Block\r\n+5% Enchanting\r\n+5% One-Handed\r\n+5% Smithing\r\n+5% Two-Handed\r\n\r\nRedguard\r\n+10% One-Handed\r\n+5% Alteration\r\n+5% Archery\r\n+5% Block\r\n+5% Destruction\r\n+5% Smithing\r\n\r\n====\r\nFAQ\r\n====\r\n\r\nQ. \\\"Can you list the bonuses here please?\\\"\r\nA. You scrolled right past them to get to this FAQ. They\\'ve always been there, honest. Also, I\\'ve got a horrible feeling that some people are new to The Elder Scrolls and think that racial skill bonuses are just something that I\\'ve pulled out of my arse. All races have always had bonuses to a certain set of skills, I\\'ve just changed how they work. For proof of this, you can look them up on uesp.net or tes.wikia.com. \r\n\r\nQ. \\\"Nords should get a bonus to heavy armour!\\\" / \\\"Nords should get a bonus to archery!\\\"\r\nA. Not really a question, I know, but this has come up a few times. I\\'m not out to change the bonuses each race gets, just how they affect the gameplay. You need to take your suggestions to Bethesda. I\\'m also not out to turn your favourite race into a Mary Sue or some sort of Deus Ex Machina. If you want to train a particular skill, go for it. This mod will not hinder your training in any skill and they all now start the game at the same level. This removes the obligation to use any particular skills from the start. You just might find that your Nord takes to swinging that battleaxe a little quicker than he takes to casting fireballs. He can still do both at the same relative effectiveness as any other race. \r\n\r\nQ. \\\"Orcs should get a +10% bonus to speech!\\\"\r\nA. No...no they shouldn\\'t.\r\n\r\nQ. \\\"You know you keep spelling \\'armor\\' wrong, right?\\\"\r\nA. A lesson in British English; armour, colour, favourite - These words are all spelled correctly. Go figure. \r\n\r\nQ. \\\"Do I need to restart my game for this to take effect?\\\"\r\nA. No, not at all. The XP bonus will apply to new and old characters, but the removal of the old skill bonuses will only affect new characters. \r\n\r\nQ. If I subscribe with a pre-made character, will this mod affect my current skill levels?\r\nA. No. If you get a Nord to 100 in two handed and then get this mod, it won\\'t reduce that skill to 90. I think it\\'s better to start a character with a level playing field of skills, but as I\\'ve stated as one of my main reasons for making this mod, the original bonuses meant absolutely nothing after a few levels anyway. \r\n\r\nQ. Have you raised the level cap to compensate for the lower starting skill values?\r\nA. Short answer, the maximum level will be higher, yes. It\\'s my understanding that there never was a level cap, just a theoretical maximum level based on the number you would gain by increasing all your skills to 100 from the original starting values before this mod changed them. So, in theory, you should be able to reach a higher level and gain more perks than before.",
  "categoryId": "73",
  "version": "v2",
  "author": "DistinctlyMinty",
  "createdUnix": "1339503974",
  "updatedUnix": "1339504125",
  "containsAdultContent": false,
  "uploadedBy": "icechambers",
  "primaryFile": null,
  "files": [
    {
      "fileId": "67573",
      "name": "Natural Talents v2",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "37",
      "fileName": "Natural Talents v2-18649-.rar",
      "uploadedUnix": "1339504125",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1d7b2312be725631cea399e0bb4401d30d24fb39df6e212f62195417e4fcc671/analysis/1406954704/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Natural%20Talents%20v2-18649-.rar?fid=67573&ttl=1535785634&ri=8192&rs=8192&setec=2ad80c948d05d4002454769328828ddf"
    }
  ]
}