{
  "modId": 18660.0,
  "modName": "Riverwood Lodge by dupasqk",
  "summary": "A remastered Hjerim with attic and cellar just outside of Riverwood",
  "descriptionHtml": "** This is my first mod. PLEASE try it and leave comments if its not too much trouble. I would love to hear your ideas on how to improve or add to it! Thanks so much for trying it! **\r\n\r\nThe Hjerim is one of my favorite player homes in Skyrim. But lets face it, the quests to acquire it can often be buggy and to some players unobtainable! Yeah, you can often use console commands to get it, but some players would prefer not to use the console. \r\n\r\nThis mod includes my remastered version of the Hjerim, called Riverwood Lodge, located just outside the main gate of Riverwood. I have included an attic and a cellar full of items to give a player a nice head start in their adventure. Some of these items include; A custom set of armor and bow, skill books, potions, and chests containing random treasures.\r\n\r\nSome of the attic contents include; 1 bookshelf that holds 16 books, 2 mannequins, a large weapon display case, a weapon plaque containing a custom bow, a custom lodge outfit on the table, a treasure chest, and a marksman skill book.\r\n\r\nIn the entry hallway you will find; 2 treasure chests, a bookshelf that holds 11 books, and 7 skill books.\r\n\r\nThe kitchen includes; 2 bookshelves that hold 11 books each, potions and an entrance to the cellar.\r\n\r\nBehind the secret door in the alchemy room you will find; 2 bookshelves that hold 11 books each, Alchemy and Enchanting table, 12 skill books, and 3 weapon plaques.\r\n\r\nThe main hall on the 2nd floor includes; 5 mannequins (2 more than standard Hjerim) , 4 weapon plaques, 1 shield plaque, 2 small display cases, and 3 large display cases.\r\n\r\nThe treasure room contains 6 treasure chests.\r\n\r\nIn the bedroom you will find; A bed (obviously) , 2 small display cases, 2 treasure chests, 2 skill books, and a shield rack.\r\n\r\nOutside the house you will find; a tanning rack, a smelter, an anvil, and an entrance to the cellar.\r\n\r\n\r\nWith this mod installed you can still acquire the Hjerim in Windhelm through normal means and I have found no conflicts with other mods.",
  "categoryId": "67",
  "version": "1.00",
  "author": "dupasqk",
  "createdUnix": "1339518151",
  "updatedUnix": "1339522803",
  "containsAdultContent": false,
  "uploadedBy": "dupasqk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "67616",
      "name": "Riverwood Lodge by dupasqk",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "165",
      "fileName": "Riverwood Lodge by dupasqk-18660-1-00.rar",
      "uploadedUnix": "1339522803",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/2f7c33bb79898d257e660b9bafcba6383c053445a1e6c09a7a1b9609c826ea56/analysis/1406955124/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riverwood%20Lodge%20by%20dupasqk-18660-1-00.rar?fid=67616&ttl=1535785648&ri=8192&rs=8192&setec=45b2b08a1f528913e2a7f66a22a43716"
    }
  ]
}