{
  "modId": 18680.0,
  "modName": "Draugr Overlord",
  "summary": "You dont need any mods for this. Ive made a playerable home by a few strings of commands and disableing ive added a few friends (no followers yet) to guard your lair what you captured with your legion.",
  "descriptionHtml": "You are a overlord you captured a lair with a dungeon and your chamber and a out side area with some other friendly draugr. I had the idea off the draugr race mod. thanks who ever made it.\r\nYou dont need any mods to use this and you have a few weapons to start with and little gold. i removed some annoying lights and dead bodys. and some other things to make it more homley. \r\nso you have your very own home with protection. This is good for roleplay and other machimas.\r\nand movies. Please have a go.\r\n\r\nTo install: Documents\\\\My Games\\\\Skyrim\\\\Saves\r\n\r\nFrench: Vous êtes un seigneur que vous avez capturé un repaire avec un donjon et votre chambre et une zone latérale avec une autre draugr amicale. J\\'ai eu l\\'idée au large de la mod course draugr. grâce qui ait jamais fait. Vous n\\'avez pas besoin des mods pour utiliser ceci et vous avez quelques armes pour commencer et peu d\\'or. j\\'ai enlevé quelques lumières gênantes et bodys morts. et d\\'autres choses pour le rendre plus homley. si vous avez votre propre maison avec une protection. Ce qui est bon pour le jeu de rôle et d\\'autres machimas. et des films. S\\'il vous plaît avoir un aller. Pour installer: Documents \\\\ Mes jeux \\\\ Skyrim \\\\ Saves\r\n\r\nSpanish: Usted es un señor feudal que ha capturado una guarida con un calabozo y su cámara y una zona lateral con un poco de draugr amigable otro. Yo tenía la idea de la carrera de draugr mod. gracias que alguna vez lo hizo. Usted no necesita grandes modificaciones para usar este y tiene pocas armas para comenzar, y poco de oro. i eliminado algunas luces molestas y bodys muertos. y algunas otras cosas para que sea más homley. por lo que tiene su propia casa con la protección. Esto es bueno para juegos de rol y machimas otros. y las películas. Por favor, tener un ir. Para instalar: Documentos \\\\ Mis Juegos \\\\ Skyrim \\\\ Saves",
  "categoryId": "43",
  "version": "1.0",
  "author": "Aidan499",
  "createdUnix": "1339538492",
  "updatedUnix": "1339538599",
  "containsAdultContent": false,
  "uploadedBy": "aidan499",
  "primaryFile": null,
  "files": [
    {
      "fileId": "67661",
      "name": "Draugr Overlord",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19725",
      "fileName": "Draugr Overlord-18680-1-0.rar",
      "uploadedUnix": "1339538599",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/98ccc1b89c4643d946cacf8bccb30630b3458bcc78dc10389e760daca9469c1f/analysis/1406955612/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Draugr%20Overlord-18680-1-0.rar?fid=67661&ttl=1535785677&ri=8192&rs=8192&setec=535ca011e72558e4dd7b006b9592fd6d"
    }
  ]
}