{
  "modId": 18686.0,
  "modName": "Archmage Quarters Upgrade",
  "summary": "Rebuilds the Archmage\\\\\\'s Quarters, adds functionality and costomized aesthetic potential. Does not prevent access to the original, so you don\\\\\\'t have to get all your stuff out before installing the mod.",
  "descriptionHtml": "I found the Archmage\\\\\\'s Quarters to be sadly lacking. I am a dedicated mage and loyal to the College, but I can\\\\\\'t live there because I have no adiquate living space. Seriously, who wants to live with a tree growing out of their floor? The first thing I did was dispose of that tree and the rest of the alchemy garden. I rebuilt the Archmage\\\\\\'s Quarters from scratch in a five-room layout. The five rooms are:\r\n\r\n1. An armory; 5 mannequines, 8 weapon plaques, 1 shield rack, and 9 display cases.\r\n\r\n2. A kitchen/dining room; table, fireplace, and cooking spit.\r\n\r\n3. Study/bedroom; clearly divided. Has two bookcases, a desk with quill and paper, bed, 2 wardrobes, 3 cabinates, and a chest.\r\n\r\n4. A middle room with an enchanting lab, containing an enchanting table, shelf stocked with soul gems, and a strongbox for gem storage. Also you find an alchemy lab, with alchemy table, shelf stocked with ingredients, and a cabinate for storage.\r\n\r\n5. Entry room, contains benches and the stairs to other parts of the college. \r\n\r\nYou can access the original quarters via the roof. Go upstairs, walk across to the other roof door and go down, it will take you to the original quarters. This way, you can move without worrying about accidentally deleting your stuff. You can tell which door is which by the name. The original quarters are labled Arch-Mage\\\\\\'s Quarters, the new ones are labled Archmage\\\\\\'s Quarters, without hyphenation.\r\n\r\n-----WARNING-----\r\nI strongly advise you not to install this mod until after you become Archmage. It [i]will[/i] mess with the College questline.\r\n-----\r\nIf you like my work, please follow my Legend of Winterhold mod here: http://forums.nexusmods.com/index.php?/topic/507588-wip-the-legend-of-winterhold/\r\n\r\nAnd don\\\\\\'t forget to endorse!",
  "categoryId": "67",
  "version": "",
  "author": "arhtech",
  "createdUnix": "1339550974",
  "updatedUnix": "1339598367",
  "containsAdultContent": false,
  "uploadedBy": "arhtech",
  "primaryFile": null,
  "files": [
    {
      "fileId": "67778",
      "name": "Archmage Quarters Upgrade",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "58",
      "fileName": "Archmage Quarters Upgrade-18686-1.zip",
      "uploadedUnix": "1339598367",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b1947148a2b227d40dae98284818afaac3eeff9bece760210021196e6d0bcf1d/analysis/1406956809/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Archmage%20Quarters%20Upgrade-18686-1.zip?fid=67778&ttl=1535785686&ri=8192&rs=8192&setec=491f37f04955a2a139b67720cd2d836c"
    }
  ]
}