{
  "modId": 18726.0,
  "modName": "Demon Form",
  "summary": "Allow you to Transform into a Demon, unlocks unique spells and Abilities",
  "descriptionHtml": "[color=#FF0000]DEMON FORM[/color]\r\n\r\n1. Lore\r\n2. Description\r\n3. Spells\r\n4. Perks and Disadvantages\r\n5. Future updates\r\n5. Permissions\r\n6. Credits\r\n\r\n=======================================================================================\r\n\r\n1.LORE\r\n\r\nYou have been told about The Nine. The eight and one. But you have never been told about the tenth God. The Keeper of The Dead and Lord of Oblivion. Malegas.\r\n\r\nWhen Mankind were created, Malegas created another simular race. Stronger then the rest. He gave them abilities not fit for this realm. So The Gods bannished Malegas. Chained him to forever root in Oblivion. \r\n\r\nWithout their evil creator. The Demons were vurnerable. That is when Stendarr blessed his believers, making them into what they now call \\\" The Vigilants of Stendarr\\\". Blessed by the divines the Vigilants crushed every single demon they could find and cast them back to oblivion. \r\n\r\nBut.. One of the Demon´s chained his soul into a book. Cursing it, \r\n-\\\"whoever open this book shall be mortal no longer\\\"\r\n\r\n\r\nAnd so the story goes.. The Book where lost. Never found.. Until now...\r\n\r\n=============================================================================\r\n\r\n2.DESCRIPTION\r\n\r\nThis mod gives you the ability to transform into a Demon. Which gives you unique spells and abilites. As a demon you will be able to to conjure storms, master the art of destruction, alteration, conjuration and illusion. \r\n\r\n\r\n3.SPELLS\r\n\r\nApocalyptic Storm - Conjures a massive storm, casting fireballs at everything inside a 600 area for 1 minute.\r\n\r\nDemon Form - Transforms you into A Demon. ( Adding all the Demonic Spells\r\n\r\nHuman Form - consceling yourself as a mere human. ( Removing every Demonic spells )\r\n\r\nSoul Harvest - Sucks the soul of your target, damaging the target, and healing yourself.\r\n\r\nShadow Form - As a demon you allow yourself to be consumed by the darkness, the shadow damaging you for 30 seconds but you are 100 % immune to weapon damage for 30 seconds.\r\n\r\nTeleport To Oblivion - Teleports The Demon to Oblivion ( not yet finished but available)\r\n\r\nDemonic Possess - Possess the target, making him controllable.\r\n\r\nBending Knees - You bend every bone inside the Targets body, Making him freeze in place for 30 seconds ( 24 gametime hour cd. )\r\n\r\nDemon Push - You push the target forward. ( dual wield able for stronger effect )\r\n\r\nDemonic Leap - The Shadow guides your way forward. Damaging you for 10 dmg but gives you a huge speed burst ( Not yet finished )\r\n\r\n========================================================================================\r\n\r\n4.PERKS AND DISADVANTAGES\r\n\r\nWhy do you want to be a Demon?\r\n\r\nWell.. everything has it´s advantages and disadvantages. Here they are:\r\n\r\nFriend of The Dead - As a Demon you are friendly with the dead ( skeletons ). The dead has also given you a +10 skill to Destruction and Conjuration.\r\n\r\nHated by The Holy - As a Demon you are not able to walk on holy ground. Doing so will cause your skin to burn. In addition, The Vigilants of Stendarr will become your sworn enemy. \r\n\r\nCursed by the Gods - The Gods of The Nine does not smile upon you. If you equip an amulet of one of the gods of the nine, you will instantly die. ( Not yet finished )\r\n\r\n===================================================================================\r\n\r\n5. FUTURE UPDATES\r\n\r\nevery spell/ability marked as \\\"( not yet finished )\\\" will be fixed in next update.\r\n\r\nFuture questline to unchain Malegas and reclaim what is his.\r\n\r\nMore spells!\r\n\r\nMore abilities!\r\n\r\nIf you have any cool ideas please feel free to pm me or write in comments :)\r\n\r\n=============================================================================\r\n\r\n6. PERMISSIONS\r\n\r\nYou may not upload this mod on any other site. And do not use any of my content in your own mod unless you pm me and i accept.\r\n\r\n===============================================================================\r\n\r\n7. CREDITS\r\n\r\nThanks to Bethesda Softwork for Skyrim And The Creation Kit. \r\n\r\nAnd a special thanks to:\r\n\r\nMofomojo with Script helping and giving me permission to use some of his spells ( not yet available but will be in upcoming updates).\r\n\r\nKieranh7 for giving me permission to use his spell \\\" Mind control \\\" which is \\\"Possess\\\" in my mod. \r\n\r\nSo big thanks to them!\r\n\r\nAnd ofcourse me.. For.. making all of this :)\r\n\r\nIf you like this mod make sure to Endorse :)\r\nThis mod is based on the serie Supernatural Demons and some of the spells are just from my own brain\r\n\r\nAnd if you like this mod.. Perhaps you like my other mod for skyrim:\r\n\r\nThe Dark Gift - Vampire\r\nhttp://skyrim.nexusmods.com/mods/18000\r\n",
  "categoryId": "24",
  "version": "1.0",
  "author": "TheSkoomaKing",
  "createdUnix": "1339614232",
  "updatedUnix": "1339614339",
  "containsAdultContent": false,
  "uploadedBy": "TheSkoomaKing",
  "primaryFile": null,
  "files": [
    {
      "fileId": "67812",
      "name": "Demon Form V1dot0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3720",
      "fileName": "Demon Form V1dot0-18726-1-0.rar",
      "uploadedUnix": "1339614339",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f085ce137745562ee306d5d8a09b1d6548584486be118c4caacbece1f2ccc49f/analysis/1406957057/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Demon%20Form%20V1dot0-18726-1-0.rar?fid=67812&ttl=1535785745&ri=8192&rs=8192&setec=40f55c673f1a37b6c562ecd2099e6aa9"
    }
  ]
}