{
  "modId": 18736.0,
  "modName": "Venator Daemonous",
  "summary": "Welcome to my first faction mod, the idea behind this mod is that a militia was formed to fight monsters, the undead and the powerful if any were to invade the plains of Skyrim.\r\n",
  "descriptionHtml": "Hey there! \r\n\r\nWelcome to my first faction mod, the idea behind this mod is that a militia was formed to fight monsters, the undead and the powerful if any were to invade the plains of Skyrim.\r\n\r\n-UPDATE 1.1-\r\n\r\nRemoved original Main Camp due to being too close to Whiterun and causing some lock ups for some users, hopefully its new location will be a tad smoother.\r\n\r\nAdded courier to deliver a note to the player upon location change, which will start a side quest to find the new Main Camp and lead you to the first companion.\r\n\r\nNow there are over 200 NPC’s added, 8 are unique companions, 4 are guard/archer companions.. So 12 companion’s altogether.\r\n\r\nGuards/Archers have reduced health and are killable (they also respawn) the 4 Archer/Guard companions also share the reduced health/killable traits.\r\n\r\nAdded an inn just outside the main camp.. Unfair to have the troops Mead free!\r\n\r\nAdded several patrols to the world.\r\n\r\nThe main camp is dragon friendly, as in, a few of the buildings are perch able by dragons etc.\r\n\r\nAdded 4 horses to the main camp\r\n\r\nThings to add for the 1.2 update when I get around to it;\r\n\r\nQuests! (may take some time)\r\n\r\nMore Patrols\r\n\r\nMore camps\r\n\r\nBooks to add immersion to the mod\r\n\r\n\r\nA brief overview of the Militia;\r\n\r\nThe idea behind this elite mercenary band of warriors was to ensure the peoples of Skyrim and her subsidiaries would be secure if any demons or monsters were to mass invade the plains of Skyrim.\r\n\r\nGeneral Tullius personally gave his seal of approval to this entourage of mercenaries, warriors and knights as he knew that the imperial forces alone would struggle against any mass intrusion of monsters, the undead or the powerful. \r\n\r\nWhilst creating this band, the General had to make alterations to the \\\"Martial Law\\\" law set by kings gone by, to which he had to seek approval from the King of Skyrim himself. Fortunately the King had enough clarity and foresight to see this was perhaps the best strategy incase of any invasion.\r\n\r\nThe alterations to the already standing law are as follows;\r\n\r\nWhilst any militia may be formed in the defence of Skyrim and the towns within, no militia captain can override the rule of the local Jarl or try to usurp him or her.\r\n\r\nThe Venator Daemonous Militia may take up residence in any town, city or camp site as an added bulk to the already residing armed forces but cannot take control of the local armed forces unless given permission from the residing Jarl, or in his or her\\'s absence. The Thane of the local town or City.\r\n\r\nAs this is the first version of this mod, there is only one Camp as of the moment, this camp can be found just outside of Whiterun near the West Tower (first dragon encounter outside of Helgen). Within this camp you will find one companion and many NPC’s of guards and archers.\r\n\r\nAltogether there are 8 potential companions dotted around Skyrim for you to encounter, the first one is in Riverwood, the second is at the main camp, the others you will find along the way. There are also, as of the moment, 85 guards and archers added to the world (more to come in later updates).\r\n\r\nI also created a new faction so that the companions and npc’s are so static and will attack a variety of other factions that are available. Both the NPC’s and Companions have the sandbox script activated, so if left at a location, they will, after a short while, interact with the local environment , to make the added characters more “lore friendly” as it were. I also altered the speed of the companions to “125” instead of the base “100” as using the base speed, the player will have to stop from time to time to let the companions catch up, whereas altering the speed to 125 should enable the companions to move faster, but still within the realms of realism.\r\n\r\nCredits:\r\nHothtrooper44 – for giving me permission to use his various custom armours\r\n\r\nSamurai armour: http://skyrim.nexusmods.com/mods/17779\r\n\r\nBaratheon Armour: http://skyrim.nexusmods.com/mods/14715\r\n\r\nHedge Knight Armour: http://skyrim.nexusmods.com/mods/13961\r\n\r\nThe creator of the Lore Friendly Armour Pack – he let his mod become public modable  as he no longer supports  that mod and has let anyone use it for their own.\r\n\r\nPermissions:\r\nIf you wish to alter, improve, integrate into another mod or anything that may need permission, you will need to ask for my approval and ask hothtrooper44 if you can further use his mods too.\r\n\r\nDO NOT UPLOAD THIS MOD TO ANY OTHER SITE!!\r\n\r\nAs this is the first version of this mod, there may be some kinks, so please feel free to comment if you have come across any issues! Also, if you have any ideas or would like to add something special, please private message me.\r\n\r\nThanks for your time, I hope you like this mod.\r\n",
  "categoryId": "25",
  "version": "1.1",
  "author": "Dhegnous",
  "createdUnix": "1339629078",
  "updatedUnix": "1339886811",
  "containsAdultContent": false,
  "uploadedBy": "Dhegonus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "67839",
      "name": "Venator Daemonous v1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "90",
      "fileName": "Venator Daemonous v1-18736-1-0.rar",
      "uploadedUnix": "1339629191",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fe14c2bb1c6e2441bdb882d3865d495f6f35f5b48d7071c2bd55989f817ca0ef/analysis/1406957463/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Venator%20Daemonous%20v1-18736-1-0.rar?fid=67839&ttl=1535785758&ri=8192&rs=8192&setec=15bfe98496ac8c8dd5d686fc7cf269b1"
    },
    {
      "fileId": "68460",
      "name": "Venator Daemonous",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "334",
      "fileName": "Venator Daemonous-18736-1-1.rar",
      "uploadedUnix": "1339886811",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/90abf95e7a88a2d228e56db556045120aa5d7027842e0c5ae31d276ba2aad0a6/analysis/1406963887/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Venator%20Daemonous-18736-1-1.rar?fid=68460&ttl=1535785758&ri=8192&rs=8192&setec=2780b6c2d04acbd7c0e52d101620a7e1"
    }
  ]
}