{
  "modId": 18752.0,
  "modName": "Drachis and Sundracon Compatibility Fix",
  "summary": "Allows users of the Drachis Argonian Male Type A texture to use Sundracon\\'s no-bits nudes.",
  "descriptionHtml": "Sundracon DAM Type A Compatibility Patch\r\nAuthor: Raiser (mindinavoid)\r\nOriginal Textures: Drachis Argonians Mod - WIP by Drachis\r\nModified using textures from: Nude Male with Import from Roberts new vegas male by Sundracon\r\nVersion 1.0: Original version, works fine with horribly meshed vanilla \\\"patty feet\\\" or if you\\'re using a modified foot (like T3alRose\\'s [url=http://skyrim.nexusmods.com/mods/20130]Drachis Argonians and Raptor Feet Merged[/url], which uses the V1 normal map). Kept as an upload for posterity reasons.\r\nVersion 1.1: Fixed normal mapping for the Sundracon Meshes packs in [url=http://skyrim.nexusmods.com/mods/2488]Better Males[/url] (which I personally use). Textures are still wonky, but I\\'m a musician, not a texture modder. Installation remains unchanged.\r\nReadme Version: 1.0, because I can\\'t be arsed to cut open the folder and fix a few minor errors in the text. Installation\\'s still the same, though.\r\n\r\nWhy It Exists: \r\n\r\nThe existing up-to-date file for Drachis Argonians is DAM - Type A Male, \r\nwhich is a rather awesome looking draconic retexture of Argonians. The textures, however, \r\ndo not account for any manner of male nude body replacer; at best, the user gets a horribly\r\ndiscolored patch from waist to upper thigh on their lizards, and at worst, some equally\r\ndiscolored (and equally offputting) nether-bits.\r\n\r\nAs much as I loved DAM Type A, I couldn\\'t bring myself to continue using it in that nature.\r\nEventually, I hypothesized that using the DAM textures with Sundracon\\'s nude male default set\r\nwould serve to alleviate the problem, as there would be no netherbits to discolor; this worked\r\nto that degree, but there was still the hip discoloration.\r\n\r\nBeing a perpetual meddler, I then decided to learn how to use GIMP, surgically extracted the\r\nDrachis normal maps sans the \\\"broken\\\" part, and overlaid it onto the Sundracon normals.\r\nI then snipped out the exact size and shape of the hole in the Sundracon texture where the\r\nnetherbits were(n\\'t).\r\nThe result: not entirely \\\"seamless\\\" unless you get up super-close, but significantly less painful to look at.\r\n\r\nWhat It Is: \r\n\r\nIncluded in this file are, quite simply, modified texture and normal maps, one each,\r\nwhich consist of the DAM Type A files modified for Sundracon\\'s Robert Male body.\r\n\r\nThat\\'s it!\r\n\r\nRequirements:\r\n\r\n1. Sundracon\\'s nude male pack (no lizard bits \\\"default\\\" version)\r\n2. Drachis DAM Type A (this mod contains only the texture and normal maps for the body. You need\r\nthe original for the rest of the parts.)\r\n3. Basic reading comprehension.\r\n4. Skyrim.\r\n\r\n\r\nHow to Use It:\r\n\r\n1. Install Sundracon\\'s Nude Male pack, taking care to use the default \\\"no lizard bits\\\" version.\r\n2. Install Drachis\\'s DAM Type A, overwriting where necessary.\r\n3. Unzip the \\\"Textures\\\" subfolder into your Data directory, selecting \\\"Yes\\\" when asked if you\r\n-  wish to overwrite files.\r\n - OR -\r\n3. Install via the Nexus Mod Manager, if that\\'s your thing. Do tell it to overwrite where\r\n-  necessary.\r\n\r\nHow to Stop Using It:\r\n\r\n- Replace argonianmalebody.dds and argonianmalebody_msn.dds with the original Drachis textures\r\n- (presumably by reinstalling the original Drachis mod files over this one.)\r\n - OR -\r\n- Remove the above-mentioned two files entirely. (Be aware that this *WILL* cause texture\r\n- mis-matching, unless you\\'re removing the entire Drachis set.)\r\n\r\nHow to Stop Using the Entire DAM Type A Mod (And this one, too):\r\n\r\n- For Mod Manager users, just deactivate the mods (mine first, then Drachis).\r\n\r\n- For those using mods the old fashioned way, a quick \\\"cheat\\\" for uninstalling any mod: unzip \r\n- the DAM Type A mod into your Data folder again, as if you\\'re installing it. Overwrite where \r\n- necessary.\r\n\r\n- Press Ctrl+Z, or go to the Edit dialogue menu => Undo. Click \\\"Yes\\\" at the prompt when Windows\r\n- asks you if you wish to delete X number of files. \r\n\r\n- This will send a Microsoft-trained team of assassins into the depths of your Steam folder \r\n- on a search-and-destroy mission, leaving no trace of their visit, or of their targets.\r\n\r\n- For users of non-PCs, use your preferred file deletion method of choice to excise the DAM Type A\r\n- mod as a whole. (How -did- you get this mod onto a console, anyway? ...nevermind, it\\'s probably\r\n- illegal.)\r\n\r\n(Potentially) Frequently Asked Questions:\r\n\r\n1. This sucks. You suck.\r\n1a. Not a question. Also, I\\'m a bard (weaver of tales and of tunes), not an artist. I can\\'t\r\n-   draw to save my bacon, I just happen to be a dab hand with the Magic Wand tool in GIMP.\r\n-   Any other complaints about the graphical quality, take it up with Drachis.\r\n\r\n2. Can you redo this for (insert other model pack here)?\r\n2a. As per the answer in 1a, nope. I can\\'t art. It took me about three hours to figure\r\n-   out how to do this much, and all I did was retouch a normal map and cut a couple holes.\r\n-   (Granted, most of that time was spent finding a .DDS plugin for GIMP. Hint: google \\\"GIMP .dds plugin\\\".)\r\n\r\n3. Can I use this for (X)?\r\n3a. Honestly, I don\\'t see many uses for this outside of a custom race implementation\r\n-   (a la what Drachis intended at some point for his mod), so sure, go nuts, as long\r\n-   as you have permission from other fronts. Just don\\'t forget to credit me for my minor\r\n-   bit part in the school play. (I\\'m not picky, a \\\"male nethers fix by Raiser\\\" will do.)\r\n-   Oh, and let me know about your mod via the PMs here on Nexus. (Mostly so I can feel important, but\r\n-   also so that if I ever do update this in any way, I can make sure you know it\\'s updated.)\r\n\r\n4. Did you get Drachis and Sundracon\\'s permission for this?\r\n4a. Excerpt from the description on Sundracon\\'s mod:\r\n[QUOTE]\r\nI haven\\'t been on or had any time to do any modding.\r\nBut looking at my messages now, I give permission to use any of my work\r\nto anyone who wishes to use it for whatever reason.\r\n[/QUOTE]\r\n\r\n-   As for Drachis, yes, I do have permission, as he has released the DAM Type-A files for public use due to life getting in the way and preventing him from working on mods.\r\n\r\n5. Can you upload this to the Workshop?\r\n5a. Yeah, I can. Not that hard, really, would just have to repack it into a .bsa file.\r\n-   Assuming Steam doesn\\'t decide not to connect to their servers for some inane reason,\r\n-   it would probably take me all of twenty minutes to do.\r\n\r\n6. Very funny, smart guy. *Will* you upload this to the Workshop?\r\n6a. Nope! You still need Drachis\\'s original files for the rest of the mod, and\r\n-   to my knowledge he hasn\\'t uploaded it there. I\\'m not about to redistribute\r\n-   his original files and steal his thunder, and as mods on the Workshop are\r\n-   always packed in .bsa files, that\\'d be an extra layer of hassle to implement\r\n-   because you\\'d have the originals in loose form, mine in .bsa... it\\'s a headache.\r\n\r\n7. Can (I/my dog/my cat/my great grandmother\\'s second cousin) compile this with\r\n-  the original and upload it to the Workshop/Nexus?\r\n7a. Nope.avi\r\n-   You\\'d need Drachis\\'s permissions to do that, and I\\'d much rather he got\r\n-   credit for his own work. If you see it on the Workshop, either Drachis himself\r\n-   uploaded the whole thing, or someone went against (my/his) wishes and uploaded\r\n-   something that THEY DID NOT MAKE. (In which case you should flag the mofo for\r\n-   jacking other peoples\\' hard work, and my hamhanded Frankensteining.)\r\n-   The only exception to this rule, of course, is if you have Drachis\\'s permission.\r\n-   In that case, go ahead! But if you\\'re using my little fix, please do give me credit\r\n-   for my tiny hand in the work. If those two files I grafted together are not in your\r\n-   mod, of course, you don\\'t need to credit me at all. (But then, this question is moot.)\r\n\r\n8. How the heck did you get your Argonian so big? / How did you get screenshots during the \r\n-  opening scene?\r\n8a. Wears-No-Pants was raised on a steady diet of larger, angrier predators. (He believes this is \r\n-   why he is so big, since he hatched as a runt. Really, it\\'s because I used player.setscale 1.2 \r\n-   on him.)\r\n-   As for the rest, I used the \\\"epc\\\" command to allow all player controls (although I couldn\\'t \r\n-   move), thus allowing me to go into third person view, showing the model. Then, tfc 1 froze \r\n-   the action and freed the camera, allowing me to set up just the right shot. (Good for any \r\n-   screenshots, really.) I don\\'t recommend using epc under standard play, though, it tends to\r\n-   screw up how things work in the game (since, y\\'know, you\\'re not supposed to do that normally).\r\n\r\n9. Why didn\\'t you use the (apparently fully intact) old normal map from DAM instead of the \r\n-   Sundracon normal map?\r\n9a. Because shut up, that\\'s why. (I forgot it existed during construction, and really the differing normal map is nigh unnoticeable in-game because of the detailing on the DAM texture.\r\n9a2. Because by the time I realized I could do such a thing, laziness set in.\r\n\r\nThanks:\r\n\r\n-to Sundracon, for importing New Vegas Robert Male to Skyrim (and for his beast race dangly bits)\r\n-by extension, to jajajajaja, AlienSlof, and MysticBinary82, who are credited to the original body mod\r\n-to Drachis, for the DAM Type A mod, which will hopefully be expanded on in the future (and for releasing permission to use his textures from it to the public)\r\n-to the makers of GIMP (and the DDS plugin), for giving me a way to satisfy that burning itch to fix this\r\n-to the Nexus crew, for giving us a place to do this silly modding thing we do\r\n-to you, for reading the readme, and not asking questions that are already answered in the PFAQ\r\n-to my roommate, for putting up with me rattling incessantly at the keyboard at 3 AM to write this.\r\n\r\nReadme file by Raiser, 2012 (Main Description edited January 2013)\r\n\r\n~Sound and Fury take us home...~",
  "categoryId": "28",
  "version": "1.1",
  "author": "Raiser",
  "createdUnix": "1339666400",
  "updatedUnix": "1359295491",
  "containsAdultContent": false,
  "uploadedBy": "mindinavoid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "67914",
      "name": "Drachis and Sundracon Compatibility Patch v1",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8510",
      "fileName": "Drachis and Sundracon Compatibility Patch-18752-1.zip",
      "uploadedUnix": "1339666503",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/cc0586c57e2eab22bf8198850d3664916722a09f373ed6ecba0d23f4729197ae/analysis/1406958308/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Drachis%20and%20Sundracon%20Compatibility%20Patch-18752-1.zip?fid=67914&ttl=1535785787&ri=8192&rs=8192&setec=0b87c12cfacbc7f482fad42aa5069e53"
    },
    {
      "fileId": "1000005219",
      "name": "Drachis and Sundracon Compatibility Patch v1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8623",
      "fileName": "Drachis and Sundracon Compatibility Patch v1-1-18752-1-1.zip",
      "uploadedUnix": "1359295491",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/8ad8d4b80cdf3722a79ba6fc2f28967a272bd442270a79f1347d3ff1c2887d87/analysis/1407381798/",
      "changelogHtml": " Fixed normal mapping for feet used in Better Males. <br/> \n Removed NMM download for version 1.0. Kept up for use as a resource. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Drachis%20and%20Sundracon%20Compatibility%20Patch%20v1-1-18752-1-1.zip?fid=1000005219&ttl=1535785787&ri=8192&rs=8192&setec=6a68d5af569e41c9df3f5b08e0b08493"
    }
  ]
}