{
  "modId": 1876.0,
  "modName": "Perk Reset",
  "summary": "This mod was made with ScriptDragon for Skyrim by Alexander Blade\r\n\r\nIts purpose is a rudimentary ability to reset your perks, if that is your kind of thing, it resets your perks based on your character level, so if you have added any perks with AddPerk (the console command) then it will not calcuate your perks correctly. An easy fix to this is",
  "descriptionHtml": "\r\n************************************************************************************************************************************\r\nRemoved files until I update. Sorry.\r\nIt was brought to my attention that I was removing ALL perks, not just normally obtainable perks. I\\'ll update it tomorrow, or in a day or two.\r\n************************************************************************************************************************************\r\nThis mod was made with ScriptDragon for Skyrim by Alexander Blade\r\n\r\nIts purpose is a rudimentary ability to reset your perks, if that is your kind of thing, it resets your perks based on your character level, so if you have added any perks with AddPerk (the console command) then it will not calcuate your perks correctly. An easy fix to this is to\r\ncount them with HasPerk, but I figured since you\\'re using a perk reset mod, you probably haven\\'t added perks with the console manually. Just say if you want the ability based on current perks as optional.\r\n\r\nYou can change the enable\\\\use keys within perkreset.ini, by default, they are F1, and F2.\r\nF1 enables the mod, and it notifies you. The reason I added an enable\\\\disable is so accidents\r\n(when the mod was loaded) would not be made during gameplay if it is the case of a user to \r\nchange the keys to something else. F2 will activate (and notify you ) the resetting of your perks (removal of all current perks), and gives you back perk points based on your character level.\r\n\r\nTo use the mod, place all the files (dummy.cpp is optional, it is the source code to the plugin, at least the main source file, anyways.) within your Skyrim directory, where TESV and SkyrimLauncher.exe are.\r\n\r\nI\\'ve included the source code to the main source file, conveniently named dummy.cpp because I was too lazy to make a new project, and used the default solution. This was compiled in VS 2010 Express.\r\n\r\nAuthors note:\r\n\r\n-----------------------------------------------------------------------\r\n\r\nChanged version scheming to keep up with different Skyrim versions.\r\n\r\n-----------------------------------------------------------------------\r\n     \r\nAlso note that you should probably visit the authors site or this thread if this does not  work with the current version of Skyrim as well:\r\n\r\nAs per the author of ScriptDragons request, I removed the asiloader and the ScriptDragon DLL from  the enclosed RAR, the author wishes that everyone using it have the latest version, instead of mismatched versions floating around some working, some not. You can get the ScriptDragon DLL and the asi loader (dinput8 DLL) from one of the 2 links below.\r\n\r\n(Link to authors community release)\r\nhttp://forums.bethsoft.com/index.php?/topic/1292671-rel-script-dragon/\r\n\r\n   - hitachihex\r\n\r\n",
  "categoryId": "73",
  "version": "0.4",
  "author": "hitachihex",
  "createdUnix": "1322491106",
  "updatedUnix": "1322491106",
  "containsAdultContent": false,
  "uploadedBy": "hitachihex",
  "primaryFile": null,
  "files": []
}