{
  "modId": 18779.0,
  "modName": "Markarth - CoBaS",
  "summary": "A mod that seeks to improve Markarth by adding more clutter, structures, trees(optional) and foliage.",
  "descriptionHtml": "1. Description\r\n2. Changelog\r\n3. The future\r\n4. Requirements\r\n5. Bugs\r\n6. Incompabilities\r\n7. Credits\r\n8. Permission\r\n\r\n1). Good people of the nexus, please don\\'t be too hard on me, as this is my first Skyrim mod. But here it is, Markarth - City of Blood and Silver, or CoBaS for short. This is not an actual \\\"overhaul\\\" but rather and improvement. I know that there\\'s a couple of mods like this already, but I still tried to give Markarth a personal twist in this mod.\r\n\r\nI was partly inspired to start this project after playing \\\"A Better Whiterun - City Under Construction\\\". I\\'m sure you\\'ve heard of it before, if you don\\'t have it already, and if you don\\'t then I highly encourage you to download and endorse it, as it\\'s it makes Whiterun a whole lot better, find it here:\r\nhttp://skyrim.nexusmods.com/mods/15776\r\n\r\nMarkarth, capital of the Reach, by some called \\\"The city of Blood and Silver\\\". A grand city locacet in the southwestern part of Skyrim. Behind these walls, corruption and crime flow like the rivers that pass through the city.\r\n\r\nOkay, let\\'s skip the storytelling and cut right to the chase: This is a mod that seeks to improve Markarth by adding various stuctures, trees... This is my vision of Markath so it may not be as close to lore as some might want. I kept to the concept of a dwemer city built of stone with a minimal use of dwarwen metal(unlike most other dwemer structures) like in the vanilla game, but I added a lot of flora and details along a couple of houses which, at this point, is empty. And some may argue and say, that the reach doesn\\'t have any pine trees, but rather small, unfertile shrubs. But again, this is my personal taste.\r\n\r\nHere\\'s a list of some of the features:\r\n- The \\\"docks\\\" or mining quarter has been improved by adding more woodworks and platform, cluttered by barrels and boxes. \r\n- The temple of Dibella now features more statues, and plants along some trees to create a more \\\"dense\\\" atmosphere.\r\n- The main gate has been made higher with built-in houses.\r\n- Arches, trees, vines and plants have been added all around the city.\r\n- The whole city now features walls along the mountain tops, and dams to let the waterfalls flow naturally.\r\n\r\n2).\r\n- 21-06-2012: Added a no-trees version as a separate file.\r\n\r\n- 12-07-2012: 500 downloads! Thank you so much everybody, I never thought I would hit a number that high. And a special thanks to all the people who endorsed it.\r\n\r\n- 27-07-2012: After some people having reported a bug with the entrance to the Talos Shrine, I have chosen to release an updated version of both files. However, the process was kind of complicated, so it might be posssible that something else acts a little weird.\r\n\r\n- 28-09-2012: A 1000 downloads, and 18 endorsements(before update)! Wow. To some it may seem a little useless and perhaps even stupid to keep track on these counts and even post them, but for me it\\'s a great motivational factor to actually see, in numbers, how many have tried it out, and how many who have choosen to return in order to endorse my first Skyrim mod. So once again, thank you guys and gals for giving my mod a try. Oh, and as for my promised next mod, then it\\'s taking a little longer than I thought. I still need to navmesh my new \\\"worldspace\\\" and perhaps even make a quest or two?\r\n\r\n3). In the future I plan to maybe add some more districts, like a fullblown mill for proccessing the ores found in the Cidhna Mines(currently working on) or a place for the lowlifes of the city to call their OWN.\r\n\r\n4). No requirements.\r\n\r\n5). Well, I tried the best I could, not to interfeer with the gaurds and citizens schedules, and while testing it, I didn\\'t encounter any problems, but I\\'m not entirely sure.\r\n\r\nI also tried to change some of the dragon landingplaces, in case of dragon attacks. But I haven\\'t met any dragons yet, although I don\\'t think it would cause any problems at all.\r\n\r\nPeople reported a bug in the first version where the entrance to the Talos Shrine would be placed underground, and with the release of version 2 of both file-variations the problem should be taken care of.\r\n\r\n6). As for incompabilities, then I don\\'t play with any mods that cause conflicts. But I definitely think, that this mod might be conflicting with Open Cities as well as mods that seek to improve Markath in the same manner as I did. Also, mods that tuck in structures like I did might cause problems and bugs. But I didn\\'t change anything outside the city, so don\\'t worry about that(although that is a future project of mine).\r\n\r\n7). Of course, Bethesda should be mentioned here for creating a game as grand as Skyrim(and for that matter all of their other great games), and giving people the opportunity to create their own mods with the Creation Kit.\r\n\r\nBut also you(yes you!) for providing feedback in case you try this mod. And remember, play well, and have fun;)\r\n\r\n8). Well, this mod is open for modders to modify, although I highly doubt it, as my mod doesn\\'t actually include any new meshes or textures. But it\\'s still open for other people as a modders ressource, although I demand to be mentioned as the original creater in case of redistributation here on the Nexus. Uploading this mods to other sites and services(including Steam Workshop) is NOT permitted.",
  "categoryId": "53",
  "version": "2.0",
  "author": "asbj0813",
  "createdUnix": "1339704687",
  "updatedUnix": "1343414080",
  "containsAdultContent": false,
  "uploadedBy": "asbj0813",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68007",
      "name": "Markarth - CoBaS",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "29",
      "fileName": "Markarth - CoBaS-18779-1-0.rar",
      "uploadedUnix": "1339704963",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/31fc4f22691a74d987c8b6daa6965c4de3c0bc5911629887aa2b4be5585ce7f3/analysis/1406959263/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Markarth%20-%20CoBaS-18779-1-0.rar?fid=68007&ttl=1535785831&ri=8192&rs=8192&setec=f95618e6cd66eb8885d0473a173a05b6"
    },
    {
      "fileId": "69379",
      "name": "Markarth - CoBaS - No trees version",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "27",
      "fileName": "Markarth - CoBaS - No trees version-18779-1-0.rar",
      "uploadedUnix": "1340278071",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cdaf80659c22c4b7f2b8034a4b869eeb4634122743f3c243e01a8e5a3b492fed/analysis/1406973423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Markarth%20-%20CoBaS%20-%20No%20trees%20version-18779-1-0.rar?fid=69379&ttl=1535785832&ri=8192&rs=8192&setec=c6a0c08b8395c3ef576242c46dc78aa3"
    },
    {
      "fileId": "76924",
      "name": "Markarth - CoBaS - No trees version - v2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28",
      "fileName": "Markarth - CoBaS - No trees version - v2-18779-2-0.rar",
      "uploadedUnix": "1343413246",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/fbc4e31ae7e832a8110f0fd56d45d15a306551c5bee1284a6c30c64a67a32667/analysis/1407050042/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Markarth%20-%20CoBaS%20-%20No%20trees%20version%20-%20v2-18779-2-0.rar?fid=76924&ttl=1535785832&ri=8192&rs=8192&setec=de9f20c8940136c0ddb764128e3ac325"
    },
    {
      "fileId": "76926",
      "name": "Markarth - CoBaS - v2",
      "version": "v2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29",
      "fileName": "Markarth - CoBaS - v2-18779-v2-0.rar",
      "uploadedUnix": "1343414080",
      "modVersion": "v2.0",
      "virusScanUrl": "https://www.virustotal.com/file/639ded113a2ea682d7228cc9249689ffcfb803bf2c7a6f70a2a7a5b6d11cf9bb/analysis/1407050103/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Markarth%20-%20CoBaS%20-%20v2-18779-v2-0.rar?fid=76926&ttl=1535785833&ri=8192&rs=8192&setec=31a2d52db0448b2899fce4f2478e5f79"
    }
  ]
}