{
  "modId": 18789.0,
  "modName": "Whiteruns Mythic Dawn Dungeon",
  "summary": "A new Evil lurks under the streets of Whiterun, The Mythic Dawn are back in a big dungeon even more dangerous than the Oblivion Era &#33;&#33;\r<br />\r<br />features include : \r<br />-A Dungeon filled with the mythic dawn cult and Dremora\r<br />-adds about 40 mins of fun new gameplay\r<br />-take on two Daedric Dragon Priest bosses and three OverGrow",
  "descriptionHtml": "A new Evil lurks under the streets of Whiterun, The Mythic Dawn are back in a big dungeon even more dangerous than the Oblivion Era &#33;&#33;\r<br />\r<br />features include : \r<br />-A Dungeon filled with the mythic dawn cult and Dremora\r<br />-adds about 40 mins of fun new gameplay\r<br />-take on two Daedric Dragon Priest bosses and three OverGrown Troll Bosses and big & small Daedric Spiders &#33;&#33;\r<br />-Lots of loot\r<br />-A second Boss Room has been added\r<br />\r<br />i have always liked the Mythic Dawn Cult but i feel like theres not enough to do with them in skyrim so i made this dungeon :)\r<br />\r<br />Video : http://www.youtube.com/watch?v=6E6FcMvwOqI&feature=plcp\r<br />\r<br />this mod can also be found on steam workshop.\r<br />\r<br />UPDATE LOG:\r<br />NEW-11/29/2015-Added torches with lighting effects through the whole dungeon. Added a Third Boss Room with loot chest and giant werewolf bosses\r<br />6/22/2012-added the second boss room with three OverGrown Troll Bosses and small but deadly daedric spiders that guard the entrace to the third Boss Room. Daedric spiders have been given a daedric heart as a drop item. The second boss room is located in a hatch in the first boss room.\r<br />6/19/2012-added spelltome books and soul gems. Daedric reward chest added with a daedric mace inside. minor bug & map fixes. Two daedric dragon priest bosses added instead of just the one and made them a bit stronger. Daedric Spiders Added to the boss room\r<br />6/17/2012-Illusion Staff removed & Petty Soul Gems added. Loot in some urns and chests have been changed. Some of the doors dont need keys to enter anymore. Added npc william gilbert the blacksmith of the mythic dawn also a key holder. Boss room door has been named to know where the boss is. Staff of Zombies moved and Scrolls of Raise Zombie added. Daedric mace and daedric heart added to boss loot. \r<br />6/16/2012-all npcs in the dungeon will respawn after 30 days if you clear it also npcs will respawn if you die in there.\r<br />6/15/2012-hach door has been fixed so you can enter and exit the dungeon as much as you want without crashing.\r<br />6/15/2012-HATCH TO THE DUNGEON HAS BEEN RELOCATED TO WHITERUN CATACOMBS IN THE HALLOF THE DEAD.",
  "categoryId": "88",
  "version": "v1.50",
  "author": "spidermight",
  "createdUnix": "1339719892",
  "updatedUnix": "1448748016",
  "containsAdultContent": false,
  "uploadedBy": "spidermight",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000186322",
      "name": "Mythic Dawn Dungeon NEW",
      "version": "v1.50",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "201",
      "fileName": "Mythic Dawn Dungeon NEW-18789-v1-50.rar",
      "uploadedUnix": "1448748016",
      "modVersion": "v1.50",
      "virusScanUrl": "https://www.virustotal.com/file/aae5622bdb7ae42759467b86f9cef1fed893b849ba7e360449d738774fc333d2/analysis/1448748064/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mythic%20Dawn%20Dungeon%20NEW-18789-v1-50.rar?fid=1000186322&ttl=1535785852&ri=8192&rs=8192&setec=db62fe1527180b9e85dac90697068258"
    }
  ]
}