{
  "modId": 18799.0,
  "modName": "Radiant and Unique Potions and Poisons HD",
  "summary": "No more generic potion and poison bottles! Enhance your Skyrim Experience with over 100 new textures for potions and poisons.  Each texture has been specifically designed from scratch for each specific bottle and size of potion or poison.",
  "descriptionHtml": "[size=4.0em][font=\\\"castellar\\\"][color=RED][u]RADIANT AND UNIQUE POTIONS AND POISONS[/u][/color][/size][/font]\r\n\r\n7/12/12: Version 2.0 Now Available!  YOU HAVE 4 OPTIONS:\r\n1) Potions and Poisons only - Glowing Version\r\n2) Potions and Poisons only - Non Glowing Version\r\n3) Potions and Poisons now combined with my mod \\\"Unique Booze Bottles HD\\\" with Glowing Potions and Poisons\r\n4) Potions and Poisons now combined with my mod \\\"Unique Booze Bottles HD\\\" with NON-Glowing Potions and Poisons\r\n\r\nONLY CHOOSE ONE!\r\n\r\nIf you install #3 or #4 you do not need to install my mod \\\"Unique Booze Bottles HD\\\" at all - you get all the same exact stuff\r\n\r\nI just did this to meet a request by several people to reduce the total # of .esp files for people.  If you want the ability to easily activate and deactivate potions and poisons and leave the booze bottles in or vice versa, then I suggest you still install separately.\r\n\r\nENJOY!\r\n\r\n7/9/2012: VERSION 2.0 NOW AVAILABLE!\r\n\r\nThanks to InsaneOhflex for making and posting this video on my mod!  He actually has a bunch of great mod review videos on his site which you can find here:\r\n[size=4.0em][font=\\\"castellar\\\"][color=RED][u][url=http://www.youtube.com/playlist?list=PL9FCDE9DDD9709AA3&feature=plcp]InsaneOhflex\\'s Skyrim Mod Showcase[/url]\r\n[youtube]SpTyC3DvGWM[/youtube][/u][/color][/size][/font]\r\nThanks to Brodual for featuring the mod on Skyrim Mods Weekly! (this mod at 4:41)\r\n[youtube]XEP0CE6s4KA[/youtube]\r\n[img]http://i1162.photobucket.com/albums/q524/exraycatt/RADIANTANDUNIQUEPOTIONSANDPOISONS3.jpg[/img]\r\n\r\n\r\n\r\nWHAT THIS MOD DOES:\r\nThis mod adds over 150 new textures, each 1K in resolution, and each specific to the potion or poison bottle it\\'s assigned to.  I tried very hard to keep it lore-friendly.  You will see each potion or poison bottle is different not just in color but in bottle pattern, label, and adornments.  Bottles have their own designs or labels now that reflect what the potion/poison actually does.  Many bottles even have labels that reflect some of the ingredients that go into making that specific potion. The .esp that comes with the mod is only there for the skill potions, so now instead of each skill potion looking the same boring yellow color, each type of skill potion now has a unique bottle.\r\n\r\nMany bottles have a glowing effect and will be visible much more easily in dark areas, but this was mainly done to enhance the aesthetic appearance and bring out the color and design.  \r\n\r\n[size=4.0em][font=\\\"castellar\\\"][color=green][u]RADIANT AND UNIQUE POTIONS AND POISONS[/u][/color][/size][/font]\r\n\r\nVersion 2.0\r\n\r\nWhat’s NEW:\r\n\r\nThere is much that is new in this version but I’ll try and give as concise a rundown as I can below.\r\n\r\n1)\tEvery bottle has been gone back over in excruciating detail and general enhancements and corrections have been made\r\n\r\n2)\tWhen you open your inventory, bottles will now be aligned appropriately for the label (big thanks to vincent7valentine7 for showing me how to do this), so you should not have to twist your bottle around to see what it is or what’s on it (though there’s sometimes lots more than just the main label )\r\n\r\n3)\tAll bottles now have environment maps.  They didn’t before?  Well some did and some didn’t.  When I edited the meshes the first time around, for some reason many of the bottles lost the ability to use and environment map so they were not.  Most poisons had environment maps but most potions did not.  If you don’t know what an environment map is, to put it simply, it tells the object how to mirror or reflect the light from its surroundings.  So now that all bottles have these (total mistake overlooked on my part), you will notice that bottles actually look more like glass.  I believe this is an improvement, but it does change the look a bit.  \r\n\r\n4)\tBottles have been given new environment maps which have an improved resolution, with the goal of enhancing the overall shine or aesthetic of the bottle. \r\n\r\n5)\tI made new cubemaps with a slightly higher resolution for potions so you will see less of the pixelated squares of lights when you see reflections of the bottle (easiest to see on the smallest potion bottle). \r\n\r\n6)\tWhen you see different images on potion bottles, there will now be a stronger correlation between what you see, and what actually is put into the potion to make it.  For example, the Restore Magicka potion may have a Spriggan, a Fire Atronach, and a Frost Atronach on it, because you need taproot, fire salts, and frost salts to make a Restore Magicka potion, respectively (among other possibilities).\r\n\r\n7)\tThe Restore Health Potion has had its color altered so it no longer gives off such a pinkish appearance, and now is more red like the vanilla color.\r\n\r\n8)\tThe default potion and poison bottles that you get when you create a potion or poison at the Alchemy Workbench have been changed and given their own bottle.  By default, the bottles have a dark grey appearance to separate them from the rest of the bottles.  I will provide optional files for you to choose the appearance of your default potion and poison bottle if you don’t like the one included in the main file.  Originally, in both vanilla and in Version 1 of my mod, the default potion bottle is the lesser restore health bottle, and the default poison bottle is the lesser damage stamina bottle.\r\n\r\n9)\tThe symbol and/or pictures for many bottles have been changed, I believe all are for the better and I hope you agree with me.  Very few symbols were recycled except for the general poison symbol which has remained the same to identify lower tier small poison bottles.  Wherever possible and applicable, I used “lore-friendly” pictures or symbols to enhance the bottles.  For example, for the potion of healing, there is now an image of the Divine Mara issuing healing magic.  For the potion of strength, there is now an image of a giant, because, well, giants are strong.  The connections between symbols and effects may not always be perfect, but if you are a lore-hound or maybe do some research, you will also be able to find why I chose certain things.  For example, you will see a Hagraven on one of the Damage Magicka potions because Hagravens can give you the disease Brain Rot, which damages your Magicka.  The fortify health regeneration bottle now has the symbol of  “The Lady” astrological sign.  Why?  Because when you have that sign active you regenerate health more quickly.  You get the picture….\r\n\r\n10)\tThe luminosity of each bottle has been optimized to still give the bottle an enchanted appearance while trying not to be too bright or too much of a standout (you will be the judge of this of course).\r\n\r\n11)\tMany things have been added which were either unique or rare items that didn’t have their own mesh or texture in the game including:\r\n\r\nPOTIONS:\r\n1)\tIce Wraith Essence\r\n2)\tVaermina’s Torpor\r\n3)\tSleeping Tree Sap\r\n4)\tPhilter of the Phantom\r\n5)\tEsbern’s Potion\r\n6)\tStallion’s Potion\r\n7)\tFalmer Blood Elixir\r\n\r\nPOISONS\r\n1)\tLotus Extract\r\n2)\tIce Wraith Bane\r\n3)\tNightshade Extract\r\n4)\tPest Poison\r\n\r\nSome of you may also be aware of and be using my “Unique Booze Bottles” mod.  There is some cross-over between these two mods because I did Skooma in the original Potions and Poisons mod and mistakenly included some booze meshes with the Potions and Poisons mod in the previous version.  I will put out a version that combines them both on this mod page (not on the booze mod page) if you want that since some of you have requested reduced “.esp clutter” ?, and I think it will cut down on confusion for some as well.\r\n\r\nENJOY!\r\n\r\n[size=4.0em][font=\\\"castellar\\\"][color=YELLOW][u]ALTERNATIVE DEFAULT POTION AND POISON BOTTLES[/u][/color][/size][/font]\r\n\r\n\r\nI have not found a way with or without the CK to make the potion and poison bottles made at the Alchemy bench use anything other than the bottles they default to.  In vanilla Skyrim, it was the smaller potion of restore health for all potions, and the small stamina poison bottle for all poisons.  \r\n\r\nIn v2 of my mod, I made these default options both grey to distinguish them from the potions you find in the world or buy.  In the event you don’t like the grey bottles I have made as default, I have provided other options….  I gave them lame names but you get the drift and this may help from confusing you which is a potion and which is a poison, they both go in the same folder.  Please look at the Images section to see what you want.\r\n\r\nPotions:\r\nDefault Grey (comes in the download)\r\nBlack Magic\r\nVerdant Green\r\nDeep Red\r\nArcane Blue\r\nMystic Purple\r\n\r\n\r\nPoisons:\r\nDefault Grey (comes in the download)\r\nBlack Death\r\nPoisonous Green\r\nBlood Red\r\nLethal Blue\r\nToxic Purple\r\n\r\nInstallation:\r\n1)\tEasily change options using NMM\r\nor\r\n2)\tJust drop whichever option you want, one for potions, and one for poisons, in:\r\n\r\nData/textures/clutter\r\n\r\nFolder and choose to overwrite.  You CAN ONLY HAVE ONE OPTION INSTALLED AT A TIME\r\n\r\n\r\n\r\nUPDATE HISTORY\r\n\r\n7/9/12: Version 2 Glowing Version added!\r\n\r\n7/4/12 UPDATE: I decided against including alcohols with this mod because I\\'m guessing some people may want the potions but not alcohols and vice versa.  So I made an independent Alcohol mod that you can find here:\r\n\r\n[url=http://skyrim.nexusmods.com/mods/19922]Unique Booze Bottles[/url]\r\n\r\nThis mod does the same for alcohol bottles what Radiant and Unique Potions and Poisons did for Potion bottles, in giving them unique bottes, labels, and names instead of the generic vanilla style.\r\n6/20/12: Added full NON-GLOWING version of potions and poisons, including new skill potions.  Added full GLOWING version that is complete with new skill potions.  No Hotfix needed if you are using either of these, so I suggest upgrading if you haven\\'t.\r\n\r\n6/19/12: Added the Hotfix for the missing skill potions of Conflict, Escape, Keen Shot, Larceny, and Plunder.  Thanks to Kodiak for alerting me to the fact that these were associated with the Thieves\\' guild (I\\'ve never actually gotten there in the game) as that heavily influenced the design of the bottles which you will understand when you see them.\r\n\r\n6/18/12:  Added optional download for Non-Glowing Poison bottles.  This file can be added after the original main file, in which case it will override the glowing poisons and leave the glowing potions, or it can be used as a standalone - in which case you\\'d just get my poison bottles but all other potions in the game would be left the same.  You do not need a .esp file to run this file, all you need are the meshes and textures.  The file is large because I did have to do new textures for all the bottles, mainly because the lighting would have been way off if I just took the glow out, so do not just install the textures without the meshes or vice versa.\r\n\r\n6/16/12: Added hotfix that should correct problem with some skill potions (Conflict, Escape, Keen Shot, Larceny, and Plunder) not showing up in-game.  This is a generic bottle for the time being and those potions are being worked on to give them unique textures as well...\r\n\r\nThanks to jacktthompson, Kodiak412, and yafi for helping me find this problem\r\n\r\nIf anyone else experiences problems or missing textures let me know!\r\n\r\nINSTALLATION:\r\nA. MAIN FILE\r\n1) Use NMM!\r\nor\r\n2) Manual: just drop the \\\"data\\\" folder in your Skyrim folder, and be sure to activate the .esp in your \\\"data files\\\" or NMM \\\"plug-ins\\\" section.\\'\r\n\r\nB. OPTIONAL: Non-Glowing Poisons now available\r\n1.) Use NMM!  - if you do the NMM install, just make sure that you download it after the main file.  If you are using it as a standalone without the glowing potions you don\\'t need to worry about this.  There is no .esp required for just the poisons.\r\nor \r\n2.) Manual - drop data folder in your Skyrim folder and click \\\"yes\\\" if asked to merge folders.  If you are doing this after you have the main file installed that has both potions and poisons, then click yes to merge folders and overwrite the glowing poison meshes and textures.  There is no .esp required for just the poisons.\r\n\r\nUNINSTALLATION:\r\n1) Use NMM\r\nor\r\n2 Manual - delete the installed files from your \r\nData/Meshes/Clutter/Potions\r\nData/Meshes/Clutter/Ingredients\r\nData/Textures/Clutter\r\nData/Textures/Clutter/Ingredients (for frostbite venom only)\r\nand delete the .esp from your Data folder\r\n\r\nCONFLICTS/COMPATIBILITY: \r\nThis mod will conflict with other mods that alter potion attributes.  However even if you use this mod with another that alters potions, most of the potions will not be affected.  It\\'s only the skill potions and a few others that I had to make new model entries for in the CK.  For best results if you are using a mod that alters potion attributes, I would load it after this mod - you will still get most of the textures and retain all the changed attributes from whatever other mod you are using.  If you The only other way you may come across a conflict is if something clashes with the .esp because you have a mod that alters skill potions.  To solve this, the simplest way would be to just delete my .esp, you will only lose the skill potion bottles being unique, and will get the skill potions bottles back to their default appearance.\r\n\r\nTROUBLESHOOTING:\r\n1) If you notice that you have glowing white skill potion bottles for certain potions (should only happen with potions of Conflict, Escape, Keen Shot, Larceny, and Plunder), then install the hotfix listed in \\\"old files\\\" (I recommend you do it anyways otherwise eventually you will see weird bottles).  Even better just upgrade to the current version which has everything in one and no hotfix needed. \r\n\r\nPlease inform me of any problems you might come across either in the Comments section or by private messaging on the Nexus.  Thank You!\r\n\r\nFUTURE PLANS:\r\n1) Finish the rare quest-related potion bottles to give them unique textures\r\n2) Go back over all bottles and fix some of the ones I wasn\\'t quite satisfied with\r\n3) Possibly make a version without the new label textures I added, but with just the bottle textures\r\n\r\n\r\nCredits:\r\nThe Nexus staff and community\r\nBethesda\r\nPhotoshop\r\nShutterstock for images\r\nThanks to jacktthompson, Kodiak412, vegeta0585, and yafi for help troubleshooting\r\nThanks to insaneOhflex and Brodual for featuring the mod in their amazing video series\r\nThanks always to Bellyache (I hope she comes back soon) for getting me started in Photoshop\r\nThanks to everyone who has given feedback, support, and endorsements\r\n\r\n",
  "categoryId": "94",
  "version": "2.0",
  "author": "XRC",
  "createdUnix": "1339744773",
  "updatedUnix": "1342155677",
  "containsAdultContent": false,
  "uploadedBy": "exray catt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68769",
      "name": "Radiant and Unique POISONS ONLY NON-GLOWING Version",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "27281",
      "fileName": "Radiant and Unique POISONS NON-GLOWING Version-18799-1-0.rar",
      "uploadedUnix": "1340005643",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d87175b62df5f115971c0d94dc8ad7542ed07842b7e41146328229f9bd0293ec/analysis/1406966892/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Radiant%20and%20Unique%20POISONS%20NON-GLOWING%20Version-18799-1-0.rar?fid=68769&ttl=1535785867&ri=8192&rs=8192&setec=d85780dd6535c99f188b959ab95c27ea"
    },
    {
      "fileId": "69145",
      "name": "Radiant and Unique Potions and Poisons Version 1 Glowing Version",
      "version": "1.11",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "65879",
      "fileName": "Radiant and Unique Potions and Poisons Glowing Version-18799-1-11.rar",
      "uploadedUnix": "1340172124",
      "modVersion": "1.11",
      "virusScanUrl": "https://www.virustotal.com/file/5a28f56bfc83b01fb205cfc78443ab20322a086c5620f0784fe1d6acb22124b0/analysis/1406971051/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Radiant%20and%20Unique%20Potions%20and%20Poisons%20Glowing%20Version-18799-1-11.rar?fid=69145&ttl=1535785868&ri=8192&rs=8192&setec=ff1e8d04f1fad291ea5ff0d2d7af0acb"
    },
    {
      "fileId": "69864",
      "name": "Radiant and Unique Potions and Poisons Version 1 NON-GLOWING Version",
      "version": "1.11",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "67519",
      "fileName": "Radiant and Unique Potions and Poisons NON-GLOWING Version-18799-1-11.rar",
      "uploadedUnix": "1340472191",
      "modVersion": "1.11",
      "virusScanUrl": "https://www.virustotal.com/file/9526149893d7f50e282f7f8aa40c506aedf72fa1db79f268bce441186a5a4265/analysis/1406978345/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Radiant%20and%20Unique%20Potions%20and%20Poisons%20NON-GLOWING%20Version-18799-1-11.rar?fid=69864&ttl=1535785868&ri=8192&rs=8192&setec=5b2c3198a77ed5a6827dba2fa0672190"
    },
    {
      "fileId": "73327",
      "name": "Radiant and Unique Potions and Poisons v2 Glow Version ",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "71869",
      "fileName": "Radiant and Unique Potions and Poisons v2 Glow Version -18799-2-0.rar",
      "uploadedUnix": "1341900192",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/59a99c7e3fe92dd0186bdcb20a782b29159e14c7ad06d18f75d77a11a8862e14/analysis/1407013223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Radiant%20and%20Unique%20Potions%20and%20Poisons%20v2%20Glow%20Version%20-18799-2-0.rar?fid=73327&ttl=1535785868&ri=8192&rs=8192&setec=adef46c86bb6cf496950e0a15dbfd4f5"
    },
    {
      "fileId": "73555",
      "name": "Default Alchemy Poison Bottle - Black Death",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "339",
      "fileName": "Poison Bottle Alchemy Default - Black Death-18799-2-0.rar",
      "uploadedUnix": "1341983452",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/0436badf79a685fbd88868a8de1d90beb9fb36c0f14c9ea628baf869224b1b09/analysis/1407015483/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Poison%20Bottle%20Alchemy%20Default%20-%20Black%20Death-18799-2-0.rar?fid=73555&ttl=1535785869&ri=8192&rs=8192&setec=c778bf72cdfbb08366c01dbaf0bf0639"
    },
    {
      "fileId": "73556",
      "name": "Default Alchemy Poison Bottle - Blood Red",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "470",
      "fileName": "Poison Bottle Alchemy Default - Blood Red-18799-2-0.rar",
      "uploadedUnix": "1341983656",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/22189bbb2c85e439eeb3ac7cca29a1eb8dee6c57cc6d2ba171630d1bea714797/analysis/1407015484/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Poison%20Bottle%20Alchemy%20Default%20-%20Blood%20Red-18799-2-0.rar?fid=73556&ttl=1535785869&ri=8192&rs=8192&setec=79489c54add43f27cdbe9d7a73cea204"
    },
    {
      "fileId": "73557",
      "name": "Default Alchemy Poison Bottle - Lethal Blue",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "477",
      "fileName": "Poison Bottle Alchemy Default - Lethal Blue-18799-2-0.rar",
      "uploadedUnix": "1341983725",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/a1c21804dc8028987f913a40f1b44f4453586a7c94035e1810197edf2deee6f2/analysis/1407015485/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Poison%20Bottle%20Alchemy%20Default%20-%20Lethal%20Blue-18799-2-0.rar?fid=73557&ttl=1535785870&ri=8192&rs=8192&setec=1855ffb44aad611a6dc5f74e34b65502"
    },
    {
      "fileId": "73558",
      "name": "Default Alchemy Poison Bottle - Poisonous Green",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "475",
      "fileName": "Default Alchemy Poison Bottle - Poisonous Green-18799-2-0.rar",
      "uploadedUnix": "1341983777",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/95fb6b77d07023d39bc5a2c8daad4d568e4a3b221e380cb3278e4944fcc3c368/analysis/1407015543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Default%20Alchemy%20Poison%20Bottle%20-%20Poisonous%20Green-18799-2-0.rar?fid=73558&ttl=1535785870&ri=8192&rs=8192&setec=f4fba1aabe1a5a5fb09b18c5eff428d7"
    },
    {
      "fileId": "73559",
      "name": "Default Alchemy Poison Bottle - Toxic Purple",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "467",
      "fileName": "Default Alchemy Poison Bottle - Toxic Purple-18799-2-0.rar",
      "uploadedUnix": "1341983825",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/411cbd4b9d26f7b67c738cb178f830dc1b266b077424e486ea960e67bdfd90bf/analysis/1407015544/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Default%20Alchemy%20Poison%20Bottle%20-%20Toxic%20Purple-18799-2-0.rar?fid=73559&ttl=1535785871&ri=8192&rs=8192&setec=b09f03172ae3c1d5c1768442c8daaf68"
    },
    {
      "fileId": "73561",
      "name": "Default Alchemy POTION Bottle - Arcane Blue",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "466",
      "fileName": "Default Alchemy POTION Bottle - Arcane Blue-18799-2-0.rar",
      "uploadedUnix": "1341983906",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/444f34f2d2ed6cfcb0fb67cd7dc073709e358a745b6977ebaec7cdac0a4ab158/analysis/1407015546/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Default%20Alchemy%20POTION%20Bottle%20-%20Arcane%20Blue-18799-2-0.rar?fid=73561&ttl=1535785872&ri=8192&rs=8192&setec=67fb58488ce42c67ef408eb410722144"
    },
    {
      "fileId": "73562",
      "name": "Default Alchemy POTION Bottle - Black Magic",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "191",
      "fileName": "Default Alchemy POTION Bottle - Black Magic-18799-2-0.rar",
      "uploadedUnix": "1341983950",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/239da3afec0e066bef4a80b4b96b3fa5be7126fb8b4279b30dbd3984e99068bf/analysis/1407015604/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Default%20Alchemy%20POTION%20Bottle%20-%20Black%20Magic-18799-2-0.rar?fid=73562&ttl=1535785872&ri=8192&rs=8192&setec=a0ad3d028e6d78b46692cf0b20192de1"
    },
    {
      "fileId": "73563",
      "name": "Default Alchemy POTION Bottle - Deep Red",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "470",
      "fileName": "Default Alchemy POTION Bottle - Deep Red-18799-2-0.rar",
      "uploadedUnix": "1341984011",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/3120de371a34417c50ddb926e4e31ef42ddbe9579ca5bc450f6e285e530c325c/analysis/1407015605/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Default%20Alchemy%20POTION%20Bottle%20-%20Deep%20Red-18799-2-0.rar?fid=73563&ttl=1535785872&ri=8192&rs=8192&setec=b1e1ad891a420a65e9843a6222141015"
    },
    {
      "fileId": "73564",
      "name": "Default Alchemy POTION Bottle - Mystic Purple",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "451",
      "fileName": "Default Alchemy POTION Bottle - Mystic Purple-18799-2-0.rar",
      "uploadedUnix": "1341984059",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/9d3f1eed5640b0f7e8d44db5170a1726bf3b9c45562889f67110274d7772d080/analysis/1407015606/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Default%20Alchemy%20POTION%20Bottle%20-%20Mystic%20Purple-18799-2-0.rar?fid=73564&ttl=1535785873&ri=8192&rs=8192&setec=5555a9d3b332776f76602fc4bbbc5daf"
    },
    {
      "fileId": "73565",
      "name": "Default Alchemy POTION Bottle - Verdant Green",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "476",
      "fileName": "Default Alchemy POTION Bottle - Verdant Green-18799-2-0.rar",
      "uploadedUnix": "1341984098",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/a1e33c5382227adb078b6457824a7bf95d3bfa248f6d573b312229d0433bc3eb/analysis/1407015608/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Default%20Alchemy%20POTION%20Bottle%20-%20Verdant%20Green-18799-2-0.rar?fid=73565&ttl=1535785873&ri=8192&rs=8192&setec=487ad921c9fbe0fbb8bf42b7956c5a24"
    },
    {
      "fileId": "73775",
      "name": "Radiant and Unique Potions and Poisons v2 NON-GLOW Version",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "79621",
      "fileName": "Radiant and Unique Potions and Poisons v2 NON-GLOW Version-18799-2-0.rar",
      "uploadedUnix": "1342082006",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/3e6a5af2c15fb4a515397785a2f69efdb60cfcc4d9b24566b63aa16ccf1a44a6/analysis/1407017660/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Radiant%20and%20Unique%20Potions%20and%20Poisons%20v2%20NON-GLOW%20Version-18799-2-0.rar?fid=73775&ttl=1535785874&ri=8192&rs=8192&setec=6620cfe7abe5c5ecf111935de047ec90"
    },
    {
      "fileId": "73942",
      "name": "Radiant and Unique Potions Poisons and BOOZE v2 NON GLOW",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "90891",
      "fileName": "Radiant and Unique Potions Poisons and BOOZE v2 NON GLOW-18799-2-0.rar",
      "uploadedUnix": "1342154786",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/ddf5b57ba4d7f8afed76cea6a0f9c1365c3ca99c827330357f868c2e7bde8e8d/analysis/1407019310/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Radiant%20and%20Unique%20Potions%20Poisons%20and%20BOOZE%20v2%20NON%20GLOW-18799-2-0.rar?fid=73942&ttl=1535785875&ri=8192&rs=8192&setec=e9d2e50c9cada822f5a304b58b8d985e"
    },
    {
      "fileId": "73946",
      "name": "Radiant and Unique Potions Poisons and BOOZE v2 GLOWING VERSION",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "83102",
      "fileName": "Radiant and Unique Potions Poisons and BOOZE v2 GLOWING VERSION-18799-2-0.rar",
      "uploadedUnix": "1342155677",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/f2a352c013082483ed0c232420aec25ca3bbad10f654a0afab23a1ded11043fc/analysis/1407019344/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Radiant%20and%20Unique%20Potions%20Poisons%20and%20BOOZE%20v2%20GLOWING%20VERSION-18799-2-0.rar?fid=73946&ttl=1535785875&ri=8192&rs=8192&setec=1b605f163070590d3acadda88f75c20b"
    }
  ]
}