{
  "modId": 18800.0,
  "modName": "Summon Legendary Hero - Ysgramor",
  "summary": "Summon the Legendary Hero and leader of the 500 Companions Ysgramor.  Ysgramor will then summon the spirits of his son and the past great Harbingers to join in battle.",
  "descriptionHtml": "========================================================\r\n9/8/12 Update Notes:\r\nVersion 1a and 2a fixes the issue of a player randomly breathing fire when equipping a full set of heavy armor.  The spell was caused by the reflect blows perk having an extra script on it.  I removed it and now the effect does not happen.  Thank you Zharanos and DCUO for reporting the original issue occuring.  Version 1a has a 24 hour recast timer.  Version 2a does not.\r\n========================================================\r\n\r\nVersion 1 - Ysgramor can be summoned every 24 ingame hours.\r\n\r\nVersion 2 - Ysgramor can be summoned at any time.\r\n\r\nYsgramor is the legendary hero who returned from Atmora to avenge his people killed by the elves in the Night of Tears.  Accompanying him was the original 500 Companions who routed the elves out of Skyrim.  This mod is intentionally made overpowered for vanilla Skyrim. I am not reconsidering rebalancing this ability because it is to rival the Wolf Queen Potema summon I created.  Instead of 500 Companions, I made his ability to summon past named Harbingers and his son Yngol to join him in battle.  (I can make the summon 500 Companions, but I am sure it will crash the game...)\r\n\r\nTo find the spell tome to teach you the ability go to Ysgramor\\'s Grave and enter the final area to look for Ysgramor\\'s Charter.  This can only be accomplished by getting to the end of the Companion\\'s faction quest line.\r\n\r\n****SPOILER*** \r\nSpecifically, the Charter is located in the area where you free Kodlak\\'s soul from lycanthrophy.\r\n****END SPOILER****\r\n\r\nYsgramor is equipped with the following:\r\n\r\n1. True Wuuthrad - Maintains the Bane of Elves enchant, but adds Orcs into the list.  Weapon is twice as deadly for NPCs with elven blood.  Additional enchant added so that the weapon inflicts fire, frost, and shock damage.\r\n2. Heroic Slash - Ysgramor unleashes a shockwave of elemental energy that burns, freezes, and shocks his opponent.\r\n3: Call of the Companions- Ysgramor calls upon the spirits of his son Yngol and the past harbingers to join him in combat: Yngol, Jeek of the River, Mryfwiil the Withdrawn, Tulvar the Unmentioned, Cirroc the Lofty, Henantier the Outsider, Macke of the Piercing Eyes, Kyrnil Long-Nosed, Swyk the Long Sighted, and Terrfyg the Cursed for 10 minutes.\r\n4: Final Call - If by chance Ysgramor almost perishes (which seems to never happen), he unleashes the full fury of his companions, and they will accompany him for 10 hours.\r\n5: Increased stats in health and stamina.\r\n6: Custom combat style that focuses on melee combat with periodic use of his Heroic Slash ability.  He will also summon his companions when he is surrounded.\r\n7: Ysgramor\\'s companions also have their own specialized abilities: Yngol; a)Disarming Strikes and Shield Bash b) Ghost\\'s Stare that can cause his foes to throw their weapons in fear and run away. Jeek; a) Grand Rapids - Unleashes a wave of water to damage surrounding opponents health and stamina. Mryfwiil; a)Great Unifier - Mryfwiil\\'s great influence surrounds him as a cloak and heals his companion\\'s health and stamina.  Tulvar; a)Stoic Defense - Magic and Arrows do not damage Tulvar. b)Charging Meteor - Tulvar\\'s specialized shield charge staggers surrounding foes (an allies foolish enough to get in his way). Cirroc; a) Flame Cyclone Slash - Burns his opponents upon strikes and engulfs the enemies in flames indefinitely, even in death.  Henantier; a)Leaf Storm Bow that unleashes leaf like arrows that creates a leaf storm upon contact. b)Frozen Strike - Enchanted dagger that generates an explosive ice field damaging surrounding foes. Macke; a) Piercing Stare - Macke\\'s evil glare paralyzes even the strongest of foes.  Works on Men,Mer, or beasts.  Kyrnil; a)Divine Justice - Kyrnil\\'s sword strikes and arrows destroys all undead beings.  Swyk; a)Tales of Bravery - Swyk\\'s influence encourages his Companions (and the player) with a rally effect that increases bravery, health, and stamina.  Terrfyg; a) Curse of the Beast- Tyrfig becomes a werewolf if he suffers too much damage, although he will not attack his fellow harbingers (or the player), his blood lust will cause him to attack everyone (it is advisable not to have Terrfyg around when entering towns in his wolf form... he will attack everyone). \r\n\r\nNotes: As mentioned earlier, Ysgramor is made to be very powerful and can easily overwhelm most vanilla areas. This version is the initial powerful version, and practically makes the player invincible. I suggest only using this when you are in dire need of help, or if you want to clear an area quickly.  I do not plan on rebalancing this because the intention is to make this ability very powerful.  Use at our own discretion.  I also suggest to not use any other followers when summoning Ysgramor, because of the wide area of attacks he and his companions unleash, any followers may become hostile against Ysgramor and his allies and will result in a fight to the death (most likely your follower if they\\'re not essential, if they are, then it will be a never ending battle).  I will release an unsummoning spell for summons eventually, and I am sure if there are any mods that unsummon these actors, they will work fine. The closest function I\\'ve added in balancing the summon is that his Harbingers will not zone when entering a new area and Ysgramor must resummon them.\r\n\r\nPlease let me know if there are any issues with this mod. I don\\'t believe it should have any issues with any existing mods except other follower mods. Please endorse if you like the file, and if not, please feel free to comment. I have many more summons I am creating, and hopefully I\\'ll release them soon! Thank you and enjoy! ",
  "categoryId": "75",
  "version": "2a",
  "author": "zeroeternalz",
  "createdUnix": "1339746224",
  "updatedUnix": "1347112220",
  "containsAdultContent": false,
  "uploadedBy": "zeroeternalz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68116",
      "name": "Summon Legendary Hero - Ysgramor",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "30",
      "fileName": "Summon Legendary Hero - Ysgramor-18800-1.zip",
      "uploadedUnix": "1339746298",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/4ad627ebd5c56fa94781e4fc802fd904042375996f7fd3a12db7ed5b0de19bbd/analysis/1406960403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Legendary%20Hero%20-%20Ysgramor-18800-1.zip?fid=68116&ttl=1535785877&ri=8192&rs=8192&setec=5c99406f979e1868938c11a41adef579"
    },
    {
      "fileId": "68117",
      "name": "Summon Legendary Hero - Ysgramor v2",
      "version": "2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "30",
      "fileName": "Summon Legendary Hero - Ysgramor v2-18800-2.zip",
      "uploadedUnix": "1339746363",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/1768b0138732ea1f7b0c456eb048662f10ada29d7a3cc76a65fcae307e9f6395/analysis/1406960403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Legendary%20Hero%20-%20Ysgramor%20v2-18800-2.zip?fid=68117&ttl=1535785877&ri=8192&rs=8192&setec=8aed2b66240bf3736be5d8eb9ea4c0ac"
    },
    {
      "fileId": "87155",
      "name": "Summon Legendary Hero - Ysgramor v1a",
      "version": "1a",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "23",
      "fileName": "Summon Legendary Hero - Ysgramor v1a-18800-1a.zip",
      "uploadedUnix": "1347112040",
      "modVersion": "1a",
      "virusScanUrl": "https://www.virustotal.com/file/828582a92d8dbe00fad21f32d9d409dc166ebecc3b335748c63ff74e36b8c42e/analysis/1407153068/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Legendary%20Hero%20-%20Ysgramor%20v1a-18800-1a.zip?fid=87155&ttl=1535785878&ri=8192&rs=8192&setec=c788bba77fb99be6a10a072583e841de"
    },
    {
      "fileId": "87156",
      "name": "Summon Legendary Hero - Ysgramor v2a",
      "version": "2a",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "23",
      "fileName": "Summon Legendary Hero - Ysgramor v2a-18800-2a.zip",
      "uploadedUnix": "1347112220",
      "modVersion": "2a",
      "virusScanUrl": "https://www.virustotal.com/file/c64952c5774e15d35032c517f7018ed128f413bcb170963690c29c9b9eef1438/analysis/1407153069/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Legendary%20Hero%20-%20Ysgramor%20v2a-18800-2a.zip?fid=87156&ttl=1535785878&ri=8192&rs=8192&setec=2bb18a79cbd0d0028db806277f100026"
    }
  ]
}