{
  "modId": 18832.0,
  "modName": "Skyrim - Morrowind Border Guards - Argonian",
  "summary": "Adds the An-Xileel Border Watch",
  "descriptionHtml": "Since the Argonians invaded and conqoured Morrowind in the recent past - the dominant faction of the invading forces and also who defeats Dagon during the invasion of Black Marsh in the Oblivion crisis, known only as the An-Xileel, they would naturally send border patrols on the Skyrim/Morrowind border to prevent any outside interfearance...\r\n\r\nEspecially during such a turbulant time in Skyrim because of the Stormcloak rebellion.\r\n\r\nI may expand upon this but in past projects, I lost interest but who knows...\r\n\r\nI do have alot of free time this summer if I can help it, and I have alot of conceptual ideas involving the Argonians of Morrowind and the An-Xileel. \r\n\r\nThis mod basically adds two Border watch type posts inhabited by Argonian An-Xileel soldiers, dressed in Leather Armor and carrying ebony weapons. This is lore friendly and a nice touch to realism of Skyrim.... there is a certain lack of Argonian NPCs in Skyrim\r\n\r\nAll Argonians have individual Appearances and also the FaceGen info is included if your scared of no colors. I tried to style a few in the style as Oblivion Argonians based on facial colors and crests.... just a little nostalgia. There are both Male and Female Soldiers present\r\nNo custom dialogue planned.\r\n\r\n If you dislike Argonians, move along.",
  "categoryId": "25",
  "version": "1",
  "author": "Beth",
  "createdUnix": "1339793292",
  "updatedUnix": "1339799370",
  "containsAdultContent": false,
  "uploadedBy": "nofear88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68255",
      "name": "Skyrim Border watch - Argonians",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "926",
      "fileName": "Skyrim Border watch - Argonians-18832-1.rar",
      "uploadedUnix": "1339799370",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/ca3d2b033f40f2941482d0ab8f1d9483ff7be2393075400cc0a6d82ef7bb265d/analysis/1406962003/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Border%20watch%20-%20Argonians-18832-1.rar?fid=68255&ttl=1535785931&ri=8192&rs=8192&setec=dac34ec9d1b233725d13bc5a33629032"
    }
  ]
}