{
  "modId": 18848.0,
  "modName": "Dragonian Race",
  "summary": "Entirely new race with edited models and custom high res textures.",
  "descriptionHtml": "[img]http://static.skyrim.nexusmods.com/mods/images/18848-1-1339818697.jpg[/img]\r\n\r\nEndorsing means I keep working.\r\nPlease REMEMBER THAT THIS IS A BETA!  A WIP! \r\nUpdate: I think I\\'ll just go back to using vanilla textures so they fit better in the game.\r\n\r\nDragonian Race -- Beta\r\nby ElSte17\r\n\r\nDescription:\r\n\r\nLittle is known of the origins of the Dragonian (sometimes known as Dovagonians), who seem to have recently appeared in Skyrim out of nowhere. It is rumored that a group of necromancers in a Daedric cult sought to create these creatures by using dark magic to mate Argonian with Dovah, resulting in a scaley morph of an Argonian with the head of a Dovah. \r\n\r\n\r\nAttention: This is a beta version. Still some issues that need to be worked out. It is fully functional though, just some annoying bugs.\r\n\r\nKnown bugs:\r\nLeft hand sometimes becomes temporarily twisted.\r\n1st person hands sometimes dissapear\r\nObviously helms will not fit nicely on the head, so I have made it so you still get the armor/effects from helmets but you cannot see them. I\\'ll eventually make custom helmets for the main types of helmets.\r\n\r\nSince this has not really been done before with entirely new body meshes, the race customization is very limited. Only customization so far is between skin colors, which each have to be made as a separate race. Default color is emerald. To choose turquoise, change the hair color in the race menu. I\\'m going to add a spell that lets you change color at any time. I\\'ll also add many more color variations.\r\n\r\nPlease don\\'t complain, this is a VERY trick mod and I\\'ve had to figure it all out myself. If you can\\'t sacrifice your stupid little helmet for a dragon\\'s head, don\\'t get this mod. If you can\\'t ignore some minor bugs, don\\'t get this mod. The more support I get, the better and faster this mod will develop.\r\n\r\nIf anyone has any idea how to fix my bugs, please let me know ASAP.\r\n\r\nAlso, making armor equippable for a race with a custom body mesh is painstakingly tedious and time consuming, so I only made commonly used armors equippable. If you try to equip something in the game and it doesnt show up, leave a comment about what armor piece it is and I\\'ll add it.\r\n\r\nHope you guys like it, more to come!",
  "categoryId": "34",
  "version": "Beta",
  "author": "ElSte17",
  "createdUnix": "1339818595",
  "updatedUnix": "1339819244",
  "containsAdultContent": false,
  "uploadedBy": "ElSte17",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68282",
      "name": "Dragonian Race Beta",
      "version": "Beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17505",
      "fileName": "Dragonian Race Beta-18848-Beta.rar",
      "uploadedUnix": "1339819244",
      "modVersion": "Beta",
      "virusScanUrl": "https://www.virustotal.com/file/8d03a9ec8d3b2ed2b12830d3c4b1913bbd1037337ffde4fbded99c8fa608c71c/analysis/1406962406/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonian%20Race%20Beta-18848-Beta.rar?fid=68282&ttl=1535785956&ri=8192&rs=8192&setec=584eb3a4944f75a1db44d49f9d9862dc"
    }
  ]
}