{
  "modId": 18863.0,
  "modName": "Matys Medieval Knights",
  "summary": "This mod adds 3 new armor Crusader armor sets to the game Teutonic, Hospitaller and Templar.",
  "descriptionHtml": "If you like please also check out my Knights of the nine and mithril armor mods\r\n\r\nThis mod adds 3 new armor Crusader armor sets to the game Teutonic, Hospitaller and Templar. All can be crafted and improved but you need the advanced smithing perk to do so. \r\nPlease feel free to discuss ideas as I will be improving on this mod :)\r\n\r\nPlans for the future are to make skyrim knights with the same meshes as these but with each holds emblems.\r\n\r\nCredits\r\nThankyou to Zenl for letting me use his cape mesh as a base for my new modified version.http://skyrim.nexusmods.com/downloads/file.php?id=11784\r\n\r\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\Permissions/////////\r\nThe assets that I created in this mod are now able to be used as modders recourses but with a few guidelines to be followed.\r\n1. if you use some of these assets you must clearly credit in the mod description and include the link as well.\r\n2. You cannot re-release this exact mod just as it is as your own unless it is a language translation.\r\n3. You cannot release as a armor mod based on the same theme as this armor. e.g. templar armor. (As I still have plans for this in the future). You can how ever make quests for templars etc\r\n4. If you use my assets then give someone else permission to use your assets you must inform them that they have to credit as well. \r\nFeel free to message me about any of these points\r\n",
  "categoryId": "54",
  "version": "V1",
  "author": "Maty743",
  "createdUnix": "1339848378",
  "updatedUnix": "1339849371",
  "containsAdultContent": false,
  "uploadedBy": "maty743",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68351",
      "name": "Matys Medieval Knights V1",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "85792",
      "fileName": "Matys Medieval Knights V1-18863-V1.zip",
      "uploadedUnix": "1339849371",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/0ba8f0113402a64a6ff381854dacce6241b03aa769ed8bedf9890d50ab5c8d02/analysis/1406962942/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Matys%20Medieval%20Knights%20V1-18863-V1.zip?fid=68351&ttl=1535785973&ri=8192&rs=8192&setec=99d2bcb3f230b6f3953147aa2331177e"
    }
  ]
}