{
  "modId": 18867.0,
  "modName": "Ragdoll mod by Hellmaker",
  "summary": "Ragdoll mod changing the physics of falling, flexibility, weight, and friction models for people, Khajiit, Nord, as well as for other races aside, in my opinion, more realistic.",
  "descriptionHtml": "Ragdoll mod changes the physics of falling, flexibility, weight, and friction models for the people, Khajiit, Nord, as well as for other races aside, in my opinion, more realistic:\r\n\r\n  Body-weight increased.\r\n\r\n  -The rate of incidence increased.\r\n\r\n  -The flexibility of the body, in general, increased.\r\n\r\n  -Knees bent-less, because otherwise it leads to stupid poses, in which lies the corpse.\r\n\r\n  -Y of the hip and hand adjusted range of possible locations.\r\n\r\n  -Adjusted the radius of rotation of the head.\r\n\r\n  -Adjusted suppleness.\r\n\r\n  -The friction of the surface-enhanced.\r\n\r\n  -Modification done for me, so I moved the one-handed swords behind his back. In general, changed more than a hundred parameters.\r\n\r\nAchieved:\r\n\r\nBodies fall realistically and quickly, compared to the original. Some people may not like this mod, so make Back up files replaced.\r\n  Sword moved behind his back, and will not scratch the ground ...\r\n  The archive contains a Realistic hit.esp he is responsible for making a realistic pulse weapons and magic, reducing them. And Medium hit.esp which reduces the effects of weapons, but not so much. Enable only one of these. Esp. If you want the momentum of weapons, magic and bows did not change, do not activate either one, just copy the folder \\\"meshes\\\".\r\n\r\nconflicts:\r\n\r\n\r\n  -Realistic Ragdolls and Force\r\n\r\n  -Some replacers bodies that affect the skeleton.\r\n\r\n  -Armed to the Teeth.\r\n\r\n  -Weapons on Back TS Edition.\r\n\r\n  And other fashion-affecting mod files.\r\nInstallation:\r\n\r\n -Make a backup.\r\n\r\n -Extract the contents of the archive into the game folder replacing files.\r\n\r\n In addition, activated Realistic hit.esp OR Medium hit.esp, for the creation of a realistic pulse weapons are now dead would not fly away for a couple of meters, as well as by the sword and the sword and sorcery.\r\n\r\nRemoval:\r\n\r\n\r\n -Delete the path X: \\\\ The Elder Scrolls V Skyrim \\\\ Data \\\\ Meshes \\\\ actors \\\\ character\r\n Folder character «assets» and «character assets female», as well as \\\"1hm_equip.hkx\\\" and \\\"1hm_unequip.hkx\\\" from the folder \\\"animation\\\".\r\n\r\nIn the future:\r\n\r\n\r\n After some time, and completed the new version, in it I corrected some bugs, including, may add a version in which one-handed will be as the original position in a back.\r\n\r\nUpdated:\r\n\r\n -Tweaked some values ??in the corners of the pan and fold in the back and legs of the skeleton.\r\n\r\n -See the new video.\r\n\r\n -Fixed: friction, flexibility, speed, balance weights, angles, and much more. Corpses do not fold in half. Shake phone no. Skeleton tougher.\r\n\r\n -It is highly recommended to play with Medium hit.\r\n\r\n -Only one-handed sword behind his back, the animation is (again in the future I will make a version for angry).\r\n\r\n In physics, all the apes, Improved the physics for fulmer, giants, and DRAUG.\r\n\r\n I advise you to set http://skyrim.nexusmods.com/mods/17214\r\n\r\n -Bug version, the hands are too large turning radius, sometimes significantly, will be solved soon.\r\n\r\n P.S.\r\n Do not be lazy to do backup.\r\n\r\nBugs:\r\n\r\n Bug hitch arm-leg.\r\n\r\n\r\nVery sorry for my english!",
  "categoryId": "24",
  "version": "7.1.00",
  "author": "Hellmaker",
  "createdUnix": "1339855389",
  "updatedUnix": "1339855470",
  "containsAdultContent": false,
  "uploadedBy": "tes4world",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68363",
      "name": "Ragdoll mod",
      "version": "7.1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "88",
      "fileName": "Ragdoll mod-18867-7-1-00.rar",
      "uploadedUnix": "1339855470",
      "modVersion": "7.1.00",
      "virusScanUrl": "https://www.virustotal.com/file/583fc3710017c3b36cf28b4ab4c58cabef5501ca7c5eb216b76c7f517102a262/analysis/1406962983/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ragdoll%20mod-18867-7-1-00.rar?fid=68363&ttl=1535785978&ri=8192&rs=8192&setec=1349f1b78adca8a2168d24c594a242d5"
    }
  ]
}