{
  "modId": 18865.0,
  "modName": "Medieval Heraldry Retextures - For redxavier&#39;s Witcher 2 Shields",
  "summary": "Retextured shields for redxavier&#39;s Witcher 2 shield pack, for a more medieval experience.",
  "descriptionHtml": "IMPORTANT, READ THIS BEFORE INSTALLING: \r<br />These textures require you to first install and enable redxavier&#39;s Witcher 2 Shield Pack from:\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=7328]http://www.nexusmods.com/skyrim/mods/7328/?[/url]\r<br />====================\r<br />\r<br />MOD DESCRIPTION:\r<br />This retexture pack changes every heater and tower shield in redxavier&#39;s excellent Witcher 2 shield pack to look more realistic and fitting for the setting. All shield imagery is based on historical European heraldry, while trying to adhere to the various symbolisms and popular patterns that existed during the mid- to late medieval era.\r<br />\r<br />The shields (to my knowledge) feature no symbols specific of/to any real country or family (with the exception of St. George slaying the dragon, which I felt was appropriate given the game setting). Whether they are lore friendly or not will be up to the individual user to decide, but I did my best to create heraldry that might realistically fit the game world. Hopefully there is a large enough variety in colors that everyone can find a shield to their liking.\r<br />====================\r<br />\r<br />INSTALLATION:\r<br />1. Install redxaveri&#39;s Witcher 2 Shield Pack from the skyrim nexus.\r<br />2. Install manually by extracting the mod folder to your data folder in your Skyrim game installation directory or simply use NMM, overwrite all files when asked.\r<br />3. You are done, congratulations on your new shields.\r<br />\r<br />To uninstall with NMM, simply disable the mod.\r<br />====================\r<br />\r<br />ADDITIONAL INFORMATION:\r<br />I wholeheartedly recommend [url=http://skyrim.nexusmods.com/mods/5588]L0rd0fWar&#39;s Witcher 2 heavy armor pack [/url]for armor to go with these shield textures.\r<br />Enjoy, and please consider putting up some images of the shields in action if you like them&#33;\r<br />====================\r<br />\r<br />CREDITS:\r<br />Meshes and original textures belong to CD Projekt Red, the developer of the Witcher series (http://www.thewitcher.com/), who have very generously allowed the use of their game assets by modders provided they are given credit.\r<br />Thanks to redxavier for creating the Witcher 2 Shield pack (http://skyrim.nexusmods.com/mods/7328), on which this texture pack is based and without which it would not work.\r<br />Huge thanks to MarkQuinn of the m&b community for creating a modder&#39;s resource pack which inspired this mod.",
  "categoryId": "29",
  "version": "v1",
  "author": "Waffenbaum",
  "createdUnix": "1339851072",
  "updatedUnix": "1339851309",
  "containsAdultContent": false,
  "uploadedBy": "Waffenbaum",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68353",
      "name": "Witcher 2 Shield Texture Pack ",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2510",
      "fileName": "Witcher 2 Shield Texture Pack -18865-v1.rar",
      "uploadedUnix": "1339851309",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/d26bc131c6dd09e6569c2b17697f3ace2519c3535c67037ecc4fcec794c2ceec/analysis/1406962865/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Witcher%202%20Shield%20Texture%20Pack%20-18865-v1.rar?fid=68353&ttl=1535785976&ri=8192&rs=8192&setec=1b5fe7d9fab30800657f0328f8e1bfb4"
    }
  ]
}