{
  "modId": 18873.0,
  "modName": "More NPC Hirelings",
  "summary": "Adds new hirelings that will spawn when one of the unique hirelings have died.",
  "descriptionHtml": "Edit : Big woops! Didn\\'t know that I did not upload the mod. Fixed that :3\r\n\r\n==Currently, Jenassa is the only hireling that has replacements. This is because I don\\'t want to add in a whole mess of stuff when I don\\'t know that everything absolutely works 100% as it should with no bugs. I will add replacements for the rest of the vanilla hirelings when I know everything works as it should.==\r\n\r\nThis mod adds a hireling (Selects from five to choose from) that will replace the vanilla unique hirelings when they die. The new hirelings will also be replaced when they die, with no limit to this cycle.\r\n\r\nNot much to it. I tried to keep things small and compact to avoid any bugs.\r\n\r\nThough when you talk to the NPC, there\\'s a glitch with the quest that handles the recruitment of my custom hirelings that didn\\'t show the dialogue text, so I replaced what the hireling would say with a message box. It ain\\'t to bad actually. I rather like it.\r\n\r\nSource is included. Feel free to enhance and cannibalize the mod as you see fit. Just remember to give me credit when you have changed and shared it.\r\n\r\nYou can mirror this mod by linking to it from a site/forum, but you are not allowed to host it somewhere else, unless I give my explicit consent for it.\r\n\r\nDo not mirror this on the Steam Workshop. Steam needs to die :3",
  "categoryId": "66",
  "version": "0.1",
  "author": "GomuGomu64",
  "createdUnix": "1339863821",
  "updatedUnix": "1340286693",
  "containsAdultContent": false,
  "uploadedBy": "GomuGomu64",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69397",
      "name": "FirstVer",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2263",
      "fileName": "FirstVer-18873-0-1.rar",
      "uploadedUnix": "1340286693",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/42a1334e23e59cb0e3ebd1816c7da3830019fff3ad53370536235dad8a2bfb5c/analysis/1406973547/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FirstVer-18873-0-1.rar?fid=69397&ttl=1535785985&ri=8192&rs=8192&setec=e52520dd05e174a4f1ad7ec78b490292"
    }
  ]
}