{
  "modId": 18886.0,
  "modName": "Ionic Blue ENB Config",
  "summary": "A very pretty blue looking ENB Config. I\\'ve made it for myself, but put it up for the community incase anyone wanted to put it to use it. I\\'ve included 5 carefully taken screenshots to show you what it\\'s capable of and how nice the tones can be.",
  "descriptionHtml": "[IMG]http://i872.photobucket.com/albums/ab281/shivanthing/124002204-4.jpg[/IMG]\r\n\r\nI\\'m going to take some screenshots using some blue tones so I created this ENB for that. And also for a friend. I released it to the community hoping other people may like it. It\\'s a very odd ENB so a lot of people will not enjoy it really, but if used correctly it can produce some really pretty scenes. I\\'ve included 5 sample screenshots above to give a general idea of what you can do with it. In my opinion it\\'s nothing special, and evening out a blue tone for the entire world is difficult so I really don\\'t think this would ever turn out perfect.\r\n\r\n[b]---WHAT THIS IS---[/b]\r\nA blue looking ENB config, what more can I say, that\\'s all it is.\r\n\r\n[b]---WHAT THIS IS NOT---[/b]\r\nThis is not a realistic config, and I repeat THIS IS NOT A REALISTIC CONFIG, as i\\'ve had some people coming out with contradicting remarks that totally modify their opinions on how an ENB should be treated.\r\n\r\n[b]---FEATURES---[/b]\r\n***An ENB With a blue tone, perfect for dungeons, night-time scenes- and hell, even daytime scenes.***\r\n\r\n***Lots of sunrays, as I like them, if you dont\\' just modify the config file. :)***\r\n\r\n***Blue... it\\'s blue all the time, no exceptions. maybe not as blue during morning and evening, but it\\'s blue.***\r\n\r\n[b]---INSTALLATION---[/b]\r\nJust drop the contents into your root skyrim directory, easy as pie! If you can\\'t open RAR files, go here and get winrar. \r\n\r\nhttp://www.rarlab.com/download.htm\r\n\r\n[b]---UNINSTALLATION---[/b]\r\nDelete everything that came with the mod.\r\n\r\n[b]---HOW TO USE---[/b]\r\nFirst off, make backups of your other ENBconfig if you had one as it might be your OWN enb config, and you may very well lose it forever if you overwrite it and had no backup.\r\n\r\nDrop the contents of the download into your folder, overwrite as needed, afterwards go to boris vorontsov\\'s site and get his binary .exe. (ENBinjector) It can be found here. \r\n\r\nhttp://enbdev.com/download_injector_generic.htm \r\n\r\nAfterwards, drop ENBinjector.exe into your skyrim root directory. Before launching skyrim, execute ENBinjector.exe then launch skyrim. And you\\'re good to go.\r\n\r\nHope you enjoy it! I won\\'t be working on this as I have other better ideas for ENB\\'s. But if you make some pretty screenshots with it (or even play with it and enjoy it) and you think it\\'s good, come back to endorse! Don\\'t leave a modder without a thanks for something you enjoy. :P\r\n\r\nCheck out my other config too! It\\'s a lot better than this one (in my opinion) but both have a certain appeal of their own.\r\n\r\nhttp://skyrim.nexusmods.com/mods/18743\r\n\r\n",
  "categoryId": "62",
  "version": "1.0",
  "author": "Shivanthing",
  "createdUnix": "1339876706",
  "updatedUnix": "1339876762",
  "containsAdultContent": false,
  "uploadedBy": "shivanthing",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68430",
      "name": "Ionic Blue Version 1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "648",
      "fileName": "Ionic Blue Version 1-18886-1-0.rar",
      "uploadedUnix": "1339876762",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9bfcc60d0b313373acb19ea4ec9e5e8523ac5c7617f83766648084378f91a14c/analysis/1406963544/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ionic%20Blue%20Version%201-18886-1-0.rar?fid=68430&ttl=1535786000&ri=8192&rs=8192&setec=58b269dd3e2ebb3cdd951418ac9d95d4"
    }
  ]
}