{
  "modId": 18888.0,
  "modName": "The Turtleship Museum Shop",
  "summary": "The mighty Corean Turtleship, weapons and armor sets.",
  "descriptionHtml": "[img]http://img836.imageshack.us/img836/4682/coollogocom2799270.jpg[/img]\r\n\r\nThank you so much for your interest in the mod. Hope you enjoy it!\r\n\r\n[img]http://img88.imageshack.us/img88/5875/41942986.png[/img] [img]http://img196.imageshack.us/img196/7826/capture11ssscopy.jpg[/img]\r\nThe mod is created based on the history of Admiral Yi SoonShin of Corea Joseon Dynasty. The mod contains the turtleship model, both interiors and exteriors, and Corea\\'s traditional pictures, classic melee weapons and armor sets, some new npc\\'s. It\\'s located near(under the Solitude\\'s cliff) Solitude\\'s dock. \r\n\r\n[img]http://img526.imageshack.us/img526/6562/82098099.png[/img] [img]http://img717.imageshack.us/img717/2593/capture19ssscopy.jpg[/img]\r\nUnzip the zipfile and copy and paste meshes and texture folders as well as the esp file to your Skyrim data directory.\r\n\r\n---If you have any advices or suggestions to improve the mod, or if you want to edit,add anything to the mod, please let me know. I always feel positive about making improvements!\r\n\r\n\r\n\r\nBelow, the brief history of Imjin war and Admiral Yi is explained.\r\n\r\n[img]http://img703.imageshack.us/img703/8710/19458280.png[/img] [img]http://img837.imageshack.us/img837/3343/capture18ssscopy.jpg[/img]\r\n(by http://english.yi-sunsin.com/04yisunsin/05_01.jsp)-\r\n\r\nYi Sun-sin was a great leader of Joseon who saved his country on the peril of break down during the Imjin War. In 1592, while the country was in dire crisis with the invasion of Japan, Yi Sun-sin made over 20 times of battles with the Japanese forces and he won all the battles to protect the country and people. He created the first armored vessel, the turtle ship, in the world, and had a great victory in the Battle of Hansando with the battle of guns by using the strategy of the Hakik-jin. In particular, Myeongryang Battle where Yi Sun-sin had 13 ships to defeat the Japanese naval force of some 130 ships and it is referred to as the miracle of the world naval battle history. In the final Noryang Battle, he left the famous patriotic words that “the fight is still on that do not tell them that I died.” Yi Sun-sin has been one of the most respected person for Koreans after all these 400 years of time. \r\n\r\nYi Sun-sin recorded the unprecedented victories that could not been found anywhere in the world history. Genghis Khan was defeated in two wars in 20 times of war that he was involved in, Napoleon lost four wars out of 23 wars, the Great Emperor Frederick was defeated in three wars from 12 wars, and Hanibal lost one war in five wars. However, Yi Sun-sin fought 23 times and victorious in all 23 times. He had 23 small and large battles in seven years with the absolute disadvantageous number of soldiers and number of ships, Yi Sun-sin led all the battles victory without single defeat. With his prominent strategies and tactics, he achieved the world best triumphs by sinking about 700 battleships and capturing 23 battleships during the entire period of war.\r\n\r\n[img]http://img688.imageshack.us/img688/5951/18372139.png[/img] [img]http://img69.imageshack.us/img69/7761/capture9ssscopy.jpg[/img]\r\n1) the battle of Myeongryang (13 Korean warships vs 300 Japanese warships, which is 1500 Korean soldiers vs 120,000 Japanese samurai)\r\n\r\n2) the battle of Busanpo (74 Korean warships and 92 small vessels vs 470 Japanese warships) the result is only 6 Korean soldier dead and 130 Japanese warships destroyed) \r\nby http://yisunsin.prkorea.com/battles.htm\r\n\r\n[img]http://img716.imageshack.us/img716/7254/31589499.png[/img] [img]http://img843.imageshack.us/img843/3522/capture3ssscopy.jpg[/img]\r\n\r\nThe turtle ship is a new battle ship made through the innovation than invention with the conventional battle ship of the panokseon with the steel plate on the cover and attached with the dragon head. \r\nFor the excellent characteristics of the a1 as a battle ship, it would protect the combat soldiers inside and it had the powerful guns as well as the defensive strength. The turtle ship jumped into the middle of the battles in the fleet and used the canons to scattered the arrangement of the Japanese battle ship, and for this purpose, the turtle ship was manufactured with sturdy materials, and in order to protect the crews from the penetration of the enemy, the plate was set with the sharp drills. Also, there were a total of 14 guns on the sides and the front and back to attack under the situation where the a1 was surrounded by the enemy ships.\r\n In particular, reading the ?Nanjung Ilgi?, the mouth of the turtle head had the canon that it was possible to attach with the canon from the front side. And, the plate cover was made with the plate sheet that it had outstanding defense and the turtle ship could make any movement it wanted and used its guns to destroy and used its head to break down the enemy ships even at the close encounters. In this aspect, it was perhaps like a tank on the sea.\r\n\r\nThere are on-going disputes in many aspects, but it is clear that the turtle ship was the frontline ship along with the panokseons for the Joseon naval force during the Imjin War, and it had the critical role in destroying the Japanese invaders from Sacheon Battle to the Battle of Hansando, Busan Battle and others battles. In particular, these turtle ships had the cheonja chongtong, jija chongtong and other large guns to exercise powerful capability to attack with the fire arms as the basis for unyielding victories.\r\n\r\n[img]http://img846.imageshack.us/img846/4770/98222931.png[/img] the followings are the assessment of world historians on Yi Soonshin.\r\n\r\n\r\n\r\n\\\"Yi Sun-sin is not well-known to the western historians. Yi Sun-sin understood the strategic situation well and had the remarkable skills of the naval strategies to have the upgraded control principle under the unyielding aggressive attacking principle in the war. His fearless attacks absolutely were calculated attacks. For people of England, it might be hard to recognize that there would be a person whose accomplishment is comparative to Nelson. However, if there was anyone fit to such a honor, it must be this Naval Commander who died in the enemy zone without a defeat in his career. Each time he came out for any battle, the coastal areas of the Korean Peninsula had the fragmentations of hundreds of the Japanese battle ships piling up under the sea. And, it is not exaggeration to make a single mistake from the beginning to the end. Under the diverse situation, he handled all matters completely and perfectly without any flaw. In summary of his accomplishments, he fought the battles when he had to fight with the victory at all battles and devoted his supreme life in protecting his country even thought there was no teaching for him to be guarded on under the history of the past.\\\"\r\n <Naval Commodore of England, George Alexander Ballard>\r\n*****************************************************************************************************************\r\n\\\"This was the story of congratulatory banquet held for Admiral Togo Heihachi who destroyed the Baltic Fleet of Russia that was the best in the world at the time in the East Sea Battle during the Russia-Japan War (1904-1905). Some people praised Admiral Togo for his victory. \\\"This great victory will be in the history. You are the God in war comparable to Admiral Nelson who defeated Napoleon at the Trafalgar Battle.\\\" And, Admiral Togo replied that \\\"thank you for your high praise, but Nelson was not that great man. If there was any admiral truly fit for the name of military god would be Yi Sun-sin. Compared to Yi Sun-sin, I would be happy to be his naval officer.\\\"\\\"\r\n<Japanese historian, Ando Ohikortaro and others, ?History and Theories of Three Countries of Japan, Korea and China?, Japan Joseon Research Institute, 1964>\r\n*****************************************************************************************************************\r\n\\\"It is possible to compare me to Nelson, but it is unbearable for me to compare with Yi Sun-sin.\\\"\r\n<Response speech at the victory banquet of the war - Japanese Naval Admiral, Togo Heihachiro> \r\n*****************************************************************************************************************\r\nIt was true that Togo had the great accomplishment, but his accomplishment could not even to catch up a toe of Admiral Yi Sun-sin. If Yi Sun-sin had the rich weaponry and ships as well as nationwide support, like Nelson, Japan would have been destroyed in over night. It may be a great imprudence, but Koreans think Admiral Yi Sun-sin as a great warrior but they do not know how great of a person that he truly was as much as Japanese do.\r\n<Japanese naval strategy specialist, Gawada Go>\r\n*****************************************************************************************************************\r\n\r\n\r\nI want to say thank you again for reading upto this point and now, it\\'s time to enjoy the mod!\r\n\r\n\r\n[img]http://img713.imageshack.us/img713/7352/capture17ssscopy.jpg[/img]   [img]http://img39.imageshack.us/img39/725/1copyiy.jpg[/img]\r\n\r\n\r\n\r\n----For more information, visit -----\r\nhttp://english.yi-sunsin.com/03ship/02_01.jsp - my favorite so far\r\nhttp://www.e-sunshin.com/eng/ach/ach_02.htm\r\nhttp://www.gbsun.com/index_132.htm\r\nhttp://yisunsin.prkorea.com/battles.htm\r\nhttp://en.wikipedia.org/wiki/Battle_of_Myeongnyang\r\nhttp://en.wikipedia.org/wiki/Yi_Sun-sin\r\n\r\n\r\n-----Credits:------\r\nThank you so much Book Au(??) and Saber(???) for allowing me to include your mods in this mod.\r\nAnd others who gave me advices & ideas to improve this mod.\r\n\r\nDetails are as follows.\r\n\r\nBook Au = Corean Classic Weapons(Mondunyi,Gichang,Mando), Sain sword, and making new pictures & frames just for this mod.\r\n\r\nSaber = Coreanweapon.esp(Bamboo sword, LeeSam, Silver dagger, Yi SoonShin blades,Sama Yoong)\r\n, Moo Hyool armor set, ChaeYoon armor set, and Ma-Pae the horse tablet.",
  "categoryId": "36",
  "version": "1",
  "author": "Anonymous",
  "createdUnix": "1339877684",
  "updatedUnix": "1345415671",
  "containsAdultContent": false,
  "uploadedBy": "rewind2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68604",
      "name": "The Turtleship Museum Shop",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "139381",
      "fileName": "The Turtleship Museum Shop-18888-1.zip",
      "uploadedUnix": "1339943833",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/f9e4aba50139d60b84c62531e4b2131e3bcc5b1c5ba150972530108087405893/analysis/1406965560/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Turtleship%20Museum%20Shop-18888-1.zip?fid=68604&ttl=1535786003&ri=8192&rs=8192&setec=5dc0a9c748e7aab077ddf5f19e0474f8"
    },
    {
      "fileId": "82856",
      "name": "The TurtleShip Museum Shop UPDATED",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "139705",
      "fileName": "The TurtleShip Museum Shop UPDATED-18888-1-1.zip",
      "uploadedUnix": "1345415671",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/a899822eecd02dbdfc361f357e11cda55c805192f4afff69edc3668ae88ed58e/analysis/1407108820/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20TurtleShip%20Museum%20Shop%20UPDATED-18888-1-1.zip?fid=82856&ttl=1535786004&ri=8192&rs=8192&setec=d00addf813c0b1d098a77e875eae0a5d"
    }
  ]
}