{
  "modId": 18908.0,
  "modName": "Mephista -Impish Companion- Adult",
  "summary": "This mod adds a small female companion to your game that is designed to appear as a classic nude devilish Imp/dark fairy type creature that has wings and horns. She is located in Dead Man\\'s Drink in Falkreath and is compatible with ADEC, UNPB and CBBE with BBP. She has been updated to 2.0 now and uses ApachiiSkyHair!",
  "descriptionHtml": "[center][img]http://skyrim.nexusmods.com/mods/images/12989-1-1339914595.jpg[/img]\r\n[img]http://static.skyrim.nexusmods.com/mods/images/12989-2-1339900220.jpg[/img]\r\n[img]http://static.skyrim.nexusmods.com/mods/images/12989-3-1339900221.jpg[/img][/center]\r\n\r\n[font= timesnewroman][b][size= 4][color= red]Update 2.0 - She now is available with Apachii hair! Three versions added two essential and one non-essential...[/b][/size][/color][/font] \r\n\r\n[font= timesnewroman][b][size= 5][color= Black]Mephista is a demonic Imp that I created for my Necromancer Player Character. She is a VERY strong level 40 and if you are just starting your game I suggest the Auto-level version or you may experience unbalanced play even at Master settings in your game.  She needs her wings and horns to look like my version of Mephista. I used the Alduin Wings mod as it is the best and really only decent option for a demon type wing. I also used the horns from the Astaroth Suit. (There are 4 versions of his horns, use whatever floats your boat!) How to add them: I know some of you hate using console but to get her where she will look like you are going to have to do it. I constructed her to play nude, do not worry she can handle a lot of damage before she even uses her Ironflesh spell, and especially if you chose the Calculated Level 40 version.[/b][/size][/color][/font]\r\n\r\n[font= timesnewroman][b][size= 4][color= crimson]\r\nRace: Imperial\r\nVoice: Female Condescending (Shes\\'s a demonic creature...) \r\nHair: Black\r\nEyes: Blind normally or Whatever eye texture file you wish to choose... See tutorial below. \r\nWeight: 70 at the scale. If you use ADEC, UNPB or CBBE bodies with BBP she should be fine.\r\nHeight: 30 to 36 inches tall\r\nLocation: Dead Mans Drink in Falkreath\r\nSpeed: Her speed has been doubled to enable faster follower travel and unearthly style Mage combat!\r\nFlight: Nope she cant fly, I am just waiting and hoping for a real flight mod after the release of the Dawnguard DLC. I will update this file accordingly. \r\n\r\nRequired Files: \r\nApachiiSkyHairFemale_v_1_0 for Version 2.0 \r\nNote: Since she is created using the NPC Editor I painstakingly removed each and every extra Apachii hair file from her. There should be no extra hairs in the \\\"showracemenu\\\" with this mod in use.[/b]\r\n\r\nHair packs of TES IV Oblivion - I have not snipped the Oblivion Version\r\n\r\n::::Obliivion Hair Pack Fix::::\r\nFix for those having issues with Oblivion Hairs: \r\n\r\nWhen using \\\"Hair packs of TES IV Oblivion\\\" you need the older files: Hair Pack 1 dot 1 and Hair Pack ESM file 1 dot 1 (do not use the others) I found this is the only working version as far as being able to make them work with my PC and NPC\\'s. Load order is very important. You must have the Oblivion hairs installed first and then install ApachiiSkyhair. If you do not have them in the right order you will get a hairline clash on the first 7 to 9 Oblivion hairs. I would recommend that you save both files to your PC/Downloads because who knows if the author will come back and wipe out his mod files one day. Also do not mess with PART TWO of his hair packs!!! Please just use the two files mentioned above! \r\n\r\nInstallation: Install the TESIV Hairpack through NMM and download the ESM into your Downloads file and unzip it. (The reason for this is that when you have finished the manual portion of this install the NMM will work for removal.) Then download the file manually place the ESM file into your Skyrim Data folder. I truly believe that you still need the ESM even if you aren\\'t modding characters. (At least with his mod). I would also make sure that the esp is in your plugin list. \r\nYou need to go back and install the Hair Pack portion of his mod manually. The reason for this is that the author did not path these files to textures and meshes he only zipped all the folders together (He should have removed the NMM option and just stated that these needed to be installed manually). If you create characters you still need to have Oblivion Hairs file folder in the meshes main folder. (When you click on meshes in the Data Folder you should see a folder that says Oblivion Hairs.)\r\n\r\nJust make sure you copy and paste each folder so that it rests next to the Apachii Hair file in both your Skyrim Data Meshes and Textures folders. Try your game now! I haven\\'t had any issues since I figured this out. \r\n1. C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\meshes\\\\actors\\\\character\\\\character assets\\\\hair\r\n2. C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\textures\\\\actors\\\\character\\\\hair\r\n\r\nHorns: R18Pn 05 - Astaroth Suit for UNP and CBBE V3 http://skyrim.nexusmods.com/mods/14221\r\nWings: Alduins Wings by Guffeh http://skyrim.nexusmods.com/mods/15692\r\nUse console command \\\"Help Wings\\\" to get the item number. The same for her horns\r\n\\\"Help Astaroth\\\" and then add the horns you want. To permanently equip these items type in console \\\"equipitem\\\" and then the item number and 1 (equipitem xxxxxxx 1) and they will be on her permanently so when you release her and go find her again you don\\'t have to wait for her to reequip them.\r\n\r\nIf you don\\'t replace the eyes and add the wings and horns you will just have a tiny bright red and blind firemage/conjurer...\r\n\r\nMaking her stay at your current location: \r\n\r\nIt is possible to make her stay where you leave her. Since I don\\'t use the CK it is a little more involved but I have incorporated this option into her AI. You have to find her and make her your companion, then travel away from Dead Man\\'s Drink to a place like Breezehome, a cave etc. Save your game now. Reload her in the NMM or better yet re-install her manually from the zipped file, I recommend the latter. Just copy and paste her esp and bsa files to your Skyrim Data folder and overwrite when prompted. She should now stay where you leave her. \r\n\r\nHer Base ID is (2c040000) should you need it.[/b][/size][/color][/font]\r\n\r\n\r\n[b][size= 3][color= dodgerblue]How to give her the eyes you want. \r\n:::Eye Change Instructions:::\r\n\r\n1) Download which ever eye texture file you like the most (I used Pretty Eyes Darkelf Red in my screenies). Do NOT use the NMM, do a manual download and open the file normally with whatever zip file opener you use. (I used the blind eyes slot as I hardly ever run into a character with them.)\r\n2) Once you have your eye texture folder open simply rename that file (eyeblind.dds) and right click to copy.\r\n3) ***Important*** Save your original \\\"eyeblind.dds\\\" file in a new folder some place. (I have a folder in My Documents for default Skyrim files).\r\n4) Use this string to get to the correct folder\r\nC:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\textures\\\\actors\\\\character\\\\eyes\r\n5) Once you are in the eye texture folder just paste the new file into the folder and overwrite when it asks you and then close your folder.\r\nYou should now have Mephista sporting whatever eye texture mod that you chose! :)[/color][/size][/b] \r\n\r\n[b][size= 2][color= ghostwhite]\r\nOptional Files: To make her look like she does in my images\r\nEyes: Pretty Eyes by pikkatze http://skyrim.nexusmods.com/mods/3424  \r\nI used Bella\\'s Better Females, Makeup variant 1 and No Shine (some pics) on her in combination with pretty lips by Danariel\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2812\r\nDarker Feminine Brows by Caliente (CBBE) \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2666\r\nPretty Lips by Danariel\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=1167\r\nRunic Pentagram Necklace by avenger86\r\nhttp://skyrim.nexusmods.com/mods/7060\r\nKaw Claws-Colored Long Nails by kaw - The black fingernails she is equipped with\r\nhttp://skyrim.nexusmods.com/mods/5910\r\nHer body in my images is CBBEv3 with Navetseas body \\\"Feminine Arms and Toned Abs\\\" textures. (She can be used with whatever body you prefer) (GlossTech V5 \\\"No Shine\\\" used in some pics)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6554\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2666\r\n[/b][/size][/color]\r\n\r\n[b]Thanks for checking out my mod and please endorse her if you like her! :) \r\n\r\nRegards,\r\n\r\nFB[/b]",
  "categoryId": "66",
  "version": "2.0",
  "author": "FalmerBane",
  "createdUnix": "1339900673",
  "updatedUnix": "1345957222",
  "containsAdultContent": true,
  "uploadedBy": "FalmerBane",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68525",
      "name": "Mephista Auto-Level Imp Character",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "587",
      "fileName": "Mephista Auto-Level Imp Character-18908-1-0.7z",
      "uploadedUnix": "1339913671",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/490dd0264cee67574f0b7551093d039ba5042c6f1cd63a83345631345f5a020c/analysis/1406964312/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mephista%20Auto-Level%20Imp%20Character-18908-1-0.7z?fid=68525&ttl=1535786045&ri=8192&rs=8192&setec=59a20f5f5666e092cdd2f335b6075d96"
    },
    {
      "fileId": "68526",
      "name": "Mephista Calculated Level 40 Imp Character",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "587",
      "fileName": "Mephista Calculated Level 40 Imp Character-18908-1-0.7z",
      "uploadedUnix": "1339913727",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2f0689d2e7d0269080e9d2b3c57ca05d77516ff1729e88112672d9848bcc1c17/analysis/1406964362/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mephista%20Calculated%20Level%2040%20Imp%20Character-18908-1-0.7z?fid=68526&ttl=1535786045&ri=8192&rs=8192&setec=8658b11b3cbd0b1a933e8dff98ab9e40"
    },
    {
      "fileId": "84280",
      "name": "Mephista Auto-Level Essential uses Apachii Hair  ",
      "version": "2.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "947",
      "fileName": "Mephista Auto-Level Essential Apachii Hair  -18908-2-0.7z",
      "uploadedUnix": "1345957017",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/5dafa58f8063ff6e582c7a6c98acfc4685d21edacb9ac2bb8b74c13d39fee514/analysis/1407122284/",
      "changelogHtml": " Versions using Apachii Hair added!!  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mephista%20Auto-Level%20Essential%20Apachii%20Hair%20%20-18908-2-0.7z?fid=84280&ttl=1535786046&ri=8192&rs=8192&setec=c53c8c1c77c5d330545fb5d040a00db5"
    },
    {
      "fileId": "84282",
      "name": "Mephista Auto-Level Non-Essential Apachii Hair  ",
      "version": "2.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "947",
      "fileName": "Mephista Auto-Level Non-Essential Apachii Hair  -18908-2-0.7z",
      "uploadedUnix": "1345957094",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/9b0c1e2a28632f6b17a83609a1fdd79c2c0742750147d8813427c488666795af/analysis/1407122286/",
      "changelogHtml": " Versions using Apachii Hair added!!  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mephista%20Auto-Level%20Non-Essential%20Apachii%20Hair%20%20-18908-2-0.7z?fid=84282&ttl=1535786046&ri=8192&rs=8192&setec=9143dc1692d432526a9ae0d8a3b13bda"
    },
    {
      "fileId": "84283",
      "name": "Mephista Calculated Level 45 Essential Apachii Hair  ",
      "version": "2.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "947",
      "fileName": "Mephista Calculated Level 45 Essential Apachii Hair  -18908-2-0.7z",
      "uploadedUnix": "1345957222",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/44960fd47e9ed6b815581203932fcf5ec7fcfbcd3c44d65d7884bdd04e6b3c7c/analysis/1407122344/",
      "changelogHtml": " Versions using Apachii Hair added!!  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mephista%20Calculated%20Level%2045%20Essential%20Apachii%20Hair%20%20-18908-2-0.7z?fid=84283&ttl=1535786047&ri=8192&rs=8192&setec=366e3c38f8208964988d0c8afb029d26"
    }
  ]
}