{
  "modId": 18911.0,
  "modName": "Thats Racist",
  "summary": "Makes very tiny changes in order to balance the races without going too far.",
  "descriptionHtml": "[font=verdana][center][img]http://img.photobucket.com/albums/v464/sushisquid/racist.gif[/img][/center]\r\n\r\nIn the base game, races are really unbalanced with each other. Many mods have attempted to fix this, but most go way too far. I decided to make something tiny. This way, it\\'s compatible with as much as possible, doesn\\'t change things dramatically, and can be installed and uninstalled on existing saves with no issue.\r\n\r\nWant something simple and safe that still balances the races better? Try out That\\'s Racist!\r\n\r\nAlso available on the [url=http://steamcommunity.com/sharedfiles/filedetails/?id=77224622]Steam Workshop[/url].\r\n[url=http://skyrim.nexusmods.com/mods/19131]Alternative casting method now available from Estioarem[/url].\r\n[url=http://skyrim.nexusmods.com/mods/19272]Additional screen effects available from Niux.[/url]\r\n\r\n\r\n[size=3][b]Altmer:[/b][/size] In addition to rapid magicka regeneration, Highborn now also applies a +25% boost to the power of all spells you cast while it is active.\r\n[list][size=1][*]Altmer were very good and didn\\'t need much improvement. Highborn in particular was always a useful power, but because it was essentially free magicka potions once a day, it was a little boring. My solution was to add extra effects that are also identical to drinking potions. This will stack though, so Altmer are now capable of stronger magic than any other race.[/size][/list]\r\n\r\n\r\n[size=3][b]Argonian:[/b][/size] In addition to rapid health regeneration, Histskin now also makes you share half the melee damage you take with attackers.\r\n[list][size=1][*]Histskin was free potions too, so it was also boring. Now it doesn\\'t just let you take damage, it encourages you to because enemies will be harming themselves. Argonians are much fiercer in melee combat with this active. [b]Note:[/b] Reflect Damage effects do not reduce damage taken as they did in Oblivion. You\\'ll still take full damage while Histskin is active.[/size][/list]\r\n\r\n\r\n[size=3][b]Bosmer:[/b][/size] Command Animal was turned into a cloak spell with 30-foot range. While active, it constantly forces animals to be peaceful, even if attacked. When it ends, any animals it affected remain non-hostile.\r\n[list][size=1][*]While in range, animals are constantly calmed. When this wears off or they leave the range, they\\'ll still be non-hostile as long as you don\\'t repeatedly attack them. Clever use of Command Animal will let you freely walk outdoors without concern, and you can convert whole forests into safety zones. This can also be used for rather cheap hunting. Because it uses the same method, if you use the Animal Allegiance shout, it will cancel this permanent non-hostility when it ends.[/size][/list]\r\n\r\n\r\n[size=3][b]Breton:[/b][/size] Unchanged.\r\n[list][size=1][*]The goal was to balance everything with Bretons. Rather than weaken them, I\\'ve improved the other races to match.[/size][/list]\r\n\r\n\r\n[size=3][b]Dunmer:[/b][/size] Ancestor\\'s Wrath now drains all of the damage it causes into healing for the user. Its damage has been improved to 12 per second and its range to 20 feet.\r\n[list][size=1][*]Although their passive is great, the Dunmer\\'s power was just a free Flame Cloak. It\\'s now more powerful and drains the damage it causes, making it useful even at higher levels. Step into a crowd and the health absorbed can get pretty high, so dunmer are a little safer when caught in melee range now.[/size][/list]\r\n\r\n\r\n[size=3][b]Imperial:[/b][/size] Voice of the Emperor now forces all NPCs in the area to be your allies for 3 minutes and leaves them non-hostile after the effect ends. Imperials start with 50 extra stamina.\r\n[list][size=1][*]Imperials are supposed to make excellent assassins, commanders, and diplomats. This new power reflects that a little better. Things touched by Voice of the Emperor remain permanently non-hostile until you attack them, and for three minutes will even come to your defense. This allows for a pacifist playstyle no other race can truly match, but can certainly be used to kill more safely too. To show that Imperials are meant to be master tacticians, they have increased stamina.[/size][/list]\r\n\r\n\r\n[size=3][b]Khajiit:[/b][/size] While sneaking, you can detect targets by sound and smell out to 100 feet. This is listed along with Claws under their new Predator ability.\r\n[list][size=1][*]Claws and night eye were always niche abilities that weren\\'t really that good, but were cool. In keeping with this, I\\'ve expanded Claws into Predator, which now also gives free detection while sneaking. This detection works on anything that isn\\'t flagged as undetectable, not just living targets. Sneaky players will really appreciate how useful this can be, but most importantly, it\\'s really cool. I also suggest getting a Night Eye mod to make that less annoying to use. I specifically didn\\'t touch that so this would be compatible.[/size][/list]\r\n\r\n\r\n[size=3][b]Nord:[/b][/size] In addition to causing fear on living targets for 30 seconds, Battle Cry now also turns undead for 30 seconds and paralyzes daedra and dwarven automatons for 10 seconds. Non-hostile targets are instead rallied (won\\'t flee from combat) for 30 seconds. The stagger effect was removed.\r\n[list][size=1][*]Nord is a very good race, so it didn\\'t need much help. A small boost to Battle Cry so it works on more things and no longer scares allies seemed good enough.[/size][/list]\r\n\r\n\r\n[size=3][b]Orc:[/b][/size] Berserker Rage\\'s duration was increased to 100 seconds and it now also halves damage taken from magic.\r\n[list][size=1][*]Berserker Rage is an amazing power against combat foes the same way that Dragonskin is an amazing power against magic foes, and yet Bretons also got the best passive in the game on top of having it. I\\'ve improved this by having it last longer and now actually reduce magical damage taken. Orcs still have no passive, but they have unquestionably the best power.[/size][/list]\r\n\r\n\r\n[size=3][b]Redguard:[/b][/size] Adrenaline Rush slows time while active. Poison Resistance renamed to \\\"Hardy\\\" and now adds +50% health regeneration.\r\n[list][size=1][*]Adrenaline Rush was about equal to simply drinking soup, so it needed something better. Now it also slows time by 75%. The active effects page will report a 36 second duration, but due to the time dilation it does last 60 seconds. Redguards are supposed to be hardy warriors that mostly ignore magic, so added health regeneration makes sense.[/size][/list]\r\n\r\n\r\nThis is very compatible with many other mods and safe to use or remove with existing saves.[/font]",
  "categoryId": "34",
  "version": "1.03.1",
  "author": "Kevin Kidder",
  "createdUnix": "1339906890",
  "updatedUnix": "1370496326",
  "containsAdultContent": false,
  "uploadedBy": "sushisquid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68527",
      "name": "ThatsRacist102",
      "version": "1.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "ThatsRacist102-18911-1-02.zip",
      "uploadedUnix": "1339914061",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/f1bfb996bf64b471953a5150a7e8aa9ef7db50ec8ed31713de452e747935a956/analysis/1406964363/",
      "changelogHtml": " Highborn, Ancestor&#39;s Wrath, and Adrenaline Rush no longer list a spell cost. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ThatsRacist102-18911-1-02.zip?fid=68527&ttl=1535786050&ri=8192&rs=8192&setec=03f9446c925c54fe10a70c4c7934955a"
    },
    {
      "fileId": "1000033007",
      "name": "ThatsRacist1031",
      "version": "1.03.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "ThatsRacist1031-18911-1-03-1.zip",
      "uploadedUnix": "1370496326",
      "modVersion": "1.03.1",
      "virusScanUrl": "https://www.virustotal.com/file/da5d14aec7303e43444606fb795669719dc8175b5dcec7ca12574978347e1a57/analysis/1407593891/",
      "changelogHtml": " Corrected Battle Cry being considered an assault. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ThatsRacist1031-18911-1-03-1.zip?fid=1000033007&ttl=1535786050&ri=8192&rs=8192&setec=92f4b51b5b834a667533a83c3204d918"
    }
  ]
}