{
  "modId": 18946.0,
  "modName": "End-Levelling",
  "summary": "Makes it so that your miscallenous skills improve on their own while you battle or sneak starting from level 50.",
  "descriptionHtml": "This mod makes your miscallenous skills improve on their own while you battle or sneak beyond level 50 with at least one skill at level 100 with a perk purchased.\r\n\r\nSkyrim\\'s classless design may be welcoming to the newcomer, but it has a serious flaw of forcing late-game characters to grind skills they never use if they wish to reach their maximum potential. This mod is geared to fix that by letting you gain levels all the way up to level 81 using whatever combat style you prefer. Starting from level 50, skills that don\\'t have any perks acquired and are below level 100 start slowly gaining skill XP on their own as you battle or sneak close to a hostile NPC, provided that you have at least one skill maxed at level 100 with perks invested in it. The more such skills, the more skill XP the mod gives.\r\n\r\n[u][b]The specifics:[/b][/u]\r\n[list]\r\n[*] The requirement for this effect to start are that your character is at least level 50 and you have at least one skill at level 100 with the starting perk acquired (f.e. Armsman 1 for One-Handed).\r\n[*] Every 10 seconds that you are in combat (there are red dots on your compass) or sneak close to a hostile NPC, one of your misc. skills gets an amount of skill XP.\r\n[*] The skill chosen to receive the XP is always the one with the lowest skill level among those that don\\'t have any perks acquired. If there are no such skills or they are all at level 100, nothing happens.\r\n[*] The amount of XP that the chosen skill receives is the greater the more maxed skills (level 100 + perk) you have.\r\n[*] Sneaking gains 50% more skill XP than combat.\r\n[/list]\r\n\r\nAnd yes, I know this barely makes any realistic sense. But neither does gaining perks for Illusion by grinding Heavy Armor. This mod wasn\\'t made for the sake of realism, but for fun.",
  "categoryId": "24",
  "version": "1.0",
  "author": "Eps01",
  "createdUnix": "1339950841",
  "updatedUnix": "1493113484",
  "containsAdultContent": false,
  "uploadedBy": "Eps01",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68630",
      "name": "End-Levelling 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "End-Levelling 1_0-18946-1-0.zip",
      "uploadedUnix": "1339950906",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/07f1af95260fbd9e062c768b3cba8c57a3b20dbc56248473f0973735860f46c6/analysis/1406965444/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/End-Levelling%201_0-18946-1-0.zip?fid=68630&ttl=1535786108&ri=8192&rs=8192&setec=bf52dc35e60487393693e84f75b1ec05"
    },
    {
      "fileId": "1000242714",
      "name": "End Levelling SE",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4",
      "fileName": "End Levelling SE-18946-.zip",
      "uploadedUnix": "1493113484",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/b12851c6ee012cae28b0988afeea5109f29b11a07b36ad4e789c3c3dd41bfe0a/analysis/1493113802/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/End%20Levelling%20SE-18946-.zip?fid=1000242714&ttl=1535786109&ri=8192&rs=8192&setec=db506366aca3427b52b01d3c02e333a5"
    }
  ]
}