{
  "modId": 18969.0,
  "modName": "Temptress Race UNPB-BBP Coverwomen Fitness Body",
  "summary": "Makes Temptress Race compatible with UNPB-BBP, Coverwomen & Fitness Body.",
  "descriptionHtml": "I wanted the great mod Temptress Race by Psychos1s & Brokefoot to have the UNP-BBP Blessed Body by calyps, together with Coverwomen by mrLenski (pretty sure this is already included in their mod) and the Fitness Body by SvarogNL.\r\n\r\nThis mod basically consists of these files:\r\n-UNP-BBP Blessed Body with jiggling physics for normal UNP Body. (Skeleton included)\r\n-Coverwomen (Compatible with UNP, negates neckseam. There is a hint of a seam in certain lighting, but nothing noticeable unless you go really REALLY up close.) I\\'m pretty sure the original mod is already compiled with Coverwomen, so it won\\'t mess up the presets of the fine characters they\\'ve put together, I haven\\'t noticed any differences.\r\n-Fitness Body (Reduced abs for normal body)\r\n\r\nThis mod combines all that into an easy NMM downloadable install.\r\n\r\nThe original mod Temptress Race is required first and foremost.\r\nNext, you can download this mod and click \\\"yes to all\\\" when it asks to overwrite.\r\n\r\n*I also recommend Victoria\\'s High Heel Walk by xp32, if you decide to use that, make sure to follow the installation instructions on the Blessed Body UNPB original modpage.\r\n\r\nNon of this is work I\\'ve done, I\\'ve only taken existing mods and compiled it together for easier use. If this is against the rules of Skyrim Nexus please remove this file immediately.\r\n",
  "categoryId": "34",
  "version": "0.9",
  "author": "3DFapMan",
  "createdUnix": "1339981123",
  "updatedUnix": "1339982097",
  "containsAdultContent": true,
  "uploadedBy": "3DFapMan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68728",
      "name": "Temptress Race UNPB-BBP Fitness Body Coverwomen v09",
      "version": "v0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19445",
      "fileName": "Temptress Race UNPB-BBP Fitness Body Coverwomen v09-18969-v0-9.rar",
      "uploadedUnix": "1339982097",
      "modVersion": "v0.9",
      "virusScanUrl": "https://www.virustotal.com/file/201074d43641f91264721a653053e907afc714aa81736615b42a77311e271b66/analysis/1406966548/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Temptress%20Race%20UNPB-BBP%20Fitness%20Body%20Coverwomen%20v09-18969-v0-9.rar?fid=68728&ttl=1535786140&ri=8192&rs=8192&setec=bffa9145f22bd92227d6c8a08e486d8d"
    }
  ]
}