{
  "modId": 18962.0,
  "modName": "Nirnroot Normalized",
  "summary": "I got tired of nirnroot glowing and making noise. ",
  "descriptionHtml": "This mod makes nirnroot act like a normal plant. It does not glow and it does not make noise. Obviously, this mod does make nirnroot harder to find!  I still consider this lore friendly in that Oblivion nirnroot did not have a torch-like glow and the chime was MUCH MUCH quieter.  Basically the difference between vanilla Skyrim chime and vanilla Oblivion chime is greater than the difference of Oblivion chime and nothing.\r\n\r\nThis is my first attempt at uploading a mod.  It\\'s very simple.\r\n\r\nI found mods on nexus that take care of one or the other but none that take care of both. It\\'s possible that one of those overhaul type mods has done it but all I want is for nirnroot to stop glowing and making noise.\r\n\r\nI didn\\'t touch red nirnroot. I may at a later date. (i\\'m not entirely sure I\\'ve ever run across red nirnroot in the game yet)\r\n\r\nTo uninstall just uncheck the esp.\r\n\r\nNOTE: \r\nI reinstalled Oblivion to check on the audio and visuals of nirnroot.  It does in fact chime, but I didn\\'t see it glowing.  I tested the audio range and found that it\\'s about right on top of the plant.  Looking straight down while in first person and slowly backing away the sound went about as far as it took for the plant to leave the screen.  In Skyrim the sound can be heard very far away.  \r\n\r\nSo I opened Oblivion - Sounds.bsa and Skyrim - Sounds.bsa and found that the audio for both games is about identical.  I messed around with altering the audio in creation kit.  That made it quieter but it could still be heard very far away.  Since I don\\'t know how to shrink the audio range of it, I\\'m just leaving it disabled.\r\n:END NOTE",
  "categoryId": "85",
  "version": "1.0",
  "author": "zhemis",
  "createdUnix": "1339970799",
  "updatedUnix": "1339971121",
  "containsAdultContent": false,
  "uploadedBy": "zhemis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68698",
      "name": "Nirnroot Normalized",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Nirnroot Normalized-18962-1-0.rar",
      "uploadedUnix": "1339971121",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/960b2dc8b2af5ce6fe2f36dee8c48b9389cdc4d484227192040090238a65432e/analysis/1406966166/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nirnroot%20Normalized-18962-1-0.rar?fid=68698&ttl=1535786130&ri=8192&rs=8192&setec=3189d4744e347963680e789cf70d36e0"
    }
  ]
}