{
  "modId": 18971.0,
  "modName": "Berserk - Tales of the Black Swordsman",
  "summary": "NOTE: I&#39;m sorry, everyone, but I&#39;m no longer supporting this mod. It&#39;s also come to my attention that the creator of some of the original content, which this needs to function, has taken stuff off of his site. I&#39;ll leave it up here for posterity, in case you want any of the content that&#39;s included in this download. \r<br />\r<br /",
  "descriptionHtml": "[color=#ffd966]NOTE: I&#39;m sorry, everyone, but I&#39;m no longer supporting this mod. It&#39;s also come to my attention that the creator of some of the original content, which this needs to function (Berserk Races and Griffith&#39;s Armor), has taken that stuff off of his site. I&#39;ll leave it up here for posterity, in case you want any of the content that&#39;s included in this download. [/color]\r<br />\r<br />Introduction\r<br />\r<br />This is essentially a compilation of other mods with some custom work added. All included files have been included with the original author&#39;s permission. Other mods are also required, but you&#39;ll have to download them separately. \r<br />\r<br />What you&#39;ll find here is not an original quest mod, but rather a mod that tweaks the Civil War quest to have a Berserk flavor. This project intertwines the mythos of The Elder Scrolls and Berserk to a previously unseen extent. There have been some stunning Berserk mods released, but to my knowledge no one has compiled them into a working conversion. And, while I wouldn’t go so far as to call this a total conversion, it does aim to be something along those lines. Rather than following the exact narrative arc of Berserk, this project attempts to transfer the characters, themes, and story elements of Berserk into the world of Skyrim. You might call it a side story, or an alternate fiction intended to take place sometime between Griffith’s reincarnation and Gut’s and Caska’s journey to Elfhelm. \r<br />\r<br />The Story So Far\r<br />\r<br />A reincarnated Griffith leads his new Band of the Hawk to Skyrim in a remote corner of the Empire of Midland. His mission is to subdue a rebellion led by Wyald and his Black Dog Knights, an exiled army of criminals. With an emotionally troubled Caska by his side, the legendary “Black Swordsman” Guts forms a temporary alliance with Wyald in an effort to wreak a terrible vengeance upon Griffith for his betrayal. \r<br />\r<br />Highlights\r<br />\r<br />-Guts, complete with iconic armor, Dragonslayer sword, and fully functional hand cannon and repeating crossbow.\r<br />-Griffith and his new Band of the Hawk have replaced General Tullius and his upper echelon of military advisors.  \r<br />-The apostle Wyald has replaced Ulfric Stormcloak. \r<br />-Caska and Puck will accompany Guts on his journey.\r<br />-Visit Godo’s Cottage, including Godo, Rickert, and Erica.\r<br />-Battles with Zodd the Immortal\r<br />\r<br />Required Mods:\r<br />\r<br />Apachii&#39;s Skyhair:\r<br />http://skyrim.nexusmods.com/mods/10168\r<br />\r<br />Berserk Dragonslayer\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=3143\r<br />\r<br />Berserk Races\r<br />http://bagserk.blogspot.com/\r<br />\r<br />Griffith&#39;s Armor\r<br />http://bagserk.blogspot.com/\r<br />\r<br />Alduin&#39;s Scale Armor\r<br />http://skyrim.nexusmods.com/mods/11259",
  "categoryId": "79",
  "version": "2.1",
  "author": "Demiourgos0",
  "createdUnix": "1339985653",
  "updatedUnix": "1342676075",
  "containsAdultContent": false,
  "uploadedBy": "demiourgos0",
  "primaryFile": null,
  "files": [
    {
      "fileId": "68951",
      "name": "Berserk - Tales of the Black Swordsman v2-1",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "48643",
      "fileName": "Berserk - Tales of the Black Swordsman v2-1-18971-2-1.rar",
      "uploadedUnix": "1340075210",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/4b2da574529339cf503381fe690a111b020a4c0f9b2e27732e4ceaf64d22ce9d/analysis/1406968992/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Berserk%20-%20Tales%20of%20the%20Black%20Swordsman%20v2-1-18971-2-1.rar?fid=68951&ttl=1535786145&ri=8192&rs=8192&setec=ff42d08576771404e25a4f32d7b088d1"
    },
    {
      "fileId": "75248",
      "name": "Griffith fix",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Griffith fix-18971-.rar",
      "uploadedUnix": "1342676075",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/95299c1381670f98d43bf3c625b35354b44ce788b2df07701e9e52f0530ca2b0/analysis/1407032343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Griffith%20fix-18971-.rar?fid=75248&ttl=1535786145&ri=8192&rs=8192&setec=6c31d1cad2be9252583eaa23f2873ec4"
    }
  ]
}