{
  "modId": 18997.0,
  "modName": "Monster Wars V6",
  "summary": "A massive growing overhaul that adds lots of features, if you like Monster Mod then you\\'ll love this!\r\nNow with The Deadlands of Oblivion!",
  "descriptionHtml": "[center][img]http://static.skyrim.nexusmods.com/images/2570251-1340043045.png[/img]\r\n[img]http://img19.imageshack.us/img19/7326/1899731340480878.jpg[/img][/center]\r\n\r\n[center]Requires [url=http://skyrim.nexusmods.com/mods/35631//?]Skyrim Monster Mod[/url][/center]\r\n[center]And [url=http://skse.silverlock.org]SKSE[/url]\r\n\r\nRecommended installation using [url=http://skyrim.nexusmods.com/mods/6]BOSS[/url] if experiencing crashing[/center]\r\n\r\n\r\n[center]This vid was put together by Saiodin (nexus profile) who has gone into a good amount of detail to describe as many of the features as possible, so kudos to him!\r\n[youtube]B-2tJ2A1UEw[/youtube][/center]\r\n\r\n[center]Check out this vid for the highlights made by l1nkown (nexus profile) which can be found on [url=http://www.youtube.com/user/MMOxReview]His Youtube Channel[/url][/center]\r\n[center][youtube]lHwC85iTSAw[/youtube][/center]\r\n\r\n[center]This review was put together by svaalbard (nexus profile) and shows some good examples of what to expect.\r\n[youtube]E78cjcDuA0A[/youtube]\r\n\r\nHere is another vid made by Ownallday (youtube profile) which includes a short description and shows an invasion at Dragon Bridge.\r\n[youtube]kwnPAleU0HU[/youtube][/center]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/19639]Venator Daemonous Edition[/url] - [b]This version will swap the Blue Stripe defences to a more lore friendly defense and different armour, check his description for more details.[/b]\r\n[img]http://img402.imageshack.us/img402/3919/vent000000.png[/img]\r\n\r\n[u]Translated versions[/u]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/19653]Chinese[/url]\r\n[url=http://skyrim.nexusmods.com/mods/19454]German[/url]\r\n[url=http://skyrim.nexusmods.com/mods/19288]Lithuanian[/url]\r\n[url=http://skyrim.nexusmods.com/mods/21359]Spanish[/url]\r\n[url=http://skyrim.nexusmods.com/mods/26492]Portugese[/url]\r\n\r\n\r\n[b]BE SURE TO TRACK THIS MOD, THERE WILL BE MANY UPDATES WITH NEW CONTENT ADDED REGULARLY[/b]\r\n\r\nTHIS MOD ADDS A LOT TO THE GAME BUT THERE ARE BIG PLANS TO EXPAND IT GREATLY, READ THROUGH THE README FILE OR DESCRIPTION PAGE FOR DETAILS\r\n\r\nDOWNLOAD THE FLESH CREEPER FIX AND INSTALL AFTER V5 MAIN, IT\\'S A MISSING MESH FIX AND WILL AVOID ANY INVISIBLE CREATURES.\r\n\r\n\r\nMonster Wars V5.1 Changelog:\r\n============================\r\n\r\n[b]LET IT BE KNOWN THAT 5.1 IS A MAIN FILE REPLACER NOT COMPATIBLE WITH THE \\'NO BLUE STRIPES\\' VERSION OR ANY OTHER ALTERNATE ONE.  I\\'M AM WAITING UNTIL V6 TO MAKE THE OTHER VERSIONS.[/b] \r\n\r\n- Got rid of all village/town invasions due to popular requests to lower the chance of quest giving NPCs getting killed, while reducing the chance of CTDs\r\n- Made all weapons and armour Improveable\r\n- Made using MoMod V9 as the master\r\n\r\n\r\nMonster Wars V5 Changelog:\r\n==========================\r\n\r\n- Added new worldspace, The Deadlands.  You can enter via the Oblivion Gate located south of Solitude, could be found in V4.\r\nFor now there is one \\'level\\' to play through but this realm will be expanded on with new gates around Tamriel. The new realm has it\\'s own weather, imagespace, lava, etc. to get the authentic look of Oblivion.\r\nWhile in this realm you will play through a new new worldspace, an oblivion cave, and a sigil keep.  You will be fighting the scariest creatures from Momod, which have been marked as daedric, and the dremora including some new ones.\r\nHave a good look around while in this world to find special rewards, mainly in the form Daedric Chests which hold good rewards.\r\n\r\n- Changed the elemental arrow crafting to require the Arcane Blacksmith perk for better balance\r\n- Hightened the chance of new Momod V8 creatures to appear, while changing their relationships to other creatures.\r\n- Added the Daedric Falmer with their own weapons\r\n- Added the Flesh Creeper\r\n- Changed some factions to suit the mod better, such as the dremora are now allied with the daedric monsters (I know they are rare but maybe you have mods with both, and I have added dremora in Deadlands).\r\n\r\nNote: When you acquire the Sigil Stone from the deadlands be careful if should decide to drop it at some point, there is a script attached that teleports the player to gate entrance in Tamriel.\r\n\r\nThe Sigil Stones do not have special enchantments yet, but to compensate for this they are very valuable.  I will work to see if it\\'s possible to get an enchanting system like in TES4.\r\n\r\nAs always please give me your feedback to let me know if things are balanced/challenging enough, and if the deadlands works ok for you ;)\r\n\r\nMonster Wars V4.1 Changelog:\r\n============================\r\n\r\n- A patched version eliminating potential crashing bugs such as avoiding possible spawns under navmesh and corrected unfinalised navmesh.  \r\n- I have eliminated some unwanted edits such as missing dungeon parts. \r\n- The world object for the sorcerer robes has been improved, and the 1st person Dragonbane arms have been fixed.  Both done by Dogtown1 so you can thank him for that.\r\n\r\nThere have also been a few minor changes, like a couple of extra monster placements/moved, and oblivion gates set for LOD, nothing major but it is mainly a bug fixing version for those frequently experiencing CTDs.\r\n\r\nI still want any feedback you can give regarding other bugs and bad edits, there is a lot invlved in the making of this mod and your bug reports help me out a lot. Thanks ;)\r\n\r\nMonster Wars V4 Changelog:\r\n==========================\r\n\r\nIf you don\\'t want to have the Blue Stripe Guards, use the No Blue Stripes verion.  It has it\\'s own bsa file without any of the data files, making it smaller and less likely to hit performance.  You don\\'t need the main file to run this.\r\n\r\nI have included a \\\"No Sorcerers\\\" version as an optional esp in the main download for if you don\\'t them in the game, check this file only if you wish to use it.\r\n\r\n- Added Morgwar (Boss) found near Bronze Water Cave\r\n- Better Protection for populated areas, with more blue stripe soldiers, outposts and fortification\r\n- More Blue Stripes and monsters placed in some locations\r\n- Dragonbane Armour, craftable at the forge.  Needs the perk to craft dragonplate armour\r\n- A new follower - Drako the Slayer, an expert dragon slayer who specializes with two-handed weapons and will level with the player who caps at lv.100. Find him at the Dead Man\\'s Drink in Falkreath.  He carries a Dragon Slayer Battleaxe and wearing the new Dragonbane armour.\r\n- Another new follower - Ves from The Witcher found in Haelga\\'s Bunkhouse in Riften.  She fights with a Witcher sword in one hand while using protective magic in the other, moving faster then the average fighter.\r\n- An Oblivion gate can be found in the marshes near Solitude surrounded by daedra, soon to be a conduit to the realm of The Deadlands.  If you make your way to the gate there is prize nearby!\r\n- Removed the bone horror (night eyes) from the dark brotherhood sanctuary until it can be set up as a companion.\r\n- A Daedric Prince companion found in the Dark Brotherhood Sanctuary called Baphoman.  He wields a Dark Hammer weapon, can summon fellow daedra for help, and controld fire magic.\r\n- Draugr Bloody Axe and DRaugr Club now tagged as playable\r\n- Fixed Facegen for ALL NPCs\r\n- The Ordinator, a enemy that can be found around among undead enemies and the Sorcerers.  Will appear at higher levels.\r\n- Fixed missing models (invisible creatures) for all monsters\r\n\r\nNote: The followers are set as essential and cannot die, their armour cannot be taken.  They are also marriable.\r\nNote 2: The No Blue Stripes version only gets rid of guards and their equipment so there will still be the added fortification and camps, there will be a patch with vanilla guards/soldiers in place of BS guards.\r\n\r\nMonster Wars V3 Changelog:\r\n==========================\r\n\r\n- Adds the Haunted Crypt dungeon, it\\'s quite short for now but I plan on extending it.\r\n- Added Female Frost Giant\r\n- Further edited monster levelling system, adding more diversity and appropriate spawns\r\n- Adjusted the death items, making them balanced and appropriate to their class\r\n- Added Ebony Treant with it\\'s own weapon\r\n- 16 new Naga type creatures including a Legendary Naga\r\n- Fixed boss character to drop loot when killed\r\n- Fixed the Facegen (grey heads) for unique characters like Thorin the follower at Windhelm Stables, Zuleb the Sorcerer Boss, and the Protectors.\r\n- All the new Items added by this mod can be crafted at the forges with their own recipes.\r\n- Sorcerers are friendly now with draugr and similar factions\r\n- New Boss Arkazaal at the end of the Crypt crafted at the forges with their own recipes.\r\n- Added the Gravedigger Shovel (mainly for Haunted Crypt) and Blacksmith Hammer weapons - made using existing misc items.\r\n- Fixed the Dwemer Mines to be unlocked (sorry about about that oversight)\r\n- Added an EXPERIMENTAL Shapeshifting spell tome sold by Farengar at dragonsreach.  Use this at your own risk, it still needs fully testing and tweaking.  If you choose to use this save before you buy, and more importantly you MUST have completed the Companions quest with the blood ritual which allows you to change into a werewolf - if you don\\'t you will not be able to change back to human.  The tome will shapeshift the player to a Hunger and will last very long, try waiting (T) a few hours to change back.\r\n\r\n\r\nMonster Wars V2 Changelog:\r\n==========================\r\n\r\n- Adds a new Sorcerer enemy faction including Zuleb, a new boss.  These new enemies will spawn the same way as existing enemy mages, plus new spawn points.  As well as powerful lighting magic they are capable of summoning the undead and daedra.\r\n- Sorcerers wear a new armour\r\n- Adds the Ancient Dwemer Mines with a Balrog boss\r\n- Adds Aggressive Guar \\'pets\\' to the bandit faction\r\n- Increases Forsworn presence in the reach, along with the minotaur and giant companions.\r\n- More Blue Stripe presence\r\n- Fixed the Elite Blue Stripe gloves\r\n- Improved the Witcher Sword stats\r\n- New magic elemental arrows, found as loot or bought from stores\r\n- Adds the Cave Troll\r\n\r\nDescription\r\n-----------\r\n\r\nThis mod has been made to dramatically enhance the game while using dogtown1\\'s Monster Mod by adding several features, it follows the same kind of concept as Oblivion\\'s MMM and New Vegas\\'s AWOP with lots of features.\r\n\r\n- Revising and added monster behaviour, abilities and spells, spawn points and other aspects.  There are quite a few Momod creatures identified as daedra now such as the scamps, fire giant, bullvore, which will cause conflict in the wilderness - for example the fire giants will battle other giant types now if they come across each other, but will not spawn in the same group.  The Werecats are now friendly with the Sabrecats, skeletal creatures will coexist, and the treants live with the spriggan.\r\n- Adding new monsters, all with their own aesthetic and some with new abilites.  They have been created using the assets from Monster Mod and mixing them up plus adding my own.\r\n- New weapons and armour hidden as loot, sold at stores, wielded by elite enemies, and some unique ones as prizes.  These new weapons are rare and you are more likely to find them at a higher level.  This includes new armours, helmets, shields, and sword from the Witcher games which will fit the battles with Witcher creatures.\r\n- New spells, including the introduction of random summoning!  There are now spells to obtain through learning, scrolls, staffs and even used by some enemies.  The conjured creature will be roughly determined by the players level and will last for 2 minutes, and will come in sets of Daedra, Undead, Dragons (rare).\r\n- New NPCs, including additional defences for populated areas in the form of the Blue Stripe soldiers and Protectors who are high level NPC Adventurers hired to protect the smaller towns.\r\n- New armours, helmets, shields, and sword from the Witcher games\r\n- New follower in the form of Thornir, you will find him at Windhelm by the stables who is defending the town from Ice Giants.  He Has all the capabilities of vanilla followers and is marked as essential so he won\\'t die on you, while being equipped with his own unique weapon.\r\n- Increased the dragon presence in Skyrim by placing the Momod dragons in locations throughout the map, you will encounter all kinds of ranks so be careful you don\\'t stumble into a previously unihabited area without protection as you might find an Elder or Ancient dragon waiting for you!\r\n- Some Enemy factions now have monster fighting alongside them as allies or pets. \r\n- Blue Stripe outposts have been added to the world, a few for now but I will be adding more with updates.  They are added as actual locations with their own map markers and can be fast travelled to once discovered (including coc if you use it).\r\n- There are several Giant Ogres placed around the world that will drop special items so you can go behemoth hunting!\r\n- Unique Bosses, some with their own custom built territory, can be found throughout the game.  If you find Blue stripes at any of the Inns, or at Outposts, you can normally find bounty notes with them (1 at each location) which will give a description of the Boss and hint at it\\'s location.  Alternatively you can find bounty notes with vendors who tend to sell misc items.\r\n\r\nA lot of new encounters will depend on your characters level by adding many levelled spawn points, however the unique boss creatures have been set at a high level and would be too difficult for beginners.  This mod also caters for elite players who like to level up as high as possible by adding new harder creatures that will spawn when you are at an advanced level.  \r\nThis mod would be ideal for you if you have had problems in the past not finding many Momod creatures and you will experience a lot more variety with many new monster types.\r\nAs you travel around the world you will come across new encounters and battles taking place chiefly involving monsters!  You will find creatures wandering down the roads searching for human prey, advancing toward populated settlements including the main towns, you will even find them fighting each other!  All content has been added Tamriel (outdoors), but in future updates I will be adding unique dungeons and worldspaces.\r\nYou may notice a new dwemer dungeon entrance down the river from Druadach Redoubt, it\\'s locked for now but in V2 will be used for a dwemer dungeon kinda like the Mines of Moria from LOTR complete with Falmer, Ogres, and a Balrog boss.\r\nAcross the map are containers specially made to hold the new content of this mod,  you will mostly find them at Blue Stripe outposts but there will also be dead soldiers with some equipment on them.\r\n\r\nList of new monsters and bosses\r\n\r\n- The Reaper (Boss)\r\n- Giant Ogre (Boss)\r\n- 25 new New Drakes such as Earth, Daedric, Fledgling, Frost, Forest etc.\r\n- New Reaper Spirits\r\n- Blood Drinker (Boss)\r\n- Forest Witch (Boss)\r\n- Blood Lord (Boss)\r\n- Giant Daedric Chaurus (Boss)\r\n- Dremora Werewolf\r\n- New Bone Horrors\r\n- Blood Werewolf\r\n- 14 new Dragon Daedroth types\r\n- Hooded Gargoyle\r\n- Colossus, a gigantic Hooded gargoyle (Boss)\r\n- Giant Gargoyle (Boss)\r\n\r\nList of new weapons\r\n\r\n- Staff of the Dead, a unique mages staff that will conjure a random undead creature for 2 minutes\r\n- Neurotoxin Greatsword, poisonous\r\n- Veraxanima Sword, Dagger and Greatsword, all do additional damage to undead creatures\r\n- Ferravis Warglaive, deals additional damage to daedra\r\n- Wildvine dagger and Sword, deals additional damage to animal types\r\n- Dwemer Equalizer, deals additional damage to dwemer automatons\r\n- Staff of the Dragon King, conjures a random dragon for 2 minutes of varying levels. (USE OUTSIDE!)\r\n- Copperthorn, deals additional damage to giant types\r\n- Thorin\\'s Hammer, staggers enemies, unique weapon carried only by Thorin who is guarding Windhelm\r\n- Witcher sword, one-handed and two-handed\r\n- Dragon\\'s Bane, deals additional damage to dragons\r\n- Staff of Daedric Command, conjures a random daedra\r\n\r\n*Note that in order for the additional damage enchantments to work I had to manually add data to each individual creature from Monster Mod, and will not work on all vanilla creatures.\r\n\r\nList of new armour\r\n\r\n- Blue Stripe light armour set\r\n- Blue Srtipe heavy armour set\r\n- Blue Stripe Elite armour set\r\n- Viper Assassin set\r\n- Witcher Helmets\r\n- Witcher Shields\r\n\r\n*There may be problems with some world objects and UI for some of these armours which is out of my control, however they work properly when equipped on NPCs, mannequins, and your character*\r\n\r\n\r\nFuture plans for this mod will involve more followers including creature companions, new dungeons, more monsters, and hopefully more weapons and armour.\r\nI am also looking into quest-making and will include in later versions if I can get them to function well enough together.\r\n\r\n\r\nInstallation\r\n------------\r\n\r\nUpack the files to your Skyrim\\\\Data directory, remove to uninstall.\r\n\r\nThis mod has been made for Monster Mod here on the nexus and will not cause conflicts that are not already present with that mod. For instance if you use Immersive Creatures you will need to make a bashed patch.\r\n\r\nIf you use my Waking Nightmare II mod, you will notice some of the same assets used and both mods should be compatible.\r\n\r\n\r\nCompatibility\r\n-------------\r\n\r\nMake sure you know what you\\'re getting yourself into when installing Monster Wars.  There WILL be mod conflicts as many features have been added, but I do not have time to go through the hundreds of really popular mods to give a list.\r\nThere are conflicts with Monster Mod alreay such as Wars In Skyrim, and Deadly Dragons if not loaded at the end of the load order.  You may get conflicts with Warzones with this mod, I haven\\'t tested them together so can\\'t be sure.  It might even just make for bigger fights in some areas.\r\nDespite having potential conflicts you CAN get them to work together by using Wyre Bash and creating a bashed patch.\r\nIf you use any of the mods mentioned in the credits, this will be work alongside them but you may notice duplicates with different properties in-game.\r\n\r\nCredits and Permissions\r\n-----------------------\r\n\r\nFirstly I will announce that this mod is not to be published on any other site that will host Skyrim Mods, if you wish to make a translation send me a PM and I will comply with your request.\r\nYou cannot use the monster assets for your own project without asking for permission from Dogtown1, and in some cases myself too (my own retextures).  The weapons are part of resource mods, check the \\\"special thanks\\\" below and follow the links.\r\n\r\nAll assets from the Witcher game were gained through other authors\\' uploaded files who were able to rig the equipment to suit the world of Skyrim, I have simply added them to Monster Wars for added immersion.\r\n\r\nSpecial thanks go to,\r\n\r\nDogtown1 for your support and assistance, and of course for making [url=http://skyrim.nexusmods.com/mods/9694]Skyrim Monster Mod[/url]! \r\nOrcadude for the [url=http://skyrim.nexusmods.com/mods/9400]Bigger Badder Werewolves[/url] mod\r\nGizmodian for your awesome [url=http://skyrim.nexusmods.com/mods/13665]Gizmodian Oblivion Weapons for skyrim[/url]\r\nGhosu for your [url=http://skyrim.nexusmods.com/mods/9196]Thors Hammer Mjolnir V2[/url]\r\nTH3WICK3D1 for the Witcher armours from your [url=http://skyrim.nexusmods.com/mods/7807]Viper Assassin-Blue Stripes-Roche-Ves[/url]\r\n[url=http://www.cdprojekt.com/]CDProjekt[/url] for the original Witcher assets and allowing the use of them for Skyrim\r\nRedxavier for the [url=http://skyrim.nexusmods.com/mods/7159]Witcher 2 Helmet Pack[/url] and [url=http://skyrim.nexusmods.com/mods/7328]Witcher 2 Shield Pack[/url]\r\nKimono for your awesome looking [url=http://skyrim.nexusmods.com/mods/16991]Witcher Silver Sword[/url]\r\nOmegared99 for your [url=http://skyrim.nexusmods.com/mods/10277]Armor Compilation[/url]\r\n\r\n\r\nRecommendations\r\n---------------\r\n\r\n- Encounters can be better identified if you have your actor fade video settings quite high, sometimes NPcs and creatures will begin combat upon spawning so eep your ears and eyes peeled at all times while you are outdoors.\r\n- Be wary of other mods that add structures to the world or expand cities, they may interfere with some encounters.\r\n- Install manually.  I have heard too many reports of unsuccessful downloads and installations using Nexus Mod Manager and because I don\\'t ever use it I won\\'t be able to help you with it.  All files have been compressed for easy install, make sure Monster Wars is under Momod in the load order.\r\n\r\n\r\nFeedback\r\n--------\r\n\r\nPretty much all of the content has been tried and tested to function correctly. However if you find any bugs or if something is not working properly (that hasn\\'t already been pointed out in the readme) leave a comment on the nexus page or if you feel compelled, send me a PM and I will strive to correct any problems with the mod or help you out with any issues you are having with it.\r\nKeep in mind if you attempt to contact me and I don\\'t get back to you right it\\'s either because i\\'m not online and probably modding, or your query can be answered by consulting the readme file.",
  "categoryId": "79",
  "version": "6.1",
  "author": "Ironman5000",
  "createdUnix": "1340039931",
  "updatedUnix": "1371567981",
  "containsAdultContent": false,
  "uploadedBy": "Ironman5000",
  "primaryFile": null,
  "files": [
    {
      "fileId": "72155",
      "name": "Monster Wars v4",
      "version": "4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "202053",
      "fileName": "Monster Wars v4-18997-4.7z",
      "uploadedUnix": "1341423203",
      "modVersion": "4",
      "virusScanUrl": "https://www.virustotal.com/file/19372b4390b23ef936e7b7d15e747ada461b157aec160ad97be9f329594434b5/analysis/1407000892/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Monster%20Wars%20v4-18997-4.7z?fid=72155&ttl=1535786186&ri=8192&rs=8192&setec=d9b5bf58d2959779510957b8d0d46bd1"
    },
    {
      "fileId": "72166",
      "name": "MoWars V4 No Blue Stripes",
      "version": "4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "162061",
      "fileName": "MoWars V4 No Blue Stripes-18997-4.7z",
      "uploadedUnix": "1341425890",
      "modVersion": "4",
      "virusScanUrl": "https://www.virustotal.com/file/8c8aa0ec8423892b619fef00d8fb13cc7c9da334b3fa5a6aee7c0f5d40db862b/analysis/1407001050/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MoWars%20V4%20No%20Blue%20Stripes-18997-4.7z?fid=72166&ttl=1535786187&ri=8192&rs=8192&setec=8c65873f0b4aafac49babbf2e23de2cf"
    },
    {
      "fileId": "77553",
      "name": "Monster Wars V5",
      "version": "5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "289828",
      "fileName": "Monster Wars V5-18997-5.7z",
      "uploadedUnix": "1343623472",
      "modVersion": "5",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Monster%20Wars%20V5-18997-5.7z?fid=77553&ttl=1535786187&ri=8192&rs=8192&setec=b8b771bc273294c8a6d6bf42ab6372ef"
    },
    {
      "fileId": "77695",
      "name": "MoWars V5 No Blue Stripes",
      "version": "5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "260208",
      "fileName": "MoWars V5 No Blue Stripes-18997-5.7z",
      "uploadedUnix": "1343675922",
      "modVersion": "5",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MoWars%20V5%20No%20Blue%20Stripes-18997-5.7z?fid=77695&ttl=1535786188&ri=8192&rs=8192&setec=e5093e42f7a50edee6914eae64a6de38"
    },
    {
      "fileId": "77754",
      "name": "Hardcore Mode ESP",
      "version": "5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2913",
      "fileName": "Hardcore Mode-18997-5.zip",
      "uploadedUnix": "1343694990",
      "modVersion": "5",
      "virusScanUrl": "https://www.virustotal.com/file/efb042bc3c14ff4dfe3f64dbe7e3d895d4dfeabda983124df23fa6b41545e7a8/analysis/1407058695/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hardcore%20Mode-18997-5.zip?fid=77754&ttl=1535786189&ri=8192&rs=8192&setec=840e9e21458a4edbb80fbd96db4e9c65"
    },
    {
      "fileId": "77756",
      "name": "Hardcore Dragon Mode",
      "version": "5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2917",
      "fileName": "Hardcore Dragon Mode-18997-5.zip",
      "uploadedUnix": "1343697026",
      "modVersion": "5",
      "virusScanUrl": "https://www.virustotal.com/file/4eeb509fd2f13a0468c317c9192e46af8490e51722af8a721d98b624b528ab16/analysis/1407058748/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hardcore%20Dragon%20Mode-18997-5.zip?fid=77756&ttl=1535786189&ri=8192&rs=8192&setec=2986513ad0806c36b92031aa03717cdc"
    },
    {
      "fileId": "77770",
      "name": "Lite Mode",
      "version": "5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2905",
      "fileName": "Lite Mode-18997-5.zip",
      "uploadedUnix": "1343703016",
      "modVersion": "5",
      "virusScanUrl": "https://www.virustotal.com/file/ba90eb2786ad4242dcc7245ca6a0fe4c1956f43bc2b03e2ad9c89f40325efba1/analysis/1407058866/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lite%20Mode-18997-5.zip?fid=77770&ttl=1535786189&ri=8192&rs=8192&setec=188e99f8d44a78427681b2b2440bda72"
    },
    {
      "fileId": "91118",
      "name": "Version 5point1 esp update for Momod V9",
      "version": "5.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2889",
      "fileName": "Version 5point1 esp update for Momod V9-18997-5-1.zip",
      "uploadedUnix": "1348940577",
      "modVersion": "5.1",
      "virusScanUrl": "https://www.virustotal.com/file/09552ab18ac1a668996fd8231ebe1a1f9c35995d20ec5c513eacfa94e135e9fd/analysis/1407193984/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%205point1%20esp%20update%20for%20Momod%20V9-18997-5-1.zip?fid=91118&ttl=1535786190&ri=8192&rs=8192&setec=d051b3c4f249b2dfd7b42183a3b7c885"
    },
    {
      "fileId": "1000028509",
      "name": "Monster Wars V6",
      "version": "6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "416835",
      "fileName": "Monster Wars V6-18997-6.7z",
      "uploadedUnix": "1367880200",
      "modVersion": "6",
      "virusScanUrl": null,
      "changelogHtml": " Fixed all missing monsters <br/> \n Added the Snow Crab, found in cold areas <br/> \n A few monsters (hardly any really) removed to suit the reborn Momod <br/> \n Compressed bsa file for smoother running without quality loss <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Monster%20Wars%20V6-18997-6.7z?fid=1000028509&ttl=1535786191&ri=8192&rs=8192&setec=720e8b6d8c726aeb373204711b4dc865"
    },
    {
      "fileId": "1000028646",
      "name": "Monster Wars V6 esp for Immersive Momod",
      "version": "6",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2867",
      "fileName": "Monster Wars V6 esp for Immersive Momod-18997-6.zip",
      "uploadedUnix": "1367943346",
      "modVersion": "6",
      "virusScanUrl": "https://www.virustotal.com/file/bba395cc17de0c1aefae550b014b7b036bdb24b4c26844a5e645d5e493bdbec4/analysis/1407559506/",
      "changelogHtml": " Fixed all missing monsters <br/> \n Added the Snow Crab, found in cold areas <br/> \n A few monsters (hardly any really) removed to suit the reborn Momod <br/> \n Compressed bsa file for smoother running without quality loss <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Monster%20Wars%20V6%20esp%20for%20Immersive%20Momod-18997-6.zip?fid=1000028646&ttl=1535786191&ri=8192&rs=8192&setec=bc6cbc917d2a6e729af65f9dc9b69b38"
    },
    {
      "fileId": "1000034779",
      "name": "MW Update to fix CTDs",
      "version": "6.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "3229",
      "fileName": "MW Update to fix CTDs-18997-6-1.zip",
      "uploadedUnix": "1371567981",
      "modVersion": "6.1",
      "virusScanUrl": "https://www.virustotal.com/file/6cc7e1d8f31130d5df6d201961bf79562b9d2b6ef73ecf2caa3010bc7d213634/analysis/1407608295/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MW%20Update%20to%20fix%20CTDs-18997-6-1.zip?fid=1000034779&ttl=1535786192&ri=8192&rs=8192&setec=df9eb493fef4d7dc8bfed1c84b20b109"
    }
  ]
}