{
  "modId": 19051.0,
  "modName": "Mastercraft Weapons and Armor",
  "summary": "Ever fell in love with nordic-style, barbarish hide and studded armour and iron/steel weapons so badly that you actually wanted to play until late game in those, but they lacked the strength, armour rating, damage etc? Seek no further ;)",
  "descriptionHtml": "This file is also available on Steam Workshop (http://steamcommunity.com/sharedfiles/filedetails/?id=135492146)\r<br />Requires: http://skyrim.nexusmods.com/mods/4866\r<br />\r<br />Ever fell in love with nordic-style, barbarish hide and studded armor?  And then, on later levels, you discovered those ugly elven and glass, non-pure nordic fantasy armors? Of course there were scaled armors too, and they did their role nicely, but the hide... the hide was pure nordic poesy about barbarism and brutality ;) This mod aims to create higher tier, same looking hide and studded armor and iron/steel weapons, craftable at forge. Tier II is unlocked with Advanced Smithing Perk and tier III with Dragon Smithing Perk. All are upgradable at grindstone/table.\r<br />\r<br />Crafting Lore: having become and advanced smith, you learned how to imbue your traditional iron and steel weapons with corundum plating in order to make the blades last longer, be harder and more sharp. As for armors, you learned the technique of thickening the armor with leather without losing maneuverability, which in turn gives more protection with same flexibility. As for heavy armor, you can add corrundum plating to make them better than they were before.\r<br />\r<br />When you turned your path in smithing to Dragon Smithing, you discovered a way to imbue the corundum-plated weapons with dragonsteel, which can increase their hardiness and sharpness further more. And you found a way to sew Dragonscale Underplating between the parts of hide armor, which makes it as durable as dragonscale armor and gives you flexibility of regular hide armor. Heavy armors can be strengthened with dragonsteel, so they can provide more protection.\r<br />\r<br />\r<br />Installation: unpack file from archive to your data folder. Delete any old versions of my mod if you use it.\r<br />\r<br />I strongly encourage you guys to post any bugs you may find in this mod. Thanks in advance.\r<br />\r<br />Thanks to:\r<br />Bethesda for Skyrim, Creation Kit and those ugly and overimaginated fantasy armours, thanks to which I made this little mod.\r<br />cat_woman1989 for her &#34;General Tulius Uniformity&#34; mod which provided basis for imperial officer&#39;s armor\r<br />xxxNEOxxx/JackoO for JoO Imperial Praetorian which gave beaufitul helmet mesh that acts as imperial officer&#39;s light helmet ;)\r<br />THusky for his great Open Faced Helmets mod which gave meshes for open Imperial Full Helmet in tiered versions, woo hoo :)\r<br />\r<br />Changelog:\r<br />\r<br />Optional Main File - Non-version update:\r<br />-added optional main file which uses THusky&#39;s Imperial Open Face Full Helmet. Permission granted. Credit for meshes and textures goes to THusky .\r<br />Use this OR main file. Do not activate both, or you will end up with duplicated items.\r<br />\r<br />Update 2.1a\r<br />-fixed imperial light tier II recipes - these no longer require steel.\r<br />-fixed item names for Ancient Nord Armor - Light and Heavy versions\r<br />-Imperial Light Officer&#39;s Helmet will now use the Imperial Helmet model for world/ground model display as it doesn&#39;t have its own ground mesh.\r<br />-fixed bug: Wolf Armor tier III now properly requires Dragon Smithing perk\r<br />\r<br />\r<br />Update 2.1\r<br />-added tiered Imperial Officer&#39;s Armor in light and heavy versions (heavy - red, light - blue), thanks to cat_woman1989 and her wonderful mod: http://skyrim.nexusmods.com/mods/13460//?\r<br />-added tiered light imperial officer&#39;s helmet, using mesh from http://skyrim.nexusmods.com/mods/9205//? by xxxNEOxxx\r<br />-fixed item names for wolf armor light/heavy (forgot to use new naming rules previously)\r<br />-new naming for Dovahkiin Style Armor (optional file)\r<br />\r<br />Update 2.0a\r<br />-fixed recipe for Sturdy Imperial Light Armor\r<br />\r<br />Update 2.0\r<br />-Totally new naming system. All Tier II/III namings at the ends of items were replaced with following words at the beginning of the item names: Sturdy for all tier II light armors, Mastercraft for all tier III Light armors (eg. Leather Armors -&gt; Sturdy Leather Armor -&gt; Mastercraft Leather Armor). Toughened for all Tier II Heavy Armors and Dragonsteel for all Tier III Heavy Armors (Steel Armor -&gt; Toughened Steel Armor -&gt; Dragonsteel Armor)\r<br />-similar naming convention for weapons. Now it goes like this: Steel Sword -&gt; Corundum Plated Steel Sword -&gt; Dragonsteel Sword. \r<br />-thanks to new naming, all tiered items are near each other in crafting list.\r<br />-2x better tempering as well as matching set works.\r<br />-Added tiered Imperial Armor, both light and heavy version, as well as abilities to craft Imperial Full Helmet, Officer&#39;s Helmet and Imperial Studded Armor. They are all tiered and follow the same rules as the rest of armors/weapons\r<br />-added ability to craft Long Bow and Hunting Bow\r<br />-Imperial Bow recipe changed to use firewood and leathers strips, same for tempering. where the **** is the steel here? Beth please....\r<br />-added tiered Leather Armor\r<br />\r<br />Update 1.8a:\r<br />-fixed weight ratings for Light Wolf Armor (weighs now like light armor)\r<br />-fixed recipe for Wolf Gauntlets, Tier II\r<br />\r<br />update 1.8: \r<br />-added tiered Wolf Armor. rules same as always, except the first tier which you can only buy. \r<br />-added Wolf Armor Light version with same rules as above. Available when heavy version becomes available (after joining the Companions) \r<br />-tier 3 Steel Armor now requires dragonsteel instead of Dragonscale Underplating to craft, same tier 2 Steel Plate (bugfix)\r<br />-dropped support for Raptor talon argonians\r<br />-mod now requires Open Face Helmets to work properly. (Steel plate helmet modified to occupy only hair and circlet slots. Without OFH, clipping WILL occur)\r<br />\r<br />Update 1.7b:\r<br />-added tiered Dovahkiin-style armor in light and heavy versions as optional file. load after main mod file\r<br />\r<br />Update 1.7\r<br />\r<br />-steel armor tier II and III\r<br />-steel plate armor in 1 more tier\r<br />-moved every tier III (or T2 in case of armors like steel plate or ancient nord light) recipe to be craftable only at the SkyForge (Though you don&#39;t need to complete Companions questline, that is a requirement ONLY for normal - heavy - version of Ancient Nord Armor)\r<br />-tier 2 steel plate helmet supports OpenFaced Helmets (http://skyrim.nexusmods.com/mods/4866)\r<br />-all boots excluding ancient nord support Raptor Talon Agronians (http://skyrim.nexusmods.com/mods/19305)\r<br />\r<br />Update 1.6\r<br />-fixed problems with upgrade of ancient nord heavy armor\r<br />-moved all T3 recipes to be craftable only at the SkyForge\r<br />-optional file to use with Argonian Raptor Talon mods, same fixes as above applied to this version, use this file INSTEAD of the main, not with it, else you&#39;ll end up with duplicated equipment\r<br />\r<br />ATTENTION ON 1.5b&#33;&#33; The file uploaded yesterday was bugged. Use new version instead of the main mod (do not load the mod and 1.5b update at the same time as it will cause bugs and duplicate items) and remember to load it after the argonian talon mods.\r<br />\r<br />Update 1.5b\r<br />-added tiered boots support for Raptor Talon Argonians (Reskinned Version) by decrepithawk. link: http://skyrim.nexusmods.com/mods/19305\r<br />-works for tII and III hide and iron boots. (yes this means it does NOT work for ancient nord boots, because there&#39;s no mesh - sorry&#33;)\r<br />-this may or may not work with original artifex0&#39;s Argonian Raptor Feet (http://skyrim.nexusmods.com/mods/19283) - I didn&#39;t test it.\r<br />\r<br />Update 1.5\r<br />-added light version of Targe of the Blooded in three tiers (craftable)\r<br />-added tier II and III Iron armor and Banded Iron variant (shield too)\r<br />-Tier II Iron armor requires advanced smithing perk, tier III requires dragon smithing and can only be created at the SkyForge\r<br />-added tier II and III ancient nord armor which can be created only at the SkyForge, same perk rules as for other armors\r<br />-added craftable Light version of ancient nord armor, only in two tiers: I and II. tier I has stats equal to tier II light armors, tier II - stats equal to tier III light armors. T II can be only crafted at the skyforge and requires Dragon Smithing and tier I can be crafted anywhere but requires advanced smithing perk\r<br />-of course materials required for tier II and III are the same as for other armors: tII: base armor + same materials as for base, tier III: tier II armor + dragonscale underplating\r<br />-matching set perks works for all tiers of ancient nord, light ancient nord, banded mixed with iron and full iron plus - &#33;&#33;&#33; - works for studded armor + hide helmet, bracers and boots (I did it accidentally, though I wrote earlier I&#39;m not going to - but it was experiment to test what affects if the perks work or not and I was too lazy to roll it back, so it&#39;s kinda gift for those who prefer studded to hide)\r<br />-because of the matching set perks, following changes in categories occured:\r<br />1)ancient nord armor shows up in iron category\r<br />2)ancient nord light armor shows up in the studded category\r<br />3)studded armor shows up in hide category (for all tiers)\r<br />\r<br />\r<br />Update 1.1\r<br />-matching set now works for tier II and III hide armors. \r<br />-unfortunately, studded one does not work with matching set; anyways, it did not work with original armor (because studded is available only as cuirass, no other parts) , and I do not plan to change that\r<br />\r<br />Update 1.0\r<br />-tier III hide and studded armor\r<br />-tier II and III iron and steel weapons \r<br />-armor ratings: tier II armors have the same armor rating as scaled armor and shield has the same rating as glass shield. Tier III has same armor ratings as dragonscale armors\r<br />-damage ratings: tier II weapons have same damage ratings as skyforge weapons and tier III - same as daedric weapons\r<br />-to create, all the armors of tier II require the basic armors + same amount of leather and strips as original recipe\r<br />-to create, all the tier III armors require dragonscale underplating (new material, made from 4 dragonscales at the tanning rack) + tier II armor\r<br />-to create, tier II weapons require original weapon plus corundum ingots\r<br />-to create, tier III weapons require tier II weapons plus 1-2 dragonsteel ingots (new material created from melting steel and dragonbones at the smelter - 1 dragon bone and 2 pieces of steel for 1 dragonsteel ingot)\r<br />-tier II of weapons and armor requires advanced smithing perk\r<br />-tier III of weapons and armor requires dragon smithing perk\r<br />-armors and weapons are under their respective category (hider/iron/steel/studded) but the recipes are visible only when you&#39;ve got the perks\r<br />\r<br />initial release (0.8)\r<br />This version contains tier-II hide and studded armor, they are temperable and require advanced smithing perk. The stats are slightly better than those of the scaled armors (to be fixed in 1.0 when all tier II armors will have same ratings as scaled armors)",
  "categoryId": "54",
  "version": "2.1a",
  "author": "WarlordThorvald",
  "createdUnix": "1340116222",
  "updatedUnix": "1391535562",
  "containsAdultContent": false,
  "uploadedBy": "WarlordThorvald",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000054973",
      "name": "Tiered Dovahkiin Armor",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Tiered Dovahkiin Armor-19051-1-1.rar",
      "uploadedUnix": "1379072649",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6dddf9b31f4a207bea2a0e7b7b9aca5304e1be23fab6a352a9f680906c447150/analysis/1407721084/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tiered%20Dovahkiin%20Armor-19051-1-1.rar?fid=1000054973&ttl=1535786285&ri=8192&rs=8192&setec=26e25455eceeb91e83313e464641888e"
    },
    {
      "fileId": "1000055860",
      "name": "Main File",
      "version": "2.1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18171",
      "fileName": "Main File-19051-2-1a.rar",
      "uploadedUnix": "1379332079",
      "modVersion": "2.1a",
      "virusScanUrl": "https://www.virustotal.com/file/e10f7d7854caa5567120de4c523bd0e3fb6628fb17c5fb3500b33dec73060c5a/analysis/1407724879/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-19051-2-1a.rar?fid=1000055860&ttl=1535786285&ri=8192&rs=8192&setec=a0766d58221074b7a92b44421168bb68"
    },
    {
      "fileId": "1000095264",
      "name": "Optional",
      "version": "2.1a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "19751",
      "fileName": "Optional-19051-2-1a.rar",
      "uploadedUnix": "1391535562",
      "modVersion": "2.1a",
      "virusScanUrl": "https://www.virustotal.com/file/f6d9e5039d5625fa7a6233496804ad37bb8a4cf0e7e7e5c7b7a5ef3024d351fb/analysis/1407918253/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Optional-19051-2-1a.rar?fid=1000095264&ttl=1535786286&ri=8192&rs=8192&setec=3d72db15949becd739b68d85c20c0fed"
    }
  ]
}