{
  "modId": 19077.0,
  "modName": "REQUIEM Gear of the 3rd Era",
  "summary": "“REQUIEM Gear 3rd Era” is a Stand Alone *non-lore-friendly trinity armor mashup. 3 armor classes each with unique looks, bikini, Stockings, Wrap Top, Boots and Sweet Hoods options and lore’ish descriptions. * Expect the occasional nipple slip in the heat of battle as growing pains to this, my first mod. (*some adult content)",
  "descriptionHtml": "“REQUIEM Gear 3rd Era” is a Stand Alone *non-lore-friendly trinity armor mashup. 3 female only armor classes each with unique looks, bikini, Stockings, Wrap Top, Boots and Sweet Hoods options and lore’ish descriptions. * Expect the occasional nipple slip in the heat of battle as growing pains to this, my first mod. (*some adult content)\r\n\r\nWithout spoiling the fun, you can make...\r\nThe Spitfire light studded armor set with green and gold leathers. \r\nBrickmakersA heavy armor designed for those who forge and fight, forged in the Dwarving Smithing. \r\nHeirloom Ebony collection The final set is Ebony, requires some special ingredients to make but is light, dark and sexy.\r\n\r\nYou will need your smithing skills, some decent materials and the UNP body type. The sets can be mixed and matched but there is a clipping issue if wearing shorts over these. Its a small thing but embarrassing if your trying to attend a ball in dragons reach... but id rethink shorts for those occasions. Really...\r\n\r\nInstalling\r\nRequired Mods: (This is what i used, not sure if its needed, comment me otherwise)\r\nDemon99, Calypse & XP 32: UNP BLESSED BODY BBP and more..\r\n\r\nI believe i also use Calientes and Demonized, but hard to keep track.mod on the mod list. \r\n\r\nDownload the zip file, import it using Nexus Mod Manager, then activate. It should be standalone, comment me any issues or feedback.\r\n\r\nUn-Installing\r\nIf you use nexus mod manager, just uncheck the \r\n\r\nNote of Non-Consequence: Before you do make sure you arent wearing the Spitfire armor in the middle of white run. If you are when the mod is de-activated you will be naked, and an old women who sells crap helmets will point and laugh at you. If you have the hots for the chick who likes Mamoth tusts you will lose any future chance of making her your bride... no matter how many of the freaking tusks you give her.\r\n\r\nOther Modders Unite:\r\n Im new to modding but a daily designer, so anyone who likes to mod and wants to chat, hit me up. I have some fun ideas if i could get a few guys/girls interested in grouping up to ease the modding pain. As the Jewish modders say \\\"Moddeltov!\\\" yuk yuk...\r\n\r\nCredits:\r\nBrokefoot: For not giving me permission to use your awesome Leah and Dandilion. But instead being a big help on advice for this mod.\r\nDemon99: Demonized UNP clothing - Main meshes i used, awesome stuff.\r\nOrtag: The other great meshes i used. UNP Armored Bikini\r\nCalyps: Shin Guards, didnt get a chance to use them yet, but in an update. \r\nDemon99, Calypse & XP 32: UNP BLESSED BODY BBP and more..\r\nBethesda: The best of the series, minus marrowind... feel free to re-release that game with skyrim engine.\r\nNexus: New to mods and love it, great site, chat, community and great gaming upgrades.\r\nHood: I think the hood mesh i used is from vanila, but if not please let me know so i can add credit.\r\nEveryone: Thanks to chat room, community of nexus and anyone who checks this out.\r\n\r\nUsers that Donated....\r\nMyMom\r\nMyMom83\r\nProudMOm22\r\nMomforMods18\r\n[you]\r\n\r\nDedication: \r\nI would like to dedicate this to my grandmother, who all her life wanted to grow up and be a dragon rider.\r\n\r\nAnd a special thanks to anyone whom inspired this set, or anyone i forgot to mention who had a hand in one of these great armor meshes. ",
  "categoryId": "54",
  "version": "0.5",
  "author": "BRENNERds",
  "createdUnix": "1340149187",
  "updatedUnix": "1340149430",
  "containsAdultContent": true,
  "uploadedBy": "BRENNERds",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69100",
      "name": "UNP Requiem Gear 3rd Era - Main Download",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "62650",
      "fileName": "UNP Requiem Gear 3rd Era - Main Download-19077-0-5.zip",
      "uploadedUnix": "1340149430",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/4659a8bb105a94d6422797b30f882a7b21f53b833a17c17969a40a552bd2fc07/analysis/1406970678/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UNP%20Requiem%20Gear%203rd%20Era%20-%20Main%20Download-19077-0-5.zip?fid=69100&ttl=1535786320&ri=8192&rs=8192&setec=ca9a257b89c2961c81df306295a7737c"
    }
  ]
}