{
  "modId": 19081.0,
  "modName": "Thieves Guild Repeatables Bat Files",
  "summary": "Set of bat files for quickly completing the repeatable Thieves Guild quests.",
  "descriptionHtml": "DO NOT USE VERSION 1 IF YOU HAVE ALREADY DOWNLOADED IT! The incorrect stage was used and this will keep you from being able to receive further quests. Version 2 is tested and working. My derp, I apologize.\r\n\r\n------------------------------------------------------------------\r\n\r\nLet\\'s be honest, the Thieves Guild quests you have to do before becoming the guildmaster are kind of a pain in the keister. It\\'d be one thing if they weren\\'t randomly assigned to different cities, but between that and having to do five in each city (and one of the cities having much less chance of being chosen than any of the others), but the relentless grind that ensues would put most MMOs to shame.\r\n\r\nWith these, you can use them as much or as little as you like. Autocomplete them all, or only autocomplete the ones in the cities you\\'ve already gotten and completed the special quests for to speed the process along.\r\n\r\nTo use them, simply get one of the various quests, wait for the quest text to pop up, then open the console and type \\\"bat (jobname)\\\" (\\\"bat burglary\\\" for a burglary job, \\\"bat shill\\\" for a shill job, etc.). So it\\'s not completely automated, but it\\'s certainly a lot safer (for your game) and easier (for me) than writing some elaborate script that alters the quests.\r\n\r\nShould be pretty much harmless, but since this is using the console and setstage commands, keep in mind the usual warnings about messing up your game.\r\n\r\nThe files go in your main Skyrim directory, if they don\\'t work make sure that\\'s where the mod manager put them or just put them there manually.",
  "categoryId": "40",
  "version": "2",
  "author": "Rann Aridorn",
  "createdUnix": "1340156029",
  "updatedUnix": "1340244522",
  "containsAdultContent": false,
  "uploadedBy": "RannXXV",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69306",
      "name": "Thieves Guild Bats v2",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Thieves Guild Bats v2-19081-2.zip",
      "uploadedUnix": "1340244522",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/7cc0d0e631070c4f76b1ea9c0387d9e349179f59d4d0e067beb5ba767b99fbe5/analysis/1406972642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thieves%20Guild%20Bats%20v2-19081-2.zip?fid=69306&ttl=1535786326&ri=8192&rs=8192&setec=a0aecce3f6afb6bd29dd0026e1faba88"
    }
  ]
}