{
  "modId": 19098.0,
  "modName": "Shockys Safe Chests",
  "summary": "A simple mod that adds 43 Safe Chests around the world for player to use that will not respawn.\r\nCheck out file for longer readme + locations.  (Shocky is steamname)",
  "descriptionHtml": "Readme for Shocky\\'s Safe Chests\r\nDragon89 on nexus, which is where I will update mod if that, happens.\r\n[img]http://i.imgur.com/m24Q6.png[/img]\r\nApproved by GEMS http://skyrimgems.com/\r\n\r\nA simple mod that adds 43 Safe Chests around the world for player to use that will not respawn.\r\nThey are not linked, so you have to remember where you store your stuff, but at least it will be safe! Btw I tested 4 different chests and waited for 1 and half game month to test them.\r\n\r\nFound around inns, marriage candidates with a living space that they can share, Jorrvaskr, your basic room at the Mage College, the Bards College, Skyhaven Temple and High Hrothgar. Last place also got a guest bedroll.  Fort Dunstad\\'s Inn and Drelas Cottage also got a chest each since they are quite suitable homes.\r\n\r\nChests are marked as player owned and to be ignored by npcs if all goes as planned. This will hopefully stop npcs going through your chest for food or weapon for a fight. Safe Chests are always the same looking except from their size (0,7-1). This was done to make sure they made no intrusion on at their locations. NOTHING else was moved to make way for them. I used one of the original safe containers in game and copied it.\r\n\r\nI know about the barrel behind/at side of Breezehome, however I felt the game cud use some more (safe containers) that was properly marked as SAFE to store your loot. I almost never used an inn etc. in the game since I don’t know what container is safe or not. Now you can count on finding a place to store your loot before start running up and down for a house.  That’s not in Whiterun!  No seriously, getting the same home for billionth time doesn’t make for fun gameplay. Of course you can get a house mod, but now the inns etc. have a slightly better service to provide you for free.\r\n\r\nInstall/uninstall:\r\nIt\\'s just an esp file, put it in skyrim/data folder and activate. /\r\nDeactivate, AFTER you have gotten your loot out of the chest(s) that you want to keep. Delete esp.\r\n\r\nCreation Kit info:\r\nID\tDelphineCopyShockysSafeChest\r\nName\tSafe Chest\t\t<<<Name you will see in game.\r\n\r\nRespawns? NO !\r\nOwner: Player\r\nContents: none\r\nNo Ai Acquire is on.\r\n\r\nCompatibility:\r\nEverything really, unless you got mods completely changing up the interiors of the following locations. Then I guess the chests might be looking a bit out of place. If they rename the cell, that’s a bit worse.\r\n\r\nLocations:\r\n\r\n-Winterhold Hall of Attainment (your room in Hall of Attainment)\r\n-Winterhold The Frozen Hearth (rented room)\r\n-Windhelm Viola Giordanos House, next to bed.\r\n-Windhelm Sadris Used Wares on top of wardrobe in bedroom.\r\n-Windhelm Candlehearth Hall (rented room)\r\n-Whiterun Uthgerd\\'s House second floor, next to bed.\r\n-Whiterun Ysoldas House close to the door.\r\n-Whiterun Jorrvaskr the shared room in the right corner.\r\n-Whiterun Jorrvaskr second chest in the boss room.\r\n-Whiterun Bannered Mare, (rented room)\r\n-Solitude Radiant Raiment inside bedroom, below window.\r\n-Solitude The Winking Skeever (rented room)\r\n-Solitude The Winking Skeever bedroom of the innkeeper.\r\n-Solitude Bards College Basement, along the corner before you come to the sleeping area.\r\n-SkyHaven Temple, armory, next to kantanas on the table.\r\n-Shors Stone Sylgjas House, next to bed by the wall.\r\n-Shors Stone Filnjars House, basement behind stairs.\r\n-Sarethi Farm on top of the wardrobe in the bedroom.\r\n-Rorikstead Frostfruit Inn, close to the rooms on left.\r\n-Riverwood Trader, second floor on top of the shelf.\r\n-Riverwood Sleepin Giant Inn, outside left rooms.\r\n-Riften Thieves Guild, left beds side as you enter first time, close to water.\r\n-Riften The Scorched Hammer, next to stairs.\r\n-Riften Romlyn Dreths House, left at the wall when you enter.\r\n-Riften Bee and Barb (rented room)\r\n-Old Hroldan Inn close to left side rooms.\r\n-Nightgate Inn (rented room)\r\n-Mor Khazgur Larak\\'s Longhouse, next to food table.\r\n-Morthal Moorside Inn (rented room)\r\n-Mixwater Mill Gilfres House. Top of the shelf.\r\n-Markarth Silver Blood Inn. (rented room)\r\n-Markarth Keep/Understone Keep, Smithing orcs room, on top of a shelf.\r\n-Markarth Hags Cure. In the back of the bedroom.\r\n-Kynesgrove Braidwood Inn (rented room)\r\n-Karthwasten Hall, basement behind stairs.\r\n-Ivarstead Vilemyr Inn (rented room)\r\n-High Hrothgar. Sleeping area, next to a bed. Added a guest bedroll here too. Sort of made sense of them to have.\r\n-Fort Dunstad The Stumbling Sabrecat, basement below stairs.\r\n-Falkreath Dead Mans Drink (rented room)\r\n-Drelas Cottage, under the stairs. (Used by people for housing by changing cell ownership)\r\n-Dragon Bridge Four Shields Tavern (rented room)\r\n-Dawnstar Windpeak Inn (rented room)\r\n-Angas Mill Aeri\\'s House, left on top of the shelf.\r\n\r\nYou are allowed to do pretty much anything with this mod as long as I ‘am getting credit. See a Safe Chest that might collide with another mod? \r\nOpen up the esp and remove the chest at that location. If you just want to move the chest elsewhere you can do it without loot disappearing while you are editing the esp. At least that’s what I experienced when I was a bit surprised by finding the test carrots in the safe chest after a esp edit.\r\n\r\nPs: Containers marked secured should have been in the game in the first place, at least at the inns. Which I btw think exist in a few bandit caverns with high-level locks, so I called mine safe.",
  "categoryId": "28",
  "version": "1.0",
  "author": "Dragon89",
  "createdUnix": "1340197706",
  "updatedUnix": "1340201302",
  "containsAdultContent": false,
  "uploadedBy": "Dragon89",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69195",
      "name": "Shockys Safe Chests",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24",
      "fileName": "Shockys Safe Chests-19098-1-0.rar",
      "uploadedUnix": "1340201302",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1ea36c96337c07abb5cd9699eaeb6f0e22061fa53b573af49973e185d431f566/analysis/1406971586/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shockys%20Safe%20Chests-19098-1-0.rar?fid=69195&ttl=1535786348&ri=8192&rs=8192&setec=780748e54efec8ae26def155c6b45bb6"
    }
  ]
}