{
  "modId": 19105.0,
  "modName": "divide and conquer",
  "summary": "(still in beta) this adds a epicly huge area to the game. as well to the skyrim map. once done it will give you days maybe even weeks of content to fight and conquer. what side of the new war will you choose? the dark clan warriors? or the chosen of talos? or will you simply kill them all? ",
  "descriptionHtml": "                                                      DIVIDE & CONQUER\r\n  (the file \\\"the void\\\" you will need dawn guard for that file to work, all others work without it)\r\n\r\nIntroduction\r\n\r\nDo you want to see Skyrim divided and brutal? Nation fighting Nation, Clan fighting Clan and Brother fighting Brother? A Skyrim which only You can unite?\r\nThis Mod aims to breathe new life in cave, castle and dungeon conquering. Focusing around two groups away from the Imperials and the Stormcloaks. The Dark Clan and Light Clan have been at each other’s throats for decades. No-one know why these two mercenary guilds have been at been fighting but everyone know it will only end with the others destruction.\r\nHowever Civil War rages on, the Companions are crippled by their curse and no-one would even trust the College for help. And on top of everything Dragons have been sighted and each blames the other for their return. So each side is praying for a hero who will help lead their righteous cause against the other. Will that be you? \r\n\r\nDevelopment\r\nAlong with some of my own work I have gotten permission from a few other Modders to have their own Mods include in this one. This Mod is still in development so if you want your Mod in this send me a link to your Mod and I will go through it and if I like it I will add it into this Mod.\r\n\r\nOnce all the land masses and outposts are done I will start to make the factions and have quests to join either faction to take down the other... \r\n\r\nSpecial Thanks\r\nDraco1122 for his Castle Draco Mod\r\n\r\nUpdate\r\nThere are a couple more outposts added to the mod, the screen shoots include  the biggest one so far, the other bigger one has been taken over BARDS LEAP SUMMIT. The 3 or 4 others I have made thus far I will be posted screen shots of their locations on the map.\r\n(email me with any queries or requests at ninvusoogoar@gmail.com )\r\n\r\ncoming really soon-\r\nok, not sure if anyone is still following this WiP mod, but i have good news with the release of dawn guard i am finally able to delete all my custom meshes and textures and use the soul cairns objects for the final realm to defeat or aid the dark lord and become king... yes that is right, HIGH KING of skyrim\r\n\r\nQ. hey! if i have an idea and want to tell you about it how do i reach you? \r\nA. i love having new ideas! i have several ways of contacting me, 1 way is ventrilo (ask me for the server info) my steam name is ninvusoogoar, my email for this site only is ninvusoogoar@gmail.com, remember any idea that will be added to this mod you will get a system message on this site saying congrats! you will be given full credit for said idea and a NPC will be named after you\r\n\r\nQ. when will you release something new bro?\r\nA. how about in by 8/25/2012 i will release more screenshots, bug fixes, lag issues, CTD problem fixes, and a sneak peak into the final realm simply known as \\\"The Void.\\\" \r\n\r\nQ are you really going to do everything that you say you will?\r\nA. i will do my best but alot of factors effect if it is all done or not, i might have real life problems, or simply a script just does not want to work right, but i can and i WILL give you (and my self :P) a epic new twist of the war and who is  controlling the outcomes of not only the civil war but the dragons now that aludin is dead and gone (hint hint)\r\n\r\n-8/25/2012\\'s content release?\r\nhere is a short list of the items i will spoil for you \r\n\r\n1) a sneak peak of a section of \\\"the void\\\" a plain of oblivion the dark lord has corrupted for a unknown plan, the leaders of skyrim turn to you to stop this dark lord before all are consumed\r\n2) now with dawn guard out for PC i will fully add the dawn guard and vamps into this conflict.\r\n-(hint)- how the factions will work is like how the factions worked in dragon age 1. and what i mean by this is, for the final battle you will need to do all the story quests that deal with these factions and solve their problems and they in turn will aid you in your fight to either defeat or defend this new evil -(hint)-\r\n3)will change and move some of the DCW outposts out of some spots due to being in popular modding area\\'s\r\n4) will finish the basics of the new city ( the DCW city on the road from whiterun to the base of the mountain to where you go up the 7k stairs for the way of the voice)\r\n5) new followers! from  a armored troll to a vampire lord ( this one might be a bit after the other content is out)\r\n6) will add caves/ruins and have a powerful boss guarding these places, the boss\\'es names will be those who endorsed this mod ( you have until 8/22/2012 to endorse for this part)\r\n7) new mounts/spells\r\n8) bug fixes, and hopefully fixed the crash to desktop glitch \r\n9) (optional and not lore friendly) will add divine weapons into random locations around skyrim and the beyond ( note these will be ingame items like a iron dagger but with better damage)\r\ni do this mostly for arrows and bow\\'s \r\n10) player houses will be added including a special mod i got permission to add to this mod find clues to its location in books and in hollow tree\\'s!\r\n\r\n\r\n \r\nQ. hey i found a game breaking bug how do i report this!\r\nA. same answer as the idea question, email me, message me on this site or on steam!\r\n\r\nQ. i found some incorrect spelling and grammer...\r\nA. going to stop you right there, (this is for when the new quests come out) the convo\\'s will be riddled with errors as i fiddle with the system, these will be place holders\r\n\r\nQ. i am good at modding and i want to help, is it possible for me to join your team?\r\nA. yes! help is always needed, it will make this mod come out so much faster. just message me how you want to help and what mods have you done. ___in need of more armor makers___ my 3D programs, and Photoshop don\\'t seem to work any more :(\r\n\r\n\r\n\r\nill use both in game factions and new factions in this mod in a much later update. but the dark clan warriors ( a tribute to my star wars galaxies guild) will be hostile to the good guys, but are also the largest merc clan. so say you go good side you have less enemies but they are larger and more supplied than the others, as if you went bad guy you will have a lot more enemies but they are not weak to the point you melt them like butter just, you know that saying, numbers overwhelm.\r\n\r\nfactions i will make or already have\r\n\r\nDCW (dark clan warriors led by me ninvus) *hint... have a defence against high lvl magics*\r\nLCW ( light clan warriors will be renamed to stendar\\'s hand)\r\nway of the dragon ( a surprise :D )\r\nLEGION ( army of undead and their master the high lich)\r\ndefenders of talos ( led by the god himself)\r\nknights of the nine\r\nand more...\r\nmisc------\r\n\r\nnew epic locations filled with hours if not weeks of awe and wonder.\r\nnew armors and weapons. the 2 armors i have in the bonus files are just a taste to come.....\r\n( this will be the last upmost update ill try to have up once this is all done).... the quests and NPC\\'s will be fully voiced acted by myself. \r\n\r\nfaction info--------\r\n\r\nDark CLan Warriors will have main bosses you will have to kill to get to the final boss. \r\n1) the fearsome 5 a band of DCW\\'s most elite assassins that controll dark clans hits\r\n2) dangowango, a madman who has remade the dwemer machines and turns them onto the foes of the clan\r\n3) me ninvus ( final boss if you go against the DCW) jack of all trades master of all. he will switch between magic/sword/ and the bow. careful he has all the other bosses specail powers/ attacks\r\n4) SOA, ninvus\\' greatest corruption, more info will be in a book in game when the time comes\r\n5) glorto embodiment of rage and power. he charges into battle with such strength he carries a 2h warhammer with 1 hand and a 2h AXE with the other\r\n5) more to come....\r\n\r\nstendar\\'s hand\r\n\r\n1) high commander and his trusted knights \r\n2) lord high mage can call apon the power of the gods for a short time... steer clear\r\n3 more to come....\r\n\r\n\r\nknights of the nine--\r\n1) the champion ( your main toon from oblivion )\r\n2) 2nd in command and the other knights\r\n\r\nlegion---\r\n1) high lich, he doesnt hit hard.... but the endless horde he summons will\r\n\r\ndefenders of talos----\r\n1) talos what man can compare with a god...\r\n2) talos\\' chosen\r\n\r\nway of the dragon---\r\nyou must first find them once the mod is near completion\r\n\r\n\r\n\r\nother mod that is for this mod (separated for testing)\r\nhttp://skyrim.nexusmods.com/mods/22306  the dread fortress, is for the undead faction",
  "categoryId": "89",
  "version": "V.2",
  "author": "ninvus",
  "createdUnix": "1340208602",
  "updatedUnix": "1340488109",
  "containsAdultContent": false,
  "uploadedBy": "ninvus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69218",
      "name": "DCW outposts",
      "version": "beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "650",
      "fileName": "DCW outposts-19105-beta.rar",
      "uploadedUnix": "1340208946",
      "modVersion": "beta",
      "virusScanUrl": "https://www.virustotal.com/file/89b399c4f8efa5dc995e96f777beb11edb7e80c26cb59fece2a68a4229ff2b1b/analysis/1406971751/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DCW%20outposts-19105-beta.rar?fid=69218&ttl=1535786358&ri=8192&rs=8192&setec=0392c587f8c6bfc2b199bc0f55eaaabc"
    },
    {
      "fileId": "69894",
      "name": "DCW outposts update 1",
      "version": "01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1815",
      "fileName": "DCW outposts update 1-19105-01.rar",
      "uploadedUnix": "1340484499",
      "modVersion": "01",
      "virusScanUrl": "https://www.virustotal.com/file/2289a92cd065962dea3d976d3fedee1cfd98e964abf0c6c985996403b94c4713/analysis/1406978633/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DCW%20outposts%20update%201-19105-01.rar?fid=69894&ttl=1535786359&ri=8192&rs=8192&setec=c974322e6f47029af2f20785628fb7e2"
    },
    {
      "fileId": "69900",
      "name": "DCW outposts update 2",
      "version": "0.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2082",
      "fileName": "DCW outposts update 2-19105-0-02.rar",
      "uploadedUnix": "1340488109",
      "modVersion": "0.02",
      "virusScanUrl": "https://www.virustotal.com/file/b716a42faf19ca3e6d40c50aeb0014d1a8ec14de83e7aad30d8f8e939f51b936/analysis/1406978766/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DCW%20outposts%20update%202-19105-0-02.rar?fid=69900&ttl=1535786359&ri=8192&rs=8192&setec=82ef9f44c5a459738f2233e5b817afa5"
    }
  ]
}