{
  "modId": 19122.0,
  "modName": "Dovagonian Races",
  "summary": "Fearing that the beautiful creatures of the sky, the Dovah, would forever be misunderstood as terrible beasts to be hunted and slain, Akastosh, the Dragon God of Time, decided to add a new species of humanoid to the Lands of Tamriel in order to act as intermediates between humanoid and Dovah. ",
  "descriptionHtml": "[img]http://skyrim.nexusmods.com/mods/images/19122-1-1340241094.jpg[/img]\r\n\r\nDovagonian Races \r\nby ElSte17\r\n\r\nNote: Please Read Important Information below the Descriptions.\r\n\r\nA High Resolution Texture Pack optional file will be uploaded soon. (Recommended)\r\n\r\nThis mod might require the RaceCompatibility.esm --- If the mod isn\\'t working and you don\\'t already have it, try using it by getting it here\r\nhttp://skyrim.nexusmods.com/mods/10165\r\n\r\nDescription\r\n\r\nFearing that the beautiful creatures of the sky, the Dovah, would forever be misunderstood as terrible beasts to be hunted and slain, Akastosh, the Dragon God of Time, decided to add a new species of humanoid to the Lands of Tamriel in order to act as intermediates between humanoid and Dovah. \r\n\r\nDovagonians: \r\n\r\nThe Dovagonians (Dragonians), as can be seen by their lack of special prefix, were the original diplomats created by Akatosh. They are the most cunning of their species and at this point mostly immersed themselves in traditional humanoid life. \r\n\r\nExcel in: Speech Racial Spell: Fire Breath\r\n\r\nVul-Dovagonians:\r\n\r\nThe Vul-Dovagonian (Dark Dragonians) hail from the lands of Morrowind and were created to help their fellow native Dunmer become accustomed to the dragon species. They excel at camouflage and sneaking and mostly keep to the forests.\r\n\r\nExcel in: Sneak Racial Spell: Ice Breath\r\n\r\nIiz- Dovagonians:\r\n\r\nThe Iiz-Dovagonian (Ice Dragonian) are on of the species of Dovagonian native to Skyrim. They are a nomadic species, very small in number, that live in camps and caves high up in the northern mountains. They are known to be quick and have the ability to breathe a lesser form of a true dragon\\'s frost breath. Furthermore, their bodies are coated with a thin layer of ice that acts as additional light armor.\r\n\r\nExcel in: Light Armor Racial Spell: Ice Ball Breath\r\n\r\nFeykro-Dovagonian:\r\n\r\nThe Feykro-Dovagonians (Forest Dragonians) are forest dwellers and are natives of Black Marsh. They found it easy to befriend the Argonian race, being reptilian themselves, and have since lived side-by-side with them in the swamps. They have vast knowledge of plants and ingredients and have developed a knack for alchemy. \r\n\r\nExcel in: Alchemy Racial Spell: Fire Ball\r\n\r\nIMPORTANT INFORMATION:\r\n\r\n\r\nWhen choosing your race in the race menu, things might be a bit weird. You cannot customize the dragon\\'s head, you can only choose the race. \r\n1. MAKE SURE TO CHOOSE THE SMALLEST BODY SIZE OR YOU WILL HAVE A HOLE IN YOUR NECK AREA!!!\r\n2. Feel free to adjust your skin tone.\r\n3. Do not edit anything except the body size (set to smallest) and the skin tone.\r\n\r\nPlease report issues with this if you don\\'t see them already listed in the bugs below.\r\n\r\nThe first person bug has been fixed.\r\n\r\nKnown Bugs that can easily be fixed if reported:\r\nArmor/clothing not showing up (invisible)\r\n\r\nOther unsolvable issues due to the nature of the mod (custom meshes):\r\nHelmets,hoods, anything on the head will not fit properly on a dragon\\'s head. If you can\\'t cope with not wearing your precious little custom helmet or something, this mod isn\\'t for you. If you try to equip anything on your head, it will not show up, but I believe you will still get the armor rating/effects. Please report if this is true. If you really want to wear a helmet regardless of clipping issues, let me know and I might just let people equip them.\r\n\r\nNOTE: This mod IS COMPATIBLE with custom armor. Here\\'s how to enable it:\r\n\r\n1. Go into the Creation Kit and open up the DovagonianRaces.esp (set it as the Active File, with Skyrim as the Master File).\r\n\r\n2. In the object window, go to items--- armor addons.\r\n\r\n3. Scroll down and find the custom armor that you want to use.\r\n\r\n4. Double click on the armor and an editing window will open up.\r\n\r\n5. On the right side of the window there is an \\\"additional races\\\" box. Look for the Dovagonian races (named DragonianRace, DragonianRace_blue, and DragonianRaceSnow) and click on each of them so that they are highlighted.\r\n\r\n6. Click ok, save, and exit. The armors should now be equippable. If you are having trouble ask in the comments section.\r\n\r\n\r\n\r\nThumbs up if you like it.\r\n\r\n\r\nThis mod might go great with my other mod, Flyable Dragon Races Revamped\r\nhttp://skyrim.nexusmods.com/mods/17178",
  "categoryId": "34",
  "version": "1.0",
  "author": "ElSte17",
  "createdUnix": "1340240745",
  "updatedUnix": "1340242051",
  "containsAdultContent": false,
  "uploadedBy": "ElSte17",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69298",
      "name": "Dovagonian Races 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12513",
      "fileName": "Dovagonian Races 1_0-19122-1-0.rar",
      "uploadedUnix": "1340240977",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/67ad210eb4cda7fdbf29a888518704851dad503865f7ba5476ae19a25d7c641a/analysis/1406972529/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovagonian%20Races%201_0-19122-1-0.rar?fid=69298&ttl=1535786383&ri=8192&rs=8192&setec=5a0f65b2298379708ec1b8f869bbd03c"
    },
    {
      "fileId": "69304",
      "name": "High Res Texture Pack ",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "42597",
      "fileName": "High Res Texture Pack -19122-1-0.rar",
      "uploadedUnix": "1340242051",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0441f194d1f98528d6e25010b84235e331d8c6b05514f5b3cbda3ee22e465bcd/analysis/1406972596/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/High%20Res%20Texture%20Pack%20-19122-1-0.rar?fid=69304&ttl=1535786384&ri=8192&rs=8192&setec=ed4813f597544b9e4fc232183e5d4c78"
    }
  ]
}