{
  "modId": 19138.0,
  "modName": "Midget Follower",
  "summary": "A small follower within skyrim that fights with 2 magic spells ",
  "descriptionHtml": "First Mod so for some reason he walks around with a bow & Arrow for default but he does indeed fight with the Flame & Sparks magic spells that will help you quite A Lot and he is Lv. 5 with a bit more advanced health and is in capable of dieing like most important NPC he will fall to his knee and catch his breath before returning to his feet and continuing with the fight. He is Located in Riverwood inside the \\\"Riverwood Trader\\\" he most likely will be wondering around the first floor and he has been know to give you free items as you enter the building. Just walking up to him and talking to him you will see the speaking option \\\"Follow me I need your help\\\" select it and there you are you have your midget follower. There will be updates in the future so....Look forward to them and to install just Place the .Esp file inside you skyrim directory C:\\\\ Program Files x86\\\\Steam\\\\Steam Apps\\\\Common\\\\Skyrim\\\\Data \r\nthere you go. Oh, By the way His name is \\\"Ta-kun The Gental\\\" which he is far from with his fierce Duel Spell Attack so have fun\r\n\r\n",
  "categoryId": "33",
  "version": "1.0",
  "author": "Konyo95",
  "createdUnix": "1340258304",
  "updatedUnix": "1340258673",
  "containsAdultContent": false,
  "uploadedBy": "Konyo95",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69353",
      "name": "Midget Follower",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Midget Follower-19138-1-0.zip",
      "uploadedUnix": "1340258673",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/872ac2e2e5df39e5647f3b36b9b4d34d024138097c3199c16617e54539a264dc/analysis/1406972944/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Midget%20Follower-19138-1-0.zip?fid=69353&ttl=1535786411&ri=8192&rs=8192&setec=9ca54ad7ab9d6c8af0cac8ffdad651c8"
    }
  ]
}