{
  "modId": 19135.0,
  "modName": "Chuvakin - Oblivion to Skyrim Plugin Converter",
  "summary": "Convert your TES4 plugins into TES5 plugins!",
  "descriptionHtml": "\\\"Chuvakin\\\" converts your Oblivion plugin to a Skyrim plugin. The program is very very alpha right now, but you can see for yourself what it can convert over. Since it\\'s alpha and still being developed, a lot of things from your Oblivion esp will not convert over yet. Anry Narleyn, our Professional Russian developer explains:\r\n\r\n\\\"Most of main object types are converted, except these:\r\n\r\nPGRD, ACHR, ACRE, DIAL, INFO, ANIO, ROAD, GMST, GLOB, CLAS, FACT, HAIR, EYES, RACE, SOUN, SKIL, MGEF, SCPT, LTEX, ENCH, SPEL, BSGN, SGST, BSGN, SKIL, APPA, ARMO, CLOT, CONT, GRAS, TREE, FURN, WEAP, AMMO, NPC_, CREA, LVLC, ALCH, SBSP, LVLI, WTHR, CLMT, REGN, INGR, MGEF, WATR, EFSH, ACRE, ACHR, ANIO, CSTY, PACK, IDLE, QUST, LVSP, LSCR \r\n\r\nLet me describe what is listed here.\r\n\r\n1. Some items could not been translated (or don\\'t need to be) because of new engine general design, new graphics, new gameplay features. They are: Gameplay settings, global values, loading screens, roads and pathgrids, sounds, sigil stones, scripts, subspaces, apparatuses, weather and climate, regions, everything that is related to magic, effects and shaders, water types, land textures (that\\'s pity); and everything related to NPCs and creatures, including: birthsigns, races, hairs, eyes, skills, factions and classes, combat styles, ai packages, idle animations, animated objects, character and creatures references.\r\n\r\n2. Some items translation code is ready for now but it have some bugs so it don\\'t work as it should. It is LANDs and, in general, the exterior cells conversion code. (We have translated the references and the one Tamriel cell\\'s land though).\r\n\r\n3. Some other items are skipped now, because there is no code for their translation, but it can be done without really big problems. They are armor and clothing, ammo, weapons, maybe alchemy and ingredients, furniture (it will require new models though).\r\n\r\n4. Trees cannot be translated but we will replace them with skyrim tree, saving the original object editor ID, so you could easily replace needed trees later with \\\"Find and Replace\\\" function in the CK.\r\n\r\n5. Pathgrids cannot be translated into navigational meshes. You will have to generate them using CK, it is not too difficult task.\r\n\r\n6. We don\\'t see any simple way to convert quests, dialogues and scripts at the moment.\r\n\r\nI need someone who is proficient with hex-editors to check and verify files that Chuvakin produces. If everything will be ok, we will have working converter in 1-2 weeks. \\\"\r\n\r\nBUGS: Land works to a certain extent, but giant holes may appear (cells in which LAND did not convert). \r\n\r\n====================================================================================================================================================\r\n\r\nChuvakin was made by a Professional Russian named Anry Narleyn from Project Andoran. You can check out the project here.\r\n\r\nhttp://andoran.com/\r\n\r\nAs just mentioned, THIS PROGRAM WAS NOT MADE BY ME! I AM JUST POSTING IT HERE FOR YOUR USAGE. I will not support trouble shooting or accept requests.\r\n\r\nI will, however, update this file listing as newer versions of the converter are made available.\r\n\r\nTHIS PROGRAM IS OPEN SOURCE! You can edit it and improve it. Read the included Readme for details.\r\n\r\nAND BEFORE ANYONE GETS THEIR PANTIES IN A TWIST, LET ME MAKE THIS CLEAR: YOU ARE RESPONSIBLE FOR HOW YOU USE THIS, NOT THE CREATORS. BETH DOES NOT LOOK FAVORABLY UPON CONVERTING MORROWIND AND SURE AS HELL OBLIVION (no pun intended hehe). DO NOT TALK ABOUT SUCH CONVERSIONS HERE. This is intended for your personal use, to convert Oblivion mods to work in Skyrim.\r\n\r\nALSO NOTE THIS IS NOT A MODEL CONVERTER. Your models will be placed where they were in Oblivion and will retain the same file paths, you just have to put your Skyrim models and textures in the appropriate folders in your Skyrim/Data folder.\r\n\r\n========================================================================================================================================================\r\n\r\nAnd as always, have a nice day.",
  "categoryId": "82",
  "version": "0.95",
  "author": "Anry Narleyn - PROFESSIONAL RUSSIAN - and Project Andoran",
  "createdUnix": "1340255813",
  "updatedUnix": "1342589388",
  "containsAdultContent": false,
  "uploadedBy": "robertneville777",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69400",
      "name": "Chuvakin - Program Only",
      "version": "0.94",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "77",
      "fileName": "Chuvakin - Program Only-19135-0-94.7z",
      "uploadedUnix": "1340287091",
      "modVersion": "0.94",
      "virusScanUrl": "https://www.virustotal.com/file/a955bc4ffd4e57b2d7debe30220597fda26fb970885a9e1ee8de8a28c406ccda/analysis/1406973603/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chuvakin%20-%20Program%20Only-19135-0-94.7z?fid=69400&ttl=1535786405&ri=8192&rs=8192&setec=71d29bfa6457e5e77cd70bfbf763ec27"
    },
    {
      "fileId": "69533",
      "name": "Chuvakin - Source Code",
      "version": "0.94",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "104",
      "fileName": "Chuvakin - Source Code-19135-0-94.7z",
      "uploadedUnix": "1340330992",
      "modVersion": "0.94",
      "virusScanUrl": "https://www.virustotal.com/file/8d6a63c3711c6759794a1bde102e12092d904244029ab2d186a519874b634bbf/analysis/1406974954/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chuvakin%20-%20Source%20Code-19135-0-94.7z?fid=69533&ttl=1535786405&ri=8192&rs=8192&setec=ed0b6f9b6911442c1d8d2ba3898dd1b5"
    },
    {
      "fileId": "75024",
      "name": "Chuvakin - Program Only",
      "version": "0.95",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "349",
      "fileName": "Chuvakin - Program Only - Most Recent Version-19135-0-95.7z",
      "uploadedUnix": "1342588948",
      "modVersion": "0.95",
      "virusScanUrl": "https://www.virustotal.com/file/0f90bf6321175287f2148f77af15a0deec5395da4e617ef7e0487fe93f54fab7/analysis/1407030304/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chuvakin%20-%20Program%20Only%20-%20Most%20Recent%20Version-19135-0-95.7z?fid=75024&ttl=1535786406&ri=8192&rs=8192&setec=9c9ebf180517ad7654774df2ce767d42"
    },
    {
      "fileId": "75026",
      "name": "Chuvakin - Source Code Main File Only",
      "version": "0.95",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "19",
      "fileName": "Chuvakin - Source Code Main File Only-19135-0-95.7z",
      "uploadedUnix": "1342589388",
      "modVersion": "0.95",
      "virusScanUrl": "https://www.virustotal.com/file/1cf953ece1da22393c55e5f26554ea788c035c58c34ee37ee74d4d3a856c99ac/analysis/1407030305/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chuvakin%20-%20Source%20Code%20Main%20File%20Only-19135-0-95.7z?fid=75026&ttl=1535786406&ri=8192&rs=8192&setec=eaba592fb276258a1fd561c0a74392b2"
    }
  ]
}