{
  "modId": 19167.0,
  "modName": "Skyrim Factions Expansion Project",
  "summary": "This mod will improve your experience in Skyrim.",
  "descriptionHtml": "For now this mod just add minor changes to Skyrim. But this is huge project though, and will always add many features in the future.\r\nFor now the new features is :\r\n\r\n\r\n- Firewood trade\r\nThis is good for you who likes smithing. Now you can trade firewood for ores. There\\'s few miners who will trades your firewood for their ores. Example, one firewood for two iron ores (the value is approximately equal) etc.\r\nThe miners are in each of the mining town such as Shor\\'s Stone, Dawnstar, Karthwasten, etc. But there are few too in some towns and cities.\r\n\r\n\r\n- Leather Buyer\r\nAnd this is good for fellow hunters. Now you can sell leathers for its base price. It just like chopping wood quest where you can sell firewood for its base price. But this is leather instead. There\\'s few hunters who will buy your leathers in almost all towns and major cities.\r\n\r\n\r\n- Merchant\\'s Smith\r\nHere\\'s another good one for blacksmiths. There\\'s some merchants who will give you job to craft armors for they to sell. And the price is exactly same for the armors, and the materials are on your own. But this is good for add little money and increased your skill.\r\n\r\n\r\n\r\n\r\nFor now it just add this. But really like I said, this is huge project and in the future I will add more factions and guilds for Blacksmith, Paladin, Hunter, and many more. And curently still in the proggress. \r\nAnd you ask me why upload this now? Because of I want to you know that I\\'m curently making this. And this is my first mod, AND I work ALONE. So for everyone who kind enough to join me and want to teach me more things, please let me know. There\\'s still too much for me to learn.\r\nAnd please report if you encounters any bugs or problem.\r\n\r\n\r\n==Expansion Project===\r\nv1.0\r\n======================\r\n\r\nSkyrim Patch 1.6 iS NEEDED, TO AVOID ANY ERRORS OR BUGS!!!\r\n\r\nInstallation :\r\n\r\n- Just extract/decompress everything in ../Skyrim/Data/\r\n\r\n\r\n=====================\r\n\r\nv1.0\r\n- Added 3 new smith merchants (Who will give you smith job) in every inn in Ivarstead, Markarth, and Windhelm\r\n- Added 4 new miners (who will barter their ores for your firewood) in Riverwood, Left-Hand mine, Dawnstar, and Shor\\'s Stone.\r\n- Added 4 new hunters (who will buy your leathers for base price) in Riverwood, Falkreath, Whiterun, Morthal, and Riften.\r\n- Added 3 new citizen in Riverwood.\r\n- Added one smelter and ore vein in south gate of Riverwood\r\n\r\nFuture Updates :\r\n- More smith merchants, new caravan, and possibilities a merchant guild.\r\n- More Hunters, and possibilities Hunter guild.\r\n- More trade Miners\r\n- A Paladin Guild\r\n- A Courier Guild\r\n- A Blacksmith Guild\r\n- More citizen in every towns and cities to make more liveable.\r\n\r\nPlease, always stay tune. I know it\\'s not much right now. But if you like it, it will inspired me to\r\nwork more hard in this mod and gives you the better mod every now and then.\r\n\r\n\r\n------------------\r\n\r\nWant join me? Please, feel free to message me.\r\nHere\\'s the upcoming work to do :\r\n\r\n====Paladin Guild (White Knight)=========\r\nWhite Knight is Paladin Guild who despised undead in any form, in the name of Meridia\\'s.\r\nDisease has roaming skyrim. The undeads roaming at night and attacking town and cities.\r\nIn the name of daedra princess of Meridia, they are sworn to despised them\r\nAlthrough White Night are despised undeads, they are enemy of Vigilant Stendarr because of\r\nthey worshipping daedra.\r\n\r\n\r\n==Blacksmith Guild (Deep Forge)=========\r\nDeep Foge is blacksmith guild in the deep of Nordic ruins. It\\'s opposite of Skyforge.\r\nThey are warriors who sworn to only wear their own crafted Armors, and only use their\r\ncrafted weapons in battles. Their forges is their soul. And their own armors and weapons\r\nare their own brothers in battle. Not only that, they supplied most of the merchant\\'s\r\nweapons and armors stocks in Tamriel.\r\n\r\n\r\nAnd of course there are more..\r\n\r\nI\\'m a student of high school in Indonesia, and curently working alone in this mod.\r\nSo, I will gladly appreciated for you who want join me in this mod and teach me few things.\r\nPlease message me if you are interesed.\r\n\r\n\r\n=================================================\r\nPLEASE ENDORSE ME IF YOU LIKE THIS MOD, THANK YOU.\r\nYOU ARE MY INSPIRATION.\r\n=================================================\r\n\r\nAnd please report if you encounter any problems or bugs. \r\n",
  "categoryId": "25",
  "version": "v1.0",
  "author": "Redzerocode",
  "createdUnix": "1340291427",
  "updatedUnix": "1340464808",
  "containsAdultContent": false,
  "uploadedBy": "Redzerocode",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69839",
      "name": "Expansion Project",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "56",
      "fileName": "Expansion Project-19167-v1-0.zip",
      "uploadedUnix": "1340464808",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/64645ea672b9fcca8a3dc1ad26e94e777af9549e0cf9b7871f5f4c0e1af5f253/analysis/1406978109/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Expansion%20Project-19167-v1-0.zip?fid=69839&ttl=1535786447&ri=8192&rs=8192&setec=c9631b996e451928bfb7966c4fa324a7"
    }
  ]
}