{
  "modId": 19177.0,
  "modName": "Damsella -Faerie Goddess of the Marsh-",
  "summary": "This mod adds a faerie companion into your game. She is part supernatural being and part Blue Dartwing dragonfly. She is the protector of marsh creatures and insects and as such is worshiped by them. Damsella\\'s body scale  is okay for ADEC, UNPB and CBBE with BBP.",
  "descriptionHtml": "[CENTER][IMG]http://skyrim.nexusmods.com/mods/images/12989-1-1340306319.jpg[/IMG][/CENTER]\r\n\r\n[font= timesnewroman][b][size= 6][center]Damsella -Faerie Goddess of the Marsh[/center][/b][/size][/font]\r\n\r\n[font= timesnewroman][b][size=4][color=cornflowerblue]Damsella is a classic style faerie/fairy that my 7 year old son created because he loved my other faerie and imp characters. She is a strong level 40 character and you may want to choose the Auto-Level version if you are worried about game balance. Damsella uses wing from Luba SkyWings that are familiar to dragonflies and damselflies. She is constructed to play nude but for obvious reasons she is wearing a bikini in my screenies. Like the characters I created his character can handle a lot of damage before she  uses her restoration powers, especially if you chose the Calculated Level 40 version.[/b][/size][/color][/font]\r\n\r\n[font= timesnewroman][b][size= 4][color= seagreen]\r\nRace: Breton\r\nVoice: Female Young Eager \r\nHair: Light Green\r\nSkin and Makeup: Medium Blue skin tone to mirror a Blue Dartwing dragonfly, warpaint and makeup to correspond with her wings and eye color. \r\nEyes: Green\r\nWeight: 55 at the scale. If you use ADEC, UNPB or CBBE bodies with BBP she should be fine.\r\nHeight: 33 to 36 inches tall\r\nLocation: Morthal, Moorside Inn\r\nSpeed: Her speed has been doubled to enable faster follower travel and unearthly style Mage combat!\r\nFlight: Nope she cant fly, I am just waiting and hoping for a real flight mod after the release of the Dawnguard DLC. I will update this file accordingly. \r\nPowers: She is mostly a magic based character and has a couple surprises in her arsenal... :)\r\nInventory: Glass Dagger of Devouring and no clothes (Nude, the way faeries should be!)\r\n\r\nRequired Files:\r\nHair: Hair packs of TES IV Oblivion http://skyrim.nexusmods.com/mods/18110 I recommend manually installing version 1 dot 1 and its corresponding ESM file. I have had great luck with its stability so far (even using the racemenu).\r\nLuba SkyWings by Matthieu Pinsonneault\r\nhttp://skyrim.nexusmods.com/mods/11621\r\n[/b][/size][/color][/font] \r\n\r\n::::Obliivion Hair Pack Fix::::\r\nFix for those having issues with Oblivion Hairs: \r\n\r\nWhen using \\\"Hair packs of TES IV Oblivion\\\" you need the older files: Hair Pack 1 dot 1 and Hair Pack ESM file 1 dot 1 (do not use the others) I found this is the only working version as far as being able to make them work with my PC and NPC\\'s. Load order is very important. You must have the Oblivion hairs installed first and then install ApachiiSkyhair. If you do not have them in the right order you will get a hairline clash on the first 7 to 9 Oblivion hairs. I would recommend that you save both files to your PC/Downloads because who knows if the author will come back and wipe out his mod files one day. Also do not mess with PART TWO of his hair packs!!! Please just use the two files mentioned above! \r\n\r\nInstallation: Install the TESIV Hairpack through NMM and download the ESM into your Downloads file and unzip it. (The reason for this is that when you have finished the manual portion of this install the NMM will work for removal.) Then download the file manually place the ESM file into your Skyrim Data folder. I truly believe that you still need the ESM even if you aren\\'t modding characters. (At least with his mod). I would also make sure that the esp is in your plugin list. \r\nYou need to go back and install the Hair Pack portion of his mod manually. The reason for this is that the author did not path these files to textures and meshes he only zipped all the folders together (He should have removed the NMM option and just stated that these needed to be installed manually). If you create characters you still need to have Oblivion Hairs file folder in the meshes main folder. (When you click on meshes in the Data Folder you should see a folder that says Oblivion Hairs.)\r\n\r\nJust make sure you copy and paste each folder so that it rests next to the Apachii Hair file in both your Skyrim Data Meshes and Textures folders. Try your game now! I haven\\'t had any issues since I figured this out. \r\n1. C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\meshes\\\\actors\\\\character\\\\character assets\\\\hair\r\n2. C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\textures\\\\actors\\\\character\\\\hair\r\n\r\nNote: You cant run Apachii, Oblivion and Fallout hairs at the same time (too many hairs for the game to handle). It could also possibly break your game\r\n\r\n[font= timesnewroman][b][size=4][color=cornflowerblue]Adding Wings:\r\nUse console command \\\"Help Luba\\\" to get the item number. To permanently equip her wings type in console \\\"equipitem\\\" and then the item number and 1 (equipitem xxxxxxx 1) and they will be on her permanently so when you release her and go find her again you don\\'t have to wait for her to reequip them.\r\n\r\nMaking her stay at your current location: \r\n\r\nIt is possible to make her stay where you leave her. Since I don\\'t use the CK it is a little more involved but I have incorporated this option into her AI. You have to find her and make her your companion, then travel away from Dead Man\\'s Drink to a place like Breezehome, a cave etc. Save your game now. Reload her in the NMM or better yet re-install her manually from the zipped file, I recommend the latter. Just copy and paste her esp and bsa files to your Skyrim Data folder and overwrite when prompted. She should now stay where you leave her. \r\n[/b][/size][/color][/font]\r\n\r\n[b][size= 2][color= ghostwhite]\r\nOptional Files: To make her look like she does in my images\r\nEyes: Pretty Eyes by pikkatze http://skyrim.nexusmods.com/mods/3424  \r\nI used Bella\\'s Better Females, Makeup variant 1 and No Shine (some pics) on her\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2812\r\nPretty Lips by Danariel\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=1167\r\nExpanded Jewelry Crafting by lautasantenni\r\nhttp://skyrim.nexusmods.com/mods/8361\r\nRemodeled Armor CBBEv3M by MAK\r\nhttp://skyrim.nexusmods.com/mods/13004\r\nKaw Claws-Colored Long Nails by kaw - The black fingernails she is equipped with (replaces gauntlets)\r\nhttp://skyrim.nexusmods.com/mods/5910\r\nHer body in my images is CBBEv3 with Navetseas body \\\"Feminine Arms and Toned Abs\\\" textures. (She can be used with whatever body you prefer) (GlossTech V5 \\\"No Shine\\\" used in some pics)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6554\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2666\r\n[/b][/size][/color]\r\n\r\n[size= 4][b][color= red]Hair packs of TES IV Oblivion is required![/b][/color][/size]\r\n\r\n[b]Thanks for checking out my sons mod and please comment or endorse her if you like her! :) \r\n\r\nRegards,\r\n\r\nFB and BB[/b]",
  "categoryId": "66",
  "version": "1.0",
  "author": "BunnyBeans",
  "createdUnix": "1340303805",
  "updatedUnix": "1340307235",
  "containsAdultContent": false,
  "uploadedBy": "FalmerBane",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69467",
      "name": "Damsella -Faerie Queen of the Marsh- Auto-Level  ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "630",
      "fileName": "Damsella Auto-Level Version-19177-1-0.7z",
      "uploadedUnix": "1340307159",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bfabd4c42cfc9607c74bc668a2b3079844ee1e8f72c5984e410d0e18750396e2/analysis/1406974208/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Damsella%20Auto-Level%20Version-19177-1-0.7z?fid=69467&ttl=1535786467&ri=8192&rs=8192&setec=152a371b06850c1026874b746a9861ed"
    },
    {
      "fileId": "69468",
      "name": "Damsella -Faerie Queen of the Marsh- Calculated Level 40  ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "630",
      "fileName": "Damsella Calculated Level 40 Version-19177-1-0.7z",
      "uploadedUnix": "1340307235",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ed81bdd6731565613167f453fe68ff9a540b6c2fc634cbd074aeb53ad4be73bd/analysis/1406974210/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Damsella%20Calculated%20Level%2040%20Version-19177-1-0.7z?fid=69468&ttl=1535786467&ri=8192&rs=8192&setec=265bda57196122135843da16028e9018"
    }
  ]
}