{
  "modId": 19196.0,
  "modName": "Alchemy Redux",
  "summary": "Alchemy total remake incorporating many new insects, fish, and textures.",
  "descriptionHtml": "IF YOU PLAY THIS AND LIKE IT ENDORSE SO OTHERS CAN ENJOY IT TOO!!\r\n\r\nversion 2.0: Make compounds ANYWHERE!  Diffuse and Extract from your inventory!\r\n\r\nGeneral changes: Removed the diffusers, and extractors from the tables and made them craftable in the forge in the misc. section.  There are new models using a mortar and pestle, and an alembic.  Once you craft them and they are in your inventory they will no longer appear in the crafting menu of the forge to avoid clutter. \r\nThe Diffuser and Extractor work the same except that to activate them you just select it in your inventory menu, then when you exit your inventory the Diffuser or Extractor menu will appear. They will be in your Misc. section and named to stay near the top.\r\n\r\nBalance changes:  Modified effects of Volatile Agony, Volatile Affliction, Cripple, and Doom..  previously the lingering damage was FAR to high due to a misunderstanding of the effect. Now they do about 75% less and for half the time. Made a slight increase to experience gained as higher levels were coming a touch slower than I wanted. I\\'m still playtesting with the mid-to-high level potions and May do some slight tweaks for 2.1. depends on user feedback and playtesting.\r\n______________________________________________________________________________\r\nRequirements: \r\nRadiant and Unique Potions and Poisons HD Glowing Version\r\nhttp://skyrim.nexusmods.com/mods/18799\r\nLoad my esp after this so you get the nice potion textures!\r\n______________________________________________________________________________\r\n\r\nFirst ill say I put hundreds of hours into this over the past few months.\r\n\r\nAlchemy overhaul with new potion bottles by exray catt, new insects by 83Willow, and new fish by Blitz54.\r\n\r\n----------------------------------------------------------------------------------\r\nInstallation:   Drop the files in Skyrim/Data folder, check the boxes in loader...etc you know the drill.\r\nWill load into an old save but due to the perks changes your alchemy perk tree may be wonky...so I recommend a new playthroughs OR any save that hasn\\'t invested in alchemy perks yet.\r\n----------------------------------------------------------------------------------\r\n\r\nALCHEMY REDUX 2.0\r\n\r\nAlchemy Poison Diffuser-- Extract harmful compounds from ingredients.\r\n\r\nAlchemy Essence Extractor-- Extract helpful compounds from ingredients\r\n\r\nCompounds are powders, fluids, or crystals you combine at the alchemy table to make potions.\r\n\r\nYou can also break down potions you find in game (including frost spider venom!) into compounds  so they dont clutter up your inventory. The more powerful the potion the more compound it yields. More potent ingredients also yield more compounds.\r\n\r\nCompounds are useless themselves unless made into potions or poisons on the alchemy table.  \r\nYou will see the compound requirements for potions similar to ingot or leather requirements at the smithing forge.\r\n\r\nEnjoy classic favorites such as: Cripple, Alchemist fire, frost, and spark..... Use a volatile poison that mute\\'s an enemy mage, or exhausts a warrior!  Use stimulants to give yourself powerful boosts for a time!  Roughly 30 recipes to learn as you gain perks in the alchemy tree.\r\n\r\nMake a pure alchemist character and you should do just fine! Now you will want to gather those ingredients and search out ingredients for missing compounds!  You can extract compounds from potions you find to use the parts for YOUR OWN more powerful potions.\r\n\r\nI put a lot of work into making this as balanced as possible.  The effects are powerfull and scale better than most things, but this is because the effects are for a limited time or 1 use.  Use your potions when you need them because you don\\'t want to need them and not have them!\r\n\r\nFor balance reasons I removed the enchantment/alchemy infinate power loophole.  Alchemy bonuses to enchanting and smithing are now capped (to 30% and 60% respectively)\r\n\r\nYour table at first has very few recipes available... merely a heal potion and a damage poison.\r\ncommit with your first perk to learn all ingredient effects and expand your recipe repertoire!\r\n\r\nYour second perk \\'physician\\' gives you recipes like the doctor ordered! Make a potion to fortify YOUR playstyle!!  These recipes will cover every major character archetype! I wont spoil them all here but they are impactfull, balanced, and fun!\r\n\r\nThen pick a path in the perk tree.  Focus on potions, focus on poisons, or choose BOTH!  Later the paths merge to \\'experimenter\\' perks to get the more utilitarian recipes.  Your final reward for the \\'Purity\\' perk unlocks the ultimate recipes for Haste, Doom, and Elixer!!!!  These take a lot of compounds and alchemical knowledge to produce but the effects of one of these potions will change the outcome of a battle dramatically!\r\n\r\nYou will find that alchemy takes some work and gathering but is very rewarding!  The leveling now is in line with your other skills...You can level it up yourself and not have to depend on expensive skill trainers or outright cheating. You can ignore a weapon perk tree and focus on alchemy and still be threatening!\r\n \r\nThere is so much in here I went with the BSA route so if ya dont like it you just rip out 3 files and your done.  \r\nThe size is due to textures for all the games potions, and dozens of new ingredient-creatures and compounds.\r\n\r\n\r\n................................................FUTURE PLANS.....................................................\r\n                       Incorporate a \\'Philosopher Stone\\' mechanic into the snakeblood perk(rename perk to match)  by using filled soul gems. Use alchemy to turn soul gems into bloody red philosopher stones. These (if I choose to do this) will be able to substitute all the compounds for an advanced potion of your choice.  Also letting you combine several lesser filled soul gems into greater ones as only a grand soul gem can be made into a philosopher stone.\r\n                      Dig through the alchemy recipe notes of the vanilla game and flavor them to the new alchemy system for that extra touch of immersion and seamlesness into the game.\r\n----------------------------------\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n...now you DONT NEED the following 2 mods as I had to integrate them for them to function.  However if you already have them thats fine just load Alchemy Redux\\'s esp after them.\r\n\r\nFully functional with the wonderful  83Willows 101BugsHD!!\r\nhttp://skyrim.nexusmods.com/mods/4955\r\n.\r\n.\r\nIncorporates select species from: Improved Fish - New Fish - More Spawning!!\r\nhttp://skyrim.nexusmods.com/mods/14320\r\n\r\nConflicts obviously include anything trying to mess with your alchemy perk tree.  I didn\\'t change any form ID\\'s for maximum compatibility.  \r\n\r\nReport any weirdness on the chat here as i\\'ll be keeping this up to date with minor fixes and tweaks.\r\n",
  "categoryId": "79",
  "version": "2.0",
  "author": "vincent7valentine7",
  "createdUnix": "1340330418",
  "updatedUnix": "1341417583",
  "containsAdultContent": false,
  "uploadedBy": "vincent7valentine7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69532",
      "name": "AlchemyRedux1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23044",
      "fileName": "AlchemyRedux1_0-19196-1-0.rar",
      "uploadedUnix": "1340330768",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/50ffe111a94174f3383b3a5ee2571d37f831e1cf70989174d40851b7b517303d/analysis/1406974954/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AlchemyRedux1_0-19196-1-0.rar?fid=69532&ttl=1535786489&ri=8192&rs=8192&setec=3ebec7ca5727ec9ef7c8957f95df60df"
    },
    {
      "fileId": "70342",
      "name": "Alchemy Redux 1_3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22665",
      "fileName": "Alchemy Redux 1_3-19196-1-3.rar",
      "uploadedUnix": "1340675555",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/eac17fdd460478c3d3a7b92d527c36d92267447da166e5211fc147ac9f189001/analysis/1406983274/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alchemy%20Redux%201_3-19196-1-3.rar?fid=70342&ttl=1535786490&ri=8192&rs=8192&setec=a3c8217cab2662ca8b7fc8bfdf6bce19"
    },
    {
      "fileId": "71931",
      "name": "Alchemy Redux 2_0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31041",
      "fileName": "Alchemy Redux 2_0-19196-2-0.rar",
      "uploadedUnix": "1341330766",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/5da16b6cd200cd5fe435248e8e37e89d60c23be03c0a23ff5d23fcb24bc3d226/analysis/1406998852/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alchemy%20Redux%202_0-19196-2-0.rar?fid=71931&ttl=1535786490&ri=8192&rs=8192&setec=fc69086a6cd084a0e661c3f5ba586d72"
    },
    {
      "fileId": "72125",
      "name": "Alchemy Redux 2_0 no bsa",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "49023",
      "fileName": "Alchemy Redux 2_0 no bsa-19196-2-0.rar",
      "uploadedUnix": "1341417583",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/fd8e541d93b1100e2cdb51d5dd8793f9992ea5879af73ce7b850c38dca7faca1/analysis/1407000677/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alchemy%20Redux%202_0%20no%20bsa-19196-2-0.rar?fid=72125&ttl=1535786491&ri=8192&rs=8192&setec=360fb9300c9fe0b9c607e2ec83fcac64"
    }
  ]
}