{
  "modId": 192.0,
  "modName": "Skyrim Cheat-Scripts",
  "summary": "cheat scripts one can run via the \\\"bat\\\" command\r\nfrom the Skyrim-console",
  "descriptionHtml": "Copy all the textfiles starting with \\\"give\\\" into your Skyrim folder.\r\n\r\nThat would be \tc:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\r\nor \t\tC:\\\\Program Files\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\r\n\r\nWhile in game use \\\"~\\\" key which is left of 1 (on german keyboards \\\"^\\\")\r\nto open the console and type\r\n \r\nbat giveXY \r\nexample: bat givemaxlevel\r\n\r\nto execute the textscripts no quotations of course\r\n\r\n--------------------------------------------------\r\n--------------------------------------------------\r\n\r\nthe scripts do the following\r\n\r\n------------\r\ngivealchemy - will give you 5 of every ingredient for alchemy\r\n------------\r\nnomnomnom\r\n\r\n------------\r\ngivedaedric - will give you a full daedric set including all armor and weapons\r\n------------\r\nthose are unenchanted so you can level them up and enchant them normally and look badass\r\n\r\n---------\r\ngivekeys - will give you all the keys of in the game\r\n---------\r\nthis might screw something up as you now can enter rooms that you were not meant to yet.\r\nsome keys are awarded to you at the end of a quest so you can take shortcuts\r\n\r\n------------\r\ngivemaxlevel - levels all your skills to level 100\r\n------------\r\nthat way your character will level too. (you should be ca. level 82 afterwards)\r\nuse the level up dialog to choose your mana life and endurance upgrades\r\nyou will be given an appropiate amount of perkpoints to distribute.\r\n\r\n------------\r\ngiveminlevel - will lower all your skills to 10 and your level to 1\r\n------------\r\nyou still might level up a few levels after that.\r\n\r\n---------\r\ngiveperks - will give your character all the perks in all the skills\r\n---------\r\nregardless of your skilllevel in the skill the perks do work once obtained\r\nthis does not level your character up. you can play the game and level up\r\nnormally.\r\n\r\n----------\r\ngiveshouts - will give you all the shouts that are usually avaiable to you in the game\r\n----------\r\nalso this one adds 100 dragonsouls to you so u can activate the shouts.\r\nnote: that there are more shouts in the game but they lack description and many crash\r\nthe game or have no effect. those will not be granted.\r\n\r\n---------\r\ngivestuff - will spawn daedric enchanted stuff in you inventory, lots of money, lockpicks \r\n---------\r\nyou will most certainly become encumbred by this.\r\nhowever there are shoes that will give you more carrying capacity\r\n\r\n------------\r\ngivetomes - will give you all spell tomes\r\n------------\r\nas with the shouts there are many more but this will only give you what can normally be obtained\r\nvia the books. if you use \\\"psb\\\" (and i highly recommand that you don\\'t) you will get ALL spells\r\nand ALL shouts but it will clutter up your spellbook with duplicates and non-working spells.\r\n\r\ngreetings \r\nder maddes!",
  "categoryId": "40",
  "version": "1.3",
  "author": "1100101",
  "createdUnix": "1321298468",
  "updatedUnix": "1321350262",
  "containsAdultContent": false,
  "uploadedBy": "1100101",
  "primaryFile": null,
  "files": [
    {
      "fileId": "474",
      "name": "Skyrim Cheat Scripts",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "71",
      "fileName": "Skyrim Cheat Scripts-192-1-3.zip",
      "uploadedUnix": "1321350262",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/978adb050a11acc121d4402bdaa85623084f7392ae3fe8e4ba3e565b56a057d9/analysis/1406406183/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Cheat%20Scripts-192-1-3.zip?fid=474&ttl=1535752832&ri=8192&rs=8192&setec=7fa3bb7c59a0c1223c037137225be98e"
    }
  ]
}