{
  "modId": 19202.0,
  "modName": "Summon Summerset Shadow - Linwe",
  "summary": "Allows the player to summon the spirit of the Summerset Shadow leader Linwe.",
  "descriptionHtml": "Version 1 keeps the 24 ingame hour recast limit.\r\n\r\nVersion 2 removes the recast limit and allows the player to summon Linwe at any time.\r\n\r\nAs an incentive to help out the Thieves Guild become an image of its former self, this power can be obtained by completing one of the special missions given to you by one of its members.  Read spoilers section for further details, otherwise, just go out and steal lots of loot for the Thieves Guild!\r\n\r\n***SPOILERS*** \r\nThe mission is Summerset Shadows, where Delvin Malory sends you on a mission to destroy a rival guild the Summerset Shadows.  Do enough missions for the Thieves Guild, and the quest will be unlocked.  Upon getting the quest, after defeating Linwe, simply loot his body for his death tome.  The mission takes place in Uttering Hills Cave.\r\n***END SPOILERS***\r\n\r\nIf you have already completed the mission and the target\\'s body has disappeared, simply search one of the bookshelves in one of the living quarters of the dungeon the quest sends you to.  The book is called Linwe\\'s ***** Tome.\r\n \r\nLinwe is equipped with the following:\r\n\r\n1. Equipped with the Afternoon Shadows Bow:  This bow\\'s range is less than the standard bow, but allows Linwe to fire a slug shot that does devastating damage the closer an opponent is to him.  Ability is bloody.\r\n2. Slug Shot:  A powerful arrow shot that has a chance of staggering Linwe\\'s foes.  If the shot hits for a killing blow, the enemy\\'s body slides across the ground or flies into the air as if hit by a shotgun.  The flying/sliding body has a chance of staggering any NPC in its path of movement. This ability also sets up for Linwe\\'s second ability...\r\n3. Summer\\'s Showers:  If his arrow scores a critical hit, the arrow will fire a rain of trick shots from the location of the foe that received the hit.  The shots spray around hitting anything and everything around the fallen body.  This is programmed to miss Linwe, the player, and any of the player\\'s followers if they stay still.\r\n4: Summer\\'s Mist: Linwe\\'s arrows are laced with a corrosive acid damages over time, and eventually burns the flesh off his opponents.\r\n5. Linwe has improved stats in health, stamina, and a boost in movement speed.  \r\n6. Also equipped with the Light Foot perk to avoid tricking traps.\r\n7. Custom combat style that focuses on mid range combat.  Because his bow has a shorter range he will usually move up to damage his enemies and gradually move back while firing more arrows.\r\n\r\nNotes: Linwe is perfect for ambushing foes from a moderate distance.  If his shot strikes a critical hit, his Summer\\'s Showers ability will damage any other NPC nearby.  After the ambush, Linwe will move in closer because of the range of his bow.  An unplanned and useful technique that Linwe seems to implement now and then is that he holds his arrow until the opponent gets within fatal strike range.  Upon killing his opponent, the body flies back and his Summer\\'s Rain ability will activate damaging the enemies in the other room where the dead body flies into.  I highly advise not having a melee oriented follower while Summoning Linwe.  He is intended for use when the player needs a \\\"scout\\\" and his Summer\\'s Rain arrow attack will technically avoid the player\\'s follower, but follower AI seems to like walking straight into a moving arrow.  Ranged attack and distance magic are probably the optimal attack strategy when using this summon.\r\n\r\nI am working on other mods, and will be making updates to others. Please endorse if you like this. Also, please let me know if you experience any issues using this mod. \r\n\r\nPlease also check out my other mods when you have the chance!  Enjoy!",
  "categoryId": "75",
  "version": "2",
  "author": "zeroeternalz",
  "createdUnix": "1340340163",
  "updatedUnix": "1340340274",
  "containsAdultContent": false,
  "uploadedBy": "zeroeternalz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69555",
      "name": "Summon Summerset Shadow - Linwe",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Summon Summerset Shadow - Linwe-19202-1.zip",
      "uploadedUnix": "1340340224",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/7d3d34b72bf700128efd6ee65d48031790c934c6a1e542646117e24627bc5b81/analysis/1406975184/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Summerset%20Shadow%20-%20Linwe-19202-1.zip?fid=69555&ttl=1535786498&ri=8192&rs=8192&setec=c7895194e1bf1bbfbe20a7eaa8367d4d"
    },
    {
      "fileId": "69556",
      "name": "Summon Summerset Shadow - Linwe v2",
      "version": "2",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "13",
      "fileName": "Summon Summerset Shadow - Linwe v2-19202-2.zip",
      "uploadedUnix": "1340340274",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/fe60400199ee6cca7d9888a866e16a908e784914b08efb44c7b5d7c06be26e92/analysis/1406975184/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Summerset%20Shadow%20-%20Linwe%20v2-19202-2.zip?fid=69556&ttl=1535786499&ri=8192&rs=8192&setec=e948cf29cca5a68c8786df1afe325168"
    }
  ]
}