{
  "modId": 19208.0,
  "modName": "Sovereign Castle VANILLA ONLY",
  "summary": "Adds a Spouse Friendly, Dragon Attack Friendly, NPC Friendly, NPC Hire-able Castle to the game. ",
  "descriptionHtml": "[u][size=+5][color=dodgerblue][center]~Sovereign Castle~[/center][/color][/size] \r\n[size=+1][center]~Made by SprialDynasty~[/center][/size][/u]\r\n\r\n9.18.12\r\nIf having a month go by is any sign of bad news for you guys. I had been in the process of rebuilding the exterior in another location. However. School also started five weeks ago. guess what I have been doing? I am taking 17 credits this semester, battling the beast that is NURBS maya, 2-D character Animation, advanced character design. Along with two other classes. Needless to say. I just don\\'t have time to ***** around with this. Maybe if Beth comes out with some actual real freakin content with good story and motivations to do the quests I will come back to this. ONLY if I have time for it. School defiantly matters more to me, I hope you guys understand. You have all been fantastic :)\r\n\r\nSpiral Dynasty\r\n\r\n8.6.12\r\nHave determined that the best solution to the problem is to just up and move the castle elsewhere. Which means hours and hours of work. Basically my to do list on this mod is something like this:\r\n1 carefully clean the mod of riften cells\r\n2 carefully clean the edited navmesh from exterior cells\r\n3 delete all author exterior objects/markers\r\n4 undo vanilla object exterior edits\r\n1-4 are basically clean up what is now considered because of dawnguard as dirty edits.\r\nBecause of the process that is involved in 1-4 players will have to repurchase Live Stock, Horses, Wolves, and the Carriage driver. If I test the mod after applying these steps in game and still get CTD even though everything is cleaned up and there are no edits in the area it could be something else entirely. (I doubt that though)\r\n5- Relocate to an area that I will assume will remain untouched.\r\n6- Rebuild Better\r\n7- Navmesh\r\n8- Setup NPC markers/relocate NPCs\r\n9- Re-establish misc setups\r\n10- Redo quest in hope of fixing it for some. (May just remove it but have the bread crumbs there, Note on door, key, corpse note, bloody book.)\r\nAFTER that is all said and done and doing testing with Dawnguard loaded.\r\n11- introduce custom textures for rugs, banners, statues, etc... Introduce plants from Dawnguard for the gardens. Introduce Jarren root harvest-able plant.\r\n\r\nAll in all... looking at how much I need to get done for the mod to MAYBE work for dawnguard. I estimate about 1-2 weeks of work. Steps 1-4 probably done in a day. 5-10 is what will really kill me as far as time is concerned. I will let you guys know after I am done on steps 1-4 if there is any hope left. \r\n\r\n8.5.12\r\nYou guys can thank RKO for gifting Dawnguard for me. Otherwise I would not have bothered with it until the second expansion was released. Been playing through for building and bug testing purposes. Found one that affects the character I am currently running through on the dawnguard side. The quest called \\\"Bolsterin the ranks\\\" spawns a cave above Sov Castle, though the cave does not physically overlap or touch the castle I have noted CTD in the area once the quest reaches stage 20. (After you talk to Isran) Because of how deep into the quest line this goes, it could take some time for bug testing to determine if it is just that character. Confirmed to be a conflict between Dawnguard.esm and Sovereign_Castle.esp. Let me know ASAP if you get the same issue on that quest. Currently in the process of determining how to fix it. No sure ideas yet however. \r\n\r\nAdded quest debugging to \\\"TroubleShooting\\\" 7-29-12\r\n\r\n[i][center][color=orangered][size=+1] If  you do not read the instructions. I will ignore any questions regarding things already stated here. If you are going to be using mods you SHOULD be reading the instructions. If you find a bug, see \\\"bug reporting\\\" for how to do so. If you have CTD see “Troubleshooting”.[/size][/color][/center][/i]\r\n\r\n\r\n[size=+1][b][center]The castle is located East of Shors Stone and North of Riften.\r\nIf you have ran or are using my Dynasty Manor mod, you will notice some areas are the same. Smithy, Mage room, and Well are basically unchanged from that house. [/center][/b][/size]\r\n\r\n\r\n[b][u][center][size=+2][color=dodgerblue]*INSTALLATION INSTRUCTIONS*[/color][/size][/center][/u][/b]\r\nThis mod edits a large portion of an exterior world. To make sure that there are little to no problems from the start. Save your character in an interior building away from the Rift. Then install the files. Wait two days, then make your way to the castle. You will have to discover the location before you can fast travel there. See “The Quest” for ownership acquisition. \r\n\r\n[b][u][center][size=+2][color=dodgerblue]*UPDATES WHAT YOU SHOULD KNOW*[/color][/size][/center][/u][/b]\r\n Steam users ignore the following, steam has already made you update anyway. And you don\\'t need to worry about renaming files or that sort of stuff. \r\nYou don\\'t have to do this, but it is recommended. If I update and you want to update your house with the new file, save outside the house in a interior cell away from the rift. If you want to be even safer take all your stuff out of the house. When I update I will be renaming the file: file one is call Sovereign_Castle my update file however is Sovereign_Castle_1.1 you will need to delete 1.1 when you update. This ensures that any objects you left in the house will still be there. And that the quests do not reset forcing you to redo them. If this happens you should be able to go back into your data and rename your file to Sovereign_Castle. \r\n\r\n[b][u][center][size=+2][color=dodgerblue]*WHAT IT HAS*[/color][/size][/center][/u][/b]\r\n35 NPC\\'s, Spouse Friendly, Dragon attack Friendly, Full Kitchen/Butcher area, Full Guards quarters and Servants quarters, Two guest bedrooms, Master Bedroom, Open Dinning Hall/Liquor table, Two bathing areas (one servants, one Noble), Pool and Steam room, Library/study with podium displays, Theater room, A small private sitting room, Food Storage, Armory, Small hidden Vault with mask stands, Secret Escape tunnel, Hidden Summoning room, Fully furnished smithy, Fully furnished Magic room, Prison with torture room, The Well: a place for gathering ingredients,Outside flower garden with critter spawns, Horse Barn, Outside eating area.\r\n\r\n[b][size=+1]Secret Passages:[/size][/b]\r\nSkip this if you want to find them yourself. Though a few of them are very difficult. \r\nLibrary: Sit in the chair and look down at the side of the desk. (Switch)\r\n*Theater: Face the west wall of the theater, left of the decorative shield  under the arch. (Switch)\r\n*Master Bedroom: Hop on the bed face the East wall, look down between the wall and head of the bed. (Switch)\r\nFace the Staff quarters room across from the bathroom. Look under the arch to the left. you will see a raised stone. \r\nMagic Room: Enter the room, look at the wall with the Crests of the schools of magic are Activators. (Illusion Tablet)\r\n\r\n[b][u][center][size=+2][color=dodgerblue]The Quest:[/color][/size][/center][/u][/b]\r\n\r\nOn entering the courtyard. \r\nFind the paper stabbed with a dagger on the entrance of the prison.\r\nRead it to start the quest.\r\nKill the werewolf.\r\nGet the key off the dead werewolf\r\nGet the note off Sirans body\r\nExplore the Castle.\r\nFind the hidden Summoning room. \r\nRead the blood covered book.\r\nDone. \r\n\r\n[b][size=+1]The quest above must be completed before you can ask your spouse to move in with you. It must also be completed in order to hire any NPC\\'s to work there.[/b][/size]\r\n\r\n[b][u][center][size=+2][color=dodgerblue]NPC\\'s[/color][/size][/center][/u][/b]\r\nRead the note on the desk in the library, will direct you to Lieth Valatt at the Bee and Barb in Riften. Inside the “Guide to Sovereign Hiring” you will see a list of NPC\\'s available to hire in packages. \r\nWelcome to actually paying your employees :D (I would still pay them more)\r\n\r\nMost of these NPC\\'s are only set with Generic dialogue. You will find more info about each one in letters/journals. I don\\'t have time or patience to deal with getting voice actors. I do not have the time to deal with the pains of custom dialogue. \r\n\r\n[size=+1][b]Spouse Instructions[/b][/size]\r\nYour spouse will move into the house using the same method as the vanilla dialogue. They will use everything in the house just like a vanilla house. However, I noticed during testing that my spouse would never sleep. The reason being that YOU have to SLEEP first. Only after that will they sleep in the bed.\r\n\r\n[i]I will not be adding sex dolls to my mod. Sorry guys no naked females for you, and sorry chicks no hot men for you (sigh no naked Farkus).[/i]  \r\n\r\n[center][size=+2][color=Orangered][b]ALL NPC\\'s ARE FLAGGED AS [i]PROTECTED[/i]. YES THEY CAN DIE. BUT ONLY BY THE PLAYERS HAND. [/b][/color][/size][/center]\r\n\r\nSee the images above for more detailed information on the NPC\\'s. Each human NPC has some Note or journal in the House that appears after you have purchased the package they are in. Some of theses intertwine with other Packages, so some back stories may refer to other NPC\\'s who are available for purchase. I am not going to change this. \r\n\r\n[size=+1][b]Horses:[/b][/size]  8,000 Gold\r\n1 of each color. Will not engage in combat! So park them at a safe distance.\r\nMore health and faster for one thing. Speed is set from 100 to 175. Which means at sprinting they go 200. Can cause CTD in high load areas. \r\nIf it is a problem I know about... why leave it in? Well, frankly the Skyrim horses are slow useless slugs. This speed actually feels fairly natural for a trotting horse. \r\n[b]USING THE BARN:[/b]\r\nYou will notice after exploring a bit that there is a interior barn with 5 stalls. Once you have purchased the Horse package the stalls will populate with the horses. To get the horses out of the barn you will notice that under the statue of the horse outside a button has appeared. Click the button and select what horse you want, the horse selected will appear in the stall outside. You can only ever have one out at a time. This is my way of keeping track of the horses as they are not set to return home like the buy-able horses do. You could leave the horse on the top of a mountain, go back to the stable and select “stable my horse” thus returning the horse to the stable with no fuss. Clean and effective.\r\n\r\n[size=+1][b]Wolves:[/b][/size] 3,500 Gold\r\nThree wolves one red, black and white are available as followers. Follow basic commands: Wait, Follow, Go home. You cannot have all three at once.\r\n[b]Bug Fixes[/b]\r\n*To Fix dialogue does not appear:\r\nIf you are unable to recruit a new dog follower and have no idea what happened to your old dog, you can simply reset the global value that determines whether or not you can get another dog. It\\'s PlayerAnimalCount, and the console command it looks like this:\r\nSet PlayerAnimalCount to 0\r\n*If the dialogue bugs and will not let you select even though it appears. I find a quick fast travel fixes the issues.\r\n\r\n[size=+1][b]Guards[/b][/size] 9,600 Gold (Both Night and Day = 19,200 Gold)\r\nAll guards are followers. Each have their own strengths. 4 guards to a shift=8 total. \r\n\r\n[size=+1][b]Staff[/b][/size] 6,000 Gold\r\nIncludes: maid, chef, bard and grounds keeper.\r\n\r\n[size=+1][b]Live Stock[/b][/size] 2,500 Gold\r\n3 chickens, 2 goats, 1 dog follower.\r\n\r\n[size=+1][b]Jailor[/b][/size] 2,200 Gold\r\nAdds Seven inmates to the prison, cleans up the quest scene, and adds two Jailors. The Jailors are Master level trainers in Destruction and Block. \r\n\r\n[size=+1][b]Carriage[/b][/size] 1,200 Gold\r\nThe carriage will not return you to Sovereign Castle. Again the reasons are for mod conflicts with “scenic carriages” and “more carriages” type mods. I myself don\\'t use any of them, however there may still be a conflict with Scenic Carriages due to the fact that Sovereign Castle appears to be in the way of the “Riften-Windhelm” route. \r\n\r\n[size=+1][b] iss\\'nah the Ice Wraith [/b][/size]\r\nI hope you did not kill him when you first entered the summoning room. Iss\\'nah is an Ice Wraith merchant who has 12,000 gold. He sells rare alchemy ingredients. And he comes with the house, no extra cost. \r\n\r\n\r\n[b][u][center][size=+2][color=dodgerblue]RULES OF THIS MOD[/color][/size][/center][/u][/b]\r\n[b]DONT STEAL.[/b] This mod is not to be posted sites except for SkyrimNexus and Steam Workshop, ONLY BY ME. Translators are to contact me first, credit must be a link back to the Nexus.  \r\n[b]ASK FOR PERMISSION[/b]. If you want to use this mod for any purpose at all, you must contact me first. \r\n\r\n[i][b]customizing this mod for -private- use[/b][/i]\r\nWhat this means is that you can modify the home in the CK for private use. What this does not mean, is that you can publish or upload the modified version ANYWHERE on the Internet. I will not allow that and view it as stealing!!!!!!! So, if you wanted to say move a light or add lights, or make an NPC naked. Go ahead.  \r\n[b][size=+1][color=orangered][center]NO PUBLISHING\r\nYOU CAN MODIFY ONLY FOR PRIVATE USE[/center][/color][/size][/b]\r\nI am not accountable if you screw up your file of the mod (this includes scripts, quests, optimization, etc...), or your save files. I am only accountable for what I have done to the file, and am providing to the users of the mod. I am all for making a house personal, however I am not happy when someones hard work gets ripped off.[b] DONT BE A DICK[/b]. \r\n\r\n[b][u][center][size=+2][color=dodgerblue]CONFLICTS[/color][/size][/center][/u][/b]\r\n\r\nTypes of mods that can conflict with this one:\r\n-     Any mods that changes the area of the Rift in which the Castle is located. \r\n-     Any mods that are dependent upon that area of the Rift but do not necessarily change it. \r\n-Some types of follower mods may make weird things happen. You must determine load order.\r\n-Any mod that changes the Spouse Moving to a new house quest line. Could cause problems.\r\n\r\nSee Troubleshooting for info on CTD and load order.\r\nI IGNORE UNDETAILED COMMENTS ABOUT BUGS. \r\n\r\n[b][u][center][size=+2][color=dodgerblue]KNOWN BUGS[/color][/size][/center][/u][/b]\r\n-     Patrol Guards outside sometimes get caught on the navmesh, a few minutes they will typically resume their route. Just because 1.6 fixed the navmesh I have observed minor issues.\r\n-Wolves dialogue does not appear. See above under wolves purchase package for fixes.\r\n-Horse CTD on Sprint. See above under Horse Purchase package.\r\n-Untested bug, you can report on this one because I have not tested it. In the Ice Wraith area you will find a “vile of undiluted Lycan Blood” upon drinking this you will transform into a werewolf and contract the disease. This MIGHT cause problems for the companions quest line. I wanted it in there however for an RP character who is not in the companions. Not to mention it fits with the history of the last owner.\r\n-Quest items do not appear or work. There are 3 items exactly. 1) Note outside prison doors. 2) Note on Sirans Corpse. 3) Bloody book. If you have any other quest mods running I recommend troubleshooting them with this one loaded. Or trying a hard save, exit game then load to refresh scripts. \r\n- Sigil of Conjuration causes CTD. I have had exactly 3 reports on this. The reason why it CTD is because you are running some mod that changes magic. Blood magic is one of the ones that a user of mine was using. You can keep both mods, I just recommend not touching the conjuration sigil.  \r\n- Mannequins weird/alive. I can\\'t fix this. \r\n-Towers/walls outside not loading right. I can\\'t fix this. Its a Beth LODing issue. Go look it up. \r\n-House is dark. You are probably using a lighting mod of some sort. I am not going to change the lighting. \r\n- Lag in or around building. Depending on how much your computer can take, how many mods you are running, and if your ini file is setup correctly to your computer specs. You may not be able to run the mod if its bad. After v1.1 runs smooth on my end.  \r\n- Six of the display cases do not work. This was intentional by me. Just because you can put weapons everywhere does not mean everything should be weapons. *shrug\r\n- Floating grass. This is common for mods, there are ini fixes. Go look for it. \r\n\r\n\r\n[b][u][center][size=+2][color=dodgerblue]HOW TO TROUBLESHOOT added 7.10.12[/color][/size][/center][/u][/b]\r\nCTD, Black screen. \r\nI will ignore comments like: “I CTD” or “I have black screen on loading”. I need details you guys. I am not a psychic, thank goodness! I also cannot help you with this one. There is no magic load order. If you are running 50+ mods... Troubleshooting is going to be a pain in the butt. \r\n1st, get a clean save. If you don\\'t know what that is google it. \r\n2nd, load the game up with only this mod running. \r\n3rd, one by one turn on one of your mods and test. \r\nResults:\r\nIf you CTD on the Second step. Its my mod and/or a corrupted save file. You need to load up with a 100% new character. This will help to confirm if it is the mod or your save file.\r\nIf you CTD on the Third step. It is a mod conflict. \r\n4th, if it is a conflict, start playing with your load order. If you don\\'t know what that is google it.  \r\nResults:\r\nIf to no avail one of your mods is not working with this one. Then you can report it in the comments section. If your save is corrupted... Cannot be fixed. \r\n\r\nQuest not working: \r\nI don\\'t know what to tell you. Seems to work for most people, and others not at all. \r\nI have only ever been able to recreated the quest not triggering on 2/10 characters, both of which are on my BFs computer who have dependency on several mods. (trying to teach him mod safety) considering the amount of mods he has installed and uninstalled in his couple of hundred hours of playing, I suspect some save file corruption is to blame. However, I can\\'t just attribute this to corruption because of how scripts are run in game:\r\n\\\"The more scripts that run the slower the game gets because the queue gets longer and long scripts end up getting paused when they run out of \\\"run time\\\" assigned to them. Which why Skyrim has so many random quest problems.\r\nThe new scripting language does on paper sound like a good step forward and on paper it is a good idea. But the implementation of it sucks big time.\r\nIn practice, the bugs and run time issues mean its actually only good for controlling AI cut scene control and fire and forget events like kill the boss, get the gem style quests. Stuff that checks for 1 action basically.\\\"\r\nhttp://www.theengineeringguild.co.uk/index.php?option=com_content&view=article&id=589:skyrim-1-6-problems-and-papyrus&catid=22:the-blog&Itemid=117\r\nThese are currently the only things I can think of that can cause quest issues:\r\nLoad order\r\nOther mods\r\nSave file corruption\r\nScripts not running\r\nHonestly this does not narrow it down. \r\nTo test your save file for corruption: \r\nType: coc sovereigncastleexterior01 into the skyrim main menu (no save file loaded)\r\nType: toggledetection\r\nRead the quest start note, quest should start. \r\nGet into the prison, either kill or use \\\"kill\\\" command in the console on the werewolf. Get the Key, (no trigger should happen) Get the note off of Sirens dead body. (quest should move forward) Go read the book (quest should finish). \r\nIF this all works then your save file is probably screwed up and corrupted. \r\nIF it is not running at all. Test the load order and your mods. You can either look under \\\"troubleshooting\\\" for this information or you can google it. \r\nI have done what I can for the scripts, they are all in the BSA file and accounted for. Guess you could try to unpack them on your end using an archive packer/unpacker. Skyrim has one in its data files. \r\nOtherwise you could type \\\"setstage sca01 50\\\" to complete the quest. If the scripts are not working however there is a chance that the spouse and purchase will not be unlocked correctly. \r\nOther then this I do not know how else to fix it or exactly what the problem is. With my wonderful luck it is probably all of the above. \r\n\r\n[b][u][center][size=+2][color=dodgerblue]UPDATES[/color][/size][/u][/b]\r\n [/center]\r\nv1.1-\r\nGeneral: Changed a few NPC packages to give NPC\\'s greater range during downtime. Changed the way roombounds and portals are used in the home. You may experience initial lag on cell load, however it will clear up after a few seconds. Fixed the crow not showing up properly in the Mage room. Adjusted some lighting in the mage room. Fixed some clipping issues noted around the castle. Adjusted some lighting over all. \r\nQuest: cleaned up the quest. May or may not help with quest items/scripts not going off. Moved the initial “Summoning room” trigger to the note on Sirans body. \r\nFile: Cleaned up file may or may not change compatibility for some mods. Removed the Update.esm dependency from the file to help improve computer compatibility. ( Thanks goes to Brendan62 on this part :D )\r\nLieth Valatt: Major change. No longer has dialogue that offers you to purchase anything. Now she will provide you with a text box that allows you to select the packages. Due to the nature of saved games she will still technically be apart of the “job steward faction” because she is saved as such on your game. I do not have a fix for that besides uninstalling the mod, saving, then reinstalling. If you start a new character however she will not have that. So its a bug that can be lived with. \r\nTHINGS YOU NEED TO DO BEFORE INSTALLING! \r\nDue to how file clean up was achieved:\r\nNPC\\'s will reset, this means that they will empty their inventory and be located at the castle even if they were following you originally. You need to load up your game and remove the items from them, save, install version 1.1. \r\nNPC packages, will remain unlocked if you purchased them previously in a save game. This means that if you purchased the wolves on a save file you will still have the wolves. However, this is only false for the horses. Due to the nature of saved games again, your script only recognizes the original NPC horses. These NPC\\'s had to be recreated so to speak, ultimately what this means is you must repurchase the horse package. In the console type “player.additem 00f 8000” this will give you back the gold you lost. Once you repurchase the package the horses will function as they should. It was the only way to fix some problems. \r\n\r\n[b][u][center][size=+2][color=dodgerblue]MISC[/color][/size][/center][/u][/b]\r\n\r\n[I][size=+2][color=cadetblue]  Good comments are some of my biggest motivators. If I know people like the mod it encourages me to do better next time. In fact you should be rating all the mods you love.[/size][/i]\r\n[center][size=+3][b][u] If you like this mod please Endorse/Rate it.[/u][/b][/size][/center][/color]\r\n\r\n[i][size=+1][color=steelblue]I am sure I will hear about it. So might as well mention it. No you cannot see objects you should see outside the house when looking out. This was done because of optimization and item count. That main room has a lot going on in it to add another thing to that stack would push it over the edge. So no, I will not fix this in the future. Same goes for being outside looking into the windows. You cannot see anything except a brick wall. Item count reduction. And optimization. \r\n\r\nAll information that I gathered on the werewolf story and such was pulled from uesp.net. So you can go ahead and lore me to death about errors or whatever. At this point I would probably just tell you not to read it if it bothers you. Just go check out the info over there, it was my source and I followed it. The only thing I took liberties with was the \\\"Diluted Lycan blood\\\".\r\n\r\nThanks goes to Brendan62 on my file v1.1\r\n\r\nThanks go to Bethesda for making a okay fetch game. (I understand now, fetch quests are easy to make, but boring as hell)\r\nThanks go to Bethesda for making fantastic customization tools for modding! :D [/color] [/size][/i]\r\n\r\n[b][size=+1]Why do your Animals look different? \r\nI am using Bellyaches Animal Pack. Get it here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3621\r\nWhy does your elven armor look different?\r\nI am using Shodan44\\'s Masked Elven Armor mod Texture. Beautiful. Get it here:\r\nhttp://skyrim.nexusmods.com/mods/6524\r\n[/size][/b]",
  "categoryId": "67",
  "version": "1.1",
  "author": "SpiralDynasty",
  "createdUnix": "1340354728",
  "updatedUnix": "1342843372",
  "containsAdultContent": false,
  "uploadedBy": "SpiralDynasty",
  "primaryFile": null,
  "files": [
    {
      "fileId": "71155",
      "name": "Sovereign_Castle",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3723",
      "fileName": "Sovereign_Castle-19208-1.rar",
      "uploadedUnix": "1341021394",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/4e679f3f4f8548a2188257fcd97c53c9a3a760894b3135e9a724b0c865a90402/analysis/1406991427/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sovereign_Castle-19208-1.rar?fid=71155&ttl=1535786507&ri=8192&rs=8192&setec=4079c6ea36d3eeafe8896880758d86b3"
    },
    {
      "fileId": "75663",
      "name": "Sovereign_Castle",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3678",
      "fileName": "Sovereign_Castle-19208-1-1.rar",
      "uploadedUnix": "1342843372",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/a6fbbf9dfc089ecf0a58d94b5d9a6ac5d74c08710ba42c96ec4038f6b03cfc9f/analysis/1407036306/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sovereign_Castle-19208-1-1.rar?fid=75663&ttl=1535786508&ri=8192&rs=8192&setec=6e3de8a0d198a15aa3930e7acce1cfd9"
    }
  ]
}