{
  "modId": 19228.0,
  "modName": "Roadside Ruins Reborn",
  "summary": "Modifies the Roadside Ruins into a functional exterior home",
  "descriptionHtml": "Roadside Ruins Reborn - A Mod by Kohdi\r\n\r\n-Description-\r\nSo there you are, wandering through the empty bedrooms on the fourth floor of your palatial \\\"Dragonborn Mansion\\\", and suddenly you have a feeling. It starts as a twinge, deep inside your mind, then becomes like a quiet breeze blowing itself into your consciousness, and then a brisk wind scented with pine needles and crystal lakes and small things under trees that is impossible to ignore. You race to the leaded-glass window and gaze from the mansion\\'s high summit, across the snow forests and the rolling tundras and the jagged peaks, until finally at the edge of sight you catch the mirthful rustle of green, the gentle swaying of leaf and stem, the beckoning chuckle of rocky creeks. The wind in your mind becomes a burning desire in your soul, a desire to leave behind your excessive trappings and embellishments and live where the stars keep your night, and the mountains know your name. With a fire deep inside you race down flight after flight of mahogany staircases, your boots clacking on marble tiles out to the grand foyer. Tapestries flutter as you pass, maids look up from their duties in wonder, and the baying of excited dogs follows you to the door. You brush aside your butler and dash to the stables, not even bothering to saddle up your eager horse. Before you can leave the courtyard your horse begins to gallop, needing no directions to the place which has called him as well. Leagues fly by, peasants stare from their fields, sparks are struck from your mount\\'s ringing hooves. Through the night you ride until a new day dawns, peeking over elder woods and waking a symphony of birds. You and your horse are exhausted but no less driven as you come to a trot and then a walk near a group of old stone monoliths bordering the road. You follow the silent sentinels a short way into the deep forest, and then you see it - standing solidly among the dappled light lays an ancient Nordic dwelling, oddly-shaped circular walls arcing up to enclose a small yard. Your horse whinnies and you dismount, passing your gaze slowly over the time-worn edifice before you. Deep down, below petty wants and desires, below even hunger and thirst and near-overwhelming tiredness, you finally realize - though it is simple, open to the air, rustic, and far from the high society which swoons at your very presence - this place is home.\r\n\r\n-Info-\r\nThis mod enhances the Roadside Ruins near Falkreath into a pleasant, modest, exterior home (no loadscreens!). It has everything you need including a forge, workbench, grindstone, tanning rack, chopping block, cooking pot, alchemy and enchanting stations, crops, books, safe storage, cozy bedding for two, practice dummies, a well, ample seating, and working security features. The house is fully navmeshed, exquisitely detailed, and impeccably styled. Your outdoorsy Dovahkiin will feel right at home alone or with company, night or day. You have easy access to a hold capital, just a quick uphill walk to the beautiful shores of Lake Ilinalta, and for those who are more darkly inclined you may find your next-door neighbors quite convenient. All of this I offer to you free of charge, asking only in return that you give it a try, and enjoy.\r\n\r\nNote - Because this is an exterior home in a heavily-forested area, lower- and even mid-range computers may experience a significant performance hit. I\\'ve tried to keep it as stable as possible (no intensive scripting or animations, and all-vanilla resources), but be aware that your game may not be able to comfortably run this mod.\r\n\r\nAlso note - If you have problems with floating or misplaced landscape grass in the Ruins, follow the steps here http://forums.bethsoft.com/topic/1351548-a-fix-floating-grass/ to fix the problem. I can confirm that it works!\r\n\r\n-Installation-\r\n1. Drag.\r\n2. Drop.\r\n3. Activate.\r\n\r\n-Uninstallation-\r\n1. Deactivate.\r\n2. Delete.\r\n3. Weep quietly.\r\n\r\n-Troubleshooting-\r\nQ: The ruins haven\\'t changed!\r\nA: Make sure the plugin is activated and that no other mods interfere with the area around the house. If so, try loading this file after whatever else you\\'ve got.\r\n\r\nQ: When it rains or snows, I can see it inside the house! What gives?\r\nA: That\\'s the price of an exterior home, at least until someone can figure out how to fix the problem. Nothing I can do, especially since I\\'m no pro with scripting.\r\n\r\nQ: My game slows to a standstill near the house, can you reduce clutter to make it faster?\r\nA: Sorry about that, but I don\\'t want to take anything away from the style I\\'ve made. My additions are modest already, so unless I took out everything but a couple bedrolls I doubt you\\'d get any worthwhile increase in performance.\r\n\r\nQ: Will you/can I release this on Steam Workshop?\r\nA: No.\r\n\r\nQ: Does this conflict with MellowTraumatic\\'s mod of the same location?\r\nA: Yes, you\\'ll need to pick one or the other.\r\n\r\n-Changelog-\r\n6/22/12 - 1.0 - Initial Release\r\n\r\n-Credits-\r\nMellowTraumatic - for the inspiration I needed to get this rolling, advice on landscape issues, and also for being a good sport regarding my use of the same location as her mod.\r\nBethesda - for the resources and tools needed to make visions become reality.\r\n\r\n-Contact-\r\nPM me here or leave a comment, I\\'ll respond either way.",
  "categoryId": "67",
  "version": "1.0",
  "author": "Kohdi",
  "createdUnix": "1340385899",
  "updatedUnix": "1381200943",
  "containsAdultContent": false,
  "uploadedBy": "Kohdi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69672",
      "name": "Roadside Ruins Reborn",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1065",
      "fileName": "Roadside Ruins Reborn-19228-v1-0.rar",
      "uploadedUnix": "1340385971",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/60b84b2f06c2814fe2dc6c04b582fb7aa4d7eff709e822c74d71edd9ce48e87f/analysis/1406976364/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Roadside%20Ruins%20Reborn-19228-v1-0.rar?fid=69672&ttl=1535786551&ri=8192&rs=8192&setec=c6a9b9d6d8f543a41411a0c1062974e7"
    },
    {
      "fileId": "1000063089",
      "name": "Additional Bedrolls by Request",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "153",
      "fileName": "Additional Bedrolls by Request-19228-.rar",
      "uploadedUnix": "1381200943",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1c92f7798cdf29d0546df29714b8799068bd7b81cf8feee7874ff4d08a7ac894/analysis/1407749370/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Additional%20Bedrolls%20by%20Request-19228-.rar?fid=1000063089&ttl=1535786552&ri=8192&rs=8192&setec=48f818bba54286e6266927be0e1d67b7"
    }
  ]
}