{
  "modId": 19237.0,
  "modName": "Skill Creation Tutorial with Example Woodcutting Mod",
  "summary": "A tutorial on how to create new skills using Papyrus, along with an example mod that adds a Woodcutting skill.",
  "descriptionHtml": "This tutorial provides the guidelines and concept for creating a new skill in Skyrim. The method that I present uses a series of Papyrus scripts and Global Variables to create the experience of new skill. Along with this tutorial, I have provided a fully functional mod that adds a Woodcutting skill, and a compressed folder containing the source scripts for that mod.\r\n\r\nI have also created an Unarmed Overhaul mod that adds Unarmed and Unarmored skills to the game. You can download it here: http://skyrim.nexusmods.com/mods/15725\r\n\r\nThere are three files available for downloading.\r\n\r\n1 - Tutorial PDF: This is the tutorial in a PDF format, compressed into a .ZIP archive.\r\n2 - Woodcutting Skill Mod: This is the example mod that adds a Woodcutting skill. It is fully functional, so feel free to use it in your game if you are so inclined. It, along with it\\'s BSA archive are compressed within a .ZIP folder.\r\n3. Source Code: This is the source code for the Woodcutting Skill Mod, compressed within a .ZIP archive.\r\n\r\n+++The Tutorial+++\r\n\r\nThe tutorial first introduces you to the concept of the method, and then proceeds to explain it\\'s implementation. I do not provide pre-wriiten code that will work to make any skill, since creating such a mod requires a great deal of innovation. However, you will be taught the concept, and provided with guidelines for creating your own skill.\r\n\r\n+++The Woodcutting Skill Mod+++\r\nThe Woodcutting Skill Mod adds a woodcutting skill to the game. Now, whenever you chop wood, you will gain experience points and be notified of your level progression by notifications in the top left-hand corner. The first time that you use a Wood Chop Block, you will be given the Woodcutting Management power that will let you check your stats and gain new perks. There are three perks which you can gain. \r\n\r\nHarvester 1 - Get 3 Firewood for each chop.\r\nHarvester 2 - Get 4 Firewood for each chop.\r\nTimber! - Deal double damage with the Woodcutter\\'s Axe!\r\n\r\nThis mod should work for any of the standard Wood Chop Blocks, unless they are tied to a specific quest.\r\n\r\nCompatability: This mod will not work with any mod that modifies the \\\"resourcefurniturescript\\\" script.\r\n\r\n+++Source Code+++\r\n\r\nAlong with the mod and the tutorial, I have provided my source scripts for download. These are the all of the scripts used in the mod, along with the modified \\\"woodchoppingscript\\\" vanilla script.\r\n\r\n+++Permissions+++\r\n\r\nAlong with this tutorial I have provided an example Woodcutting Skill mod for you to download.\r\nWhile the mod is not extensive, since it was merely created as an example for you to study, it is fully functional. Feel free to play it, examine it\\'s code, or even expand it into a full mod as much as you want. I give this mod and it\\'s source code to anyone and everyone who wants to use it. You may do anything that you want with it, so long as you credit me for my work in the original source version.",
  "categoryId": "82",
  "version": "1.0",
  "author": "Woverdude",
  "createdUnix": "1340395747",
  "updatedUnix": "1340396926",
  "containsAdultContent": false,
  "uploadedBy": "Woverdude",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69703",
      "name": "Woodcutting Skill Mod",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Woodcutting Skill Mod-19237-1-0.zip",
      "uploadedUnix": "1340395864",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6c9f6b70a188a1cc50ac2ddff32fff40943d8700c67ddc54d07492d170cb8161/analysis/1406976662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Woodcutting%20Skill%20Mod-19237-1-0.zip?fid=69703&ttl=1535786564&ri=8192&rs=8192&setec=24221fb1b7208d73a45e6ba471f252a4"
    },
    {
      "fileId": "69704",
      "name": "Source Code",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "Source Code-19237-.zip",
      "uploadedUnix": "1340395896",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a16c94fb92d3ed818e8472a2ff4abd07567a9addf1341474c18122a05c3de621/analysis/1406976663/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Source%20Code-19237-.zip?fid=69704&ttl=1535786565&ri=8192&rs=8192&setec=74da5252ccc453781b34ca835f8a4f74"
    },
    {
      "fileId": "69707",
      "name": "Tutorial PDF",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "208",
      "fileName": "Tutorial PDF-19237-1-1.zip",
      "uploadedUnix": "1340396926",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b66b411393a1dfb7637a32a5074cbce4b37647948452128f95813c3f0b84525b/analysis/1406976723/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tutorial%20PDF-19237-1-1.zip?fid=69707&ttl=1535786566&ri=8192&rs=8192&setec=1de9e92e02d17d841794b75ea4a5c6ca"
    }
  ]
}