{
  "modId": 19232.0,
  "modName": "Convenient Horses TRADUZIONE ITALIANA",
  "summary": "Traduzione italiana del file Convenient Horses di mitchalek\r\nTHIS IS ONLY A TRANSLATION OF THE ORIGINAL MOD",
  "descriptionHtml": "[color=red][size=+2][center]NOTICE![/color][/size][/center]\r\n[color=red][size=+1][center]This is only a translation into Italian of the original mod. All credits go to the creator of the [url=http://skyrim.nexusmods.com/mods/14950]original mod[/url]. \r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.[/color][/size][/center]\r\n[color=green][size=+5][center]UNA PRODUZIONE DRAGONBORN ITALIA[/color][/size][/center]\r\n\r\n[color=green][size=+1]Caratterisriche[/color][/size]\r\n[list]\r\n[*]Massima compatibilità. Supporta cavalcature di ogni dimensione.\r\n[*]Cavalli per i seguaci (compatibile con UFO, AFT e EFF+SKSE, fino a 15 cavalli per i tuoi seguaci, opzioni avanzate).\r\n[*]Armature sia per il tuo cavallo che per quello dei tuoi seguaci.\r\n[*]Carica a cavallo.\r\n[*]Chiamata del cavallo cinematica ed istantanea.\r\n[*]Conversazioni e raccolta di oggetti possibile mentre si è a cavallo.\r\n[*]Raccolta di ingredienti mentre si è a cavallo.\r\n[*]Discesa rapida con armi automaticamente impugnate.\r\n[*]Relazioni con le fazioni selezionabili (amichevoli o neutrali)\r\n[*]Inventario del cavallo auto-trasferibile con accesso semplicissimo.\r\n[*]Il tuo cavallo ti seguirà quando non lo cavalchi.\r\n[*]Selezionabili invulnerabilità del cavallo e bonus a salute/vigore/velocità.\r\n[*]Configurazione semplicissima tramite menu e configurazione tastiera.\r\n[*]Modalità di controllo con Clic Multiplo o Scelta dei tasti (quest\\'ultima richiede SKSE).\r\n[/list]\r\n\r\n[color=green][size=+1]Installazione[/color][/size]\r\n[b]Attenzione, assicuratevi di aver aggiornato il gioco alla versione 1.6[/b]\r\n\r\nQuesta traduzione richiede la mod originale installata. Dopo averla scaricata e correttamente installata scaricate dalla pagina DragonBorn Italia l\\'archivio con il file .esp tradotto e sostituitelo all\\'originale. Trovate un link alla pagina di Dragonborn Italia nella sezione mirror di questa pagina. \r\n\r\n\r\n\r\nTutti i meriti vanno ad [url=http://skyrim.nexusmods.com/users/621184]mitchalek[/url] per la creazione di questa fantastica mod.\r\nAll credits go to [url=http://skyrim.nexusmods.com/users/621184]mitchalek[/url] for the creation of this awesome mod.\r\n",
  "categoryId": "83",
  "version": "3.3.2",
  "author": "Demea",
  "createdUnix": "1340390027",
  "updatedUnix": "1340390027",
  "containsAdultContent": false,
  "uploadedBy": "Demea",
  "primaryFile": null,
  "files": []
}