{
  "modId": 19253.0,
  "modName": "Dwarf race",
  "summary": "Adds three different dwarf races. Also adds the option of making everyone in skyrim a midget.",
  "descriptionHtml": "This is my very first mod that I have released, and it is centered around a new skeleton I made specifically for shorter races. I then gave them new abilities and stats and lores which generally match the lores of skyrim, except the size of dwarves, which frankly, if it bugs you that much, its a really easy fix (setscale). so it&#39;s very lore friendly. I also gave them new tinting and hair colors.\r<br />\r<br />(NOTE: This is modeled after tolkenian dwarves, NOT skyrim dwarves. If you want them to be the correct size, you can rescale them using the console.) \r<br />\r<br />Anyways, there are three races that are added:\r<br />\r<br />Dwarves: smallest.\r<br />They gain increased health regeneration and unarmed damage, and can heal themselves entirely once a day.\r<br />\r<br />Dwemer: Smaller\r<br />They gain increased unarmed damage and can walk on water. They can become invisible and surround themselves in ice once a day (kind of like a weaker version of the dark elves with invisibility)\r<br />\r<br />Half-Dwarfs: Medium sized\r<br />They gain increased unarmed damage and health regeneration, and can use the nord battle cry once a day.\r<br />\r<br />Installation:\r<br />Just extract the file into the skyrim folder and merge it with the pre-existing data folder.\r<br />\r<br />If you want everyone to have the midget look, rename the &#34;Dwarfskeleton&#34; file in the data folder to just say &#34;skeleton&#34;. This may cause issues with other mods.\r<br />\r<br />Known issues:\r<br />*This may be unbalanced, but I tried to balance it as much as possible.\r<br />*The &#34;thick skin&#34; that adds unarmed damage is called claws under the menu.\r<br />*The character looks a little rough if you zoom in far enough. This is because of how the skeleton was made, and I am unaware of how it can be fixed. It looks much better with armor.\r<br />*For editors, the claws cannot be removed from any of the races. I do not understand why.\r<br />*It&#39;s more like water hopping than water walking. If you want it to work, you have to jump.\r<br />*This does not work with vampirism or Lycanthropy. \r<br />*The healing on the dwarves and half-dwarves is actually there even though it doesn&#39;t show up on the menu. Promise.\r<br />\r<br />Required mods:\r<br />None that I am aware of.\r<br />\r<br />*side note: This mod may have unexpected results and, not that I think this will happen, but it could do unexpected things to your game or saves. YOU HAVE BEEN WARNED.\r<br />\r<br />*Other side note: The pictures uploaded by users give a much better example than the ones I did. \r<br />\r<br />Thank you for trying it out&#33;\r<br />\r<br />If you enjoy this mod, please endorse me&#33;",
  "categoryId": "34",
  "version": "1.0",
  "author": "Koechophe",
  "createdUnix": "1340423825",
  "updatedUnix": "1340423931",
  "containsAdultContent": false,
  "uploadedBy": "koechophe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69758",
      "name": "Dwarves",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "91",
      "fileName": "Dwarves-19253-1.7z",
      "uploadedUnix": "1340423931",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/2098e0b249314a5ac58644b3ee5e76fea59852e13da28477c4ed6a88fd770704/analysis/1406977203/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwarves-19253-1.7z?fid=69758&ttl=1535786585&ri=8192&rs=8192&setec=d23d4b95112bd2657584dee197eb62a2"
    }
  ]
}