{
  "modId": 19262.0,
  "modName": "Fort Ironcrag",
  "summary": "A sturdy player home with its own ore mine. This player home is geared more towards warriors. \r<br />",
  "descriptionHtml": "[b]Description[/b]\r<br />Tucked away between two glaciers rests Fort Ironcrag, a once prosperous ore mine of Winterhold.....\r<br />\r<br />\r<br />Greetings and welcome to my first Elder Scrolls Skyrim mod&#33; While my inexperience may show in some areas, I hope you will enjoy this small contribution to the excellent Nexus modding community&#33; This mod has all the bells and whistles you could expect from a player home, including navmesh, with the exception of an alchemy station. If there&#39;s enough demand, I will look into adding one in the future. \r<br />\r<br />There&#39;s something of a boss waiting for you outside the fort, so be ready for a fight&#33; You&#39;ll find Fort Ironcrag just west of Journeyman&#39;s Nook. If you&#39;re interested in some of the home&#39;s history, check out the Journal on the nightstand&#33;\r<br />\r<br />[b] Version 1.3 Update[/b]\r<br />\r<br />After spending a lot of time unsuccessfully trying to get the watchtower&#39;s navmesh to work, I&#39;ve chosen to replace the tower entirely. The new tower offers considerably more than the prior one, and I&#39;m pleased to announce its navmesh works splendidly. Also included in this latest release is a safe hidden behind the left weapon plaque in the master bedroom. I&#39;ve also polished the entry way separating the enchanting area and the mead hall. I hope you&#39;ll enjoy the improvements.",
  "categoryId": "68",
  "version": "1.4",
  "author": "Kraeten",
  "createdUnix": "1340444899",
  "updatedUnix": "1341677757",
  "containsAdultContent": false,
  "uploadedBy": "Kraeten",
  "primaryFile": null,
  "files": [
    {
      "fileId": "72796",
      "name": "Fort Ironcrag 1_4",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "208",
      "fileName": "Fort Ironcrag 1_4-19262-1-4.zip",
      "uploadedUnix": "1341677757",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/5dd73455be5c01e7de9ee4fcfdb97e1e9bd5e35abb9c16c56de11fb79565c5b4/analysis/1407007805/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fort%20Ironcrag%201_4-19262-1-4.zip?fid=72796&ttl=1535786597&ri=8192&rs=8192&setec=43065e84fd131da243800817695d15c7"
    }
  ]
}