{
  "modId": 19263.0,
  "modName": "Dragon Age Series Weapon Packs",
  "summary": "This is my Dragon Age series weapons collection from the Skyrim Workshop rolled up into a single mod.",
  "descriptionHtml": "[youtube]7Utk8EIqeFY[/youtube]\r<br />\r<br />There are multiple parts due to Steam&#39;s 100MB (uncompressed) upload limit. I&#39;m not going to fork the releases just to have a single file for here.\r<br />\r<br />Pack 1 contains: Vigilance, Starfang, Finesse, Spider&#39;s Heart, Staff of Parthalan, The Murder Knife, Thorval&#39;s Luck, and The Veshialle\r<br />Pack 2 contains: Valos Atredum, Bassrath-Kata (Bow, Longsword, Greatsword, Dagger, Staff, Staffsword), Yusaris, and Asala.\r<br />Pack 3 contains: Maric&#39;s Blade, Keening Blade, Dwyn&#39;s Longsword, The Summer Sword, Trian&#39;s Maul, BackStabber, HeartBreaker, Dal&#39;Thanaan, Might of the Sten, and the Knight Commander&#39;s Sword.\r<br />\r<br />Poly counts range from 1k to 8k (2k to 15.7k tris). Texture sizes are generally 1024x2048. Made using 3ds Max 2011, Photoshop CS4, and Mudbox 2012. Note: These are new meshes and textures. I only used the original meshes/textures/screenshots for reference.\r<br />\r<br />The unique named versions of the weapons are placed throughout Skyrim. I&#39;ve put up videos showing exactly where as well as listed their locations below.\r<br />\r<br />Installation: Extract the BSA and ESP to your Skyrim&#92;Data folder and make sure it is in your load order.\r<br />*Note: You will need 7zip or WinRar to open the archives. Windows&#39; zip integration will report the files as corrupt.\r<br />\r<br />-Weapons:\r<br />------------------------------------------------------------------------------------------------------------------------------------------\r<br />Vigilance Longsword/Greatsword - Top of Refugee&#39;s Rest/ Top of South Skybound Watch\r<br />\r<br />You&#39;ll need a couple dragon scales, a dragon bone, a diamond, 5 steel ingots, and dragon armor smithing to craft this (listed under Dragon). An additional ingot and scale are needed to temper.\r<br />\r<br />Stat-wise, they are slightly stronger than Skyforge Steel, weigh a couple pounds more, and have better crit stats.\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------\r<br />Starfang Longsword/Greatsword - Top of Nilheim/Top of Rlbthar\r<br />\r<br />To craft, grab Refined Malachite, an Orichalcum Ingot, a Corundum Ingot, some Iron Ore (space ore&#33;), 3 Leather Strips, and the Orcish Smithing Perk. You&#39;ll need an additional Orichalcum Ingot to temper.\r<br />\r<br />Stat-wise, they have less raw power than daedric, higher crit chance and damage, weigh a few pounds less, swing a little faster, and have a lower value.\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------\r<br />Finesse and Spider&#39;s Heart Dagger - At the Morrowind gate east of Riften past Blackbriar&#39;s. Held by a lvl26 Foreigner up the mountain path.\r<br />\r<br />You cannot craft Spider&#39;s Heart or Finesse, but you can craft standard versions of them using 2 Steel Ingots, an Iron Ingot, a few Leather Strips, and the Steel Smithing Perk. Both are listed under Steel.\r<br />\r<br />You&#39;ll need a Steel Ingot to temper Finesse and Refined Malachite for Spider&#39;s Heart along with their respective smithing perks. Standard variants just need a Steel Ingot.\r<br />\r<br />Stats:\r<br />Finesse: About on par with Skyforge Steel Daggers with slightly better crit stats and longer reach.\r<br />Spider&#39;s Heart: About on par with Glass Daggers with slightly better crit stats and longer reach.\r<br />Dalish and Long Steel Dagger: About on par with Steel Daggers with slightly better crit stats and longer reach.\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------\r<br />Staff of Parthalan (also has a greatsword variant) - The Midden Dark&#39;s cellar. Held by two skeletons.\r<br />\r<br />Neither the staff nor the sword can be forged. You will have to defeat their owners in The Midden Dark (coc winterholdcollegemidden02). If you get to the gauntlet, they&#39;re in that cellar area past the goat. The owners are level 26, so prepare accordingly.\r<br />\r<br />You&#39;ll need an iron ingot, steel ingot, and leather strips to temper the sword. The staff, well, it&#39;s a staff. No tempering there.\r<br />\r<br />Stat-wise, the greatsword variant is as strong as a steel greatsword. It is slightly faster, but has lower stagger stats.\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------\r<br />The Murder Knife - Just North of Riverwood on the mountain side next to its last victim. You may need to scour the ground to find it. Apparently, it doesn&#39;t want to stay in the poor guy&#39;s back.\r<br />\r<br />The unique variant can be found northeast of Riverwood (just right out of town) in the back of its last victim (who is currently lying on a boulder). See video for exact location. If you have the &#92;&#34;Dovahkiin Hideout&#92;&#34; and &#92;&#34;Spend Dragon Souls for Perks&#92;&#34; mods installed, it is on the same side of the river between the stones and the hideout entrance.\r<br />\r<br />To craft, you&#39;ll need the same ingredients as a steel dagger, but with a few more leather strips. To temper both variants, you&#39;ll need a steel ingot.\r<br />\r<br />Stats: The unique variant has better raw damage, crit damage, and weighs a pound less than a steel dagger. It also uses Ghostblade&#39;s and Valdr&#39;s Lucky Dagger&#39;s enchantments to apply armor-ignoring damage and have a 25% chance to inflict a critical hit. The standard variant is still better than a steel dagger, but the improvements are toned down a bit.\r<br />------------------------------------------------------------------------------------------------------------------------------------------\r<br />Chasind Great Hammer/Thorval&#39;s Luck - Craftable/Wielded by a Forsworn in Lost Valley Redoubt\r<br />\r<br />To craft, you&#39;ll need Dwarven Smithing (listed under dwarven), an iron ingot, a couple steel ingots, a couple iron ores, and several leather strips. An additional steel ingot and iron ore are required to temper both the standard and unique variants.\r<br />\r<br />Stats: Chasind has slightly lower stats than a dwarven hammer while Thorval&#39;s has slightly higher. Thorval&#39;s has an enchantment that will absorb health and stamina as well as lower the target&#39;s damage resistance. I had wanted it to boost hp, health regen, and damage resist like the originals, but the Creation Kit does not allow those types of enchantments on weapons.\r<br />\r<br />Regarding the visual differences: The original Chasind Hammer was a supersaturated, shiny red while Thorva&#39;ls was &#34;normal&#34;. I opted not to oversaturate and &#34;polish&#34; my version. It is still red, but not overly so.\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------\r<br />Ash Warrior War Axe/The Veshialle - Craftable/Wielded by a Wood Elf in Weynon Stones\r<br />\r<br />To craft, you&#39;ll need Steel Smithing (listed under Steel), an iron ingot, a steel ingot, and several leather strips. An additional steel ingot is required to temper both the standard and unique variants.\r<br />\r<br />Stats: The Ash Warrior War Axe has similar stats to Steel while The Veshialle has elven-ish stats. Both have been tweaked to have slightly higher critical and damage stats.\r<br />\r<br />Differences: The Veshialle has red leather and a shock enchantment that slows enemies down. The Ash Warrior War Axe has brown leather and no enchantment.\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------\r<br />Ornate Dwarven Hammer/Valos Atredum - Craftable/Wielded by an Afflicted in Bthardamz\r<br />\r<br />To craft, you&#39;ll need the same ingredients as a dwarven hammer, but with a handful of rubies and the spell Transmute (got to explain small rubies to large rubies somehow).\r<br />\r<br />To temper: The ornate variant needs a dwarven ingot. Valos Atredum needs moonstone and steel ingots.\r<br />\r<br />Stats: The ornate variant has Dwarven Warhammer stats while Valos Atredum weights a couple pounds less, swings slightly faster, does more critical damage (approx 36% more), has double the crit % mult, and does slightly more raw damage.\r<br />\r<br />If you use any mods that alter gem textures, the Ornate variant might look different as it uses those textures.\r<br />\r<br />Differences: Valos is based off of the original from Dragon Age Origins - Awakening. So, blue stones with a steel body. It also has an enchantment to absorb health and paralyze targets. The Ornate Dwarven Warhammer was designed to look similar to Dwemer weapons. So, rubies with a dwemer metal body. No enchantments.\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------\r<br />Qunari Weapons/Bassrath-Kata - Craftable/Given to the player upon finishing the Main Quest\r<br />Current items: Bow, Longsword, Greatsword, Dagger, Staff, Staffsword\r<br />\r<br />To craft, you&#39;ll need Steel Smithing and some of the following (depending on weapon): Sapphire, Leather Strips, Steel Ingots, Iron Ingots. You cannot craft the Staff or Staffsword. They are reward-only. Should you want to add them manually, open the console and type &#34;help bassrath&#34;. They should be the last two entries.\r<br />\r<br />To temper the blades, you&#39;ll need steel ingots.Given bow damage comes from arrows (mostly), there&#39;s no tempering.\r<br />\r<br />The unique variants have an enchantment that drains stamina, has a chance to stagger, a chance to instantly kill, and does extra damage to humans.\r<br />\r<br />Stats: Qunari (standard) variants are based on Skyforge Steel weapons. The unique variants have higher critical damage, critical chance, stagger chance, and are a bit lighter.\r<br />\r<br />You can start a quest to obtain the unique variants Southwest of Northwatch Keep. There will be a note in a boat.\r<br />\r<br />The original bow from DA2 is a longbow, but I had issues getting the bow weighted and working let alone scaling it up and hoping the skeleton would be compatible with the animations.\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------\r<br />Shaperate&#39;s Blessing/Yusaris - Craftable/Found in the world)\r<br />\r<br />The unique variant can be found North of the Wreck Of The Brinehammer, underwater, under a log. See video for exact location.\r<br />\r<br />To craft Shaperate&#39;s Blessing, you&#39;ll need steel ingots, a dragon scale, some leather strips, and Dragon Smithing.\r<br />\r<br />To temper both weapons, you&#39;ll need a steel ingot.\r<br />\r<br />Stats: Yusaris is about on par with a Skyforge Steel Greatsword with better crit and stagger chances. Shaperate&#39;s Blessing is a couple pounds heavier, does slightly less raw damage, and has lower crit and stagger chances.\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------\r<br />Thedosian Greatsword/Asala - Craftable/Found in the world\r<br />\r<br />The unique variant can be found in Goldenglow Estate (goldenglowestate02 to be exact) above a shelf.\r<br />\r<br />To craft the Thedosian Greatsword, you&#39;ll need steel ingots, iron ingots, gold ingots, and some leather strips. Listed under Steel.\r<br />\r<br />To temper the weapons, you&#39;ll need a steel ingot.\r<br />\r<br />Stats: Asala is about on par with a Skyforge Steel Greatsword with better crit and stagger chances. The Thedosian Greatsword is a pound heavier, does slightly less raw damage, has slightly lower crit damage, and has lower crit and stagger chances.\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------ \r<br />Steel Blade/Maric&#39;s Blade - Craftable/Found in the world \r<br />\r<br />The unique variant can be found on a Khajit Bandit near Whiterun (tamriel -7,-4). You&#39;ll have to be quick to catch him as he&#39;ll assault anything nearby. Alternatively, you can let him get stomped to dust by a Mammoth and loot his corpse. \r<br />\r<br />To craft the Steel Blade, you&#39;ll need steel ingots, gold ingots, leather strips, and 5 Septims. Listed under Steel. \r<br />\r<br />To temper the weapons, you&#39;ll need a steel ingot. \r<br />\r<br />Stats: Maric&#39;s Blade is a little weaker than a Skyforge Steel Sword. The Steel Blade is a little weaker than Maric&#39;s Blade. \r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------ \r<br />Darksteel Blade/Keening Blade - Craftable/Found in the world \r<br />\r<br />The unique variant can be found at Snowpoint Beacon (tamriel 13, 17). Warning: The npc that has the blade is a bit tough.\r<br />\r<br />To craft the Darksteel Blade, you&#39;ll need steel ingots, ebony ingots, and some leather strips. Listed under Steel. \r<br />\r<br />To temper the weapons, you&#39;ll need a steel ingott. \r<br />\r<br />Stats: The Keening Blade is a little weaker than Maric&#39;s. The Darksteel is a little weaker than the Keening Blade. \r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------ \r<br />Steel Longsword/Dwyn&#39;s Longsword - Craftable/Found in the world \r<br />\r<br />The unique variant can be found behind a Centurion framework in Blackreach (blackreach 3,3). \r<br />\r<br />To craft the Steel Longsword, you&#39;ll need steel ingots, gold ingots, and some leather strips. Listed under Steel. \r<br />\r<br />To temper the weapons, you&#39;ll need a steel ingot. \r<br />\r<br />Stats: Dwyn&#39;s Longsword is a little weaker than the Keening Blade with the Steel Longsword a little weaker than Dwyn&#39;s. \r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------ \r<br />Orlesian Greatsword/The Summer Sword - Craftable/Found in the world \r<br />\r<br />The unique variant can be found near the word wall in Dustman&#39;s Cairn (last room). \r<br />\r<br />To craft the Orlesian Greatsword, you&#39;ll need steel ingots, silver ingots, corundum ingots, and some leather. Listed under Steel. \r<br />\r<br />To temper the weapons, you&#39;ll need a steel ingot and silver ingot. \r<br />\r<br />Stats: The Summer Sword is a little weaker than and Ebony Greatsword. The Orlesian Greatsword is a little weaker than The Summer Sword.\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------\r<br />Diamond Maul/Trian&#39;s Maul - Craftable/Found in the world\r<br />\r<br />The unique variant can be found at Robber&#39;s Gorge (RobbersGorgeExterior3) leaning on  a table.\r<br />\r<br />To craft the Diamond Maul, you&#39;ll need Steel Ingots, Iron Ingots, Firewood, and some Leather Strips. Listed under Wood, but requires Steel Smithing.\r<br />\r<br />To temper the weapons, you&#39;ll need Firewood.\r<br />\r<br />Stats: Trian&#39;s Maul has similar stats to a dwarven warhammer. The Diamond Maul is slightly weaker than Trian&#39;s.\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------ \r<br />Might Of The Sten/Ornate Qunari Greatsword - Craftable/Found in the world \r<br />\r<br />The unique variant can be found in a chest behind Froki&#39;s Shack\r<br />\r<br />To craft the Ornate Qunari Greatsword, you&#39;ll need steel ingots, gold ingots, and some leather strips. Listed under Steel. \r<br />\r<br />To temper the weapons, you&#39;ll need a couple steel ingots.\r<br />\r<br />Stats: Might Of The Sten is a little weaker than an Ebony Greatsword. The Ornate Qunari Greatsword is a little weaker than Might Of The Sten.\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------ \r<br />Dal&#39;Thanaan/Double-Bearded Axe - Craftable/Found in the world \r<br />\r<br />The unique variant can be found in a chest behind Froki&#39;s Shack\r<br />\r<br />To craft the Double-Bearded Axe, you&#39;ll need firewood, Corundum Ingots, and Steel Ingots. Listed under Steel. \r<br />\r<br />To temper the weapons, you&#39;ll need corundum and steel ingots.\r<br />\r<br />Stats: Dal&#39;Thanaan is a little weaker than a Daedric Greataxe. The Double-Bearded Axe is a little weaker than Dal&#39;Thanaan.\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------ \r<br />HeartBreaker and BackStabber/Rogue&#39;s Dagger - Craftable/Found in the world \r<br />\r<br />The unique variant can be found in a chest behind Froki&#39;s Shack\r<br />\r<br />To craft the Rogue&#39;s Dagger, you&#39;ll need Corundum and Steel Ingots. Listed under Steel. \r<br />\r<br />To temper the weapons, you&#39;ll need a steel ingot.\r<br />\r<br />Stats: HeartBreaker and BackStabber are a little weaker than a Skyforge Steel Dagger. The Rogue&#39;s Dagger is a little weaker than HeartBreaker and BackStabber.\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------ \r<br />Templar&#39;s Sword/Knight Commander&#39;s Sword - Craftable/Found in the world \r<br />\r<br />The unique variant can be found near Winterhold (Specifically, Cell 30,21).\r<br />\r<br />To craft the Templar&#39;s Sword, you&#39;ll need a Corundum Ingot, Steel Ingots, and Leather. Listed under Steel. \r<br />\r<br />To temper the weapons, you&#39;ll need a Steel Ingot and a Corundum Ingot.\r<br />\r<br />Stats: The Knight Commander&#39;s Sword is a little weaker than an Ebony Greatsword and the Templar&#39;s Sword is a little weaker than the Knight Commander&#39;s Sword\r<br />\r<br />Note: Unlike previous weapon releases, there are no special enchantments on these swords, but all are enchantable.\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------\r<br />Credit to Bioware for the original weapons.\r<br />\r<br />I&#39;m wearing Warmage Armor, Scout Armor&#39;s cape, Iorveth Armor, [url=http://skyrim.nexusmods.com/mods/33081]Blood Dragon Armor[/url], [url=http://www.nexusmods.com/skyrim/mods/68770]Sentinel Armor[/url], Triss&#39; Armor Retextured, DA2&#39;s Champion Mage Armor, and my Western-style Hat in the screenshots.\r<br />\r<br />Workshop links:\r<br />[url=http://steamcommunity.com/sharedfiles/filedetails/?id=78112039]Pack 1[/url]\r<br />[url=http://steamcommunity.com/sharedfiles/filedetails/?id=84190367]Pack 2[/url]\r<br />[url=http://steamcommunity.com/sharedfiles/filedetails/?id=135514465]Pack 3[/url]\r<br />\r<br />If there are any problems, please let me know.\r<br />\r<br />Known issues:\r<br />\r<br />-The Ornate Dwarven Warhammer&#39;s gemstone faces may lose their color. This occurs when there is either a strong reflection off the face or if you look through the gem to the underside of its retention ring.\r<br />\r<br />-The Bassrath-Kata enchantment can interrupt killmoves and make enemies immortal for a short period of time. I think this is because ragdolling an enemy in that state resets them and prevents them from taking damage (much like that ring that shoots you into the air and ragdolls you to keep you from taking damage). If you decapitate them, well, they&#39;ll still be alive, kicking, and taunting.",
  "categoryId": "55",
  "version": "3.1",
  "author": "Rand0mNumbers",
  "createdUnix": "1340445143",
  "updatedUnix": "1494116475",
  "containsAdultContent": false,
  "uploadedBy": "Rand0mNumbers",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000028137",
      "name": "Dragon Age Weapon Pack - Part 1",
      "version": "1.3.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "42468",
      "fileName": "Dragon Age Weapon Pack - Part 1-19263-1-3-1.zip",
      "uploadedUnix": "1367706846",
      "modVersion": "1.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/19da21441aa8b01db378e887e9081fe0c1fb6329ee0a82e055195255e730af36/analysis/1407555154/",
      "changelogHtml": " Fixed Finesse having the wrong 1stperson model <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Age%20Weapon%20Pack%20-%20Part%201-19263-1-3-1.zip?fid=1000028137&ttl=1535786599&ri=8192&rs=8192&setec=d3197e126ca9c0414a2c38209003ece1"
    },
    {
      "fileId": "1000236284",
      "name": "Dragon Age Weapon Pack - Part 3",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "38870",
      "fileName": "Dragon Age Weapon Pack - Part 3-19263-3-0.zip",
      "uploadedUnix": "1487052697",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/c4bec81d1b0e5e261be6ab40169f1db1e46eef3b5194a26f195939b8ee7b0329/analysis/1487053031/",
      "changelogHtml": " Added the Knight Commander&#39;s Sword and Templar&#39;s sword <br/> \n Corrected Tempering Recipe for The Keening Blade (Thanks SuicideCommando&#33;) <br/> \n Compatibility Warning: Added Midden Recipe <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Age%20Weapon%20Pack%20-%20Part%203-19263-3-0.zip?fid=1000236284&ttl=1535786599&ri=8192&rs=8192&setec=b806feb8c94afb78626d6f863bcb23cd"
    },
    {
      "fileId": "1000241902",
      "name": "Dragon Age Weapon Pack - Part 2",
      "version": "2.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "53824",
      "fileName": "Dragon Age Weapons - Pack 2-19263-2-1-1.zip",
      "uploadedUnix": "1492308862",
      "modVersion": "2.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/fea5bbd7dcf3220da5071d9d42fa2857fea3edfeb4ee3580d29f283f0115f5f8/analysis/1492309209/",
      "changelogHtml": " Changed Orlesian Greatsword&#39;s crafting location from Skyforge to all forges <br/> \n Changed Orlesian Greatsword&#39;s material from Silver to Steel <br/> \n Added missing quest scripts <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Age%20Weapons%20-%20Pack%202-19263-2-1-1.zip?fid=1000241902&ttl=1535786600&ri=8192&rs=8192&setec=e33bfb0439b2d37c4d61b5b82a218f5f"
    },
    {
      "fileId": "1000243615",
      "name": "Dragon Age Weapon Pack - Part 2",
      "version": "2.1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "53824",
      "fileName": "Dragon Age Weapon Pack - Part 2-19263-2-1-2.zip",
      "uploadedUnix": "1494114784",
      "modVersion": "2.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/b4169ebacf7bbe0014fd896e11069004119164d6b0cbc4eb4d9fb41494ccf30c/analysis/1494115149/",
      "changelogHtml": " Added BassrathKata Bow tempering recipes <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Age%20Weapon%20Pack%20-%20Part%202-19263-2-1-2.zip?fid=1000243615&ttl=1535786600&ri=8192&rs=8192&setec=edafa5708d72f2463ba32603216e91dd"
    },
    {
      "fileId": "1000243618",
      "name": "Dragon Age Weapon Pack - Part 3",
      "version": "3.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "39236",
      "fileName": "Dragon Age Weapon Pack - Part 3-19263-3-1.zip",
      "uploadedUnix": "1494116475",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/dcf59f58845a7ee0d34a05b5759a3ea7a855c9a8005560d7c1b19eac6dfeed08/analysis/1494116770/",
      "changelogHtml": " Corrected Might of the Sten sounds <br/> \n Added Rogue&#39;s Dagger crafting and tempering recipes <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Age%20Weapon%20Pack%20-%20Part%203-19263-3-1.zip?fid=1000243618&ttl=1535786601&ri=8192&rs=8192&setec=3b72851ec7325aaeb4ca085297d3aead"
    }
  ]
}