{
  "modId": 19291.0,
  "modName": "Dragon Bone Mage Armor by Natterforme",
  "summary": "This is a Nexus Exclusive. This mod adds a set of mage armor for high level characters with an interest in magic.",
  "descriptionHtml": "\r\n\r\n\r\nName: Dragon Bone Mage Armor by Natterforme\r\n Version: 1.1\r\n Date: 2/20/2013\r\n Category: Weapons and Armor\r\n Recommended: Skyrim Mod Manager\r\n Author(s): Natterforme\r\n Source: \r\n \r\nDescription\r\n ===========\r\n This is a Nexus Exclusive. This mod adds a set of mage armor for high level characters with an interest in magic.\r\n \r\nLocation\r\n ========\r\n The only place to get these items is through the crafting forge. \r\n\r\nDetails\r\n =======\r\n THIS IS A NEXUS EXCLUSIVE! NO STEAM SUPPORT WILL BE OFFERED AT THIS TIME! IF I FIND THAT THIS HAS BEEN UPLOADED TO STEAM WITHOUT MY PERMISSION I WILL NOT BE LENIENT TOWARDS THE UPLOADER(S). YOU HAVE BEEN WARNED!!!\r\n\r\nThis mod adds armor for high level characters. The armor can be worn by both males and females. The armor comes in Heavy, Light, and Non Armor varieties to match personal play styles. There is a cuirass, two sets of gloves, two sets of boots, six hood varieties, and four possible decorational items. The main pieces come in all respective armor types and the decorational pieces are all three armor types. The decorational pieces are bone ordaments: a bone tail attachment, a folded wings attachment, a large set of open wings attachment, and a small set of open wings attachment. The bone tail can be used with any set of wings but the wings can not be used together. None of the bone ordaments have major stats but you can wear them and not have to worry about breaking a particular play style or perk advantage. Please note that the hood are not intended for Beast races but some of them can be worn by Beast races without a major change in appearance. All hood pieces have the same stat values relative to their armor type. This is intended so that you can wear which ever hood you want that pleases your aesthetic tastes without having to make a sacrifice in the items\\' stat value.\r\n\r\nAll pieces of the equipement can be crafted at any forge and all items can be upgraded. The non armor pieces do not require any perks to create, but come with no armor protection - intended for mages. The Light Armor version requires the perk Wind Walker to craft their respective set. The Heavy Armor varient requires the Dragon Armor smithing perk. Each piece has stats relative to its play style and an appropriate set of crafting materials.\r\n\r\nIf you do not like the values of the stats then five minutes in the CK can make them whatever your want. If you feel that the equipment is too overpowered then just increase your difficulty setting.\r\n\r\nWe are now available in Spanish!\r\n\r\nhttp://skyrim.nexusmods.com/mods/19619\r\n\r\n\r\nInstall\r\n =======\r\n You can either download this mod with the Nexus mod manager or download the files and extract into the Skyrim data folder. Be sure to check the tick box in your data files section on the Skyrim launcher.\r\n \r\nUninstall\r\n =========\r\n Either use Nexus Mod Manager to remove the files or manually remove them from you Skyrim/Data folder. \r\n\r\nUpgrade\r\n =======\r\n I plan to upgrade and improve this mod over time as I fix bugs, think of new ideas, become more adapted to the CK, and so on. Be sure to check back in once and awhile for updates. Be sure to completely uninstall any previous versions of this mod before upgrading though.\r\n \r\nI will not take responsibility for corrupted save games or lost save games. Get into the habit of backing up your saves to protect your game data. Ignore at your own risk!\r\n\r\nIncompatibility\r\n ===============\r\n This mod uses vanilla textures and models in some places. If you are using retextures or model replacers this could cause unintended and unanticipated effects to your character while using this mod. If you notice any other incompatibility then please let me know about it.\r\n \r\nKnown Issues or Bugs\r\n ====================\r\n There is a small chance that wearing the Dragon Bone Gauntlets will cause your hands to disappear. This is not a fault on my part as this appears to happen randomly and may or may not be caused by recent CK changes. If a fix is found a future version of the mod will contain it.\r\n \r\n\r\nHistory\r\n =======\r\n 2/20/2013- Version 1.1\r\n -Gauntlets should now not randomly disappear.\r\n -Fixes some texture issues.\r\n \r\n 7/2/2012- Version 1.05\r\n \r\n-NPCs should no longer be under the impression that you are naked and will recognize that you are indeed wearing clothes.\r\n-Gauntlets should now no longer randomly disappear.\r\n-Corrected some Recipes under the crafting forge to require the proper ingredients\r\n\r\n 6/23/2012- Initial Release\r\n \r\n Contact\r\n =======\r\n You can find me on the Nexus Forums here as Natterforme.\r\n \r\nCredits\r\n ======= \r\n \r\n Thanks to Gardion for his Spanish translation!\r\n Thanks to Bethesda for creating Skyrim.\r\n Thanks to SkyrimNexus.com for the a one-stop-shop resource for authors and players.\r\n Thanks to LHammonds for the Readme Generator this file was based on.\r\n Thanks to all of you who have encouraged me and have supported this armor mod since I first put up screenshots of it back in December 2011 and January 2012.\r\n I thank you all for your patience with me^^.\r\n Thanks to God for creating us all. Amen.\r\n \r\nTools Used\r\n==========\r\n7-Zip - http://www.tesnexus.com/downloads/file.php?id=15579\r\nBlender - http://www.tesnexus.com/downloads/file.php?id=12248\r\nNIFSkope - http://niftools.sourceforge.net/wiki/NifSkope\r\nOblivion Mod Manager - http://www.tesnexus.com/downloads/file.php?id=2097\r\nPaint.NET - http://www.tesnexus.com/downloads/file.php?id=11909\r\nPhotoshop - http://www.adobe.com/products/photoshop/\r\nReadme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r\n\r\n Licensing/Legal\r\n ===============\r\n This is a Skyrim Nexus Exclusive.\r\n\r\n You MUST contact me before you do anything with this mod in any form for any reason. This includes language translations. I will NOT be providing Steam Workshop support at this time. I do not feel comfortable with their legal policies towards modding so I will not use it. I will not support or endorse its use at this time. If I want it to be on Steam, I will do so myself. If you see this on Steam, LET ME KNOW! I will not support any version of this mod found on Steam. I will not accept any childish excuse about \\\"sharing\\\" with the community. If you refuse to respect my wishes, I can not, in good faith, respect yours.\r\n\r\n -Natterforme\r\n \r\n",
  "categoryId": "54",
  "version": "1.1",
  "author": "Natterforme",
  "createdUnix": "1340490541",
  "updatedUnix": "1361414442",
  "containsAdultContent": false,
  "uploadedBy": "Natterforme",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69902",
      "name": "Dragon Bone Mage Armor ver1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3638",
      "fileName": "Dragon Bone Mage Armor ver1_0-19291-1-0.zip",
      "uploadedUnix": "1340490757",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/49a9de5ad8d73da02f0545bba4c88164909ba58512d30a0e3cf79e1b1ead82e6/analysis/1406978825/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Bone%20Mage%20Armor%20ver1_0-19291-1-0.zip?fid=69902&ttl=1535786658&ri=8192&rs=8192&setec=2169bc981688be396673df8c8deb0a78"
    },
    {
      "fileId": "71708",
      "name": "Dragon Bone Mage Armor ver1_05",
      "version": "1.05",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3638",
      "fileName": "Dragon Bone Mage Armor ver1_05-19291-1-05.zip",
      "uploadedUnix": "1341251751",
      "modVersion": "1.05",
      "virusScanUrl": "https://www.virustotal.com/file/3c5b392336fe41f60ecc95b998012856d7272ee06db7a5fcfbf0a9f3a989c7ec/analysis/1406996834/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Bone%20Mage%20Armor%20ver1_05-19291-1-05.zip?fid=71708&ttl=1535786659&ri=8192&rs=8192&setec=a18154e642850d26b790a51d49ff2904"
    },
    {
      "fileId": "1000011701",
      "name": "Dragon Bone Mage Armor ver1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3662",
      "fileName": "Dragon Bone Mage Armor ver1_1-19291-1-1.zip",
      "uploadedUnix": "1361414442",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9dec02d4be2755fd4c68b65314c7fe1818132de7b55168e56e8b1242e6834e4c/analysis/1407430232/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Bone%20Mage%20Armor%20ver1_1-19291-1-1.zip?fid=1000011701&ttl=1535786659&ri=8192&rs=8192&setec=c047d84425262d27604880aad024e35c"
    }
  ]
}