{
  "modId": 19299.0,
  "modName": "No Lightfoot",
  "summary": "Removes the Lightfoot perk from the Sneak tree.",
  "descriptionHtml": "We all know the scenario; You\\'re exploring a creepy dark ruin, trampling pressure plates with reckless abandon because you know that the rusty old things no longer function. How do you know this? You just know. \r\n\r\nOf course, you took the Lightfoot perk a long time ago, because maxing out the Sneak tree is part of your modus operandi. But don\\'t you miss the thrill of danger that you enjoyed back in the days when you actually had to be careful where you stepped? Especially if you use \\\"Deadly Traps\\\" or similar mods that make those poison darts and flame jets genuinely lethal -- Well, I do, which is why I made this mod. \r\n\r\n\\\"No Lightfoot\\\" removes the Lightfoot perk from the Sneak tree, ensuring that those pressure plates remain every bit as dangerous at high levels as they were when you started your game. \r\n\r\nInstallation:\r\nInstall with Nexus Mod Manager or manually extract the 7-Zip archive and place the Data folder in your Skyrim folder (Computer/Program Files(x86)/Steam/Steamapps/Common/Skyrim) and chack the box in your Data Files at launch.\r\n\r\nCompatibility:\r\nThis will probably conflict with anything else that modifies the Sneak perk tree.",
  "categoryId": "24",
  "version": "1.1",
  "author": "Wolfgang",
  "createdUnix": "1340498810",
  "updatedUnix": "1340771406",
  "containsAdultContent": false,
  "uploadedBy": "Lysanias",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70538",
      "name": "No Lightfoot",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "No Lightfoot-19299-1-1.7z",
      "uploadedUnix": "1340771406",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2c2cd89ae655992e87a4635ed9a973c5322d8bcc3bf194f526a7e0e1088acb1a/analysis/1406985316/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Lightfoot-19299-1-1.7z?fid=70538&ttl=1535786671&ri=8192&rs=8192&setec=e14d27b7e822d10a72115000be1d93ed"
    }
  ]
}