{
  "modId": 19296.0,
  "modName": "Fat Nords",
  "summary": "Adds a race that is fatter than nords. Works with all animations and armor. Can also be used to make every race fatter by simple renaming.",
  "descriptionHtml": "Hello.\r\n\r\nThis is a mod that adds a new race to skyrim called \\\"fat nords\\\" which are basically just nords who are, well, fat. They have a modded skeleton that makes them so, so this mod works with all armor and such. In addition, it works fine with the animations too. Also works on the female race to, but haven\\'t tested that feature very extensively. Should do fine though.\r\n\r\nIf you want this to be on all races (except argonian and khajiit, they require special attention) you need to copy the \\\"fatskeleton\\\" file and add it to the folder it is in under the name \\\"skeleton\\\"\r\nIt is in the data/meshes/actors/character/characterassets folder.\r\n\r\n*known issues: This will probably not look good if you have anything that mods the base mesh of the character (so when they dont have any clothes on, it wont look good). One example would be better males.\r\n*werewolves and vampires are not included for the new race. \r\n*It doesn\\'t look as good with females as with males\r\n\r\nConflicts:\r\nThis shouldn\\'t conflict with anything, but if you decide to replace everyone\\'s skeletons, it WILL conflict with anything that messes with the skeleton of the character. Most mods dont. \r\n\r\nThanks!\r\n",
  "categoryId": "29",
  "version": "1",
  "author": "koechophe",
  "createdUnix": "1340495649",
  "updatedUnix": "1340495760",
  "containsAdultContent": false,
  "uploadedBy": "koechophe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69914",
      "name": "Fatnord",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Fatnord-19296-1.7z",
      "uploadedUnix": "1340495760",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/5b8d3fdf5e8628c228f4fe8367d083c888b90f29db6dfd34f18580a1df2d5cfc/analysis/1406978885/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fatnord-19296-1.7z?fid=69914&ttl=1535786665&ri=8192&rs=8192&setec=b71d2f95af496d696486fa1bb6b61cbd"
    }
  ]
}