{
  "modId": 19298.0,
  "modName": "Races Reviewed by Theme",
  "summary": "Reviews and rebalances the various races with the aim of providing more flavour and doing away with once a day chaff powers. ",
  "descriptionHtml": "[b]Version 1.1.2 Optional Files[/b]\r\n\r\n[i][u]Update:[/u]After further testing it has been confirmed that the health glitch is simply a visual issue with orc health bars not factoring in the health bonus from their racial. They are still taking damage normally, you simply have to negate the +50 bonus before it starts registering on their visible health bars.[/i]\r\n\r\nI added two new files which replace the Orcs\\' Health Bonus with a 10% heavy armor bonus, after  reports that they appeared to receive temporary invulnerability at the start of fights. (Note: The problem seems relatively rare, I have had no real problems with orcs myself.)\r\n\r\nYou only need one of the 4 sets of files as they all do the same thing but with very small specific changes listed in the file descriptions. \r\n\r\n--- --- --- --- ---\r\n\r\n[b]Version 1.1.2[/b]\r\n\r\nSame As the previous version except the Blur effect from night eye was removed, left the old file up for those who prefer to keep the blur. \r\n\r\n--- --- --- --- ---\r\n\r\n[b]Version 1.1[/b]\r\n\r\nAlright I noticed on my end that the Regeneration rates seemed a touch too quick compared to what I had intended, this may have been a cross over with some other mods I have. But as I precaution I uploaded a new version which switches the Heal Rate buff from the Ability version to the Enchantment version which should bring it in line. \r\n\r\nFortunately this doesn\\'t seem to impact the NPCs, many argonians died to verify this.\r\n\r\nIf the rates of Health, Magicka, and Stamina regeneration seem to going back up too quickly for you, open up the console and type the following respectively to get them more in line with intended:\r\n\r\nArgonians: player.setav healratemult number, I recommend somewhere between 15 to 25.\r\n\r\nHigh Elf/Bretons: player.setav magickaratemult number, I recommend somewhere between 25 to 35.\r\n\r\nBretons, Imperials, Nords, Reguard: player.setav staminaratemult number, I recommend somewhere between 25 to 35. \r\n\r\nRemember only do this if the rates seem too speedy. \r\n\r\n--- --- --- --- ---\r\n\r\nThis mod aims to review and rebalance the various TES races with an eye to towards making them more unique but also providing some common theme for humans and elves. This goal is accomplished in large part by doing away with once a day powers, which are all too often forgotten, and providing everyone with a set of useful passives which can blend seamlessly with normal gameplay. \r\n\r\n\r\n[b]Humans[/b] \r\n\r\n[i]As you’ll see all humans have a 25% bonus to stamina regeneration to represent their innate dynamism and drive.[/i]\r\n\r\n\r\n[u]Breton:[/u] \r\n\r\nDual Ancestry - 25% resistance to Magic and Disease. Magicka and Stamina regenerate 25% more quickly. \r\n\r\nHedge Magic Affinity- Conjuration spells last 10% longer, crafted potions are 10% stronger. \r\n\r\n\r\n[u]Imperial:[/u]\r\n\r\nCyrodilic Virtue - Speechcraft is 10% more effective, Stamina regenerates 25% more quickly.\r\n\r\nCyrodilic Discipline - Block, Heavy Armour and Light Armour are 10% more effective. \r\n\r\n\r\n[u]Nord:[/u]\r\n\r\nBlood of Atmora - 50% resistance to Frost, Stamina Regenerates 25% faster.\r\n\r\nSpirit of Ysgramor - Two-handed weapons do 15% more damage, Shouts cool down 10% faster. \r\n\r\n\r\n[u]Reguard:[/u]\r\n\r\nYokudan Fortitude - 25% resistance to Disease and Poison, Stamina regenerates 25% faster.\r\n\r\nWay of the Sword - One handed weapons do 15% more damage, 50 additional points of stamina.\r\n\r\n--- --- ---\r\n\r\n[b]Elves[/b]\r\n\r\n[i]All elves have a 75% resistance to disease to represent their Aldmeri lineage.[/i]\r\n\r\n[u]Altmer:[/u]\r\n\r\nHighborn - 75% resistance to Disease, 50 bonus points of Magicka, Magicka Regenerates 25% more quickly.\r\n\r\nArcane Finesse - Illusion spells and Enchantments are 10% stronger. \r\n\r\n\r\n[u]Bosmer:[/u]\r\n\r\nSylvanborn - 75% resistance to disease.\r\n\r\nSylvan Lore - Bows do 15% more damage, Sneaking is 10% more effective, Restoration spells are 10% stronger.\r\n\r\n\r\n[u]Dunmer:[/u]\r\n\r\nAshborn - 75% resistance to Disease, 50% resistance to Fire.\r\n\r\nDunmer War Arts - Bows, one-handed attacks and destruction spells do 10% more damage. \r\n\r\n--- --- ---\r\n\r\n[b]Beast Races[/b]\r\n\r\n[i]The beast races have no unifying theme unlike the men and mer.[/i]\r\n\r\n\r\n[u]Argonian :[/u]\r\n\r\nHistskin - 50% resistance to Disease and Poison. \r\n\r\nReptilian - Water Breathing, 15 points of Damage Resistance, Health regenerates 25% faster.\r\n\r\nNatural Adaptability - Alteration spells last 10% longer.\r\n\r\n \r\n[u]Khajiit :[/u]\r\n\r\nFelinoid - Khajiit claws do 15 points of damage, +25% movement speed, 50% muffled movement.\r\n\r\nNight Eye – Duration considerably lengthened, essentially making it a toggle. \r\n\r\n\r\n[u]Orc:[/u]\r\n\r\nWaaaaaagh! – Magic resistance of 25%, 50 additional points of health, one and two handed weapons do 10% more damage. \r\n\r\n--- --- --- --- ---\r\n\r\nPlease keep in mind this is my first mod, although I have been tinkering with stuff since Morrowind, I have never really made a full-fledged mod of my own. This mod *only* alters the racial powers themselves, not the races, in order to maximise compatibility and should work with just about everything else. \r\n\r\nAlso keep in mind that while it does make the various races more powerful on the surface of things, this also equally benefits NPCs evening things out. Furthermore TES games are notoriously easy to get overpowered in and no a minor boost at base effectiveness does not suddenly ‘destroy’ the game. \r\n\r\n[u][i]Finally, I know orcs are really elves, but they’re suitably different physically and culturally so I decided not to give them the standard elf bonus.[/i][/u]\r\n\r\n--- --- --- --- ---\r\n\r\n[b]Installation[/b] \r\n\r\nDrop the ESP in your skyrim/data folder and activate. I never used the NMM and never plan to, so I have no idea how well it would work installing it that way, but the mod simple and small enough that it should not cause problems. ",
  "categoryId": "34",
  "version": "1.1.2",
  "author": "Drasanil",
  "createdUnix": "1340496143",
  "updatedUnix": "1340859444",
  "containsAdultContent": false,
  "uploadedBy": "Drasanil",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70314",
      "name": "Races Reviewed by Theme",
      "version": "1.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Races Reviewed by Theme-19298-1-1-1.rar",
      "uploadedUnix": "1340662083",
      "modVersion": "1.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c5ce0e01543ff7ed7cb69264c591c736d43408b98ffe3a77a8a654760781bd32/analysis/1406982968/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Races%20Reviewed%20by%20Theme-19298-1-1-1.rar?fid=70314&ttl=1535786669&ri=8192&rs=8192&setec=09ec41e671d8c15a6bb029c244c5df5e"
    },
    {
      "fileId": "70637",
      "name": "Races Reviewed by Theme - No Night Eye Blur Effect",
      "version": "1.1.2",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "2",
      "fileName": "Races Reviewed by Theme - No Night Eye Blur Effect-19298-1-1-2.rar",
      "uploadedUnix": "1340828406",
      "modVersion": "1.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/5174e922cffa9e791772770de2f437e3c766720abdf9c7bd1672f861e8ac1f85/analysis/1406986506/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Races%20Reviewed%20by%20Theme%20-%20No%20Night%20Eye%20Blur%20Effect-19298-1-1-2.rar?fid=70637&ttl=1535786669&ri=8192&rs=8192&setec=97a1a0fc2211b20b48e7ac3edcf6a9b4"
    },
    {
      "fileId": "70701",
      "name": "Races Reviewed by Theme - No Orc Health Bonus",
      "version": "1.1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Races Reviewed by Theme - No Orc Health Bonus-19298-1-1-2.rar",
      "uploadedUnix": "1340859350",
      "modVersion": "1.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/a38f2cffac73c3797f45a45eb79afef22d106fef7547b59eac3c00c8b92003b0/analysis/1406987166/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Races%20Reviewed%20by%20Theme%20-%20No%20Orc%20Health%20Bonus-19298-1-1-2.rar?fid=70701&ttl=1535786669&ri=8192&rs=8192&setec=132a7a616e67dc80b3cc7db7b004ca3b"
    },
    {
      "fileId": "70702",
      "name": "Races Reviewed by Theme - No Orc Health Bonus - No Night Eye Blur Effect",
      "version": "1.1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Races Reviewed by Theme - No Orc Health Bonus - No Night Eye Blur Effect-19298-1-1-2.rar",
      "uploadedUnix": "1340859444",
      "modVersion": "1.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/84e60dbe85b32ae4f8b17b50bfba737a597dff58328a6d9944040589aa3ef60b/analysis/1406987166/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Races%20Reviewed%20by%20Theme%20-%20No%20Orc%20Health%20Bonus%20-%20No%20Night%20Eye%20Blur%20Effect-19298-1-1-2.rar?fid=70702&ttl=1535786670&ri=8192&rs=8192&setec=73312e221486b6ed5536d4ac083aaeef"
    }
  ]
}