{
  "modId": 19311.0,
  "modName": "The Shadow Scales - Argonian Children in the Dark Brotherhood Sanctuary",
  "summary": "Veezara trained four new Dark Brotherhood members. They are Shadow Scales, Argonian children, trained to be members of the Dark Brotherhood from hatching. They practice their skills very hard to honour their mentor, Veezara.",
  "descriptionHtml": "Warning: Contain spoilers about the Dark Brotherhood Quest!\r\n\r\n------------------------------------------------------------------------------------------------------------\r\nUpdate: after a lot of feedbacks from users, I tested myself and checked that this MOD requires Apachi Hair and Race Compatibility esm\\'s to be loaded before the .esp file. It was a mistake I made when I was developing this MOD, but since I\\'m not working on it anymore, it probably won\\'t be fixed, unless I decide to make a version 3.0 of this MOD.\r\n\r\nUpdate: solved the problem of Veezara not comming back to the sanctuary if you dismiss him after accepting him as a follower.\r\n\r\nUpdate: added a version with Veezara\\'s Ghost in Dawnstar Sanctuary! He is there to train the Shadow Scales. And he is also an available follower.\r\n\r\nUpdate: in the version 1.1 I turned one of the Shadow Scales into an archer and solved the problem with they asking you to leave the sanctuary after midnight.\r\n\r\n------------------------------------------------------------------------------------------------------------\r\n\r\nAbout this Mod:\r\n\r\nThis is another Mod I created to bring more life to new sanctuary in Dawnstar. As I stated before, I hate the tragic ending of the Dark Brotherhood. This Mod, however, honours one of the dearest members of the Dark Brotherhood: Veezara.\r\n\r\nVeezara was awesome. He practiced day and night, he knew blacksmithing and since he was raised from hatching to be the perfect assassin, he was as loyal as one can be.\r\n\r\nIn one of his dialogues, he tells you a story about the Shadow Scales, argonian assassins trained from hatching. Well, he wasn\\'t just bragging. In this Mod, four new members of the Shadow Scales, secretly trained by Veezara, join the Dark Brotherhood!\r\n\r\nThe four new members of the Dark Brotherhood are all argonians, two boys and two girls. And they are all children! I don\\'t know why there aren\\'t any Argonian Children in the game, but at least now there are four of them and they are all assassins.\r\n\r\nThey train hard from 12 AM to 8 PM. At least someone is using those dummies in the Dawnstar Sanctuary. I don\\'t know how much you liked Veezara, but seeing those four kids delivering power attacks in those dummies really warms my heart. Veezara\\'s death wasn\\'t in vain.\r\n\r\nI also added four bedrolls in one of the rooms in Dawnstar Sanctuary, so they have a place to sleep. They sleep from midnight to 8 AM. It is funny to see how organized they are: when time reaches midnight, they all stop instantly what they were doing and march to the beds. Veezara\\'s military training was worth it!\r\n\r\nFUTURE:\r\n\r\nIf this Mod is appreciated, I can invest some more time and effort and implement some things I had in mind to make this even better:\r\n1) Transform this into a quest (you find a letter from veezara in the sanctuary, written before his death, informing you of the existence of the four children Shadow Scales; then a whole new adventure begins, ending with the addition of the new members);\r\n2) AI Improvement: those Shadow Scales becoming followers (pretty hard for me: there has been people that created children followers before, but I couldn\\'t understand how);\r\n3) Implement a Mesh+Texture appropriate to Argonian Children (although I work as a Game Designer, my modeling skills are terrible, so I wouldn\\'t dare modeling Argonian Children bodies myself; if anyone is willing to do that job, it would be appreciated).\r\n\r\nIf any veteran modder liked those ideas, I would appreciate some help. I started messing up with the creation kit 3 days before the publishment of this Mod, so I am still new to modding.\r\n\r\nCONFLICTS AND PROBLEMS:\r\n\r\nThere shouldn\\'t be any problem with this file. As it only adds stuff inside Dawnstar Sanctuary, it shouldn\\'t conflict with any Dark Brotherhood quest. Maybe there will be problems with other Mods that changes the Dawnstar Sanctuary, but it\\'s just speculation.\r\n\r\nIt also should work fine with any Mods that changes original Dark Brotherhood equipment, Dark Brotherhood quests or even Dark Brotherhood NPC\\'s, since I just added original characters.\r\n\r\nHowever, there are some strange things that happen and that I currently am unable to solve. Those things are:\r\n1) When they sleep, they are resized (they grow abruptly). When they wake up, they shrink again. This happens because they are not a new race, they are just regular Argonians resized and given children voices. But this doesn\\'t mess anything up. It is just bizarre to watch.\r\n2) They always walk in group. Because of that, sometimes they stop walking to wait for someone, and sometimes they never continue walking (until bedtime, actually; all walking problems are fixed when they walk toward the bedrolls; I don\\'t know why).\r\n3) When they practice, sometimes they hurt each other. It is not a bug, it is just sad to watch (because they spill blood everywhere, but they simply don\\'t care).\r\n4) Sometimes they vanish for no reason when you use the \\\"Wait\\\" function inside the sanctuary. I looked into that and found out they left the sanctuary. I found them near Dawnstar, fightning a dragon. This is probably something to do with the NavMesh, I\\'m not sure. Anyway, they always comeback when it is time to practice with the dummies.\r\n\r\nIf any problem is found, please contact me so I can fix it.\r\n\r\nINSTALATION:\r\n\r\nJust download the only downloadable file and extract the .esp inside the .rar on the Data folder (it is usually located inside Program files/steam/SteamApps/common/skyrim in your pc).",
  "categoryId": "33",
  "version": "2",
  "author": "Shishiwashi",
  "createdUnix": "1340525866",
  "updatedUnix": "1340593706",
  "containsAdultContent": false,
  "uploadedBy": "shishiwashi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "69980",
      "name": "Shadow Scales - Argonian Children Assassins",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "Shadow Scales - Argonian Children Assassins-19311-1.rar",
      "uploadedUnix": "1340526024",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/f2b3507e7cca372edbf7018387b23430445434a86d7b7a0ac570eb5d78f9f480/analysis/1406979723/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shadow%20Scales%20-%20Argonian%20Children%20Assassins-19311-1.rar?fid=69980&ttl=1535786691&ri=8192&rs=8192&setec=3874872d583b85504284a1951b377403"
    },
    {
      "fileId": "70114",
      "name": "Shadow Scales - Argonian Children Assassins",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Shadow Scales - Argonian Children Assassins-19311-1-1.rar",
      "uploadedUnix": "1340577918",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7db07aa7e90d96d950252d40679e906b36470caad87a01fba40595cfa7aa90a9/analysis/1406981070/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shadow%20Scales%20-%20Argonian%20Children%20Assassins-19311-1-1.rar?fid=70114&ttl=1535786692&ri=8192&rs=8192&setec=78dba523621a4e7dadd5555cefdf3438"
    },
    {
      "fileId": "70135",
      "name": "Shadow Scales and the Ghost of Veezara",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Shadow Scales and the Ghost of Veezara-19311-1-2.rar",
      "uploadedUnix": "1340590441",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/1510d2c98850fe63e6c1cbf4ed9a5377b49cafe8544df9b0c58444568cab7a5b/analysis/1406981380/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shadow%20Scales%20and%20the%20Ghost%20of%20Veezara-19311-1-2.rar?fid=70135&ttl=1535786692&ri=8192&rs=8192&setec=8e0611350edf28efae754dfc67f8ee9e"
    },
    {
      "fileId": "70143",
      "name": "Shadow Scales and the Ghost of Veezara - Version 2",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Shadow Scales and the Ghost of Veezara - Version 2-19311-2.rar",
      "uploadedUnix": "1340593706",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/a79e6b3a1e0558bed2cf82c20df7f203e99a9de00444599f6b6d0d773f70d2ad/analysis/1406981410/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shadow%20Scales%20and%20the%20Ghost%20of%20Veezara%20-%20Version%202-19311-2.rar?fid=70143&ttl=1535786693&ri=8192&rs=8192&setec=9b33756060e0a8950297780d42f872fc"
    }
  ]
}