{
  "modId": 19310.0,
  "modName": "Ebony Mail for ADEC",
  "summary": "Finally after all my teasing, the ebony mail for ADEC is finally here!  Your choice of either a replacer or a stand alone that\\'s fully craftable and enchantable.",
  "descriptionHtml": "Heyo everyone,\r\n\r\nWell I\\'ve put this off for quite some time, simply because I was busy with school.  I finally had time to sit down, and toss this up!\r\n\r\nFirst off this is my first release for Skyrim officially here on the nexus.  For quite some time I\\'ve been toying around with meshes, and textures on my own.  I was always \\\"right\\\" there, almost at the point of doing a mod myself, but I never really was able to get over that \\\"bump\\\".  \r\n\r\nAs typical as inspiration comes to us in the most random ways; an idea finally came to me.  Out of all the mods I had seen for Ebony Mail, I felt none really had taken on the \\\"mail aspect\\\" of the armor.  I was never a fan of the ebony vanilla design to begin with, but after I had finally obtained it I was even more displeased.    \r\n\r\nThe closest thing I had found to being a good ebony mail replacer was Mak07\\'s version.  The only thing I felt it still lacked, well...was again the mail.\r\n  \r\nI had been watching ADEC for quite some time, and I wanted to try my hand at making a mod for the body type.  I have actually tried to do other mods for CBBE, and CHSBHC; though none of them ever turned out the way I wanted.\r\n\r\nAt first it seemed like the mod would end up like most of mine always do, back in a pile of dust on my computer.  Though I decided to finally ask the modder Acdale for some advice on how to handle some things in 3ds max.  Lo, and behold not only did he respond, but he got me over that \\\"bump\\\" I had hit almost every time.  \r\n\r\nPrior to making this mod, I only successfully exported my work from 3ds max maybe 15% of the time.  The other 85% of the time, 3ds max would crash upon exporting the mesh I was working on.  To top it off, when I finally thought I had yet again failed..he proved to me that it was just simple steps I had to take in nifskope.  \r\n\r\nMind you I had spent countless hours reading guides, and reading posts people had regarding 3ds max mesh editing, and nifskope editing. \r\n\r\nSo after a solid week of working on this; and his advice.  I finally was able to get an armor the way I wanted it to look in game.  I completed this mod over a month ago, and was a tad hesitant to release it due to my limited knowledge of modding.  \r\n\r\nThough, I wanted to support Acdale, and his body mod of ADEC, because of all the help he gave me.  Not to mention I\\'ve always been a fan of his work.  \r\n\r\nThat\\'s honestly how I feel about making armor mods for certain body types.  Make the armor for the type of body you not only prefer, but you want to support and keep alive. \r\n\r\nSo if anyone is interested in making a mod, and happens to be looking at ADEC...I would advise you if you are having difficulties to contact Acdale.  He would be glad to help you ^^\r\n\r\nSo without further ado here is the:\r\n\r\nADEC EBONY MAIL\r\n\r\nIt comes in two flavors:\r\n1.  A replacer\r\n2.  A standalone\r\n\r\nIf you use the replacer, and really hate getting to level 40, you can cheat by typing in:\r\n\r\nplayer.additem 00052794 1\r\n\r\nIf you are using the standalone, you can craft the armor with ebony crafting.  The armor won\\'t have the special attributes or the shadow effect if you use this one.  Though that makes it enchantable :D\r\n\r\nNotes:\r\n\r\nSome people were having issues obtaining the armor via stand alone.  So I uploaded a video of myself crafting the armor, and obtaining it via console mode. \r\n\r\nLooks like right now in order to use the \\\"Shrouded Ebony Platemail\\\" from the stand alone and have the custom look, you have to install both the standalone and the replacer.  I will have to look into this, and see if its possible to add the same enchantments as the ebony mail through the CK.  If anyone has any other problems with the stand alone, please let me know asap and I will try to get them resolved.\r\n\r\nSo to install manually, just drag either of the two downloads into your skyrim folder.\r\n\r\nTo uninstall remove all the files from:\r\ndata/meshes/armor/ebonymail/curiassf_0.nif\r\ndata/meshes/armor/ebonymail/curiassf_1.nif\r\ndata/textures/armor/ebonymail/f/ebonymailbodyf.dds\r\ndata/textures/armor/ebonymail/f/ebonymailbodyf_n.dds\r\ndata/textures/armor/ebonymail/f/ebonymailbodyf_m.dds\r\ndata/textures/armor/ebonymail/f/CE.dds\r\ndata/textures/armor/ebonymail/f/CE_n.dds\r\ndata/textures/armor/ebonymail/f/CE_m.dds\r\ndata/textures/armor/ebonymail/f/chitin_e.dds\r\n\r\nCredits & Big Thanks:\r\n\r\nAcdale - for allowing me to use his body, meshes, and textures.  Also for helping me finish this work, and teaching me more than enough about modding.  For his awesome ADEC!\r\n\r\nMak07 - I was unable to successfully reach Mak07, due to his inbox being full.  I posted the request for permission in comment section of his armor several times, and waited more than 30 days for a response.  If he does not agree to allowing me to use his work, I will happily remove the mesh/texture I am using from his work.    \r\n\r\nSkan01 - for testing the armor, along with creating a standalone.\r\n\r\nBethesda - for creating an awesome edition to the elder scrolls series!\r\n\r\nPermission for usage:\r\nAll files used in this work are from Acdale, Mak07, and my own.  If you wish to use them please ask permission first, and I\\'d be glad to grant it.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Silvist",
  "createdUnix": "1340525184",
  "updatedUnix": "1340544444",
  "containsAdultContent": false,
  "uploadedBy": "Silvist",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70021",
      "name": "Ebony Mail ADEC Replacer",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6878",
      "fileName": "Ebony Mail ADEC Replacer-19310-1-0.zip",
      "uploadedUnix": "1340544342",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ba46eb9f999b316f8f6a259718fc0e19f0746a167b5a3f0eae1b33317e869cfc/analysis/1406980088/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ebony%20Mail%20ADEC%20Replacer-19310-1-0.zip?fid=70021&ttl=1535786690&ri=8192&rs=8192&setec=e497c34b1c892832cd17794c3d1b936f"
    },
    {
      "fileId": "70022",
      "name": "Ebony Mail ADEC standalone",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6847",
      "fileName": "Ebony Mail ADEC standalone-19310-1-0.zip",
      "uploadedUnix": "1340544444",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a3b8083527f629afd8660ae3beba03f09ab1bed8c0127403fbab0b66df480a2f/analysis/1406980147/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ebony%20Mail%20ADEC%20standalone-19310-1-0.zip?fid=70022&ttl=1535786690&ri=8192&rs=8192&setec=b7fcd75d3a0a443fa007a19bee1e24ba"
    }
  ]
}