{
  "modId": 19325.0,
  "modName": "Flesh Spells",
  "summary": "Add\\'s to the game a series of new flesh spells. Also known as armor spells. ",
  "descriptionHtml": "This mod as to the game new master level flesh spells. Also known as Armor Spells. The game already has armor spell sin it and perhaps you have heard of or have even used them.\r\n\r\nEbony Flesh\r\nIron Flesh\r\nWood Flesh\r\nStone Flesh \r\nDragon hide\r\n\r\nKnow this is all well and good but when your going into dungeon or into a epic fight you dont want to worry about the spell wearing off at bad time. \r\n\r\nexample: right as a dragon attacks you.\r\n\r\nSo I went thru and some trials and what not I was able to create these new spells. each one last 1 hour.\r\n\r\nThat\\'s right 1 hour that way you should be able to do somthing with out having to recast every 60-90 seconds.\r\n\r\n\r\nIgnore the smoldering corpse int he corner. He was my lab rat...to bad he didn\\'t tell me he wasn\\'t able to you magic..oh well..\r\n\r\nSo here they are:\r\n\r\nRuby Flesh- Boosts your armor by 75 and your resist fire by 25 for 1hour.\r\nSapphire Flesh- Boosts your armor by 75 and your resist frost by 25 for 1hour.\r\nGarnet Flesh- Boosts your armor by 75 and your resist shock by 25 for 1hour.\r\nDiamond Flesh- Boosts your armor by 75 and your resist Magic by 25 for 1hour.\r\n\r\nWell after making those and running them thru there paces I was swamped by  by poison damage so:\r\n\r\nCobra Flesh: Boosts your poison resistance by 75 for 1 hour.\r\n\r\nKnow I also decided to add a power with these:\r\nElemental Flesh:Boosts your Fire, Frost, Shock, and Magic resistance by 100 for 1hr. Only usable once a day.\r\n\r\n\r\nKnow You may be wondering how do I get these spells. well  that is simple and not so simple. You see they are master level alteration spells. So as a result I made it so Tolfdir the Alteration Master Trainer at the College in Winterhold Will sell them to you Only after You have completed the Alteration Ritual Spell Quest.\r\n\r\nFor those of you unable to do it that way or just unwilling.\r\n\r\nYou can get them by typing in Help \\\"XXX Flesh\\\" 4.\r\nXXX= Ruby, Diamond, Sapphire, Garnet, Elemental, or Cobra\r\n\r\n\r\nKnow in order to keep some balance I have made it so all the spells and the power have a 1.5 second cast time.\r\nAlso each of spells cost 400-500 magicka to cast. Remember they last 1 hour so it is still worth the slight issue.\r\n\r\nTo install(manual)\r\nDownload and extract to a different folder. Then copy and pass the file into your Skyrim/Data Folder.\r\n\r\nPlease leave any and all Comments or concerns.",
  "categoryId": "75",
  "version": "1.0.0",
  "author": "Onimass",
  "createdUnix": "1340546658",
  "updatedUnix": "1340546880",
  "containsAdultContent": false,
  "uploadedBy": "onimass",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70026",
      "name": "Onimass Flesh Spells",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Onimass Flesh Spells-19325-1-0-0.rar",
      "uploadedUnix": "1340546880",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/6997796aa343dd5ac3dd08b77157178beab54a7469354a9573f3cd5ef3869d83/analysis/1406980205/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Onimass%20Flesh%20Spells-19325-1-0-0.rar?fid=70026&ttl=1535786718&ri=8192&rs=8192&setec=4f07a6666bdb7a0db4c57aebaeec186d"
    }
  ]
}