{
  "modId": 19343.0,
  "modName": "tox Shout Visual Effects",
  "summary": "Makes some of the visual effects for shouts less bright and shorter. ",
  "descriptionHtml": "Description\r\n===========\r\nThis mod modifies how some of the shouts look and sound. For a few \r\nshouts, it also changes how they work. \r\n\r\nThe reason for tampering with original shouts lie in the difference between how\r\nthey are used in the vanilla game versus how they can be used with the Script \r\nDragon plugin Shout Combat. With that plugin, you can basically spam shouts and \r\nuse them strategically or for damage. I\\'m not going to discuss balancing \r\nimplications of this, although some of the changes in this mod address this \r\nissue. \r\n\r\nSimply put, the problem is that using shouts one after another makes the monitor \r\nvery bright in cases such as Slow Time -> Elemental Fury or even after a double \r\nWhirlwind Sprint which is rather unfortunate becasue you have to wait half the \r\nshout\\'s duration for the enemies to become visible. Luckely, the visual effects \r\ncan be modified using SpecialEffects; Imagespace Modifier in the Creation Kit.\r\n\r\n\r\nShout Modifications\r\n===================\r\nIn case you are left wondering about what the changes are after viewing the \r\ndemo video (or if the author forgot to create one), a more detailed description \r\ncan be found here. \r\n\r\nSlow Time visual\r\n----------------\r\nThe excessively cyan-bright intro effect is replaced by a dark flash with \r\nslightly more saturated colors. The voice sphere explosion is white instead \r\nof cyan. The duration of the intro is reduced by 2.4 seconds. \r\nThe main effect reduces brightness of the monitor, adds 25% more \r\ncolor saturation to compensate for the reduced brightness and introduces a \r\nblur similar the one that triggers when you block power attacks with \r\n\\\"Quick reflexes\\\". The outro reduces the blur gradually and restores the \r\noriginal colors, again without a bright cyan flash. The duration of the \r\noutro is reduced by half a second.\r\n\r\nSlow Time stats\r\n---------------\r\nTiid.: duration 8  -> 4, magnitude 0.30 -> 0.26, cost unmodified\r\nKlo..: duration 12 -> 6, magnitude 0.20 -> 0.17, cost unmodified\r\nUl...: duration 16 -> 8, magnitude 0.10 -> 0.08, cost unmodified\r\n\r\nSlow Time roundup\r\n-----------------\r\nThe reduced duration of the shout at all levels makes it more important to get\r\nthe timing right and makes it more difficult to attack while it is active. To \r\ncompensate for this, magnitude constant is reduced which means the world will \r\nmove even slower than with the original shout. These changes make the shout much\r\nmore viable for dodging projectiles and power attacks, while making it harder to \r\nstay in slow-motion for the duration of the fight. Another reason for reducing \r\nthe duration are the lame situations where you do a full shout at a wrong time\r\nand have to wait 1/4 of a minute for it to wear off. \r\n\r\nElemental Fury visual\r\n---------------------\r\nReplaces the cyan-bright flash with a mean negative flash. When used in \r\nvery dark places, this negative flash will reveal the enemies for a fraction\r\nof a second becasue they become white. The tint of the monitor is initially \r\ndark red and fades gradually into a transparent bright-red. The original \r\nshout uses the same visual effects as sprint3 which lasts 3 seconds, this \r\none lasts 1.5 second. \r\n\r\nWhirlwind Sprint visual\r\n-----------------------\r\nIf you remember the visual effect of \\\"Boots of Blinding Speed\\\" from Morrowind, \r\nthen this will remind you of it. The bright-cyan flash is removed and replaced by\r\na bloom-flash with a black tint, less powerful radial blur and a weak double-\r\nvision effect. This makes the shout more spammable, but does not light up the \r\nnight sky like before so you will have to use a torch or magelight while flying \r\nacross the map.\r\nThe sound resembling a whip with some squeaking fire noises is replaced by the \r\ntelekinesis throw sound. \r\n\r\nAura Whisper visual\r\n-------------------\r\nThis shout looks pretty much the same now, but the red spots indicating enemy \r\npositions will appear alot sooner and the \\\"veil of absolute darkness\\\" will not \r\nlast as long. I like the original dark and red effects of this shout. Still, I \r\nfound the duration of the pitch black veil to be too long. After stepping over the \r\nedge of a cliff on a few occasions I though it was directly annoying. I also \r\nthought it was weird that no light sources would get through no matter how close \r\nyou were standing to them. With these modifications, it is possible to use Laas \r\nYah Nir in and out of combat without having to stop to avoid running into walls \r\nand such. No other changes were necessary in my opinion because this shout is \r\nvery powerful compared to the Detect Life/Dead/Automata spells. \r\n\r\n\r\nCompatibility\r\n=============\r\nIn case someone asks and for the purpose of being able to tell whether this\r\nmod is compatible with other shout-mods, here is a list of forms that are \r\ntouched by this mod: \r\n\r\nSPEL: VoiceSlowTime1\r\nSPEL: VoiceSlowTime2\r\nSPEL: VoiceSlowTime3\r\nSPEL: VoiceElementalFury1\r\nSPEL: VoiceElementalFury2\r\nSPEL: VoiceElementalFury3\r\nSPEL: VoiceWhirlwindSprint1\r\nSPEL: VoiceWhirlwindSprint2\r\nSPEL: VoiceWhirlwindSprint3\r\n\r\nThis mod will not work if loaded after any other mod that modifies those forms. \r\n\r\nI have only changed the effect lists to point to my copies of the shout-effects.\r\nFor example, if SPEL:VoiceSlowTime1 used to list MGEF:VoiceSlowTimeEffects as \r\nthe effect, it will now list MGEF:toxVoiceSlowTimeEffects. All shouts follow\r\nthis pattern. No costs have been altered with the exception of Slow Time where\r\nthe duration is the only factor influencing the total cost, as it got cheeper\r\nafter reducing duration and \\\"decreasing\\\" magnitude, I had to force the costs \r\nto the original values. \r\n\r\nLinks to mentioned mods\r\n=======================\r\n\r\nShout Combat: http://skyrim.nexusmods.com/downloads/file.php?id=2318\r\nScript Dragon: http://alexander.sannybuilder.com/?category=other-bethgames&altname=skyrim_script_dragon\r\n",
  "categoryId": "28",
  "version": "0.1",
  "author": "tox2ik",
  "createdUnix": "1340563428",
  "updatedUnix": "1340564341",
  "containsAdultContent": false,
  "uploadedBy": "tox2ik",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70083",
      "name": "tox Shout Visual Effects",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "40",
      "fileName": "tox Shout Visual Effects-19343-0-1.rar",
      "uploadedUnix": "1340564341",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/8631f19a2987664bd20582ffd3e15ed229928c9665bb909c8247d103dbf10f69/analysis/1406980687/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/tox%20Shout%20Visual%20Effects-19343-0-1.rar?fid=70083&ttl=1535786745&ri=8192&rs=8192&setec=bb25af8094c1c5d9af8ec8735e9280e1"
    }
  ]
}