{
  "modId": 19364.0,
  "modName": "Ulfgar The Berserk",
  "summary": "Ulfgar &#34;the Ulfsark&#34;(wolf skin) is a Nord Companion that follows the path of the Ancients nord berserkers, he was nicknamed the ulfsark because when he was a child he killed two wolves with his fists. In the lore of the elder scrolls it has been explained that in the northern lands of skyrim lived some of the most rugged, savage and powerfu",
  "descriptionHtml": "                   ----English is not my native language sorry about gramatical mistakes---\r<br />\r<br />Ulfgar &#92;&#34;the Ulfsark&#92;&#34; is a Nord Companion that follows the path of the Ancients nord berserkers, he was nicknamed the ulfsark because when he was a child he killed two wolves with his fists. In the lore of the elder scrolls it has been stayed that in the northern lands of skyrim lived some of the most rugged, savage and powerful humans, acustommed to a unforgiving environment where the weak cannot survive.This is a lore-friendly mod, he is very very powerful but not a saayayin or demigod. He is not &#34;pretty&#34; or &#34;anime-looking&#34; he is a real Nord, with a masculine look and warpaint.\r<br />\r<br />Ulfgar lives isolated, following the berserker philosophy he only hunts for food and try to live in the most naturalistic way.\r<br />He is powerful,a strike with his bare hand do triple damage, is very tall (2.30 M) and have the blood of his savage ancestors, all the berserks have 70% of frost resistance and have nord battlecry, he learned the ice form shout, he uses a giant club, altough is slow than most weapons, the damage done is very high; he have the agile defender level 5 perk, skullcrusher level3, sweep, champions stance, bonecrusher 1, deep wounds 2, barbarian level 5, and wind walker perks. \r<br />Ulfgar is level 41.\r<br />\r<br />He is not esential, means that he can be killed but have a 620 points of health.He is marked as &#34;protected&#34; means that when he is low on health the enemy/enemies  will turn on you, until he recovers some health. He also can be married. I can do a version of him marked as esential if someone requested it.\r<br />\r<br />i have tested him and i assure you HE IS A BEAST.\r<br />\r<br />He have a white face not a  GREY ONE :)\r<br />\r<br />He is located 30 M north of the ruins of Saarthal near the college of winterhold, when you arrive there you must help him to defeat 3 snow bears, his collected food atracted the beasts.",
  "categoryId": "66",
  "version": "1.00",
  "author": "MayanKing",
  "createdUnix": "1340593122",
  "updatedUnix": "1340593844",
  "containsAdultContent": false,
  "uploadedBy": "mayanking",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70144",
      "name": "Ulfgar",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "57",
      "fileName": "Ulfgar-19364-.zip",
      "uploadedUnix": "1340593844",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4aa361bdab7e8cfa1b5912c911eac0d21de9945b59b46debc057176c71286604/analysis/1406981403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ulfgar-19364-.zip?fid=70144&ttl=1535786777&ri=8192&rs=8192&setec=b79d1a045a8092225ce919f4a05cc34d"
    }
  ]
}