{
  "modId": 19361.0,
  "modName": "SkyBooks",
  "summary": "A mod that aims to populate the world with more books, all lore as lore friendly as possible.",
  "descriptionHtml": "It\\'s a bit of a work in progress, and I would like the community to take part. I want to add books, a great many books to Skyrim.\r\n\r\nSend me an Email at squidmasterfunk@aol.com (My throwaway account lol.) with the heading \\\"Skyrim Books\\\" if you wish to take part, no one will be turned down.\r\n\r\nSo far I have a handful of books inserted as proof of concept. You can find them in Dragonsreach, by the Jarl\\'s throne. The story behind it is that the Jarl ordered a shipment of books (a handful of which are vanilla.) The sneaky Farengar has absconded with a particular book in a series. \r\n\r\nAs a starter I have included  small (unfinished) series entitled \\\"Survival Tips\\\" written by a foreigner to Skyrim, as well as a book aimed at children titled \\\"Wart, the Gallant Skeever\\\".\r\n\r\nIf you wish to add your books be creative, it can be a book, or a journal detailing a characters exploits. Just try to stick to lore, though if you do want a goofy non-lore related book to appear, I may make an \\\"Easter egg\\\" chest and hide it in one of the holds, filled with the tales of Jumomo the whale man. Simply copy and paste your story with your name (Screen, or Character, though I would like a screen name to credit you.)\r\n\r\n\r\nWhat I would be interested to see is;\r\n\r\nA: A journal written by a recently infected Vampire.\r\n\r\nB: A plagiarizer who is trying to cash in on the popularity of the Lusty Argonian Maid. (For the laughs.)\r\n\r\nC: A guide to the holds, as written by the Thalmor. \r\n\r\nD: A book documenting the exploration of a troll filled cave.\r\n\r\nAnything will be excepted, those are just a few suggestions. If you want it written by a character, attach a screenshot to the email, and I will try to incorporate it.\r\nDon\\'t let spelling get you down, I always spellcheck and test the books ingame before release. \r\n\r\nLeave feedback! I love it.",
  "categoryId": "74",
  "version": "1.0",
  "author": "Maserbeam",
  "createdUnix": "1340586403",
  "updatedUnix": "1340586945",
  "containsAdultContent": false,
  "uploadedBy": "Maserbeam",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70129",
      "name": "SkyBooks base V1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "157",
      "fileName": "SkyBooks base V1-19361-1-0.zip",
      "uploadedUnix": "1340586945",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4352a7a78ba1075ea46dc3cd3b740a5ed025929b5ec425b1342260fb34163906/analysis/1406981234/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyBooks%20base%20V1-19361-1-0.zip?fid=70129&ttl=1535786773&ri=8192&rs=8192&setec=a872e7c40847fc2e6003ad8123acfae4"
    }
  ]
}