{
  "modId": 19362.0,
  "modName": "PUPPETEER MASTER - PICTORIAL REFERENCE GUIDE by Reimar67",
  "summary": "This is a PDF Pictorial Reference Guide to the poses available in the mod Puppeteer Master by JohnBSkyrim. I\\'m a screenshot addict myself, and wanted something to make it easier to set the scenes for my funny pictures. I\\'ve got a lot more use out of Puppeteer Master since creating this, and thought I should share the work.",
  "descriptionHtml": "[color=yellow][b]Puppeteer Master[/b][/color] is an excellent mod for forcing PC\\'s and NPC\\'s into various poses and many players use it for screenshots in Skyrim. \r\nI myself favour this mod above others as it is easy to get the result you want, and so a HUGE thanks to it\\'s author [color=yellow][b]JohnBSkyrim[/b][/color].\r\nThe mod itself can be downloaded from Skyrim Nexus at [url=http://skyrim.nexusmods.com/mods/10870]http://skyrim.nexusmods.com/mods/10870[/url].\r\n\r\nHowever, the problem sometimes is remembering where the various poses can be found, as the choices are split into so many different pages (and some are simply labelled Pose A, Pose B etc). I kept hoping someone would put together a pictorial reference sheet, but finally one night I started one of my own.  Originally this was to be only the common poses, but there was enough interest from the community to complete the work.\r\n\r\nIn this list, I\\'m depicting the choices from Puppeteer Master Version 1.2. You\\'ll see there are some question marks, where I don\\'t think I can get that pose working properly. I do have some non-vanilla animations installed and Fores New Idles in Skyrim v1.2, so it may be that a few are conflicting (however, other users have reported the same). That said, the vast majority do work fine and so I hope you find this picture index helpful.\r\n\r\nI\\'ve split the poses into the same pages as the mod, and in the same order that you\\'d reach them in when using the Puppeteer Statue. \r\n\r\nHowever, I have not included any of the combat poses (Dying, Combat or Killing Blows). These are rarely required as forced actions in Puppeteer Master for screenshots, as it is so easy to get the pose by simply swinging a sword in the game. Also, if you want to force your characters\\' death, does it matter too much if your head flies off left or right when being decapitated. Instead, I\\'ve concentrated on the poses that people generally use in setting up scenes in Skyrim.\r\n\r\nIf you see any mistakes or have comments on how I can improve it, either catch me in Skyrim Nexus at [url=http://skyrim.nexusmods.com/users/545970]Reimar67[/url].\r\n\r\nAt my current level, I don\\'t have the skills to do anything other than upload a PDF or screenshots, so if someone wants to do something clever like create an \\\"in game book\\\", let me know.\r\n\r\n[color=yellow][b]HOW TO USE[/b][/color]\r\nIt\\'s a PDF at present. So just download and print. Simple (just like me).\r\n\r\n[color=yellow][b]VERSION HISTORY[/b][/color]\r\nVersion 1.2.1 - Initial release to match Pupperteer Master v1.2\r\n\r\n[color=yellow][b]THANKS TO... [/b][/color]\r\nBethesda, for an excellent addition to TES series\r\nJohnBSkyrim, for the PUPPETEER MASTER mod itself\r\n",
  "categoryId": "51",
  "version": "1.2.1",
  "author": "Reimar67",
  "createdUnix": "1340591586",
  "updatedUnix": "1340592416",
  "containsAdultContent": false,
  "uploadedBy": "Reimar67",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70137",
      "name": "PUPPETEER MASTER - PICTORIAL REFERENCE GUIDE by Reimar67",
      "version": "1.2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3133",
      "fileName": "PUPPETEER MASTER - PICTORIAL REFERENCE GUIDE by Reimar67-19362-1-2-1.7z",
      "uploadedUnix": "1340592416",
      "modVersion": "1.2.1",
      "virusScanUrl": "https://www.virustotal.com/file/8dfbcd196520ef4f0fa948342b2209118ac198e0250adc89d67335e4f1ef3e76/analysis/1406981405/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PUPPETEER%20MASTER%20-%20PICTORIAL%20REFERENCE%20GUIDE%20by%20Reimar67-19362-1-2-1.7z?fid=70137&ttl=1535786774&ri=8192&rs=8192&setec=fa641e75e87a52cfa366160fd8e55116"
    }
  ]
}