{
  "modId": 19387.0,
  "modName": "Thalmor- Altmer Brute Companions",
  "summary": "Adds 6 Altmer/Thamor Companions",
  "descriptionHtml": "The Thalmor are, in all tense purposes, regarded as evil by nearly all inhabitants of Skyrim, even against some fellow Altmer who may have similar attitudes but condone thier actions...\r\n\r\nThis mod is the end result of some Thalmor personnel who have had enough and want to attone for thier sins and help the people of Skyrim instead of killing it.\r\n\r\nAlso, none of these guys are marriable unless you do the \\\"addfac 19809 3\\\" console code as well as \\\"setrelationshiprank 14 3\\\" on your targeted NPC\r\n\r\nThe four Warriors:\r\n\r\nAnthis Darathin is a offensive Almeri Dominion Soldier that favors bladed weapons to magic and is proficient in both single handed weapons and two handed. His prefered style of choice to fight is single handed weapons and shield but he can cast a few spells if needed but is not very good. His archer skills are average and he can hit a target more or less with varying damage. \r\nPersonality wise, Anthis is quiet and collective but firecely loyal to his friends and polite to strangers, somewhat unusual traits for an Altmer, especially a Soldier of the Thalmor... this has led Anthis to dissert the ranks of the Thalmor and instead find his own journey.... Skyrim has this opportunity. - ThalmorBruteCompanion1.esp\r\n\r\n\r\n\r\nThondilas Peragrin is a big heavy weapons Elf guy who is bigger than the average High elf and loves his big blade. He is quite plesant, charming but nieve. He is relitivly young, at the age of 22, this by Altmer standards means he is still relitivly a child but his huge unnatural size and build makes his a essential part of the Aldmeri Dominion Army. His huge muscular bulk and hieght is, as mentioned before, unnatural in Altmer populace but is regarded as a testiment to carefully selective breeding exercised by the High elves... his intelligence is somewhat something to be desired. Not good at spell casting but an ok Archer. -ThalmorBruteCompanion2.esp\r\n\r\n\r\nHendorim Uthrails great-grand father was a Dunmer, and this ancestral trait has always fascinated Hendorim quite abit and he has spent much time with his living Dunmer relitives.\r\nHendorim regards both Altmer and Dunmer backgrounds with equal regard but since living a number of years in Morrowind, he has taken up a few traits and behaviors of the Dunmer, he began to think and sound like a Dunmer but he carefully shielded this when he went to serve in the Aldmeri Dominion Armies at the request of his father who was a prominant noble supporting the Thalmor interests. Although he lived during the Great War, he was stationed in the Summerset Isles as part of a defense force incase a suprise attack was undertaken by the Empire at that time. No attack came. Hendorim wields a war axe and is a very good archerer. He prefers light armor but his large frame makes him direable by females of all races he has found out.\r\n- ThalmorBruteCompanion3.esp\r\n\r\n\r\nHelitha Findulias is a footsoldier of the Aldmeri Dominion but has great distaste of the Thalmor and thier ideals but she does think the Altmer are superior in certain respects to the races of Man. He beauty is well known by male and female suitors within Alinor but she resists all courtship in favor to fight for the Thalmor and gain prestiege for her family back in the Summerset Isle.... until she bore witness to a slaughter in Skyrim at a Talos shrine of unarmed nords.... she left the Thalmor to spread the word of these attrocities. The Empire is aware of her outspokeness and is dutybound by the Concordat to silence her but is conficted at the same time that she is an Alinor citizen and not a citizen of the Empire.. its a strange case.\r\n\r\n- ThalmorBruteCompanion4.esp\r\n\r\nShe is good with destruction spells, archery and single weapons.\r\n\r\nWizards..\r\n\r\nMaster Indaryl Veyona is a highly powerful Altmer wizard who was coerced into serving the Thalmor. His family is held by the Thalmor back in Summerset Isle in return for his services. he had little choice to obey until they escaped being held and were set free by internal forces connected with anti-Thalmor Altmer insurgents. \r\nHe has since left the service of the Thalmor unoffically and now is trying to find a way back to the Summerset Isles... he cannot until the tension between the Empire and Aldmeri Dominion subsides.... that is very unlikely to happen... so he stays put.\r\n\r\n- ThalmorBruteCompanion5.esp\r\n\r\n\r\nMistress Jalinda Finderia is a very adept wizard of the Thalmor but tired of her duties of suppressing the worship of Talos in Skyrim. He did not really care if Talos was a God or not as she was not really bothered of religion and worship but was not blind to the potential benefits of worship it brang. She did worship.... but only if it sutied her needs for absolute power.\r\nShe has left the Thalmor in order to exploit the potential rewards that Skyrim has to offer.\r\nJalinda knows of the ancient powers commanded by the Nord Dragon priests and also the old magics in use by the Forsworn. Perhaps she can learn these magics and adapt them for he own use.\r\nAlthough over 260 years old, she is relitivly youthful in appearence and is currently in a secret relationship with a Imperial Legate back in Cyrodiil... but not married and is always on the lookout to try new \\\"things\\\"... namely \\\"what would it be like to be bedded by an Argonian?\\\"\r\n\r\n- ThalmorBruteCompanion6.esp\r\n\r\n\r\nThis mod adds 6 Altmer/Thalmor NPCs who can act as Companions.\r\n4 Male and 2 female, the 3 males are dressed up in Heavy Elven Armor and each have specialities such as 1 1 hand and shield, 1 twohanded big sword and 1 being a adept archer and wielding a  Elven war axe. the Female  is a adept spell caster and also wields a mace and is wearing light elven armor.\r\n\r\nThere are also two mages wearing Thalmor robes, they are pretty damn powerful in regards to spells and they also can shout BUT have smaller amounts of HP to trade for power.... Not exactly God companions but they do command god-like powers \r\n\r\nI tried to make them good looking without making them stupidly good looking. The females are all vanilla so no beauty mods are needed. I dont use them as no need.\r\n\r\nAll the males are bulky, muscular Warriors, even the mage. I was looking for a square-jawed , Arnold Swarzenegger style of Elven warrior here and these guys are what I would think would come close to what it would look like and I must say, they look like tanks for the Elves. May even but some of the more stubborn Nords in thier place.\r\n\r\nInteresting note to point out:\r\n\r\nThere are two kinds of Elven Armor ingame, the light Elven Armor is infact regarded as Thalmor Soldier armor as viewed in the Creation Set and the heavy Elven Armor is generic armor I think created before the Thalmor rise to power. \r\n\r\nI think the Thalmor adapted the Heavy Armor slightly by toning it down somewhat and more flexible for thier main stray of battlemages that make up thier army ranks.\r\n\r\nAll can be found outside the Thalmor Embessy near Solitude. ",
  "categoryId": "66",
  "version": "1",
  "author": "Beth",
  "createdUnix": "1340636829",
  "updatedUnix": "1340720074",
  "containsAdultContent": false,
  "uploadedBy": "nofear88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70400",
      "name": "Thalmor Brutes - 6 companions",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "786",
      "fileName": "Thalmor Brutes - 6 companions-19387-1.rar",
      "uploadedUnix": "1340720074",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e57c16425872677e2d55504e62cc7da13aefa9fbed41149cac78f77a9e61af33/analysis/1406983983/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thalmor%20Brutes%20-%206%20companions-19387-1.rar?fid=70400&ttl=1535786811&ri=8192&rs=8192&setec=e577c1687bf9f8e9e4183822a9c93a94"
    }
  ]
}