{
  "modId": 19381.0,
  "modName": "More Perk Points per Level and Dragonsouls to Perk Points",
  "summary": "Changes some perk point features of the game, now you have the choice to gain two perk points per level or not (this mod intends to add two per level, but you have the choice if you only want to use the other features) and you get an ability to convert Dragonsouls to perk points, more features will follow.\r\n\r\nNew version now contains a perk reset f",
  "descriptionHtml": "UPDATE:\r\n-------------\r\n1.4 = Added a function to add a new Scroll on loss, if you drop it into the world it will be cleaned from it, so you can\\'t pick it up again, after that wait 24 Hours or Sleep 24 Hours in game time, and a new scroll will be added to your inventory if you have zero scroll in it or ever scroll will be removed except one if you have more than one scroll, this better than making the item a quest item because i hate aliases for one single item and all the mess that involves.\r\n\r\nI also fixed the no perk point gain if you chose no in the installation process.\r\n\r\n1.3 = Changed the Trader menu Spell to a scroll similar to the Elder Scroll, if you are upgrading use the ability you used so far to reset the mod and gain the Scroll, everyone else just install it using NMM.\r\n\r\nFurthermore i removed the Perk Reset function, but i will upload it in a seperate mod, and Perk Points now cost 2 Souls per 1 Perk point, you can convert 1,2 or 3 Perk Points at once for 2,3 and 6 Dragonsouls, furthermore i added a version check at the beginning of the installation process before any other checks, the  SKSE version needed to run this mod is 1.5.9.25, any other version will fail to install this mod, and kick you out of the game for security reason, to not to harm your save games.\r\n\r\nNote before Installing:\r\n-------------------------------\r\nThis mod needs SKSE v1.5.9 or later and Skyrim v1.6.89 or later to work.\r\nGrab it Here: http://skse.silverlock.org/\r\n\r\nThis mod contains checks to check the current SKSE version, if you do not have SKSE or the version is wrong you can\\'t use this mod and the game will exit, this is because a function that is only provided by SKSE.\r\n\r\nWorkshop link: http://steamcommunity.com/sharedfiles/filedetails/?id=78673845\r\n\r\n\r\nWhat does this mod do?:\r\n----------------------------------\r\nWith this mod you can set up your perk point gain for each level to two perkpoints per level, you can choose if you want to activate this feature upon loading your savegame.\r\n\r\nFurthermore you gain an ability which lets you convert your Dragonsouls to Perkpoints, see ingame manual for info (shows upon loading the savegame with this mod activated)\r\n\r\nTo open the perk trader menu just use the \\\"Scroll of the Trader\\\" which you can find ind your book menu in the inventory.\r\n\r\nHow to use and install?\r\n----------------------------\r\nMore information on how to use this mod, will be explained ingame in Message Boxes once you load your savegame.\r\n\r\n\r\nLegal Notes:\r\n--------------------\r\nYou can change anything inside the esp, uncompiled scripts are not provided yet, but maybe i will release them.\r\n\r\nCredits:\r\n-------------------\r\nMe for making this mod\r\nand Bethesda for making such a great game.\r\nSKSE Team for making such a great tool.\r\n\r\nPS:\r\n----\r\nIf you have any requests or ideas for changes, let me know them and i see what i can do.\r\nAlso available on the Skyrim Nexus: http://skyrim.nexusmods.com/mods/19381\r\n\r\nPlease endorse this mod if you like it.",
  "categoryId": "79",
  "version": "1.4",
  "author": "DarkenDE",
  "createdUnix": "1340623425",
  "updatedUnix": "1343839530",
  "containsAdultContent": false,
  "uploadedBy": "DarkenDe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "78087",
      "name": "Updated Version",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Updated Version-19381-1-4.rar",
      "uploadedUnix": "1343839530",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/478c983068d93b109ff6881cbc731ffec880d09b18a937d7c06a81bd09f54ad5/analysis/1407062163/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Updated%20Version-19381-1-4.rar?fid=78087&ttl=1535786803&ri=8192&rs=8192&setec=cfcfddcd69fe8334c35e95ccc1f4e2d2"
    }
  ]
}