{
  "modId": 19399.0,
  "modName": "Tribal Rose TS for CBBE V3",
  "summary": "Since I couldn\\\\\\'t find a tramp stamp that I liked, that also came with a skin texture I liked, I made my own tat and placed it on Caliente\\\\\\'s stock skin texture that comes with CBBE V3, and decided to share. Enjoy :)",
  "descriptionHtml": "First I want to thank Caliente for granting me permission to use the CBBE skin texture that comes with this mod, and just making Skyrim so much better by creating CBBE to begin with, and all the other modders that have added to my overall skyrim experience. Y\\'all rock!!! :)  *Caliente\\'s permission for me to use the CBBE skin texture is in the readme in the zip. You will need CBBE for this mod to work, as my file only contains the femalebody_1.dds. You can get Caliente\\\\\\'s awesome mod here : http://skyrim.nexusmods.com/mods/2666  \r\n\r\nI looked high and low for a nice tribal tramp stamp mod. While I saw a number of them that I really liked, I didn\\'t really like the skin texture that came with them, and the skin textures I did like didn\\'t have a tat to suit my tastes. So I made my own tat in paintshop and placed it on Calente\\'s CBBE skin texture. This is my first mod, and I thought it looked pretty good as a first stab at modding. I hope y\\\\\\'all like it :) Please make any uploaded photos work safe, Thank you :) \r\n\r\nIn order to keep the significance of this mod, and prevent all human females from sporting the same ink, I recommend d_rail\\'s custom race mod to apply this texture to your PC only. You can get d_rail\\'s mod here: \r\n\r\nhttp://skyrim.nexusmods.com/mods/8720  \r\n\r\nI personally haven\\'t tried d_rail\\'s mod myself yet as I just haven\\'t gotten around to it, but SableDrake says it will work to apply this texture to only your PC :) Thanks Sable :) \r\n\r\nSkyrim nexus is my place for mods, so I won\\\\\\'t be adding this to steam workshop, sorry\r\n\r\nPlease report any bugs with installing via NMM. The path is included in the zip, so it should be fine,but I haven\\\\\\'t actually tested that yet.\r\n\r\nInstall:\r\nFirst, install CBBE by Caliente, (if you haven\\\\\\'t already :P) Then extract the dds file from my mod and place it in the female folder. Data\\\\textures\\\\actors\\\\character\\\\female, and overwrite Caliente\\'s original dds. Or use NMM, and overwrite when prompted. You might want to make a copy of the original femalebody_1.dds before overwriting if you want to uninstall this mod\r\n\r\nUninstall:  Just delete the femalebody_1.dds or overwrite it with Caliente\\'s original femalebody_1.dds\r\n\r\nFuture plans:\r\n\r\nAfter discussing permissions with Caliente, I learned that Caliente\\\\\\'s texblend app makes this kind of mod much easier to make and more flexible for use with other skin textures. So I\\\\\\'ll be making this tat available as a plugin for texblend as soon as I get that process down. You can get texblend here: http://skyrim.nexusmods.com/mods/5737\r\n\r\nI also plan to make some other tats as time allows, and making them available. Both as texblend plugins and skin retextures of various tattoo sets.  So far I have no plans for making tats for other bodies, but I might :P \r\n\r\n",
  "categoryId": "29",
  "version": "1.0",
  "author": "tgirlshayna",
  "createdUnix": "1340652293",
  "updatedUnix": "1355186416",
  "containsAdultContent": false,
  "uploadedBy": "tgirlshayna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70283",
      "name": "Tribal Rose TS for CBBE V3",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2988",
      "fileName": "Tribal Rose TS for CBBE V3-19399-1-0.zip",
      "uploadedUnix": "1340652457",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/eecf46821f5ea0f9df68139fffa30f335e340d8a20e5cb63d41c2442123769ed/analysis/1406982726/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tribal%20Rose%20TS%20for%20CBBE%20V3-19399-1-0.zip?fid=70283&ttl=1535786829&ri=8192&rs=8192&setec=33794fa8c18f7398cd293a74e333f61f"
    },
    {
      "fileId": "104506",
      "name": "Blackblooded Tribal rose set",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3057",
      "fileName": "Blackblooded Tribal rose set-19399-.zip",
      "uploadedUnix": "1355186416",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/88b447426c9d545fdb4dfc912281992b7f961f3cf42b04c44116e2b9ec8dff72/analysis/1407299166/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blackblooded%20Tribal%20rose%20set-19399-.zip?fid=104506&ttl=1535786829&ri=8192&rs=8192&setec=9b906888dc76fc4df0894273411f3c71"
    }
  ]
}