{
  "modId": 19424.0,
  "modName": "A Breton spellsword Agathe",
  "summary": "My first mod that started off from boredom & goofing off ends up in anger & frustration",
  "descriptionHtml": "I am not a modder, I created this mod because I just got bored & trying things out with the CK, and this is the result of that. During the process of goofing off, I\\'ve met with many difficulties, when I fixed 1 thing, 5 million more things tends to breaks down, so it took me all night & all afternoon of the other day just to get it works right. Still, I\\'m not satisfied though, she\\'s not much of a looker, but an average for a vanilla game. I might just use other hair mods or giving her other modded armors but well, I don\\'t know how to do that, though I tried, only to see bunch of errors popping up. I just decided to upload it because well, I\\'m a generous person. More importantly, I\\'d like to hear feedbacks & maybe suggestions even.\r\n\r\nI use these mods for her looks, though not necessary but you should check them out anyway!\r\n- Coverwomen look 3 \r\nhttp://skyrim.nexusmods.com/mods/3563\r\n- No more blocky faces\r\nhttp://skyrim.nexusmods.com/mods/30\r\n- Better females by Bella\r\nhttp://skyrim.nexusmods.com/mods/2812\r\n- Covereyes\r\nhttp://skyrim.nexusmods.com/mods/4869\r\n\r\nMod description\r\nAdds a female Breton spellsword in the game\r\n- She\\'s in Bannered Mare & will return there once dismiss\r\n- She\\'s essential\r\n- Her lvl scales with the player\r\n- She can be married\r\n- I gave her 5000 more mana for people who got a mod that can teach followers spells, I think it should be enough for just about any spells if you want to teach her\r\n- I gave her a healing spell so she SHOULD heal you\r\n- She may be OP perkwise but she\\'s a bit flimsy, she can fight a dragon but can\\'t fight 3 high level bandits so she\\'s pretty balanced in my book XD \r\n\r\nInstallation\r\n-Extract the file to SteamApps\\\\common\\\\skyrim\\\\Data\r\n\r\nKnown Issue(s)\r\nCurrently one\r\n- When you\\'re switching your saves, if you didn\\'t exit the game & relaunch it, she will disappear until you do so.\r\n\r\nAs for people who didn\\'t use mods like UFO or AFT, you might find her wearing an armor set that you can\\'t take away from her & she also has that sets in her inventory. gave her the sets because mods like UFO or AFT will remove that armor. You should be able to give her other armors to wear though, but you can\\'t remove her helmet unless you use those mods or any mods that remove helmets. I gave her that helmet because I am not happy with her current looks.\r\n\r\nWhat I\\'ve learned\r\n- Best to check everything fully before saving so I won\\'t need to come back to fix things & sees 5 million more things breaks\r\n- ALWAYS mark the edited files as active\r\n- Make spare files by copy the esp instead of saving as a different name\r\n- Learn to understand & utilizes tessnip\r\n\r\nFuture plans\r\n- Study how CK works\r\n- Making a not essential version\r\n- Focusing on male followers\r\n\r\nLegal stuff\r\nDo whatever you want with this, at least telling me first would be nice\r\n\r\n\r\nUpdate history\r\n1.00 Initial release\r\n1.5 Fix the dark or grey face bug as reported, thanks to mojodajojo\r\n1.75 It seems I gave a different .nif with the same code, thanks to mojodajojo again for pointing this out\r\n2.00 Scaled the multiplier down to 1",
  "categoryId": "66",
  "version": "2.00",
  "author": "laomaster",
  "createdUnix": "1340702716",
  "updatedUnix": "1341053016",
  "containsAdultContent": false,
  "uploadedBy": "laomaster",
  "primaryFile": null,
  "files": [
    {
      "fileId": "71226",
      "name": "Agathe",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "109",
      "fileName": "Agathe-19424-2.rar",
      "uploadedUnix": "1341053016",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/e054e4266c1add56d63c6e6d9eac21d64dd72796aa380b3d6cee81913e4baf7d/analysis/1406991962/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Agathe-19424-2.rar?fid=71226&ttl=1535786862&ri=8192&rs=8192&setec=ccdaf9e18c93b3bf0431b0ca084be0b1"
    }
  ]
}