{
  "modId": 19431.0,
  "modName": "Summon Adoring Fan - Adoring Fan",
  "summary": "Allows the player to summon the Adoring Fan from Oblivion to unleash his pent up fanaticism and to find a new hero to follow!",
  "descriptionHtml": "Version 1 keeps the 24 ingame hour recast limit, but retains the full power of the Adoring Fan\\'s final attack.\r\n\r\nVersion 2 removes the recast limit and allows the player to summon the Adoring Fan indefinitely, but significanty lowers the summon\\'s final attack.\r\n\r\nKeynote:  Although this is no way related to the current Adoring Fan follower mod made by Niborino9409, I am deciding to give him credit for releasing an Adoring Fan mod first.  This is completely made from scratch and does not use any assets from his mod, or any other related mods. His Adoring Fan mod is a follower, while my mod is a summon.  \r\nFor his mod, please go here: \r\n\r\nhttp://skyrim.nexusmods.com/mods/18807 \r\n\r\nYes, the infamous Adoring Fan is back and is in search of a new idol to devote his afterlife and to unleash centuries worth of fury for all the deaths he suffered in countless alternate dimensions of Nirn.  \r\n\r\nHis spirit can be found at the peak of the Throat of the World.  At the campsite where his spirit can be found also has a note from an unfortunate treasure hunter hinting of lost Akaviri artifacts belonging to the Demon Ada\\'soom Dir-Kamal...\r\n \r\nUpon meeting the Adoring Fan\\'s spirit, the Dragonborn must decide on a method of obtaining his death tome... \r\n \r\nThe Adoring Fan is equipped with the following:\r\n\r\n1. A torch: Used to provide as a source of light... yep... that\\'s it...\r\n2. His fists: Used to punch anyone foolish enough to try to attack his \\\"hero\\\"... pretty much useless.... his punch does have a very very very very low chance of knocking down his target.\r\n3. Adoring Fury:  The bread and butter of summoning the fan.  As the Adoring Fan takes more damage, the more his pent up fury unleashes... if he takes enough damage, he will explode and take out any opponent foolish enough trying to attack him.  Because his fury is visible, many foes run for their lives, and once the Adoring Fan reaches his maximum fury, his foes freeze in fear. This ability is pretty much a self destruct spell. \r\n4: Adoring Fuse:  An automatic life draining ability that triggers during combat... if the player does not defeat his opponents fast enough, the Fan will run at his foes with reckless abandon to unleash his fury.\r\n5. Adoring Dance: Will randomly dance... usefulness = 0. \r\n\r\nNotes: I created this summon just for fun and as a means of stress relief for the player if they have nothing else better to do.  You can summon him at your favorite location and shout him off the cliff of any mountain.  (The version w/o the 24 hour recast timer is the best because you can shout him off the cliff and then resummon him again if  you want to do it again >:P).  Other than picking on the fan, his ability is actually very useful and can clear out a dungeon quickly if the player is lucky enough that he chases all the enemies in the dungeon.  Version 1 with the 24 ingame hour recast timer has the full potential of his fury explosion and is very dangerous and can potentially insta kill the enemy, the player\\'s followers, AND the player... (you have been warned).  Version 2 that doesn\\'t have a recast timer and has a very toned down version of his fury and will only damage anything near him as he explodes.  Also, because the Dragonborn is the Fan\\'s new hero, he will give you an inheritence each time his spirit dies... an easy way to make a quick 100 gold.  Because the usefulness of the Adoring Fan is pretty much limited, I\\'ve added two Akaviri items for the player to use and provide customized abilities for the player\\'s disposal.  Dir-Kamal\\'s Katana is a customized ebony great sword that has major damage output if the player has a skill level of 100 on the two-handed skill.  The sword severly wounds the target, and at 100 two-handed skill, the sword create explosive blasts and also melt the targets flesh into a puddle of matter.  The second artifact is an Akaviri Tome: Demon Slash.  This is a Destruction 100 spell.  The player must mark his target and once marked, Akaviri Demon Spirits will unleash explosive slashes from the ground causing major AOE damage.  I will not provide the specific location of the artifacts since it is pretty easy to find if you read the note at the campsite.  \r\n \r\nI am working on other mods, and will be making updates to others. Please endorse if you like this. Also, please let me know if you experience any issues using this mod. \r\n\r\nPlease also check out my other mods when you have the chance! Enjoy! ",
  "categoryId": "93",
  "version": "2",
  "author": "zeroternalz",
  "createdUnix": "1340717598",
  "updatedUnix": "1340717720",
  "containsAdultContent": false,
  "uploadedBy": "zeroeternalz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70393",
      "name": "Summon Adoring Fan - Adoring Fan",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "Summon Adoring Fan - Adoring Fan-19431-1.zip",
      "uploadedUnix": "1340717655",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/185ea660165f59c72104b20feb06fc869ebeebac1dcee13ffa1299d66a2873b0/analysis/1406983884/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Adoring%20Fan%20-%20Adoring%20Fan-19431-1.zip?fid=70393&ttl=1535786875&ri=8192&rs=8192&setec=24fef94d7111781d25125bb98bb3f80d"
    },
    {
      "fileId": "70394",
      "name": "Summon Adoring Fan - Adoring Fan v2",
      "version": "2",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "14",
      "fileName": "Summon Adoring Fan - Adoring Fan v2-19431-2.zip",
      "uploadedUnix": "1340717720",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/732fdf4b97c820f7a1fc063c08199ad3fb59428f949051ac968384cb31804cef/analysis/1406983884/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Adoring%20Fan%20-%20Adoring%20Fan%20v2-19431-2.zip?fid=70394&ttl=1535786875&ri=8192&rs=8192&setec=d4d855e72f4e8655419d44ce6df1c0f9"
    }
  ]
}