{
  "modId": 19447.0,
  "modName": "Sneak Tools",
  "summary": "Adds new gameplay features to Skyrim&#39;s sneaking, like throat slitting with daggers, knocking people unconscious with fists, killing sleeping NPCs, identity-concealing masks, rope arrows and more to come&#33;",
  "descriptionHtml": "[color=orange][i][size=14]Sneak Tools for The Elder Scrolls V: Skyrim[/size][/i][/color]\r<br />Download Link: http://skyrim.nexusmods.com/mods/19447/\r<br />Forum Thread: http://forums.bethsoft.com/topic/1365057-beta-sneak-tools/\r<br />Version 1.00\r<br />29 January 2013\r<br />Borgut1337\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=#ff7700]Skyrim Special Edition (SSE) port of Sneak Tools:\r<br />[/color]http://www.nexusmods.com/skyrimspecialedition/mods/1863/?\r<br />[color=#ff7700][color=#ffffff]---------------------------------------------------------------------------------------[/color][/color]\r<br />\r<br />French translation (up to date): http://skyrim.nexusmods.com/mods/27455\r<br />French translation (not updated to latest version): http://skyrim.nexusmods.com/mods/20093\r<br />German translation: http://skyrim.nexusmods.com/mods/23956\r<br />\r<br />[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/hXQSy.png[/img][/url][/center]\r<br />\r<br />Video of version 1.0 by LiveStyleGaming:\r<br />[youtube]2GIlgo-mcfA[/youtube]\r<br />\r<br />Review of version 1.0 by TheXPGamers:\r<br />[youtube]7U-N4Jo4tgs[/youtube]\r<br />\r<br />**NOTE**The following video is from version 0.31BETA. Some things (most noticeably rope arrows) have gained some improvements since then, so be sure to READ the DESCRIPTION, it&#39;ll be your most up-to-date source of information&#33;**NOTE**\r<br />Video from Saiodin of version 0.31BETA:\r<br />[youtube]aWMEgtFJ8wI[/youtube]\r<br />\r<br />**NOTE**The following videos are from version 0.11BETA. Many features have since been added and improved, so read the description for the most up-to-date information&#33;**NOTE**\r<br />Video from Brodual of version 0.11BETA:\r<br />[youtube]sf3BINEv0Ds[/youtube]\r<br />From the youtube description: \r<br />**NOTE** Please note that in this video ai was disabled when using the sneak tools mod, this was to make sure we could get a clear shot of the new animations and the features the mod offers without being disturbed by NPCs. The mod itself will make NPCs react to any crimes you commit. The best way to see is to download and try out the mod for yourself&#33; **NOTE**\r<br />\r<br />Video from Gamespot of version 0.11BETA:\r<br />[youtube]szpejKb0oDA[/youtube]\r<br />**NOTE**What they mentioned in the video about detecting when you&#39;ve recently killed someone is not entirely correct, currently that only works for unconscious people. Nevertheless I&#39;m grateful they featured me in the vid :) And it does sound like a good suggestion for future versions... **NOTE**\r<br />\r<br />Sneak Tools mentioned on bikezilla&#39;s blog: http://skyrimmodsandmore.blogspot.com/2012/11/stealth-in-skyrim-sucks-sneak-tools.html \r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]1. Index[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />1. Index\r<br />2. Requirements\r<br />3. Recommended Mods\r<br />4. Mod Description\r<br />5. Upgrading From A Previous Version\r<br />6. Installation\r<br />7. Uninstallation\r<br />8. Incompatibilities\r<br />9. Known Issues/Bugs\r<br />10. F.A.Q.\r<br />11. Version History\r<br />12. Permissions & Disclaimer\r<br />13. Contact Information\r<br />14. Tools Used\r<br />15. Credits\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]2. Requirements[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />- A working, official copy of The Elder Scrolls V: Skyrim, updated to version 1.8.151.0 or higher.\r<br />- Skyrim Script Extender (SKSE) version 1.6.6 or higher, available here: http://skse.silverlock.org/\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]3. Recommended Mods[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />- SkyUI 3.0 or higher: http://skyrim.nexusmods.com/mods/3863 \r<br />Without this, there will be no in-game configuration menu to configure Sneak Tools.\r<br />Also, take a look at my other mods:\r<br />- Deadly Combat: http://skyrim.nexusmods.com/mods/5485\r<br />- Dual Wield Parrying: http://skyrim.nexusmods.com/downloads/file.php?id=9247 \r<br />- Dodge Mod: http://www.skyrim.nexusmods.com/mods/29258/ \r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]4. Mod Description[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />This mod aims to improve stealth gameplay by adding new tools and gameplay options to give the player more control and more things to do when sneaking, instead of only being able to slowly walk around and hope noone detects you.\r<br />\r<br />It is important to notice that first of all this mod is about ADDING new options, NOT about tweaking the already existing gameplay, although I might get to that later too when I feel like I have all the basic options I want to have in my gameplay.\r<br />\r<br />[u]Throat Slitting[/u]\r<br />Whenever you:\r<br />- are sneaking and\r<br />- have a dagger or one-handed sword drawn and\r<br />- activate an NPC you are standing behind\r<br />\r<br />you will attempt to slit the NPC&#39;s throat instead of pickpocketing. If succesfull, this will result in a guarantueed kill and an animation of you slitting the NPC&#39;s throat. If the throat slit is not succesfull, the target will react just as if you had attacked him, but your attack will fail.\r<br />\r<br />Whether a throat slit is succesful or not depends on the difference in level between the player and the target, the player’s Sneak and One Handed Skills, the target’s Sneak Skill, whether the target is aware of the player, whether the target is in combat, whether the target is wearing any helm and if he is, what type of helm that is.\r<br />\r<br />If you enabled the menu pop-ups through the MCM menu or dialogue with Horstar (see further down), there will be a confirmation menu first which asks you whether you wish to slit throat or pickpocket.\r<br />\r<br />By default, you will not get the option to slit the throat of an essential NPC. This option can be changed through the MCM menu or dialogue with Horstar as well, but throat slits on essential NPCs WILL result in deaths and therefore might possibly break quests which require the NPC to be alive.\r<br />\r<br />[u]Knocking unconscious[/u]\r<br />Whenever you:\r<br />- are sneaking and\r<br />- have your fists or a one-handed mace raised and\r<br />- activate an NPC you are standing behind or an NPC that is sleeping\r<br />\r<br />you will knock the NPC unconscious instead of pickpocketing. This will result in the player swinging his fist, and if this attack hits the NPC, he will drop down unconscious. If anyone that cares about crimes against the victim witnesses this act, it will be treated as an assault.\r<br />\r<br />The unconscious body can not be dragged around like dead bodies can in vanilla skyrim, but it can be pushed around by activating the body whenever you are not sneaking. If you activate the body whilst sneaking you will be able to access the victim&#39;s inventory.\r<br />\r<br />Whenever someone did not witness the crime directly, but does see the unconscious body later, he will enter an &#39;&#39;alert&#39;&#39; state. While in this state, if they see you touching the victim\r<br />(either trying to move the body or accessing the inventory), it will also be treated as an assault.\r<br />\r<br />If they get near you while in this alerted state and you walk around with your fists or weapons raised, they will also realise that you are the criminal and report you for assaulting.\r<br />\r<br />Lastly, if you are currently trespassing and they have seen the unconscious body and now see you they will also report you for assault (probably in addition to trespassing).\r<br />After 10 minutes of real time, an unconscious person will wake up again.\r<br />\r<br />If you enabled the menu pop-ups through dialogue with Horstar, there will be a confirmation menu first which asks you whether you wish to knock out or pickpocket.\r<br />\r<br />[u]Killing Sleeping Targets[/u]\r<br />Whenever you:\r<br />- have any kind of melee weapon drawn (fists do not count) and\r<br />- activate an NPC that is sleeping\r<br />\r<br />you will be given an option whether you would like to perform the default action (which is either talking or pickpocketing, depending on whether you are sneaking or not) or whether you want to kill the target. If you choose for the latter, you will execute 3 powerful strikes in rapid succession in the direction you are looking. \r<br />\r<br />If you somehow managed to activate this NPC without looking at him, this will result in missing your attacks and nothing happening, but if the strikes connect they will kill the NPC (assuming he is not essential).\r<br />If you enabled the menu pop-ups through dialogue with Horstar, there will be a confirmation menu first which asks you whether you wish to slit throat or pickpocket.\r<br />\r<br />By default, you will not get the option to kill an essential NPC. This option can be changed through dialogue with Horstar as well, but if you use this move on essential NPCs it WILL result in deaths and therefore might possibly break quests which require the NPC to be alive.\r<br />\r<br />[u]Identity-Concealing Masks[/u]\r<br />This mod introduces identity-concealing masks, inspired by the Gray Cowl of Nocturnal in Oblivion and the Bandanas in Red Dead Redemption.\r<br />\r<br />The default Sneak Tools.esp file contains one type of mask, named &#39;&#39;Dark Cowl&#39;&#39;, which can be crafted at any forge in the Leather section and can be bought from Horstar.\r<br />There are also 2 optional files which add this identity-concealing functionality to some appropriate vanilla Skyrim headwear.\r<br />\r<br />Now some details about how these masks work:\r<br />- When you equip a mask, 2 things can happen:\r<br />(1) If you are not noticed putting the mask on, and are not already remembered as being the wearer of the mask from being detected earlier, your current bounties in all of Skyrim&#39;s holds will be remembered by the mod internally and will then be replaced by a &#39;&#39;Mask Bounty&#39;&#39;, which starts at 0 by default.\r<br />\r<br />(2) If you are noticed putting the mask on or still remembered from being detected earlier, the \r<br />people of Skyrim will know it is you. Skyrim&#39;s people will only notice you putting the mask on if they are in combat (it will make them more alert to their surroundings), if you are sneaking (they will think that you are acting suspiciously and keep an eye out) or if you are currently trespassing. In this case, you will be rememberd as being the person wearing the mask.\r<br />In addition to this, your &#39;&#39;Mask Bounty&#39;&#39; will be added onto your &#39;&#39;Real Bounty&#39;&#39;, because the people of Skyrim now know who commited those earlier crimes.\r<br />\r<br />- When you unequip a mask, again 2 things can happen:\r<br />(1) If you are not noticed taking the mask off, and are not already rememberd as being the wearer of the mask from being detected earlier, your current &#39;&#39;Mask Bounties&#39;&#39; in all of Skyrim&#39;s holds will be remembered by the mod internally and will then be replaced by your &#39;&#39;Real Bounty&#39;&#39; again which was remembered by the mod when you initially equipped the mask.\r<br />\r<br />(2) If you are noticed taking the mask off (which again happens under the same conditions as \r<br />getting detected equipping), and are already remembered as being the wearer of the mask from being detected earlier, your &#39;&#39;Mask Bounty&#39;&#39; will be added onto your &#39;&#39;Real Bounty&#39;&#39;, because the people of Skyrim now know who commited those earlier crimes.\r<br />\r<br />- Detection of equipping or unequipping masks does not only happen at the very instant that you (un)equip your mask, but remains possible for a few seconds after that as well. This is to make sure that the player has to find a really safe spot and remain safe for a while, and to make sure that if the player takes his mask off right after hiding behind a corner of a house, the guards that follow around the corner a second later will be able to realise it was you all along.\r<br />\r<br />- If you keep your mask unequipped for 24 in-game hours (or 48 in-game hours if you were ever detected and are remembered as being the mask-wearer), your &#39;&#39;Mask Bounty&#39;&#39; will reset, because after this time it might very well be possible that other, non-guilty citizen of Skyrim have adapted to the latest fashion of wearing masks. Your &#39;&#39;Real Bounty&#39;&#39; will still never reset until you somehow pay them off.\r<br />\r<br />- Skyrim&#39;s citizen will treat you with suspicion if you wear a mask. Most people (exceptions are guards, Dark Brotherhood and Thieves Guild members, followers and Housecarls) will refuse to talk to you when you&#39;re wearing a mask. \r<br />Additionally, the same people (this time guards included) will tend to look at you more often when wearing a mask and from greater distances. If you get very close to them with your weapon drawn or whilst sneaking, they will get even more suspicious and will keep looking at you all the time, even walking backwards if that is necessary to reach their destination.\r<br />\r<br />As of version 0.60, these effects are produced by an enchantment. This means that you can Disenchant items which conceal your identity and place the enchantment yourself on any item you like.\r<br />\r<br />[u]Extinguishable And (Re)lightable Fires[/u]\r<br />With this mod, almost all fire-based light sources around Skyrim will gain a new level of gameplay. It is now possible for the player to extinguish any lit fire and to light any extinguished fire through the use of Frost and Fire spells, and newly introduced Fire and Water arrows (see below).\r<br />In version the current version of this mod, all campfires, candles and wall-mounted torches from vanilla Skyrim are supported, and if the mod Claralux is installed, all fire-based light sources from Claralux.esm (NOTE: only Claralux.esm from version 2A is supported, since as far as I know there are stability issues with later versions of the mod) will automatically be recognised as well. Fires placed by most other mods should also automatically be recognised, unless they introduce actual new models or new Light emitters.\r<br />Currently only the Giant campfires are an exception, because it seems unrealistic to me that these huge fires can be extinguished as easily as smaller fires.\r<br />\r<br />Fires which have been changed from their vanilla state (so lit fires which have been extinguished or unlit fires which have been lit) will automatically revert back to their vanilla state after 24 hours of in-game time if the Player is not in the same location at that time.\r<br />\r<br />If you run into any fire-based light-source (lit or unlit) which does not work as expected, please report it giving the following information:\r<br />\r<br />- The name of the place where you are\r<br />- Preferably a screenshot of the object you are trying to extinguish or light\r<br />- A description of what doesn&#39;t work (does the model not get replaced with an unlit/lit version? Or is the model changed correctly but does it still emit light/no light?)\r<br />- If you have mods which place light sources around Skyrim (like Claralux), please list them.\r<br />\r<br />If at some point you decide to stop using this mod but still want a similar feature to this one, I can recommend woodbyte&#39;s Dynamic Fires mod available here: \r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=74004800&searchtext=\r<br />\r<br />[u]Fire Arrows[/u]\r<br />This mod introduces Fire Arrows, which can be crafted at any forge in the &#39;&#39;Iron&#39;&#39; category.\r<br />They can be crafted in batches of 5, 10, 15 or 50. They can also be bought in Horstar&#39;s shop.\r<br />\r<br />Fire Arrows are made of a dark wood which deals no damage upon impact by itself, but ignites when fired using a bow. They can be used to set enemies on fire (dealing a small amount of Fire damage or to ignite light sources (see the feature above).\r<br />\r<br />If Dawnguard is installed, batches of 5 Fire Arrows can be converted into batches of 5 Fire Bolts at any forge. Fire Bolts work in exactly the same way that Fire Arrows do, except for that they are bolts which can be fired from crossbows.\r<br />\r<br />[u]Water Arrows[/u]\r<br />This mod introduces Water Arrows, which can be crafted at any forge in the &#39;&#39;Iron&#39;&#39; category.\r<br />They can be crafted in batches of 5, 10, 15 or 50. They can also be bought in Horstar&#39;s shop.\r<br />\r<br />Water arrows can be used to extinguish light sources (see the feature above), but have no other special uses.\r<br />\r<br />If Dawnguard is installed, batches of 5 Water Arrows can be converted into batches of 5 Water Bolts at any forge. Water Bolts work in exactly the same way that Water Arrows do, except for that they are bolts which can be fired from crossbows.\r<br />\r<br />[u]Noisemaker Arrows[/u]\r<br />This mod introduces Noisemaker Arrows, which can be crafted at any forge in the &#39;&#39;Dwemer&#39;&#39; category.\r<br />They can be crafted in batches of 5, 10, 15 or 50. They can also be bought in Horstar&#39;s shop.\r<br />Noisemaker arrows produce a small, harmless but loud explosion upon impact, attracting attention of nearby NPCs.\r<br />\r<br />If Dawnguard is installed, batches of 5 Noisemaker Arrows can be converted into batches of 5 Noisemaker Bolts at any forge. Noisemaker Bolts work in exactly the same way that Noisemaker Arrows do, except for that they are bolts which can be fired from crossbows.\r<br />\r<br />[u]Oil Arrows[/u]\r<br />This mod introduces Oil Arrows, which can be crafted at any forge in the &#39;&#39;Iron&#39;&#39; category.\r<br />They can be crafted in batches of 5, 10, 15 or 50. They can also be bought in Horstar&#39;s shop.\r<br />\r<br />Oil arrows will drop a pool of oil upon impact, which can then be set on fire using for example Fire Arrows or any fire-based spell. When fired on NPCs and creatures, they will cover them in oil, making them temporarily very susceptible to fire damage.\r<br />\r<br />If Dawnguard is installed, batches of 5 Oil Arrows can be converted into batches of 5 Oil Bolts at any forge. Oil Bolts work in exactly the same way that Oil Arrows do, except for that they are bolts which can be fired from crossbows.\r<br />\r<br />[u]Rope Arrows[/u]\r<br />This mod introduces Rope Arrows, which can be crafted at any forge in the &#39;&#39;Iron&#39;&#39; category.\r<br />They can be crafted in batches of 5, 10, 15 or 50. They can also be bought in Horstar&#39;s shop.\r<br />\r<br />When they hit any surface, they will drop down a rope if there is enough space. These ropes can be activated by the player to climb them.\r<br />\r<br />The ropes do not drop down immediately but it can take up to a second. This is because skyrim&#39;s scripting system is quite slow and the scripts do require some complex calculations in order to detect all the surrounding collision. Most of the collision detection is done when the ropes are created and then this data is saved, which means that the ropes require a little bit of time to fall down, but when you actually climb them everything will go smoothly.\r<br />\r<br />If you shoot your rope arrow into a location where there&#39;s no space at all for a rope to properly drop down, nothing will happen and the arrow will be wasted.\r<br />\r<br />This is how climbing ropes works:\r<br />\r<br />- The first time you activate a rope, you will be put in &#39;&#39;climbing mode&#39;&#39;. This means first of all that you are forced into first person perspective whilst climbing (due to a lack of proper climbing animations this is the only way I can make it look decent) and will automatically sheathe any weapons. Some of your controls (mostly combat related controls and the ability to switch back to third person mode) are disabled.\r<br />This can also be done while in mid-air (for example when jumping from one rope to another rope), and generally your character will manage to grab hold of the rope quickly and will then remain hanging at the height where you grabbed the rope, allowing you to continue climbing up or down from there.\r<br />\r<br />- Any time you activate the same rope, or a different adjacent rope nearby, you will climb up or down a bit depending on where you look at, and the distance climbed also depends on how far up or how far down you look.\r<br />To prevent clipping with terrain, you will sometimes climb in an unexpected direction if you try to climb up when already at the top of a rope, or if you try to climb down if you already are at the bottom of a rope, but generally it works as expected.\r<br />\r<br />- Whenever you move or jump, you will automatically leave climbing mode. This means that you regain all of your controls, and will drop down unless you activate the same or a different nearby rope again.\r<br />\r<br />- Whilst climbing a rope, your jump height is temporarily greatly increased. This allows you to more easily jump on top of a ledge after climbing to the top of a rope.\r<br />\r<br />Ropes will automatically be cleaned up after 2 full in-game days. If at that moment the ropes are in sight of the player, they will not yet be cleaned up and the game will attempt to clean them up every 2 days again.\r<br />\r<br />If Dawnguard is installed, batches of 5 Rope Arrows can be converted into batches of 5 Rope Bolts at any forge. Rope Bolts work in exactly the same way that Rope Arrows do, except for that they are bolts which can be fired from crossbows.\r<br />\r<br />[u]New Shop[/u]\r<br />A Nord man named Horstar has opened a new shop somewhere within the sewers of Skyrim. Being a shady person, he does not want to reveal his location and only allows you to enter his shop through a Lesser Power named Shadow&#39;s Refuge, which you will automatically learn to cast upon installing the mod.\r<br />\r<br />If you are in Horstar&#39;s shop when you cast the lesser power, it will teleport you to your previous location. If you are not in his shop, it will teleport you to his shop.\r<br />\r<br />He sells some general goods fit for thieves and assasins (one handed weapons, bows, arrows, lockpicks) but also all new items from this mod.\r<br />\r<br />Through dialogue, he also allows you to customise certain aspects of the mod. By talking to him about &#39;&#39;Tricks of the Trade&#39;&#39; he&#39;ll explain some of the new moves added by this mod and ask you in alore-friendly way whether you want to see menu pop-ups to confirm whether you wish to slit throats/knock unconscious, or whether you want to be able to do so without menu pop-ups.\r<br />\r<br />Similarly, by talking to him about &#39;&#39;Killing&#39;&#39; and answering his following question you&#39;ll be able to set whether it&#39;s possible to kill essential NPCs through throatslitting/sleep kills.\r<br />\r<br />As of version 1.0, these options can also be configured in the MCM menu for users who have installed SkyUI.\r<br />\r<br />[u]Optional Files[/u]\r<br />- Sneak Tools Vanilla Hoods.esp: this file adds the identity-concealing mask property to the following vanilla Skyrim headwear:\r<br />   - Nightingale Hood (all 3 levelled versions)\r<br />   - Shrouded Cowl (NOT the maskless version)\r<br />   - Ancient Shrouded Cowl\r<br />   - Worn Shrouded Cowl\r<br />\r<br />- Sneak Tools Vanilla Masks.esp: this file adds the identity-concealing mask property to the following vanilla Skyrim headwear:\r<br />   - Hevnoraak\r<br />   - Konahrik\r<br />   - Krosis\r<br />   - Morokei\r<br />   - Nahkriin\r<br />   - Otar\r<br />   - Rahgot\r<br />   - Vokun\r<br />   - Volsung\r<br />   - Wooden Mask\r<br />\r<br />Also included in the download is a short guide for other modders how they can make a patch for their armor mods to add the same identity-concealing functionality to their newly modded masks.\r<br />\r<br />[u]Configuration[/u]\r<br />If SkyUI 3.0 or higher is installed, there will be an MCM menu allowing you to customize the following features in a user-friendly in-game menu:\r<br />\r<br />- Enable or disable menu pop-ups for throat slits and knocking unconscious\r<br />- Allow or disallow essential NPCs to be killed by throat slits and sleep kills\r<br />- Enable or disable the throat slitting feature altogether\r<br />- Enable or disable the knocking unconscious feature altogether\r<br />- Enable or disable the sleep killing feature altogether\r<br />- Enable or disable the crafting of items newly introduced by this mod altogether\r<br />- Enable or disable the entire mod\r<br />- Reset the player’s jumping height to the value of the jumping height when the mod was first installed. In rare cases, rope arrows will permanently triple your jumping height. If you are affected by this bug, use this option in the menu to reset the jumping height.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]5. Upgrading From A Previous Version[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />When upgrading from a previous version of the mod, please make a clean save BEFORE installing the new version. This means:\r<br />- Deactivate Sneak Tools.esp in the game’s launcher.\r<br />- Load your saved game with which you wish to continue playing, where a previous version of the mod was active. Press ‘’Yes’’ when a pop-up appears about unavailable content.\r<br />- Save the game again (this is your clean save)\r<br />- Now install the new version and continue as you would normally with your clean save.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]6. Installation[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />You can choose to either install the mod using the Nexus Mod Manager or to install manually.\r<br />\r<br />[u]1. Nexus Mod Manager Installation[/u]\r<br />Simply press the ‘’Download With Manager’’ button and let NMM do all the installing work for you as you would with any other mod.\r<br />\r<br />[u]2. Manual Installation[/u]\r<br />- Unpack the downloaded package in a temporary location.\r<br />- Copy the Data folder in the unpacked folder.\r<br />- Paste the Data folder in your Skyrim folder. This can be found at \r<br />&lt;Steam Installation Directory&gt;SteamSteamAppsCommonSkyrim. This folder will also contain files such as ‘’TESV.exe’’.\r<br />\r<br />- When you launch the game, make sure to enable the mod’s .esp file (named \r<br />‘’Sneak Tools.esp’’) in the launcher’s Data Files tab.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]7. Uninstallation[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />Uninstallation works differently depending on whether you installed the mod using the Nexus Mod Manager or manual installation.\r<br />\r<br />[u]1. Nexus Mod Manager Uninstallation[/u]\r<br />If you previously installed the mod using NMM, you can simply let NMM uninstall the mod for you as well.\r<br />\r<br />[u]2. Manual Uninstallation[/u]\r<br />If you manually installed the mod, you also need to manually remove the mod’s files to completely uninstall it. To do so, follow these steps:\r<br />- Find Skyrim’s Data folder. This will be at \r<br />&lt;Steam Installation Directory&gt;SteamSteamAppsCommonSkyrimData.\r<br />- In this Data folder, delete the files named ‘’Sneak Tools.esp’’ and ‘’Sneak Tools.bsa’’.\r<br />\r<br />If SkyUI version 3.0 or higher is installed, you can also use the in-game Mod Configuration Menu first to deactivate the mod in-game before deleting it. If you forget to do this first it will generally not be an issue, but theoretically the mod might leave some small traces inside your saved game even after uninstallation if this step is neglected. Realistically the negative effects of this would only become noticeable after uninstalling and reinstalling the mod thousands of times without performing this extra step, but the option is still there in case you want to be absolutely sure that everything is removed correctly.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]8. Incompatibilities[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />See the FAQ for more info on interaction between SkyRe and Sneak Tools.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]9. Known Issues/Bugs[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />- Some mods (like Belua Sanguinare Revisited - Dynamic Vampires) which add new options upon activation of NPCs, do not work correctly with the throat slitting and knocking out features of this mod IF you keep the pop-up menus disabled.\r<br />If you wish to use those features together with such mods, you should enable menu pop-ups in the MCM menu or talk to Horstar to enable the menu pop-ups.\r<br />- Unconscious NPCs can still affect the Sneak Eye showing you whether you are detected or not, but this is only an issue in the UI. They will NOT actually detect you or report any crimes.\r<br />- In rare cases, throat slits may respond slowly or not work at all.\r<br />- Not every visible light source actually emits light in Skyrim. Bethesda often uses only one actual light-emitter for multiple visually present candles/fires/torches. This means that sometimes when you extinguish a some fires but not all of them in a certain location, there will be no change in light, and sometimes all light will be gone already without having to extinguish all sources.\r<br />- Pools of oil will remain visible even after igniting them.\r<br />- There seems to be a limit to the number of fires visible at the same time. This means that if you use many oil arrows in a row to make a long &#39;&#39;path&#39;&#39; of oil and then ignite it, you will not be able to see fire on the oil pools far away from you until you move closer, if there is also\r<br />fire close to you.\r<br />- Rope arrows will sometimes clip through a bit of terrain.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]10. F.A.Q. [/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />[i]Q: I see no configuration menu in-game&#33;[/i]\r<br />A: Make sure you installed a proper version of SkyUI which includes MCM functionality and installed it correctly.\r<br />\r<br />[i]Q: The mod doesn’t work&#33;[/i]\r<br />A: Make sure you installed SKSE correctly. Make sure you installed all parts of this mod correctly. Make sure the mod’s .esp file is activated in the game’s launcher. Make sure you read the readme and understood how all features are supposed to work.\r<br />\r<br />[i]Q: I am using SkyRe, how will this interact with Sneak Tools? [/i]\r<br />A: In the past, Sneak Tools was fully merged into SkyRe and then changed a bit inside SkyRe, to add new features through perks instead of adding them automatically for example. In later versions, the author of SkyRe no longer fully merged all new features in new Sneak Tools versions, but only those he liked personally. BOSS may tell you that Sneak Tools is fully included in SkyRe, but that&#39;s false.\r<br />\r<br />This means that in order to get the full functionality from Sneak Tools, you should still also download and install Sneak Tools. Some features may be in your game twice in slightly different ways (for example, there may be SkyRe perks which add features you already have access too because Sneak Tools gives them to you for free), so in that way some things might be confusing, but other than that everything should work fine.\r<br />\r<br />It is advised to load the plugin(s) from Sneak Tools AFTER the plugins from SkyRe.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]11. Version History[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />1.00 (29 January 2013)\r<br />- If you accidentally kill an NPC in an attempt to knock him out, it should not be correctly recognized as murder.\r<br />- Fixed a bug where the lighting of certain types of candles resulted in incorrect lit versions of those models appearing.\r<br />- Fixed an issue where extinguishing certain lights in Riften would not actually remove light.\r<br />- Fixed an issue where extinguishing certain lights in Whiterun interiors would not actually remove light.\r<br />- Fixed an issue where have fire arrows equipped would cause the player’s melee attacks to set opponents on fire.\r<br />- Noisemaker arrows can now be crafted in the Dwemer section of forges instead of the Misc section.\r<br />- Added an MCM menu for users of SkyUI v3.0 or higher with some new customization options.\r<br />- Added bolt versions of all new arrow types which will only be accesible in game if Dawnguard is activated.\r<br />- Throat slits are no longer guarantueed to succeed. Now a number of factors determine whether you can succesfully slit the opponent’s throat.\r<br />\r<br />0.61 BETA (17 August 2012)\r<br />- Fixed a bug where the identity-concealing enchantment could not be enchanted on any items.\r<br />\r<br />0.60 BETA (15 August 2012)\r<br />- Added the EXTINGUISHABLE AND (RE)LIGHTABLE FIRES feature.\r<br />- Added fire arrows.\r<br />- Added water arrows.\r<br />- Added oil arrows.\r<br />- Added noisemaker arrows.\r<br />- Greatly Reduced Horstar&#39;s amount of available gold.\r<br />- The identity-concealing properties of masks is now an Enchantment instead of a script. This means\r<br />it can be disenchanted and enchanted on other items.\r<br />- Greatly increased the player&#39;s jump height while climbing a rope.\r<br />\r<br />0.51 BETA (5 August 2012)\r<br />- NPCs should now always be able to wake up after getting knocked out and no longer in rare cases remain unconscious forever.\r<br />\r<br />0.50 BETA (6 July 2012)\r<br />- It is now possible to use the throat slit, knock out and kill in sleep moves on children, even when the Non-Essential Killable Children mod is active.\r<br />- It is now not possible to teleport to Horstar&#39;s shop using Shadow&#39;s Refuge when the player is either in combat or trespassing.\r<br />- Added an alternative recipe to craft 15 Rope Arrows at any forge using Firewood and an Iron Ingot as materials instead of Iron Arrows.\r<br />- Added an optional .esp file which adds identity-concealing mask functionality to appropriate vanilla skyrim masked headwear from Thieves guild and Dark Brotherhood (ONLY those with visible masks)\r<br />- Added an optional .esp file which adds identity-concealing mask functionality to all vanilla Skyrim Dragon Priest masks.\r<br />- Forces subtitles to be shown on Horstar&#39;s dialogue (since there is no voice acting), even when subtitles have been disabled.\r<br />\r<br />0.40 BETA (4 July 2012)\r<br />- Added Horstar&#39;s shop. This shop sells various items, including the newly added items from this mod, and the shopkeeper Horstar allows you to configure some options through dialogue.\r<br />You can teleport to his shop using the &#39;&#39;Shadow&#39;s Refuge&#39;&#39; lesser power automatically added to your spellbook when the mod loads.\r<br />- Can now choose to show confirmation boxes before slitting throats/knocking out. This option is off by default and can be turned on through dialogue with Horstar.\r<br />- By default it is now impossible to slit throats of essential NPCs or kill sleeping NPCs in their sleep. Through dialogue with Horstar you can allow for using these moves on essential NPCs, and if you do these moves will now properly kill the NPCs (even though they are essential).\r<br />- When pointing the crosshair at an NPC and the conditions are right to knock out or slit throats, and menu pop-ups are not enabled, the default red &#39;&#39;Pickpocket&#39;&#39; text will be replaced by either &#39;&#39;Knock Out&#39;&#39; or &#39;&#39;Slit Throat&#39;&#39; to properly indicate what will happen upon activation.\r<br />- Added the vanilla faction &#39;&#39;Tribal Orcs&#39;&#39; to the list of factions which is affected by identity-concealing masks.\r<br />- It is now possible to slit throats with one-handed swords.\r<br />- It is now possible to knock out with one-handed maces.\r<br />- NPCs should now be less inclined to talk while unconscious (especilly Heimskr the preaching priest in Whiterun was notorious for doing this).\r<br />- Collision detection for Rope Arrows has been greatly improved. This means they should be much more reliable and they should succesfully drop down much more often. Generally a rope should now succesfully drop down when a Rope Arrow is fired into the side of a wall (no longer only working on flat surfaces above the player).\r<br />- Rope Arrows will now not instantly spawn, but only actually spawn when the collision detection has ensured that there is enough space to drop. This means you should no longer see short pieces of rope appearing and quickly after disappearing again.\r<br />- Rope Arrows now deal less damage than Iron Arrows.\r<br />- Dark Cowl now has a lower armor rating and a much lower gold value.\r<br />\r<br />0.31 BETA (2 July 2012)\r<br />- Fixed throat slits not working in version 0.30 BETA.\r<br />- Fixed throat slits not working in any version against guards in a certain pose. This pose is\r<br />still problematic in that the throat slit will take some time before it happens and is not instant\r<br />against these targets, but at least it works now.\r<br />\r<br />0.3 BETA (1 July 2012)\r<br />- Added a new model for the Dark Cowl, with thanks to Sundracon for allowing me to use his models.\r<br />- Slightly optimized a few scripts.\r<br />- NPCs will treat mask-wearers with greater suspicion now (see the description for details)\r<br />- Added Rope Arrows\r<br />\r<br />0.2 BETA (27 June 2012)\r<br />- Knockdowns and throat slits will now be the default action when the conditions required\r<br />apply. If you still want to pickpocket in these conditions you will first have to sheathe\r<br />your weapon/lower your fists. No more confirmation menus, but smoother gameplay.\r<br />- Implemented identity-concealing masks.\r<br />\r<br />0.11 BETA (27 June 2012)\r<br />- Added the missing scripts which I forgot to include in version 0.10, this time making\r<br />sure the mod will actually work.\r<br />\r<br />0.1 BETA (26 June 2012)\r<br />- Initial Beta release\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]12. Permissions & Disclaimer[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />- ALL FILES IN THE DOWNLOAD ARE PROVIDED &#39;&#39;AS IS&#39;&#39; WITHOUT ANY WARRANTY OR GUARANTEE OF ANY KIND. IN NO EVENT CAN THE AUTHOR BE HELD RESPONSIBLE FOR ANY CLAIMS, WHETHER OR NOT THEY ARE RELATED TO THE DOWNLOAD.\r<br />\r<br />- In unedited form, this mod may only be redistributed on sites other than www.skyrimnexus.com. If you redistribute the same mod on other sites, you MUST inform your users that the original author will not look for feedback or assist in troubleshooting on any site other than www.skyrimnexus.com or forums.bethsoft.com.\r<br />- If edited, changed or improved upon, this mod may also be redistributed on www.skyrimnexus.com.\r<br />- IN BOTH OF THE ABOVE CASES, the original author must be credited for his work, and the original readme must be included.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]13. Contact Information[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />The author can be contacted through private messages on the nexus sites and on the official bethesda softworks forums, in both cases under the name &#39;&#39;Borgut1337&#39;&#39;. The author will also read the comments section of his mod on www.skyrimnexus.com regularly.\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]14. Tools Used[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />- The Creation Kit\r<br />- GIMP\r<br />- Nifskope\r<br />\r<br />---------------------------------------------------------------------------------------\r<br />[color=orange][b]15. Credits[/b][/color]\r<br />---------------------------------------------------------------------------------------\r<br />Thanks to:\r<br />\r<br />- Bethesda Game Studios: For making the awesome game Skyrim\r<br />- All contributors to the Creation Kit wiki, without which learning the new Papyrus scripting language would have been hell.\r<br />- All the people on the skyrimnexus comments section and the bethsoft forums thread, giving good suggestions and constructive feedback.\r<br />- Sundracon for allowing me to use models from his &#39;&#39;BrotherHood Mask for Man and Mer - Male&#39;&#39; mod. Link: http://skyrim.nexusmods.com/mods/2445 \r<br />- Woodbyte, the author of the Dynamic Fires mod, for giving me some tips.\r<br />- jonwd7, for his Fire Collision Resources mod. Link: http://skyrim.nexusmods.com/mods/20895/ \r<br />- SilverfeetStudio, for his Real Fire Arrows mod. Link: http://skyrim.nexusmods.com/mods/12705 ",
  "categoryId": "76",
  "version": "1.00",
  "author": "Borgut1337",
  "createdUnix": "1340729294",
  "updatedUnix": "1359484607",
  "containsAdultContent": false,
  "uploadedBy": "Borgut1337",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70424",
      "name": "Sneak Tools 0_1 BETA",
      "version": "0.1BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "Sneak Tools 0_1 BETA-19447-0-1BETA.zip",
      "uploadedUnix": "1340729349",
      "modVersion": "0.1BETA",
      "virusScanUrl": "https://www.virustotal.com/file/d380dd4549c597edcfcec1b366e06a2c7dda9ea8d3f3680773bc2066cf3ae44a/analysis/1406984333/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sneak%20Tools%200_1%20BETA-19447-0-1BETA.zip?fid=70424&ttl=1535786902&ri=8192&rs=8192&setec=00f306f7e631fe1f267403dadd47cb3c"
    },
    {
      "fileId": "70560",
      "name": "Sneak Tools 0_11 BETA",
      "version": "0.11BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "17",
      "fileName": "Sneak Tools 0_11 BETA-19447-0-11BETA.zip",
      "uploadedUnix": "1340788160",
      "modVersion": "0.11BETA",
      "virusScanUrl": "https://www.virustotal.com/file/83e41d91027341b8afc4b29ff16c4c11baeb4da445cba64cd09ba2882cad9b63/analysis/1406985671/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sneak%20Tools%200_11%20BETA-19447-0-11BETA.zip?fid=70560&ttl=1535786902&ri=8192&rs=8192&setec=ba7888750c7e33464600b897b16666cd"
    },
    {
      "fileId": "70816",
      "name": "Sneak Tools 0_20 BETA",
      "version": "0.20BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22",
      "fileName": "Sneak Tools 0_20 BETA-19447-0-20BETA.zip",
      "uploadedUnix": "1340911236",
      "modVersion": "0.20BETA",
      "virusScanUrl": "https://www.virustotal.com/file/8720b3b843d1dd8756a583258bac36a8c8a7c73ab1dad1fbfe7568a2a87aa773/analysis/1406988424/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sneak%20Tools%200_20%20BETA-19447-0-20BETA.zip?fid=70816&ttl=1535786903&ri=8192&rs=8192&setec=47ee3d988fdec8e248f989293fa2fd91"
    },
    {
      "fileId": "71498",
      "name": "Sneak Tools 0_30 BETA",
      "version": "0.30BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "92",
      "fileName": "Sneak Tools 0_30 BETA-19447-0-30BETA.zip",
      "uploadedUnix": "1341171111",
      "modVersion": "0.30BETA",
      "virusScanUrl": "https://www.virustotal.com/file/eff12ad835d767bb3977018fb639acdf151dca0d1101ea304607fe108c5d5dd1/analysis/1406994722/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sneak%20Tools%200_30%20BETA-19447-0-30BETA.zip?fid=71498&ttl=1535786903&ri=8192&rs=8192&setec=3f87ac70f5620a621e39f3afde662796"
    },
    {
      "fileId": "71644",
      "name": "Sneak Tools 0_31 BETA",
      "version": "0.31BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "93",
      "fileName": "Sneak Tools 0_31 BETA-19447-0-31BETA.zip",
      "uploadedUnix": "1341228565",
      "modVersion": "0.31BETA",
      "virusScanUrl": "https://www.virustotal.com/file/7773da184b96757cff1b3685f6121ec438ad946436bc6b30647d3409a89525b3/analysis/1406996348/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sneak%20Tools%200_31%20BETA-19447-0-31BETA.zip?fid=71644&ttl=1535786904&ri=8192&rs=8192&setec=47564c983d311a41a8eeb504672d68ef"
    },
    {
      "fileId": "72174",
      "name": "Sneak Tools 0_40 BETA",
      "version": "0.40BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "118",
      "fileName": "Sneak Tools 0_40 BETA-19447-0-40BETA.zip",
      "uploadedUnix": "1341427488",
      "modVersion": "0.40BETA",
      "virusScanUrl": "https://www.virustotal.com/file/13627b9c0bbda7a9380b2e4076d921e4b314913e658dc302003d20a5ad7dd870/analysis/1407001143/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sneak%20Tools%200_40%20BETA-19447-0-40BETA.zip?fid=72174&ttl=1535786904&ri=8192&rs=8192&setec=b477a085f013b8efdb4335785af72ecc"
    },
    {
      "fileId": "72561",
      "name": "Sneak Tools 0_50 BETA",
      "version": "0.50BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "123",
      "fileName": "Sneak Tools 0_50 BETA-19447-0-50BETA.zip",
      "uploadedUnix": "1341580892",
      "modVersion": "0.50BETA",
      "virusScanUrl": "https://www.virustotal.com/file/4b6e753b7198194e5bdfe6ecd3c579b7ac50311d882169a4d1bfbc87126042d7/analysis/1407005228/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sneak%20Tools%200_50%20BETA-19447-0-50BETA.zip?fid=72561&ttl=1535786905&ri=8192&rs=8192&setec=b9715c83c5d7b3868e9700c94a8ec9f7"
    },
    {
      "fileId": "78935",
      "name": "Sneak Tools 0_51 BETA",
      "version": "0.51BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1212",
      "fileName": "Sneak Tools 0_51 BETA-19447-0-51BETA.zip",
      "uploadedUnix": "1344161713",
      "modVersion": "0.51BETA",
      "virusScanUrl": "https://www.virustotal.com/file/ff4643c3052e050b134fbd54a6ceb9da7d50e34fa2f0b76a45d2f7dfb9e8042b/analysis/1407071346/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sneak%20Tools%200_51%20BETA-19447-0-51BETA.zip?fid=78935&ttl=1535786905&ri=8192&rs=8192&setec=1b28c6bdcff8f749258459ca6008c68e"
    },
    {
      "fileId": "81794",
      "name": "Sneak Tools 0_60 BETA",
      "version": "0.60BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1861",
      "fileName": "Sneak Tools 0_60 BETA-19447-0-60BETA.zip",
      "uploadedUnix": "1345038286",
      "modVersion": "0.60BETA",
      "virusScanUrl": "https://www.virustotal.com/file/aead3c8bd6d4afdf3dc37f947c7566ed75080868d6a1c5b9acc0da682618a264/analysis/1407098587/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sneak%20Tools%200_60%20BETA-19447-0-60BETA.zip?fid=81794&ttl=1535786906&ri=8192&rs=8192&setec=c6251139e7682047566df36f5582acb8"
    },
    {
      "fileId": "82175",
      "name": "Sneak Tools 0_61 BETA",
      "version": "0.61BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1861",
      "fileName": "Sneak Tools 0_61 BETA-19447-0-61BETA.zip",
      "uploadedUnix": "1345192624",
      "modVersion": "0.61BETA",
      "virusScanUrl": "https://www.virustotal.com/file/47c9ff389d84789b5fb4ac69dd1cf0df5210685e2200d3271da2b5b27c002287/analysis/1407102547/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sneak%20Tools%200_61%20BETA-19447-0-61BETA.zip?fid=82175&ttl=1535786906&ri=8192&rs=8192&setec=c27fad8da060c82f5eb140ed843f1d07"
    },
    {
      "fileId": "1000005748",
      "name": "Sneak Tools 1_00",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1987",
      "fileName": "Sneak Tools 1_00-19447-1-00.zip",
      "uploadedUnix": "1359484607",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/edf96d31119a1efd27eae387832a49a3446874c785bd400691359321e838b7b3/analysis/1407386048/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sneak%20Tools%201_00-19447-1-00.zip?fid=1000005748&ttl=1535786907&ri=8192&rs=8192&setec=9fb6b81656347e78f63b84148bb7ff6e"
    }
  ]
}