{
  "modId": 19508.0,
  "modName": "Half dragon argonian barbarian",
  "summary": "I&#39;m new to modding & this is my 2nd mod",
  "descriptionHtml": "Hi again, I&#39;m not a modder, I just like to mess around with CK. Today I just want to try something new about AI packages & dabbling with Alduin & some other sovngarde npcs for a bit. I also found out there has been awfully few non-human follower mods around so this came out from that. I upload it because well, I&#39;m a generous man. Better yet, I want to hear feedbacks & suggestions so I may improve myself.\r<br />\r<br />Mod description\r<br />\r<br />He&#39;s big, he&#39;s mean, he&#39;s red, he&#39;s half dragon & he doesn&#39;t give a skeever butt what the Windhelm nords has to say about an argonian walking their streets instead of hiding in an assemblage like his kind should&#33;\r<br />I made a barbarian argonian who can breathe fire like a dragon. Though I want him to use Odahviing fire breath voice but I failed.\r<br />\r<br />- He wanders around Windhelm, I focused him to stay at the market area but I can&#39;t promise he will only stays there though. When dismiss, he&#39;ll go back to Windhelm & wandering around just to piss off those racist nords\r<br />- He knows Unrelenting force & breathes fire like a dragon\r<br />- He&#39;s tall, about 1.20 ingame measurement\r<br />- I give him some health & stamina so he could be tougher like how a half dragon should be, but not that godly tough though\r<br />- He&#39;s essential (for some reason I can&#39;t flagged him as protected, it&#39;s whether essential or ghost)\r<br />- He scales with the player\r<br />- He can be married, if you&#39;re into tail & scales of course ;)\r<br />- He&#39;s cheat perkwise. Well of course he is because he can breathe fire.\r<br />- He has no mana so you should not try to teach him any spells\r<br />\r<br />Installation\r<br />-Extract the file to SteamAppscommonskyrimData\r<br />\r<br />Known Issue(s)\r<br />-According to my test runs, his head is green, but then I restart the game & it&#39;s all good. \r<br />-In rare case, his shop might make your selling items disappear, no idea how to fix that.\r<br />-You might find his fire breath coming from behind his head or his ear, that&#39;s usually because he used it before or while he&#39;s moving from that spot\r<br />-You might see him shrink when he uses something like enchantment table, that&#39;s because the game designs stuff for npcs with the heigh of 1.00 ingame measurement\r<br />\r<br />What I&#39;ve learned\r<br />- Whether because the file is corrupted or it&#39;s the CK itself, it&#39;s impossible to customize argonian looks\r<br />- I can just put the armors in their inventory & they&#39;ll wear it the first time you tell them to follow you\r<br />- Dragonfirebreath is not firebreathshout & it has no cooldown\r<br />\r<br />Future plans\r<br />- same as the previous mod\r<br />\r<br />Legal stuff\r<br />Do whatever you want with this, at least telling me first would be nice\r<br />\r<br />Update history\r<br />1.00 Initial release\r<br />2.00 Scaled the multiplier down to 1\r<br />2.1 Edit some AI packages, seems giving patrol AI & wander AI together makes him stand still. So I removed the patrol AI, he should be wandering Windhelm market for now.\r<br />\r<br />My first experiment result\r<br />http://skyrim.nexusmods.com/mods/19424/\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />",
  "categoryId": "66",
  "version": "2.1",
  "author": "laomaster",
  "createdUnix": "1340816590",
  "updatedUnix": "1396868655",
  "containsAdultContent": false,
  "uploadedBy": "laomaster",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000104001",
      "name": "Eat-Fire-Punks",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "85",
      "fileName": "Eat-Fire-Punks-19508-2-1.rar",
      "uploadedUnix": "1396868655",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/84823148c7c3f0f4906509087481901279ab6b4cbabbeba202f2ff1f0a3721ec/analysis/1408010610/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Eat-Fire-Punks-19508-2-1.rar?fid=1000104001&ttl=1535786999&ri=8192&rs=8192&setec=ff347640ee8eb121ae6e23df8bde14ea"
    }
  ]
}