{
  "modId": 19515.0,
  "modName": "Space Wiking Dwemer Exoskeleton - Traduzione Italiana",
  "summary": "This is only a translation into Italian of the original mod.",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/mods/19212] Space Wiking Dwemer Exoskeleton [/url].\r\nThe original mod gives you The Dwemer Hyperion Exoskeleton. You can wear it together with other armors or clothes. The exoskeleton doubles the speed of the wearer, increases his carry weight by 120 points and his stamina by 50 points.\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size][/center]\r\n\r\nQuesta interessante mod aggiunge al gioco l\\'Esoscheletro Nanico Hyperion, un\\'armatura indossabile anche in aggiunta ad altre vesti. L\\'Esoscheletro raddoppia la velocità di chi lo \\\"indossa\\\" incrementa la sua capacità di carico di 120 punti ed il Vigore di 50. E\\' possibile migliorarlo e forgiarlo da un qualsiasi fabbro alla sezione \\'Nanica\\'. Forgiando anche il Regolatore, è possibile calibrare l\\'Hyperion secondo alcune possibilità.\r\n\r\n[color=GREEN][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n[color=GREEN][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!",
  "categoryId": "54",
  "version": "2.1",
  "author": "Andre7890",
  "createdUnix": "1340821753",
  "updatedUnix": "1340821753",
  "containsAdultContent": false,
  "uploadedBy": "Andre7890",
  "primaryFile": null,
  "files": []
}