{
  "modId": 19527.0,
  "modName": "Cosmic Trade Exchange",
  "summary": "This mod adds two Conjuration spell which allow to sell your items through an extra-dimensional mystical trade network...",
  "descriptionHtml": "COSMIC TRADE EXCHANGE 1.2\r\nBy Aghnaar Mareth\r\n\r\nDESCRIPTION\r\nThis mod was created for my own benefit...mainly because I needed badly to have a portable merchant with truckloads of cash to sell everything I gather in my travels. There were some mods out there which did what I needed, but they weren\\'t updated by a long time or weren\\'t exactly what I needed.\r\nMoreover, I have to admit that this mod was born out of an aborted idea called \\\"Box of the Trickster\\\"...because I wanted to sell my items quickly, but still have a certain element of randomness and madness...so I came up with the Cosmic Trade Exchange.\r\nThis mod adds two spells to the game (Cosmic Trade Exchange and Cosmic Trade Investment) which are craftable (at the tanning rack) and could be found in my favourite \\\"den of power location\\\" (Anise\\'s Cabin).\r\n\r\nThe concept from which these spells are drawn is the following:\r\n\r\nOut there exists a mysterious organization called Cosmic Trade Exchange Network, which connects all those who gained access to the Cosmic Trade Exchange spell and act as a sort of cosmic-spanning auction house. This \\\"auction house\\\" however will require you to envelop all your equipment into mystical construct\r\ncalled Spirit Shell which will speed it through the teleporting pathways of the Network and will allow to share it with thousands and thousands of other people. When you cast the spell you\\'ll be allowed to \\\"spend\\\" soulgems or your own soul energy (which could be easily deadly) to empower the spell, to use any kind of\r\n(vanilla) flawless gem to focus its energies and then lose all your items, excluded gold pieces and quest items (which means that...yes...you\\'ll lose all weapons and worn equipment, so better to store it into a safe chest before casting).\r\n\r\nThe amount of cash you\\'ll get will depend on current cosmic economic trend (random factor between 17% and 600%), on your Speechcraft skill (which count as the base formula, but with fBarterMax = 3 and fBarterMin = 1), on your Conjuration skill (which grants a straight boost of Conjuration/100), on either the power of soulgems\r\nused or a random factor in use of your own life force (which will be hyper-boosted if you have absorbed Dragon Souls, but could lead to a quick death if you\\'re unlucky!)*, on the flawless gemstone expended** and on the level of membership that you have (by investing in the Network with the Cosmic Trade Investment spell), which\r\ncould lead to wildly different results when selling on the Network (and...no...once you\\'ve started is too late!). When you\\'re using your own soul energy is pretty much a Russian Roulette with a potentially very high bet!\r\n\r\nMoreover the Network is conceived to allow you to get distinct kind of currency (coins, ingots, gemstones or black soulgems), but also to store any \\\"leftover\\\" (since you get all items at the standard vanilla base price as \\\"exchange rate\\\", so, unless you always choose coins you\\'re ensured to get \\\"leftovers\\\") in a sort of \\\"trading bank account\\\"\r\ncalled Fidelity Account. Moreover you could store *all* the amount from any transaction into the Fidelity Account...and you\\'ll get a daily interest rate which has a random element and a fixed element based on your membership level, which is calculated each time you use the spell (it was easier in this way...). Note that this isn\\'t a true bank account,\r\nsince you cannot deposit in the typical way and you cannot take loans...but you\\'ll get money if you leave your money with the Network! \r\n\r\nThis mod is \\\"cheap and dirty\\\", but I feel that has enough flavour to not be considered a true \\\"cheat\\\"...moreover, if you want to \\\"play it right\\\" (with perma-death and such), you\\'ll probably agree that playing \\\"Russian Roulette\\\" to get a money boost is still a realistic...in fact the use of this spell is a potentially profitful and very risky attempt!\r\n\r\nWhenever you craft, find or add via console the spelltome of Cosmic Trade Exchange spell, you\\'ll get a pamphlet with detailed instructions (albeit written as in-game material). The Cosmic Trade Investment spell doesn\\'t come with them, since it\\'s quite straight-forward...\r\n\r\nCHANGELOG\r\n1.0\t\tOriginal version.\r\n1.2\t\tAdded a maximum cap of 2.147.480.000 to the sum of current gold, transaction value and fidelity account balance. This will lead to weird messages (taxation, transaction altered, etc...),\r\n                                     but was necessary to avoid integer overflow and weird negative values experienced in the previous release. Moreover to total multiplier has been forced betweek  1/1000 and 1000 to \r\n\t\treduce the risk of the above said integer overflow and to make the Cosmic Trade Exchange a useful, but not one-shot source of money (since I\\'ve played it getting hundred of thousands\r\n                                     of black soulgems and diamonds...if it\\'s too much is no more fun and you\\'d end up dropping cash and valuables for fear of CTD [which I did]...). This version of the mod is workable,\r\n\t\tI use it in my game and solve an issue of Skyrim...the horrible lack of money in the merchant\\'s pouches!\r\n\r\n\r\nINSTALLATION\r\nJust unpack the content of the zip file into your Data directory, select \\\"Cosmic Trade Exchange.esp\\\" and it should work properly.\r\n\r\nUNINSTALLATION\r\nRemove all spells and items through console commands, deselect \\\"Cosmic Trade Exchange.esp\\\", cancel Cosmic Trade Exchange.bsa, Cosmic Trade Exchange.bsl and Cosmic Trade Exchange.esp and the whole package should be uninstalled.\r\n\r\nCREDITS\r\n- Bethesda for making Skyrim.\r\n",
  "categoryId": "75",
  "version": "1.2",
  "author": "AghnaarMareth",
  "createdUnix": "1340842147",
  "updatedUnix": "1342901763",
  "containsAdultContent": false,
  "uploadedBy": "AghnaarMareth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70673",
      "name": "Cosmic Trade Exchange - 1-0 Rar Version",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16",
      "fileName": "Cosmic Trade Exchange - Rar Version-19527-1-0.rar",
      "uploadedUnix": "1340842301",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/aaa15f5d2605b46d780070da020bb3ae97c288046512507b4c6c684e1f804199/analysis/1406986814/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cosmic%20Trade%20Exchange%20-%20Rar%20Version-19527-1-0.rar?fid=70673&ttl=1535787036&ri=8192&rs=8192&setec=678198b8658f5defc1b20c17862b5aaa"
    },
    {
      "fileId": "71260",
      "name": "Cosmic Trade Exchange - 1-0 Zip Version",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "Cosmic Trade Exchange - Zip Version-19527-1-0.zip",
      "uploadedUnix": "1341074569",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ca31da0de3e2196120a13a3ca5c5d353462a0a4ec10f954a9de9d758c37a5424/analysis/1406992334/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cosmic%20Trade%20Exchange%20-%20Zip%20Version-19527-1-0.zip?fid=71260&ttl=1535787036&ri=8192&rs=8192&setec=da1b29f36c57f5c11170506a7db30189"
    },
    {
      "fileId": "75777",
      "name": "Cosmic Trade Exchange - Zip Version",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19",
      "fileName": "Cosmic Trade Exchange - Zip Version-19527-1-2.zip",
      "uploadedUnix": "1342901738",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/120f2e2834c399c8e8f0de1daae90ee3f1aed439ef23be964deda44c25d5fee8/analysis/1407037442/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cosmic%20Trade%20Exchange%20-%20Zip%20Version-19527-1-2.zip?fid=75777&ttl=1535787037&ri=8192&rs=8192&setec=b3419b1e089c640cb66645daf7a64c77"
    },
    {
      "fileId": "75778",
      "name": "Cosmic Trade Exchange - Rar Version",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20",
      "fileName": "Cosmic Trade Exchange - Rar Version-19527-1-2.rar",
      "uploadedUnix": "1342901763",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/d5925b21523cb3fb4c486bce58baf2ea4ea9a062081a3dff6bef84584a65bcca/analysis/1407037442/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cosmic%20Trade%20Exchange%20-%20Rar%20Version-19527-1-2.rar?fid=75778&ttl=1535787038&ri=8192&rs=8192&setec=0c74bd93fef552c3a081eb3adb523c38"
    }
  ]
}