{
  "modId": 19534.0,
  "modName": "Blood Magic in skyrim",
  "summary": "Will you sucumb to the Hidden power in your blood? or you will destroy the blood magic in skyrim once and for all? this mod bring the feeling of high risk high gain lesser powers that use you blood. for mages, rogues and warriors.",
  "descriptionHtml": "[size=+2]Important&#33;[/size]\r<br />Hello everyone, i am really sorry that i can&#39;t continue the mod anymore, but be free to do so&#33; you can use any thing from the mod for your own mod, or continue it. Just remember to credit\r<br />\r<br />\r<br />First of all sorry for my english, my english teatcher was the games i played so you will find many gramatic errors.\r<br />[size=+2]Introduction[/size]\r<br />Use the hidden magic in your blood&#33; this mod bring the feeling of high risk high gain Spells that use you blood. for mages, rogues and warriors. This mod bring an new way to use magic with an unique plot about blood magic as well unique spells&#33; By using the Power in your blood you are capable of enchant your weapons, go into a bloodish rage, slow the flow of time, change the gravity, Control minds, and many other things that break the laws of magic itself&#33; And when that is not enough, you can enter into a mode that all spells become casted with blood instead of magicka. Those spells are already unique just by using your blood, but they also have unique effects, perks and some are scripted to bring more possibilities&#33;\r<br />some of them ocupe the voice/power slot, so  players who uses two hands dont have to unequip them, while the most mage based require to use your hands.\r<br />a quest to learn the power of blood is comming, If you want to take a look, read the article about it.\r<br />Even if the mod is no more beta, i still needs to know what you think, what needs to be better and what you would like to come, the more feedback the more the mod will progress.\r<br />And if you like the mod, or whant it to be better please endorse, it is only a click after download and this is an incentive  for the mod and for more people find the mod.\r<br />Also report any bugs you find in the mod.\r<br />I am also in need of help right now, It is some thing that any one could do, Help with the Quest For blood magic, i have write some of the story and i will send to any one who wish to help, i need to know what you think and how would be better, as the story is a little big to post here, i will PM the user who have interest in helping the mod, so if you are interested in helping, post an comment in the mod and i will send you an PM with the story.\r<br />\r<br />[size=+2]Description[/size]\r<br />Atention&#33; the amount of health consumed depends on the dificult you are playing, for that reason i recomend use the correct version for your difficult, or the spells could be unbalanced.\r<br />i recently added Blood mage robes and a blood staff, the blood staff you need is the unenchanted one, and you can use spells that enchant him temporaly, this way you only need to carry one staff.(but they still need to recharge with soul gems.)\r<br />Also the comming quest will start with the blood mage called Veros, you can find him at the banned mare inn, for now all he do is follow you if asked, he have an unique dagger with a retex i made, the dagger absorb health and use blood wound when do a critical. also he is essential.\r<br />\r<br />those are spells and lesser powers that consume blood and do the following:\r<br />[color=red][size=+2]Combat[/size][/color]\r<br />These spells affect your enemies.\r<br />[color=red]Blood Wound [/color]: use your blood to wound those arround you, cost 80 Hp and damage your enemies 20 per second for 10 seconds\r<br />[color=red]Steal Blood [/color]: This spell absorb the lifeforce of anyone near you, but consume you Hp, so you need to use strategicaly, and only with 3 or more enemies arround you.\r<br />[color=red]Blood Shield[/color]: Make a blood shield that absorbs spells, reduce and reflect damage, but needs blood to maintain it.\r<br />[color=red]Blood Bomb[/color]: Bombard your enemies with a bomb of blood, if succeeded, your enemies life force will slowly pass to you. cost vary with the time you hold the cast button\r<br />[color=red]Blood paralyze[/color]: Paralyze the blood of your opponents, leaving them unmovable and suffering an heart attack. can only use once per day.\r<br />[color=red]Blood circle[/color]: Create an circle of blood around you, that attract any creature with blood, wile damaging them.\r<br />[color=red]Blood Field[/color]:using the Hidden Force inside your blood, you create a massive effect field annulling the gravity force and expelling anyone near the field. Cost 120 Hp\r<br />[color=red]Blood Disease[/color]: Once per day, the blood mage can unleash a disease that make anyone with blood have an slow Hemorrhage until they die. cost 0 Hp, as is 1 use per day.\r<br />[color=red]Blood Boil[/color]: Corrode the blood of your opponent, inflicting damage over time until he dies, when his blood explode dealing damage to any one near him.\r<br />Blood Nova: unleash an blood wave at your enemies.\r<br />[color=red]Blood Spikes[/color]: Put your fingers in the wound and form frozen Blood spikes to throw at your enemy\r<br />[color=red]Blood Spike trap[/color]: By placing the frozen blood dropped by your wounds, you are able to create blood spikes that damage your enemies when they walk into it.(health must be lower than 30%)\r<br />[color=red][size=+2]support[/size][/color]\r<br />These spells affect you and can boost your abilities.\r<br />[color=red]Blood Rage[/color]: this lesser power uses 80 health and enter in a half-berserk for 1 minute, so is half the strenght of  an ork berserk\r<br />[color=red]Blood magica regen[/color]: this lesser power use 50 health and speed up your magica regen 200% for 2 min\r<br />[color=red]Dragon Blood [/color]: this spell only work when a dragon is near you, and this give you temporaly 25% resistence for dragon atacks(not shouts) and speed up shout recovery.\r<br />[color=red]Blood Effect[/color]:By creating a blood Effect field  you use all Magicka and stamina To increase your(max and atual) health(by 200) for 1 minute. also beware, as the when the blood effect is over you lose 200 health.\r<br />[color=red]Blood Cloak[/color]: Form a shrouded cloak of Blood around you. Any Enemy foolish enough to stand too close shall find it&#39;s life force shredded from its very being, But beware, as you use your own blood to maintain the cloak\r<br />[color=red]Blood potence[/color]: Boost your spells magnitude for 1 minute by the constant use of blood\r<br />[color=red]Hot blood[/color]: Make your blood hot, increasing fire resistance by 50%, but your body is damaged in the process, costing you 80 Hp\r<br />[color=red]Cold blood[/color]: Make your blood Cold, increasing ice resistance by 50%, but your body is damaged in the process, costing you 80 Hp\r<br />[color=red]Blood Hurricane[/color]: A Hurricane of blood is formed around you, damaging any foe who stand inside it.\r<br />Cost 150-300 health\r<br />[color=red][size=+2]Utility[/size][/color]\r<br />These spells help you by reanimating the dead, detecting enemies, controlling them, etc...\r<br />[color=red]Blood Magic[/color]: You have total domain of your blood, and are able to cast any spell by using it.\r<br />[color=red]Control lesser blood [/color] you use your blood to command the blood of lesser creatures, who figth for you for 60 seconds. Cost 80 Hp and only work in animals\r<br />[color=red]Control Blood [/color]: control creatures with blood by using their blood and your own. Cost 120Hp and work in humans, but do not work in creatures without blood and undeads.\r<br />[color=red]Detect Blood [/color]: Use to see creatures with blood for a moment. dont work in undead,daedra and automatons.\r<br />[color=red]Blood Flow[/color]:By making your Blood flow slower, you perception of time changes, and you see everything slower for 10 seconds, but the consequences comes in you health\r<br />[color=red]Blood Slave[/color]: Reanimate a dead corpse and fill it with your blood to serve you as a slave. cost vary with the time you hold the cast button\r<br />[color=red]Blood Riot[/color]: Control the blood of your foes causing disorder, every one near the caster become frenzied and will attack they own allies as they were enemies.\r<br />Blood sacrifice: sacrifice an follower to fuel half of your blood magic for 2 minutes.\r<br />Blood puppets:\r<br />Blood siphon:\r<br />[color=red][size=+2]Summon[/size][/color]\r<br />Using your blood, you can make an pact with the daedras, summon forbidden creatures an etc...\r<br />[color=red]Blood Spectre [/color]: Use your blood to envoke a blood mage spectre. cost 120 and last for 60 mins.\r<br />[color=red]Blood Hound [/color]: Summon a Phantom Blood Hound to do your bidding. Each time The Blood hound bite&#39;s your victim He Absorbs a bit of health(for now he does not absorb health.). Duration 60 seconds\r<br />[color=red]Blood Pact[/color]: By doing a pact with a dremora lord, you can summon him every time you make an offer of blood. Cost 200 Hp, last until his defeat.\r<br />[color=red]Blood Priest[/color]: Summon a Blood priest from your blood, his blood magic was a fear in the past, and now it is again. Cost 120Hp, last 1 minute.\r<br />[color=red][size=+2]Enchantment&#33;[/size][/color]\r<br />those spells are used to enchant your current weapons and staffs\r<br />[color=red]Blood Haste [/color]: this use 80 health and you atack faster, but not as fast the elemental fury shout.(weapons)\r<br />[color=red]Blood Fury [/color]: Use your Blood to enchant your weapon temporaly, for now adds a little speed and double damage done for 2 minutes or until you sheat your weapon. also this enchantent is unique both in the stats and in apearence, also this enchant make enemies bleed like they were decaptated and later peharps i will add aborb effect for vampires players(weapon)\r<br />[color=red]Blood Spear [/color]: this enchant you staff, you do great damage but only work in melee range.(staff)\r<br />[color=red]Blood Bolt [/color]: Enchant your staff and shot bolts who absorb your enemies health.(staff)\r<br />\r<br />To the the spells, go to the banned mare inn in whiterun and look at a chest behind the inn keeper\r<br />[size=+2]Mods that improve this one[/size]\r<br />Any mod that improves blood will improve the blood bleeding for blood magic, i recomend one of those 2\r<br />Crimson Tide - Blood by Magus: http://skyrim.nexusmods.com/mods/12798\r<br />Enhanced Blood Textures by dDefinder: http://skyrim.nexusmods.com/mods/60\r<br />\r<br />This mod can be used to improve blood magic experience by making it part of one of the 6 magic elements there. \r<br />More Magic elements in skyrim\r<br />http://skyrim.nexusmods.com/mods/20794\r<br />[size=+1.5]About the updates[/size]\r<br />I apologize that i am not updating the mod as the same rate as before, as now i am working in 3 mods, And as i will work in the quest, the next update will take some time, so i may update my other mods before updating this one, also if you want me to update soon you  can help by telling the bugs, your opinion, suggestions, things like those really speed up the update rate.\r<br />[size=+2]Change log[/size]\r<br />0.1: 3 lesser powers, Blood Rage, Blood Haste and Blood magica regen\r<br />0.2: added 3 more spells, Control blood, Control lesser blood and Blood wound.\r<br />also now you character will bleed when using blood magic.\r<br />0.3:added 3 more spells, Blood Steal, Detect Blood and Dragon Blood\r<br />0.4:added Blood fury spell, Fix the Dragon Blood spell, Fix the spells cost, added 3 difficult levels\r<br />0.5:added Blood mage robes, blood mage staff, blood Spectre, Blood hound, blood spear(for staff) blood bolt(for staff).\r<br />0.6: added Blood effect, Blood Field, Blood Cloak, Blood Shield, Blood Slave, Blood Flow and fixed the Blood mage robes, now they work fine and Improve your blood magic by 15% each piece.\r<br />0.7: added Veros, the first blood mage npc, fix blood mage hood, added Blood Pact, Blood priest, Blood bomb, Blood disease, fixed inversed spells cost, added unique dagger for Veros.\r<br />0.8: added Blood mail, Blood Riot and Blood paralyze.\r<br />0.9: Added new texture for blood mail, added Blood potence, blood circle, blood magic, hot blood, cold blood, changed blood shield to reflect attacks, minor changes with blood cloak, boosted blood magica regen, minor changes i do not remember\r<br />1.0: minor changes in spells, fixed Blood bomb and blood slave, Added Blood nova, Blood sacrifice, blood puppets, blood siphon, blood boil, temporally added spells to an chest.\r<br />1.1: Fixed Blood Magic mode and Blood Boil, Added Blood hurricane, Blood Spikes and Blood spike trap.\r<br />1.1.5: Added missing files\r<br />\r<br />[size=+2]To come[/size]\r<br />Find a way to make npc use Blood magic.\r<br />Find a way to transfer to the player what the Blood Spectre aborbs\r<br />Add spells sugested by Users\r<br />Add Blood mages and lore books.\r<br />Make Blood staffs recharge with blood.\r<br />Make Vampires Have Special effects when using Blood Magic, without conflict with all those vampire mods and Dawnguard of course.\r<br />Make specials spells that use the blood of diferents enemies like dragons, trolls and undeads to give the player special abilites.\r<br />Make more effects and a quest to learn blood magic\r<br />You may see the article about the quest for more information.\r<br />[size=+2]Credits[/size]\r<br />allzero\r<br />ScottLaRock\r<br />BioWare, for making the dragon age games, were the inspiration for this mod came.\r<br />Bethesda for making skyrim and CK\r<br />EnaiSiaion, the author of Apocalypse Spell Package for helping me with the toggle thing.\r<br />Special thanks to\r<br />Nicolas9th, for the suggestions\r<br />moustafasherif for the suggestions\r<br />Chi13iM for the suggestions and Bug finding.\r<br />nevaborn for the suggestions\r<br />besseker for the suggestions\r<br />\r<br />\r<br />also check my other mods\r<br />Swallow in Skyrim\r<br />http://skyrim.nexusmods.com/mods/23763\r<br />More Magic elements in skyrim\r<br />http://skyrim.nexusmods.com/mods/20794\r<br />[color=indigo]Mass effect Biotic Spells[/color]\r<br />http://skyrim.nexusmods.com/mods/20740\r<br />Assassins creed style mage robe\r<br />http://skyrim.nexusmods.com/mods/7755\r<br />White and Black Daedric weapons and armor retex\r<br />http://skyrim.nexusmods.com/mods/11678\r<br />Silver and black ebony stand alone set\r<br />http://skyrim.nexusmods.com/mods/16820",
  "categoryId": "75",
  "version": "1.1.5",
  "author": "allzero",
  "createdUnix": "1340854811",
  "updatedUnix": "1344478161",
  "containsAdultContent": false,
  "uploadedBy": "allzero",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70694",
      "name": "Blood magic beta",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Blood magic beta-19534-0-1.rar",
      "uploadedUnix": "1340854884",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/0439a116f7201eb7e38d32afc59b00f3b1a02bded3d2440b1c80e72072fcd61e/analysis/1406987103/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%20beta-19534-0-1.rar?fid=70694&ttl=1535787048&ri=8192&rs=8192&setec=845b156fff434b8f20771d3489ed6354"
    },
    {
      "fileId": "70767",
      "name": "blood magic beta",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "blood magic beta-19534-0-2.rar",
      "uploadedUnix": "1340899542",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/6cd9738dfa085cfafd2c2f640874cb8af1938e3f6d435b68f78507ea33abf2a1/analysis/1406988062/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/blood%20magic%20beta-19534-0-2.rar?fid=70767&ttl=1535787048&ri=8192&rs=8192&setec=fe7162a6463890aabd539a78d5b26eb6"
    },
    {
      "fileId": "70930",
      "name": "blood magic beta3",
      "version": "0.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "blood magic beta3-19534-0-3.rar",
      "uploadedUnix": "1340946982",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/7e063fabb1200af9fd2001429d56e334b4e50f22a70bcbe0cc89f0cc3aeb6e2d/analysis/1406989623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/blood%20magic%20beta3-19534-0-3.rar?fid=70930&ttl=1535787049&ri=8192&rs=8192&setec=6033a740af2dc0285690770a99b19fec"
    },
    {
      "fileId": "71167",
      "name": "Blood magic beta 4 adept",
      "version": "0.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "447",
      "fileName": "Blood magic beta 4 adept-19534-0-4.rar",
      "uploadedUnix": "1341029804",
      "modVersion": "0.4",
      "virusScanUrl": "https://www.virustotal.com/file/5f9cfd0aa0d8bc4468dea65d77aa38f9c587eedcde1b999ae4682fb6a8a67bdb/analysis/1406991495/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%20beta%204%20adept-19534-0-4.rar?fid=71167&ttl=1535787049&ri=8192&rs=8192&setec=d05477f14853216adef50d6138862aa3"
    },
    {
      "fileId": "71168",
      "name": "Blood magic beta 4 Master",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "447",
      "fileName": "Blood magic beta 4 Master-19534-.rar",
      "uploadedUnix": "1341029956",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/93412e5a60ebc14ed52184a7bed481a10094ae46ad3aaae65d6f88f19ed6059b/analysis/1406991488/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%20beta%204%20Master-19534-.rar?fid=71168&ttl=1535787050&ri=8192&rs=8192&setec=e2888b16f8a6c02ad604cf7da775781e"
    },
    {
      "fileId": "71182",
      "name": "Blood magic beta 4 Low cost",
      "version": "0.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "447",
      "fileName": "Blood magic beta 4 Low cost-19534-0-4.rar",
      "uploadedUnix": "1341033637",
      "modVersion": "0.4",
      "virusScanUrl": "https://www.virustotal.com/file/5623b1bb44ef1bc4bfacba68329aeede5f88477dd444903ba9c3be4a652ce7ad/analysis/1406991645/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%20beta%204%20Low%20cost-19534-0-4.rar?fid=71182&ttl=1535787050&ri=8192&rs=8192&setec=11f778e3b9ecac687402cf6a322ee63a"
    },
    {
      "fileId": "71533",
      "name": "Blood magic Beta 5 adept",
      "version": "0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1420",
      "fileName": "Blood magic Beta 5 adept-19534-0-5.rar",
      "uploadedUnix": "1341179904",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/9c3fbf75e55569d4f865cb67a14060262355ae22cfa0c989991b34a708ba0688/analysis/1406995151/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%20Beta%205%20adept-19534-0-5.rar?fid=71533&ttl=1535787050&ri=8192&rs=8192&setec=a815e6c0cc671064a281dcd624791391"
    },
    {
      "fileId": "71546",
      "name": "Blood magic Beta 5 master",
      "version": "0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1420",
      "fileName": "Blood magic Beta 5 master-19534-0-5.rar",
      "uploadedUnix": "1341183135",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/7a4fc2b093c53100d01217a8b5192891709bf8a87490c6f51d6e0f30e3c8643f/analysis/1406995444/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%20Beta%205%20master-19534-0-5.rar?fid=71546&ttl=1535787051&ri=8192&rs=8192&setec=d3f4386c6332ec54d73c61c4b8eea167"
    },
    {
      "fileId": "71777",
      "name": "Blood magic Beta 6 Master",
      "version": "0.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2469",
      "fileName": "Blood magic Beta 6 Master-19534-0-6.rar",
      "uploadedUnix": "1341270336",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/9f3a7536170f7b48e976887684a22aede5fbd16eba09661cc2ebaf09ab449657/analysis/1406997605/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%20Beta%206%20Master-19534-0-6.rar?fid=71777&ttl=1535787051&ri=8192&rs=8192&setec=3b805cfaa5441f3100381c5630a9a5d1"
    },
    {
      "fileId": "71814",
      "name": "Blood magic Beta 6 Adept",
      "version": "0.65",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2469",
      "fileName": "Blood magic Beta 6 Adept-19534-0-65.rar",
      "uploadedUnix": "1341283575",
      "modVersion": "0.65",
      "virusScanUrl": "https://www.virustotal.com/file/cc0a133d591550b108e38238785a72f0a864ce654b50cc400d84faa45ce331e4/analysis/1406997786/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%20Beta%206%20Adept-19534-0-65.rar?fid=71814&ttl=1535787052&ri=8192&rs=8192&setec=0aa2edaeb0a9d5f7b1050e2aaf456b30"
    },
    {
      "fileId": "72235",
      "name": "Blood magic Beta 7 Adept",
      "version": "0.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3016",
      "fileName": "Blood magic Beta 7 Adept-19534-0-7.rar",
      "uploadedUnix": "1341443945",
      "modVersion": "0.7",
      "virusScanUrl": "https://www.virustotal.com/file/bf864d0943fc0cbc51f334de630d2dba6be76ebf10658501ff60104664506338/analysis/1407001864/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%20Beta%207%20Adept-19534-0-7.rar?fid=72235&ttl=1535787052&ri=8192&rs=8192&setec=102c9485197048ecdb7a503a4adc876a"
    },
    {
      "fileId": "72244",
      "name": "Blood magic Beta 7 master",
      "version": "0.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3016",
      "fileName": "Blood magic Beta 7 master-19534-0-7.rar",
      "uploadedUnix": "1341446997",
      "modVersion": "0.7",
      "virusScanUrl": "https://www.virustotal.com/file/789cd1f82e63648b89023f96e8ad00c96a06dcd236c766099e2d78fa8708f7e3/analysis/1407001922/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%20Beta%207%20master-19534-0-7.rar?fid=72244&ttl=1535787053&ri=8192&rs=8192&setec=9903aabd2a118c7fb25003b762055971"
    },
    {
      "fileId": "72604",
      "name": "Blood magic Beta 8 master",
      "version": "0.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4218",
      "fileName": "Blood magic Beta 8 master-19534-0-8.rar",
      "uploadedUnix": "1341599447",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/f3f9768dfb5f27864143147c1ec5b005d33e93ce9d0b61997e26f3acba651d7d/analysis/1407005589/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%20Beta%208%20master-19534-0-8.rar?fid=72604&ttl=1535787053&ri=8192&rs=8192&setec=b4b5d44db72d7a181a06bea945ad5a69"
    },
    {
      "fileId": "72605",
      "name": "Blood magic Beta 8 Adept",
      "version": "0.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4218",
      "fileName": "Blood magic Beta 8 Adept-19534-0-8.rar",
      "uploadedUnix": "1341599936",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/1bd47e72f536166e29563cf171268b7136775aac415da76e946c81d388f72fe3/analysis/1407005592/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%20Beta%208%20Adept-19534-0-8.rar?fid=72605&ttl=1535787054&ri=8192&rs=8192&setec=2d11a4e495b97ce3e0ba6fe2cf2c290b"
    },
    {
      "fileId": "75738",
      "name": "Blood magic Beta 9 Adept",
      "version": "0.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4312",
      "fileName": "Blood magic Beta 9 Adept-19534-0-9.rar",
      "uploadedUnix": "1342885735",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/ee31ec0a52a33532621834934b7e5007cab048b14ca287b6c5e02e930fd711bf/analysis/1407037085/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%20Beta%209%20Adept-19534-0-9.rar?fid=75738&ttl=1535787054&ri=8192&rs=8192&setec=9cd13e14d1a11489c2c65706380766c4"
    },
    {
      "fileId": "76966",
      "name": "Blood magic 10 Adept",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4962",
      "fileName": "Blood magic 10 Adept-19534-1-0.rar",
      "uploadedUnix": "1343421914",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6d4502f5ceea8129aca117874e2667fb9a2a9fc1ef88030835540501a3cfb3bf/analysis/1407050406/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%2010%20Adept-19534-1-0.rar?fid=76966&ttl=1535787055&ri=8192&rs=8192&setec=a3bb4c0d3e623d0cce7bf256fb8a8ab6"
    },
    {
      "fileId": "76969",
      "name": "Blood magic 10 master",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4963",
      "fileName": "Blood magic 10 master-19534-1-0.rar",
      "uploadedUnix": "1343422894",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/79edfcfb28d15600e9b5005b932cefbe3ee2fed9dc21e4d903139276b101e273/analysis/1407050466/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%2010%20master-19534-1-0.rar?fid=76969&ttl=1535787055&ri=8192&rs=8192&setec=0a05f1f4d71ca2527c17bac84c73c154"
    },
    {
      "fileId": "79627",
      "name": "Blood magic 11 master",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5729",
      "fileName": "Blood magic 11 master-19534-1-1.rar",
      "uploadedUnix": "1344400640",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4375eda64d67f9af4eeffe9618a343a91ad842baaab40aaef76dc97d0cd57c7e/analysis/1407078367/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%2011%20master-19534-1-1.rar?fid=79627&ttl=1535787055&ri=8192&rs=8192&setec=e6c7fde144da07a228ed273451ee6767"
    },
    {
      "fileId": "79631",
      "name": "Blood magic 11Adept",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5729",
      "fileName": "Blood magic 11Adept-19534-1-1.rar",
      "uploadedUnix": "1344401239",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/fe9f5f015cc877636ca6b9837512e5be5987c610f810aefab24ae5ca4a25e766/analysis/1407078424/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%2011Adept-19534-1-1.rar?fid=79631&ttl=1535787056&ri=8192&rs=8192&setec=131012d77cccc91878a23af4cc4e2204"
    },
    {
      "fileId": "79916",
      "name": "Blood magic 11 master Fixed DAWNGUARD REQUIRED",
      "version": "1.1.5",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "5730",
      "fileName": "Blood magic 11 master Fixed-19534-1-1-5.rar",
      "uploadedUnix": "1344477075",
      "modVersion": "1.1.5",
      "virusScanUrl": "https://www.virustotal.com/file/5f66f0ecd997e04f9244b40e3462631c1c7103ea0100517f36edb6bba5da0ed4/analysis/1407081491/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%2011%20master%20Fixed-19534-1-1-5.rar?fid=79916&ttl=1535787056&ri=8192&rs=8192&setec=68a89fadc466c4e98bb40e35454c3b1b"
    },
    {
      "fileId": "79917",
      "name": "Blood magic 11 adept Fixed DAWNGUARD REQUIRED",
      "version": "1.1.5",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "5730",
      "fileName": "Blood magic 11 adept Fixed-19534-1-1-5.rar",
      "uploadedUnix": "1344478161",
      "modVersion": "1.1.5",
      "virusScanUrl": "https://www.virustotal.com/file/e9200e2b01e3a66e6b2b5a2d335076424a9c3d25d0d6968754c52d78f46344f8/analysis/1407081495/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20magic%2011%20adept%20Fixed-19534-1-1-5.rar?fid=79917&ttl=1535787057&ri=8192&rs=8192&setec=c595ffaa6860c380758d5ded979f14d2"
    }
  ]
}