{
  "modId": 1956.0,
  "modName": "Linwe Armor First Person Fix",
  "summary": "Fixes the missing arms in first person while wearing linwe\\'s Armor.",
  "descriptionHtml": "I started my Skyrim playthrough making a sneaky, tough, dragon-slaying thief!  Needless to say, Linwe\\'s Armor was perfect.  I loved the sleeveless design for my buff Nord, the thieve\\'s guild type armor with the extra pouches, as well the armor\\'s enchantments.  I threw this armor on and headed out!\r\n\r\nI play almost entirely in third person, but there are a few times when you need to go first person.\r\nSometimes that corridor is just too narrow for the third person camera.  Also, when in third person, it\\'s nearly impossible to overlook from a cliff and shoot downward on an unsuspecting foe below, though it\\'s fine in first person.\r\n\r\nThe first time I tried to shoot an arrow from my black corridor through a forsworn, all I thought was \\\"ZOMG I CAN HAS NO ARMS BBQ???!!\\\" as soon as I saw my floating Linwe Gloves holding my bow drawn.\r\n\r\nWell not any more.  If you MUST know how I fixed this, send me a PM.  Otherwise, enjoy having your arms back in first person if you love this armor as much as I do!\r\n\r\nSimply unzip the archive, place the meshes folder in your Skyrim Data directory, yadda ya, and take your arms back!\r\n\r\n\\\"Thanks to Alphadragoon to pointing me in the right direction for an updated version of Nifskope.xml that can open Skyrim meshes.  I believe the file itself is courtesy of throttlekitty.\\\"\r\n\r\nOther Mods:\r\nAncient Nord Armor First Person Fix - http://skyrimnexus.com/downloads/file.php?id=2808\r\nBarbarian Thief -  http://skyrimnexus.com/downloads/file.php?id=2094\r\nGil Hibben Dagger Replacements - http://skyrimnexus.com/downloads/file.php?id=4950\r\nSpartan Armor Resource - http://skyrimnexus.com/downloads/file.php?id=2198",
  "categoryId": "54",
  "version": "",
  "author": "Solidus2845",
  "createdUnix": "1322531574",
  "updatedUnix": "1322531655",
  "containsAdultContent": false,
  "uploadedBy": "solidus2845",
  "primaryFile": null,
  "files": [
    {
      "fileId": "5044",
      "name": "Linwes Arms",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "48",
      "fileName": "Linwes Arms-1956.rar",
      "uploadedUnix": "1322531655",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/515b4c5bacc128ae1ac68c17efaf05889a777b96fb07fc1f30054690a69e0cdd/analysis/1406327810/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Linwes%20Arms-1956.rar?fid=5044&ttl=1535755892&ri=8192&rs=8192&setec=667edd43688e4028200fa9bcdf7bae7d"
    }
  ]
}