{
  "modId": 19570.0,
  "modName": "Our Hero Nikos Giant Mod Pack",
  "summary": "A compilation of mods to change how Skyrim works while keeping it fun",
  "descriptionHtml": "If you want a mod that changes dragons\\' or creatures\\' stat but still some of my other creatures, or parts of my mod but parts of others, make sure you load the mod you want AFTER mine.\r\n\r\nI have been away from this for a very long time.\r\nBUT I RETURN!\r\n\r\nA great deal of mods i have made for myself mostly, but i am going to post it here for bug testing and other people might enjoy them as well.\r\n\r\nBIG LIST TIME\r\n\r\n\r\nOverhauled Destruction\r\n\r\n-Spells scale with destruction perks, but only with their level and under. Lower level spells will scale lighter with higher level perks though.\r\n\r\n- Magicka cost reduction changed from -50% to -20% because spells became too strong for too little magicka cost.\r\n\r\n-changed incinerate, icy spear, and thunderbolt because they became redundant spells with how firebolt, lightning bolt, and ice spike scaled in damage\r\n\r\n-incinerate is now Ignite, and a target actor spell(no projectile or travel time) that deals periodic damage and can stack with itself.\r\n\r\n-Icy spear became Frost Blight and a target actor spell that deals more damage to stamina than health and can kill targets who run out of stamina.\r\n\r\n-thunderbolt changed to electrocution, which deals damage to health mand magicka and places a status effect that prevents magicka regeneration and deals extra magicka damage when enemies cast spells.\r\n\r\n-added two magicka absorption spells, and adept level and a master level.\r\n\r\n-Impact now has a 30% chance to stagger while dual casting.\r\n\r\n-Intense Flames perk now gives fire spells the ability to reduces the target’s fire resistance when under half health\r\n\r\n-Deep freeze perk now gives frost spells a chance to freeze enemies\r\n\r\n-Disintegrate perk now gives shock spells a chance to deal massive bonus damage\r\n\r\n-Reduced master level cast time\r\n\r\n====================================================================================================\r\n\r\nOverhauled Illusion\r\n\r\n-Perks now make spells more effective\r\n\r\n-Fear spells now deal damage to influenced targets\r\n\r\n-Added new spells that deal damage normally, and then have a bonus absorb health if the target is influenced by an illusion spell\r\n\r\n====================================================================================================\r\n\r\nOverhauled Conjuration\r\n\r\n-Perks now extend duration\r\n\r\n-Soul Trap now places a light damage over time effect on targets\r\n\r\n-Added many more Familiar spells to extend the options of conjured creatures\r\n\r\n====================================================================================================\r\n\r\nOverhauled Restoration\r\n\r\n-Added bonus magicka regen with perks\r\n\r\n-Reduced ward cost and effectiveness\r\n\r\n-Added a new spell, \\\"holy resolution\\\" which damages undead, and causes them to take extra damage whenever they attack or cast spells\r\n\r\n-Turn undead spells now place a damage over time effect\r\n\r\n====================================================================================================\r\n\r\nOverhauled Alteration \r\n\r\n-Perks now extend duration\r\n\r\n-Stability perk now extends duration based on your alteration level\r\n\r\n-Light spells now have extra duration\r\n\r\n-Added new spell \\\"Raze\\\" which deals poison damage and reduces the target’s armor\r\n\r\n====================================================================================================\r\n\r\nOverhauled Light Armor\r\n\r\n-Changed full set perk to increase armor comparatively to your stamina\r\n\r\n-Changed matching set perk to give bonus stamina regen isntead of a percentage armor bonus\r\n\r\n====================================================================================================\r\n\r\nOverhauled Heavy Armor\r\n\r\n-Changed full set perk to increase armor based on your health\r\n\r\n-Changed matching set perk to give bonus health regen instead of a percentage armor bonus\r\n\r\n====================================================================================================\r\n\r\nOverhauled weapon speeds\r\n\r\n-Increased all weapon speeds to increase fluidity of combat\r\n\r\n====================================================================================================\r\n\r\nOverhauled Archery\r\n\r\n-Doubled all arrow speeds\r\n\r\n-Changed critical shot to one rank, it now increases your critical hit ratio to 50% of your archery skill\r\n\r\n-Added lethal shots perk, has 2 ranks, increases critical hits by 25% and 50% respectively\r\n\r\n-Made critical hits deal double damage naturally, so with lethal shots, goes to 250% and 300% damage\r\n\r\n====================================================================================================\r\n\r\nOverhauled Sneak\r\n\r\n-Sneak damage now scales with your sneak skill and weapon skills for respective sneak damage\r\n\r\n-Now shooting people with a bow while sneaking will actually kill someone who\\'s not level 2\r\n\r\n====================================================================================================\r\n\r\nOverhauled Bosses\r\n\r\n-Increases the power and health of lower level draugr bosses\r\n\r\n-Increased the power and health of centurions\r\n\r\n-Increased the power and health of dragons, and removes the constant fire breath because it wasn\\'t very fun to fight against\r\n\r\n-Fire balls from dragons do more damage and will now knock down or freeze targets, but also have a longer cooldown\r\n\r\n-Tail attacks from dragons will knock down opponents\r\n\r\n====================================================================================================\r\n\r\nOverhauled Shouts\r\n\r\n-Reduced the cooldowns on all shouts so they becomes more viable to use and now just once a fight, two if its a long one\r\n\r\n- Fire and Frost breath will have full dragon breaths at rank 3\r\n\r\n====================================================================================================\r\n\r\nOverhauled Race Abilities\r\n\r\n-Reduced resistances to 25%\r\n\r\n-Nords power now restores them to full health and grants bonus attack speed\r\n\r\n-Imperials power now reduces the damage of all nearby enemies\r\n\r\n-Khajiits now have muffle if not wearing any boots\r\n\r\n-Wood Elves now summon an ally with beast tongue\r\n\r\n-Gave Ancestral Guardian back to Dark Elves\r\n\r\n-Argonians now regenerate health faster, health regen becomes higher as their health becomes lower, removes histskin power\r\n\r\n-Redguards now gain massive stamina regen with less health, removed adrenaline rush power\r\n\r\n-High elves now gain more magicka regen with less magicka, removed highborn power\r\n\r\n====================================================================================================\r\n\r\nOverhauled Standing Stones\r\n\r\n-Serpent Stone Power is now a castable spell that deals poison damage and has a chance to paralyze periodicly\r\n\r\n-Shadow Stone Power now sacrifices health to grant a short amount of invisibility. health lost will be recovered over time\r\n\r\n====================================================================================================\r\n\r\nSoon to do, i am going to rework conjure atronachs, making them sclae with perks, as well as change necromancy to give more minions with perks.\r\n\r\nBut i\\'ve been lazy whenever i start ck, sooo it\\'ll be out eventually.\r\n\r\nAlso i love ideas. Please feel free to give any.",
  "categoryId": "24",
  "version": "1",
  "author": "0urher0nik0",
  "createdUnix": "1340909293",
  "updatedUnix": "1340909348",
  "containsAdultContent": false,
  "uploadedBy": "0urher0nik0",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70811",
      "name": "Nikos Overhaul",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "91",
      "fileName": "Nikos Overhaul-19570-1.rar",
      "uploadedUnix": "1340909348",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/3b64975ff02defef503c68b06705e94a2fc5c48f0b89642c2756333ddd1f469a/analysis/1406988422/",
      "changelogHtml": " RELEASE&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nikos%20Overhaul-19570-1.rar?fid=70811&ttl=1535787116&ri=8192&rs=8192&setec=0e6f645d10012d89b13fcf92a207da7f"
    }
  ]
}