{
  "modId": 19580.0,
  "modName": "Evil Lair of Hydra - deutsch",
  "summary": "Ein sehr spezielles Spieler-Heim, das man sich zuerst einmal durch einen harten Kampf gegen die Daedra erkämpfen muss. Wem dies jedoch gelingt, auf den warten einige besondere Überraschungen.\r<br />Dies ist die ins deutsche übersetze Version von hydralisk77. Der Original-Mod wird benötigt, um diese Übersetzung benutzen zu können.",
  "descriptionHtml": "Auf der Reise durch Skyrim begegnen einem viele Herausforderungen. Eine ganz besondere stellt sich dem Spieler hier:\r<br />Hydra, eine dunkle, daedrische Herrscherin fordert Euch heraus, den Platz an ihrer Seite einzunehmen, in einem Haus voller dunkler Lüste, Freuden, Blut und Verdorbenheit. Bereitet Euch darauf vor, ebler Kämpfer von Himmelsrand, denn diese Herausforderung und die darauf folgenden Belohnungen stellen alles in den Schatten, was Ihr bisher erlebt habt.\r<br />\r<br />-\r<br />\r<br />Dieser Mod wurde ursprünglich von hydralisk77 erstellt. Meine Leistung war lediglich, ihn ins deutsche zu übersetzen.\r<br />\r<br />Um diese Übersetzung zu benutzen muss zunächst der Mod von hydralisk77 installiert sein. Zu finden ist er hier:\r<br />[url=http://skyrim.nexusmods.com/mods/12556]http://skyrim.nexusmods.com/mods/12556[/url]\r<br />\r<br />-\r<br />\r<br />[b]Installation:[/b]\r<br />1.) Zuerst den Mod von hydralisk77 herunterladen und nach der dort gegebenen Anleitung installieren.\r<br />2.) Die Dateien aus diesem Download in das Installationsverzeichnis (in der Regel steam&#92;steamapps&#92;common&#92;Skyrim&#92;Data) verschieben.\r<br />3.) Mod aktivieren und Spaß haben :-)\r<br />\r<br />-\r<br />\r<br />[b][color=red][u]Anmerkung:[/u][/color][/b]\r<br />Die Übersetzung dieses Mods ist so weit ich das beurteilen kann fehlerfrei. Sollte trotzdem irgendjemanden noch ein Übersetzungsfehler auffallen, oder ich trotz aller Mühe noch etwas übersehen haben, so teilt mir das bitte hier auf Skyrim-Nexus mit.\r<br />Performance-Fehler oder Bugs gehen nicht auf diese Übersetzung, sondern auf den Original-Mod zurück.\r<br />\r<br />-\r<br />\r<br />Credits gehen vor allem an hydralisk77 für seinen Mod, sowie an alle anderen Beteiligten.\r<br />\r<br />-\r<br />\r<br />[b]Schlusswort:\r<br />[size=3][color=orange][b][b][size=3][color=orange]Abschließend möchte ich hier Werbung für meine neuste Übersetzung machen, nämlich für den wahnsinnig spannenden Mod &#34;[url=http://www.nexusmods.com/skyrim/mods/64283/?]Immersive Jewelry[/url]&#34;, den ich [url=http://www.nexusmods.com/skyrim/mods/66774/?]hier[/url] übersetzt habe.[/color][/size][/b][/b][/color][/size]\r<br />\r<br />Sollte Euch meine Arbeit gefallen, dann bitte lasst mir doch einen Kommentar da, oder klickt einmal auf &#34;endorse me&#34;. Bei genug guter Resonanz übersetze ich vielleicht noch weitere Mods.[/b]",
  "categoryId": "67",
  "version": "1.4",
  "author": "hydralisk77 und Verodor",
  "createdUnix": "1340923870",
  "updatedUnix": "1340926149",
  "containsAdultContent": true,
  "uploadedBy": "Verodor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70879",
      "name": "Evil Lair of Hydra - deutsch",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "141",
      "fileName": "Evil Lair of Hydra - deutsch-19580-1-4.rar",
      "uploadedUnix": "1340926149",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/1afd4bd45144eecb921f917677ad92b5ead7be6add1e582666942fcfa4ce8e30/analysis/1406989023/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Evil%20Lair%20of%20Hydra%20-%20deutsch-19580-1-4.rar?fid=70879&ttl=1535787126&ri=8192&rs=8192&setec=4d56a5216cee5fbfb530240efd520e0a"
    }
  ]
}