{
  "modId": 19600.0,
  "modName": "Summon Whisper Conjurer - The Caller",
  "summary": "This mod allows the player to summon the College of Whisper\\'s The Caller to fight for the player.",
  "descriptionHtml": "Version 1 keeps the 24 ingame hour recast limit.\r\n\r\nVersion 2 removes the recast limit and allows the player to summon The Caller at any time.\r\n\r\nUpon joining the Mage\\'s College you will be tasked on a quest that will allow you to meet the Caller.  This spell allows the player to obtain the ability to call on her for aid.  Read Spoiler section for more details.\r\n\r\n***SPOILERS*** \r\nAfter the events of the Oblivion Crisis, the Mage\\'s guild split into two separate factions, the College of Whispers and the Synod.  Because the College of Whispers did not have any representation in Skyrim, I decided to make The Caller as a member of the faction because of the College\\'s focus on the communication and study of Daedric and spiritual entities.  There are two opportunities to obtain the Caller\\'s Death Tome.  1 is by doing the Mage\\'s College questline, and if you choose to fight her, you can loot the tome from her body.  The second is if you already completed the quest where you meet her, and no longer have access to her body.  For the second method, simply enter Fellglow Keep and find the added \\\"Makeshift Atronach Forge\\\".  Unlock the holder and gain access to her journal, recipe note, and her soul.  I won\\'t spoil the rest anymore, and it\\'s pretty simple deciphering what you\\'ll need to do, so I\\'ll leave it as a mystery for you to find out!\r\n***END SPOILERS***\r\n\r\nTo obtain access to the spell, simply go through the Mage\\'s College questline, or if you\\'ve already beaten it, go to the dungeon where you meet her and find the Makeshift Atronach Forge.  The rest is up to you to figure out how to obtain her.\r\n \r\nThe Caller is equipped with the following:\r\n\r\n1. Whispering Spark:  A concentrated spark spell that has a good attack range.\r\n2. Conjure Elements:  A conjuration spell that allows the caller to summon a flame, a frost, and a storm atronach, as well as a spriggan matron and a wispmother at the same time to fight alongside her.\r\n3. Mystic Whisper:  A heal spell used in conjection with her next spell...\r\n4: Whisper\\'s Teleport:  During battle, The Caller will teleport around the battlefield as means to avoid danger and also to get into the best viewpoint for attacking.\r\n5. The Caller has improved stats in magicka.\r\n6. Custom combat style that focuses on defensive mid range combat. And will teleport around the battle to confuse the enemy or trick her enemies to follower her right into an ambush of her elemental followers.\r\n7. Upon summoning The Caller, she will be the same level as the player and will level with them up to 81.  Her followers will level up to 15, but are still capable of holding their own against most leveled foes.\r\n\r\nNotes: The Caller is a very flashy conjurer and will teleport around the battlefield to confuse her opponents.  She will begin with her Sparks spell and when the opportunity is optimal, she will conjure her elemental followers.  Each follower despite maxing at level 15 are still powerful enough to take care of multiple enemies.  She is very good against all forms of foes, but very powerful melee combatants can take her out in two hits if they catch her by surprise.  Fortunately she will be smart enough to teleport away from further danger and will also cast her Mystic Whisper ability while teleporting.  She may seem invincible, but she can still be taken down if overwhelmed.  If by the time you install this mod you\\'ve already completed the quest for the Mage\\'s College, you can still gain access to the spell by going to the dungeon where you met her.  I\\'ve added a \\\"Makeshift Atronach Forge\\\" that contains the instructions how to summon her.  As an advanced warning, expect a very difficult battle, no matter what level you are.  You might want to use one of my other mods to help in battle XP.\r\n\r\nI am working on other mods, and will be making updates to others. Please endorse if you like this. Also, please let me know if you experience any issues using this mod. \r\n\r\nPlease also check out my other mods when you have the chance! Enjoy! ",
  "categoryId": "75",
  "version": "2",
  "author": "zeroeternalz",
  "createdUnix": "1340942452",
  "updatedUnix": "1340942590",
  "containsAdultContent": false,
  "uploadedBy": "zeroeternalz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70921",
      "name": "Summon Whisper Conjurer - The Caller",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Summon Whisper Conjurer - The Caller-19600-1.zip",
      "uploadedUnix": "1340942527",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/58b08648eb364983af541d4816f89a20e957cfeec53bf16f4eb4080b92cce426/analysis/1406989504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Whisper%20Conjurer%20-%20The%20Caller-19600-1.zip?fid=70921&ttl=1535787151&ri=8192&rs=8192&setec=0825d73bbeee39613fd7f1184f17d7d3"
    },
    {
      "fileId": "70922",
      "name": "Summon Whisper Conjurer - The Caller v2",
      "version": "2",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "12",
      "fileName": "Summon Whisper Conjurer - The Caller v2-19600-2.zip",
      "uploadedUnix": "1340942590",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/471aa2bdcb5911e329791396d774fdc31f0cecf18da8d4ae26091f315adb54ee/analysis/1406989563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Whisper%20Conjurer%20-%20The%20Caller%20v2-19600-2.zip?fid=70922&ttl=1535787152&ri=8192&rs=8192&setec=ac3d4dd27e80345da9d25ad72c459105"
    }
  ]
}