{
  "modId": 19614.0,
  "modName": "Alternative quest end Lights Out after first killing leader Broken Oar Grotto",
  "summary": "Ever did the job for Ahtar (the headsman of solitude) first before you did the job for Jaree-Ra (Lights Out&#33;)? If you have, you probably found Hargar&#39;s Journal and discovered the scheme Jaree-Ra wants to pull on you. Isn&#39;t it strange that even if you have the journal in your possession the dialogue lines of Jaree-Ra still remains the sa",
  "descriptionHtml": "Ever did the job for Ahtar (the headsman of solitude) first before you did the job for Jaree-Ra (Lights Out&#33;)? If you have, you probably found Hargar&#39;s Journal and discovered the scheme Jaree-Ra wants to pull on you. Isn&#39;t it strange that even if you have the journal in your possession the dialogue lines of Jaree-Ra still remains the same, rendering having Hargar&#39;s Journal completely useless (you could leave it on the table where you found it, it makes no difference at all). Well not anymore, this mod add a dialogue sequence if you have Hargar&#39;s Journal on you (or if you managed to get the note of Jaree-Ra before he moves to Broken Oar Grotto, this is highly unlikely but possible (eg. if you used a console command to get the note but the quest remains stuck). In this dialogue sequence you will confront Jaree-Ra with his plans described in Hargar&#39;s Journal, with an option to kill him (there isn&#39;t really an option but you can leave the dialogue before you say : &#34;Now it&#39;s time to end your life&#34;).\r<br />\r<br />Installation\r<br />------------\r<br />Just place the esp in the data folder and enable it with Skyrim Launcher. May not be compatible with NMM.\r<br />\r<br />Known issues\r<br />------------\r<br />You will need to have the journal in your inventory, reading it isn&#39;t enough (a issue I might not be able to fix as there is no dialogue condition for having read a book). A good detective won&#39;t make accusations unless he has the evidence right in front of him.\r<br />\r<br />Future plans\r<br />------------\r<br />Have Deeja (Jaree-Ra&#39;s sister) send Blackblood Marauders after you until you meet her in person (after a certain number of assaults) and you have killed her.\r<br />\r<br />Do not distribute this mod without my permission, You can however make a translation and post it on Skyrim Nexus (&#33;&#33;&#33;NOT ON OTHER SITES&#33;&#33;&#33;) without having my permission if you include me in the credits and you don&#39;t claim the mod as your own. \r<br />\r<br />View my other mods\r<br />-------------------------\r<br />[url=http://www.nexusmods.com/skyrim/mods/50378/?]Disband the Thieves Guild[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/34829/?]KratosRace with unique body texture by volvaga0[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/28880/?]Destroy the Thieves Guild - Final version[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/25443/?]WIP - Destroy the Thieves Guild [/url] (obsolete, final version released)\r<br />[url=http://www.nexusmods.com/skyrim/mods/22219/?]Invisible Aetherial Crown[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/24103/?]Enchanted versions of the Steel Horned Helmet[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/19631/?]Lie to Degaine about Dibella Statue[/url](remade)",
  "categoryId": "24",
  "version": "Final",
  "author": "bruce142",
  "createdUnix": "1340973040",
  "updatedUnix": "1360685342",
  "containsAdultContent": false,
  "uploadedBy": "bruce142",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000009237",
      "name": "Final Version of the Alternative quest end Lights Out after first killing leader Broken Oar Grotto mod",
      "version": "Final",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Final Version of the Alternative quest end Lights Out after first killing leader Broken Oar Grotto mod-19614-Final.rar",
      "uploadedUnix": "1360685342",
      "modVersion": "Final",
      "virusScanUrl": "https://www.virustotal.com/file/be17778dbfc213a7d684abd09c5dee354ec98a957f47b9816ae585242c3165fc/analysis/1407412925/",
      "changelogHtml": " Complete remake, fixes the bug where Jaree-Ra doesn&#39;t attack you and still remains essential (due missing script files). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Final%20Version%20of%20the%20Alternative%20quest%20end%20Lights%20Out%20after%20first%20killing%20leader%20Broken%20Oar%20Grotto%20mod-19614-Final.rar?fid=1000009237&ttl=1535787179&ri=8192&rs=8192&setec=a03d75f625e3515026d8c13b7fc874cd"
    }
  ]
}