{
  "modId": 19625.0,
  "modName": "Fine Leather Armour",
  "summary": "\\\"Fine Leather Armour\\\" based on the Linwe Armour which has had the enchantment removed and is craftable, upgradeable, and enchantable!\r\nIt Is Non Replacing,Will Not Conflict!",
  "descriptionHtml": "\\\"Fine Leather Armor\\\" based on the Linwe Armour which has had the enchantment removed and is craftable, upgradeable, and enchantable!\r\nIt Is Non Replacing,Will Not Conflict!\r\nIs a Vanilla Armour\r\n\r\nI couldnt find a bleach bottle so I used \\\"Salt Pile, Luna Moth Wings, Bone Meal\\\" to be lore friendly, it is mixed together and rubbed into the Leather to explain the ligher color of Leather!\r\nI kept the Armour in line with normal leather however because of the quality reflects Linwe attributes and will have an extra level of enchantment that normal leather does not!\r\n\r\nThe Armour can be crafted, and upgraded at any forge and is in the leather sellection, provided you have all the ingedients allows for a nicer Leather Armour for the player to use from the begining of play!\r\n\r\nMy Other Mod - \\\"Davos J\\'kar Pack Mule\\\" Companion Follower finds refuge in Helgen Keep during the dragon attack, he is more than eager to carry your extra equiptment, however will let you do all the fighting!\r\nDavos is carrying all the ingredients for crafting the first set\r\n\r\nI found no bugs in my game which was reinstalled from an earlier backup, however please let me know if you find any and I will do my best to find a solution\r\n\r\nAll credit goes to Bethseda for this mod as It is a manipulation of existing data to provide the set!\r\n\r\nFuture Upgrades - \r\n(1) Will Add New Unique Colored Leather Texture/Textures\r\n(2) Will Incoporate New Unique Model/Models\r\n\r\nFound that the update versions of skyrim make the arms dissapear so can only see the gloves, dont make the gloves\r\n\r\nI have it in mind to make my own models of this armour so depending on my learning curve with modeling may be a while, atm modeling on my own version of ancient elven bow, getting it in the game will be interesting!\r\n\r\nRecommended Mods - \r\n83Willows 101BugsHD Butterfly Dragonfly Luna-Moth Torchbug by 83Willow - http://skyrim.nexusmods.com/mods/4955\r\n",
  "categoryId": "54",
  "version": "1.0",
  "author": "DanielRColgan",
  "createdUnix": "1340984306",
  "updatedUnix": "1340984546",
  "containsAdultContent": false,
  "uploadedBy": "blacknblue007",
  "primaryFile": null,
  "files": [
    {
      "fileId": "71049",
      "name": "Fine Leather Armor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1754",
      "fileName": "Fine Leather Armor-19625-1-0.rar",
      "uploadedUnix": "1340984546",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2cf26a3cf5ac357585b8c543a82e7d8b26960b5ebf0ec59318cb1dcb54a9658f/analysis/1406990524/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fine%20Leather%20Armor-19625-1-0.rar?fid=71049&ttl=1535787210&ri=8192&rs=8192&setec=998071a1057b3619087fc5634f493364"
    }
  ]
}