{
  "modId": 19647.0,
  "modName": "Deadarmours Weapon Perk Overhaul",
  "summary": "In short:\r\n\r\nSwords and daggers cause heavy bleeding and are likely to crit, but do less critical damage and armour penetration.\r\n\r\nAxes are in between, causing bleeding with a moderate chance to crit and with moderate crit damage and medium armour penetration.\r\n\r\nMaces cause little bleeding, have slight chance to crit, but cause big damage when th",
  "descriptionHtml": "WARNING: THIS MOD MUST COME AFTER \\\"DUEL: COMBAT REALISM\\\" IN THE LOAD ORDER (If you have it, This mod is stand-alone). Not compatible with my other mod \\\"Weapon Perk Change- Blades Bleed, Axes Crit\\\".\r\n\r\nDOWNLOAD THE NEWEST VERSION, A MISTAKE WAS MADE IN THE ORIGINAL WITH AXES/HAMMERS\r\n\r\nIn short:\r\n\r\nSwords and daggers cause heavy bleeding and are likely to crit, but do less critical damage and armour penetration.\r\n\r\nAxes are in between, causing bleeding with a moderate chance to crit and with moderate crit damage and medium armour penetration.\r\n\r\nMaces cause little bleeding, have slight chance to crit, but cause big damage when they do, with heavy armour penetration\r\n\r\nDetailed:\r\n\r\nSwords and daggers:\r\n\r\nRank 1- 15% crit chance, heavy bleeding damage\r\nRank 2- 20% crit chance, 10% crit damage increase, heavier bleeding damage, 10% armour penetration\r\nRank 3- 25% crit chance, 25% crit dmg increase, even heavier bleeding damage, 25% armour penetration\r\n\r\n\r\nAxes:\r\n\r\nRank 1- 10% crit chance, 10% crit damage increase, bleeding damage, 10% armour penetration\r\nRank 2- 15% crit chance, 25% crit damage increase, more bleeding damage, 25% armour penetration\r\nRank 3- 20% crit chance, 50% crit damage increase, even more bleeding damage, 50% armour penetration\r\n\r\n\r\nHammers:\r\n\r\nRank 1- 5% crit chance, 25% crit damage increase, slight bleeding damage, 25% armour penetration\r\nRank 2- 10% crit chance, 50% crit damage increase, a little more bleeding damage, 50% armour penetration\r\nRank 3- 15% crit chance, 75% crit damage increase, a bit more bleeding damage, 75% armour penetration\r\n\r\nBows:\r\n\r\nPower Shot- Arrows pierce through 50% of armour and stagger all but the largest opponents 50% of the time.\r\nCritical Shot Rank 1- Attacks with bows cause bleeding damage, and have a 10% chance of doing a critical hit.\r\nCritical Shot Rank 2- Attacks with bows cause more bleeding damage, and have a 15% chance of doing a critical hit which causes more damage.\r\nCritical Shot Rank 3- Attacks with bows cause even more bleeding damage, and have a 20% chance of doing a critical hit which causes even more damage.\r\n\r\n---\r\n\r\nI\\'ve done my best to try and balance it; referring to my last mod for experience in bleeding damage.\r\nThis mod shouldn\\'t be OP, but I recommend playing on the harder difficulty modes.\r\n\r\nThe bleed is significantly more powerful than vanilla, but not overpowered.\r\nCrit damage is also increased from vanilla, but is a reasonable amount.\r\n\r\nI wanted to try and reflect a more realistic interpretation of the different weapons while maintaining their unique \\\"flavour\\\".\r\n\r\nNow all weapons are useful instead of just swords! \r\n\r\nTestimonials:\r\n- \\\"In my personal opinion, I think this system here should have been implemented in the original game\\\"\r\n- \\\"Subscribing, rating, favouriting\\\"\r\n- \\\"The last mod to make my skyrim perfect\\\"\r\n\r\n---\r\n\r\nUpdate]30/6/12\r\n\r\nBow:\r\nAdded armour piercing to powershot and medium bleed to critical shot\r\n\r\nFixed mace/warhammer/waraxe/battleaxe material types for bleed, should all be working perfect now.",
  "categoryId": "24",
  "version": "1.1",
  "author": "Deararmour",
  "createdUnix": "1341016489",
  "updatedUnix": "1341071055",
  "containsAdultContent": false,
  "uploadedBy": "deadarmour",
  "primaryFile": null,
  "files": [
    {
      "fileId": "71256",
      "name": "Deadarmours Weapon Perk Overhaul",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Deadarmours Weapon Perk Overhaul-19647-1-1.rar",
      "uploadedUnix": "1341071055",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6c97ee60baac05acafe2702c561865dbe2df2d2c7c26f72e547a0074a1def9dc/analysis/1406992213/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deadarmours%20Weapon%20Perk%20Overhaul-19647-1-1.rar?fid=71256&ttl=1535787239&ri=8192&rs=8192&setec=871d0906d49ad77fc1135340f7374630"
    }
  ]
}