{
  "modId": 19643.0,
  "modName": "Imperialistic Imperials",
  "summary": "This mod changes Imperials to try to fit them into a different style of play and make it more of a jack-of-all-trades race, with a focus on Speech.",
  "descriptionHtml": "This mod changes Imperials to try to fit them into a different style of play and make it more of a jack-of-all-trades race, with a focus on Speech.\r\n\r\n---\r\n\r\nIn my opinion, Imperials are really bland in Vanilla Skyrim. So I made this mod (my very first) in an attempt to correct that for myself, and decided to release it here as well.\r\n\r\n[u][b]1. Starting skill bonuses[/b][/u]\r\n\r\nSpeech +10\r\nRestoration +5\r\nSneak +5\r\nOne-handed +5\r\nBlock +5\r\nLight Armor +5\r\n\r\nVanilla Imperial starting skill bonuses are unusual compared to Morrowind and Oblivion, so they have been changed in an attempt to make it more lore-friendly and friendly to previous games, as well as enforce the idea of more varied possibilities.\r\n\r\nRestoration +10 was weird compared to past games that gave no Magic skills to Imperials, so I replaced that with speech (obvious choice, IMO). Kept +5 block and one-handed. Replaced heavy armor with light armor since the latter is more versatile, in my opinion (also matches the Morrowind bonus). Replaced Destruction and Enchanting with Restoration and Sneak to spread the Imperial out into Magic and Stealth, respectively. Although these bonuses stop mattering after a few levels this helps set the player for an all-around experience.\r\n\r\n[u][b]2. Well-Spoken[/b][/u]\r\n\r\n\\\"Imperial Luck\\\" replaced with \\\"Well-Spoken\\\": +25 Speech\r\n\r\nVanilla Imperial Luck is pretty worthless - it adds 2 to 10 extra gold to gold piles you find on enemies or in containers, which I\\'m sure adds up over time but is easily outpaced by selling by the mid-game.\r\n\r\nThe +25 Speech bonus given by Well-Spoken should amount to a starting speech of 50 when you start the game (25 base, +25 green). You will pass speech checks and haggle like a boss, and that\\'s about it.\r\n\r\nWith 50 speech, a 100 coin item will be sold in shops for 265 coins and can be sold by the player for 38 coins, without considering perks or enchantments. With 15 speech, that comes out to 310 and 32 respectively. Overall a few coins\\' difference that serves more for flavor and usefulness than finding a few coins. Investing in Speech perks and enchantments obviously pushes the advantage higher.\r\n\r\n[u][b]3. Voice of the Emperor[/b][/u]\r\n\r\n\\\"Voice of the Emperor\\\" is good enough, so I left it alone for now.\r\n\r\n[u][b]4. Future Possibilities[/b][/u]\r\n\r\nOne possibility for the future would be to make a rebalancing mod for all the races. Right now I am trying Imperial only because it\\'s my first mod and my favorite race from Morrowind and Oblivion.\r\n\r\nBalancing and rebalancing will always be an issue, working out problems as new additions are made, etc. If you don\\'t like a current version, let me know as I work on the next.\r\n\r\n[u][b]5.Compatibility, Requirements, Installation[/b][/u]\r\n\r\nShould be compatible with most mods. It is incompatible with race overhauls that alter the Imperial.\r\n\r\nRequires Skyrim (of course!) and update 1.6.\r\n\r\nJust download it with NMM and install it that way, or unzip the download into your Skyrim/Data folder. It will probably work on an old save, though it will definitely work on a new one.",
  "categoryId": "34",
  "version": "1",
  "author": "Cutthroat",
  "createdUnix": "1341010552",
  "updatedUnix": "1341010681",
  "containsAdultContent": false,
  "uploadedBy": "Cutthroat",
  "primaryFile": null,
  "files": [
    {
      "fileId": "71116",
      "name": "Imperialistic Imperials v1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Imperialistic Imperials v1-19643-1.zip",
      "uploadedUnix": "1341010681",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/cfa66d310c8146b0f087cfef786e587dcfa25c07ec360f8467d2f7c667e31fe8/analysis/1406991189/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imperialistic%20Imperials%20v1-19643-1.zip?fid=71116&ttl=1535787234&ri=8192&rs=8192&setec=b36159ab3380c6e5fe4c22fabcdad912"
    }
  ]
}