{
  "modId": 19655.0,
  "modName": "Matys Mithril",
  "summary": "Mithril light armor for male and female",
  "descriptionHtml": "Hi everyone, I have finally gone back and finished my first project, Mithril armor! :D I have strongly used oblivions Mithril armor as an inspiration and have tried to replicate it as much as possible but still tried to give it a new look for skyrim. I have made all the assets or adapted Skyrims ones so please don\\'t accuse me of stealing as it took me ages to get certain parts as close as possible! :). But I suppose it would be a compliment if you did ;)\r\nIf you like this mod then why not check out my other mods \\\"KNIGHTS OF THE NINE\\\" and \\\"MATYS MEDIEVAL KNIGHTS\\\".\r\n\r\nDETAILS\r\n-Mithril light armor for male and female (argonian and Khajiit not compatible but might include at a later date).\r\n-Can be forged if you have the glass smithing perk and is found under Misc\r\n-Is about the same stats as dragon scale\r\n\r\nErrors\r\n- If you find any errors please let me know\r\n\r\nDonators.\r\nA huge thank you to users that have decided to make a donation. It is really appreciated. Thanks!\r\n- FelxcolossiCXx \r\n- Tfig2110\r\n\r\nPermissions\r\n- At the moment my assets are exclusive and will be untill I can complete all the things I want to do for this mod later on in the year. Translation conversions are fine, just credit me. Thanks\r\n[youtube]OtEemcdHHTo[/youtube]",
  "categoryId": "54",
  "version": "1",
  "author": "Maty743",
  "createdUnix": "1341030291",
  "updatedUnix": "1341030778",
  "containsAdultContent": false,
  "uploadedBy": "maty743",
  "primaryFile": null,
  "files": [
    {
      "fileId": "71176",
      "name": "Matys Mithril",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "46077",
      "fileName": "Matys Mithril-19655-1.zip",
      "uploadedUnix": "1341030778",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/37602027fe5ef2cdbfd361f4ff39e2c6fd432d94f81271f089e9e48241243f4c/analysis/1406991625/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Matys%20Mithril-19655-1.zip?fid=71176&ttl=1535787248&ri=8192&rs=8192&setec=4c07b2b3a861beb031164084ff42e7ba"
    }
  ]
}