{
  "modId": 19667.0,
  "modName": "Water Rock",
  "summary": "Water Rock is a player home located atop a mountain with epic views and is made for a Dark Brotherhood assassin.",
  "descriptionHtml": "Long ago there was a listener for the Dark Brotherhood.. his name was Lucien Lechance, there were rumours of him living in Skyrim when he was only a teenager. His house has been left- abandoned. Who knows what waits inside but the rumours tell that he left Skyrim long ago and has never been seen since!\r\n\r\nDescription\r\n_____________________________________________\r\nWater Rock is a player home built for someone who is in the Dark Brotherhood or someone who is playing an Assassin themed character, it frustrates the hell out of me how i cant find a simple yet refined home with my tastes for an assassin character. And before you say what about Black Tower? its too big for my liking :P. However if your looking for a medium sized plot of land with epic views of waterfalls and Skyrims glorious snow topped mountains then look no further because Water Rock is the home for you. There is a small story behind Water Rock which is told through a note when you first arrive there. Water Rock is designed for an assassin character and is perfect for a member of the Dark Brotherhood it contains the following:\r\n\r\nWorkbench\r\nForge\r\nSmelter\r\nAlchemy Lab\r\nEnchanting Table\r\nTanning Rack\r\n2 Mannequins \r\n2 Weapon Racks\r\n4 Display Cases\r\nAn archery range\r\nPlenty of storage \r\nPossibly one of the best views in all of Skyrim?...\r\nGrind Stone\r\nDark Brotherhood themed exterior and interior\r\nFully Navmeshed\r\n\r\nThis mod is not in any way over powered or unfriendly to the lore of Skyrim. If you want a nice home to live in and immerse your self in the amazing sights that Skyrim has to offer then download my mod :D. I hope you enjoy Water Rock and please give me feedback on it once you have downloaded it and played it.\r\n\r\nInstallation\r\n_____________________________________________\r\nJust extract the esp file into your Skyrim data folder and enjoy!\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "67",
  "version": "1",
  "author": "Lukaethious",
  "createdUnix": "1341048286",
  "updatedUnix": "1341057664",
  "containsAdultContent": false,
  "uploadedBy": "lukaethious",
  "primaryFile": null,
  "files": [
    {
      "fileId": "71232",
      "name": "Water Rock ",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "133",
      "fileName": "Water Rock -19667-1-1.rar",
      "uploadedUnix": "1341057664",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6f5b1da410d37122023b8e76d9865248bef7c869e34e2f5430646b0f3d486ed9/analysis/1406992025/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Water%20Rock%20-19667-1-1.rar?fid=71232&ttl=1535787286&ri=8192&rs=8192&setec=49e5ef89d219af08cbeb2d67664e158a"
    }
  ]
}