{
  "modId": 19685.0,
  "modName": "Nicer Daedric Shield",
  "summary": "A better looking version of the standard daedric shield.",
  "descriptionHtml": "This is my first mod i have done.\r\nI am hoping to get a full set of armor with better colours than what i have now.\r\ni will be working on a full set of daedric amour.\r\ni will be in the future be adding this set as a full stand alone piece so it does not replace all of them in the game.\r\nplease bear in mind that i am doing this without seeing it in-game as i only have the textures folder.\r\n\r\ni believe that this would be a manual install.\r\nyou need to extract the file, then place the textures folder into the data folder of skyrim. skyrim should notice that there is a texture file in there and automatically put it into skyrim.\r\n\r\nif there are any problems please comment or message me.\r\ni do not yet know if this mod actually works as i have not been able to test it as i do not have the skyrim game itself, so please leave me feedback on what i can do.\r\n\r\nif this mod works could you please upload a picture of the mod in game so everyone could see it, this would be of great help.\r\n\r\nIf you have anytime pop into the chat room so I can get it properly up and running and popular. talk about mods and the latest games and random chat.",
  "categoryId": "54",
  "version": "1",
  "author": "jsmoore13",
  "createdUnix": "1341080959",
  "updatedUnix": "1341138210",
  "containsAdultContent": false,
  "uploadedBy": "jsmoore13",
  "primaryFile": null,
  "files": [
    {
      "fileId": "71397",
      "name": "daedric shield",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "382",
      "fileName": "daedric shield-19685-1-1.7z",
      "uploadedUnix": "1341138210",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b61615d1c74d17b0aea8c2058477d4bbc94a44817d424573228314c04aa1e28b/analysis/1406993766/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/daedric%20shield-19685-1-1.7z?fid=71397&ttl=1535787317&ri=8192&rs=8192&setec=0b0c2558d05f8245ab4930941952e770"
    }
  ]
}