{
  "modId": 19713.0,
  "modName": "Sheogorath Companion",
  "summary": "This mod is a port from steam which adds a functional Sheogorath follower to Skyrim. UFO compatible! ",
  "descriptionHtml": "Hi Everyone! This mod is just a port from steam workshop to nexus. The follower is slightly overpowered, and well as he should be… he is the Daedric Prince of Madness after all. Here is the info.\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nThis mod adds Sheogorath as a follower, he is in the Pelagius Wing in The Blue Palace in Solitude in the basement as suggested by jefthereaper. You can now only get him if you have completed his quest. I also gave him the light footed perk so he will no longer set off traps.\r\n \r\nHe has voiced dialogue from shivering Isles and from Skyrim. His combat style involves using a wabbajack like spell and various summoned creatures. \r\n\r\nWARNING HIS WABBAJACK SPELL WORKS ON EVERYONE, INCLUDING DRAGONS AND ESSENTIAL NPCS WHICH HAVE SPECIAL RESPONSES. Dragons die instantly when hit by the spell and by die instantly I mean when they are hit they register they are supposed to be dead but they only actually die as soon as they land on the ground. Essential NPCs get disabled. They are gone forever unless you load a previous save or re enable them in the console. He also has a paralyze spell he uses in combination with the Wabbajack spell.\r\n\r\nAdded a video showing his dialogue and his usual spells the others are not working maybe there is a two spells per NPC limit. In the video you will see that the dragon dies upon landing this is caused by the Wabbajack script I made for dragons. Dragons can only die on the ground.\r\n\r\nHere is the video. http://www.youtube.com/watch?v=fPbZPaIPoFw\r\n\r\nIF YOU WANT TO BE SURPRISED BY HIS ABILITIES DO NOT READ THIS NEXT PART:\r\n\r\n1.\tHe has a wabbajack spell which almost always results in the enemy turning into a Sweet Roll as said above.\r\n2.\tHe has a paralyze spell\r\n3.\tHe conjures many creatures which include:\r\nI.\tA Madness Warrior: A clone of Sheogorath remade into a deadly warrior.(Full Daedric Armor)\r\nII.\tThe Skooma Cat: a very, very, fast attacking cat armed with daggers.\r\n\r\nThe following do not works as often as he prefers to use the other 2 but you may see them occasionally.\r\n\r\n4.\tA Dwarven Centurion Master who has the special ability to breathe fire instead of steam.\r\n5.\tA clone of Alduin himself who pretty much has every shout in the game. THIS DRAGON WILL BE SUMMONED INDOORS!\r\n\r\nCHEESE FOR EVERYONE!!!!!\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nOK, I volunteered to post this here on nexus so others could enjoy this mod but as I am still learning to mod, I will not be updating this mod. If anyone here wishes to update this mod please contact me. I have gotten permission from the author to post this and to allow others to update and use it. Just in case here are quotes from the awesome author himself giving permission (since he is no longer answering questions).\r\n\r\n“THIS MOD IS NO LONGER BEING WORKED ON. Anyone who would like to continue it or use the idea for their own mod will have no problems with me.”\r\n\r\n“I recently had some computer issues and I lost what little work I managed to do. I honestly was getting bored of Skyrim and had no motivation to work on this mod. I give permission to anyone who would like to work on this mod or use my idea for their own mod.”\r\n\r\nNote: I have been using this mod for 2 months and it is just awesome. Like I mentioned it is overpowered but honestly that is to be expected considering its Sheogorath. If anyone is willing to jump in with this mod here is what the author was working on prior to stopping and what a lot of people wished to see done on the mod.\r\n\r\n1.\tMake the Sheogorath Marriageable.\r\n2.\tFix the dragon script where they only die upon landing, to make them die as soon as they get hit. In other words, crash land.\r\n3.\tMake it so he cannot accidentally disable essential followers and/or characters.\r\n4.\tConfigure his dialogue more. He tends to say the same things over and over with the occasional surprise. I believe the sound files from shivering Isles are included and some from Skyrim. If you are experience with dialogue I believe you can get him to say much more, included the idles when you first meet him in actual Skyrim.\r\n5.\tMake him use his other 2 spells more frequently. Fix him accidentally summoning Alduin indoors.\r\n6.\tAnd last but not least, this one is not as popular as the other requests but is still one of them; Make him less over powered.\r\n\r\n\r\nInstallation Instructions: \r\n1.\tCopy sheogorath companion.esp and sheogorath companion.bsa to the data folder.\r\n\r\nUn-installation Instructions:\r\n1.\tDelete sheogorath companion.esp and sheogorath companion.bsa from the data folder.\r\n",
  "categoryId": "66",
  "version": "1",
  "author": "madpianist",
  "createdUnix": "1341145417",
  "updatedUnix": "1342052925",
  "containsAdultContent": false,
  "uploadedBy": "madpianist",
  "primaryFile": null,
  "files": [
    {
      "fileId": "71419",
      "name": "Sheogorath Companion",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7105",
      "fileName": "Sheogorath Companion-19713-1.rar",
      "uploadedUnix": "1341145957",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/cf9f921ab5977c33eb6e7d652ea5e3a370ffc507aaccbb6bc425594df873cb4b/analysis/1406993892/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sheogorath%20Companion-19713-1.rar?fid=71419&ttl=1535787371&ri=8192&rs=8192&setec=1133966791bcf3268418347b9ed08019"
    },
    {
      "fileId": "73721",
      "name": "Sheogorath Companion No Bsa",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7138",
      "fileName": "Sheogorath Companion No Bsa-19713-1.rar",
      "uploadedUnix": "1342052925",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/206ba84d4d71957dd53452513f444a7c5722837044c82aa8b9a74b4202b55427/analysis/1407017062/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sheogorath%20Companion%20No%20Bsa-19713-1.rar?fid=73721&ttl=1535787372&ri=8192&rs=8192&setec=ee8db395e1a442df58fe8dd6f933c310"
    }
  ]
}