{
  "modId": 19741.0,
  "modName": "Dwemer Flying Machine",
  "summary": "This is a modders\\' resource version of a flying machine mod. All and any feedback, including bugs, suggestions and general derision is welcome. It requires Skyrim Script Extender 1.6.13 or higher, available from http://skse.silverlock.org, and Skyrim 1.9.32 or higher.\r\n\r\nModders are welcome to incorporate this in their own mods, making any adjustm",
  "descriptionHtml": "Skyrim Flying Machine Resource 1.0\r\n==================================\r\n\r\nThis is a modders\\' resource version of a flying machine mod. All and any feedback, including bugs, suggestions and general derision is welcome. It requires Skyrim Script Extender 1.6.13 or higher, available from http://skse.silverlock.org, and Skyrim 1.9.32 or higher.\r\n\r\nModders are welcome to incorporate this in their own mods, making any adjustments or alterations they wish, no credit needed or asked for. However, I simply don\\'t have time to provide support or advice to end users of anybody else\\'s mods even if those mods include flying machines based on this one. If you want to use this in your own mod you\\'ll have to be prepared to read the scripts and study the NIF files and provide your own support. I am more than happy to give advice and information to any mod makers, as and when I have time.\r\n\r\nI have made the scripts as readable and commented as I can. Information on the structure of the main NIF file will follow shortly.\r\n\r\nThe models used in this mod are heavily modified versions of Bethesda models, and remain the property of Bethesda Softworks. Thay may only be destributed as parts of Skyrim mods.\r\n\r\n*** Version 1.0 is NOT compatible with earlier versions. *** If you already have Dwemer Flying Machine 0.4 or earlier installed, please revert to a save from BEFORE you ever installed it before trying to use this version. Sorry.\r\n\r\nAn example of the machine can be found outside Honningbrew Meadery near Whiterun. Very nearly every aspect of the machine\\'s behaviour can be adjusted through properties on the base object\\'s scripts.\r\n\r\nThere is a \\'Flyer Repair Hammer\\' lying on the ground between the brewery and the road.\r\n\r\n\tActivate to use (the machine starts in \\'hover\\' mode)\r\n\r\n\t\\'Sneak\\' = Toggle between hover and forward-flight mode\r\n\r\n\t\\'Forward\\' = up\r\n\r\n\t\\'Backward\\' = down\r\n\r\n\t\\'Strafe-left\\' = left\r\n\r\n\t\\'Strafe-right\\' = right\r\n\r\n\t\\'Right-hand-attack\\' = Fire missile\r\n\r\n\t\\'Left-hand-attack\\' = Cycle through missile types (default action is to fire each missile type in turn)\r\n\r\n\t\\'Ready-weapon\\' gets the machine right-side up during flight if it\\'s flipped by a collision with a dragon during combat.\r\n\r\n\t\\'Jump\\' to get off - if you jump while high up you WILL die.\r\n\r\nWhile hovering, the \\'Up\\' and \\'Down\\' keys will pitch the machine, allowing you to shoot at things up on towers or down on the ground. This is awkward to use and you\\'re generally going to be better off landing and fighting NPCs and animals on foot. The \\'Up\\' and \\'Down\\' keys will also make the flyer ascend and descend while hovering.\r\n\r\nWhen fighting a dragon in the air, missiles will lock on and seek it out if it is sort-of in front of you when you fire them. If you have an NPC companion they will take the rear seat on the flyer and take occasional shots at any dragon that is behind the flyer.\r\n\r\nIf the flying machine takes damage in combat it will catch fire. Enough damage and it will break apart in the air. You\\'ll probably die unless you land in water.\r\n\r\nTo repair damage, equip the \\'Flyer Repair Hammer\\' (it\\'s a weapon) and repeatedly hit the flying machine with it.\r\n\r\nIf you lose the flying machine, land it in deep water, let it fall off a mountain etc., one of the fast-travel carriage drivers will recover it for you at a cost of 50 gold.\r\n\r\nThere is little protection against breaking quests by going where you shouldn\\'t. If you\\'re using Open Cities, enter cities by the gate to be sure of triggering any quests. The flyer won\\'t go higher than High Hrothgar to avoid breaking the main quest at one point.\r\n\r\nPlease be aware that this is still a work in progress, and contains both known and unknown problems. Please don\\'t make a save with this installed that you won\\'t be happy to throw away - there\\'s always the chance the mod might corrupt your save.\r\n\r\n\r\nIncompatibilities\r\n-----------------\r\n\r\nThere are minor incompatibilities with Ultimate Followers Overhaul;\r\n\r\n\t1. Companions who\\'ve been told to \\'Relax a while\\' will still be brought on the flyer, unless they\\'re in an interior or are far away.\r\n\r\n\t2. The animation for companions sitting on the flyer are slightly deranged.\r\n\r\n\r\nChanges in 1.0\r\n--------------\r\n\r\nThe player\\'s companion will now act as a rear-gunner.\r\n\r\nAlmost all aspects of the flyer configurable through properties.\r\n\r\nAdded support in scripts and properties for multiple companion gunners (not tested or supported in the example flyer).\r\n\r\n\r\nChanges in 0.4\r\n--------------\r\n\r\nFixed the flyer behaviour if the player flies across the Skyrim border.\r\n\r\nThe player\\'s companion will now sit on the flyer\\'s rear-facing seat.\r\n\r\nDisabled \\'Activate\\' control while flying, as player could activate doors with weird results.\r\n\r\nPlayer now dismounts by jumping off.\r\n\r\nAltered the \\'Pitch-down\\' behaviour while hovering, to gradually lower the flyer.\r\n\r\n\\'Waiting\\' companions will now be left behind.\r\n\r\nAdded an in-flight sound.\r\n\r\nCorrected the flyer to make a metallic sound when colliding with scenery.\r\n\r\n\r\nChanges in 0.3\r\n--------------\r\n\r\nSome changes to try and make the scripts more efficient.\r\n\r\nFrom the console, select the Flyer and enter\r\n\r\n\tsetpv maxforwardthrust <some value>\r\n\tsetpv maxspeed <some value>\r\n\r\nto change the Flyer\\'s speed. Default values are 1200 and 800 respectively.\r\n\r\n\r\nKnown problems in 1.0\r\n---------------------\r\n\r\nA few people have reported that the version 0.4 flying machine works highly erratically or fails to lift off the ground. I suspect this is due to heavy script loading on their systems or mod incompatibilities, but have been unable to reproduce the issue on my system except with deliberately broken scripts.\r\n\r\nActivating the flyer while standing on top of it in deep water breaks all control of the flyer and stops the player from getting off.\r\n\r\nOften, if the flyer is destroyed in flight killing the player character, the game will crash.\r\n\r\nThe mount/dismount animations are poor.\r\n\r\nIf you change from 1st to 3rd person view (or vice versa) while flying, the in-flight sound will change volume for a couple of seconds. It\\'s unlikely I can fix this.\r\n\r\nThe flyer\\'s \\'glow\\' becomes discoloured by the \\'shield\\' effect.\r\n\r\n\r\nMatters of opinion\r\n------------------\r\n\r\nYou can\\'t save while flying. I seriously doubt this\\'ll change unless there\\'s an outcry.\r\n\r\nYou can\\'t fast-travel while flying. This does prevent setting the custom map marker on fast-travel destinations.\r\n\r\nThe example flying machine is overpowered, being too fast for dragons to hit during combat.\r\n\r\n\r\n\r\nStuff still to do\r\n-----------------\r\n\r\nDisable or cope with fast travel without preventing custom marker being set on fast travel map markers.\r\n\r\nI intend to now start on creating my own quest to get the machine, upgrade it, add/improve weapons etc.\r\n\r\n\r\nTo uninstall\r\n------------\r\n\r\nBest to deselect and delete the mod and delete any savegames made with it. Otherwise, go to an interior and save, exit Skyrim, deselect and delete the mod, re-start Skyrim, load your save, re-save, exit and re-start Skyrim, load your last save. I\\'ve taken some care to try and avoid savegame bloat and slowdown if using a save which has had the flying machine removed, but no guarantees.",
  "categoryId": "82",
  "version": "1.1",
  "author": "AndyW1384",
  "createdUnix": "1341175428",
  "updatedUnix": "1368916581",
  "containsAdultContent": false,
  "uploadedBy": "AndyW1384",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029590",
      "name": "DwemerFlyer Resource",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1662",
      "fileName": "DwemerFlyer Resource-19741-1-0.zip",
      "uploadedUnix": "1368391885",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9e672641b51d58c44f97911d97924cee0c03dea9ef7d2ef2f67adbb250cc34b9/analysis/1407567185/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DwemerFlyer%20Resource-19741-1-0.zip?fid=1000029590&ttl=1535787411&ri=8192&rs=8192&setec=72fa0281ab2b253489d8c14c3dc3f0e6"
    },
    {
      "fileId": "1000030450",
      "name": "Dwemer Flyer NIF Structure",
      "version": "1.1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1289",
      "fileName": "Dwemer Flyer NIF Structure-19741-1-1.zip",
      "uploadedUnix": "1368916581",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/fcdbf75d78f9746ba55523f2d459837e4851d2cce7961aaf655baaf9ad1ad3cb/analysis/1407574101/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwemer%20Flyer%20NIF%20Structure-19741-1-1.zip?fid=1000030450&ttl=1535787411&ri=8192&rs=8192&setec=96db4210145983f1314b1598f9f28fa9"
    }
  ]
}