{
  "modId": 19757.0,
  "modName": "Silvia Saint Follower",
  "summary": "This is a follower mod that turns Jordis the Sword-Maiden, the housecarl of Proudspire manor into Silvia Saint, the Adult Entertainer.  ",
  "descriptionHtml": "[b]Silvia Saint Follower[/b]\r\n\r\nThis is a follower mod that turns Jordis the Sword-Maiden, the housecarl of Proudspire manor into Silvia Saint, the Adult Entertainer.  I did this with the help of Apachii\\'s SkyHair and Zalzama\\'s Amazing Smooth females face textures.  It is necessary to have both the SkyHair and Amazing Smooth females face textures mods installed in order to make her look as she does in the images.  I have also used Acdales EyeCandy Body (ADEC) and ADEC Armour and Clothing Complation in the screenshots (not included), which I also use and recommend, but you can use whatever body you like with this.  If you do not use the ADEC body, I cannot guarantee that the skin tones will match between the head and body.\r\n\r\n[b]WARNING:[/b]  When Silvia is not following you, she will often end up hanging out naked or wearing just underwear, depending on what body mod you use.  It\\'s something to do with the AI Bethesda made if the author doesn\\'t set an irremovable default armour set for them.  But hey... nudity should be expected, this is Silvia Saint!   \r\n\r\n\r\n[b]Installation:[/b]\r\n\r\n1. [url=http://skyrim.nexusmods.com/downloads/file.php?id=10168]Download and install ApachiiSkyHair[/url]\r\n2. [url=http://skyrim.nexusmods.com/downloads/file.php?id=140] Download and install Amazing Smooth Females Complete[/url].  If you plan on installing the ADEC body, then you will need to install this Smooth Females mod AFTER it, to help insure that the skin tones match.\r\n3. Then after downloading this mod as well, Unzip the file contents to steamapps\\\\common\\\\skyrim\\\\data\r\n4. Activate SW_Silvia.esp in the Nexus Mod Manager or the Skyrim Launcher.\r\n\r\n\r\n[b]Uninstall:[/b]\r\n\r\nSimply delete the SW_Silvia.esp from steamapps\\\\common\\\\skyrim\\\\data\r\n\r\n \r\n[b]Recommended Mods:[/b] As used in the images of Silvia and parts taken from to make this mod possible.\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=10168]ApachiiSkyHair[/url] (NEEDED!)\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=140]Amazing Smooth Females Complete[/url] (NEEDED!)\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=5390]Acdale EyeCandy Body[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7782]ADEC Armour and Clothing Complation[/url]\r\n\r\n\r\n[b]The Grey Face Bug[/b]\r\n\r\nProviding you have installed this mod correctly and used all of the recommended mods to accompany it, there should be no mismatch between this characters head and body colour.  I have also followed the necessary steps with the Creation Kit to eliminate the Grey Face Bug before releasing it to the public and I have tested it myself.  As you can see from the images provided the bug is not present for me when I am using them.   However on the off chance that the bug still affects you, there is a way you can attempt to fix it yourself.  [url= http://www.youtube.com/watch?v=rOXF89QtgYM]Here is a helpful video showing you how you can do this.[/url]  Hopefully Bethesda will come up with a fix for this soon.\r\n\r\n\r\n[b]Credits/Thanks[/b]\r\n\r\nBethesda for Skyrim.\r\nApachii for the use of the hair from their SkyHair Mod.\r\nZalzama  for the Amazing Smooth females face texture used in this mod.\r\nAcdale for the use of their ADEC body and Armour in the images.\r\n\r\n\r\nEnjoy!\r\n\r\n\r\nShockwolf\r\n",
  "categoryId": "66",
  "version": "1",
  "author": "Shockwolf",
  "createdUnix": "1341199442",
  "updatedUnix": "1341199492",
  "containsAdultContent": false,
  "uploadedBy": "ShockWolF",
  "primaryFile": null,
  "files": [
    {
      "fileId": "71571",
      "name": "SW_Silvia",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "SW_Silvia-19757-1.rar",
      "uploadedUnix": "1341199492",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/d457457d9a32ee606675c6a0ca80205612d8f41f6b57fd5a897462d85dab4a4b/analysis/1406995685/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SW_Silvia-19757-1.rar?fid=71571&ttl=1535787445&ri=8192&rs=8192&setec=8715805b8736f715c4734bfb4bce097e"
    }
  ]
}