{
  "modId": 19779.0,
  "modName": "Laci the Orc Marksman",
  "summary": "A badass looking heavy-armored orc who uses a bow with shock enchantment. He is skilled with all weapons and heavy armor, so you can use him for example as a two-handed warrior or a shielded tank aswell. PLEASE READ LONG DESCRIPTION&#33;",
  "descriptionHtml": "[color=orange][u][b][size=12]Introduction[/size][/b][/u][/color]\r<br />\r<br />This is my very first mod (or whatever you call a custom follower that anyone could make after watching a few guides). I originally made this only for myself, but he is too much of a badass, so I just had to upload him.\r<br />He uses a shock-enchanted orcish bow with 500 orcish arrows in his inventory, and orcish armor without the helmet. He is skilled in melee weapons aswell, but he is only skilled in heavy armor. He has a decent amount of health and damage. You can change his weapons and armor of course.\r<br />[color=yellow][b]I think he is balanced, but if you find him too strong, consider changing the game difficulty.[/b][/color] I am using him on Master difficulty, he is well-balanced on that difficulty for me. I didn&#39;t test him too much on other difficulties.\r<br />[color=yellow][i]He has a bonus ring and necklace in his inventory.[/i] [b]You will have to take them from him and give back to him, so he will equip them.[/b][/color] If you find these items too powerful, just drop them. Or you can use them for yourself.\r<br />\r<br />[color=orange][u][b][size=12]Installation[/size][/b][/u][/color]\r<br />\r<br />Open the .rar, and just drop everything into the Data directory, as you would do with any other mod. Overwrite/replace everything if a window pops up asking it.\r<br />\r<br />If you want to uninstall, just delete those files.\r<br />\r<br />[color=orange][u][b][size=12]Location[/size][/b][/u][/color]\r<br />\r<br />He is sitting on a bench next to the Talos statue and that screaming herald guy, in Whiterun.\r<br />He is not sandboxing, he is always sitting on that bench so you can always find him.\r<br />He will always return there if you dismiss him.\r<br />\r<br />[color=orange][u][b][size=12]Stats & details[/size][/b][/u][/color]\r<br />\r<br />[u][b]Stats on level 35:[/b][/u]\r<br />One-handed: 74\r<br />Two-handed: 74\r<br />Archery: 70 (he has an archery skill improving ring in his inventory.)\r<br />Block: 75\r<br />Heavy armor: 52 (he has a heavy armor skill improving necklace in his inventory)\r<br />Light armor: 42\r<br />\r<br />(The reason I didn&#39;t make his archery higher because the all classes in the CK are limited in some way. I used CWSoldierClass to make him all-around good with all weapons and armors, so you can use him however you want. But you can equip his ring and necklace to him if you want to use him how I meant it to. They won&#39;t be equipped by default.)\r<br />\r<br />His speed is increased from 100 to 125, so he can catch up better. Every follower is slow and it is frustating to wait for them, so I hope this helps.\r<br />\r<br />He has many of the powerful archery perks.\r<br />\r<br />[color=orange][u][b][size=12]Issues[/size][/b][/u][/color]\r<br />\r<br />He may have level 1 stats when you first meet him, you may have to level up and his stats will be your level&#39;s stats. I was 38 when I met him, I used player.setlevel 39 and his stats became normal.\r<br />If it&#39;s not working, here is a [b][url=http://www.youtube.com/watch?v=lsAXKpQ27IQ]video[/url][/b] about how to fix it.\r<br />His youtube name is [u][b]RealistReviewer[/b][/u]. Please subscribe to him. Thank you for making this video&#33;\r<br />I do not own this video.\r<br />\r<br />[color=orange][u][b][size=12]Credits and stuff[/size][/b][/u][/color]\r<br />\r<br />I hope you will like this little mod. It&#39;s really no big deal to make a follower mod, search for guides in Youtube. But I warn you: the Creation Kit is really buggy and has a lot of issues. I need feedback and suggestions, so I can improve this mod, and I will be able to make more mods.\r<br />Thank you to Bethesda for making Skyrim and the Creation Kit.\r<br />Thank you to Youtube.com and his users for the Creation Kit guides and bug fix videos.\r<br />Thank you to Nexusmods.com so I could upload this.\r<br />Thank YOU for using this mod.",
  "categoryId": "66",
  "version": "1.0",
  "author": "LordAdamPro",
  "createdUnix": "1341226790",
  "updatedUnix": "1341226942",
  "containsAdultContent": false,
  "uploadedBy": "LordAdamPro",
  "primaryFile": null,
  "files": [
    {
      "fileId": "71638",
      "name": "LaciTheOrcMarksman",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "180",
      "fileName": "LaciTheOrcMarksman-19779-1-0.rar",
      "uploadedUnix": "1341226942",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6e28751c0d71fffad686dbf43041067979d77d3ffb30016a9e4f315eac97e787/analysis/1406996342/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LaciTheOrcMarksman-19779-1-0.rar?fid=71638&ttl=1535787480&ri=8192&rs=8192&setec=40fee57e7e3efa7a5145fd26c9c7e5de"
    }
  ]
}