{
  "modId": 19782.0,
  "modName": "Morag Tong - audio fix",
  "summary": "This simple mod changes the audio referencing \\\"Morang Tong\\\" to \\\"Morag Tong\\\", to make it more in-keeping with the name from Morrowind.  Supplemental to the Unofficial Skyrim Patch which amends the corresponding dialogue subtitles.",
  "descriptionHtml": "Morag Tong audio fix v1 by Jackstarr\r\n---------------------------------------------------\r\n\r\nNow also included as part of the Unofficial Skyrim Patch - this version still works standalone if you don\\'t use the Unofficial Patches though! \r\n\r\n\r\nIn Morrowind, there was a guild called the Morag Tong.  In Skyrim, this guild is mentioned by a character, but is incorrectly referred to as the Morang Tong.\r\n\r\nThis simple mod changes the audio referencing \\\"Morang Tong\\\" to \\\"Morag Tong\\\", to make it more in-keeping with the name from Morrowind.  It edits the actual audio files themselves, making the character say \\\"Morag\\\" instead of \\\"Morang\\\".  \r\n\r\nSupplemental to the Unofficial Skyrim Patch which amends the corresponding dialogue subtitles and text references.\r\n\r\nTo view a brief sample video of one of the changes in-game, click on the video tab or visit [url=http://www.youtube.com/watch?v=PWlqpJreqto&feature=youtu.be]http://www.youtube.com/watch?v=PWlqpJreqto&feature=youtu.be[/url].\r\n\r\nInstallation\r\n---------------\r\n\r\nDrop the Sound folder into your Skyrim Data directory.\r\n\r\n\r\nCopyright notice - the sound files are the copyright of the original copyright owners (Zenimax/Bethesda) and are provided here as an edited form of files already present in the game.  No copyright infringement is intended with this mod.  To use these files in game you must have the original files as supplied with the default Skyrim game. These files are provided under the assumption of fair usage - if any copyright holder believes this is not the case, please contact me and these files will be removed.  This mod cannot be uploaded anywhere else without permission.",
  "categoryId": "95",
  "version": "1",
  "author": "jackstarr",
  "createdUnix": "1341231057",
  "updatedUnix": "1341231220",
  "containsAdultContent": false,
  "uploadedBy": "jackstarr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "71649",
      "name": "Morag Tong - audio fix",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "139",
      "fileName": "Morag Tong - audio fix-19782-1.zip",
      "uploadedUnix": "1341231220",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/734a93e98b0318e52f330785df69b5b0fea6e70abc1eda3cc35904e6694e8cf4/analysis/1406996406/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morag%20Tong%20-%20audio%20fix-19782-1.zip?fid=71649&ttl=1535787483&ri=8192&rs=8192&setec=33b170108e486fe3de9078fcb7c329f6"
    }
  ]
}