{
  "modId": 198.0,
  "modName": "New Skyrim Shadows for Medium-Range PC",
  "summary": "New Skyrim Shadows for Medium-Range PC",
  "descriptionHtml": "THIS TWEAK IS OUTDATED, PLEASE VISIT THE LINK BELOW FOR THE MOST RECENT VERSION.\r\nhttp://skyrim.nexusmods.com/mods/283\r\n\r\nHey everyone!.\r\n\r\nHere you have my SkyrimPrefs.ini settings for making your 2048 (high/medium) shadows look a bit better.\r\n\r\nI was trying to find a good solution for Skyrim shadows problem, and most of them are based on 4096 shadow map resolutions, which makes my Skyrim get a huge lag in interiors.\r\nAnd I wasn\\'t fully satisfied with the 2048 shadow map resolution modifications, because most of them didn\\'t fully fix the flickering/buggy shadows problem and have a low draw distance.\r\nSo, my goal was to fix flickering/buggy shadows and increase shadow draw distance at the same time, using 2048 shadow map resolution.\r\n\r\n====================================================================================\r\nLINKS:\r\n\r\nThere\\'s a new version anvaiable here: http://www.skyrimnexus.com/downloads/file.php?id=283\r\nNew version contains accurate character shadows and better shadow draw distance.\r\n\r\n====================================================================================\r\nTWEAK:\r\n\r\nHere\\'s my own settings for this problem.\r\nAs usual, change this values in your SkyrimPrefs.ini (it can be found in C:\\\\Users\\\\*USERNAME*\\\\Documents\\\\My Games\\\\Skyrim\\\\ directory):\r\n\r\niBlurDeferredShadowMask=5\r\nfInteriorShadowDistance=2500.0000\r\nfShadowDistance=1500.0000\r\niShadowMapResolutionSecondary=1024\r\niShadowMapResolutionPrimary=2048\r\nfShadowLODStartFade=1500.0000\r\nbTreesReceiveShadows=1\r\nbDrawLandShadows=1\r\niShadowMapResolution=2048\r\nfShadowBiasScale=1.5000\r\niShadowMaskQuarter=4\r\niShadowFilter=4\r\n\r\n====================================================================================\r\nADDITIONAL PERFORMANCE:\r\n\r\nIf you want more performance, without any significant shadow quality loss, change this value:\r\niShadowFilter=3\r\n\r\nIf you want even more performance, you can disable land shadowing and tree shadowing, to do that, change values below:\r\nbTreesReceiveShadows=0\r\nbDrawLandShadows=0\r\n\r\n====================================================================================\r\nVALUES DESCRIPTION:\r\n\r\nIf you willing to tweak some settings yourself, here is some small information I\\'ve discovered on my tweaking attempts on what those values actually do (I\\'m no expert, those are all my observations):\r\n\r\niBlurDeferredShadowMask\r\nThis determine your shadow sharpness. It goes from 1 (sharpest, more blocky and more detailed) to 5 (and above, smoother, less blocky and less detailed).\r\n\r\nfInteriorShadowDistance\r\nInterior shadow draw distance, smaller values (like 1500.000) makes shadows more detailed, but suffer strange shadow&light pop-up. Higher values (2000.000 up to 3000.000), on the other hand, \\\"stretch\\\" shadow resolutions, making them undetailed and blocky.\r\n\r\nfShadowDistance\r\nExterior shadow draw distance, smaller values (like 400.000 or 1000.000) make shadows more detailed, but suffer small draw distances. Higher values (4000.000 and above)  \\\"stretch\\\" shadow resolutions and make them undetailed and blocky, but with high draw distance.\r\n\r\nbTreesReceiveShadows\r\nbDrawLandShadows\r\nThose adds some eye-candy for land and trees. Basically, first value add shadows to tree structure, making them look more \\\"deep\\\". Second one adds some insignificant shadows on rocks and land. By enabling both options, you will loss about 1-4 FPS, depending on your system, and make your game a bit prettier.\r\n\r\niShadowMapResolution\r\nThe important one, determine you shadow resolutions, it goes from 512, 1024, 2048 to 4096 (setting a value between those ones makes shadow bug-out). Smaller the value, the less resources it requires and lower the shadow resolutions/quality. Remember that even low resolution shadows can be good quality ones, to do that you must not \\\"stretch\\\" them by selecting a high exterior shadow distances.\r\n\r\nfShadowBiasScale\r\nThis determine shadow bias and distance of quality loss. Practically lower values (like 0.1500 or 0.3000) makes character shadows accurate, but makes other shadows to flicker and behave strangley. Higher values (from 1.0000, 1.2500 or 1.5000), that I\\'m using, makes character shadows a bit innacurate, but disables most of shadow flickering issues. Remember, if the vasues are to small (below 0.1500), it will make a graphical \\\"ground self-shadowing\\\" bug. Too high values (above 2.5000) basically will ruin all the game shadows.\r\n\r\niShadowMaskQuarter\r\nSets how far shadows must be from the player to start loosing some kind of LOD (level of detail). It can be se from 1 (lowest, shadows are only detailed in front of the player) to 4 (highest). I\\'ve also noticed that it can be set above 4 (tried setting it to 8), but i didn\\'t notice any visual difference, beside FPS loss.\r\n\r\niShadowFilter\r\nSets shadow filtering method, It can be set from 1 (lowest) to 4 (highest), and it helpf a little with getting better quality shadows. Best to stick with 4 or 3.\r\n\r\n====================================================================================\r\nPROS AND CONS:\r\n\r\nPROS:\r\n-Fixes most of flickering/buggy shadows.\r\n-Shadows on characters aren\\'t that blocky.\r\n-Trees and character shadows (ground) are more smooth and look more detailed.\r\n-It won\\'t hurt your framerate like 4096 shadow map resolution.\r\n\r\nCONS:\r\n-Still, it has a small draw distance, but higher than in most fixes (1500 instead of 1000 or 400).\r\n-Shadows on character aren\\'t blocky, but seems a bit undetailed and inaccurate.\r\n\r\n====================================================================================\r\nFROM ME:\r\n\r\nAnd remember, it\\'s not a permanent and best solution for Skyrim shadows problem, but definitely worth checking out. For a permanent fix of this issue, we all must wait for Bethesda to take action with a patch or something.\r\nBest used with slightly increased FOV.\r\nOnce again, tell me if you like it or hate it :D.\r\n-defosh369",
  "categoryId": "62",
  "version": "1.2",
  "author": "defosh369",
  "createdUnix": "1321303481",
  "updatedUnix": "1322145965",
  "containsAdultContent": false,
  "uploadedBy": "defosh369",
  "primaryFile": null,
  "files": [
    {
      "fileId": "3465",
      "name": "New Skyrim Shadows for Medium-Range PC",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "New Skyrim Shadows for Medium-Range PC-198-1-2.rar",
      "uploadedUnix": "1322145965",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/2c3ab3c2a8cb660b0ded36cb5124e617adafc4ff59a9c668ac8c90d811f11838/analysis/1406442064/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Skyrim%20Shadows%20for%20Medium-Range%20PC-198-1-2.rar?fid=3465&ttl=1535752846&ri=8192&rs=8192&setec=65e6babcc25f1170e6572c1dbf142d1b"
    }
  ]
}