{
  "modId": 19815.0,
  "modName": "Dual Wield Two Handed Weapons - WIP",
  "summary": "Allows you to dual wield two handed weapons. This is a work in progress.",
  "descriptionHtml": "This mod changes all weapons to be able to be dual wielded, even from mods (99% sure). How? It changes the base weapons. Every type of weapon has a base weapon it\\'s built off of, so a steel two-handed sword of werewolf slaying has a base of steel two-handed sword. Change the sword and all other swords that use that base are affected. That\\'s why this *should* be effective with all mods, well, any that use any of the original weapons as a base.\r\n\r\nThere are two versions of this mod.\r\n\r\nThe first version changes all weapons to work off of either hand instead of both hands by changing the base weapons.\r\n\r\nThe second version adds on the first mod by changing the animation from the respective two handed weapon to their one handed counterparts. (Ie: Two-handed sword animation is changed to a One-handed sword animation).\r\n\r\nThe reason this is still a work in progress is because the animations for both mods are screwed up. As you can you see in the pics for #1, you hold both weapons in your hand as you swing and it doesn\\'t look right. They both attack yes, but the animations aren\\'t right. With the second version, the animations are good because they\\'re using the one handed versions of the weapons but the right hand is always invisible. One aspect of the 2nd mod is that it does allow you to hold a two-handed weapon in your left hand and a one-handed weapon in your right, the animation is correct for that and looks great.\r\n\r\nSo if anyone can help me with the animations, I would appreciate it and give you all the credit. No need to email me to ask, if you can fix it, message me and I\\'ll put your name up and give you all the credit.\r\n\r\nOnce this is fixed, feel free to upload pics of your character wielding the most impressive weapons they can find!\r\n\r\nWeapons changed:\r\nAxe of Ysgramor\r\nBound Weapon Battleaxe\r\nBound Weapon Battleaxe Mystic\r\nDaedric\r\nDraugr\r\nDwarven\r\nEbony\r\nEbonyBlade\r\nElven\r\nExecutioner Axe\r\nGiant - made them be able to drop as well\r\nGlass\r\nIron\r\nNord Hero\r\nOrcish\r\nRueful Axe\r\nSilver\r\nSteel\r\nVolendrung\r\n",
  "categoryId": "24",
  "version": "1",
  "author": "Ed-Zero",
  "createdUnix": "1341294214",
  "updatedUnix": "1341294347",
  "containsAdultContent": false,
  "uploadedBy": "Darkvirii",
  "primaryFile": null,
  "files": [
    {
      "fileId": "71847",
      "name": "Dual Wield Two Handed Weapons - Either Hand",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Dual Wield Two Handed Weapons - Either Hand-19815-1.rar",
      "uploadedUnix": "1341294314",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e3eed9be0007d56d4da80cc4fa90523875d30041364334f869dd1e7337dfd779/analysis/1406998146/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dual%20Wield%20Two%20Handed%20Weapons%20-%20Either%20Hand-19815-1.rar?fid=71847&ttl=1535787522&ri=8192&rs=8192&setec=b5fb1c8d0cb7740481430f9a659264a8"
    },
    {
      "fileId": "71848",
      "name": "Dual Wield Two Handed Weapons - Either Hand with anim changes",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Dual Wield Two Handed Weapons - Either Hand with anim changes-19815-1.rar",
      "uploadedUnix": "1341294347",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/49f7abdeb4693f1ba2aed585cd3d247d0fca3a230c746cacaaff9115594e4aae/analysis/1406998146/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dual%20Wield%20Two%20Handed%20Weapons%20-%20Either%20Hand%20with%20anim%20changes-19815-1.rar?fid=71848&ttl=1535787522&ri=8192&rs=8192&setec=8d4d4b80ac75b68b55c6cb7f177dd3e3"
    }
  ]
}