{
  "modId": 19821.0,
  "modName": "Doggy Doors - Thieves Guild Fix for Heimskr and Severio homes",
  "summary": "This mod adds extra doors to the homes of Severio Pelagia and Heimskr in Whiterun. Even after the Battle of Whiterun, when these homes become inaccessible, the Thieves Guild special jobs may still send you into them. Now you may enter.",
  "descriptionHtml": "Doggy Doors v1.0\r\n\r\n--------------------------------\r\n--------------------------------\r\n\r\nGeneral Information\r\n\r\nAfter the battle of Whiterun, Heimskr\\'s House and Severio Pelagia\\'s house have both been heavily damaged and can no longer be entered into. Severio is actually killed. This is all well and good, but the Thieves Guild may still send you on extra jobs that take place inside those buildings. As opposed to messing with quest scripts for the Guild, or potentially breaking something in the Battle of Whiterun, I opted for a much simpler solution: I simply added an extra point of entry into each building in the way of doggy doors. The doors are on the back of the homes.\r\n\r\nWhen you enter, the interiors will not appear as if they have suffered any damage from the attack. This is not laziness on my part, but simply an unwillingness to screw around with objects that would be tied to flags in a very complicated series of quests. I made this purely so you can at least get inside, finish your mission, and leave.\r\n\r\nThese doggy doors are locked at Master Level. Why and how would a dog lock his door? He wouldn\\'t, but neither Heimskr or Severio own dogs, so I\\'m going on the assumption that these were installed by previous owners of the buildings and that these two fine gentlemen simply wanted to secure their homes.\r\n\r\n--------------------------------\r\n--------------------------------\r\n\r\nConflicts\r\n\r\nUnlikely, but let me know if something wierd happens.\r\n\r\n--------------------------------\r\n--------------------------------\r\n\r\nVersion History\r\n\r\n1.0: I done made it.\r\n\t\t\r\n--------------------------------\r\n--------------------------------\r\n\r\nBugs and Feedback\r\n\r\nThere shouldn\\'t be any issues. I made sure that each one functioned and did not interfere with any other existing vanilla objects. I moved a couple minor things around, but that shouldn\\'t be a big deal.\r\n\r\n--------------------------------\r\n--------------------------------\r\n\r\nDistribution\r\n\r\nPlease do not redistribute this file in any way, shape, or form. Please do not alter and re-release this file in any way, shape or form. If you feel a change should be made to this mod, please suggest it to me. Thank you.\r\n\r\n--------------------------------\r\n--------------------------------\r\n\r\nInstallation\r\n\r\nCopy DoggyDoors.esp file into your Skyrim\\\\Data folder. Make sure to activate the mod by going to \\\"Data Files\\\" in your launcher and checking the box next to \\\"DoggyDoors.esp\\\". If you use a mod manager, you likely know what to do already. Have fun :)",
  "categoryId": "95",
  "version": "1.0",
  "author": "Adrius",
  "createdUnix": "1341305073",
  "updatedUnix": "1341305112",
  "containsAdultContent": false,
  "uploadedBy": "Adrius",
  "primaryFile": null,
  "files": [
    {
      "fileId": "71878",
      "name": "DoggyDoors1dot0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "DoggyDoors1dot1-19821-1-0.rar",
      "uploadedUnix": "1341305112",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3e65eadf3dc5f1e265fd0ec683a9bb725c01e7fe2d039c4b2114de4b31ffa8b3/analysis/1406998445/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DoggyDoors1dot1-19821-1-0.rar?fid=71878&ttl=1535787527&ri=8192&rs=8192&setec=fdf1f0e4b485c13f8542a207c70bdd1b"
    }
  ]
}