{
  "modId": 19867.0,
  "modName": "Ridin Dirty",
  "summary": "Adds the Riding perk tree to the game to improve mounted combat.",
  "descriptionHtml": "[font=verdana][center][img]http://img.photobucket.com/albums/v464/sushisquid/RidinDirty.png[/img][/center]\r\n\r\n[size=3]Mounted combat is new, cool, and not very useful. One of those doesn\\'t belong, so to improve fighting from horseback, I\\'ve created a new perk tree.[/size]\r\n\r\nAlso available on the [url=http://steamcommunity.com/sharedfiles/filedetails/?id=80052766]Steam Workshop[/url]\r\n\r\n[color=orange]Because it is currently impossible to create a new perk tree, these perks can be found in the Light Armor section of your menu, but none of them have any skill requirement. I plan to update this if making perk trees ever becomes possible.[/color]\r\n[color=white][b]This mod is [i]highly[/i] compatible.[/b][/color] The only game file changed was Light Armor\\'s perk tree - everything else is new. Have another mod that modifies horses? No problem. Have a mod that adds new mounts, even if they aren\\'t horses? These perks will work fine. You can even use mods that change Light Armor\\'s perks as long as the tree structure isn\\'t changed.\r\n\r\nI highly recommend also using [url=http://skyrim.nexusmods.com/mods/14950]Convenient Horses[/url].\r\n[size=1]I recommend leaving off horse invulnerability and turning off Horse Charge, but they don\\'t actually conflict. They just make my Cataphract and Trample perks less useful.[/size]\r\n\r\n\r\n[size=3][color=][b]Perks:[/b][/color][/size]\r\nAll perks in the tree are intentionally fairly powerful. Mounted combat is very weak right now and even then it\\'s not useful very commonly. In my own playtesting, I have not found these to be unbalanced comparatively to their cost.\r\n\r\n\r\n[b]Horseman[/b] [i](3 ranks)[/i] - Mounted attacks cause 30/60/90% more damage.\r\n[list][size=1][*]The biggest problem with mounted combat is that you get far fewer attacks in. Because of the mobility issues of the horse and the dramatically lower attack speed, mounted combat just takes too long to be worth using. You\\'re still better just getting off the horse to fight. Horseman will help your slower attacks count for much more.[/size][/list]\r\n\r\n[b]Knight[/b] [i](requires Horseman)[/i] - 20% chance of blocking all damage from any attack while mounted.\r\n[list][size=1][*]You cannot block while riding. This perk helps to make up for that. It works against any attack that comes at you - melee, arrows, magic - all have a 1/5 chance to cause no damage.[/size][/list]\r\n\r\n[b]Cataphract[/b] [i](requires Knight)[/i] - Your steed becomes highly resistant to damage.\r\n[list][size=1][*]This is an optional perk (nothing else requires it) because many players already use mods that make their horses invincible. If you do not, then grabbing this will provide 1000 armor and 80% magic resistance. Armor caps at 80% resistance, so 1000 was chosen simply to ensure you get that amount even if using other mods that reduce armor effectiveness. This will help to make your horse much less likely to die in combat. It still costs a perk, doesn\\'t make your horse invincible, and is only active while riding (you\\'ll see a visual effect), so it\\'s not unfair.[/size][/list]\r\n\r\n[b]Paladin[/b] [i](requires Knight)[/i] - Sheathe your weapon to cast Healing on you and your steed.\r\n[list][size=1][*]The inability to use magic on horseback means no healing spells, which hurts a lot. Now you can still cast a unique version of Healing. To activate, sheathe your weapon while under 100% health (bonus health from enchantments will not count toward this). You will expend 30 magicka per second to restore 15 health per second, and your horse will also be healed for the same amount. Regeneration and Respite will improve this for you alone (not the horse) and Novice Restoration will halve the cost. You will never see your magicka bar while mounted and the stamina bar disappears when you put your weapon away, but these effects all are working correctly and you cannot keep casting this if your magicka runs out. Using Paladin to heal does provide Restoration experience.[/size][/list]\r\n\r\n[b]Jockey[/b] [i](requires Horseman)[/i] - Your mount moves 30% faster and has doubled stamina regeneration.\r\n[list][size=1][*]The most requested feature when I was building this mod was something to improve speed. Jockey provides a large speed boost, but also lets your horse sprint much more.[/size][/list]\r\n\r\n[b]Cavalier[/b] [i](requires Jockey)[/i] - Mounted power attacks cause 50% more damage.\r\n[list][size=1][*]The only power attack perks that work on horseback are Fighting Stance and Champion\\'s Stance. There needed to be something to help mounted power attacks.[/size][/list]\r\n\r\n[b]Horse Archer[/b] [i](requires Jockey)[/i] - Arrows fired from horseback ignore armor.\r\n[list][size=1][*]Bows cannot power attack, so they need something for mounted fighting. The ability to ignore armor isn\\'t very useful against most enemies, but can help you do much better against tougher targets.[/size][/list]\r\n\r\n[b]Raider[/b] [i](requires Cavalier or Horse Archer, 2 ranks)[/i] - Mounted attacks are 35/60% faster.\r\n[list][size=1][*]More damage is nice, but so is just plain attacking faster. Taking both perks will let you attack about as fast as I felt was sensible for the animation.[/size][/list]\r\n\r\n[b]Trample[/b] [i](requires Paladin or Raider)[/i] - Your steed\\'s sprinting can knock down and damage most targets.\r\n[list][size=1][*]This lets you knock things down by charging into them. It\\'s very similar to Shield Charge, but for horses. This was the most complex perk I added and potentially one of the most useful too, so it\\'s at the end of the tree. When you\\'re mounted and have your weapon drawn, your charging will knock things down and cause 20 damage. Larger enemies cannot be trampled. This will work on non-hostiles and is an attack, so if you\\'re charging near allies, put your weapon away to deactivate Trample.[/size][/list]\r\n\r\n\r\nThere are also three more perks that were built for this mod and are fully functional, but which I felt didn\\'t belong (this perk tree is already large enough). You can unlock them with the console if you still want them, but I don\\'t plan to stick them back into the tree.\r\n[list][*]Chivalry (XX002883) - Allies are rallied and gain 50 health and stamina when you ride near them (lasts 15 seconds after you leave).\r\n[*]General (XX000D69) - Gain 100 health and stamina while mounted.\r\n[*]Blackguard (XX0038B7) - Weak enemies (60 health or under) are immediately killed when you ride near them.[/list]\r\n[/font]",
  "categoryId": "24",
  "version": "1.02.1",
  "author": "Kevin Kidder",
  "createdUnix": "1341372865",
  "updatedUnix": "1343013301",
  "containsAdultContent": false,
  "uploadedBy": "sushisquid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "72011",
      "name": "RidingDirty100",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "RidingDirty100-19867-1-0.zip",
      "uploadedUnix": "1341372894",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d6e89582bb0e009b787b3abe26e2b74cff0d0dea635ea11d10dafcb1797c1f93/analysis/1406999705/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RidingDirty100-19867-1-0.zip?fid=72011&ttl=1535787606&ri=8192&rs=8192&setec=e59b3c8406ee3b12ae64077d7c24adab"
    },
    {
      "fileId": "72878",
      "name": "RidingDirty101",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "RidingDirty101-19867-1-01.zip",
      "uploadedUnix": "1341712806",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/7ff60d2ef553b6536cb0f76c54c38002b1a547370fabfa4aca131ada25af86a0/analysis/1407008896/",
      "changelogHtml": " Cataphract was improved. Instead of about 50% resistance, it now provides your horse 80% resistance to all damage. <br/> \n The effective range of Trample was very slightly increased (11 feet to 12.5 feet). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RidingDirty101-19867-1-01.zip?fid=72878&ttl=1535787606&ri=8192&rs=8192&setec=f5db9493c431f5f5c80f987a894f2264"
    },
    {
      "fileId": "76089",
      "name": "RidingDirty1021",
      "version": "1.02.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "RidingDirty1021-19867-1-02-1.zip",
      "uploadedUnix": "1343013301",
      "modVersion": "1.02.1",
      "virusScanUrl": "https://www.virustotal.com/file/688ed573458f391d043d30b3991961799f7e79d97e8dbf0afc59a5790ba83b38/analysis/1407040382/",
      "changelogHtml": " Trample range extended back again to 9.5 feet. <br/> \n Trample only works while your weapon is out, so it\\'s safer to dash near allies now. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RidingDirty1021-19867-1-02-1.zip?fid=76089&ttl=1535787607&ri=8192&rs=8192&setec=6a9c6550e8d45af157dfd6c2478cdf26"
    }
  ]
}