{
  "modId": 19860.0,
  "modName": "The Hunt - WIP",
  "summary": "The Hunt is on in the forests of Skyrim. When it comes to the Wilderness, it doesn\\'t matter if you are the Dragonborn or not. The wilderness is a beast all itself. And you know what beasts do... kill.",
  "descriptionHtml": "-----------------------------------------------------\r\n\\\"Once more into the fray. \r\nInto the last good fight I\\'ll ever know.\r\nLive and die on this day...\r\nLive and die on this day...\\\" ~Ottaway\r\n-----------------------------------------------------\r\n\r\n==============\r\nThe Rundown:\r\n==============\r\nBeing the Dragonborn, a great and mighty adventurer, you take every task that comes your way. Whether it be killing things or finding lost items for Jarls, but even Dragon Slaying cannot prepare you for your next challenge. The Wilderness of Skyrim. The Wilds of Skyrim adapt to all situatuations, and is always relentless. \r\n\r\nA man by the name of Verne is found resting in the Riverwood Inn, claiming to have returned from a dangerous hunting trip in the snowy forests. He says he will pay you a sum of 18,000 Septims and his prized dagger for taking care of the \\\"problem\\\" that took the life of 7 of his hunting party. He only describes it as a \\\"black cloud of death and fury\\\", and you decide to take the job. What lays ahead of you? Only you can find out...\r\n\r\n=======================\r\nCurrent Version Notes\r\n=======================\r\nv1 Beta - The purpose of this beta .esp is to test the first version of how the wolves are going. I need some feedback on whether I need to scale them up or down, add certain things, etc. Every wolf in Skyrim has a few changes to it:\r\n\r\n- ((( This Beta phase scales the wolves up to around level 30. Make sure you\\'re good and strong before you face them! )))\r\n- A new retexture (incredibly dark and vicious!)\r\n- Scaled up to be a bit larger than normal wolves\r\n- Damage has been raised\r\n- More vicious and frenzied. Will more than likely attack on sight\r\n- Every name is changed to \\\"Dark One\\\"\r\n- ((( This Beta phase scales the wolves up to around level 30. Make sure you\\'re good and strong before you face them! )))\r\n\r\nThis mod is only a beta phase for the wolves ONLY, this is nowhere near the complete mod. As stated before, feedback would be amazing. This mod will also edit EVERY wolf in Skyrim\\'s provinces. To revert your wolves back to normal, just uninstall.\r\n\r\n(To quickly spawn the wolves, use the console command \\\"player.placeatme FF0009D4 x\\\", with x replacing however many you feel like taking on)\r\n=======================\r\nPlanned Features\r\n=======================\r\n- Custom Portion of Skyrim\\'s snowy woods for the Dragonborn to survive in\r\n- Limited Armor and Vision (This mod will work wonders with any darker nights mod).\r\n- A new breed of wolves to occupy that area. These are bigger, faster, more gruesome. You need more than fancy shouts and magic weapons to kill them.\r\n- A few new NPC\\'s (Including a Skyrim version of Ottaway)\r\n- A Fully-Voiced Questline\r\n- Alpha and Omega wolves for the pack (along with a den)\r\n- more!\r\n\r\n======================\r\nWhen is it going to be released?\r\n======================\r\nThis is just a planned project, so I have no possible idea where the final version is going to land, but the first version should be out sometime by the end of the month. This mod will be a great questline, I assure you, for both fans of the movie and those who just want Skyrim!\r\n\r\n======================\r\nSuggested Mods for the Release\r\n======================\r\n- Portable Campsite: http://skyrim.nexusmods.com/mods/9935\r\n   - This mod will help the \\\"survival\\\" aspects. Camp Fires and Bedrolls mainly.\r\n- Wearable Lanterns: http://skyrim.nexusmods.com/mods/17416\r\n   - With mobile light, the dark nights may not be (as) scary.\r\n- A Hunters Life - Hunting Overhaul: http://skyrim.nexusmods.com/mods/11744\r\n   - Really geared towards more of just a hunting aspect, but still useful.\r\n- Mike Foxs Darker Nights: http://skyrim.nexusmods.com/mods/11356\r\n   - This is a really awesome Dark Night mod. One of the best.",
  "categoryId": "24",
  "version": "v1.Beta",
  "author": "Volcainic",
  "createdUnix": "1341365354",
  "updatedUnix": "1341455403",
  "containsAdultContent": false,
  "uploadedBy": "Volcainic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "72252",
      "name": "The Hunt - v1 Beta",
      "version": "v1.Beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1587",
      "fileName": "The Hunt - v1 Beta-19860-v1-Beta.rar",
      "uploadedUnix": "1341455403",
      "modVersion": "v1.Beta",
      "virusScanUrl": "https://www.virustotal.com/file/5402c06f932088598e3c72811ba97d47ddb9404100efe7dafe96a3656a8dfac7/analysis/1407002049/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Hunt%20-%20v1%20Beta-19860-v1-Beta.rar?fid=72252&ttl=1535787580&ri=8192&rs=8192&setec=86a9218d09d0c8a00fd81a1f9763dd1e"
    }
  ]
}