{
  "modId": 19884.0,
  "modName": "Pendragons Compiled CTD Solution for Skyrim  1-6-89-0",
  "summary": "This guide is dedicated to those who still can\\'t afford to get a higher spec of computers for your leisure. Less stress on finding solutions and more enjoying bashing heads on dragons!",
  "descriptionHtml": "[img]http://s5.postimage.org/5jhcckwvr/banner2.jpg[/img]\r\n\r\nMaybe some of you already know one of the mentioned methods or maybe it is already mentioned to other forums or even here, but for those who didn\\'t knew it especially if you\\'re an old timer with Skyrim who have updated his/her game to the latest version (1.6.89.0) but still experiencing crash-to-desktop in any situations (high preset settings, edited skyrimpref.ini/skyrim.ini, graphic enhancement mods, etc.) This maybe the solution for you.\r\n\r\nBefore I begin explaining the details on how it should be done, always remember to make backups on your recent save games especially during the time whereas you barely experienced the CTD. This is always helpful especially when you are adding graphic-enhancement manipulation mods like IMAGINATOR, DYNAVISION, Realistic Lighting with Customization, More Dynamic Shadow with Stripping Fix, Varieties of ENB mods (Unreal Cinema), etc.\r\n\r\nDoing this and it will always save you time rather than reinstalling which will always be your last option.\r\n\r\nI writing this because I\\'ve been experiencing frequent crash-to-desktop situations lately like simply visiting the outskirts of Windhelm, viewing the Goldenglow Estate from the distance (Loud and Clear quest), fast travelling to Solitude, exiting the UPS Portable Tent, drawing the sword when I hear wolves or bears nearby, etc. Its a pain-to-the-butt that I\\'ve been experiencing this things which gets me stressed up rather than leisure on playing the game.\r\n\r\nTo tell you the truth, I\\'ve been working around that simple method regarding that 32GB Large Memory Access CTD/Missing Textures FIXER on the latest version whereas it seems no longer working cause whatever value I type on the following added value options they still crash randomly. This are the ones I\\'m trying to mention.\r\n\r\nuGridsToLoad/uInterior Cell Buffer/uExterior Cell Buffer/fMasterFilePreLoadMB/iPreloadSizeLimit\r\n\r\nEditing this to best values available never fixed my problem, until I experimented one thing...\r\n\r\nBy the way... believe or not this is the specs of the computer on which I\\'ve been playing Skyrim for the passed few years now. Since my powerful computer is only dedicated as my Racing Machine for project CARS, iRacing, SimRaceWay, GTR2, etc. A very old computer of mine dedicated to other games...\r\n\r\n======================================================================================\r\nCPU: Pentium D 820 2.80GHz (Non-OC)\r\nMemory: 3GB DDR2 533Hz *Kingston*\r\nHDD: 720GB Western Digital Caviar Black (Non-Partitioned)\r\nGraphics Card: MSI nVidia Geforce GT 430 3GB DDR3 OC Edition\r\nPSU: FSP HEXA 500w 80Plus\r\nOS: Windows XP Professional Service Pack 3 32bit (Fully updated)\r\nDirectX: 9.0c (July 2010)\r\nDriver: 301.42 WinXP 32Bit Forceware WHQL driver\r\n======================================================================================\r\n\r\nMy Current Skyrim Settings and now 95% stable: Running at 30FPS+/-\r\nTextures: High\r\nRadial Blur: Medium\r\nShadow: Ultra\r\nDecal: Medium\r\nFXAA: On\r\nReflections: Sky, Trees, Land, Objects\r\nAA: Off\r\nAT: 4x\r\nResolution: 1280x960 (The same as my Desktop)\r\n\r\nI haven\\'t experienced the CTD during my 48HRS of gameplay eversince doing this. So that 5% chance of the CTD has yet to come!\r\n\r\nNOTE#1: Like all has to say it, I cannot always guaranttee that it will be crash-free since the game will always contain bugs as they are still-to-be fixed by the developers. But if I can play it in a stable state, so can you. Just cross your fingers that it will work.\r\n\r\nNOTE#2: This will fully reset your INI configuration, but if you\\'re okay with that then give it a shot.\r\n\r\n======================================================================================\r\nOPTIONAL METHOD: CLEAN UP YOUR HARDWARE FROM DUSTS...\r\n======================================================================================\r\n\r\nIf you only want to, if you don\\'t want to... then you\\'re free to say no. ^ ^\r\n\r\nALWAYS ASK FOR ASSISTANCE ESPECIALLY TO COMPUTER EXPERTS AROUND THE NEIGHBORHOOD IF EVER YOU DECIDE TO DO IT.\r\n\r\n======================================================================================\r\nBEFORE WE START: PLEASE READ EVERYTHING FIRST BEFORE PERFORMING ANY OF THE MENTIONED METHODS...\r\n======================================================================================\r\nRemove all graphic enhancing mods (either bsa or loose files) on your Data Folder. You can leave other mods as they are (CLOTHES, ARMOR, WEAPONS, SHIELDS, HAIRS, BODY MODS, FACE, EYES, SKINS, ANIMATIONS, SYSTEM MANIPULATIONS FILES like the Ultimate Followers Overhaul, FIXERS such as GreenWater Fix, etc.)\r\n\r\nThis way the game will be fully refreshed. So when you began testing the game again for stability there\\'s 95% assurance the method will work.\r\n\r\n======================================================================================\r\nOptimize the DDS textures either the loose files or inside the BSA (OPTIONAL)\r\n======================================================================================\r\n\r\nUse this wonderful tool especially if only if you have a low/mid spec computer. Trully helps a lot.\r\n\r\n[b]Optimzer Textures by Adpipino[/b]\r\nhttp://skyrim.nexusmods.com/mods/12801\r\n\r\nCause there are some textures out there on your mods uses resolution way beyond 2048x2048. Or DXT formats that are needed to be optimized for Skyrim Engine preferences.\r\n\r\n======================================================================================\r\nFIRST RESET THE UGRIDSTOLOAD IN-GAME: Thanks to the nVidia Team regarding this method!\r\n======================================================================================\r\n\r\nNOTE: Make sure both Skyrimpref.ini and Skyrim.ini are not set as \\\\\\\"READ-ONLY\\\\\\\"\r\n\r\n1. Start Skyrim as usually do\r\n2. Load your most recent saved game where it is stable\r\n3. Open your Console\r\n4. type [i]setini \\\"ugridstoload:general\\\" 5[/i]\r\n5. Hit Enter (Return Key)\r\n6. type [i]saveini[/i]\r\n7. Hit Enter (Return Key)\r\n8. type [i]refreshini[/i]\r\n9. Hit Enter (Return Key)\r\n10. Save a New Save (Do not overwrite any of your previous saves).\r\n11. Exit Skyrim\r\n\r\n======================================================================================\r\nSECOND COMPLETELY DELETING THE INI FILES\r\n======================================================================================\r\n\r\nNOTE: Make sure you follow this completely and properly.\r\n\r\n1. Go to your:\r\nFor Windows XP - ...|Documents and Settings|[ACCOUNT]|My Documents|My Games|Skyrim\r\nFor Vista/ 7 - ...|Users|[Username]|My Documents|My Games|Skyrim\r\n\r\n2. Delete your Skyrim.ini and Skyrimpref.ini\r\n\r\n3. Launch the Skyrim Game Launcher\r\n\r\n4. You will be prompt that a new graphic cards has been detected. It will now generate a new Skyrim.ini as well as Skyrimpref.ini files on your Skyrim config folder which is based on the 1.6.89.0 update\r\n\r\nNOTE: If you have been around these two files for a long time (editing it to your desired custom settings) you will see the huge difference between the old files from the newly generated skyrim.ini/skyrimpref.ini files\r\n\r\n5. Launch Skyrim normaly (Either with SKSE or the Window Borderless or the original TESV.exe versions will work)\r\n\r\n6. Load your newly save game earlier.\r\n\r\n7. Play the game for awhile and go to places you usually get the CTD.\r\n\r\n8. Now slowly add graphic enhancing mods one at a time (add it, play, then go to places where you usually experience the CTD)\r\n\r\n======================================================================================\r\nOPTIONAL: This command seem to work for me greatly since my rig only has 3GB.\r\n======================================================================================\r\n\r\n1. When You see that game is finished loading your save and your in the game already, hit the console key.\r\n2. Type [i]pcb[/i] and then hit ENTER.\r\n\r\n[b]PCB - Purge Cell Buffer:[/b] This empties the cell cache which will free some memory. To make it more stable in some way.\r\n\r\nI always type this command whenever I\\'m going to load a save data either when starting the game or loading the game. Which really helps me a lot.\r\n\r\n======================================================================================\r\nUPDATE: MORE METHODS FOR YOU!\r\n======================================================================================\r\n\r\nThere\\'s another trick in hand that I forgot to mention, a traditional fix to avoid CTD during roaming around the open world and to avoid major lags which often leads to CTD, is this.\r\n\r\n======================================================================================\r\nA RECOMMENDED METHOD: Give your system more virtual memory \r\n======================================================================================\r\nAround 2000MB isn\\'t really enough for the game, so for the minimum I put it around 5000MB as for the maximum I put it around 10000MB - which it not just speed up the game, but also when your just on your desktop.\r\n\r\nHere\\'s a little screenshot regarding that virtual memory set.\r\nhttp://s5.postimage.org/kguerbzhz/virtualmemorysetformyxp.jpg\r\n\r\nAs for Windows Vista and Windows 7, remember to uncheck the automatically allocate the virtual memory assessment. Always manually configure it yourself.\r\n\r\nNOTE: Always use a hard disk with lots of free space on it for the virtual memory, the method is useless if the HDD is almost out of free space.\r\n\r\n======================================================================================\r\nGET YOUR SUPER CAR THE RIGHT DRIVER: Upgrading or Downgrading drivers are always helpful!\r\n======================================================================================\r\n\r\nAnother traditional one is upgrading or downgrading your drivers. Some updated drivers will be helpful for you, but some updated drivers will not be helpful. Keep that in mind, it is one of the basic rules for gamers. Be sure to see which is more better for you, always compare them. You\\'ll never know unless you test the new driver on your own rig.\r\n\r\n======================================================================================\r\n\r\nSpecial thanks to all modders who have been endlessly enhancing the game not just by visual means but also in more on the manipulation on of the system. Truly rewarding! And for those who I haven\\'t endorsed yet, I will whenever I\\'m satisfied with your enhancements cause I\\'m still on the process on checking them out thoroughly. \r\n\r\nSpecial thanks to those who always try to find the solutions for the CTD for the passed years Skyrim was ever launched. Can\\'t enjoy the game without you guys!\r\n\r\nLast but not the least, special thanks to the nexus team for hosting this great mods. Without you they could have been scattered around the big world of the internet which makes would made them hard to get.\r\n\r\nThis guide is dedicated to those who still can\\'t afford to get a higher spec of computers for your leisure. Less stress on finding solutions and more enjoying bashing heads on dragons!\r\n\r\n======================================================================================\r\n\r\nI\\'ll upload this guide as a txt so you can read it anytime you want.",
  "categoryId": "28",
  "version": "1.02",
  "author": "arthuria8pendragon",
  "createdUnix": "1341405188",
  "updatedUnix": "1341505266",
  "containsAdultContent": false,
  "uploadedBy": "arthuria8pendragon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "72087",
      "name": "Pendragons CTD Compiled Solution Guide in TXT",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9",
      "fileName": "Pendragons CTD Compiled Solution Guide in TXT-19884-1-0.zip",
      "uploadedUnix": "1341405305",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f78df33c8eab7be0d451615105bc330090238835278b1ce3f7c56433c99bb61f/analysis/1407000392/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pendragons%20CTD%20Compiled%20Solution%20Guide%20in%20TXT-19884-1-0.zip?fid=72087&ttl=1535787632&ri=8192&rs=8192&setec=b9b28f6f7898da96f0ae16fe546a6b3c"
    },
    {
      "fileId": "72095",
      "name": "Pendragons CTD Compiled Solution Guide in TXT CORRECTIONS ADDED",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9",
      "fileName": "Pendragons CTD Compiled Solution Guide in TXT CORRECTIONS ADDED-19884-1-01.zip",
      "uploadedUnix": "1341406686",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/403a632f51977ee2eae6470c022b56bfb43279ef4531c2394b3a9c9a7cb04aef/analysis/1407000392/",
      "changelogHtml": " Added a few words to avoid misunderstanding throughout the guide <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pendragons%20CTD%20Compiled%20Solution%20Guide%20in%20TXT%20CORRECTIONS%20ADDED-19884-1-01.zip?fid=72095&ttl=1535787633&ri=8192&rs=8192&setec=c406aca05b4744dc4d4888b3229a3493"
    },
    {
      "fileId": "72370",
      "name": "Pendragons CTD Compiled Solution Guide in TXT MORE METHODS ADDED UPDATE1",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Pendragons CTD Compiled Solution Guide in TXT MORE METHODS ADDED UPDATE1-19884-1-02.7z",
      "uploadedUnix": "1341505266",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/2a10f56809af531d84f26439d6127dba99dd9da64b86084ed3ab98498682191a/analysis/1407003124/",
      "changelogHtml": " Added two more useful methods to prevent CTD at 95% success. <br/> \n First method is regarding the virtual memory management <br/> \n Second method is about upgrading or downgrading your drivers. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pendragons%20CTD%20Compiled%20Solution%20Guide%20in%20TXT%20MORE%20METHODS%20ADDED%20UPDATE1-19884-1-02.7z?fid=72370&ttl=1535787633&ri=8192&rs=8192&setec=dd1fb175a8cbae72ae4cb00518d70425"
    }
  ]
}