{
  "modId": 19912.0,
  "modName": "Wearable Lanterns Firefly Torchbug pet file replacer",
  "summary": "Release your Torchbug from its jar with this file re-placer for Wearable Lanterns.",
  "descriptionHtml": "*UPDATE*\r\n\r\nYou can now find a standalone version of torchbug pets. Find a full description HERE:\r\n\r\nhttp://skyrim.nexusmods.com/mods/20367\r\n\r\nThe standalone version now includes support for glowing versions. THAT DOES NOT MEAN YOU SHOULD STILL NOT DOWNLOAD THIS RE-PLACER! Go to my standalone link above and read the descriptions to find out why!\r\n\r\n*SHORT DESCRIPTION*\r\n\r\nA simple file re-placer that will release your torchbug from its jar. The bug will fly around your shoulder and head, with only minor clipping issues. The bug will still act as a light source.\r\n\r\n*REQUIREMENTS*\r\n\r\nWEARABLE LANTERNS is REQUIRED to use this re-placer. You may find it here : http://skyrim.nexusmods.com/mods/17416\r\n\r\nYou either MUST be using the UNPACKED version, or be able to unpack, re-place, and repack the file yourself.\r\n\r\n\r\n*INSTALLATION*\r\n\r\nDownload the desired file(s) and place them in your Skyrim/Data/meshes/chesko folder. Say yes when asked to overwrite ( PLEASE remember to make backups of the working files first! Although I am 90% sure this should have no problems for anyone, it is ALWAYS safe to make backups of working files before replacing them. Just add the letter a to any file and it will sit right there waiting for you to change it back. I.E name _WL_WearableTorchbugMesh to _WL_WearableTorchbugMesh_a BEFORE adding my file is a good idea ).\r\n\r\n*COMPATIBILITY*\r\n\r\nYou should have no problems at all if you can run Wearable Lanterns. If you do please let me know, though I foresee no issues.\r\n\r\n*LONG DESCRIPTION*\r\n\r\nLast week I downloaded Wearable Lanterns, forged my lantern, then bought my bugjar and headed out in search of a firefly. Yes even as a moder myself when I download others work I tend to do it the legit way, and stay away from console if I can help it. Anyway after a bit of searching I found my Firefly outside of the Riften docks and caught him in the jar. For 2 days a ran around loving the light ( my ENB makes some things VERY dark, the light was perfect ). However I kept running into the dilemma of where to put the jar. The front was nice but every time I went into sneak it would clip into my leg, and on my current character, I sneak a lot and it looked a little weird ( this might have been caused by me using a custom sneak animation, and not by chesko ). The back, well looked great, but it covered some of my characters rear end, and let\\\\\\'s just say I like looking at that :)\r\n\r\nSo I thought to myself \\\\\\\"Self, what if you could get rid of the jar and have a firefly at your waist?\\\\\\\" .So I did that, just removing the jar. However this left the bug static and just hanging out at my belt. After a little more tinkering I got him to move around and have a pretty neat \\\\\\\" flight path \\\\\\\".\r\n\r\nI mentioned a thank you to Chesko for making this possible, as I think it is pretty neat, and a few people have shown interest in it, and Chesko gave his go ahead to release it ( HE however will NOT be providing support for it, perfectly understandable ), so I\\\\\\'m throwing it up here. \r\n\r\nNow I want everyone to know, I COULD build this from scratch, I can even make it a stand alone item \\\" Torchbug Pet\\\" or something, and not have to give anyone credit ( Torchbug is a standard .nif from skyrim ). But the whole idea only came to me because of someone who already did the WORK, all I did was mess around with THEIR idea. This mod only exists because another mod is already there, and I will be including 4 options to re-place as you see fit.  All this mod will do is make say your front torchbug fly, your rear torchbug fly, or both. It will NOT add anything you don\\\\\\'t already have. The opposite actually :P I had to REMOVE some of Chesko\\\\\\'s hard work. I also thought about modding chesko\\'s script to call up a new option when you drop his lantern for postion, and he even gave me the O.K to do it, but you know what, I don\\'t like taking credit for something i MOSTLY didn\\'t do, so I\\'m not going to do it.\r\n\r\nI hope you enjoy this mod.\r\n\r\nPeace,\r\nShay\r\n\r\n*CREDITS*\r\n\r\nIt has been pointed out to me that the credits section of the uploads is not something everyone checks ( I do however ), so I am adding this section like I just did for my stand alone to the main page.\r\n\r\nI would like to thank Chesko, if I hadn\\'t been interested in how his mod worked and all his hard work, I would not have made this simple file replacer.\r\n\r\n83Willow. It was her connection WITH Chesko and the textures / script to catch a RED firefly that inspired me to make my released mods. You will notice my stand alone torchbug RED uses a crappy hexadecimal color to achieve red color, while the mod that wearable lanterns AND 83willows 101bugs can add a nice soft red glow. I will not be using these textures....\r\n\r\nYET :)\r\n\r\n*EDIT* Added Video Per Request. Sorry for the quality, see my youtube comment as to why.\r\n\r\n*EDIT* Some files and description mentions have been deleted. The reasons why will not be disclosed.\r\n\r\n*EDIT* added a credits section, since I see now I was a douche for not doing it in the first place :/ \r\n\r\n*EDIT* added comment on my changed v.2 of my standalone torchbug pets. They now will glow / act as a light source. THIS DOES NOT MEAN YOU DO NOT NEED / WANT THIS MOD. See my standalone mod description page as to why you still want this one :) ",
  "categoryId": "27",
  "version": "0.1",
  "author": "Shaydow",
  "createdUnix": "1341431192",
  "updatedUnix": "1341431522",
  "containsAdultContent": false,
  "uploadedBy": "Shaydow",
  "primaryFile": null,
  "files": [
    {
      "fileId": "72188",
      "name": "Standard Front replace",
      "version": "0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "14",
      "fileName": "Standard Front replace-19912-0-1.rar",
      "uploadedUnix": "1341431480",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/093db5b3d31759066ee1e8d9df823e044b3ba276f82198f468509101d057fb5f/analysis/1407001290/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Standard%20Front%20replace-19912-0-1.rar?fid=72188&ttl=1535787684&ri=8192&rs=8192&setec=ab83a7094ada24d2ebb9c5137edcb1d4"
    },
    {
      "fileId": "72189",
      "name": "Standard Rear replace",
      "version": "0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "14",
      "fileName": "Standard Rear replace-19912-0-1.rar",
      "uploadedUnix": "1341431522",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/953f183522e5adfa6e350d1c6926315ef6328cb5195e0e0bdb1f8a3139f53331/analysis/1407001327/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Standard%20Rear%20replace-19912-0-1.rar?fid=72189&ttl=1535787685&ri=8192&rs=8192&setec=cbe794e9cca379544762ec4c6562a823"
    }
  ]
}