{
  "modId": 19936.0,
  "modName": "More Saddles",
  "summary": "Bard, Hunter, Big Game, Traveler and, Knight Saddles for all explorers and adventurers. Get off your feet, take up the reins and aim for the horizon. Nothing can stop you, when you and your trusty stead are ready for it all. More Saddles, brings you four more saddles to further customize your horse for the journeys ahead.",
  "descriptionHtml": "This is my First Mod, comment please but don&#39;t be to mean. IF you like Endorse and if possible vote for me :D\r<br />\r<br />Textures on Some of the Saddles By:  Sedryn Author of Ornate Saddles.\r<br />\r<br />[b][color=#FF8C00]================================Saddle Compilation=====================================[/color][/b]\r<br />\r<br />[color=#A0522D]Bard Saddle: Equipped to the Horses sold at Solitudes Stables.\r<br />\r<br />Traveler Saddle: Equipped to the Horses sold at Markarth Stables\r<br />\r<br />Hunter Saddle: Equipped to the Horses sold at Windhelm Stables.\r<br />\r<br />Big Game Hunter Saddle: Equipped to the Horses sold at Whiterun Stables.\r<br />\r<br />Knight Saddle: Equipped to the Horses sold at the Riften Stables.\r<br />\r<br />Dawnguard Saddle: Equipped with some vampire hunting gear and armored for combat against the undead.[/color]\r<br />\r<br />\r<br />[b][color=#808080]============================Saddle Descriptions========================================[/color][/b]\r<br />\r<br />         [color=#C0C0C0]Bard Saddle: A good well rounded saddle for Bard/Minstril/Ambassador/Cleric on long travels over both wilderness and roads. Brings along all the supplies needed for a long trip. Sturdy and well stocked with what any traveler could need for a nice trip along the country side.\r<br />\r<br />         Traveler Saddle: The every mans travel pack, Bed Roll, Food Sack, Tankard and Mead. What more do you need you might ask? Nothing. Easy to back up and move to any horse. You might not be ready for everything but at least you will get there on time. \r<br />\r<br />         Hunter Saddle: A Hunters/Trappers/Trackers/Rangers best friend(Along with his horse). Stocked with extra arrows and some supplies. Light weight and reliable. Good for those sort one, two day hunting trips to the week long slog through the dense woodlands/prairies/marshes in search of even larger game.\r<br />\r<br />          Big Game Hunter Saddle: A Poachers/Hunters/Bounty Hunters/ Trackers Best show case, Stocked with trophies of victories against a large array of monsters, from trolls, to dragons, to dragon priests to mammoths. Stocked with a barrel of Mead and a large tankard for your drinking pleasure. \r<br />\r<br />         Knight Saddle: A Knights/Swordsman/Warrior/Templar/Sell swords best friend, Plenty of space to carry a large array of gear, from your armor to your blades. Even some potions and mead. Ready to lead the charge into battle or lead to adventures unknown. Be ready for any battle, with the Knight Saddle.\r<br />\r<br />         Dawnguard Saddle: The Vampire Hunters best friend, loaded down with equipment such as; Crossbow with bolts, Hunters Hand Axe and Heavy Sun Shield used in the purging of the Vampires and there minions. This saddle has you ready for all vampire hunting needs. Strong but still flexible this layer of armor gives the horse a vastly superior protection in battle.[/color]\r<br />\r<br />[b][color=#8B0000]=====================================News Section=====================================[/color][/b]\r<br />[color=#FFC0CB]\r<br />News 2/7/2013\r<br />\r<br />Hi everyone, Sorry I haven&#39;t updated anything in a long time. :( But good news :D Updated Some Textures on Traveler, Hunter and Big Game, They use Ornate Saddle textures now. New Pretty Saddle Textures YAAH&#33; So I am still working on the alchemist saddle. I didnt relise how much of a pain it would be.... I have ideas for Dwarven and Mage still to go but I am currently looking at some of the Dragonborn assets and getting motivated :D So, hopefully, Alchemist soon and then we can see from there. Alchemist MIGHT use one of the Ornate Saddle Textures but I might just leave it as the only one with default nordic saddle texture. We will see how it goes.\r<br />\r<br />-Laup\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />News 10/8/2012\r<br />\r<br />Hi everyone, I have some updates. I just started a new quarter so I will start making and releasing new saddles in a bout 2 - 3 weeks. I have also heard back from the author of Ornate Saddles author and he is letting me use his textures on the saddles. So expect some old and new saddles to use some of these new textures. Also, I have been informed by the author of Convenient Horses that my CH version is no longer needed. IF you just install normal More Saddles and not equip a horse armor the More Saddles will appear instead of the horses normal default. The saddles will appear on their corresponding hold horse but at least you can now have both Horse Armors from CH and More Saddles. But if you still want it to replace the armors to say put any of them on any horse if you want you can still do so to my knowledge.\r<br />\r<br />-Laup\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />News 9/5/2012\r<br />\r<br />           Greetings everyone. Sorry I haven&#39;t been posting updates and stuff. Been kinda busy setting up stuff for my sisters wedding and getting all my stuff for college sorted out for the new term. Once things settle down a bit i will do some more saddles. But I have some news&#33; I uploaded my first attempt at a CH compatible download. It REQUIRES CH to use. It replaces all but one of the horse armors with my saddles. I will explain which to which in a minute. I haven&#39;t tested this&#33; I don&#39;t use CH. So if there are any problems report them to the comments section PLEASE&#33;\r<br />\r<br />Bard Saddle: Is replacing the Dragon Saddle.\r<br />\r<br />Traveler Saddle: Is replacing the Daedric Saddle.\r<br />\r<br />Hunter Saddle: Is replacing the Leather Saddle.\r<br />\r<br />Big Game Hunter Saddle: Is replacing the Ebony Saddle.\r<br />\r<br />Knight Saddle: Is replacing the Nordic Saddle.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />News 8/13/2012\r<br />\r<br />            Sorry for the wait so long before the next release of a saddle. I had to reformat my computer a while ago. \r<br />\r<br />A few things to list off.\r<br />\r<br />1. The newest saddle is out it requires Dawnguard DLC, The Dawnguard Saddle. Version 0.1, I am having some texture problems, when I resolve those I will add a few more items to the saddle and upload the next version.\r<br />\r<br />2. I plan on making an article soon, to explain and break down how to easily move the saddles around form horse to horse in the data files so people can place them were they want. I also will be taking a vote on whether to change the naming convention so its more simple for others.\r<br />\r<br />3. I have several ideas for other saddles. Sadly, because we are almost out of stables to fill(I will change Markarths with a new one) a lot of them will be optional files that will be re-placers for other saddles.\r<br />\r<br />4. I need to figure out a way to bribe you guys to endorse more... maybe take more requests? or something.\r<br />\r<br />5. I know I said I would make the steel axe re-placer for the big game hunter saddle. AND I plan to its just I hate that saddle(working on its a bitch) I will how ever get around to it.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />News 7/17/2012\r<br />\r<br />              Sorry for no updates in a little... I had to restart all my skyrim saves... stupid bug form an other mod. But yah, I have been playing with my saddles. and I LOVE THEM. Some time this week end I will put together the improved default saddle. With some bags, booze, a mug. Comment if you got any other ideas for it for stuff the advanced default saddle should have.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />News 7/9/2012\r<br />\r<br />              I got saddles to apply, it looks like anyway only to your saddles BUT to get saddles you have to go to different holds. Each one is at a different hold in the game. I plan for markarth to have the advanced default saddle I talked about a few days ago. I will also make a optional file for the advanced default saddle so everyone will have a simple yet nicer normal saddle. This file works for me so, report any bugs that ARENT Textures OR Bone issues. Please.  Some mods that use hold horses for people traveling like &#34;Skyrim Live&#34; the saddles will show up on people. I will look into it but frankly I dont mind the effect. They are there but spread out. They are all repreasented and you dont get saddle overload(of one type of saddle), This is V0.2 NOT V0.3 in V0.3 I will work on Hunter and Bard Saddles aswel as fixing texture problems.\r<br />\r<br />          ALSO, if your new saddle doesnt appear, Here are some steps to make it appear.\r<br />1) Go into first Person.\r<br />2) Click the ~ key next to the 1 to bring up console.\r<br />3) Click on your horse.\r<br />4) Type Disable, hit enter.\r<br />5) Type Enable, hit enter.\r<br />6) that doesnt work I have no idea, I will look into bugs\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />News More: 7/8/2012\r<br />\r<br />             More Saddles is Featured in another Video Check it out. Woot Woot&#33;\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />News 7/8/2012\r<br />\r<br />          Sad news, The author of Ornate Saddles hasnt been on in 8 months and I dont expecta  reply. So I will be linking to his mod. But first i will make sure it works correct;y, and now that I have checked they do. If he does get around to getting back to me I will use them as assets but for now. no cool saddle textures with my mods. If we get a esp to equip saddles they wont be useable. So for now use them. And if we dont get a respawn before we get pick saddle ingame(will have it some day hopefully) they wont be able to be used at all. \r<br />\r<br />Link: http://skyrim.nexusmods.com/mods/3200\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />News 7/7/2012\r<br />\r<br />            A video was made by Nightasy, featuring my mod. I used it tutorials to get my .nif editing setup and to learn the requirements needed for .nif files to work in skyrim. Also his tutorials taught me how to use nifskope. They are wonderful tutorials. All the sotware he uses and has you install is 100% free. If you want to get your feet wet watch his videos. I only watched 13 of them before I made the saddles.\r<br />\r<br />          The Video is in the Video section of this mod page. I linked to it, so its easier to find. In the discription is a link to his tutorials page here at the nexus. Here is a link to his great tutorial page: http://skyrim.nexusmods.com/mods/19249\r<br />\r<br />     Enjoy,\r<br />\r<br />       -Laup\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />News 7/6/2012\r<br />\r<br />         More News, I just notice(maybe you guys did already too) that your texture mods apply to the saddles. If you have HD textures for everything so will the saddle. Because I use Default texture connections to the skyrim data folder, your mods that change those affect the saddles.\r<br />\r<br />         I uploaded Two NEW SADDLES&#33; Big Game Hunter and Knight. I am currently fixing the saddle problem for the knight saddle. That should be fixed and uploaded soon. If people want retextures on colors. It would be best to find a tutorial and link me to it.(Videos in english Please) I havent done retextures before(in Skyrim), so if you want retextures find me videos so I can learn and do it. Other wise its currently low on the list. To people that want this to work with other horse mods. I will take a tally in a few days of what mod people want it to work with the most and contact the author. Also if someone can figure out what to do to make the saddle only apply to the players saddle, If someone can figure that out and get it working, I will impliment it to the saddles and give creadit on the main page for your contribution to the mod.\r<br />\r<br />       Man, I havent even played with my new saddles yet, soo after I get Knights saddle to work right I might take a break for a day.\r<br />\r<br />P.S. I know there are a few bone and texture bugs with the Big Game Hunter. This saddle is very hard to work on. It has so many meshes on it that the file almost crazes, on me editing it. It also takes forever to redo the texures on it if I chang bone connections. So that one will get updated last.\r<br />\r<br />     Also, I plan to improve the first two saddles to the level of the newer ones. including, leather straps, better items(getting rid/changing out, the blueish saddle bags, people want something different), Conection points done with leather/chain and better posistioning.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />News: 7/5/2012\r<br />\r<br />         I fixed the clipping and smooshing/squishing problems. I plan to change a bit on the saddles(Adding straps)  and maybe do some of the request stuff(Blue saddle on bard optional) and maybe try to make a new color for the saddle bags. And to make Hunter saddles bag smaller. Then I will be working on the Next new saddle.... Knights Saddle&#33;[/color]\r<br />\r<br />[b]============================Author Statement==========================================[/b]\r<br />\r<br />         This is a work in progress mod. I plan to improve the curent saddles and to make more of them. This mod was made after I saw Nordic Hunting Armor by: Frankdema. I felt his mod was great but I spend so much time on my horse and my horse wasnt as cool as his armor. So I set out to change that. And I feel I have.\r<br />\r<br />         If any one knows how to make it so only your(The Player&#39;s) horse saddle changes please let me know I will put it into the mod and give you creadit for contributing to the mod.\r<br />\r<br />[b]=============================To Do List================================================[/b]\r<br />\r<br />To Do List:\r<br />     Improve Bone animations for Saddles and there objects.\r<br />     Corrrect Texture mess ups.\r<br />     Continue Making Saddles.\r<br />     Either get another modder of horse mods to help me make equipe-able or to attempt doing it myself with some offered help.\r<br />      Learn the script to make Front Page look nicer.\r<br />\r<br />[b]===================================Installing==========================================[/b]\r<br />\r<br />Install: \r<br />\r<br />        The NMM works for this mod. You dont need to Manualy install. If you do how ever this is what you do. Place the saddle.nif in Skyrim/Data/meshes/actors/horse/character assets \r<br />If you dont have one or more of these folders just create them. \r<br />\r<br />        If you want Ornaite Saddles mods textures download the one you want from his page Link: http://skyrim.nexusmods.com/mods/3200\r<br />\r<br />        All your custom textures for items that are also on the saddles apply to the saddles.\r<br />\r<br />[b]===============================Bug Fix================================================[/b]\r<br />\r<br />1) Go into first Person.\r<br />2) Click the ~ key next to the 1 to bring up console.\r<br />3) Click on your horse.\r<br />4) Type Disable, hit enter.\r<br />5) Type Enable, hit enter.\r<br />6) that doesnt work I have no idea, I will look into bugs\r<br />\r<br />[b]=============================Authors Plea For Endorses==================================[/b]\r<br />\r<br />           If you like it please endorse. It will make me happy and more likely to continue updating this mod and to make more mods. Please make me Happy.\r<br />\r<br />[b]===========================Crediting Mods I Use in Images================================[/b]\r<br />\r<br />Armor in Hunting Saddle Pictures http://skyrim.nexusmods.com/mods/18056 By FrankDema\r<br />\r<br />Armor in Bard Saddle Pictures http://skyrim.nexusmods.com/mods/14198 By Echo1162\r<br />\r<br />Face Mod in Pictures Combo of http://skyrim.nexusmods.com/mods/2812 by BellaGail and random asortment of other face mods.\r<br />\r<br />Hair in Hunting Saddle Pictures http://skyrim.nexusmods.com/mods/10168 By Apachii\r<br />\r<br />Hair in Bard Saddle Pictures http://skyrim.nexusmods.com/mods/10168 By ZzJay\r<br />\r<br />The bags on Hunter Saddle Pitcures http://skyrim.nexusmods.com/mods/16438 By Dragten\r<br />\r<br />Original Meshes/Textures By Bethesda",
  "categoryId": "83",
  "version": "V0.5",
  "author": "Laup26",
  "createdUnix": "1341472771",
  "updatedUnix": "1387563698",
  "containsAdultContent": false,
  "uploadedBy": "Laup26",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81203",
      "name": "Optional Saddle Dawnguard",
      "version": "V0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "139",
      "fileName": "Optional Saddle Dawnguard-19936-V0-1.rar",
      "uploadedUnix": "1344830902",
      "modVersion": "V0.1",
      "virusScanUrl": "https://www.virustotal.com/file/e5b82bb1794a8dadb4f11a234e83d3765319e5ce9d615aa4359932356b7db3a6/analysis/1407092965/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Optional%20Saddle%20Dawnguard-19936-V0-1.rar?fid=81203&ttl=1535787739&ri=8192&rs=8192&setec=3dbfc5d19dc52caac919e94cc67135e1"
    },
    {
      "fileId": "86790",
      "name": "Saddle Compilation Convenient Horse Version",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1043",
      "fileName": "Saddle Compilation Convenient Horse Version-19936-1-1.rar",
      "uploadedUnix": "1346941861",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6fffe9c31528a056cc20331541038557a1e8cc13cdb2f9812f876accc5cf05d6/analysis/1407149163/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saddle%20Compilation%20Convenient%20Horse%20Version-19936-1-1.rar?fid=86790&ttl=1535787740&ri=8192&rs=8192&setec=833acdcdde773c1f2f03346a7f072606"
    },
    {
      "fileId": "1000032412",
      "name": "Saddle Compilation",
      "version": "V0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6889",
      "fileName": "Saddle Compliation-19936-V0-5.zip",
      "uploadedUnix": "1370141170",
      "modVersion": "V0.5",
      "virusScanUrl": "https://www.virustotal.com/file/d2efa18954cc7553b08b92a8404cb11e69af6869aa9c918d7d60343c75bbf63c/analysis/1407589225/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saddle%20Compliation-19936-V0-5.zip?fid=1000032412&ttl=1535787740&ri=8192&rs=8192&setec=3e3896c1e59c8ba44e920af3b96e2c8c"
    },
    {
      "fileId": "1000087586",
      "name": "Saddle Compilation - Convenient Horses Saddle Replacer",
      "version": "v1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1177",
      "fileName": "Saddle Compilation - CH Saddle Replacer-19936-v1.rar",
      "uploadedUnix": "1387563698",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/55ee9c5b9f0cd8572347caef18aff49985d6fa59a0b8b417de40e2535dd32b06/analysis/1407850508/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saddle%20Compilation%20-%20CH%20Saddle%20Replacer-19936-v1.rar?fid=1000087586&ttl=1535787740&ri=8192&rs=8192&setec=da1570edc701d9b655d12957b39d43db"
    }
  ]
}