{
  "modId": 19943.0,
  "modName": "Craftable and Placeable Havok-enabled Bedrolls",
  "summary": "Allows crafting of bedrolls from bear (or Sabre Cat Snow)  pelts, with unique textures for each type of pelt.  The inventory item (a rolled up bedroll) can be placed on the ground and activated, whereby it becomes a working bedroll. Activate this unpacked bedroll to use it (sleep) or repack and place in your inventory. Havok-enabled, so the bedroll",
  "descriptionHtml": "[b]Now included in 2 \\'Mods of the Week\\' videos![/b]\r\nSee the Videos section at the bottom of this readme.\r\n\r\n[b][heading]Description[/heading][/b]\r\nAllows crafting of bedrolls from (all) bear and Sabre Cat Snow pelts, with unique textures for each variant of pelt.  The inventory item (a rolled up bedroll) can be placed on the ground and activated, whereby it becomes a working bedroll. Activate this unpacked bedroll to use it (sleep) or repack and place in your inventory. \r\n\r\nThe crafting recipes are for the Tanning Rack, and will only be visible if you have at least one of the appropriate type of pelt in inventory. You can create as many bedrolls as you would like and the recipes require 1 bear pelt (or 1 Sabre Cat Snow Pelt), 2 pieces of leather and 3 leather strip. They weigh 2.5 stones and are valued at 50, 60, 70 and 90 Septims, depending on the pelt used.\r\n\r\nI\\'m a big fan of Frostfall, and the tents, but felt it was unrealistic to have to pitch a tent, just to use the bedroll. This makes sense when outdoors, but if I\\'m holed up in a cave (or other interior - like a fort) this seems strange. So I carry one of these bedrolls with me, and the Frostfall tents are kept in our horse(s).\r\n\r\n[b][heading]Details of mod[/heading][/b]\r\nThe bedrolls are Havok\\'d, so they will adjust to the contours of where they are placed, but the meshes have no bones, so the beds won\\'t \\'drape\\' like a fabric. The overall bedroll will tilt, angle, etc. to generally match the ground beneath.\r\n\r\nYou can reposition (grab and hold, as you do any other item in the game) to fine tune the placement. Movement is *very slow* (that\\'s by design) so it shouldn\\'t be used for anything other than fine tuning.\r\n\r\nUnique meshes and textures were used, no vanilla assets were modified, and the mod was created according to recommended practices for Skyrim/Creation Kit/Papyrus (Reference Aliases, proper use of Disable/Delete, etc.) If you\\'re aware of something that I did wrong (or could do better), let me know, but as it stands, everything in this mod should be \\'safe\\'.\r\n\r\n[b][heading]Change Log[/heading][/b]\r\n\r\nNOTE: The original, more colorful textures are still available as an \\'Optional\\' download. Just install the main files, then overwrite with the optional textures.\r\n\r\n0.94 \r\nAdded checks to make certain the Activation Menu only appear when the Player activates the bedrolls.  \r\nNow, NPCs can activate/use the bedroll, without the player being interrupted by the menu (thanks @miketheratguy for pointing this out).\r\n\r\nNew collision mesh on unpacked bedroll (Replaced default bhkCompressedMeshShape collision box Created(which is still being reverse engineered by NifSkope team) with brand new bhkBoxShape collision mesh.  This should result in better collision for the unpacked bedroll (still not perfect, due to game engine handling, but much better).\r\n\r\n0.93\r\nAdded Sabre Cat Snow Bedroll variation, with unique texture. (No regular Sabre Cat --\\'Snow Cat\\' is, logically, suited for cold weather and it\\'s fur suited for a bedroll lining). Understand logic could apply to Arctic Wolf, too. Still deciding on that one.\r\n\r\n0.92\r\nUpdated packed_bedroll.nif collision properties to reduce lopsided collision boxes (sometimes allowing item to drop beneath the ground, depending on which side was face up)\r\nComplete retexturing of variants - less saturated \\'dye in the wool\\' (geddit!) colors.\r\nSlight adjustment (slightly faster) to linear/angular Havok adjustment speeds on unpacked bedroll.  \r\n\r\n0.91 \t\r\nResized packed bedrolls to about 65% of original size (approximately matches width of unpacked bedroll)\r\nUpdated All 3 bedroll textures\r\nCreated packed bedroll textures, matching unpacked bedrolls.\r\n\t\t\r\n0.90 \t\r\nFirst public release version. Fingers crossed.\r\n\r\n[b][heading]Known issues and bugs[/heading][/b]\r\nOccasionally, parts of the unpacked  bedroll will start to disappear into the ground. This is an issue with the game engine and happens on very uneven ground. Just grab and hold the bedroll, and the Havok repositioning will start to pull it out of the ground. When its fully visible, step onto the bedroll and it will slowly drop back onto the ground and tilt/angle to matches the contours, while remaining completely visible. I continue to work on ways to avoid (or at least minimize) this, and have already spent several hours modifying the mesh\\'s physics properties, but there\\'s always room for improvement.\r\n\r\nVersion 0.92 (and after) has a brand new packed bedroll mesh, with collission boxes on all sides, so you shouldn\\'t see this issue with the this particular mesh. \r\n\r\nIf you load a save, or enter a room with a placed/unpacked bedroll, the game engine may occasionally make the bedroll disappear into the ground. its not common, but again, it\\'s an engine issue. If this happens, reload, or reenter the cell/room. It\\'s probably something you\\'ve already seen in your game … so no surprises, really.\r\n\r\nBoth of the above issues concern Havok and the game engine, when we add items to the game world.  As stated, I continue to look for ways to minimize the chance of this occurring.  If anyone has had success, please let me know.\r\n\r\n[b][heading]Load Order[/heading][/b]\r\nAnywhere. \r\n\r\n[b][heading]Compatibilities[/heading][/b]\r\nShould work with everything.\r\nHaven\\'t tested with Skyrim 1.6.x, but can\\'t see why it wouldn\\'t work (under the hood, it\\'s pretty vanilla).  Let me know.\r\n\r\n[b][heading]Tools Used[/heading][/b]\r\nBuilt on: Skyrim 1.5.26, CK 1.5.24.0\r\nSkyrim\r\nNifskope\r\nCreation Kit\r\nPhotoshop\r\nNotepad++\r\n\r\n[b][heading]Permissions[/heading][/b]\r\nAsk. I\\'m pretty agreeable to just about anything, I\\'d just Like to know about it, first.\r\n\r\n[b][heading]Manual Installation/Uninstallation[/heading][/b]\r\nIf you install mods manually, you should already know what to do.  \r\n\r\nTo manually delete (always a good idea to explain this)\r\n/Skyrim/Data/Craftable and Placeable Havok-enabled Bedrolls.esp\r\n/Skyrim/Data/Craftable and Placeable Havok-enabled Bedrolls README.txt\r\n/Skyrim/Data/meshes/_NLQ_bedrolls/ (delete the whole \\'_NLQ_Bedrolls\\' directory)\r\n/Skyrim/Data/textures/_NLQ_bedrolls/ (delete the whole \\'_NLQ_Bedrolls\\' directory)\r\n3 scripts from /Skyrim/Data/scripts/ (they start with \\'_NLQ_\\') \r\n3 scrip[t source files in /Skyrim/Data/scripts/source/ (they also start with \\'_NLQ_\\')\r\n\r\n[b][heading]FOMM Installation/Uninstallation[/heading][/b]\r\nStandard. If you\\'re not sure, you shouldn\\'t be downloading mods \r\n\r\n[b][heading]WYRE BASH Installation/Uninstallation[/heading][/b]\r\nSimple Structure. Packaged correctly. Again, if you have to ask, you\\' probably shouldn\\'t be using  WYRE BASH.\r\n\r\n[b][heading]Steam Workshop Installation/Uninstallation[/heading][/b]\r\nDon\\'t know, don\\'t care. \r\n\r\n[b][heading]Frequently asked Questions[/heading][/b]\r\nQ: Can you make versions from Sabre Cat and/or Wolf Skins and or -\r\nA: No. Too much variety is bad. Bears hibernate - their fur/skin helps retain heat while inactive. Cats/Wolves are not built for prolonged periods of inactivity .... blah ... blah (it started to sound good, though, didn\\'t it?)\r\n\r\nMy feelings regarding this changed a bit, for the 0.93 release, and I created a unique version for the Sabre Cat Snow pelt. Regular Sabre Cats and Wolves (all varieties) are still not included.  I *might* consider a Snow Wolf (same logic behind the Snow Sabre Cat), but I\\'m going to wait a bit and see. For me, texturing is a grueling process, so I can\\'t only take so much at a time .... ;)\r\n\r\nI originally thought of creating varients for all/most hides/pelts, but in a world where every bar maiden has a choice of one (1!) outfit, and bandits all wear the same outfits (hey, I was going to wear that during the raid today!), I think 3 (now 4, in version 0.93) variations is plenty.\r\n\r\nIf you\\'d like, you can open the CK and change the constructible object recipe, miscellaneous object, activator and furniture objects to your heart\\'s content. EVERTHING related to this mod begins with the prefix _NLQ_, so should be easy to find.\r\n\r\nQ: The bedrolls don\\'t bend like real leather/fur.\r\nA: See above. I\\'m not a modeler, so can\\'t create a mesh with bones/joints needed for that. If you can, and would like to, let me know. Or, if you know of some way to accomplish this with the existing mesh, let me know. \r\n\r\nQ: The Havok settings are too slow.\r\nA: Yes. I only wanted to provide a method to fine tune placement, for the occasion that you\\'re camping on uneven ground and the game creates the bedroll partially in the ground. Creating a placeable bedroll that acts like other moveable objects looks weird with the rigid body (see above\\' re. mesh/bones) so I\\'ve settled on this. There are other mods with fully moveable bedrolls, so if this is your hang-up, try one of them. \r\n\r\nQ: You mention Frostfall;  Those tents have a wear-and-tear/degradation aspect.  Could you …\r\nA: Originally, I was going to implement that.  But, I decided that I really don\\'t want to force the player to micro-manage a bedroll. Besides, there are no configuration settings in this mod, so I\\'d either have to introduce them (to allow the player to toggle this aspect on/off), or create 2 versions of the mod.  Again, I\\'m going for simplicity here, but if you really bug me enough about this… maybe.\r\n\r\nQ: I installed this and now my [whatever] isn\\'t working.\r\nA: I touched zero (0!) vanilla objects and the only thing that actually hooks into a vanilla asset is a properly created Reference Alias that only affects the crafted bedrolls in this mod.  Are you sure your problems aren\\'t due to another mod you installed (uninstalled, upgraded) around the same time as this one?  \r\n\r\nHowever, there\\'s always the chance … and if this mod is causing a problem, I want to fix it. Please provide as much detail as possible about the cause, what else you have installed that might be conflicting, explain if you can reproduce it, etc.  If you just say, \\'it\\'s not working\\' (or something equally pathetic) you\\'re probably not going to find much sympathy (or a solution). Seriously, if that\\'s all the help you can provide, just uninstall this mod, and go play in traffic. The human  gene pool could use the break.\r\n\r\n[b][heading]Future Updates[/heading][/b]\r\nNot sure. I scaled back some initial ideas to keep this simple. As it stands, it does what it does and it\\'s simple and works.  \r\n\r\nI did put code in place to stop you from unpacking the bedroll, while outdoors, in the snow or rain.  Seems like a neat little idea.  I disabled this code, though, as there are places in the game where you\\'re considered \\'outdoors\\', even when there\\'s a collision mesh to block rain and snow (The wreck of the Dainty Sload immediately comes to mind, as that\\'s where my party is currently spending the night....)  I could re-enable that code, and just pop up a quick message (\\\"It\\'s snowing! Seek shelter indoors\\\"), but still allow the player to unpack the bedroll.  Maybe even introduce the possibility of catching a cold if you sleep outdoors....  Any thoughts on this functionality are welcome.\r\n\r\n[b][heading]Recommended Mods[/heading][/b]\r\n[url=http://skyrim.nexusmods.com/mods/11163]Frostfall[/url]. Cold weather/survival mod. Skyrim \\'feels\\' cold, after you install this.  (The menu/activation systems of my mod are very similar(!!) to Frostfall\\'s, so they\\'ll seem a natural fit). Plus, I referenced Chesko\\'s trig functions (GetOffset()), for object placement.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/10639]Imps More Complex Needs (IMCN)[/url]. Sleep, Thirst, Hunger Mod.  There are others - I prefer this one. \r\n\r\n[url=http://skyrim.nexusmods.com/mods/16553]Harvest Overhaul[/url] (Both Flora and Creature .esp\\'s).  More realistic yields from ingredient and animal corpses. Again, there are others, but I like this one. Love the whole, \\\"I\\'m not a fan of killing a bear and pulling 9 Septims out of its ass.\\\")\r\n\r\n[url=http://skyrim.nexusmods.com/mods/13687]Sabre Gear Backpack.[/url] Helps with the \\'visual\\' of carrying a bedroll. \r\n\r\n[b][heading]Videos[/heading][/b]\r\n\r\nFeatured in: Skyrim Modding - Weekly - Bits \\'n\\' Bobs - #16 \r\n(Starts at 3:45)\r\n[youtube]4J-FWBRcBAo[/youtube]     [youtube]3_jEYR13TiI[/youtube] \r\n\r\n\r\nFeatured in: Skyrim Mods : Week 32\r\n(Starts at 5:20)\r\n[youtube]eJf9I2xoAkA[/youtube]     [youtube]OuIsjZ-gZvQ[/youtube]\r\n\r\n\r\n",
  "categoryId": "85",
  "version": "0.94",
  "author": "Neuroliquisity",
  "createdUnix": "1341488465",
  "updatedUnix": "1344260016",
  "containsAdultContent": false,
  "uploadedBy": "neuroliquidity",
  "primaryFile": null,
  "files": [
    {
      "fileId": "72772",
      "name": "Craftable and Placeable Havok-enabled Bedrolls",
      "version": "0.91",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1758",
      "fileName": "Craftable and Placeable Havok-enabled Bedrolls-19943-0-91.7z",
      "uploadedUnix": "1341669299",
      "modVersion": "0.91",
      "virusScanUrl": "https://www.virustotal.com/file/9267e2243ddafcae06f02b4e4c983c1b05d05c44cefea3994905f7baad41a3c3/analysis/1407007506/",
      "changelogHtml": " Resized packed bedrolls to about 65% of original size (approximately matches width of unpacked bedroll) <br/> \n Updated All 3 bedroll textures <br/> \n Created packed bedroll textures, matching unpacked bedrolls. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20and%20Placeable%20Havok-enabled%20Bedrolls-19943-0-91.7z?fid=72772&ttl=1535787756&ri=8192&rs=8192&setec=5420c9c9e5ef035ba2a0acc8e76461a1"
    },
    {
      "fileId": "73420",
      "name": "Craftable and Placeable Havok-enabled Bedrolls",
      "version": "0.92",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1740",
      "fileName": "Craftable and Placeable Havok-enabled Bedrolls-19943-0-92.7z",
      "uploadedUnix": "1341930812",
      "modVersion": "0.92",
      "virusScanUrl": "https://www.virustotal.com/file/8826f52ad55faa0de612a88bd7e86f907c20bf16c2837685e49298fb63378802/analysis/1407014047/",
      "changelogHtml": " Updated packed_bedroll.nif collision properties to reduce lopsided collision boxes (sometimes allowing item to drop beneath the ground, depending on which side was face up) <br/> \n Complete retexturing of variants - less garrish \\'dye in the wool\\' (geddit!) colors. <br/> \n Slight adjustment (slightly faster) to linear/angular Havok adjustment speeds on unpacked bedroll.   <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20and%20Placeable%20Havok-enabled%20Bedrolls-19943-0-92.7z?fid=73420&ttl=1535787756&ri=8192&rs=8192&setec=59a5308b25ad8bb6dba6b1a6c94b8c1c"
    },
    {
      "fileId": "73435",
      "name": "Craftable and Placeable Havok enabled Bedrolls - Alternate Textures",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1711",
      "fileName": "Craftable and Placeable Havok enabled Bedrolls - Alternate Textures-19943-.7z",
      "uploadedUnix": "1341933877",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/00ad65ded27beb6c9dbcf001ca3ed29ed6ebf4d02613003628bc49ba2ae73e41/analysis/1407014166/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20and%20Placeable%20Havok%20enabled%20Bedrolls%20-%20Alternate%20Textures-19943-.7z?fid=73435&ttl=1535787756&ri=8192&rs=8192&setec=f66e20629716bee38dca87ecb8e17b7b"
    },
    {
      "fileId": "75697",
      "name": "Craftable and Placeable Havok-enabled Bedrolls",
      "version": "0.93",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2043",
      "fileName": "Craftable and Placeable Havok-enabled Bedrolls-19943-0-93.7z",
      "uploadedUnix": "1342870702",
      "modVersion": "0.93",
      "virusScanUrl": "https://www.virustotal.com/file/10af20999a6892cea398ce1bdcb17a10f58a0a34e11bb333b9e117bc1d909071/analysis/1407036671/",
      "changelogHtml": " Added Sabre Cat Snow Bedroll variation, with unique texture. (No regular Sabre Cat --\\'Snow Cat\\' is, logically, suited for cold weather and it\\'s fur suited for a bedroll lining). Understand logic could apply to Arctic Wolf, too. Still deciding on that o <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20and%20Placeable%20Havok-enabled%20Bedrolls-19943-0-93.7z?fid=75697&ttl=1535787757&ri=8192&rs=8192&setec=3b68fb99f50da85a627a6da8489fad99"
    },
    {
      "fileId": "79218",
      "name": "Craftable and Placeable Havok-enabled Bedrolls",
      "version": "0.94",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2194",
      "fileName": "Craftable and Placeable Havok-enabled Bedrolls-19943-0-94.7z",
      "uploadedUnix": "1344260016",
      "modVersion": "0.94",
      "virusScanUrl": "https://www.virustotal.com/file/cdd14ed49815339d5b273f51455075733ad38f58c87507c08dae1f3cd7fef3db/analysis/1407074105/",
      "changelogHtml": " Added checks to make certain the Activation Menu only appear when the Player activates the bedrolls.   Now, NPCs can activate/use the bedroll, without the player being interrupted by the menu (thanks miketheratguy for pointing this out). <br/> \n New collision mesh on unpacked bedroll (Replaced default bhkCompressedMeshShape collision box (which is still being reverse engineered by NifSkope team) with new bhkBoxShape collision mesh - should result in better collision for the unpacked bedroll <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20and%20Placeable%20Havok-enabled%20Bedrolls-19943-0-94.7z?fid=79218&ttl=1535787757&ri=8192&rs=8192&setec=044df16bedff68af26445dc28f4cf4c9"
    }
  ]
}