{
  "modId": 19955.0,
  "modName": "Amaterasu - burn you into ashes",
  "summary": "This mod adds a powerfull magic - Amaterasu, which burns your target (even dead body) into ashes. A visual effect to simulate dizzy feeling comes after casting the spell. The number you can cast this spell everyday depends on you destruction level, as well as the power of this spell.  ",
  "descriptionHtml": "\r\nIntroduction:\r\n\r\nSo.. this spell will burn your enermy for 20 seconds, and turn him into ashes if he die during this period. \r\n\r\nThe power of this spell depends on your destrcution level, (there are 3 levels of this spell, will automatically upgrade when you reach 30,60,90 on destruction skill).\r\n\r\nThere is a limit on how many times you can cast this spell , also depends on your destruction level. if you run out of your daily limit, you can\\'t cast it anymore, taking a sleep will recover it.\r\n\r\nThere is a visual effect come after this spell to simulate the dizzy feeling, also with the penalty to your magicka and stamina (it\\'s supposed to be a powerfull spell,  so you should feel tired after casting it). It gets stronger when you approach your daily limit. \r\n\r\nThe turing-into-ash feature doesn\\'t work on dragon, dragon priest, wisp, ghost, dwemer robots, and summoned creatures, they still burns and take the damage, but won\\'t turn into ashes, I designed it this way mostly because they have their own death animation.\r\n \r\ncan cast on corpse, and they do burn into ashes.\r\n\r\nIt\\'s designed for mage type character, so if you just want to have a full experience of how powerful is this spell, type \\\" player setAV destruction 100\\\" in console.    you can still cast it if you are low on destrcution skill, but the fatigue can screw up your following combat.\r\n\r\ncast like a shout, not a spell in hands \r\n\r\nI think this description should be long enough...\r\n\r\nInstallation: \r\nPut everything under data folder, or use NMM\r\n\r\nuninstallation:\r\nyou should know...the usual way.\r\n\r\n\r\nSome other things:\r\n\r\nthis idea is from the Japanese  comic  \\\"Natuto\\\" , but not with normal fire instead of black fire. Actually I have released the black fire version in a Chinese skyrim forum (called 3DM BBS) long time ago, but persionally I don\\'t like the black fire viusal effect so I stoped updating that one.",
  "categoryId": "75",
  "version": "1.0",
  "author": "Jeff190",
  "createdUnix": "1341512662",
  "updatedUnix": "1341512714",
  "containsAdultContent": false,
  "uploadedBy": "Jeff190",
  "primaryFile": null,
  "files": [
    {
      "fileId": "72392",
      "name": "Amaterasu",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "238",
      "fileName": "Amaterasu-19955-1-0.rar",
      "uploadedUnix": "1341512714",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/afeedd66616eabd20ce8501acc532165296e8446ac8b23365908ae33e7cf98da/analysis/1407003423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Amaterasu-19955-1-0.rar?fid=72392&ttl=1535787776&ri=8192&rs=8192&setec=50ba374cd7ac7331ebb5c44dfff7d35d"
    }
  ]
}