{
  "modId": 19973.0,
  "modName": "Morthal Redone",
  "summary": "The city of Morthal walled and its people made over. ",
  "descriptionHtml": "Version 0.5 Beta\r\nI have always had an affinity for Morthal but I felt it lacked the essence of a hold capital. I have set out to change that with a series of additions and changes to the dark and eerie town. So far I have edited the landscape/shrubbery and I have added a wall around the city, two houses, six NPCs, a unique ruined temple and an empty stable.\r\n\r\nThere is still a lot I have to do. As of right now none of the new NPCs have anything other than a sleep schedule and I am having a really hard time figuring out how to give them more complex schedules like working or walking around during the day. Also one of the new NPCs is the town\\'s blacksmith though I\\'m still figuring out how to make a vendor so right now he just stand there without dialogue or items for sale. I should have an update sometime next week with some more content. Also the statue in the temple right now is of Nocturnal but when Dawnguard is released for PC it will change to be something more befitting of Morthal\\'s surroundings and secrets.\r\n\r\nCompatibility: \r\nAnything that changes Morthal, its people or the surrounding area will probably be incompatible with this mod. \r\n\r\nRequirements:\r\nhttp://skyrim.nexusmods.com/mods/10168 - Apachii\\'s great hair mod was used to edit the NPCs and as such all credit goes to Apachii for the hairstyles.\r\n\r\nPermission: \r\nIf you want to edit my mod and change it to better suit your tastes then feel free to do so. All I would like is to be credited with the original.\r\n\r\nBugs:\r\nAs a beta there will be a few bugs; if you find any then please post them so I can get to correcting them.",
  "categoryId": "53",
  "version": "0.5",
  "author": "jrfan007",
  "createdUnix": "1341526998",
  "updatedUnix": "1341610257",
  "containsAdultContent": false,
  "uploadedBy": "JRFan007",
  "primaryFile": null,
  "files": [
    {
      "fileId": "72635",
      "name": "Morthal Redone",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "170",
      "fileName": "Morthal Redone-19973-0-5.rar",
      "uploadedUnix": "1341610257",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/ae35b9077834b7dbb5969d07e9c5b5e5f25bf2f4649c9ba023770034bf80cb4f/analysis/1407005889/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morthal%20Redone-19973-0-5.rar?fid=72635&ttl=1535787812&ri=8192&rs=8192&setec=84b345c37bd78d32c3c691e75d9d79dc"
    }
  ]
}