{
  "modId": 19986.0,
  "modName": "Merchest",
  "summary": "Ever see the merchant have something you really want for sale, but you aren\\'t exactly the most \\\"Honest Trader\\\"? Well now all your problems are solved! This mod moves the merchants \\\"merchandise\\\" chest into their shop (Or near them), adds a key that the merchant will hold, and sets the chest to a master lock. This chest will hold all of the merc",
  "descriptionHtml": "[u][b]What does it do?:[/b][/u]\r\n\r\nThis mod moves the merchant chests (The chests that contain the merchants merchandise) into shops (Or near them, if they aren\\'t in a shop), allowing you to steal what the merchant has for sale. Also adds a key to the respectable chest that the merchant will hold. \r\n\r\nAll the chests are set to master lock, if you are more of a lockpicking person, go ahead and pick it! If you are more of a pickpocketing person, just go grab the key! For all your stealing needs! [b]This mod will work with new, or old saved games.[/b] Also, just like the merchants, the chests loot resets every 48 hours.\r\n\r\n[u][b]Recommended Mods:[/b][/u]\r\n\r\nOther merchant mods, and other sneaking mods, such as Dynamic Merchants, or Shenk Thievery Overhaul. \r\n\r\n[u][b]Compatibility:[/b][/u]\r\n\r\nShould be compatible with any mod (I personally use a LOT of mods, I had no problems). It may have some problems if a mod rearranges shops though, as it won\\'t be in the right place.\r\n\r\n[u][b]Future Plans:[/b][/u]\r\n\r\nIn later patches I hope to add guards, some patrolling, some specifically guarding the chest.\r\n\r\nThere also seems to be an issue with merchants not losing their merchandise for sale after you steal from the chest. I hope to fix this \\\"Soon\\\" (TM).\r\n\r\n[u][b]Credits:[/b][/u]\r\n\r\nFrogmander (Myself)\r\nZeptol (Friend)\r\n\r\nTime it took to make (Version 1.0, release.): 3 days.\r\n\r\nSorry if the mod has any problems, please post in the comments if you find an issue and I will get right on that. I will be very surprised if it does not have problems, as this is my first mod.",
  "categoryId": "69",
  "version": "1.0",
  "author": "Frogmander",
  "createdUnix": "1341535629",
  "updatedUnix": "1341535817",
  "containsAdultContent": false,
  "uploadedBy": "Frogmander",
  "primaryFile": null,
  "files": [
    {
      "fileId": "72478",
      "name": "Merchest Version 1 Main",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "34",
      "fileName": "Merchest Version 1 Main-19986-1-0.rar",
      "uploadedUnix": "1341535817",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d3aaec7fffdf59f458e56b51587e93db439e8d86cfdb36d64035517ff079b4ce/analysis/1407004263/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Merchest%20Version%201%20Main-19986-1-0.rar?fid=72478&ttl=1535787839&ri=8192&rs=8192&setec=1d77194499b099e01a703dc8bb43729e"
    }
  ]
}