{
  "modId": 19983.0,
  "modName": "Ria Companion REVISED Fleshed Out Companion More Dialogue",
  "summary": "Companion Ria - A Unique Companion introduces a companion with her own dialogue, in which the player can communicate with. She has more than 100+ different topics, many in which you can respond with the answers appropriate to your character&#39;s personality/taste, she can heal you when asked and you can even offer her gifts. Also features conversa",
  "descriptionHtml": "[center]I&#39;ve started a Facebook Page: http://www.facebook.com/ScannerlegendMods[/center]\r<br />[center]Like It - To get the latest updates on my mods, screenshots, links to vids on my mods and other info. Also serves as another form of contact.][/center]\r<br />[center](Facebook Page is Experimental. If it isn&#39;t as &#34;useful&#34; I may delete it. I&#39;ll see how it goes..)[/center]\r<br />[center](Remember to add the Facebook page to the ADD TO INTEREST LIST. Click on the Page&#39;s wheel/settings button and click on &#39;Add to Interest List&#39;. This means you&#39;ll get all the updates from this page showing on your newsfeed)[/center]\r<br />[center][img]http://i.imgur.com/5C1bH.png[/img][/center]\r<br />\r<br />** PLEASE READ**\r<br />\r<br />I contemplated on abandoning this mod since I&#39;ve learnt quite a bit from making this one. And I did. I&#39;ve started on a second companion mod (link found on the very bottom of page) and my main focus is now on that. BUT I have decided to continue to work on this mod but at a slower pace. Latest update released on the 16/12/2012. Version 1.6 features Unique greetings which includes location based greetings. For now it only includes Holds.\r<br />\r<br />[b]PLEASE TRY AND READ THIS ENTIRE PAGE BEFORE DOWNLOADING AS ALL THE INFORMATION YOU NEED TO INSTALL (OR UNINSTALL) AND HOW TO USE ARE ALL EXPLAINED IN DETAIL HERE.[/b]\r<br />\r<br />** MORE INFORMATION OR NEWS UPDATES ARE CONTINUALLY ADDED AS THE MOD UPDATES\r<br />[center]--------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />[center][b]AUTHOR&#39;S NOTES[/b][/center]\r<br />\r<br />Report mod problems in the comments (Might redirect this to a forum at a later date)\r<br />\r<br />**Dialogue Skipping**\r<br />\r<br />Dialogue skipping is due to lack of voice files. For Skyrim VERSION 8.151.0 or below, Please USE THIS MOD: http://skyrim.nexusmods.com/mods/14884\r<br />\r<br />The mod IS A REQUIREMENT for the stated versions of Skyrim. NOT A REQUIREMENT to make the mod &#39;function&#39; but you will get dialogue skipping.\r<br />\r<br />PATCH 1.7/DLC DIALOGUE BUG: In any mod which adds custom dialogues, they may not wont show up immediately or work properly. SOLUTION is to SAVE your game, LOAD that save and then the dialogue should appear. This applies to first time users of CompanionRia_REVISED if this problem occurs. A permanent solution may be figured out in the future. A SEQ file will be created to bypass this and will be included in the next release.\r<br />\r<br />[center]--------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />[center][b]ENDORSEMENT/VOTING FOR ME[/b][/center]\r<br />\r<br />Endorsing this mod would very much encourage me to keep going on updating this mod and making it work the way its supposed to, adding dialogue and making other features work is seriously TIME CONSUMING but I do this out of passion and desire.. So please endorse this mod/my work as a way of saying thanks I guess and a way of encouraging me to continue on this work. I also appreciate feedback... Also vote for this mod to help get a bit more exposure to the community&#33; All to keep the flame burning&#33; I try to endorse every mod I download and comment a special &#39;thank you&#39; myself too you know?\r<br />\r<br />[center]--------------------------------------------------------------------------------------------------------------------------[/center]\r<br />[b]How to explain? Hopefully I explain everything properly.. Not very good at it but I&#39;ll give it a whirl..[/b]\r<br />\r<br />[i]Well I&#39;ve been a long term fan of Role Playing Games, and over the years with the Elder Scrolls, I&#39;ve grown familiar with using some of the Construction Sets of the past but I&#39;ve never released a mod.. With the Creation Kit allowing more accessibility and of course it being easier to use I decided to release a mod which I am able to update and work on&#33;[/i]\r<br />\r<br />[b]MOD FEATURES[/b]\r<br />- A companion who has a fully developed personality\r<br />- Lots of eastereggs and references to ES Lore + The game itself.\r<br />- 150+ lines of dialogue\r<br />- Unique interactions (Gifts, Heal Player)\r<br />\r<br />[i]Still so much more to come&#33;[/i]\r<br />\r<br />[center]--------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />[center][b]WHAT IS THIS MOD?[/b][/center]\r<br />\r<br />[center][img]http://i.imgur.com/2csl3.png[/img][/center]\r<br />\r<br />This mod adds a companion/follower to the game of course she IS ESSENTIAL too, however, unlike other follower mods, I wanted to make this one unique, one that didn&#39;t seem so bland or boring... I wanted this companion to be interactive, one you can talk to and one who will ask questions. At this stage it is in &#34;Alpha&#34; Stage which doesn&#39;t necessarily mean its still in its &#39;early&#39; stage. And this mod is continually under development and improvement. &#39;Beta&#39; stage is when quests and &#39;memorisation&#39; is finally implemented. Again, the mod isn&#39;t exactly in &#39;early&#39; phase, it&#39;s progressed and grown quite well and will continually add more interactions and dialogue to further improve her character, personality and backstory.\r<br />\r<br />This mod of course would not be possible without gilgoon&#39;s &#39;Sexy Warrior Companion Ria&#39; which adds a new companion, unique in her physical aspects without touching the original races... I&#39;ve had her as a companion but I felt she needed life... personality... interaction&#33; Thus the thought of this mod was born&#33; Inspired by Emma&#39;s well known companion mod &#39;Vilja&#39; (Found here: http://oblivion.nexusmods.com/mods/28977), I set out to add unique dialogue to this particular character. At first I just wanted to keep it simple... And well? It got bigger... I&#39;ve added alot of dialogue and I&#39;ve worked on it for weeks now, at first testing and playing around with the Creation Kit then finally the never ending and continuing addition of dialogue, interactions and so much more&#33;\r<br />[center]--------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />[center][b]INSPIRATION FOR RIA/ORIGIN[/b][/center]\r<br />\r<br />Well first off, the original Ria for starters. The author definitely designed the character well but I just felt that she was missing a personality, I felt something more could be added to her for starters and I just wanted her to talk more I guess. I pictured her to be smart and of course knowledgeable of lore, Cortana from Halo sort of inspired me on this part. Her being a fierce fighter was inspired by Lightning from Final Fantasy and the Zelda in the Wind Waker (Legend of Zelda). Her bubbly personality is inspired by alot of things really, partly Aerith yet again from Final Fantasy, Vilja by Emma in Oblivion and even Zelda from the Legend of Zelda series. So yeah alot of bits and pieces leading to the creation of our good friend, Ria. May her travels aid you in battle... And make you slightly smarter ;)\r<br />\r<br />Basically in short; she&#39;s a sexy ;) Akavirian young lady whose incredibly bright, a little bit crazy, whose polite and nice most of the time but isn&#39;t afraid to shove a dagger through a bandit :)\r<br />[center]--------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />[center][b]WHO IS RIA? WHAT MAKES THIS ONE &#39;UNIQUE&#39; THAN THE ORIGINAL?[/b][/center]\r<br />\r<br />In my version of this mod, Ria is a female Ka Po&#39;Tun warrior hailing from the far east continent or landmass of Akavir. The original Ria looked &#39;asian&#39; to me, Japanese inspired... And I&#39;ve always envisioned the people of Akavir to contain a humanoid Asian related race (though there are others too such as half serpent/half man ones). I love the lore and I stay true to it, but the Elder Scrolls series allows people to have different perspectives, imaginations of certain aspects or events in the ES world may have occurred e.g. Dissapearance of the Dwarves. So please, don&#39;t bash me because &#39;this is not what the people of Akavir looks like&#39;, I won&#39;t respond to you very nicely :) .. Besides the Tsaesci were so called &#39;snake people&#39; right? Half snake half humanoid? Then why was the commander at Pale pass &#39;humanoid&#39;? Exactly...\r<br />\r<br />Ria is on what she calls a &#39;Pilgrimage&#39;, where once an individual in Akavir turns 18, he or she must undergo a spiritual journey of discovery, enlightenment, learning and seeking truth and of course adventure, sort of like an ultimate test. Almost all travel to Tamriel due to it being filled with rich history and ties to dragons and the people of Akavir. Most travel to Cyrodiil, however, out of them all, only one had made the decision to travel to Skyrim. And that one is of course Ria.\r<br />\r<br />Ria herself as a person is a young lady with what I describe as a colorful personality. At a younger age she trained with various masters all around Akavir of combat and warfare which is compulsory for all inhabitants in Akavir thus explaining their strong and skilled arts in war and combat. Ria is also highly fascinated with the history of her people and Tamriel and loves reading books thus she is highly educated.\r<br />\r<br />I haven&#39;t changed much with the original in terms of looks, but I have made changes to her fighting style in that, she no longer carries a double handed sword but duel wields with two katanas/blade swords, she still wears the Blades outfit. In addition, she is NOT at Riverwood... Mainly because nearly EVERYONE loves to put companions or even mods around RIverwood, so instead I have moved her to the Bannered Mare in Whiterun, upstairs. Oh and I&#39;ve also made that Ria is not marriable, another change from the original. In the far future when quests are possible, I could add the option of marriage after developing a strong relationship with her and completing all her quests. However I won&#39;t make this easy of course.\r<br />\r<br />[center][b]I CAN&#39;T FIND HER&#33; SHE&#39;S NOT IN THE INN ANYWHERE&#33;? SO WHERE IS SHE?b][/b][/center][b]\r<br />\r<br />Some people don&#39;t read this, so I&#39;ll say it again.. SHE CAN BE FOUND AT THE [b]BANNERED MARE IN WHITERUN[/b]... NOT IN RIVERWOOD. I hope I made myself clear because I sure as hell won&#39;t be repeating this often.\r<br />\r<br />[i]NOTE: The original can be run with this one from now on. File now renamed.[/i]\r<br />[center]--------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />[center][b]TALKING TO RIA, YOUR NEW FRIEND[/b][/center]\r<br />\r<br />[center][img]http://i.imgur.com/jv2PN.jpg[/img][/center]\r<br />\r<br />Dialogue should appear after giving her permission to join you. After finishing the necessary dialogue with her, you can ask her to follow you. After that the two following dialogues can be unlocked.\r<br />\r<br />[b]&#34;Can I talk to you for a bit&#34;[/b] - Allows you to ask specific questions. MORE questions can be unlocked through talking to her. Be sure to check in once in a while to see if new topics appear. I will also automatically add more dialogue through further updates and some new dialogue MAY unlock new abilities for Ria which CAN help you. So be sure to check back every now and then with future updates... Never know what pressies/surprises I have instore for you&#33;\r<br />\r<br />[b]&#34;What&#39;s on your mind?&#34;[/b] - This is basically the centre of her uniqueness, asking her this topic will allow her to express her &#39;thoughts&#39;. Some can only be accessed while in an inn or bar. Most are short talks or single lined/one way conversations. They&#39;re random as well. I will continue to add new dialogue and content to this part of the mod. As part of the random dialogues as of 1.4Alpha, Ria may offer you a potion or random item as a gift.\r<br />\r<br />In addition there are several forms of interactions... Ria is very knowledgable about Elder Scrolls lore/Tamrielic lore and through conversation you may unlock extra dialogue or discussions on certain topics. Ria can also heal you when asked to, but this must be unlocked through dialogue (Find out yourself :D&#33;). Ria can also be given gifts at this stage in the form of food and drinks. More interactions are continually being added in subsequent updates.\r<br />\r<br />Through her dialogue you&#39;ll notice she&#39;ll make multiple references to not only Skyrim and its world but also references to past Elder Scrolls titles such as Oblivion and Morrowind. She&#39;ll often rant on and perhaps talk your ear off about some of the lore and happenings of those past titles/events. In addition there may be minor references to the very popular mods made for Oblivion over the years, sort of my little way of saying thanks. In addition she&#39;ll engage in conversations with you (not automatically but randomly when talking to her) and have chats on a wide range of subjects. Some of which you MAY recognise from past Elder Scrolls titles...\r<br />\r<br />In addition in tarvens and inns throughout Skyrim she&#39;ll have additional topics and random conversations to say. Will be working on adding new dialogue which can only be accessed at specific places/locations in Skyrim.\r<br />\r<br />Ultimately all these dialogues DO NOT influence how she thinks of you, so thats where a bit of your role playing comes in, I will work on how to implement this... However, through certain pathways in her dialogue you may unlock new topics or questions to ask her in your travels. I&#39;m currently thinking of adding in all sorts of dialogues which can only be accessed through talking to her/responding to specific answers thereby unlocking them and locking other dialogue and etc.. Will see how I go, for now I&#39;m just adding in new dialogue, new topics and little chats here and there to expand her a bit more before going into more actual role play (unlocking/locking dialogue).\r<br />[center]--------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />[center][b]REQUIREMENTS[/b][/center]\r<br />\r<br />This mod REQUIRES you to DOWNLOAD gilgoon&#39;s original mod but ONLY for the meshes/textures. be warned, it is marked as adult content...HOWEVER, I have uploaded UNP non-nude versions as an optional package, which includes everything you need, thus by downloading this, means you don&#39;t have to download the original. \r<br />\r<br />It&#39;s mainly because I&#39;m not a fan of nudity... Boring aren&#39;t I? I even downloaded the non-nude alternative for Ria&#39;s body. Anyway, so the MESHES and TEXTURES are ALL thats required from the original (or the non nude variant from the optional download), the esp is NOT NEEDED (Though it works with this version of Ria as well since this esp file for this mod is named differently I guess this allows you to recruit both Rias...\r<br />\r<br />ORIGINAL Meshes/Textures can be found HERE: http://skyrim.nexusmods.com/mods/17354\r<br />\r<br />THERE IS NO VOICE therefore dialogue will be silent, so TURN SUBTITLES ON. Also you MUST have this mod (for Skyrim v1.8 or below): http://skyrim.nexusmods.com/mods/14884 to fix the problem.\r<br />[center]--------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />[/b][center][b][b]TIPS FOR BEST EXPERIENCE[/b]/[/b][center][b]\r<br />\r<br />I HIGHLY recommend using UFO (http://skyrim.nexusmods.com/mods/14037), much of this mod involves roleplaying, so when in an inn/bar/house... I recommend letting her wander around and talking to her.\r<br />\r<br />With the way the mod works right now, you MAY or you MIGHT not get bored very quickly depending on how much you talk to her.. Much of how this dialogue works is random, she may repeat herself mainly its because the companion is limited by what she can actually say. I am always adding new dialogue and always adding multiple responses to keep it interactive but the work is long and my passion for this to work only drives me. \r<br />[center]--------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />[center][b]CURRENT PROGRESS/UPDATES[/b][/center]\r<br />\r<br />[center]V1.6Alpha Released&#33;[/center]\r<br />- Unique Greetings to replace default ones. Including adding location based ones (Holds Only)\r<br />- SEQ file\r<br />\r<br />[center]--------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />[center][b]COMPATIBILITY[/b][/center]\r<br />\r<br />This mod DOES NOT modify the following:\r<br />- Follower Mechanics and Aspects\r<br />- Races\r<br />- Original Follower Dialogues\r<br />\r<br />All the mod adds are new dialogue under completely new &#39;quests&#39; as the CK puts it. So it should be compatable with UFO and other follower overhauls. UFO is to be loaded above this mod to work (well it should, after some testing).\r<br />\r<br />So please don&#39;t post comments about breaking the game, follower mechanic problems, because I in no way modified any them, only the addition of dialogue.\r<br />\r<br />ONLY english will be supported, I won&#39;t be translating anything, especially with the amount of work put in and yet to be put in.\r<br />[center]--------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />[center][b]CURRENT ISSUES AND BUGS[/b][/center]\r<br />\r<br />- Dialogue Skipping, though for versions 1.5 or 1.6 or 1.7.7.0 of Skyrim, a fix is available (see above for link)\r<br />\r<br />- Spelling mistakes and grammical errors, however, are continually being fixed\r<br />\r<br />[center]--------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />[center][b]UPDATING[/b][/center]\r<br />\r<br />Just overwright the previous esp file. Shouldn&#39;t experience any problems... Please comment if you encounter problems. Be specific and descriptive.\r<br />[center]--------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />[center][b]INSTALLATION[/b][/center]\r<br />Like ANY mod, PLEASE, make a CLEAN SAVE for safety&#39;s sake.. BEFORE installing this mod. This is to ensure you do not lose your save file if this mod ever (I doubt it) breaks your game.\r<br />\r<br />(1) Once you have downloaded the original mod HERE: http://skyrim.nexusmods.com/mods/17354\r<br />\r<br />OR\r<br />\r<br />Downloaded the meshes/textures from the optional download (UNP Non Nude version)\r<br />\r<br />(2) Unzip the files and extract the &#39;esp&#39;, BSA and meshes/textures to the Skyrim Data Folder.\r<br />\r<br />[i]NOTE: Meshes/Textures are shared by both the original and this version. Installing say.. UNP Non Nude will affect the original IF installed as well. Also &#39;BSA&#39; simply is a packaged version of the required files. The BSA contains all the scripts to alleviate the hassle of going through and removing every script associated with the mod. Trust me its worth it, there&#39;s +50 scripts...[/i]\r<br />\r<br />[center][b]UNINSTALLATION[/b][/center]\r<br />\r<br />First UNLOAD the mod, make sure you grab everything you have from Ria In-Game DISMISS her.. SAVE, exit then delete ESP file AND the following:\r<br />\r<br />Data&#92;textures&#92;actors&#92;character&#92;RiaBody\r<br />Data&#92;textures&#92;actors&#92;character&#92;FaceGenData&#92;FaceGeom&#92;Companion_Ria.esp\r<br />Data&#92;meshes&#92;actors&#92;character&#92;RiaBody\r<br />Data&#92;meshes&#92;actors&#92;character&#92;FaceGenData&#92;FaceTint&#92;Companion_Ria.esp\r<br />\r<br />NOTE: I will soon post a list of script files that are part of this mod which can be removed for those using unpacked versions. No scripts will be/should be running after uninstallation since they are associated with the dialogue itself, with the mod removed the scripts will be removed from your save. I HIGHLY recommend you use the BSA version. Unpacked versions will only be avaliable when asked.\r<br />\r<br />Open up game and make a CLEAN SAVE. DONE\r<br />[center]--------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />[b]MOD VERSIONS[/b]\r<br />\r<br />1.6Alpha\r<br />- Gifts option removed due to major bug\r<br />- Unique Greetings + Some Location based Greetings (Holds only for now)\r<br />- SEQ file generated\r<br />\r<br />1.53Alpha\r<br />- More food types added to give to Ria\r<br />- Comments on current weather through random dialogue\r<br />- Changed Ria&#39;s class from 2H to 1H\r<br />\r<br />1.52AlphaFIXED\r<br />- Fixed &#34;Gift&#34; Interaction topic which would not display. It should display correctly.\r<br />- Added a bit more variety/random responses within the &#39;Gift Interaction&#39; part of the dialogue.\r<br />\r<br />1.52Alpha\r<br />- Introduces a NEW form of interaction where the player is now able to give Ria gifts. Options are: Food, Soup and Drinks. More will be introduced later.\r<br />- Dialogue fixes\r<br />- Tweaks here and there for improvements \r<br />\r<br />1.51Alpha\r<br />- Fixed a serious bug for players playing a breton, where mounted combat would deal no damage. This bug was carried over from the original Companion Ria.\r<br />\r<br />1.5Alpha\r<br />*Primarily more dialogue\r<br />- New random topics depending on which city you&#39;re in. Cities done includes: Solitude, Riften, Windhelm and Whiterun for now. More topics about Skyrim in general.\r<br />- Neck Seam Fix: thanks to &#39;vroix&#39; for finding a fix&#33;\r<br />- More trivial comments\r<br />- Random mini talks and conversations, not too long but still fun/good interaction\r<br />- More heavy lore topics which arent commonly discussed in the actual full fledged games: Battlespire, ES Adventures Redguard and Stormhold?\r<br />- Fixes for spelling mistakes\r<br />- Tweaks to multiple existing dialogue, make it flow/sound better.\r<br />\r<br />1.4Alpha\r<br />- Ria can now heal you if you ask her. UNLOCKED through dialogue.\r<br />\r<br />1.35Alpha\r<br />- A fair few dialogue added to Ria&#39;s ever expanding dialogue base\r<br />- Random gifts in the form of potions and other items through her random dialogue\r<br />\r<br />1.3Alpha\r<br />- Hopefully the Intro Dialogue Bug is gone. Uploaded necessary Script files\r<br />- New Dialogue (Random chats + Random topics)\r<br />- Fixed more grammer\r<br />\r<br />1.2Alpha\r<br />- Completely removed intro dialogue\r<br />- Recruitable from the start (with unique dialogue)\r<br />** Will rebuild the intro dialogue and parameters from scratch.\r<br />\r<br />1.1Alpha \r<br />- Added more random dialogue topics\r<br />- Renamed file\r<br />- Two versions (Temp fix): One version has Ria recruitable from the start\r<br />\r<br />1.0Alpha \r<br />- Initial Release\r<br />\r<br />[b]CREDITS[/b]\r<br />The ORIGINAL Companion Ria by gilgoon:\r<br />http://skyrim.nexusmods.com/mods/17354\r<br />** Many thanks to the modder for making a great looking companion.\r<br />** REQUIRED - Meshes and Textures from his mod MUST be downloaded for this mod to work...\r<br />NOTE: Non Nude UNP Alternatives are available as an optional download. All meshes/textures required are in this package as such, the original is not needed if this is download.\r<br />\r<br />Credits to mods which made gilgoon&#39;s work possible:\r<br />\r<br />Yaksha Race - http://skyrim.nexusmods.com/downloads/file.php?id=10042\r<br />\r<br />DIMONIZED UNP female body by &#39;dimon99&#39;- http://skyrim.nexusmods.com/downloads/file.php?id=6709\r<br />\r<br />Calientes Female Body Mod Big Bottom Edition - http://skyrim.nexusmods.com/downloads/file.php?id=2666\r<br />\r<br />RANs HeadMesh Variants - http://skyrim.nexusmods.com/downloads/file.php?id=7127\r<br />univision Face - http://skyrim.nexusmods.com/downloads/file.php?id=14569\r<br />renhair - http://cafe.naver.com/elderscrolls7/461761\r<br />\r<br />BIG thankyou to &#39;gasti89&#39; for guiding me through on scripting/dialogue and CK jargen to make Ria able to heal the player&#33; Much appreciated and my thanks goes to him for continually helping me with my ignorant but expanding knowledge of CK :)\r<br />\r<br />Ah and thanks to the lot of you who have commented and provided feedback and testing, pointing out problems :)\r<br />\r<br />[center][img]http://i.imgur.com/c78Ug.jpg[/img][/center]\r<br />[center]Be sure to check out my latest companion mod featuring Arweden&#33;[/center] \r<br />\r<br />[center]+750 Dialogue plus other features. This mod adds a companion with her own backstory, character and personality. Features commentaries and location based dialogues WIP.[/center] \r<br />\r<br />[center]http://skyrim.nexusmods.com/mods/28081/[/center]",
  "categoryId": "66",
  "version": "v1.6Alpha",
  "author": "Scannerlegend aka Didact01",
  "createdUnix": "1341532118",
  "updatedUnix": "1355623826",
  "containsAdultContent": false,
  "uploadedBy": "ScannerLegend",
  "primaryFile": null,
  "files": [
    {
      "fileId": "75091",
      "name": "CompanionRia_REVISED_v1dot4_Alpha_BSA Version",
      "version": "1.4Alpha",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "107",
      "fileName": "CompanionRia_REVISED_v1dot4_Alpha_BSA Version-19983-1-4Alpha.rar",
      "uploadedUnix": "1342613700",
      "modVersion": "1.4Alpha",
      "virusScanUrl": "https://www.virustotal.com/file/9bfe79c4a97585bc1b298973016d9e0145878caeead7ed6b7ca0a0a637f89ded/analysis/1407030964/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CompanionRia_REVISED_v1dot4_Alpha_BSA%20Version-19983-1-4Alpha.rar?fid=75091&ttl=1535787829&ri=8192&rs=8192&setec=c82a7ae5c7ff67182fc4fe2ce8c7de74"
    },
    {
      "fileId": "75094",
      "name": "CompanionRia_REVISED_v1dot4_Alpha_Unpacked Version",
      "version": "1.4Alpha",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "149",
      "fileName": "CompanionRia_REVISED_v1dot4_Alpha_Unpacked Version-19983-1-4Alpha.rar",
      "uploadedUnix": "1342613806",
      "modVersion": "1.4Alpha",
      "virusScanUrl": "https://www.virustotal.com/file/9f09c9858b810a85c482bf823005e4d43b384aaf7b3e5dee3d24edff2ea0c884/analysis/1407031023/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CompanionRia_REVISED_v1dot4_Alpha_Unpacked%20Version-19983-1-4Alpha.rar?fid=75094&ttl=1535787830&ri=8192&rs=8192&setec=5c1357e053631feec5f75c230aa989b7"
    },
    {
      "fileId": "76865",
      "name": "CompanionRia_REVISED_1dot5Alpha",
      "version": "1.5Alpha",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "439",
      "fileName": "CompanionRia_REVISED_1dot5Alpha-19983-1-5Alpha.rar",
      "uploadedUnix": "1343392084",
      "modVersion": "1.5Alpha",
      "virusScanUrl": "https://www.virustotal.com/file/021cbf30d6913b84c953f146e62f6d01b3c34f368ae45cc57740b5ab24b6fcbd/analysis/1407049025/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CompanionRia_REVISED_1dot5Alpha-19983-1-5Alpha.rar?fid=76865&ttl=1535787831&ri=8192&rs=8192&setec=1f5aaed4c06bc7894f371e84328c4ef2"
    },
    {
      "fileId": "76985",
      "name": "CompanionRia_REVISED_1dot51Alpha_BSAversion",
      "version": "1.51Alpha",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "439",
      "fileName": "CompanionRia_REVISED_1dot51Alpha_BSAversion-19983-1-51Alpha.rar",
      "uploadedUnix": "1343430429",
      "modVersion": "1.51Alpha",
      "virusScanUrl": "https://www.virustotal.com/file/dc7f1108ac67340ddb9146a042d5a8488a2166f769e48fe99f9153d5006a5137/analysis/1407050584/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CompanionRia_REVISED_1dot51Alpha_BSAversion-19983-1-51Alpha.rar?fid=76985&ttl=1535787831&ri=8192&rs=8192&setec=5fd244dab8d5bf47e35c9ada0ea75621"
    },
    {
      "fileId": "78146",
      "name": "CompanionRia_MeshesandTextures_UNP_NonNudeNude",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "21430",
      "fileName": "CompanionRia_MeshesandTextures_UNP_NonNudeNude-19983-1-0.rar",
      "uploadedUnix": "1343864431",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e62fa9e4695b64b1e57f01dda93e363be8c6c3bf7cfbecf8163f288a71de5891/analysis/1407062720/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CompanionRia_MeshesandTextures_UNP_NonNudeNude-19983-1-0.rar?fid=78146&ttl=1535787832&ri=8192&rs=8192&setec=cfb83618a587da8ccc452ccea79c775b"
    },
    {
      "fileId": "78895",
      "name": "CompanionRia_REVISED_v1dot52Alpha_BSA_version",
      "version": "v1.52Alpha",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "250",
      "fileName": "CompanionRia_REVISED_v1dot52Alpha_BSA_version-19983-v1-52Alpha.rar",
      "uploadedUnix": "1344148121",
      "modVersion": "v1.52Alpha",
      "virusScanUrl": "https://www.virustotal.com/file/85634d99e807f0841b7d63240faa475c916b5ad704322c1a273392e1c018ec2c/analysis/1407070985/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CompanionRia_REVISED_v1dot52Alpha_BSA_version-19983-v1-52Alpha.rar?fid=78895&ttl=1535787832&ri=8192&rs=8192&setec=6d8951acc2462518b636ebc58a3a2e3f"
    },
    {
      "fileId": "78947",
      "name": "CompanionRia_REVISED_1dot52AlphaFIXED_BSAversion",
      "version": "1.52Alpha",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "152",
      "fileName": "CompanionRia_REVISED_1dot52AlphaFIXED_BSAversion-19983-1-52Alpha.rar",
      "uploadedUnix": "1344165420",
      "modVersion": "1.52Alpha",
      "virusScanUrl": "https://www.virustotal.com/file/bc9c951f4ff98e325214e3451660ae68048306d7ccd1fefec60df982ab100cfc/analysis/1407071407/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CompanionRia_REVISED_1dot52AlphaFIXED_BSAversion-19983-1-52Alpha.rar?fid=78947&ttl=1535787832&ri=8192&rs=8192&setec=cda40c321f17e6600222260dd32f6be9"
    },
    {
      "fileId": "81617",
      "name": "CompanionRia_REVISED_1dot53Alpha - BSA version",
      "version": "1.53Alpha",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20433",
      "fileName": "CompanionRia_REVISED_1dot53Alpha - BSA version-19983-1-53Alpha.rar",
      "uploadedUnix": "1344979177",
      "modVersion": "1.53Alpha",
      "virusScanUrl": "https://www.virustotal.com/file/40cec467c0011788ed685c0a9b0b5b39e1868e9a1d76e8a3940979f2bfe3c348/analysis/1407096984/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CompanionRia_REVISED_1dot53Alpha%20-%20BSA%20version-19983-1-53Alpha.rar?fid=81617&ttl=1535787833&ri=8192&rs=8192&setec=5b3eb6b7e364b228aa95f950ca3207da"
    },
    {
      "fileId": "105438",
      "name": "CompanionRia_REVISED_1dot6Alpha - BSA version ",
      "version": "V1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20910",
      "fileName": "CompanionRia_REVISED_1dot6Alpha - BSA version -19983-V1-6.rar",
      "uploadedUnix": "1355623826",
      "modVersion": "V1.6",
      "virusScanUrl": "https://www.virustotal.com/file/3ea336a94ab3622faa29a6c3a3b8870c9f2b2b7aa8df64437592e8736aaecfda/analysis/1407306483/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CompanionRia_REVISED_1dot6Alpha%20-%20BSA%20version%20-19983-V1-6.rar?fid=105438&ttl=1535787834&ri=8192&rs=8192&setec=5690ac30d739dda211bbb972d705e646"
    }
  ]
}