{
  "modId": 20045.0,
  "modName": "Star Wars Imperial Credits",
  "summary": "This mod will replace the textures for the gold coins and the coin purses. It will also rename the gold coins to \\\"Imperial Credits\\\" and the coin purses to \\\"Credit Pouch\\\".",
  "descriptionHtml": "Star Wars Imperial Credits\r\n\r\nby: avenger86\r\n\r\n\\\"Information is a commodity. It can be traded, sold, and purchased. And in the end, credits are only as useful as the secrets they can buy.\\\"\r\n-Darth Bane\r\n\r\n\r\nThis mod will replace the textures for the gold coins and the coin purses. It will also rename the gold coins to \\\"Imperial Credits\\\" and the coin purses to \\\"Credit Pouch\\\". These are the coins used by the Empire  and most of the galaxy in Star Wars lore. Here\\'s a qoute taken directly from the Star Wars Wikia about Imperial Credits: \r\n\r\n\\\"The Empire continued to use the credit, now called the Imperial Credit, as its main currency, and during the reign of Emperor Palpatine, there were few who would not accept it. Even the Alliance to Restore the Republic used it, along with their own Alliance Credit, as it was the most used and easiest-to-use currency in the galaxy. Imperial credits existed in coins and chits of varying denominations: 0.1, 0.2, 0.5, 1, 2, 5, 10, 20, 50, 100, 200, 500, 1000, 2000 and 5000. While larger denominations coins existed, they weren\\'t widely circulated throughout the galaxy.\\\"\r\n\r\n\r\n\r\nINSTALLATION:::::::\r\n\r\nThis mod is NOT nmm ready, as I do not currently know how do so. I\\'m not even sure I wanna learn. I do love NMM, but as I don\\'t really upload many mods, I don\\'t really want to take the time to learn how to make them NMM ready. \r\n\r\nJust unzip and drop the Data folder into your Skyrim folder and override when asked to do so. Make sure to check the .esp before starting your game.\r\n\r\n\r\n\r\nUNINSTALL:::::::\r\n\r\nOpen up your Skyrim Data folder and go into textures and then clutter and remove coin01, coin01_n  and moneybag01\r\nAlso delete the Star Wars Imperial Credits Pics folder and the Star Wars Imperial Credits.esp\r\n\r\n\r\n\r\nPERMISSIONS:::::::\r\n\r\nIf you want to use my work in any of your stuff, please give me credit for what I\\'ve done ;-)\r\n\r\n\r\n\r\nCREDITS:::::::heehee...\r\n\r\nNexus User Linkxp500 - (For leaving a comment on my Star Wars Galactic Credit Gold Coin Re-texture mod, which lead to me further researching Star \r\nWars Credits and creating a new coin replacer.)\r\n\r\nLucas Arts for Star Wars\r\n\r\nStar Wars Wikia for the pics and info on the Imperial Credits\r\n\r\nBethesda for Skyrim\r\n\r\nskyrimnexus for allowing me to share my mods with the world",
  "categoryId": "29",
  "version": "1.0",
  "author": "avenger86",
  "createdUnix": "1341640102",
  "updatedUnix": "1341640186",
  "containsAdultContent": false,
  "uploadedBy": "avenger86",
  "primaryFile": null,
  "files": [
    {
      "fileId": "72712",
      "name": "Star Wars Imperial Credits",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2812",
      "fileName": "Star Wars Imperial Credits-20045-1-0.zip",
      "uploadedUnix": "1341640186",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fe3320a4d0ac2a47f9e3f74756aac15497086dbc5a21e0c3f3b9601def5554ad/analysis/1407006964/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Star%20Wars%20Imperial%20Credits-20045-1-0.zip?fid=72712&ttl=1535787942&ri=8192&rs=8192&setec=05ae18a3f02af108fc1397e52ef73bc1"
    }
  ]
}