{
  "modId": 20139.0,
  "modName": "KaellenManor",
  "summary": "This is my first project. I am very proud of him, I have raised him with great affection. Now I share with you. This is a project rich in detail. The mansion has everything you need to make them great warriors in Skyrim.",
  "descriptionHtml": "Title: Kaellen\\'s Manor \r\nVersion Skyrim: 1.5 or better (not tested in earlier versions)\r\nStyle Character: all players, but better for Arch-Mage and Warrior (Paladin)\r\n----------------------------------------------------------------------------------------------------------\r\n\r\nUpdate: 08/25 2012 - This new version updated version fixes some bugs in Kaellen Manor inconvenience. A replacement is needed. Please, download again and replace the previous file for your comfort.\r\n\r\na) what has been fixed: the disappearance of a bookcase game when KaellenManor is activated. There are approximately sixty bookcases of this type in the game, so the correction is required.\r\n\r\nb) added items: some visual improvements in the domestic scenario. Every extruded inner house, placement of furniture and etc have not changed.\r\n\r\nNote: before subscribing to the previous file, I advise you to save your rare items and achievements in other playhome. For precaution.\r\n\r\nTo use this modifier: delete the file to KaellenManor contained in the Data folder of the game and copy the new version there, or rename KaellenManorBugFixed to KaellenManor like, and subscribe the old file by copying it to the folder play date.\r\n--------------------------------------------------------------------------------------------------------------------------------\r\n\r\nUpdate: 08/23 2012 - \r\n\r\nI apologize to all Nexus users who downloaded this modifier and they are having trouble using this.\r\n\r\nI removed the file donwload area until the solution of the problem pointed out by greyroyce. The solution to the problem I encountered so far, unfortunately, is limited and unsatisfactory, since fixed the bug only in Breezehome and ProudspireHome (Solitude).\r\n\r\nThank you and sorry for the inconvenience. (I hope I have made ??myself understood with my bad english).\r\n\r\n-----------------------------------------------------------------------------------------------------------------------------------\r\n\r\nInitially, forgive me my bad English. Often, it\\'s Google-Inglish. However, I will try to be as clear as possible. In this project, I have two others that will soon be publishing here, which are in final testing. A Cathedral for a character dedicated exclusively to magic and a farm for hunters, with direct hunting seasons.\r\n\r\nKaellenManor is my first project. Used as a base, or reference, the castle Whiterun, Drangonreach. I made some changes, obviously. It would be impossible not to do so. However, I kept the backbone of the throne room almost intact - just doubled the length of the hall, canceled access to the basement, kitchen and eliminated the office of Farangar and redid the whole back to the throne, where the suite. I also added an extra output, beside the throne, to the outside.\r\n\r\nKaellen\\'s Manor meets the specific needs of a player character with the skills and barbarous Arch-mage, or Warrior, or Paladin: use of magic and enchanted weapons at the same time. This is kind of my favorite character. So I built the Kaellen\\'s Manor with these characteristics: magic and strength.\r\n\r\nThis duality can be seen in the type of lighting that I adopted for the house. Heat and cold, warm and cool colors, contrasts between fire and ice, or water and fire, for example. These are very common in this project. In all rooms of the house you can see such a contrast. In the Throne Room, on the one hand we have the warrior, and beside this, the forge, on the other hand, the magician, and the side of the laboratory of alchemy and enchantment. Two opposing forces, hot and cold, which unite to form a single hero or heroine.\r\n\r\nThe house, or mansion, or manor, if you will, has the following configuration:\r\n\r\n1) Hall of Fame: Where are the dummies (many manikins) and racks for weapons;\r\n2) the Throne Room: this part is truly luxurious, with many plants, statues, stones, insects and even a Viking ship ... Special effects and the throne, certainly.\r\n3) Office and Laboratory: where was the office of the Farangar, now turned into a decent office with a beautiful library and laboratory Alchemy and Enchantment.\r\n4) Blacksmith: Forging is where was the kitchen. There you will find everything necessary to make their weapons and armor.\r\n5) Room with pool: Climbing the stairs, behind the throne, is a suite. A large and beautiful suite with a pool and a few mannequins.\r\n6) Containers: I worried much about this detail. All scenarios of the mansion have a generous amount of chests for all tastes. You will not be wondering where to store their weapons or armor, or even their relics and achievements.\r\n\r\nThe exterior also has some modifications to the original model. The extruded base is preserved, except for some additions that I appreciated that the original design, but without undermining the basic requirements of my project. I tried to fix the mansion in an easily accessible area, near the city of Whiterun. It is visible on the map, and you can easily move there.\r\n\r\nNote: Currently I have over 200 modifiers installed on my Skyrim. Kaellen\\'s Manor showed no incompatibility with any of these, but can not guarantee that there is any inconsistency with any modifier you have and I have not yet tried.\r\n\r\nSome improvements seen in the images of the project as \\\"Sexy Whiterun\\\", for example, due to the fact that such modifiers are currently installed in my game, however, are not necessary for my work modifier. Vanilla mode is fully compatible with this project.\r\n\r\nThe configuration of my computer, where I\\'m playing Skyrim, is:\r\nOperating System: MS Windows XP Professional SP3 32-bit;\r\nMemory card: 4.00 GB Dual-Channel DDR2 @ 334MHz;\r\nMotherboard: ASUSTeK Computer Inc.. P5KPL-AM (Socket 775);\r\nGraphics Card: GeForce GTX 550 Ti (EVGA);\r\nHard Drive: FUJITSU MAXTOR STM3320613AS 320GB (SATA);\r\n\r\nThe configuration of my Skyrim is High, and without FSAA turned on without any modifier type EBN. With these settings, Kaellen\\'s Manor works perfectly, without any apparent problem.\r\n\r\nOne final note: If you liked my project, please comment. And keep the credits relate. I did the best job you can have the best fun.\r\n\r\nThanks for Kaellen\\'s Manor enjoy.",
  "categoryId": "68",
  "version": "2a",
  "author": "sagonTHX",
  "createdUnix": "1341792661",
  "updatedUnix": "1345933255",
  "containsAdultContent": false,
  "uploadedBy": "sagonTHX",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84226",
      "name": "KaellenManorBugFixed",
      "version": "2a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "45",
      "fileName": "KaellenManorBugFixed-20139-2a.rar",
      "uploadedUnix": "1345933255",
      "modVersion": "2a",
      "virusScanUrl": "https://www.virustotal.com/file/47acd2c0bb2bba5ecf98ad815bc7170415ea5ce8966666b0ca9713ca10d323ae/analysis/1407121622/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/KaellenManorBugFixed-20139-2a.rar?fid=84226&ttl=1535788088&ri=8192&rs=8192&setec=afbcbdf767920459a8d9e7a50f31459e"
    }
  ]
}