{
  "modId": 20132.0,
  "modName": "Expert Level Frost Flames and Sparks Spells",
  "summary": "This mod simply adds higher damage yield versions of the Frost, Flames and Sparks spells. They can be purchased from Faralda at the College of Winterhold.",
  "descriptionHtml": "I really liked using the Frost, Flames and Sparks spells when I started playing Skyrim. Unfortunately, those spells become completely useless by around level 10 or so (maybe earlier). So, in order to use them at higher levels, I\\'ve created some higher level versions of the spells called Inferno, Lightning, and Freeze. The base damage of these spells is 40, and they are Expert level Destruction spells.\r\n\r\nThe spells can be purchased from Faralda at the College of Winterhold (like all Expert level  Destruction spells).\r\n\r\nDISCLAIMER: Yes, I realize this is an exceedingly simple mod to make. I was honestly just using this for myself, but a few of my friends requested it, and this is the easiest way of sharing it.\r\n\r\nKNOWN BUG: For some reason, the spells will show up in your magic menu as Novice spells. However, the game treats them as Expert level spells (the casting cost only halves if you have the Expert Destruction perk). I\\'ve tried several ways to change this, including creating the effect from scratch, but the result is always the same. On the bright side, it\\'s only cosmetic.",
  "categoryId": "75",
  "version": "0.9",
  "author": "Raghast",
  "createdUnix": "1341774923",
  "updatedUnix": "1341777472",
  "containsAdultContent": false,
  "uploadedBy": "Raghast",
  "primaryFile": null,
  "files": [
    {
      "fileId": "73010",
      "name": "Expert Level Frost Flames and Sparks Spells",
      "version": "0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Expert Level Frost Flames and Sparks Spells-20132-0-9.7z",
      "uploadedUnix": "1341777472",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/acf6c5d8058c0fccc8f6010b26fac097635720fd1a96439033b42e9c48f201fe/analysis/1407010262/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Expert%20Level%20Frost%20Flames%20and%20Sparks%20Spells-20132-0-9.7z?fid=73010&ttl=1535788079&ri=8192&rs=8192&setec=992f115ae7392e41b1da41f4cf497eb6"
    }
  ]
}