{
  "modId": 20158.0,
  "modName": "Sexier Housecarls - All Girls",
  "summary": "The two male housecarls have been changed to female (Annie and Nicolette) and a complete makeover of Lydia, Iona and Jordis.  A single esp for all five girls.  Optional esp for each is available too.  Feminine stances, improved ai, auto-level with player to 81, Lydia\\'s marriage bug fixed, subtle but attractive make-up.  *Vanilla option available.*",
  "descriptionHtml": "Sexier Housecarls- (Female) V2.1\r\n\r\nAuthor: Laurynn \r\n\r\n~~~~UPDATE 11/5/2012~~~~\r\n\r\nI will be doing another version of this mod soon that is standalone (no mods required) and more \\\"lore-friendly\\\".  My ideas behind what fits in Skyrim have changed a bit since making this four months ago.  They\\'ll still be beautiful ladies- but they probably won\\'t be as glam.  I do plan to leave this mod up for people who do like this look as I fully support people being able to play Skyrim their own way and for their own personal enjoyment.  So Enjoy! :)\r\n\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\n\r\nDownload includes:\r\n============================ \r\n\r\n1. The two male housecarls, Argis and Calder, have been replaced with two female versions: Annie (Markarth) and Nicolette (Windhlem).  I\\'ve also made them all essential as well as autoleveling with the player until level 81 (soft cap). \r\n\r\n2. AI Packages have been updated so housecarls will freely roam the house as well as eat and sleep.  Lydia *should* be downstairs now and not in your bedroom. :)\r\n\r\n3. All faces have custom makeup and custom hair colors.  Anyway,  all esps have been packed with the appropriate files to avoid the infamous \\\"brown face\\\" bug from the CK. \r\n\r\n4. All housecarls have been made to be less... \\\"butch\\\".  They all have fem stances now, have clean looking hair and wear subtle but lore friendly make-up.  Okay, maybe not the lip gloss...  Sue me. ;)  It\\'s optional anyway.  If you want it, I have it in the links below.  Btw, the fem stance really works best if you have a fem idle replacer already such as [url=http://skyrim.nexusmods.com/mods/11954] Pretty Idles [/url] - but not necessary.   \r\n\r\n5. Iona\\'s voice has also been replaced with the \\\"youngfemale\\\" type- the assertive one just didn\\'t fit with someone who looks about twenty. :)\r\n\r\n6. Coming soon!!  Sexier *Male* Housecarls. AND....Sexy Skyrim NPCs by Laurynn. A massive npc overhaul  in ONE Esp. *^.^* No more 57 individual npc esp\\'s hogging up your mod slots.  Individuals will still be available as well.\r\n\r\n\r\n\r\nInstallation:\r\n==============================\r\nSkyrim patch 1.6 or greater required.\r\n\r\nApachii Hair required for all except vanilla version.  Link provided below.\r\n\r\n\r\n*******Vanilla hair version available as well.  See Options.*********\r\n\r\nNexus Mod Manager:\r\n===================== \r\n\r\nUse the \\\"Download with Manager\\\" button at Skyrim Nexus and activate after download. \r\n\r\n\r\nManual:\r\n=====================\r\n\r\nDrop the SexierHousecarls.esp, textures and meshes folders into your Data folder.  Click yes when it asks you to merge.  If you have any other mods that modify housecarls, you will likely get a notice asking you to replace.\r\n\r\nActivate the .esp using a mod manager prior to playing Skyrim or make sure it\\'s \\\"ticked\\\" under DATA when the Skyrim play menu pops up.\r\n\r\nIf downloading a single esp- do the same as above with NMM.   If manual, drop the esp and bsa in your Data folder, activate and play.\r\n\r\n\r\n\r\n***Required Mods***\r\n===========================\r\n\r\nFor main files only:\r\n[url=http://skyrim.nexusmods.com/mods/10168] Apachii Hair[/url]\r\nDownload and install using one of the suggested methods. \r\n\r\n\r\n\r\nHIGHLY Recommended Mods:\r\n=========================\r\n\r\nTo get the results shown in the screenshots:\r\n\r\n***I highly recommend this version of Bella\\'s skin: [url=http://skyrim.nexusmods.com/mods/26113] Better Females Natural Edition [/url]  It cleans up the skin quite a bit and has a high res normal map.  Pick which ever makeup level suits your tastes.\r\n*[url=http://skyrim.nexusmods.com/mods/2812] Better Females by Bella [/url] if you are using another skin texture- at least download the eyebrows otherwise they may look strange.\r\n*[url=http://skyrim.nexusmods.com/mods/13722] Eyes of Beauty [/url] - Use NPC version.\r\n*[url=http://skyrim.nexusmods.com/mods/6709] UNP Body [/url]\r\n*[url=http://skyrim.nexusmods.com/mods/14899] UNP Blessed Body [/url] You can figure out what \\\"blessed\\\" means for yourselves :)\r\n*[url=http://skyrim.nexusmods.com/mods/13860]Lip Gloss for Better Females [/url] \r\n*[url=http://skyrim.nexusmods.com/mods/515] Freckles by Zhoken [/url] (to get Iona\\'s cute freckles)\r\n\r\nArmor mods shown above:\r\n[url=http://skyrim.nexusmods.com/mods/16050] Skimpy Armor for UNP by Fgem [/url]\r\n[url=http://skyrim.nexusmods.com/mods/9546] Ultra Skimpy Armor & Clothing by Nightasy [/url]\r\n\r\n\r\n\r\nOther body meshes/armors I recommend:\r\n[url=http://skyrim.nexusmods.com/mods/2666] CBBE Body Mesh [/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=3654] Killer Kleo\\'s Skimpy Armor for CBBE [/url]\r\n\r\n\r\n**FYI - You DO NOT need to have Bella\\'s face textures if \\\"glamazons\\\" aren\\'t your thing.  My mod will work with any face texture you have including Navetsea, Coverwomen, CBBE Facepack, Envision etc. **   The only required mod is Apachii hair. \r\n\r\nIf you want them to look exactly like the screenshots, you will need Bella\\'s.  I also designed around her mods, so no guarantee they will look as good with others. The next closest face retex to Bella\\'s overall \\\"look\\\", would be the CBBE facepack imo.  Just an fyi. \r\n\r\n\r\n\r\nOthers that are very popular that I\\'ve tried and also recommend if you prefer a more \\\"natural\\\" look:\r\n[url=http://skyrim.nexusmods.com/mods/3563] Coverwomen[/url]\r\n[url=http://skyrim.nexusmods.com/mods/6554] Navetsea[/url]\r\n\r\n\r\n\r\n\r\nCompatibility\r\n========================\r\n\r\n\r\nCompatible with any mod that doesn\\'t alter the housecarls\\' *appearance*.  \r\n\r\nThis is not compatible with Better Followers.  It won\\'t make your game crash or cause any save game issues and you can have both!  HOWEVER, you will have to decide what is more important to you regarding the housecarls.  Looks or functionality?\r\n\r\nEven though my housecarls have been given perks and auto-leveing, there are a few neat things BF gives you in their combat style.  If you load my mod after Better Followers, you will get the looks but not BF perks (this would only apply to the *housecarls*- BF will still work for all other followers).  If you load BF after my mod, it renders my mod useless.  It changes the looks back to vanilla and overrides all the perks I\\'ve given them- including the level cap.  I believe BF only levels to 50 while mine go to 81.\r\n\r\nAll other Companion mods seem to be fine.  \r\n\r\nI run over 120 mods and have had no conflicts other than what I mentioned with Better Followers.\r\n\r\n\r\n\r\nUninstall\r\n=========\r\n\r\nIf you used a mod management program, use it to uninstall. \r\n\r\nIf manual: delete sexierhousecarls.esp and the facegen files in the textures and meshes folders.\r\nThe exact path to find these files is:  \r\n\r\nData> textures> actors> character> facegendata> face tint> skyrim.esm (all housecarl files begin with A2 (ie: Lydia\\'s is A2c8e);. Delete the .tga and .dds files.  If you have nothing else in the folder but the housecarl files, you are safe to delete the whole folder.\r\n\r\nData> Meshes> actors> character> facegendata> facegeom> skyrim.esm (same as above). Delete the .nif files.\r\n\r\nIf uninstalling a single file, just delete the esp and bsa from your Data folder.\r\n\r\n\r\n\r\nLoad Order\r\n==========\r\n\r\nLoad order *shouldn\\'t* make a difference for this mod.  If it greatly concerns you, use BOSS. \r\n\r\nLoading early should be fine.  If one, or all of them are unchanged, try dropping it lower.  If there happens to be an issue with a companion mod (like UFO), make sure this is loaded AFTER it.  I use UFO though and haven\\'t had any issues.\r\n \r\n\r\n\r\nKnown Issues\r\n============\r\n\r\n1. If you have already encountered one or more of the housecarls in your game, their male stance may not change when loading in this mod.  Unfortunately and I don\\'t know why it works this way, but that stance is now in your \\\"save\\\".  It\\'s recommended to start a new game with this mod loaded and it will be fine.  \r\nIf you\\'re too far into game to bother with that, there is a fix for it provided by JackTThompson but PLEASE BACK UP your save before attempting anything.  This shouldn\\'t harm anything but Skyrim is temperamental and you never know.  Better to be safe than sorry.  I will not be held responsible if *you* screw up your save for not heeding this advice.\r\n\r\nTo fix the stance in save game courtesy of JackTThompson: \r\n\r\nTo change the stance for characters you have already met, dismiss them (take all equipment first), wait for them to go in their house, you stand outside and open the console, type pcb, then type fcf, then type hlp pluginname (in this case type hlp Sexier Housecarls). Go inside the house. The stance should be fixed according to whatever the plugin had. This worked for me for Lydia and Iona who I had already met.\r\n\r\nI believe there is a possible dialogue bug side effect where entries will show up as duplicates if you have quests from a previous Skyrim version (1.6). So if that annoys you, then I wouldn\\'t try this. If you don\\'t care and the butch stance bothers you more, then give it a shot. \r\n\r\n\r\nRevision History/Change log\r\n==========================\r\n\r\nVersion 2.1 - Fixed the hair clipping through helmet bug in v2.  Also fixed Lydia\\'s marriage bug. (7.16.2012)\r\nVersion 2.0 - Eyes of Beauty reliance removed.  (7.15.2012)\r\nVanilla Version added (7.13.2012)\r\nVersion 1.0 - Initial release (7.8.2012)\r\n\r\n\r\n\r\n",
  "categoryId": "66",
  "version": "2.1",
  "author": "Laurynn",
  "createdUnix": "1341823555",
  "updatedUnix": "1341823555",
  "containsAdultContent": false,
  "uploadedBy": "lsinsocal",
  "primaryFile": null,
  "files": []
}