{
  "modId": 20184.0,
  "modName": "More Dynamic Injuries DV",
  "summary": "This is the german translation of More Dynamic Injuries mod by Thomas Kaira",
  "descriptionHtml": "Dies ist die deutsche Übersetzung der Mod \\\" More Dynamic Injuries\\\" von Thomas Kaira, die ein Verletzungssystem in Skyrim einfügt.\r\n\r\nDer Spieler kann in Kämpfen Knochenbrüche und Blutungen erleiden, oder gar Verbrennungen und Unterkühlungen einholen. Diese wollen anschließend behandelt werden. Der normale Heilzauber reicht nicht mehr, um vollständig zu genesen. Baue dir Schienen, um Brüche zu bahandeln! Lege erstellte Bandagen an, um deine Blutungen zu lindern, oder mixe Salben, um dich um deine Verbrennungen und Unterkühlungen zu kümmern. Anderenfalls könnten sich deine Wunden verschlimmern...\r\nDer Clou: Auch deine Begleiter können sich verletzen! Gib ihnen erstellte oder gekaufte medizinische Güter, damit sie sich und andere Begleiter im Notfall versorgen können! \r\n\r\nHier der Link zum Originalmod von Thomas Kaira: http://skyrim.nexusmods.com/mods/17987\r\nThanks for your permission to translate your fantastic mod! \r\nBitte gebt ihm ein Endorse, wenn euch die Mod gefällt! Alle Credits gehen an ihn.\r\n\r\nZum Spielen der deutschen Version dieser Mod wird das englische Original nicht benötigt.",
  "categoryId": "24",
  "version": "1.1.6",
  "author": "Pandur79",
  "createdUnix": "1341857855",
  "updatedUnix": "1341857910",
  "containsAdultContent": false,
  "uploadedBy": "Pandur79",
  "primaryFile": null,
  "files": [
    {
      "fileId": "73189",
      "name": "More_Dynamic_Injuries_DV",
      "version": "1.1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "74",
      "fileName": "More_Dynamic_Injuries_DV-20184-1-1-6.rar",
      "uploadedUnix": "1341857910",
      "modVersion": "1.1.6",
      "virusScanUrl": "https://www.virustotal.com/file/4ae4153888a5b03894d0f098d190a9a87ac7b5206b84236a705faff389546fb7/analysis/1407011885/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More_Dynamic_Injuries_DV-20184-1-1-6.rar?fid=73189&ttl=1535788145&ri=8192&rs=8192&setec=b2d2359e5c8be36203ee58eb19c7b08b"
    }
  ]
}