{
  "modId": 20193.0,
  "modName": "Sounds of Skyrim - Civilization",
  "summary": "Adds 223 new sound effects that are played in Skyrim\\'s cities, villages and small hamlets. Sounds include city activity (doors, children) , interior weather (thunderstorms) and tavern activity (shouts, crowd) and many more.",
  "descriptionHtml": "[color=yellow][size=\\\"10\\\"][center]Sounds of Skyrim - Civilization[/center][/size][/color]\r\n[center][b]Current Version 1.02 - 07/05/2013[/b][/center]\r\n\r\n[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/hXQSy.png[/img][/url][/center]\r\n\r\n\r\n[color=red][b]Quick notes:[/b][/color] [color=orange]- Civilization is now bloat-free! The infamous bug that was introduced in version 1.0 has been fixed for good. Whew! If you still have a savegame that uses Civilization 1.0, refer to the Technical section below to know how to install the newest updates.\r\n\r\n- Compatibility patches for several mods are now available. Look in the Technical section for information.[/color]\r\n\r\n\r\n[color=yellow][b]What does it do?[/b][/color]\r\n\r\nCivilization focuses on adding 223 new sound effects to cities, villages, farms and remote locations where civilization is present. In cities, you can hear the sound of a hammer being used by a villager repairing something, children playing, dogs barking or cats fighting. As you get closer to a tavern doorstep, the sounds of patron chatting from behind the door are played. When you get in, some patron may laugh out loud, yell or break something.\r\n\r\nOn farms or near them, you can hear the sounds of their animals, if they have any. Most of those sound effects can be heard inside buildings too, linking the interior cells with the exterior. If I take the farm example, you may hear the hen if you sit close to the window. If it’s raining, you’ll hear the rain hitting the windows; if there’s a snowstorm, you’ll hear the cold wind whistling by the windows.\r\n\r\nThere are more sound effects than what has been described above. Refer to the next sub-section to see the full list. \r\n\r\n\r\n\r\n[color=yellow][b]What is Sounds of Skyrim?[/b][/color]\r\n\r\nSounds of Skyrim is an audio project split in three parts that, in the end, adds around 460+ sound effects to the game world. It affects almost every cell and region in the game. My main goal is to not have one environment that is soundless to enhance immersion. The sounds are affected by the time of day, weather and location. So when walking in the city streets during the day, you\\'ll hear the echo of doors opening and closing, children playing and workers sawing things. While at night, cats fight for territory and dogs bark.\r\n\r\nAll three modules have been released and can be obtained on the website from where you downloaded this module.\r\n\r\n\r\n[color=yellow][b]Released Sounds of Skyrim modules[/b][/color]\r\n\r\n[u]The Dungeons[/u]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/8601/?]Download Page[/url]\r\n\r\nThe Dungeons includes 115+ sound effects to add life to the dungeons. The enemy type that inhabits a dungeon will make itself heard. At dungeons’ entrances, you also hear the exterior weather. If there’s a thunderstorm raging outside, you’ll hear the thunder rumbling in the fort or cave\r\n\r\nThere\\'s a standard sound set for each type of dungeon: Cave, Dwemer Ruins, Forts and Sewers. These sounds play in these dungeons regardless of who or what lives in it. To spice it up, dungeons inhabited by Falmer or the Undead have their own sound sets in addition to the standard ones. Undead dungeons have zombies and wraiths screaming or moaning. In Falmer dungeons, you\\'ll hear their occasional screams; a way of communicating with each other since they are nearly blind.\r\n\r\n\r\n\r\n[u]The Wilds[/u]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/10886/?]Download Page[/url]\r\n\r\nThe Wilds focuses on adding sound effects in Skyrim\\'s wilderness. With the 115 new sound effects, the purpose of The Wilds is to audibly enlarge Skyrim\\'s fauna with the addition of various animals, birds and insects that play according to weather, time of day and region. In the forests, for example, you\\'ll hear the sounds of foxes, deers and ravens. At night, you\\'ll hear wolves howling from far away or common loons calling others. In The Reach, you might hear the occasional mountain goat or hawk. \r\n\r\nIn addition to animals, The Wilds also adds rain-impact sounds on tents and wooden structures, sounds of rustling bushes to simulate the movements of small mammals that scatter away as you approach and sounds of calm water waves hitting wood on tree logs or structures that are partially submerged in water. \r\n\r\n\r\n[color=yellow][b]Trailers[/b][/color]\r\n\r\nI invite you to view and hear the video trailer that shows Civilization in action to get a better glimpse of what the sound additions are. Note that the sounds heard in the video are played more frequently and at a higher volume on purpose to show you the variety of sound effects and to easily distinguish them from the vanilla sounds. Note also that some sound effects have changed since then.\r\n\r\n\r\nFinally, this mod would never have been possible without the contribution of many sound recorders and artists from Freesound.org. There\\'s a file in the archive with the credits for everyone who made the sounds. A HUGE thanks to them, otherwise the sounds would not have been as high quality as they are. You can also view the credits in the Credits tab above.\r\n\r\n\r\n[color=yellow][b]Technical - Mod Compatibility[/b][/color]\r\n\r\nSome mods require a compatibility patch to work with Sounds of Skyrim – Civilization. You can find the patches on the mod’s download page. If you encounter a mod conflict that is not listed here, please let me know in the Forums tab. \r\n\r\nThe following is a list of mods known to be compatible or incompatible.\r\n\r\n[color=green]Compatible - No Patch Needed[/color]\r\nOpen Cities Skyrim\r\n\r\n[color=Orange]Compatible - Patch Required[/color]\r\nRealistic Lighting Overhaul\r\nSounds Propagation Overhaul\r\nRealistic Colors and Real Nights (RCRN)\r\nClimates of Tamriel\r\nClimates of Tamriel-Sounds\r\nClimates of Tamriel-WinterEdition\r\n\r\n\r\n\r\n[color=yellow][b]Technical - Upgrading Sounds of Skyrim - Civilization (Version 1.0 only)[/b][/color]\r\n\r\n[u]Upgrading from version 1.0[/u]\r\n\r\nIf you had a save that used Civilization’s 1.0 version and that was cursed with bloat introduced by the mod, there are two ways to rescue your game from the bloat:\r\n\r\n[u]Using Skyrim Script Extender (Recommended):[/u] \r\n- Download/Update Skyrim Script Extender from [url=http://skse.silverlock.org/]SKSE\\'s page.[/url]\r\n- Uninstall Sounds of Skyrim – Civilization\r\n- Open the console and type ClearInvalidRegistrations. You will see a message telling how many reports it found and removed. You must give it some time to work though, so play the game for a few minutes and make a new save.\r\n- If everything has been done correctly, you should notice that your new save weighs less than your previous one. (Only if your previous save had bloat from version 1.0, that is)\r\n- Install Sounds of Skyrim – Civilization as instructed above. No more bloat!\r\n\r\n[u]Manually (Script editing involved):[/u]\r\n-\tYou will find instructions provided by community modder Arthmoor [url=http://forums.bethsoft.com/topic/1423035-should-i-uninstall-sos-sounds-of-skyrim/?p=21961595] at this link.[/url]\r\nNote that you will need Notepad ++ and the knowledge of Papyrus to proceed. If you don’t, use Skyrim Script Extender instead. \r\n\r\n\r\n[color=yellow][b]FAQ[/b][/color]\r\n\r\n[b]Q: \\\"The sounds in the videos are too loud or/and the delay between them is too short.\\\"[/b]\r\nA: This was done in purpose in the videos. The higher volumes allows you to distinguish them from the default sounds and the frequency allows you to hear as many sounds as possible to give a nice preview of what the mod does. In the game, the volume is much lower and the sounds do not play frequently. \r\n\r\n[b]Q: \\\"I do not like \\\"that\\\" or \\\"this\\\" sound. What can I do?\\\"[/b]\r\nA: You have two options available to remove a sound or a group of sounds. First, there is a silent sound file in the mod\\'s sound folder that you can use to replace the sound effects you do not wish to hear. \r\n\r\nThere\\'s an in-game configuration utility that allows you to disable or re-enable groups of sounds.\r\n\r\n[b]Q: \\\"Does Sounds of Skyrim decreases performance?\\\"[/b]\r\nA: No. The way the new sounds play is the same way the game\\'s default sounds are played. ",
  "categoryId": "61",
  "version": "1.02",
  "author": "Cliffworms",
  "createdUnix": "1341865206",
  "updatedUnix": "1367956765",
  "containsAdultContent": false,
  "uploadedBy": "Cliffworms",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000028166",
      "name": "Sounds of Skyrim - Civilization 1_01 Full Version",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51802",
      "fileName": "Sounds of Skyrim - Civilization 1_01 Full Version-20193-1-01.zip",
      "uploadedUnix": "1367720992",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/2ad13b4e46fb33c11ae47c6f3b5a9b7df20ce4fe94fd59b6987c159f41c832b9/analysis/1407555348/",
      "changelogHtml": " Addition: Added 7 new easter egg sounds related to goats that can be heard in Falkreath and on some farms. <br/> \n Change: Changed the configuration script to launch only if the player has completed the tutorial quest (Unbound) and escaped Helgen. <br/> \n Change: Three thunder sound effects have been reworked. <br/> \n Bug Fix: Fixed the infamous bloating bug that occurred once the player encountered snoring NPCs. (Finally fixed&#33; Your save games will be fine from now on.) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sounds%20of%20Skyrim%20-%20Civilization%201_01%20Full%20Version-20193-1-01.zip?fid=1000028166&ttl=1535788159&ri=8192&rs=8192&setec=55a112c87a9c5d8f98f8c0ffc668cefe"
    },
    {
      "fileId": "1000028369",
      "name": "Sounds of Skyrim - Civilization 1_02 Update",
      "version": "1.02",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "209",
      "fileName": "Sounds of Skyrim - Civilization 1_02 Update-20193-1-02.zip",
      "uploadedUnix": "1367818209",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/5e552a5be7bbf8009998ae2b8e535d4bac164285e3874e35b7e8507616c48917/analysis/1407557347/",
      "changelogHtml": " Change: The configuration script’s initiation has been changed to support the Live Another Life mod. <br/> \n Bug Fixes: Cleaned dirty edits that escaped me before; including one that would create a tiny conflict with the two other SoS modules. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sounds%20of%20Skyrim%20-%20Civilization%201_02%20Update-20193-1-02.zip?fid=1000028369&ttl=1535788159&ri=8192&rs=8192&setec=50aa48e44e0b6698076faabf2d311851"
    },
    {
      "fileId": "1000028372",
      "name": "Sounds of Skyrim - Civilization 1_02 Full Version",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "51827",
      "fileName": "Sounds of Skyrim - Civilization 1_02 Full Version-20193-1-02.zip",
      "uploadedUnix": "1367818963",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/66a742cf78943d53a2c82269d06fd404dffa687b4d69d5beb92a97674241b8b3/analysis/1406242554/",
      "changelogHtml": " Change: The configuration script’s initiation has been changed to support the Live Another Life mod. <br/> \n Bug Fixes: Cleaned dirty edits that escaped me before; including one that would create a tiny conflict with the two other SoS modules. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sounds%20of%20Skyrim%20-%20Civilization%201_02%20Full%20Version-20193-1-02.zip?fid=1000028372&ttl=1535788160&ri=8192&rs=8192&setec=dc782c9e97af5ed73cb75daa783861d8"
    },
    {
      "fileId": "1000028680",
      "name": "Compatibility Patches",
      "version": "1.02",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "60",
      "fileName": "Compatibility Patches-20193-1-02.zip",
      "uploadedUnix": "1367956765",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/60908a0b3f8178d666424d09f3a83d370fe59b55926301f03dab768b632be3e7/analysis/1407559741/",
      "changelogHtml": " Change: The configuration script’s initiation has been changed to support the Live Another Life mod. <br/> \n Bug Fixes: Cleaned dirty edits that escaped me before; including one that would create a tiny conflict with the two other SoS modules. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Compatibility%20Patches-20193-1-02.zip?fid=1000028680&ttl=1535788160&ri=8192&rs=8192&setec=8caad1bff40df68c266cf5dcf8a16910"
    }
  ]
}