{
  "modId": 20243.0,
  "modName": "Shortswords for Skyrim - German",
  "summary": "Fügt Kurzschwerter dem Spiel hinzu. Perfekt für Spieler, die die Lücke zwischen Schwert und Doclh füllen wollen.\r\nDiese Mod beinhaltet 14 Verschiedene Kurzschwerter!",
  "descriptionHtml": "THIS IS ONLY THE GERMAN TRANSLATION OF THE MOD! Original [url=http://skyrim.nexusmods.com/mods/18585]Here[/url]\r\n\r\n=======Worum geht es?=======\r\n\r\nHast du schon die Kurzschwerter vermisst, die nach \\\"Oblivion\\\" verschwunden sind?\r\nOder suchst du nach einer Waffe, um die Lücke zwischen Dolch und Schwert zu füllen?\r\nDann ist das die Mod, die du suchst!\r\nDas Kurzschwert ist eine edle Waffe für jeden Assassinen, der eine Extra-Nahkampf-Waffe benötigt.\r\nAuch Zauberkrieger, Kampfmagier oder andere Hybrid-Kämpfer-Klassen, welche keine Schweren Waffen tragen können, werden diese Schwerter womöglich nützlich finden.\r\n\r\n=======Beschreibung=======\r\n\r\nDiese Mod beinhaltet 14 verschidene Kurzschwerter. Neben den \\\"Standarts\\\" Eisen, Stahl, Orkisch, Zwergen, Elfen, Vulkanglas, Ebenerz und Daedrisch, kann man unter anderem auch (Gewetzte) Draugr, Nordhelden, Silber, Himmelsschmiede und Kaiserliche Kurzschwerter finden.\r\nAlle Schwerter können an der Schmiede unter der jeweiligen Schmiedekategorie hergestellt werden.\r\nDie meisten können auch in Shops, auf NPC\\'s oder in Truhen gefunden werden.\r\n\r\nJedes Kurzschwert taucht außerdem auf dem selben Level auf, auf dem ein Normales Schwert vom selben Material auch auftaucht.(Eisenkurzschwerter können von Start an gefunden werden, während Ebenerz und Daedrisch seltener sind und nur sehr spät im Spiel gefunden werden können.)\r\nAlte Nordkurzschwerter können in der Hand von Draugrs und in Truhen gefunden werden.Sie sind um die 4x seltener als normale Draugrwaffen.\r\nKaiserliche Kurzschwerter können von Kaiserlichen Wachen benutzt werden. 1er in 4 Wachen wird ein Kurzschwer tragen.\r\nDie Silberkurzschwerte werden von der Silbernen Hand benutzt, sind aber auch seltener als normale Schwerter.\r\n\r\nIn der Statistik, sind Kurzschwerter so ziemlich zwischen Dolchen und Schwertern.\r\nSie sind leichter und schwingen schneller als normale Klingen, machen aber weniger Schaden und haben eine kürzere Reichweite.\r\nKurzschwerter schwingen 1.15x schneller als normale Schwerter (Dolche sind 1.3x schneller)\r\nAber Achtung! Kurzschwerter sind nicht so leise wie Dolche und man wird früher entdeckt.\r\n\r\nDie Kurzschwerter wurden aus verschieden Teilen der vorhandenen Dolche und Schwerter gemacht, um sicherzustellen, dass sie sich besser ins Spiel passen. \r\nAlle Kurzschwerter benutzen außerdem die Vanilla-Texturen. Wenn man also ein Texturenreplacer (z.B Offizielle HD Texturen) benutzt, werden diese auch auf die Kurzschwerter angewandt.\r\n\r\n=======Fähigkeiten und Skills=======\r\n\r\nKurzschwerter sind Einhandschwerter und nutzen deshalb den Einhandskill. Genau wie alle anderen Einhandwaffen, bestimmt dieser Wert, wieviel Schaden die Kurzschwerter machen.\r\nBenutzt man ein Kurzschwert, levelt es außerdem den Einhandskill. Aber Kurzschwerter zählen nicht als normale Schwerter; Sie zählen als Dolche.\r\nAlso welche Fähigkeiten beeinflussen das Schwert und welche nicht?\r\nKurze Antwort: Alle Fähigkeiten von denen Dolche profitieren, von denen profitieren auch Kurzschwerter!\r\n\r\nEinhändig:\r\n-die Klingenspezialist-Fähigkeit. Beeinflusst nur Schwerter. Dolche und Kurzschwerter bekommen keinen Profit.\r\n\r\nSchleichen:\r\n-Meuchelklinge. Erhöht den Schleichmultiplikator, beim Angreifen mit einem Kurzschwert.\r\n\r\n=======Installation=======\r\n\r\n1. Ladet euch die Orginalmod [url=http://skyrim.nexusmods.com/mods/18585]Hier[/url] runter.\r\n2. Ladet euch den Mainfile dort herunter.\r\n3. Verschiebt den Data Ordner des Originals in eurer Skyrimverzeichnis (da wo die TESV.exe ist).\r\n4. Sucht euch ein der Versionen hier aus.\r\n5. Verschiebt den Data Ordner in euer Skyrimverzeichnis. Überschreibt, falls gefragt.\r\n6. Aktiviert die ESP.\r\n7. Spaß haben\r\n\r\nNotiz: Mit der Main-Version erscheinen die Waffen auch auf Gegnern, Shops, Truhen. Mit der NoLvlList nicht.\r\n\r\n=======Changelog=======\r\n\r\nV 1.0\r\nInitial release\r\n\r\nV 2.0\r\nAdded shortswords to various leveled lists. They should show up in loot, in the hands of npc\\'s (mostly bandits) and in shops.\r\nIf you want to use these swords without them popping up into any leveld lists (for compatability reasons for example) there\\'s a seperate .esp you can use.\r\nShortswords use normal sword animations, but now count as daggers and benefit from the Backstab and Assassin\\'s Blade perks.\r\n\r\nV 2.1\r\nAdded 2 new swords! The Silver and Imperial shortsword.\r\nAlso most of the existing sword meshes were tweaked or changed. The swords are now a bit more bulky and longer. The Daedric shortsword was made again from scratch.\r\n\r\nV 2.2\r\n4 New swords! Draugr, Draugr Honed, Nord Hero and Skyforge Steel! Added to crafting and/or leveled lists.\r\nThe range of all sword has been increased slightly.\r\nIron sword mesh was tweaked.\r\n\r\n=======Credits=======\r\n\r\nPrivateEye - Für die Originalmod\r\n",
  "categoryId": "55",
  "version": "2.2",
  "author": "PrivateEye",
  "createdUnix": "1341939193",
  "updatedUnix": "1341939766",
  "containsAdultContent": false,
  "uploadedBy": "powerbenny1706",
  "primaryFile": null,
  "files": [
    {
      "fileId": "73445",
      "name": "Shortswords_main 2-2 German",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Shortswords_main 2-2 German-20243-2-2.7z",
      "uploadedUnix": "1341939716",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/f395e70ececf0397f3ee29b124c7b95077adb561494bf917114cb3e22f79d797/analysis/1407014287/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shortswords_main%202-2%20German-20243-2-2.7z?fid=73445&ttl=1535788267&ri=8192&rs=8192&setec=61f159839047ea14eb502c7af0e46eea"
    },
    {
      "fileId": "73446",
      "name": "Shortswords_NoLvlList 2-2 German",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Shortswords_NoLvlList 2-2 German-20243-2-2.7z",
      "uploadedUnix": "1341939766",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/2cc9d654471df56da3c7094ef6f1e0bef1a859228af385324802eb1ee7ac4e7b/analysis/1407014342/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shortswords_NoLvlList%202-2%20German-20243-2-2.7z?fid=73446&ttl=1535788268&ri=8192&rs=8192&setec=b2a94db76bd515135ae88a1aca57bc88"
    }
  ]
}