{
  "modId": 20240.0,
  "modName": "Weapons and Armor Fixes TRADUZIONE ITALIANA",
  "summary": "Traduzione italiana del file Weapons and Armor Fixes di Headbomb\r\nTHIS IS ONLY A TRANSLATION OF THE ORIGINAL MOD",
  "descriptionHtml": "[color=red][size=+2][center]NOTICE![/color][/size][/center]\r\n[color=red][size=+1][center]This is only a translation into Italian of the original mod. All credits go to the creator of the [url=http://skyrim.nexusmods.com/mods/4719]original mod[/url].\r\nSeveral Weapons and Armors have bad or inconsistent properties (e.g. Orcish Waraxe considered to be made of Iron, 2-Handed Sword considered a 1-Handed Sword for perks purposes, etc.). This mod (in theory) fixes them all.\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.[/color][/size][/center]\r\n[color=green][size=+5][center]UNA PRODUZIONE DRAGONBORN ITALIA[/color][/size][/center]\r\n\r\n[color=green][size=+1]DESCRIZIONE[/color][/size]\r\nMolte armi ed armature hanno proprietà sbagliate (es. asce da guerra orchesce considerate come di ferro, Spadoni considerati armi ad una mano da alcuni talenti, ecc.). Questa mod (in teoria) corregge tutti questi errori. \r\n\r\n[color=green][size=+1]INSTALLAZIONE[/color][/size]\r\n\r\n[size=+0.5][b]Automatica[/b][/size]\r\n[list]\r\n[*]Scaricate la mod originale utilizzando il NMM. Per fare ciò vi basterà cliccare sul pulsante \\\"Download with Manager\\\" nella sezione download. Una volta scaricato attivate la mod semplicemente cliccando due volte sul file che apparirà dopo il download nella scheda \\\"Mods\\\" del NMM.\r\n[*]Successivamente navigate fino alla pagina di Dragonborn Italia (il link è presente nella sezione \\\"mirror\\\" di questa pagina). Nella sezione download troverete il file italiano di WAF, scaricatelo ed installatelo semplicemente copiando i due file che trovate nell\\'archivio nella cartella Skyrim/Data. Vi verrà chiesto di sovrascrivere i precedenti file. Cliccate si ovviamente. \r\n[*]Finito!\r\n[b]NB.[/b]se non avete installato il file Weapons and Armor Fixes-Hacks originale allora non avrete bisogno nemmeno di quello tradotto. Semplicemente evitate di copiarlo nella cartella Skyrim/Data.[/list]\r\n[b]Disinstallazione[/b] - Per farlo dovete disattivare tramite il NMM la mod scaricata cliccandoci due volte nella scheda \\\"mods\\\" del NMM, oppure cliccando sul pulsante \\\"Deactivate the selected mod\\\" sulla sinistra.\r\n\r\n[size=+0.5][b]Manuale[/b][/size]\r\n[list]\r\n[*]Scaricate il file originale Weapons and Armor Fixes ed installatelo semplicemente copiando il contenuto dell\\'archivio nella vostra cartella Skyrim/Data.\r\n[*]Successivamente navigate fino alla pagina di Dragonborn Italia (il link è presente nella sezione \\\"mirror\\\" di questa pagina). Nella sezione download troverete il file italiano di WAF, scaricatelo ed installatelo semplicemente copiando i due file che trovate nell\\'archivio nella cartella Skyrim/Data. Vi verrà chiesto di sovrascrivere i precedenti file. Cliccate si ovviamente.\r\n[*]Finito!\r\n[b]NB.[/b]se non avete installato il file Weapons and Armor Fixes-Hacks originale allora non avrete bisogno nemmeno di quello tradotto. Semplicemente evitate di copiarlo nella cartella Skyrim/Data.[/list]\r\n[b]Disinstallazione[/b] - Per farlo semplicemente eliminate il file Weapons and Armor fixes.esp dalla cartella Data e, se l\\'avete installato, anche il file Weapons and Armor Fixes-Hacks.esp.\r\n\r\n\r\nTutti i meriti vanno ad [url=http://skyrim.nexusmods.com/users/812422]headbomb[/url] per la creazione di questa fantastica mod.\r\nAll credits go to [url=http://skyrim.nexusmods.com/users/812422]headbomb[/url] for the creation of this awesome mod.",
  "categoryId": "95",
  "version": "2.05",
  "author": "Demea",
  "createdUnix": "1341937229",
  "updatedUnix": "1341937229",
  "containsAdultContent": false,
  "uploadedBy": "Demea",
  "primaryFile": null,
  "files": []
}