{
  "modId": 20242.0,
  "modName": "Riverside Lodge with Sauna - German",
  "summary": "Übersetzung der Riverside Lodge von Lupus",
  "descriptionHtml": "This is a german translation from the original file from Lupus:\r\n[url=http://skyrim.nexusmods.com/mods/14308]Riverside Lodge with Sauna[/url]\r\n\r\nIf you want the english version, please go to his mod site. Big Thanks to Lupus for allowing me to translate his mod und upload it here.\r\n\r\nThe following text will be for my german fellows.\r\n\r\n\r\nIch habe lange auf eine Übersetzung dieses Spielerhauses gewartet, aber es kam nie eine. Daher habe ich eben selbst etwas Zeit investiert und dieses großartige Spielerhaus übersetzt.\r\nHerzlich Willkommen auf dem Flusswald Landgut mit Sauna.\r\n\r\n[u]ORT:[/u]\r\nWenn man von Flusswald nach Weißlauf geht, kann man es eigentlich nicht verfehlen.\r\nDer Schlüssel ist in der Kiste in der Nähe der Haustür.\r\n\r\n[u]Empfohlene Mods:[/u]\r\nKeine sind wirklich notwendig um die Mod zu spielen, aber vereinfachen einem das Leben.\r\nSiehe die \\\"Recommended Mods\\\" bei der englischen Version.\r\n\r\n[u]Features:[/u]\r\n- Buch mit Hintergrundgeschichte zum Landgut (lore friendly)\r\n- Viel Lagerplatz (auf jeden Fall sicher, auch die Fässer draußen).\r\n- Verzauberung und Alchemielabor\r\n- Werkstatt mit allem was der fleißige Handwerker benötigt\r\n- Küche inkl. Lagerungsmöglichkeiten für Essen\r\n- Waffenständer und Vitrinen\r\n- Anpassbarer Kellerbereich mit oder ohne Puppen. Je nach Belieben. (seit v. 1.3.0)\r\n- Holzhacken hinter dem Haus möglich, falls man Holz fürs Handwerk benötigt.\r\n- Bibliothek mit vielen Regalen\r\n- Bett mit den entsprechenden Boni für ausgeruht und dem anderen Bonus wenn man verheiratet ist.\r\n- Kleiner Stall für ein Pferd\r\n- Eine nordische Sauna und ein kleiner Garten (seit v.1.2.0)\r\n- Ein open-air beheizbarer Waschzuber und eine Dusche in der Sauna! (seit v.1.2.7)\r\n- Automatische Skripts zur Item Lagerung (seit v.1.2.1)\r\n--> Folgende Dinge können per Skript automatisch befüllt werden: Juwelen Schatulle, Tresor, 2 Werkstoffkisten, Ingredienzien Gefäß, Seelenstein Schatulle, Zutatensack und Einmachfass, Bücherschränke. Dabei gibt es verschiedene Optionen. Schaut sie euch einfach an.\r\n- Ein entsprechender Schalter im Keller um die automatische Lagerung ein- und auszuschalten (seit v.1.2.6)\r\n- Außen sind Fackeln die von 18 - 6 Uhr automatisch brennen und Licht spenden.\r\n- Alternative Hamsterer Edition mit mehr Puppen, Waffenständern und Truhen (seit v.1.3.0 obsolet)\r\n- Alternative Bücherwurm Edition. Diese ist ohne Puppen und Waffenständer, dafür mit extra Bücherregalen und einem Schreibtisch für die belesenen Spieler (seit v. 1.3.0. obsolet)\r\n- Vollständig mit Navmesh innen und außen für NPC\\'s\r\n- Sauna und Waschzuber mit Skripts zum automatischen Entkleiden beim setzen auf die Bänke.\r\n- Bediensteten Schlafraum mit 2 weiteren Betten für NPC\\'s.\r\n- Diverse Schreine der Götter. Ich hab es noch nicht genau geprüft..eventuell aber alle Götter überall verteilt.\r\n- Veranda am Fluss\r\n- GRANDIOSE AUSSICHT AUF WEIßLAUF\r\n\r\n[u]NEU seit v. 1.3.1:[/u]\r\n- Alle Versionen in eine zusammengefügt. Man kann nun seinen Kellerbereich mit einen Schalter (Buch) über der Kiste mit dem Hausschlüssel selbst bestimmen.\r\n- Verschiedene Fixes wie z.B. die Beleuchtung und schwebende Fackeln ausgemerzt\r\n- Besserer Weg vom Stall direkt in den Gartenbereich\r\n- Die Brücke und Landmasse wurde angepasst, um eine Kompatibilität mit [url=http://skyrim.nexusmods.com/mods/16028]Rayeks End[/url] zu ermöglichen.\r\nRayeks End sollte dabei zuerst geladen werden.\r\n- Navmesh optimiert\r\n- Vanilla Mannequin Fix integriert (muss jedoch nicht installiert sein, falls ihr andere Mannequin Skripts bevorzugt. Einfach die Mannequin Skript Dateien nicht kopieren, wenn nicht gewünscht.)\r\n\r\n\r\n[u]INSTALLATION:[/u]\r\nWenn ihr die englische Mod in der Version 1.3.3 bereits installiert habt, diese am Besten deinstallieren und meine Dateien in den Data Ordner schieben. Am einfachsten geht das natürlich mit dem Nexus Mod Manager. Es sollte auf jeden Fall die .bsa Datei der Original Mod gelöscht werden, da die Skript Dateien die darin enthalten sind loose von mir geliefert werden.\r\n\r\nWenn ihr noch eine ätere Version der Mod installiert habt, beachtet bitte auch die Hinweise von Lupus bei der Original Mod. Diese kann man exakt so auf den Umstieg zur übersetzten Version 1.3.3 anwenden. Es sollten im Kellerbereich des Hauptgebäudes alle Sachen von den Puppen, Truhen, Fässern, Waffenständern und/oder Regalen genommen werden, bevor ihr updatet. \r\nKüche, Schmiede und Nebenflügel sind nicht betroffen. Da kann alles bleiben wo es ist.\r\n\r\nWenn ihr die englische Mod noch nicht installiert habt auch einfach meine Dateien in den Data Ordner schieben oder mit dem NMM installieren.\r\nDie ESP Datei sollte natürlich aktiviert sein.\r\n\r\n[u]DEINSTALLATION:[/u]\r\nWenn mann nichts verlieren will, sollte man natürlich die eingelagerten Sachen aus dem Haus holen und am Besten die Zelle verlassen. Dann speichern und die Mod kann deinstalliert werden. Wie immer am Besten mit dem NMM.\r\n\r\n\r\n[u]UPDATES:[/u]\r\n24.01.2013: Neue Version 1.3.3. Komplett von Grund auf neu übersetzt auf Basis des Tools \\\"SkyrimStringTranslator\\\". Mit den Textformatierungen in den Büchern bin ich selbst nicht so zufrieden, aber ich schau mir das bei möglichen zukünftigen Versionen wohl nochmal genauer an. In der Originalmod gab es nur kleinere Verbesserungen.\r\n\r\n08.09.2012: Neue Version 1.3.1. übersetzt und verfügbar. Es war ein ganz schöner Kampf. Die nächste Version werde ich wohl gleich von Grund auf neu übersetzen, da mir der String Localizer vorher gespeicherte Texte das ein oder andere Mal an die falsche Stelle gesetzt hat. Warum auch immer. Würde mich daher um Feedback und Endorsements freuen, denn vielleicht hab ich bei der nächsten Version auch keine Lust mehr ;-)\r\n\r\n15.07.2012: Bücherwurm Edition übersetzt und hochgeladen. \r\n\r\n12.07.2012: Hamsterer Version mit insgesamt 10 Puppen und mehr Truhen übersetzt und hochgeladen. Wie bereits erwähnt gibt es mit den Vanilla Puppen aber ein Problem. Ihr werdet möglicherweise erleben, dass manche Puppen nicht an ihrem Platz sind. Manchmal hilft es dann diese auszurüsten oder die Zelle nochmal zu verlassen. Solange Bethesda das nicht fixt kann man hier nur den englischen Vanilla Mannequin Script Fix verwenden, um Besserung zu schaffen. Falls es sowas auch in deutsch gibt bitte Info in die Comments. Danke.\r\n\r\n11.07.2012: Neue Classic Version, da ich bei der ersten Datei das autolight skript vergessen hatte einzupacken und die Fackeln daher ununterbrochen brannten. Für die Leute, die das so besser finden, habe ich die alte Version trotzdem mal nicht gelöscht.\r\n\r\n\r\n=== Bekannte Fehler, Inkompatibilitäten & FAQ ==============================\r\n- Die Vanilla Puppen sind nicht der Hit und haben die bekannten Macken (Bewegen sich z.B.). Bis Bethesda das vielleicht mal fixt gibt es hier nur den Vanilla Mannequin Script Fix. Soweit ich weiß gibt es den aber auch wieder nur in englisch. Ärgerlich, wenn man kein Denglisch will.\r\nUPDATE in Version 1.3.1: Mannequin Fix wird (von mir übersetzt) mitgeliefert\r\n- Laut Lupus gibt es auch Waffen die für Waffenständer eher ungeeignet sind, wie Bögen oder Ork-Äxte. Diese können den Zugang zum Waffenständer blockieren. Auch wohl ein allgemein bekanntes Problem der Waffenständer. Am Besten funktionieren diese wohl mit Schwertern und Stäben.\r\n- Die Mod kann natürlich mit anderen Mods, die dieses Gebiet ändern Konflikte haben. Bei Bugs oder Crashs bitte eine detaillierte Beschreibung an Lupus senden.\r\n- Betrifft die übersetzten Skripte: Skripte werden mit im Save abgespeichert. Daher kann es sein, dass ihr die Meldungen, die von den Skripts ausgelöst werden weiterhin in englisch seht, wenn Ihr die englische Mod bereits am Laufen hattet. Ich weiß leider nicht ob mit der Zeit auch die englischen Skripttexte verschwinden und dafür die deutschen erscheinen. Für alle die die Mod jetzt erst installieren oder ein neues Spiel beginnen ist das aber kein Problem. \r\n- Soweit ich weiß funktioniert diese Mod nicht mit den Mods Dovahkiin Retreat und Ranger Ridge, da hier diesselben Zellen geändert werden. \r\n- Außerdem nutzt die Mod \\\"Nordländer Ausstattung\\\" wohl genau das Gebiet auf dem die Lodge steht. Wer also beide Mods nutzen will sollte zuerst nur die Nordländer Ausstattung aktivieren, alle Sachen (Zelt, Hund etc.) abholen und in Sicherheit bringen und erst danach die Lodge aktivieren. Danke an maikchaos für den Hinweis.\r\nUPDATE seit v.1.3.1: Rayeks End sollte nun zusammen mit dem Landgut funktionieren. Ladereihenfolge zuerst Rayeks End und dann das Landgut.\r\nAnscheinend funktioniert das Seelenstein Skript nicht so wie es soll. Das habe ich aber auch schon in den Comments der Original Mod gelesen und sollte nicht an der Übersetzung liegen.\r\n- Falls ihr Fehler in der Übersetzung findet, bitte melden.\r\n====================================================\r\n\r\n\r\nCredits to Lupus and all the great people he mentiones in his Credits\r\n\r\nThanks to:\r\nMcGuffin for the SkyrimStringTranslator\r\nBethesda for TES\r\n\r\n\r\nMeine anderen Übersetzungen:\r\n[url=http://skyrim.nexusmods.com/mods/30198]Niruins Business Plan - German[/url] / 18+\r\n[url=http://skyrim.nexusmods.com/mods/30879]Adult Toys Merchant - NSFW - German[/url] / 18+\r\n\r\n",
  "categoryId": "67",
  "version": "1.3.3",
  "author": "Lupus and translated by TKone",
  "createdUnix": "1341938389",
  "updatedUnix": "1359064036",
  "containsAdultContent": false,
  "uploadedBy": "TKone",
  "primaryFile": null,
  "files": [
    {
      "fileId": "73441",
      "name": "Flusswald Landgut v129 Classic Edition",
      "version": "1.2.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "129",
      "fileName": "Flusswald Landgut v129 Classic Edition-20242-1-2-9.7z",
      "uploadedUnix": "1341938524",
      "modVersion": "1.2.9",
      "virusScanUrl": "https://www.virustotal.com/file/dc827ac7befb0e96535733753fe8ac9283f01c78ab74d7c24aeccbeb51c07546/analysis/1407014287/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Flusswald%20Landgut%20v129%20Classic%20Edition-20242-1-2-9.7z?fid=73441&ttl=1535788263&ri=8192&rs=8192&setec=9095c0801687d19acaaec116b379414e"
    },
    {
      "fileId": "73506",
      "name": "Flusswald Landgut v129 Classic Edition - gefixte Fackeln",
      "version": "1.2.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "130",
      "fileName": "Flusswald Landgut v129 Classic Edition - gefixte Fackeln-20242-1-2-9.7z",
      "uploadedUnix": "1341960355",
      "modVersion": "1.2.9",
      "virusScanUrl": "https://www.virustotal.com/file/a470aaef7af55355e54f377c312ae20fea31a17c09d3fef09552017fa33e3466/analysis/1407014884/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Flusswald%20Landgut%20v129%20Classic%20Edition%20-%20gefixte%20Fackeln-20242-1-2-9.7z?fid=73506&ttl=1535788264&ri=8192&rs=8192&setec=da7afaafb401753ae0ce4dcf30808e45"
    },
    {
      "fileId": "73707",
      "name": "Flusswald Landgut v129 Hamsterer Edition",
      "version": "1.2.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "130",
      "fileName": "Flusswald Landgut v129 Hamsterer Edition-20242-1-2-9.7z",
      "uploadedUnix": "1342046068",
      "modVersion": "1.2.9",
      "virusScanUrl": "https://www.virustotal.com/file/71efd8412568f5b3ac5d4c2a2ddd6a3d2518301ac08bdf3da78bbeb7affb92d9/analysis/1407017044/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Flusswald%20Landgut%20v129%20Hamsterer%20Edition-20242-1-2-9.7z?fid=73707&ttl=1535788264&ri=8192&rs=8192&setec=2621f15d385cb06835332c622303b7b7"
    },
    {
      "fileId": "74542",
      "name": "Flusswald Landgut v129 Buecherwurm Edition",
      "version": "1.2.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "131",
      "fileName": "Flusswald Landgut v129 Buecherwurm Edition-20242-1-2-9.7z",
      "uploadedUnix": "1342388742",
      "modVersion": "1.2.9",
      "virusScanUrl": "https://www.virustotal.com/file/3d49f48e7cc373d1859b514db3c901611d8d6f84906413d052f6638db680f8e0/analysis/1407025029/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Flusswald%20Landgut%20v129%20Buecherwurm%20Edition-20242-1-2-9.7z?fid=74542&ttl=1535788264&ri=8192&rs=8192&setec=48b73c0bdfd2ce73822cf52725949daf"
    },
    {
      "fileId": "87231",
      "name": "Flusswald Landgut v131",
      "version": "1.3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "140",
      "fileName": "Flusswald Landgut v131-20242-1-3-1.7z",
      "uploadedUnix": "1347128578",
      "modVersion": "1.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/d4df6a6205306ed124b0f4e3569be1ac84845b6b4bb453978b2d7cdb0c79768a/analysis/1407153785/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Flusswald%20Landgut%20v131-20242-1-3-1.7z?fid=87231&ttl=1535788265&ri=8192&rs=8192&setec=65e2118e9d45b5e34a136336a64a19fa"
    },
    {
      "fileId": "1000004640",
      "name": "Flusswald Landgut v133",
      "version": "1.3.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "162",
      "fileName": "Flusswald Landgut v133-20242-1-3-3.7z",
      "uploadedUnix": "1359064036",
      "modVersion": "1.3.3",
      "virusScanUrl": "https://www.virustotal.com/file/047158935cb8e60f982186c7eae42b1cd6716c9999974af5c67a50cf4990b945/analysis/1407377044/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Flusswald%20Landgut%20v133-20242-1-3-3.7z?fid=1000004640&ttl=1535788266&ri=8192&rs=8192&setec=069015a73d5eee8159a9d5e02a87f260"
    }
  ]
}