{
  "modId": 20278.0,
  "modName": "Unenchanted Craftable Thieves Guild Armor",
  "summary": "Ability to craft unenchanted versions of all 3 Thieves Guild Armor sets.",
  "descriptionHtml": "So this is my first and probably last mod I\\'ll ever post, actually this one is a personal mod I made for myself, I decided to post it since I haven\\'t seen other mods like these around here.\r\n\r\nAs a side note, this is a very bare mod, as I said, personal. If enough people bug me about adding a restriction to craft these items only after you have obtained them so you don\\'t break the immersion, I will do it.\r\n\r\nAs the title suggest this mod just lets you craft any piece of the 3 TG armor sets available: the standard one, the guild master one and the sleeveless variation, everything unenchanted. They all fall under Leather. You can temper them as normal, there are no restrictions to this as with the vanilla sets. You may use circlets with the hood but with both the standard set and guild master set hoods the circlets clip a bit, with the sleeveless version hood there should be no clipping. \r\n\r\nI haven\\'t tested if it works with the matching set perk because I don\\'t have it and I\\'m lazy to do so, but it should work.\r\n\r\nYou may use this mod as you see fit, try to credit me if you can :P.\r\n\r\nLet me know if there is any problems with this.\r\n\r\nOh and in case you are wondering, the re-texture mod I\\'m using can be found here: http://skyrim.nexusmods.com/mods/703\r\n\r\nCheers.",
  "categoryId": "54",
  "version": "1.0",
  "author": "blyatzkrieg",
  "createdUnix": "1341989446",
  "updatedUnix": "1341989539",
  "containsAdultContent": false,
  "uploadedBy": "blyatzkrieg",
  "primaryFile": null,
  "files": [
    {
      "fileId": "73574",
      "name": "Main",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Unenchanted Craftable Thieves Guild Armor-20278-1-0.zip",
      "uploadedUnix": "1341989539",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9b85e79ab969146ae90a0a604c2f5ab6dec9824c7f1f853e3cdc2de8b8120d90/analysis/1407015684/",
      "changelogHtml": " Crafting unrestricted <br/> \n Tempering Unrestricted <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unenchanted%20Craftable%20Thieves%20Guild%20Armor-20278-1-0.zip?fid=73574&ttl=1535788325&ri=8192&rs=8192&setec=3e157a30214c4cd54d0efc511c409517"
    }
  ]
}