{
  "modId": 20276.0,
  "modName": "Drakespire Mages Guild",
  "summary": "Drakespire is the home of the secret organization dedicated to stopping the Thalmor. Once you become Archmage of the College of Winterhold, you also become the leader of Drakespire and gain access to it\\'s entrance. Drakespire comes with it\\'s own story line, lore friendly history, Npc\\'s, Merchants, and Quests. Think of it as a secret extention to",
  "descriptionHtml": "[center][URL=http://imageshack.us/photo/my-images/406/externalshot.jpg/][IMG]http://img406.imageshack.us/img406/3258/externalshot.jpg[/IMG][/URL][/center]\r\n\r\n[color=#CD0000][b][size=\\\\\\\"8\\\\\\\"]Under Construction! Mod was taken down for rebuild from ground up, will try and have new version up soon.... Update on progress..... \r\n1. Tower remodel, includes new areas and architecture textures. --- Done (FYI - Next release will require General Goods Mod, save time get it now, it\\'s an awesome Mod!!)\r\n2. Minor changes to Justiciar Keep. --- Done \r\n3. Equipment change for Thalmor Agents. --- 50% Completed (obtained permission to use from one source, awaiting permission from second source.\r\n4. Complete Quest Line... 75% Completed\r\n5. Mod clean-up, fixing all the lil details... 90% Completed\r\n\r\nDream To-Do List (Not factor in release as most will most likely be done after next version is released. \r\n1. Make followers and Drakespire agents stand alone and unique using custom races if I can get permision... 0% (Still studying Nathildes Tutorial.. check it out, his work is awesome.)\r\n2. Add at least two more New Quest... 0%\r\n3. Creat ENB version, I have heard in the past and now seen first hand for myself since I use The Wilds END now that the tower is very dark if using some ENB\\'s. To fix this I want to do another version for people who use ENB\\'s that will have brighter lighting than the vanilla version. \r\n4. Complete Stable Final version so I can begin work on new projects running round in my head... The list gets longer everyday.. ;-)\r\n\r\nAnyway, for those of you still following this Mod, Sorry for the delay, and thank you for your patients, hopefully this will be done soon, can\\'t give an exact timeline as I can\\'t control how long it takes to get the permission needed from others. But I do know I am very close to being done with the mod itself barring any unforseen major bug.[/size] [/color]\r\n\r\n[center][color=#FFff00][size=\\\\\\\"8\\\\\\\"]Drakespire Mages Guild[/size][/color]\r\nRequires Skyrim Latest version[/center]\r\n\r\n[center]You may also want to know this is my first Mod, yes I\\'m a noob.[/center]\r\n\r\n\r\n====================================================================\r\n\r\n\r\n[color=#007FFF]Location\r\n========[/color]\r\nDrakespire itself is located south-east of Windhelm in the mountains above Kynesgrove. You can not access it though until you become Archmage of Winterhold, and then only thru the Archmages Quarters at the College until you aquire the needed Key to gain Access to the Secret external Entrance.\r\n\r\n[color=#007FFF]Details\r\n=======[/color]\r\nDrakespire is the home of the secret organization dedicated to stopping the Thalmor. Once you become Archmage of the College of Winterhold, you also become the leader of Drakespire and gain access to it\\'s entrance. Drakespire comes with it\\'s own story line, lore friendly history, Npc\\'s, Merchants, and Quests. Think of it as a secret extention to the College of Winterhold, that is dedicated to stopping the Thalmor threat.\r\n\r\nDrakespire can be used as a simple player home, for those just looking for a better Archmages Quarters, by the quick access from the balcony once you complete the short Intro Quest. You can travel to Drakespire very rapidly, through magic portals in minutes, not days.  \r\n\r\nDrakespire has everything a hold would have, an Alchemy Merchant, Blacksmith, Priestess, Innkeeper, Cook, Spell Merchant, Trainer, Horse Merchant, Guards and a Bard. Along with thier family in some cases.\r\n\r\nDrakespire also comes with Agents, Trainees and Clerks, that can all be used as followers. Some Agents wont be active until you complete one of the Quests. Being the leader of Drakespire also comes with the perk of having your own private guard besides the normal guards. Your private guards can also be used as followers, and as with most NPC\\'s within Drakespire are also marriable if you choose.\r\n\r\nAs of version 1 there are two quest, not including the short Intro. I don\\'t believe in a lot of hand holding, so the first real quest wont be given to you, you have to find it yourself. I recommend reading notes and looking around to figure out whats up.\r\n\r\nThe Drakespire area itself comes with your own private tower complex which includes your private Quarters, which has a shower and bath. Your own private Trophy room with mannequins, and weapons cases. Your own private Carfting room and garden, with both Alchemy and Enchanting tables. You also have access to the smithing crafting area in the Armory, along with more Mannequins that are safe for your use.\r\n\r\nDrakespire also comes with it\\'s own Library, Jail, Banquet Hall/Tavern, Kitchen, Temple, and Training Hall, explore and have fun. There are little presents located thru most area\\'s of Drakespire for the taking.\r\n\r\nDrakespire Agents can be found in the War Room, or depending on the time of day, they might be in the Banquet Hall eating or in the Living Area/Barracks Sleeping or relaxing. The War Room is also the default location they return to when you complete the quest they might be tied too.\r\n\r\nGuards are on patrol both day and night in the common area\\'s of Drakespire, and yes, will arrest even the Archmage if he commits a crime in thier presence. Your Private Guard takes over the security duties above the Library Level of the Archmages Tower Complex though. \r\n\r\n\r\n[color=#ADD8E6]So why make this Mod?\r\n===============[/color]\r\n\r\nThis all started originaly while I was looking for a good replacement for the Archmages Quarters. I was very let down by the current one and ran across mgbeaches Drakespire office, so I have to give credit to him for making me think, the cool name and for getting the ball rolling.\r\n\r\nI started this project as my first ever mod by just trying to add on to what he started, but soon had to scrap it all thru first time errors in modding. I then started from scratch and it just kept growing. Every time I thought I was close to being done I thought of a new area I wanted to learn how to make or a new NPC that I wanted to make, then I thought it would be cool to have a quest, Sansha\\'s Only Hope. So after days and weeks spent on the Mod I then thought, where\\'s this all going... I HATE the Thalmor, wouldn\\'t it be cool to mess with them? Then I had to add Justiciar Keep and its Quest.\r\n\r\nSo after hundreds of hours spent working on the mod, watching youtube tutorials, reading tutorials and experimenting I have what I hope is a good beta release version. I have listened to experienced modders... and I have tried my best to not make this mod conflict with others, but now I need your help in testing to see how it does. I have played thru it more times than I can count testing it, but never with other mods running. This was done since I didn\\'t want any leak over from other mods corrupting what I was creating by getting meshes, textures, etc. mixed up before I archived it for upload.\r\n\r\nAnd, while I have my own preferences for mods, I made everything vanilla. This was hard with the Npc\\'s, I really wanted to add hair and body mods to them, but restrained myself so you can add your own personal touches.\r\n\r\n\r\n\r\n[color=#007FFF]History and Changes\r\n=======[/color]\r\n\r\n1.3 -- In Progress\r\n      -- Adding Magical Emporium\r\n      -- Adding Concubines Chamber \r\n      -- Adding Sharpening Wheel \r\n      -- Adding Fourth Quest\r\n      -- Creating esm version\r\n\r\n[color=#FFff00]1.2 -- Major Memory Fix, deleted unused resources from textures and meshes folder(sorry bout that).\r\n     - Added Summoner Forge to Training Hall(Summon Live Targets to up your skills)<it\\'s official....I hate scripting>\r\n     - Added Thalmor Assassins hunting player\r\n     - Fixed Justiciar Keep Commander\r\n     - Fixed High Justiciar Shivel\r\n     - Replaced a few large mem Static items with items that use less mem\r\n     - Removed LOD settings on exterior of both Drakespire and Justiciar Keep\r\n     - Further cleaned esp[/color]\r\n\r\n1.1 -- Fixed Justiciar Keep floor and wall on the second floor of the main keep.\r\n        - Tweaked Justiciar Quest, to stop quest from starting if you happened to stuble upon the location before the Agent goes missing.\r\n        - Made Slight cosmetic changes to some of the NPC\\'s.\r\n        - Cleaned a few exterior cells to try and reduce chance of incompatability with other mods.\r\n\r\n\r\n1.0 Initial beta release for testing. \r\n- This is a work in progress as I plan on you all finding bugs I need to fix, and I will do my best to stay on it and try to fix anything you find in a timely manner.\r\n\r\nThat being said, if you just don\\'t like something creatively speaking, then feel free to make your own mod. \r\n\r\nIt\\'s what I did.\r\n\r\n[color=#007FFF]Future Plans\r\n=======[/color]\r\n\r\nTie Drakespire Quests into Mages College Questline\r\nAdd More Agents\r\nAdd More Quest - In Progress\r\nBetter voice dialogue.\r\n\r\n[color=#7FFF00]Required Files\r\n=======[/color]\r\nSkyrim.esm\r\nUpdate.esm\r\n\r\n\r\n\r\n[color=#7FFF00]Installation\r\n=======[/color]\r\n\r\n\r\nJust use NMM to install, or:\r\n\r\n1. Extract the files to a temporary location.\r\n2. Examine the folder structure and make corrections where necessary.\r\n3. Copy files to (Skyrim install folder)\\\\\\\\Data\\\\\\\\\r\n\r\n\r\n[color=#ADD8E6]Uninstallation\r\n=======[/color]\r\n\r\nJust use NMM or remove the files manually.\r\n\r\n\r\n\r\n[color=#CD0000]Known Issues or Bugs\r\n====================[/color]\r\n\r\nIntro Quest Bug:\r\n\r\nSince the last update, thanks Bethesda, if you load this mod after completing the College Quest line the Drakespire Intro Quest has a bug with the courier. There is now a delay in the note getting into the couriers container, so he may show up and just say the first two lines and then nothing. If this happens, just fast travel somewhere else and kill some time, two or three minutes should be fine, then the next time he comes up to you in a town the dialogue will work. This should not be a problem if you install mod before finishing College Quest line as the note will have time to propagate into the WICourier container before the Quest starts.\r\n\r\nSome players experienced issues with this mods size on the first two versions, 1.0 and 1.1, but I have now cut out all the unused resorces and hope it helps. Please keep the feedback coming so I know if it worked. \r\n\r\n\r\n\r\n[color=#EEEE00]Incompatibilities\r\n===============[/color]\r\n\r\nThis will be incompatible with anything that uses the two cells in the mountains just up the slope from the hunters camp above Kynesgrove, and the cell just west of the dragon wordwall located south of Riften in the mountains.\r\n\r\nThis may be incompatible with mods that alter the cells in the holds due to the portals, but I tried to keep the portals out of the way and in unused areas to prevent conflicts.\r\n\r\nThis Mod will probably also conflict with any mod that changes the Archmages Quarters in the College.\r\n\r\nHopefully there will not be any more than this, but that\\'s why it\\'s beta... let me know.\r\n\r\n\r\n[color=#ADD8E6]Compatabilities\r\n=======[/color]\r\n\r\nHopefully everything... yea I know, I\\'m a dreamer.\r\n\r\nSo far I\\'ve tested it with:\r\nSexy Skyrim Series - all of them.\r\nBathing Beauties or Beefcakes - Luxury Suite\r\nDeus Mons\r\nUFO\r\nEarlier Windhelm Thane\r\nPerfect Whiterun - although not at the same time as Bathing Beauties Luxury Suite.\r\nWhiterun Rebuilt\r\nVindrel Hall Armory and Forge\r\nProudspire Manor Refurbished\r\nBlack Tower and Black Sacrament Armor\r\nBerts Breezehome Cellar\r\nUnlimited Bookshelves\r\nEvil Lair of Hydra\r\nColovian Traders\r\nSexy House Vendors\r\nTemptress Race\r\n\r\nI am also running about 30 different Armor and Weapons Packs and haven\\'t found one yet that doesn\\'t work fine with this Mod.\r\n\r\nI am running about 20 different follower mods and they all work fine too.\r\n\r\n[color=#ADD8E6]Agent Outfit is Stand Alone, it is craftable, temperable and does not replace any armor.[/color]\r\n\r\n\r\n[color=#ADD8E6]Tools Used\r\n=======[/color]\r\n\r\nSkyrim Creation Kit\r\nNifscope\r\nGimp 2\r\nFOMM\r\nPhotoshop\r\n\r\n\r\n[color=#ADD8E6]Permissions\r\n=======[/color]\r\n\r\nDO NOT simply alter this mod and repackage it as your own, give me a little credit too. I know there are better modders out there than me since I\\'m a noob. \r\n\r\nGive credit if including it in your own projects, and let me know so I can check out your awesome work. \r\n\r\nDo not upload this mod to another site without permission.  That being said, if you would like to translate this mod to your native language, please fill free to do so if you only upload it to Nexus.\r\n\r\n\r\n[color=#ADD8E6]Credits\r\n=======[/color]\r\n\r\nThis is a long list, and I know I will forget someone, so first Credit should go to mgbeach and all the modders before me for inspiring me to try creating my own mod, for the awesome tutorials, and for the modding resources. So in no particular order....\r\n\r\nModders Resources used in this Mod:\r\n\r\nOaristys -- for the must have Modders Resource Pack\r\nhttp://skyrim.nexusmods.com/mods/16525/\r\n\r\nEldiabs -- for the activators\r\nhttp://skyrim.nexusmods.com/mods/11618/\r\n\r\nArtisanix -- for the paintings\r\nhttp://skyrim.nexusmods.com/mods/17423\r\n\r\nTutorials:\r\n\r\nDougHamil -- for the awesome YouTube tutorials that have taught me so much about scripting.\r\nRichardBMiller2 -- For your HellCat tutorials on YouTube and the Script I overused... ;-)\r\nAralore -- for the Bard tutorial\r\nhttp://skyrim.nexusmods.com/mods/18175\r\n\r\nModders Who Inspired me thru there work, please download thier work and endorse them:\r\n\r\nEldiabs -- For the awesome Deus Mons\r\nhttp://skyrim.nexusmods.com/mods/11803\r\n\r\nMigal -- For the amazing Bathing Beauties\r\nhttp://skyrim.nexusmods.com/mods/11427\r\n\r\nAmethystDeceiver -- For the awe inspiring Black Tower\r\nhttp://skyrim.nexusmods.com/mods/5696\r\n\r\n\r\nCaliente and Dimon99 -- For making Skyrim a beautiful place\r\nhttp://skyrim.nexusmods.com/mods/2666\r\nhttp://skyrim.nexusmods.com/mods/6709\r\n\r\nThanks to Bethesda, even though your updates give me headaches.\r\n\r\nAnd last but not least, DarkSaber9000 for the Readme Generator:\r\nhttp://skyrim.nexusmods.com/mods/17182\r\n\r\nPersonal thanks for my own gaming enjoyment also to CherryHotaling, BellaGail, FavoredSoul, and Navetsea for the textures and meshes that make modding better.\r\n\r\n[center][URL=http://imageshack.us/photo/my-images/339/drakespireheader.jpg/][IMG]http://img339.imageshack.us/img339/4929/drakespireheader.jpg[/IMG][/URL][/center]\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "67",
  "version": "1.2",
  "author": "Shayk86",
  "createdUnix": "1341983354",
  "updatedUnix": "1341983354",
  "containsAdultContent": false,
  "uploadedBy": "shayk86",
  "primaryFile": null,
  "files": []
}