{
  "modId": 20296.0,
  "modName": "Depraved Beta v1-01",
  "summary": "WARNING CONTAINS BRIGHT FLASHING LIGHTS OF A REPETITIVE NATURE\r\n\r\nDepraved Beta",
  "descriptionHtml": "WARNING CONTAINS BRIGHT FLASHING LIGHTS OF A REPETITIVE NATURE\r\n\r\n1.01 Update\r\n\r\nUpdating Depraved\r\n\r\nthis update\r\na small update that does the following\r\n\r\n-Toned down strobe lights, not a strain on the eyes anymore (well hopefully), This is the primary reason for uploading this small update. I feel that the strobe lights were indeed to bright, this will hopefully fix that.\r\n\r\n\r\n- Animations implemented using FNIS, this means no more animation replacement...unfortunately for now the Depraved NPCs will continue the animation when wandering around rather than walking normally, \r\nthis is due to the AI packages I used to get them to work, if someone knows a way to make the Sandbox package do an OnChange check that would be most helpful, at the moment it doesn't seem to do one.\r\nIf no solution is found, I will redo the AI Packages on the NPCs, this will be a time consuming process though and will be released with a later update.\r\n\r\n\r\nRequirements\r\n\r\nThis update require that you have http://skyrim.nexusmods.com/mods/11811 - Fores New Idles in Skyrim - FNIS by fore installed\r\n\r\nInstructions\r\n1. Retrieve any items/objects/followers etc you have left in any of the Depraved areas\r\n2. Leave the club areas, eg. go back to the Skyrim/Tamriel world\r\n3. Save your game\r\n4. Disable the Depraved Beta 1.00 esp\r\n5. Enable the Depraved Beta 1.01 esp\r\n\r\n6.Remove animation replacers\r\n\r\nnavigate to data/meshes/actors/characters/animations\r\nand delete the following\r\n\r\nNPC_Applaud4\r\nNPC Applaud5\r\n\r\n7. Enjoy :)\r\n\r\nCheers,\r\nFatalisticZero\r\n\r\n\r\nDepraved Beta v1.00\r\n\r\nDescription\r\n\r\nDepraved is a 'night' club. It features a dark atmosphere with red, green and blue ambient lights, it even includes strobe lights. \r\nA reasonable number of NPCs can be found dancing away on the dance floors while others can be found relaxing in the lounge. \r\nThe lounge also includes a merchant who will buy most items from the player. You get to choose what music to have playing in each area of the club. \r\nDepraved also features a one room area that can be used as a player home. \r\n\r\nThe mod adds 4 new areas.\r\n\r\nDepraved Entrance - A cave entrance to the club. A map marker that you can fast travel to will be added to your map when you start your game. See screenshots for location.\r\n\r\n\r\nDepraved - The club itself, featuring a main hall with balcony, two side rooms and a back room\r\n\r\n\r\nDepraved Lounge - A smaller more relaxed area, main room, two side rooms and a back room \r\n\r\n\r\nDepraved Quarters - A small one room area, featuring some storage, a bed and some chairs. A comfortable lair for you to rest in.\r\n\r\nPlease note that this mod is at a BETA stage and as such I would suggest you back up any important save files (just in case). \r\nThere are also a few things to take note of, currently the dancing animations replace two vanilla animations\r\nNPC_Applaud4 and NPC_Applaud5.\r\nUntil I figure out a way to implement the dance animations on idlemarkers using FNIS or someone helps me do so, or someone helps me achieve the same result of NPCs dancing (some of them constantly) in a different way. \r\nAnimation replacement is my only option. \r\nI also have a few minor concerns with a light script I wrote and some of the ways the NPC AI works and whether there might be better ways to implement both of these.\r\n\r\nIf it's not too much trouble, please give me feedback.\r\nBe sure to let me know about any issues or bugs you encounter (hopefully there won't be many)\r\n\r\nAnyway I hope you enjoy Depraved :)\r\n\r\nCheers,\r\nFatalisticZero\r\n\r\nInstallation\r\n\r\n1 - Copy the 'Data' folder into your skyrim install directory. \r\n2 - Enable the Depraved Beta v1.00 esp file in the Skyrim Launcher or equivalent \r\n\r\n3 - Setting up the Music for Depraved. MUST DO or enjoy a silent club.\r\n\r\n\r\nAll music files MUST BE .WAV FORMAT.\r\n\r\n\r\nDepraved lets the user choose 8 songs total. You must place a WAV file for each of the 8 tracks or you will most likely experience a silent club rather than a music filled one. \r\nTry and keep song length reasonable, I have no idea what the maximum length a track can be is.\r\n5 for the club\r\n3 for the lounge\r\n1 for the quarters\r\n\r\nGo to data/music/depraved, in this folder place 5 songs you want to play in the club area of Depraved and rename them Track 1 - Track 5\r\ne.g.\r\nTrack 1\r\nTrack 2\r\nTrack 3\r\nTrack 4\r\nTrack 5\r\n\r\nGo to data/music/depraved/lounge, in this folder place 3 songs you want to play in the lounge area of Depraved and rename them Track 1 - Track 3\r\ne.g.\r\nTrack 1\r\nTrack 2\r\nTrack 3\r\n\r\nGo to data/music/depraved/quarters, in this folder place 1 song that you want to play in the quarters area of Depraved and rename the file Track 1\r\ne.g.\r\nTrack 1\r\n\r\n\r\nReminder - ALL SONGS MUST BE .WAV FORMAT\r\n\r\n\r\nBugs -\r\n\r\n-Sometimes the music doesn't play upon entering an area and starts to play a while later or not at all... Can sometimes be fixed by going into another area and then returning.\r\n\r\n-Various Idle Interruptions, not much I can do at the moment... \r\n\r\n\r\n\r\nFuture Plans for this mod (possible not probable)\r\n-Shady drug dealer and/or bartenders who will sell some things with new drugged and drunk effects.\r\n-A few short repeatable quests to make Depraved a bit more interesting.\r\n-A  new merchant in the lounge who sells dark/black re-textures of some of the vanilla armours, clothes and weapons.\r\n\r\n\r\nMods I recommend to enhance the Depraved experience:\r\n\r\nhttp://skyrim.nexusmods.com/mods/11811 - Fores New Idles in Skyrim - FNIS by fore\r\nWhy not dance yourself?\r\n\r\nhttp://skyrim.nexusmods.com/mods/15105 - Sharpshooters Extreme Graphics Vision ENB - good performance by Sharpshooter8\r\nI use a version of this that I have tweaked a bit, I highly recommend this mod, or at least some kind of ENB, with enough tweaking you can get some amazing lighting happening \r\nand a large part of the atmosphere in Depraved is the lighting.\r\n\r\n\r\nCredits and Thanks\r\n\r\nUmpa - For the dance animations\r\nhttp://skyrim.nexusmods.com/mods/2658 - Dance Animation for Modder by umpa\r\n\r\nFore - For a means to examine the above dance animations with ease and for pointing me in the right direction when it came to AI Packages etc, I really appreciate it.\r\n\r\nBethesda - For Skyrim\r\n\r\n",
  "categoryId": "89",
  "version": "v1.01",
  "author": "FatalisticZero",
  "createdUnix": "1342017534",
  "updatedUnix": "1342058979",
  "containsAdultContent": false,
  "uploadedBy": "FatalisticZero",
  "primaryFile": null,
  "files": [
    {
      "fileId": "73619",
      "name": "Depraved Beta v1-00",
      "version": "v1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5660",
      "fileName": "Depraved Beta v1-00-20296-v1-00.zip",
      "uploadedUnix": "1342017734",
      "modVersion": "v1.00",
      "virusScanUrl": "https://www.virustotal.com/file/0cb5fa65e1a8d28a0b46928ca02bb040488fd377f53c2faccac9c5a08afe4e00/analysis/1407016216/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Depraved%20Beta%20v1-00-20296-v1-00.zip?fid=73619&ttl=1535788355&ri=8192&rs=8192&setec=fdb85ad83dc479da4a397fdd9a4b70dc"
    },
    {
      "fileId": "73730",
      "name": "Depraved Beta v1-01",
      "version": "v1.01",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "74",
      "fileName": "Depraved Beta v1-01-20296-v1-01.zip",
      "uploadedUnix": "1342056638",
      "modVersion": "v1.01",
      "virusScanUrl": "https://www.virustotal.com/file/ec930d1848aac4eb2812ac9c0e55443005ae7f63b9f4ee59da8bba55a86877bc/analysis/1407017164/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Depraved%20Beta%20v1-01-20296-v1-01.zip?fid=73730&ttl=1535788356&ri=8192&rs=8192&setec=8d8c66d2ec1f17b15dd2d2bb1612dfe5"
    },
    {
      "fileId": "73735",
      "name": "Depraved Beta v1-01 FaceGenData Files",
      "version": "v1.01",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "5493",
      "fileName": "Depraved Beta v1-01 FaceGenData Files-20296-v1-01.zip",
      "uploadedUnix": "1342058979",
      "modVersion": "v1.01",
      "virusScanUrl": "https://www.virustotal.com/file/23165b6ebdb194eeaebef29f730ae4a2c8fd64f7065c675832f5e886341640d8/analysis/1407017226/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Depraved%20Beta%20v1-01%20FaceGenData%20Files-20296-v1-01.zip?fid=73735&ttl=1535788356&ri=8192&rs=8192&setec=f628f8cc8e8e08873589d5127953ce79"
    }
  ]
}