{
  "modId": 20295.0,
  "modName": "101 Bugs - Deutsch",
  "summary": "Dieser Mod übersetzt den 101Bugs-Mod von 83Willow ins Deutsche, wodurch das Spiel an zahlreichen neuen Insekten und somit auch an neuen Alchemie-Zutaten gewinnt. Ein richtigen Upgrade für Käferliebhaber und geborene Alchemisten&#33;",
  "descriptionHtml": "Schmetterlinge, Libelle, Glühwürmchen... alles sind Insekten, die das Leben bereichern. Warum sollte es also in Skyrim nur vier oder fünf verschiedene Arten geben?\r<br />Dieser Mod fügt der Welt von Skyrim ganze 28 neue Insektenarten hinzu (in Zukunft vielleicht sogar noch mehr) und bereichert damit nicht nur die Welt um ein paar neue und aufregende Lebewesen, sondern auch das Inventar eines jeden Alchemisten. Wer also die Erfahrung neuer, kraftvoller Tränke oder Gifte machen will, oder einfach nur die Vielzahl an schön anzuschauenden Insekten genießen möchte, für den ist dieser Mod das perfekte Upgrade.\r<br />\r<br />-\r<br />\r<br />Dieser Mod wurde ursprünglich von 83Willow erstellt. Meine Leistung war lediglich, ihn ins deutsche zu übersetzen.\r<br />\r<br />Um diese Übersetzung zu benutzen muss zunächst der &#34;101BugsHD&#34;-Mod von 83Willow installiert sein. Zu finden ist er hier:\r<br />[url=http://skyrim.nexusmods.com/mods/4955]http://skyrim.nexusmods.com/mods/4955[/url]\r<br />\r<br />-\r<br />\r<br />[b]Installation:[/b]\r<br />1.) Zuerst den &#34;101BugsHD&#34;-Mod von 83Willow herunterladen und nach der dort gegebenen Anleitung installieren.\r<br />2.) Die Datei aus diesem Download in das Installationsverzeichnis (in der Regel steam&#92;steamapps&#92;common&#92;Skyrim&#92;Data) verschieben und die alte Datei überschreiben.\r<br />3.) Den Mod aktivieren und Spaß haben :-)\r<br />\r<br />-\r<br />\r<br />[color=red][b]Anmerkung:[/b][/color]\r<br />Die Namen der neuen Insekten sind teilweise an die Originale von 83Willows Mod angelehnt, teilweise aber auch wörtliche Übersetzungen ins Deutsche. Ich habe mich bemüht, die Namen so zu übersetzen, dass sie einerseits in die Atmosphäre des Spiels passen, andererseits aber ihren Effekten entsprechende Hinweise geben. So kann es sein, dass Insekten, die einfach nur als &#34;Libellen&#34; in der Welt gefangen werden können, im Inventar andere Namen haben und differenzierter sind. Dies ist beabsichtig&#33; (Ähnliche Bespiele existieren auch bereits in Skyrim selbst, so z.B. die Abeceanische Langflosse, oder die Schmetterlinge).\r<br />\r<br />Sollten davon abgesehen aber noch irgendwo Unklarheiten bestehen, dann meldet diese mir bitte umgehend hier im Skyrim-Nexus.\r<br />\r<br />-\r<br />\r<br />Credits gehen vor allem an 83Willow für ihren wundervollen Mod, sowie an alle anderen Beteiligten.\r<br />\r<br />-\r<br />\r<br />[b]Schlusswort:\r<br />[size=3][color=orange]Abschließend möchte ich hier Werbung für meine neuste Übersetzung machen, nämlich für den wahnsinnig spannenden Mod &#34;[url=http://skyrim.nexusmods.com/mods/9782]Moonpath to Elysweyr[/url]&#34;, den ich [url=http://skyrim.nexusmods.com/mods/26345/][u]hier[/u][/url] übersetzt habe.[/color][/size]\r<br />Sollten Euch dieser Mod sowie meine Arbeit gefallen, dann lasst mir bitte einen Kommentar da, oder klickt einmal auf &#34;endorse me&#34;. Ich bin von 83Willow gebeten worden, dass ihr auch sie endorsed, wenn der Mod euch gefällt. Daher bitte ich euch, das auch zu tun und sie für diesen wundervollen Mod entsprechend zu belohne.[/b]",
  "categoryId": "83",
  "version": "4.1",
  "author": "83Willow und Verodor",
  "createdUnix": "1342017461",
  "updatedUnix": "1342020381",
  "containsAdultContent": false,
  "uploadedBy": "Verodor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "73625",
      "name": "101 Bugs v4-01 - deutsch",
      "version": "4.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "101 Bugs v4-01 - deutsch-20295-4-1.rar",
      "uploadedUnix": "1342020381",
      "modVersion": "4.1",
      "virusScanUrl": "https://www.virustotal.com/file/c0b49c8f4b167f747edefe0d92d176b76c94bb74b0395dcab1907ef196c237b0/analysis/1407016262/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/101%20Bugs%20v4-01%20-%20deutsch-20295-4-1.rar?fid=73625&ttl=1535788354&ri=8192&rs=8192&setec=ae0e4392fc6490053b028aafbf65857e"
    }
  ]
}