{
  "modId": 20315.0,
  "modName": "Wearable Lanterns - Tragelaternen -German Translation-",
  "summary": "Deutsche Uebersetzung der Wearable Lanterns-Mod von Chesko. Zusaetzliche Add-Ons ebenfalls uebersetzt.\r\nVersion 2.2a",
  "descriptionHtml": "[center][img]http://i.imgur.com/lwSHG.png[/img][/center]\r\n[center][IMG]http://i.imgur.com/hF0Xy.png[/IMG][/center]\r\n\r\n[color=#404040][Line][/color]\r\n\r\n\r\n[center][size=+1][color=#FBEC5D][u]Status[/u][/color][/size][/center]\r\n\r\nDeutsche Übersetzung der Mod [url=http://skyrim.nexusmods.com/mods/17416]Wearable Lanterns[/url]\r\n\r\nAutor: [url=http://skyrim.nexusmods.com/users/187943][b]Chesko[/b][/url]\r\nAktuellste Version: [b]2.2a[/b]\r\nLetzte Übersetzungskorrekturen am: 26.09.2012 (für Candle Lanterns of the North)\r\n\r\n[size=+1]Vergesst nicht Chesko ein Endorsement zu geben![/size]\r\n\r\n[center][size=+1][color=#FBEC5D][u]Beschreibung[/u][/color][/size][/center]\r\n\r\nDiese Mod ergänzt das Spiel um Reiselaternen die ihr kaufen und schmieden könnt. Ihr könnt die Laterne an eure Gürtelschlaufe befestigen oder in der Hand tragen. Oder fangt ein Fackelwürmchen in ein dafür gemachtes Glas mit Halterung ein und tragt es in dunklen Dungeons bei euch um den Weg zu erleuchten. Alle Laternen können vorne oder hinten an eure Gürtelschlaufe befestigt werden um die Hände für Kämpfe frei zu haben.\r\n\r\nDie Idee die Laterne am Gürtel zu tragen kommt von [url=http://i.imgur.com/bH7aj.jpg]Legend of Zelda: Twilight Princess[/url]. Kein besonders guter Screenshot, aber ihr wisst was gemeint ist. Obwohl es nicht zur Idee gedient hat gleicht es dem selben Stil aus [url=http://theworldwentaway.files.wordpress.com/2011/04/dragons-dogma-08.jpg]Dragon\\'s Dogma[/url]. Die Art wie du deine Laterne benutzen kannst (Tragen oder Halten), änderst du einfach indem du sie fallen lässt. Siehe unten.\r\n\r\n[center][size=+1][color=#FBEC5D][u]Wie bekomme die Reiselaterne?[/u][/color][/size][/center]\r\n\r\nReiselaternen können bei so gut wie jedem Gemischtwarenhändler gekauft werden. Bei Gelegenheit  bieten auch kleinere Händler diese Laternen an.\r\n\r\nDie Reiselaterne könnt ihr euch auch selber schmieden. Dazu benötigt ihr eine gewöhnliche Laterne wie ihr sie in Dungeons findet oder auch bei Händlern kaufen könnt und ein paar Lederstreifen. Eine normale Laterne könnt ihr auch mit zwei Eisenbarren in einer Schmiede herstellen, falls ihr Probleme habt eine zu finden.\r\n\r\nStandardmäßig hängt die Reiselaterne hinten rechts an deinem Gürtel. Um die Position deiner Laterne zu ändern lässt du sie einfach fallen. Dabei erscheint ein Menü indem du auswählen kannst wie du deine Reiselaterne tragen willst. Sie lässt sich hinten rechts, vorne rechts oder in der Hand tragen.\r\n\r\n[center][size=+1][color=#FBEC5D][u]Wie bekomme ich die Fackelwürmchenlaterne?[/u][/color][/size][/center]\r\n\r\nFür eine Fackelwürmchenlaterne braucht ihr zunächst eine leere Glühwürmchenlaterne. Solche sind bei sämtlichen Gemischtwarenhändlern zu haben. Diese leere Laterne legt ihr euch an und geht dann einfach nah an ein Glühwürmchen oder Fackelwürmchen ran. Der Käfer sollte so automatisch ins Glas eingefangen werden. (Klick aber nicht auf sie, sonst sammelt du bloß die Brust ein). Dein kleiner, glühender Freund lebt nun in der Fackelwürmchenlaterne weiter und spendet Licht wenn du es brauchst.\r\n\r\nIn der Mod [url=http://skyrim.nexusmods.com/mods/4955]101BUGS von 83Willow[/url] sind auch andersfarbige Glühwürmchen zu finden welche rotes Licht ausstrahlen. [url=http://skyrim.nexusmods.com/mods/20295]Die deutsche Version von 101BUGS kann hier von Verodor runtergeladen werden.[/url]\r\n\r\nAuch die Fackelwürmchenlaterne hängt standardmäßig hinten rechts an deinem Gürtel.  Um die Position deiner Laterne zu ändern lässt du sie einfach fallen. Dabei erscheint ein Menü indem du auswählen kannst wie du deine Fackelwürmchenlaterne tragen willst. Sie lässt sich hinten rechts, vorne rechts oder in der Hand tragen.\r\n\r\n[center][size=+1][color=#FBEC5D][u]Begleiter und Laternen[/u][/color][/size][/center]\r\n\r\nDu kannst auch deinen Begleitern eine Laterne geben. Unter folgenden Gegebenheiten werden sie diese benutzen:\r\n[list]\r\n[*]Draußen bei Nacht (zwischen 7Uhr abends und 7Uhr morgens)\r\n[*]Drinnen an unsicheren Orten wie Krypten, Höhlen, Dungeons etc.\r\n[*]Beim Schleichen steckt dein Begleiter die Laterne weg oder macht sie aus.\r\n[/list]\r\n\r\nDu bekommst eine neue Dialogoption: Zu deiner Laterne.... Damit kannst du die Position der Laterne an deinem Begleiter ändern ohne sie wieder wegzunehmen und selbst zu ändern.\r\n\r\nWegen eines neuen Skyrimupdates musst du wahrscheinlich deinen Spielstand speichern und neuladen damit die Dialogoption verfügbar wird.\r\n\r\nWenn du Ultimate Follower Overhaul (UFO), Amazing Follower Tweaks, oder Extensible Follower Framework benutzt, kannst du deinen Begleiter Laternen tragen lassen.\r\n\r\nUFO: Alle Begleiter.\r\nAFT: Alle Begleiter.\r\nEFF: Die ersten 15 Begleiter.\r\n\r\nSollte dein Begleiter die Laternen nicht benutzen, dann lass ihn gehen und rekrutiere ihn wieder.\r\n\r\n[center][size=+1][color=#FF2200][u]Erweiterte Funktionen[/u][/color][/size][/center]\r\n\r\nDie Modifikation bietet mehrere besondere Funktionen die ihr jederzeit aktivieren oder deaktivieren könnt. Kauft euch von einem der Gemischtwarenhändler ein Exemplar des Buches [color=#FBEC5D]“Anleitung zur Laternenpflege und Instandhaltung“[/color] und liest es. Das Buch dient als Konfigurationsmenü für deine Laternen.\r\n\r\n[list]\r\n[*][b][color=#FBEC5D]HELLIGKEIT:[/color][/b] Wähle zwischen 4 verschiedenen Helligkeitsstufen für Reiselaternen und Fackelwürmchenlaternen. Standardmäßig ist die Helligkeit der Reiselaternen auf Stufe 2 gestellt, die der Fackelwürmchenlaternen auf Stufe 1. Ihr könnt beides unabhängig von einander einstellen.\r\n[*][b][color=#FBEC5D]AUTOMATIK-MODUS:[/color][/b] Nur für Reiselaternen. Stellt Reiselaternen so ein dass sie funktionieren wie die deiner Begleiter. Sie gehen je nach Gegebenheit an oder aus. So kann man seine Laterne auch weiterhin tragen ohne sie zum ausmachen abzulegen. Glühwürmchen- und Fackelwürmchenlaternen werden ihr Verhalten nach umstellen auf Auto-Modus nicht ändern. Dies bleibt nur den Reiselaternen vorbehalten. (Man kann auch nicht wirklich einen Leuchtkäfer “ausmachen“)\r\n[*][b][color=#FBEC5D]ANGEZÜNDETE LATERNEN ABLEGEN:[/color][/b] Standardmäßig aktiviert. Beim wechseln durch Hotkeys von einer in der linken Hand getragener Laterne zu einem Schild oder einer anderen Waffe, wird die Laterne auf den Boden geworfen. Wenn du deine Laterne wieder aufhebst dann legst du sie automatisch wieder an. Du musst nicht wieder in dein Inventar gehen und dort die Laterne ausrüsten... nichts davon. Hebe sie auf, und Zack, schon kanns weiter gehen. Du kannst ebenfalls “Vorzugsweises Aufheben“ einstellen und die gewünschte Tragposition beim Aufheben wählen.\r\n[*][b][color=#FBEC5D]ÖLVERBRAUCH:[/color][/b] Eine optionale Funktion die deine Reiselaterne Öl verbrauchen lässt wenn sie brennt. Lampenöl kann von den meisten Gemischtwarenhändlern gekauft werden. Auch von kleineren Händlern und Verkaufsständen. 16 Unzen Lampenöl reichen für 16 Minuten (Echtzeit). Lampenöl wird bei getragener Laterne automatisch nachgefüllt wenn sich welches in deinem Inventar befindet. Wenn du die Reiselaterne ablegst komm unbenutztes Öl zurück in dein Inventar.\r\n[*][b][color=#FBEC5D]GLÜHWÜRMCHENFÜTTERUNG:[/color][/b] Eine optionale Funktion bei der deine Glühwürmchen Blütenpollen brauchen um glücklich zu sein. Je glücklicher sie sind, desto heller leuchten sie. 4 Blüten halten dein Glühwürmchen 16 Minuten lang glücklich. Distel, Lavendel und Bergblumen verschiedenster Farben liefern Pollen wenn nötig. Das Glühwürmchen wird automatisch gefüttert wenn du Pollen bzw. Blüten in deinem Inventar hast.\r\n[*][b][color=#FBEC5D]VERDUNKELUNG:[/color][/b] Eine optionale Funktion bei der das Licht deiner Reiselaterne oder Glühwürmchenlaterne zunehmend schwächer wird wenn das Lampenöl oder die Blüten zur Neige gehen. Ölverbrauch bzw. Glühwürmchenfütterung muss aktiviert sein damit der Effekt funktioniert.\r\n[/list]\r\n[center][size=+1][color=#FBEC5D][u]Add-Ons[/u][/color][/size][/center]\r\n\r\n[center][url=http://skyrim.nexusmods.com/mods/23017]Lanterns for Caravans Add-On[/url] (Laternen für Karavanen) übersetzt und als optionaler Download unter der Files-Sektion hinzugefügt. Fügt den Khajiitkaravanen tragbare Glühwürmchen- und Reiselaternen hinzu.\r\nAktuellste Version: [b]1.0[/b]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/22986]Candle Lanterns of the North Add-On[/url] (Kerzenlaternen des Nordens) übersetzt und als optionaler Download unter der Files-Sektion hinzugefügt. Holt euch eine der über 1400 Kerzenlaternen in Himmelsrand mit und leuchtet euch damit durch die Dunkelheit. Oder stellt euch selber eine her!\r\nAktuellste Version: [b]1.1[/b]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/24568]Lanterns for Guards Add-On[/url] (Laternen für Wachen) übersetzt und als optionaler Download unter der Files-Sektion hinzugefügt. Fügt den Wachen in Himmelsrand tragbare Reiselaternen hinzu.\r\nAktuellste Version: [b]1.0[/b][/center]\r\n\r\n[center][size=+1][color=#FBEC5D][u]Anforderungen[/u][/color][/size][/center]\r\n\r\n[b]Benötigt Skyrim-Version 1.7.7.0.6 oder höher.[/b]\r\n\r\n[center][size=+1][color=#FBEC5D][u]Installation[/u][/color][/size][/center]\r\n\r\n[center]Das englische Original wird nicht benötigt. Alle Dateien sind bereits im Download enthalten und müssen nur in den DATA-Ordner kopiert werden (Oder benutzt den Nexus Mod Manager). Bei der Mod \\'\\'Candle Lanterns of the North\\'\\' nehmt ihr nur eine Version, abhängig davon ob ihr Dawnguard installiert habt oder nicht.[/center]\r\n\r\n[center][size=+1][color=#FBEC5D][u]Deinstallation[/u][/color][/size][/center]\r\n\r\n1. Entlasse all deine Begleiter.\r\n2. Zieh alle Laternen aus. Du brauchst sie nicht zu verkaufen oder wegzuwerfen.\r\n3. Warte ungefähr 30 Sekunden lang (Realzeit) außerhalb des Menübildschrims.\r\n4. Speicher das Spiel, beende Skyrim und entfern die Mod.\r\n\r\n[center][size=+1][color=#FBEC5D][u]Beabsichtigtes Verhalten[/u][/color][/size][/center]\r\n\r\nDie folgenden Sachen sind keine Fehler:\r\n[list]\r\n[*]Die Laterne überschneidet sich leicht mit Streitkolben und einigen Rüstungen (deutlich bei Eisenrüstungen). Da gibt es nicht viel was man machen kann.\r\n[*]Es kann bis zu 4 Sekunden dauern bis eine Laterne anfängt zu leuchten wenn Ölverbrauch oder Glühwürmchenfütterung aktiv ist. Dieses Verhalten ist normal.\r\n[*]Es kann bis zu 5 Sekunden dauern bis dein Begleiter seine Laterne wegsteckt. Auch beim Schleichen.\r\n[*]Es dauert eine oder zwei Sekunden bis das Licht oder die Flamme nach ablegen der Laterne verschwindet.\r\n[*]Wenn du Verdunkelung benutzt dann kann das Licht kurz flackern oder blinken wenn es in eine andere Helligkeitsstufe übergeht. Das ist normales Verhalten und unvermeidbar.\r\n[/list]\r\n\r\n[center][size=+1][color=#FBEC5D][u]Bekannte Probleme[/u][/color][/size][/center]\r\n\r\nFür eine vollständige Liste aller bekannten Probleme liest [url=http://tesalliance.org/forums/index.php?/tracker/project-15-other-mods-for-tes-v-skyrim]hier[/url] nach.\r\n\r\n[list]\r\n[*]Wegen eines kürzlichen Skyrim-Updates musst du deinen Spielstand einmal speichern und laden um die Dialogoption “Zu deiner Laterne...“ zu erhalten.\r\n[*]Durch Dawnguard hinzugefügte Begleiter werden noch nicht unterstützt.\r\n[*]Inkompatibel mit tragbaren Laternen aus anderen Mods.\r\n[*]Getragene Laternen flackern immer noch nicht wie es bei Feuer üblich ist. Daran wird noch gearbeitet.\r\n[*]Die Reiselaterne verbrennt das Öl viel zu schnell wenn sich mehr als eine Flasche Lampenöl im Inventar befindet.\r\n[*]Die Verwendung von Zwergenöl wird in einem zukünftigen Update möglich sein.\r\n[/list]\r\n\r\n[center][size=+1][color=#FBEC5D][u]Häufig gestellte Fragen[/u][/color][/size][/center]\r\n\r\n[list]\r\n[*][b]\\\"Ist \\\"Wearable Lanterns\\\" kompatibel mit Bandoliers?\\\"[/b] Ja. Lies dazu bitte den Kompatibilitätsabschnitt.\r\n[*][b]\\\"Kann \\\"Wearable Lanterns\\\" kompatibel mit Bandoliers gemacht werden?\\\"[/b] Es ist bereits kompatibel.\r\n[*][b]\\\"Beeinträchtigen meine Laternen die Schleichfähigkeit?\\\"[/b] Ja. Du solltest deine Laterne wegstecken wenn du am schleichen bist. Begleiter werden automatisch ihre Laterne ausmachen sobald sie in Schleichposition gehen.\r\n[/list]\r\n\r\n[center][size=+1][color=#FBEC5D][u]Fehlerbehebung[/u][/color][/size][/center]\r\n\r\n[b]\\\"Ich habe die Reiselaterne zwar abgenommen, Licht wird aber immer noch ausgestrahlt!\\\"[/b]\r\nÖffne die Anleitung zu Laternenpflege (erhältlich bei den meisten Gemischtwarenhändlern), gehe auf: Einstellungen ? Fehlerbehebung ? Steckengebliebenes Licht. Dies sollte den Fehler beheben.\r\n\r\n[b]\\\"Ich habe die Reiselaterne angelegt aber sie strahlt kein Licht aus!\\\"[/b]\r\nÖffne die Anleitung zu Laternenpflege (erhältlich bei den meisten Gemischtwarenhändlern), gehe auf: Einstellungen ? Fehlerbehebung ? Kein Licht. Dies sollte den Fehler beheben.\r\n\r\n[b]\\\"Ich kann weder die Laternen noch die Anleitung zur Laternenpflege finden!\\\"[/b]\r\nWarte für 24 Spielstunden damit sich ihr Vorrat wieder auffüllt.\r\n\r\n[b]\\\"Ich würde gerne einen Fehler melden. Wie kann ich das machen?\\\"[/b]\r\nSieh dazu bitte unter der dem Abschnitt “Wie melde ich einen Fehler?“ nach.  Bei Nichteinhalten der unten beschriebenen Vorgehensweise wird die Nachricht gelöscht oder runtergewertet. Feedback, allgemeine Fragen und Wünsche sind stets willkommen und bedürfen keiner speziellen Form.\r\n\r\n[b]\\\"Ich habe meine Laterne in die linke Hand gewechselt und jetzt ist sie aus meinem Inventar verschwunden!\\\"[/b]\r\nNein, sie ist nicht verschwunden sondern wurde nur in die Sonstiger-Kategorie deines Inventars verschoben. So teilt Skyrim in der Hand getragene Lichter ein.\r\n\r\n[b]\\\"Ich verwende Ultimate Follower Overhaul / Amazing Follower Tweaks / Extensible Follower Framework, mein Begleiter will jedoch seine Laterne nicht benutzen.\\\"[/b]\r\nLass deinen Begleiter abziehen und heuer ihn wieder an. (Über die Standarddialoge)\r\n\r\n[b]\\\"Ich hab mit dem Buch die Helligkeit eingestellt und nachdem ich den Zurück-Knopf gedrückt habe hat es nicht funktioniert und ich kann das Menü nicht verlassen.\\\"[/b]\r\nDieser Fehler tritt bei einer viel älteren Version der Mod auf. Wahrscheinlich hast du erst kürzlich aktualisiert. Um das zu beheben musst du das Buch weglegen / fallen lassen / verkaufen und ein neues Exemplar bei einem Händler kaufen.\r\n\r\n[b]\\\"Es stehen keine Laternen zum Verkauf. Und wenn ich eine herstelle funktioniert sie überhaupt nicht! Hilfe!\\\"[/b]\r\nVersuch es mal mit der \\\"No BSA\\\"-Version (Welche ich leider hier leider nicht habe). Du hast wahrscheinlich Probleme Skriptdateien aus BSA-Archiven zu lesen, so wie die Mod regulär angeboten wird. Wahrscheinlich musst du auch deine Skyrim-Version aktualisieren. Im Moment wird nur Version 1.6.89.0 oder höher unterstützt. Aktualisiere das Spiel bitte falls nötig. Verzichte auch bitte auf den Gebrauch von Script Dragon, welches Probleme mit der Skriptausführung der Mod verursacht. SKSE ist Ordnung.\r\n\r\n[b]\\\"Ich habe meine Laterne ausgerüstet und der Arm meines Charakters hat eine komische Animation gespielt / Ich wurde zu einem anderen Ort teleportiert!\\\"[/b]\r\nDu benutzt gerade eine weitere Mod mit tragbaren/nutzbaren Laternen.  Zurzeit gibt es direkte Inkompatibilitätsprobleme mit diesen Mods. Es wird mit anderen Laternenmod-Autoren daran gearbeitet um die Fehler in den Griff zu kriegen. Lies dazu bitte den Kompatibilitätsabschnitt.\r\n\r\n[center][size=+1][color=#FBEC5D][u]Kompatibilität[/u][/color][/size][/center]\r\n\r\nVollauf kompatibel mit sämtlichen Mods welche Verkäufer überarbeiten, sowie Economics of Skyrim. Es werden Skripts benutzt um den Bestand der Gemischtwarenhändler aufzufüllen. Die eigentlichen Warentruhen der Verkäufer werden nicht verändert.\r\n\r\n[b][color=#FF2200]WICHTIG:[/color][/b] Inkompatibel mit anderen Laternenmods welche tragbare Handlaternen hinzufügen. Es wird zusammen mit anderen Modautoren an einem Kompatibilitätssystem für ihre jeweiligen Laternemods gearbeitet. Dazu gibt es bald noch mehr Infos. Wenn du eine andere Laternenmod neben dieser hier benutzt werden zwangsläufig komische Animationsfehler beim Ausrüsten der Laterne auftreten (entweder in dieser Mod oder der anderen, hängt von der Ladereihenfolge ab), sowie Teleportationen zu willkürlichen Orten beim anlegen oder ablegen.\r\n\r\nGetragene Laternen belegen den Slot 55 (hinten rechts) und Slot 57 (vorne rechts), die selben wie bei [url=http://skyrim.nexusmods.com/mods/16520]Bandoliers[/url] Vorder- und Hintertaschen welche die gleichen Slots belegen. Diese Mod ist dem Autor nach kompatibel mit Bandoliers, da keine Taschen und Laternen an der selben Stelle getragen werden können.\r\n\r\n[center][size=+1][color=#FBEC5D][u]Kontakt und Übersetzungsfehler[/u][/color][/size][/center]\r\n\r\n[center]Diese Mod wurde von [url=http://skyrim.nexusmods.com/users/187943]Chesko[/url] erstellt und von mir lediglich übersetzt. \r\nWenn euch Übersetzungsfehler auffallen oder ihr Verbesserungsvorschläge zur Schreibweise an einigen Stellen habt, dann schreibt mir bitte hier in den Kommentaren. [/center]\r\n\r\n[center][size=+1][color=#FBEC5D][u]Wie melde ich einen Fehler?[/u][/color][/size][/center]\r\n\r\n[center]Solltet ihr Bugs feststellen die das Troubleshouting nicht abdeckt dann schreibt an Chesko einen Bugreport per [url=http://forums.nexusmods.com/index.php?app=members&module=messaging§ion=send&do=form&fromMemberID=187943]PM[/url] oder in den [url=http://skyrim.nexusmods.com/mods/17416]Kommentaren auf der Hauptseite[/url]. Wie ein Bugreport auszusehen hat steht am Ende der englischen Modseite.[/center]\r\n\r\n[color=#404040][Line][/color]\r\n[right][b][u]Andere Übersetzungen von mir:[/u][/b]\r\n[url=http://skyrim.nexusmods.com/mods/24050]Magic Duel - German Translation (v1.1.4)[/url]\r\n[url=http://skyrim.nexusmods.com/mods/25027]Ritual Armor of Boethiah - German Translation (v4.23)[/url]\r\n[url=http://skyrim.nexusmods.com/mods/29518]Frostfall - Hypothermia Camping Survival - German Translation (v2.3)[/url]\r\n[url=http://forum.scharesoft.de/showthread.php?46511-Wet-and-Cold-DV-%28N%E4sse-und-K%E4lte%29]Wet and Cold - German Translation (v1.13)[/url]\r\n[url=http://forum.scharesoft.de/showthread.php?46154-Shooting-Stars]Shooting Stars - German Translation (v1.041)[/url][/right]",
  "categoryId": "27",
  "version": "2.2a",
  "author": "Chesko and translated by Slavovitsh",
  "createdUnix": "1342037427",
  "updatedUnix": "1359588435",
  "containsAdultContent": false,
  "uploadedBy": "Slavovitsh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84184",
      "name": "Laternen fuer Karavanen - Optionales Add-On",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1131",
      "fileName": "Laternen fuer Karavanen - Optionales Add-On-20315-1-0.zip",
      "uploadedUnix": "1345916810",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1a428bbd6151681300cf50693f37bdecef675d3472017641af25fc1a0c1445fe/analysis/1407121205/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Laternen%20fuer%20Karavanen%20-%20Optionales%20Add-On-20315-1-0.zip?fid=84184&ttl=1535788385&ri=8192&rs=8192&setec=19ac2fba77281f8426c772a97e488445"
    },
    {
      "fileId": "88262",
      "name": "Tragbare Laternen 2_2a -Deutsch-",
      "version": "2.2a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2123",
      "fileName": "Tragbare Laternen 2_2a -Deutsch--20315-2-2a.zip",
      "uploadedUnix": "1347564626",
      "modVersion": "2.2a",
      "virusScanUrl": "https://www.virustotal.com/file/0e396f190cfd368922da1b6be3d3b1c2e686d8c8ce05c7c2ac6c8341a3edbc84/analysis/1407163445/",
      "changelogHtml": " Kleines Update. Behebt einen Fehler bei dem die Laterne schwebt wenn der Spieler stirbt und neuladet. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tragbare%20Laternen%202_2a%20-Deutsch--20315-2-2a.zip?fid=88262&ttl=1535788386&ri=8192&rs=8192&setec=92a6bb2f3defa50e182e4c403e39f636"
    },
    {
      "fileId": "90537",
      "name": "Kerzenlaternen des Nordens - Optionales Add-On -Dawnguard-",
      "version": "1.1DG",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1044",
      "fileName": "Kerzenlaternen des Nordens - Optionales Add-On -Dawnguard--20315-1-1DG.zip",
      "uploadedUnix": "1348672851",
      "modVersion": "1.1DG",
      "virusScanUrl": "https://www.virustotal.com/file/72bee109dd2920e2fbaba01c3926087a41fa6aabeeb22a846bc4064ca9552aff/analysis/1407188045/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kerzenlaternen%20des%20Nordens%20-%20Optionales%20Add-On%20-Dawnguard--20315-1-1DG.zip?fid=90537&ttl=1535788386&ri=8192&rs=8192&setec=fc2b8eb01a69976e0afa8c1092b0ff2b"
    },
    {
      "fileId": "90538",
      "name": "Kerzenlaternen des Nordens - Optionales Add-On -Ohne Dawnguard-",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1038",
      "fileName": "Kerzenlaternen des Nordens - Optionales Add-On -Ohne Dawnguard--20315-1-1.zip",
      "uploadedUnix": "1348672924",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5904e4e9e58d068f9c191a0e6af6966f9ea698bb6d1952060e72706c4014f058/analysis/1407188048/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kerzenlaternen%20des%20Nordens%20-%20Optionales%20Add-On%20-Ohne%20Dawnguard--20315-1-1.zip?fid=90538&ttl=1535788387&ri=8192&rs=8192&setec=0597970c732119d8ab3ed1fe4a2e529b"
    },
    {
      "fileId": "1000001908",
      "name": "Laternen fuer Wachen - Optionales Add-On",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "876",
      "fileName": "Laternen fuer Wachen - Optionales Add-On-20315-1-0.zip",
      "uploadedUnix": "1358015674",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f5dd3b36e32f3d23310c961875440c6dbfee0fa1c5cc114d80ab40afb263046a/analysis/1407350024/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Laternen%20fuer%20Wachen%20-%20Optionales%20Add-On-20315-1-0.zip?fid=1000001908&ttl=1535788387&ri=8192&rs=8192&setec=6555347e1084601e08232e69422afc7c"
    },
    {
      "fileId": "1000006003",
      "name": "Wearable Lanterns 2_2a Deutsch",
      "version": "2.2a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6993",
      "fileName": "Wearable Lanterns 2_2a Deutsch-20315-2-2a.zip",
      "uploadedUnix": "1359588435",
      "modVersion": "2.2a",
      "virusScanUrl": "https://www.virustotal.com/file/402ff67948992b90c1f9410069cf186fb78a65e82805975844c0d9455a259db8/analysis/1407388091/",
      "changelogHtml": " Kleines Update. Behebt einen Fehler bei dem die Laterne schwebt wenn der Spieler stirbt und neuladet. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wearable%20Lanterns%202_2a%20Deutsch-20315-2-2a.zip?fid=1000006003&ttl=1535788387&ri=8192&rs=8192&setec=4ae764cc8ef82aab1a19c14a71203459"
    }
  ]
}