{
  "modId": 20324.0,
  "modName": "Stormbringer Chronicles - Runeblade - Chaos Lords Summoning",
  "summary": "This mod adds the Stormbringer runeblade (1h and 2h versions) and other lore from the Elric Saga and Champion Eternal multiverse.  Also includes lore companions (so far, Moonglum and Myshella).",
  "descriptionHtml": "[center][img]http://s19.postimage.org/kyzxskapf/Stormbringer_Chronicles_Logo.png[/img][/center]\r\nI\\'ve always enjoyed the Elric Saga and decided to (try and) bring to Skyrim some of my favorite lore from that series.  This mod adds the following:\r\n\r\n[list]\r\n[*]The Stormbringer runeblade with some powerful enchantments that give both active (on-hit) and passive (while equipped/sheathed) benefits (both 1h and 2h versions available)\r\n[*]Lore companions that include Moonglum, Elric\\'s erstwhile confidant, and Myshella, the Dark Lady of Kaneloon (see details below on Myshella as an \\\"intelligent\\\" companion ... or as \\\"intelligent\\\" as my limited ability the CK will allow :P)\r\n[*]The ability to summon Chaos Lords to help you in battle\r\n[/list]\r\n[img]http://s19.postimage.org/tdfkgnbqr/Current_Version_Small.png[/img]\r\nVersion 0.8, 2 August 2012\r\n\r\nUpdates in this version include:\r\n\r\n[list]\r\n[*]Fixed a rare condition whereby Stormbringer\\'s active/combat soul-steal cooldown would kill the player.\r\n[*]Reduced the \\\"8\\\" different ESP options back to the original 4 (1H/2H x ATTT/NoATTT) by updating original mesh references to be consistent with the optional ones.\r\n[*]Myshella\\'s heal and buff spells are now level-scaled, and her available spells generate dynamically (note she does NOT have Cerwiden\\'s config menu yet, will get around to that later once I finish Ceri\\'s menu)\r\n[*]Various other minor tweaks and clean-up.\r\n[/list]\r\nAll options are included in the main download file for convenience, in the StormbringerOptions directory.  After installing the main files, select the options you\\'d like (if any) and overwrite.\r\n\r\nIf you\\'re updating this mod and Myshella is in your party, I\\'d strongly recommend a clean save mod install.  If you really, really don\\'t want to do that, then dismiss Myshella, go to a different, interior cell and update the mod, then go back and re-recruit Myshella.\r\n\r\nFor more information about this mod, [b][color=orange]please see the FAQ below[/color][/b].  This is my first mod, so suggestions for improvement are very welcome!\r\n[img]http://s19.postimage.org/61cb07eib/Requirements.png[/img]\r\n\r\n[list]\r\n[*]Skyrim 1.6.89\r\n[/list]\r\nIf you\\'d like the NPCs added by this mod to look like the screenshots, you\\'ll need the following, but not having them won\\'t break anything:\r\n\r\n[list]\r\n[*][url=http://skyrim.nexusmods.com/mods/10168]Apachii SkyHair 1.3+[/url]\r\n[*][url=http://skyrim.nexusmods.com/mods/6709]UNP Base Skinny Body[/url]\r\n[*][url=http://skyrim.nexusmods.com/mods/7897]Envision Face for UNP[/url]\r\n[*][url=http://skyrim.nexusmods.com/mods/6923]Extended Slider Colors[/url]\r\n[/list]\r\n[img]http://s19.postimage.org/blk6x3nzn/Options.png[/img]\r\nThe main file now has all options including in a separate directory called \\\"StormbringerOptions\\\".  This directory includes ESPs for 1H/2H sword versions plus [url=http://skyrim.nexusmods.com/mods/9614]Armed-to-the-Teeth (ATTT)[/url] variants, as well as the original and optional meshes, plus  versions for each.  The default install is 1H-no-ATTT with original meshes/textures.  If you\\'d like to use any of the options, just copy over the original install with the desired options.\r\n[img]http://s19.postimage.org/5aezgomr7/Compatibility.png[/img]\r\nThis mod should be compatible with just about everything out there.  Please note that you may want to toggle off Myshella\\'s wardrobe feature if you use another mod that manages follower outfits; otherwise you may really confuse the poor girl.  :P\r\n[img]http://s19.postimage.org/bhqdguiib/Installation.png[/img]\r\n[list]\r\n[*][b]NMM Install/Upgrade:[/b]  Download via NMM or drag the archive into NMM and activate.  If you\\'re using an optional file, install the same way after the original and allow the overwrite.\r\n[*][b]Wrye Bash Install/Upgrade:[/b]  Drag the archive into the Installers Tab.  If you\\'re using an optional file, install the same way after the original and allow the overwrite.\r\n[*][b]Manual Install/Upgrade:[/b] Unpack the archive and copy the contents into your Skyrim install folder.  If you\\'re using an optional file, overwrite the original ESP with the optional version.  Unless otherwise specified for upgrade installations, simply overwrite your old version with the new.\r\n[/list]\r\nPlease note that there is only ONE download archive now; I\\'ve included all of the separate options in the main download for convenience, with all the options in the StormbringerOptions directory.  Additional instructions are included in the readme in the download.\r\n\r\nThis mod is included in BOSS; I recommend that you use it to assist with load order, particularly if you\\'ve got a lot of mods.  :)\r\n[img]http://s19.postimage.org/4fsfunewj/Uninstallation.png[/img]\r\nIf you are using my Cerwiden Companion mod in addition to Stormbringer Chronicles, please see special uninstall notes below under Manual Uninstall.\r\n[list]\r\n[*][b]NMM Uninstall:[/b]  Deactivate the mod in NMM and delete EXCEPT if you use Cerwiden, see Manual Uninstall notes below.\r\n[*][b]Wrye Bash Uninstall:[/b]  Select uninstall from the Installers Tab, if you use Cerwiden, don\\'t worry, Wrye Bash will take care of file differentials.\r\n[*][b]Manual Uninstall:[/b] In your Skyrim Data directory, delete the following files/folders:\r\n\r\nMujuroStormbringer.esp\r\ndocs\\\\MujuroStormbringer - Local Map Location.png\r\ndocs\\\\MujuroStormbringer - World Map Location.png\r\ndocs\\\\MujuroStormbringer - README.txt\r\nNOTE THAT IF YOU ARE NOT USING CERWIDEN, you can delete scripts\\\\*kcf*\r\nIF USING CERWIDEN, ONLY DELETE THE FOLLOWING FROM scripts\\\\ subdirectory or you\\'ll break Ceri:\r\n\t- scripts\\\\kcfMagicStormbringerLeechScript.pex\r\n\t- scripts\\\\QF_kcfFashionistaInitialize_02010DC1.pex\r\n\t- scripts\\\\kcfStormbringerYyrkoonScript.pex\r\n\t- scripts\\\\kcfChaosLordUnsummon.pex\r\n\t- scripts\\\\QF_kcfStormbringerInitialize_02005E27.pex\r\nmeshes\\\\actors\\\\character\\\\facegendata\\\\facegeom\\\\MujuroStormbringer.esp\r\nmeshes\\\\armor\\\\MujuroStormbringer.esp\r\nmeshes\\\\weapons\\\\MujuroStormbringer.esp\r\ntextures\\\\actors\\\\character\\\\FaceGenData\\\\FaceTint\\\\MujuroStormbringer.esp\r\ntextures\\\\armor\\\\MujuroStormbringer.esp\r\ntextures\\\\weapons\\\\MujuroStormbringer.esp\r\nsound\\\\voice\\\\MujuroStormbringer.esp\r\n[/list]\r\n[img]http://s19.postimage.org/q3he53far/FAQ.png[/img]\r\n[b][color=#A0522D]Q:  You\\'ve said for version X.X that I need a \\\"clean save\\\" mod install; how do I do that?[/color][/b]\r\n[b]A:[/b]  Please follow the steps below:\r\n[list]\r\n[*]1 Go to a location NOT the Riverwood Sleeping Giant Inn.\r\n[*]2 Take from Moonglum and/or Myshella any equipment you don\\'t want to lose, and say goodbye.\r\n[*]3 Save your game in a NEW slot (do not use quicksave), and exit Skyrim.\r\n[*]4 Uninstall the old version of Stormbringer Chronicles.\r\n[*]5 Load the save from 3, save AGAIN in a new slot (not quicksave) and exit Skyrim.\r\n[*]6 Install and activate the latest version of Stormbringer Chronicles.\r\n[*]7 If you use ASIS patcher, add StormbringerChronicles.esp to your ModExclusions section of ASIS.ini and rebuild your ASIS.esp.\r\n[*]8 Load your save from 5 and enjoy!.\r\n[/list]\r\n\r\n[b]A:[/b]  I strongly recommend that you do NOT use Stormbringer Chronicles along with any version of Cerwiden beyond v1.3.  This is because Ceri and Myshella share some of the same base code, but Ceri has progressed leaps and bounds beyond Myshella (who was actually my first \\\"smart\\\" follower. Cerwiden versions 1.4 and 1.5 will also have some conflicts, but they should not break the game (I\\'d still recommend against using though).\r\n \r\nWith the introduction of yet new AI elements in Cerwiden v1.6, there are some major conflicts that I simply CANNOT avoid without taking the time to upgrade Myshella\\'s AI, which I\\'ve simply not had time to do.  In any case, I\\'ll likely be folding some of the quest content I\\'d originally planned for Stormbringer Chronicles into Cerwiden\\'s mod.\r\n\r\n[b][color=#A0522D]Q:  How do I summon a Chaos Lord?[/color][/b]\r\n[b]A:[/b]  After completion of the Unbound (MQ101) quest, you\\'ll be given the Power Summon Lord of Chaos (you\\'ll get a notification on your screen when this happens).  This power may be used once per day, and is affected by your Conjuration skill.  Note that this is a POWER, so you can have 15 conjuration and still successfully summon one of the lords for 60 seconds.  With the Twin Souls vanilla perk, both Lord Arioch and Lady Xiombarg will answer your call, and for 120 seconds.\r\n\r\nIf for some reason the power isn\\'t showing up in your available powers list, you can get it through the console with \\\"player.addspell XX009E9C\\\" where \\\"XX\\\" represents the load order of the mod.\r\n\r\n[b][color=#A0522D]Q:  Where do I find the Stormbringer runeblade?[/color][/b]\r\n[b]A:[/b]  Venture to Bleakcoast Cave, the sword is located in the last room.  Beware, it\\'s guarded; if this battle is too rough, you may be able to get the trolls there to distract Prince Yyrkoon.  See uploaded images area for maps to the location.  \r\n\r\n[b][color=#A0522D]Q:  What are Stormbringer\\'s stats?  Can Stormbringer be improved/tempered?[/color][/b]\r\n[b]A:[/b]  Stormbringer is a one-handed sword with base damage 16 and some incredibly powerful enchantments.  The two-handed version has base damage 27.  Some additional information:\r\n\r\n[list]\r\n[*][color=#E6B88A]Benefits: [/color] In the Elric Saga, Stormbringer would drain the souls of enemies and give a portion of their vitality to the wielder.  As such, with each successful strike, Stormbringer\\'s wielder would gain strength.  For this mod, I\\'ve translated this effect as on-hit health/stamina absorb, soul trap AND increase in health/stamina (over your normal maximum) for a short time, and this effect stacks.   Currently, this is set at 15 health/stamina per-hit for 30 seconds.  Stormbringer also has a small chance of instantly killing an opponent.\r\n[*][color=#E6B88A]Passive Benefits:  [/color]While EQUIPPED, Stormbringer grants additional health and stamina.  This additional health/stamina will go away as soon as you unequip the sword, even if it is in your inventory.  If you use [url=http://skyrim.nexusmods.com/mods/9614]Armed-to-the-Teeth (ATTT)[/url], the benefits convey so long as the weapon is displayed on your person (e.g., the \\\"ATTT\\\" sheath is displayed).  Also, if you get into a real jam while in combat, Stormbringer will heal you for 500 health, but this will only happen once per day.\r\n[*][color=#E6B88A]Upgrading: [/color]To upgrade Stormbringer, you\\'ll need the Daedric Smithing + Arcane Blacksmith perks, plus an ebony ingot and daedra heart.\r\n[/list]\r\n[b][color=#A0522D]Q:  How can I defeat Prince Yyrkoon?[/color][/b]\r\n[b]A:[/b]  Remember that Yyrkoon is Melnibone\\'s best swordsman, and also a powerful conjurer.  And he has Mourneblade.  That said, Yyrkoon levels with the player (up to 81).  Depending on your level when you encounter him, he may be more/less powerful ... at very low levels, he can be devastating.  If you\\'re having difficulty, I\\'d recommend bringing along Moonglum and/or some of your favorite followers.  Or you can simply call on one of the Lords of Chaos to come and open a can of whoopass and beatdowns on the upstart usurper.  :P  Finally, you can get the sword through the console; you\\'ll need BOTH of the following lines, where XX represents the load order of the mod:\r\n\r\nplayer.additem XX095437 (Stormbringer sword, same ID for both 1h and 2h versions)\r\nplayer.addperk XX09D5BF (Stormbringer\\'s \\\"passive\\\" benefits)\r\n\r\n[b][color=#A0522D]Q:  Does Stormbringer need to be charged with souls?[/color][/b]\r\n[b]A:[/b]  For Stormbringer\\'s ACTIVE (on-hit) abilities, yes.  I\\'d considered making the enchantments free but decided against it.  Note that right now the per-use chage is so low that you can probably go quite a while without needing to recharge.  Stormbringer\\'s passive abilities don\\'t require charges, though I may change this in the future.\r\n\r\n[b][color=#A0522D]Q:  Where\\'s Mourneblade?[/color][/b]\r\n[b]A:[/b]  Currenly, Mourneblade is with Prince Yyrkoon, but he won\\'t give it to you ...  :P\r\n\r\n[b][color=#A0522D]Q:  How often may I summon the Chaos Lords, and for how long?[/color][/b]\r\n[b]A:[/b]  As a power, you may only (attempt) to summon them once per day, and they\\'ll stick around for 60 seconds (longer if your conjuration skill is high enough).\r\n\r\n[b][color=#A0522D]Q:  I\\'ve tried to summon the Chaos Lords but nothing happens?  WTF!?[/color][/b]\r\n[b]A:[/b]  Summoning is based on vanilla Skyrim conjuration rules and your conjuration skill.  So if you\\'re already full-up on summons, they won\\'t come, as they figure you really don\\'t need the help.  :P\r\n\r\n[b][color=#A0522D]Q:  Does the runic script in the title and on the sword have any significance?[/color][/b]\r\n[b]A:[/b]  The runic script is the Dragon language, and means \\\"Soul Tear Storm Call\\\".\r\n\r\n[b][color=#A0522D]Q:  Are the followers/companions like Moonglum and Myshella compatible with UFO, Wearable Lanterns, BDO and other follower-oriented mods?[/color][/b]\r\n[b]A:[/b]  Absolutely.  Note that my companions are set as \\\"protected\\\" but not essential, so they CAN die.  If you want them to be essential, you can use UFO to do so (or type \\\"help [companion name] in the console without the quotes to get the base ID, and then type \\\"setessential [base ID] 1\\\" without the quotes.\r\n\r\n[b][color=#A0522D]Q:  Where\\'s Moonglum, and what can he do?[/color][/b]\r\n[b]A:[/b]  He\\'s waiting for you at Riverwood\\'s Sleeping Giant Inn.  He\\'s a combat rogue with proficiencies in dual-wielding blades, light armor and archery, and can be married, recruited into the Blades, etc.\r\n\r\n[b][color=#A0522D]Q: Where can I find Myshella?[/color][/b]\r\n[b]A:[/b] Until such time as I\\'m able to build Kaneloon, she\\'ll be hanging with Moonglum at the Riverwood Sleeping Giant Inn.  She\\'ll wear any armor (but see below), is decent with staves and one-handed weapons in a pinch but generally prefers destruction spells at higher levels.\r\n\r\n[b][color=#A0522D]Q: What \\\"intelligent\\\" spells will Myshella cast?[/color][/b]\r\n[b]A:[/b] Assuming she\\'s high enough level, she\\'ll cast heal/defensive buff spells on you and other party members (including Moonglum, Housecarls, hirelings, etc., if they are in your party).  The range of her \\\"intelligent\\\" spells are anywhere from 50-100ft, so she\\'ll generally be able to cover you even if you\\'re in the thick of melee and she\\'s tossing spells from relative safety.  She\\'ll also cure you if you\\'ve contracted any of the more common diseases, but generally won\\'t do so until AFTER battle (she\\'d wise enough to understand that you may just get diseased again before the battle is done and she\\'d rather save magicka).\r\n\r\n[b][color=#A0522D]Q: What sort of magicks does Myshella specialize in?[/color][/b]\r\n[b]A:[/b] In addition to the party-oriented spells, she\\'ll cast standard destruction-type spells, assuming she has the skill/level and mana.  This means that she\\'s somewhat limited in her offensive capability at very low levels, so I\\'ve also given her a staff weapon to supplement her spells (so please don\\'t take the staff from her unless you really, really need to).  She\\'ll automatically switch weapons when she\\'s higher level.\r\n\r\n[b][color=#A0522D]Q: How often does Myshella change outfits?[/color][/b]\r\n[b]A:[/b] She\\'ll only change when she\\'s not an active follower (e.g., she\\'s either in UFO\\'s \\\"relax\\\" mode or has been dismissed), and even then maybe couple of times a day.  If you\\'d like her to think more about her next outfit (e.g., consider changing outfits more frequently), you can do so by typing in the console \\\"set kcfFashionistaMyshellaTimer to XX\\\", without the quotes, where \\\"XX\\\" represents the number of game-hours.  Currently, the default is set to 4; if you\\'d like her to \\\"consider\\\" changing outfits every 30 game-minutes, enter \\\"set kcfFashionistaMyshellaTimer to .5\\\".  I strongly recommend AGAINST setting it at anything less than .25.\r\n\r\n[b][color=#A0522D]Q: What outfits will Myshella change to?[/color][/b]\r\n[b]A:[/b] I\\'ve set her wardrobe to some of my personal favorites of outfits by some amazing modders, including a couple of Hentai\\'s sets, DoctorPepper\\'s Tribunal Robes (heavy black) and NPR\\'s Torumekian Armor.  Sometimes, she\\'ll continue to wear whatever you give to her.  If you\\'re comfortable using the CK, you can change the outfits to ones you prefer.\r\n\r\n[b][color=#A0522D]Q: How will Myshella\\'s outfit changes affect gear I give her?[/color][/b]\r\n[b]A:[/b] When she\\'s an active follower, she\\'ll use whatever you give to her just like any other companion.  If she\\'s not wearing her \\\"best\\\" gear, just take a piece from her inventory and give it back to her and she\\'ll reset.  Or you can use UFO\\'s \\\"You could dress better\\\" option to do the same.\r\n\r\n[b][color=#A0522D]Q: I don\\'t want Myshella changing outfits, can I disable this?[/color][/b]\r\n[b]A:[/b] You should get a new lesser power in your spells menu called \\\"Myshella Wardrobe Management\\\" that allows you to toggle this feature on/off.  When first loading the game after installing version 0.7+, you should get a message at the top-left of your screen notifying you of this new spell.  If for some reason you\\'re not getting the spell automatically, type into the console \\\"set kcfFashionistaMyshella to 0\\\" without the quotes.\r\n\r\n[img]http://s19.postimage.org/u2elnx3xv/Credits.png[/img]\r\nSpecial thanks to the following modders who kindly gave me permission to incorporate their amazing work into this mod:\r\n\r\n[list]\r\n[*][b][color=#FFCC98]1096bimu[/color][/b] for [url=http://skyrim.nexusmods.com/mods/3542]Sabers Swords[/url]\r\n[*][b][color=#FFCC98]volvaga0[/color][/b] for [url=http://skyrim.nexusmods.com/mods/11005]Angelic Halos and Demonic Horns[/url]\r\n[*][b][color=#FFCC98]Guffeh[/color][/b] for [url=http://skyrim.nexusmods.com/mods/15692]Alduin\\'s Wings[/url]\r\n[*][b][color=#FFCC98]NULL9[/b][/color] and [b][color=#FFCC98]Syndharos[/color][/b] for [url=http://skyrim.nexusmods.com/mods/15692]Male Cleric Armor[/url]\r\n[*][b][color=#FFCC98]garryg[/color][/b] for [url=http://skyrim.nexusmods.com/mods/3104]Daedric Armor and Weapon Improvement[/url]\r\n[*][b][color=#FFCC98]pnkrd[/color][/b] for [url=http://skyrim.nexusmods.com/mods/5803]Crown Helmets[/url]\r\n[*][b][color=#FFCC98]Hentai[/color][/b] for [url=http://skyrim.nexusmods.com/mods/11548]A Clothes by Hentai[/url]\r\n[*][b][color=#FFCC98]Hentai[/b][/color] and [b][color=#FFCC98]person123456789[/color][/b] for [url=http://skyrim.nexusmods.com/mods/7010]Seraphim Armour Skyrim Edition[/url]\r\n[*][b][color=#FFCC98]iLily[/b][/color] and [b][color=#FFCC98]Hentai[/color][/b] for [url=http://skyrim.nexusmods.com/mods/7478]Dark Seraphim[/url]\r\n[*][b][color=#FFCC98]NPR[/color][/b] for [url=http://skyrim.nexusmods.com/mods/16870]R18Pn 07 - Torumekian Armor[/url]\r\n[*][b][color=#FFCC98]DoctorPepper[/color][/b] for [url=http://skyrim.nexusmods.com/mods/20077]Tribunal Robes Set[/url]\r\n[/list]\r\nOther credits and huge kudos:\r\n\r\n[list]\r\n[*][b][color=#FFCC98]Kevin Kidder[/color][/b] for [url=http://skyrim.nexusmods.com/mods/7245]Specialized Followers[/url] (inspiration and techniques on building better followers)\r\n[*]Cutthroat Mods for the amazing tutorial on creating followers\r\n[*]Bethesda for Skyrim\r\n[*]Michael Moorcock for the Elric Saga and Eternal Champion series\r\n[*]Dan Smith for the Tengar Sindarin font\r\n[*]USEP Skyrim for the Dragon language font\r\n[*]David Brasher for his wonderful modding tutorials\r\n[/list]",
  "categoryId": "55",
  "version": "0.8",
  "author": "Mujuro",
  "createdUnix": "1342048127",
  "updatedUnix": "1346515948",
  "containsAdultContent": false,
  "uploadedBy": "Mujuro",
  "primaryFile": null,
  "files": [
    {
      "fileId": "85755",
      "name": "Stormbringer Chronicles Main - BSA Version",
      "version": "0.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "111746",
      "fileName": "Stormbringer Chronicles Main - BSA Version-20324-0-8.7z",
      "uploadedUnix": "1346515948",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/951bd36892011231576cc96c62d32fef4543ec380beedd97544d11ab73060d2c/analysis/1407138508/",
      "changelogHtml": " Fixed a rare condition whereby Stormbringer\\'s active/combat soul-steal cooldown would kill the player <br/> \n Reduced the \\\"8\\\" different ESP options back to the original 4 (1H/2H x ATTT/NoATTT) by updating original mesh references to be consistent with the optional ones <br/> \n Myshella\\'s heal and buff spells are now level-scaled, and her available spells generate dynamically (note she does NOT have Cerwiden\\'s config menu yet, will get around to that later once I finish Ceri\\'s menu) <br/> \n Various other minor tweaks and clean-up <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stormbringer%20Chronicles%20Main%20-%20BSA%20Version-20324-0-8.7z?fid=85755&ttl=1535788401&ri=8192&rs=8192&setec=e55f500143e2708d38703c3f8c426a4d"
    }
  ]
}