{
  "modId": 20335.0,
  "modName": "The Autumn of Whiterun",
  "summary": "This mod changes the look of Whiterun to a dense, autumn-themed forest with lanterns, carts, and other decorations that make the town seem more lively and enjoyable!",
  "descriptionHtml": "Hello everyone! This is the first mod I have ever made for Skyrim. I know that mods have been made to change Whiterun and add trees, but this mod goes beyond your common sapling and birch tree.\r\nMy intent for the mod was to give Whiterun a seasoned look; in this case it is autumn! I have added many other things besides a dense forest to Whiterun. I used common objects such as carts, barrels, and street lanterns to raise the spirit of the town from a dreary old wasteland to a cheerful village!\r\nI greatly appreciate all the feedback I can get on this. Once again , it is my first mod and I want to make it the best it can be! Please leave a comment or message me if you find any mistakes or things that you think need some fixing!\r\nFeel free to edit this mod as you like, but I made it from scratch so please give me some credit!\r\nFor more pictures and download on Steam, go here:\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=81082097&searchtext=\r\n(15000+ Downloads on Steam!)\r\n-------------------------------------UPDATES-------------------------------------\r\nV1.2\r\n-\tThere is a forest outside of Whiterun leading into the city.\r\n-\tThe new forest slowly recedes into the wastelands that are the plains of the Whiterun Hold.\r\nV 1.1\r\n-\tTrees inside the city are visible from outside the walls\r\n(This update is mostly for testing purposes, nothing big.)\r\nV 1.0 \r\n-\tWhiterun is completely filled with an autumn themed forest.\r\n-\tLanterns fill the streets,\r\n-\tSmall and unique additions to add theme to the city.\r\n-\tAnd more!\r\n-------------------------------------COMPATIBILITY-------------------------------------\r\nNo known issues yet! If you run into any problems, be sure to tell me. Thanks!\r\n\r\n-------------------------------------HOW TO INSTALL-------------------------------------\r\n1. Extract the file: \\\"The Autumn of Whiterun.esp\\\" (Without the quotations)\r\n\r\n2. Move \\\"The Autumn of Whiterun.esp\\\" into your Skyrim data folder.\r\n\tThis can be found at:\r\n\tC:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\r\n\r\n3. Once the file is placed in the Data folder, launch Skyrim.\r\n\r\n4. Before selecting \\\"Play\\\", select \\\"Data Files\\\"\r\n\tThis should open a list of mods you have already installed.\r\n\r\n5. Scroll down the list of mods until you find the one named \\\"The Autum of Whiterun\\\".\r\n\r\n6. Click the check box next to the title.\r\n\r\n7. Close the Data Files window and click \\\"Play\\\".\r\n\r\n\r\nHooray! The mod should now be correctly loaded. If the game prompts you to choose yes or no when playing\r\nthe game because some of the game objects may not exist, simply click yes and their should not be any\r\nproblems.\r\n\r\nIf you run into any other errors, please contact me on the skyrim nexus by leaving a comment.\r\n\r\n-------------------------------------TO-DO LIST-------------------------------------\r\nNot Done:\r\n...\r\nDone:\r\n1.2\tBlend the foliage\r\n1.2   Turn the out-of-city farms into a slowly receding forest.\r\n1.1\tMake the trees inside the gate visible from the outside.  ",
  "categoryId": "53",
  "version": "1.2",
  "author": "Barothoth",
  "createdUnix": "1342061185",
  "updatedUnix": "1342061369",
  "containsAdultContent": false,
  "uploadedBy": "Barothoth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "73740",
      "name": "The Autumn of Whiterun",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "169",
      "fileName": "The Autumn of Whiterun-20335-1-2.rar",
      "uploadedUnix": "1342061369",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/6f9ffb5655421eb1b4f485586e0985bffe25c01a0b2ee2b1a52be6be1aec939f/analysis/1407017228/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Autumn%20of%20Whiterun-20335-1-2.rar?fid=73740&ttl=1535788413&ri=8192&rs=8192&setec=0b3d803a3bb15c5230f4b9edc34905fa"
    }
  ]
}