{
  "modId": 20345.0,
  "modName": "FTFI Fast Travel From Indoors",
  "summary": "This mod allows you to fast travel anywhere in the world from all indoors, including dungeons, except from prisons. ",
  "descriptionHtml": "[center][youtube]lXjhqkTBg6k[/youtube]\r\nGreat little video from Memorable[/center]\r\n\r\nThis is a simple mod that allows you to fast travel from any interior. This means you can fast travel from all dungeons and all buildings in the game, however you cannot fast travel from prisons.\r\n\r\nThis mod was not made to aid cheating, even though it can be used that way. You might also be able to fast travel from locations you are not supposed to fast travel from. (Such as quests where your character is meant to be imprisoned or in a dream state.) It is up to you to use this mod in a realistic manner, and if you cannot control yourself or decide to abuse it and possibly break your game in the process, then that is not my fault. \r\n\r\nI am open to suggestions for places that fast travel SHOULD be disabled.\r\n\r\nThe primary goal of this mod is to speed up game play for those people with low end pc\\'s that hate having to see two load screens just to go to one place. I found it frustrating on a low end laptop to have to walk all the way to a door, click on it, wait for a loading screen just to get outside where fast travel was enabled, then open my map, click on a location to be greeted to another loading screen.\r\n\r\nIt is also helpful for people like me who have a family and don\\'t have much time to play and so waiting for load screens or walking back through empty dungeons or all the way out of interiors becomes a waste of valuable time.\r\n\r\nLoad Order is important with this mod. You need to load it after any mod that alters cells, that is virtually every lighting mod, player home, anything of that nature. I would load it last in your load order, even after mods such as Realistic Lighting or it just won\\'t work. Loading it last shouldn\\'t break anything.\r\n\r\nThis is a nexus only mod.\r\n\r\nEnjoy!\r\n\r\nSydney666\r\n",
  "categoryId": "24",
  "version": "1.0",
  "author": "Sydney666",
  "createdUnix": "1342077044",
  "updatedUnix": "1342077155",
  "containsAdultContent": false,
  "uploadedBy": "sydney666",
  "primaryFile": null,
  "files": [
    {
      "fileId": "73768",
      "name": "FTFI Fast Travel From Indoors",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "53",
      "fileName": "FTFI Fast Travel From Indoors-20345-1-0.7z",
      "uploadedUnix": "1342077155",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e45c558d621a6e8071806e523f76c4169eed460283aadd2d5f9986980d6f635b/analysis/1407017536/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FTFI%20Fast%20Travel%20From%20Indoors-20345-1-0.7z?fid=73768&ttl=1535788425&ri=8192&rs=8192&setec=1991098f882c71f51e0a895bd8e9cb7d"
    }
  ]
}