{
  "modId": 20367.0,
  "modName": "Torchbug Firefly Pets Standalone",
  "summary": "Adds Equippable Torchbug pets to the game. Comes in different colors.",
  "descriptionHtml": "I would like to ask that if you like this mod PLEASE ENDORSE IT. Why? For no other reason then to make me feel better about myself. If you have any comments OR suggestions PLEASE comment and let me know! I don\\'t check every day but I AM still active, I WILL get back to you.\r\n\r\n[b][center][size=7][color=red]Torchbug Pets[/color][/size][/center][/b]\r\n\r\n[center][youtube]9KZWo57DRus[/youtube][/center]\r\n\r\n[center][youtube]GqSKMhK3TB4[/youtube][/center]\r\n[center][size=1]A new video to highlight interaction between the two pets[/center][/size]\r\n[b][center][size=5][color=yellow]*BASIC DESCRIPTION*[/color][/size][/center][/b] \r\n\r\nAdds an assortment of colored Torchbug Pets for your character ( please see screen shots for the different colored options and the light that they cast ). These can be crafted under misc section of the forge and require a firefly thorax ( or basically for you to /catch/ a torchbug ). There are 2 versions of each Torchbug pet. A light source and a NON-light source version.  The light source version gives off a colored light ( of your choosing ) that acts like you had a torch held in your left hand, WITHOUT having to have the torch in you hand ( very useful for ENB users ).\r\n\r\n*NOTE* If you are a stealthy character the torchbug pets that are lighted act as a light source! This is the same as if you had a torch in your hand, so it WILL make you easier for the enemy to see you! Take that into consideration :) If you get stealth up high it is not so bad, just like it is not so bad with a torch. Get to work on that stealth people! :)\r\n\r\n[b][center][size=5][color=yellow]*UPDATE NOTES*[/color][/size][/center][/b] \r\n\r\nV0.1 Initial release. Adds 4 colored torchbug pets that do not give off light for your character to equip.\r\n\r\nV0.2 added a new torchbug, White Albino. Added Glowing light source version of all torchbug pets.\r\n\r\nV0.2a Added 2 new colored Pets, Purple and Teal. Added optional file re-placer for the red torchbug to use 83Willows 101Bugs Red firefly Textures.\r\n\r\nV0.2b Added a new Colored pet, Orange. FIXED inventory Icons. You can now see each Torchbug and its color in the inventory / crafting menus.\r\n\r\nV0.2c Fixed Compatibility with Beast Races. They should now work for everyone.\r\n\r\n[b][center][size=5][color=yellow]*INSTALLING*[/color][/size][/center][/b] \r\n\r\nExtract the download to your skyrim/data folder. If you used an earlier version of this mod you will be asked to overwrite. Say yes. Load Nexus Mod Manager OR the Skyrim Launcher and activate Torchbug Pets.esp. You may also use the NMM to install.\r\n\r\n\r\n[b][center][size=5][color=yellow]*CONFLICTS*[/color][/size][/center][/b] \r\n\r\nThis mod should have ZERO problems. If it does let me know.\r\n\r\n\r\n[b][center][size=5][color=yellow]*COMPATIBILITY AND INTERACTION*[/color][/size][/center][/b]\r\n[b][center][size=3][color=red]*With Wearable Lanterns*[/color][/size][/center][/b]\r\n\r\nThis mod is FULLY compatible with Chesko\\'s Wearable Lanterns, his light sources will over-ride these. You can either wear the lanterns and have a Torchbug Pet ( either lighted or non-lighted ) OR you can use my original Wearable Lanterns Torchbug Pet file replacer to release Chesko\\'s Torchbug from it\\'s Jar! Why would you want to do this you ask? Well when I designed the Standalone option of these pets I kept the original Re-placer in mind and tried to make the two torcgbugs interact with one another! While it is not PERFECT, it is a pretty neat effect. If you think a torchbug pet is cool, try having two :)\r\n\r\n[URL=http://skyrim.nexusmods.com/mods/19912]Go HERE to find the interactive wearable lanterns re-placer[/url] and follow the directions listed there. You will need Wearable Lanterns By Chesko, [center][url=http://skyrim.nexusmods.com/mods/17416] YOU CAN FIND IT HERE[/url][/center]\r\n\r\n[b][center][size=3][color=red]*With 83Willows 101Bugs*[/color][/size][/center][/b]\r\n\r\nYou can re-place the ugly default textures of all the Torchbugs EXCEPT the White Albino one I made ( that should currently be the only texture in your textures/torchbugPets folder ) with 83Willow\\'s FANTASTIC 101bug textures! [s]I will also work on adding in an optional RED TORCHBUG that uses 83Willow\\'s red firefly textures when I get the chance.[/s] This is now DONE. Remember you MUST go get 83Willows 101bugs if you want to use THEIR TEXTURES.\r\n\r\nThis optional file re-placer is also a little different then the standard red one. The passive red glow of the firefly has been toned down to match that of the softer red textures of 83Willows 101Bugs. I used the same passive red that Chesko used for the red firefly in his wearable lanterns, but for the time being, to keep the two different and unique, the active light source will still be much more powerful red glow.\r\n\r\n[center][url=http://skyrim.nexusmods.com/mods/4955]GO HERE AND GET 83WILLOW\\'s 101BUGS[/url][/center]\r\n\r\n\r\n[b][center][size=5][color=yellow]*LONG DESCRIPTION*[/color][/size][/center][/b]\r\n\r\n\r\nWell I had started work on it a while back, and a few comments on my replacer made me realize that I was overwriting some of Chesko\\'s work with my replacer, so I went ahead and made a standalone for the sake of completeness. :)\r\n\r\nSome notes on the difference between the two versions :\r\n\r\nThis standalone uses a slightly changed flight path then the other one. I took a while to set this up like this for a reason. If you use both this stand alone pet AND the replacer for the wearable lanterns, the two torchbugs will /chase/ each other around, I was going for an interaction effect between the two. See attached screen shot for an idea of what I mean. \r\n\r\nI was NOT going to release a glowing version of these bugs, since the idea came to me thanks to Chesko and 83Willow, and I couldn\\'t see myself just copying Chesko\\'s light sources, even though he told me I could! So you know what Chesko did? That son of a *censored* actually helped me learn how to do it myself and build it from the ground up! ( well except for an 8 line bit of script he wrote for me! ). Chesko is, I must say again, THE MAN. This spot used to say you had to ask him, and he said he wouldn\\'t do it, so if you guys like the glowing Pets, don\\'t forget to drop by Chesko\\'s mods and tell him THANK YOU! :)\r\n\r\n\r\n[b][center][size=5][color=yellow]*CREDITS*[/color][/size][/center][/b]\r\n\r\nI would like to thank Chesko and 83Willow, whom without their mods I wouldn\\'t have come up with this idea in the first place. Also need to thank 83Willow for telling me my main mod page format was not so nice and encouraging me to clean it up.\r\n\r\n[b][center][size=5][color=yellow]*FUTURE PLANS*[/color][/size][/center][/b]\r\n\r\nNONE at the moment. The mod now feels complete, though I am open to suggestions. Enjoy.\r\n\r\n[s]Fix inventory Icon ( it is there, it is just to high, I will get around to it, I didn\\'t make a separate inv for it yet. )[/s]\r\n\r\n[s]Possibly add more colors. While my wife is currently playing New Vegas, she told me she would want a purple one.... so ya I guess purple is going to happen sooner or later :P Pretty much any color can be created, it just takes some time, so I started with basic colors.[/s]\r\n\r\n[s]Add 83Willows Wonderfull red firefly textures as an optional file ( if you download it you will then HAVE to have 83Willows 101bugs, or you use my standard crappy one ). This is just changing some file paths, so I will try to get around to doing this in the next few days.[/s]\r\n\r\n\r\n[b][center][size=5][color=yellow]*ASSETS USED*[/color][/size][/center][/b]\r\n\r\n\r\nBase torchbug pet mesh and textures are from skyrim. For modders, this mod uses 61-FX01 for equipment slot. I noticed it was under used so hopefully every one can use these pets and not have it conflict with other equipment. This also lets the Torchbug act a bit more static, so I could achieve the interaction effect with Chesko\\'s Torchbug.\r\n\r\n[b][center][size=3][color=blue]Main page edits[/color][/size][/center][/b]\r\n\r\n*edit* gave a better description of installation.\r\n\r\n*EDIT* I THINK(?) I made it NMM ( Nexus Mod Manager ) compatible. If not and it does not install correctly then please let me know.\r\n\r\n*EDIT* For the love of everything good in the world I\\'m sorry for so many edits in one day. This was my first standalone mod and my mainpage description has needed to be updated changed a lot. Getting the hang of things as they say. Sorry again I HOPE this is my last edit :P\r\n\r\n*EDIT* I know, I suck.\r\n\r\n*EDIT* added new screen shots to show off the new glowing Torchbug Pets and their effects.\r\n\r\n*EDIT* Main Mod page should now be looking nicer with easier headers and links. Thank again 83Willow for encouraging me to clean it up :P\r\n\r\n*EDIT* added a note to the basic description on how lighted versions WILL effect stealth.\r\n\r\n*EDIT* added a new video to show interaction with WEARABLE LANTERNS.\r\n\r\n*edit* fixed up some MINOR typos ( like double ll and stuff ). That stuff drives me nuts when my hands shake and I make them. If you see any more PLEASE let me know. I HATE typos ( I am an UN-oppressive Grammar Nazi. Do what you like, but MY typos drive me NUTS ).\r\n\r\n*edit* added more to the COMPATIBILITY under 101bugs section as to why you should get 101bugs. No I\\'m not being payed, or coerced, I just think they are nicer. I always have. GET THEM.\r\n\r\n[size=1] *edit* fixed more typos. Did I get them all?.[/size]\r\n\r\n*EDIT* updated the main page to let people know I am still alive, and STILL open to suggestions about this mod ( Why don\\'t you like it / why do you like it? Etc ) Updated 3/21/13",
  "categoryId": "27",
  "version": "1.Final",
  "author": "Shaydow",
  "createdUnix": "1342110216",
  "updatedUnix": "1352825421",
  "containsAdultContent": false,
  "uploadedBy": "Shaydow",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74672",
      "name": "83Willows 101Bugs Red firefly File Re-placer",
      "version": "0.2a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "16",
      "fileName": "84Willows 101Bugs Red firefly File Re-placer-20367-0-2a.zip",
      "uploadedUnix": "1342440199",
      "modVersion": "0.2a",
      "virusScanUrl": "https://www.virustotal.com/file/18582fe69c86f05a80d1957f8aa592909c36d09bee9b1b0b3944efce3a2fe37e/analysis/1407026047/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/84Willows%20101Bugs%20Red%20firefly%20File%20Re-placer-20367-0-2a.zip?fid=74672&ttl=1535788461&ri=8192&rs=8192&setec=236a68e85a3b46fd04fe0c04ba8ab674"
    },
    {
      "fileId": "74694",
      "name": "Torchbug Pets v2b",
      "version": "0.2b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "310",
      "fileName": "Torchbug Pets v2b-20367-0-2b.zip",
      "uploadedUnix": "1342445324",
      "modVersion": "0.2b",
      "virusScanUrl": "https://www.virustotal.com/file/e6f42ac1d7de74e446309326e88dd545995095bfef3d014154d8c4d42af9420e/analysis/1407026225/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Torchbug%20Pets%20v2b-20367-0-2b.zip?fid=74694&ttl=1535788461&ri=8192&rs=8192&setec=4416a577b9e53e2cc90817cbc9cf4678"
    },
    {
      "fileId": "99251",
      "name": "Torchbug Pets Final",
      "version": "1.Final",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "33",
      "fileName": "Torchbug Pets V2c-20367-1-Final.7z",
      "uploadedUnix": "1352825421",
      "modVersion": "1.Final",
      "virusScanUrl": "https://www.virustotal.com/file/84f95f9ae00400312543ab1903eecb69b27636f08846e8d608d36148f550d782/analysis/1407261547/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Torchbug%20Pets%20V2c-20367-1-Final.7z?fid=99251&ttl=1535788462&ri=8192&rs=8192&setec=319b25dc6610d9ca0e45b76871d84580"
    }
  ]
}