{
  "modId": 20368.0,
  "modName": "Realistic Mages College",
  "summary": "Changes the Mages College to be more like an actual college - go to classes, learn spells, pass tests and exams, go on field trips etc.",
  "descriptionHtml": "This mod is for people who were disappointed with the Mages College in the sense that it does not really feel like you have joined a college.\r\n\r\nDESCRIPTION:\r\n\r\nIt adds new quest-lines to Mages College, \\\"Classes\\\" for each of the magic areas, so \\\"Destruction Class\\\", \\\"Conjuration Class\\\", \\\"Illusion Class\\\", \\\"Alteration Class\\\" and \\\"Restoration Class\\\". To start off each Classes quest-line, you must enroll in the class. To enroll in a class, you must go into the Hall of the Elements between 6am-7am or when you first enter the area. There will be teachers from each class standing around the middle of the room. To enroll, you must go and speak to them and ask to be enrolled.\r\n\r\nThe class quest line is designed to teach you about your chosen subject(s), teach you new spells, and give you the chance to try them (in class and on field trips). Your teacher may decided to set tests every now and again, so always be prepared, there will also be end of term exams, which if you pass, you can progress to a higher, and hence more difficult class. The classes go from \\\"Novice\\\" to \\\"Expert\\\" level - to learn master level spells you must get \\'private tuition\\' with the best teacher from that subject - aka, master level spells are unlocked the same way.\r\n\r\nOnce you have graduated , you will be able to pursue the standard College of Winterhold quest line starting at the \\\"Under Saarthal\\\" - why would the college trust a new student in a dig site like Saarthal?\r\n\r\nINSTALLATION:\r\n\r\nDownload the file and extract the contents of the .RAR file to skyrim/data folder",
  "categoryId": "79",
  "version": "1.0",
  "author": "Soul Limit",
  "createdUnix": "1342110656",
  "updatedUnix": "1342110656",
  "containsAdultContent": false,
  "uploadedBy": "SoulLimit",
  "primaryFile": null,
  "files": []
}