{
  "modId": 20396.0,
  "modName": "Dragon Priest Mage Hoods",
  "summary": "Gives the dragon priest masks hoods to match the college mage robes.",
  "descriptionHtml": "*UPDATE*\r\n\r\nMale support is finished! Let me know if there are any issues. Unfortunately, There is no way for me to hide beards, so if your male has a large beard, it will clip through the mask. Also, the nose will clip through Konahrik unles it\\'s set rather short. Other then that, they should be alright.\r\n\r\nI also fixed Volsung\\'s mask. I accidently misspelled Corondrum. It should be working like the rest now. I\\'ve also changed the weight of each mask to weigh less. So now the masks won\\'t be as much of a burden.\r\n\r\n-------------------------------------\r\n\r\nThis mod is a very basic mesh edit which removes the hood attached to the Dragon Priest mask (Yeah, the hood that clips and doesn\\'t match with ANY piece of clothing or armor in game), and instead, makes it use the hoods from the College of Winterhold robes.\r\n\r\n[b]Only the female hoods have been altered so far![/b]\r\n\r\nI just made these for my own use and because my male character is not a mage, he never wears these masks or mage robes. My female character, on the other hand, uses nothing but magic! \r\n\r\n[b]If enough people take interest in this mod and request for male support in the comment section, I will be more then happy to convert them as well![/b]\r\n\r\nI\\'m aware that some of the enchantments aren\\'t necessarily for mages only but, because the default hoods don\\'t go with any clothing anyways.. You catch my drift, I\\'m sure.\r\n\r\nThere are 10 (thats ten) masks in total. Including Konahrik and the Wooden Mask. Konahrik (obviously) has been fitted to the Arch Mage hood. If you would like the Archmage\\'s Robes with out the hood automatically attached, FORM ID for this is; 0007C932.\r\n\r\nIf you would very much like to see support for males or think that a particular mask should be with a different hood, (for example, Say you think Krosis should use the Apprentice Hood instead of Adept) Please leave a comment and I will consider your suggestion.\r\n\r\nIf you have any problems let me know and I\\'ll get them worked out ASAP. I should also mention that this mod does not change change the mage hoods! The mage hoods will be just as they were before. This only changes the Dragon Priest masks.",
  "categoryId": "60",
  "version": "1.0",
  "author": "Kataous",
  "createdUnix": "1342144228",
  "updatedUnix": "1342208742",
  "containsAdultContent": false,
  "uploadedBy": "Kataous",
  "primaryFile": null,
  "files": [
    {
      "fileId": "73914",
      "name": "Dragon Priest Mage Hoods",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1507",
      "fileName": "Dragon Priest Mage Hoods-20396-1-0.zip",
      "uploadedUnix": "1342144264",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/893468aa0d13ae23ae303a778f1b9c2498fdb09503c7bc87199e9f345cb9e58b/analysis/1407019032/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Priest%20Mage%20Hoods-20396-1-0.zip?fid=73914&ttl=1535788511&ri=8192&rs=8192&setec=9f6835088ed8ddd26e6ef93332bcda43"
    },
    {
      "fileId": "74047",
      "name": "Dragon Priest Mage Hoods 1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1415",
      "fileName": "Dragon Priest Mage Hoods 1_1-20396-1-1.zip",
      "uploadedUnix": "1342208742",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1f05fab80cc54847532398f36606111403ec1aa9c2d362c0792e2630c853eeee/analysis/1407020167/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Priest%20Mage%20Hoods%201_1-20396-1-1.zip?fid=74047&ttl=1535788512&ri=8192&rs=8192&setec=e56c2461cebd9a198cd24ee69ae44978"
    }
  ]
}