{
  "modId": 20417.0,
  "modName": "Gondorian Ranger Bow and Arrows - LOTR",
  "summary": "Read the Description!",
  "descriptionHtml": "[color=green]Gondorian Ranger Bow and Arrows[/color]\n<br />\n<br />[color=Orange]For many times people reporting me the same problems they have when installing with and without NMM, but after my reply it works again, those problems doesn't exist at all in my mods, its happening from their mistake, did not get all the files they need and did wrong installation.\n<br />On the other hand, they may not read the description at all, NOT MY PROBLEM!\n<br />So pay attention because i wont reply anymore for the same subject!\n<br />\n<br />1) First you need to install the Main File and then the Update File, NOT just the Update File!!!\n<br />2) On NMM while overriding a file over the other, it says you \"A different version of **** has been detected. The installed version is, the new version is.\",\n<br />and it asks you \"Would you like to upgrade?\", also it says you \"Selecting NO it will the new Mod normally\", you should click NO and not YES, it will keep the main file and will replace the update files over the main file.\n<br />\n<br />Its not hard to do it so! oo[/color]\n<br />\n<br />[color=red][[[@To all\n<br />If you have issues like that the mod is not working, that the bow and arrows are invisible, that the bow and arrows doesn't show up in blacksmith or anything else, now i explain what you all do wrong, because i tested and the mod is working great like to all other people who installed it corectly and works great to them too!\n<br />\n<br />What you make wrong is:\n<br />You downloaded only the Update File \"G_R_B\" and installed it, but not first the Main File \"Gondorian_Ranger_Bow\"!\n<br />\n<br />Why you have those issues:\n<br />Because the Main File contains the Meshes and Textures of the bow and arrows, also the esp file does not have recipe and temper for the arrows and its my mistake.\n<br />\n<br />What you have to do is:\n<br />You must first install the Main File and then the Update File to replace the old esp with the new esp, the esp in Update File is adding the recipe and temper for the arrows, which means the arrows can also be crafting.\n<br />\n<br />Where are the bow and arrows in blacksmith:\n<br />The bow is in the Wood section which now exists at the top of the sections list, if the arrows are not Wood section then they will be in Misc section.\n<br />\n<br />If you will install like i say, then it will work like to all other people works.]]][/color]\n<br />\n<br />Author:\n<br />haldir307\n<br />\n<br />Description:\n<br />I retextured the wooden bow and the nord hero arrow/quiver, remade the meshes and renamed them.\n<br />Gondorian ranger bow and arrows are more powerfull than wooden bow and nord hero arrow!\n<br />Both are standalone, the bow is craftable in wood section and the arrows in silver section of blacksmith.\n<br />Never saw a wood section in blacksmith? Now it is. ;)\n<br />Required the first perk of smithing.\n<br />***If you can't find the arrows in silver section then use console to get how many you want,\n<br />type in console: help gondorian\n<br />check the 8-digit id of gondorian arrows,\n<br />then type in console this cheatcode with the 8-digit id: player.additem xxxxxxxx value\n<br />value is the number of arrows you want, for example you want 100 arrows,\n<br />then type 100 instead of value.***\n<br />\n<br />\n<br />Installation:\n<br />First, if you have the previous version, just delete GondorianBow.esp, then extract the new version\n<br />and copy the folder \"Data\" to Program FilesSteamSteamAppscommonskyrim\n<br />\n<br />Run SkyrimLauncher, click to Data Files and checkmark the empty box of the GondorianRangerBow.esp,\n<br />checkmark the empty box of Load Loose Files and click OK.\n<br />\n<br />Attention please, if the Data Files section is grey and isn't working, go to this directory:\n<br />C:Users****DocumentsMy GamesSkyrim\n<br />and open SkyrimPrefs.ini, find the [Launcher] and type under of the last line,\n<br />those two lines exactly like they are:\n<br />bEnableFileSelection=1\n<br />bLoadLooseFiles=1\n<br />Save and close it, go back to SkyrimLauncher and enable the checkmarks i told before,\n<br />you are ready to enjoy the Gondorian Ranger Bow and Arrows.\n<br />\n<br />Permissions:\n<br />1) Users/Modders are not allowed to upload my files to other sites!\n<br />2) Usersv are not allowed to convert my file so that it works on similar games!\n<br />3) Users/Modders are not allowed to modify my file including releasing bug fixes or improving on the features my file adds to the game and upload it as a seperate file!\n<br />4) Users/Modders are not allowed to use assets contained in my files in their own files!\n<br />[b][i]5) Translations are allowed, no need to ask me. [/i][/b]\n<br />[b][i][u]6) Users/Modders are not allowed to upload my mods on Steam Workshop as their own to obtain money and it means the same for Permissions 2/3/4, my mods will always stay on nexus for free![/u][/i][/b]\n<br />\n<br />Credits:\n<br />Made by haldir307.",
  "categoryId": "55",
  "version": "1.2",
  "author": "haldir307",
  "createdUnix": "1342170975",
  "updatedUnix": "1344765851",
  "containsAdultContent": false,
  "uploadedBy": "haldir307",
  "primaryFile": null,
  "files": [
    {
      "fileId": "76551",
      "name": "Gondorian_Ranger_Bow",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "881",
      "fileName": "Gondorian_Ranger_Bow-20417-1-1.rar",
      "uploadedUnix": "1343219677",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/91f8601f4d43b8f08d6a735c943e214422a82fa219875e980eaba5d22303ff95/analysis/1407045126/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gondorian_Ranger_Bow-20417-1-1.rar?fid=76551&ttl=1535788544&ri=8192&rs=8192&setec=b680852b59de0266f84d721f8f795166"
    },
    {
      "fileId": "80933",
      "name": "G_R_B",
      "version": "1.2",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "2",
      "fileName": "G_R_B-20417-1-2.rar",
      "uploadedUnix": "1344765851",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/b89bac5f925c9ef4c1f585242cde2564f52dc2d20dd25767d6880674adadb704/analysis/1407090723/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/G_R_B-20417-1-2.rar?fid=80933&ttl=1535788545&ri=8192&rs=8192&setec=1fe022897fc4cc94bfb4ef0830020110"
    }
  ]
}