{
  "modId": 20429.0,
  "modName": "Midhrastic ENB for Screenarchery",
  "summary": "This is my broken, contorted, unfinished, unrealistic, non-cinematic, silly attempt at piecing together how I like my game to look. It\\'s got hotkey-adjustable colours, grain, bloom, Matso\\'s immersive bokeh DOF, advanced shadows, SMAA, sunrays, SSAO, and complex SSIL. There\\'s a few required mods listed in the readme and on the description page.",
  "descriptionHtml": "[center][b]First things first, kind of a disclaimer:[/b][/center]\r\nI really, really didn\\'t intend this for a general release, but as people keep asking me about my ENB, and as the files I\\'ve uploaded on Mediafire have been downloaded over a thousand times already, I thought I\\'d just release these through the proper channel, and quite frankly also because answering PM\\'s about it is quite nice and social, but also very time-consuming. \r\n\r\nAs it stands, I\\'ve already left this particular version, 2.7, behind and was trying to get a newer incarnation ready for release, just before I went on vacation. I didn\\'t succeed as I\\'m terribly bad at this whole tweaking thing (although I much enjoy it) and often when I attain some effect I like, I\\'ll only discover five I\\'ve broken. When I return I\\'ll update here quite soonish. Midhrastic 2.7 is far from perfect. It certainly has some parts that I\\'m quite taken with myself (mainly how it looks in the dungeons), but I\\'m not satisfied at all with how my clear days look: they\\'re sort of overexposed and blown out. However, even in its unpolished state it\\'s the most finished ENB I\\'ve done to date. It was always intended as a personal ENB that I use to play the game as I like it, and to help me with my [url=http://skyrim.nexusmods.com/users/2808024]screenarchery[/url]. I\\'m no coder myself (don\\'t half understand any of it) and I\\'ve taken the liberty to scrounge and combine parts of code I\\'ve found in others\\' work. I\\'ll try to take care of all the authors whose code I use in the credits, but if you feel left out, that was nothing personal: I\\'ve just forgotten to mention you, or didn\\'t know it was your work I pillaged. My contribution to this mess is merely the piecing together, and then thoroughly breaking using inane values and silly combinations of whatever functioned well before I came along. \r\n\r\nSo... this release is intended for everyone who doesn\\'t mind taking the plunge. I won\\'t promise you a gorgeous, stand-out game. I don\\'t promise every single part of the game to look great. In fact, I promise quite a lot will look awful (clear days in particular). For that reason and more, this is probably not for everyone, and most probably most of you won\\'t like this even if some of the shots I took with it looked nice to you. I\\'ll gladly embrace any critique of it, and if helpful I\\'ll try to implement any good tips if they fit with what I think looks good, but please do take into account that for all intents and purposes, this is very much a WIP. Look forward to 3.0 if you do like what you see, and maybe even if you don\\'t.\r\n\r\n[i]Long story short: do try it if you feel so inclined but back up your last used config first! You are warned.[/i]\r\n\r\n\r\n[center][color=#0CACCC][size=3][b].:NOTE TO EVERYONE THAT WANTS TO KNOW WHAT ARMOUR IS FEATURED IN THE MAIN SHOT:.[/b][/size]\r\nYou can find the links to the mods used in [url=http://skyrim.nexusmods.com/Images/99591]my image at the Nexus Imageshare[/url]. I often name the armour I use in my images, and if I don\\'t you can ask about it there. If all else fails, send me a PM before going to the comment section of this mod, which is meant for discussion about the ENB, not random armour. Thanks![/color][/center]\r\n\r\n\r\n[img]http://farm8.staticflickr.com/7126/7565927336_07ddaf2aea_o.jpg[/img]\r\n\r\n\r\n[color=#F5E831][b][size=3]I N S T A L L A T I O N[/b][/size][/color]\r\n[i]Feel free to skip this IF you know what you\\'re doing[/i]\r\n\r\n[color=#F5E831]1.[/color] Back up your old ENB config. Back. It. Up.\r\n\r\n[color=#F5E831]2.[/color] Make sure every last shred of the previous config is then removed from your Skyrim folder. That means effect.txt files as well. You\\'re welcome to add them in later, but don\\'t blame me for how something looks if you didn\\'t first try it as I released it.\r\n\r\n[color=#F5E831]3.[/color] If this is your first ENB, watch [url=http://www.youtube.com/watch?v=rJbtB6A3sdo]this introductory video by hodilton[/url] that [i]shows[/i] you how to install any ENB preset and then read up on it using any of these great articles (preferably all): \r\n[list][*] [url=http://skyrim.nexusmods.com/articles/78/]The GREAT article for ENB newbies[/url], written by the experienced UnrealWarfare: [url=http://skyrim.nexusmods.com/articles/78/]http://skyrim.nexusmods.com/articles/78/[/url] (strangely this won\\'t let me hotlink!)\r\nIn fact UnrealWarfare has a couple very good ENB configs floating around on this site (try searching for \\'Beautiful Skyrim\\'). This article covers a lot of the basic ground for starters. In fact, the hints and tips on his mod\\'s front pages are good reading for anyone experiencing problems. Read for instance the [url=http://skyrim.nexusmods.com/mods/22476/]front page[/url] of his Beautiful Skyrim ENB collection page (http://skyrim.nexusmods.com/mods/22476/) Better yet, just install one of those configs and forget this!\r\n[*] If you\\'re still here, you\\'ll probably want to read [url=http://skyrim.nexusmods.com/mods/8005]JawZ\\'s more in-depth Guide to ENB series mods[/url].\r\n[*] Also read the [url=http://enbdev.com/doc_skyrim_en.htm]ENBSeries v0.101 documentation[/url], by ENB designer Boris Vorontsov. Highly informative about most enbseries.ini settings. The [url=http://enbdev.com/enbseries/forum/]forum[/url] of this genius Russian\\'s lair is THE place to go if you\\'re having trouble with ENB\\'s in general.\r\n[*] The [url=http://skyrim.nexusmods.com/mods/readmes/Imvisio_readme.txt]readme file[/url] of [url=http://skyrim.nexusmods.com/mods/19379/]Matso\\'s Imvisio ENB[/url] (additionally, a great ENB I think): very informative, especially concerning his additions to ENB (DOF, Bloom, etc.), some of which are implemented in Midhrastic 2.7, and relevant in its entirety to Midhrastic 3.0. Give that Imvisio ENB a go while you\\'re at it. Very balanced; ingenious; very beautiful; performance friendly; stable. (What ARE you doing here, still?)\r\n[*] The 40 page illustrated ENB user manual included in [url=http://skyrim.nexusmods.com/download/45515]Tapioks\\' gorgeous Skyrim Enhanced Shaders FX[/url] ENB config.[/list][i]If you pose a simple question that is answered there already, you\\'re being lazy! Remember: I\\'m quite willing to help you out using my very limited understanding, but you\\'ll only really start understanding this stuff if you first try to find the answer yourself. I AM of course the go-to guy for specific questions pertaining to this particular configuration.[/i]\r\n\r\n[color=#F5E831]4.[/color] Download the right ENB binary from [url=http://enbdev.com/download_mod_tesskyrim.htm]Boris Vorontsov\\'s page[/url].\r\nVersion 2.7 uses ENB v.0.113, found [url=http://enbdev.com/mod_tesskyrim_v0113.htm]here[/url].\r\nYou could also try this with one of the earlier or more current builds, but I don\\'t support that.\r\n[b][i]Remember[/b]: drop ONLY the d3d9.dll into your main Skyrim folder (not the DATA folder), replacing the (backed-up) original.[/i]\r\n\r\n[color=#F5E831]5.[/color] Open my file package, and drop the contents in your main Skyrim folder, where your game executable is located.\r\nThe core files are:\r\n[list][*][i]-palette.bmp[/i] (you can always try your own preferred palette file with my config, but that can lead to unintended and unsupported results)\r\n[*][i]-enbseries.ini[/i] (the meat and bones of ENB)\r\n[*][i]-enbeffect.fx[/i] (I\\'ve made a quite some adjustments [and notes] here that are very WIP. I\\'m using a modified version of PostProcessing 5, but have also included a version of Opethfeldt\\'s PP2 with day-night separation. PP2 is not configured to work with my config yet, but you\\'re welcome to tinker with it if you know what you\\'re doing, or otherwise ignore it. I\\'ve asked artem1s to design a utility [ENBMote, see below for a link] that will allow you to hot-toggle between for instance these two different postprocessing versions, just to be able to use this to full effect in-game. I\\'ve disabled the game\\'s orginal color processing, so you can\\'t use The Imaginator with my ENB. You can use HD6\\'s quick-keys to adjust brightness and colour saturation in-game. Try using keys 1,2,3 and 4 in combination with PAGE UP/PAGE DOWN to see what I mean. When doing this, you will see triangles in the screen\\'s corners, indicating any deviation from normal. You can disable these triangles in this file. Upon restarting the game, any adjustments made using these keys are removed.) \r\n[*][i]-enbbloom.fx[/i] (I did quite some silly things in here, and probably broke more than I wanted)\r\n[*][i]-enbeffectprepass.fx[/i] (you can use any other prepass file you like. This used Matso\\'s 3.0.0 bokeh DOF effect and some mild grain. Midhrastic 3.0 will use Matso\\'s 4.0.0 bokeh DOF, with optional manual DOF. Do what you want.)[/list]\r\n[color=#F5E831]6.[/color] I\\'ve also included the four files of the SMAA-injector package:\r\n[list][*][i]-d3d9_smaa.dll[/i]\r\n[*][i]-SMAA.h[/i] and [i]SMAA.fx[/i]\r\n[*][i]-injector.ini[/i][/list]These four files are used for anti-aliasing and are courtesy of Andrej Dudenhefner. If you\\'re going to use these (and I suggest you do), you\\'ll have to disable the in-game FXAA (FXAA and SMAA counteract eachother), and I suggest you also disable any in-game or driver-based MSAA (transparency supersampling can be left on), as parts of ENB and MSAA are incompatible. \r\nThis version of SMAA is configured at the ULTRA setting, which is most performance heavy. You can change this by opening the injector.ini file and changing the line:\r\npreset = SMAA_PRESET_ULTRA\r\nto any of the other values listed above it. If you want to disable SMAA anti-aliasing altogether, open up enbseries.ini and change \\'EnableProxyLibrary=TRUE\\' to \\'EnableProxyLibrary=FALSE\\'\r\nAlso in the injector.ini you can set which keys you press to take a lossless screenshot (bmp\\'s that get dumped in your Skyrim folder). I\\'ve configured this version to use the END key. The key to reload the ENB after you\\'ve alt-tabbed out and made changes to the configuration files is BACKSPACE (pretty handy for tweaking, that). You can change these keycode values (link in injector.ini)\r\n\r\n[color=#F5E831]7.[/color] I\\'ve included two optional texture replacers which will merge with your DATA folder. One is a 4K replacer for the sun (courtesy of T.A.Z., with permission), and the other replaces white water foam, to be less bright at night. Fire values in enbseries.ini affect both fires and water foam. Go figure. If you don\\'t want or need these replacers, you can very well leave them out. Just make sure to back up any files they replace. \r\n \r\n[color=#F5E831]8.[/color] My config has Anisotropic Filtering enabled in the enbseries.ini (@16x). If you don\\'t care for that, or run AF through Skyrim or your graphics driver\\'s options, open up said file using a text editor (I recommend Notepad++) and change the line: \r\nForceAnisotropicFiltering=TRUE\r\nto FALSE, or set MaxAnisotropy to a lower value, if you need to. Don\\'t run AF from both here and someplace else simultaneously as black holes will open and suck up all civilization from the face of the planet.\r\n \r\n[color=#F5E831]9.[/color] Now download the essential mods listed below, and don\\'t forget to enable the esp\\'s (in NMM or the game\\'s launcher). Please take into account the proper load order (use BOSS to auto-sort your mods).\r\n\r\n[color=#F5E831]10.[/color] Make sure to set [color=#ED4F11]bFloatPointRenderTarget=1[/color] & [color=#ED4F11]bEnableFileSelection=1[/color] in SkyrimPrefs.ini. If you don\\'t: you\\'ll have problems with every ENB.\r\n\r\n[img]http://farm8.staticflickr.com/7260/7460274234_a6a136acbe_b.jpg[/img]\r\n\r\n[color=#F5E831][b][size=3]R E C O M M E N D  E D[/color][color=#313131]__[/color][/size][size=3][color=#F5E831]M O D S[/b][/size][/color]\r\n[b][i]Essential[/b][/i]:\r\n[list][*]The latest version of [url=http://skyrim.nexusmods.com/mods/12454][b]\\'Further Dark Dungeons for ENB\\'[/b][/url], by mindflux/artem1s.\r\nI\\'ve configured my ENB to work with this.\r\n[*][url=http://skyrim.nexusmods.com/mods/9930][b]Revamped Exterior Fog[/b][/url] by Greg Manthey - gargorias\r\nIf you like heavier fog, just don\\'t use this. But I suggest you do.[/list]\r\n[b][i]Optional[/b][/i]:\r\n[list][*][url=http://skyrim.nexusmods.com/mods/15380][b]Brighter campfires (and candles)[/b][/url]. \r\nPick what you prefer, but first play without it to see if you need it.\r\n[*][url=http://skyrim.nexusmods.com/mods/13306][b]The ENB SSAO and DoF Toggler for Skyrim[/b][/url] by yukl is cool if you want to toggle SSAO or DOF or both on/off on the fly. Why? Well, if your hardware is limited and only lets you play without SSAO, (complex) SSIL, advanced shadows, or DOF, this will at least let you toggle SSAO and DOF back on to take a good screenshot. Get it now if you want to take more gorgeous shots than you can actually run.\r\nNOTE: because of the way this works, you\\'ll lose grain if you toggle off DOF.\r\n[*]The alpha version of mindflux/artem1s\\'s [url=http://skyrim.nexusmods.com/mods/19907][b]\\'ENBmote - A quick-key tool\\'[/b][/url] is very promising (and soon to be essential), and something any ENB-tweaking nut or hardcase screenarcher should consider checking out.\r\nArtem1s: I love you for this.[/list]\r\n\r\nIf anyone wonders what further mods I use, [url=http://farm9.staticflickr.com/8157/7177890105_b1ab106056_o.jpg]this is my list from June[/url].\r\n\r\n[url=http://skyrim.nexusmods.com/mods/20770]The Best of ENB - Visual Comparison[/url] by Evok99 is a mod that consists of a great many images taken with a great many ENB\\'s. Every ENB is shown at exactly the same spots and times, so you really can get a good feel for what graphical overhaul you can expect. Of course, nothing beats actually playing the game using a certain ENB configuration, but this can really help you narrow down your list of possible ENB\\'s to try out. Evok worked very hard on this mod, and I do hope you all check it out.\r\n\r\n[img]http://farm9.staticflickr.com/8167/7669910388_9c66d7e7bd_o.jpg[/img]\r\n\r\n[color=#F5E831][b][size=3]N O T E S[/color][color=#313131]__[/color][/size][color=#F5E831][size=3]A N D[/color][color=#313131]__[/color][/size][color=#F5E831][size=3]T R O U B L E S H O O T I N G[/b][/size][/color]\r\n[list][*]If you want to experience this ENB as intended, first disable and remove any mods that change the lighting such as URLW, Realistic Lighting, Climates of Tamriel, etc. This mod was not designed with those in mind -- in fact, because my ENB disables the game\\'s original colour correction, those other mods mentioned won\\'t work, or won\\'t work as intended. The Imaginator won\\'t work AT ALL. If you want to use these along with my mod, I encourage you to do so, as they are surely great. But don\\'t ask me for support, or complain about how it looks in your game. Some aspects will work, some won\\'t. I can\\'t predict. If you want, you can go into the enbeffect.fx file and remove the comment I put before \\\"//#define APPLYGAMECOLORCORRECTION\\\". Simply remove the two dashes and save the file. My ENB will look different now, but those imagespace mods will work. \r\n[*]Use the END button to take lossless screenshots. They will appear as uncompressed BMP\\'s in your game folder. Compress further using your favourite (free) photo editor. I like [url=http://www.faststone.org/FSViewerDownload.htm]FastStone Imageviewer[/url].\r\n[*]My ENB has quite dark dungeons, although you can still see plenty (I think). I do suggest you bring a hotkeyed (bug)lantern or torch. And before you start blaming me, try [url=http://w4zt.com/screen/]calibrating your monitor properly[/url].\r\n[*]If you hate your shadows, try changing your iBlurDeferredShadowMask in SkyrimPrefs.ini to something like 7 or higher. It softens shadows and works great with the advanced shadows of ENB.\r\n[*]My interiors work better than my exteriors, I think. That\\'s why this is still a WIP. Don\\'t hate it too much because of this.\r\n[*]You may experience a greenish cast when viewing burning embers in forgers or braziers. It seems that the code combination I use conjures this unwanted effect, and I can\\'t seem to get rid of it. Boris Vorontsov tells me that this is probably an artefact of the way the binary\\'s math works. You can clear this up by starting the game, and without exiting turning SSAO off in enbseries.ini, saving the file and reloading the ENB via the BACKSPACE key, then turning SSAO back on again, saving enbseries.ini again, and refreshing the ENB via BACKSPACE a second time. This seems tedious, which is why I\\'ve installed the ENBSSAODOFtoggler, which implements a hotkey to switch SSAO on/off (and also DOF, or both at the same time) without leaving the game. Handy. Look for it in the recommended mods.   \r\n[*]It seems that the DOF doesn\\'t work for some people even after uploading a fixed version. You can use the DOF in the optional file. Download that and drop the enbeffectprepass.fx file into your Skyrim folder, replacing the one from the main download. Or you could rip any enbeffectprepass.fx from another ENB config, if you happen to like a certain look for the DOF function.[/list] \r\n\r\n[color=#F5E831][b][size=3]P E R F O R M A N C E[/color][color=#313131]__[/color][/size][color=#F5E831][size=3]I S S U E S [/b][/size][/color]\r\nI\\'ll collect some suggestions here which can help you with performance, without going for an exhaustive guide. Of course, some of these tips will gain performance with reduced splendour as a trade-off:\r\n[list][*]LOAD TIMES - If you experience excruciatingly long load times: just hit SHIFT-F12 to toggle off the ENB during a loading screen, as this will significantly reduce the wait. Remember to toggle the ENB back on afterwards (SHIFT-F12 again).\r\n[*]ANTI-ALIASING - It\\'s very important that you give this a try without any other form of anti-aliasing, either in-game or driver-based. Disable that (driver-based transparency supersampling can be left on though, if you can take the hit). Don\\'t use MSAA (not SMAA!) together with ENB. The included and enabled SMAA alone will take care of most your jaggies.[/list]\r\n[i]MORE to come soon[/i]\r\n\r\n\r\n\r\n\r\n[center][youtube]cKO1SleYWPg[/youtube][color=#313131]___[/color][youtube]whfr5faoKww&f[/youtube][/center]\r\n\r\n\r\n[color=#F5E831][b][size=3]Q U I C K[/color][color=#313131]__[/color][/size][color=#F5E831][size=3]T H A N K S[/b][/size][/color]\r\nAll the inspirational people over at enbdev.com and the Nexus Imageshare and Flickr. Your images, helpful advice, chit-chat, recommendations, admonishments: they\\'ve all proved invaluable for me having a great time and the eventual vomiting out of this ENB.\r\nThanks to solsikke, trillville, anaphiel, sPINELESSjELLY and KyokushinOyoma for giving me valuable advice and insights after testing these files with their games. Thanks for showing me your games using my config. Thanks to Duncan Harris for featuring Midhrastic v.2.7 [url=http://deadendthrills.com/?cat=1654]on his site[/url]. \r\n\r\n\r\n[color=#F5E831][b][size=3]C R E D I T S[/b][/size][/color]\r\nBoris Vorontsov - ENB\r\nHeliosDoubleSix - large-scale enbeffect modifications; saturation and brightness hotkeys.\r\nMatso - DOF, Immersive Bloom, Anamorphic Flare, Manual DOF hotkeys --- Do check out his many awesome additions to this site, especially the stunning [url=http://skyrim.nexusmods.com/mods/19379/]Imvisio ENB[/url]\r\nDirty Peasant - additions to enbeffect/enbbloom code\r\nmindflux/artem1s - additions to enbeffect code / palette file\r\nOpethfeldt - day-night separated post-processing method in enbeffect code\r\nT.A.Z. - sun texture replacer\r\nThe Confidence-Man - water texture replacer\r\nAndrej Dudenhefner et al. - SMAA injector",
  "categoryId": "62",
  "version": "2.7",
  "author": "midhras",
  "createdUnix": "1342193825",
  "updatedUnix": "1345995029",
  "containsAdultContent": false,
  "uploadedBy": "midhras",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74117",
      "name": "Midhrastic ENB fixed",
      "version": "2.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "529",
      "fileName": "Midhrastic ENB fixed-20429-2-7.rar",
      "uploadedUnix": "1342237088",
      "modVersion": "2.7",
      "virusScanUrl": "https://www.virustotal.com/file/dffbc479b5024fcf31d468b58f83aa3cb7afe601cf282043d0114695a563c55f/analysis/1407020704/",
      "changelogHtml": " Initial release <br/> \n Added optional enbeffectprepass.fx with Matso\\'s 4.0.0 DOF for those experiencing DOF problems with the main file\\'s enbeffectprepass.fx <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Midhrastic%20ENB%20fixed-20429-2-7.rar?fid=74117&ttl=1535788565&ri=8192&rs=8192&setec=7ff6c71c2e370cacd01a0549cce7578f"
    },
    {
      "fileId": "74118",
      "name": "Experimental DOF",
      "version": "2.7",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7",
      "fileName": "Experimental DOF-20429-2-7.rar",
      "uploadedUnix": "1342237291",
      "modVersion": "2.7",
      "virusScanUrl": "https://www.virustotal.com/file/733df94dfb89094b596754de9c0fd3541f05764097fcebc941bedd41a77d68cc/analysis/1407020705/",
      "changelogHtml": " Initial release <br/> \n Added optional enbeffectprepass.fx with Matso\\'s 4.0.0 DOF for those experiencing DOF problems with the main file\\'s enbeffectprepass.fx <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Experimental%20DOF-20429-2-7.rar?fid=74118&ttl=1535788565&ri=8192&rs=8192&setec=534349e7287ab27cc7099f1b4ef2df01"
    },
    {
      "fileId": "84391",
      "name": "206 Matso DOF with experimental shadow effect",
      "version": "2.7b",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7",
      "fileName": "206 Matso DOF with experimental shadow effect-20429-2-7b.rar",
      "uploadedUnix": "1345995029",
      "modVersion": "2.7b",
      "virusScanUrl": "https://www.virustotal.com/file/219a53e65536c03e4107855e013bff7f5a0820fc1fe84f4d01cc6eb2aae46c31/analysis/1407123365/",
      "changelogHtml": " Added optional enbeffectprepass.fx with HBAO function based on nVidia HBAO. Download the optional file and swap it for the one in the main download. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/206%20Matso%20DOF%20with%20experimental%20shadow%20effect-20429-2-7b.rar?fid=84391&ttl=1535788566&ri=8192&rs=8192&setec=6f494c3834ceca3387d2769d91cfdcfa"
    }
  ]
}