{
  "modId": 20428.0,
  "modName": "Reworked Melee Weapons",
  "summary": "Different materials are now no longer just slightly better! Hit them hard with a Dwemer weapon or hit \\'em fast with an Elven one! Feel the jagged edge of your Orcish weapon! Knock them flying with a hammer! Get a Daedric weapon and feel like you\\'ve really accomplished something! ",
  "descriptionHtml": "CONTENTS:\r\n1) Note on this Mod\r\n2) Why did I make it?\r\n3) Material Changes\r\n4) Weapon Changes\r\n5) Installation/Uninstallation\r\n6) Compatibility with other mods\r\n7) Further notes\r\n\r\n\r\n\r\n[b]NOTE:[/b] I don\\'t like long, drawn-out combat that consists of me kiting one opponent for fifteen minutes. Don\\'t be surprised if combat \r\ngoes a lot quicker at higher difficulties now - one way or the other. Higher-level combat is still damn hard - just faster. If that\\'s not \r\nyour cup of tea, well... you might have to look elsewhere. Give it a try anyway, though!\r\n\r\nAnd don\\'t forget to endorse this mod if you like it!\r\n\r\n\r\n\r\n[color=yellow][b]Why did I make this mod?[/b]\r\nThere\\'s one thing I\\'ve always disliked about the materials in the Elder Scrolls world: they aren\\'t unique.\r\n\r\nA steel sword is essentially an iron sword, just a little heavier and a little stronger. This exact linear progression is followed all the way \r\nup to Daedric, which has always seemed stupid to me. Look at this Elven weapon! It\\'s a thin, spindly little thing! Why is it heavier than the \r\nexact same weapon made out of Dwemer metal when Elder Scrolls Lore establishes Dwemer weapons and armour as clunky and a little heavy, while \r\nAltmer weapons are light and fast?\r\n\r\nIf I\\'m high enough level to see an ebony weapon coming at me, I don\\'t think \\\"Oh dear, this guy is going to fillet me and serve me up to his pet \r\nwolves!\\\" I think \\\"Hey, free money!\\\"\r\n\r\nIf I have a Daedric axe in my hand, I don\\'t feel like I am wielding a cruel weapon that is literally forged out of the essence of what passes \r\nfor demons in this world. I feel like I\\'m swinging the exact same axe I was twenty levels ago - it just weighs a whole lot more and hits a little \r\nharder.\r\n\r\nThat\\'s not right. If you possess a glass sword, it should be an achievement to make your foes quake in their boots. And if you\\'re fighting a bandit\r\nwho\\'s somehow gotten his hands on an ebony warhammer, you should be terrified that he is going to murder you with as much effort as he\\'ll put into \r\ncleaning the blood off of his weapon.\r\n\r\nTo that end, I\\'ve made this little mod. I gave each material its own unique properties and applied this to each weapon type, to try and differentiate \r\nthem a little.[/color]\r\n\r\n\r\nIMPORTANT NOTE:\r\nI made this mod to fit in with my own personal play-style; I like to start off at apprentice difficulty until I really get into the stride of a \r\ncharacter (Typically about level eight or so) and then begin upping the difficulty every five or ten levels. That\\'s why Glass, Ebony and Daedric \r\nweapons are powerful; they should keep combat quick, entertaining and deadly at higher difficulties - but at lower difficulties... well, it\\'ll be \r\nlike bringing a tank to a fist-fight.\r\n\r\n\r\n[b][color=darkgreen]MATERIALS:\r\nIron[/b]\r\nYour basic material, iron is pretty slow and not that powerful. Iron weapons tend to be middle of the range for weight, fairly slow and all-round \r\nfrankly useless.\r\n\r\n[b]Steel[/b]\r\nSteel is a marked improvement over iron. The damage is only slightly higher, but steel weighs a little less than iron; steel alloys can definitely \r\nbe made lighter than straight iron. Critical hits from a steel weapon [u]hurt[/u], and as the material is slightly harder than iron it causes \r\nslightly more knockback. Mildly faster than iron, too.\r\n\r\n[b]Orcish/Orsimer[/b]\r\nOrichalcum is a brutal material. It weighs more than iron and forms a slightly faster weapon than steel. More importantly, of the three \\\"Elven\\\" \r\nmaterials Orichalcum causes the most critical damage. [u]Orichalcum forms a nice compromise between Elven speed and Dwemer power[/u]\r\n\r\n[b]Dwarven/Dwemer[/b]\r\nDwemer metal is heavy. It\\'s the heaviest material of them all and, consequently, is the slowest. It\\'s not all bad, though! If knockback is your \r\nthing, Dwemer metal weapons are the way to go - if you hit your opponent, they [i]will[/i] feel it, or your money back.\r\n\r\n[b]Elven/Altmer[/b]\r\nThis golden metal fills a nice little niche; Elven weapons are the fastest of all weapons as well as the lightest; consequently, Elven weapons \r\nsuffer from being useless for knockback effect. Basically, in choosing between Dwarf and Elf, you have one choice: Hit \\'em hard or hit \\'em fast. \r\nYour choice.\r\n\r\n[b]Glass[/b]\r\nGlass lies head and shoulders above even Elven weapons and represents a steep power jump. Glass weapons are all-round quite powerful and are as \r\nlight as their steel counterparts; their knockback is less than that of the Dwemer metal, but their critical damage is second only to Daedric \r\nweapons. I\\'ve goneahead and assumed that \\'Glass\\' is not actually melted sand; until I find some way to make a glass warhammer shatter the first \r\ntime you use it, I\\'m gonna stick with this idea.\r\n\r\n[b]Ebony[/b]\r\nAs is proper, Ebony weapons are pretty heavy. Along with steel, they\\'re also the second-slowest weapons in the game... but if you hit your enemy \r\nby God will they feel it. \r\n\r\n[b]Daedric[/b]\r\nI\\'ll admit, the Daedric material is probably a little overpowered. Mid-range mass and speed with top-level knockback and critical damage coupled \r\nwith a very high base damage make Daedric weapons a force to be reckoned with. If I have to rebalance the mod in any way it\\'ll be because of the \r\nDaedric weapons... but my philosophy was this: You just spent more than a dozen hours working towards this level. Why the hell shouldn\\'t you have \r\nsomething to show for it?[/color]\r\n\r\n\r\n\r\n[b][color=orange]WEAPONS:\r\nDagger[/b]\r\nDaggers are the fastest and weakest weapons available to you. They\\'re fantastically light, but there is no stagger effect whatsoever - unless it\\'s \r\na Dwarven dagger. For best results, polish with spinal fluid daily.\r\n\r\n\r\n[b]Sword/Greatsword[/b]\r\nSwords are the everyman\\'s weapon; although a fair bit weaker than axes and warhammers/maces, swords can easily outpace the other weapons - and are \r\na decent bit lighter than maces and axes! \r\n\r\nOf the three \\\"Elven\\\" materials, Elven swords are the most damaging.\r\n\r\n\r\n[b]Axe/Greataxe[/b]\r\nThe axe is a nice little compromise between swords and maces. Designed for the barbarian in us, axes savagely produce the highest critical damage \r\nof all weapons and have middling speed. Their knockback effect is midddle of the pack, too.\r\n\r\nOf the three \\\"Elven\\\" materials, go with an Orcish axe. All those edges, you see...\r\n\r\n\r\n[b]Mace/Warhammer[/b]\r\nNot quite every postman\\'s companion, maces are now king in raw damage - but by God are they slow! They\\'re not so slow that you feel like your \r\narms are submerged in treacle, but be prepared to take a couple of hits. Mind you, a mace\\'s knockback effect is pretty damn strong. Your strikes \r\nwill hit your opponent like a steam train.\r\n\r\nOf the three \\\"Elven\\\" materials, Dwemer maces/warhammers are king.[/color]\r\n\r\n\r\n\r\n\r\n[b]INSTALLATION AND UNINSTALLATION[/b]\r\nIt\\'s a ZIP file with nothing but an ESP inside. Best of all, the ESP contains no scripts or anything - install and uninstall to your heart\\'s \r\ncontent without fear of screwing up your save file! (I say that, but... well, someone will manage to. Just make backups, okay?)\r\n\r\nPut it IN the data file and tick the little ESP box to activate it.\r\n\r\nTake it OUT of the data file to deactivate it.\r\n\r\n\r\n\r\n[b]COMPATIBILITY[/b]\r\nThis mod only changes the physical weight, damage, speed and knockback of the weapons. This mod will conflict mildly with any mod that directly \r\nalters weapon damage; put this mod later to keep it. More importantly, this mod uses no scripts, keywords or anything else fancy - this makes \r\nthis mod compatible and non-crashing with 99.5% of all mods on the Nexus! No perks are altered, nothing! It directly alters the values themselves.\r\n\r\nA corollary of this is that no modded-in weapons are affected. If there\\'s a big enough call I\\'ll balance up Jaysus Swords and Wot3E (Both of which are \r\ngoddamn fantastic and you should look at!) but for the moment, only vanilla weapons are touched.\r\n\r\n\r\n\r\n[b]FURTHER NOTES[/b]\r\nIf you\\'re unhappy with the balancing, or if I missed one of the unique weapons (Wuuthrad, the shiv, etc) please tell me.\r\n\r\nI\\'m not going to handle bows just yet; I recommend using [url=http://skyrim.nexusmods.com/mods/10037]Athyra\\'s amazing ACE overhaul[/url] since it \r\ndoes some extremely sexy things with bows.\r\n\r\nI AM going to balance up armours in accordance with their materials, though; just you wait!\r\n\r\nIf you\\'re going to ask me to rebalance the mod, please keep in mind my original goal: Every material must feel different and I want to [i]feel[/i] \r\nlike my weapons are really getting stronger. So please don\\'t demand anything too outrageous like Elven should be heavier than Dwemer! Otherwise, \r\ncriticise away - kindly!\r\n\r\n",
  "categoryId": "77",
  "version": "1.0",
  "author": "Niccolo",
  "createdUnix": "1342192671",
  "updatedUnix": "1342192739",
  "containsAdultContent": false,
  "uploadedBy": "niccolo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74010",
      "name": "Reworked Melee weapons",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Reworked Melee weapons-20428-1-0.zip",
      "uploadedUnix": "1342192739",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0344c93d8f6679d7202ad688766633f7a1379e65090929acbb7b1e95ca8dd5d4/analysis/1407019862/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Reworked%20Melee%20weapons-20428-1-0.zip?fid=74010&ttl=1535788563&ri=8192&rs=8192&setec=7e0a2f2813f86ea68a791ab7fd9caabb"
    }
  ]
}