{
  "modId": 20435.0,
  "modName": "Dwarven and Orcish Weapons Reversed Damage Values",
  "summary": "Switches the values and damage of dwarven and orcish weapons.",
  "descriptionHtml": "I have been bothered since day one by the fact that in The Elder Scrolls IV: Oblivion, the Dwarven Armor and Weapons were weaker than Orcish Armor and Weapons but, in Skyrim the Dwarven Weapons are stronger than the Orcish while the Armor remains weaker.\r\n\r\nThis is my first mod. All I did was reverse the damage values, critical multipliers, and monetary values of the two weapons\\' sets so the Orcish Weapons are stronger too. However, I did not change the weight or range of the weapons. These remain at the vanilla values.\r\n\r\nFeel free to comment or complain (don\\'t know why you would) about it, or discuss it. It doesn\\'t matter to me since I will likely not be editing it any more for any reason.\r\n\r\nI have already tested this in game and have not found any bugs or breaks in the game. I also don\\'t think this will affect any other mods unless they alter the values of Dwarven and/or Orcish Weapons.",
  "categoryId": "24",
  "version": "1.0",
  "author": "PAKman03",
  "createdUnix": "1342199224",
  "updatedUnix": "1342280221",
  "containsAdultContent": false,
  "uploadedBy": "PAKman03",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74225",
      "name": "Dwarven and Orcish Weapons Reversed - including arrows",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Dwarven and Orcish Weapons Reversed - including arrows-20435-1-0.rar",
      "uploadedUnix": "1342280221",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7ae88695a1bc5b177b118c1f5f1cbf3750b6a022d16c55d267f5499ac1881248/analysis/1407021903/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwarven%20and%20Orcish%20Weapons%20Reversed%20-%20including%20arrows-20435-1-0.rar?fid=74225&ttl=1535788579&ri=8192&rs=8192&setec=1f363bc26a69c0a8418c2b5e54985533"
    }
  ]
}