{
  "modId": 20436.0,
  "modName": "Really Radiant Raiment - Hidden Vanilla Clothes Unlock",
  "summary": "This mod was primarily designed to make most of the REALLY fancy clothes available in-game without involving murder or console cheats. Primarily all the Jarl\\\\\\'s clothes, but also various colored robes and things which are in the game, but never available (chef\\\\\\'s gear, the rest of the college robe set, colored monk robes, etc).",
  "descriptionHtml": "UPDATE: v1.1\r\nAdded a clone of General Tullius\\' armor. Its called \\'General Tullius Costume\\', and it was a hit on the Bard\\'s College performance \\'Loredus Night Live!\\'.\r\n\r\nTry this mod:\r\n[url=http://skyrim.nexusmods.com/mods/24955]Complete Imperial Armor Kit[/url]\r\n\r\nOk, so, not wasting time with the Readme Generator...\r\n\r\nThis mod was primarily designed to make most of the REALLY fancy clothes available in-game without involving murder or console cheats. Primarily all the Jarl\\'s clothes, but also various colored robes and things which are in the game, but never available (chef\\'s gear, the rest of the college robe set, colored monk robes, etc).\r\n\r\nAll it does is add a new leveled list to the shop in Solitude called Radiant Raiment. No magic crates full of clothes, no crafting recipes, and all vanilla clothes.\r\n\r\nACTUALLY, there are a FEW other tweaks. I added a \\'replica\\' of the Emperor\\'s robes. Its just a clone of his robes, but it says it\\'s a \\'replica\\' so it fits lore, and doesn\\'t involve murdering him (something my law-abiding Imperial will never do!) Also I cloned Ulfric\\'s clothes and tweaked the stats. Its now a bit heavier, a bit stronger, and much more pricey. They are now called \\'The Great Bear\\' armor set, and are defined as a Radiant Raiment specialty.\r\n\r\nThe reason the clothes were cloned was so that no vanilla gear is tweaked, incase another mod uses them.\r\n\r\nI did NOT add any armor; its a clothing shop. But I did come across a good reason to include Tullius\\' \\'armor\\', or really, a light armor replica of it with next to no protection (^_^). You want the real thing? Kill him!\r\n\r\nInfact I am open to many suggestions, BUT, the core idea here is to make various hidden clothes available from a shop. You would not go into Radiant Raiment to buy Vermina robes, Psijic robes, guards armor, anything for serious combat, etc. Jarl robes however, are UNAVAILABLE without murder or thievery, which was the real reason for this mod.\r\n\r\nMade by PlasmaJedi, full license to use this, credit or not. All I did was add a leveled list in the Solitude clothes shop.\r\n\r\nNow go buy some fancy clothes!!",
  "categoryId": "60",
  "version": "1.1",
  "author": "PlasmaJedi",
  "createdUnix": "1342202388",
  "updatedUnix": "1342454308",
  "containsAdultContent": false,
  "uploadedBy": "PlasmaJedi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74717",
      "name": "Main ESP",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Main ESP-20436-1-1.7z",
      "uploadedUnix": "1342454308",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/530a5f9208af1a9fc69583ad379c63ba436e985a86924e744f3c77ac571010c8/analysis/1407026540/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20ESP-20436-1-1.7z?fid=74717&ttl=1535788581&ri=8192&rs=8192&setec=72addf9c85715efd0ec1dd56b5955d3b"
    }
  ]
}