{
  "modId": 20451.0,
  "modName": "Daphnes Well",
  "summary": "A mage\\'s home, underground. ",
  "descriptionHtml": "This home was my entry in the SKYRE Underground Homes Challenge. It didn\\'t win. *weeps bitterly* ;) \r\n\r\nPlease, view all the wonderful entries (including the winner) here. \r\nhttp://skyrimrealestate.com/html/challenges.html\r\n\r\nThis mod adds a very modest three room home, geared toward mage characters who are into alchemy and enchanting, in Falkreath Hold. It is just north of Roadside Ruins. There is a screenshot included in your download and a map marker is available immediately for fast travel. Later on down the line, I intend to edit this mod with a small quest in order to find the location of the well. \r\n\r\nThe first area of the home is a two part atrium with a full garden and a fountain. Almost every plant you can harvest is available here. The living area includes a cooking pot, alchemy station, and enchanting table. The bedroom has one of Skyrim\\'s fun bookshelves. Ample storage is available throughout the house. None of the containers should respawn. \r\n\r\nAll areas are fully navmeshed and companions and spouses should be able to move about normally with you in any of the rooms. \r\n\r\nThis house contains many, many new meshes. There may be some lag on low end machines. I hope this isn\\'t the case but I thought a fair warning might be prudent. \r\n\r\nLots of pretty objects in the house were made by some very talented people, and are used here with permission. \r\n\r\nDarkRider - http://skyrim.nexusmods.com/users/867382\r\nLilith - http://tesalliance.org/forums/index.php?/user/643-lilith/\r\nBlary - http://skyrim.nexusmods.com/users/2250922\r\nOaristys - http://skyrim.nexusmods.com/users/2235573\r\nYNSTBIH - http://skyrim.nexusmods.com/users/4022252\r\nInsanity Sorrow - http://tesalliance.org/forums/index.php?/user/378-insanitysorrow/\r\n\r\nSome new meshes were made by myself and can be used  by others as long as proper credit is given. \r\n\r\nInstallation: \r\nIf installing manually, simply download and then unpack the rar file into your Skyrim Data Folder. You can hit OK to merge the meshes and textures folder. That should be all you need. Easy, wasn\\'t it? \r\n\r\nEnjoy!",
  "categoryId": "67",
  "version": "1.0",
  "author": "mellowtraumatic",
  "createdUnix": "1342231542",
  "updatedUnix": "1342231632",
  "containsAdultContent": false,
  "uploadedBy": "mellowtraumatic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74101",
      "name": "Daphnes Well",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11535",
      "fileName": "Daphnes Well-20451-1-0.rar",
      "uploadedUnix": "1342231632",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a6dda6a440708d7939166c5fa59429149ba4f29217b16654ebff6e926e3eed9a/analysis/1407020590/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daphnes%20Well-20451-1-0.rar?fid=74101&ttl=1535788598&ri=8192&rs=8192&setec=8ed227e8762d23aef5a25e68ce710a55"
    }
  ]
}