{
  "modId": 20455.0,
  "modName": "Eldyvision ENB beta",
  "summary": "Simply put its my enb settings that I\\'ve been working on for months that has evolved significantly since I began it (both due to new features people have made available and simply becoming a little better at understanding what things do--still not 100% familiar with things though).",
  "descriptionHtml": "Update:  Fixed some of the lighting and color issues I had forgotten to revert back to after testing--days in particular should look even better now.  Also added options to disable effects easier by simply overriding the main file.\r\n\r\nI can not guarantee quality or performance as it was designed for myself to use and until now I\\'m the only one to have used it.  Nearly all settings are currently set to highest quality though so I wouldn\\'t be surprised if its not going to be overly friendly for all users (have added options that are user friendly to disable some of the more hard hitting effects).  Eventually I may come to find out how to clean up any issues there may be that allows for better performance but I simply don\\'t know the in and outs \\'how\\' some of it does what it does--I had to use trial and error to achieve the look and with all the time put in to it tons I still don\\'t know anything or little about.\r\n\r\nA few issues remain that I\\'m working on but pretty happy with what I\\'ve managed thus far.\r\n\r\nI\\'m currently using the v114 beta version of [url=http://enbdev.com/mod_tesskyrim_v0114.htm]Boris\\' ENBSeries[/url] which is required for the full effect--not sure how it looks with older versions as I haven\\'t tested it lately.  Main differences should be sky and shadow related though if using an older version.\r\n\r\nFor those new to ENBs you simply download, unzip, and then place the loose files into the Skyrim directory.  I\\'m using wrapper version personally--file needed from his download is:  D3D9.dll or simply copy and paste the whole thing (I use copy and paste as keeps a clean copy of everything untouched for emergencies) and then copy my files over them.  For steam skyrim directory is found (by default on my pc): C:/Program Files (86)/steam/steamapps/common/skyrim.\r\n\r\nCredits:\r\n\r\nAll I\\'ve really done is spent far too much time and effort in tweaking for myself an enb setting that is \\'mine\\' as thought it would be something I would enjoy doing (which I have).\r\n\r\nAll credit goes to Boris Vorontsov (if I mispelled it, I\\'m sorry) for creating the ENB in the first place.  I\\'m also using code from numerous sources that were added along the way in their own enb as well as for others to use:  Matso\\'s bloom and depth of field in particular as well as HD6\\'s post processing.  I\\'m sure others have added or assisted but for sure those 3 have made the biggest impact on my enb as all I\\'ve done was changed a few settings to my particular tastes.\r\n\r\nGradients (sky backdrop/atmosphere) is used with permission by Trillville from his TV ENB and have yet to see the need to tweak them thus far (will probably do it eventually).\r\n\r\nAlso just a huge thanks to creators of Jasmin and Darkness enbs as they were first 2 that I used as sources when deciding to try my hand at this (also first 2 enbs ever used in any game at all).   Then of course everyone that has made an enb of their own as well as those that add their screenshots (with enb or without) as helped spur my own fascination on as well as kept me working when I grew frustrated sorting out numerous issues.",
  "categoryId": "62",
  "version": "beta",
  "author": "Eldyraen",
  "createdUnix": "1342246954",
  "updatedUnix": "1342301537",
  "containsAdultContent": false,
  "uploadedBy": "celarion",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74292",
      "name": "Eldyvision ENB beta with options",
      "version": "beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22",
      "fileName": "Eldyvision ENB beta with options-20455-beta.7z",
      "uploadedUnix": "1342301537",
      "modVersion": "beta",
      "virusScanUrl": "https://www.virustotal.com/file/41324c6bfc5693fa851b74bcc4c32fdb507846625b5bd6eaff552b3abd3d92af/analysis/1407022503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Eldyvision%20ENB%20beta%20with%20options-20455-beta.7z?fid=74292&ttl=1535788604&ri=8192&rs=8192&setec=60919d55c1b5085d2b32ef3dea1f0d07"
    }
  ]
}