{
  "modId": 20478.0,
  "modName": "Vahhsk - A Khajiit Hunter Follower",
  "summary": "J\\'Vahhsk is a Khajiit hunter using unique gear that can be found honing his archery skills in the mountains south of Falkreath. He is equipped with reasonable gear and set to be weaker than the player (0.85 x player level) and cap out with only two skills at 100 in order to prevent him from killing everything. Also he might be Dragonborn. \r\n\r\nRequ",
  "descriptionHtml": "[B]STORY:[/B]\r\n\r\nJ\\'Vahhsk is, like the player (or un-like, for certain mods) Dragonborn. Due to his kin traditionally hailing from the mountains of southern Skyrim, he has some grasp of what the gift means, though only three shouts to his name. He discovered the gift after landing a lucky arrow on a wounded dragon pulling away from its raid on Falkreath. Since then he has traveled a bit, and after managing to almost die to a different dragon has opted to train his archery at Angi\\'s Camp. He\\'s learned much by the time the player arrives there, and is eager to leave, with the PC looking like a prime traveling companion.\r\n\r\n[B]SKILLS:[/B]\r\n\r\nJ\\'Vahhsk\\'s favored skills are Light Armor and Archery. At his maximum level these are the only two skills that will reach 100. He also has a small handful of perks to his name, but only one (Ranger) has a skill requirement of over 50. At max level he meets all perk reqs easily. His secondary skills are Sneak, One-Handed, and Block. At max level these skills are somewhere between 60 and 80 depending on the skill.\r\n\r\n[B]GEAR:[/B]\r\n\r\nJ\\'Vahhsk is laden in unique equipment, which makes him a visually interesting follower as well as a prime candidate for murder (for shady, enterprising PCs). His armor uses the model (with permission) from [URL=http://skyrim.nexusmods.com/mods/18056]Nordic Hunter Light Armor.[/URL] For headgear he wears a studded helm covered with a thick bear fur hood (from WiC, which you need to have installed). His bow is an unenchanted Nord Hero bow and is his favored weapon. For backup he has a hide shield and a unique, enchanted Nord Hero sword. The sword does have changes other than its enchantment (slightly reduced base damage but 150% crit chance and slightly enhanced speed).\r\n\r\n[B]REQUIREMENTS AND RECOMMENDATIONS:[/B]\r\n\r\nRequires [URL=http://skyrim.nexusmods.com/mods/13486]Winter Is Coming[/URL] for the helm. You do not have to actually activate Winter Is Coming. Having the resources available is enough.\r\n\r\nThis mod does not make any script or follower quest changes, so it is compatible with all follower mods, and I recommend using one to enhance functionality. I also recommend using the official HD textures as a base before installing replacers. XCE is also a good bet, for general character appearance enhancements.\r\n\r\n[B]INSTALLATION:[/B]\r\n\r\nUse NMM or extract the esp and the meshes/textures folders into the data directory manually. If asked to overwrite files click no. The only files to be overwritten are the Nordic Hunter assets, and this mod uses the latest ones, but it\\'s better safe than sorry since that mod might update again in the future.",
  "categoryId": "66",
  "version": "1.0",
  "author": "Zinthros",
  "createdUnix": "1342282599",
  "updatedUnix": "1342283414",
  "containsAdultContent": false,
  "uploadedBy": "Zinthros",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74226",
      "name": "Main File",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18324",
      "fileName": "Main File-20478-1-0.zip",
      "uploadedUnix": "1342283414",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f1c282f362d510e749d149cc52b21ff970e935bb64b340b146d5cf103144de8c/analysis/1407021910/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-20478-1-0.zip?fid=74226&ttl=1535788639&ri=8192&rs=8192&setec=473dd9be0c31e1c8a0ee323fa0d2b0aa"
    }
  ]
}