{
  "modId": 20484.0,
  "modName": "Convenient Horses FRENCH",
  "summary": "Ceci est la traduction du mod original, Convenient Horses, fait par mitchalek. ",
  "descriptionHtml": "Ceci est la traduction du mod original, [url=http://skyrim.nexusmods.com/mods/14950] Convenient Horses [/url] fait par [url=http://skyrim.nexusmods.com/users/621184] mitchalek [/url]\r<br />=====================================================================================\r<br />\r<br />\r<br />_____________________________________________________________________________________\r<br />Les Caractéristiques\r<br />_____________________________________________________________________________________\r<br />-appui pour toutes les montures de tout type.\r<br />\r<br />-chevaux pour les compagnons (Convenient Horses est compatible avec les mods de compagnons multiples UFO, AFT et EFF, jusqu&#39;à 15 chevaux. Version française de EFF [url=http://skyrim.nexusmods.com/mods/20199] ici [/url]) *Si vous utilisez EFF avec Convenient Horses, soyez sûr que le mod Convenient Horses est chargé après tous les fichiers ESP de EFF. \r<br />\r<br />-armure de cheval pour le joueur et les compagnons.\r<br />\r<br />-charge de cheval qui peut abattre les ennemis et leurs causer des dégâts\r<br />\r<br />-appel de cheval cinématique et quasiment instantané.\r<br />\r<br />-souffle de cheval\r<br />\r<br />-conversations avec les NPCs peuvent avoir lieu pendant on est monté à cheval.\r<br />\r<br />-on peut chercher les cadavres, récolter les objets et faire des autres choses pendant monté à cheval.\r<br />\r<br />-descente rapide dans laquelle on dégaine automatiquement les armes.\r<br />\r<br />-on peut transférer les inventaires des chevaux automatiquement et facilement avec un accès commode.\r<br />\r<br />-on peut changer les rapports avec les factions pour les chevaux. (amicaux ou neutres)\r<br />\r<br />-mode de suivre intelligent pour les chevaux.\r<br />\r<br />-on peut choisir le comportement des chevaux pendant les combats.(lâche ou téméraire)\r<br />\r<br />-on peut choisir &#34;l&#39;importance&#34; des chevaux. Cet-à-dire, s&#39;ils peuvent mourir ou non. \r<br />\r<br />-menu de configuration intelligent avec beaucoup de personnalisations.\r<br />\r<br />-on peut choisir entre un système de contrôle de petits coups multiples avec la touche d&#39;action ou un système de touches liées. (il faut installer ou avoir déjà installé [url=http://skse.silverlock.org/]SKSE[/url]  pour utiliser le mode de touches liées.   http://skse.silverlock.org/\r<br />_____________________________________________________________________________________\r<br />\r<br />\r<br />\r<br />_____________________________________________________________________________________\r<br />Installation\r<br />_____________________________________________________________________________________\r<br />\r<br />1.Soyez sûr de ne pas avoir une version précédente du mod. Si c&#39;est le cas, tapez ceci dans la console:\r<br />\r<br />StopQuest CH\r<br />\r<br />Après, sauvegardez. Puis désinstallez le mod. Puis faites une nouvelle sauvegarde.\r<br />\r<br />2.Soyez sûr d&#39;avoir la mise à jour plus actuelle de Skyrim.  Version 1.6\r<br />\r<br />3.Installez SKSE si vous voulez utiliser le mode de touches liées pour les commandes. Mais il N&#39;EST PAS necessaire pour utiliser les fonctionnalités basiques du mod. On peut installer le mod sans SKSE.\r<br />\r<br />4.Téléchargez Convenient Horses avec NMM ou manuellement. Si on le fait manuellement, on doit mettre les fichiers ESP et BSA dans le dossier DATA et les activer dans le menu principal sous &#34;fichiers de données&#34;.\r<br />\r<br />_____________________________________________________________________________________\r<br />Désinstallation\r<br />_____________________________________________________________________________________\r<br />\r<br />1. Ouvrez la console et tapez:\r<br />\r<br />StopQuest CH\r<br />\r<br /> \r<br />(NE FAITES PAS ça pendant les factions sont en train de se mettre à jour ou pendant des actions des autres mods.)\r<br /> \r<br />2. Faites une nouvelle sauvegarde.\r<br />\r<br />3.Désintallez le mod.\r<br />\r<br />\r<br />\r<br />_______________________________________________________________\r<br />Configuration\r<br />_______________________________________________________________\r<br />\r<br />Vous pouvez configurer Convenient Horses en utilisant le pouvoir &#34;Convenient Horses&#34; dans le menu du joueur pendant vous êtes dans le jeu lui même. Équipez le pouvoir et activez-le pour ouvrir le menu de configuration. Ici, on peut tout paramétrer. Si vous voulez utiliser les chevaux pour les compagnons, on doit choisir cette option. Elle n&#39;est pas choisie par défaut. Si vous voulez utiliser le mode de touches liées, il faut activer cette option. Elle n&#39;est pas activé par défaut.\r<br />\r<br />\r<br />\r<br />_________________________________________________________________\r<br />Modes de Contrôle\r<br />_________________________________________________________________\r<br />\r<br />\tTouches Liées - On peut lier n&#39;importe quelle touche avec n&#39;importe quelle action du mod, par example: Parler/Chercher, Descente Rapide, Accès à l&#39;inventaire, Récolter etc. Si vous n&#39;avez pas installé SKSE, Convenient Horses désactivera automatiquement cette option. Alors il faut installer SKSE, si on veut utiliser cette fonctionnalité.\r<br />\r<br />\tPetits Coups Multiples - Ça utilise la touche d&#39;action normale pour faire tout ce qu&#39;il faut faire dans le mod. Il ne faut qu&#39;utiliser des quantités de coups différentes pour chaque action. Un seul coup=monter/descendre. Quand par terre des petits coups multiples=ouvrir l&#39;inventaire du cheval. Quand monté à cheval des petits coups multiples=Parler/Récolter/Chercher. Il faut noter ici que dans ce mode de contrôle, les commandes de &#34;monter&#34; & &#34;descendre&#34; sont moins responsives pour que Convenient Horses puisse détecter le numéro de petits coups utilisés.\r<br />\r<br />\tDésactivation - Si vous voulez, c&#39;est possible de désactiver toutes ces options supplémentaires des commandes et vous pouvez utiliser seulement les autres fonctionnalités du mod comme par exemple, l&#39;appel de cheval, l&#39;armure de cheval etc.\r<br />\r<br />================================================================\r<br />Déscriptions Supplémentaires\r<br />================================================================\r<br />\r<br /> Convenient Horses détectera automatiquement UFO, AFT ou EFF si vous en utilisez un. Il ne sera pas necessaire de rien changer pour qu&#39;il les reconnaisse. Mais, par défaut les chevaux des compagnons sont désactivés et il faudra les activer dans le menu de Convenient Horses.\r<br />\r<br />Si les chevaux des compagnons sont activés, chaque compagnon recevra un cheval. Si celui, meurt, on en recevra un autre. Quand vous montez votre cheval, ils montent les leurs aussi. C&#39;est simple. \r<br />\r<br />\r<br />---------------------------------------------------------------\r<br />Il y a trois modes de comment gérer les chevaux:\r<br />---------------------------------------------------------------\r<br />-Réaliste: Les chevaux sont toujours présents, et les compagnons courront vers eux quand ils veulent chevaucher. Si les chevaux se trouvent trops loin, les compagnons utiliseront la corne pour les convoquer. \r<br />\r<br />-Mode Facile: Ceci est très similaire à Réaliste, sauf que les chevaux se mettent en position pour être montés automatiquement quand les comapgnons veulent chevaucher. Pas besoin de les convoquer ou d&#39;attendre que les compagnons les atteignent.\r<br />\r<br />-Instantané: Avec ça, les chevaux apparraissent seulement quand on veut chevaucher, et ils disparaissent après, quand on descend.\r<br />_____________________________________________________________________________________\r<br />CE QUI EST MIS PAR DÉFAUT\r<br />_____________________________________________________________________________________\r<br />Vous pouvez choisir quel cheval chaque compagnon utilise via l&#39;option de dialogue &#34;Je veux que vous montiez...&#34; ou vous pouvez choisir &#34;globalement&#34; pour tous les compagnons dans le menu de configuration. Si vous personnalisez les caractéristiques du cheval d&#39;un seul compagnon via les options de dialogue, les paramètres seronts sauvegardés même si vous renvoyez le compagnon en question. Alors, dans le cas que vous le rengagiez, il ne faudrait pas rien changer ou paramétrer.\r<br />\r<br />Par défaut, les compagnons ne sont pas &#34;essentiels,&#34; ils ignorent les combats, (pendant montés à cheval) et si déjà en combat quand le joueur monte son propre cheval ils cesseront de combattre et monteront leurs chevaux eux aussi. \r<br />\t---***NOTE: Avec la mise à jour 1.6 de Bethesda, si le joueur se bats pendant monté à cheval, les compagnons quitteront leurs chevaux et commenceront à combattre par la terre. ILS NE PEUVENT PAS COMBATTRE MONTÉS À CHEVAL.\r<br />\r<br />_____________________________________________________________________________________\r<br />ARMURE DE CHEVAL:\r<br />_____________________________________________________________________________________\r<br />vous pouvez la changer en utilisant le menu de configuration. On peut choisir l&#39;armure de cheval pour chaque compagnon individuel ou pour tous d&#39;eux. Toutes les armures et leurs textures ont été créées par Gabriel Gullbergh. Les choix disponibles sont: Cuir, Nordique, Dwemer, Ébonite, Daedra, et Os de Dragon. Aucune d&#39;elles donne aucune valeur de protection réelle. Elles servent purement au niveau esthétique.\r<br />_____________________________________________________________________________________\r<br />CHARGE DE CHEVAL: \r<br />_____________________________________________________________________________________\r<br />Le cheval peut abbattre les ennemis pendant combat, s&#39;il est en train de courir. Courir seulement ne fait rien, à moin que le cheval ne soit sur le point d&#39;entrer en collision. Quand il est possible, la collision est détectée et le cheval recevra un petit bonus de vitesse pendant une seconde. Votre personage se penchera en avant et criera. Le bonus de vitesse varie selon le niveau du joueur avec un minimum de 10% et un bonus de vitesse environ 50% au niveau 80. En plus, votre niveau, votre vitesse actuelle du cheval, votre angle de collision, et la valeur de protection de l&#39;armure de l&#39;ennemi détermineront combien de dégâts il recevra. ( à partir de 5 jusqu&#39;à 160 de points de dégâts) Avec chaque abattement réussi le cheval perdra 15-20% de sa vigueur. Vous ne pouvez l&#39;utiliser sur les cibles déjà abattues et les amis peuvent être abattus eux aussi. Alors faites attention.\r<br />_____________________________________________________________________________________\r<br />APPEL DE CHEVAL\r<br />_____________________________________________________________________________________\r<br />Avant de pouvoir convoquer les chevaux, vous devez acheter une corne  des marchants qui gérent les écuries. Il y a une option de dialogue &#34;je voudrais acheter une corne...&#34;. il y a deux types: Nordique et Impériale. Tous les deux types coûtent 500 pièces d&#39;or. Après achetée, la corne on peut utiliser comme un pouvoir. Il s&#39;appelle, Appel de Cheval. Quand vous l&#39;utilisez, il y aura une courte animation dans laquelle votre personage l&#39;utilise pour convoquer son cheval. Après l&#39;écran s&#39;atténue en noir et puis peu après, vous vous trouverez monté à votre cheval.\r<br />_____________________________________________________________________________________\r<br />SOUFFLE DE CHEVAL\r<br />_____________________________________________________________________________________\r<br />Il est aussi possible d&#39;utiliser une méthode altérnative plus en thême du jeu. On peut souffler pour convoquer le cheval. Ça vaut mieux \u001ed&#39;être utilisé si le cheval n&#39;est pas commandé de vous suivre, ou s&#39;il utilise le mode &#34;intelligent&#34; pour vous suivre. Ça utilise l&#39;IA originale et alors le cheval peut mettre assez de temps pour vous arriver. On peut attendre pendant une heure dans le jeu pour accélérer le processus. Le souffle de cheval est un pouvoir, mais pour l&#39;obtenir on doit apprendre comment souffler et comment perfectionner votre abilité. Il y a une option de dialogue avec beaucoup des NPCs maintenant &#34;Écoûtez-moi&#33; Je peux souffler&#33;&#33;&#33;&#34;. Continuez à utiliser ça avec les gens, et après un peu de temps, vous pouvez y arriver. :)\r<br />\r<br />_____________________________________________________________________________________\r<br />ENGAGER EN CONVERSATIONS ET CHERCHER LES CADAVRES ET COFFRES PENDANT MONTÉ À CHEVAL\r<br />_____________________________________________________________________________________\r<br />Ça ne marche pas avec le réticule comme on penserait. Au lieu de ça, il y a un système de radius. Vous devez faire attention à la distance entre votre cheval et la personne ou la cible avec laquelle vous voulez interagir. Il est aussi possible de parler avec les gens montés à cheval. Vous pouvez aussi fouiller les cadavres en faisant ce que vous faites pour parler avec les gens. Si vous utilisez le mode des petits coups multiples au lieu des touches liées, ça prend le lieu de l&#39;action de récolter les objets dans chaque instance appplicable.\r<br />_____________________________________________________________________________________\r<br />L&#39;INVENTAIRE DU CHEVAL:\r<br />_____________________________________________________________________________________\r<br />Pour être super prudent, l&#39;inventaire du cheval sera entreposé dans un coffre lontain et isolé. Il sera transféré au dernier cheval utilisé quand vous l&#39;ouvrez. Si le cheval meurt, vous pouvez prendre tous vos objets à partir de son corps, et si vous arrêtez la &#34;QUEST&#34;, tout objet sera récuperé automatiquement. Le mode des touches liées vous permet un accès très pratique. Par exemple, en appuyant sur la touche de l&#39;inventaire (touche liée) vous vous transférez automatiquement chez le cheval et son inventaire. Quand fini avec ça, et quand vous sortez de son menu, vous vous trouverez de retour à ou vous étiez avant. Ça est très pratique quand on est chez un marchand et on veut accéder rapidement à l&#39;inventaire du cheval pour vendre des choses. Il marche même quand vous portez trop de poids.\r<br />_____________________________________________________________________________________\r<br />RAPPORTS AVEC LES FACTIONS:\r<br />_____________________________________________________________________________________\r<br />Quand vous chargez le mod pour la première fois, il y aura un message en haut à gauche où s&#39;affichera le chargement des rapports avec les factions. Au début et par défaut, les rapports seront amicaux et le cheval ne participera jamais aux combats. Veuillez patienter un peu parce que ce processus peut y mettre une belle minute. Il y a milliers de factions différentes. Il vaut mieux de ne pas sauvegarder la partie jusque le chargement ne sera pas terminé. En tout moment après, vous pouvez changer les rapports avec les factions et il seront mis en une file d&#39;attente et mis à jour le plus tôt possible. Les rapports avec les factions s&#39;appliquent aussi aux chevaux des compagnons.\t\r<br />_____________________________________________________________________________________\r<br />MODE DE SUIVRE INTELLIGENT:\r<br />_____________________________________________________________________________________\r<br />Par défaut, les chevaux ne suivent personne. Vous pouvez changer entre les modes de suivre en tapant la touche liée ou en faisant trois petits coups multiples si vous utilisez le mode de contrôle correspondant. Vous pouvez aussi changer le mode dans le menu de configuration en choisissant Mode de Suivre: &#34;intelligent&#34; ou &#34;toujours&#34; ou &#34;jamais&#34;. &#34;Intelligent&#34; veut dire que le cheval vous suivra, mais pas partout; si vous utilisez la furtivité ou vous vous trouves dans certain endroits, il cessera de vous suivre. (Il y a plus de 200 endroits logiquement choisis dans lesquels les chevaux ne suivront pas. Par exemple, certains campements des bandits et les choses pareils.) Vous pouvez choisir entre trois autres paramètres prédéterminés: &#34;La distance à laquelle le cheval vous suit: Courte, Moyenne, et Lontaine.&#34;\r<br />_____________________________________________________________________________________\r<br />COMPORTEMENT DES CHEVAUX PENDANT LES COMBATS:\r<br />_____________________________________________________________________________________\r<br />Il y a deux options: Téméraire et Lâche. La première option fait de manière que le cheval attauque ses ennemis à la vue. La seconde option fait de manière qu&#39;il ne fait rien, et il quitte toujours la zone quand il y a une bagarre. Faites attention à utiliser ces fonctionnalités logiquement avec celles des rapports avec les factions&#33; Par exemple, vous avez les rapports amicaux avec les factions, mais un cheval téméraire, le résultat sera un cheval qui ne quitte pas les combats, mais n&#39;y participe non plus.\r<br />_____________________________________________________________________________________\r<br />COMPATABILITÉ\r<br />_____________________________________________________________________________________\r<br />-Tout autre mod qui modifie les scripts du comportment des chevaux n&#39;est pas compatible avec Convenient Horses. \r<br />\r<br />-Si le mod a une fonctionnalité qui addresse l&#39;inventaire du cheval et l&#39;activation de son inventaire, il vaut mieux de ne pas utiliser le mod avec Convenient Horses.\r<br />\r<br />-Si vous utilisez l&#39;armure de cheval avec des skins ou des selles modifiés ou personnalisés, il y aura probablement des conflits. (le cheval apparaitra nu ou invisible) Le conflit avec les selles peut être résolu en chargeant le fichier esp de selles après celui de Convenient Horses. \r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/28680][img]http://www.ushareimg.com/images/286T3R.png[/img][/url]",
  "categoryId": "66",
  "version": "3.3",
  "author": "mitchalek",
  "createdUnix": "1342291698",
  "updatedUnix": "1342569150",
  "containsAdultContent": false,
  "uploadedBy": "aloot",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74987",
      "name": "Convenient Horses FRENCH",
      "version": "3.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28222",
      "fileName": "Convenient Horses FRENCH-20484-3-3.7z",
      "uploadedUnix": "1342569150",
      "modVersion": "3.3",
      "virusScanUrl": "https://www.virustotal.com/file/e798440a804ebe50bcf155a1207661030d2670cca1145164371fee6b2e2e0fc5/analysis/1407029874/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horses%20FRENCH-20484-3-3.7z?fid=74987&ttl=1535788650&ri=8192&rs=8192&setec=df812a6d311b7aa7f8ec7fd8d9e3538f"
    }
  ]
}