{
  "modId": 20493.0,
  "modName": "BETA Reich Corrigate -Player Town- -testers wanted-",
  "summary": "This is an very unpolished Player Town/Fief improvement mod. I\\\\\\'m currently looking for a few knowledgable modders who are willing to play with this beta and give me feedback/suggestions/scripting teckniques or hints.\r\n\r\n",
  "descriptionHtml": "This is an very unpolished Player Town/Fief improvement mod. I\\\\\\'m currently looking for a few knowledgable modders who are willing to play with this beta and give me feedback/suggestions/scripting teckniques or hints. Please private message me your suggestions and I will include you in the credits of the release version under Tester and or Script Advice. I am pulling this file after about 25 dl\\\\\\'s.\r\n\r\nDescription:\r\nReich Corrigate is a keep just West of Rift Watchtower. Once you have taken it back from the bandits you can speak to Avaniel Farenthor, the keeps old Steward (kept around by the bandits as a lowly servant) he will arange the construction of new estates and properties for your new fief, as well as hiring other members of your court.\r\n\r\nCURRENT UPGRADES: (all exteriors complete obvs)\r\n\r\n-Chappel (shrines+interior+NPC\\\\\\'s)\r\n-Inn (Interior+NPC\\\\\\'s+Income)\r\n-Western Wall and Fort (interior+NPC\\\\\\'s)\r\n-South Gate (complete)\r\n-Eastern Wall (complete)\r\n-Industry (semi Interior)\r\n-Settlers Residents (income)\r\n-Cheap Housing (income)\r\n-Merchants Guild (income)\r\n-Hunters Guild\r\n-Dense Residential\r\n\r\nAfter you buy the upgrades from Avaniel they should appear outside on the plateau. The walls and gate are only available from Hiring and talking to the Guard Captain. There is a room at the end of the hall in the keep where income from upgrades should appear.\r\n\r\nPROBLEMS I KNOW OF BUT DONT HAVE A FIX:\r\n-Guards fall through the walls they are posted on DX.\r\n-Outdoor music stops upon entering the keep grounds\r\n-player can still purchase most of the upgrades with 0 gold. \\\\\\\"0 gold removed\\\\\\\" is displayed upon purchase.\r\n-Captain Jzargo occasionally clips through the cieling of keep on load.\r\n-Weapon racks not working.\r\n\r\n\r\nPUBLICATION:\r\nThis is a beta, and under no surcumstance are you to upload this file to any other site or modify it for your own. I will be giving those rights after the finished product is completed so please be patient.\r\n\r\n\r\n\r\n",
  "categoryId": "67",
  "version": "0.5",
  "author": "Kyman3",
  "createdUnix": "1342297141",
  "updatedUnix": "1342297141",
  "containsAdultContent": false,
  "uploadedBy": "Kyman3",
  "primaryFile": null,
  "files": []
}