{
  "modId": 20496.0,
  "modName": "Tamrielic Lore - Chrysamere",
  "summary": "Uncover Chrysamere, the Paladin\\'s Sword, Sword of Heroes, a fabled two handed weapon.",
  "descriptionHtml": "Due to public demand, this mod is now also available on the Skyrim Nexus, enjoy!\r\n\r\nYou can also find this on the Steam Workshop:\r\n\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=17642224\r\n\r\nI also added a complete walkthrough video:\r\n\r\nhttp://youtu.be/IPsjtwdUcZ0\r\n\r\n=====\r\n\r\nUpdate July 16th, 2012:\r\n\r\n- Fixed missing tempering recipe for the scabbarded version of Chrysamere.\r\n\r\n-----\r\n\r\nUpdate July 14th, 2012:\r\n\r\n- IMPORTANT: To get the updated enchantment to work, please unequip and then reequip Chrysamere!\r\n- Added an optional scabbard! It\\'s located right next to the sword in the Chrysamere Reliquary, and activating it will allow you to swap between a sword with and without scabbard.\r\n- Chrysamere grants you a power while you have it equipped that expends 25% of its enchantment charge to cast a powerful area healing and cure disease/poison spell.\r\n- Replaced the dodgy message box at the beginning of the quest with a real encounter.\r\n- Added a \\\"backdoor\\\" to start the quest if the story manager event should fail. (See the description below for details.)\r\n- Slightly tweaked the material settings of Chrysamere.\r\n- Fixed bug with the blocking effect, where you couldn\\'t reflect spells if your stamina ran out.\r\n- Fixed another bug with the blocking effect, where you could still absorb spells if Chrysamere\\'s enchantment was drained.\r\n- Fixed a leftover description for one of the magic effects.\r\n- Increased enchantment cost for reflecting single spells once more (from 25 to 35), and lowered upkeep cost of reflecting channeled spells (from 3 to 2).\r\n- Fixed the incremental taunt triggers in the cave, to only fire when the player runs through them.\r\n- Changed all teleporters to transport up to eight followers with the player into and out of the cave.\r\n- Added commentary triggers, so the follower(s) react to specific locations.\r\n- Added a bit of hidden loot to the cave.\r\n- Your favorite enemy in this quest has learned a few new tricks, making the fight even more challenging ;)\r\n\r\n-----\r\n\r\nUpdate April 29th, 2012:\r\n\r\n- IMPORTANT: To get the fixed enchantment to work, please unequip and then reequip Chrysamere!\r\n- fixed issue where unequipping chrysamere while not fully charged would temporarily \\\"freeze\\\" the enchantment regeneration\r\n- slightly increased enchantment cost of reflecting singular spells (from 20 to 25), while lowering upkeep cost of reflecting channeled spells (from 4 to 3)\r\n- slightly increased time to fully recharge (from 500 to 600 seconds)\r\n- fixed black mesh edges showing up in lower mip map levels\r\n- reduced texture map memory usage (still same quality)\r\n- made look slightly grittier:\r\n  o less saturated\r\n  o added a bit of noise\r\n  o glowing runes darker\r\n  o trail slightly more transparent\r\n  o shininess bit broader and darker\r\n\r\n=====\r\n\r\nThis mod adds Chrysamere to the game. It is the first in a series that adds several famous, \\\"missing\\\" artifacts from earlier Elder Scrolls games to Skyrim. I didn\\'t want to just drop it into the game world, so there\\'s a small quest to retrieve it. To start, go to Solitude... You should be at least level 10 to get the quest.\r\nIf the quest shouldn\\'t start for whatever reasons (i.e. buggy Skyrim, mod conflicts, etc...), you can go to the Temple of Divines in Solitude, and look for a key on a closet, at the end of a small hallway just right of the altars.\r\n\r\n-----\r\n\r\nChrysamere is a rather powerful two handed sword with an equally potent defensive enchantment. It confers 25% fire resistance, and will constantly restore 3 hitpoints per second, regardless if you are in combat or not. While blocking, you can reflect all detrimental spells cast against you. Doing so will drain enchantment charges, which you can either restore with soulstones, or you can just wait, as they will automatically regenerate over time.\r\nChrysamere also grants you a \\\"Gift of Chrysamere\\\" power while you have it equipped. When cast, it will expend 25% of Chrysamere\\'s charge to cast a powerful healing, cure disease and cure poison spell.\r\n\r\nDon\\'t forget to pick up the book, it\\'s a collectible!\r\n\r\n-----\r\n\r\nFAQ:\r\n\r\nQ: \\\"This sword is underpowered! Make it stronger!\\\"\r\nQ: \\\"This sword is overpowered! Make it weaker!\\\"\r\nA: Base damage wise, Chrysamere sits comfortably 1 point above a Daedric Warhammer. That\\'s quite hefty, but I think OK for such a powerful artifact. Also, it has no offensive enchantments, so \\\"what you see is what you get\\\".\r\nOn the other hand it has rather powerful passive enchantments, plus you can fully upgrade it - which means it should have more base damage than any other two handed weapon in the game.\r\nBesides all of that - you yourself have the power to make it as weak or strong as you want. Too strong? Don\\'t upgrade it, don\\'t wear +two handed damage items. Too weak? Upgrade it with a full smithing set and a blacksmithing potion (or even use the console to give yourself 500 smithing skill...)\r\n\r\nQ: \\\"Can you make a one handed version?\\\"\r\nA: Yes, but I don\\'t want to, since Chrysamere always was (and always will be, I hope) a two handed weapon. Sorry. You can of course use the model and the plugin to make your own one handed version.\r\n\r\nQ: \\\"I installed your mod, and my game crashes/computer caught fire/dog exploded!\\\"\r\nA: Sorry, I don\\'t think I can really help you. If your game crashes, try disabling various other mods - Chrysamere definitely works with an unmodded, patched Skyrim, so if it crashes it most likely conflicts with another mod. If you happen to find out where the incompatibility lies, please tell me, then I might be able to help you.\r\nOn the plus side, you can have your money back if you don\\'t like it!\r\n\r\nQ: \\\"How do I start the quest? I went to Solitude but nothing happened!\\\"\r\nA: Several things could be the reason for that:\r\n    1.) You are not level 10 yet. This is the minimum level to start the quest, and it will be quite difficult to beat even at Novice level.\r\n    2.) You were already in Solitude when you activated the plugin. For some reason the quest trigger only fires if you travel TO Solitude from somewhere OUTSIDE Solitude. Try travelling to another city, then come back to Solitude.\r\n    3,) You have to wait for about 10 seconds for the quest to actually start. So don\\'t constantly change location while you want the quest to begin - just run through Solitude for a bit and it should start.\r\n    4.) Another quest might be blocking the Chrysamere quest. I don\\'t think this has happened yet, but theoretically another quest could be blocking the Chrysamere quest from beginning. Try completing quests in Solitude and see if that solves the problem.\r\nIf the quest just won\\'t start, simply head into the Solitude Temple of Divines and grab a key for the Reliquary which will forcefully start the quest.\r\n\r\nQ: \\\"I can\\'t upgrade Chrysamere, even though I have the required items!\\\"\r\nA: Just to make sure, Chrysamere requires this to upgrade:\r\n - Arcane Blacksmith perk\r\n - 1 Gold Ingot [0005AD9E]\r\n - 1 Steel Ingot [0005ACE5]\r\n - 1 Silver Ingot [0005ACE3]\r\n - 1 Flawless Ruby [00068522]\r\nIf you have all of this, and use a grindstone at a blacksmith, you should be able to temper Chrysamere. If not, then possibly another mod might be interfering, probably by adding a new \\\"Flawless Ruby\\\" item with a different formid to the game, or globally replacing all rubies with different versions. You can check this by entering\r\n\r\nhelp \\\"Flawless Ruby\\\"\r\nhelp \\\"Gold Ingot\\\"\r\nhelp \\\"Steel Ingot\\\"\r\nhelp \\\"Silver Ingot\\\"\r\n\r\non the console. The form id\\'s for the items you get should match the ones I posted in brackets above. If one of them is different (begins with a different number than 00 for example), then most likely a mod is interfering. You can then try manually adding the specific missing items to your inventory, by entering for example:\r\n\r\nplayer.additem 00068522 1\r\n\r\nto spawn a single flawless ruby in your inventory.\r\n\r\nSomething that can also prohibit items from registering for the tempering recipe is when they are flagged as quest items. For example, there is a thieve\\'s guild quest that requires you to steal a flawless ruby, marking them as quest items - until you have completed that quest, you won\\'t be able to upgrade Chrysamere.\r\n\r\n=====\r\n\r\nEnjoy!",
  "categoryId": "55",
  "version": "4",
  "author": "thebigMuh",
  "createdUnix": "1342298912",
  "updatedUnix": "1342394234",
  "containsAdultContent": false,
  "uploadedBy": "thebigMuh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74279",
      "name": "Tamrielic Lore - Chrysamere",
      "version": "3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24656",
      "fileName": "Tamrielic Lore - Chrysamere-20496-3.zip",
      "uploadedUnix": "1342299244",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/85e3742d80f8cca4ceb1ae3cb7856bc2223c7a96903c3c69fa30658f6b61d3dc/analysis/1407022337/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tamrielic%20Lore%20-%20Chrysamere-20496-3.zip?fid=74279&ttl=1535788675&ri=8192&rs=8192&setec=f13529c1f05d95bd089fba4880bb5f7d"
    },
    {
      "fileId": "74574",
      "name": "Tamrielic Lore - Chrysamere",
      "version": "4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24656",
      "fileName": "Tamrielic Lore - Chrysamere-20496-4.zip",
      "uploadedUnix": "1342394234",
      "modVersion": "4",
      "virusScanUrl": "https://www.virustotal.com/file/acbc94ea6dff4f9d3844238968d24bf6afddba8f6b84f2baf72d1a68f1421a11/analysis/1407025277/",
      "changelogHtml": " - Fixed missing tempering recipe for the scabbarded version of Chrysamere. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tamrielic%20Lore%20-%20Chrysamere-20496-4.zip?fid=74574&ttl=1535788676&ri=8192&rs=8192&setec=02cbddc820b38b666e9d4c8928e4fa17"
    }
  ]
}