{
  "modId": 20510.0,
  "modName": "Legate Titania Constantius - Companion",
  "summary": "Adds a Female Imperial Legate for you.",
  "descriptionHtml": "Legate Titania Constantius \r\n\r\nShe is loosely based off Legate Rikke in terms of temperment and voice type but she is an Imperial and available for Hire.\r\n\r\nShe is proficient in Archery, Single and double handed weapons and good with a shield.\r\nShe has no magical ability what so ever as its not a traditional practise.\r\n\r\nShe is a traditional soldier and will go where she is ordered and needed. Titania dislikes the Thalmor as anyother person does and has seen only once what they did to Hammerfell citizens first hand near the border.\r\n\r\nAnyway, she can be found coaxing about Outside Castle Dour where the training area is.\r\nShe is a generic Follower as encountered throughout the game and has no special custom abilities.\r\n\r\nShe is wearing Heavy Legion Armor and wields a Imperial Sword and Shield with Imperial Bow and Steel Arrows and a Steel Nordic Dagger as backup.\r\n\r\nTitania is ment to look a defined 37 something-ish and not some freshfaced-buxom beauty in skimpy attire.\r\n\r\nRequirements -\r\n\r\nNone absolutly what so ever. Everything is vanilla, the hair, the eyes, the weapons... the works.. vanilla.\r\n\r\n-little background story-\r\n\r\nTitania is a person who helps co-ordinate behind the scenes as she already has seen her fair share of battles involving dissidents from Hammerfell and bandits along the Skyrim/hammerfell border.\r\nShe is aproximately 37 years old and has some family in Skyrim dating back generations.\r\nHer great-grandfather was infact a Nord called Heimdil Wall-Breaker who helded demolish and rebuild the ruins of the Imperial City after the siege and occupation of the Thalmor 200 years previous and there he met Titania\\'s great-grandmother Celia Constantius.\r\nThey married but Celia kept her ser-name and along the line to Titania.\r\nThis is one reason why Titania is fighting in Skyrim as its part of her legecy and duty to the empire.\r\n\r\n",
  "categoryId": "66",
  "version": "1",
  "author": "Beth",
  "createdUnix": "1342312671",
  "updatedUnix": "1342320310",
  "containsAdultContent": false,
  "uploadedBy": "nofear88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74354",
      "name": "Legate Titania",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "141",
      "fileName": "Legate Titania-20510-1.rar",
      "uploadedUnix": "1342320310",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/37f90b82a865bc8a69e267255f83d6ea709d5bfa1dce525a6125fbca526d8511/analysis/1407023116/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legate%20Titania-20510-1.rar?fid=74354&ttl=1535788694&ri=8192&rs=8192&setec=13003c10aa0bf4b40573cbd693efea19"
    }
  ]
}