{
  "modId": 20538.0,
  "modName": "DremOrc Race",
  "summary": "The DremOrc race is a fusion between the Dremora and the Orc races. They where created by an alliance forged between Mehrunes Dagon and Malacath to destroy Alduin. The DremOrc are masters in the schools of Destruction and Conjuration Magic and fearsome in battle.",
  "descriptionHtml": "DremOrc Race mod:\r\n\r\n1- Introduction\r\n\r\n2- Race Features\r\n\r\n3- Installing\r\n\r\n4- Future for the mod\r\n\r\n\r\n1- Hello guys and thanks first of all for reading this!\r\n   I started working on this mod when i was working on the \r\n   the creation kit; and i was looking on the Dremora Race;\r\n   and one of the things that got my atention was the cool\r\n   horns that the race has and started wandering what other\r\n   race would look very cool with those horns and of course\r\n   the Orc Race was the first that came to my mind; but i \r\n   needed some sort of idea for the race to make sense; so \r\n   i started recearching about the two races and their gods\r\n   in the game and soon after the idea was tacking shape;\r\n   The two gods of the Races ( Mehrunes Dagon and Malacath)\r\n   joining forces against Alduin by creating some sort of \r\n   Fusion between the Dremora and Orc Race; thats where the\r\n   name for the Race came to be; the DremOrc Race.\r\n   The Story is explained a little more in detail on the \r\n   text you read when you are selecting the Races.\r\n\r\n\r\n2- The DremOrc are masters in the schools of Destruction\r\n   and Conjuration Magic and like to wear heavy armor and\r\n   their weapons of choice are mainly one handed; but the \r\n   mace is their favorite.\r\n\r\n   DremOrc Race:\r\n\r\n   Skill Bonus:\r\n   \r\n   Block- 5\r\n   \r\n   Conjuration- 10\r\n\r\n   Destruction- 10\r\n\r\n   Heavy Armor- 5\r\n\r\n   One Handed- 5\r\n\r\n\r\n   Specials (Spells):\r\n\r\n   Ability DremOrc: DremOrc are half daedric and their main\r\n                    source of power is fire given to them\r\n                    by Mehrunes Dagon from Oblivion; so \r\n                    they have a 50% resistance to fire; but\r\n                    they also have 50% weakness to frost.\r\n\r\n   DremOrc Firebolt: DremOrc are naturally gifted in \r\n                     destruction magic so they can cast\r\n                     their own firebolt spell by half the\r\n                     mana cost of a normal firebolt spell.\r\n\r\n   DremOrc Summon Flame Atronach: \r\n\r\n   Dremorc when coming of age and after proving their valor\r\n   in combat receive the gift to summon they\\'re guardian;\r\n   the flame atronach that can be summoned once per day for\r\n   60 seconds.\r\n\r\n   DremOrc have the body and looks of an orc except for the\r\n   Dremora Horns but their skin tone is the same has the \r\n   Dremora but because they are a fusion between two \r\n   different races; they can also sometimes have some other\r\n   different skin types.\r\n   \r\n   Both Male and Female versions have 10 preseted characters\r\n   for you to choose from.\r\n\r\n\r\n   3- Installing DremOrc Race is very easy; just put the \r\n      DremOrcRace.esp file in your skyrim data folder and\r\n      then check in the data files menu if it as been \r\n      activated. \r\n      The mod doesn\\'t come with any other files because all\r\n      i used for this mod is from the vanilla game.\r\n\r\n   4- I would really like for this race to have a sort of \r\n      tail like the argonians have but one that looked more\r\n      like a Demon\\'s tail.\r\n      I\\'ve Tried several argonian horns too; they are cool \r\n      but don\\'t fit very well but i think it would be possible\r\n      to make them fit and that would give more horned styles\r\n      to choose from. \r\n      If anyone who has the skill to make this enjoys the\r\n      mod and wants to help me out; that would be great and \r\n      of course i would give him full credit for its work.\r\n\r\n   If you really liked this mod don\\'t forget to endorse and \r\n   comment and feel free to give ideas for the mod for \r\n   future updates.  \r\n\r\n\r\n \r\n\r\n   \r\n\r\n \r\n     ",
  "categoryId": "34",
  "version": "",
  "author": "Sergeynest",
  "createdUnix": "1342353473",
  "updatedUnix": "1342353742",
  "containsAdultContent": false,
  "uploadedBy": "Sergeynest",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74436",
      "name": "DremOrc Race",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8505",
      "fileName": "DremOrc Race-20538-.rar",
      "uploadedUnix": "1342353742",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f015b22ceed0b2b71c336f2f4cfef97616fe7918a198ed5da81e307b0cd128b4/analysis/1407023956/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DremOrc%20Race-20538-.rar?fid=74436&ttl=1535788739&ri=8192&rs=8192&setec=925e5893bcc8a990de6b9b7cb1d0e077"
    }
  ]
}