{
  "modId": 20566.0,
  "modName": "Vaa Armor Vampire Assassin Armour _ vampire armor _",
  "summary": "a armor mod i been working on for a while comes with a full set of armor a shield(7 parts) and a sword ",
  "descriptionHtml": "v.A.A Vampire Assassin Armour:\r\nNOTE: the texture sucks i really am sorry for bad quality textures if anyone coulod help me re do the texture i would love the help i really need any help with this part of my mod \r\nwhen adding the normal map update file when asked to replace files click yes or manula replace files in texture folders\r\nVaa armor is my first armor mod \r\nis it not weightslider friendly \r\nbut it is meant for a small sneaking character \r\nit comes with a custom modeled sword\r\na 7 piece armor set \r\nthe armor comes in 7 pieces if you don\\'t like the red fur on the shoulder it can be taken off or the cape it can be to taken off in the future i will add different colors for those how leave a comment telling what colors they prefer\r\nfor some reason the fur is not showing up correctly and is too smooth and not the detialed way that it showed up when creating it im working on how to fix that right now\r\nUpdate: fixed alot of clipping error added some better textures for the outfit and fur and added a different version of the armor and re did the sword hope yall like it\r\nBack-story\r\nThe armor belonged to Marius Vae, a great noble vampire while passing through skyrim he saw a beautiful young Breton woman traveling from High Rock to seek the art of magic from the college of Winterhold. one day he followed her into the inn in solitude and they eventually fell in love. well one day while travailing to Riften to get married in the temple of Mara they were approach by a group of  thugs attempt to steal Marius gold and other items.\r\nMarius and the thugs fought but it being day time his body was weak and couldn\\'t fend them off.\r\nthe thugs knocked Marius out and did way with his soon to be wife and killed her. when he woke up from his deep sleep he found her body down near the creek where they was earlier walking along side happy and excited to be getting married.  he went into a horrifying rage and done anything to take his own life but nothing would work not fire nothing. A voice called out to him and told him what was happening. his wife was taken he had to get revenge he was granted the true power of immortality to seek that revenge. but after years and years of searching he could not find the thugs that did this to him he slaughter countless others but couldn\\'t find them. he prayed out to that mysterious voice and said to it that he didn\\'t want revenge anymore he only sought to see his love again. the voice laugh and told Marius that seeing his wife wasn\\'t part of the deal and left him all alone in the waste of the bandit camp he destroyed. Marius then traveled to solitude where he first meet his love and went to the temple of the divines where he seek to find a way t  get rid of his curse and to have his wife once again. after countless years have passed after many deeds to the divines where fulfilled the divines granted him his wish and released him from his undead form. But did he ever fine his love? are they together now forever in peace able to live out their entirety together?\r\n\r\nThanks to insane0hflex for featuring my mod in his mod spotlight\r\n\r\n[youtube]TYpE9lVj6bU[/youtube]\r\n\r\n  the armor and weapon can be found in a barrel in front of the blacksmith in riverwood",
  "categoryId": "54",
  "version": "1.5",
  "author": "TMWrath",
  "createdUnix": "1342382076",
  "updatedUnix": "1344482941",
  "containsAdultContent": false,
  "uploadedBy": "meltontyler",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74511",
      "name": "Vaa Armor v1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8297",
      "fileName": "Vaa Armor v1-20566-1-0.zip",
      "uploadedUnix": "1342382189",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b10beb26a6381c1c27cfc50a606e8cd3d3a61b15c75f31ee5711ff1744775b5e/analysis/1407024666/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vaa%20Armor%20v1-20566-1-0.zip?fid=74511&ttl=1535788787&ri=8192&rs=8192&setec=be9a8765da808ef3f02a855f7a5356d5"
    },
    {
      "fileId": "76504",
      "name": "Vaa Armor Vampire Assassin Armour",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7074",
      "fileName": "Vaa Armor Vampire Assassin Armour-20566-1-1.rar",
      "uploadedUnix": "1343196108",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/0a4a1a1ea202b8519c564972a35173db99ca0e6725b53c8b3ff37dbbb436b7bc/analysis/1407044535/",
      "changelogHtml": "  fixed alot of clipping error added some better textures for the outfit and fur and added a different version of the armor and re did the sword hope yall like it <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vaa%20Armor%20Vampire%20Assassin%20Armour-20566-1-1.rar?fid=76504&ttl=1535788787&ri=8192&rs=8192&setec=8a22b2d7c65b39a0fc045b15899653e4"
    },
    {
      "fileId": "76654",
      "name": "Normal map update file for 1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2367",
      "fileName": "Normal map update file for 1_1-20566-1-1.rar",
      "uploadedUnix": "1343274236",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d7230f4950b6a0608f1e7399b8495e8b702141a8c9ec604e53a1a2d1cf10c882/analysis/1407046566/",
      "changelogHtml": "  fixed alot of clipping error added some better textures for the outfit and fur and added a different version of the armor and re did the sword hope yall like it <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Normal%20map%20update%20file%20for%201_1-20566-1-1.rar?fid=76654&ttl=1535788788&ri=8192&rs=8192&setec=e751eefef77666344554943e020289ce"
    },
    {
      "fileId": "79933",
      "name": "VAA 1-5",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7436",
      "fileName": "VAA 1-5-20566-1-5.rar",
      "uploadedUnix": "1344482941",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/89c7edfc3a093e481082c1b9c3cd5c550bc15e7baf099eb78c602a0b5ce1c165/analysis/1407081665/",
      "changelogHtml": " texture update <br/> \n please note that there is clipping issues with the shoulder pads im not very good with making it work with weightslider yet so keep in mind that the shoulders pads should not be mixed match with some armors  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VAA%201-5-20566-1-5.rar?fid=79933&ttl=1535788788&ri=8192&rs=8192&setec=d215e850958f42125cef04d4415880c1"
    }
  ]
}