{
  "modId": 20561.0,
  "modName": "Heartwood Cottage - No Load Doors",
  "summary": "Nestled in the Fall Forest, just down the road from the Heartwood Sawmill, lies a quaint cottage that has everything an adventurer might need : all crafting stations in one area - labelled storage with automatic sorting - weapon and shield racks - optional mannequins - kitchen area - guest quarters - barn and stable area - All with NO LOAD DOORS!",
  "descriptionHtml": "[url=https://flic.kr/p/GgZMJP][img]https://farm1.staticflickr.com/783/26435293407_75ae650536_b.jpg[/img][/url]\n<br />\n<br />Featured at  http://www.skyrimgems.com/\n<br />[img]http://i.imgur.com/m24Q6.png[/img]\n<br />\n<br />\n<br />[url=https://flic.kr/p/GgZMua][img]https://farm1.staticflickr.com/868/26435292557_9dc3fcec96_b.jpg[/img][/url]\n<br />\n<br />Has all the shrines and Doomstones in one room!\n<br />2 versions available - with or without mannequins--both have the same .esp name so you can update at anytime.\n<br />\n<br />Features:\n<br />18 weapon racks\n<br />6 shield racks\n<br />5 mannequins\n<br />(No Mannequin version features 27 weapon racks, 10 shield racks)\n<br />\n<br />[url=https://flic.kr/p/24RaFPd][img]https://farm1.staticflickr.com/898/40594161094_dc000d57bd_b.jpg[/img][/url]\n<br />\n<br />This mod uses Manilla Turtle's Automatic Item Storage Mod which is an .esm file. When you download the data file, you will need to click on the HeartwoodCottage.esp and also the MTautostorage.esm on your data screen. This mod will not run without the MTautostorage.esm mod running.\n<br />                                                             \n<br />                                                                      **************************\n<br />\n<br />Easy to find -- west of Riften and down the road from Heartwood sawmill. A map marker pops up upon install.\n<br />[url=https://flic.kr/p/23bktAd][img]https://farm1.staticflickr.com/796/39498370980_087f6976f4_z.jpg[/img][/url]\n<br />\n<br />[url=https://flic.kr/p/24RaFGQ][img]https://farm1.staticflickr.com/869/40594160724_0483c41f01_b.jpg[/img][/url]\n<br />\n<br />[url=https://flic.kr/p/GgZMyD][img]https://farm1.staticflickr.com/784/26435292817_bd7ef25859_b.jpg[/img][/url]\n<br />\n<br />[url=https://flic.kr/p/25SpUoC][img]https://farm1.staticflickr.com/886/41264608232_82a4b340b3_z.jpg[/img][/url]\n<br />\n<br />[url=https://flic.kr/p/23bkttu][img]https://farm1.staticflickr.com/885/39498370590_22a35d8b04.jpg[/img][/url]\n<br />\n<br />[url=https://flic.kr/p/24v8WP5][img]https://farm5.staticflickr.com/4722/40367491402_c80a9ee1dd_b.jpg[/img][/url]\n<br />\n<br />Heartwood Cottage is a house that resides in the exterior world of Skyrim and is the fourth such structure that I’ve made. With each abode, I’ve learned what is possible, what isn’t, and what just might be. What started me off in this odd journey was the desire to build an arboretum for my first house mod: “Dragonius Tower” with the idea to have a place to grow some plants in the frigid climates of the southern mountains. That led to “Grey Ledge Manor” and “Grey Ledge Manor II”. It also led to a lot of problem-solving, research, and some amount of popularity among many who have really enjoyed these homes.\n<br />\n<br />It has also shed some insight and understanding as to why Bethesda didn’t attempt such a thing. It all comes down to resources and the ability to have your creation be suitable on various hardware set-ups, play-settings, and with very different types of mods installed.  Heartwood Cottage is an attempt to make a house that is more playable by more people.\n<br />\n<br />The secret to this house is not the actual house structure itself, but what is concealed within the walls of the barn.  It is built around an occlusion cube that allows the computer to not have to render what is inside the barn when one is outside and vice-versa when inside. This allows for more items to be on display without causing a drain on the cpu. Well, that was the idea anyway. \n<br />\n<br />My benchmark is my computer – an HP Pavilion with an nvidia gt220 card – definitely NOT a gamer’s system, but I get by on medium settings with long draw distances. I could never play ‘Grey Ledge’ with the DLC HD Texture Packs without a lot of lag. “Grey Ledge II” was better but not by a whole lot. This house was designed for me to play with both texture packs installed and maybe even up the game play settings or have additional texture packs.\n<br />\n<br />This is the final result:\n<br />As a single player, I can play the main version with no problem, no lag, and only a second ‘stutter’ when entering the barn (more on that later).  I lose only a couple frps when playing this way and can even get by when playing other texture packs in addition to the DLC ones.\n<br />\n<br />It is when I have a follower that I have problems.  I believe this is due to the navmesh in the barn, which is necessary for the mannequins.  Whether connected to the rest of the cell’s navmesh or left as an island, I experience lag when looking toward the barn. If I have the follower in ‘waiting mode’ it is not quite so pronounced. However, lag can also be produced when you enter the barn and your follower attempts to follow you. They stop following the navmeshed route and try to go through the wall. At some point they succeed and will stand next to you, but they have the same problem getting out. This may be because the occlusion cube cuts the navmesh and confuses the a.i.  or it may not be rendering it at all. It's as if they know you're there, but they can't see you or a way to get to you. Of course, a better machine might make all of this guessing on my part totally moot. \n<br />\n<br />The version without mannequins runs perfect for me with or without a follower, except the follower still has a hard time getting in and out of the building.  My advice is that if you’re unsure how this might run on your machine, to try the ‘No Mannequins’ version (everything else in the mod are the same) and if it runs well, you can update to the regular file. Just remember to remove your stuff and save your game from somewhere else.\n<br />\n<br />The Barn Entrance—\n<br />\n<br />Because an occlusion cube is used inside the barn, a normal door could not be used; therefore the entrance is a couple of banners that you simple walk through. This is to hide what you wouldn’t see if the banners were not there. If you stood in the doorway without the banner, you would only see a couple of shield racks by the door and maybe a wall, the rest would be a blurry view of the distant landscape.  Once you step inside the cube, everything is suddenly rendered. You might experience about a second-long stutter as you enter the main room of the barn depending upon how fast your machine can render the contents. Exiting usually doesn’t cause this. \n<br />\n<br />As with everything that has to do with Skyrim, a little give-and-take is necessary.  I suggest you tweak your settings and mods in order to get the most rewarding experience. I don’t have any ENB installed and my mod list is modest, so your experience will differ.  Try the house out and see what works best for you.\n<br />\n<br />Conflicts –-\n<br />\n<br />The house does not make a lot of changes to Skyrim, so there shouldn’t be any conflicts unless there is another house that is built on the same spot. Other mods use Manilla Turtle’s Item Storage Mod -- eldiabs’ “Ranger Ridge” being the most notable -- which I have dl’d and ran with this mod with no problem, even though it uses the same script. Any reports are, of course, encouraged and welcomed. \n<br />\n<br />Light Switches---\n<br />\n<br />There are three light switches—one by the front door, one in the crafting area, and one in the barn—they are all activated by a pull-chain. The one by the front door works with the one in the crafting area to turn on or off the two lights in the main room of the house and alternately the three lights in the crafting area. So, if you want to do some smithing in the middle of the night, you simply pull the chain and the outside lights come on and the inside lights go off, pull again, and vice-versa. \n<br />The switch in the barn simply turns on three lights inside to add more light. It is not affected by any of the other switches.\n<br />Special Thanks to Norudo for the highly detailed walkthrough that made these lights possible.\n<br />\n<br />Storage and Auto-Sorting—\n<br />\n<br />First off, ALL CHESTS AND CONTAINERS AND URNS And BARRELS ARE SAFE TO USE—there are no respawning containers in Heartwood Cottage. This mod uses Manilla Turtle’s Automatic Item Storage modder’s resource. This is an exceptional mod and the creator has been quite kind to make it available for idiots like me to use.  The regular mod is quite nice too and adds containers to all of Skyrim’s player homes—check it out:\n<br />\n<br />http://skyrim.nexusmods.com/mods/12468\n<br />\n<br />In order for me to use this resource mod, I had to include it in my files as an .esm, which makes putting this on Steam impossible. It seems very stable and has a very small footprint in the archive. You will need to click on \"MTautostorage.esm\" (as well as HeartwoodCottage.esp) on your data screen at startup. Heartwood Cottage will not run without the autostorage mod. \n<br />\n<br />This is how I set up the storage in Heartwood:\n<br />\n<br />There is a main chest by the bed where you can store everything and it will sort your items into categories. Other chests, like the ones by the enchanting and alchemy tables can retrieve those items for your use.  If you would like to have more storage and sorting capabilities you can use many of the containers separately. For instance, there are scroll and spell tome containers on and next to the desk which you can store and sort each of these types of items. The same goes for the kitchen area, bookshelf, and crafting area. There are additional labeled containers for you to store even more items, but these work outside the auto-sorting mod. There is a chest for potions and poisons near the alchemy table that you can use if you wish.\n<br />Basically, if a container has the word ‘storage’ in its title then it is part of the auto-sort, if it just says: ‘poisons’ or such, then it is not. It is actually more complicated to explain than it is to use, and after a bit, you’ll see how it all works. Any questions can be left at the comment section and I’ll do my best to answer them. \n<br />\n<br />Dragons –-\n<br />\n<br />Yes, there will be the occasional dragon assaulting you and your home, but what they don’t realize is that I’ve set a trap for them.  I like to call it the ‘Dragon Kill-Zone’ and here’s how it works: there is a perch for them on the roof of the house, they will be uncontrollably drawn to it and when they land there, that is when you strike! Get to the balcony and use the ladder to get close enough to slice that huge reptile into nice, big, chunky steaks.  Yes, friends, we’re having dragon kabobs for dinner!\n<br />You can also head to the road to attack, and there’s a nice clearing toward the river. However you decide to do it, just remember one thing—don’t stay in the house! Dragons have no collision when flying and they’ll go through anything – trees, mountains, and even buildings.  So, take the fight to them or they’ll roast you alive in your very own living room.\n<br />\n<br />Monsters—\n<br />\n<br />The surrounding area around the house has a few vicious beasts lingering about and if you’re like me and play with the monster mod activated, then they are even more vicious…and they’ll respawn after a couple of weeks, so, yea, it’s a tough place to live, but I didn’t want to get rid of them, I did move them a little ways away from the house but not very much. A lowbie might consider that when travelling down the road to the house. \n<br />\n<br />Weather--\n<br />\n<br />It does not rain inside Heartwood Cottage unless you have a mod that changes the climate settings of Skyrim or force it to rain with console commands. Everything else (sounds of nature, music, wind sounds) have been kept the same as the vanilla climate. There are still cloudy, partly cloudy, foggy and clear days. I also added one extra weather effect, that being the skies of Sovngarde, which produce the multi-colored clouds and bright light that accompanies that area. It also includes raining stardust which does go through the ceiling of the house, but it is very, very cool looking. It is set to only happen rarely.\n<br />Falling leaves-- one aspect of the this forest location is the nice effect of the leaves falling, this is controlled by a large activator cube that covers large parts of the forest. I moved one a little from the house so that leaves wouldn't be seen falling through the ceiling. I didn't move it very far and you will still see leaves falling through the barn. You might also get a couple if standing outside and looking in, but none should fall once inside. I think this is a good compromise as it is one of the nicest effects in the game.\n<br />\n<br />+++++++++++++++++++++UPDATE NEWS++++++++++++++++++++++++++++++++++++\n<br />version v2:\n<br />+changed the override text on light switches so that there's no conflict with other pull chains. \n<br />\n<br />+Added invisible 'projectile collision barriers' so you can't shoot through windows and npc's can't do the same.\n<br />\n<br />+added light above guest quarters door\n<br />\n<br />+fixed the bug with the ingot urn where it wouldn't give back items\n<br />\n<br />+added new SECURITY SYSTEM -- a switch inside the house now raises or lowers two sets of portcullis covering the doors, keeping you nice and safe!\n<br />\n<br />Recommended Mods--------\n<br />\n<br />To utilize the bookshelves, I encourage you to download Da5id's great mod \"Unlimited Bookshelves,\" if you don’t already have it. It’s a simple script that changes everything concerning bookshelves and storage in the game. Place just about anything on the bookshelves (there’s only 2 at the moment in Heartwood) \n<br />You can download it here:\n<br />http://skyrim.nexusmods.com/downloads/file.php?id=10891.\n<br />*********\n<br />Mannequins are creepy little buggers, But you can fix their erratic behavior and strange poses with this great mod:\n<br />Vanilla Mannequin Script Fix - http://skyrim.nexusmods.com/downloads/file.php?id=10652\n<br />(may not be as necessary with new Skyrim 1.6 patch)\n<br />********\n<br />Trying to get your spouse to move into a little cottage in the woods can be a tough sell, especially if they've got plenty of high-society friends in Solitude or Windhelm. This mod will convince them to follow you anywhere! \n<br />Spouses Can Live Everywhere - http://skyrim.nexusmods.com/downloads/file.php?id=11370\n<br />\n<br />\n<br />My other Houses---\n<br />[url=https://flic.kr/p/23uaemC][img]https://farm5.staticflickr.com/4760/39700068904_bdb6cff5ca_b.jpg[/img][/url]\n<br />http://skyrim.nexusmods.com/mods/18112\n<br />[url=https://flic.kr/p/GrkNhj][img]https://farm5.staticflickr.com/4696/26541045938_7fe93c72ba_z.jpg[/img][/url]\n<br />http://skyrim.nexusmods.com/mods/17256\n<br />\n<br />********Special Thanks***********************************************************\n<br />\n<br />To Eldiabs for the Modders Resource-Weapon Racks-Bookshelves-Plaques-Mannequins--\n<br />http://skyrim.nexusmods.com/mods/11618\n<br />for saving me untold hours with this very handy resource. A modder's dream come true!\n<br />\n<br />To Norudo for the highly detailed walkthrough that made the light switches possible.\n<br />\n<br />To Manilla Turtle for allowing me to use his Automatic Item Storage modder’s resource.\n<br />To IsharaMeradin and IronErro for their highly detailed reports and help in making this mod better. \n<br />To all of those that have downloaded, commented, endorsed, given suggestions and ideas on how to make each of my mods better. Especially those on the 'Grey Ledge Manor' page -- this mod is the result of the many helpful discussions posted there. Cheers to you all!  \n<br />****************************************************************************************\n<br />Suggestions are always welcomed! If you take the time to scan the comment sections of my other houses, you’ll see that I try to implement what I consider to be great ideas, and some of the coolest parts of my mods have come from people willing to take the time to give their opinion and advice.  I hope you enjoy this place. It was quite a challenge but all in all, I’m pretty pleased with the result. Thank you!",
  "categoryId": "67",
  "version": "v2",
  "author": "wreznor",
  "createdUnix": "1342377128",
  "updatedUnix": "1343796654",
  "containsAdultContent": false,
  "uploadedBy": "wreznor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74800",
      "name": "HeartwoodCottageNM1_v1",
      "version": "v1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "336",
      "fileName": "HeartwoodCottageNM1_v1-20561-v1.7z",
      "uploadedUnix": "1342487031",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/4cca27e9accd75c9dfa383265a617dd32a503c21a27347925b861f9fbbd78c8b/analysis/1407027373/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HeartwoodCottageNM1_v1-20561-v1.7z?fid=74800&ttl=1535788764&ri=8192&rs=8192&setec=17947b25c144e2562cb8cbecf602097c"
    },
    {
      "fileId": "76299",
      "name": "HeartwoodCottage1_v1",
      "version": "v1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "322",
      "fileName": "HeartwoodCottage1_v1-20561-v1-1.7z",
      "uploadedUnix": "1343101194",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/bf70fd650239dfb96be1dc12a12f78947f71903cba4e4bb0995b6aab215839df/analysis/1407042486/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HeartwoodCottage1_v1-20561-v1-1.7z?fid=76299&ttl=1535788765&ri=8192&rs=8192&setec=b4e8cf4dde903e35a7d56eac7cb08ab6"
    },
    {
      "fileId": "76569",
      "name": "HeartwoodCottageNM1_v2",
      "version": "v2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "336",
      "fileName": "HeartwoodCottageNM1_v2-20561-v2.7z",
      "uploadedUnix": "1343226077",
      "modVersion": "v2",
      "virusScanUrl": "https://www.virustotal.com/file/0f8bc46a89e45299fcd8cde5404e6a756d17548eb2ccd20cb5388c5c8204a1d0/analysis/1407045303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HeartwoodCottageNM1_v2-20561-v2.7z?fid=76569&ttl=1535788766&ri=8192&rs=8192&setec=52ad2087340f58ee845bd067fe57b3a7"
    },
    {
      "fileId": "77998",
      "name": "HeartwoodCottage1_v2",
      "version": "v2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "323",
      "fileName": "HeartwoodCottage1_v2-20561-v2.7z",
      "uploadedUnix": "1343796654",
      "modVersion": "v2",
      "virusScanUrl": "https://www.virustotal.com/file/bb1af2b7d8e69126bf8fe49dcf6e7cbac8e269f1c917c8056d392290fbbd5b1b/analysis/1407061274/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HeartwoodCottage1_v2-20561-v2.7z?fid=77998&ttl=1535788766&ri=8192&rs=8192&setec=cccacc57e6d551959f83ce6e5434a1ae"
    }
  ]
}