{
  "modId": 20575.0,
  "modName": "Mountainside Castle",
  "summary": "A purchasable castle once you complete a minor side quest.",
  "descriptionHtml": "Mountainside Castle\r\n\r\nThis mod features a castle/keep which the player can own through a small sidequest (which you pick up through the Tavernkeeper in Mountainside Village.\r\n\r\nThis mod also contains:\r\n-Alchemy/Enchanting labs\r\n-Villagers/Guards/Servant NPC\\'s\r\n-Blacksmith area in the castle\r\n-Kitchen/bar inside the castle\r\n-plenty of display cases/mannequins to store and show off your collection\r\n-Library with man bookshelves, it starts out empty and it is your job to fill it up until your heart is content.\r\n-One single cell, which makes it very companion friendly for those who have the companion mod.\r\n-Crime faction, if you do bad things, the guards will act exactly like they would in any other town.\r\n\r\n---INSTALLATION---\r\n1. Either download manually or with the \\'Nexus Mod Manager\\'\r\n2. Place files in the appropriate place, usually \\'C:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\'\r\n3. If you are using NMM and cannot get the file to download, just download manually and then add the file to NMM manually by selecting the rar from wherever your downloaded files go.\r\n\r\n-Note-\r\nI should also mention that in order to gain access to the keep\\'s wings, you must pay 20,000 septims. I figured that would be a fair amount considering that you get less for purchasing the house in Solitude for the same price. If you want Servants/Guards in the keep you have to pay an additional 10,000, which would make a total of 30,000 with both purchases. There are some vendor NPC\\'s inside the keep, however they aren\\'t really necessary they are more an aesthetic feature than anything else.\r\n\r\n-Note#2-\r\nThis mod was already uploaded but because of the Navmesh fix by Bethesda I can now use just the esp file. And since I didn\\'t want everyone to get a negative view of this mod by downloading the updated version and losing all their stuff, I decided to re-upload it so that way people may look at the description to see the actual changes. \r\n\r\nso I repeat: IF YOU DOWNLOADED MY OTHER MOUNTAINSIDE CASTLE MOD, PLEASE REMOVE ALL YOUR ITEMS AND DELETE THE MOD BEFORE YOU DOWNLOAD THIS ONE.\r\n\r\nAlso I would like to thank miketheratguy for testing an earlier version to this mod, no quests were implemented during his testing though, so if there are any bugs that\\'s my bad lol.",
  "categoryId": "68",
  "version": "1.1",
  "author": "megabliss7116",
  "createdUnix": "1342393992",
  "updatedUnix": "1342394040",
  "containsAdultContent": false,
  "uploadedBy": "megabliss7116",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74570",
      "name": "MSCRemade",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "521",
      "fileName": "MSCRemade-20575-1-1.rar",
      "uploadedUnix": "1342394040",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/0bdc742fd5091a533e18f4b692ef1526e19b62bc30e08a98b2b34067efd37976/analysis/1407025265/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MSCRemade-20575-1-1.rar?fid=74570&ttl=1535788807&ri=8192&rs=8192&setec=53a30ecde7e95dfd4dd0f8d095ec4873"
    }
  ]
}