{
  "modId": 20588.0,
  "modName": "A Race Overhaul Project - Vanilla Edition and Dawnguard Edition",
  "summary": "Now with Vampire Lord support.",
  "descriptionHtml": "Altmer (High Elves):\r\nPowers:\r\n-Highborn-  Near unlimited Magicka for 60 seconds + 10 seconds every 10 player levels. (Once a day only)\r\n\r\nTraits:\r\n-Magical Tradition-  100 extra magicka.\r\n-Superior Breeding-  75% disease resistance.\r\n-Arcane Attunement-  25% weakness to frost, fire and shock, and 50% Magicka regeneration.\r\n-Master Race:  Your illusion, alteration, conjuration, destruction, restoration and enchanting skills increase 10% faster.\r\n\r\nBonuses:\r\n+10 Illusion\r\n+5 Destruction\r\n+5 Enchantment\r\n+5 Alteration\r\n+5 Conjuration\r\n+5 Restoration\r\n\r\nArgonians:\r\nPowers:\r\n-Histskin:  Heal and regenerate health for 60 seconds. Leveled +10 every 10 levels. (Once a day only)\r\n-Argonian Kiss:   Spit poison on your foes for 10 points of damage for 9 seconds.  The damage you deal increase as you level. (Power available only in alternate esp.)\r\n\r\nTraits\r\n-Heightened Metabolism:  15% health regeneration\r\n-People of the Root:  75% Poison and Disease resistance\r\n-Claws:  Argonians do 15 points of claw damage.  Plus 5 points of damage added every 5 levels.\r\n-Walk in Shadow:  You move 20% more quietly.\r\n-Mutagenic Adaptation: Your lockpicking, pickpocket, alchemy\\' light armor, alteration and illusion skills increase 10% faster.\r\n\r\nBonuses:\r\n+10 lock picking\r\n+5 sneak\r\n+5 alteration\r\n+5 illusion\r\n+5 one handed\r\n+5 alchemy\r\n\r\nThe Bosmer (Wood Elves):\r\nPowers:\r\nGreater:  \r\nCommand Mighty Beast:  Command animals and creatures level 18 and above.  (Once a day only.)\r\nCall of the Wilds:  Summon an animal familiar for 3 minutes.  The familiar will depend on your level.  (Once a day only.)\r\n\r\nThe Familiars you can summon are as follows:\r\nLevel 1-5:  Spirit Wolf\r\nLevel 5-10:  Spirit Saber Cat.\r\nLevel 10-20:  Spirit Frostbite Spider\r\nLevel 20-40:  Spirit Bear\r\nLevel 40-60:  Spirit Spriggan \r\nLevel 60-81:  Spirit Spriggan Matron\r\nBanish Familiar:  Banish familiars back to Aetherius\r\n\r\nLesser:  \r\nCommand Lesser Beast:  Command low level animals. \r\nEyes of the Hunter:  See creatures, daedra and dwarven automations through walls.\r\n\r\nTraits:\r\nMeric Heritage:  Your Magicka regenerates 25% more faster.\r\nChildren of the Forest:  50% Poison and Disease resistance.\r\nY’ffre’s Gift:  Your  archery, light armor, lockpicking, pickpocket, alchemy and sneak skills increase 10% faster.\r\nWalk in Shadow:  You move 20% more quietly.\r\n\r\nBonuses:\r\n+10 Archery\r\n+5 Sneak\r\n+5 Lockpicking\r\n+5 Pickpocket\r\n+5 Light Armor\r\n+5 Alchemy\r\n\r\nThe Bretons:\r\nPowers:\r\n-Comprehending the Atronach:   Absorb 50% of the magicka from hostile spells for 60 seconds, once per day plus 10 seconds every 10 player levels. (Once a day only)\r\n\r\nTraits:\r\n-Dragonskin: 50% damage reduction automatically when below 25% health.\r\n-Crossbreed: 10% Stamina regeneration and 20% magicka regeneration.\r\n-Ancestral Inheritance: 30% magicka resistance and 20% Spell absorption.\r\n-Aldmeri Heritage: 50% Magicka bonus.\r\n-Masters of the Arcane:  Your conjuration, illusion, restoration, speech, enchanting and alteration skills increase 10% faster.\r\n\r\nBonuses:\r\n+10 Conjuration\r\n+5 Illusion\r\n+5 Alteration\r\n+5 Enchanting\r\n+5 Restoration\r\n+5 Speech\r\n\r\n\r\nThe Dunmer (Dark Elves):\r\nPowers:\r\nAncestor Worship-   Summon a leveled ancestor from Aetherius. (Once a day only)\r\n\r\nThe summons all level up with you as you gain levels.  \r\n\r\nAlso every 10 levels you get the ability to summon a more powerful ancestor.\r\n\r\nHere is the hierarchy:\r\n\r\nLevels 1-10 Ancestral Ghost :  (A Regular every day Dunmer ghost in clothing with no spells and iron weapons including a bow. Presumably one of your less auspicious ancestors, that was a merchant or farmer.)\r\n\r\nLevels 10-21 Ancestral Warrior :  (A Dunmer in a regular armor set. Leather armor and steel weapons.  Weak level spells like flames, sparks, firebolt and lightning bolts. Presumably one of your tougher yet unknown ancestors.)\r\n\r\nLevels 21-30 Ancestral Guardian:   (A Dunmer in a set of glass armor, wields glass weapons and casts stronger spells.  Presumably an Ancestor that was accomplished and respected, yet forgotten throughout history.)  \r\n\r\nLevels 31-40 Ancestral Hero:  (In Ebony armor and weapons. Strong spells An ancestor who did much and is fondly remembered as a source of great pride and prestige in your house, whether or not you know of your ancestral lineage or not.)\r\n\r\nLevels 40-51 Mythical Ancestral Hero:   (A Dunmer in daedric armor, wields daedric longsword and casts master level spells.  An ancestor so powerful that they only answer the calls of those in their family with power to match their own. Little is known of them but their deeds in the early wars against the Dwemer and Nords in the far distant past guaranteed the success of many battles against their ancient foes. They are an ancient and powerful spirit capable of changing the course of any battle. As strong as Dremora Lords if not slightly more powerful.)\r\n\r\nLevels 51-80 Permanent Mythical Ancestral Hero \r\nAll summons last 3 minutes.  The permanent summons lasts indefinately.  \r\nBanish Ancestor Ghosts-   Banish Ancestor Ghosts back to Aetherius. (Once a day only)\r\nAncestor\\'s Wrath-   A Firestorm ability, that deals 50 fire damage plus 25 extra fire damage every 10 levels. By level 80 you\\'ll be doing a grand total of 250 damage. (Once a day only)\r\n\r\nTraits:\r\nMeric Heritage-   Because of your Aldmeri heritage, you regenerate magicka 25% faster.\r\nAshborn-  Resist fire 50%\r\nBlighted by Fate-  Resist disease 50%\r\nAzura’s Blessed:  Your Destruction, One Handed, Light Armor, Conjuration, Sneak and Illusion skills increase 10% faster.\r\nHarbinger of Destruction:  All Dunmer’s destruction spell costs are reduced by 30%\r\nWalk in Shadow:  You move 20% more quietly.\r\n\r\nBonuses:\r\n+10 destruction\r\n+5 one handed\r\n+5 light armor\r\n+5 conjuration\r\n+5 sneak\r\n+5 illusion\r\n\r\nImperials:\r\nPowers:\r\n-Voice of the Emperor:  Calms nearby people for 60 seconds once a day.\r\n-Commanders Voice:  Rally your allies with the power of your voice.  (Once a day only)\r\n-Intensive training:  Do more damage, and block more damage for 30 seconds.  (Once a day only)\r\n-Path to Victory:  Bribe guards for less gold, and buylow sell high with merchants for 30 seconds.  (Once a day only)\r\n\r\nTraits:\r\n-Imperial Luck:  Find more gold.\r\n-Human Endeavor:  25% Stamina regeneration.\r\n-Children of the Empire:  Your speech, destruction, restoration, one handed, block and heavy armor skills increase 10% faster.\r\n\r\n-Bonuses:\r\n+10 Speechcraft\r\n+5 Heavy Armor\r\n+5 Block\r\n+5 Restoration\r\n+5 One handed\r\n+5 Destruction\r\n\r\nThe Khajit:\r\nPowers:\r\n-Eye of Fear-   Paralyzes Humanoids in front of the player for 5 seconds up to level 10, plus 5 more seconds every 10 levels. (Once a day only)\r\n-Toggle Night Eye On-   You can see in the dark for unlimited time.\r\n-Toggle Night Eye Off-   Turn off night eye.\r\n\r\nTraits:\r\n-Claws-   20 bonus unarmed damage. plus 10 more damage every 5 levels.\r\n-Hunters Constitution-   10% health and stamina regeneration.\r\n-Walk in Shadow-  You move 20% more quietly.\r\n-Feline Grace-  Your sneak, lockpicking, pickpocket, alchemy, one handed and archery skills increase 10% faster.\r\n\r\nBonuses:\r\n+10 Sneak\r\n+5 Pickpocketing\r\n+5 Lockpicking\r\n+5 One Handed\r\n+5 Light Armor\r\n+5 Archery\r\n\r\n\r\nThe Nords:\r\nPowers:\r\nNordic Frost-   On touch Ice form that deals 25 damage for 10 seconds. Plus 10 every 10 player levels. (Once a day only)\r\nWarcry-   Rally Comrades while demoralizing enemies. (Once a day only)\r\n\r\nTraits:\r\nWinterkin-   50% frost resistance\r\nStormborn-   25% Shock Resistance\r\nHuman Endeavor-   25% stamina regeneration\r\nChosen of Talos-  Your two handed, one handed, block, smithing, speech and light armor skills increase 10% faster.\r\n\r\nBonuses:\r\n+10 two handed\r\n+5 light armor\r\n+5 speechcraft\r\n+5 smithing\r\n+5 one handed\r\n+5 block\r\n\r\n\r\nThe Orsimer (Orcs):\r\nPowers:\r\nBerserker Rage:   Double melee damage and 50% damage reduction for 60 seconds plus 5 more seconds every 10 levels. (Once a day only)\r\n\r\nTraits:\r\n-Malacath\\'s Beneficience:   Your Orcish blood allows you to carry 100 lbs more weight.\r\n-Cursed Heritage:   25% Magicka resistance\r\n-Outcast\\'s Might:   30 extra hitpoints and 20% Stamina regeneration\r\n-Malacath’s Faithful:  Your heavy Armor, smithing, one handed,\r\ntwo handed. block and archery skills increase 10% faster.\r\n\r\nBonuses:\r\n+10 Heavy armor\r\n+5 Two handed\r\n+5 Smithing\r\n+5 Block\r\n+5 Archery\r\n+5 One handed\r\n\r\n\r\nThe Redguards:\r\nPowers:\r\n-Adrenaline Rush-  50% bonus to melee damage and near unlimited stamina for 60 seconds + 10 seconds every 10 levels. (Once a day only)\r\n-Sword Singer-   You can form a \\\"Shehai\\\" (sword) from your own spirit.  As you progress in levels you are able to make it more powerful, and make it last longer. Once you reach level 50, you will be able to keep it permanantly. Just sheathe the blade to get rid of it. (Power available only in alternate esp.)\r\n\r\nTraits:\r\n-Distinct Blood-  50% Poison and Disease resistance\r\n-Ra\\'Gada\\'s Perserverance-  30% Stamina regeneration\r\nYokudan Heritage- Your one handed, archery, block, smithing, light armor and sneak skills increase 10% faster.\r\n\r\nBonuses:\r\n+10 One handed\r\n+5 Archery\r\n+5 Block\r\n+5 Smithing\r\n+5 Light Armor\r\n+5 Sneak\r\n\r\nv1.0: Initial Release\r\nv1.1: Added Argonian mod, and fixed a mistake with the Khajit Eye of Fear.\r\nv1.2: Gave Argonians the ability to do claw damage. Revamped the Ancestor Ghosts, they should be more deadly now.  Added spells to Mythical Ancestral Hero. Renamed Banish Summons to Banish Ancestor Ghosts; and turned it into a greater power, can now banish all Ancestor Ghosts. Made Redguards summon a permanant sword after level 50.  Just sheathe blade to dispel.  Fixed Breton\\'s \\'Comprehending the Atronach\\' power.  Should now work as was meant to.\r\nv1.3: Added Mounted Combat Support\r\nv1.4: Added the Bosmer and Imperials, also updated previous mods.\r\n\r\n",
  "categoryId": "24",
  "version": "v1.5",
  "author": "Talyn82",
  "createdUnix": "1342419095",
  "updatedUnix": "1436046184",
  "containsAdultContent": false,
  "uploadedBy": "Talyn82",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98058",
      "name": "A Race Overhaul Project- Dawnguard Edition",
      "version": "v1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "71",
      "fileName": "A Race Overhaul Project- Dawnguard Compatibel-20588-v1-5.7z",
      "uploadedUnix": "1352353209",
      "modVersion": "v1.5",
      "virusScanUrl": "https://www.virustotal.com/file/a0c21d32de4e7f878867d9fd4d14d929f055a8a1c8518ec2ee57216fd848c537/analysis/1407253866/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Race%20Overhaul%20Project-%20Dawnguard%20Compatibel-20588-v1-5.7z?fid=98058&ttl=1535788821&ri=8192&rs=8192&setec=62c58da497807e69d4d43d5d860002c4"
    },
    {
      "fileId": "98061",
      "name": "A Race Overhaul Project- Vanilla Edition",
      "version": "v1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "63",
      "fileName": "A Race Overhaul Project- Vanilla Edition-20588-v1-4.7z",
      "uploadedUnix": "1352353666",
      "modVersion": "v1.4",
      "virusScanUrl": "https://www.virustotal.com/file/1a58752325afa365c98640bf66d385451a1ebd345dc03636228c73b646a0f0c0/analysis/1407253867/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Race%20Overhaul%20Project-%20Vanilla%20Edition-20588-v1-4.7z?fid=98061&ttl=1535788821&ri=8192&rs=8192&setec=c326bce76e226abd481222335859f77b"
    },
    {
      "fileId": "1000035992",
      "name": "AROP- Breton Edition Fix",
      "version": "v1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "AROP- Breton Edition Fix-20588-v1-6.7z",
      "uploadedUnix": "1372310519",
      "modVersion": "v1.6",
      "virusScanUrl": "https://www.virustotal.com/file/346704513ab08abb788cd1685e5d5c6417627ac8bff03c69a473f1d8061f7fe0/analysis/1407618606/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AROP-%20Breton%20Edition%20Fix-20588-v1-6.7z?fid=1000035992&ttl=1535788822&ri=8192&rs=8192&setec=743dcd1d25b634139829a9983e4ea70b"
    },
    {
      "fileId": "1000166631",
      "name": "AROP-Dunmer Edition Fix",
      "version": "Fix",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "AROP-Dunmer Edition Fix-20588-Fix.rar",
      "uploadedUnix": "1436046184",
      "modVersion": "Fix",
      "virusScanUrl": "https://www.virustotal.com/file/96c1ca3cef481a570863c3947c525b539790881e9fdd841b8b423aaba77bb772/analysis/1436046243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AROP-Dunmer%20Edition%20Fix-20588-Fix.rar?fid=1000166631&ttl=1535788822&ri=8192&rs=8192&setec=030cf83981e2fd392c03da0588c49b24"
    }
  ]
}