{
  "modId": 20583.0,
  "modName": "Scrollcraft",
  "summary": "Adds lore-friendly craftable scrolls into Skyrim - many of them new",
  "descriptionHtml": "Update Log\r\n==========\r\n1.11 - Fixed enchanting exploit\r\n1.1 - Crafting scrolls no longer requires tanning racks - scrollcrafting stations can be found in each of the 5 major holds alongside the court wizards alchemy and enchanting benches.\r\n1.02 - Missing scroll models on several spells as reported (thanks Hupfstrudel)\r\n1.01 - Apprentice Magic Perks to accurately reflect their relation to scroll crafting\r\n\r\nWhat is it ?\r\n========\r\nEssentially adds lore-friendly craftable scrolls into Skyrim. There are similar mods out there but none that filled the gameplay niche I wanted. \r\n\r\nScroll crafting is done at scrollcrafting stations found in each of the 5 major holds alongisde the court wizards\\' alchemy and enchanting benches - in order to craft a scroll you must (a) have the equivalent spell already learned (b) have the matching Apprentice (25) perk for the school of Magic (c) have the required materials.\r\n\r\nThe two materials required to craft scrolls are (1) Rolls of Paper and (2) Silverdust. Silverdust can be smelted from Silver ore (15) or Silver Ingots (30). It can also be purchased (alongside increased numbers of Rolls of Paper) from Alchemists, Mages and Trade Caravans throughout Skyrim.\r\n\r\nNew Scrolls\r\n=========\r\nBecause Skyrim did not ship with the Scroll equivalents to many of the spells in game, I have created matching scrolls to fill much of the void. I have not created scrolls for the low level concentration spells (frostbite, flames, sparks) or several of the rare spells (summons mostly). All players can create scrolls of Blood Magic initially - these scrolls exchange a small amount of health for mana (similar to equilibrium). \r\n\r\nSeveral Concentration spells, specifically Wards and Walls have been given a duration instead (the scroll version, the spells proper remain untouched). \r\n\r\nAdditionally the overall value of Scrolls has been decreased across the board to limit gold exploits - but a decent profit can still be made using more powerful spells. Its your singleplayer experience, play and abuse as you see fit :)\r\n\r\nFinally, if you\\'re still with me - any new characters can benefit from some starting materials and a how-to book (with an enchanting skill boost) just outside the Helgen dungeon on the corpse of an unfortunate mage named Sten.\r\n\r\nFuture Plans\r\n===========\r\nCustom model for the scroll crafting stations and stations in more locations, including player homes. Want a smaller footprint on the workstation model before jumping into this one though.\r\n\r\nClosing Comments\r\n===============\r\nLeave comments and report bugs as you like, I will strive to get on top of any troubles as quickly as possible. That being said conflicts will exist with any mod changing (not adding) scrolls or modifying apprentice level magic perks. Thanks and have fun crafting!",
  "categoryId": "75",
  "version": "1.1",
  "author": "Corsair101",
  "createdUnix": "1342401718",
  "updatedUnix": "1342573308",
  "containsAdultContent": false,
  "uploadedBy": "Corsair101",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74994",
      "name": "Scrollcraft",
      "version": "1.11",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "88",
      "fileName": "Scrollcraft-20583-1-11.rar",
      "uploadedUnix": "1342573308",
      "modVersion": "1.11",
      "virusScanUrl": "https://www.virustotal.com/file/54a61bfdec0dbe9a5c995745ee1a9e8f8aad05d84be6db05adc3c492e62de781/analysis/1407029944/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Scrollcraft-20583-1-11.rar?fid=74994&ttl=1535788816&ri=8192&rs=8192&setec=1881ab3eaee83aa1580d39ce3e6c7b34"
    }
  ]
}