{
  "modId": 20586.0,
  "modName": "Craftable Clothes and Robes",
  "summary": "A mod that adds the ability to craft all kinds of clothes and statless robes - perfect for mage\\'s, or anyone who wants to look stylish!",
  "descriptionHtml": "Ever think that the tanning rack is pretty lame? I mean, you can only make two things at it. It almost seems pointless.\r\n\r\nIn addition, mages have always been ripped off. They can\\'t be stylish AND powerful. They\\'re stuck with whatever robes are the best, while a high-level warrior can just smith himself armor beyond the defense cap.\r\n\r\nThis mod aims to change both of those things. It makes just about every article of clothing craftable at the tanning rack, including a few of the unplayable outfits in the game. All clothing and robes crafted are statless, and can be enchanted as one wishes, making them ideal for any mage. Most clothes can be crafted right away, but many of the outfits must be unlocked by accomplishing different quests in the game.\r\n\r\nFeatures:\r\n- Craftable clothing from throughout Skyrim at the tanning rack\r\n- Craftable, unenchanted robes\r\n- Previously unplayable robes now playable\r\n- \\'Leather\\' and \\'Leather Strips\\' materials moved to the \\\"Leather\\\" category on the tanning rack for convenient access\r\n\r\nAll clothes can be crafted under the \\\"misc\\\" category. Many outfits also require special ingredients, mainly robes.\r\n\r\nUnlockable robes include:\r\nWinterhold College robes - Unlocked by joining Winterhold College\r\nShrouded Robes - Unlocked by completing the \\\"Sactuary\\\" quest\r\nRedguard Clothes - Unlocked by completing the \\\"Sanctuary\\\" quest\r\nMythic Dawn robes - Unlocked by completing \\\"Pieces of the Past\\\"\r\nVaermina robes - Unlocked by beating the \\\"Waking Nightmare\\\" quest\r\nJester Clothes - Unlocked by completing \\\"The Cure For Madness\\\" quest\r\nThalmor Robes - Unlocked by completing the \\\"Diplomatic Immunity\\\" quest\r\nJarl clothes - Unlocked by beating either side of the Civil War quests\r\nPsijic robes - Unlocked by completing the Winterhold College quest chain\r\nArchmage\\'s Robes - Unlocked by completing the Winterhold College quest chain\r\nGreybeard Robes - Unlocked by beating the main quest chain\r\n\r\nPlease feel free to report any bugs and leave any suggestions.\r\n\r\n-------------------------------------------------------------------------------\r\nUpdate 6: Fixed Archmage hood showing up as robes in the menu, made the head bandage enchantable, fixed hoods counting as body clothing, thus making them use body enchantments, fixed a problem where the Apprentice hood was using the wrong mesh, added roughspun tunic, trousers, and footwraps to crafting list \r\n\r\nUpdate 5: Brown hood now shows up as a hood in the menu. Mystic Tuning Gloves added due to popular demand, unlocked by completing the &quot;Out of Balance&quot; quest. Arm bandages are now enchantable. Green hood enchants like a head piece, rather than a body piece. \r\n\r\nUpdate 4: Fixed a bug where the Greybeard\\'s robes did not count as body clothing, thus leading NPCs to comment on your lack of clothes.\r\n\r\nUpdate 3: Added Tavern Clothes.\r\n\r\nUpdate 2: Added Archmage\\'s Robes.\r\n\r\nUpdate 1: Fixed an issue that made it so the Shrouded robes were not enchantable.",
  "categoryId": "60",
  "version": "1.4",
  "author": "squidgy617",
  "createdUnix": "1342407691",
  "updatedUnix": "1378069085",
  "containsAdultContent": false,
  "uploadedBy": "squidgy617",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000051539",
      "name": "Craftable Clothes and Robes Latest Version",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "156",
      "fileName": "Craftable Clothes and Robes Latest Version-20586-1-4.zip",
      "uploadedUnix": "1378069085",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/ec7f7a6cff330a642be0657c07fe04305711e429863be6478b73b95b26c8f1fd/analysis/1407705424/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20Clothes%20and%20Robes%20Latest%20Version-20586-1-4.zip?fid=1000051539&ttl=1535788819&ri=8192&rs=8192&setec=ab269f8dd892e84347542ba985ff46f1"
    }
  ]
}