{
  "modId": 20597.0,
  "modName": "Table Salt to Cook Food",
  "summary": "Food recipes will now require Table Salt instead of Salt Pile to make. Table Salt is cheaper and more widely available than Salt Pile.",
  "descriptionHtml": "Salt is something that\\'s easy to make right? Alright maybe not that easy but still available in large quantities right? Then why is it so scarce in Skyrim? So, I created a new item-Table Salt for all your cooking. \r\n\r\nAlchemy will still require Salt Pile as usual but cooking recipes like Rabbit Haunch for example will now require Table Salt. So, now there will be 2 kinds of salt-one for cooking and one for alchemy.\r\n\r\nTable Salt will be available in most general goods stores like Belethor in Whiterun and Inns like The Bannered Mare. You won\\'t find it in places that specialize in Armor or Alchemy though because Table Salt has nothing to do with magic and combat-it\\'s just your regular salt you find in most kitchens. It\\'s also available randomly in wilderness but quit rare, so, if you really need it you can find it abundantly in stores. Table Salt is pretty cheap-only 1 or 2 gold depending on inflation.\r\n\r\nI have also replaced Salt Pile by Mysterious Salt. So, now instead of seeing Salt Pile, you will see Mysterious Salt-don\\'t go on panicking when you don\\'t find Salt Piles anywhere now! Mysterious Salt is a better name for alchemy IMO because you know...a salt that can\\'t cook food is a little mysterious.\r\n\r\nSo to summarize, now you should be able to use Table Salt to cook food and Mysterious Salt in your alchemy recipes. Keep in mind that Table Salt can\\'t be used with alchemy recipes! I can\\'t stop repeating that...\r\n\r\nNOTES: \r\n1. Although it\\'s a fairly small mod, do let me know if you find any bugs.\r\n2. The mod won\\'t work for 3rd party recipes you\\'ve added via other mods. Hit me up and I\\'ll see if I can provide support for these recipes as well.\r\n3. If you\\'ve added Alchemy recipes via mods, the Mysterious Salt WILL work because Salt Pile has been replaced globally, so, no need to worry.\r\n\r\n####Version 1.1 Release Notes####\r\n1. Table Salt is now available abundantly in Markarth.\r\n\r\n\\\\\\\\OLD Version 1.0b Release Notes\r\n1. Table Salt only available in Whiterun and Riverwood at their respective General stores and Inns. I just bought Skyrim 3 days ago, so, I haven\\'t had time to explore all settlements to decide where to provide Table Salt. I\\'ll fix this gradually as I play the game, though I will gladly accept help from the community. Post in the comments and tell me where the generals goods stores and inns are located.\r\n\r\n###Issues###\r\n\r\nNone so far.",
  "categoryId": "94",
  "version": "1.1",
  "author": "jlocohustler",
  "createdUnix": "1342434571",
  "updatedUnix": "1342574423",
  "containsAdultContent": false,
  "uploadedBy": "jlocohustler",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74661",
      "name": "TableSaltv10b",
      "version": "1.0b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "TableSaltv10b-20597-1-0b.zip",
      "uploadedUnix": "1342434724",
      "modVersion": "1.0b",
      "virusScanUrl": "https://www.virustotal.com/file/84b78995576339cd05da8e1f1dda407c0602cb9af638ae848db5157c4c981796/analysis/1407025936/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TableSaltv10b-20597-1-0b.zip?fid=74661&ttl=1535788832&ri=8192&rs=8192&setec=b6333c3e0e7dc9115c010fc2b2d5bcb3"
    },
    {
      "fileId": "74999",
      "name": "TableSalt11",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "TableSalt11-20597-1-1.zip",
      "uploadedUnix": "1342574423",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/633ead3e280535238b7d7112b0ba93df0f1d88cb2c905e5d48de284b904f3c07/analysis/1407030004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TableSalt11-20597-1-1.zip?fid=74999&ttl=1535788833&ri=8192&rs=8192&setec=46da40253796301ac64c8353724d0126"
    }
  ]
}