{
  "modId": 20636.0,
  "modName": "WhirlWind Sprint Redone",
  "summary": "Finally, A WhirlWind Sprint mod that you can  actually knock people down with!",
  "descriptionHtml": "[IMG]http://img.photobucket.com/albums/v738/bl3azy/WhirlWindAlt.jpg[/IMG]\r\n\r\n[EMBED]http://www.youtube.com/watch?v=kbHx18TPDJQ&feature=player_embedded[/EMBED]\r\n\r\n     So I remember playing through the game up to the point you get the whirl wind sprint and played around with it for a while and thought, wouldn\\'t it be cool if you could actually knock people down with it? So I looked all around the internets and found NOTHING. \r\n\r\n     I remember downloading CK thinking \\\"BADASS\\\" I\\'m gonna make a whirlwind Sprint mod! Jumped in CK thinkin like I was BOSS, only to find out that whirlwind sprint out of all the Thu\\'um\\'s, was the most difficult to change.... So I tried EVERYTHING and nothing seemed to work like how I wanted it to. Untill now, many months later, all the tweaking, bleeding, sweating, and tears (ok maybe no bleeding) here it finally is. \r\n\r\n\r\n     Just the begining, I modified the first part of WhirlWInd Sprint (Kest) to knock down enemies in your path, NO LONGER will you have to deal with the immersion shattering halt when you run into someone in your path. I have plans to alter the rest of WhirlWind Sprint, each slightly different in magnitude and effect you have on the enemy. \r\n\r\nTo Install\r\n==========\r\nUnzip and drag and drop the data folder into your main skyrim folder incase your new to this. There is the NMM Route also.\r\n\r\nVIDEOS AND PICTURES coming soon. Its kind of hard to capture just how cool this mod actually is in pictures it turns out.  And please, feel free to add video\\'s of your own of my mod in action.\r\n\r\nComment, ENDORSE, vote, if you like this mod, I would love to hear you input. DOWNLOAD ALREADY!",
  "categoryId": "93",
  "version": "0.1",
  "author": "bl3azy",
  "createdUnix": "1342494086",
  "updatedUnix": "1342494198",
  "containsAdultContent": false,
  "uploadedBy": "bl3azy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74821",
      "name": "Whirl Wind Sprint ReDone",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Whirl Wind Sprint ReDone-20636-0-1.zip",
      "uploadedUnix": "1342494198",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/b6062e9c9b1449c000f48708d6280d73aa0bc7cbaf17fdc3d1c68c5d134f6afa/analysis/1407027542/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whirl%20Wind%20Sprint%20ReDone-20636-0-1.zip?fid=74821&ttl=1535788905&ri=8192&rs=8192&setec=0d6d371384fe07d62bd057915c25adde"
    }
  ]
}