{
  "modId": 20637.0,
  "modName": "ULTIMATE Alchemy",
  "summary": "Ultimate Alchemy is the definative way to play an alchemist in Skyrim!  No longer a boring dump skill......Be an Alchemist, have fun, and kick some butt with your extensive knowlede of potions and poisons!",
  "descriptionHtml": "IF YOU PLAY THIS AND LIKE IT (you will) ENDORSE SO OTHERS CAN ENJOY IT TOO!!\r\n______________________________________________________________________________\r\n\r\nRequirement: \r\nRadiant and Unique Potions and Poisons HD glowing version\r\nhttp://skyrim.nexusmods.com/mods/18799\r\n\r\nYou only need the textures and meshes....not his esp file.  If you already have it thats fine, but it\\'s redundant as I have his mod changes merged into this mod. Ultimate Alchemy includes a few of his files already so just overwrite....the files are identical.\r\n\r\nIf you prefer his non-glowing version then copy his meshes and texture files AFTER this and overwrite everything.  This simply overwrites the glowing files contained in this mod with his non glowing ones.  \r\nI personally prefer the glowing and as you can see in the pictures your not staring into the sun and the glow is very faint and attractive.\r\n______________________________________________________________________________\r\n\r\nA long time in the making. A labor of love by shamurai77, with new potion bottles by exray catt, new insects by 83Willow, and new fish by Blitz54. Original concept from FOEnthusiast.\r\n\r\nULTIMATE ALCHEMY!\r\n THE definative way to play an alchemist in Skyrim!  No longer a boring dump skill......Be an Alchemist. Have fun! Kick some butt with your extensive knowlede of potions and poisons!\r\n\r\nEnjoy classic favorites such as: Mute, Exhaust, Alchemist fire, frost, and spark..... Use a volatile poison that mute\\'s an enemy mage, or exhausts a warrior! Use stimulants to give yourself powerful boosts for a time! Roughly 30 recipes to learn as you gain perks in the alchemy tree.\r\n\r\nI put a lot of work into making this as balanced and lore friendly as possible. The effects are powerfull and scale slightly better than most things due to the effects being for a limited time or single use.  Use your potions when you need them because you don\\'t want to need one and not have it!\r\n----------------------------------------------------------------------------------\r\nWHAT IT DOES:\r\n\r\n    You have to find in the world, or craft in the misc section of the forge your 2 new PORTABLE workbenches....I placed some specifically on the alchemy table in riverwoods tavern, and the alchemy shop in whiterun. To use a portable workbench click it in your inventory then simply exit your inventory. If they are in your inventory they will no longer show in the forge menu.\r\n\r\nThe Alchemy Essence Extractor-- Extract helpful compounds from ingredients or potions.(including raw leeks)\r\n\r\nThe Alchemy Poison Diffuser-- Extract harmful compounds from ingredients or poisons. (including frost spider venom and gourds!)\r\n\r\nCompounds--  Powders, fluids, or crystals you combine at the Alchemy Lab to make potions.\r\nMore powerful potions and rare ingredients tend to yield more compound. Compounds are useless themselves unless made into potions or poisons at the Alchemy Lab. You will see requirements for potions similar to crafting requirements at the smithing forge.\r\n\r\nYour Alchemy Lab at first has very few recipes available... merely a heal potion and a damage poison. Commit with your first perk to learn all ingredient effects and expand your recipe repertoire!\r\n\r\nYour second perk \\'physician\\' gives you recipes to fortify your class. Yes your CLASS!....how are you playing the game?  Are you an illusionist? an assassin? a merchant? a ranger or barbarian? \r\nThe physician perk has potions that are tailored for you!\r\n\r\nThen choose a path in the perk tree. One for potions, one for poisons. Later the paths merge to \\'experimenter\\' perks where you learn more utilitarian recipes. Your final reward for the \\'Purity\\' perk unlocks the ultimate recipes for Haste, Doom, and Elixer! These take a lot of compounds and alchemical knowledge to produce but the effects of one of these potions will change the outcome of a battle dramatically!\r\n\r\nYou will find that alchemy takes some work and ingredient gathering, but it is very rewarding! The leveling now is comparable to other skills...You can level it up yourself and not have to depend on expensive skill trainers or outright cheating. You can ignore a weapon perk tree and focus on alchemy as your source of damage!\r\nIf you don\\'t want to fuss with alchemy perks but want to try a sample buy recipes kits from alchemists...consume the recipe kit at the Alchemy lab to make a potion similar to how scrolls give limited access to spells normally out of your ability level.\r\n\r\nFor balance reasons I removed the enchantment/alchemy infinate power loophole. Alchemy bonuses to enchanting and smithing are now capped (to 25% and 50% respectively) If you like infinate power loopholes then play on easy mode to feel godlike, or download a bow mod that does 9999 damage. This mod is balanced to fit in vanilla.\r\n \r\nThe file size is due to textures for all new potions, compounds, dozens of new ingredients, and ingredient-creatures (fish and insects.) \r\n\r\nWill this drop your framerate?  Not a chance. Unless your running it on your Iphone.\r\n\r\nWill this conflict with other mods? Nope....unless your using another mod that effects alchemy.  This is a DEFINATIVE alchemy mod...it covers all aspects of it down to the nitty gritty. Don\\'t put another alchemy mod on top of this one and expect them to jive. If you post a comment below about compatibility and you just installed \\'Dumbledorf\\'s alchemy accident mod\\' after I wrote this then I will slap your mom in the face....\r\nIf there is an awesome alchemy related mod I should incorporate then let me know and i\\'ll consider adding it.\r\n----------------------------------------------------------------------------------\r\nInstallation: Drop the files in Skyrim/Data folder, check the boxes in mod load order.. you know the drill I hope.\r\nYou can use this on any save that has not invested in the alchemy perk tree yet.  Vanilla alchemy blows so I doubt you did anyway.\r\n----------------------------------\r\n.\r\n.\r\n.\r\nREAD CAREFULLY:\r\n...you DONT NEED the following 2 mods as I had to incorporate aspects of them for them to function. They are included already. HOWEVER if you already have them thats fine just load ULTIMATE ALCHEMY\\'s esp AFTER them or delete their esp\\'s. You can safely overwrite anything from these as the textures are exact duplicates.\r\n\r\n83Willows 101BugsHD!!\r\nhttp://skyrim.nexusmods.com/mods/4955\r\n.\r\n.\r\nImproved Fish - New Fish - More Spawning!!\r\nhttp://skyrim.nexusmods.com/mods/14320",
  "categoryId": "94",
  "version": "1",
  "author": "shamurai77",
  "createdUnix": "1342495809",
  "updatedUnix": "1342496451",
  "containsAdultContent": false,
  "uploadedBy": "shamurai77",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74823",
      "name": "Ultimate Alchemy v1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "59915",
      "fileName": "Ultimate Alchemy v1-20637-1.rar",
      "uploadedUnix": "1342496451",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/d6c72668e479dd2b807e4a2ff1ed3f4d7d226c1a5d177f1a961f55d78c9b406c/analysis/1407027618/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ultimate%20Alchemy%20v1-20637-1.rar?fid=74823&ttl=1535788907&ri=8192&rs=8192&setec=777f4a2340ffc5478fef8bde4d563ba6"
    }
  ]
}