{
  "modId": 20641.0,
  "modName": "Saviors Lodge - Player Home",
  "summary": "Saviors Lodge - The ultimate private home for any Dragonborn. Adds 1 new quest, and is equipped with everything you could possibly need, including a full blacksmith room, windmill, pool, farm, kitchen, bedroom, alchemy and enchanting room, 12 mannequins, secret vault and much much more. ",
  "descriptionHtml": "[IMG]http://i46.tinypic.com/6h2m9t.png[/IMG]\r\n\r\n[size=1]Created by me, Falloutperson416, graphics made by my good friend MRCartm0n[/size]\r\n\r\n[size=3][IMG]http://i52.tinypic.com/2h2p6ra.png[/IMG] Please endorse! [IMG]http://i52.tinypic.com/2h2p6ra.png[/IMG] It only takes a second.[/size]\r\n\r\n[color=#FFFF00][b] - EmperorDude1990[/b][/color]\r\n\r\n[i]I can\\'t tell you how many times I\\'ve come across a wonderful castle, mansion or other abode, only for my Stormcloak Nord berserker to find himself surrounded by Imperial banners and other symbols. Your implementation of a faction alignment and decoration system makes you a modding god as far as I\\'m concerned.[/i]\r\n\r\n[color=#FFFF00][b] - Sokkvabekk[/b][/color]\r\n\r\n[i]I have been looking for a house for so long, I think this is finally the one! I\\'ve always been searching by highest downloads and decided to check out the newer stuff today, was apparently a really good decision! I like to keep a lot of people in my house, but I like a place that\\'s believable and with no unnecessary load screens, this is fantastic![/i]\r\n\r\n[color=#FFFF00][b] - viruk_epa[/b][/color]\r\n\r\n[i]Endorsed, love the house, exactly what I was looking for.[/i]\r\n\r\n[color=#FFFF00][b] - TheUrbanTimberWolf[/b][/color]\r\n\r\n[i]I\\'ve been house hunting for a house mod in the winter category and It looks like yours takes the cake, plus, No loading screens! Cheers to you, and I hope to see more if your work in the future.[/i]\r\n\r\n[color=#FFFF00][b] - Cattley[/b][/color]\r\n\r\n[i]I am truly disappointed... I mean, why aren\\'t there hundreds of vloggers making a show case out of this home. It is truly spectacular. I love every single part of it. It\\'s simply the best.[/i]\r\n\r\n[IMG]http://i49.tinypic.com/w758w.png[/IMG]\r\n\r\n[b][i]Saviors Lodge[/i][/b] is an enormous, highly detailed and thoroughly developed island home.  It is indeed the [b]ultimate[/b] private home for any Dragonborn. To obtain the Lodge, you\\'ll need to complete a small quest first. Talk to a boy named Adney in Solitude, he may need your help (Fast traveling to Solitude is the easiest way to reach him) Equipped with everything you could possibly need, including a mannequin room, pool, teleportation room, library, full blacksmith room, weapon display room, alchemy/enchanting room, secret vault, archery practice room, shrine room, bathroom, bedroom, configuration room, followers room, kitchen, basement, attic, farm, animals, windmill, ores veins, and more. Nothing has been left out. The functionality of an entire city all within a private island that YOU own. For those who have that special someone already living in another home, ask them about moving to your new [i]private island[/i]. Someones getting laid tonight. If you don\\'t have a spouse, your new dog Dragonbark is always there to keep you company. Even your prized horse will chill on the island until you\\'re ready to roll. Not convinced enough? Download Saviors Lodge now and see this mod live up to its description.\r\n\r\n[youtube]ROjLPNg4GHI[/youtube]\r\n\r\n[IMG]http://i50.tinypic.com/2z99tmg.jpg[/IMG]\r\n[size=1]Your little slice of heaven.[/size]\r\n\r\n [IMG]http://i46.tinypic.com/243ffvd.png[/IMG]\r\n\r\n[B][color=#0FF000]Current Version:[/color] V1.5[/B] Status: Completed\r\n\r\n5th version:\r\n - Adds Saviors Steed (New horse)\r\n - Added College faction to faction feature\r\n - Quest with voiced NPC to obtain the Lodge\r\n - NPC bartender\r\n - NPC chef\r\n - New room: Library\r\n - New room: Bathroom\r\n - Pimped out the Pool \r\n - Pimped out the Kitchen\r\n - Fixed a few minor bugs\r\n - A bit of new clutter here and there\r\n - Added a bridge to the Island\r\n - Added more lanterns\r\n\r\n[b]Known bugs:[/b]\r\nIf you cancel out of the first set of dialog with the boy, you\\'ll have to reload a previous save and do it again.\r\nThe boy won\\'t talk while the execution in Solitude is going down.\r\n\r\n[B][color=#FF0000]Old Versions:[/color] V1.4. V1.3, V1.2, V1[/B] \r\n\r\n4th version:\r\n - New Room(s): Pool, Control Room, Teleportation Room\r\n - Added a faction choice, which sets up certain faction related items around the house (Banners, flags etc.)\r\n - Added scripted button to enable/disable dragonbark\r\n - Lots of awesome stuff\r\n - New room: Pool\r\n - New room: Teleportation Room\r\n - New room: Configuration Room\r\n3rd version:\r\n - New room: Shrines\r\n - Lighting adjustments\r\n - 2 more mannequins, total of 10 apposed 8\r\n - Bug Fixes\r\n - New room: Attic\r\n - New Furniture/Clutter\r\n - Interior/Exterior changes\r\n2nd version:\r\n - Minor changes to the exterior\r\n - Added Lumber Mill\r\n - Added Followers Room\r\n - Fixed bugs\r\n - Minor changes to the interior\r\n1st Version:\r\n - Saviors Lodge in its entirety\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n[b]Manual Installation[/b]\r\n\r\nInstallation video in Video\\'s tab!\r\n\r\nTo manually install, simply drag the contents of the 7zip folder into Skyrim\\'s Data folder. If you already have an existing texture folder, sound folder, and script folder, merge the ones in the 7zip with the ones you already have. Make sure you activate the mod in the Skyrim Launcher (Data Files/Saviors Lodge)\r\n\r\n[b]Automatic Installation[/b]\r\n\r\nTo automatically install, download the NMM file, and install using NMM. Script files may require a manual installation, not entirely sure.\r\n\r\n[b]Load Order[/b]\r\n\r\nAlthough this mod doesn\\'t require a particular load order to function properly, I recommend that it be placed at the bottom of your load order.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n[b]F.A.Q.[/b]\r\n\r\n[size=\\\"5\\\"]1.[b][Q][/b][/size] Saviors Steed is giving me a weird message when I try to ride her... \r\n[size=\\\"5\\\"][b][A][/b][/size] If this happens to you, you\\'ll need to remove a certain script from your script folder. Locate IHSaviorsSteedScript.pex and delete it.\r\n\r\n[size=\\\"5\\\"]2.[b][Q][/b][/size] Buttons aren\\'t working, quest isn\\'t working.. HELP MEEE!  \r\n[size=\\\"5\\\"][b][A][/b][/size] You haven\\'t installed the scripts correctly :)\r\n\r\n[size=\\\"5\\\"]3.[b][Q][/b][/size] My house doesn\\'t look like the one in the images D8\r\n[size=\\\"5\\\"][b][A][/b][/size] Sexy Solitude and Sexy Windhelm were active while the images where taken.\r\n\r\n[size=\\\"5\\\"]4.[b][Q][/b][/size] The boy for the quest has absolutely nothing to say to me...\r\n[size=\\\"5\\\"][b][A][/b][/size] This is most likely caused by a previous version of the mod. Gather your gear, uninstall it, create a clean save, reinstall it.\r\n\r\n[size=\\\"5\\\"]5.[b][Q][/b][/size] Can I skip the quest?\r\n[size=\\\"5\\\"][b][A][/b][/size] Type in the console SetStage IHSaviorsLodgeQuest 50 and unlock the doors at the Lodge with Unlock.\r\n\r\n[IMG]http://i50.tinypic.com/1ze9mq0.png[/IMG]\r\n\r\nBig thanks to my good friend MRCartm0n for his outstanding job on the graphics.\r\nThanks to Solventpost for testing and suggestions.\r\nThanks to Blade and Sam Magicman for voice acting.\r\nThanks to WolvenSpirit for testing and suggestions.\r\n\r\n[IMG]http://i47.tinypic.com/2q87qde.png[/IMG]\r\n\r\n - If you like Saviors Lodge, please endorse as much as possible, and if you\\'re feeling extra generous, drop in a vote for File of the Month. <3\r\n - If you find any bugs, report them in the comments section.\r\n - Want to help out? The best thing you can do is to tell everyone about Saviors Lodge, put a link in your signature, etc. Thanks!\r\n - I give kudos to those who upload pictures!\r\n - I\\'ve got a super super epic dungeon quest mod planned next... have an idea for a dungeon? Maybe it\\'ll be included.\r\n\r\n [b]-Falloutperson416[/b]",
  "categoryId": "35",
  "version": "V1.5",
  "author": "Falloutperson416",
  "createdUnix": "1342497846",
  "updatedUnix": "1344406505",
  "containsAdultContent": false,
  "uploadedBy": "falloutperson416",
  "primaryFile": null,
  "files": [
    {
      "fileId": "79647",
      "name": "Saviors Lodge - Fifth Release",
      "version": "V1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9786",
      "fileName": "Saviors Lodge - Fifth Release-20641-V1-5.7z",
      "uploadedUnix": "1344406505",
      "modVersion": "V1.5",
      "virusScanUrl": "https://www.virustotal.com/file/a02fd480d08014c48e7f0039b42a0aaa6836fbc9bbc73250a27a58d67e3962e3/analysis/1407078612/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saviors%20Lodge%20-%20Fifth%20Release-20641-V1-5.7z?fid=79647&ttl=1535788913&ri=8192&rs=8192&setec=b7fbb032d03e8bc0a9b0018901e4571f"
    }
  ]
}