{
  "modId": 20662.0,
  "modName": "Static Mesh Improvement Mod TRADUZIONE ITALIANA",
  "summary": "Traduzione italiana del file SMIM di Brumbek\r\nTHIS IS ONLY A TRANSLATION OF THE ORIGINAL MOD",
  "descriptionHtml": "[color=red][size=+2][center]NOTICE![/color][/size][/center]\r\n[color=red][size=+1][center]This is only a translation into Italian of the original mod. All credits go to the creator of the [url=http://skyrim.nexusmods.com/mods/8655]original mod[/url].\r\nThis mod edits many 3D models to improve their appearance and to fix many of the ugly seams and other oddities present in many of the 3D models.[/color][/size][/center]\r\n[color=green][size=+5][center]UNA PRODUZIONE DRAGONBORN ITALIA[/color][/size][/center]\r\n\r\n[color=green][size=+1]DESCRIZIONE[/color][/size]\r\nQuesto file modifica moltissimi modelli 3D migliorandone l\\'aspetto e le intersezioni andando anche a migliorare tutte quelle \\\"stranezze\\\" presenti in molti modelli 3D. Lo scopo ultimo della mod è quello di migliorare fino a 300 modelli problematici. Richiederà molto tempo fare ciò e rilascerò nuovi aggiornamenti man mano che completerò nuovi modelli 3D.\r\n\r\n[color=green][size=+1]INSTALLAZIONE[/color][/size]\r\n[b]Per installare questa mod dovrete:\r\n[list=1]\r\n[*]Scaricare ed installare la mod originale tramite NMM o manualmente;\r\n[*]Installare la traduzione caricata tra i file opzionali della mod originale.\r\n[/list][/b]\r\n\r\n[b][size=+0.5]1.a Installazione automatica[/b][/size]\r\nIl Nexus Mod Manager è raccomandato per l\\'installazione. Se lo utilizzate vi basta cliccare su \\\"Download with manager\\\" sotto al file principale (quello in Eng) e lasciare che il programma si occupi di tutto.\r\n\r\nQuesta mod è provvista di uno script di installazione che permette a chi la utilizza di scegliere quali parti utilizzare e quali texture utilizzare per le parti scelte. \r\n\r\nSe utilizzate la Unofficial Skyrim Patch (raccomandata!), installatela prima di SMIM e poi lasciate che questa mod sovrascriva tutti i file che include. In questo modo vi assicurerete di utilizzare sempre tutti i cambiamenti apportati da SMIM.\r\n\r\nSe utilizzate Better Dynamic Snow, installatela prima di SMIM e lasciate che SMIM sovrascriva tutti i file che include. Altrimenti non otterrete le funi 3D nelle fattorie.\r\n\r\nSe utilizzate mod di texture come Skyrim HD, installate prima SMIM e poi queste mod altrimenti potrebbero verificarsi alcuni problemi dovuti a dei conflitti con SMIM.\r\n\r\n[b][size=+0.5]1.b Installazione manuale[/b][/size]\r\nL\\'installazione manuale non è consigliata, ma potete comunque scaricare l\\'archivio e poi estrarre il contenuto della cartella \\\"00 Core\\\" nella vostra cartella \\\"Skyrim/Data\\\". Questo installerà parte della mod. Le altre cartelle i cui nomi cominciano per numeri sono tutte opzionali. Se volete utilizzarne una o più, estraetene il contenuto nella cartella \\\"Skyrim/Data\\\". \r\n\r\n[b][size=+0.5]2. Scaricare la traduzione[/b][/size]\r\nDopo aver installato la mod originale, vi basterà tornare sulla pagina di download della mod e cercare tra i file opzionali \\\"SMIM Italian Lenguage\\\". Scaricate l\\'archivio e estraete il file .esp nella vostra cartella \\\"Skyrim/Data\\\". Vi chiederà di sovrascrivere il precedente file, cliccate ovviamente \\\"si\\\".\r\n\r\n\r\nTutti i meriti vanno a [url=http://skyrim.nexusmods.com/users/283020]Brumbek[/url] per la creazione di questa fantastica mod.\r\nAll credits go to [url=http://skyrim.nexusmods.com/users/283020]Brumbek[/url] for the creation of this awesome mod.\r\n\r\n",
  "categoryId": "62",
  "version": "1.22",
  "author": "Demea",
  "createdUnix": "1342536506",
  "updatedUnix": "1342536506",
  "containsAdultContent": false,
  "uploadedBy": "Demea",
  "primaryFile": null,
  "files": []
}