{
  "modId": 20677.0,
  "modName": "Trophy Hunting - German",
  "summary": "Diese Mod lässt dich Trophäen von Tieren herstellen, die man entweder verkaufen oder in sein Haus hängen kann.",
  "descriptionHtml": "THIS IS ONLY THE GERMAN TRANSLATION OF THE MOD! Original [url=http://skyrim.nexusmods.com/mods/19803]Here[/url]\r\n\r\n\r\n=======Beschreibung=======\r\n\r\nDer trunkene Jägersmann verkauft eine Reihe an Büchern, welche dir lehren, wie man richtig Tiere ausbeutet und Trophäen von Tieren, die man getötet hat, herstellt. Nach dem Lesen eines Buches, wird man eine 80%ige Chance haben, Trophäenmaterialien von den Tieren zu bekommen. Trophäenteile können mit zum Gerbgestell genommen werden, um daraus Trophäen herzustellen (in der Pelzkategorie zu finden). Der Präparatorenvorbereiter wird benötigt, um die Trophäen herzustellen. Er kann entweder am Gerbgestell hergestellt werden oder im Trunkenen Jägersmann gekauft werden.\r\n\r\nTrophäen fallen nicht, wenn man sie fallen lässt, stattdessen schweben sie an dem Ort, wo man sie platziert hat. Wenn man sie mit einer Nahkampfwaffe trifft, öffnet sich ein Fine-Tuning Menü, in welchem man die genaue Position anpassen kann. Das erlaubt es dir, sie überall im Haus zu platzieren.\r\n\r\nDie Tiere aus denen man Trophäen machen kann sind: Wölfe, Bären, Säbelzahntiger, Skeever, Elche, Horker, Schlammkrabben und Schlachterfische.\r\n\r\n\r\n=======Bekannte Fehler=======\r\n\r\n-Die Rückseite der Trophäen wird nicht angezeigt.\r\n-Geweihe können nicht verschoben werden. Man kann sie zwar verkaufen, aber nicht irgendwo aufhängen.\r\n\r\n\r\n=======Change Log=======\r\n\r\nv1.3 Initial Posting\r\nv1.4 Fixed bug caused by restructuring the code\r\n\r\n\r\n=======Credits=======\r\n\r\nJBSchroeds - Für die Originalmod",
  "categoryId": "85",
  "version": "1.4",
  "author": "JBSchroeds",
  "createdUnix": "1342552099",
  "updatedUnix": "1342552099",
  "containsAdultContent": false,
  "uploadedBy": "powerbenny1706",
  "primaryFile": null,
  "files": []
}