{
  "modId": 20681.0,
  "modName": "SkyXP",
  "summary": "Replaces Skyrim\\'s skill system with an Experience Point (XP) system. Discover locations, complete quests and kill foes to earn XP to spend on skills. ",
  "descriptionHtml": "[heading]SkyXP[/heading]\r\n\r\nSkyXP replaces Skyrim\\'s practice-based skill system with an Experience Point (XP) system. You earn experience through actions such as completing quests, visiting a new location for the first time, or defeating a foe. You can spend XP to increase any skill. \r\n\r\nSkyXP is currently a pale copy of SirFrederik\\'s excellent [url=http://oblivion.nexusmods.com/mods/15619]Oblivion XP mod[/url].\r\n\r\nThis mod works, but is of [i]high beta[/i] quality. \r\n\r\n[heading]Philosophy[/heading]\r\n\r\nBethesda is to be commended for their relatively-novel practice-based leveling system. It has the advantage of being \\\"realistic\\\": in the real world, the best way to get better at a skill is to practice it.  Unfortunately, [url=http://en.wikipedia.org/wiki/GNS_Theory]realism is not always the same as fun[/url], and for many players the practice-based system actually hurts replay value, because optimal play involves \\\"grinding\\\" repetitive tasks. How many of you have crafted a multitude of iron daggers, cast conjuration or alteration spells just out of reach of a nearby enemy, stood in a stream casting waterbreathing, jumped up and down atop a forge, or let a powerful foe hit you a few times just to increase one of your skills? \r\n\r\nThe underlying philosophy of this mod is to improve the play experience by [i]removing repetitive grinding[/i], especially grinding done [i]in safety[/i]. With this mod, your character advances (and you play optimally) by [i]doing things[/i], such as visiting new locales, completing quests, and defeating monsters. \r\n\r\n[heading]Installation[/heading]\r\n\r\n[list=1]\r\n\r\n[*] This mod [i]requires[/i] [url=http://skse.silverlock.org]SKSE[/url]. \r\n\r\n[*] This mod [i]requires[/i] the [url=http://skyrim.nexusmods.com/mods/1175]Skyrim -Community- Uncapper[/url].\r\n\r\n[*] Edit [code]Skyrim/SKSE/Plugins/SKSE_Elys_Uncapper.ini[/code] so that [code]bUseSkillExpGainMults=1[/code] and so that all 18 skills under [code]SkillExpGainMults[/code] are set to 0.0. That will disable the normal Skyrim skill-based leveling system but allow skill books, quest skill awards and SkyXP to work normally. (If you fail to do this, SkyXP will not crash but you will still get vanilla-Skyrim-style skill bonuses from practice, so you\\'ll gain skills \\\"twice\\\" as fast.) \r\n\r\n[img=center]http://static.skyrim.nexusmods.com/mods/images/20681-1-1342563228.png[/img]\r\n\r\n[*] Yes, it would be better to have some mod-install-time setup or in-game configuration that handled this. \r\n[*] [b]Warning:[/b] While I have tested uninstalling this mod, and it appears to work (you may get some \\\"ghost\\\" updates for a bit, but it settles down), I make no guarantees. You should definitely make a backup save before trying this out. \r\n\r\n[/list]\r\n\r\n[heading]Existing Games and New Games[/heading]\r\n\r\nWhen you load a game with SkyXP installed for the first time it will make note of all of your accomplishments. Subsequently, you will only earn Experience Points for new accomplishments. (The one exception to this is visiting locations: you earn XP for all locations visited after SkyXP is installed, even if you\\'ve been there pre-SkyXP.) \r\n\r\n[heading]Details[/heading]\r\n\r\nA number of XP awards are given. In general, all counts (e.g., number of locks picked or quests completed) use the same counter as the [code]General Stats[/code] information tab (press [code]Esc[/code] to see it). All awards are cumulative, so completing a Main Quest may earn you 10,000 XP total. \r\n\r\n[list=1]\r\n[*] [b]+7500[/b] bonus for completing a Main Quest.\r\n[*] [b]+2500[/b] for completing a Quest. \r\n[*] [b]+2500[/b] for clearing a Dungeon or other Area.\r\n[*] [b]+2500[/b] for a successful Persuasion, Intimidation or Bribery.\r\n[*] [b]+2000[/b] for purchasing a House. \r\n[*] [b]+750[/b] for completing a Miscellaneous Objective.\r\n[*] [b]+500[/b] for visiting a new Location. \r\n[*] [b]+500[/b] for a successful Brawl.\r\n[*] [b]+500[/b] for finding and harvesting a Nirnroot. \r\n[*] [b]+200[/b] for picking a Lock.\r\n[*] [b]+200[/b] for purchasing a Horse.\r\n[*] [b]+100[/b] for trapping a Soul. \r\n[*] [b]+100[/b] for investing in a Store.\r\n[*] [b]+100[/b] for Crafting ten potions, poisons, new weapons, new armors, upgraded weapons, and/or upgraded armors. Enchanting one item also yields this full award (i.e., counts as crafting ten weapons).\r\n[*] [b]+25[/b] for looting a Chest or similar Container.\r\n[/list]\r\n\r\nCombat experience is handled specially, around a base XP award of [b]+200[/b]. Standing near or searching the [i]body[/i] of a dead creature awards XP. A slight blue \\\"absorbing\\\" visual effect will play on a body when it is counted for XP. Nearby bodies are counted randomly in the background, but you can also ensure that a body is counted by searching it: a body will only ever be counted once.\r\n\r\n[list=1] \r\n[*] [b]Absolute[/b] (default) -- Level 5 foes merit the base XP award.  Level 4 foes earn 80%, Level 3 foes earn 60%, and so on. The award for a higher-level foe scales with the square root of the level above five. So a Level 9 foe earns twice the base award and a Level 14 foe earns three times the base award. \r\n[*] [b]Relative[/b] -- Creatures up to 9 levels below you merit lesser rewards (down to one-tenth the base amount) while creatures up to 10 levels above you (e.g., boss monsters, dragons, dragon priests, etc.) merit greater rewards (up to six timesthe base). \r\n[/list] \r\n\r\nAll of these individual award values, as well as a simple global multiplier on earned XP, can be changed using either in-game configuration menus or console commands and ~bat files (your choice).\r\n\r\nTo avoid clunky in-game menus and to prevent you from having to select a special fake \\\"power\\\" over your favorite dragon shout, your XP and leveling options are represented as special inventory items. These items are added to your inventory automatically when you load the game after installing the mod. To spend XP: \r\n\r\n[list=1]\r\n[*] While [i]on the inventory menu[/i], click on the appropriate item, such as [code]XP - Combat - Smithing[/code]. If your current level in a skill is [b]X[/b], the cost to increase that skill is [b]50*X[/b]. So raising from 25 to 26 requires 1250 XP, while raising from 50 to 51 requires 2500 XP (twice as much). This encourages players to \\\"spread around\\\" skill increases at low levels, but still makes it possible to focus on one or two skills if truly desired. If you have the XP, it will be deducted and your skill level will be increased by one, as if you had read a skill book on the subject.  Don\\'t bother to drop the item and pick it up. Just click.  \r\n[*] This mod [i]does not change[/i] the number of skill increases required to gain a level or the benefits of gaining a level (e.g., number of perks) in any way. \r\n[/list]\r\n\r\nOther ways to gain skills (e.g., quest rewards, skill books, that daedric artifact) work exactly as before and blend seamlessly with SkyXP. \r\n\r\n[heading]Time-Saving Options[/heading]\r\n\r\nWhen replaying a game as large as Skyrim, the human time we have available is often a limiting factor. SkyXP will feature a few [i]optional[/i] time-saving tweaks. None of these are required in any way, but players giving the game another run-through may find that they allow one to get to the \\\"fun parts\\\" quickly and minimize the \\\"down time\\\".\r\n\r\nIn future releases these will be controlled by in-game configuration menus.  Currently you\\'ll have to use the console to enable them. \r\n\r\n[list]\r\n[*] [b]Non-Combat Harvest.[/b] [code]set SkyXPNonCombatHarvest to 1[/code] Inspired by, but much simpler than, LaoArchAngel\\'s [url=http://skyrim.nexusmods.com/mods/10067]Auto Harvest mod[/url], this option will automatically harvest 1 nearby un-owned plant (or coin purse, or salmon, ...) per second while you are [i]not[/i] in combat. This should never \\\"steal\\\". This will only harvest if you are carrying 1 unit less than your maximum encumbrance. This will give you a good set of alchemical ingredients in the course of normal travel without you having to waste precious human time to walk over and look at the ground and click. \r\n[*] [b]Non-Combat Speed.[/b] [code]set SkyXPNonCombatSpeed to 200.0[/code] This option will automatically increase your walking, running and swimming speeds by 200% (i.e., it adds 200 to \\\"speedmult\\\") while you are [i]not[/i] in combat. You could always just make your replay character faster all the time with the console, but being able to dart in and out of melee range is a huge advantage in Skyrim combat, so limiting the speed to non-combat situations allows you to save time on travel and exploration without making fights any easier. Note: checks are only made every second, so you may be \\\"fast\\\" the first second of a fight and you\\'ll be \\\"normal\\\" until the last red dot leaves your compass.\r\n[/list]\r\n\r\n[heading]In-Game Configuration[/heading]\r\n\r\nClick on your [b]Experience Points[/b] item to bring up the in-game configuration menu. You can:\r\n\r\n[list]\r\n[*] Change the XP Award Amounts. You can set a global XP award multiplier (e.g., if you think SkyXP levels you too slowly, just raise the multiplier from 100% to 200%) and/or change individual award amounts. \r\n[*] Reset SkyXP settings to their default values. This includes XP Award Amounts, UI options, and Ease options. \r\n[*] Toggle text and sound updates for XP Awards (sound not yet implemented).\r\n[*] Toggle ease-of-replay time-saving options.\r\n[*] Disable SkyXP cleanly (stops recurring scripts so that you can uninstall or upgrade the mod).\r\n[/list]\r\n\r\n[heading]Console Commands[/heading]\r\n\r\nIf you find the in-game configuration interface clunky, you can also set everything with console commands. SkyXP ships with a file called \\\"skyxp.txt\\\" in the \\\"Data/\\\" folder. Just open it up with a text editor and change any value. Then when you enter the game just press ~ to open up the console and type [code]bat skyxp[/code]. It will read in all of your configuration options from the file and apply them. \r\n\r\nHere are the default contents: \r\n\r\n[code]\r\nset SkyXPAwardOverall to 100\r\n\r\nset SkyXPAwardCombat to 200\r\nset SkyXPAwardCombatAbsolute to 0\r\nset SkyXPAwardQuest to 2500\r\nset SkyXPAwardMainQuest to 7500\r\nset SkyXPAwardMiscQuest to 750\r\nset SkyXPAwardLocation to 500\r\nset SkyXPAwardCleared to 2500\r\nset SkyXPAwardContainer to 25\r\nset SkyXPAwardStore to 100\r\nset SkyXPAwardHorse to 200\r\nset SkyXPAwardHouse to 2000\r\nset SkyXPAwardPersuasion to 2500\r\nset SkyXPAwardSoulTrap to 100\r\nset SkyXPAwardNirnroot to 500\r\nset SkyXPAwardLockpick to 200\r\nset SkyXPAwardCrafting to 100\r\n\r\nset SkyXPUIText to 1\r\nset SkyXPHideItems to 0 \r\nset SkyXPUISound to 0 \r\n\r\nset SkyXPNonCombatSpeed to 0.0\r\nset SkyXPNonCombatHarvest to 0\r\n[/code]\r\n\r\n[heading]Known Compatible Mods[/heading]\r\n\r\nIt is compatible with Dawnguard (but SkyXP does not influence the Werewolf or Vampire perk trees). Almost any mod should be compatible. Here are some known-to-work mods: \r\n\r\n[size=-2]\r\n1nivWICCloaks.esp [Version 2.0]\r\n1nivWICCloaksCRAFT.esp [Version 2.0]\r\nAlternate Start - Live Another Life.esp\r\nAmanda.esp\r\nAncient Skyforge Armor.esp\r\nApocalypse - The Spell Package.esp\r\nArchmageNecklace.esp\r\nASIS.esp\r\nASIS-Dependency.esp\r\nBellyachesNewDragonSpecies_TougherDragons.esp\r\nBFPU Orcish Armor.esp\r\ncalyps-investigator.esp\r\nchainmail.esp\r\nChesko_WearableLantern.esp\r\nClassicClasses.esp\r\nClimatesOfTamriel.esm\r\nClimatesOfTamriel-Dungeons-Interiors.esp\r\nDeadlyDragons.esp\r\nDeadlyDragonsArmory.esp\r\nDeleveled Skyrim - Enemies (No Dragons).esp\r\nDeleveled Skyrim - Enemies Wildlife.esp\r\nDeleveled Skyrim - Enemies.esp\r\nDeleveled Skyrim - Items.esp\r\nDeleveled Skyrim - JSwordsDistributionBalancePlugin.esp\r\nDeleveled Skyrim - SkyMoMod_list.esp\r\nDeleveled Skyrim - TCOSS.esp\r\nDisableRangedKillCams1.6.esp\r\nDorkDiva Elf Eye Additions.esp\r\nDPArmor.esp\r\nDragonSwarms.esp\r\nDread Huntress Armor.esp\r\nDreamBurrowSageRetexture.esp\r\nDual Wield Parrying_RandomAttacks.esp\r\nDuel - Combat Realism.esp\r\nDW Commoners.esp\r\nDW Enemies and Wanderers.esp\r\nEola Atronach Form Red Smoke.esp\r\nEquip more Rings (2).esp\r\nFastTravelFromIndoors.esp\r\nFinGleam.esp\r\nFinGleam-Nighteye.esp\r\nFrostmourne.esp\r\nFurther Dark Dungeons for ENB.esp\r\nHBE.esm\r\nHBE_FastTravel_Enabled.esp\r\nHentaiVoidArmor.esp\r\nHigherLevelEnemies.esp\r\nhothtrooper44_ArmorCompilation.esp\r\nhumans drop human parts.esp\r\nignitetheworld.esp\r\nIMAGINATOR - Visual Control for Skyrim.esp\r\nImmediateDragons.esp\r\nImmersiveArmorsNPCs.esp\r\nIsh\\'s Souls to Perks.esp\r\nJSwords.esm\r\nJSwordsDistributionBalancePlugin.esp\r\nkuerteeAutoSaveAndTime.esp\r\nLich King\\'s Armor.esp\r\nLyla.esp\r\nMashupUNP.esp\r\nMD - BMIVR.esp\r\nMichelle.esp\r\nMiningFlames.esp\r\nMisha.esp\r\nMonster Wars.esp\r\nMore Visible Soul Trap Effect.esp\r\nmoreloot.esp\r\nMoreTraining_50.esp\r\nNeo\\'s Scouter Set.esp\r\nNewermind Bow Collection.esp\r\nNightasyBondageArmor.esp\r\nnightshade_armor_UNPB.esp\r\nPermanent Blessing.esp\r\nPiratelords Loot Adjustments.esp\r\nPTAlchemyFoodOverhaul_BetterSorting.esp\r\nPTAlchemyOverhaul_SkillRate_1_0.esp\r\nRadiant and Unique Potions Poisons and BOOZE.esp\r\nRemoveAmbientInteriorFog.esp\r\nRevampedExteriorFog.esp\r\nRiverwood Smelter.esp\r\nrosarmor.esp\r\nS2C-All.esp\r\nSecondary Locations Map Markers.esp\r\nSkyMoMod Extras Collectables.esp\r\nSkyMoMod.esm\r\nSkyMoMod_lists.esp\r\nSkyMoMod_morespawns_animal.esp\r\nSkyMoMod_morespawns_bandit.esp\r\nSkyMoMod_morespawns_draugr.esp\r\nSkyMoMod_morespawns_dwerven.esp\r\nSkyMoMod_morespawns_falmer.esp\r\nSkyMoMod_morespawns_forsworn.esp\r\nSkyMoMod_morespawns_mage.esp\r\nSkyMoMod_morespawns_vampire.esp\r\nSkyRe_Combat.esp\r\nSkyRe_EncounterZones.esp\r\nSkyRe_EnemyAI.esp\r\nSkyRe_EnemyScaling.esp\r\nSkyRe_Main.esp\r\nSkyRe_StandingStones.esp\r\nSkyrim 10 DeadBody Remover.esp\r\nSkyrim 3 Day DeadBody Timer.esp\r\nSkyrim 3 Day Respawn.esp\r\nSkyrim Expanded Loot Tables.esp\r\nSkyrim Timescale 8.esp\r\nsoma\\'s archery overhaul (sao).esp\r\nSovngarde Steel Armor and Weapons.esp\r\nSpace Wiking\\'s Dwemer Exoskeleton.esp\r\nstronger daedric artifacts.esp\r\nTCOSS.esp\r\nThe Dance of Death.esp\r\nTheElvenSkinProject.esp\r\nUFO - Ultimate Follower Overhaul.esp\r\nUnofficial Skyrim Patch.esp\r\nUNPB Barbarian Armor.esp\r\nVeteran Nord Plate.esp\r\nWATER.esp\r\nWeapons and Armor fixes - Hacks.esp\r\nWeapons and Armor fixes.esp\r\nWerehide.esp\r\nWhiterun Lighting Fix.esp\r\nWhiteruntrees.esp\r\n[/size]\r\n\r\nCurrently there are no reported incompatible mods (please report any candidates in the comments.) \r\n\r\nSpecial thanks to Elys, SirFrederik, LaoArchAngel, T3nd0, the SkyUI team, many good people I\\'m forgetting in Skyrim modding, the Skyrim Nexus and Wrye Bash people, and of course [url=http://www.pocketplane.net]Jason Compton[/url], the modder\\'s modder. \r\n\r\n[heading]TODO List[/heading]\r\n\r\nLikely upcoming improvements:\r\n[list]\r\n[*] Optional sound notifications for XP awards. \r\n[*] Make current skill costs and values more visually obvious. \r\n[*] Add Rested effects / Doomstone effects. \r\n[*] Make the XP items Quest items (option?). \r\n[*] UI option to cancel the blue creature XP animation.\r\n[*] An option for a flat XP award for combat? \r\n[*] UI option to confirm if you want to spend XP. \r\n[/list]\r\n\r\n[heading]Future Ideas[/heading]\r\n\r\nSkyXP is in an early stage. Some direct improvements include:\r\n\r\n[list]\r\n[*] Some sort of installation system.\r\n[*] Better balance for the XP awards and costs (very likely to happen frequently!). \r\n[*] XP awards for recovering daedric artifacts, killing dragons, or learning shouts. I am not immediately sold on this idea because those things are typically their own rewards already (i.e., your character already becomes more powerful by doing them).\r\n[*] XP awards for theft. This is tricky: in Oblivion XP, awards for theft were dramatically overpowered -- as was theft itself. I\\'m not sure how to balance this. \r\n[*] XP awards for reading books. This could be done (there are already mods that make unread books glow), but again it tends to force everyone playing optimally to spend their first ten minutes in the safety of a bookstore grinding zero-risk XP. \r\n[*] If anyone wants to design a real GUI (like the favorites menus mods), I\\'d love to incorporate it.\r\n[*] Possibly using XP to buy Perk Points directly.\r\n[*] Possibly using XP to buy Dragon Souls directly. (Does not make a huge amount of lore-sense, so probably a player-controlled option.) \r\n[*] Possibly integrate with the Pilfer auto-looting mod. \r\n[*] SkyRe skill-name compatibility. \r\n[/list] \r\n\r\nI would love to hear additional suggestions in the forum. \r\n\r\nI realize that many of you may have different ideas about what would make the game more fun. I am mostly writing this to scratch my own itch. \r\n\r\n[heading]Help Wanted[/heading]\r\n\r\nI have no experience with Skyrim GUI modding or Skyrim\\'s version of ActionScript. If anyone with such experience would like to help out, I\\'d quite appreciate it. This mod could use something as simple as an \\\"XP Progress Bar\\\" (as in OblivionXP) or as complicated as a true Level-Up UI interface. \r\n\r\n[heading]Change Log[/heading]\r\n\r\n[list]\r\n[*] v12. Added a UI option to hide all of the inventory items except the XP count when you\\'re not using them. The first click on the XP restores them.\r\n[*] v12. The XP for killing a monster is now calculated on an absolute scale to remove a perverse incentive to stay underleveled forever. You can set it to use the old way if you prefer (menus or set SkyXPAwardCombatAbsolute to 1).  Feedback is desired. If this approach doesn\\'t work, there\\'s still one left.\r\n[*] v12. Auto-Harvest now includes an encumbrance check. \r\n[*] v12. Skill Costs for training now mirror in-game costs: x3 at 50 and x5 at 75. This prevents a perverse incentive to use training to get to 50 and then spend XP to get above it. \r\n[*] v12. Slight XP award adjustment. \r\n[*] v11. Prevent NMM crashes by changing text. No functional changes. \r\n[*] v10. In-game configuration of XP awards and global XP award multiplier.  Can also be set via console commands or bat file.\r\n[*] v10. Changed default award values for Lockpicking and Soul Trapping.\r\n[*] v10. Visited Locations XP now based on the Misc Stat and not based on internal locations. They should coincide with map marker updates now. \r\n[*] v9. Restructure XP system to avoid a creeping \\\"inventory lag\\\" slowdown.  Now instead of having many objects in your inventory that stand for XP, you have just one. If you have a current game, you\\'ll need to shutdown the mod, uninstall the mod, save, quit, upgrade the mod, and reload. You can use ~set skyxpcurrent to X in the console to give yourself back any lost XP.  The \\\"inventory UI\\\" now shows the skill value for each skill, as well as the amount of XP it would cost to raise it. The XP item still shows the XP you currently have. Fixed a number of bugs and typos in the configuration menus. It should be possible to turn off non-combat-speed-boost now :-). \r\n[*] v8. Fixed a bug where crafting would give you infinite XP and slow down the game. Sigh!\r\n[*] v7. Add In-Game Configuration (partially finished). Add support for [i]Not[/i] Starting A New Game. Add a Clean Shutdown option. Add XP for Crafting.\r\n[*] v6. The cost to increase a skill now increases as that skill increases, so it is harder to focus-train up to Destruction 90 at Level 6 or whatnot.  Rebalanced XP awards a bit. \r\n[*] v5. Total revamp of \\\"Quest XP\\\" system. We no longer print the name of the Quest, but in exchange we should be much more accurate about what is and is not a valid quest -- we use the same counters as the vanilla game\\'s information screens. Main Quests earn extra XP, misc objectives earn less.  In addition, XP is now awarded for lockpicking, looting chests, brawls, bribes, persuasion, intimidation, houses, horses, soul traps, and clearing dungeons.\r\n[*] v4. Automatically obtain XP from nearby bodies. A slight blue glow (user can turn off in later versions) will play on a counted body. A body will only be counted once, but now you can either wait while it it done automatically (new way) or do it yourself by searching the body (old way), your choice.\r\n[*] v3. Manually refine the list of checked quests down to 310 that contain human-readable names and human-readable quest objectives. So passing by a wilderness encounter or watching a cutscene (internally coded as quests) no longer gives XP. Quest XP doubled to compensate for fewer quests -- balancing is still clearly not done. Added non-combat harvest and non-combat speed options for saving time on replays. \r\n[*] v2. Add support for some \\\"minor\\\" quests, such as Faendal\\'s Lovely Letter. Drop all \\\"unnamed\\\" quests. Reduce XP cost for increasing a skill.  Better pretty-printing for unnamed locations. \r\n[*] v1.01. First public release. \r\n[/list]",
  "categoryId": "73",
  "version": "12",
  "author": "weimer",
  "createdUnix": "1342560676",
  "updatedUnix": "1345039416",
  "containsAdultContent": false,
  "uploadedBy": "weimer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "74981",
      "name": "SkyXP v1_01",
      "version": "101",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "21",
      "fileName": "SkyXP v1_01-20681-101.zip",
      "uploadedUnix": "1342567500",
      "modVersion": "101",
      "virusScanUrl": "https://www.virustotal.com/file/e4689a7659fe29da96809d5c6535be9592eb5d39b2043e3da3a776b05ccfe977/analysis/1407029763/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyXP%20v1_01-20681-101.zip?fid=74981&ttl=1535788978&ri=8192&rs=8192&setec=842491697309e0c1047f59d8d08c21fa"
    },
    {
      "fileId": "75088",
      "name": "SkyXP v2",
      "version": "2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "29",
      "fileName": "SkyXP v2-20681-2.zip",
      "uploadedUnix": "1342613514",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/a9a8e598587b17f4201aca98942739007f33b5d5e56ff77c5cd4f22f9e1ea3b3/analysis/1407030905/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyXP%20v2-20681-2.zip?fid=75088&ttl=1535788978&ri=8192&rs=8192&setec=6e4f0586322e8f35555e5de18c20d719"
    },
    {
      "fileId": "75388",
      "name": "SkyXP v3",
      "version": "3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "26",
      "fileName": "SkyXP v3-20681-3.zip",
      "uploadedUnix": "1342732279",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/642aa8bdd69fffe58dc1a342f200781ef68d35a263f147c35e383be57efef8b6/analysis/1407033903/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyXP%20v3-20681-3.zip?fid=75388&ttl=1535788979&ri=8192&rs=8192&setec=d3d630ef3c69d4a48d7789f37b9924b7"
    },
    {
      "fileId": "75423",
      "name": "SkyXP v4",
      "version": "4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28",
      "fileName": "SkyXP v4-20681-4.zip",
      "uploadedUnix": "1342743945",
      "modVersion": "4",
      "virusScanUrl": "https://www.virustotal.com/file/8d0382b2df70ef4a642dd191948021a4fbff6e63a3f739db7f78c352ff490cff/analysis/1407034209/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyXP%20v4-20681-4.zip?fid=75423&ttl=1535788979&ri=8192&rs=8192&setec=404bd319e0afff7b180b1be00f5becf8"
    },
    {
      "fileId": "75644",
      "name": "SkyXP v5",
      "version": "5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "30",
      "fileName": "SkyXP v5-20681-5.zip",
      "uploadedUnix": "1342832008",
      "modVersion": "5",
      "virusScanUrl": "https://www.virustotal.com/file/4a47564791a7e61a26217509a228ac69b3e118bc8d1b4b538a4170567c101d28/analysis/1407036030/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyXP%20v5-20681-5.zip?fid=75644&ttl=1535788980&ri=8192&rs=8192&setec=fd1c6efbee1fe00e4d4b62fce0f50ce2"
    },
    {
      "fileId": "75818",
      "name": "SkyXP v6",
      "version": "6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "32",
      "fileName": "SkyXP v6-20681-6.zip",
      "uploadedUnix": "1342914416",
      "modVersion": "6",
      "virusScanUrl": "https://www.virustotal.com/file/5547f2d88b45b17c8413c685784d6b81baf9e6569fa50f69a1af7e6e5636892c/analysis/1407037754/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyXP%20v6-20681-6.zip?fid=75818&ttl=1535788980&ri=8192&rs=8192&setec=6bee96fac5c43a73b4be9454668f9dc6"
    },
    {
      "fileId": "76596",
      "name": "SkyXP v7",
      "version": "7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "37",
      "fileName": "SkyXP v7-20681-7.zip",
      "uploadedUnix": "1343244730",
      "modVersion": "7",
      "virusScanUrl": "https://www.virustotal.com/file/6150e18f950c0cc27c5c576cf1940611b00517ae32df1a158fe573bea134bf72/analysis/1407045553/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyXP%20v7-20681-7.zip?fid=76596&ttl=1535788981&ri=8192&rs=8192&setec=e17493dc90c86be28901bb8b46e854e2"
    },
    {
      "fileId": "76622",
      "name": "SkyXP v8",
      "version": "8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "37",
      "fileName": "SkyXP v8-20681-8.zip",
      "uploadedUnix": "1343257277",
      "modVersion": "8",
      "virusScanUrl": "https://www.virustotal.com/file/7b282a7bd0c21c19eb0437578634c070e4e84293f131fe23e4f8e50c751538a7/analysis/1407045857/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyXP%20v8-20681-8.zip?fid=76622&ttl=1535788981&ri=8192&rs=8192&setec=a4652990f6e260d54c9a3777336010b6"
    },
    {
      "fileId": "77163",
      "name": "SkyXP v9",
      "version": "9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "41",
      "fileName": "SkyXP v9-20681-9.zip",
      "uploadedUnix": "1343505066",
      "modVersion": "9",
      "virusScanUrl": "https://www.virustotal.com/file/a86e37e4d6339d094c1c67c08df82541c3af05142966147c70a753f22bb24914/analysis/1407052503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyXP%20v9-20681-9.zip?fid=77163&ttl=1535788982&ri=8192&rs=8192&setec=27424f8d132a25cbc7af9d4f94f8c02e"
    },
    {
      "fileId": "78169",
      "name": "SkyXP v10",
      "version": "10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "49",
      "fileName": "SkyXP v10-20681-10.zip",
      "uploadedUnix": "1343871893",
      "modVersion": "10",
      "virusScanUrl": "https://www.virustotal.com/file/e9b5f96818fd4b5fb02c333cfde7046bef13748c7de8e63b4e04094ce2a2adb3/analysis/1407062943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyXP%20v10-20681-10.zip?fid=78169&ttl=1535788982&ri=8192&rs=8192&setec=3cf74f859fa845ae71d09aa4eb1fd3b9"
    },
    {
      "fileId": "78374",
      "name": "SkyXP v11",
      "version": "11",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "49",
      "fileName": "SkyXP v11-20681-11.zip",
      "uploadedUnix": "1343961376",
      "modVersion": "11",
      "virusScanUrl": "https://www.virustotal.com/file/a5f1423ca530e2b31d34d805d4e4d3a5ac74085e0d0e22e35bbcc929d57ed083/analysis/1407065462/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyXP%20v11-20681-11.zip?fid=78374&ttl=1535788983&ri=8192&rs=8192&setec=566075c6ebfdc2502d5bf3b07e0358dd"
    },
    {
      "fileId": "81799",
      "name": "SkyXP v12",
      "version": "12",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "53",
      "fileName": "SkyXP v12-20681-12.zip",
      "uploadedUnix": "1345039416",
      "modVersion": "12",
      "virusScanUrl": "https://www.virustotal.com/file/eb3b38edc16311c1c2a5abf22c5d942d3704a8d43653b467c85736288a1d2dfe/analysis/1407098644/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyXP%20v12-20681-12.zip?fid=81799&ttl=1535788983&ri=8192&rs=8192&setec=44b55f899eae0fe6fcbe3c5af0218889"
    }
  ]
}