{
  "modId": 20686.0,
  "modName": "Wepons of the Third Era MoS Edition TRADUZIONE ITALIANA",
  "summary": "Traduzione italiana del file Wot3E di masterofshadows\r\nTHIS IS ONLY A TRANSLATION OF THE ORIGINAL MOD",
  "descriptionHtml": "[color=red][size=+2][center]NOTICE![/color][/size][/center]\r\n[color=red][size=+1][center]This is only a translation into Italian of the original mod. All credits go to the creator of the [url=http://skyrim.nexusmods.com/mods/12892]original mod[/url]. \r\nMorrowind-themed weapons pack with a lot of new, non-replacement weapons.\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.[/color][/size][/center]\r\n[color=green][size=+5][center]UNA PRODUZIONE DRAGONBORN ITALIA[/color][/size][/center]\r\n\r\n[color=green][size=+1]DESCRIZIONE[/color][/size]\r\nQuesta è la traduzione della mod originalmente di 747823 che ha poi lasciato l\\'incarico. Se ne è fatto carico masterofshadows che ha portato avanti questo encomiabile lavoro. \r\nComunque, Weapons of the Third Era aggiunge tante nuove armi al gioco. Non va a sostituire alcuna arma esistente, ciò significa che tutte le armi aggiunte sono nouve, tutte le armi \\\"vanilla\\\" rimangono inalterate e giocabili. Tutte le nuove armi sono perfettamente integrate nel gioco, saranno quindi rinvenibili sia su NPC che in contenitori vari durante il gioco. Inoltre sono inserite nel gioco tramite \\\"leveled-list\\\", le armi migliori saranno posizionate quando il vostro pg avrà raggiunto livelli più alti. \r\n\r\n[color=green][size=+1]DESCRIZIONE[/color][/size]\r\nNiente di più semplice:\r\n[list]\r\n[*]Scaricate l\\'ultima versione (1.5) della mod originale;\r\n[*]Navigate fino alla nostra pagina (il link è nella sezione mirror) e dalla sezione download scaricate la traduzione della mod;\r\n[*]Sostituite il file .esm originale con quello tradotto scaricato da Dragonborn Italia.\r\n[/list]\r\n\r\n[b][size=+1]Ringraziamenti[/size][/b]\r\nInnanzitutto un grande grazie a [url=http://skyrim.nexusmods.com/users/4338168]DDevil95[/url] per aver tradotto la mod. \r\nInfine tutti i meriti vanno a [url=http://skyrim.nexusmods.com/users/1169912]masterofshadows[/url] per la creazione di questa fantastica mod.\r\nAll credits go to [url=http://skyrim.nexusmods.com/users/1169912]masterofshadows[/url] for the creation of this awesome mod.\r\n",
  "categoryId": "55",
  "version": "1.5",
  "author": "Demea",
  "createdUnix": "1342565583",
  "updatedUnix": "1342565583",
  "containsAdultContent": false,
  "uploadedBy": "Demea",
  "primaryFile": null,
  "files": []
}