{
  "modId": 20732.0,
  "modName": "Zhang Fei Follower - The Three Kingdoms",
  "summary": "Adds Zhang Fei as a follower in The Winking Skeever, Solitude.",
  "descriptionHtml": "Zhang Fei (styled Yide) was the \\\"Third Brother\\\" of a group of heroes that formed the Shu Kingdom in the novel \\\"The Three Kingdoms\\\", which is based on actual events in ancient China. He was known for his fierce temperament, powerful voice, loyalty and love of wine. You may know him from Dynasty Warriors, The Romance of the Three Kingdoms games, the excellent 6-hour film \\\"Red Cliff\\\", and many other retellings of the classic tale including several tv shows and anime.\r\n\r\nZhang Fei can be recruited from The Winking Skeever in Solitude. He starts with an Iron Battleaxe and no armor. He is a 2-Handed fighter and likes heavy armor. He often uses a battle cry (shout) that sends his enemies reeling (Unrelenting Force). He will level with the player character. He does not require any special mods to use, so he should work with whatever mods you like best. He is a big fellow, but not quite as tall as Second Brother Guan Yu.\r\n\r\n=========\r\nChangelog:\r\n\r\nIMPORTANT NOTE: Take all of his items before changing versions, or you will lose those items!\r\n\r\nV1.0: Uses shout \\\"Unrelenting Force\\\". Several 2H weapon perks included. I have used a slightly different setup from my Guan Yu mod to reflect their differing personalities (2H axes/polearm axe mods are also favored by Zhang Fei). He does not step lightly, but can use the Avoid Death ability once a day. A few flavor items are his starting inventory. Hunting bow respawn bug has been dealt with.\r\n\r\n\r\n________________________________________\r\nMods I\\'ve used to achieve the look in the photos:\r\n(Individual mod sites may contain adult content)\r\n\r\nKnight Of Thorns Armor And Spear of Thorns by Zerofrost Satyr ( http://skyrim.nexusmods.com/mods/18940 )\r\n\r\nGreen Dragon Crescent Blade by Bloodysunday ( http://skyrim.nexusmods.com/mods/19383 )\r\n\r\nBetter males - Beautiful nudes and faces - New hairstyles by Chris57 and FavoredSoul w/ Gennox Faces: ( http://skyrim.nexusmods.com/mods/2488 )\r\n\r\nImmersive Armors by hothtrooper44 ( http://skyrim.nexusmods.com/mods/19733 )\r\n\r\nWinter is Coming (cloaks) by Nivea ( http://skyrim.nexusmods.com/mods/13486 )\r\n\r\nThe Art of Magicka by Zonzai and Kalell ( http://skyrim.nexusmods.com/mods/1040\r\n\r\nDark Dragon Armor by thewolfpacisback ( http://skyrim.nexusmods.com/mods/20101 )\r\n____________________________________\r\nGraphics (and other) Mods I use and enjoy:\r\nUltimate Follower Overhaul\r\nClimates of Tamriel\r\nSkyrim HD 2k Textures\r\nSkyrim Flora Overhaul\r\nLush Grass\r\nBetter Rocks and Mountains\r\nThe Official HD texture DLC\r\n\r\nAnd too many others to name...\r\n\r\n__________\r\nInstallation:\r\n\r\nUnzip and place all files inside your Skyrim/Data folder.\r\n\r\n___________________\r\nOther Mods by Author:\r\n\r\nGuan Yu Follower - The Three Kingdoms ( http://skyrim.nexusmods.com/mods/20632 )\r\n\r\nLu Bu Follower - The Three Kingdoms ( http://skyrim.nexusmods.com/mods/21088 )\r\n___________\r\nFuture Plans:\r\nLu Bu has enough requests that I will probably create him next, and then Zhuge Liang. After that, I will try and fulfill more requests. I will take a few days for each character at least, as I like to playtest them first.",
  "categoryId": "66",
  "version": "1.0",
  "author": "Vegetaspank",
  "createdUnix": "1342636546",
  "updatedUnix": "1342636685",
  "containsAdultContent": false,
  "uploadedBy": "Vegetaspank",
  "primaryFile": null,
  "files": [
    {
      "fileId": "75166",
      "name": "Zhang Fei Follower V1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "654",
      "fileName": "Zhang Fei Follower V1_0-20732-1-0.zip",
      "uploadedUnix": "1342636685",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/90a12c4158194dd9f92a6cb653dee91de062e266d89eb34237292b34a73f61cb/analysis/1407031506/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Zhang%20Fei%20Follower%20V1_0-20732-1-0.zip?fid=75166&ttl=1535789045&ri=8192&rs=8192&setec=826df420496b13ae538a9aaddbf48b71"
    }
  ]
}