{
  "modId": 20751.0,
  "modName": "The Dawnspire",
  "summary": "Adds a multi-functional player home, intended for spellcasters",
  "descriptionHtml": "[youtube]FvDZXMCwyB0[/youtube] [youtube]U677WMdb-aI[/youtube]\r<br />[youtube]QWQyLLnBvec[/youtube] [youtube]1jtTtIBXUeE[/youtube]\r<br />\r<br />================\r<br />\r<br />Dropping a comment and/or endorsing the file encourages me to continue working on the mod.\r<br />\r<br />================\r<br />\r<br />Before asking any questions, please read the description (or use Ctrl+F). The answer is probably in there somewhere. Its faster than having to wait for me to reply.\r<br />\r<br />================\r<br />\r<br />[b]Features:[/b]\r<br />- Medium/big sized home with simple design, near impossible to get lost.\r<br />- Teleport system to move around between floors.\r<br />- A guest quarter for your followers.\r<br />- Enough Mannequins, Weapon/Dagger/Shield Racks to suit your needs.\r<br />- 25 Bookshelves (Room for 1100 books&#33;)\r<br />- Dragon Priest Mask Busts.\r<br />- Crafting area with all crafting stations\r<br />- A Garden with various alchemy plants. Respawns every 3 days.\r<br />- Auto-sorting Storage System: Dump your stuff in the Void Storage Containers and watch how it magically sorts itself&#33;\r<br />- Auto-Storing: Store your Soulgems, Ingredients, books and crafting materials instantly&#33;\r<br />- Crafting Auto-Loot: When you activate any crafting station, you will automatically loot the corresponding chest. Items will be returned when you exit.\r<br />- New npc&#39;s: Each member of the Dawnspire have their own story to tell (enable subtitles). They also buy and sell stuff.\r<br />- Enthralled maiden: Vampires can find this sleeping treat in the basement. Respawns after 5 days.\r<br />- Recall spell: Teleports you back to the Dawnspire. If cast within the Dawnspire, you will teleport back to your original location\r<br />- Remote Void Storage Access: Are your bags full? Dump all the crap into the Void Storage from anywhere in the world&#33;\r<br />- Imprison: Send a weakened foe into one of the Dawnspire Prison cells.\r<br />- MCM support. Change settings from anywhere in the world.\r<br />- If [url=http://skyrim.nexusmods.com/mods/8535][b]Psijic Teleport Spells[/b][/url] and/or [url=http://skyrim.nexusmods.com/mods/15209][b]Reflection Ward[/b][/url] are installed, spell tomes will be placed in the library. Neither of these files are required for the mod to work, nor should load order matter.\r<br />\r<br />And more...\r<br />\r<br />[b]Dragonborn plugin:[/b]\r<br />- Adds four more busts to display Dragonborn Priest Masks.\r<br />- Adds a room in the dungeon where you can store your Black Books.\r<br />\r<br />================\r<br />\r<br />[b]Location:[/b]\r<br />Above Fellglow Keep, between Windhelm and Whiterun. You have to complete a short quest before you gain access to the tower.\r<br />\r<br />================\r<br />\r<br />[color=#B0F6FE][b]The Arcane Grimoire Explained:[/b][/color]\r<br />The Arcane Grimoire is a static object located in the Library. When Activated, you can empower one magical skill, learn spells or change settings.\r<br />- When you empower a skill, all spells of that school gains a 10% magnitude and duration increase, and cost 10% less magicka to cast. This buff lasts until it is replaced.\r<br />- The tome can teach you Recall and Void Storage, the latter requires one of the five spell schools to be above level 30.\r<br />- Settings include turning on and off the Auto-loot, Auto Storing and Auto-sorting systems, as well as the option to prepare the mod for uninstallation. You can also choose to disable autosave when using Recall.\r<br />\r<br />[color=#FFC555][b]The Autosort System Explained:[/b][/color]\r<br />Whenever you dump something into a [i]Named Container[/i] (e.g Enchanted Wardrobe, Void Storage), items will automatically be sorted into containers. If you try to add [i]Iron Arrows[/i] into the [i]Potion Chest[/i], they will be sent to the [i]Arrow Chest[/i].\r<br />All special containers are placed at various locations inside the spire. Weapons and armor will end up in the armory, while ores and ingots will end up near the crafting stations. Anything that doesn&#39;t have a specific container assigned to it will end up in the Miscellaneous Chest.\r<br />Some Void Storages have a [i]Void Storage Pullbar[/i] nearby. Pulling it drags every container-stored item into that specific Void Storage Box. Pull it again to sort them again.\r<br />The Auto-sort System can be disabled for non-Void Storage Containers by changing the settings using the Arcane Grimoire in the Library.\r<br />\r<br />[color=#FFC555]Container Locations:[/color]\r<br />Private Quarter: Miscellaneous Items, Gems, Jewelery, Clothing, Food.\r<br />Armory: Light Armor, Heavy Armor, Weapons (including bows, shields and staffs), arrows.\r<br />Library: Soul Gems, Books\r<br />Garden: Potions, Poisons, Ingredients\r<br />Dungeon/Basement: Ingots, Ores, Leather\r<br />\r<br />\r<br />[color=#B0F6FE][b]The Crafting Auto-Loot system Explained:[/b][/color]\r<br />Every time you activate a workbench, the corresponding chest will automatically be looted (e.g. activating an Enchanting Table will loot the Soul Gem Chest). Once you are done crafting, all items added will be re-sorted. All crafting stations have a Void Storage Box nearby. The Auto-Loot System can be disabled by changing the settings using the Arcane Grimoire in the Library.\r<br />\r<br />\r<br />[color=#FFC555][b]Imprison Explained:[/b][/color]\r<br />Pick up the Imprison Spell Tome in the Dungeon (located on a table in the prison area). This is a Lesser Power that  allows you to send any enemy with less than 25% health to one of the four big prison cells.\r<br />Placed next to the Spell Tome is the Research Journal. Activating it allows you to choose a skill to research. The default Research path is Alchemy, but can be set to any magic school. While you are gone, your necromancer will preform wicked experiments on the prisoners and after 2 days they will die. Their level is then converted into Skill Experience for your current research path and any items they might have had on them are sent into the void storage. To gain the accumulated experience, return to the research journal and choose the Improve Skills option. To level a skill from 15-100 requires about 15.000 levels from prisoners.\r<br />\r<br />[color=#B0F6FE][b]The Soul Gem Merger Explained:[/b][/color]\r<br />After placing soul gems into the merger, it will merge three empty gems to create a one-tier higher gem (3 petty &gt; 1 lesser etc). You can also create Black Soul Gems by adding a Daedra Heart and a Grand Soul Gem\r<br />\r<br />Placing Azura&#39;s Star, or the Black Star in its holder above the chest adds a few more options:\r<br />- You can merge filled gems.\r<br />- You can create unbreakable Black and Grand soul gems. Full recipe for this can be found in a book placed next to the merger.\r<br />- If Azura&#39;s Star is placed, there is a 50% chance that the merging process only consumes two soul gems, instead of three. In addition, you create 2 Unbreakable Grand soul gems, instead of one. \r<br />- If the Black Star is placed, no Daedra Heart is required to create Black Soul Gems. In addition, you create 2 Unbreakable Black Soul Gems, instead of one. \r<br />\r<br />[color=#FFC555][b]The Atronach Forge Explained:[/b][/color]\r<br />It is the same as the vanilla version, but if you are not familiar with it here&#39;s how it works.\r<br />- Find one of the Atronach Forge Recipes (The nearby vendor sells two random recipes)\r<br />- Dump the items listed into the container located in the flames.\r<br />- Pull the nearby pullbar.\r<br />- Something is conjured upon the altar. It could be an item or a hostile foe.\r<br />\r<br />Some recipes are encrypted and written in daedric letters. Good thing there&#39;s a book nearby that can help you translate. Another thing about encrypted recipes is that they do not work until you repair the forge by placing a certain item into the pedestal. I won&#39;t spoil what it is.\r<br />\r<br />\r<br />[color=#B0F6FE][b]The Greater Welkynd Stone Explained:[/b][/color]\r<br />Quote from a [url=http://elderscrolls.wikia.com/wiki/Magic_from_the_Sky]lore book[/url]-.\r<br />[quote]Great Welkynd Stones are exceptionally large pieces of enchanted meteoric glass. Scholars believe that at the heart of each ancient Ayleid city, a Great Welkynd Stone was the source of the settlement&#39;s magical enchantments. It may be that these great stones were linked to the lesser stones, restoring and maintaining their power.[/quote]\r<br />\r<br />Placed on a table in the central room in the dungeon is a Filled Welkynd Stone. It acts like a Potion of Ultimate Magicka, restoring you magicka to full once. Before you can use it again, you must re-charge by activating the Greater Welkynd Stone. You can only re-charge it once a day however.\r<br />\r<br />\r<br />[color=#FFC555][b]The Automatic Book Placing explained:[/b][/color]\r<br />There is a chest in the library where all books, notes, letters and scrolls get sorted into. Opening and closing it brings up a menu which gives you four options:\r<br />- [b]Clear and place books:[/b] Clears all shelves, then places books in alphabetical order. Supports Dragonborn, Dawnguard and books from the Books Books Books-mod. Neither is required for the script to work.\r<br />- [b]Place Books[/b]: Places books on empty shelves.\r<br />- [b]Clear shelves[/b]: Removes all books from the shelves and then places them in the chest.\r<br />\r<br />Notes:\r<br />- Books from different mods aren&#39;t merged into one list. This means that books from vanilla Skyrim will be placed first, then books from other mods. This means that all books won&#39;t end up in alphabetical order.\r<br />- You need to open and then close the chest for the options to appear.\r<br />- While the script is working, you cannot use the bookshelves.\r<br />- Only affects the bookshelves in the library. The shelves in the private quarter is left untouched.\r<br />- Incompatible with Unlimited bookshelves.\r<br />- Doesn&#39;t place Notes and Letters.\r<br />\r<br />================\r<br />\r<br />[b]Important info:[/b]\r<br />The auto sorting may break if you are overloading it (thus resulting in deleted items). I&#39;ve dumped hundreds of items inside the system at once without losing a single item, but try not to push it to the limit. If you have a carry weight of 10.000+, dump some of it in and then wait for it to be sorted before adding new items. Sell items you don&#39;t need to one of the merchants.\r<br />\r<br />As a user once put it; As long as you don&#39;t try to break it, it works fine.\r<br />\r<br />I&#39;ve tested every system throughly and it works fine for me. If something goes wrong, it probably has something to do on your end.\r<br />\r<br />================\r<br />\r<br />Quest tutorial:\r<br />- Read the Mysterious note added when the game first launches the mod.\r<br />- Kill a level 7 ice mage hiding in a cave\r<br />- Read the mysterious note again.\r<br />- Enter the Misty Cave\r<br />- Enter the Dawnspire\r<br />- Enjoy your new home\r<br />\r<br />================\r<br />\r<br />Coc IDs:\r<br />_mt : Library/Armory/Private Quarter\r<br />_mtg : The Garden\r<br />_mtb : The Dungeon\r<br />_mtc : Misty Cave\r<br />_mtc02 : Gunde&#39;s Hideout\r<br />\r<br />Quest id:\r<br />_mtmq00\r<br />\r<br />================\r<br />\r<br />Q&A:\r<br />\r<br />[color=#B0F6FE]Q: Do you need Dawnguard for this to work?[/color]\r<br />A: No.\r<br />\r<br />[color=#B0F6FE]Q: Do I need a mod that changes amount of followers for the recall to work?[/color]\r<br />A: No.\r<br />\r<br />[color=#B0F6FE]Q: The quest didn&#39;t start.[/color]\r<br />A: Check you quest log. Nothing? See if the mod is activated. There have been reports of the quest not working if you start a new game with the mod installed.\r<br />\r<br />[color=#B0F6FE]Q: No mysterious Note was added to my inventory.[/color]\r<br />A: Use the &#34;player.additem xx012a97 1&#34; console command. replace xx with load order number in hex.\r<br />\r<br />[color=#B0F6FE]Q: I read the note but nothing happened.[/color]\r<br />A: Your game cannot read scripts from .bsa-archives. Get a valid copy of Skyrim.\r<br />\r<br />[color=#B0F6FE]Q: The Misty Cave is dark and I can&#39;t see anything.[/color]\r<br />A: I don&#39;t know, though some users report problems with starting a new game with the mod installed, or by having a follower with you.\r<br />\r<br />[color=#B0F6FE]Q: How do I move around between floors?[/color]\r<br />A: There is a Mage Statue on every floor. Activating the Orbs in its hands sends you up/down one floor. Activating the feet of the statue allows you to select a floor, using a menu.\r<br />\r<br />[color=#B0F6FE]Q: How do I get to the roof?[/color]\r<br />A: You have to enter the Private Quarters and use the right hand of the statue. It will take you to the roof. \r<br />\r<br />[color=#B0F6FE]Q: Going through the cave every time is annoying. Pls fix.[/color]\r<br />A: Learn and use the Recall spell. Details above.\r<br />\r<br />[color=#B0F6FE]Q: Why do I have to make clean saves on update?[/color]\r<br />A: Clean saves are only necessary when I make script changes. If you don&#39;t do a clean save, the changes wont take effect.\r<br />\r<br />[color=#B0F6FE]Q: Is the Dremora Blacksmith supposed to be silent?[/color]\r<br />A: Yes. Mages don&#39;t know how to smith, but they do know how to summon minions to do their bidding.\r<br />\r<br />[color=#B0F6FE]Q: I have a great idea. Will you add it to the mod?[/color]\r<br />A: Maybe.\r<br />\r<br />[color=#B0F6FE]Q: Can I imprison Dragons?[/color]\r<br />A: You can imprison anything shorter than 190 in-game units (~8.6 ft). Dragons are usually bigger than that.\r<br />\r<br />================\r<br />\r<br />Known bugs:\r<br />- Sometimes, the re-sorting after using a crafting bench doesn&#39;t trigger. Usually happens if you exit immediately after activating it.\r<br />- The Misty Cave might be dark and you can&#39;t do anything. Read the Q&A.\r<br />\r<br />================\r<br />\r<br />[b]Installation:[/b]\r<br />Download with NMM\r<br />or\r<br />Extract into Skyrim Folder\r<br />\r<br />[b]Uninstallation:[/b]\r<br />- Start the game and load your latest save. Enter the spire and activate the Arcane Grimoire in the Library\r<br />Select Settings-&gt;Uninstall-&gt;Yes. This will prepare the mod for uninstallation.\r<br />- Pickup all your items within the spire. Any item left behind will be removed when the mod is removed.\r<br />- Move outside and save\r<br />- Use NMM to disable and unistall the mod, or remove all associated mod files\r<br />\r<br />================\r<br />\r<br />Latest Changes:\r<br />1.0.0:\r<br />- Dialogues added to NPC&#39;s\r<br />- Vampires can use Recall in sunlight.\r<br />- The Enthralled Maiden respawns if killed.\r<br />- Rienna, the general goods merchant, sells two random Atronach Forge Recipes.\r<br />\r<br />1.0.1:\r<br />- Removed debug messages from the scripts.\r<br />\r<br />\r<br />Full changelog can be found by clicking the &#34;Latest Version&#34;- link beneath the screen shots.\r<br />\r<br />================\r<br />\r<br />\r<br />Make your voice heard&#33; Provide feedback and help me improve the mod further.\r<br />\r<br />================\r<br />\r<br />Special thanks:\r<br />- Bethesda\r<br />- The skyrim modding community\r<br />- The guys on UESP and Elderscrollswiki\r<br />- Selyb for helping me with the bookplacing script.\r<br />\r<br />===============",
  "categoryId": "67",
  "version": "1.2.1",
  "author": "Sjogga90",
  "createdUnix": "1342662074",
  "updatedUnix": "1363190384",
  "containsAdultContent": false,
  "uploadedBy": "Sjogga",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88286",
      "name": "Dawnspire_1_0_0",
      "version": "1.0.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8925",
      "fileName": "Dawnspire_1_0_0-20751-1-0-0.zip",
      "uploadedUnix": "1347575560",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/c5f75c661b39b77908bc18eb7afd10ef70bc60f1ad0aa24d5c4b4264878bd894/analysis/1407163693/",
      "changelogHtml": " Dialogues added. Now each NPC has their own story to tell. <br/> \n Vampires can use the recall spell in sunlight. <br/> \n Rienna, the general goods merchant now sells recipes for the atronach forge. <br/> \n Filesize reduced. <br/> \n Added a re-usable Welkynd Stone. It restores all your magicka and must be recharged before it can be used again. <br/> \n The Enthralled Maiden respawns after five days. <br/> \n If the Reflection Ward and/or Psijic Teleport Spells mods are installed, spell tomes will be placed in the library. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnspire_1_0_0-20751-1-0-0.zip?fid=88286&ttl=1535789087&ri=8192&rs=8192&setec=33458dbbd16de3e8aeab7bd4f2b05005"
    },
    {
      "fileId": "88577",
      "name": "Dawnspire_1_0_1",
      "version": "1.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8925",
      "fileName": "Dawnspire_1_0_1-20751-1-0-1.zip",
      "uploadedUnix": "1347708002",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/84c27f9decd1626e353e791b0bfc21d78600bcc6ef6bef1dee78669c43cba7ea/analysis/1407166694/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnspire_1_0_1-20751-1-0-1.zip?fid=88577&ttl=1535789088&ri=8192&rs=8192&setec=014c3cb3ff1047b92db7315b264fa5ab"
    },
    {
      "fileId": "89519",
      "name": "Dawnspire_1_1_0",
      "version": "1.1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9711",
      "fileName": "Dawnspire_1_1_0-20751-1-1-0.zip",
      "uploadedUnix": "1348143201",
      "modVersion": "1.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ce9df63f51dd4bdaaafba4a5d60818988ea74360a7c0253d5f58420adf52d9c3/analysis/1407176838/",
      "changelogHtml": " Roof access enabled. You enter it from the Private Quarter. <br/> \n Barracks for followers added. <br/> \n Auto storing option added to Void Storage Containers. Can be disabled i the Arcane Grimoire. <br/> \n Weapon Chest renamed to \\\"Weapons and Shields\\\" <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnspire_1_1_0-20751-1-1-0.zip?fid=89519&ttl=1535789088&ri=8192&rs=8192&setec=e4c39a7171e7b3dac55b45a090ab0421"
    },
    {
      "fileId": "90198",
      "name": "Dawnspire_1_1_1",
      "version": "1.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9712",
      "fileName": "Dawnspire_1_1_1-20751-1-1-1.zip",
      "uploadedUnix": "1348484242",
      "modVersion": "1.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c14c7b71c854a168c382a63c28962536bab228628937d37df96754c4813b865b/analysis/1407184519/",
      "changelogHtml": " Minor bugfix with the roof-teleporter not removing the teleport animation from your character. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnspire_1_1_1-20751-1-1-1.zip?fid=90198&ttl=1535789089&ri=8192&rs=8192&setec=f1740a2973db3c0980359c3dfc861b90"
    },
    {
      "fileId": "1000015111",
      "name": "Dawnspire_1_2_0",
      "version": "1.2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9440",
      "fileName": "Dawnspire_1_2_0-20751-1-2-0.zip",
      "uploadedUnix": "1362442106",
      "modVersion": "1.2.0",
      "virusScanUrl": "https://www.virustotal.com/file/23e46c242cc74f05f96e6a62110c570e3cd99194a6c7ca61e5f65aa5cc4e7238/analysis/1407453130/",
      "changelogHtml": " Changed lightning in the barracks. <br/> \n Improved the sorting script. Thanks to Selyb for helping me with this one <br/> \n Closing the \"Unplaced Books and Scrolls\"-chest gives the option to automatically place books onto the bookshelves. <br/> \n Normalmap for the floor texture fixed. it no longer reflects as much light as it used to. <br/> \n MCM support. <br/> \n Some bugfixes. <br/> \n Optional Dragonborn plugin added. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnspire_1_2_0-20751-1-2-0.zip?fid=1000015111&ttl=1535789089&ri=8192&rs=8192&setec=b61df6f105d5d6805c044132a64c5b7d"
    },
    {
      "fileId": "1000015231",
      "name": "Fallout Who Vegas Tardis Revamped - Exterior ",
      "version": "1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "34",
      "fileName": "Dawnspire_1_2_0-Dragonborn-Plugin-20751-1-2-0.zip",
      "uploadedUnix": "1362497579",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e812ce1e6cedcbc76508794954bbce53d4749bccfdc25b970798034345c6cba2/analysis/1407454008/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnspire_1_2_0-Dragonborn-Plugin-20751-1-2-0.zip?fid=1000015231&ttl=1535789089&ri=8192&rs=8192&setec=98a5ec498414c60cc9e3dfdc5de5b023"
    },
    {
      "fileId": "1000017199",
      "name": "Dawnspire_1_2_1-Dragonborn-Plugin",
      "version": "1.2.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "34",
      "fileName": "Dawnspire_1_2_1-Dragonborn-Plugin-20751-1-2-1.zip",
      "uploadedUnix": "1363190274",
      "modVersion": "1.2.1",
      "virusScanUrl": "https://www.virustotal.com/file/e75317434a359040eaed6fc0d5e02183419d9df6e5c663885115cb37a2c2e578/analysis/1407467471/",
      "changelogHtml": " - Fixed some misplaced architecture. <br/> \n - Fixed errors. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnspire_1_2_1-Dragonborn-Plugin-20751-1-2-1.zip?fid=1000017199&ttl=1535789090&ri=8192&rs=8192&setec=e0d72139355f9ecefa3ed06b1f1bb356"
    },
    {
      "fileId": "1000017201",
      "name": "Dawnspire_1_2_1",
      "version": "1.2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9440",
      "fileName": "Dawnspire_1_2_1-20751-1-2-1.zip",
      "uploadedUnix": "1363190384",
      "modVersion": "1.2.1",
      "virusScanUrl": "https://www.virustotal.com/file/ba68937c75853e64d443ae067142e25dcc604b0ae1ca6ff4afae9dba629d0296/analysis/1407467576/",
      "changelogHtml": " - Fixed some misplaced architecture. <br/> \n - Fixed errors. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnspire_1_2_1-20751-1-2-1.zip?fid=1000017201&ttl=1535789090&ri=8192&rs=8192&setec=7a68695e91f308903bd22450224bf6b8"
    }
  ]
}