{
  "modId": 20752.0,
  "modName": "Rayeks End - Mini Hideout - Spanish",
  "summary": "Una traducción al español del mod Rayeks End, una pequeña guarida en las inmediaciones de Cauce Boscoso.",
  "descriptionHtml": "RAYEKS END SPANISH TRANSLATION v05 - DOUBLE BED VERSION\r\n--------------------------------------------------------------------------------------\r\n\r\n1. DESCRIPCIÓN\r\nEsta es una versión en español del genial mod [url=http://skyrim.nexusmods.com/mods/16028]Rayeks End[/url] en su versión de cama doble. La instalación del mod original es necesaria pues esta traducción sólo contiene un .esp\r\n\r\n2. INSTALACIÓN\r\nPrimero de todo ES IMPORTANTE INSTALAR EL MOD ORIGINAL, cuyo enlace está más arriba. Una vez instalado, abre el archivo comprimido y mueve el archivo RayeksEnd.esp a tu carpeta \\\"Data\\\" de Skyrim. Sobreescribe si es necesario y actívalo en la lista de mods. ¡Y a jugar! También puedes dejarle el trabajo al NMM si eres así de perezoso.\r\n\r\n3. NOTAS\r\nNo estoy seguro de si el mod está limpio, pero por lo que he ido probando, no he visto ningún error. Como mucho, os encontraréis con algún renombrado de algún item o mueble por uno que, si bien no es la traducción que le pusieron los traductores oficiales, es muy similar y no empeorará para nada tu experiencia de juego. Es posible también que haya movido muebles de la guarida algunos píxeles a algún lado, pero si lo he hecho, no se nota. De cualquier forma, si encontráis un error de este tipo que no esté presente en la versión original, avisadme y lo cambiaré en cuanto pueda.\r\n\r\nOtra cosa es también la traducción. Si veis algo que está mal traducido o podría estar mejor traducido (la verdad es que ni a mi me convence mucho lo de \\\"Final de Rayek\\\", pero no se me ocurría nada mejor), avisadme y lo cambiaré.\r\n\r\nSi en cualquier momento Rayek publica una nueva versión, trataré de actualizar el mod lo antes posible para subirlo aquí.\r\n\r\n4. CRÉDITOS Y PERMISOS\r\nTodos los créditos van para Rayek, por crear el mod original y ser tan genial. Si quieres hacer una modificación, tanto de la versión traducida como de la original, debes pedirle permiso a él, no a mi.",
  "categoryId": "67",
  "version": "5",
  "author": "Rayek",
  "createdUnix": "1342666305",
  "updatedUnix": "1342666594",
  "containsAdultContent": false,
  "uploadedBy": "ShironaMKRU",
  "primaryFile": null,
  "files": [
    {
      "fileId": "75238",
      "name": "Rayeks End - Mini Hideout - Spanish v05",
      "version": "05",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "100",
      "fileName": "Rayeks End - Mini Hideout - Spanish v05-20752-05.zip",
      "uploadedUnix": "1342666594",
      "modVersion": "05",
      "virusScanUrl": "https://www.virustotal.com/file/fef0381ee76068dbfe93659895b12893d11f4c31af5198dc77cb1c7d609e65cc/analysis/1407032166/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rayeks%20End%20-%20Mini%20Hideout%20-%20Spanish%20v05-20752-05.zip?fid=75238&ttl=1535789092&ri=8192&rs=8192&setec=f420dbfdf907a0b34fb1512091f22bf1"
    }
  ]
}