{
  "modId": 20780.0,
  "modName": "Nordic Conqueror Armor",
  "summary": "set of lore friendly heavy armor designed for a noble character.\r<br />regal but comfortable at the same time",
  "descriptionHtml": "Hi guys why wait another day? here is my second mod and my second work in blender\r<br />this time i focused more on the texture part so you have a completely new texture for the torso armor.\r<br />\r<br />\r<br />\r<br />\r<br />WHAT THE MOD DOES\r<br />basically the mod gives you a new set of heavy armor created for a noble character\r<br />the set is composed by:\r<br />the nordic conqueror armor torso\r<br />\r<br />- the nordic conqueror boots\r<br />\r<br />- the nordic conqueror gauntlets\r<br />- the nordic conqueror helm\r<br />(the helm you see in the screenshots)\r<br />- the nordic conqueror journey cape\r<br />\r<br />\r<br />the armor is fully compatible with all the cape and accessory mods like Bandolier bags and pouches, WIC cloacks of skyrim, Northborn fur hoods.\r<br />\r<br />i highly recommend you to use the heverglmir armor retextures for the hide armor skirt, it matches way more with the armor color pattern: http://skyrim.nexusmods.com/mods/3261\r<br />\r<br />and use it with muscular characters, the armor is quite bulky\r<br />\r<br />VIDEOS\r<br />[youtube]U677WMdb-aI[/youtube] [youtube]k0V5uDmyr5A[/youtube]\r<br />TO DO THINGS\r<br />-non human race compatibility for the helm\r<br />\r<br />WHERE TO FIND IT\r<br />the armor is located near the HELA&#39;S FOLLY, it can be found on the dead body of his previous owner King adgar the old in a camp tend.\r<br />the map image of the location is in the image section of the mod.\r<br />you will not be alone in the location, some leveled enemies are waiting for you so bring a good weapon with you.\r<br />in the dead body&#39;s inventory you will also find a journal with the story behind the armor and the king.\r<br />\r<br />HOW TO INSTALL\r<br />the mod installation is simple, just drop the rar content into your data folder\r<br />\r<br />CREDITS\r<br />- the armor skirt comes from the blue stripes commando armor from the game &#34;the witcher 2&#34; created and developed by CDProjekt, meshes and textures belong to CDProjekt and the skyrim port and the rigging of the armor was made by TH3WICK3D1 (big thanks to him here is the original mod link: http://skyrim.nexusmods.com/mods/7807)\r<br />- the armor gauntlets texture, the helm textures and the torso bease textures come from the ornate steel plate retexture by PhilSchmidheiny (thanks to him for his resource :http://skyrim.nexusmods.com/mods/12363)\r<br />- the dagger and the stripes for the boots come from the letho armor from the game &#34;the witcher 2&#34; created and developed by CDProjekt, meshes and textures belong to CDProjekt and the skyrim port and the rigging of the armor was made by L0rd0fWar (thanks to him for his work: http://skyrim.nexusmods.com/mods/5588)\r<br />- the hood meshes and textures come from  the northborn&#39;s fur hoods, thank to him for giving me permission to use his work in this mod : http://skyrim.nexusmods.com/mods/3201\r<br />- the original draw of the torso plate was made by an artist called Lorenz Frølich (http://en.wikipedia.org/wiki/Lorenz_Fr%C3%B8lich) and represents the sacrifice of odin\r<br />- the other meshes and textures and assets belong to BETHESDA SOFTWORKS, thanks to this great company that continues to give us enjoyment and awesome games.\r<br />\r<br />SPECIAL THANKS\r<br />thanks to all who supported me during this process:\r<br />- Natterforme for giving me so much good advices and for helping me with the creation of the king&#39;s journal (the kudos to him was given by me a lot time ago :D)\r<br />-Omesean for helping me so much and giving me so much good advices but first of all for entertaining and giving me so much good times during our biology converstions :) kudos to him so much time ago :D\r<br />- Cabal120 for helping me so much with the normal mapping of the new textures, if it was not for him you would not have such a good detail enhancement. grazie mille Cabal&#33; il kudos te l&#39; ho già dato :D e spero di poter diventare bravo quanto te, continua col tuo grande lavoro&#33;\r<br />- Namaste911 for giving me so much good advices and for giving me the splendid screenshots you see in the image section, check his profile pictures and you will remain astonished as i remained the first time i saw them :D thank you man&#33;\r<br />-patobek for the rendering of the armor, thanks to him for the gift&#33; go check his wips and amazing works\r<br />\r<br />thanks to all the guy who commented on the forum thread and gave me advices and suggestions, they are so much could not remember everybody.\r<br />also i want to ask sorry to all those guys i asked permissions before i radically changed the project concept:\r<br />-isilmeriel with her great LOTR Weapon Collection: http://skyrim.nexusmods.com/mods/5727\r<br />-yuril with his better circlets mod: http://skyrim.nexusmods.com/mods/6495\r<br />\r<br />\r<br />PERMISSIONS\r<br />as always if you want to use the armor in your mod pm me and i will gladly give you permission to use it.\r<br />regarding the translation permission, i will give permissions to the first guy/girl who will send me pm in order to not create unpleasant situations like those i&#39;ve created when i released the nordic hunter light armor.",
  "categoryId": "54",
  "version": "1.0",
  "author": "FrankDema",
  "createdUnix": "1342710183",
  "updatedUnix": "1342710878",
  "containsAdultContent": false,
  "uploadedBy": "frankdema",
  "primaryFile": null,
  "files": [
    {
      "fileId": "75316",
      "name": "nordic conqueror armor ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25450",
      "fileName": "nordic conqueror armor -20780-1-0.rar",
      "uploadedUnix": "1342710878",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b3c16bb4a2dbc08ca1271f7facae1bfbc5a51f444d552e4340189f0f06f64b79/analysis/1407033252/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/nordic%20conqueror%20armor%20-20780-1-0.rar?fid=75316&ttl=1535789131&ri=8192&rs=8192&setec=fb8682caa66a8e015ab1be50364c4e36"
    }
  ]
}