{
  "modId": 20794.0,
  "modName": "More Magic elements in Skyrim",
  "summary": "Have you ever though that 3 elements is not enough? Then this mod is for you&#33; Use the power of the light, water, wind, earth, shadow, gravity and many more&#33;",
  "descriptionHtml": "[size=+2]Important&#33;[/size]\r<br />Hello everyone, i am really sorry that i can&#39;t continue the mod anymore, but be free to do so&#33; you can use any thing from the mod for your own mod, or continue it. Just remember to credit\r<br />\r<br />\r<br />First of all sorry for my english, my english teatcher was the games i played so you will find many gramatic errors.\r<br />[size=+2]Introduction[/size]\r<br />This mod Change skyrim magic system by adding 6 elements, each one with an opposite side. Those elements are based on collors, to make it more simple and pratic.\r<br /> Also this is just the start of the mod, if you like the spells and want to see more of them, please endorse and give feedback, this will make the mod progress, and is just One button pressed to endorse.\r<br />[size=+1.5]Integration with my other mods[/size]\r<br />If you play with my other magic mods The spells they have will have an element here, and work like any other element spell, but for that you need the other mods as well.\r<br />For [color=red]Blood Magic in Skyrim[/color] for example, you will find that blood magic is considered an Red element here, and can be used like others red spells.\r<br />If you like Chrono Cross, then also try my other mod [url=http://skyrim.nexusmods.com/mods/23763]Swallow in Skyrim[/url]\r<br />[size=+2]Description[/size]\r<br />Each element has an oposite element, the elements are represented by collors to make easier to play. the elements are the following\r<br />\r<br />[color=White]White[/color]: - The element color associated with Light, life and Sky.\r<br />The opposite element is...\r<br />[color=Black]Black[/color]: - The element color associated with Shadow, Death and Gravity.\r<br />\r<br />[color=Red]Red[/color]: - The element color associated with Fire, health, Strength and Blood\r<br />The opposite element is...\r<br />[color=Dodgerblue]Blue[/color]: - The element color associated with Water and Magicka\r<br />\r<br />[color=Green]Green[/color]: - The element color associated with Air, Stamina and Nature\r<br />The opposite element is...\r<br />[color=Yellow]Yellow[/color]: - The element color associated with Earth, Electricity and Resistance.\r<br />lets say you meet an undead opponent, which element is black,  if you use white element, the effect will be 25% stronger.\r<br />so it is\r<br />[color=White]O[/color]X[color=Black]O[/color]\r<br />[color=Red]O[/color]X[color=Blue]O[/color]\r<br />[color=Green]O[/color]X[color=Yellow]O[/color]\r<br />[size=+2]Races Elements[/size]:\r<br />Each Race have an element or 2.\r<br />Each element a race have, provide 25% element potence, 25% element resistance and 25% opposite element weakness.\r<br />An Khajit for example, have 25% bonus magnitude and resistance for yellow element, but is 25% more vulnerable to Green elements. \r<br />Khajit: Yellow, as they live in the sands of elsewyr.\r<br />Nord: Blue, as they live in the cold of skyrim.\r<br />Argonian: Green and Blue, as they live in the swamp of black march\r<br />Redguard: Red and yellow, as they live in the hot desert of hammerfell\r<br />wood elf: Green, as they live in the woods\r<br />High elf: white and Yellow, as they like high things.\r<br />Dark elf: Dark and Red, as they have an dark past and live in the near a Vulcan\r<br />Orc: Red, as they are strong\r<br />Imperial: White as they have multiple origins\r<br />Breton: White and Black, this way they have no magic weakness, but no magic gain.\r<br />In the future, peharps i make vampires have Black element\r<br />Also i strong recomend the player to start a new game to make the mod work 100%, or at least use the console command SHOWRACEMENU to change the race,(you can go back to the original race, but you need to change at least if you are male or female, then you can go back to the original settings)\r<br />\r<br />[size=+1,5]Robes[/size]\r<br />Each robe set will give you 25% elemental resistence for an element, but lower 25% resistence for the oposite element, All robes color are done.\r<br />To add the robes use the console command HELP(space, then robe color here) and PLAYER.ADDITEM (after 1 space put the item code here)\r<br />[size=+2]Spells done[/size]\r<br />[color=Yellow][size=+1.5]Yellow Element[/size][/color] as Yellow Spells are associated with earth and Eletricity, they will inflict negative effects like encumbering, slowing down and lower resistance.\r<br />[color=Yellow]LoRes[/color]: Temporarily decreases your opponent&#39;s defense by 25% for 60 seconds\r<br />[color=Yellow]HiRes[/color]: Temporarily Increases your damage resistance for 60 seconds\r<br />[color=Yellow]lighting ball[/color]: Form an ball of concentrated electricity and shoot at your enemies. Damage: 100 Area: 20\r<br />[color=Yellow]Electro Sphere[/color]: Shocks enemy with an electrical discharge\r<br />[color=Yellow]Earth Quake[/color]: Quake the soil, knocking back any one near the targeted area.\r<br />[color=Yellow]ThundaStorm[/color]: ThundaStorm\r<br />[color=Red][size=+1.5]Red Element[/size][/color] Red Spells are assosiated with fire, health and blood, red spells can make enemies flee when on fire and taking damage over time, and lower the strength.\r<br />[color=Red]Ignite weapon[/color]: call the fire to ignite your weapon for a minute. cost 100mp\r<br />[color=Red]Strengthen[/color]: The Vigor of the fire pass to you. you do 25% more damage for 2 minutes. cost 0 for now. later change this.\r<br />[color=Red]Weaken[/color]: The fire steal your enemy strength, temporally decreasing his attack power by 25% for 2 minutes. cost 0 for now, change that later.\r<br />[color=Red]Fire Bomb[/color]: Launch an concentrated Fire Bomb that explode stunning enemies. cost 60Mp, deal 40 Hp per 5 seconds.\r<br />[color=Red]Plasma Beam[/color]: Shot an super hot beam of pure molten energy\r<br />[color=Green][size=+1.5]Green Element[/size][/color] As Green spells involve The wind and the nature, and stamina, green spells inflict negative effects like Poison, paralyze, Stagger, Knocking the foe from ground, damaging stamina or stamina regeneration. \r<br />[color=Green]Aero Blast[/color]: Shoots a concentrated Wind blast at your enemy, throwing him away from the ground.  while damaging 50 points of stamina. Cost 75/s\r<br />[color=Green]Haste[/color]: Call the wind to Haste your weapon for a minute. cost 100 Mp\r<br />[color=green]Force of Nature[/color]: Evolve the nature force into your hands, to  fortify unarmed damage for an minute.\r<br />[color=Green]Call of the wind[/color]: Call the wind to lend you his speed, but as long you have the speed, your stamina will stay low.50% + speed&#92;200 less stamina.\r<br />Toggable\r<br />[color=Green]Bushwhaker[/color]: Slices enemy with a cloud of whirling leaves. inflicting poison\r<br />[color=Dodgerblue[size=+1.5]Blue Element[/size][/color] Blue Spells, begin related with water, ice and magicka regeneration, will Deal negative effects like stoping enemy magicka regen for 10 seconds, chance of freezing him, and other effects that will come with time.\r<br />[color=Dodgerblue]Aqua Ball[/color]: Hurls a large sphere of water at opponent. Deal 100 Hp for 2 seconds and cost 75MP\r<br />[color=Dodgerblue]Aqua Beam[/color]: Blasts enemy with high-pressure water stream.\r<br />[color=Dodgerblue]Ice Blast[/color]: Freezes your foe in a cage of ice an then break it, dealing blue damage.\r<br />[color=Dodgerblue]Rain[/color]: Causes an magical Rain anywhere, making blue element spells stronger.\r<br />[color=Black][size=+1.5]Black Element[/size][/color]\r<br />[color=black]Gravity Blow[/color]: Form an circle of dark energy and blast your foes with an enormous gravity force. Best used at close distance. cost 100\r<br />[color=black]Gravitonne[/color]: Crushes enemies with a super-gravity field, making hard to stand up and dealing black damage over time.\r<br />[color=black]Free Fall[/color]: Throw enemies at the Sky and Drop them at supersonic speed.\r<br />[color=black]Helll Soul[/color]: Attempts to remove the soul from enemy&#39;s body and send to oblivion. 5% chance of succeed.\r<br />[color=black]Helll Bound[/color]: Sends your enemy on a trip to oblivion. 15% chance of succeed, otherwise, the foe will be traumatized by the experience.\r<br />[color=black]Black Hole[/color]: Pull any one near the hole to the void. While this make impossible to retrieve any item, is an easy way of dealing with your foes.(in the future, it will pull every one near the area inside the hole.)\r<br />[color=black]Dream Devourer[/color]: Devour the mind of your foes when they are sleeping.\r<br />[color=black]Diminish[/color]: Magic potency of every one in the area is Reduced by 50% for 2 minutes\r<br />[size=+1.5]White Element[/size]\r<br />[color=White]Photo Beam[/color]: Shot an concentrated photon beam damaging your opponents. as was said, this spell shoot an beam, damage 15HP per second and cost 55Mp per Second, depending on you destruction level.\r<br />Light Sword: Launch an Light sword at the enemy. cost 60 mp\r<br />Meteorite: Drops a comet down on an unsuspecting foe&#39;s head.(only work in open sky)\r<br />Meteor Shower: Hurl several asteroids at the enemies, inflicting white damage. Only work in open sky.\r<br />Revive: Fully revive the target if is dead.\r<br />Magnify: Magic potency of every one in the area is powered up by 50% for 2 minutes(including yours)\r<br />[size=+1,5]Auras[/size]\r<br />Auras are toggable spells, which means you can activate and deactivate at any time. You can only have One Aura active at once. The Auras work according to the element its belong, there is one aura for each element for now, but later i may make auras with special effects. Those auras will increase attributes of the element and Seal opposite elements, for example, while using White Aura, you will be unable to cast Black element spells.\r<br />[color=Yellow]Yellow Aura[/color]: Increased Damage Resistence and yellow element resistance, decrease green element resistance and seal green elements. Yellow elements are stronger\r<br />[color=Red]Red Aura[/color]: Atack Strength Is increased by 25%. Red element Strength is increased by 25%. Red element Resistance is increased by 25%. Blue element resistance is decreased by 25%. Blue element is Sealed\r<br />[color=Green]Green Aura[/color]: Increase movement Speed by 25%, Increase Green element magnitude by 25%, Increase Green element resistance by 25%, Decrease Yellow element resistance by 25% Seal Yellow element.\r<br />[color=Dodgerblue]Blue Aura[/color]: Magicka regeneration is 25% faster. Blue element is 25% stronger. Blue element resistance is increased by 25%. Red element resistance is decreased by 25% Red element is Sealed.\r<br />[color=Black]Black Aura[/color]: Magic Magnitude is increased by 25% Black element magnitude is increased by 25%, Black element resistance is increased by 25%, White element resistance is decreased by 25%, White element is Sealed.\r<br />White Aura: Magic Resistance + 25%. White element resistance + 25%, Decrease Black element resistance by 25%, Seal black elements. White elements are 25% stronger\r<br />[size=+2]summons[/size]\r<br />Summons are Special spells that have an requirement to work, for example, an Blue Summon require To be Rain or in a river, while a green require an forest\r<br />\r<br />[color=black]ºskellyº[/color]: Summon the legendary skeleton clown, Skelly to help you.\r<br />Black element. Skelly use Gravity Blow, Black Hole and LoRes.(Currently, skelly is very bugged, he dont use spells and have no requirements to summon, also his clothes don&#39;t fit him very well, otherwise he works fine, but is only an strong skeleton for now.)\r<br />[color=Yellow]ºEarth Golemº[/color]: Call the aid of the Earth Golem. He uses 2 melee attacks and one area attack.\r<br />\r<br />[color=Red] How to Get Them???[/color]: The spells and robes are Temporally located at Dragonsreach, in white run, see the picture showing the location.\r<br />The robes give you protection accord to the color, but also weak you resistance for the opposite element\r<br />[size=+2]Compatibility[/size]\r<br />The spells will work fine, the only issue you may have is with the races, if you use an mod that change some thing in the vannila races.\r<br />Also if you what me to make an compatibility patch, tell me the mod you want and i will ask the author permission to make an patch.\r<br />If you don&#39;t start a new game or change the race,(read description) you will have no elements and most npcs wont have as well, but you can use the console RESURRECT to make the npc have the correct race element.(But this reset they inventory, so be careful)\r<br />[size=+2]Change log[/size]\r<br />0.1: Started the mod, added Photo Beam, Aqua Ball, Aqua Beam, Aero Blast, Haste, Ignite weapon, Strengthen, Weaken, Fire Bomb, Blue, Red, white and green robes.\r<br />0.2: added black and yellow robes, Black hole, Gravity Blow, HiRes, LoRes, Force of nature, Fixed Weaken and strengthen, Fixed white robes, Added elements to races, Added Skelly, small changes i do not remember\r<br />0.3: Model/texture changes in Aqua ball, aqua beam, wind blast, force of nature, haste, and some others. Added Electro sphere, lighting ball, earthquake, earth golem. fixed weaken again.\r<br />other minor changes.\r<br />0.4: Disabled Black Hole temporally, Added Free Fall, gravitonne, Hell soul, bound and trap, Added Bushwacker, added call of the wind, Small changes, forgotten to change important small changes.\r<br />0.5: Changed Spells color order to be in harmony with the Chrono Cross. Added following Auras: Yellow, Red, Green, Blue, Black and White. Changed aqua ball, fixed photon beam, added Meteorite, Meteor Shower, ThundaStorm, Plasma Beam, Dream Devourer, new Black Hole, new Wind Blast, Diminish, Magnify, Rain, Revive and something else i dont remember. Changed Black Robes Textures.\r<br />[size=+2]To come[/size]\r<br />Add an cast effect when casting elements like chrono cross.\r<br />Chrono Cross Inspired Characters.\r<br />Spells suggested by users\r<br />Add elemental magic to npcs.\r<br />Correct spells cost.\r<br />More spells.\r<br />More things.\r<br />Element Combination\r<br />[size=+2]Credits[/size]\r<br />allzero\r<br />EnaiSiaion, the author of Apocalypse Spell Package, For helping me with scripts.\r<br />Square enix for maked chrono cross, the game i used the elements ideas.\r<br />Special thanks to\r<br />moustafasherif, for the constant suggestions in my mods.\r<br />steelbishop, for the sugestions\r<br />Ozi27, for the sugestions\r<br />and all people who commented and/or endorsed this this mod\r<br />\r<br />\r<br />Also Try my other mods\r<br />[color=indigo]Mass effect Biotic Spells[/color]\r<br />http://skyrim.nexusmods.com/mods/20740\r<br />[color=red]Blood Magic in Skyrim[/color]: http://skyrim.nexusmods.com/mods/19534\r<br />White and [color=Black]Black[/color] Daedric armor and weapons retex: http://skyrim.nexusmods.com/mods/11678\r<br />Assassins creed style mage robe\r<br />http://skyrim.nexusmods.com/mods/7755\r<br />Silver and black ebony stand alone set\r<br />http://skyrim.nexusmods.com/mods/16820",
  "categoryId": "75",
  "version": "0.5",
  "author": "allzero",
  "createdUnix": "1342730435",
  "updatedUnix": "1347141278",
  "containsAdultContent": false,
  "uploadedBy": "allzero",
  "primaryFile": null,
  "files": [
    {
      "fileId": "75386",
      "name": "More elements in skyrim",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5755",
      "fileName": "More elements in skyrim-20794-0-1.rar",
      "uploadedUnix": "1342731376",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/a258e2d054a4f9120a1772c9eeba7d026972e6e008c1de5a893249d01d729402/analysis/1407033861/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20elements%20in%20skyrim-20794-0-1.rar?fid=75386&ttl=1535789163&ri=8192&rs=8192&setec=8276dc2fd24f8ee8a21fc7a1bf3de5ca"
    },
    {
      "fileId": "76268",
      "name": "More elements in skyrim 2",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9220",
      "fileName": "More elements in skyrim 2-20794-0-2.rar",
      "uploadedUnix": "1343085552",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/416387695fd3295dc6bfa5ac76e19546a706ccbd6268cc1f92edd79fc63aab94/analysis/1407042127/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20elements%20in%20skyrim%202-20794-0-2.rar?fid=76268&ttl=1535789164&ri=8192&rs=8192&setec=4dfd7de1e172a99469deb78b9bd367b5"
    },
    {
      "fileId": "77448",
      "name": "More elements in skyrim 3",
      "version": "0.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9502",
      "fileName": "More elements in skyrim 3-20794-0-3.rar",
      "uploadedUnix": "1343585393",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/70622361ca64d9f77936786850e1d492d2a6ce543084c0a5001b47e1302a8098/analysis/1407055326/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20elements%20in%20skyrim%203-20794-0-3.rar?fid=77448&ttl=1535789164&ri=8192&rs=8192&setec=b64b01249345faceeaaf13b26f6e53f1"
    },
    {
      "fileId": "78332",
      "name": "More Elements In Skyrim 4",
      "version": "0.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9509",
      "fileName": "More Elements In Skyrim 4-20794-0-4.rar",
      "uploadedUnix": "1343944336",
      "modVersion": "0.4",
      "virusScanUrl": "https://www.virustotal.com/file/9fc05ad3aa9030582760081398dc3da6bdfa41ecaab0fdfb8d3c3550f36796c0/analysis/1407064892/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Elements%20In%20Skyrim%204-20794-0-4.rar?fid=78332&ttl=1535789165&ri=8192&rs=8192&setec=e22bf0d2cc75e38db40fe52464fee384"
    },
    {
      "fileId": "87276",
      "name": "More Magic Elements In Skyrim 5",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13026",
      "fileName": "More Magic Elements In Skyrim 5-20794-0-5.rar",
      "uploadedUnix": "1347141278",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/26cbf30ba44df5628619cb34aea58f92e851d048f00453791ccb2f6352d9f7a3/analysis/1407154226/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Magic%20Elements%20In%20Skyrim%205-20794-0-5.rar?fid=87276&ttl=1535789165&ri=8192&rs=8192&setec=770d2fcb304bb7191d0ef83cf5322ecb"
    }
  ]
}