{
  "modId": 20830.0,
  "modName": "Domkavosh the Betrayer - A Follower Mod",
  "summary": "A powerful Dragon Priest companion designed to be more useful than the vanilla followers. This fearsome mage companion has a unique skin and a variety of spells at his disposal. If you can\\'t stand the vanilla followers check this one out.",
  "descriptionHtml": "Lore\r\n====\r\nDomkavosh was ranked amongst the most powerful dragon priests, and \r\nfor dragons, power equaled truth. When man rebelled against the \r\ndragons, he began to doubt this truth upon witnessing the mass \r\nslaughters of men at the beginning of the Dragon War. Seeing such \r\nblatant abuse of their power, he revolted against the dragons. \r\nMore specifically, he rebelled against the very dragon that granted \r\nhim the power in the first place, Alduin. Domkavosh confronted \r\nAlduin, but despite his best efforts Alduin defeated him. Instead \r\nof killing Domkavosh, Alduin imprisoned him forever mocking his feeble \r\nrebellion. His name became forbidden and was lost to the ages except \r\nfor one small remenant etched upon his prison: \\\"Domkavosh the Betrayer.\\\" \r\n\r\nStory\r\n=====\r\nWhile adventuring through the mountains in your hunt for dragons \r\nyou see an unusual nordic ruin off in the distance. As you approach \r\nthis ruin its guardian awakens, the Shade of Alduin. As the guardian\r\nbegins its attack, a dragon priest also emerges from a coffin at the \r\ncenter of the ruins. Instead of attacking you it begins firing off \r\nwaves of spells at the guardian. Team up with this dragon priest to \r\nkill this fragment of Alduin, and question his intentions later. After the \r\nShade of Alduin is vanquished the dragon priest tells you of his past.\r\nThe only thing he \\\"lives\\\" for now is to kill dragons, will you take him \r\non your adventures to satisfy his lust for revenge?\r\n\r\nChange Log\r\n==========\r\n<Version 1.2>\r\n-Custom faction added which should prevent bounty related hostilities.\r\n\r\n<Version 1.1>\r\n-Added Master Level Lightning Storm spell (is able to move while casting it)\r\n-Added Expert Level Conjure Dremora Lord for variety at higher levels\r\n-Added Twin Souls Perk\r\n-Removed Sanguine Rose to prevent Twin Souls conflict, and reduce opness at lower levels.\r\n\r\n\r\nDescription\r\n===========\r\nThis is the second in my planned series of new followers.To be honest I \r\nhate most of the vanilla followers. They are not very intelligent, tend \r\nto cause more trouble then they are worth, and lack uniqueness. \r\nAs a result, I made this dragon priest companion which as you could \r\nguess is a mage follower.\r\n\r\n\r\n\r\n<Behaviour>\r\n-When awoken he rises from the coffin like a legitmate dragon priest.\r\n-Amazing Jeebus powers to float on water, sometimes anyhow. If you make him stay in deep water\r\nand he isn\\'t floating already, he will slowly rise up as if to part the sea.\r\n-Combat: Typical dragon priest AI\r\n\t+ Good judgement of enemy weaknesses\r\n\t+ Good at keeping his distance and using cover\r\n\t+ Gains new access to spells as he levels, and has a wide variety too\r\n-Voice he uses is a similar voice to Farenagr (without annoying phrases), uses normal dragon priest sounds\r\n-Does not care about any crime you commit.\r\n\r\n\r\n\r\n<Notable Features>\r\n-Spectral Alduin encounter\r\n-Unique black dragon priest robes (courtesy of Ironman5000)\r\n-Essential Character.\r\n-Few vanilla followers in the game have perks, this follower has several \r\nperks relevant to his combat styles (Improves late game performance and/or \r\nhigher difficulty performance).\r\n-Doesn\\'t set off pressure plate based traps...thats right I\\'m looking at you Lydia\r\n-Due to the small nature of a dragon priest\\'s body he doesn\\'t block doorways as badly\r\n-Levels with player up to level 81 (starts at level 10) without the use of other mods like UFO.\r\n-Equipment & Defense: \r\n\t+ + Can summon Dremora Lords at higher levels to overcome his inability to melee.\r\n\t+ Recommended to only give him cloth gear like archmage robes due to mage armor perk\r\n\t+ 100% resistance to poison (according to UFO stats), 10% magic resistance.\r\n-Spells: Dependant on his skill level.\r\n\t+ Apprentice(lvl 25) Flame Atronach, Fast Healing, Steadfast Ward, Stone Flesh, \r\n\tFirebolt, Ice Spike, Lightning Bolt\r\n\t+ Adept(lvl 50) Frost Atronach, Close Wounds, Greater Ward, Iron Flesh, \r\n\tAll spell cloaks, Fireball, Ice Storm, Chain Lightning.\r\n\t+ Expert(lvl 75) Storm Atronach, Dremora Lord, Ebony Flesh, Incinerate, Icy Spear, \r\n        Thunderbolt\r\n        + Master(lvl100) Lightning Storm\r\n\r\n<Location>\r\n-Make your way through the mountains to Arcwind Point(2 possible paths), see pictures to get an idea of \r\nwhere that is, or use console command \\\"coc arcwindpointexterior0#\\\" (# = 1 - 4)(if you quested enough to \r\nenable dragons there should be a special dragon encounter waiting for you.)\r\n-To awaken him from the coffin just approach it.\r\n-If dismissed he will return to float by the coffin.\r\n\r\nInstallation\r\n============\r\nDrop contents into the Skyrim Data folder, default location:\r\nC:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data\r\n\r\nUninstall\r\n=========\r\n-Remove the DomkavoshCompanion.esp file from the data folder.\r\n-Remove dragon_priest_dark.nif from:\r\nC:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\meshes\\\\actors\\\\dragonpriest\\\\character assets\r\n-Remove dragonpriest_d.dds & dragonpriestdark.dds from\r\nC:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\textures\\\\actors\\\\dragon priest\r\n\r\nCompatibility\r\n=============\r\n-Works with Dawnguard, however he will simply be floating near his coffin when first met\r\n-Works with UFO follower mod, MUST BE LOADED AFTER to work\r\n-Works with Deadly Dragons mod, MUST BE LOADED AFTER to avoid potential conflicts\r\n-Potential issues with any other mods that edit the cell: ArcwindPointExterior03\r\n-If he does not appear try adjusting load orders(I load my companion mods last for highest priority)\r\n\r\nKnown Bugs\r\n==========\r\n\r\n<Minor>\r\n-If injured to the point of near death aka \\\"bleedout\\\" mode he will not recover until \r\nall combat has ceased, after that he is good to go \r\n-Minor animation errors for some spells\r\n-Minor animation error when he switches spells sometimes giving a juggling \r\neffect (looks awesome actually).\r\n-If awoken by an enemy, he rises from the coffin before the lid pops off (Should be fixable upon adding quest).\r\n\r\n<Major>\r\n-None disovered yet\r\n\r\nCredits and Permissions\r\n=======================\r\n-Thanks to Ironman5000 for letting me use his Dark Dragon Priest mod, and for helping me \r\ntrouble shoot.\r\n-Thanks to beretta for inspiring me with his dragon priest companion mod.\r\n-Thanks to Bethesda for releasing the creation kit.\r\n\r\nRecommendations\r\n================\r\n-Check out my other companion mod, Vahrukt the Forgotten.\r\n-Use UFO Follower mod for the friendly fire feature for your own safety. Also useful for seeing skill \r\nlevels to see when he has access to new spells.\r\n\r\nFeedback\r\n========\r\nLet me know if you run in to any bugs not already listed, and provide a \r\ndescription of the situation so that I can replicate the bug for testing. \r\nI\\'d love to hear any suggestions in order to make him the best mage \r\nfollower. If you want to see other useful companions like this then show \r\nyour approval by voting/endorsing.",
  "categoryId": "66",
  "version": "1.2",
  "author": "Domkavosh",
  "createdUnix": "1342804277",
  "updatedUnix": "1343866771",
  "containsAdultContent": false,
  "uploadedBy": "Domkavosh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "75530",
      "name": "Domkavosh Companion",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3296",
      "fileName": "Domkavosh Companion-20830-1.rar",
      "uploadedUnix": "1342804396",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/88c278144c713f3925d194bfd44d72ccca18fb5f50b8663bd4a5ebb1423be5bc/analysis/1407035225/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Domkavosh%20Companion-20830-1.rar?fid=75530&ttl=1535789245&ri=8192&rs=8192&setec=f9835405c689b7251eb9cdd185994bd7"
    },
    {
      "fileId": "76470",
      "name": "Domkavosh Companion v1-1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3296",
      "fileName": "Domkavosh Companion v1-1-20830-1-1.rar",
      "uploadedUnix": "1343172827",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f7c2e87d7ae7fb49910b7745b630ca03f243c882f8ebea356b513a1bf9812875/analysis/1407044284/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Domkavosh%20Companion%20v1-1-20830-1-1.rar?fid=76470&ttl=1535789246&ri=8192&rs=8192&setec=b79ae290934f6f1c92ed50b327cbc85b"
    },
    {
      "fileId": "78156",
      "name": "Domkavosh Companion v1-2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3277",
      "fileName": "Domkavosh Companion v1-2-20830-1-2.rar",
      "uploadedUnix": "1343866771",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/ed79f32cd7b979cac31cfaa22946627ef21665431aff66731b2c949f814c19a6/analysis/1407062825/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Domkavosh%20Companion%20v1-2-20830-1-2.rar?fid=78156&ttl=1535789247&ri=8192&rs=8192&setec=3d89aab4a4e093ed8667d210dc4b216b"
    }
  ]
}