{
  "modId": 20833.0,
  "modName": "Bolagan the Eternal Lore Friendly Dwemer Follower",
  "summary": "Bolagan the Eternal is a Dwemer/Dwarf follower that is added into the game in Alftand. He can be found at the end in the corner, next to him is a book which tells his lore.\r\n\r\nHe is a sword and shield warrior, functions with UFO, and is set to essential so he cannot be killed.",
  "descriptionHtml": "==Description==\r\nBolagan the Eternal is a Dwemer/Dwarf follower that is added into the game in Alftand. He can be found at the end in the corner, next to him is a book which tells his lore.\r\n\r\nHe is a sword and shield warrior, functions with UFO, and is set to essential so he cannot be killed.\r\n\r\nHe comes with two unique items. \r\n\r\nSiegebreaker, a strong shield with a block enchantment, but can still be replaced later on in the game. It is a retextured Spellbreaker, with a more rusted and older look to it. It does not have the Spellbreaker enchantment and has less armor value.\r\n\r\nBloodletter, a strong sword that can be replaced later on in the game. It has a lifestealing enchantment on it, and uses a retextured Dawnbreaker model to give it a more rusted look. It does not have the Dawnbreaker enchantments.\r\n\r\n==FAQ==\r\n-Where is he?\r\n-- He is found at the end of Alftand, just by the lift. He will even assist in the final fight there if it\\'s your first time there.\r\n-Is he overpowered?\r\n--No, He starts off in Dwarven armor and is a standard sword and shield warrior. His weapon and shield are a bit better than Dwarven equivilants.\r\n-Is he voiced?\r\n--He is voiced, Default voices.\r\n-Does he work with UFO\r\n--Yes. He should work perfectly fine with all parts of UFO.\r\n\r\n==Lore==\r\nBelow is the Book of Bolagan the Eternal, without the publisher\\'s notes. The Book has been written by a Dwemer before their disappearance, and is about the tales of Bolagan.\r\n\r\nJust as the sun rose over Red Mountain, so did the blade of Bolagan. With one mighty swing of his sword, he felled the Daedric beast. Known amongst his people as \\\"The Eternal\\\" for his many bouts, the title would eventually come to fit the champion more than most had realized.\r\n\r\n\\\"The Chimer and their men..They are relentless sir.\\\" spoke the Dwemer recruit. \\\"We will not falter, We will hold this line!\\\" Bolagan had roared as he cut down another summoned demon.\r\n\r\nThe Dwarves were outnumbered. It was a simple tactical situation, Bolagan\\'s caravan was carrying weapons and supplies, and the Chimer wanted them. It was an odd and unexpected ambush, Chimer rarely ventured out into these lands, but none-the-less, they were present and an obvious threat. The Dwemer fought bravely but as Bolgar and Velek had fallen, Bolagan was left to face the Chimer ambushers with but only a new recruit. The two mer fought bravely, but in the end were outmatched. Seeing this as a loss, Bolagan chose to let the young boy escape back to their home of Alftand while he held the line.\r\n\r\n\\\"Don\\'t tell me this is all you heathens have got to bring against me!\\\" called a roaring Bolagan, as he successfully cut down another foe. However, it was not the summoning of a Daedric entity or a Chimer that would directly be his undoing. It was a summoning of himself. As Bolagan prepared to charge bravely into the next battle, He found himself propelled by some odd magic out of existance. As though his soul was no longer bound to Mundus.\r\n\r\nSomehow, the Chimer had been able to channel a spell thats very nature was to rid Bolagan from the picture, not just in location, but also in time it\\'s self.\r\n\r\nBolagan found himself propelled through various ages of time, having gone from the caravan to a battle against Nords in Morrowind, attempting to rout the Nords from the land. It was here that the Chimer were now his, albeit reluctant, allies. Confused but renewed, the mighty warrior once again picked up his blade and charged into battle.\r\n\r\nBeing an experienced combatant, Bolagan helped the troubled lines of Dwemer and Chimer against the Nords, and as he was about to be struck down by a Nord who had used the power of the Voice to over power him, he once again was gone.\r\n\r\nFinding himself now on Vvardenfell, he traversed the lands, realizing that somehow he was warping through time and space, having gone hundreds of years to the future. All of his friends and family were deceased by this time, and he found that the tales of his exploits in his time had been written down as Dwemer legends.\r\n\r\nFrom Vvardenfell, to Morrowind at large, to Hammerfell and Skyrim, Bolagan would always find himself near Dwemer in dire need. It appears the spell had bound him to the needs of his people, something he was not unwilling to answer of course. In an encounter with a Chimer mage, I recount a story told by Bolagan the Eternal.\r\n\r\n\\\"While adventuring through Morrowind, I came upon a Chimer coven which had been terrorizing a Dwemer settlement. Ofcourse, I lent my blade to this cause, as it was my duty\\\", spoke Bolagan. He continued, \\\"While clearing the heathens, I met my match with a Chimer mage. His eyes burned red, as though he was cursed, his skin darkened, and he spoke out to me!\\\"\r\n\r\n\\\"Bolagan the Eternal! Mighty warrior of the Dwemer! Bearer of the Curse of Time. You shall be one of the few of your \\\"mighty\\\" race to remain! This is something I swear to you, My magic cannot cause as much harm as what is to come!\\\". Bolagan spoke. \\\"I had no idea what the odd Chimer meant, but seeing it as a taunt I retorted my own, Claiming him to have descended into more madness than the norm of their race, however he continued to claim odd prophecy.\\\"\r\n\r\n\\\"On the night of your race\\'s disappearance..your \\'Curse\\' shall once more spare you! You will be propelled through the ages of time, To an age far beyond this one, where the Dwemer have long since died out to this age, and Dragons roam the lands you once called home! You will wait in Alftand as the Curse you bear will finally reap it\\'s bounty upon you, and you will find you are purposeless to your people in an age where they no longer exist! Poor Dwemer I fear you shall fret not, for a hero will come that will be worthy of your blade.. I promise you!\\\", spoke the Chimer.\r\n\r\n\\\"Before I could cut the crazed man down, He slit his throat with his own blade and bled out upon the floor. I know not what he meant, but he must be crazed. The Dwemer are strong and hearty, we will not die out anytime soon.\\\" Bolagan laughed as he said this, taking up a pint of mead as he headed out into the lands.\r\n\r\nDealing with the constant teleportation, Bolagan would assist or make due with wherever his affliction placed him. He would share his tale with any willing to listen. Having arrived now in a time where War with the Chimer looms over Vvardenfell, it is a wonder if he shall be present to witness the usage of the Heart of Lorkhan.\r\n\r\n==Comments==\r\n\r\nPlease leave any comments with issues you\\'ve had with the mod if any. Feedback is appreciated.\r\n",
  "categoryId": "66",
  "version": "1",
  "author": "Berenal",
  "createdUnix": "1342808511",
  "updatedUnix": "1342808756",
  "containsAdultContent": false,
  "uploadedBy": "Berenal",
  "primaryFile": null,
  "files": [
    {
      "fileId": "75547",
      "name": "Bolagan",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Bolagan-20833-1.zip",
      "uploadedUnix": "1342808756",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/87e3328a419c444fcf89a01614293e239b414388e7d6791ff2f10e43f59043b8/analysis/1407035344/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bolagan-20833-1.zip?fid=75547&ttl=1535789253&ri=8192&rs=8192&setec=c7b589e265bfa9dcd6807d1fbc85deba"
    }
  ]
}