{
  "modId": 20856.0,
  "modName": "The Red Estate by Sarharien",
  "summary": "A player house and nearby dungeon/mine for future expansion. House tailored to my needs and style, complete with multiple follower beds, outdoor crafting area, customized mood lighting (RED of course!), basement display area complete with display cases, mannequins and an assortment of items collected by the previous homeowner.",
  "descriptionHtml": "*** WARNING!!!  This mod has NOT yet been confirmed functional in \\\"Dawnguard DLC\\\" \r\n    expansion pack.  I am waiting a while for the dust (and Steam lag) to settle before\r\n    I jump into Dawnguard and whatever Mod update requirements are needed.  Looks\r\n    like we are also waiting for a new Creation Kit upgrade for Dawnguard as well... ***\r\n\r\n=========================================================================================\r\nThe Red Estate - v1.1 (August 1, 2012)\r\n=========================================================================================\r\n\r\nExcerpts from the journal of the former occupant:\r\n\r\n \\\"Father finally passed away from the sickness that runs rampant in our family.  I wonder \r\n  when my time will come? ...As the only remaining daughter, I have inherited The Red Estate\r\n  in Skyrim - Father\\'s last remaining piece of family property.  I have heard much about \r\n  it\\'s beautiful gardens and ...Father\\'s collection room ...\\\"\r\n\r\n\r\n=========================================================================================\r\nBACKGROUND\r\n=========================================================================================\r\n\r\nA player house mod in western Skyrim, suited to my adventuring playstyle and wishes.  After\r\nusing it for a number of weeks and continually tweaking its content, I figured I might as \r\nwell share it with the community that made it all possible!  :)\r\n\r\nTravel west from Solitude to Harmugstahl.  From there, head almost directly north towards\r\nMor Khazgur, and you\\'ll run into The Red Estate up the hill after crossing the river that\r\nflows between these two locations.\r\n\r\nThere\\'s the beginnings of a storyline at the estate, with a minor treasure hunt required\r\nto figure out where the key to the house has been stashed.  The key to the nearby mine is\r\nalso hidden, but I\\'ve intentionally blocked access to most of the mine/dungeon until I\\'ve \r\nfinished that area of the mod.  So if you find the key to the mine, keep it safe and stay \r\ntuned for a future release!\r\n\r\nI\\'m still figuring out the Creation Kit and all it\\'s features, so I don\\'t profess this mod\r\nto be anything other than my little creation project for self-enjoyment.  If you like it, \r\nbonus for you!  Either way, I appreciate the opportunity to share on the Nexus, and look\r\nforward to your feedback.\r\n\r\n\r\n=========================================================================================\r\nMOD DESCRIPTION & LOCATION\r\n=========================================================================================\r\n\r\nA player house and nearby dungeon/mine for future quest expansion.  House tailored to my\r\nneeds and playstyle, complete with multiple follower beds, outdoor crafting area (who wants\r\nall that crap cluttering their house and stinking the place up?), customized mood lighting\r\n(duh, red of course!), basement \\\"display\\\" area complete with display cases, mannequins and\r\nan assortment of items collected by the previous homeowner.\r\n\r\nCells affected:\r\n\r\n|---------|\r\n| -37,19 | < Navmesh minor modifications\r\n|---------|---------|\r\n| -37,18 | -36,18 | < Navmesh minor modifications, some static content\r\n|---------|---------|\r\n| -37,17 | -36,17 | < Heavy customization, navmesh, statics, landscape\r\n|---------|---------|\r\n| -37,16 | -36,16 | < Heavy customization, navmesh, statics, landscape\r\n|---------|---------|\r\n| -37,15 | -36,16 | < Heavy customization, navmesh, statics, landscape\r\n|---------|---------|\r\n\r\n* There\\'s also a handful of minor static and quest objects placed in -38,16.\r\n  No navmesh or landscape changes in that cell.\r\n\r\n\r\n** WARNING: Any mods that affect the above cells will likely cause some sort of conflict\r\n            with my mod.  You\\'ll have to resolve these by either changing the order of\r\n            which mod loads first (mine or the other one), or more likely choose to only\r\n            use ONE mod that affects any of the above cells.  Don\\'t worry, I won\\'t be\r\n            offended if you don\\'t pick mine. ;)\r\n\r\nA partial storyline currently exists with the estate; future expansion will include the\r\ncompletion of the nearby mine/dungeon area, along with quests and items featured in the\r\nstory/journals/books found within.\r\n\r\n\r\n=========================================================================================\r\n>>>**REQUIRED COMPONENTS YOU MUST ALSO INSTALL BEFORE USING MY MOD**<<<\r\n=========================================================================================\r\n\r\n1) ApachiiSkyHair v1.4 or higher \r\n\tMust be above my mod in your load list.  You can find the latest package here on\r\n\tSkyrimNexus: http://skyrim.nexusmods.com/mods/10168\r\n\r\n2) The Ashen - Oriental Beauty Race\r\n\tMust be above my mod in your load list.  Future versions will be introducing NPC\r\n\tcharacters that make use of the Ashen race, and since I have started development\r\n\tin the background of the ESP, you *MUST* now install \\\"The Ashen\\\" mod before you\r\n\tload my latest version 1.0.  In particular, ONE file from \\\"The Ashen\\\" mod must\r\n\tbe loaded above my mod: \\\"RaceCompatability.esm\\\", which can be found inside this \r\n\tpackage on SkyrimNexus: http://skyrim.nexusmods.com/mods/8583\r\n\r\n3) Modders resource 1-10 Second Silence \r\n\tMust be above my mod in your load list. Provides me a simple method of including\r\n\ttruly silent sound tracks to go along with subtitle NPC dialogue in quests.  Mod \r\n\tcan be found here on SkyrimNexus: http://skyrim.nexusmods.com/mods/16254\r\n\r\n* This mod is not fully voiced. You will need to turn on subtitles to read the text.\r\n\r\n\r\n=========================================================================================\r\nCURRENT FEATURES\r\n=========================================================================================\r\n\r\nv0.9\r\n- Landscaped player home and surrounding area providing a scenic vista of the nearby valley, \r\n  with abundant hunting nearby, and numerous follower \\\"idle\\\" points for any follower you set\r\n  to \\\"relax\\\".  \r\n- Exterior garden area, complete with follower \\\"idle\\\" points for anyone you set to \\\"relax\\\".\r\n* Have tested with UFO and 15 followers (7 inside, 8 outside), and haven\\'t run into any \r\n  issues personally.\r\n- Exterior crafting area including: enchanting table, alchemy table, smelter, tanning rack, \r\n  anvil, workbench, sharpening wheel, specific storage chests, & generic storage containers;\r\n  all interactable by your followers.\r\n- House 3-floor interior complete with: multiple weapon racks; wall mounted display points; \r\n  mannequins (21 total); abundant storage; 4 single beds; 1 double bed; multiple follower\r\n  \\\"idle\\\" locations; a number of bookshelves; and customized mood lighting. \r\n- Nearby mine/dungeon area partially completed (exterior entrance and storyline complete,\r\n  but interior of dungeon and accompanying quests and items not yet finished).  Key to the\r\n  mine IS hidden in the house somewhere, but if you DO enter the mine, please be aware it\r\n  is not complete. :)\r\n- Exterior dragon \\\"perch\\\" locations encourage some entertaining battles when dragons spawn.\r\n\r\nv1.0\r\n- Cooking area with some non-respawning containers are located down the hill by the river\r\n  (hang a left coming out the front door or garden), but be warned that some locals might\r\n  be attempting to enjoy a meal down there too! ;)\r\n- Additional spawning wildlife in the area for those of us to love to hunt!\r\n- Two NPC characters which feature \\\"ApachiiSkyHair\\\" and \\\"The Ashen - Oriental Beauty Race\\\" \r\n  are also now included, with more in development for future quests and interactions. \r\n- **TWO INTRO QUESTS** with the previous home owners, now properly introduce you to the\r\n  estate AND provide you with the key to the house.  I have changed the locks on the front\r\n  doors, so those of you who installed v0.9 might find yourselves locked out of the house\r\n  until after you complete these two quests.  **MORE INFO ON QUESTS BELOW**\r\n\r\n*NEW* v1.1\r\n- **TWO INTRO QUESTS REMOVED TEMPORARILY**\r\n  Due to problems with the initial starter quests (that I\\'m still figuring out), I have\r\n  completely REMOVED the quests and silent voice files from this version.\r\n- Added another outdoor weapon rack at the back door.\r\n- Fixed some navmesh issues around the crafting area, including collision walls to help\r\n  avoid multiple \\\"relaxing\\\" followers from getting stuck inside the building mesh.\r\n- Corrected some minor idle leaning spots outside that had followers leaning into\r\n  walls and posts, instead of ON them.\r\n- Have placed the key to the estate house in the backyard on Kierraen\\'s grave (again, \r\n  just for now until I can get the quests working the way I want them to).\r\n- Have increased the size of the hidden mine key slightly - it *IS* hidden in the house,\r\n  but blends in well with its surroundings (but I promise it\\'s not buried!).\r\n  \r\n\r\n=========================================================================================\r\nFUTURE PLANS\r\n=========================================================================================\r\n\r\n- Will upgrade interior to include a kitchen area, complete with storage and cooking area.\r\n  For now, make use of the cooking pot/fire down by the river.\r\n\r\n- Continuing storyline & quest development for the accompanying mine/dungeon area, with \r\n  eventual full access and (hopefully!) unique reward items.\r\n\r\n- Bug fixes and optimizations as they are reported and I figure out how to do them! :)\r\n\r\n**BE WARNED: \r\n\tThis project is primarily for MY enjoyment, so your suggestions, pains, desires\r\n\tor complaints may not always result in changes.  ** Use at your own risk. **\r\n\r\n\r\n=========================================================================================\r\nWARNING - WARRANTEE NOT INCLUDED\r\n=========================================================================================\r\n\r\nOkay - let\\'s just all get on the same page here.  I\\'m not perfect - well, Canadian, natural\r\nredhead of Scottish origins - so close, but still, NOT perfect.  The things I create, that\r\nWE create as a community, are not perfect either.  Neither is the wonderful Skyrim game from\r\nBethesda (gasp!).  Our intentions as authors and creators however, is to get as close as we \r\ncan, with the tools and knowledge and skills available to us.  Keep this in mind when using\r\nany content for any game, along with a healthy dose of patience and tollerance, and you\\'ll\r\nenjoy the journey a lot more.\r\n\r\nI do NOT guarantee my mod or its contents to work on any computer but my own, nor do I \r\nguarantee its performance or impact on any environment other than what I\\'ve got installed \r\nmyself.  I have done my best to ensure it functions as I have advertised in this readme, \r\nhaving spent more than 40 hours of development and playtesting time with my mod content. \r\n\r\nI do NOT promise to respond to every bug, every request for enhancement, every comment nor\r\nevery email I receive regarding this mod.  I am not intentionally going to ignore them\r\neither, but please realize that I have a life, a full time job, and two wonderful teenage\r\ndaughters that keep me busy.  I game and mod for fun, and take the time out of my life when\r\nI can manage.  I will try my best to keep up with comments and bugs, and to the best of my\r\nability and with what time I have available, I will endeavor to update this mod over time.\r\n\r\nI do NOT expect everyone to love this mod.  I made it with myself in mind, and I completely\r\nunderstand that YOU are not all perfect, Canadian, natural redheads. ;)  I\\'ll just go with\r\nan expectation that I will love this mod myself - anyone else that finds joy in it, is \r\nicing on my cake! :)\r\n\r\n\r\n=========================================================================================\r\nINSTALL INSTRUCTIONS\r\n=========================================================================================\r\n\r\n>>>**REQUIRED COMPONENTS YOU MUST ALSO INSTALL BEFORE USING MY MOD**<<<\r\n\r\n1) ApachiiSkyHair v1.4 or higher \r\n\tMust be above my mod in your load list.  You can find the latest package here on\r\n\tSkyrimNexus: http://skyrim.nexusmods.com/mods/10168\r\n\r\n2) The Ashen - Oriental Beauty Race\r\n\tMust be above my mod in your load list.  Future versions will be introducing NPC\r\n\tcharacters that make use of the Ashen race, and since I have started development\r\n\tin the background of the ESP, you *MUST* now install \\\"The Ashen\\\" mod before you\r\n\tload my latest version 1.0.  In particular, ONE file from \\\"The Ashen\\\" mod must\r\n\tbe loaded above my mod: \\\"RaceCompatability.esm\\\", which can be found inside this \r\n\tpackage on SkyrimNexus: http://skyrim.nexusmods.com/mods/8583\r\n\r\n3) Modders resource 1-10 Second Silence \r\n\tMust be above my mod in your load list. Provides me a simple method of including\r\n\ttruly silent sound tracks to go along with subtitle NPC dialogue in quests.  Mod \r\n\tcan be found here on SkyrimNexus: http://skyrim.nexusmods.com/mods/16254\r\n\r\n\r\n>>>**UPGRADING FROM v0.9**<<<\r\n\r\n1) BEFORE installing, please visit the estate and REMOVE all items that you have placed in\r\n   the four (4) large urns (2 outside by crafting area, 2 inside down the stairs under the\r\n   dragon\\'s head).  These urns have been REPLACED with non-respawning empty urns in v1.0.\r\n\r\n2) Exit the estate house, run down the main fenced pathway and KEEP RUNNING until you pass\r\n   the three (3) large, dead, twisty-looking trees that are placed (somewhat) in a line\r\n   extending from the front gate.  You\\'ll end up going up a slight hill opposite the front\r\n   gate.  If you get this far away from the house, it should be a safe distance to then \r\n   *SAVE YOUR GAME* (helps to allow full cell contents to reload with the changes).\r\n\r\n3) Close Skyrim.  Extract this archive into your Skyrim\\\\Data folder, maintaining folder\r\n   structures and *OVERWRITING* any files you are prompted to (with the EXCEPTION of the\r\n   \\\"Bathing Beauties Luxury Suite\\\" files mentioned below - don\\'t overwrite those).\r\n\r\n4) Please install the *REQUIRED COMPONENTS* (listed in at the top of this section).\r\n\r\n5) Run Skyrim Launcher, and enter \\\"DATA FILES\\\" option, ensuring that this newly added \r\n   \\\"sarharien_the_red_estate.esp\\\" is activated for loading.  (For me personally, I have \r\n   it loading LAST in my list, and haven\\'t run into CTD issues yet!)\r\n\r\n6) Restart Skyrim, load your Save Game, and enjoy the changes!\r\n   **RECOMMEND you immediately make a new save game & re-load the new save before playing.**\r\n\r\n\r\n>>>**UPGRADING FROM v1.0**<<<\r\n\r\n1) Exit the estate house, run down the main fenced pathway and KEEP RUNNING until you pass\r\n   the three (3) large, dead, twisty-looking trees that are placed (somewhat) in a line\r\n   extending from the front gate.  You\\'ll end up going up a slight hill opposite the front\r\n   gate.  If you get this far away from the house, it should be a safe distance to then \r\n   *SAVE YOUR GAME* (helps to allow full cell contents to reload with the changes).\r\n\r\n2) Close Skyrim.  Extract this archive into your Skyrim\\\\Data folder, maintaining folder\r\n   structures and *OVERWRITING* any files you are prompted to (with the EXCEPTION of the\r\n   \\\"Bathing Beauties Luxury Suite\\\" files mentioned below - don\\'t overwrite those).\r\n\r\n3) Please install the *REQUIRED COMPONENTS* (listed in at the top of this section).\r\n\r\n4) Run Skyrim Launcher, and enter \\\"DATA FILES\\\" option, ensuring that this newly added \r\n   \\\"sarharien_the_red_estate.esp\\\" is activated for loading.  (For me personally, I have \r\n   it loading LAST in my list, and haven\\'t run into CTD issues yet!)\r\n\r\n5) *DELETE* The following quest related files, as they are removed from this version,\r\n   and will be appropriately renamed and recreated in a future version:\r\n      \\\\Data\\\\Sound\\\\Voice\\\\sarharien_the_red_estate.esp\\\\*.*\r\n      \\\\Data\\\\Scripts\\\\Sar_*.pex\r\n      \\\\Data\\\\Scripts\\\\QF_Sar_*.pex\r\n      \\\\Data\\\\Scripts\\\\Source\\\\Sar_*.psc\r\n      \\\\Data\\\\Scripts\\\\Source\\\\QF_Sar_*.psc\r\n\r\n6) Restart Skyrim, load your Save Game, and enjoy the changes!  \r\n   **RECOMMEND you immediately make a new save game & re-load the new save before playing.**\r\n\r\n\r\n>>>**NEW INSTALLATIONS**<<<\r\n\r\nManual install recommended, as I don\\'t personally use other methods for installation, and\r\ncan\\'t presently describe or explain non-manual methods.\r\n\r\n1) Extract my RAR file into your Skyrim\\\\Data Folder, maintaining the folder structures.\r\n\r\n   NOTE: I use some of the objects and textures from \\\"Bathing Beauties Luxury Suite\\\" and\r\n         \\\"A Classier BB Luxury Suite\\\", so *IF* you get prompted to overwrite some files, \r\n         you can just *SKIP* and NOT overwrite them, thus ensuring full BBLS compatability\r\n         with the latest versions those authors have released! :)\r\n\r\n2) Please install the *REQUIRED COMPONENTS* (listed in at the top of this section).\r\n\r\n3) Run Skyrim Launcher, and enter \\\"DATA FILES\\\" option, ensuring that this newly added \r\n   \\\"sarharien_the_red_estate.esp\\\" is activated for loading.  (For me personally, I have \r\n   it loading LAST in my list, and haven\\'t run into CTD issues yet!)\r\n\r\n4) Start Skyrim, and enjoy!\r\n   **RECOMMEND you immediately make a new save game & re-load the new save before playing.**\r\n\r\n\r\n=========================================================================================\r\nTO UNINSTALL (gasp! /sadface)\r\n=========================================================================================\r\n\r\n>>MANUAL UNINSTALL<<\r\n1) If you installed it manually, delete this file from your Skyrim\\\\Data folder: \r\n   \\\"sarharien_the_red_estate.esp\\\". \r\n \r\n   a) If you HAVE installed \\\"Bathing Beauties or Beefcake - Luxury Suite\\\", then\r\n      skip down to step 1c below.\r\n\r\n   b) If you have NOT installed \\\"Bathing Beauties or Beefcake - Luxury Suite\\\", then\r\n      please additionally remove the following files I packaged with my mod:\r\n      \\\\Data\\\\Meshes\\\\architecture\\\\BBLS\\\\LS_rugE.nif\r\n      \\\\Data\\\\Meshes\\\\architecture\\\\BBLS\\\\LS_rugHalfRound.nif\r\n      \\\\Data\\\\Meshes\\\\architecture\\\\BBLS\\\\LS_rugRound.nif\r\n      \\\\Data\\\\Meshes\\\\architecture\\\\BBLS\\\\LS_wrintchfloorwoodplatfloor01.nif\r\n      \\\\Data\\\\Textures\\\\architecture\\\\BBLS\\\\aaRIP88_LS_RugE.dds\r\n      \\\\Data\\\\Textures\\\\architecture\\\\BBLS\\\\aaRIP88_LS_rugHalfRound01.dds\r\n      \\\\Data\\\\Textures\\\\architecture\\\\BBLS\\\\aaRIP88_LS_ruground01_n.dds\t    \r\n      \\\\Data\\\\Textures\\\\architecture\\\\BBLS\\\\aaRIP88_LS_ruground02.dds\r\n      \\\\Data\\\\Textures\\\\architecture\\\\BBLS\\\\aaRIP88_LS_WoodFloor.dds\r\n      \\\\Data\\\\Textures\\\\architecture\\\\BBLS\\\\aaRIP88_LS_WoodFloor_n.dds\r\n      \\\\Data\\\\Textures\\\\architecture\\\\BBLS\\\\aaRIP88_LS_WoodFloorStraigh90_n.dds\r\n      \\\\Data\\\\Textures\\\\architecture\\\\BBLS\\\\aaRIP88_LS_WoodFloorStraight.dds\r\n      \\\\Data\\\\Textures\\\\architecture\\\\BBLS\\\\aaRIP88_LS_WoodFloorStraight_n.dds\r\n      \\\\Data\\\\Textures\\\\architecture\\\\BBLS\\\\aaRIP88_LS_WoodFloorStraight90.dds\r\n      \\\\Data\\\\Textures\\\\architecture\\\\BBLS\\\\aaRIP88_LS_WoodFloorStraightDark.dds\r\n      \\\\Data\\\\Textures\\\\architecture\\\\BBLS\\\\aaRIP88_LS_WoodFloorStraightDark90.dds\r\n\r\n   c) Please delete the following additional folders related to my mod:\r\n      \\\\Data\\\\Sound\\\\Voice\\\\sarharien_the_red_estate.esp\\\\*.*\r\n      \\\\Data\\\\Scripts\\\\Sar_*.pex\r\n      \\\\Data\\\\Scripts\\\\QF_Sar_*.pex\r\n      \\\\Data\\\\Scripts\\\\Source\\\\Sar_*.psc\r\n      \\\\Data\\\\Scripts\\\\Source\\\\QF_Sar_*.psc\r\n      \\\\Data\\\\Meshes\\\\Actors\\\\Character\\\\facegendata\\\\facegeom\\\\sarharien_the_red_estate.esp\\\\*.*\r\n      \\\\Data\\\\Textures\\\\Actors\\\\facegendata\\\\facetint\\\\sarharien_the_red_estate.esp\\\\*.*\r\n      \\\\Data\\\\Textures\\\\Oaristys\\\\*.*\r\n\r\n   d) You\\'re done!\r\n\r\n>>OTHER INSTALL METHODS<<\r\n2) If you installed with another method, follow that method\\'s uninstallation instructions,\r\n   or manually uninstall as noted above.\r\n\r\n* Don\\'t worry, I won\\'t hold it against you - but I do thank you for trying it out anyways!\r\n\r\n\r\n=========================================================================================\r\n**CURRENTLY REMOVED FROM v1.1** QUESTS & QUEST RELATED KNOWN ISSUES\r\n=========================================================================================\r\n\r\n**CURRENTLY REMOVED FROM v1.1**\r\n\r\nINTRO QUEST (Q00) - \\\"The Gastronomic Goblet\\\"\r\n\tAt a certain time of day, you can find the previous home owner relaxing out behind\r\n\tthe house.  Read her journal(s) to discover where and when, and then lend a hand\r\n\trecovering her special goblet.\r\n\t\r\nQUEST #1 (Q01) - \\\"Unlocking the Estate\\\"\r\n\tAfter completing the intro quest, you will be sent off to find the other previous\r\n\thome owner, who will provide you with the key to the estate... well, after you help\r\n\ther resolve a conflict with a local thief. ;)\r\n\r\n\t\r\n=========================================================================================\r\nCURRENT KNOWN ISSUES (non-quest related)\r\n=========================================================================================\r\n\r\n1) Entrance into the lower part of the mine is presently impossible (unless you \\\"cheat\\\" and\r\n   use something like TCL/TFC).  This is BY DESIGN, as I haven\\'t finished the complete mine\r\n   and dungeon area, and will be working on that content and quest line next.\r\n\r\n2) There\\'s a bit of an initial FPS hit when I enter the area, but after a few seconds, it\r\n   settles down on my system and I don\\'t notice it anymore (and my system isn\\'t amazing).\r\n\r\n3) I\\'m still figuring out things like lighting and optimizations, so I\\'m sure that there are\r\n   a few issues with spiderwebbing, overlapping meshes, and the like, but I believe most \r\n   of the interior is now fixed.\r\n\r\n4) **QUESTS HAVE BEEN REMOVED from v1.1 and will be introduced later when I fix them.**\r\n\r\nIf you find other issues, be so kind as to post in comments on Skyrim Nexus for this file.\r\nI\\'m not a perfect modder - I expect errors to come up for some people.  You don\\'t have the\r\nsame system as me, nor the same settings, so don\\'t expect the same behaviour in all \r\ncircumstances!  :)  Be patient and understanding - I have done my best to avoid problems\r\nwhile allowing for a clean uninstall.  \r\n\r\n\\\"Patience is not learned in a weekend.\\\" ~Anon\r\n\r\n\r\n=========================================================================================\r\nCOMPATABILITY TESTED\r\n=========================================================================================\r\n\r\nI have personally installed and am using the following mods along with my house mod, and do\r\nnot presently suffer from any conflicts or CTDs (I have my mod loading last in my list). In\r\nalphabetical order:\r\n\r\nvia Skyrim Nexus:\r\n- 83Willows 101BugsHD Butterfly Dragonfly Luna-Moth Torchbug\r\n- A Classier BB Luxury Suite\r\n- ApachiiSkyHair\r\n- Auto Unequip Arrows\r\n- Bandit Raids\r\n- Bathing Beauties or Beefcake - Luxury Suite\r\n- Better Bows\r\n- Better Circlets HQ V1o1\r\n- Cloaks of Skyrim\r\n- Glowing Ore veins 300\r\n- Improved Freckles Skyrim\r\n- JaySuS Swords\r\n- Lanterns of Skyrim - All In One\r\n- Matherian Viking Shields Set - MVSS\r\n- Modders Resource Pack\r\n- Modders Resource-Weapon Racks-Bookshelves-Plaques-Mannequins\r\n- Nicos Craftable Arrows\r\n- RANs Eybrow Replacer 01-08\r\n- RANs Eyeliner Replacer\r\n- See You Sleep by Madmole\r\n- Skyrim HD - 2K Textures\r\n- The Ashen - Oriental Beauty Race\r\n- The Chronicles of Steel - Skyrim- Realswords NEXUS EXCLUSIVE\r\n- The Eyes Of Beauty\r\n- Tribunal robes set\r\n- UFO - Ultimate Follower Overhaul\r\n- Unique Booze Bottles HD\r\n- WATER - Water And Terrain Enhancement Redux\r\n- Wearable Lanterns\r\n* plus numerous add-on armors & follower NPC mods\r\n\r\nvia Steam Workshop:\r\n- Build Your Own Home\r\n- City Houses Light / Shadows Fix\r\n- Complete Skyforge\r\n- Enhanced High-Level Gameplay\r\n- Isilmeriel\\'s LOTR Weapons\r\n- Legible Road Sings High Res\r\n- Mountain Crest\r\n- Open Face Guard Helms\r\n- Realistic Map + Roads !\r\n- Sounds of Skyrim - The Dungeons\r\n- Sounds of Skyrim - The Wilds\r\n- The Cartographers Map Markers\r\n- Vicious Weapon Pack\r\n\r\n\r\n=========================================================================================\r\nTHANKS & CREDITS TO OTHERS (I highly endorse and recommend all mods mentioned below!!!)\r\n=========================================================================================\r\n\r\nThanks to...\r\n\r\n- GomuGomu64: For his \\\"Modders resource 1-10 Second Silence\\\" package to help modders like\r\n              me in being able to incorporate silent WAV tracks into our NPC speech when\r\n              voice acting is not (presently) an option.  His very helpful mod resource\r\n              can be found here: http://skyrim.nexusmods.com/mods/16254\r\n\r\n- apachii: For his \\\"ApachiiSkyHair\\\" - an incredible mod giving us amazing new hairstyles\r\n\t   for our NPCs!  Highly endorsed - find here: http://skyrim.nexusmods.com/mods/10168\r\n\r\n- Seren4xx & RadioRagae: For their \\\"The Ashen - Oriental Beauty Race\\\" which I will be using\r\n\t\t\t in the development of some future NPC characters in my mod.  You \r\n\t\t\t can grab their mod here: http://skyrim.nexusmods.com/mods/8583\r\n\r\n- eldiabs: For his \\\"Modders Resource-Weapon Racks-Bookshelves-Plaques-Mannequins\\\" mod. This\r\n                    was an incredibly helpful resource for me in figuring out how to place\r\n                    things like weapon racks and mannequins in a way that didn\\'t drive me\r\n                    completely batty.  If you\\'re a modder, you will likely appreciate and\r\n                    endorse it too: http://skyrim.nexusmods.com/mods/11618\r\n\r\n- Oaristys & Tony67: For their collaborative and exceptional \\\"Modders Resource Pack\\\". This\r\n                     mod contains dozens of great static items for inclusion within your own\r\n                     creations - things like chests full of ingots, or neatly stacked \r\n                     shelves of scrolls, or assortments of dishes and other bling!  Easily\r\n                     incorporated with the use of the Creation Kit.  I have endorsed and \r\n                     highly recommend this mod: http://skyrim.nexusmods.com/mods/16525\r\n\r\n- Matherthebec: For his excellent mod \\\"Matherian Viking Shields Set\\\", which adds beautiful\r\n                and lore-realistic shields into Skyrim.  If you haven\\'t discovered this fine\r\n                mod and endorsed it, try it now: http://skyrim.nexusmods.com/mods/20217\r\n                At his request, I am also mentioning his MEDIEVAL TOTAL WAR COMMUNITY which\r\n                can be found here: http://mtwitalia.freeforumzone.leonardo.it/\r\n\r\n- howiego08: For his incredible \\\"Better Bows\\\" mod, which inspired me to incorporate a little\r\n             storyline and eventual future quest featuring a special heirloom bow left \r\n             behind by the previous homeowner.  I have endorsed and highly recommend his\r\n             entire line of bows found here: http://skyrim.nexusmods.com/mods/13317\r\n\r\n- Migal130: For his Bathing Beauties Luxury Suite.  A great mod which I enjoyed examining\r\n            within the CK in order to learn various aspects of modding.  Highly recommend\r\n            and have personally endorsed his file: http://skyrim.nexusmods.com/mods/11427\r\n\r\n- rip88: For his great re-textures of wood flooring and carpets for the BBLS, which I make \r\n         use of in my home.  Please try his file: http://skyrim.nexusmods.com/mods/19866  \r\n         I endorsed him, and once you\\'ve seen his work, you will too!\r\n\r\n- Numerous fellow modders who have posted on Skyrim Nexus: Thanks to this incredible\r\n  community of helpful, talkative, descriptive and talented people, people like me have a \r\n  chance to create something wonderful in a game we all love. *THANK YOU*\r\n\r\n- Everyone willing to try out my mod, even if you don\\'t like it.  Feedback is appreciated!\r\n\r\n- dr4cos: For your great feedback and bug reporting of v0.9.  Thanks!\r\n\r\n- Skyrim Nexus, for their website and services hosting our mods. Happily a premium member!\r\n\r\n- Bethesda, for their great game, Skyrim.\r\n\r\n- All my peeps back on Dwarrowdelf in that \\\"other\\\" game, who are patiently awaiting my\r\n  return while I craft and completed this first release version of my mod.  Sar the Red\r\n  will be back soon!\r\n\r\n* My apologies if I have forgotten to mention anyone who has unknowingly contributed to my\r\n  mod through your own impressive material.  I have tried to carefully keep track of all\r\n  those individuals whom I have gleaned information and knowledge from (and occasionally\r\n  your wonderful content), but know I might be missing some people.  Sorry! xoxo\r\n\r\n\r\n=========================================================================================\r\nPERMISSIONS\r\n=========================================================================================\r\n\r\n- eldiabs: \\\"Hope it saves a few modders time.\\\" <<-- Understatement of the year! ;)\r\n\r\n- Oaristys: \\\"You are free to use these resources in your own mods without asking as long as \r\n             you give me proper credits.\\\"\r\n\r\n- Matherthebec: \\\"Please, feel free to use that set for any mod or armor pack you like, JUST \r\n                 QUOTE ME AND MY MEDIEVAL TOTAL WAR COMMUNITY IN CREDITS.\\\"\r\n \r\n- Migal130: \\\"You are welcome to explore it to try to figure out how I\\'ve done things.\\\"\r\n\r\n- rip88: \\\"Anyone is free to use anything that I have made, However, most of my work is based \r\n          in some way off a stock Bethesda mesh or texture, so keep it in this game please.\\\"\r\n\r\n\r\n=========================================================================================\r\nVERSION RELEASE HISTORY\r\n=========================================================================================\r\nv1.1 - (2012-Aug-01) Update released, removing the buggy intro quests until I can figure\r\n                     out how to correctly display dialogue and quest objectives in a \r\n                     consistent voiced & non-voiced manner.\r\n                        - Removed blank voice files and script files to save space.\r\n\t\t\t- Updated readme with special instructions for upgrading from 1.0.\r\n\t\t\t- Added a weapon rack outside the other door of the house.\r\n\t\t\t- Added the key to the estate house on Kierraen\\'s grave out back.\r\n\t\t\t- Increased size of the hidden mine key in the house.\r\n\t\t\t- Updated navmesh around crafting area to prevent stuck followers.\r\n\t\t\t- Removed quest NPCs.\r\n\r\nv1.0 - (2012-Jul-25) Update released, with two intro quests complete that \\\"unlock\\\" the \r\n                     estate house, and provide some initial introduction to the main\r\n                     characters.  The following changes and updates were also included:\r\n\t\t\t- Four (4) large urns (2 inside downstairs, 2 outside by crafting)\r\n\t\t\t  have been *REPLACED* with non-spawning large urns. Prior version\r\n\t\t\t  users should first REMOVE items placed in those urns BEFORE you\r\n\t\t\t  install to v1.0.  I am hoping this is the last of the respawning\r\n\t\t\t  containers accidentally put into the house.  Sorry!\r\n\t\t\t- Outdoor cooking spot with non-spawning containers has been created\r\n\t\t\t  down by the river (left out the front garden gate).  Watch for\r\n\t\t\t  locals who might like using the spot too!\r\n\t\t\t- Navmeshes in the basement \\\"collection room\\\" have been corrected\r\n\t\t\t  to avoid followers getting stuck.\r\n\t\t\t- A number of cosmetic changes to the \\\"collection room\\\" in the\r\n\t\t\t  basement.  New clutter, new containers, new wall mounted shield\r\n\t\t\t  racks on a number of pillars and walls for you to decorate in\r\n\t\t\t  your preferred style (P.S. highly recommend \\\"MATHERIAN VIKING\r\n\t\t\t  SHIELD SET\\\" http://skyrim.nexusmods.com/mods/20217 for decor!)\r\n\t\t\t- Some minor changes and updates inside the house related to \r\n\t\t\t  texture gaps and incorrectly positioned pillars.  Hopefully \r\n\t\t\t  the visual issues are gone!\r\n\t\t\t- Removed some of the banners and lights heading up the main path\r\n\t\t\t  to help improve FPS outside.\r\n\t\t\t- Added a bunch of static and quest content outside (mostly back\r\n\t\t\t  behind the house and down by the river).  You\\'ll have to explore!\r\n\t\t\t* Main estate house is now *LOCKED* with a new key that is received\r\n\t\t\t  after completing the two intro quests (see QUEST section above).\r\n\r\nv0.9 - (2012-Jul-20) First public release posted to Skyrim Nexus.  Not entirely complete, \r\n                     but functional enough to use.  Let the user feedback begin!\r\n\r\n\r\n=========================================================================================\r\nCHANGELOG\r\n=========================================================================================\r\n0.9\r\nFirst public release posted to SkyrimNexus.  Not entirely complete but functional enough to use.\r\n\r\n1.0\r\nTwo intro quests added that \\\"unlock\\\" the estate house, and provide initial intro to main characters.\r\nFour (4) large urns replaced (2 inside house, 2 outside in crafting area) with non-spawning versions.\r\nOutdoor cooking spot with non-spawning containers added down by the river.\r\nNavmeshes in basement \\\"collection room\\\" have been corrected to avoid stuck followers.\r\nAdded some static and quest content outside (mostly back behind the house).  Go explore!\r\n\r\n1.1\r\nRemoved (temporarily) the intro quests that were causing people problems.  Will fix later.\r\nAdded another weapon rack outside other door of house.\r\nPut the key to the house on the grave out back near the garden.\r\nMinor navmesh fixes around the crafting area to prevent stuck followers.\r\n\r\n=========================================================================================\r\nend of file\r\n<3 Sar",
  "categoryId": "67",
  "version": "1.1",
  "author": "Sarharien",
  "createdUnix": "1342838262",
  "updatedUnix": "1343846315",
  "containsAdultContent": false,
  "uploadedBy": "sarharien",
  "primaryFile": null,
  "files": [
    {
      "fileId": "75657",
      "name": "The Red Estate by Sarharien",
      "version": "0.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1873",
      "fileName": "The Red Estate by Sarharien-20856-0-9.rar",
      "uploadedUnix": "1342838402",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/21ed2c1c200b281cc6fe331e8884924b9273518876e3c7991b3912525ff1d858/analysis/1407036186/",
      "changelogHtml": " First public release posted to SkyrimNexus.  Not entirely complete but functional enough to use. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Red%20Estate%20by%20Sarharien-20856-0-9.rar?fid=75657&ttl=1535789288&ri=8192&rs=8192&setec=5caf84bb9d30a5478a150364e649e489"
    },
    {
      "fileId": "76652",
      "name": "The_Red_Estate_by_Sarharien_v1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16769",
      "fileName": "The_Red_Estate_by_Sarharien_v1-0-20856-1-0.rar",
      "uploadedUnix": "1343273352",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f380378ec4a8df55e9b9c67e6f9fc313a839b518f50aef1e58d79ff0c3b3487a/analysis/1407046512/",
      "changelogHtml": " ** ApachiiSkyHair is now required for my mod: http://skyrim.nexusmods.com/mods/10168 <br/> \n ** The Ashen - Oriental Beauty Race is now required for my mod: http://skyrim.nexusmods.com/mods/8583 <br/> \n Four (4) large urns replaced (2 inside house, 2 outside in crafting area) with non-spawning versions. <br/> \n Outdoor cooking spot with non-spawning containers added down by the river. <br/> \n Outdoor cooking spot with non-spawning containers added down by the river. <br/> \n Navmeshes in basement collection room have been corrected to avoid stuck followers. <br/> \n Two intro quests added that unlock the estate house, and provide initial intro to main characters. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The_Red_Estate_by_Sarharien_v1-0-20856-1-0.rar?fid=76652&ttl=1535789289&ri=8192&rs=8192&setec=24de76915184d9c9bba547242eec28b5"
    },
    {
      "fileId": "78099",
      "name": "The_Red_Estate_by_Sarharien_v1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9870",
      "fileName": "The_Red_Estate_by_Sarharien_v1-1-20856-1-1.rar",
      "uploadedUnix": "1343846315",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ab4834d4fcd08ed015705ded5ba954888474accc4d09614b57ae35aaac1c67e1/analysis/1407062291/",
      "changelogHtml": " Removed (temporarily) the intro quests that were causing people problems.  Will fix later. <br/> \n Added another weapon rack outside other door of house. <br/> \n Put the key to the house on the grave out back near the garden. <br/> \n Minor navmesh fixes around the crafting area to prevent stuck followers. <br/> \n Quest NPCs removed temporarily. <br/> \n Fully functional kitchen with non-spawning storage now inside the house! <br/> \n *** WARNING!!!  This mod has NOT yet been confirmed functional in \\\"Dawnguard DLC\\\"  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The_Red_Estate_by_Sarharien_v1-1-20856-1-1.rar?fid=78099&ttl=1535789289&ri=8192&rs=8192&setec=88cff0ed32d251f4f164dbaf00e8a8da"
    }
  ]
}