{
  "modId": 20859.0,
  "modName": "Whiterun Ruins",
  "summary": "Outdoor Player Home West of Whiterun.",
  "descriptionHtml": "Whiterun Ruins:\r\n\r\nPlaces a mound ruin outside of Whiterun, near the Khajiit, along the road.\r\nA player home turn key ready. Features 2 sleeping areas (\\\"indoor\\\" and outdoor). A cooking area with storage and some veggy gardens. Bookshelves and dresser with a reading chair. Combat corner, and archery range. Wood chopping area. Enchanting and Alchemy stations with plenty of safe storage. Plus a full crafting courtyard with storage too. It is also fully NAVmeshed for followers (and horses...). Mostly candle lit during the night.\r\n\r\nThis was inspired by Roadside Ruins Reborn by Kohdi (http://skyrim.nexusmods.com/mods/19228) with full permission by him to release to SkyrimNexus Only.\r\n\r\nI really liked his view of an outside house, and I always wanted to build one, but put it off because of the \\\"startup\\\" time. Luckily Kohdi made a beautiful version, but it\\'s all about location, location, location. I moved the house to a interior cell to work on it. Deleted all other references to Falkreath and outdoor worldspaces. Then decided where to place it. It was to big for Riverwood, so to the plains of Whiterun it went.\r\n\r\nI use this for personal use of course, but thought others may enjoy it too. So with permission this is v1. I only plan on fixing any bugs that maybe found and do not plan on taking any requests, as the CK is a great tool for anyone.\r\n\r\nv1.00: Release.\r\n",
  "categoryId": "67",
  "version": "1",
  "author": "E2B2",
  "createdUnix": "1342842211",
  "updatedUnix": "1342842249",
  "containsAdultContent": false,
  "uploadedBy": "epbreen",
  "primaryFile": null,
  "files": [
    {
      "fileId": "75660",
      "name": "Whiterun Ruins",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "42",
      "fileName": "Whiterun Ruins-20859-1.7z",
      "uploadedUnix": "1342842249",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/6f301398188d4cad12ed95811121a5c209a57c6b8cd393155d29aaaad2b5e39c/analysis/1407036303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whiterun%20Ruins-20859-1.7z?fid=75660&ttl=1535789292&ri=8192&rs=8192&setec=c4f2f7f3e2125758f58ed78592bf5fe2"
    }
  ]
}