{
  "modId": 20875.0,
  "modName": "Illusion Poison Spells",
  "summary": "Ever thought that because you can affect someone\\'s mind with Illusion spells you ought to be able to influence the mind to shut down the body? Well, now you can.",
  "descriptionHtml": "Adds 6 new spells to the game which add a new effect to our well known illusion spells such as fear and fury. It does not replace those spells, but adds new spells that do that and more. When you cast this spell on an NPC there is the primary effect, such as fear. It also adds a secondary effect where the NPC takes damage over time. \r\nThis allows for an illusionist to have more option without having to revert to destruction or a weapon. \r\nThe primary effect can be resisted, but the poison cannot. The spells have such mind destroying power that it rips the mind apart. \r\n*new*\r\nI have added a second file in which both the damage done and the time has been halved. So, the first tier spells will do 2.5 damage a second for 30 seconds, doing a total of 75 damage on normal without any magic resist (master it would be 1.25 damage a second for 30 seconds = 37.5 total).\r\nTo install, use the manager. You can switch between the two files whenever you want. No clean save is necessary. You will not have to buy the spells again. I can further manipulate the damage and times, so if any one has a suggestion, say a .75 damage version, I can do that. Only run one of the files at a time. they would conflict together.\r\n \r\nThe new spells each correspond to their counter part. -These damages are the 100% numbers-\r\nThe damage effect with the area spells only affects the target hit. The others in the radius only are affected by the primary effect. This is to balance the spells a little bit. If you want a version with the damage being applied to all in the area, just message me and I can make it.\r\n\r\nFury - Infuriating Poison (5 damage a second for 60 seconds)\r\nCalm - Slow Poison (5 damage a second for 60 seconds)\r\nFear - Fearful Poison (5 damage a second for 60 seconds)\r\nFrenzy - Better Infuriating Poison (20 damage a second for 60 seconds)\r\nPacify - Better Slow Poison (20 damage a second for 60 seconds)\r\nRout - Terrifying Poison (20 damage a second for 60 seconds)\r\n\r\nAs of the moment there are no master level spells. There might be in the future.\r\n\r\nTo get the spells, they have been added to most of the spell vendors in the world. To get the higher level spells, you will have to buy them from the illusionist at the college.\r\n\r\nPlease let me know if there are any conflicts with other mods. I am using another mod that does add more bound weapons to every vendor and that does not conflict at the moment.\r\n(Bound Weapon Redux - http://skyrim.nexusmods.com/mods/13643)\r\n\r\nSo far I believe the spells will only work on the monsters that normal spells will work on. That means that will will not affect Undead or Atronaches unless you have the perk that allows illusion spells to work on them.\r\n\r\nAs of the moment on the \\\"Categorized Favorites Menu by favmenumodder\\\" these spells are located in the potions category when you favorite them. I am not sure why this is. ",
  "categoryId": "75",
  "version": "1.0",
  "author": "Elyndr",
  "createdUnix": "1342885091",
  "updatedUnix": "1343015456",
  "containsAdultContent": false,
  "uploadedBy": "Davidahuas",
  "primaryFile": null,
  "files": [
    {
      "fileId": "75736",
      "name": "Illusion Poison Spells",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Illusion Poison Spells-20875-1-0.zip",
      "uploadedUnix": "1342885293",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2c64365017354b055613f3a4233ccd6860bf88e055865faa4b5fdd2e95365a0c/analysis/1407037082/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Illusion%20Poison%20Spells-20875-1-0.zip?fid=75736&ttl=1535789319&ri=8192&rs=8192&setec=d862989c2b82b1d35a54872555c4d330"
    },
    {
      "fileId": "76096",
      "name": "Illusion Poison Spells half Damage",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Illusion Poison Spells half Damage-20875-1-0.zip",
      "uploadedUnix": "1343015456",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b676a7fe5dbf14e66df8acc7b5cb39de29e47f26dc3e62d9fde8fb365bbf017b/analysis/1407040444/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Illusion%20Poison%20Spells%20half%20Damage-20875-1-0.zip?fid=76096&ttl=1535789319&ri=8192&rs=8192&setec=f3e059dceec1ab20f5686ca3e05dab6e"
    }
  ]
}