{
  "modId": 20878.0,
  "modName": "Craftable Sodas Mod",
  "summary": "Add several new craftable sodas to Skyrim, each with different stats! Current flavors are root beer, two types of cream soda (regular and red), and grape soda. Yum!",
  "descriptionHtml": "Ever wanted to kick back, relax, and have a nice drink in Skyrim without worrying about your character becoming piss drunk and unable to fight? (not that that happened anyway) Well worry no more! This mod introduces several different kinds of soda to the game. You can have a root beer, a grape soda, a cream soda or a red cream soda!\r\n\r\nBUT WAIT!\r\n\r\nYou can craft them yourself at a cooking pot! That\\'s right, you get to make your very own soda in Skyrim! Here\\'s how it works:\r\n\r\nTo make a soda, you\\'ll need to have three things: a bottle of water, some sugar, and some carbonate, all three of which are avaliable at Belethor\\'s in Whiterun, with more locations coming in a future update. First, you take the sugar and water and make sugar water (obv.). Next, add in the carbonate to make carbonated sugar water. Now, here\\'s the fun part: hunting down the main ingredient! To make root beer, you\\'ll need firewood (which will be changed to bread in the next version - sort of don\\'t have time to change it now), which can be found throughout Skyrim fairly commonly. Grape soda requires jazbay grapes, which can mostly be found on rocky terrain. Cream soda requires nirnroot, which is very common throughout the world and can be identified by its bright glow as well as its notorious noise. Red cream soda requires crimson nirnroot, which can be found almost solely within the depths of the ruins of the ancient Dwemer city of Blackreach, although it does spawn very rarely in the outside world.\r\n\r\nSo, just to sum up:\r\n\r\nSugar + water=sugar water\r\nSugar water + carbonate=carbonated sugar water\r\nCarbonated sugar water + firewood=root beer\r\nCarbonated sugar water + jazbay grapes=grape soda\r\nCarbonated sugar water + nirnroot=cream soda\r\nCarbonated sugar water + crimson nirnroot=red cream soda\r\n\r\nBut that isn\\'t all! Whenever you drink a soda, you get a sugar rush, the strength of which depends on the soda consumed. Each drink restores stamina and both restores and fortifies health. Here are the stats:\r\n\r\nRoot beer: Fort. health: 15 points for 100 secs/Restore stamina: 15 points/Restore health: 20 points\r\nGrape soda: Fort. health: 17 points for 92 secs/Restore stamina: 19 points/Restore health: 21 points\r\nCream soda: Fort. health: 14 points for 85 secs/Restore stamina: 13 points/Restore health: 16 points\r\nRed cream soda: Fort. health: 22 points for 125 secs/Restore stamina: 17 points/Restore health: 25 points\r\n\r\nAs you can see, it\\'s a bit overpowered, but I think it does a good job of simulating the effects of a sugar rush.\r\n\r\n==FREQUENTLY ASKED QUESTIONS==\r\nQ. Can you add my favorite soft drink to the mod?\r\nA. Sure, but I\\'ll have to call it by a generic name rather than its real-life name, so Sprite would become \\\"lemon-lime soda,\\\" Coke and Pepsi would become \\\"cola soda,\\\" and so on, in order to prevent copyright troubles.\r\nQ. Where can I find the sodas in the game?\r\nA. They\\'re not being sold at any merchants as yet (they will be in the next update). To get them, you\\'ll have to craft them yourself using the instructions above (or cheat them into your inventory, but finding the ingredients yourself is much more fun).\r\nQ. I can\\'t find the ingredients at Belethor\\'s!\r\nA. The mod shouldn\\'t be conflicting with anything. Make sure it\\'s activated by opening up the launcher and clicking \\\"Data files.\\\" In the window that appears, look for \\\"GXO_Craftable Sodas Mod.esp\\\" and make sure the check box next to it is checked. Nine times out of ten, the reason the mod doesn\\'t appear to work is because the box next to it is unchecked, which tells Skyrim to ignore it on startup. \r\n\r\nIf it still doesn\\'t work after ticking the box, then it might be conflicting with something. Try moving it up and down in the loading order by opening up \\\"Data files,\\\" finding it, selecting it, and using the arrow buttons at the bottom of the window to move it up and down in the order.Having the mod at the bottom of the loading order is your safest bet, but you might try a few other places in the order if that doesn\\'t work. If none of these techniques work, then it probably is a bug with the mod, so please feel free to report it here.\r\nQ. Q?\r\nA. A!\r\n\r\n==TO-DO==\r\n-Add more sodas to the mix\r\n-Sell ingredients at more than one shop\r\n-Let vendors sell drinks as well (if there\\'s enough support for it)\r\n\r\n==KNOWN BUGS/CONFLICTS==\r\nNone at the moment\r\n\r\n==SPECIAL THANKS==\r\n-Leegowest for the Soda Mod for Minecraft available at Planet Minecraft, and ASD cake for the More Drinkable Drinks mod over on the Skyrim Steam Workshop for inspiring me to do this mod\r\n-Bethsoft for making such an awesome game, and an awesome modding kit for that awesome game\r\n-You, for downloading, endorsing, and generally showing support for this mod, as well as providing suggestions for improvements and bug fixes. Have a soda, you deserve it ;)!\r\n\r\nPlease feel free to leave any comments, critiques, bug reports, etc. in the comments section. I\\'ll read them all (well, as many as I can, anyway) and base any future versions off of them. Thanks!",
  "categoryId": "94",
  "version": "1.0",
  "author": "GyroxOpex",
  "createdUnix": "1342891039",
  "updatedUnix": "1342891286",
  "containsAdultContent": false,
  "uploadedBy": "GyroxOpex",
  "primaryFile": null,
  "files": [
    {
      "fileId": "75749",
      "name": "Craftable Sodas Mod",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Craftable Sodas Mod-20878-1-0.rar",
      "uploadedUnix": "1342891286",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cc5c18378b38811e93cfdcdd973e90597caff428e657cab6340151717f5140e2/analysis/1407037205/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20Sodas%20Mod-20878-1-0.rar?fid=75749&ttl=1535789324&ri=8192&rs=8192&setec=ea63b9afcffea27a9cf9fe152302345f"
    }
  ]
}