{
  "modId": 20876.0,
  "modName": "Camping Lite DV",
  "summary": "This is a german translation of McGuffin\\\\\\'s brilliant plugin \\\\\\\"Camping Lite\\\\\\\"!\r\nEine deutsche Übersetzung der großartigen Mod \\\\\\\"Camping Lite\\\\\\\" von McGuffin!",
  "descriptionHtml": "Camping Lite DV\r\n===============\r\n\r\nEine kleine und genial gemachte Camping-Mod für Skyrim!\r\n\r\nAutor des Originals:    McGuffin\r\nÜbersetzt von:    LilaMue\r\nVersion:    1.0\r\nDateigröße:    ca. 1.10 MB\r\nAbhängigkeiten:    neuester Skyrim-Patch \r\n\r\n-----------------------------------------------------------------------------\r\nDOWNLOAD VIA MIRROR !!!\r\n-----------------------------------------------------------------------------\r\n\r\n\r\nDiese Mod fügt eine kleine, aber feine und meiner Meinung nach genial Campingausrüstung ins Spiel ein. Die Mod ist für all diejenigen gedacht, die ein ganz gewöhnliches und einfaches Zelt für Skyrim haben möchten. Ebenso ist die Handhabung dieser Mod sehr einfach gehalten und es ist nur das Aktivieren eines einzigen Zaubers (Macht) nötig, um die Optionen dieser Mod nutzen zu können.\r\n\r\nSobald ihr die Mod aktiviert habt, findet ihr außerhalb von Weißlauf in westlicher Richtung ein kleines, verlassenes Lager. Schaut euch dort einfach ein wenig um. Alles Weitere sollte sich dann von selbst ergeben.\r\n\r\nDie Original-Mod von \\\"McGuffin\\\" findet ihr auf Skyrim Nexus in englischer Sprache: http://skyrim.nexusmods.com/mods/11526\r\n\r\nDie Mod ist außerdem mit \\\"Hypothermia\\\" kompatibel. Sie sollte generell mit allen Mods in dieser Richtung kompatibel sein, vorausgesetzt, diese verwenden keine veränderten ID \\'s was die Feuerstelle betrifft.\r\n\r\n\r\nBeschreibung:\r\n--------------------\r\nDas Zelt selbst kann, nachdem ihr gewisse Fähigkeiten durch Lesen eines Buches erlernt habt, an einer Schmiede hergestellt werden. Ihr bekommt in eurem Menü für \\\"Geringe Macht\\\" einen einzigen zusätzlichen Zauber, über den ihr\r\n\r\n- ein Zelt aufstellen könnt\r\n- eine Feuerstelle errichten könnt (mindestens 2 Stück Feuerholz sollten dafür im Inventar sein), bei der ihr die Möglichkeit habt, euch auch eine kleine Mahlzeit zuzubereiten, jedoch ohne Kochvorrichtung direkt am Feuer.\r\n- Feuerholz für das Feuer in der Wildnis suchen könnt (stellt euch dazu einfach vor einen Baum)\r\n- mithilfe eines Kompasses, der ebenfalls an der Schmiede hergestellt werden kann, per Schnellreise zu eurem Zeltplatz kommt\r\n\r\nZelt und Feuerstelle können ganz einfach wieder entfernt werden, indem ihr sie im Schleichmodus aktiviert.\r\n\r\n\r\n\r\nDetails zum Schmieden:\r\n---------------------------------\r\nDas kleine Zelt lässt sich ganz einfach in der Schmiede unter \\\"Sonstiges\\\" herstellen. Es gibt jedoch weitere Gegenstände, die sich ebenfalls an der Schmiede anfertigen lassen, mit denen ihr dann nach Belieben auch ein größeres Zelt aufstellen könnt. Diese Gegenstände sind: \\\"Stahlstange\\\" und eine \\\"Ledererweiterung\\\"\r\n\r\n- Kleines Zelt: kann an der Schmiede angefertigt werden\r\n- Stahlstange: Mit einem kleinen Zelt und einer Stahlstange könnt ihr ein imperiales Zelt errichten.\r\n- Ledererweiterung: Mit zwei kleinen Zelten und der Ledererweiterung lässt sich ein großes Zelt aufstellen.\r\n- Kompass: Er kann an der Schmiede angefertigt werden. Ihr seid damit in der Lage, per Schnellreise über die Karte zu eurem Lagerplatz zu reisen.\r\n\r\n\r\n\r\nDetails zur Feuerstelle:\r\n--------------------------------\r\nIhr müsst zwei Holzstücke in eurem Inventar haben, um die Feuerstelle anzünden zu können. Das ergibt eine Brenndauer von 4 Ingame-Stunden. Habt ihr vier Holzstücke, so brennt das Feuer 8 Stunden. Eine größere Menge wird von der Mod nicht erkannt.\r\nAn der Feuerstelle könnt ihr euer Essen zubereiten, allerdings ohne die übliche Vorrichtung, da es dadurch zu Bugs in der Mod kam. Ich persönlich finde es auf diese Art irgendwie netter.\r\nEs kann nur eine Feuerstelle errichtet werden. Sucht euch dazu eine möglichst ebene Fläche, damit das Feuer gerade plaziert wird.\r\n\r\n\r\nAlle weiteren Details, FAQ etc. zu dieser Mod findet ihr auf SkyrimNexus unter dem von mir oben angeführten Link zur Original-Mod. Die Mod wird so bleiben, Erweiterungen wird es keine geben. Dazu ein Zitat aus der Beschreibung von McGuffin:\r\n\r\nQ: Can you add a tanning rack, an anvil, an alchemy table, a chest, a chair, a room, a house, a city ...?\r\nA: No: I will not add anything at this point. Camping Lite is for camping purpose. It\\\\\\'s not a settler mod.\r\n\r\n\r\n\r\nInstallation:\r\n----------------\r\n- Die gezippte Datei an einem externen Ort entzippen.\r\n- Esp und dazugehörige Dateien in den Ordner: entsprechendes Laufwerk (...meistens C)/Programme/Steam/SteamApps/common/skyrim/Data kopieren\r\n- Esp im Skyrim-Launcher aktivieren\r\n\r\n\r\n\r\nVerwendete Tools:\r\n---------------------------\r\n- Creation Kit\r\n- Skyrim StringLocalizer\r\n\r\n\r\n\r\nLizenz:\r\n----------\r\nFalls ihr Teile dieser Mod verwenden möchtet, dann solltet ihr bitte den Autor um Erlaubnis fragen.\r\n\r\n\r\n\r\nDanksagung an:\r\n----------------------\r\n- Bethesda für Skyrim und das CK!\r\n- McGuffin natürlich für diese wundervolle kleine Mod!\r\n\r\nWenn ihr für die Mod Endorsements vergeben möchtet, dann bitte auf der Seite von McGuffin,\r\ndenn von ihm stammt die geniale Mod. Nicht dass ich selbst allergisch dagegen wäre... oder so, aber immerhin hat er diese geniale Arbeit gemacht.\r\n\r\n\r\nViel Spass mit dem Plugin!\r\nLilaMue\r\n",
  "categoryId": "78",
  "version": "1.0",
  "author": "LilaMue",
  "createdUnix": "1342887607",
  "updatedUnix": "1362073872",
  "containsAdultContent": false,
  "uploadedBy": "LilaMue",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013930",
      "name": "CampingLite DV",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1132",
      "fileName": "CampingLite DV-20876-1-0.7z",
      "uploadedUnix": "1362073872",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b67033f197e22c614aa2a653df6720096cb6e32b963e6e43d49169c8183f95c6/analysis/1407444323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CampingLite%20DV-20876-1-0.7z?fid=1000013930&ttl=1535789321&ri=8192&rs=8192&setec=2ff0850e393e65007a1675efa551bec0"
    }
  ]
}