{
  "modId": 2090.0,
  "modName": "Realistically Darkened Thieves Guild Armor by Will Keith",
  "summary": "Darkened Thieves Guild armor with absolute attention to detail. ",
  "descriptionHtml": "You may have noticed something missing with other people\\'s retexture mods...what\\'s missing? Attention to detail. Recolored Dragonplate without changing the color of the bone on the belt, Mage robes with splotchy colors between cloth, and so on. With me, The Fat Swordsman, you can be sure you\\'re getting the details you deserve. \r\n\r\nI am by no means saying my retextures are flawless, but I can promise you that I work over them nearly pixel by pixel to make sure YOU aren\\'t stuck staring at ugly, overlooked textures on pieces of armor.\r\n\r\nFor this mod, my mission was to realistically darken the different parts of the armor, rather than just setting the saturation and lightness at zero and being done with it. Harder leather is darker than soft leather, cloth parts are lighter than any of the leather, metal buckles are still metal, not absentmindedly set to the same color as the rest of it.\r\n\r\nOf course, both male and female armors are included with this mod. The proof is in the screenshots. View them, see any brown left anywhere? No? My job here is done. Stay tuned for more of my work.",
  "categoryId": "29",
  "version": "1.0",
  "author": "Will Keith",
  "createdUnix": "1322633806",
  "updatedUnix": "1322633876",
  "containsAdultContent": false,
  "uploadedBy": "Fatswordsman",
  "primaryFile": null,
  "files": [
    {
      "fileId": "5482",
      "name": "Realistically Darkened Thieves Guild Armor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1270",
      "fileName": "Realistically Darkened Thieves Guild Armor-2090-1-0.7z",
      "uploadedUnix": "1322633876",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/de9ae90491e60e67ccd8a378574f242f68add308b55165ca5aff05bb609f0f39/analysis/1406460128/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Realistically%20Darkened%20Thieves%20Guild%20Armor-2090-1-0.7z?fid=5482&ttl=1535756158&ri=8192&rs=8192&setec=953c985d372574f768dd3af0005b9821"
    }
  ]
}