{
  "modId": 20925.0,
  "modName": "Game Of Thrones Adaptation Mod For Skyrim v4",
  "summary": "Fight for one of the great houses of Westeros in this new mod, inspired by the A Song of Ice and Fire book series, as well as the HBO show &#39;Game of Thrones&#39;.",
  "descriptionHtml": "A brand-new trailer for the mod, showing off some of the new features:\r<br />\r<br />[youtube]bipsKOL7_Tg[/youtube]\r<br />\r<br />[size=6][color=orange] IN-STORY PREMISE: [/color][/size]\r<br />\r<br />The Seven Kingdoms of Westeros are in turmoil. King Robert Baratheon is dead, and the realm trembles under the weight of war and chaos.\r<br />\r<br />By rights, the Iron Throne should have passed to Robert&#39;s son and heir Prince Joffrey Baratheon, a claim that Robert&#39;s widow and Joffrey&#39;s mother Queen Cersei Lannister is keen to see secured. And with her support comes the might and gold of House Lannister, led by the stern and determined Lord Tywin of Casterly Rock. \r<br />\r<br />However, all is not as it seems. Investigations carried out by the Hand of the King Eddard Stark, Lord of Winterfell, prior to Robert&#39;s death have revealed that the Prince Joffrey is not the son of Robert Baratheon, but rather the spawn of an incestuous affair between Queen Cersei and her twin brother Jaime Lannister - known far and wide as the Kingslayer. Armed with this knowledge, Lord Eddard attempted to secure the throne for Robert&#39;s legal heir, his brother Stannis Baratheon of Dragonstone. His attempt resulted in his capture and sentencing to death.\r<br />\r<br />Joffrey and Stannis are not the only Baratheons with a claim to the Iron Throne, however. The younger Baratheon brother, Renly of Storm&#39;s End, moved swiftly in the aftermath of Robert&#39;s death. Allying himself with House Tyrell and rallying his levies in the Stormlands, Renly marched on the capital of King&#39;s Landing with a host that dwarfed anything Joffrey could muster. Forced to flee the city or die, Joffrey, his mother and most of his court fled to Casterly Rock and the protection of Lord Tywin. Renly took the Iron Throne, though how long his reign will last remains to be seen.\r<br />\r<br />Spared death at the headsman&#39;s block by the appearance of a black dragon, Lord Eddard returns to Winterfell, his seat in the North. However, honour-bound to follow the law and seat Robert&#39;s true heir on the throne, he has declared his support for Renly&#39;s older brother Stannis Baratheon. Stannis himself broods on Dragonstone, marshalling his support and demanding his younger brother yield the throne to him.\r<br />\r<br />With the Starks making common cause with Dragonstone, the Lannisters marshalling behind Joffrey in the West and the ever-opportunistic Ironborn raiding along the Stony Shore, Renly&#39;s position on the Iron Throne seems increasingly precarious. Even now, his once-staunch allies House Tyrell begin to look towards a potential alliance with Casterly Rock, should things go ill in King&#39;s Landing. The realm is splintered.\r<br />\r<br />And now the dragons have returned...\r<br />\r<br />[size=6][color=orange] ~FEATURE LIST&#33;~[/color][/size] \r<br />\r<br />- Westeros comes to Skyrim&#33; The cities and castles have been changed into their Westerosi counterparts, all relative to Winterfell (formerly Windhelm). If one tilts their map so that Winterfell is at the North, you will see that Casterly Rock, the Vale, King&#39;s Landing and all the rest align approximately with their real geographical locations in the books/show. Entirely new locations have also been added; visit the Wall towering over Castle Black, or journey to the isolated island of Dragonstone, where the night is dark and full of terrors.\r<br />- Armours galore&#33; Scores of new armours and outfits have been added to the game, many of them unique sets worn only by certain characters. The sigils of Westerosi houses great and small adorn these new armours, from the direwolf of House Stark to the red stallion of House Bracken and the cunning fox of House Florent. See below for a full list of Houses represented in the mod.\r<br />- Companions&#33; From Arya Stark, to Tyrion Lannister, to Daenerys Stormborn, there are scores of companions for you to choose to take with your in your adventures across Westeros. See below for a full list of companions in the mod and where to find them.\r<br />- Dialogue conversion&#33; Though not voice-acted, all dialogue text in the vanilla game has been converted to a Westeros context. Changes in the story have also been given a Game of Thrones flavour; e.g. Ser Barristan the Bold will speak of his history in the Kingsguard, Davos Seaworth declares why he owes Stannis Baratheon everything, and so on.\r<br />- The text conversion also extends to quest objectives, names and even items - for example, remember those Thalmor dossiers in the Embassy quest? Well now they&#39;re reports written by none other than Varys, the Master of Whisperers.\r<br />- The Civil War is now the War Of The Five Kings; in an altered story specially designed to fit with the Skyrim gameplay, you can now choose where to side with House Stark or House Lannister in the fight for the Iron Throne. Which of Robert&#39;s brothers will you help? Where do the Tyrells sit in all this? What will you do when you finally meet the loathsome King Joffrey?\r<br />- In addition to the new armours, banners and decorations also adorn the land of Westeros. In the newly-decorated Red Keep sits the Iron Throne - but who will you help ascend to that mighty seat?\r<br />- This is just a taste of what is in the mod; from Dothraki khalasars to White Walkers, this mod attempts to bring the world of ASOIAF to your computer screens.\r<br />\r<br />[size=6][color=orange] WHY IS IT SUCH A BIG DOWNLOAD?[/color][/size] \r<br />\r<br />I know that some of you will have gawped at the filesize. That&#39;s...just huge for a Skyrim mod, ridiculously huge, so I thought I&#39;d offer an explanation. \r<br />\r<br />A large part of that download size relates to the mass conversion of non-human species to human in the game&#39;s NPCs that I&#39;ve put into this mod. Each individual of these converted NPCs requires their own FaceGen file; this is the file that tells the game how to texture their skin and facial features. Without it, we end up with the infamous &#34;grey face bug&#34;. \r<br />\r<br />The second major use of download space is the sheer quantity of new armours and textures - not only are the great houses like Lannister and Stark represented, but scores of characters wear customised armours representing their lordly houses, from the likes of House Mormont to House Brax to House Dayne, etc.\r<br />\r<br />[size=6][color=orange] INSTALLATION:[/color][/size]\r<br />\r<br />Simply place the .bsa and .esp files from the .rar into your skyrim/data folder, and tick the GoTAdaptation.esp under Data Files when you launch the game. For best results, start a new game entirely, but it should be mostly compatible with save games (though some character conversions may not work properly).\r<br />\r<br />I have included .esp for the various DLC packages, but you should only load the .esps for the DLC you own or your game will likely not run. NOTE: If using the Dawnguard .esp of this mod, then it is advised that you do not use the Dragonstone.esp as well. There will be no conflict, but you will have two different Dragonstone markers on your map.\r<br />\r<br />If you are finding problems with this mod and are using NMM, consider a manual install:\r<br />\r<br />Step One: Don&#39;t use NMM. It causes more problems than it solves.\r<br />\r<br />Step Two: Unpack V4 of the mod into your steamapps/common/skyrim/data directory (or wherever your game is installed).\r<br />\r<br />Step Three: This will place GotAdaptation.esp and GoTAdaptation.bsa in that directory, as well as additional .esp files. Then, repeat with the v4.1 update, adding GotAdaptation41.esp and the matching .bsa file to the same directory. Repeat again with v4.2.\r<br />\r<br />Step Four: Do the same for the required Apachii Hair mods; make sure you download precisely the correct ones, giving you ApachiiHairs.esm and ApachiiMaleHairs.esm in your data directory, as well as &#39;meshes&#39; and &#39;textures&#39; folders.\r<br />\r<br />Step Five: Do the same for the WIC Cloaks mod, again adding a &#39;meshes&#39; and &#39;textures&#39; folder to the data directory from that mod. Delete the .esp files from this mod (or don&#39;t activate them, anyway).\r<br />\r<br />Step Six: Start your game. On the launcher, click Data Files. Now, move GoTAdaptation.esp to the bottom of the load order list. Then move GotAdaptation42.esp to immediately above it, and GotAdaptation41.esp immediately above that. You should have no mods lower than these, unless you are using the Ultimate Followers Overhaul, in which case you may place this one below them.\r<br />\r<br />Step Seven: Make sure those .esps are ticked, as well as the ApachiiHair ones. Do NOT tick any .esp files for DLC you do not own (Dragonborn/Dawnguard/Hearthfire) or your game will not run. Do not activate the WIC Cloaks esp files either.\r<br />\r<br />Step Eight: Play.\r<br />\r<br />See below for more discussion on this mod and DLC compatibility.\r<br />\r<br />[size=5][color=orange]There are two Required Mods if you wish to get the most out of the Adaptation  [/color][/size];\r<br />\r<br />Winter Is Coming Cloaks: http://skyrim.nexusmods.com/mods/13486\r<br />Several characters have these cloaks assigned to their outfits, but the cloaks themselves are not included in the mod in accordance with their creator&#39;s wishes. However, download them from the creator and they will still appear where they&#39;re supposed to in the mod itself.\r<br />\r<br />Apachii Hairs: http://skyrim.nexusmods.com/mods/10168\r<br />You will require [size=3][b]both[/b][/size] the [color=orange]ApachiiSkyHair_v_1_5_Full[/color] [size=3][b]and [/b][/size] [color=orange] ApachiiSkyHairMale_v_1_1[/color] files from this mod installed to see several characters&#39; unique hairstyles, otherwise they will likely appear bald. Without both these files, and the .esm files they contain, your game will not make it past the Bethesda logo.\r<br />\r<br />NB: When arranging the .esp files in the Data Files of the Skyrim launcher, GoTAdaptation.esp should be as close to the bottom of the load order as possible, with Dragonstone.esp and KingsLandingMarket.esp immediately above it. Only the Ultimate Followers Overhaul .esp file should be below it, ideally.\r<br />\r<br />[size=6][color=orange] IS THIS COMPATIBLE WITH THE DLC?[/color][/size]\r<br />\r<br />Yes&#33; The mod is fully compatible with all three DLC packages, however bear in the mind - the Westeros conversion does NOT currently apply to the DLC. I have included additional .esps for each of the DLC (simply activate those you have when you run the mod, and ignore the others), but at the present these only update loadscreen texts and some place names, and do not constitute full overhauls like the vanilla mod. I have included them in these early forms to help with the immersion - it can be a bit distracting to suddenly have a loadscreen pop up talking about the Dawnguard when you&#39;re trying to bring the war to House Lannister, for example.\r<br />\r<br />In the future I mean to expand the mod to each of the DLCs in turn, with Dawnguard focusing on the Baratheon brothers&#39; civil war and Dragonborn on the war Beyond-The-Wall. \r<br />\r<br />[size=6][color=orange]~HOUSES REPRESENTED IN THE GAME~[/color][/size]\r<br />\r<br />The North; House Stark, House Bolton, House Umber, House Glover, House Mormont, House Manderly, House Cerwyn, House Hornwood, House Karstark, House Tallhart.\r<br />The Westerlands; House Lannister, House Brax, House Marbrand, House Crakehall, House Westerling.\r<br />The Riverlands; House Tully, House Frey, House Blackwood, House Mallister, House Bracken.\r<br />The Crownlands; House Baratheon of King&#39;s Landing, House Baratheon of Dragonstone.\r<br />The Stormlands; House Baratheon of Storm&#39;s End, House Connington.\r<br />The Iron Islands; House Greyjoy.\r<br />The Reach; House Tyrell, House Florent.\r<br />The Vale; House Arryn, House Waynwood, House Royce.\r<br />Dorne; House Martell, House Dayne.\r<br />Other; The Night&#39;s Watch, The Brotherhood Without Banners, The City Watch and more.\r<br />\r<br />[size=6][color=orange]~FOLLOWER LOCATIONS~[/color][/size]\r<br />\r<br />Winterfell Keep:\r<br />- Robb Stark\r<br />- Jory Cassel\r<br />- Smalljon Umber\r<br />- Harwin\r<br />- Hodor\r<br />- Osha the Wildling\r<br />\r<br />Candlehearth Hall, Winterfell:\r<br />- Jojen Reed\r<br />- Meera Reed\r<br />\r<br />Castle Black / The Wall:\r<br />- Jon Snow\r<br />- Samwell Tarly\r<br />- Grenn\r<br />- Qhorin Halfhand\r<br />- Yoren\r<br />- Benjen Stark\r<br />- Dolorous Edd\r<br />\r<br />Lion&#39;s Palace, Casterly Rock:\r<br />- Sansa Stark\r<br />- Podrick Payne\r<br />- Moonboy\r<br />- Ser Ilyn Payne\r<br />- Ser Meryn Trant\r<br />- Ser Arys Oakheart\r<br />- Ser Boros Blount\r<br />- Ser Mandon Moore\r<br />\r<br />Lion&#39;s Tower, Casterly Rock:\r<br />- Ser Raynald Westerling\r<br />- Ser Lyle Crakehall\r<br />\r<br />The Winking Skeever, Casterly Rock:\r<br />- Ser Jaime Lannister\r<br />- The Hound\r<br />- The Mountain That Rides\r<br />\r<br />Docks, Casterly Rock:\r<br />- Jaqen H&#39;ghar\r<br />\r<br />Dushnikh Yal, Dothraki stronghold:\r<br />- Daenerys Targaryen\r<br />- Viserys Targaryen\r<br />- Khal Drogo\r<br />- Ser Jorah Mormont\r<br />- Aggo\r<br />- Jhogo\r<br />- Rakharo\r<br />\r<br />Sleeping Giant Inn, Maidenpool:\r<br />- Tyrion Lannister\r<br />- Bronn\r<br />\r<br />Windpeak Inn, Pyke:\r<br />- Theon Greyjoy\r<br />- Yara/Asha Greyjoy\r<br />\r<br />The Bee and Barb Inn, the Vale:\r<br />- Arya Stark\r<br />\r<br />Highgarden Keep / Highgarden Streets:\r<br />- Ser Loras Tyrell\r<br />- Ser Garlan Tyrell\r<br />\r<br />Skyforge, King&#39;s Landing:\r<br />- Gendry Waters\r<br />\r<br />Dragonstone:\r<br />- Stannis Baratheon\r<br />- Melisandre\r<br />- Davos Seaworth\r<br />- Mathos Seaworth\r<br />- Salladhor Saan\r<br />\r<br />Four Shields Tavern, the Golden Tooth:\r<br />- Ser Barristan Selmy\r<br />\r<br />The Bannered Mare, King&#39;s Landing / King&#39;s Landing Streets:\r<br />- Brienne of Tarth\r<br />- Ser Ronnet Connington\r<br />\r<br />The Brotherhood Without Banners (Hall of the Vigilant):\r<br />- Beric Dondarrion\r<br />- Thoros of Myr\r<br />- Anguy the Archer\r<br />- Tom O&#39;Sevens\r<br />- Lem Lemoncloak\r<br />\r<br />The Royal Guest Hall, King&#39;s Landing:\r<br />- Syrio Forel\r<br />\r<br />Deadman&#39;s Drink, Sunspear:\r<br />- Ser Robar Royce\r<br />\r<br />[size=6][color=orange] RECOMMENDED MODS:[/color][/size] \r<br />\r<br />Ultimate Follower Overhaul: http://skyrim.nexusmods.com/mods/14037\r<br />HIGHLY RECOMMENDED&#33;: If you want to have multiple followers, install this mod but make sure the .esp file for it loads below everything else in Data Files.\r<br />\r<br />Direwolf Companions: http://steamcommunity.com/sharedfiles/filedetails/?id=75553020\r<br />HIGHLY RECOMMENDED&#33; Grey Wind, Ghost, Lady, Nymeria, Summer and Shaggydog are added as followers to the game.\r<br />\r<br />Better Docks: http://skyrim.nexusmods.com/mods/14087\r<br />Adds some more clutter and NPCs to the docks of Skyrim. I particularly like it for its addition to Dawnstar, which serves as Pyke in the mod.\r<br />\r<br />[size=6][color=orange] IS THIS MOD SAVE-GAME COMPATIBLE?[/color][/size] \r<br />\r<br />As far as I am aware, the answer to this is yes. All banners, quest text and place names should apply retroactively to a save game. The only element that can be a little inconsistent are the NPCs, particularly those that are edits of vanilla game ones. If, for example, you load an old save game and find that the guards of Whiterun haven&#39;t updated to Baratheon-style armours, try the following tip courtesy of MrFishi:\r<br />\r<br />&#34;To anyone who wants to update their guard&#39;s armor (as in it is still vanilla) open the console with the &#39;tilde&#39; ` key and click on the guard, type &#34;resurrect&#34; and press enter.&#34;\r<br />\r<br />However, save-game compatible or not, the guaranteed way to get the best results is to start a new game.\r<br />\r<br />[size=6][color=orange] CREDITS:[/color][/size] \r<br />\r<br />These mods are not required as separate downloads to run this mod, as the necessary parts are included in the .esp, but this mod could not have been possible without them:\r<br />\r<br />Credit for many of the ASOIAF followers in this mod go to donkey316, whose own Game of Thrones Followers mod is largely included in this download, though edits have been made (small things, like Ned and Robert no longer being companions, etc):\r<br />http://skyrim.nexusmods.com/mods/17084\r<br />\r<br />Credit for base mesh armours goes to LordofWar, CD Projekt Red, hothtrooper44, Omegared99, ghostrecon123, Bilwit, IRekol, ActusReus and xxxNeoxxx:\r<br />http://skyrim.nexusmods.com/mods/26983\r<br />http://skyrim.nexusmods.com/mods/20618\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=10277\r<br />http://skyrim.nexusmods.com/mods/9645\r<br />http://skyrim.nexusmods.com/mods/19733\r<br />http://skyrim.nexusmods.com/mods/26313\r<br />\r<br />Credit for the cloaks used by most of the great houses goes to Nikinoodles of the Cloaks of Skyrim mod:\r<br />http://skyrim.nexusmods.com/mods/12092\r<br />\r<br />Credit for some of the house shields goes to P3dr0, TheMalfazar and thrashmash:\r<br />http://skyrim.nexusmods.com/mods/13663\r<br />http://skyrim.nexusmods.com/mods/19009\r<br />http://skyrim.nexusmods.com/mods/20469\r<br />\r<br />Credit for the Baratheon Helmet mesh goes to MrFishi\r<br />\r<br />Credit for several of the scarves and hoods go to Grimoa:\r<br />http://skyrim.nexusmods.com/mods/17401\r<br />\r<br />Credit for Oathkeeper and Longclaw go to TheDahaka:\r<br />http://skyrim.nexusmods.com/mods/15781\r<br />\r<br />Credit for the Whiterun Market mod goes to Drakulux:\r<br />http://skyrim.nexusmods.com/mods/11534\r<br />\r<br />Credit for the original Northview Manor base goes to raven1979:\r<br />http://skyrim.nexusmods.com/mods/12523\r<br />\r<br />Credit for the Iron Throne mesh goes to badgremlin\r<br />\r<br />Credit for several of the unique hairstyles goes to Apachii:\r<br />http://skyrim.nexusmods.com/mods/10168\r<br />\r<br />Credit for smoother skin textures goes to Limbek:\r<br />http://skyrim.nexusmods.com/mods/2332\r<br />\r<br />Credit for the crown mesh goes to cyric79:\r<br />http://skyrim.nexusmods.com/mods/34209\r<br />\r<br />Credit for the mesh used by several dresses goes to newermind43 and Natterforme:\r<br />http://skyrim.nexusmods.com/mods/28736\r<br />http://skyrim.nexusmods.com/mods/20077\r<br />\r<br />Honorary mention goes to Doffa, who has created their own conversion mod that adds the Lannisters and Starks to the game. Although none of Doffa&#39;s work is included in this mod, credit goes to him for inspiring the creation of this version.",
  "categoryId": "79",
  "version": "v4.3",
  "author": "Kualan",
  "createdUnix": "1342971037",
  "updatedUnix": "1373185242",
  "containsAdultContent": false,
  "uploadedBy": "Kualan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84932",
      "name": "Game of Thrones Menu Background",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1556",
      "fileName": "Game of Thrones Menu Background-20925-.rar",
      "uploadedUnix": "1346196978",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0d3af4d06910a3d70311d3e5551ddabf32356357d3a3f628aa81edc4c627b070/analysis/1407128949/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Game%20of%20Thrones%20Menu%20Background-20925-.rar?fid=84932&ttl=1535789388&ri=8192&rs=8192&setec=fb4b896b701b923e654a6448c4de4436"
    },
    {
      "fileId": "85849",
      "name": "Game of Thrones Adaptation Mod for Skyrim v3",
      "version": "v3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "974527",
      "fileName": "Game of Thrones Adaptation Mod for Skyrim v3-20925-v3.rar",
      "uploadedUnix": "1346542573",
      "modVersion": "v3",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Game%20of%20Thrones%20Adaptation%20Mod%20for%20Skyrim%20v3-20925-v3.rar?fid=85849&ttl=1535789388&ri=8192&rs=8192&setec=8ee6ad3389c05fb7da060cdf90126082"
    },
    {
      "fileId": "87956",
      "name": "Game of Thrones Adaptation Mod for Skyrim v3 - Dialogue Patch",
      "version": "v3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10337",
      "fileName": "Game of Thrones Adaptation Mod for Skyrim v3 - Dialogue Patch-20925-v3-0.rar",
      "uploadedUnix": "1347415562",
      "modVersion": "v3.0",
      "virusScanUrl": "https://www.virustotal.com/file/13c926869cde184d887d11818509d5dee6fa0eb661957f79fbd700cbd9e86a47/analysis/1407161000/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Game%20of%20Thrones%20Adaptation%20Mod%20for%20Skyrim%20v3%20-%20Dialogue%20Patch-20925-v3-0.rar?fid=87956&ttl=1535789388&ri=8192&rs=8192&setec=b9e7a7996eba10780fd194fdea63e703"
    },
    {
      "fileId": "1000025999",
      "name": "Game of Thrones Adaptation Mod for Skyrim v4",
      "version": "v4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "776405",
      "fileName": "Game of Thrones Adaptation Mod for Skyrim v4-20925-v4-0.rar",
      "uploadedUnix": "1366697463",
      "modVersion": "v4.0",
      "virusScanUrl": null,
      "changelogHtml": " - Added several dozen armours and shields made specially for this mod, including for Houses Tully, Florent, Frey and many many more. <br/> \n - Added several new followers, such as Thoros of Myr and the Reed twins. <br/> \n - Updated the appearance of characters with new outfits and hairstyles, including Melisandre, Cersei Lannister and Renly Baratheon. <br/> \n - Converted more in-game text, including some for all three DLCs. <br/> \n - Adjusted existing armours and outfits to better accommodate each other; use of larger cloaks and scarves that do not clip with plate armour, for example. <br/> \n - Packaged all files into a single .bsa archive, for a more stable installation. Also trimmed any surplus files and organised everything into appropriate folders. <br/> \n - Several minor bugs and glitches fixed; e.g. missing Hodor in Winterfell. <br/> \n - Added more Stark banners to Winterfell <br/> \n - Added the Wall itself to Castle Black. Moved Benjen Stark, Jon Snow and Dolourous Edd to the top. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Game%20of%20Thrones%20Adaptation%20Mod%20for%20Skyrim%20v4-20925-v4-0.rar?fid=1000025999&ttl=1535789389&ri=8192&rs=8192&setec=cf05f2a5e3b56756470a7072601d4572"
    },
    {
      "fileId": "1000027860",
      "name": "Game of Thrones Adaptation Mod for Skyrim v4-1",
      "version": "v4.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "122219",
      "fileName": "Game of Thrones Adaptation Mod for Skyrim v4-1 FIXED-20925-v4-1.rar",
      "uploadedUnix": "1367614857",
      "modVersion": "v4.1",
      "virusScanUrl": "https://www.virustotal.com/file/9c0223f6bbfc38a06457bb4fb72a939298c77d15a6da8ddaa55f298f3f5a3569/analysis/1407553027/",
      "changelogHtml": " - The Red Keep&#39;s appearance has been tweaked to better fit in with the environment. <br/> \n - Ser Meryn Trant, Ser Boros Blount, Ser Arys Oakheart and Ser Mandon Moore of the Kingsguard are now available followers in the Lion&#39;s Palace. <br/> \n - Arya, Sansa, Gendry, Loras, Joffrey, Lancel, Meera, Jojen and Khal Drogo now have unique hairstyles. <br/> \n - Banners adorning major settlements like Winterfell, Riverrun and Highgarden now change depending on which house controls the region. <br/> \n - Riverrun has been expanded from a thatched longhouse into a full castle in its own right. <br/> \n - Roose Bolton&#39;s outfit has been updated with a unique flayed man mantle. <br/> \n - New outfits for Lord Commander Mormont and the Greatjon <br/> \n - New armours for Lord Bracken, Lord Hornwood, Lord Cerwyn, Ser Flement Brax and Ser Forley Prester. <br/> \n - More shields added for Houses Manderly, Mormont, Hornwood, Cerwyn, Bracken and Brax. <br/> \n - Added arakhs to Khal Drogo and Daenerys&#39; bloodriders. <br/> \n - Bolton banners and shields are updated with a new design based on the TV show. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Game%20of%20Thrones%20Adaptation%20Mod%20for%20Skyrim%20v4-1%20FIXED-20925-v4-1.rar?fid=1000027860&ttl=1535789390&ri=8192&rs=8192&setec=30936a9ef43243cf10c96d5732b46bac"
    },
    {
      "fileId": "1000034549",
      "name": "Game of Thrones Adaptation Mod for Skyrim v4-1 Bug Fix",
      "version": "v4.1a",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "1507",
      "fileName": "Game of Thrones Adaptation Mod for Skyrim v4-1 Bug Fix-20925-v4-1a.rar",
      "uploadedUnix": "1371429327",
      "modVersion": "v4.1a",
      "virusScanUrl": "https://www.virustotal.com/file/0bd0747d6c54ebddaa07fb8ee15030f80b7fe0b2161fcbd7d957bbdc62af250f/analysis/1407606516/",
      "changelogHtml": " - Longclaw, Ice, Oathkeeper, Mountain&#39;s Sword and Needle now have correct first-person models. <br/> \n - Asha and Theon Greyjoy can now correctly be found in the inn at Pyke. <br/> \n - Gendry can now correctly be found at the Skyforge in King&#39;s Landing. <br/> \n - Viserys Targaryen can now correctly be found at the Dothraki camp with his sister. <br/> \n - Hodor can now correctly be found in the Winterfell Keep. <br/> \n - Human races are now converted to Andals, Braavosi, Northmen and Dornish. <br/> \n - Ser Loras can now correctly be found walking the streets of Highgarden alongside Ser Garlan. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Game%20of%20Thrones%20Adaptation%20Mod%20for%20Skyrim%20v4-1%20Bug%20Fix-20925-v4-1a.rar?fid=1000034549&ttl=1535789390&ri=8192&rs=8192&setec=0319d12e8fd19520b10013cb161d8289"
    },
    {
      "fileId": "1000036014",
      "name": "Game of Thrones Adaptation Mod for Skyrim v4-2",
      "version": "v4.2",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "8714",
      "fileName": "Game of Thrones Adaptation Mod for Skyrim v4-2 FIXED-20925-v4-2.rar",
      "uploadedUnix": "1372329104",
      "modVersion": "v4.2",
      "virusScanUrl": "https://www.virustotal.com/file/a51866e6155da0bf47cd9261cba30a7104d63fc62d6f9ee0c1d23dbbe48f261c/analysis/1407618732/",
      "changelogHtml": " - King&#39;s Landing has received a major overhaul, to make its appearance closer in line with the source material. <br/> \n - New banners for nearly two dozen Houses of Westeros. They can be found adorning King&#39;s Landing, Winterfell and Casterly Rock. <br/> \n - Appearance tweaks and fixes for several NPCs. <br/> \n - The Hound has been restored. He can now be found at the Winking Skeever once more. <br/> \n - The Red Keep and Iron Throne Room have been further modified. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Game%20of%20Thrones%20Adaptation%20Mod%20for%20Skyrim%20v4-2%20FIXED-20925-v4-2.rar?fid=1000036014&ttl=1535789391&ri=8192&rs=8192&setec=41ab950637c9eebfb7f354c45e8078f1"
    },
    {
      "fileId": "1000037548",
      "name": "Game of Thrones Adaptation Mod for Skyrim v4-3",
      "version": "v4.3",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "249766",
      "fileName": "Game of Thrones Adaptation Mod for Skyrim v4-3-20925-v4-3.rar",
      "uploadedUnix": "1373141194",
      "modVersion": "v4.3",
      "virusScanUrl": null,
      "changelogHtml": " - The Dragonborn and Hearthfire DLC are now fully converted to the GoT Adaptation mod, with quests themed around Dragonglass, Hardhome and the Defiance of Duskendale. <br/> \n - Solstheim is now Beyond The Wall, with locations including Craster&#39;s Keep and the wildling village of Hardhome. <br/> \n - Raven Rock is now the Shadow Tower, with other Night&#39;s Watch forts like the Nightfort, Greyguard and Stonedoor featured. <br/> \n - The Wall now runs the length of the region, with Ser Denys Mallister and Lord Steward Bowen Marsh commanding the Night&#39;s Watch presence. <br/> \n - Mance Rayder, Ygritte, Orell and Tormund Giantsbane are now recruitable followers, located in Hardhome. <br/> \n - Reavers converted to Wildlings, with appropriate gear changes. <br/> \n - Stalhrim is now Dragonglass. <br/> \n - The Dark Brotherhood questline is now fully converted to the Faceless Men - including a quest now appropriately titled &#39;A Red Wedding&#39;. <br/> \n - The Diplomatic Immunity quest now has correctly converted dialogue for the party guests. <br/> \n - Partial conversion of the Dawnguard DLC, mainly based around the Dawnguard main questline, now featuring Ser Cortnay Penrose and the men of Storm&#39;s End. <br/> \n - The Dreadfort is now garrisoned with men of House Bolton. Their alleigance shall lie with whomever controls Winterfell. <br/> \n - The Twins have been restored to order, garrisoned with men of House Frey. Their alleigance shall lie with whomever controls Riverrun. <br/> \n - Karhold can now be found north-east of winterfell. It is garrisoned with men of House Karstark. Their alleigance shall lie with whomever controls Winterfell. <br/> \n - New quest names to better suit a GOT atmosphere. <br/> \n - New armour for Podrick Payne and Lancel Lannister. <br/> \n - A new follower&#33; Osha the Wildling can be found at Winterfell. <br/> \n - Sansa Stark, Arya Stark, Catelyn Stark, Lysa Tully, Cersei Lannister, Margaery Tyrell and the Queen of Thorns now have updated appearances. <br/> \n - Additional details added to King&#39;s Landing and the Red Keep. <br/> \n - Minor name corrections for Lord Cerwyn and Petyr Baelish, and the AI Packages of the Red Keep&#39;s NPCs (to stop people trying to eat lunch at non-existent tables in the middle of the throne room). <br/> \n - Minor new dialogue conversions. <br/> \n - The Kingsguard followers now correctly return to their starting positions after being dismissed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Game%20of%20Thrones%20Adaptation%20Mod%20for%20Skyrim%20v4-3-20925-v4-3.rar?fid=1000037548&ttl=1535789391&ri=8192&rs=8192&setec=6a2991cc554487463feae9e17ad622ad"
    },
    {
      "fileId": "1000037651",
      "name": "Game of Thrones Adaptation Mod for Skyrim v4-3 Grey Face Fix",
      "version": "v4.3a",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "30799",
      "fileName": "Game of Thrones Adaptation Mod for Skyrim v4-3 Grey Face Fix-20925-v4-3a.rar",
      "uploadedUnix": "1373185242",
      "modVersion": "v4.3a",
      "virusScanUrl": "https://www.virustotal.com/file/d3c1b3b3ea1e560329b7c8c662b234d91266768270c00fda126fa0efd9b39f8c/analysis/1407633805/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Game%20of%20Thrones%20Adaptation%20Mod%20for%20Skyrim%20v4-3%20Grey%20Face%20Fix-20925-v4-3a.rar?fid=1000037651&ttl=1535789391&ri=8192&rs=8192&setec=0fb7526b73009aed2307a178d98986ed"
    }
  ]
}