{
  "modId": 20959.0,
  "modName": "Honeyside Sweetener",
  "summary": "The Honeyside home in Riften is probably my favorite of the vanilla player homes, but it was missing a large, hidden armory that any adventurer would need to store all of their valuables! This mod adds a third bedroom to Honeyside with a secret door that leads down deep into a meticulously detailed, large, hidden armory.",
  "descriptionHtml": "The Honeyside home in Riften is probably my favorite of the vanilla player homes, but it was missing a large, hidden armory that any adventurer would need to store all of their valuables! This mod adds a third bedroom to Honeyside with a secret door that leads down deep into a meticulously detailed, large, hidden armory.\r\n\r\nThis mod requires the 1.6 patch or above.\r\n\r\nIf you have already purchased the Honeyside home in Riften and made upgrades, those upgrades are saved in your save game file and may take priority over some of the edits that this mod makes.  I recommend launching from a save where no upgrades have been made to the home.\r\n\r\nThere are some containers in Honeyside (even in the vanilla version, to my surprise) which respawn.  Containers safe for storage are marked \\\"(Safe)\\\".  If the container is not marked safe, obviously don\\'t use it for storage.\r\n\r\nINSTALLATION:\r\nThere\\'s only an esp file.  Add it to your data folder and activate it.\r\n\r\nPLEASE do not leave anything that you\\'re particularly attached to within any of the Honeyside containers when EITHER activating or deactivating this mod.  You WILL lose anything stored in any of the Honeyside containers.\r\n\r\nCONFLICTS:\r\nThis mod has been cleaned in order to eliminate unintended mod conflicts.\r\n\r\nThe only changes to vanilla Skyrim that this mod makes is in the Honeyside interior cell, and therefore any other mod also making changes to the Honeyside interior cell will probably conflict with this mod.\r\n\r\nNOTES:\r\n- Any upgrades you have made to the Honeyside home in Riften in your save game may take priority over changes made by this mod.  This may limit, or completely negate, this mod.  Again, I would recommend launching from a save where no edits have been made to Honeyside.\r\n- The new bedroom and the armory are pre-furnished.  The rest of the home still needs to be upgraded as normal.\r\n- There is no navmesh in the new bedroom or the armory.  The vanilla navmesh for Honeyside has not been altered.  Leave your followers outside the door.  (It is a SECRET armory, after all.)\r\n- Mannequins... they\\'re a necessary evil.  I feel like no armory is complete without them, so this armory adds 13, but they\\'re awfully buggy.  It\\'s not the mod, folks... it\\'s just the nature of mannequins.\r\n\r\nPERMISSIONS:\r\nYou can do anything you want with this mod.  Just please give me any due credit.\r\n\r\nIf you like this mod but you\\'re looking for something a little (a lot maybe?) bigger, check out my mod RENDSPIRE PALACE.\r\nhttp://skyrim.nexusmods.com/mods/23134",
  "categoryId": "67",
  "version": "1.0",
  "author": "Shoeski11",
  "createdUnix": "1343012941",
  "updatedUnix": "1343013029",
  "containsAdultContent": false,
  "uploadedBy": "Shoeski11",
  "primaryFile": null,
  "files": [
    {
      "fileId": "76088",
      "name": "Honeyside Sweetener",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "Honeyside Sweetener-20959-1-0.rar",
      "uploadedUnix": "1343013029",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/424ef874be208ac2a5ae96ea54746bc2ce195a05bdc8f6afcadde6d9eb15a462/analysis/1407040382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Honeyside%20Sweetener-20959-1-0.rar?fid=76088&ttl=1535789449&ri=8192&rs=8192&setec=3623205dbebbf204296a1877e9c4b9f2"
    }
  ]
}