{
  "modId": 20955.0,
  "modName": "Alexandria the Zero",
  "summary": "Custom Female NPC Companion/Follower. She can be married and has powerful ranged weapons.",
  "descriptionHtml": "Alexandria the Zero V2.0 - 7/21/12\r\n--------------------------------------------\r\n\r\nAlso Available On STEAM Workshop With More Screenshots! : http://steamcommunity.com/sharedfiles/filedetails/?id=83092457\r\n\r\nAlexandria is a custom follower I created. She can be found in The Bannered Mare in Whiterun. She uses the baseline stats of Aela the Huntress with more powerful weapons. She currently has an Enchanted Ebony Bow of Frost and a Skyforge Steel Dagger. She is locked at her current level which is 30. Don\\'t worry though because she is a great follower for those who like their followers to lag behind with ranged weapons. She is now marked as Essential and the most important update in this version is you can now Marry her and make her your wife!\r\n\r\nIf you don\\'t own a house yet after the wedding, she will ask you to live with her. If you go back to the Bannered Mare in Whiterun she will be there as it is marked as her \\\"house.\\\" She will stay there like normal, but if you buy a house and ask her to move, she will go to your new house. I have her staying in Whiterun at Breezehome currently. Currently she will only recognize houses that were vanilla (originally in the game) and will not move into a house that was added via a mod. So if you use a house mod she\\'ll stay in The Bannered Mare when she\\'s not following you.\r\n\r\n\r\nV1.0 First Release - 7/17/12\r\n-------\r\nAlexandria is a custom follower I created. She uses the baseline stats of Aela the Huntress with mor epowerful weapons. She carries an Ebony Bow and a dagger. My plan in the future is to implement a custom questline based off of this idea that she is an exiled priestess. That is why she wears the black robes. She is marked as Essential so she won\\'t die.\r\n\r\nShe can be found in the Bannered Mare in Whiterun. Enjoy!",
  "categoryId": "66",
  "version": "2.0",
  "author": "MorpheusZero",
  "createdUnix": "1343008432",
  "updatedUnix": "1343008542",
  "containsAdultContent": false,
  "uploadedBy": "MorpheusZero",
  "primaryFile": null,
  "files": [
    {
      "fileId": "76081",
      "name": "Alexandria the Zero",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Alexandria the Zero-20955-2-0.zip",
      "uploadedUnix": "1343008542",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/82c719ed9815ad6ae2dcfd57ba208362adbec2fcabcac117f1921b4b06c018b5/analysis/1407040213/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alexandria%20the%20Zero-20955-2-0.zip?fid=76081&ttl=1535789441&ri=8192&rs=8192&setec=089c2d45051c625139b0c2835b620c9b"
    }
  ]
}