{
  "modId": 20953.0,
  "modName": "Skyrim Indie Music Scene_Lokirs Ashes",
  "summary": "SKYRIM INDIE MUSIC SCENE MOD  NMM Install Ready!",
  "descriptionHtml": "\r\nSKYRIM INDIE MUSIC SCENE MOD\r\n\r\nLokir\\'s Ashes - Features a new 3 peice band playing together located in the Drunken Huntsman.\r\n\r\n- 7 Original LORE FRIENDLY songs written about people and places in the game world and 1 remake of a Skyrim Favorite!\r\n\r\n\r\nA Bard\\'s life is never easy, and the Bard\\'s College isn\\'t for everyone. Now, it seems a group of Bard\\'s College dropouts have joined together and have been seen recently jamming at The Drunken Bard located in Whiterun Hold. Lead by a young imperial named Battison, the group also consists of Hosh (the VERY large Breton) on drums, and Joma the Drunken Bard. (Famous for getting drunk, smashing all of the lutes in on campus and setting the dean\\'s house on fire all on his first night as a freshman... Needless to say his college career was short lived...) And plays songs that you PROBABLY haven\\'t heard in Tamriel before = P\r\n\r\nThe rag-tag trio is \\\"indie\\\" in every sence of the word, but they have already begun to gather a following from all across Tamriel. With catchy tunes about Vampires, Dragons, Werewolves and much more, there performances are fun, witty and entertaining for the whole family, especially when the whole family is drunk on ale... ... lots of ale!\r\n\r\nSo be sure to stop in to the Huntsman soon and see what at least 4 or 5 people in Skyrim are raving about!! Lokir\\'s Ashes!!! Performing for a limited time! (Most likely)\r\n\r\n------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nHey guys... This is only my second mod so go easy on me. I\\'m an amateur singer/songwriter and rpg lover. I have enjoyed playing skyrim so much over the last 6 months that I wanted to write some music inspired by it.\r\n\r\nYou\\'ll find that the songs i\\'ve included are lore friendly and fit well into the game world (Although there are a few things that are borderline, like tamberine sounds on one song and things like that, nothing major)\r\n\r\nI know that not everyone will dig my style of music, but I tried to make the band and write the songs in a style of the character\\'s I had created in the band, singing about things and people in the game world, or inspired by things happening in Skyrim as opposed to writing songs about the game.\r\nI hope that this approach will make this mod enjoyable for you even is the music is not quite your style. Some of the songs are serious and some are meant to just be silly so I hope you enjoy both sides to this mod.\r\n\r\ni know I could have spent a lot more time on this and made tried to add more \\\"stuff\\\" or make things more perfect but in the end, it is what it is. Not to say I won\\'t make some updates to it but I have spent a lot of time writing and recording the songs and trying to figure out how to make a mod that worked haha. I had no clue what i was doing when I first started. \r\n\r\nCOMPATABILITY\r\n\r\nI don\\'t see any reason why this mod should be incompatible with anything really, unless another mod makes major changes to the interior of The Drunken Huntsman cell.\r\n\r\nINSTALLATION\r\n\r\nSimply Subscribe = )\r\n\r\nUNINSTALLATION\r\n\r\nDo the reverse from above haha and delete.\r\n\r\n\r\n\r\nFinal notes: I had some time off work and made up my mind to make this mod. I hope you guys enjoy it. I know it might not be for everyone but I had a lot of fun making it and am pretty happy with it overall.\r\n\r\nIf anyone is interested in following the status of THIS mod, Future mods, or my songwriting in general than hit me up on facebook or youtube!\r\n\r\nhttp://www.facebook.com/battisonmusic\r\n\r\nhttp://www.youtube.com/battisontube\r\n\r\n\r\nIf you like the tunes then find me, friend me, msg me, whatever! I love to know that other people have enjoyed something i\\'ve created. I used to write and play out full time many years ago and it\\'s something I\\'m hoping to get back into some so please connect with me if you like what I\\'m doing at all and maybe we can get something cool going beyond this little mod = )\r\n\r\nThanks again guys\r\n\r\nBattison James",
  "categoryId": "61",
  "version": "1.0",
  "author": "rtwogtwo - Battison",
  "createdUnix": "1343007116",
  "updatedUnix": "1343571097",
  "containsAdultContent": false,
  "uploadedBy": "rtwogtwo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "76080",
      "name": "indiemusicscene_la",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "21247",
      "fileName": "indiemusicscene_la-20953-1-0.7z",
      "uploadedUnix": "1343007296",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/75e22a3c33a80d73a471abf7cc01a32bc044d4997ce861cc0f2b1c9c58280621/analysis/1407040212/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/indiemusicscene_la-20953-1-0.7z?fid=76080&ttl=1535789438&ri=8192&rs=8192&setec=1429db8ecd1ea4cd2e6e47a93094220f"
    },
    {
      "fileId": "77342",
      "name": "skyrimindiemusicscene_la",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19569",
      "fileName": "skyrimindiemusicscene_la-20953-1-4.7z",
      "uploadedUnix": "1343571097",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/eb607d3b71469a02549f88f8fb5aba0ef04b9d7bb1f0e4ef3b52c2af828b9d92/analysis/1407054015/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/skyrimindiemusicscene_la-20953-1-4.7z?fid=77342&ttl=1535789439&ri=8192&rs=8192&setec=71d8ccb83f88a541f7f98994734d3b25"
    }
  ]
}