{
  "modId": 20994.0,
  "modName": "Summon Synod Engineer - Septimus Signus",
  "summary": "Allows the player to summon Septimus Signus to fight for them. ",
  "descriptionHtml": "================================================\r\n07/25/12 Update Notes:\r\n\r\nVersion 1a and 2a modifies Septimus and his automaton\\'s bomb projectiles into Dwarven Dynamo Cores instead of a fireball and light spell projectile.  Version 1a retains the 24 hour recast imer, while version 2a does not have it.  Special thanks to Jefthereaper for sharing Timeslip\\'s Oblivion BSA unpacker, and to Timeslip for releasing this unpacker because now I can accomplish even further creative abilities for my past and future mods.\r\n================================================\r\n\r\nVersion 1 has a 24 ingame hour recast timer.\r\n\r\nVersion 2 does not have the recast timer and allows the player to summon Septimus indefinitely.\r\n\r\nFirst, I wanted to state that I added Septimus into the Synod faction because I thought it was logical that he used to belong to the group considering the background of their research process involved a lot to do with investigating magical artifacts, more specifically in Skyrim, the Dwemer artifacts.  If you haven\\'t met him yet in the game, you\\'ll understand more why I made this decision.  For further info, read my spoilers section.\r\n\r\nSecond, this mod file also has an a bonus!  I\\'ve added a spell tome that allows the player to learn the Dwemer Spell: Rapid Blaster that Septimus uses, but the player version has no elemental properties, but has a high critical damage rating.\r\n\r\n\r\n***SPOILERS*** \r\nAfter the events of the Oblivion Crisis, the Mage\\'s guild split into two separate factions, the College of Whispers and the Synod.  The Synod are a group of mages and researchers that focus on investigating magical artifacts and attempt to harness the powers contained within the object.  I figured that Septimus would have belonged to the group considering his obsession with everything Dwemer and their \\\"machinations\\\".  With this obsession, Hermaeus Mora took advantage of Septimus obsession and promise him unlimited knowledge Septimus would do the daedric prince\\'s bidding. \r\n***END SPOILERS***\r\n\r\nTo obtain access to the spell, simply go through the main questline, or if you\\'ve already beaten it, go to the location where you meet Septimus and find Septimus\\' Centurion Safe. Of course when I mean Centurion Safe, I meant customized Dwarven Centurion with custom abilities boss fight.  He\\'s not impossible to beat, but he won\\'t go down easily. \r\n \r\nSeptimus Signus is equipped with the following:\r\n\r\n1. Synod Channeling Wand: The standardized magical weapon assigned to all Synod operatives. Low damage output, but perfect for long distance combat.\r\n2. Ballistic Dyanmo Core Grenade: Septimus will toss explosive Centurion dynamo cores at his opponents to release the unstable energies contained within them.  After the explosion the dynamo cores will stablize and allows the player to pick them up.\r\n3. Dwemer Rapid Blaster (Flames) : An ancient Dwemer spell that converts magicka into physical ammunition that can be fired at opponents at a rapid rate.  Septimus\\' version of the spell inflicts additional fire damage when he uses it.\r\n4: Dwemer Magicka Web Network:  An ancient Dwemer device that breaks down its user\\'s molecular structure and to transport them magically using the invisible Magicka web networks to another location.\r\n5. Activate Dwemer Automatons: Septimus will activate 2 to 5 different rare Dwarven automatons to assist him in battle: Dwarven Centurion Blaster, Dwarven Steam Soldier, Dwarven Steam Gunnder, Dwarven Sphere Balistics, and Dwarven Spider Weaver.  Each having their own unique sets of abilities.\r\n6. Custom combat style that focuses on long distance combat, and if danger closes in too much he will use his Dwemer web network device to transport himself to another location to activate his automatons.\r\n7. Upon summoning Septimus, he will be the same level as the player and will level with them up to 81. His followers will level up to 15, but are still capable of holding their own against most leveled foes.\r\n\r\nNotes:  I designed Septimus\\' to be very effective against ranged foes.  Septimus and his automatons will destroy any opponent from long range but I intentionally made them have a slight disadvantage for melee combat.  Although they have a disadvantage in close combat, Septimus has a few tricks up his sleeve to pull through, and will not be afraid to spam dynamo core grenades if necessary.  His Centurion Blaster, Steam Soldier, and Spider Weaver will engage in melee combat and will last long enough to tank for Septimus as he picks away at his foes one by one, or all at the same time with one accurate grenade toss. \r\n\r\nI am working on other mods, and will be making updates to others. Please endorse if you like this. Also, please let me know if you experience any issues using this mod. \r\n\r\nPlease also check out my other mods when you have the chance! Enjoy! ",
  "categoryId": "75",
  "version": "2a",
  "author": "zeroternalz",
  "createdUnix": "1343070147",
  "updatedUnix": "1343222561",
  "containsAdultContent": false,
  "uploadedBy": "zeroeternalz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "76228",
      "name": "Summon Synod Engineer - Septimus Signus",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "17",
      "fileName": "Summon Synod Engineer - Septimus Signus-20994-1.zip",
      "uploadedUnix": "1343070244",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/bdddd740f83aad8950ac2e744c9e0c811d7df246b86d2cd8c92fc37311a81190/analysis/1407041703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Synod%20Engineer%20-%20Septimus%20Signus-20994-1.zip?fid=76228&ttl=1535789501&ri=8192&rs=8192&setec=489fd2dc040605fe03285fa04a6deca1"
    },
    {
      "fileId": "76229",
      "name": "Summon Synod Engineer - Septimus Signus v2",
      "version": "2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "17",
      "fileName": "Summon Synod Engineer - Septimus Signus v2-20994-2.zip",
      "uploadedUnix": "1343070311",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/12f1b8e18fc573aee8eab5fb408bdfed5ed775c27a6ce61679927b2b7bf27eb8/analysis/1407041703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Synod%20Engineer%20-%20Septimus%20Signus%20v2-20994-2.zip?fid=76229&ttl=1535789501&ri=8192&rs=8192&setec=ea01fd549399f42ea8af5c4db29d0a8f"
    },
    {
      "fileId": "76559",
      "name": "Summon Synod Engineer - Septimus Signus v1a",
      "version": "v1a",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "17",
      "fileName": "Summon Synod Engineer - Septimus Signus v1a-20994-v1a.zip",
      "uploadedUnix": "1343222501",
      "modVersion": "v1a",
      "virusScanUrl": "https://www.virustotal.com/file/64463fd6edc96ee9d3dfdaaec64208b41920710f5ffaae9be262c567a02f062c/analysis/1407045266/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Synod%20Engineer%20-%20Septimus%20Signus%20v1a-20994-v1a.zip?fid=76559&ttl=1535789502&ri=8192&rs=8192&setec=1bb63dc11ae6e3418ce96e3fc28826ad"
    },
    {
      "fileId": "76560",
      "name": "Summonn Synod Engineer - Septimus Signus v2a",
      "version": "v2b",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "17",
      "fileName": "Summonn Synod Engineer - Septimus Signus v2b-20994-v2b.zip",
      "uploadedUnix": "1343222561",
      "modVersion": "v2b",
      "virusScanUrl": "https://www.virustotal.com/file/ef3dc6ced1840f6727b2e3eb3df7b01f7b662b0004b77becd5b4feb5e1147e6e/analysis/1407045267/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summonn%20Synod%20Engineer%20-%20Septimus%20Signus%20v2b-20994-v2b.zip?fid=76560&ttl=1535789502&ri=8192&rs=8192&setec=6e360188aee80f12f577129e38d707ff"
    }
  ]
}