{
  "modId": 20996.0,
  "modName": "Summon Soul Shade - Arniel Gane - Summon Arniel Shade Replacer",
  "summary": "This mod replaces the Conjur Spell Summon Arniel Shade, and moves it into the powers section.  Also upgrades Arniel\\'s abilities.",
  "descriptionHtml": "*********************************************************\r\n7/28/12 Revision Notes:\r\nVersion 1a and 2a fixes the stagger effect of Arniel\\'s Blizzard spell on dragons.  It also removes the custom Soul Trap properties against dragons so that the player is not robbed from absorbing a dragon soul.  Use 1a if you want to keep the 24 hour recast timer, or use 2a if you do not want the recast timer.\r\n*********************************************************\r\n\r\nVersion 1 - Has a 24 ingame hour recast timer.\r\n\r\nVersion 2 - Does not have a recast timer.\r\n\r\nI made this mod is a replacer for the vanilla conjuration spell Summon Arniel Shade.  This mod moves the spell from Conjuration and places it into the Powers section of the spell list.  Also, Arniel loses his invulnerablity, but his presence is now indefinite (unless he dies), and is not limited to just 1 minute.  I\\'ve also given Arniel 4 new spells to make up for the loss of his invincibility.\r\n\r\nBefore anyone would ask why I moved the spell from Conjuration to Power, I did this because all my other summons are on the power sections just like the vanilla Summon Spectral Assassin ability..  Personally, I never felt like Arniel\\'s Shade belonged in \\\"Conjuration\\\" based on the parameters of the spell (No charge time and no magicka cost), and should have been a power just like the Spectral Assassin power.\r\n\r\nArniel has the following features:\r\n1. Arniel\\'s Convection: An improved version of the fire spell that he teaches you during one of his quests.\r\n2. Arniel\\'s Solidication: A chilling blast of icy wind that knocks back Arniel\\'s foes.\r\n3. Arniel\\'s Transmission: A spell that transmits a shock explosion at the vicinity of Arniel\\'s targets.\r\n4. Arniel\\'s Conversion: Arniel conjures a Dwemer device that absorbs the life energy of its targets.  The device will pull in its victims within range of its draining radius, and proceed in converting the life energy into soul gems and/or soul collectors (ethereal dwarven spiders) to collect more life energy from foes not within the device\\'s reach.  If the conversion device kills its foes, the body will convert into a spritual residue ashpile containing the victims old belongings.  ( I originally had this make the bodies disappear, but decided against it because some NPCs might hold key items for quests).\r\n5. Modified stats in magicka and speed.\r\n6. Custom combat style that will occasionally lure his foes as if he was running away and then he will use his Conversion spell to trap his foes.\r\n\r\nNotes:  Despite not being invincible anymore and losing his ability as a \\\"ghost\\\" tank for the player, he now is more lethal and can assist the player in taking out multiple foes.  He will die quickly if he\\'s overwhelmed by melee combat, but he is very agile in avoiding arrows so ranged combat is not a problem.  At times he will cast multiple Conversion spells and doing so will totally decimate an area of a map and leave you with a hill of soul gems and rivers of spiritual residue.  His conversion spell also summons soul collectors that will assist in combat as additional damage.  These critters are really weak healthwise, so they usually go down in 1 or 2 hits.  Their purpose is more for distraction.\r\n\r\nI am working on other summons at the moment, and hopefully I\\'ll be able to release more frequently like I used to, life\\'s been kinda hard on me recently.  If there are any issues with this file, please let me know.  Also please endorse if you like the mod, and be sure to check out my other summon spells if you haven\\'t! Thank you for checking this out and enjoy!",
  "categoryId": "75",
  "version": "2a",
  "author": "zeroeternalz",
  "createdUnix": "1343074182",
  "updatedUnix": "1343540269",
  "containsAdultContent": false,
  "uploadedBy": "zeroeternalz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "76240",
      "name": "Summon Soul Shade - Arniel Gane - Summon Arniel Shade Replacer",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "Summon Soul Shade - Arniel Gane - Summon Arniel Shade Replacer-20996-1.zip",
      "uploadedUnix": "1343074272",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b3d5c38068a6afef8032c5665afd03e7f4c9f6cf98763363466b5ccc0a90b3ab/analysis/1407041774/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Soul%20Shade%20-%20Arniel%20Gane%20-%20Summon%20Arniel%20Shade%20Replacer-20996-1.zip?fid=76240&ttl=1535789507&ri=8192&rs=8192&setec=a54f767fef29c692b3364cbc9edc0672"
    },
    {
      "fileId": "76241",
      "name": "Summon Soul Shade - Arniel Gane - Summon Arniel Shade Replacer v2",
      "version": "2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "Summon Soul Shade - Arniel Gane - Summon Arniel Shade Replacer v2-20996-2.zip",
      "uploadedUnix": "1343074308",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/a5e0bb6d75547ea91217b0c148e29ef3686b8f0c2e8593a89197b8af826029fd/analysis/1407041774/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Soul%20Shade%20-%20Arniel%20Gane%20-%20Summon%20Arniel%20Shade%20Replacer%20v2-20996-2.zip?fid=76241&ttl=1535789508&ri=8192&rs=8192&setec=d50c7cb470f4fb0eab139054c758a345"
    },
    {
      "fileId": "77273",
      "name": "Summon Soul Shade - Arniel Gane - Summon Arniel Shade Replacer v1a",
      "version": "1a",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "7",
      "fileName": "Summon Soul Shade - Arniel Gane - Summon Arniel Shade Replacer v1a-20996-1a.zip",
      "uploadedUnix": "1343540219",
      "modVersion": "1a",
      "virusScanUrl": "https://www.virustotal.com/file/e91a00913f09455422ad589de0ecf04cf1728a0c33542e66a1b837945fb3583c/analysis/1407053404/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Soul%20Shade%20-%20Arniel%20Gane%20-%20Summon%20Arniel%20Shade%20Replacer%20v1a-20996-1a.zip?fid=77273&ttl=1535789508&ri=8192&rs=8192&setec=0009aa69880907d9ee605b3f6e9f2ce9"
    },
    {
      "fileId": "77275",
      "name": "Summon Soul Shade - Arniel Gane - Summon Arniel Shade Replacer v2a",
      "version": "2a",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "7",
      "fileName": "Summon Soul Shade - Arniel Gane - Summon Arniel Shade Replacer v2a-20996-2a.zip",
      "uploadedUnix": "1343540269",
      "modVersion": "2a",
      "virusScanUrl": "https://www.virustotal.com/file/2cc77b60f26332f67f38a1a43f2b38b297b0acff77aba9170f858c252fd52427/analysis/1407053464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Soul%20Shade%20-%20Arniel%20Gane%20-%20Summon%20Arniel%20Shade%20Replacer%20v2a-20996-2a.zip?fid=77275&ttl=1535789509&ri=8192&rs=8192&setec=d84bcbf651bd81a7378a5ed4de2cef5a"
    }
  ]
}