{
  "modId": 21039.0,
  "modName": "Angrenost - The Ancient Axe of Kings",
  "summary": "The frozen battle axe of the famous King Olaf the Dragon Slayer - or the Impostor?\r\nFind out...",
  "descriptionHtml": "  \r\n[center][size=6][color=lightblue][b]THE LEGEND OF ANGRENOST[/b][/color][/size][/center]\r\n\r\n\r\nIt is rumored that this mighty weapon was first forged by the same Nord mastersmith and enchanter who forged [b]Wuuthrad[/b], Ysgramor\\'s Axe. The two blades are quite similar, except that Angrenost has that permanent frost aura. The bards say that Angrenost contains the very spirit of Skyrim, and so It was given to the ancient High Kings as a a mark of their rule over that frozen country.\r\n\r\nSo, the famous and dreaded [b][color=lightblue]King Olaf[/color][/b] came into possession of Angrenost, while many contested his rights to a throne he seized by violence. With this weapon, he beheaded the dragon Numinex in Dragonsreach, and thus founded the city of Whiterun. Many Bards of Solitude challenged this heroic version of the story. One of them, [b][color=lightblue]Svaknir[/color][/b], wrote a sarcastic Edda denouncing Olaf\\'s imposture. In order to prove it, Svaknir and his friends from the Bards College stole Angrenost. If the blade had been used against a dragon, the beast\\'s blood would have left its specific mark.\r\n\r\nUnfortunately, Svaknir was caught by King Olaf\\'s henchmen before the bard could publicly expose the king, but Angrenost couldn\\'t be found. Or so It seemed... A tale of the bards says that Svaknir\\'s companions burried the Axe with him. They were too afraid of Olaf\\'s wrath to get Angrenost back to him and by doing so denounce themselves. They also wanted to give their friend a last hommage - the last trick he will play on Olaf.\r\n\r\nNow, the tales tell that the chilling axe is waiting for a new Hero, somewhere deep in the tombs of the Ancient Nords...\r\n\r\n\r\n[size=3][b]INSTALL[/size][/b]\r\n\r\nUncompress into your Skyrim/Data folder. It\\'s just an .esp for now.\r\n\r\n[size=3][b]NOTES & UPDATES[/size][/b]\r\n\r\nThis is a modified version of the Blade of Ysgramor. I thought that this weapon was cool and very lore-friendly but also totally useless: we are not fighting so many elves... So I made a new one with [color=lightblue][b]Chillrend\\'s frost enchantment[/b][/color] - which is so much better and with that cool frost aura - and tweaked the stats a little: [b]2 points more basic damage + increased speed to 0.9.[/b]\r\n\r\nAngrenost can be tempered but is unique, for obvious lore reasons. It can\\'t be forged (are you a legendary ancient nord blacksmith? No) and you can\\'t buy it anywhere, but you can sell it and be damned for it.\r\n\r\nSo... where do you find Angrenost? Well... did you read the Legend on top?\r\n[color=darkred]Bards College Questline[/color]\r\n\r\nGRAPHICS - I know It\\'s not a new model, so if somebody has enough artistic talent so make a new one based on Ysgramor\\'s Blade, please be my guest. Right now I can swap for a glowing runic version of the Draugr battleaxe, if requested.\r\n\r\nLOCATION - I wanted to make Angrenost as a loot on a Draugr Lord but I think it\\'s better (and easier) that way. Let me know in the comments.\r\n\r\nLast, the pictures don\\'t reflect the glowing frost aura but It\\'s there. it makes that weapon a totally new, cool one! it\\'s wielded by my modded Mjoll - also WIP.",
  "categoryId": "55",
  "version": "1.0",
  "author": "Didier47",
  "createdUnix": "1343143311",
  "updatedUnix": "1343493216",
  "containsAdultContent": false,
  "uploadedBy": "Didier47",
  "primaryFile": null,
  "files": [
    {
      "fileId": "76384",
      "name": "Angrenost",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Angrenost-21039-1-0.rar",
      "uploadedUnix": "1343143393",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1bc6fa1e7c611f21e42988f68a5426679b82951c8977e0037d6cf0addd5a2851/analysis/1407043323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Angrenost-21039-1-0.rar?fid=76384&ttl=1535789567&ri=8192&rs=8192&setec=dcb49024b7d9bda2a20140c069a61195"
    },
    {
      "fileId": "77133",
      "name": "Angrenost - Steel Battle Axe",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Angrenost - Steel Battle Axe-21039-1-0.rar",
      "uploadedUnix": "1343493216",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1d26d0d46375de8b4d18e3f4019e9376093e5266b797a2d8eed49d69fa0bd538/analysis/1407052142/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Angrenost%20-%20Steel%20Battle%20Axe-21039-1-0.rar?fid=77133&ttl=1535789568&ri=8192&rs=8192&setec=d7bc9413150889f50b1969f3d34c8bd1"
    }
  ]
}