{
  "modId": 21062.0,
  "modName": "Darker_Caves_Dungeons_Ruins_Towers_Nights",
  "summary": "This mod makes interiors (caves, dungeons etc.) and night time darker so that you have to rely on light sources to see whats around you (eg. torches, light spells). Current update is V1.8",
  "descriptionHtml": "Started 23rd Feburary 2012 V2.0\r\nFinished 2nd May 2012\r\nThis plugin makes interiors (caves, dungeons etc.) and night time darker so you have to rely on light sources(fires, torches, candles, skylights etc.) to see whats around you.\r\n===============================\r\n\r\nInstalling:\r\nPut the .esp file in your skyrim data folder, no other files are needed.\r\nTurn mod on in launher.\r\n\r\n===============================\r\nThis is also on the Steam Workshop\r\n\r\nThis mod makes alot of changes. I would recommend putting this high up in your load order.\r\n\r\nLatest version of this mod includes:\r\n\r\nAll interior cells( excluding towns and cities) have been made darker.\r\nLighting placement in interior cells and exterior cells has been changed. An example being that a torch on a wall has light coming from itself and not from the middle of the room .\r\n\r\nHandheld Torches, Candlelight and Magelight spells now generate a larger light.\r\n\r\nNight time has been made darker. It\\\\\\'s not pitch black but it is difficult to see.\r\n\r\nNight eye has been modified to work better both outside and inside.\r\n\r\nBlackreach has been made darker.\r\n\r\nAll lighting placement is complete. This will be the final update. Any future updates will be to fix any issues that arrise.\r\n\r\n==================\r\nPositives + Negatives\r\n\r\nPositives:\r\nSneaking is easier in the dark as Npc\\\\\\'s and creatures have a harder time spotting you due to the lower ambient light levels.\r\nNight Eye will give you an advantage as it is now acually useful. It works inside and outside.\r\nTorches, Candlelight and Magelight give off a larger light and are very helpful when running around in the dark.\r\n\r\nNegatives:\r\nIt is generally more difficult to see without light sources around.\r\nArchery is more difficult in the dark as it is harder to see targets and judge distance. Night eye is helpful to counter this.\r\nThe Falmer are blind and thus not affected by light. This makes them much more dangerous.\r\nAI pathing(navmesh) doesnt take into account light levels. It only tells an Npc where they can and can\\\\\\'t go. Also when they detect you they can \\\\\\'see\\\\\\' you regardless of light level. Its an AI thing and i cant do anything about it.\r\n\r\n=========================\r\n\r\nBugs and Issues:\r\n\r\nSome People on the workshop have said that this causes the game to crash when loading a game or starting a new game, not everyone has this problem, it seems to be the minority who are experiencing this.\r\nI have not seen or experienced this problem myself. I don\\\\\\'t know what causes this to happen and i dont\\\\\\' know how to fix it, sorry.\r\n\r\nA rare case where the mod will stop working, partially and all together.\r\n",
  "categoryId": "24",
  "version": "2.1",
  "author": "lightningluke",
  "createdUnix": "1343186984",
  "updatedUnix": "1372833376",
  "containsAdultContent": false,
  "uploadedBy": "lightningluke",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000037021",
      "name": "Darker_Caves_Dungeons_Ruins_Towers_Nights",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "805",
      "fileName": "Darker_Caves_Dungeons_Ruins_Towers_Nights-21062-2-1.zip",
      "uploadedUnix": "1372833376",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/03fa82240ce308a7becf53b6602ddea0d482c3f739f1014be146d6b745fbebb0/analysis/1407629533/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Darker_Caves_Dungeons_Ruins_Towers_Nights-21062-2-1.zip?fid=1000037021&ttl=1535789599&ri=8192&rs=8192&setec=8d0b929aae72d170fcc9bd1e11c567d3"
    }
  ]
}