{
  "modId": 21088.0,
  "modName": "Lu Bu Follower - The Three Kingdoms",
  "summary": "Adds Lu Bu as a follower to the Palace of the Kings in Windhelm",
  "descriptionHtml": "\\\"Among men, Lu Bu. Among horses, Red Hare.\\\"\r\n\r\nWell, now you can have them both!\r\n\r\nLu Bu (styled Fengxian) can be recruited from The Palace of Kings in Windhelm. He starts with an Iron Warhammer and no armor. He is skilled in both one and two handed weaponry as well as bows, and can effectively use light or heavy armors. He has more than one battle cry (Shout) at his command. He will level with the player character. He does not require any special mods to use, so he should work with whatever mods you like best. He is a powerhouse of strength and skill, with many perks that help him to be the strongest of the Three Kingdoms series warriors.\r\n\r\nA word on his appearance: I have years of fan experience with Lu Bu, but did not rely on memory to come up with his final form. I looked at several photos for reference from the Dynasty Warriors games as well as actors that have portrayed Lu Bu in movies and on TV, and have done my best to create a version that carries his most familiar traits from these sources within the bounds of what is possible with the Creation Kit. I am not 100% pleased with the outcome, but am completely satisfied that I have done the best I can with what I had to work with. Personal tastes may vary. \r\n\r\nThe Red Hare is a fast horse with a good deal of life (respawns after a while if he dies) that the player owns outside the stables in Windhelm. Picture a faster Shadowmere with a lot more life.\r\n\r\n=========\r\nChangelog:\r\n\r\nIMPORTANT NOTE: Take all of his items before changing versions, or you will lose those items!\r\n\r\nV1.0: Has three shouts (Unrelenting Force, Marked for Death, and Elemental Fury) in his spellbook, but favors Marked for Death. Possibly unable to use the others, though they exist in case future official patches change NPC behaviors. Several Archery, 1H and 2H weapon perks included, centered around speed and decapitations. He does not step lightly (characters with higher intelligences in Three Kingdoms lore will all get the lightfoot perk, as it is wise to avoid traps), but has more health than any of my other followers. Hunting bow respawn bug has been dealt with.\r\n\r\n\r\n________________________________________\r\nMods I\\'ve used to achieve the look in the photos:\r\n(Individual mod sites may contain adult content)\r\n\r\nAstaras Weapon Collection by Astaras: ( http://skyrim.nexusmods.com/mods/20395 )\r\n\r\nOriental weapon and armor set by RavenDier: ( http://skyrim.nexusmods.com/mods/16977 )\r\n\r\nBetter males - Beautiful nudes and faces - New hairstyles by Chris57 and FavoredSoul w/ Gennox Faces: ( http://skyrim.nexusmods.com/mods/2488 )\r\n\r\nImmersive Armors by hothtrooper44 ( http://skyrim.nexusmods.com/mods/19733 )\r\n\r\nThe Art of Magicka by Zonzai and Kalell ( http://skyrim.nexusmods.com/mods/1040\r\n\r\n____________________________________\r\nGraphics (and other) Mods I use and enjoy:\r\nUltimate Follower Overhaul\r\nClimates of Tamriel\r\nSkyrim HD 2k Textures\r\nSkyrim Flora Overhaul\r\nLush Grass\r\nBetter Rocks and Mountains\r\nThe Official HD texture DLC\r\n\r\nAnd too many others to name...\r\n\r\n__________\r\nInstallation:\r\n\r\nUnzip and place all files inside your Skyrim/Data folder.\r\n\r\nBe sure to place LuBuFollower.esp above any follower behavior mods (UFO etc.) in the load order!\r\n\r\n___________________\r\nOther Mods by Author:\r\n\r\nGuan Yu Follower - The Three Kingdoms ( http://skyrim.nexusmods.com/mods/20632 )\r\n\r\nZhang Fei Follower - The Three Kingdoms ( http://skyrim.nexusmods.com/mods/20732 )\r\n___________\r\nFuture Plans:\r\n\r\nSun Shang Xiang, Zhuge Liang, Cao Cao and many more as time goes on. I want to have several representatives from each of the Three Kingdoms eventually.",
  "categoryId": "66",
  "version": "1.0",
  "author": "Vegetaspank",
  "createdUnix": "1343236020",
  "updatedUnix": "1343236120",
  "containsAdultContent": false,
  "uploadedBy": "Vegetaspank",
  "primaryFile": null,
  "files": [
    {
      "fileId": "76586",
      "name": "Lu Bu Follower - The Three Kingdoms",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "175",
      "fileName": "Lu Bu Follower - The Three Kingdoms-21088-1-0.zip",
      "uploadedUnix": "1343236120",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6346f76804422bfccfd2a73a2158642aae712b5c7c411ef340a733bab829643a/analysis/1407045483/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lu%20Bu%20Follower%20-%20The%20Three%20Kingdoms-21088-1-0.zip?fid=76586&ttl=1535789633&ri=8192&rs=8192&setec=f7ed1d3c826a7168e68fcf48659eea44"
    }
  ]
}