{
  "modId": 21093.0,
  "modName": "Aragorn - The King Returns",
  "summary": "Aragorn, Son of Elendil. Inspired in the third movie. COMMENT!",
  "descriptionHtml": "ENGLISH\r\nHello everyone... This is my first creation for The Elder Scrolls V: Skyrim and so, as I am a fan of The Lord of The Rings, I\\'ve decided to create a character similar to our beloved Aragorn. In order to do it, I chose a picture of Aragorn from the third movie, when he went to challenge Sauron to give Frodo a chance... I believe the hair is very similar and, well, I tried to make it look like a true Aragorn, a God among common people. In my saved game, I drastically incresead my character\\'s skills and add all perks and shouts. He\\'s also millionaire and has lots of cool weapons (mods I have).\r\n\r\nCOMMENT AND ENJOY!\r\n\r\n\r\n\r\nPORTUGUESE\r\nOlá fãs do Skyrim!... Esta é a minha primeira criação no Elder Scrolls V: Skyrim e, como tal, porque sou fã da saga O Senhor dos Anéis, decidi criar uma personagem idêntica ao nosso adorado Aragorn. Para isso, eu guiei-me por uma foto do terceiro filme, na cena em que o Aragorn vai desafiar o Sauron para dar ao Frodo uma chance... Eu acho que o cabelo parece idêntico e, bem, fiz o melhor que pude. No meu saved game, o meu personagem tem todos os perks e skills ao máximo, tem todos os shouts, é milionário e tem montes de armas fixe (de mods que instalei).\r\n\r\nCOMENTEM E DISFRUTEM!",
  "categoryId": "26",
  "version": "1.00",
  "author": "cranio1994",
  "createdUnix": "1343249396",
  "updatedUnix": "1343249899",
  "containsAdultContent": false,
  "uploadedBy": "cranio1994",
  "primaryFile": null,
  "files": [
    {
      "fileId": "76605",
      "name": "Aragorn - Son of Elendil",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1138",
      "fileName": "Aragorn - Son of Elendil-21093-1-00.rar",
      "uploadedUnix": "1343249899",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/36cf5239502014c207083d957a093d6932a8024a264957edd60e67cae4bd8e61/analysis/1407045665/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aragorn%20-%20Son%20of%20Elendil-21093-1-00.rar?fid=76605&ttl=1535789654&ri=8192&rs=8192&setec=80e2bea7e55752a90fd030b5d7305133"
    }
  ]
}