{
  "modId": 21112.0,
  "modName": "Bug Bow Beta",
  "summary": "A bow that can be equipped in one hand and gives you amazing powers of hacks.",
  "descriptionHtml": "Video - http://www.youtube.com/watch?v=ShYZwXBpAQs&feature=g-all-lik\r\n\r\nThis mod includes a bound bow that can be equipped and is put in your inventory. The bow is located in Whiterun, in the barrel in front of the blacksmith\\'s store closes to the pathway leading up to the Breezehome. It can be equipped in one hand or in both. When equipped in both hands, it works like a regular bow except it shoots 5 arrows, 4 of which fall straight in front of you. This can be used for duplicating arrows. But this bow really shines when you equip it in the right hand. The effect are:\r\n\r\n-Instant death and instant arrow travel.\r\n-No arrow consumption, so you only need one arrow equipped to use it.\r\n-Auto-aim when near cross-hair, so you have to try at least.\r\n-Sometimes shoots more than one arrow at a time.\r\n-Can be used to launch yourself!*\r\n-Sneaking makes it look like you kill people with flare!\r\n\r\n*The way the bow launches you depends on what POV you are using. When in first-person, it launches you like Whirlwind Sprint, only instantly and around 5 times farther (rough estimate). While in third-person, it will launch you at an incredible speed (most of the time) and continue to propel you at that speed for 10-15 seconds. If you wish to stop traveling while in third-person, you can switch to first-person and it will completely stop you from being propelled. To be propelled, you will have to preform a power swing with the bow. This works in both first-person and third-person.\r\n\r\nWith this mod, there are some glitches. These include:\r\n\r\n-Sliding with bow equipped after shooting, causing you to not be able to shoot unless you change directions (third-person) or jump (first-person). Sometimes while in first-person, it wont let you jump, so to fix the sliding issue you must go into third-person.\r\n-Some NPC\\'s will walk around with this bow and bound arrows instead of there regular bow and arrows. Be wary of them, it is a one shot kill without God mode or immortal mode.\r\n-While sneaking, right click (with nothing in left hand) swings your left fist, punching whatever you are looking at, from just about any distance. Good way to get sneak up!\r\n-System may crash if you use the third-person launch to speed through areas (such as travel from Riften to Winterhold in about 25 seconds).\r\n\r\nNote: When having the bow equipped in the right hand only, and with nothing in left hand, you can use both mouse buttons to fire arrows.\r\n\r\nChanges Log:\r\n-v1.2 Launch\r\n-v1.3 Fixes the problem with the bow appearing in every barrel in Whiterun.",
  "categoryId": "40",
  "version": "v1.3",
  "author": "TokEtin",
  "createdUnix": "1343288256",
  "updatedUnix": "1343342159",
  "containsAdultContent": false,
  "uploadedBy": "Mondragoonest",
  "primaryFile": null,
  "files": [
    {
      "fileId": "76672",
      "name": "Bug Bow Beta",
      "version": "v1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Bug Bow Beta-21112-v1-2.zip",
      "uploadedUnix": "1343288449",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/1bd4a980ed037940021099f6b38ae744a77a531d8a0958d4f9a024cbd2180574/analysis/1407046804/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bug%20Bow%20Beta-21112-v1-2.zip?fid=76672&ttl=1535789672&ri=8192&rs=8192&setec=a078e13c47070d0d2de2b366e980bc88"
    },
    {
      "fileId": "76783",
      "name": "Bug Bow Beta v1_3",
      "version": "v1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Bug Bow Beta v1_3-21112-v1-3.zip",
      "uploadedUnix": "1343342159",
      "modVersion": "v1.3",
      "virusScanUrl": "https://www.virustotal.com/file/95ba8b3eb18197a1026bf30cd021c1126df6c0b97bf1126ab4a15d2889fe0824/analysis/1407048125/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bug%20Bow%20Beta%20v1_3-21112-v1-3.zip?fid=76783&ttl=1535789673&ri=8192&rs=8192&setec=c73df5bd90ea693688a404c5f9388798"
    }
  ]
}