{
  "modId": 21157.0,
  "modName": "CATHEDRAL",
  "summary": "This is the home of a powerful magician, master of the magicians of Skyrim. But it could be the home of a god. Lord of the fog and ice ...",
  "descriptionHtml": "Title: Cathedral\r\nUpdate Skyrim: 1.5 or better.\r\nAuthor: SagonTHX\r\nMain style of player: Arch-Mages, mages, wizards ...\r\nLocation: is indicated on the map, right Whiterun\r\nNote: Lydia does not like to attend this mansion: send her home and enjoy! :)\r\nGratituity: if you downloaded and liked it, please comment and vote.\r\n\r\n\r\nCathedral was excavated in the mountain, and its appearance is monumental. It has a mystical atmosphere and an ambiance equally mythical. Every detail was thought out very carefully so that you have on hand everything you need to be a great warrior in Skyrim.\r\n\r\nCathedral has a library with an office in the temple ancerstral, a laboratory of alchemy and enchantment complete with boiler and distillery, with a herbarium (greenhouse plants) added; large suite with heated pool, room of rest and intimate dinner and fourth with baldachin, many chests and urns to hold their conquests, plaques for guns, mannequins, and the main: the throne room worthy of a myth.\r\n\r\nCheck out the photos, see the video and ... COMMENT AND VOTE, please. This is the only recognition of my work and effort. And it costs nothing!\r\n\r\nFinal note:\r\nThis modifier does not present any conflict in tests done by me. I have over 200 modifiers currently installed. However, I can not guarantee that is compatible with all modifiers currently available on Nexus. Not tested with modifiers like EBN and followers.\r\n\r\nPlease report any bug or crash, for corrections.\r\n\r\nhttp://www.youtube.com/watch?v=Yui349xZSUA",
  "categoryId": "68",
  "version": "1.B",
  "author": "SagonTHX",
  "createdUnix": "1343357048",
  "updatedUnix": "1343436465",
  "containsAdultContent": false,
  "uploadedBy": "sagonTHX",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77013",
      "name": "Cathedral VERSION OF CORRECTION",
      "version": "1.B",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "149",
      "fileName": "Cathedral VERSION OF CORRECTION-21157-1-B.rar",
      "uploadedUnix": "1343436465",
      "modVersion": "1.B",
      "virusScanUrl": "https://www.virustotal.com/file/0068e16c92826dc789682268c63eda46105efbe432c19bb9d759f0806f0c47a9/analysis/1407050884/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cathedral%20VERSION%20OF%20CORRECTION-21157-1-B.rar?fid=77013&ttl=1535789752&ri=8192&rs=8192&setec=9a574465aad34a1e3e308bb5825025d5"
    }
  ]
}