{
  "modId": 21153.0,
  "modName": "Frostfall - Hypothermia Camping Survival DV",
  "summary": "German Translation of Frostfall by Chesko",
  "descriptionHtml": "Dies ist die deutsche Übersetzung von Frostfall, einer Survival-Modifikation von Chesko. Alle Credits gehen an den Autor! Von mir stammt lediglich die Übersetzung.\r\n\r\nGefällt euch die Mod, so ehrt den Autor! Seine Mod, eine ausführliche (englische) Beschreibung sowie die Möglichkeit, ihm ein \\\"Endorse\\\" zu spendieren, findet ihr hier: [url=]http://skyrim.nexusmods.com/mods/11163/[/url] (Thanks to Chesko for his awesome mod)\r\nZum Spielen der deutschen Übersetzung benötigt ihr die originale Version nicht.\r\n\r\n[b]Beschreibung:[/b]\r\n\r\nFrostfall beinhaltet drei Teile:\r\n\r\n[i]Hypothermia[/i]: Dies fügt dem Spieler eine Körpertemperatur hinzu, die weitgehend stabil gehalten werden möchte. Dies geschieht mittels Kleidung, Rüstung, Nahrung und Lagerfeuern, während Klima, Regen, Wasser, Nächte und Stürme dem entgegen wirken. Dein Durchhaltevermögen zeigt sich an den sogenannten EP\\'s (Einwirkungspunkte), die in Abhängigkeit von Ort, Zeit, Witterung und Feuchtigkeit verbraucht werden. \r\n\r\n[i]Überleben in kalten Gewässern[/i]: Regen und Wasser durchnässt deine Kleidung und Rüstung, je länger du diesen Umständen ausgesetzt bist. Begib dich in die Nähe von Schmieden oder Lagerfeuern, um dich zu trocknen.\r\n\r\n[i]Lagerausstattung[/i]: Baue Schlafmatten, Fackeln, Zelte, Kochtöpfe oder Feuerkits, um dir in der Wildniss dein Überleben zu sichern. Je nach Einstellung sind einige Gegenstände nur begrenzt haltbar. Für das Errichten von Lagerfeuern ist Feuerholz notwendig. Ausgerüstet mit einer Holzfälleraxt im Inventar wird dir ermöglicht, in umliegenden Wäldern Holz zu hacken.\r\n\r\n[b]Nützliche Informationen:[/b]\r\nDie Mod beinhaltet das aus W.A.T.E.R. bekannte FX-Plugin Get Wet, welches den Feuchtigkeitsgrad deiner Kleidung auch optisch darstellt. \r\n\r\n[b]Mod-Einstellungen:[/b]\r\nFrostfall liefert ein umfangreiches Menü, mit deren Hilfe einzelne Komponenten der Mod ein- und ausgestellt werden können. So lassen sich für beinahe jeden Geschmack individuelle Einstellungen vornehmen.\r\n\r\n[b]Ich habe die Mod installiert und im Spiel merke ich nichts!?[/b]\r\nZunächst benötigst du das Überlebenshandbuch für Himmelsrand. Du findest eine Ausgabe in der Taverne von Flusswald. Nimm es an dich! Nun werden neue Zauber hinzugefügt: \\\"Überlebenstraining\\\", \\\"Ausrüstung inspizieren\\\" und \\\"Wettersinn\\\". Rufe die Fähigkeit \\\"Überlebenstraining einmal auf und schließe sie wieder. Nun kannst du durch erneutes Lesen des Handbuches diverse Einstellungen an der Mod vornehmen. \r\n\r\n[b]Kompatibilität:[/b]\r\n- Winter is Coming 2.0\r\n- Cloaks of Skyrim\r\n\r\n[b]Derzeit in Planung:[/b]\r\nEine Lightversion mit Kompatibilität zur Nordländer-Ausstattung von Brausebart\r\n \r\n ",
  "categoryId": "78",
  "version": "1.6b",
  "author": "Pandur79",
  "createdUnix": "1343350494",
  "updatedUnix": "1343350572",
  "containsAdultContent": false,
  "uploadedBy": "Pandur79",
  "primaryFile": null,
  "files": [
    {
      "fileId": "76800",
      "name": "Frostfall_1_6b_DV",
      "version": "1.6b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "570",
      "fileName": "Frostfall_1_6b_DV-21153-1-6b.rar",
      "uploadedUnix": "1343350572",
      "modVersion": "1.6b",
      "virusScanUrl": "https://www.virustotal.com/file/5b4d4907a63491e925ac599d3580b81881fc587183834632ad87fef2cfba45d4/analysis/1407048483/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Frostfall_1_6b_DV-21153-1-6b.rar?fid=76800&ttl=1535789749&ri=8192&rs=8192&setec=caff26a6b056fa9ef2445c3f0df5526b"
    }
  ]
}