{
  "modId": 21169.0,
  "modName": "Forest and house",
  "summary": "This adds a beautiful little forest and Underground house into land of Skyrim.",
  "descriptionHtml": "ONLY HOUSE IS UNDERGROUND, THE FOREST AND NESTS WITH PRESENTS ARE NOT.\r\n\r\nThis is a mod with a nice player house that contains everything you need, yes a forge, a tanning rack, Workbench, Grindstone, Enchanter, Alchemy table.\r\nAnd there are mannequins, bedroom, OK, That\\'s enough, but there are a lot of things I did not mention about this mod. And important thing you should know about this mod is that there are NESTS ! Yeah bird nests, but these are special they have all kinds of stuff around or in them so watch for the nests :)\r\n\r\n                                                 ENJOY ! :-)\r\n\r\n-1.1v - fixed light flashing and added a little garden in crafting section.-\r\n\r\n1.2v - Added more trees and nests ,of course and more presents in nests are added and two shrine of Talos, entrance is not in the rock anymore, I added a tent !\r\n\r\n1.3v \r\n-Most of the things are fixed \r\n-There is a special room (Doors to the room are in the Underground house bedroom)\r\n-Big forest area named Wonder world (Doors to the room are in the Underground house bedroom)\r\n\r\n1.4v\r\n-So now The wonder world name is changed \r\n-The entry is not in a tent anymore I added a house (IT IS NOT THE ORIGINAL UNDERGROUND HOUSE) and the Entry to your Underground home is in that house\r\n-So this is the last update hope you enjoy it !\r\n\r\nPlease view the images section for location and to see some parts of house !\r\n\r\nIf you like it endorse If It Is Not A Big Problem . :)  And Vote Of Course.",
  "categoryId": "67",
  "version": "1.4",
  "author": "Marky123",
  "createdUnix": "1343381943",
  "updatedUnix": "1344862389",
  "containsAdultContent": false,
  "uploadedBy": "Marky123",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81269",
      "name": "Forest and house",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "228",
      "fileName": "Forest and house-21169-1-4.rar",
      "uploadedUnix": "1344862389",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/e6e83ff1311cf9a424283a5a386c4f90a78fdac8bb1b46069732419c4322a949/analysis/1407093664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forest%20and%20house-21169-1-4.rar?fid=81269&ttl=1535789771&ri=8192&rs=8192&setec=a6a44ec1d106ead6e7227a9da4cb859f"
    }
  ]
}