{
  "modId": 21207.0,
  "modName": "CK Loading Errors Fix",
  "summary": "This fixes the Vanilla errors that occur whenever one loads the CK.  Normally, one would have to wait until seeing the \\\"Navmeshinfo 00028e37\\\" error, then click \\\"Yes to All\\\"; and THEN the CK would finish loading.  Now you can set the CK to load and walk away should you feel the need.. when you come back it\\'ll be ready to go!  With this fix, the",
  "descriptionHtml": "**********\r\nI, SLuckyD, am no longer developing or supporting this mod.\r\nALSO: since this mod was released, official patches to Skyrim have included new Update.esm files; requiring the changes I make in this fix to be applied to each new Update.esm.  In other words, I recommend NOT using this mod for anything but reference.. should you want to apply the changes I outline below to future Update.esms.\r\n**********\r\n\r\n\r\nCK Loading Errors Fix - v1.0\r\n- another mod-fix by SLuckyD\r\n\r\n*** This is intended for use by MODDERS only.  All it does is prevent the loading errors, nothing more.\r\n\r\n\r\n[SUMMARY]\r\nThis fixes the Vanilla errors that occur whenever one loads the CK.  Normally, one would have to wait until seeing the \\\"Navmeshinfo 00028e37\\\" error, then click \\\"Yes to All\\\"; and THEN the CK would finish loading.  Now you can set the CK to load and walk away should you feel the need.. when you come back it\\'ll be ready to go!  With this fix, the only loading errors you\\'ll ever see are those caused by your own plugins!\r\n\r\n\r\n[REQUIRED]\r\n- Skyrim v1.6.89\r\n- Skyrim Creation Kit v1.6.89\r\n\r\n\r\n[INSTALLATION]\r\n- As with any new mod, fix, update, version, addition, or whatever.. ALWAYS BACK UP YOUR DATA.\r\n- Leave VANILLA copies of Data/Update.esm and Data/Strings/Update_English.STRINGS in those folders\r\n- Copy over the Data/ folder from this Fix\\'s download package\r\n- In the Data/ folder, run the batch file \\\"aaConvertUpdateFiles.bat\\\" (or manually rename the Fix files)\r\n*** No data is changed or lost during this process, only the filenames are changed. ***\r\n\r\nThis simply renames these four files:\r\nData/Update.esm\r\nData/Strings/Update_English.STRINGS\r\nto\r\nData/UpdateORIG.esm\r\nData/Strings/Update_EnglishORIG.STRINGS\r\n-----and-----\r\nData/UpdateFIX.esm\r\nData/Strings/Update_EnglishFIX.STRINGS\r\nto\r\nData/Update.esm\r\nData/Strings/Update_English.STRINGS\r\n\r\n*** Running \\\"aaConvertUpdateFiles.bat\\\" repeatedly will rename everything the opposite each time. ***\r\n(placing a shortcut to it on the desktop makes it convenient)\r\n\r\n\r\nYou can tell if the Fixed files are \\'in play\\' if you see UpdateORIG.esm\r\nIf you see UpdateFIX.esm then the original Vanilla files are \\'in play\\'\r\n\r\n***** WARNING *****\r\nDo NOT run the converter while the CK and/or the game is running.\r\nThis may cause dramatic wailing and gnashing of teeth, among other things.\r\n*******************\r\n\r\n\r\n[IMPORTANT NOTES]\r\n*** Since testing the doors I moved is fairly difficult, as many of them are quest/script/etc related, I did NOT thoroughly test them in-game. (..and I mod WAY more than I play the actual game, so personally I have no need to...)\r\n- Potentially, I could have moved an AutoLoadDoor too far back; which would prevent Player/NPCs from entering.\r\n- Also, moving the doorMarkers could potentially place Player/NPCs in an area which may or may not be in a triggerZone; which in turn may prevent a quest/script/etc from properly running.\r\n= If you don\\'t even play the game and are strictly a modder (such as me), this Fix should have no adverse effects whatsoever in any event.  If you are worried about in-game conflicts, you could replace the original files when playing, then reinstall this Fix when modding/using the CK.. switching back and forth requires nothing special (if always playing the game with the \\'nilla files).\r\n= To do this automatically, I included a simple batch file; which renames the appropriate files.\r\n\r\nIf you encounter any problems, such as broken quests/etc or not being able to enter an AutoLoadDoor, please inform me in this Fix\\'s COMMENT SECTION.  I will fix and update it as soon as I can.  I appreciate your politely constructive feedback should you be inclined to give it.\r\n\r\n***\r\nIt is possible that Steam may auto-replace the files included in this Fix (eg- during a \\'validate content\\' or updating).  If that happens, simply reinstall this Fix.  If you are updating to a version newer than v1.6.89 (whether or not it\\'s a beta version), this Fix may have been rendered obsolete (if Ma Beth actually fixed everything herself), or alter aspects that may have been changed in said update - so do NOT reinstall this Fix until either a newer version can be devised, or I verify that one is not needed.\r\n***\r\n\r\n\r\n[LIST OF VANILLA ERRORS]\r\n(verbatim)\r\n\r\n1-\r\nMASTERFILE: NavmeshInfo 00028e37 has no parent space, ignoring\r\n\r\n2-\r\nMASTERFILE: Errors were encountered during InitItem for reference:\r\nBase:\\'ShipTrapdoor01MinUseHidden\\'(00061435)\r\nRef: \\\"(00099315)\r\nCell: \\'Wilderness\\'(0000967A)(2,-6) in world \\'Tamriel\\'(0000003C)\r\n\r\n3-\r\nMASTERFILE: Errors were encountered during InitItem for reference:\r\nBase: \\'AutoLoadDoor01\\'(00031897)\r\nRef: \\\"(00015E1D)\r\nCell: \\'YngolBarrowExterior\\'(0000B452)(38,11) in world \\'Tamriel\\'(0000003C)\r\n\r\n4-\r\nMASTERFILE: Errors were encountered during InitItem for reference:\r\nBase: \\'AutoLoadDoor01\\'(00031897)\r\nRef: \\\"(0001779F)\r\nCell: \\'KarthwasternExterior03\\'(0000707A)(-34,9) \\'Tamriel\\'(0000003C)\r\n\r\n5-\r\nMASTERFILE: Errors were encountered during InitItem for reference:\r\nBase: \\'AutoLoadDoor01\\'(00031897)\r\nRef: \\\"(0001779F)\r\nCell: \\'KarthwasternExterior03\\\"(0000707A)(-34,9)\\'Tamriel\\'(0000003C)\r\n\r\n6-\r\nMASTERFILE: Errors were encountered during InitItem for reference:\r\nBase: \\'WRShackDoorMinUse01\\'(000FE471)\r\nRef: \\\"(0006767F)\r\nCell: \\'WhiterunExterior10\\'(000095DA)(7,-1)\\'Tamriel\\'(0000003C)\r\n\r\n7-\r\nMASTERFILE: Errors were encountered during InitItem for reference:\r\nBase: \\'dunda14PortalDoor01\\'(0003DC41)\r\nRef: \\\"(0003DC3F)\r\nCell: \\'DA14Interior\\'(0003D62B)\r\n\r\n8-\r\nMASTERFILE: Errors were encountered during InitItem for reference:\r\nBase: \\'AutoloadDoor01\\' (00031897)\r\nRef: \\\"(00015D12)\r\nCell: \\'WolfskullCave01\\'(000151F6)\r\n\r\n9-\r\nMASTERFILE: Errors were encountered during InitItem for reference:\r\nBase: \\'ImpDoorSingleLoad01\\'(0004203A)\r\nRef: \\'HelgenKeep01btoExteriorREF\\'(000909D2)\r\nCell: \\'HelgenKeep01\\'(0005DE24)\r\n\r\n10-\r\nMASTERFILE: Errors were encountered during InitItem for reference:\r\nBase: \\'ImpDoorDoubleLoad01\\' (000439c4)\r\nref: HelgenKeeptoExterior01REF (0005DF95)\r\nCell: \\'HelgenKeep01\\'(0005DE24)\r\n\r\n\r\n[DETAILS]\r\n* While these errors, if left unchecked, don\\'t cause any apparent drama in-game (presumably why they haven\\'t been fixed by Ma Beth yet), they are the source of irritation for many a modder.  This Fix is intended to be used BY MODDERS ONLY; do NOT upload this with your mod as it is NOT necessary.  Do NOT list it as required by User, but feel free to notify them that you used it during development (to quell the paranoid types).\r\n\r\n= Error 1 is caused by an NVMI subrecord in the NAVI record (NAVI grup).  This NVMI points to navMesh that doesn\\'t exist; presumably because it was deleted during the game\\'s development, but the NVMI subrecord was never deleted (presumably because finding it amongst over 10000 NVMIs is a royal pain).\r\n- Fixed by recreating the navMesh that should be there (NAVM formID 00028e37), then altering the NVMI to point to the new location of the NAVM.. which I created new in a custom cell, as not to interfere with anything Vanilla.  [deleting the NVMI subrecord can\\'t work, it\\'s in Skyrim.esm - and altering that file is just foolish]\r\n\r\n= Errors 2 through 10 are all caused by basically the same circumstance; when a doorMarker is placed inside the green radius of an AutoLoadDoor of any kind.\r\n- Fixed by either moving the doorMarker to outside the radius, and/or moving the AutoLoadDoor back (so the other doorMarker is no longer in the radius).\r\n\r\n= In addition to fixing the actual problems, other procedures needed to happen in order to eliminate all errors and make the Fix fully compatible and working.  I used TESvSnip v4.2, Skyrim String Localizer v1.39, and Notepad++ v5.9.8 during the process.\r\n- I had to add several new entries to the ONAM subrecord of Update.esm\\'s HEDR record.  These are necessary for certain REFR and ACHR records that exist in multiple ESM files.  While not ALL records these types need to be in the ONAM, I have yet to discern the actual criteria for this; so I added ALL records to be sure.  If I or someone else figures out the criteria, in a future version I will remove the extraneous data accordingly.  (meanwhile, there are only a couple dozen so it won\\'t affect performance)\r\n- I had to recreate the localized strings for the FULL subrecords of the CELL records.  This was necessary in order to restore the Update.esm as close to Vanilla/Skyrim.esm as possible.\r\n\r\n\r\n[IMPORTANT INFO RELATING TO TESvSNIP]\r\n*** DO NOT USE THIS FIX if you are among those who believe TESvSnip corrupts data in anything it touches... go back from whence you came; as this Fix may likely destroy everything you\\'ve ever done since birth.  For more information on this or to intelligently discuss it somewhere other than this Fix\\'s Comment Section, please visit the APPROPRIATE/OFFICIAL threads, such as\r\nhttp://skyrim.nexusmods.com/mods/5064\r\nhttp://skyrim.nexusmods.com/mods/21202\r\n\r\n(the v4.3 \\\"Discontinued\\\" page is hidden, but the thread can still be accessed; 4.2 is the older version, but for now is the newest publicly available version).\r\n\r\n- When using TESvSnip, I ensure COMPRESSION IS DISABLED.  Also, I ensure that under the \\\"Options\\\" pulldown that \\\"Hex Mode\\\" and \\\"Use New Subrecord Editor\\\" are both CHECKED.  If these three things are not done, YES, Snip4.2 can and will corrupt data; but I have yet to see evidence proving data corruption when these essential precautions are followed.  There are other precautions I adhere to as well, such as never using any of the \\'bells and whistles\\' of Snip (the \\\"Spells\\\" pulldown for instance)... only straight hexEditing, copy/pasting (using cntl-C/V, NOT the r-click menu), and flipping record flags.\r\n\r\n- I also use a custom recordStructure.xml file to make the necessary edits, linked to below.\r\n\r\n\r\n\r\n[UNINSTALLATION]\r\n- Copy your two BACKUP files to the Data/ folder, overwriting the two files of this Fix.\r\n= Should you have forgotten or couldn\\'t be bothered with backing up your data, open Steam and do a \\'verify content\\' (or whatever that option is that restores everything to the latest versions).\r\n\r\n- Alternatively, you can run \\\"aaConvertUpdateFile.bat\\\" to restore the originals.. then delete the Fix\\'s files.\r\n\r\n\r\n[LEGAL]\r\nBethesda (or \\\"Licensor\\\" as defined in the Skyrim EULA) is not the author of the \\\"Customized Game Materials\\\" included in this package.\r\n“THIS MATERIAL IS NOT MADE, GUARANTEED OR SUPPORTED BY THE PUBLISHER OF THE SOFTWARE OR ITS AFFILIATES.”\r\n\r\nSLuckyD is not responsible for any damage these materials may cause, and/or failure to successfully deliver any stated products or services.\r\n\r\n\r\n\r\n[OTHER SLuckyD RELEASES]\r\n\r\n- TESvSnip RecordStructure XML File\r\nhttp://skyrim.nexusmods.com/mods/21202\r\n\r\n- Gokstad Sailable Viking Ship & Portable Player Home\r\nhttp://skyrim.nexusmods.com/mods/5432\r\n(this was the first Skyrim mod to implement real-time sailing/flying using multiple objects)\r\n\r\n- Moving Target Practice\r\nhttp://skyrim.nexusmods.com/mods/28336\r\n\r\n- Overlook Tower Player-Home\r\nhttp://skyrim.nexusmods.com/mods/4514\r\n(this was the first Skyrim mod to offer a non-Vanilla Player-home)\r\n\r\n- Portable On-demand Disposable Unlimited Mannequins (SPODUM)\r\nhttp://skyrim.nexusmods.com/mods/10578\r\n\r\n- Vanilla Mannequin Script Fix\r\nhttp://skyrim.nexusmods.com/mods/10652\r\n\r\n- Ring of Fortify Carry Weight plus 10000\r\nhttp://skyrim.nexusmods.com/mods/8520\r\n\r\n- Faster Woodland Creatures\r\nhttp://skyrim.nexusmods.com/mods/4799\r\n\r\n- Wounded Knee Gulch\r\nhttp://skyrim.nexusmods.com/mods/3787\r\n(this was the first Skyrim mod to offer a new dungeon)\r\n\r\n- Bullseye\r\nhttp://skyrim.nexusmods.com/mods/2945\r\n(this was the first Skyrim mod to offer a new worldSpace, as well as several other \\'preCK firsts\\')\r\n\r\n\r\n[OTHER PROJECTS I\\'VE ACTIVELY CONTRIBUTED TO]\r\n\r\n- Flyable Dragon Race Revamped\r\nhttp://skyrim.nexusmods.com/mods/17178\r\n(I did the ground-detection, which auto-switches the dragon to walking mode)\r\n",
  "categoryId": "82",
  "version": "1.0",
  "author": "SLuckyD",
  "createdUnix": "1343423230",
  "updatedUnix": "1343423292",
  "containsAdultContent": false,
  "uploadedBy": "SLuckyD",
  "primaryFile": null,
  "files": [
    {
      "fileId": "76972",
      "name": "CK Loading Errors Fix v1_0",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "157",
      "fileName": "CK Loading Errors Fix v1_0-21207-.rar",
      "uploadedUnix": "1343423292",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/39b802078cce854aeb730065c78b080ec13c00e3c433263684c971d62f71533a/analysis/1407050467/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CK%20Loading%20Errors%20Fix%20v1_0-21207-.rar?fid=76972&ttl=1535789864&ri=8192&rs=8192&setec=f6dd4b8c77ebd559310485e0bd55793f"
    }
  ]
}