{
  "modId": 2120.0,
  "modName": "Rainbow Dragons AHOY",
  "summary": "Rainbow dragons, what more can I say?",
  "descriptionHtml": "RAINBOW DRAGONS! That\\'s right! RAINBOW DRAGONS!\r\n\r\nCome one! Come all! I bring you here today to enjoy this visually striking mod! Feast your eyes upon a real pleasure! Treat your mind to wonder! Treat your very soul (if you believe in that sort of thing) to the awe-inspiring dragons of Skyrim! But these are not ordinary dragons, these are NEW IMPROVED(TM) dragons! Say goodbye to the old, boring dragons and say HELLO to RAINBOWS! These new dragons are both soothing and exciting at the same time, reminding you of the simpler days before rainbows were endangered by the infamous \\\"rainbow hunters\\\" of recent years (MidgetCat is awesome, check out his pony shields, they create a great asset to this beautiful modification!) while giving you the thrill of almost dying. Wanted a Rainbow Square on your wall? With this mod, all one needs to do is equip a fire spell, shoot a wall and BAM! instant Rainbow Square! Great for house decoration! Did I mention the dragons are now RAINBOWS? The dragons are now RAINBOWS. Download now for your rainbow goodness!\r\n\r\nIf you are a fellow brony, one must simply check out this spectacular pony shield mod, provided by the one and only MidgetCat, which can be found here: http://skyrimnexus.com/downloads/file.php?id=609 \r\n\r\nYou may need to download 7zip to extract the file. 7zip is an excellent open source compression tool that is better than WinRAR. Download it now! http://www.7-zip.org/ DO IT! Cats rock! (Description by MidgetCat)\r\n",
  "categoryId": "29",
  "version": "1.0",
  "author": "ToXiiC",
  "createdUnix": "1322661335",
  "updatedUnix": "1322661434",
  "containsAdultContent": false,
  "uploadedBy": "ToXiiCzz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "5557",
      "name": "rainbow_dragons",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "274",
      "fileName": "rainbow_dragons-2120-1-0.7z",
      "uploadedUnix": "1322661434",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1075bbe9da12f2038435933a13cabdff69f53b642480bcc4c79c26ab3c8179b6/analysis/1406460904/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/rainbow_dragons-2120-1-0.7z?fid=5557&ttl=1535756210&ri=8192&rs=8192&setec=194d5e269071818beeb0302146bcfff3"
    }
  ]
}