{
  "modId": 21202.0,
  "modName": "TESvSnip RecordStructure XML File",
  "summary": "This copy of the recordStructure.xml file, used by TESvSnip, represents what may be the most comprehensive collection of decoded plugin data structure for Skyrim.  It contains all the information used by Snip to interpret a Skyrim plugin\\'s data, and to show User various descriptions of that data in the app.",
  "descriptionHtml": "[TESvSnip v4.3.1s2 is available on this page.  For its description, scroll down past the XML info.]\r\n\r\nTESvSnip RecordStructure XML File v1.6\r\n- based on TESvSnip v4.2\\'s XML file, with modifications by SLuckyD\r\nhttp://skyrim.nexusmods.com/mods/21202\r\n\r\n\r\n[SUMMARY]\r\nThis copy of the recordStructure.xml file, used by TESvSnip v4.3.1s2, represents what may be the most comprehensive collection of decoded plugin data structure for Skyrim.  It contains all the information used by Snip to interpret a Skyrim plugin\\'s data, and to show User various descriptions of that data in the app.\r\n\r\nI have gone through the entire XML file, line by line (several times over), and have updated, changed, deleted, and added innumerable data types and descriptions; and cleaned up the code to make it easier to read, more efficient, and smaller.  I\\'ve created DOZENS of test plugins in the CK for this sole purpose; and have tested every single data block for accuracy, circumstance, and any special notes that seem to occasionally apply.\r\n\r\nALL TYPES OF RECORDS AND SUBRECORDS HAVE BEEN DECODED (unless noted in the XML file).  I\\'ve also removed size limitations on dynamically sized subrecords, which would have caused truncation of data (in the SPECIFIC event that Snip\\'s \\\"new non-hex subrecord editor\\\" is used to edit such a wrongfully limited record).  I\\'ve tried to use wording/descriptions as close to the CK as I possibly could, taking but very few artistic liberties.\r\n\r\nEven if User chooses NOT to edit a plugin\\'s data with Snip: the app itself, combined with this updated XML file, can be useful to those who want to VIEW their plugin\\'s data in a \\\"human readable\\\" format... and is more succinct and easier to use than the CK in many areas.  It is invaluable for operations such as identifying dirty edits, dupe records, data suspected to be corrupted for whatever reason, or whatever else one may find it useful for.\r\n\r\n[The version number of this XML file does NOT have anything to do with the actual TESvSnip app.  It\\'s only a number to differentiate between this particular file and any future updates of it I may release.]\r\n\r\n***\r\nPlease report any errors or omissions you find!!  I will try my best to fix them, should they arise.  Also, I welcome any suggestions, ideas, or discussion - given they are presented in a polite and pertinent manner.\r\n***\r\n\r\n[If you suspect an error, an easy way to know if the XML is faulty is to look at the \\'Subrecord List Window\\'.. if any of them do NOT have a \\'Description\\' then the XML needs to be fixed or your plugin is corrupt (please post an as-is list of the subrecords which this occurs for, and under which record-type).]\r\n\r\n\r\n\r\n[REQUIRED]\r\n(This XML file may actually be used independent of Snip to aid one\\'s knowledge of decoding a plugin\\'s data structure.  I suggest the free app, Notepad++, set to the XML language, then press alt-2/3/4/5 to collapse all the branches.  It\\'s actually what I use to edit the file.)\r\n\r\n- TESvSnip v4.3.1s2\r\nhttp://skyrim.nexusmods.com/mods/21202\r\n(earlier versions will NOT work, subsequent versions by other dev teams may be incompatible)\r\n\r\n\r\n[INSTALLATION]\r\n- copy the file \\\"RecordStructure.xml\\\" to the folder, yourSnipInstall/Conf/\r\n\r\n\r\n\r\n[ADDITIONAL INFO]\r\n\r\nAvailable on this download page, is the latest version of TESvSnip, v4.3.1s2.  This version fixes several issues with previous versions (such as v4.2, and the Truncation Bug still present in v4.3.1).  Since the data in this version of Snip is saved to disk in the SAME FORMAT that the CK uses (the rfc1951 standard), there should be no worries over claims by fear-mongers and purists that only zlib apps can be used.\r\n\r\nIn fact - by making those claims, these individuals illustrate how little they understand the data structure, file compression, and how it differs between various memory-only/internal compression routines (these being the only differences between zlib and SharpZipLib, and have no bearing on the finished compression format).\r\n\r\n\r\n= For more information on TESvSnip, how to properly use it, how to avoid data corruption (inadvertently by User and/or caused by bugs; using 3rd party apps and/or the CK), or for intelligent and polite discussion about the app - see the Comment Section of this download.\r\n\r\nI highly suggest you do NOT seek information posted on most 3rd party threads, as they tend to be full of outdated info regarding PREVIOUS versions of Snip (before v4.3.1s1), ambiguous and unproven misinformation, overgeneralizations, unchecked negativity, willful ignorance, and unprofessionalism.  Snip v4.3.1s2 is the only version currently available in release form which fixes serious issues; and it doesn\\'t have ANY complaints or bug reports to-date.\r\n  \r\nhttp://skyrim.nexusmods.com/mods/21202\r\n  \r\n- You MAY hold discussion or pose questions at the Comment Section for THIS download.  I\\'ve been using TESvSnip since December \\'11 and am very familiar with most aspects of the app and its advanced usage.. and I\\'ll try to answer anything I can, whenever I get the chance.\r\n  \r\n  Now that I\\'ve gone through every single record-type and subrecord-type no less than three times EACH, and have been working with all of them extensively, I have a good idea of how it all fits together.\r\n\r\n*****  \r\nI have NO doubt that one of the most serious threats to a stable and non-buggy experience of playing a modded Skyrim is DIRTY EDITS.  Having dirty edits in several plugins may cause the entire game to start to break down - from localization strings and water levels, to unintentionally permanent persistence and fubar locations (potentially breaking AI packages and quests, which prevents aliases from filling causing the whole thing to become crippled).  Additionally, certain data from Vanilla records may be stripped or changed, causing conflict and/or inadvertent reversion to the Vanilla state.\r\n*****\r\n\r\n\r\nI am NOT a developer of Snip, I only have been decoding the plugin data structure and updating Snip\\'s XML.  The Snip v4.3.1s2 I released has the Truncation Bug fixed and the \\\"flags1\\\" of records updated..  and is a perfectly viable version of Snip which can be safely used; otherwise it is completely the work of others.  ALL other credit for the app itself goes to wmrojer, thefigment, and others involved in earlier development.\r\n\r\nThank you for your interest, support, patience, and feedback regarding TESvSnip and this XML file update!!\r\n\r\n- This XML file is an EXTREME modification of the one included with TESvSnip v4.2\r\n(buggy and NOT recommended for plugin editing; only use for viewing, if anything at all)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=5064\r\n\r\n\r\n\r\n[DETAILS]\r\n\r\n== ALL 125 OF THE RECORD-TYPES HAVE BEEN DECODED; though there are scattered bits of unknowns (each is individually noted in the XML file, and in descriptions which User will see when using Snip).\r\n\r\n- BE AWARE that some record-types may not display completely in decoded format;  Snip isn\\'t able to correctly display repetitive groupings of a certain type yet (eg: element-level), nor can it apply formulas to certain data (only display it as-is).\r\n\r\n- Subrecords containing this kind of data are still decoded (unless noted), and I show you an example of the decoded data, but cannot show it decoded in its entirety.  Formulas are shown in the record/subrecords\\' descriptions where applicable.\r\n\r\nWhere possible, I\\'ve shown a couple examples of these repetitive blocks in the subrecord; followed by a \\\"(rest of data)\\\" which allows the subrecord to be as large as it needs to be.  This allows you to see a token representation of your data (the decoded examples before the \\'rest of data\\').\r\n\r\nFrom this you should be able to see the pattern and apply it to the \\'rest of data\\'.  You ARE still able to edit the raw data shown in \\'rest of data\\', using the \\\"Hex-Mode\\\" editor (under Options).  I don\\'t know if active development of Snip is working to remedy this limitation (ie- allow repeating groups of elements, among other things).\r\n\r\n\r\n*****\r\nUNKNOWNS: I\\'ve removed all the \\\"notininfos\\\" from element-level data, so you may see EVERYTHING a plugin has inside it - and form your own opinions as to their purpose.\r\n\r\n- As stated, data which I was unable to decode and/or find in the CK will usually be noted in the record/subrecord\\'s Description (in Snip, and noted in the XML), will be in parentheses, and be preceded by the data type I have assigned it.  I still have to go back through the 10,000+ lines of XML code to ensure everything complies to this, but I have started this process - the next release should see it finished.\r\n\r\nExamples:\r\n\\\"b(always 0)\\\" would be a BYTE value and is apparently the same value every time (and may be a \\\"data buffer\\\" separating different blocks)\r\n\\\"i(0/4/255)\\\" would be an INT value, and always shows one of the shown values\r\n\\\"f(usually 1)\\\" would be a FLOAT value, and is ALMOST always the same value\r\n\\\"b(45, usually 0)\\\" would be a BYTE value which is almost always the same 0 value, but occasionally there is a 45\r\n*****\r\n\r\n\r\nView the XML file itself to see my notes as to what I suspect is legacy, an unknown, is CK-inaccessible, and/or have various other special issues.  There are WAY too many to list here (hundreds), so I recommend using Notepad++ (set to the XML language), press alt-2/3/4/5 to collapse branches; then either expand each as you want to view more details, or do a search for what you are specifically looking for.\r\n\r\nIf a record still has unknowns, it means that I\\'ve all but given up on decoding it.. the data most likely isn\\'t accessible from the public version of the CK or perhaps it\\'s in a legacy format; maybe I just overlooked something or made a mistake.  In any event, I doubt I\\'ll revisit these as I spent enough time on them to know they probably don\\'t affect anything..  lemme know if you find something important, or if something is incorrect/incomplete/etc.\r\n\r\n\r\n\r\n== The following MAY contain repeating Model/Tex data (only when alternate textures are specifically assigned), and/or repeating Destruction info.. these are the ones that only show part of the data decoded with an example block. (37 total, in order of appearance)\r\n\r\nHDPT, SCRL, ACTI, TACT, ARMO, BOOK, CONT, DOOR, INGR, LIGH, MISC, APPA, MSTT, GRAS, TREE, FLOR, FURN, WEAP, AMMO, NPC_, LVLN, KEYM, ALCH, IDLM, PROJ, HAZD, SLGM, ANIO, EXPL, DEBR, BPTD, ADDN, CAMS, IPCT, ARMA, ARTO, MATO\r\n\r\n(alphabetical: ACTI, ADDN, ALCH, AMMO, ANIO, APPA, ARMA, ARMO, ARTO, BOOK, BPTD, CAMS, CONT, DEBR, DOOR, EXPL, FLOR, FURN, GRAS, HAZD, HDPT, IDLM, INGR, IPCT, KEYM, LIGH, LVLN, MATO, MISC, MSTT, NPC_, PROJ, SCRL, SLGM, TACT, TREE, WEAP)\r\n\r\n(There are relatively few examples of the above, these are the records which use extensive destruction or alternative texturing; and will have some of that extensive data displayed in raw format.. and again, may still be edited in \\'Hex-Mode\\'.  Aside from these, most records of these types will be shown completely in decoded format.)\r\n\r\n\r\n\r\n== The following may contain data which can be localized; and probably IS if it\\'s a Vanilla form.  The CK WILL STRIP THIS localization from a plugin during normal saving; SO BE AWARE, if you care about localization, that it needs to be fixed or replaced with 3rd party software before public release.. this should be done after all CK edits are finished. (53 total, in order of appearance)\r\n\r\nGMST, CLAS, FACT, HDPT, RACE, MGEF, ENCH, SPEL, SCRL, ACTI, TACT, ARMO, CONT, BOOK, INGR, MISC, LIGH, APPA, MSTT, TREE, FLOR, FURN, WEAP, AMMO, NPC_, KEYM, ALCH, PROJ, HAZD, SLGM, REGN, CELL, WRLD, REFR, PHZD, PGRE, DIAL, INFO, QUST, LSCR, WATR, EXPL, PERK, BPTD, AVIF, ARMA, LCTN, MESG, WOOP, SHOU, SNCT, COLL, CLFM\r\n\r\n(alphabetical: ACTI, ALCH, AMMO, APPA, ARMA, ARMO, AVIF, BOOK, BPTD, CELL, CLAS, CLFM, COLL, CONT, DIAL, ENCH, EXPL, FACT, FLOR, FURN, HDPT, GMST, HAZD, INFO, INGR, KEYM, LCTN, LIGH, LSCR, MESG, MGEF, MISC, MSTT, NPC_, PERK, PGRE, PHZD, PROJ, QUST, RACE, REFR, REGN, SCRL, SHOU, SLGM, SNCT, SPEL, TACT, TREE, WATR, WEAP, WOOP, WRLD)\r\n\r\n\r\n\r\n== The following MAY contain data which seems to be legacy data leftover from some previous game\\'s data structure (Oblivion/Fallout/whatever), cannot be accessed by the public version of the CK, or for whatever reason is changed/destroyed by the CK (sometimes caused by bugs, such as in TACTs).\r\n\r\n- I came to these conclusions primarily because these blocks are either destroyed or replaced when edited in the CK; and usually only a relatively few Vanilla forms of their kind have this legacy data while most are in the \\'new\\' format (sometimes even reflected in the different formID numbering, presumably the legacy data having been created at the beginning of Skyrim\\'s development several years ago, thus having a \\'lower\\' formID #).\r\n\r\nEditing ANY part of the following records in the CK triggers the legacy-updating when saved.. which is actually desirable (ie- the data is now stored in the \\'new Skyrim standard\\').  In other words, if you edit some data for any reason whatsoever, then save it in the CK, the entire edited record is updated (ie- deletes/changes those legacy/etc blocks).\r\n\r\n***** I do NOT recommend Snip-editing these record-types in their Vanilla state (eg- manually snipping over a record directly from Skyrim.esm, then editing it as-is). The CK should first be opened, the data edited (even if just temporarily changing a minor aspect, such as a single letter in the name), and then SAVED IN A PURE-CK plugin BEFORE editing it in Snip..  This will ensure that one doesn\\'t edit a \\'worthless\\' or anathema subrecord, and then wonder why those changes magically disappeared later \\\"for no reason\\\" or why it simply \\\"doesn\\'t work\\\". (25 total, in order of appearance)\r\n\r\nCLAS, RACE, SOUN, TACT, ALCH, WTHR, CELL, WRLD, NAVM, ACHR, REFR, PGRE, PHZD, INFO, QUST, PACK, CSTY, WATR, IMGS, IMAD, AVIF, DOBJ*, SCEN, MATO, SNDR\r\n\r\n(alphabetical: ACHR, ALCH, AVIF, CELL, CLAS, CSTY, DOBJ*, IMAD, IMGS, INFO, MATO, NAVM, PACK, PGRE, PHZD, QUST, RACE, REFR, SCEN, SNDR, SOUN, TACT, WATR, WRLD, WTHR)\r\n\r\n[* - DOBJ record exists in Vanilla, but the CK writes all the data in this record as zeros, PLUS any changes made in the CK.  CK-made DOBJ records have an EDID subrecord added (whereas Skyrim.esm\\'s doesn\\'t); this COULD potentially signal that the subsequent data is to be ADDED (ie- not used as an override record).  If it doesn\\'t, the original (+changes made manually) would have to be spliced over every time the plugin was saved in the CK. If not respliced, this would (if applicable at all) in turn destroy the entire game by affecting actor\\'s movement, and various other fundamental aspects of mechanics and basic functionality.  Since I have no idea what \\'Default Objects\\' do, I see no apparent reason to edit or include this record-type in a plugin; so I recommend not touching it at all unless for experimental purposes.  For experimental purposes, the DOBJ data is accessed in the CK through the Gameplay Pulldown, \\'Default Objects\\'.]\r\n\r\nACHR - SCHR subrecord is deleted when record is edited and saved in the CK\r\nALCH - ENIT subrecord contains legacy data which the Skyrim game-engine doesn\\'t use (addiction data; 1 formID and 1 float)\r\nCELL - some data in interiors\\' XCLW and XWCU subrecords are reset to 0 when record is simply reopened in the CK (then saved); LNAM and XNAM subrecords are deleted when record is edited and saved in the CK; TVDT and MHDT seem to be unused legacy data which apparently cannot be accessed in the CK (though deleting them have no apparent affect); XCLR subrecords\\' formID entries shuffle when saved in the CK\r\nCLAS - checkboxes are NOT saved by the CK (recharge/training)\r\nCSTY - CSMD subrecord deleted when record is edited and saved in the CK\r\nDOBJ - CK overwrites ALL the data with 0s (zeros), then adds the changes made in the CK (accessed under the Gameplay pulldown); if original not included in Skyrim.esm the game\\'s physics and fundamentals don\\'t function properly (that\\'s why the CK can never save Skyrim.esm, un-ESM-flagged, as a viable ESP)\r\nIMAD - contains several subrecords which seemingly cannot be accessed in the CK\r\nIMGS - ENAM subrecord is deleted when record is edited and saved in the CK\r\nINFO - contains dialog data which seemingly cannot be accessed in the CK; DATA, SCHR, QNAM, NEXT subrecords are deleted when saved in the CK\r\nMATO - contains Gamebryo-specific data which seemingly cannot be edited in the CK\r\nNAVM - ONAM, PNAM, NNAM subrecords exist only in records contained in a cell which the CK cannot access (00000025 NavMeshGenCellDUPLICATE001) [when this cell is duplicated in Snip, and all the formIDs made unique, the CK autoconverts all the NAVMs to REFRs/primitiveMarkers; I believe these are \\\"cutout\\\" navMeshes for various objects/statics/furniture/etc.  I think it\\'s possible that these subrecords aren\\'t even used anymore if the actual NIF/HVK data is read in lieu of them.]\r\nPACK - SCHR, TNAM, SCDA, SCTX, PFOR subrecords are deleted and/or replaced when record is edited and saved in the CK\r\nPGRE - SCHR subrecord is deleted when record is edited and saved in the CK\r\nPHZD - SCHR subrecord is deleted when record is edited and saved in the CK\r\nQUST - SCHR, SCTX, and QNAM subrecords are deleted when saved by the CK (SCTX actually has Oblivion-like script functions still; eg- 0008D5DA); aliases must be individually edited and saved to be updated in the record\r\nRACE - Vanilla DATA subrecords have 36bytes added to them when saved in the CK, which is seemingly inaccessible in the CK; the DATA subrecord also has a block which is always reset if User opens the record in the CK then saves it (any tab, without editing), this is the NoCombatInWater flag and it gets Checked by the CK (presumably by a bug); contains data which seemingly cannot be accessed in the CK\r\nREFR - XMBP and SCHR subrecords are deleted when record is edited and saved in the CK\r\nSCEN - SCHR, SCTX, NEXT (when in a specific position), and QNAM subrecords are deleted when saved by the CK\r\nSNDR - FNAM subrecord is deleted when record is edited and saved in the CK\r\nSOUN - FNAM and SNDD subrecords are deleted when record is edited and saved in the CK\r\nTACT - PNAM subrecord value reset to 0 when record is edited and saved in the CK\r\nWATR - DNAM subrecord contains data which seemingly cannot be accessed in the CK\r\nWRLD - RNAM and OFST subrecords are deleted when record is edited and saved in the CK; MHDT subrecord contains data which seemingly cannot be accessed in the CK (though manually deleting it has no apparent affect); MNAM subrecords have an additional 12bytes added to them with CK v1.8\r\nWTHR - DNAM, CNAM, ANAM, BNAM, ONAM, NAM2, NAM3 are deleted when record is edited and saved in the CK; contains data which seemingly cannot be accessed in the CK\r\n(for more specific info on these, see the XML file for my notes)\r\n\r\n\r\n== The following FOUR record-types contain data which is COMPRESSED by the CK, as well as being found that way in the Vanilla ESMs.  If this data is saved uncompressed (eg- by Snip while compression is disabled), the game and the CK can still read it perfectly fine.  If an uncompressed plugin is opened by the CK, then immediately saved, it re-compresses the plugin and may harmlessly shuffle some of the data (for unknown reasons, perhaps to make it harder for 3rd party apps to \\\"clean\\\" plugins).\r\n\r\nCELL, LAND, NAVM, NPC_\r\n\r\nI do NOT recommend attempting to use compression on any record-types other than these four.  Personally, I recommend disabling compression altogether in Snip, then CK-save the plugin before final testing, and compare the before/after to ensure all data is intact (THEN do final testing in-game).  If you do attempt compression (especially on records not intended for it), as always, please experiment and test fully before releasing anything publicly; and keep your backup plugins well organized (Snip v4.3.1s2 auto-backs-up so you have no excuse if YOU mess something up by doing whatever).\r\n\r\n\r\nAll the rest of the data-types should be stored by Snip as binary-identical to the same CK-saved plugin.  Exceptions to this are anything which has scripting attached to it in any way (containing a VMAD subrecord).\r\n\r\n\r\n***** For whatever reason, the CK actually SHUFFLES the order of any filled properties in the raw data - each and every time the file is saved in a new CK session. To see for yourself; save a plugin (with something scripted and having multiple properties), exit the CK, restart/reload the CK, and immediately save it again (without editing anything) - those two files will have the VMAD data different.. the second-one-saved has been shuffled, and possibly other data in the plugin shuffles as well.\r\n\r\nI call this the \\'CK SHUFFLE\\' and it appears to be harmless, in any event.  A ramefication of this though, is having difficulty identifying \\'dirty edits\\' and dupe records.. since it\\'s possible that the CK will shuffle data in ALL records it saves, including those dirty records.  In other words, they won\\'t be identical to the Skyrim.esm record anymore - and will show as different in a binary comparison from plugin to plugin; even though ALL the data is actually the same (just stored in a different order).\r\n\r\nAdditionally, the order in which a group of records appears in the plugin is also sometimes shuffled by the CK (eg- the first record stored may become the last, bumping all the rest \\'up one\\').\r\n\r\n[RACE records have various subrecords shuffled, even when saved in the same CK session]\r\n\r\n*****\r\nBecause of this CK-Shuffling of data, the CK\\'s compression algorithms use different \\'key\\' data-blocks from one file to another; therefore the resulting file may be larger or smaller than other versions of the SAME file saved in a different session of the CK.  Depending on the content of one\\'s plugin, this differential may be HUNDREDS of bytes or even kilobytes (such as with my SPODUM Mannequin mod - which has over 60 new actors, all having scripts).  Again, this is CAUSED BY THE CK, without User having made ANY changes to the plugin - it happens simply by opening the file, saving it, exit, backup, reopen, resave, and compare.\r\n*****\r\n\r\n\r\n\r\n=== As for accuracy and completion of the decoding, I concede there may be circumstances that I haven\\'t come across which triggers new subrecords to be created, or some data to be changed that I haven\\'t seen yet.\r\n\r\n- An important example of this happening is when one assigns a \\'Persistence Location\\' to a placed actor (an ACHR); this creates a subrecord not only in the placed actor\\'s ACHR record, but also a new subrecord in the corresponding LCTN record.  This is important because it creates an OVERRIDE copy of that LCTN if an intentional one doesn\\'t already exist in the plugin.  The LCTN is where \\'Location\\' data is stored - and affects quests, AI packages, and possibly other essential aspects of the game... and is likely responsible for INNUMERABLE conflicts and issues - especially for Users playing with dozens and dozens of mods.\r\n\r\n*** In the above type of example, even after the \\'Persistence Location\\' flag is removed from the actor, the LCTN record will remain and the ACHR will stay persistent.. forever.  Using 3rd party software (or possibly with fiery-hoop-jumpery in the CK), the override LCTN record must be manually removed from the plugin, and the ACHR must be manually moved out of the persistent-grup.\r\n\r\n\r\n*****\r\nPLEASE post any discrepancies you may find; lemme know if there are any problems, type-os, or whatever.  Bug reports should provide what\\'s wrong, what causes it, and how to recreate the circumstance; before/after files should exist as well if applicable.\r\n*****\r\n\r\n\r\n[VERSION HISTORY]\r\nv1.6\r\n- updated REFRs; regarding Primitives and their Collision Layers; also, XNDP subrecord moved for CK-repositioning\r\n- CLAS record was updated to include all of the pulldown options for autocalc, and to include the ICON subrecord\r\n- EFSH record updated\r\n- ARMO, ARMA, RACE records have BOD2 subrecord added\r\n- removed some extra stuff in various records; regarding data which repeats (now only appears if present), and some notininfo\\'s\r\n- WRLD records have MNAM subrecords\\' size limit removed, to allow for camera height/pitch\r\n- EDID subrecord added to NAVM records\r\n- RACE has been updated to include mount data\r\n- CSTY record has been updated to include new data the CK can change\r\n\r\nv1.5\r\n- updated RACE, IMAD, LCTN, and the LEGSCRIPT group (legacy data relating to old-school scripting, which the CK deletes)\r\n- fixed REFR (water-current mislabelled as legacy), SCEN (rare instances of PNAMs for Package Actions not recognized, and Duration for Timer Actions)\r\n- all notininfos removed from element-level data\r\n- added new subrecord types for Dawnguard (under NPC_, REFR, LCTN)\r\n\r\nv1.4\r\n- updated DOBJ, FURN\r\n- fixed VMAD (though still cannot display ALL data properly), QUST, SCEN\r\n- MODEL group changed a little\r\n- few minor changes; added a boat-load of notes to the XML\r\n- more updates of descriptions, decoding of unknowns, reordering, and code clean-up\r\n- started to remove notininfo=\\\"1\\\" from element-level data (so User can see everything in Snip, to ensure complete transparency.. in the event I overlooked something or made a mistake)\r\n\r\nv1.3\r\n- removed the size constraint on the JNAM subrecord in WTHR records (which may cause issues if editing it in the \\'new subrecord editor/non-hex mode\\')\r\n- LCTN fixed (the elusive RCPR subrecord was added)\r\n- PACK fixed (QNAM occurs in yet another spot, PFOR identified as legacy)\r\n- few minor changes; added a bunch of notes to the XML\r\n- more updates of descriptions, decoding of unknowns, reordering, and code clean-up\r\n\r\nv1.2\r\n- IMAD record is updated to show more decoded data (as opposed to just one block worth then the rest in raw format); this is only pertinent to animated IMADs\r\n- MODT subrecord in the MODEL grouping is updated to properly display several blocks of data instead of having it all in raw format (it still cannot be completely displayed in decoded form because Snip can\\'t handle element-level groupings yet)\r\n- couple minor changes; added a bunch of notes to the XML\r\n- more updates of descriptions, decoding of unknowns, reordering, and code clean-up\r\n\r\nv1.1\r\n- GMST record fixed (when I made the subrecord EDID into a grouping, I mistakenly deleted the segment that allowed GMST to show decoded data based on its name)\r\n- added all the empty top-level GRUPs, just to be thorough and notify people not to use them\r\n- added the MOVT record-type, which didn\\'t exist before\r\n- more updates of descriptions, decoding of unknowns, reordering, and code clean-up\r\n\r\nv1.0\r\n- modification of TESvSnip v4.2\\'s XML file, added new record types, changed incorrect data, updated descriptions, cleaned up the code (by creating groupings which repeat, etc)\r\n\r\n\r\n[UNINSTALLATION]\r\n- Copy your backup of the \\\"RecordStructure.xml\\\" file to the folder, yourSnipInstall/conf/.\r\n= The original v4.2 XML is NOT recommended for ANY use; it is vastly incomplete and contains NUMEROUS errors, some of which may corrupt your plugin if edited using older versions of TESvSnip.\r\n\r\n\r\n===========================\r\n===========================\r\n\r\nTESvSnip v4.3.1s2\r\n- based on wmrojer\\'s v4.3.1b\r\n- minor edits made by SLuckyD\r\n\r\n*** Truncation Bug has been prevented.  The app will now exit when trying to load a plugin which has the type of pre-existing corruption which triggers the Bug. ***\r\n\r\n** I also edited some of the descriptions for the \\'flags1\\' of records\\' headers (isMarker, ESMfile, compressed, etc). **\r\n\r\n***** Snip, the CK, and COMPRESSION\r\n- SharpZipLib saves the compressed data to the plugin file using the \\\"deflate\\\" format (as per \\\"http://www.ietf.org/rfc/rfc1951.txt\\\").  This is the same format that zlib uses (all versions).  Version numbers don\\'t matter as both SharpZipLib and zlib have been using the same rfc1951 format the whole time; newer versions only seek to add new features or fix bugs in the implementation.\r\n\r\n- This version (v4.3.1s2) of TESvSnip uses SharpZipLib for compression (because it is written for use with c# apps), while the CK is said to use zlib (v1.2.3).  BOTH of these methods of compression save data in the SAME standard \\\"rfc1951 format\\\"; which is why the CK can read a \\'Snipped\\' plugin, and Snip can read pureCK plugins.\r\n\r\n- If people want to ensure the most-Bethesda-like format, zlib would be the logical (if unnecessary) choice - but shouldn\\'t they be implementing v1.2.7 (the latest) which eliminates certain bugs that the v1.2.3 is known to have?\r\n\r\n- The reason the ACTUAL compressed data from a Snip-compressed file (SharpZipLib) is different from a CK-compressed file (zlib), is because one is more efficient than the other; depending on implementation.  When decompressed, the data will ALWAYS be the same though,  as per the standard rfc1951 format. The decompression process does NOT require a particular dictionary or implementation - only that the compression format used is rfc1951 compliant.\r\n\r\n- How is this possible?  Because one spends more time scanning the uncompressed data for similar blocks than the other; which usually means better compression.  Better compression means the compressed data will be different in a binary comparison, but the uncompressed data will remain the same.  It simply finds more blocks of data which can be switched out during its internal processing.\r\n\r\n- Example: if \\\"This string this string this string this string\\\" is analysed, one type of compression would say that \\\"his string\\\" is the common block to compress, while another may spend a little more time analyzing and deduce that \\\" this string\\\" is the common block.. so each will be stored slightly different, yet when decompressed they will still say the same phrase.\r\n\r\nConsider the following....\r\n\\\"This_string_this_string_this_string_this_string\\\"\r\ncompression #1: \\\"T$_t$_t$_t$\\\"\r\n($ = \\\"his_string\\\")\r\ncompression #2: \\\"T@t@t@this_string\\\"\r\n(@ = \\\"his_string_\\\")\r\ncompression #3: \\\"This_string%%%\\\"\r\n(% = \\\" this_string\\\")\r\ncompression #4: \\\"T$_t@t@t$\\\"\r\ncompression #5: \\\"T$%%%\\\"\r\n\r\n*** ALL FIVE are examples written in the SAME compressed format (which is a fictional representation of the rfc1951 deflate format used in Skyrim plugin and master files).  When decompressed they will ALL show the original, uncompressed data.\r\n\r\n\r\n- NPC_, NAVM,  LAND, and CELL records are the ONLY RECORD TYPES in Skyrim.esm that are compressed..  same with CK generated plugins.  Any other records that are compressed are wrongfully done so by 3rd party software, which risks having the game-engine misinterpret the data; mainly due to the possibility of code which was intended to read non-compressed data ONLY.  If such code is presented with non-spec data, it may cause unpredictable results; thus do I recommend NOT using compression on any record-types other than NPC_, NAVM, LAND, and CELLs, if any at all.\r\n\r\n(some NPC_ records, which do not have scripts attached to them, actually are compressed by Snip identically to the CK)\r\n\r\n- CK can read Snipped files, and vice versa, because they both use the rfc1951 format; which is one of the most prevalent industry standards.  If one cannot read the other, than the data has become corrupt somehow - presumably from User tampering with raw data in a 3rd party app (even though the CK itself has been shown to corrupt data during normal usage).\r\n\r\nTheoretically, this corruption could  happen if file operations were somehow interrupted during the compress/save routines (eg- system crashes to warm reboot); leaving Users oblivious to the damage until trying to use the plugin somehow.\r\n\r\n- Why should we care about compression at all?  In my opinion, we shouldn\\'t - not in the slightest.  Since only four types of records are compressed by default (the only \\\"fully acceptable\\\" Skyrim format), the amount of disk space saved by compressing these records is negligible.  The insignificance of the savings is exacerbated by modern technology\\'s speed and size.. wanting to save a few KB of space on a 7200rpm 500GB hard drive is ludicrous; as is the minute amount of time saved in end-user\\'s download time for the finished plugin.  If one is hell-bent on compression - the plugin should be loaded into the CK, then immediately saved to ensure THE most-correct compression.\r\n\r\n- In my opinion, it seems that compression is being phased out of the game, based on the reduced numbers of compressed types compared to previous games.  The more game resources come pre-compressed (DDSs, NIFs, WAV/MP3/etc, PEX, etc) the less the game needs it own data compressed to make the entire package feasible (\\'fit into a given\\' such as a DVD or a certain target downloadable size). This also serves to reduce the number of potential issues during the compress/decompress processes; while saving processor time and resources.\r\n\r\n\\\"But what about my gigantic total-conversion of Skyrim?  I could compress all 1000MB of my ESM file down to 700MB (but it doesn\\'t work in-game).\\\"  Ma Beth didn\\'t release the CK and allow us to modify their games so we can create entirely new games with it - it is intended to MODIFY the game Skyrim, NOT REPLACE IT.  If you want to use what has been freely given to us to strip away it\\'s intended use, replacing it with whatever contrivance you\\'ve dreamed up, then you should be doing so at your own peril and solve your own problems regarding logistics; don\\'t blame the software.\r\n\r\nThat said; this v4.3.1s2 of TESvSnip can do much more than the v4.2 previously available, with all these new features having been added by wmrojer.  This version auto-backs up every time you save a plugin to the same name, the \\'new\\' subeditor works properly, and r-click copying works as well.  Most of the \\'Spells\\' work too, though \\'clean esp\\' does NOT (and may never completely work as in previous games).  The change formID feature works great.\r\n\r\nI\\'m posting it here as not to detract from the real devs of Snip and their pages.  Once a newer version (of THIS fork) is released, which is shown to correct the Truncation Bug so few were adamant about, then I\\'ll probably remove this download from this page.  In the meantime - feel free to comment on this page about anything relating to Snip; I\\'ll do my best to answer, and hopefully others will join the discussion.\r\n\r\nSee the readMe in the package for details on what this version actually does (as opposed to old versions and their bugs).\r\n\r\n\r\n[CREDITS]\r\n- wmrojer: for continuing development on TESvSnip and enduring the drama that has befallen him, also for giving me some info on how the record structure is handled by the app and game, as well as a bunch of the decoded Conditionals data.\r\n- The few who have kept up support of Snip, and have endured relentless persecution because of it\r\n- thefigment: for releasing v4.2 of Snip and any participation in the development of previous or subsequent versions\r\n- Previous, current, and/or future developers of Snip and of any 3rd party software which the app uses (such as .NET framework, SharpZipLib, etc)\r\n- Bethesda/Zenimax for allowing us to modify their game\r\n- Arthmoor: for harping on the Truncation Bug so much that I was compelled to learn some c# and fix it myself... altogether it took about an hour and half (learning, fixing, AND testing).  No more crying!\r\n\r\n\r\n[LEGAL]\r\nBethesda (or \\\"Licensor\\\" as defined in the Skyrim EULA) is not the author of the \\\"Customized Game Materials\\\" included in this package.\r\n“THIS MATERIAL IS NOT MADE, GUARANTEED OR SUPPORTED BY THE PUBLISHER OF THE SOFTWARE OR ITS AFFILIATES.”\r\n\r\nSLuckyD is not responsible for any damage these materials may cause, and/or failure to successfully deliver any stated products or services.\r\n\r\n\r\n\r\n[OTHER SLuckyD RELEASES]\r\n\r\n- TESvSnip v4.3.1s2 and RecordStructure XML File v1.6\r\nhttp://skyrim.nexusmods.com/mods/21202\r\n\r\n- CK Loading Errors Fix\r\nhttp://skyrim.nexusmods.com/mods/21207\r\n\r\n- Gokstad Sailable Viking Ship & Portable Player Home\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=5432\r\n(this was the first Skyrim mod to implement real-time sailing/flying using multiple objects)\r\n\r\n- Overlook Tower Player-Home\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4514\r\n(this was the first Skyrim mod to offer a non-Vanilla Player-home)\r\n\r\n- Portable On-demand Disposable Unlimited Mannequins (SPODUM)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10578\r\n\r\n- Vanilla Mannequin Script Fix\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10652\r\n\r\n- Ring of Fortify Carry Weight plus 10000\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=8520\r\n\r\n- Faster Woodland Creatures\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4799\r\n\r\n- Wounded Knee Gulch\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3787\r\n(this was the first Skyrim mod to offer a new dungeon)\r\n(availability is limited until I can update this to a 100% compatible, Skyrim Creation Kit version)\r\n\r\n- Bullseye\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2945\r\n(this was the first Skyrim mod to offer a new worldSpace, as well as several other \\'preCK firsts\\')\r\n(availability is limited until I can update this to a 100% compatible, Skyrim Creation Kit version)\r\n\r\n\r\n[OTHER PROJECTS I\\'VE ACTIVELY CONTRIBUTED TO]\r\n\r\n- Flyable Dragon Race Revamped\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=17178\r\n(I did the ground-detection, which auto-switches the dragon to walking mode)",
  "categoryId": "39",
  "version": "1.6",
  "author": "SLuckyD",
  "createdUnix": "1343419231",
  "updatedUnix": "1355510209",
  "containsAdultContent": false,
  "uploadedBy": "SLuckyD",
  "primaryFile": null,
  "files": [
    {
      "fileId": "76959",
      "name": "RecordStructure XML v1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "70",
      "fileName": "RecordStructure XML v1_0-21202-1-0.rar",
      "uploadedUnix": "1343419339",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9a83fdcbd8f00c6e32085f8edc0a8f42745e1c050e83dac4f6d57589dcd2c62d/analysis/1407050342/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RecordStructure%20XML%20v1_0-21202-1-0.rar?fid=76959&ttl=1535789854&ri=8192&rs=8192&setec=3d472e16ca87cfa678c0d2f03e7cb8d7"
    },
    {
      "fileId": "81341",
      "name": "RecordStructure XML v1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "43",
      "fileName": "RecordStructure XML v1_1-21202-1-1.rar",
      "uploadedUnix": "1344885527",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/a79d1ad81276523467feaf4791aee43c049df066d91ea815ea9857611b2f51ce/analysis/1407094204/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RecordStructure%20XML%20v1_1-21202-1-1.rar?fid=81341&ttl=1535789855&ri=8192&rs=8192&setec=89d0e2614ed97b2aea8081613dccb12d"
    },
    {
      "fileId": "81343",
      "name": "TESvSnip v4_3_1s2",
      "version": "4.3.1s2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2994",
      "fileName": "TESvSnip v4_3_1s2-21202-4-3-1s2.rar",
      "uploadedUnix": "1344886005",
      "modVersion": "4.3.1s2",
      "virusScanUrl": "https://www.virustotal.com/file/9f68bc33f07c9f58a0f2cc739ea8466be7a6d92605cb4958f0bb312d55cd4f49/analysis/1407094212/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TESvSnip%20v4_3_1s2-21202-4-3-1s2.rar?fid=81343&ttl=1535789855&ri=8192&rs=8192&setec=f1bea9029aa6856f6dec71740ea96ca2"
    },
    {
      "fileId": "85787",
      "name": "RecordStructure XML v1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "58",
      "fileName": "RecordStructure XML v1_2-21202-1-2.rar",
      "uploadedUnix": "1346525147",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/765027148c7809ea3ebd6a2f52c68738dd418fb9adcb2fe7cf2ab76cfc4509d1/analysis/1407138842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RecordStructure%20XML%20v1_2-21202-1-2.rar?fid=85787&ttl=1535789856&ri=8192&rs=8192&setec=ec98e3112db5bbb98ed0db2a8bb59103"
    },
    {
      "fileId": "89603",
      "name": "RecordStructure XML v1_3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "63",
      "fileName": "RecordStructure XML v1_3-21202-1-3.rar",
      "uploadedUnix": "1348188427",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/5f02bc4c8dd48dafdede0e205bb903f9157e309a3b98a3f50353cd81b5f06008/analysis/1407178562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RecordStructure%20XML%20v1_3-21202-1-3.rar?fid=89603&ttl=1535789856&ri=8192&rs=8192&setec=ba94e63a34a234b86c5505f7d9e3547a"
    },
    {
      "fileId": "93530",
      "name": "RecordStructure XML v1_4",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "68",
      "fileName": "RecordStructure XML v1_4-21202-1-4.rar",
      "uploadedUnix": "1350076290",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/756bfeb4c14a46747546482ddba238a85dc5f413e4108b1ed6cd9d547d4b5e6f/analysis/1407218294/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RecordStructure%20XML%20v1_4-21202-1-4.rar?fid=93530&ttl=1535789857&ri=8192&rs=8192&setec=b7f86891022d78aec74d767782df7488"
    },
    {
      "fileId": "94465",
      "name": "RecordStructure XML v1_5",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "67",
      "fileName": "RecordStructure XML v1_5-21202-1-5.rar",
      "uploadedUnix": "1350578976",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/2644c1339b65d4634b72dcc1b6188625310f2f58bc46f9617697199caa895da4/analysis/1407227702/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RecordStructure%20XML%20v1_5-21202-1-5.rar?fid=94465&ttl=1535789857&ri=8192&rs=8192&setec=c926eec1f63097d3108d3e8dd3ef2114"
    },
    {
      "fileId": "105169",
      "name": "RecordStructure XML v1_6",
      "version": "1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "68",
      "fileName": "RecordStructure XML v1_6-21202-1-6.rar",
      "uploadedUnix": "1355510209",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/46a4250b875825fb6ed52629b6a5f0b13191d716e4374fa4542d9877a49feed5/analysis/1407304143/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RecordStructure%20XML%20v1_6-21202-1-6.rar?fid=105169&ttl=1535789858&ri=8192&rs=8192&setec=d3a60ee61b0e45872c5be15ebf6eb421"
    }
  ]
}