{
  "modId": 21219.0,
  "modName": "Norse Viking Chainmail by Croc",
  "summary": "Armor for those who take a fancy to raiding and pillaging in a lore/realistic way. Be the ring-mailed warrior of your enemy\\'s nightmare with true NORDIC MAILLE! This is the redone version by tonycoolmen.",
  "descriptionHtml": "This is my version of Croc\\'s chailmail mod. This mod is not standalone, if you have Croc\\'s mod and this one, whichever one is last in the load order will have it\\'s armor ratings show. The OG mod is here: http://skyrim.nexusmods.com/mods/13462/\r\n\r\nI really liked Croc\\'s mod but I found the armor was too powerful so I scaled mostly everything down using the creation kit. Here\\'s the stats I used.\r\n\r\nThe light armor (Nordic Leather Jerkin, Nordic Byrnie, and Nordic Lamellar) have been scaled to Studded armor (22), Scaled armor (32), and Elven Gilded armor (35) respectively. Nordic Leather helmets and their Nasal equivalents are scaled to leather helmets (12), whereas Nordic helmets and their Nasal equivalents are scaled to Scaled helmets (14). Nordic Boots and Gauntlets are also scaled for Scaled boots and Gauntlets (9 each). I\\'ve also renamed Nordic Lamellar to be Nordic Byrnie Lamellar.\r\n\r\nThe heavy armors are thus: Nordic Hauberk is now equal to Dwarven Armor at 34 armor rating. Nordic Steel Lamellar has been renamed Nordic Hauberk Lamellar and is slightly less than steel plate at 38 armor rating. The Nordic Heavy helm and it\\'s Nasal equivalent has been scaled to Steel helmets at 17 armor rating. The 2.0 version has Nordic Splinted Greaves and Bracers, both set at 12.\r\n\r\nThe beauty of this is that now heavy armor wearers can have a Nordic style armor up till steel plate, which makes sense IRL and in game terms. I hope this pleases you and the good people who download this mod.\r\n\r\nChanglog:\r\n\r\n1.0:\r\ninitial release\r\n2.0:\r\nnew textures and new heavy armor boots and bracers.\r\n\r\nBelow is the original description of the mod by Croc:\r\n\\\"Armor for those who take a fancy to raiding and pillaging in a lore/realistic way.\r\n\r\nThis armor set includes\r\n1.TUNICS made by combining the red/blue vanilla merchant tunic with leather at the tanning rack\r\n2. Chainmail byrnie (short sleeves) made with steel smithing perk \r\n3. Chainmail Hauberk (Long sleeves) made with advanced smithing perk\r\n4. boots and gauntlets.\r\n5. Helmets (nasal and Gjermundbu) Thanks to shingouki2002 \r\n6. Lamelar Armor (steel leather)\r\n7. Leather tunic (only male for now)\r\n8. Heavy helmets from Nate Hallahan of Hammerwing Studios \r\n\r\nmale and female versions available!\r\n\r\narmor goes well with the redxavier\\'s raider helmet\r\n\r\nBUGS/FUTURE\r\n1. clipping issues to fix\r\n2. skirt animations to add\r\n3. more tunic colors for armor and clothing\r\n\r\nTERMS OF USAGE\r\n1. ASK PERMISSION BEFORE USAGE IN YOUR MOD\r\n2. DO NOT PLAGERISE\r\n3. FOLLOW RULE 1 & 2\r\n\r\nCredits \r\n-Bethesda for their wonderful textures, models, and game.\r\n-shingouki2002 for original helmet model \r\n-Nate Hallahan of Hammerwing Studios for heavy helmet http://skyrim.nexusmods.com/mods/15521\r\nwww.hammerwingstudios.com\\\"\r\n\r\nOther mods to make you feel like a viking badass:\r\n\r\nMatherian Viking Shields Set - http://skyrim.nexusmods.com/mods/20217 - Historically accurate viking shields, that are also added to leveled lists. If that doesn\\'t sell you, the author even spiced up The Bannered Mare with his shields!\r\n\r\nJaySuS Swords - http://skyrim.nexusmods.com/mods/1002 - A very popular mod, with plenty of content to craft or to find in Skyrim. The fine nordic ax really complements this build.\r\n\r\nIncreased Bounty Rewards - http://skyrim.nexusmods.com/mods/11278 - Something about slaying dragons and bandits for your Jarl has a Beowulf like viking ring to it for me. Plus, more money!\r\n\r\nMECRs Classic Nord Shields - http://skyrim.nexusmods.com/mods/12689 - 250 plus viking shields for ultimate customization! Also added to leveled lists.\r\n\r\nRaider Helmet - http://skyrim.nexusmods.com/mods/3947 - From the author who gave us The Witcher 2 shields and armor pack comes a historically accurate, lore friendly, easy to craft helmet. Pound out a couple of these to make sure no one in Tamriel goes helmetless. As seen on Draugr!\r\n\r\nThe Chronicles of Steel - http://skyrim.nexusmods.com/mods/12506 - Nordic weapons done right. Tons of content, leveled list support, but may conflict with JaySuS swords. I use them both with no hiccups, but I can\\'t tell if both weapons sets are being used. Try for yourself!\r\n\r\nThrowing Weapons - Death From Afar - http://skyrim.nexusmods.com/mods/14176 - True vikings were notorious for their use of throwing weapons, but this mod has something for everyone. The only thing it\\'s missing is Mjolnir! (speaking of Mjolnir, I was gonna list a link to a mod about thor\\'s hammer, but there are many to choose from and I haven\\'t tested any of them. Search for them and tell me what you think!)\r\n\r\nViking Spawn Axe - http://skyrim.nexusmods.com/mods/14066 - The second you see this, you\\'ll fall in love. Bring this one to vahalla/sovngarde with you.\r\n\r\nViking Spawn Shield - http://skyrim.nexusmods.com/mods/14076 - It may look like a battered wooden shield, but those runes must have powerful magicks behind them because this baby has shielded me from just about everything Skyrim has to offer. A very high quality shield. How could you resist?\r\n\r\nZabs Black Knight Armor - http://steamcommunity.com/sharedfiles/filedetails/?id=16194&searchtext=black+knight+armor - \r\n\\\"I command you, as King of the Britons, to stand aside!\\\" \r\n\\\"I move... for no man.\\\"\r\n\r\nMatys Medieval Knights - http://skyrim.nexusmods.com/mods/18863/ - The armor set on a whole may be set in more recent history, but combine the greathelm with this maille and you have yourself a crusader.\r\n\r\nTemplar Shields 1_02 - http://skyrim.nexusmods.com/mods/9673 - If you prefer knighthood to vikinghood, try this on for size. Moralin also has a bunch of historically accurate weapon mods, that would all look great with chainmail. Just for the sake of space, I won\\'t list them here, but seriously. Check \\'em out.",
  "categoryId": "54",
  "version": "2.0",
  "author": "Croc and tonycoolmen",
  "createdUnix": "1343446538",
  "updatedUnix": "1343775795",
  "containsAdultContent": false,
  "uploadedBy": "tonycoolmen",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77027",
      "name": "Norse Viking Chainmail TC edition",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "Norse Viking Chainmail TC edition-21219-1-0.rar",
      "uploadedUnix": "1343446818",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/10ebe2543ce7d3b791b20e5975a002e23a0fc1ba364e2ca69a5485fa32e82e01/analysis/1407051015/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Norse%20Viking%20Chainmail%20TC%20edition-21219-1-0.rar?fid=77027&ttl=1535789883&ri=8192&rs=8192&setec=d35230669c28d28ceebfb10f73b22e6b"
    },
    {
      "fileId": "77956",
      "name": "Norse Viking Chainmail TC edition 2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Norse Viking Chainmail TC edition 2-21219-2-0.rar",
      "uploadedUnix": "1343775795",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/6bc6a208dd6bd60013aae02882ee38e1c6b6057ea2bad42df0b469f3baeca3b2/analysis/1407060843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Norse%20Viking%20Chainmail%20TC%20edition%202-21219-2-0.rar?fid=77956&ttl=1535789884&ri=8192&rs=8192&setec=e4fa41c3790227c0461a66ee1642a8fb"
    }
  ]
}