{
  "modId": 21210.0,
  "modName": "Summon Gray Fox - Emer Dareloth",
  "summary": "Allows the player to summon the original legendary Gray Fox Emer Dareloth.",
  "descriptionHtml": "*********************************************\r\n8/3/12 Revision Notes:\r\nVersions 1a and 2a fixes the effects of Emer\\'s strikes so that it does not create a push effect on surrounding loose items.  This update also fixes the sound effect of Emer\\'s smoke bombs.\r\n\r\nDownload 1a if you use like having the 24 ingame hour recast timer.  Download 2a if you prefer not having the recast timer.\r\n*********************************************\r\n\r\nVersion 1 has the 24 ingame hour recast timer.\r\n\r\nVersion 2 removes the recast timer and allows the player to summon Emer indefinitely.\r\n\r\n***SPOILERS*****\r\nThe Gray Fox is a title that has been passed down an elite list of thieves throughout the centuries.  Despite the infamy that the Gray Fox persona has build for itself, it would have not come into existence in Tamriel had it not been the efforts of one man\\'s sneakiness to steal the Gray Cowl of Nocturnal.  That man was none other than Emer Dareloth.  Dareloth has long passed away, but his ghost still has traces of the Gray Cowl of Nocturnal to be summoned as his version of the Gray Fox!\r\n***END SPOILERS***\r\n\r\nTo obtain this ability, simply go through the Thieves Guild story line and you\\'ll eventually break into a home and discover a valuable \\\"representation\\\" of the Gray Fox.  Right next to this \\\"representation\\\" you\\'ll find Emer\\'s Ledger which will allow the player to learn the power.\r\n\r\nEmer Dareloth is equipped with the following:\r\n1. Carnwennan - A legendary dagger that hides its users in shadows.\r\n2. Smoke Bombs - A lost alchemic potion that is thrown at a mark and upon impact will cause smoke to emanate from the target causing a random chance to confuse the enemy.\r\n3. Shadow Step - Emer will use this ability when he feels he needs to get into a more advantageous position to attack.  He will also use this periodically to get away when being surrounded.  This ability works well with his next ability...\r\n4. Shadow Clone - Emer release 1 to 4 clones to further confuse his opponents.  This is especially useful when he uses his Shadow Step ability.  The clones can pack a mean punch, but will usually die in 1 hit.  The pupose of this ability is more to confuse Emer\\'s victims.\r\n5. Grand Larceny - This is a combination attack that Emer uses randomly that not only disarms his opponent\\'s weapon, it will also \\\"disarm\\\" certain treasures from target\\'s belongings.  Those guards will be crying when you notice that Emer has stolen their sweet roll.\r\n6. Gray Fox\\'s Influence - While Emer is summoned, his presence greatly increases the player\\'s thievery prowess.  The player is blessed with master level pickpocketing, lockpicking, and sneaking abilities.\r\n7. Emer has modified stats in health, stamina, and speed.  \r\n8. Casting the ability will not affect the stealth meter.\r\n9. Light foot perk so that he will not trigger traps.\r\n10.  Emer will be the same level as the player whenever you summon him.\r\n\r\nNotes:  Emer is a Thief\\'s best friend because not only does he help in backing you up when things go wrong, he provides the player master level thief skills while he is present.  As a fair warning, for players who don\\'t want to cheat, then this mod is probably not for you because the mod\\'s intention is to literally cheat.  Emer is of course a thief and cheating is part of being a thief isn\\'t it?  If the player chooses not to partake in his thieving influence, he is still a capable combatant and will easily take out his targets if the player chooses to prefer to kill his/her victims first before lifting items from their dead carcasses.  Of course his thievery abilities are more useful in towns and non hostile areas.  In hostile areas, he will still receive aggro from the enemies, but if the player is in sneak mode, he can be used as a distraction while the player silently picks off their targets one by one, but don\\'t be surprised if you find him dispatching all the marks first.  He is the perfect companion for the radiant Thieves Guild quests.\r\n\r\nThis mod shouldn\\'t cause any other issues with other mods unless the mods does a complete overhaul of the Thieve\\'s Guild story line.  If there are any issues you find with this mod, please let me know and I will make the changes as soon as I can.  I will be working on other summons next, and I hope you enjoy this latest mod I have made in my collection.  I will work on compiling all these summons into one file soon so that your mod list won\\'t become too overcumbersome with all my summons as well as your other mods.  I hope you enjoy this and please endorse if you like the mod :D.",
  "categoryId": "75",
  "version": "2a",
  "author": "zeroeternalz",
  "createdUnix": "1343431488",
  "updatedUnix": "1343982711",
  "containsAdultContent": false,
  "uploadedBy": "zeroeternalz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "76994",
      "name": "Summon Gray Fox - Emer Dareloth",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Summon Gray Fox - Emer Dareloth-21210-1.zip",
      "uploadedUnix": "1343431552",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/ecc7919a7a46c0c8a7f44e9cea0ca59ef5686d8310b9b94b7c12c1d947556011/analysis/1407050654/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Gray%20Fox%20-%20Emer%20Dareloth-21210-1.zip?fid=76994&ttl=1535789868&ri=8192&rs=8192&setec=1a291ed456b89dc197444d9e326bd26c"
    },
    {
      "fileId": "76995",
      "name": "Summon Gray Fox - Emer Dareloth v2",
      "version": "2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Summon Gray Fox - Emer Dareloth v2-21210-2.zip",
      "uploadedUnix": "1343431607",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/87f43ba0ed75fac207e5063bc7371875dc861e8aa5ec5ae548735f39b2015065/analysis/1407050654/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Gray%20Fox%20-%20Emer%20Dareloth%20v2-21210-2.zip?fid=76995&ttl=1535789868&ri=8192&rs=8192&setec=d3ae494843511ca7f9e49b38913bde38"
    },
    {
      "fileId": "78427",
      "name": "Summon Gray Fox - Emer Dareloth v1a",
      "version": "1a",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "8",
      "fileName": "Summon Gray Fox - Emer Dareloth v1a-21210-1a.zip",
      "uploadedUnix": "1343982612",
      "modVersion": "1a",
      "virusScanUrl": "https://www.virustotal.com/file/2f20e032d4e04db600d26cce04710fc70b0fcd7327e7eddcf3451579876c9157/analysis/1407066003/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Gray%20Fox%20-%20Emer%20Dareloth%20v1a-21210-1a.zip?fid=78427&ttl=1535789868&ri=8192&rs=8192&setec=81ef5c98441364a25820f84d51178f45"
    },
    {
      "fileId": "78428",
      "name": "Summon Gray Fox - Emer Dareloth v2a",
      "version": "2a",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "8",
      "fileName": "Summon Gray Fox - Emer Dareloth v2a-21210-2a.zip",
      "uploadedUnix": "1343982711",
      "modVersion": "2a",
      "virusScanUrl": "https://www.virustotal.com/file/e084c77af5ee76c69d5b780afa9b37701e5218782821a452dad1a0b53c4b2a99/analysis/1407066003/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Gray%20Fox%20-%20Emer%20Dareloth%20v2a-21210-2a.zip?fid=78428&ttl=1535789869&ri=8192&rs=8192&setec=5903e795cf2f7d42df6e65c67b9b3078"
    }
  ]
}