{
  "modId": 21220.0,
  "modName": "Jorrvaskr Hall",
  "summary": "Modifies Jorrvaskr Hall. Adding a Bard and taking ownership of the Harbinger\\'s room area.",
  "descriptionHtml": "*You must complete the Companion questline before using this mod.*\r\n- this mods makes changes to Jorrvaskr Hall, if you haven\\'t completed the Companion Questline you will break stuff.\r\n\r\nDescription:\r\nYou are the Harbinger the leader of the Companions... You shouldn\\'t be living in a little shack down the road instead of inside the great hall. You should be living in the great hall, feasting and training with companions sharing drink and song! This mod makes this happen.\r\n\r\nThis mod takes ownership of the Harbringer\\'s room area and sets the container chests so they don\\'t reset. It modifies Lydia\\'s AI package so that she uses the Hall area instead of sitting at Breezehome by her lonesome. It also adds a Bard named Breda to the hall to liven it up.\r\n\r\nBreda is scripted and so is Lydia for the new housing area. They have their schedules and daily activities in and out of the Hall, so if you don\\'t find Breda in the hall singing right off no worries, she may be out training or visiting the market. Also Breda the Bard is a potential follower and spouse.\r\n\r\nThis mod is best used with Jorrvaskr Map Mark http://skyrim.nexusmods.com/mods/11471\r\n\r\nI\\'ve still got a few things that i\\'d like to add and there might be a bug or two. Feedback is appreciated. - M.",
  "categoryId": "67",
  "version": "v1",
  "author": "Meagh",
  "createdUnix": "1343447962",
  "updatedUnix": "1343449647",
  "containsAdultContent": false,
  "uploadedBy": "meagh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77032",
      "name": "Jorrvaskr Hall v1",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Jorrvaskr Hall v1-21220-v1.zip",
      "uploadedUnix": "1343449647",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/17d90035c9f4d06699d94f46544548f36f9e584d423227a0329f8da8a6a63b18/analysis/1407051064/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jorrvaskr%20Hall%20v1-21220-v1.zip?fid=77032&ttl=1535789885&ri=8192&rs=8192&setec=dbf8342b4d2523fba57467a48123de14"
    }
  ]
}