{
  "modId": 21231.0,
  "modName": "Daedra in Conjurer Dungeons",
  "summary": "This mod adds daedra from Skyrim Monster Mod to dungeons where conjurers live.\r\n",
  "descriptionHtml": "Mod:  Daedra in Conjurer Dungeons 1_0\r\nGame:  TES V: Skyrim\r\nRequires:  Skyrim Monster Mod:   http://skyrim.nexusmods.com/mods/9694\r\nAuthor:  David Brasher             \r\nDate:  7/28/12                   \r\n************************************************************************\r\nCONTENTS                          \r\n************************************************************************\r\n1. Information on the Mod\r\n2. Installation\r\n3. Version History\r\n4. Conflicts, Known Issues, and Troubleshooting\r\n5. Copy Status and Credits\r\n************************************************************************\r\n1. INFORMATION ON THE MOD           \r\n************************************************************************\r\n\t   This mod adds daedra from Skyrim Monster Mod to dungeons where conjurers live.\r\n\r\n\t   Do you miss raiding conjurer lairs in Oblivion?  This mod can help you out.  Conjurers \r\nare nasty warlocks and witches who really hate it when greedy adventurers snoop around in their dark\r\ndamp dwellings seeking stuff to steal and evil enemies to eradicate.  They value their privacy and \r\nhave a lot to hide.  They really don\\'t want the guards to know what kinds of twisted experiments \r\nthey are performing.  So if anyone visits their homes, they feel like they have to kill them and \r\nprevent their escape.  (Plus they think it is good fun.)\r\n\r\n\t   Conjurers like to gratify their egos by summoning and controlling powerful daedra.  They\r\nfeel that it is better to be feared than liked.  And if you live in a dark, dusty, moldy hole, then \r\nyou probably need some sort of compensation to avoid getting really depressed.  So there is nothing\r\nlike the ability to summon evil monsters from Oblivion for chasing the blues away.  (But maybe if\r\nthese warlocks behaved themselves and didn\\'t conjure ugly monsters, the nice people would let them \r\nlive in ordinary houses in town.)\r\n\r\n\t   Perhaps society is to blame.  Nords in general dislike and distrust magic and those who \r\nuse it.  Magically gifted children probably have terrible childhoods and are made to feel ashamed \r\nand like they don\\'t belong.  They are encouraged to hide their magical inclinations.  They probably\r\nyearn to find others like themselves who understand how they feel and accept them for what they are.\r\nSo if society was more accepting, maybe there wouldn\\'t be this terrible problem with conjurers and \r\ntheir summonings attacking travelers.  Think about that next time you are acting prejudiced against\r\nyour neighbors who are witches.\r\n\r\n\t   This mod uses a fairly full spectrum of daedra.  Both the original ones from Skyrim and\r\nnew ones from Skyrim Monster Mod are used.  These are the daedra you will find in conjurer dungeons:\r\n\r\nScamps\r\nFlame Atronachs\r\nClannfears\r\nFrost Atronachs\r\nHungers\r\nFlesh Atronachs\r\nOgrims\r\nDaedroths\r\nSpider Daedra\r\nStorm Atronachs\r\nWinged Twilights\r\nDremoras\r\n\r\n\t  The mod is designed to avoid conflict with overhaul mods.  Custom actors are used including \r\nthe original Skyrim daedra.  (The original models are used but new actors were created.)  Custom \r\nleveled lists were created to work on custom spawn points that were placed in the world.  So it does\r\nnot matter if other mods edit the vanilla daedra, edit the vanilla leveled lists, or edit the vanilla\r\nspawn points.  This mod will continue to function and will not damage the function of the other mods.\r\nYou don\\'t even need to do a full install of Skyrim Monster Mod and have all those new monsters in the\r\nworld or possibly have conflicts with your other mods resulting from using it.  This mod does not \r\nconflict with Skyrim Monster Mod.  You can use it at the same time as you use this mod with no ill \r\neffects.  \r\n\r\n\t  The daedra in this mod are not leveled.  They range from level 4-46.  You could encounter a \r\ndaedra from anywhere in this level range no matter what level you are at.  The average daedra in this \r\nmod is between level 15 and 20.\r\n\r\n\t  The daedra tend to be off the beaten path.  You would need to go out into the wilderness or\r\ninto a dungeon to find them.  You don\\'t need to worry about your brand-new character getting \r\nslaughtered by daedra unless he or she goes somewhere that it is unwise to go.  If you are eager to go \r\nsee the daedra, the easiest two places to find would be a couple of small ruins on the surface to the \r\nwest of Whiterun.  One is north of the Sleeping Tree giant camp, and the other is to the south, but \r\nbeware, those places are very dangerous.  Here are some other main locations where you can find daedra:    \r\n\r\nAnsilvund\r\nMorvunskar\r\nSunderstone Gorge\r\nFellglow Keep\r\nHobs Fall Cave\r\nUstengrav\r\nThe Shrine of Mehrunes Dagon\r\n\r\n\t  One way you could see all the daedra this mod adds at once is to use a console code to go to \r\nthe testing hall added by this mod.  To do this, you would enter this console code:\r\n\r\nCOC AADCTestingHall\r\n\r\n\t  This mod could make your raids on conjurer lairs much more dangerous -- and interesting.\t   \r\n************************************************************************\r\n2. Installation                           \r\n************************************************************************\r\n\t   You must install SkyMoMod.bsa and SkyMoMod.esm to make this mod work.\r\n\r\n           To install this mod, extract (decompress) the .esp to your Skyrim directory.  \r\n(It will be something like *Installation directory*\\\\Skyrim\\\\SteamApps\\\\common\\\\Skyrim\\\\Data)\r\nMark the box next to the mod in your mod manager.\r\n \r\n           Alternately, extract someplace else.  Then move the .esp to Skyrim\\\\Data.  Mark the box \r\nnext to the patch in your mod manager.\r\n\r\n\t   Make sure that you have installed the .esm and .bsa from Skyrim Monster Mod you may either\r\nuse its .esp (SkyMoMod_lists.esp) or not.  \r\n\r\n\r\n\t   Your load order should be like this if you use Skyrim Monster Mod:\r\n\r\nSkyMoMod.esm\r\nSkyMoMod_lists.esp\r\nDaedra in Conjurer Dungeons.esp\r\n\r\n\r\n\t   Your load order should be like this if you don\\'t use Skyrim Monster Mod:\r\n\r\nSkyMoMod.esm\r\nDaedra in Conjurer Dungeons.esp\r\n \r\n************************************************************************\r\n3. Version History    \r\n************************************************************************\r\nV 1.0  7/28/12   Initial release.   \r\n************************************************************************\r\n4. Conflicts, Known Issues, and Troubleshooting\r\n************************************************************************\r\n\t   Skyrim is not Oblivion or Morrowind, so the daedra are not going to look and act exactly \r\nthe same.\r\n\r\n\t   You must install the Skyrim Monster Mod .esm or else you will have a missing master and \r\nSkyrim will not be able to start up.\r\n\r\n\t   This mod could conflict with another mod that edits the same location.  The effect would \r\nbe that the daedra from this mod would kill whatever actors the other mod placed there, but other\r\nmods would not likely place nice actors in a conjurer dungeon. \r\n\r\n\t   Not all the daedra from Oblivion and Morrowind are represented in this mod.  If I had more \r\ndaedra, I could add them to this mod.\t   \r\n\t\r\n\t   If you locate a bug, contact David Brasher on TES Nexus so that the situation can be\r\nexamined and can hopefully be fixed. \r\n************************************************************************\r\n5. Copy Status and Credits           \r\n************************************************************************\r\nCredits:  The makers of Skyrim Monster Mod:  http://skyrim.nexusmods.com/mods/9694\r\n\t\tDogtown1       \r\n\t\t\\\"StarX\\\" for draugr, falmer, giants, trolls, durzog\r\n\t\tdigital lion for the fatalis texture, the drake, Ice Naga, and revnant\r\n\t\tchocolambot for a hagraven texture\r\n\t\tkiller keos for the ebony mesh\r\n\t\tmuppetpuppet for a very sexy tiger and hyena texture, and raptor and therium mesh and tex\r\n\t\tMr. Siika for the durzog, minotaur head and hooves, triceratops mesh and baby mammoth\r\n\t\tand thanks to Ghogiel for the triceratops texture\r\n\t\tAlexander Wolf for the demon wing mesh\r\n\t\tGSC Game World for the stalker stuff\r\n\t\tCDProjeckt for the amazing witcher mesh and textures\r\n\t\tmdogger for the guar\r\n\t\tmdogger and grimdeath for the hunger\r\n\t\tcryonaut for werecroc mesh and tex\r\n\t\tartifex0 for snow devil torso mesh and tex\r\n\t\tnewermind43 for brown werecat texture and ripper sword\r\n\t\tbig thanks to Th3w1ck3d1 for the help\r\n\r\n\t\tJackstarr for Skyrim Monster Mod Replacers - Lore Friendly and Others \r\n\t\thttp://skyrim.nexusmods.com/mods/16411\r\n\t\t\tNothing from his .esps was used, but many of the edits listed in his change log \r\n\t\t\twere entered into the CK from scratch for this mod.\r\n\r\n\t  Bethesda for making Skyrim in an open format anyone can mod.\r\n\t\t\r\nCopy Status:  You may use my leveled lists and my other edits of that sort that are found in this mod in \r\n\t      your own mod and you may distribute it as long as you list me in the credits and notify me \r\n\t      on TES Nexus as a courtesy.        \r\n************************************************************************\r\n************************************************************************\r\n************************************************************************\r\n************************************************************************",
  "categoryId": "83",
  "version": "1.0",
  "author": "David Brasher",
  "createdUnix": "1343464792",
  "updatedUnix": "1343464849",
  "containsAdultContent": false,
  "uploadedBy": "David Brasher",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77072",
      "name": "Daedra in Conjurer Dungeons 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "44",
      "fileName": "Daedra in Conjurer Dungeons 1_0-21231-1-0.7z",
      "uploadedUnix": "1343464849",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/54b57debee4d0c21c1073d978ce1ae2ee19a73f46fc6eb0e6df5ed40d671f504/analysis/1407051482/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedra%20in%20Conjurer%20Dungeons%201_0-21231-1-0.7z?fid=77072&ttl=1535789922&ri=8192&rs=8192&setec=a6592ce4d6386658ea9a38358f625a37"
    }
  ]
}