{
  "modId": 21235.0,
  "modName": "Werewolf Autochanger - Incredible Hulk-like",
  "summary": "Whenever angered or distressed, the mild-mannered alchemist finds themselves transforming into a powerful seven-foot furry wolf creature known as \\\"The Incredible Wolf\\\". The Wolf is guided by your character\\'s personality, dealing with whatever distresses it. \r\n",
  "descriptionHtml": "[i]\\\"Your character is a research alchemist trying to find a way to tap into the hidden strength that all humans possess. Then, one night in their backyard laboratory, an experiment went wrong, causing them to be overexposed to lethal doses of Lunar radiation. \r\n\r\nNow, whenever angered or distressed, the mild-mannered alchemist finds himself transforming into a powerful seven-foot furry wolf creature known as \\\"The Incredible Wolf\\\". The Wolf is guided by your character\\'s personality, dealing with whatever distresses it. \r\n\r\nYour character travels around the country in search of a cure, while taking various odd jobs. During this odyssey, you character tries to avoid the pursuit of Werewolf Hunters, who suspects the Wolf of murder, and who are determined to discover the creature\\'s true identity.\\\"[/i]\r\n\r\nThis mod aims to bring the \\\"Incredible Hulk\\\" experience to Skyrim. When the player is a an infected werewolf (human form) and their health drops below 35%, there is a 90% chance that they will transform into a werewolf beast. This effect cannot occur more often than every 15 in-game minutes. But by the time the cooldown expires you will have killed off most of your attackers...hehe.\r\n(See Demo Video) \r\n\r\nI play this game with a few other werewolf mods (See load order screenshot picture). The ones in particular that inspired me to create this mod were [u][b]\\\"Yet Another Werewolf Improvement\\\"[/b][/u] and [u][b]Tales of Lycanthropy[/b][/u]. [u]\\\"Yet Another Werewolf Improvement\\\"[/u] uses a setting where you are invulnerable to damage when transforming into your werewolf form and your health is replenished after the change. To me, it sounded a lot like [u]\\\"The Hulk\\\"[/u] and led me to researching how to build a mod to work with [u]\\\"YAWI\\\"[/u]. \r\n\r\n\r\nVIDEO\r\nhttp://www.youtube.com/watch?v=IO_j7GTnUP4\r\n\r\n\r\nINSTALLATION\r\n\r\nOpen the archive using your favorite compression utility (Winzip, 7zip, winrar, etc...) then drag the esp file and script folder to your DATA folder. I don\\'t know how to make an \\\"NMM\\\" installer for this so it\\'s the old-school method for now. If you\\'re interested in making it work with any other werewolf mods make sure it is below those mods in your load order. \r\n\r\nUNINSTALLATION\r\n\r\nDelete the ESP file and the werefolftrigger.pex from the SCRIPTS folder.\r\n(Thanks GEEVO)\r\n\r\n\r\nCOMPATIBILITY\r\n\r\nThis mod should be compatible with all others as it doesn\\'t do anything that any other mod on the Nexus does...well...not in this fashion. I mean, you can change into a wolf as many times as you like with some other mods...but this is the first that automatically changes you based on a health-threshold. \r\n\\\"Werewolf Autochanger\\\" is also DAWNGUARD COMPATIBLE!\r\n\r\n\r\nCREDITS\r\nSPWNED for his invaluable and wholesome help with the coding.\r\nI, LITERALLY, could NOT have done it without his guidance. He is a Jedi Master when it comes to scripting and coding for Skyrim and just a great guy overall. I\\'ve never had such great teaching and guidance from across the world. SPWNED Literally taught me how to program in 3 days from the other side of the world via email and PM. Simply amazing.\r\n\r\nThe author of \\\"Yet Another Werewolf Improvement\\\"\r\n\r\n\r\n\r\nMY THANKS\r\n\r\nBethesda for this awesome game!\r\nThe modding community for making a great game BETTER!\r\nThe downloaders, testers and users of this mod. ",
  "categoryId": "24",
  "version": "1.0",
  "author": "Detman101 ",
  "createdUnix": "1343477656",
  "updatedUnix": "1343477787",
  "containsAdultContent": false,
  "uploadedBy": "Detman101",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77098",
      "name": "Werewolf Autochanger V1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Werewolf Autochanger V1_0-21235-1-0.zip",
      "uploadedUnix": "1343477787",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bdcdb269ffcdda06ae365ebb9394f539731a55ab08cd949c00857c13f41671c0/analysis/1407051723/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Werewolf%20Autochanger%20V1_0-21235-1-0.zip?fid=77098&ttl=1535789930&ri=8192&rs=8192&setec=abb683ddf43f596ca95fa8e76c0b2fb9"
    }
  ]
}