{
  "modId": 21254.0,
  "modName": "Dwemer Exploding Traps Bombs and Arrows",
  "summary": "Your sneaky thief with Ancient Knowledge can now craft Dwemer Traps, Bombs and Exploding Arrows to cause mischief with. Blow your enemies to pieces from the comfort of your current hiding spot.\r\n\r\nAdditionally, hunt down the six dormant teleporters in Blackreach and bring them back to life! Assemble them wherever you like for a quick escape or a co",
  "descriptionHtml": "[center][IMG]http://i125.photobucket.com/albums/p76/lesfleursmal/ESBanner.png[/IMG][/center]\r\n\r\n[center]ENEMIES ESSPLODE! (Craftable Dwemer Traps, Bombs and Arrows)\r\nby Little Baron[/center]\r\n\r\nYour sneaky thief with Ancient Knowledge can now craft Dwemer Traps, Bombs and Exploding Arrows to cause mischief with. Blow your enemies to pieces from the comfort of your current hiding spot.\r\n\r\nAdditionally, hunt down the six dormant teleporters in Blackreach and bring them back to life! Assemble them wherever you like for a quick escape or a convenient way to move from one luxury home to the other.\r\n\r\n[center][youtube]aaXLBMZRnV8[/youtube]\r\nMany thanks to Brodual for including EE in this great new video series[/center]\r\n\r\n\r\n[center][b]What it Does[/b][/center]\r\nAdds Craft-able Dwemer Traps, Bombs and Exploding Arrows for your sneaky thief to cause mischief with. It also adds a kind of treasure hunt in Blackreach for dormant teleporters and their related resonance crystals, which can be turned into a total of 6 fully portable teleporters that you can set up anywhere you like. \r\n\r\nYou character needs to have gained \\'Ancient Knowledge\\' from the quest \\'Unfathomable Depths\\' in order to make any of the Dwemer items.\r\n\r\nTonilia, the Thieves Guild merchant in the Ragged Flagon will get her hands on a few of these items every couple of days, if you\\'re not the crafting sort, or just want to start blowing things up right away.\r\n\r\n[center][b]About Traps & Exploding Arrows[/b][/center]\r\nExploding Arrow and Trap types: Fire, Frost, Lightning and Poison. Depending on alchemical or enchanting skill and  the ingredients you have on hand, they range in strength (Normal, Superior and Deadly).\r\n\r\nFire Traps and Arrows require at least one perk point spent in Alchemy before they can be created. Each additional 2 points spent on the base Alchemy skill allows the creation of a stronger level of trap/arrow.\r\n\r\nPoison Traps and arrows require at least one perk point spent in Alchemy before they can be created.\r\nThe Poisoner perk allows superior poison Traps/Arrows and the Concentrated Poison perk allows deadly versions.\r\n\r\nElectric Traps and Arrows, and Frost Traps and Arrows, require at least one perk point spent in enchanting before they can be created. Each additional 2 points spent on the base Enchanting skill allows the creation of a stronger level of trap/arrow.\r\n\r\nOnce dropped, a trap waits a few seconds to settle and then \\'sets\\' itself. A set trap can be picked back up and put back into inventory, or it can be \\'grabbed\\' and moved to a new location. The PC will not cause a trap to go off, BUT ANY OTHER NPC, INCLUDING FOLLOWERS, WILL! Also, trap and or arrow explosion damage can and will damage the PC/Followers if they are too close when it goes off.\r\n\r\nPlacing a trap (and injuring someone with one) is considered a crime in Skyrim, so don\\'t be seen!\r\n\r\nPoison bombs and Lightning traps can be \\'kicked\\' when placed (by bumping into them), and will roll in the direction kicked.\r\nWhen a bomb or trap goes off, all the original Dwemer pieces used to craft it come apart in the explosion! Search around and you may be able to recover some of them to make your next toy.\r\n\r\n[center][b]About Portable Teleporters[/b][/center]\r\nThe Dormant (or maybe not-always-so-dormant?) Dwemer teleporters are scattered throughout Blackreach. They can be combined at a forge with different colored resonance crystals to make one of the 6 possible portable teleporters. Once created, you have to continue to hunt down more resonance crystals so that you can place them inside your teleporter. A teleporter can only take you to other teleporters that are not dormant, and for whom it has the correct resonance crystal installed. \r\n\r\nResonance crystals will pop up randomly in Dwemer loot.\r\n\r\n[b]CONFLICTS:[/b]\r\nNo vanilla items, objects, scripts or NPC\\'s were modified in any way.\r\nSeveral Dwemer leveled lists (clutter loot lists, and the Dwemer Boss loot list) were modified.\r\n\r\nThe mod also makes some very minor changes to a few interior and exterior cells, basically just the placement of the dormant Dwemer teleports. Nonetheless, mods that also change these same cells MIGHT cause problems. \r\n\r\nModified cells: [spoiler]BlackreachSewer01, BlackreachZCell03, BlackreachZCell04, BlackreachZCell05, AftlandWorldOrigin, RaldbtharBlackreach01.[/spoiler]\r\n\r\n[b]INSTALLATION:[/b] \r\nFirst time installers: Place the .esp and .bsa in your SKYRIM/data folder, tick the box in the DATA menu from the launcher, and you\\'re ready to start blowing your enemies to bits. If you meet the requirements and have the ingredients, that is.\r\n\r\nUpdate Installers: (currently n/a as of 072912 version)\r\n[color=blue]1. Delete/Remove the old LB_EnemiesEssplode! files from your Skyrim/Data folder.[/color]\r\n[color=green]2. Start SKYRIM, load your current save.[/color] \r\n[color=blue]3. Save your game again. Close SKYRIM.[/color]\r\n[color=green]4. Install the new LB_EnemiesEssplode! files into your SKYRIM/Data folder. NMM should place the files in your Data folder automatically. If not, just do it manually! [/color]\r\n[color=blue]5. Tick the box for the .esp in the DATA menu from the launcher. The .bsa file just needs to be inside the Skyrim/Data folder.[/color]\r\n[color=green]6. Load up SKYRIM and load up your clean save! Blow things up![/color]\r\n\r\n[b]KNOWN ISSUES [/b]\r\nLow level traps and arrows are less effective against high level NPC\\'s, and may even do no damage at all. This isn\\'t really an \\'issue\\', rather it\\'s just a resistance to traps that is imbedded in vanilla SKYRIM.\r\n\r\nCollision Geometries aren\\'t perfect... some things sink into the ground a bit. Cut me some slack!\r\n\r\n[b]PROBLEMS/COMPLAINTS:[/b]\r\n[color=yellow][i]I would prefer it if bug reports were made to me via PM until the mod is out of BETA. Kudos to anyone who reads this and listens![/i][/color]\r\n\r\nI have tested the mod as thoroughly as possible. I have ensured that all required files are in the .bsa and have tested the mod with an otherwise empty Data folder and found it does work as intended. I cleaned the mod using TesSnip to make sure there was nothing in it that shouldn’t be.\r\n\r\nSkyrim is an unbelievably buggy POS. I love it, but it is. Therefore, problems you may have in many cases are going to be related to vanilla bugs or mod conflicts that I can do little about. Sometimes, it\\'s just not going to work for you. Before you post a complaint, please be sure that:\r\n\r\n[color=green]1. You followed the installation procedures outline above, including having started with a clean save, and have verified that everything is where it should be and activated correctly.[/color]\r\n[color=blue]2. If the items don\\'t show up at the smithing forge, under the DWARVEN tab (or the MISC tab), do you meet the prerequisites outlined in the description above?[/color]\r\n[color=green]3. In your complaint please state something like “I read steps 1-3 before posting and I am sure it\\'s none of those things”. Otherwise my only response will be to point you to this list.[/color]\r\n\r\n[b]CREDITS: See the credits section![/b]\r\n\r\n[b]PERMISSIONS:[/b]\r\nI am currently unable to work on or support the MODS I made for SKYRIM. Current SKYRIM modders may use the resources they find in this mod in their own mods without permission. Please credit me as is appropriate.\r\n\r\n[b]UPDATES:[/b]\r\n\r\n072912 : Simply added Dwarven Material keywords to all the craftables, so they show up under the \\'Dwarven\\' tab instead of the \\'Misc\\' tab. If you were happy with it the way it was, you don\\'t need to bother DLing the new version\r\n\r\n102312 :\r\n1. Verified that blue resonance crystals and blue teleporters were indeed available. They always were.\r\n2. Added color names to the teleporters for clarity\r\n3. Added a new redundancy to prevent buttons from respawning when they shouldn\\'t. If it was going to happen to you, you will now see a message about an \\'active teleporter in the area\\'. This is a sign that the redundancy fired and set things the way they should be.\r\n4. Fixed the fact that picking up an Advanced or Deadly trap put a Standard version in your inventory.\r\n5. You can now smith 3 Dwemer cups with one Dwarven Ingot.\r\n6. The message box that pops up when you activate a teleporter to take it now reads \\\"Teleporter\\\" instead of \\\"Trap\\\"\r\n7. The mod was re-saved post cleaning, so the Wry-Bash false \\'corrupt file\\' error should be gone.\r\n\r\nIn order for the teleporter fixes to take effect, I am afraid you will need to disable the mod, load and then save your game, and then re-install. I apologize for the inconvenience of having to hunt them down all over again.",
  "categoryId": "24",
  "version": "102312",
  "author": "Little Baron",
  "createdUnix": "1343500349",
  "updatedUnix": "1351011040",
  "containsAdultContent": false,
  "uploadedBy": "LittleBaron",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77479",
      "name": "Enemies Essplode",
      "version": "072912",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2803",
      "fileName": "Enemies Essplode-21254-072912.zip",
      "uploadedUnix": "1343588046",
      "modVersion": "072912",
      "virusScanUrl": "https://www.virustotal.com/file/2f7681371531c52f9997366d7b33b1655174c3a23119d00eff2db49c4e832575/analysis/1407055757/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enemies%20Essplode-21254-072912.zip?fid=77479&ttl=1535789962&ri=8192&rs=8192&setec=d6b58d360e812b9d941d9558fefadf98"
    },
    {
      "fileId": "95392",
      "name": "Enemies Essplode 102312",
      "version": "102312",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2799",
      "fileName": "Enemies Essplode 102312-21254-102312.zip",
      "uploadedUnix": "1351011040",
      "modVersion": "102312",
      "virusScanUrl": "https://www.virustotal.com/file/239a913a7ab76ef80737a684e45b2bbd0ff3cfd4d48d1cbe253c1fb1b0483c1c/analysis/1407233347/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enemies%20Essplode%20102312-21254-102312.zip?fid=95392&ttl=1535789962&ri=8192&rs=8192&setec=02936400f1579905a48cd63f2c26d09f"
    }
  ]
}