{
  "modId": 21250.0,
  "modName": "Exploding arrows",
  "summary": "Adds smithable exploding arrows to the game.",
  "descriptionHtml": "[youtube]d6qiXB2aCMc[/youtube]\r<br />\r<br />\r<br />\r<br />\r<br />[center][size=+2]About the forging\r<br />of\r<br />explosion arrows[/size]\r<br />\r<br />\r<br />Author unknown\r<br />\r<br />\r<br />\r<br />To forge exploding arrows you will need the following ingredients:\r<br />\r<br />- For fire arrows: Arrows that you want to turn into exploding arrows, and\r<br />Fire salts (one piece of salt is enough for a quiver of ten fire arrows)\r<br />- For shock arrows: Arrows and shock salts\r<br />- For Ice Arrows: Arrows and frost salts\r<br />- For arrows that explode delayed: twice a salt\r<br />\r<br />At the smithingforge you have to hammer the salts under constant heat in the arrowheads.\r<br />If the arrows hit anywhere they explode and the force of the salts is released.\r<br />If you have put in normal salt into the arrowhead the impact of the Arrow will be delayed.\r<br />Two pieces of Salt will delay the detonation for three seconds.\r<br />\r<br />\r<br />The effects of all the arrows are different. The explosion of the Ice Arrows will injure all\r<br />people in your vicinity, so you should look if there are persons in vicinity of the target\r<br />and you should hold distance.\r<br />\r<br />The fire arrows only damage the immediate surroundings of you, but the explosion is heavy.\r<br />If you shoot, for example, with a fire arrow at the dinner table, the dishes fly\r<br />through the area. You should be careful that nobody gets hurt by flying objects.\r<br />\r<br />The flash fires lightnings at every person in the vicinity, and should not be near\r<br />crowded places and are used in cities, because perhaps an injured fellow\r<br />gets angry and tries to hurt someone.\r<br />\r<br />Long ago, the explosion arrows were produced natural, but over the years this art\r<br />was lost and only a few people are able to make exploding arrows today. with this book the\r<br />author wants to bring back that old art to the people.[/center]\r<br />\r<br />\r<br />\r<br />                                                                                                                       \r<br />[size=+1]Description :[/size]  This mod adds explosion arrows to Skyrim. They explode on impact or three seconds later. All of these arrows can be created at forges. There are fire, ice and shock arrows with different effects. These effects are explained above. To create the arrows you need arrows and fire, frost or shocksalts. Shocksalts are new ingrediens with new effects. All of these salts are now easily available in every alchemy store. When you start the game you the book &#34;About the forging of explosion arrows&#34; is addet to your inventory. The book explains the lore of the mod and how you make exploding arrows.(The book is also written above.) I recommend that you read the book.\r<br />\r<br />Some words on the screenshots are german because i have a german Version of  Skyrim, but if you have an English Skyrim version everything will be english. \r<br />\r<br />\r<br />There will be updates soon to fix translation issues and shock salts will be replaced with the existing void salts.",
  "categoryId": "55",
  "version": "1.0",
  "author": "Robin Hood",
  "createdUnix": "1343499061",
  "updatedUnix": "1343499120",
  "containsAdultContent": false,
  "uploadedBy": "RobinTheHoood",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77141",
      "name": "Exploding arrows",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "428",
      "fileName": "Exploding arrows-21250-1-0.rar",
      "uploadedUnix": "1343499120",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fa5b6eded4fe351bb876e99b38592f539f6cfc30f308501bb44bbe9aea6abe27/analysis/1407052264/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Exploding%20arrows-21250-1-0.rar?fid=77141&ttl=1535789957&ri=8192&rs=8192&setec=cc8eda8289026798c473e954a5f94837"
    }
  ]
}