{
  "modId": 21251.0,
  "modName": "Explosionspfeile",
  "summary": "Fügt Explosionspfeile dem Spiel hinzu.",
  "descriptionHtml": "[youtube]d6qiXB2aCMc[/youtube]\r<br />\r<br />\r<br />\r<br />\r<br />[center][size=+2]Über das Schmieden\r<br />von\r<br />Explosionspfeilen[/size]\r<br />\r<br />\r<br />Autor unbekannt\r<br />\r<br />\r<br />\r<br />Um explodierende Pfeile zu schmieden  braucht man folgende Ingredientien:\r<br />\r<br />- Für Feuerpfeile: Pfeile, die man in explodierende Pfeile verwandeln möchte, und\r<br />  Feuersalze (eine Schale Feuersalze reicht für etwa zehn Pfeile)\r<br />- Für Blitzpfeile: Pfeile und Schocksalze\r<br />- Für Eispfeile: Pfeile und Frostsalze\r<br />- Für Pfeile, die verzögert explodieren sollen: zwei mal Salz\r<br />\r<br />An der Schmiede arbeitet man die Salze unter stetiger Hitze und starken Hammerschlägen\r<br />in die Pfeilspitze ein.\r<br />Wenn die Pfeile irgendwo auftreffen explodieren sie und die Kraft der Salze wird freigesetzt.\r<br />Wenn man normales Salz in die Pfeilspitze eingearbeitet hat wird dieses beim Aufprall\r<br />aufgelöst, sodass die Detonation verzögert stattfindet. Bei zwei mal Salz dauert es etwa drei\r<br />Sekunden zur Explosion.\r<br />\r<br />Die Wirkungen aller Pfeile sind verschieden. Die Explosion der Eispfeile verletzt alle im\r<br />näheren Umkreis, deshalb sollte man bei Schießübungen darauf achten, dass sich keine anderen\r<br />Personen in der Nähe befinden, und dass man Abstand zur Zielscheibe hält.\r<br />\r<br />Die Feuerpfeile fügen nur dem engsten Umkreis Schaden zu, doch dieser ist beträchtlich.\r<br />Wenn man zum Beispiel mit einem Feuerpfeil auf einen gedeckten Tisch schießt, fliegen die Teller\r<br />durch die Gegend. Man sollte aufpassen, dass niemand von herumfliegenden Gegenständen verletzt\r<br />wird.\r<br />\r<br />Die Blitzexplosion beschießt jeden in der Nähe mit Blitzen und sollte auch nicht in der Nähe von\r<br />belebten Plätzen und in Städten eingesetzt werden, da vielleicht ein verletzter Mitbürger in\r<br />Rage gerät und versucht jemanden zu verletzen.\r<br />\r<br />Vor langer Zeit war das herstellen von Explosionspfeilen Gang und Gebe, doch im Laufe der Jahre\r<br />ging diese Kunst Verloren und nur noch wenige Menschen sind ihr mächtig. Mit diesem Buch möchte\r<br />der Autor jene alte Kunst den Menschen zurückgeben.[/center]\r<br />\r<br />\r<br />\r<br />\r<br />[size=+1]Beschreibung[/size]\r<br />Diese Mod fügt Explosionspfeile dem Spiel hinzu. Sie explodieren beim Aufprall auf ein Ziel oder drei sekunden später. Alle Pfeile können an Schmieden hergestellt werden. Es gibt Feuer-, Blitz- und Eispfeile, mit unterschiedlichen wirkungen (siehe oben). Um die Pfeile zu schmieden benötigt man Pfeile und Feuer-, Frost- oder Schocksalze (Schocksalze sind neue Alchemie zutaten mit neuen Eigenschaften). Alle Salze kann man leicht beim Alchemisten kaufen. Beim start des Spiels wird dem Inventar des Spielers das Buch &#34;Über das Schmieden von Explosionspfeilen&#34; (siehe oben) hinzugefügt, welches den Hintergrund und Einzelheiten der Mod erklärt. Ich empfehle das Buch zu lesen.\r<br />\r<br />\r<br />Updates kommen bald&#33;",
  "categoryId": "55",
  "version": "1.0",
  "author": "Robin Hood",
  "createdUnix": "1343499548",
  "updatedUnix": "1343499602",
  "containsAdultContent": false,
  "uploadedBy": "RobinTheHoood",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77143",
      "name": "Explosionspfeile",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "428",
      "fileName": "Explosionspfeile-21251-1-0.rar",
      "uploadedUnix": "1343499602",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7a582d619c3ad17d4e7e97bce46f69c2fd5454fec68aa8864b0fd2f241bbb3f7/analysis/1407052324/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Explosionspfeile-21251-1-0.rar?fid=77143&ttl=1535789959&ri=8192&rs=8192&setec=0c01688c11cdc58e1b40d6016c32e949"
    }
  ]
}