{
  "modId": 21267.0,
  "modName": "Immersive FOV guide",
  "summary": "How to find the correct value for you!",
  "descriptionHtml": "Immersive FOV Guide\r\n\r\nThis is not a mod but a guide to setting up the appropriate FOV setting for your display, and modifying the ini or using the console to change these values.\r\n\r\nThis uses some basic geometry (don\\'t worry you don\\'t have to do there is a link to a calculator, so you just have to enter the numbers) to find what the FOV setting for you should be based on your distance from your display and the size of the display.\r\n\r\nThe default value is an arbitrary value Bethesda picked.  Yours should be different, so that it is more or less \\\"bug eyed\\\" or \\\"tunnel vision\\\"\r\n\r\nThe guide tells how to find the perfect value for you, and make the appropriate changes.\r\n\r\nFAQ\r\n\r\nWhat is FOV?\r\nField of View, this is the Angle that the camera in-game displays, it is adjustable thru the console or skyrim.ini.  High settings look \\\"bug-eyed\\\" low settings look like \\\"tunnel vision\\\"  Follow the guide to find the perfect setting for you.  Higher values give more awareness in combat situations, and can be better in that respect.\r\n\r\nI have a laptop and play Skyrim in several locations, what should I do?\r\nJust set the setting to an average of the locations, or the location you use most or use the console to adjust it at each location.  I have a desktop, so it does not move and the guide was intended for such.  \r\n\r\nNotes:\r\n\r\nFor the FOV to be perfectly immersive the game engine would need to track your movement via webcam, and adjust the setting dynamically, while in game. If this is possible to be done in a mod, it is beyond my ability to do so.  (which would probably require script dragon, which I do not recommend)\r\n\r\nHigher FOV settings affect z-fighting fixes See below link:\r\n\r\nhttp://www.youtube.com/watch?v=D0Rtj4bfSVQ&feature=BFa&list=SP8069C4B9B22A03CF",
  "categoryId": "78",
  "version": "1.1",
  "author": "Jimmybob",
  "createdUnix": "1343515838",
  "updatedUnix": "1343739856",
  "containsAdultContent": false,
  "uploadedBy": "jimmybob",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77854",
      "name": "Immersive FOV guide",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Immersive FOV guide-21267-1-1.zip",
      "uploadedUnix": "1343739856",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/da3ee9c3fa9bed5c72b1e382191f2ed7beba68f957f30f2a192d3d9d1a26ff28/analysis/1407059584/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20FOV%20guide-21267-1-1.zip?fid=77854&ttl=1535789991&ri=8192&rs=8192&setec=1de8b10ef005bb164ae8af136a5dacd0"
    }
  ]
}