{
  "modId": 21263.0,
  "modName": "W64 - Hunting and Cooking Enhanced",
  "summary": "Makes food and drink more valuable with new effects and improved prices, raises the prices of almost every ingredient and animal pelt/hide making hunting worth doing, and adds new ingredients and food!",
  "descriptionHtml": "[center][img]http://i.imgur.com/13gB7.png[/img][/center]\r\n\r\n[center][img]http://i.imgur.com/bQLqv.png[/img][/center]\r\n\r\n[center][img]http://i.imgur.com/I1c3Q.png[/img][/center][center]The aim of this mod is to make hunting and cooking actually worthwhile. If you don\\'t do alchemy then what\\'s the point in all the ingredients? If you don\\'t do smithing then what\\'s the point in all the hides and pelts? Cooking isn\\'t even worth mentioning within Skyrim, it\\'s completely useless when there\\'s potions about. Well, this mod changes all that.[/center]\r\n[center][img]http://i.imgur.com/GRXUE.png[/img]\r\n[b][color=#00FFFF]I realize this is a lot of text to read so if you don\\'t wish to read it, you should still be able to understand what\\'s going on.[/color][/b]\r\n\r\n[font=Georgia][size=5]Food & Drink[/size][/font]\r\nFood and drink are no longer completely useless. Why bother eating or drinking when you can quickly gulp down 17 potions and be instantly healed? Well, food and drink now actually have a point!\r\n\r\n[b]-[/b] You can regenerate [color=red][b]health[/b][/color] or increase your health for a short time by eating meat or fish. Obviously cooked meat is better than raw, but in a pinch raw meat can help too. \r\n\r\n[b]-[/b] Eating fruit or vegetables can help to regenerate [color=#00FF00][b]stamina[/b][/color] faster. \r\n\r\n[b]-[/b] Sugary treats help you in regenerating [color=#1569C7][b]magicka[/b][/color] faster.\r\n\r\n[b]-[/b] Ale or mead also has a \\'fortify stamina regeneration\\' effect, however in addition to that it will damage your stamina by a small amount when consumed. Wine does the same thing, except effecting magicka instead of stamina.\r\n\r\n[b]-[/b] Various meads and wines that were either non-playable or quest items have also been added to innkeepers across Skyrim. Some drinks are unique, for example \\'Dragons Breath Mead\\' can only be bought at the Four Shields Tavern in Dragon Bridge. There are other unique drinks that only be bought in places like Riften, Solitude and Markarth.\r\n\r\n[b]-[/b] Recipes for almost all soups and stews have been modified to accommodate their new effects. \r\n\r\n[font=Georgia][size=5]Hunting[/size][/font]\r\nHunting is now a viable way to make money! If you don\\'t use ingredients to make potions, or use the hides to make leather, well there really isn\\'t any a point in hunting... With this mod prices for all pelts, hides and animal-related items have been raised so [b]YOU[/b] can make more money.\r\n\r\n- Prices for each [b]hide and pelt[/b] in the game (excluding some quest items perhaps) has been raised. I tried to find a balance between you being to make money and merchants not charging ridiculous prices when buying. Not quite sure it worked out that way though...\r\n\r\n- [b]Animal parts[/b] such as; antlers, bear claws and sabre cat teeth have also has their prices raised to fit in with the other animal-related items like pelts and meat having [i]their[/i] prices raised.\r\n[color=#808080]There is bug related to this mentioned in the \\'Known Issues\\' section.[/color]\r\n\r\n- Every food item, including raw meats dropped by animals, has been given different prices related to their effect so you can even sell these if you don\\'t wish to cook them.\r\n\r\n[img]http://i.imgur.com/WzjWm.png[/img]\r\n\r\n[img]http://i.imgur.com/MCVpA.png[/img]\r\n- If this mod becomes popular enough, and I am driven to work harder on it then I will add other items, food and whatever comes between.\r\n[/center]\r\n\r\n[center][img]http://i.imgur.com/zbBiR.png[/img]\r\nTo install this mod you can either use the Nexus Mod Manager download, or install it manually by extracting the contents of the download into your skyrim/Data folder.\r\n\r\nTo uninstall just delete those files.\r\n[/center]\r\n\r\n[center][img]http://i.imgur.com/7X67z.png[/img]\r\n\r\n- There is an issue involving the ingredient prices. If you are using \\'SkyRE - Main\\' or \\'ACE - Enchanting\\' then the prices of some ingredients will go back to their default. You can use any other \\'SkyRE\\' or \\'ACE\\' component and it will work fine. [b]If anyone wishes to look into this before I get round to it feel free to do so.[/b]\r\n\r\n[color=#FF0000][b]If you discover any bugs report them.[/b][/color]\r\n[/center]",
  "categoryId": "24",
  "version": "1.0",
  "author": "Wolve64",
  "createdUnix": "1343511790",
  "updatedUnix": "1343511790",
  "containsAdultContent": false,
  "uploadedBy": "Wolve64",
  "primaryFile": null,
  "files": []
}