{
  "modId": 21280.0,
  "modName": "New Conjuration Spell- Dismissal",
  "summary": "Adds a new conjuration spell that allows the player to dismiss their current Summon (not their raised undead followers).",
  "descriptionHtml": "First of all, this is not based on Dreighton\\'s original Dismiss Summons spell found here:  http://skyrim.nexusmods.com/mods/10178.  \r\n\r\nI made this spell from scratch and its initial purpose is for the players who have been downloading my summoning spell mods, but it can also work for the vanilla summoned spells.  This will also dismiss the vanilla version of Arniel\\'s Shade and the DB\\'s Spectral Assassin spells.  The way the spell is designed, it should also dismiss any other modded summons the player has downloaded.\r\n\r\nJust aim at the summoned actor and fire.  This spell will dismiss any summon within the firing range.\r\n\r\nThe only thing it cannot dismiss are raised undead followers.  Dreighton\\\\\\'s spell can accomplish this feat, and his mod has a greater range of dismissing, but his spell cannot dismiss the Spectral Assassin or Arniel\\'s Shade.\r\n\r\nThe spell can be found in the College\\'s Midden area, at the table next the the Atronach Forge.\r\n\r\nIf you have any issues with this spell, please let me know.  If the summoned actor has a high magicka resistance, you may need to cast the spell two or three times to dismiss the summon.\r\n\r\n",
  "categoryId": "75",
  "version": "1",
  "author": "zeroeternalz",
  "createdUnix": "1343522089",
  "updatedUnix": "1343522175",
  "containsAdultContent": false,
  "uploadedBy": "zeroeternalz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77232",
      "name": "New Conjuration Spell - Dismissal",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "New Conjuration Spell - Dismissal-21280-1.zip",
      "uploadedUnix": "1343522175",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/6939e43482c88b83e8b3117a462d26bbdfb212ad92b3061ee94e97f09a73ceb7/analysis/1407053050/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Conjuration%20Spell%20-%20Dismissal-21280-1.zip?fid=77232&ttl=1535790015&ri=8192&rs=8192&setec=58d9c6ac58261b5635112e7e18b557b3"
    }
  ]
}