{
  "modId": 21301.0,
  "modName": "Followers Hunting Bow Replacement",
  "summary": "Replaces the automatically spawning low-level bow with a better one",
  "descriptionHtml": "Sometimes, some followers, automatically spawn a bow and start using that, instead whatever you gave. There are mods which allow you to fight this code manually or using automated scripts: always by removing that bow. I consider that it is wiser not to fight it, but play along: allow your follower to have this additional bow and arrows. An archer follower is great support, as always can reach the enemy, without getting in your way. You can still make your follower a warrior or mage by using a mod like Extensible Follower Framework (see at bottom of page), then add/allow this bow as secondary or tertiary weapon - to switch to when the primary weapon can\\'t be used because a staff has no charges, the enemy is far away or above, and is best to switch temporarily to bow. For close fights, archers need melee weapons too. Be well prepared and have fun! \r\n\r\n--- Which version to choose?\r\nThere are 20, 40, 60, 80 or 100 bow damage versions. Everything else it is the same.\r\nThe default follower\\'s bow damage, unchanged by this mod is 7.\r\nThe arrow\\'s damage is also increased from 8 to 24, but in my latest playthrough, my follower never spawned them automatically, I had to add through the console. So you may need to provide different arrows anyway.\r\n\r\n--- How to install?\r\nRemove old version (if any) by reversing the install instructions or using your manager.\r\nCopy your choosen bow damage version into Skyrim\\'s Data folder and enable in launcher.\r\n- If you choose a lower damage version, and later want higher damage, remove the old one and replace with the new one. No clean save needed.\r\n\r\n--- What this mod does?\r\nThis modifies only certain values of that special version of the Hunting Bow, which spawns or respawns in your followers inventory in certain conditions.\r\nThe normal Hunting Bow is not changed. If you ever see in you followers inventory Hunting Bow and Hunting Bow - the easiest way to tell them apart is to check their weight: only the follower version has a weight of 0 (set by this mod).\r\nSpecial care was taken to avoid changing too much, as that may lead to incompatibilites with something - so name, ID and so on, remains unchanged. Any mod targeting the original, will succeed with this one too (for example those scripts which remove this from followers inventory)\r\nThis mod changes only:\r\n- bow\\'s damage from default 7 to 20, 40, 60, 80 or 100 (depending on what versions you choose to enable),\r\n- the bow\\'s model and related values, to look and act like the \\\"Imperial\\\" Bow - which is wooden and fits with most outfits\r\n- weight from 8 to 0, so if multiple items of this type spawn, no weight related problems should occur\r\n+\r\nalso replaces the auto spawning \\\"magic arrows\\\", made to look as the daedric model, as this seemed to be the most neutral looking:\r\n- arrow\\'s damage from 8 to 24. equal with daedric arrows damage\r\n- quiver and arrow model and projectile same as the daedric\r\n- quiver weight from 7 to 0\r\n\r\n--- What\\'s the purpose of this mod?\r\nThis can solve the annoyance of the low level bow spawning and switching, as now they will spawn and use this bow - without any performance impact, as no script is needed to run to check and remove the bow and do whatever else.\r\nI still recommend to get mods which allow you to choose and decide your follower\\'s fighting style, preferred weapon, inventory and so on (see recommendations at bottom of page), because if you want your follower to become an archer, it\\'s not enough to just give them a bow; they will switch to their preferred weapon as soon as they can loot such a weapon - you have to change their AI behaviour too. \r\nIf you don\\'t mind, it\\'s the best choice to give them both ranged and melee weapons, so they can switch between those - just specify which one to prefer.\r\n\r\n--- Compatibility:\r\nNothing else is changed or contained in this mod, so this should be compatibile with everything - if any other mod changes these values, the one placed lower in the loading order will win, but no problems should occur.\r\nMod created with Skyrim v1.6.89.0 - should work with previous game versions too, but I cannot test that.\r\n\r\n--- Performance:\r\nThis can\\'t affect performance at all, it\\'s just the replacements of some values, only default models used.\r\n\r\n--- Testing:\r\nFor testing, you can add it manually through the console - add these only to your followers, not sure what happens if you add these to the player aka \\\"Dragonborn\\\":\r\npress ~ key, then click through the console on your follower (easier to do in first person mode) and type\r\ninv\r\nthen press enter - you will see a list of his/her inventory (after adding check again)\r\nand read there and make sure that\\'s your follower (use PgUp and PgDn buttons to go up or down in list)\r\nif that\\'s your follower, so you selected correctly\r\nthen add the bow:\r\nadditem 10e2dd 1\r\nthen add 100 arrows or any number you want (this won\\'t show up in regular inventory, that\\'s normal, but it\\'s there, and can be seen in console named \\\"Iron Arrow\\\"):\r\nadditem 10e2de 100\r\nThen remove all other weapons (or use equip command instead additem) or even better, use a mod which changes specializations.\r\n\r\n--- These are not required - just follower related mod recommendations:\r\n\r\nTo change a follower\\'s specialization, for example from two-handed into archer I recommend using Extensible Follower Framework - or any other you prefer, but this is what I like:\r\nhttp://skyrim.nexusmods.com/mods/12933\r\nand set specialization to archer (or whatever you prefer),\r\nas a better \\\"relax\\\" sandboxing function for followers, use this instead (put in load order bellow EFF)\r\nhttp://www.skyrim.nexusmods.com/mods/9504\r\n\r\nThe blonde female follower from the pictures is Ria (other then the one from the Companions), here is a work in progress to add more dialogs for her and a non-nude skin version:\r\nhttp://www.skyrim.nexusmods.com/mods/19983\r\nThe original Ria without extra dialogues and bug fixes (Warning - is rated \\\"Adult\\\" because of ... nudity)\r\nhttp://skyrim.nexusmods.com/mods/17354\r\n\r\nThe other follower without weapons, in blue dress is Cerwiden, a healer with configurable \\\"smart AI\\\":\r\nhttp://skyrim.nexusmods.com/mods/20787/\r\n\r\nThen Serana from the Dawnguard DLC, with custom eye texture and mesh, + some hack customizations (if anyone wants to make her look like this, just ask)\r\n\r\nThen the huscarls you get when becoming Thane, here is a nice appearance mod for them:\r\nhttp://www.skyrim.nexusmods.com/mods/22155\r\n\r\nThen some \\\"Magical Markers\\\" to help you locate followers if they get lost:\r\nhttp://skyrim.nexusmods.com/mods/17483\r\n\r\nI don\\'t use horses, to much bugs (like teleporting them noisily over your head because of poor pathfinding), but if you want to try it, Convenient Horses is a very good mod and complements the above:\r\nhttp://skyrim.nexusmods.com/mods/14950\r\n\r\n-------------------------------------------------\r\nCredits:\r\nThanks to Bethesda Game Studios for Skyrim ",
  "categoryId": "66",
  "version": "1.1",
  "author": "WhiteShores",
  "createdUnix": "1343558857",
  "updatedUnix": "1343653469",
  "containsAdultContent": false,
  "uploadedBy": "WhiteShores",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77311",
      "name": "FollowerHuntingBow",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "FollowerHuntingBow-21301-1-0.zip",
      "uploadedUnix": "1343559018",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a5d6a19c1eb775030b3ef9f8c9801322f9117c06674f58d3328be407a11c5f8a/analysis/1407053788/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FollowerHuntingBow-21301-1-0.zip?fid=77311&ttl=1535790069&ri=8192&rs=8192&setec=49e8683fcbce5e956de430c2fb2177da"
    },
    {
      "fileId": "77622",
      "name": "FollowerHuntingBow_20",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "FollowerHuntingBow_20-21301-1-1.zip",
      "uploadedUnix": "1343652882",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/de6de099f2e1ffe40fe192ae20c59c5e44d10cbdcd1b0938e3620b0f6383423f/analysis/1407057183/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FollowerHuntingBow_20-21301-1-1.zip?fid=77622&ttl=1535790070&ri=8192&rs=8192&setec=0dc8d4fc59fb6f57e199c8cfed9d165e"
    },
    {
      "fileId": "77623",
      "name": "FollowerHuntingBow_40",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "FollowerHuntingBow_40-21301-1-1.zip",
      "uploadedUnix": "1343653354",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ad97b50c4fbd909a7d5bf2f375c8c924c04eeae745324c2356f4c59c956067a5/analysis/1407057183/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FollowerHuntingBow_40-21301-1-1.zip?fid=77623&ttl=1535790070&ri=8192&rs=8192&setec=0af296dcc3487b1cb6ad7c077ac09b04"
    },
    {
      "fileId": "77625",
      "name": "FollowerHuntingBow_60",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "FollowerHuntingBow_60-21301-1-1.zip",
      "uploadedUnix": "1343653405",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/50461fa6f592464b9f70ed84cf5fc5a80878eb7d47858f622d16d840c94c0e4c/analysis/1407057185/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FollowerHuntingBow_60-21301-1-1.zip?fid=77625&ttl=1535790071&ri=8192&rs=8192&setec=46bea067e77c9260cf2356cb692bf992"
    },
    {
      "fileId": "77626",
      "name": "FollowerHuntingBow_80",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "FollowerHuntingBow_80-21301-1-1.zip",
      "uploadedUnix": "1343653437",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/0ad75f3b57c8f9d7d6f46f9a6398cbb65f5dc2f9c70b7909b19ec67c419d69fd/analysis/1407057243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FollowerHuntingBow_80-21301-1-1.zip?fid=77626&ttl=1535790072&ri=8192&rs=8192&setec=d533c6017bdcc60cb8166dba1a29d034"
    },
    {
      "fileId": "77627",
      "name": "FollowerHuntingBow_100",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "FollowerHuntingBow_100-21301-1-1.zip",
      "uploadedUnix": "1343653469",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c1ac575b3dbe534473c4dedf09153a9cbc3a1751183101cd99097351f3edbc23/analysis/1407057243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FollowerHuntingBow_100-21301-1-1.zip?fid=77627&ttl=1535790072&ri=8192&rs=8192&setec=96df43e720f19976bf77123362552b87"
    }
  ]
}