{
  "modId": 21326.0,
  "modName": "Heavy Armory - New Weapons - German",
  "summary": "This is ONLY the German Translation of the Mod!",
  "descriptionHtml": "[center] THIS IS ONLY THE GERMAN TRANSLATION OF THE MOD! Original [url=http://skyrim.nexusmods.com/mods/21120]Here[/url]\r\n\r\n[IMG]http://www.abload.de/img/heavyarmoryk1jwrtmbtd.png[/IMG]\r\n\r\n\r\n[B][U][SIZE=4]Beschreibung:[/SIZE][/U][/B]\r\n\r\n\\\"Heavy Armory\\\" ist ein Mod, der viele lore-freundliche Waffen zum Spiel hinzufügt. Man findet die  Waffen in den Händen von Banditen, Wachen, Vampiren, Draugr, Falmer und anderen NPCs in Himmelsrand. Auch kann man die Waffen an jeder Schmiede schmieden (vorrausgesetzt man hat die benötigten Kentnisse und  Materialien).\r\nEs gibt insgesamt 56 neue Waffen. Diese umfassen auch eine Vielzahl neuer Waffen. Man kann Keulen, Hellebarden, Speere, Glefen, Kurzschwerter und Schlagstöcker finden.\r\nNehmt euch aber vor den Draugr, Falmer und Abgeschworenen in Acht. Auch sie haben ein Vielzahl an neuen Waffen bekommen!\r\n\r\nAlle  diese Waffen wurden mit Teilen von verschiedenen Vanilla-Waffen zusammengebastelt. Ein Speer zum Bespiel benutzt unter anderem Kriegshammer und Schwertteile. Wenn man also einen Texturenreplacer für Waffen benutzt, werden auch diese von dieser Mod übernommen.\r\n\r\n\r\n[B][U][SIZE=4]Neue Waffen:[/SIZE][/U][/B]\r\n\r\nFragst du dich, welche neuen Waffen durch die Mod hinzugefügt werden? Hier ist eine Liste:\r\n\r\n[IMG]http://www.abload.de/img/21120-1-1349470228rmke3.jpg[/IMG]\r\n\r\n[B]Notiz:[/B]\r\n- Es gibt keine Nordheldenkeule (Helden sind nicht so primitiv!)\r\n- Himmelsschmiedenwaffen benutzen Stahlmodelle. Sie wurden nur hinzugefügt, weil sie bisher noch nicht existierten.\r\n\r\nAlle Waffen können an der Schmiede hergestellt werden und am Schleifstein verbessert werden.\r\n\r\n[SIZE=3]Nun auch für Dawnguard[/SIZE]\r\nIn den Downloads findet ihr nun 2 Hauptdateien. Eine für Vanilla-Nutzer und eine für Dawnguard-Nutzer.\r\nDawnguard-Nutzer können nun auch die Drachenknochenwaffen bekommen. Wird in der Zukunft vllt um Armbrüste und Dämmerwachtwaffen erweitert.\r\n\r\n[IMG]http://www.abload.de/img/21120-2-1349470228qqqys.jpg[/IMG]\r\n\r\n\r\n[SIZE=4][U][B]Neue Waffentypen[/B][/U][B][U]:[/U][/B][/SIZE]\r\n\r\n[B]Speere/Glefen:[/B]\r\nSpeere und Glefen haben die höchste Reichweite von allen Waffen im Spiel. Sie sind zweihändig und zählen als Streitäxte.\r\n\r\nSpeere sind sehr schnell für 2-Händige Waffen, was im Vergleich zu ihrem Schaden, gut für jeden Spieler ist, der Abstand zu seinem Gegner haben  will. Verglichen mit anderen Zweihandwaffen machen Speere nicht sonderlich viel Schaden.\r\n\r\nGlefen sind leicht schwerer und stärker als Speere. Deren Kritischer Schaden ist auch höher. Der Nachteil ist  aber, sie sind ein bisschen langsamer (trotzdem noch schneller als  Streitäxte!)\r\n\r\n[B]Hellebarden:[/B]\r\nHellbarden sind  mehr oder weniger wuchtige Kriegsäxte. Sie schwingen genauso schnell, machen weniger Schaden, haben aber eine höhere Reichweite. Gut für starke Kämpfer, welche Reichweite statt Schaden bevorzugen. Ein gutes Kompromiss zwischen dem Schaden der Streiaxt und der Reichweite des Speers.\r\n\r\n[B]Schlagstöcker:[/B]\r\nSchlagstöcker sind am schnellsten von alle 2-Händigen Waffen und haben die Reichweite eines Kriegshammer. Der Nachteil ist, dass diese Waffen die schwächsten unter  den Zweihändern sind. Man kann seine Gegner damit aber schnell und oft treffen.\r\n\r\n[B]Keulen:[/B]\r\nDes Barbars Waffe. Keulen zählen als Streikölben, aber sind allgemein den eleganteren Waffen untergeordnet. Beliebt bei Banditen, Draugr, Abgeschworenen und Falmer.\r\n\r\n[B]Kurzschwerter:[/B]\r\nEin  Mix aus Schwertreichweite und Dolchschnelligkeit. Kurzschwerter haben einen kürzere Reichweite und machen weniger Schaden als Schwerter, sind aber sehr schnell. Sie zählen als Schwerter, sind aber nicht so leise  wie Dolche.\r\n\r\n[B]Kuzspeere:[/B]\r\nBenutzt Schwertanimation und den dazugehörigen Talentbaum\r\nKurzspeere können in einer Hand gehalten werden. Sie sind von den Werten her vergleichbar mit einem Schwert, mit ein paar Ausnahmen. Sie haben die höchste Reichweite der Einhändigen Waffen (sind in der Liste direkt unter den Zweihändern).\r\nDurch ihre Größe sind sie dagegen im Vergleich zu Schwertern langsamer.\r\n\r\n\r\n[SIZE=4][U][B]Installation:[/B][/U][/SIZE]\r\n\r\n1. Ladet euch die Mod hier herunter.\r\n2. Sucht euch eine Version aus.\r\n3. Verschiebt die esp-Datei des Mods in eurer Skyrimverzeichnis (da wo die TESV.ese ist).\r\n4. Spaß haben.\r\n\r\n\r\n[B][U][SIZE=4]Bugs/Probleme:[/SIZE][/U][/B]\r\n\r\n- Das Glühen auf den Daedrischen Waffen schaut ein bisschen seltsam aus.\r\n- Speere und Glefen benutzen die Animationen für die Streitaxt.\r\n\r\n\r\n[B][U][SIZE=4]Changelog:[/SIZE][/U][/B]\r\n\r\nV 1.0\r\nInitial release\r\n\r\nV 1.01\r\nFixes the Ebony Glaive\r\n\r\nV 1.1\r\nFixes Ebony Halberd crafting\r\nSpears and glaives now use two-handed blade animation and perks!\r\nAdded Silver dagger and spear.\r\n\r\nV 1.2\r\nFixed Silver Spear\r\nAdded new shortspears! Comes in Iron, Steel, Dwarven, Elvish and Glass.\r\nAdded Imperial Spear\r\n\r\nV 1.2.1\r\nAdded missing crafting recipes for shortspears.\r\n\r\nV 1.3\r\nAdded Draugr and Skyforge Steel spears and Shortspears\r\nReleased the Dawnguard version of Heavy Armoury!\r\n\r\n\r\n[B][U][SIZE=4]Credits:[/SIZE][/U][/B]\r\n\r\nPrivateEye - Für die Originalmod \r\n[/CENTER]\r\n",
  "categoryId": "55",
  "version": "1.3",
  "author": "PrivateEye",
  "createdUnix": "1343594349",
  "updatedUnix": "1350328181",
  "containsAdultContent": false,
  "uploadedBy": "powerbenny1706",
  "primaryFile": null,
  "files": [
    {
      "fileId": "94058",
      "name": "Heavy Armory Dawnguard Edition 1-3 German",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2843",
      "fileName": "Heavy Armory Dawnguard Edition 1-3 German-21326-1-3.7z",
      "uploadedUnix": "1350328098",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/018952f71abb63324f8f703d65483cce2fc3dc161ebf6ee5ad7fb46d6d43905b/analysis/1407223686/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Heavy%20Armory%20Dawnguard%20Edition%201-3%20German-21326-1-3.7z?fid=94058&ttl=1535790147&ri=8192&rs=8192&setec=672c5051757cad9500271b7664d991cd"
    },
    {
      "fileId": "94059",
      "name": "Heavy Armory 1-3 German",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2496",
      "fileName": "Heavy Armory 1-3 German-21326-1-3.7z",
      "uploadedUnix": "1350328181",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/6c873d3a24c3517bf20ca0805988759bf502df83b377f838667ac6049630df03/analysis/1407223688/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Heavy%20Armory%201-3%20German-21326-1-3.7z?fid=94059&ttl=1535790147&ri=8192&rs=8192&setec=9d571433a0d0bef2821f333b85f4e984"
    }
  ]
}