{
  "modId": 21341.0,
  "modName": "Ebony Mage Armor by Natterforme",
  "summary": "This is a Nexus Exclusive. This adds a set of equipement intended for mages and high level characters. ",
  "descriptionHtml": "\r\n\r\n \r\nName: Ebony Mage Armor by Natterforme\r\n Version: 1.05\r\n Date: 10/23/2012\r\n Category: Weapons and Armor\r\n Recommended: Skyrim Mod Manager\r\n Author(s): Natterforme\r\n Source: \r\n  \r\nDescription\r\n ===========\r\n This is a Nexus Exclusive. This adds a set of equipement intended for mages and high level characters. \r\nLocation\r\n ========\r\n All pieces of the set can be crafted at the crafting forge and can be tempered at the proper upgrading areas. The armor is stand alone and will not replace any vanilla armors.\r\n \r\nDetails\r\n =======\r\n \r\n THIS IS A NEXUS EXCLUSIVE! NO STEAM SUPPORT WILL BE OFFERED AT THIS TIME! IF I FIND THAT THIS HAS BEEN UPLOADED TO STEAM WITHOUT MY PERMISSION I WILL NOT BE LENIENT TOWARDS THE UPLOADER(S). YOU HAVE BEEN WARNED!!!\r\n \r\n This mod adds several items to the game. The set includes a cuirass, two types of gauntlets, boots, and two hood options. All of the equipement can be used by both genders and you can now use the hoods on the Argonians and Khajits. The gauntlets are standard ebony gauntlets, but there is a set of gloves as well, which have less armor on the model, but have the same stats as the gauntlets. One of the hoods does not show the face and is labeled as the No Head option. All pieces of the armor can be crafted at the crafting forge and can be tempered at the proper upgrading areas. All pieces of the armor come in Non Armor, Light Armor, and Heavy Armor armor types, but are aesthetically the same. All types use ebony ingots to craft or upgrade, although the non armor version does not require a perk to craft the items. The light armor version needs the Glass Smithing Perk to craft the items. The heavy armor variety requires the Ebony Smithing Perk and has equivalent stats as Ebony. This armor uses vanilla assets so if things do not look right, then you probably have a confliction caused by a texture replacer.  \r\n \r\n\r\nInstall\r\n =======\r\nEither throw the folders into your Data directory or use the Nexus Mod Manager to do it for you.\r\n\r\nUninstall\r\n =========\r\n Either use Nexus Mod Manager to remove the files or manually remove them from you Skyrim/Data folder. \r\n\r\nUpgrade\r\n =======\r\n I plan to upgrade and improve this mod over time as I fix bugs, think of new ideas, become more adapted to the CK, and so on. Be sure to check back in once and awhile for updates. Be sure to completely uninstall any previous versions of this mod before upgrading though.\r\n \r\nI will not take responsibility for corrupted save games or lost save games. Get into the habit of backing up your saves to protect your game data. Ignore at your own risk!\r\n\r\nIncompatibility\r\n ===============\r\n This mod should not be incompatable with any other mods to my knowledge. However it is always a possibility so please let me know about it if you experience a conflict.\r\n \r\nKnown Issues or Bugs\r\n ====================\r\n \r\n There are no known issues at this time. Please exhaust all possible avenues of mod confliction before reporting a bug or an error. To be fair, I do mess up occassionally and make mistakes, but many problems are often the cause of the mod user, and not the mod maker. Also, be sure to give a complete explaination of your problem so that I can more adequetely address the issue when you find one.. Screenshots are highly recommended in this regard.\r\n \r\n \r\nHistory\r\n =======\r\n \r\n 10/22/2012- Version 1.05 \r\n -Fixed issues on cuirasses that gave the appearance of blotchy textures.\r\n -Fixed issue of hoods not working for Argonians and Khajits. They now work.\r\n -Fixed clipping on female hoods.\r\n \r\n 7/29/2012- Version 1.0 Initial Release\r\n \r\nContact\r\n =======\r\n You can find me on the Nexus Forums here as Natterforme.\r\n \r\nCredits\r\n =======\r\n\r\n Thanks to Bethesda for creating Skyrim.\r\n Thanks to SkyrimNexus.com for the a one-stop-shop resource for authors and players.\r\n Thanks to LHammonds for the Readme Generator this file was based on.\r\n Thanks to all of you who have encouraged me and have supported me since I first put up screenshots of my work back in December 2011 and January 2012.\r\n I thank you all for your patience with me^^.\r\n Thanks to God for creating us all. Amen.\r\n \r\nTools Used\r\n==========\r\n7-Zip - http://www.tesnexus.com/downloads/file.php?id=15579\r\nBlender - http://www.tesnexus.com/downloads/file.php?id=12248\r\nNIFSkope - http://niftools.sourceforge.net/wiki/NifSkope\r\nOblivion Mod Manager - http://www.tesnexus.com/downloads/file.php?id=2097\r\nPaint.NET - http://www.tesnexus.com/downloads/file.php?id=11909\r\nPhotoshop - http://www.adobe.com/products/photoshop/\r\nReadme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r\n\r\n Licensing/Legal\r\n ===============\r\n This is a Skyrim Nexus Exclusive.\r\n\r\n You MUST contact me before you do anything with this mod in any form for any reason. This includes language translations. I will NOT be providing Steam Workshop support at this time. \r\n\r\n I do not feel comfortable with their legal policies towards modding so I will not use it. I will not support or endorse its use at this time. If I want it to be on Steam, I will do so myself. If you see this on Steam, LET ME KNOW! I will not support any version of this mod found on Steam. I will not accept any childish excuse about \\\"sharing\\\" with the community. If you refuse to respect my wishes, I can not, in good faith, respect yours.\r\n\r\n -Natterforme",
  "categoryId": "54",
  "version": "1.05",
  "author": "Natterforme",
  "createdUnix": "1343616619",
  "updatedUnix": "1351033137",
  "containsAdultContent": false,
  "uploadedBy": "Natterforme",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77550",
      "name": "Ebony Mage Armor Version 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11191",
      "fileName": "Ebony Mage Armor Version 1_0-21341-1-0.zip",
      "uploadedUnix": "1343617112",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7a5e9d20771e960c7b57d6688879bd4cf54d7ebc31786ce605f9b79426a5089a/analysis/1407056538/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ebony%20Mage%20Armor%20Version%201_0-21341-1-0.zip?fid=77550&ttl=1535790172&ri=8192&rs=8192&setec=17b41297537f4c76608937d26d32ad09"
    },
    {
      "fileId": "95459",
      "name": "Ebony Mage Armor Version 1_05",
      "version": "1.05",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11202",
      "fileName": "Ebony Mage Armor Version 1_05-21341-1-05.zip",
      "uploadedUnix": "1351033137",
      "modVersion": "1.05",
      "virusScanUrl": "https://www.virustotal.com/file/5244eaae8382a6aec0c9bf3bf222f203899750750da4094b017a9834581f38ec/analysis/1407233771/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ebony%20Mage%20Armor%20Version%201_05-21341-1-05.zip?fid=95459&ttl=1535790173&ri=8192&rs=8192&setec=c1e2fc189fe717fcc2a105aa6b763774"
    }
  ]
}