{
  "modId": 21349.0,
  "modName": "Advanced Shrine Blessings - Shrines to the Nine Divines",
  "summary": "The 9 divines now require a small donation in order to use their shrine and receive a blessing - and your actions in-game will determine how much they accept, and if they accept or refuse!\r\n\r\n",
  "descriptionHtml": "This mod personalizes the shrines to the 9 Divines - each god now requires a small donation before granting their blessing, and the cost for this depends on how well you are following the teachings of that particular divine in-game.  If you follow the teachings of a particular divine, the blessing will still be granted for free - but it\\'s not always easy to do this with every god!\r\n\r\nThis mod has been tested and seems to work fine, but the usual mod disclaimer applies -  please keep a back-up save before installing and don\\'t continue with your current character until you are sure this mod causes no issues.  If you find any issues please let me know.\r\n\r\n=============================\r\nFeatures in beta version 1.5 - \r\n\r\nActivating a shrine will now bring up a messagebox, welcoming the player to the shrine and asking what they would like to do here.\r\n\r\nOption 1: Just pray\r\n\r\nIf the player selects \\\"just pray\\\", then the player will be switched into 3rd person mode and an animation of the player praying will be played.\r\n\r\nThere is a very small chance that the god will hear the prayer and respond. The vast majority of the time nothing further will happen - a message notification will tell you that the god has not responded on this occasion - the prayer animation will finish and the player will be put back into first person mode.\r\n\r\nOption 2: Offer donation of 100 gold to the temple\r\n\r\nIf the player selects \\\"offer donation of 100 gold\\\" then 100 gold will be removed from the player and there is a 25% chance that the god will respond. Otherwise a message notification will tell you that the god has not responded on this occasion.\r\n\r\nOption 3: Offer donation of 500 gold to the temple\r\n\r\nIf the player selects \\\"offer donation of 500 gold\\\" then 500 gold will be removed from the player and the god will nearly always respond.\r\n\r\n\r\nOnce the god responds, the reward (as before) will be based on certain conditions.\r\n\r\n- If the player has just prayed, then the maximum they will get is the standard (default) blessing. Prayer alone will never gain the superior version of the blessing.\r\n\r\n- If the player has donated 100 gold, but has committed offenses contrary to that particular god, the donation will be taken by the god but the blessing will be refused. Atonement is possible in most cases.\r\n- If the player has donated 100 gold, and has done nothing to offend the god, the standard blessing will be granted.\r\n- If the player has donated 100 gold, and has generally followed the teachings of that particular god to a certain degree, then the blessing will be granted, and 50 gold returned to the player with a notification that the god has returned the money in order to encourage further good deeds, and to spend it in service of spreading the teachings of the god.\r\n- If the player has donated 100 gold, and has followed the teachings of that particular god to a large degree, then the blessing will be granted and the full 100 gold returned to the player, with a notification that the god has returned the money in order to encourage further good deeds, and to spend it in service of spreading the teachings of the god.\r\n\r\n- If the player has donated 500 gold, but has committed offenses contrary to that particular god, the donation will be taken by the god but the blessing will be refused. Atonement is possible in most cases.\r\n- If the player has donated 500 gold, and has done nothing to offend the god, the standard blessing will be granted.\r\n- If the player has donated 500 gold, and has generally followed the teachings of that particular god to a certain degree, then the blessing will be granted, and 250 gold returned to the player with a notification that the god has returned the money in order to encourage further good deeds, and to spend it in service of spreading the teachings of the god.\r\n- If the player has donated 500 gold, and has followed the teachings of that particular god to a large degree, then the blessing will be granted and the full 500 gold returned to the player, with a notification that the god has returned the money in order to encourage further good deeds, and to spend it in service of spreading the teachings of the god.\r\n\r\n\r\nI\\'m also looking into applying the wearing of a corresponding amulet to the chances of receiving the blessing - for example a 25% chance of succes when donating 100 gold would be changed to a 50% chance of success when wearing the amulet of that particular god.\r\n\r\nThe contentious animal-killing penalties of worshipping Kynareth have been toned down - now, rather than being penalised for killing animals, the player will gain additional rewards for not killing them.\r\n\r\nSo far, these additional features only apply to Kynareth and Julianos - the rest of the shrines still have the old features as listed below.\r\n\r\n----------------------------------------\r\nCHANGELOG 1.1 from 1.0BETA\r\n- fixed double messagebox for Shrine of Kynareth superior blessing\r\n- fixed error where penance money for Kynareth was not being removed when applicable\r\n- fixed text error referring to Zenithar as Julianos by mistake\r\n- donation costs doubled\r\n- Arkay: number of undead required to be killed for reduced cost has been increased from 25 to 250 and from 50 to 500\r\n- Julianos: requirement for books read for free blessing has been increased from 25 to 50.  The cheaper blessing requirement (10 books) remains as before.\r\n-----------------------------------------\r\n\r\n\r\n1) Shrine to Arkay\r\n- renamed as Shrine to Arkay, God of the Cycle of Life and Death\r\n\r\nStandard donation of 50 gold required.\r\n\r\nUpon receiving a blessing, a message says \\\"You have shown respect for the balance of life and death - Arkay grants his blessing! Arkay wills you to help return those undead spirits back to the cycle, and frowns upon acts of necromancy.\\\" This acts as an explanation that killing undead is desirable and acts as a warning not to follow the path of necromancy too far.\r\n\r\nIf you have the necromancy perk, the offering will be refused with the message \\\"You have travelled too far down the path of Necromancy! Arkay rejects your offering!\\\"\r\n\r\nIf you are a vampire (technically it checks for the player having Vampire\\'s Sight) the blessing is refused, with the message \\\"You are a vile undead creature of the night! Arkay rejects your offering! Your spirit must return to the grave, or you must return to the world of the living before it is too late!\\\"\r\nThis gives the player the option of being cured of vampirism and doesn\\'t lock the player out - Vampire\\'s Sight is removed from the player upon being cured, and the blessing will be granted again.\r\n\r\nIf you have killed more than 250 undead, then Arkay encourages your deeds by accepting just 25 gold as a donation.\r\n\r\nIf you have killed more than 500 undead, you have pleased Arkay greatly and the blessing is granted for free.\r\n\r\n\r\n-----------------------------------------------------\r\n\r\n\r\n2) Shrine to Dibella\r\nrenamed as \\\"Dibella, Goddess of Beauty and Patron of the arts\\\".\r\n\r\n50 gold required in order to offer a standard donation.\r\n\r\nStandard message when offering a donation reads: \\\"Dibella grants your blessing! Worship the embodiment of beauty through the arts, and please Dibella as you please your lover.\\\" - The blessing is granted, and 50 gold is then removed from player.\r\n\r\nIf the player has completed the \\\"Fit for a Jarl\\\" quest, the message reads \\\"Your appreciation of fine clothing pleases Dibella - she grants a blessing for just 25 gold!\\\" - The blessing is granted and just 25 gold is removed from the player.\r\n\r\nIf the player is a member of the bard\\'s college (has completed the \\\"Tending the Flames\\\" quest), the message says \\\"Your poetic and musical artistry is pleasing to Dibella - she grants a blessing for just 10 gold!\\\" - The blessing is granted and just 10 gold is removed from the player.\r\n\r\nIf the player has Lovers Comfort as an active magic effect (ie. they\\'ve slept with their spouse recently) then the blessing will be granted for free, with the message \\\"Dibella grants your blessing! Worship the embodiment of beauty through the arts, and please Dibella as you please your lover.\\\"\r\n\r\n\r\n------------------------------------------------------\r\n\r\n\r\n3) Shrine to Julianos\r\n- renamed as \\\"Julianos, God of Wisdom and Logic, Knowledge and Learning\\\".\r\n\r\n50 gold required in order to offer a standard donation.\r\n\r\nStandard message when offering a donation reads: \\\"Julianos sees that you learn through your actions - Julianos grants your blessing! He encourages further pursuit of knowledge through reading.\\\" The blessing is granted, and 50 gold is then removed from player.\r\n\r\nIf the player has read more than 10 books, the message reads \\\"Your pursuit of knowledge through reading is encouraged by Julianos - he grants a blessing for just 10 gold! Continue in your thirst for knowledge!\\\" - The blessing is granted, and 10 gold is then removed from the player, rather than 25.\r\n\r\nIf the player has read more than 50 books, the message reads \\\"Your pursuit of knowledge through reading pleases Julianos greatly - he grants a blessing for free!\\\" - The blessing is granted for free.\r\n\r\nJulianos has no conditions/blacklist for his worshippers - all actions are considered knowledge of a sort - it is only once everything is known that one can be truly wise.\r\n\r\n\r\n-------------------------------------------\r\n\r\n\r\n4) Shrine to Kynareth\r\n- renamed as \\\"Shrine of Kynareth, Goddess of Air and of Nature\\\".\r\n\r\n50 gold is required as a donation.\r\nIf the player has kept nature in balance (has killed no more than 50 animals) he will be granted the normal blessing, with the message \\\"You respect the balance of nature, but be mindful you do not kill too many animals in the future - make use of those animals who have already been killed and whose bodies litter the land. For now, Kynareth grants her blessing!\\\". The player can then choose to avoid or run away from those animals that choose to attack him in order to continue to receive the standard blessing.\r\n\r\nIf the player has killed no animals (in reality, up to 5 animals are allowed to be killed to cover cases of accidental killing), the player will receive a superior blessing (Kyne\\'s Peace/Voice of the Sky) for free.\r\n\r\nIf the player has slaughtered any bunnies (in reality, up to 5 bunnies are allowed to be killed to cover cases of accidental slaughter), he will be refused a blessing by Kynareth with the message \\\"You have slaughtered innocent bunnies and Kynereth rejects your offering!\\\"\r\n\r\nIf the player has killed more than 50 animals, the blessing is still granted, but with the message \\\"You have killed too many of Kynareth\\'s beloved animals - the balance of nature is in danger but Kynareth accepts a donation of 100 gold in penance!\\\" and 100 gold is removed from the player.\r\n\r\n\r\n-------------------------------------\r\n\r\n5) Shrine to Mara\r\n- renamed as \\\"Shrine of Mara, Goddess of Love\\\".\r\n\r\nAs a (former) handmaiden of Kynareth according to lore, she shares some of her aspects.\r\n\r\n50 gold is required as a donation. Standard message reads \\\"You have shown love and consideration to many, but keep your physical aggression under control - Mara grants her blessing!\\\"\r\n\r\nIf the player has made less than 5 assaults, the blessing will be granted for free, with the message \\\"You have shown love and consideration, harming others only in necessary self-defense - Mara grants her blessing for free!\\\"\r\n\r\nIf the player has committed any murders (1 murder is allowed, to account for accidental murder) then the offering will be refused, with the message \\\"Your acts of hateful murder have displeased Mara, and she rejects your offering!\\\"\r\n\r\nIf the player has killed more than 50 animals, or more than 5 bunnies, the offering will be refused, as the player is not showing love to his fellow creatures.\r\n\r\n\r\n-----------------------------------------------\r\n\r\n\r\n6) Shrine to Stendarr\r\n- renamed as \\\"Shrine of Stendarr, God of Justice & Mercy, and Scourge of the Daedra\\\".\r\n\r\nThis is based on known lore but also including a recognition and support of his Vigilants.\r\n\r\n50 gold is required as a donation. If the player has 50 gold he will receive Stendarr\\'s Blessing, with the message \\\"Stendarr accepts your offering! Rid the land of daedra, vampires and werewolves to please Stendarr - and if infected with vampirism or lycanthropy yourself, seek a cure within one week.\\\"\r\n\r\nStendarr may be merciful, but is also firm in his punishment of wrong-doers. Only those pure of soul will be granted the blessing. If you are turned into a vampire/werewolf, you have 7 days in which to cure yourself, or Stendarr will view you as having travelled too far down the path of evil.\r\n\r\nIf the player has killed more than 25 daedra, Stendarr will provide the blessing free of charge.\r\n\r\nIf the player has killed more than 50 daedra, Stendarr will provide a superior version of the blessing (fortify blocking by 15 points for 16 hours, rather than the usual fortify blocking by 10 points for 8 hours) free of charge.\r\n\r\nIf the player has completed any daedric quests, the player will receive the message \\\"You have consorted with daedra and Stendarr has rejected your offering! Kill more daedra to atone!\\\" - and the offering will be refused. There is a way around this:\r\n\r\nIf the player has completed any daedric quests, but has killed more than 50 daedra, the player will receive the message \\\"You have consorted with daedra but you have killed many more daedra - Stendarr accepts your offering!\\\" This is to allow those players who have been tricked or railroaded into daedric quests to continue to receive the blessing.\r\n\r\nIf the player has spent more than 7 days as a vampire or werewolf, the player will receive the message \\\"You have been corrupted by vampirism/lycanthropy; Stendarr has rejected your offering!\\\" - and will be refused a blessing by Stendarr as the player\\'s soul has been corrupted.\r\n\r\nIf the player has committed any murders, he will be refused a blessing by Stendarr as the player\\'s soul has been corrupted. \r\n\r\n\r\n-------------------------------\r\n\r\n\r\n7) Shrine to Zenithar\r\n- renamed as \\\"Shrine to Zenithar, God of Work and Commerce\\\"\r\n\r\nStandard donation of 50 gold required. The player receives the message \\\"Zenithar grants your blessing! He encourages trading and gives boons to those with greater skills in commerce.\\\"\r\n\r\nIf the player has made over 100 barters, the player receives the message \\\"Your activities in trading are encouraged by Zenithar - he grants a blessing for just 10 gold! Continue in your acts of commerce!\\\" - the cost is reduced to 10 gold.\r\n\r\nIf the player has made over 500 barters, the player receives the message \\\"Your skills in trade please Zenithar greatly - he grants a blessing for just 5 gold!\\\"- the cost is reduced to 5 gold.\r\n\r\nIf the player has the \\\"Merchant\\\" perk, the player receives the messaeg \\\"Your skills in trade please Zenithar greatly - he grants a blessing for free!\\\" - blessing is granted for free.\r\n\r\n\r\n-------------------------------------\r\n\r\n\r\n8) Shrine to Akatosh\r\n- renamed as \\\"Shrine of Akatosh, Dragon God of Time, First of All Gods\\\"\r\n\r\n50 gold required for standard donation. There are no conditions or requirements of service for Akatosh - I couldn\\'t find any that I was particularly comfortable with implementing, and in discussions on various forums there seemed to be conflicting views on exacly what Akatosh would require of his worshippers.\r\n\r\n\r\n--------------------------------------\r\n\r\n9) Shrine to Talos\r\n- renamed as \\\"Shrine to Talos, God of War & Governance, mortal-born & dragonborn Ysmir Hjalti Tiber Septim, Patron of Questing Heroes & Heir to the Seat of Sundered Kings\\\"\r\n\r\n50 gold required for standard donation. There are no conditions or requirements of service for Talos - I couldn\\'t find any that I was particularly comfortable with implementing, and in discussions on various forums there seemed to be conflicting views on exacly what Talos would require of his worshippers. Maybe make it dependant upon number of completed quests. \r\n\r\n\r\n\r\n\r\n----------------------------------------------------------------\r\n\r\n---\r\nThe 2 other files are older versions which don\\'t have the prerequisites/conditions.  They have loose files (which overwrite the bsa of the newer version) so please use a mod manager to install those older versions.\r\n\r\n---\r\n\r\n\r\nThis mod has been tested and seems to work fine, but the usual mod disclaimer applies - this mod hasn\\'t been tested thoroughly so please keep a back-up save before installing and don\\'t continue with your current character until you are sure this mod causes no issues.  If you find any issues please let me know.\r\n\r\n\r\n--------\r\n\r\n",
  "categoryId": "24",
  "version": "1.5",
  "author": "jackstarr",
  "createdUnix": "1343649779",
  "updatedUnix": "1366911465",
  "containsAdultContent": false,
  "uploadedBy": "jackstarr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77613",
      "name": "Shrine Donations - Gold Required if you have it",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "Shrine Donations-21349-0-1.zip",
      "uploadedUnix": "1343649817",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/1451c03f03e4c398ad6573e8f8689e530ad3206cbc7f92750c050228839d745b/analysis/1407057122/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shrine%20Donations-21349-0-1.zip?fid=77613&ttl=1535790182&ri=8192&rs=8192&setec=66548a9440a5ac63eb84de31e2838a7a"
    },
    {
      "fileId": "77656",
      "name": "Shrine Donations - Gold Required",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "Shrine Donations - Gold Required-21349-0-1.zip",
      "uploadedUnix": "1343662346",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/f819741250e381a738178f2e4c927549ed46427346adcdc545950b77a06b9416/analysis/1407057482/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shrine%20Donations%20-%20Gold%20Required-21349-0-1.zip?fid=77656&ttl=1535790182&ri=8192&rs=8192&setec=f75a3f389ce8745bc3961a8931cb2b5d"
    },
    {
      "fileId": "80015",
      "name": "Shrine Donations v0point5- Advanced Shrines test for Stendarr and Kynareth and Mara",
      "version": "0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9",
      "fileName": "Shrine Donations v0point5- Advanced Shrines test for Stendarr and Kynareth and Mara-21349-0-5.zip",
      "uploadedUnix": "1344512132",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/7db795101556a45927dd8bf3458d93ae18194a2174403549ae4353d9ec72d3d1/analysis/1407082385/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shrine%20Donations%20v0point5-%20Advanced%20Shrines%20test%20for%20Stendarr%20and%20Kynareth%20and%20Mara-21349-0-5.zip?fid=80015&ttl=1535790183&ri=8192&rs=8192&setec=dc258138c1e63295e7dc1f190a70a6ab"
    },
    {
      "fileId": "99271",
      "name": "Advanced Shrine Blessings",
      "version": "1.0.BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "Advanced Shrine Blessings-21349-1-0-BETA.zip",
      "uploadedUnix": "1352830859",
      "modVersion": "1.0.BETA",
      "virusScanUrl": "https://www.virustotal.com/file/e639048652b2d5ef3af5ee904e7d5944f13b689b108205e6a148f87e5a7184f8/analysis/1407261666/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Advanced%20Shrine%20Blessings-21349-1-0-BETA.zip?fid=99271&ttl=1535790183&ri=8192&rs=8192&setec=c13a097abf0c915af362081a6c7d4a64"
    },
    {
      "fileId": "99415",
      "name": "Advanced Shrine Blessings v1point1",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "14",
      "fileName": "Advanced Shrine Blessings-21349-1-1.zip",
      "uploadedUnix": "1352897195",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/bebc0e6dcc8ae33ef6d15508af659307f439072b7301cd32a5074688f625f2fc/analysis/1407262864/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Advanced%20Shrine%20Blessings-21349-1-1.zip?fid=99415&ttl=1535790184&ri=8192&rs=8192&setec=e1af9042c664f30992507fe123a488dd"
    },
    {
      "fileId": "1000026424",
      "name": "Advanced Shrines v1point5 - beta work in progress",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Advanced Shrines v1point5 - beta work in progress-21349-1-5.zip",
      "uploadedUnix": "1366911465",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/a7780f50b148e2dacb3017316677a2bcafead1f4e72168056f49e697c0d9d126/analysis/1407539344/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Advanced%20Shrines%20v1point5%20-%20beta%20work%20in%20progress-21349-1-5.zip?fid=1000026424&ttl=1535790184&ri=8192&rs=8192&setec=d3423a96098a3b007bd850bb684a82de"
    }
  ]
}