{
  "modId": 21368.0,
  "modName": "Anna the Sultry",
  "summary": "Anna the Sultry is a strong battle mage follower. Can be found in Bannered mare, Whiterun. Launches firebolts, uses disarm dragon shout, performs dual wield in melee combat.  ",
  "descriptionHtml": "DESCRIPTION:\r\nThis is my first mod, an NPC follower, mostly inspired by the Timek’s LaLuna and Psychos1s  and Brokefoot’s Temptress race mods.  Without them I probably would have never started “modding craft”.  Thanks a lot for the inspiration. Actually, this mod was based on LaLuna. \r\nINSTALLATION: \r\nPlace the .esp file and folders to your Skyrim/Data folder\r\n\r\nMod: Anna the Sultry v. 1.0\r\nMod type: NPC follower. Can be married. \r\nLocation: Whiterun, Bannered Mare \r\nAvailability level:  7 \r\nName:  Anna the Sultry\r\nRace: Nord\r\nSex: Female \r\nAbilities:  900 health, 800 magicka, 600 stamina\r\nSpells: firebolts (from both hands), healing hands and disarming shout\r\nTalents: 50% resist cold, 50% resist poison, 30% resist magic\r\nSpecialization: Combat sorcerer, mostly launches firebolts but also performs dual wield and disarm shout. \r\nInventory: Tavern wench clothes, two ebony war axes, 2000 gold, 7 black soul gems, 7 grand soul gems, 10 void salts, 3 daedra hearts, 3 human hearts. Spelltomes (x2): conjure storm atronach, detect undead,  dragonhide, fast healing, fire storm, fire rune, fireball, frost rune, healing hands, iron flesh, reanimate corpse,  repel undead, stoneflesh, transmute ore mineral, bane of the undead;\r\nscrolls (x2): Bane of the undead, blizzard. \r\n\r\nRequirements: Apachii SkyHair \r\nRecommended: CBBE v.3.1, UFO, Stripper dresses, TSSH Skimpy Stock Armors and Clothes v.1.7.x., Better females by Bella, No more blocky faces, Convenient horses, Catwalk fix, The eyes of beauty, Killer Keos Skimpy CBBE armor set, AP, ASX spells (just for fun). \r\n\r\nTrivia: \r\nThe name Anna is after the sexy Russian model Anna Semenovich which is famous for her enormously big breast thus I recommend to use CBBE mod (esp. Silly Huge type). Also I tried to make the NPC look like the real Anna Semenovich and spent several hours with NPC Editor building the necessary face shape. I didn’t use her full name in the game in order to avoid legal issues and copyright stuff;)   \r\nWatching her launch firebolts (instead of icy spikes or fireballs) at enemies is more spectacular, IMHO.  \r\n\r\nMAKING PROCESS:\r\n\r\nI’d like all modders to include this section to Description in order to share their experience of working with CK. This would be of great help for the beginners like me. I spent a couple of sleepless nights trying to make the mod work THE WAY I WANT. First of all I should say that working in CK is a pain in the neck, mostly because of the its bugs. As for NPC Editor, the mod created by it didn’t work at all but the BSA file generated by NPC editor  was very helpful for the textures.  \r\n\r\nSoftware used: Creation kit  1.6.89.0 (hereinafter CK),  NPC Editor 0.75.1, BSA browser (FOMM). \r\nFirst and most persistent problems making NPC with CK: problems saving .esp files. Problems working with editor ID in Object window. \r\n\r\nEncountered problems:  \r\n1)\tAfter the request “you could dress up  better” the NPC disappeared, leaving a naked headless mannequin. Solution: I placed two editor IDs to the location, saved, then deleted one. Worked.\r\n2)\tNPC didn’t use magic abilities (starting level was 5), though the NPC was a combat sorcerer and programmed to use Human Magic as combat style. Solution: starting level should be no lower than 7, otherwise the NPC doesn’t use magicka at all. \r\n3)\tDoesn’t use other spells (conjure flame atronach, healing, healing hands) along with firebolts, though magicka capacity is high (800). No solution yet.    \r\n\r\nTesting: This mod was tested against enemies at Fort Sungard and Fort Amol. Anna mainly launched firebolts, but in close combat she disarmed the enemies with dragon shout and performed dual wield with her two ebony war axes. Compatible with Convenient horses and UFO mods.  If you hit her several times she may turn hostile for a while. Some options from UFO mod can eliminate the hostility. \r\n\r\nThanks to:\r\nTimek 1337 for creating LaLuna and advice on using NPC Editor.\r\nPsychos1s  and Brokefoot for creating the most gorgeous creatures (Temptress race) in Tamriel.\r\nBethesda SoftWorks for this glorious game. \r\n\r\nPlease, feel free to report any bugs and share your suggestions. ",
  "categoryId": "33",
  "version": "1.0",
  "author": "Berserker2012",
  "createdUnix": "1343665902",
  "updatedUnix": "1343665985",
  "containsAdultContent": true,
  "uploadedBy": "Berserker2012",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77674",
      "name": "Anna the Sultry",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "577",
      "fileName": "Anna the Sultry-21368-1-0.zip",
      "uploadedUnix": "1343665985",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fc5069990f7a14b3fe03666f14ead88ed77dafbc42ac0b8b4b4b1b08ddcd3f51/analysis/1407057724/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Anna%20the%20Sultry-21368-1-0.zip?fid=77674&ttl=1535790222&ri=8192&rs=8192&setec=5ef307184e6e6fc2a07e057d1ae3d980"
    }
  ]
}