{
  "modId": 21367.0,
  "modName": "The McMiller Chronicles",
  "summary": "All characters are fully voiced. Running a few errands for the merchant Angus McMiller results in a quest of deceit, revenge and treasure. Enter the Winking Skeever in Solitude and talk to Angus McMiller to start the quest.",
  "descriptionHtml": "All characters are fully voiced. Running a few errands for the merchant Angus McMiller results in a quest of deceit, revenge and treasure. Shoplift from stores in Solitude, steal from a bandit chief and slay an ancient vampire lord.\r\n-----\r\n\r\nFEATURES:\r\n\r\n- All characters are fully voiced (4 characters).\r\n- Books to read.\r\n- 2 dungeons.\r\n- A large boss fight.\r\n- A vicious beast.\r\n- Treasure!\r\n\r\n\r\nTO START THE QUEST:\r\n\r\nEnter the Winking Skeever in Solitude and talk to Angus McMiller to start the quest.\r\n\r\n\r\nNOTE: This mod does NOT require the Dawnguard expansion.\r\n\r\n-----\r\n\r\nVOICES:\r\n\r\nMerte:\r\n  - Angus McMiller\r\n  - Grinnwirr\r\n  - Zamon\r\n  - Lubbs\r\n  - The Voice\r\n\r\nDeanCutty:\r\n  - Ulf the Night Watch\r\n\r\n\r\nSPECIAL THANKS TO:\r\n\r\nMadrar\r\n  - The writer of the story \\\"Blood and Rain\\\" featured in the mod (Grinnwirr\\'s book collection)\r\n\r\n-----------------------\r\n\r\nTROUBLESHOOTING:\r\n\r\nFirst of all: Make sure your Skyrim installation is up to date.\r\n\r\nQ: Angus is in the Winking Skeever, but he doesn\\'t talk to me.\r\nA: Save your game with the mod loaded (a quick save should be sufficient). Then quit the game to desktop. Then start the game again, and load up the save you just created. Hopefully, he should talk to you now.\r\n\r\nQ: The mod doesn\\'t install when I hit the Subscribe button.\r\nA: Some times Steam refuses to install mods. You can also get The McMiller Chronicles from Skyrim Nexus:\r\nhttp://skyrim.nexusmods.com/mods/21367\r\nYou can either install the mod with their manager for Skyrim, or manually. To install the mod manually, downlaod the zip archive containing the mod. Then extract the two files into your skyrim\\\\data folder. Make sure that The McMiller Chronicles is activated in the Data manager (click \\\"Data\\\" from Skyrim\\'s game launcher) before you start the game.\r\n\r\nQ: The game crashes when I enter a specific place.\r\nA: There may be a conflict with another mod. If another mod occupies the same world space as The McMiller Chronicles, the game may crash. Try deactivating other mods that add or change date in the world. If your savegame was created with other such mods activated, the problem may still persist after decativating them, because the data is still stored in the save file. Try an earlier save game or start a new game. You can also try to COC from the main menu into the location that crashes to see if the problem is solved after deactivating other mods.\r\nLocations that are created with the mod are:\r\nGrinnwirrs cave: COC mmcoldhermitcave\r\nGunnar\\'s Lair: COC mmcbanditcaveinterior\r\nArkenvagg: COC mmcdungeon1\r\n",
  "categoryId": "35",
  "version": "1.0",
  "author": "Merte",
  "createdUnix": "1343665608",
  "updatedUnix": "1343680936",
  "containsAdultContent": false,
  "uploadedBy": "merte",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77711",
      "name": "The McMiller Chronicles",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23208",
      "fileName": "The McMiller Chronicles-21367-1-0.rar",
      "uploadedUnix": "1343680936",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c0bd41056c671f4245708eb0e36339b4a1059c688f1a315b64335137e9423dee/analysis/1407058095/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20McMiller%20Chronicles-21367-1-0.rar?fid=77711&ttl=1535790220&ri=8192&rs=8192&setec=81311a37e042a77efb20cc3d2b924752"
    }
  ]
}