{
  "modId": 21372.0,
  "modName": "Horrible Hateful Horkers",
  "summary": "Make Horkers more satisfying to kill.",
  "descriptionHtml": "What this is:\r\n\r\nWhenever I\\'m in the wilds of Skyrim and I find myself facing Horkers, I just feel bad. They\\'re nowhere near strong enough to give me any trouble (as true at level 1 as at level 50), but they\\'re too slow to escape me as well. Rabbits and elk at least have their agility to escape the terrifying reckoning I bring upon nature, but Horkers are sitting ducks and they leave me feeling hollow after every encounter. So, rather than spend hours carefully developing leveled lists and balancing them for different player levels, styles of play, and number of followers, I decided to replace all of their audio files to make them sound like annoying children on Xbox Live. Now, whenever you encounter them you’ll bristle as they insult you and make disparaging comments about your sexuality (whether true or not, no one is judging. Besides the Horkers that is, but they’re pricks anyway).\r\nI would just like to say, I am so, so sorry for this mod’s existence. I’ll just show myself out, now.\r\n\r\n\r\n\r\nInstallation:\r\n\r\nCopy the “Sound” folder to your “Data” directory, merge the folder with anything you might already have in there. Place the esp into your Data directory as well. And finally, enjoy the jpg that inspired this stupid, stupid mod.\r\n\r\n\r\n\r\nCompatibility:\r\n\r\nUnless you have another mod that changes the sounds the Horkers make, this should be compatible with absolutely anything. And if you DO have such a mod, why are you even wasting your time with this one?\r\n",
  "categoryId": "61",
  "version": "1.0",
  "author": "The UCM",
  "createdUnix": "1343675335",
  "updatedUnix": "1343676352",
  "containsAdultContent": false,
  "uploadedBy": "UCM",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77698",
      "name": "Hateful Horkers",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2782",
      "fileName": "Hateful Horkers-21372-1-00.rar",
      "uploadedUnix": "1343676352",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/0a48bacb0a465c3ceb4542f133d9fcaebd6d0a788ba6a07bb1f049129d3e026a/analysis/1407057905/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hateful%20Horkers-21372-1-00.rar?fid=77698&ttl=1535790228&ri=8192&rs=8192&setec=cc93d61cf7a7a484c6f7f9a6a788be30"
    }
  ]
}