{
  "modId": 21394.0,
  "modName": "Linen Craft",
  "summary": "Makes linen craftable from clothing",
  "descriptionHtml": "As I downloaded more and more great clothing mods, i realized quite a few of them called for linen wraps.  Seeing as how they are only found in drauger ruins and are associated with mummification, i found this to be immersion breaking. I decided a simple plug-in was needed to turn clothing into linen.\r\n\r\nWhat this mod does:\r\n\r\n1) Renames linen wraps to linen rolls in order to disassociate them with mummification slightly.\r\n\r\n2) Decreases the weight of linen, so hopefully you don\\'t end up with material weighing more than the clothing destroyed.\r\n\r\n3) Decreases the value of linen so hopefully you can\\'t make money by scrapping clothing.\r\n\r\nAND MOST IMPORTANTLY\r\n\r\n4) Adds a bunch of crafting recipes to turn the vanilla clothing into linen rolls.  I have tried to make it fit the amount of material and value of the item.  With that said; destroying rare and valuable garments, like Jarl\\'s clothing, will not yield near the full value.  The true value of high class garments comes in their craftsmanship, you\\'re just destroying stuff for fabric!\r\n\r\nI have made it so the recipes are available at the tanning rack under misc, but for the sake of uncluttering your menu, they will only show up if you have the clothing in your inventory.  \r\n\r\nIf anyone has ideas or finds clothing i missed, let me know.\r\n\r\nA note about clothing from other mods:  I have no plans on making this work for clothing added by other mods. There are mods out there that add hundreds of pieces of clothing, i don\\'t have that kind of time.\r\n\r\nI highly recommend [url=http://skyrim.nexusmods.com/mods/2979] this great retexture [/url] to get your linen looking like my screenshots. \r\n\r\n",
  "categoryId": "60",
  "version": "1",
  "author": "dubstyles",
  "createdUnix": "1343705228",
  "updatedUnix": "1343705324",
  "containsAdultContent": false,
  "uploadedBy": "dubstyles",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77773",
      "name": "LinenCraft",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "LinenCraft-21394-1.rar",
      "uploadedUnix": "1343705324",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/77df810b95a97e5fbd98703b7b30a797393b142c81bc5043537e800440801af5/analysis/1407058923/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LinenCraft-21394-1.rar?fid=77773&ttl=1535790264&ri=8192&rs=8192&setec=0156a815e91dfb6b0aff9e06cf4b805c"
    }
  ]
}