{
  "modId": 21438.0,
  "modName": "Black Tower and Black Sacrament Armor pack - German translation",
  "summary": "Dies ist die deutsche Uebersetzung des mods \\\"Black Tower and Black Sacrament Armor pack\\\".\r\nSie fuegt neue Ruestungen, ein neues Playerhome und neue Npc\\'s hinzu.",
  "descriptionHtml": "\t                   Black Tower and Black Sacrament Armor Pack\r\n\r\nDiese Version ist nicht kompatibel mit der im Moment aktuellen Version der Mod ich werde versuchen sie die Tage zu aktualisieren.\r\n\r\nAutor: AmethystDeceiver\r\nÜbersetzer: Troublecat (Swiper)\r\nVersion: 3.2\t\r\nSprache: Deutsch\r\nBenötigt: Skyrim mit dem Aktuellem Patch\r\n\t     die EV der Mod ([url=http://skyrim.nexusmods.com/mods/5696]http://skyrim.nexusmods.com/mods/5696[/url])\r\n\r\n\r\n\r\nBitte beachtet das ich diese Mod nicht erstellt habe, ich habe sie ledeglich übersetzt.\r\n\r\nOriginal Mod: http://skyrim.nexusmods.com/mods/5696\r\n\r\nBitte Endorsed [url=http://skyrim.nexusmods.com/users/3196427]AmethystDeceiver[/url] für diese klasse Mod!\r\n\r\nBeschreibung\r\n=============\r\n\r\nBlack Tower and Black Sacrament Armor ist eine Erweiterung der Assassinen Gilde.\r\nDiese Mod fügt neue Rüstungen und einen Turm hinzu in dem es so einiges zu entdecken gibt.\r\nUnter anderem viele verschiedene nützliche Räume, eine Schmiede, Mannequins, etc etc...\r\n\r\n\r\nInstallation\r\n=============\r\n\r\nManuelle Installation:\r\n----------------------\r\n- Downloadet die Englische Hauptmod vom Skyrim Nexus (http://skyrim.nexusmods.com/mods/5696). Wählt entweder die HD oder die SD Version.\r\n- NICHT DIE NMM VERSION\r\n- Entpackt die 7-zip Datei in einen separaten Ordner\r\n- Kopiert ALLE Dateien in den Skyrim/Data Ordner Außer den Options Ordner, bei der Frage ob etwas überschrieben werden soll, ja drücken.\r\n- [OPTIONAL] Wenn sie einen female Body Type installieren wollen, öffnen sie den Options Ordner, dann den fembody Ordner und dann den Ordner\r\nwelcher zu dem Body Type passt, den sie installieren wollen (CBBEcury, CBBEslim oder UNP) Wählen sie nur eine\r\n- kopieren sie aus diesem Ordner den Meshes Ordner in ihr Skyrim/Data verzeichnis, falls aufgefordert Dateien zu überschreiben klicken sie ja. \r\n-Downloadet die deutsche Übersetzung\r\nEntpackt alle im Installationsordner der deutschen Version enthaltenen .Esp\\'s und Esm\\'s in euren Skyrim/Data Ordner, außer die im Optionalen Ordner, bei der Frage ob etwas überschrieben werden soll, ja drücken.\r\n- [OPTIONAL] Entscheiden sie sich ob sie die Rüstung der Dunklen Bruderschaft im Spiel ersetzen wollen.\r\n- Wenn sie die Rüstung ersetzen wollen öffnen sie den Ordner Optional und entscheiden sie sich für einen Farbstil.\r\n- Kopiert die BlackSacramentDBReplacer.esp in euren Skyrim/Data Ordner\r\n\r\nCredits:\r\n=========\r\nthe original author AmethystDeceiver\r\nAll the beta testers for their input during the v3 beta.\r\nAlso to Newermind43 and Apachii for allowing me to use their hair meshes for NPCs in this mod. Please feel free to install their hair mods if you haven\\'t already, and don\\'t forget to endorse their files:\r\nCoolsims hair\r\nApachii Skyhair\r\nEriko for translating to Russian.\r\nSluckyD and GlitchFinder for pointing me in the right direction for locating the causes of the mannequin glitches.\r\nDak181 for providing me with a save game so i could finally work with the duping mannequins properly.\r\n",
  "categoryId": "36",
  "version": "3.2",
  "author": "Troublecat",
  "createdUnix": "1343778102",
  "updatedUnix": "1343778420",
  "containsAdultContent": false,
  "uploadedBy": "Troublecat",
  "primaryFile": null,
  "files": [
    {
      "fileId": "77966",
      "name": "Black Tower and Black Sacrament Armor pack - German translation EV needed",
      "version": "3.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "90",
      "fileName": "Black Tower and Black Sacrament Armor pack - German translation EV needed-21438-3-2.7z",
      "uploadedUnix": "1343778420",
      "modVersion": "3.2",
      "virusScanUrl": "https://www.virustotal.com/file/18d30e6bcccd73c75af0925521855c61593ff1a09ad4e819c93cdcc00bb6b68c/analysis/1407060931/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Tower%20and%20Black%20Sacrament%20Armor%20pack%20-%20German%20translation%20EV%20needed-21438-3-2.7z?fid=77966&ttl=1535790330&ri=8192&rs=8192&setec=db21d0b289cd14ce5d65dd8c6adefc86"
    }
  ]
}