{
  "modId": 21443.0,
  "modName": "Requiem of Light and Dark- Chaos Spells for Skyrim",
  "summary": "Adds offensive spells of the light and dark elemental types.",
  "descriptionHtml": "JANUARY 2013 UPDATE..............................................................................\r<br />Hey all this mods not dead but some things came up that really impacted my modding time.\r<br />Regardless I have just released RoLD as an UNLIMITED file in the Optional files. The big difference here is that there are no Requirements to craft save ingredients. No Perks. No azuras star alignment. Nothing. This is mostly for the SkyRE users who have perks changed and I dont want to isolate anyone, however I had gotten the request before. The Augmented Light and dark perks are still there if you want to add them via console commands though. Looking forward to future updates.\r<br />\r<br />------------------------------VERSION 2.0  Details at the bottom&#33;------------------------------\r<br />HEADS UP&#33; VERSION 2.1 HAS 2...VERSIONS. ONE IS THE ORIGINAL FILE AND THE ONE I WILL CONTINUE TO BUILD ON, BUT HAS DAWNGUARD AS A REQUIRED PARENT FILE, THE OPTIONAL FILE OF 2.1, I REMADE WITHOUT DAWNGUARD INSTALLED IN THE CREATION KIT AND SHOULD WORK FINE FOR THOSE WHO DON&#39;T HAVE DAWNGUARD YET. IF YOU HAVE DAWNGUARD I WOULD SUGGEST USING THE FIRST ONE.\r<br />\r<br />Story:\r<br />Long story short I wanted to make a set of spells for my &#34;Holy warrior&#34; type character that utilized the school of restoration ( and also to help with the leveling of the school thereof) but my computer would freak out when using massive spell packages like Midas Magic and Phenderix Magic Evolved. Then they announced Dawnguard and made vampires look like something I&#39;d try to play. Then I said, well lets make some dark conjuration based spells for my new would be character. So here&#39;s what I came up with... \r<br />\r<br />This is my first uploaded mod but I have been tinkering with the creation kit for a while now so... yeah. Also ALL the effects and spell types come from in game effects as I lack any experience with modeling for games and stuff like that, but yall don&#39;t really care about that so onto the spells&#33;\r<br />\r<br />\r<br />BUT FIRST: These spells will be craftable upon the completion of the Azuras Star quest. Depending on which path you take. get the Azuras Star and you will be able to craft LIGHT spells, get the Dark Star and you will get Dark Magicks. Then you will only gain access to the first spell of each type unlocking more as you level up skills in thier respective schools. You can make the book at forges everywhere&#33;\r<br />\r<br />IF ANY OF YALL HAVE ANY IDEAS ON HOW I CAN IMPROVE THESE SPELLS OR YOU HAVE IDEAS OF NEW SPELLS OR EFFECTS, LET ME KNOW&#33;&#33;&#33;  I&#39;ll see what I can do... :)\r<br />\r<br />**All Spells were scaled to be similar to their counterparts values given in the creation kit so they should be relatively balanced**\r<br />****All spells that can be dual cast will become larger in area affected as well as in magnitude****\r<br />\r<br />SPELLS\r<br />For the school of RESTORATION the spells in the order you will likely receive them\r<br />1. Prism Beam- a basic light beam that drains health and magicka and will bounce to nearby enemies.\r<br />2. Righteous Bolt- A bolt of light that deals fire and shock damage (Requires Restoration Apprentice)\r<br />3. Pulse Wave- A wave of energy that can disarm foes (requires Restoration Adept)\r<br />4. Light Missile- a ball of light that will explode on contact as well as illuminate foes caught in the blast. (requires Augmented Light 60)\r<br />5. Elemental Rend- a crackling bolt of green lightning that deals damage/effects of all the elements. (requires Restoration Expert)\r<br />6. Spark of Luminos- a beam of pure energy that does massive damage over time. (requires Restoration Master)\r<br />7. Call Ply- Summon a fairy who will suppliment your restoration skills as well as increase your regeneration....ALOT. But only for a short time. (Requires Augmented Light 85)\r<br />&#34;&#34;&#34;&#34;&#34;&#34;&#34;&#34;&#34;&#34;&#34;NEW&#34;&#34;&#34;&#34;&#34;&#34;&#34;&#34;&#34;&#34;&#34;\r<br />8.Lightbomb-A focused explosion of bright light whcih blinds and confuses enemies causing them to attack each other.(will do massive damage to undead and vampires once the bugs get ironed out.)(requires Augmented Light)\r<br />\r<br />DARK SPELLS\r<br />1. Red Bolt-A spell with no windup but higher magicka cost that deals damage and drains health\r<br />2. Corruption- cause an explosion of dark energy that does damage and will corrupt those in its blast and cause them to fight each other. Those killed shortly thereafter will lose their souls to you. (requires augmented dark)\r<br />3. Dark Pressure- A Power that releases a massive explosion of dark energy doing huge damage to health and even more to magicka. (requires Conjuration Adept)\r<br />4. Obliterate- a bolt that will do high damage and has a chance to instantly kill. (requires Conjuration Expert)\r<br />5. Dark Cannon- A beam of energy that drains health very quickly. (requires Conjuration Expert)\r<br />6. Darksol Gasp- A Power that expels pure evil from your body dealing massive damage and corrupting those in the area. (requires Conjuration Master)\r<br />7. Shadow form- Massivly increases Destruction power and Magicka Regeneration for a short time by releasing the evil inside you. (requires Augmented Dark 85)\r<br />&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;NEW&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;&#39;\r<br />8. Entropic Distortion- Causes an anomaly with reality doing damage as well as causing random effects over a wide area. (requires Augmented Dark 60)\r<br />\r<br />Thats it for now. I plan to add more later as well as augment the effects of some of the existing spells up there.\r<br />\r<br />I use the magic mod: Better Magic which can be found here \r<br />http://skyrim.nexusmods.com/mods/4374\r<br />\r<br />\r<br />.....BUGS.....\r<br />1. Luminos Spark seems to cause a &#34;white out&#34; effect for some people.   This is caused through usage with the immaginator mod. Part of what it does is it augments the bloom given off by magic effects in game. This spell which continually explodes causes that bloom to multiply it seems. Since I only work with stock effects, I really have no way of changing this right now. Sorry.\r<br />2. obliterate&#39;s higher insta kill rate than mehrunes razor effect does not appear to be working properly, if at all...\r<br />............................................Update Log........................................\r<br />1. Fixed Red bolt from conjuration to destruction and darksol gasp&#39;s tome should teach darksol gasp.\r<br />-----------------VERSION 2.0-----------------------------\r<br />1. All Dark spells are now hooked up right and proper to Conjuration&#33;(This was always They&#39;re intended skill usage)\r<br />2. Fixed the scaling problem with perks. There is now an augmented dark and Augmented Light Perks Added to perk trees&#33;(If this conflicts with other perk mods let me know please&#33;&#33;&#33;&#33; I do not use any mods that affect perk trees)\r<br />3. Visually fixed the effects of shadow form, obliterate, and dark pressure. They should work now as intended.\r<br />4. Light Ray has been changed to prism beam and been given a Chaining effect.( At first this was causing some CTD for me but after some tweaking has been working fine. PLEASE let me know if you get this problem&#33;)\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />HEY GUYS&#33; IF your looking to better your Werewolves check out my other mod Requiem of the moon&#33; Look here: http://skyrim.nexusmods.com/mods/24485/",
  "categoryId": "75",
  "version": "2.2",
  "author": "darkforte186",
  "createdUnix": "1343788593",
  "updatedUnix": "1359302415",
  "containsAdultContent": false,
  "uploadedBy": "darkforte186",
  "primaryFile": null,
  "files": [
    {
      "fileId": "78198",
      "name": "Requiem of Light and Dark Dawnguard free version 1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "Requiem of Light and Dark base version Update 1-21443-1-1.zip",
      "uploadedUnix": "1343877856",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c8b5765007e3f644e830cac6f881e66f7b1ee88231984ea638e11c2ed0ec19f6/analysis/1407063187/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20of%20Light%20and%20Dark%20base%20version%20Update%201-21443-1-1.zip?fid=78198&ttl=1535790335&ri=8192&rs=8192&setec=e48f76b5591cd6a823a517cdf3c199dc"
    },
    {
      "fileId": "82633",
      "name": "Requiem of Light and Dark version 2",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "Requiem of Light and Dark version 2-21443-.zip",
      "uploadedUnix": "1345344925",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5d849d269a5ff3a34f19b9229e5796d4a8bc2058d77dca9eb5c83d0902a520a5/analysis/1407106699/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20of%20Light%20and%20Dark%20version%202-21443-.zip?fid=82633&ttl=1535790335&ri=8192&rs=8192&setec=e43075460e497a443a7f2a7b7089822e"
    },
    {
      "fileId": "84209",
      "name": "Requiem of Light and Dark version 2_1",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "Requiem of Light and Dark version 2_1-21443-2-1.zip",
      "uploadedUnix": "1345926780",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/6f74e6ca969c5867143eb82bd5b0112cc709579f4bd1d6a4d8036b8ec98d2d79/analysis/1407121444/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20of%20Light%20and%20Dark%20version%202_1-21443-2-1.zip?fid=84209&ttl=1535790336&ri=8192&rs=8192&setec=733f2f73a131e880889a36d2e25e852e"
    },
    {
      "fileId": "87190",
      "name": "Requiem of Light and Dark Dawnguard free Version 2_1 update",
      "version": "2.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "10",
      "fileName": "Requiem of Light and Dark Dawnguard free Version 2_1 update-21443-2-1.zip",
      "uploadedUnix": "1347120055",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/bc35594059c3bdd37162f5718d724a8943591ba7c97ce1850091e2ec400e951c/analysis/1407153362/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20of%20Light%20and%20Dark%20Dawnguard%20free%20Version%202_1%20update-21443-2-1.zip?fid=87190&ttl=1535790336&ri=8192&rs=8192&setec=14ea3d07583a8c47e8508ef87385d7b2"
    },
    {
      "fileId": "88634",
      "name": "Requiem of Light and Dark version 2_2-1",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Requiem of Light and Dark version 2_2-1-21443-2-2.zip",
      "uploadedUnix": "1347725034",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/e333078588c877595735517a36c2c5405e08726d58a92aa4fa3db7b9ee284ef2/analysis/1407167477/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20of%20Light%20and%20Dark%20version%202_2-1-21443-2-2.zip?fid=88634&ttl=1535790337&ri=8192&rs=8192&setec=f2ecbca6017acd1c90a5d3fac6552ecb"
    },
    {
      "fileId": "1000005249",
      "name": "Requiem of Light and Dark UNLIMITED 2_1",
      "version": "2.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "14",
      "fileName": "Requiem of Light and Dark UNLIMITED 2_1-21443-2-1.zip",
      "uploadedUnix": "1359302415",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/288db3b03b17323ed1ce571a476cdd26a8f042d1a2e3c3271d5542e171bbc2bd/analysis/1407381904/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20of%20Light%20and%20Dark%20UNLIMITED%202_1-21443-2-1.zip?fid=1000005249&ttl=1535790337&ri=8192&rs=8192&setec=88a6fa54e9a031b162d1b05b2860c908"
    }
  ]
}