{
  "modId": 21450.0,
  "modName": "A Conspiracy of Faith- Little Shrines to Talos",
  "summary": "Adds many (functional) little shrines to Talos in many Nord homes and other indoor locations. Some are well hidden...",
  "descriptionHtml": "(Scroll down to skip the boring story/exposition. Mild Spoilers. :P)\r\n\r\n[i]\\\"We didn\\'t pay much attention to it when I was a boy - Everyone still had their little shrine to Talos...\\\" -Alvor of Riverwood[/i]\r\n\r\n \\\"But doesn\\'t she know how dangerous this is?\\\" Lisette spoke as she dismounted. \\\"And I don\\'t mean to us. For someone in her position to do this...\\\"\r\n \\\"That\\'s why she gave the task to someone she could trust.\\\" Jordis tied her horse to a tree as the others did the same. \\\"Jarl Elisif may not always think things through, but she\\'s still very young, and she\\'s learning. Falk and Sybelle will make sure of that.\\\"\r\n Aela stretched her legs a bit before following up the path. \\\"She rules from the heart, and she thinks of her people. There are many jarls who would do well to follow her example.\\\"\r\n Iona waved a hand dismissively as Mjoll snickered. \\\"True, it may be foolish, but she has her reasons.\\\"\r\n Lisette shook her head, frowning. Illia \\'s eyes traveled up the rocky path to their destination. \\\"It\\'s a matter of faith. And faith is a powerful thing.\\\"\r\n Aranea nodded solemnly. \\\"In my homeland, the Ashlanders waited for centuries for the coming of the Nerevarine.\\\"\r\n \\\"And you waited for more than a century for the Champion of the Star.\\\" Lydia nodded to the Dunmer priestess. \\\"Faith can be a source of great strength. It\\'s when you try to force your faith on others that it becomes twisted and... unclean.\\\"\r\n \\\"Like the Thalmor.\\\" Lydia turned and nodded to the bard. \\\"Exactly, Lys. Mundus is a big enough place for differing ideas and beliefs.\\\"\r\n \\\"So long as the followers do no harm. The Forsworn have given up their right to acceptance, if you ask me.\\\" Mjoll glowered and set her jaw. \\\"But any idea can be taken too far, I suppose.\\\"\r\n \\\"We\\'re here.\\\" The group stopped as they reached their destination. Their leader walked forward with head bowed, as Lydia, Jordis, Iona, Mjoll, and Aela knelt, leaning on their weapons. Behind them, Lysette, Illia, and Aranea bowed their heads respectfully.\r\n Reverently, the Dragonborn placed Torygg\\'s war horn on the shrine, and then looked at the statue\\'s solemn face.\r\n \\\"They may take Talos away from the Nords, but they\\'ll never take the Nords away from Talos.\\\"\r\n\r\nWHAT DOES THE MOD DO:\r\n-Adds many little shrines to Talos in several homes, mostly of Nords, and a few other places. I tried to place them logically, and some are well hidden. They\\'re functional, too, so you can cure your Rockjoint if some wolf bites you on your way to Riverwood from Helgen...\r\n-Changes the \\'Activate\\' message to \\'Use\\'. Seriously. Are we Dwemer automatons or something? ?_?\r\n\r\nMany Thanks to... \r\n-Bethesda for the Elder Scrolls series.\r\n-The Modding Community, for continuing to make a great game ever greater.\r\n-Ma and Da, who I wish I could thank enough.",
  "categoryId": "85",
  "version": "1.0",
  "author": "TwilightStar",
  "createdUnix": "1343797618",
  "updatedUnix": "1343798378",
  "containsAdultContent": false,
  "uploadedBy": "TwilightStar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "78003",
      "name": "LittleShrines",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "LittleShrines-21450-1-0.rar",
      "uploadedUnix": "1343798378",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2897a65818255627797e11488d585cf5744cb1c8631ff21e536b71aac1845548/analysis/1407061325/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LittleShrines-21450-1-0.rar?fid=78003&ttl=1535790346&ri=8192&rs=8192&setec=7d20f5789153efabedaed4772403fd5e"
    }
  ]
}