{
  "modId": 21473.0,
  "modName": "Profitable Hunting",
  "summary": "Makes hunting a more lucrative activity by increasing the value of meats, hides, claws, etc.",
  "descriptionHtml": "My second mod! What this does is bump up the values of pelts and meat and other items you pick up from hunting. The price of food has been increased 600% (e.g. raw venison, originally worth 4 septims, is now worth 24) and the value of animal pelts has also been increased dramatically (e.g. some bear pelts are now worth 120 septims). \r\n\r\nOther notable price increases includes that of horker tusks (now worth 150 septims) and mammoth tusks (450 septims), as well as severe markups in hagraven feathers and claws (each worth 300 septims apiece) to reflect (a) the difficulty inherent in acquiring hagraven feathers and claws and (b) to give you extra incentive to hunt down and kill the vile creatures. \r\n\r\nI did not, however, change the value of leather much (I might change this in a future update), so when you return to Whiterun with an inventory full of pelts, you have to decide whether you more want the coin from selling the pelts as they are or the lesser-priced leather you can turn the pelts into for future smithing adventures. \r\n\r\nAs an added bonus, I increased the stats of the reviled Hunting Bow to give it the same weight and base damage as an Elven bow :D Please comment and endorse if you like this, and tell me if you want something changed! Also, check out my other (first) mod which dramatically tweaks the stats for Imperial weapons and armor, as well as Skyforge Weapons and adds in Daedric-damage level \\\"Imperial Arrows\\\" Yay! http://skyrim.nexusmods.com/mods/21382/",
  "categoryId": "79",
  "version": "1.0",
  "author": "Invctus",
  "createdUnix": "1343840269",
  "updatedUnix": "1343840424",
  "containsAdultContent": false,
  "uploadedBy": "Invctus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "78088",
      "name": "Hunting for Fun and Profit",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Profitable Hunting-21473-1-0.zip",
      "uploadedUnix": "1343840424",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/182c214ffad80331a95d8bc857d8e4dc2d8f993844d3707a2e049569c195e212/analysis/1407062223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Profitable%20Hunting-21473-1-0.zip?fid=78088&ttl=1535790385&ri=8192&rs=8192&setec=bc74b1ac667d802f49041637a2846c1e"
    }
  ]
}