{
  "modId": 21488.0,
  "modName": "Ultimate NPC Face Unlocker",
  "summary": "Adds over 700 NPC faces to the list of presets during character creation. Every named NPC in the game excluding Elder and Child races.",
  "descriptionHtml": "Ultimate NPC Face Unlocker\r\n==========================\r\n\r\nThis mod adds over 700 NPCs to the list of presets in the character creation screen. Every single named NPC for every playable race is included, along with a few that don\\'t have proper names.\r\n\r\n\r\nFAQs\r\n====\r\nThis mod includes:\r\n- 240 male Nords, and 107 female Nords\r\n- 50 male Imperials, and 31 female Imperials\r\n- 52 male Bretons, and 27 female Bretons\r\n- 20 male Redguards and 17 female Redguards\r\n- 29 male Orcs and 23 female Orcs\r\n- 34 male Dark Elves and 20 female Dark Elves\r\n- 22 male High Elves and 10 female High Elves\r\n- 16 male Wood Elves and 7 female Wood Elves\r\n- 15 male Khajiit and 9 female Khajiit\r\n- 14 male Argonians and 6 female Argonians\r\n- a few notable un-named NPCs, like the Imperial Captain from the execution scene, the Old Orc, and Boethiah\\'s Champion\r\n- named ghosts, but they will not have the ghost shader and appear as normal NPCs\r\n- 4 named vampires, converted to their parent race (eg. BretonVampire converted to Breton race)\r\n\r\nThis mod does not include:\r\n- any characters from the Elder race (eg. Greybeards); those will be released in a separate mod\r\n- children (no plans to release)\r\n- NPCs that are already dead when you encounter them, like the countless hapless adventurers strewn about dungeons\r\n- generic NPCs like guards, bandits or conjurers\r\n- unique clothing or items belonging to NPCs; this mod gives you the appearance of the NPC only\r\n- any changes to the original characters, quests, etc.; you are duplicating their appearance only, not taking over their life\r\n\r\n\r\nOrganization\r\n============\r\nAll of the NPCs are organized alphabetically by proper name. General Tullius, for example, is under Tullius, so look for him toward the end of the list. The vampires appear at the very end of the sliders because I didn\\'t think to include them until the others were already complete. If I add any more NPCs in future updates they will be added to the end of the list as well.\r\n\r\nInstall\r\n=======\r\nDrop the UNFU.esp into your Data folder and make sure it\\'s activated in the launcher.\r\n\r\nUninstall\r\n=========\r\nRemove the UNFU.esp from your Data folder. Your appearance is stored in your game save and won\\'t be affected.\r\n\r\n*Note that certain unique objects, like Karliah\\'s eye color and Nocturnal\\'s skin color may become unavailable if you try to edit your character\\'s appearance using showracemenu without this mod loaded.\r\n\r\n\r\nConflicts\r\n=========\r\nThis mod changes all 10 playable races and will therefore conflict with any other mod that changes any of these races. Because your character\\'s appearance is stored in the game save, however, it is possible to load this mod, create your character, save your game, and then uncheck this mod and remove it from your load order and still retain your character\\'s appearance. This is a use once then forget about it mod. You only need to re-activate it when you feel like creating a new character.\r\n\r\n\r\nCredits\r\n=======\r\nnecKros for the skin textures used in the screenshots\r\nBethesda\r\n\r\n\r\nA Note About the Ultimate NPC Face Unlocker\r\n===========================================\r\nThere are a lot of faces included in this mod, and the vast majority of them you will never want to use. You may wonder, then, why I bothered to include some of the characters. After handling over a hundred requests for sliders from console users on my web site, I have learned that you really can\\'t predict what other people want. YOU may never use most of these characters, but SOMEBODY, somewhere will. Including all of the characters saves me from having to make frequent updates and one-off mods to handle special requests.\r\n\r\n\r\nLinks\r\n=====\r\nFor dozens of unique characters, followers, and other mods visit my website: http://www.truancyfactory.com/index.html\r\nFor Skyrim-related tutorials and articles, you can also visit me on hubpages: http://j-u-i-c-e.hubpages.com/",
  "categoryId": "26",
  "version": "1.0",
  "author": "TheMagician",
  "createdUnix": "1343855330",
  "updatedUnix": "1343855401",
  "containsAdultContent": false,
  "uploadedBy": "TheMagician",
  "primaryFile": null,
  "files": [
    {
      "fileId": "78124",
      "name": "UltimateNPCFaceUnlocker",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "420",
      "fileName": "UltimateNPCFaceUnlocker-21488-1-0.rar",
      "uploadedUnix": "1343855401",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ab37df93c7dcc6461ad63fe183c24a92ca33a3ecc2ac4815ad082afefaa72acb/analysis/1407062525/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UltimateNPCFaceUnlocker-21488-1-0.rar?fid=78124&ttl=1535790398&ri=8192&rs=8192&setec=c756352e03920ba1c25c2c3a58c194c5"
    }
  ]
}