{
  "modId": 21490.0,
  "modName": "Skyrim Roleplay Overhaul",
  "summary": "",
  "descriptionHtml": "Skyrim Roleplay Overhaul \r\n\r\nThis mod is my attempt to make Skyrim more roleplay friendly by tweaking certain gameplay elements and creating minor additions. \r\n\r\nThis initial version contains: \r\n- No godlike Guildmasters \r\n-- This means your character can no longer join and master every guild. You can join just one of the four main guilds - Mage College, Thieves, Dark Brotherhood, or Companions. \r\n-----\r\nI\\'m also releasing a second untested version. This one adds another limit by only allowing your character to become Thane of ONE city. No longer can you blithely own a half dozen houses and get out crime for nothing in every hold. \r\n\r\nFor those that are willing to download this version and test it I would be supremely grateful, as you first have to become Thane of a city then work your way to trying to become Thane of all the other cities one by one....that would drive me mad and take forever alone. If you do do this make sure to keep saves just before asking any jarl for Thanedom, that way if there is a problem, my update will take minutes to test instead of hours. \r\n\r\n=======================\r\nDESCRIPTION UPDATE FOR CLARIFICATION - 06/08/2012\r\n=======================\r\n\r\nOk so I feel I should clarify some points. I absolutly never intended to simply bash the player over the head if they chose warrior and they forget all magic:P Essentially I want a hybrid of Oblivion\\'s system where the player makes up a class at the beginning to their preference. If they want to do a battlemage then by all means. But your sneak skills and pickpocketing will be limited to 25. (as an example). So the player will have still have complete control over their character class.... I will be tweaking how this works to balance and keep true to my ideas. I realize this is a complicated thing to try and mod, so your suggestions are helping. \r\n\r\nNext point - The Guilds - The vanilla game allows you to become master of every guild. My mod changes that. I do not agree with the freedom to join multiple guilds. Thus my mod will reflect that. I\\'m sorry but if you don\\'t like it....play vanilla. HOWEVER - I do want to make this not just for myself but for as many other ppl as possible cause I\\'m cool like that. So continue to offer suggestions and I may adopt some I like. Though you most certainly won\\'t be able to master more than one guild...I draw the line at that. \r\n\r\nNext point - Specilized Merchants - I love the idea of custom enchantments on items that someone suggested. I will certainly try to implement that. If you guys can think of any other similar ideas let me know. \r\n\r\nNext point - Thanedoms - There has been a lot of discussion about the thanes, and that\\'s great. So keeping that in mind, a few changes - I still kinda want to limit to one thandom, however if so there will be an option to renounce your thanedom and sell your house so you can move on to another city. \r\n\r\nPlease continue to offer suggestions and I will certainly listen. I\\'m currently away from my work computer but I will be getting back to this sometime this week. \r\n\r\n=====================\r\n\r\nFuture - \r\n-- Skill limits -- By using an in game menu option after/during the char creation screen you can set what type of char you want to play. For example if you want to play a sneaky thief mage skills will either be turned off or limited so you can\\'t put any perks into them. I plan to make it so your thief won\\'t be able to cast spells at all. With similar changes for other class options. \r\n-- Additional Specilized merchants -- Creation of special merchants such as Alchemists that will take orders for say 10 healing potions, you come back 12 hours later and they are ready for you.  Or some hunters that roam but will also buy furs and pelts from you. This is both to create a source of income for those that want to make a living, and provide services for those that have no toher way to get certain items. I.E. A warrior will not be able to brew potions, but will be able to buy specific potions in exchange for loot/gold/services rendered etc. ",
  "categoryId": "79",
  "version": "1.0",
  "author": "Gutbusters",
  "createdUnix": "1343862032",
  "updatedUnix": "1343862183",
  "containsAdultContent": false,
  "uploadedBy": "Gutbusters",
  "primaryFile": null,
  "files": [
    {
      "fileId": "78138",
      "name": "Skyrim Roleplay Overhaul",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Skyrim Roleplay Overhaul-21490-1-0.zip",
      "uploadedUnix": "1343862107",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b113d7f4689770d2e9c91f3ca0a25104bceeda10f74a72dda77e63b4dfea2acc/analysis/1407062644/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Roleplay%20Overhaul-21490-1-0.zip?fid=78138&ttl=1535790400&ri=8192&rs=8192&setec=25ca1e7981563955b07adba3948f2d67"
    },
    {
      "fileId": "78139",
      "name": "Skyrim Roleplay Overhaul - WIP",
      "version": "0.9",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "10",
      "fileName": "Skyrim Roleplay Overhaul - WIP-21490-0-9.zip",
      "uploadedUnix": "1343862183",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/95c8636c868befc4d242eafee4ae117dd394a591f390cdd4eaed3215c72a7b5d/analysis/1407062645/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Roleplay%20Overhaul%20-%20WIP-21490-0-9.zip?fid=78139&ttl=1535790401&ri=8192&rs=8192&setec=5b77c759755cb2695439b088b8618b9f"
    }
  ]
}