{
  "modId": 21517.0,
  "modName": "Levelers Tower Remod",
  "summary": "Remod of Levelers Tower v25-1\r\n62 Mannequins\r\n120 chest\r\n54 dagger display cases\r\n40 big display case\r\n54 big weapon plaques\r\n36 shield plaques\r\n40 shield and weapon plaques",
  "descriptionHtml": "THIS IS NOT MY MOD as you can see it is by WillieSea Levelers Tower v25 he made it all I done is fix his mod more for me if you use this mod you have all files needed just add them as you would any mod, so that being said here is what I did. I made it more of a home with all the perks of his mod and named some of the rooms more for me and the lighting and added another welcome book in the library telling more of what I did. This is WillieSea link to the original Levelers Tower.\r\nhttp://skyrim.nexusmods.com/mods/14152\r\n\r\n\r\nThis mod should now have enough display, chest and book shelf for all your needs\r\n\r\n62 Mannequins\r\n120 chest\r\n54 dagger display cases\r\n40 big display case\r\n54 big weapon plaques\r\n36 shield plaques\r\n40 shield and weapon plaques\r\n\r\nYou have the main tower where you come in at was not touched. \r\n\r\nThe Crafting room only thing mostly was Few Mannequin,lighting at the crafting stations, and a bunch of chest.\r\n\r\nThe Arena wasnt touched much other then lights and removed weapon rack added 2 statues. \r\n\r\nThe display room I added Mannequin so you can display all armor in game and put in ALOT more weapon racks, display cases, statues.\r\n\r\nThe sitting room was replaced with a Basement with special stuff in this room, also there is a key to the left of the door on the table at the night mothers feet for different stuff so look for it you are going to need it for things in this mod. \r\n\r\nThe garden add few more chickens, nest, etc statues and the part that was off of that room that was removed. \r\n\r\nSome of the living area and minning area was put together and there was alot done to it to much to put here so just take a look you find it interesting I think.\r\n\r\nThe Library and temple was put together to a point you have the doom stones also when you first walk in the door then first floor you have all the shrines 2nd floor book shelfs, desk with some stuff on it you may like and lower level some good books to look at lol. \r\n\r\nLevelers Tower Remod v25-1 \r\nThis is just few more plaques, mannequins and few fixes",
  "categoryId": "67",
  "version": "v25.1",
  "author": "WillieSea and BikerSteve",
  "createdUnix": "1343891313",
  "updatedUnix": "1345396142",
  "containsAdultContent": false,
  "uploadedBy": "bikersteve",
  "primaryFile": null,
  "files": [
    {
      "fileId": "82774",
      "name": "Levers Tower Remoded v25-1",
      "version": "v25.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "92469",
      "fileName": "Levers Tower Remoded v25-1-21517-v25-1.7z",
      "uploadedUnix": "1345396142",
      "modVersion": "v25.1",
      "virusScanUrl": "https://www.virustotal.com/file/9b7ff4905b95f200de371aef366908d168a66847de54171bbab0a5935e521a0b/analysis/1407107912/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Levers%20Tower%20Remoded%20v25-1-21517-v25-1.7z?fid=82774&ttl=1535790456&ri=8192&rs=8192&setec=8d21d41bd792c366ec2a4b5dc953a893"
    }
  ]
}