{
  "modId": 21512.0,
  "modName": "SKYrim Perk Extravaganza -- SkyPE",
  "summary": "Over one-hundred new, creative, and unique perks. Expanded vanilla perks. Improved vanilla perks. Class perks. Magicka and Stamina based perks. Shout perks. Quest Perks. Roleplaying Perks. Race Perks. Class Perks. Unarmored perks. Unarmed perks.",
  "descriptionHtml": "SkyPE (Skyrim Perk Extravaganza)\r<br />\r<br />\r<br />NOTE: I test this with a perk setting of three every two levels. Two per level may work for you, but it feels a bit overpowered to me.\r<br />\r<br />ALSO NOTE: Version 1.7 is still up for those who might prefer &#34;Classic&#34; SkyPE.\r<br />\r<br />2.17 CHANGES June 20, 2014\r<br />-Various text edits\r<br />-Bugged perk, Sense of Smell, replaced with Stalk you Prey.\r<br />-Bugged perk, Sixth Sense, removed\r<br />-Fixed conditions on a couple perks, abilities and effects\r<br />-Fixed perks related to shout cooldown\r<br />-Includes new Smithing tree \r<br />\r<br />Next is up a version without the new Smithing tree and a reworking of the new tree.\r<br />\r<br />2.1 CHANGES\r<br />-Smithing tree has been redone to simulate the most realistic smithing experience possible. Yes, it makes it harder. It takes longer to become a smith because one must study the craft and spend time with it. The rewards for this time are great&#33;\r<br />In this new method of crafting, you learn the nuances of each metal, for each one has its own ability to protect and to harm. The Armorsmith learns how to first craft simple pieces of armor from a metal by fashioning boots, shields and gauntlets. Once these are practiced with a bit, then he can move on to more complicated and important pieces like the cuirass and helmet. \r<br />The Weaponsmith starts out learning simple weapons that do not require much finesse or talent to craft. These are the maces, warhammers, war axes, and bows. These things are as much woodworking than metal-smithing. The dagger is another beginner item, for it&#39;s blade is short and easier to make. \r<br />The more experienced weaponsmith can make longer blades and hone them to deadly precision. These are also balanced for the perfect swing. Now such weapons as swords, battle-axes and greatswords are available for crafting.\r<br />Each metal has four perks attributed to it: simple armor, simple weapons, advanced armor, and advanced weapon. These perks allow for different items to be crafted. The simple armor and weapons can be learned at a skill level below the Vanilla skill level, while the advanced items keep the normal skill level found in the Vanilla perk.\r<br />Furthermore, every perk taken allows for a 30% greater effectiveness in improving your items. Once all four perks are taken, this grants almost double the effectiveness of Vanilla Skyrim.\r<br />\r<br />BUG FIXES\r<br />-Destruction dual casting has been fixed.\r<br />-Bound bow keyword added.\r<br />-Cleaned with TES5Edit.\r<br />-The Breton Race perks have been restored.\r<br />\r<br />\r<br />2.0 beta (Download the file in the Update category)\r<br />\r<br />With this version, SkyPE moves into a new level of realism and immersion. Much of the mod is being rebuilt from the ground up with these two factors in mind. During this process, new perk trees grew and exciting new perks began to blossom. \r<br />In this beta version, SkyPE 2.0 is roughly 75% finished. It has been scrutinized in many tests, however, there have been so many changes, I felt I couldn&#39;t do it all alone and still release a finalized version in any short time. For that reason, I am releasing this for those that wish to get a sneak peak at what is coming. \r<br />The changes for SkyPE 2.0 so far are as follows:\r<br />\r<br />1. The first change for SkyPE is that, in many cases, your skill levels no longer determine what perks you may choose. While each skill affects your overall performance of that action, in order to specialize in a particular action, you must perform that very action many times. \r<br />For instance, you can no longer rely on your Alchemy skill level to let you choose a perk that lets you gather extra ingredients from plants. Now you have to harvest plants again and again before you become skilled enough to pick that perk.\r<br />Other examples include:\r<br />\r<br />-Choose perks to gain bonuses in fighting dragons, daedra, undead and other foes by killing those particular enemies. \r<br />-Choose perks that allow you to become better at making poisons, as well as to become immune to poison, by making poisons.\r<br />-Choose a perk that allows you to carry more weight by having carried large amounts of gold.\r<br />-Choose perks that allow you to gain more power from soul gems by recharging your weapons.\r<br />-Choose perks that let you drain an enemy&#39;s soul with each hit by regularly using the Soul Trap spells.\r<br />-Choose a perk that makes your poisons last longer by using poisons.\r<br />-Choose a perk that gives you disease immunity by catching diseases.\r<br />-Many more&#33;\r<br />\r<br />\r<br />2.  The second change is found in the new perk trees. These are as follows:\r<br />\r<br />Vampire (Unfinished)\r<br />Hated Enemy (Finished)\r<br />Unarmed (Unfinished)\r<br />\r<br />\r<br />3.  The third change allows you to specialize in a certain aspect of Conjuration magick: Necromancy, Familiar Summoning, and Atronach Evocation. These allows similar perks for different types of creatures with some twists. Summoning is considered easiest and weakest. Evocation is most powerful, but very short. Necromancy can become powerful and is long-lasting. Note that many conjuration spells have been changed to accomodate these changes.\r<br />There is something similar happening in Destruction magic, as well.\r<br />\r<br />Upcoming Changes not included yet are:\r<br />\r<br />1. Reworking the Smithing tree to be more realistic. \r<br />I&#39;ve known a blacksmith and his apprentice son for almost 30 years. I&#39;ve ordered swords and other weapons from them and watched how they are made. Due to this, it is painfully obvious that the Smithing tree is not realistic, but it does balance the game.\r<br />However, I have come up with a way to change it to be both realistic and balanced. This is a BIG change and is one of the next things I will be working on.\r<br />\r<br />2. Finishing the unfinished trees and adding a Werewolf tree.\r<br />\r<br />3. Working out any bugs from this release. One of the main things I anticipate will be changing is the requirements for some of these perks. It is hard for me in just my play-style to determine if the new requirements for many perks are too high or too low, so your feed back is appreciated.\r<br />\r<br />\r<br />UPDATING: \r<br />It&#39;s always best to save your game before updating any mod and this is no exception. Keep a copy of the prior version handy, as well. Playtest it for a while and make sure all your prior perks are still with your character.\r<br />Although some perks have been made unavailable, they are still in SkyPE, so if you had them before, you still will. \r<br />There are two perks that have had their Editor ID&#39;s changed for clarity. These perks may have to be re-added to your character through the console. Unfortunately, I don&#39;t remember what they are...\r<br />\r<br />Thank you for playing SkyPE. I look forward to hearing from you&#33;\r<br />\r<br />\r<br />Summary\r<br />Over a hundred of new, creative, and unique perks, many of which support skill levels up to 200. There are:\r<br />Expanded vanilla perks. Improved vanilla perks. Class perks. Magicka and Stamina based perks. Shout perks. Quest Perks. Crime Perks. Roleplaying Perks. Race Perks. Class Perks.\r<br />See the Read Me for the list of perks. In summary as groups, they are: \r<br />\r<br />Class Perks\r<br />These give you bonuses to skills of standard Elder Scrolls classes, but are balanced out by penalties for skills these classes wouldn&#39;t typically use. There are also corresponding perks that give you abilities related to certain classes, like Witchhunters doing special damage to mages with their bows.\r<br />\r<br />Crime Perks\r<br />Suitable for the rogue PC who wish a little edge in their favor. Here, you will find perks that let the outlaw highwayman find extra gold on his victims as well as the Anarchist who just has to kill every guard he sees, as well as many more.\r<br />\r<br />Race Perks\r<br />There are four perks available for each race. They are taken from lore and past games. For instance, High Elves get their weakness to fire, frost, and shock back with one perk, but that&#39;s balanced by letting them dualcast ANY spell school. They are natural wizards, after all. Other race perks focus on the Khajiit&#39;s ties to the moons, Bosmer cannibalistic tendencies, Khajiit claw attacks, racial hatreds, Breton quest obsession, Dunmer history and gods, Redguard bladedancing and Nord history, just to name a few.\r<br />Some race perks affect your bartering with individual races. You can have an affinity for one or more races and gain bonuses in buying and selling with them.\r<br />\r<br />Quest Perks\r<br />Some perks have only the completion of quests as a requirement, such as becoming Arch-Mage or Harbinger. Each of the Daedric quests unlock a perk upon their completion, offering a boon related to the Prince, it&#39;s history or it&#39;s artifact. If you completed the first Imperial Legion or Stomrcloak quests, perks are unlocked giving you bonuses over the opposite side.\r<br />\r<br />Role-Playing Perks\r<br />Many perks rely on your Misc. Stats. These are especially for role-playing as they can be unlocked only when you have eaten so many meals or rested so many hours. You can get a perk for your favorite weapon, spell or shout. There are perks for clearing dungeons, having bounties (one favorite of mine is called Anarchist and it gives you an attack bonus against guards), animals killed, diseases contracted, days passed, books read, training sessions, etc.\r<br />\r<br />Thanks to everyone who downloaded, played, or reported bugs to me&#33;\r<br />\r<br />\r<br />\r<br />DESCRIPTION\r<br />You&#39;re an adventurer. You have 18 skills to help you survive and thrive in a world full of danger. Each of these come with a handful of perks to keep you going, but is it really enough to let you create a truly unique character who has specializations that no other has? \r<br />Can your PC be left-handed? \r<br />Or be a cleric who turns undead better than anyone else in Skyrim as long as an amulet of the Divines is worn? \r<br />Or be a mage specializing in Armor spells so that they scale with his/her Alteration level? \r<br />Can your Khajiit PC have a special bond with the caravans from his homeland that allows him better prices when trading with them? \r<br />Can your PC be a quick learner at his favorite skill so he levels it faster?\r<br />\r<br />SkyPE brings you over 80 new and unique perks, many of which have four or five levels to increase their power, to make a total of about 200 perks&#33; In keeping with the basic levels of the Elder Scrolls system, these require certain skill levels of either 25/50/75/100 or 20/40/60/80/100 (Some require certain amounts of Magicka or Stamina instead but more on that later). \r<br />\r<br />Furthermore, almost every perk from the bottom to the top of each tree is available as long as the skill requirements are meant. Very few perks require a separate perk first. The only real exceptions are the magic Novice/Apprentice/Adept/Expert/Master perks which are presented now as a stack of perks rather than a number of individual ones. In all other cases, you do not have to spend a perk point on a perk you don&#39;t want in order to reach the one you do. \r<br />However, since most skills require either a 20 or 25 in a skill, your selection of available at the beginining of the game is severely limited since you will not have many skills starting off at that level. You have to use your skills in order to earn your first perk, you cannot take it right out of Helgen.\r<br />\r<br />SkyPE also introduces two new perk trees. The first is Mysticism, formerly Enchanting, which imbues the PC with natural magical powers that can be said to manifest when a perk is chosen. Magicka is as much a part of the mystic as blood, skin and bone, so it provides constant magickal effects as long as certain requirements are met. Many of the perks on this tree have magicka requirements instead of skill requirements. \r<br />Some of its effects includes having an invisible force field surround you to help negate attacks when you are wearning heavy armor and wielding a spell, as well as gaining a bonus to your damage output when you are wielding both a spell and a weapon. The mystic is also the master of soul trapping and enchanting, so all perks having to do with these actions are found in the Mysticism tree.\r<br />\r<br />The next perk tree is Athletics. Here, you learn to run faster, fight unarmed, dodge attacks, you can be born with tough skin, choose to be left-handed, control your breathing to boost stamina regeneration, and other skills having to do with the normal physical body. These perks do not have skill requirements but Stamina requirements. This perk tree is combined with the Smithing perk tree. There is not an actual Athletics skill that can be increased and unfortunately there is no way around this at this time. \r<br />\r<br />Many of the perks of SkyPE are associated with and named after the classes found in prior Elder Scrolls games, including Battlemage, Witch-Hunter, Scout, Crusader, and Spellsword. You will also find new class-related perks such as Skirmisher, Duelist, and Centurion. Each of these perks offer a bonus that relates to the class it’s named after and this increases when you pick higher ranks of the perk. Each rank grants you a title appropriate to the corresponding class. \r<br />\r<br />All of the redesigned perks, such as Bullseye, have been weighed as closely as possible to Bethesda’s vision. Perks that were only available at 100 skill are available as low as 25, but in a reduced form or with a small chance of occurance. For instance, Bullseye now has four ranks. The top rank still offers a 15% chance to paralyze a target for 10 seconds. Lower ranks offer lower chances and shorter durations.\r<br />\r<br />SkyPE is intended to make your character unique by offering a specialization that was not available before. Most perks applied large bonuses to the whole range of items associated with them, such as Armsman giving you a 20% bonus per rank to all one-handed weapons. SkyPE is designed so the PC must specialize in a specific weapon type (ie maces, swords, or war axes) in order to get big damage bonuses. Meanwhile, all-encompassing perks like Armsman are nerfed in their magnitude to 10% bonus per rank, but also include additional benefits, such as increasing your weapon speed with each rank and adding a slight stagger that increases with rank. Every skill, whether combat-related or non-combat, has specialty perks for big bonuses applying to certain types of actions and an all-encompassing perk that adds a smaller bonus along with a couple extra benefits. \r<br />\r<br />Your constructive comments are appreciated if something seems over-powered or faulty.\r<br />\r<br />Please refer to the Read Me listed here and included in the download for the extensive list of perks included in SkyPE.\r<br />\r<br />PAST UPDATES\r<br />\r<br />\r<br />UPDATE 1.70 -- February 10, 2014\r<br />Fixed the bad keyword in the Crusader and Cleric perks\r<br />Aligned religious amulet keywords to fit with other mods. They may still show as being conflicts in TES5Edit, but if you want to have the Cleric and Crusader perks work, this mod needs to be loaded after &#34;USKP&#34; and &#34;Weapon and Armor Fixes&#34;\r<br />Fixed some minor grammar and some confusing language in descriptions\r<br />Nerfed Good Night Sleep perk\r<br />Long Term perk now shows correct values for fortification enhancements\r<br />\r<br />UPDATE TO 1.55 January 7, 2014\r<br />Removed Short Flight perk as nothing could fix it.\r<br />Fixed the conditions and bugs with the following perks:\r<br />Student, Disarming Bash, Unhindered, Defensive Training, Silent Roll, and Mystic Binding\r<br />Updated Nocturnal&#39;s Influence perk to be more clear in description and efficient in use\r<br />Fixed the Pickpocket tree from overlapping (Thank you everyone for your patience&#33;)\r<br />Hopefully fixed the Numinous weapons not receiving the bonuses they should\r<br />Nerfed the Dagger Proficiency perk to be equal to other Proficiency perks.\r<br />\r<br />UPDATE NOVEMBER 16, 2013\r<br />Minor bug fixes on perks such as Avoid Death, Greatsword Proficiency and Alchemy Synergy.\r<br />Update Feb 10, 2013\r<br />Added six modular skill trees: Archery, Alchemy, 1H, 2H, Destruction, and Speech\r<br />\r<br />Update August 27, 2013\r<br />Nine new perks&#33;\r<br />Defensive Training gives you a boost to AR while wearing Light Armor, but at a cost to your weapon speed\r<br />Dodge Arrows gives you the chance to avoid damage while wearing light or no armor.\r<br />Highwayman lets you find more gold on NPC&#39;s that you murder.\r<br />Dual Defense gives you an Armor Rating boost while you are dual weilding&#33;\r<br />Fast Runner and Swimmer lets you move faster.\r<br />Forge Rings allows you to specialize in enchanting rings and jewelry.\r<br />Nocturnal&#39;s Influence gives the head of the Thieves&#39; Guild some very special luck\r<br />Fiery Propulsion is a perk for the Dragonborn that allows you to move at the speed of a dragon, leaving a fiery trail behind you&#33;&#33;&#33;\r<br />\r<br />A number of minor bug fixes have been added.\r<br />Some perks have been nerfed and some taken out of the tree completely. They are still in the game, so if you have them already you won&#39;t lose them.\r<br />The Class perks have all changed for the better. Their benefits are unique and interesting. They can be considered OP if a person were to pick more than one, but if you want to OP your game, go right ahead, I don&#39;t care. If you don&#39;t like OP, then have some self-control and stick with picking just one of those perks. \r<br />\r<br />NOTE: I have not yet updated the optional individual perk trees. That was next on my list, but it doesn&#39;t seem like too many people use these. Instead, I will wait to see if anyone wants a specific tree as a stand-alone mod and then I will make that tree and post it.\r<br />\r<br />Update Feb. 2, 2013\r<br />Fixed minor bug with Thaumaturgist perk\r<br />Added a forgotten perk to the Quest perks that gives you a discount at the Riverwood Trader after returning the Golden Claw.\r<br />\r<br />Update January 1 2013\r<br />Nerfed weapon bonuses for specialization and target specific bonuses\r<br />Changed Disciple of Sheogorath perk to be more graphics friendly\r<br />Fixed overlapping perk trees as best as they could be fixed\r<br />Changed Boltmaster perk to Electromancer\r<br />Fixed Crippling Shot to have the random chance it was supposed to have\r<br />Spelling fixed on some perks\r<br />\r<br />Update 1.0 11.26.12\r<br />Rebalanced some perks and extended most of them to skill level 200. Over 160 perks, most with up to 8 levels.\r<br />\r<br />Update .92 10/21/12\r<br />The Main File now has many fixed and improved perks, including that pesky Sneak bug. It also has over 60 new and unique perks, bringing the list to about 150 perks, not counting their various levels.\r<br />\r<br />Update .9 : Fixes some more bugs (Special thanks to the sharp eyes and knowledge of Phynix2007); Added modular version (Please see the important note below)\r<br />Update .77: Fixes sneak time bug; fixes some requirements in two perks\r<br />\r<br />RECOMMENDATIONS\r<br />Perk Reset   http://skyrim.nexusmods.com/mods/30684/? \r<br />Skyrim Uncapper  http://skyrim.nexusmods.com/mods/1175/?\r<br />\r<br />INSTALLATION\r<br />If you want all of the perks from SkyPE, download the Main File and install the &#34;SkyPE.esp&#34; into your Data folder. If you just want certain skill trees, then download the optional Modular File and install only the .esp of your desired tree, ie. &#34;Skype - Alchemy&#34;. \r<br />\r<br />UNINSTALLATION\r<br />Remove the .esp(s) from your Data folder.\r<br />\r<br />IMPORTANT NOTE ON THE MODULAR VERSION\r<br />Some may notice that, even though the overall file size of this mod is extremely small, the modular versions are close in size to the full version. The reason for this is that I left all of the new and changed perks in the mod, taking out only the unwanted skill trees. This means that vanilla perks will still change to SkyPE perks even if the skill trees aren&#39;t altered. \r<br />\r<br />COMPATIBILITY\r<br />This mod is not compatible with any mods that alter the perk trees in any way. Although you might still be able to have the reworked perks, the new perks will be gone.\r<br />\r<br />Acknowledgements\r<br />Thanks to Bethesda and TES Nexus for everything they have done.",
  "categoryId": "73",
  "version": "2.5",
  "author": "Magickman12",
  "createdUnix": "1343886896",
  "updatedUnix": "1445043208",
  "containsAdultContent": false,
  "uploadedBy": "magickman12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "78213",
      "name": "SkyPE",
      "version": ".75",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "99",
      "fileName": "SkyPE-21512--75.7z",
      "uploadedUnix": "1343886972",
      "modVersion": ".75",
      "virusScanUrl": "https://www.virustotal.com/file/0574fd885a95c78b3b0012ef2e526e4818e3319053f7f48cb4b819ebd319c1a5/analysis/1407063605/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE-21512--75.7z?fid=78213&ttl=1535790439&ri=8192&rs=8192&setec=734de6661ce5d2961d30b35bd20a18f8"
    },
    {
      "fileId": "79904",
      "name": "SkyPE",
      "version": ".78",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "95",
      "fileName": "SkyPE-21512--78.7z",
      "uploadedUnix": "1344475045",
      "modVersion": ".78",
      "virusScanUrl": "https://www.virustotal.com/file/46e99d7589d1c07a13dae89fb7311e4a5d1f4898e0493bf805ee8b341faa07c1/analysis/1407081364/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE-21512--78.7z?fid=79904&ttl=1535790439&ri=8192&rs=8192&setec=e7aaed04222e72772727043745f6dc02"
    },
    {
      "fileId": "87081",
      "name": "SkyPE",
      "version": ".9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "99",
      "fileName": "SkyPE-21512--9.7z",
      "uploadedUnix": "1347075038",
      "modVersion": ".9",
      "virusScanUrl": "https://www.virustotal.com/file/0c2a22a1421934f34e286871bad820347c0ad6569a79739c6be69b1b7e0272c8/analysis/1407152500/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE-21512--9.7z?fid=87081&ttl=1535790440&ri=8192&rs=8192&setec=fa9c8c09dd573c5bde0b95d737bf0562"
    },
    {
      "fileId": "95113",
      "name": "SkyPE",
      "version": "PT",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "61",
      "fileName": "SkyPE - Playtest-21512-PT.7z",
      "uploadedUnix": "1350876200",
      "modVersion": "PT",
      "virusScanUrl": "https://www.virustotal.com/file/d5e444bf2e73cbd536118c95c242394d2d359a723968d15b47cc369f494937be/analysis/1407231739/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE%20-%20Playtest-21512-PT.7z?fid=95113&ttl=1535790440&ri=8192&rs=8192&setec=07e4432ce3f31608914f91d6279e3f06"
    },
    {
      "fileId": "101878",
      "name": "Skype",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "78",
      "fileName": "Skype-21512-1-0.7z",
      "uploadedUnix": "1353984658",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f67ac054e66a96418d012e2133ac47fa74bcda9c753f20f01b51d9300c008ad6/analysis/1407279987/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skype-21512-1-0.7z?fid=101878&ttl=1535790441&ri=8192&rs=8192&setec=508407fb1b6507fc71b41402564b6c65"
    },
    {
      "fileId": "101880",
      "name": "Skype - Modular",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "85",
      "fileName": "Skype - Modular-21512-1-0.7z",
      "uploadedUnix": "1353984735",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ae459d8863ebbeeb5547e67212d445dd8e9b52cbb3c89124e8f92a90725102d9/analysis/1407279988/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skype%20-%20Modular-21512-1-0.7z?fid=101880&ttl=1535790441&ri=8192&rs=8192&setec=bfdeec9a96f2fde3f5bfb8e368796768"
    },
    {
      "fileId": "102008",
      "name": "Skype",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "82",
      "fileName": "Skype-21512-1-01.7z",
      "uploadedUnix": "1354070633",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/70f1ece3059f8f4aa0f5fccef184161a330fbde03d683d341f716bbe9203e918/analysis/1407281225/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skype-21512-1-01.7z?fid=102008&ttl=1535790441&ri=8192&rs=8192&setec=60139a5d226b7d308b5cba0b21d9ab33"
    },
    {
      "fileId": "108973",
      "name": "SkyPE",
      "version": "1.15",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "83",
      "fileName": "SkyPE-21512-1-15.7z",
      "uploadedUnix": "1357085341",
      "modVersion": "1.15",
      "virusScanUrl": "https://www.virustotal.com/file/be7af0a6173caccf3dcbc902e66ffaa513fccff92d38c14baa90da1f8e49b514/analysis/1407332823/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE-21512-1-15.7z?fid=108973&ttl=1535790442&ri=8192&rs=8192&setec=fa820ee46177764894f657187e81ec59"
    },
    {
      "fileId": "1000006432",
      "name": "SkyPE",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "83",
      "fileName": "SkyPE-21512-.7z",
      "uploadedUnix": "1359763425",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/8ea73363f1abd29142fa461e9c899c41552e28cf030f9ec6f01fc80d4477aa85/analysis/1407391564/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE-21512-.7z?fid=1000006432&ttl=1535790442&ri=8192&rs=8192&setec=e1cda5b6491c3e0ab13cae42d040e858"
    },
    {
      "fileId": "1000009003",
      "name": "SkyPE -- One Handed",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "9",
      "fileName": "SkyPE -- One Handed-21512-1-0.7z",
      "uploadedUnix": "1360608840",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2b4c5197c3fdde1710d8d9856d9b8a241649bfe6c3184eb754c567a9dc9bd949/analysis/1407411531/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE%20--%20One%20Handed-21512-1-0.7z?fid=1000009003&ttl=1535790443&ri=8192&rs=8192&setec=6faf8dd3cb3bbfd6d211fbcfddbcbdb2"
    },
    {
      "fileId": "1000009004",
      "name": "SkyPE -- Two Handed",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "10",
      "fileName": "SkyPE -- Two Handed-21512-1-0.7z",
      "uploadedUnix": "1360608879",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/49fa8504b2bbe3fc2bc6010c4b1d8c46250bdaf1f4ff28777d9e93f957dcdf3b/analysis/1407411542/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE%20--%20Two%20Handed-21512-1-0.7z?fid=1000009004&ttl=1535790443&ri=8192&rs=8192&setec=91703baf0864f2b43cb3ba480205f06a"
    },
    {
      "fileId": "1000009005",
      "name": "SkyPE -- Alchemy",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5",
      "fileName": "SkyPE -- Alchemy-21512-1-0.7z",
      "uploadedUnix": "1360608924",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1104687e4bbec2a5aed1979dda3570ac6da211ac80cf90db20dc1d1a98c8626c/analysis/1407411543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE%20--%20Alchemy-21512-1-0.7z?fid=1000009005&ttl=1535790444&ri=8192&rs=8192&setec=735d102cf1952bffa9b3a7a59fc2a9d8"
    },
    {
      "fileId": "1000009006",
      "name": "SkyPE -- Archery",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7",
      "fileName": "SkyPE -- Archery-21512-1-0.7z",
      "uploadedUnix": "1360608958",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b9fef640b497f87ab0c6e2948665b2e2c2e3f5c6dc185cd2de67e2fd2feae8cc/analysis/1407411544/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE%20--%20Archery-21512-1-0.7z?fid=1000009006&ttl=1535790444&ri=8192&rs=8192&setec=4270622cf3cc32b7cd3b4850b480567c"
    },
    {
      "fileId": "1000009007",
      "name": "SkyPE -- Destruction",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7",
      "fileName": "SkyPE -- Destruction-21512-1-0.7z",
      "uploadedUnix": "1360609002",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d7f5255e13380a0d7ba90fb5cd14667f5786bca300f0e04ff4a0b4131bc8f280/analysis/1407411544/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE%20--%20Destruction-21512-1-0.7z?fid=1000009007&ttl=1535790444&ri=8192&rs=8192&setec=3588c1ee1270c1343ca3a502bf801a4d"
    },
    {
      "fileId": "1000009008",
      "name": "SkyPE -- Speech",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5",
      "fileName": "SkyPE -- Speech-21512-1-0.7z",
      "uploadedUnix": "1360609033",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e246cebeca514e8a1d03b51e02622c8e3f3671794a72e644d26e9fde332b5ddd/analysis/1407411545/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE%20--%20Speech-21512-1-0.7z?fid=1000009008&ttl=1535790445&ri=8192&rs=8192&setec=2b69ccd0d425c6b5d4d1a763dfa3e698"
    },
    {
      "fileId": "1000049884",
      "name": "SkyPE",
      "version": "1.33",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "82",
      "fileName": "SkyPE-21512-1-33.7z",
      "uploadedUnix": "1377578540",
      "modVersion": "1.33",
      "virusScanUrl": "https://www.virustotal.com/file/0004aecfeb19194ed62fbe88da756c087f786e12b29594691615f62924c140a7/analysis/1407698237/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE-21512-1-33.7z?fid=1000049884&ttl=1535790445&ri=8192&rs=8192&setec=8f5df56d231799f50fdc04f882cad816"
    },
    {
      "fileId": "1000079782",
      "name": "SkyPE",
      "version": "1.45",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "72",
      "fileName": "SkyPE-21512-1-45.7z",
      "uploadedUnix": "1384642805",
      "modVersion": "1.45",
      "virusScanUrl": "https://www.virustotal.com/file/36f4328e3c735d45097be2b87f146dbfaa50bf1caf46a629493d12c4bd1a0044/analysis/1407795136/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE-21512-1-45.7z?fid=1000079782&ttl=1535790446&ri=8192&rs=8192&setec=4a982cfc8f9989f3369326e924e87dfa"
    },
    {
      "fileId": "1000090274",
      "name": "SkyPE",
      "version": "1.55",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "82",
      "fileName": "SkyPE-21512-1-55.7z",
      "uploadedUnix": "1389061521",
      "modVersion": "1.55",
      "virusScanUrl": "https://www.virustotal.com/file/ad0a30547a1968804af6e61f5ac33453f115f4e903d66b081efd0a04f864d3f5/analysis/1407875529/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE-21512-1-55.7z?fid=1000090274&ttl=1535790446&ri=8192&rs=8192&setec=2fdbcb42447029ff903490a13c73aa90"
    },
    {
      "fileId": "1000096436",
      "name": "SkyPE",
      "version": "1.70",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "88",
      "fileName": "SkyPE-21512-1-70.7z",
      "uploadedUnix": "1392085460",
      "modVersion": "1.70",
      "virusScanUrl": "https://www.virustotal.com/file/e614db7e54725a2695a41b7d907791b3f1fb7d5068f78db62837950a9a289b1f/analysis/1407928506/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE-21512-1-70.7z?fid=1000096436&ttl=1535790447&ri=8192&rs=8192&setec=85cd9c1981b63e9d9b0db8ec20261743"
    },
    {
      "fileId": "1000105150",
      "name": "SkyPE",
      "version": "2.0beta",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "101",
      "fileName": "SkyPE-21512-2-0beta.7z",
      "uploadedUnix": "1397619191",
      "modVersion": "2.0beta",
      "virusScanUrl": "https://www.virustotal.com/file/8893869781f0959dffaa50d2d9c9a280aee53f4bce6b2178ff31222553ed5658/analysis/1408023370/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE-21512-2-0beta.7z?fid=1000105150&ttl=1535790447&ri=8192&rs=8192&setec=3abf0d481e90ac59c5effe932c826eb3"
    },
    {
      "fileId": "1000109017",
      "name": "SkyPE",
      "version": "2.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "98",
      "fileName": "SkyPE-21512-2-1.7z",
      "uploadedUnix": "1400030307",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/02b977169d6b6728f69e6bd005355785209bb6c83e58270394f040478de2ec58/analysis/1408076065/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE-21512-2-1.7z?fid=1000109017&ttl=1535790448&ri=8192&rs=8192&setec=318e3a01ae11ae5907224946cf1ce9ac"
    },
    {
      "fileId": "1000113733",
      "name": "SkyPE",
      "version": "2.16",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "104",
      "fileName": "SkyPE-21512-2-16.7z",
      "uploadedUnix": "1403277822",
      "modVersion": "2.16",
      "virusScanUrl": "https://www.virustotal.com/file/a060ec898c5a78f3c5171e2f6590c5981e968e8065510913992d1f8e64726ffd/analysis/1408134943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyPE-21512-2-16.7z?fid=1000113733&ttl=1535790448&ri=8192&rs=8192&setec=ecc1f80acbfa753ea6ee96f5c1b76010"
    },
    {
      "fileId": "1000181066",
      "name": "Skype",
      "version": "2.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "87",
      "fileName": "Skype-21512-2-5.7z",
      "uploadedUnix": "1445043208",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/07f227dc6306dee4b9b6a65ad09e6b77781b1c2ce7478dcda8d8e722235d4fba/analysis/1445043243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skype-21512-2-5.7z?fid=1000181066&ttl=1535790448&ri=8192&rs=8192&setec=b515c838d60c90b0729a76ca59f267f3"
    }
  ]
}