{
  "modId": 21577.0,
  "modName": "Immersive Armors - Traduction Francaise - FRENCH",
  "summary": "\\\"Immersive Armors\\\" vise a ameliorer considerablement la variete des armures dans le monde de Skyrim.\r\nLe but de chaque ensemble est de se fondre dans les traditions du jeu, sans pour antant bouleverser l\\'equilibre du jeu.\r\n\r\n(Traduction du mod original de Hothtrooper44)",
  "descriptionHtml": "[img]http://i46.tinypic.com/zin8cn.jpg[/img]\r\n\r\nCe mod est la traduction française du mod original de [url=http://skyrim.nexusmods.com/users/3656551]Hothtrooper44[/url] disponible [url=http://skyrim.nexusmods.com/mods/19733]ICI[/url]\r\nThis mod is the french translation of the mod of [url=http://skyrim.nexusmods.com/users/3656551]Hothtrooper44[/url] available [url=http://skyrim.nexusmods.com/mods/19733]HERE[/url]\r\n\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n[u][b]Description :[/b][/u]\r\n\r\nSi vous êtes à la recherche d\\'un mod pour améliorer votre jeu avec une plus grande variété d\\'armures et d\\'armes qui ne dénaturent pas le jeu, alors ce mod est fait pour vous. Il ajoute de nombreuses nouvelles armures qui ont été intégrés de façon transparente à Bordeciel. \r\nToutes les nouvelles armes et armures s\\'adaptent au niveau du joueur, tout comme les armes et armures de base.\r\n\r\nCe mod va être en constante évolution pour apporter une nouvelle vie à votre monde. Actuellement, ce mod ajoute 22 nouveaux ensembles d\\'armure (28 en comptant les variantes), 13 variantes de casques, 12 nouvelles armes et boucliers, et un grand nombre d\\'autres éléments tels que des cache-oeils, des capes, des boucles d\\'oreilles, des foulards, et plus encore !\r\nIls sont tous craftable, sont évolutifs, peuvent être enchantés, et sont intégrés dans le jeu dans les donjons, ou sur des PNJ spécifiques.\r\n\r\nC\\'est vraiment une addition monumentale pour votre jeu - le mod contient 1065 fichiers !\r\n\r\nPour plus d\\'information, je vous invite à consulter la page du mod en anglais [url=http://skyrim.nexusmods.com/mods/19733]ICI[/url]\r\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n[u][b]Changelog :[/b][/u]\r\n\r\nv6 log:\r\n- All weapons have been removed from this pack in light of the new \\\"Immersive Weapons\\\" mod that can be located HERE.\r\n- All armor in the forge will now be found under a custom crafting menu \\\"Auxiliary Armors\\\".\r\n- Ground models (what you see in the forge or in your inventory) were updated for every item in this pack.\r\n- Full racial compatibility was updated for every item in this pack.\r\n- Full gender support was updated for every item in this pack.\r\n- The leveled lists were reworked to spawn the items more often.\r\n- Removed the hanging fur hood varients from the lvled lists (still craftable) and from guards for less clipping with Cloaks of Skyrim and other such mods.\r\n- The crafting materials were reworked for every item in this pack to be more intuitive.\r\n- Prices of many items were reworked for balance.\r\n- Some sets were moved from higher levels to lower ones to better flesh out the early game experience:\r\n- Viking Heavy Armor has been changed from Ebony stats/perks/lvl lists to Steel stats/perks/lvl lists\r\n- Viking Light Armor has been changed from Glass stats/perks/lvl lists to Leather stats/perks/lvl lists\r\n- Mercenary Armor has been changed from Daedric stats/perks/lvl lists to Leather stats/perks/lvl lists\r\n- Changes were made to Barbarian and Mercenary armor sets to help with bad blood decals.\r\n- Alpha layer edits were done to better the Mercenary Armor set.\r\n- Alpha layer edits were done to better the Heroic Imperial Armor set.\r\n- The textures of the Heroic Stormcloak Armor set were reworked to fix the issue with users running on low quality texture settings.\r\n- Fixes were made to the arms of the female version of the Warchief Armor since they were out of line.\r\n- Fixes were made to fix the invisible calves / forearms of the Viking Heavy Armor set.\r\n- The Crowned Hood for the Dragon Hide Armor was removed.\r\n- The Dragon Hide Hood varient for humans was changed.\r\n- The stats and perks required for the Dragon Hide Armor was moved from cloth to Dragonplate based on user feedback.\r\n- The Witchplate Armor no longer appears on Vigilants of Stendar but instead rarely on Warlock bosses.\r\n- The no-bones versions of the Einherjar Armor have been removed to avoid confusion.\r\n- The boneless version of the Warchief armor is now the light version of that armor for the females. The heavy version for the females has bones.\r\n- The old Vagabond helmet has been removed and it has been replaced with a new one.\r\n- Fixed an issue with the gloves of the Dragon Hide Armor that caused invisible forearms.\r\n- Fixed an issue with the Spellbinder/Paladin/Hedge Knight Armors that caused invisible forearms.\r\n- Reworked the scaling on many female helmets to make them better fit.\r\n- Fixed issues with the Vanguard gloves and boots and body slide scaling.\r\n- Renamed the Vagabond Armor variants to be more lore friendly.\r\n- Adjusted the Vagabond Leather Armor sleeves to fix a misalignment issue.\r\n- Added more helmet variation to some guard factions.\r\n- Removed the Redguard Knight Armor with the cape, and instead made the cape standalone and you can choose to equip it with the Redguard Knight Armor or any other armor.\r\n- Fixed a normal map issue with the Falkreath Shield.\r\n- Moved the Heroic Imperial Armor off of low level Imperial Captains for early game balance. This set will now have a 50% chance to spawn on Imperial Captains over the level of 20. It also appears on Hadvar for sport.\r\n\r\nv5 log:\r\n- \\\"Spellbinder Armor\\\" by me(hothtrooper44) has now been included in this mod.\r\n- \\\"Stag Skull Staff\\\" by me(hothtrooper44) has now been included in this mod.\r\n- \\\"Witchplate Armor\\\" by Telthalion has now been included in this mod.\r\n- Added dialogue options for the armors to NPCs! Now some NPCs will see your armors/weapons/shields from this mod and say relevant lines. For example:\r\nWearing the Dwarven Mage Armor: \\\"That\\'s some fine armor, Dwarven make, am I right?\\\"\r\nWearing Heroic Stormcloak Armor, an Imperial might say: \\\"How dare you wear that Stormcloak filth here!\\\"\r\nWearing Mercencary Armor: \\\"That\\'s the armor of a mercenary right there.\\\"\r\nThere are 1-4 lines for every piece in the mod!\r\n- Placed Ulag\\'s Sack in the Sleeping Tree Cave as intended.\r\n- Re-balanced Hunter armor to require advanced armors perk to smith, and have scaled armor stats as intended.\r\n- Re-balanced Warchief armor to have Orcish stats as intended.\r\n- Re-balanced Einherjar armor to have ~steel-plate stats which better fits its perk requirements.\r\n- Re-balanced the boots and gloves of the Mercenary Armor set.\r\n- Added default race tags to the fur hoods for custom race compatability.\r\n- Added vampire race tags to Seadog Tricorn so it will appear on vampires on trasformation as intended.\r\n- Removed the Paladin Armor set from the Vigilant Officers, and replaced it with Witchplate Armor. Paladin armor is now craft only as requested.\r\n- Fixed blood decals on the Wabba Jackhammer.\r\n- Fixed a graphical error on the Mercencary Armor set with alpha edits.\r\n- Removed the enchantments and extra armor of the Vanguard helmets.\r\n- Increased the level to find Ranger armor from 1 to 16 as was intended.\r\n- Fixed crafting component bug for the Hunter Armor set.\r\n\r\nv4 log:\r\n- \\\"Apotheus Light Armor\\\" by GuitunScarfin has now been included in this mod by the author\\'s suggestion. This is truly a well made set and the lore back-story is top notch.\r\n- \\\"Nordic Hunter Light Armor\\\" by frankdema has now been included in this mod by the author\\'s suggestion. One of the best sets for a hunter themed character without a doubt!\r\n- \\\"Heroic Stormcloak Armor\\\" by lumps has now been included in this mod by the author\\'s suggestion. This is a great compliment to the mod as it adds an upgrade to the Stormcloak side similar to the \\\"Heroic Imperial Armor\\\" already in the pack.\r\n- \\\"Seadog Armor\\\" by me (hothtrooper44) is now included in the mod.\r\n- \\\"Paladin Armor\\\" by me (hothtrooper44) is now included in the mod.\r\n- Added an optional UNP support download for users that prefer that female body model.\r\n- Fixed the first person mesh of the Hedge Knight Armor to better fit the set.\r\n- Ran a texture optimizer over all files.\r\n- Fixed an issue that was making a couple of the fur hoods invisible.\r\n\r\nv3.2 log:\r\n- Removed the Falkreath cape from the mod.\r\n- Fixed an incorrect path with the Dwarven Mage Argonian Helmet.\r\n- Fixed a crafting issue with the Redguard Coif.\r\n- Corrected some incorrect biped object slots for 2 Argonian helmet variants.\r\n\r\nv3.1 log:\r\n- Fixed an issue that was making the Aegis of Life invisible.\r\n- Fixed some crafting recipes for the Einherjar set.\r\n- Fixed an issue that made the fur hoods uncraftable.\r\n\r\nv3 log:\r\n- \\\"Einherjar Armor\\\" by Omesean has now been included in this mod by the author\\'s suggestion. There couldn\\'t be a better armor set to fit into this pack, thanks Omesean.\r\n- \\\"Fur Hoods HD\\\" by Northborn has now been included in this mod by the author\\'s suggestion. This hood pack is fantastic and 100% lore fitting for the tundra of Skyrim. Amazing work Northborn, and thanks.\r\n- A new \\\"relic\\\" shield has been added to the pack. It\\'s called \\\"Aegis of Life\\\" and can only be found on difficult NPCs at level 50+ with a very low drop rate. Alternatively, it can be crafted with the Daedric smithing perk.\r\n- Integrated new items into leveled lists.\r\n- Added Akaviri Samurai Armor set into the Skyhaven Temple.\r\n- Snipped two CK bug world edits. (thanks jacktthompson and crazyjackal)\r\n- Fixed the bug with the grey variant of the Vagabond Boots that was causing it not to appear.\r\n- Fixed a bug that caused the Vanguard Gloves to not upgrade at a workbench.\r\n- Fixed the armor value difference in the no bones female version of the Warchief Armor.\r\n- Added perk requirements to craft the Redguard Knight set as intended.\r\n- Fixed an issue that was not allowing the use of cloaks with the Hedge Knight set.\r\n- Fixed the spacing in the name of the Hedge Knight Gauntlets to display correctly.\r\n\r\nv2 log:\r\n- Changed the name of the \\\"Baratheon Armor\\\" set to \\\"Falkreath Armor\\\" to better fit lore.\r\n- Reworked some assets to lower the size of the file.\r\n\r\nv1 log:\r\n- Release.\r\n\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n[u][b]Permissions :[/b][/u]\r\n\r\nL\\'utilisation de l\\'œuvre composée par [url=http://skyrim.nexusmods.com/users/3656551]hothtrooper44[/url], est autorisé librement sur le site Web de Nexus. Si vous réutiliser son travail (ou ma traduction), vous devez le créditer, et laisser un lien vers son mod original. Pour l\\'utilisation de ce mod sur d\\'autres sites que Nexus, s\\'il vous plaît contactez [url=http://skyrim.nexusmods.com/users/3656551]hothtrooper44[/url].\r\n\r\nUse of the work composed by [url=http://skyrim.nexusmods.com/users/3656551]hothtrooper44[/url], is allowed freely within the Nexus website. It is his request that you credit him for any of his work (or my translation) that you reuse and provide a link to the original post from which it came. For use of this mod on sites other than the Nexus, please contact [url=http://skyrim.nexusmods.com/users/3656551]hothtrooper44[/url].\r\n\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n[u][b]Crédits :[/b][/u]\r\n\r\nAll credit goes to [url=http://skyrim.nexusmods.com/users/3656551]hothtrooper44[/url]\r\nTout les crédits vont à [url=http://skyrim.nexusmods.com/users/3656551]hothtrooper44[/url]",
  "categoryId": "36",
  "version": "6",
  "author": "FishNyx",
  "createdUnix": "1343980747",
  "updatedUnix": "1357229916",
  "containsAdultContent": false,
  "uploadedBy": "FishNyx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "78434",
      "name": "Immersive Armors v4 - FRENCH",
      "version": "4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "279058",
      "fileName": "Immersive Armors v4 - FRENCH-21577-4.7z",
      "uploadedUnix": "1343986417",
      "modVersion": "4",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20Armors%20v4%20-%20FRENCH-21577-4.7z?fid=78434&ttl=1535790567&ri=8192&rs=8192&setec=72a259326f0ed01c52b4baf3491ba9c0"
    },
    {
      "fileId": "109321",
      "name": "Support UNP pour Immersive Armors v6",
      "version": "6",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4548",
      "fileName": "Support UNP pour Immersive Armors v6-21577-6.7z",
      "uploadedUnix": "1357227157",
      "modVersion": "6",
      "virusScanUrl": "https://www.virustotal.com/file/8d3cebdf413866d5d3ca69ad1f23a376eab90561782c2d093f61a11a16a88ad2/analysis/1407335127/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Support%20UNP%20pour%20Immersive%20Armors%20v6-21577-6.7z?fid=109321&ttl=1535790567&ri=8192&rs=8192&setec=cb14e86996173c84866ae11773d5993c"
    },
    {
      "fileId": "109336",
      "name": "Immersive Armors v6 - FRENCH",
      "version": "6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "378807",
      "fileName": "Immersive Armors v6 - FRENCH-21577-6.rar",
      "uploadedUnix": "1357229916",
      "modVersion": "6",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20Armors%20v6%20-%20FRENCH-21577-6.rar?fid=109336&ttl=1535790568&ri=8192&rs=8192&setec=9fd1ba92cf4156245ba33efe22cac82c"
    }
  ]
}