{
  "modId": 21575.0,
  "modName": "The Wolf Queen Awakened and Grimsever Return FIX",
  "summary": "Your character is at 81 lvl, and you courier dont wont to give you letter from Falk Firebeard or Mjoll dont wont to give you the quest for receiving back her sword? Well, this is fix for you.\r\n",
  "descriptionHtml": "As far as i know, these two quests are triggered by leveling up, but if you for some reason didnt do them, before reaching the cap, normally you wont be able to get them anyhow, even by using cosole commands.\r\nThis mod removes triggering effect for these quests, so now, even at 81lvl you will be able to receive both quests.\r\n\r\nThe Wolf Queen Awakened (MS06)\r\nWhen you complete The Man Who Cried Wolf (clearing Wolfskull Cave) after a few days courier apporach and delivers a letter to you. Keep that in mind, receiving a letter from Falk Firebeard doesnt start this quest, you need to go to Solitude to talk with him. When you do this, he will offer normal quest, so will be able to finish it.\r\n\r\nGrimsever\\\\\\'s Return (FreeformRiften09)\r\nWhen you first met Mjoll the Lioness in Riften, and talk to her, she will tell you, she was adventuring around some dwemer ruin, where she lost her sword. After this the speech option to ask about her blade will be available, so you will be able to take and complete this quest aswell.\r\n\r\nFor both quests, you dont need to use any console command, they work as they should.\r\n\r\nIf you found any other quest, that is triggered by leveling let me know, and i\\\\\\'ll try to fix it.\r\n\r\n@EDIT\r\nBecause i\\'m a Polish player, i\\'ll try to prepare polish translation for this mod, but not in so short future :)",
  "categoryId": "95",
  "version": "1.0",
  "author": "Lonti84",
  "createdUnix": "1343979972",
  "updatedUnix": "1343980067",
  "containsAdultContent": false,
  "uploadedBy": "lonti84",
  "primaryFile": null,
  "files": [
    {
      "fileId": "78420",
      "name": "The Wolf Queen Awakened and Grimsever Return FIX",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "The Wolf Queen Awakened and Grimsever Return FIX-21575-.zip",
      "uploadedUnix": "1343980067",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ad1dbf147f262cf119f806049033f98fba6c8b19aa4abeb8d018a09cec932988/analysis/1407065887/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Wolf%20Queen%20Awakened%20and%20Grimsever%20Return%20FIX-21575-.zip?fid=78420&ttl=1535790561&ri=8192&rs=8192&setec=4d5fa5cb11462ff1d2635e7ee0b89cb9"
    }
  ]
}