{
  "modId": 21602.0,
  "modName": "Lunari Race",
  "summary": "The beautiful, and formidable women of the Lunari race...",
  "descriptionHtml": "[img]http://www.thedragonrising.com/skyrim/images/lunari/descript_hdr.jpg[/img]\r<br />[img]http://www.thedragonrising.com/skyrim/images/lunari/title.png[/img]\r<br />\r<br />\r<br />[img]http://www.thedragonrising.com/skyrim/images/lunari/news.png[/img]\r<br />[font=Garamond][color=#dd7105][size=3]Version 1.7 of the Lunari race brings the following cosmetic upgrades:\r<br />• New updated custom CBBE and UNP body meshes, with a new TBBP option for both versions.\r<br />• The face and body textures have been updated for more realism, with subtle detail and freckles.[/size][/color][/font]\r<br />\r<br />\r<br />[img]http://www.thedragonrising.com/skyrim/images/lunari/required.png[/img]\r<br />[font=Garamond][color=#c93232][size=3]• Skyrim version 1.9 or later, and you must also install TMPhoenix&#39;s [url=http://skyrim.nexusmods.com/mods/24168]RaceCompatibility[/url] mod before installing the Lunari mod.\r<br />• For the TBBP body meshes option, you MUST have a TBBP capable skeleton installed, such as XP32&#39;s [url=http://www.nexusmods.com/skyrim/mods/26800/?]XPMS[/url] or you will crash to desktop.[/size][/color][/font]\r<br />\r<br />\r<br />[img]http://www.thedragonrising.com/skyrim/images/lunari/vision.png[/img]\r<br />[font=Garamond][size=3][color=#bcc0c9][i]The Lunari mod is the result of a personal desire for the femme power of Skyrim to be truly beautiful and dynamic. This is of course completely subjective, and I never intended for this to be shared publicly. It was a mission really, to enhance the game, and bring a little Tolkien into the mix. I hope you enjoy it&#33;[/i]\r<br />\r<br />\r<br />[img]http://www.thedragonrising.com/skyrim/images/lunari/features.png[/img]\r<br />The Lunari are rare women of the ancient bloodline born of the unlikely union between the famed Nord hunter Saeryn and Rae&#39;Li, the legendary archer and huntress of the rare Sun&#39;Li tree elves. The Lunari &#39;gene&#39; bearing their traits passes on only through the female. They are stronger and longer lived than Nords, and exhibit the slightly pointed ears born of their elven mother. Lunari are gifted with quicker regen and they inherited the combined combat prowess of both of their first parents. Their skill with weapons, particularly bows, is second to none.\r<br />\r<br />Lunari prefer to live in nature, away from the bustle of city life. They have been known to enchant trees into massive, spectacular dwellings, choosing to live inside the tree, or sometimes in majestic homes built far up in the high branches.\r<br />\r<br />Lunari enjoy the following base stats when starting out in the world of Skyrim:\r<br />\r<br />+10 to Archery\r<br />+8 to One-Handed\r<br />+8 to Two-Handed\r<br />+9 to Block\r<br />+9 to Light Armor\r<br />+8 to Speech\r<br />+8 to Restoration\r<br />\r<br />Lunari enjoy greater overall health and strength, with faster regeneration in combat (Magicka, Health, and Stamina). They have a natural resistance to shock (50%), and may cast an immunity spell by voice (assigned to the z key like shouts) that will cure disease, and heal.\r<br />\r<br />[i]If you find that the Lunari women are too strong in base stats for you, simply increase the difficulty of the game or try the Lunari Diminished option when installing the mod&#33;[/i][/color][/size][/font]\r<br />\r<br />[font=Garamond][size=3][color=#bcc0c9]The Lunari race assembles many elements into a cohesive whole, designed to present a certain look to its characters. Some of the features include:\r<br />\r<br />• Customized, seamless, high resolution textures for the bodies and faces for [url=http://skyrim.nexusmods.com/mods/6709]UNP[/url] & [url=http://skyrim.nexusmods.com/mods/2666]CBBE[/url].\r<br />• Custom face texture that is the result of hours of layering and adjusting many elements.\r<br />• Custom specular body/face/hands textures.\r<br />• 26 character presets, lovingly designed and crafted.\r<br />• 45 custom eye textures.\r<br />• Custom Lunari eye mesh that fixes the broken vanilla medial canthus of the eye, and adds longer lashes.\r<br />• 24 different custom eyebrow textures.\r<br />• Optional, custom CBBE and UNP body meshes.\r<br />• Optional, custom TBBP versions of the above meshes (requires TTBP skeleton).[/color][/size][/font]\r<br />\r<br />\r<br />[img]http://www.thedragonrising.com/skyrim/images/lunari/install.png[/img]\r<br />[font=Garamond][size=3][color=#bcc0c9]The easiest way to install your Lunari race is to use NMM (Nexus Mod Manager). Once downloaded, install the mod and follow the installation instructions within the installer, choosing your options as you go. Resize the installer window to properly see the comparison images. (Warning: there is some necessary nudity shown during the installation for comparison between the body types and their custom variants).\r<br />\r<br />IF USING FACE WARPAINT OR TATTOOS: Please know that the Skyrim exe forces the tintmasks (the textures used for the tattoos/warpaint) to a measely 256x256. It looks terrible, and for the longest time I avoided using warpaint or face tattoos.\r<br />\r<br />With the use of SKSE you can place a few simple lines in an SKSE INI file in your Skyrim data folder to tell the game what resolution you would like to use. If you like using warpaint or face tattoos on your Lunari character, I HIGHLY recommend the following tweak:\r<br />\r<br />• Download and install the latest version of SKSE (Skyrim Script Extender). Gopher has made a great installation video for this at: http://www.youtube.com/watch?v=xTGnQIiNVqA\r<br />\r<br />• Once you have SKSE successfully installed, you&#39;ll need to:\r<br />\r<br />1) Locate your data directory.\r<br />2) Create the SKSE folder inside your data folder, if it is not already there.\r<br />3) Create the SKSE.ini file if it is not already there (inside the SKSE folder).\r<br />4) Add &#34;[Display]&#34; category within your INI file.\r<br />5) Add &#34;iTintTextureResolution=1024&#34; or &#34;iTintTextureResolution=2048&#34;\r<br />\r<br />And enjoy a whole new world of warpaint and face tattoo resolution&#33; There is an option during installation of the Lunari mod to choose the HD face tintmasks and tattoos in addition to the high res textures and HD body skin, but the regular high res and low res textures look great when using the SKSE hook&#33;\r<br />\r<br />PLEASE NOTE - If you are experiencing problems with your character&#39;s hair not changing in the race menu, try the following fix via the console in game:\r<br />\r<br />stopquest lunariracecontroller\r<br />resetquest lunariracecontroller\r<br />startquest lunariracecontroller\r<br />\r<br />Exit the console and you should be good to go. Remember to resave. These three lines in the console will fix your old saves and make vampire compatibility and hair changeable in the race menu&#33;[/color][/size][/font]\r<br />\r<br />\r<br />[img]http://www.thedragonrising.com/skyrim/images/lunari/uninstall.png[/img]\r<br />[font=Garamond][size=3][color=#bcc0c9]To uninstall the Lunari mod use NMM. If manually uninstalling, remove the &#39;bhakti&#39; folders from your meshes and textures folders within your data folder.[/color][/size][/font]\r<br />\r<br />\r<br />[img]http://www.thedragonrising.com/skyrim/images/lunari/changelog.png[/img]\r<br />[font=Garamond][size=3][color=#bcc0c9]Changes in version 1.70:\r<br />\r<br />Updated/Added:\r<br />• Updated CBBE and UNP face and skin textures for more realism (detail, freckles, etc).\r<br />• Updated/refined the optional custom CBBE and UNP body meshes.\r<br />• Created new custom TBBP CBBE and UNP body meshes.\r<br />\r<br />Changes in version 1.63:\r<br />\r<br />Updated/Added:\r<br />• Reworked all the eye textures for better color and fidelity.\r<br />• Updated the eye mesh for a more improved medial canthus.\r<br />• Added 2 more character presets (Mara&#39;Li and Arwyn&#39;Li)\r<br />• Updated custom &#39;_sk&#39; textures for better removal of skin reflectivity near lights.\r<br />• Added mipmaps to all tintmask and other select textures, including the new face tattoos.\r<br /> \r<br />\r<br />Changes in version 1.62 (thanks to SFTS):\r<br />\r<br />Fixed:\r<br />• Fixed the hair showing through the helmet issue.\r<br />• Fixed the invisible head problem from the glitchy head and hair biped objects.\r<br />\r<br />Updated/Added:\r<br />• Improved vampire eye textures.\r<br />• Updated the Lunari vampires with the new tintmasks, fixing an error that was replacing the Lunari tattoos with vanilla ones when vamped, saved, and reloaded.\r<br />• Updated the vampire stats to mirror the regular race. There was one attribute that was erroneously different than the regular race.\r<br />\r<br />Removed/Misc:\r<br />• Removed the unused face dirt textures and their respective hooks from the race. \r<br />• Reordered the Form and Editor IDs in TES5Edit to properly list the presets in order since the CK works differently than TES5Edit.\r<br />\r<br />Changes in version 1.61 (thanks to Humannature66, TMPhoenix & SFTS):\r<br />\r<br />Fixed:\r<br />• Hair and Head objects set properly in the CK.\r<br />• Removed duplicate humansandvampires formlist.\r<br />• Adjusted and fixed some details in the body meshes in NifSkope.\r<br />• Missing first person arms meshes for CBBE.\r<br />\r<br />Updated/Added:\r<br />• Reworked and compressed many, if not most of the Lunari textures, resulting in far less load on your system.\r<br />• Created and added a custom Lunari eye mesh to fix the broken vanilla medial canthus of the eye (huge thanks to HumanNature66). Also adds slightly longer lashes.\r<br />• All 45 eye textures reworked to improve the inner corner of the eye with the new mesh.\r<br />• Added 3 new character presets (Gaia&#39;Li, Ayden&#39;Li, and Kaya&#39;Li)\r<br />• Reworked Zen&#39;Li and Quan&#39;Li presets. The eyes were just not working for me.\r<br />• Changed the Lunari vampire skin color back to the game default (paler skin)\r<br />• Added 11 custom Lunari face tattoos, based on the player&#39;s preferred texture resolution choices when installing.\r<br />• Added HD and high res versions of the face tintmasks, based on the player&#39;s preferred texture resolution choices when installing.\r<br />\r<br />Changes in Version 1.6 (more thanks to TMPhoenix):\r<br />\r<br />Fixed:\r<br />• UNP standard body meshes replaced in the UNP package (fixing the erroneous body mesh swap from 1.51)\r<br />• Left hand wrist/forearm gap in the UNP custom body.\r<br />• A slight color mismatch between the UNP arms and hands.\r<br />\r<br />Removed:\r<br />• No more Racecompatibility scripts or files. Total dependency on TMPhoenix&#39;s RC mod.\r<br />• Deleted optional files now that everything is included in the installer.\r<br />• Removed V1 Vampire eyes. The V2 eyes are now the default, and you may choose which one you want to use during installation.\r<br />• No more head mesh options. There is just one head mesh, with better ears (see below).\r<br />\r<br />Updated:\r<br />• The installer includes images to see the side-by-side difference between CBBE and UNP, and then the difference between the standard CBBE/UNP bodies and my custom meshes for each.\r<br />• The CBBE Lunari are now updated to Caliente&#39;s 3.2.3 files, with enhancements and color matching through the Lunari paint shop for seamless necklines using the Lunari face textures.\r<br />• There is now an HD CBBE body texture available as an option during installation.\r<br />• The UNP body textures were also updated for better imaging around the upper torso.\r<br />• All eyebrow textures were tweaked for overall darker exposure in game, for a better match to hair colors.\r<br />• There are now &#39;High Res&#39;, &#39;Low Res&#39;, and a third &#39;High Res + HD Body Skin Textures&#39; options available for both CBBE and UNP during installation, to better choose what your system can handle.\r<br />• The Low Res options were reworked for both CBBE and UNP, now including more texture size reductions with little visual impact.\r<br />• Added another character preset, Ayla&#39;Li, bringing the total now to 21.\r<br />• The Lunari Diminished esp is an option during installation, and the esp was refined with better stats for its application (a less powerful Lunari).\r<br />• The Lunari ears are now not so pointy, as in less dagger-like. Enjoy not getting stuck to trees.\r<br />• A whole lot more I can&#39;t remember&#33; (^_^)\r<br />\r<br />Changes in Version 1.51 (thanks to SFTS):\r<br />\r<br />Fixed:\r<br />• Missing shield/body record assignments and attack data entries. Fixes vampire off-hand weapon & shield visibility.\r<br />\r<br />Changes in Version 1.5 (thanks to TMPhoenix & SFTS):\r<br />\r<br />Cleaned:\r<br />• Mod cleaned with Tes5Edit - removed dirty edits.\r<br />\r<br />Updated:\r<br />• RaceCompatiblity updated & adds Dawnguard compatiblity.\r<br />• Resaved file in CK to update esp format.\r<br />\r<br />Fixed:\r<br />• Missing actorproxynord keywords on both normal and vampire Lunari (fixes DB Cook quest).\r<br />• Incorrectly assigned LunariRaceController properties fixed.\r<br />• Missing mounted combat entries in lunari attack data.\r<br />• Set armour morph to defaultrace to make Lunari fully compatible with custom armors.\r<br />• Improper record being injected into RaceCompatiblity.\r<br />• Added missing Lunari Immunity ability to Lunari Vampires.\r<br />\r<br />Removed:\r<br />• Unused formlists, headparts, character presets.\r<br />• Conflicting and unnecessary modifications to formlists (handled by RaceCompatibility).\r<br />• Separated slight hair color changes into separate colors only available to Lunari - removed changes to originals.\r<br />\r<br />Added:\r<br />• 4 new character presets (Saeryn&#39;Li, Jun&#39;Li, Ashyn&#39;Li, and Tyrah&#39;Li)\r<br />\r<br />Changes in Version 1.41\r<br />\r<br />• Just a tweak for using the vanilla chargen tri file for the regular Lunari, and the no sunken cheeks chargen tri for the Lunari vamps.\r<br />• Changed the default vampire eyes to the new V2 eyes. The older V1 are still available as an optional file.\r<br />\r<br />Changes in Version 1.4:\r<br />\r<br />• Two new character presets, Zen&#39;Li and Quan&#39;Li. See the images area for pics.\r<br />• Fixed a problem with incorrect race morphing from Lunari to Lunari vampire (integrating the 1.31 update).\r<br />• New chargen tri files included that ELIMINATE facial structural changes when becoming a Lunari vampire.\r<br />• New face dirt texture files used for Lunari vampires, eliminating dirty faces when turned.\r<br />• Darkened the skin tone of vampires away from that pasty white.\r<br />\r<br />Changes in Version 1.3:\r<br />\r<br />• New full versions of CBBE and UNP with better vampire compatibility and custom glowing eyes.\r<br />• 7 variations for the glowing vampire eyes (look in the optional files area).\r<br />• New light versions of both CBBE and UNP Lunari mods. Those with showracemenu freezes will hopefully get to play now&#33;\r<br />• Three new character presets, bringing the total to 14. Look in the images area to meet Dryn&#39;Li, Mei&#39;Li, and Yin&#39;Li.\r<br />• New body textures for UNP and CBBE that were exported with mip maps - this might solve some of the black body glitches some of you were having.\r<br />• A new UNP HD body texture exported with mip maps. File size went from 49mb to 65mb&#33;&#33;&#33;\r<br />• CBBE neck seam is now even smoother...\r<br />• Fixed all versions with regard to improper eyebrow image sizes.\r<br />• Several other things I can&#39;t remember lol. (^_^)\r<br />\r<br />Changes in Version 1.2:\r<br />\r<br />• Vampire and Dawnguard DLC compatibility (partially) fixed&#33; [i]Ongoing thanks to Ginnyfiz and others&#33;[/i]\r<br />• Removed all hair models and textures, which were troubling Skyrim&#39;s performance for some.\r<br />• Adjusted the Lunari ears on the head mesh for more length and visibility with more hair models.\r<br />• Adjusted the UNP face textures for a more seamless neckline.\r<br />• Cleared up extraneous, &#39;dirty&#39; edits missed from version 1.1.\r<br />• Many other little tweaks too many to name.\r<br />\r<br />Changes in Version 1.1:\r<br />\r<br />• New 2048 standard body texture for UNP, uncompresssed, and virtually the same visually as the 4096.\r<br />• The 4096 high res body texture for UNP is now available as an optional file in the downloads area.\r<br />• Improved face textures for UNP, with more seamless integration with the body. Just some healthy tweaks.\r<br />• Removed three extraneous files shared with Temptress race mod accidentally during creation kit work.\r<br />• Updated main files for UNP and CBBE with the new esp&#33;[/color][/size][/font]\r<br />\r<br />\r<br />[img]http://www.thedragonrising.com/skyrim/images/lunari/credits.png[/img]\r<br />[font=Garamond][size=3][color=#e6e6fa]There is absolutely no way the Lunari race would have ever come to be without the geniuses that contribute so much to Skyrim, all of whom in no small part have inspired the orchestration of this mod. Deepest gratitude to:\r<br />\r<br />• Massive thanks to TMPhoenix and his continued work on his [url=http://skyrim.nexusmods.com/mods/24168]RaceCompatibility[/url] mod.\r<br />• Thanks to [url=http://skyrim.nexusmods.com/mods/25461]Humannature66[/url] for his skill and patience with me in helping to build the new Lunari eye mesh.\r<br />• Caliente and the [url=http://skyrim.nexusmods.com/mods/2666]CBBE[/url] body.\r<br />• Dimon99 and the [url=http://skyrim.nexusmods.com/mods/6709]UNP[/url] body.\r<br />• Bella&#39;s [url=http://skyrim.nexusmods.com/mods/2812]Better Females[/url].\r<br />• MrLenski&#39;s [url=http://skyrim.nexusmods.com/mods/3563]Coverwomen[/url].\r<br />• [url=http://skyrim.nexusmods.com/mods/9546]Nightasy[/url] for his patience in our back and forth while I learned my way around 3ds Max. His tutorials are epic.\r<br />• Devacore for the generous sharing of his chargen tri files from [url=http://skyrim.nexusmods.com/mods/16506]Vampire Face Less Sunken Cheeks[/url].\r<br />• Thanks to others in the community, especially VRDaphni, GinnyFizz and SFTS for continued help and support.\r<br />\r<br />[i]And of course Bethesda for reminding me that, although this is just a game, magic is still in the world.[/i][/color][/size][/font]",
  "categoryId": "34",
  "version": "1.70",
  "author": "bhaktisean",
  "createdUnix": "1344014036",
  "updatedUnix": "1408001096",
  "containsAdultContent": false,
  "uploadedBy": "bhaktisean",
  "primaryFile": null,
  "files": [
    {
      "fileId": "109014",
      "name": "Lunari Race V1_6 NMM Installer",
      "version": "1.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "79993",
      "fileName": "Lunari Race V1_6 NMM Installer-21602-1-6.7z",
      "uploadedUnix": "1357102602",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/9f25fe6b17281ed335682c8b91290f3eb3a8bc9e64855c052310a7ecb4f6f139/analysis/1407333230/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lunari%20Race%20V1_6%20NMM%20Installer-21602-1-6.7z?fid=109014&ttl=1535790605&ri=8192&rs=8192&setec=546da98b2bd1fabd55bc6a3457c2a8c5"
    },
    {
      "fileId": "1000005266",
      "name": "Lunari Race V1_61 NMM Installer",
      "version": "1.61",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "94597",
      "fileName": "Lunari Race V1_61 NMM Installer-21602-1-61.7z",
      "uploadedUnix": "1359310047",
      "modVersion": "1.61",
      "virusScanUrl": "https://www.virustotal.com/file/e121c1c8c1aa891b22f2e349fc7aece784e7559d88f9c2ec7386da7c0658ff7b/analysis/1407382241/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lunari%20Race%20V1_61%20NMM%20Installer-21602-1-61.7z?fid=1000005266&ttl=1535790605&ri=8192&rs=8192&setec=e6eb025cec56c56f4a4a09f24b958d15"
    },
    {
      "fileId": "1000006147",
      "name": "Lunari Race V1_62 NMM Installer",
      "version": "1.62",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "94618",
      "fileName": "Lunari Race V1_62 NMM Installer-21602-1-62.7z",
      "uploadedUnix": "1359647487",
      "modVersion": "1.62",
      "virusScanUrl": "https://www.virustotal.com/file/f17533262631726fa5f4ea3d9f59ac09ab89cf07b37c648cddfedd87f3fe30dd/analysis/1407389070/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lunari%20Race%20V1_62%20NMM%20Installer-21602-1-62.7z?fid=1000006147&ttl=1535790606&ri=8192&rs=8192&setec=6254b154ac6a6af89f707c4d33abd907"
    },
    {
      "fileId": "1000014220",
      "name": "Lunari Race V1_63 NMM Installer",
      "version": "1.63",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "94998",
      "fileName": "Lunari Race V1_63 NMM Installer-21602-1-63.7z",
      "uploadedUnix": "1362168596",
      "modVersion": "1.63",
      "virusScanUrl": "https://www.virustotal.com/file/64563e9e41bd62d173a22fa86bb5e82d384be7b86b07abf43d2e001f743808a4/analysis/1407446354/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lunari%20Race%20V1_63%20NMM%20Installer-21602-1-63.7z?fid=1000014220&ttl=1535790607&ri=8192&rs=8192&setec=703c1d6e4ae297a5dac50bb9747627ac"
    },
    {
      "fileId": "1000121989",
      "name": "Lunari Race V1.70 NMM Installer",
      "version": "1.70",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "108090",
      "fileName": "Lunari Race V1.70 NMM Installer-21602-1-70.7z",
      "uploadedUnix": "1408001096",
      "modVersion": "1.70",
      "virusScanUrl": "https://www.virustotal.com/file/e43c5a2023cc6dce0e280ba4ca90f6dec99e4a17e10489361c3147bc7bef2353/analysis/1408178121/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lunari%20Race%20V1.70%20NMM%20Installer-21602-1-70.7z?fid=1000121989&ttl=1535790607&ri=8192&rs=8192&setec=b66b93731d70919379b7253e6b3bcacb"
    }
  ]
}