{
  "modId": 21626.0,
  "modName": "Badmagic - Thieves Guild Enchants",
  "summary": "Will be amazed if this hasn\\'t been done already but I fail at searching apparently so...\r\n\r\nChanges broken and/or useless enchantments on thieves guild armour sets.\r\n\r\nSee mod page description or \\'Readme - Badmagic - Thieves Guild Enchants - v1.0.txt\\' for full info.",
  "descriptionHtml": "Foreword:\r\n\r\nWill be amazed if this hasn\\'t been done already but I fail at searching apparently so...\r\n\r\nChanges broken and/or useless enchantments on thieves guild armour sets.\r\n\r\n\r\nDescription:\r\n\r\nVery basic mod, simple swaps what are in my opinion useless and/or completely broken enchantments on the vanilla thieves guild armour sets available to the player.\r\n\r\nFirst the boots, in vanilla they have Fortify Pickpocket...\r\n\r\nGreat idea Beth, next time if you had bothered to actually check it you just might have noticed that this enchantment and potions with the effect do the exact opposite of what it claims making it entirely useless unless you are RP\\'ing a complete and utterly incompetent thief who gets caught regardless of skill, good job...\r\n\r\nThese now carry the \\'Muffle\\' enchantment, as this has no variation in strength all sets carry the same basic \\'Muffle\\' effect, these include as follows:\r\n\r\nThieves Guild Boots (Basic set as issued to the player)\r\nThieves Guild Boots (If chosen as your \\'upgrade piece\\' during TG chain)\r\nGuild Masters Boots (Player version as received on completion of full TG chain)\r\n\r\nNext we have the Gloves, in vanilla they have Fortify Lockpicking...\r\n\r\nWhile not offensively broken like Fortify Pickpocket it is frankly a wasted enchantment slot, it is neither needed nor wanted, if you like Fortify Lockpicking then cool but this is probably not the mod you are looking for, move along. *waves hand*\r\n\r\nThese now carry the \\'Sneak\\' enchantment, thieves are sneaks... it\\'s as close to using pickpocket as possible without breaking that mechanic unlike above.\r\n\r\nUnlike the \\'Muffle\\' enchantment on the boots Fortify Sneak can and does come in varying levels of strength, the actual enchantment does the following:\r\n\r\nX% harder to detect while sneaking.\r\n\r\nI\\'ve weighed up the pro\\'s and cons of varying levels and instead of making new custom enchantments have re-used the existing levels available in the base game, as such the new sets of gloves are as follows.\r\n\r\nThieves Guild Gloves 20% (Basic set as issued to the player)\r\nThieves Guild Gloves 30% (If chosen as your \\'upgrade piece\\' during TG chain)\r\nGuild Masters Gloves 40% (Player version as received on completion of full TG chain)\r\n\r\nLast but not least a note on the Hood and Armour vanilla enchantments.\r\n\r\nIn vanilla the hood has +Barter, while not really that useful unless you\\'re using mods to really limit funds I felt it was a very fitting enchantment for thieves selling their ill gotten gains.\r\n\r\nIn vanilla the armour has +Carry Weight Capacity, again, out with mods that artificially make it harder its hardly the most useful enchantment but again it makes a sick sort of sense lugging god only knows what you have pilfered back to vendors so I left this unchanged.",
  "categoryId": "24",
  "version": "1.0",
  "author": "Badmagic",
  "createdUnix": "1344037028",
  "updatedUnix": "1344037090",
  "containsAdultContent": false,
  "uploadedBy": "Badmagic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "78574",
      "name": "Badmagic - Thieves Guild Enchants",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31",
      "fileName": "Badmagic - Thieves Guild Enchants-21626-1-0.7z",
      "uploadedUnix": "1344037090",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8b566ecabcb5da6a40148f91091d5048ad0cc746d47e6d5f1a8cbd8d2420c979/analysis/1407067446/",
      "changelogHtml": " Initial Upload <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Badmagic%20-%20Thieves%20Guild%20Enchants-21626-1-0.7z?fid=78574&ttl=1535790641&ri=8192&rs=8192&setec=b15e4dbce59cfdded09ebd5ad3609a75"
    }
  ]
}