{
  "modId": 21639.0,
  "modName": "Dawnguard Custom Race Vampire Fix",
  "summary": "Quick description how to fix a bug which occurs when playing with custom race.\r\n\r\n.....not all chicks are sexy after this......",
  "descriptionHtml": "Started to play Dawnguard today and was pretty much annoyed when you found out you can\\'t continue playing as a vampire with your custom race because after turned into a vampire and given the first task the Elf guy just says something like \\\"I won\\'t talk to mortal etc....?\r\n\r\n                                                              Well…look no further for I have the solution for you!!!\r\n\t\t\t                                  \r\n\r\n_____________________________________________________________Overview______________________________________________________________________________________________\r\n\r\n                                                                                           - About -\r\n                                                                                          - Changes -\r\n                                                                                   - Recommendations -\r\n                                                                                          - HowTo -\r\n                                                                                    - Troubleshooting -\r\n                                                                                          - Credits -\r\n\r\n______________________________________________________________About___________________________________________________________________________________________\r\n\r\nThis is a quick description how to fix your custom race using Construction Kit (CK) to be able to play as a vampire in Dawnguard.\r\n\r\nPlease try this method yourself first. \r\nIf you are unable to do so send me a message or leave a request in comments section and I will try to help you out. \r\nIt might take some time though because I\\'m getting a lot of requests at the moment.\r\n\r\n_____________________________________________________________Changes__________________________________________________________________________________________________\r\n\r\nChangeLog (11.08.12): \r\n- Removed edited esp for Ashen Race!!\r\nAuthor of this race provides fix now himself. Download his version not mine anymore!\r\nHere is the link to his page: http://skyrim.nexusmods.com/mods/8583\r\n\r\nChangeLog (07.08.12): \r\n- Removed edited esp for Monnshadow Elves!!\r\nI didn\\'t have the permission from the author of the original file.\r\nIf you want fixed esp for Moonshadow Elves check out his mod!\r\n\r\n- Removed edited esp for Temptress Race!!\r\n I didn\\'t have the permission from the author of the original file.\r\nIf you want fixed esp for Temptress race check out his mod! \r\nLink: http://skyrim.nexusmods.com/mods/18717\r\n\r\nChangeLog (06.08.12):\r\n- Yg Nord Race tested with Better Vampires mod, which I strongly recommend, works perfectly!\r\n (see Recommendations section  for the link)\r\n\r\n- FF Race tested with Better Vampires mod, which I strongly recommend, works perfectly!\r\n (see Recommendations section  for the link)\r\n\r\n- Moonshadow Elves Race tested with Better Vampires mod, which I strongly recommend, works perfectly!\r\n (see Recommendations section  for the link)\r\n\r\n- Ashen Race tested with Better Vampires mod, which I strongly recommend, works perfectly!\r\n (see Recommendations section  for the link)\r\n\r\nSo here is how to do this:\r\n- Delete your Custom Race mod completely!\r\n- Delete all Vampire mods which changes vampirescript.pex or add new perks or abilities!\r\n- Download and install your Custom Race again. (manually or via NMM)\r\n- Download and install Better Vampires mod. (manually or via NMM)\r\n- In your load order put Better Vampires.esp after any mod which adds new races. \r\n\r\nFor example:\r\n\r\n                    | skyrim.esm\r\n                    |_other esm.esm\r\n                    |_ some mods.esp\r\n                    |_your Custom Race.esp\r\n                    |_Better Vampires.esp\r\n                    |_other mods BUT NO Custom races here.esp\r\n\r\n\r\n- Backup and overwrite your old esp with mine.\r\n- Load any save before Harkon turns you into vampire.\r\n(you might have some resistances and abilities already - just ignore them for now!)\r\n- Let Harkon bite you first to get vampire Lord power.\r\n- Finish the Vampire Lord course and take the first quest from him.\r\n- Go to \\\"Powers\\\" and look for the Better Vampire mod options (should be on the bottom).\r\n- Open the menu and use the \\\"use custom race\\\" option (if you use custom race) or \\\"reset\\\" option (if you use vanilla race). \r\n- Then see instructions which will appear in the upper left screen!\r\n- Play!\r\n\r\nChangeLog (05.08.12):\r\n- Added \\\"fixed\\\" esp for Ashen Race in downloadable section. Vampire race tweaked to be playable so if the game won\\'t change you automatically you can use \r\n\\\"player.setrace OraezeRaceVampire\\\"\r\ncommand or change via showracemenu. Backup your save and old esp before using mine!\r\n\r\n- Added \\\"fixed\\\" esp for Moonshadow Elves race in downloadable section. Vampire race tweaked to be playable so if the game won\\'t change you automatically you can use\r\n\\\"player.setrace MoonshadowElfRaceVampire\\\" \r\ncommand or change via showracemenu. Backup your save and old esp before using mine!\r\n\r\nChangeLog (04.08.12):\r\n- I have uploaded edited Temptress race esp as requested for those who can\\'t do it themselves. Please backup your save and old esp before using mine!\r\n- I will add some edited esps for various custom races done as request for people they have issues while doing this.\r\n\r\n________________________________________________________Recommendations_______________________________________________________________________________________________\r\n\r\n- Your vampire might have only few or none of the vampire abilities it should have while using this method. that\\'s why I recommend to download Better Vampires by Brehanin mod aswell.\r\n\r\nLink: http://skyrim.nexusmods.com/mods/9717\r\n\r\nThis mod MIGHT BE NECESSARY in order to play my esps! \r\n\r\n_____________________________________________________________HowTo___________________________________________________________________________________________________\r\n\r\nStep 1) Start your Creation Kit.\r\nStep 2) Load Skyrim.esm first so the program won\\'t freeze when saving esp (as it did to me).\r\nStep 3) Click always yes to all if asked. (Don\\'t worry nothing bad will happen it\\'s just Creation Kit bug)\r\nStep 4) Load your custom race esp.\r\nStep 5) set it as an active file (so you will modify the current esp)\r\nStep 6) or don\\'t set it as an active file (so you can duplicate your custom race and make new tweaked esp from it so the original race stays intact)\r\nStep 7) go to the object window click on character and menu will pop up. There find a file called Race and double click it\r\nStep 8) find your race in the list in the right corner of this window, double click it and the detailed information of this race will show.\r\nStep 9) all you have to do here is to find the text field in this new window witch should be located on the right corner with a tittle \\\"Keywords\\\" go there right click in the empty column select \\\"Add\\\" and type the word \\\"vampire\\\" into the filter. It will find a reference called \\\"vampire\\\" click on it, click on OK and this reference should be now added to the Keywords field right under the \\\"ActorTypeNPC\\\"\r\nStep 10) close the whole race window by clicking on OK button and save your work\r\nStep 11) Voila!! that\\'s it! Now you can enjoy playing Dawnguard as a vampire with your custom race!!\r\n\r\n_________________________________________________________Troubleshooting_______________________________________________________________________________________________\r\n\r\n- These changes should be possible with all custom race mods since it\\'s only a small tweak but I might be wrong.\r\n\r\n- There may be possible crashes in some Dawnguard areas while saving the game and trying to load it again after shutting down the game or using showracemenu related commands...I don\\'t know why but I can\\'t find out what is causing this at the moment. \r\n\r\n- IF YOUR GAME STILL CRASHES while reloading certain save, load your older save and it should work again. (After this you can load your latest save and it will work)\r\n\r\nI\\'m currently saving the game not so often and I DON\\'T USE QUICK SAVE option and it works for me flawlessly. I\\'m also pretty sure this bug isn\\'t caused by my tweak since I edit only a single reference which has no impact on the game processes.\r\n\r\n- If you want to create new esp to maintain your original one be aware of one thing...go again to the list of all races, find your custom race open it by double clicking on it and change the name of this race. You will be warned you are trying to override the name of this race and asked if you want to create new copy...if its what you desire click on \\\"yes\\\" button and the duplicated race with your new name should be added right after the custom race in the list of races..that means if you want to do something you need to edit your duplicated race you just created not the original one! :) \r\nAfter this step right click on your duplicated race in the list and choose the option \\\"Use Info\\\". If these two windows are empty forget about the whole step if you aren\\'t CK profi (which I\\'m not) because if you start the game and choose your duplicated race via showracemenu for example your race will have NO MESHES and NO face TEXTURE only burned Astrid body texture without hands and feet. \r\n\r\n...Well don\\'t ask me why I\\'m not a Guru like I said maybe someone else will know what to do...\r\nAnyway if you still want to continue doing this don\\'t forget to save your results and make a new esp name for it.\r\n\r\nOtherwise just do what I said in Step 5 and make the selected esp file active.\r\nI know you won\\'t like me for overwriting your existing race and forcing it to be a vampire ...but hey I haven\\'t found any other solution yet and I want to play without waiting for something!\r\n\r\nAlso note you can remove this vampire reference from the Keywords as easy as you put it in if you want to be no bloodsucker anymore!\r\n\r\n____________________________________________________________Credits_______________________________________________________________________________________________________\r\n\r\nAll credits for the files I upload go to their respective owners. If they are unhappy with my work and wish me to remove their files (if not granted permission) tell me and I will do so immediately.\r\n___________________________________________________________________________________________________________________________________________________________________________\r\n\r\n\r\nI hope this will help you out, as it did for me, so you can enjoy playing this new expansion without getting pissed off after few minutes!\r\n\r\nExcuse me for possible grammar mistakes as English isn\\'t my native language and I\\'m writing this guide at 6 am after like 8 hours of testing and raging!\r\n\r\nHave fun!\r\ndeTreborg",
  "categoryId": "34",
  "version": "2.1",
  "author": "detreborg",
  "createdUnix": "1344052977",
  "updatedUnix": "1344265762",
  "containsAdultContent": false,
  "uploadedBy": "detreborg",
  "primaryFile": null,
  "files": [
    {
      "fileId": "79228",
      "name": "FF Race esp",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23",
      "fileName": "FF Race esp-21639-1-0.rar",
      "uploadedUnix": "1344264609",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/984920167669d2f40b9afa2f06f64061730ca67ad2c5633d25699100b6e7363c/analysis/1407074237/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FF%20Race%20esp-21639-1-0.rar?fid=79228&ttl=1535790660&ri=8192&rs=8192&setec=2f670c08b2c0ef396e6e31496401e178"
    },
    {
      "fileId": "79231",
      "name": "Yg Nord Race esp",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "57",
      "fileName": "Yg Nord Race esp-21639-1-0.rar",
      "uploadedUnix": "1344265762",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/37d4770324ad64fcd4a0d57f32a90ca4832d6fe52125b3d71b12670f8f6f5fd0/analysis/1407074283/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Yg%20Nord%20Race%20esp-21639-1-0.rar?fid=79231&ttl=1535790661&ri=8192&rs=8192&setec=2c26345bd8d52c62673b2733ea03ebc5"
    }
  ]
}