{
  "modId": 21630.0,
  "modName": "Attractive Wood Elf Follower Redesigned",
  "summary": "An attractive wood elf awaits companionship at the Drunken Huntsman, will you be the one that asks her to follow you on your adventures through Skyrim ?",
  "descriptionHtml": "**Update**\r\nBecause of recent events with real life updating this mod an my other follower mod will be postponed till further notice, this does not mean I am abandoning these mods. I just need to take care of a few things outside of Skyrim, among them reformatting my PC and backing everything up, I should be back up an running sometime around June, yes that\\'s a ways off but that\\'s just how real life is :/ lolz. By that time I should be ready to *Actually* create stand-alone versions that wont require you to hunt down and download all the needed mods per follower :).\r\n\r\n\r\n**Attractive Wood Elf Follower Redesigned**\r\n\r\n**Introduction**\r\n\r\nThis is a complete overhaul of a previous mod that I felt had to be replaced as even I was starting to see some things wrong with it and felt it was time to start over.\r\n\r\nThis is my continuation of followers I am creating for Skyrim, so feel free to download an give me feedback where necessary. If there are any conflicts or other issues please post them up so I can fix them if it is due to my mod.\r\n\r\n**Description**\r\n\r\nThis mod adds a new attractive wood elf female follower named Gladriel *yes that is in reference to LoTR* to the Drunken Huntsman *In Whiterun*, she is based off of one of my own characters and is setup to auto level with the player and works just like any other follower, she is also able to be married if you so chose to as well. She is also equipped with some basic spells that she actually does use during combat.\r\n\r\n**Followers Layout**\r\nFull Leather armor *minus the helm*\r\nSteel sword\r\nhunting bow\r\n100 Steel Arrows\r\nHide Shield\r\n\r\n*Spells*\r\nFrostbite\r\nFlames\r\nSparks\r\nHealing *she actaully does use this spell during combat :O which surprised me*\r\n\r\nNote: All spells are set to be used in the left hand only, this way she can still attack with any other weapon unless there 2 handed.\r\n\r\n**Acquiring**\r\nEither during a current game or with a new game just head on over to the Drunken Huntsman located in Whiterun and she\\'ll be waiting inside *Most likely sitting down someplace.\r\n\r\n**Requirements** (These are Must have in order to get the appearance in the screenshots!)\r\n\r\n**Install in this order for best results** If there are any issues with the appearance please post it.\r\n\r\nCBBE skin texture V2 V3 plus Thepal and UNP compatible by navetsea\r\nhttp://skyrim.nexusmods.com/downloads/download.php?id=31779 *Main File*\r\n\r\nCoverwomen by mrLenski\r\nhttp://skyrim.nexusmods.com/download/11347 *Look #3*\r\n\r\nImproved Eyes Skyrim by missjennabee\r\nhttp://skyrim.nexusmods.com/mods/9249 *Updated*\r\n *Note that if your using another eye replace that you should probably pass on this just incase its not compatible* \r\n\t\r\nImproved Freckles Skyrim by missjennabee\r\nhttp://skyrim.nexusmods.com/mods/16147 *Updated\r\n\r\nApachiiSkyHair by Apachii\r\nhttp://skyrim.nexusmods.com/download/68476 *Hair style*\r\n\r\nApachiiSkyHair by Apachii\r\nhttp://skyrim.nexusmods.com/download/76734 *Adds 10 more female hair styles*\r\n\r\n**Installation**\r\nIts actually very simple if your familiar with TES games and there file systems, Basically just copy and paste the contents into the data folder in the games main directory.\r\n\r\nExample:\r\nC:\\\\Program Files (x86)\\\\The Elder Scrolls V Skyrim\\\\Data\r\n**just drop the new files into the data folder and then load up the Skyrim Launcher and check the new .esp file, which should be labeled as AttractiveWoodElf_F and that should be all your need to do other then installing the mods I have posted in **Requirements** :D.\r\n\r\n*Installing with NMM *Nexus Mod Manager*\r\n\r\nSimply open up NMM and goto the mods Tab and click on the *Add mod from file* and goto where you just downloaded this to and click on the mod for NMM to then prep it for installation *NMM will auto unpack .zip and .rar files so don\\'t worry about doing that*. Then activate the mod and that\\'s all there is to it quite simple actually and to uninstall for what ever reason just deactivate it and NMM will remove all traces of the mod.\r\n\r\n**Conflicts**\r\nNone that I am aware of at the moment, this mod was fully tested with and without UFO and works completely with it installed.\r\n\r\n**Latest Version**\r\n\r\nv1.0 Updated Version, more feminine and in general more appealing. .BSA added for easier installation and NMM compatible. \r\n\r\nv0.9 Initial Release\r\n\r\n**Future Plans*\r\nLater I plan on making more follower mods based off my characters :D.\r\n\r\n**My other Follower Mods**\r\n\r\nAttractive Nord Male Follower\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=16606\r\n\r\n**Permissions**\r\nApachii has given me permission to use content related to her mod so long as it doesn\\'t over write her\\'s, as it is my mod only references to content within her mod. Regarding navetsea\\'s, mrLenski\\'s and missjennabee\\'s textures etc , this mod only uses them for reference for the overall appearance viewed in the Screenshots and does not actually use them in this mod *does not overwrite them or replace them*. \r\n\r\n**Terms of Use**\r\nThis mod is not to be modified or used in any way other then what I have intended, it is not to be uploaded to any other site other then the nexus, and by me only, it is not to be used in any other mods or games without my consent. ",
  "categoryId": "66",
  "version": "1.0",
  "author": "Odysseus",
  "createdUnix": "1344044160",
  "updatedUnix": "1344044261",
  "containsAdultContent": false,
  "uploadedBy": "Odysseus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "78586",
      "name": "Attractive Wood Elf Follower Redesigned",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "688",
      "fileName": "Attractive Wood Elf Follower Redesigned-21630-1-0.rar",
      "uploadedUnix": "1344044261",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a62c8a4cbf061deb23d7bf39059915508c8527033cbb52acb9f18a5da0d0b884/analysis/1407067624/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Attractive%20Wood%20Elf%20Follower%20Redesigned-21630-1-0.rar?fid=78586&ttl=1535790648&ri=8192&rs=8192&setec=3a6ffd2f0f8aef4f896f35852c1a70c4"
    }
  ]
}