{
  "modId": 21667.0,
  "modName": "Dawnguard Vampire Races",
  "summary": "Ever liked the monsterous faces of the npc vampires in dawnguard? Were you upset that you didnt get the batnose, or that your face wasnt as monsteerous as theirs? Well look no further.",
  "descriptionHtml": "The goal of this mod is to allow your charecter the opportunity to select facial features that, when you become a vampire, are monsterous, like the npc vampires. When you install this mod, you will get a duplicate race of each race. One of those, is a vampire race. Customize it how you wish. When you get to the complection slider, slide it all the way over, and it should be more vampiric looking, of course, it may already be all the way over already. Then, when you get to the noses, towards the right side, the noses are deformed, these are the bat noses that the npc\\'s have. Once again, MAKE SURE THE SLIDER FOR COMPLECTION IS ALL THE WAY TO THE RIGHT, for the right look. You have two eye choices, the human/elf vampire eyes or the nord vampire eyes.\r\n\r\nNote: Once you select your race, you have vampires sight power, resist poison and disease, This is because the default races do not have the right facial features to look like npc vampires, only the vampire races do. After you get vampirism in the Dawnguard expansion questline, your charecter will have all the normal vampire powers. Before this, some NPC\\'s, such as serana, realize that you\\'re a vampire, and this will not conflict with becoming one via the questline. \r\n\r\nEDIT: I know before i said there were not going to be any bug fixes, but i have been less busy lately, and it is selfish to not try if i have the spare time, so bear with me, and updates should be rolling out soon.",
  "categoryId": "34",
  "version": "1.00",
  "author": "Raelord",
  "createdUnix": "1344094237",
  "updatedUnix": "1344095402",
  "containsAdultContent": false,
  "uploadedBy": "raelord",
  "primaryFile": null,
  "files": [
    {
      "fileId": "78695",
      "name": "Dawnguard Vampire Races",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "Dawnguard Vampire Races-21667-1-00.7z",
      "uploadedUnix": "1344095402",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/69ae99571d16ba984db3f90a25a7f03a38c5984c5f094d72902bc631bb303ffa/analysis/1407068883/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnguard%20Vampire%20Races-21667-1-00.7z?fid=78695&ttl=1535790714&ri=8192&rs=8192&setec=3663aa93c0b1b299efa95f33afb723f1"
    }
  ]
}