{
  "modId": 21708.0,
  "modName": "Crossbow Enhancement - SIlver",
  "summary": "This mod adds new silver recipes for bolts and a new crossbow based on silver = dead vampire. Requires Dawnguard. Updated now! More Stuff added.",
  "descriptionHtml": "Added new bolt types:\r\nSilver: 20 silver damage (undead damage)\r\n\r\nFlaming Silver: 20 points fire damage every second for 4 seconds. 20 silver damage.\r\n\r\nShining Silver: 20 sun damage every second for 5 seconds, halved damage against non-undead and extra damage against vampires. 20 points silver damage.\r\n\r\nTurning Silver: turns up to level 120 undead for 10 seconds. 20 silver damage.\r\n\r\nDraining Silver: Drains 20 magicka and stamina every second for 4 seconds. 20 silver damage.\r\n\r\nParalyzing Silver: Paralyzes target for 6 seconds. 20 silver damage.\r\n\r\nNew Crossbows:\r\nVan Helsing 1: 30 silver damage per shot and 50% armor penetration as well as extra damage to undead from normal script.\r\n\r\nVan Helsing 2: Nothing. A clean non-enchanted weapon, just the base bonus to undead damage and 50% armor penetration.\r\n\r\nVan Helsing 3: 25 magicka damage, 5 magicka, health, stamina absorbtion per shot. 50% armor penetration, bonus damage to undead.\r\n\r\nWhy did I revise these enchantments?\r\nFor one they can be used infinitely, meaning with the old version you could spam a powerful enchantment, in this model, you spam a much weaker enchantment.\r\nSecondly, it fits any difficulty now.\r\nAnd the crossbows themselves have also had a revision on damage.\r\n\r\n1 and 3 have enchants that last forever (meaning it never goes empty and you can keep using the enchant without carrying soul gems)\r\n\r\nNew Crossbows added to NPCs:\r\nBandits, legion, and stormcloaks, as well as basic guards have access to crossbows now (I have made 2 versions, base crossbows, and guard crossbows)\r\nthe base crossbow is something you will see from levels 1-40 as soon as you reach 50+ you start seeing guard crossbows that deal more damage.\r\nI nerfed their crossbows based on the fact they become overpowered in large groups with the crossbows a player would use in my mod.\r\nAlso added new versions of bows to guards, legion and stormcloaks (to keep them using bows \"sometimes\" but still have a bow that does higher damage)\r\n\r\nThere is an option to have no NPC bows/xbows added.\r\n\r\nNow adds things to vendors.\r\n\r\nWhy did I revise this mod?\r\nSimply because of several complaints, and after reviewing things, it may have been a bit overpowered especially for people who don't play on Very Hard difficulty.\r\nAnd of course by requests that certain things not be added, such as crossbows and higher damage bows for NPCs.\r\n\r\nDoes not require any perks to craft anything, but does require crafting materials.\r\nRequires: Dawnguard",
  "categoryId": "55",
  "version": "V5",
  "author": "Hadoumastery",
  "createdUnix": "1344131864",
  "updatedUnix": "1384210937",
  "containsAdultContent": false,
  "uploadedBy": "hadoumastery",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000077920",
      "name": "Crossbow Enhancement Revision",
      "version": "V5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29",
      "fileName": "Crossbow Enhancement Revision-21708-V5.rar",
      "uploadedUnix": "1384210937",
      "modVersion": "V5",
      "virusScanUrl": "https://www.virustotal.com/file/f4612dbbc66d8c9ae657344e2314288ca3b3fc89efbf76210624043d72d0ad21/analysis/1407789372/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Crossbow%20Enhancement%20Revision-21708-V5.rar?fid=1000077920&ttl=1535790782&ri=8192&rs=8192&setec=43eef211033956f97f1d61b657c1c82d"
    }
  ]
}