{
  "modId": 21700.0,
  "modName": "House of Horrors Alternate Ending",
  "summary": "Adds an optional good-guy ending to the House of Horrors quest.",
  "descriptionHtml": "The The House of Horrors quest is terrible for good players. You get suckered into the quest as a mission of good, then forced to kill a guy. Then you\\'re told another guy is imprisoned. A good player would still want to save him, but if you do that and follow him, Molag Bal forces you to beat him to death. There is no option to refuse and free the guy - the nicest thing you can do is leave him there to rot.\r\n\r\nThat\\'s just horrible, so I\\'ve made a new option. Now when Molag Bal gives you the Rusty Mace to beat Logrolf with, the front door will lock at this point, forcing you to make a decision. If you want to have the mace, complete the quest as normal by killing Logrolf (repeatedly). If you don\\'t want to murder an old man, just throw it on the ground right away[color=goldenrod]*[/color]. The mace will immediately disappear, Logrolf will be released (he runs away and you\\'ll never see him again), and you\\'ll be cursed. Curse of Molag Bal is a 50% weakness to fire, and it prevents you from maintaining divine blessings[color=cyan]**[/color]. To finish the quest, simply visit any Shrine of Stendarr. This will remove the curse, allowing you to select any divine blessing once again. You\\'ll also be awarded a new ability called Stendarr\\'s Mercy, which grants you a small bonus to all weapon attacks against daedra[color=orange]***[/color].\r\n\r\nAnd yes, this totally works in existing games, even when you\\'re in the middle of this quest. As long as you have not yet started to beat Logrolf to death, you can still choose this alternate ending. Completing the quest using this new option still counts as finishing a Daedric Quest, but of course won\\'t count toward Oblivion Walker because you aren\\'t getting the artifact.\r\n\r\nThe best part? I only edited three game files (the quest, the quest\\'s script, and the Rusty Mace), so this should be compatible with anything. Every other file included in this is new.\r\n\r\n\r\nGood guys will also want to check out Iceburg\\'s [url=http://skyrim.nexusmods.com/mods/22818]Boethiah for Good Guys[/url] mod so they can complete another daedric quest without being evil.\r\n\r\n\r\n\r\n[size=1][color=goldenrod]*[/color]You must drop the weapon before killing Logrolf the first time to trigger the refusal ending. Beating on him is fine as long as you don\\'t kill him once. After that you can only complete the quest the normal way.\r\n[color=cyan]**[/color]Blessings will be applied as normal, but will shut off within 5 seconds as long as you have the curse.\r\n[color=orange]***[/color]Stendarr\\'s Mercy adds 10 base damage and 5 critical damage to any weapon when used against daedra. It\\'s very similar to how silver weapons work on undead. The bonus is intentionally tiny - it exists to give you some reward, but it\\'s not so large that it really matters if you\\'d prefer to keep the Mace of Molag Bal.[/size]",
  "categoryId": "35",
  "version": "1.00",
  "author": "Kevin Kidder",
  "createdUnix": "1344125696",
  "updatedUnix": "1344125724",
  "containsAdultContent": false,
  "uploadedBy": "sushisquid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "78818",
      "name": "HouseOfHorrorsAlternateEnding",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "HouseOfHorrorsAlternateEnding-21700-1-00.zip",
      "uploadedUnix": "1344125724",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/321e7097609820eec22400f1978f27f1f15cad014c589ad6d2ab64e7acb5bd0e/analysis/1407070202/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HouseOfHorrorsAlternateEnding-21700-1-00.zip?fid=78818&ttl=1535790766&ri=8192&rs=8192&setec=e1d4d32fe2db7933b23a320ef74d3d76"
    }
  ]
}