{
  "modId": 21710.0,
  "modName": "Saviik City",
  "summary": "Saviik City is a lore-heavy lore-friendly city between Ivarstead and Riften. It is currently in alpha stage and under heavy development.",
  "descriptionHtml": "[center][img]http://img837.imageshack.us/img837/8382/saviikcityalpha.png[/img][/center]\r\n\r\n\r\n[u][size=\"5\"][b][color=\"#00BFFF\"]Description[/color][/b][/size][/u]\r\n\r\nMore information on the mod itself can be found on the [url=http://forums.nexusmods.com/index.php?/topic/680113-wip-saviik-city]official thread[/url] in the Nexus forums.\r\n\r\nSaviik City is currently in an [b]ALPHA[/b] phase. This is a true alpha, not an alpha or beta that is simply an excuse for having bugs, or to build hype and get extra feedback. When the mod will turn from Alpha to Beta and Beta to Gold is unknown and will depend on how development goes. Development might be slow at times and there may be breaks involved, but I have a busy schedule right now both in real life and working on other projects. Constructive feedback and suggestions will help with development speed, so if you like the mod and wish it to succeed, that is the best way for you to help make it happen. \r\n\r\nDespite being in an Alpha phase and not being close to being finished, the main above-ground city area is fully functional and a city that the player can play out of while living in Dragon's Rest basement. All crafting equipment and merchants the player should ever need are functional. The above-ground city area is mostly finished for now and going through a polishing phase while the Fortress is being done. This does not mean the city is done forever as there are plenty of additions and improvements I will make in the future. But for now, the Fortress is the next big focus.\r\n\r\nQuests have not been started yet and will not be included until Phase 3 and 4. \r\n\r\n[list]\r\n[*]There is no voice acting, and there are no plans for voice acting to be included. This will be explained in the FAQ which is under construction. \r\n[*]All pathways are navmeshed and most side areas are navmeshed. There are a few, mostly small/unimportant areas that still need navmesh. All navmesh is done by hand, though some interiors were generated and then improved by hand.\r\n[*]Most NPCs have basic packages and about half have more advanced packages. \r\n[*]Guards are static, not dynamic, and do not follow shift change schedules. They should however work for crime detection and protecting citizens. \r\n[*]The Innkeeper is able to rent a bed upstairs. \r\n[*]There is a basic room for the Dragonborn in the Dragon's Rest basement for you to stay while there is major construction done to the Fortress due to a dragon attack.\r\n[*]There are two mercenaries that can be hired in the Inn.\r\n[*]There is a new buff, Blessing of the Dremdovah, which can be obtained by praying at the altar in the Dovah Temple. \r\n[*]All crafting equipment can be found around town.\r\n[*]Numerous types of merchants around town.\r\n[*]This is a basic list of things you can expect in Saviik City but is by far not a complete 'feature list', nor does it include everything planned or being worked on.\r\n[/list]\r\n\r\n\r\n[u][color=\"#00BFFF\"][size=\"5\"][b]Changelogs[/b][/size][/color][/u]\r\n\r\n[b]Changelogs v0.5.5[/b]\r\n\r\n[b]Interior[/b]\r\nAdded a jail (not finished cluttering)\r\nAdded more clutter to some buildings from modders resources\r\n\r\n[b]NPC[/b]\r\nInventory of several NPCs improved upon\r\nIm'Kilaya will now eat at the Dragon's Rest basement\r\nDrek will now properly eat at Dragon's Rest basement\r\nThe Barkeeper and Wench in Dragon's Rest basement will now sell innkeeper goods\r\nMany NPCs have been given new unique armors, thanks to Omegared99 for letting me use his assets from his [url=http://skyrim.nexusmods.com/mods/10277]Armor Compilation[/url].\r\nMany NPCs have been given new jewelry, thanks to Severus for letting me use his/her assets from his/her [url=http://skyrim.nexusmods.com/mods/24549]Jewelry Collection[/url].\r\nMany NPCs have been given new weapons, thanks to 747823 giving permission to anyone to use his Weapons of the Third Era assets after his retirement.\r\nTorken Juvengar has been evicted and moved back to the barracks due to a change of plans, and his house will soon belong to someone else\r\nGave several NPCs with schedules more freedom of exactly when they start the schedule\r\nTremendously improved AI Data on all NPCs\r\nImproved Off Duty guard sandbox package\r\nThe Dragon's Rest innkeeper now correctly shows you your room\r\nAdded a unique horse to the stables\r\nJo'Vren and Mara will now unlock their doors properly during work hours\r\n\r\n[b]Items[/b]\r\nAll items in the Blacksmith area now belong to the Blacksmith\r\nAdded some missed items in the marketplace to the proper ownerlists\r\n\r\n[b]Exterior[/b]\r\nFinished the fortress cliff on the barracks side\r\nAdded more detail in front of Crin Garent's\r\nMade countless improvements to the areas at the bottom of the plataue's cliffs\r\nRetextured the land near the Dragonfire to look better from a distance\r\nReduced the object count by removing objects under ground that I had missed previously\r\nChanged one high-object rock area to use less rock objects\r\nAdded the jail entrance to the back side of the City Barracks.\r\n\r\n[b]Navmesh[/b]\r\nAll affected exterior cells have had edges found and been refinalized, which has greatly improved AI performance within the city\r\nSeveral interior navmeshes have had edges found and been refinalized, which has greatly improved AI performance within the interiors\r\nDragon's Rest has had navmesh updated around the new staircase\r\nNavmesh around the marketplace has been further improved, fixed several problem areas\r\nNavmesh around the stables updated and improved\r\nRemoved numerous old navmesh triangles that I had missed previously\r\nMinor improvements to various navmesh areas\r\nImproved navmesh used by crows on Dragon's Rest's rooftop\r\n\r\n[b]Bug Fixes[/b]\r\nFixed several markers with bad placement\r\nFixed countless havoc enabled objects with bad placement causing them to fall\r\nFixed several places in the terrain that were too low\r\nFixed a guard who was not leaning where she was supposed to\r\nFixed Rasha's opposite animations\r\nFixed Im'Kilaya's and Uthore's factions\r\nFixed Dragon Temple exterior door placement on both doors\r\nFixed the strange door and z-fighting inside Crin Garent's house\r\nFixed Crin Garent's cats not lying down \r\nFixed Crin Garent disappearing\r\nFixed guard placement on left guard tower\r\nFixed navmesh in right guard tower\r\nGreatly reduced the number of markers in town for performance (this won't be noticeable, mostly unused markers)\r\nGreatly reduced the Dragonfire's light radius for performance reasons\r\nFixed terrain being low in front of Jorgen's Liquor\r\nFinally fixed  the Grey Face Bug, for good this time!\r\nRemoved a duplicate Rowen Poralax\r\nSomewhat further optimized exterior lighting\r\nFixed Flaenia's voice\r\nOff Duty guards should no longer wander outside the barracks unless specifically told to\r\nFixed problems with the innkeeper not speaking with the player\r\nFixed havoc problems with plates at Ja'Tesh's market stall\r\nResized loading screens\r\n\r\n---------------------------------------------------------------------------------\r\n\r\n[u][color=\"#00BFFF\"][size=\"5\"][b]Alpha Warnings:[/b][/size][/color][/u]\r\n[list]\r\n[*]May or may not install using Nexus Mod Manager. If it does not, please let me know. You can manually install by extracting the files into your Data folder.\r\n[*]This mod is not nearly finished and many bugs are to be expected. This may include crashes. This mod is uploaded purely for Alpha testing, feedback, and suggestions. Please report any bugs you experience, especially crashes!\r\n[*]Putting items in containers is not suggested outside of the Dragon's Rest basement room.\r\n[/list]\r\n\r\n\r\n[u][b][size=\"5\"][color=\"#00BFFF\"]Known Bugs:[/color][/size][/b][/u]\r\n[list]\r\n[*]Sabre cats will appear to float up and down while standing idle. This is a Skyrim bug and there is currently nothing I can do about it. \r\n[*]Navmesh is not finished, so expect pathing issues for followers in some areas off of pathways.\r\n[*]Existing NPC dialogue is not working yet, any NPCs with dialogue will fly through it.\r\n[*]Carriages will not take the player to Saviik City. However, players can still use the carriage at Saviik City to go elsewhere. This is being worked on.\r\n[*]Building doors may not lock at night and thievery in general is not suggested in the city yet.\r\n[*]The stablemaster does not sell horses. This is being worked on.\r\n[*]Most NPCs are Essential (not a bug, most NPCs will continue to be essential as they are important to storylines. More non-essential NPCs will be implemented as time goes on).\r\n[*]You may experience CTDs when entering some interiors. This should mostly be fixed but please report any CTDs you experience.\r\n[/list]\r\n\r\n[u][size=\"5\"][b][color=\"#00BFFF\"]Troubleshooting[/color][/b][/size][/u]\r\nHaving trouble with floating grass? Go to SkyrimPrefs.ini and Skyrim.ini and add the following to the end of the [GRASS] section:\r\n\r\nbAllowLoadGrass=0\r\nbAllowCreateGrass=1\r\nbDrawShaderGrass=1\r\n\r\n[u][size=\"5\"][color=\"#00BFFF\"][b]FAQ[/b][/color][/size][/u]\r\n[i]Note: Please make sure you are using the most recent version of Skyrim before asking for help. I do not support Saviik City for older versions of Skyrim.[/i]\r\n\r\n[b]\"I have a pirated version of Skyrim and-\"[/b]\r\nSupport will not be given to players using a pirated copy of Skyrim. \r\n\r\n[b]\"Is it safe to clean Saviik City with TES5EDIT?\"[/b]\r\nNo! I clean it myself, both manually and automatically. It is not safe to clean Saviik City of deleted references due to the nature of the mod. Doing so will completely destroy the city by bringing in old objects, navmesh, markers, etc from the original wilderness it was built upon. If you think Saviik City has a dirty edit that breaks something ingame, please inform me, but leave all cleaning to myself.\r\n\r\n[b]\"Will Saviik City ever be on the Steam Workshop?\"[/b]\r\nI have considered it simply to help people learn about the mod. However, I do not support the workshop, and if I do upload it there all new patches will be released late and some future content may not be available from the workshop.\r\n\r\n[b]\"Can I translate Saviik City for other languages?\"[/b]\r\nYes, but please contact me first so that I know you are doing it. This way I can keep track of translations and share them below. It's not suggested to try translating yet though as there is plenty of dialogue to come and many existing dialogue and books may be changed.\r\n\r\n[b]\"May I upload Saviik City to another website or the Steam Workshop?\"[/b]\r\nNo, and do not bother asking. If you have a website you'd like to suggest I upload it to, please feel free to do so, but I will be handling any uploading so that I have full control of the upload. \r\n\r\n[b]\"BOSS/TES5EDIT is telling me that Saviik City has deleted Navmesh, will this cause problems?\"[/b]\r\nNo. Saviik City does have deleted navmesh, but that is because the city is built upon pre-existing land. To make AI work properly in the city I had to delete the original navmesh in affected cells and replace it with my own navmesh. This will not cause any problems and can safely be ignored.\r\n\r\n[b]\"Why is the BSA so big?\"[/b]\r\nSaviik City does not only use vanilla objects and textures. There are many new objects, textures, and items used within the city. However, many of the objects and textures included in the BSA may not be used, and as I get closer to a final product more meshes and textures will be purged from the BSA.\r\n\r\n\r\nI'd like to thank the following modders for their resources and permission to use their meshes/textures:\r\n\r\n[url=http://skyrim.nexusmods.com/mods/16525]Modder's Resource Pack[/url] - Oaristys and Tony67\r\n[url=http://skyrim.nexusmods.com/mods/17723]Birds of Skyrim[/url] & [url=http://skyrim.nexusmods.com/mods/17424]Pets of Skyrim[/url] - qasiermo\r\n[url=http://skyrim.nexusmods.com/mods/17423]Paintings & Frames[/url] - Artisanix\r\n[url=http://skyrim.nexusmods.com/mods/18602]Slofs Horses[/url] - alienslof\r\n[url=http://skyrim.nexusmods.com/users/2250922]Numerous Resources[/url] - Blary\r\n[url=http://skyrim.nexusmods.com/mods/10277]Armor Compilation[/url] - Omegared99\r\n[url=http://skyrim.nexusmods.com/mods/24549]Jewelry Collection[/url] - Severus\r\n[url=http://skyrim.nexusmods.com/mods/3871]Weapons of the Third Era[/url] - 747823",
  "categoryId": "53",
  "version": "0.5.5",
  "author": "Veltoss",
  "createdUnix": "1344136713",
  "updatedUnix": "1363563541",
  "containsAdultContent": false,
  "uploadedBy": "Veltoss",
  "primaryFile": null,
  "files": [
    {
      "fileId": "78850",
      "name": "Saviik City",
      "version": "v0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "25827",
      "fileName": "Saviik City-21710-v0-5.rar",
      "uploadedUnix": "1344137031",
      "modVersion": "v0.5",
      "virusScanUrl": "https://www.virustotal.com/file/dd42797a012bc5ceb0edab4b465f1ca55d2e04b575002d0d8c5f3af3800d709c/analysis/1407070513/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saviik%20City-21710-v0-5.rar?fid=78850&ttl=1535790787&ri=8192&rs=8192&setec=3ab26cc6cae82ebcf8a91a29266d26d7"
    },
    {
      "fileId": "79127",
      "name": "Saviik City",
      "version": "v0.5.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "32911",
      "fileName": "Saviik City-21710-v0-5-1.rar",
      "uploadedUnix": "1344227814",
      "modVersion": "v0.5.1",
      "virusScanUrl": "https://www.virustotal.com/file/1cb8b151c8c8fe342bd52f1f779857e2f22ef8cb5743b550a967257ba1f971be/analysis/1407073508/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saviik%20City-21710-v0-5-1.rar?fid=79127&ttl=1535790788&ri=8192&rs=8192&setec=bcb817f4f2136168929e4abd1b425ef9"
    },
    {
      "fileId": "80228",
      "name": "Saviik City",
      "version": "0.5.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "32672",
      "fileName": "Saviik City-21710-0-5-2.rar",
      "uploadedUnix": "1344567596",
      "modVersion": "0.5.2",
      "virusScanUrl": "https://www.virustotal.com/file/ff5ba73d0472c27e492d14d582e67b6a49b9b4c4750d2c10849cae7a3d344587/analysis/1407084332/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saviik%20City-21710-0-5-2.rar?fid=80228&ttl=1535790788&ri=8192&rs=8192&setec=c7b6920e27671d440ca392fe47bdbe9e"
    },
    {
      "fileId": "100736",
      "name": "Saviik City",
      "version": "0.5.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "32593",
      "fileName": "Saviik City-21710-0-5-3.rar",
      "uploadedUnix": "1353434423",
      "modVersion": "0.5.3",
      "virusScanUrl": "https://www.virustotal.com/file/b01eddf6f3adcbaac72bfc4aecb2736bc87764df80c58be660532eded90ff95c/analysis/1407271342/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saviik%20City-21710-0-5-3.rar?fid=100736&ttl=1535790789&ri=8192&rs=8192&setec=e4d7da4a9e3bc1bc5c01e165109d445c"
    },
    {
      "fileId": "101249",
      "name": "Saviik City",
      "version": "0.5.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "42676",
      "fileName": "Saviik City-21710-0-5-4.rar",
      "uploadedUnix": "1353697293",
      "modVersion": "0.5.4",
      "virusScanUrl": "https://www.virustotal.com/file/dcef3a418b2f4faf6fa98750661679d4500c1525460723d24b11d555a7b021f0/analysis/1407274827/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saviik%20City-21710-0-5-4.rar?fid=101249&ttl=1535790789&ri=8192&rs=8192&setec=0ebe62cd06f25f4d1c08c1dbd3630740"
    },
    {
      "fileId": "1000018339",
      "name": "Saviik City",
      "version": "v0.5.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "311812",
      "fileName": "Saviik City-21710-v0-5-5.zip",
      "uploadedUnix": "1363563541",
      "modVersion": "v0.5.5",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saviik%20City-21710-v0-5-5.zip?fid=1000018339&ttl=1535790791&ri=8192&rs=8192&setec=8a0f8daad638d108381317ae46c0439b"
    }
  ]
}