{
  "modId": 21724.0,
  "modName": "SkyRealism - Materials",
  "summary": "Realistic Item Weights and Crafting Recipes for Skyrim.",
  "descriptionHtml": "[img=center]http://static-2.nexusmods.com/15/mods/110/images/21724-1-1363657666.png[/img]\r<br />[center][i]Realistic Item Weights and Crafting Recipes for Skyrim[/i][/center][center][color=black][i]by MTichenor[/i][/color][/center]\r<br />\r<br />[color=yellow][b]NOTICE: [/b][/color]If you find a bug, please report it&#33; I can&#39;t fix it if I don&#39;t know about it. Also, send me a PM to contact me quicker if you have problems.\r<br />\r<br />[heading]Overview[/heading]Have you ever wondered how the Dragonborn can make a 30 weight unit breastplate from five 1 weight unit ingots and some leather strips? Or why thin swords weigh nearly as much as massive shields?\r<br />\r<br />I do.\r<br />\r<br />This mod alters the weight of all items in the game by converting their weights to pounds, and adjusting the crafting recipes to account for conservation of mass and the materials observed on the crafted items. In addition, recipes have been added for nearly all non-artifact weapons and armor in Skyrim. This mod is intended to be used with the other [color=#87CEEB]Sky[/color][color=#C3B091]Realism[/color] mods that I will be releasing. \r<br />\r<br />In addition to changing recipes and weapon and armor weights, this mod adds recipes to the game that require completion of various quests just like [url=http://skyrim.nexusmods.com/mods/8003]Complete Crafting Overhaul[/url] by Headbomb, and fixes nearly as many keyword related bugs as [url=http://skyrim.nexusmods.com/mods/4719]Weapons and Armor Fixes[/url] also by Headbomb.\r<br />\r<br />As an amateur metallurgist, it greatly irritated me that there were so many blatant errors in the relative weights of objects in Skyrim and how the crafting system works, so I have done my absolute best to address them. Before you complain about weights, please do some research of your own regarding the materials that all my calculations are based upon, or see the Appendix below.\r<br />\r<br />Here&#39;s a small list of some of the changes:\r<br />[list][*]Steel is now crafted by combining iron with charcoal, just as it was before we had blast furnaces. Steel is now much cheaper.\r<br />[*]Dwarven metal weight is based on naval brass, a bright yellow metal that&#39;s more resistant to corrosion under harsh conditions than most other metals.\r<br />[*]Corundum is a gem in real life. Consequently, all corundum in Skyrim has suddenly turned into copper. POOF&#33;\r<br />[*]One specific piece of dwemer metal will result in copper if smelted, rather than dwarven metal. Hint: Copper is orange.\r<br />[*]Orichalcum weight is based on manganese bronze, a very hard copper alloy. With a simple ammonia wash, this forms an olive tarnish.\r<br />[*]Ebony weight is based on an osmium/tungsten alloy, and is extremely heavy.\r<br />[*]All other materials are based on the real-world materials of the same name.\r<br />[*]Weight of all ores is based on volume of the ore and the specific gravity of it&#39;s real-world materials (being partially rock which is discarded on smelting).\r<br />[*]Weight of all ingots is based on volume of the ingot (20cm x 8cm x 4cm) and the specific gravity of it&#39;s real-world material.\r<br />[*]Weights of all armors and weapons was determined primarily through simple volumetric analysis, and the specific gravity of it&#39;s real-world materials, and then converted to pounds (rounded up).\r<br />[*]Crafting recipes now require all the materials observed on the item, and will always require more materials by weight than the finished product weighs.\r<br />[*]Tempering requirements have been reduced or eliminated, making it easy to get a few extra coins by spending some time at the sharpening wheel.\r<br />[*]Recipes have been added for all Fur armor.\r<br />[*]Recipes have been added for all Falmer weapons and armor. All require Advanced Armors smithing and completion of Nchumandzel or Thieves Guild falmer related quests.\r<br />[*]Recipes have been added for all Imperial armors. All require joining the Imperials. Many require Steel Smithing or Advanced Smithing perks.\r<br />[*]Recipes have been added for all Stormcloak armors. All require joining the Stormcloaks. Some require Steel Smithing. Some require Advanced Armors smithing.\r<br />[*]Recipes have been added for Blades Armor and Akaviri Katanas. All require completion of the Paarthurnax Quest and the Advanced Armors smithing perk.\r<br />[*]Recipes have been added for Wolf Armor and Skyforge Steel weapons. All require completion of the Companions quest line and the Steel Smithing perk.\r<br />[*]Recipes have been added for Thieves Guild armors and variants. All require joining the Thieves Guild.\r<br />[*]Recipes have been added for Nightingale weapons and armor. Weapons require the Ebony Smithing perk. All require joining the Nightingales.\r<br />[*]Recipes have been added for Dark Brotherhood armor and clothing. All require joining the Dark Brotherhood.\r<br />[*]Recipes have been added for Forsworn armor and weapons. All require aiding the King in Rags.\r<br />[*]Recipes have been added for Silver Swords. They require finding the first Fragment of Wuuthraad.\r<br />[*]Recipes have been added for Scimitars. They require completing In My Time of Need.\r<br />[*]Recipes have been added for Longbows and Hunting Bows. They do not require any perks or quests.\r<br />[*]Nearly all weapons and armor in the game can now be deconstructed, using either the Tanning Rack or the Smelter. This makes crafting a little less painful.[/list]\r<br />\r<br />Here&#39;s some logical explanations for the remaining materials that don&#39;t make sense (for those of you who can&#39;t stop thinking about it):[list][*]Elven and Glass smithing are assumed to work on the basis that it involves some magic that makes Moonstone and Malachite an amorphous solid.\r<br />[*]Quicksilver is stabilized as an amorphous solid through the reverse of the magic used for Moonstone and Malachite. Real quicksilver is very useful for making amalgums, such as silver or gold paste.\r<br />[*]Dragonscale weight is based on keratin and leather. Dragonbone weight is based on bone. It&#39;s strength is acquired through using the link between a soul and it&#39;s mortal remains to strengthen the bone/scale.\r<br />[*]The strength of Daedric armor is acquired through using the link between a soul and it&#39;s mortal remains (daedra heart) to strengthen the Ebony.[/list]\r<br />While I was in the process of rebalancing weights, I rebalanced prices as well. Prices are now based almost entirely upon the materials required to craft the items, with a small bonus determined by the minimum skill required to gain the items crafting perk. Certain rare materials (malachite, ebony, orichalcum) are far more expensive. Others, like dragonbone, are worthless, since only a few people (the Dragonborn) know how to use them. If you find anything wierd, please report it to me so I can fix it. \r<br />\r<br />Ore and ingot weights are MUCH heavier. Crafting may be painfully difficult. I highly recommend that you check out [url=http://skyrim.nexusmods.com/mods/21866]Portable Crafting Kits[/url]. It adds portable crafting kits to the game, including a portable smelting kit&#33;\r<br />\r<br />[color=yellow][b]NOTICE: [/b][/color]Due to the adjusted weights, the base sneaking calculations used in skyrim are substantially more difficult. Many weapons are lighter, meaning you will be slightly less likely to alert nearby enemies when you slit throats or bash skulls, but moving around silently in armor is much more difficult. Until you have acquired the two sound-reducing Sneak tree perks, you will not be able to sneak near to enemies while wearing any kind of armor, as you&#39;d expect. Leather rustles and creaks, metal clanks and jingles. This reflects reality. No self-respecting cutthroat would wear armor anyway, as it&#39;s noisy, smells, and slows you down. Deal with it.\r<br />\r<br />By the Nine, stop whining about it&#33;\r<br />\r<br />What&#39;s a milk-drinker like you doing here anyway? Go home to your mother.\r<br />\r<br />Aww, is the baby gonna cry?\r<br />\r<br />[heading]Requirements, Installation, and Load Order[/heading]In addition to the core SkyRealism - Mass and Materials ESP file, the main download also contains compatibility patches for all of the supported mods listed below. After you have installed SkyRealism - Mass and Materials, you will need to (un)check the compatibility patches in your load order, as appropriate for the mods you have installed.\r<br />\r<br />[b]SUPPORTED MODS: [/b]This mod has compatibility patches for the following mods.\r<br />[list][*][url=http://www.elderscrolls.com/skyrim/add-ons]Dawnguard[/url][color=#888888] by [b]Bethesda Game Studios[/b][/color]\r<br />[*][url=http://www.elderscrolls.com/skyrim/add-ons]Hearthfire[/url][color=#888888] by [b]Bethesda Game Studios[/b][/color]\r<br />[*][url=http://skyrim.nexusmods.com/mods/12092]Cloaks of Skyrim[/url][color=#888888] by [b]Noodles[/b][/color]\r<br />[*][url=http://skyrim.nexusmods.com/mods/21120]Heavy Armory - New Weapons[/url][color=#888888] by [b]PrivateEye[/b][/color]\r<br />[*][url=http://skyrim.nexusmods.com/mods/22793]Morrowind Armor for Skyrim[/url][color=#888888] by [b]Teh-Husky[/b][/color]\r<br />[*][url=http://skyrim.nexusmods.com/mods/10902]Weapon Variants Expansion[/url][color=#888888] by [b]Is this display name taken?[/b][/color]\r<br />[*][url=http://skyrim.nexusmods.com/mods/13486]Winter Is Coming – Cloaks[/url][color=#888888] by [b]Nivea[/b][/color]\r<br />[*][url=http://skyrim.nexusmods.com/mods/23964]Jewelers Extended[/url][color=#888888] by [b]NateNexus[/b][/color]\r<br />[*][url=http://skyrim.nexusmods.com/mods/16438]Bandolier - Bags and Pouches[/url][color=#888888] by [b]Dragten[/b][/color]\r<br />[*][url=http://skyrim.nexusmods.com/mods/8361]Expanded Jewelry Crafting[/url][color=#888888] by [b]lautasantenni[/b][/color]\r<br />[*][url=http://steamcommunity.com/sharedfiles/filedetails/?id=108569807]Tailoring[/url][color=#888888] by [b]Buckles[/b][/color][/list] \r<br />[b]INSTALLATION: [/b]Nexus Mod Manager has (incorrectly) decided that any mod beginning with SkyRealism is the same mod. When installing SkyRealism mods, it may display a message saying: &#34;A different version of SkyRealism - XXX has been detected. The installed version is XXX, the new version is XXX Would you like to upgrade? Selecting No will install the new Mod normally.&#34; You should click &#34;No.&#34;, so that it will install the mod normally. It may give you warnings that certain files will be over-written. You should select &#34;Yes to all&#34; so that it will update any existing files to the latest versions.\r<br />\r<br />Additional patches will eventually be released for the following mods:\r<br />[list][*][url=http://skyrim.nexusmods.com/mods/2933]Crafting 300 - Armoury of Tamriel[/url][color=#888888] by [b]Baratan[/b][/color]\r<br />[*][url=http://skyrim.nexusmods.com/mods/19733]Immersive Armors[/url][color=#888888] by [b]hothtrooper44[/b][/color]\r<br />[*][url=http://skyrim.nexusmods.com/mods/1002]JaySuS Swords[/url][color=#888888] by [b]JaySuS[/b][/color]\r<br />[*][url=http://skyrim.nexusmods.com/mods/12689]MECRs Classic Nord Shields[/url][color=#888888] by [b]MECR[/b][/color]\r<br />[*][url=http://skyrim.nexusmods.com/mods/3871]Weapons of the Third Era[/url][color=#888888] by [b]747823[/b][/color][/list]\r<br />[b]LOAD ORDER: [/b]If you don&#39;t know what load order is, watch [url=http://www.youtube.com/watch?v=t6MxLBcSgkc]this video[/url] by Gopher. Your load order should look like the one below.\r<br />[list][*][color=#888888]...esm and esp files...[/color]\r<br />[*]Dawnguard.esm  [color=#888888](Optional)[/color]\r<br />[*]Hearthfires.esm [color=#888888](Optional)[/color]\r<br />[*]1nivWICCloaks.esp [color=#888888](Optional)[/color]\r<br />[*]Cloaks.esp [color=#888888](Optional)[/color]\r<br />[*]MorrowindArmor.esp [color=#888888](Optional)[/color]\r<br />[*]PrvtI_HeavyArmory.esp [color=#888888](Optional)[/color]\r<br />[*]WVExpansion.esp [color=#888888](Optional)[/color]\r<br />[*]Dr_Bandolier.esp [color=#888888](Optional)[/color]\r<br />[*]MoarJewels.esp [color=#888888](Optional)[/color]\r<br />[*]ExpandedJewelryCrafting.esp [color=#888888](Optional)[/color]\r<br />[*]tailoring.esp [color=#888888](Optional)[/color]\r<br />[*]SkyRealism - Mass and Materials.esp\r<br />[*]SkyRealism - Mass and Materials - Dawnguard.esp [color=#888888](Optional)[/color]\r<br />[*]SkyRealism - Mass and Materials - Hearthfires.esp [color=#888888](Optional)[/color]\r<br />[*]SkyRealism - Mass and Materials - 1nivWICCloaks.esp [color=#888888](Optional)[/color]\r<br />[*]SkyRealism - Mass and Materials - Cloaks.esp [color=#888888](Optional)[/color]\r<br />[*]SkyRealism - Mass and Materials - MorrowindArmor.esp [color=#888888](Optional)[/color]\r<br />[*]SkyRealism - Mass and Materials - PrvtI_HeavyArmory.esp [color=#888888](Optional)[/color]\r<br />[*]SkyRealism - Mass and Materials - WVExpansion.esp [color=#888888](Optional)[/color]\r<br />[*]SkyRealism - Mass and Materials - Dr_Bandolier.esp [color=#888888](Optional)[/color]\r<br />[*]SkyRealism - Mass and Materials - MoarJewels.esp [color=#888888](Optional)[/color]\r<br />[*]SkyRealism - Mass and Materials - ExpandedJewelryCrafting.esp [color=#888888](Optional)[/color]\r<br />[*]SkyRealism - Mass and Materials - tailoring.esp [color=#888888](Optional)[/color]\r<br />[*][color=#888888]...other esp files...[/color][/list]\r<br />[heading]Credits and Thanks[/heading]Thanks to ByblosHex, Cordsnwires, Elys, Dogtown1, Dragten, Hothtrooper44, Ironman5000, Is this display name taken?, JaySuS, Nikinoodles, Nivea, MECR, Merilia, PrivateEye, THusky, theRoadstroker, and Tupii for giving me permission to use their mods as master file requirements for my own mods.\r<br />\r<br />Thanks to T3nd0, Cordsnwires, and jjc71 for the suggestions, guidance, and support. Thanks to trainwiz, wobbuvahi, and David Brasher for making the mods that kept me hooked on Skyrim long after it should have lost its appeal. \r<br />\r<br />Special thanks to Headbomb for making [url=http://skyrim.nexusmods.com/mods/8003]Complete Crafting Overhaul[/url], which provided the knowledge for how to add faction-related requirements to crafting recipes&#33;\r<br />\r<br />[heading]Compatibility, Issues, and Troubleshooting[/heading]By the Nine&#33; Steel, Dwarven, Orcish, Plate, Ebony, and Daedric Armors are heavy&#33; Is this intentional? \r<br />\r<br />Yes. Yes, it is.\r<br />\r<br />This mod will conflict with any mods which modify any items in the game. If you can&#39;t live without those mods, please let me know about them and if they work to provide greater realism I will attempt to implement something similar&#33;\r<br />\r<br />[heading]Change Log[/heading][b]v2.01:[/b]\r<br />Fixed Steel Bar recipes.\r<br />\r<br />[b]v2.0:[/b]\r<br />Added compatibility patch for Expanded Jewelry Crafting by lautasantenni.\r<br />Added Bars (quarter sized ingots) to vendors.\r<br />Redid all recipes, using bars and ingots.\r<br />\r<br />[b]v1.9:[/b]\r<br />Added compatibility patch for Bandolier - Bags and Pouches by Dragten.\r<br />Added compatibility patch for Jewelers Extended by NateNexus.\r<br />Added compatibility patch for Tailoring by Buckles. \r<br />Fixed MANY bugs, recalculated all weights.\r<br />Reassigned gold values closer to vanilla values so that Smithing is much easier to level up.\r<br />\r<br />[b]v1.8:[/b]\r<br />Added Corundum back to the game, since it is used in Hearthfire and Dawnguard DLCs, and other mods as well. Renamed Corundum to Copper.\r<br />Reduced weight of all armors by 20%. \r<br />Reduced weight of all ingots by 20%.\r<br />Reduced weight of Daedric Weapons by an additional 20%.\r<br />Removed all dyes and amalgums as being unnecessarily complicated. Dyes will be re-added in the SkyRealism - Tailoring mod.\r<br />Removed all faulty edits (cells, food, etc.) using TESVEdit. There are many identical-to-master (ITM) edits that are deliberate, to prevent accidental changes from other mods.\r<br />\r<br />[b]v1.7:[/b]\r<br />Reduced weight of Daedric Weapons by 20%.\r<br />Fixed several minor weight bugs with Galdur and Red Eagle weapons.\r<br />Changed names of dyes and amalgums for better menu display.\r<br />Changed many recipes with exotic ingredients to use dyes instead.\r<br />\r<br />[b]v1.6:[/b]\r<br />Fixed the weight of Glass Warhammer.\r<br />Added several new Amalgums, found under Misc at the Forge.\r<br />Added several new Dyes, found under Misc at the Cooking Pot.\r<br />\r<br />[b]v1.5:[/b]\r<br />Changed the keywords on Longbow and Hunting Bow so that they will now be found under &#34;Wood&#34; in the forge crafting menu. This does however mean that hunting bows cannot be double-smithed...but it&#39;s unlikely that this will be necessary since that really only affects end-game anyway.\r<br />\r<br />[b]v1.4:[/b]\r<br />Fixed nearly all keyword related bugs, just like Weapon and Armor Fixes by Headbomb.\r<br />Added ability to deconstruct most weapons (except Elven) and armors, using the tanning rack or smelter. You must have at least one of the items you want to deconstruct in order to see the recipes, so that you won&#39;t have a terribly cluttered crafting list. You&#39;ll get back 50-75% by weight of the original item&#39;s primary material.\r<br />Updated weights and values for scimitars.\r<br />Added recipe for scimitars. Requires finishing In My Time of Need.\r<br />Updated weights and values for draugr weapons.\r<br />Added recipes for forsworn weapons and armor. Requires aiding The King in Rags.\r<br />Updated weights and values for forsworn weapons and armor.\r<br />Added recipes for longbows and hunting bows.\r<br />Updated weights and values for longbows and hunting bows.\r<br />Updated weights and values of falmer equipment.\r<br />Updated recipes for falmer Equipment.\r<br />Updated weights and values of silver swords.\r<br />Added  recipes for silver swords. Requires finding the first fragment of Wuuthraad.\r<br />Fixed keyword for the dragonplate helmet variant 2.\r<br />\r<br />[b]v1.3:[/b]\r<br />Changed prices of Dragonscale and Dragonplate equipment so they are closer to Vanilla prices.\r<br />Fixed a few incorrect prices with Daedric and SkyforgeSteel equipment.\r<br />\r<br />[b]v1.2:[/b]\r<br />Separated vanilla Skyrim and Dawnguard Editions.\r<br />Removed most weapon tempering requirements for Dawnguard added items, such as dragonbone weapons, crossbows, etc. Changing the force of a crossbow usually involves gear ratio changes, tightening strings, and sometimes reinforcing the bow...not something that requires a full ingot worth of metal.\r<br />I&#39;m not happy with the weights and crafting requirements for Dragonbone weapons, but I don&#39;t have time to perform the volumetric calculations right now. It&#39;ll be a while before I have free time. :(\r<br />\r<br />[b]v1.1:[/b]\r<br />Added recipe for dark brotherhood armor and clothing. Added faction quest requirements for all new craftable armors. Knowledge for how to do this was obtained from [url=http://skyrim.nexusmods.com/mods/8003]Complete Crafting Overhaul[/url][color=#888888] by [b]Headbomb[/b][/color].\r<br />\r<br />[b]v1.0:[/b]\r<br />Removed Bandoliers, Bags, Backpacks, etc. These are now included in Capacity and Carry Weight. Added recipes for nearly all non-artifact weapons and armor in the vanilla Skyrim.\r<br />\r<br />[b]v0.3a:[/b]\r<br />Updated the bags, backpacks, bandoliers, and other containers so they are no longer disenchantable.\r<br />\r<br />[b]v0.2a:[/b]\r<br />Included the missing scripts in the file that I forgot with the initial upload. Sorry&#33;\r<br />\r<br />[b]v0.1a:[/b]\r<br />Changes too numerous to list. Assume all items in the game have been modified.\r<br />\r<br />[heading]Appendix[/heading]Here&#39;s some information to think about:\r<br />\r<br />Real World Weights (measured personally by me):\r<br />[list][*] Woodcutting Axe = 5.5 lbs\r<br />[*] 1920&#39;s Mining Pick = 6.2 lbs.\r<br />[*] Kitchen butter Knife = 0.2 lbs\r<br />[*] Kabar Knife = 0.7 lbs\r<br />[*] Japanese Katana w/ scabbard = 2.3 lbs\r<br />[*] English Longsword = 2.9 lbs.\r<br />[*] English broadsword = 3.2 lbs.\r<br />[*] Scottish Claymore = 4.5 lbs.\r<br />[*] Bear Hide Rug = ~30 lbs. Yes, I have dead animal skins in my house. Feel free to call PETA.\r<br />[*] Deer Hide Rug = ~10 lbs.\r<br />[*] Stone Mortar & Pestle = 2.8 lbs.\r<br />[*] Large hardcover book = 1.7 lbs.\r<br />[*] Small hardcover book = 1.1 lbs.\r<br />[*] handcrafted thick leather brigantine vest = 8.1 lbs.\r<br />[*] 14th century italian plate armor = 60 lbs. No, I don&#39;t actually own this. See [url=http://www.myarmoury.com/talk/viewtopic.php?t=8023]this thread[/url].\r<br />[*] 15th century german plate armor = 93 lbs.[/list]\r<br />Approximate size of key Skyrim items:\r<br />[list][*] Ingot = ~20cm x 8cm x 4cm = 640 cm^3\r<br />[*] Real English Longsword = 5 cm x 120 cm x 0.5 cm = 300cm^3. That&#39;s the basis I&#39;m using for thinner looking weapons like orcish, ebony, or iron blades. \r<br />[*] Fantasy Sword = 8cm x 120 cm x 1cm = 960cm^3. Basis for heavy/thick blades, like dwarven, daedric, glass, elven, and steel.\r<br />[*] Firewood: 40cm x 10cm x 5cm = ~2000 cm^3. Just for comparison of volume.[/list]\r<br />Specific Gravity (g/cm^3) of various materials:\r<br />[list][*] Wood (Oak) = 0.7\r<br />[*] Leather = 0.8\r<br />[*] Water = 1.0\r<br />[*] Iron = 7.9 \r<br />[*] Steel = 7.6\r<br />[*] Copper = 8.96\r<br />[*] Silver = 10.49\r<br />[*] Gold = 19.32\r<br />[*] Dwarven (Naval Brass) = 8.5\r<br />[*] Orichalcum (Manganese Bronze) = 8.9\r<br />[*] Ebony (Tungsten/Osmium) = 18-22\r<br />[*] Quicksilver (Mercury) = 13.5\r<br />[*] Moonstone = 2.61\r<br />[*] Malachite = 3.6\r<br />[*] Dragonbone (Bone) = 2.0\r<br />[*] Dragonscale (Keratin) = 1.3\r<br />[*] Soul Gem (Labradorite) = 2.7[/list]",
  "categoryId": "78",
  "version": "2.01",
  "author": "MTichenor",
  "createdUnix": "1344152489",
  "updatedUnix": "1357848073",
  "containsAdultContent": false,
  "uploadedBy": "IndigoNeko",
  "primaryFile": null,
  "files": [
    {
      "fileId": "106258",
      "name": "SkyRealism - Materials",
      "version": "1.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "90",
      "fileName": "SkyRealism - Mass and Materials-21724-1-9.7z",
      "uploadedUnix": "1355956960",
      "modVersion": "1.9",
      "virusScanUrl": "https://www.virustotal.com/file/bee73e89301fd059c0b86c262d02813509f41c5207c1cf9b19ac73cc959ff194/analysis/1407312589/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20Mass%20and%20Materials-21724-1-9.7z?fid=106258&ttl=1535790817&ri=8192&rs=8192&setec=3c88f26c35f99195dc496382a75d512b"
    },
    {
      "fileId": "1000001456",
      "name": "SkyRealism - Materials",
      "version": "2.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "118",
      "fileName": "SkyRealism - Mass and Materials-21724-2-01.7z",
      "uploadedUnix": "1357848073",
      "modVersion": "2.01",
      "virusScanUrl": "https://www.virustotal.com/file/aa5e3ad6f7d1083b48b115c36f35b68d952b0c3099c92d94732ac75917065e3c/analysis/1407346826/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20Mass%20and%20Materials-21724-2-01.7z?fid=1000001456&ttl=1535790817&ri=8192&rs=8192&setec=9564261eb4efe0b30484eb14382216ad"
    }
  ]
}