{
  "modId": 21723.0,
  "modName": "True Vampire Lord",
  "summary": "This mod is designed to make vampire lords viable on Master Difficulty with mods like Enhanced High-Level Gameplay etc.",
  "descriptionHtml": "Requires: Dawnguard DLC\r\n\r\nThis mod is designed to make vampire lords viable on Master Difficulty with mods like Enhanced High-Level Gameplay etc. When i got dawnguard first thing i did was get vampire lord, i then proceeded to get 3 shotted by bandits cause i had low armor and barely scratched them. So i made this mod which makes me feel a bit more like a vampire lord and less like cannon fodder.\r\n\r\nChanges:\r\n\r\nVampire Lord Form Looting - You can now loot bodies, and interact with stuff (not horses) in vampire lord form.\r\n\r\nDamage Scaling\r\nlvl 1-10: Claw Damage 50, Drain Bolt 100\r\nlvl 11-20: Claw Damage 100, Drain Bolt 200\r\nlvl 21-30: Claw Damage 200, Drain Bolt 300\r\nlvl 31-40: Claw Damage 300, Drain Bolt 500\r\nlvl 41+: Claw Damage 500, Drain Bolt 800\r\n\r\nDamage Resistance - In vampire lord form you will always have a base armor over the cap so you recieve the full 80% physical mitigation (this imho is a must, otherwise any form is just weaker than staying normal with armor on).\r\n\r\nStronger Minions - Vampire Lord raise dead spell increased lvl to 40\r\n\r\nPerk Changes:\r\n- Poison Talon adds 400 damage over 4 seconds (taking total melee dmg to 800 per swing)\r\n- Bat Cloak does 100 damage per second\r\n- Vampiric Grip Does 100 choke dmg per second (might be able to kill something with it now lol)\r\n- \\\"Power of the grave\\\" perk now gives +200 to all stats (currently have over 1k health on my main without cheats, so +50 is pathetic).\r\n\r\n(This next section applies far more to the steam workshop community and not the nexus community, so apologies to you guys, just added it for completeness)\r\nFor the people who say L2P and you are n00b try some 1337 skillzors or switch to novice difficulty:\r\n\r\nIt saddens me that i have to bother writing this section however i have been flooded with these comments. I like many others play a game to max out so i have the best stats in the game as i find that fun. These are my character stats currently without using any cheats just the vanilla system and not exploiting the restoration bug:\r\n\r\nlvl 58\r\n1h dragonbone sword 899 dmg with drain life 25 and stam 25\r\nover 1k armor aka 80% physical resist cap\r\n100% spell absorbtion\r\naround 1k health, 300 mana, 300 stam\r\nshield block is capped 80 or 85 whichever it is.\r\n\r\nIf you believe this to be overpowered blame bethesda, cause this is achievable through the vanilla game at endgame. I\\'ve taken mods to make things harder as a result. That being said I expect vampire lord to at least be on par if not slightly stronger to make it worth using, as i would like to enjoy playing a vampire lord. The reality is i won\\'t make use of it, if its just a spell that weakens me below the above stats. So this mods aim is not to make vampire lord viable at killing, it can do that anyway, its to make it a viable alternative to a min max character such as mine.\r\n\r\nChangelog:\r\nv1.1 - Added Damage scaling\r\nv1.0 - First release",
  "categoryId": "79",
  "version": "1.1",
  "author": "Sann",
  "createdUnix": "1344151684",
  "updatedUnix": "1344275038",
  "containsAdultContent": false,
  "uploadedBy": "alexs9k",
  "primaryFile": null,
  "files": [
    {
      "fileId": "78901",
      "name": "True Vampire Lord",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "True Vampire Lord-21723-1-0.rar",
      "uploadedUnix": "1344151735",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3c510b13564cd9ab2f966ec8e09fe668fdefc7c316ec9b6cced87e3971126657/analysis/1407071045/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Vampire%20Lord-21723-1-0.rar?fid=78901&ttl=1535790815&ri=8192&rs=8192&setec=b4f1c8e1c2cdde5354d99b2da2a4a7e6"
    },
    {
      "fileId": "79258",
      "name": "True Vampire Lord",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "True Vampire Lord-21723-1-1.rar",
      "uploadedUnix": "1344275038",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e010c54e3959a8a2f4ec9e5fb504c2946bad6ba2c65dc2ef39d5fbf9e5b8122a/analysis/1407074642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Vampire%20Lord-21723-1-1.rar?fid=79258&ttl=1535790815&ri=8192&rs=8192&setec=1dbc6f818ac4dddc10c05dd8d3f84004"
    }
  ]
}