{
  "modId": 21748.0,
  "modName": "Vampiric ENB",
  "summary": "Vampiric ENB is released in celebration of Dawnguard. It uses some very unique twists to display a grim, scary and dangerous world fit for vampires and those hunt these shadow dwellers. You will see mysterious omens of blood spread around the world and the Realm of the Red Shadow awaits those who step into the dark... follow me and you will see.\r\n\r",
  "descriptionHtml": "[size=+2][center][color=red][b]Vampiric ENB[/color][/size][/center][/b] \r\n \r\nis released in celebration of Dawnguard. It uses some very unique twists to display a grim, scary and dangerous world fit for vampires and those hunt these shadow dwellers. You will see mysterious omens of blood spread around the world and the Realm of the Red Shadow awaits those who step into the dark... follow me and you will see.\r\n\r\n[center] [youtube]Q2yNB-QYAOk[/youtube] [youtube]zGq7wE25ikY[/youtube][/center]\r\n[center] [youtube]lmW1gMeMTHc[/youtube][/center]\r\n\r\n[center][URL=http://img545.imageshack.us/i/screenshot47kopiekopie.jpg/][IMG]http://img545.imageshack.us/img545/8719/screenshot47kopiekopie.jpg[/IMG][/URL][/center]\r\n___\r\n\r\n[b]Update history:[/b]\r\n05.08.12: Release\r\n___\r\n\r\nTechnically this is achieved by many highly advanced graphic techniques created by Boris Vorontsov in his ENB series and tweaked by my foolish self during more than 400 hours (partially while doing the precursors to this mod: Radiant Heart ENB, Winterfell, Grim Gem and Sanguinoire ENB), including:\r\n[list]\r\n\r\n[*]Boris\\'s own approach to [i][b]HDR and SSAO[/b][/i] that makes you feel the air inbetween objects, \r\n\r\n[*]colourful [i][b]indirect lighting (SSIL)[/b][/i] that blends the world together in a very cohesive way, \r\n\r\n[*]very [i][b]detailed shadows[/b][/i] which pronounce the delicate details of everything, \r\n\r\n[*][i][b]Bokeh Depth of Field[/b][/i] that simulates the focusing of your eyes in a highly sophisticated and convinicing way (thanks to Matso), \r\n\r\n[*][i][b]lens flare effects[/b][/i] of bright light sources,\r\n\r\n[*]glorious and dynamically created [i][b]sunrays[/b][/i] stretching like the fingers of a curious child god, \r\n\r\n[*]dynamic [i][b]skylighting[/b][/i] creating even more lively shadowplay,\r\n\r\n[*]some code lines of my own spreading the [i][b]blood omens [/b][/i]around Skyrim in a very dynamic and hopefully appropriate, frightening way and \r\n\r\n[*]even more of my code stumblings to open the [i][b]Realm of the Red Shadow[/b][/i] - enter the dark to never return again... \r\n\r\n[/list]\r\n\r\n[center][URL=http://img232.imageshack.us/i/screenshot62kopiekopie.jpg/][IMG]http://img232.imageshack.us/img232/7154/screenshot62kopiekopie.jpg[/IMG][/URL][/center]\r\n\r\n[u][center]Installation[/center][/u]\r\n\r\n1) Please do the installation manually and place all the files from the unzipped Vampiric ENB directory, including its subdirectories, into your Skyrim install folder, where the SkyrimLauncher.exe is located. In the end you should e.g. find enbseries.ini in the same directory as SkyrimLauncher.exe. \r\n\r\n2) Additionally please download the ENB series, version 0.114 by Boris Vorontsov, from this page:\r\nhttp://www.enbdev.com/mod_tesskyrim_v0114.htm. \r\nAfter unzipping this archive, go into its WrapperVersion subdirectory and just copy the file named d3d9.dll. Place that d3d9.dll into your Skyrim directory, too.\r\n \r\n3) When starting Skyrim don\\'t fortget to activate the already included FurtherDarkDungeons.esp (all credits to Mindflux/artem1s, see also below)\r\n\r\n4) I strongly advise downloading and activating the following three mods (without them you will have very different looks than intended):\r\n\r\nRevampedExteriorFog by Greg Manthey (Gargorias)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=9930\r\nRemove Ambient Interior Fog by Greg Manthey (Gargorias)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=9571\r\nMike Foxs Darker Dungeons by Mike Fox (without it, dungeons and interiors will be brighter and less atmospheric than intended)\r\nhttp://skyrim.nexusmods.com/mods/11353\r\n\r\nPlease make sure that the .esp file coming with Mike Foxs Darker Dungeons (Dark Light Templates.esp) is activated as last (or at least at a very late stage) in your load order. Otherwise, it tends to get overwritten by other files dealing with lihgting that are at least in this setup up not supposed to take precedence over Mike Foxs Darker Dungeons. BOSS is placing the Dark Light Templates.esp not low enough in load order. \r\n\r\n5)Sykrimprefs.ini\r\nPlease make sure that in your Skyrimprefs.ini (found e.g. on a Vista64 system under users/\\\"username\\\"/mydocuments/mygames/skyrim/) you have the following set:\r\nbTreesReceiveShadows=1\r\nbDrawLandShadows=1\r\n[b]bFloatPointRenderTarget=1[/b]\r\n(the first two are optional while the last one is a must)\r\n\r\n6) Driver Settings\r\nI use the lastest Nvidia driver (on a GTX 580). I have set antialiasing to application controlled (the included smaa by Andrej Dudenhefner (alias mrhaadni) handles this) . Anisotrophic filtering is activated on driver level at 16x quality. Texture Quality is set to high quality and Tripple Buffering is on (while allowing to use the V-Synch setting of the application).\r\n\r\n7) Ingame graphic settings (launcher and options menu)\r\nI have [b]brightness all the way down[/b] (this may vary for you depending on your monitor calibration, but it\\'s very likely you will also want a very low ingame brightness setting).\r\nAnti Aliasing and Anisotrpoic filtering are turned off within the launcher options (the driver & the injected SMAA do that for us). No FXAA either. All other settings to the highest possible options (ultra), including shadows. Of couse, it depends on your system if you want to make some cmpromises here.\r\nIf this is too performance hungry, please try to set Anti Aliasing to a lower level with the included injector.ini file.\r\n\r\n8) Monitor settings\r\nHard to give advice here. My monitor is rather bright, but in the end it\\'s just important to keep in mind that the monitor of course plays a role that has to be compensated for if need be by some fine tuning. \r\n\r\n9) Other graphic mods and left overs from ENB installations\r\nPlease make sure you remove other graphic files from other ENB or similar graphic modifications (like e.g. from Realistic Lighting, effect. ini files from other ENB that did e.g. sharpening as such techniques are not used here, etc.).\r\n\r\n[center][URL=http://img715.imageshack.us/i/screenshot3621kopiekopi.jpg/][IMG]http://img715.imageshack.us/img715/5403/screenshot3621kopiekopi.jpg[/IMG][/URL][/center]\r\n\r\n[center][u]Additional graphical mods I use and like[/center][/u]\r\n\r\n(HQ Textures by Bethesda)\r\nBetter Dynamic Snow\r\nWarmer Magic Lights\r\nCrimson Tide\r\nCLARALUX\r\nEnhanced Distant Terrain\r\nFiner Dust\r\nIntricate Spider Webs\r\nReal Glaciers\r\nLush Trees\r\nLush Grass\r\nThe Eyes of Beauty\r\nWearable Lanterns\r\nTorches for Real Lighting (infite life)\r\nPaper Pack (to darken book pages)\r\nSunglare Disabler\r\nMore Dynamic Shadows\r\nENB Weather Extended\r\n\r\n\r\n[center][URL=http://img88.imageshack.us/i/screenshot72kopiekopie.jpg/][IMG]http://img88.imageshack.us/img88/5435/screenshot72kopiekopie.jpg[/IMG][/URL][/center]\r\n\r\n[center][u]Credits to:[/center][/u]\r\n\r\nBoris Vorrontsov for his great ENB Series\r\nAndrej Dudenhefner (alias mrhaadni) for the brilliant smaa soultion I have just included here - all credits to him for this\r\nMatso for his absolutely amazing Depth of Field effect that I use with his permission here\r\nMikeFox for the superb Darker Dungeons Mod that simply is a must to use for me\r\nTheRadikal for his twists on the enbeffect.fx and the enbpalette.bmp file that I further modified with his consent and include here\r\nMindflux/artem1s for the essential FurtherDarkDungoens Mod that he kindly allowed me to integrate into the Grim Gem ENB package\r\nSharpshooter8 for inspring me to start this with his amazing ENB\\'s\r\nConfidence Man for his water foam retexture that helps water fom brightness udner controll at night time\r\nPuuloo for his great More Dynamic Shadows Mod that I suggest to keep a very close eye on - he\\'s just giving it the last refinements to make it really perfect and then I will gladly and thankfully use it\r\n\r\nIf I should have forgotten anybody here, please take my sincere apologies and give me a heads up and I will add you immeditaley or remove any kind of your work you felt offending for me to use. No ill intended.\r\n\r\n[center][URL=http://img684.imageshack.us/i/screenshot3630kopiekopi.jpg/][IMG]http://img684.imageshack.us/img684/8649/screenshot3630kopiekopi.jpg[/IMG][/URL][/center]\r\n\r\nEnjoy and please give feedback and - if you should like it - please endorse it.\r\n\r\nAll the best\r\nyoungneil1\r\n\r\nP.S.: If you should need some Sykrim distraction, I wholeheartedly recommend trying Kingdoms of Amalur:Reckoning with my YSA Mod or Two Worlds 2 with my Worldmerge Mod. Both are great game experiences that complement Sykrim very nicely due to their different focus.\r\n\r\n[center][URL=http://img814.imageshack.us/i/screenshot3635kopiekopi.jpg/][IMG]http://img814.imageshack.us/img814/9913/screenshot3635kopiekopi.jpg[/IMG][/URL][/center] \r\n\r\n",
  "categoryId": "62",
  "version": "1",
  "author": "youngneil1",
  "createdUnix": "1344189335",
  "updatedUnix": "1346071653",
  "containsAdultContent": false,
  "uploadedBy": "youngneil1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "79013",
      "name": "Vampiric ENB v1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "425",
      "fileName": "Vampiric ENB v1-21748-1.zip",
      "uploadedUnix": "1344189564",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/9f401d53143a2ac7a1bd851b04cd02dbfcc4f2b4dd0f02d2aeada75bab6d84ba/analysis/1407072125/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20ENB%20v1-21748-1.zip?fid=79013&ttl=1535790849&ri=8192&rs=8192&setec=de64110aaba87c36aefd981adb61f985"
    },
    {
      "fileId": "79645",
      "name": "Vampiric ENB v1 noir pure",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "427",
      "fileName": "Vampiric ENB v1 noir pure-21748-1.zip",
      "uploadedUnix": "1344405314",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/9bb996ad19715746e231de8205c737fdb01c7d20ef992a2da483036720eed3d5/analysis/1407078603/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20ENB%20v1%20noir%20pure-21748-1.zip?fid=79645&ttl=1535790850&ri=8192&rs=8192&setec=e0756da92f9bc0c3fd3d4fe72dd683cb"
    },
    {
      "fileId": "84606",
      "name": "Vampiric ENB v1 Blood but no Red Shadow",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "373",
      "fileName": "Vampiric ENB v1 Blood but no Red Shadow-21748-1.7z",
      "uploadedUnix": "1346071653",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/4a39147e1ffbb765b0e34e818e23188681c5ec109c7e5face07ddbc4c0fb1d6b/analysis/1407125645/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampiric%20ENB%20v1%20Blood%20but%20no%20Red%20Shadow-21748-1.7z?fid=84606&ttl=1535790850&ri=8192&rs=8192&setec=12321d003d32c1c9c00d2849efb01fe6"
    }
  ]
}