{
  "modId": 2176.0,
  "modName": "Marry and companion free",
  "summary": "Marry and companion to everyone",
  "descriptionHtml": "15/12/11\r\nupdate.\r\nnow you can have a second follower with full list of commands, after all i explain:\r\n\r\n-The second follower take the dog place, so you can not have 2 followers and a dog.\r\n-I make a picture instructions to made it easy for all.\r\n-If you have my other file (setfriend or setfollower) no matters.\r\n-This work perfect with the potencial followers so you can have two Edecan at time, they dont need my mod but if you use on them was best.\r\n-This also work on that NPC you can make follower with my last mod.\r\n-If you leave one of them alone no problem, they back to normal life.\r\n-No bugs or error with NPC who give you quest.\r\n-After have two followers you can not leave the second one ( but you can change him ) only if you kill him or you attack him and flee.\r\n-Fix the problem with that NPC who flee on combat, now they come the most brave in Skyrim.\r\n-And for the momment no more, here are the instructions to change you main two followers for others:\r\n\r\n-First follower change, no problem, only ask him to leave and take other like always ( using the mod )\r\n-Second follower change ( who are the dog ) no problem, use my mod in your next follower ( bat 2follower ) and after that open console, click on target again and type \\\"forcerefintoalias animal\\\" and the second follower leave and the new one comes.\r\n-I hope that instructions help you in everything, any issue please ask me, thanks to all.\r\n\r\n-if you dont want to lose your follower just do that:\r\nopen console\r\ntype \\\"help <<Name of the NPC>> 4\\\"\r\nthere appear at the end --->NPC <<NPC name>> and ID\r\ntake that ID for example \\\"1412b\\\"\r\ntype setessential <<ID>> 1\r\nnow you can not lose your follower.\r\n\r\nAnd i want to say special thanks to all that people who belive in me and use my mod, 10.000 downloads was really greath, i never hope something like this, thanks to you again, enjoy.\r\n\r\n\r\n\r\n\r\n\r\nFirst off I would like to thank the Nexus forums and Bethesda, this is my first mod after downloading countless mods from the Nexus over the last three years. This is not a mod in itself, it is a cheat that allows almost all of the NPCs to be your spouse or companion. Here\\'s how it works:\r\n\r\nopen the console\r\ntarget the NPC you want to marry/befriend\r\nwrite “bat setfriend” without the quotation marks if you download the setfriend file.\r\nwrite “bat setmarry” without the quotation marks if you download the setmarry file.\r\nwrite “bat setfollower” without the quotation marks if you download the setfollower file.\r\nand that is all\r\n\r\nBugs or errors:\r\nI have tested this mod on around 100 or 130 NPCs and have tried to test it in as many situations as possible. It has worked in about 70% of the cases, however some NPCs can only be your companion and some can only be married to you. Besides that the only other problems I have noticed are:\r\n\r\n1. When you go to marry an NPC that is involved in a quest and stand them up or say no to your vow they will not talk to you for the rest of the quest which can cause problems.\r\n\r\n2. When a NPC that is accompanying you dies (whether you kill them or not) you can become wanted in their respective faction/town\r\n\r\nEverything else works pretty much the same, you can trade with NPCs that are your companion and they will follow your orders. I would like to warn you guys to use this mod with caution. You should only use it on NPCs that you want to marry or that you want to have accompany you. Do not go using it on all the NPCs because I don’t know what will happen in the long run, I personally only use it on 7 or 8 npcs in my game. Anyways, enjoy and I hope you like it. \r\n\r\nHere you have a link to other greath mod to get the divorce with your NPC enjoy:\r\n\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=2224\r\n\r\nEspañol.\r\nOk primero dar las gracias a el foro Nexus y a Bethersda, este es mi primer mod despues de algunos años descargando mods sin piedad del Nexus, no es un mod en si, es una modificacion para el juego bastante simple para hacer los NPC del juego que se puedan casar o sean tus compañeros, como funciona:\r\n\r\nAbrir la consola. ( creo que todos sabemos como )\r\ntargetear al NPC que queramos.\r\nescribir \\\"bat setfriend\\\" sin las comillas, si hemos descargado el archivo setfriend.\r\nescribir \\\"bat setmarry\\\" sin las comillas, si hemos descargado el archivo setmarry.\r\nescribir \\\"bat setfollower\\\" sin las comillas, si hemos descargado el archivo setfollower.\r\ny eso es todo.\r\n\r\nBugs o errores:\r\nhe testeado el mod en al menos 100 o 130 NPC en el juego y he intentado hacerlo en muchas situaciones diferentes y ha funcionado en el 70% de los casos, algunos pueden ser solo compañeros y otros solo pueden casarse con ellos pero para la mayoria sirven las dos cosas, los unicos problemas que he visto es cuando pides a algun NPC que se case contigo y luego lo rechazas en la iglesia lo cual hara que no quiera hablarte mas y para la continuacion de las quest puede ser un problema, tambien he visto que cuando un NPC que te acompaña muere ( ya lo hayas matado tu o no ) a veces se te impondra el cargo de asesinato con su respectiva recompensa, por lo demas no hay mucha mas variacion, los NPC seguiran dando sus conversaciones estandar si hubiera alguna, me gustria decir que useis este mod con cuidado, no vayais por ahi usandolo en todos los NPC porque no se lo que pasaria a largo plazo, yo actualmente lo tengo en 7 u 8 NPC en mi juego porque son los que he querido que me acompañaran en su momento o porque he querido casarme con ellos, por lo demas disfrutad y espero que os guste, un saludo.",
  "categoryId": "66",
  "version": "0.1",
  "author": "Gotika",
  "createdUnix": "1322699194",
  "updatedUnix": "1324207159",
  "containsAdultContent": false,
  "uploadedBy": "abrahan1981",
  "primaryFile": null,
  "files": [
    {
      "fileId": "5728",
      "name": "setfriend",
      "version": "final",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "setfriend-2176.rar",
      "uploadedUnix": "1322699430",
      "modVersion": "final",
      "virusScanUrl": "https://www.virustotal.com/file/13ae30b340da1fb4b36e7edde3dbba49737038a33ac21d9457abb7e9cdbbad77/analysis/1406463002/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/setfriend-2176.rar?fid=5728&ttl=1535756293&ri=8192&rs=8192&setec=b1c92dd87c850841156121701b634b19"
    },
    {
      "fileId": "5743",
      "name": "setfollower",
      "version": "final",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "setfollower-2176-final.rar",
      "uploadedUnix": "1322702641",
      "modVersion": "final",
      "virusScanUrl": "https://www.virustotal.com/file/b3dcdc7b6e166b264efb613ec0bf672d73525681cc6facd9212633ee32fb10d6/analysis/1406463182/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/setfollower-2176-final.rar?fid=5743&ttl=1535756294&ri=8192&rs=8192&setec=dca08c41af3219096fe88d1047443e59"
    },
    {
      "fileId": "5826",
      "name": "setmarry",
      "version": "final",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "setmarry-2176-final.rar",
      "uploadedUnix": "1322724202",
      "modVersion": "final",
      "virusScanUrl": "https://www.virustotal.com/file/360a958987e2d13de5dc1b51b994e06ca60ab1469c2cf1ee8ba3409ebc8a7277/analysis/1406464203/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/setmarry-2176-final.rar?fid=5826&ttl=1535756294&ri=8192&rs=8192&setec=e120e5854303954e33027db590482c60"
    },
    {
      "fileId": "10768",
      "name": "second follower",
      "version": "0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "909",
      "fileName": "second follower-2176-0-1.rar",
      "uploadedUnix": "1323976030",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/2f728769b262712c82d42a39bc572abb543bc73aa384beba15edfd0aff1d3d6a/analysis/1406521864/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/second%20follower-2176-0-1.rar?fid=10768&ttl=1535756295&ri=8192&rs=8192&setec=fa119f4dda48c0b5c59aeee880016c4e"
    },
    {
      "fileId": "11648",
      "name": "Extra NPC",
      "version": "0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Extra NPC-2176-0-1.rar",
      "uploadedUnix": "1324207159",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/a48705be2c80ae2c9015dbc83edf84ed778e24580c412621ee10dff8986166f6/analysis/1406533146/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Extra%20NPC-2176-0-1.rar?fid=11648&ttl=1535756295&ri=8192&rs=8192&setec=2a749e8ba8b460fcc224e3e2623d62f8"
    }
  ]
}