{
  "modId": 21792.0,
  "modName": "Merged Thievery Skill - a merge of Lockpick into Pickpocket",
  "summary": "Merges Lockpicking and Pickpocket skills and perk trees in a single one leaving one free for custom use.",
  "descriptionHtml": "Update: Treasure Hunter moved to the Tower Stone cause I consider that stone last useful and somehow related, the unlock effect is still on the stone.\r<br />Please don&#39;t complain about this decision, I sayed from the beginning it will happen, and in order to reduce the eventual discontent I made it to double the chance of finding special loot instead of +50%. Is not too high imo, no perk was 10%, perk was 15%, now with stone is 20%.\r<br />Don&#39;t forget to type in the console &#34;startquest LH_MTS_RemovePerks&#34; to get rid of the perk and gain your point back.\r<br />With this change the mod might become incompatible with mods altering the Tower or all the stones effects. If you use such a mod and want the Tower effect from there then load that one after mine but most likely the Treasure Hunter effect won&#39;t work (or who knows until tested). If you want my Tower Stone with Treasure Hunter effect then load mine after the other one and only this stone will be overwritten and all the other stone changes should still work from the other mod. Please let me know of any such conflict especially if there are problems and behavior different (worse) than what I described and I&#39;ll try to do something about it.\r<br />\r<br />This mod is not intended for stand alone use. It merges Lockpicking and Pickpocket trying to keep the vanilla flavor as much as possible leaving a skill tree free for custom implementations via other mods, but feel free to test it as it is if you wish cause that&#39;s doable. This may evolve into an esm if needed and but for now everything seems doable as it is.\r<br />If my idea of people using this and implement new skill mods won&#39;t be successful that&#39;s ok, I have created a mod using this and I just splited my work in two mods.\r<br />\r<br />Changes:\r<br />This mod&#39;s primary goal is to merge those skills into one named Thievery providing a single place to manage this regardless the implementation of the other skill in different mods. Lockpicking is now using old Pickpocket and the main goal of this mod is to make old PP influence the unlock chance and increase the merged skill on successful lockpick. Description and names for items, magic effects, etc. are changed to reflect the new skill name.\r<br />Other changes:\r<br />Perks: described in own section\r<br />Argonian race: starting bonus +10 Thievery, +5 Custom skill\r<br />Trainer dialogue: Pickpocket changed to Thievery, Lockpick not touched should be changed by mod implementing new skill.\r<br />Books: All previously Lockpick and Pickpocket skill books now increase Thievery\r<br />Tower Stone: the most weak vanilla stone now also gets similar effect with Treasure Hunter perk since that perk is now gone. The stone effect is stronger then the perk was cause for the perk you would have just spent a perk point, now you have to choose a stone in detriment of other.\r<br />Trainers: \r<br />Perks:\r<br />Perks from PP and LP were merged in a single tree removing the most pointless ones form vanilla in order to keep a vanilla like number of perks in the tree, see picture. The only skills with mechanic changes are Light Fingers which add at each level the effects from Novice Locks to Master Locks. Golden Touch was removed cause there is plenty of gold too loot in this game, Treasure Hunter was remove and it&#39;s effect added to the Tower Stone since I don&#39;t consider those to be something the player can influence with his skill. \r<br />Perks from previous skills that don&#39;t show in Thievery tree can be automatically removed upon starting to use this mod from update 1.0. Perk points are returned to you thanks to a feature from Skyrim update 1.8. If you don&#39;t have that you should click cancel when prompted. If you want to do that later use &#34;startquest LH_MTS_RemovePerks&#34;. If you followed manual procedure with the first mod release this won&#39;t do anything.\r<br />NOTE to MODDERS: removal of the GoldenTouch and TreasureHunter doesn&#39;t work in vanilla by simply removing the perk from player (the effect would also stay in vanilla if you make the skill legendary), I had to revert a global manually beside that. More then that, those perks seem not to work if you readd them after removal. So, if you are to put those perks back in the custom skill or something (I don&#39;t see those fitting in but for a Luck skill for example) then you probably better use a copy of the original perk and not that one itself, that way I believe it would work again.\r<br />\r<br />Permissions:\r<br />You are not allowed to change this mod even if you are creating a mod for the skill I free up. One goal of this mod for the end user experience is to use this then to be able to switch the mod for the other skill at will so this should stay the same regardless the mod using it. Suggestions from modders that intend to use this will be taken into consideration with highest priority. You may create any mod for the skill I free up, any idea you have, no restrictions from my point of view if two people are working on the same kind of skill (solve such problems on your own). Please just notify me if you implement a skill based on this mod so we can keep a trace of those mods.\r<br />\r<br />Credits:\r<br />Thanks to T3nd0 who allowed me to use the Lockpick interface from SkyRe which removes the skill displayed. Use his great mod if you wish a huge overhaul and this mod for a close to vanilla flavor.\r<br />\r<br />Mods using this:\r<br />SSR - Skyrim Skill Redesigned (Thievery module adds some more perk and Unarmored module adds that as replacement for the Lockpick) http://www.nexusmods.com/skyrim/mods/49526/\r<br />Combat Remastered (Optional module adds Invention skill) http://skyrim.nexusmods.com/mods/24377/\r<br />Throwing Knifes WIP with skill http://skyrim.nexusmods.com/mods/21797 - a modified version of the original Throwing Knifes that gives it it&#39;s own skill.",
  "categoryId": "73",
  "version": "1.05",
  "author": "LukeH",
  "createdUnix": "1344235665",
  "updatedUnix": "1389219970",
  "containsAdultContent": false,
  "uploadedBy": "LukeH",
  "primaryFile": null,
  "files": [
    {
      "fileId": "79162",
      "name": "MergedThieverySkill09",
      "version": "0.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "38",
      "fileName": "MergedThieverySkill09-21792-0-9.zip",
      "uploadedUnix": "1344235757",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/3e8ea3ba9b37f93b311db316584cf14ae98cd898ab43d5c500053375877908d3/analysis/1407073511/",
      "changelogHtml": " First release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MergedThieverySkill09-21792-0-9.zip?fid=79162&ttl=1535790920&ri=8192&rs=8192&setec=ec44474931fc5a4457c198d3434ab93a"
    },
    {
      "fileId": "100366",
      "name": "MergedThieverySkill10",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "25",
      "fileName": "MergedThieverySkill-21792-1-0.zip",
      "uploadedUnix": "1353278393",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/735b6556d2e3ef12357bb08999bbd8992d3ba806246f7317df98ac479ec86cb7/analysis/1407268863/",
      "changelogHtml": " Uses Skyrim update 1.8 feature to give back perk points for the perk removed <br/> \n Trainers dialogue reflecting new skill name <br/> \n Books that were increasing the two vanilla skills now all increase Thievery <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MergedThieverySkill-21792-1-0.zip?fid=100366&ttl=1535790920&ri=8192&rs=8192&setec=37537a1eea6bb6a5b939e1679a8ebbcf"
    },
    {
      "fileId": "1000090528",
      "name": "MergedThieverySkill",
      "version": "1.05",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "53",
      "fileName": "MergedThieverySkill-21792-1-05.zip",
      "uploadedUnix": "1389219970",
      "modVersion": "1.05",
      "virusScanUrl": "https://www.virustotal.com/file/aa1868cf1f2afd3a164d74e8bfc52ddb3651b4ff3b096262510b30009e112036/analysis/1407878091/",
      "changelogHtml": " Treasure Hunter moved to the Tower Stone. No perk chance is 10%, with perk was 15%, with stone is 20% now <br/> \n Fixed trainers dialogue <br/> \n Delayed the message in the perk removal function so it won&#39;t risk showing on the load screen <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MergedThieverySkill-21792-1-05.zip?fid=1000090528&ttl=1535790921&ri=8192&rs=8192&setec=edebab08d921577d78fd64745d0a98eb"
    }
  ]
}