{
  "modId": 21793.0,
  "modName": "Sarharien the Red - Follower",
  "summary": "A follower & marriage enabled NPC, located in Solitude, in the only shop that she could ever call \\\"home\\\".  Redhead who favours the bow over the blade.  She\\'s highly customized based on a number of epic mods already out on the Nexus, so please review the REQUIRED COMPONENTS before you install and activate my follower mod.",
  "descriptionHtml": "=========================================================================================\r\nSarharien the Red - v0.9 (August 6, 2012)\r\n=========================================================================================\r\n\r\nA follower & marriage enabled NPC, modelled after a mix between myself (at a much MUCH\r\nyounger age), and the brave Scottish heroine from the latest animated blockbuster by \r\nthose mousey-peoples. ;)\r\n\r\n=========================================================================================\r\nBACKGROUND\r\n=========================================================================================\r\n\r\nWho doesn\\'t think about crafting their own \\\"super-hero\\\" likeness to put into Skyrim? \r\nEspecially when you\\'re a natural redhead AND from Scottland?  I mean, come on... it was\r\njust begging to be done!  Thus was born, Sarharien - super me!  LOL  >.<\r\n\r\nI\\'m still figuring out the Creation Kit and all it\\'s features, so I don\\'t profess this mod\r\nto be anything other than my little creation project for self-enjoyment.  If you like it, \r\nbonus for you!  Either way, I appreciate the opportunity to share on the Nexus, and look\r\nforward to your feedback.\r\n\r\n\r\n=========================================================================================\r\nMOD DESCRIPTION & LOCATION\r\n=========================================================================================\r\n\r\nA follower & marriage enabled NPC, located in Solitude, in the only shop that she could \r\never call \\\"home\\\".  Redhead who favours the bow over the blade.  She\\'s highly customized \r\nbased on a number of epic mods already out on the Nexus, so please review the REQUIRED \r\nCOMPONENTS before you install and activate my follower mod.\r\n\r\nSarharien comes with some enchanted weapons and jewelry, along with clothing items that\r\n*YOU* can decide how to enchant, by using any workbench (but not at Skyforge).  Given\r\nher high degree of Marksman ability and her tendency to favour a bow over her blade, I\r\nwould recommend archery/marksman or health/stamina enchantments to augment her abilities.\r\n\r\nSarharien is flagged \\\"ESSENTIAL\\\" in this version.  Those of you familiar with the console\r\ncommands or Creation Kit, can probably figure out how to turn this \\\"off\\\" if you would \r\nprefer her to be able to die. <sob!>\r\n\r\n\r\n=========================================================================================\r\n>>>**REQUIRED COMPONENTS YOU MUST INSTALL *FIRST*, BEFORE USING MY MOD**<<<\r\n=========================================================================================\r\n\r\n1) \\\"ApachiiSkyHair\\\" v1.4 or higher by Apachii\r\n\tMust be above my mod in your load list.  Incredible epic hair of awesomeness!\r\n\tDownload from SkyrimNexus: http://skyrim.nexusmods.com/mods/10168\r\n\r\n2) \\\"Improved Freckles Skyrim\\\" by missjennabee\r\n\tThis wonderful mod author totally GETS IT when it comes to freckles.  I love her\r\n\twork, and can\\'t get enough of it!  (She does awesome screenshots too!)  \r\n\tDownload from SkyrimNexus: http://skyrim.nexusmods.com/mods/16147\r\n    \r\n3) \\\"The Chronicles of Steel -Skyrim- Realswords NEXUS EXCLUSIVE\\\" by Waalx & ShinGouki\r\n\tOkay, other than a REALLY long mod-name (LOL) this great addon has some of the\r\n\tBEST arrow/quiver graphics that I have yet to see for Skyrim.  Of course, being\r\n\ta bowchick, Sarharien uses only the *BEST* arrows.\r\n\tDownload from SkyrimNexus: http://skyrim.nexusmods.com/mods/12506\r\n\r\n4) \\\"Isilmeriel LOTR Weapons Collection\\\" by Isilmeriel\r\n\tSince my original MMO namesake started her life in LOTRO-land, I found it fitting\r\n\tto equip her with some wonderful weapons from this great mod.\r\n\tDownload from SkyrimNexus: http://skyrim.nexusmods.com/mods/5727\r\n\r\n5) \\\"Scarves of Skyrim\\\" by Natterforme\r\n\tThis incredible collection of DOZENS of scarves is an incredible, often lore-\r\n\tfriendly clothing mod to spice up your characters.  Personally, I love the \r\n\t(oddly named) \\\"Lumberjack\\\" scarf for Sarharien, as it most closely represents\r\n\ta Scottish tartan design.\r\n\tDownload from SkyrimNexus: http://skyrim.nexusmods.com/mods/16660\r\n\r\n6) \\\"Pearly-white Dress\\\" by Nayhaan\r\n\t(** Mod not required but HIGHLY recommended **)\r\n\tI\\'m sure many of you out there agree, that the default \\\"Wedding Dress\\\" in Skyrim\r\n\tis not the greatest representation of something beautiful that a bride would\r\n\twant to wear.  I mean, yes, the gown is \\\"fancy\\\", but no more so than what you\r\n\tsee on other \\\"fine clothed\\\" NPCs in the game.  However, this incredible WEDDING\r\n\tDRESS REPLACER MOD, provides a beautiful, pearl-accented, white wedding dress\r\n\tinto Skyrim, and one that I found suited Sarharien\\'s red hair and tartan scarf\r\n\tjust perfectly.  Although the mod author, site and file are Russian, many of\r\n\tus have tested the mod with the English version of Skyrim, and it works just\r\n\tfine (AFAIK texture filenames that are being replaced are the same in every\r\n\tlanguage version of Skyrim).\r\n\tDownload from Anvilbay.ru: http://anvilbay.ru/files/wbdress/\r\n\tFilename link partway down the page: ArwenWBDress.7z\r\n\r\n7) \\\"Calientes Female Body Mod Big Bottom Edition -CBBE-\\\" by Caliente **SLIM VERSION**\r\n\t(** Mod not required but recommended to match screenshots **)\r\n\tI\\'m not a huge fan of nudity mods, but I am appreciative of mods that provide\r\n\tsome reasonably improved representation of the female form as it pertains to \r\n\tmy particular taste.  Personally I have installed and am using Caliente\\'s\r\n\t**SLIM VERSION** of CBBE, as it is most compatible with a number of clothing\r\n\tmods that I enjoy, and is not \\\"over-the-top-anime-ridiculously-proportioned\\\".\r\n\tAgain, just my oppinion on the matter, and just letting you know what I\\'ve used\r\n\tduring creation of this follower mod.  I have not tested the scarves or white\r\n\twedding dress replacer on any other body/skeleton mods.\r\n\tDownload from SkyrimNexus: http://skyrim.nexusmods.com/mods/2666\r\n\t**SLIM VERSION can be found inside the main mod as an optional set of folders\r\n\t  and files to install after the main file installation. \r\n\r\n\r\n=========================================================================================\r\nCURRENT FEATURES\r\n=========================================================================================\r\n\r\nv0.9\r\n- First release.  Expecting bugs and glitches to be reported, though she\\'s worked fine\r\n  for me in game so far!\r\n\r\n=========================================================================================\r\nFUTURE PLANS\r\n=========================================================================================\r\n\r\n- Working with another mod author on a unique new bow.  Stay tuned!\r\n- Other plans unknown & undecided at this time - will review all feedback with an open mind.\r\n\r\n**BE WARNED: \r\n\tThis project is primarily for MY enjoyment, so your suggestions, pains, desires\r\n\tor complaints may not always result in changes.  ** Use at your own risk. **\r\n\r\n\r\n=========================================================================================\r\nWARNING - WARRANTEE NOT INCLUDED\r\n=========================================================================================\r\n\r\nOkay - let\\'s just all get on the same page here.  I\\'m not perfect - well, Canadian, natural\r\nredhead of Scottish origins - so close, but still, NOT perfect.  The things I create, that\r\nWE create as a community, are not perfect either.  Neither is the wonderful Skyrim game from\r\nBethesda (gasp!).  Our intentions as authors and creators however, is to get as close as we \r\ncan, with the tools and knowledge and skills available to us.  Keep this in mind when using\r\nany content for any game, along with a healthy dose of patience and tollerance, and you\\'ll\r\nenjoy the journey a lot more.\r\n\r\nI do NOT guarantee my mod or its contents to work on any computer but my own, nor do I \r\nguarantee its performance or impact on any environment other than what I\\'ve got installed \r\nmyself.  I have done my best to ensure it functions as I have advertised in this readme, \r\nhaving spent more than 10 hours of development and playtesting time with my mod content. \r\n\r\nI do NOT promise to respond to every bug, every request for enhancement, every comment nor\r\nevery email I receive regarding this mod.  I am not intentionally going to ignore them\r\neither, but please realize that I have a life, a full time job, and two wonderful teenage\r\ndaughters that keep me busy.  I game and mod for fun, and take the time out of my life when\r\nI can manage.  I will try my best to keep up with comments and bugs, and to the best of my\r\nability and with what time I have available, I will endeavor to update this mod over time.\r\n\r\nI do NOT expect everyone to love this mod.  I made it with myself in mind, and I completely\r\nunderstand that YOU are not all perfect, Canadian, natural redheads. ;)  I\\'ll just go with\r\nan expectation that I will love this mod myself - anyone else that finds joy in it, is \r\nicing on my cake! :)\r\n\r\n\r\n=========================================================================================\r\nINSTALL INSTRUCTIONS\r\n=========================================================================================\r\n\r\n>>>**PLEASE REVIEW THE \\\"REQUIRED COMPONENTS\\\" SECTION EARLIER IN THE README**<<<\r\n\t\r\n   If you DON\\'T install the required components, this MOD will likely:\r\n\t- cause errors during Skyrim loading\r\n\t- cause CTD exits during gameplay\r\n\t- cause my NPC to appear naked/unclothed\r\n\t* Do yourself a favour, install the required components, or DON\\'T USE MY MOD.\r\n\r\n\r\n>>>**NEW INSTALLATIONS**<<<\r\n\r\n1) Extract my RAR file into your Skyrim\\\\Data Folder, maintaining the folder structures,\r\n   or use NMM.\r\n\r\n2) Please install ALL the *REQUIRED COMPONENTS* listed earlier in this readme file.\r\n\r\n3) Run Skyrim Launcher, and enter \\\"DATA FILES\\\" option, ensuring that this newly added \r\n   \\\"sarharien.esp\\\" is activated for loading.  It *MUST* be loaded *AFTER* all the\r\n   *REQUIRED COMPONENTS* mentioned earlier in this readme.\r\n\r\n4) Start Skyrim, and enjoy!\r\n   **RECOMMEND you immediately make a new save game & re-load the new save before seeking\r\n     the new follower out.  Additionally, if you are already at your max number of\r\n     followers and/or already married, then those dialogue options will likely *NOT* show\r\n     up for you when you meet her.**\r\n\r\n\r\n=========================================================================================\r\nTO UNINSTALL (gasp! /sadface)\r\n=========================================================================================\r\n\r\n>>MANUAL UNINSTALL<<\r\n1) If you installed it manually, delete these files from your Skyrim folder: \r\n   \r\n      \\\\Data\\\\sarharien.esp \r\n      \\\\Data\\\\Meshes\\\\Actors\\\\Character\\\\facegendata\\\\facegeom\\\\sarharien.esp\\\\*.*\r\n      \\\\Data\\\\Textures\\\\Actors\\\\facegendata\\\\facetint\\\\sarharien.esp\\\\*.*\r\n\r\n\r\n>>OTHER INSTALL METHODS<<\r\n2) If you installed with another method, follow that method\\'s uninstallation instructions,\r\n   or manually uninstall as noted above.\r\n\r\n* Don\\'t worry, I won\\'t hold it against you - but I do thank you for trying it out anyways!\r\n\r\n\t\r\n=========================================================================================\r\nCURRENT KNOWN ISSUES\r\n=========================================================================================\r\n\r\n1) Sometimes, Sarharien won\\'t initially show you all her inventory.  Usually this can be\r\n   fixed after you trade her something.  Just re-ask her to show her your inventory, and\r\n   the second time, everything should show up.  *ALTERNATIVELY*, those of you using the\r\n   \\\"UFO - Ultimate Follower Overhaul\\\", can just ask her: \\\"You could dress better...\\\", \r\n   after which time she will correctly show you all her inventory items.\r\n\r\nIf you find issues, be so kind as to post in the comments on Skyrim Nexus for this file.\r\nI\\'m not a perfect modder - I expect errors to come up for some people.  You don\\'t have the\r\nsame system as me, nor the same settings, so don\\'t expect the same behaviour in all \r\ncircumstances!  :)  Be patient and understanding - I have done my best to avoid problems\r\nwhile allowing for a clean uninstall.  \r\n\r\n\\\"Patience is not learned in a weekend.\\\" ~Anon\r\n\r\n\r\n=========================================================================================\r\nCOMPATABILITY TESTED\r\n=========================================================================================\r\n\r\nI have personally installed and am using the following mods along with my follower mod, \r\nand do not presently suffer from any conflicts or CTDs (I have UFO loading AFTER my mod):\r\n\r\nvia Skyrim Nexus:\r\n- 83Willows 101BugsHD Butterfly Dragonfly Luna-Moth Torchbug\r\n- A Classier BB Luxury Suite\r\n- ApachiiSkyHair\r\n- Auto Unequip Arrows\r\n- Bandit Raids\r\n- Bathing Beauties or Beefcake - Luxury Suite\r\n- Better Bows\r\n- Better Circlets HQ V1o1\r\n- Cloaks of Skyrim\r\n- Glowing Ore veins 300\r\n- Improved Freckles Skyrim\r\n- JaySuS Swords\r\n- Lanterns of Skyrim - All In One\r\n- Matherian Viking Shields Set - MVSS\r\n- Modders Resource Pack\r\n- Modders Resource-Weapon Racks-Bookshelves-Plaques-Mannequins\r\n- Nicos Craftable Arrows\r\n- RANs Eybrow Replacer 01-08\r\n- RANs Eyeliner Replacer\r\n- Scarves of Skyrim\r\n- See You Sleep by Madmole\r\n- Skyrim HD - 2K Textures\r\n- The Ashen - Oriental Beauty Race\r\n- The Chronicles of Steel - Skyrim- Realswords NEXUS EXCLUSIVE\r\n- The Eyes Of Beauty\r\n- Tribunal robes set\r\n- UFO - Ultimate Follower Overhaul\r\n- Unique Booze Bottles HD\r\n- WATER - Water And Terrain Enhancement Redux\r\n- Wearable Lanterns\r\n* plus numerous add-on armors & follower NPC mods\r\n\r\nvia Steam Workshop:\r\n- City Houses Light / Shadows Fix\r\n- Complete Skyforge\r\n- Enhanced High-Level Gameplay\r\n- Isilmeriel\\'s LOTR Weapons\r\n- Legible Road Sings High Res\r\n- Open Face Guard Helms\r\n- Realistic Map + Roads !\r\n- Sounds of Skyrim - The Dungeons\r\n- Sounds of Skyrim - The Wilds\r\n- The Cartographers Map Markers\r\n- Vicious Weapon Pack\r\n\r\n\r\n=========================================================================================\r\nTHANKS & CREDITS TO OTHERS (I highly endorse and recommend all mods mentioned below!!!)\r\n=========================================================================================\r\n\r\nThanks to...\r\n\r\n- apachii: For his \\\"ApachiiSkyHair\\\" - an incredible mod giving us amazing new hairstyles\r\n\t   for our NPCs!  Highly endorsed!  http://skyrim.nexusmods.com/mods/10168\r\n\r\n- missjennabee: For her \\\"Improved Freckles Skyrim\\\" - which provides a number of new and\r\n\t\trealistic freckle options.  She\\'s also a wonderful screenshot/wallpaper\r\n\t\tartist - check out her work.  \r\n\r\n- Waalx & ShinGouki: For their \\\"Chronicles of Steel\\\" mod, adding a wonderful and varied\r\n\t\t     collection of weapons (and most importantly for me - quivers and\r\n\t\t     arrows!) into Skyrim.  \r\n\r\n- Isilmeriel: For his \\\"Isilmeriel LOTR Weapons Collection\\\" mod, which brings into Skyrim\r\n\t      a great collection of LOTR-based weapons to which I have a personal\r\n\t      fondness for.  http://skyrim.nexusmods.com/mods/5727\r\n\r\n- Natterforme: For his \\\"Scarves of Skyrim\\\" mod - an incredibly detailed and varried\r\n\t       collection of scarves and mufflers to suit nearly every need!  Many of \r\n\t       them are lore-friendly colour schemes, and are a wonderful compliment\r\n\t       to a cold or blustery day.  http://skyrim.nexusmods.com/mods/16660\r\n\r\n\t       And an additional thanks to others behind the \\\"Scarves\\\" mod:\r\n\t\t-KrimsynKane for allowing Natterforme to port his Scarves! mod to Skyrim.\r\n\t\t-Tona for permitting in his/her terms of use to allow Natterforme to \r\n\t\t freely modify his/her material with proper credit and thus allow him to \r\n\t\t port Tona\\'s scarves, mufflers, and boas to Skyrim.\r\n\t\t-Kikaimegami for her contributions in texture work on the original \r\n\t\t version of Scarves!.\r\n\t\t-Lady N for her contributions in texture work on the original version \r\n\t\t of Scarves!.\r\n\r\n- Nayhaan: For his \\\"Pearly-white Dress\\\" wedding dress replacer mod.  This dress is SO \r\n\t   BEAUTIFUL - wonderfully detailed and a joy to put on my characters.  \r\n\t   You can find his mod here: http://anvilbay.ru/files/wbdress/\r\n\r\n- Caliente: For his CBBE optional \\\"Slim CBBE\\\" mod: http://skyrim.nexusmods.com/mods/2666\r\n\r\n- j-u-i-c-e: For his great online tutorial on creating a custom follower/marriage\r\n\t     partner.  Easy to follow instructions that take you through the process.\r\n  http://j-u-i-c-e.hubpages.com/hub/Hot-to-Turn-Your-Skyrim-Character-into-a-Follower\r\n\r\n- Everyone willing to try out my mod, even if you don\\'t like it. Feedback is appreciated!\r\n\r\n- Skyrim Nexus, for their website & services hosting our mods. Happily a premium member!\r\n\r\n- Numerous fellow modders who have posted on Skyrim Nexus: Thanks to this incredible\r\n  community of helpful, talkative, descriptive and talented people, people like me have a \r\n  chance to create something wonderful in a game we all love. *THANK YOU*\r\n\r\n- Bethesda, for their great game, Skyrim.\r\n\r\n- All my peeps back on Dwarrowdelf in that \\\"other\\\" game, who are patiently awaiting my\r\n  return.  Sar the Red will be back soon!\r\n\r\n* My apologies if I\\'ve forgotten to mention anyone who has unknowingly contributed to my\r\n  mod through your own impressive material.  I have tried to carefully keep track of all\r\n  those individuals whom I have gleaned information and knowledge from (and occasionally\r\n  your wonderful content), but know I might be missing some people.  Sorry! xoxo\r\n\r\n\r\n=========================================================================================\r\nPERMISSIONS\r\n=========================================================================================\r\n\r\n- Please refrain from using the content of my mod, without first researching & contacting\r\n  the above mentioned original authors for their great content.  Their SkyrimNexus pages\r\n  are normally quite informative as to what they will allow, or not allow with regards\r\n  to the usage of their mods in your own mod.  \r\n\r\n- If you\\'re ever unclear, I find it best to contact the original mod author directly.\r\n  Most are quite reasonable in their response times to your inquiries.\r\n\r\n- This content was intended for use in Skyrim, please keep it there.\r\n\r\n- If I have incorrectly credited or (gasp!) inadvertently ommitted any mod authors who\r\n  have contributed to this work, please let me know so I can update my readme and \r\n  credits.\r\n\r\n\r\n=========================================================================================\r\nVERSION RELEASE HISTORY\r\n=========================================================================================\r\n0.9 - (2012-Aug-06) First public release posted to Skyrim Nexus. Let the feedback begin!\r\n\r\n\r\n=========================================================================================\r\nCHANGELOG\r\n=========================================================================================\r\n0.9\r\nFirst public release posted to SkyrimNexus.  \r\n\r\n=========================================================================================\r\nend of file\r\n<3 Sar",
  "categoryId": "66",
  "version": "0.9",
  "author": "Sarharien",
  "createdUnix": "1344236629",
  "updatedUnix": "1344236775",
  "containsAdultContent": false,
  "uploadedBy": "sarharien",
  "primaryFile": null,
  "files": [
    {
      "fileId": "79164",
      "name": "Sarharien_Follower_v0-9",
      "version": "0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "312",
      "fileName": "Sarharien_Follower_v0-9-21793-0-9.rar",
      "uploadedUnix": "1344236775",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/dd52ca8b7c56dba444a325b13c5132f2c1d60776e8da9cecb8a0e2abb3b56ba1/analysis/1407073512/",
      "changelogHtml": " First public release posted to SkyrimNexus.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sarharien_Follower_v0-9-21793-0-9.rar?fid=79164&ttl=1535790922&ri=8192&rs=8192&setec=b0201c53cc1a7732b6ef0edd6c6da9ad"
    }
  ]
}