{
  "modId": 21805.0,
  "modName": "Morahirs Staff Overhaul",
  "summary": "A mod that overhauls all staves in Default Skyrim so as they are batter balanced and give mages power! not just a stick with some fancy flashing",
  "descriptionHtml": "I found that in skyrim staff was mostly useless at higher levels other than for some free spells. Well I’m changing this now! I have overhauled every staff in the game in order to give them their own magical enhancements to the player. All staffs now give you Extra Magicka and Extra Magicka regeneration, Also they make the spells of the chosen staff’s archetype cheaper to cast, now as a real mage you can draw onto the true power of magical staves¬\r\n\r\n##################################################################################\r\nNotes\r\nYou must drop any staff in your inventory or that you have equipped and pick it up again for the script to start taking effect. \r\nJust to be safe make sure you have no staff equipped if you remove this mod or the buff may be stuck on your character. Better safe than sorry\r\n\r\n##################################################################################\r\n\r\nMundane\r\n\r\nThis contains all lower staves from staff of frost bite to staff of calm and even staff of Wall of Storms\r\n\r\nYou are channelling your power onto a Staff of Destruction. Your Destruction Spells drain you 20% less and +50 Magicka regeneration.\r\n\r\nYou are channelling your power onto a Staff of Alteration. Your Alteration Spells drain you 20% less and +50 Magicka regeneration\r\n\r\nYou are channelling your power onto a Staff of Conjuration. Your Conjuration Spells drain you 20% less and +50 Magicka regeneration.\r\n\r\nYou are channelling your power onto a Staff of Illusion. Your Illusion Spells drain you 20% less and +50 Magicka regeneration.\r\n\r\nYou are channeling your power onto a Staff of Restoration. Your Restoration Spells drain you 20% less and +50 Magicka regeneration.\r\n\r\n##\r\nUnique \r\n\r\nYou are channelling your power onto a Staff of Jyrik. The Staff of Jyrik Protects you from storm magic, your Destruction Spells drain you 20% less and you gain +60 Magicka regeneration.\r\n\r\n\r\n##\r\nLegendary \r\n\r\nYou are channelling your power onto the Skull of Corruption. The Skull of Corruption Drains harmful magic from around you, you take less damage from harmful spells  +80 Magicka regeneration.\r\n\r\nYou are channelling your power onto the Wabbajack. The Wabbajack is a tool of madness and thus distils some of its creator into you; your health is stronger to help you survive a mad charge into the fray. +80 Magicka regeneration.\r\n\r\nYou are channeling your power onto a Staff of Magnus. All your Spells drain you 20% less and you gain +80 Magicka regeneration.\r\n\r\nYou are channelling your power onto the Sanguine Rose. Sanguine is the lord revealing and his staff is an expansion of himself, By his wish your stamina regenerates faster so you can return to your merriment and +50 Magicka regeneration.\r\n\r\n##################################################################################\r\nConflicts \r\nWell just to point out before I get people calling me on it. This WILL conflict with anything that changes the staffs themselves HOWEVER! Any mod that changes the enchantments spells or textures of staveswill be fine! This mod added a script to ever staff to add a buff to you when you equip it then remove it again when you put the staff down.\r\n##################################################################################\r\nTo do list\r\n\r\nExpand the system to include all daedric artefacts and powerful equipment\r\nSplit the mundane category into two new groups in order to split up more powerful and less powerful staffs\r\nBalancing depends on reports\r\nAdd more unique staffs to the game with their own boons and attacks\r\n\r\n##################################################################################\r\nQ and A\r\n\r\nQ: Why so much extra magicregen?\r\nA: It needs to outweigh duel casting and I normally play of a higher difficulty if you find it to strong try turning it up, if it’s still too strong then let me know and i will do something about it :)\r\n\r\nQ: What about Dawnguard or other mod staves? \r\nA: Yeah they are not affected as i don\\'t use mods that add new staves and I don\\'t own Dawnguard yet.\r\n\r\nQ: Why expand into more than just staffs? What’s the point?\r\nA: To be fair there is no real point just the items from gods are meant to be powerful beyond belief but still I need to do this within balance of the game. Not easy.\r\n\r\nQ: I don’t see why you made this mod when I can just duel cast and stun lock foes.\r\nA: I want to make it so what staff you side to take has an effect on your game play and how you play your character, this makes it more of a choice, a new layer on mage craft so to say.\r\n\r\nQ: I like to play mages, so this sounds very interesting. One question though, does this mod remove the original enchantment from Sanguine Rose? The one that summons the Dremora Lord?\r\nA: No it removes no enchaments what so ever, this mod dosent even touch them its just adds a new layer to staffs. :) \r\n##################################################################################\r\n\r\n\r\nAnd there you have it let me know what you think.",
  "categoryId": "93",
  "version": "5",
  "author": "Morahir",
  "createdUnix": "1344251483",
  "updatedUnix": "1344251761",
  "containsAdultContent": false,
  "uploadedBy": "morahir",
  "primaryFile": null,
  "files": [
    {
      "fileId": "79201",
      "name": "Main file in rar form",
      "version": "5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Main file in rar form-21805-5.rar",
      "uploadedUnix": "1344251761",
      "modVersion": "5",
      "virusScanUrl": "https://www.virustotal.com/file/1495280b22fd214bd0edf23d0fb4eeb481526da990d0eb7da0cbab503681f140/analysis/1407073982/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20file%20in%20rar%20form-21805-5.rar?fid=79201&ttl=1535790936&ri=8192&rs=8192&setec=155ab4c8b0433ce25eceb67c5542bc80"
    }
  ]
}