{
  "modId": 21828.0,
  "modName": "Skills-based Damage and Magnitude Multipliers",
  "summary": "Weapon damages and spell magnitudes are increased by a factor dependent on the actor&#39;s Skill. At Skill 100, the factor\r<br />is x5. At Skill 1, the factor is 1. These multipliers can be configured for both players and all other actors.\r<br />",
  "descriptionHtml": "[center][size=9][color=#ff9900]Skill based damage multipliers[/color][/size][/center] \r<br />\r<br />[b]Version:[/b] 0.802 \r<br />[b]Date:[/b] 31 March 2014 \r<br />[b]Author:[/b] kuertee \r<br />[b]Source:[/b] [url=http://skyrim.nexusmods.com/mods/21828]http://skyrim.nexusmods.com/mods/21828[/url] \r<br />[b]Requirements:[/b]\r<br />\r<br />[list] [*]Skyrim 1.9[/*] \r<br />[*]Skyrim Script Extender [url=http://skse.silverlock.org/]http://skse.silverlock.org/[/url][/*] \r<br />[/list] \r<br />[b]Compatibilities:[/b]\r<br />[list]\r<br />[*]All actors will receive the damage multiplier, DamageResist bonus and the weaknesses to elemental magic.[/*]\r<br />[/list]\r<br /> \r<br />[url=http://www.skyrimgems.com][img]http://i.imgur.com/yhzxU.png[/img][/url]\r<br />\r<br />Thanks to HoppingMadMedia for featuring my mod in his video.My mod is at 7m33s:\r<br />\r<br />[youtube]fTLa2AOS5_Q?start=453[/youtube]\r<br />\r<br />Note that a copy of this document exists in the SkyrimDataDocs folder.\r<br />\r<br />[center][size=7][color=#ff9900]Short description[/color][/size][/center] \r<br />\r<br />All actors&#39; attack damages are increased based on their relevant Skill. For balance, all actors have a native weakness to Fire, Frost and Shock based on their Destruction Skill.\r<br />\r<br />[center][size=7][color=#ff9900]Updates since last release (0.801)[/color][/size][/center] \r<br />\r<br />[list] [size=5][color=#ff9900]0.802, 31 March 2014:[/color][/size][*]Bug fix: Debugging line produces error at every iteration of the code when played with the default configuration. Note that this didn&#39;t affect gameplay.[/*]\r<br />[*]Tweak: All actors that are not followers are removed from the list when moving between &#34;load doors&#34;. This should prevent the mod from processing actors that will be removed from active memory when loading finishes. This should lessen the times when the mod stalls.[/*]\r<br />[/list]\r<br />\r<br />[center][size=7][color=#ff9900]Updating[/color][/size][/center] \r<br />\r<br />[list=1] \r<br />\r<br />[*]Simply deactivate and uninstall the previous version then install and activate this version. Note that you do not need to stop the mod in-game. If you do, you will lose your accumulated mod-specific data. Let the new version back-up the data of its old version, clean-up the old data (i.e. zero-out) by stopping itself, restart itself and restore the data of the old version.[/*] \r<br />\r<br />[*]If you have Sky UI&#39;s MCM, you can check the settings in Sky UI&#39;s MCM wihtin the game.[/*] \r<br />\r<br />[*]Or check the settings in &#34;DataInikuerteeSkillBasedDamageMultipliers.ini&#34;. If you change any of it, execute your changes by typing {bat &#34;inikuerteeSkillBasedDamageMultipliers.ini&#34;} (without the brackets) in the console.[/*] \r<br />\r<br />[*]After the update is finished, the message &#34;kuSBDM v0.802&#34; will appear.[/*] \r<br />\r<br />[/list]\r<br />\r<br />[center][size=7][color=#ff9900]Gameplay changes[/color][/size][/center] \r<br />\r<br />[size=5][color=#ff9900]Skill-based damage multiplier[/color][/size]\r<br />\r<br />All actors&#39; attack damages are increased based on their relevant Skill.\r<br />\r<br />Damage from one-handed weapons are multiplied by a sliding factor based on the One-handed Skill. By default, at Skill 0, the multiplier is 1. I.e. damage is not multiplied. At Skill 100, the multiplier is 2. Damage from two-handed weapons are multiplied based on the Two-handed Skill. Damage from bows, on the Marksman Skill.\r<br />\r<br />These added multipliers are applied after all other multipliers (e.g. form chosen Perks and from enchantments) are applied.\r<br />\r<br />Because these multipliers are applied to the Actor Value, AttackDamageMult, the weapon damages in the Inventory Screen changes when you change your equipped weapons. Depending on the Skill of your newly equipped weapon, the Damage displayed for all weapons will increase or decrease. E.g. when your One-handed Skill is greater than your Marksman Skill, you&#39;ll notice the Damage for your bow decreases when you equip it after having a One-handed weapon equipped. This is because the AttackDamageMult is decreased due to your Marksman Skill being lower than your One-handed Skill.\r<br />\r<br />You can configure this for NPCs and &#34;normal&#34; creatures by setting userMultiplier to either 2 (the default), 3, 4 or 5. All NPCs and creatures that do not get classed in the other multipliers below will use this multiplier.\r<br />\r<br />Configure this for large creatures by setting userMultiplierForLargeCreatures. The default is 4. Large creatures are dragons, dwarven centurions, giants (including lurkers), mammoths and were creatures.\r<br />\r<br />Set userMultiplierForDaedra for daedric creatures. The default is 3.\r<br />\r<br />For dwarven creatures, set userMultiplierForDwarven. The default is 3.\r<br />\r<br />For undead creatures (except for vampires - which are NPCs), set userMultiplierForUndead. The default is 3.\r<br />\r<br />You can configure this for the player by setting userMultiplierForPlayer to either 2 (the default), 3, 4 or 5. Only the player will use this multiplier\r<br />\r<br />This default setting sets large and &#34;out-of-the-ordinary&#34; creatures to be deadlier than normal.\r<br />\r<br />[size=5][color=#ff9900]Block skill-based DamageResist bonus[/color][/size]\r<br />\r<br />Block skill adds a bonus DamageResist. By default, this is only enabled on creatures. Enable it for NPCs and the player in the MCM or the INI file. Note, however, that NPCs and players can use shields already. And enabling this feature on them will simply give them a bonus DamageResist regardless of their use of a shield.The data in the Creation Kit suggests that the Block skill on creatures is used for their inherent toughness of hide/skin.\r<br />\r<br />[size=5][color=#ff9900]Skill-based weakness[/color][/size]\r<br />\r<br />For balance, all actors have a native sliding weakness to Fire, Frost and Shock based on their Destruction Skill.\r<br />\r<br />By default, at Skill 0, the weakness is 25%. I.e. damage from an incoming Fire, Frost or Shock attack (elemental attack) is increased by 25%. At Skill 100, the weakness is 0%. I.e. there is no added damage from incoming elemental attacks.\r<br />\r<br />When the multiplier (i.e. userMultiplier or userMultiplierForPlayer) is 2, the weakness at Skill 0 is 25%. When the multiplier is 3, the weakness at Skill 0 is 50%. When the multiplier is 4, 75%. And when the multiplier is 5, 100%.\r<br />\r<br />[size=5][color=#ff9900]Player-level scaling[/color][/size]\r<br />\r<br />Multipliers can now scale to the user&#39;s level allowing for a less dangerous start of a new game. By default, the multipliers reach their selected values when the player is at level 10. For an experience similar to previous versions, set userLevelNeededForMaxMultiplier in the MCM or the INI file to 1.\r<br />As a reminder, this does not directly affect the actual attack multiplier. Instead, this affects the value of your mod settings. E.g. When userLevelNeededForMaxMultiplier is 10 and the value for userMultiplierForLargeCreatures is 4:\r<br />\r<br />\r<br />  Player level  multiplier for dragons  formula  \r<br />[img]https://sites.google.com/site/kuertee/kuSBDM-table-1.JPG[/img]\r<br />\r<br />The formula for the resulting multiplier is: 1 + Floor (level / userLevelNeededForMaxMultiplier * (userMultiplierForLargeCreatures - 1).\r<br />\r<br />[size=5][color=#ff9900]Increasing unarmed damage[/color][/size]\r<br />Each successful hit multipliers your next unarmed damage hit. Get hit and the multipliers are reset.\r<br />\r<br />[center][size=7][color=#ff9900]Details[/color][/size][/center] \r<br />\r<br />The formula for the damage multiplier is: current Actor Value AttackDamageMult + ((skill / 100) * (userMultiplier - 1)). Note that the AttackDamageMult Actor Value is natively at 1.\r<br />\r<br />The formula for the element weakness is: current Actor Value ResistFire - ((100 - skill) / 100 * (25 * (userMultiplier - 1))). Note that the ResistFire Actor Value is natively at 0. A positive number (e.g. from potions and enchanted armour) is a resistance. A negative number (e.g. from this mod) is a weakness.\r<br />\r<br />Note that because these effects are applied with Magic Effects in Abilities, the sliding value of multipliers and weaknesses are &#34;stepped&#34; by 10 Skill points.\r<br />\r<br />E.g. With the default multiplier of 2, the actual multiplier for Skills 1 to 10 is +0.1. For Skills 11 to 20, +0.2. For Skills 21 to 30, +0.3. Up to Skills 91 and above that results in a multiplier at +1. With the default multiplier of 2, the actual weakness for Skills 1 to 10 is -25%. For Skills 11 to 20, -22.5%. For skills 21 to 3, -20%. Down to Skills 100 and above that results in a weakness of -0% (i.e. no weakness).\r<br />\r<br />Below is a table of the attack damage multipliers, DamageResist bonuses and element weaknesses.\r<br />\r<br />[img]https://sites.google.com/site/kuertee/kuSBDM-table-3.JPG[/img]\r<br />\r<br />You can configure this mod with SkyUI&#39;s MCM or in the Console by typing &#34;SetPQV kuSBDMQ {mod data} {value}&#34;.Below are the various mod data that you can change, their default values and a short description of their effects. \r<br />\r<br />userMultiplier 2\r<br />Set to either 2 (default), 3, 4 or 5. Actors&#39; damage is multiplied by a sliding scale from 1 at Skill 0 to this value at Skill 100. Actors&#39; elemental weakness is a sliding scale from 50% (with the default of 2) at Skill 0 to 0% at Skill 100.\r<br />\r<br />userMultiplierForPlayer 2\r<br />Set to either 2 (default), 3, 4 or 5. The player&#39;s damage is multiplied by a sliding scale from 1 at Skill 0 to this value at Skill 100. The player&#39;s elemental weakness is a sliding scale from 50% (with the default of 2) at Skill 0 to 0% at Skill 100.\r<br />\r<br />userMultiplierForLargeCreatures 4\r<br />This sets the sliding multiplier for attack damage and elemental weakness for large creatures (dragons, dwarven centurions, giants and mammoths).\r<br />\r<br />userMultiplierForDaedra 3\r<br />This sets the sliding multiplier for attack damage and elemental weakness for daedric creatures.\r<br />\r<br />userMultiplierForDwarven 3\r<br />This sets the sliding multiplier for attack damage and elemental weakness for dwarven creatures - except for centurions, which are classed as large creatures.\r<br />\r<br />userMultiplierForUndead 3\r<br />This sets the sliding multiplier for attack damage and elemental weakness for undead creatures.\r<br />\r<br />userBlockIncreasesPlayerDamageResist False\r<br />When true, the Block skill adds a Damage Resist bonus (dependent on the value of userMultiplierForPlayer) to the player - regardless of their use of a shield. Enable this for a more RPG-like combat that is dependent on skill rather than &#39;twitch&#39; action.\r<br />\r<br />userBlockIncreasesNPCDamageResist False\r<br />When true, the Block skill adds a Damage Resist bonus (dependent on the value of userMultiplier) to NPCs - regardless of their use of a shield. Enable this for a more RPG-like combat that is dependent on skill rather than &#39;twitch&#39; action.\r<br />\r<br />userBlockIncreasesCreatureDamageResist True\r<br />When true, the Block skill adds a Damage Resist bonus (dependent on the value of the appropriate multiplier) to Creatures - regardless of their use of a shield.\r<br />\r<br />userLevelNeededForMaxMultiplier 10\r<br />This makes the multipliers below scale between 1 to the selected multiplier depending on the player&#39;s level. E.g. when set to 1, all multipliers are set to the selected values. When Set to 10, the multipliers scale from 1 at player&#39;s level 1 to the selected values at level 10 and more. This allows a less dangerous start of a new game.\r<br />\r<br />A configuration file (datainikuerteeSkillBasedDamageMultipliers.ini) is provided with the relevant console commands. If you want to change any of the default values above, change them in the INI file then run the file by typing {bat &#34;inikuerteeSkillBasedDamageMultipliers.ini&#34;} (without the brackets) in the console. You only need to do this when you want to change the values of the property. Your changes will be saved in your game. \r<br />\r<br />[center][size=7][color=#ff9900]Install[/color][/size][/center] \r<br />\r<br />[list=1] \r<br />\r<br />[*]Use Wrye Bash (http://skyrim.nexusmods.com/downloads/file.php?id=1840) to install this mod. Just drag the package (which is a normal ZIP file) into Wrye Bash&#39;s Installers tab. However, the package is only a normal ZIP file, so if you know the game&#39;s mod file structure, install it manually.[/*] \r<br />\r<br />[*]Change your settings within the game in Sky UI&#39;s MCM or check the settings in &#34;DataIni&#34;. If you change any of it, execute your changes by typing in the console {bat &#34;inikuerteeSkillBasedDamageMultipliers.ini&#34;} without the brackets.[/*] \r<br />\r<br />[*]Activate the mod.[/*] \r<br />\r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Uninstall[/color][/size][/center] \r<br />\r<br />[list=1] \r<br />\r<br />[*]In the console, type &#34;SetPQV kuSBDMQ uninstallNow True.&#34; Or with Sky UI&#39;s MCM, set the uninstallNow toggle to True then exit the menus.[/*] \r<br />\r<br />[*]Wait for a message confirming the uninstallation. Save the game.[/*] \r<br />\r<br />[*]Deactivate the mod with Wrye Bash. If you installed this manually, simply delete all the files you installed. (Wrye Bash keeps track of files used, so installing/uninstalling the mod with it is 100% simpler.)[/*] \r<br />\r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Troubleshooting[/color][/size][/center] \r<br />\r<br />[list] [*]You can reset the mod by typing {SetPQV kuSBDMQ resetNow True} (without the brackets) in the console. Or with Sky UI&#39;s MCM, set the resetNow toggle to True then exit the menus.[/*] \r<br />[*]When it resets it will ask you either reset all of its data or continue with the current data. Resetting all its data will remove all your configurations and set the mod as if you have first installed it.[/*] \r<br />[*]You can check all the mod&#39;s data by typing {SQV kuSBDMQ} in the console. You can check if your configurations were set in the mod properly with this.[/*] \r<br />[*]If you find that your changes (with the command SetPQV or from executing the INI) do not appear in the mod, check the command again for spelling errors. Then try again.[/*] \r<br />[*]If you find that resetting (with resetNow) and uninstalling (with uninstallNow) don&#39;t seem to work, the mod may have been suspended. It is best to simply start-over (i.e. reinstall the mod) after a &#34;clean&#34; save.[/*] \r<br />[/list]\r<br />\r<br />[size=5][color=#ff9900]Creating a clean save:[/color][/size]\r<br />\r<br />[list=1] \r<br />\r<br />[*]If you can, uninstall the mod from the console with {SetPQV kuSBDMQ uninstallNow True}.[/*] \r<br />\r<br />[*]Wait for the mod to confirm the uninstallation. It may take a minute. If no confirmation appears, then simply continue to the next step.[/*] \r<br />\r<br />[*]Save the game manually from the console by typing {save uninstalledMod}.[/*] \r<br />\r<br />[*]Uninstall all the mod&#39;s files (*.ESP, *.PSC, *.PEX) from the game folders. Make sure that none of the mod&#39;s Scripts are left. A mod manager like Wrye is best used for this.[/*] \r<br />\r<br />[*]Load the &#34;uninstalledMod&#34; save.[/*] \r<br />\r<br />[*]Save the game manually again from the console by typing {save cleanSave}. Because all of the mod&#39;s files were removed, all of its data will be &#34;zeroed&#34; in this game.[/*] \r<br />\r<br />[*]Play from this game.[/*] \r<br />\r<br />[/list] \r<br />\r<br />[size=5][color=#ff9900]Script logging[/color][/size]\r<br />\r<br />[list]\r<br />[*]As a last resort, you can also enable script logging and investigate the &#34;DocumentsMy GamesSkyrimLogsScriptPapyrus.0.log&#34; file and/or send them to me. Contact me first either on TESNexus or the official Bethesda forums.[/*]\r<br />[*]To enable script logging, set bEnableLogging, bEnableTrace and bLoadDebugInformation in the Skyrim.INI file. More information about this is in this thread in the official Bethesda Creation Kit Forum: [url=http://forums.bethsoft.com/topic/1345130-having-papyrus-trouble-here-are-some-things-to-try/] http://forums.bethsoft.com/topic/1345130-having-papyrus-trouble-here-are-some-things-to-try/[/url].[/*] \r<br />[*]Then you can set the mod&#39;s specific log operations by setting debugMode to 1 in its MCM.[/*]\r<br />[*]Play the game for 5 minutes or so - enough time for the game to capture enough events.[/*]\r<br />[*]If your logs contain &#34;Suspended stack count is over our warning threshold, dumping stacks:&#34;, then your game is suffering badly. I&#39;ve written a guide on how to clean your game and recover from it in Bethesda&#39;s official forums: [url=http://forums.bethsoft.com/topic/1481687-suspended-stack-count-is-over-our-warning-threshold/]http://forums.bethsoft.com/topic/1481687-suspended-stack-count-is-over-our-warning-threshold/[/url].[/*]\r<br />[*]Then send the the &#34;DocumentsMy GamesSkyrimLogsScriptPapyrus.0.log&#34;, &#34;DocumentsMy GamesSkyrimLogsScriptUserkuSBDMQs.0.log&#34; to kuertee@gmail.com.[/*]\r<br />[/list]\r<br />\r<br />[center][size=7][color=#ff9900]History[/color][/size][/center] \r<br />\r<br />[list] [size=5][color=#ff9900]0.801, 11 March 2014:[/color][/size][*]Tweak: When in Vampire Lord or Werewolf form, your attack damage is multiplied according to your One-Handed skill level. Note that the unarmed damage multipliers when you avoid getting hit still applies.[/*]\r<br />[size=5][color=#ff9900]0.8, 10 February 2014:[/color][/size][*]Bug fix: The increasing unarmed damage feature was getting applied to creatures.[/*]\r<br />[*]Bug fix: Better detection of invalid actors (i.e. actors not in active memory). Previously, some invalid actors were not getting removed from aliases.[/*]\r<br />[*]Bug fix: (Again:) In previous version, no new creatures were getting added to the multiplier aliases after sometime of playing.[/*]\r<br />[size=5][color=#ff9900]0.705, 28 December 2013:[/color][/size][*]New feature: Increasing unarmed damage. Each successful hit multiplies your next unarmed damage hit. Get hit and the multipliers are reset.[/*]\r<br />[*]Bug fix: In previous version, no new creatures were getting added to the multiplier aliases after sometime of playing.[/*]\r<br />[size=5][color=#ff9900]0.703, 15 October 2013:[/color][/size][*]New feature: Mutlipliers for animals. Set userMultiplierForAnimals for this. The default is 3. After playing Far Cry 3, I find that animals in Skyrim could be a little bit more dangerous.[/*]\r<br />[size=5][color=#ff9900]0.702, 10 July 2013:[/color][/size][*]New feature: Different multipliers for these types: creatures and NPCs, large creatures (dragons, dwarven centurions, giants and lurkers, mammmoths and were creatures), daedra, dwarven automatons and undead. By default, large creatures are set at x4. Daedra, dwarven automatons and undead creatures are set at x3. All others at x2. And the player at x2. This default setting sets large and &#34;out-of-the-ordinary&#34; creatures to be deadlier than normal. Change these values in the MCM or the INI file.[/*]\r<br />[*]New feature: Block skill adds a bonus DamageResist. By default, this is only enabled on creatures. Enable it for NPCs and the player in the MCM or the INI file. Note, however, that NPCs and players can use shields already. And enabling this feature on them will simply give them a bonus DamageResist regardless of their use of a shield. The data in the Creation Kit suggests that the Block skill on creatures is used for their inherent toughness of hide/skin.[/*]\r<br />[*]New feature: Multipliers can now scale to the user&#39;s level allowing for a less dangerous start of a new game. By default, the multipliers reach their selected values when the player is at level 10. For an experience similar to previous versions, set userLevelNeededForMaxMultiplier in the MCM or the INI file to 1.\r<br />As a reminder, this does not directly affect the actual attack multiplier. Instead, this affects the value of your mod settings. E.g. When userLevelNeededForMaxMultiplier is 10 and the value for userMultiplierForLargeCreatures is 4:  Player level  multiplier for dragons  formula    1             x 1                     1 + Floor (1 / 10 * (4 - 1)) = 1 + Floor (0.3) = 1 + 0 = 1 -   5             x 2                     1 + Floor (5 / 10 * (4 - 1)) = 1 + Floor (1.5) = 1 + 1 = 2 -   8             x 3                     1 + Floor (8 / 10 * (4 - 1)) = 1 + Floor (2.4) = 1 + 2 = 3 -   10 and above  x 4                     1 + Floor (10 / 10 * (4 - 1)) = 1 + Floor (3) = 1 + 3 = 4 - [img]https://sites.google.com/site/kuertee/kuSBDM-table-1.JPG[/img][/*][*]Tweak: You can now change user settings before the main quest is at stage 5 (e.g. before leaving Helgen).[/*]\r<br />[*]Tweak: The main package and the MCM can now be merged manually (with TES5Edit). Removing the reliance on GetFormFromFile () from the MCM discovery code made this possible. In this new version, SendModEvent () is used by the main package and the MCM to &#34;ping&#34; each other.[/*]\r<br />[size=5][color=#ff9900]0.520, 10 April 2013:[/color][/size][*]Tweak: Recompiled with Skyrim&#39;s 1.9 patch and SkyUI&#39;s 3.4 patch.[/*]\r<br />[*]Bug fix: Previously, the player wasn&#39;t getting the multipliers when the x3 multiplier is used.[/*]\r<br />[size=5][color=#ff9900]0.518, 21 February 2013:[/color][/size][*]New feature: reprogrammed the mod to use spells rather than perks (which only worked on the player). I mistakenly thought that it the perks worked on NPCs because of other factors built into the previous version. Thanks Duke (spookyfx.com) for insisting that Perks worked only on the player.[/*]\r<br />[size=5][color=#ff9900]0.5, 7 August 2012:[/color][/size] [*]Initial release.[/*] \r<br />[/list] \r<br />\r<br />[center][size=7][color=#ff9900]Credits[/color][/size][/center] \r<br />\r<br />kuertee in http://www.bethsoft.com/bgsforums/ \r<br />\r<br />[center][size=7][color=#ff9900]Tools Used[/color][/size][/center] \r<br />\r<br />Creation kit - http://www.creationkit.com \r<br />\r<br />[center][size=7][color=#ff9900]Licensing/Legal[/color][/size][/center] \r<br />\r<br />You can do whatever you want with this mod but all I ask in return is that you give me credit. I would also like to be contacted when you include this mod in part or in full in a public release. ",
  "categoryId": "77",
  "version": "0.802",
  "author": "kuertee",
  "createdUnix": "1344275042",
  "updatedUnix": "1396219167",
  "containsAdultContent": false,
  "uploadedBy": "kuertee",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000100779",
      "name": "kuertee Skills-based damage multipliers 0p801",
      "version": "0.801",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "153",
      "fileName": "kuertee Skills-based damage multipliers 0p801-21828-0-801.zip",
      "uploadedUnix": "1394504607",
      "modVersion": "0.801",
      "virusScanUrl": "https://www.virustotal.com/file/6848cd796b11b9b51c1214f5e2df21a75c8139102d25a716c5550216ef1f67bd/analysis/1407977595/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuertee%20Skills-based%20damage%20multipliers%200p801-21828-0-801.zip?fid=1000100779&ttl=1535790978&ri=8192&rs=8192&setec=74d5560fbc9dadd62f77ce1bc3fa6691"
    },
    {
      "fileId": "1000100780",
      "name": "kuSBDM x MCM 0p801",
      "version": "0.801",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "kuSBDM x MCM 0p801-21828-0-801.zip",
      "uploadedUnix": "1394504793",
      "modVersion": "0.801",
      "virusScanUrl": "https://www.virustotal.com/file/b24f27396fefe8d31c727c495eb0ff51d98c33e926ed0de0d5ec992a0bb23b4b/analysis/1407977595/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuSBDM%20x%20MCM%200p801-21828-0-801.zip?fid=1000100780&ttl=1535790979&ri=8192&rs=8192&setec=47f5ed4f8b204ed9c1a168b7ce694d6e"
    },
    {
      "fileId": "1000100781",
      "name": "kuSBDM merged with MCM 0p801",
      "version": "0.801",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "164",
      "fileName": "kuSBDM merged with MCM 0p801-21828-0-801.zip",
      "uploadedUnix": "1394504901",
      "modVersion": "0.801",
      "virusScanUrl": "https://www.virustotal.com/file/92e73718ca76a71664d4d897c035ca38b6503f19ec58ec092ecabaa0db769c46/analysis/1407977596/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuSBDM%20merged%20with%20MCM%200p801-21828-0-801.zip?fid=1000100781&ttl=1535790979&ri=8192&rs=8192&setec=7ebda0a651f4a0c167465d224405dc5c"
    },
    {
      "fileId": "1000103089",
      "name": "kuertee Skills-based damage multipliers 0p802",
      "version": "0.802",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "153",
      "fileName": "kuertee Skills-based damage multipliers 0p802-21828-0-802.zip",
      "uploadedUnix": "1396218911",
      "modVersion": "0.802",
      "virusScanUrl": "https://www.virustotal.com/file/9b27467229918b5311b1dc820e78c1d188369c16392bb7b9dee394447e11dda7/analysis/1408001404/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuertee%20Skills-based%20damage%20multipliers%200p802-21828-0-802.zip?fid=1000103089&ttl=1535790979&ri=8192&rs=8192&setec=04dfe0fdb5f602550eeb28d8a18bdb35"
    },
    {
      "fileId": "1000103090",
      "name": "kuSBDM x MCM 0p802",
      "version": "0.802",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "12",
      "fileName": "kuSBDM x MCM 0p802-21828-0-802.zip",
      "uploadedUnix": "1396219001",
      "modVersion": "0.802",
      "virusScanUrl": "https://www.virustotal.com/file/8563e40e6f4ade2ab2b1ece4211cdffd0e0ccb7af170c79a344dc29f33b1a90b/analysis/1408001404/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuSBDM%20x%20MCM%200p802-21828-0-802.zip?fid=1000103090&ttl=1535790980&ri=8192&rs=8192&setec=18786ed98fb32c30be6ed7b0db58f31b"
    },
    {
      "fileId": "1000103091",
      "name": "kuSBDM merged with MCM 0p802",
      "version": "0.802",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "164",
      "fileName": "kuSBDM merged with MCM 0p802-21828-0-802.zip",
      "uploadedUnix": "1396219167",
      "modVersion": "0.802",
      "virusScanUrl": "https://www.virustotal.com/file/5adcf29d06ad0add38d8a835fbeae04691ccc8c595929228c41f7d0aabb84543/analysis/1408001405/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kuSBDM%20merged%20with%20MCM%200p802-21828-0-802.zip?fid=1000103091&ttl=1535790981&ri=8192&rs=8192&setec=99238b78e6b94b06a24bb4a7e05ca61e"
    }
  ]
}