{
  "modId": 21844.0,
  "modName": "Tiber Septim Armor",
  "summary": "Adds Tiber Septim\\'s armor as a standalone, craftable armor set.",
  "descriptionHtml": "Tiber Septim Armor by icedrake523\r\n\r\nPlease leave any feedback, questions or issues with this mod in the comments. Thank you!\r\n\r\n-----------\r\nChange Log\r\n----------\r\n08/06/2012 - version 0.0 released\r\n\r\n\r\n--------\r\nHistory\r\n--------\r\n\r\nA little history of how this mod came to be...\r\n\r\nThe Armor of Tiber Septim was a quest item in Oblivion (Blood of the Divines quest) but you weren\\'t able to wear it which I found disappointing. The Tiber Septim statues all throughout Skyrim are really cool but there was no in-game armor that resembled it and no one has made a mod for one. I wanted to use something, so I first just looked for mods with parts I liked and wore those pieces.\r\n\r\nFirst, I liked the Heroic Imperial Armor from the Lore Friendly Armor pack by Rahman30 (and now a part of hothtrooper44\\'s Immersive Armors), but I wanted it to be blue instead of red. So I took a stab at my first rexturting and it came out rather well. Then I thought I\\'d try to make it a standalone set of armor. I decided to replace the Imperial gauntlets and boots with Steel Plate.\r\n\r\nFor the helmet, I wanted something like the statues of Tiber Septim located throughout the game but I could only find 2 mods that created a helmet. One was Nordic Conqueror Armor by frankdema. The other was The Heart of Thunder by EternalKnights. I chose the latter but both are excellent armor mods.\r\n\r\n------------\r\nDescription\r\n------------\r\n\r\nThis mod adds a standalone, craftable set of heavy armor to Skyrim. The cuirass, boots, and gauntlets are compatible with all the races since they are the vanilla meshes. The helmet is not compatible with Argonians, Khajiits, or Orcs.\r\n\r\nThe armor is only craftable at the Skyforge under the Imperial category and requires both the Ebony Smithing AND Arcane Blacksmith perks.\r\n\r\nThe statistics are between Daedric and Dragonplate. The Septim value is very high but I think it should be.\r\n\r\nHere\\'s the information for each piece of armor (Weight/Value/Armor Rating)\r\n\r\nTiber Septim\\'s Armor (xx000D64)\r\n45/4000/48\r\nRecipe: 1 Dragon Bone, 2 Corundum Ingots, 5 Steel Ingots, 3 Leather Strips\r\nTemper Cost: 1 Corundum Ingot\r\n\r\nTiber Septim\\'s Boots (xx000D62)\r\n9/700/18\r\n1 Dragon Bone, 1 Corundum Ingot, 2 Steel Ingots, 2 Leather Strips\r\nTemper Cost: 1 Corundum Ingot\r\n\r\nTiber Septim\\'s Gauntlets (xx000D63)\r\n9/700/18\r\n1 Dragon Bone, 1 Corundum Ingot, 2 Steel Ingots, 2 Leather Strips\r\nTemper Cost: 1 Corundum Ingot\r\n\r\nTiber Septim\\'s Helm (xx000D65)\r\n8/2000/32\r\n1 Dragon Bone, 1 Corundum Ingot, 2 Steel Ingots, 2 Leather Strips\r\nTemper Cost: 1 Corundum Ingot\r\n\r\nTo add them via the Command console, enter:\r\nhelp \\\"tiber septim\\\" 0\r\n\r\nYou should see the armor items listed. Enter:\r\nplayer.additem [id] [quanity]\r\n\r\nI included their IDs next to them. XX is where the plugin is in your load order. Double check them through the command console though.\r\n\r\n\r\nTip: JaySuS Swords and Cloaks of Skyrim go really well with this. I recommend using both.\r\n\r\n\r\n\r\n-----------\r\nInstalling\r\n------------\r\n\r\nMy mod is compatible with Nexus Mod Manager and I recommend using it.\r\n\r\nManual Installation is also possible but requires more steps.\r\nDownload the file and extract it\\'s contents onto your PC (I recommend Desktop). Copy the TiberSeptimArmor.ESP to your Skyrim/Data folder.\r\nThen merge the meshes and Textures folders with the Skyrim/Data/meshes and Skyrim/Data/Textures folders, respectively.\r\n\r\n\r\n-------------\r\nUninstalling\r\n-------------\r\n\r\nDeactivate the mod through Nexus Mod Manager (if you installed it that way).\r\n\r\nManual Uninstallation: Delete the TiberSeptimArmor.ESP, Skyrim/Data/meshes/armor/TiberSeptim and Skyrim/Data/Textures/TiberSeptim folders.\r\n\r\n\r\n--------------\r\nCompatibility\r\n--------------\r\n\r\nDawnguard literally came out as I was working on this mod. I have no plans to purchase Dawnguard in the near future so I won\\'t be able to find out first hand. I don\\'t expect there to be any issues though.\r\n\r\nThis mod uses its own meshes. The only vanilla textures it uses are the [armorpart]_m.dds and [armorpart]_n.dds. Any mod that makes changes to them will be applied to this armor set as well.\r\n\r\nThere will likely be clipping issues with any mod that adds hair or a new race as the helmet was designed for only the vanilla humanoid races.\r\n\r\nCheck the ReadMe for a list of mods I use and confirm are compatible with my mod.\r\n\r\n\r\n-------------\r\nKnown Issues\r\n-------------\r\n\r\nElf ears and some hair styles clip through the helmet\r\n-Unfortunately, this is something that is really difficult to fix. The Steel Plate helmet was made to conceal the player\\'s entire head, so there\\'s issues with using it as an open faced helmet. I did not make the mesh, I\\'m not skilled enough to at this point, so I can\\'t attempt to fix it myself. All I can say is that if Bethesda ever releases a helmet that matches what I want, I will replace my current mesh with that one.\r\n\r\nHelmet is invisible on Argonians, Khajiits, and Orcs\r\n-Again, a side effect of the helmet mesh since it was designed for a humanoid head. I would like to make a version that at least appears as the vanilla Steel Plate helmet when they equipped.\r\n\r\nHood on the cuirass does not match sleeves/pants.\r\n-This is something that is tough to match. I will be working on improving the textures when I can so this is something I will try to do. In the mean time, I will say they\\'re different colors because they\\'re different materials, the cape on the cuirass being a finer quality. I am considering making the hood match one of the Cloaks of Skyrim cloaks so its less noticeable when you wear it. Of course this would mean the hood won\\'t match the sleeves and pants of the armor.\r\n\r\nVanilla Steel Plate armor textures visible between the legs.\r\n-You can see some of the Steel Plate armor texture between the legs (the front when the camera is at a certain angle behind your character, vice versa for the back) as the Heroic Imperial cuirass uses some of the Steel Plate textures. I may try to fix this but it\\'s kind of difficult to get it perfectly right. These issues exist with the Heroic Imperial Armor as well.\r\n\r\n--------------\r\nFuture Planes\r\n--------------\r\n-Create an appropriate enchanted, non-craftable version. I\\'m not sure what the enchantments should be so suggest some in the comments. Right now my ideas are...\r\nBoots: Resist Fire and Shock (Tiber Septim was a Nord and had natural Frost resistance)\r\nCuirass: Fortify Health and Stamina (either increase total or regeneration)\r\nGauntlets: Increased One-Handed and Two-handed attacks (redundant but I don\\'t really feel like making a separate version to satisfy different users).\r\nHelmet: (Uncertain for this. I was thinking 25-30% Shout cooldown reduction, but the Amult of Talos already exists in-game. Leave a suggestion in the comments)\r\n\r\n-Create a treasure hunt to find the enchanted version in-game (it won\\'t be an actual quest in your journal since I\\'m new at mod making but I will try to make it interesting)\r\n\r\n-Possibly adjust armor ratings, recipies, or requirements based on feedback.\r\n\r\n-Improve texture quality (low priority, will be on-going)\r\n\r\n\r\n---------\r\nQuestions\r\n---------\r\n\r\nQuestions I\\'m anticipting....\r\n\r\nWhy require both Arcane Blacksmith and Ebony Smithing perks?\r\nI have it require the Arcane perk to craft because Tiber Septim is one of the Nine Divines. So his armor is \\\"enchanted\\\" even if not in the literal sense. I was going to require the Dragon Armor perk but Dawnguard will release Dragonbone weapons and I didn\\'t want to have to go back and change things if they altered the perk. I didn\\'t want to require Daedric smithing because Tiber Septim is one of the Nine Divines/Aedra, not Daedra. It just didn\\'t make sense lore wise, so that left me with Ebony.\r\n\r\nWhy require Dragon Bones?\r\nTiber Septim was a Dragonborn (though he never fought any dragons) and I wanted a significant recipe for this armor since it is powerful and Dragon Bones made the most sense. I figure people have a lot lying around anyway before they unlock the Dragon Armor perk.\r\n\r\nWhy does the female version look like male armor?\r\nI did not implement a female mesh, so the game uses the male version when a female character equips it. I will not make a female version because the purpose of this mod is to add Tiber Septim\\'s Armor to the game and Tiber Septim was a man.\r\n\r\nWill you make a Light Armor version?\r\nI don\\'t think so. I used the Heroic Imperial and Steel Plate parts to make it which are Heavy Armor, it wouldn\\'t make much sense for a light version.\r\n\r\nI would prefer a red version. Can you make one?\r\nMaybe but it will be difficult to have it match the hood of the cuirass. I prefer to work on resolving any issues and the treasure hunt/quest first.\r\n\r\nWill you make the helmet compatible with Khajiits/Argonians/Orcs?\r\nThe helmet as it appears on the humanoid races won\\'t be compatible with the 3 beast races. However, I would like to have it that the helmet appears as the vanilla Steel Plate helmet when those races equip it. The mesh will be vanilla but the texture will be the Ornate Steel Plate texture so it\\'s at least different.\r\n\r\nWill you make a Lorecraft or SkyRe Plugin?\r\nI\\'m actually interested in making a Lorecraft plugin (since it could tie in well with my future plans) but I will have to do some research into that as I myself don\\'t use Lorecraft. As for SkyRe, probably not.\r\n\r\nWill you release this on Steam Workshop?\r\nNo out of respect to the creators of the assets I have used for this mod. As far as I know, their mods are all Nexus-exclusive and I will keep mine the same.\r\n\r\nWhy does the helmet look like the vanilla Steel Plate helmet in the smithing menu and when it\\'s dropped?\r\nI use the vanilla mesh (but with the Ornate texture) for this instance to avoid potential issues. It will still appear as intended when it is equipped to a character or mannequin.\r\n\r\n\r\n\r\n--------\r\nCredits\r\n--------\r\nPhilSchmidheiny - Ornate Steel Plate Armor Texture - Resource\r\nhttp://skyrim.nexusmods.com/mods/12363\r\nI used his Steel Plate helmet, boots, and gauntlet textures. They really help the armor stand out from the vanilla Steel Plate.\r\n\r\nRahman530 - Lore-Friendly Armor pack\r\nhttp://skyrim.nexusmods.com/mods/6684\r\nThe original creator of the Heroic Imperial Armor that inspired this mod.\r\n\r\nhothtrooper44 - Immersive Armors\r\nhttp://skyrim.nexusmods.com/mods/19733\r\nFor carrying on the Lore-Friendly Armor pack and his continued work on one of the best armor compilation mods ever. It was while using this mod that I was inspired to create this armor.\r\n\r\nOminousVoice - Heart of Thunder mod\r\nhttp://skyrim.nexusmods.com/mods/8566\r\nWithout his helmet mesh, this could not exist so immense thanks to him.\r\n\r\nfrankdema - Nordic Conqueror Armor \r\nhttp://skyrim.nexusmods.com/mods/20780\r\nI originally used the helmet texture from his armor mod. When I asked permission, he informed me he used the Ornate Steel Plate Armor Texture. So while I don\\'t use any of his assets in the released version, I will still credit him for his help and his Conqueror armor that helped inspire making this mod.\r\n\r\nBethesda Game Studios for creating Skyrim, its Creation Kit, and the original assets the aforementioned modders and myself have used.\r\n\r\n-----------\r\nTools Used\r\n-----------\r\nBethesda Creation Kit - for creating the .ESP plugin and its necessary files\r\nGIMP 2.0 - for converting textures from DDS to PSD\r\nAdobe Photoshop CS4 - for editing the textures\r\nNifSkope - for applying the textures to the meshes\r\nFallout Mod Manager - for extracting the vanilla meshes and textures\r\n\r\n-----------\r\nPermissions\r\n-----------\r\n\r\nI DO NOT give permission of any kind to use the assets from this mod to be distributed elsewhere or used in any other mods. Under normal circumstance I would allow permission if requested but I am not the owner of these assets. If you wish to use them, you must request permission\r\n\r\nNO CBBE, UNP, or SKIMPY/REVEALING VERSIONS. People do a great job of making these but I hate them.\r\n\r\nNO MOD PLUGINS. This applies to LoreCraft, SkyRe, or anything else. I don\\'t use mods that require plugins, so I have no need to make it myself.\r\n\r\nNO TRANSLATIONS. Tiber Septim is part of the Elder Scrolls lore, so I see no reason to translate his name. The only other words are Armor, Boots, Gauntlets, and Helmet. I figure most non-English speakers can figure out what they are by the images of them in the menu. Sorry, but it\\'s because I do not consider myself the owner of these assets and don\\'t want anyone modifying them.",
  "categoryId": "54",
  "version": "0.0",
  "author": "icedrake523",
  "createdUnix": "1344285154",
  "updatedUnix": "1344286364",
  "containsAdultContent": false,
  "uploadedBy": "icedrake523",
  "primaryFile": null,
  "files": [
    {
      "fileId": "79308",
      "name": "Tiber Septim Armor",
      "version": "0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12428",
      "fileName": "Tiber Septim Armor-21844-0-0.rar",
      "uploadedUnix": "1344286364",
      "modVersion": "0.0",
      "virusScanUrl": "https://www.virustotal.com/file/9d834c3f39555c5fe936068fc4ae526be7f6151e58f29b9548a8ad038b10d1ae/analysis/1407075141/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tiber%20Septim%20Armor-21844-0-0.rar?fid=79308&ttl=1535791002&ri=8192&rs=8192&setec=65e50df487220143638a843a2ceecb37"
    }
  ]
}