{
  "modId": 21899.0,
  "modName": "Destruction Scaling Damage Enchantment",
  "summary": "Allows destruction to scale with enchanting.",
  "descriptionHtml": "I was becoming increasingly annoyed with how feedble Destruction Magic becomes as levels advance, and dissatisfied with the various perk/script/overpowered base spell soultions to the problem.\r\n\r\nThis adds a necklace that provides a percentage increase in destruction damage, in line with the Archery and One Handed enchantments available. The Necklace can be disenchanted and the effect applied to armour at the user\\'s discretion. Do note that this will modify ALL damage in the destruction school dealt by the Player Character. Note that mana cost in the screenshot increases because I replaced a necklace with reduced cost, this effect does NOT increase mana costs.\r\n\r\nFeralda in the College of Winterhold will sell the amulet to Masters of Destruction Magic. People intent on acquiring it earlier can find it at the Riverwood Trader (there is no stat requirement to buy it there, except for the purchase price).\r\n\r\nInstallation - Add the esp to your Skyrim/Data folder and activate it in the launcher.\r\n\r\nUninstallation - Deactivate the file from the launcher and remove the esp file.\r\n\r\nConflicts - This meddles with the Merchant Chests of the Riverwood Trader and Faralda, and will conflict with anything which modifies those.",
  "categoryId": "75",
  "version": "0.1",
  "author": "J Wallace",
  "createdUnix": "1344359919",
  "updatedUnix": "1344360054",
  "containsAdultContent": false,
  "uploadedBy": "johnmedgla",
  "primaryFile": null,
  "files": [
    {
      "fileId": "79505",
      "name": "Destruction Damage Scaling Enchantment",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Destruction Damage Scaling Enchantment-21899-0-1.zip",
      "uploadedUnix": "1344360054",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/4b0da822c7cb7ca0e2f89ecb98a86149c47d54501a6450d5e6266ed554993750/analysis/1407077223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Destruction%20Damage%20Scaling%20Enchantment-21899-0-1.zip?fid=79505&ttl=1535791101&ri=8192&rs=8192&setec=0d40723476d5707c7309e68486e4fae8"
    }
  ]
}