{
  "modId": 21907.0,
  "modName": "Beauties Of Skyrim",
  "summary": "Adds 7 Beautiful Companions to Skyrim.",
  "descriptionHtml": "!!!!!ATTENTION!!!!!\r\nThis mod requires Apachii Sky Hair to function properly. http://skyrim.nexusmods.com/mods/10168/\r\n\r\nAnd if you don\\'t like it, don\\'t freaking look at it!! All these comments about their eyes are pissing me off greatly. I\\'m sorry, I didn\\'t know that when you have a companion, you stare in their eyes the whole damn time.\r\n\r\nThis mods adds 7 marriageable Companions to Skyrim. The girls can be found in the Bannered Mare in Whiterun. Note: All Mages have to ability to conjure atronachs, and the Twin Souls perk, which allows them to summon two at the same time.                                                        \r\n                                                        \r\n                                                          ~Girls~\r\n-Alana: Level 50, Health 550, Magicka 150, Stamina 370. One-handed warrior skilled in light armor.\r\n\r\n-Alyssa: Level 60, Health 450, Magicka 1000, Stamina 250. Destruction Frost mage skilled in all magic elements. Available spells: Paralyze, Frostbite, Frost Cloak, Healing, Ice Storm, Icy Spear, and Ironflesh.\r\n\r\n-Lilyanna: Level 60, Health 750, Magicka 200, Stamina 650. Warrior skilled in one-handed, and archery. Uses heavy armor.\r\n\r\n-Laila: Level 65, Health 800, Magicka 555, Stamina 655. Fantastic archer. More skilled in archery than one & two-handed weapons. Use light armor more effectively. \r\n\r\n-Ariann: Level 50, Health 550. Magicka 400, Stamina 500. Warrior, trained better in two-handed than one-handed (95 & 60) Trained better in heavy armor, than light.\r\n\r\n-Chrysanthemum: Level 50, Health 500, Magicka 800, Stamina 300. Destruction Fire Mage skilled in all magical elements. Available spells: Conjure Flame and Frost Atronach, Dragonhide, Ebonyflesh, Fast Healing, Fireball, Firebolt, Fire Rune, Flames, Incinerate, and Flame Thrall.\r\n\r\n-Alexia: Level 60, Health 500, Magicka 350, Stamina 400. Warrior, more skilled in one-handed than two-handed (95 & 65) Better trained in heavy armor, than light.\r\n\r\n\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\nTo get the followers in the gear shown in the screenshots, you have to 1. Tell them to follow you. 2. Trade with them. 3. Take whatever you don\\'t want them to wear. 4. Take the weapons from the mages, as they use magic.\r\n\r\nMods to have them look like they do in they pics: (Note: Not having these mods won\\'t break anything)\r\n\r\n1. Remodeled Armor by MAK http://skyrim.nexusmods.com/mods/13004/\r\n2. Caliente\\'s Big Bottom Edition CBBE http://skyrim.nexusmods.com/mods/2666\r\n3. Better Females by Bella http://skyrim.nexusmods.com/mods/2812\r\n4. Ambrosia Fashions http://skyrim.nexusmods.com/mods/20924\r\n",
  "categoryId": "66",
  "version": "1.0",
  "author": "Jewel",
  "createdUnix": "1344371670",
  "updatedUnix": "1344391188",
  "containsAdultContent": false,
  "uploadedBy": "Jewel622651",
  "primaryFile": null,
  "files": [
    {
      "fileId": "79599",
      "name": "All 9 Beauties",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3199",
      "fileName": "All 9 Beauties-21907-1-0.7z",
      "uploadedUnix": "1344391188",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/854d0174c1ccf177b57c147c5e7cddd833eaf142198f77100d216efab6cd2cc4/analysis/1407078125/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%209%20Beauties-21907-1-0.7z?fid=79599&ttl=1535791117&ri=8192&rs=8192&setec=e8628c6762333374249459be22da3626"
    }
  ]
}