{
  "modId": 2190.0,
  "modName": "Archetypes- Raziq_The Redguard Merchant Mage",
  "summary": "(Level 8 Starter Character) \r\nSmithing, Alteration, and Enchanting has always come easily to Raziq.  He learned from his mentor how to transmute iron into silver, and silver into gold.  He is adept at crafting wondrous jewelry, which he then imbues with magical properties.  As a result of his practice in magic he is also a capable Adventure Mage.",
  "descriptionHtml": "This is a level 8 starter character that took me way too many hours to create.  I had an idea for someone who used alteration, enchanting, and smithing to create magic jewelry for fun and profit, and found so much synergy on the combat side that I just HAD to make this character.  He wears the Redguard outfit from the guy in the Dark Brotherhood, which has been enchanted like a mage robe.  I also included a few more copies of that outfit for your own enchanting pleasure.  \r\n\r\nI went to great pains not to make him overpowered.  This is a simple level 8 character, skilled up just enough to set you on the right path.\r\n\r\nHe is freshly created, having only just arrived in Whiterun before the Jarl.  Enjoy!\r\n\r\n------------------------------------------------------------\r\n\r\nA short biography:\r\n\r\nFollowing the Empire\\'s abandonment of Hammerfell to Dominion aggression, Raziq fled to Skyrim, where he has been plying his trade ever since.  \r\n\r\nRecently, he was arrested without charge and sentenced to execution alongside a group of Stormcloaks.  He has a deep animosity towards all Thalmor and the Empire, only fueled by his current troubles.\r\n\r\n------------------------------------------------------------\r\n\r\nTraits- Smithing, Alteration, and Enchanting has always come easily to Raziq.  He learned from his mentor how to transmute iron into silver, and silver into gold.  He is adept at crafting wondrous jewelry, which he then imbues with magical properties.  As a result of his practice in magic he is also a capable Adventure Mage.\r\n\r\nSkills- Like all Redguard, Raziq excels in some form of combat.  His weapon of choice is the one-handed sword.  He is also beginning his study of destruction and restoration magic as he travels the road in search of profit.\r\n\r\nWeapons- Raziq wields the scimitar.  He comes equipped with two custom weapons, Sand (His fire sword), and Soul (his Soul Siphoning Sword)\r\n\r\nArmor- Preferring the free-flowing garb of his homeland, Raziq wears the traditional Redguard clothing, enchanted to boost his Magicka.\r\n\r\nOther thoughts:  \r\n\r\nWield the sword in one hand, and spell in the other.  Alteration will supply his armor buffs, and restoration can also provide him with a ward spell.  If ranged firepower is needed, sheath the sword and unleash hell-- once magicka is depleted, switch to dual scimitars and slice them up.\r\n\r\nAlso, I gave him the Dark Brotherhood mage gloves because of their look.  They provide double sneak attack damage for one handed weapons.  You can take advantage of this by training sneak.  Or better yet, level up illusion to finish up the mage theme and use invisibility!",
  "categoryId": "43",
  "version": "",
  "author": "Beld",
  "createdUnix": "1322712010",
  "updatedUnix": "1323139928",
  "containsAdultContent": false,
  "uploadedBy": "Beld",
  "primaryFile": null,
  "files": [
    {
      "fileId": "5786",
      "name": "Raziq_Level 8",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1345",
      "fileName": "Raziq_Level 8-2190.zip",
      "uploadedUnix": "1322712128",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/b24ce9c3756110a5182417195340d0895bb144f051fa3ce5ac4dd6f37e32ad4b/analysis/1406463664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Raziq_Level%208-2190.zip?fid=5786&ttl=1535756317&ri=8192&rs=8192&setec=37d7f0f422b97c0c91356e4b8eb5aefc"
    },
    {
      "fileId": "7483",
      "name": "Raziq_Level 1",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1330",
      "fileName": "Raziq_Level 1-2190-1.zip",
      "uploadedUnix": "1323139928",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/737e78aac8a8df050607700af87d10aeec56879f9220fb626fd158c01cf285b5/analysis/1406484664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Raziq_Level%201-2190-1.zip?fid=7483&ttl=1535756317&ri=8192&rs=8192&setec=0605d26843b632d3098ba9dac6779dba"
    }
  ]
}