{
  "modId": 21961.0,
  "modName": "Serana Fixed",
  "summary": "This is a fix for Serana, it solves an issue that should have been resolved before Dawnguard was launched, but hey, I\\'m fixing it now. Be warned, the mod is a colossal spoiler if you haven\\'t completed Dawnguard yourself yet. Also, please don\\'t forget to endorse and vote for this mod if you like it, thanks!",
  "descriptionHtml": "This mod is a bit of an overhaul for Serana, one that i don\\'t recommend using until after completing the Dawnguard quest line and getting her cured of her vampirism. Also, please don\\'t forget to endorse and vote for this mod if you like it, thanks!\r\n\r\nFor those of you who asked her about getting cured of her vampirism before finishing the DG questline, this should help you out:\r\n\r\nOpen the console, and type \\\"setstage 02005044 0\\\"\r\n\r\nSerana should then go away. Now go back to fort dawnguard and wait there more than 72 hours. She should be in the near of the sleeping room for the others.\r\n\r\nBy the way, the code \\\"02005044\\\" is only for the english version of dawnguard, if you have the german version, you have to write \\\"050020544\\\".\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nVersion 1.6 available!\r\n\r\nOk, so, I know how to make Serana\\'s face look the way it\\'s supposed to, but I only know how to do it via the creation kit, as the process is done automatically and I\\'ve no idea what files are created/overwritten or where they are (blame steams terrible filing system).\r\n\r\nSo, if you want to make her look the way she does in the screenshot, follow these instructions (If somebody could let me know which files get created/overwritten by doing this, I can upload that to here and tell people where to stick each file instead). Also, the Serana Fixed.ckm file is not needed, it turns out, so you can get rid of it, you only need Serana Fixed.esp (again, I\\'m new to this, sorry).\r\n\r\nOpen my mod in the creation kit, then go to the object window. Click actor, then actor again, now type Serana into the search field. You should get \\\"DLC1Serana\\\" as your only option. Select that then hold down ctrl and press F4, you should get a dialogue box asking if you want to export face gen data, click yes. Wait for it to be complete, a dialogue box will open once it is, click ok and that\\'s it, Serana should look the way she is supposed to the next time you start up Skyrim.\r\n\r\nAlso, if somebody could tell me how to make her stop using raise dead and ice storm, that\\'d be great, they\\'re infuriating spells and I\\'ve tried everything I can think of to get her to stop.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nVersion 1.5 available!\r\n\r\nThis is kinda awesome. Thanks to Denninator\\'s awesome help, I\\'ve managed to modify Serana\\'s dialogue, so now she should no longer complain about the sun when she\\'s human.\r\n\r\nNow the only thing I need is to get rid of her hood, and the mod is then complete, hopefully they\\'ll allow us to start editing Dawnguard scripts pretty soon.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nVersion 1.4 available!\r\n\r\nFinally it is done, I have managed to give Serana the look I wanted. She once again looks how she does when you first find her (pale white skin, not sickly grey) but she has proper human eyes now.\r\n\r\nNow all I need to do is figure out how to fix the hood, as joris97\\'s suggestion didn\\'t work, but he does get full credit for helping me fix the issue I was having with making her face look the way I wanted. Enjoy!\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nVersion 1.3 available!\r\n\r\nSerana once again has pale skin, it makes more sense and I can\\'t get her to look exactly the way I want anyway.\r\n\r\nI have given her a new perk, LightFoot, so she will no longer trigger any traps she walks over. Serana also now has the ability to summon all three kinds of Atronachs, though not at the same time or more than one at a time ofc.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nVersion 1.2 now available!\r\n\r\nSerana should level to 81 (Should being the operative word, according to my in-game console she is level 50 still, can somebody confirm this for me please).\r\n\r\nShe should have access to five spells, three destruction spells and two healing spells.\r\n\r\nShe should no longer use vampiric drain or have yellow eyes. I\\'ve chosen Ice Blue this time, hopefully my colour choice will actually show. I\\'ve also added some colour to her face, now she should not look quite so pale.\r\n\r\nI want to stop her wearing her default hood (cos there\\'s no reason to when she\\'s not a vampire), but I\\'ve got no idea how to do that, so again, any help would be muchly appreciated.\r\n\r\nI also want to stop her complaining about the sun when she\\'s a human, considering how she clearly revels in her new life when you see her again after she first makes her change, but I\\'ve no idea how to edit dialogue yet, so this is going to be a while off.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nVersion 1.1 now available!\r\n\r\nI\\'ve updated the mod, though the site messed up when i clicked submit, so let me know if I need to reupload please.\r\n\r\nSerana should level to 81\r\n\r\nShe should have access to five spells, three destruction spells and two healing spells.\r\n\r\nShe should no longer use vampiric drain or have yellow eyes. I chose bright green, but for some reason her eyes are dark blue, if somebody could tell me how to fix that, I\\'d be grateful.\r\n\r\nI want to stop her wearing her default hood (cos there\\'s no reason to when she\\'s not a vampire), but I\\'ve got no idea how to do that, so again, any help would be muchly appreciated.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nVersion 1.0 is available!\r\n\r\nSerana should no longer have yellow eyes or use vampiric drain. I have chosen bright green eyes because after being made human she has yellow whites and green irises.\r\n\r\nSerana now has access to three destruction spells and I\\'ve augmented her elemental power for all three elements as well as increased her magical resistance.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------",
  "categoryId": "66",
  "version": "1.6",
  "author": "Doozerpindan",
  "createdUnix": "1344429947",
  "updatedUnix": "1346338212",
  "containsAdultContent": false,
  "uploadedBy": "Doozerpindan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "85294",
      "name": "Cured Serana Fix",
      "version": "1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Cured Serana Fix-21961-1-6.rar",
      "uploadedUnix": "1346338212",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/4e624b9945cd59f103406bf2ae9bfbb78a40f0dd5072456283902620e016c522/analysis/1407132782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cured%20Serana%20Fix-21961-1-6.rar?fid=85294&ttl=1535791212&ri=8192&rs=8192&setec=5537b74323864e4a78de69191f820c61"
    }
  ]
}