{
  "modId": 21982.0,
  "modName": "Fortunes Loss - God Items You Have to Earn",
  "summary": "This is a dungeon that is supposed to be very, very challenging and at the same time, very rewarding. Your abilities WILL be put to the test in this dungeon. If you can survive it then you will find very nice weapons and equipment that will substantially benefit you.",
  "descriptionHtml": "EDIT: If you like this mod, then please endorse it!\r\n\r\nThis dungeon is supposed to be hard and downright punishing at times. I made this because so many dungeons in the game just seem too easy and benign. Play this if you feel the same way.\r\n\r\nThe Dungeon is Located Near Falkreath, the name is \\\\\\\\\\\\\\\"The Mouth Of Loss\\\\\\\\\\\\\\\". The entrance is a giant hole in a cavern, a one-way drop, so if you plan on trying this dungeon out, make sure you really mean it.\r\n\r\nYes this mod includes some God-Items that I made, but make no mistake, they are balanced in somewhat unconventional ways.\r\n\r\nSPOILERS:\r\n\r\nGod-Item Descriptions:\r\n\r\n1.) Archona: BFS (Big freaking sword), one-handed, knocks back enemies over the horizon, causing anyone nearby to flee from you, also this weapon causes it to rain outside. This is balanced by the fact that you will probably get tired of not being able to loot your targets if they\\\\\\\\\\\\\\'re half a mile away by the end of combat.\r\n\r\n2.) Hammer of Wrath: Warhammer that kills just about EVERYTHING nearby, but beware, it may even affect innocent people including followers.\r\n\r\n3.) Time Boots: Slows time while you wear them, infinite possibilities ;). The disadvantage is that you need to take them off for cut-scenes to progress and they do not provide any protection whatsoever.\r\n\r\n4.) Bow of Looting: If you hit your target, then it instantly removes ALL their items and places them in your inventory. The downside is that you may become over-encumbered very fast with this bow.\r\n\r\n5.) Sceptre of Wealth: Everytime you use the sceptre, it adds 10000 gp. The downside is that it makes the game too easy, use at your own discretion.\r\n\r\n6.) Claw of Shadow: Absorbs the health, stamina, magicka, and soul of your enemy, it\\'s also faster than a normal dagger. The downside is that you might get tired of the soul gem message.\r\n",
  "categoryId": "88",
  "version": "1.1",
  "author": "Altrunchen",
  "createdUnix": "1344453600",
  "updatedUnix": "1344459390",
  "containsAdultContent": false,
  "uploadedBy": "Altrunchen",
  "primaryFile": null,
  "files": [
    {
      "fileId": "79805",
      "name": "Fortunes Loss 1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "599",
      "fileName": "Fortunes Loss 1-0-21982-1-0.zip",
      "uploadedUnix": "1344453681",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1936fb6d32c7e57b06ec03fd6aaee3f0375e877bc84dab326e27941d7bf19762/analysis/1407080226/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fortunes%20Loss%201-0-21982-1-0.zip?fid=79805&ttl=1535791249&ri=8192&rs=8192&setec=cd98991f53cc83e1e49156d33de5b1da"
    },
    {
      "fileId": "79842",
      "name": "Fortunes Loss 1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "599",
      "fileName": "Fortunes Loss 1-1-21982-1-1.zip",
      "uploadedUnix": "1344459390",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/145fecd1fc5d525291ca4ef545de708e58b78657263cb1cb2698b01fd70280a7/analysis/1407080647/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fortunes%20Loss%201-1-21982-1-1.zip?fid=79842&ttl=1535791249&ri=8192&rs=8192&setec=e6146dbc6cf24675bd41054293f1a86e"
    }
  ]
}