{
  "modId": 21995.0,
  "modName": "Aerosbrire Estate",
  "summary": "My moderately sized player home with two NPC followers/trainers, a very large and useful armory, a balcony with archery targets across the river, all the essentials (enchanting area, smithing exc.) and soon to be available add-ons for a Mine, Stable, and Store. This mod is still a work in progress and will be updated as needed.",
  "descriptionHtml": "Aerosbrire Estate\r\n\r\nThis mod is still a work in progress and will be updated as needed. Next update, hopefully final... \r\n    Expanding the library/office\r\n    Fixing the ownership issue\r\n    NPC\\'s names show instead of \\'The Ranger\\'\r\n    Dialogue changes\r\n\r\n***THIS MOD HAS A BIG ARMORY, PLEASE DON\\'T FILL THE COMMENTS SECTION WITH COMPLAINTS ABOUT IT, IF YOU DON\\'T LIKE BIG ARMORIES DON\\'T DOWNLOAD MY MOD\r\n\r\nAerosbrire Estate is a player house mod, located just North of Talking Stone Camp and to the left of a cave called Orotheim. The map marker for the house should appear after installation (but may require you to discover it). The main file adds Aerosbrire, the actual home, the separate files add new structures to the same exterior location. This mod alters the landscape in the region near Orothiem and there for is not compatible with any mods that add  any structures to the same region. The AddOns will start to be released once the final version of the house is uploaded. The list below shows how each separate download needs to be ordered in your load order. \r\n\t\t\t\t\t\r\nAerosbrire\r\nAddOn Aerosbrire Stable\r\nAddOn Aerosbrire Mine \r\nAddOn Aerosbrire Shop\r\n\t\t\t\t\t\r\nAerosbrire is a home of moderate size with much empathies on sensible storage, and the use of mannequins, weapon racks, weapon plaques, shield plaques and display cases. The home includes two custom NPC\\'s each with their own short dialogue to introduce themselves.  Both NPC\\'s are female and include, The Ranger and The Mage. Of course they each have real names but I don\\'t wish to spoil the surprise. The dialogue for each is unique and follows the pattern of:  hello. what\\'s your name? what do you do around here? goodbye. The NPC\\'s where all created using Apachii Sky hair and it is there for a requirement (see below) each NPC spawns with vanilla clothing and I recommend an NPC clothes changer mod such as, NPC Clothes Changer and Maintainer. Each NPC\\'s level  depends on and should be equal to the players level, The Mage has a variety of destruction and restoration spells and The Ranger is set to a ranger theme combat style. You can marry both and they are also available as followers. Other than that here is a list of some of the most important elements of the house.\r\n\r\n+ An alchemy space with an alchemy workbench,  potion storage and ingredients storage \r\n+ A smithing space with ingots and ores storage, leather storage, a smelter, a forge, a workbench, a tanning rack, and a sharpening wheel\r\n+ An enchanting area with an enchanting bench, scroll storage, soul gem storage and one of each standing stone(mini)\r\n+ A small study with 6 bookshelves and storage for notes, and journals\r\n+ All 9 divines shrines\r\n+ All the mask busts\r\n+ Storage for septims(coins)\r\n+ Storage for keys\r\n+ A quick drop chest\r\n+ A chest marked \\'To Sell\\'\r\n+ A teleport map, that teleports you directly to all the small holds (ex. Falkreath) and to the stables of the main cities (ex. Whiterun)\r\n+ A spell tome to teleport yourself to the interior of the home\r\n+ A spell tome to teleport yourself to the balcony (there is no other way up :P)\r\n+ A kitchen with a mini storage room, storage for food and storage for drinks, a \\'stove\\', bar and dining table(for decoration only) and a sink \r\n+ A bedroom with a luxurious player bed, fireplace and wood storage, displayed jewelry with circlet, ring, and necklace storage, a noble wardrobe, 2 bookshelves, and instrument storage\r\n+ The Armory is the biggest room in the house and holds 53 mannequins, 34 large display cases, 68 small display cases, 93 weapon racks, 38 weapon plaques, and 37 shield plaques and a specific display area for all nine holds armor and shields\r\n+ There are sections of lighting throughout the house with corresponding light switches to turn each on and off, the lights will start off, the only area without a light switch is the armory, all the light switches are located on the left when you enter each area\r\n+ Navmesh, the entire interior of the house has been navmeshed and your followers should there for be able to enter and wander around\r\n+ 8 unique books to help the player \r\n\r\nCo-conspirator(s)\r\n+ TheJohnsonator, for his help with ideas and offering a second opinion\r\n\r\nManual Install\r\n+Move the ESP file into Skyrim/Data\r\nMove the FACEGENDATA file into Skyrim/Data/Textures/Actors/Charecter/FaceGenData/Facetint\r\n\r\nBugs\r\n+Mannequins may move around, THIS IS A SKYRIM BUG, activating the mannequin should prevent it from moving any more\r\n+Your weapons (except bows) will not align properly on the weapon plaques, I have yet to discover why and have tried everything I can think of, If I stumble upon a solution I will release an update\r\n+After hours of trying to fix this, for some unknown reason the NPC\\'s will try to make you leave but they should only attack you once, after that the only issue is that you cannot wait or sleep. I\\'m still working on this and will release an update when I find a fix for it\r\n\r\nRequirements\r\n+ Apachii Sky Hair v1.4 \r\n\r\nMods I Recommend To Use Along Side Mine\r\n+ NPC Clothes Changer and Maintainer http://skyrim.nexusmods.com/mods/11662\r\n+ Female Mannequins (In Homes) http://skyrim.nexusmods.com/mods/9131\r\n+ Spouses Can Live Everywhere http://skyrim.nexusmods.com/mods/11370\r\n+ Worthy Noble Furniture http://skyrim.nexusmods.com/mods/2411\r\n\r\nRegarding the screenshots, \r\nThe Mage is using custom armor I gave her she spawns with typical mage robes.\r\nThe shields do not come with my mod they are from a Game of Thrones shield pack.\r\nI accidentally bumped the arrows before I took the screenshot, they will all spawn on the table normally.\r\n\r\nMy Other Mods\r\n+  Stag\\'s Rest http://skyrim.nexusmods.com/mods/23847/\r\n+ The Gaurd http://skyrim.nexusmods.com/mods/18090/\r\n+ Dragonspire Estate http://skyrim.nexusmods.com/mods/16528/\r\n\r\nDon\\'t forget to Endorse If you enjoy my mod and I check comments regularly so feel free to leave suggestions, feedback, constructive criticisms, complements (: or report bugs. ENJOY!",
  "categoryId": "67",
  "version": "V.1",
  "author": "HaileySkyrim",
  "createdUnix": "1344465094",
  "updatedUnix": "1345188690",
  "containsAdultContent": false,
  "uploadedBy": "HaileySkyrim",
  "primaryFile": null,
  "files": [
    {
      "fileId": "79863",
      "name": "Aerosbrire PRE-RELEASE",
      "version": "V.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "641",
      "fileName": "Aerosbrire PRE-RELEASE-21995-V-0.zip",
      "uploadedUnix": "1344465165",
      "modVersion": "V.0",
      "virusScanUrl": "https://www.virustotal.com/file/022ad657a972d6f6d8773d00d51688dc47e6c023bb5c6b936f1ecda3a8080b90/analysis/1407080884/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aerosbrire%20PRE-RELEASE-21995-V-0.zip?fid=79863&ttl=1535791273&ri=8192&rs=8192&setec=f8426c7ecd58308d358864cc65f1a7d1"
    },
    {
      "fileId": "82163",
      "name": "Aerosbrire V_1",
      "version": "V.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "605",
      "fileName": "Aerosbrire V1-21995-V-1.zip",
      "uploadedUnix": "1345188690",
      "modVersion": "V.1",
      "virusScanUrl": "https://www.virustotal.com/file/c76c4438f95764055a79fd7163646de59e8a38e146cd5a1c5f7fa7268dfdd576/analysis/1407102366/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aerosbrire%20V1-21995-V-1.zip?fid=82163&ttl=1535791273&ri=8192&rs=8192&setec=76b1d635e921854b16cb1fb91837faa7"
    }
  ]
}