{
  "modId": 22058.0,
  "modName": "Summon Blades Defender - Baurus",
  "summary": "Provides the player the ability to summon Baurus to fight by his or her side.  There are two versions of this mod, version 1 is a power, and version 2 is a lesser power. Baurus will tank for the player and cast a heal the player if he/she takes too much damage.  As a special bonus, a new restoration focused follower is also available on this mod.",
  "descriptionHtml": "========================================\r\n8/23/2012 Update Notes:\r\nVersion 1a and 2a - Fixes the issue of Pierelle the follower\\'s healing spell spamming the player\\'s active effects.  Also fixes the issue of Pierelle not casting healing spells at early levels.  Version 1a has a 24 hour recast timer, version 2a doesn\\'t.\r\n\r\nVersion 1 - Has a 24 hour ingame recast timer\r\n\r\nVersion 2 - Removes the recast timer to summon Baurus.\r\n*****************SPOILERS******************\r\nBaurus was one of the many brave Blades agents who defended the Septims during the third era.  An honor bound defender, Baurus assisted the hero of Kvatch to battle against the Mythic Dawn and the Daedric Forces of Mehrunes Dagon during the Oblivion Crisis, and assisted in defending Martin Septim to seal the gates of Oblivion. As the centuries passed, Baurus\\' logbook containing his very essence has been passed down through out the centuries waiting for the right hero to summon his fighting spirit.  The last holder of the logbook is Delphine, one of the last remaining Blades. \r\n****************END SPOILERS*************\r\n\r\nTo find Baurus\\'s Logbook that will allow you to summon his heroic spirit, the player must proceed through the main quest past the meeting with the Grey Beards.  The logbook will be available in the Sleeping Giant Inn, but it won\\'t be accessable until the player has gone further through the game.   Read spoilers above for exact info where to find the logbook.\r\n\r\nBaurus has the following:\r\n1. Akaviri Sunder Blade:  A specialized Akaviri katana that produces flaming embers per strike and will ignite the users target and surrounding foes for additional damage.  This special blade does 5x more damage on Daedric races (Dremora and Atronachs).\r\n2. Baurus\\'s Custom Blades Shield:  Baurus will use the shield in two modes, defense and offensive modes.  Defense mode allows him to effectively tank and he will defend most of the time while striking at the perfect opportunity. In offense mode, this presents his next ability:\r\n3. Sundering Shield Sparks: With a swing of his custom Blades shield, Baurus releases a circular wave of sparks that ignite his foes upon contact.  Baurus uses this ability at a distance.\r\n4. Baurus\\'s Honor:  Having Baurus summoned places the player under his duty to protect.  If the player\\'s health gets too low, Baurus will cast a shield spell and a healing spell to restore the player\\'s health.\r\n5. Baurus\\'s Healing Spell:  Baurus will effectively heal himself during combat.\r\n6. Modified stats in health, magicka, and stamina.\r\n7. Will level with the player each time he is summoned.\r\n\r\nThis file also provides a unique restoration essential follower that focuses only on healing and alteration magic for defense. She is a Breton Restoration Mage named Pierelle Leoriane, and she is the latest member of the College of Winterhold.  She can be found wandering the college grounds.  This is my shot at creating a healing follower based on my Svaknir Bard mod parameters, and because this follower didn\\'t require any scripting, I don\\'t see her causing any weird funky issues other than accidentally healing the enemy on very very very rare occassions.  Unlike most other healing follower mods, she will not cast destruction magic, her soul purpose is to heal the player.  She will stand at a distance casting her restorative spells (and shield spells for protection).  When fighting the undead, she will at times cast different abilities, but she still focuses on healing from a distance.  Even if given weapons or a staff, she will still heal the player.  She is elegible for marriage and I kept her with vanilla everything so the players can mod her apperance into any design they prefer.\r\n\r\nNotes:  By utilizing the Baurus summon and recruitment of Pierelle the resto mage, the player will have a near invincible team.  Baurus will initially fire off a few shield projectiles at his foes at a distance and as they close in, he resorts to tanking.  While tanking, he will effectively heal the player if he/she gets too low on health.  While having Baurus\\' protection in the front lines, Pierelle will provide constant healing support from the side.  Having these two together pretty much gives the player more flexibility on what they would like to do.  Despite the flexibility, battle formation is the most crucial aspect of combining these two followers.  Ideally, having Baurus in front, player in the middle, and Pierelle in the back is the best formation.  Because Pierelle is useless in the front lines, she will always back away.  During a dragon fight, make sure you protect her and stand near her because she seems to be a favorite target by dragons.  Although she is essential and can\\'t die... not having her healing spells will cause a great disadvantage.. but if you happen to have Baurus around, he can pick up the healing slack while Pierelle recovers.  \r\n\r\nThis mod should not cause any issues with any other file out there.  If there are any technical issues please let me know and I will work on a fix.  I am working on fixing a few previous mods that people had issues with, and will be working on my next summon soon.  If anyone knows how to safely compile several mods into one file using CK or any other programs, please let me know.  I would like to create a compilation of my summons so that people who have been downloading all my files won\\'t have their lists cluttered with my mods.  Thank you again for checking this mod out, and I hope you enjoy it when you give it a try!",
  "categoryId": "75",
  "version": "2a",
  "author": "zeroeternalz",
  "createdUnix": "1344535485",
  "updatedUnix": "1345718310",
  "containsAdultContent": false,
  "uploadedBy": "zeroeternalz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "80088",
      "name": "Summon Blades Defender - Baurus",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "Summon Blades Defender - Baurus-22058-1.zip",
      "uploadedUnix": "1344535571",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e90349d7bba8547b706dd01c588ffbdd108eccc8fb954f6be7f177fe3d2db8ce/analysis/1407083044/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Blades%20Defender%20-%20Baurus-22058-1.zip?fid=80088&ttl=1535791377&ri=8192&rs=8192&setec=2013768fc7341e1477011d208d3d5299"
    },
    {
      "fileId": "80090",
      "name": "Summon Blades Defender - Baurus v2",
      "version": "2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "Summon Blades Defender - Baurus v2-22058-2.zip",
      "uploadedUnix": "1344535654",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/47d92f021cf77b168977a5fb522fd0e9984ea9f9dbcd8c8b72288804074a826e/analysis/1407083044/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Blades%20Defender%20-%20Baurus%20v2-22058-2.zip?fid=80090&ttl=1535791377&ri=8192&rs=8192&setec=51a3d7ab04fa85aa8fe968f85898841c"
    },
    {
      "fileId": "83653",
      "name": "Summon Blades Defender - Baurus v1a",
      "version": "1a",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "9",
      "fileName": "Summon Blades Defender - Baurus v1a-22058-1a.zip",
      "uploadedUnix": "1345718256",
      "modVersion": "1a",
      "virusScanUrl": "https://www.virustotal.com/file/8f5d6ef7e20aacf9cb074d3bb59bf55fcf628dcee4f525e987d5c65eca10aaf2/analysis/1407116343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Blades%20Defender%20-%20Baurus%20v1a-22058-1a.zip?fid=83653&ttl=1535791378&ri=8192&rs=8192&setec=018a12ebc1cd64b235148d35c6c79f47"
    },
    {
      "fileId": "83654",
      "name": "Summon Blades Defender - Baurus v2a",
      "version": "2a",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "9",
      "fileName": "Summon Blades Defender - Baurus v2a-22058-2a.zip",
      "uploadedUnix": "1345718310",
      "modVersion": "2a",
      "virusScanUrl": "https://www.virustotal.com/file/ec80cddd9c21495556619986e9c86be0ca47dd80fae70fdc0f02023ae73043ec/analysis/1407116343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Blades%20Defender%20-%20Baurus%20v2a-22058-2a.zip?fid=83654&ttl=1535791378&ri=8192&rs=8192&setec=ad481bd1438d69eb1af46e02916d50f9"
    }
  ]
}