{
  "modId": 22063.0,
  "modName": "Beauties of Skyrim - Eilinel Temptress Vampire Start Savegame",
  "summary": "You ever wanted to start your adventure in Skyrim as a mighty and beautiful Vampire lady? Ever thought of Hadvar and Alvor could offer you more than food and equipment. Ever wanted to walk as the wolf among the sheep right from the start of the game?\r\n\r\nThen have a look at Eilinel a beautiful and adorable Lvl. 1 Vampire Temptress.",
  "descriptionHtml": "About this mod\r\n\r\nThanks to the greatness and creativity of some of my favourite modders here on the Nexus and to Bethesda\\'s awesome DLC \\\"Dawnguard\\\" I am able to provide you with a new and remarkable experience : you can start your game right at the beginning at Helgen as a beautiful and mysterious Vampire lady with all the unique features and advantages this \\\"gift\\\" has to offer.\r\n\r\n\r\nAbout your character\r\n\r\nEilinel is a young adventureous Vampire lady who therefore left her family in Cyrodiil to go to Skyrim because she has heard rumours of a mighty Vampire lord who has left the shadows top fulfil an ancient prophecy which would allow the Vampires of Tamriel to claim the lordship over the day as it is theirs for the night.  Near the border of Skyrim she got caught by the lifeguards of an attractive Imperial legate whose blood should have been a tasty delight...\r\n\r\n\r\nRequired Mods\r\n\r\nOur thirsty little Lady first needs some fresh blood to the game  ( in the following load order ):\r\n\r\nThe fabulous ApachiiSkyHair mod by apachii.\r\n- http://skyrim.nexusmods.com/mods/10168\r\n\r\nThe gorgeous Temptress race mod by Psychosis and Brokefoot including the Vampire update file.\r\n- http://skyrim.nexusmods.com/mods/18717\r\n\r\nThe Better Vampires by Brehanin 5_31 mod by Brehanin 2.\r\n- http://skyrim.nexusmods.com/mods/9717\r\n\r\nBethesda\\'s stunning Skyrim DLC \\\"Dawnguard\\\".\r\n\r\nNow the cold blooded Hottie is ready to go.\r\n\r\n\r\nInstallation :\r\n\r\nJust copy the mod file into your Skyrim Savegame data folder, start your game and load the \\\"Eilinel\\\"-Savegame file to start right into the action.\r\n\r\n\r\nAuthor\\'s note :\r\n\r\nCheck out my other mod \\\"Dibellas Temptress gift - Beauties of Skyrim\\\" for non vampiric savegame characters.\r\n\r\nhttp://skyrim.nexusmods.com/mods/22190 \r\n\r\nIf you enjoy my mod please rate or leave a comment to tell me about Eilinel\\'s adventures in Skyrim or load up some pics of her. Criticism is also welcome since it can only improve my work.\r\n\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "43",
  "version": "1.0",
  "author": "EcthelionOtW",
  "createdUnix": "1344541130",
  "updatedUnix": "1344541500",
  "containsAdultContent": false,
  "uploadedBy": "EcthelionOtW",
  "primaryFile": null,
  "files": [
    {
      "fileId": "80115",
      "name": "Eilinel Temptress Vampire",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1446",
      "fileName": "Eilinel Temptress Vampire-22063-1-0.zip",
      "uploadedUnix": "1344541500",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/66e40a3c6adccb1b5148ea5418841d7280fc4d1d477ff31f50eb907ff61d2ee6/analysis/1407083237/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Eilinel%20Temptress%20Vampire-22063-1-0.zip?fid=80115&ttl=1535791385&ri=8192&rs=8192&setec=0e9431486b7d9f7cb4e90eb048068236"
    }
  ]
}