{
  "modId": 22060.0,
  "modName": "Akaviri Warriors Guild",
  "summary": "Adds 7 independant Akaviri Warriors for Hire.",
  "descriptionHtml": "What this mod does :\r\n\r\n- 7 new individual companions of 7 different classes (Warrior, Mage - Conjuration, Mage - Lighting, Rogue, Berzerker, Assassin, Ranger)\r\n- New location of Akaviri Guild, located in SkyHaven Temple\r\n- complete independance from Vanilla (gamebased) Follower/Hireling system so utter-compatability with all Follower Overhauls like the popular UFO - Ultimate Follower Overhaul.\r\n\r\nThis mod is based on Volek\\'s \\\"Riverwood Mercenary Guild\\\":\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=12400\r\n\r\nVolek stated that this is free to use aslong he knows about it and credit is given.\r\n\r\nYou can hire all mercs at the same time, they don\\'t add to the normal follower count.\r\nOnce hired, they will follow you and help in battle. You can give the following orders:\r\n\r\n•Wait at the current position\r\n•Wait at the targeted location \r\n•Follow (if waiting)\r\n•Attack an enemy target\r\n•Trade \r\n•Set home base to current location (works for each merc individually)\r\n•Dismiss to the previously marked home\r\n•Push (useful in narrow spaces)\r\n\r\nWhere to find the guild:\r\nIt is located in SkyHaven Temple so you MUST have atleast reached that far into the main storyline in finding the Akaviri temple. This was intended to be so.\r\nThe guild entrance is just before the main barracks/living and sleeping area of where the blades and new recruits live.\r\n\r\nV1: Since based on the original mod by Volek, no changes have been done to the scripts what so ever so both \r\n\r\nthis mod and the original work perfectly simutainiously. The characters themselves have been redisigned in \r\n\r\nAkaviri/Asian influence.\r\n6 are of Tsaeci human (my interperation atleast) based off the descriptions in Lore and otherwise and 1 is a Ka Po\\'Tun Cat-People Tiger look Khajiit.\r\n\r\nAll characters have thier own back stories so to add abit of character... The Tiger especially is funny.\r\n\r\nNote: there are infact Breton, Imperial and Nord NPCs + Khajiit all styled as Asian/Akaviri and thier names are corruptions of actual Asian names, primeraly Japanese\r\n\r\nThe list as followers of each character:\r\n(Will add to this later)\r\nIf you refer to Volek\\'s page again: http://skyrim.nexusmods.com/mods/12400,\r\nFor FAQs, they will light up any qs.\r\n\r\nAll I did with this mod really is change location, NPCs, equipment and backstories to create completely new Npcs but at the same time add 7 new fully interactive companions that are fully compatable both with the original fire AND the base game follower system AND enhancements.\r\n\r\nThis was intentionally a work-a-round type mod for Recruit More Blades - SkyHavenTemple Enhanced where I wanted to have up to 20 Blades but could only recuit up to 10 for some limiting reason...\r\n\r\n- Bugs/Reports\r\nThere should be no Gray Face bug what so ever as I know how to fix that by adding the FaceGenData to the files etc.\r\nWhen first recruiting them, they *may* not appear outside but fast travelling to a nearby place should make them appear and have no more issues after that.\r\nthere *may* be some residual errors in the Riverwood area where I removed the original location of the Riverwood Merc Guild that I changed before hand, nav-mesh errors and so forth but having the original mod activated there should fix this.\r\nThey may talk ultra-fast in some cases as there is no voice files associated with them and even blank ones need to be recreated as I changed the voice types to try and suit the characters.",
  "categoryId": "66",
  "version": "1",
  "author": "Volek",
  "createdUnix": "1344536468",
  "updatedUnix": "1344538837",
  "containsAdultContent": false,
  "uploadedBy": "nofear88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "80106",
      "name": "Akaviri Guild - V1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1683",
      "fileName": "Akaviri Guild - V1-22060-1.rar",
      "uploadedUnix": "1344538837",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/44dbe18115272695a500e1c4680159324cd25ea58413c8e2063744650dcda085/analysis/1407083180/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Akaviri%20Guild%20-%20V1-22060-1.rar?fid=80106&ttl=1535791382&ri=8192&rs=8192&setec=16ab4c534ee23348941b5fe158771ebb"
    }
  ]
}