{
  "modId": 22068.0,
  "modName": "Winterhold Restoration - Italian translation",
  "summary": "This is only a italian translation of the original mod by poptart11",
  "descriptionHtml": "[center][size=+2][color=red][b]NOTICE![/b]\r\nThis is only a translation into Italian of the [url=http://skyrim.nexusmods.com/mods/11616]original mod[/url].\r\nThe original mod adds some npc, building, a blacksmith and a home player\r\nThe translated mod is found using the \\\"Mirrors\\\" link on the upper-right.\r\nAll credits go to the creator of the original mod.[/color][/size]\r\n\r\n[color=red][b]ATTENZIONE![/b]\r\nQuesta è solo la traduzione italiana del mod originale che trovate [url=http://skyrim.nexusmods.com/mods/11616]qui[/url].[/color][/center]\r\n\r\n[center][color=GREEN][size=+4]UNA TRADUZIONE DRAGONBORN ITALIA[/size][/color][/center]\r\n\r\n[color=green][b]DESCRIZIONE[/b][/color]\r\nWinterhold... insomma... ok che è crollata maggior parte della città, ma era pur sempre un\\'eccellenza in Skyrim, addirittura il suo jarl se la batteva per il tito di Re dei Re, non può essere così piccola! dai! Se la pensate come me, e volete rendere Winterhold un ragionevolmente popolosa (e autosufficente, non c\\'è neanche il fabbro) allora questa mod è perfetta. Aggiunge un fabbro, qualche abitazione per npc, qualche npc nuovo, e una casa per il giocatore, Winterhome.\r\n\r\n[color=green][b]INSTALLAZIONE[/b][/color]\r\nDopo aver installato la mod originale, vi basta semplicemente sostituire l\\'esp con quello scaricato su DRAGONBORN ITALIA.\r\n\r\n[color=green][b]DOWNLOAD[/b][/color]\r\nLa traduzione è disponibile alla pagina [url=http://skyrim.nexusmods.com/downloads/file.php?id=10914]DRAGONBORN ITALIA[/url]. Li potrete inoltre trovare altre nostre traduzioni, ed un elenco completo di altre traduzioni create dagli italiani di Nexus!\r\n\r\n\r\n\r\nSe avete trovato qualche problema o volete suggerire una traduzione migliore fatecelo sapere!",
  "categoryId": "58",
  "version": "3",
  "author": "poptart11",
  "createdUnix": "1344543315",
  "updatedUnix": "1344543315",
  "containsAdultContent": false,
  "uploadedBy": "oODarkDanteOo",
  "primaryFile": null,
  "files": []
}