{
  "modId": 22101.0,
  "modName": "Mina Armor - UNP -  Conversion from Oblivion - originally by KURESE",
  "summary": "Mina armor (from the game series Samurai Showdown) - converted by me from its original Oblivion mod by KURESE. Fully compatible with the UNP body by dimon99 with weight slider support",
  "descriptionHtml": "PLEASE READ BEFORE ASKING QUESTIONS - ESPECIALLY THE FAQ&#39;S AT THE BOTTOM OF THIS DESCRIPTION - THANK YOU&#33;&#33;\r<br />\r<br />THIS IS A NON-LORE FRIENDLY AND SKIMPY ARMOR MOD. IF THAT DOES NOT SOUND APPEALING TO YOU, THEN PLEASE LEAVE AND JUST SIMPLY IGNORE THIS MOD&#39;S EXISTENCE, NO COMMENTS OR ENDORSEMENT NEEDED. I DO NOT WANT ANY UNNECESSARY TROLLING AND BANNING HERE. I REALLY DO RESPECT THOSE PEOPLE WHO WANT A LORE-FRIENDLY AND IMMERSIVE EXPERIENCE IN THEIR SKYRIM, BUT I COMPLETELY DETEST THOSE WHO SHOVE THEIR TASTES DOWN OTHER PEOPLE&#39;S THROAT.\r<br />\r<br />\r<br />This is an armor mod originally by KURESE, one of my favorite TES modder. His Mina armor is one of my top 5 favorite armor mod back in the Oblivion day (due to me being a big fan of Samurai Showdown). Unfortunately, he seems to have put a hold on modding for Skyrim and many of his armors are left unconverted. This is my attempt to bring Mina&#39;s armor from Oblivion to Skyrim.\r<br />\r<br />** All of KURESE&#39;s mod are open-source; meaning that he allows anyone to edit and improve upon his works without his permission as long as credits are given. **\r<br />\r<br />This mod includes:\r<br />\r<br />- Mina Armor Cuirass\r<br />- Mina Gloves\r<br />- Mina Boots\r<br />- Mina Hairband (NEW)\r<br />- Mina Armor Cuirass Black (NEW)\r<br />- Mina Gloves Black (NEW)\r<br />- Mina Boots Black (NEW)\r<br />- Mina Hairband Black (NEW)\r<br />\r<br />The armor ratings are a little weaker than glass armors but are stronger than elven gilded. They can be crafted at a forge in the Leather section. Require some leather, leather strips, moonstone ingot (orichalcum ingot for the black version) and linen wrap. All armor are improvable with different requirement for each piece.\r<br />\r<br />** Thanks to MxR for the feature video\r<br />\r<br />[youtube]KF3GkbibVCU[/youtube]\r<br />\r<br />** KNOWN BUGS * -\r<br /> \r<br />There are some bugs and clipping as I have not been able to track down all the bugs yet. The skirt is very tricky since I cannot get the bone to work correctly, so I just slap all of it on the pelvis bone. It looks presentable in game, but you will see clipping when the character is running. It&#39;s not that bad though. If any of you are experienced with skirt bones, please download the mod and help me fix it. \r<br />\r<br />The helmet is not very fitting as a hairband with many hair for obvious reason. When I make the hairband, I base its shape on the Apachii long ponytail hair as seen in the picture. The hairband is best worn with any kind of hair with a ponytail, since that&#39;s what the original character Mina from Samurai Showdown had.\r<br />\r<br />Permissions and Credits:\r<br />\r<br />KURESE - for his original mod from Oblivion\r<br />dimon99 - for his UNP body - here: http://skyrim.nexusmods.com/mods/6709\r<br />Nightasy - for his tutorial on editing and creating armors - check his videos out if you want to start editing armors yourself - here: http://skyrim.nexusmods.com/mods/19249\r<br />\r<br />\r<br />You can use assets from this mod freely since KURESE allows his original mods to be used as such. Convert this to CBBE, ADEC, LB, or any other body that you use, \r<br />\r<br />**FAQ FAQ FAQ FAQ FAQ FAQ** - All your questions answered here - READ THESE BEFORE ASKING QUESTIONS IN THE COMMENT PLEASE - YOUR QUESTION MAY HAVE ALREADY BEEN ANSWERED&#33;&#33;\r<br />\r<br />\r<br />Q: How do you make your character&#39;s skin so shiny and &#34;wet&#34; - Glosstech can only make it look metallic instead of... you know... wet\r<br />A: To make the character skin to look like my character in the screen shots, you need:\r<br />\r<br />1) someting to make the skin shiny (edit the femalebody_s.dds, femalehead.dds, and femalehand.dds files in textures/actors/characters/female - just increase the brightness by about 20) \r<br />OR search for glosstech - however both of these will make the skin looks &#34;metallic&#34; and not &#34;wet&#34; - so you&#39;ll need....\r<br />2) an ENB file - ANY ENB would do but you need to go to:\r<br />[ENVIRONMENT] section in enbseries.ini and find these lines and change them accordingly\r<br />(these are the settings I use - the higher the number the more &#34;wet&#34; it will look - just play around with the numbers and see what works for you. You can see the effects better indoor right next to a light source)\r<br />\r<br />SpecularAmountMultiplierDay=4.0\r<br />SpecularAmountMultiplierNight=4.0\r<br />SpecularPowerMultiplierDay=5.0\r<br />SpecularPowerMultiplierNight=5.0\r<br />(KEEP THESE TWO AT 0)\r<br />SpecularFromLightDay=0.0 \r<br />SpecularFromLightNight=0.0\r<br />\r<br />\r<br />Q: What skin, head texture, hair/face, etc. do you use to make your character look like that?\r<br />A: I use the custom textures of the Yaksha race - but not from the original mod. The one I use are from the Companion Ria mod - UNP version - here: http://skyrim.nexusmods.com/mods/17354\r<br />Just extract and look for the Riabody folder inside the mod - then copy ALL the dds files and paste them into the textures/actors/characters/female folder.\r<br />\r<br />You also need Ran&#39;s custom Head mesh - I used version D - here: \r<br />http://skyrim.nexusmods.com/mods/7127\r<br />\r<br />The Hair is from Apachii hair - this is the hair that&#39;s NOT in the original main Apachii mod, but in the extended hair mod where Apachii added 10 extra hairs.\r<br />\r<br />Q: Are you planning on doing a CBBE/UNPB/LB/ADEC/ *insert body here* version?\r<br />A: No and... really no. I am only interested in the UNP body at the moment. The CBBE body has enough people working on armors for it. The LB body is too new and .. not really to my taste. As for the other bodies... not really my things.. sorry. However, you can freely convert this to any body you wish w/o needing my permission. Just remember the credit and we&#39;re good\r<br />\r<br />Q: Will you be adding BBP support?\r<br />A: No, I don&#39;t think so. BBP never really interest me much because I generally see my character from the back, not the front. I didn&#39;t bother with BBP back in Oblivion, so it won&#39;t be any different here. However, if any of you want to add BBP support to my armors and release it as your own mod - go right ahead, just remember the credits and we&#39;ll be fine.\r<br />\r<br />Q: Do you take request?\r<br />A: Depends really. Some armors does not really interest me, and some are just really painful to work with. Many of you who have no experience with this kind of works probably have no idea, but seriously, it&#39;s not exactly that exciting. If you have requests - post it in the comment section, but just know that I&#39;ll probably not get to it anytime soon.\r<br />\r<br />Q: I have found a bug that involves this this and that\r<br />A: If you find a bug - post it in the comment section. If the bug involves weird behaviors with the armor meshes or texture - please post a picture with a title that said :ERROR - so that I can see it clearly and hopefully fix that in the next update.\r<br />\r<br />Q: Why won&#39;t you respond to my PM? I reported a bug a couple of days ago, at least reply so that I know you&#39;ll look into it&#33;\r<br />A: Look, many people report bugs on my mods in both the comment section and PM. I cannot answer every single one of them. If the bug is small, I usually ignore it. If it&#39;s a major bug, then I&#39;ll fix it in the next update and mention your name in either a comment or the change log, crediting you for your help. I do not bother with forum message unless it is absolutely necessary, so please understand and don&#39;t be angry when I do not reply to your message. Know that I read EVERY SINGLE bug report and comments that you guys posted and took many of them to heart when I&#39;m updating the mods. If I don&#39;t reply, just assume that I&#39;m busy taking your bug report to heart and working my butts off to fix that issue. If it&#39;s a cultural thing that demands me to reply to your comments in forum and I don&#39;t understand it, then I&#39;m sorry.",
  "categoryId": "54",
  "version": "2.0",
  "author": "asianboy345",
  "createdUnix": "1344577828",
  "updatedUnix": "1344648579",
  "containsAdultContent": true,
  "uploadedBy": "asianboy345",
  "primaryFile": null,
  "files": [
    {
      "fileId": "80491",
      "name": "Mina Armor - UNP - New",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7389",
      "fileName": "Mina Armor - UNP - New-22101-2-0.rar",
      "uploadedUnix": "1344648579",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/359c1d843d44030901de4647cd637e3e3c34119705c97a288af075dfcc639344/analysis/1407086651/",
      "changelogHtml": " Added black armor variant - both versions can be crafted at a forge in leather section with slightly different materials <br/> \n Fixed some mesh issues around the chest area. Barely noticeable before unless you have a weight slider of 70 - 99. <br/> \n Added helmet hair band for bot versions as seen in the picture. Can be crafted at a forge like every other pieces. This acts as a circlet so your hair won\\'t disappear when you wear them. <br/> \n Added 1st person mesh for body and gloves along with world and inventory model for all the armor pieces. Now they looks great and intergrate seamlessly into the game among the other armors. <br/> \n Reweight the skirt so the front skirt looks more natural. Still not perfect, but looks slightly better <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mina%20Armor%20-%20UNP%20-%20New-22101-2-0.rar?fid=80491&ttl=1535791443&ri=8192&rs=8192&setec=6a9876b861c6d9e760a1c98e627942e9"
    }
  ]
}