{
  "modId": 22123.0,
  "modName": "Black Talon Player House and Village",
  "summary": "This is being uploaded so I can gather feedback and support from the community to help me with my first Creationkit made project.",
  "descriptionHtml": "This is the base work that I have done for a village I am planning on creating called Black Talon. All this is, is just the world space. There are no interiors yet, no NPCs or anything else. It is just the exterior which I uploaded so that I can get some feedback and help from the community. This is my first CreationKit mod and I need all of the help I can get. I haven\\'t touched a mod kit since the Bloodmoon expansion came out, so if you choose to download this, know that there are bugs and errors to be found and you should be nice enough to report them to me along with any advice you have. \r\n\r\nThe idea behind this mod is that I wanted to create a village were the people shunned from society can live without fear or percussion. Vampires, werewolves and other creatures can live their life openly in Black Talon and find all of the things they need to survive. You wont find a run down or colorless environment. It is painted with color and vegetation.\r\n\r\nThe entrance/door to the area is on the left side of Whiterun\\'s castle. Just look at the picture above (second I believe) to get an idea of it\\'s location.\r\n\r\nNOTE: When you enter the area, you will be stuck in the environment, just bring up the console and type \\\"tcl\\\" without the quotes to free yourself.  \r\nNOTENOTE:In order for your buildings to look as pretty as mine, download horrorview\\'s Sexy Whiterun mod at: http://skyrim.nexusmods.com/mods/7059\r\n\r\nFeatures that I will be adding:\r\n-A massive interior for the player\\'s house.\r\n-Portal system that allows you to teleport to all of the Holds and back to your house. \r\n-Super store with a number of merchants that specialize in providing customers anything they could ever want. Meaning you will find that some of the rarer items that I hard to find in the average Skyrim store will be slightly easier to obtain here. For example, daedric hearts will appear more often than not, but not in mass quantities and unenchanted clothing of all kinds can be found there.\r\n-A black market that can provide vampires with cattle or if you are running Dawnguard, cattle so your werewolf can gain experience. Human hearts and flesh can be bought as long as you don\\'t ask any questions along with black soul gems and other things you wont find a merchant with morals touching.\r\n-Interiors for the  npc houses and everything else.\r\n-A forge in the player\\'s crafting center that allows you to create unique variants of weapons from (if I can get the creator\\'s permissions) masterofshadows\\' Weapons of the Third Era mod and jaysus\\'s swords mod.\r\n\r\nFeatures I want to add:\r\n-Eternal night over the village of Black Talon.\r\n-Make the area more expansive or possibly create a series of world spaces and link them together like Mournhold was.\r\n-A quest line were you have to take attack a run down version of the village and liberate it from the hands of a band of hunters who specialize in killing vampires, werewolves and daedric creatures. After killing or enslaving them, you would be tasked with restoring the village and spreading the word to potential villagers. \r\n\r\n",
  "categoryId": "53",
  "version": "Q0.5",
  "author": "Blacklyte",
  "createdUnix": "1344612982",
  "updatedUnix": "1344613121",
  "containsAdultContent": false,
  "uploadedBy": "Blacklyte",
  "primaryFile": null,
  "files": [
    {
      "fileId": "80354",
      "name": "Black Talon Version NONE",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "91",
      "fileName": "Black Talon Version NONE-22123-.zip",
      "uploadedUnix": "1344613121",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/9d1f6280e72075411f367a84c8edad678039b1805536bca1d9392eb3af103b2a/analysis/1407085329/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Black%20Talon%20Version%20NONE-22123-.zip?fid=80354&ttl=1535791477&ri=8192&rs=8192&setec=fe332084577a54d973ea6e66189aac48"
    }
  ]
}