{
  "modId": 22134.0,
  "modName": "Werewolf Perks Expanded - Dawnguard",
  "summary": "Adds many more perks to the werewolf tree, including new howls, ignore armor, resting bonuses for werewolves, moon-based health bonuses, buffs in human form, and more&#33; ",
  "descriptionHtml": "[b][size=3]NEWS: 1.7 update has arrived. Removes running speed/silver changes from Beast Nature and fix/replace Hircine&#39;s Blessing. Adds new perks to fill some needs and round out the balance changes. The Werewolf Night Eye power is now learned from a the book &#34;Totems of Hircine&#34;, found in Jorrvasker somewhere. Please re-read perk descriptions for more details.\r<br />\r<br />New optional file coming soon &#34;Amulets of Hircine&#34;:\r<br />An immersive way to change perks on the go, without menus. The new amulets can be purchased from the frostmoon pack, like the rings of Hircine. Much like amulets of the Eight, these amulets give the same effects as the static shrines of Hircine, changing your equipped howl when you put them on. Just a fun plugin I made for myself.[/size]\r<br />[/b]\r<br />--------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[size=3]**Please read perk descriptions. They answer a lot of bugs. Please update to the newest version. It answers a lot of bugs.**[/size]\r<br />\r<br />   After completing the werewolf perk tree for dawnguard, I was surprisingly underwhelmed. A little extra health and more base damage were nice, but at lvl 50, it just wasn&#39;t enough, especially above adept difficulty. So, I added a few more perks to the tree, changed the game&#39;s built-in cap on werewolf perks, and tried it out.\r<br />\r<br />   My goal with this mod is not a werewolf overhaul or a new werewolf system. I&#39;m simply correcting a lot of the unnecessary weaknesses that vanilla werewolves have and rebalancing werewolf powers to be as useful to your character as vampirism, albeit with less sunburn.\r<br />\r<br />   A lesser power known as &#34;Hunter&#39;s Sight&#34; was in the game and meant to be used by werewolves. Since it was not implemented, I have added it myself. It can be learned by using the book &#34;Totems of Hircine&#34; found only in Jorrvaskr, somewhere. Just look for it.\r<br />\r<br />     These perks can be selected the same way the other perks can, and require a rank in the previous perk before they&#39;re available.\r<br />\r<br />[size=3][b][u]Perks:[/u][/b]\r<br />[/size]\r<br />-Razor Claws: Ignore 25% of your enemies armor per rank, in werewolf form.\r<br />\r<br />-Tough Hide: Additonal armor rating and magic resistance in werewolf form. In addition to leveled werewolf armor rating. After 1.7, with this perk, and at lvl 40-50+, your werewolf form will be at or above the armor cap.\r<br />     -Rank 1: 100 armor and 25% magic resist.\r<br />     -Rank 2: 200 armor and 50% magic resist.\r<br />\r<br />-Animal Vigor: Rank 2 increases your health regen to 1% per second\r<br />\r<br />-Beast Nature: Adds buffs to stamina rate (50%), unarmed damage (40), and reduces the stamina cost of ALL power attacks by 10%.\r<br />\r<br />-Full Moon Rising: An ability that was already in the game files but not used. You get 150 extra health in werewolf form and 75 in human form when the moons are in the sky (8pm to 5am).\r<br />\r<br />-Fury Swipes: Your large, beastly claws strike all enemies in front of you with each swing. (added by many other werewolf mods, and I personally wanted it to make combat easier as a werewolf. Not meant to be a rip off, just a good idea that I&#39;m getting on board with. And yes, it is a pokemon reference. No, I&#39;m not changing it. I LIKE it.)\r<br />\r<br />   The following perks add a second Word of Power to the vanilla howls. [b]TO USE THE VANILLA HOWL, TAP THE SHOUT BUTTON. TO USE THE SECOND WORD OF THE HOWL, HOLD THE BUTTON DOWN. [/b]Without the corresponding perk, these &#34;long&#34; howls have the same effect as the vanilla howl, but with a cooldown. With the perk, the long howl has a a new, powerful effect that complements the vanilla howl in some way. The cooldowns are there to balance the otherwise overpowered new howls, but still only require a short wait after the howl&#39;s effects have worn off.\r<br />\r<br />-Feral Rage: The second word of Howl of Terror sends you into a feral state, doubling your damage dealt and halving the damage done to you for a solid minute. Cooldown: 40 seconds\r<br />\r<br />-Hunter&#39;s Instincts: The second word of Scent of Blood sharpens your focus and senses as you stalk your prey. Time slows down as your reflexes quicken for 20 seconds. Cooldown: 40 seconds\r<br />\r<br />-Call of the Alpha: The second word of the Howl of Brotherhood empowers your pack members and followers with increased health, stamina, and unarmed damage. This boost essentially doubles the effectiveness of vanilla pack members, and also affects any followers/summons added by other werewolf mods. Cooldown: 40 seconds\r<br />\r<br />   Please don&#39;t complain about cooldowns. An eight second break between sessions of face mauling is just fair play to your enemies. Also, it prevents the spell effects from getting stuck or glitching.\r<br />\r<br />-Satisfying Feast: Feeding in werewolf form sates your hunger for flesh, calming the inner beast and giving you the Well-Rested experience bonus for 8 hours. (in order to replace the lost resting perks as a werewolf)\r<br />\r<br />[b][u][size=3]Compatibility:[/size][/u][/b]\r<br />\r<br />Compatible with Moonlight Tales or most any werewolf mod that doesn&#39;t edit the perks or howls. This mod makes no changes to the werewolf race or any script.\r<br />If you use any mod that changes howls or werewolf perks, the mod you load last will override the other. Load this mod last if you want its effects.\r<br />\r<br />\r<br />\r<br />[size=3][b][u]Install:[/u][/b][/size]\r<br />\r<br />1. Put .esp in your &#34;/Data/&#34; folder\r<br />2. Activate in mod manager\r<br />3....\r<br />4. Profit\r<br />\r<br />\r<br />\r<br />[b][u][size=3]Update Log:[/size][/u][/b]\r<br />\r<br />1.7\r<br />-Removed buggy effects (and all modified scripts)\r<br />-added new perks\r<br />-Made howl durations and cooldowns uniform (and balanced with Dragonborn rings)\r<br />-Redid all effects to ensure compatibility and reliability\r<br />-Ate Whiterun again (They really hate this mod)\r<br />\r<br />1.6 and 1.6b\r<br />-Two versions. Changes how Beast Nature works: 1.6 uses speedmult script, 1.6b uses magic effect to modify movement speed. Only run one .esp at a time.\r<br />-Removed weapon speed mult from beast nature.\r<br />-Silver weapons now affect Beast Nature, and the description accurately says &#34;undead and werewolves&#34; take damage.\r<br />-Got to level 70 on GW2\r<br />\r<br />1.51\r<br />-Included speedmult script as in-game AV changes don&#39;t work\r<br />-Removed Herobrine\r<br />\r<br />1.5\r<br />-Fixed bugs with Hircine&#39;s Blessing and Beast Nature\r<br />-Added in-game update script.\r<br />1.4\r<br />-Fixed Bugs from 1.3\r<br />-Ate Whiterun again.\r<br />\r<br />1.35 \r<br />-Rebalanced Beast Nature\r<br />-Tested Perks by eating all of whiterun and riften (They work, btw)\r<br />1.3:\r<br />-Added Beast Nature\r<br />-Fixed Full Moon Rising\r<br />-Fixed possible bug with Howl of Terror. \r<br />-Increase max perk points\r<br />-Added Poison Resist to Beast Blood\r<br />-Increased cooldowns on new howls.\r<br />-Added Hunter&#39;s Sight (nighteye power) activate the Hunt Totem and you&#39;ll get the spell.\r<br />\r<br />1.2:\r<br />-Added Feral Rage, Modified Hunter&#39;s Instincts to match it.\r<br />-Added Full Moon Rising\r<br />-Added Hircine&#39;s Blessing\r<br />-Fixed the limitation on werewolf perks (previously did not account for H.I... oops)\r<br />\r<br />1.1:\r<br />-Added Hunter&#39;s Instincts\r<br />-Made the perk tree look better.\r<br />\r<br />\r<br />FAQ:\r<br />Q:When&#39;s the next update?\r<br />A: As soon as I&#39;m sure it works, you&#39;ll have it. I do have to sleep.\r<br />\r<br />Q:Can you add...?\r<br />A: Yeah probably. Though I&#39;m currently at the point where I&#39;d rather make the current changes better rather than add new material.\r<br />\r<br />Q:I have a bug&gt;\r<br />A: Tell me what it is. This plugin is very simple at its core, and uses almost entirely existing assets from the game to avoid bugs/crashes/weirdness. If something is wrong, its likely my error and I will gladly fix it and upload a new version, just for you.\r<br />\r<br />\r<br />Bugs: \r<br />Possible bug with getting more than 11 perk points, but it works so far. \r<br />\r<br />Feedback is appreciated, feel free to request perks. ",
  "categoryId": "24",
  "version": "1.71",
  "author": "MichaelDusk",
  "createdUnix": "1344621498",
  "updatedUnix": "1408474340",
  "containsAdultContent": false,
  "uploadedBy": "MichaelDusk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "95789",
      "name": "Werewolf Perks Expanded 1_6",
      "version": "1.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "Werewolf Perks Expanded 1_6-22134-1-6.zip",
      "uploadedUnix": "1351209476",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/7fc2fd4deb147837301ee1d9bdaeae47a08184888567b1e10593e5784ff7e5a1/analysis/1407236103/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Werewolf%20Perks%20Expanded%201_6-22134-1-6.zip?fid=95789&ttl=1535791496&ri=8192&rs=8192&setec=91e69c81cbc998b2ff6afd8959f48ef0"
    },
    {
      "fileId": "1000122470",
      "name": "WPE 1.7 Beta",
      "version": "1.7 beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "WPE 1.7 Beta-22134-1-7.zip",
      "uploadedUnix": "1408283364",
      "modVersion": "1.7 beta",
      "virusScanUrl": "https://www.virustotal.com/file/df1c86b4b931893527f36579c96ecf42b80ee022b64892d94478b0c6807e1c3e/analysis/1408283462/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WPE%201.7%20Beta-22134-1-7.zip?fid=1000122470&ttl=1535791497&ri=8192&rs=8192&setec=54047d55962c9fd12af15771a6949274"
    },
    {
      "fileId": "1000122514",
      "name": "Amulets of Hircine",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Amulets of Hircine-22134-1-0.zip",
      "uploadedUnix": "1408301993",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c609acfeab98b1c5898982ad099c49a53edfd46ce92eafc171ff547aff78a39c/analysis/1408302007/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Amulets%20of%20Hircine-22134-1-0.zip?fid=1000122514&ttl=1535791497&ri=8192&rs=8192&setec=b1be4621d95091e97ee51b47db7d9eef"
    },
    {
      "fileId": "1000122795",
      "name": "WPE 1.7 Full",
      "version": "1.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "WPE 1.7 Full-22134-1-7.zip",
      "uploadedUnix": "1408463369",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/da0a9689dc60843becb0e7b1f1b2737fbdf6d74ad153530d6db6bf4374aa1dd2/analysis/1408528755/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WPE%201.7%20Full-22134-1-7.zip?fid=1000122795&ttl=1535791498&ri=8192&rs=8192&setec=72d885f5436192571738649039037f52"
    },
    {
      "fileId": "1000122819",
      "name": "WPE 1.71",
      "version": "1.71",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "WPE 1.71-22134-1-71.zip",
      "uploadedUnix": "1408474340",
      "modVersion": "1.71",
      "virusScanUrl": "https://www.virustotal.com/file/cd6d627d993bd2d0ea83b93d038cf1f3e656c437af42136fcd13ce85783cbc17/analysis/1408528411/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WPE%201.71-22134-1-71.zip?fid=1000122819&ttl=1535791498&ri=8192&rs=8192&setec=ab8d2898b47e9d4a84f2884515f8f0f2"
    }
  ]
}