{
  "modId": 22202.0,
  "modName": "Ardwen to Gildergreen - DELETED",
  "summary": "Ardwen continues on the the Gildregreen now!",
  "descriptionHtml": "Ardwen to Gildergreen:\r\n\r\nWhat this mod does:\r\n===================\r\nArdwen takes a harrowing pilgrimage all the way to the Gildergreen of Whiterun to stop outside the gates by the carriage and do nothing but complain about her \\\"stupid dog\\\". This mod is a simple move of the reference point (a coc heading marker that she travels to) from outside Whitrun to inside Whiterun next to the Gildergreen. \r\n\r\nFAQ:\r\n====\r\n- This does not change anything else, so Ardwen can still die in her travels.\r\n- Ardwen may or may not get involved in any battles (including Civil War) as she is now inside Whiterun. (untested)\r\n- Testing has showed that her \\\"stupid dog\\\" seems to not always teleport through the Whiterun main gate, and most often gets stuck outside.  This is not intentional, but also prevents a lot of annoying barking and comments of \\\"Stupid Dog.\\\"\r\n- I have no plans to ever update and/or further play test this mod, sorry.\r\n\r\nInstall:\r\n========\r\nDrop the ArdwenToGildergreen.esp into the Data folder.\r\n\r\nUninstall:\r\n==========\r\nDelete the ArdwenToGildergreen.esp in the Data folder. There should be absolutely no problems with this deletion.\r\n\r\nConflicts:\r\n==========\r\nI have a very limited list of mods and I am too lazy to play test this with every mod that changes the inside of Whiterun: use as you wish.\r\n\r\nMODDERS:\r\n======== \r\nFeel free to just view this change and add it to whatever mod you want instead of adding another mod to the huge list (in truth this is an independent version of a change I made in another mod.)\r\n\r\nPermissions:\r\n============\r\nYou are free to do anything with this mod you like without asking permission EXCEPT upload this mod to any other site except The Nexus Network.  I want to keep any file I create a Nexus Exclusive: I had been a free Nexus member so long and chewing up their bandwith so I want to try to give something back. Don\\'t get concerned if you make the identical change in your mod and then upload it somewhere else: there isn\\'t enough in this mod for me to care about that.",
  "categoryId": "95",
  "version": "1.0",
  "author": "Anubis_Priest",
  "createdUnix": "1344701073",
  "updatedUnix": "1344701137",
  "containsAdultContent": false,
  "uploadedBy": "anubispriest",
  "primaryFile": null,
  "files": [
    {
      "fileId": "80653",
      "name": "Ardwen to Gildergreen",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "5",
      "fileName": "Ardwen to Gildergreen-22202-1-0.zip",
      "uploadedUnix": "1344701137",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8bbc977c19f40168548392db63aad7f53a147974ba62c081a3ae7b35830a8d38/analysis/1407088262/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ardwen%20to%20Gildergreen-22202-1-0.zip?fid=80653&ttl=1535791606&ri=8192&rs=8192&setec=56aa8a8746f8e67a90ec677c2f601d0b"
    }
  ]
}