{
  "modId": 22208.0,
  "modName": "Charons Revenge",
  "summary": "This mod consists of three things: A new follower, a house and new recipes for a \r\npotion, a bow, arrows, two weapons, counterfeit money, and a low level copy of\r\nthe Nightingale Armor set (unenchanted).",
  "descriptionHtml": "CHARON\\'S REVENGE:\r\nAugust 10, 2012\r\nAuthor: KRF\r\n==========================\r\n\r\n\r\nThis mod consists of three things: A new follower, a house and new recipes for a \r\npotion, a bow, arrows, two weapons, counterfeit money, and a low level copy of\r\nthe Nightingale Armor set (unenchanted).\r\n\r\nIn Greek mythology, Charon is the ferryman of Hades who carries the souls of \r\nthe newly deceased across the rivers Styx and Acheron that divides the world \r\nof the living from the world of the dead.\r\n\r\nCharon’s Revenge is a former military transport ship turned pirate ship. After \r\nbeing recaptured and retired from service it now sits at the Solitude docks \r\nslowly sinking into history.\r\n\r\nThis ship/home was laid out to accommodate up to five followers. It has over a \r\ndozen different “stations” for them to interact with and keep busy (providing you have\r\nthe option that allows this). It has tons of storage chests, weapon racks, weapon\r\nplaques, three mannequins, and two display cases. Also, there is a crafting station for\r\nevery purpose.\r\nWith this mod I also made a few changes to Lydia (Housecarl from Whiterun). I \r\ngave her some casting abilities, added a torch to her inventory, and increased \r\nher run speed slightly.\r\n\r\nZohl is a Nord follower I created for this mod (you cannot merry him). You must first \r\nlocate his camp to gain access to the ship. He is set as “essential”, so he cannot die, only \r\nget knocked out. \r\nBoth Lydia and Zohl have the same casting abilities and values, except Lydian is NOT \\\"essential\\\" \r\n(by default).\r\nAt Zohl’s camp you will find a crate with a book (detailing this mod a bit more) and a key \r\nsitting on top of it.\r\nZohl’s camp is located at the East Empire Trading Company docks (near Solitude). You will find him\r\ncamping on a rooftop. Look for a ladder behind a cart to gain access.\r\n\r\nI also made some modifications to some gear. It’s up to you if you want to \r\nuse it. I gave everything I changed their own REF ID as not to interfere with the \r\ndefault values of the original gear.\r\n\r\nWhile some asspects of this mod may be considered \\\"cheat\\\" the ship is still a\r\nstandard house. It\\'s up to you if you wish to use the weapons and gear.\r\n\r\n--------------------------------------------------------------------------------\r\nInstallation Path for Windows 7: My Computer / Local Disk C / Program Files(x86)\r\n / Steam / steamapps / common / skyrim /Data\r\n--------------------------------------------------------------------------------\r\n\r\nIn all reality this is a really simple mod, and does not require Dawnguard.\r\n\r\nKNOWN ISSUES:\r\n-------------\r\n01) Due to an animation conflict between the default smelter and the one I\r\ncreated this station has been disabled for followers. It does however work perfectly\r\nfor player.\r\n02) From time to time you may find that your mannequins have joined the world of the\r\nliving. I have found that if you leave the ship (cell) and return they may be placed\r\nback on their stands. If that don\\'t work try \\\"activating\\\" them as if you were to \r\nexchange gear. The mannequin\\'s activators will be where their stands are. This\r\nglitch is a well known problem and isn\\'t caused by this mod. Aside from becoming\r\n\\\"alive\\\" I have had NO problems exchanging gear with them.\r\n\r\n\r\nThis mod has been tested and found to work really well with:\r\n\r\nFLOKII\\'s UFO-ULTIMATE FOLLOWER OVERHAUL\r\n\r\nhttp://skyrim.nexusmods.com/mods/14037",
  "categoryId": "28",
  "version": "Final",
  "author": "KRF",
  "createdUnix": "1344709361",
  "updatedUnix": "1344709489",
  "containsAdultContent": false,
  "uploadedBy": "Zohl",
  "primaryFile": null,
  "files": [
    {
      "fileId": "80687",
      "name": "Charons Revenge",
      "version": "Finale",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "486",
      "fileName": "Charons Revenge-22208-Finale.zip",
      "uploadedUnix": "1344709489",
      "modVersion": "Finale",
      "virusScanUrl": "https://www.virustotal.com/file/ec4a58c9e2ec40707606640580bd7035b219dc7ac53d3bb4be1caecda6af5567/analysis/1407088685/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Charons%20Revenge-22208-Finale.zip?fid=80687&ttl=1535791615&ri=8192&rs=8192&setec=cbbbc042198b9f15c8d407eae2ba6733"
    }
  ]
}