{
  "modId": 22225.0,
  "modName": "Harvest More Food and Ingredients",
  "summary": "All direct ingredient & food sources, be they flora, statics, critters or monsters now have a chance to yield a higher amount upon harvesting/looting.",
  "descriptionHtml": "All direct ingredient & food sources, be they flora, statics, critters or monsters now have a chance to yield a higher amount upon harvesting/looting.\r\n\r\nAs a person that likes to roleplay an alchemist/gatherer in TES games, I find that Skyrim does not reward you enough for taking some of your adventuring time to harvest plants and hunt creatures. I\\'ll sometime go on an harvesting binge for about an hour or so, only to come back with 20ish ingredients, which is pretty underwhelming and unrealistic. With a lot of high-level players sticking to chain fast travels between towns to get their ingredients, it seems obvious that not a whole lot of people consider harvesting to be cost-efficient and that is a missed opportunity from the game. This mod aims to fix that.\r\n\r\nWhile all direct sources of food and ingredients (plants, mushrooms, crops, wildlife and a few monsters) have been modified to potentially yield more stuff based on probability, the maximum numbers were kept as realistic as possible and as such, you won\\'t get 3 eyes from a dead sabercat or 2 snouts from a mammoth. On average, you should get around 2 items per harvest/loot but there is quite a bit of variance, so you could get only 1 item for a while or get lucky and receive more than 2!\r\n\r\nThis mod should be pretty balanced if you only harvest here and there during your adventures. However, if like me you like to go out and harvest a lot, you should probably install a mod that lowers the gold value of player-created potions because the ingredient yield will be a little high and you may make a little too much from selling your potions.\r\n\r\nAs an added bonus, clams now have a small chance to yield a pearl and spriggans will always drop at least one spriggan sap, which were unavailable in the game before.\r\n\r\nThe mod should be compatible with pretty much anything out there, as long as the flora and trees are left alone. I play-tested it for around 10 hours and everything has worked as intended so far. If you find anything that sticks out and seems wrong, let me know and I\\'ll fix it.\r\n\r\nAn optional version for the players who own the Dawnguard DLC will be uploaded soon. Stay tuned!",
  "categoryId": "24",
  "version": "0.1.0",
  "author": "ReignSupreme",
  "createdUnix": "1344727015",
  "updatedUnix": "1344727407",
  "containsAdultContent": false,
  "uploadedBy": "ReignSupreme",
  "primaryFile": null,
  "files": [
    {
      "fileId": "80754",
      "name": "Harvest More Food and Ingredients ",
      "version": "0.1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Harvest More Food and Ingredients -22225-0-1-0.7z",
      "uploadedUnix": "1344727407",
      "modVersion": "0.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cfe129ae94f2a3cc3366a5a5ab160f70f02b44489079a3bac5d628cc31a401bc/analysis/1407089223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Harvest%20More%20Food%20and%20Ingredients%20-22225-0-1-0.7z?fid=80754&ttl=1535791648&ri=8192&rs=8192&setec=513d4b86263ceb6549d7b086bad92bc0"
    }
  ]
}