{
  "modId": 2223.0,
  "modName": "Proudspire Manor Fixed with Smithy",
  "summary": "This rework of Proudspire Manor is intended to add the smithy and storage that many were dissappointed to not see included without overly breaking the integrity or look and feel of the house itself.\r\n\r\nAdditionally, this release addresses a couple of minor bugs with the original house.\r\n",
  "descriptionHtml": "NOTE:  Do not use this file.  It\\'s existence here is more a matter of historic value than anything else..  lol.  It may or may not prove useful to someone looking to correct the same bugs i initially fixed.  As it stands though, this is probably not a playable mod and it will likely crash the hell out of your game.  This was created back in the dark ages before the release of the CK and I never got around to updating it with the CK before there were tons of other viable Proudspire mods available.  If I end up releasing any of my other stuff done properly with the CK.. they probably won\\'t be basic house mods.\r\n\r\n\r\nThis rework of Proudspire Manor is intended to add the smithy and storage that many were dissappointed to not see included without overly breaking the integrity or look and feel of the house itself or excessively break the dimentions of the original house too horribly beyond their external dimentions.\r\n\r\nAdditionally, this release addresses a several minor bugs in the original house.\r\n\r\nBugs fixed:\r\n- Corrected graphics flicker on the wall in the enchanting room behind the mannequin\r\n- Corrected the patio door which had incorrectly been linked to the wrong key to unlock.\r\n- Fixed 2 basement weapons racks not working in default house\r\n\r\nChanges:\r\n- Addition of a full working smithy including forge & anvil, grinding stone, workbench, and tanning rack\r\n- Addition of smelter\r\n- Addition of storage in smithy\r\n- Added weapons plaques to smithy\r\n- Addition of apothecary satchel on alchemy table for convenient ingredient storage\r\n- Added strongbox to enchanting table for convenient soul gem storage\r\n- Added chest to alchemy area for potion storage\r\n- Added chest near basement door for quick loot dumping\r\n- Addition of a small side room and movement of the housecarl\\'s sleeping arrangements\r\n- Added chest and wardrobe to housecarl\\'s bedroom\r\n- Removal of various items of clutter from basement\r\n- Removal of several items of clutter from main floor which were guaranteed to be knocked over onto the floor at every available opportunity\r\n- Added clutter\r\n\r\nPlanned changes:\r\n- Add a library/trophy room for us OCD collectors (will include additional mannequins)\r\n** Now that the horror of patch 1.2 is behind us, devleopment has resumed**\r\n\r\nInstallation:\r\nNote: This mod moves and changes existing storage items in the basement.  It is suggested to move your stuff upstairs before activating.  Any storage above the basement level is completely safe for installation.  Please take note of step 1.  This mod fixes weapon racks and adds additional racks.  You must load for the first time after installing/updating from a save that is not inside the house or they will not behave correctly.\r\n1. Ensure you save game outside of Proudspire.\r\n2. Download and unrar the contents to your Skyrim data directory\r\n3. Activate Proudspire.esp under the Data Files option of the loading menu.\r\n     If your Data Files option is greyed out, do the following:\r\n        - Go to the directory Documents\\\\My Games\\\\Skyrim\r\n        - Open the file SkyrimPrefs.ini with notepad\r\n        - Under the heading [Launcher] add the following line:\r\n                   Add bEnableFileSelection=1  \r\n     This will enable Data Files on the Launcher\r\n4. Smile a blissful smile\r\n\r\nNOTE:  This mod was created using recycled id codes from the items that were removed and unwanted.  As a result, unexpected results MAY occur if you have been doing a lot of terrible \\\"markfordelete\\\" behaviour via the console.  Reverting to a save without any manual removals is recommended.\r\n\r\nCompatibility:\r\nShould not be used together with any other Proudspire mod.\r\nNo known compatibility conflicts with any other mod.\r\nAs anticipated, all CTDs (crashes to desktop) involved with the use of this mod have ceased under Skyrim patch 1.3.  This mod should not be used with the broken 1.2 game patch.\r\n\r\nPermissions:\r\nThis mod may be used as the basis for your own modifications upon request.  Appropriate credit should be provided if permission is granted.\r\n\r\nThis mod may not be re-distributed in any form without the author\\'s permission.\r\n\r\nChangelog:\r\nv1.1 December 9th 2011\r\n- Fixed weapons racks not working in default house\r\n- Fixed ownership of housecarl\\'s bed to resolve bug in 1.0\r\n- Added weapons plaques to smithy\r\n- Added strongbox to enchanting table for convenient soul gem storage\r\n- Added chest to alchemy area for potion storage\r\n- Added chest near basement door for quick loot dumping\r\n- Added chest and wardrobe to housecarl\\'s bedroom\r\n- Added clutter\r\n\r\nv1.0 December 1st 2011\r\n- Corrected graphics flicker on the wall in the enchanting room behind the mannequin\r\n- Corrected the patio door which had incorrectly been linked to the wrong key to unlock.\r\n- Addition of a full working smithy including forge & anvil, grinding stone, workbench, and tanning rack\r\n- Addition of smelter\r\n- Addition of storage in smithy\r\n- Addition of apothecary satchel on alchemy table for convenient ingredient storage\r\n- Addition of a small side room and movement of the housecarl\\'s sleeping arrangements\r\n- Removal of various items of clutter from basement\r\n- Removal of several items of clutter from main floor which were guaranteed to be knocked over onto the floor at every available opportunity\r\n",
  "categoryId": "67",
  "version": "1.1",
  "author": "Mutifex",
  "createdUnix": "1322740658",
  "updatedUnix": "1323426716",
  "containsAdultContent": false,
  "uploadedBy": "mutifex",
  "primaryFile": null,
  "files": [
    {
      "fileId": "5889",
      "name": "Proudspire Manor",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Proudspire Manor-2223.rar",
      "uploadedUnix": "1322740887",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ce420345733ad2552517c124f8c91d1cb9e288a7acdf0168e70aa26543455a93/analysis/1406465043/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Proudspire%20Manor-2223.rar?fid=5889&ttl=1535756374&ri=8192&rs=8192&setec=2f02b93b606d947e5ff057a5e068cf05"
    },
    {
      "fileId": "8516",
      "name": "Proudspire Manor v1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Proudspire Manor v1-1-2223-1-1.rar",
      "uploadedUnix": "1323426716",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/3b2b78d7c8443e8c9acfa8d38ff003c22f2b1e372f2db9e630b0b69dbb71a7a5/analysis/1406496844/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Proudspire%20Manor%20v1-1-2223-1-1.rar?fid=8516&ttl=1535756374&ri=8192&rs=8192&setec=a7c3b5e0554f531b205fe8153efd2ed0"
    }
  ]
}