{
  "modId": 22257.0,
  "modName": "Arvak Colors",
  "summary": "Adds several new colors for Arvak. ",
  "descriptionHtml": "*******This mod has been discontinued. See Dawnguard Rewritten: Arvak for a more detailed and hi quality Arvak!*******\r\n\r\nThis mod just adds several new color choices for the skeletal horse Arvak. They\\'re pretty simple but I thought people might like to have a few more choices than the default ghost blue. \r\n\r\nIf anyone has any colors they\\'d like me to add just leave a request in the comments section and if its feasible I\\'ll add it as soon as I can. \r\n\r\nThis is my first mod so if there are any problems I encourage users to leave comments explaining whats wrong and I\\'ll fix what I can. \r\n\r\n\r\nColors: Burgundy, Dark Green, Green, Lime Green, Orange, Pink, Purple, Red, Teal, and Yellow. \r\nThere are two mesh versions of each color: Flames and No-Flames (I added the hyphen because I could). Make sure you only choose one of those meshes and not both          \r\n\r\nI also included the default file and default no flames for Arvak in case any errors occur, for uninstallation purposes, or in case you want to create your own custom color.\r\n\r\nAnother mod that makes this horse infinitely more convenient is AndrewOverload519\\'s Summon Arvak- Now a Lesser Power which can be found at http://skyrim.nexusmods.com/mods/22540. \r\nAlso check out my co-author Faelrin\\'s flames/no-flames and color pack at http://skyrim.nexusmods.com/mods/23735. \r\nIf you want Arvak to be a lot faster look to Emberwake\\'s Improved Arvak at http://skyrim.nexusmods.com/mods/23470.\r\n(Arvak-Now A Lesser Power and Improved Arvak are compatible. You get the best of both: Arvak as a power with awesomely increased speed.)\r\n\r\nCompatibility:\r\nSo far as I know since this just adds re-textures and new meshes and it doesn\\'t altar any of Arvak\\'s values or scripts this shouldn\\'t interfere with any other mods unless they change his texture or mesh. If there is any incompatibility please let me know via the comments section. This of course requires Dawnguard.\r\n\r\nInstallation:\r\n                Just drop the color texture and mesh you want into your Skyrim>Data folder and click yes when it asks you to merge and your done! Only use Flames or No-flames, not both.\r\n\r\nUninstallation:\r\n                  Just delete the file or overwrite with the default file I included. (I recommend \r\n                  deleting the file that way you don\\'t have one more file cluttering things up)\r\n\r\nNotes:\r\n           Some of the colors are kinda similar i.e. Pink and Purple, Red and Burgundy.\r\n\r\nCredits:\r\nTons of thanks go to my co-author Faelrin for providing the flames and no-flames meshes.\r\nThanks to Team Teamwork\\'s Ocarina of Rhyme and Tobacco for getting my lazy ass motivated.\r\nAnd of course thanks to Bethesda Softworks for making some of the best games of all time.",
  "categoryId": "29",
  "version": "3.0",
  "author": "sanguine6 and Faelrin",
  "createdUnix": "1344761841",
  "updatedUnix": "1347074028",
  "containsAdultContent": false,
  "uploadedBy": "sanguine6",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87076",
      "name": "New Colors For Arvak",
      "version": "Final",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14487",
      "fileName": "New Colors For Arvak-22257-Final.rar",
      "uploadedUnix": "1347074028",
      "modVersion": "Final",
      "virusScanUrl": "https://www.virustotal.com/file/614654dd970133f84ab91d35d02bb0176c90f028d78967abf65ab94fe3bbeb5e/analysis/1407152472/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Colors%20For%20Arvak-22257-Final.rar?fid=87076&ttl=1535791692&ri=8192&rs=8192&setec=5430a5d40c509991a83220aa2e34ccfa"
    }
  ]
}