{
  "modId": 22263.0,
  "modName": "Fort Dawnguard Additions",
  "summary": "Adds a few extra features to Fort Dawnguard",
  "descriptionHtml": "[b]Note: Theres still some bugs with my first version and all 3 variations of it. Namely the doors missing(you can TCL out to them) and uninstalling not fixing it. Im unsure why uninstalling and clean saving doesnt work properly, I am kind of new to this but I am looking into why so I know what went wrong. See the Uninstall section for things to try. For those of you who absolutely cannot reload a save prior to using my mod Ive uploaded a workaround mod that only places new doors where the old ones were, which should 99% surely uninstall via a clean save if your original doors ever show up again :P\r\n\r\nI made a new version from scratch and stayed the hell away from the doors, and this version just adds new storage/crafting and lights. No mannequins or plaques or shelves yet, Ill make another version for that based off this new one for those who want it. Hopefully this should not have any performance impact for people like there was with all the new activators, and I no longer need to use a workaround for crashes that can potentially screw up doors.[/b]\r\n\r\n\r\n\r\n\r\n\r\n\r\nDescription:\r\nThis adds some minor improvements to Fort Dawnguard that are accessed by playing through the main quest normally. I wanted to keep the feel of the place, but add some more functionality for crafting and storage. I did make this for myself but Ill take any constructive feedback or ideas.\r\n\r\nIve added \\\"categorized\\\" storage to their relevant areas(ingredients chest for alchemy area, soul gem chest to enchanters area, etc), anything I dont list I did NOT touch and is probably not safe. I also did some editing to the crafting area such as adding a chopping block. \r\n-Footlocker at the players bed\r\n-Ingredients/Potions/Poisons/Recipes to the alchemy area\r\n-Soul Gems and Jewelery to enchanting area\r\n-Smithing chest near the forge\r\n-Food cupboard by the hearth in the mess hall\r\n-Quick loot dump chest just to the right when you walk in the main door\r\n\r\n\r\nInstallation:\r\n-If youve stored anything anywhere in Fort Dawnguard, remove it.\r\n-Drag and drop the files into your Data folder, or install with NMM like any other mod. \r\n-Activate the mod.\r\n\r\nUninstallation/updating to new Lite version:\r\n-Remove everything youve put into Fort Dawnguard(everything in any container), leave Fort Dawnguard and make a new save.\r\n-Uninstall with NMM.\r\n-Go into your Data folder and double check there are no \\\"Fort_Dawnguard\\\" ESP/BSA/anything files left.\r\n-Load up the game on that save and open the console, type in \\\"resetinterior DLC1DawnguardHQ01\\\" -without the quotes - and hit enter. Then type in \\\"pcb\\\" and hit enter. This is to remove any old lights or other objects(unfortunately it wont fix the doors for me).\r\n-Make a new save and exit the game.\r\n-Reload the game and enter Fort Dawnguard, then turn around and check if the doors are there. Theyre probably not, and Im not sure why its ONLY the doors that seem to do this. \r\n-At this point you really only have two options until I can figure something else out. \r\na) In the downloads Ive put up an optional ESP that adds new doors that look and work exactly like the old normal doors. The downside to this is you need to keep using that ESP, it doesnt actually \\\"fix\\\" anything since its just a workaround. \r\nb) Reload a save from before you installed my mod. Not really ideal solutions but its all Ive got at the moment.\r\n\r\nIf updating:\r\n-Now is when you would install the new Lite version if you want/are brave enough to use it. \r\n\r\n \r\nCompatibility:\r\nProbably wont work well with any other mod that alters Fort Dawnguards interior, especially lighting mods. I dont know of any offhand but I can see More Dynamic Shadows causing issues if they mess with Fort Dawnguard in the future, though there are very few places you can add dynamic lighting(yes, even with lightball scripts) and doing so just makes the lack of dynamic lights in the main areas all the more apparent. Will still work just fine with darker interior mods like Climates of Tamriel, or any shader mods like ENB/FXAA etc.\r\n\r\nI do however highly recommend using both of these mods for improved mannequin and bookshelf functionality, though its entirely unnecessary.\r\nhttp://skyrim.nexusmods.com/mods/10652\r\nhttp://skyrim.nexusmods.com/mods/10891\r\n\r\nChanglog:\r\nVersion 04: Whole new \\\"Lite\\\" version. No mannequins, no weapon plaques, no bookshelves. Some lighting changes though nothing major, but mainly all this version of the mod does is add safe storage and a wood chopping block. Theres a chest for smithing supplies, soul gems, jewelery/gems, potions, ingredients, and a new cupboard in the dining hall by the fire for food. Every change and container was done from scratch, so its incompatible with my old versions.\r\n\r\nVersion 03: Kind of a major revision of the main hall. I was getting too much lag on entering with so many mannequins so Ive cut it down to 4, and fleshed each \\'corner\\' out with more display options. If you prefer the darker lighting and more mannequins then stick to 1.01. I do miss my mannequins but Fort Dawnguard just isnt the place for them.\r\n-Reduced the bookshelves to 6, and added a few bookcases. This was mostly to help with initial loading lag, and because I think the area looks better with them. They also come with the main hall now instead of the player bedroom.\r\n-Reworked the lighting some more, overall brighter in the main hall, though the player bedroom may have some flickering when using a torch. \r\n-Changed one of the Ingredients chests to a Recipes chest. \r\n-Added a few more cots to the \\\"barracks\\\" area because I use UFO and had a few more NPCs living in Fort Dawnguard. Word of warning though, adding too many NPCs to the already crowded Fort Dawnguard can cause some performance issues depending on your system. \r\n-misc bug fixes, including a few Bethesda missed\r\n\r\nVersion 02: You may want to make a save before updating just to be safe, though I didnt touch any of the containers or mannequins so it should be fine... better safe than sorry though. You also dont need to replace the BSA if youre doing it manually, it just contains the scripts which are the same.\r\n-Fixed the upper level exit doors to not crash when exiting, LOLOOPS\r\n-Tweaked the lighting a little bit in the main hall and player room\r\n-Changed the sharpening wheel and workbench to appear along with the rest of the smithing area\r\n-Fixed a light glitch where it was seeping through the wall by the smithy\r\n\r\n\r\n\r\nSpecial thanks to jonwd7 for pointing me to Amethyst Deceiver\\'s script fix, and to eldiabs for his prefab resources. \r\nhttp://forums.bethsoft.com/topic/1384861-yet-another-huge-bug-interior-cell-as-a-static-limit/page__st__30__p__21004763#entry21004763\r\nhttp://skyrim.nexusmods.com/mods/11618",
  "categoryId": "67",
  "version": "1.10",
  "author": "Achromatis",
  "createdUnix": "1344771221",
  "updatedUnix": "1345337593",
  "containsAdultContent": false,
  "uploadedBy": "Achromatis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "80963",
      "name": "Fort Dawnguard",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "76",
      "fileName": "Fort Dawnguard-22263-.zip",
      "uploadedUnix": "1344771297",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d368bc0b6ac1545609ae356aa54c8fcdcf96527cb683e04a812562e7a56c8330/analysis/1407090963/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fort%20Dawnguard-22263-.zip?fid=80963&ttl=1535791699&ri=8192&rs=8192&setec=45c6f790693e535a4365b6b182c06379"
    },
    {
      "fileId": "81108",
      "name": "Fort_Dawnguard_Additions_1-01",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "77",
      "fileName": "Fort Dawnguard Additions Update 01-22263-.zip",
      "uploadedUnix": "1344802575",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d915901e0e75d6b994b8440732dc85f1b5bf7fc1eab463c8b174c3cbf8d5a28a/analysis/1407092044/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fort%20Dawnguard%20Additions%20Update%2001-22263-.zip?fid=81108&ttl=1535791700&ri=8192&rs=8192&setec=027294ac1562e19666aebce8d002ab60"
    },
    {
      "fileId": "82082",
      "name": "Fort_Dawnguard_Additions_1-02",
      "version": "1.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "68",
      "fileName": "Fort_Dawnguard_Additions_1-02-22263-1-02.zip",
      "uploadedUnix": "1345155354",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/d3abfc6afaf8e682d2207b309f8cc6c46d3fbf9f486c1369a0778b22003ca0ae/analysis/1407101583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fort_Dawnguard_Additions_1-02-22263-1-02.zip?fid=82082&ttl=1535791700&ri=8192&rs=8192&setec=93433bea5a78339ca394a8921cbecc31"
    },
    {
      "fileId": "82604",
      "name": "Work around for people having issues with missing doors",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "81",
      "fileName": "Work around for people having issues with missing doors-22263-.rar",
      "uploadedUnix": "1345337231",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d3f450a531e267de292fbe10f30bd225cb4a3e728695e59a173141708a5686e0/analysis/1407106327/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Work%20around%20for%20people%20having%20issues%20with%20missing%20doors-22263-.rar?fid=82604&ttl=1535791701&ri=8192&rs=8192&setec=46222db0c285c270ef9ab8ea8d11c548"
    },
    {
      "fileId": "82606",
      "name": "Fort Dawnguard Lite",
      "version": "0.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "52",
      "fileName": "Fort Dawnguard Lite-22263-0-01.rar",
      "uploadedUnix": "1345337593",
      "modVersion": "0.01",
      "virusScanUrl": "https://www.virustotal.com/file/7b0c528c7803f54cb63515decf0318a67dcc5fe8e0f6c6d506f5cb6630fb05b0/analysis/1407106386/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fort%20Dawnguard%20Lite-22263-0-01.rar?fid=82606&ttl=1535791701&ri=8192&rs=8192&setec=b0c0a9032c1f0ab977a9e55a8a60d24c"
    }
  ]
}