{
  "modId": 22273.0,
  "modName": "More Salt",
  "summary": "More Salt is a mod that significantly increases the quantity of random salt pile sold from merchants selling food or loot obtained from food containers.\r<br />",
  "descriptionHtml": "More Salt is a mod that significantly increases the quantity of random salt pile sold from merchants selling food or loot obtained from food containers.\r<br />\r<br />Salt pile supplies you can buy or find in Skyrim are adjusted in small numbers. If you use salt piles for alchemy only that is fine but if you want to cook then you start realizing that salt pile supplies are not enough to either buy or loot.\r<br />\r<br />Almost every cooking recipe requires a salt pile. When you go cooking you often find yourself having lots of raw food and no more salt piles to cook.\r<br />\r<br />This mod will allow you to buy or loot significantly more salt piles to use for cooking.\r<br />Vanilla Skyrim offers you 1-5 salt pile to either merchants or food containers like barrels and sacks. Now you will often encounter quantities of 6 to 36 or so.\r<br />\r<br />Realistically and supposing that every Skyrim inhabitant cooks the same recipes as you do, it is impossible to actually cook. So it makes sense that food vendors must have more salt piles available as well as more can also been found within food containers as inhabitants would use them to cook.\r<br />\r<br />How it works, where is that additional salt?\r<br />When visiting food vendors that is innkeepers and generic food vendors at city open markets as well as looting common food containers like barrels and sacks you may encounter a random quantity of salt piles, usually more than 1 or sometimes 2. This random quantity however is just 2-3 more, giving you a total range of 1 to 5 salt piles maximum. The random quantity now ranges from half to even few dozens of salt piles. This mod does not add standard salt pile quantities to standard vendors or containers. It just increases the random quantity.\r<br />\r<br />Compared to the vanilla:\r<br />If the vendor/container would not have any salt at all, no salt piles you will find anyway.\r<br />If the vendor/container has a standard quantity set like 1-2 salts, you get that standard quantity.\r<br />If the vendor/container has a random quantity of salt pile added, you get the increased quantity.\r<br />\r<br />Compatibility:\r<br />Should be compatible with all except mods that affect the random quantities of salt provided. \r<br />For example, new food merchants or food containers added by other mods should make use of increased random salt pile quantities supposing the were created by cloning which makes most sense.\r<br />\r<br />Dirty entry: 1 ITM, ignore it. It is needed, no guarantee it works without. If you remove it however and the mod does not work place the mod at later order. If it does not work either, download the mod again. To make sure it does not work check at least 10 food barrels and/or 10 food vendors.\r<br />\r<br />Please let me know how it works - any comments are welcome.",
  "categoryId": "69",
  "version": "1.00",
  "author": "Stefanos Zilellis",
  "createdUnix": "1344780472",
  "updatedUnix": "1344780663",
  "containsAdultContent": false,
  "uploadedBy": "szilellis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81012",
      "name": "MoreSalt",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "MoreSalt-22273-1-00.rar",
      "uploadedUnix": "1344780663",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/28b91e7c1bfb8b1c4e3bf632205543a613c148b93889144973d6b8b92cfe3a1d/analysis/1407091323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MoreSalt-22273-1-00.rar?fid=81012&ttl=1535791717&ri=8192&rs=8192&setec=1a33c76d92a9c4c3a0b2b63fc98a4cd8"
    }
  ]
}