{
  "modId": 22288.0,
  "modName": "Professional voice acting and recording Possible Idea",
  "summary": "ARE YOU TIRED OF YOU\\'RE MODS THAT MAKE USE OF BAD VOICE ACTING AND RECORDING WELL THEN CHECK THIS OUT !!!! \r\n\r\nVoice acting and recording will be done at http://www.redroomrecords.co.za/\r\nAnd mixed and master by Jared Gunston",
  "descriptionHtml": "Sorry for my bad English i am from South-Africa, I am a full time musician and own a recording studio.\r\n\r\nNow to the point, I love games and mods but many times I get distracted by the bad voice acting and recording people use even though there are some great mods with great story lines, some mods just feel incomplete without the right voices without the right setting and by setting i mean atmosphere. But here\\'s where i come in and how i am planning on making this work :\r\n\r\nFirst of all you will have to send me a voicing script via e-mail and that script will contain all the characters, what accents you want for them and in what setting they are in for example one of you\\'re characters are located in a cave and then we will add the necessary  reverb to catch that atmosphere and obviously what the characters will be saying and what mood they will be saying it in.\r\n\r\nIf you think about it we all see great mods being created by people but all it lacks quality voices and actors. \r\n\r\nNow for the complicated part, it will not be free of charge but i promise you, you are not going to be paying you\\'re ass off. Me and my staff haven\\'t yet figured out a fee yet but we are hoping to get some responses from you guys and see what you think of the idea. Remember we can always working something out as well.\r\n\r\nI will upload some videos of bands we recorded so that you can hear the quality of sound we have and then you can decide. I will also upload some pics for you guys of the studio :) \r\n\r\nPlease if you guys have questions please feel free to ask me and also if you guys have ideas let me know, if you would like to contact me here\\'s my e-mail ( Louielixx@gmail.com )\r\n\r\nHope you guys like the idea :)",
  "categoryId": "61",
  "version": "",
  "author": "RedRoom Records",
  "createdUnix": "1344793892",
  "updatedUnix": "1344793892",
  "containsAdultContent": false,
  "uploadedBy": "MrSleaze511",
  "primaryFile": null,
  "files": []
}