{
  "modId": 22290.0,
  "modName": "Craft Temper Smelt",
  "summary": "Combination of my 3 other mods, that Allow Crafting, Tempering, and Smelting of all Vanilla equipment, along with some new gear and minor fixes.",
  "descriptionHtml": "Craft, Temper, Smelt: v1.04: Change Log Below\r\n\r\nI have combined my three other mods into one esp.\r\nForge Equipment = http://skyrim.nexusmods.com/mods/13597\r\nSalvage Material = http://skyrim.nexusmods.com/mods/11791\r\nUnarmed Spiked Gauntlets = http://skyrim.nexusmods.com/mods/16533\r\n\r\nThis mod contains all the changes from those mods along with any new updates I do. Most of the changes are now in the Crafting area. What this mod will do is allow crafting of all vanilla items, allowing complete sets of Stormcloak and Imperial sets to be made. Daedric Artifacts and Unique gear can be copied once you obtain them to produce unenchanted replicas. New equipment recipes from vanilla meshes, like Stormcloak Axe, Shield, Leather hoods, and circlets for various armor types with matching materialtypes for perk bonuses. Create Unblessed Amulets and Spiked Gauntlets to do unarmed damage.\r\n\r\nThe Smelter and Tanning rack will only display items that you have to be broken down into 1 of their material types. Only recipes you can use will display, all other \\\"greyed out\\\" recipes will be hidden, and no more HUGE Misc list to scroll thru. You can breakdown almost any vanilla equipment, including arrows, into the items category material type, (ie Leather, Iron, Steel, etc). For Arrows I took their Vanilla value & divided that by their Ingot Type to get how many are needed to smelt back into a single Ingot. This will also effect the Dwarven \\\"junk\\\" recipes.\r\n\r\nCreated Spiked Gauntlets of each armor material type and cloth, and created an Unarmed Enchantment for each one. From 10, 25, 50, 75, 100 (ebony). They all use the Stormcloak Officer Gloves as a model with Fists of Steel Perk attribute on them.\r\n\r\nESP Description:\r\nCraft, Temper, Smelt v1.00\r\nForge & Templer all Vanilla Equipment.\r\nCreate Replicas of Artifacts & Uniques.\r\nSmelting Recipes for Equipment.\r\nSharpen Weapons at no Material Cost.\r\nHides Smelt Recipes until they can use it.\r\nNew Gear & Fixes to only crafted ones.\r\n\r\nChange Log\r\nv1.00:  Additions since Forge Equipment v1.05: Fur \\\"Bandit\\\" Armor set can be crafted.\r\n          Soul gem fragments can be smelted into Empty Black Soul gems.\r\n          Salvage Deer Pelts.\r\n          New Compound Bow, based off the Imperial Bow model.\r\n          Craft, Temper, Salvage DB Replica set, with condition to acquire recipe.\r\n          Craft, Salvage Psiijic robes set.\r\n          Corrected Blade of Woe Replica Recipe requirements to include a few other conditions.\r\n          Blade of Woe Replica material type now Ebony.\r\n          Corrected Stats of Replicas to match closest counterpart based off material and item type.\r\n          Completed Armored Circlets for each material type.\r\n          Sharpening wheel requires no materials to \\\"sharpen\\\" improve weapon.\r\n\r\nv1.01:  Temper, Smelt Drain ghost Weapons, Battleaxe, Sword, Bow.\r\n          CTS (Craft Temper Smelt)Drain Weapon Replicas, which require Ancient Nord Weapon + Ectoplasm, Material type is Draugr and they Ignore Normal Weapon Resistance.\r\n          Ebony Blade Replica renamed to Maphaldas\\' Blade and weapon reach of 1.4\r\n          CTS Straight, Recurve, and Compound Bows, restored vanilla Hunting and Long bows.\r\n          CTS Kahvozein\\'s Fang Replica, stats equal to Dragon Priest Dagger.\r\n          CTS Blades armor Replicas, stats equal to Steel Plate, restored vanilla Blades armor.\r\n          Amulet of Immunity adjusted weight to 0.2 units.\r\n\r\nv1.02:  Implementing a new idea. Instead of allowing enchantments to be pulled from Artifacts and Uniques, I\\'m trying an idea that one must smelt the Artifact or Unique in to a magic ingot, from which one can then use that ingot to create a new weapon with that enchantment. This will prevent learning the enchantment and being able to use it over and over on anything. For now I have tested it on Mehrunes Razor. Where it can be smelted down to Mehrunes Ingot, then at the Skyforge, using a Daedric Bow and the ingot one can craft a Mehrunes Bow with the enchantement of the dagger. I plan to do this for all Daedric artifacts first, and some key Uniques too. Look for more this week.\r\n          Temper Nightingale Blade 05 recipe fixed.\r\n\r\n          Testing: requiring related Smithing perk to Temper equipment. Applied only to Razor at the moment. But as it is now, one can improve an item even with no knowledge of how to work with that material type, but being able to double improve it once one does. I\\'m planing on making all Daedric Temper recipes require the Daedric smiting perk just to improve it at all. If it goes well I plan on extending that to all Temper recipes.\r\n\r\nCraft mod v1.03:\r\n  WIP Artifacts & Uniques smelt to named ingot, craft same class gear + 0 @ Skyforge\r\n  Mehrunes Bow MagicDisallowEnchanting\r\n  CT Mehrunes Daedric Weapons Set\r\n  CT Chillrend Glass Weapons Set\r\n  Artifacts & Uniques Temper Recipes require Smithing Perk in Material Type\r\n  Temper equipment requires Material Type Perk:\r\n    Blades, Companions, Daedric, Dragon, Dwarven, Ebony, Elven, Glass, Imperal, Orcish, Dragon Masks, Scaled, Steel, Steel Plate, Daedric\r\n  Uniques & Artifacts\r\n    Ebony Mail, Clavicus Vile Masque, Yngol Barrow Helm, Kahvozein Fang, Akaviri/Blades Katana, Wuuthrad, Chillrend, Blade of Sacrifice, Volendrung, Mehrunes Razor, Ebony Blade, Dawnbreaker, MolagBal Mace, Blade of Woe, Dragon Priest Dagger, Firiniels End Bow, Keening, Nightingale, Oath Blade, Gaulder Blade, Pale Blade, Bloodthorn, Scimitar, Red Eagle Baine, Valdr Lucky Dagger, Spellbreaker, \r\nSmelt Nightingale Blade to ingot\r\nCT Nightingale Ebony Weapons\r\nBlade of Woe Replica require Ebony Perk\r\nBlades gear Replica require Steel Perk\r\nChillrend Replica craft if original is in inventory\r\nEbony Blade Replica craft if original in inventory\r\nSpellbraker Replica craft Dwarven Perk and Ingots\r\nFixed Unblessed Amulets not Enchantable\r\nFixed other Craftable Amulets not Enchantable\r\nBlade of Woe replica recipe fix\r\nUnblessed Amulets recipes requires Advanced Armor & visually close material types\r\nRename Blades replicas to Akaviri\r\n\r\nv1.04:\r\nTemper Shield of Solitude\r\nC.T. Dragon Mask Replicas\r\nSalvage all Clutter into Charcoal or Ingot\r\nRemoved Steel Imperial Gauntlets recipe from Steel category\r\nLeather Strips recipe will always show in Tanning Rack\r\nReturned Blunt and Bow weapon recipes to require temper materials\r\nCraft Arrows of each Metal type\r\n\r\n\r\nAs always feed back welcome.\r\nFor more details, comments, and more screens click on the original mod links.",
  "categoryId": "28",
  "version": "1.04",
  "author": "E2B2",
  "createdUnix": "1344794483",
  "updatedUnix": "1351894593",
  "containsAdultContent": false,
  "uploadedBy": "epbreen",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86255",
      "name": "Version 103",
      "version": "1.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24",
      "fileName": "Main File 103-22290-1-03.7z",
      "uploadedUnix": "1346698104",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/870f77e3ed2ce6608fe2f5f9b162b7395e4381d5954e76d1b16f1b3f9164b75c/analysis/1407143715/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File%20103-22290-1-03.7z?fid=86255&ttl=1535791740&ri=8192&rs=8192&setec=9873fad1b4b4ea0c92cc84dda648dd90"
    },
    {
      "fileId": "97187",
      "name": "Main File v104",
      "version": "1.04",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26",
      "fileName": "Main File v104-22290-1-04.7z",
      "uploadedUnix": "1351894593",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/9b720d23c038e2d70fca66a8d9b832d473736135da9d677405566ab16ef2f9de/analysis/1407246665/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File%20v104-22290-1-04.7z?fid=97187&ttl=1535791740&ri=8192&rs=8192&setec=6b5d6bfc7ac128fba1735f5ef98e3402"
    }
  ]
}