{
  "modId": 22291.0,
  "modName": "Craftable Vampire Items",
  "summary": "Craftable Vampire Items",
  "descriptionHtml": "Craftable Vampire Items\r\n\r\nAll The Vampire Armor Is Now Craftable At The Skyforge Under The Leather Section.\r\nFor The Lord Harkon Armor I Made An Unenchanted Version.\r\nU Can Not Craft The Enchanted Version Because Then It Would Not Be Special Anymore.\r\nU Will Need 1 Vampire Dust, 4 Leather Strips & 2 Leather To Make The Armors.\r\nFor The Boots And Gauntlets U Will Need 1 Leather And 1 Vampire Dust.\r\n\r\nU Can Obtain The Enchanted Version In These Ways:\r\n\r\nIt Can Be Found On A Shelf Next To A Coffin In Castle Volkihar Ruins During The Quest Chasing Echoes. \r\nIt Can Also Be Obtained From Harkon\\'s Remains After He Is Killed During The Quest Kindred Judgement. \r\n\r\nNo Perks Are Needed To Make Them.\r\nFor Upgrading U Nolonger Need The Arcane Blacksmith Perk Because They Dont Have Enchantments On Them.\r\nOnly For The Enchanted Harkon Armor U Will Need That Perk Now.\r\nU Will Need 1 Leather To Upgrade The Items.\r\n\r\nAll The Vampire Clothes Are Also Craftable Now.\r\nThe Robes, Gloves, Boots & Hood Can Be Made At A Tanning Rack.\r\nThey Can Be Found Under The Misc Section.\r\nU Will Need 1 Linen Wrap And 1 Vampire Dust To Make These Items.\r\n\r\nI Also Made An Unenchanted Version Of Lord Harkon\\'s Sword Called \\\"Vampire Sword\\\".\r\nIt Can Be Made At The Skyforge Under The Steel Section With 5 Steel Ingots And 1 Vampire Dust.\r\nU Will Need The Steel Smithing Perk To Make It.\r\nIt Can Be Upgraded At A Grindstone With 1 Steel Ingot.\r\n\r\nYou Need The Dawnguard DLC For This Mod To Work.\r\n\r\nHow To Install: Put The File In The Skyrim Data Folder. ",
  "categoryId": "36",
  "version": "V1.0",
  "author": "JP0005",
  "createdUnix": "1344795982",
  "updatedUnix": "1344796075",
  "containsAdultContent": false,
  "uploadedBy": "JP0005",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81080",
      "name": "Craftable Vampire Items",
      "version": "V1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4464",
      "fileName": "Craftable Vampire Items-22291-V1-0.rar",
      "uploadedUnix": "1344796075",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1b3a69e871ab1b526d2da3514156718941e3ec657cc96284b565b7068421ab2c/analysis/1407091812/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20Vampire%20Items-22291-V1-0.rar?fid=81080&ttl=1535791741&ri=8192&rs=8192&setec=741c206c15a554bb3d21d2a57255047c"
    }
  ]
}