{
  "modId": 22301.0,
  "modName": "Castle Volkihar Refurbished",
  "summary": "This mod aims to spruce up all sections of Castle Volkihar, it\\'s intended to be an ongoing project. Not recommended if you haven\\'t completed Dawnguard yet. Also, please do not forget to endorse this mod and vote for me if you like it.",
  "descriptionHtml": "IMPORTANT UPDATE! THE MOD IS NO LONGER IN PROGRESS, PLEASE CONTINUE READING FOR MORE INFO!\r\n\r\nOk guys, so once again I have encountered the CTD issue when trying to use the Soul Cairn Portal while having the mod active, and this time I know for a fact I didn\\'t do anything wrong. I think it\\'s nothing more than me having plans far too ambitious for a pre-made area of the game, rather than making my own zone and doing the things I want to do there.\r\n\r\nSo, what does this mean? Well, it means I\\'ve gonna rip the Chapel I spent 12 hours making out of this mod and start an entirely new mod where I can stick my rather awesome chapel instead.\r\n\r\nThe idea I have is for a castle and/or dungeon with voice acted NPCs and quests etc. As I said, it\\'s quite ambitious, but it is something I really want to do, so expect more to come.\r\n\r\nLike my Serana Fixed mod, this is for players who have completed Dawnguard, and want to add some class to Castle Volkihar. The \\\"story\\\" behind it is that, while Lord Harkon and his followers revelled in their carnal pleasures and made a show of feasting upon the living, Lady Valerica is a far more dignified vampire, and refuses to live in squalor. With Harkon and his brood wiped out, Valerica has raised an army of undead servants to clean and spruce up the castle. As time goes on, it may even slowly get rebuilt back to its former glory.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nUpdate 0.5a is available!\r\n\r\nI\\'ve spent the last 12 hours or so rebuilding the chapel in Valerica\\'s dunegon. Yes, that is a shrine to mara, no I did not add the statue myself, it was already there. Let me know if you like what I\\'ve done, and if you\\'d like to receive updates as I make big changes like this one to each section, or only as I complete each section?\r\n\r\nKeep in mind that the more releases i make, the more backup copies i have, and the more you guys can beta test this as I build it.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nUpdate 0.4 is available!\r\n\r\nThe exterior of the castle has now been cleared of all clutter, so now it all looks a lot nicer.\r\n\r\nNow it\\'s out of Alpha, I am going to start working on making the furniture in each section is aligned correctly and so on. As mentioned before, please be patient and keep in mind that it\\'s a slow and painstaking process (It\\'s not like clearing clutter, which is little more than selecting and deleting items).\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nUpdate 0.3 is available!\r\n\r\nAll sections (except for the exterior) have no been cleared of all clutter, and it is now also possible to get to the courtyard without having to go through the Undercroft or Valerica\\'s dungeon.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nUpdate 0.2 is available!\r\n\r\nIt\\'s still in alpha, but the CTD issue has been resolved (huge shout-out to ThirteenOranges on Steam for the help, go get his mods cos they\\'re amazing), feel free to explore the now clutter-free Dungeon 2. Just, uh, mind your step, cos it\\'s a long way down ;)\r\n\r\nOnce I have cleared all the other sections and the outside areas of the castle of all clutter, I shall work on sorting out all the floating furniture and so on. But when I get onto that, please be patient and keep in mind that it\\'s a slow and painstaking process (It\\'s not like clearing clutter, which is little more than selecting and deleting items).\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nVersion 0.1 is available!\r\n\r\nThis version can be considered an alpha of sorts, as their is serious bug that I do not have the knowledge to fix, which is why I am uploading it in the hopes that the more experienced modders out there can help me.\r\n\r\nRight now I have only cleared out Dungeon 2, which contains Valerica\\\\\\'s Lab and the portal to the Soul Cairn. However, despite being careful and making sure I deleted nothing that links to the portal, for some reason the game now crashes when I try to enter the Soul Cairn. If any fellow modders out there could take a look at this mod and help me fix the problem, I would be hugely appreciative, and will of course give credit for the help.\r\n\r\nAll rubble, bone piles, bones, blood stains, cobwebs, general clutter and enemies have been removed from the dungeon. This means that, without the rubble, there will be stairs and hallways that lead to nowhere and floating bits of furniture etc. Please bear with me as I attempt to fix the Soul Cairn portal problem before fixing any of that stuff, I want this mod to be fully functional before moving onto the other areas.",
  "categoryId": "68",
  "version": "0.0",
  "author": "Doozerpindan",
  "createdUnix": "1344803462",
  "updatedUnix": "1344803462",
  "containsAdultContent": false,
  "uploadedBy": "Doozerpindan",
  "primaryFile": null,
  "files": []
}