{
  "modId": 22327.0,
  "modName": "SkyRealism - Feast and Famine",
  "summary": "Realistic Thirst, Hunger, and Sleep Requirements for Skyrim.",
  "descriptionHtml": "[img=center]http://static-1.nexusmods.com/15/mods/110/images/22327-1-1363660339.png[/img]\r<br />[center][i]Realistic Thirst, Hunger, and Sleep Requirements for Skyrim.[/i][/center][center][color=black][i]by MTichenor[/i][/color][/center]\r<br />\r<br />[color=yellow][b]NOTICE: [/b][/color]If you find any bugs, please report them&#33; I can&#39;t fix them if I don&#39;t know about them. Also, send me a PM to contact me quicker if you have problems.\r<br />\r<br />[heading]Overview[/heading]Have you ever wondered how the Dragonborn can go forever without having to eat, drink, or sleep?\r<br />\r<br />I do.\r<br />\r<br />This mod makes basic needs such as food, water, and sleep a requirement, all based on in-game time passed. This mod is intended to be used in conjunction with the other [color=#87CEEB]Sky[/color][color=#C3B091]Realism[/color] mods that I will be releasing. \r<br />\r<br />[color=#FFFFFF][b]NEW RECIPES: [/b][/color]Several new foods and over a dozen recipes, including brewing and baking recipes have been added, in addition to those provided by [url=http://skyrim.nexusmods.com/mods/5816]Babette&#39;s Feast[/url]. Nearly all foods found in Skyrim now have recipes that allow you to make them yourself. If it&#39;s impossible to find good sweetrolls in that skeever-hole of a city you live in, make them yourself&#33;\r<br />\r<br />[color=#FFFFFF][b]CULINARY COMPLEXITY: [/b][/color]Many recipes have been drastically changed to reflect the proportions and the ingredients that they require in real life. You&#39;ll need to make yeast, dough, and other complex ingredients in order to bake breads and pies. Some of the benefits of various alchemical ingredients will be reflected in the foods they are used to make, such as Snowberry Pie.\r<br />\r<br />[color=#FFFFFF][b]NUTRITIONAL NEEDS: [/b][/color]All foods have had buffs added that benefit the character archtypes that would need that kind of nutrition, or prefer such fare. Warriors will need huge numbers of calories, and gain benefits from protein rich and hearty foods. Mages benefit from fine cuisine flavored with exotic spices. Thieves will prefer filling food with rich flavors, sufficient to sustain them on all-night heists.\r<br />\r<br />[color=#FFFFFF][b]DEHYDRATION: [/b][/color]Lack of water will reduce your mage skills, magicka regeneration rate, and speed. You lose 1800ml to 4000ml of water per day, and can hold up to 1800ml of  water (use your imagination to figure out what happens to the excess). You regain 900 ml of water for a typical drink. For every 3600 ml of water lost, your dehydration level will increase. At a 18,000ml water deficit (40 lbs.), you die. Water has been added to the innkeeper drink list, but it is random as to whether or not they will stock it.\r<br />\r<br />[color=#FFFFFF][b]STARVATION: [/b][/color]Lack of food will reduce your warrior skills, health and stamina regeneration rates, and speed. You regain 100 to 2000 calories per meal, and can hold up to 2000 calories of food (use your imagination to figure out what happens to the excess). You will use anywhere from 1800 to 7000  (or more) calories per day depending on warrior skills. For every 20,000 calories lost, your starvation level will increase. At a 100,000 calorie deficit (30-50 lbs.), you die. \r<br />\r<br />[color=#FFFFFF][b]INTOXICATION: [/b][/color]At 0.02% to 0.08% blood alcohol level, intoxication will increase your speech, but reduce your other thief skills. At higher than 0.08% blood alcohol level, intoxication will decrease all thief skills, speed, and possibly give you a chance to stumble while running or sprinting. You will gain anywhere from 0.02% to 0.18% blood alcohol level depending upon your bodyweight (determined by warrior skills) and the alcohol content of the beverage. You will lose 0.06% blood alcohol level per hour. At 0.02%, 0.08%, 0.14%, 0.20%, and 0.26% your intoxication levels will increase. You can reach 0.40% blood alcohol level before dying. Be careful when drinking, and take a breather after each drink&#33; Shotgunning drink after drink is the surest path to alcohol poisoning.\r<br />\r<br />[color=#FFFFFF][b]SLEEP DEPRIVATION: [/b][/color]Lack of rest will reduce your magicka, health, and stamina regeneration rates as well as your speed. You recover 16 hours of rest per 8 hours of sleep. On a full nights rest you can stay awake up to 16 hours you will become tired again. For every 24 hours that pass, your sleep deprivation level (Exhaustion) will increase. You can go up to 5 days without rest before dying.\r<br />\r<br />[color=#FFFFFF][b]VAMIPRISM: [/b][/color]Vampires do not need to eat, drink, or sleep since they are undead. Vampires are unaffected by alcohol, except as a means of looking more sophisticated while holding a fine goblet (Actually, they just look very snooty).\r<br />\r<br />[color=#FFFFFF][b]LYCANTHROPY: [/b][/color]Werewolves will become hungry after transformations (-4,000 calories). Feeding on people can counteract this (+2,000 calories). If you can&#39;t kill at least a dozen people after becoming a werewolf, you&#39;re not a very good werewolf. Maybe you should become a bard instead. You might even learn how to howl on key.\r<br />\r<br />[color=#FFFFFF][b]CANNIBALISM: [/b][/color]Followers of Namira will gain nourishment (+2,000 calories) through their grisly ghoulish practices, just as their furry friends do.\r<br />Table for Donner&#33; Party of 87&#33;\r<br />\r<br />You will receive messages in the upper-right corner of your screen notifying you when your insomnia, dehydration, starvation, or intoxication levels increase. You can view the effects that they have on you in your active spell effects list. \r<br />\r<br />[color=yellow][b]NOTICE: [/b][/color]Remember to wait a few moments after you&#39;ve eaten or drunk anything to digest it before you check if you&#39;re still hungry, and give yourself a few moments after you wake up before checking if you&#39;re still tired. \r<br />\r<br />I highly recommend that you use a TimeScale mod, such as [url=http://skyrim.nexusmods.com/mods/21552]Time and Travel[/url], unless you want the Dragonborn to have to eat and drink every fifteen minutes real-time and sleep every hour real-time. If you don&#39;t want to adjust the in-game TimeScale and find that it&#39;s too difficult to keep up with basic needs, you can change this in the SkyUI MCM SkyRealism - F&F Settings.\r<br />\r<br />[heading]Requirements, Installation, and Load Order[/heading][color=red][b]WARNING: [/b][/color]Skyrim will CRASH or behave strangely if you do not install the required mods correctly, or set the load order as specified. \r<br />\r<br />[b]REQUIREMENTS: [/b]This mod requires the following other to mods be installed.\r<br />[list][*][url=http://skse.silverlock.org]Skyrim Script Extender (SKSE)[/url][color=#888888] by [b]Ian Patterson, Stephen Abel and Paul Connelly[/b][/color]\r<br />[*][url=http://skyrim.nexusmods.com/mods/3863]SkyUI[/url][color=#888888] by [b]snakster, Mardoxx, and T3T[/b][/color][/list]\r<br />\r<br />[b]INSTALLATION: [/b]If you are upgrading from a previous version of SkyRealism - Feast and Famine, you will need to uninstall previous versions if you have them installed. To do this:\r<br />\r<br />[list=1][*]Load your current game (with the previous version still installed).\r<br />[*]Make sure you have no persistent status effects such as Dehydration, Starvation, or Insomnia. \r<br />[*]Save your game when you no longer have any status effects. \r<br />[*]Uninstall Feast and Famine.\r<br />[*]Start Skyrim again, make a fresh save, then close Skyrim. \r<br />[*]Install the new version of Feast and Famine.[/list]\r<br />\r<br />[b]COMPATIBILITY PATCHES: [/b]If you want to make your own compatibility patch, see the instructions below. Compatibility patches have been made for the following mods.\r<br />[list][*][url=http://www.elderscrolls.com/skyrim/add-ons]Dawnguard[/url][color=#888888] by [b]Bethesda Game Studios[/b][/color] (Dawnguard Edition)\r<br />[*][url=http://www.elderscrolls.com/skyrim/add-ons]Hearthfire[/url][color=#888888] by [b]Bethesda Game Studios[/b][/color]\r<br />[*][url=http://skyrim.nexusmods.com/mods/5816]Babette&#39;s Feast – Improved Cooking[/url][color=#888888] by [b]Merilia[/b][/color] v1.1 (Balanced version).\r<br />[*][url=http://skyrim.nexusmods.com/mods/1409]Cooking Expanded[/url][color=#888888] by [b]Cordsnwires[/b][/color] v1.1\r<br />[*][url=http://skyrim.nexusmods.com/mods/13608]Expanded Towns and Villages[/url][color=#888888] by [b]Missjennabee[/b][/color] v3.9. The compatibility patch can be found on their webpage, courtesy of Nonoodles.[/list] \r<br />\r<br />[b]LOAD ORDER: [/b]If you don&#39;t know what load order is, watch [url=http://www.youtube.com/watch?v=t6MxLBcSgkc]this video[/url] by Gopher. Your load order should look like the one below.\r<br />[list][*][color=#888888]...esm files and other esp files...[/color]\r<br />[*]Hearthfires.esm [color=#888888](Optional)[/color]\r<br />[*]BabettesFeastBalanced.esp [color=#888888](Optional)[/color]\r<br />[*]CookingExpanded.esp [color=#888888](Optional)[/color]\r<br />[*]SkyRealism – Feast and Famine.esp \r<br />[*]SkyRealism – Feast and Famine - Hearthfires.esp [color=#888888](Optional)[/color]\r<br />[*]SkyRealism – Feast and Famine - BabettesFeastBalanced.esp [color=#888888](Optional)[/color]\r<br />[*]SkyRealism - Feast and Famine - CookingExpanded.esp [color=#888888](Optional)[/color]\r<br />[*][color=#888888]...any other esp files...[/color][/list]\r<br />[heading]Creating a Compatibility Patch[/heading]First, you need to get [url=http://skyrim.nexusmods.com/mods/1840]Wrye Bash[/url] for Skyrim. Second, you need to get the Creation Kit through Steam. You can find it listed under Tools. Once you have both installed, follow these instructions:\r<br />\r<br />[list=1][*]Open Wrye Bash. \r<br />[*]Click the Mods tab.\r<br />[*]Right-click the bar just under the tab and click File &gt; New Mod\r<br />[*]Name the file in the right hand side of the window and click Save near the bottom of it. You can add a description as well if you want.\r<br />[*]Click the mod in the load order list. Move it down, since it usually starts near the top. The first time you move it, the load order system will usually position it somewhere else, and you&#39;ll have to find it again.\r<br />[*]Right click the mod once you find it again and click Add Master.\r<br />[*]Find the mod you want to create the compatibility patch for in your Skyrim Data folder. Double-click it.\r<br />[*]Repeat the Add Master step, but select &#34;SkyRealism - Feast and Famine.esp&#34; instead.\r<br />[*]Right click the mod one last time and click esmify masters.\r<br />[*]Now you can close Wrye Bash and open up Creation Kit.\r<br />[*]In the Object Window, find the Items section. Expand it.\r<br />[*]Click the Potions section. Food can be found in this.\r<br />[*]Search for the new items that were added by the mod you&#39;re creating the compatibility patch for.\r<br />[*]Double click them when you find them. This brings up their detailed info.\r<br />[*]Right click somewhere in their Results list (the big list in the right). Click New.\r<br />[*]In the dropdown menu for the new effect find either &#34;SkyRealismFoodEffect&#34; or &#34;SkyRealismWaterEffect&#34;. The higher the number that follows it (01, 02, 03), the more calories or water the food contains. Click Okay to apply the magic effect to the &#34;potion&#34;.\r<br />[*]Save the changes to the &#34;potion&#34; by clicking Okay again.\r<br />[*]Repeat steps 13-17 for each new food added by the mod you&#39;re creating the compatibility patch for.\r<br />[*]Save your newly created compatibility patch.\r<br />[*]Go back to Wrye Bash.\r<br />[*]Right click your new mod and click espify masters.[/list]\r<br />\r<br />That&#39;s it&#33;\r<br />\r<br />[heading]Credits and Thanks[/heading]Thanks to Cordsnwires, Elys, Dogtown1, Dragten, Hothtrooper44, Ironman5000, Is this display name taken?, JaySuS, Nikinoodles, Nivea, MECR, Merilia, PrivateEye, theRoadstroker, T3nd0, and Tupii for giving me permission to use their mods as master file requirements for my own mods.\r<br />\r<br />Thanks to XxBirdoxX for making the Creative Commons 1.0 License royalty free sound that I used for stomach noises.\r<br />\r<br />Thanks to T3nd0, Cordsnwires, and jjc71 for the suggestions, guidance, and support. Thanks to trainwiz, wobbuvahi, and David Brasher for making the mods that kept me hooked on Skyrim long after it should have lost its appeal. \r<br />\r<br />A huge thanks to &#34;Imp of the Perverse&#34;, author of [url=http://skyrim.nexusmods.com/mods/10639]Imps More Complex Needs[/url] and ManSh00ter, author of [url=http://skyrim.nexusmods.com/mods/10843]Total Realism – Basic Needs[/url] for making the two mods that inspired me to create my own version. Both of them are highly recommended, and in many ways far better than this one.\r<br />\r<br />Thanks to Nonoodles for making the [url=http://skyrim.nexusmods.com/mods/13608]Expanded Towns and Villages[/url] compatibility patch&#33;\r<br />\r<br />This mod is dedicated in loving memory to all the citizens of Riverwood who lost their lives, eaten by werewolves and vampires, during the testing of this mod.\r<br />\r<br />[heading]Compatibility, Issues, and Troubleshooting[/heading]This mod will conflict with any other mod that changes food in any way (by making it impossible to gain nourishment from food or beverages). \r<br />\r<br />To verify that this mod is working correctly, simply open the SkyUI MCM, and check to make sure the SkyRealism - F&F settings are all activated. \r<br />\r<br />If you are still having problems, try entering the console and typing the following command:\r<br />\r<br />[code]Help &#34;SkyRealismFood&#34;[/code]\r<br />\r<br />This should give you a number, usually positive unless you&#39;re starving. Exit the console, wait bout 5 seconds, then re-enter the console and type the command again. The number should have decreased if Feast and Famine is working correctly.\r<br />\r<br />If it is still not working correctly, make sure you have installed SKSE and SkyUI correctly, uninstall Feast and Famine, load your save game, make a new save entry, then reinstall Feast and Famine.\r<br />\r<br />[color=red][b]WARNING:[/b][/color] Make copies of your save files before installing this mod&#33; Before uninstalling this mod, make sure that you have no persistent effects such as Dehydration, Intoxication, Insomnia, or Starvation (or PERMANENT STAT LOSS could result).\r<br />\r<br />If this happens, you have two possible solutions:\r<br />[list=1][*]Reinstall the mod, load a save game where it was active, eat/sleep/drink, then uninstall the mod.\r<br />[*]Use the [code]player.forceav speedmult 100[/code] and [code]player.forceav skillname ###[/code] console commands. Where [code]skillname[/code] is the name of each skill that is [color=red]red[/color] in your perks and skills panel, and [code]###[/code] is the current value of that skill +20/40/60/80/100 (depending on what degree of debuff you had).[/list]\r<br />[heading]Change Log[/heading][b]v2.7[/b]\r<br />Added SkyUI MCM support.\r<br />Added Boiled Creme Treat recipe to Hearthfires compatibility patch, at the oven.\r<br />\r<br />[b]v2.6:[/b]\r<br />Added ability to refill bottles without being submerged.\r<br />Fixed price of skooma.\r<br />Fixed pie recipes.\r<br />\r<br />[b]v2.5:[/b]\r<br />Fixed roughly 100 different bugs with various foods, recipes, etc.\r<br />\r<br />[b]v2.4:[/b]\r<br />Removed Babettes Feast from the mod requirements.\r<br />Added compatibility patch for Babette&#39;s Feast.\r<br />Added compatibility patch for Hearthfires.\r<br />\r<br />[b]v2.3:[/b]\r<br />Feast and Famine should correctly reactivate upon leaving jail areas now.\r<br />Hunger and Thirst are now less affected by skills and far more affected by stamina usage.\r<br />Noises have been added to alert the user to the fact that they are thirsty or hungry.\r<br />\r<br />[b]v2.2:[/b]\r<br />Finally fixed the bug causing starvation/insomnia/dehydration while serving jail sentences. The only jail known to not work correctly is The Chill in Winterhold.\r<br />\r<br />[b]v2.1[/b]\r<br />Fixed the following unique alcoholic beverages: Ale, AleWhiterunQuest, DA14Water, FavorSorexRum, Firebrand Wine, FreeformDragonBridgeMead, MQ10JuniperMead, MQ201Drink, MS14WineAltoA, RiftenSpecial01, RiftenSpecial02, RiftenSpecial03, TGTQ02BalmoraBlue, and WEDL03CyrodilicBrandy. Those with common bottle designs will now provide empty bottles that you can fill with water.\r<br />\r<br />[b]v2.0[/b]\r<br />Fixed a bug causing fatal starving while serving time in cidna mine.\r<br />Fixed a bug causing empty alto wine bottles to constantly jump in and out of a player&#39;s inventory.\r<br />\r<br />[b]v1.9[/b]\r<br />Killed a bug where vampires still had basic needs.\r<br />\r<br />[b]v1.8:[/b]\r<br />Fixed a bug causing catastrophic camera failure when riding while drunk.\r<br />Fixed problems regarding the basic rates at which you need to eat/drink/sleep, which were causing incorrect calculations while under the effects of dehydration/starvation/etc.\r<br />Drastically reduced the penalty to hunger from transformations, as it was causing nearly fatal levels of starvation during the first transformation.\r<br />\r<br />[b]v1.7:[/b]\r<br />Bottles of &#34;water&#34; can now be purified in order to be used with cooking recipes, so you don&#39;t need to by &#34;pure water&#34; from vendors. The various recipes for &#34;pure water&#34; will only show if you have bottles of &#34;water&#34;. \r<br />(Confession: The only reason you need to purify water is cause I&#39;m too lazy to make 9 copies of every recipe that uses water; it was easier to make 9 recipes that convert water to pure water than 63 new recipes.)\r<br />\r<br />[b]v1.6:[/b]\r<br />Most beverages will be replaced with Empty Bottles when used. Empty bottles will  be filled with water if used while swimming.\r<br />\r<br />[b]v1.5:[/b]\r<br />Fixed a bug that caused certain death upon waiting through prison sentences.\r<br />\r<br />[b]v1.4:[/b]\r<br />Attempted to obliterate the offending code from patches 1.1 and 1.2 that refused to die.\r<br />\r<br />[b]v1.3:[/b]\r<br />Included the correct &#34;SkyRealismFeastAndFamine.pex&#34; that wasn&#39;t included in v1.2. I blame Skooma.\r<br />\r<br />[b]v1.2:[/b]\r<br />Fixed the recipe for Ale, which I forgot to change while transitioning recipes from bulk brewing to micro brewing.\r<br />\r<br />[b]v1.1:[/b]\r<br />Feast and Famine now requires [url=http://skyrim.nexusmods.com/mods/5816]Babette&#39;s Feast[/url][color=#888888] by [b]Merilia[/b][/color]. \r<br />More water has been added to vendor lists. Milk has been added to vendor lists.\r<br />A dozen new recipes have been added, and it is now possible to craft nearly all foods you find in the game.\r<br />All foods have had weights, values, and spell effects completely redone.\r<br />Modified script to incorporate warrior skills to determine sweating calculations....less active people need to drink less, more active people must drink more.\r<br />Added script to allow cannibalism to provide 2000 calories. Nom nom nom. &gt;:3\r<br />Raw food now inflicts food poisoning, which will reduce skills and make you feel green around the gills.\r<br />Additional warnings have been added to notify you when you are approaching your first dehydration/starvation/insomnia level.\r<br />\r<br />[b]v1.0:[/b]\r<br />Added Water to the default innkeeper beverage list. This should not interfere with any economics or vendor lists mods. If it does, it will be insignificant.\r<br />You cannot drink water from streams, pools, lakes and oceans. This is due to the possibility of bacterial infection...or possibly extreme laziness on my part.\r<br />Modified script to incorporate warrior skills to determine  body mass for blood alcohol calculations. \r<br />Modified script to incorporate warrior skills to determine caloric output calculations.\r<br />Modified script so that having AbVampire01-04 spells, or being of the DLC1VampireBeastRace will stop all food, water, sleep, and alcohol calculations. Blood is not a requirement (yet), as the &#34;Bite&#34; attack is still buggy for many people. Relying on a bite attack to sustain unlife when you can&#39;t bite seems silly, yes? Would mean lots of dead vampires.\r<br />Losing undead status will result in you becoming tired, hungry, and thirsty as your body regains life.\r<br />Added script to WerewolfChangeEffect so that werewolf transformations burn 25000 calories, making you very hungry. Nom nom nom. &gt;:3\r<br />Added script to werewolf FeedRestoreHealth so that eating people will give you 2000 calories (a large meal). Mmmm....braaaiiinnnzzzz.\r<br />Many foods have had their benefits tweaked, and many foods contain small amounts of water, especially soups and stews.\r<br />\r<br />[b]v0.1:[/b]\r<br />Added scripts to control dehydration, insomnia, intoxication, and starvation. Added spells to food which increase alcohol, food, and water levels.",
  "categoryId": "78",
  "version": "2.7",
  "author": "MTichenor",
  "createdUnix": "1344839588",
  "updatedUnix": "1358621776",
  "containsAdultContent": false,
  "uploadedBy": "IndigoNeko",
  "primaryFile": null,
  "files": [
    {
      "fileId": "109366",
      "name": "SkyRealism - Feast and Famine",
      "version": "2.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "267",
      "fileName": "SkyRealism - Feast and Famine-22327-2-6.7z",
      "uploadedUnix": "1357241222",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/27809b48cfe54f33c185bc08921f6c7d8d58dbce459429703cf830e1cad2c67e/analysis/1407335346/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20Feast%20and%20Famine-22327-2-6.7z?fid=109366&ttl=1535791808&ri=8192&rs=8192&setec=65425ee07ab3939d3ab64f16d1e8a6d2"
    },
    {
      "fileId": "109367",
      "name": "SkyRealism - Feast and Famine Dawnguard Edition",
      "version": "2.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "267",
      "fileName": "SkyRealism - Feast and Famine Dawnguard Edition-22327-2-6.7z",
      "uploadedUnix": "1357241257",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/2189e130643ac9c929d98b6dc2880b1c6627b68b7c0094880ed087bf12dd0c5d/analysis/1407335347/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20Feast%20and%20Famine%20Dawnguard%20Edition-22327-2-6.7z?fid=109367&ttl=1535791809&ri=8192&rs=8192&setec=760451c065f57aaa75cbd15421dc4aeb"
    },
    {
      "fileId": "1000001100",
      "name": "SkyRealism - Feast and Famine",
      "version": "2.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "276",
      "fileName": "SkyRealism - Feast and Famine-22327-2-7.7z",
      "uploadedUnix": "1357703054",
      "modVersion": "2.7",
      "virusScanUrl": "https://www.virustotal.com/file/b98edfd110ef22a800f63cf792a9b8980c005fedc99066d05f1ae851117491d0/analysis/1407344728/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20Feast%20and%20Famine-22327-2-7.7z?fid=1000001100&ttl=1535791809&ri=8192&rs=8192&setec=4f2d785fa85445b2a495bd938118bcdd"
    },
    {
      "fileId": "1000001101",
      "name": "SkyRealism - Feast and Famine Dawnguard Edition",
      "version": "2.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "276",
      "fileName": "SkyRealism - Feast and Famine Dawnguard Edition-22327-2-7.7z",
      "uploadedUnix": "1357703090",
      "modVersion": "2.7",
      "virusScanUrl": "https://www.virustotal.com/file/2a4a4f377b610c115ed5ba7456c9dba7240c01e214ddd4d8c521de4579ea6bae/analysis/1407344768/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20Feast%20and%20Famine%20Dawnguard%20Edition-22327-2-7.7z?fid=1000001101&ttl=1535791810&ri=8192&rs=8192&setec=2bce346bdc6676fa42b9a9f731277111"
    },
    {
      "fileId": "1000001214",
      "name": "SkyRealism - Feast and Famine - Grace Darklings Compatibility Patch",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "SkyRealism - Feast and Famine - Grace Darklings Compatibility Patch-22327-1-1.zip",
      "uploadedUnix": "1357756799",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1686e6ebc27972dc51ea1a162b27fa28b0314f83682abec81525663415793cf7/analysis/1407345464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20Feast%20and%20Famine%20-%20Grace%20Darklings%20Compatibility%20Patch-22327-1-1.zip?fid=1000001214&ttl=1535791810&ri=8192&rs=8192&setec=b5fe2eeabe28e3a9faa0778ee38d7dd0"
    },
    {
      "fileId": "1000003491",
      "name": "SkyRealism - Feast and Famine - Grace Darklings Compatibility Patch",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "12",
      "fileName": "SkyRealism - Feast and Famine - Grace Darklings Compatibility Patch-22327-1-2.zip",
      "uploadedUnix": "1358621776",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/1bf6b002da4cc84408a3b9c2630e49206fe481594ab364bf7d169e4a61213983/analysis/1407361588/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20Feast%20and%20Famine%20-%20Grace%20Darklings%20Compatibility%20Patch-22327-1-2.zip?fid=1000003491&ttl=1535791811&ri=8192&rs=8192&setec=eca38c2290c2ab0ca088ce2ee07e15ed"
    }
  ]
}