{
  "modId": 22331.0,
  "modName": "Thieves Guild HQ Overhaul",
  "summary": "This mod overhauls the Ragged Flagon Cistern, turning it into a truly impressive base for the guild, and the player.  ",
  "descriptionHtml": "[b][size=6]******Update********[/size][/b]\r\n\r\nI could really use some assistance. \r\nThe following are current major issues:\r\n\r\nBroken doors, particularly the secret exit ladders. \r\nFox attacks Maven (simple edit is to remove it completely, but I would like to add some creatures there to improve the atmosphere)\r\nDirty cell edits: (Tampering in TES5Edit did not help fix them, I don\\'t know how to clean it properly)\r\nDeleted Navmesh (I don\\'t know how to track down the deleted mesh or how to fix it)\r\n\r\nIf you know how to solve any of these please get in touch with me. Over the next several weeks I will be returning to this mod (new computer runs Skyrim like a dream).\r\n\r\n\r\n[b][size=4]What this is:[/size][/b]\r\nThis mod changes the Ragged Flagon Cistern into a better player base and a home for the Thieves Guild. I added several new areas, and changed all the existing. Essentially the Cistern has been tripled in size.\r\n\r\n[b][size=4]Why I made this/How this came to be:[/size][/b]\r\nI began playing Skyrim on the Xbox360, and still do because my computer has a hard time with the game. I have come to love the Thieves Guild, and enjoy Riften as my main home as a master of thieves. But I always felt the Cistern truly lacked as a player base, and sought out to change that. Initially I was only going to add storage to the vault, and leave it at that. But the mod took on a life of its own, and became what you see here now. \r\n\r\n[b][size=4]Features:[/size][/b]\r\n*********************************************************\r\n*New rooms\r\n*Vault has been changed drastically. 6 mannequins, 14 weapon plaques, 7 shield plaques and 9 chests, all safe player owned storage. \r\n*Training area has a second floor with an archery range and melee training area. \r\n*First floor of the training room has been turned into an armory\r\n*Forge room, complete with storage for smithing materials\r\n*New alchemy garden, complete with storage for ingredients, and a new secret exit into the lake.\r\n*New museum, with a number of models, statues and paintings\r\n*Pantry/cellar, respawning barrels of food and mead, perfect for a hunger mod. \r\n*Expanded kitchen, moved into its own room.\r\n*New storage room for loot the members bring back. Mostly random miscellaneous items. More to come in the future\r\n*Master suite with a library, 4 wardrobes and shelving space. Book space for over 300 books. \r\n*Private study for the player with enchanting and alchemy space/storage, upgraded armor, mannequins, more bookspace, a workstation and a fish pond. \r\n*Upgraded version of the Nightingale Armor, using a retexture courtesy of Adaadami. Upgraded version of the Guild master armor using daejones retexture will come in 1.6.\r\n\r\n[b][size=4] Requirements and included Mods:[/size][/b]\r\nObviously Skyrim. I am keeping this mod DLC free until a later date.\r\nI have used multiple new models and textures credited below. I also included two new armors with permission from their authors. \r\nDaejones Guild Master armor:\r\nhttp://skyrim.nexusmods.com/mods/2772/\r\n\r\nAdaadami\\'s Nightingale Armor:\r\nhttp://skyrim.nexusmods.com/mods/1689\r\n\r\nI also want to give some credit to MsChif, for his incredible Zenith Garden. When I first began making the study I was running out of ideas, but then I saw his mod and it provided me with a lot inspiration for my study. \r\nhttp://skyrim.nexusmods.com/mods/14749\r\n\r\n[b][size=6]Known Bugs:[/size][/b]\r\nFirst off, I highly recommend playing with a new character, or one that has not yet been to the Cistern. This is due to some issues with currently existing saves retaining information that my mod deletes or moves, which results in duplicates, missing items, floating items, or things just out of place. Most notably you will see floating embers, a double of the Nocturnal statue and some baskets sitting on top of things. \r\nAs of right now I do not know of any other bugs. Please let me know if you find any. \r\n\r\nCurrent problems with 1.5:\r\nThe two ladder exits are broken. Thanks Aku Armoton for pointing this out to me. \r\nBugs won\\'t fly around. Easy fix. \r\nSome lighting issues in the trophy room still. I\\'ll fix that as well. \r\nMannequins are still wonky in the vault. I\\'m going to be addressing that soon. \r\n1.6 will be another day as I address some of these problems. Please keep up the comments, the more feedback I get the better I can address issues. \r\n\r\n[b][size=4]Things to come:[/size][/b]\r\nThis is still a work in progress, as I intend to add more features. Some things I am considering for the future, or will definitely be doing:\r\n\r\n* Overhaul The Ragged Flagon\r\n* After becoming Guild Master, every member becomes a follower\r\n* Reintroduce a ranking system. Services would open up as you progress\r\n* Beggars need to return as the eyes and ears\r\n* New larceny targets\r\n* AIPackages need to be updated to include some of the new features. This will be done for sure, I just need to learn how\r\n* Add city choices to Delvin and Vex\r\n* Overhaul the Nightingale Sanctuary\r\n* More recruits to the guild\r\n \r\nThis is something I wanted in the original mod, but due to my own current modding limitations, I was forced to keep it out. Vanilla Cistern upgrades as you progress through the Special Quests and the Questline, adding carpets, furniture and upgrading a few things. Due to the limitations of Skyrim, because of how saves work, I was forced to add everything in immediately. So as a new recruit the master suite is a luxurious penthouse, for the time being. When I learn how, I will make it so that everything is upgraded as you progress. \r\n\r\n[b][size=4]Suggestions and Thanks:[/size][/b]\r\nI am always open to suggestions or ideas.\r\nI would also encourage anyone who likes this mod to please endorse me, take pictures and upload them, and please please please let me know if you find any bugs. \r\nAlso, if you know how to do something from the \\\"Things to come\\\" section, especially in the scripting department, and would like to help out, let me know. \r\n\r\nMany people have complained that the factions in Skyrim lack heart. It is my great hope that with the help of the modding community and you the players, that we can turn the Thieves Guild into something truly magnificent. \r\n\r\nThank you to everyone for reading this and playing my mod. \r\n\r\nI will be checking comment rather often for feedback, but feel free to post in the official thread for this mod over at Bethsoft forums. \r\n\r\nhttp://forums.bethsoft.com/topic/1403549-relwipthieves-guild-hq-overhaul/",
  "categoryId": "25",
  "version": "1.5",
  "author": "TheMadTemplar",
  "createdUnix": "1344845756",
  "updatedUnix": "1344891862",
  "containsAdultContent": false,
  "uploadedBy": "TheMadTemplar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81239",
      "name": "Thieves Guild HQ Overhaul",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "34113",
      "fileName": "Thieves Guild HQ Overhaul-22331-1-5.rar",
      "uploadedUnix": "1344845906",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/55a93920e0a5df0e825629ac11fe5d89ae59d1491532511c4db13ec5e4d68638/analysis/1407093378/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thieves%20Guild%20HQ%20Overhaul-22331-1-5.rar?fid=81239&ttl=1535791815&ri=8192&rs=8192&setec=d246c6f63d6d72b95e9ff40c9afe7280"
    },
    {
      "fileId": "81379",
      "name": "Hotfix esp",
      "version": "",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "68",
      "fileName": "Hotfix esp-22331-.rar",
      "uploadedUnix": "1344891862",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0617c69511e8e0e51e865f8643cf539cb5788d9f2202b890588b5e635a5f694a/analysis/1407094563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hotfix%20esp-22331-.rar?fid=81379&ttl=1535791816&ri=8192&rs=8192&setec=f04c7b1103a5cbc839f2ee3e6c845794"
    }
  ]
}