{
  "modId": 22330.0,
  "modName": "Tundra Defense - Construct Your Own Outpost",
  "summary": "From the maker of Wasteland Defense&#33; Construct your outpost anywhere throughout the lands of Skyrim. Build a peaceful settlement or a deadly fort. Can your outpost withstand the weather, the enemy raiders, and the dragons?",
  "descriptionHtml": "Hello&#33; The classic Skyrim version of Tundra Defense is no longer being developed. [url=https://www.nexusmods.com/skyrimspecialedition/mods/14310/]Looking for the Skyrim Special Edition version of Tundra Defense?[/url]\r<br />\r<br />-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[img]http://i50.tinypic.com/okwi6e.png[/img]\r<br />\r<br />[center][b]File of the Month for September of 2012[/b][/center]\r<br />\r<br />[youtube]yT1QmHf2MEs[/youtube]      [youtube]fIc-fvDQucQ[/youtube]\r<br />[youtube]YzzSypT94DY[/youtube]\r<br />-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />If you experience any issues that you have narrowed down to this mod (the crash occurs with every other mod turned off), please give me feedback on what happened at the time of the crash.\r<br />\r<br />If you would like this mod via Steam Workshop, you can find it here.\r<br />\r<br />[img]http://i47.tinypic.com/122bxnd.png[/img]\r<br />Skyrim is a dangerous place these days. With the harsh weather, the civil war, and the coming of the dragons, the Dragonborn needs to have a place to call home and strategize. Construct your own outpost, build up its defenses, and prove your worth to the rest of the world by defending it from raiders and dragons.\r<br />\r<br />[img]http://i46.tinypic.com/34zc9w3.png[/img]\r<br />This mod [b]requires[/b] SKSE, which can be found [url=http://skse.silverlock.org/]here[/url] (http://skse.silverlock.org/).\r<br />--\r<br />Extract the zip file into your data folder (the path should be similar to C:&#92;Program Files&#92;Steam&#92;steamapps&#92;common&#92;skyrim&#92;Data)\r<br />It is suggested you use the Nexus Mod Manager to manage your mods. Enable the mod and load up your game. Within a few seconds a quest update should pop up and give you directions.\r<br />\r<br />[img]http://i50.tinypic.com/200ckdj.png[/img]\r<br />-Outpost Construction System: Acquire plans and use them to place objects within your fort. Objects can be placed in any manner you desire.\r<br />-Guard System: Recruit guards to patrol your fort, defending it from enemy invaders. Need to defend a secure location? Hire a stationary guard who will hold his ground until his dying breath. Want to protect a larger area? Purchase a few patrol guards and mark their route.\r<br />-Plan Market System: Allow a outpost merchant to set up shop and offer various plans for necessities/defenses. The market&#39;s stock changes day by day, and special plans may become available.\r<br />-Raid System: A remote activated system that can trigger a raid across three difficulties. Supplies are scavenged after fending off a raid, which can be used for future upgrades and defenses.\r<br />-Random Raid System: Raider attacks will be randomized, coming when you least expect it (toggle-able in user options)\r<br />-Scavenger System: Recruit scavengers to pick across the remnants of your enemies and salvage their equipment.\r<br />-Citizens: Let people move in to your outpost and receive a daily tax income from them.\r<br />\r<br />[img]http://i46.tinypic.com/6hki0o.jpg[/img]\r<br />This mod is very much a WIP still, so you may come across bugs or features that aren&#39;t fully implemented. However I ask that if you do find something of note, please leave a comment so I can look into your issue and hopefully solve it fast.\r<br />\r<br />I will be updating this fairly frequently, so keep an eye on this page for any news on new versions.\r<br />\r<br />[b]3.06 Changelog[/b]\r<br />-Includes ESP.\r<br />\r<br />[b]3.05 Changelog[/b]\r<br />-Updated farm plots. You now can plant seeds or burn the soil. Planting a seed will yield a plant after some time. Burning the soil will cancel any current plant growth. This manual form of farming is to prevent the crashes and lag that occurred due to automatic farming.\r<br />\r<br />To move to the new system, you will have to remove all current farm plots, open the console and type:\r<br />ReloadScript aaaFortFarmPlotScript\r<br />Then save/reload and you should be able to activate farm plots.\r<br />\r<br />[b]3.0 Changelog[/b]\r<br />-Added farm plots. Idle markers spawn on each plot automatically, and after a certain amount of time various plants/ingredients will spawn so that they can be harvested.\r<br />-Added Guard Equipment Box upgrade for the barracks. This will allow you to place a full set of equipment into the box that will be applied to all guards when they spawn.\r<br />\r<br />[b]2.95 Changelog[/b]\r<br />-Added ability to change the race of Stationary Guards.\r<br />\r<br />[b]2.92 Changelog[/b]\r<br />-Added ability to change the race of Patrol Guards.\r<br />\r<br />[b]2.9 Changelog[/b]\r<br />-Added the ability to change the race of Perimeter Guards.\r<br />-Fixed bug where changing guard types resulted in the guard count getting off.\r<br />\r<br />[b]2.85 Changelog[/b]\r<br />-Guards can be directed to follow the player at any time. Just speak with them and tell them to follow. Once finished, speak with them again to stop them and they will continue their job.\r<br />-Idle markers are now spawned according to the direction of the placement dummy.\r<br />-Stationary guards are now spawned according to the direction of the placement dummy.\r<br />-Updated raid ending code to optimize player raiding.\r<br />\r<br />[b]2.8 Changelog[/b]\r<br />-Added wooden platform (based on a brand new custom mesh by fdenota2).\r<br />-Lowered traveling merchant instance rates.\r<br />-Fixed auto-closing gates for NPCs.\r<br />-Stone Platform renamed to Stone Wall.\r<br />\r<br />[b]2.78 Changelog[/b]\r<br />-Added rough functionality for player to raid their own outpost. This feature has not been fully tested. To enable, change the setting via the Player Menu and start a raid. You will join the raiding party. Once all your guards have been killed, the raid will end and you will have to kill off the remaining raiders. Once again, this is an experimental feature that is completely optional.\r<br />\r<br />[b]2.75 Changelog[/b]\r<br />-Gates now auto-close.\r<br />-You can now lock gates by holding L while activating. They are unlocked the same way.\r<br />-Traveling merchant instances. Merchants will arrive in your outpost and sell their goods.\r<br />-Nerfed Trader Chest to make it more realistic.\r<br />-Added the ability to fire and rehire a new captain of the guard. This will cost you money to hire a new captain. Speak with the current captain to fire them.\r<br />-Updated guard packages.\r<br />-Changing guard types will now properly adjust the guard count.\r<br />\r<br />[b]2.7 Changelog[/b]\r<br />-Customize-able raid handicap that lets you give the enemy extra raiders.\r<br />-Change random raid frequency between three settings (high/medium/low frequency)\r<br />-Fixed bug with citizens traveling to the inn before you acquire it.\r<br />-Fixed bug where raid horn would play when the raid menu was canceled.\r<br />\r<br />[b]2.65 Changelog[/b]\r<br />-Added The Silver Bear random instance. Citizens can now be directed inside the inn, and they will move in and out of it as they please.\r<br />-Fixed bug where moving a boundary marker caused future plans to have to be placed outside of the boundaries (this was worked around by moving the boundary marker again, but now it should never happen)\r<br />-When advanced mode is enabled, there is no restriction on the positions of the boundaries now. They can be as close or as far away as you want.\r<br />-Tightened up patrol route minimum distances. Some people found that patrols stopped moving after a certain post. This was due to the fact that the posts were too close together, and they already assumed they arrived at their destination. This has been fixed.\r<br />-Scavenger NPCs are now sandbox actors. They do not actually pick anything up anymore, but the code will automatically collect items from dead guards/raiders as long as you have a scavenger. This is to fix the issue of scavengers stealing from essential NPCs.\r<br />-Fixed bug where canceling an object would not give you back a plan.\r<br />-Added Large Wooden Shelter plans.\r<br />-Miners now provide less gold for taxes, but their rate of finding ore is increased.\r<br />\r<br />[b]2.6 Changelog[/b]\r<br />-Place-able idle markers for your citizens to use (farming, lute playing, etc)\r<br />-Updated scavengers package in an attempt to fix looting friendlies.\r<br />-Captain of the Guard can now be accessed with armory upgrade.\r<br />-Fixed bug regarding perimeter guards and patrol guards not moving.\r<br />\r<br />[b]2.55 Changelog[/b]\r<br />-Added Vampire, Werewolf, and Falmer raids.\r<br />-Added wooden walls, dwarven walls, stone lookout tower, and stone platform (makes building on level ground easier)\r<br />-Fixed bug where dwarven building interiors are spawned when placement is canceled.\r<br />-Fixed bug where lights are spawned when placement is canceled.\r<br />-Fixed bug where breaking down a square table yields a round table plan.\r<br />-Fixed bug where Violet will give new blacksmith plans every time you arrive at the outpost.\r<br />-Fixed bug where weapon racks / plaques block pickup.\r<br />\r<br />[b]2.5 Changelog[/b]\r<br />-Updated stationary guard / fort guard script to fix conflict with stationary guard menus overriding general guard menus. There will no longer be an issue with multiple menus appearing on guards at once (this caused CTDs)\r<br />-Updated scavenger package to reduce idle conversation and removed interrupt flags in an attempt to fix the issue of scavengers stealing from companions.\r<br />-Updated guard package to reduce interruptions as well in an attempt to ensure that patrol routes are completed.\r<br />-Updated citizen sandbox package to force sandbox around the citizen&#39;s location instead of the Water Well. This will reduce congregation of citizens around the Water Well.\r<br />-Added the ability to send citizens into their homes. This removes the citizen from the world, but still grants you the tax bonus. They can be recalled from the home of which they spawned from.\r<br />-Fixed lighting issue in the Grand Estate.\r<br />\r<br />[b]2.45 Changelog[/b]\r<br />-Added Dwarven Arches (large and small)\r<br />-Added two Dwarven Buildings (shelters with open interiors. Once placed, give it about a few seconds and the interior will spawn.\r<br />-Added Dwarven Lanterns\r<br />-Added Mounted Torches\r<br />-Added Torture Rack\r<br />-Fixed bug with place-able lights that caused the light to not be removed upon breakdown if broken down within 5 seconds of placement.\r<br />\r<br />[b]2.4 Changelog[/b]\r<br />-Updated Wooden Cabin with a pre-placed fireplace, weapon racks, bookcases, weapon plaques, display cases, and mannequins. This is because you can not place these items, so they must be pre-placed. Everything else you can customize to your every whim.\r<br />-Added Grand Estate, a new customize-able home based on Hjerim. This one is also fully decked out with weapon racks, bookcases, display cases, weapon plaques, and mannequins. As usual, customize-able houses are special ordered from the Water Well.\r<br />-Updated campfire/candles/light sources to automatically place the light on initial load. Previously, the lights had to be toggled on via activation.\r<br />-Updated Violet&#39;s script to fix an issue regarding duplicate plans being awarded.\r<br />-Added three new light sources geared toward houses.\r<br />\r<br />[b]2.35 Changelog[/b]\r<br />-Customize-able house system. The only available house right now is the Wooden Cabin. You can special order it through the Water Well.\r<br />-Over 10 new plans geared toward the house system. These are sold by Sareio.\r<br />-Captain of the Guard instance will now randomly appear at the Water Well. You will get the chance to pick an applicant for the Guard Captain position. (the guard captain you choose is a unique character that can not be fired/traded later)\r<br />-Fixed exploit where you could revive guards by changing their type after they died.\r<br />-Keyboard placement controls. Toggle-able via the Settings menu. You can nudge the objects around with the keyboard so you can move around and verify the object will be placed correctly.\r<br />\r<br />\r<br />[b]2.3 Changelog[/b]\r<br />-All guard types can now be placed in Perimeter, Patrol, and Stationary modes. Just speak with a guard once purchased and you will have the option to convert that guard to a different mode. This allows for combinations such as Stationary Combat Mages and Stationary Dwarven Centurions, as well as patrolling Conjuration Mages and so on.\r<br />-Bug fix with trader crate not removing all items from inventory.\r<br />\r<br />[b]2.28 Changelog[/b]\r<br />Added navmesh cuts for each core building. NPCs should be able to detect that &#39;something&#39; is there and try to move around. This will only work for CORE buildings (Water Well, Player House, Store, Mine, Market, buildings that you only get one of, etc.) To ensure that the collision layer is applied, just walk up and activate each of your core objects. This should move the collision layer into place. You should see some form of improvement when AI path through the area. Obviously, this is brand new to me and not extensively tested.\r<br />Added mead barrel and chopping block.\r<br />Fixed bug with guards showing up on placement when they aren&#39;t supposed to.\r<br />\r<br />[b]2.25 Changelog[/b]\r<br />-Added trader chest to General Store. You can now place items in the chest and they will be automatically sold. You will receive payment for the items when you receive your daily taxes.\r<br />-Exported FaceGen textures for Hank/Violet.\r<br />-Fixed bug in breakdown script where the dialog it would appear if an NPC activated an item while player was sneaking.\r<br />\r<br />[b]2.23 Changelog[/b]\r<br />-All keys for this mod are now rebindable via a special item in your inventory.\r<br />-Raiders drop various plans.\r<br />-The mine now has an ore chest that will be populated at the end of the day with amounts based on the amount of miners you have.\r<br />\r<br />[b]2.1 Changelog[/b]\r<br />-Added Outpost Mine. This will allow you to hire miners for an additional source of income. You can also expand the mine to unlock Dwarven Guards. There are three types of Dwarven Guards: Spiders, Spheres, and Centurions.\r<br />-Updated scavenger package and script.\r<br />-Added werewolf head spikes.\r<br />-Random instances (raids/quests/etc) not as frequent.\r<br />\r<br />[b]v2.0 Changelog[/b]\r<br />-Tweaked faction allegiances\r<br />-Illusion Mages will now spawn\r<br />-Advanced Mode (allows you to build past your boundaries, anywhere in the world. That includes indoors and outside. However, raids will only ever occur at your home base. Toggleable from the settings)\r<br />-Fences/Walls are re-useable. Once placed, another instance of the object will appear and you can continue to place them until you cancel object placement.\r<br />-Patrol/Stationary guards are beefed up more.\r<br />\r<br />[b]v1.99 Changelog[/b]\r<br />-Stationary guard system rewritten once again. This time it is more efficient, reduces save game bloat, and finally gets rid of the &#39;dummy&#39; on place issue.\r<br />-Boundary posts movement fixed. You should be able to move them properly and not run into the issue where you can&#39;t move any other object inside your boundaries.\r<br />-Water Well quest instances will no longer reoccur. They will only trigger once now.\r<br />-Citizens now spawn at their house.\r<br />-You can now reset your guard/scavenger/citizen count to 0 from the management table in the Player House if you feel the number is incorrect.\r<br />\r<br />[b]v1.98 Changelog[/b]\r<br />-Updated stationary guard scripts (should fix the dummy issue after you reload the scripts properly. For a guide to reload the scripts, read the FAQs)\r<br />-Added new guard varieties (orcs, argonians, nords, imperials, etc)\r<br />-Added placement reset button (press = to reset distance/rotation)\r<br />-Added ability expand Market into the General Store. Activate the market once you have the General Store to purchase the upgrade.\r<br />\r<br />[b]v1.95 Changelog[/b]\r<br />-Added a General Store. This can be obtained via a Water Well instance. The store is run by Hank Anderson and it focuses on the basics while offering a quick way to sell resources.\r<br />\r<br />[b]v1.91 Changelog[/b]\r<br />-Guards scripts are now fixed. Should now be able to access inventory and maintain proper guard tally.\r<br />\r<br />[b]v1.9 Changelog[/b]\r<br />-The tamed dragon will now stay within 10000 units of your Water Well. If they try to fly too far due to combat, they will force themselves to turn around and return to the Water Well. Effective watch dogs.\r<br />-All inter-faction combat has been fixed. Mage Guards / Tamed Dragon / Dogmeat will no longer attack neutral parties.\r<br />-Scavenger system reworked so that they automatically pick up every single piece of loot, cleaning the body up after.\r<br />\r<br />[b]v1.85 Changelog[/b]\r<br />-Updated stationary guards with combat override package. Should stay closer to the stationary point now.\r<br />-Added Dragon Perch. You can now purchase a tamed dragon to assist you in raids.\r<br />-Added new Water Well instance - outpost dog.\r<br />\r<br />[b]v1.8 Changelog[/b]\r<br />-Fixed guard factions. Guards will now not attack horses/chickens/friendlies/prey on sight\r<br />-Added Anvil & Smelter to Blacksmith Equipment set (via Violet Hayes or Windhelm Blacksmith Quarters)\r<br />-Added Alchemy Lab & Arcane Enchanter plans (via Water Well message)\r<br />-Added Cooking Spit & Tanning Rack\r<br />\r<br />[b][u]FREQUENTLY ASKED QUESTIONS[/u][/b]\r<br />Q. My button presses aren&#39;t registering&#33; I hold the &#39; (apostrophe) menu down and no player menu shows up, or I can&#39;t finalize object placement. What&#39;s wrong?\r<br />A. The mod doesn&#39;t just decide to work for some people and not for others. If it doesn&#39;t work on yours, you have SKSE installed wrong, your not holding the button down long enough for it to register, or you have something else blocking the buttons from being registered. Having SkyUI doesn&#39;t mean that you have SKSE WITH SCRIPTS installed. Download SKSE from the site and unzip the ENTIRE contents directly into your Skyrim directory (next to TESV.exe)\r<br />\r<br />Q. My game has intense freezing, sometimes from 10-20 seconds. What&#39;s wrong?\r<br />A. This is related to another mod you have installed that has a script error. This is unrelated to Tundra Defense, but becomes apparent due to the fact that Tundra Defense access the script engine frequently. If you have a mod such as Warzones installed, this is generally the source of the bloat. Check your save game size and make sure it is no larger than 30 megabytes MAX.\r<br />\r<br />Q. My stationary guards are falling through objects&#33; What can I do?\r<br />A. In the later versions of the mod, a new system was set in place so that they reset after 30 seconds when not in combat. You can manually verify that they reset by speaking to the guard.\r<br />\r<br />Q. My NPCs are getting stuck on meshes. Why?\r<br />A. At the current time, it is impossible to dynamically generate a navmesh. So any player spawned content isn&#39;t actually seen by the AI in the game. Consider making clear paths between patrol points.\r<br />\r<br />Q. I can&#39;t place the water well, but I know the mod works for me (e.g. my other characters can all use it). What&#39;s wrong?\r<br />A. Reload a previous save or disable Tundra Defense, load the character in question and re-save. Then quit Skyrim and enable Tundra Defense and load up the previous save. You should be receive a new message and be able to place the water well.\r<br />\r<br />Q. When I open the player menu, it tells me there is a raid in progress, but I can&#39;t find any enemies. Can I fix this?\r<br />A. Go into the Outpost Office (old Player House) and activate the table. There is an option there to end the current raid.\r<br />\r<br />Q. After placing objects, I can no longer unsheathe my weapon/spells. What&#39;s going on?\r<br />A. Open the console and type enableplayercontrols. If this does not work, exiting Skyrim and re-opening should fix the issue.\r<br />\r<br />Q. How to I reset my outpost?\r<br />A. Go indoors somewhere (not in a building added by Tundra Defense), and save. Then close your game. Disable the mod, then reload your save. Wait inside for 4 days. Then save, close your game, and re-enable the mod. You should then have a clean slate to start again.\r<br />\r<br />Q. The mod is telling me that I need to install SKSE but it is already installed? What do I do?\r<br />A. You installed SKSE, but you didn&#39;t install SKSE [i]right[/i]. Unzip ALL contents of the SKSE archive into your main Skyrim directory, right next to TESV.exe. From now on, run the game via skse_loader.exe.",
  "categoryId": "24",
  "version": "3.06",
  "author": "Elderwind",
  "createdUnix": "1344843836",
  "updatedUnix": "1353082935",
  "containsAdultContent": false,
  "uploadedBy": "Elderwind",
  "primaryFile": null,
  "files": [
    {
      "fileId": "99838",
      "name": "Tundra Defense v3-06",
      "version": "3.06",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13297",
      "fileName": "Tundra Defense v3-06-22330-3-06.zip",
      "uploadedUnix": "1353082935",
      "modVersion": "3.06",
      "virusScanUrl": "https://www.virustotal.com/file/eca30c397ef5170ec6cc2aefe9934b0122b068c4d7b081f9b91b0fcef3c3ec28/analysis/1407265171/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tundra%20Defense%20v3-06-22330-3-06.zip?fid=99838&ttl=1535791814&ri=8192&rs=8192&setec=99091b13fb975e9de754ae85fdd4eaa1"
    }
  ]
}