{
  "modId": 22337.0,
  "modName": "Proudspire Manor- Inventors Spire and Suite",
  "summary": "V 2.1! The most expensive house in Skyrim is worth it again! Dawnguard compatible with all-new inventor\\'s spire and grand master bedroom suite upgrade! Complete overhaul of the vanilla house, with beautiful detailed enhancements, bug fixes, inconsistency removals, and exciting new additions to make your Skyrim experience more rich.",
  "descriptionHtml": "[center][url=http://kaminazo.files.wordpress.com/2012/08/pmis2head.png][img]http://kaminazo.files.wordpress.com/2012/08/sh1.png[/img][/url][/center]\r\n[center][b][color=white][url=http://kaminazo.wordpress.com]My Blog: kaminazo.wordpress.com [/url][/color][/b][/center]\r\n\r\n[center][b][color=red]New version 2.1 just uploaded in the files section! Major new addition! If you are upgrading from v2.0 or v1.2, then you don\\'t have to do anything special. Just enjoy and endorse! If you have v1.0 or have never used this mod, please read the version installation and news sections at the bottom BEFORE installing![/color][/b][/center]\r\n\r\n[center][color=white]Proudspire Manor is my favorite player house in the game. Why? Location, location, location! It\\'s near four of the best vendors in Skyrim, a good jumping point for quests, and has a gorgeous high overlook of the sea. But it\\'s also annoying as a player house for several reasons. This project was undertaken with the express purpose of making Proudspire Manor, the most expensive player house in Skyrim, worth the gold. This meant-first and foremost-fixing several glitches, problems and inconsistencies built into the interior and exterior cells. Second, it meant rearranging the space to accommodate the house\\'s worth in gold of equipment and amenities to the six different upgrade regions of the house. And third, adding some extra flavor to satiate my need to redesign this house to my own tastes, without sacrificing its already useful and lore-friendly elements or its overall usability as a player house on a wide range of systems. This mod has been tested and works with the Dawnguard upgrade.[/color][/center] \r\n\r\n[center][color=white][b]Feast Thine Eyes Upon the New Bedroom Suite![/b][/color]\r\n[color=skyblue][size=1]Click on image to view full rez.[/size][/color][/center]\r\n\r\n[center][url=http://kaminazo.files.wordpress.com/2012/08/pmiss1.jpg][img]http://kaminazo.files.wordpress.com/2012/08/s1.jpg[/img][/url] [url=http://kaminazo.files.wordpress.com/2012/08/pmiss2.jpg][img]http://kaminazo.files.wordpress.com/2012/08/s2.jpg[/img][/url] [url=http://kaminazo.files.wordpress.com/2012/08/pmiss3.jpg][img]http://kaminazo.files.wordpress.com/2012/08/s3.jpg[/img][/url][/center] \r\n[center][url=http://kaminazo.files.wordpress.com/2012/08/pmiss4.jpg][img]http://kaminazo.files.wordpress.com/2012/08/s4.jpg[/img][/url] [url=http://kaminazo.files.wordpress.com/2012/08/pmiss5.jpg][img]http://kaminazo.files.wordpress.com/2012/08/s5.jpg[/img][/url] [url=http://kaminazo.files.wordpress.com/2012/08/pmiss6.jpg][img]http://kaminazo.files.wordpress.com/2012/08/s6.jpg[/img][/url][/center] \r\n\r\n[center][color=white][b]Pics of the Spire and House Interior[/b][/color]\r\n[color=skyblue][size=1]Click on image to view full rez.[/size][/color][/center]\r\n\r\n[center][url=http://kaminazo.files.wordpress.com/2012/08/2012-08-12_00005.jpg][img]http://kaminazo.files.wordpress.com/2012/08/1.jpg[/img][/url] [url=http://kaminazo.files.wordpress.com/2012/08/2012-08-12_00007.jpg][img]http://kaminazo.files.wordpress.com/2012/08/2.jpg[/img][/url] [url=http://kaminazo.files.wordpress.com/2012/08/2012-08-12_00008.jpg][img]http://kaminazo.files.wordpress.com/2012/08/3.jpg[/img][/url][/center] \r\n[center][url=http://kaminazo.files.wordpress.com/2012/08/2012-08-12_00009.jpg][img]http://kaminazo.files.wordpress.com/2012/08/4.jpg[/img][/url] [url=http://kaminazo.files.wordpress.com/2012/08/2012-08-12_00010.jpg][img]http://kaminazo.files.wordpress.com/2012/08/5.jpg[/img][/url] [url=http://kaminazo.files.wordpress.com/2012/08/2012-08-12_00011.jpg][img]http://kaminazo.files.wordpress.com/2012/08/6.jpg[/img][/url][/center]\r\n[center][url=http://kaminazo.files.wordpress.com/2012/08/2012-08-12_00012.jpg][img]http://kaminazo.files.wordpress.com/2012/08/7.jpg[/img][/url] [url=http://kaminazo.files.wordpress.com/2012/08/2012-08-12_00014.jpg][img]http://kaminazo.files.wordpress.com/2012/08/8.jpg[/img][/url] [url=http://kaminazo.files.wordpress.com/2012/08/2012-08-12_00015.jpg][img]http://kaminazo.files.wordpress.com/2012/08/9.jpg[/img][/url][/center]\r\n[center][url=http://kaminazo.files.wordpress.com/2012/08/2012-08-12_00017.jpg][img]http://kaminazo.files.wordpress.com/2012/08/10.jpg[/img][/url] [url=http://kaminazo.files.wordpress.com/2012/08/2012-08-12_00019.jpg][img]http://kaminazo.files.wordpress.com/2012/08/11.jpg[/img][/url] [url=http://kaminazo.files.wordpress.com/2012/08/2012-08-12_00022.jpg][img]http://kaminazo.files.wordpress.com/2012/08/12.jpg[/img][/url][/center]\r\n[center][url=http://kaminazo.files.wordpress.com/2012/08/2012-08-12_00026.jpg][img]http://kaminazo.files.wordpress.com/2012/08/13.jpg[/img][/url] [url=http://kaminazo.files.wordpress.com/2012/08/pmis14.jpg][img]http://kaminazo.files.wordpress.com/2012/08/14.jpg[/img][/url] [url=http://kaminazo.files.wordpress.com/2012/08/2012-08-12_00032.jpg][img]http://kaminazo.files.wordpress.com/2012/08/15.jpg[/img][/url][/center]\r\n[center][url=http://kaminazo.files.wordpress.com/2012/08/2012-08-12_00037.jpg][img]http://kaminazo.files.wordpress.com/2012/08/16.jpg[/img][/url] [url=http://kaminazo.files.wordpress.com/2012/08/pmis17.jpg][img]http://kaminazo.files.wordpress.com/2012/08/17.jpg[/img][/url][/center]\r\n\r\n[center][color=skyblue][b]Problem #1 The rent is too damned high![/b][/color]\r\n\r\n[color=white]Proudspire Manor is the most expensive player house in the game and what you get for your money is...well...disappointing. All the houses are empty shells full of cobwebs and clutter after initially purchasing them. So then, you can consult a home decorating guide and buy upgrades from the local steward. Grouped by rooms, you can pay to upgrade the space, adding useful items and decorations in place of the clutter and mess left behind. But when it\\'s all said and done, you pay more than any other house for less stuff and a glitchy space. It\\'s just a bit unbalanced.[/color]\r\n\r\n[color=skyblue][b]Fix[/b][/color] \r\n\r\n[color=white]So rather than make the house cheaper (I actually made it  more expensive), I made it worth the cash to buy and upgrade this house. The patio (basicly useless as an upgrade) is now a basement expansion including a smithy, crafting area, mining corner, and extra storage. Yes, it also puts something on the porch, an axe and wood chopping block (which are indispensable for arrow-crafting mods). The living room upgrade now only applies to the third floor and new Inventor\\'s Spire! Includes all sorts of visuals goodies and useful stuff, and a great sniper point for sneaky archers. The kitchen upgrade now remodels the entire second floor and is cheaper since you don\\'t really get much. The bedroom upgrade is now the Inventor\\'s Suite, a grand new addition built onto the side of the Solitude archway. It also affects the third floor room and decorations which are now the housecarl quarters/guest bedroom. The alchemy lab and enchanting lab upgrades now control their specific areas and include useful storage units within reach for all your stuff.[/color]\r\n\r\n[color=skyblue][b]Problem #2 So there\\'s plenty of places to store all my stuff right?[/b][/color]\r\n\r\n[color=white]Wrong. There\\'s only two storage chests, both of which are on the third floor in the master bedroom. It\\'s super-annoying after prolonged use to walk up three flights of stairs to grab your stuff, then back down to enchant it. (The alchemy lab and enchanter are in the basement.)[/color] \r\n\r\n[color=skyblue][b]Fix[/b][/color]\r\n\r\n[color=white]So now each area has its own storage, which also saves time from scrolling through endless lists of unsorted spoils. Each one comes with a nifty scripted message to help you organize them. In total there are 2 display cases, 3 chests, 3 safes, 1 strongbox, 3 barrels, 4 bookshelves, 4 weapon plaques, 2 shield plaques, and 4 mannequins. All are non-respawnable and safe.\r\n\r\nThe new Inventor\\'s Suite includes two working bookshelves that hold a total of 51 books, 2 weapon display cases, and a brand new working potion display shelf that holds 18 potions, poisons, or elixirs![/color]\r\n\r\n[color=skyblue][b]Problem #3 Cool porch...wait, why can\\'t I get back inside?[/b][/color]\r\n\r\n[color=white]There is an error with the patio door. It is linked to the Solitude Fletcher\\'s key to open instead of the Solitude Player House key. So you can become stranded outside if you go through the wrong door.[/color] \r\n\r\n[color=skyblue][b]Fix[/b][/color]\r\n\r\n[color=white]I just put in a new door that works with the right key.[/color]\r\n\r\n[color=skyblue][b]Problem #4 What\\'s this empty useless cluttered room in the basement for?[/b][/color]\r\n\r\n[color=white]In Skyrim you can have companions. Ones that travel and fight with you. Ones you can marry. Even ones to look after your house while you\\'re away (housecarl). It would be awkward to find your housecarl sleeping in your own bed when you return home from a long dungeon-crawl, so they are given a room. Unfortunately there\\'s a bit of a glitch where this waste of space in the basement never upgrades to more than a sleeping bag and a few dusty crates.[/color] \r\n\r\n[color=skyblue][b]Fix[/b][/color]\r\n\r\n[color=white]So...I just deleted the old room. Well, more accurately, I expanded the area and made it into something else. Now your housecarl/spouse has their own bedroom on the third floor, since you have your all new bedroom suite. Much better than coming home to find your companion sleeping on the floor.[/color]\r\n\r\n[color=skyblue][b]Problem #5 Proudspire Manor, cool so it has a tower?[/b][/color]\r\n\r\n[color=white]Why is it called ProudSPIRE Manor? I mean...sure, the entire city is built on a giant rocky archway extending out into the sea. But the manor itself is just a two-story house with a ground-floor basement. Where\\'s my  36,000 gold tower?! I want a massive wizardry Hogwartsy medieval spire of awesomeness towering over my Imperial Nordic crib![/color]\r\n\r\n[color=skyblue][b]Fix[/b][/color]\r\n\r\n [color=white]So...I made one, accessible from the third floor living room. Now it is a very proud spire manor.[/color]\r\n\r\n[color=skyblue][b]Innovations & Improvements[/b][/color]\r\n\r\n[color=white]There\\'s more stuff: more places to put weapons and armor, more containers to store your loot, more mannequins to display your armor. The unused housecarl quarters is now an expanded basement upgrade with a smithing and crafting area. I cleaned up a bunch of lingering cobwebs that stayed after upgrading. And a whole host of other things like the phantom smoke ring on the second floor, glitchy overlapping textures and walls that flicker, lack of unique lighting or any lighting for that matter, a spire study with outward facing windows that requires no load time to enter and thus a grand view of Skyrim. A few other surprises that you\\'ll have to discover, yourself. Everything has been updated in both the dialogue and home decorating guide books for your lore-delving enjoyment.[/color][/center]\r\n\r\n[color=skyblue][b]Installation Instructions and Other Info[/b][/color]\r\n\r\n[color=white]Incredibly easy to install if you\\'ve never used the Proudspire Manor home. Just drop the file into your Skyrim/Data folder just like every other mod. Make sure it\\'s checked on in the Data section when you start up Skyrim. And enjoy!\r\n\r\nIf you haven\\'t purchased the house yet, you must complete the steward\\'s quests first and purchase/upgrade it. Afterwards, no problem!\r\n\r\nIf you already have the house and use it, no worries.[/color] [color=red][b]Just make sure you don\\'t have anything stored in the five-weapon rack or barrel with the ingots stacked on top near the stairs in the nook by the basement, or the housecarl quarters (I think there\\'s a couple of barrels) before loading it up.[/b][/color] [color=white]That\\'s the useless-looking room in the basement with a red door. Everything else is safe! All your stuff is right where you left it.\r\n\r\nJust in case, make sure to[/color] [color=red][b]back up and save all your progress before using this mod.[/b][/color] [color=white]I\\'d hate for anyone to lose a precious weapon or piece of armor.\r\n\r\nIf you are updating to v2.1 from my original upload [/color][color=red]READ THE WARNINGS BELOW[/color][color=white], then just overwrite the original in your Skyrim/Data folder. The files should have the same name anyway.\r\n\r\nUnfortunately, I\\'m only one person. So, I have not been able to test this mod\\'s compatability with every other mod out there. You can assume that any mod that doesn\\'t mess with the immediate solitude world space \\\"Avenues\\\" that surrounds Proudspire Manor or the interior cell \\\"SolitudeProudspireManor\\\" will work just fine with this mod. If there are any major incompatabilities, please let me know. \r\n\r\nDoes not currently work with Arthmoor\\'s \\'Open Cities\\' mod. Working on a solution.\r\n\r\nDoes not work well with vanilla \\'Realistic Lighting\\'. I suggest using \\'Vision Lighting\\' in \\'Realistic Lighting with Customization\\', the \\'brighter interiors\\' patch, or adjusting your custom indoor cell settings first before using my mod and their\\'s together. (I assume the same goes for most other lighting overhaul mods.)\r\n\r\nThis mod has been ALPHA, BETA, and GAMMA tested for countless hours by myself and my wife throughout the entire design process. With that said, nothing in Skyrim is perfect and the game is prone to glitches because it\\'s so massive. I can\\'t possibly catch or experience everything that can go wrong.\r\n\r\nIf you are having problems, or wish to inform me of some errors or things that need to be fixed, or things you absolutely loved, you may send comments to kaminazo.design@gmail.com.[/color]\r\n\r\n[color=red][b]Proudspire Manor-Inventors Spire v2.1 Update News[/b][/color]\r\n\r\n[color=white][b]Thank you to everyone who downloaded this mod in its first month! Here is the new updated version of the Inventor\\'s Spire with the all new Inventor\\'s Suite. I have taken into consideration as many of your suggestions as I could, along with my own grocery list of fixes into the v2.1 update.\r\n\r\nHere\\'s what\\'s new:\r\n\r\nWelcome to the new and improved v2.1: Inventor\\'s Spire and Suite! Enjoy and relax in your new master bedroom suite with a grand picturesque view of Skyrim. This new room is part of the bedroom upgrade that affects the upper story bedroom (now the housecarl quarters) and a small part of the basement. This new version is completely compatible with v2.0 and does not further affect any of the previous amenities. Bedroom is fully navmeshed for all your companions to hang out in. (TY r3yh4nd!)\r\n\r\nv2.1 FIX: Now your companions and followers can use the door to the Suite with no issues.\r\n\r\nv2.1 FIX: Clipping issue in upper bedroom behind safe and in suite above fireplace.\r\n\r\nv2.1 FIX: Replaced excess shadow-casting lights in basement to reduce flicker.\r\n\r\nv2.1 FIX: Spiced up Jordis\\' (housecarl) schedule so she explores the house, crafts, eats, and sleeps in her bed.\r\n\r\nAdded two new bookshelves that store a total of 51 books, 2 weapon display cases, and an all new potions display case that holds 18 potions, poisons, or elixirs! (TY vincentjazz12)[/color]\r\n\r\n[color=red]Replaced all vanilla containers with respawning still active in v1.2![/color][color=white] This is a big one and will affect your loot if you haven\\'t updated from v1.0! Before installing v2.1, v2.0, or v1.2, make sure to remove all items from the dwarven chest and bookcase in the upper tower, the weapons barrel by the enchanter, the safe by the alchemy table, the safe near the forge, and the two barrels on either side of the forge. Then save, install, and replace your items so they don\\'t disappear!(TY Arthmoor!)[/color]\r\n\r\n[center][color=skyblue]Future Plans/Bug Fixes[/b][/color]\r\n\r\n[color=white][s]Adjust lighting in spire to make it a bit brighter.[/s][/color] [color=red][b]FIXED v1.2[/b][/color]\r\n\r\n[color=white]Make patch for Realistic Lighting users if darkness problem persists.[/color]\r\n\r\n[color=white]Make compatible with Open Cities per request from Daiyus. TY! (still working on it!)\r\n\r\n[s]Fix rug clipping issue with rolled rug in basement per request from solkar77. TY![/s][/color] [color=red][b]FIXED in v1.2[/b][/color][color=white]\r\n\r\n[s]Check decoration upgrade price values with dialogue per request from NeoLithrac. TY![/s][/color] [color=red][b]FIXED in v1.2[/b][/color][color=white]\r\n\r\nFix mannequin settling issue where they strike a pose upon entering or leaving the cell. (only happens with basement door to Solitude)\r\n\r\n[s]Redo scripts on containers to work better with the new patch.[/s][/color] [color=red][b]FIXED in v1.2[/b][/color][color=white]\r\n\r\n[s]Fix navmeshing in basement area and suite.[/s][/color][color=red][b] FIXED in v2.1[/b][/color][color=white]\r\n\r\n[s]Fix Jordis the Sword-Maiden spawning, marriage and daily schedule.[/s][/color][color=red][b] FIXED in v2.1[/b][/color][color=white]\r\n\r\nFix basement door glitch with Jordis housecarl spawn.\r\n\r\nFix Jordis marriage disappearance glitch.\r\n\r\n[s]Fix bed ownership glitch in upper bedroom and suite.[/s][/color][color=red][b] FIXED in v2.1[/b][/color][color=white] TY Pablouh\r\n\r\nMake display cases actually house daggers or jewelry with triggers/activators.\r\n\r\nMake visible gem/ingot display that locks them into place in some sort of decorative way.\r\n\r\nMake dumbwaiter system to transfer loot from house to house without having to carry it all.\r\n\r\n[s]Add  a potion rack or visible ingredients sorting.[/s][/color] [color=red][b]FIXED in v2.0[/b][/color][color=white]\r\n\r\n[s]Add bedroom and/or lounge area for companions/followers per request from r3yh4nd. TY![/s][/color] [color=red][b]FIXED in v2.0[/b][/color][/center]\r\n\r\n[center][color=skyblue][b]Credits[/b][/color]\r\n\r\n[color=white]Much love to the community on Nexus Mods for all your inspiration. Special props to vincentjazz12 for writing all the potion rack scripts I used for the newest version 2.0. Also, thank you to anyone who uploaded help videos on YouTube, your expertise was invaluable; Especially LouisAT444 who simplified weapon racks, plaques, and mannequins to the point of idiocy for nimrod NEWB\\'s like me. Also, to Eldiabs - Daemonjax - koaandl - Utopolyst who made the Deus Mons mansion mod. Your work was an inspiration and showed me what was possible. The screen shots I took also make use of CptJoker\\'s gorgeous Enhanced Night Skyrim mod and Brumbek\\'s Static Mesh Improvement Mod-SMIM. They are amazing, so please download them and use them, too. Also thank you to Bethesda for releasing the Creation Kit (for free) onto us to totally mess up your wonderful game...or at least the chance to make it our own. And thank you to the people who run the Creation Kit wiki and UESPwiki for all the useful information you\\'ve given us. I\\'d also like to give much thanks to my wife who encouraged me through the process, helped me BETA test the house, and gave her own constructive criticism. Final thanks to Falk Firebeard, steward of the Blue Palace in Solitude for letting me click on him about 10 million times.[/color][/center]",
  "categoryId": "67",
  "version": "2.1",
  "author": "Kaminazo",
  "createdUnix": "1344861114",
  "updatedUnix": "1346766824",
  "containsAdultContent": false,
  "uploadedBy": "davidagladish",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81262",
      "name": "OLD FILE v1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "91",
      "fileName": "Proudspire Manor- Inventors Spire-22337-1-0.rar",
      "uploadedUnix": "1344861282",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/192777b6d06a9832ceada7a9740aa0df2f36ffd1750020c4ff6c7ccbcc49541b/analysis/1407093602/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Proudspire%20Manor-%20Inventors%20Spire-22337-1-0.rar?fid=81262&ttl=1535791823&ri=8192&rs=8192&setec=4f605666b9e06ebaa6be1007612df203"
    },
    {
      "fileId": "81953",
      "name": "OLD FILE v1-2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "92",
      "fileName": "Proudspire Manor-Inventors Spire-22337-1-2.rar",
      "uploadedUnix": "1345096529",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/e58e1cc0f1d0514a317dab9e9d1b4653a5c35a3a3f31ff84a25c1b18a418e9d4/analysis/1407100384/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Proudspire%20Manor-Inventors%20Spire-22337-1-2.rar?fid=81953&ttl=1535791823&ri=8192&rs=8192&setec=9c13dcdcd1d5e5187a84e0105e3951ed"
    },
    {
      "fileId": "85545",
      "name": "OLD FILE v2-0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "110",
      "fileName": "Inventors Spire and Suite v2-0-22337-2-0.rar",
      "uploadedUnix": "1346426523",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/4a4113dec0b9c0962793989687a2fca6e7c97e58f31b3200ef9d5e9beb7b66b2/analysis/1407135243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Inventors%20Spire%20and%20Suite%20v2-0-22337-2-0.rar?fid=85545&ttl=1535791824&ri=8192&rs=8192&setec=43ef14b99122ba4dae8ec9ccf41a74ea"
    },
    {
      "fileId": "86402",
      "name": "Inventors Spire and Suite v2-1",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "129",
      "fileName": "Inventors Spire and Suite v2-1-22337-2-1.rar",
      "uploadedUnix": "1346766824",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/71f22cfe21bb73951e1c7cad5ab3495199b1042d5f53d888b6330f52e7d37d8e/analysis/1407145444/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Inventors%20Spire%20and%20Suite%20v2-1-22337-2-1.rar?fid=86402&ttl=1535791824&ri=8192&rs=8192&setec=b2aa5ae47aa1bdebd2f10ed46d7d4494"
    }
  ]
}