{
  "modId": 22349.0,
  "modName": "My Skin Is Not My Own",
  "summary": "Adds 5 new shouts to the game, each word on each shout makes the dragonborn grow his own armor. This armor is dragon skin, so it cannot be sold, traded, removed (you can unequip, but it disappears like a bound weapon) or upgraded. Don\\'t worry, the armors stats are tweaked to be competitive with gear that you can craft. The first two Thu\\'ums are p",
  "descriptionHtml": "During the height of the Merethic Era, the dragon priests that brutally subjectated the populas sought of ways to elevate themselves to a higher being. Something more dragon than human. To become demi-gods just a step below their dragon-god leaders. For decades their efforts failed, the vital piece of the equation missing. \r\n\r\nYears later, during the Dragon Wars, the accumulated knowledge of the Dragon Metamorphosis were stored in glowing dragonstones, and scattered across Skyrim.\r\n\r\nOne such stone was transported to High Hrothgar, waiting for a powerful Dragonborn to unlock its secrets...\r\n\r\nAs you touch the stone, the familiar throbbing in your head is accompanied by the soft whisper in your ear as the word of power etch its way into your mind.\r\n\r\nYou try to shout out the words, but are overcome by sudden wracking pain. A loud ominous roar escapes your throat, your blood boils, eyes blur. When you recover you feel...different. You look down to see the toughened hide of a dragon, growing over your skin. \r\n\r\nThat is when you realise...\\\"My skin is not my own.\\\"\r\n\r\nInstallation:\r\nClick the subscribe button and enjoy. This mod works best on a new game. If you are loading it up into a saved game, you may have to console re-learn some words of power you have already learned. The four final forms and ultimate form are learned through existing words of power that are progressed in normal story line play.\r\n\r\nDescription:\r\nAdds 5 new shouts to the game, each word on each shout makes the dragonborn grow his own armor. This armor is dragon skin, so it cannot be sold, traded, removed (you can unequip, but it disappears like a bound weapon) or upgraded. Don\\'t worry, the armors stats are tweaked to be competitive with gear that you can craft. The first two Thu\\'ums are progressive, six forms total ending in the ultimate form. The three additional Thu\\'ums are resistance sets (flame, frost, and poison). The base forms are a little more general purposed with stats abilities, while the affinity (resistance) sets are more defensive in their respective trees.\r\n\r\nLocations:\r\nFirst word stone is in High Hrothgar (read backstory) in the main hall. If you go from the front door directly to the back courtyard you cannot miss it.\r\nSecond word stone is found outside of Kynesgrove, around the dragon mound where Sahloknir is revived during the main quest line.\r\nThird word stone (this completes the first Thu\\'m and unlocks the first word of the three resistance sets) can be found in the front courtyard of the Thalmor Embassy, should be accessed when finding out that Esbern is still alive.\r\n\r\nFourth word stone hint: You must learn more of the dragon language.\r\n\r\nAll other unlocks are in easy spots to be found through normal questing, or storyline progression and need to be discovered on their own. For those who are loading into a already progressed game, you may need to enter the following console commands to re-learn words that you have already learned to get the final unlocks:\r\nplayer.teachword 20E19 - Shul, final word for fire breath shout. Flame Dragon Shout.\r\nplayer.teachword 5D16E - Diin, final word for frost breath shout. Frost Dragon Shout.\r\nplayer.teachword 2F7BD - Kest, final word for whirlwind sprint. Storm Dragon Shout.\r\nplayer.teachword 60299 - Aus, final word for marked for death shout. Forest Dragon Shout.\r\nplayer.teachword 3CD31 - Lok, part of the clear skies shout. Elder Dragon.\r\nplayer.teachword 46B8A - Ah, part of the call dragon shout. Ancient Dragon.\r\n\r\nKnown issues:\r\nOn the female sets, in first person view, I cannot seem to get the glove textures to load up properly. They keep defaulting to the default texture vs keeping the custom one. I can change it in CK, and save it. But if I load up the mod, or boot it up in Skyrim, it defaults back to the default texture. As soon as I can fix this. An update will be updated.\r\n\r\nUpdate 1.1:\r\n-Moved third word stone to front courtyard of Embassy for future access after questline.\r\n-New mask texture, less \\\"creepy\\\", if the creepy version is preferred. The HD textures on Nexus still feature the creepy mask with the new mask as an alternate download.\r\n-HD version of mask revision added to the Nexus download.\r\n\r\nUpdate 1.2:\r\n-Stormdragon (shock resistance) added.\r\n-Re-textured all \\\"skin\\\" parts of every set.\r\n-Slight re-color of every set.\r\n-Armor for Silver Dragon and Shadow Dragon (secret quest sets), coded into game, only available via console.\r\n-->Silver Dragon - More straight forward type of set, not quite tank type, but more of direct combat light armor.\r\n-->Shadow Dragon - For you sneaky sneaky types. Built to be bit of a glass cannon.\r\n\r\nFuture Updates:\r\n-CBBE & Skimpy female model pack. Will be added to the Nexus download alternate.\r\n-Two secret final forms will be added with their own quest lines to obtain. This may take a bit, I want the questing scripts to be perfect.\r\n\r\nHeavy armor version will be its own mod, will be completely compatiable and will include a tank type and caster type final forms.\r\n\r\nMain Mod:\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=88934837",
  "categoryId": "54",
  "version": "1.2",
  "author": "Rhaeghar",
  "createdUnix": "1344877737",
  "updatedUnix": "1345446794",
  "containsAdultContent": false,
  "uploadedBy": "mrgettmann",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81310",
      "name": "My Skin Is Not My Own HD models",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "106882",
      "fileName": "My Skin Is Not My Own HD models-22349-1-0.7z",
      "uploadedUnix": "1344878529",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/07f3b31d0c332bb2f54cd09808dbc617fa89da369de3120067e9a2487ebd786f/analysis/1407093980/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/My%20Skin%20Is%20Not%20My%20Own%20HD%20models-22349-1-0.7z?fid=81310&ttl=1535791836&ri=8192&rs=8192&setec=b91ad8dd49dd77a8bbf007facb90003f"
    },
    {
      "fileId": "82115",
      "name": "My Skin Is Not My Own Alternate HD Textures",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "131070",
      "fileName": "My Skin Is Not My Own Alternate HD Textures-22349-1-1.7z",
      "uploadedUnix": "1345169101",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/42fee4e089e3d3eb0ce586834b72573622a8e236c2207203323ba87bfce097d6/analysis/1407101968/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/My%20Skin%20Is%20Not%20My%20Own%20Alternate%20HD%20Textures-22349-1-1.7z?fid=82115&ttl=1535791836&ri=8192&rs=8192&setec=f671c15bc71cb94e66ff847c401fa4a1"
    },
    {
      "fileId": "82588",
      "name": "CBBE and Skimpy mesh files",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "519",
      "fileName": "CBBE and Skimpy mesh files-22349-1-0.7z",
      "uploadedUnix": "1345332454",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4b47e7a45d2ae7f030ce44df70e1227b26c1f66a3af00d3d35d14fb35fa8c2ee/analysis/1407106203/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CBBE%20and%20Skimpy%20mesh%20files-22349-1-0.7z?fid=82588&ttl=1535791837&ri=8192&rs=8192&setec=757febe0b5741e84b911fea4101bca2d"
    },
    {
      "fileId": "82630",
      "name": "My Skin Is Not My Own",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28762",
      "fileName": "My Skin Is Not My Own-22349-1-2.7z",
      "uploadedUnix": "1345343626",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/76e5639ffd932cbde65cf87754df1d0ab4df0d3876db31729f5fbb08671ecf7f/analysis/1407106698/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/My%20Skin%20Is%20Not%20My%20Own-22349-1-2.7z?fid=82630&ttl=1535791837&ri=8192&rs=8192&setec=9ea794956995dd15c52945d031e38710"
    },
    {
      "fileId": "82937",
      "name": "My Skin Is Not My Own Skin1 Mask 2 HD models",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "196829",
      "fileName": "My Skin Is Not My Own Skin1 Mask 2 HD models-22349-1-2.7z",
      "uploadedUnix": "1345446794",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/87029bc22d95f2503afd405afa1763f435b333f7dbb59abd1499fa5de40656da/analysis/1407109448/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/My%20Skin%20Is%20Not%20My%20Own%20Skin1%20Mask%202%20HD%20models-22349-1-2.7z?fid=82937&ttl=1535791838&ri=8192&rs=8192&setec=29990826ea006935a9840a9178d90dbf"
    }
  ]
}