{
  "modId": 22365.0,
  "modName": "Leave me alone Brynjolf",
  "summary": "Keeps Brynjolf from grabbing you and putting the Thieves Guild questline in your log without you wanting it.",
  "descriptionHtml": "Playing a character where you have no intention of joining the Thieves Guild?\r\nDon\\'t like having quests in your quest log that you aren\\'t gonna do?\r\nThen this mod is for you.\r\n\r\nI\\'ve had this lying around in my data folder for a very long while, and I\\'ve seen no issues whatsoever come out of it.\r\nA (very) quick search revealed nothing that seemed to fix this, so I decided to upload my fix.\r\n\r\nAll it does is stop the script that makes Brynjolf come up and initiate the conversation that starts you on the Thieves Guild questline. Before, even if you exited out you\\'d get stuck with it in your log.\r\n\r\nThe most he\\'ll do is walk up to you and make the comment about your coin, except he won\\'t pull you into a dialogue and you can safely walk on by. After he\\'s done spewing his line he\\'ll just march back to his spot and do whatever he was doing before you came by.\r\nThis works both in the market and when he\\'s in the Bee & Barb.\r\n\r\nI should probably mention that if you DO end up wanting to play the Thieves Guild quests, all you have to do is go and initiate a conversation with Brynjolf.\r\nThis is one of those little mods you can have running across multiple playthroughs. That\\'s what I do anyway.\r\n\r\nInstallation\r\n------------\r\nJust drop the .esp into your data folder and tick it off in your mod manager of choice, whether that be the default launcher or the Nexus Mod Manager.",
  "categoryId": "33",
  "version": "1.0",
  "author": "Darklink941",
  "createdUnix": "1344889991",
  "updatedUnix": "1344890103",
  "containsAdultContent": false,
  "uploadedBy": "darklink941",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81367",
      "name": "Leave me alone Brynjolf",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Leave me alone Brynjolf-22365-1-0.zip",
      "uploadedUnix": "1344890103",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ae9e2cdd480cf799ec1ab63a5ee48bab3fc896a6fbbd076dabc7586bdb76b041/analysis/1407094446/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Leave%20me%20alone%20Brynjolf-22365-1-0.zip?fid=81367&ttl=1535791867&ri=8192&rs=8192&setec=25381c31654764b1ea3dfe5da854246f"
    }
  ]
}