{
  "modId": 22372.0,
  "modName": "several Horses summon mod",
  "summary": "-Shadowmere\r\n-Frost\r\n-Spectral Horse\r\n-Ghost horse\r\n-Ethereal horse\r\n-Fire horse\r\n-Frost horse\r\n-Storm horse\r\n-Horse of the hunt\r\n-Shadow horse\r\n-Sovngarde horse\r\n-3 elemental spirits",
  "descriptionHtml": "Discription:\r\n\r\nSo i noticed people made Shadowmere or Frost essential,\r\nbut i did not like the fact that my horse would be indestructible but still could get lost,\r\nso i made the 2 horses into a summon, now when they die or you loose them, all you have to do is find there conjuration book.\r\ni also added a few ghost horses for all player classes there needs.\r\n\r\nif there are any horses somebody would want to see made, please sugest them, if i am able, i will make them, \r\nnote that i am not able to make new meshes (yet) and im not quite familiar with textures too (yet).\r\nso my creation options are still limited to things that exist in the game only.\r\n\r\nEnjoy the mod, and dont forget to comment, rate or endorce!\r\n\r\n_______________________________________________________________________________________________________________________________\r\n\r\nWhat horses are there?:\r\n\r\n\r\n-> Spectral Horse\r\n\r\nDiscription: A long forgotten experimental conjuration made by the Augur of Dunlain when he was still a man.\r\n             This spell was created to help mages travle over large area\\'s before they have mastered the ability to bend time and space.\r\n             The spell gathers magickal energy to from a spectral apearance of a horse, however this project was never finished.\r\n             Becourse of that the spectral horse is slower then the natural horses that live in the region of Skyrim.\r\n\r\nStrong points: The horse cannot be harmed by anybody. \r\n\r\nLocation: College of Winterhold, Midden, Daedric conjuration room,\r\n\r\nRecomended class: Mage\r\n\r\n--------------------------------\r\n\r\n-> Ghost Horse\r\n\r\nDiscription: A necromancer\\'s creation, visiting the owner of a small wooden shack in the woods, a necromancer wished to get new subjects to experiment on.\r\n             Unknown to the owner of the shack, the necromancer unleashed sickness around his shack. the dog of the owner of the shack ran away sensing the dark magic.\r\n             But both the owner and his horse got struck by sickness. then the necromancer introducing himself as a healer mage, he entered the owner\\'s shack.\r\n             While telling the owner his own sickness was nothing but a severe case of Rockjoint, he told that his horse was severely sick. \r\n             Giving the horse and the owner a potion, unknown to the owner this was not a cure but poison, and the necromancer also left a emtpy spelltomb under the body of the horse.\r\n             Ones the hores would die, the necromancer would return to take the soul of the horse while the owner his body would be weak from the sickness so he would not be able to fight back.\r\n             Unfortunatly, the owner and necromancer got attacked that same night by wolfs, the necromancer was killed in his sleep, never knew what happened. \r\n             The owner of the shack was awake and fought back, but thanks to the severe case of rockjoint his body was so weakened he never stood a chance.\r\n\r\nStrong points: its the easiest spell tomb to get. it does not require you to be part of any faction.\r\n               the ghost horse has the same stats as a normal horse and is not very special in any way exept for being dead.\r\n\r\nLocation: Meeko\\'s shack, South of Solitude around the swamp area\\'s, \r\n\r\nRecomended class: Necromancer, neutral player\\'s\r\n\r\n--------------------------------\r\n\r\n-> Ethereal Horse\r\n\r\nDiscription: A horse ones used by Jurgen Windcaller. Using the power of the Thu\\'um he was able to gather air, and form it into a horse.\r\n             Jurgen Windcaller used this horse to travle around Skyrim in searche of the words of power so he could meditate on there wisdom.\r\n             After finding all words, Jurgen started in spending the rest of his days using and learning the way of the voice to others.\r\n             His horse summon was passed on to the Greybeards, but they never felt the need to leave outside High Hrothgar.\r\n             Thus the spell has been unused for a long time.\r\n \r\nStrong points: The horse exists fully out of air, and thus cannot be harmed.\r\n               as a Ethereal horse existing out of wind, this horse is slightly faster then other horses and can sprint slightly longer.\r\n\r\nLocation: High Hrothgar, Greybeards sleeping quarters.\r\n\r\nRecomended class: Dovakhiin, follower of the way of the voice,\r\n\r\n--------------------------------\r\n\r\n-> Horse of the hunt\r\n\r\nDiscription: A gift from Hircine to his blessed hunters. This horse is a creation of Hircine and origionates from his Oblivion realm of the eternal hunt.\r\n             These horses love nothing more then chasing there prey and using there hooves to kick there prey into the ground.\r\n             Blessed by Hircine, the Circle of the companions have been granted the gift of summoning one of the horses of the hunt to there side.\r\n             Eyes on the prey, not the horizon.\r\n\r\nStrong points: Only slightly faster then normal horses (nearly not noticable) \r\n               This horse has a lot more stamina then other horses and can chase its prey for a longer time\r\n               This horse is Tougher then other horses and can take a lot more damage then a normal horse\r\n\r\nLocation: Whiterun, the Underforge\r\n\r\nRecomended class: Companion warriors Blessed/Cursed with lycanthrope, Daedra worshipers to Hircine,\r\n\r\n--------------------------------\r\n\r\n-> Shadow Horse\r\n\r\nDiscription: The Shadow horse is a being originating form the realm of Nocturnal.\r\n             This horse originates form the shadows itself, and is the best friend of every Nightingale.\r\n             The shadow horse moves like a stealthy shadow, and most would not be able to see or hear it moving in the shadows.\r\n             \r\nStrong points: This horese is one of the fastes horses in all of Tamriel and is for that reason the best companion for every Thief who just got cought red handed.\r\n               The Shadowhorse has more stamina then other horses and can last longer while sprinting.\r\n               Being a horse form the shadow, this horse will sometimes become black as shadow, this is the horse signaling you a enemy is near, and its time to fight, or leave.\r\n               As the horse merges itself in shadow, it will not harm enemy\\'s and only serve as a sign to show the player he has to watch out.\r\n\r\nLocation: Nightingale Hall,\r\n\r\nRecomended class: Nightingale,\r\n\r\n--------------------------------\r\n\r\n-> Fire Spirit Horse\r\n\r\nDiscription: A horse existing out of the purest of flame. Created a long time ago by a powerfull mage named Magnus.\r\n             Tough this horse is always on fire, its flamed cannot do anybody harm. \r\n             However, if anybody were to attack the horse, it would increase the flames around its body to set his attacker on fire.\r\n             \r\nStrong points: Fire cant harm this horse, but frost will deal more damage to it.\r\n               This horse has a strong fire burning inside of it, giving it a high stamina level.\r\n\r\nLocation: Labyrinthian\r\n\r\nRecomended class: Fire mage, Dawnguard (fire harms vampires), normal mage, anybody that loves fire, \r\n\r\n--------------------------------\r\n\r\n-> Frost Spirit Horse\r\n\r\nDiscription: A horse existing out of the the strongest of ice. Created a long time ago by a powerfull mage named Magnus.\r\n             Tough this horse is always frozen solid, its freezing cold cannot do anybody harm. \r\n             However, if anybody were to attack the horse, it would increase the ice around its body to engulf his attacker in the coldest of winds.\r\n             \r\nStrong points: Cold cant harm this horse, but fire will deal more damage to it.\r\n               This horse has a strong body existing out of ice, giving it a high health level.\r\n\r\nLocation: Labyrinthian\r\n\r\nRecomended class: Frost mage, Vampire\\'s (Vampires resist ice), normal mage, anybody that loves liquid nitrogin, \r\n\r\n--------------------------------\r\n\r\n-> Storm Spirit Horse\r\n\r\nDiscription: A horse existing out of the the strongest storms known to man or mer. Created a long time ago by a powerfull mage named Magnus.\r\n             Tough this horse is always serounded by electricity, its shocking body cannot do anybody harm. \r\n             However, if anybody were to attack the horse, it would increase the voltage around its body to drown his attacker in waves of lightning.\r\n             \r\nStrong points: Shock cant harm this horse, but water will deal more damage to it. At least that was the idea, but skyrim does not have water damage, so its only imune to shock. lol\r\n               This horse has a electrified body existing out of lightning, giving it a high speed level. this is the fastest horse of this mod.\r\n\r\nLocation: Labyrinthian\r\n\r\nRecomended class: Shock mage, Blades/Akaviri players (only course shock looks badd ass in combination with there armor AND shock rains down form the air, \r\n                  making it a good weapon vs dragons), normal mage, anybody that loves shocking things, \r\n\r\n--------------------------------\r\n\r\n-> Sovngarde Horse\r\n\r\nDiscription: This horse use to belong to powerfull Nord wariors true the years, passed on from one hero of the battle field to the other.\r\n             unlike any other horse, this strong beast felt itself home on the large fields of battle, where he would proudly rush true the ranks of its masters enemy\\'s\r\n             trampling anybody who dared to stand in its way.\r\n             After the horse died on the battle field, being struck down by a shot of a catapult, Shor watching from Sovngard felt compasion for the bravest horse of horses.\r\n             And as a rare ocasion, brought its soul to the plains of Sovnengard to run over the large fields to be ever known as the bravest horse Skyrim has ever seen.\r\n             The horse of hero\\'s. Longing to ones more ride over battle fields on Mundus with a strong rider on its back, cutting down any in there way.\r\n\r\nStrong points: cant be killed\r\n               is faster and runs longer then normal horses\r\n\r\nLocation: Sovngarde, Hall of Valor (and the plains of Sovngarde where you can mount him)\r\n\r\nRecomended class: True Nord hero\\'s.\r\n\r\n--------------------------------\r\n\r\n-> Frost\r\n\r\nDiscription: Everybody that plays Skyrim and is a thief knows this horse so i wont bother explaining or giving a spoiler.\r\n             \r\nStrong points: Faster and tougher then other horses. Less tough then shadowmere, but faster\r\n\r\nLocation: Frost (horse) inventory (if the horse dies you can get it), Black Briar lodge,\r\n\r\nRecomended class: thieves, lovers of cold weather, people who dont like spirit horses, people who love Frost (horse)\r\n\r\n--------------------------------\r\n\r\n-> Shadowmere\r\n\r\nDiscription: Everybody that plays both Skyrim and Oblivion knows this horse so i wont bother explaining or giving a spoiler.\r\n\r\nStrong points: Faster and tougher then any horse in the game. Frost is Faster, but less tough then shadowmere.\r\n\r\nLocation: Shadowmere\\'s inventory (if she dies you can get it), Dawnstar sanctuary,\r\n\r\nRecomended class: Assassins, Dark brotherhood assassins, people who love shadowmere, people who hate ghost horses.\r\n\r\n_________________________________________________________________________________________\r\n\r\nWhat are the spirits in the pictures?:\r\n\r\nah glad you asked! (well, kinda)\r\nthose ghosts have the horse summon tomb in there inventory.\r\nbecourse the ogirional game did not have a shock spirit i added her as a new summon too, \r\ni tried to add a elemental door too, but it required scripting, what i have not learned properly yet \r\n+ it would require to do water damage (and i was not realy fond of adding a new spell just to open a door)\r\nso instead of a door there is just a storm mist, you can walk true it witouth problems only the elemental spirit will be there to attack you.\r\n\r\nNote, the elemental spirits have been upgraded, now they will level along with the player, meaning if you meet them as boss, they will be pretty strong.\r\nThe higer your level will be, the more magic and power they will pack, recomended to use elemental magic that oposes there own and carry potions to resist the element they are.\r\nthe shock spirit has no real weaknesses, so be prepared to use a lot of magic that is strong, or use a lot of conjuration\\'s to take the hits for you.\r\n\r\nas a compensation, the spirits have a conjuration book of the elemental horse AND a conjuration tomb to summon the spirit themself.\r\nthey will still be leveled ones you summon them.\r\nthe stronger you are, the more magic they will use. \r\nall elementals have 3 spells, Fire-Ice-Shock wall, F-I-W cloak, Fireball-Ice storm-Chain lightning. \r\nin there right hand they hold a weapon with there own element enchantment. \r\n\r\n_________________________________________________________________________________________\r\n\r\nSmall note:\r\n\r\nall summons have different effects and sounds, \r\nthe spells can be cast with eather hands or used as a power (shout button) for players who dont want to drop there blade or power/shout to call a horse\r\n\r\nIMPORTANT, shadowmere\\'s summon have the sound effect of hoofs trampling followed by a explosion sound and shadowmere calling,\r\nthis sound ONLY plays if you cast the spell with the right or left hand, this sound will NOT play if you summon her with the shout button. (cant be helped)\r\n\r\nAlso remember, Shadowhorse its ability to become one with the shadows, Shadowmere\\'s Embrace of sithis (shadow cloak) Frost\\'s winter\\'s grasp (frost cloak) and all elemental horses there cloak spells ONLY work if you are not on there back, if you are driving on them cloak spells wont activate, sorry\r\n\r\n_________________________________________________________________________________________\r\n\r\nCompatibility:\r\n\r\nthis mod \\\"should\\\" be compatible with most horse mods, if it changes textures then it wont make any conflicts, changes at meeko\\'s shack might conflict,\r\n\r\nonly origional Bethesda Skyrim material was used to make this mod\r\n\r\nNO DAWNGUARD NEEDED, you can use this mod without it (for the people out there that do not have the cash at the moment for Dawnguard)\r\n\r\nArvak from Dawnguard will be altered seperately in my upcoming mods.\r\n\r\n_________________________________________________________________________________________\r\n\r\nChangelog:\r\n\r\nV1 Added shadowmere, frost and spectral horse to the game\r\n\r\nV2 - Remove the storm shots from shadowmere and frost to prevent NPC\\'s to turn hostile to the player\r\n   - Remove the spectral horse from all locations exept winterhold\r\n   - Add Ghost horse, Sovngarde horse, Shadow horse, fire-frost-storm horse, Ethereal horse, Horse of the hunt, and the 3 Elemental spirits.\r\n   - Add effects in Labyrintian for Shock spirit.\r\n   - Re wright the diary from the owner of Meeko\\'s shack\r\n   - Add extra parts to Meeko\\'s shack.\r\n   - Add spell tombs to all class based locations.\r\n\r\n________________________________________________________________________________________",
  "categoryId": "75",
  "version": "V2",
  "author": "JefTheReaper",
  "createdUnix": "1344895298",
  "updatedUnix": "1347391959",
  "containsAdultContent": false,
  "uploadedBy": "jefthereaper",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81389",
      "name": "Horse Summon JTR",
      "version": "V1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16",
      "fileName": "Horse Summon JTR-22372-V1.rar",
      "uploadedUnix": "1344895473",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/a2012aea67dfafe0b384fc4ef163beb8a108e0f7fc9495ba6125851800d054dd/analysis/1407094626/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Horse%20Summon%20JTR-22372-V1.rar?fid=81389&ttl=1535791879&ri=8192&rs=8192&setec=4dc2dddeadaaf77cf0061a062f93aaf7"
    },
    {
      "fileId": "87886",
      "name": "Horse Summon JTR",
      "version": "V2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31",
      "fileName": "Horse Summon JTR-22372-V2.rar",
      "uploadedUnix": "1347391959",
      "modVersion": "V2",
      "virusScanUrl": "https://www.virustotal.com/file/8ef93cba6ac497b699335f16b82810ef2ed669270fab7486f44fbf896f443335/analysis/1407160262/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Horse%20Summon%20JTR-22372-V2.rar?fid=87886&ttl=1535791880&ri=8192&rs=8192&setec=273944925431d7262a6ae8743851a686"
    }
  ]
}