{
  "modId": 22386.0,
  "modName": "Genevieve - Fallen Daedra Sorceress",
  "summary": "Female High Elf mage follower with backstory chronicling her fall from the realm of the Daedra.",
  "descriptionHtml": "====\r\nLORE\r\n====\r\n\r\nNocturnal, whose domain is shade and to whom many an unscrupulous mortal owes his allegiance, could no longer tolerate the insolence of her servants. Treachery crept through her ranks like the shadow – an irony that did not escape the Night Mistress. She had heard rumblings from Attribution\\'s Share, where the followers of Boethiah call their home, that dissent began winding through that serpentine land. A certain name was on the tongues of the Great Deceiver\\'s followers, a name that Nocturnal knew all too well – Azura, Queen of Dawn and Dusk. She gave little thought to her hated sister\\'s influence spreading to other planes of Oblivion, but as the veil of darkness obscures vision, so too did Nocturnal fail to see the seeds of discord sown in her own realm. That is, until now.\r\n\r\nOh how the lesser Daedra talked about Azura! On and on they went, extolling the virtues of benevolence and cooperation with mortals. Mundus, they said, required more assistance than “the mere deviousness that darkness provided.” The light of dawn need not be absent; rather, it should be embraced as the sun embraces the world during the day, according to her servants. These words were poison to her ears. Nocturnal could hardly reconcile her teachings with these heretical arguments, and the sadness of a mother forsaken by her children overcame the Mistress of Shadows. Worse still, she had learned the source of this impiety: Genevieve, one of her most loyal and beloved of confidants.\r\n\r\nA tall and lithe Daedra Seducer, Genevieve always demonstrated the greatest of faithfulness to her mistress, and for that, was rewarded with power over the Evergloam, and as much influence on Mundus as Nocturnal was willing to grant her servants. As an agent of the night, she seduced mortals with her mysterious charm as well as her dark beauty; few could resist the allure of a being so enigmatic. Amongst the Nightingales, she was simply known as the “Sunless Siren.” No other lesser Daedra embodied the blessings of the night as Genevieve did. Truly, she had earned the favor of Nocturnal above all others. That is why the Night Mistress felt a betrayal most beings could not fathom, and why it pained her so much to banish the Seducer from Oblivion.\r\n\r\nFor Genevieve, the call of Azura was, in retrospect, inevitable. Her enlightenment was beyond the pettiness of Sanguine, the capriciousness of Sheogorath, the cruelty of Molag Bal, and even – to Genevieve\\'s initial chagrin – the callousness of Nocturnal. The other Daedric Princes now seemed small to her; not in power, but in philosophy, for all their beliefs were trapped in the prison of the mundane. Only Azura\\'s empathy, she reasoned, transcended all. These revelations began when she happened upon a copy of Invocation of Azura, and they became even more convincing when the Queen of Dusk and Dawn herself appeared to Genevieve and spoke of her intentions. The lesser Daedra was one of the chosen in a Great Culling, and she would soon suffer a fall, only to rise again in service of Azura.\r\n\r\nAnd fall she did. No longer tied to the planes of Oblivion, Genevieve was stripped of much of her Daedric powers and condemned to walk the mortal plane in a weakened form. To us on Mundus she may seem powerful, but to a Daedra, she feels as vulnerable as a newborn. It is with the motivation to reclaim that glory that brings her here, to the Shrine of Azura in Skyrim, where she waits patiently for the Mother of the Rose to guide her.\r\n\r\nThis is all she has told me, as I stare into those inky-black eyes, expecting the Daedra within to burst free at any moment. I both pity and envy her; to be cast down by her own mistress is disheartening, but to find a new light in Azura\\'s splendor is cause for hope. I have not asked her why she carries with her what appears to be a black soul gem, filled with spirit of a mortal being. Nor have I asked her what she expects our mistress to command her to do, or how she will be rewarded if this task is completed. The only knowledge of the future I possess is the cryptic messaged imparted to me by Azura herself: whatever her quest may be, Genevieve\\'s fate is inexorably tied with that of the Dragonborn.\r\n\r\n\r\n=======\r\nDETAILS\r\n=======\r\n\r\nGenevieve is a powerful High Elf follower that can be found at the Shrine of Azura. She has blue-black hair, black demonic eyes, freckles, and is taller than average. She levels with the player from 10 to 50, and masters each school except Illusion by her last level. Her main form of attack is to dual-cast Thunderbolt spells, while supporting herself with Frost Cloak and summoning a Dremora Lord. If low on health, she will use Grand Healing. Genevieve is also marked as essential.\r\n\r\nThis is my first attempt at a mod, so I hope it\\'s at least somewhat passable. Thank you for trying it out, and let me know if you have any questions or suggestions.\r\n\r\n\r\n============\r\nINSTALLATION\r\n============\r\n\r\nExtract files to Skyrim/DATA folder.\r\n\r\n\r\n=============\r\nREQUIRED FILE\r\n=============\r\n\r\n*ApachiiSkyHair Female Standalone 1.0 [ http://skyrim.nexusmods.com/mods/10168 ]\r\n\r\nIMPORTANT: EVEN IF YOU HAVE MAIN VERSION 1.4, YOU STILL NEED THIS FILE. CHECK UNDER \\\"OPTIONAL FILES\\\" ON ITS NEXUS PAGE.\r\n\r\n\r\n==================\r\nSUPPLEMENTAL FILES\r\n==================\r\n\r\nThese aren\\'t necessary, but suggested to get the look I achieved in the screenshots.\r\n\r\n*Caliente\\'s Female Body Mod Big Bottom Edition (CBBE) 3.1 [ http://skyrim.nexusmods.com/mods/2666 ]\r\n\r\n*Better Females by Bella [ http://skyrim.nexusmods.com/mods/2812 ]\r\n\r\n*No More Blocky Faces [ http://skyrim.nexusmods.com/mods/30 ]\r\n\r\n*Nocturnal Dress for CBBE [ http://skyrim.nexusmods.com/mods/2676 ]",
  "categoryId": "66",
  "version": "1",
  "author": "Arcturus",
  "createdUnix": "1344913910",
  "updatedUnix": "1344914428",
  "containsAdultContent": false,
  "uploadedBy": "nufy8",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81450",
      "name": "Genevieve",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "629",
      "fileName": "Genevieve-22386-1.rar",
      "uploadedUnix": "1344914428",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/15fba3dadbc0e5421a0f4d19bf2886e5dbbd86ca6d9496acf358bf9fa5062c07/analysis/1407095345/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Genevieve-22386-1.rar?fid=81450&ttl=1535791899&ri=8192&rs=8192&setec=955fe9d9ddec8fbe1dbf3e1ebb5c684c"
    }
  ]
}