{
  "modId": 22428.0,
  "modName": "SkyrimData",
  "summary": "SkyrimData is designed to help you manage the mods which require you to manually copy files into the main Skyrim\\\\Data folder.",
  "descriptionHtml": "SkyrimData is designed to help you manage the mods which require you to manually copy files into the main Skyrim\\\\Data folder. It tracks what has been installed and alerts you if the mod you are installing will overwrite any existing files. It allows you to remove installed mods and it also keeps a running history of which mods had conflicting files and what was done to resolve the conflict.\r\n\r\nSkyrimData does not substitute for something like Wrye Bash for updating .esm and .esp files and changing load order. It only deals with loose files that need to be copied into one or more folders under the main Skyrim\\\\Data folder. It should work alongside such programs as Wrye Bash and BOSS.\r\n\r\nPrerequisite\r\n\r\nMicrosoft dotNet Framework 4.0.\r\n\r\nInstallation\r\n\r\nSimply extract this archive to a folder and start skyrimdata.exe. There is no other installation process as all required files are included in the archive. The skyrimdata.html file contains an illustrated description of how to use SkyrimData - please read before starting the program.",
  "categoryId": "39",
  "version": "1.0",
  "author": "Yovaneth",
  "createdUnix": "1344976108",
  "updatedUnix": "1344976179",
  "containsAdultContent": false,
  "uploadedBy": "Yovaneth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81602",
      "name": "SkyrimData",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3985",
      "fileName": "SkyrimData-22428-1-0.rar",
      "uploadedUnix": "1344976179",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/42e72a0c2f558a481599aab6fe7c3b7aec91baf034ab56a6644982eae0930bb4/analysis/1407096847/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyrimData-22428-1-0.rar?fid=81602&ttl=1535791960&ri=8192&rs=8192&setec=7cef532115b76748ec53bebea8d57475"
    }
  ]
}