{
  "modId": 22486.0,
  "modName": "Lots More Followers",
  "summary": "Men and women are coming from across Tamriel -- they are adventurers seeking glory \r\nand will gladly support and follow the Dragonborn to glory or death! Version 1.3 has 40 new followers to choose from and 2 quest givers with lots more to come!  Looking for healers who can heal you in battle? You found it!",
  "descriptionHtml": "\r\nLots More Followers version 1.6 / by JNL\r\n\r\n*** Adds 70 quality followers with diverse behavior to the world! ***\r\n*** Populate Skyrim with new interesting characters! ***\r\n\r\nMen and women are coming from across Tamriel -- they are adventurers seeking glory \r\nand will gladly support and follow the Dragonborn to glory or death!\r\n\r\nNow with 70 followers and 3 quests (one you can take multiple times, one to gain \r\nthe trust of an Orc and gain access to the Orc strongholds and one for the mages out\r\nthere -- all with voices!). \r\n\r\nLooking for healers who can heal you in battle? You found it!\r\nLooking to find a way to populate inns or the Thieves Guild HQ? Check.\r\nDon’t need followers but just want more characters populating Skyrim? Yep.\r\n\r\nNexus: http://skyrim.nexusmods.com/mods/22486\r\nWorkshop: http://steamcommunity.com/sharedfiles/filedetails/?id=89857922\r\n\r\n------------------------------------------------------------------------------------------------------\r\n\r\nMOD Intent: Add more interesting characters (who are potential followers) in Skyrim. \r\n\r\nI\\'m playing at MASTER level and I\\'m not a fan of immortal (\\\"essential\\\") followers.  As a \r\nnatural consequence, a lot of them die in combat. Which is fine - it\\'s all part of keeping it real. \r\nBut now I\\'m running out of followers, so I created this mod to have new adventurers come to \r\nSkyrim to help fellow adventurers. Even if you don\\'t need new followers, but you want to \r\npopulate the world with new characters rich in backstories or with new quests, \r\nthen this MOD is for you!\r\n\r\n\r\n\r\n*** NEW in 1.6 ***\r\nA new quest in the College of Winterhold.  To start the quest, look for a dead courier while\r\nwalking on the road to Winterhold from the south.  Also added a few ordinary citizens as\r\nfollowers – for those of you who like the idea of building someone from the ground up.\r\n\r\n*** NEW in 1.4 ***\r\nIntroduction of “Bodyguard” Followers – good news for those who are not using (or don’t like \r\nusing) a multiple follower mod. Bodyguards like Korslik will follow their master, in this\r\nexample, Fjorstaag, to the death. If Fjorstaag is following you, it will be like you have 2\r\nfollowers (Fjorstaag who is a mage, and Korslik, who is a warrior).  When Fjorstaag dies, you\r\ncan have Korslik follow you (or not, in which case he just goes home).   This is a pilot run –\r\nmore will be added soon.\r\n\r\n*** NEW in 1.4 ***\r\nIntroduction of “Exploring” followers – similar to traveling followers but this time they do\r\nnot enter inns, so you’ll encounter them in the wilderness.  This is a pilot run – more will be\r\nadded soon.\r\n\r\n*** FIXED IN 1.5 ***\r\nFixed the unlimited magicka bug for healers. They run out of magicka normally now \r\n-- no more \\\"god\\\" healers -- now they can die!  \r\n\r\n*** IMPORTANT!!! *** : If you\\'re updating from older versions – please dismiss any of the\r\nfollowing characters and get all your gear from them: Skjoldran, Drynger, Ra-Faraago,\r\nForoch, Jo\\'Zirkar and Jzir-Dar.  They have been “reset” in this version – you will lose them as \r\ncurrent followers.  They will revert back to their normal paths.  You can still get them as new\r\nfollowers but you will have to manually find them again.\r\n\r\n------------------------------------------------------------------------------------------------------\r\n\r\nList of New Characters (Potential Followers)\r\n\r\nv1.0\r\nAretha Belven - Dunmer Conjurer/Archer in The Bannered Mare (Whiterun)\r\nAvik Tralan - Redguard Assassin in The Frozen Hearth (Winterhold)\r\nElandra Firan - Altmer Lightning Mage in Windpeak Inn (Dawntar)\r\nEnlir Ninzur - Nord Warrior (Bow/Greatsword) in Winking Skeever (Solitude)\r\nFervas Sirduin - Dunmer Frost Mage in Braidwood Inn (Kynesgrove)\r\nGalmir Tralan - Redguard Assassin in Winking Skeever (Solitude)\r\nKreda Elkind - Nord Dual-wield Swordmaster in Frostfruit Inn (Rorikstead)\r\nMaya Erathal - Nord Warrior (Bow/Shield/Sword) in Winking Skeever (Solitude) *QUEST*\r\nMilette Rikku - Breton Battleaxe Barbarian in Windpeak Inn (Dawnstar)\r\nM\\'kela Unbari - Altmer Fire Mage in The Frozen Hearth (Winterhold)\r\nRondo Iseldor - Nord Warrior/Shield Expert in Silver-blood Inn (Markarth)\r\nYngvor Skyguard - Nord Dual-wield Axe Warrior in The Bannered Mare (Whiterun)\r\n\r\nv1.1\r\nAganir Balbus - Nord Fist Fighter in Sleeping Giant Inn (Riverwood) \r\nGrutak the Barbarian - Orc Battleaxe Warrior in Braidwood Inn (Kynesgrove) *QUEST*\r\nTelani Bluelion - Altmer Healer at Sleeping Giant Inn (Riverwood)\r\n\r\nv1.2\r\nAelwin Traven - Redguard Frost Mage *TRAVELING*\r\nDravynea Yenabi - Dunmer Healer *TRAVELING*\r\nJo\\'Zirkar - Khajiit Mage Healer *TRAVELING*\r\nDrynger Pure-Hearth - Nord Archer *TRAVELING*\r\nEloe Loran - Imperial Spellsword in the Old Hroldan Inn (The Reach)\r\nForoch Yellowleaf - Bosmer Lightning Mage *TRAVELING*\r\nGwynvyra Rane - Breton Necromancer in Vilemyr Inn (Ivarstead)\r\nJee-Shei - Argonian Rogue in Vilemry Inn (Ivarstead)\r\nJ\\'Zir-Dar - Khajiit Rogue *TRAVELING*\r\nMartina Felanis - Imperial Thief in The Bee and Barb (Riften)\r\nRa-Faargo - Khajiit Conjurer/Archer *TRAVELING*\r\nSabryna Valerius - Imperial Battlemage in Frostfruit Inn (Rorikstead)\r\nSkjoldran the Committed - Nord Warrior (Bow/Greatsword) *TRAVELING*\r\nTeeka-Dulei - Argonian Warrior *TRAVELING*\r\nToldas the Seed - Bosmer Archer in Windpeak Inn (Dawnstar)\r\n\r\nv1.3\r\nAnja Black-Dagger – Nord Thief/Healer at the Ragged Flagon or in the Cistern (Riften)\r\nClemick Lochar – Breton Mage/Healer at the Four Shields Tavern (Dragonbridge)\r\nDo’Shanir The Cook – Khajiit Dual-wield Warrior at the Four Shields Tavern (Dragonbridge)\r\nEyja Sunset-Blade – Nord Thief at the Ragged Flagon Cistern (Riften)\r\nMordyctus Ephine – Breton Thief at the Ragged Flagon or in the Cistern (Riften)\r\nRosanti Anisern – Imperial Thief/Conjurer at the Ragged Flagon (Riften)\r\nS’razim-Dar – Khajiit Thief at the Ragged Flagon or in the Cistern (Riften)\r\nThadar Felder – Dunmer Thief at the Ragged Flagon or in the Cistern (Riften)\r\nUkalei-Zish – Argonian Duel-wielding Thief at the Ragged Flagon (Riften)\r\nVoltan Meacius – Imperial Thief at the Ragged Flagon (Riften)\r\n\r\nv1.4\r\nAganoth – Bosmer Assassin / Summoner at the Nightgate Inn (The Pale)\r\nBleekius – Argonian Battlemage at the Moorside Inn (Morthal)\r\nDo’Virran – Khajiit Warrior / Shield / Restoration at the Nightgate Inn (The Pale)\r\nFairelle – Altmer Archer *EXPLORING* (The Pale)\r\nFjorStaag Fire-Eater – Nord Fire Mage at Dead Man’s Drink (Falkreath)\r\nKorslik Strong-Arm – Nord Warrior at Dead Man’s Drink (Falkreath) *BODYGUARD*\r\nRa’Jhan – Khajiit 2H Warrior at Dead Man’s Drink (Falkreath)\r\nSuwen – Bosmer Archer / Restoration at Moorside Inn (Morthal)\r\nSanathyn Delas – Dunmer Mage / Healer *EXPLORING* (Haafingar)\r\nUrsila The Seeker – Nord Necromancer at the Old Hroldan Inn (The Reach)\r\n\r\nv1.6\r\nFrancine Armonet – Breton Dual-wield 1H Warrior at the Blue Palace (Solitude)\r\nDrilnevi Orendas – Dunmer Dual-wield 1H Warrior *EXPLORING* (The Pale)\r\nTobir – Beggar at the Wind District (WhiteRun)\r\nBelnir The Old – Nord Farmer at the Merryfair Farm (near Riften)\r\nBatto Signirius – Imperial Farmer at Katla\\'s Farm (near Solitude)\r\nToulin Previa – Imperial Farmer at Loreius\\' Farm (near Whiterun)\r\nPeline Traleci – Imperial Bard at the Bard\\'s College (Solitide) \r\nImeta The Swan – Nord Bard at the Bard\\'s College (Solitide)\r\nConstin Valinius – Imperial Bard at the Bard\\'s College (Solitide)\r\nDavin Ulrith – Dunmer Worker at the Worker\\'s House (Mixwater Mill)\r\nHaega Gold-will – Nord Hunter at the Candleheart Hall (Windhelm)\r\nHeimskar Green-leaf – Nord Warrior at the Candleheart Hall (Windhelm)\r\nGraloth the Drunk – Nord Dual-wield Sword Master at the Candleheart Hall (Windhelm)\r\nFjolrich Flame-Soul – Nord 1H Warrior at the Candleheart Hall (Windhelm)\r\nRi\\'Vassen – Khajiit Apprentice Mage at the Arcanaeum (College of Winterhold)\r\nS\\'Dosi – Khajiit Apprentice Mage at the Arcanaeum (College of Winterhold)\r\n\r\nCollege of Winterhold Quest “Mira\\'s Revenge”:\r\nCrendal Greenwing – Breton Illusion Mage/Bow at the Hall of Attainment\r\nHuurweyn Brightstar – Bosmer Conjurer/Illusion Mage at the Hall of Attainment\r\nPiradeeh Twice-Bitten – Argonian Spellsword at the Hall of Attainment\r\nIdros Uvaram – Dunmer Lightning Mage at the Hall of Attainment\r\n------------------------------------------------------------------------------------------------------\r\n\r\nNotes:\r\n\r\n>> while this mod adds new characters to the game, it does not give you the ability to have \r\nmultiple followers \\\"all at the same time\\\" -- please use another mod for that. An example is \r\nUFO (Ultimate Follower Overhaul) by fLokii which I use when testing this mod.\r\n\r\n>> By default, followers are not essential (they can die), as they really should be -- keeps it \r\nreal and keeps it fun – however – see important note below since default behavior is “can\\'t \r\ndie while following player”. \r\n\r\n*** FOLLOWER DEATH ***  Please note that the vanilla follower system in skyrim makes \r\nthe followers in this mod “protected” when they are following you – which means they do not\r\ndie and they can only be killed by the player. I\\'m using another mod (i.e. UFO) that overrides\r\nthis and so these followers actually die in combat while follower. \r\n\r\n>> Followers marked *TRAVELING* travel randomly to and stay in various Skyrim inns (17\r\ninns in total). You may also meet them while they\\'re on the road (most of them travel on the\r\nmain roads). Adds more life to the world and random encounters are definitely fun.\r\n\r\n>> Followers marked *EXPLORING* travel randomly to different Skyrim landmarks, normally \r\nin one hold/area only. You will encounter them in the wilderness (note that they do not use\r\nmain roads though). \r\n\r\n>> Followers marked *BODYGUARD* are not available as followers initially. They will follow\r\ntheir master and remain loyal – if their master dies, you can have them as your follower. \r\nIf you engage combat with their master though, they will attack you too.\r\n\r\n>> The followers in the Ragged Flagon and Cistern are not yet full-fledged members of the \r\nThieves Guild (they are applicants). Assaulting them will not impact your standing in the guild.\r\n\r\nThe followers in this MOD have varying levels, fighting style, spells, weapons, behavior, \r\nloot and backstories. For example:\r\n\r\n>> Galmir and Avik will always cast invisibility during combat - fun to watch. Try punching\r\nthem and watch them disappear.\r\n\r\n>> Healers will try to heal themselves and the player when they are hit, or when entering\r\ncombat.  Some healers (like Jo\\'Zirkar) will also restore your Magicka -- great for spellcasters!\r\n\r\n>> Grutak is not immediately a follower -- you must finish his quest first. Finishing the quest\r\nnot only grants you a new follower, you gain a reward and gain access to orc strongholds too \r\n(if you don\\'t have access yet).\r\n\r\n>> Huurweyn, Crendal, Piradeeh and Idros from the College of Winterhold only become\r\nfollowers upon completion of the quest “Mira\\'s Revenge”. \r\n\r\n>> Maya has been given a sum of gold to distribute as reward to adventurers who can help \r\nher free Skyrim from bandit leaders. This is a repeatable, unlimited quest and it encourages \r\nyou to explore different areas. You can get quests from her, or have her as a follower, or both \r\n-- just don\\'t let her die!  \r\n\r\n>> This mod also adds some items in the world (stuff like notes/chests/etc. belonging to the \r\ncharacters).  More will be added as backstories for characters are completed.\r\n\r\n------------------------------------------------------------------------------------------------------\r\n\r\nHow to Install: \r\n>> (manually downloaded) extract all files to your Skyrim \\\"Data\\\" directory.\r\n>> (steam workshop) just click the subscribe button\r\n>> after installing (or updating) – save the game with the mod and then load your game.  \r\nThis will ensure all dialogues for quests appear normally.\r\n\r\nUpdating old versions:\r\n>> (manually) overwrite all existing files with the files from the archive as you extract\r\n>> (steam workshop) updates happen automatically if you\\'re subscribed\r\n\r\nIf you lost your follower after an update:   \r\n>> this happened for some traveling followers – the only fix is to manually install an old\r\nversion (i.e. 1.4 from nexus), get all your gear, then update to the new version.  \r\n\r\nCompatibility:  Compatible with UFO, but not yet tested with other multiple followers mod.\r\n\r\nConflicts: None known. \r\n\r\nFuture updates: \r\n>> lots and lots more potential followers to fill in the Skyrim world. why? because we can!\r\n>> more backstory told through notes, items, chests, belonging to the characters.\r\n>> more unique behavior and quests\r\n\r\n------------------------------------------------------------------------------------------------------\r\n\r\nChange log:\r\nv1.0 [8/15/12] - initial release with 12 followers + 1 repeating quest (Maya)\r\nv1.1 [8/17/12] - tweaks, adjusted rewards, fixed facegen, added some stories, 3 new \r\nfollowers, new quest (Grutak)\r\nv1.2 [8/20/12] - added 15 more followers and introduction of followers who travel and stay\r\nrandomly from inn to inn, some tweaks and story elements added\r\nv1.3 [8/23/12] – fixed possible “you need to leave” bug, added 10 more followers mostly in\r\nthe Thieves Guild HQ, balancing tweaks and story items\r\nv1.4 [8/28/12] – fixed bug on conjurers, +10 followers, introduced exploring followers and \r\nbodyguards\r\nv1.5 [9/2/12] – fixed several minor bugs, including the unlimited magicka bug for healers\r\nv1.6 [10/20/12] – balancing tweaks, minor fixes, more story elements, new quest to obtain\r\nfollowers from the College of Winterhold, +20 followers\r\n\r\n------------------------------------------------------------------------------------------------------\r\n\r\n*** IMPORTANT *** If quest dialogues are not appearing when you first install or \r\nupdate the mod, save your game and reload your game -- that normally fixes it.\r\n\r\n*** A NOTE ABOUT MAGIC USERS*** : It is recommended that you use magic-based \r\nfollowers at higher player levels.  Magic users (i.e., conjurers) from this mod may \r\nnot behave as intended when used at low player levels. While they may know particular\r\nspells, they may not be at the right level (and therefore enough skill level) to cast them. \r\n\r\n-----------------------------------------------------------------------------------------------------\r\nFeedback and ideas very welcome.\r\n>> Any bugs? Problems? Conflicts? Too overpowered? Too weak?\r\n>> What kind of follower do you want to see next?\r\n>> Who is your favourite follower? \r\n\r\nWant to help out?\r\n>> Ideas for a character or custom/specific behaviour?\r\n>> Do you want to help write character background, stories or quests?\r\n>> Let’s populate Skyrim with interesting characters!!!\r\n\r\n------------------------------------------------------------------------------------------------------\r\nAcknowledgements\r\n\r\nLE-BUBBLES - for ideas and characters for the College of Winterhold quest. \r\nEveryone - for your votes, ratings, endorsements and feedback!\r\nMany many thanks!!!",
  "categoryId": "66",
  "version": "1.6",
  "author": "JNL",
  "createdUnix": "1345046496",
  "updatedUnix": "1350733628",
  "containsAdultContent": false,
  "uploadedBy": "jaizel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81820",
      "name": "Lots More Followers Initial Launch",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2660",
      "fileName": "Lots More Followers-22486-1-0.zip",
      "uploadedUnix": "1345046846",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8210a6c18f8ee3b677fda7c1d6d5f271633b79fad0dafa2e0ce8eb8da9781f48/analysis/1407098891/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lots%20More%20Followers-22486-1-0.zip?fid=81820&ttl=1535792052&ri=8192&rs=8192&setec=997189639354d5a166d304dabcc86125"
    },
    {
      "fileId": "84857",
      "name": "Lots More Followers 1 dot 4",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9639",
      "fileName": "Lots More Followers Main File-22486-1-4.zip",
      "uploadedUnix": "1346172946",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/479002b9bd3619cc4a534c39b007ef9c96dbf12e69223249f771a206c18b64cb/analysis/1407128286/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lots%20More%20Followers%20Main%20File-22486-1-4.zip?fid=84857&ttl=1535792053&ri=8192&rs=8192&setec=003db63fe8e7ce12a34be6befb1a9725"
    },
    {
      "fileId": "86185",
      "name": "Lots More Followers Previous Version",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8652",
      "fileName": "Lots More Followers Main File-22486-1-5.zip",
      "uploadedUnix": "1346678255",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/385943bc7c990312089fe21b1879960ae7f8b11b53f79980cb5ae8fb0e057c4d/analysis/1407143107/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lots%20More%20Followers%20Main%20File-22486-1-5.zip?fid=86185&ttl=1535792053&ri=8192&rs=8192&setec=35ffd3168ebe6b76c927ec4a6b146adf"
    },
    {
      "fileId": "94767",
      "name": "Lots More Followers Main File",
      "version": "1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14711",
      "fileName": "Lots More Followers Main File-22486-1-6.zip",
      "uploadedUnix": "1350733628",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/bc3a3f2d3987946fcac31efbc581ba46ed03b0bcdef8575f2b91e481c6e0779b/analysis/1407229690/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lots%20More%20Followers%20Main%20File-22486-1-6.zip?fid=94767&ttl=1535792054&ri=8192&rs=8192&setec=949236c11e88748c47ec584cd919e93f"
    }
  ]
}