{
  "modId": 22480.0,
  "modName": "Bat Travel Vampire Power for Dawnguard Spanish Translation",
  "summary": "Traducción al español del mod Bat Travel creado por Dydimus Ei.",
  "descriptionHtml": "Traducción al español del mod Bat Travel creado por Dydimus Ei.\r\n\r\n[color=mediumspringgreen]ACTUALIZADO A LA VERSIÓN 2.0a 04/01/13[/color]\r\n\r\nSeguir las instrucciones de instalación en: [url=http://skyrim.nexusmods.com/mods/21689]Bat Travel Vampire Power for Dawnguard DLC[/url].\r\n\r\nHe añadido la opción de bajar por NMM.\r\n\r\nIré actualizando la traducción según vaya sacando nuevas versiones pero tampoco esperéis que las tenga en seguida, paciencia que tarde o temprano lo colgaré porque basta que traduzca una versión para que al día siguiente ya exista una nueva xD.\r\n\r\nSi hay algún problema no dudes en comentarlo.\r\n\r\n\r\n\r\n\r\n[b]Cambios en las versiones desde la 1.7 a la 2.0a. Traducido directamente desde el link de arriba.[/b]\r\n\r\n\r\nNota: siento la tardanza.\r\n\r\nv2.0a\r\n\r\n- El menú de destino se ha arreglado\r\n- Se ha eliminado código inservible de la versión 3 de Nube de murciélagos.\r\n\r\nv2.0\r\n\r\n- Añadidas tres versiones de Nube de murciélagos para satisfacer los gustos de todo el mundo. Puedes cambiarlos en el menú de opciones.\r\n - Versión 1: versión predeterminada usada en las últimas actualizaciones.\r\n Pros: Volar es más fácil. Sin errores visuales. Contras: Clipping. Es más difícil la sincronización entre los murciélagos y el jugador.\r\n - Versión 2: la versión vieja con invisibilidad.\r\n Pros: Volar es más fácil. Los murciélagos se sincronizan con el jugador. Contras: Clipping. Errores visuales.\r\n - Versión 3: versión \\\"Suelo invisible\\\".\r\n Pros: Sin clipping. Sin errores visuales. Contras: Los murciélagos y el jugador difícilmente sincronizables. No es tan fácil \\\"volar\\\".\r\n - Esa es la actualización final. Los errores y correcciones se harán como es lógico, pero no se van a añadir nuevas características.\r\n \r\nv1.95\r\n\r\n - Se ha eliminado una línea del código que hacía que el volar fuera un poco \\\"rígido\\\". Aunque ha vuelto el volar \\\"a la deriva\\\" hacia abajo...\r\n - Se han cambiado los botones de \\\"Volar a localización\\\" y \\\"Configurar destino\\\".\r\n - Añadido un uso pequeño de la magia cuando se usa Nube de murciélagos durante el combate.\r\n - El jugador ahora puede usar su propio botón de grito para la desactivación de Nube de murciélagos. ATENCIÓN: En el combate, tanto si se usa magia o ataques, no es su propósito durante el vuelo. Si lo intentas, y se produce un error, no me vengas llorando luego. \r\n\r\nv1.9\r\n\r\n- Finalmente se ha creado un método para el Vuelo libre que no produce el bug de invisibilidad. No está tan limpio como me gustaría, pero hace su función.\r\n- Añadida una animación corta para mejorar un poco Nube de murciélagos.\r\n- Se puede activar o desactivar la animación en las opciones.\r\n- He hecho un ajuste en el código para eliminar el flotar hacia abajo.\r\n\r\nv1.8b\r\n\r\n- Se ha corregido un bug. Eliminado completamente.\r\n\r\nv1.8\r\n\r\n- Se ha fusionado el Configurar el destino con Viaje de murciélagos.\r\n- La opción \\\"Volver\\\" se ha movido al menú principal y funciona en todos los tipos de vuelo (Excepto en Vuelo libre).\r\n- Por defecto Nube de murciélagos ahora consume 2 puntos de magia por segundo, se puede desactivar.\r\n- Hay una opción para bloquear el uso de Viaje de murciélagos en presencia de gente. No me gusta mucho el resultado final. Funciona, pero no mola tanto. Está desactivado por defecto.\r\n- Los seguidores ahora se teleportan a tu localización cuando uses Viaje de murciélagos. (Al menos el primer seguidor se teleporta. He tenido problemas con Serana como segundo seguidor).\r\n- Añadido Valle olvidado y Patio del Castillo Volkihar (No intentes volar fuera del patio. En serio, no forma parte de Tamriel...) como lugares que Viaje de murciélagos y Nube de murciélagos pueden usarse.\r\n- Desactivadas las habilidades de combate cuando se usa Nube de murciélagos. Significa que por defecto el botón de Grito (Z) está también desactivado, sin embargo al pulsarlo sigue desactivando el vuelo. Es posible que tengas que mantenerlo pulsado durante un segundo, pero no se volverá a activar.\r\n\r\n\r\n\r\n\r\nMod created by Dydimus Ei. \r\nAll the credits goes to him.\r\nI have permission from the mod author to upload this file.",
  "categoryId": "42",
  "version": "2.0a",
  "author": "Dydimus Ei",
  "createdUnix": "1345041598",
  "updatedUnix": "1357309853",
  "containsAdultContent": false,
  "uploadedBy": "KitiFolien",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81804",
      "name": "Bat Travel",
      "version": "1.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40",
      "fileName": "Bat Travel-22480-1-7.rar",
      "uploadedUnix": "1345041732",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/f1b04999fcbd631f16b5322ffd9cd09f3fae410282c4b44dc09ce0e34965b8e9/analysis/1407098707/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bat%20Travel-22480-1-7.rar?fid=81804&ttl=1535792043&ri=8192&rs=8192&setec=7f4d32bbbad00a858db54e1f6f1a83d7"
    },
    {
      "fileId": "83437",
      "name": "Bat travel v1_9",
      "version": "1.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "42",
      "fileName": "Bat travel v1_9-22480-1-9.rar",
      "uploadedUnix": "1345643290",
      "modVersion": "1.9",
      "virusScanUrl": "https://www.virustotal.com/file/f21cb0e3739b459d65c46e4325b603ac486c14a955f435a74742517041d07d4a/analysis/1407114306/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bat%20travel%20v1_9-22480-1-9.rar?fid=83437&ttl=1535792043&ri=8192&rs=8192&setec=9cbdf1b044c4e71778b1cf4c98717cd7"
    },
    {
      "fileId": "109483",
      "name": "Bat Travel v2_0a",
      "version": "2.0a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "45",
      "fileName": "Bat Travel 2_0a-22480-2-0a.rar",
      "uploadedUnix": "1357309853",
      "modVersion": "2.0a",
      "virusScanUrl": "https://www.virustotal.com/file/3e5ab0c6605c890deb28dce7172e8a85b4f6d0a9a6e6bce4a3f30b2e77c68ff9/analysis/1407336250/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bat%20Travel%202_0a-22480-2-0a.rar?fid=109483&ttl=1535792043&ri=8192&rs=8192&setec=2ecd716227f5ffb224cb63b391b14c56"
    }
  ]
}