{
  "modId": 22499.0,
  "modName": "Stormreach Mansion",
  "summary": "Lonely mansion in middle of snowy northern wasteland.",
  "descriptionHtml": "--------------------------------\r\nIntroduction\r\nLonely mansion stands close to the shores of northen sea, surrounded by vast snowy wasteland.\r\nIt seems to be well stocked for winter.... Yet noone lives inside and doors are not locked.\r\nWho would ever want to live alone in middle of nowhere?\r\n\r\n--------------------------------\r\nAbout the modification\r\n\r\nAs i always do i made this file primarily for my personal use and decided to upload it in case someone wants to use it too. This means i will not support this file once i lose interest in skyrim or this house.\r\nAlso i did not meant this house to become popular. While popularity would be bonus i guess i do not really care about it.\r\nUse this file at your own peril. It may be full of evil, evil bugs.\r\nI do not take requests.\r\n\r\n--------------------------------\r\nAbout the house\r\n\r\nThis house has, aside for being slightly bigger on the inside inherently caused by resources offered with creation kit (inside walls and such), realistic dimensions.\r\nIt is made with combination of two houses that are connected to each other.\r\nThere is a diary that explains how this mansion came to be in middle of nowhere, how owner lived there and why he left it to anyone that would find it. I hope this will make it slightly immersive.\r\nThe mansion is situated west of Winterhold and just north of Saarthal.\r\n\r\nThis house includes: Master bedroom, guest bedroom, study/library, laboratory, dinner hall, kitchen, living room and spare room that was used by one of the guests.\r\nOutside: Forge, smelter and other facilities for smithing, mostly inside of shack... Outhouse and vast amounts of firewood. \r\n\r\n--------------------------------\r\n\r\nIf you like realistic dimensions on the inside same as outside, check my Proper Honeyside and Shorter Breezehome\r\nI also uploaded small, cozy but well rounded house named Woodside.",
  "categoryId": "67",
  "version": "0.8",
  "author": "TheClone",
  "createdUnix": "1345065441",
  "updatedUnix": "1345065534",
  "containsAdultContent": false,
  "uploadedBy": "TheClone2435",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81884",
      "name": "Stormreach Mansion",
      "version": "0.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "170",
      "fileName": "Stormreach Mansion-22499-0-8.zip",
      "uploadedUnix": "1345065534",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/396100c8fd914776ddae756c0968ab56900181b2906dc2a5eb7d897563fa6bca/analysis/1407099625/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stormreach%20Mansion-22499-0-8.zip?fid=81884&ttl=1535792070&ri=8192&rs=8192&setec=3fffd262c50cf79abc5eb776bb36b1b4"
    }
  ]
}