{
  "modId": 22496.0,
  "modName": "Bluecreek Estate",
  "summary": "Purchasable remote estate situated on the northern banks of Lake Ilinalta, complete with guards, servants, a woodmill, hunter&#39;s shack, goldmine, hot tub and treasure vault. The mine provides a source of income for the player. The mod is highly detailled, fully navmeshed, optimized and features all crafting necessities.",
  "descriptionHtml": "[center][color=#1e84cc]STEAM[/color]: http://steamcommunity.com/sharedfiles/filedetails/?id=93816302\r<br />\r<br />[color=#1e84cc]OPTIONAL[/color]: I have uploaded a version altering the lighting templates: use this file if you think the custom interior lighting is too dark due to a realistic lighting mod or an ENB.[/center]\r<br />\r<br />\r<br />[center]\r<br />[b][size=4][color=#1e84cc]W[/color]elcome[/size][/b][size=4] to the remote grounds of [/size][i][color=#1e84cc][size=5]Bluecreek Estate[/size][/color][/i][size=4], a secluded player home situated on the beautiful north-eastern shore of lake Ilinalta.[/size]\r<br />\r<br />[youtube]8TmDoSQaWZQ[/youtube]\r<br />[size=1]This video was shot by hodilton, thank you&#33; It&#39;s a video of the very first version and does therefor not include the vault or the hot tub.[/size][/center]\r<br />\r<br />[size=2]\r<br />The estate includes a woodmill, goldmine, hunter’s shack, servant quarters, hot tub, treasure vault and the main residence. All of this can be yours if you’ve got the gold – the mine even provides a source of income to gain some of your expenses back. I’ll let the screenshots do most of the talking for me, but some necessary information is listed below. Please note that this is a highly detailed, complete and lore-friendly modification. Both exterior and interior cells are fully navmeshed (and thus follower-friendly) and I’ve tried my very best to make the whole thing fit seamlessly into the game world.\r<br />\r<br />[b][u][color=#1e84cc]F[/color]eatures[/u][/b]:[/size][list][*][size=2]A long entranceway[/size][/*]\r<br />[*][size=2]Woodmill[/size][/*]\r<br />[*][size=2]Goldmine (source of income)[/size][/*]\r<br />[*][size=2]Hunter’s shack[/size][/*]\r<br />[*][size=2]Servant quarters[/size][/*]\r<br />[*][size=2]Hot tub[/size][/*]\r<br />[*][size=2]Treasure vault[/size][/*]\r<br />[*][size=2]Main residence (incl. entry hall, living quarters, reading room, alchemy and enchanting room, dining room, bar, follower room, armory, master bedroom, attic)[/size][/*]\r<br />[*][size=2]5 servants; a hunter, gardener, lumberjack and 2 miners[/size][/*]\r<br />[*][size=2]3 guards[/size][/*]\r<br />[*][size=2]All crafting, alchemy and enchanting necessities[/size][/*]\r<br />[*][size=2]Overall high attention to detail[/size][/*]\r<br />[*][size=2]Interior optimization[/size][/*]\r<br />[/list][size=2]\r<br />\r<br />[b][u][color=#1e84cc]L[/color]ocation[/u][/b]:\r<br />The estate sits on the north-eastern banks of lake Ilinalta, in the Falkreath hold. There are two map markers, one near the entrance and one    ﻿directly in front of the main residence, but initially they are [b]not visible[/b]. In order to get there, it is easiest to travel to the Guardian Stones, take    ﻿the road up the hill, take the first road on the right and follow it downhill until you see two similar statues on your right hand side. Here starts the    ﻿entranceway to the estate.\r<br />\r<br />\r<br />[b][u][color=#1e84cc]H[/color]ow to acquire[/u][/b]:\r<br />﻿Make your way to the main residence atop the hill; there you will find a clue as to how to acquire the building. When you get to the salesman, be    ﻿sure to bring enough gold (there’s quite a price tag, depending on your speech skill) and ask him what he’s got for sale. You ‘buy’ a purchase    ﻿contract.\r<br />\r<br />\r<br />[b][u][color=#1e84cc]S[/color]torage[/u][/b]:\r<br />﻿All containers are safe for storage, including those outside, except for the containers in the servant quarters.\r<br />\r<br />\r<br />[b][u][color=#1e84cc]D[/color]escription of the property[/u][/b]:\r<br />\r<br />[b]Main residence (player home)[/b]:﻿\r<br />On the ground floor, the player home features a small entrance hall, a spacious yet cozy living room, a reading room, alchemy- and enchanting ﻿necessities and a dinner room. Upstairs, we find a personal bar area, a small room situated for a housecarl type, a vestibule overlooking the living ﻿room, an armory complete with  weapon racks, plaques and a mannequin, and the master bedroom. The master bedroom provides access to a small ﻿passage leading to the building’s attic, which has been set up as a personal study area. The Dovahkiin needs to study, right? Take a look at the ﻿screenshots for details.\r<br />[b]\r<br />﻿Goldmine:﻿[/b]\r<br />The goldmine consists of an entrance hallway, two smaller rooms and a central chamber, connected through short narrow passages. In this central﻿ chamber, you’ll find a treasure chest which stores the daily output of the mine; this may include gold ores, gems, or even mushrooms or moss the ﻿miners collected.\r<br />\r<br />[b]﻿Servant Quarters:[/b]\r<br />﻿The servant quarters is little more than a two-level farmhouse located on the eastside of the estate grounds. In here, most of the servants and    ﻿guards that come with the estate sleep, eat and kill some time when they are not at work. [b]Caution: [/b]the containers in this place will respawn. Do    ﻿not fill them up with your valuables.\r<br />\r<br />[b]﻿Exterior:[/b]\r<br />﻿The exterior of the estate contains a couple of places of interest; firstly, there is the small stable right next to the entrance. Your horse will be    ﻿placed in here when you fast travel (not mounted) to either of the two map markers. Secondly, the woodmill; to cut logs, yeah. Thirdly, there’s a    ﻿hunter’s shack on the island south of the mill where you can find a tanning rack. Lastly, a smithy can be found on top of the hill directly behind the    ﻿main residence. This place includes a forge, smelter, workbench, grindstone, practice dummy (to give that new sword a few swings) and another    ﻿tanning rack.\r<br />\r<br />\r<br />[color=#1e84cc]N[/color][u]PCs:[/u]\r<br />[/size][list][*][size=2]Aldo, Nord, Hunter. He can sell you hunting game and poisons.\r<br />[/size][/*]\r<br />[*][size=2]Layla, Breton, Gardener / Lumberjack. Will bring firewood uphill every day.\r<br />[/size][/*]\r<br />[*][size=2]Hides-Her-Ore, Argonian, Miner.[/size][/*]\r<br />[*][size=2]Maleethus, Argonian, Miner.\r<br />[/size][/*]\r<br />[*][size=2]Magronak, Orc, Lumberjack. Will guard the vault during the night.[/size][/*]\r<br />[*][size=2]Aelius, Nord, Sentry. He is an ex-legionnaire.\r<br />[/size][/*]\r<br />[*][size=2]Gromm, Nord, Sentry. Quite the brute without brains, but truehearted nonetheless.\r<br />[/size][/*]\r<br />[*][size=2]Nethwen, Wood elf, Sentry. Face-painted former treasure hunter who prefers to sleep in a tent underneath the stars.\r<br />[/size][/*]\r<br />[/list][size=2]\r<br />[/size][size=2]All sentries can be asked to follow the player.\r<br />\r<br />\r<br />[b][u][color=#1e84cc]F[/color]ollowers / spouses[/u][/b][u]:[/u]\r<br />The estate is follower-friendly (in the sense that it is fully navmeshed) but you cannot move your spouse here. The reason to not include this aspect comes from compatibility issues; in order to achieve this, one needs to edit a particular piece of default Bethesda dialogue. If you have another mod active (or more) that edit this same piece of dialogue, issues are inevitable. Instead, I recommend using another popular mod available here to be able to make your spouse live anywhere (see [u]recommended mods[/u]).\r<br />\r<br />\r<br />[b][u][color=#1e84cc]I[/color]nstallation[/u][/b]:\r<br />Unzip Bluecreek Estate.rar and place the files Bluecreek Estate.esp and Bluecreek Estate.bsa in your skyrim/Data folder.\r<br />\r<br />\r<br />\r<br />[b][u][color=#1e84cc]R[/color]ecommended mods[/u][/b]:\r<br />[/size][list][*][size=2]Spouses can live anywhere (http://skyrim.nexusmods.com/mods/11370), to be able to move your spouse in.\r<br />[/size][/*]\r<br />[*][size=2]Vanilla Mannequin Script Fix (http://skyrim.nexusmods.com/mods/10652), to prevent problems with default mannequins[/size][/*]\r<br />[/list][size=2]\r<br />[/size][size=2]\r<br />[b][u][color=#1e84cc]C[/color]ompatibility[/u][/b]:\r<br />The mod should be compatible with any other mod except those who edit the same exterior cells (those around DragonLair03 and east up to the Guardian Stones). Those mods may actually be compatible (you will have to see for yourself, I cannot test them all) as long as you place this mod [b]lower[/b] in your load order.\r<br />\r<br />\r<br />[b][u][color=#1e84cc]K[/color]nown issues[/u][/b]:\r<br />[/size][list][*][size=2]Floating grass and rocks; some people experience floating grass and small rocks around the estate - this is a Skyrim bug, for which the fix can be found here: http://www.creationkit.com/Floating_Grass_Fix\r<br />[/size][/*]\r<br />[*][size=2]Sometimes, for some strange reason, an NPC may &#39;fall through&#39; a static object (usually it concerns a vanilla Skyrim walkway).\r<br />[/size][/*]\r<br />[*][size=2]Vanilla mannequins sometimes tend to take on awkward poses and might wander off and what not. Use the Vanilla Mannequin Script Fix to prevent this if you experience any problems.\r<br />[/size][/*]\r<br />[*][size=2]The estate is located rather close to a dragon lair. Chances are you may have killed the dragon there, and there is a small chance you might find its carcass lying somewhere on the estate grounds. Open the console, click the carcass and type ‘disable’ to remove it.[/size]\r<br />[/*]\r<br />[*][color=#ff7700][size=2]BOSS might give you an error message concerning deleted navmeshes. Ignore this, as it should not be a problem as long as you do not have any mods installed that draw on the original navmeshes in the direct surrounding of the estate&#33; Yes, I have deleted the Bethesda navmeshes in the estate area because the terrain has been altered up to a certain point where it was simpler and faster for me to redo the navmeshes from scratch rather than editing the existing ones. In short, there are new ones in place.[/size][/color][/*]\r<br />[/list][size=2]\r<br />\r<br />[b][u][color=#1e84cc]W[/color]alkthrough (only read in case of problems)[/u][/b]:\r<br />[spoiler]Travel to Bluecreek Estate and slay the bandits who are trying to break in. It is important to kill the Bandit Chief, as his death will initiate a tiny quest. Search his body and find the &#39;Bandit Chief´s Letter&#39;. Once you do, your objective will involve finding the salesman who currently owns the estate. Find him in the Dead Man&#39;s Drink Inn in Falkreath (he will be there regardless of whether or not you dealt with the bandits), ask him what he has got for sale, and buy the &#39;Bluecreek Estate Purchase Contract&#39;. That should do it.[/spoiler]\r<br />\r<br />\r<br />[color=#1e84cc]PLEASE NOTE[/color]: the mod is currently available for download, and will be, but I cannot truly support it anymore due to lack of time; forgive me for not replying.\r<br />\r<br />LOG:\r<br />1.0: Initial release\r<br />1.01: added &#39;well rested&#39; bonus for the estate beds\r<br />1.1:[*] Added a hot tub, directly behind the main residence\r<br />[*] Added a treasure vault, also behind the main residence\r<br />[*] Added a new back door\r<br />[*] Added a new servant, an Orc named Magronak\r<br />[*] Added some cooking storage near the fireplaces\r<br />[*] Moved the smelter down to the mine\r<br />[*] Replaced the bookcases with bookshelves\r<br />[*] Navmesh optimization\r<br />[*] Various small bugfixes, optimizations and additions\r<br />1.1.1: Fixes an ownership issue with the treasure vault\r<br />1.1.2: Fixes the bug in the quest where the letter would either not appear on the bandit chief&#39;s body, or reading it would not advance the quest.\r<br />1.2: Fixes all dirty edits, rotates a chest in the vault and improves the look of the attic trapdoor.\r<br />\r<br />\r<br />[/size][center][i][b][color=#1e84cc][size=2]All right, that’s it, enjoy&#33;[/size][/color][/b][/i][/center]",
  "categoryId": "68",
  "version": "1.26",
  "author": "Tom",
  "createdUnix": "1345058077",
  "updatedUnix": "1428167381",
  "containsAdultContent": false,
  "uploadedBy": "Tomnl",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123645",
      "name": "Bluecreek Estate v1.2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1817",
      "fileName": "Bluecreek Estate v1.2-22496-1-2.rar",
      "uploadedUnix": "1408888155",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/69b653437ae16aa2f1d860d947842050a5caf599401be6af76c2addfce2facc4/analysis/1408888269/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bluecreek%20Estate%20v1.2-22496-1-2.rar?fid=1000123645&ttl=1535792066&ri=8192&rs=8192&setec=87ff23535b7c6a99339cc5b72b9dcbb9"
    },
    {
      "fileId": "1000154258",
      "name": "Bluecreek Estate Vanilla Lighting",
      "version": "1.25",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1080",
      "fileName": "Bluecreek Estate Vanilla Lighting-22496-1-25.rar",
      "uploadedUnix": "1428167381",
      "modVersion": "1.25",
      "virusScanUrl": "https://www.virustotal.com/file/a4a68e6ca45e325aeeba57b22633cccde4a1bb3afbf0266fd1cbb5f427120627/analysis/1428167404/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bluecreek%20Estate%20Vanilla%20Lighting-22496-1-25.rar?fid=1000154258&ttl=1535792066&ri=8192&rs=8192&setec=a593df5e80d444108c359062ff868883"
    }
  ]
}