{
  "modId": 22508.0,
  "modName": "A simple and cozy player home",
  "summary": "Adds yet another player home into Skyrim with all the things an adventurer could need.",
  "descriptionHtml": "[b][center]PLEASE READ THE CHANGELOGS BEFORE UPDATING[/center][/b]\r\n\r\n[b][color=yellow][center]Remember to endorse if you like the home[/center][/color][/b]\r\n\r\n[b][color=orange]Who/What/When/Why/Bwah?:[/color][/b] Ok so maybe it isn\\'t quite so \\\"simple\\\"....This mod, as per many others out there, adds a player home to Skyrim. It has all the crafting tables one would need, it sports a dozen mannequins with weapon display racks and extra storage, Bookshelves, Dragon priest mask display, plenty of storage containers all of which should not reset their inventories, a bed, Jeeves!, and of course a few somewhat secret things. I will not tell you the entrance as I like discovery and it isn\\'t terribly hard to find, but one hint: new game players will have the easiest time if they pay attention. (if their new game play isn\\'t changed from the default.) The name of the location is just out of personal preference and coincidentally fits in certain circumstances, the file name was used to try and prevent mod conflicts (and its based on another game I enjoy) but felt using a different name for the in game location would be less awkward to the overall feel of Skyrim.\r\n\r\n[b][color=orange]Requirements:[/color][/b] Skyrim.esm and Update.esm and most likely you will need to have skyrim up to date. (which for steam occurs automatically in most cases)\r\n\r\n[b][color=orange]Installation:[/color][/b] Should work fine with NMM, if not (as I\\'m unsure as to how this whole uploading of mods works) the manual install is as simple as plopping the \\\"7th heaven home.esp\\\" file into your skyrim/data folder and turning it on via the data files option in the launcher or through NMM.\r\n\r\n[b][color=orange]Updating:[/color][/b] When using NMM just download the new version, click yes to overwrite the old file and you are done. Manual, one just needs to download the mod, navigate to skyrim/data and drop the new .esp into it and hit yes to overwrite. \r\n\r\n[b][color=orange]***WORD OF WARNING***[/color][/b] Updating should not make you lose any stored or displayed items, BUT I -strongly- suggest that before updating: you save your game, make a backup of the old .esp (or re-download the old .esp), update the file and see if things disappear. IF they do disappear, load the old .esp and your old save, grab up all of your items and gear, leave the home and save outside, exit the game and remove the mod, load the game and save again, then re-install the mod and put things back. I am not responsible for lost/destroyed items due to failure of properly backing up your saves/files. \r\n\r\n[b][color=orange]Uninstall:[/color][/b] Simply uncheck the box in your load list and/or delete the .esp file. **NOTE** Take any and all belongings you wish to keep out of the home before uninstalling. \r\n\r\n[b][color=orange]Compatibility:[/color][/b] Shouldn\\'t have any issues for compatibility as all it does is add an entrance into the world that hopefully doesn\\'t collide with any other mods out there. If you are running other player made mods, the cell for my interior is labeled EditorID= \\\"Home\\\" Name= \\\"Bat Haven\\\" so should any interior cells have these names as well there may be conflicts.\r\n\r\n[b][color=orange][center]There are some bugs that I was unable to resolve:[/center][/color][/b]\r\n[b][color=green]1:[/color][/b] Bookshelves used to make their contents disappear with constant use (was a skyrim problem and not my doing) but Im not sure if this is resolved or just not happening to me anymore. \r\n[b][color=green]2:[/color][/b] The mannequins have a habit of walking around sometimes (due to how their actor is made) It can lead to some funny situations but my fix to this has been to use [url=http://skyrim.nexusmods.com/mods/10652]Vanilla Mannequin Script Fix[/url]. ***Fixed maybe?***\r\n[b][color=green]3:[/color][/b] Loading this in the CK there are a number of errors and such that appear, short of remaking the entire home from scratch the, \\\"yes to all\\\" has been my best friend and doesn\\'t really break anything from what I\\'ve seen.\r\n[b][color=green]4:[/color][/b] Some weapon racks refuse to work, despite being done properly (gone through and re made the problematic racks a few different times) and I can\\'t seem to get them to work at all. So any help here would be appreciated! ***Fixed***\r\n[b][color=green]5:[/color][/b] Jeeves may seem smaller than a normal person, this is intended (if he isn\\'t small then don\\'t worry, its not that big of a deal, I just thought it\\'d be fun to have a small merchant) Though when he uses crafting tables he grows to normal size, this from what I can tell can\\'t be fixed as the tables have their own animation scripts and such.\r\n[b][color=green]6:[/color][/b] Some of the lighting may cause a dark area to flicker in on the walls/floors/roof. I\\'ve gone and tweaked the lighting but my efforts didn\\'t land the results I was hoping for (while keeping enough light to fit the mood I wanted)\r\n[b][color=green]7:[/color][/b] Any followers one may have will not come inside, I don\\'t know how to make them do so and didn\\'t really dig to find out how, but they do wait outside for you. ***Fixed***\r\n\r\n[b][color=orange]Changelog v1.1:[/color][/b] Fixed, or hopefully fixed, a few of the bugs I have above thanks to some helpful tips. Mannequins should not wander around, provided that the navmesh added beneath them does indeed prevent this, should they still wander use the aforementioned mod. The racks and displays all appear to work, however I did not have items in every one at the same time. Followers should follow you inside the home now.\r\n\r\n[b][color=orange]v1.2:[/color][/b] Adds another 12 mannequins with weapon displays (just like the main room, door is next to the golden dwemer door), adds a storage container next to the smelter, also adds storage via a hollowed out support pole next to the far left book case (its just a chest imbedded into the pole) for all those thieving types that need to stash their goods. The displays should work fine, however Ghostblade doesn\\'t like to display at all for me, and some shields have issues displaying correctly as well (Shield of Ysgramor being one of them). Adjusted lighting around the home, things should be a little brighter but not too much.\r\n\r\n[b][color=orange]v1.3:[/color][/b] Added a display room for the 9 main holds of Skyrim to show off their armor and shields. [b][color=orange]WARNING[/color][/b] I forgot to ensure that the 1.2 mannequin room was no respawn, So if you have items in this room please take all items out of the room before updating just to be safe. I apologize for this, I forgot about the whole respawning when making the new interior cell, both this and the hold display room is set to no respawn with this version. Added some display shelves in the chest area, in case the shelf above the chests is just too high to put things on.\r\n\r\n[b][color=orange]v1.3.5:[/color][/b] Fixed the light in the newer areas as it didn\\'t match the rest of the house, added a new effect to the rooms, added in a missing shelf in the hold room, a few more weapon racks in the main display areas as there was a disproportionate number compared to the mannequins, as well as a few other small tweaks.\r\n\r\n[b][color=orange]v1.4:[/color][/b] **Remove all books from shelves before updating to this version.** This update replaces the old bookshelves with ones that match the other in game homes. The shelves I made were all done by hand and I ended up placing some triggers wrong (or in the very least they differed from the other vanilla home shelves) They might have moved a smidge from their original placing but overall they should be about the same, hopefully shelves eating books wont occur anymore but I don\\'t know if that was my doing, or still something in the base game.\r\n\r\n[b][color=orange]v1.5:[/color][/b] Adjusted the treasury area a tiny bit and changed the hallway leading to the armories; moved some doors around and leaving room for future expansions (didn\\'t change the rooms themselves other than changing the doors to all look Dwemer, chests and mannequins/displays were left alone). The big change is adding in the teleportation room, which has stones that can take the player to each of the 9 main cities of Skyrim. When using the stones the game may seem to \\\"freeze\\\", at least it did this on the level 1 test guy, but don\\'t worry after a few moments the load screen should kick in and you will be fine. These are one way trips to the cities and they do not ask of you are sure, if you click it then you are going there. The intended port spots should be relatively good, unless you have a mod that somehow removes or covers up that particular spot. No I did not do one straight to the college of Winterhold as I would rather not deal with breaking any quest chains and such (like being forced to cast a spell when you first get to the bridge). A script conflict may arise due to one of the ones I made not ending in 01, hopefully this wont be a problem but should there be conflicts then I\\'m sorry but you will have to not take part in my teleport room. (And yes the room is kinda large but I like it that way). Sometimes the game will crash when teleporting, or at least it does on my save with my lots of mods. I suggest visiting the main cities at least once after updating to this version as it seems to help with this load crashing.\r\n\r\nI run with quite a few mods, but [url=http://skyrim.nexusmods.com/mods/9937]Jontes Better Alchemy Satchel[/url] is a small yet handy mod for those alchemists out there.\r\n\r\nThis is my first mod, nothing fancy but I hope it gives players what they want/need in a home. Any bugs or problems please post them in a non caps-lock decent manner and I will do my best to resolve them. ***However*** I feel this mod is as complete as I can get it with my limited CK skills and won\\'t pay too much attention to it, so do not rage at me if you want more or expect all sort of updates. I just wanted to share my creation with the public, but should anyone decide to modify/adjust/change my home for their own cause and upload it, all I ask is that I get credited for the parts that are my creation.",
  "categoryId": "67",
  "version": "1.5",
  "author": "Nisafei",
  "createdUnix": "1345071169",
  "updatedUnix": "1346821276",
  "containsAdultContent": false,
  "uploadedBy": "nisafei",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81906",
      "name": "Bat haven player home v1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "47",
      "fileName": "Bat haven player home-22508-1-0.zip",
      "uploadedUnix": "1345071330",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0458ccbc12784e28309e1241eac3cdf30dbfe448875530d1e5f4521406d654c9/analysis/1407099783/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bat%20haven%20player%20home-22508-1-0.zip?fid=81906&ttl=1535792079&ri=8192&rs=8192&setec=3a3c1fa4badd620285f143a026df6349"
    },
    {
      "fileId": "82108",
      "name": "Bat haven player home v1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "101",
      "fileName": "Bat haven player home v1_1-22508-1-1.zip",
      "uploadedUnix": "1345167542",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9af492bc7e8c6a4a0355d384cddde9cf318da68ddc27ae234fffbb1ffe40e315/analysis/1407101824/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bat%20haven%20player%20home%20v1_1-22508-1-1.zip?fid=82108&ttl=1535792079&ri=8192&rs=8192&setec=fd71a2b299b0d8716f13d41d27a65865"
    },
    {
      "fileId": "84934",
      "name": "Bat haven player home v1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "106",
      "fileName": "Bat haven player home v1_2-22508-1-2.zip",
      "uploadedUnix": "1346197214",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/f71eac94ce3415c96a8a7bf0153c4eb6015f25fcadb2bc96840d19eff4c290be/analysis/1407129008/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bat%20haven%20player%20home%20v1_2-22508-1-2.zip?fid=84934&ttl=1535792080&ri=8192&rs=8192&setec=5e84a31a6bf7470a6f2fa7c18245b77e"
    },
    {
      "fileId": "85440",
      "name": "Bat haven player home v1_3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "109",
      "fileName": "Bat haven player home v1_3-22508-1-3.zip",
      "uploadedUnix": "1346372292",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/da5e88ad5e4008f9550f02cbffdce9b8e3504360d0043de0aee1d48828c5ac95/analysis/1407134222/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bat%20haven%20player%20home%20v1_3-22508-1-3.zip?fid=85440&ttl=1535792080&ri=8192&rs=8192&setec=8af6a887ef9e5754879acaac177d3bb8"
    },
    {
      "fileId": "85459",
      "name": "Bat haven player home v1_3_5",
      "version": "1.3.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "110",
      "fileName": "Bat haven player home v1_3_5-22508-1-3-5.zip",
      "uploadedUnix": "1346382582",
      "modVersion": "1.3.5",
      "virusScanUrl": "https://www.virustotal.com/file/10a1479683a4d05a2af76be9c04e0ff5c62ca4ca5e50b096cb0d04243f066913/analysis/1407134344/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bat%20haven%20player%20home%20v1_3_5-22508-1-3-5.zip?fid=85459&ttl=1535792081&ri=8192&rs=8192&setec=11396dfb55f1fde0fbe1a39d28bc2bb6"
    },
    {
      "fileId": "85487",
      "name": "Bat haven player home v1_4",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "111",
      "fileName": "Bat haven player home v1_4-22508-1-4.zip",
      "uploadedUnix": "1346399529",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/a02457cfde2db31cc7a79ed37faebbf3f4d90115a05e65fba0b4affe34cb6bcf/analysis/1407134765/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bat%20haven%20player%20home%20v1_4-22508-1-4.zip?fid=85487&ttl=1535792081&ri=8192&rs=8192&setec=6432f7ed11efb40fe9559d051ba3388f"
    },
    {
      "fileId": "86514",
      "name": "Bat haven player home v1_5",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "140",
      "fileName": "Bat haven player home v1_5-22508-1-5.zip",
      "uploadedUnix": "1346821276",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/74817009e1b28139dbf907786bc0e383905ac09370349e8cfb4a82eb0cf554e5/analysis/1407146667/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bat%20haven%20player%20home%20v1_5-22508-1-5.zip?fid=86514&ttl=1535792082&ri=8192&rs=8192&setec=16a5f2598f8b914761fde905e019235e"
    }
  ]
}