{
  "modId": 22521.0,
  "modName": "The Haunted Forests of Skyrim",
  "summary": "Adds groups of respawning draugr to several of Skyrim\\'s forested areas and the marshes of Morthal. Also adds a few groups of respawning corrupted shades, ghosts of the civil war. ",
  "descriptionHtml": "Mod description can be found below this story, which serves as an introduction to the project:\r\n\r\n\\\"Gareth cursed loudly, his words accompanied by a fine cloud of his breath that dissipated in the frozen air. He had thought the arrow would have been enough to take down the deer, but as it pierced the animal\\'s haunch the deer had simply pranced away. He flexed his fingers around the hard, icy wood of his hunting bow, and said aloud to the forest, \\'It\\'s freezing!\\' The trees made no response. He ran in the direction of the deer\\'s flight, his footsteps crunching on twigs and the previous night\\'s snowfall. It wouldn\\'t be long, he decided after a glance at the sky, before winter came, and his hunting expeditions would have to be postponed. He continued following the deer\\'s tracks, thinking of the beast as twenty septims with legs that had (temporarily, he told himself) eluded him. He thought of the warm, welcoming interior of the Winking Skeever in Solitude, where he sold the meat and pelts he collected after a week\\'s worth of hunting. His thoughts drifted to Runa, who always smiled at him as she counted out the septims he earned, and he remembered how she had laughed with him over a mug of mead in a corner of the Skeever, how warm her skin had felt when she let him run a hand up her skirt…. Gareth groaned as he lost the track of the wounded deer and contemplated returning home to Solitude with nothing to show for the day\\'s efforts. He wouldn\\'t even be able to buy Runa a drink, he though dismally. He stopped to catch his breath, every exhalation a white cloud among the trees. Gareth rubbed his arms to generate warmth, and as he determined which direction was the way home he heard crunching footsteps some distance behind him. He froze, but the sound kept coming from behind him—the sound of multiple people walking slowly through the woods towards him, the noise of their approach accompanied by a chorus of unfamiliar rattling, as if someone with half of a mammoth steak stuck in their throat was trying to breathe. His hands dropped down and he slowly drew the steel dagger slung against his thigh. Gareth turned around slowly and almost dropped the weapon  as he saw what was coming closer and closer to him. There were five of them, their eyes piercing blue lights set in a gray, decayed face. They wore black armor of a design he had never seen, and carried dark, rusted weapons in skeletal hands. Draugr, Gareth thought in terror. Above ground! The group of undead kept coming closer, the rattle of their breath and armor growing steadily louder. Gareth looked behind him, saw only trees, and with the surge of energy brought on by pure panic ran away through the forest. He heard the draugr snarl from behind him and give chase, but all the thought about was the shoreline he saw peeking through the trees ahead. He ran out from the treeline and jumped screaming into the icy river, his large muscles propelling him through the water. As he crawled onto the opposite shore, just under the Solitude Sawmill, he looked back. The draugr stood at the water\\'s edge on the other side of the river, observing him, their eyes burning in their sockets like blue torches. Gareth pulled himself off of the ground and, shivering, ran up the road to the Solitude main gate, thinking only of survival and warmth and Runa as the draugr turned away and melted back into the forest.\\\"\r\n\r\nMOD DESCRIPTION\r\n\r\n^^OK, I know you\\'re looking for a mod and not literature but it had to be written ;D So hey everyone, here is mod number 3, a work-in-progress that adds large, fearsome groups of draugr to several of Skyrim\\'s forests (see sceenshots for exact location). Since I just dropped in the default draugr enemies, once you\\'ve killed them all they will respawn, although I\\'m not clever enough to figure out how many in-game days that would take. In addition to the locations shown in the screenshots, smaller (~5 enemies per group) groups of draugr have been added to several other forested areas. I will not tell you where these are so you\\'ll have to find them yourselves, and hopefully finding the draugr there will be a surprise ;) In deference to people\\'s wishes to include proper ghosts, I added in groups of corrupted shades: two large ones will assault Falkreath and Kynesgrove, and smaller ones have been placed in places important to the Skyrim Civil War (Korvanjunde, Plains of Whiterun, across of Windhelm Stables) as those are the places where the soldiers who became ghosts would have died. To prevent civilian casualties in Kynesgrove and Falkreath (other locations where undead can be found are not close enough to civilization to worry, and the draugr that attack Riverwood are low-leveled enough for player and guards to fend off) I added in a nonessential, respawning Penitus Oculatus agent to both towns--Cyrus in Kynesgrove, Haledir in Falkreath--to aid you and the guards in the fighting. Tell me what you think and I will take your comments into consideration as I further develop this mod, maybe including a version where the draugr respawn. So please download, comment [please share your thoughts!!] and **endorse** and tell me what you think! :D \r\n\r\nAlso, check out my first mod which boosts the stats of Imperial armor/weapons and Stormcloak armor *and* Skyforge steel weapons. Whew! http://skyrim.nexusmods.com/mods/21382\r\n\r\n*FAQ*\r\n\r\nDoes this mod\\'s name have anything to do with the Haunted Forest in George R.R. Martin\\'s \\\"A Song of Ice and Fire\\\"? \r\nAnswer: Yes!\r\n\r\nWill this mod have a performance impact?\r\nAnswer: You bet! It adds in around 60-75 RESPAWNING draugr and corrupted shade NPCs to kill, so when you encounter them in any of the places where they can be found you will see performance hit, even more so if you bring companions with you (and often you will need to do so to survive). If your machine can\\'t handle the vast number of hostile this mod includes, you probably shouldn\\'t risk downloading this mod. Caveat emptor. \r\n\r\nHow many draugr are there? \r\nAnswer: In most places indicated in the screenshots there are around ten (one place only has 5, and low-level ones at that). Across from Solitude there are many (>10, including a Dragon Priest and a couple Deathlords) and you may need a small army to clear them out. The attacks on Kynesgrove and Falkreath both involve around 15 corrupted shades a piece. The draugr and shades that you have to find yourself are in groups of around 5.\r\n\r\nHelp! I can\\'t find any other than in the places in the screenshots! \r\nAnswer: First off, that\\'s not a question ;D Secondly, you have to look! To help you out, I\\'ll tell you that there are ZERO draugr or shades anywhere in the Reach (Markarth and surroundings) and ZERO in the snow-covered areas south of the Throat of the World and Helgen. The greatest concentration of undead can be found in the Rift and the forested regions bordering the volcanic area south of Windhelm. There are zero enemies north and east of Windhelm and almost none to the West. As a general rule, don\\'t expect to find anything in snowy areas, except west of Solitude. And remember, mymod is called The Haunted *Forests* of Skyrim. In places without trees don\\'t expect to find anything except possibly a few corrupted shades, and that\\'s quite unlikely.\r\n\r\nPLEASE tell me want you would like to see in this mod in the future! :D",
  "categoryId": "77",
  "version": "1.0",
  "author": "Invctus",
  "createdUnix": "1345089356",
  "updatedUnix": "1345328218",
  "containsAdultContent": false,
  "uploadedBy": "Invctus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81949",
      "name": "The Haunted Forests Main and Only File",
      "version": "BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14",
      "fileName": "The Haunted Forests Main and Only File-22521-BETA.zip",
      "uploadedUnix": "1345089431",
      "modVersion": "BETA",
      "virusScanUrl": "https://www.virustotal.com/file/2b1d99e3d78248d1d295ff9acaec94f9462cf55aed912707f650e3d32bf19141/analysis/1407100206/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Haunted%20Forests%20Main%20and%20Only%20File-22521-BETA.zip?fid=81949&ttl=1535792097&ri=8192&rs=8192&setec=ced328dc200fec946a8ef292defd0dca"
    },
    {
      "fileId": "82048",
      "name": "The Haunted Forests UPDATED Main and Only File",
      "version": "BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22",
      "fileName": "The Haunted Forests UPDATED Main and Only File-22521-BETA.zip",
      "uploadedUnix": "1345142101",
      "modVersion": "BETA",
      "virusScanUrl": "https://www.virustotal.com/file/2b3390279f88e668f55ec1467c3a57aea5e639d428aa9affd0cf7eac544ac869/analysis/1407101287/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Haunted%20Forests%20UPDATED%20Main%20and%20Only%20File-22521-BETA.zip?fid=82048&ttl=1535792098&ri=8192&rs=8192&setec=d9a3f1fecefbd50cb68c330443036388"
    },
    {
      "fileId": "82571",
      "name": "The Haunted Forests v1 Main File",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "37",
      "fileName": "The Haunted Forests v1 Main File-22521-1-0.zip",
      "uploadedUnix": "1345328218",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c6e20f9b235ca6818caf6109c134a812ff6cd2715d2059ec7606dc25d49dbaba/analysis/1407106094/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Haunted%20Forests%20v1%20Main%20File-22521-1-0.zip?fid=82571&ttl=1535792099&ri=8192&rs=8192&setec=f99496a41231e97dc2a8b7e601b4b22e"
    }
  ]
}