{
  "modId": 2254.0,
  "modName": "Alduin is not made of plastic",
  "summary": "Lessens the intense shine on Alduin\\'s scales for a more realistic look.",
  "descriptionHtml": "This mod lessens the intense shine on Alduin\\'s scales for a more realistic look.  It will work nicely alongside any other Alduin texture mods.  The example picture is of my Red and Gold Alduin texture as this is the texture this mod was originally requested for. The actual file won\\'t effect the colour of your Alduin, only the shinyness.\r\n\r\nOriginal grey and black Alduin too drab for you?  Check out these Alduin texture mods:\r\n\r\nClassical Green Alduin:\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=1532\r\n\r\nEvil Alduin:\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=1668\r\n\r\nRed and Gold Alduin:\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=2169\r\n\r\n\r\nThis mod should install with Nexus Mod Manager but for those (like me) who haven\\'t got it yet, manual installation instructions are below:\r\n\r\nINSTALLATION:\r\nTo manually Install:\r\nSimply unzip the zip archive then move the \\\"data\\\" folder to your \\\"Steam>SteamApps>common>skyrim\\\" folder. When asked if you want to merge/overwrite click yes.\r\n\r\nTo manually Uninstall:\r\nDelete the following files from your \\\"Steam>SteamApps>common>skyrim>data>textures>actors>alduin\\\" folder:\r\n\\\"alduin_n\\\"\r\n\\\"alduin_m\\\"\r\n\r\nCopywright stuff: This file and its description are my intellectual property and can\\'t be redistributed. If you\\'d like to use the texture in your mod however just drop me a pm or comment, I\\'m 99% likely to give you persmission to use it unless your mod is seriously messed up or something.\r\nI\\'m not being anal with the above stuff, it\\'s just to try and stop other websites from uploading my material. ",
  "categoryId": "29",
  "version": "",
  "author": "Kibblesticks",
  "createdUnix": "1322768694",
  "updatedUnix": "1322768694",
  "containsAdultContent": false,
  "uploadedBy": "kibblesticks",
  "primaryFile": null,
  "files": []
}