{
  "modId": 22540.0,
  "modName": "Summon Arvak - Now a Lesser Power",
  "summary": "Changes the Summon Arvak spell into a convenient Lesser Power with no magicka cost.",
  "descriptionHtml": "[b][i]There is now a second version of this mod that would make Arvak invulnerable. This version may conflict with mods, so unless I\\'m being paranoid then you may wish to use the Regular version that changes only the spell in order to minimise the risk of any potential conflict. If there are reports of little to no conflict regarding the Invulnerable version whatsoever, then I may remove the Regular version from the Nexus site. Thank you.[/i][/b]\r\n\r\nThis is a simple mod that changes the Summon Arvak spell into a Lesser Power. The ability no longer costs magicka and you can now use it without having to switch weapons or spells for the sake of convenience! The Invulnerable version also makes the summoned mount somewhat more realistic by making him invulnerable and unable to bleed.\r\n\r\nThe mod requires Dawnguard and should be compatible with any mod that doesn\\'t change the Summon Arvak spell, or Arvak himself if using the Invulnerable version. The Regular version should also be compatible with most major horse mods, including Convenient Horses!\r\n\r\n[b]To install, simply extract the contents of ArvakLesserPower.zip to your Skyrim directory. This should normally be: [i]C:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data[/i][/b]\r\n\r\n[i][b]WARNING:[/b] You must unequip the Summon Arvak spell before installing this mod. It\\'s a minor issue that can be easily resolved, but I have just gotten a report that if you load a saved game with the spell still equipped to the left/right hand while running this mod for the first time, you may not be able to summon your mount at all. This is obviously due to having this ability being changed to share the same slot as your Powers and Shouts, so be sure to unequip the Summon Arvak spell and save before installation.[/i]\r\n\r\n[b]Once you have done that, start the game and enjoy this little mod![/b]",
  "categoryId": "24",
  "version": "1.1",
  "author": "AndrewOverload519",
  "createdUnix": "1345129328",
  "updatedUnix": "1345834710",
  "containsAdultContent": false,
  "uploadedBy": "AndrewOverload519",
  "primaryFile": null,
  "files": [
    {
      "fileId": "82010",
      "name": "Summon Arvak - Now a Lesser Power -Regular-",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Summon Arvak - Now a Lesser Power-22540-1-0.zip",
      "uploadedUnix": "1345129539",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0c5f9bf29158a0389b86531156521454e5edef45609f2d45a961dd1ddf2a7baa/analysis/1407100983/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Arvak%20-%20Now%20a%20Lesser%20Power-22540-1-0.zip?fid=82010&ttl=1535792128&ri=8192&rs=8192&setec=33a2c428f90791b4c50ee3b3c7063115"
    },
    {
      "fileId": "83965",
      "name": "Summon Arvak - Now a Lesser Power -Invulnerable-",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Summon Arvak - Now a Lesser Power -Invulnerable--22540-1-1.zip",
      "uploadedUnix": "1345834710",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/85f279e11cffdbef996857d4706fdc70852799ad29bf971c7ca1cf09efe5d588/analysis/1407119121/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Arvak%20-%20Now%20a%20Lesser%20Power%20-Invulnerable--22540-1-1.zip?fid=83965&ttl=1535792128&ri=8192&rs=8192&setec=e99f06e7f34cecf43ff0a2f5eacfbe06"
    }
  ]
}