{
  "modId": 22576.0,
  "modName": "Tan and Shine for CBBEv3-2 and UNP Body",
  "summary": "Looking for a sexy Tan with Shine for your CBBEv3-2 Curvy and Slim body? How about for Dimonized UNP? Look no further&#33;\r<br />\r<br />Skyrim is one of the greatest open-world RPG ever created and includes fantastic 3D character models. TnS is a texture replacer for CBBE Curvy and Slim and dimon99&#39;s Dimonized UNP to give a more sexy looking ch",
  "descriptionHtml": "[size=5][color=#FFD700]I will no longer be performing updates/services to this mod due to it becoming a bit obsolete.\r<br />\r<br />I will keep the mod available for those who prefer to use it over other more popular mods and will continue to answer any questions posted in the Comments.[/size][/color]\r<br />[line]\r<br />\r<br />[color=#00FA9A][size=4]12/27/13 – Final version available. See Versions & Fixes below or Changelog for more details.[/size][/color]\r<br />\r<br />[b][size=3][color=#FFFF00]Binary Messiah Reviews[/color][/size][/b]\r<br />[url=http://binarymessiah.wordpress.com/2012/12/01/the-elder-scrolls-v-skyrim-mods-the-very-best-part-2-custom-race-and-body-customization/][img] http://binarymessiah.files.wordpress.com/2012/12/tan.jpg?w=549&h=137[/img] [/url]\r<br />\r<br />[img]http://static1.nexusmods.com/15/mods/110/images/22576-4-1371790899.jpg[/img]\r<br />[color=#ff6c00][u][b]Required Mods:[/b][/u][/color]\r<br />\r<br />[color=#FF00FF][size=4][u]You must have these mods installed before installing any of the Tan Body choices&#33;[/u][/size][/color]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/2666]Calientes Female Body Mod Big Bottom Edition -CBBEv3-1 or 3-2 - by Caliente[/url] - [color=#FF00FF]You must have either Curvy or Slim installed.[/color]\r<br />\r<br />or\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/6709//?]DIMONIZED UNP female body by dimon99[/url] - [color=#FF00FF]Textures provided by TnS are from dimon99&#39;s &#34;1dot51bodies textures&#34; updated folder. You must still install one of dimon99&#39;s Base (Main) files.[/color]\r<br />[line]\r<br />Here&#39;s a list of mods I personally use that enhance the TnS and all around look of Skyrim: [color=#7FFF00][b][u]These are NOT required&#33; I only recommend them.[/u][/b][/color]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/26800/?]XP32 Maximum Skeleton -XPMS by xp32[/url] - [color=#7FFF00]For BBP effect.[/color]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/16731]UNP Fitness Body - Also CBBE by Svarog[/url] - [color=#7FFF00]If you wish to have TnS with a muscled/fit body.[/color]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/18717]Temptress Race by Psychos1s and Brokefoot[/url] - [color=#7FFF00]The race I use. Great color range to choose from for makeup and hair. Sexy as hell too.[/color]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/15411#content]ApachiiSkyHair NPC Overhaul by Spewed[/url] - [color=#7FFF00]Can&#39;t ask for better looking hair than this.[/color]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/20781]Project ENB by Bronze316[/url] - [color=#7FFF00]Great lighting and graphics enhancer. A must if you like the looks of my pics.[/color]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/17802]Project Reality - Climates Of Tamriel - Weather - Lighting by JJC71[/url] - [color=#7FFF00]What&#39;s a world of Skyrim without fantastic weather?[/color]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/8655]Static Mesh Improvement Mod - SMIM by Brumbek[/url] - [color=#7FFF00]Texture enhancer for EVERYTHING&#33; I couldn&#39;t play Skyrim without this.[/color]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/13722]The Eyes Of Beauty by Gabriel Mailhot[/url] - [color=#7FFF00]This is a very well done eye retexture. It gives eyes that certain depth that other eye mods don&#39;t quite get.[/color]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/25259]Remodeled Armor for CBBEv3 Bodyslide and BBP by ChronoTrigger77[/url] - [color=#7FFF00]This is one of the best armor retextures that I&#39;ve found for CBBE + BBP. Chrono does a terrific job making each armor look beautiful, sexy, and still deadly.[/color]\r<br />\r<br />[img]http://static1.nexusmods.com/15/mods/110/images/22576-4-1371790841.jpg[/img]\r<br />[color=#ff6c00][u][b]Installing Order:[/b][/u][/color]\r<br />\r<br />[size=3][color=#FFD700]For those using [url=http://www.nexusmods.com/skyrim/mods/28946/?][Sporty Sexy Sweat - wet body skin texture - CBBE UNP UNPB ADEC Vanilla by Xs2reality][/url], [b][i]DO NOT INSTALL ANY SHINE OPTIONS&#33;[/b][/i]\r<br />Face Glitter option will work with Sporty Sweat mod if you choose 0%. You will NOT have any sweat on your face/head if that matters.[/size][/color]\r<br />\r<br />Be sure to have your body choice (CBBE or UNP) installed first.\r<br />Install any type of muscle mod you want.\r<br />Then install Tan/Shine/Glitter option(s).\r<br />\r<br />[img]http://static1.nexusmods.com/15/mods/110/images/22576-1-1371790898.jpg[/img]\r<br />[color=#ff6c00][u][b]Manual Install:[/b][/u][/color]\r<br />\r<br />If you want your options to be installed on your character only, you&#39;ll need a custom race and to follow the Manual Install instructions below.\r<br />\r<br />[color=#FF0000][size=5][b]BACK UP YOUR FEMALE FOLDER BEFORE INSTALLING&#33; IT WILL MAKE UNINSTALLING EASIER IF YOU DON&#39;T LIKE THE MOD&#33;[/b][/size][/color]\r<br />[b][u]No Custom Race:[/u][/b]\r<br />[color=#fcff00]Steam &gt; steamapps &gt; common &gt; skyrim &gt; Data &gt; Textures &gt; actors &gt; character &gt; female[/color] ( &lt;- Copy entire [u]female[/u] Folder and Paste somewhere safe).\r<br />[b][u]Custom Race:[/u][/b]\r<br />[color=#fcff00]Steam &gt; steamapps &gt; common &gt; skyrim &gt; Data &gt; Textures &gt; (Custom Race Folder) &gt; actors &gt; character &gt; female[/color] ( &lt;- Copy entire [u]female[/u] Folder and Paste somewhere safe).\r<br />\r<br />[size=4]Install the selected choices from Tan/Shine/Glitter you want into the above paths after you&#39;ve backed them up.[/size]\r<br />\r<br />\r<br />[img]http://static1.nexusmods.com/15/mods/110/images/22576-5-1371790899.jpg[/img]\r<br />[color=#ff6c00][u][b]Uninstall:[/b][/u][/color]\r<br />\r<br />If you took my advice above about Backing up your female folder, simply drag the contents of your female folder into the female folder you installed my mod in (Steps 6 - 8 above). Overwrite / Copy & Replace when asked.\r<br />[line]\r<br />[color=#FF0000]If you didn&#39;t back up your female folder:[/color]\r<br />\r<br />[list][*]1) Open the body mod you&#39;ve been using (Custom Race, CBBE, UNPB, ect).\r<br />[*]2) Install that mod.\r<br />[*]3) Overwrite / Copy & Replace when asked.\r<br />[*]4) Done.[/list]\r<br />\r<br />[img]http://static1.nexusmods.com/15/mods/110/images/22576-5-1371790841.jpg[/img]\r<br />[color=#ff6c00][u][b]Known Bugs:[/b][/u][/color]\r<br />\r<br />- Seams may show up depending on; the combination of options picked, lighting and/or graphic mods used, and/or other mods that alter character body. If this is the case, please submit a screenshot and comment to include which TnS options you installed and where it occurred (outside, inside, ect.)\r<br />- Has not been tested with Vampire and Werewolf characters.\r<br />\r<br />If you find any Bugs or needed Fixes that are not listed, post them in the Comments section. I plan to check the Comments section on a regular basis.\r<br />\r<br />\r<br />[img]http://static1.nexusmods.com/15/mods/110/images/22576-1-1371790921.jpg[/img]\r<br />[color=#ff6c00][u][b]Versions & Fixes:[/b][/u][/color]\r<br />\r<br />[b]Final[/b] - [color=#FF4500]Split everything into separate folders. Instead of a No Glitter download, made default shine have NO glitter and made Glitter an option.[/color]\r<br />\r<br />[b]v13[/b] - [color=#FF4500]New Option &#34;Lighter Tan&#34; available. 50% color reduction for users who wanted a more &#34;base&#34; tan effect.[/color]\r<br />[line]\r<br />[b]v12[/b] - [color=#FF4500]New add-on available. No Glitter Make-Up – Removes all glitter effects from femalehead file.\r<br />- Updated face provided by TnS for both CBBE and UNP. Lips are now a more natural pink color.\r<br />- Updated face for UNP. Neckline adjusted to hopefully add better texture between neck and body seam.\r<br />- The FAQ concerning the possibility of blacked out body parts was incorrect and has been corrected.[/color]\r<br />[line]\r<br />[b]v11[/b] - [color=#FF4500]Added Tan Lines to UNP.[/color]\r<br />[line]\r<br />[b]v10[/b] - [color=#FF4500]Added a UNP option to download. I know, finally right?[/color]\r<br />[line]\r<br />[b]vFinal.5[/b] - [color=#FF4500]Fixed an issue with the NMM script adding all shine files into the female folder.\r<br />       - Added tan options for Elvin, Beasts, and Brenton races. This tan is a lighter tone than the normal tan in hopes to compensate for the darker/yellowish skin tones of those races.[/color]\r<br />[line]\r<br />[b]vFinal[/b] - [color=#FF4500]Added the option “Elvin, Beast, Orc, and Brenton Races” to the NMM script for installing.\r<br />\t- The above mentioned races will not receive a tan. The skin tones on those races are already tweaked and adding a darker skin tone can unbalance it. Example: Tan on Elvin characters make them appear too dark or too yellow.\r<br />\t- The above mentioned races will receive Shine options only.\r<br />\t- Everything else about TnS has not been changed since v8.[/color]\r<br />[line]\r<br />[b]v8[/b] - [color=#FF4500]Cleaned unneeded files to help keep download size down.\r<br />\t- Tattoo bodies are now separate “Optional” downloads to keep main file size down.\r<br />- Mods such as Fitness CBBE body, no longer have to be manually installed.\r<br />- Included improved Tattoo Lore and Celtic versions as well as new Tattoo Dragonborn.\r<br />- Reconfigured Fomod install script for NMM and added new pics to installer.\r<br />- Tan Lines now available on all Tattoo bodies.\r<br />- Made minor adjustments to TnS face and face spectrum for makeup enhancement.[/color]\r<br />[line]\r<br />[b]v7[/b] - [color=#FF4500] Reconfigured Description page, yet again. Seems I&#39;m never happy with it.\r<br />             - Improved install program for NMM users.\r<br />             - New &#34;Natural&#34; option for Curvy and Slim. Provides a shine similar to 10% option, but was created to not cover up body details. Natural allows body to have a shine without the &#34;I&#39;m Barbie made of plastic&#34; look.\r<br />             - Created a face retexture for TnS which allows for a more real looking character. Face has pores for texture, a better nose for detail, eyelashes for a sexy look, and an improved mouth for better coloring.\r<br />             - 2 New tattoo versions including a Celtic option with pure celtic tattoos which may or may not be lore/period friendly. It&#39;s in the eye of the user. And a Tribal option with pure tribal and some colors which is not lore/period friendly.\r<br />             - Tan Lines can now be used with Pubic Hair options Bushy or Strip.[/color]\r<br />[line]\r<br />[b]v6[/b] -[color=#FF4500]  Overhauled TnS to now use the CBBEv3-2 Curvy and Slim body models.\r<br />             - Fixed Tan to appear a more natural bronze color instead of just a darker skin tone look.\r<br />             - Fixed how Tan Lines appeared on new CBBEv3-2 bodies. Lines are cleaner.\r<br />             - New Tattoo style includes all black tribal style tattoos. Hoping these tattoos will be more lore/period friendly.\r<br />             - Fixed Pubic Hair styles that will now only be Bushy and Strip.\r<br />             - Created a makeup enhancement to be included in v6 file. Face mods no longer needed. [/color]\r<br />[line]\r<br />[b]v5[/b] - [color=#FF4500] A long overdue version is finally finished. V5 includes the following:\r<br />    - Deeper Tan\r<br />    - Fixed Pubic Hair and Tattoo versions. Both now have Tans&#33;\r<br />    - Done in a way that all previous face mods cooperate with TnS without special add-ons needed. Be sure to install face mod BEFORE TnS. (1: Coverwomen &gt; 2: TnS)\r<br />    - 2 Tattoo versions including Olivia&#39;s special and a new &#34;Wings&#34; which has blue highlighting on the tattoos where Olivia&#39;s special focuses on reds and greens. Screenshots included in install.\r<br />    - 4 Pubic hair versions from previous TnS versions. Bushy, Strip, Wings, and Spiral.\r<br />    - For use on CBBE Curvy and Slim. [/color]\r<br />[line]\r<br />[b]v4.a[/b] -[color=#FF4500]  Fixed the problem with tan not being applied. [/color]\r<br />[line]\r<br />[b]v4[/b] -[color=#FF4500]  Updated mod page ... Seem to be doing that a lot.\r<br />- Simplified XML script for NMM installation. New menu style included.\r<br />- TnS now comes with a choice of 0%, 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%, or 100% shine for Curvy or Slim.\r<br />- Fixes for Bella&#39;s BF and Coverwomen. No more seams ... so far.\r<br />- New v4 Tattoo TnS body for Curvy or Slim.\r<br />- Pubic hair bodies now for CBBE Slim body too.\r<br />- Tan lines are now an add-on for Curvy and Slim body types. Tan lines will not appear on tattoed or pubic hair bodies. [/color]\r<br />[line]\r<br />[b]v3[/b] - [color=#FF4500] Updated mod page.\r<br />- Created script for NMM install of all Main and Optional Files&#33;\r<br />- Refinished tan lines for a more smooth look. Added tie lines.\r<br />- Recreated Tattoo version adding a custom floral tattoo I created. [/color]\r<br />[line]\r<br />[b]v.2a[/b] - [color=#FF4500] Updated folders on all Mods for easier NMM install.\r<br />- Added Shine Options including Less Shine, 20% more, 50% more, and Glow in the Dark.\r<br />- Added Shine Options for Temptress Face optional mod. [/color]\r<br />[line]\r<br />[b]v.2[/b] - [color=#FF4500] Shine is now smoother and more even. Fixed Seams on Wrist, Neck, and Ankles. Feet now have shine. Added CBBE Face for even Tan and Shine. Added Special Edition Tattoo version with Full Body Tan w/ Lines and Shine. Updated Description page ... again. [/color]\r<br />[line]\r<br />[b]v.1[/b] - [color=#FF4500] Started page. Many small fixes to installation folders and description page. [/color]\r<br />\r<br />[IMG]http://static1.nexusmods.com/15/mods/110/images/22576-3-1371790841.jpg[/IMG]\r<br />[color=#ff6c00][u][b]FAQs:[/b][/u][/color]\r<br />\r<br />[color=#FF4500]Q: Can I use Bella&#39;s face or another face mod with TnS? [/color]\r<br />[color=#1E90FF]A: Yes and No. All mods that change or affect the face of the character will not blend with TnS and leave seams. So you can use another face such as Bella&#39;s, but it will not have a Tan and Shine. [/color]\r<br />\r<br />[color=#FF4500]Q: Can I use TnS with my Custom Race?[/color]\r<br />[color=#1E90FF]A: Yes. Be sure the race uses or is compatible with the CBBEv3-2 or UNP body. Then manually install TnS into your races folder. See [u]Manual Installation[/u] above. [/color]\r<br />\r<br />[color=#FF4500]Q: TnS will not install to my character, but shows on all NPCs. Why is this? [/color]\r<br />[color=#1E90FF]A: You are using a Custom Race and must do a Manual Install of TnS into your custom race&#39;s female folder. Follow the step-by-step instructions in the [u]Manual Installation[/u] section above for help. [/color]\r<br />\r<br />[color=#FF4500]Q: My character looks extremely dark after installing TnS.[/color]\r<br />[color=#1E90FF]A: This will happen if you install TnS on a character you created with dark skin. TnS should be used with the races default Skin Tone which is 2. On the Skin Tone slider, move all the way left, then 1 click right.[/color]\r<br />\r<br />[color=#FF4500]Q: I installed TnS but my character has empty space/seams on the wrists and ankles. Why is this? [/color]\r<br />[color=#1E90FF]A: This is [i][u]NOT[/i][/u] an issue with TnS. This is a problem with your skeleton. It means you did something wrong while installing CBBE, UNP, and/or BBP. Look to their mod pages for more assistance. [/color]\r<br />\r<br />[color=#FF4500]Q: After installing TnS my character gets blacked over hands and/or feet and/or body and/or face. Why is this happening? [/color]\r<br />[color=#1E90FF]A: Unfortunately this is a problem with your VRAM. The textures I provide are in 4096x4096 resolution. Some graphics cards cannot load that resolution without problems. If you are running an ENB, try lowering the amount of strain on your graphics card from the ENB.[/color]\r<br />\r<br />[color=#FF4500]Q: After installing TnS, parts of my character are a lighter color. Did I do something wrong?[/color]\r<br />[color=#1E90FF]A: No. Depending on certain lighting/graphic enhancing mods and certain areas, colors on the body can change. An example will be: Inside taverns or dungeons, all colors are normally darker and there are no seams. But outside during a clear sunny day; the hands, wrists, face, or body may appear lighter than the rest of the body due to the light source reacting with the character. There is no fixing this and is something that just needs to be overlooked and ignored.[/color]\r<br />\r<br />[color=#FF4500]Q: I have a mod that gives muscle to my character and adds scars to her face, but I can’t get TnS to stay on with them&#33; Why not?[/color]\r<br />[color=#1E90FF]A: TnS is a [i][u]Texture Replacer[/u][/i] and must be installed [i][u]AFTER[/i][/u] any and all mods that adjusts [i][u]ANYTHING[/i][/u] on the body. TnS [i][u]WILL[/u][/i] overwrite any mod that adds an effect to the _1.dds file(s). If you are unsure whether the effect you want from another mod is from a _1.dds file, ask me by leaving a Comment or ask the author of the other mod.[/color]\r<br />\r<br />[color=#FF4500]Q: I installed TnS and now I’m getting CTDs&#33;[/color]\r<br />[color=#1E90FF]A: Sucks to be you. TnS has nothing to do with your game crashing, graphics tearing, animations not working, ect.[/color]\r<br />\r<br />[color=#FF4500]Q: I downloaded TnS with NMM, but when I try to install it, NMM crashes.[/color]\r<br />[color=#1E90FF]A: If this occurs, it’s most likely legitimately my fault. Please leave a Comment letting me know when the crash happened (upon installing or during installing when choosing an option). This is an error in the HTML Fomod script and needs to be fixed by me. Try installing another mod that uses a Fomod script (install menu with choices) to be certain that the error is not NMM itself.[/color]\r<br />\r<br />[color=#FF4500]Q: Why doesn’t my character look like your pics? I installed all the recommended mods that you list.[/color]\r<br />[color=#1E90FF]A: Odds are you won’t get the exact look that I have. I have certain options from Project ENB and CoT that you may not be using and we most likely have different PCs with varying video cards also. If your game looks better than it did and still runs smooth, take it as a win and enjoy your sexy TnS character.[/color]\r<br />\r<br />For any other questions or problems you come across, post a comment on the TnS mod page. Take and upload a screenshot of the problem and submit that along with your comment to help me better understand the problem.\r<br />\r<br />[IMG]http://static1.nexusmods.com/15/mods/110/images/22576-1-1371790841.jpg[/IMG]\r<br />[color=#ff6c00][u][b]Credits:[/b][/u][/color]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/18717][img]http://farm9.staticflickr.com/8434/7722550578_0ed2414e53.jpg[/img][/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/2666]Calientes Female Body Mod Big Bottom Edition -CBBE- by Caliente[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/6709//?]DIMONIZED UNP female body by dimon99[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/4529]CBBE Slim Tribal Tattoo by Laxi2610[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/7052]Tattoos for CBBE V3 Curvy and SLIM Body by candymanXXL[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/7834]Tattoos for DIMONIZED UNP female body by candymanXXL[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/17174#content]Pinup Poser by Halofarm[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/16731]UNP Fitness Body - Also CBBE by Svarog[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/2812]Better Females by Bella by BellaGail[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/3563]Coverwomen by mrLenski[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/4888]CHSBHC - BBP - Nude and Jiggly Mod by CherryHotaling[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/27466]Tan Lines for CBBE v3-2 by Xanshio[/url]\r<br />\r<br />[IMG]http://static1.nexusmods.com/15/mods/110/images/22576-3-1371790898.jpg[/IMG]\r<br />[color=#ff6c00][u][b]Permissions:[/b][/u][/color]\r<br />\r<br />You cannot upload any files from this mod to the Nexus or any other site&#33; You may not edit any files from this mod and say they are yours.\r<br />\r<br />If you get my permission, you may be able to utilize files from this mod in your own mod. Conditions will be explained upon answering your PM when you ask me to use my files.",
  "categoryId": "29",
  "version": "Final",
  "author": "Desufire",
  "createdUnix": "1345185186",
  "updatedUnix": "1388135756",
  "containsAdultContent": true,
  "uploadedBy": "Desufire",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000088554",
      "name": "CBBE Tan Body",
      "version": "Final",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21414",
      "fileName": "CBBE Tan Body-22576-Final.7z",
      "uploadedUnix": "1388134462",
      "modVersion": "Final",
      "virusScanUrl": "https://www.virustotal.com/file/d19eff162e2b6640781bcf8cc5591bc4969ee4d7ea02325ac3e2d84f915c9809/analysis/1407860653/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CBBE%20Tan%20Body-22576-Final.7z?fid=1000088554&ttl=1535792188&ri=8192&rs=8192&setec=ef5a622e9c0b9e2fb4d366b6669c9195"
    },
    {
      "fileId": "1000088556",
      "name": "UNP Tan Body",
      "version": "Final",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28888",
      "fileName": "UNP Tan Body-22576-Final.7z",
      "uploadedUnix": "1388135150",
      "modVersion": "Final",
      "virusScanUrl": "https://www.virustotal.com/file/7e632ec79762485ba5fae3f5b5c9ddea95c1a0248c01bcaf41663e812ab92f95/analysis/1407860666/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UNP%20Tan%20Body-22576-Final.7z?fid=1000088556&ttl=1535792189&ri=8192&rs=8192&setec=e7ae3bfe8ab7dda6d38038915c69a151"
    },
    {
      "fileId": "1000088557",
      "name": "Shine Options",
      "version": "Final",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "15120",
      "fileName": "Shine Options-22576-Final.7z",
      "uploadedUnix": "1388135461",
      "modVersion": "Final",
      "virusScanUrl": "https://www.virustotal.com/file/709ca2f07fb94566313756573499438dd2b327858a71f17b72f87f5f34f784b3/analysis/1407860674/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shine%20Options-22576-Final.7z?fid=1000088557&ttl=1535792189&ri=8192&rs=8192&setec=4addc45e3cd41f737a75e4bd626eb7c5"
    },
    {
      "fileId": "1000088558",
      "name": "Face Glitter",
      "version": "Final",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "872",
      "fileName": "Face Glitter-22576-Final.7z",
      "uploadedUnix": "1388135756",
      "modVersion": "Final",
      "virusScanUrl": "https://www.virustotal.com/file/506c616a8396ed09528fd4b263d22fc5d852c8e2bb886c737bbe73993a045ad5/analysis/1407860675/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Face%20Glitter-22576-Final.7z?fid=1000088558&ttl=1535792190&ri=8192&rs=8192&setec=8cd6c1726c2ec1348cc98d64c67ba61d"
    }
  ]
}