{
  "modId": 22575.0,
  "modName": "Morthal Fortified",
  "summary": "\\\"Noises have been heard in the swamp\\\"\r\n\r\na small mod aimed at giving Morthal a secure feel...",
  "descriptionHtml": "Updated to Version 1.0\r\nChanges:\r\n- moved the tower and barricade off the path next to the mill, so NPC should not get stuck when running to Morvath\\'s Lair\r\n- added Morthal banners to all \\\"outposts\\\" to convey the traveler that they are entering Morthal City limits. \r\n- placement of certain barricades and towers have been improved to look more naturally built against a rock face ( it no longer looks like crap basically)\r\n- the further est lookout point has been converted to a small encampment as these guys are out of sight from Morthal and the most exposed of the four. So they got a tent with bed, and a campfire, since they stay there long hours of the day.\r\n\r\nnew pics are up and the old ones deleted.\r\n\r\n\r\n\r\n\r\n\\\"Strange Noises have been heard in the swamp...\\\" Considering the fact that the city if Morthal is even more in need of security and tranquilty then Dawnstar I have addded protection to this town.\r\n\r\nThis mod is the sister mod to Dawnstar Fortified. It is the second in what I hope to be some very popular and immersing mods to help give selected settlements and towns that \\\"secure\\\" feel to them and give the impression, that if something does come this way, we won\\'t be caught with out pants down.\r\n\r\nFYI: This is not the final version, the final version will be 1.0, as of now it is 0.5, reason being,  i want thoughts on what the mod is currently, and what else to add to give it a secure, but different vibe then the Dawnstar Fortified mod. \r\n\r\nAlso I know their seems to be a blind spot behind and to the Right of the burned out house, when looking at it, I  left that there currently because that is how the vampires sneak in and back out, also during the Morthal quest several NPCs run around up there and i did not want them to get caught on something.\r\n\r\nEach Tower area has two guards, which are thier, but not exactly on the tower, but they are thier and ready to defend Morthal.\r\nINSTALL\r\nunzip the file and place the esp in your skyrim/data folder\r\n\r\nUNINSTALL\r\ndelete esp from skyrim/data folder\r\n\r\nMy mods should be relatively bug free, besides the places the guards will get themselves into. It should also be 99.9% conflict free.\r\n\r\n\r\nImages, and comments welcome\r\n\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "78",
  "version": "1.0",
  "author": "modder3434",
  "createdUnix": "1345184969",
  "updatedUnix": "1360709173",
  "containsAdultContent": false,
  "uploadedBy": "modder3434",
  "primaryFile": null,
  "files": [
    {
      "fileId": "82154",
      "name": "Morthal_Fortified",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Morthal_Fortified-22575-.7z",
      "uploadedUnix": "1345185046",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1525eaefe1ca4b8a89df25907056059609ea1ed3783b39948282215de351ab52/analysis/1407102364/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morthal_Fortified-22575-.7z?fid=82154&ttl=1535792186&ri=8192&rs=8192&setec=01f9a41bb81edcc09b611a987335b243"
    },
    {
      "fileId": "1000009343",
      "name": "Morthal Fortified",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Morthal Fortified-22575-.7z",
      "uploadedUnix": "1360709173",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/bb47b94d2e1774877a61765d3f10269fa1ba9c5502e0768d8cd133ee2d0c85af/analysis/1407413644/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morthal%20Fortified-22575-.7z?fid=1000009343&ttl=1535792186&ri=8192&rs=8192&setec=a5be98e0307f625f9b93a361db198990"
    }
  ]
}