{
  "modId": 22595.0,
  "modName": "Whiterun Water Park",
  "summary": "Transforms Whiterun into Skyrim\\'s first water park!",
  "descriptionHtml": "Sick of slaying Dragons? Bored of stealing candlesticks? Taken one too many arrows in the knee? Then why not relax and have some fun at the all new Whiterun Rapids Water Park! Ride the waves from Dragonsreach and try to reach the front gate without falling off! Laugh as those annoying NPC\\'s are dragged away by the current to a watery death! Whiterun Rapids is Skyrim\\'s first water park and is ideal for when you just want to wind down! Whiterun Rapids Co. and our sister company Krappy Khajiit Konstruction Ko. will not be held responsible for any injury, maiming or potentially horrific death by drowning or any other means to your person/character/PC or any other NPC stupid enough to get in the way of our potentially fatal waterflows.\r\n\r\nI just made this while I was bored as a bit of fun. I wouldn\\'t use this while trying to complete any quest in Whiterun as it disrupts the NPCs alot. Its not finished yet and probably never will be. Just fast travel to Dragonsreach to reach the top of the rapids. There are two different routes the rapids take, both ending at the front gate. At the front gate is a boat with an iron grate attached. Activating the iron grate will take you back to the top of the rapids.\r\n\r\nAlso try my new Throat of the World Rapids Mod\r\nhttp://skyrim.nexusmods.com/mods/33044\r\n\r\nFeature in elvir89088\\'s video Skyrim Mods Weekly\r\n[youtube]DESW1_vNPfQ[/youtube]\r\n\r\nThis mod is not compatible with anything else that changes the Whiterun Exterior Cells.",
  "categoryId": "28",
  "version": "V1",
  "author": "Drakynval",
  "createdUnix": "1345223373",
  "updatedUnix": "1345223482",
  "containsAdultContent": false,
  "uploadedBy": "Drakynval",
  "primaryFile": null,
  "files": [
    {
      "fileId": "82264",
      "name": "Whiterun Water Park V1",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "47",
      "fileName": "Whiterun Water Park V1-22595-V1.rar",
      "uploadedUnix": "1345223482",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/ddf040751c1855b50c2e2a88be9f7980ce86a09b642ee0b94c1638cc49cbb9de/analysis/1407103218/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whiterun%20Water%20Park%20V1-22595-V1.rar?fid=82264&ttl=1535792216&ri=8192&rs=8192&setec=d732ae7ec785cff8e5660514b06a8894"
    }
  ]
}