{
  "modId": 22603.0,
  "modName": "Behemoth Giant Creatures",
  "summary": "Adds giant versions of many creatures to many locations across Skyrim.",
  "descriptionHtml": "PLEASE NOTE- As of March 2013 I am discontinuing this mod. It will instead be replaced by a new mod which is available here: http://skyrim.nexusmods.com/mods/35235/?\r\n\r\nThis mod adds Giant creatures to many locations in Skyrim. As well as being larger than their normal counterparts, the Behemoths are also a lot tougher making them good opponents for players looking for a challenge. In V1.1 the Dragon Behemoths are added. These present a real challenge as they are larger and stronger than normal dragons (you will know a Dragon Behemoth when you see one) and the biggest challenge of all is finding and killing the Dragon Behemoth Lord (you will definitely know when you see him)\r\n\r\nBehemoths are found in many locations across Skyrim, a good place to look is outside cities although there is no guarantee that one will definitely be there as some behemoths wander around skyrim and as such can be encountered randomly.\r\nBehemoths are found in some dungeons and wilderness locations (such as Blackreach).\r\n\r\nI should probably make this clear. This mod does NOT affect normal/vanilla creatures encountered in normal circumstance in the wilderness/dungeons etc. Behemoths are unique, respawning (in most cases) creatures with new ID's, names and stats. \r\n\r\n In V1 most cities have a Behemoth, in V1.1 the Behemoths have been removed from the cities. \r\n\r\nThe size change in the Behemoths ranges from twice normal size to ten times normal size in some cases. \r\nNot all Behemoths are immediately hostile and some are even friendly. Most of the Behemoths are respawning so you can come back to challenge them again. Bear in mind this mod is just a bit of fun and is not to be taken too seriously. \r\n\r\nAs featured in elvir89088's Skyrim mods weekly \r\n[youtube]DESW1_vNPfQ[/youtube]\r\n\r\nChange log-\r\nV1- Behemoths added to 7 cities 1 dungeon and 2 wilderness locations.\r\nV1.1- Behemoths removed from cities, added 1 more dungeon Behemoth, 6 new wilderness behemoths and Dragon Behemoths.\r\nIncompatability- None that I'm aware of although mods that change vanilla creatures may cause problems",
  "categoryId": "83",
  "version": "V1.1",
  "author": "Drakynval",
  "createdUnix": "1345229931",
  "updatedUnix": "1345239295",
  "containsAdultContent": false,
  "uploadedBy": "Drakynval",
  "primaryFile": null,
  "files": [
    {
      "fileId": "82290",
      "name": "Behemoth Giant Creature",
      "version": "V1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "21",
      "fileName": "Behemoth Giant Creature-22603-V1.rar",
      "uploadedUnix": "1345230108",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/cab4ba24afe321ebcb87ecf610c57eca3d6bdcbe3067c609b02adbdef00211ab/analysis/1407103351/",
      "changelogHtml": " Adds behemoths to skyrim <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Behemoth%20Giant%20Creature-22603-V1.rar?fid=82290&ttl=1535792230&ri=8192&rs=8192&setec=e76a45fb061b442b62015fe7e4fc84a7"
    },
    {
      "fileId": "82308",
      "name": "Skyrim Behemoths",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "32",
      "fileName": "Skyrim Behemoths-22603-v1-1.rar",
      "uploadedUnix": "1345239295",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4f7e3161ae9b53860da80262ba1e68fb0e7245c8753f0ec3f7bb37d9da593f8d/analysis/1407103503/",
      "changelogHtml": " Removes Behemoths from towns to town outskirts <br/> \n Adds dragon lords <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Behemoths-22603-v1-1.rar?fid=82308&ttl=1535792231&ri=8192&rs=8192&setec=4eee37180a75752c7e18f46c9dc3bb6a"
    }
  ]
}