{
  "modId": 22622.0,
  "modName": "Werewolves Occurring Naturally",
  "summary": "Have werewolves occur naturally in the forests of Skyrim.",
  "descriptionHtml": "Ahoy,\r\n\r\nEssentially my goal in this was to introduce werewolves in a way so that they simply happen. I use ToL so I wanted to get infected naturally but there is only one pre-placed wild werewolf in the game. With this mod there are no pre-placed location which they may spawn. They spawn naturally with other forest predators.\r\n\r\nThat being said, the percentages towards them appearing are *very* low. Do not expect to see werewolves around every corner in the woods. You will have to spend a while, and get lucky, to see one, and if you have a mod that allows you to get infected then enjoy.\r\n\r\nIn all earnestness, my first attempt ended up with werewolves everywhere when I learned that the game naturally leans towards the high end of spawns (and at 38, the Vargr was beyond any other naturally occurring predator. So though the Creation Kit was saying that the chances were slim, they were all over. After substantial testing at all spawn levels (1, 6, 12, 20, 28, and 38) werewolves are now indeed, rare. \r\n\r\nFAQ:\r\nQ. Where can I most likely find Werewolves?\r\nA. Nearby Riften and Falkreath. I would recommend Riften as it appears to have more overall Forest Predator spawns.\r\nQ. Will this mod allow werewolves to infect me?\r\nA. No, this simply adds them to the natural spawn list. If you want to get infected, I suggest Tales of Lycanthropy which is here http://skyrim.nexusmods.com/mods/12687\r\nQ. I have been looking forever and can\\'t find a werewolf!\r\nA.  When I say the chances of them appearing are slim, I mean 1-2% around most levels. I spent a fair deal of time running around a 500% speed and found very few, good hunting.\r\nQ. Does this mod change/is this mod compatible with...?\r\nA. All this mod changes is *one* spawn list, it is used frequently in forested areas. That is all it does, so assuming that the mod does not change that leveled list, it is compatible, if it does, then it\\'s not. That being said if you prefer this leveled list, you can always load it last in your order and it would most likely overwrite the other mods list.\r\n\r\nNote:\r\nNew Version 1.1: Now doesn\\'t require dawnguard, sorry about that.\r\n\r\nWerewolves Invading Naturally is something I made in response to a comment; it is, for the most part, a joke and causes werewolves to be absolutely everywhere in forests, DL at your own risk. Now also Independent from Dawnguard",
  "categoryId": "83",
  "version": "1.1",
  "author": "Ilseroth",
  "createdUnix": "1345259275",
  "updatedUnix": "1345318769",
  "containsAdultContent": false,
  "uploadedBy": "Ilseroth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "82536",
      "name": "Werewolves Occurring Naturally",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Werewolves Occurring Naturally-22622-1-1.rar",
      "uploadedUnix": "1345317499",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/987110d1d2501185531f2c548b1ebd9ef299fb7cc2d8cb2573a9f0337aaef4b5/analysis/1407105722/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Werewolves%20Occurring%20Naturally-22622-1-1.rar?fid=82536&ttl=1535792285&ri=8192&rs=8192&setec=f8de1da0899c8f82e4f3e09f8ab79811"
    },
    {
      "fileId": "82546",
      "name": "Werewolves Invading Naturally",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Werewolves Invading Naturally-22622-1-1.rar",
      "uploadedUnix": "1345318769",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/393c2776965352c0ff2a5b8491822e271cb863067de9d12156ca769d6b871f81/analysis/1407105843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Werewolves%20Invading%20Naturally-22622-1-1.rar?fid=82546&ttl=1535792286&ri=8192&rs=8192&setec=840eb569011c6054fff941cdff60db32"
    }
  ]
}