{
  "modId": 22628.0,
  "modName": "DFB - XP Mod",
  "summary": "-Adds a powerful and Massively customizable XP Mod to Skyrim that does not require SKSE or Uncappers.",
  "descriptionHtml": "==================================================================\r\n= DFB - XP Mod\r\n==================================================================\r\n\r\nAuthor: Darkfirebird\r\nPermissions: Scripts cannot be used ( In part or whole ), redone, and the likes without written permission from me.\r\nAside for personal use only.\r\n\r\nYou may not repost this anywhere without any permission by me. ( Darkfirebird )\r\n\r\nWorks with old and new saves. Uses a unique way to patch up new global settings.\r\n\r\n==========\r\n=Overview=\r\n==========\r\n-Adds a powerful and Massively customizable XP Mod to Skyrim that does not require SKSE or Uncappers.\r\n\r\n===============\r\n= Description =\r\n===============\r\nThis mod is just a powerful XP Mod that tracks players kills, looting, pickpockets, thefts, purchases and more and\r\nconverts it to XP that in turn can be turned into Skill point(s).\r\n\r\nAfter seeing a few XP Mods that required SKSE or not easily set up and disliking the practice to level type of deal,\r\nI ended up making a massive script that users can fully customize and does not require SKSE or Uncappers.\r\n\r\nBy default: Skill gains are disabled.\r\n++ When changing from disabling and enabling skill games, they revert to default states.\r\n++ Disabled Skills : 1.0 XP Mult\r\n++ Enabled Skills : 0.3 XP Mult ( To work along side normal skill leveling. )\r\n++ Can be changed after using Set DFBXPSetMult to <Float>\r\n++ To enable or disable skill gains: Set DFBXPDisableSkill to # - 0 = Enable, 1 = Enable, or use the [XP - Options Menu] -> [Settings]\r\n\r\nWhen upgrading skills, you can select to \\'batch upgrade\\' them selecting from the menu 1~8 or cancel.\r\nIf you pick 7 and you only need 3 to reach your \\'cap\\', the mod will adjust the cost to only 3 instead and only upgrade it by that amount.\r\n\r\nThe amount of skill-ups you wish to use will not show if you have less then the required amounts.\r\nIE: You have 6 Skill points. All \\'upgrades\\' will show up to 6 instead of 8.\r\n\r\nTo view current stats - Goto Magic Menu -> Equip [XP - Options Menu] spell and cast and click [Check Stats].\r\nTo spend Skill points, use the spell: [XP - Spend Points].\r\nNOTE: When using the Skill Menu setting, your skills may not update until after you exit the menu or select another option.\r\n++After 1 Minute they return to their external location, or if you use another one.\r\nTo Patch: Use [XP - Options Menu] and select [Patcher] and select 1 of the choices. [ View Updating section for more info. ]\r\n++Or use the Auto-Patcher that usually shows up when updating.\r\n\r\nYou can also change how the XP Updates work.\r\nBy default, it will not update during combat. It will wait until combat is over before doing calculations.\r\n++If you wish to change this, You can use [XP - Options Menu] -> [Update XP Always] so it will always update / notify of XP Gains.\r\n++Alternatively, console command -> [ Set DFBXPSetOOC to # ] Where # can be 0 - Always, or 1 - Outside of combat.\r\n\r\nCurrently Tracked:\r\nLargest Bounty, Total Lifetime Bounty, Brawls Won, Armor Made, Armor Improved, Weapons Made, Weapons Improved, Critical Strikes,\r\nWeapons Disarmed, Dragon Souls Collected, Fines Paid, Food Eaten, Horses Owned, Horses Stolen, Houses Owned, Ingredients Eaten,\r\nIngredients Harvested, Items Stolen, Jail Escapes, Animals Killed, Automatons Killed, Creatures Killed, Daedra Killed, People Killed,\r\nUndead Killed, Dungeons Cleared, Locations Discovered, Standing Stones Found, Chests Looted, Gold Found, Magic Items Made, Murders,\r\nNirnroots Found, Quests Completed, The Companions Quests Completed, Civil War Quests Completed, Daedric Quests Completed,\r\nThe Dark Brotherhood Quests Completed, Main Quests Completed, Side Quests Completed, Thieves\\' Guild Quests Completed,\r\nCollege of Winterhold Quests Completed, Questlines Completed, Misc Objectives Completed, Shouts Learned, Shouts Mastered, Shouts Unlocked, Times Shouted,\r\nSkill Books Read, Souls Trapped, Soul Gems Used, Spells Learned, Poisons Mixed, Potions Mixed, Backstabs, Barters, Locks Picked, Items Pickpocketed,\r\nSneak Attacks, Bribes, Intimidations, Stores Invested In, Persuasions, Training Sessions, Necks Bitten, Vampirism Cures, Mauls, Werewolf Transformations,\r\nWings Plucked, Words Of Power Learned, Words Of Power Unlocked, Dragons Killed.\r\n\r\n\r\n\r\n=====================\r\n= Manually Updating =\r\n=====================\r\nWhen manually updating, all you need to do after installing is type in console [ Set DFBXPSetPatch to 1 ], [ Set DFBXPSetForcePatch to 1 ], [ Set DFBXPSetDefault to 1 ]\r\nor use the XP - Options Menu and selecting [Patcher] option and select one of the following patch settings below.\r\nNOTE: If nothing needs to be done, nothing will be done. ( They get ignored. No repatching if not needed! )\r\n+Normal Patch: Checks for DEFAULT values and patches them up. If user has changed them, it will not update them.\r\n+Force Patch: Ignores ANY current value. User edited or default get over-written by the new numbers.\r\n+Full Patch / Default: Automatically resets all global variables to their default standards.\r\n+Auto Patch: Automatically detects current version and new version of the plugin and asks if you wish to patch up or not on game start.\r\nNote: This started with Version 1.2b, it may not recognize anything lower so Full Patching is recommended.\r\n\r\n================\r\n= Auto Patcher =\r\n================\r\nThe new improved Auto Patcher comes with some new features.\r\nCurrently when you run an updated version of the plugin, you will be prompt to select an update type. There are:\r\n++Normal Patch: Only patch what is needed from previous patches.\r\n++Full Patch / Default: Changes all of the values to default. Excluding Levels etc.\r\n+Shows your current version ( Lowest is 1.22, aka 1.2b and below ) and new version ( If used. ) version number.\r\n+The auto-patcher was made to make updating easier with the plugin without making a clean save.\r\n+Can be disabled / enabled through console or the [XP - Options Menu].\r\n++Note: Although it is not perfect.\r\n++No real way to tell old saves from new aside checking XP and XP Level. ( Though some saves with the mod have none / default Lv 1 )\r\n++Any saves that have not used 1.2b but have used older versions, may have to force patch [ Set DFBXPSetDefault to 1 ] or use the spell [XP - Options Menu] -> [Patcher] -> [Full Patch/Default].\r\n\r\n================\r\n= Installation =\r\n================\r\nCopy [DFB - XP Mod.esp] and [DFB - XP Mod.bsa] to your Data Folder.\r\n+Run launcher and enable. ( Recommend use with Nexus Mod Manager. )\r\n\r\nTo Uninstall, disable and delete. Should have no bad side effects.\r\n\r\n====================\r\n= In-Game Settings =\r\n====================\r\nThese are in the _dfbxp.txt file.\r\n\r\nYou can edit this file to change values and in game type [ bat _dfbxp.txt ]\r\n+This is a quick way to set up defaults across all your saves. Also contains default values next to it.\r\n++Some commands ( Mostly the important ones. ) are in the XP - Options Menu.\r\n\r\n=================\r\n=Version History=\r\n=================\r\n== Version 1.4 ==\r\n-Added a new command: DFBXPSetAutoLevel. This allows the main script to automatically use the Skill Point Menu or Essences. ( Based on your settings. )\r\n-Fixed the small issue of not always getting your skills increased. ( Somehow removed them during some tests. )\r\n\r\n== Version 1.3b ==\r\n-Updated script calls to be more efficient.\r\n-Added a merger to XP Notifications. ( Meaning, instead of getting showing 3 lines, it shows 1 with the 3 causes. IE: Eating Ingredient, Learning a Spell, Killing an Animal. )\r\n-Changed some text around to suit the new merger. ( Smaller strings. )\r\n-Merged Dragon Kills into main script to support String Merging.\r\n-Added XP Checks for < 1 XP ( Notified if you did. Still calculates the correct amount.)\r\n-Added new command: DFBXPSetOOC. This disables the mod from updating during combat. It resumes automatically afterwards. ( Set DFBXPSetOOC to 1-After Combat or 0-Always ) Default After Combat.\r\n-Added new command: DFBXPSetNoteAll. This will show any untracked settings and display them as generic XP Gains. ( IE: You have gained [Gained XP] XP. )\r\n-Updated Oghma Infinium Quest check.\r\n-Fixes Patch Numbers being incorrect when using the Console Commands.\r\n\r\n== Version 1.3a ==\r\n-Updated Level Up Effect to be always silent. ( Sometimes wasn\\'t? )\r\n-Added Skill points to Skill Spend menu(s).\r\n-Added Patch number to Options Menu and Patch Menu.\r\n-Fixed multiple typos.\r\n-Added notifications for certain actions granting XP. ( XP Shown is estimated. )\r\n-Added 3 new commands: DFBXPSetNoteMajor ( Completing quests etc ), DFBXPSetNoteMinor ( Crafting and other small stuff. ), and DFBXPSetNoteOther ( Everything that isn\\'t Minor or Major. ).\r\n-Updated scripts to use better commands. ( Uses Mod instead of SetValue. )\r\n-Lowered Dragon Kill XP. ( They are linked to Creatures. Lowered to match intended amount. ~150 total. )\r\n-Updated Call Essence spell ( Now called [XP - Spend Points] to now either show a looping menu or activators. [ Set DFBXPSetUseMenu to 1 ] to use the Skill Menu instead of essences. Or use the Options Menu -> Settings.\r\n-If Auto-Patcher is disabled, You will be reminded to update if your current version is less then current. ( IE Disabled Auto Patcher in version 1.30 will show the message you need to update. )\r\n-Removed all old globals, spells etc. ( Old scripts etc no longer needed. )\r\n-Updated Stats \\'page\\'.\r\n\r\n== Version 1.3 ==\r\n-Removed XP - Call Magic Essences, XP - Call Combat Essences, XP - Call Stealth Essences. Merged into 1 spell, XP - Call Essences.\r\n-New spell: XP - Call Essences. Merges all essence skills into 3 essences. Each essence contains their 6 skillsets. ( Customizable to be SkyRE named also. )\r\n-Updated patcher to always check spells and specialized perks.\r\n-Auto Patcher now shows current patch and new patch ints.\r\n-Skill point Cost message now shows current Skill point amount, Current Skill / Skill Cap.\r\n-All new saves will follow the new patching system. Old saves also though some may need to force patch using the XP - Options -> Patcher -> [Full Patch / Default]. ( Any below 1.2b )\r\n-Essences of Skills have their own color.\r\n-Redone main tracker script entirely. ( Will not affect the mod in any way. Just cleaner looking and easier to manage. )\r\n-Added a \\\"Level Up\\\" effect. ( Can be disabled. Does not do anything aside visual. )\r\n-Fixed Auto Patcher Disable / Enable from XP - Options Menu.\r\n-Merged XP - Menu Spell and XP - Menu Spell - Patcher into XP - Options Menu.\r\n-Spending Skill points now auto checks skill and alerts if it is > cap before you spend. Also removes capped skills from selection.\r\n-Removed [Leave Interior] and Patcher automatically moves users out from the old interior.\r\n-Fixed missing default for Disable Skill. ( For Defaulting )\r\n-Updated, update speed to a quicker default ( 1s down from 5s. )\r\n-Adjusted a few messages.\r\n\r\n== Version 1.2b ==\r\n-Removed increasing skill costs. Instead it will always be 1 Per Skill.\r\n-Adjusted XP Bump (50) and Base (350), Capping out all skills to 100 will be noticebly shorter. ( About 1/10th less total XP needed. )\r\n-Added \\'batch upgrading\\' of skills. You can now pick 1~8 at a time, it will auto calculate if your trying to go over your cap. ( IE: 99 + 8 will calc to 1 skill, and 1 skill spent. )\r\n-Update Global now correctly registers as a float instead of an int.\r\n-Auto-Patcher now fully functional. ( From current tests. )\r\n-Main patch script now uses default globals that are not editable. ( Quicker patch creation / defaulting. )\r\n-Cleaned up scripts and old stuff that are no longer used.\r\n-New files now receive the correct quest xp settings. ( Was correct in the bat file but not in the plugin. )\r\n-Oghma Infinium Quest adjusted to new settings. You now get 6 levels ( 30 Skill points ) added.\r\n\r\n== Version 1.2a ==\r\n-Oghma Infinium Quest will grant 30 Skill point equivalent. ( If you have Skills Disabled. )\r\n-Main XP Script now recognizes custom Skill points per level.\r\n-Jailed, Days Jailed, Hours Slept, Hours Waited, Days Passed, Days as a Vampire / Werewolf, Diseases Contracted, Assaults and Tresspassing tracking removed. They were rather redundant and unneeded.\r\n-Enchanting, Sneak Attacks, Backstabs, Soul Gem Filling, Escaping Jail, Misc. Objective, Bribes, Intimidates, Persuasions, Investing, Owning Horses, Dragon Souls, Clearing a Dungeon, Mastering a Shout, Unlocked a Shout and Kills given more XP to compensate.\r\n-Patch Scripts updated.\r\n-Skill point Updater for run-time correctly shows new standard and will not ask new users to update their Skill points if they never used the plugin.\r\n-Updated XP Menu timers. They now run a lot quicker.\r\n\r\n== Version 1.2 ==\r\n-SkyRE Naming of essences implemented. [ Set DFBXPSetSkyRE to 1 ] to use the naming used in SkyRE.\r\n-XP Mod menu changed. Patch and Force Patch moved to its own \\'spell\\'.\r\n-XP Spell changed to XP - Menu Spell\r\n-New Spell Added: XP - Menu Spell - Patcher\r\n-Auto Patcher function enforces required patches. ( IE: New Patching spell being added automatically, Required global changes, etc. )\r\n-Fixed missing globals in main script. ( They never got used. )\r\n-Adjusted Skill points per level to nearly match normal leveling. Default is 5 per level. ( Old saves will be prompt to gain lost Skill points. )\r\n-New Command: DFBXPSetSPLevel. This sets how many Skill points a level you gain. Default is 5.\r\n\r\n== Version 1.1a ==\r\n-Updated Patcher scripts.\r\n-Increased default XP for reading skill books and quest. [ Use XP Spell and select \\'[Use Patch]\\' or \\'[Force Patch]\\' if you changed them. ]\r\n-Greatly increased XP from kills. ( ~4x more per kill. Dragons are ~2x more. )\r\n-Added Max XP Req Cap. [ Default is 2500, Disabled by default. ( Minimal is XP Base + Bump ] This was to remove the excessive XP req with uncappers and such if you use XP bump.\r\n-Added 2 new commands: DFBXPSetXPCap and DFBXPSetMaxCap. DFBXPSetXPCap enables or disables capping. DFBXPSetMaxCap is the max cap. Cannot be less then Base + Bump. ( Disabling and Enabling cap can be done through XP Spell. )\r\n-XP Required to level is now a static 800. ( In turn 100~200+ had Skill points adjusted to cost more. )\r\n-XP Bump is disabled. Though you can still set it up if needed / wanted.\r\n-Fixed a potential bug with the XP Level.\r\n-Essences are moved slightly lower.\r\n-Added a [Force Patch] command. This is to force any \\'unpatched\\' globals to be forced to new patched values. ( Ignores users settings. Best used if you have used custom values. )\r\n-Updated Skill point spending script. Now allows any number of Skill Cap options.\r\n\r\n== Version 1.1 ==\r\n-XP Spell Changed: Returns you to your last location. No longer uses Interior, Added \\\"Use Patch\\\", \\\"Enable / Disable Skill\\\", \\\"Leave Interior\\\" commands.\r\n-Spells Added: XP - Call Combat Essences, XP - Call Magic Essences, XP - Call Stealth Essences.\r\n-Command DFBXPSetReset no longer used. DFBXPSetPatch takes over.\r\n-XP Main Script: Removed old codes. Moved more to Patcher.\r\n-Old saves will no longer get any extra XP when loading for 1st time.\r\n-Fixed Essences not giving a skill when using Disable Skill.\r\n\r\n== Version 1.0a ==\r\n-XP Spell re-added. ( Was removed in the editor. It does not like big scripts. )\r\n-Works with Uncappers now. Default is Skill Cap of 100. ( Set DFBXPSetSkillCap to <Int> )\r\n-New Command: DFBXPUpdate: Set the time between XP updates. Default 5 seconds. ( Set to 0.1 if you want it near instant! )\r\n-New Command: DFBXPPatch: Updates old saves with new changes. ( Currently will just add spell to users if they need. )\r\n\r\n== Version 1.0 ==\r\n-Initial Release",
  "categoryId": "73",
  "version": "1.4",
  "author": "Darkfirebird",
  "createdUnix": "1345269523",
  "updatedUnix": "1347906379",
  "containsAdultContent": false,
  "uploadedBy": "Darkfirebird",
  "primaryFile": null,
  "files": [
    {
      "fileId": "82396",
      "name": "XP Mod 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "27",
      "fileName": "XP Mod 1_0-22628-1-0.zip",
      "uploadedUnix": "1345269553",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/07e600586aabebcbee5b6535b0b8ac428881fa2a8ddba4b0596939690928579d/analysis/1407104404/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XP%20Mod%201_0-22628-1-0.zip?fid=82396&ttl=1535792294&ri=8192&rs=8192&setec=682eb27e7b13376a18e565e48524a5b8"
    },
    {
      "fileId": "82535",
      "name": "XP Mod 1_0a",
      "version": "1.0a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "28",
      "fileName": "XP Mod 1_0a-22628-1-0a.zip",
      "uploadedUnix": "1345317356",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/ab96b517eac04ae107ab49986c4824b3bf4379c08dd646d7340facf40c3fe1ae/analysis/1407105669/",
      "changelogHtml": " XP Spell re-added. ( Was removed in the editor. It does not like big scripts. ) <br/> \n Works with Uncappers now. Default is Skill Cap of 100. ( Set DFBXPSetSkillCap to <Int> ) <br/> \n New Command: DFBXPUpdate: Set the time between XP updates. Default 5 seconds. ( Set to 0.1 if you want it near instant! ) <br/> \n New Command: DFBXPPatch: Updates old saves with new changes. ( Currently will just add spell to users if they need. ) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XP%20Mod%201_0a-22628-1-0a.zip?fid=82535&ttl=1535792295&ri=8192&rs=8192&setec=0d5c27549d4fd80c28bbb35fbc50842e"
    },
    {
      "fileId": "82599",
      "name": "XP Mod 1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "30",
      "fileName": "XP Mod 1_1-22628-1-1.zip",
      "uploadedUnix": "1345335983",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/16e373cedfed2dde3956da7cd201a1f6db7b0e62c3a06ab934a4c9d9c398992f/analysis/1407106266/",
      "changelogHtml": " XP Spell Changed: Returns you to your last location. No longer uses Interior, Added \\\"Use Patch\\\", \\\"Enable / Disable Skill\\\", \\\"Leave Interior\\\" commands. <br/> \n Spells Added: XP - Call Combat Essences, XP - Call Magic Essences, XP - Call Stealth Essences. <br/> \n Command DFBXPSetReset no longer used. DFBXPSetPatch takes over. <br/> \n XP Main Script: Removed old codes. Moved more to Patcher. <br/> \n Old saves will no longer get any extra XP when loading for 1st time. <br/> \n Fixed Essences not giving a skill when using Disable Skill. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XP%20Mod%201_1-22628-1-1.zip?fid=82599&ttl=1535792295&ri=8192&rs=8192&setec=1e6a28170d0915142f22f43e9dc83d96"
    },
    {
      "fileId": "82678",
      "name": "XP Mod Adjusted Perks and Effs 1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "XP Mod Adjusted Perks and Effs 1_1-22628-1-1.zip",
      "uploadedUnix": "1345366617",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4e0efe151913183993b6747dd35cd73f05f1b1d76ddf1a7f350ef0fb676b6c30/analysis/1407107071/",
      "changelogHtml": " XP Spell Changed: Returns you to your last location. No longer uses Interior, Added \\\"Use Patch\\\", \\\"Enable / Disable Skill\\\", \\\"Leave Interior\\\" commands. <br/> \n Spells Added: XP - Call Combat Essences, XP - Call Magic Essences, XP - Call Stealth Essences. <br/> \n Command DFBXPSetReset no longer used. DFBXPSetPatch takes over. <br/> \n XP Main Script: Removed old codes. Moved more to Patcher. <br/> \n Old saves will no longer get any extra XP when loading for 1st time. <br/> \n Fixed Essences not giving a skill when using Disable Skill. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XP%20Mod%20Adjusted%20Perks%20and%20Effs%201_1-22628-1-1.zip?fid=82678&ttl=1535792296&ri=8192&rs=8192&setec=ea35987c06208729f5b045185b5dfa3b"
    },
    {
      "fileId": "83081",
      "name": "XP Mod Adjusted Perks and Effs",
      "version": "1.1a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "XP Mod Adjusted Perks and Effs 1_1a-22628-1-1a.zip",
      "uploadedUnix": "1345498527",
      "modVersion": "1.1a",
      "virusScanUrl": "https://www.virustotal.com/file/3e3ba8f9d60c778f395f5b05a579b8975b4b18c5e5bdb97ba5491b274292c5fd/analysis/1407110704/",
      "changelogHtml": " Updated Patcher scripts. <br/> \n Increased default XP for reading skill books and quest. [ Use XP Spell and select \\'[Use Patch]\\' or \\'[Force Patch]\\' if you changed them. ] <br/> \n Greatly increased XP from kills. ( ~4x more per kill. Dragons are ~2x more. ) <br/> \n Added Max XP Req Cap. [ Default is 2500, Disabled by default. ( Minimal is XP Base + Bump ] This was to remove the excessive XP req with uncappers and such if you use XP bump. <br/> \n Added 2 new commands: DFBXPSetXPCap and DFBXPSetMaxCap. DFBXPSetXPCap enables or disables capping. DFBXPSetMaxCap is the max cap. Cannot be less then Base + Bump. ( Disabling and Enabling cap can be done through XP Spell. ) <br/> \n XP Required to level is now a static 800. ( In turn 100~200+ had skill points adjusted to cost more. ) <br/> \n XP Bump is disabled. Though you can still set it up if needed / wanted. <br/> \n Fixed a potential bug with the XP Level. <br/> \n Essences are moved slightly lower. <br/> \n Added a [Force Patch] command. This is to force any \\'unpatched\\' globals to be forced to new patched values. ( Ignores users settings. Best used if you have used custom values. ) <br/> \n Updated Skill Point spending script. Now allows any number of Skill Cap options. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XP%20Mod%20Adjusted%20Perks%20and%20Effs%201_1a-22628-1-1a.zip?fid=83081&ttl=1535792296&ri=8192&rs=8192&setec=bdee94e48fdccffdf5915058f5a1c8a9"
    },
    {
      "fileId": "83086",
      "name": "XP Mod 1_1a",
      "version": "1.1a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "34",
      "fileName": "XP Mod 1_1a-22628-1-1a.zip",
      "uploadedUnix": "1345498742",
      "modVersion": "1.1a",
      "virusScanUrl": "https://www.virustotal.com/file/960eb268cc03dbdcecdd053c4de7b1e34e7fea1487b40fa20a1c89857f376341/analysis/1407110822/",
      "changelogHtml": " Updated Patcher scripts. <br/> \n Increased default XP for reading skill books and quest. [ Use XP Spell and select \\'[Use Patch]\\' or \\'[Force Patch]\\' if you changed them. ] <br/> \n Greatly increased XP from kills. ( ~4x more per kill. Dragons are ~2x more. ) <br/> \n Added Max XP Req Cap. [ Default is 2500, Disabled by default. ( Minimal is XP Base + Bump ] This was to remove the excessive XP req with uncappers and such if you use XP bump. <br/> \n Added 2 new commands: DFBXPSetXPCap and DFBXPSetMaxCap. DFBXPSetXPCap enables or disables capping. DFBXPSetMaxCap is the max cap. Cannot be less then Base + Bump. ( Disabling and Enabling cap can be done through XP Spell. ) <br/> \n XP Required to level is now a static 800. ( In turn 100~200+ had skill points adjusted to cost more. ) <br/> \n XP Bump is disabled. Though you can still set it up if needed / wanted. <br/> \n Fixed a potential bug with the XP Level. <br/> \n Essences are moved slightly lower. <br/> \n Added a [Force Patch] command. This is to force any \\'unpatched\\' globals to be forced to new patched values. ( Ignores users settings. Best used if you have used custom values. ) <br/> \n Updated Skill Point spending script. Now allows any number of Skill Cap options. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XP%20Mod%201_1a-22628-1-1a.zip?fid=83086&ttl=1535792297&ri=8192&rs=8192&setec=ca0a4182abdbf99cc771f2e741f96a92"
    },
    {
      "fileId": "83131",
      "name": "XP Mod 1_1a SkyRE Naming",
      "version": "1.1a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "34",
      "fileName": "XP Mod 1_1a SkyRE Naming-22628-1-1a.zip",
      "uploadedUnix": "1345512248",
      "modVersion": "1.1a",
      "virusScanUrl": "https://www.virustotal.com/file/5dc04db5b91131a2303afd1a221affa330738c5b0e95d29331d967b29f90fc7c/analysis/1407111318/",
      "changelogHtml": " Updated Patcher scripts. <br/> \n Increased default XP for reading skill books and quest. [ Use XP Spell and select \\'[Use Patch]\\' or \\'[Force Patch]\\' if you changed them. ] <br/> \n Greatly increased XP from kills. ( ~4x more per kill. Dragons are ~2x more. ) <br/> \n Added Max XP Req Cap. [ Default is 2500, Disabled by default. ( Minimal is XP Base + Bump ] This was to remove the excessive XP req with uncappers and such if you use XP bump. <br/> \n Added 2 new commands: DFBXPSetXPCap and DFBXPSetMaxCap. DFBXPSetXPCap enables or disables capping. DFBXPSetMaxCap is the max cap. Cannot be less then Base + Bump. ( Disabling and Enabling cap can be done through XP Spell. ) <br/> \n XP Required to level is now a static 800. ( In turn 100~200+ had skill points adjusted to cost more. ) <br/> \n XP Bump is disabled. Though you can still set it up if needed / wanted. <br/> \n Fixed a potential bug with the XP Level. <br/> \n Essences are moved slightly lower. <br/> \n Added a [Force Patch] command. This is to force any \\'unpatched\\' globals to be forced to new patched values. ( Ignores users settings. Best used if you have used custom values. ) <br/> \n Updated Skill Point spending script. Now allows any number of Skill Cap options. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XP%20Mod%201_1a%20SkyRE%20Naming-22628-1-1a.zip?fid=83131&ttl=1535792297&ri=8192&rs=8192&setec=e99a5ee6130a2c0c25036a489bd1af83"
    },
    {
      "fileId": "83252",
      "name": "XP Mod 1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35",
      "fileName": "XP Mod 1_2-22628-1-2.zip",
      "uploadedUnix": "1345570595",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/128f2121810493cb3c4857f43a71ba8b2abd62427e699fc8b63dd781f436155e/analysis/1407112622/",
      "changelogHtml": " SkyRE Naming of essences implemented. [ Set DFBXPSetSkyRE to 1 ] to use the naming used in SkyRE. <br/> \n XP Mod menu changed. Patch and Force Patch moved to its own \\'spell\\'. <br/> \n XP Spell changed to XP - Menu Spell <br/> \n New Spell Added: XP - Menu Spell - Patcher <br/> \n Auto Patcher function enforces required patches. ( IE: New Patching spell being added automatically, Required global changes, etc. ) <br/> \n Fixed missing globals in main script. ( They never got used. ) <br/> \n Adjusted Skillpoints per level to nearly match normal leveling. Default is 5 per level. ( Old saves will be prompt to gain lost Skillpoints. ) <br/> \n New Command: DFBXPSetSPLevel. This sets how many skillpoints a level you gain. Default is 5. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XP%20Mod%201_2-22628-1-2.zip?fid=83252&ttl=1535792297&ri=8192&rs=8192&setec=776fcb44dc5212c49013570bfb1bdaa0"
    },
    {
      "fileId": "83607",
      "name": "XP Mod 1_2a",
      "version": "1.2a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35",
      "fileName": "XP Mod 1_2a-22628-1-2a.zip",
      "uploadedUnix": "1345694956",
      "modVersion": "1.2a",
      "virusScanUrl": "https://www.virustotal.com/file/bb99bf1ddd61a99dc4c8c74464c7f71cfdd52bf681aaa223c82c4baef739a058/analysis/1407115866/",
      "changelogHtml": " Oghma Infinium Quest will grant 30 Skillpoint equivalent. ( If you have Skills Disabled. ) <br/> \n Main XP Script now recognizes custom skillpoints per level. <br/> \n Jailed, Days Jailed, Hours Slept, Hours Waited, Days Passed, Days as a Vampire / Werewolf, Diseases Contracted, Assaults and Tresspassing tracking removed. They were rather redundant and unneeded. <br/> \n Enchanting, Sneak Attacks, Backstabs, Soul Gem Filling, Escaping Jail, Misc. Objective, Bribes, Intimidates, Persuasions, Investing, Owning Horses, Dragon Souls, Clearing a Dungeon, Mastering a Shout, Unlocked a Shout and Kills given more XP to compensate <br/> \n Patch Scripts updated. <br/> \n Skillpoint Updater for run-time correctly shows new standard and will not ask new users to update their skillpoints if they never used the plugin. <br/> \n Updated XP Menu timers. They now run a lot quicker. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XP%20Mod%201_2a-22628-1-2a.zip?fid=83607&ttl=1535792298&ri=8192&rs=8192&setec=1b4766a5b0b7ae2bad7c1f4963be743d"
    },
    {
      "fileId": "84473",
      "name": "XP Mod 1_2b",
      "version": "1.2b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "38",
      "fileName": "XP Mod 1_2b-22628-1-2b.zip",
      "uploadedUnix": "1346017921",
      "modVersion": "1.2b",
      "virusScanUrl": "https://www.virustotal.com/file/204add0f437d0368a83a82688d142c55014a08e50551cb2d5291ae4502095779/analysis/1407124322/",
      "changelogHtml": " Removed increasing skill costs. Instead it will always be 1 Per Skill. <br/> \n Adjusted XP Bump (50) and Base (350), Capping out all skills to 100 will be noticebly shorter. ( About 1/10th less total XP needed. ) <br/> \n Added \\'batch upgrading\\' of skills. You can now pick 1~8 at a time, it will auto calculate if your trying to go over your cap. ( IE: 99 + 8 will calc to 1 skill, and 1 skill spent. ) <br/> \n Update Global now correctly registers as a float instead of an int. <br/> \n Auto-Patcher now fully functional. ( From current tests. ) <br/> \n Main patch script now uses default globals that are not editable. ( Quicker patch creation / defaulting. ) <br/> \n Cleaned up scripts and old stuff that are no longer used. <br/> \n New files now receive the correct quest xp settings. ( Was correct in the bat file but not in the plugin. ) <br/> \n Oghma Infinium Quest adjusted to new settings. You now get 6 levels ( 30 Skillpoints ) added. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XP%20Mod%201_2b-22628-1-2b.zip?fid=84473&ttl=1535792298&ri=8192&rs=8192&setec=c16462b9439f6b63fc7b4f8435a76c5e"
    },
    {
      "fileId": "85381",
      "name": "XP Mod 1_3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "109",
      "fileName": "XP Mod 1_3-22628-1-3.zip",
      "uploadedUnix": "1346355353",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/fb6757d50e93e1f0bada27e612ab3bd71e9049609c8f8991ba649b0de96d4ef9/analysis/1407133646/",
      "changelogHtml": " Spending skill points now auto checks skill and alerts if it is > cap before you spend. Also removes capped skills from selection. <br/> \n Removed [Leave Interior] and Patcher automatically moves users out from the old interior. <br/> \n Fixed missing default for Disable Skill. ( For Defaulting ) <br/> \n Updated, update speed to a quicker default ( 1s down from 5s. ) <br/> \n Adjusted a few messages. <br/> \n Essences of Skills have their own color. <br/> \n Redone main tracker script entirely. ( Will not affect the mod in any way. Just cleaner looking and easier to manage. ) <br/> \n Added a \\\"Level Up\\\" effect. ( Can be disabled. Does not do anything aside visual. ) <br/> \n Fixed Auto Patcher Disable / Enable from XP - Options Menu. <br/> \n Merged XP - Menu Spell and XP - Menu Spell - Patcher into XP - Options Menu. <br/> \n All new saves will follow the new patching system. Old saves also though some may need to force patch using the XP - Options -> Patcher -> [Full Patch / Default]. ( Any below 1.2b ) <br/> \n Skillpoint Cost message now shows current skillpoint amount, Current Skill / Skill Cap. <br/> \n Auto Patcher now shows current patch and new patch ints. <br/> \n Updated patcher to always check spells and specialized perks. <br/> \n New spell: XP - Call Essences. Merges all essence skills into 3 essences. Each essence contains their 6 skillsets. ( Customizable to be SkyRE named also. ) <br/> \n Removed XP - Call Magic Essences, XP - Call Combat Essences, XP - Call Stealth Essences. Merged into 1 spell, XP - Call Essences. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XP%20Mod%201_3-22628-1-3.zip?fid=85381&ttl=1535792299&ri=8192&rs=8192&setec=b4f1af7860369c4e40db8f8108f2ec60"
    },
    {
      "fileId": "87017",
      "name": "XP Mod 1_3a",
      "version": "1.3a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "111",
      "fileName": "XP Mod 1_3a-22628-1-3a.zip",
      "uploadedUnix": "1347050037",
      "modVersion": "1.3a",
      "virusScanUrl": "https://www.virustotal.com/file/491323d89f58952052e0467791f2ecdde6ddc85bf9019dcef8f9dd6149d18ecf/analysis/1407151806/",
      "changelogHtml": " Updated Level Up Effect to be always silent. ( Sometimes wasn\\'t? ) <br/> \n Added Skill points to Skill Spend menu(s). <br/> \n Added Patch number to Options Menu and Patch Menu. <br/> \n Fixed multiple typos. <br/> \n Added notifications for certain actions granting XP. ( XP Shown is estimated. ) <br/> \n Added 3 new commands: DFBXPSetNoteMajor ( Completing quests etc ), DFBXPSetNoteMinor ( Crafting and other small stuff. ), and DFBXPSetNoteOther ( Everything that isn\\'t Minor or Major. ). <br/> \n Updated scripts to use better commands. ( Uses Mod instead of SetValue. ) <br/> \n Lowered Dragon Kill XP. ( They are linked to Creatures. Lowered to match intended amount. ~150 total. ) <br/> \n Updated Call Essence spell ( Now called [XP - Spend Points] to now either show a looping menu or activators. [ Set DFBXPSetUseMenu to 1 ] to use the Skill Menu instead of essences. Or use the Options Menu -> Settings. <br/> \n If Auto-Patcher is disabled, You will be reminded to update if your current version is less then current. ( IE Disabled Auto Patcher in version 1.30 will show the message you need to update. ) <br/> \n Removed all old globals, spells etc. ( Old scripts etc no longer needed. ) <br/> \n Updated Stats \\'page\\'. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XP%20Mod%201_3a-22628-1-3a.zip?fid=87017&ttl=1535792299&ri=8192&rs=8192&setec=86313906ba5b0974e4a924c03e317a2b"
    },
    {
      "fileId": "88127",
      "name": "XP Mod 1_3b",
      "version": "1.3b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "111",
      "fileName": "XP Mod 1_3b-22628-1-3b.zip",
      "uploadedUnix": "1347500482",
      "modVersion": "1.3b",
      "virusScanUrl": "https://www.virustotal.com/file/b573da33c92286de5e6857f308415512547eb63685e6caf3352dc530a5da92f4/analysis/1407162426/",
      "changelogHtml": " Updated script calls to be more efficient. <br/> \n Added a merger to XP Notifications. ( Meaning, instead of getting showing 3 lines, it shows 1 with the 3 causes. IE: Eating Ingredient, Learning a Spell, Killing an Animal. ) <br/> \n Changed some text around to suit the new merger. ( Smaller strings. ) <br/> \n Merged Dragon Kills into main script to support String Merging. <br/> \n Added XP Checks for < 1 XP ( Notified if you did. Still calculates the correct amount.) <br/> \n Added new command: DFBXPSetOOC. This disables the mod from updating during combat. It resumes automatically afterwards. ( Set DFBXPSetOOC to 1-After Combat or 0-Always ) Default After Combat. <br/> \n Added new command: DFBXPSetNoteAll. This will show any untracked settings and display them as generic XP Gains. ( IE: You have gained 30 XP. ) <br/> \n Updated Oghma Infinium Quest check. <br/> \n Fixes Patch Numbers being incorrect when using the Console Commands. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XP%20Mod%201_3b-22628-1-3b.zip?fid=88127&ttl=1535792300&ri=8192&rs=8192&setec=2f32ed014ee021f26a4f5e4442721987"
    },
    {
      "fileId": "89034",
      "name": "XP Mod 1_4",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "112",
      "fileName": "XP Mod 1_4-22628-1-4.zip",
      "uploadedUnix": "1347906379",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/d924bba48558aea52d075ffb6fb5244931921992fb89b7220ffa36b5b6604afc/analysis/1407171489/",
      "changelogHtml": " Added a new command: DFBXPSetAutoLevel. This allows the main script to automatically use the Skill Point Menu or Essences. ( Based on your settings. ) <br/> \n Fixed the small issue of not always getting your skills increased. ( Somehow removed them during some tests. ) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XP%20Mod%201_4-22628-1-4.zip?fid=89034&ttl=1535792300&ri=8192&rs=8192&setec=f7e29a44db140182351a4b0723c4f8b3"
    }
  ]
}