{
  "modId": 22623.0,
  "modName": "Magickal Ore Mining",
  "summary": "Adds the \\\"Extract Ore\\\" spell to the Alteration school of magic, which allows the player to mine ore veins without the need for a pickaxe!",
  "descriptionHtml": "*Update: If you like this mod, try out \\\"Mining Flames\\\" by Vonwarr. His mod allows you to mine using the \\\"Flames\\\" spell immediately available to all characters. Savage Hammer also has a mod called \\\"Extract Ore Spell\\\" that should do the same, but with an Alteration spell. Both of these mods have been around longer, but didn\\'t show up in the first 12 or so pages of my search results when looking for a magical mining mod. At that point I gave up looking and decided to make my own. Other Nexus users have since made me aware of their excellent mods and now there are at least 3 to choose from, so have a ball! ;)\r\n\r\nHere\\'s a video spotlight created by Steam Workshop user Peckett of AussieTechTeam!\r\n[youtube]QqYhWY5Zkl4[/youtube]\r\n\r\nThis mod was developed using nothing but vanilla Skyrim assets and the Creation Kit. \r\n\r\nDownload this mod to add the \\\"Extract Ore\\\" spell to the Alteration school of magic, allowing you to mine mineral ore without the need for a pickaxe! You may purchase the spell directly from Lucan at the Riverwood Trader or find it randomly as I\\'ve added the spell tome to leveled lists appropriate for Apprentice-level Alteration tomes.\r\n\r\nThe inspiration for this mod came in the form of a frustration that I\\'m sure many of you share: having a mage character with limited carry weight who also happens to be a blacksmith. While exploring the land of Skyrim I seemed to discover TONS of ore veins, but my puny magister couldn\\'t be bothered to lug around a 10-lb. pickaxe. Others have come up with clever solutions to the problem via conjurable mining tools (no longer functioning after Dawnguard, I hear) and capacity-increasing spells/equipment, but I wanted a solution that reflected my character\\'s expert grasp of the arcane arts while simultaneously eliminating the requirement for a physical implement. Enter the Extract Ore spell. Enjoy!\r\n\r\nGus\r\n\r\nUpcoming Features: (Full-time Nursing student, so don\\'t expect lightning fast results!)\r\n-Replace generic Alteration inventory art with more appropriate telekinesis art *DONE*\r\n-Add support for dual casting *DONE*\r\n-Slow down mining speed for one-handed use\r\n-Speed up dual casting mining times\r\n\r\nVersion History:\r\nv1.2- Changed inventory art to telekinesis. Allowed dual-casting (without adding scripts to the spell I doubt this will change the speed at which mining occurs, so it will most likely only effect aesthetics.)\r\nv1.1- Overhauled spell effects and moved spell to Alteration school. Increased cost of casting to balance extreme convenience.\r\nv1.0- Initial release! Destruction spell with light beam effect that mines ore from mineral veins.\r\n\r\nAuthor notes:\r\nSeeing as this mod contains only vanilla assets, feel free to pull it apart and use it. I only ask that if my spell inspires you or makes it into one of your mods that you credit me for my 15 minutes of arduous labor. Also, please refrain from reposting this file on other sites without my express permission. Thank you! :)\r\n\r\nFile credits:\r\nBethesda- for their excellent, albeit incomplete role-playing experience ;)\r\nMy wife- for putting up with my gaming addiction.\r\nMy mom- because you should always credit your mom when you do something noteworthy! ",
  "categoryId": "75",
  "version": "1.2",
  "author": "GusJake",
  "createdUnix": "1345260934",
  "updatedUnix": "1345771547",
  "containsAdultContent": false,
  "uploadedBy": "GusJake",
  "primaryFile": null,
  "files": [
    {
      "fileId": "82397",
      "name": "ExtractOreSpellv1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "ExtractOreSpellv1_1-22623-1-1.7z",
      "uploadedUnix": "1345270634",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f6a2b97d0df30a395c7476fde75aa4a18617b0f42d19c7167f1d2abb5a95373e/analysis/1407104405/",
      "changelogHtml": " Overhauled spell effects and moved spell to Alteration school. <br/> \n Increased cost of casting to balance extreme convenience. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ExtractOreSpellv1_1-22623-1-1.7z?fid=82397&ttl=1535792287&ri=8192&rs=8192&setec=7b414c479b52c1431aa55d0253c80cf9"
    },
    {
      "fileId": "83804",
      "name": "ExtractOreSpellv1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "ExtractOreSpellv1_2-22623-1-2.7z",
      "uploadedUnix": "1345771547",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/42f010088c60a896a381e3ff280332c1f9d8ebeb607494e0ab7be8e8c37c37a5/analysis/1407117554/",
      "changelogHtml": " Changed inventory art from generic Alteration to telekinesis as requested <br/> \n Allowed dual-casting <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ExtractOreSpellv1_2-22623-1-2.7z?fid=83804&ttl=1535792288&ri=8192&rs=8192&setec=67c73812f31a2365174d84355e42be5a"
    }
  ]
}