{
  "modId": 22650.0,
  "modName": "Enhanced Skyrim Factions - The Companions Guild",
  "summary": "Tired of being forced to be something you don&#39;t want to be? Think it&#39;s silly that a low-level mage with minimal weapon and armor skills can become leader of this famous band after only two weeks? No longer. Now you must truly earn your place among your Shield-Brothers and Sisters.",
  "descriptionHtml": "[color=#e6790f][size=5]Enhanced Skyrim Factions[/size][/color]\r<br />[color=#74b464][size=6]The Companions Guild[/size][/color]\r<br />\r<br />By DreamKing\r<br />Latest Full Version: 0.3.8, 18 July 2015\r<br />Latest Requirements-Only Version: 0.1.1, 13 January 2013\r<br />\r<br />[size=4][color=#74b464]Introduction[/color][/size]\r<br />\r<br />Skyrim&#39;s Companions guild questline suffers from being too short and too linear; it is possible for a low-level character, and/or one with minimal combat skills, to quickly accend to the highest ranks of this famed guild of warriors. Moreover the questline railroads the player, denying them the opportunity to make several key choices. ESF: Companions is a project that aims to improve this situation in several ways:\r<br />\r<br />1. Increase the number of radiant quests required to advance in the guild, and add skill, level, and time requirements for each of the guild&#39;s milestone story quests (status: done).\r<br />2. Add new choices and consequences to those milestone quests (status: in-progress, one major new choice added to the scene with Skjor and Aela in the Underforge).\r<br />3. Add new radiant and story quests, both during and after the vanilla questline (status: in-progress, one radiant quest added).\r<br />4. Miscellaneous other improvements (status: in-progress, many tweaks made, see changelog).\r<br /> \r<br />\r<br />[size=4][color=#74b464]Status[/color][/size]\r<br />\r<br />There are two versions of the mod available:\r<br />\r<br />The [b]Requirements Only[/b] version simply increases the number of radiant quests required between &#34;story&#34; quests in the guild questline, and adds skill, level, and time requirements as well. These requirements are all configurable via a SkyUI MCM panel, an included bat file, or console commands.\r<br />\r<br />The [b]Full[/b] version of the mod has those requirements and also adds new choices and consequences, expanded activity schedules around Jorrvaskr, various tweaks to the Companions NPCs and quests, and new (silent) dialogue, all to enhance the feeling of being a part of this fellowship of warriors.\r<br />\r<br />In general this page describes the Full version of the mod; to use the Requirements Only version, download it and consult the ReadMe file in the download.\r<br />\r<br />\r<br />[size=4][color=#74b464]Features[/color][/size]\r<br />\r<br />[color=#e6790f]New Choices[/color]\r<br />\r<br />The events surrounding a promotion that occurs mid-questline have been significantly overhauled, with a key new choice available to the player during a discussion with Skjor and Aela in the Underforge.\r<br />\r<br />[color=#e6790f]Requirements and Prerequisites[/color]\r<br />\r<br />The requirements can be customized through an included SkyUI MCM system. By default the requirements are:\r<br />\r<br />[b]Before Your Trial in &#34;Proving Honor&#34; (Quest C01)[/b]\r<br />- One defensive combat skill--Light or Heavy Armor, or Block--at least 30\r<br />- One weapon skill--One-Handed/Two-Handed/Archery--at least 30\r<br />- Player level at least 5\r<br />- At least 10 radiant quests done since joining (including one for each member of the Circle)\r<br />\r<br />[b]Before Being Invited to Join the Circle before &#34;The Silver Hand&#34; (Quest C03)[/b]\r<br />- One defensive combat skill--Light or Heavy Armor, or Block--at least 40\r<br />- One weapon skill--One-Handed/Two-Handed/Archery--at least 50\r<br />- Player level at least 10\r<br />- At least 8 radiant quests done since &#34;Proving Honor&#34;\r<br />\r<br />[b]Before Kodlak&#39;s Request in &#34;Blood&#39;s Honor&#34; (Quest C04)[/b]\r<br />- One defensive combat skill--Light or Heavy Armor, or Block--at least 50\r<br />- One weapon skill--One-Handed/Two-Handed/Archery--at least 60\r<br />- Player level at least 15\r<br />- At least 6 radiant quests done since &#34;The Silver Hand&#34;\r<br />   \r<br />[b]Other Configurable Changes[/b]\r<br />- You will need to do 2 radiant quests for Aela and Farkas before the radiant quests for Vilkas and Skjor will unlock.\r<br />- Members of the Thieves Guild cannot join the Companions; members of the Dark Brotherhood need at least 60 Speech to join.\r<br />- Former criminals who once accumulated a large bounty will be unable to join without at least 60 Speech.\r<br />- Vampires who are currently past stage 1 will be recognized for what they are and barred from joining until they cure themselves.\r<br />\r<br />All of these can be altered via the SkyUI MCM.\r<br />\r<br />[color=#e6790f]Other Changes and Features[/color]\r<br />\r<br />- Added a radiant animal pelt collection quest to Aela (this was existing content cut from the game, that I have lightly tweaked and restored).\r<br />- If you have done more radiant quests for Aela than any other Companion at the time of your Trial, it will be she rather than Farkas who is sent with you as your Observer during your Trial (again, this uses existing voice files and scripting cut from the vanilla game).\r<br />- Various changes to the Companions to better align their class skills, gear, combat styles and perks with their personalities. See the full list of changes in the &#34;Article&#34; section here on the Nexus.\r<br />- Rather than just loafing around all day, Companions now have detailed training schedules.\r<br />- Companions will spar with you in the training yard, after you&#39;ve joined.\r<br />- The Wolf Armor worn by the Circle will not be available for purchase from Eorlund until you have actually joined the Circle.\r<br />- The reward gold for Companions radiant quests can now be configured via the MCM.\r<br />- Added some (unvoiced) dialogue in various places for better roleplaying and atmosphere. Kodlak will talk a bit more when you first join, Ria can follow up on her promise to show you the ropes, Vilkas will follow up on his suggestion that you come to him with questions, Skjor will warn you to dismiss followers before beginning your Trial, etc.\r<br />- Extended the time Aela mourns at the end of the &#34;Silver Hand&#34; quest, giving the player a day or two to discuss Skjor with the other Companions. Also, she will now not offer her next quest until she is back at Jorrvaskr.\r<br />- Aela, Farkas and Vilkas can now give new radiant quests while they are your current follower (must be enabled through the MCM).\r<br />- Farkas will not initiate his &#34;Purity&#34; quest if the player has not &#34;cured&#34; themselves.\r<br />- Other smaller tweaks, see the changelog for a full list.\r<br />\r<br />\r<br />[size=4][color=#74b464]Getting It Working[/color][/size]\r<br />\r<br />You must be using Skyrim version 1.9 or above to use this mod; the game version number is displayed in-game when you view your Journal. I also highly recommend using SkyUI 4.1 and above to enable using the MCM system to configure this mod&#39;s options.\r<br />\r<br />The mod adds a substantial amount of silent (unvoiced) dialogue, so you will need both dialogue and general subtitles turned on (in the game&#39;s Settings &gt; Display menu), or use SKSE and the [url=http://www.nexusmods.com/skyrim/mods/14884/]Fuz Ro D&#39;Oh[/url] plugin, which displays subtitles only for unvoiced dialogue. If you can&#39;t stand silent dialogue, use the Requirements Only version of this mod.\r<br />\r<br />The mod can be installed into an existing game--it does not need a new game, although see the list of Known Issues below regarding a minor issue. For obvious reasons it works best when installed before you join the Companions. To install after you&#39;ve already joined the Companions, the most likely safe points would be while you&#39;re in Dustman&#39;s Cairn or Gallows Rock but before you kill the bosses in those locations. No guarantees, though. Upgraders, see below.\r<br />\r<br />Note that version 0.3 is a large and complex expansion, so you are advised to save frequently and keep a history of such saves rather than overwriting them as you play through the mod. And if you&#39;re installing this into an existing game, you should always keep at least one save game from before you installed, that you can revert back to in case of any problems.\r<br />\r<br />[color=#e6790f]Compatibility[/color]\r<br />\r<br />This mod makes a number of changes to the Companions guild, and as such it may not play well with other mods that edit the guild&#39;s quests,  characters, and locations. It does work with the Unofficial Skyrim Patch, and is designed to be used as a precursor to my [url=http://www.nexusmods.com/skyrim/mods/11450]ESF: Aela follower mod[/url], but neither is required.\r<br />\r<br />[u]Live Another Life[/u] is compatible; if you elect to start as a Companion, note that Vilkas has a few lines of dialogue based on you having overheard he and Kodlak speaking when you asked to join, so just imagine that happened.\r<br />\r<br />A patch is available in the Files tab for [u]Open Cities Skyrim[/u].\r<br />\r<br />A patch for [u]Requiem[/u] 1.9.3 is available [url=http://www.nexusmods.com/skyrim/mods/61621/]here[/url].\r<br />\r<br />[u]Better Jorrvaskr[/u] or other mods that add clutter to the Jorvaskr training yard are not supported and likely not compatible.\r<br />\r<br />[u]Complete Skyforge Kit AKA Skyrim Smithing[/u] is not compatible: it includes edits that break the Companions questline in both its vanilla form and with this mod.\r<br />\r<br />[u]Do not use mod-added map markers for Jorrvaskr[/u] to return after completing quests during the Companions questline.\r<br />\r<br />The [u]Increased Bounty and Guild Rewards[/u] mod causes quest-breaking problems because of the loose scripts it uses. Make sure ESFCompanions.esp is lower than it in your load order, and then manually remove the 14 files named QF_CR01_blahblah.pex through QF_CR14_blahblah.pex that it added to the Data/Scripts directory. You can use the MCM in this mod to configure radiant quest reward gold for the Companions in place of that mod.\r<br />\r<br />[u]Better Followers[/u] isn&#39;t recommended--it&#39;s been abandoned by its creator and left untouched for more than a year--but if you insist on using it, put my mod below it, and delete the C01QuestScript.pex that it tries to add to the Scripts directory.\r<br />\r<br />Moonlight Tales is compatible, with or without the Werewolf Mastery mod alongside it. If you use [u]Moonlight Tales alone[/u], place it [i]above[/i] ESFCompanions.esp in your load order and delete the C01QuestScript.pex file that MT adds to the Data/Scripts directory. (Newer versions of MT no longer include this file, so if you can&#39;t find it, don&#39;t worry about it.) If you use [u]Werewolf Mastery with MT[/u], place WerewolfMastery.esp [i]below[/i] ESFCompanions.esp (and you should not delete C01QuestScript.pex). When you come to the Open Circle quest, you should either 1) temporarily disable Aela, Farkas and Vilkas from being managed by Moonlight Tales or 2) choose someone other than your Trial Observer to fight with you. Otherwise your Observer will transform during the melee, and their magical attacks will leave you unable to advance.\r<br />\r<br />(If you use [u]Werewolf Mastery without Moonlight Tales[/u], you don&#39;t need to do anything special.)\r<br />\r<br />[u]Even Better Quest Objectives[/u] is compatible but should be positioned above this mod in your load order, as ESFC version 0.3 includes its own updated objectives based on EBQO for the Companions quests. EBQO patches made for use with version 0.2.1 of ESFC should not be used with version 0.3.\r<br />\r<br />Users of [u]UFO - Ultimate Follower Overhaul[/u] should make sure ESFCompanions.esp is below that mod in their load order, so that my changes to the Companion NPCs will have priority. The current stable release of UFO may also cause the sparring system to falsely report that you have someone following you because of a bug; a fix for UFO is being worked on.\r<br />\r<br />ESFCompanions.esp should be loaded below the .esp for [u]aMidianborn Skyforge Weapons/Content Addon[/u] for best results.\r<br />\r<br />Likewise load ESFCompanions.esp below [u]Cutting Room Floor[/u].\r<br />\r<br />If you encounter compatibility issues you can also try the Requirements Only version of this mod, which includes only the requirements component. That version should be highly compatible with all other mods, as it does not edit any default Skyrim scripts, quests, locations, or characters.\r<br />\r<br />[color=#e6790f]Installation[/color]\r<br />\r<br />This mod is packaged in an archive compatible with Wrye Bash&#39;s BAIN installation method and with the Nexus Mod Manager.\r<br />\r<br />To install manually, extract ESFCompanions.esp and ESFCompanions.bsa from the archive with [url=http://www.7-zip.org]7zip[/url] or a compatible program and place them into your game&#39;s Data directory. For most users this will be something like C:/Program Files (x86)/Steam/steamapps/common/skyrim/Data (although if it is, you may want to read up on moving Steam out of the Program Files directory to avoid permissions problems).\r<br />\r<br />Once installed and set to the proper place in your load order, just activate ESFCompanions.esp in your launcher and play.\r<br />\r<br />[color=#e6790f]Upgrading[/color]\r<br />\r<br />To upgrade from 0.3 and above, just replace the old ESFCompanions.esp and ESFCompanions.bsa files with the new ones and keep playing. If you&#39;re in a location with any of the Companions, you may need to leave and then re-enter for their outfit changes to take effect. You may also need to disable/enable Athis via the console if his armor disappears.\r<br />\r<br />If upgrading from the Version 0.1.1, the Requirements Only version, you will need to 1) make a save game, 2) exit Skyrim, 3) deactivate the mod and remove its ESFCompanions.esp and ESFCompanions.bsa files, 4) start Skyrim again, 5) load the save you made, 6) wait 60 seconds, 7) make another save, 8) exit Skyrim, and 9) then install the full version. If you had customized the requirements, you will need to do so again. Sorry about that.\r<br />\r<br />[color=#e6790f]Uninstallation[/color]\r<br />\r<br />Bethesda&#39;s official stance is that uninstalling mods is not possible with Skyrim. This is because information from a loaded mod is permanently added into any saved games made with that mod loaded, and persists thereafter. Make sure you keep a save game from before you installed this mod, that you can revert to in case of any problems or dissatisfaction.\r<br />\r<br />\r<br />[size=4][color=#74b464]Known Issues & FAQs[/color][/size]\r<br />\r<br />The mod includes a Troubleshooting section in the SkyUI MCM that may help resolve some common issues. Beyond that...\r<br />\r<br />[color=#e6790f][b]I can&#39;t get one of the Companions quests to work&#33;[/b][/color]\r<br />\r<br />Because this mod encompasses the whole Companions questline, it&#39;s tempting to see it as the cause of any problems with that questline; but the reality is that the vanilla questline has many bugs, and most issues people report have nothing to do with this mod. That doesn&#39;t mean this mod is perfect--see below--but before reporting a problem, 1) consult the [url=http://uesp.net/wiki/Skyrim:Companions#Quests]uesp.net page[/url] for the quest you&#39;re having trouble with to see if your problem is a known bug, and if there is a known solution; 2) use the Unofficial Skyrim Patch, it fixes many bugs and is updated more frequently than this mod; and 3) be wary of mods that add fast-travel markers to Whiterun ([i]never[/i] fast-travel directly to Jorrvaskr to conclude a quest), or make other edits to the city, because many Companions quests require passing through a certain trigger or location-change. I&#39;ve never had problems with fast-traveling to Dragonsreach on my way back from quests during testing, but if that doesn&#39;t work and you must fast travel, go to the Stables outside town and then run the rest of the way back.\r<br />\r<br />[color=#e6790f][b]One of the Companions is naked&#33;[/b][/color]\r<br />\r<br />The game sometimes fails to update the rendering of characters after outfit changes--they think they&#39;re wearing their armor, but you can&#39;t see it. What usually fixes this is opening the console with the NPC on-screen, clicking the NPC to select them (their ID will appear in the middle of the screen), and then enter the command &#34;disable&#34; followed by &#34;enable&#34;. This forces the game to update the NPC&#39;s 3D rendering. For Athis, you can also use the &#34;Shield-Siblings&#34; section of the MCM to toggle his outfit to a different choice, then back to whichever you want; for Aela and Farkas, there is also a section in the &#34;Troubleshooting&#34; area of the MCM menu that can help.\r<br />\r<br />[color=#e6790f][b]When I try to talk to the Companions, they have their weapons drawn and won&#39;t talk to me&#33;[/b][/color]\r<br />\r<br />See the first question. That&#39;s a vanilla issue--it means you have an unpaid Whiterun bounty. The Companions are members of the Whiterun guard faction, and react accordingly.\r<br />\r<br />[color=#e6790f][b]Will the Companions care if I join the Thieves Guild/join the Dark Brotherhood/become a vampire after Kodlak has already accepted me as a Companion?[/b][/color]\r<br />\r<br />Currently, they won&#39;t care. In future updates they will care if you are *caught* doing something criminal, or are wearing TG/DB faction armor when you talk with them. But they won&#39;t automatically know about your other guild affiliations or activities.\r<br />\r<br />[color=#e6790f][b]Are you going to do this same sort of thing for the other guilds?[/b][/color]\r<br /> \r<br />It&#39;s a reasonable question given my grandiose mod title, but nope, I&#39;ll leave the other factions to other modders. I only have so much time for modding, so I&#39;d rather focus my efforts and do a good job for just one faction, not a half-baked job for all the factions.\r<br />\r<br />If you like the sort of dialogue I add in this mod, I&#39;d encourage you to have a look at my [url=http://www.nexusmods.com/skyrim/mods/11450]Enhanced Skyrim Followers: Aela the Huntress[/url] follower expansion; this mod was only begun as a prelude to that. Beyond the Companions, there are plenty of mods that try to enhance the other guilds, such as [url=http://www.nexusmods.com/skyrim/mods/14157/]Thieves Guild Requirements[/url] & [url=http://www.nexusmods.com/skyrim/mods/14509/]Localized Thieves Guild Jobs[/url] for the Thieves Guild, and [url=http://www.nexusmods.com/skyrim/mods/38448]College of Winterhold Entrance Requirements[/url] & [url=http://www.nexusmods.com/skyrim/mods/37244]Missing Apprentices[/url] & [url=http://www.nexusmods.com/skyrim/mods/23971/]Research Thief[/url] & [url=http://www.nexusmods.com/skyrim/mods/10746/]Archmage Tolfdir[/url] for the Mage&#39;s College.\r<br />\r<br />[color=#e6790f][b]Can you make it so I can refuse the title that Kodlak bestows on me?[/b][/color]\r<br /> \r<br />It&#39;s certainly an idea I&#39;ve had, although I doubt it&#39;ll ever happen. Kodlak&#39;s journal explains part of the reason why not, and also I don&#39;t imagine the others would feel comfortable dishonoring his memory by going against his last request.\r<br /> \r<br />[color=#e6790f][b]Vilkas complains that I&#39;m using magic when Kodlak sends us out to spar&#33; (Or, Kodlak keeps restarting the fight in &#34;Open Circle&#34;&#33;)[/b][/color]\r<br />\r<br />Vilkas accusing you of using magic is a vanilla issue when you use a mod that puts a hidden &#34;cloak&#34; spell on the PC in order to detect nearby NPCs. The cloak hits the NPCs, and they perceive that magic is being used against them. Lots of mods do this--everything from combat mods, to mods like Footprints and Player Headtracking--and the problem will also happen with other quests that involve non-lethal fighting, like brawling. The problem is that in brawling or sparring, magic cast by the player on NPCs isn&#39;t allowed. Some mods like Wet & Cold allow you to turn their cloak effect off temporarily, and there is also a mod called [url=http://www.nexusmods.com/skyrim/mods/24020]Brawl Bugs Patch[/url] that is supposed to fix the problem.\r<br />\r<br />[color=#e6790f][b]Kodlak never gives the signal to begin the fight in &#34;Open Circle&#34;&#33;[/b][/color]\r<br />\r<br />This typically happens when you have another mod that edits the furniture on the Jorrvaskr porch; Kodlak then can&#39;t find the chair that he&#39;s supposed to move to before beginning the fight. Best bet is to load a save when &#34;Open Circle&#34; is running but before you told Kodlak who your partner will be, then in the console skip the fight:\r<br />\r<br />setstage ESFCOpenCircle 100 \r<br />\r<br />[color=#e6790f][b]I&#39;m trying to spar with someone and they tell me to have my &#34;friend&#34; wait inside--but I don&#39;t have any followers with me&#33;[/b][/color]\r<br />\r<br />Certain mods may make ingenious use of invisible player teammates for various utility functions; also, the popular UFO follower overhaul has a bug where it forgets to unset dismissed followers as teammates. Just tell your sparring opponent that they&#39;re mistaken, and you can begin sparring.\r<br />\r<br />[color=#e6790f][b]Aela said she cleared out Gallows Rock, but they&#39;re almost all still alive&#33;[/b][/color]\r<br />\r<br />It&#39;s a known issue.\r<br />\r<br />[color=#e6790f][b]Against the training dummies, some of the Companions get stuck and won&#39;t attack&#33;[/b][/color]\r<br />\r<br />Stupid AI is stupid. I&#39;ve thought about moving the training dummies/targets around a bit, but have been trying to avoid editing them to avoid conflicts with other mods. As it is, this is random: it&#39;ll work fine on one day, someone will get stuck the next. They always un-stick themselves eventually.\r<br />\r<br />[color=#e6790f][b]Some of the Silver Hand in &#34;Blood&#39;s Honor&#34; are labeled as ordinary bandits&#33;[/b][/color]\r<br />\r<br />This happens when you add either this mod and/or the Unofficial Skyrim Patch into a playthrough that was begun with neither. I think it&#39;s due to a USKP fix to avoid larger problems with that quest not starting.\r<br />\r<br />[color=#e6790f][b]The Companions tend to all cluster together near the Jorrvaskr entrance&#33;[/b][/color]\r<br /> \r<br />This is because of how the game engine only pays attention to NPCs near the player; it tends to &#34;forget&#34; what the Companions are supposed to be doing until the player character enters a cell adjacent to them, at which time it teleports them to the nearest spawn marker. In other words, there&#39;s nothing wrong, and nothing you or I can do about it. Just give them a few seconds and they should take up their usual schedules.\r<br />\r<br />\r<br />[size=4][color=#74b464]Contact Information[/color][/size]\r<br />\r<br />If you have problems, suggestions, or questions about the mod, the best way to get in touch is via the discussion tab for the mod on the Nexus or the thread for the mod in [url=http://forums.bethsoft.com/forum/183-skyrim-mods]the Skyrim Mods area on the Bethesda Forum[/url]. As of this writing, the current thread for the mod is [url=http://forums.bethsoft.com/topic/1512303-relz-enhanced-skyrim-factions-the-companions-guild-2/]here[/url].\r<br />\r<br />You can also send me private messages as [b]DreamKing[/b] (preferred) on [url=http://forums.bethsoft.com]the Bethesda Forum[/url], or on [url=http://forums.nexusmods.com]the Nexus Forums[/url] as [b]DreamKingMods[/b]. Please don&#39;t send support inquiries, though; you&#39;ll get better and faster help posting to the forums, since other people may be able to help you.\r<br />\r<br />\r<br />[size=4][color=#74b464]Disclaimer[/color][/size]\r<br />\r<br />Use of this mod may lead to broken quests, corrupt or bloated save games, and other issues. Make sure you keep a save game from before you installed this mod, than you can revert to in case of any problems.\r<br />\r<br />\r<br />[size=4][color=#74b464]Legal, Distribution, and Use of Assets[/color][/size]\r<br />\r<br />In part or in whole, you may not upload, re-host, or otherwise make this mod or an edited version you derive from it available at any other location under any circumstances without my express permission, except as specified here.\r<br />\r<br />If you downloaded this mod from an unauthorized location, be advised that there may be newer versions of the mod available with important fixes and additions posted on authorized sites, that you will not benefit from.\r<br />\r<br />If I do not respond to attempts to contact me via the methods listed in the &#34;Contact&#34; section of the latest release of this mod for 6 months, and have not given prior notice of planned absence, then consider this mod and its assets released to the community.\r<br />\r<br />\r<br />[size=4][color=#74b464]Thanks and Credits[/color][/size]\r<br />\r<br />Thanks to the users of the mod for their enthusiasm, and to MPBunny and deadarmour for their ideas.\r<br />\r<br />Thanks to the Unofficial Skyrim Patch team for their work correcting bugs, typos, etc., and for allowing me to incorporate their work into this mod where our edits to game records overlap. (Note that the UKSP still makes many important fixes to the Companions; my mod does not replace it.)\r<br />\r<br />Thanks to whickus and William Imm for allowing me to include the improved quest objectives relating to the Companions quests from their excellent Even Better Quest Objectives mod, and for William Imm for creating patches to ease compatibility with ESFC and several other mods.\r<br />\r<br />Thanks to the Unofficial Elder Scrolls Pages (http://www.uesp.net/) for being a frequent and valuable reference.\r<br />\r<br />Thanks to the Nexus Network (http://skyrim.nexusmods.com/) for providing a platform for mods and the community that exists around them.\r<br />\r<br />And of course credit and thanks go to Bethesda Softworks, for releasing and supporting modding tools for their games--without which this mod could not have been made.",
  "categoryId": "25",
  "version": "0.3.8",
  "author": "DreamKing",
  "createdUnix": "1345298118",
  "updatedUnix": "1437252389",
  "containsAdultContent": false,
  "uploadedBy": "DreamKingMods",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000002119",
      "name": "ESFCompanions REQUIREMENTS-ONLY VERSION",
      "version": "0.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "ESFCompanions REQUIREMENTS-ONLY VERSION-22650-0-1-1.7z",
      "uploadedUnix": "1358111917",
      "modVersion": "0.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2340191c1868848251fae48ca604b0681ebba1f0bb852198d145fea486637fa9/analysis/1407351727/",
      "changelogHtml": " Added SkyUI MCM configuration panel for changing requirements; needs SkyUI 3.1 and SKSE 1.6.6 or above. <br/> \n Added esfcsettings bat file for easier configuration when not using SkyUI. <br/> \n Fixed issue where quest requirements needed to be set to one fewer than the intended value to function correctly. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESFCompanions%20REQUIREMENTS-ONLY%20VERSION-22650-0-1-1.7z?fid=1000002119&ttl=1535792338&ri=8192&rs=8192&setec=0b1b03767c0c62131548251eb73c23b5"
    },
    {
      "fileId": "1000111478",
      "name": "ESFCompanions FULL VERSION",
      "version": "0.3.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6226",
      "fileName": "ESFCompanions FULL VERSION-22650-0-3-7.7z",
      "uploadedUnix": "1401668147",
      "modVersion": "0.3.7",
      "virusScanUrl": "https://www.virustotal.com/file/291bee29b9854efb53c11a15cd0f464b74852144e5da5fb0853d1126e3ee8427/analysis/1408108553/",
      "changelogHtml": " Some new content: a short conversation with Tilma and a small note in Farkas&#39;s room. <br/> \n For &#34;Trouble in Skyrim&#34; you can now report back to Farkas that you&#39;re unable to complete the quest, if it&#39;s too difficult for you. As a penalty, you&#39;ll need to do a few extra quests. <br/> \n In the opening fight with the giant outside Whiterun, the giant will now be invulnerable the first few seconds of the fight, to give the player more time to get there. <br/> \n Changed &#34;The Silver Hand&#34; quest, so that when you find Skjor at the end he will now be in beast form to better explain the lack of public resolution of the quest&#39;s ending. Also there will be more evidence of his passage through Gallows Rock. <br/> \n Fixed a vanilla issue where if you did not have access to a witch head for a brothers&#39;s &#34;Purity&#34; quest, the brother could be left unable to offer any radiant quests after &#34;Glory of the Dead.&#34; <br/> \n Fixed a potential exploit in the &#34;Open Circle&#34; quest: the player will now only be essential during the actual fight, not throughout the quest. <br/> \n Fixed a disparity in the sparring system where if you had given your opponent health potions (e.g., if they were your follower), they would use them, although you can&#39;t use your own potions. <br/> \n Sparring should no longer re-enable fast travel after the match if another mod had previously disabled it. <br/> \n Fixed a bug in the quest where Aela regifts the beast blood that can have Aela rejecting your request even if you passed the necessary Speech skill check. <br/> \n Fixed some vanilla dialogue quirks: Skjor could commend the PC for &#34;another job well done&#34; after the PC finished their very first job; Athis would call a female dark elf PC &#34;brother&#34;; Skjor could say he had never seen the PC before, after talking to them. <br/> \n Added the vanilla &#34;PerkSkillBoosts&#34; and &#34;AlchemySkillBoosts&#34; perks to all Companions, to enable them to take full advantage of fortify combat skill enchantments as followers. <br/> \n Improved the MCM troubleshooter function to cycle a new batch of radiant quests. <br/> \n Tweaked the end of &#34;Glory of the Dead&#34; so that the objective to ask the Companions for more work will now only appear after they&#39;ve returned to Jorrvaskr and have work available. <br/> \n Removed a few unnecessary .pex files that I had packaged with the previous update by mistake. <br/> \n Merged in other Companions-related fixes from the Unofficial Skyrim Patch 2.0.4a. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESFCompanions%20FULL%20VERSION-22650-0-3-7.7z?fid=1000111478&ttl=1535792338&ri=8192&rs=8192&setec=c96f91b9c7e916ebab328aa023611149"
    },
    {
      "fileId": "1000115999",
      "name": "ESFCompanions OPEN CITIES PATCH",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "ESFCompanions OPEN CITIES PATCH-22650-1-1.7z",
      "uploadedUnix": "1404567435",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b1519c2093ff2f148030954fc917c5204b0b5f0c5482386cba94f9b0d2519c8a/analysis/1408161909/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESFCompanions%20OPEN%20CITIES%20PATCH-22650-1-1.7z?fid=1000115999&ttl=1535792339&ri=8192&rs=8192&setec=025c84f3950ef897f66ffe6a78681a88"
    },
    {
      "fileId": "1000168375",
      "name": "ESFCompanions FULL VERSION",
      "version": "0.3.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6498",
      "fileName": "ESFCompanions FULL VERSION-22650-0-3-8.7z",
      "uploadedUnix": "1437252265",
      "modVersion": "0.3.8",
      "virusScanUrl": "https://www.virustotal.com/file/e10345582b0509d50bdc633f20fd4fc6ec0127e5c9ce19251b9886fd3da73216/analysis/1437252306/",
      "changelogHtml": " Added a new conversation with Ria, after the main story questline ends, where, if you&#39;ve been kind to her (asked for her advice at least once and thanked her for it), you can help her choose her fighting style (class skills and combat style). <br/> \n Added the ability to report failure for the &#34;Animal Extermination&#34; (beast den), &#34;Family Heirloom&#34; and &#34;Rescue Mission&#34; radiant quests given by Aela, Vilkas and Skjor. <br/> \n Added compatibility with the aMidianborn Content Add-On version of the Skyforge weapons. Also, Eorlund will now offer the Skyforge Warhammer and Mace as choices after the player&#39;s induction ceremony when an appropriate aMidianborn mod is installed. <br/> \n Added a little more unvoiced dialogue later in the questline, around &#34;Purity of Revenge&#34; and &#34;Glory of the Dead,&#34; to address a few internal inconsistencies and allow the PC to ask a few questions that begged to be asked. <br/> \n Added a toggle in the MCM to allow magic in sparring, including in Open Circle. <br/> \n Added compatibility with the Dawn of Whiterun mod for the Open Circle quest. <br/> \n Added some additional debugging info to the Troubleshooting page of the MCM. <br/> \n Merged in relevant Companions-related fixes from the Unofficial Skyrim Patch 2.1.2. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESFCompanions%20FULL%20VERSION-22650-0-3-8.7z?fid=1000168375&ttl=1535792339&ri=8192&rs=8192&setec=656a975e4c7c5226ead570340342761d"
    },
    {
      "fileId": "1000168376",
      "name": "ESFCompanions OPEN CITIES PATCH",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8",
      "fileName": "ESFCompanions OPEN CITIES PATCH-22650-1-2.7z",
      "uploadedUnix": "1437252389",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/79564710b39e607287b08aa82c218f34d86d7276d6a465db5b7b71cc396eba9a/analysis/1437252423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESFCompanions%20OPEN%20CITIES%20PATCH-22650-1-2.7z?fid=1000168376&ttl=1535792340&ri=8192&rs=8192&setec=94c3c9f87331a17a72c4acf08a01d6b4"
    }
  ]
}