{
  "modId": 22676.0,
  "modName": "Autumn Battle-Born",
  "summary": "This is my first mod, so be gentle.\r\nThree NPC Follower/Marriageable female Sorceress class (Modified to remain within lore).  Autumn Shock, Sibylla Fire, Sybilla Ice.  All three are dual wield melee berserkers with custom swords.",
  "descriptionHtml": "This is my first mod, so be gentle.\r\nThree NPC Follower/Marriageable female Sorceress class (Modified to remain within lore).  Autumn Shock, Sibylla Fire, Sybilla Ice.  All three are dual wield melee berserkers with custom swords.  All three girls are wearing helmets but I glitched them so they do not display however they still award stats.\r\n\r\nThanks to Apachii for permission to use, Uses ApachiiSkyHair 1.4 by Apachii 28, 40 and 42. http://skyrim.nexusmods.com/mods/10168 .  \r\nYou have to have ApachiiSkyHair 1.4 installed for my mod to work properly.\r\n\r\nThere is a book on the floor within the entrance to Jorrvaskr called \\\"Uncle Vignar\\\" containing the back story of the three girls.  They are living within Uthgerd the Unbroken\\'s house in White run.  I have modified the house to enclude a double bed downstairs, removing a table, chairs and wall items to do so.  \r\n\r\nThe questing parts of CK are beyond my understanding at this time.  I had intended the book to launch a quest, but it has proved beyond my skill to do so.  \r\n\r\nThere is a file that you must run from within the console.  Open the Console with ~ then type, \\\"bat AutumnBattleBorn\\\" without quotes, not case sensitive.  If you do not do this the girls will not talk to you and will report you to the guards as an intruder.  This is a workaround until I figure out the questing in CK.\r\n\r\nKnow Issues.\r\nI am using Extensible Follower Framework by Expired http://skyrim.nexusmods.com/mods/12933\r\nIf you reset my mod by disabling it while any of the NPC\\'s are active followers, they will not be in the house when you re-enable the mod.  Make sure you dismiss them as followers before uninstalling the mod.  I don\\'t know why this happens.\r\nthe Shock, Fire, and Ice spells are fire and forget.  I have grouped five followers, Uthgerd, Jenassa with Autumn and the twins only to have one of the spells strike another follower, or an npc resulting in mutual combat.  During the Under Saarthal quest Sibylla struck Tolfdir with a fire spell causing Tolfdir to attack her instead of weakening the invulnerability of Jyrik Gauldurson necessitating the loading of the most recent save game.\r\n\r\nSpecial Note:\r\nAutumn Battle-Born is a Stormcloak and an enemy of her half-brother Idolaf and her father Olfrid.  They will fight if they get too close to each other and during testing Autumn has killed Idolaf in the streets of Whiterun.  If you kill Idolaf, Autumn will send you a note by courier thanking you for doing so.  Olfrid is Essential and can not be killed, but Autumn will stand next to him and blast him with lightning every time he tries to get up.  If they start fighting, zoning or fast travel will cause Autumn to follow you and stop fighting.  Using XFL I had all three girls following and together they killed Idolaf so fast that I didn\\'t realize he was there until he was dead.  \r\n\r\nFor screenshots I used,\r\nBetter Females by Bella by BellaGail http://skyrim.nexusmods.com/mods/2812\r\nCovereyes-4 by mrLenski http://skyrim.nexusmods.com/mods/4869\r\nVanilla Armor and \r\nKiller Keos Skimpy CBBE V2 Armor Set -Work In Progress- by Killer Keo with Glass armor Shoulderless update http://skyrim.nexusmods.com/mods/3654\r\nThese mods are not used within my mod in any way.\r\n\r\nIf you want to use any or all of this mod please ask for my permission and give me credit for my work.  You may not use my story, Uncle Vignar, without express permission from me... Under no circumstances may the story be published or used in any fashion outside of the Game Skyrim.\r\n   All Characters referenced here, including the last names Battle-Born and Gray-Mane are the copyright of Bethesda Games and are used under the fair use clause of Copyright Law, with the exceptions of:  Steingerd (Autumn\\'s mother) is the seductive farmer\\'s daughter from a norse poem, circa 13 th Century.  Sibylla/Sybilla are alternate spellings for the Queen of King Alexander 1 of Scotland circa 12 th Century.  Autumn is a Season.  I have tried to remain within lore, hope you like the story.",
  "categoryId": "33",
  "version": "1.0",
  "author": "Dragonfire12 ",
  "createdUnix": "1345372037",
  "updatedUnix": "1345372130",
  "containsAdultContent": false,
  "uploadedBy": "Dragonfire12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "82688",
      "name": "Autumn Battle-Born",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5115",
      "fileName": "Autumn Battle-Born-22676-1-00.zip",
      "uploadedUnix": "1345372130",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/939c3598e7afce62df8c24d2c6ba733f4c145c8f1901aaeeef7d7553d79729c4/analysis/1407107165/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Autumn%20Battle-Born-22676-1-00.zip?fid=82688&ttl=1535792383&ri=8192&rs=8192&setec=4ad3cd2fe9fed5a22482d6052bb0926b"
    }
  ]
}