{
  "modId": 22711.0,
  "modName": "Skyrim Grammar Hammer",
  "summary": "This mod cleans up grammar and syntax issues in around 270 vanilla loading screens and onscreen messages.",
  "descriptionHtml": "My aim with this mod is to remedy the atrocious, broken English in Skyrim&#39;s loading screens and other on-screen messages. While a mod called &#34;Grammatical Loading Screens&#34; by Umaros is already available, I found additional annoyances and errors to repair. Umaros focused heavily on errant commas, especially those that split compound predicates (a big pet peeve of mine too&#33;). I fixed not only those but also dangling constructions, inappropriate word order, serial comma issues, agreement problems, and adverb mistakes. Then I cleaned up some of the messier sentences, misused words, and vague subjects. In all, I hand-edited over 100 on-screen messages and 160 loading screens. This mod does not alter dialogue and only lightly retouches direct quotes from canon lore materials.\r<br />\r<br />Feel free to use and abuse this mod or include it in compilations and patches with a dash of credit. Please let me know if you spot any additional errors.\r<br />\r<br />I&#39;ve included some examples in the screenshots, but here are a few more in text form:\r<br />\r<br />&#34;The School of Destruction focuses on the mastery of fire, frost and shock and is used to cast spells like Fireball, Ice Spike, and Lightning Bolt.&#34; (This single sentence has an example of both the serial comma and its lack. I&#39;ve opted to use the serial comma in all instances.)\r<br />\r<br />&#34;The Lockpicking skill is used to open locked doors and containers faster and with fewer broken lockpicks.&#34; (&#34;More quickly&#34; was the adverb needed here.)\r<br />\r<br />&#34;Combat-based magic only improves when used against valid opponents.&#34; (&#34;Improves only when&#34; is what was meant.)\r<br />\r<br />&#34;Like many of Skyrim&#39;s woodland settlements, Falkreath&#39;s economy is heavily reliant on the production of lumber.&#34; (Dangling comparative. Falkreath&#39;s economy is not like many of Skyrim&#39;s woodland settlements. Settlements are like settlements; economies are like economies.)\r<br />\r<br />&#34;The Pickpocket skill is used to take things from an unsuspecting target&#39;s pockets... and not get caught in the process.&#34; (This sentence is mangled and currently suggests that the Pickpocket skill aims to not get caught, not the pickpocket himself. The corrected version is in the screenshots section.)\r<br />\r<br />&#34;Khajiit have deadly claws that can be used in unarmed combat. They can use Night Eye to see better in the dark.&#34; (Vague pronoun; it&#39;s not immediately clear whether &#34;they&#34; refers to &#34;the Khajiit&#34; or &#34;claws.&#34;)\r<br />\r<br />&#34;The Block skill reduces the damage and stagger from physical attacks when blocking with either a shield or weapon.&#34; (&#34;Blocking&#34; is dangling, and the final either/or is not parallel.)\r<br />\r<br />&#34;The Sneak skill makes it more difficult to be detected, which in turn allows for deadly stealth attacks.&#34; (This is just awkward.)\r<br />\r<br />&#34;Solitude is a major shipping port and important Imperial supply line.&#34; (A city is not a supply line; it could be a permanent supply point, however.)\r<br />\r<br />&#34;Blocking with a shield or weapon will recoil an attack and stagger the attacker.&#34; (Recoil is an intransitive verb and cannot take an object as done here. One does not recoil an attack. A corrected version of this one is in the screenshots section.)\r<br />\r<br />&#34;The wilds of Skyrim are teeming with deer. They are docile creatures, but serve as food for much of the province&#39;s more savage beasts.&#34; (This sentence has an unclear pronoun, a comma incorrectly splitting a compound predicate, and a misuse of the conjunction &#34;but.&#34;)\r<br />\r<br />&#34;Pick someone&#39;s pocket by activating them while sneaking. Looking at their inventory is harmless - taking anything is a crime.&#34; (&#34;Someone&#34; is traditionally a singular pronoun, thus &#34;them&#34; and &#34;their&#34; create a grating agreement issue. Additionally, that dash should be a semicolon.)",
  "categoryId": "95",
  "version": "1.0",
  "author": "Nym",
  "createdUnix": "1345410324",
  "updatedUnix": "1345410376",
  "containsAdultContent": false,
  "uploadedBy": "Nymeria",
  "primaryFile": null,
  "files": [
    {
      "fileId": "82832",
      "name": "NymSkyrimGrammarHammer1-0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27",
      "fileName": "NymSkyrimGrammarHammer1-0-22711-1-0.rar",
      "uploadedUnix": "1345410376",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0c5dc3116077a4ddd6db5d30a7d28c013080a55ef4e3375025eeea4e364adc83/analysis/1407108543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NymSkyrimGrammarHammer1-0-22711-1-0.rar?fid=82832&ttl=1535792449&ri=8192&rs=8192&setec=875489dfbfd14685611aece9bef88cfc"
    }
  ]
}