{
  "modId": 22731.0,
  "modName": "Bounty Hunters - Guild of Fortune",
  "summary": "A Mod Aiming to add a totally new Faction to Skyrim. Full of Voiced Characters. Questlines and Randomly generated Quests. New Armours, Weapons, Spells and Companions and much, much more. Stay Tunes For Descriptions",
  "descriptionHtml": "Skyrim is becoming a dangerous place. war and trouble have made it \r\neasy for bandits, thieves and all sorts of characters to make a \r\nhappy living murdering, extorting and terrorizing the townsfolk.\r\n\r\nThe imperials and Guards can no longer handle the influx of law breakers.\r\n\r\nAnd as such over the last few years. a Guild has been forming.\r\nIts mandate a secret, its headquarters hidden, yet its actions are known throughout the land. Like a beacon it calls.\r\n\r\nIt cries out to the bravest, the staunchest, the strongest. the fearless. the bold. Come, Fight with us.\r\n\r\nit is not the call of honour, or the call of justice. it is \r\nthe call of fame and wealth, the challenge of the sword and \r\naxes. \r\n\r\nName against Name, Fame against fame.\r\n\r\nIt is not Good vs Evil. but Man vs Man.\r\n\r\nthey are Man Hunters. Killers of every Ilk.\r\n\r\nIt is the Guild of the Bounty Hunters. \r\n\r\nAnd they are Recruiting.\r\n\r\n\r\nThis Mods Primary Goal is to create a joinable faction of bounty hunters. where the player can go to the HQ or one of the branch sites and get a Bounty.\r\n\r\nThere are many, many other goals for this mod.\r\n\r\nHere is a breakdown of the Current Targets of Bounty Hunters - Guild of Fortune\r\n\r\n1. Create a Quest to Find and Join the BHG (Working on Currently)\r\n2. Create The BHG HQ, A fully featured, Lorefriendly and Immersive Headquarters for the Guild. (Not Started)\r\n4. Create a system for randomly Generated Bounties. (Not Started)\r\n5. Create a Questline for BHG(Not Started)\r\n5.a. Create Generic Bounty Hunter NPC\\'s(Not Started)\r\n5.b Create Fully Featured and Unique Characters that you can\r\nearn the right to team up with. (Not Started)\r\n5.c. Create Boss Bounties. Hand Crafted Famous Villians Dotted throughout Skyrim with Large groups of followers. (Not Started)\r\n5.d. Create Followers of the Boss\\'s and other high level Bounties, who Ambush Bounty Hunters.(Not Started) \r\n6. Create Small Hideouts and Resources for Bounty Hunters Throughout Skyrim where the player can gain info on a target. as well as supplies.(Not Started)\r\n7. Custom Bounty Hunter Armour. (Not Started)\r\n8. Custom Bounty Journal, with unique textures and Bounty Posters.(Not Started)\r\n9. A Fame Rating(Not Started)\r\n10. Create A Dynamic Bounty System where even the dovakiin can get targeted by Bounty Hunters. (Not Started)\r\n\r\n\r\nCurrently, This mod is Just me. \r\n\r\nAnd its my first Mod.\r\n\r\nDevelopment will be somewhat slow at times as im currently working full time as a VFX compositor and filmmaker for an upcoming company.\r\n\r\nbut i love skyrim. And i really am going to make this mod.\r\n\r\nThe aim of this mod is Quality over Quantity. So i will release play test files way before i release any official releases. as its my first mod i have alot to learn\r\n\r\nplease feel free to offer advice, aid, or ideas to the comments section. there is also a Forum Thread on this Mod. so anyway.\r\n\r\nHappy Rimming People. Ill be back soon.\r\n\r\nCurrent Progress: Creating The Dungeon the Opening Quest will take place. ",
  "categoryId": "25",
  "version": "0",
  "author": "WinterSpoon",
  "createdUnix": "1345434276",
  "updatedUnix": "1345434276",
  "containsAdultContent": false,
  "uploadedBy": "Brinemobee",
  "primaryFile": null,
  "files": []
}