{
  "modId": 22747.0,
  "modName": "Dwemer-Transportplattformen",
  "summary": "Die Modifikation fuegt dem Spiel aus Dwemer-Teilen herstellbare Teleport-Plattformen hinzu. / This modification adds of Dwemer parts craftable teleportation devices to the game.",
  "descriptionHtml": "[center][img]http://www.egg-of-time.us/Brausebart/bbDTP/v10/screens/20120803_dtp_cover_01.jpg[/img][/center]\r\n\r\n[b]*** English Description below ***[/b]\r\nThank your very much, Nahkin for the translation! :-)\r\n\r\n\r\n[b]German Description[/b]\r\n\r\nBei Calcemo, dem Dwemer-Forscher in Festung Unterstein in Markarth sind ungewöhnliche Aufzeichnungen zu finden, in welchen Calcemo über eine alte, lange vergessene und von ihm nun wiederentdeckte Dwemer-Technologie berichtet. Offenbar verfügten die Dwemer einst über eine Technik, welche ihnen die Möglichkeit verlieh, unmittelbar zwischen verschiedenen Orten zu reisen, gänzlich unabhängig von Zeit und Raum. Sie verwendeten dafür speziell konstruierte Plattformen, deren Bauplan nun durch die Forschungen von Calcemo rekonstruiert werden konnte.\r\n\r\nSucht Calcemos Arbeitsplatz in Festung Unterstein auf und lest seine dort zu findenden Aufzeichnungen, um mehr über diese Gerätschaften zu erfahren und zu lernen, wie ihr solche Transport-Plattformen selbst herstellen könnt.\r\n\r\n\r\n[b]Details[/b]\r\n\r\nNach dem Lesen der o.g. Aufzeichnungen können Dwemer-Transportplattformen in jeder Schmiede selbst angefertigt werden - vorausgesetzt man verfügt über die notwendigen Bauteile sowie die Fertigkeit, zwergische Gegenstände schmieden zu können. Es können max. 9 derartige Plattformen konstruiert werden.\r\n\r\nJe herzustellender Plattform benötigt man 2 Stück verzierte Dwemerbalken, eine große Dwemermetallplatte, einen Dwemerkreisel sowie einen Dwemer-Teleportkristall. Die Teleportkristalle werden durch die Mod neu eingefügt und sind in Dwemer-JewelryBoxes und Dwemer-Boss-Containern zu finden.\r\n\r\nNach erfolgreicher Herstellung einer Plattform kann diese danach an einem beliebigen Ort platziert werden, indem man sie aus dem Inventar in die Umgebung ablegt, nach Wunsch ausrichtet und anschließend im Schleichmodus(!) aktiviert. Hierdurch wird die Plattform an Ort und Stelle fixiert und kann nicht länger bewegt werden. Fixiert man eine Plattform in einer Interior-Zelle, wird sie automatisch horizontal und auf Höhe des Bodens ausgerichtet. In Exterior-Zellen erfolgt keine automatische Ausrichtung. Um eine fixierte Plattform wieder aufzunehmen, muss diese erneut im Schleichmodus aktiviert werden.\r\n\r\nBevor eine Plattform benutzt werden kann, muss zunächst noch ein Zenturio-Dynamokern in diese eingesetzt werden. Dies geschieht automatisch beim nächsten Aktivieren der Plattform, sofern man mindestens einen solchen Dynamokern bei sich trägt. Hat man keinen dabei, erfolgt eine entsprechende Hinweismeldung.\r\n\r\nHat man den Dynamokern eingesetzt und aktiviert die Plattform (aus dem Stand), erscheint ein Auswahlmenü mit den Standorten aller weiteren aufgestellten Transportplattformen. Nach Auswahl des gewünschten Ziels erfolgt die Teleportation dorthin.\r\n\r\nEin evtl. folgender Begleiter und/oder folgender Hund werden ebenfalls mitgenommen. Hat man mehr als einen Begleiter, überlasse ich es der jeweiligen Begleiter-Mod, die weiteren Begleiter ebenfalls folgen zu lassen. (Mit den von mir bevorzugten \\\"Amazing Follower Tweaks\\\" klappt das z.B. sehr gut). Hat man sein Pferd in der \\\"Nordländer-Ausstattung\\\" angewiesen zu folgen, tut es dies ebenfalls bei einer Reise via Plattform, vorausgesetzt das Ziel befindet sich auch an einem für Pferde zugänglichen Ort.\r\n\r\nEs müssen logischerweise wenigstens zwei Plattformen aufgestellt worden sein, damit eine Reise möglich ist.\r\n\r\nAktiviert man eine Plattform im Schleichmodus, nimmt man diese wieder in das Inventar auf und man erhält den eingesetzten Dynamokern zurück.\r\n\r\n\r\n[b]Intention[/b]\r\n\r\nSelbst spiele ich Skyrim unter weitgehendem Verzicht auf die Schnellreisefunktion, nutze dagegen aber gerne vom Grundspiel selbst oder von Modifikationen gut in das Spiel integrierte Transportmöglichkeiten wie etwa die Pferdefuhrwerke, den Stab der Rückkehr aus meiner Nordländer-Ausstattung usw. Allerdings stört es mein Spielvergnügen denn doch, für immer wiederkehrende Routine-Abläufe, wie die regelmäßigen Besuche bei den bevorzugten Händlern oder Lehrmeistern wieder und wieder die gleichen Wege ablaufen zu müssen.\r\n\r\nIch suchte daher nach einer Teleport-Mod, welche eine begrenzte Anzahl von Teleport-Zielen, diese dafür aber vom Spieler frei platzierbar, bietet. Zwar kenne ich eine Anzahl von PlugIns, die dergleichen ermöglichen - nur leider stets per Zauber. Für meine bevorzugte, eher rustikal geprägte, Spielweise wollte ich aber gerne ein System, welches auf herstellbaren Gegenständen beruht und so auch für weniger magieorientierte Spieler den angestrebten Zweck erfüllen sollte. Als notorisch vergesslicher Spieler war es darüber hinaus mein Wunsch, vor der Auswahl der Teleport-Ziele noch einmal nachlesen zu können, wo sich diese befinden. Das habe ich so bislang noch in keiner anderen Teleport-Mod finden können.\r\n\r\nPersönlich sehe ich die Dwemer-Transportplattformen als Ergänzung zu meiner Nordländer-Ausstattung. Dort wollte und werde ich die Plattformen allerdings nicht integrieren, da sie dort m.M.n. nicht so gut hineinpassen. \r\n\r\n\r\n[b]Skyrim Script Extender (SKSE)[/b]\r\n\r\nZum Spielen dieser Modifikation wird SKSE benötigt. Die jeweils neueste Version dieser Erweiterung sowie eine Anleitung zu deren Gebrauch und Installation ist hier zu finden: http://skse.silverlock.org/\r\n\r\n[center]___________________________________________________[/center]\r\n\r\n[b]English Description[/b]\r\n\r\nMeet Calcemo in the Understone Keep to find his strange Notes, in which Calcemo writes about a old technique. The Dwemers have been able to travel between some strange platforms.\r\nWhich you are able to construct now with the resarches of Calcelmo.\r\n\r\nGo to Understone Keep and find Calcelmos workstation to learn more about the construction of the Dwemer-Transportstations.\r\n\r\n\r\n[b]Details[/b]\r\n\r\nIf you have read the Notes of Calcemo you are able to produce such Dwemer-Transportsations. The requirements are:\r\n\r\n -) smithing perk (Dwemer)\r\n\r\n -) 2 ornated Dwemer bars\r\n\r\n -) large Dwemer metal plate\r\n\r\n -) a Dwemer spin top\r\n\r\n -) Dwemer Teleport crystals (these are new Items included to the game which can be found at Dwemer boss chest or ruby boxes)\r\n\r\nIf you produced a platform drop it and activate it in the sneak mode(!), this will fix the platform on the ground. In Interior cells it will be automatically ajusted to the floor, exterior not.\r\n\r\nTo activate the platform you have to insert a Centurio Dynamo Core if you have one just klick it. Not in sneak mode !!! ( this will add it to you inventory )\r\n\r\nIf you placed the core you can activate the platform and the menu will appear.\r\n\r\nAlso companions will follow you but it was only tested with a few so its up to the companion mod developer if the companion will follow you.\r\n\r\nIf you want to remove the fixed platform, activate it in the sneak mode and you will get the platfrom and the Dynamo Core back.\r\n\r\nOf course you have to place at least two platforms to travel.\r\n\r\n\r\n[b]Intention[/b]\r\n\r\nThe author of this mod likes to travel with the facilites the original game offers nothing like fast travel just by horse or sth else. Thats why he build this fantastic mod!\r\n\r\n[b]Skyrim Script Extender (SKSE)[/b]\r\n=============================\r\nYou need the SKSE (latest version) to play this mod download it here if you haven\\'t already: http://skse.silverlock.org/\r\n\r\n\r\n\r\n[center]___________________________________________________[/center]\r\n\r\n[b]Versionshistorie:[/b]\r\n\r\n[b]Version 1.1 - 14.08.2012[/b]\r\n* Placer-Objekte der Plattformen sind jetzt als MiscObjects anstelle persistenter Referenzen eingebunden, wodurch\r\n  seltsame Fehler, dass die Plattformen nach einiger Zeit nicht wieder aufgenommen werden konnten behoben werden.\r\n* Wenn gar keine \\\"Location\\\" des Aufstellungsortes einer Plattform ermittelt werden kann, wird im Menü nun \\\"Plattform <x>\\\"\r\n  anstelle eines Leerstrings angezeigt.\r\n* Vorbereitende Anpassungen bzgl. Änderungen an der Implementierung des Hundes Brego in der kommenden Version 5.4\r\n  der Nordländer-Ausstattung. \r\n\r\n[b]Version 1.0.1 - 05.08.2012[/b]\r\n- Blöden Fehler behoben, der sämtliche Plattformen gleich zu Spielbeginn vor dem Spieler platziert hat.\r\n\r\n[b]Version 1.0 - 03.08.2012[/b]\r\nErstes Release",
  "categoryId": "78",
  "version": "1.1",
  "author": "Brausebart",
  "createdUnix": "1345467964",
  "updatedUnix": "1345559160",
  "containsAdultContent": false,
  "uploadedBy": "Brausebart",
  "primaryFile": null,
  "files": [
    {
      "fileId": "82981",
      "name": "Dwemer-Transportplattformen_V_1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1155",
      "fileName": "Dwemer-Transportplattformen_V_1_1-22747-1-1.7z",
      "uploadedUnix": "1345468078",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9e2276d4b4fd71e5cda671f01b9b9f7513ba2c1ddd342ee4619a03003da68d00/analysis/1407109808/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwemer-Transportplattformen_V_1_1-22747-1-1.7z?fid=82981&ttl=1535792502&ri=8192&rs=8192&setec=7e75285ecb57297d118d25f4aa999acd"
    },
    {
      "fileId": "83222",
      "name": "Dwemer-Transportplatforms_V_1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1153",
      "fileName": "Dwemer-Transportplatforms_V_1_1-22747-1-1.7z",
      "uploadedUnix": "1345559160",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e2375ba01b5baa67b89b64b00bf19b69232c6d76acb20194aa3c1a228ed2dbef/analysis/1407112308/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwemer-Transportplatforms_V_1_1-22747-1-1.7z?fid=83222&ttl=1535792503&ri=8192&rs=8192&setec=43518200e8a9e0ca115d935571255839"
    }
  ]
}