{
  "modId": 22744.0,
  "modName": "Nordlaender-Ausstattung - Light Edition",
  "summary": "Die Light-Edition der Nordlaender-Ausstattung fuegt dem Spiel eine einfache Camping-Ausstattung fuer reisende Abenteurer hinzu. Die Ausruestung richtet sich an Spieler, die nur eine elementare und in der Anwendung einfache Ausstattung fuer ihre Reisen suchen.",
  "descriptionHtml": "[center][img]http://www.egg-of-time.us/Brausebart/bbLagerLight/v10/screens/nale_cover01.jpg[/img][/center]\r\n\r\n[b]Beschreibung:[/b]\r\n\r\nDie Light-Edition der Nordländer-Ausstattung fügt dem Spiel eine einfache Camping-Ausstattung für reisende Abenteurer hinzu. Die Ausrüstung richtet sich an Spieler, die nur eine elementare und in der Anwendung einfache Ausstattung für ihre Reisen suchen. Sie eignet sich aber natürlich ebenso gut als Ergänzung zur [url=http://skyrim.nexusmods.com/mods/11329/]„großen“ Nordländer-Ausstattung[/url], falls noch mehr Ausrüstung, z.B. für Begleiter gewünscht wird oder als portables Lager während die großen Zelte irgendwo stationär aufgebaut bleiben.\r\n\r\nDas Plugin basiert auf der [url=http://skyrim.nexusmods.com/mods/11329/]„großen“ Nordländer-Ausstattung[/url], die Skripte wurden von mir aber sämtlich neu geschrieben und so benannt, dass es keine namentlichen Überschneidungen gibt und beide Mods gleichzeitig installiert werden können.\r\n\r\nDie neue Ausrüstung kann käuflich im Flusswald-Handelskontor und bei Belethors Gemischtwaren in Weißlauf erworben werden. Jeder der Händler hat ein Camping-Kit im Angebot. Beide Kits unterscheiden sich nur darin, dass eines ein nordisches Zelt enthält, während das andere ein kaiserliches Zelt beinhaltet. Die weiteren Ausrüstungsgegenstände sind in beiden Kits identisch. Natürlich können beide Kits nebeneinander eingesetzt werden. Die nachfolgende Beschreibung gilt für beide Kits.\r\n\r\n\r\n[b]Ausrüstungsgegenstände und deren Benutzung[/b]\r\n\r\nLegt man die Camping-Ausrüstung aus dem Inventar in die Umgebung ab, erscheint stattdessen eine Zeltplane. Aktiviert man die Zeltplane aus der Hocke, wird an deren Stelle das Zelt errichtet. Gleichzeitig mit dem Zelt werden darin ein Schlafsack und davor ein Baumstumpf zum Sitzen und eine (leere) Feuerstelle aufgebaut. Neben dem Zelt findet sich außerdem ein Sack, der noch einige weitere Gegenstände enthält.\r\n\r\nMit dem Aufbauen des Lagerplatzes wird ein Map-Marker auf der Übersichtskarte eingefügt, welcher die Position des Lagers markiert und auf Wunsch eine Rückreise mittels Schnellreisefunktion ermöglicht.\r\n\r\n\r\n[b]Feuerstelle[/b]\r\n\r\nBevor die Feuerstelle benutzt werden kann, muss sie zunächst entzündet werden. Dies geschieht durch einfaches Aktivieren des Steinkreises. Es werden 2 Stück Feuerholz dafür benötigt. Nach dem Anzünden brennt das Lagerfeuer für 12 Stunden oder bis das Lager abgebrochen wird.\r\n\r\nEin brennendes Lagerfeuer kann dazu benutzt werden, sich unterwegs eine Mahlzeit zuzubereiten. Das Kochen funktioniert genauso wie an normalen Kochstellen, hier allerdings ohne Animation.\r\n\r\nWeiterhin hält ein brennendes Feuer wilde Tiere ab. Das bedeutet, bei entzündetem Feuer kann man in dessen Nähe auch dann schlafen, wenn sich Gegner in der näheren Umgebung aufhalten (und man ohne Feuer die Meldung „Du kannst nicht schlafen, wenn Feinde in der Nähe sind.“ erhielte).\r\n\r\nDie Feuerstelle wird stets zusammen mit dem Zelt auf- und abgebaut.\r\n\r\n\r\n[b]Zweiter Baumstumpf und Schlafsack[/b]\r\n\r\nDer Lagersack enthält einen zweiten Baumstumpf als zusätzlichen Sitzplatz, z.B. für einen Begleiter. Nach dem Ablegen des Baumstumpfes kann dieser durch Aktivieren aus der Hocke fixiert werden. Aktiviert den fixierten Baumstumpf erneut aus der Hocke, um ihn wieder aufzunehmen.\r\n\r\nEin zweiter Schlafsack kann als zusätzliche Schlafgelegenheit sowie auch als provisorische Sitzmöglichkeit verwendet werden. Um den Schlafsack zu fixieren, ist er wie üblich aus der Hocke zu aktivieren. \r\n\r\n[b]Feuerholz-Hackklotz[/b]\r\n\r\nPlatziert den Hackklotz aus dem Inventar und aktiviert ihn aus der Hocke, um ihn zu fixieren und an dieser Stelle Feuerholz hacken zu können. Aktiviert den fixierten Hackklotz aus dem Stand, um Holz zu hacken und aus der Hocke, wenn ihr ihn wieder in das Inventar aufnehmen möchtet.\r\n\r\n\r\n[b]Gerbgestell[/b]\r\n\r\nSchließlich enthält der Lagersack noch ein aufstellbares Gerbgestell. Wie üblich, wird es durch Aktivieren im Schleichmodus aufgebaut und fixiert. Aktiviert das Gestell aus dem Stand, um es zu verwenden und aus der Hocke, wenn ihr es wieder in euer Inventar aufnehmen möchtet.\r\n\r\n\r\n[b]Abbauen des Lagerplatzes[/b]\r\n\r\nDurch Aktivieren des Zeltes im Schleichmodus werden alle aufgestellten Gegenstände automatisch abgebaut. Der zweite Baumstumpf, Schlafmatte, Hackklotz und Gerbgestell finden sich beim nächsten Aufstellen des Lagers dann im Lagersack wieder.\r\n\r\n[i]Tipp:[/i] Der Lagersack kann als Behälter für beliebige Ausrüstung verwendet werden. Sein Inhalt respawned nicht. Die zu Anfang im Sack enthaltenen 10 Stück Feuerholz und die Holzfälleraxt werden später nicht ersetzt. \r\n\r\nAktiviert man die Camping-Ausrüstung während man sie im Inventar mit sich trägt, wird direkt nach dem Schließen des Inventars der Lagersack geöffnet und man kann auf dessen Inhalt zugreifen. (Das gleiche Prinzip, wie beim Rucksack aus der „großen“ Ausstattung.)\r\n\r\n[center]________________________________________________________[/center]\r\n\r\n[b]Versionshistorie[/b]\r\n\r\n[b]Version 1.1.1 - 27.08.2012[/b]\r\n+ Weiterer Hypothermia-Anpassungs-Patch hinzugefügt für Spieler, welche gerne die Light-Version der Nordländer-\r\n   Ausstattung zusammen mit der \\\"Extended Editon\\\" und \\\"Hypothermia\\\" verwenden möchten.\r\n\r\n[b]Version 1.1 - 23.08.2012[/b]\r\n+ Anpassungs-Patch für \\\"Hypothermia\\\" Vers. 1.4 von Nitor (aka n1t0r) hinzugefügt.\r\n+ Anpassungs-Patch für die \\\"Nordländer-Ausstattung - Extended Edition\\\" Vers. 5.5 hinzugefügt.\r\n* Kleinere Skript-Änderungen bzgl. der beiden vorgenannten Anpassungs-Patches\r\n* Während des Holzhackens werden die gewonnenen Feuerholzstücke jetzt im Lagersack (anstelle des Spieler-Inventars)\r\n   abgelegt  sofern sich der Hackklotz in der Nähe des aufgebauten Zeltes befindet.\r\n- Bugfix: Das zum Entzünden des Lagerfeuers benötigte Feuerholz wird jetzt auch tatsächlich aus dem Inventar (oder\r\n  dem Lagersack) entnommen.\r\n+ Zum Entzünden des Lagerfeuers benötigtes Feuerholz wird neu vorrangig dem Lagersack entnommen, sofern darin\r\n   Feuerholz vorhanden ist. \r\n* Der Havok-Baumstumpf wird beim Aufbauen der Zelte jetzt zunächst höher platziert und die Zeitspanne bis er durch\r\n   das statische Modell ersetzt wird, wurde verlängert, sodass der Stupf nicht mehr so häufig durch den Boden fallen sollte.\r\n\r\n[b]Version 1.0 - 20.08.2012[/b]\r\nErstes Release",
  "categoryId": "78",
  "version": "1.1.1",
  "author": "Brausebart",
  "createdUnix": "1345465926",
  "updatedUnix": "1347496822",
  "containsAdultContent": false,
  "uploadedBy": "Brausebart",
  "primaryFile": null,
  "files": [
    {
      "fileId": "82978",
      "name": "Nordlaender-Ausstattung_Light_V_1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1382",
      "fileName": "Nordlaender-Ausstattung_Light_V_1_0-22744-1-0.7z",
      "uploadedUnix": "1345466093",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/728445156e2be195774e4e88e37ba15ea699c99228f8e5e57218b87818403cc0/analysis/1407109805/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_Light_V_1_0-22744-1-0.7z?fid=82978&ttl=1535792498&ri=8192&rs=8192&setec=905ab6b33b6bb17022267fb1f05ed29b"
    },
    {
      "fileId": "88117",
      "name": "Nordlaender-Ausstattung_Light_V_1_11",
      "version": "1.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1543",
      "fileName": "Nordlaender-Ausstattung_Light_V_1_11-22744-1-1-1.7z",
      "uploadedUnix": "1347496822",
      "modVersion": "1.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/deb75328fd87b53772d80bbf719c1b079c76f110650de78f57caf7635ed5cbc7/analysis/1407162264/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordlaender-Ausstattung_Light_V_1_11-22744-1-1-1.7z?fid=88117&ttl=1535792499&ri=8192&rs=8192&setec=64f19b51c200476aa56e9da996885793"
    }
  ]
}