{
  "modId": 22753.0,
  "modName": "Lost Magic",
  "summary": "A new college wizard called Frand has been busy studying old books in the arcaneum. Within them he found descriptions of old and forgotten spells. Now he is ready to share his knowledge with anyone who can afford his services.",
  "descriptionHtml": "Do you want more spells? You\\'re lucky, here is [url=http://skyrim.nexusmods.com/mods/37117//?]Part 2![/url]\r\n\r\n[youtube]jMOmAEL4BpY[/youtube]\r\n_____________________________________________________________________\r\n\r\nINSTALLATION\r\n\r\nJust put LostMagic.esp, LostMagic.bsa and LostMagic.bsl into your \\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data folder and you\\'re ready to play.\r\n_____________________________________________________________________ \r\n\r\nNEW SPELLS: \r\nA [url=http://skyrim.nexusmods.com/articles/895]detailed guide[/url] on how to use each spell has been added as article and seperate text file. Here is a basic description of each spell. \r\n\r\nDESTRUCTION: \r\nLightbeam: A ray of light. Does additional fire damage to undead. (10 damage to health and magicka + 5 firedamage to undead) \r\nIce Shards: a volley of razor sharp icicles (50 frost damage) \r\nGust: a gust of wind blowing away anyone in it\\'s path (no damage) \r\nQuake: let the earth tremble under your feet (no damage) \r\nGauldur\\'s Might: strike with pure magic. No wizard can control so much power completely. (damage 150 health 75 stamina, 75 magicka per second) \r\nNEW Plasmabolt: A bolt of ectoplasm dealing 30 damage and reduce magic resistance \r\n\r\nRESTORATION: \r\nCleanse Body: get rid of any disease and poison you have contracted \r\nRejuvenation: Restore all your health, stamina and magicka. Takes a long time to cast. \r\nMystic Aura: Incoming spells cannot get a hold of you, making them last only for 1 second. \r\nBlood Curse: Manipulate the blood of your victim, rendering him unable to control his body while draining 10 health per second for 20 seconds. \r\n\r\nILLUSION: \r\nNight Eye: can see much better in the dark \r\nShadow Form: Blend in with the shadows, making you harder to see or hit. Effect gets stronger in darker areas. (20% - 60% chance to avoid damage and 10 - 30 increased sneak, the value depends on the lightlevel) \r\nTwisted Words: Mages are unable to pronounce their incantations, leaving them unable to preform their magic. \r\nSteal Knowledge: Equip the same spells as your target for 30 seconds. \r\nPetrify: Petrify a target for 45 seconds. In this period the target cannot move or be moved. Illusion ends when target recieves damage. WARNING (see BUGS) \r\n\r\nALTERATION: \r\nStarlight: summon a bright star to light up your way \r\nWaterwalking: you\\'re able to walk on water while casting this spell \r\nSlime: Cover enemies in slime, slowing them down for a while. (reduce speed by 75% and stamina regen by 50%) \r\nBreak Armor: Break the armor of your enemy, reducing it\\'s ability to absorb damage. Doesn\\'t work on weak armors like fur. Doesn\\'t work on unarmored people, creatures and falmers (because they are creatures even though they do wear armor). \r\n\r\nConjuration: \r\nSummon Plague: Summon a pack of Skeevers for 60 seconds. You can summon Skeever up to 0.3 times your conjuration skill, so e.g. someone with a level 60 of conjuration can summon 18 Skeevers. \r\nBug Swarm: a swarm that does 15 poison damage per second \r\nBee Swarm: a swarm of bees that does 35 poison damage per second and has a small chance to paralyze \r\nGrand Soul Charge: put part of your own soul into your enchanted weapon to recharge it.(Reduce your own health by 100 to charge your weapon with 500 points.) LEFT HAND ONLY \r\nGrand 2H Soul Charge: put part of your own soul into your two-handed enchanted weapon to recharge it.(Reduce your own health by 100 to charge your weapon with 500 points.) LESSER POWER!!! \r\nSoul Charge: put part of your own soul into your enchanted weapon to recharge it.(Reduce your own health by 10 to charge your weapon with 50 points per second.) LEFT HAND ONLY \r\nTeleport Other: Teleport to target to your location. \r\nSoul Snatch: Directly rip the soul from a weak body and fill a soulgem. (Conjuration skill must be higher than the target\\'s health) \r\n_____________________________________________________________________ \r\nNEW SCROLLS: \r\nBasicly most spells above but as scroll. Concentration spells couldn\\'t be turned into scrolls. All scrolls can be bought from Frand or found troughout Skyrim. \r\n\r\nScroll of Cursed Blood: same effect as the Blood Curse spell \r\nScroll of Broken Armor: same effect as the Break Armor spell \r\nScroll of Cleansing: same effect as the Cleanse Body spell \r\nScroll of Ice Shards: same effect as the Ice Shards spell \r\nScroll of Mystic Aura: same effect as the Mythic Aura spell \r\nScroll of Night Vision: same effect as the Night Eye spell \r\nScroll of Petrifying: same effect as the Petrify spell \r\nScroll of Rejuvenation: same effect as the Rejuvenation spell \r\nScroll of Shadows: same effect as the Shadowform spell \r\nScroll of Soulcharge: same effect as the Grand Soulcharge spell \r\nScroll of Starlight: same effect as the Starlight spell \r\nScroll of Mindreading: same effect as the Steal Knowledge spell \r\nScroll of Teleport Other: same effect as the Teleport Other spell \r\nScroll of Twisted Words: same effect as the Twisted Words spell \r\nScroll of Snathed souls: same effect as the Soul Snatch spell \r\nScroll of Plasma: same effect as the Plasmabolt spell \r\n_____________________________________________________________________ \r\nNEW STAFFS: \r\n\r\nStaff of Lightbeam: same effects as the Lightbeam spell \r\nStaff of Ice Shards: same effects as the Ice Shards spell \r\nStaff of Plasma: same effects as the Plasmabolt spell \r\nStaff of Cursed Blood: same effects as the Blood Curse spell \r\nStaff of Twisted Words: same effects as the Twisted Words spell \r\nStaff of Petrifying: same effects as the Petrify spell \r\nStaff of Broken Armor: same effects as the Break armor spell \r\nStaff of Slime: same effects as the Slime spell \r\nStaff of Bug Swarms: same effects as the Bug Swarm spell \r\nStaff of Bee Swarms: same effects as the Bee Swarm spell \r\n_____________________________________________________________________ \r\nNEW MERCHANT: \r\nFrand can be found in the Arcaneum of the College of Winterhold. He sells everything mentioned above and some rare books. Aside from being a merchant, he is also a powerfull wizard. If you decide to fight him (bad idea), he will actually use the most powerfull spells he\\'s found. \r\n_____________________________________________________________________ \r\nBUGS/KNOW ISSUES: \r\n- Blood Curse has had some issues where victims were so busy with their spasms they refused to lie down dead when the spell killed them. This is hopefully fixed but please report if it still hapens. \r\n- A Petrified NPC does not respond to anything for the duration of the spell, however the effects aplied to the NPC kick in as soon as the effect ends. This meant that when a petrified was hit by the gust or Unrelenting force shout, \r\nthe NPC took off flying at an insane speed when the effect ended. This has been fixed for Unrelenting Force and Gust but by adding a condition to them, but I cannot do that for spells from other mods that push people around. So DON\\'T USE SPELLS FROM OTHER MODS THAT PUSH PEOPLE AROUND ON PETRIFIED NPC\\'S! Or do and have a laugh ;) \r\n......................................................................................................................................... \r\nCHANGELOG: \r\nV2 New spells Rejuvenation, Mystic Aura, Slime, Break Armor, Soul Charge and Twisted Words added, Bee and Bug swarm are now conjuration spells. \r\nV2.2 All spells except Gauldur\\'s Might are added to the leveled item list, so you can randomly encounter them when playing. The bug which makes candlelight blue has been fixed. \r\nV3 New spells: Light Beam, (new) Soul Charge. Original Soul Charge spell renamed to Grand Soul Charge. (Grand) Soul Charge can no longer overcharge a weapon. Many thanks to Spinner385 on Nexus to help with the overcharge problem \r\nV4 New Spells: Grand 2H Soul Charge, Summon Plague \r\nV5 New Spells: Petrify, Steal Knowledge, Teleport Other, Blood Curse. Most spells are added as scrolls. \r\nV6 New Spells: Plasmabolt, Soul Snatch. Most spells added as staffs. Rebalanced magicka cost, updated visuals and effects of: Petrify, Mystic Aura, Shadowform, Soul Charge, Rejuvenation, Twisted Words",
  "categoryId": "75",
  "version": "V6",
  "author": "Syfor",
  "createdUnix": "1345473795",
  "updatedUnix": "1360183684",
  "containsAdultContent": false,
  "uploadedBy": "Syfor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000007620",
      "name": "Lost Magic V6",
      "version": "V6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21",
      "fileName": "Lost Magic V6-22753-V6.7z",
      "uploadedUnix": "1360183684",
      "modVersion": "V6",
      "virusScanUrl": "https://www.virustotal.com/file/0e0817b60b318dc6b324aec909b9e609be807bbc40b955dd6f1f22d25994f94c/analysis/1407401624/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lost%20Magic%20V6-22753-V6.7z?fid=1000007620&ttl=1535792513&ri=8192&rs=8192&setec=8384cc551c4001917c48f4a1dfaa04f4"
    }
  ]
}