{
  "modId": 22769.0,
  "modName": "Arrowshots x Dungeon x Quest x Boss Package",
  "summary": "Take on a quest given to you by the real Dohvakiin to retrieve the horn of dragon born which was lost centuries ago, Venture in to the depths of Terror north\\'s tomb and retrieve the horn from the daedric prince Tez.",
  "descriptionHtml": "************IF DOWNLOADING THROUGH MANAGER DOESN\\'T WORK, INSTALL IT MANUALLY************\r\nYes it is finally here, my Epic, Dungeon, Quest and Boss Package.\r\n\r\nThis is designed for a quest i wanted to make for the old Dohvakiin who was \\'apparantly\\' Slain decades ago, but now i have created a quest were he returns to retrieve the deserted Horn of Dragonborn from Tez of Terrornorths Tomb which is located along the river in riverwood. with This active you must venture into my custom made dungeon, and retrieve the horn in the depths of the tomb battling surprises along the way.\r\n\r\nThe Quest Begins In the Sleeping Giant Inn in which you will find \\'The Real Dohvakiin Dragonborn\\' which will begin your quest =)\r\n\r\nYou will encounter riddles, very hard challenges such as the Daedric Prince Boss who has the power to turn anything into dust and also a Magnificent amount of Experience, Gold and many great items.\r\n\r\nThis mod is Compatible with every other mod.\r\n\r\nThis is my first ever dungeon / quest mod guys Which i put over 40 hours of work into and i hope you guys like it, if you do please Comment, Favourite and follow for more Mods. <3\r\n\r\nProblems:\r\nThe problem with the NPC speech will be fixed soon enough when i get a mic since i dont you cant see the NPC\\'s subtitles. so till then bare with me.",
  "categoryId": "35",
  "version": "1.0",
  "author": "Arrow_shot",
  "createdUnix": "1345492402",
  "updatedUnix": "1345497640",
  "containsAdultContent": false,
  "uploadedBy": "KeirranM",
  "primaryFile": null,
  "files": [
    {
      "fileId": "83077",
      "name": "Arrowshots x Dungeon x Quest x Boss package",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "200",
      "fileName": "Arrowshots x Dungeon x Quest x Boss package-22769-1-0.rar",
      "uploadedUnix": "1345497640",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/39781a69d58e5aaaf775ab4a37b8d36c955f6007dc0a652ff30b54210fa4005c/analysis/1407110704/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arrowshots%20x%20Dungeon%20x%20Quest%20x%20Boss%20package-22769-1-0.rar?fid=83077&ttl=1535792533&ri=8192&rs=8192&setec=98f482c9fbe397e4396916d31c7cec5f"
    }
  ]
}