{
  "modId": 22768.0,
  "modName": "Windfall Island From The Legend Of Zelda The Windwaker",
  "summary": "PLEASE DOWNLOAD NEW VERSION FROM THE NEW PAGE\r\nhttp://skyrim.nexusmods.com/mods/22885/",
  "descriptionHtml": "THIS IS NOW AN OLD ABANDONED VERSION MY GOOD FRIEND KONNIKSANDERS HAS NOW TAKEN OVER THE MOD AND YOU NOW ACCESS IT FROM THIS PAGE:\r\n\r\nhttp://skyrim.nexusmods.com/mods/22885/\r\n\r\n\r\n\r\nThis is a recreation (with some artistic liberties taken) of Windfall Island from the Legend of Zelda : The Windwaker for Nintendo Gamecube.\r\n\r\nThe island itself is situated just north of Dawnstar but for ease of traval you can quick travel to it but using the console command \\\"coc windfall\\\" without the quotation marks or use the location marker in the in game map to fast travel.\r\n\r\n\r\nUPDATES\r\n----------------------------------------------------------------------------------------------------\r\n22 August\r\nAbandoned Project. Konniksanders has taken the helm.\r\nhttp://skyrim.nexusmods.com/mods/22885/\r\n\r\n8 August\r\nAdded Navmesh to Tavern\r\n\r\n7 August\r\nFINALLY got around to doing some more on this mod. Its not much at the moment and needs some NPCS adding to it but i have added the tavern that is above the Windfall Stores (up the staircase). Again not much but i may not get to finish this mod as i have lots of stuff going on, so it is becoming more and more difficut to find time to mod for Skyrim.\r\n\r\n21June\r\n\r\nUPDATE 2\r\nI have added a new interior, the Windfall Potion Shop. Also minor tweaks to scenery and added a couple of extra NPC\\'s. Added new Images to the mod\\'s profile page.\r\n\r\nUPDATE 1\r\nAdded a couple of NPC\\'s and a market stall which might be a little buggy it seems a bit hit and miss on my PC, sometimes he stays at his stall sometimes he dosn\\'t. Added a player home in palce of the prison that should, in Zelda, hold Tingle. The door to it is on the wooden walk way East of the Bomb Shop.\r\n\r\n\r\n20 June:\r\nI have added two NPC Merchants to the island. This is the beginning of the NPC adding phase of this mod, which sould be finished soon (without any major hiccups), then i shall start with the building interiors. I also added a FAST TRAVEL MARKER to the map in game.\r\n\r\n17 June : \r\nI have now added music to the Island. The music is courtsy of ZREO and the track is \\'Windfall Island Redux\\'. Website is zreo.perix.co.uk.",
  "categoryId": "89",
  "version": "DEAD",
  "author": "Lost Image",
  "createdUnix": "1345490976",
  "updatedUnix": "1345491671",
  "containsAdultContent": false,
  "uploadedBy": "Lostimage",
  "primaryFile": null,
  "files": [
    {
      "fileId": "83054",
      "name": "Windfall Island By Lost Image",
      "version": "1.11",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30581",
      "fileName": "Windfall Island By Lost Image-22768-1-11.zip",
      "uploadedUnix": "1345491671",
      "modVersion": "1.11",
      "virusScanUrl": "https://www.virustotal.com/file/7ff8abb65bc5fbd5640747c5b77d669d26b3046d7de29483b4d580a0127850b4/analysis/1407110473/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Windfall%20Island%20By%20Lost%20Image-22768-1-11.zip?fid=83054&ttl=1535792532&ri=8192&rs=8192&setec=2fdd3e35f2b781908270872410c55430"
    }
  ]
}