{
  "modId": 22774.0,
  "modName": "Dawnguard Vampires - Retain your Appearance",
  "summary": "Retain you pretty look as Vampire",
  "descriptionHtml": "[size=20]BEFORE YOU DOWNLOAD, READ THE DESCRIPTION AND MAKE A BACKUP OF YOUR SAVEGAME[/size]\r\n\r\nWhy did you do this mod? Appearance\r\n---------------------------------------\r\nI do not really like to look ugly or have a face preset as Vampire, so i made this.\r\n\r\nWhat does this mod do?\r\n-------------------------------------\r\nExactly what it says, you stay pretty, changes your face to be pretty again after drinking from the \\\"Well of Age\\\" which you can find in the Volkihar Castle in Fura\\'s room (see scrennshots).\r\n\r\n[youtube]jJMQ2YGZJN8[/youtube]\r\n\r\nHow does it Work?\r\n------------------------------\r\nActivate the well in the room and you get three Choices, one is to get Young(your normal look) again, the other to get old(vampire look), the third option allows you to cancel the process, once you select an option you will get reverted to your base Race(if you are a NordRace you will be a NordRace again and not a NordRaceVampire), but you will still be able to do all the Vampire Quests from Harkon and his Court, even people will still comment on your pale skin, you will keep all vampire ability\\'s too, and you can morph into a vampire lord and revert back to your pretty character.\r\n\r\nNote!!!\r\n-----------------\r\nMake a backup of you savegame first, i did test this mod, but i did not test an entire playtrough nor the compatibility with other vampire mods, though my mod does not change any Vanilla scripts or quests the only vanilla thing that is changed was the Volkihar Castle, which contains the well.\r\n\r\n\r\nCompatibility:\r\n------------------------\r\nThis affects only Vanilla Races, because i guess Custom Races use their own Face gen anyway so i guess there is no need to add any custom race compatibility to this one.",
  "categoryId": "79",
  "version": "Beta",
  "author": "Keldis",
  "createdUnix": "1345508827",
  "updatedUnix": "1345510668",
  "containsAdultContent": false,
  "uploadedBy": "Keldis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "83121",
      "name": "Stay Pretty - Main File",
      "version": "Beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Stay Pretty - Main File-22774-Beta.rar",
      "uploadedUnix": "1345510668",
      "modVersion": "Beta",
      "virusScanUrl": "https://www.virustotal.com/file/a0f3c1567af0311a4238366bdaf7dd1170c4a90af528ea92257af1dc659d0c66/analysis/1407111182/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stay%20Pretty%20-%20Main%20File-22774-Beta.rar?fid=83121&ttl=1535792542&ri=8192&rs=8192&setec=388642f5a6383cb7584ec151e5da4905"
    }
  ]
}