{
  "modId": 22791.0,
  "modName": "Home Construction and Decoration",
  "summary": "Have you ever found a spot while wandering through Skyrim and thought to yourself \\\"Man, I really wish I could build a home there.\\\"? Well, now you can.",
  "descriptionHtml": "[img]http://www.skyrimgems.com/images/gems_logo.png[/img]\r\n\r\nFEATURES\r\n=-=-=-=-=-=\r\n- Build your home anywhere, not just in pre-determined locations.\r\n- 14 Different house styles/layouts.\r\n- Easy to use mouse based object placement coupled with dialog based fine adjustments.\r\n- Clutter assistant to help with decorating with annoying havok physics enabled objects.\r\n- Over 150 furniture items in a variety of styles.\r\n- Basic farming/animal tending.\r\n- Furniture crafting on the carpentry table.\r\n- Lore friendly paintings for your walls.\r\n- More!\r\n\r\nDESCRIPTION\r\n=-=-=-=-=-=-=-=\r\nHave you ever found a spot while wandering through Skyrim and thought to yourself \\\"Man, I really wish I could build a home there.\\\"? Well, now you can.\r\n\r\nThis mod adds the ability to construct a home where ever you see fit to do so. Giving you the power to adjust it\\'s placement and rotation to get it just where you want it. Then, you can bring materials to a carpenter\\'s table to construct furniture for your new home. Then you can use the Scrolls of Decoration to place and move your new furniture anywhere in the house. All the basics are currently available, with more stuff on the way. It\\'s a time consuming, but very rewarding process to decorate your house the way you want it. No more prefabs.\r\n\r\nHOW TO USE\r\n=-=-=-=-=-=-=-=\r\nFirst things first, you need to visit Carl Zilla in his shack outside of Riverwood. His shack is on the hill near the bridge. He\\'ll sell you the Land Deed and Construction Rights for 2500 Septims (Use the \\\"How\\'d you build your house up here...\\\" topic, not his merchant topic). He\\'s also got a good selection of furniture.\r\n\r\nOnce you\\'ve got your land deed and construction rights out of the way, you need to find a nice place to build. Really, you can build anywhere. You could even be silly and build your home right in some sap\\'s living room if you want to (NOT RECOMMENDED, obviously). Once you\\'ve got a nice spot picked out, use your deed and construction rights to learn the \\\"Start Construction\\\" power.\r\n\r\nUse this power to place your house on the map. You\\'ll need to buy construction materials, so there will be another expense based on the size of the home. The house will show up all awkward and crooked, probably partially below ground, and you\\'ll almost definitely need to manipulate it to get it to be useable. I guess you should have honed your carpentry skills before hand, huh? No matter though, it\\'s never too late to learn new skills...\r\n\r\nAfter the home is on the map, 3 new powers show up in your magic menu. Construction: Move, Place Door, and Construction: Place. I recommend double fisting both Construction: Move and Construction: Place that way you can cast both quickly to get the house situated properly. Cast Construction: Move on the house and you\\'ll get a menu asking if you\\'d like to Move or Fine Tune the house. Pick move to be able to move it around with your mouse. When you house is where you want it, cast Construction: Place to let go of the house. You can then cast move house again to fine tune the placement. Unlike previous versions, you don\\'t have to keep casting the spell to fine tune, it\\'ll ask you if you need to make anymore adjustments after 3 seconds. Don\\'t cast Construction:Place again before placing the door.\r\n\r\n*** NOTE: Due to the nature of the mod, sometimes you can\\'t get it 100% flush with the ground in every corner...this is the nature of the beast, nothing can be done by me to make it 100% perfect. I usually try to build into a hill if you know what I mean...***\r\n\r\nOnce you\\'ve got your house situated, you need to place your door. Once you cast the place door spell, you\\'ll receive two new spells: Move Door and Door End. I also recommend double fisting those as well. Placing a door works exactly like placing your house: Cast Move Door on it to move it around with the mouse, then cast Door End on it to let go. Once you\\'re finished with Door Placement, cast Door End on the door without having it in move mode to end door placement. Then you can go ahead and cast End Construction on the house, it\\'ll ask you to confirm everything then remove the house and door manipulation spells from your magic menu to keep it nice and tidy.\r\n\r\nOnce you confirm your decision, it\\'ll then ask you to select \\\"Mark Home\\\" from your magic list and cast it on the spot you wish to travel to when you use the \\\"Return Home\\\" power.\r\n\r\nCongratulations, you\\'ve got yourself an empty home. Now you probably want to decorate it. You do this by creating a Carpenter\\'s Bench at the forge, then using your placed carpenter\\'s bench to build furniture, or by visiting Carl Zilla between the hours of 8am and 8pm. Once you have the scrolls you want, head back to your house.\r\n\r\nYou\\'ll want to stand on the place you want to place the furniture, they will be placed where you are standing, not where you are looking/aiming. You\\'ll then receive two more spells: Decorate and End Decorate. You need to cast the spell decorate on the object you wish to manipulate. The object movement works exactly the same as the house and door. You cast Decorate on it to move it with the mouse; you cast End Decorate to place it. Cast Decorate on it again to fine tune the placement. Once you\\'re done decorating cast the \\\"End Decorate\\\" spell while not having any objects in \\\"move mode\\\" to remove the spells from your menu. Don\\'t worry, they\\'ll be added again if you use another scroll later and don\\'t have them.\r\n\r\nThere\\'s a few things that require some skill levels to place, most of these are the crafting items. You won\\'t even be able to create the scrolls until you are at the requisite levels. Most of them require level 60 in the skill they use...except for the tanning rack, which only requires level 30.\r\n\r\nBASEMENT\r\n=-=-=-=-=-=\r\nThe basement is static to all the homes except for the Orc Longhouse (which has a separate basement). It was created to be this way so I could find a way to include weapon racks/plaques, mannequins, and bookshelves. The basement has a decent size storage area, and two doors that lead to your library and your armory.\r\n\r\nFARMING\r\n=-=-=-=-=\r\nYou can now plant the following plants: Apple Tress, Potato Plants, Leeks, Carrots, Cabbages, and Wheat. You can also place fences to fence in your house or farming area.\r\n\r\nTo plant you must have a shovel in your inventory, and you must be outside. There\\'s no IsOnDirt check, so planting in caves is not an option. If you stuck your house in a cave, you won\\'t be able to farm there.\r\n\r\nYou can also decide to keep animals. Cows, chickens and goats are all available to keep. You can sheer the goat\\'s wool, milk cows and goats, and take chicken eggs once a week from each animal that you own. The goat\\'s wool is a great way to make processed cotton (yes, I know, wool isn\\'t cotton...) for your Beds.\r\n\r\nCLUTTER ASSISTANT\r\n=-=-=-=-=-=-=-=-=-=-=\r\nThe clutter assistant spell can be used to lock grabbed items into place. This is useful for hanging things on the walls, or for keeping things from going flying when you bump into them. Because the game still doesn\\'t register positions correctly, it does NOT fix the bug where things move to arbitrary positions upon the cell load, but once an object has registered it\\'s position, this will keep it from moving.\r\n\r\nTHINGS THIS MOD CAN NOT CURRENTLY DO\r\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\r\nUnless Bethedsa or SKSE makes an update that allows linking of references on the fly, I will NEVER be able to include placeable activators like the weapon racks, bookshelves, etc. They require linked references and as far as I can tell, it is currently impossible to create linked references on the fly.\r\n\r\nCREDITS AND THANKS\r\n=-=-=-=-=-=-=-=-=-=-=-=\r\nI used 5 of Stroti\\'s house resources, converted for Skyrim by Tamira\r\n\r\nI used some of the paintings from these modder\\'s resources:\r\n* Paintings and Frames by Artisanix - http://skyrim.nexusmods.com/mods/17423\r\n* Celtic Decor for Skyrim by DarkRider - http://tesalliance.o...r-i-for-skyrim/\r\n\r\nI used some objects from these modder\\'s resources:\r\n* Insanity\\'s Clutter Stuffs by Insanity Sorrow - http://tesalliance.org/forums/index.php?/files/file/1319-insanitys-clutter-stuffs/\r\n* Modder\\'s Resource Pack- http://skyrim.nexusmods.com/mods/16525\r\n* Strotis Organ Resource - http://skyrim.nexusmods.com/mods/25182\r\n* Insanity Sorrow\\'s Clocks - http://tesalliance.org/forums/index.php?/files/file/1354-insanitys-clocks-sundials/\r\n\r\nfdenota2 on Steam for the relentless, but appreciated, nudging to update the object placement system. He\\'s also responsible for some of the mounted head models and the Sabercat Rug.\r\n\r\nKNOWN ISSUES\r\n=-=-=-=-=-=-=-=-=\r\nIf you don\\'t have a house built, and Carl Zilla doesn\\'t have a \\\"How\\'d you get your house up here...\\\" topic, you have the dialog/quest bug. This is not a bug in my mod, but a known issue caused by the last patch. Watch this video for a fix:\r\nhttp://www.youtube.com/watch?v=N-X9ldxBQ8o\r\n\r\nBecause papyrus script properties on objects are saved in the save game (or at least that what I\\'m assuming is causing this issue) some already placed objects will not correctly identify which scroll to give you if they are deleted. This only applies to objects placed in versions previous to 8.1 of the mod. All objects placed from 8.1 on out will give the correct scroll in every instance that I\\'ve tried. \r\n\r\nCHANGE LOG\r\n=-=-=-=-=-=-=-=\r\nv9.1 - Fixed the static doors in the manor home\r\n- Fixed the awkwardly placed bookcase in the old mill home.\r\n- Added craftable and placeable interior doors. \r\n\r\nv 9.0 - 5 new houses\r\n- 8 planters with various harvestable plants\r\n- a few new furniture items\r\n- bugs squashed\r\n\r\nv 8.5 - It\\'s been so long that I may have made changes that I miss, so bear with me.\r\n- Adjusted most scroll prices.\r\n- Fixed outside lights to be brighter.\r\n- Removed AI package from Carl Zilla. This should keep him from wandering off and not returning to his shack.\r\n- Removed the Courtyard Gate. It was impossible to work with both on my and and yours.\r\n- Removed the planting soil from the Hearthfire add-on. Couldn\\'t get it to work.\r\n- Added some winter solstice decorations (Tree and Wreath). Neither respond to the move spell so activate them to move them around.\r\n- Fixed the small cooking spit, you should now get a crafting menu.\r\n- Removed the house requirement from the basement door. You can now build the basic basement door at any time buy crafting it from the carpenter\\'s table. The only way to get the cave basement is to build the Orc longhouse still.\r\n- Quite possibly other stuff...\r\n\r\nv 8.1 - Updated the delete spell, you now get a scroll back when you choose to delete an object. \r\n- Added exterior lamps.\r\n- Added a set of stone stairs for landscaping.\r\n- Added a map of skyrim which, if you have a horse stabled, can be used to plan trips to any of the hold capitals.\r\n- Fixed a few minor errors in the object recipes.\r\n- Added a few Dawnguard items to a separate Dawnguard add-on.\r\n\r\nv 8.0 - Changed the farming crops from flora to activators. This means they won\\'t display their \\\"empty\\\" states, but it also means I have better control on when they re-spawn their ingredients.\r\n- Fixed the Hearthfire add-on objects to respond to the decorate spells correctly.\r\n- Fixed the coffin to detect if the player is a vampire properly.\r\n- Added an organ to the furniture options. (http://skyrim.nexusmods.com/mods/25182) - it plays a short clip of Dies Irae when you activate it.\r\n- Added two clocks from InsanitySorrow\\'s clock resource (http://tesalliance.org/forums/index.php?/files/file/1354-insanitys-clocks-sundials/) - They tell you the in-game date and time when you activate them.\r\n- Added auto-store containers for ingots, potions, and keys (models from this resource: http://skyrim.nexusmods.com/mods/16525)\r\n- Added weapon plaques to the placeable objects. They are not activators, but are meant to be used with the \\\"decorator assistant\\\" spell to manually hang your weapons.\r\n- Added display cases. They are not activators, but are meant to be used with the \\\"decorator assistant\\\" spell to manually display your loot.\r\n\r\n\r\nv 7.8 - Added benches.\r\n- Added mounted dragon heads.\r\n- Added a custom model to the carpenter\\'s table.\r\n- Fixed a lot of bugs.\r\n\r\nv 7.5 - Fixed the description on the Dwemer Tower indicating an incorrect number of floors.\r\n- Removed a floating wall basket that had made it\\'s way into the Dwemer Tower interior.\r\n- Added \\\"Craftable Stone\\\" as a resource that drops randomly from ore veins. You get 5 at a time when it drops. This stone resource will replace the \\\"iron ingots\\\" that seemed out of place on some furniture recipes.\r\n- Added a few new recipes to the grain mill. It\\'s now possible to mix a salt pile and a flawless ruby, sapphire, or Amethyst to yield fire salts, frost salts, and void salts respectively. There\\'s also a recipe for synthetic moon sugar that can be found as a random drop from certain hostiles.\r\n- Added an auto store feature to all craftable dressers, wardrobes, etc. Now when you activate them you can select to automatically store all your non-armor clothes (only the vanilla stuff at the moment).\r\n\r\nv 7.4 - Added Thrones, now you can show those haughty Jarls that you\\'re just as good as they are by sitting in a throne in the comfort of your own home.\r\n- Added the ability to scale objects from 1/4 to twice their original size. Collision DOES NOT UPDATE and WILL MORE THAN LIKELY NEVER BE MADE TO UPDATE. I can\\'t get a new collision without editing the object in NifSkope, so DO NOT ASK ME TO UPDATE IT. If you don\\'t want slightly wonky collision, do not use the scale option. That said, I\\'m willing to work with the limits of resizablility if things are too wonky for most users. So please speak up, just be aware that the collision meshes are embedded in the model and can\\'t be updated with scripts.\r\n- Fixed a few missing properties on certain objects.\r\n- Removed the house key requirement on the furniture objects. This means that the mod can now be used to furnish ANYWHERE without needing to console yourself a house key. Want an extra bed or an anvil in Breezehome, no problem, you can do that now. You will still need to construct a carpenter\\'s table at a forge to build furniture objects though. There are some objects, like the stables and basement that do their own checks to make sure you have a house built. These will not be removed, so they will still not work if you haven\\'t built one of the houses from this mod.\r\n\r\nv 7.3 - Moved the mounted mammoth head into the mounted animals scroll. Hopefully this will fix a rare crash issue.\r\n- Removed the fine tune and move options from the Clutter Assistant spell. They were acting strange and I\\'m not sure why. Hopefully this is temporary. It still works to lock objects in place however.\r\n- Added the ability to move objects that where unable to be hit by the move spell by activating them. Currently this applies to the following items: Cabbage, Leek, Carrot, and Potato plants, & the Alchemy Satchel. If you run into more objects that do not respond to the spell, please let me know. If you activate them in sneak mode, it will enable the move menu the next time they\\'re activated.\r\n- Added auto store to the food barrel, beverage barrel, safe, and alchemy satchel. Now when you activate these items you\\'ll get a prompt asking if you want to automatically store all the objects you\\'re carrying that they\\'re \\\"designated\\\" to store. This only works for items in the vanilla game and those added by this mod.\r\n\r\nv 7.2 - Added the clutter assistant spells to help lock any item you can grab into place.\r\n- Added a few new furniture options.\r\n- Added a beverage crafting barrel to make alcoholic beverages.\r\n- Updated the way doors work. You should no longer get stuck between the door and the house when you exit.\r\n- Stomped bugs.\r\n\r\nv 7.0 - Mouse based object manipulation. Now you can move your objects around your house with your mouse. This makes placing objects MUCH more user friendly.\r\n- The Grain Mill has been added and turned into a crafting bench. Make flour from wheat, or crush skulls into bone meal. Flour can be used in potions or in the baking of bread.\r\n- Frostfall compatibility added. Make sure to load this mod after Frostfall for it to work.\r\n- Some bugs fixed.\r\n\r\nv 6.5 - Added pieces to construct a courtyard area around your home. These include a gatehouse, a gate, and stone walls.\r\n- Added a single stall stable by request.\r\n- Added 3 new mounted animal heads for decoration: Goat, Horker, and Antlers.\r\n\r\nv 6.0 - Fixed the floating floors in the cave mansion\r\n- Fixed the non-working door in the Orc Longhouse Basement\r\n- Added object models to the Decoration Scrolls: Now you\\'ll be able to see what it is that they place. If you drop them, they\\'ll look like the furniture object, but will not be unusable until you cast/place them properly.\r\n- Added a full Dwemer furniture set, about 20 new items were added.\r\n- Added shrines for the Nine Divines. Now you can choose to worship the Nine instead of just Daedra.\r\n\r\nv 5.5 - Fixed more bugs\r\n- Added two new home styles - The Dwarf Tower and the Cave Mansion. The Cave Mansion needs to be built into a mountain to look correct.\r\n\r\nv 5.0 - Changed XYZ menu options to easier to understand directions. X became \\\"West/East\\\", Y changed to \\\"South/North\\\" and Z to \\\"Down/Up\\\"\r\n- Added Daedra worship altars, each with their own blessing. There\\'s 16 to choose from, one for each Daedra Prince (with the exception of Jyggalag, who\\'s fate, according to the lore, is unknown at this time).\r\n- Fixed the lighting of the fireplace and firepit. Now just cast \\\"Light Object\\\" directly on the firepit/place and you\\'ll get a menu asking if you want to move the logs/fire around. The menu will reappear every 3 seconds after the last adjustment until you tell it your finished.\r\n- Added a bsement option to the Orc Longhouse. It\\'s it\\'s own unique cave basement.\r\n- Fixed a couple of minor bugs.\r\n\r\nv 4.5 - Added lighting objects to the placeable furniture.\r\n- Exterminated more bugs.\r\n\r\nv 4.2 - Fixed a problem with the stables.\r\n\r\nv 4.1 - Fixed the issue with the delete spell not being added to the player\\'s spell list.\r\n\r\nv 4.0 - Added more furniture options.\r\n- Added stables for keeping horses.\r\n- Added a basement to all the homes.\r\n- Added an NPC (based on yours truly) in a shack (based on the first home I ever built with this mod) outside of Riverwood, by the bridge. He\\'ll sell you the Deed and Construction Rights you need to start building your home. He\\'s also got a few furniture scrolls for sale.\r\n- Added the ability to delete any FURNITURE you\\'ve placed. It does not work on houses or doors. You\\'ll receive the spell when you load a game with a purchased house in it. Or when you purchase your first house. It\\'s the only decoration spell that this mod adds that will not be removed by ending decoration or construction.\r\n- More bugs got squished.\r\n\r\nv 3.0 - Added somewhere in the neighborhood of 30 new furniture options.\r\n- Added rudimentary farming. Now you can plant your own Potatoes, Apples, Carrots, Leeks, Cabbage, and Wheat. You need a shovel to dig with (just in your inventory is fine), and you need to be outdoors.\r\n- Changed some of the dialog options to be less confusing.\r\n- Added a DIY Furniture Guide which will be added to your inventory upon ending house construction. It has all the recipes for all the furniture implemented so far.\r\n- Sprayed for more bugs.\r\n\r\nv 2.1 - Fixed an error in the script controlling the mounted heads.\r\n\r\nv 2.0 - Added 5 more house choices with their own floor plans.\r\n- Added more furniture.\r\n- Fixed several bugs.\r\n\r\nv 1.0 - Initial Release.\r\n\r\nv 0.9 - Public beta posted on the Bethsoft forums. ",
  "categoryId": "67",
  "version": "9.1",
  "author": "Carlzilla",
  "createdUnix": "1345524875",
  "updatedUnix": "1371367769",
  "containsAdultContent": false,
  "uploadedBy": "Carlzilla",
  "primaryFile": null,
  "files": [
    {
      "fileId": "83153",
      "name": "HCAD - V1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "29",
      "fileName": "HCAD - V1_0-22791-1-0.rar",
      "uploadedUnix": "1345525118",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2ed7bde3a2d0b015d0303f5b4410346757de61e9a4ffa68522facd3c83cb2c38/analysis/1407111489/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD%20-%20V1_0-22791-1-0.rar?fid=83153&ttl=1535792562&ri=8192&rs=8192&setec=f257a7c25917df9b2c3c302f5f5c28ec"
    },
    {
      "fileId": "83574",
      "name": "HCAD - 2_0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "56",
      "fileName": "HCAD - 2_0-22791-2-0.rar",
      "uploadedUnix": "1345686528",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/1506ba1a8217c5b97ddbfd3bb27945c456d7cdf3e74928216d8efc664e9ec59c/analysis/1407115562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD%20-%202_0-22791-2-0.rar?fid=83574&ttl=1535792562&ri=8192&rs=8192&setec=ec901140d1d949114fe0da88a05fae70"
    },
    {
      "fileId": "83575",
      "name": "HCAD v2_1",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "56",
      "fileName": "HCAD v2_1-22791-2-1.rar",
      "uploadedUnix": "1345687680",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/7a77cbdac57895568f3380789365d042c726731bec6eb12c266a6fe30c9614a9/analysis/1407115563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD%20v2_1-22791-2-1.rar?fid=83575&ttl=1535792562&ri=8192&rs=8192&setec=c94deb8bccad93ef7d5bd2247eb5ec4d"
    },
    {
      "fileId": "83831",
      "name": "HCAD_V_3_0",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "65",
      "fileName": "HCAD_V_3_0-22791-3-0.rar",
      "uploadedUnix": "1345782441",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/4b2bc8bb78d176539be0ae5532e5d35d16dcb8fd884af887eb5bb23bdd899ed5/analysis/1407117843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD_V_3_0-22791-3-0.rar?fid=83831&ttl=1535792563&ri=8192&rs=8192&setec=7cd42a09c1e80a3d0ce063b02d37b120"
    },
    {
      "fileId": "84271",
      "name": "HCAD_v_4_0",
      "version": "4.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9175",
      "fileName": "HCAD_v_4_0-22791-4-0.rar",
      "uploadedUnix": "1345952344",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/4efa68dec9ee5b9c2e9498b1767e4db998eb4c1c05ea6ef35145a51acc7d0eb3/analysis/1407122167/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD_v_4_0-22791-4-0.rar?fid=84271&ttl=1535792564&ri=8192&rs=8192&setec=84872ce3ad2f1dc10009c59e6cddf933"
    },
    {
      "fileId": "84434",
      "name": "HCADv4_1",
      "version": "4.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8979",
      "fileName": "HCADv4_1-22791-4-1.rar",
      "uploadedUnix": "1346010278",
      "modVersion": "4.1",
      "virusScanUrl": "https://www.virustotal.com/file/42aec60f6edd3b7eb8e586526a61e32730da7f665f17a539b287c185aada79ec/analysis/1407123734/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCADv4_1-22791-4-1.rar?fid=84434&ttl=1535792564&ri=8192&rs=8192&setec=a500d354c483a9fcc7934f68d09afc26"
    },
    {
      "fileId": "84539",
      "name": "HCAD_v4_2",
      "version": "4.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9179",
      "fileName": "HCAD_v4_2-22791-4-2.rar",
      "uploadedUnix": "1346040268",
      "modVersion": "4.2",
      "virusScanUrl": "https://www.virustotal.com/file/0b55a31d6e2206ab8299c907ff32cb6cb658602e0a0d45e179c924d9078c2581/analysis/1407125059/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD_v4_2-22791-4-2.rar?fid=84539&ttl=1535792565&ri=8192&rs=8192&setec=6bb12eb54f60ccb1ddb59cac2763ac4a"
    },
    {
      "fileId": "84632",
      "name": "HCAD_v4_5",
      "version": "4.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9162",
      "fileName": "HCAD_v4_5-22791-4-5.rar",
      "uploadedUnix": "1346082135",
      "modVersion": "4.5",
      "virusScanUrl": "https://www.virustotal.com/file/433072f1e2ab9d001bf86bfab6ef17e654fe80a95e80dff7e56f0282fa8ee6c3/analysis/1407125899/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD_v4_5-22791-4-5.rar?fid=84632&ttl=1535792565&ri=8192&rs=8192&setec=0c9db596e07166e489550de9dd6a0623"
    },
    {
      "fileId": "85150",
      "name": "HCAD_v5_0",
      "version": "5.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9110",
      "fileName": "HCAD_v5_0-22791-5-0.rar",
      "uploadedUnix": "1346267249",
      "modVersion": "5.0",
      "virusScanUrl": "https://www.virustotal.com/file/1ec3c0118cea172403938adb9a610bed6597a08cff92e03b687ff9193fc4bcb4/analysis/1407131424/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD_v5_0-22791-5-0.rar?fid=85150&ttl=1535792566&ri=8192&rs=8192&setec=324af281cf90b679ed9caec74b70fdc1"
    },
    {
      "fileId": "85410",
      "name": "HCADv5_5",
      "version": "5.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9227",
      "fileName": "HCADv5_5-22791-5-5.rar",
      "uploadedUnix": "1346362296",
      "modVersion": "5.5",
      "virusScanUrl": "https://www.virustotal.com/file/5664ae718d905bf3c8b997a4da652582ae34bd343abdd365c8d8c4a7c63ede6e/analysis/1407133928/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCADv5_5-22791-5-5.rar?fid=85410&ttl=1535792566&ri=8192&rs=8192&setec=3195a8ab364e1f109c9ee6c3165c873d"
    },
    {
      "fileId": "85568",
      "name": "HCAD_v6_0",
      "version": "6.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9170",
      "fileName": "HCAD_v6_0-22791-6-0.rar",
      "uploadedUnix": "1346437509",
      "modVersion": "6.0",
      "virusScanUrl": "https://www.virustotal.com/file/cf5551c0015ae5f3b67beca8bc2877ecac86d5ea73c039102941fcc22215374c/analysis/1407135753/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD_v6_0-22791-6-0.rar?fid=85568&ttl=1535792567&ri=8192&rs=8192&setec=550e1fd50033bb7ad4a8b5b009076957"
    },
    {
      "fileId": "86821",
      "name": "HCAD_v6_5",
      "version": "6.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9171",
      "fileName": "HCAD_v6_5-22791-6-5.rar",
      "uploadedUnix": "1346954659",
      "modVersion": "6.5",
      "virusScanUrl": "https://www.virustotal.com/file/a41f9ff626e61764b54d6d7a97870198562763e4cc75662d84658e06c32e6c01/analysis/1407149473/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD_v6_5-22791-6-5.rar?fid=86821&ttl=1535792568&ri=8192&rs=8192&setec=c43c403edd2fa58d626f5aca83e379da"
    },
    {
      "fileId": "87491",
      "name": "HCAD_v7_0",
      "version": "7.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9055",
      "fileName": "HCAD_v7_0-22791-7-0.rar",
      "uploadedUnix": "1347220979",
      "modVersion": "7.0",
      "virusScanUrl": "https://www.virustotal.com/file/9f3ed625452414771f1b8a5331988cc6e1b272aa6c6f36f4972313d5aa01b2fe/analysis/1407156606/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD_v7_0-22791-7-0.rar?fid=87491&ttl=1535792568&ri=8192&rs=8192&setec=1e3cc26a0ccb8bb5d88445b212f3cefa"
    },
    {
      "fileId": "88662",
      "name": "HCAD_v7_2",
      "version": "7.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14561",
      "fileName": "HCAD_v7_2-22791-7-2.rar",
      "uploadedUnix": "1347736224",
      "modVersion": "7.2",
      "virusScanUrl": "https://www.virustotal.com/file/d936e8d8df11554b1573731bd3682753a4b4ac91cc41799d9496556cf35f47ed/analysis/1407167895/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD_v7_2-22791-7-2.rar?fid=88662&ttl=1535792569&ri=8192&rs=8192&setec=901dbb66e9540cec6d8ef299ba9702f5"
    },
    {
      "fileId": "89570",
      "name": "HCAD_v7_3",
      "version": "7.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15527",
      "fileName": "HCAD_v7_3-22791-7-3.rar",
      "uploadedUnix": "1348173279",
      "modVersion": "7.3",
      "virusScanUrl": "https://www.virustotal.com/file/a577bc4e4bef08fe32acab903bc449d5f2da426762c50ea66dac3477b5dfb0e3/analysis/1407178213/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD_v7_3-22791-7-3.rar?fid=89570&ttl=1535792569&ri=8192&rs=8192&setec=82b398c1ed04275e809fe21668794c87"
    },
    {
      "fileId": "89900",
      "name": "HCAD_v7_4",
      "version": "7.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15299",
      "fileName": "HCAD_v7_4-22791-7-4.rar",
      "uploadedUnix": "1348338726",
      "modVersion": "7.4",
      "virusScanUrl": "https://www.virustotal.com/file/3dc124f89eb8e649a4da25958fdede13fb206ba25c56c4980b36d68eb0c204ef/analysis/1407181761/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD_v7_4-22791-7-4.rar?fid=89900&ttl=1535792570&ri=8192&rs=8192&setec=6c2825cffddb8ba583e6ef1f5fdc6bd9"
    },
    {
      "fileId": "90148",
      "name": "HCAD_v7_5",
      "version": "7.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15293",
      "fileName": "HCAD_v7_5-22791-7-5.rar",
      "uploadedUnix": "1348446200",
      "modVersion": "7.5",
      "virusScanUrl": "https://www.virustotal.com/file/c3c2b8fab7c7bc66a2e9f8ef13b4c4e2ff33406b769e18d8ab85a12d5bae2662/analysis/1407184095/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD_v7_5-22791-7-5.rar?fid=90148&ttl=1535792571&ri=8192&rs=8192&setec=c93c87a49a62983e40e8c1f94f5eb0f4"
    },
    {
      "fileId": "92270",
      "name": "HCAD_v7_8",
      "version": "7.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16389",
      "fileName": "HCAD_v7_8-22791-7-8.rar",
      "uploadedUnix": "1349494680",
      "modVersion": "7.8",
      "virusScanUrl": "https://www.virustotal.com/file/217b4dd8d7d048c445febde62cb8ea5de8b509fd8b139be2265cbe727f21cb44/analysis/1407206076/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD_v7_8-22791-7-8.rar?fid=92270&ttl=1535792572&ri=8192&rs=8192&setec=332646e87b8b4ba9d862ab51cc0f432a"
    },
    {
      "fileId": "93529",
      "name": "HCAD V8_0",
      "version": "8.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23710",
      "fileName": "HCAD V8_0-22791-8-0.rar",
      "uploadedUnix": "1350076129",
      "modVersion": "8.0",
      "virusScanUrl": "https://www.virustotal.com/file/4793f80c63bc3df75d6d00900692427fa71b001f4ce62242c29c7dee355328a5/analysis/1407218293/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD%20V8_0-22791-8-0.rar?fid=93529&ttl=1535792572&ri=8192&rs=8192&setec=a320e41a3f5172230f8177ab827e9f89"
    },
    {
      "fileId": "94031",
      "name": "HCAD V8_1",
      "version": "8.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23857",
      "fileName": "HCAD V8_1-22791-8-1.rar",
      "uploadedUnix": "1350318802",
      "modVersion": "8.1",
      "virusScanUrl": "https://www.virustotal.com/file/6a990132685d3ef8b62d1c1ffb89d281c5f20a995ec1f832d61cfa63ae9310b6/analysis/1407223415/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD%20V8_1-22791-8-1.rar?fid=94031&ttl=1535792573&ri=8192&rs=8192&setec=b8486706e7c7f755c6828e08587ca5c2"
    },
    {
      "fileId": "94033",
      "name": "HCAD Dawnguard Add-on",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "HCAD Dawnguard Add-on-22791-.rar",
      "uploadedUnix": "1350319275",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0aa57b7e27d78153b54267d147cb2c6ba798b8aac41c5027248b10dd3ce779d7/analysis/1407223442/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD%20Dawnguard%20Add-on-22791-.rar?fid=94033&ttl=1535792573&ri=8192&rs=8192&setec=0a79a38349e198dcea8dfd8316d73a4b"
    },
    {
      "fileId": "104403",
      "name": "HCAD V8_5",
      "version": "8.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23950",
      "fileName": "HCAD V8_5-22791-8-5.rar",
      "uploadedUnix": "1355154047",
      "modVersion": "8.5",
      "virusScanUrl": "https://www.virustotal.com/file/ef199256566bcae30d5dd6d5f226a14baaa499f8767b977508b55d15a412f82d/analysis/1407298586/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD%20V8_5-22791-8-5.rar?fid=104403&ttl=1535792574&ri=8192&rs=8192&setec=1cebb923ecffd9f9243d9b00502967e2"
    },
    {
      "fileId": "104405",
      "name": "HCAD Hearthfire Add-on",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7",
      "fileName": "HCAD Hearthfire Add-on-22791-.rar",
      "uploadedUnix": "1355154104",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/6e004dba41495c4967a3b967dfca07b9eb8d6908e5a8cca4b2e49d12059f6fbf/analysis/1407298587/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD%20Hearthfire%20Add-on-22791-.rar?fid=104405&ttl=1535792574&ri=8192&rs=8192&setec=94b2ab6c2218c993c740f5b2f7bcef5e"
    },
    {
      "fileId": "1000034429",
      "name": "HCAD_v9_1",
      "version": "9.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "50497",
      "fileName": "HCAD_v9_1-22791-9-1.rar",
      "uploadedUnix": "1371367769",
      "modVersion": "9.1",
      "virusScanUrl": "https://www.virustotal.com/file/5de2bdf1f0a95e508e77c2178ab7c6b7e4bc3f534af2d5aca9f204973ebc53a0/analysis/1407605768/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HCAD_v9_1-22791-9-1.rar?fid=1000034429&ttl=1535792575&ri=8192&rs=8192&setec=591693b75155cc623f7e6de8f23f4186"
    }
  ]
}