{
  "modId": 22806.0,
  "modName": "Cube of Transmutation",
  "summary": "This mod adds a new item to the game called the Cube of Transmutation, inspired by the Horadric Cube from Diablo II and adapted to fit within Tamrielic lore. This item allows players to experience a whole new way of crafting items. With the power of the Cube you can, for example, transmute low quality items, or convert items of one type to another.",
  "descriptionHtml": "[b][size=30]Version 3.0 is LIVE![/size][/b]\r\n\r\n[b][u]INTRODUCTION:[/u][/b]\r\n\r\nThe Dwemer, also known as the Dwarves, are well-known for their affinity with technology and craftsmanship. Examples of their work include the Animunculi, Kagrenac\\'s Tools, Numidium and the Lexicons. However, there is another piece of Dwarven technology that is thought to be lost in time and only recently has traces of it\\'s existence come to light: the Cube of Transmutation!\r\n\r\nThe Cube is identical in appearance to a Lexicon, but it\\'s purpose is entirely different. Experiments have shown that several lesser quality items placed inside the Cube can be transmuted into into a single high quality one. It can also convert items of one type into items of another type, for example it can convert arrows into crossbow bolts of the same material, and vice versa. And this is only scratching the surface of the Cube\\'s mysteries.\r\n\r\nBecause of its complexity in design, the Cube of Transmutation requires several rare materials in order to be crafted, including a Centurion Dynamo Core and a Grand Soul Gem. The Cube also requires a special forge for it\\'s construction. Once crafted, however, the wielder would have a powerful tool at his/her disposal!\r\n\r\n\r\n[b][u]DESCRIPTION:[/u][/b]\r\n\r\nThis mod adds a new item to the game called the Cube of Transmutation, inspired by the Horadric Cube from Diablo II and adapted to fit within Tamrielic lore. This item allows players to experience a whole new way of crafting items. With the power of the Cube, you can transmute lower quality items into a higher quality one, or convert items of one type to another!\r\n\r\n\r\n[b][u]INSTLLATION:[/u][/b]\r\n\r\n[i][b]NOTE:[/b] Requires [url=http://skse.silverlock.org]SKSE[/url] for this mod to work! If upgrading from version 2.0 or older, you must also remove the file TransmutationCube.esp from the Data folder.[/i]\r\n\r\nFirst, you must choose which version of the mod you are using. Choose the Skyrim version only if you do not have Dawnguard installed, otherwise choose the Dawnguard version.\r\n\r\nNext, you should be able to install the damn thing!\r\n\r\nThere are two ways to install. You can install this mod manually by extracting all files from CubeOfTransmutation.zip to your Skyrim directory. This should normally be: C:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\r\n\r\nAlternatively, you can download and install the mod via Nexus Mod Manager. You can download and install the program [url=http://skyrim.nexusmods.com/mods/modmanager]HERE[/url]! \r\n\r\nOnce you have installed the mod, start playing the game!\r\n\r\n\r\n[b][u]HOW TO USE:[/u][/b]\r\n\r\nThe Cube of Transmutation can be smithed at either the Skyforge in Whiterun (both Skyrim and Dawnguard version) or at the Atherium Forge (Dawnguard version only), under the Misc section. You will also need the following materials for crafting: 1 Centurion Dynamo Core, 1 Grand Soul Gem, 2 Small Dwemer Levers, 3 Dwemer Gears and 6 Small Dwemer Plate Metals.\r\n\r\nOnce crafted, you can open your Inventory. The Cube of Transmutation can be found under the Aparallel section. Equip it, exit your inventory and a special crafting menu should automatically appear.\r\n\r\nNow you can begin transmuting and converting items with the Cube\\'s power!\r\n\r\n\r\n[b][u]WHAT CAN I TRANSMUTE/CONVERT?:[/u][/b]\r\n\r\nLet me give you a few examples of what you can make with the Cube of Transmutation...\r\n\r\n3 Minor Potions of Healing > Potion of Healing\r\n3 Diamonds > Flawless Diamond\r\n3 Common Soul Gems > Greater Soul Gem\r\nSteel Arrow > Steel Bolt (Dawnguard only)\r\n10 Dwarven Bolts > 10 Dwarven Arrows (Dawnguard only)\r\n\r\nAnd that\\'s not all, here\\'s an extended list of what it can do! This is not the full list, so it is up to you to discover more of the Cube\\'s secrets!\r\n\r\n- Transmutes all potions and poisons.\r\n- Transmutes all valuable gemstones.\r\n- Transmutes all unfilled soul gems, except Black Soul Gems.\r\n- Converts Steel and Dwarven Arrows into crossbow bolts and vice versa, either one at a time or in multiples. (Dawnguard only)\r\n\r\n\r\n[b][u]CHANGELOG:[/u][/b]\r\n\r\n[b]Version 3.0:[/b]\r\n- Now comes in two versions, Skyrim and Dawnguard. This would make it so that non-Dawnguard users would be able to use the Cube of Transmutation for the first time!\r\n- The Ancient Knowledge ability is now required to craft the Cube of Transmutation. There is an optional .ESP available for download which removes this requirement.\r\n\r\n[b]Version 2.5:[/b]\r\n- The file has now been converted to a master file. This would help encourage the modding community to create additional recipes for the Cube of Transmutation when necessary.\r\n- Added a new load screen. However, I\\'m not sure if it actually works because I haven\\'t even seen it in-game yet.\r\n- Added the ability to transmute different ores by using a given number of Iron Ores and a different Flawless Gem for each progressive tier. The highest grades of ore, Gold and Ebony, would require an extra alchemical ingredient.\r\n- Added the ability to transmute two lower grade arrows into a single higher grade arrow. You can also transmute twenty lower grade arrows into ten higher grade arrows! [i]This will also work with crossbow bolts once the relevant add-on is available for download.[/i]\r\n- A couple of additional recipes, including Blood Potions for vampires.\r\n\r\n[b]Version 2.0:[/b]\r\n- Made it so that all of the Cube of Transmutation\\'s recipes are now hidden in the crafting menu, and that a recipe will only show once the player has the required crafting materials for it. This makes the menu feel less cluttered and adds a sense of mystery.\r\n- Added some new recipes! You can now create Black Soul Gems by transmuting a Grand Soul Gem and a Daedra Heart. You can also transmute a Spell Tome and a Paper Roll into five Scrolls of the same spell, or transmute five Scrolls and a Burned Book into a Spell Tome of the same spell. And there\\'s more to discover!\r\n- Added recipes that were missing in the first version.\r\n\r\n\r\n[b][u]COMING SOON:[/u][/b]\r\n\r\nEventually, I\\'ll be getting around to implementing the following based on the suggestions that I\\'ve been given.\r\n\r\n[b]Complete/In Progress:[/b]\r\n- Even more recipes along the way. [i]Ongoing.[/i]\r\n\r\n[b]Being Considered:[/b]\r\n- A way to upgrade leveled unique items. [i]Now this could be something that I might actually look into![/i]\r\n- Add at least one secret recipe. [i]I\\'m not sure if I\\'m able to do that myself now, but we\\'ll see.[/i]\r\n\r\n[b]Cancelled:[/b]\r\n- The ability to create non-unique enchanted items. [i]I was going to plan this feature, but unfortunately it had to be cancelled since no one seems to want to help me implement this feature. If you\\'re a modder and you\\'re interested in adding this feature yourself via an add-on, then just give me a PM and I\\'ll send you some files to work with.[/i]\r\n\r\n[b]Rejected:[/b]\r\n- Transmute two weapons of the same quality into a different weapon of the same quality, for example two daggers into a one-handed sword. [i]Larger mods, such as SkyRe, may cause some complications due to the addition of many new types of weapons. Of course, I could make a patch for each of those mods, but weapons aren\\'t exactly arrows and crossbow bolts now, are they?[/i]\r\n- An alternate way of creating soul gems by using Soul Gem Fragments. [i]Won\\'t work due to the limitations of crafting recipes. This is because Soul Gem Fragents are actually a bunch of different items under the same name.[/i]\r\n- Gem sockets, like in Diablo II and III. [i]I don\\'t know if that\\'s even possible at all. Even if it is, it would require some advanced sripting techniques. Trust me, this could be A LOT more work than it\\'s worth.[/i]\r\n\r\n\r\n[b][u]QUESTIONS AND ANSWERS:[/u][/b]\r\n\r\n[b]Q. Why does this thing remind me so much of Diablo II?\r\nA.[/b] Besause as I\\'ve said before, it is inspired by the Horadric Cube from Diablo II and adapted to fit within the lore of the Elder Scrolls franchise.\r\n\r\n[b]Q. If that was the case, then this item should\\'ve been just called the Horadric Cube.\r\nA.[/b] If that was the case, then this wouldn\\'t be a lore friendly mod. Clearly, you haven\\'t been paying much attention. :P\r\n\r\n[b]Q. I\\'ve activated this mod, but as soon as the game starts it crashes! HELP!!!\r\nA.[/b] Have you paid any attention to the requirements of this mod? The Dawnguard DLC and Skyrim Script Extender (SKSE) are required for this mod to run, so if you don\\'t have those while this mod is active then the game won\\'t bloody work! It\\'s common sense, really.\r\n\r\n[b]Q. I\\'ve recently upgraded from version 2.0, but the Cube disappeared from my inventory!\r\nA.[/b] Unfortunately, one of the side-effects of the mod\\'s conversion to a master file is that the Cube of Transmutation from the original ESP will disappear from the player\\'s inventory. Don\\'t worry though, because the in-game data for the item is still in the new ESM (provided that it\\'s active), but you would have to reforge the Cube in order to get things to work again. This would only be necessary if you have upgraded from a version that is older than 2.5.\r\n\r\n[b]Q. I\\'ve activated the Cube of Transmutation and I couldn\\'t see anything in the crafting menu!\r\nA.[/b] That\\'s because you would have to discover the recipes yourself. Why don\\'t you become a kleptomaniac or something all the way through a dungeon until you reach the end? Maybe you\\'ll find something. XD\r\n\r\n[b]Q. You\\'ve mentioned that I would require a Burned Book to create a Spell Tome. Why not a Ruined Book?\r\nA.[/b] Because, believe it or not, there are actually two different Ruined Books! I\\'d have to use the Burned Book because there would be less complications regarding the limitations of crafting recipes. I\\'d hate to have it this way, but what else can I do?\r\n\r\n[b]Q. Why can\\'t I convert my Daedric Arrows into bolts?\r\nA.[/b] Because Daedric Bolts don\\'t exist in vanilla Skyrim, along with any other kind or crossbow bolt that isn\\'t Steel or Dwarven. However, now that there is a complitation mod of the different craftable crossbow types which can be found [url=http://skyrim.nexusmods.com/mods/23876]here[/url], I am able to create an optional add-on for this mod that will allow you to convert more arrow types into bolts! Watch this space. ;)\r\n\r\n[b]Q. Are there any translated versions of this mod?\r\nA.[/b] Yes, there is a list of translated versions in the next section.\r\n\r\n[b]Q. Where do I report bugs or suggest new crafting recipes for the Cube?\r\nA.[/b] Feel free to do so in the comments section!\r\n\r\n[b]Q. How do I create new crafting recipes for the Cube of Transmutation?\r\nA.[/b] Create a new file with the Creation Kit as normal, then assign the file TransmutationCube.esm as the plug-in\\'s master file. Just to let you know, the workbench keyword for making new crafting recipes is CraftingTransmute. Also, you may want to look at existing recipes for the Cube of Transmutation before making your own, just to see how they work.\r\n\r\n\r\n[b][u]TRANSLATED VERSIONS:[/u][/b]\r\n\r\nEnglish not your first language? Not a problem! Here is a list of currently translated languages. They can be all found in this mod\\'s download page, under MISCELLANEOUS.\r\n\r\n[b]RUSSIAN:[/b] Currently version 3.0, translated by Siegrun.\r\n\r\nI will give permission to anyone who wants to translate this mod, under one condition: if you are going to upload it anywhere, upload it ONLY to the Nexus website. Send the translated mod to me, then I will upload it here and make it so that you are able to upload any future versions of your translated mod onto my mod page just incase I happen to update the original non-translated version, provided that you don\\'t edit anything other than your own translated mod.\r\n\r\n\r\n[b][u]CREDITS:[/u][/b]\r\n\r\nMyself, for coming up with this idea in the first place.\r\n\r\n\r\n[b][u]SPECIAL THANKS:[/u][/b]\r\n\r\nIndigoNeko, for letting me use the source code from their Portable Crafting Kit mod.\r\nBlizzard Entertainment, for the original idea of the Horadric Cube from Diablo II. It\\'s a brilliant game by the way, so do look it up if you haven\\'t already got it!\r\nBethesda Softworks, for creating the magnificent game called Skryim, along with the rest of the Elder Scrolls franchise.\r\n\r\nAnd, last but not least... YOU! For downloading this mod and experiencing it all for yourself! If you like this mod, please be sure to endorse it! ;)\r\n\r\n\r\n[b][u]IMPORTANT!!!:[/u][/b]\r\n\r\nI just want to make myself clear on this one. You cannot modify the Cube of Transmutation directly and reupload without my permission. You can, however, create additional crafting recipes for the mod by using TransmutationCube.esm as a master file, provided that credit was given to me for the original mod. You are also not allowed to reupload this file outside of the Nexus website under any circumstances. If you were to translate this mod or create new crafting recipes, please upload it ONLY on the Nexus. Also, you must ask me for permission to modify this mod or incorporate it into your own mod. The mod also contains assets that were made by at least one other person, so you may want to ask for their permission as well. Thank you.",
  "categoryId": "27",
  "version": "3.0",
  "author": "AndrewOverload519",
  "createdUnix": "1345560866",
  "updatedUnix": "1347902757",
  "containsAdultContent": false,
  "uploadedBy": "AndrewOverload519",
  "primaryFile": null,
  "files": [
    {
      "fileId": "83230",
      "name": "Cube of Transmutation",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Cube of Transmutation-22806-1-0.zip",
      "uploadedUnix": "1345561717",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/debf62c6f2db1e5acd992f6acbacf1d506346d432a3a6da00e23b43a43578854/analysis/1407112383/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cube%20of%20Transmutation-22806-1-0.zip?fid=83230&ttl=1535792608&ri=8192&rs=8192&setec=0d24b7511041115a99887fa4202d9e8a"
    },
    {
      "fileId": "83490",
      "name": "Cube of Transmutation",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "Cube of Transmutation-22806-2-0.zip",
      "uploadedUnix": "1345657550",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/e7993f047963ddc7b66e3618e22a983fc9bd4055cb263c2746a56b9217f5f242/analysis/1407114663/",
      "changelogHtml": " Made it so that all of the Cube of Transmutation\\'s recipes are now hidden in the crafting menu, and that a recipe will only show once the player has the required crafting materials for it, making the menu feel less cluttered and adding a sense of mystery <br/> \n Added some new recipes! For example, you can now create Black Soul Gems by transmuting a Grand Soul Gem and a Daedra Heart. And there\\'s more to discover! <br/> \n Added recipes that were missing in the first version. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cube%20of%20Transmutation-22806-2-0.zip?fid=83490&ttl=1535792608&ri=8192&rs=8192&setec=e2b286d10d75a02cfc282931b707d9e6"
    },
    {
      "fileId": "86433",
      "name": "Cube of Transmutation",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "Cube of Transmutation-22806-2-5.zip",
      "uploadedUnix": "1346783092",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/0bb56d71bbc3c1a16c9c878054bc45a4a84a73fa21e0f26665fdb152817e09e5/analysis/1407145744/",
      "changelogHtml": " The file has now been converted to a master file. This would help encourage the modding community to create additional recipes for the Cube of Transmutation when necessary. <br/> \n Added a new load screen. However, I\\'m not sure if it actually works because I haven\\'t even seen it in-game yet. <br/> \n Added the ability to transmute different ores by using a given number of Iron Ores and a different Flawless Gem for each progressive tier. The highest grades of ore, Gold and Ebony, would require an extra alchemical ingredient. <br/> \n Added the ability to transmute two lower grade arrows into a single higher grade arrow. You can also transmute twenty lower grade arrows into ten higher grade arrows! <br/> \n A couple of additional recipes, including Blood Potions for vampires. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cube%20of%20Transmutation-22806-2-5.zip?fid=86433&ttl=1535792609&ri=8192&rs=8192&setec=00e5fa6b775f69625b4ab45e01523eca"
    },
    {
      "fileId": "88584",
      "name": "Cube of Transmutation - SKYRIM",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Cube of Transmutation - SKYRIM-22806-3-0.zip",
      "uploadedUnix": "1347711191",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/2b485caabe30556e4632fda4e0b115d26b15f8d8d9d56b5ef212ddf8aea18e77/analysis/1407166802/",
      "changelogHtml": " Now comes in two versions, Skyrim and Dawnguard. This would make it so that non-Dawnguard users would be able to use the Cube of Transmutation for the first time! <br/> \n The Ancient Knowledge ability is now required to craft the Cube of Transmutation. There is an optional .ESP available for download which removes this requirement. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cube%20of%20Transmutation%20-%20SKYRIM-22806-3-0.zip?fid=88584&ttl=1535792609&ri=8192&rs=8192&setec=85618ee1cbe8e7b107c9eb6f2f1ab2a7"
    },
    {
      "fileId": "88585",
      "name": "Cube of Transmutation - DAWNGUARD",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Cube of Transmutation - DAWNGUARD-22806-3-0.zip",
      "uploadedUnix": "1347711229",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/3f94b1a048ffd8334f8cb36d293882fbd0d956966a12731c578088f69ad6ece0/analysis/1407166803/",
      "changelogHtml": " Now comes in two versions, Skyrim and Dawnguard. This would make it so that non-Dawnguard users would be able to use the Cube of Transmutation for the first time! <br/> \n The Ancient Knowledge ability is now required to craft the Cube of Transmutation. There is an optional .ESP available for download which removes this requirement. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cube%20of%20Transmutation%20-%20DAWNGUARD-22806-3-0.zip?fid=88585&ttl=1535792610&ri=8192&rs=8192&setec=dce488d2674a781f7a9c002efb3a68cb"
    },
    {
      "fileId": "88586",
      "name": "No Crafting Requirements - SKYRIM",
      "version": "3.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "No Crafting Requirements - SKYRIM-22806-3-0.zip",
      "uploadedUnix": "1347711329",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/0671c1db15d6dc153072ef326b92e8004a4ef4f4858b9bcc6efd072cc034ec7a/analysis/1407166803/",
      "changelogHtml": " Now comes in two versions, Skyrim and Dawnguard. This would make it so that non-Dawnguard users would be able to use the Cube of Transmutation for the first time! <br/> \n The Ancient Knowledge ability is now required to craft the Cube of Transmutation. There is an optional .ESP available for download which removes this requirement. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Crafting%20Requirements%20-%20SKYRIM-22806-3-0.zip?fid=88586&ttl=1535792610&ri=8192&rs=8192&setec=f1f566494fac1932c7f5876023d9e24d"
    },
    {
      "fileId": "88587",
      "name": "No Crafting Requirements - DAWNGUARD",
      "version": "3.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "No Crafting Requirements - DAWNGUARD-22806-3-0.zip",
      "uploadedUnix": "1347711366",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/6ae490cd6d41b8cf718a9684ca7976b2f2ae8ddd8c3f220b5f6b23729ac6fadc/analysis/1407166804/",
      "changelogHtml": " Now comes in two versions, Skyrim and Dawnguard. This would make it so that non-Dawnguard users would be able to use the Cube of Transmutation for the first time! <br/> \n The Ancient Knowledge ability is now required to craft the Cube of Transmutation. There is an optional .ESP available for download which removes this requirement. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Crafting%20Requirements%20-%20DAWNGUARD-22806-3-0.zip?fid=88587&ttl=1535792611&ri=8192&rs=8192&setec=7cde49017f6bc2b200524de7c0e88b65"
    },
    {
      "fileId": "89022",
      "name": "Cube of Transmutation - SKYRIM - RUSSIAN",
      "version": "3.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "64",
      "fileName": "Cube of Transmutation - SKYRIM - RUSSIAN-22806-3-0.zip",
      "uploadedUnix": "1347902701",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/236b5581013f18a4f932398a4b0ae2e61efe5eb69e7dce80875f0eb3890ce78d/analysis/1407171441/",
      "changelogHtml": " Now comes in two versions, Skyrim and Dawnguard. This would make it so that non-Dawnguard users would be able to use the Cube of Transmutation for the first time! <br/> \n The Ancient Knowledge ability is now required to craft the Cube of Transmutation. There is an optional .ESP available for download which removes this requirement. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cube%20of%20Transmutation%20-%20SKYRIM%20-%20RUSSIAN-22806-3-0.zip?fid=89022&ttl=1535792611&ri=8192&rs=8192&setec=ac52cfdcc8c7889a085e106b5b1295db"
    },
    {
      "fileId": "89024",
      "name": "Cube of Transmutation - DAWNGUARD - RUSSIAN",
      "version": "3.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "64",
      "fileName": "Cube of Transmutation - DAWNGUARD - RUSSIAN-22806-3-0.zip",
      "uploadedUnix": "1347902757",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/468bf50ca858ed2e014c0f781c8e39b9b39b26445a245cb10232403987b6bdaf/analysis/1407171442/",
      "changelogHtml": " Now comes in two versions, Skyrim and Dawnguard. This would make it so that non-Dawnguard users would be able to use the Cube of Transmutation for the first time! <br/> \n The Ancient Knowledge ability is now required to craft the Cube of Transmutation. There is an optional .ESP available for download which removes this requirement. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cube%20of%20Transmutation%20-%20DAWNGUARD%20-%20RUSSIAN-22806-3-0.zip?fid=89024&ttl=1535792612&ri=8192&rs=8192&setec=c0feef9946ed53f7c8417937c419a767"
    }
  ]
}