{
  "modId": 22820.0,
  "modName": "Support Gear",
  "summary": "Support Gear is a mod that adds backpacks and enchanted gear with custom textures early in game to help improve gameplay. Haul more stuff out of any place you normally have to leave behind. Make powerful potions with enchanted alchemy gear to improve enchanting and smithing.",
  "descriptionHtml": "Updated the esp file with tes5edit to remove modded items from the containers in qasmoke which caused conflicts with my other mods when used together.\r<br />\r<br />\r<br />\r<br />Support Gear is a mod that adds backpacks and enchanted gear with custom textures early in game to help improve gameplay. Haul more stuff out of any place you normally have to leave behind. Make powerful potions with enchanted alchemy gear to improve enchanting and smithing. I wanted to make a good basic useful mod that people would stack with other mods for a second or more playthrough and to help out new players that want only minimal mod use the first time through the game.\r<br />\r<br />\r<br />\r<br />UPDATED to version 1.3 fixed normal maps not showing on backpacks. Adjusted the buckles so they are only bright shiny when exposed to a light source instead of all the time and made the metal bits shiny with an _m map. Enlarged the textures to 1k resolution from the old 512x512 size. The mage perk friendly cloth backpacks are now in the main file makes it easier to use. Got rid of nif files for the blacksmith gloves and replaced their use with a texture set in CK so body replacer mods that have custom default clothing will be compatible.\r<br />\r<br />There is now CBBE support for the female versions of backpacks, for now I have to use strapless versions but later hopefully the straps can be changed to fit CBBE bodies but they should fit better with any custom female body mods. This file is a separate download and the defaults for females are in the main file.\r<br />\r<br />There is an alternate texture option which has more detail raised from the default textures and blended with some leather textures for the leather backpacks only. By default the main file comes with the new default textures so if you want the alternates just download them and install with NMM or manual installation.\r<br />\r<br />\r<br />\r<br />\r<br />I made this mod with elements from these other mods with permission of course:-)\r<br />\r<br />Leather Backpack mod by tupii and the roadstroker http://skyrim.nexusmods.com/mods/13732\r<br />\r<br />TheRoadstrokers Alvin Hews Annika Outfit Set Stand Alone mod by theroadstroker http://skyrim.nexusmods.com/mods/7818\r<br />\r<br />\r<br />The backpack comes with straps and has three variants. Black backpack, dark brown backpack, and brown backpack. The enchanted versions are 100, 200 and 300 carryweight. All backpacks have an armor rating but it is small, base is 1 but at level 81 and completed the game already it shows armor rating of 4 for me. I did not make the backpacks temperable so the armor rating can&#39;t be exploited:-) I made the backpacks light armor to add one more reason to wear them and hopefully also the npc follower will wear them? Vanilla npc might only equip armored and or enchanted items that are better than what they are wearing by default. Cloth backpacks are not armored and should be mage perk friendly.\r<br />\r<br />\r<br />All backpacks can only be bought they cannot be crafted, non enchanted versions are available right away at the merchant shops where clothes and misc stuff are sold. The enchanted versions can only be bought at certain experience levels so the player doesn&#39;t get overpowered. \r<br />\r<br />\r<br />Black backpack is available at level 1 with 100 carryweight\r<br />\r<br />Dark brown backpack is available at level 5 with 200 carryweight\r<br />\r<br />Brown backpack is available at level 10 with 300 carryweight\r<br />\r<br />\r<br />The black backpack enchanted with 100 carryweight can be found in the warden&#39;s chest at helgen after escaping the dragon attack. The player can now haul more stuff out of helgen and other places early in the game. Making money by selling found items will be easier and more worthwhile. Also less back and forth between player and follower/packmule. It always bothered me that the game didn&#39;t come with a backpack of some kind in the first place&#33; This is such a great idea I don&#39;t know why they didn&#39;t do this except they wanted us to do it just for the fun of it:-) \r<br />\r<br />\r<br />The enchanted blacksmith gloves can be bought at the same shops as the backpack and they are buyable at level 20. The enchantment is 50% better than normal which is impossible to reach in vanilla game without restoration exploits. This saves the player time doing that exploit so they have more time to play the game. There is also a non enchanted version available at level 1 bought in the same shops as backpacks. The blacksmith gloves have a custom texture that looks a lot better than farmgloves.\r<br />\r<br />\r<br />The enchanted alchemist gear can only be bought in shops at level 20 or higher. These include a ring of arcane alchemy which has an enchantment of 100% above normal and a mantle of arcane alchemy (head gear) that actually works just like the falmer helmet or jagged crown so no more need to wear ugly falmer helmet or use mods for jagged crown. The mantle has custom textures and the model is actually a left out game item not used in the final game. Was probably left out because it would clip with big hair styles or long hair styles. The mantle has 100% above normal enchantment too.\r<br />\r<br />\r<br />INSTALLATION\r<br />I never used mod manager and this is my first mod so it will have to be installed manually.\r<br />\r<br />Copy the textures folder from the data folder of this mod into your game data folder.\r<br />Copy the meshes folder from the data folder of this mod into your game data folder.\r<br />Copy the supportgear.esp file into your game data folder.\r<br />\r<br />Make sure supportgear is on the check list of mods to load in the data files option of the game launcher.\r<br />\r<br />If you have other mods that use the same meshes in this mod they will be replaced so check your other mods for compatibility problems first before installing.\r<br />\r<br />\r<br />This mod will conflict with any mod that uses the &#34;47-Unnamed&#34; Biped Object/equip slot. This means that you can only wear one of the conflicting items at a time. When uninstalling this mod, make sure your character doesn&#39;t wear a backpack that increases carrying capacity or any of the other gear when the mod is uninstalled. The stat change will remain for that character when the mod is gone. The backpacks and other gear should be unequipped before uninstalling. This is true for all mods with enchantments.\r<br />\r<br />Thanks to tupii and theroadstroker for their hard work and permissions and fast communication I really appreciate it. This mod would not be possible without them. ",
  "categoryId": "60",
  "version": "v1.3",
  "author": "Dragonslayer2k12",
  "createdUnix": "1345582777",
  "updatedUnix": "1404520265",
  "containsAdultContent": false,
  "uploadedBy": "dragonslayer2k12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000059478",
      "name": "SupportGear",
      "version": "v1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6703",
      "fileName": "SupportGear-22820-v1-3.rar",
      "uploadedUnix": "1380405561",
      "modVersion": "v1.3",
      "virusScanUrl": "https://www.virustotal.com/file/e1480600c4cfe1500b88d41a88647f7d637b58b9b53a611e298fb7893da7415b/analysis/1407738249/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SupportGear-22820-v1-3.rar?fid=1000059478&ttl=1535792631&ri=8192&rs=8192&setec=7e9fe4005f7fd5f8529637ef992d1af4"
    },
    {
      "fileId": "1000059479",
      "name": "CBBEsupport",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "551",
      "fileName": "CBBEsupport-22820-v1-0.rar",
      "uploadedUnix": "1380405649",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c965728ab658a1a5f0fd2b98aef8ee524da83adafa53e778a8dd49e0b32fa2ce/analysis/1407738250/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CBBEsupport-22820-v1-0.rar?fid=1000059479&ttl=1535792632&ri=8192&rs=8192&setec=78e90194b24959875e771c850ea672a6"
    },
    {
      "fileId": "1000059480",
      "name": "AlternateTextures",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1857",
      "fileName": "AlternateTextures-22820-v1-0.rar",
      "uploadedUnix": "1380405748",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9057bf3746df91e6932580c2675ff059f2e7f5a5ba31335303047d2b1ff3c527/analysis/1407738255/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AlternateTextures-22820-v1-0.rar?fid=1000059480&ttl=1535792633&ri=8192&rs=8192&setec=b7ae104c922a3697ebccd1003839b6d4"
    },
    {
      "fileId": "1000115938",
      "name": "supportgearesp",
      "version": "v1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "supportgearesp-22820-v1-3.rar",
      "uploadedUnix": "1404520265",
      "modVersion": "v1.3",
      "virusScanUrl": "https://www.virustotal.com/file/d3eb43ea398109c92a84aeca68eec1620e88e29ceafc3ff6a89beb7ebe58b985/analysis/1408161070/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/supportgearesp-22820-v1-3.rar?fid=1000115938&ttl=1535792633&ri=8192&rs=8192&setec=1e72e402d12517bce5c1b3e8584109f0"
    }
  ]
}