{
  "modId": 22838.0,
  "modName": "The City of Kalkraden WIP",
  "summary": "A (WIP) mod that adds a whole island with a city on it with a questline, new guilds and NPC\\'s",
  "descriptionHtml": "This mod is currently a work in progress.\r\n45 Years ago, somewhere in the middle of the Elthenic Ocean a group of four Scholar\\'s set off the find a new land to call home, they left Tamerial with the fear of war. After 2 and a half years of searching they found an old Dwarvern City, they searched it with a group of soldiers and found nothing, they didn\\'t find any one or anything at all.\r\n\r\nAfter talking and long planning they decided to turn this abandoned island into a city, some where away from the Imperials or Dominion. It has taken them decades of work but they finally opened the doors 25 years later to allow people who want to leave a dying world behind and enter a new one, full of hope and no crime.\r\nThough the scholars argued with each other, who should be in charge of the city until they came to an understanding, instead of one leader they will have four. They called themselves the Overseers. \r\n\r\nImediatly people left Tamerial for this new world, some without hesitation. They were selling the land and houses cheap so they could grow their population bigger just incase the Dominion or Imperials wanted to take over they would atleast have the chance to fight back.\r\nBut neither of them ever came, most likely because of the lack of strategic value of the island.\r\nOne of the Overseers discovered that some of the machineray was still slightely intact and could be brought back to its full potential. They gave out books about dwemer technology to every parent of a child, they told them to make them read it, study it and learn as much as possible. They needed a new generation of people who understand and could reconstruct old dwemer technology. If they do this, Kalkraden will become a super power and will be able to defend their city from any threats.\r\n\r\nWith this mod I plan to add a large city, with multiple levels (Surface, undercity, etc.) that will have characters living there. There will be a quest line and at the end a chance to become one of the overseers of the island. \r\n\r\nThe Market District and Docks are nearly finished, You can get to the docks now by going to Port Oldman\r\n\r\nQuests will include helping repair the city, building defences and rising power with in the city to become one of the overseers.\r\n\r\nSteam version:\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=86824246",
  "categoryId": "53",
  "version": "0.1",
  "author": "Catpancakes",
  "createdUnix": "1345604275",
  "updatedUnix": "1349013382",
  "containsAdultContent": false,
  "uploadedBy": "Catpancakes",
  "primaryFile": null,
  "files": [
    {
      "fileId": "91273",
      "name": "Kalkraden",
      "version": "0.27",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "295",
      "fileName": "Kalkraden-22838-0-27.rar",
      "uploadedUnix": "1349013382",
      "modVersion": "0.27",
      "virusScanUrl": "https://www.virustotal.com/file/0caff5f07b9a4a908fbb4ce97fc90e2580307b29dabae0a650d4bc179cf647a4/analysis/1407195801/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kalkraden-22838-0-27.rar?fid=91273&ttl=1535792666&ri=8192&rs=8192&setec=3df7ec666b7b0a0c4f483c8803276e4f"
    }
  ]
}