{
  "modId": 22853.0,
  "modName": "Adventurer Wisdom",
  "summary": "Makes your character gain some additional bonuses to health, magicka and stamina when leveling up. Those bonuses are based upon your level and your attribute history: the more you invest on an attribute, the more it grows.",
  "descriptionHtml": "[heading] Installation [/heading]\r\nSimply unzip the archive and copy the .esp file in your Skyrim\\\\Data directory. Don\\'t forget to activate this mod, either using Nexus Mod Manager or by checking it in the Files section accessible from the Skyrim splash screen.\r\n\r\n[heading] Disclaimer [/heading]\r\nThis mod uses scripting to add benefits to the player as the player levels up, based on level, attribute points spent on health/magicka/stamina, and a minor random factor. The mod does not change skills or perks in any way, and is therefore assumed to be compatible with anything that changes perk trees or skills.\r\n\r\n[heading] How to use it [/heading]\r\nThe leveling system is based on a single ability, called \\\"Veteran Of Skyrim\\\", which applies the Adventurer\\'s Wisdom effect to you, costantly. Within 60 seconds from your leveling up, you will receive a notification in the upper left corner of the screen that states \\\"You learnt something new during your travels!\\\". Following this messages, your three main attributes (health, magicka and stamina) will be permanently updated with some new bonuses. Those increments are based on your level, on your attribute choices and on a minor random factor. Basically, the higher your level, the higher the bonus and the more you invest in an attribute, the more it grows.\r\nHowever, there is another major element to consider: this mod may be applied when your character has already leveled up a lot. In order to compensate for the lack of bonuses in the previous levels (when you didn\\'t use this mod), I introduced a power called \\\"Recover Memories\\\". This power let you recollect those bonuses you couldn\\'t get in your previous levels. It isn\\'t 100% accurate because it cannot deduce how and when you did spend your 10 standard attribute points granted each levelup. So the actual bonuses you receive underestimate by a little amount what you could actually accomplish by using this mod from level 1. However, due to the minor random factor applied by the script, this may be overlooked. This power is usable only once and gets you unable to act for 10 seconds.\r\n[color=yellow](0.1.1) Now the script updates the base value of your attributes instead of granting a permanent bonus. This is a bugfix, since it was originally inteded to work in this way.[/color]\r\n\r\n[heading] How to learn the spells [/heading]\r\nThe two \\\"spells\\\" of this mod are found in the Belethor\\'s shop in Whiterun. They are sealed within two tomes on the shop bench. Due to physics calculation, a book may fall off and lay on the ground just ahead of Belethor. You can just pick them up: it won\\'t be considered a crime.\r\n\r\n[heading] How to unlearn the spells [/heading]\r\nYou automatically unlearn the power Recover Memories on first usage. [color=yellow]You can also forget the abilty Veteran Of Skyrim by using the \\\"Potion of Lost Experience\\\" found near the books in Belethor\\'s shop in Whiterun. The potion was introduced in version 0.1.1.[/color]\r\n\r\n[heading] How it works [/heading]\r\nThe formula used in this mod is the following:\r\n[i]Bonus = Level * LC * [color=yellow]ALC[/color] + (BAV / 100) ^ (HC - [color=yellow]AHC[/color]) + Random(0, 5) * 2 ^ [color=yellow]ARC[/color][/i]\r\n[color=yellow]As of 0.1.2, the formula has additional coefficients that depend on the attribute being updated. Before the actual calculation, the script sorts attributes from that with the minimum base value to that with the maximum base value. The first will receive a much lower bonus than the last.[/color]\r\nWhere:\r\n[list]\r\n[*] Level is the previous character level. For example, if you level up to level 2, this variable is 1;\r\n[*] LC is the level coefficient. Currently, it is 0.5\r\n[color=yellow][*] (0.1.2) ALC is the attribute level coefficient. It is 1/3 for the attribute with the minimum base value, 2/3 for the average attribute and 1 for the attribute with the current maximum base value;[/color]\r\n[*] BAV is the base actor value for the considered attribute, i.e. the attribute value without considering bonuses from equipment, abilities and magic effects\r\n[*] HC is the history coefficient. Currently, it is 1.3\r\n[color=yellow][*] (0.1.2) AHC is the attribute history coefficient. It is 0.3, 0.2 or 0.1[/color] \r\n[color=yellow][*] (0.1.1) The random factor is now 5, down from 10[/color]\r\n[color=yellow][*] (0.1.2) ARC is the attribute random coefficient. It is -1, 0 or 1[/color]\r\n[/list]\r\nDue to the last random factor, the actual peak attributes you can reach diverge quickly enough.\r\nYou may notice the it is quite linear until level 30~35, then it starts growing more quickly.\r\n\r\n[heading] Changelog for version 0.1.2 [/heading]\r\n[list]\r\n[*] The formula has been changed. Now it varies depending on the attribute being updated. Your preferred attribute will grow as in the previous version, while your two lower attributes will increase more slowly.\r\n[*] In addition, the mod now also work if you gain more than 1 level in less than 60 seconds (cheater friendly XD)\r\n[/list]\r\n\r\n[heading] Changelog for version 0.1.1 [/heading]\r\n[list]\r\n[*] Now the mod affects the attributes base value instead of granting a permanent bonus (the attribute numbers appear in white instead of green)\r\n[*] It is possible to unlearn the ability Veteran Of Skyrim by using the Potion of Lost Experience\r\n[/list]",
  "categoryId": "73",
  "version": "0.1.2",
  "author": "Totem",
  "createdUnix": "1345637030",
  "updatedUnix": "1345799243",
  "containsAdultContent": false,
  "uploadedBy": "Il Totem",
  "primaryFile": null,
  "files": [
    {
      "fileId": "83493",
      "name": "AdventurerWisdom-0-1",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "AdventurerWisdom-0-1-22853-0-1.zip",
      "uploadedUnix": "1345658826",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/ddc5fb7521f3370ce8ef5e66003fba28889656ce6288cfff75af7f9d5f05583f/analysis/1407114664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AdventurerWisdom-0-1-22853-0-1.zip?fid=83493&ttl=1535792694&ri=8192&rs=8192&setec=eb0952a16982c8ece325833db2307161"
    },
    {
      "fileId": "83634",
      "name": "AdventurerWisdom-0-1-1",
      "version": "0.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "AdventurerWisdom-0-1-1-22853-0-1-1.zip",
      "uploadedUnix": "1345710172",
      "modVersion": "0.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/481708d04a4b0e207a61b1b5705110ea15b2fbc2e3b2c82bf1be12821e209d60/analysis/1407116227/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AdventurerWisdom-0-1-1-22853-0-1-1.zip?fid=83634&ttl=1535792694&ri=8192&rs=8192&setec=84aae537a600c0a4602d3b368d4e98b1"
    },
    {
      "fileId": "83859",
      "name": "AdventurerWisdom-0-1-2",
      "version": "0.1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "AdventurerWisdom-0-1-2-22853-0-1-2.zip",
      "uploadedUnix": "1345799243",
      "modVersion": "0.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/bc815882a0d9931d8a19762e80d6585ce8044a038a5d3c95bb67e5cababb2144/analysis/1407118083/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AdventurerWisdom-0-1-2-22853-0-1-2.zip?fid=83859&ttl=1535792695&ri=8192&rs=8192&setec=14ccae2ee956e1d1a90f53c3bb416208"
    }
  ]
}