{
  "modId": 22870.0,
  "modName": "LC_Elite Archer Armor",
  "summary": "I developed this armor for a future update for my mod \"Become King of Riverhelm\" This is a set of elite archer armor that comes in both a light and heavy version. It also adds a new type of arrow. This armor can be worn by both sexes but is intended for males.",
  "descriptionHtml": "[img]http://img685.imageshack.us/img685/1149/abretura.jpg[/img]\n<br />\n<br />\n<br />\n<br />[url=http://www.facebook.com/plugins/likebox.php?href=https%3A%2F%2Fwww.facebook.com%2Fpages%2FBecome-King-of-Riverhelm-and-Locaster-mods%2F123193281131815&amp;width=700&amp;height=800&amp;colorscheme=light&amp;show_faces=true&amp;header=true&amp;stream=false&amp;show_border=true][img]http://imageshack.com/a/img560/1033/tj6n.png[/img][/url]\n<br />\n<br />\n<br />  [youtube]MbbRPMBu7jI[/youtube]\n<br />\n<br />\n<br />[size=5]LC_Elite Archer Armor[/size]\n<br />\n<br />I developed this armor for a future update for my mod \"Become King of Riverhelm\" This is a set of elite archer armor that comes in both a light and heavy version. It also adds a new type of arrow. This armor can be worn by both sexes but is intended for males.\n<br />\n<br />What this mod adds:\n<br />\n<br />Elite Archer Hood\n<br />Elite Archer Armor\n<br />Elite Archer Boots\n<br />Elite Archer Gauntlets\n<br />Elite Archer Arrows\n<br />\n<br />The Light version is equal to Glass Armor\n<br />The Heavy version is equal to Ebony Armor\n<br />The arrows are equal to Glass Arrows\n<br />\n<br />Both armor versions can be crafted in a forge under steel and the arrows in the misc option.\n<br />\n<br />\n<br />\n<br />[b][size=4]\n<br />\n<br />If you want to like my page in facebook and join me :)\n<br />[/size][/b]\n<br />\n<br />[url=https://www.facebook.com/Become-King-of-Riverhelm-and-Locaster-mods-123193281131815/][img]https://staticdelivery.nexusmods.com/mods/110/images/20614-0-1509676613.jpg[/img][/url]\n<br />\n<br />[b][size=3]\n<br />Start new Patreon![/size][/b]\n<br />\n<br />[url=https://www.patreon.com/locaster][img]https://staticdelivery.nexusmods.com/mods/110/images/20614-1-1509676613.jpg[/img]\n<br />\n<br />[size=3][b][color=#efefef]\n<br />\n<br />[/color][/b][/size][/url]\n<br />[size=3][b][color=#efefef]If you would like to thank me for this mod, please read below. Otherwise, you can skip\n<br />the text, which is not related to the mod itself. (See spoiler)[/color][/b][/size]\n<br />[size=2]\n<br />\n<br />[b][color=#efefef][spoiler] [/color][/b][color=#efefef]Greetings to all my dear friends and followers! Thank you for reading this text.\n<br />If at least one of you get what I’ll be saying here and put in practice what I’m writing\n<br />about, or, if my words help you somehow, all the effort I dedicated to the creation and\n<br />development of this mod, as well as so many others, will be made worth it.\n<br />\n<br />Have you ever thought about what you have been doing to make the world a better\n<br />place? It is a hard task, isn’t it? Specially when we find ourselves immersed in personal\n<br />issues, essential/existential problems, heavy work routines, and the list goes on... I\n<br />understand it–better than you can imagine.\n<br />\n<br />Yet, one day I decided to suspend the exterior queries and get some time to look inside\n<br />myself. “To look inside oneself?”, you might ask. It can sound weird at a first, as it was\n<br />for me in the beginning of this intimate and profound journey—a search for something\n<br />superior. I started reconsidering my behavior, analyzing my right attitudes and mistakes\n<br />from the past. From then on, I began working on each one of my faults and weaknesses\n<br />by looking at myself as if I were an spectator, observing me in the third person. With\n<br />each of my faults mapped, I started observing what was leading me to commit each\n<br />error. This task takes time, the results don’t come overnight, but it will transform you\n<br />substantially, if you allow it to happen.\n<br />\n<br />I eliminated most of my anger, hate, greed, envy, and vanity, among other\n<br />imperfections. I still have a lot to learn and I hope to die learning. Hence, I try to be a\n<br />little better every single day. Scientific studies have shown that negative emotions cause\n<br />diseases such as cancer, and they have a huge negative social impact. I’m not better nor\n<br />worse than anybody else; all of us have these and other imperfections to smaller or\n<br />greater degree.\n<br />\n<br />These negative emotions are the reason why so many people are starving in the world,\n<br />or pay huge amounts of money for medicine that are in fact, cheap to produce—in such\n<br />a way that few can make fortunes. And those who need it most don’t have access to\n<br />basic necessities—while corrupt politicians steal taxpayer's money with their insatiable\n<br />and deranged greed.\n<br />\n<br />This is only a small part of the troubles caused by these character flaws, which are truly\n<br />a worldwide disease. Yet, you all know about the problems of the world. What many\n<br />people don’t know it is how to start solving these problems, how to improve the quality\n<br />of life in the world. Along the years, I listed some of my conclusions and inspirations. A\n<br />good point of departure is to start following these steps:\n<br />\n<br />1– What you do not want done to yourself, do not do onto others.\n<br />\n<br />2– At a certain point in your life you will harvest the seeds of the good and the bad you\n<br />have done. It can take many years, but one day what you have done will get back to you\n<br />(so, do good deeds, “greasy soul”! lol)\n<br />\n<br />3– Try to take something good out of the bad things that happen to you. There are\n<br />lessons to be learned.\n<br />\n<br />4– Before criticizing others, try to put yourself on their shoes and ask yourself if you\n<br />wouldn't do the same, or how would you act better under the same circumstances. Know\n<br />yourself very well before judging the others.\n<br />\n<br />5– Try to always show a positive attitude. This attracts good things (yeah, it is hard, I\n<br />get it—specially with a half dozen trolls salivating on your neck, but be faithful and you\n<br />will succeed).\n<br />\n<br />6– Don’t take things for granted. Be grateful for the good things you receive, and for the\n<br />ones you already have, by forgetting for a moment what you don’t have.\n<br />Very well then. Look at the #1: “What you do not want done to yourself, do not do to\n<br />others”– How much better the world would be if everybody followed only this thought?\n<br />Much, much better... wouldn’t it?\n<br />Folks, think about it. How can we make the world a better place if, so often, we\n<br />ourselves are sick?\n<br />\n<br />It is simple: start by improving yourself. Practice the list above. I put it in practice and I\n<br />improved a lot—personally and toward the ones around me. That is the reason why I’m\n<br />sharing it with you. Acquire knowledge by studying many books, religions, and\n<br />philosophies. Have an open mind, absorb the best of each lesson, and build your own\n<br />truth. Eventually, you will see the world and the circumstances more clearly.\n<br />Look inside yourself. It all starts with this. Question yourself, and, if feasible, follow the\n<br />six steps above. I can assure you the world would be a much better place if people\n<br />followed it. You might not be perfect, but you can be a little better at each day. It is up\n<br />to you.\n<br />\n<br />Well, that’s it. I may not be the Lord of Universal Truth, but I’m talking to you with an\n<br />open heart, sharing my two cents. I hope no one will take a wooden baton and beat my\n<br />head with it thinking I’m crazy... Or, perhaps it is the world that is?\n<br />Open your eyes and your consciousness. Thank you for reading this far. I wish the best\n<br />for each of you. The power of change is in the hands of each one of us. Don’t wait for\n<br />the change to happen—be the change!\n<br />Peace and light to everyone.\n<br />\n<br />Sincerely,\n<br />Locaster[/color][b][color=#efefef] \n<br />\n<br />[/spoiler][/color][/b][/size]\n<br />[url=http://skyrim.nexusmods.com/mods/32614][img]http://img837.imageshack.us/img837/6436/9gkx.jpg[/img][/url]\n<br />\n<br />\n<br />[size=5]Credits[/size]\n<br />\n<br />\n<br />Special thanks for JackoO for permit I use your model\n<br />\n<br />JackoOs Armory Knightly por JackoO\n<br />\n<br />http://skyrim.nexusmods.com/mods/20618\n<br />\n<br />\n<br />ShadowTek for test armor.",
  "categoryId": "54",
  "version": "1.1",
  "author": "Locaster",
  "createdUnix": "1345652663",
  "updatedUnix": "1345680464",
  "containsAdultContent": false,
  "uploadedBy": "Locaster",
  "primaryFile": null,
  "files": [
    {
      "fileId": "83467",
      "name": "LC_Elite Archer Armor",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18868",
      "fileName": "LC_Elite Archer Armor-22870-1-0.rar",
      "uploadedUnix": "1345655184",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cbbe32e74a9865cc89b7da4e27d39c0acee142abe38575f09260381984038007/analysis/1407114553/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LC_Elite%20Archer%20Armor-22870-1-0.rar?fid=83467&ttl=1535792715&ri=8192&rs=8192&setec=9decb9ac515d3758f50f7738f829ffd0"
    },
    {
      "fileId": "83567",
      "name": "LC_Elite Archer Armor_1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18870",
      "fileName": "LC_Elite Archer Armor_1_1-22870-1-1.rar",
      "uploadedUnix": "1345680464",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4c98b85203a118e2592a2f12d2eed238ea2fc55220991de151af2553fd886c23/analysis/1407115447/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LC_Elite%20Archer%20Armor_1_1-22870-1-1.rar?fid=83567&ttl=1535792716&ri=8192&rs=8192&setec=4e4f744d9ec859676784a1dd0e99a45c"
    }
  ]
}