{
  "modId": 22899.0,
  "modName": "Dark Souls - Elite Knight",
  "summary": "Elite Knight armor from Dark Souls",
  "descriptionHtml": "I know a lot of people were looking forward to this so here you go. Some bits of it are a little rough but I just wanted to finally release it. Will be fixing the texture issues and adding more content within the coming few days. Then I shall move on to other sets from the game and try some of the sets from Demons Souls. Feedback is always appreciated. And like I said, its still a bit rough, beast races and a female version are on the way. Also since many people are asking for it, I\\'ll do a \\'faceless\\' helmet as well.\r\n\r\nCheck pics for location\r\n\r\nMassive thanks to Haishao, Izzy and Guardly for helping me out.\r\n\r\n*Update* You\\'ll have to forgive the lack of updates thus far. Between Dark Souls, and finding a chopper in DayZ, I\\'ve been quite occupied... However I have every intention of continuing on with this. Being my first mod, I\\'ve had to learn all of this by scratch so if anyone has any suggestions on how to streamline workflow, please let me know. I would very much like to speed up the process of all this. Also, I\\'m not sure if its possible or not but I would like to modify the helmet of a script of sorts to load the closed visor when in combat, and the open visor when out of combat. However, that may be beyond my abilities at the present moment.\r\n\r\n*Update 2* I realize that its taken much longer than I had originally anticipated, but as of right now I am more concerned with finding a job rather than on modding. I have every intention of revisiting this as soon as possible, but for the present moment in time there probably wont be any updates. That being said, as soon as I do get back to this I can imagine I\\'ll be coming back in full force with many updates.",
  "categoryId": "54",
  "version": "0.9",
  "author": "Azraille",
  "createdUnix": "1345714802",
  "updatedUnix": "1345715264",
  "containsAdultContent": false,
  "uploadedBy": "Azraille",
  "primaryFile": null,
  "files": [
    {
      "fileId": "83645",
      "name": "DS assets",
      "version": ".9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16782",
      "fileName": "DS assets-22899--9.rar",
      "uploadedUnix": "1345715264",
      "modVersion": ".9",
      "virusScanUrl": "https://www.virustotal.com/file/04e1bab7272291c57a07f42160f85dadf5b72ea306548080527b7b5918f9c57c/analysis/1407116291/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DS%20assets-22899--9.rar?fid=83645&ttl=1535792773&ri=8192&rs=8192&setec=d581117f616d0652b583e40fde3ed508"
    }
  ]
}