{
  "modId": 22928.0,
  "modName": "Fort Moonstone",
  "summary": "An old border fort, once guarding the pass for Cyrodiil, who took its name by the large Moonstone veins naturally surfacing in the countryside. Follower friendly.",
  "descriptionHtml": "Fort Moonstone is a rather large fort built on a mountain pass southeast of Falkreath, near the southern border of Skyrim. It was grand and well garrisoned, however it has been abandoned since the Great War, when it suffered some minor damage.\r<br />\r<br />The Fort is still under nominal possession of Falkreath Hold, but it is now empty and forgotten. However, it was of solid build, and with adequate materials and funding it can be restored to its former glory.\r<br />\r<br />The Thane of Falkreath is not exactly interested in what happens to that pile of rocks, as long it is not bandits he will surely allow any kind of respectable people to take control of it... for a small fee of course.\r<br />\r<br />Find the Fort, buy it, clean it from the rubble and any critter that may have found its home, and build yourself the largest and most comfortable mansion south of Falkreath.\r<br />\r<br />[b]The Fort is now follower friendly. You can purchase the Moonstone Manor addon to safely house your followers, spouses or children.[/b]\r<br />\r<br />[size=16]Features[/size]\r<br />- A large four stories main keep completely customizable\r<br />- A vast storage room with more than 40 named containers to store your loot\r<br />- [b]Sorting script[/b] easily accessible from a container near the entrance\r<br />- Potion racks with room for more than 500 potions\r<br />- Bookshelves for books, scrolls, tomes, notes, journals and diaries, all named\r<br />- Comfortable bed\r<br />- Crafting area in the courtyard\r<br />- Plenty of mannequins and weapon plaques to display your weaponry\r<br />- A kitchen with named containers for food\r<br />- A laboratory with named containers for soul gems and ingredients\r<br />- A library with named containers for jewels and magic jewels\r<br />- Customization includes lights, floors, doors, rooms, mannequins, plaques\r<br />- Small initial quest (I suck at creating quests so it is very simple)\r<br />- Handy reference book and planning room just outside the main keep\r<br />- New full interiors set (Openspace)\r<br />- Dragon priest mask holders (Openspace only)\r<br />- A personal moonstone mine\r<br />- Family manor, spouse children and follower friendly\r<br />- Upgradable defenses\r<br />- Barracks. Large and fully navmeshed. With kitchen, canteen and beds for 25 soldiers and garrison captain. People not included.\r<br />- Lookout tower. Unparalleled view over all of Skyrim (and part of Cyrodiil too).\r<br />\r<br />[size=16]Incoming feature[/size]\r<br />- Underground hot springs\r<br />\r<br />[size=16]How to install[/size]\r<br />Use NMM or unpack the Data folder over your own.\r<br />If you already have an older version installed, remove it and do a clean save.\r<br />\r<br />[size=16]Instructions[/size]\r<br />You can find the Fort southeast of Helgen along the main road leading to the southern border. To start the quest activate the map in the small wood cabin left of the main tower. This is also your master plan. The book is on the table.\r<br />\r<br />To use the sorter:\r<br />1. Place any item you want to be sorted in the box right in front of the entrance in the main keep\r<br />2. Activate the small note and follow instructions.\r<br />\r<br />To actually have you items sorted you need to purchase the following items:\r<br />- For ingredients and soul gems: the laboratory\r<br />- For food: the kitchen\r<br />- For gems and jewelry: the library\r<br />- For everything else (except books and scrolls): the storage room\r<br />OR\r<br />- A full set\r<br />\r<br />NOTE: as for now, books and scrolls are sorted only by the Openspace set, because the library rooms have no book storage (only the shelves). This will be fixed in a future version.\r<br />\r<br />If you do not have the proper room the corrisponding items will not be sorted and will stay into the sorting box (you wont lose them).\r<br />\r<br />When you choose to take back your stuff (may be needed for future upgrades) you will get any item that has been stored in the storage room, raw food containers, soul gems, jewelry, ingredients and crafting area. You [b]wont get back[/b] any item stored in the racks, cooked food container, raw ore, mannequins and plaques. This will be fixed in a future update.\r<br />\r<br />When you start sorting the sorting chest will lock itself and you will not be able to access it. This is normal and intended to avoid tampering with the script while it is running. The chest will unlock as soon as all items have been sorted. Please do not use console cheats to open it or you will screw the whole script.\r<br />\r<br />[b]Important note[/b]: any item that passes through the sorting system will [b]lose any custom incantation or sharpening[/b]. Do not sort custom items.\r<br />\r<br />The sorting script will now catch almost everything. It will also sort mod added items, provided that they have a type or kyewords set.\r<br />\r<br />The library and potion storage have been inverted in Openspace roomset: you should stock your books on the third floor shelves and your potions on the fourth floor\r<br />\r<br />When you buy the parapets upgrade, they will appear only on sections that are already built. However as soon as you build other sections that can be parapet enabled, the parapets will appear on them without additional fees or input.\r<br />\r<br />[size=16]Dependencies and conflicts[/size]\r<br />- [url=http://skyrim.nexusmods.com/mods/10891]Unlimited Bookshelves[/url] for all the racks\r<br />\r<br />A conflict with [url=http://skyrim.nexusmods.com/mods/38118/]Become a Skill Trainer[/url] has been reported, where said mod apparently removed all dialogue entries relative to FM initial quest.\r<br />\r<br />Unlimited Bookshelves is a bit pricky about load order. You must place it after any mod that alters existing items that you want on the shelves, otherwise it behaves oddly. The best is probably to place it last in your load order.\r<br />More, a bug has been found on it regarding scrolls and maybe ingots. Looks like if the stocked base item has been changed from the one defined by UB itself the script removes the excess items from the shelf container, but leaves them to be picked by hand. However, if you interact with the shelf container, it readjusts the pickable items, so you will lose any excess item. Only workaround I know is to pick by hand any scroll from the racks before opening the rack itself. Looks like the bug wont affect potions or books, as it involves dimensions and collisions that are a bit strange on scrolls.\r<br />\r<br />[size=16]Planned updates[/size]\r<br />- Better sorting (gems, clutter, keys, some of the most common strange items)\r<br />- A stable\r<br />- People\r<br />- Prison\r<br />- Cult place\r<br />- Strongroom\r<br />\r<br />[size=16]Notes and limitations[/size]\r<br />- Notes racks are somewhat difficult to activate. I will fix the position of the activators soon.",
  "categoryId": "67",
  "version": "1.70",
  "author": "Glorfindel",
  "createdUnix": "1345752886",
  "updatedUnix": "1412544698",
  "containsAdultContent": false,
  "uploadedBy": "GlorfindelCotton",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000114246",
      "name": "FortMoonstone v1.56",
      "version": "1.56",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "274",
      "fileName": "FortMoonstone v1.56-22928-1-56.7z",
      "uploadedUnix": "1403535715",
      "modVersion": "1.56",
      "virusScanUrl": "https://www.virustotal.com/file/911a9a1f79052a31164aaede6a9544e1400d808732b987ee390d0674a7aa6fde/analysis/1408139653/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FortMoonstone%20v1.56-22928-1-56.7z?fid=1000114246&ttl=1535792814&ri=8192&rs=8192&setec=c346fa83b400fc860a8191be6c0cd352"
    },
    {
      "fileId": "1000114407",
      "name": "FortMoonstone v1.57",
      "version": "1.57",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "275",
      "fileName": "FortMoonstone v1.57-22928-1-57.7z",
      "uploadedUnix": "1403624058",
      "modVersion": "1.57",
      "virusScanUrl": "https://www.virustotal.com/file/a1a6848b5abbc15271b3c13ddb57d328bb418a98b295a5e58692be1720cc2ae3/analysis/1408140915/",
      "changelogHtml": " Fixed keep main door <br/> \n Fixed Dwemer gembox <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FortMoonstone%20v1.57-22928-1-57.7z?fid=1000114407&ttl=1535792814&ri=8192&rs=8192&setec=ebcbf2d87498b5e54daa2073e2c3b450"
    },
    {
      "fileId": "1000115095",
      "name": "FortMoonstone v1.61",
      "version": "1.61",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "285",
      "fileName": "FortMoonstone v1.61-22928-1-61.7z",
      "uploadedUnix": "1404032365",
      "modVersion": "1.61",
      "virusScanUrl": "https://www.virustotal.com/file/c4e0032a813babedf781a76a186e7f553ed4532ff2ec98c286021ba86a45416d/analysis/1408152794/",
      "changelogHtml": " Added barracks entry to masterplan. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FortMoonstone%20v1.61-22928-1-61.7z?fid=1000115095&ttl=1535792815&ri=8192&rs=8192&setec=d3e99db14d515eaeae23436a4ecb3c03"
    },
    {
      "fileId": "1000129787",
      "name": "FortMoonstone v1.70",
      "version": "1.70",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "287",
      "fileName": "FortMoonstone v1.70-22928-1-70.7z",
      "uploadedUnix": "1412544698",
      "modVersion": "1.70",
      "virusScanUrl": "https://www.virustotal.com/file/51faf29596efa75499ef9d43fcda54cde029c0850b502abf1a384823ad3a3964/analysis/1412544782/",
      "changelogHtml": " Added lookout tower <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FortMoonstone%20v1.70-22928-1-70.7z?fid=1000129787&ttl=1535792815&ri=8192&rs=8192&setec=02d6b470fface18bad544101cfa84d0b"
    }
  ]
}