{
  "modId": 22941.0,
  "modName": "Xen - The Blood Merchant - Requires Dawnguard - Hearthfire Compatible",
  "summary": "A vampire whom sells Potions of Blood, with a short voiced quest, and can become a companion.",
  "descriptionHtml": "[REQUIRES DAWNGUARD]\r<br />\r<br />Hey, if anyone is wondering why it&#39;s called &#34;Hearthfire Compatible&#34;; it&#39;s because back when I released this Hearthfire wasn&#39;t even out yet and was just something people were talking about, but a number of mod authors started releasing mods with &#34;Hearthfire Compatible&#34; in the title name, so I figured: &#34;Why the heck not.&#34; and tossed it in.  lol; it is true enough.\r<br />\r<br />Update 1.0:\r<br />Added his quest, made him able to become a companion, and changed his race.\r<br />\r<br />This mod adds an alchemist whom sells Potion of Blood to Whiterun&#39;s Hall of The Dead.  He also offers a short quest into Blackreach to retrieve his magical alchemy apparatus, and can join you in your adventures afterwards.  He will still sell Potions of Blood to you and buy basic items, no matter where you are.\r<br />\r<br />His companion combat style should be similar to Serana, he&#39;s by default set as essential, and he&#39;s got pretty balanced health/mana/stamina.\r<br />\r<br />I recommend using Extensible Follower Framework. http://skyrim.nexusmods.com/mods/12933\r<br />\r<br />Planned Future Updates:\r<br />Quest Marker, better voicing, better store design. (an actual store), more unique potions.\r<br />\r<br />Future Update Ideas:\r<br />Better voices, unique voiceset, future quests (example, perhaps giving quests at random times depending on where you just so happen to be, like at Riften and he remembers he had to do something there), perhaps more magic, High Elf Race again, better initial quest.\r<br />\r<br />For people wondering: &#34;Tentain, are you doing more to this mod?&#34;, the answer is yes.  I learned Level design over the past few days and will make him his own little home, and after that I will make a custom dungeon just for his quest. ^^   But right now I&#39;m working on my Riften Exposed mod.\r<br />\r<br />Also if you&#39;re wondering why I said &#34;hearthfire compatable&#34;, I&#39;m just annoyed at some other mod with a &#34;hearthfire ready&#34; in it&#39;s title, since Hearthfire is NOT even released yet. Regardless, should work just fine with it obviously and If not I will make it compatible with it.",
  "categoryId": "65",
  "version": "1.1",
  "author": "Tentain Shade",
  "createdUnix": "1345770042",
  "updatedUnix": "1347247539",
  "containsAdultContent": false,
  "uploadedBy": "Tentain",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87584",
      "name": "Xen - The Blood Merchant",
      "version": "1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3662",
      "fileName": "Xen - The Blood Merchant-22941-1-3.rar",
      "uploadedUnix": "1347247539",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/a1fe3c2077c2250ff1711f886a6321708a62a229188828534097bae51bb84234/analysis/1407157452/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Xen%20-%20The%20Blood%20Merchant-22941-1-3.rar?fid=87584&ttl=1535792839&ri=8192&rs=8192&setec=5234b54246615b878a78338f04b36766"
    }
  ]
}