{
  "modId": 22976.0,
  "modName": "The Cave - A Simple Life GERMAN",
  "summary": "Viel mehr als ein House mod. Bau alles von Anfang an auf. Geleitet von deinem Tagebuch welches du selbst schreibst. Errichte eine idyllische Existenz. Diese Mod ist ein Muss für Rollenspieler , Leute die etwas schaffen wollen und keinen Riesenpalast vor die Füsse geknallt haben möchten. Baue deine Farm und lebe darin :)",
  "descriptionHtml": "The Cave - A Simple Life \r\n\r\nBald auch auf englisch, dank der Hilfe von Alistair77. \r\n\r\nAlso...die Reise beginnt nachdem man die Moosmutterhöhle (NW von Falkreath) gesäubert hat. Ist eine kleine Quest mit einem Jäger der davor sitzt. Besucht den Jäger danach im Wirtshaus in Falkreach bzw. sprecht mit der Wirtin Valga und es kann losgehen.\r\n\r\nDer Ablauf ist meist das man sein Tagebuch liest . Werkzeuge und Baumaterial beschafft. Baut. Und das nächste Kapitel in sein Tagebuch schreibt. Lesen usw. Dein Tagebuch ist der zentrale Punkt in welchem steht was als nächstes zu tun ist. Es gibt keine Marker. Such dir was du brauchst....kauf es...jag es...finde es (schonmal nen Hammer gesucht, oder einen Besen wenn man ihn braucht? Viel Spass :) )\r\n\r\nUm das Tagebuch fortzuführen brauch man natürlich Schreibfeder und Tintenfass. Logisch oder?\r\n\r\nDie Mod enthält folgendes in nicht chronologischer Reihenfolge\r\n- ein Farmhaus\r\n  - Küche im Untergeschoss. (Sieh deine Bestände an Nahrung oder Alkohol im Regal. Der Tisch ist gedeckt wenn gekochte Nahrung im Warmhaltetopf ist. Ab und an ist es dreckig..Fege! Das Kaminfeuer brennt nur wenn auch Feuerholz im Stapel vorm Haus vorhanden ist)\r\n  - Wohnbereich im Obergeschoss (Hier führst du dein Tagebuch weiter. Ein Geschäftsbuch um Vieh zu kaufen/verkaufen. Bücherregal. Truhen. Bett... das übliche)\r\n - Keller mit Schlafplätzen deiner Bediensteten und KINDER! :) .. ein Portal zum Turm der Trophäen.. Alchemie und Verzauberer Werkbank)\r\n\r\n- Farm (mit Gemüse und Weizen)\r\n- Viehzucht (2 Hühner und 1 Kuh falls gekauft. Die Kuh kommt als Kalb und braucht einige \\'Zeit\\' um zu wachsen..natürlich nur wenn Weizen als Futter im Heuhaufen ist..die Tiere können am Schlachtertisch geschlachtet werden (man sieht das Blut und Fleisch wenn Schlachterzeugnisse vorhanden sind)..falls man sich dagegen entscheidet liefern sie Eier und Käse...oder man verkauft sie.\r\n- Mine ..enthält eine kleine Dwemerschmiede..und ist WIRKLICH dunkel...also Fackeln besorgen und in die Halterungen packen. In der Schmiede siehst du dein Erz und deine vorhandenen Barren. Es gibt von jeder Erzart 3 Vorkommen.)\r\n-Jagdlager für deine Felle und zum Verarbeiten derselben.\r\n-keiner Kräutergarten\r\n-ein idyllischer See und lauschige Sitzplätze\r\n-Dibella Statue um deinen Kinderwunsch zu erfüllen (vorrausgesetzt du bist verheiratet)\r\n-Trainigsbereich für deine Wache\r\n\r\n5 NPC mit vollem Tagesablauf\r\n- Selene (Haushälterin..kocht (Essen für sich und die anderen..wer satt ist arbeitet besser ;))..fegt...hackt Holz...betreut das Vieh (Eier und Käse)..versorgt die Farm (Gemüse und Weizen)..badet nackt im See...entspannt am Lagerfeuer und singt dir Bardenlieder wenn du sie fragst :)..brauch Lauch und nochirgendwas für ihr Lieblingsessen..mag ausserdem Wein\r\n- Melissa (Minenarbeiterin...badet, isst, schürft Erz (mit eigenem Grubenmagierlicht ..sieht toll aus wenn die Mine noch finster ist :) ,packt die Erze in deine Truhe...mag Huhn und Met \r\n- Clessa (Wächterin...badet, trainiert Fern- und Nahkampf, läuft Patrouille, besorgt Felle und Wildfleisch. Mag Rind und Met.)\r\n- die 2 Kinder rennen überall herum und spielen fange.\r\n\r\nAlles ist Navmeshed und mit Idlemarkern versehen. Critterspawner usw. Ich habe Stunden verbracht nur da zu sein und zuzuschaun :). \r\n\r\n- Turm der Trophäen WIP (mit Schatzkammer(wird wohl nochmal umgestaltet) ,Rüstkammer (unter Beobachtung) und Trophäenbereich (Questbezogene Freischaltung noch nicht aktiv...die Zuordnung der Favorquests (Thane) stimmt irgendwie nicht..deshalb Script vorerst deaktiviert und alles frei)\r\n\r\nWeitere Pläne:\r\n- Fehler ausmerzen (Items durch Statics ersetzen etc.)\r\n- Einbinden von Frau und Followern (automatisch Sandbox im Höhlenbereich wenn ich es hinbekomme)\r\n- Palisadenbereich vor der Höhle (evtl gelegentliche Angriffe)\r\n- Stallbereich (Pferde ..evtl mit Aufzucht)\r\n- Ziegen\r\n- Haustier (füttern und Aufzucht)\r\n- Falls verheiratet betreibt der Partner einen Markstand (im Palisadenbereich)\r\n- Factionbereiche (Werwolf,Vampir)\r\n- weitere Turmausbauten\r\n\r\n\r\n\r\nFAQ\r\n\r\nIch klick die Werkbank an und nichts passiert?\r\n- Du musst dein Tagebuch weiterschreiben.\r\n\r\nBeim bauen kommt die Meldung das was fehlt aber ich hab alles in der Truhe.\r\n- Was im Tagebuch unter Baumaterial gelistet ist muss in die Truhe...die Werkzeuge hingegen müssen im Inventar bleiben.\r\n\r\nWas hat es mit den NPC auf sich?\r\n- Selene erwirtschaftet 6 Feuerholz,kocht die jeweiligen Lieblingsessen,3 von jedem Farmgemüse, Käse und Eier falls Vieh vorhanden.\r\n   Ihr Lieblingsessen besteht aus Kohl und Lauch, sollte es im Warmhaltetopf sein wenn sie isst ,ist sie satt. (+1 auf alles erwirtschaftete) Abends am Lagerfeuer mag sie Wein. Dann ist sie zufrieden (nochmal +1 auf alles). Der Wein muss im Alkoholschrank vorrätig sein. Damit sie kocht müssen die Zutaten in den jeweiligen Behältern sein.\r\n- Das gleiche gilt für die anderen beiden. (Melissa Erze, Clessa verschiedene höherwertige Felle)\r\n\r\nDie Kuh wird einfach nicht größer!\r\n- Es muss Weizen in dem großen Heuhaufen gelagert sein .. dann wächst sie nach und nach.\r\n\r\nDer Kamin lodert nicht!\r\n- Feuerholz in den Stapel vorm Haus. Selene kann nicht kochen wenn das Feuer aus ist. Du auch nicht ;)\r\n\r\nDiese Mod ist auf Immersion ausgelegt, nicht mehr und vor allem nicht weniger.\r\nDies ist meine erste Mod. Also seit nachsichtig falls ihr Fehler findet und gebt mir Bescheid damit ich sie fixen kann..\r\n\r\nEs werden keine Updates,DLC, oder andere Mods benötigt.\r\nEs ist 100% inkombatibel mit Mods die den Moosmutter Worldspace betreffen.",
  "categoryId": "67",
  "version": "0.97",
  "author": "Cettral",
  "createdUnix": "1345823632",
  "updatedUnix": "1347630749",
  "containsAdultContent": false,
  "uploadedBy": "shonin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87110",
      "name": "The Cave - A Simple Life GERMAN",
      "version": "0.96",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2349",
      "fileName": "The Cave - A Simple Life GERMAN-22976-0-96.7z",
      "uploadedUnix": "1347095765",
      "modVersion": "0.96",
      "virusScanUrl": "https://www.virustotal.com/file/164843b4ac0dbc28f97aacfc458e74d7145dc14358651b70b970c8d0fa76cdcb/analysis/1407152763/",
      "changelogHtml": " - Hoffe das Problem mit den Fellen gelöst zu haben...die von mir ehemals genutzen Hirschfelle bekommt man nirgends :/ ..hab das geändert <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Cave%20-%20A%20Simple%20Life%20GERMAN-22976-0-96.7z?fid=87110&ttl=1535792900&ri=8192&rs=8192&setec=348cdf2b0d82750c66126fdec623c1ff"
    },
    {
      "fileId": "88382",
      "name": "The Cave - A Simple Live GERMAN",
      "version": "0.97",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2353",
      "fileName": "The Cave - A Simple Live GERMAN-22976-0-97.7z",
      "uploadedUnix": "1347630596",
      "modVersion": "0.97",
      "virusScanUrl": "https://www.virustotal.com/file/f74c28f25a5766eaa5dcabb2f04c4e447c94cf94be8afbdc0e00830c0bec86d6/analysis/1407164705/",
      "changelogHtml": " - Neue Scripte für die Minenfackeln (behalten ihren Zustand) <br/> \n - NavMesh Inseln unter den Mannequinns (kein gruseliges wandern mehr) <br/> \n - Kuh weiter in ihrem Freiraum beschränkt <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Cave%20-%20A%20Simple%20Live%20GERMAN-22976-0-97.7z?fid=88382&ttl=1535792901&ri=8192&rs=8192&setec=3986b2c1735f8a2436cf9b6213a56d2e"
    },
    {
      "fileId": "88383",
      "name": "The Cave - A Simple Life CHEAT ESP",
      "version": "0.97",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "152",
      "fileName": "The Cave - A Simple Life CHEAT ESP-22976-0-97.7z",
      "uploadedUnix": "1347630749",
      "modVersion": "0.97",
      "virusScanUrl": "https://www.virustotal.com/file/5b4308b83beffb55beca469ee5b64415c007873dfff065b0cde4dcc1850f37e7/analysis/1407164706/",
      "changelogHtml": " - Neue Scripte für die Minenfackeln (behalten ihren Zustand) <br/> \n - NavMesh Inseln unter den Mannequinns (kein gruseliges wandern mehr) <br/> \n - Kuh weiter in ihrem Freiraum beschränkt <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Cave%20-%20A%20Simple%20Life%20CHEAT%20ESP-22976-0-97.7z?fid=88383&ttl=1535792901&ri=8192&rs=8192&setec=a29b6a2c9b84b9170f444f19e80cd529"
    }
  ]
}