{
  "modId": 22994.0,
  "modName": "Home of Darkness - Miniature Total Conversion",
  "summary": "Where the generosity of the gods no longer give,\r\nIf you will to live, you will have to run faster.",
  "descriptionHtml": "[center]\r\n\r\n[img]http://img844.imageshack.us/img844/5645/homeofdarkness.png[/img]\r\n\r\n[youtube]oaki2--T3Eg[/youtube]\r\n\r\n[img]http://img204.imageshack.us/img204/6366/linespiece01.png[/img]\r\n\r\nWelcome to castle Night Crest, the home of darkness, where an evil lies so dark, so menacing, that the mortal mind knows not its true extent, or intent...\r\n\r\n[img]http://img9.imageshack.us/img9/2131/linespiece02.png[/img]\r\n\r\nA shadow has been called, sentient and hungry for the souls of the living. Your former lord is the summoner, and you are his prey...\r\n\r\n[img]http://img843.imageshack.us/img843/5808/linespiece03.png[/img]\r\n\r\nVenture not into the black mists, for its menacing darkness will consume you alive, leaving an empty shell to wander the halls of castle night crest for all eternity...\r\n\r\n[img]http://img51.imageshack.us/img51/9214/linespiece04.png[/img]\r\n\r\nTake your time, and be quiet. Should it see you, run, do not stop, and do not look back. For in this castle, to run is to live. to hide is to live. to fight... is to [color=red]die....[/color]\r\n-------------------------------------------------\r\n[img]http://img407.imageshack.us/img407/9933/welcometohomeofdarkness.png[/img]\r\n\r\nHome of darkness is a MINIATURE total conversion for the elder scrolls V skyrim. What do we mean by that?\r\n\r\nWe mean that the Total conversion is small scale. Very small, compared to the big game projects like Nehirm, Andoran, or Enderal. Here, we aim to bring you a simple, but effective game, likely no more than 8 hour sin length, with a deep, dark, menacing storyline, danger around every turn, and a sense of fear that will grip you down to your very soul. \r\n\r\nMany things reside in the home of darkness. Be careful, and beware.[/center]\r\n\r\n-----------------------------------\r\nINSTILLATION\r\n-----------------------------------\r\n\r\n\r\n1. Download the file manually.\r\n\r\n2. Extract to a temporary location.\r\n\r\n3. back-up your Skyrim.ESM.\r\n\r\n4. Replace your Skyirm ESM with the one provided with the mod.\r\n\r\n5. Extract the contents of the file into your Skyirm/Data directory. I would honestly use NMM for this.\r\n\r\n6. De-activate ALL ESM\\'s and ESP\\'s.\r\n\r\n7. Activate: Skyrim.ESM, YouNeedMeJustToPlayTheGame, and Home of Darkness.ESP.\r\n\r\n8. Have fun, and give your feedback, comments, and suggestions.",
  "categoryId": "35",
  "version": "0.0.1",
  "author": "Team Eccentric",
  "createdUnix": "1345839434",
  "updatedUnix": "1345839434",
  "containsAdultContent": false,
  "uploadedBy": "cjmckee",
  "primaryFile": null,
  "files": []
}