{
  "modId": 23029.0,
  "modName": "The Goddess ENB Configuration v2",
  "summary": "\\\"The Goddess\\\" is an ENB configuration that aims to bring a more stylized, fantastic, and beautiful look to the land of Skyrim. Ideal for screenarchery, whether you like epic landscapes, realistic portraits, or dramatic action scenes. Utilizes the latest .121212 ENB effects to deliver a unique visual style.",
  "descriptionHtml": "[img]http://farm9.staticflickr.com/8422/7857365928_46db9eb7fe_o.png[/img]\r\n\r\n[b]Version 2.2 notes:[/b]\r\n\r\nVersion 2.2 is a minor tweak of the 2.1 build intended to improve compatibility with the .12.12.12 build of the ENB binary, and to tighten up some low-light settings.\r\n\r\nVersion 2.1 of The Goddess was a major overhaul built around version .123 of the ENB binary - which of course is no longer available (thanks, Boris!). It does look like the .121212 version of the binary works just as well though - I\\'m testing now and might make a minor update if needed. The download does not include the needed .121212 DLL file, which must be downloaded from the [url=http://enbdev.com/mod_tesskyrim_v121212.htm]ENBDev.com website[/url]. See detailed installation instructions below.\r\n\r\nNew features include much better performance and higher quality SSAO and indirect illumination as well as overall tweaks and refinements to the visual settings. I\\'ve also included SweetFX as a proxy library in place of SMAA. In addition to providing high performance SMAA I\\'m using SweetFX to add additional sharpening and refinement to the visuals. \r\n\r\nThe optional files section now includes my [url=http://skyrim.nexusmods.com/mods/27960]\\\"Blackout\\\" plugins[/url] to fix the over-lit locations that some of you may have noticed when using my ENB, or in fact any other ENB that doesn\\'t have a very dark look. These plugins change one flag in the records of certain interior cells, forcing them to render using the proper interior settings instead of the daytime settings, meaning they\\'ll be as dark as every other interior. I highly recommend using them - I\\'ve offered them as a standalone download so they can be installed with NM or Mod Organizer. [url=http://skyrim.nexusmods.com/mods/27960]Check their mod page here on the Nexus[/url] for a full breakdown on what they do and to see comparison pics.\r\n\r\n\r\n[img]http://farm8.staticflickr.com/7124/7857407364_7ce0d05003_o.png[/img]\r\n\r\n\r\n\\\"The Goddess\\\" is an ENB configuration that aims to bring a more stylized, fantastic, and beautiful look to the land of Skyrim. It\\'s  the evolution of the configuration that I\\'ve used for the last few months and is designed pretty specifically to my personal tastes, but if you\\'ve seen and liked my screenshots you might want to give it a look.\r\n\r\nIt\\'s tough to describe exactly what the \\\"look\\\" of the config is because it\\'s pretty mercurial - fortunately I have a lot of example shots to showcase some of the effects you can expect. One way that I think about it is that it takes any visual effect in the game and makes it just a bit more: if it\\'s dark out, it gets darker and scarier; bright sunny days look more colorful and vibrant while dark cloudy days look more grim and foreboding; shadows become darker and more complexly detailed while light sources become brighter and clearer. Seriously, look at the screenshots... they do a much better job of explaining it than I can. Three things I know for sure: It generates very realistic skin tones, very dramatic lighting and shadows, and some really impressive skies. \r\n\r\n[Url=http://farm9.staticflickr.com/8300/7801182556_d1a766d610_o.jpg][img]http://farm9.staticflickr.com/8300/7801182556_eb11160109_m.jpg[/img][/url][url=http://farm9.staticflickr.com/8292/7775763546_439346909c_o.jpg][img]http://farm9.staticflickr.com/8292/7775763546_e0684c8bf8_m.jpg[/img][/url][url=http://farm9.staticflickr.com/8448/7812667356_211b478089_o.jpg][img]http://farm9.staticflickr.com/8448/7812667356_24103fa237_m.jpg[/img][/url]\r\n[youtube]1lWvyFKx9Aw[/youtube]\r\n[youtube]cjsaE6B_s6c[/youtube]\r\n\r\nIt is a performance-intensive configuration, but it\\'s not dramatically more demanding than many of the other complex ENB setups that I\\'ve used - if you\\'ve tried Midhrastic or The Wilds, it\\'s maybe just a touch heavier than they are. First and foremost I\\'ve built it to look good, but even with all of the eye candy features turned on I get solidly playable frame rates in even the most difficult areas - not 60+ FPS, but a solid 25-45 (more detail in the \\\"Troublehooting/FAQ\\\" section below).\r\n\r\nI\\'ve tried very hard to ensure that it\\'s a balanced configuration. While it has strengths and weaknesses like any other, I\\'ve worked to make it so there\\'s no weather, time of day, lighting condition, or location that doesn\\'t look at least pretty good to my eye - your mileage may vary as they say. I don\\'t think you\\'ll have issues with overbright days, superbright snow, or radioactive grass unless you\\'re using modded assets that I haven\\'t tested (see the \\\"Recommended Mods\\\" and \\\"Troubleshooting/FAQ\\\" section for some mods that might cause problems).\r\n\r\n[Url=http://farm8.staticflickr.com/7252/7822605596_b8cbf0497e_o.jpg][img]http://farm8.staticflickr.com/7252/7822605596_0f18abcb3b_n.jpg[/img][/url][url=http://farm9.staticflickr.com/8289/7771776932_cdd20d7e4b_o.jpg][img]http://farm9.staticflickr.com/8289/7771776932_608ccf9845_n.jpg[/img][/url][url=http://farm9.staticflickr.com/8284/7818972690_050874568e_o.jpg][img]http://farm9.staticflickr.com/8284/7818972690_af4e3f2f4b_n.jpg[/img][/url][url=http://farm9.staticflickr.com/8426/7786481084_f38879b9a0_o.jpg][img]http://farm9.staticflickr.com/8426/7786481084_b2ea0fbc7e_n.jpg[/img][/url]\r\n\r\nThe download page includes a version based on the latest .123 ENB wrapper - see the \\\"Installation\\\" section below for download links - and I\\'ve kept the older .113-based version available for those who want the overall look of the config with a lower performance hit (nicknamed \\\"the Demigoddess\\\"). Both .123 and .113 versions come with and without the cinematic vignette/letterbox effect for a total of four options. I\\'m not planning on releasing a million other variants - again I\\'ve built this to my tastes, and all of the visuals are interconnected so it\\'s not easy to, for example, make the nights brighter without also breaking the interior lighting or other effects that rely on the same settings. \r\n\r\nIf you feel like adjusting the configuration to better meet your personal tastes you\\'re more than welcome to, and I\\'ll help with advice to the extent that I\\'m able, but aside from fixing actual bugs, minor tweaking as my tastes change or the inclusion of new ENB features as they become available I\\'m not planning on continuing to put a ton of work into this config.\r\n\r\n[img]http://farm9.staticflickr.com/8018/7857407418_ffb927df00_o.png[/img]\r\n\r\n[b]1. Download the D3D9.dll file[/b]\r\nBoth versions of the configuration require the correct version of the D3D9.dll wrapper in order to work - this is NOT included in either download. \r\n[list]\r\n[*]If you want to use the [b].121212-based version[/b]  visit [url=http://enbdev.com/mod_tesskyrim_v121212.htm]the official download page[/url] and follow the instructions there. \r\n\r\n[*]For the [b].113-based version[/b] visit [url=http://enbdev.com/mod_tesskyrim_v0113.htm]the official download page[/url] and follow the instructions there. \r\n[/list]\r\n\r\nThe injector versions of the appropriate ENB binary should work just as well.\r\n\r\n[b]2. Download the ENB configuration manually and extract to your Skyrim directory[/b]\r\nDo not use the Nexus Mod Manager (NMM) to download or install the ENB configuration. Download the version that you want manually and extract to a convenient location. \r\n\r\nInside the folder you will see two sub-folders, one for the version with the vignette (the black bars at top and bottom) and one without. Open whichever folder you prefer to use and copy all of the contained files into your Skyrim directory (the folder with the Skyrim exectutable, not the Data folder). \r\n\r\n[b]3. Copy the D3D9.dll file to your Skyrim directory[/b]\r\nFind the version of the ENB files that you downloaded in step 1 and extract that folder to a convenient location. [color=red]From the extracted folder copy ONLY the D3D9.dll file into your Skyrim directory[/color] - everything else you need to run the config should already be installed in the last step.\r\n\r\n[b]4. Launch Skyrim and load a save or start a new game.[/b]\r\n If everything is installed correctly you\\'ll see text in the top left corner of the screen as it loads that tells you what version of  the DLL you have loaded, followed by a message in yellow regarding SSAO and SSIL. If you don\\'t see that text and/or the game still looks like vanilla, go back to step 1 and see if you might have skipped a step, or copied files to the wrong directory. If it still doesn\\'t work check the [b]\\\"FAQ/Troubleshooting\\\"[/b] section below or drop by the comment thread and see if anyone else has had (and hopefully solved) the same problem.\r\n\r\n[img]http://farm9.staticflickr.com/8307/7857407478_da0ea7041d_o.png[/img]\r\n\r\nThere are no required mods to use this ENB, but it was designed and tested with certain mods that I feel really enhance the effects of the mod. There are also a handful of mods that I\\'d suggest you not use - those are are also touched on below. Note: I\\'m only going to list mods that I think enhance the look of the configuration, not every mod that I use and recommend. I\\'ll try to post an article later with a more comprehensive list of what I consider must-use mods.\r\n\r\n[url=http://farm9.staticflickr.com/8298/7814382144_79d27c5dbe_o.jpg][img]http://farm9.staticflickr.com/8298/7814382144_d9dd7d9819_c.jpg[/img][/url]\r\n\r\n[b][url=http://skyrim.nexusmods.com/mods/13306]ENB SSAO and DoF Toggler[/b][/url]\r\nClosest thing to a required mod that I have. Allows you to toggle the SSAO and DoF features on and off on the fly. The Goddess has a pretty light SSAO effect that is ON by default, but it does have a noticeable performance hit and you might not even notice the change in the look in many outdoors environments. My DOF effect is on by default, and is best-suited for taking screenshots. During regular play I toggle both off using this utility, and turn them on for effect when taking screenshots. \r\n\r\nAs an added bonus it\\'s the fix for a known bug in the ENB code (see the \\\"Troubleshooting/FAQ\\\" section below for details).\r\n\r\n[b]Vanilla sun glare texture or [url=http://skyrim.nexusmods.com/mods/20100]Sunglare Disabler[/url][/b]\r\nThe Goddess has pretty intense sunrises and sunsets out of the box, and using a custom sunglare texture might cause some unexpected effects and temporary blindness. I built and tested the mod using the vanilla sunglare and have also tested the blank sunglare texture linked above, and would suggest one or the other depending on  your taste. Most of my screenshots show the vanilla sunglare, but if that\\'s too dramatic for you try the Sunglare Disabler mod.\r\n\r\n[b]Blackout - Simply Darker Dungeons[/b] by yours truly - available on the download page of this mod. I used to recommend using either Dark Dungeons, Mike Fox\\'s Darker Dungeons, or Creepy Dungeons to ensure a suitably dark dungeon experience. But since my 1.2 version they haven\\'t been necessary for the full Goddess ENB. With the blackout plugins installed, all dungeons and interiors should be lit using The Goddesses interior lighting setup: The Goddess uses very little ambient light, but amplifies the effect of all lights, so that areas with no lights will be very dark indeed while areas with torches, braziers, or even candles should be dramatically lit. [url=http://skyrim.nexusmods.com/mods/12808]Creepy Dungeons[/url] may still be used to provide the ultimate \\\"dark dungeons\\\" experience.\r\n\r\n[b][url=http://skyrim.nexusmods.com/mods/17605]Claralux[/url] and [url=http://skyrim.nexusmods.com/mods/18916]Lanterns of Skyrim[/b][/url]\r\nBy no means needed, but recommended for aesthetic effect. The darker nights and brighter brights of my config really play up the look of both mods and make for some pretty dramatic locations. I personally use the Vanilla brightness/double radius adjuster for Claralux and the Default setting for Lanterns of Skyrim. MannyGT was eben lind enough to put together a configuration for Lanterns of Skyrim that\\'s specifcally tailored for use with The Goddess and The Demigoddess.\r\n\r\n[b][url=http://skyrim.nexusmods.com/mods/4910]Dramatic Clouds[/url][/b]\r\nYou get pretty dramatic clouds for free with this config, but Dramatic Clouds turns them to 11.\r\n\r\n[b][url=http://skyrim.nexusmods.com/mods/85]Enhanced Night Skyrim[/url][/b]\r\nIs there anybody that doesn\\'t use this mod already? Shame on  you. \r\n\r\n[b][url=http://skyrim.nexusmods.com/mods/836]Realistic Smoke and Embers[/url][/b]\r\n\r\nWhat about [url=http://skyrim.nexusmods.com/mods/17802]Climates of Tamriel?[/url] [b]Not recommended.[/b] It will work, but many weathers and lighting scenarios will not be as I intended, and many users have had issues with overbright areas and persistent blurry visuals.[b] I strongly suggest you not use CoT with either version of this ENB config.[/b] If you do and have problems with the way your game works, I can\\'t help you. Nothing against the mod, I think it\\'s great, but it makes a lot of changes to lighting and weather and The Goddess was designed to work with Vanilla lighting and weather.\r\n\r\n\r\n\r\n[url=http://farm9.staticflickr.com/8307/7853531046_fb10ba2a84_o.jpg][img]http://farm9.staticflickr.com/8307/7853531046_11ce99f817_c.jpg[/img][/url]\r\n\r\n[url=http://farm9.staticflickr.com/8433/7778333994_8a87b8391a_o.jpg][img]http://farm9.staticflickr.com/8433/7778333994_07a2722d58_c.jpg[/img][/url]\r\n\r\n[url=http://farm9.staticflickr.com/8288/7759223158_d24ef085ea_o.jpg][img]http://farm9.staticflickr.com/8288/7759223158_bd7dff3dc3_c.jpg[/img][/url]\r\n\r\n[url=http://farm9.staticflickr.com/8308/7828102832_82d45c7208_o.jpg][img]http://farm9.staticflickr.com/8308/7828102832_e82f0f50ba_c.jpg[/img][/url]\r\n\r\n[img]http://farm9.staticflickr.com/8430/7857407528_17dca0683d_o.png[/img]\r\n\r\nNote: I\\'ll be updating this section as I go along. Right now I just want to cover some of the known issues with this config and ENB settings in general, and try to preempt questions that other config authors seem to spend an inordinate amount of time answering).\r\n\r\n[list]\r\n[*][color=red]As with all ENB files you must make sure that you have [b]bFloatPointRenderTarget[/b] set to 1 in your SkyrimPrefs.ini.[/color] If everything looks really dark in your game regardless of time of day or location, that\\'s probably the problem. [b]Make sure you are editing the SkyrimPrefs.ini file that lives in My Documents/My Games/Skyrim[/b] - the same location as your saved games by default. There is also a copy of this file in the main Skyrim directory but editing it does nothing.\r\n\r\n[*]Game crashing on startup? Almost every crash has come down to users also using overclocking or overlay apps like MSI Afterburner, EVGA Precision, algoboost, etc. Make sure none of this type of app is running if you experience crashes when Skyrim is launching.\r\n\r\n[*]If the crash persists or you aren\\'t running this sort of software, try using the injector version of the ENB binary instead of the wrapper version.\r\n\r\n[*]A couple of people have even had problems using the SMAA . To disable it open the enbseries.ini file and change the following line to false:\r\n\r\n[code]EnableProxyLibrary=true[/code]\r\n\r\nThis will also disable the tweaks provided by SweetFX, but the overall look of the configuration should be largely maintained.\r\n\r\n[*]It\\'s a  good practice to delete the RendererInfo.txt file that Skyrim uses to hold values about your video card before installing a new ENB. This file is in the same directory as your Skyrim.ini and SkyrimPrefs.ini files - on Windows 7 for example it\\'s in My Documents/My Games/Skyrim. Before you do this back up your Skyrim.ini and SkyrimPrefs.ini files, then delete those two files and the RenderInfo.txt file. Launch the Skyrim Launcher - Skyrim will recignize your video hardware and regenerate those three files. Then just replace the new SkyrimPrefs.ini and Skyrim.ini files with your backed up originals.\r\n\r\n[*]Everything look blurry? First try toggling off DoF using the utility linked above. \r\n\r\nIf that doesn\\'t fix it, are you running Climates of Tamriel? If you are, don\\'t. See if turning off CoT fixes it.\r\n\r\n[*]Low FPS? Yep. Try turning SSAO off using the toggle utility above. You might also try The Demigoddess version - it\\'s less demanding and only slightly less pretty.\r\n\r\n[*] On occasion torches, braziers, and other sources will become transparent - this seems to be a bug with SSAO handling in the D3D9.dll. To fix it toggle SSAO on and off.\r\n\r\n[*]Some hairstyles and beards may look semi-transparent with SSAO on. Again, this is a known bug in the ENB SSAO code, and may be fixed temporarily by turning SSAO off. This seems to be largely sorted with  the .121212 build used for The Goddess, but I have on occasion had my character\\'s entire head go translucent under certain lighting conditions. Very rare, but very disconcerting when it happens.\r\n\r\n[*]This configuration has SMAA injected by default and Anisotropic Filtering forced on by default. No need to set AA or AF on in the regular Skyrim prefs, and FSAA should not be on. Running both game and ENB AA and AF causes a performance hit and may reduce visual quality.\r\n[/list]\r\n\r\n[img]http://farm9.staticflickr.com/8444/7857774328_d9718f6cc7_o.png[/img]\r\n\r\nI\\'d like to thank the following friends for their inspiration and advice and feedback, for testing the configuration, and on occasion for outright nagging me to finish and release it - and of course for their ongoing support and kind comments. \r\n\r\n[list]\r\n[*][url=http://skyrim.nexusmods.com/users/2808024]Midhras[/url] - Always an inspiration and a font of support and good advice\r\n\r\n[*][url=http://skyrim.nexusmods.com/users/2099379]LSiwora/Lunanella[/url] - It was probably playing the early builds of The Wilds that really kicked me in gear to take my config to the next level. She also supplied me inadvertently with the name for the config :-)\r\n\r\n[*][url=http://skyrim.nexusmods.com/users/595731]Solsikke737[/url] - for her unwavering support and feedback\r\n\r\n[*][url=http://skyrim.nexusmods.com/users/2596035]sPINELESS jELLY[/url] - for artistic inspiration and a steady supply of artful comments and Tom Waits references\r\n\r\n[*][url=http://skyrim.nexusmods.com/users/3102015]trillville[/url] - first screenshot artist that ever made me say \\\"whoa!\\\" out loud. Some of his early shots convinced me to take a bit more care in setting up my own shots\r\n\r\n[*][url=http://skyrim.nexusmods.com/users/3463021]Kyokushinoyama[/url] for ongoing technical advice and support (some of which I hope to share with you in the next build), enthusiasm, and leading by example with his ceaseless tinkering\r\n\r\n[*][url=http://skyrim.nexusmods.com/users/938388]83Willow[/url],  [url=http://skyrim.nexusmods.com/users/4408179]WoodManGamer[/url], [url=http://skyrim.nexusmods.com/users/582295]Benbenben[/url], [url=http://skyrim.nexusmods.com/users/209736]Kamikazekossori[/url], [url=http://skyrim.nexusmods.com/users/3678762]JoPineapples68[/url] and many, many more who provided tons of support and inspiration with their own mods, stories, and pictures as well as their kind comments.\r\n\r\n[/list]\r\n\r\nAnd to everyone who deserves to be on this list but who I\\'ve inevitably left off, thank you too... I\\'ll try to keep this list live and update as necessary. \r\n\r\nDon\\'t forget to check the credits tab for credits to those whose code I\\'ve incorporated and adapted - shoulders of giants, friends.",
  "categoryId": "62",
  "version": "305.1.2",
  "author": "Anaphiel",
  "createdUnix": "1345899776",
  "updatedUnix": "1470635699",
  "containsAdultContent": false,
  "uploadedBy": "anaphiel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84127",
      "name": "The Goddess ENB Config  - 117 version",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "161",
      "fileName": "The Goddess ENB Config  - 117 version-23029-1-0.7z",
      "uploadedUnix": "1345899921",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/460657f9456053496632953b339b0bcc9ef8a36eabecebfac19cdcf068ef39b6/analysis/1407120905/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Goddess%20ENB%20Config%20%20-%20117%20version-23029-1-0.7z?fid=84127&ttl=1535792982&ri=8192&rs=8192&setec=c05aeca36357352b58a0735177f5ae99"
    },
    {
      "fileId": "84128",
      "name": "The Demigoddess ENB Configuration - 113 version",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "135",
      "fileName": "The Demigoddess ENB Configuration - 113 version-23029-1-0.7z",
      "uploadedUnix": "1345900019",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/87f338affcc7ffe3d0d5985e9437c56a4f9175cdd719a3caf898fc1c3b77cc92/analysis/1407120905/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Demigoddess%20ENB%20Configuration%20-%20113%20version-23029-1-0.7z?fid=84128&ttl=1535792983&ri=8192&rs=8192&setec=a600528d933be7cd2123aaef52f05cb1"
    },
    {
      "fileId": "86196",
      "name": "The Goddess ENB Config - 119 version",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "185",
      "fileName": "The Goddess ENB Config - 119 version-23029-1-1.7z",
      "uploadedUnix": "1346682558",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/fe97d8bcf1e0644010bafb47f068139424c56609b3639cd912d0c6d3dcc3d08d/analysis/1407143162/",
      "changelogHtml": " Updated Goddess version to use latest .119 ENB Wrapper. For now have matched interior values to old night values and lowered interior ambient slightly for darker dungeons. <br/> \n Replaced default sunsprite textures with MannyGT\\'s textures  <br/> \n Minor tweaks to several lighting and shadow parameters <br/> \n No edits to .113 version - the Demigoddess remains at version 1.0 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Goddess%20ENB%20Config%20-%20119%20version-23029-1-1.7z?fid=86196&ttl=1535792983&ri=8192&rs=8192&setec=bcf64935c4c833094b1b9d259bc43af7"
    },
    {
      "fileId": "87384",
      "name": "The Goddess ENB Config - 119 version Darker Edition",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "178",
      "fileName": "The Goddess ENB Config - 119 version Darker Edition-23029-1-2.7z",
      "uploadedUnix": "1347193710",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/5fa0ef32d580e48a72873829ffabd14e79e88455e85a410a81463cdce4c9d81e/analysis/1407155582/",
      "changelogHtml": " Revamped interior lighting values for darker interiors and dungeons <br/> \n SSAO back ON by default - if the FPS hit is too much use the SSAO/DoF toggle utility to turn it off <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Goddess%20ENB%20Config%20-%20119%20version%20Darker%20Edition-23029-1-2.7z?fid=87384&ttl=1535792984&ri=8192&rs=8192&setec=69d7692f30ccafe73f78ce69a934232e"
    },
    {
      "fileId": "103994",
      "name": "Whitewater texture replacer",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "274",
      "fileName": "Whitewater texture replacer-23029-1-0.7z",
      "uploadedUnix": "1355037026",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ee6e6f85fd75bd4276bcec96bba1a5cb01e58f79606cb851ebec00468df0a3d7/analysis/1407296181/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whitewater%20texture%20replacer-23029-1-0.7z?fid=103994&ttl=1535792984&ri=8192&rs=8192&setec=d50aa2ec1fa1e6ee1eb7313b3ab6f930"
    },
    {
      "fileId": "104043",
      "name": "The Goddess ENB Config - 123 version with SweetFX",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "190",
      "fileName": "The Goddess ENB Config - 123 version with SweetFX-23029-2-0.7z",
      "uploadedUnix": "1355056951",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/8b0d84fd15997329c35fb481e2a788d7759caced099bda4efb16164200525ae9/analysis/1407296468/",
      "changelogHtml": " Rebuilt around v123 ENB binary <br/> \n Added SweetFX for SMAA, lumasharp, vibrance, liftgammagain <br/> \n Optional but highly recommended plugins to fix occasional over-bright interiors <br/> \n Optional tilt-shift variable-focus DoF <br/> \n Many, many tweaks and refinements to visual settings <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Goddess%20ENB%20Config%20-%20123%20version%20with%20SweetFX-23029-2-0.7z?fid=104043&ttl=1535792985&ri=8192&rs=8192&setec=bbaabd8b34c431332fe33a4142f282ab"
    },
    {
      "fileId": "104045",
      "name": "Optional variable-focus Depth of Field",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4",
      "fileName": "Optional variable-focus Depth of Field-23029-1-0.7z",
      "uploadedUnix": "1355057694",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7834e66463591e7bdf22fb2c938e71e2b883158bfafc2c681ac26a8dfe6a6a94/analysis/1407296468/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Optional%20variable-focus%20Depth%20of%20Field-23029-1-0.7z?fid=104045&ttl=1535792985&ri=8192&rs=8192&setec=da26ded8a0c220d321d7c9d51e664fa0"
    },
    {
      "fileId": "104286",
      "name": "The Goddess ENB Config - 121212 version with SweetFX",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "379",
      "fileName": "The Goddess ENB Config - 123 version with SweetFX-23029-2-1.7z",
      "uploadedUnix": "1355109556",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/b1e9dc5afbe4aa29c9bfb86e0271e57aeb74949dc16e7c43013819eebd8e89a9/analysis/1407298039/",
      "changelogHtml": " Re-worked subsurface scattering values to improve appearance of skin in shadows <br/> \n Further tightened up interiro lighting and fog values for cleaner, sharper lighting <br/> \n Increased nighttime Direct Lighting values so clear nights are brighter - cloudy nights will still be very dark <br/> \n Re-worked exterior night volumetric fog and fog color power/fog values <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Goddess%20ENB%20Config%20-%20123%20version%20with%20SweetFX-23029-2-1.7z?fid=104286&ttl=1535792986&ri=8192&rs=8192&setec=04db7243e756b576262691edd23b6409"
    },
    {
      "fileId": "105673",
      "name": "Blackout - Simply Darker Dungeons Skyrim",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "16",
      "fileName": "Blackout - Simply Darker Dungeons Skyrim-23029-2-0.7z",
      "uploadedUnix": "1355711624",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/6e6b3b61cc6d3fb4e31ddd85310b7587a484a4627fd1c17e8d1bbbaa6a12d15d/analysis/1407312064/",
      "changelogHtml": " Rebuilt around v123 ENB binary <br/> \n Added SweetFX for SMAA, lumasharp, vibrance, liftgammagain <br/> \n Optional but highly recommended plugins to fix occasional over-bright interiors <br/> \n Optional tilt-shift variable-focus DoF <br/> \n Many, many tweaks and refinements to visual settings <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blackout%20-%20Simply%20Darker%20Dungeons%20Skyrim-23029-2-0.7z?fid=105673&ttl=1535792986&ri=8192&rs=8192&setec=9c8fbcf31fe2c174a9fcac2c86aee15a"
    },
    {
      "fileId": "105674",
      "name": "Blackout - Simply Darker Dungeons Dawnguard",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "Blackout - Simply Darker Dungeons Dawnguard-23029-2-0.7z",
      "uploadedUnix": "1355711651",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/13198e741b404b1598db5e9e5bd7fe51d208b4e4e582b4caba03e25c350c216d/analysis/1407308163/",
      "changelogHtml": " Rebuilt around v123 ENB binary <br/> \n Added SweetFX for SMAA, lumasharp, vibrance, liftgammagain <br/> \n Optional but highly recommended plugins to fix occasional over-bright interiors <br/> \n Optional tilt-shift variable-focus DoF <br/> \n Many, many tweaks and refinements to visual settings <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blackout%20-%20Simply%20Darker%20Dungeons%20Dawnguard-23029-2-0.7z?fid=105674&ttl=1535792987&ri=8192&rs=8192&setec=dcca791129763b88c4fb48cd008a8ac7"
    },
    {
      "fileId": "105688",
      "name": "The Goddess ENB Config 2dot2 - 121212 version with SweetFX",
      "version": "2.2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "190",
      "fileName": "The Goddess ENB Config 2dot2 - 121212 version with SweetFX-23029-2-2-1.7z",
      "uploadedUnix": "1355715059",
      "modVersion": "2.2.1",
      "virusScanUrl": "https://www.virustotal.com/file/5eedde28fbd9cc4a62787834e3a96cd64bad09b8eeffaee35498e70ef3167e55/analysis/1407308346/",
      "changelogHtml": " Added correct enbeffect.fx file for non-vignette version <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Goddess%20ENB%20Config%202dot2%20-%20121212%20version%20with%20SweetFX-23029-2-2-1.7z?fid=105688&ttl=1535792987&ri=8192&rs=8192&setec=0421fa6b0fd2779bccfd05f13c290535"
    },
    {
      "fileId": "1000208415",
      "name": "Goddess Omega 305",
      "version": "305.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22731",
      "fileName": "Goddess Omega 305-23029-305-1-1.7z",
      "uploadedUnix": "1464740104",
      "modVersion": "305.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f6438f96e4d203233c84154430059b3e68952dc0f45c4818c636efb624dc6978/analysis/1464740177/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Goddess%20Omega%20305-23029-305-1-1.7z?fid=1000208415&ttl=1535792987&ri=8192&rs=8192&setec=c4c54ff5f248e2573b15ac8c606db22c"
    },
    {
      "fileId": "1000216145",
      "name": "Goddess Omega 305 v1.2",
      "version": "305.1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22769",
      "fileName": "Goddess Omega 305 v1.2-23029-305-1-2.7z",
      "uploadedUnix": "1470635699",
      "modVersion": "305.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/c16b4a658dbeba17ae580bd350276c48ff648e63f56f6e500bb1d75b4d6e5eac/analysis/1470646688/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Goddess%20Omega%20305%20v1.2-23029-305-1-2.7z?fid=1000216145&ttl=1535792988&ri=8192&rs=8192&setec=40c65ed8db00b7fa7afc79e92013d5ca"
    }
  ]
}