{
  "modId": 23079.0,
  "modName": "The Gate Room",
  "summary": "As a reward for obtaining the title of Archmage you have been given stewardship of The Skyrim Gate Room, a player home of sorts and chiefly an instantaneous transit system to prominent locations across Skyrim. ",
  "descriptionHtml": "Welcome to The Gate Room!\r\n\r\nI. Features & Description-\r\n\r\n - A transit room that connects 12 desirable locations around skyrim as if there were only a hallway in between.\r\n - An outdoor study designed for a mage-type player, only accessible via The Gate Room\r\n - An island in the sky that serves as an outdoor bedroom, complete with a small lake and an alchemy shack.\r\n \r\nThis is my first mod; criticisms and suggestions are welcomed. Please leave them in the comments section. Thanks!\r\n\r\nI felt the rewards for obtaining the title of Archmage of Winterhold College were lacking. /SPOILER ALERT You get a room and an empty roof to walk out on <queue the sound of a balloon deflating>.\r\n\r\nAs the leader of the paramount mages college in Tamriel you\\'d have your collection of hidden and exclusive goodies and that is what I\\'m giving you; access to The Skyrim Gate Room. The Gate Room connects prominent locations across Skyrim, all accessible from one location, as well as a couple exclusive areas for use by the Archmage and his or her guests only. Enjoy!\r\n\r\nII. Access-\r\n\r\nTo access The Gate Room head to the roof of the college once you\\'ve obtained the title of Archmage. Upon entering The Gate Room make sure to read the note and take the spellbook on the pedestal as it will allow you to instantly travel back to The Gate Room. It will even allow you to teleport there from interior locations and, at times, quest-breaking locations. You have been warned. Use it wisely!\r\n\r\nIMPORTANT: There are always gates back to the gate room, though many of them are hidden. The return gates will be behind wherever you spawned when you passed through the gate initially.They may be trap doors, false dressers, behind foliage, etc. Please let me know if you would like pictures to make it easier to find if you are having trouble locating them.\r\n\r\nIII. Contents-\r\n\r\na. The Gate Room: Giving instant access to several locations throughout Skyrim. The Gates are as follows:\r\n  - The Skyforge\r\n  - Markarth, by Vlindrel Hall\r\n  - The Blue Palace, kitchen hallway\r\n  - The Nightingale Sanctuary\r\n  - Falkreath, behind the well \r\n  - Windhelm, behind the trees beside Hjerim\r\n  - Sky Haven Temple exterior\r\n  - The Dawnstar Sanctuary exterior, a trap door in the water (you rise from the water upon emerging)\r\n  - Jorrvaskr Harbringer\\'s room\r\n  - High Hrothgar\r\n  - The Ratway, just outside The Ragged Flagon\r\n\r\nb. The study and bedroom. Both are located at different places across skyrim, making The Gate Room, in effect, the largest player home in the game. :P\r\n- The study is an outdoor office atop a ruin, located at what I believe has been dubbed Dragon Falls.\r\n- The Bedroom is a floating island above Eastmarch, complete with a pond and a ton of mage-related goodies.\r\nBoth locations are only accessible via The Gate room.\r\n\r\nIV. Conflicts and Bugs-\r\n\r\nThis mod alters many of the locations across skyrim in very small and hopefully unobtrusive ways. However, any other mod that alters the same locations runs the risk of conflicting with this one. In that regard please let me know in the comments if there are conflicts.\r\n\r\n-Known Conflicts-\r\n1. \\\"Dragon Falls Manor\\\" will have a statue in the middle of the floor of your study, beyond that it\\'s fine.\r\n\r\n2. Possible conflicts with the teleportation spell if you have a Mark/Recall mod installed. (unverified) \r\n\r\nV. Disclaimer-\r\n\r\nMake sure to backup your saves and especially as this is my first time publishing a mod, if you see anything hokey or a potential bug, please let me know. Thanks.\r\n\r\nVI. Updates-\r\n\r\n(Planned) Adding all smithing stations to the area behind the house on the island.\r\n(Planned) Incorporating a trophy room and/or weapon & armor display features to both the study and the island. ",
  "categoryId": "68",
  "version": "1.0",
  "author": "Animaphotic",
  "createdUnix": "1345980316",
  "updatedUnix": "1345980847",
  "containsAdultContent": false,
  "uploadedBy": "animaphotic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84330",
      "name": "The Skyrim Gate Room - Main",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "50",
      "fileName": "The Skyrim Gate Room - Main-23079-1-0.rar",
      "uploadedUnix": "1345980847",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e284cb082fa45f15b48a77951215a5954de19709006e086f65070d7bc057b42b/analysis/1407122765/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Skyrim%20Gate%20Room%20-%20Main-23079-1-0.rar?fid=84330&ttl=1535793059&ri=8192&rs=8192&setec=d2f5e277b691b6b711e4eac331f7039c"
    }
  ]
}