{
  "modId": 23076.0,
  "modName": "Flaming Daedric Swords",
  "summary": "This mod adds a new enchant to the game for the Daedric Sword which will make the blade come alive with dancing flames",
  "descriptionHtml": "New Enchantment Effects mod Alpha\r\n\r\n--------------------------\r\n\r\nThis mod adds a new craftable sword (listed under Daedric smithing) called the Daedric Blood sword that comes standard with a weak absorb health enchant.  The purpose of this craftable sword is simply to make it and then Disenchant it to learn the Daedric Absorb Health enchant.  You can then enchant any standard Daedric Sword (technically any weapon at all, but the effect won\\'t look right on any other type of sword/weapon) to get a very cool flaming sword effect.\r\n\r\nWhy did I pick Absorb Health when it looks like fire?  Because Absorb Health is the enchant I use the most, and I made this mod for myself first and then decided to release it later.  This could be changed easily enough to be assigned to any enchant you want, and feel free to do so in the Creation Kit.\r\n\r\nThe reason the enchant only works properly on the 1 handed Daedric Sword is because it\\'s based off of the Bound Weapon enchant effect (which is the same model as the Daedric Sword).\r\n\r\nNote that this isn\\'t just a weapon skin enchant animation, it\\'s a full on \\\"blade with fire coming off of it\\\" type of effect based off of the Bound Weapon spells with numerous modifications.\r\n\r\n-------------------------\r\n\r\nTo install this mod just copy the esp file to your data directory and the RLGNewEnchantEffect17 nif file to the data/meshes/weapons/RLG/ folder as it\\'s laid out in the zip file.",
  "categoryId": "55",
  "version": "0.1",
  "author": "Senlur",
  "createdUnix": "1345974874",
  "updatedUnix": "1345974962",
  "containsAdultContent": false,
  "uploadedBy": "Senlur",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84313",
      "name": "RLGEnchantEffects",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "267",
      "fileName": "RLGEnchantEffects-23076-0-1.7z",
      "uploadedUnix": "1345974962",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/6aca89d32a2277a284ffc08a23ed2f8c5e8a559172c8079da0c5f9e646a4dfbc/analysis/1407122587/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RLGEnchantEffects-23076-0-1.7z?fid=84313&ttl=1535793055&ri=8192&rs=8192&setec=46eb194257b5a8336cb6f06db06390bc"
    }
  ]
}