{
  "modId": 23091.0,
  "modName": "Riverside Keep",
  "summary": "A very best, no load door player home, with 3 rich merchants, a follower serving, and more than enough displaying stuff.",
  "descriptionHtml": "A relatively big player home, and relatively small castle just beside Riverwood. \r\n\r\nAfter having the \\\"My Home Is Your Home\\\" mod, I cant help to collecting followers, and thus the old house simply not big enough. Also, display cases and rack are really what we want, right? Mods offering big enough and much enough display cases always got load door, what really make me sad! And nice house mod always far away from towns so that i sell my things hardy. So i created this a small keep, with NO LOAD DOOR, 3 RICH MERCHANTS, MANY DISPLAY CASES and meanwhile NOT TOO BIG IN SIZE TO LOAD, plus, a SECRET TREASURE ROOM!  \r\n\r\n\r\nWhat this mod gives you:\r\nA Keep to live, located just near Riverwood\r\nSome 10 display cases and mannequins and 30+ weapon rack, tested works.\r\n3 rich merchants sell and buy things, sleep, eat and doing their living inside.\r\n1 Follower copied from Mjoll, while a bit stronger than, is ready to follow you.\r\nSome 10 chest, safe for store your staff. BUT NOT THOSE BARREL, you know, food should gonna rotten in fact.\r\nA nice bathroom.\r\nA nice dining room.\r\nA fully working blacksmithing room.\r\nA nice master room with secret treasure room, with even more display rack and mannequins.\r\n10+ beds for your followers to live!\r\nNavmesh very nicely done for both interior and exterior.\r\nA map marker is set, so you can fast travel to there after you first discover it. \r\n\r\n\r\nLocation:\r\nYou can not miss the village and keep if you follow the path from Helgen cave to Riverwood.\r\nActually you should find a big bridge connecting it by the southern exit of Riverwood.\r\n\r\n\r\nEntrance:\r\nFor now, just find your way(for e.g. using console tcl) to the top of the castle, a chest is sitting just beside the dome, and YOU HAVE TO HAVE THAT KEY to get in. Look at the picture for the location.\r\nA quest to get the ownership of the keep and the whole village will lives someday... when i am free enough, and if enough encoruagements comes from you!\r\n\r\n\r\nRecommendations:\r\n****Backup your save before using this, or any other mod, for safe.\r\n**Those nice looking armor are not included in this mod. They were made by Hentai, i like them very much, but it is not a must to run this mod.\r\n**I recommend \\\"My Home is Your Home\\\" and \\\"spouse can live everywhere\\\" mod, for best role playing feeling with this keep, but it is not a must to run this mod.\r\n\r\n\r\nFeed back and suggestions:\r\nI tested the keep MANY times to make it work like this, but if any error found, please let me know.\r\n\r\n\r\nUPDATE NOTE:\r\n1.1 All 4 servants in keep now can not die.",
  "categoryId": "67",
  "version": "1.1",
  "author": "halordy",
  "createdUnix": "1345993515",
  "updatedUnix": "1345996538",
  "containsAdultContent": false,
  "uploadedBy": "halordy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84402",
      "name": "riversidekeep",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "244",
      "fileName": "riversidekeep-23091-1-1.rar",
      "uploadedUnix": "1345996538",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/27d3d204c237813823379da9565212d9f819e76d44fcd32c38503a573e483632/analysis/1407123427/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/riversidekeep-23091-1-1.rar?fid=84402&ttl=1535793081&ri=8192&rs=8192&setec=283592d5aa8c9cd1d2a2cd059cc8b4df"
    }
  ]
}