{
  "modId": 23098.0,
  "modName": "Riften Exposed - Maven - Dawnguard and Hearthfire compatible",
  "summary": "A series of quests to clean up Riften&#39;s crime.",
  "descriptionHtml": "[img]http://i.imgur.com/U3D2mwG.png[/img]\r<br />\r<br />EDIT: 0.85,  something decided to cease working out of the blue and Maven no longer functions quite right. Working to fix it.\r<br />\r<br />Bam, 0.85:\r<br />\r<br />I tried my best to make it compatible with the most recent version of Skyrim; fixed refs, tinkered with scripts and quest, etc.\r<br />\r<br />Tell me if it works or not in the comments section, only issue I&#39;ve run into so far is that Maven does not attack when resisting arrest; but from the looks of it CK is considering all the scripts to be corrupt somehow so I&#39;m amazed that it&#39;s even working in the first place to be honest.\r<br />\r<br />\r<br />\r<br />\r<br />_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-EVERYTHING BELOW IS INCREDIBLY OUTDATED BY YEARS NOW_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-\r<br />\r<br />Current Version: 0.68  Compatible with Thieves Guild questline,  Not compatible with civil war imperial side.\r<br />\r<br />Part 1 of Riften Exposed is basically done for now.\r<br /> Added a quest to expose Maven Black-Briar- find an incriminating note linking her to the Dark Brotherhood to begin the quest.\r<br />\r<br />Version: 0.77:  Allows you to even do the quest itself, forgot to add some files to the download it appears.\r<br />\r<br />Version 0.69: Just changed the Alias from being directed at letter, to just being the letter in general.  Should fix the issue of people not getting the quest when they picked up the letter.\r<br />\r<br />Version 0.67: Allows you to potentially finish the thieves guild with no Maven.  May not be stable\r<br />\r<br />Version 0.55: added the basic quest, I still need to make it compatable with the thieves guild and anything that had to do with Maven Black-Briar.  As well as remove any dialog about her after she&#39;s gone.\r<br />\r<br />Next Update: Remove Dialog about Maven after shes gone.  Fix bug where Maven does not fight. \r<br />\r<br />Update After Next: Add better dialog.   Fix issues with having to do wth Thieves guild questline, and imperials questline.  And perhaps Cut together voices (Oh fun..)\r<br />\r<br />Plans after the dreaded Update After Next Update:   Riften Exposed: The Sewer Thieves..\r<br />\r<br />\r<br />For people curious how progress is going on the next patch:\r<br />I&#39;m taking a short break for maybe a day to see if I get any feedback.\r<br />\r<br />Also if you&#39;re wondering why I said &#34;hearthfire compatable&#34;, I&#39;m just annoyed at the other mod with a &#34;hearthfire ready&#34; in it&#39;s title since Hearthfire is NOT even released yet.  Regardless, should work just fine with it obviously.",
  "categoryId": "35",
  "version": "0.85",
  "author": "Tentain Shade",
  "createdUnix": "1346001611",
  "updatedUnix": "1347612713",
  "containsAdultContent": false,
  "uploadedBy": "Tentain",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88346",
      "name": "Riften Exposed V0_80",
      "version": "-0.80",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "516",
      "fileName": "Riften Exposed V0_80-23098-0-80.rar",
      "uploadedUnix": "1347612713",
      "modVersion": "-0.80",
      "virusScanUrl": "https://www.virustotal.com/file/ee94ff46db0f7bbdc0408cbc64daa53bd43fa0184c6fad16f58dfe388998ab53/analysis/1407164344/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riften%20Exposed%20V0_80-23098-0-80.rar?fid=88346&ttl=1535793089&ri=8192&rs=8192&setec=0c754912847ba8424e34ef86776d7afd"
    }
  ]
}