{
  "modId": 23129.0,
  "modName": "Companions Arise",
  "summary": "Companions train, fight, eat and drink themselves merry!\r\n\r\nThe aim of my mod is to add some life to the Companions; to make it a richer and more immersive experience. To be what I always thought it should have been.\r\n\r\nA lot of changes have been made to the way things were; read below to find out!",
  "descriptionHtml": "[size=90][b]Companions Arise![/b][/size]\r\n\r\n[b]Companions train, fight, eat and drink themselves merry!\r\n\r\nThe aim of my mod is to add some life to the Companions; to make it a richer and more immersive experience. To be what I always thought it should have been.\r\n\r\nA lot of changes have been made to the way things were; read below to find out!\r\n\r\nIMPORTANT!!! READ THE QUEST NOTES, ELSE YOU WON\\'T BE ABLE TO COMPLETE THE QUEST LINE.\r\n\r\nREQUIRES NEW CHARACTER, WILL NOT FUNCTION PROPERLY ON OLD SAVES (Farkas\\' outfit, I think that\\'s about it for issues unless you have already been to Jorrvaskr and joined up)[/b]\r\n\r\n[size=80][b]Companions[/b][/size]\r\n\r\n[b]Followers:[/b]\r\nAthis, Njada, Ria and Torvar are available as followers as soon as you join the Companions (made no sense before that no-one would follow you till you became Harbinger)\r\n\r\nAdded a dog to the Jorrvaskr who you can ask to follow, wait and dismiss (he is better at sneaking and a little bit more powerful than a regular mutt, as well as being essential)\r\n\r\n\r\n[b]Universal:[/b] \r\nGave all companions except Aela a Skyforged bow and arrows\r\nSet to level with player up to 55 for companions and 60 for circle members\r\nCompanions train outside with the dummies on a rotor\r\nDinner time together in the Jorrvaskr (8pm)\r\nSleep in their own beds (11pm)\r\n\r\n[b]Specific:[/b]\r\nDue to the many indescrepancies between vanilla equipment and skills possessed or dialogue specifically relating to certain weapons type which SHOULD have been weilded, the following changes have been made:\r\n\r\n[b]Kodlak:[/b] Gave Skyforged Warhammer, changed behaviour to hang around the Jorrvaskr hall instead of his bedroom \r\n[b]Skjor:[/b] Gave Companions Wolf Shield, gave fuller head of hair to make relationship with Aela more believable and make him look younger than Kodlak.\r\n[b]Farkas:[/b] Gave Companions Wolf Armour, fixed so that he wears it and keeps his weapon before and after werewolf transformation. Made him slightly taller and increased weight to 100.\r\n[b]Vilkas:[/b] Was fine\r\n[b]Aela:[/b] Gave Supple Draugr Bow\r\n[b]Torvar:[/b] Gave Skyforged Battle Axe, Banded iron armour, changed colour and style of hair\r\n[b]Njada:[/b] Gave Companions Shield, Skyforged Steel Axe, Scale Armour, gave her a blind eye and changed hair colour, made her a little heavier\r\n[b]Athis:[/b] Gave Skyforged Steel Short swords, made dual wield, Heavy/light armour mix (credit to PrivateEye for shortswords)\r\n[b]Ria:[/b] Gave Skyforged Greatsword, Iron armour\r\n[b]Eorlund:[/b] Gave Blacksmith clothes\r\n\r\n[size=80][b]Jorrvaskr[/b][/size]\r\n\r\nAlloted a specific bed for each companion\r\nAdded a little decoration to the barracks in basement and Kodlak\\'s room\r\nAdded Safe chests in the barracks with the player\\'s name\r\nAdded Jon Battleborn as a bard who plays during the Companions guild dinner time\r\nChanged the music inside the Jorrvaskr to a tavern theme\r\nChanged the position of dummies a little and added another archery target\r\nAdded a bench and another idle position in the courtyard\r\nAdded a backboard between the beams of the Jorrvaskr Porch (credit to Deandra of Uesp forums for modelling and help with getting it into the game)\r\nAdded a chandelier outside in the porch (as they train till 8pm, it tends to get a little dark)\r\n\r\n[size=80][b]Armour[/b][/size]\r\n\r\n[b]Added:[/b]\r\nCompanions Wolf Shield\r\n[b]Changed:[/b]\r\nWolf armour is now equal to Steel Plate (only available once joinging the circle; given during quest)\r\nAncient Nord Armour is now equal to Ebony\r\n\r\n[b][size=80]Weapons[/size][/b]\r\n\r\n[b]Added:[/b] \r\nSkyforged Warhammer\r\nSkyforged Mace\r\nSkyforged Shortsword\r\nSkyforged Bow\r\nSkyforged Arrows\r\n[b]Fixed:[/b]\r\nSkyforged Dagger upgradable\r\nNord Bow upgradable\r\n[b]Changed:[/b]\r\nWuuthrad is now more powerful, faster and has an enchant that *ACTUALLY* does damage to Elves (lightning)\r\n\r\n[size=80][b]Quests[/b][/size]\r\n\r\n[b]More radient quests:[/b]\r\n7 before Proving Honor\r\n4 before the Silver hand\r\n6 after Silver hand, then infinite (see below for details)\r\n\r\n[b]Proving Honour:[/b] Extended the spider area by about 2X, added in a bunch more of them so that it is really something to be scared of (Farkas you wimp).\r\n\r\n[b]The Silver Hand:[/b] Aela now gives wolf armour when the player is naked (it went weird when I archived, so now they can be found next to the log where you spawn) corpses and blood of fallen silver hand members litter the hallway down into the dungeon (show that Skjor has been there), added several more enemies in various locations.\r\nExtended the time from 5 to 20 minutes for you to get back to the Jorrvaskr and tell them of Skjor\\'s death (in order to hear their reactions).\r\n\r\n[b]Other:[/b] Made the giant at the start a bit beefier, so more likely to be alive long enough for a fight.\r\n\r\nEorlund now gives new options for free weapon dialogue (warhammer, mace, shortsword and bow)\r\n\r\n[b]QUEST NOTES:[/b]\r\n\r\nAfter Skjor dies, you will get 7 radient quests from Aela. You will then be stuck getting radient quests from Farkas and Vilkas for infinity... when you get bored of this, type\r\nplayer.setstage c04 10\r\ninto the console in order to start \\\"Blood\\'s Honor\\\"\r\n\r\n\r\n[b][size=80]Issues[/size][/b](none major)\r\n\r\n[b]Athis and Njada:[/b]\r\n\r\nThe fist fight between Athis and Njada begins with weapons out, and goes on for a long, long time, but still works ;P You can just exit the room and come back and it\\'ll end if you don\\'t wanna hang around for 2 or 3 minutes.\r\n\r\nNjada has a pretty obvious seam between her neck and body, I have tried to cover this up a little by giving her leather armour instead of scale.\r\n\r\n[b]Jon Battleborn:[/b]\r\n\r\nIf you are present when Jon enters the room to be a bard, he will not generally reach his destination, and will instead start miming with his instruments. This can be fixed by re-entering the room; he will then go to his play spot and start performing. After having made one request, Jon will again start miming instead of playing, but can again be fixed by re-entering the room. Both of these are sometimes fixed by waiting.\r\n\r\nJon sometimes plays for too long and keeps the companions awake after hours, this can be fixed by re-entering room (who would have guessed?)\r\n\r\nAfter archiving, Jon sometimes doesn\\'t stop playing at bedtime. This seems to be sporadic and differs from visit to visit. \r\n\r\n[b]Skyforged Shortsword:[/b]\r\n\r\nModel in menu doesn\\'t display correctly, but by all other accounts works fine\r\n\r\n[b]The Silver Hand:[/b]\r\n\r\nIf the player when turned into a werewolf runs around and attacks people, Aela may become aggressive after the blackout. She will not attack, but she will refuse to follow and be unresponsive. If you enter the dungeon and wait for a few hours, she will usually appear inside and return to normal (if she doesn\\'t, wait longer)\r\n\r\nSee \\\"quests\\\" for information about Wolf armour\r\n\r\n[b]Farkas:[/b]\r\n\r\nAfter becoming a werewolf, sometimes becomes naked through that part of Dustman\\'s Cairn. Puts his armour back on when you go deeper inside the dungeon, through the door to Dustman\\'s Crypt.\r\n\r\n[b]Eorlund:[/b]\r\n\r\nOf the new free weapon options he gives, the mace gives an incorrect weapon (staff of chain lightning). The audio for one of the dialogue options doesn\\'t work, but functions properly still (can\\'t remember which one, either bow or shortsword)\r\n\r\n[b]Training, eating, sleeping:[/b]\r\n\r\nThis doesn\\'t start until after you have given Aela her shield from Eorlund, Farkas has led you to your room and given you the task of punching someone\\'s face in. After you hand it in, everything works (this is caused by quest script from vanilla forcing people into the basement during this time for introduction purposes).\r\n\r\n[b][size=80]What I would like to do[/size][/b]\r\n\r\nI have many ideas for quests that would improve the flow of the questline already written up (quests before the trial/initiation of Dustman\\'s Cairn to introduce you to the lower members of the guild/hands-on tutorial on weapons and tactics, and before/after Skjor\\'s death). I began creating them, but ran out of time as university begins in a few weeks.\r\nDetails can be found at: \r\nhttp://forums.uesp.net/viewtopic.php?f=39&t=31909\r\n\r\nBrawling whenever you want with appropriate members of the guild\r\n\r\nSparring in the courtyard during the day with other companions\r\n\r\nTraining on the dummies for slow skill gains\r\n\r\nTraining quests (eg perform a specific task given by Farkas such as running around an assault course to increase heavy armour skill)\r\n\r\nAn epic quest (difficult, multi-part) to obtain Ysgramor\\'s armour after the main quest line.\r\n\r\n[b][size=80]Special thanks:[/size][/b]\r\n\r\nDeandra of the Uesp forums for her help and support in the making of this mod\r\n\t\r\nShortswords for Skyrim by PrivateEye (I used the steel short sword for Athis\\' weapons)\r\n\r\nDarkfox127 and SpiralDynasty for tutorials on youtube\r\n\r\nMy mum for voicing Aela (haha)",
  "categoryId": "79",
  "version": "0.0",
  "author": "Deadarmour",
  "createdUnix": "1346026542",
  "updatedUnix": "1346027386",
  "containsAdultContent": false,
  "uploadedBy": "deadarmour",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84508",
      "name": "CompanionsArise",
      "version": "0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2133",
      "fileName": "CompanionsArise-23129-0-0.rar",
      "uploadedUnix": "1346027386",
      "modVersion": "0.0",
      "virusScanUrl": "https://www.virustotal.com/file/5a386e8ef4409c86ca17b34e70a790a1f0093d520d3a72a028f795a27f2558be/analysis/1407124709/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CompanionsArise-23129-0-0.rar?fid=84508&ttl=1535793141&ri=8192&rs=8192&setec=df481d2c8a03488e173dd43a83269471"
    }
  ]
}