{
  "modId": 23134.0,
  "modName": "Rendspire Palace Reborn",
  "summary": "This is Rendspire Palace Reborn, one of the largest, most detailed player homes available anywhere for Skyrim. The palace contains an equally large, secret armory, adding to the already massive amount of storage space. Rendspire Palace Reborn adds display cases with weapon snapping, mannequins, and an entire palace staff, including guards with...",
  "descriptionHtml": "Help others discover Rendspire Palace Reborn&#33; Please endorse&#33;\r<br />\r<br />NOTE: If upgrading from a prior version, please read the &#34;installation&#34; section.\r<br />\r<br />I&#39;ve added SPOILERS to the readme section on this site which describes locations of all keys, secret rooms, etc.\r<br />\r<br />Version 3.07 Change Log\r<br />Changes:\r<br />- Removed the key boxes from the hidden rooms.  The keys are still required to access the teleports, but I placed them loose as clutter in the room, instead of within a container.\r<br />- Expanded Providence to include extra storage for convenience. \r<br />- Reorganized the layout of the storage section within the hidden armory to make it easier and more convenient to use.  I added additional stairs as well (see screenshot).\r<br />- Reworked interior design of the melee practice area within the training quarter.\r<br />- Removed forge supply storage chest from the hidden armory.\r<br />- Removed respawning forge supply chests from sub-level west.\r<br />- Added 22 more mannequins (10 in Providence, 12 in the hidden armory).\r<br />- Tweaked the map room slightly.\r<br />- Relocated several teleport stones within the hidden armory.\r<br />- Various clutter and navmesh tweaks.\r<br />\r<br />Version 3.03 Change Log\r<br />Bug fixes: \r<br />- Fixed static limit issue regarding worldspace cell loading.\r<br />Changes: \r<br />- Various clutter and outfit tweaks.\r<br />\r<br />Version 3.0 Change Log\r<br />Bug fixes:\r<br />- Fixed a minor texture seam in the hidden armory.\r<br />- Fixed navmesh error in the office within the Lord&#39;s Private Chambers.\r<br />- Fixed texture gap in the door leading to the dungeon.\r<br />- Fixed texture gap on the cliffs surrounding the dam in the canyon.\r<br />Changes:\r<br />- Added eight hidden rooms / areas throughout the palace.  Moved all interior palace teleport stones into hidden rooms.  There are now six teleport stones specific to the palace interior.  A few of the old stones have been completely transplanted.  One of the new secret areas is not accessible by teleport stone.\r<br />- Added navmesh around the statue of Mara in the hidden armory.\r<br />- Added a secret cave garden to the Nordic ruins for alchemists.\r<br />- Added a new cell called &#34;Rendspire Foundation&#34; below the sub-levels.\r<br />- Converted the Training Quarter into a public armory based on the original from my mod, &#34;Honeyside Sweetener&#34;.\r<br />- Added a new cell for the Training Quarter.\r<br />- Removed the teleport stone to Whiterun.  Added a map room (one of the hidden rooms) which features five teleport stones which teleport to just outside each of the major, walled cities.  These teleports only go one way.\r<br />- Doubled the variety of guards.\r<br />- Edited and expanded living quarters to allow for more guards.  The number of uniformed guards has nearly doubled with this version.  Xia Maeva now has her own semi-private room.\r<br />- Remade the follower, &#34;Shalice Viamura&#34; (the court wizard) based on the one from my mod, &#34;Rendspire Companions&#34;.\r<br />- Added a public enchanting and alchemy lab to the Great Hall.\r<br />- Added an additional entrance to the Dungeon Guard Quarter (you no longer have to go through the dungeon to get to it).\r<br />- Added a new NPC priest.\r<br />- Added all of the shrines for the Nine Divines, and all of the Doomstones (four of which are in the Canyon of Tears, and the other nine are in the secret cave garden).\r<br />- Various architenctual tweaks in the sub-levels to allow for the new cells.\r<br />- Removed excess webs from the Nordic ruins and from Providence.\r<br />- Updated various AI packages, navmesh and clutter tweaks.\r<br />\r<br />\r<br />\r<br />\r<br />Warning: This video may contain spoilers.\r<br />[youtube]tcXxThb5fjs&feature=colike[/youtube]\r<br />Many thanks to ShadowKong421 for his excellent 10 minute walkthrough of Rendspire Palace. There version featured here I believe is version 2.1  \r<br />(And I&#39;m getting rid of that platter with the nasty physics in future versions... I could never get it to sit still either.)\r<br />\r<br />\r<br />\r<br />\r<br />This is Rendspire Palace Reborn, one of the largest, most detailed player homes available anywhere for Skyrim. The palace contains an equally large, secret armory, adding to the already massive amount of storage space. Rendspire Palace Reborn adds display cases with weapon snapping, mannequins, and an entire palace staff, including guards with their own set schedules, a merchant, a blacksmith, a bartender, a fence, and seven followers. \r<br />\r<br />The palace is free. Happy birthday.\r<br />\r<br />** Please be aware that this mod is designed for higher performance computers. **\r<br />\r<br />Containers meant for storage throughout the palace are marked &#34;(Safe)&#34;. You&#39;ll find them mainly in the south wing library, the office in the north wing, the Lord&#39;s Chamber, the secret Armory, and other secret rooms. The palace cells will reset, and I can&#39;t promise that containers not marked as safe won&#39;t respawn, so you&#39;ve been warned.  (Loose items on mannequins, plaques, display cases, or on the floor or whatever, do not disappear when the cell resets.)\r<br />\r<br />Due to the size of the palace, I&#39;ve added teleport stones which can be used to fast travel between important rooms and areas.  There are several sets of teleport stones, most of which require keys to unlock before they can be used.  As of version 3.0, the palace teleport stones each have keys placed in the hidden room that the stone is located in, thus the room must be discovered before the stone can be used (I don&#39;t think they&#39;re too hard to find, though).  The secret armory teleport stones also have a single key which unlocks all of those teleport stones.\r<br />\r<br />I&#39;ve added SPOILERS to the readme section on this site which describes locations of all keys, secret rooms, etc.\r<br />\r<br />\r<br />\r<br />\r<br />LOCATION:\r<br />\r<br />Rendspire Palace is located just southwest of Whiterun through &#34;Providence&#34; in the Canyon of Tears (see screenshot). Fast travel is enabled.\r<br />\r<br />\r<br />\r<br />\r<br />COMPATIBILITY:\r<br />\r<br />This mod has been cleaned to ensure maximum compatibility with minimal edits to the core game. Additionally, Rendspire Palace occupies its own worldspace in order to reduce mod conflicts.\r<br />\r<br />This mod is compatible with all official DLC. None of the official DLC is required.\r<br />\r<br />- Cell (3, -6) located S, SW of  Whiterun contains the entrance to &#34;Providence&#34;, which ultimately leads to the palace. Edits made to this cell by other mods will probably cause conflicts.\r<br />- Rendspire Palace adds a book to one of the leveled lists. I can&#39;t imagine that this would cause any issues, but in the interest of full disclosure, there you have it.\r<br />- (Version 2.12) Rendspire Palace adds a teleport stone to the city of Whiterun. Edits made to the city of Whiterun by other mods *MIGHT* cause a minor conflict.\r<br />- (Version 3.03) Adds teleports outside of the five major walled cities. Edits made to these world spaces by other mods *MIGHT* cause a minor conflict.\r<br />\r<br />This mod will obviously conflict with older versions of Rendspire Palace. In other words, don&#39;t run multiple versions at the same time.\r<br />\r<br />\r<br />\r<br />\r<br />INSTALLATION:\r<br />\r<br />For new installs, copy the &#34;Data&#34; folder to your &#34;Data&#34; folder and activate the esp, or feel free to use NMM (recommended).  \r<br />\r<br />** If upgrading from a version of Rendspire Palace PRIOR TO version 2.12, this must be done using a clean save by following these steps:\r<br />     1) TAKE EVERYTHING OUT OF STORAGE WITHIN THE OLD VERSION OF RENDSPIRE PALACE THAT YOU DON&#39;T WANT TO LOSE. Save the game anywhere where none of the Rendspire Palace cells are loaded. (I would also recommend avoiding the area south, southwest of Whiterun.)\r<br />     2) Disable the old version of Rendspire Palace. Load the saved game and save it again with Rendspire Palace disabled.\r<br />     3) Enable the new version of Rendspire Palace. This effectively resets the mod.\r<br />\r<br />** If Upgrading from version 2.12 or 3.0 to version 3.03, of course I always recommend a clean install, or at the very least, keep a backup of your latest save game.  However, most everything stored should carry over seamlessly to the new version.  If you choose not to do a clean install, there are four points that you need to be aware of:\r<br />     1) Version 3.0 and later completely rebuilds the Training Quarter.  If you have anything stored in the training quarter in any capacity that you don&#39;t want to lose, take everything out of that cell.\r<br />     2)  I&#39;ve had to remove many of the display cases and mannequins that were in the Great Hall due to another issue.  Again, if you have anything stored there that you don&#39;t want to lose, please remove it from that cell.\r<br />     3)  I&#39;ve made a conscious effort to retain all other safe storage containers (with the above exception), however a few of them have been slightly moved.  Be aware of that in case you&#39;re looking for a particular storage container.\r<br />     4) One of the NPC&#39;s, Shalice Viamura, has been rebuilt - including that she is now a Nord instead of Breton. This change will probably leave a noticable tear along her neck seam which can be corrected by using the following steps:\r<br />- Open the console (the &#34;~&#34; key)\r<br />- Click on Shalice Viamura and type, without quotes:\r<br />&#34;setnpcweight 1&#34;\r<br />- You&#39;ll notice that this corrects the neck seam, but that her facial tinting has also been eliminated.\r<br />- Still with Shalice Viamura selected, type without quotes:\r<br />&#34;disable&#34;\r<br />and she will disappear. If you click anywhere, you&#39;ll deselect her... so don&#39;t click anywhere.\r<br />- Again, with her still selected, immediately type, without quotes:\r<br />&#34;enable&#34;\r<br />and she&#39;ll be back with the correct facial tinting.\r<br />- Close the console (the &#34;~&#34; key) and save the game. You should be good to go.\r<br />\r<br />** If Upgrading from version 3.03 to 3.07, be aware that this version removes some safe storage containers including all of the key boxes in the hidden rooms, the light & heavy armor lockers in the map room, and a forge supply storage container in the hidden armory.  Otherwise everything *should* transfer over seamlessly.  Again, please keep a backup of your save prior to upgrading.\r<br />\r<br />\r<br />\r<br />\r<br />PERMISSIONS:\r<br />\r<br />You can do whatever you want with this mod.  Just, please give me any due credit.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />NOTES:\r<br />\r<br />- As of version 3.0, most of the hidden rooms / areas is accessible by activating a hidden lever or switch (with one exception).  The text on many of the hidden doors incorrectly displays that the door can be activated, but in reality, most of them require a hidden switch.  For all the secret doors which require a hidden switch to open, there is at least one interior switch inside the room and one exterior switch outside the room, so that the door can be opened or closed from either side.\r<br />\r<br />- As of version 3.0, teleport stones within the palace require their own specific key to unlock.  The key to unlock them is in the hidden room corresponding to that stone (all of the palace teleport stones are in hidden rooms).  This means that you must locate the hidden room in order to unlock the teleport stone that teleports to it.  This does not include the secret armory teleport stones which are largly unchanged from the previous version of this mod.\r<br />\r<br />- The weapon snapping feature of the display cases is accomplished using hidden weapon mounts, which does have a few oddities.  Maces sink into the display case a bit, and magical staffs don&#39;t quite fit completely into the case.  Additionally, the display cases are not meant for non-weapon items... attempting to store things manually in the display case could potentially cause some issues with the weapon snapping and therefore I wouldn&#39;t recommend it.\r<br />\r<br />- While in the Canyon of Tears, the compass displays the directions incorrectly. If anyone knows how to fix this, please let me know. (Northmarkers don&#39;t seem to work in worldspaces...)\r<br />\r<br />- (Version 2.0 - 2.12) The teleport stone TO Whiterun allows you to use it without the key.  I&#39;m sure it probably has to do with location, but I&#39;m not sure how to fix it yet.\r<br />\r<br />- Certain parts of the Canyon of Tears and the hidden armory do not have navmesh.  This is on purpose, folks.  Just be aware that your followers can&#39;t follow you EVERYWHERE... most everywhere, though.\r<br />\r<br />- The palace is not meant for jumping on top of, or behind. Trust me, there&#39;s really nothing there to find, and you could get stuck... so just don&#39;t do it. (I&#39;m sure someone will do it anyway...)\r<br />\r<br />- Magnus Gaul is an Orc follower who loves you and will give you access to Orc strongholds without really any effort on your part... kind of an unintended consequense of adding an Orc follower, I guess.\r<br />\r<br />- (MINOR SPOILER) There are three palace keys which are located in the secret armory in a display case by the statue of Mara... you&#39;ll have to do a little swimming, or use a teleport stone to get there. The key to the secret armory teleport stones is in the posession of a master vampire who lives in the hidden armory.\r<br />\r<br />- If anyone is experiencing issues with ownership of the palace, please read:\r<br />There is a quest which runs transparently in the background which gives the Rendspire Palace Faction to the player (and thus giving ownership) when the mod starts for the first time. For a few folks, it sounds like there may be an issue either with the quest initiating, or completing the faction assignment. Unfortunately, it&#39;s not an issue I&#39;ve ran into or been able to replicate, but as a work around, please follow these steps:\r<br />\r<br />1) Open the console (the &#34;~&#34; key)\r<br />\r<br />2) Type the following exactly, including quotes:\r<br /> Help &#34;Rendspire Palace Faction&#34; 0\r<br />\r<br />3) You&#39;ll receive a series of lines that populate on the console. Look for the following line and take note of the &#39;FACTION&#39; ID:\r<br /> FACT &lt;FACTION&gt; &#39;Rendspire Palace Faction&#39;\r<br />\r<br />4) Type the following exactly, substituting &#39;FACTION&#39; with the ID from the prior step:\r<br /> Player.addtofaction FACTION 0\r<br />\r<br />5) Close the console (the &#34;~&#34; key) and save the game.\r<br />\r<br />\r<br />\r<br />\r<br />I&#39;ve made my character (featured in the &#34;girl not included&#34; screenshot) available as a Nord preset based on a request I received, which can be downloaded here:\r<br />http://skyrim.nexusmods.com/mods/25800\r<br />\r<br />Each of the companions for this mod are available as a stand-alone download here:\r<br />http://skyrim.nexusmods.com/mods/23764\r<br />\r<br />If you like this mod but are looking for something a bit smaller, check out these mods I made -\r<br />Honeyside Sweetener:\r<br />http://skyrim.nexusmods.com/mods/20959\r<br />Dragon Master Armory\r<br />http://www.nexusmods.com/skyrim/mods/56227",
  "categoryId": "67",
  "version": "3.07",
  "author": "Shoeski11",
  "createdUnix": "1346042685",
  "updatedUnix": "1349578232",
  "containsAdultContent": false,
  "uploadedBy": "Shoeski11",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84541",
      "name": "Rendspire Palace Reborn",
      "version": "2.12",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6833",
      "fileName": "Rendspire Palace Reborn-23134-2-12.zip",
      "uploadedUnix": "1346042813",
      "modVersion": "2.12",
      "virusScanUrl": "https://www.virustotal.com/file/003bbf9371627e827c84c78479907f5f4b0ad39428521610e9a73e71fb0a0c86/analysis/1407125063/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rendspire%20Palace%20Reborn-23134-2-12.zip?fid=84541&ttl=1535793145&ri=8192&rs=8192&setec=3fc6aaf8166f407d3124b274ac307998"
    },
    {
      "fileId": "90629",
      "name": "Rendspire Palace Reborn",
      "version": "3.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8774",
      "fileName": "Rendspire Palace Reborn-23134-3-03.zip",
      "uploadedUnix": "1348717914",
      "modVersion": "3.03",
      "virusScanUrl": "https://www.virustotal.com/file/658feae86987d40625bb15999ea6c79d7dae1ddfd51f37a2445ea8a27faeabda/analysis/1407188946/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rendspire%20Palace%20Reborn-23134-3-03.zip?fid=90629&ttl=1535793146&ri=8192&rs=8192&setec=c78a955715d379ea0f85d7f792952a53"
    },
    {
      "fileId": "92495",
      "name": "Rendspire Palace Reborn",
      "version": "3.07",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8783",
      "fileName": "Rendspire Palace Reborn-23134-3-07.zip",
      "uploadedUnix": "1349578232",
      "modVersion": "3.07",
      "virusScanUrl": "https://www.virustotal.com/file/8c68d8a9b0472c50b2130dbb90f8a313a5a1832c5590226d503895aac54963be/analysis/1407207668/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rendspire%20Palace%20Reborn-23134-3-07.zip?fid=92495&ttl=1535793146&ri=8192&rs=8192&setec=7ba29080544c48045c052727128e5442"
    }
  ]
}