{
  "modId": 23149.0,
  "modName": "Stray Dog Fix",
  "summary": "Stray Dog can be rehired.",
  "descriptionHtml": "I was pissed off by the fact that when you dismiss stray dog it cant be ever your follower again, so i looked for mod that fixes this. Didnt found one. So i made it. Now when you say dog to go home, you can get it as follower later, just activate dog 2 TIMES.\r\n\r\nAs you may know, dismissed stray dog will return to last position it said to wait in. This is great if you want to have dog at your house or farm or camp or whatever. It will walk around where you want and look cool, and with this fix you can pick it up anytime and go hunt some dragons.\r\n\r\nThis mod does not fixes dog from dissapearing without reason (or maybe it is, but i didnt intended it. If it does - better), to fix dissapeared dog use YOUR_DOG_REF_ID.resurrect command from the console or look in the internet if you have no idea what i mean.\r\n\r\nThis mod can NOT break your skyrim so you have to reinstall. It can cause CTD on very very old version of skyrim or on unupdated non-steam versions that dont have [b]Update.esm[/b] file. I suggest you to get this file cos it fixes some bugs and many mods depends on it (so cause CTD if it you dont have one)\r\n\r\nYou can use this in any of your mods, no need to ask for my permission.",
  "categoryId": "95",
  "version": "1.0",
  "author": "DarkPhoenixxx",
  "createdUnix": "1346074144",
  "updatedUnix": "1346074208",
  "containsAdultContent": false,
  "uploadedBy": "DarkPhoenixxy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84614",
      "name": "Stray Dog Fix",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Stray Dog Fix-23149-1-0.rar",
      "uploadedUnix": "1346074208",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/dabffc04e0c5caca884dafade2c889d55f843da05f7e97a79edcafabfcb7c8d5/analysis/1407125789/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stray%20Dog%20Fix-23149-1-0.rar?fid=84614&ttl=1535793174&ri=8192&rs=8192&setec=016b25ccb8ce23bdfc00d87882f83328"
    }
  ]
}