{
  "modId": 23146.0,
  "modName": "3D Vision ENB",
  "summary": "3d Vision (Nvidia\\'s stereoscopic 3d) and ENB Series (by Boris Vorrontsov, even the latest version 0.117) can be made to coexist very nicely. This is a detailed instruction how to set it up (worry not, it\\'s rather simple). Additionally I provide some files to fix glitches and my latest ENB mod for demonstration purposes. Get ready for rather unpar",
  "descriptionHtml": "3d Vision (Nvidia\\'s stereoscopic 3d) and ENB Series (by Boris Vorrontsov, even the latest version 0.117) can be made to coexist very nicely. This is a detailed instruction how to set it up (worry not, it\\'s rather simple). Additionally I provide some files to fix glitches and my latest ENB mod for demonstration purposes. Get ready for rather unparalleld immersion...\r\n\r\n[center][b]I. Introduction[/b][/center]\r\n\r\nSykrim is already in vanilla a beautiful game. Nonetheless, it really pales when compared to the enhancements made possible on pc by very gifted invidividuals from the modding community.\r\n\r\nTwo projects really push it to the limit: \r\n\r\n1. The [b]ENB series[/b] by Boris Vorrontsov which inter alia adds\r\n[list]\r\n[*]Boris\\'s own approach to [i][b]HDR and SSAO[/b][/i] that makes you feel the air inbetween objects, \r\n\r\n[*]colourful [i][b]indirect lighting (SSIL)[/b][/i] that blends the world together in a very cohesive way, \r\n\r\n[*]very [i][b]detailed shadows[/b][/i] which pronounce the delicate details of everything, \r\n\r\n[*][i][b]Bokeh Depth of Field[/b][/i] that simulates the focusing of your eyes in a highly sophisticated and convinicing way (thanks to Matso), \r\n\r\n[*][i][b]lens flare effects[/b][/i] of bright light sources,\r\n\r\n[*]glorious and dynamically created [i][b]sunrays[/b][/i] stretching like the fingers of a curious child god and\r\n\r\n[*]dynamic [i][b]skylighting[/b][/i] creating even more lively shadowplay \r\n[/list]\r\n\r\n2. [b]Stereoscopic 3d [/b] powered by Nvidia\\'s [b]3d Vision[/b] tech:\r\nIn it latest, second iteration it creates an almost perfect illusion of spacial depth, turning your monitor into a nearly bottomless deepsea aquarium with very real \\\"fish\\\" swimming in it on all kinds of depths and also jumping out of it occasionally. Get ready for claws reaching towards you, breaking from your monitor and stretching all the way over your keyboard for your very throat.. ;-).\r\n\r\n\r\n[center][b]II. The problem[/b][/center]\r\n\r\nTodd Howards (brilliant guy, no doubt!) is unfortunately no fan of stereoscopic 3d and Skyrim explicit support for it is non-existing.\r\n\r\nThis has been remedied by a handful of very brave people out there: First of all by HeliX and his HeliXMod Project that increases game compatibility with 3D Vision not only for Skyrim, but for dozends and dozends of games (right now he works on Darksiders 2 and Dark Souls, yeah!). Eqiztara and Arioch are two users who are very active there and add their own fixes based on the project, so many thanks to them, too. Find the project here:\r\nhttp://helixmod.blogspot.de/\r\n\r\nThe technique used relies on bringing in a modified d3d9.dll - this very same technique is also used by Boris Vorontsov in his ENB series (in wrapper version, but ultimately also in the injector version, too). That\\'s the reason why you cannot simply drop both of them into the same directory and kick off.\r\n\r\nThis can be catered for by proxy calls (one calling the other .dll as subroutine) and has been done for in the past. Unfortunately with ENB 0.113 Boris has ended support for such proxy calls of HeliX\\'s .dll (it needed a fake vddeo card setting that is no longer supported from 0.114 onwards).\r\n\r\nStill, it\\'s possible to get 3D Vision up and running with ENB. It requires going back to a time before the HelixMod Project though and relying on older fixes stemming from that time: Dorkirt\\'s fix for the Sykmeshes for clouds and stars, the opaque water fix from Chizow\\'s great 3D vision Complete Compatibility Project and a little extra fix by myself for hiding the the slightly misplaced moons (based on the No secunda mod). Additionally we will have to switch to a different shadow rendering model in skyrimprefs.ini.\r\n\r\nThe result will be very, very good - still, a few glitches remain: underwater view is too clear, water surface is of a little lower quality (though transparent thanks to ssao side effect), moons are invisible, deph of field effect on seldom occasions distorts in a wrong way (one gets used to it quickly) and sun rays are actually 2d (still nice). It\\'s also preferable to hide the interface by turning it transparent (I do this for immersion anyway, dialogues and neccessary stuff appear still). The rest is simply perfect.\r\n\r\n[center][b]III. The solution[/b][/center]\r\n\r\nAlright, let\\'s do it:\r\n\r\n[b][center]1) Install the ENB of your choice[/center][/b]\r\nIt will work with all of them (SSAO support will make the water better though). I have provided my latest very noir and bloody ENB for demonstartion purposes in the download section. It\\'s very hgh quality, but comes with a hefty FPS price (I play on a high end system here). Still it\\'s a sighz to behold and very unique in its atmosphere. Install instructions for my ENB would be:\r\n\r\n[b]a)[/b] Please do the installation manually and place all the files from the unzipped Youngneil1 ENB directory, including its subdirectories, into your Skyrim install folder, where the SkyrimLauncher.exe is located. In the end you should e.g. find enbseries.ini in the same directory as SkyrimLauncher.exe. \r\n\r\n[b]b)[/b] Additionally please download the ENB series, version 0.117 by Boris Vorontsov, from this page:\r\nhttp://www.enbdev.com/mod_tesskyrim_v0117.htm. \r\nAfter unzipping this archive, go into its WrapperVersion subdirectory and just copy the file named d3d9.dll. Place that d3d9.dll into your Skyrim directory, too.\r\n \r\n[b]c)[/b] When starting Skyrim don\\'t fortget to activate the already included FurtherDarkDungeons.esp (all credits to Mindflux/artem1s, see also below)\r\n\r\n[b]d)[/b] I strongly advise downloading and activating the following three mods (without them you will have very different looks than intended):\r\n\r\nRevampedExteriorFog by Greg Manthey (Gargorias)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=9930\r\nRemove Ambient Interior Fog by Greg Manthey (Gargorias)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=9571\r\nMike Foxs Darker Dungeons by Mike Fox (without it, dungeons and interiors will be brighter and less atmospheric than intended)\r\nhttp://skyrim.nexusmods.com/mods/11353\r\n\r\nPlease make sure that the .esp file coming with Mike Foxs Darker Dungeons (Dark Light Templates.esp) is activated as last (or at least at a very late stage) in your load order. Otherwise, it tends to get overwritten by other files dealing with lihgting that are at least in this setup up not supposed to take precedence over Mike Foxs Darker Dungeons. BOSS is placing the Dark Light Templates.esp not low enough in load order. \r\n\r\n[b]e)[/b]Sykrimprefs.ini\r\nPlease make sure that in your Skyrimprefs.ini (found e.g. on a Vista64 system under users/\\\"username\\\"/mydocuments/mygames/skyrim/) you have the following set:\r\nbTreesReceiveShadows=1\r\nbDrawLandShadows=1\r\n[b]bFloatPointRenderTarget=1[/b]\r\n(the first two are optional while the last one is a must)\r\n\r\n[b]f)[/b] Driver Settings\r\nI use the lastest Nvidia driver (on a GTX 690). I have set antialiasing to application controlled (the included smaa by Andrej Dudenhefner (alias mrhaadni) handles this) . Anisotrophic filtering is activated on driver level at 16x quality. Texture Quality is set to high quality and Tripple Buffering is on (while allowing to use the V-Synch setting of the application).\r\n\r\n[b]g)[/b] Ingame graphic settings (launcher and options menu)\r\nI have [b]brightness all the way down[/b] (this may vary for you depending on your monitor calibration, but it\\'s very likely you will also want a very low ingame brightness setting).\r\nAnti Aliasing and Anisotrpoic filtering are turned off within the launcher options (the driver & the injected SMAA do that for us). No FXAA either. All other settings to the highest possible options (ultra), including shadows. Of couse, it depends on your system if you want to make some cmpromises here.\r\nIf this is too performance hungry, please try to set Anti Aliasing to a lower level with the included injector.ini file.\r\n\r\n[b]h)[/b] Monitor settings\r\nHard to give advice here. My monitor (Asus 27 inch for §D Visison 2 tech) is rather bright, but in the end it\\'s just important to keep in mind that the monitor of course plays a role that has to be compensated for if need be by some fine tuning. \r\n\r\n[b]i)[/b] Other graphic mods and left overs from ENB installations\r\nPlease make sure you remove other graphic files from other ENB or similar graphic modifications (like e.g. from Realistic Lighting, effect. ini files from other ENB that did e.g. sharpening as such techniques are not used here, etc.).\r\n\r\n\r\n[b][center]2. After having setup the ENB let\\'s take the necccessary preparations to fix stereo 3d glitches:[/center][/b]\r\n\r\n[b]a[/b]. Skyrimprefs.ini\r\nPlease make sure that in your Skyrimprefs.ini (found e.g. on a Vista64 system under users/\\\"username\\\"/mydocuments/mygames/skyrim/) you have the following set:\r\n[b]bDeferredShadows=0[/b]\r\nThis is very important as it fixes all of the shadow problems occuring otherwise.\r\n\r\n[b]b[/b]. Download (see download section here) and install \\\"Dorkirt\\'s Skybox Mesh Mods\\\" to fix stars and clouds. Many thanks to Dorkirt and also Chizow for keeping them posted over at the 3D Vision Compatibilty project, too.\r\n\r\n[b]c[/b]. Download (see download section here) and install \\\"3D Vision Water Fix\\\" to fix water glitches. Many thanks again to Chizow for keeping them posted over at the 3D Vision Compatibilty project, too.\r\n\r\n[b]d[/b]. Download (see download section here) and install \\\"No Moons\\\" to remove the otherwise misplaced moons. Many thanks again to Akindain for his No Secunda Moon mod whioch was the inspiration for this one. \r\n\r\n[b]e[/b]. Turn ingame hud tranparency to 100% (optional, not for fixing in a strict sense). Recommend though.\r\n\r\n\r\n[b][center]IV. Some advice on stereo depth and convergence[/center][/b]\r\nFinally, I have experimented a long time to find my right depth and convergence settings for Skyrim (on a 27 inch screen). I ended up with 51% depth (indicator under the A of Depth Amount) and convergence set so close (shift+f6, enable the keys in the the nvidsia 3d control center) that I still can read the text in dialogues. This text appears very, very close to the actors now, their nose or chin peaking over it at me :). I can bear much higher depths but they lead to an unatural stretch of proportions (\\\"long faces\\\").\r\n\r\nI hope this was helpful a little - at least to those few who acually combine stereo 3d and ENB and want to use 0.114+ of the ENB Series.\r\n\r\nAll the best \r\n\r\nyoungneil1\r\n\r\n____\r\n\r\nCredits:\r\nBoris Vorrontsov for his great ENB Series\r\nHeliX/HeliosDouble6/HeliX666 for his fantastic 3D Vision project: HeliXMod\r\nEqiztara and Arioch for being very helpful and active in that project\r\nDorkirt for fixes on 3d meshes for starts and sky\r\nChizow for the 3D Vision Complete Compatibility Project, including the water fix \r\nAndrej Dudenhefner (alias mrhaadni) for the brilliant smaa soultion I have just included here - all credits to him for this\r\nMatso for his absolutely amazing Depth of Field effect that I use with his permission here (also to Kyo for I use the iteration of Matso\\'s new Bokeh from Countervibe here - it leads to less stereo 3d distortion glitches)\r\nMikeFox for the superb Darker Dungeons Mod that simply is a must to use for me\r\nTheRadikal for his twists on the enbeffect.fx and the enbpalette.bmp file that I further modified with his consent and include here\r\nMindflux/artem1s for the essential FurtherDarkDungoens Mod that he kindly allowed me to integrate into the Grim Gem ENB package\r\nSharpshooter8 for inspring me to start this with his amazing ENB\\'s\r\nConfidence Man for his water foam retexture that helps water fom brightness under control at night time\r\nPuuloo for his great More Dynamic Shadows Mod that I suggest to keep a very close eye on - he\\'s just giving it the last refinements to make it really perfect and then I will gladly and thankfully use it",
  "categoryId": "62",
  "version": "1",
  "author": "youngneil1",
  "createdUnix": "1346067423",
  "updatedUnix": "1346087285",
  "containsAdultContent": false,
  "uploadedBy": "youngneil1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84590",
      "name": "Youngneil1 ENB v1",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "373",
      "fileName": "Youngneil1 ENB v1-23146-1.7z",
      "uploadedUnix": "1346067505",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/4a39147e1ffbb765b0e34e818e23188681c5ec109c7e5face07ddbc4c0fb1d6b/analysis/1407125465/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Youngneil1%20ENB%20v1-23146-1.7z?fid=84590&ttl=1535793168&ri=8192&rs=8192&setec=50344c61da3dec736dc75e94c48ffff6"
    },
    {
      "fileId": "84591",
      "name": "Dorkirts Skybox fix",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "616",
      "fileName": "Dorkirts Skybox fix-23146-1.zip",
      "uploadedUnix": "1346067780",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/67eb81fdf051efd5cf6439ef828661deede2f84fa858c98eeec815e27bbaf416/analysis/1407125466/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dorkirts%20Skybox%20fix-23146-1.zip?fid=84591&ttl=1535793169&ri=8192&rs=8192&setec=160c8592d5593bc08d14ea07e9e291ea"
    },
    {
      "fileId": "84592",
      "name": "3D Vision Water Fix",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "3D Vision Water Fix-23146-1.zip",
      "uploadedUnix": "1346067996",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b7c2ad602a35f169cf6193a25b86cffeb1ab2172f684e3a3f46bf17d24b9fa0b/analysis/1407125522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/3D%20Vision%20Water%20Fix-23146-1.zip?fid=84592&ttl=1535793169&ri=8192&rs=8192&setec=2b5748eecd1b0e08840673b760f35e8e"
    },
    {
      "fileId": "84593",
      "name": "No Moons",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "No Moons-23146-1.zip",
      "uploadedUnix": "1346068133",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/5ac50204722f0bab8c51631158e1408e1017a57a6be67c42baa3c506f098104b/analysis/1407125523/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Moons-23146-1.zip?fid=84593&ttl=1535793169&ri=8192&rs=8192&setec=53e04cde4e1e2630ff77f2b997524078"
    },
    {
      "fileId": "84646",
      "name": "Youngneil1 ENB v2",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "435",
      "fileName": "Youngneil1 ENB v2-23146-1.zip",
      "uploadedUnix": "1346087285",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e91efb0f994f82b655a7ab6c3c8f20c6567acf9c0c16ef9fb54440b1b31a0869/analysis/1407126029/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Youngneil1%20ENB%20v2-23146-1.zip?fid=84646&ttl=1535793170&ri=8192&rs=8192&setec=ec587f2403595cca89d7c24f7fe392f6"
    }
  ]
}