{
  "modId": 23153.0,
  "modName": "Skyrim Character Manager",
  "summary": "Switch between different characters in Skyrim",
  "descriptionHtml": "I\\'ve started a project named \\\"Skyrim Character Manager\\\".\r\n\r\nEver wanted to have more than 1 character in Skyrim but you\\'re too lazy to switch saves everytime or you don\\'t want your friends to go on your character but make a new character?\r\nWell, then this is something you\\'ll really appreciate. \r\nThis program will let you make up to 6 different characters in Skyrim (your existing character won\\'t be overwritten) and unlike all the other savegame/character managers, this one has a nice design too.\r\nCompatible with Windows XP, Vista and 7. Works only for 64 bit, 32 bit will be added in v1.1.\r\nAt least Microsoft Net Framework 3.5 required.\r\n\r\nWARNING, THIS PROGRAM SHOULDN\\'T BE INSTALLED USING NMM. IT COULD DAMAGE YOUR GAME FATALLY. \r\n\r\nIf there are any questions or you\\'ve found a bug, feel free to ask/report.\r\n\r\nQ & A\r\nQ: Does it only switch savegames for different characters, or does it also change mod profiles (by enabling/disabling esm and esp files in the load list, according to the character\\'s specific needs)?\r\nA: It will only give you the possibility to switch characters, it won\\'t change/separate different plugins/mods. I\\'ll be working on it in the future :)\r\n\r\nQ: How are savegames switched? Are there any backup subdirectories or whatever?\r\nA: This one was made to make 6 different directories and the directory that will be used for your character will be renamed to \\\"Saves\\\" so there isn\\'t any chance that the manager will possibly overwrite another characters saves.\r\n\r\nQ: Is the current version 1.0 considered a stable version, or is it meant mainly for beta testing?\r\nA: It is considerable as stable, but an error could always happen, no matter what. But, there isn\\'t any chance it will possibly ever overwrite one of the other characters saves.\r\n\r\nQ: If I use NMM, will the mods only be edited for the character I selected?\r\nA: No, since NMM doesn\\'t edit your savegames, the mod you\\'ve installed will apply for all characters.\r\n\r\nUpcoming futures in V1.1:\r\n- Adding support for 32 bit PC\\'s\r\n- Support for SKSE\r\n- Password protection(lets you set a password on a character)\r\n- Uninstaller\r\n- Updater",
  "categoryId": "39",
  "version": "v1.0",
  "author": "luca00555",
  "createdUnix": "1346080383",
  "updatedUnix": "1346080662",
  "containsAdultContent": false,
  "uploadedBy": "luca00555",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84623",
      "name": "Skyrim Character Manager v1_0",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "350",
      "fileName": "Skyrim Character Manager-23153-v1-0.zip",
      "uploadedUnix": "1346080662",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4a57a1b6d6f0868f3f3ac41de074988a233246ea4f6d76096cecfd4002b7d01b/analysis/1407125825/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Character%20Manager-23153-v1-0.zip?fid=84623&ttl=1535793179&ri=8192&rs=8192&setec=e37dff20a7ffbdff86f42d077141ac79"
    }
  ]
}