{
  "modId": 23168.0,
  "modName": "Bal Ruhn",
  "summary": "An apartment in Windhelm\\'s Gray Quarter. ",
  "descriptionHtml": "9/16/13\r\nUpdated the update. Should be ready for real this time. \r\n\r\n9/6/13\r\n\r\nUploaded a new version with updated meshes. After many mods, I\\'ve finally learned the error of my ways regarding proper collision on meshes. Hope this fixes any trouble people might have with moving objects that are meant to stay put!\r\n\r\n\r\nWant to live in the heart of Stormcloak territory? Or perhaps you\\'re a dark elf who wants to hang with his own kind. In either case, Bal Ruhn might be the home for you. \r\n\r\nBal Ruhn is a tiny, split level apartment, nestled in the Gray Quarter of Windhelm. It\\'s a very simple place but I tried to give it a few special qualities to make it a nice home. There are enchanting and alchemy stations but no smithing stations, simply because you\\'re in Windhelm. You can easily go to the market area and use Oengul\\'s forge and smelter. There should be ample storage. The place is best for those who like to play alone but there are bunk beds for those with a single follower. The bottom bunk bed is player owned and gives the rested bonus. The place is navmeshed so followers and spouses are able to come and go with you. It has been tested with Vorstag as a follower. \r\n\r\nFeatures Include: \r\nOne large bookshelf\r\nOne large weapon rack\r\nOpenable cabinets in the kitchen\r\nA running water tap\r\nLights that can be toggled on and off via a switch by the door\r\n\r\nAcquiring Bal Ruhn:\r\nThe deed for the apartment is able to be purchased from Revyn Sadri at Sadri\\'s Used Wares in the Gray Quarter. The base value of the deed is 1000 gold but of course, the actual price will depend on your character\\'s speech and bartering levels. Once the deed is purchased, it will tell you where to find the key. The apartment itself is located just east of the steps to Palace of the Kings. Simply turn right just after you pass under the arch that takes you into the Gray Quarter and you\\'ll see the door. It has a snowberry planter next to it. \r\n\r\nRequirements:\r\n\r\nBal Ruhn requires the latest Skyrim patch. \r\n\r\nInstalling Bal Ruhn:\r\n\r\nIf not using NMM, you can manual install. After downloading the rar file, unpack it to a convenient location your hard drive, then drag and drop both folders and the mtBalRuhn esp file into your Skyrim Data directory. \r\n\r\nIssues and Conflicts:\r\n\r\nI do not use Open Cities myself but I can well imagine that Bal Ruhn will NOT be compatible with that mod. It\\'s my understanding that anything added to the cities is not compatible with OC. There\\'s not much I can do about that. \r\n\r\nFollowers seem to have a bit of an issue navigating the top of the stairs and bunk beds. They can do it but it takes a bit of paitence right now. When you have them sleep in the top bunk, they float in and out of it. I\\'m fairly sure there\\'s nothing I can do about that either. My apologies. \r\n\r\nCredits:\r\nVarious static meshes used in Bal Ruhn were made by the following talented people - \r\n\r\nInsanity Sorrow - http://tesalliance.org/forums/index.php?/files/file/1182-soap-resource/\r\n\r\nLilith - http://tesalliance.org/forums/index.php?/files/file/1300-ready-clutter/\r\n          http://tesalliance.org/forums/index.php?/files/file/1264-catering-by-lilith/\r\n\r\nBlary - http://skyrim.nexusmods.com/mods/10370\r\n\r\nOaristys - http://skyrim.nexusmods.com/mods/16525\r\n\r\nSome statics included were created by me and are available to be used in other mods. \r\n\r\nHope you enjoy the place and please leave your thoughts on the comment page. It\\'s always appreciated. ",
  "categoryId": "67",
  "version": "2.0",
  "author": "mellowtraumatic",
  "createdUnix": "1346094486",
  "updatedUnix": "1379354944",
  "containsAdultContent": false,
  "uploadedBy": "mellowtraumatic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84669",
      "name": "Bal Ruhn",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1922",
      "fileName": "Bal Ruhn-23168-1-0.rar",
      "uploadedUnix": "1346094544",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b42264e3eb5bf5c9c9d5133e7026f5125d48ff36e8842dcc997f49de3cfe74de/analysis/1407126308/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bal%20Ruhn-23168-1-0.rar?fid=84669&ttl=1535793200&ri=8192&rs=8192&setec=6cc796a223a5521f00bfb260a185ea1a"
    },
    {
      "fileId": "1000055922",
      "name": "Bal Ruhn Version 2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1937",
      "fileName": "Bal Ruhn Version 2-23168-2-0.rar",
      "uploadedUnix": "1379354944",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/05670557a60b455d787916204bc589b7ffcdfc2e368d1a8f6a59b137c4d792dc/analysis/1407725286/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bal%20Ruhn%20Version%202-23168-2-0.rar?fid=1000055922&ttl=1535793200&ri=8192&rs=8192&setec=2e9522c767b44ab4fef054054cbae2c2"
    }
  ]
}