{
  "modId": 23188.0,
  "modName": "Skyrim Books Checklist Spreadsheet",
  "summary": "An out-of-game spreadsheet for keeping track of the books you\\'ve collected/read. Includes 376 books from the UESP books list. Does NOT include notes, journals, or similar minor texts. Multiple formats, including an auto-formatting, auto-total-calculating version.",
  "descriptionHtml": "[size=10]Description[/size]\r\nIf you\\'re like me, you love the lore and books in ES games. This time around I decided to try to collect and read them all. This is the spreadsheet I\\'ve developed for helping me keep track.\r\n\r\nIt is simply a list of all the books from [url=http://www.uesp.net/wiki/Skyrim:Books]http://www.uesp.net/wiki/Skyrim:Books[/url], minus any journals and notes that were listed. It just contains 3 columns: Title, Collected, and Read.\r\n\r\nI removed the journals and notes because I use Headbomb\\'s awesome [url=http://skyrim.nexusmods.com/mods/2730]Better Sorting[/url] mod, so most of the journals are already renamed to e.g. \\\"Journal - XXXXX\\\", and the notes are easy to identify based on their single-page appearance and don\\'t really go well on bookshelves, which is where I keep all my regular books. Also this list does not include spell tomes, which are also nicely renamed by the Better Sorting mod.\r\n\r\nThis spreadsheet is provided as-is, because I thought it may be useful to a few of you. I do not plan on updating it or making other versions which include journals and notes. However if you find a legitimate book missing or mis-labeled I may consider fixing that. Keep in mind this all came from [url=http://www.uesp.net/wiki/Skyrim:Books]http://www.uesp.net/wiki/Skyrim:Books[/url] which means any problems you find are most likely a problem there as well, so consider editing the wiki page in addition to commenting here.\r\n\r\n[size=10]Main Version[/size]\r\n[size=5]Information[/size]\r\nThe main version of the spreadsheet is hosted online as a Google Spreadsheet Document. This is the version I use.\r\n- Auto formats the background color of the Collected and Read columns based on whether a cell\\'s contents are \\\"0\\\" or \\\"1\\\".\r\n- Auto-calculates the number of books in the list\r\n- Auto-calculates the collected count and percentage\r\n- Auto-calculates the remaining count and percentage\r\n- Auto-calculates the read count and percentage\r\n- Sortable by all three visible columns\r\n- There are several hidden columns on the right side of the spreadsheet used for the calculations. Don\\'t mess with these if you want the calculations to work. Make sure they are hidden before sorting the spreadsheet (highlight columns, right click, hide).\r\n\r\n[size=5]Instructions[/size]\r\nI could not find a lazy way to export all of this to a more portable file, so I will be sharing a read-only copy on Google Docs (i.e. Google Drive) for anyone to copy for their own use. Here is how to grab your own copy:\r\n- Log into your Google account\r\n- Make sure your account is signed up for the Google Drive product\r\n----- If not, just go to [url=http://www.google.com/drive]http://www.google.com/drive[/url] and sign up for free\r\n----- There\\'s no strings attached and you don\\'t have to install the Google Drive desktop client\r\n- Browse to this read-only copy of the spreadsheet: [url=https://docs.google.com/spreadsheet/ccc?key=0AoUgI4M55OqudGF2VmJwVFlnSUo2X3RDZ25BNkt0N1E]https://docs.google.com/spreadsheet/ccc?key=0AoUgI4M55OqudGF2VmJwVFlnSUo2X3RDZ25BNkt0N1E[/url]\r\n- Between the spreadsheet title and toolbar, select File -> Make a Copy...\r\n- Give the spreadsheet a name and click OK\r\n- You should now be looking at your own editable copy of the spreadsheet.\r\n\r\n[size=10]Other Versions[/size]\r\n[size=5]Information[/size]\r\nI\\'ve also exported the spreadsheet to these other formats which you can download directly from Nexus on the downloads tab of this mod page. These versions do not include any auto-formatting or calculating, just the three main columns.\r\n- ODS format (for OpenOffice/LibreOffice)\r\n- XLS format (for Microsoft Excel)\r\n- CSV format\r\n\r\n[size=5]Instructions[/size]\r\n- Simply download the archive,\r\n- extract a file in the format you want (ODS, XLS, or CSV) to anywhere on your system,\r\n- and open/import it into your favorite spreadsheet application\r\nNote: the archive is in 7z format (usable by [url=http://www.7-zip.org]7-Zip[/url]), because ZIP and RAR are dead (get over it).\r\n\r\n[size=5]Also[/size]\r\nHere is another Google Drive version that does not include the auto-formatting/calculating. Follow the instructions for the main Google Drive version above, using this link instead: [url=https://docs.google.com/spreadsheet/ccc?key=0AoUgI4M55OqudFNzam9ROE9mQ1Mwa3FrU3BHdG5SN0E]https://docs.google.com/spreadsheet/ccc?key=0AoUgI4M55OqudFNzam9ROE9mQ1Mwa3FrU3BHdG5SN0E[/url]\r\n\r\n[size=10]Recommended Related Mods[/size]\r\n- [url=http://skyrim.nexusmods.com/mods/2730]Headbomb\\'s Better Sorting[/url] (for better organizing most journals, and basically everything else in the game)\r\n- [url=http://skyrim.nexusmods.com/mods/12553]Shawkab\\'s Dovahkiin Hideout[/url] (besides being awesome and the best custom player home evar, it includes more than enough interactive bookshelves to hold/display every book in the game!)",
  "categoryId": "39",
  "version": "0.1",
  "author": "Roachy1",
  "createdUnix": "1346125847",
  "updatedUnix": "1346126313",
  "containsAdultContent": false,
  "uploadedBy": "roachy1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84758",
      "name": "Skyrim Books Checklist Unformatted ODS XLS CSV v0_1",
      "version": "0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "17",
      "fileName": "Skyrim Books Checklist Unformatted ODS XLS CSV v0_1-23188-0-1.7z",
      "uploadedUnix": "1346126313",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/dbb68770a859016d2e7acd2eefaac4784ea2fa50ee20341e295dc43765d5a368/analysis/1407127264/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Books%20Checklist%20Unformatted%20ODS%20XLS%20CSV%20v0_1-23188-0-1.7z?fid=84758&ttl=1535793251&ri=8192&rs=8192&setec=902eced1e0abe169758af29cd01f24be"
    }
  ]
}