{
  "modId": 23186.0,
  "modName": "Bone Cage Tower",
  "summary": "A former imperial prison tower now infested with the undead.",
  "descriptionHtml": "Description:\r\nA tower can be found east of Rorikstead; a former Imperial Jail, housing the most sinister prisoners is said to continue to guard them even after every soldier is dead. Some sort of nefarious power is at hand... \r\n\r\nAuthor\\'s Notes:\r\nAhoy,\r\n\r\nI figured I\\'d take a stab at dungeon building and while I had intended to make it much longer, my desire to make a dungeon in the vanilla style of skyrim (that\\'s to say linear) made it fairly short. I considered to proceed on to making it even longer but decided that I would move on to the next project.\r\n\r\nI think it came out rather well, a bit short but it is full of skeletons (which I have always loved destroying as you can chip through crowds of them in no time flat) and as it gets more serious with draugr it takes a bit of a slower pace, but with no shortage of enemies. I always thought my favorite times in combat were when I was against a seemingly overwhelming number of enemies, somehow coming out on top, so expect encounters in high numbers.\r\n\r\nQ&A:\r\nQ: Where is the Dungeon?\r\nA: You can see in the posted image, but it is East and slightly North of Rorikstead\r\n\r\nQ: I am stuck on the first floor, can\\'t find the key to floor two, where is it?\r\nA: It should be on the table at the top of the tower, if its not there, some sort of effect has knocked it off. Worst comes to worst, you can reload prior to it getting knocked around or use the \\\"Unlock\\\" command in console.\r\n\r\n(SPOILER)\r\nQ: The Reward Weapon ability can be used multiple times\r\nA: I know, if you desire you can exploit it, but as I said, I wanted to move on to other projects and I couldn\\'t find a good way to stop it in a reasonable time frame.\r\n\r\nQ: So wait, I was going down, how am I up on the first floor again?\r\nA: As I said, I was thinking of going deeper, but decided to make a new dungeon instead. I don\\'t like altering the overworld much so I looped the dungeon back to the top for easy exit.",
  "categoryId": "88",
  "version": "1.0",
  "author": "Ilseroth",
  "createdUnix": "1346123294",
  "updatedUnix": "1346123632",
  "containsAdultContent": false,
  "uploadedBy": "Ilseroth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84751",
      "name": "Bone Cage Tower",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "89",
      "fileName": "Bone Cage Tower-23186-1-0.rar",
      "uploadedUnix": "1346123632",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/de8cb003471ff6a5c484f939861deb2d07084d751d5c030b0b28af951b9827a8/analysis/1407127203/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bone%20Cage%20Tower-23186-1-0.rar?fid=84751&ttl=1535793250&ri=8192&rs=8192&setec=68a5802a6e10deac5a103674ca262895"
    }
  ]
}