{
  "modId": 23195.0,
  "modName": "Economics of Skyrim - Chinese Version",
  "summary": "This is the Chinese translated version of the original Economics of Skyrim.",
  "descriptionHtml": "This is the Chinese translated version of the original Economics of Skyrim.\r\nOriginal page:http://skyrim.nexusmods.com/mods/11919\r\nAll credit to the original author Thomas Kaira. \r\n\r\nIntroduction\r\nYou have arrived at your local Blacksmith, and are shopping for new toys, armor, whatever it is you want. Ever notice something odd? Like how every single blacksmith seems to have exactly the same items in stock? Well, that’s because they do.\r\nEvery major merchant in the game have their shops stocked based on a single boilerplate arrangement of leveled lists, which both randomizes their stock and it is also rather obviously scaled to match your level. It works, but is very inelegant and can raise a few eyebrows when the smith who had nothing but low-grade Steel one day suddenly has a boatload of Ebony gear the next.\r\nWouldn\\\\\\'t it make much more sense for the merchants to stock items based on the resources available to them in whichever region they are found? These are not modern times, merchants do not rely on buying things from other people to sell; they sell what they make. I, for one, feel the game\\\\\\'s economy should reflect that. That is where this mod comes in.\r\nAnd now, it\\\\\\'s better than ever! Gone are the old issues with unusable ingots and duplicated items! The mod has received a total makeover, literally rebuilt from the ground up. This means you can be assured a much better economic experience than before.\r\n\r\nFor more information, please refer to the original mod.\r\n\r\nInstallation\r\nThis is only a Chinese .esm file , please go to original page to download the main file.\r\nPlease use the NMM to install the MOD.\r\n\r\nCredit\r\nAll credit with Thomas Kaira, thank him for this great MOD!\r\n\r\nIf you like this MOD, please endorse the author, thank you!\r\n\r\nAbout our group\r\nARROW&KNEE MOD TEAM™ is a neutral independent mini-group for Original MOD lovers,if you have ability to use some specialized software such as PS,max,nifskope,mudbox,zb,maya and so on , please contact us.\r\nOur contact information: skyrimmodteam@gmail.com\r\nOR, you can directly PM me here.",
  "categoryId": "69",
  "version": "1.2.3",
  "author": "Thomas Kaira",
  "createdUnix": "1346128063",
  "updatedUnix": "1346128492",
  "containsAdultContent": false,
  "uploadedBy": "creed007",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84770",
      "name": "Economics of Skyrim - Chinese Version",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "510",
      "fileName": "Economics of Skyrim - Chinese Version-23195-.zip",
      "uploadedUnix": "1346128492",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a93220a5267e51bc8335772c0a4d343b0c78a927d35d9c815de13e901c8a26e7/analysis/1407127405/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Economics%20of%20Skyrim%20-%20Chinese%20Version-23195-.zip?fid=84770&ttl=1535793261&ri=8192&rs=8192&setec=d49d19cc81d26149443a94b5b1354301"
    }
  ]
}