{
  "modId": 23213.0,
  "modName": "Veneno Arremessavel  - Throwable Poison",
  "summary": "Esse mod permite que você crie venenos em calderão e atire nos inimigos.\r\nThis mod allow to you make throwable poison that you make in cookpot (only in portuguese for now)",
  "descriptionHtml": "Esse mod permite que você crie venenos em calderão e atire nos inimigos.\r\n\r\nCom esse mod voce pode ser tornar almiquista completo tanto fazendo poções de defesa tanto de ataque.\r\n\r\nComo fazer venenos?\r\n\r\nPrimeiro voce precisa de álcool puro. Existem três tipos de alcools: fraco, médio e forte.\r\n\r\nComo faço alcool?\r\n\r\nArrume uma bebida e misture com flor da montanha. para criar alcools mais fortes depende da bebida ou misturar alcool mais fracos.\r\n\r\nTenho alcool e agora?\r\n \r\nCom o alcool voce mistura com alguns ingredientes, geralmente os que tem efeitos primários, tipo dano a saude, fraqueza a elementos. então precisa do caldeirão. Misture o alcool com caldeirão e terá uma mistura venenosa que varia entre Mistura (fraca), Essência (média) Extrato (forte)\r\n\r\nTenho mistura venenosa e agora?\r\n\r\nPrimeiro não beba. tenha em mãos tira de couro mais a mistura venenosa. Vá em um curtume e crie o veneno arremessável.\r\n\r\nQuais os efeitos disponíveis?\r\n\r\nPor enquanto tem dano a saude, devastar saude (ravage), paralisia, fraqueza a elementos (fogo, gelo e choque), mas estou trabalhando em novos efeitos.\r\n\r\nPosso criar venenos com vários efeitos?\r\nSim, mas tem que ter a habilidade envenenador (poisoner) pode misturar efeito de paralisia nas poções de dano a saude. e pode-se criar o veneno mortal, que paralisa, devasta e danifica saude. Para criar esses efeitos precisa das misturas venenosas.\r\n\r\nObrigado a Madrilous pelo mod Throwing Weapons - Death From Afar o qual basei para criar este. \r\n\r\n----ENGLISH VERSION----\r\n\r\nBasic descrition.\r\n\r\nThis mod allow to you make throwable poison that you make in cookpot. You extract alcohol from the drinks like beers or meat. after you mix in cookpot with ingredients. after you go to taninghack and join leater strips with this mixture and it\\'s done. \r\n\r\nthanks for Madrilous by mod Throwing Weapons - Death From Afar\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "24",
  "version": "",
  "author": "eduardo_2006",
  "createdUnix": "1346161868",
  "updatedUnix": "1346162347",
  "containsAdultContent": false,
  "uploadedBy": "Eduardo_2006",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84829",
      "name": "Venenos Arremessaveis Throwable Poisons",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17804",
      "fileName": "Venenos Arremessaveis Throwable Poisons-23213-.rar",
      "uploadedUnix": "1346162347",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/55d61b266181d98f4dc856add1de57945254f8fcdfe537eb80627195c22d261c/analysis/1407128003/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Venenos%20Arremessaveis%20Throwable%20Poisons-23213-.rar?fid=84829&ttl=1535793283&ri=8192&rs=8192&setec=3693384eeb851841dd10276006ac4bc5"
    }
  ]
}