{
  "modId": 23249.0,
  "modName": "CL Cities - Whiterun",
  "summary": "A complete redecoration of Whiterun, aimed to make it a more detailed and interesting setting.",
  "descriptionHtml": "[i]What\\'s this? Another city mod?[/i]\r\n\r\nWell, yes. But this one is my take on things.\r\n\r\nI was having trouble with a lot of the city mods. City Under Construction would crash, Detailed Cities made the floor in the Blue Palace disappear, you name it. But at the same time, I couldn\\'t go back to the vanilla version of the cities in the game. The solution? Make my own!\r\n\r\nThis is the first in a series of city redecoration mods, aiming to make visiting Skyrim\\'s cities a more detailed, realistic, and fun experience. To start out, I\\'ve overhauled the ever-popular yet ever-boring Whiterun.\r\n\r\n[b]A list of changes:[/b]\r\n\r\n[i]General[/i]\r\n* Placed trees all around various areas of the city (and before you get all \\\"BUT WHIETRUNS IS TUNDRA AND DOESNT HAVE TRES\\\", I would like you to look at [url=http://upload.wikimedia.org/wikipedia/commons/4/48/%C5%A0aukliaiTundra.jpg] this picture from the Lithuanian tundra[/url], thank you very much.)\r\n* Clusters of barrels, crates, hay bales, and other such things have been added where appropriate.\r\n\r\n[i]The Plains District[/i]\r\n* Added large supply depots to fill out the bare patches of land.\r\n\r\n[i]The Market[/i] - now, this is where things really get crazy.\r\n* Added an archway over the road into the marketplace.\r\n* Placed strings of flags at all major entrances to the area.\r\n* Added two new market stalls and three carts to the market.\r\n* Six new NPCs have been added to the marketplace -\r\n** Eridanus Amphore - male Imperial, sells potions, spells, and other magic equipment\r\n** Heolstor - male Nord, sells furs\r\n** Hrolfr - male Nord, plays the lute for the shoppers\\' entertainment\r\n** Loretta Glensdale - female Breton, sells clothes and fabric\r\n** Oleg the Stout - male Nord, sells baked goods\r\n** Marsinah - female Redguard, sells pottery\r\n[b]NOTE[/b] - for some reason, Loretta and Marsinah will not sell you anything. I have no idea why this is, since I didn\\'t do anything different with them than I did with the other merchants, but they won\\'t.\r\n* Placed a cover over the well.\r\n* Added a Shrine of Zenithar in front of the well for good luck and to designate the site of the market (this was inspired by the \\\"market crosses\\\" of real medieval marketplaces.)\r\n\r\n[i]The Wind District[/i]\r\n* Replaced the pile of rocks put proudly on display in the middle of the road (seriously, what the hell?) with a statue of Ysgramor.\r\n* Added two more cows, a hay pile, and a chicken coop with three chickens and a nest to the holding pen.\r\n* Decorated the area around the Gildergleam with a garden.\r\n* Gave Heimskr a carpet to stand on.\r\n* Decorated the Hall of the Dead with a banner, a gargoyle over the door, and two robed statues at either side of the entrance.\r\n\r\n[i]Jorrvaskr[/i]\r\n* Added a banner and two flagpoles with banners to the archway over the stairs.\r\n* Placed two statues of Ysgramor in front of the doorway.\r\n* Added banners to mark the stairs up to the Skyforge.\r\n\r\n[i]Dragonsreach[/i]\r\n* Placed a second archway with a banner on the stairs up to the castle.\r\n* Decorated the castle facade with a banner and three shields - one bearing the Whiterun coat of arms and two generic ones above that.\r\n* Placed two benches facing the moat on either side of the entrance.\r\n* Decorated the grounds with an extensive garden.\r\n\r\nI hope to give the same treatment to all of Skyrim\\'s cities, so feel free to suggest which city to do next, as well as any features you\\'d like to see! I\\'m also open to suggestions for future releases of this mod as well.\r\n\r\nNote - I am using my other mod, [url=http://skyrim.nexusmods.com/mods/13837]Randomly-Generated Generic Townsfolk[/url], in the screenshots. It is NOT included in this mod.\r\n\r\nHave fun!\r\n\r\n[b]Change Log[/b]\r\n\r\n* 4/28/13 - jiubiizeekk has volunteered to patch this mod to fix a few issues. This version should fix the navmesh problems and allow Hrolfr to properly play music. He has also moved and added a few objects. [b]I have not tested this version of the mod, and I cannot guarantee I condone or approve all the changes he has made at the moment.[/b]\r\n* Version 2 - 9/23/12. Added face gen data for the new NPCs and fixed the issue of the barrel blocking the gate.\r\n\r\n[b]The CL Cities Project[/b]\r\n\r\n* [url=http://skyrim.nexusmods.com/mods/24043]Whiterun Exterior[/url]",
  "categoryId": "53",
  "version": "2",
  "author": "Captain Lhurgoyf",
  "createdUnix": "1346193246",
  "updatedUnix": "1367200017",
  "containsAdultContent": false,
  "uploadedBy": "CaptainLhurgoyf",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84922",
      "name": "CL Cities - Whiterun v1",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "100",
      "fileName": "CL Cities - Whiterun-23249-1.zip",
      "uploadedUnix": "1346193353",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/bca1b9522b8bf207ec774df049c79f5e737ce51a315754c02993f0d75d74a8eb/analysis/1407128883/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CL%20Cities%20-%20Whiterun-23249-1.zip?fid=84922&ttl=1535793344&ri=8192&rs=8192&setec=a9b09ebe4bece9db5885000541d7f99a"
    },
    {
      "fileId": "90153",
      "name": "CL Cities - Whiterun v2",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "893",
      "fileName": "CL Cities - Whiterun v2-23249-2.zip",
      "uploadedUnix": "1348449354",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/ef8eb68ef74af40cd39ebf205510a9d63444e9add99d876f195836a728c4d4af/analysis/1407184164/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CL%20Cities%20-%20Whiterun%20v2-23249-2.zip?fid=90153&ttl=1535793344&ri=8192&rs=8192&setec=8436c2a02e2bc60f2321d95e0c9cebcc"
    },
    {
      "fileId": "1000027007",
      "name": "jiubiizeekk Patch - UNTESTED",
      "version": "1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "910",
      "fileName": "jiubiizeekk Patch - UNTESTED-23249-1.rar",
      "uploadedUnix": "1367200017",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/0ce1048dae8c13368641ddd2c65b184d6aaddd791927c70001b508d499106cb5/analysis/1407546343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/jiubiizeekk%20Patch%20-%20UNTESTED-23249-1.rar?fid=1000027007&ttl=1535793345&ri=8192&rs=8192&setec=17c7c26a80f6d8665329ebb161d76b80"
    }
  ]
}