{
  "modId": 23243.0,
  "modName": "Leather Armors",
  "summary": "Adds craftable unenchanted version of Linwe\\'s and Guild Master\\'s Armors",
  "descriptionHtml": "If you like to stick to lore, and you lack leather armors in the game, here it is.\r\n\r\nThis mod adds two new leather armor sets based on Linwe Armor (also known in CK as ThievesGuildAlternateVersion) and Guild Master\\'s Armor, unenchanted and with balanced stats, to fit smithin perk and requirements.\r\n\r\n====================  !! UPDATE !! ====================  \r\nVersion 2.0 will work exactly like previous one, but this one doesn\\'t require Dawnguard.\r\nI\\'ve also corrected receipes for Hardened Leather Armor, becuse they were all the same for all pieces.\r\nIf you would like to update it anyway, it would be safier to remove previous items form your character (wear them off), since new version contains new item (new names, new IDs), it will prevent possible bug with permanent active effect, when removing custom enchanted item (by console, by deactivating addon) from character.\r\nMaterial cost updates are visible on screenshots.\r\n=====================================================\r\n\r\n\r\nFine Leather Armor (based on Linwe Armor - grayed Thieves Guild Armor) - near equal to elven armor\r\nRequirements:\r\n- Steel Smithing perk to craft, listed under Leather, \r\n- 1 more leather and leather strip than normal leather armor, \r\n- can be tempered with cost of 1 leather and 1 leather strip,\r\nArmor 28\r\nHood 12\r\nGloves 9\r\nBoots 9\r\n\r\nHardened Leather Armor (based on Guild Master\\'s Armor) - better thand scaled armor but worst than glass\r\nRequirements:\r\n- Advanced Armors to craft, listed under Leather\r\n- require more leather and leather stripes than fine leather armor, plus steel ingot for all claps and buckles (armor even require one steel dagger - just to fit model with dagger on left shoulder)\r\n- can be tempered with cost of 2 leather and 2 leather strips\r\nArmor 37\r\nHood 15\r\nGloves 10\r\nBoots 10\r\n\r\nSo now we have some more light armors before getting elven and glass one.\r\n\r\nThis mod also uses standard meshes and textures for amors, so if you are not using any armor retexures or remodels, Fine and Hardened Leather Armors will look exactly like vanilla Linwe and Guild Master\\'s Armors.\r\n\r\nI\\'m using two mods:\r\nCalientes Female Body Mod Big Bottom Edition -CBBE- by Caliente http://skyrim.nexusmods.com/mods/2666 with MAK\\'s body\r\nRemodeled Armor CBBEv3M by MAK http://skyrim.nexusmods.com/mods/13004 \r\nbut they are not necessary for this mod.\r\n\r\nso Credits and thanks go to\r\nBethesda - for creating Skyrim :)",
  "categoryId": "54",
  "version": "2.0",
  "author": "Lonti84",
  "createdUnix": "1346186636",
  "updatedUnix": "1346411966",
  "containsAdultContent": false,
  "uploadedBy": "lonti84",
  "primaryFile": null,
  "files": [
    {
      "fileId": "85510",
      "name": "Leather Armors",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Leather Armors-23243-2-0.zip",
      "uploadedUnix": "1346411966",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/2eabdf70fe1f90b1634521d30eeb1e73bae7276786a62ce5946b7745685b1e9c/analysis/1407134947/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Leather%20Armors-23243-2-0.zip?fid=85510&ttl=1535793321&ri=8192&rs=8192&setec=daa0d7398276b07e75520facbac9c4af"
    }
  ]
}