{
  "modId": 23254.0,
  "modName": "Buildable Home Resource and Tutorial",
  "summary": "A resource and tutorial for making homes.\r\n\r\nIncludes every bookshelf in the game, to combat an annoying bug I have been experiencing either when creating new or copying existing bookcases.\r\n\r\nAlso Includes a small tutorial within the Creation Kit answering a lot of questions I have been asked by other modders. Such as enable parenting, navmesh cut",
  "descriptionHtml": "[center][color=red][size=6]Buildable Home Resource and Tutorial v1.0\r\n\r\n{I apologize for my garbage mic}[/center][/color][/size]\r\n\r\n[center][youtube]UxQa65hIGTY[/youtube][/center]\r\n\r\nLately, the creation kit has been giving me MAJOR issues with bookshelves. Whether I copy and paste them from vanilla interiors, or spend forever trying to make them myself, they always end up broken in game. \r\nIt happens at seemingly random, which makes it all the more irritating to discover and root out the issue...\r\n\r\nI have gotten around it for now by pre-making all my bookshelves to ensure that they work, then copy them from one cell to another.\r\n\r\nSince I\\'m working on loads of stuff, I decided to take the time to make every bookshelf in the game, and even make a few custom ones as well!\r\n\r\nDwemer, common, noble, nordic, orcish, wall-mounted, all in one cell for you to copy and paste into your mod.\r\n\r\nAll bookshelves are aligned at 90 degrees so they are easy to place, and they were built with the grid, so they should line up in rows a tad easier as well.\r\n\r\nBut that is not all!\r\n\r\nThere is also a palce to copy weapon racks and display cases from should you so desire.\r\n\r\nAlso included is a small tutorial on how I did a few things in my Buildable House mod that I get asked about a lot.\r\n\r\nTo use the tutorial, go to the 000_BB_HomeTutorial cell and click on any of the yellow exclimation marks. When you go to edit their attached scripts, you will see each script is a small tutorial.\r\n\r\nThe tutorial covers:\r\n\r\n1. Using markers as Enable Parents for objects.\r\n2. Using one marker for enabling and disabling multiple objects at once.\r\n3. Cutting Navmesh using collision cubes.\r\n4. Making simple scripts to Enable and Disable markers.\r\n5. Scripting a menu system.\r\n6. Making a modular system of purchaseable home upgrades, using menus, dialogue, or quest stages.\r\n7. And a few other tips as well.\r\n\r\nYou don\\'t have to give me credit if you use this to help make a mod, but it is always a kind and courteous gesture to do so! Surely Bethesda will shine down upon thee for comitting such acts of generosity.\r\n\r\nPS: Sorry about resorting to text tutorials, but my mic is terrible and its not on my list of priorities to purchase a new one...\r\nMy mic likes to pick up on fans way across my house, and makes it sound as if I am being abducted by aliens. I had to heavily audacify (new verb?) this video\\'s audio to be comprehensible....\r\n\r\nIf the time soon comes I acquire a magnificent microphone, then I will take the time to upload video tutorials on this shtuff.",
  "categoryId": "82",
  "version": "1.0",
  "author": "Supernastypants",
  "createdUnix": "1346200133",
  "updatedUnix": "1346200403",
  "containsAdultContent": false,
  "uploadedBy": "supernastypants",
  "primaryFile": null,
  "files": [
    {
      "fileId": "84953",
      "name": "BuildableHome_Resource_Tutoiral",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "40",
      "fileName": "BuildableHome_Resource_Tutoiral-23254-1-0.rar",
      "uploadedUnix": "1346200403",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/55dfee90acb02464e094ad943db73c1d9deaa3d39c20146e3900807bb716b47f/analysis/1407129242/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BuildableHome_Resource_Tutoiral-23254-1-0.rar?fid=84953&ttl=1535793354&ri=8192&rs=8192&setec=d60c1f90f64f3738f6ff17ba814e84f3"
    }
  ]
}