{
  "modId": 23313.0,
  "modName": "Riverside Farm - Basic Nord farm player home",
  "summary": "well there never seemed to be many farm mods on nexus so here you go...A beautiful farm with stunning views situated next to battle-born farm, this mod features an outdoor blacksmith, an underground smugglers den, vegetable patch, animals and a relaxing dock where you can watch the sun go down. ",
  "descriptionHtml": "guys please check out this mod which includes an edited version of the house and a family to go with it. http://skyrim.nexusmods.com/mods/42678/?tab=1&navtag=%2Fajax%2Fmoddescription%2F%3Fid%3D42678%26preview%3D&pUp=1\r\n\r\nFirst off if you have any recommendations you would like to see happen in this mod just please leave a comment and i will do my best to include it :) DESCRIPTION: a small farm complete with vegetable patch, windmill and a few animals beside the house inside the house you'll find a large fire pit with cooking pot/spit, plenty of storage and a nice homey atmosphere although most of the tools and useful items are outside. Behind the house there is a small hay storage area with a blacksmith forge and a pretty little fishing dock. the farm is located opposite battle-born farm near whiterun, there is a map marker and it is fully nav-meshed for your followers and such. But the farm also had a dark story behind it, a gang of smugglers were using this farm as an effective disguise for their operations, the dock was used to transport the items and the basement for storing it, until a group of unsatisfied customers decided to take over the business and take out the previous owners, you as dragon-borne must kill theese filthy intruders and claim the farm and all of its contents for yourself. hope u enjoy and dont forget to rate/comment \r\n\r\n VERSION 1.5,\r\n ADDED A SLEEPING TREE SAP DISTILLERY AS ASKED FOR BY Thoragoros :D\r\nfixed the glitchy areas\r\n\r\nps: glad there were over 320 people willing to try this, thank you all!!! YOU GUYS ARE THE BEST! now come on we can make it to 400.",
  "categoryId": "67",
  "version": "1.5",
  "author": "burgerman1000",
  "createdUnix": "1346249592",
  "updatedUnix": "1346773551",
  "containsAdultContent": false,
  "uploadedBy": "burgerman1000",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86243",
      "name": "Riverside Farm",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "87",
      "fileName": "Riverside Farm-23313-1-0.rar",
      "uploadedUnix": "1346693869",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e8e523b793182516b9425cba9ba774be246f0eae4ca134ccc12aabb2c1e1fc76/analysis/1407143545/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riverside%20Farm-23313-1-0.rar?fid=86243&ttl=1535793450&ri=8192&rs=8192&setec=11ce0401a8a4b58709d107b0b52d21f0"
    },
    {
      "fileId": "86407",
      "name": "Riverside Farm",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "98",
      "fileName": "Riverside Farm-23313-1-5.rar",
      "uploadedUnix": "1346773551",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/d54a1f37d83c72b37da50aab0703ab63391a7299156026141d467d97d439732c/analysis/1407145563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riverside%20Farm-23313-1-5.rar?fid=86407&ttl=1535793451&ri=8192&rs=8192&setec=d746d8377fa71b8a7719394442b90033"
    }
  ]
}