{
  "modId": 23312.0,
  "modName": "Insanitys Dragonbane for SkyRe",
  "summary": "Modified plugin file to use Insanitys Dragonbane (by Insanitysorrow) and Skyrim Redone (by T3nd0) together.",
  "descriptionHtml": "Description:\r\nModified plugin file to use Insanitys Dragonbane (by Insanitysorrow) and Skyrim Redone (by T3nd0) together.  This simply changes the weapon stats and crafting and tempering requirements to balance with Skyrim Redone.  This was originally intended for my own use, but if there\\'s anything you don\\'t like about my changes or want unenchanted variations added, just leave a comment and I\\'ll consider changing it.  I might even patch more custom weapons if anyone requests them.\r\n\r\nUPDATE: The current file no longer requires Dawnguard as a master, and will work with either version of Skyrim Redone! Thanks to T3nd0 himself for providing the solution!\r\n\r\nRequirements:\r\nA legitimate copy of Skyrim for PC (support will NOT be given for cracked or pirated games.)\r\nSkyrim Redone: http://skyrim.nexusmods.com/mods/9286\r\nand Insanitys Dragonbane: http://skyrim.nexusmods.com/mods/19180\r\n\r\n\r\n\r\nWhat Exactly I Changed:\r\nFirst of all, the swords had \\\"Katana\\\" and \\\"Nodachi\\\" appended to their names to make it more obvious which is which.  They were also modified to match the damage, reach and speed settings used in SkyRe, and the proper keywords were added so they will benefit from Katana and Nodachi perks respectively...\r\n\r\nTempering and Smithing requirements were also changed to match SkyRe\\'s smithing logic.  Now will you will need BOTH Dragon Armor AND Arcane Blacksmith (renamed to Dragoncraft and Arcane Artisan in SkyRe.)  Also the materials needed to craft and temper the weapons have been changed; you will need one dragonbone, one leather strip, one corundum ingot, steel ingots (two for katana, three for nodachi,) one void salts and one filled grand soul gem.  Tempering will require two steel ingots and one dragon bone for either weapon.\r\n\r\n\r\n\r\nSmithing Logic:\r\nIf you find my smithing requirements reasonable and logical, you can skip this paragraph.  If you think I\\'m a terrible person and this plugin sucks... please read on.\r\n\r\nIn SkyRe, steel katanas and nodachis require two/three steel ingots, one corundum ingot, and one leather strip, so Dragonbane Katanas and Nodachis require the same materials, plus one dragonbone for the handle.  The void salts and grand soul gem are because the swords (currently) come pre-enchanted with extra damage against dragons and shock damage against everything else.  As it\\'s a magic weapon already, it makes sense for it to require Arcane Blacksmith, and ALL of the weapons and armor in SkyRe require the perk used to craft a particular item in order to temper it at all (example... you cannot temper a steel dagger until you have Steel Smithing.)\r\n\r\n\r\nInstallation, the Most Important Part:\r\nTHIS FILE IS NOTHING BUT AN ESP.  You will need to install Insanitys Dragonbane separately from this page: http://skyrim.nexusmods.com/mods/19180\r\n\r\nDownload and install the main file and the optional file that says \\'Insanitys Craftable Dragonbane.\\'  (Currently this esp only caters to the craftable version of the mod.)  You can also download the Alternate Texture if it suits your fancy.  Make sure neither of the esp\\'s from the original mod are active.  Download and install my esp.\r\n\r\n\r\n\r\nI Have Permissions. Do You?:\r\nI have personally requested and been granted permission from InsanitySorrow to post this patch, a modified version of his own plugin, on the Skyrim Nexus.\r\n\r\nThis patch and any variations of it created by me are NOT to be uploaded on any other website than the Skyrim Nexus.  This is where I asked permission to post it.  If you wish to create your own variation of the patch for whatever reason, ask InsanitySorrow.  It\\'s his mod you\\'re working with.\r\n\r\nIf at any time for any reason whatsoever, InsanitySorrow requests this file be removed, it shall be so.\r\n\r\n\r\n\r\nGive Credit Where Credit is Due:\r\nBethesda, for making the Creation Kit...\r\nThe Wrye Bash Team, for creating Wrye Bash...\r\nT3nd0, for the wonderful gameplay overhaul known as Skyrim Redone...\r\nand of course InsanitySorrow, for his awesome Dragonbane mod and permission to modify his esp.",
  "categoryId": "55",
  "version": "1",
  "author": "KrazyTech",
  "createdUnix": "1346248494",
  "updatedUnix": "1346423677",
  "containsAdultContent": false,
  "uploadedBy": "KrazyTech",
  "primaryFile": null,
  "files": [
    {
      "fileId": "85533",
      "name": "Insanitys Craftable Dragonbane for SkyRe",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Insanitys Craftable Dragonbane for SkyRe-23312-1-1.7z",
      "uploadedUnix": "1346423677",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1577ff5b9c1f3228652d2a770a7ee33e59c20133fcaf55af3b3b612c1a8f76bc/analysis/1407135182/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Insanitys%20Craftable%20Dragonbane%20for%20SkyRe-23312-1-1.7z?fid=85533&ttl=1535793449&ri=8192&rs=8192&setec=d69101656199e89228fb048e0bfbfbc0"
    }
  ]
}