{
  "modId": 23322.0,
  "modName": "Blood Magic Evolved",
  "summary": "Adds small amount of Vampire Lord Blood Magic to human mode. With out the hassle of going into Vampire Lord mode. Also didn\\'t add all because Vampire Lord mode would be useless then.",
  "descriptionHtml": "Version 2\r\n************************\r\nShout Fixed\r\n***************\r\nAdded Spell Tomes to Feran\\'s Shop Also Moved Chest Location if you are still having trouble seeing them.  \r\nAdded A few more spell and a shout Which will be learned by a DoomStone inside the castle  \r\n************************************\r\nPerks In the Vampire Lord Form\r\nCall of Night: allows you to use the shout\r\nNight Cloak: Gives you a cloak in Human form that heals and does damage\r\n**********\r\nSpell Tome: DrainLife\r\nSpell Tome: Blood Cloud\r\nSpell Tome: Abominations \r\n********\r\nWill Add more stuff later been busy.\r\n\r\nUpdate Video\r\nhttp://youtu.be/xbz03qkRR1M\r\nBlood Magic Evolved update 1.5\r\n\tChanges\r\n•\tBlood Drain\r\no\tDamage is reduced but it is still strong  (not too overpowered)\r\n•\tBlood Curse\r\no\tReduced paralyze duration to about 9 seconds (it was about 2 minutes before)\r\n•\tBlood Grip\r\no\tIncreased damage done by this spell\r\nAdditions\r\n•\tBlood Spike\r\no\tNew spell  (like Serana uses but WAY BETETR) spell has chance to instantly skill some people  (depends on Frost resistance) Also has a chance to paralyze, slow, and stagger.\r\no\tYou can rapid fire this (see video)\r\n•\tPerk Blood Bounding\r\no\tAllows you to conjure ebony dagger damage is 32 so it’s not too strong (but as a vampire fighting in day time THIS Will SAVE your LIFE)\r\no\tRestores Health, Magicka, and Stamina (for use During the Day)\r\n•\tPerk Superiority Rank 1\r\no\tAllows you to summon Vampire Master  (very powerful)\r\n•\tSuperiority Rank 2\r\no\tAllows you to summon Vampire Lord your other Half (also very powerful)\r\n•\tMasters of Undead\r\no\tDon’t worry about this (unless you know how to create a new shout spell then I could really use your help)\r\n\r\n\r\nBlood Magic Evolved:\r\nAdds all the Primary Vampire Blood Magic skills to your Human form. Everything is standard except for some few changes here and there.\r\n\r\nNote* you can dual cast some of these skills by going in their respective trees and adding the perk dual casting. Example Drain Life was added to the Destruction menu so if you add the destruction dual cast perk you will be able to dual cast it and so on.\r\n\r\nNote 2* You won’t be able to use These skills if you do not have the perk. For example Vampric Grip you can learn the skill and you can see the animation of using it but until you actually have the perk it won’t work. This goes for the rest of the skills.\r\n\r\n•\tVampric Grip\r\no\tPull a creature towards you while doing choke damage release spell to send enemies flying\r\n•\tSummon Gargoyle\r\no\tSummons standard Gargoyle (with rank 2 Summons Gargoyle Sentinel much stronger)  \r\n•\tCorpse Curse \r\no\tParalyzes target for 10 seconds also has a little A.O.E radius\r\n•\tDrain Life (Over Powered)\r\no\tMuch stronger than Vampire Lord Drain but also adds to Vampire Lord Perk tree while in human form.\r\n•\tRaise Dead\r\no\tMuch Stronger than Vampire Lord Reanimate. You can resurrect much stronger beings. (With Master of Undead you can reanimate for longer periods and have 2 at your command)\r\nAlso adds three new Vampire Lord Perks into the Game and Modifies one.\r\n•\tMaster of Undead Rank 1\r\no\tYour reanimated minions live longer and do a little bit more damage.\r\n•\tMaster of Undead Rank 2\r\no\tYou can now reanimate and control 2 undead beings. Gargoyles included.( 2 Gargoyle sentinels)\r\n•\tSummon Gargoyle Rank 2\r\no\tAllows you to summon a stronger gargoyle (Gargoyle Sentinel)\r\n•\tUnearthly Will\r\no\tNow slightly increased damage done in Vampire Lord mode by just a little\r\n\r\nTo obtain these skills you have to have Dawnguard and they are located in a chest behind the Blood Fountain in the room where you learned about your Vampire Lord Powers. Also I tried creating a dagger that would allow you to Banish your summoned creatures if the stayed too long but that failed. (If someone could help I would appreciate. I just started using the creation kit. *PS the dagger is still in the chest and it doesn’t lose charge)\r\n\r\nInstallation:\r\nJust drag BloodDrain.esp into your data folder and you are all set.\r\n\r\nIf there are any bugs please let me know\r\n\r\nIt is compatible with Better Vampires by Brehanin 5_51\r\nI\\'m not sure about Royal Blood by xyks ",
  "categoryId": "93",
  "version": "2",
  "author": "DarthJay",
  "createdUnix": "1346268645",
  "updatedUnix": "1359551862",
  "containsAdultContent": false,
  "uploadedBy": "DarthJay",
  "primaryFile": null,
  "files": [
    {
      "fileId": "85154",
      "name": "BloodMagicEvolved",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "BloodMagicEvolved-23322-1-0.rar",
      "uploadedUnix": "1346268884",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6c48415eea1963db3719c5634e71b9d4577dee7cf07614b8fe6661122e17a009/analysis/1407131464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BloodMagicEvolved-23322-1-0.rar?fid=85154&ttl=1535793465&ri=8192&rs=8192&setec=b9a2e0632697caa97d2a818efd156f4c"
    },
    {
      "fileId": "85426",
      "name": "BME Update 1_5",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10",
      "fileName": "BME Update 1_5-23322-1-5.rar",
      "uploadedUnix": "1346366991",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/3307b77cc9ebc483b2e949ee4ab011386c0b2b63d8c0ccc0443e5edc20d74f1a/analysis/1407134103/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BME%20Update%201_5-23322-1-5.rar?fid=85426&ttl=1535793465&ri=8192&rs=8192&setec=ba404b72d020d3233121238347306db3"
    },
    {
      "fileId": "1000005897",
      "name": "BloodMagicEvolved",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "40",
      "fileName": "BloodMagicEvolved-23322-2.rar",
      "uploadedUnix": "1359551862",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/e4c1f53640281aaf48badccf99a4b2a095d5dd91e25e651d29a0b582e97e567a/analysis/1407387245/",
      "changelogHtml": " Added Spell Tomes to Feran&#39;s Shop Also Moved Chest Location if you are still having trouble seeing them. <br/> \n Added A few more spell and a shout Which will be learned by a DoomStone inside the castle <br/> \n ******The Shout does the same thing as Auriels Bow but the effects are permanent so you might want to use the Bow. The eclipse goes away but you don&#39;t get any negative Sun effects <br/> \n Fixed Shout <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BloodMagicEvolved-23322-2.rar?fid=1000005897&ttl=1535793466&ri=8192&rs=8192&setec=572f62affcc2d9e39e89cd0b0c07fb39"
    }
  ]
}