{
  "modId": 23338.0,
  "modName": "Summon Psijic Ritemaster - Iachesis",
  "summary": "Allows the player to summon the master of Mysticism and original leader of the Psijic Order, Iachesis.",
  "descriptionHtml": "Version 1 - Has a 24 hour ingame recast timer\r\n\r\nVersion 2 - Removes the recast timer to summon Iachesis.\r\n\r\nIachesis was the original leader of the Psijic Order and was the teacher to two of the greatest magic wielders in Tamriel (Vanus Galerion and Mannimarco).  Iachesis was responsible for defeating the Maomer invasion of King Orgnum and was instrumental in making the Isle of Artaeum disappear.  The decision to do this has been unknown and only Iachesis and his councel know the reasoning of this act.  What happened to him since has been unknown.  This summon allows the player to summon his legendary spirit in battle.\r\n\r\nTo find Iachesis\\'s lecture book, you must discover Pilgrim\\'s Trench.  You must dive into the depths of the ocean and investigate the sea floor to find Iachesis\\' chest and anything on it.  Previous adventurer\\'s discovered his missing chest, but all have met untimely doom for unknown reasons. \r\n\r\nIachesis has the following:\r\n1. Mystic Grab:  Iachesis uses Mysticism to pull his enemies towards him so that he can unleash additional damage with his next ability.  \r\n2. Mystic Field:  Iachesis has a constant Mystic aura surrounding him that allows him to push his opponents into objects to damage them.\r\n3. Mystic Blast:  Iachesis unleashes a blast of Mystic energy that tosses his foes in many directions.  Upon impact, Iachesis will further toss his opponents into walls, ceilings, objects, and the floor for additional damage.\r\n4. Psijic Transport:  Iachesis has the ability to teleport throughout the battlefield.\r\n5. Mystic Staff mastery:  Iachesis will wield 1 to 7 Mystic staffs to assist him in combat.  Each staff containts mystical elemental energies.  He can wield the following:  Flare, Stalagtite, Surge, Cyclone, Torrent, Avalanche, and Mystic staffs.\r\n6. Modified stats magicka\r\n7. Will level up with the player to 81.\r\n\r\nNotes: Because Iachesis is a very powerful Psijic monk, and was the founder of the order, he is nearly invinsible with all his mystical abilities.  Do not be surprised if you see him tossing around armies of opponents like ragdolls.  As a means of balance, he does have low health, so of course arrows and projectiles are his weakness.  He also has a slight disadvantage against foes that cannot be knocked down... his powers specialize in the ability to throw his opponents into objects, so don\\'t expect him to be tossing around dragons or mammoths.\r\n\r\nThis mod should not cause any issues with any other file out there. If there are any technical issues please let me know.  Thank you again for checking this mod out, and I hope you enjoy it when you give it a try! ",
  "categoryId": "75",
  "version": "2",
  "author": "zeroeternalz",
  "createdUnix": "1346302048",
  "updatedUnix": "1346302181",
  "containsAdultContent": false,
  "uploadedBy": "zeroeternalz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "85221",
      "name": "Summon Psijic Ritemaster - Iachesis",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18",
      "fileName": "Summon Psijic Ritemaster - Iachesis-23338-1.zip",
      "uploadedUnix": "1346302139",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/6e87c158f36a5cffd0213880abde6c55119aa79c066762a9ac7a4d604be3e70a/analysis/1407132132/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Psijic%20Ritemaster%20-%20Iachesis-23338-1.zip?fid=85221&ttl=1535793489&ri=8192&rs=8192&setec=6f6da484477b42e55a513938f5595a55"
    },
    {
      "fileId": "85222",
      "name": "Summon Psijic Ritemaster - Iachesis v2",
      "version": "2",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "18",
      "fileName": "Summon Psijic Ritemaster - Iachesis v2-23338-2.zip",
      "uploadedUnix": "1346302181",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/99018e4d77ea76810cc5a23c5c3dbb9810ebe260ead8e192f0a2ac08f012848e/analysis/1407132184/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20Psijic%20Ritemaster%20-%20Iachesis%20v2-23338-2.zip?fid=85222&ttl=1535793489&ri=8192&rs=8192&setec=6502789ee3459b3827395774b790abde"
    }
  ]
}