{
  "modId": 23341.0,
  "modName": "Visually Adequate Magic",
  "summary": "WIP Overhaul of all spells to be more balanced and visually adequate.",
  "descriptionHtml": "WIP Overhaul of all spells to be more balanced and visually adequate. For now only spells have had their numbers completely changed. Scrolls and staffs await their turn.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nDescription:\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nGoal of this mod is to make Skyrim magic system more realistic and balanced. What do I mean by visual adequateness? Ever wondered why Ice Spike which clearly went through that bandit head and is now stuck in his brain dealt only 25 damage? Its because that spell damage is not really adequate to its visuals. This mod is aimed to fix things like this.\r\n\r\nMagic in TES universe is something everyone can use and I want to keep this mod true to that. I also want to make magic feel much more visually adequate and give spells that \\\"achievement\\\" feel. Therefore magic in this mod is much more powerful and destructive, but being a mage requires a lot more work and focus. At the same time there are couple of new spells that can be used by everyone and which fit into spellsword gameplay much better than the vanilla spells.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nSpells:\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nIllusory Flames - creates a small explosion of illusory flames from caster hand that will frighten the shit out of most inexperienced people and the less savage beasts.\r\n\r\nEmber - a kind of replacement for Flames. As everyone in TES universe can use magic this is a kind of The Most Basic destruction spell almost everyone can cast. Its main use is setting oil on fire, but can be used to actually set people on fire (its rather unreliable though).\r\n\r\nFrostbite - this spell will deal only minor damage, but will briefly stop in its tracks even the most badass motherfuucker out there granted you soften them up first.\r\n\r\nFlash - a magical flash of light that briefly stuns people. This spell temporally blinds and renders immune to any other flashes. It will scare off animals.\r\n\r\nMagelight - creates a hovering light that surprisingly comes out of the mage\\'s hand and stuns nearby enemies. Just like Flash, it will blind and scare off animals.\r\n\r\nConjure Ice Wraith - summon a weak, but still badass ice wraith.\r\n\r\nTrick - trick your enemy into throwing his weapon into the air. Won\\'t work on the same target twice.\r\n\r\nCreate Illusion - laugh at your enemies while they try to kill something that isn\\'t there..\r\n\r\nCreate Illusions - create not one, but three illusions!\r\n\r\nCreate Illusory Spider - this one is scary!\r\n\r\nOakflesh, Stoneflesh, Ironflesh, Ebonyflesh and Dragonhide - they all grant now bonus resistances and also weaknesses! \r\n\r\nSpectral Arrow - a glorious comeback! I edited the looks and sounds and its pretty neat spell now.\r\n\r\nUncanny Dodge - this is not a spell. This is an ability a pure warrior type character will need desperately to have a chance against mages. It lets you dodge all incoming projectiles and attacks for 1 second at the cost of stamina. The animation works properly only in 1st person so I advise NOT playing in 3rd person. To get it you need to find a skill book (look for books about combat). \r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nAdditional changes:\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nStarting health, magicka, stamina and weight capacity have been changed for all races to be more realistic (orc mages? wtf?). Starting spells have been removed.\r\n\r\nDual casting is more efficient and powerful, but also takes longer.\r\n\r\nYou can summon more monsters at the same time now.",
  "categoryId": "93",
  "version": "",
  "author": "tomislawus",
  "createdUnix": "1346321772",
  "updatedUnix": "1346762518",
  "containsAdultContent": false,
  "uploadedBy": "tomislawus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86392",
      "name": "Visually Adequate Magic",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "111",
      "fileName": "Visually Adequate Magic-23341-.zip",
      "uploadedUnix": "1346762518",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/161871b4c725274737c62cda3e099928ffec6600d0c797cfb0e8c4d675a0d2a4/analysis/1407145325/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Visually%20Adequate%20Magic-23341-.zip?fid=86392&ttl=1535793495&ri=8192&rs=8192&setec=319b4cc8eae3a352a4cab45b6ee66548"
    }
  ]
}