{
  "modId": 2334.0,
  "modName": "Jack of blades mask addon Insanity",
  "summary": "This is an alternative jack of blades mask that retextures the volsung dragonpriest mask and the Otar mask.\r\n\r\n2nd out of 3",
  "descriptionHtml": "\r\n····················\r\nSkyrim mod\r\n····················\r\n\r\n\r\n\r\nWhat is it?\r\n--------------------------\r\n\r\nThis is a brand new retexture of the notorious villian Jack of blades mask from one of my favourite role playing game of all time (Fable 1) \r\nTwo dragonpriest helmets have been retextured one is light armour and one is heavy armour which includes the Volsung helmet and the Otar helmet also included is retextured hood that goes with them.\r\n\r\n\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=1234\r\n\r\nDownload this mod whick enables you to craft them at a blacksmiths anvil using dragonscales and/or dragonbone.\r\n\r\nAlternatively you can typ in these command console lines to obtain them instantly:\r\nVolsung 00061CAB\r\nOtar 00061Cc2\r\n\r\nAs i understand there is already a jack of blades armour retexture however it cannot be completed until the construction sets release and so i am not doing any armour retextures because of this because\r\n we dont want jack of blades running around everywhere :P\r\n\r\nThis is an addon for my previous mask of blades. In the game fable jack of blades has 2 other masks names \\'Insanity\\' and \\'Hate\\' the one hes wearing is called \\'Fear\\' i intended to make all 3 so when i create his armour i can place the masks straight onto his chest likee in the game fable.\r\nThis mask is \\'Insanity\\' hope you enjoy\r\n\r\nHow do I install it?\r\n--------------------------\r\n\r\nJust unpack the files in your data folder and overwrite if prompted overwrite.\r\n\r\n\r\nCompatibility\r\n--------------------------\r\n\r\nThis is only a retex, so there are no compatibility issues except with mods that alter the same files as this one.\r\n\r\n\r\nFuture release\r\n==========================\r\n**************************\r\n\r\nThis at the moment is just the textures for the second mask of the blades however im working on the 3rd and final 1 at this moment.Upon release of the long awaited construction kit i plan to recreate his armour and more importantly the sword of aeons.\r\nThis mask and jack of blades other two masks masks (Hate and Insanity) will be unique masks with unique strengths when the construction kit comes out but for now this is all i can do.\r\n\r\nFeel free to contact me about any ideas for fable rebuild mods and i will certainly think them over.\r\n\r\nIf you like the look of this check out the mask Fear already released.\r\n\r\n\r\nThank you and endorse if you like :)",
  "categoryId": "54",
  "version": "1.0",
  "author": "F16UR3 4",
  "createdUnix": "1322822866",
  "updatedUnix": "1322826820",
  "containsAdultContent": false,
  "uploadedBy": "121935",
  "primaryFile": null,
  "files": [
    {
      "fileId": "6196",
      "name": "Mask retexture Insanity",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1795",
      "fileName": "Mask retexture Insanity-2334-1-0.rar",
      "uploadedUnix": "1322826820",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fc76ca8c638c0166dcf04c0c1707614400d450021a43774e9a88e91439175ea6/analysis/1406469063/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mask%20retexture%20Insanity-2334-1-0.rar?fid=6196&ttl=1535756553&ri=8192&rs=8192&setec=b0232879c1c56018b6ebf00f188a1e02"
    }
  ]
}