{
  "modId": 23343.0,
  "modName": "Maids II - Deception - German version VERALTET",
  "summary": "wird nicht fortgesetzt&#33; Maids II: Deception (M2) ist eine Abenteuer- und Romanzen-Mod. Mit einer geplanten Veroeffentlichung von fuenf Episoden, werden durch M2 neue Feature dazugefuegt und die Questreihe ausgebaut.",
  "descriptionHtml": "[center][color=#ff0000][size=4][b]\r<br />AUFGRUND VON ZEITPROBLEMEN LEIDER EINGESTELLT [color=#ffffff]/// [/color]DIE DATEIEN WERDEN ONLINE GELASSEN DAMIT DIE MOD BIS ZU DIESEM PUNKT AUF DEUTSCH GESPIELT WERDEN KANN [color=#ffffff]/// [/color]MIT VERSION 5.0 WIRD WOHL EINE VOLLSTÄNDIGE ÜBERSETZUNG ONLINE GESTELLT, UNSERE ÜBERSETZUNG HIER WIRD DANN AUCH OFFLINE GENOMMEN WERDEN [color=#ff0000][size=4][b][color=#ffffff]///[/color][/b][/size][/color] FÜR GENAUERE INFORMATIONEN FOLGT BITTE DER HAUPT-MOD VON ENTER_77&#33;[/b][/size][/color]\r<br />\r<br />\r<br />[color=#ffff00]NEWS[/color] Fertige Version 3.2 hochgeladen. Akkarin1 und raanubis hatten bisher keine Zeit die Übersetzung zu spielen und zu sehen, ob es irgendwelche Probleme gibt. Sollte es tatsächlich welche geben, bitte meldet euch&#33; Einige Bücher/Notizen etc sind noch nicht übersetzt. Viel Spaß mit Episode III &#33;[/center]\r<br />\r<br />Ich suche schöne Screenshots aus dem Spiel, um hier einen schöneren Eindruck zu hinterlassen. Meine Bilder sind ein bisschen trist ;) Also wer schöne Bilder hat, ist herzlich dazu eingeladen sie hier zu zeigen&#33; Würde mich sehr freuen&#33;\r<br />\r<br />DIES IST NUR EINE ÜBERSETZUNG, AUCH WENN ALLE DATEIEN HIER VERFÜGBAR SIND&#33;&#33;&#33;\r<br />Deshalb geht auch ein großes Danke an Enter_77, dass ich die Ressourcen hier hochladen darf.\r<br />\r<br />Die englische Hauptmod findet ihr hier: [url=http://skyrim.nexusmods.com/mods/16021]Maids 2: Deception[/url]. Bitte zollt der Arbeit der Modder Respekt, indem ihr die Hauptmod unterstützt (-&gt; endorse). Wenn euch meine Arbeit gefällt, dürft ihr das natürlich auch gerne bei mir machen.\r<br />\r<br />Wenn euch Formatierungsfehler in Aufschriften oder so auffallen, meldet euch bitte bei mir. Dasselbe gilt für fehlerhafte, oder sogar ganz fehlende Übersetzungen. Einige Strings halten sich nämlich hartnäckig, egal wie oft ich sie übersetze und abspeichere. Zudem hatte ich noch keine Zeit meine Übersetzung durchzuspielen, was ich in den nächsten Tagen aber nachholen werde. Wenn ihr also lieber noch etwas auf eine verbesserte Version warten möchtet, geduldet euch noch einige wenige Tage. Danke.\r<br />\r<br />Wenn ihr Probleme habt, die nicht direkt mit der Übersetzung zu tun haben, könnte ihr gerne hier um Hilfe fragen.\r<br />\r<br />[b][u]Wichtig:[/u][/b] \r<br />Die richtig großen Bücher wie zum Beispiel die Geschichte der Familie Pinder ist noch nicht übersetzt, weil das ziemlich viel Zeit braucht, die ich nicht habe.\r<br />\r<br />[center]HINWEISE[/center]\r<br />\r<br />[color=#ff6600][size=2][b]1)[/b][/size][/color] Maids II: Deception (M2) ist mit 1.033 Skripten eine sehr skript-intensive Mod. Es wird [color=#ffff00][b][u]dringendst empfohlen[/u][/b][/color] M2 in einem neuen, sauberen Spielstand, mit so wenigen skript-intensiven Modifikationen wie möglich zu starten. Es wird empfohlen, diesen Spielstand für die folgenden Episoden aufzubewahren.\r<br />\r<br />Wenn man einen existierenden Spielstand benutzt, ist es wichtig [color=#ffff00][b][u]einen Backup des Saves zu machen[/u][/b][/color] bevor man M2 installiert und aktiviert. Wenn M2 einmal deaktiviert und deinstalliert wird, [u]bleiben[/u] Skriptdateien in dem Spielstand zurück, die die Stabilität des Spielstands und anderer Modifikationen die Skripte hinzufügen (wie zum Beispiel Quest Mods) beeinflussen. Dieses Problem gibt es aufgrund von Skyrims Skript- und Spielstand-System welches dafür sorgt, dass Skripte von deinstallierten Modifikationen noch längere Zeit nach der Deinstallation mit dem Spielstand verknüpft sind.\r<br />\r<br />Die folgenden Probleme die einem in M2 begegnen können sind Anzeichen dafür, dass ein Spielstand die negativen Effekte der gebliebenen Skripte erfährt:\r<br />[list][*]Probleme mit dem Questfortschritt\r<br />[*]Szenen/NPC-to-NPC Konversationen reißen ab (NPCs erscheinen mit der &#34;Diese Person ist beschäftigt.&#34; Meldung wenn man sie aktiviert)\r<br />[*]CTDs(Crash to Desktop -&gt; Absturz auf den Desktop)\r<br />[/list]\r<br />\r<br />Spieler die es trotzdem versuchen möchten und diese Probleme in Kauf nehmen möchten, werden auf die [url=http://skyrim.nexusmods.com/download/1000003519]Resource Liste[/url] in der Optional-Kategorie in der Downloadsektion verwiesen, um manuell den Fortschritt der Quest einzuleiten, falls nötig.\r<br />\r<br />Bitte lies das FAQs für weitere Vorschläge was zu tun ist, sollten Probleme auftauchen.\r<br />\r<br />\r<br />[color=#ff6600][size=2][b]2)[/b][/size][/color] Diese Mod beinhaltet sexuelle Thematiken. Folgende Episoden werden diese sexuellen Inhalte einführen. Sie bleiben jedoch rein optional und werden durch ein separates Plug-in eingebaut. \r<br />\r<br />\r<br />[center][color=#ffff00][size=3][u][b]Vor-Installation[/b][/u][/size][/color][/center]\r<br />\r<br />[color=#ff6600][size=2][b]1)[/b][/size][/color] Vergewissere dich, dass die neuste Skyrim-Version([color=#ffff00]1.9[/color]) von Steam installiert wurde. Unautorisierte Kopien des Spiels könnten inkompatibel mit M2 sein.\r<br />\r<br />[color=#ff6600][size=2][b]2)[/b][/size][/color] Erstelle einen Backup Spielstand bevor du das Spiel, mit M2 aktiviert, startest. Das ist eine Schutzmaßnahme, die immer getroffen werden sollte bevor man eine Quest-Mod beginnt.\r<br />\r<br />[color=#ff6600][size=2][b]3)[/b][/size][/color] Bitte installiere alle benötigten und empfohlenen Modifikationen bevor du das Spiel, mit M2 aktiviert, startest.\r<br />\r<br />[color=#ff6600][size=2][b]4)[/b][/size][/color] Diese Mod ist zur Zeit noch nicht vollständig synchronisiert. [u]ALLE Untertitel[/u] müssen aktiviert werden.\r<br />\r<br />[color=#ff6600][size=2][b]5)[/b][/size][/color] Ein bestimmter Körper-Typ wird [u]nicht[/u] benötigt. Wenn dein installierter Körper-Typ nicht während der Installation aufgelistet wird, wähle den empfohlenen oder den, der deinem installierten Körper-Typ am ähnlichsten ist.\r<br />\r<br />[color=#ff6600][size=2][b]6)[/b][/size][/color] Füge folgende Zeile in deine SkyrimPrefs.ini ein, diese befindet sich unter &#34;DocumentsMy GamesSkyrim&#34;. Damit verhinderst du das Gras in den Innenräumen auftaucht.\r<br />\r<br />[Grass]\r<br />bAllowLoadGrass=0\r<br />bAllowCreateGrass=1\r<br />bDrawShaderGrass=1\r<br />\r<br />\r<br />[center]VORAUSSETZUNGEN\r<br />\r<br />[color=#ffff00][size=3][u][b]Benötigt[/b][/u][/size][/color]\r<br />-- [b]Keine[/b] --\r<br />\r<br />[color=#ffff00][size=3][u][b]Kann benötigt werden[/b][/u][/size][/color]\r<br />[b]Diese werden nur für bestimmte Installationen und optionale Feature benötigt[/b][/center]\r<br />\r<br />[color=#ff6600][size=2][b]1)[/b][/size][/color] [b][url=http://skse.silverlock.org/]Skyrim Script Extender (SKSE)[/url][/b]\r<br />\r<br />[list][*] Nur benötigt wenn das folgende SKSE-Plug-in, Silent Voice, für unvertonte NPC-Zeilen benutzt wird.\r<br />[*] [color=#ffff00][b]ANMERKUNG #1[/b][/color] Einige Spieler konnten durch die Installation von SKSE CTDs und Probleme mit dem Questfortschritt beheben. Auch wenn Silent Voice nicht benutzt wird, wird die Installation von SKSE deshalb stark empfohlen.\r<br />[/list]\r<br />[color=#ff6600][size=2][b]2)[/b][/size][/color] [b][url=http://skyrim.nexusmods.com/mods/14884]Silent Voice[/url][/b]\r<br />[list][*] SKSE wird benötigt; wird nur benötigt wenn Lippen-Bewegungen und die Dialogzeilen von unvertonten NPCs angezeigt werden sollen.\r<br />[/list]\r<br />[color=#ff6600][size=2][b]3)[/b][/size][/color] [b][url=http://skyrim.nexusmods.com/mods/3863]Fores New Idles in Skyrim (FNIS)[/url][/b]\r<br />[list][*] Wird nur benötigt wenn die Stripper in Palast Euphoria im Spiel aktiviert sind. Bitte lies die FNIS Readme für Spielerinstallationen durch.\r<br />[/list]\r<br />[color=#ff6600][size=2][b]4)[/b][/size][/color] [b][url=http://skyrim.nexusmods.com/mods/11811]SkyUI[/url][/b]\r<br />[list][*] [b]Installiert[/b] - SkyUI fügt das MCM Menü System für M2 ein, welches verschiedene Features bereit hält. U.a. Magd Management, diverse Einstellungen, sowie eine Deinstallationsmöglichkeit.\r<br />[/list]\r<br />[list][*] [b]Nicht installiert[/b] - deaktiviert das M2 MCM Menü; Man muss wie gewohnt in das Haus der Pinders gehen, das sich in Jonestead befindet und die Einstellungen dort vornehmen, über das Notizbuch\r<br />[/list]\r<br />[list][*] [color=#ff0000]Beachte: [/color] [url=http://skyrim.nexusmods.com/mods/29440]SkyUI-Away[/url] kann installiert werden, wenn man das MCM Menü verwenden will, aber die klassische Vanilla Oberfläche behalten will.\r<br />[/list]\r<br />[list][*] [color=#ff0000]Beachte: [/color] Wenn das MCM Menü für M2 nicht zugefügt wird in die Konfigurationsoberfläche von MCM, beim ersten starten, dann gebe folgenden Befehl in der Konsole ein:\r<br />SetStage SKI_ConfigManagerInstance 1[/list]\r<br />\r<br />[center][size=3][u][b]Empfohlen[/b][/u][/size][b]\r<br />Dies sind Werkzeuge und Mods die sich als lohnenswert, beim Spielen von M2 erwiesen haben.[/b][/center]\r<br />\r<br />[color=#ff6600][size=2][b]1)[/b][/size][/color] [b][url=http://skyrim.nexusmods.com/mods/6709]Dimonized UNP Body[/url][/b]\r<br />[list][*] M2 sollte mit allen Körper-Typen kompatibel sein, auch den Vanilla Texturen, aber es ist auf UNP-Körper Spieler ausgelegt. Die meisten der Kleidung-Ressourcen in der Mod sind für UNP-Körper erstellt worden. Es könnten also Probleme mit anderen auftauchen.\r<br />[/list]\r<br />[color=#ff6600][size=2][b]2)[/b][/size][/color] [b][url=http://skyrim.nexusmods.com/mods/5010]TESModManager[/url][/b]\r<br />[list][*]Ein stabilerer Mod-Manager als der Nexus-Mod-Manager(noch in der Beta). Installationsprobleme die bei der Nutzung von NMM auftreten könnten, können durch die Nutzung des TESModManagers oder anderer ModManager behoben werden. \r<br />[/list]\r<br />\r<br />[center]AUSFÜHRLICHE BESCHREIBUNG[/center]\r<br />\r<br />[b]Maids II: Deception (M2)[/b], ehemals Sexy Maids of Skyrim (SMS), ist eine Fortsetzung zu Sexy Maid of Chorrol (SMC) (in Zukunft: [b]Maids I: Euphoria[/b]) für [i]The Elder Scrolls IV: Oblivion[/i]. Ursprünglich als kleine Mod geplant, um eine einzelne Magd zu einem Spielerhaus hinzuzufügen, deren Hauptaufgabe es war gut auszusehen und schön zu kleiden, entwickelte sich die Serie zu einer Questreihe. M2 zielt darauf ab, darauf aufzubauen wo SMC aufgehört hat, aber dieses mal mit einem größeren Schwerpunkt auf der Geschichte, als auf übertriebenen erotischen Szenen. Obwohl es später in der Serie Sex-Szenen geben könnte, werden diese rein optional bleiben und kein Teil der Hauptquestreihe.\r<br />\r<br />Kasia, eine Magd und Hauptcharakter, wird bereits früh im Spiel eingeführt, für jene, die an einer auf Beziehungen aufgebauten Erfahrung interessiert sind.Verwalte ihre tägliche Garderobe, lass sie dich begleiten und schicke sie zu Spielerhäusern um als Magd zu arbeiten. Mit dem Fortschreiten der Geschichte, können auch zusätzliche Mägde freigeschaltet werden.\r<br />\r<br />\r<br />[center][size=3][b][u]Geschichte[/u][/b][/size][/center]\r<br />\r<br />Während der Oblivion-Krise (3E 433) versuchte die Organisation bekannt als Projekt Reinheit, die Frauen von Tamriel mithilfe des Safts eines einzigartigen Hist-Baums aus den Schwarzmarschen zu versklaven. Wenn der Saft eingenommen wurde, erregte er eine unstillbare Ekstase welche die Frauen zu leicht unterwerfbaren Opfern machte. Auf Bitten zweier Mägde hin, die unter den Folgen des Safts litten, stoppte der Champion von Cyrodiil Projekt Reinheits Pläne und befreite die Frauen, die von dem argonischen Kriegsherrn namens Desann in seinem persönlichen Palast als Sklaven gehalten wurden.\r<br />\r<br />Die Nachfahren der beiden Mägde - die Pinder-Familie - werden durch das wieder erwachende Projekt Reinheit, aus Vergeltung für die erlittene Niederlage, verfolgt. Über die Zeit hinweg eskalierte dieser Konflikt derart, dass die Familie eine Söldnergruppe ins Leben rufen musste, um ihr Überleben zu sichern und Projekt Reinheit ein für alle Mal ein Ende zu bereiten.\r<br />\r<br />200 Jahre später leben nur noch zwei Mitglieder dieser Familie, in einer kleinen Untergrundstadt in Himmelsrand. Die Ursache für die Fehde ist schon lange von beiden Seiten vergessen worden. Doch die Söldnergruppe der Familie ist stark und hat drastische Veränderungen durchgemacht. Nun besteht sie lediglich aus weiblichen Kriegerinnen und Assassinen, die aufgrund ihrer Fähigkeiten mit der Dunklen Bruderschaft rivalisieren. Der Konflikte ist gerade zu einem Stillstand gekommen und beide Seiten warten darauf, dass sich die andere Seite für den letzten großen Kampf zu erkennen gibt. Mit Himmelsrand, wegen der Angriffe der Drachen und dem Bürgerkrieg, in Aufruhr, nimmt Projekt Reinheit die Chance wahr und entfesselt ihren großen Plan, die Pinder Familie auszulöschen, und enthüllen ihre größte Waffe...und all dies um die Welt vor der rätselhaften Frau namens Matari zu retten.\r<br />\r<br />[center][size=3][b][u]Episoden[/u][/b][/size][b]\r<br />[url=http://forums.nexusmods.com/index.php?/topic/907378-relz-maids-ii-deception]Work-In-Progress Thread (Nexus Forum)[/url] -&gt; nur auf englisch[/b][/center]\r<br />\r<br />[b]M2[/b] wird in Episoden veröffentlicht, bei denen die SMSkyrim.esp mit jeder Episode ein Update erfährt. Jede Episode wird die Hauptquestlinie voranbringen aber auch einige neue Feature und Belohnungen implementieren. Zur Zeit sind [color=#ffff00]5 Episoden[/color] geplant. Die letzte Episode wird die Hauptquest abschliessen und die vollständige Version des Magd-Rekrutierungssystems anbieten.\r<br />\r<br />Das folgende ist eine Liste der Episoden, (voraussichtlichen) Erscheinungsdaten, und die wichtigsten Belohnungen für das Abschliessen der jeweiligen Episode:\r<br />\r<br />[b][color=#ffff00]Episode I[/color]\r<br />[color=#00ff00]28. April 2012[/color][/b]\r<br />[list][*] Neue Magd die in jedes (vanilla) Haus des Spielers in Skyrim gesandt werden kann\r<br />[*] Organisiere den Kleiderschrank deiner Magd mit vorbestimmten Kleidungsstücken die an bestimmten Tagen, und für bestimmte Dinge (Alltag, Arbeit, Abend) getragen werden sollen ODER erstelle eigene Outfits die sie stattdessen tragen soll.\r<br />[*] Erhalte ein neues Spielerhaus mit acht neuen Rüstungspuppen, acht Waffenständern, fünf Truhen, vier Tafeln und vier Schaukästen.\r<br />[/list]\r<br />\r<br />[b][color=#ffff00]Episode II[/color]\r<br />[color=#00ff00]12. Oktober 2012[/color][/b]\r<br />[list][*] Die Magd kann nun auch in DLC, eigene und Mod-Häuser geschickt werden\r<br />[*] Begleit- und Kampfsystem für die Magd\r<br />[/list]\r<br />\r<br />[b][color=#ffff00]Episode III[/color]\r<br />[color=#00ff00]26. Mai 2013[/color][/b]\r<br />\r<br />[list][*] Fünf neue Mägde\r<br />[/list]\r<br />[b][color=#ffff00]Episode IV[/color]\r<br />[color=#ff0000]UNBEKANNT[/color][/b]\r<br />\r<br />[list][*] Unbekannt - möglicherweise lediglich eine Quest-basierte Episode um das Ende vorzubereiten\r<br />[/list]\r<br />[b][color=#ffff00]Episode V[/color]\r<br />[color=#ff0000]UNBEKANNT[/color][/b]\r<br />\r<br />[list][*] Optimierung des Rekrutierungssystems für Mägde\r<br />[/list]\r<br />\r<br />[center][size=3][b][u]Sprachen[/u][/b][/size]\r<br />Verlinkungen dazu finden sich auf der Hauptseite der Mod[/center]\r<br />\r<br />[list][*] [b][url=http://skyrim.nexusmods.com/mods/16021]Englisches Original[/url][/b] von [url=http://skyrim.nexusmods.com/users/407469]enter_77[/url]\r<br />[*] [b]Japanisch[/b] von [url=http://skyrim.nexusmods.com/users/817543]tumugunetukasa[/url]\r<br />[*] [b]Russisch[/b] von Tuan & Austin\r<br />[*] [b][url=http://skyrim.nexusmods.com/mods/31177]Spanisch[/url][/b] von [url=http://skyrim.nexusmods.com/users/5860648]lobita[/url]\r<br />[/list]\r<br />[i]Nicht mehr aktuell[/i]\r<br />[list][*] [b][url=http://skyrim.nexusmods.com/mods/23401]Spanisch[/url][/b] von [url=http://skyrim.nexusmods.com/users/461092]fiama[/url]\r<br />[/list]\r<br />\r<br />[center][size=3][b][u]Probleme[/u][/b][/size][/center][b][u]\r<br />\r<br />Modifikationen[/u][/b]\r<br />[i]SCHLÜSSEL:[/i]\r<br />[color=#ffff00][b]GELB[/b][/color] = mäßige Inkompatibilität; meist ästhetisch. Neue Orte überlappen einander, aber der Questfortschritt ist nicht beeinträchtigt. Konsolenkommandos wie bspw. [b]ToggleCollision (tcl)[/b] könnten nötig sein\r<br />[color=#ff0000][b]ROT[/b][/color] = komplette Inkompatibilität; M2 ist nicht spielbar.\r<br />\r<br />Bei folgenden Modifikationen liegt eine Inkompatibilität mit M2 vor:\r<br />\r<br />[list][*][color=#ff0000][b]Dovahkiin Hideout[/b][/color]\r<br /> Unsauberes editieren eines vanilla AI packets (defaultSitLinkedRefNoConv) in dieser Mod sorgt dafür, dass wichtige NPCs in M2 zu falschen Stellen reisen[*] [color=#ffff00][b]Briar&#39;s End[/b][/color]\r<br />- Platziert ein Haus an einem Quest-spezifischen Ort von M2 nahe der Dunkelschatten Höhle.[*] [color=#ffff00][b]Fleetford[/b][/color]\r<br /> Platziert ein Haus an einem Quest-spezifischen Ort von M2 nahe der Dunkelschatten Höhle.[*] [color=#ffff00][b]Interesting NPCs[/b][/color]\r<br />- Platziert die Skyshadow Crypt (Himmelsschatten Krypta) an einem Quest-spezifischen Ort von M2 (Palast Euphoria).[*] [color=#ffff00][b]Open Faced Helmets[/b][/color]\r<br />- Ersetzt vanilla Ebenerz-Helme was dazu führt, dass die Helden von Nirn in M2 unsichtbare Gesichter haben[/list]\r<br />\r<br />[b][u]Rüstungen & Kleidungen[/u][/b]\r<br />Die folgenden vanilla Outfits müssen ihre ursprünglichen meshes/models haben wenn man M2 spielt. Veränderte Modelle können dazu führen, dass NPCs nicht mit allen oder gar keinen Teilen des Outfits erscheinen:\r<br />\r<br />[list][*] Blades Armor\r<br />[*] Nocturnal&#39;s Robe\r<br />[*] Thieves Guild Master Armor\r<br />[/list]\r<br />\r<br />[b][u]Weltzellen[/u][/b]\r<br />Von M2 veränderte Weltzellen sind für Modder in das ReadMe eingefügt.\r<br />\r<br />\r<br />[center][size=2][b][u]Probleme und Bugs[/u][/b][/size][/center]\r<br />\r<br />[i]SCHLÜSSEL:[/i]\r<br />[color=#00ff00][b]GRÜN[/b][/color] = Kleine Fehler, stören Ästhetic; nicht bedrohlich\r<br />[color=#ffff00][b]GELB[/b][/color] = mittlere Fehler, meist Beeinträchtigung des Gameplay; kann, muss aber nicht stören\r<br />[color=#ff0000][b]ROT[/b][/color] = schwerer Fehler, könnte starke Probleme verursachen; [b]EMPFOHLEN[/b] wird die Mod nicht runterzuladen oder nicht zu speichern, bis ein solcher Fehler rausgepatcht ist\r<br />\r<br />[b][size=2]1)[/size] [color=#00ff00]Verfärbung der Ashengesichter[/color][/b]\r<br />\r<br />[list][*] BESCHREIBUNG - Gesichter von Ashen (neue Rasse in M2) können merkbar verfärbt oder transparent werden. Das kann geschehen wenn zwischen Innen- und Außenzellen gewechselt wird.\r<br />[*] LÖSUNG: Das kann ein Fehler mit der erstellten Rasse sein; die beste Methode ist zu speichern, Skyrim zu schließen und neu zu laden.\r<br />[/list]\r<br />\r<br />\r<br />[center]TIPPS[/center]\r<br />\r<br />[color=#ff6600][size=2][b]1)[/b][/size][/color] Das Sprechen mit einem NPC lässt keinen Text und keine Stimme erscheinen.\r<br />[list][*] Zur Zeit ist die Mod nicht vollständig vertont. Alle Untertitel müssen aktiviert werden, um den Text zu sehen.\r<br />[/list]\r<br />[color=#ff6600][size=2][b]2)[/b][/size][/color] Mit Charakteren kann nicht gesprochen werden und die Meldung &#34;Diese Person ist beschäftigt.&#34; erscheint.\r<br />\r<br />[list][*] Die einzig bekannten Lösungen, abgesehen davon, dass man einen neuen, sauberen Spielstand mit möglichste wenig skript-intensiven Mods benutzt, sind die folgenden(möglicherweise müssen mehrere davon ausgeführt werden):\r<br />[/list]\r<br />\r<br />1. Lade das Resource Dokument aus der Download-Sektion herunter und lasse die Szene/das Gespräch das die Charaktere führen sollen fortfahren, in dem du das entsprechende Konsolen-Kommando benutzt.\r<br />2. Deaktiviere und aktiviere die betroffenen Charaktere mit Hilfe der Konsole.\r<br />3. Verlasse einen Raum und betrete ihn sofort wieder.\r<br />4. Korrigiere die Position der SMSkyrim.esp in Skyrims Ladereihenfolge\r<br />\r<br />[color=#ff6600][size=2][b]3)[/b][/size][/color] Die erste Quest wird dem Journal nicht hinzugefügt und andere Inhalte von M2 fehlen.\r<br />[list][*] Versuche das folgende um das Problem zu lösen:\r<br />[/list]\r<br />1. Vergewissere dich, dass die SMSkyrim.esp vorhanden und aktiviert ist; korrigiere die Position der SMSkyrim.esp in Skyrims Ladereihenfolge.\r<br />2. Vergewissere dich, dass die SMSkyrim.bsa (gepackte Version) bzw. die Datei &#34;DataSEQSMSkyrim.seq&#34; (ungepackte Version) vorhanden ist \r<br />3. Überprüfe im Spiel ob die Stadt Jonestead existiert indem du in die Konsole &#34;cow SMSJonestead 0 0&#34; eingibst; sollte das Kommando scheitern, ziehe eine erneute Installation von M2 in Betracht.\r<br />\r<br />[color=#ff6600][size=2][b]4)[/b][/size][/color] Es fehlen Texturen (lila Objekte) und die Quest wird nicht aktualisiert.\r<br />[list][*] Wenn man es mit dem Nexus Mod Manager heruntergeladen und installiert hat ist es möglich, dass die M2 Installation beschädigt wurde und eine neue Installation benötigt. Das geschieht meist, wenn man von einer vorherigen Version updatet.\r<br />[*] Wenn die gepackte Version von &#34;Maids II: Deception&#34; installiert wurde (die Version mit der SMSkyrim.bsa), downloade und installiere stattdessen die ungepackte (lose)&#34;Maids II: Deception&#34;-Version.\r<br />[/list]\r<br />[color=#ff6600][size=2][b]5)[/b][/size][/color] Stimmen der neuen NPCs sind zu hoch oder zu tief\r<br />[list][*] Die Stimmen werden stetig bearbeitet um der Lautstärke der vanilla NPCs zu entsprechen. Das Aktivieren der Lautstärkeangleichung deines Soundwiedergabe-Systems verbessert Skyrim&#39;s Dialoglautstärke und passt automatisch die Dialogstimmen der NPCs an (suche online nach Beschreibungen für dein jeweiliges Betriebssystem).\r<br />[/list]\r<br />[color=#ff6600][size=2][b]6)[/b][/size][/color] Das Spiel stürzt ab wenn es gestartet wird.\r<br />[list][*] Das Deaktivieren von anderen großen Mods und Mods die die Landschaft von Skyrims Welt verändern, könnte helfen dieses Problem zu lösen. Bitte beachte dass das bedeutet dass dein Fortschritte und Statistiken in diesen Mods verloren geht, wenn du speicherst und sie deaktiviert sind. Behalte [u]immer[/u] eine Sicherungskopie/Backup des Spielstands bevor du versuchst die problematische Mod zu finden.\r<br />[/list]\r<br />[color=#ff6600][size=2][b]7)[/b][/size][/color] Es gibt Abstürze wenn man auf eine neuere Version updatet.\r<br />Das geschieht sehr wahrscheinlich wegen Skript-Updates an Objekten in einer Zelle, in [list][*]der sich der Spieler in dem geladenen Spielstand befindet. Eine Lösung ist, diesen Spielstand wieder und wieder zu laden bis es funktioniert, oder zuerst einen anderen Spielstand zu laden, und dann den gewünschten Spielstand zu öffnen.\r<br />[/list]\r<br />[color=#ff6600][size=2][b]8)[/b][/size][/color] Es gibt Abstürze wenn man versucht, Innenzellen(bspw. Häuser/Räume) zu betreten, die M2 hinzufügt.\r<br />[list][*] Falls das in Palast Euphoria geschieht, wenn man eine der Bars betritt und die Tänzerinnen aktiviert sind, gehe in das Haus der Pinder in Jonestead und ändere ihre Kleidung auf &#34;lore-freundlich&#34;. Sollte das die aktuelle Einstellung sein, kann das vollständige Deaktivieren der Stripper das Problem lösen.\r<br />[*] Wenn man FNIS benutzt, stelle sicher dass die neuste Version installiert ist und update die Verhaltensdateien mithilfe des Programms (lies das FNIS ReadMe für eine genaue Anleitung)\r<br />[*] Die Grafik-Einstellungen zu reduzieren könnte auch helfen, häufiges Abstürzen zu vermeiden.\r<br />[/list]\r<br />\r<br />[center][size=3][b][u]Geplante Updates[/u][/b][/size][/center]\r<br />\r<br />[b]v3 (Episode III)[/b]\r<br />\r<br />[list][*] Nächster Teil der M2 Quest\r<br />[*] Fügt optional das SkyUI Mod Konfigurations Menü (MCM) hinzu\r<br />[*] Verbessert und optimiert Jonestead (Straßen)\r<br />[*] Gegner (Helden von Nirn, Vorhut Projekt Reinheits) ausbalancierter und an das Level angepasster\r<br />[*] Optimierte Skripte\r<br />[/list]\r<br />\r<br />\r<br />[center]\r<br />[size=3][u][b]Credits & Erlaubnis[/b][/u][/size]\r<br />[color=#ffff00]Die Credits und Erlaunbisse sind unter &#34;Permission and Credits&#34; im &#34;Actions&#34; Menü, oben auf der Seite aufgelistet.[/color]\r<br />\r<br />[size=3][u][b]Disclaimer[/b][/u][/size]\r<br />Der Übersetzer sowie der Autor haben keinerlei Rechte an der The Elder Scrolls Serie und beanspruchen sie auch nicht.\r<br />\r<br />Das M2 Screenshot-Logo wurde im Spiel [i]The Elder Scrolls IV: Oblivion[/i] gemacht, unter Benutzung der Fallen-Rüstung aus [url=http://oblivion.nexusmods.com/mods/34179]Hentai Mania 2[/url] von [url=http://oblivion.nexusmods.com/users/293510]zotman12[/url] und dem [url=http://oblivion.nexusmods.com/mods/13193]Oblivion Pose Pack[/url] von verschiedenen Autoren.[/center]",
  "categoryId": "35",
  "version": "3.2",
  "author": "Enter_77",
  "createdUnix": "1346327625",
  "updatedUnix": "1379796539",
  "containsAdultContent": true,
  "uploadedBy": "Akkarin1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98265",
      "name": "Wichtige Anmerkungen",
      "version": "2.0.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Wichtige Anmerkungen-23343-2-0-6.rar",
      "uploadedUnix": "1352468002",
      "modVersion": "2.0.6",
      "virusScanUrl": "https://www.virustotal.com/file/df01f736bb081ee11347018cb62ef7db5745c0fe9fb2c1c11b04d43286eec3cc/analysis/1407255364/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wichtige%20Anmerkungen-23343-2-0-6.rar?fid=98265&ttl=1535793498&ri=8192&rs=8192&setec=30f634884d7d19fbe6cf17fe3b326645"
    },
    {
      "fileId": "98268",
      "name": "SMSkyrim_German_BSA",
      "version": "2.0.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "515151",
      "fileName": "SMSkyrim_German-23343-2-0-6.rar",
      "uploadedUnix": "1352469903",
      "modVersion": "2.0.6",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SMSkyrim_German-23343-2-0-6.rar?fid=98268&ttl=1535793498&ri=8192&rs=8192&setec=cc4b2e9ada0d26596476590e28d812d7"
    },
    {
      "fileId": "98276",
      "name": "SMSkyrim_German_Lose",
      "version": "2.0.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "455143",
      "fileName": "SMSkyrim_German_Lose-23343-2-0-6.rar",
      "uploadedUnix": "1352474791",
      "modVersion": "2.0.6",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SMSkyrim_German_Lose-23343-2-0-6.rar?fid=98276&ttl=1535793499&ri=8192&rs=8192&setec=02d74f2a216819ff894ccef8ce3932d8"
    },
    {
      "fileId": "98758",
      "name": "SMSkyrim_German_ESP",
      "version": "2.0.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "914",
      "fileName": "SMSkyrim_German_ESP-23343-2-0-6.rar",
      "uploadedUnix": "1352637852",
      "modVersion": "2.0.6",
      "virusScanUrl": "https://www.virustotal.com/file/e418740031273f062cdb147fbac6364bbf068aa7ee1e6bcd28b9636e8316e88d/analysis/1407258434/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SMSkyrim_German_ESP-23343-2-0-6.rar?fid=98758&ttl=1535793499&ri=8192&rs=8192&setec=20090a62c24f62b925eae5292b264284"
    },
    {
      "fileId": "104647",
      "name": "SMSkyrim_German_ESP_vollstaendig",
      "version": "2.0.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1024",
      "fileName": "SMSkyrim_German_ESP_vollstaendig-23343-2-0-6.rar",
      "uploadedUnix": "1355252520",
      "modVersion": "2.0.6",
      "virusScanUrl": "https://www.virustotal.com/file/e0e976ed5897151ec7e3c9892ac421c01177d3e4f9a11fa54ce24d3554ee9dc2/analysis/1407300308/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SMSkyrim_German_ESP_vollstaendig-23343-2-0-6.rar?fid=104647&ttl=1535793500&ri=8192&rs=8192&setec=dd3cf0e3e8e7d2bc0c54bff3700ac7b6"
    },
    {
      "fileId": "1000003476",
      "name": "Readme",
      "version": "2.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Readme-23343-2-4.7z",
      "uploadedUnix": "1358616155",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/d7c3c4413d891b28dac4b952bedcf4605b264d9e74dc9a66412a9a49971cd1e0/analysis/1407361565/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Readme-23343-2-4.7z?fid=1000003476&ttl=1535793500&ri=8192&rs=8192&setec=6a3120b3ab4e0444c85679735af812b4"
    },
    {
      "fileId": "1000003487",
      "name": "Maids II - Deception_Lose",
      "version": "2.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "362849",
      "fileName": "Maids II - Deception_Lose-23343-2-4.7z",
      "uploadedUnix": "1358620420",
      "modVersion": "2.4",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Maids%20II%20-%20Deception_Lose-23343-2-4.7z?fid=1000003487&ttl=1535793501&ri=8192&rs=8192&setec=5edd9cace44da11e8ad2811db2c66c28"
    },
    {
      "fileId": "1000003499",
      "name": "Maids II - Deception_BSA",
      "version": "2.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "515362",
      "fileName": "Maids II - Deception_BSA-23343-2-4.7z",
      "uploadedUnix": "1358623307",
      "modVersion": "2.4",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Maids%20II%20-%20Deception_BSA-23343-2-4.7z?fid=1000003499&ttl=1535793501&ri=8192&rs=8192&setec=71b73b1e86faff7b22c34253e71e0083"
    },
    {
      "fileId": "1000003509",
      "name": "Uninstall Batch Datei",
      "version": "2.4",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "0",
      "fileName": "Uninstall Batch Datei-23343-2-4.7z",
      "uploadedUnix": "1358623888",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/1d3f244151ec7c939bae1ee6b6284168552ea3274e52bf47cd6edde33136d788/analysis/1407361663/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Uninstall%20Batch%20Datei-23343-2-4.7z?fid=1000003509&ttl=1535793502&ri=8192&rs=8192&setec=594e0101698d518645ad5c5fa4755c9b"
    },
    {
      "fileId": "1000003516",
      "name": "Source Files",
      "version": "2.4",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "465",
      "fileName": "Source Files-23343-2-4.7z",
      "uploadedUnix": "1358624552",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/b5115af00f8d889b4df6b1a494e3953a207c60d2b60e7ded37a7ede602238503/analysis/1407361690/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Source%20Files-23343-2-4.7z?fid=1000003516&ttl=1535793502&ri=8192&rs=8192&setec=57e67c2f01a0c0f8f7625836c9a80bca"
    },
    {
      "fileId": "1000003517",
      "name": "OMOD Conversion Data",
      "version": "2.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "136",
      "fileName": "OMOD Conversion Data-23343-2-4.7z",
      "uploadedUnix": "1358624749",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/4529e8c26e84703aa54011d3b18ef624948ed0b42c4db9df08773130d17c7074/analysis/1407361748/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OMOD%20Conversion%20Data-23343-2-4.7z?fid=1000003517&ttl=1535793503&ri=8192&rs=8192&setec=e96c4fe97e740bd4d1f4b90dfe0e2f0c"
    },
    {
      "fileId": "1000003519",
      "name": "Resource Liste",
      "version": "2.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "33",
      "fileName": "Resource Liste-23343-2-4.7z",
      "uploadedUnix": "1358624835",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/b56f52c9138d27375872f3cdeedbde2677b56a7f4efd67833484e7bc24592744/analysis/1407361753/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Resource%20Liste-23343-2-4.7z?fid=1000003519&ttl=1535793503&ri=8192&rs=8192&setec=2dc5eaf558c92689d798036dfd31a261"
    },
    {
      "fileId": "1000003522",
      "name": "Walkthrough",
      "version": "2.4",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "11866",
      "fileName": "Walkthrough-23343-2-4.7z",
      "uploadedUnix": "1358625017",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/775ee9b6f1ca682007a07c9a9d78a314f6ee9276660719136a15a9d725723020/analysis/1407361761/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Walkthrough-23343-2-4.7z?fid=1000003522&ttl=1535793504&ri=8192&rs=8192&setec=a8b3214ffd3d1d9fa441782f896a7949"
    },
    {
      "fileId": "1000053534",
      "name": "Maids II - Deception_Lose",
      "version": "3.2Beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "463625",
      "fileName": "Maids II - Deception_Lose_de-23343-3-2Beta.7z",
      "uploadedUnix": "1378756694",
      "modVersion": "3.2Beta",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Maids%20II%20-%20Deception_Lose_de-23343-3-2Beta.7z?fid=1000053534&ttl=1535793504&ri=8192&rs=8192&setec=dcb1c1d3178b9f024ca0f3632c9e5828"
    },
    {
      "fileId": "1000053537",
      "name": "Maids II - Deception_Gepackt",
      "version": "3.2Beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "654146",
      "fileName": "Maids II - Deception_Gepackt_de-23343-3-2Beta.7z",
      "uploadedUnix": "1378758077",
      "modVersion": "3.2Beta",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Maids%20II%20-%20Deception_Gepackt_de-23343-3-2Beta.7z?fid=1000053537&ttl=1535793505&ri=8192&rs=8192&setec=7d1176c3ed63f0924cad7a6c56c8c52a"
    },
    {
      "fileId": "1000056954",
      "name": "Maids II - Deception_Lose",
      "version": "3.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "435399",
      "fileName": "Maids II - Deception_Lose-23343-3-2.7z",
      "uploadedUnix": "1379795462",
      "modVersion": "3.2",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Maids%20II%20-%20Deception_Lose-23343-3-2.7z?fid=1000056954&ttl=1535793505&ri=8192&rs=8192&setec=233946d7e3616e2d72dac53b9fbdb7b1"
    },
    {
      "fileId": "1000056958",
      "name": "Maids II - Deception_Gepackt",
      "version": "3.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "650736",
      "fileName": "Maids II - Deception_Gepackt-23343-3-2.7z",
      "uploadedUnix": "1379796318",
      "modVersion": "3.2",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Maids%20II%20-%20Deception_Gepackt-23343-3-2.7z?fid=1000056958&ttl=1535793505&ri=8192&rs=8192&setec=5e134f7fcb91df9135ad259ce6422882"
    },
    {
      "fileId": "1000056960",
      "name": "Maids II - Source Files",
      "version": "3.2",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "795",
      "fileName": "Maids II - Source Files-23343-3-2.7z",
      "uploadedUnix": "1379796539",
      "modVersion": "3.2",
      "virusScanUrl": "https://www.virustotal.com/file/66e9c59fc2d5c7ca837d323a6942143ce626dd36d813146294f3906ed92d18eb/analysis/1407730447/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Maids%20II%20-%20Source%20Files-23343-3-2.7z?fid=1000056960&ttl=1535793506&ri=8192&rs=8192&setec=1c22907611d288d5a9293eb4712f7d5b"
    }
  ]
}