{
  "modId": 23357.0,
  "modName": "Bat 99",
  "summary": "My Personal Batt file made to accompany the mods I use to change gameplay to a harsher action paced environment.  ",
  "descriptionHtml": "My Personal Batt file made to accompany the mods I use to change gameplay to a harsher action paced environment.  \r\n\r\nI personal prefer a harsher atmosphere in a game like Skyrim, when I played Fallout I used to hate the fact I was drilling somebody in the head with an Assault rife and would watch their heath slowly tick down, yet God mode one shoting everything was empty and boring...the same goes for Skyrim.so I have downloaded a myriad of Mods and tweaked setting until I got what I was looking for...\r\n\r\nthis is the batt file I use...\r\n\r\n\r\n-------\r\nplease note firstly I take zero credit for any of this, it is a compilation of other peoples batt files from sites such as this and wiki pages, I honestly cant remember where so if u feel you deserve credit PM me and I will be happy to change remove anything.\r\n\r\nSecondly this is ment to go with other mods * listed below and as a standalone it will give you a double edged god mode...very high stats, but a very low health pool \r\n\r\nUse it as you wish but I highly recommend the mods I have listed below ,tweaked in the way I mention.\r\n\r\n_____\r\n\r\nMods I highly recommend to use with this Batt\r\n\r\n1)WARZONES - Civil Unrest by MyGoodEye\r\nuse the ingame menu and turn to \\\"Mad house\\\" setting or the one below\r\n\r\n2)Combat Damage Multiplier by Ixiguis\r\njust install ,change game setting to apprentice attack a few mobs and adjust as needed\r\n \r\n3)Deadly Dragons by 3JIou \r\nuse the ingame menu, set health and damge for Dragons and humaniod NPCs up to 300% , armor to 150%, set heath dame for monsters to 1100% and armor to 600%. \r\n\r\nSetup like this you will typicaly one shot trash mobs and they will take 6 or so hits to kill u..higer tier trash mobs will two and sometimes one shot you with bows and you the same to them, higher tier mobs will one shot you with pretty much anything they do except CCs and will take a dozen or more hits to be killed\r\n\r\nInstall : copy file into your data folder, open console in game,type batt 99 and hit return. \r\n\r\n\r\n",
  "categoryId": "24",
  "version": "1a",
  "author": "Internet",
  "createdUnix": "1346351263",
  "updatedUnix": "1346351263",
  "containsAdultContent": false,
  "uploadedBy": "jsytak",
  "primaryFile": null,
  "files": []
}