{
  "modId": 23363.0,
  "modName": "Karinda",
  "summary": "A player owned horse available at Whiterun Stables. ",
  "descriptionHtml": "Karinda - by mellowtraumatic\r\n\r\nAfter not playing with a horse for quite a while I decided I wanted one again. I didn\\'t really want to buy one from the stables, since they never have a name. I didn\\'t want Shadwomere since I wasn\\'t interested in the DB quests, and I didn\\'t want to get Frost because the last time I did that quest I had an army of Louis Letrush clones stalking me all over Skyrim.  Tooling around in the CK one day, I I noticed there is a unique horse in there named Karinda. I looked her up and Karinda never appears in game at all. She was possibly part of a quest that was never included for whatever reason. (http://www.uesp.net/wiki/Skyrim:Karinda) I decided to go ahead and just put her in the game and keep her for my own use. I\\'ve decided to share her here in case anyone else might get some use out of her. \r\n\r\nShe is essential because I hate my animals to die. She doesn\\'t fight anything. If you dismount her to fight, she stays put, even if attacked. I\\'ve tried to make it so enemies don\\'t even bother to attack her and for the most part, they don\\'t. So far I\\'ve only had one instance at a fort where they ignored me and started attacking her instead.\r\n\r\nKarinda was originally made to look like the Whiterun Stables horses and didn\\'t have a saddle. I\\'ve changed her to look like the Solitude horses and put tack on her. I\\'m currently using Slof\\'s horse textures so that\\'s why she looks like a bright palomino in my game. In yours, she\\'ll look like whatever your Solitude horses do. She uses the default saddle mesh so if you\\'re using a different saddle texture it should be the same. If you would like to use the saddle she has in the screenshots, then you\\'ll need to install the mod, Ornate Saddles. \r\nhttp://skyrim.nexusmods.com/mods/3200\r\n\r\n\r\nShe can found behind the Whiterun Stables. She\\'s player owned already so you can just climb on her and go and you won\\'t be pinched by the guards.  \r\n\r\nEnjoy!",
  "categoryId": "83",
  "version": "1.0",
  "author": "mellowtraumatic",
  "createdUnix": "1346359293",
  "updatedUnix": "1346359342",
  "containsAdultContent": false,
  "uploadedBy": "mellowtraumatic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "85397",
      "name": "Karinda",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "302",
      "fileName": "Karinda-23363-1-0.rar",
      "uploadedUnix": "1346359342",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/939c977a917480ce96c32c471a147554e3078e174f5925613e9a7df6c7246530/analysis/1407133804/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Karinda-23363-1-0.rar?fid=85397&ttl=1535793546&ri=8192&rs=8192&setec=bd9bf1dba3909e6526c47dead91b7ea1"
    }
  ]
}