{
  "modId": 23371.0,
  "modName": "Castle of Tubba Blubba",
  "summary": "Every sit down to play Paper Mario and think to yourself; \\\"Hmm, this needs about 20% more steampunk robots, random shouting, and a buttload of inexplicable fog\\\"? Then have I got something for you!",
  "descriptionHtml": "As the name implies, this dungeon is a tribute to the Paper Mario series by recreating Tubba Blubba\\'s Castle from the N64 game. However, don\\'t expect the same experience as the original. The design and layout have been modified in a number of places, so while it keeps the same linear path, I\\'m hoping it will feel right at home among the developer-created dungeons that already exist.\r\n\r\nThe castle is located in the Rift (I won\\'t say where, find it yourself) very visibly above ground. I did my best to make it not lore-breaking, but in case it doesn\\'t work, just imagine that the people of Skyrim are just really, really unobservant. Which does make sense, considering you can stand right next to someone and they won\\'t notice you.\r\n\r\nEnemies inside are of standard Dwarven fare, but be warned; the traps inside are actually dangerous. I would recommend being at least level 15 before entering, 25 if you want to just breeze through it. Bring some potions.\r\n\r\n=KNOWN ISSUES=\r\n-It seems to have a minor effect on loading saves. The first time works with no problems, but loading a different character can sometimes make weapons and offensive magic unusable. To fix this, either exit the game and restart, loading the second file from the beginning, or just use a healing spell with each hand. Remember, this only seems to happen when playing as one character and loading another.\r\n-Enemies left alive when leaving will sometimes spawn in strange places if you come back. Seeing as all enemies are directly in your way, though, this is highly unlikely to happen anyway as you will need to kill them to make it through safely. There is only one exception here, and oddly enough, this glitch works in the dungeon\\'s favour when it happens.\r\n-Tubba Blubba will sometimes spawn dead. I have no idea what causes this.\r\n-If you notice any more, let me know immediately so I can note them here.\r\n\r\nManual installation notes can be found in the Readme.\r\n\r\nVIDEO:\r\nhttp://www.youtube.com/watch?v=YwwTtMLGw6s",
  "categoryId": "88",
  "version": "V.0.5",
  "author": "Razanak7",
  "createdUnix": "1346373486",
  "updatedUnix": "1346373574",
  "containsAdultContent": false,
  "uploadedBy": "Razanak7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "85441",
      "name": "Castle of Tubba Blubba",
      "version": "V.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "128",
      "fileName": "Castle of Tubba Blubba-23371-V-0-1.rar",
      "uploadedUnix": "1346373574",
      "modVersion": "V.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/4d71ed3d794847a6a433def6e87847086b8f3c77633befcbb1436d2950b61c05/analysis/1407134223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20of%20Tubba%20Blubba-23371-V-0-1.rar?fid=85441&ttl=1535793561&ri=8192&rs=8192&setec=c082b57d0304af3e71de151b63bbb10a"
    }
  ]
}