{
  "modId": 23387.0,
  "modName": "Legendary Souls - Summon the Souls of Heroes and Villains of Tamriel",
  "summary": "This mod is a compilaton of all the summon mods I have made.  Summon the legendary heroes and villains of Nirn to fight by your side&#33;  Will add hundreds of summons, spells, weapons, monsters, quests, minigames, and a new world map the Elysian Isles that will contain tons of content in the future.  This is a WIP, so follow it if you prefer to wa",
  "descriptionHtml": "[center][img]http://farm8.staticflickr.com/7246/8168776921_bd701f5a7a_c.jpg[/img]\r<br />Legendary Souls - Call of the Companions\r<br />[youtube]IVxW7or1EHM[/youtube]\r<br />Featured on Mod of the Day Episode 63 by Preykousis&#33;\r<br />[youtube]E8R_UhYEjqY[/youtube][/center]\r<br />[img]http://i34.photobucket.com/albums/d135/d3cypherdis/LegendarySouls/LegendarySoulHeaderUpdate.png[/img]\r<br />05/05/13 - Version 1I \r<br />1) Adding new summons: Terrible Peformer Lurbuk, Sword Singer Azzadal, and Troubadour Soothsayer Heliand. Lurbuk&#39;s Death Tome can be found off his carcass (i found out his body doesn&#39;t reset or disappear so if you already killed him, just find his body and loot him). Azzadal&#39;s Lyrics can be found near Bard&#39;s Leap. I added a new sachel in the area named Azzadal&#39;s Lost Sachel. Heliand&#39;s Poems can be found by performing a simple investigative (non-marked) quest. Join the Bard&#39;s College and find Gerarde&#39;s Research Journal to find clues where to go. You&#39;ll also have to at least start Sheogorath&#39;s Daedric Artifact quest. At the end of the quest be ready to fight a boss. \r<br />\r<br />2) Made major fixes to Gauldur summon. I noticed he and his sons would all start fighting because of the magic effects from each of their spells. I added conditions so that the spells won&#39;t hurt each other anymore. Also finally saw the unleashed versions of the sons summoning the subjugated versions. This was because the subjugated crystals that the player can loot from the unleashed sons was in their inventory. For some reason the draugr versions will use the item to summon the subjugated versions of themselves. Now the unleashed versions will explode near death and the explosion will drop the purified crystal of the son you just defeated (similar to how wisps drop the wisp cores).\r<br />\r<br />3) Updated Iashesis&#39; spells to make it appear as if he is teleporting enemies instead of tossing them. The enemies will disappear and reappear in different areas. Also fixed the tragectory of where he tosses the enemies. They should no longer go towards the player all the time. Also added a new effect to one of his spells causing a large storm barrier (like the one that the Eye of Magnus makes) during combat. Any enemy near or within it will be tossed around like ragdolls. I added this effect because it felt like for a Legendary class soul, Iachesis didn&#39;t have that &#34;umph&#34;, and I found him getting detroyed easily by the likes of King Orgnum or Snow Prince. This new effect puts him on equal footing with those guys.\r<br />\r<br />4) Updating the current Svaknir summon so he follows the same theme of the other bard summons. The current version tosses song fields around the field.. though useful... makes him seem more like a mage instead of a bard. The the way I made the bard summons now is that they will cast a song on themselves. Once they release the spell, a song field surrounds the bard, and they will proceed and do a performances in the song field. While they are peforming they are invulnerable so they take no damage... Although they take no damange while performing, they will still take damage when they aren&#39;t. Since they are bards, they still die pretty easy if you leave them alone to fight an entire army. \r<br />\r<br />5) Minor update to Kematu summon. I noticed he still killed enemies way to quickly so I lowered some of his damage output. The way he was killing enemies pretty much placed him in Epic/Legendary levels... and I sort of wanted to keep in him in heroic levels.\r<br />\r<br />6) Two new spell for the player to use: Expert Restoration Spell: Light Guardian - Creates a light guardian at the player&#39;s location. The light guaridan is a magical sword of light that inflicts holy fire damage on enemies (regular fire damage on enemies, extremely deadly fire damage on undead). Expert Destruction Spellark Frost - Fires off slow moving dark energy that deals lingering frost damage on enemies and knocks them down. The spell can go through walls and obstacles. \r<br />\r<br />7) New test chest available in the file but not placed in the game map.  Chest name is LegendarySoulsTestChest.\r<br />\r<br />8) Hakon&#39;s Fus Ro Dah modified to lessen lag issues.\r<br />\r<br />[img]http://i34.photobucket.com/albums/d135/d3cypherdis/LegendarySouls/LegendarySoulHeaderDescription.png[/img]\r<br />This mod is a compilation of all my stand alone summons so far.  I will stop making stand alone releases and will make all updates on this file moving forward.  These are all lesser powers hence each summon can be casted at any time.  If enough people request for a power version with a 24 hour recast timer, I will work on one.  Right now to obtain each summon, you must either complete some quests or explore Skyrim.  Eventually, I will release a library where the player can obtain each summon if they prefer not to partake in certain questlines or not in the mood of exploring.  I will also eventually release a colloseum so the player can pit each legedary spirit against each other to see which soul is supreme, or partake in combat to see where he or she stands up against the legendary souls of Nirn.  I will also eventually release a player version of the summons&#39; abilities.\r<br />[img]http://i34.photobucket.com/albums/d135/d3cypherdis/LegendarySouls/LegendarySoulHeaderSouls.png[/img]\r<br />COMMON-\r<br />[img]http://i34.photobucket.com/albums/d135/d3cypherdis/LegendarySouls/LegendarySoulsRosterCommon_zps4bfa26b5.png[/img]\r<br />Soul Shade - Arniel Gane \r<br />Blades Agent - Acilius Bolar \r<br />Summerset Shadow - Linwe \r<br />Adoring Fan - Adoring Fan  \r<br />Rogue Gambler - Vasha the Gambler\r<br />Prodigal Son - Ylgar \r<br />Fallen Thief - Isabelle Rolaine \r<br />Shadowscale Assassin - Ocheeva\r<br />Terrible Performer - Lurbuk\r<br />\r<br />HEROIC-\r<br />[img]http://i34.photobucket.com/albums/d135/d3cypherdis/LegendarySouls/LegendarySoulsRosterHeroic_zpsf989265b.png[/img]\r<br />Cursed Companion - Skjor \r<br />Blades Defender - Baurus \r<br />Whisper Conjurer - The Caller \r<br />Synod Engineer - Septimus Signus \r<br />Alik&#39;r Warrior - Kematu \r<br />Thalmor Wizard - Ancano \r<br />Phantom Sentinel - Mercer Frey \r<br />Master Wizard - Mirabelle Ervine\r<br />Treacherous Assassin - Mathieu Bellamont\r<br />Skeever King - Hamelyn\r<br />Sword Singer - Azzadal\r<br />\r<br />EPIC-\r<br />[img]http://i34.photobucket.com/albums/d135/d3cypherdis/LegendarySouls/LegendarySoulsRosterEpic_zps92443d63.png[/img]\r<br />Companion Harbinger - Kodlak Whitemane\r<br />Arch Mage - Savos Aren\r<br />Nightingale Sentinel - Gallus Desidenius\r<br />Void Assassin - Astrid\r<br />Ethereal Bard - Svaknir\r<br />Ancient Warrior - Hakon One-Eye\r<br />Ancient Strategist - Felldir the Old\r<br />Ancient Huntress - Gormlaith Golden-Hilt\r<br />\r<br />LEGENDARY-\r<br />[img]http://i34.photobucket.com/albums/d135/d3cypherdis/LegendarySouls/LegendarySoulsRosterLegendary_zps07f693b3.png[/img]\r<br />Legendary Hero - Ysgramor\r<br />Wolf Queen - Potema\r<br />Gray Fox - Emer Dareloth\r<br />Spectral Assassin - Lucien LaChance\r<br />Oblivion Usurper - Mankar Camoran\r<br />Psijic Ritemaster - Iachesis\r<br />Falmer Champion - Snow Prince\r<br />Greybeard Master - Jurgen Windcaller\r<br />Forsworn King - Faolan the Red Eagle\r<br />Maormer Monarch - King Orgnum\r<br />Lost Legend - Gauldur\r<br />Dwemer Magecrafter - Kagrenac\r<br />Troubadour Soothsayer - Heliand\r<br />\r<br />[img]http://i34.photobucket.com/albums/d135/d3cypherdis/LegendarySouls/LegendarySoulHeaderBonuses.png[/img]\r<br />CRAFTING-\r<br />Purification Altar - Located on top of the Arch Mage&#39;s Quarters in the College of Winterhold\r<br />\r<br />FOLLOWERS-\r<br />Pierelle Leoriane (Restoration Mage) - Location: College of Winterhold\r<br />Jaque Spratt (Heretic Hunter) - Location: Whiterun Outskirts\r<br />\r<br />MOUNT-\r<br />Dwemer Transport - Find Reachwind Eyrie\r<br />\r<br />PLAYER USABLE SPELLS-\r<br />\r<br />Rapid Blaster - Ancient Dwemer Destruction Magic Spell - Quest: Main Quest  \r<br />*Converts magicka into physical &#34;bullets&#39; and releases these bullets at a rapid rate. \r<br />\r<br />Frost Wave - Ancient Falmer Destruction Magic Spell - Defeat: Falmer Shadow Champion in Blackreach \r<br />*A powerful concentrated wave of ice that knocks down any and all enemies within the wave&#39;s destructive area.\r<br />\r<br />Demon Slash - Ancient Akaviri Destruction Magic Spell - Find: Hint located on top of the Throat of the World\r<br />*When the beacon spell is cast on enemies, demonic slash attacks from the depths of the underworld continue to torment the victim mercilessly.\r<br />\r<br />Dismissal - Conjuration spell that dismisses conjured creatures or souls - Location: Sleeping Giant Inn and College of Winterhold Midden area\r<br />*Used to dismiss all summoned beings.  Can be used to dismiss familiars, atronachs, dremoras, or the souls of the dead.  Unable to dismiss raised undead.\r<br />\r<br />Conjure Magic Anomaly - Find: Arch Mage&#39;s Quarters.  \r<br />*Summons a Magic Anomaly to fight for you.\r<br />\r<br />Aspect of Alteration - Summon an aspect of alteration in the form of Savos Aren&#39;s friend Atmah.  Find Savos&#39; research jounal in the Arch-Mage&#39;s quarters near a shelf by the alchemy table.\r<br />*A spell that allows the Alteration master to become nearly invulnerable to all physical and magical attacks, while under the protection of an Aspect of Alteration.\r<br />\r<br />Aspect of Conjuration - Summonn an aspect of conjuration in the form of Savos Aren&#39;s friend Girduin.  Find Savos&#39; research jounal in the Arch-Mage&#39;s quarters near a shelf by the alchemy table.\r<br />* A spell that allows the Conjuration master to summon and raise up to 6 beings while under the company of an Aspect of Conjuration.\r<br />\r<br />Aspect of Destruction - Summon an aspect of destruction in the form of Savos Aren&#39;s friend Hafnar Ice-Fist.  Find Savos&#39; research jounal in the Arch-Mage&#39;s quarters near a shelf by the alchemy table.\r<br />* A spell that allows the Destruction master to have a constant frost cloak surrounding them while increasing the damage output of all destructive spells while under the influence of an Aspect of Destruction.\r<br />\r<br />Aspect of Illusion - Summon an aspect of illusion in the form of Savos Aren&#39;s friend Elvali.  Find Savos&#39; research jounal in the Arch-Mage&#39;s quarters near a shelf by the alchemy table.\r<br />* A spell that allows the Illusion master the ability of true invisibility and stealth as long as they do not take any actions while under the presence of an Aspect of Illusion.\r<br />\r<br />Aspect of Restoration - Summon an aspect of restoration in the form of Savos Aren&#39;s friend Takes-In-Light.  Find Savos&#39; research jounal in the Arch-Mage&#39;s quarters near a shelf by the alchemy table.\r<br />*A spell that allows the Restoration master to be under a constant healing state that heals health, stamina, and magicka overtime while under the guidance of an Aspect of Restoration.\r<br />\r<br />Summon Flesh Thrall - Found in the Midden of the College of Winterhold.\r<br />*Conjure a Flesh Thrall to fight for by your side draining its victim&#39;s lifeforce and poisoning them.\r<br />\r<br />Light Spell - Light Guadian - Found in Azzadal&#39;s lost satchel in Lost Valley Redoubt near Bard&#39;s Leap.\r<br />* A spell that creates a light sword that burns enemies and disintegrates the undead.\r<br />\r<br />Dark spell - Dark frost - Found in Azzadal&#39;s lost satchel in Lost Valley Redoubt near Bard&#39;s Leap.\r<br />* A spell that releases dark magic that knocks foes down while dealing lingering frost damage.\r<br />\r<br />WEAPONS-\r<br />Dir-Kamal Katana - Ancient Akaviri Demon Katana - Find: Hint located on top of the Throat of the World\r<br />*A vampiric sword that drains the life force of its victims, reducing them to puddles of ectoplasm upon death.  Randomly ignites enemies on fire.\r<br />\r<br />Heretic Troll Traps - Heretic Hunter Guild standard troll traps - Find: Jaque Spratt&#39;s inventory\r<br />A deadly magical mine that floats in the air and explodes upon contact.  Especially deadly versus trolls.\r<br />\r<br />Heretic Hunter Barrier - Heretic Hunter Guild standard beast cage launcher - Find: Jaque Spratt&#39;s inventory\r<br />Fires a device that creates a holding cage to trap beasts.  (The cage is breakable, so be careful).\r<br />\r<br />Kagrenac&#39;s Repair Staff - A staff that repairs the Dwemer Transport automaton.\r<br />\r<br />SCROLLS-\r<br />Njord&#39;s Whistle - Allows the player to temporarily summon Ylgar&#39;s dog Njord.\r<br />Jyrik&#39;s Essence - Allows the player to temporarily summon the subjugated soul of Gauldur&#39;s son Jyrik\r<br />Sigdis Essence - Allows the player to temporarily summon the subjugated soul of Gauldur&#39;s son Sigdis\r<br />Mikrul Essence - Allows the player to temporarily summon the subjugated soul of Gauldur&#39;s son Mikrul\r<br />\r<br />HERETIC BEAST SOUL HUNT-\r<br />Aquadon - King of Trolls \r<br />Fenrir - Aspect of the Storm \r<br />Iku Tursas - Horker Emperor\r<br />Kirin - Aspect of the Light\r<br />\r<br />HERETIC BEAST LOOT-\r<br />These items are under misc items section and will not be usable until future releases.  You can sell them now, but I&#39;d say save them for later ;D\r<br />Aquadon: Aquadon Skull, Bones, Fur, Skin, and Heart\r<br />Fenrir: Fenrir Skull, Bones, Hide, Heart, and Pelvic Bone\r<br />Kirin: Kirin Skull, Ribs, Hide, Antlers, and Heart\r<br />Iku Tursas: Tursas Tusk, Shoulder Bone, Bones, Heart, and Blubber.  (Tursas&#39;s bones are extremely heavy and will completly hinder you.  The bones can be broken down into bone chips or tusk chips by striking the bones or using magic.  The amount of chips you get is based on applying the lowest amount of damage, while waiting for the chips to fall off (long process), or using a high powered item to get less amounts of chips but destroying the bones quicker).   Turkas&#39;s blubber can be used as flame bomb traps...after obtaining them, drop them from inventory in the ideal spots you want to set up a trap.  Once the enemy gets near, shoot an arrow at the blubber, and BOOM&#33;)\r<br />\r<br />BOSS BATTLES-\r<br />Aspect of Kagrenac - Find Reachwind Eyrie \r<br />Aspect of the Snow Prince - Find him in Blackreach\r<br />Aspect of Orgnum - Search the northern coast\r<br />The Caller&#39;s Spirit - Summon her at the Atronach Forge\r<br />Septimus&#39;s Safe - Find it at Septimus&#39;s Outpost\r<br />Captured Flesh Atronach - Find it at the Midden Dark\r<br />Unleashed Jyrik - Summon him at the Purification Altar\r<br />Unleashed Sigdis - Summon him at the Purification Altar\r<br />Unleashed Mikrull - Summon him at the Purification Altar\r<br />Curse of Corruption - Summon it at the Purification Altar\r<br />Mikael Mire - DB unmarked quest\r<br />Chalkie - DB unmarked quest\r<br />Pins-In-Head - DB unmarked quest\r<br />Frederick Krux - DB unmarked quest\r<br />Jensen Voorhaus - DB unmarked quest\r<br />Updated Kematu - An upgraded version of him from his vanilla self. (Side Quest)\r<br />Updated Linwe - An upgraded version of him from  his vanilla self. (Thieve&#39;s Guild)\r<br />Updated Hamelyn - An upgraded version of him from his vanilla self. (Thieve&#39;s Guild)\r<br />Mystified Spellsword - A possessed spellsword manipulating Heliand&#39;s songs for magical purposes.\r<br />\r<br />NEW ENEMY MOBS-\r<br />Killer Bees - Located throughout the wilderness\r<br />Flesh Atronachs - Located throughout the wilderness and can be conjured by high level conjurers.\r<br />\r<br />[img]http://i34.photobucket.com/albums/d135/d3cypherdis/LegendarySouls/LegendarySoulHeaderComingSoon.png[/img]\r<br />Elysian Isle - A mythical island located in an unknown realm where the legendary souls from Aetherius, Oblivion, the Void, the Nexus, and other plains of existence meet to battle.  The island will have the Arena of Fate, Athenaeum Einherjar, Hall of Champions, Arsenale Campione, and possibly a new player home.\r<br />\r<br />Athenaeum Einherjar - Legendary library containing the texts of the legendary souls.\r<br />\r<br />Arena of Fate - Legendary arena where the souls compete for supremacy.\r<br />\r<br />Hall of Champions - A special section of the Arena of Fate that calls upon the champions from the Nexus.\r<br />\r<br />Arsenale Campione - Legendary armory containing the weapons of the historic souls.\r<br />\r<br />Player usable abilities that the summons use.\r<br />\r<br />Heretic Beast Hunter&#39;s Guild.\r<br />\r<br />Additional souls to summons:\r<br />Blades summons&#33;\r<br />\r<br />For reference&#39;s purposes, this is my entire list of summons I plan to release (including some I&#39;ve already released):\r<br />Legendary Hero Ysgramor\r<br />Companion Harbinger Kodlak\r<br />Cursed Companion Skjor\r<br />Prodigal Son Ylgar\r<br />Lost Legend Gauldur\r<br />Arch Mage Savos\r<br />Master Wizard Mirabelle\r<br />Soul Shade Arniel\r<br />Grey Fox Emer\r<br />Nightingale Sentinel Gallus\r<br />Phantom Sentinel Mercer\r<br />Fallen Thief Isabelle\r<br />Spectral Assassin Lucien\r<br />Void Assassin Astrid\r<br />Treacherous Assassin Matheiu\r<br />Shadowscale Assassin Ocheeva\r<br />Troubador Soothsayer Heliand\r<br />Ethereal Bard Svaknir\r<br />Sword Singer Azzadal\r<br />Terrible Performer Lurbuk\r<br />Blades Ambassador Brisienna\r<br />Blades Grandmaster Jauffre\r<br />Blades Defender Baurus\r<br />Blades Agent Bolar\r<br />Greybeard Master Jurgen\r<br />Ancient Warrior Hakon\r<br />Ancient Strategist Felldir\r<br />Ancient Hunter Gormlaith\r<br />Pirate King Velehk\r<br />Pirate Queen Safia\r<br />Pirate Captain Haldyn\r<br />Pirate Maurauder Jaree-ra\r<br />Tactical Mage Traven\r<br />Telvani Scorcerer Aryon\r<br />Whisper Conjurer The Caller\r<br />Synod Engineer Septimus\r<br />Grand Emperor Martin\r<br />Loyal General Tullius\r<br />Peniticus Commander Maro\r<br />Expedition Leader Sulla\r<br />Dragon Slayer Olaf \r<br />Rebel Commander Ulfric\r<br />High King Torryg\r<br />Battle Maiden Matilda\r<br />Wolf Queen Potema\r<br />Corrupt Wizard Malkoran\r<br />Necromatic Seducer Andoril\r<br />Death Bandit Sild\r<br />Oblivion Usurper Mankar\r<br />Daedric Dictator Malyn\r<br />Afflicted Rebel Orchendor\r<br />Vile Traitor Sebastian\r<br />Psijic Ritemaster Iachesis\r<br />Mystic Grandmaster Galerion\r<br />Worm King Mannimarco\r<br />Psijic Priest Urvwen\r<br />Mirror Mage Shalidor\r<br />Royal Mage Geirmund\r<br />Dark Mage Zurin\r<br />Battle Mage Jagar\r<br />Fighters Founder Dinieras\r<br />Champion Fighter Modryn\r<br />Lich Warrior Ariell\r<br />Vampiric Hunter Movarth\r<br />Assassin Grandmaster Eno\r<br />Assassin Master Ethasi\r<br />Assassin Knower Rodul\r<br />Assassin Thrall Angahran\r<br />Hunter Spirit Froki\r<br />Spider Magician Kornalus\r<br />Skeever King Haemlyn\r<br />Headless Horseman Ragnar\r<br />Eternal Ruler Ysmir\r<br />Slave Queen Alessia\r<br />Weapon Lord Shinji\r<br />Sovengard Gatekeeper Tsun\r<br />Forsworn King Faolan\r<br />Sword Saint Frandar\r<br />Dragon Archpriest Konahrik\r<br />Silver Knight Zuuk\r<br />Druid Poisoner Catchica\r<br />Falmer Champion Snow Prince\r<br />Maormer Monarch Orgnum\r<br />Chimer Hortator Nerevar\r<br />Dwemer Magecrafter Kagrenac\r<br />Ayleid Ruler Umaril\r<br />Orsimer Gladiator Grey Prince\r<br />Bosmer Huntsman Oreyn\r<br />Altmer Potentate Ocato\r<br />Dunmer Saint Juub\r<br />Sload Soulstealer N&#39;gasta\r<br />Khajiit Ruler Dro&#39;zel\r<br />Tsaesci Pontate Versidue\r<br />Kamal Demon Ada&#39;Soom\r<br />Argonian Axemaster Nienolas\r<br />TangMo ????\r<br />Ka Po&#39;Tum Tosh&#39;Raka\r<br />Limolith ????\r<br />Imga ????\r<br />Witch Covenmother Jsashe\r<br />Mercinary Headmaster Vychamp\r<br />Alik&#39;r Warrior Kematu\r<br />Summerset Shadow Linwe\r<br />Supreme Alchemist Curalmil\r<br />Vigilant Keeper Carcette\r<br />Thalmor Wizard Ancano\r<br />War Teacher Adrimk\r<br />Master Shadowmage Azra\r<br />Chivalrous Knight Garridan\r<br />Forest Huntress Fjori\r<br />Arch Pyromancer Silvia\r<br />Blood Matron Lamae\r<br />Thieving Gentleman Jim\r<br />Rogue Agent Miramor\r<br />Arch Cryomancer Drelas\r<br />Rebel Leader Cyrus\r<br />Cammona Thugmaster Orvas\r<br />Vengeful Scout Cassyr\r<br />Enchanting Marauder Alain\r<br />Crusader Paladin Amiel\r<br />Senarist Dictator Nesmyt\r<br />Mad Thief Chance\r<br />Bandit Warchief Hajvarr\r<br />Telvani Scorcerer Divayth\r<br />Blackwood Pakseech Ri&#39;Zakar\r<br />Silverhand Elite Krev \r<br />Arch Electromancer Beem-Ja\r<br />Serial Killer Calixto\r<br />Kind Keeper Grelod\r<br />Insane Cook Knjakr\r<br />Crazy Inventor Tahriel\r<br />Adoring Fan Adoring Fan\r<br />Wandering Gourmet Balagog\r<br />Rogue Gambler Vasha\r<br />Cowardly Sellsword Fulheim\r<br />Psycopathic Mother Alea\r<br />Woodland Hero Lync\r<br />Virtuous Assassin Ezzio\r<br />Grey Wizard Grandelf\r<br />\r<br />[img]http://i34.photobucket.com/albums/d135/d3cypherdis/LegendarySouls/LegendarySoulHeaderDevlog.png[/img]\r<br />\r<br />05/05/13 - Version 1I \r<br />1) Adding new summons: Terrible Peformer Lurbuk, Sword Singer Azzadal, and Troubadour Soothsayer Heliand. Lurbuk&#39;s Death Tome can be found off his carcass (i found out his body doesn&#39;t reset or disappear so if you already killed him, just find his body and loot him). Azzadal&#39;s Lyrics can be found near Bard&#39;s Leap. I added a new sachel in the area named Azzadal&#39;s Lost Sachel. Heliand&#39;s Poems can be found by performing a simple investigative (non-marked) quest. Join the Bard&#39;s College and find Gerarde&#39;s Research Journal to find clues where to go. You&#39;ll also have to at least start Sheogorath&#39;s Daedric Artifact quest. At the end of the quest be ready to fight a boss. \r<br />\r<br />2) Made major fixes to Gauldur summon. I noticed he and his sons would all start fighting because of the magic effects from each of their spells. I added conditions so that the spells won&#39;t hurt each other anymore. Also finally saw the unleashed versions of the sons summoning the subjugated versions. This was because the subjugated crystals that the player can loot from the unleashed sons was in their inventory. For some reason the draugr versions will use the item to summon the subjugated versions of themselves. Now the unleashed versions will explode near death and the explosion will drop the purified crystal of the son you just defeated (similar to how wisps drop the wisp cores).\r<br />\r<br />3) Updated Iashesis&#39; spells to make it appear as if he is teleporting enemies instead of tossing them. The enemies will disappear and reappear in different areas. Also fixed the tragectory of where he tosses the enemies. They should no longer go towards the player all the time. Also added a new effect to one of his spells causing a large storm barrier (like the one that the Eye of Magnus makes) during combat. Any enemy near or within it will be tossed around like ragdolls. I added this effect because it felt like for a Legendary class soul, Iachesis didn&#39;t have that &#34;umph&#34;, and I found him getting detroyed easily by the likes of King Orgnum or Snow Prince. This new effect puts him on equal footing with those guys.\r<br />\r<br />4) Updating the current Svaknir summon so he follows the same theme of the other bard summons. The current version tosses song fields around the field.. though useful... makes him seem more like a mage instead of a bard. The the way I made the bard summons now is that they will cast a song on themselves. Once they release the spell, a song field surrounds the bard, and they will proceed and do a performances in the song field. While they are peforming they are invulnerable so they take no damage... Although they take no damange while performing, they will still take damage when they aren&#39;t. Since they are bards, they still die pretty easy if you leave them alone to fight an entire army. \r<br />\r<br />5) Minor update to Kematu summon. I noticed he still killed enemies way to quickly so I lowered some of his damage output. The way he was killing enemies pretty much placed him in Epic/Legendary levels... and I sort of wanted to keep in him in heroic levels.\r<br />\r<br />6) Two new spell for the player to use: Expert Restoration Spell: Light Guardian - Creates a light guardian at the player&#39;s location. The light guaridan is a magical sword of light that inflicts holy fire damage on enemies (regular fire damage on enemies, extremely deadly fire damage on undead). Expert Destruction Spellark Frost - Fires off slow moving dark energy that deals lingering frost damage on enemies and knocks them down. The spell can go through walls and obstacles. \r<br />\r<br />7) New test chest available in the file but not placed in the game map.  Chest name is LegendarySoulsTestChest.\r<br />\r<br />8) Hakon&#39;s Fus Ro Dah modified to lessen lag issues.\r<br />\r<br />\r<br />03/14/13 - Version 1h patch I\r<br />Makes a couple minor fixes:  Adds a taper effect to the Linwe boss fight&#39;s arrow acid against the player.  Should now fade over time.  Also fixes the follower Jaque Spratts follower intro dialog.  The original version was changed with the Dragonborn DLC installed.  No changes made to the Caller boss fight through the Atronach Forge because it was functioning properly.  Certain mods may prevent the Caller from being summoned.  Suggestion would be to temporarily disable the mod, summon the Caller spirit and defeat her, save, enable the other mods, and reload your game.  As for multiple ghoat actors appearing in whiterun, simply use the dismissal spell and they will all vanish.  I am still unable to determine why some people are getting multiple ghoats appearing.  Running the game with minimal mods active does not cause multiple summons to spawn.\r<br />\r<br />01/28/13 - Version 1h\r<br />This update introduces a new legendary class soul to summon:  Dwemer Magecrafter Kagrenac.  Kagrenac is capable of summoning the Numidium to assist him in battle in open air combat.  The update also adds a new mount into the game. Dwemer Transport construct that provides high speed transport but with the risk of the construct breakingdown during transit.  The construct can be repaired before breakdown using Kagrenac&#39;s repair staff, or resurrected it by smashing on the engine it leaves behind.  Adds a player usable staff: Kagrenac&#39;s Repair Staff, usable to repair the Dwemer Transport to avoid it from breaking down.  Removes the Unrelenting Rage shout from the player&#39;s shout list.  Upgrades a few of Iachesis&#39;s Elemental Staves to have more damage output and effects.  Gormlaith&#39;s sword attack now has a chance of triggering an arrowstorm.  Fixes the issue of Gauldur&#39;s subjugated sons turning into their unleashed versions.  There are no more chances of Gauldur&#39;s sons 2 versions appearing at the same time fighting themvelves.  Moved Kirin of the Light&#39;s spawning point further away from Riverwood.  Kirin&#39;s aggression is now neutral and will not attack on sight providing the player the chance to attack or avoid at their own discresion.\r<br />\r<br />01/10/13 - Version 1g\r<br />First update of the new year&#33;&#33;&#33;&#33;  This update adds three new Epic souls: Ancient Warrior - Hakon One-Eye, Ancient Strategist - Felldir the Old, and Ancient Huntress - Gormlaith Golden-Hilt.  This adds them to be summonable from the Powers list and does not update the vanilla shout that summons them.  The update also adds a new Heretic Beast - Kirin of the Light, this is the beast that Jaque Spratt is assigned to hunt, so if you&#39;re lucky he and his Ghoat will be there to help you out.  The Heretic Beast Iku Tursas&#39;s height has been reduced.  Also reduced the health regen of all the Heretic Beasts so that they&#39;re not invinsible.  I&#39;ve also updated Gray Fox&#39;s teleport ability so he disappears and reappears in a puff of mist much similar to his lore.  Fixed Potema&#39;s chest so that it can be opened using Potema&#39;s Catacombs Key.\r<br />\r<br />12/21/12 - Version 1f:\r<br />Adds a new heroic soul to summon Hamelyn.  Updated vanilla bosses such as Linwe, Hamelyn, Kematu, and Potema&#39;s shade to fight more like their legendary soul counterparts, making these battles more tough.  Adjusted Aquadon&#39;s damage output so they&#39;re not too strong.  Updated Mathieu&#39;s dart explosion to match his ice theme better.  Fixed the encountered killer bees so that they slightly easier to defeat.  Tomes for Hamelyn, Kematu, Linwe, Potema, and Savos have been placed in chests to avoid them from being blown away in battle.  Updated Potema&#39;s name to &#34;Queen Potema&#34;.\r<br />\r<br />12/09/12 - Version 1e:\r<br />Adds a new common soul to summon Ocheeva.  Edited the purification altar journal to obtain the Gauldur summon.  Moved the Phantom Sentinel found near Bronze Water Cave to the Twilight Sepulture.  Find the crystal containing the soul and destroy it.  King Orgnum will no longer wander the northern coast to avoid him attacking lower leveled players.  He can still be spawned, but it can be avoided if the player isn&#39;t ready to face him yet.  Find the crystal containing him that Iachesis trapped him in.  The giant crystal is located in the same location he originally wandered near Pilgrim&#39;s Trench.\r<br />\r<br />11/10/12 Version 1d Patch I:\r<br />Patch I released for version 1d.  This patch removes the Suzaku of the Flame Heretic Beast from the game.  Changed Jaque Spratt into an adult and removes his AI package of autofollowing the player wherever the player is at.  He now patrols the outskirts of Whiterun and should randomly stop into town on certain days to get a drink and some food from the Bannered Mare in Whiterun. Jaque&#39;s Heretic Hunter bow is now available for players to use.  He has 2 bows in his inventory, one for him to use and one for the player to take.  This is currently a place holder and will be upgraded at a later time.  It only fires one concentrated arrow that multiplies the arrows on impact, but I am planning on changing this to have a burst shot effect eventually.  Also the bow&#39;s range is very limited and is meant for mid range combat.... don&#39;t expect to snipe using it.  Updated the shader effect on Mathieu Bellamont&#39;s charm effect.  If Mathieu successfully charms an opponent, they should now have a purple glow on them.  Also fixed the issue of the custom Nord race I made for the Companions summons from the playable race list.  It was reported by Kaizersoze that the custom Nord race was made available in the player creation screen.\r<br />\r<br />11/05/12 Version 1d:\r<br />Version 1d released.  Adds a new heroic soul; Treacherous Assassin Mathieu Bellamont.  Also adds new Heretic Beast Iku Tursas the Horker Emperor.  This version also makes many fixes to current content:  Aquadon and Fenrir spawning in replacement of predators throughout the wilderness have been fixed.  The heretic beasts will only spawn in one specific location once certain criteria are met.  Attempts to fix the Rapid Blaster spell once more, this time its a charged concentration spell.  Moved Jaque Spratt to Whiterun&#39;s outskirt and fixed the AI of his Ghoat to follow Jaque only.  (It&#39;s been reported he shows up naked so I may need to fix that).  Jaque&#39;s Ghoat also gets a fix in it&#39;s attack effects for it to be more useful.  Fixed the property of Fenrir&#39;s Storm Attack.  It now only strikes the opponent towards one direction so that a screenlock issue won&#39;t occur if the player has maxed out stats (especially using the True Gauldur Amulet).  \r<br />\r<br />10-24-23 Version 1c Patch I:  \r<br />Patch I for version 1c attempts to fix the CTD issue caused by the Flesh Atronach and Rapid Blaster spells.  Also adds two new Heretic Beast Hunter devices for the players to mess around with.  (These are just placeholders for now and will get expanded upon).\r<br />\r<br />10-22-12 Version 1c:\r<br />Legendary Soul Gauldur, and Heroic Soul Mirabelle Ervine are now available.  Essence crystals (used as scrolls) of Gauldur&#39;s three sons are now available to summon.  New Flesh Atronach added to game for summoning and random encounter battles.  Also adds a Purification Altar on top of the Arch Mage&#39;s Quarters.  New Aspect of Alteration, Conjuration, Destruction, Illusion, and Restoration spells available.  Another fix attempt on Rapid Blaster spell.  Added new Heretic Beast Hunter follower Jaque Spratt, located near the entrance of the College of Winterhold.    New Ghoat Familiars are available in game, only summonable using the Purification Altar, and a special summon by Jaque Spratt.  Fixes the current Heretic Beasts Aquadon and Fenrir, new abilities added.  These two beasts are still available to fight at their designated places, but can also be encountered at level 51 or up.  Fixes Potema&#39;s army summon ability so that she does not automatically summon her soldiers in tight quarters.  Also balances Potema&#39;s Shock Beam so that she needs to charge the spell, and she is unable to move while casting the spell.  Jurgen&#39;s shouts now have Voice projectile visuals and are now much more powerful.  Fixes Iachesis teleportation to appear more like the Psijic Order teleport done by Quarinir.  Added some landscape visuals for a few cells in Elysian Isle, also removed the dragons so the players can preview the zone.  \r<br />\r<br />10-07-12 Version 1b patch I:\r<br />Fixes the Caller recipe again when using the Atronach Forge.  The Caller should be summonable once more.  Also fixes the issue with the Destruction Spell Rapid Blaster causing random CTDs when initially casting the spell.  Elysian Isle entrance has also been added, but the world space is not finished yet.\r<br />\r<br />09-26-12 Version 1b:\r<br />Adds one new soul - King Orgnum.\r<br />Fixes the issue where Mercer&#39;s invisibility did not work and Ylgar using his bow too much.  Also replaces Isabelle&#39;s throwing dagger model from the shiv to glass daggers so they are more visible.\r<br />\r<br />09-20-12 Version 1a:\r<br />Adds three new souls - Mercer Frey, Ylgar, and Isabelle Rolaine.\r<br />Fixes the issue where the Caller&#39;s spirit cannot be summoned at the Atronach Forge.\r<br />\r<br />[img]http://i34.photobucket.com/albums/d135/d3cypherdis/LegendarySouls/LegendarySoulHeaderMisc.png[/img]\r<br />Use this mod in replacement of my stand alone mods if you want to consolidate them into one file. Please note that although you can use my old stand alone files with this mod, learning the abilities again will double up your powers list with the same spell.  I would suggest that you remove the older files from your mod list, but doing so means you will need to obtain the ability again.\r<br />[img]http://i34.photobucket.com/albums/d135/d3cypherdis/LegendarySouls/LegendarySoulHeaderIssues.png[/img]\r<br />* This file cannot be installed or ran with WryeBash (all versions).  To install and run, please use NMM or the vanilla mod loader.  If you happen to use another file loader and it&#39;s causing problems for you, please let me know so I can compile an incompatibility list.*\r<br />\r<br />UPDATE - MOTOSXORPIO was kind enough to help me resolve the WryeBash issue with these steps, it should help those who use WryeBash run the file.  I will in time make a WryeBash friendly file once I&#39;ve completed the file, since I am constantly working on it, this process would make it cumbersome for me to release a new update each time.  If I am incorrect on this, please let me know and I will make the next update WryeBash friendly.\r<br />\r<br />You can &#34;fix&#34; your esm issue with Wrye Bash...rename or move Original Legendary Souls.esp first, then:\r<br />1. Load/Run Wrye Bash.\r<br />2. Right click on esm, select &#34;copy to esp&#34;.\r<br />3. Load/Run CK.\r<br />4. Select/Load Skyrim.esm, Update.esm & Legendary Souls.esp, with Legendary Souls.esp as &#34;Active&#34;.\r<br />5. Once loaded, make any alteration (such as edit value of Doom Arrow, click OK (revert to original value once &#34;OK&#34; is clicked and you now have an &#34;*&#34; in the title bar for CK). Save & close.\r<br />6. Delete/Rename/Move original esm.\r<br />7. Load/Run Wrye Bash.\r<br />8. Right click on Legendary Souls.esp you&#39;ve been messing with in CK (original esp should be backed up already as pre-step 1. above) and select &#34;copy to esm&#34;.\r<br />9. Delete Legendary Souls.esp that was copied to esm.\r<br />10. Replace Original Legendary Souls.esp\r<br />\r<br />Legendary Souls.esm should now be CK version 1.7 and now Wrye Bash won&#39;t fuss. \r<br />\r<br />* Players who use BOSS will also have issues sorting the file in their lists*  \r<br />\r<br />[img]http://i34.photobucket.com/albums/d135/d3cypherdis/LegendarySouls/LegendarySoulHeaderCredits.png[/img]\r<br />First off I&#39;d like to thank G**. (To be &#34;politically correct&#34; I&#39;ve censored it ya basterds).\r<br />Next my wife for putting up with me doing this (despite some arguments along the way XP), and still supporting me and helping me with feedback. (She used to be a producer for SQEX).\r<br />Third, my three cats, Kemuri, Juri, and Ibuki for letting me do this and not destroying my lap top and wires.\r<br />Next, the two awesome Nexus users who&#39;ve been with me since I&#39;ve first uploaded the Lucien mod: JeftheReaper and Keizaalfeyn.  Jef always coming up with great ideas and suggestions, Keizaal for always providing constructive bug reports and a great resource of TES Lore.  Both have submitted awesome pictures also to share with everyone, and have been actively promoting this mod.\r<br />I&#39;d also like to thank kaizersoze27 and VaMouse for helping me promote this mod.  Kaizersoze27 has posted some awesome videos of Mankar, Ancano, and Mercer during a gameplay run through.  Vamouse has posted 2 sets of awesome pictures for Isabelle and Kematu&#33;  Check them out when you can.\r<br />Last but not least, all of my supporters who&#39;ve been following my work.  I can&#39;t reiterate it enough, it&#39;s you guys who I make these for, and as long as you keep enjoying my work, I&#39;ll keep making these summons.\r<br />\r<br />PS:  If you&#39;ve been very supportive of my work, please don&#39;t be surprised if you see a PM message from me asking some simple questions.  I promise, it&#39;ll be a fun little side project for this major one.\r<br />\r<br />[img]http://i34.photobucket.com/albums/d135/d3cypherdis/LegendarySouls/LegendarySoulHeaderSpoilers.png[/img]\r<br />This section provides vague hints on how to obtain the souls, because these contain potential spoilers do not read if you do not want any spoilers to the quests and storylines:\r<br />\r<br />THE SOULS:\r<br />COMMON-\r<br />Soul Shade - Arniel Gane - Join the Mage&#39;s Guild and do all the quests.\r<br />Blades Agent - Acilius Bolar - Find and explore Bloated Man&#39;s Grotto.\r<br />Summerset Shadow - Linwe - Join the Thieves Guild and do all the quests, otherwise search the area where you fought him.\r<br />Adoring Fan - Adoring Fan  - Explore the top of the Throat of the World.\r<br />Rogue Gambler - Vasha the Gambler - Begin the Dark Brotherhood Questline, otherwise find his body.\r<br />Prodigal Son - Ylgar - Find and explore Dustman&#39;s Cairn for his note where to find him.\r<br />Fallen Thief - Isabelle Rolaine - Talk to the denizens of Winterhold (Not the College). \r<br />Shadowscale Assassin - Ocheeva - Do enough quests for the Dark Brotherhood, and do the quest that Gabriella eventually gives you.\r<br />Terrible Performer - Lurbuk - Take an assassination job in the Dark Brotherhood questline and loot the tome from the victim&#39;s carcass.\r<br />\r<br />HEROIC-\r<br />Cursed Companion - Skjor - Join the Companions and do all the quests, otherwise find him where you last saw him.\r<br />Blades Defender - Baurus - Do the main questline, otherwise go back to Sleeping Giant Inn where you find out ????? is a Blade.\r<br />Whisper Conjurer - The Caller - Join the Mage&#39;s Guild and do all the quests, otherwise go to the area where you found her and find the makeshift atronach forge.\r<br />Synod Engineer - Septimus Signus - Do the main questline or find his outpost, otherwise go to the location where you met him and battle his safe.\r<br />Alik&#39;r Warrior - Kematu - Go to Whiterun and accomplish a side quest involving Redguards, otherwise go to the area where you first met with him.\r<br />Thalmor Wizard - Ancano - Join the Mage&#39;s College and complete all quests, otherwise go to the area where you last saw him and search the area.\r<br />Phantom Sentinel - Mercer Frey - Join the Thieves Guild and do all the quests, otherwise go to the exit of the dungeon where you last saw him.\r<br />Master Wizard - Mirabelle Ervine - Join the Mage&#39;s College and complete all quests, go to the Midden Dark area an search the area.\r<br />Treacherous Assassin - Mathieu Bellamont - Join the Dark Brotherhood, and search the shelves near where Astrid usually stands.  Read the letter and follow instructions.\r<br />Skeever King - Hamelyn - Join the Thieves Guild and go through the story, you&#39;ll run into him.\r<br />Sword Singer - Azzadal - Go to Lost Valley Redoubt and go to Bard&#39;s Leap.  Search around the aquaducts to find Azzadal&#39;s lost satchel.\r<br />\r<br />EPIC-\r<br />Companion Harbinger - Kodlak Whitemane - Join the Companions and do all the quests, otherwise go to the last dungeon of the Companion&#39;s questline and search the secret exit.\r<br />Arch Mage - Savos Aren - Join the Mage&#39;s College and do all the quests, otherwise go to the Arch Mage&#39;s chamber and search around.\r<br />Nightingale Sentinel - Gallus Desidenius - Join the Thieves Guild and do all the quests, otherwise go to Nightingale Hall and search the area.\r<br />Void Assassin - Astrid - Join the Dark Brotherhood and do all the quests, otherwise meet with the Nightmother at Dawnstar.\r<br />Ethereal Bard - Svaknir - Join the Bard&#39;s College and do the initial quest, otherwise go to the dungeon where you met his ghost.\r<br />Ancient Warrior - Hakon One-Eye - Go to the top of the Throat of the World and search.  You&#39;ll find three unmarked graves and a chest.\r<br />Ancient Strategist - Felldir the Old - Go to the top of the Throat of the World and search.  You&#39;ll find three unmarked graves and a chest.\r<br />Ancient Huntress - Gormlaith Golden-Hilt - Go to the top of the Throat of the World and search.  You&#39;ll find three unmarked graves and a chest.\r<br />\r<br />LEGENDARY-\r<br />Legendary Hero - Ysgramor - Join the Companions and do all the quests, otherwise go to the last dungeon of the Companion&#39;s questline and search the area.\r<br />Wolf Queen - Potema - Go to Solitude and do a side quest for the Jarl&#39;s advisor, otherwise go to the dungeon where you meet her ghost.\r<br />Gray Fox - Emer Dareloth - Join the Thieves Guild and do all the quests, go to a certain theive&#39;s home and search his secret room.\r<br />Spectral Assassin - Lucien LaChance - Join the Dark Brotherhood and do all the quests.\r<br />Oblivion Usurper - Mankar Camoran - Visit the Museum in Dawnstar, otherwise go to Mehrunes&#39; treasure room.\r<br />Psijic Ritemaster - Iachesis - Discover and explore Pilgrim&#39;s Trench.\r<br />Falmer Champion - Snow Prince - Do the main quest or find Septimus&#39;s outpost, otherwise go to Blackreach and fight the Falmer Shadowchampion.\r<br />Greybeard Master - Jurgen Windcaller - Do the main quest, otherwise visit the Greybeards and search their living quarters.\r<br />Forsworn King - Faolan the Red Eagle - Read the story of the Red Eagle and do the quest, otherwise, go to the area where you fight him.\r<br />Maormer Monarch - King Orgnum - Search the coast near Pilgrim&#39;s Trench.\r<br />Lost Legend - Gauldur - Start and finish the Forbidden Legend questline.  Upon completion, visit the Purification Altar and prepare for more battles.\r<br />Dwemer Magecrafter - Kagrenac - Find Reachwind Eyrie and find the Dwemer ghosts.  Defeat them to make Kagrenac appear.\r<br />Troubadour Soothsayer - Heliand - Join the Bard&#39;s College in Solitude and find Giraud&#39;s Research Journal on his desk.  Follow the clues and search very thoroughly.",
  "categoryId": "75",
  "version": "FINAL",
  "author": "zeroeternalz",
  "createdUnix": "1346405748",
  "updatedUnix": "1367805846",
  "containsAdultContent": false,
  "uploadedBy": "zeroeternalz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "85497",
      "name": "Legendary Souls version 1",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "151",
      "fileName": "Legendary Souls version 1-23387-1.zip",
      "uploadedUnix": "1346405856",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/28f156971826575242fd252fcce707f133d49c7a8e37717e9adca523b17ec623/analysis/1407134892/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legendary%20Souls%20version%201-23387-1.zip?fid=85497&ttl=1535793584&ri=8192&rs=8192&setec=1cd09277b841cc660a637dfb5b21a962"
    },
    {
      "fileId": "89612",
      "name": "Legendary Souls version 1a",
      "version": "1a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "176",
      "fileName": "Legendary Souls v1a-23387-1a.zip",
      "uploadedUnix": "1348193397",
      "modVersion": "1a",
      "virusScanUrl": "https://www.virustotal.com/file/8d0fc490400a23504e1a0fb5b59b685edbc73e92d41972d2df73db86fe589b13/analysis/1407178564/",
      "changelogHtml": " Adds a new Heroic Soul to summon, Mercer Frey <br/> \n Adds a new Common Soul to summon, Ylgar <br/> \n Adds a new Common Soul to summon, Isabelle Rolaine <br/> \n Fixes summoning the Caller\\'s soul using the Atronach Forge. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legendary%20Souls%20v1a-23387-1a.zip?fid=89612&ttl=1535793585&ri=8192&rs=8192&setec=2bd065481581136b21e82c7c871b8648"
    },
    {
      "fileId": "90523",
      "name": "Legendary Souls version 1b",
      "version": "1b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4628",
      "fileName": "Legendary Souls version 1b-23387-1b.zip",
      "uploadedUnix": "1348663748",
      "modVersion": "1b",
      "virusScanUrl": "https://www.virustotal.com/file/ce6bc738e437d4e255ac4eb81bfd48983246152fd4fc64816088ccf36e665866/analysis/1407187928/",
      "changelogHtml": " Adds new Legendary Soul - Maormer Monarch: King Orgnum. <br/> \n Fixes Mercer Frey\\'s invisibility. <br/> \n Fixes Ylgar\\'s combat style to focus more on melee and not so much with his bow. <br/> \n Replaces the model for Isabelle\\'s throwing daggers from the shiv to glass daggers. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legendary%20Souls%20version%201b-23387-1b.zip?fid=90523&ttl=1535793585&ri=8192&rs=8192&setec=86771667a2c3b86cbd13a2f23b25e3e0"
    },
    {
      "fileId": "92604",
      "name": "Legendary Souls Version 1b Patch I",
      "version": "1bPacthI",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4827",
      "fileName": "Legeary Souls Version 1b Patch I-23387-1bPacthI.zip",
      "uploadedUnix": "1349632334",
      "modVersion": "1bPacthI",
      "virusScanUrl": "https://www.virustotal.com/file/d60ff2cf72db72dc4f109b266582c1575ff3ddcc69fadae9e67e4964dee71a30/analysis/1407208626/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legeary%20Souls%20Version%201b%20Patch%20I-23387-1bPacthI.zip?fid=92604&ttl=1535793586&ri=8192&rs=8192&setec=7f4da689f2d605e2db5f83adf72e8846"
    },
    {
      "fileId": "95162",
      "name": "Legendary Souls Version 1c",
      "version": "1c",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5088",
      "fileName": "Legendary Souls Version 1c-23387-1c.zip",
      "uploadedUnix": "1350907428",
      "modVersion": "1c",
      "virusScanUrl": "https://www.virustotal.com/file/1f8fcc7388db7a156a9bfacd688e20d2ca7de29f1323471daaa8b3d295da646c/analysis/1407232086/",
      "changelogHtml": " Gauldur and Mirabelle Ervine summons now available.  Flesh Atronach and Magic School Aspects available. <br/> \n New follower Jaque Spratt.  New temporary followers Ghoat Familiar. <br/> \n Fixes Potema army summon clogging up tiny areas, and balanced her Shock Beam.  Updates Jurgen\\'s shouts and Iachesis teleportation. <br/> \n Another fix attempt for player spell Rapid Blaster <br/> \n Adds new crafting station Purification Altar.  Fixes Heretic Beasts and added new heretic beast loot. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legendary%20Souls%20Version%201c-23387-1c.zip?fid=95162&ttl=1535793586&ri=8192&rs=8192&setec=5befb71e8743c901d633f543f85f080f"
    },
    {
      "fileId": "95544",
      "name": "Legendary Souls Version 1c Patch I",
      "version": "1cPatchI",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5079",
      "fileName": "Legendary Souls Version 1c Patch I-23387-1cPatchI.zip",
      "uploadedUnix": "1351083093",
      "modVersion": "1cPatchI",
      "virusScanUrl": "https://www.virustotal.com/file/8cc8a62afc9a9ba6bed48972dc37998109898598a31a22342a5d1ac446d6349a/analysis/1407234206/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legendary%20Souls%20Version%201c%20Patch%20I-23387-1cPatchI.zip?fid=95544&ttl=1535793586&ri=8192&rs=8192&setec=084fa562b73b9456ce474e0575f0f4f0"
    },
    {
      "fileId": "97620",
      "name": "Legendary Souls v1d",
      "version": "v1d",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5162",
      "fileName": "Legendary Souls v1d-23387-v1d.zip",
      "uploadedUnix": "1352103251",
      "modVersion": "v1d",
      "virusScanUrl": "https://www.virustotal.com/file/1a5840da6fab36038ea734ba7d9a366f692d06c88d49a76bb6350890e6150b0e/analysis/1407254068/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legendary%20Souls%20v1d-23387-v1d.zip?fid=97620&ttl=1535793587&ri=8192&rs=8192&setec=51324189b0e454ef26af553d76671fb3"
    },
    {
      "fileId": "98614",
      "name": "Legendary Souls version 1d patch I",
      "version": "1dPatchI",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5148",
      "fileName": "Legendary Souls version 1d patch I-23387-1dPatchI.zip",
      "uploadedUnix": "1352578820",
      "modVersion": "1dPatchI",
      "virusScanUrl": "https://www.virustotal.com/file/3958daa494eed162ff50709c1dfb05c617e43ea15bf330b35deb83cd7f7fb03c/analysis/1407257407/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legendary%20Souls%20version%201d%20patch%20I-23387-1dPatchI.zip?fid=98614&ttl=1535793587&ri=8192&rs=8192&setec=10723e90cfa3c5ca4d2a1d9e9c0911ab"
    },
    {
      "fileId": "104308",
      "name": "Legendary Souls version 1e",
      "version": "v1e",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5178",
      "fileName": "Legendary Souls version 1e-23387-v1e.zip",
      "uploadedUnix": "1355114656",
      "modVersion": "v1e",
      "virusScanUrl": "https://www.virustotal.com/file/64190a7c0abfc6f24411cc3855b47f91697da4c401867192140d483f500a29e5/analysis/1407298147/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legendary%20Souls%20version%201e-23387-v1e.zip?fid=104308&ttl=1535793588&ri=8192&rs=8192&setec=e8097a0d7ab3b419d36a7293f555ff6c"
    },
    {
      "fileId": "106573",
      "name": "Legendary Souls version 1f",
      "version": "v1f",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5177",
      "fileName": "Legendary Souls version 1f-23387-v1f.zip",
      "uploadedUnix": "1356092213",
      "modVersion": "v1f",
      "virusScanUrl": "https://www.virustotal.com/file/1fdaa11723555e228cb3424ac0da0251d810d5b98e5c69adbeb0c58af154b5f1/analysis/1407315246/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legendary%20Souls%20version%201f-23387-v1f.zip?fid=106573&ttl=1535793588&ri=8192&rs=8192&setec=684babc43002aabbb002df0d26e3f093"
    },
    {
      "fileId": "1000001386",
      "name": "Legendary Souls version 1g",
      "version": "v1g",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5226",
      "fileName": "Legendary Souls version 1g-23387-v1g.zip",
      "uploadedUnix": "1357825641",
      "modVersion": "v1g",
      "virusScanUrl": "https://www.virustotal.com/file/0cf2a25035cc1b3d115a90f0987f1f79801fff9aeea96875aca593e4ecf70b6e/analysis/1407346386/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legendary%20Souls%20version%201g-23387-v1g.zip?fid=1000001386&ttl=1535793589&ri=8192&rs=8192&setec=32a5bd0f0738e367a5c11165eee45a1b"
    },
    {
      "fileId": "1000005674",
      "name": "Legendary Souls version 1h",
      "version": "v1h",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5241",
      "fileName": "Legendary Souls veersion 1h-23387-v1h.zip",
      "uploadedUnix": "1359444125",
      "modVersion": "v1h",
      "virusScanUrl": "https://www.virustotal.com/file/cf2e8a7e22f4a0ce25cd8e4cf2fa0e6ffa29a074e0bb0015fbc189ae812dec2a/analysis/1407385386/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legendary%20Souls%20veersion%201h-23387-v1h.zip?fid=1000005674&ttl=1535793589&ri=8192&rs=8192&setec=5e71c74c69276181c8d90361a7e3aed8"
    },
    {
      "fileId": "1000017564",
      "name": "Legendary Souls version 1h Patch I",
      "version": "1hPatchI",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5015",
      "fileName": "Legendary Souls version 1h Patch 1-23387-1hPatch1.zip",
      "uploadedUnix": "1363323336",
      "modVersion": "1hPatchI",
      "virusScanUrl": "https://www.virustotal.com/file/74e3d382eefe6d252e578c08a4bddb3c1d0878d091c5559dcfca7df581dc0cbd/analysis/1407470610/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legendary%20Souls%20version%201h%20Patch%201-23387-1hPatch1.zip?fid=1000017564&ttl=1535793590&ri=8192&rs=8192&setec=a06a1f3b9330947eb69eda9ad297c742"
    },
    {
      "fileId": "1000028334",
      "name": "Legendary Souls version 1I",
      "version": "1I",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "5301",
      "fileName": "Legendary Souls version 1I-23387-1I.zip",
      "uploadedUnix": "1367805846",
      "modVersion": "1I",
      "virusScanUrl": "https://www.virustotal.com/file/4d6174ba44d5d6741f6d004445333799b5b26ad750b63aec4a8fe4a783c381ce/analysis/1407557111/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legendary%20Souls%20version%201I-23387-1I.zip?fid=1000028334&ttl=1535793590&ri=8192&rs=8192&setec=4f9362c999b48d5ee2d544a24bda412b"
    }
  ]
}