{
  "modId": 23407.0,
  "modName": "Aezeals Floating Fortress",
  "summary": "",
  "descriptionHtml": "Near the Whiterun Gates you can meet someone who will set you on the path that will lead to a Floating Dwemer Fortress. The Fortress is a suitable impressive living space for the Dragonborn.\r\nFeatures:\r\nA Floating Fortress, with large dwemer hallways in the deep and a contempory mansion on top.\r\n\r\n- A faithful Khajithi Steward who happens to come up with a few problems that require someone with loads of combatskills to solve\r\n- A loyal servant in the bedroom \r\n- A Snowy Sabrecat as potential animal follower\r\n- 2 pet dragons\r\n- Guardian Dwemer Spheres, Spiders and Centurions\r\n- All crafting stations\r\n- Loads of storage space, mannequins and plaques\r\n- Teleports to various regions in Skyrim\r\n- A boatride to Whiterun\r\n- A fiery blacksmith (with fiery dog) at the forge and a dwemer centurion Chef in the Kitchen\r\n- A Trophy room: \r\n---Find the taxidermy tools in the taxidermy workshop next to the Trophy room\r\n---Kill an enemy and put the taxidermy tools on the corpse to unlock the corresponding stuffed creature in the Trophy Room.\r\n--- Don’t forget to pick the tools up again.\r\n- A training room with UNLIMITED dwarven spheres to combat if you need training\r\n- The Dwemer Centurion Combat Suit ( as of now working!)\r\n--- Enter by clicking on it (picking up)\r\n--- Leave by equipping (in inventory)\r\n--- If left behind will reset to original position after 1h (RL time)\r\n- 2 books with background information\r\n- A dragon summoning dwemer “loudspeaker”\r\n- Umbra has a new owner\r\n- A new (somewhat overpowered) fun spell “ Banish to a private Hell ” to finish your enemies with.\r\n- A new spell for on those on the road: Dwemer Campsite. \r\n--- I know there are campmods but the owner of a huge Floating Fortress doesn’t need to stay in a tent. Stone >> cloth. Find the book and try it out.\r\n---For best effect: use on open and somewhat flat terrain.\r\n- A secret room \r\n- A divine secret \r\n- A new secret: find the golden waterfall in the house.\r\nThe new dark (and lethal) dwarven armory dungeon Tincan Cave which lies below Dragonreach keep in Whiterun. The entrance of this armory is on the north-eastern slope of the Dragonsreach hill (outside the city). \r\nBleachwind mine. An excavatable mine that starts as nothing but you can expand it and discover ore… and more. (reward for the first quest the Steward gives you).\r\n\r\nPS. Tin Can Cave is a VERY though battle. I leave it there so you can return if you feel confident BUT there is a back entrance a bit higher on the slope for those low-high level characters who want to use the Fortress but for whom the main entrance is a bit too much of a challenge. ",
  "categoryId": "68",
  "version": "",
  "author": "Aezeal",
  "createdUnix": "1346443141",
  "updatedUnix": "1346445494",
  "containsAdultContent": false,
  "uploadedBy": "Aezeal",
  "primaryFile": null,
  "files": [
    {
      "fileId": "85600",
      "name": "Aezeals Castle",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2022",
      "fileName": "Aezeals Castle-23407-.rar",
      "uploadedUnix": "1346445494",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/35edc22a1f78b3cdbfb894ae9dfab719349c8ce290eb6e72720705a3c1c0741f/analysis/1407136276/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aezeals%20Castle-23407-.rar?fid=85600&ttl=1535793632&ri=8192&rs=8192&setec=b2b7ccf809be2f83a3b00622bb741c28"
    }
  ]
}