{
  "modId": 23419.0,
  "modName": "Masterful Magic",
  "summary": "Adds few powerful spell that no master mage can do without :)",
  "descriptionHtml": "Hi guys!\r\n\r\nI\\'ve noticed that being a mage in Skyrim is not that rewarding - sometimes even bandits can kill you on higher difficulties, and there isn\\'t much spell variety. I\\'m aiming to add a few spells which make you feel like a powerful mage - because why shouldn\\'t you be able to turn someone into a chicken?\r\n\r\n[color=red]This mod adds few to a custom made realm which can be accessed through Midden under the College of Winterhold. Have a look for the door, it\\'s right next to the Atronach Forge. You will have to fight some enemies to access the spells! I\\'ve uploaded a picture which shows the location of the door with respect to the Atronach Forge[/color]\r\n\r\n>This mod increases the damage dealt by all destruction spells\r\n\r\n>Transmogrify - turn anyone into a chicken. Now if you have an expert illusion perk, you can even turn dragons into chickens.\r\n\r\n>Self Assembly - conjure a Dwemer Centurion Master to fight by your side!\r\n\r\n>Electric Shock - paralyse the enemy while electrocuting them\r\n\r\n>Purifying Light - a powerful beam of light which damages the target\r\n\r\n>Push Matter - basically a cheap and quick way of using Unrelenting Force, without having to wait for it to recharge. Does minor damage.\r\n\r\n>Slow time - does what it says on the tin. Slows down time for 30 seconds.\r\n\r\n>Soul Crusher - a very powerful spell which kills ANYTHING (even dragons) in one hit, and soul traps it. However for it to work, you NEED to have the master destruction perk AND the target has to have less than 25% health. (to avoid having the spell overused or misused).\r\n\r\n>Grab - grab anyone and anything, and launch them into the air! Sadly they do not take fall damage due to creation kit limitations but this spell is a lot of fun to play with. Send a troll flying through the air!\r\n\r\n>Shalidor\\'s Protection - Boosts all your resistances for 30 seconds at a cost of a bit of your life.\r\n\r\n>Turn to stone - turn someone to stone for a whole day. Can turn them back if you attack them.\r\n\r\nThis is my first mod. All comments/criticisms welcome. I will be updating this in the future. Current version 2.0\r\n\r\nTo install just copy the file to the data folder.\r\nNo known compatibility issues\r\n\r\nEnjoy!",
  "categoryId": "75",
  "version": "2.0",
  "author": "Piszczel",
  "createdUnix": "1346458339",
  "updatedUnix": "1347325032",
  "containsAdultContent": false,
  "uploadedBy": "piszczel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87743",
      "name": "Masterful Magic v2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28",
      "fileName": "Masterful Magic v2-23419-2-0.rar",
      "uploadedUnix": "1347325032",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/a458630109748056b5e0ef46dd40f0376e53c58428749bec064e38c8b69af5ef/analysis/1407158826/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Masterful%20Magic%20v2-23419-2-0.rar?fid=87743&ttl=1535793674&ri=8192&rs=8192&setec=26c8ef23e709f7e91eed6eb36a776e21"
    }
  ]
}