{
  "modId": 23414.0,
  "modName": "Shakespeare the fox",
  "summary": "Adds a fox follower named Shakespeare to Arcwind Point. Complete with a summon spell, in case he gets lost.",
  "descriptionHtml": "Shakespeare the fox\r\n\r\nAlso on the Steam Workshop: http://steamcommunity.com/sharedfiles/filedetails/?id=93210539\r\n\r\nDESCRIPTION:\r\n\r\nThis mod adds a fox companion to the game. His name is Shakespeare, and he is located near the tower at Arcwind Point, south of Ivarstead. This area has draugr and a dragon, so beware! Luckily, Shakespeare cannot die and levels up with you. As of version 1.1 of this mod, there is also a spell to summon Shakespeare to you. The spell tome to learn this is found near where Shakespeare is, at the base of the tower.\r\n\r\nINSTALLATION:\r\n\r\nJust drop everything into the data folder.\r\n\r\nKNOWN ISSUES:\r\n\r\nYou have to tell Shakespeare to wait before telling him to follow you. This is only an issue the first time you get him as a follower, and any times you get him after sending him \\\"home\\\" (Back to Arcwind Point).\r\n\r\nThere is sometimes a problem with initiating dialogue with Shakespeare. Be sure you are not in combat, and do not already have an animal following you. If neither of these are currently happening, open up the console (Usually the tilde~ key, to the left of the 1 key) and type in \\\"set PlayerAnimalCount to 0\\\", without the quotes, of course. This should fix it.\r\n\r\nINCOMPATIBILITIES:\r\n\r\nNone that I know of, though there might be problems with any mod that changes the landscape around Arcwind Point, specifically cell 16,-23.\r\n\r\nCHANGELOG:\r\n\r\nv1.1- Adds a spell tome which teaches a spell to summon Shakespeare, if he gets lost. Found at the same place as Shakespeare. Also, a bug fix.\r\n\r\nv1.0- Initial release. Adds a fox follower named Shakespeare to the tower at Arcwind Point.\r\n\r\n\r\nADDITIONAL NOTES:\r\n\r\nThis mod was inspired by my favourite house mod for Oblivion. Cookies to you if you can guess what it is.\r\n\r\nIf you want to use the contents of this mod for any of your own projects, go right ahead. Just make sure to credit me if you release it.",
  "categoryId": "65",
  "version": "1.1",
  "author": "MasterZipZero",
  "createdUnix": "1346453349",
  "updatedUnix": "1346459577",
  "containsAdultContent": false,
  "uploadedBy": "MasterZipZero",
  "primaryFile": null,
  "files": [
    {
      "fileId": "85635",
      "name": "Shakespeare the fox V1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Shakespeare the fox V1_1-23414-1-1.zip",
      "uploadedUnix": "1346459577",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/8e4dfb81dbca858118c714eff7756c6ec8d87fe8940efedcf524eb0d24b8aad3/analysis/1407136626/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shakespeare%20the%20fox%20V1_1-23414-1-1.zip?fid=85635&ttl=1535793642&ri=8192&rs=8192&setec=c76d78d7317c9fdd3109cbccce090945"
    }
  ]
}