{
  "modId": 23423.0,
  "modName": "Skyrim - Rising Storm",
  "summary": "A massive quest/adventure featuring custom scripts and voice acting. WORK IN PROGRESS. Please sign up to help!",
  "descriptionHtml": "\\\"Skorm inadvertently discovered a hidden stronghold of Dragon Cultists in the secluded monastery of Forelhost high in the Jerall Mountains. Deciding it was too big a threat to ignore, his men attempted a preemptive strike to deal with the cult quickly, but it failed and a siege ensued for several weeks.\r\n \r\nWith the help of a Voice master, the main gate was breached. The cultist retreated into the interior of the monastery and collapsed the main stairway to block access to the refectory. Eventually, Skorm took the fortress but discovered the cultists had commited mass suicide, either by poision or slitting their wrists.\r\n \r\nWithin the catacombs they discovered a well, with several buckets already filled. Several thirsty soldiers drank the water not knowing that it had been poisoned by the cultists and died. Demoralized and now at half their original strength, Skorm abandonded the search for any cultist survivors and left the monastery to push his forces north the next day.\\\"\r\n \r\n                                                                                  - Excerpt on the Dragon Cult, Skyrim Wiki\r\n\r\n\r\n\r\nA work in progress adventure for Skyrim. This is my first mod, and at the moment I am working on it daily, and with the time and determination I have, I hope to see this expansion become a reality. This adventure will follow the events of the main quest and start a whole new adventure for the Dragonborn. This will me a MASSIVE overhaul for Skyrim and change the ending of the game completely. Currently, I am looking for experts in the following catagories \r\n\r\nVoice Acting\r\nScripting (Events and bosses)\r\nCustom Textures for textiles \r\n\r\nSo far, I am good on creating the dungeons and story, I just require assistance with a few advanced things. Think twice before looking this over, because I\\'m sure with enough help that this will be one of the greatest adventures in Skyrim.\r\n\r\nPlease message me if you want to help with this project so that we can make Elder Scrolls history! \r\n\r\nUPDATE 9/25/12\r\n\r\nThank you to all who have been checking back on this. I still need help with the things listed below. Progress has come to a stop for a little while because of Borderlands 2, but in a few weeks I will be back to working on this. Spread the word!\r\n\r\n\r\nThe dungeon layouts are coming along nicely, and they are filled with unique visuals and breathtaking scenery. I\\'ve decided to extend the first part of this series, so the final product won\\'t be out for quite awhile. Here is a list of specific items I need assistance with. Please leave a comment or contact me if you know how to do one of these and can help.\r\n\r\nScripting: \r\n\r\nSkeletons rising out of bone piles after a non-hostile NPC casts a spell into the room. Just like Dimhollow in Dawnguard. \r\n\r\nA wood floor cavein, followed by a blackout cutscene/waking up and beginning a conversation with a non-hostile NPC across the room. I know it sounds like a lot, but I\\'m clueless on how to script this. A video tutorial or detailed instructions would help a lot.\r\n\r\nEnter a room and a cutscene starts, some people get up from their chairs and an NPC runs from the room, sealing the door behind him. Once all enemies or dead, the door opens. The fleeing NPC vanishes after going through the non-load door. \r\n\r\nQuest: \r\n\r\nHaving a courier find you once the mod is downloaded, giving a letter, and starting the quest. I havn\\'t looked into quest tutorials yet because i\\'m not at that stage, so I don\\'t know how difficult this is to do.\r\n\r\nDesign: \r\n\r\nI need someone good with art and design to make a custom banner for the Dragon Cult. Please apply to a flag and email me any concept art you may have. Thanks!\r\n\r\nNPC: \r\n\r\nI\\'m trying to figure out how to randomly generate different looking humanoid enemies, like how bandits are, only have them wearing the same clothes/weapons/spells. \r\n\r\nI have permission from several other mod creators to use their armor in my game. I would like to know how to add their armors into my mod, without requireing users of my mod to download theirs as well.",
  "categoryId": "35",
  "version": "",
  "author": "SquallyDaBeanz",
  "createdUnix": "1346462581",
  "updatedUnix": "1346462581",
  "containsAdultContent": false,
  "uploadedBy": "SquallyDaBeanz",
  "primaryFile": null,
  "files": []
}