{
  "modId": 23428.0,
  "modName": "Castlevania Memories First Episode",
  "summary": "This is the first episode of the Memories version, the continue of the Castlevania Demo version. This episode has it&#39;s own ending and you can go back to Skyrim once finished the quests. Contains the Abandoned Castle with add-ons, the Baljhet Mountains and Garibaldi Temple.",
  "descriptionHtml": "Castlevania Memories First Episode\r<br />\r<br />[img]http://static.skyrim.nexusmods.com/mods/images/23428-1-1346483423.jpg[/img]\r<br />\r<br />========================================\r<br />\r<br />You could watch this spotlight to get a general idea of what would it be:\r<br />\r<br />[youtube]yy5vhB3ktPg[/youtube]\r<br />\r<br />And the walkthrough of the gameplay by JohnnySQS:\r<br />================================================\r<br />Part 1 & 2\r<br />[youtube]7FoRFBkA0II[/youtube]    [youtube]Um3ejMsbOVo[/youtube]\r<br />\r<br />Part 3 & 4:\r<br />[youtube]RrfZtLC3d_4[/youtube]    [youtube]wGr0QW1XhTI[/youtube]\r<br />=================================================\r<br />~Before posting any comments about found bugs, read the warnings section below. There might be a solution to your problem already.~\r<br />\r<br />~Now you can play the Boss Rush Mode as well. Travel to Riverwood as usual and find a red lighted chest near Sleeping Giant Inn and use the ticket to Boss Rush. You can activate it before or after you finish the main mod. They don&#39;t conflict. Also, it doesn&#39;t require Dawnguard.\r<br />\r<br />~You must not have installed and active any other Castlevania versions, testing, demo or anything else for this mod to play properly. Delete the other versions and their bsa if any to properly play this one. Also, you MUST have in your game folder the CastlevaniaMemoriesFirstEpisode.esm, CastlevaniaData.esp, CastlevaniaData.bsa, CastlevaniaData.bsl and the videos folder.\r<br />\r<br />-You can have Alucard&#39;s clothes while playing this mod from here if you like, the two mods are not conflicting:\r<br />http://skyrim.nexusmods.com/mods/23633\r<br />\r<br />This is finaly the first episode of the Castlevania Memories and contains the whole story until Garibaldi Temple. Germain calls us to fight Dracula because there are no Belmonts left in this century to oppose him. He later finds that Shaft, a dark priest from Dracula&#39;s allies tries to ressurect him within the body of Richter Belmont, one who should be away from Europe for a long trip. Now, it&#39;s up to you to stop him from reviving the Lord of Castlevania.\r<br />\r<br />Due to the mod&#39;s large file size, I couldn&#39;t get into this any more\r<br />areas as Skyrim has some limitations to the mod files. The story will be fully completed in the next episode.\r<br />\r<br />The cut-scenes are real made scenes and dialogues from the mod, which I made them like videos to prevent strange behaviors when a scene played or fps drop when many scenes would initialized at once. I also made sure that in this way, they will always be the same as I first created them.\r<br />\r<br />*Events are from the original Castlevania series but they don&#39;t follow Konami&#39;s timeline. They are remixed into a new story with Castlevania-\r<br />Friendly background and many things that reminds the original games for PS2 and PSOne. That&#39;s why this mod is called Memories and not let&#39;s say\r<br />Curse of Darkness.*\r<br />\r<br />-[b]As always, endorsments or votes are much appricieted if you enjoyed this episode.[/b]\r<br />===================================\r<br />Quest StartUp\r<br />===================================\r<br />You will go to Riverwood as in the demo version and find the mysterious mechanic chest in front of Riverwood Trader. Make sure that you first read the not so that the quest is started and then, use the ticket as the objective says.  You will be teleported to the Abandoned Castle Bridge and you&#39;re free to explore.\r<br />\r<br />===================================\r<br />Enemies:\r<br />===================================\r<br />(When I say level increase, it means that the enemies are more powerful as you progress through the mod)\r<br />\r<br />-Skeletons (Basic Castlevania enemies, with *level increase*)\r<br />-Flaming Skeletons (Seen in LoI I think)\r<br />-Blood Skeletons (Seen in LoI, CoD and SotN with *level increase*, a bloody undead with the power to revive)\r<br />-Phantom Skeleton (Seen in CoD)\r<br />-Golden Bones (Seen in CoD, a bonus enemy with a special item)\r<br />-Armor Knight (Seen in CoD and LoI, with *level increase*, a soulless armor with short axe)\r<br />-Axe Armor (Seen in LoI and CoD, with *level increase*, a soulless armor with battleaxe)\r<br />-Ghost (Seen in LoI and CoD and SotN, a ghost with a lantern)\r<br />-Shadow Knight (Seen in LoI, CoD and SotN, a shadow sprite)\r<br />-Fenrir (Seen in LoI, CoD, SotN with *level increase*)\r<br />-Flaming Fenrir (A new style of Fenrir, not seen in these games)\r<br />-Skeleton Blaze (Seen in CoD, a skeleton with dual blades)\r<br />-Blaze Master (Seen in CoD, a more powerful version of the Skeleton Blaze)\r<br />-Cyclops (Seen in CoD and LoI, an one eye giant)\r<br />-Executioner (Seen CoD, a half giant brawler, with *level increase*)\r<br />-Merman (Seen in most of Castlevania games, a red fish like being)\r<br />-Fishman (Seen in most of Castlevania games, a blue fish like being)\r<br />-Lizard Man (Seen in LoI, CoD, an armored lizard)\r<br />-Phantom Warrior (Seen in CoD, a ghostly warrior with a laser beam)\r<br />-Phantom Knight (Seen in CoD, a ghostly warrior much harder than the Phantom Warrior)\r<br />-Dead Fencer (Seen in CoD, a ghostly fencer with a rapier)\r<br />-Dead Baron (Seen in CoD, a ghostly baron with a rapier and teleporting powers)\r<br />-Flea Man (Seen in most of Castlevania games, a short man, easy to kill but very fast)\r<br />-Efreet (Seen in LoI and CoD, a flaming demon)\r<br />-Wizard (Seen in CoD and LoI, a mage with fair abilities, with *level increase*)\r<br />Wyvern&#39;s Guardian (Not seen in these games but Wyvern should have guardians)\r<br />-Zombie (walking corpses, seen in many Castlevania games, with a spitting ability and *level increase*)\r<br />-Vampires (Not seen in these games but are known followers of Dracula)\r<br />-Undead Headsman (A new style of the Executioner, not seen in these games)\r<br />\r<br />===================================\r<br />Bosses:\r<br />===================================\r<br />-Crazy Armor (The first boss  in Abandoned Castle, seen in CoD)\r<br />-Lycanthrope (Not seen in these games)\r<br />-Wyvern (Seen in CoD, the second boss battle in Baljhet Mountains)\r<br />-Nuculais (Seen in CoD, the secret boss in Garibaldi Temple)\r<br />-Shaft (Seen in SotN, the dark priest who wanted to make Richter lord of Dracula&#39;s Castle)\r<br />\r<br />===================================\r<br />Minimun Level:\r<br />===================================\r<br />It&#39;s recommended to be in 20 and up level when you start the mod. You may gain levels during the game but this is best to be played with ease.\r<br />\r<br />===================================\r<br />Warnings About the mod\r<br />===================================\r<br />-First of all, due to it&#39;s large file size, it&#39;s best used if you have first deactivated any large mods you have, including quests, large dungeons or very high quality armors. Also, try to download it manualy if the manager is crashing. I have included in the readme how to install it that way.\r<br />\r<br />-Check your load order so that Skyrim is on top, Update follows and then anything else. The CastlevaniaMemoriesFirstEpisode.esm should be loaded before the CastlevaniaData.esp so that the enemies and places are shown correctly.\r<br />\r<br />-If you want to save, don&#39;t overwrite your existing save, just make a new so that you keep your character clear.\r<br />\r<br />-Note that Skyrim&#39;s battle music is conflicting with Castlevania&#39;s music and they play together. If something like that happens, you could lower the game&#39;s music bar(to hear Castlevania music) or the effects bar(to hear Skyrim&#39;s music) from your audio options inside the game.\r<br />\r<br />-Don&#39;t go near Richter when you are in the final boss battle because you might stuck inside the invisible wall and not be able to fight or move. Even if that happens, let Alucard to kill the boss.\r<br />\r<br />-If you find the enemies too easy, just increase the difficulty and load again. They should be much harder. On the other hand, if you find them hard, try to make the combines as they may be helpful.\r<br />\r<br />-You must not have installed and active any other Castlevania versions, testing, demo or anything else for this mod to play properly. Delete the other versions and their bsa if any to properly play this one. Also, you MUST have in your game folder the CastlevaniaMemoriesFirstEpisode.esm, CastlevaniaData.esp, CastlevaniaData.bsa, CastlevaniaData.bsl and the videos folder.\r<br />===================================\r<br />Credits:\r<br />===================================\r<br />\r<br />Bethesda Game Studios\r<br />Adobe\r<br />Niftools\r<br />Autodesk\r<br />\r<br />===================================\r<br />Special Thanks:\r<br />===================================\r<br />\r<br />Michiru Yamane for giving me permission to use original soundtracks from the Castlevania games for PS2 and PSOne.\r<br />\r<br />To the actors:\r<br />-Stephen C. as St. Germain & Shaft\r<br />-Torzelan as Alucard\r<br />-Vereta as Dragonborn & Richter (Note that it&#39;s Vereta as well in game but I can&#39;t change that now. I made a misspell here.)\r<br />-SnakeDeShazer as Hector&#39;s Voice\r<br />\r<br />To Fire3lf for recording an about three hours livestream gameplay of the episode and making an awesome spotlight.\r<br />\r<br />To JohnnySQS for recording a nearly full walkthrough of the gameplay in four 30-40 min parts.\r<br />\r<br />==========Good Gaming=================",
  "categoryId": "35",
  "version": "1.0",
  "author": "LordKarnak",
  "createdUnix": "1346471909",
  "updatedUnix": "1347836006",
  "containsAdultContent": false,
  "uploadedBy": "LordKarnak",
  "primaryFile": null,
  "files": [
    {
      "fileId": "85934",
      "name": "Castlevania First Episode",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "626103",
      "fileName": "Castlevania First Episode-23428-1-0.zip",
      "uploadedUnix": "1346585537",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castlevania%20First%20Episode-23428-1-0.zip?fid=85934&ttl=1535793684&ri=8192&rs=8192&setec=0d237eccc42471c7cd6bb125cae6a5f9"
    },
    {
      "fileId": "88909",
      "name": "Castlevania Boss Rush Mode",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "55015",
      "fileName": "Castlevania Boss Rush Mode-23428-1-1.zip",
      "uploadedUnix": "1347836006",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/275e6889bae6ece77571a4270739081de2116bb950ea5c511e5e12a6787c2c6d/analysis/1407170284/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castlevania%20Boss%20Rush%20Mode-23428-1-1.zip?fid=88909&ttl=1535793684&ri=8192&rs=8192&setec=bd20d96299ac2b73c53c7e0781dc49dc"
    }
  ]
}