{
  "modId": 23439.0,
  "modName": "Dawnguard and Vampire Lord Hybrid Lord Race",
  "summary": "Werewolf and Vampire Lord. Requires Dawnguard!!",
  "descriptionHtml": "Werewolf and Vampire Lord. Requires Dawnguard!! Become both using one race. Hybrid Lord. Gives both powers! Also adds a hideout close to whiterun!There is actually two perks I added but I have no idea how to add them to the perk tree, perhaps someone can help me? Just comment. When you become one you still have the other form. But I still have not tested it on the quest when you get those powers like Lord Harkon\\'s Gift or Companions werewolf turning quest.\r\n\r\nQ: Do I get a perk for either vamp lord or werewolf.\r\nA: Yes, I actually made one for each that allows you to turn into the other but I do not know how to add it to the perk tree.\r\n\r\nQ: Can I recieve extra magic effects like beast blood that makes resistant to disease?\r\nA:No, hopefully I will add that in the future.\r\n\r\nQ: Do I still get attacked by Lord Harkon when I become werewolf in his place or the other way around for companions?\r\nA: I don\\'t know, still haven\\'t tested that yet. Hopefully that\\'s because of faction system.\r\nMaybe I will add a new faction and class. Can anyone help me? Comment.\r\n\r\nVersion 2\r\nThis time in the hideout. Right side of cage 2 there\\'s a gate. It brings you to Blackreach. There you will find hybrid guards. Three types. One human form. Second vampire lord form. And third wolf form. Also there are two dragons. I used the skin of the dragon which could dive under water. WARNING!!! I have no idea if there are bugs. If u spawn werewolves the guards won\\'t fight due to faction system. Other than VL\\'s and werewolves, I think they\\'ll fight other creatures.\r\n\r\nFeature Plans.\r\nI was hoping someone would help me make a quest for this mod. I do not require an advanced quest. Simple ones work out too. I will try make a model featuring werewolf with wings. Like the one in adventure quest. The character WOLFWING. I know that\\'s something that gamers will crave for. Also I want to ask something. What\\'s the class system in CK for? I was hoping on creating a new one called \\\"Hybrid Lord\\\".\r\n\r\nIMPORTANTLY\r\nIf anyone has any questions or problems please comment. I feel that more comments and ideas will help expand this mod further. Of course if anyone wants it far, I will need a team.",
  "categoryId": "34",
  "version": "2.00",
  "author": "Ajwad",
  "createdUnix": "1346486803",
  "updatedUnix": "1348332557",
  "containsAdultContent": false,
  "uploadedBy": "bugmenotvers2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "85687",
      "name": "Version 1",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "57",
      "fileName": "Version 1-23439-1-00.rar",
      "uploadedUnix": "1346486841",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/f6c741872373a0bdfeab1232a15b3d0a4905b1f7435390e4c600cbccef15bb09/analysis/1407137358/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%201-23439-1-00.rar?fid=85687&ttl=1535793694&ri=8192&rs=8192&setec=e5ebc139098416b9e7b794dfaf6601bb"
    },
    {
      "fileId": "89875",
      "name": "Version 2",
      "version": "2.50",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "61",
      "fileName": "Version 2-23439-2-50.rar",
      "uploadedUnix": "1348332557",
      "modVersion": "2.50",
      "virusScanUrl": "https://www.virustotal.com/file/9a9500123a694951693f29b0804285defb51db3eaca665dea5eb731c1e0a1ca7/analysis/1407181623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%202-23439-2-50.rar?fid=89875&ttl=1535793694&ri=8192&rs=8192&setec=0168061660b6bf37cd1a5fdc9b718b69"
    }
  ]
}