{
  "modId": 23440.0,
  "modName": "Dwarven Automaton Resistances Revised",
  "summary": "Changes the resistances of all vanilla Dwarven Automatons to 100% Resistance to Fire, 25% Resistance to Shock, and 50% weakness to Ice to better fit with the in game book \\\"Ruins of Kemel-Ze\\\". ",
  "descriptionHtml": "\\\"The room blazed with sudden light. Bolts of purple energy crackled across the metal carapace of the Dwarven monster, and it halted, half-turning to meet this new threat. Master Arum had come! I was about to raise a cheer when the giant figure turned back to me, unharmed by the lightning bolt hurled by Master Arum, determined to destroy this first intruder. I shouted out \\\"Steam! Steam!\\\" as the giant raised his fist to crush me into the floor. There was a hiss and a gust of bitter cold and I looked up. The monster was now covered with a shell of ice, frozen in the very moment of dispatching me. Master Arum had understood. I leaned against the wall with relief.\r\n\r\nThe ice cracked above me. The giant golden king stood before me, the shell of ice falling away, his head swiveling towards me in triumph. Was there no stopping this Dwarven monstrosity?! But then the light faded from his eyes, and his arms dropped to his sides. The magical frost had worked, cooling its steam-driven energy.\\\"\r\n\r\n-Ruins of Kemel-Ze by Rolard Nordssen (An archaeologist\\'s adventure through ancient Dwemer ruins)\r\n\r\n\r\nDwarven Automaton Resistances Revised changes the resistances of all vanilla Dwarven Automatons. Fire and Poison resistances remain the same. I\\'ve changed their Shock resistance to 25% and their Ice resistance of 100% to a Weakness of 50%. \r\n\r\nThis not only gives you another option while fighting them but it also gets rid of an annoying inconsistency between an in game book and the actually enemy that you fight in game.\r\n\r\nNow added a Dawnguard and non-Dawnguard version of the file. I suspect that I didn\\'t need it in the first place but just to be sure I\\'ve kept it and simply made one for players without the DLC.\r\n\r\nIf there are any problems please let me know.\r\n",
  "categoryId": "24",
  "version": "1.0",
  "author": "Nordguard",
  "createdUnix": "1346486923",
  "updatedUnix": "1346524154",
  "containsAdultContent": false,
  "uploadedBy": "Nordguard",
  "primaryFile": null,
  "files": [
    {
      "fileId": "85688",
      "name": "DwarvenResistancesRevised",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "DwarvenResistancesRevised-23440-1-0.7z",
      "uploadedUnix": "1346487103",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/61880cf1565a8990536977ca4b7425766cc8b3dc531fb96020cc71c7988ed13c/analysis/1407137358/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DwarvenResistancesRevised-23440-1-0.7z?fid=85688&ttl=1535793695&ri=8192&rs=8192&setec=59877938258fb9aa112b8f7d902177f6"
    },
    {
      "fileId": "85785",
      "name": "DwarvenVannilaResistancesRevised",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "DwarvenVannilaResistancesRevised-23440-1-0.7z",
      "uploadedUnix": "1346524154",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cf6f3fdcdd1ebbcdc89cae453d48e607eb303013b8e2e0f233a4d4facfe7286a/analysis/1407138784/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DwarvenVannilaResistancesRevised-23440-1-0.7z?fid=85785&ttl=1535793696&ri=8192&rs=8192&setec=0c66e5aa95d4a71358636a9440b500e6"
    }
  ]
}