{
  "modId": 235.0,
  "modName": "Fuzzys Realism Mod",
  "summary": "FRM is a mod designed to add immersion and realism to the game plus adding a greater challenge. ",
  "descriptionHtml": "FRM is a realism mod designed to make the game more immerse, challenging, and more realistic.\r\n\r\nFRM is currently a work in progress, at first I will only have simple interface mods until the mod kit is released. Be patient, more is to come.\r\n\r\nBe sure to comment with any suggestions and things to add.\r\n\r\n\r\nFor those of you wanting stealth detection gone, check out this mod. \r\nhttp://www.skyrimnexus.com/downloads/file.php?id=279\r\n\r\n\r\nI might as well throw this up here.\r\n\r\nhttp://andrewjacksongaming.blogspot.com/2011/11/elder-scrolls-skyrim-review.html\r\n\r\nI wrote a review for Skyrim on my blog, go check it out if your interested.\r\n\r\n\r\nUPDATE:\r\n\r\nWith the Creation Kit coming out in January this leaves me pleanty of time to come up with ideas for the mod. So I have decided to make a list of modules that I will create as soon as possible when the Creation Kit is released.\r\n\r\nTougher Dragons Module- This will amp up the damage and health of all dragons to a challenging rate, possibly increased spawns.\r\n\r\nRealistic Combat Module- This will balance armor (you can wear leather and studded armors at high levels) while making it more realistic. You can no longer take 10 arrows to the face, magica is deadly, and pure mages can be destroyed by a sword.\r\n\r\nBetter Economy: This will make the merchants have more gold, so you won\\'t have to run all over the map to sell all your junk. As expected there will also be a less barter gold with a smaller restock rate, and even a world economy system. \r\n\r\nBetter Horses: Horses will no longer charge into battle and can sprint longer.\r\n\r\n\r\n\r\nKeep the suggestions coming!\r\n--------\r\n\r\nEach version of FRM will be split up into modules which modify various things about the game, such as interface, NPC behavior and such. \r\n\r\nEach module, unless specified, is completely optional. If there is a module that you don\\'t like feel free to remove it.\r\n\r\nKeep in mind that until the Creation Kit is released I can only do small modifications. 1.0 is mostly made up of small interface modifications.\r\n\r\nThe main focus of 1.0 is to be able to modify what ever you like about the interface. You can remove it entirely in the in-game menu, but chances are you will need the health/mana/stam HUD, you can just remove the compass, or say you like the quest markers, ect. \r\n\r\n\r\n1.0-\r\n\r\nNo Quest Tracking- Like your Morrowind? Then this is the modification for you. This allows you to remove the quest tracking system, forcing you to use your brain to figure out the objectives. (Currently in beta, but very useable. Specific instructions for finding undiscovered locations that the game doesn\\'t add to your map will be included). This only removes the quest pointers and modifies nothing about the quest system.\r\n\r\n\r\nNo Compass- Tired of the game holding your hand? Simply remove the compass and get out there and discover locations for yourself.\r\n\r\n\r\nNo HUD- This will completely remove the heads up display, forcing you to rely on instinct and your heartbeat (when your low on health that is).\r\n\r\nThis can also be modified by the in-game menu, but for references I included the old-fashioned way of removing the hud.\r\n\r\n\r\nNo fast travel- This will remove fast travel until you restart the game. Until the Creation Kit comes out this is the only way to remove it.\r\n\r\n\r\nModify Time Scale- This allows you to modify the timescale in the game from the standard 20 (one minute in real-life is twenty in the game).\\\\\r\n\r\n------------------------------------\r\n\r\nWhat\\'s to come- ( I will try to add as many features as I can with the limited tools. Many of the additions can only be made with the Creation Kit).\r\n\r\nNo Fast Travel\r\nNo Quest Tracking (complete)\r\nFaster walking/running/sprinting\r\nRunning takes stamina (Morrowind style)\r\nWeaker armor/more weapon damage\r\nRealistic timescale\r\nMore powerful spells (and hopefully more spells)\r\nReduced carrying capacity\r\nRemoved stealth detection eye from the crosshair.\r\nEnemies with higher stealth detection\r\nlonger, more deadly poison\r\nNo health regeneration \r\nNo console\r\n--------\r\n\r\nKeep the suggestions coming!\r\n\r\n\r\n\r\n",
  "categoryId": "24",
  "version": "1.0",
  "author": "Fuzzysecurity",
  "createdUnix": "1321346827",
  "updatedUnix": "1321422408",
  "containsAdultContent": false,
  "uploadedBy": "fuzzysecurity",
  "primaryFile": null,
  "files": [
    {
      "fileId": "613",
      "name": "FRM Interface Module",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "FRM Interface Module-235-1-0.zip",
      "uploadedUnix": "1321415437",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/08e01579b3cbe43e3e590aea35b424fc9bfed75ed4975d51ce5d31dbf189b9fe/analysis/1406407802/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FRM%20Interface%20Module-235-1-0.zip?fid=613&ttl=1535752922&ri=8192&rs=8192&setec=5bfc66371c1fcc906506da9688afa3cf"
    },
    {
      "fileId": "640",
      "name": "FRM Timescale and Fast Travel Modules",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "FRM Timescale and Fast Travel Modules-235-1-0.zip",
      "uploadedUnix": "1321422408",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c5109110e4b03505af9ace85fb0940dd410287c221768bb94641c85aa7ea6c36/analysis/1406408045/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FRM%20Timescale%20and%20Fast%20Travel%20Modules-235-1-0.zip?fid=640&ttl=1535752922&ri=8192&rs=8192&setec=9ff7bfa1f21e255f2c4cf2c1e7c805aa"
    }
  ]
}