{
  "modId": 23528.0,
  "modName": "Children of the Night - Vampire Overhaul",
  "summary": "Adds a new type of vampire, \\\"Children of the Night\\\" have a plethora of new abilities with a blood based hunger system, but also a variety of challenges they will learn to overcome.",
  "descriptionHtml": "[center][size=200%][u]~Children of the Night~[/u][/size][/center]\r\n[center][size=200%][u]Vampire Overhaul[/u][/size][/center]\r\n\r\n[u]Summary:[/u]\r\nAdds a new type of vampire, \\\"Children of the Night\\\" have a plethora of new abilities with a blood based hunger system, but also a variety of challenges they will learn to overcome.\r\n\r\n[center]-&-[/center]\r\n\r\n[u]Changes:[/u]\r\n-Adds a new type of vampire, \\\"Children of the Night\\\" which the player can become by seeking out the Nighmare\\'s shrine.\r\n-Adds a dynamic alternate advancement system, wherein one can improve and unlock abilities in the four categories: Shadow, Transformation, Hypnosis and Blood magic.\r\n-Blood based hunger system, blood level is actively tracked with time-safe method that makes blood far more interesting.\r\n-Numerous challenges to those afflicted with vampirism, such as blood rage and near-blindness in day.\r\n-Modular transformation system allows the player to make their body the plaything of their mind.\r\n-Ability based system allows NPCs to become Children of the Night, alongside the player.\r\n-Fully functioning blood bottling system, store blood for later, but watch out for it spoiling, or draining too much and killing the donor.\r\n-Anemia system, blood in NPCs is in independent of health, meaning one can drain cattle to it\\'s death, without doing a single point of damage.  \r\n\r\n[u]Challenges[/u]\r\n-Persistant NPC blood levels; no more infinite cattle.\r\n-Sharpened night vision leaves player blind in day.\r\n-Blood based fatigue system; you run on blood now, not air.\r\n\r\n[u]Spells - Shadow[/u]\r\n[b]Shadow Step:[/b] Teleports the caster to another, as long as both are in show. Depletes a small ammount of blood based on distance.\r\n[b]Shadow Steal:[/b] Teleports another to the caster, as long as both are in shadow. Depletes a small ammount of blood based on distance.\r\n\r\n[u]Spells - Transformation[/u]\r\n[b]Mist Bolt:[/b] Transforms the caster into mist, then launches them in the direction of casting, to reform on collision. It has a medium initial blood cost, but requires none to sustain and can be used to travel vast distances quickly and cheaply.\r\n[b]Mist Form:[/b] Transforms the caster into a cloud of blood and shadow, allowing them flight and increased speed, at the cost of a medium amount of blood to transform, and a small amount to maintain.\r\n[b]Sharpen Senses:[/b] Toggle-able ability that allows detect life on all moving actors, useful for making do with day blindness.\r\n\r\n[u]Spells - Passive[/u]\r\n[b]Bottle Blood:[/b] Painlessly bottle blood from a donor, with adjustable amounts based on selection (a little, a lot, all) and the donor\\'s max health.\r\n[b]Introspection:[/b] Meditate on what you have learnt, config, debug and perk selection all in one meditative bundle.\r\n\r\n[center]-&-[/center]\r\n\r\n[u]Credits & Thanks[/u]\r\n[url=http://www.fimfiction.net/user/Stonershy]Stonershy[/url]",
  "categoryId": "24",
  "version": "0.1",
  "author": "Dreagar",
  "createdUnix": "1346604330",
  "updatedUnix": "1346604330",
  "containsAdultContent": false,
  "uploadedBy": "Dreagar",
  "primaryFile": null,
  "files": []
}