{
  "modId": 23547.0,
  "modName": "Improved Conjuration-Better Daedra and Dead Thralls",
  "summary": "A re-balance of all summons and reanimate spells. Fixes Potent Storm Thrall. Adds new spells for atronachs.",
  "descriptionHtml": "A re-balance of all summons and reanimate spells. Fixes Potent Storm Thrall. Adds new spells for atronachs. \r\n\r\nSummon Familiar now levels with the player from 1 all the way to 81. 822 Health at level 81.\r\n\r\nAll regular Atronachs level with the player to 1-30, Potent Atronachs to 1-40, Thralls to 1-50, and Potent Thralls to 1-81. All spells have been readjusted to do the same damage and cost the same magicka as the player versions of them. Removed magicka regeneration from the Basic Flame/Storm Atronachs and Potent Version. Thralls and Potent Thralls retain magicka regeneration but only during non-combat. Reasoning is that all atronach magicka regeneration is too high. This forces them to be a soul-less cannon of their strongest spell. As they get low on magicka they are forced to use maybe a cheaper spell or start doing some melee (which they are very well capable of).\r\n\r\nFlame Atronachs (Including Potents) now use Flames and Firebolt spells. Thralls and Potent Thralls now use Fireball and Incinerate spells. (Potents have Augmented Flames rank 2 for +50% fire damage).\r\n\r\nFrost Atronachs received additional Health boosts for more tankablity. Basic Frost Atronachs have 500HP at 30, Potents have 750HP at 40, Thralls have 900HP at 50, and Potent Thralls have 1350HP at 81. \r\n\r\nStorm Atronachs (Including Potents) now use Sparks and Lightning Bolt spells. Thralls and Potent Thralls now use Chain Lightning and Thunderbolt spells. (Potents have Augmented Shock rank 2 for +50% shock damage). And yes once again if you missed it at the top, you now have a Potent Storm Thrall that was broken in vanilla.\r\n\r\nDremora Lords before were only level 46 bad asses. Now they are leveled 1-50 bad asses.\r\n\r\nAll Reanimate spells last 2 minutes now instead of 1 minute. Now you raise a dead body and have enough time to get it to the next fight before it turns to an ash pile.\r\n\r\nRaise Zombie on dead bodies up to level 10.\r\nReanimate Corpse on dead bodies up to level 20.\r\nRevenant on dead bodies up to level 30.\r\nDread Zombie on dead bodies up to level 40.\r\nDead Thrall on dead bodies up to level 81. Also removed the human only restrictions. Basically if it was a type of dead body that was acceptable with weaker versions, then it is acceptable now.\r\n\r\nA special note: This mod was made complete from scratch. I\\'ve seen another mod out there similar to this by user Grasscid, but I wanted to do my own take on this.",
  "categoryId": "75",
  "version": "1.0",
  "author": "DaBritt87",
  "createdUnix": "1346622820",
  "updatedUnix": "1346624319",
  "containsAdultContent": false,
  "uploadedBy": "damonbritt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86073",
      "name": "Improved Conjuration-Better Daedra-Dead Thralls",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Improved Conjuration-Better Daedra-Dead Thralls-23547-1-0.rar",
      "uploadedUnix": "1346624319",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/33d89847e0f65df127a2c098000daac927f91b017c6608a4fd2c53798f2558f6/analysis/1407141857/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Conjuration-Better%20Daedra-Dead%20Thralls-23547-1-0.rar?fid=86073&ttl=1535793869&ri=8192&rs=8192&setec=28720f4b2e01e5dcacb5822477a4a441"
    }
  ]
}