{
  "modId": 23545.0,
  "modName": "Markarth Poison Shop",
  "summary": "This mod adds a small/medium playerhome in Markarth disguised as a poison shop, designed for the alchemist/sneak character.",
  "descriptionHtml": "The Bee\\'s Sting, a new shop just inside the gate of Markarth, has opened its doors. Your employee, Seena, keeps the shop for you while you slave away in your study, hidden away in some Dwarven ruins beneath the ancient city of Markarth. Your studies have proven well, because your business thrives selling poisons to those who know how to use them. Combining the technology of the ancient Dwemer and your own intellect, you have created a better system for combining ingredients, as well as learned how to provide an environment to sustain life from all over Skyrim. As Dovahkiin, You also take to collecting things from your travels. The sacred dragon masks recovered from the fallen Dragon Priests are your prized possessions, and display them proudly - ...to those you allow inside. This is your home.\r\n\r\n\r\nThis mod includes unique features such as:\r\n- NPC to keep up the shop front\r\n- Hidden door hiding bedroom and study\r\n- Indoor Pool\r\n- 4 Mannequins\r\n- Plenty of weapon plaques and 2 dagger display cases\r\n- Lots of herbs growing indoors as well as tree saplings\r\n- Dwemer inspired Alchemist table\r\n- Small roof garden\r\n\r\n\r\nInstall Instructions\r\n--------\r\nAs with other mods, make a fresh save first just in case something doesn\\'t work smoothly.\r\nOtherwise, the mod should install using the mod manager just fine. Doesn\\'t require Dawnguard.\r\n\r\n\r\nI hope you enjoy this home as much as I do. I prefer smaller homes as opposed to the mansion with everything type homes, so I didn\\'t include smith/smelter/tanning/grinding equipment. Markarth has that equipment available and I feel like the game is better having used the city rather than getting all of your things done all in one place. However, I don\\'t currently play a mage character so did not include a enchanting table either. If I get some requests I\\'ll gladly put it in though, as well as try to include whatever else gets requested. Also, let me know if something doesn\\'t work right for you. This is my first mod I really used occlusion cubes and NavMesh in so I\\'m not 100% sure it will work as I want it to. \r\n\r\nThings I want to include soon as I learn how:\r\n\r\n- Make the NPC Seena actually a shopkeep. I followed guides exactly and for some reason she will not open her dialogue. If you can assist me just shoot me a message. For now she just stands at the counter and can give you gifts from time to time. \r\n      Sidenote: I suppose if I got her working as a merchant and left her inventory chest unlocked, you could craft potions and drop them into the chest as if you are truly running the shop and she\\'s merely a shopkeeper working for you. \r\n\r\n- Add more Dwarven inspired equipment like the alchemy station.\r\n\r\n- Make the Bookshelves usable\r\n\r\n- I\\'d love to make running water that turns on/off with a switch/valve but I cannot find any guides/info on how to do that. Again, I\\'m still new to the CK.\r\n\r\n------------------------------------------------------------------------------------\r\n\r\n\r\n\r\nAnyway, Thank you all for downloading and hope you enjoy!\r\n\r\n\r\n\r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "Silaent",
  "createdUnix": "1346619391",
  "updatedUnix": "1346619494",
  "containsAdultContent": false,
  "uploadedBy": "silaent",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86050",
      "name": "The Bees Sting - Markarth Playerhome",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "42",
      "fileName": "The Bees Sting - Markarth Playerhome-23545-1-0.7z",
      "uploadedUnix": "1346619494",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/38a29b1765c7955b7e08cd2a65a83109439f2e585bdfde725206aa657b5edb9f/analysis/1407141603/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Bees%20Sting%20-%20Markarth%20Playerhome-23545-1-0.7z?fid=86050&ttl=1535793866&ri=8192&rs=8192&setec=eec2334aeb5a6ae334c975d0063d037a"
    }
  ]
}