{
  "modId": 23555.0,
  "modName": "Ring Of Molag Bal - No Disease Vampire Lord",
  "summary": "Adds a ring that when equipped allows you to become a Vampire Lord without being a Vampire, as well as adding a new option to became one.",
  "descriptionHtml": "[youtube]DMFruvt2S6k[/youtube]\r\n\r\nDescription:\r\n----------------\r\n\r\nDo you want to be a Vampire Lord but the terrible wrath of society, the sun or even the simple dislike of all the trade offs?\r\nThis mod does one simple thing, it adds a ring that when equipped asks you a simple question do you wish to join the ranks of the legion of the dead? or just a simple (powerful) taste of what it is like to be one of the blood suckers? chose yes (only available to non werewolf\\'s), and you will become a vampire and have the power of the vampire lord permanently, chose no, and you will only have it as long as the ring is equipped!\r\n\r\n\r\nThis mod does allow you to be a true werewolf and vampire lord (and only vampire lord) at the same time, but don\\'t expect people\\'s reactions to change, to them you are a normal mortal, only when in vampire lord will they hate you!\r\n\r\nThe Way to Get it:\r\n-------------------------\r\n\r\nAfter the quest of Molag Bal, a certain weapon of great amplitude will be given to you, equip that weapon and the an option appears, to leave the weapon alone and use it as it is, or to find the ring, don\\'t worry, you can get the weapon back to normal, just equip it again, but you will lose the ring, I did this so that it does not feel like a complete free thing, after all it\\'s Molag Bal we are talking about ;)\r\n \r\nUpdating or getting the ring after doing the quest of Molag Bal:\r\n-----------------------------------------------------------------------------------------\r\n\r\n-Get rid of the mace you have (if upgrading it must be the \\\"true\\\" mace, the one with the enchantment.\r\n-Open Console\r\n-Wright the following without the quotation marks: \\\"player.additem 000233e3 1\\\"\r\n-Close console, and have fun!\r\n\r\nThe Easy way:\r\n-------------------\r\n\r\nI also added a ring that does not ask if you want to be a vampire and will not make checks to see if you are a vampire or werewolf, it will only add the Vampire Lord power and nothing else, it will be removed once you remove the ring, this version is for those that do not wish to be bothered with the message and what not or just want to have a bit of random fun without the Quest completed, to get it you will have to use the console, just type: \\\"player.additem xx005739 1\\\" were XX is the number of the load order, have fun!\r\n\r\n\r\nNOTES:\r\n----------\r\n\r\nObviously, DAWNGUARD IS REQUIRED.\r\nI made so that the ring does not occupy a slot on the player what that means is that it won\\'t be removed by transformations and will not be removed by most scripted quests to remove all inventory of the player, I did this not because I wish to equip other rings and so that you are not bothered after each vampire lord\\'s transformation.\r\n\r\nThis mod does not modify any quest or vampire perk ability or what not, it has changed only the Mace of Molag Bal-\r\n\r\nCompatibility:\r\n-------------------\r\n\r\nAs I have changed the Mace of Molag Bal, any mod that does change it (unless it\\'s texture change or mesh change ONLY!) it will be incompatible, so if using any mod that changes weapon stats just place this mod lower in the load order, so that the mace will give you the message!\r\n\r\nNOW FULLY COMPATIBLE WITH VAMPIRE GAMEPLAY RELATED MODS!\r\nThanks to MofoMojo!\r\n\r\nMy other mod:\r\n--------------------\r\n\r\nRing of Hircine - No Disease Werewolf AND Totem Selection -> http://skyrim.nexusmods.com/mods/9844",
  "categoryId": "24",
  "version": "1.3",
  "author": "Gutyiort",
  "createdUnix": "1346632530",
  "updatedUnix": "1346880369",
  "containsAdultContent": false,
  "uploadedBy": "Gutyiort",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86667",
      "name": "Ring Of Molag Bal",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Ring Of Molag Bal-23555-1-3.zip",
      "uploadedUnix": "1346880369",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/94d6e350bb6137bf93fc6d4bff44f07e1332c19a40211690f70a65baa435e90f/analysis/1407147903/",
      "changelogHtml": " Now Compatible with any vampire gameplay related mods <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ring%20Of%20Molag%20Bal-23555-1-3.zip?fid=86667&ttl=1535793878&ri=8192&rs=8192&setec=a1d46c7937b106c6fad1a1e48d13d951"
    }
  ]
}