{
  "modId": 23578.0,
  "modName": "Whiterun Merchantguild",
  "summary": "Adds a Merchantguild to Skyrim",
  "descriptionHtml": "READ THIS:\r\nI can´t upload this mod becaus it is a BAK. This Mod IS ONLY AVAIABLE ON STEAM WORKSHOP!!!!!!!\r\n\r\nTalk to reno to get information about the books how to get money!!!!!\r\nHe will tell you where you can find the books.\r\nThere are four books from chapter 1 to chapter 4\r\nI don´t know how to make that little quest right (the o.k buttom) there won´t be any quest markers!!!\r\nso you REALY have to FIND them.\r\ni´m going to place the books in a few dungeons. Only the first book is in the Merchanguild.\r\nTalk to Reno he will tell you how to find them.\r\nI´m working on these dungeons now i can take some time to fix them so at the moment there is only the first book\r\n\r\nThis mod adds a new Merchantguild to Whiterun, which is actually in porgress.\r\nUPDATE: Added a Mapmarker to the Merchantguild.\r\nUPDATE: Fixed some problems withe the door to the first etage.\r\nNEW CONTENT:\r\nAdds now the first etage to the guild, fixed some bugs and added new dialogs!!!!!\r\n\r\nIn the Merchantguild  you can find merchants, selling special staff for your caracter, i also added some guards. in the following days i try to make a little quest to start.\r\nTalk to the Guard near the Goldchest or to Reno to get some information. i´m going to make a few little quest in the next following days.\r\nThese Merchants sell speciall things just have a look xD\r\n\r\nNEW CONTENT: THE HISTORY OF THE MERCHANTGUILD!!!!!!!!!! Read the book placed in the Dwemershelf, to get more information about the History of the Merchantguild!!!!!!!!!!!!!!!!!!!!!\r\n\r\nPlease rate and leave a comment with the bugs you´ve found and what you would like to have in the Merchantguild\r\nIf you have a few ideas or if you want to help me just leave a comment or sent an e-mail to Philipp-Knittel@web.de\r\nThank you\r\n\r\nMy english isn´t that good and i´m sorry for my writing mistakes.\r\n\r\nDON`T FORGETT TO RATE IF YOU LIKE IT!!!!!!!!!!!",
  "categoryId": "25",
  "version": "",
  "author": "USMCISAON",
  "createdUnix": "1346671460",
  "updatedUnix": "1346671460",
  "containsAdultContent": false,
  "uploadedBy": "USMCISAON",
  "primaryFile": null,
  "files": []
}