{
  "modId": 23570.0,
  "modName": "Little Falinesti",
  "summary": "lore friendly...ish! had to work with what was given to me. the thought of making new objects for a town or village like this was scary... so i didnt. plus i dont know how lol! Work in progress. Treetop Bosmer City in Skyrim.",
  "descriptionHtml": "plz vote\\\\ comment\\\\ endorse will be updating as i go. still learning and will b posting multiple versions to show the progression of the mod till completion. i am planning on a full working city in the tree. so far have a complete set of merchants, crafting areas, 2 uniqe followers with thier own sets of perks and a player home.\r\n\r\nmod puts a tree top city(not finished) directly ontop of the eldergleam sanctuary. just follow the road south of windhelm. use the horn to get into the tree and the lever on the chain winch to get down.\r\n\r\n\\\"important\\\"- may cause huge fps drops for people running on ultra settings... low to high isn\\'t so bad because it limits the objects to load. in any case changing object distance fade down in your settings will help.\r\n \r\nrecomended mods: \\\"skyrim flora overhaul\\\" by vurt-  http://skyrim.nexusmods.com/mods/141  this mod includes a retexture for the whiterun temple tree that no other mod ive found does. tree is retextured so it actually has bark and better looking leaves.\r\n\r\nnot the greatest on lore but i know its not rite. and as far as how this town fits into the world at this point... all im asking is that you consider the sacred eldergleam the tree little falinesti is built in and that the eldergleam sanctuary holds the heart of the tree consisting of the large grouping of roots at the rear of the cave(kinda like in fallout 3! damn tree cultist! should have known not to drink that water...). which is where you go to gather sap during the save the gildergreen quest out of whiterun. at some point id like to make it so during the quest if you choose to take the sap from the eldergleam tree(little falinesti) it dies and is replaced with the dead gildergreen(same tree only dead) with the whiterun gildergreen returning to health. and the town stuck in a dying tree. i just dont know how... yet. lol... dont even know if there is a tutorial for that one lol. if anyone can come up with anything to add or just something better. once again not good with the lore... lol so just msg me with it. maybe end up makin a ingame book on little falinesti background or a journal or somethin at some point i donno...\r\n\r\nbeen developing a lore of sorts. little falinesti is the eldergleam, thought to be a blessing from kynarith. is one of the oldest living things in skyrim... and one of the very few great oaks ever seen outside the province of valenwood. ive also been hearing about a war where the altimer invaded valenwood. with many bosmer fleeing the province some hear rumour of a great oak standing in the still free(untill recently) province of skyrim. somethin like that... really id have to check timelines an such to make sure it can fit...\r\n \r\ni am still pretty new to this, i actually have to give credit on the horn teleport to http://www.youtube.com/user/MrPigrizzla its actually his script i had to remove a blank line and a bracket to make it work right...but whatev. and if there is anybody wandering by who actually does know what theyre doin and has any advice to give please do lol... also im still udecided on how to finish the city as a whole. i was thinking of trying to make it like a small hold with a yarl or something. but i was also considering with going for more of a self regulating comunity with a few worrior types to guard and changing the throne room type area i set up into a temple of kinarith. i am open to suggestions.\r\n\r\n\r\n\r\n\r\ngot the idea for the mod after reading this\r\n\r\n\r\n\\\"A Dance In Fire V.2\\\"\r\n\r\nIt was a complete loss. The Cathay-Raht had stolen or destroyed almost every item of value in the caravan in just a few minutes\\' time. Decumus Scotti\\'s wagonload of wood he had hoped to trade with the Bosmer had been set on fire and then toppled off the bluff. His clothing and contracts were tattered and ground into the mud of dirt mixed with spilt wine. All the pilgrims, merchants, and adventurers in the group moaned and wept as they gathered the remnants of their belongings by the rising sun of the dawn.\r\n \r\n“I best not tell anyone that I managed to hold onto my notes for my translation of the Mnoriad Pley Bar,” whispered the poet Gryf Mallon. “They\\'d probably turn on me.”\r\n \r\nScotti politely declined the opportunity of telling Mallon just how little value he himself placed on the man\\'s property. Instead, he counted the coins in his purse. Thirty-four gold pieces. Very little indeed for an entrepreneur beginning a new business.\r\n \r\n“Hoy!” came a cry from the wood. A small party of Bosmer emerged from the thicket, clad in leather mail and bearing arms. “Friend or foe?”\r\n \r\n“Neither,” growled the convoy head.\r\n \r\n“You must be the Cyrodiils,” laughed the leader of the group, a tall skeleton-thin youth with a sharp vulpine face. “We heard you were en route. Evidently, so did our enemies.”\r\n \r\n“I thought the war was over,” muttered one of the caravan\\'s now ruined merchants.\r\n \r\nThe Bosmer laughed again: “No act of war. Just a little border enterprise. You are going on to Falinesti?”\r\n \r\n“I\\'m not,” the convoy head shook his head. “As far as I\\'m concerned, my duty is done. No more horses, no more caravan. Just a fat profit loss to me.”\r\n \r\nThe men and women crowded around the man, protesting, threatening, begging, but he refused to step foot in Valenwood. If these were the new times of peace, he said, he\\'d rather come back for the next war.\r\n \r\nScotti tried a different route and approached the Bosmer. He spoke with an authoritative but friendly voice, the kind he used in negotiations with peevish carpenters: “I don\\'t suppose you\\'d consider escorting me to Falinesti. I\\'m a representative for an important Imperial agency, the Atrius Building Commission, here to help repair and alleviate some of the problems the war with the Khajiit brought to your province. Patriotism --”\r\n \r\n“Twenty gold pieces, and you must carry your own gear if you have any left,” replied the Bosmer.\r\n \r\nScotti reflected that negotiations with peevish carpenters rarely went his way either.\r\n \r\nSix eager people had enough gold on them for payment. Among those without funds was the poet, who appealed to Scotti for assistance.\r\n \r\n“I\\'m sorry, Gryf, I only have fourteen gold left over. Not even enough for a decent room when I get to Falinesti. I really would help you if I could,” said Scotti, persuading himself that it was true.\r\n \r\nThe band of six and their Bosmer escorts began the descent down a rocky path along the bluff. Within an hour\\'s time, they were deep in the jungles of Valenwood. A never-ending canopy of hues of browns and greens obscured the sky. A millennia\\'s worth of fallen leaves formed a deep, wormy sea of putrefaction beneath their feet. Several miles were crossed wading through the slime. For several more, they took a labyrinthian path across fallen branches and the low-hanging boughs of giant trees.\r\n \r\nAll the while, hour after hour, the inexhaustible Bosmer host moved so fast, the Cyrodiils struggled to keep from being left behind. A red-faced little merchant with short legs took a bad step on a rotten branch and nearly fell. His fellow provincials had to help him up. The Bosmer paused only a moment, their eyes continually darting to the shadows in the trees above before moving on at their usual expeditious pace.\r\n \r\n“What are they so nervous about?” wheezed the merchant irritably. “More Cathay-Raht?”\r\n \r\n“Don\\'t be ridiculous,” laughed the Bosmer unconvincingly. “Khajiiti this far into Valenwood? In times of peace? They\\'d never dare.”\r\n \r\nWhen the group passed high enough above the swamp that the smell was somewhat dissipated, Scotti felt a sudden pang of hunger. He was used to four meals a day in the Cyrodilic custom. Hours of nonstop exertion without food was not part of his regimen as a comfortably paid clerk. He pondered, feeling somewhat delirious, how long they had been trotting through the jungle. Twelve hours? Twenty? A week? Time was meaningless. Sunlight was only sporadic through the vegetative ceiling. Phosphorescent molds on the trees and in the muck below provided the only regular illumination.\r\n \r\n“Is it at all possible for us to rest and eat?” he hollered to his host up ahead.\r\n \r\n“We\\'re near to Falinesti,” came the echoing reply. “Lots of food there.”\r\n \r\nThe path continued upward for several hours more across a clot of fallen logs, rising up to the first and then the second boughs of the tree line. As they rounded a long corner, the travelers found themselves midway up a waterfall that fell a hundred feet or more. No one had the energy to complain as they began pulling up the stacks of rock, agonizing foot by foot. The Bosmer escorts disappeared into the mist, but Scotti kept climbing until there was no more rock left. He wiped the sweat and river water from his eyes.\r\n \r\nFalinesti spread across the horizon before him. Sprawling across both banks of the river stood the mighty graht-oak city, with groves and orchards of lesser trees crowding it like supplicants before their king. At a lesser scale, the tree that formed the moving city would have been extraordinary: gnarled and twisted with a gorgeous crown of gold and green, dripping with vines and shining with sap. At a mile tall and half as wide, it was the most magnificent thing Scotti had ever seen. If he had not been a starving man with the soul of a clerk, he would have sung.\r\n \r\n“There you are,” said the leader of the escorts. “Not too far a walk. You should be glad it\\'s wintertide. In summertide, the city\\'s on the far south end of the province.”\r\n \r\nScotti was lost as to how to proceed. The sight of the vertical metropolis where people moved about like ants disoriented all his sensibilities.\r\n \r\n“You wouldn\\'t know of an inn called,” he paused for a moment, and then pulled Jurus\\'s letter from his pocket. “Something like \\'Mother Paskos Tavern\\'?”\r\n \r\n“Mother Pascost?” the lead Bosmer laughed his familiar contemptuous laugh. “You won\\'t want to stay there? Visitors always prefer the Aysia Hall in the top boughs. It\\'s expensive, but very nice.”\r\n \r\n“I\\'m meeting someone at Mother Pascost\\'s Tavern.”\r\n \r\n“If you\\'ve made up your mind to go, take a lift to Havel Slump and ask for directions there. Just don\\'t get lost and fall asleep in the western cross.”\r\n \r\nThis apparently struck the youth\\'s friends as a very witty jest, and so it was with their laughter echoing behind him that Scotti crossed the writhing root system to the base of Falinesti. The ground was littered with leaves and refuse, and from moment to moment a glass or a bone would plummet from far above, so he walked with his neck crooked to have warning. An intricate network of platforms anchored to thick vines slipped up and down the slick trunk of the city with perfect grace, manned by operators with arms as thick as an ox\\'s belly. Scotti approaches the nearest fellow at one of the platforms, who was idly smoking from a glass pipe.\r\n \r\n“I was wondering if you might take me to Havel Slump.”\r\n \r\nThe mer nodded and within a few minutes time, Scotti was two hundred feet in the air at a crook between two mighty branches. Curled webs of moss stretched unevenly across the fork, forming a sharing roof for several dozen small buildings. There were only a few souls in the alley, but around the bend ahead, he could hear the sound of music and people. Scotti tipped the Falinesti Platform Ferryman a gold piece and asked for the location of Mother Pascost\\'s Tavern.\r\n \r\n“Straight ahead of you, sir, but you won\\'t find anyone there,” the Ferryman explained, pointing in the direction of the noise. “Morndas everyone in Havel Slump has revelry.”\r\n \r\nScotti walked carefully along the narrow street. Though the ground felt as solid as the marble avenues of the Imperial City, there were slick cracks in the bark that exposed fatal drops into the river. He took a moment to sit down, to rest and get used to the view from the heights. It was a beautiful day for certain, but it took Scotti only a few minutes of contemplation to rise up in alarm. A jolly little raft anchored down stream below him had distinctly moved several inches while he watched it. But it hadn\\'t moved at all. He had. Together with everything around him. It was no metaphor: the city of Falinesti walked. And, considering its size, it moved quickly.\r\n \r\nScotti rose to his feet and into a cloud of smoke that drifted out from around the bend. It was the most delicious roast he had ever smelled. The clerk forgot his fear and ran.\r\n \r\nThe “revelry” as the Ferryman had termed it took place on an enormous platform tied to the tree, wide enough to be a plaza in any other city. A fantastic assortment of the most amazing people Scotti had ever seen were jammed shoulder-to-shoulder together, many eating, many more drinking, and some dancing to a lutist and singer perched on an offshoot above the crowd. They were largely Bosmer, true natives clad in colorful leather and bones, with a close minority of orcs. Whirling through the throng, dancing and bellowing at one another were a hideous ape people. A few heads bobbing over the tops of the crowd belonged not, as Scotti first assumed, to very tall people, but to a family of centaurs.\r\n \r\n“Care for some mutton?” queried a wizened old mer who roasted an enormous beast on some red-hot rocks.\r\n \r\nScotti quickly paid him a gold piece and devoured the leg he was given. And then another gold piece and another leg. The fellow chuckled when Scotti began choking on a piece of gristle, and handed him a mug of a frothing white drink. He drank it and felt a quiver run through his body as if he were being tickled.\r\n \r\n“What is that?” Scotti asked.\r\n \r\n“Jagga. Fermented pig\\'s milk. I can let you have a flagon of it and a bit more mutton for another gold.”\r\n \r\nScotti agreed, paid, gobbled down the meat, and took the flagon with him as he slipped into the crowd. His co-worker Liodes Jurus, the man who had told him to come to Valenwood, was nowhere to be seen. When the flagon was a quarter empty, Scotti stopped looking for Jurus. When it was half empty, he was dancing with the group, oblivious to the broken planks and gaps in the fencework. At three quarters empty, he was trading jokes with a group of creatures whose language was completely alien to him. By the time the flagon was completely drained, he was asleep, snoring, while the revelry continued on all around his supine body.\r\n \r\nThe next morning, still asleep, Scotti had the sensation of someone kissing him. He made a face to return the favor, but a pain like fire spread through his chest and forced him to open his eyes. There was an insect the size of a large calf sitting on him, crushing him, its spiky legs holding him down while a central spiral-bladed vortex of a mouth tore through his shirt. He screamed and thrashed but the beast was too strong. It had found its meal and it was going to finish it.\r\n \r\nIt\\'s over, thought Scotti wildly, I should have never left home. I could have stayed in the City, and perhaps found work with Lord Vanech. I could have begun again as a junior clerk and worked my way back up.\r\n \r\nSuddenly the mouth released itself. The creature shivered once, expelled a burst of yellow bile, and died.\r\n \r\n“Got one!” cried a voice, not too distantly.\r\n \r\nFor a moment, Scotti lay still. His head throbbed and his chest burned. Out of the corner of his eye he saw movement. Another of the horrible monsters was scurried towards him. He scrambled, trying to push himself free, but before he could come out, there was a sound of a bow cracking and an arrow pierced the second insect.\r\n \r\n“Good shot!” cried another voice. “Get the first one again! I just saw it move a little!”\r\n \r\nThis time, Scotti felt the impact of the bolt hit the carcass. He cried out, but he could hear how muffled his voice was by the beetle\\'s body. Cautiously, he tried sliding a foot out and rolling under, but the movement apparently had the effect of convincing the archers that the creature still lived. A volley of arrows was launched forth. Now the beast was sufficiently perforated so pools of its blood, and likely the blood of its victims, began to seep out onto Scotti\\'s body.\r\n \r\nWhen Scotti was a lad, before he grew too sophisticated for such sports, he had often gone to the Imperial Arena for the competitions of war. He recalled a great veteran of the fights, when asked, telling him his secret, “Whenever I\\'m in doubt of what to do, and I have a shield, I stay behind it.”\r\n \r\nScotti followed that advice. After an hour, when he no longer heard arrows being fired, he threw aside the remains of the bug and leapt as quickly as he could to a stand. It was not a moment too soon. A gang of eight archers had their bows pointing his direction, ready to fire. When they saw him, they laughed.\r\n \r\n“Didn\\'t anyone ever tell you not to sleep in the western cross? How\\'re we going to exterminate all the hoarvors if you drunks keep feeding \\'em?”\r\n \r\nScotti shook his head and walked back along the platform, round the bend, to Havel Slump. He was bloodied and torn and tired and he had far too much fermented pig\\'s milk. All he wanted was a proper place to lie down. He stepped into Mother Pascost\\'s Tavern, a dank place, wet with sap, smelling of mildew.\r\n \r\n“My name is Decumus Scotti,” he said. “I was hoping you have someone named Jurus staying here.”\r\n \r\n“Decumus Scotti?” pondered the fleshy proprietress, Mother Pascost herself. “I\\'ve heard that name. Oh, you must be the fellow he left the note for. Let me go see if I can find it.”",
  "categoryId": "89",
  "version": "beta1.1",
  "author": "hair",
  "createdUnix": "1346660301",
  "updatedUnix": "1374870128",
  "containsAdultContent": false,
  "uploadedBy": "HairDiaper",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86147",
      "name": "Little Falinnesti o_1",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "119",
      "fileName": "Little Falinnesti-23570-1.zip",
      "uploadedUnix": "1346663837",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/229786c75deaf24b99bab7dc7c1e3f7e1bb4f4060f7d14a3ac0e4a0e7b0d78ce/analysis/1407142505/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Little%20Falinnesti-23570-1.zip?fid=86147&ttl=1535793907&ri=8192&rs=8192&setec=ce1aa7d2af9b9d7bab77d80c426045f3"
    },
    {
      "fileId": "86862",
      "name": "Little Falinesti 0_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "150",
      "fileName": "Little Falinesti-23570-1-2.zip",
      "uploadedUnix": "1346972823",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/67ef39d7503f4a557687da06a749bfc1a73c04820093a42ebcdc35a0feda2879/analysis/1407149943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Little%20Falinesti-23570-1-2.zip?fid=86862&ttl=1535793908&ri=8192&rs=8192&setec=7eca2851cb79211c077505b7eaab5e8a"
    },
    {
      "fileId": "87624",
      "name": "Little Falinesti 0_3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "0",
      "fileName": "Little Falinesti-23570-1-3.zip",
      "uploadedUnix": "1347274525",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855/analysis/1407157926/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Little%20Falinesti-23570-1-3.zip?fid=87624&ttl=1535793908&ri=8192&rs=8192&setec=71c6525549414918ba679701e5694ed2"
    },
    {
      "fileId": "88805",
      "name": "Little Falinesti 0_4",
      "version": ".4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1221",
      "fileName": "Little Falinesti-23570--4.zip",
      "uploadedUnix": "1347792461",
      "modVersion": ".4",
      "virusScanUrl": "https://www.virustotal.com/file/8d6b5cae1a5e7bf281478aa618269f9cec4f03296d1c888b4eb981969f32d255/analysis/1407169028/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Little%20Falinesti-23570--4.zip?fid=88805&ttl=1535793909&ri=8192&rs=8192&setec=678a740f6ef30b7c199a42788124c932"
    },
    {
      "fileId": "90508",
      "name": "Little Falinesti0_5",
      "version": "0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1269",
      "fileName": "Little Falinesti0_5-23570-0-5.zip",
      "uploadedUnix": "1348649910",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/b2049066e861dba1414521c93d86abe8db6044b5f0b5c15fea3d445c169472e7/analysis/1407187684/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Little%20Falinesti0_5-23570-0-5.zip?fid=90508&ttl=1535793909&ri=8192&rs=8192&setec=ebdf3ed3a46b5fa207646ce64ce550bc"
    },
    {
      "fileId": "92864",
      "name": "Little Falinesti 0_6",
      "version": "0.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1688",
      "fileName": "Little Falinesti 0_6-23570-0-6.zip",
      "uploadedUnix": "1349745503",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/f8c1e31d6e3d8a4e28618a5d549fee71ca51fb18c0d0dad03477eacff4e7b2cd/analysis/1407210907/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Little%20Falinesti%200_6-23570-0-6.zip?fid=92864&ttl=1535793910&ri=8192&rs=8192&setec=2bf4da36cb36332835ade6e80511006c"
    },
    {
      "fileId": "94416",
      "name": "Little Falinesti 0_7",
      "version": "0.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1724",
      "fileName": "Little Falinesti 0_7-23570-0-7.zip",
      "uploadedUnix": "1350558674",
      "modVersion": "0.7",
      "virusScanUrl": "https://www.virustotal.com/file/3bc77d2ef59f02a202a50dbfdf11ce633a3209b94cb58287b249de52492713f6/analysis/1407227530/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Little%20Falinesti%200_7-23570-0-7.zip?fid=94416&ttl=1535793910&ri=8192&rs=8192&setec=989bb344221426afcd153a6703403335"
    },
    {
      "fileId": "97519",
      "name": "Little Falinesti Ver_0_8",
      "version": "0.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1765",
      "fileName": "Little Falinesti Ver_0_8-23570-0-8.zip",
      "uploadedUnix": "1352060011",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/f24099b08508cfe003822c766aba832b7bdabe7cedb0746c5c380fbc679dc01a/analysis/1407249557/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Little%20Falinesti%20Ver_0_8-23570-0-8.zip?fid=97519&ttl=1535793911&ri=8192&rs=8192&setec=65ea88189c252fc82f920b2c095d25cf"
    },
    {
      "fileId": "103140",
      "name": "Little Falinesti 0_9",
      "version": "0.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1747",
      "fileName": "Little Falinesti 0_9-23570-0-9.zip",
      "uploadedUnix": "1354623716",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/304d307fc61c280c8e10ef268fc502313c6905078eb0ce3e3655538fc72c170e/analysis/1407291067/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Little%20Falinesti%200_9-23570-0-9.zip?fid=103140&ttl=1535793912&ri=8192&rs=8192&setec=a6cbda28aadc6275877614407169671e"
    },
    {
      "fileId": "1000034470",
      "name": "Little Falinesti v1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1787",
      "fileName": "Little Falinesti v1_0-23570-1-0.zip",
      "uploadedUnix": "1371382820",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/29971406c08ee968626be7580944c5207668a25ee039e697280969c25fc81ce5/analysis/1407605908/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Little%20Falinesti%20v1_0-23570-1-0.zip?fid=1000034470&ttl=1535793912&ri=8192&rs=8192&setec=3ec2e396db54bbeeee32f620859c20e7"
    },
    {
      "fileId": "1000041020",
      "name": "Little Falinesti 1_1",
      "version": "beta1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1816",
      "fileName": "Little Falinesti 1_1-23570-beta1-1.zip",
      "uploadedUnix": "1374870128",
      "modVersion": "beta1.1",
      "virusScanUrl": "https://www.virustotal.com/file/3c6c592afa39248c3414969de7e83b663c479063f22398d6929a2211055ef917/analysis/1407656643/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Little%20Falinesti%201_1-23570-beta1-1.zip?fid=1000041020&ttl=1535793913&ri=8192&rs=8192&setec=495e977e134d8d38c4bbadc76711105b"
    }
  ]
}