{
  "modId": 23584.0,
  "modName": "Seats Of Power - Windhelm",
  "summary": "An immersive and lore friendly overhaul of the \\\"Palace of the Kings\\\" in Windhelm.",
  "descriptionHtml": "[center][IMG]http://i.imgur.com/Enanh.png[/IMG]\r\n[IMG]http://i.imgur.com/deBjG.png[/IMG]\r\n\r\nAn immersive overhaul of the Palace of the Kings in Windhelm\r\nFirst release of the \\'Seats of Power\\' Series\r\n\r\n[b]Please endorse if you enjoy this file! Thanks![/b]\r\n\r\n[IMG]http://i.imgur.com/wNQk3.png[/IMG][/center]\r\nThese are the main goals of the \\\"Seats of Power\\\"-Series for Skyrim:\r\n\r\n[list][*][b]Immersive and lore friendly overhaul![/b] Expansion and reneweal of each of the Holds Jarl residences by rearranging already existing assets as well as adding new features to the castles and long houses. New features are chosen to reflect the stlye of the hold and the region.[/list]\r\n[list][*][b]No hide and seek![/b]Every room and every important asset (throne, war room, etc.) should roughly stay in their original places, so no one has to crawl the castles searching for the jarl.[/list]\r\n[list][*][b]Matching exteriors and interiors![/b]Some vanilla interior cells have a complete different shape compared to the exteriors they\\'re supposed to represent. I\\'ll change this! Every SOP interior will now match its exterior.[/list]\r\n[list][*][b]No overdoing or changes for the change\\'s sake![/b] No changes to already great designs and arrangements, when there is no need to do it. Of course this is highly subjective and based on the authors opinion whether something is already good or needs a revamp.[/list]\r\n[list][*][b]Maximum compatibility![/b] Aside from some small exeptions, I won\\'t touch any quest markers, dialogues, NPC routines, exterior cells or other assets that could interfere with other mods. The changes to the castles and long houses will be purely cosmetic and will not break or expand any quests. Of course there is a high chance that every other mod that touches the interior cells of the castles will cause issues. (More in the \\\"Troubleshooting & Compatibility\\\" section!)[/list]\r\n\r\n[center][IMG]http://i.imgur.com/vODN6.png[/IMG][/center]\r\nasdfsdf\r\n\r\n[center][IMG]http://i.imgur.com/0ETVP.png[/IMG][/center]\r\n[b]v0.8[/b] Initial beta release\r\n- Expanded great hall! Entrance hall, council hall and fireplace added!\r\n- \\'Palace of the kings upstairs\\' renamed to \\'Palace of the kings Jarls quarters\\' \r\n- \\'Jarls quarters\\' rearranged and expanded!\r\n- \\'Windhelm barracks\\' renamed to \\'Palace of the kings East wing\\'\r\n- \\'East wing\\' rearranged. Prison and Barracks are separated. Officers quarters added!\r\n- \\'Palace of the kings upstairs (2)\\' renamed to \\'Palace of the kings West wing\\'\r\n- \\'West wing\\' rearranged. Greatly expanded wizards room!\r\n- Adjusted Lighting in all cells\r\n\r\n[center][IMG]http://i.imgur.com/bc4aO.png[/IMG][/center]\r\n[b]Problem:[/b] The interior cells behave strange or the clutter has been blown all over the tables.\r\n[b]Solution:[/b] The cells haven\\'t reset properly! Try leaving the palace and wait three days inside Candleheart hall before reentering the palace.\r\n\r\n[center][IMG]http://i.imgur.com/4VP7h.png[/IMG][/center]\r\nThanks to Bethesda Softworks for creating Skyrim and the Creation kit.\r\n",
  "categoryId": "90",
  "version": "0.8",
  "author": "YourSidekick",
  "createdUnix": "1346675987",
  "updatedUnix": "1346675987",
  "containsAdultContent": false,
  "uploadedBy": "YourSidekick",
  "primaryFile": null,
  "files": []
}