{
  "modId": 23599.0,
  "modName": "Improved Merryfair Bridge",
  "summary": "An update to KhaoMaat\\'s Merryfair Bridge, which adds a bridge west of Merryfair Farm near Riften to complete the road on the north side of Lake Honrich.",
  "descriptionHtml": "I like the Riften area, but the roads there leave a lot to be desired.  When KhaoMaat created Merryfair Bridge (http://skyrim.nexusmods.com/mods/9191), I was an early adopter and it has been in my game since then.\r\n\r\nHowever, the original Merryfair Bridge was from a time, and CK, before the Nav Mesh Bug was fixed and, like with many mods from that time, my NPC followers had problems.\r\n\r\nThis mod has an entirely new nav mesh.  For the most part, everything else is the same except for some rocks that are no longer there and a new nirnroot next to the bridge.\r\n\r\nInstall: This replaces the Merryfair Bridge mod.  Uninstall all prior versions of that mod before installing this one.  I recommend a clean save if uninstalling the original Merryfair Bridge.\r\n\r\nUninstall: Simply uninstall the mod as normal.\r\n\r\n\r\nDescription from the original mod:\r\nThis mod alters the landscape near Merryfair Farm, just west of Riften Stables, by adding a bridge. This bridge connects the dirt road on the western side with a new trail leading off from the road at Merryfair Farm. Also added is a road sign at the new intersection.\r\n\r\nNow you can travel alongside the road on the northern shore of Lake Honrich with relative ease. Just keep your head low while passing Faldar\\'s Tooth. An additional leveled creature (easy) has also been placed near the bridge on the western side, identical to the one that already existed in the area.\r\n\r\n",
  "categoryId": "58",
  "version": "1.0",
  "author": "Lord Richter",
  "createdUnix": "1346698967",
  "updatedUnix": "1346699014",
  "containsAdultContent": false,
  "uploadedBy": "lordrichter",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86256",
      "name": "Improved Merryfair Bridge",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "359",
      "fileName": "Improved Merryfair Bridge-23599-1-0.zip",
      "uploadedUnix": "1346699014",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8d395177187f92b453a9ef2505690afa10ea3e9ae5ed7d61706dc0a38e4290e5/analysis/1407143718/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Merryfair%20Bridge-23599-1-0.zip?fid=86256&ttl=1535793957&ri=8192&rs=8192&setec=fd93ced6825d4362b3f1d34e35a9b2e4"
    }
  ]
}