{
  "modId": 23614.0,
  "modName": "No More Redshirts - Make NPCs Essential __ May 22nd update",
  "summary": "This is a console command that will make ALL NPCs non-quest dependent immortal. A second file undoes these changes instantly.",
  "descriptionHtml": "[b]Please leave comments and report issues with NPCs if you happen to notice something I missed.[/b]\r<br />\r<br />\r<br />*******************************************\r<br />**************************************************\r<br />*********************************************************\r<br />[i]New for May 21st 2015\r<br />\r<br />This is a critical update so be sure to download and follow update instructions BEFORE installing this new version.\r<br />Removed NPC Arivanya from the files because she was linked to a quest. Discovery of this is creditied to the user [url=http://www.nexusmods.com/skyrim/users/9296331]Avastgard[/url] \r<br />\r<br />-+-+-+-+-+\r<br />[/i][i]-+-+-+-+-+[/i]\r<br />[b]\r<br />IMPORTANT[/b]\r<br />[i]July 21, 2016\r<br />[/i]\r<br />It just occurred to me that running my bat during that last big civil war fight might cause \r<br />issues. I&#39;m going to suggest you turn on my bats before you start that \r<br />quest then go ahead and turn them back on again after that battle is \r<br />over. The reason for this is because I am not sure if some of my flagged\r<br /> NPCs are in that battle. If they were they would never get killed. Or \r<br />you might just wanna keep an eye out during that battle and turn the \r<br />thing off if you notice someone on the opposite side not dying. Or not? \r<br />That would work too I guess just avoid the aggro of the ones who can&#39;t \r<br />get killed :D\r<br />\r<br />But like I said, I am not even sure if any of my NPCs are in that fight. Feedback about this from you guys that are \r<br />actively playing Skyrim would be cool&#33;\r<br />\r<br />**************************************************\r<br />*******************************************\r<br />\r<br />\r<br />SHORT DESCRIPTION\r<br />\r<br />This mod is 2 bat files. 1 to make NPCs immortal and a send to reverse the changes. No load order, no compatibility issues, no fuss. Keep merchants, quest givers, and farmers alive no matter what.\r<br />\r<br />It also contains a second rar that has NPCs by region for you to make your own custom master list or remove NPCs/ followers from my own. I think (and hope) I did a good job explaining how to modify the master list of flagged NPCs.\r<br />\r<br />______________________________________________________\r<br />LONG DESCRIPTION\r<br />\r<br />Alright&#33; So you just installed Dawnguard along with some mods. Mods that make more dragons spawn or mods that dramatically increase wildlife or mods that spawn more hostile NPCs or mods that make your normal hostile NPCs much much tougher&#33;..or all of the above. YAY&#33; Skyrim&#39;s gonna be so rad now. Well good theory&#33; As soon as you walk outside the Sleeping Giant Inn a werewolf runs around town killing everyone. Fail. As you walk along the road to Whiterun a sabertooth kitty-cat kills the horse vendor and you turn around to see wolves slaughtering all the farmers before you can react. Fail. While inside the walls of Whiterun late at night a freaking master vampire spawns and kills a bunch of citizens and then three uber dragons spawn the very next day while everyone is at the market. Fail.\r<br />...................................................................................\r<br />\r<br />This mod - well its not really a mod. Its a simple bat file I spent a few days putting together. Its gonna make pretty much every NPC that is not scripted to die or COULD die in some quest related event essential. That means that those people in Riverwood, the farmers and stable hand, and folk in Whiterun I mentioned before just will NOT die. Now you can make your game as hard as you want without fear that those red-shirt NPCs will not see an untimely end&#33;\r<br />\r<br />I also included a second main bat that will UNDO ALL THE CHANGES. So lets say you are a smexy vampire. RAWR. And you wanna feed on that preacher guy that shouts all day in Whiterun. Well simply run the other bat first&#33; then feed, then run the essential bat. Dude&#39;s dead and you got your bloody burps in AND everyone else is set back to essential. Or lets say you play with everyone essential for a while and wanna go back to vanilla. Just run the other bat and you are 100% back to normal. Watch a dragon eat citizens or go on a killing spree.\r<br />\r<br />________________________________________________________\r<br />QUESTIONS AND ANSWERS\r<br />\r<br />\r<br />&gt;--Okay, I&#39;ll try it out...how do I do a bat and what is it?\r<br />Its technically called a batch file but some modders call them &#39;bats&#39; for short. Go here and look all the way at the bottom (under the console commands chart...another good resource). If the link does not take you to the console page then search &#34;Skyrim:Console&#34; in the site&#39;s search engine.\r<br />\r<br />http://www.uesp.net/wiki/Skyrim:Console\r<br />\r<br />\r<br />\r<br />\r<br />&gt;--What did you leave untouched?\r<br />Well pretty much every NPC that is supposed to die during a quest or COULD die during a quest.\r<br />\r<br />&gt;--So who did you mark essential?\r<br />TONS of people. All the dogs, all the orcs in their strongholds, the 2 special named mounts you can acquire, all potential husbands and brides, all merchants, all skill trainers, important NPCs that wander (one you had the opportunity to kill are still untouched), etc etc... If there are random quests that say &#34;kill such and such&#34; you might have to undo the changes so you can complete that quest but otherwise you should be good to go&#33; By that I mean running the 2nd bat that reverses changes till said person dies then run master file again...all through console commands while in game&#33; No fuss or reloads required.\r<br />\r<br />&gt;--Are followers essential?\r<br />Yes. I made ALL followers and hirelings essential. Well...I left Uthgerd the Unbroken untouched because she&#39;s broken. Seriously, nobody should use that follower.\r<br />\r<br />&gt;--Is this compatible for Dawnguard?\r<br />Well sure but I&#39;ve not worked on NPCs from that expansion yet. This took me quite a long time to do so I kinda don&#39;t wanna do that right now. Promise I will do it soonishly though &lt;3\r<br />\r<br />&gt;--Soonishly?\r<br />Aug 11 2013 update: ... ya totally not gonna do this anytime soon. One day I am sure I will. Like when I play the game again.\r<br />\r<br />&gt;--Why did you do this?\r<br />Because those examples I first listed are things I witnessed in my game. I love a challenge and the need to take multiple followers with me just to have a chance...just not at the cost of 60% of the population dying while I am at the other end of the cell. I tried a few other people&#39;s bats like this but they only made a very very few people essential. I don&#39;t like seeing townspeople dead or missing out on potential quests :(\r<br />\r<br />&gt;--How extensivly did you research NPCs to add them to the list?\r<br />Its spelled &#39;extensively.&#39; But anyways...I played Skyrim through about 30% in the past so most of the quests I&#39;ve not even experienced. I used wikis and key words searching plus glanced over quests. Things like Dark Brotherhood contracts and the whole poop-storm at Markarth I did not touch those NPCs I found attached to scripted deaths. If you encounter a quest that tries to kill one of my essential just use the nonessential bat so the character can die and run the essential bat once they are dead. I would ask you please report your finding in the comments thread so I can fix the issue asap. I spent a LOT of time researching so I am fairly confident 99% of them are fine. If not? well its super easy to fix on both our ends.\r<br />\r<br />&gt;--Why not release a normal mod instead of these bird files?\r<br />Erm...BAT files. Well other people have tried to. They missed NPCs or made some essential that should not have been so people had to disable their mod which can cause really bad consequences to adjust load orders with some mods...and I don&#39;t know how to animate a sock in mod tools like that. Safest and best bay is to simply take 3 seconds and run the bat file.\r<br />\r<br />&gt;--Do I have to run this bird file every time I load?\r<br />Dude... bat&#33; And no. Running this once will &#39;infect&#39; your save game with the changes. So if you roll back to a save before you ran the bat that would be unaffected..same is true if you un-do the changes to an existing game you had already &#39;infected&#39;: just like new&#33;\r<br />\r<br />&gt;--Will this bloat my save?\r<br />You really don&#39;t understand what that means...no. At the MOST it MIGHT cause an extra 10 bytes of ram to be used when you run the file (which takes less then 1/3 of a second). No extra information is added to your game. Just existing data is altered in your current game.\r<br />\r<br />&gt;--You&#39;re bat-thingie is crashing my game&#33;&#33;&#33;\r<br />Bats don&#39;t make you crash. MODS do. If you are experiencing crashing it is due to mod conflicts, load order issues, unstable INI changes, or faulty/ dated hardware and or software. Bats are your friend. Just call me Batgirl.\r<br />\r<br />&gt;--I turned off your bat and such and such NPC won&#39;t die&#33; I&#39;ve tried to kill them&#33;\r<br />0.o  Well then its not my doing. Skyrim does set a number of NPCs as essential and some are flagged as protected. Protected NPCs don&#39;t die by other hostile NPCs but the player can kill them. Sometimes certain NPCs are essential until certain quests or objectives are met too.\r<br />\r<br />&gt;--AN NPC got killed with your mod on&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;\r<br />Yesh, that can happen to NPCs that are linked to deaths are still able to be killed (if they are not set to essential or protected until the scripted death) which is not a cause for alarm. The developers put a LOT of smart people to work on this game. Sometimes when a person dies connected to a death occurs the game will notice that John Doe is dead and check to see if there is an actor that is sort of a back-up for the event. Don&#39;t worry, I excluded the secondary and tertiary (means 3rd) actors from my list when appropriate. If all actors are dead the game may do 1 of 3 things... 1) ignore the sequence I.E. quest stage and move on to the next quest stage 2) negate the quest chain completely I.E. loose the quest. Nothing I can do about this, but its really really rare. 3) apply a radiant quest NPC I.E. select someone at random. *This option is super super rare. The chances that all the NPCs linked to this encounter are dead with my mod on is a stupidly low number. But if this DOES happen then that NPC will loop through the death sequence over and over without dying (because s/he is immortal) so simply running my UNESSENTIAL bat should fix this. If it does not, roll back to last save before you were in the same cell as the victim (so the game didn&#39;t load the quest data), run my UNESSENTIAL bat, continue to point where such-and-such dies, wait a few seconds after he is dead, run my ESSENTIAL bat to turn things on again. I should really note the chance of that happening to anyone that uses my mod is around one in one billion (well in the upper upper hundred millions). So please don&#39;t let this deter you from trying my project out. This is the only possible &#39;bug&#39; my mod can have, and as you see its fixable.\r<br />\r<br />&gt;--Any final words for me?\r<br />Yep. I can&#39;t believe you actually read all this. Good on you.\r<br />\r<br />&gt;--Thanks&#33; I think I&#39;ll try this...but what&#39;s a redshirt?\r<br />LOL its a nerd term from Star Trek. It refers to a really low ranking officer that appears for 1 show (on away missions) with the sole purpose to be killed off. In my game NPCs might as well all wear redshirts without this bat.\r<br />\r<br />&gt;--Speaking about that, what mods do you run that makes thing so insanely hard?&#33;\r<br />...................................................................................................................\r<br />***Deadly Dragons: One thing about Skyrim in an unmodded playthough was I found dragons were just too easy after a while. This adds a separate spawn system with unique NEW tougher dragons for any level. Not happy with just one dragon? Turn on the option that spawns 1-4 on the special events. Dragon events can spawn while inside a town and such too if you want that.\r<br />http://skyrim.nexusmods.com/mods/3829\r<br />\r<br />***...Immersive Patrols: A few esps that add different NPCs that travel along on various routes. Some NPCs are friendly some are very very unfriendly.\r<br />http://skyrim.nexusmods.com/mods/12977\r<br />\r<br />***...SkyTEST - Realistic Animals and Predators: Makes animals live in packs. They hunt now so they go out looking for food and can wander into populated areas if hungry enough. Breeding,    hibernation, and all sorts of other advanced AI functions.\r<br />http://skyrim.nexusmods.com/mods/10175\r<br />\r<br />***...Sleeping - Fast Travel - Waiting - and Walking Dangers - Sands of Time: Adds a chance to get a random encounter randomly while wandering the lands or waiting and adds a chance to be ambushed when you sleep or fast travel. One of my fav mods actually. TONS of customization and tons of different encounter types.\r<br />http://skyrim.nexusmods.com/mods/12452\r<br />\r<br />***...Improved Fish: Adds lots more fish to the game but also adds more dangers to the waters.\r<br />http://skyrim.nexusmods.com/mods/14320\r<br />\r<br />***...ERSO - Erkeil Real Skyrim Overhaul : This used to be Challenging Skyrim but the author decided to make a total overhaul. Its broken down into many ESPs so you can pick and chosse which you like. I personally run ERSO 08 because Master difficulty just wasn&#39;t enough. #10 is cool for extra immersion too.\r<br />http://skyrim.nexusmods.com/mods/26217\r<br />\r<br />P.S. This list of mods was stuff I used years ago and may no longer be supported. I&#39;m sure there are equally hard mods that are current though :)\r<br />________________________________________________________\r<br />\r<br />Credits\r<br />\r<br />http://www.uesp.net/wiki/Main_Page   for the wiki I used for NPCs and quests\r<br />Bethesda for allowing Todd Howard and his crew to make Skyrim the way they wanted\r<br />The Nexus for being awesome\r<br />You&#33; ...for checking out my file",
  "categoryId": "33",
  "version": "1.9OMG",
  "author": "Drowchyld777",
  "createdUnix": "1346721005",
  "updatedUnix": "1432260062",
  "containsAdultContent": false,
  "uploadedBy": "Drowchyld777",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88090",
      "name": "Farm Animals",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Farm Animals-23614-1.rar",
      "uploadedUnix": "1347485606",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b20c8c9d78d91ab18cacf723bb01e8a37b120741a9a71506dec341af4a6299eb/analysis/1407162063/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Farm%20Animals-23614-1.rar?fid=88090&ttl=1535793998&ri=8192&rs=8192&setec=ae28e9bee91ec0cf8b057e39fbb1820e"
    },
    {
      "fileId": "103564",
      "name": "No More Redshirts 1_4",
      "version": "1.40MG",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "No_More_Redshirts-23614-1-40MG.rar",
      "uploadedUnix": "1354836690",
      "modVersion": "1.40MG",
      "virusScanUrl": "https://www.virustotal.com/file/8b4181de39de25e20b5436ed9e63e6f4ce3ebff261e8b0c2b95884dda171feb3/analysis/1407293576/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No_More_Redshirts-23614-1-40MG.rar?fid=103564&ttl=1535793999&ri=8192&rs=8192&setec=7777eb079271e8490ce62afb513b2624"
    },
    {
      "fileId": "1000006277",
      "name": "No More Redshirts 1_5",
      "version": "1.50mg",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "No More Redshirts-23614-1-50mg.rar",
      "uploadedUnix": "1359705799",
      "modVersion": "1.50mg",
      "virusScanUrl": "https://www.virustotal.com/file/ed2bed2e362666b1775ed04d855ab6f571d966758c71f705c8692abef9e1d3ff/analysis/1407390165/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20More%20Redshirts-23614-1-50mg.rar?fid=1000006277&ttl=1535793999&ri=8192&rs=8192&setec=41186169d8b70e6edced059a7cacdcb7"
    },
    {
      "fileId": "1000006896",
      "name": "UPGRADE Intructions",
      "version": "2.0mg",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Upgrade Intructions-23614-2-0mg.rar",
      "uploadedUnix": "1359932272",
      "modVersion": "2.0mg",
      "virusScanUrl": "https://www.virustotal.com/file/2e19a15d2a921fa9c303c5aaebe9e185f833b434978753ee6587417394655bec/analysis/1407395738/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Upgrade%20Intructions-23614-2-0mg.rar?fid=1000006896&ttl=1535794000&ri=8192&rs=8192&setec=3817719ff054c9d373820b3237d69668"
    },
    {
      "fileId": "1000030072",
      "name": "No More Redshirts 1_6",
      "version": "1.6Omg",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "MAIN FILE-23614-1-6OMG.rar",
      "uploadedUnix": "1368665642",
      "modVersion": "1.6Omg",
      "virusScanUrl": "https://www.virustotal.com/file/68da841887c2d66f3eb7a2eea2f9de289266123a4aa7711eae6541a449bf4274/analysis/1407570967/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MAIN%20FILE-23614-1-6OMG.rar?fid=1000030072&ttl=1535794000&ri=8192&rs=8192&setec=2754e34aa7c7f2d1aa92c98086efed66"
    },
    {
      "fileId": "1000046249",
      "name": "No More Redshirts 1_7",
      "version": "1.70mg",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "MAIN File-23614-1-70mg.rar",
      "uploadedUnix": "1376278136",
      "modVersion": "1.70mg",
      "virusScanUrl": "https://www.virustotal.com/file/2c451a3d70d0faad2b25d3aa3168e36ec2ebe92e33f9ae3ca4922facb8ef50c4/analysis/1407679249/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MAIN%20File-23614-1-70mg.rar?fid=1000046249&ttl=1535794001&ri=8192&rs=8192&setec=85599feeb0f2447610ec7e4f651746b6"
    },
    {
      "fileId": "1000069462",
      "name": "No More Redshirts 1_8",
      "version": "1.80mg",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "Main-23614-1-80mg.rar",
      "uploadedUnix": "1382492392",
      "modVersion": "1.80mg",
      "virusScanUrl": "https://www.virustotal.com/file/fa1b8461637a1097082ab4a47d7842c05508b20e8284d4e9342096c267e02be4/analysis/1407765559/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main-23614-1-80mg.rar?fid=1000069462&ttl=1535794001&ri=8192&rs=8192&setec=25e0d0d689987093d1add5f556eb11b1"
    },
    {
      "fileId": "1000121973",
      "name": "Guards",
      "version": "2.omg",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Guards-23614-2-omg.rar",
      "uploadedUnix": "1407994124",
      "modVersion": "2.omg",
      "virusScanUrl": "https://www.virustotal.com/file/cdcfe1bf0f5ad71c9ac654e3787dfb6a275e585c90af8f94c5ceeaaf3d66a5c2/analysis/1408178047/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Guards-23614-2-omg.rar?fid=1000121973&ttl=1535794002&ri=8192&rs=8192&setec=0a1db1f5785895049cc262f4e58d1b48"
    },
    {
      "fileId": "1000121974",
      "name": "How to Install &#39;No More Redshirts&#39; ",
      "version": "2.omg",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "How to Install 'No More Redshirts' -23614-2-omg.rar",
      "uploadedUnix": "1407994298",
      "modVersion": "2.omg",
      "virusScanUrl": "https://www.virustotal.com/file/84a7d8420445dec18ff82b74808eef133b0e73ba964deb4787883a2839542155/analysis/1407994368/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/How%20to%20Install%20%27No%20More%20Redshirts%27%20-23614-2-omg.rar?fid=1000121974&ttl=1535794002&ri=8192&rs=8192&setec=286d62c58c08f664c2cb2065615cff34"
    },
    {
      "fileId": "1000161042",
      "name": "No More Redshirts 1.9omg",
      "version": "1.9OMG",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31",
      "fileName": "No More Redshirts 1.9omg-23614-1-9OMG.rar",
      "uploadedUnix": "1432260062",
      "modVersion": "1.9OMG",
      "virusScanUrl": "https://www.virustotal.com/file/df026d289a783b9d6b331be417443785040f4e66a48bddf3869dda0e6329db2d/analysis/1432260122/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20More%20Redshirts%201.9omg-23614-1-9OMG.rar?fid=1000161042&ttl=1535794003&ri=8192&rs=8192&setec=002c4af3f86e635636fee37d248e7a60"
    }
  ]
}