{
  "modId": 23613.0,
  "modName": "Thalmor Judicium with aMidianBorn Elven Armor by CaBaL",
  "summary": "Adds a new level of Thalmor equipped with CaBaL\\'s dark Elven texture armor. ",
  "descriptionHtml": "Like many of you I really like CaBaL\\'s Elven armor but I had trouble choosing between the dark and the gold version so I came up with this mod to solve my problem in a lore friendly balanced way. \r\n\r\nThe mod adds  a stand alone armor with CaBaL\\'s dark Elven texture that can only be found on new high level Thalmor NPCs. The new level Thalmor NPCs will start to spawn with the armor at player level 40 and higher. I made the armor have slightly better stats than the Glass armor but still lower than Dragonscale armor. So now groups of Thalmor will be more challenging in game play and more rewarding in loot. As if we needed more reasons to kill them :P \r\n\r\n-The gold elven armor is still available in its original form I did not change it at all \r\n-Thalmor will still spawn with normal Elven, Gilded, and Glass armors at lower levels\r\n-Only affects armor wearing Thalmor, Mages still spawn with robes\r\n\r\nThe premise behind the mod is the Aldmeri Dominion have heard  word of a hero rising in Skyrim. They decide to send an elite group to take care of the problem. They are known as the Thalmor Judicium \r\n\r\n::REQUIREMENTS::\r\n-aMidianBorn Elven Armor by CaBaL\r\nhttp://skyrim.nexusmods.com/mods/23125/\r\n-Tested on Northwatch Keep and Thalmor Embassy on a new save file, may not work in these locations if you have already encountered and finished the quest for both locations\r\n\r\n::INSTALLATION::\r\n1. Download my mod\r\n2. Copy & paste contents into your Skyrim Data folder\r\n3. Download aMidianBorn Elven Armor by CaBaL Dark Version\r\n4. Copy & paste the contents of CaBaL\\'s folder textures\\\\armor\\\\elven\\\\f into Data\\\\textures\\\\armor\\\\thalmorelven\\\\f\r\n5. Copy & paste the contents of CaBaL\\'s folder textures\\\\armor\\\\elven\\\\m into Data\\\\textures\\\\armor\\\\thalmorelven\\\\m\r\n6. Ensure Thalmor Judicium.esp is actived\r\n\r\n\r\nNOT COMPATIBLE with any mod that changes Thalmor Leveled List\r\nI have never used a mod manager so I don\\'t know how to make this compatible with NMM or any other manager/steam.\r\n\r\nThis is my first mod I am just happy I can contribute to this awesome community that has given me so much. \r\n\r\nUPDATE: I actually uploaded the file now! \r\n\r\n\r\nThanks to:\r\nCaBaL for his amazing work on textures\r\nBethesda Studios for their meshes\r\nAndrew Clements",
  "categoryId": "25",
  "version": "1.0",
  "author": "richiedagger",
  "createdUnix": "1346720418",
  "updatedUnix": "1346773944",
  "containsAdultContent": false,
  "uploadedBy": "richiedagger",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86411",
      "name": "thalmor judicium",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5090",
      "fileName": "thalmor judicium-23613-1-0.zip",
      "uploadedUnix": "1346773944",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2c4e8ba06249724ec447d87c37262fa7bd6a437886cb44cb6439489580616888/analysis/1407145568/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/thalmor%20judicium-23613-1-0.zip?fid=86411&ttl=1535793997&ri=8192&rs=8192&setec=6faaa7d545d3060954c5a09128012129"
    }
  ]
}