{
  "modId": 23638.0,
  "modName": "Beautiful Training Followers - Amarie",
  "summary": "Beautiful Training Followers - Amarie provides you with a cute and reliable Ranger follower, who has an outgoing personality and is a Master Trainer for the Marksman skill.",
  "descriptionHtml": "About this mod\r\n\r\nThis mod is for everybody out there who shares my love of beautiful females within Bethesda\\'s gaming masterpiece Skyrim and looks for a good looking and useful companion. Amarie - a Ranger/Marksman-Trainer character is the first of a soon-to-be series of beautiful companions with training abilities.\r\n\r\n\r\nAbout your character\r\n\r\nAmarie is a lovely and outgoing young Nord girl, who was raised by a group of Bosmer bandits who took her captive during a raid on a nord village, when she was still a little child. During the days of her youth she won the respect of the Elves, since she showed great talent in healing and especially marksmanship. One day she challenged the leader of the bandits in a shootout contest and he promised to set her free if she would win against him. Against all odds she beat him in the contest and therefore was allowed to walk away and since that day she travels through Skyrim in search of good fortune and a real challenge for the master archer she had become...\r\n\r\nAmarie is a skilled ranger, who also has some skills in healing and one handed battle. She will sneak with your character and provide cover from behind. To round up the package she is a Master level trainer in the Marksman skill which will help out every character who enjoys ranged warfare. Since she is a lonesome girl, she will be open for marriage,too.\r\n\r\nGear : - Ancient Nord Armour ( Aela\\'s dress )\r\n          - Elven bow\r\n          - Elven Arrows   \r\n          - Elven Dagger\r\n\r\nLocation : WINDPEAK INN - Dawnstar\r\n\r\n\r\nRequired Mods\r\n\r\nThere are no mods required for this cute follower, but she will benefit from every mod, which will make here lovely appearance even more visually pleasing. It would be great if you take some screenshots and post them here to show how she will look with different beauty and body mods :-).\r\n\r\n\r\nInstallation :\r\n\r\nJust extract the mod file into your Skyrim Data folder and make sure your \\\"Amarie.esm\\\" file is checked in the mod manager of your choice.\r\n\r\nUn-installation :\r\n\r\nDelete the mod files which are labelled \\\"Amarie.esm\\\" from your Data folder.\r\n\r\n\r\nComing next :\r\n\r\n- more hot and useful training followers\r\n\r\n\r\nFile history :\r\n\r\n- 09/04/2012 initial release\r\n\r\n\r\nOther mods :\r\n\r\n- Seductive Lips HD\r\nhttp://skyrim.nexusmods.com/mods/22701\r\n\r\n- Realistic Female Face Skin HD\r\nhttp://skyrim.nexusmods.com/mods/23447\r\n\r\n- Dibellas Temptress gift - Beauties of Skyrim\r\nhttp://skyrim.nexusmods.com/mods/22190\r\n\r\n- Molag Bals Temptress Gift - Evil Beauties of Skyrim\r\nhttp://skyrim.nexusmods.com/mods/23829\r\n\r\n- Dibellas Lunari Gift - Beauties of Skyrim\r\nhttp://skyrim.nexusmods.com/mods/24560\r\n\r\n- Beauties of Skyrim - Eilinel Temptress Vampire Start Savegame\r\nhttp://skyrim.nexusmods.com/mods/22063\r\n\r\n\r\nAuthor\\'s note :\r\n\r\nThis adorable young lady is only the starting point of a series of hot follower characters I plan to release so keep on track if you like my work.\r\n\r\nIf you enjoy my mod please endorse or leave a comment and/or load up some pics of her. I am really curious how she will lokk with different body/face mods on. Criticism is also welcome since it can only improve my work. I put a lot of dedication and hours of work into the creation of my characters, so don\\'t be too harsh ;-).",
  "categoryId": "66",
  "version": "1.0",
  "author": "EcthelionOtW",
  "createdUnix": "1346777266",
  "updatedUnix": "1346777346",
  "containsAdultContent": false,
  "uploadedBy": "EcthelionOtW",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86415",
      "name": "Beautiful Training Followers - Amarie",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "185",
      "fileName": "Beautiful Training Followers - Amarie-23638-1-0.zip",
      "uploadedUnix": "1346777346",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a44ce0f4014123da9e6d7f494411491a58ee1efe26281c2b9fbc88d452470119/analysis/1407145623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beautiful%20Training%20Followers%20-%20Amarie-23638-1-0.zip?fid=86415&ttl=1535794040&ri=8192&rs=8192&setec=81c5608d3b185e8f37e4a251e690902c"
    }
  ]
}