{
  "modId": 23648.0,
  "modName": "Abandoned Imperial Outpost - Player Home",
  "summary": "A simple, lore friendly starter home. A bed, chest and weapon rack for two weapons. Who really needs a castle when just starting the game?",
  "descriptionHtml": "[b][i]Hi all, you can find the Stormcloak version of this mod [url=http://skyrim.nexusmods.com/mods/28861]here[/url], thanks![/i][/b]\r\n\r\n[u]Purpose[/u]\r\n\r\nThis mod aims to add something that seems to be lacking in Skyrim and the mod community:\r\nA small, simple, lore friendly starter home. I see many castles and estates, which is great if you\\'re rich and high level. But when you just start, you simply want a safe chest to store those weapons and armor that you\\'re planning on selling later, right?\r\n\r\nAs a low level, you don\\'t need immediate access to smithing/alchemic/enchanting equipment. If that\\'s the sort of thing you want to do, you go elsewhere in Skyrim and find it. It\\'s a bit of a cheat to start the game with those things in your own home.\r\n\r\n[u]Description[/u]\r\n\r\n[b]So, this is a small, abandoned Imperial outpost in Falkreath Hold, next to the border crossing to Cyrodil, a short walk from Halldir\\'s Cairn. You\\'ll find a note inside the cabin, explaining why it\\'s abandoned. There will be a key hung up next to the door so that you can enter the basement.\r\n\r\nInside the basement you\\'ll find a bed, chest, dresser, double weapon rack with two weapons, a table and a desk. There\\'s also a letter on the desk, just adding a little back-story to the outpost.\r\n\r\nThe basement is safe to store items (Tested up to 10 days, don\\'t forget, this is my first mod). The exterior should also be safe, however, I haven\\'t added any storage outside the basement yet.[/b]\r\n\r\n[u]Update History[/u]\r\n1.3 - Forth Release:\r\nMade the fireplace version default - none-fireplace discontinued\r\nAdded chairs and gone out fire outside - previous soldier presence\r\nAdded Sir Bucket Head next to the shack (You can talk to him, but he won\\'t say much :( )\r\nAdded an archery target a little further away from the shack\r\n\r\n1.2 - Third Release:\r\nAdded a fireplace and spit to the basement, and moved the racks to make room\r\nRemoved the dummy, possibly add him and his little bucket head outside?\r\nAdded a chimney with smoke just outside of the shack\r\nRe-navmeshed around the fireplace\r\n\r\n1.1 - Second Release:\r\nNavmeshed interior and exterior cells\r\n\r\n1.0 - First Release\r\n\r\n[u]To-do list[/u]\r\n\r\n1 - Bug squishing?\r\n\r\n[u]Requirements[/u]\r\n\r\nCreated using the latest (1.7.7) update, so I strongly recommend you have this installed.\r\n\r\n[u][b]Updating??[/b][/u]\r\n\r\nIf you\\'re upgrading to a newer version of the mod:\r\n\r\n1 - Follow the uninstallation instructions below\r\n\r\n2 - Follow the installation instructions using the updated file\r\n\r\n[u]Install[/u]\r\n\r\n1 - Extract the .esp file from the downloaded archive and copy it into the ../Data/ folder in your Skyrim installation directory.\r\n\r\n2 - Once the file is in place, open your Skyrim launcher, go to \\\"Data Files\\\" and check the box next to \\\"Starter Cabin.esp\\\"\r\n[center][b]OR[/b][/center]\r\nIf you\\'re using Nexus Mod Manager, open the \\\"Plugins\\\" tab and check the box next to \\\"Starter Cabin.esp\\\"\r\n\r\n[u]Uninstall[/u]\r\n\r\n1 - Remove any items from the outpost that you want to keep, as removing the mod will remove those items.\r\n2 - Enter an indoor cell elsewhere (a tavern or another home, for example) and save your game.\r\n3 - Uncheck the \\\"Starter Cabin.esp\\\" box in NMM or the launcher.\r\n4 - Delete the \\\"Starter Cabin.esp\\\" file from the ../data/ folder in your Skyrim installation directory.\r\n\r\n[u]Bugs[/u]\r\n- You may find when you enter the basement that the weapons are on the floor, not the racks. If this is the case, leave the basement then enter again.\r\n\r\n- The bed DOES NOT give the player a \\\"Well Rested\\\" bonus, only a \\\"Rested\\\" bonus. As of current, I don\\'t know how to fix this issue. If anyone knows, please let me know, thanks :)\r\n\r\n[u]Credits :)[/u]\r\n\r\nThanks to [b][i]Brumbek[/i][/b] for the [url=http://skyrim.nexusmods.com/mods/8655]Static Mesh Improvement Mod[/url] which can be seen in my screenshots.\r\n\r\nThanks to [b][i]Jedo_Dre[/i][/b] for the Gladius Imperial sword seen in my screenshots from [url=http://skyrim.nexusmods.com/mods/10740]Roman Imperial armor and weapons[/url]\r\n\r\nThanks to [b][i]bishon[/i][/b] for his/her immediate input and ideas, and wasted no time at all in criticizing my work xD\r\n\r\nThanks to [b][i]spletit[/i][/b] for plenty of ideas and an interesting sense of humor :L\r\n\r\nThese people have already given me the confidence to further my modding ambitions :)\r\n\r\n[u]Disclaimer[/u]\r\n\r\nYou use this mod at your own risk. I do not accept responsibility for any game or system malfunctions or breakages caused by this mod, directly or indirectly.\r\n\r\n[u]Permissions[/u]\r\n\r\nYou\\'re free to picture my mod in any screenshots of yours, but please give credit.\r\n\r\nIf you would like to add my mod as part of your own, just ask for permission first.\r\n\r\nHowever, you cannot re-upload this mod and claim it as your own.",
  "categoryId": "67",
  "version": "1.3",
  "author": "FinalEntity",
  "createdUnix": "1346789347",
  "updatedUnix": "1347102402",
  "containsAdultContent": false,
  "uploadedBy": "FinalEntity",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87123",
      "name": "Abandoned Imperial Outpost - Main File V1_3",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Abandoned Imperial Outpost - Main File V1_3-23648-1-3.rar",
      "uploadedUnix": "1347102402",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/77b01e10ac550652b28a96ed8f9e333163e4443eaf798f49554cd48fc99f5be0/analysis/1407152883/",
      "changelogHtml": " Fireplace version now default. Old version discontinued <br/> \n Added chairs outside shack for immersion <br/> \n Added archery target a little away from the shack <br/> \n Added Sir Bucket Head next to the shack <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Abandoned%20Imperial%20Outpost%20-%20Main%20File%20V1_3-23648-1-3.rar?fid=87123&ttl=1535794052&ri=8192&rs=8192&setec=e012ea448b0226fb3f78de3dee15475e"
    }
  ]
}