{
  "modId": 2366.0,
  "modName": "Skyrim Fan tribute to Bethesda and Jeremy Soule",
  "summary": "Fan Tribute to \r\nBethesda and Jeremy Soule\r\nA collection of songs created by the many fans of Bethesda\\'s great series, The Elder Scrolls.\r\n",
  "descriptionHtml": "\r\nFan Tribute to \r\nBethesda and Jeremy Soule\r\nA collection of songs created by the many fans of Bethesda\\'s great series, The Elder Scrolls.\r\n\r\n(Second Compilation has also been uploaded)\r\n\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=2815\r\n\r\nBethesda has made some great games over the years and this can be easily seen by the millions of people who have purchased Skyrim already and the thousands logged onto steam every day, playing the game religiously.\r\nWe all listen to the in-game music as it is probably some of the most epic scores you will ever hear. Hat\\'s off to Jeremy Soule and his masterpiece.\r\nMost PC users are accustomed to using mods for Elder Scroll games; however one might not always venture to YouTube to find some absolutely magical musical gems all devoted to Bethesda\\'s creation, Skyrim. These are mods too; they modify the music of Skyrim to give us a unique listening experience.\r\nAn already wonderful score has been re-created by many fans making their own rendition of the wonderful Jeremy Soule music.\r\nAll songs can be found on YouTube as free downloads and are allowed to be freely distributed. I have asked permission from the author if they did not have an mp3 available for free download.\r\nPlease note ALL these files are the property of Bethesda, regardless of who has created the version.\r\nWe suggest that all of you log on to YouTube and search for some of these talented artists and comment on their pages. The song names and usernames should match that on YouTube\r\nThe files are supplied \\\"as is\\\", which means the way the files were created. I have not edited their files; I have not \\\"mastered\\\" anything, they might all be different sample rates.\r\nElder Scrolls games have amassed a great community and each person is capable of adding something special to the game. These people are true to life Bards!\r\n\r\nI would like to add that I have not performed any of these tracks; I was merely persistent enough to dredge through thousands of songs created by fans and pick the best ones. It has taken me nearly a week of listening to songs all day to come with a decent selection for everyone to hear.\r\nThey are all the variation of similar songs, so you might get sick of the Skyrim Main theme by the end of it!\r\n\r\nI might make a second collection of songs if there is interest and if people can link me to other songs they find or submit their songs to me.\r\n\r\nAnyhow, the people who you will be listening to in this tribute were kind enough to allow their work to be heard for free, as it should be, by putting up a download on their YouTube page.\r\n\r\nTrack Listings (alphabetical order)\r\nChetreo - Skyrim Retro Edition\r\nDan Bull - Dovahkiin\r\nDan Bull - Take Me to Oblivion feat Baron Samedi\r\nDovahkiin - Skyrim Rap Adult Language Rorywainwright\r\nDragonborn Sbeast64\r\nDrummeric1989 Ragnar the Red Acoustic Cover (Skyrim)\r\nFull Skyrim Theme [Metal Cover] Alex Phott\r\nHarry Murrell Oblivion - Harvest Dawn (Bonus Track)\r\nHarry Murrell Skyrim - Exploring 2\r\nHgreedy Skyrim Night Improvised (Piano)\r\nKatsumi Richard - Age of Oppression\r\nLara and Tay - Skyrim/Morrowind Merge\r\nMaluka - Malu canta Skyrim - Skyrim vocal cover\r\nReiuyi - Skyrim\r\nSKYRIM Main Theme Laske\r\nSkyrim main theme METALIFIED GodsImmortalGauntlet\r\nSkyrim Rock Version 1_Ted Lowell\r\nSkyrim Rock Version 2_Ted Lowell\r\nSkyrim Rock Version 3_Ted Lowell\r\nSkyrim Theme on Classic Guitar Fingerpicking elviejoalado\r\nSkyrim_Dovahkiin_OC_ReMix bestrader\r\nSkyrim_Meets_Metal_hifi Eric Calderone\r\nTES V Skyrim - Power Metal Theme Metabog\r\nTES5 Metal Music MasaSanOfficialMusic\r\nTheDragonbornComes -Malukah\r\nTrueDeva Skyrim Main Theme - Acoustic Guitar cover\r\nwilcooper64 The Dragonborn Comes - Skyrim - Bard cover\r\n\r\nI hope you enjoy the music!\r\n\r\nPlease note this is not a mod that adds music to your game, it\\'s just a set of music that you can listen to, carry on an mp3 player or what not.\r\n\r\nHope you enjoy,\r\n\r\nRegards,\r\n\r\nSydney666\r\n",
  "categoryId": "61",
  "version": "1.0",
  "author": "Sydney666 aka Tony Colella and Various Artists",
  "createdUnix": "1322843317",
  "updatedUnix": "1322844505",
  "containsAdultContent": false,
  "uploadedBy": "sydney666",
  "primaryFile": null,
  "files": [
    {
      "fileId": "6271",
      "name": "Skyrim Fan tribute to Bethesda and Jeremy Soule",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "82583",
      "fileName": "Skyrim Fan tribute to Bethesda and Jeremy Soule-2366-1-0.7z",
      "uploadedUnix": "1322844505",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ea62e71ccd1de40737cc0ef10dbc7800eb3eb9e69475ba374098a4093434826c/analysis/1406469748/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Fan%20tribute%20to%20Bethesda%20and%20Jeremy%20Soule-2366-1-0.7z?fid=6271&ttl=1535756589&ri=8192&rs=8192&setec=22609c145efdbaee4d563c7ef1ad988d"
    }
  ]
}