{
  "modId": 23661.0,
  "modName": "Funny Weapons - At the Lover Stone",
  "summary": "This plugin contains some funny weapons and some uncanny clothes and some boxes I placed at the Lover Stone and the Ritual Stone.",
  "descriptionHtml": "At the Lover Stone:\r\n\tThere are weapons...\r\n\tThere are clothes...\r\n\tThere are boxes...\r\n\tAnd there are books and letters telling a lame story(I made myself)...\r\n\tAll for the Daedric Fun!\r\n\r\n[For Fun seekers]\r\n\tThis plugin contains some funny weapons and some uncanny clothes and some boxes I placed at the Lover Stone and the Ritual Stone. And you need to walk some roads and read some notes and pick some locks to finally grab them. As I said above, there is a lame story inside... Hope you could understant what happend\r\n\tThose boxes will not respawn. So after you took all things inside, It\\'s a good place to store your goods.(And this is what I first want to made this plugin for: a place with plenty of boxes to store and easy to get there--one fast travel and zero door)\r\n\r\n\tTell me which one of those uncanny things is your FAVORITE!\r\n\r\n[For Modders]\r\nTwo pack of boxes placed at The Lover Stone and The Ritual Stone.\r\n\r\nInside are a set of armors(Makes you looks like Begger) called Uncanny XXX.The ring add a perk called Another Soul allow player to sommand one more Summoned\r\n\r\nAnd Some Funny weapons inside.\r\n\tThe Forka will become an unbound sward at hand, with the magic of wabbajack(How to spell it?)\r\n\tThe Picka test your luck(5% chance for huge damage)\r\n\tThe Shiva is slow but deadly\r\n\tThe Knifa paralize your enmy\r\n\tTwo sword: the Expose encourage your enemy attack, while the Kata dis courage them.\r\n\tAnd the Axa recover your enemy XD\r\n\r\nWhen I try to make the perk Another Soul(allow player to sommand one more Summoned), possible, I changed the priorty if the perk TwinSouls, and have a chance of conflict. Other things are only adding new datas in .esp\r\nNo files other than a .esp in this mod.\r\nCHECK THE COMMENTS FOR MORE DETAIL\r\n\r\n UPDATE: Uncanny E added! Find him if you can...\r\n\r\n Ps I. If you placed something that matters to you inside those boxes and disable this plugin.....Oh, that doesn\\'t matter anymore\r\n Ps II. This plugin changed some value of the prek TwinSouls to add a perk for the ring(Check it out after you wear it!). It will not cause a problem unless there is another plugin that also changed the Value of TwinSouls",
  "categoryId": "40",
  "version": "1.1",
  "author": "Dr_Eames",
  "createdUnix": "1346812628",
  "updatedUnix": "1346812769",
  "containsAdultContent": false,
  "uploadedBy": "DrEamesRegistered",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86484",
      "name": "At The Lover Stone",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "At The Lover Stone-23661-1-1.zip",
      "uploadedUnix": "1346812769",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/299de51f22a9391b2de079bce218e3ebfe96e251732e7f753badb27cb9a08832/analysis/1407146403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/At%20The%20Lover%20Stone-23661-1-1.zip?fid=86484&ttl=1535794071&ri=8192&rs=8192&setec=c2261e82788dd13ab5aa66ff90db7a18"
    }
  ]
}