{
  "modId": 23664.0,
  "modName": "Windowed Mode Relocator",
  "summary": "The purpose of this plugin is to allow the game to use the whole screen while running in windowed mode.",
  "descriptionHtml": "[b]This mod has been integrated into the FPS Counter version 3.0\r<br />\r<br />The purpose of this plugin is to allow the game to use the whole screen while running in windowed mode.[/b]\r<br />\r<br />Although this is a SKSE plugin, you can use this mod without SKSE if you install the [url=http://skyrim.nexusmods.com/mods/24415]Winmm Plugin Loader[/url]\r<br />\r<br />The plugin will relocate the skyrim window at the top-left corner of the scren where it is running, it will also give it that monitor width and height.\r<br />\r<br />There are other solutions for this particular problem, there is even one that is also a SKSE plugin, but I made this one because I needed one solution that could remove the standard windows cursor.\r<br />\r<br />The problem with the cursor is that after alt-tabbing a few times, windows will show the hourglass cursor over the game window, I believe it&#39;s f*****g annoying to play with two cursors specially if they behave differently from one another.\r<br />\r<br />My solution is not perfect, but I haven&#39;t been able to find anything better, and believe me I&#39;ve tried, in the end I settled with this one. Sometimes the cursor will show after alt-tabbing into the game, if that happens, press alt-tab and change the foreground window until the cursor disappears.\r<br />\r<br />[b]Update 1.3:[/b]\r<br />[list]\r<br />[*]Changed the way the checks for clipping the cursor work to prevent unnecessary calls to unclip it.\r<br />[*]Added code to allow the WPL to load the plugin.\r<br />[/list]\r<br />\r<br />[b]Update 1.2:[/b]\r<br />[list]\r<br />[*]Realized game window&#39;s client rectangle doesn&#39;t mach the selected game resolution, I used those values on update 1.1, and this will cause windows to keep the taskbar over the game window.\r<br />[*]Another thing I just discovered is that although one can change the game window&#39;s size, this will not affect the size of the frontbuffer, and so streching cannot happen.\r<br />[/list]\r<br />\r<br />[b]Update 1.1:[/b]\r<br />[list]\r<br />[*]Made the plugin to clip the mouse cursor to the game window to prevent losing the window focus when the screen is bigger than the game window, useful with multimonitor setups.\r<br />[/list]\r<br />\r<br />[b]If you are interested, you can check my other mods.[/b]\r<br />[list]\r<br />[*][url=http://skyrim.nexusmods.com/mods/23402]Horse gallop endurance[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/23770]Non Stop Mining And Chopping[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/24028]Strong Boxes On Alchemy Labs And Arcane Enchanters[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/24239]FPS Counter[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/24415]Winmm Plugin Loader[/url]\r<br />[/list]\r<br />Best regards.",
  "categoryId": "39",
  "version": "1.3",
  "author": "Pharago",
  "createdUnix": "1346814888",
  "updatedUnix": "1346814888",
  "containsAdultContent": false,
  "uploadedBy": "pharago",
  "primaryFile": null,
  "files": []
}