{
  "modId": 23679.0,
  "modName": "Taller Me",
  "summary": "Does what the title says it does. Makes you taller in third person and only you.",
  "descriptionHtml": "I\\'m somewhat on the freakishly tall side in real life, so it\\'s always been odd for me to be the same height as everybody else in the game. This was a personal mod of mine that edits the player and only the player to be a height of 1.2, which puts you a full head taller than a Nord. Personal preference also made it so that the Dragonborn starts off as a female and the name Dragonborn to save a slight amount of time. Standalone mod that conflicts with nothing unless it specifically alters the starting Player character.\r\n\r\n*UPDATE*\r\nThe zip folder now has a range of twenty different heights ranging from barely taller (1.01), all the way up to my freakishly tall (1.20). Simply drop the chosen height into your data folder and activate the mod. No need to restart a character or go into the race menu. It *should* work without any work on your part.\r\n\r\n*NOTE* This mod only effects the third person, or over the shoulder, view. If you go into the first person camera, you will be the same height as everybody else. If you want both views to be the same, then I highly recommend this mod as I use it myself. I also know that you can do the same thing with the command console. I made this mod to save myself a small amount of time during character creation. Also note that whether you use this mod or the command console, your character will sit in midair as I did no meshing work for this.\r\n\r\nhttp://skyrim.nexusmods.com/mods/3265\r\n\r\nFAQ\r\nShould have seen this coming, and sorta did, but didn\\'t think anybody would ask.\r\n\r\nQ: What race is the player character in the picture? It looks like a khajiit variant.\r\nA: It is a Khajiit variant called the Dagi-Raht. They are one of the twenty known subsepecies of Khajiit and are described in one of the books you can find ingame. Here is a link to the mod:\r\nhttp://skyrim.nexusmods.com/mods/20627\r\n\r\nQ: What armor is that in the pic? Looks cool.\r\nA: That is the Schwertleite Set. Given that Skyrim is based somewhat off of the ancient Norse, I thought it fitting to have a set of armor based on Valkyries for my personal use.\r\nhttp://skyrim.nexusmods.com/mods/19665",
  "categoryId": "24",
  "version": "1.0",
  "author": "NavnikKaldra",
  "createdUnix": "1346853252",
  "updatedUnix": "1347154688",
  "containsAdultContent": false,
  "uploadedBy": "NavnikKaldra",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87304",
      "name": "Taller Me Varied",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Taller Me Varied-23679-1-1.7z",
      "uploadedUnix": "1347154688",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2c9b8df205b68466e0a1998dbd249c7433532e00635911a315ea08c40793616f/analysis/1407154569/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Taller%20Me%20Varied-23679-1-1.7z?fid=87304&ttl=1535794108&ri=8192&rs=8192&setec=6f37b8b47878f817450beb7b4e9182fa"
    }
  ]
}