{
  "modId": 23673.0,
  "modName": "Improved Werewolves - Werewolf Overhaul",
  "summary": "This mod makes a radical overhaul to the werewolf system in Skyrim. Removing the ability to change at will and making it feel like a more regular werewolf, while also adding in new benefits and disadvantages to being a werewolf to normal game-play.",
  "descriptionHtml": "[color=Red][size=3]Name          : [/size][/color]Improved Werewolves - Werewolf Overhaul\r\n[color=Red][size=3]Version       : [/size][/color]0.1BETA\r\n[color=Red][size=3]Date          : [/size][/color]05/09/12\r\n[color=Red][size=3]Category      : [/size][/color]Gameplay Effects and Changes\r\n[color=Red][size=3]Author(s)     : [/size][/color]SoulLimit\r\n[Color=Red][size=3]Requirements     : [/size][/color] Dawnguard\r\n[Color=Red]--------------------------------------------------------------------------------[/color]\r\n[Color=Red]--------------------------------------------------------------------------------[/color]\r\nDon\\'t forget - If you like the mod, endorse & vote for it so others can learn about it and enjoy it too\r\n\r\nPLEASE give feedback and bug reports, as without them I will struggle to keep updating this mod.\r\n[Color=Red]------------------------------------------------------------------------------------[/color]\r\n[Color=Red]------------------------------------------------------------------------------------[/color]\r\n\r\n[color=Red][size=4]Description:[/size][/color]\r\n[color=Red]-------------------------[/color]\r\nPlease note that this is only a BETA for now, so there may be bugs, ALWAYS REMEMBER to make a backup of your save games before trying new mods. Also, as this is a BETA, if you encounter bugs, please report them (SEE FAQ below) to help make this mod better.\r\n\r\nThis mod makes a radical overhaul to the werewolf system in Skyrim. Removing the ability to change at will and making it feel like a more regular werewolf, while also adding in new benefits and disadvantages to being a werewolf to normal game-play.\r\n\r\n[color=Red][size=4]Detail:[/size][/color]\r\n[color=Red]--------------------[/color]\r\nThis mod aims at overhauling the current werewolf system to make it more intersting to play as a werewolf. In Vanilla Skyrim, there are not really any disadvantages and few advantages to being a werewolf while out of beast form.\r\n\r\nThis mod removes the Spell \\\"Beast From\\\" any Werewolf Player, with the player instead having to look towards the night time for the chance to change. \r\n\r\nAs a Luminos Lycan Werewolf, you will have a small chance to turn into a werewolf every night, from between 1:00am and 6:00am. \r\n\r\nThere are only 3 circumstances that would guarentee you to change. That is when there is either, a Full Moon, both moons are in the Sky at the same time, and the last one, when you are most powerful, when both moons are full and in the Sky.\r\n\r\nTo put these into stats:\r\nBoth moons in the Sky appear once every 5 days\r\nA full moon occurs once every 7 days\r\nAnd both moons out and in full will occur roughly once every 35 Days.\r\n\r\nWhile both moons out and full is rare(ish), when it does occur, you become extremly powerful.\r\n\r\nI have also added in a new disease to the game, called Luminos Lycan. This can be contracted from both Wolves and Werewolves. Once contracted, you will have 3 days to cure yourself, if you fail to do so before then, you will become a fully blown Werewolf.\r\n\r\nAs a fully blown Werewolf, when you are out of beast form, you are stronger than you were before, but now also notice you are weaker against Silver.\r\n\r\nWhen you become a werewolf, you get a new ability called Werewolf Abilities, which gives you the following:\r\nExtra Health Regen in combat.\r\n50 Extra Stamina.\r\n50 Extra Health.\r\nExtra Damage in Unarmed Combat.\r\nHigher Health Regen.\r\nHigher Carrying Capacity.\r\n\r\nAdded in a new Amulet, called Amulet Of Control. This successfully halts the werewolf transformation process, even on nighs of guarenteed transformation.\r\n\r\nWhile wearing the amulet halts the transformations, it also removes you non-beast form Abilites, but it does not stop you from taking extra damage from Silver.\r\n\r\nI currently strongly advise against wearing/using the Ring of Hircine, cursed or not, as I have not yet made changes to this.\r\n\r\nI have also added in 2 new potions, a cure for Luminos Lycan (post transformation) and a potion to infect you with Luminos Lycan (post transformation).\r\n\r\nTo find both the Potions, and the Amulet, you must traverse the catacombs under jorrvaskr, it is rumoured there is an entrance somewhere around jorrvaskr, but where?\r\n\r\n[color=Red][size=4]---Installation:---[/size][/color]\r\n[color=Red]--------------------------------[/color]\r\n[color=Red][size=3]Manual Installation:[/size][/color]\r\n[color=Red]---------------------------------[/color]\r\nTo install this mod Manually, you must extract the contents of the archive and then place them in your Skyrim/Data folder.\r\n\r\n\r\n[color=Red][size=4]---Uninstallation:---[/size][/color]\r\n[color=Red]----------------------------------[/color]\r\n\r\nIMPORTANT:\r\nBefore you uninstall this mod, make sure you use the cure just to be safe, you have been warned.\r\n\r\n[color=Red][size=3]Manual Uninstallation:[/size][/color]\r\n[color=Red]-----------------------------------[/color]\r\nTo Uninstall this mod manually you must delete the .esp from your Skyrim/Data folder, if you want to fully remove this mod, then you should also delete the scripts from your Skyrim/Data/Scripts folder as well.\r\n\r\n[color=Red][size=4]Known issues and bugs:[/size][/color]\r\n[color=Red]-----------------------------------[/color]\r\n1. As a werewolf, if you attempt to wait/sleep/fast travel through the period when you would be a werewolf (0:00 - 6:00) then upon ending your waiting period you will transform into a werewolf before transforming out again automattically. The only way around this is to wear the Amulet Of Control for this period.\r\n\r\n[color=Red][size=4]Incompatabilities:[/size][/color]\r\n[color=Red]-------------------------------[/color]\r\nPlease note that this list is by no means complete, and in fact I can almost guarantee it is NOT.  These are just the mods I could think of off the top of my head.\r\n\r\n1. Bloodmoon Rising - Dawnguard Werewolf Overhaul by Sirxon\r\n2. Tales Of Lycanthropy\r\n3. Werewolf Autochanger - Incredible Hulk-like by Detman101\r\n\r\nThe only kind of mods it would be compatible with are those that replace sounds, or textures.\r\n\r\nE.g. \r\nRealistic Werewolves - Werewolf Sound Overhaul by NsJones\r\nor\r\nWerewolf retextures by ma\r\n\r\n[color=Red][size=4]Tools Used:[/size][/color]\r\n[color=Red]------------------------[/color]\r\n[url=http://newvegasnexus.com/downloads/file.php?id=40278]Pyròs: GuideLines[/url]\r\nCreation Kit, Available on Steam\r\n\r\n[color=Red][size=4]Future Plans:[/size][/color]\r\n[color=Red]--------------------------[/color]\r\nUpdate the Ring Of Hircine to make it work with this mod, and in the way I envision it to work.\r\n\r\n(Possibly) make it so that when an NPC dies near the player, their inventory will be populated by body parts (So head, torso, legs, arms, tail & ears {For specific Races}) - this depends on me getting a certain bit of scripting to work.\r\n\r\nMake it so that, through console commands, the player can choose the chance of them turning into a werewolf on a normal night\r\n\r\n(Possibly) make it so players can feed off of dead bodies, in a similar way to what you can do with the Ring of Namira, maybe also make it so that by doing this will either help to stave off the random transformations, or (more likely?) make it so feeding in this way will increase the chance of you turning for a certain amount of time..\r\n\r\nIt would be much appreciated if people would write comments on what they think about these ideas, and of any other ideas that they have for this overhaul.\r\n\r\n[color=Red][size=4]Recommended Mod:[/size][/color]\r\n[color=Red]-----------------------------[/color]\r\n[url=http://skyrim.nexusmods.com/mods/13779]Realistic Werewolves - Werewolf Sound Overhaul by NsJones[/url] - makes werewolf sounds much more realistic, worth getting.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/9694]Skyrim Monster Mod by Dogtown1[/url] - for the wild werewolves that get added.\r\n\r\n\r\n[color=Red][size=4]Frequently asked questions(FAQs):[/size][/color]\r\n[color=Red]----------------------------------------------[/color]\r\n[b][color=Red]|1. I have found a bug, how should I report this?[/color][/b]\r\n[b][color=Red]----------------------------------------------------------[/color][/b]\r\n\r\nIf you are going to report a bug, please make sure you follow these steps:\r\n1. Check the known bugs and issues list, to make sure your bug is not there\r\n2. Before you report the bug, disable all other mods and run the game with only this mod\r\n3a. If you still encountered the bug then proceed to the next step, else it was not a problem with this mod\r\n3b. If your bug did not appear after you disabled the other mods, it is likely that a mod conflict has occured, see below for reporting mod conflicts / incompatibilities.\r\n4. Go into the discussions tab and click on the Bug topic\r\n5. Report your bug here, making sure to describe the bug in as much detail as you can, what you were doing, where it happened (if necessary) etc.\r\n\r\n[b][color=Red]|2. I have found an Incompatibility, how should I report this?[/color][/b]\r\n[b][color=Red]----------------------------------------------------------[/color][/b]\r\n\r\nIf you are experiencing an incompatibility with other mods, then it would be helpful for me if you would report it so that I can warn others about it, or maybe create a workaround / fix it.\r\n\r\nIf you belive you are experiencing a mod Incompatibility please follow these steps:\r\n1.Make sure you are experiencing mod conflicts, disable all the mods you are running besides this one.\r\n2a. If you are still experiencing a problem, then it is a problem with my mod, not a conflict (see above).\r\n2b. If you do not experience the problem any more, then it is a conflict of mods that you have encountered and you should follow these steps.\r\n3. Find the mod(s) that is/are conflicting\r\n3.1. To find the mod(s) that is/are conflicting, the best way would be to re-enable any mods that you believe could be causing the problem, one at a time. If the problem still persists then you must go through all your others mods re-enabling them one at a time as well.\r\n4. Once you have found the mod/s that are conflicting, you should post the names (along with Author of the Mod) in the Incompatibilities discussion.\r\n\r\n[b][color=Red]|3. Your mod ruined my save![/color][/b]\r\n[b][color=Red]----------------------------------------------------------[/color][/b]\r\nOkay, first of all, you were warned and told to make backups of your save games before you used this mod.\r\nSecondly, can you please follow the above instructions to report exactly how my mod supposedly broke your game, so I can stop it happening to others\r\n\r\nThank You, Come Again\r\n\r\n[Color=Red][size=4]Legal and licensing:[/size][/color]\r\n[Color=Red]---------------------------------[/color]\r\nPlease ask for my permission before you go changing and uploading this mod\r\n\r\n[color=Red][size=4]My Other Mods[/size][/color]\r\n[color=Red]---------------------------------[/color]\r\n[url=http://skyrim.nexusmods.com/mods/20779]Crafting Soul Gems[/url]\r\n[url=http://skyrim.nexusmods.com/mods/22851]Helgen Equipment Variation[/url]\r\n[url=http://skyrim.nexusmods.com/mods/21796]Improved Dragonplate Armour[/url]\r\n[url=http://skyrim.nexusmods.com/mods/22742]Skyforge Steel Weapons - Craftable[/url]\r\n[url=http://skyrim.nexusmods.com/mods/20370]Vampirism Enhanced[/url]",
  "categoryId": "79",
  "version": "0.2BETA",
  "author": "SoulLimit",
  "createdUnix": "1346842306",
  "updatedUnix": "1347190994",
  "containsAdultContent": false,
  "uploadedBy": "SoulLimit",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86581",
      "name": "BETA version 0dot1",
      "version": "0.1BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "56",
      "fileName": "BETA version 0dot1-23673-0-1BETA.rar",
      "uploadedUnix": "1346848762",
      "modVersion": "0.1BETA",
      "virusScanUrl": "https://www.virustotal.com/file/aa9d1c92e3751c574f9fe90cf920280f3d07e1f99ccf334bafbbf35ad15ff3ce/analysis/1407147304/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BETA%20version%200dot1-23673-0-1BETA.rar?fid=86581&ttl=1535794094&ri=8192&rs=8192&setec=678eeb09ff5d6412496bc309022f1010"
    },
    {
      "fileId": "87376",
      "name": "BETA 0dot2",
      "version": "0.2BETA",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "57",
      "fileName": "BETA 0dot2-23673-0-2BETA.rar",
      "uploadedUnix": "1347190994",
      "modVersion": "0.2BETA",
      "virusScanUrl": "https://www.virustotal.com/file/56a9b8d2498fa251eb6c9fa178e4712568b3e1aa1c5503c3e48d5d0db148d4b0/analysis/1407155522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BETA%200dot2-23673-0-2BETA.rar?fid=87376&ttl=1535794095&ri=8192&rs=8192&setec=1393b3cc6a36a69cdd515400b0d47b74"
    }
  ]
}