{
  "modId": 23709.0,
  "modName": "Weapon Expertise",
  "summary": "Tweaks to make the weapon specialization perks more worthwhile. Also adds a perk for dagger specialization.",
  "descriptionHtml": "Updates:\r\n1.03: - Crit damage and regular damage on Deep Wounds level 3 were transposed, resulting in way too much damage being added.\r\n- Skull Crusher level 3\\'s discription did not accurately report the 30% extra damage (though it still gave it)\r\n1.02 - Knife Fighter level 3 required that you had a one-armed skill of exactly 90, rather than 90 or better \r\n\r\nThe weapon specialization perks in vanilla were, in theory, a decent way to represent lost weapon type skills, and add more specialty to your character. Unfortunately, their effects were far too minor to be either noticeable, or worth a perk point. Also, there wasn\\'t one for daggers, which would have been a great loss, were the others not so weak.\r\n\r\nGiven that they do cost a perk point, and that they require exclusively picking a certain weapon type, they ought to be useful and worthwhile. This mod is an attempt to make them more useful, to give a reasonable bonus should you choose to specialize in one particular weapon type.\r\n\r\nThis also attempts to correct problem I had with daggers in the base game, in that they felt very much like a tool used for backstabbing. Given how easy switching between weapons is, it made sense to have a dagger hotkeyed for backstabbing, and to then switch out to some other one-handed weapon when you needed to fight, even if you were playing a more roguish character. Now you can take the dagger specialty perk and there is a reason to actually fight with daggers.\r\n\r\nChanges:\r\nAll weapon specialty perks now add 10/20/30% damage to their respective weapon types. You can obtain greater overall damage if you choose to specialize in a particular weapon. This is in addition to any other changes to said perks.\r\n\r\nNew Perk - Knife Fighter: The dagger specialty perk. It adds a chance (2/4/6%) to do critical damage based on whatever your sneak modifier is. Thus, this perk will increase in potency with points in Backstab and Assassin\\'s Blade, as well if you are using any items that use the vanilla magic effect that increases backstab damage (e.g. shrouded gloves). So long as items use the effect already in game, it should be compatible with any modded items that increase your backstab damage. See notes on critical hits below.\r\n\r\nBladesman/Deep Wounds: Has a chance (10/15/20) to deal 2/4/6x critical damage. Up from 1/1.25/1.5 in vanilla. See notes on critical hits below.\r\n\r\nBonebreaker/Skull Crusher: Ignores 30/60/90% of opponent\\'s armour. Up from 25/50/75% in vanilla.\r\n\r\nHack and Slash/Limbsplitter: Bleeding damage magnitude has been tripled, and a second of duration added, across the board.\r\n\r\nCritical Charge/Great Critical Charge: Extra damage is no longer done as critical damage. It is now straight up double damage. It will thus not trigger a critical hit notification. This was done to avoid unwanted interactions with the other modified critical skills, as well as a general balance, since critical hits are so weak. See notes below.\r\n\r\nNotes:\r\n\r\nSome of these critical hit numbers might seem a little high if you don\\'t know how critical hits work, so let me explain how, if anything, they are actually a little low.\r\n\r\nHow critical damage works, is that every weapon has, as a stat, its critical hit damage. This is the number that gets added to your damage if you score a critical hit, and they are, with few (if any) exceptions half the weapon\\'s base damage, rounded down. So, for example, an Iron Sword\\'s base damage is 7, and its critical damage is 3. A deadric sword has a base damage of 14, and a crit damage of 7.\r\n\r\nThis crit damage is not affected by any of the other things (skills, perks, smithing) that usually affect damage, it is completely static. So that means even if you\\'ve got that same iron sword up to dealing 51 damage per swing (legendary, all armsman perks, 100 one-handed), crits are still adding only 3 damage. The damage IS added after armour reductions, so at least that\\'s something. This static number is then modified by your crit damage modifier, but nothing else. \r\n\r\nThis means that, with Knife Fighter, for example, even though the crit modifer is equal to your sneak attack modifier, so potentially you are doing 15x crit damage, no critical hit will ever be anywhere near a sneak attack. If a dagger does 10 damage, thus has a crit damage of 5, then a 15x sneak attack would deal 10*15, so 150. The Knife Fighter crit if you had Assassin\\'s Blade would deal 10+(5*15) so 85. This is without taking into account any of the other modifiers to your dagger damage which would be taken into account in the sneak attack, but not the crit. That same 10 damage dagger smithed to legendary would be doing 20 damage, so 300 sneak attack, but only 95 on a crit (20+[5*15]). \r\n\r\nIt should be obvious then, that the biggest problem facing critical hits is their lack of scalability.  As you find ways to increase your weapon damage they will become a smaller and smaller percentage of overall damage.\r\n\r\nThere are ways to correct this, though they are a shade messy, and involve avoiding the critical system entirely. This is (at the moment) beyond the scope of this mod. What I hope to have accomplished with this is that while critical damage will fluxuate in what percentage of overall damage it is responsible for, depending on other methods you pursue for increasing your damage, it will at least always be objectively more damage than you could have had, and hopefully always a significant chunk of damage. \r\n\r\nThe least average damage a crit should end up doing is roughly double damage.\r\nE.g. A legendary daedric greatsword with max Barbarian as well as max level of my modified Deep Wounds and 100 in two handed will deal 117 damage per hit, and on crit will add 144 damage. \r\n\r\nI\\'d welcome any comments on balance. I\\'ve done playtesting on these changes (some more than others) and have in some cases gone back and forth on certain numbers quite often. I would thus love to hear what other people think about these numbers. The overall goal is to make picking a weapon specialization (any) a worthwhile prospect over picking none, and to have the specialty effects of each weapon feel different and balanced with each other in a way that causes you to have a think about which particular one you want.\r\n",
  "categoryId": "24",
  "version": "1.03",
  "author": "Hidden_7",
  "createdUnix": "1346916103",
  "updatedUnix": "1361175558",
  "containsAdultContent": false,
  "uploadedBy": "Hidden_7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000010830",
      "name": "WeaponExpertise103",
      "version": "1.03",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "WeaponExpertise103-23709-1-03.rar",
      "uploadedUnix": "1361175558",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/9310388cad04b63635c521b0441ce49c0426fecf2c149f14d7a4da0ce660e6eb/analysis/1407424393/",
      "changelogHtml": " Deep Wounds level 3 had crit damage and regular damage numbers transposed <br/> \n Skullcrusher level 3&#39;s discription did not accurately report extra damage <br/> \n Knife Fighter level 3 had its requirements fixed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WeaponExpertise103-23709-1-03.rar?fid=1000010830&ttl=1535794138&ri=8192&rs=8192&setec=00f51e9035c0c7aa4f3d6b46bf0bd8fa"
    }
  ]
}