{
  "modId": 23701.0,
  "modName": "Hospitaller or Knights of St John Armory",
  "summary": "Adds a quick and dirty mod of Knights Hospitaller Equipment",
  "descriptionHtml": "I did this as a request from the forums a long time ago, only now getting round to implementing it (R/L and s**t getting in the way)\r\n\r\nIt\\'s based loosely on a very common pic you find if do a web search for Knights Hospitaller or Knights of St John or Maltese Knights\r\n\r\nI made the stats basically the same as the Orcish items, but with slightly less weight and slightly more value, but roughly the same damage/armor properties.\r\n\r\nIt looks stupid without the chainmail coif BTW because the body mesh leaves a gap below the neck (sorry, but Ive got NO skills with 3D modelling, just a**ing about with Nifskope)\r\n\r\nIt\\'s fully standalone and IIRC it\\'s under the \\\"Imperial\\\" section for smithing it\\'s also fully temperable.\r\n\r\nIt\\'s primarily a male armor, though there is a very quick and dirty !!! W.I.P !!! female version included, I\\'ll get back to the female version eventually I promise\r\n\r\nThe set includes\r\nChainmail Cuirass (with gamebeson underneath, though because it\\'s black you cant see it) covered by a surcoat\r\n\r\nBoots with chainmail and steel plates\r\n\r\nChainmail fingerless gloves (to allow for easier weapon handling)\r\n\r\nChainmail \\\"coif\\\" (helmet for the uninitiated)\r\n\r\nSkeggox or \\'Bearded\\\" axe\r\n\r\nHeater Shield\r\nThanks/kudos/credit/undying gratitude MUST go to abakus for his steel heater shield mesh found here:\r\nhttp://skyrim.nexusmods.com/mods/5916\r\n\r\nI haven\\'t tested it exhaustively in game, the weight sliders work and the armor doesn\\'t seem to clip to badly that I\\'ve noticed, the colours seem OK, though the white \\\"cross\\\" does tend to \\\"glow\\\" a bit under certain lighting, but that adds to the effect AFAIK.\r\n\r\nAs always PLEASE if you find any issues or problems POLITELY let me know, and I\\'ll try and resolve them\r\n\r\n*** I Will enter into NO arguments or discussions about how historically accurate this mod is in your opinion ... I DO NOT CARE ... From my research (in other words a quick web search) this is pretty close to accurate. \\' Nuff said! ***\r\n\r\nYou can do whatever you like with this mod, just, as always, remember to acknowledge my work if you use it elsewhere. Foreign language translations are also fine. DO NOT under ANY circumstances post to the Steam Workshop!",
  "categoryId": "54",
  "version": "1.0",
  "author": "Perraine",
  "createdUnix": "1346890713",
  "updatedUnix": "1346890882",
  "containsAdultContent": false,
  "uploadedBy": "Perraine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86696",
      "name": "1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9220",
      "fileName": "1-23701-1-0.rar",
      "uploadedUnix": "1346890882",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3a246fb6c0066c2ae56988ba459124cac5b7e8be1e4b5073857b5b2bfa3c1f6b/analysis/1407148155/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/1-23701-1-0.rar?fid=86696&ttl=1535794128&ri=8192&rs=8192&setec=6c6886a74f19dad14018a5ed0bc0fce4"
    }
  ]
}