{
  "modId": 23703.0,
  "modName": "Skirtless Male Daedric Armor Plus",
  "summary": "Skirtless version of the male Daedric armor",
  "descriptionHtml": "This is a REPLACER for existing meshes/textures ... You have been warned!\r\n\r\nA Non-Replacer version MAY be forthcoming, after I do all of the male armors in game I can.\r\n\r\nContinuing my \\\"Skirtless Male Armors\\\" theme mods\r\nHide = http://skyrim.nexusmods.com/mods/23579\r\nIron = http://skyrim.nexusmods.com/mods/23665\r\nBandit= http://skyrim.nexusmods.com/mods/23670\r\nNord Plate = http://skyrim.nexusmods.com/mods/23669\r\n\r\n\r\nBasically my DOV don\\'t wear skirts!\r\n\r\nSo I decided to try and create a \\\"pants\\\" version of the male armors.\r\nWhere possible I tried to use existing textures and keep the theme/style the same, and where not possible, I created the textures from scratch (like all of the normal maps!!!)\r\n\r\nThe Daedric is a little different than the others, as it includes more files. I did the usual pants instead of a skirt option, but I REALLY hated the purple glow/tint that Bugthesda added to the armor and the PINK! <shudder> emissive colour (WTF?) For supposedly evil/wicked armor, that just didn\\'t seem right, so I changed ALL of the emissive colours, glow maps and cubemaps to red/dark red, so that\\'s why ALL Daedric armor components are included in this file ... (the items are enchanted, hence the coloured \\\"shimmer\\\" on some items, sorry)\r\n\r\n*** One of the screenshots includes a shameless plug of an updated version of one of my earlier mods, if anyone wants it, let me know, and I\\'ll upload it as separate mod ***\r\n\r\nThe textures are not \\\"High Def\\\" and please don\\'t ask for for a \\\"HD\\\" version, but they are as detailed and as close to the original textures as I can make them.\r\nIf someone wants to create a HD version, feel free.\r\n\r\nI\\'m slowly going through all the armors and, where possible, doing the same thing, so there should be more coming, please be patient if your want \\\"xxx\\\" armor with no skirt\r\n\r\nThese are MALE ONLY, as I feel there is already enough female variants out there, but If I get enough requests I MAY try and do something similar for the female version.\r\n\r\nThere may be some minor clipping errors here and there with certain animations, I haven\\'t tested these out exhaustively in game, but in most situations they seem to work OK\r\n\r\n!!! Again, Any bugs or major issues PLEASE let me know POLITELY, and I\\'ll try and sort them out !!!\r\n\r\nFor the SS I used vanilla assets, except I used one of the \\\"clean\\\" skin textures (can\\'t remember which one, but there aren\\'t that many for male bodies so ...) ",
  "categoryId": "54",
  "version": "1.0",
  "author": "Perraine",
  "createdUnix": "1346895413",
  "updatedUnix": "1346895597",
  "containsAdultContent": false,
  "uploadedBy": "Perraine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86705",
      "name": "Skirtless Male Daedric Armor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3222",
      "fileName": "Skirtless Male Daedric Armor-23703-1-0.rar",
      "uploadedUnix": "1346895597",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/84c4001d4a123f7baf485bb5ef2bb1a7f7c40f536469a6fcfcaf588c4eab8a3d/analysis/1407148328/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skirtless%20Male%20Daedric%20Armor-23703-1-0.rar?fid=86705&ttl=1535794130&ri=8192&rs=8192&setec=86e374344039fd84b28efad37853c202"
    }
  ]
}