{
  "modId": 23754.0,
  "modName": "Skirtless Male Draugr-Ancient Nord-Armor",
  "summary": "Skirtless version of the Male Ancient Nord Armor",
  "descriptionHtml": "This is a REPLACER for existing meshes/textures ... You have been warned!\r\n\r\nA Non-Replacer version MAY be forthcoming, after I do all of the male armors in game I can.\r\n\r\nContinuing my \\\"Skirtless Male Armors\\\" theme of mods\r\n\r\nHide = http://skyrim.nexusmods.com/mods/23579\r\nIron = http://skyrim.nexusmods.com/mods/23665\r\nBandit= http://skyrim.nexusmods.com/mods/23670\r\nNord Plate = http://skyrim.nexusmods.com/mods/23669\r\nDaedric = http://skyrim.nexusmods.com/mods/23703\r\n\r\n\r\nBasically my DOV don\\'t wear skirts!\r\n\r\nSo I decided to try and create a \\\"pants\\\" version of the male armors.\r\nWhere possible I tried to use existing textures and keep the theme/style the same, and where not possible, I created the textures from scratch (like all of the normal maps!!!)\r\n\r\nI know the Ancient Nord doesn\\'t appear much in game (the male version at least) but I like to be thorough so ...\r\nI\\'ve also included a quick and dirty retex of the iron boots, partly because the vanilla ones looked ridiculous AFAIK, and also partly because the vanilla ones clipped badly with the pants around the calves. I PROMISE I\\'ll get back to them and do a proper version soon, please be patient.\r\n\r\nThe textures are not \\\"High Def\\\" and please don\\'t ask for for a \\\"HD\\\" version, but they are as detailed and as close to the original textures as I can make them.\r\nIf someone wants to create a HD version, feel free.\r\n\r\nI\\'m slowly going through all the armors and, where possible, doing the same thing, so there should be more coming, please be patient if your want \\\"xxx\\\" armor with no skirt.\r\n\r\nI also DO NOT have any skills with Blender or MAX, so these are done purely with Nifskope and Paint.net, which means I probably won\\'t be able to \\\"Add this, take out that, put that there and swap that for this\\\" But if you do have a request you can still post it and I MAY be able to do it.\r\n\r\nThese are MALE ONLY, as I feel there is already enough female variants out there, but If I get enough requests I MAY try and do something similar for the female version.\r\n\r\nThere may be some minor clipping errors here and there with certain animations, I haven\\'t tested these out exhaustively in game, but in most situations they seem to work OK\r\n\r\n!!! Again, Any bugs or major issues PLEASE let me know POLITELY, and I\\'ll try and sort them out !!!\r\n\r\nFor the SS I used vanilla assets, except I used one of the \\\"clean\\\" skin textures (can\\'t remember which one, but there aren\\'t that many for male bodies so ...) ",
  "categoryId": "54",
  "version": "1.0",
  "author": "Perraine",
  "createdUnix": "1346972424",
  "updatedUnix": "1346972561",
  "containsAdultContent": false,
  "uploadedBy": "Perraine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86860",
      "name": "Skirtless Male Ancient Nord Armor",
      "version": "1.0.plus",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3089",
      "fileName": "Skirtless Male Ancient Nord Armor-23754-1-0-plus.rar",
      "uploadedUnix": "1346972561",
      "modVersion": "1.0.plus",
      "virusScanUrl": "https://www.virustotal.com/file/bd3cf3f020d9dde5ddcb243c1a10add36e893e2d768bd100d8459dc801d7d0c5/analysis/1407149885/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skirtless%20Male%20Ancient%20Nord%20Armor-23754-1-0-plus.rar?fid=86860&ttl=1535794187&ri=8192&rs=8192&setec=74d009af9e5a7c13ca94d88147b169d7"
    }
  ]
}