{
  "modId": 23765.0,
  "modName": "SkyRealism - ENB Evolved",
  "summary": "SkyRealism - ENB Evolved is an entirely new code-base for ENB. \r<br />Features: 9 different presets, HSV Color Conversion system, Color Equalizer, 3 New Depth of Field algorithms, 6 new auto-focusing systems, lens reflection, film grain, vignette, letterbox, interlacing, sepia toning, and a 25 page User Manual.",
  "descriptionHtml": "[img=center]http://static-2.nexusmods.com/15/mods/110/images/23765-1-1363661745.png[/img]\r<br />[center][i]An HLSL Code Base for ENBSeries[/i][/center][center][color=black][i]by MTichenor[/i][/color][/center]\r<br />\r<br />[color=red][b]WARNING: [/b][/color]The focusing system will not detect your character during the character creation process (it&#39;s impossible to have it detect the character during the char-gen screen while ignoring your bow in first person gameplay). Simply use SHIFT + F12 to temporarily disable ENB while you are creating your character.\r<br />\r<br />[heading][color=#87CEEB]Overview[/color][/heading]Have you ever wondered why most of the ENBs you find have strange colors, are too dark, too bright, or have shadows darker than the deepest pits of hades? Why none of them ever work right with lighting or weather mods? Why Depth of Field always focuses on the exact center of the screen, making it impossible to get good screenshots of your character? Why the game always looks faded no matter what settings you apply?\r<br />\r<br />I do.\r<br />\r<br />That&#39;s why I&#39;ve spent weeks rewriting the FX files that come with the ENBSeries by Boris Vorontsov and the Bokeh DoF code by Matso. ENB Evolved is NOT a collection of settings; it&#39;s a complete rewrite of the underlying HLSL shader code for ENB. It features several improvements:\r<br />\r<br />[list][*]Three completely customizable Depth of Field algorithms: Simple, Fast, and Sprite-Based.\r<br />[*]Six auto-focusing systems, including presets for 1st person (default) and 3rd person.\r<br />[*]Many new camera effects: lens reflections, film grain, vignette, letterbox, and more.\r<br />[*]Completely new color tone mapping system, using HSV Color Conversion.\r<br />[*]Color Equalizer system for saturation control, using HSV Color Conversion.\r<br />[*]Controls to adjust vanilla Skyrim Bloom and Adaptation levels.\r<br />[*]Completely new and adjustable ENB Bloom algorithms.\r<br />[*]Includes Vanilla settings that are a 100% match with vanilla Skyrim.\r<br />[*]Cinematic and Vibrant Presets designed to work perfectly with [url=http://skyrim.nexusmods.com/mods/30450/]Realistic Lighting Overhaul[/url] and [url=http://skyrim.nexusmods.com/mods/17802]Project Reality - Climates Of Tamriel[/url].[/list]\r<br />For those of you unfamiliar with the ENB settings, here&#39;s a rough estimate of the types of FPS penalties you&#39;ll see when enabling each of the features. The numbers listed are cumulative. Each effect can be enabled or disabled in enbseries.ini under the [EFFECT] section.\r<br />\r<br />Enabling ENBSeries: -10% fps\r<br />Enabling SkyLighting: -15% fps\r<br />Enabling Sunrays: -2% fps\r<br />Enabling Detailed Shadows: -2% fps\r<br />Enabling ENB SSAO: -16% fps\r<br />Enabling SkyRealism DoF: -12% fps\r<br />\r<br />Total Cost: -57% fps\r<br />\r<br />[heading][color=#87CEEB]ENB Evolved Presets and Configuring a Custom ENB[/color][/heading]There are several different presets that are included with this mod: Bleak, Cold, Cinematic, Fantasy, Gothic, Vibrant, Vanilla, and Warm.\r<br />\r<br />The [b]Vanilla[/b] preset is a modder&#39;s resource. I created it as a starting point for people who wish to create their own custom ENB. It is a perfect match with vanilla Skyrim colors, even with nearly all the effects enabled. If you wish to create your own ENB, I highly recommend you use this preset as a starting point. Check out the User Manual for detailed information on all the different features, all the settings, and how to change them.\r<br />\r<br />The [b]Cinematic[/b] and [b]Vibrant[/b] presets contain settings that are designed to enhance vanilla Skyrim, as well as working well with [url=http://skyrim.nexusmods.com/mods/30450/]Realistic Lighting Overhaul[/url] by The Realistic Lighting Team or [url=http://skyrim.nexusmods.com/mods/17802]Project Reality - Climates Of Tamriel - Weather - Lighting[/url] by JJC71. Shadows are slightly darker, specular highlights are brighter, and colors are slightly richer. I created it to give you a slightly more immersive and realistic feel when playing Skyrim, without changing the look and feel of Skyrim.\r<br />\r<br />The [b]Fantasy[/b] preset is another favorite of mine, but is intended to be used without any lighting or weather mods, since it heavily adjusts interior and exterior lighting and colors. Bloom affects everything, interiors will be much darker, stars and auroras are brighter, etc. You may need to adjust ambient lighting levels if using CoT or RLwC.\r<br />\r<br />The [b]Bleak[/b] and [b]Gothic[/b] presets are my other favorites, based on [url=http://skyrim.nexusmods.com/mods/24828]BLEAK ENB - UNBLEAK ENB[/url]. Midranges are duller and darker, giving Skyrim a bleak, gothic, and forboding feel. You may need to adjust ambient lighting levels if using CoT or RLwC.\r<br />\r<br />[heading][color=#87CEEB]Focusing Presets and Depth of Field[/color][/heading]Depth of Field is a rather sensitive issue: some people love it, some hate it. Depth of Field makes foreground objects blurry when looking at background objects, and makes background objects blurry when looking at foreground objects. \r<br />\r<br />There are six different Focusing algorithms for Depth of Field, and they determine what objects you are &#34;focusing&#34; on in Skyrim, for the Depth of Field calculations. All can be toggled and tweaked in the enbeffectprepass.fx file. I&#39;ll discuss the three most popular: Nearest, First, and Third.\r<br />\r<br />The [b]First Person[/b] focusing preset (the default) is designed to allow you to play Skyrim without ever focusing on your weapons in 1st person mode. This preset will NOT focus on your character in third person mode.\r<br />\r<br />The [b]Third Person[/b] focusing preset is designed to allow you to play Skyrim in Third Person mode, and will focus on your character unless you have weapons drawn, in which case it will focus on objects directly in front of your character. \r<br />\r<br />The [b]Nearest[/b] focusing preset is the one I used in v1.32 of ENB Evolved, and it uses a simple rectangle in the middle of the screen to search for objects to focus on, and will always focus on the nearest object in that rectangle. The settings for this box (size, location, etc.) can be changed in the Globals and Settings section of the enbeffect.fx file. You can use [url=http://skyrim.nexusmods.com/mods/26764]this mod[/url] to lower the position of the bow if you have problems with the nearest focusing system focusing on your arrow in first person.\r<br />\r<br />There are three different Depth of Field algorithms that are included with ENB Evolved: Simple, Fast, and Sprite-Based. These can be toggled and tweaked in the enbeffectprepass.fx file.\r<br />\r<br />The [b]Simple DoF[/b] is exactly that: extremely simple. It&#39;s faster than the Fast preset, since it performs the DoF calculations in a single pass, but it doesn&#39;t look as good as the Fast DoF.\r<br />\r<br />The [b]Fast DoF[/b] is a variant of Matso&#39;s Fast DoF v2.0.5. It features a few minor improvements with regards to focusing distances and calculations to reduce color bleeding from foreground to background objects. \r<br />\r<br />The [b]Sprite-Based DoF[/b] is a state-of-the-art Depth of Field simulator, designed to perfectly mimic the way real cameras work. However, it&#39;s EXTREMELY SLOW. It should be used only be machinimatographers taking pictures in Skyrim.\r<br />\r<br />[heading][color=#87CEEB]Requirements and Installation[/color][/heading]This ENB configuration requires [url=http://enbdev.com/download_mod_tesskyrim.htm]ENBSeries[/url][color=#888888] by [b]Boris Vorontsov[/b].[/color]\r<br />\r<br />ENBSeries comes with both an Injector version and a Wrapper version. Some people have problems one or the other...if one doesn&#39;t work or causes crashes, try the other. DON&#39;T USE BOTH. There can be enormous differences in performance between the two depending on your hardware configuration, especially on computers with integrated graphics cards.\r<br />\r<br />The Wrapper version contains two important files. One is called &#34;d3d9.dll&#34; and the other is &#34;enbhost.exe&#34;. Simply copy these into your main Skyrim directory, usually located at &#34;C:Program Files (x86)SteamSteamAppscommonskyrim&#34;. That&#39;s all you need to do for installing the wrapper version; the other files in the wrapper version are not necessary, as they are included in each of the SkyRealism presets.\r<br />\r<br />The Injector version contains four important files: &#34;ENBInjector.exe&#34;, &#34;enbhost.exe&#34;, &#34;enbinjector.ini&#34;, and &#34;enbseries.dll&#34;. Copy all four of these into your main Skyrim directory. Before running Skyrim, run the ENBInjector.exe file, and leave it open while playing Skyrim. That&#39;s all you need to do for installing the injector version; the other files in the injector version are not necessary, as they are included in each of the SkyRealism presets.\r<br />\r<br />[color=yellow][b]NOTICE: [/b][/color]You must open SkyrimPrefs.ini and change bFloatPointRenderTarget=0 to bFloatPointRenderTarget=1 under [Display] in order for ENBSeries to work. The SkyrimPrefs.ini file is located in &#34;C:Users[i]YourUserName[/i]DocumentsMy GamesSkyrim&#34;. You may also need to change the following variables: bTreesReceiveShadows=1, bDrawLandShadows=1, and bShadowsOnGrass=1 in either your SkyrimPrefs.ini or Skyrim.ini file.\r<br />\r<br />Lastly, after you&#39;ve downloaded ENB Evolved, you&#39;ll need to open it with a 7z decompression utility, such as [url=http://www.7-zip.org]7zip[/url]. Inside will be a series of folders which each have been configured in different ways. Select one of the folders, and open it up to view the contents. Select the contents in that folder and extract them to your Skyrim directory ([code]C:Program Files (x86)SteamSteamAppscommonskyrim[/code]). That&#39;s it&#33;\r<br />\r<br />If you want to uninstall this mod, simply delete all the files in your Skyrim directory that begin with the letters &#34;enb&#34;, and &#34;d3d9.dll&#34;.\r<br />\r<br />[heading][color=#87CEEB]Credits and Thanks[/color][/heading]ENBSeries is a creation of Boris Vorontsov. He deserves all the credit for cracking the Skyrim rendering system open and pulling out its guts, then performing bizarre magic rituals upon it (somewhat akin to divination or necromancy).\r<br />\r<br />Matso is responsible for the fantastic Bokeh depth of field effects that remind me so much of the days when I forget my glasses.\r<br />\r<br />Tapioks is the author of Skyrim Enhanced Shaders-FX, the source of the original enbeffect.fx and enbeffectprepass.fx files that I modified. Used with permission. Demidekidasu is the creator of the Technicolor ENB that is used in the Technicolor Days preset. Doktorfrost provided the screenshots showing the v2.0 presets.\r<br />\r<br />[heading][color=#87CEEB]Assistance, Copyright, and Permissions[/color][/heading]I grant permission to download and modify this mod freely. \r<br />\r<br />I grant permission to redistribute this mod and any changes to it as long as I am listed in the credits. If you do redistribute it, please send me a private message just to notify me about it. \r<br />\r<br />If you send me a copy of your ENB config and any problems you&#39;re having, I&#39;ll be happy to offer suggestions, tweaks, and even write custom code to help you out, so you can use it to best effect.\r<br />\r<br />[heading][color=#87CEEB]Change Log[/color][/heading][b]v2.73[/b]\r<br />Fixed ImageBasedLighting so that it no longer causes greyed out hair and glowing alduin.\r<br />\r<br />[b]v2.7[/b]\r<br />Updated INI files to work with ENBSeries v0.198.\r<br />Added Particle Light support to all presets.\r<br />Tweaked several existing presets.\r<br />Added two new presets: Realistic and Scary.\r<br />Added comparison screenshots of all presets in daytime, nighttime, interiors, and dungeons.\r<br />\r<br />[b]v2.6[/b]\r<br />Updated INI files to work with ENBSeries v0.168.\r<br />Changed water droplet texture and added stretching to make it look more like vanilla rain.\r<br />\r<br />[b]v2.5a[/b]\r<br />Updated INI file to work with ENBSeries v0.153. \r<br />Added rain support to INI file.\r<br />Added water droplet texture.\r<br />Added particle patch by Mindflux.\r<br />\r<br />[b]v2.2[/b]\r<br />Fixed the bug in the Cinematic Edition which was causing purple lines in clouds.\r<br />\r<br />[b]v2.1[/b]\r<br />Rebuilt presets; they were all originally constructed using a faulty enbpalette.bmp file, and looked like garbage in dark areas. Now they should look much better.\r<br />Also fixed Cinematic preset to look much more like v1.0 Cinematic with Brighter Metals (the current favorite).\r<br />\r<br />[b]v2.0:[/b]\r<br />Added a detailed user manual.\r<br />Added several new presets.\r<br />Added in-game camera aperture controls (hold 0 and PG UP or PG DN to adjust it).\r<br />Added Manual, Nearest, Average, Farthest, Smart First-Person, and Smart Third-Person focusing systems in enbeffectprepass.fx file (for fun). \r<br />Added Sprite-Based Bokeh Depth of Field in enbeffectprepass.fx (for fun). WARNING: EXPERIMENTAL.\r<br />Added Lenz Reflection toggle and settings to enbbloom.fx (for fun).\r<br />Added ENB Bloom settings to enbbloom.fx (for fun).\r<br />Changed ENB Bloom to prevent &#34;glow&#34; effect. Can be adjusted in enbbloom.fx (as requested).\r<br />Added HSV Equalizer toggle and settings to enbeffect.fx (for fun).\r<br />Added HSV Power Curve toggle and settings to enbeffect.fx (for fun).\r<br />Added Film Grain toggle and settings to enbeffect.fx (for fun).\r<br />Added Sepia Tone toggle and settings to enbeffect.fx (for fun).\r<br />Added Vignette toggle and settings to enbeffect.fx (as requested).\r<br />Added Vertical and Horizontal Interlace Bar toggles and settings to enbeffect.fx (for fun).\r<br />Added Letterbox/Cinematic bar toggle and settings to enbeffect.fx (as requested).\r<br />Added Vanilla Bloom toggle and settings to enbeffect.fx (as requested).\r<br />Added Vanilla Adaptation toggle and settings to enbeffect.fx (as requested).\r<br />Added ENB Palette code toggle to enbeffect.fx (for performance optimization).\r<br />Added ENB Adaptation code toggle to enbeffect.fx (for performance optimization).\r<br />Added ENB Bloom code toggle to enbeffect.fx (for performance optimization).\r<br />\r<br />[b]v1.32:[/b]\r<br />Removed adaptation and letterbox changes due to bugs on NVIDIA series cards (Reverted to v1.2 of enbeffect.fx).\r<br />\r<br />[b]v1.3:[/b]\r<br />Added cinematic/letterbox bars and control for the height of them in enbeffect.fx.\r<br />Fixed the bug causing clouds on mountains to appear dark grey.\r<br />Disabled Skyrim adaptation; Enabled ENBSeries adaptation.\r<br />Many slight tweaks to various settings (color, specular, lightsprites, etc.)\r<br />\r<br />[b]v1.2:[/b]\r<br />Reduced default depth of field change time, as it was causing headaches for some.\r<br />Added the Cinematic with Brighter Metals preset.\r<br />\r<br />[b]v1.1:[/b]\r<br />Slightly increased maximum focus range, drastically reduced minimum focus range.\r<br />Implemented maximum blur cap.\r<br />\r<br />[b]v1.0:[/b]\r<br />Initial release of ENB Evolved.\r<br />\r<br />[heading][color=#87CEEB]Mods Showcased[/color][/heading]\r<br />Here is the list of mods that I had installed while taking the screenshots showcased in the images section:\r<br />\r<br />[list=1]\r<br />[*]Better males - Beautiful nudes and faces - New hairstyles (Sundracon Meshes)\r<br />[*]DIMONIZED UNP female body\r<br />[*]UNP Khajiit and Argonian Hotfix\r<br />[*]Enhanced Blood Textures\r<br />[*]Expanded Towns and Villages\r<br />[*]Immersive HUD - iHUD\r<br />[*]Lanterns of Skyrim - All In One\r<br />[*]Morrowind Armor for Skyrim\r<br />[*]Pets of Skyrim\r<br />[*]Populated Cities\r<br />[*]Realistic Lighting with Customization (Default Setting)\r<br />[*]Skyrim Flora Overhaul\r<br />[*]Skyrim Realistic Overhaul\r<br />[*]Static Mesh Improvement Mod\r<br />[*]W.A.T.E.R - Water and Terrain Enhancement Redux\r<br />[/list]\r<br />\r<br />\r<br />*: Better is a completely subjective term, and depends on the individual.",
  "categoryId": "62",
  "version": "2.73",
  "author": "MTichenor",
  "createdUnix": "1346989828",
  "updatedUnix": "1381059332",
  "containsAdultContent": false,
  "uploadedBy": "IndigoNeko",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93962",
      "name": "SkyRealism - ENB Evolved",
      "version": "2.21",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5497",
      "fileName": "SkyRealism - ENB Evolved-23765-2-21.7z",
      "uploadedUnix": "1350273423",
      "modVersion": "2.21",
      "virusScanUrl": "https://www.virustotal.com/file/dd6667bd30822669aa33912fc7809ffc1b09ab4f55be72ec6143ed5faf76b6de/analysis/1407222725/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20ENB%20Evolved-23765-2-21.7z?fid=93962&ttl=1535794207&ri=8192&rs=8192&setec=4095a8cc9a4dc4f1dccafc1c441114cf"
    },
    {
      "fileId": "1000004139",
      "name": "SkyRealism - ENB Evolved",
      "version": "2.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2653",
      "fileName": "SkyRealism - ENB Evolved-23765-2-3.7z",
      "uploadedUnix": "1358826721",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/07cef3718dfa9a6ab3f4a62de805047a55e2c0f4d755b10411567e512e84bcd6/analysis/1407373207/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20ENB%20Evolved-23765-2-3.7z?fid=1000004139&ttl=1535794207&ri=8192&rs=8192&setec=57ff9ca770dbe4e722d4ace1021bf320"
    },
    {
      "fileId": "1000018535",
      "name": "SkyRealism - ENB Evolved - Vanilla Preset Only",
      "version": "2.5a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1885",
      "fileName": "ENB Evolved-23765-2-5a.7z",
      "uploadedUnix": "1363640119",
      "modVersion": "2.5a",
      "virusScanUrl": "https://www.virustotal.com/file/68e22dafb9f2c5828061080a494d1e31f0e49f965c365ed1b1fe624885644a78/analysis/1407476530/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ENB%20Evolved-23765-2-5a.7z?fid=1000018535&ttl=1535794207&ri=8192&rs=8192&setec=3582e8fbf584994940d75cf414e2e220"
    },
    {
      "fileId": "1000039573",
      "name": "SkyRealism - ENB Evolved",
      "version": "2.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4486",
      "fileName": "SkyRealism - ENB Evolved-23765-2-6.7z",
      "uploadedUnix": "1374188947",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/454cb61e35322dee06a78889fc93b7eecbfc14e10f8dd0f04f8ccdaa3571ac13/analysis/1407648547/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20ENB%20Evolved-23765-2-6.7z?fid=1000039573&ttl=1535794208&ri=8192&rs=8192&setec=10886d3ed9393b0f5d0700c1d08f21bc"
    },
    {
      "fileId": "1000042912",
      "name": "SkyRealism - ENB Evolved",
      "version": "2.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16207",
      "fileName": "SkyRealism - ENB Evolved-23765-2-7.7z",
      "uploadedUnix": "1375299919",
      "modVersion": "2.7",
      "virusScanUrl": "https://www.virustotal.com/file/e5f352bf9cb1b86ff7a56f67535d5bca1b27c6d4940ac58a7788f4913609697a/analysis/1407663326/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20ENB%20Evolved-23765-2-7.7z?fid=1000042912&ttl=1535794208&ri=8192&rs=8192&setec=06b6fddf63713761db9c32da065745b1"
    },
    {
      "fileId": "1000047330",
      "name": "SkyRealism - ENB Evolved",
      "version": "2.73",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16209",
      "fileName": "SkyRealism - ENB Evolved-23765-2-73.7z",
      "uploadedUnix": "1376680698",
      "modVersion": "2.73",
      "virusScanUrl": "https://www.virustotal.com/file/84299ce286c53d3c258d60cc3abfcb4d81f4a1f920496ee5329e3f9b78063b20/analysis/1407684378/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20ENB%20Evolved-23765-2-73.7z?fid=1000047330&ttl=1535794209&ri=8192&rs=8192&setec=b68b36b97b3e69f2e19c656f8724257a"
    },
    {
      "fileId": "1000054769",
      "name": "SkyRealism - ENB Evolved",
      "version": "3.0a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7",
      "fileName": "SkyRealism - ENB Evolved-23765-3-0a.7z",
      "uploadedUnix": "1379036245",
      "modVersion": "3.0a",
      "virusScanUrl": "https://www.virustotal.com/file/6a6fc9029e49ec1994e684fb496cf946a674084c4a16bce74814fef8bb73777c/analysis/1407720737/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20ENB%20Evolved-23765-3-0a.7z?fid=1000054769&ttl=1535794209&ri=8192&rs=8192&setec=8f6465c16316c4040c46524a4ea64e02"
    },
    {
      "fileId": "1000062317",
      "name": "SkyRealism - ENB Evolved",
      "version": "3.0b",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "13",
      "fileName": "SkyRealism - ENB Evolved-23765-3-0b.7z",
      "uploadedUnix": "1381059332",
      "modVersion": "3.0b",
      "virusScanUrl": "https://www.virustotal.com/file/9943e7f5d0bf5afa73f1453de4bff1ce1da3af939277143e9fd48bf5633fbf61/analysis/1407747243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRealism%20-%20ENB%20Evolved-23765-3-0b.7z?fid=1000062317&ttl=1535794210&ri=8192&rs=8192&setec=82eccaf248b9b503d4ebf52fbb29ebd3"
    }
  ]
}