{
  "modId": 23771.0,
  "modName": "skyBirds - Airborne Perching Birds",
  "summary": "Real flying interactive bird actors for Skyrim. New bird models that can sing, hop about, peck, fly dynamically and perch wherever they want. The birds will fly away from enemies, build nests in trees and eat insects. They can be killed and have new alchemy ingredients.",
  "descriptionHtml": "[center][color=yellow]THIS MOD IS EXCLUSIVE TO NEXUS MODS\n<br /> (http://www.nexusmods.com/skyrim/mods/23771?)\n<br />DO NOT COPY THE MOD PAGE, IMAGES, OR UPLOAD THIS MOD ANYWHERE WITHOUT WRITTEN PERMISSION FROM STEVE40\n<br />[color=yellow]THIS MOD MUST NOT BE MONETIZED IN ANY WAY[/color][/color][/center]\n<br />\n<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/51819-1-1408180183.png[/img][/center]\n<br />[center][size=3]by [url=http://skyrim.nexusmods.com/modules/members/index.php?id=3463396#]steve40[/url][/size][/center]\n<br />\n<br />[color=white][size=3]This technically complex mod has been under development for over fourteen months (since Feb 2012). If you would like to provide feedback of any kind, please use the commenting system. This will be the benchmark for further updates.[/size][/color]\n<br />\n<br />[size=5][color=#6495ed]Description[/color][/size]\n<br />\n<br />[color=white][size=3]Real flying interactive perching bird NPCs for Skyrim.\n<br />\n<br />Imagine real actor birds that don't just stand around mutely doing nothing much, but ones that can hop about, chirp, sing and actually fly away as you approach them. Birds that can land or perch dynamically wherever they choose: on logs, rocks, shrubs, signposts, fences, walls, farmhouses. Birds that will eat insects when they're hungry, or build nests in trees, where they will retire to safety at night and in bad weather. And of course, they can be hunted for their useful alchemy ingredients. This is skyBirds![/size][/color]\n<br />\n<br />[size=5][color=#6495ed]Optional Required Mods (v0.931)[/color][/size]\n<br />\n<br />[color=white][size=3]To enjoy all the new features of skyBirds v0.931 the following mods are required:[/size][/color]\n<br />[list][color=white][size=3]\n<br />[*]\"[url=http://skyrim.nexusmods.com/mods/3863]SkyUI[/url]\" for the MCM menu functionality.\n<br />[*]\"[url=http://skse.silverlock.org/]SKSE[/url]\" for the MCM and \"sound injector\" functionality.\n<br />[*]\"[url=http://skyrim.nexusmods.com/mods/17723]Birds of Skyrim[/url]\" plus \"[url=https://www.nexusmods.com/skyrim/mods/72833]Birds of Skyrim - Ruhadre Patch[/url]\" to enjoy the \"injected sounds\" and improvements that skyBirds adds to this.\n<br />[/size][/color][*][color=white][size=3][s]\"[url=http://skyrim.nexusmods.com/mods/11555]Birds and Flocks[/url]\"[/s] or [s]\"[url=http://skyrim.nexusmods.com/mods/25280]Birds and Flocks Hearthfire Edition[/url]\"[/s] \"[url=https://www.nexusmods.com/skyrim/mods/91666]Birds and Flocks - Ruhadre Patch[/url]\" - skyBirds adds some additional script fixes that benefit this mod[/size][/color][color=white][size=3] (note: the new \"Birds and Flocks - Ruhadre Patch\" now supersedes the outdated \"Birds and Flocks - Hearthfire Edition\" and original \"Birds and Flocks\".[/size][/color]\n<br />[/list][color=white][size=3]\n<br />[color=lime]*NEW*[/color] [color=#6495ed][url=http://www.nexusmods.com/skyrim/mods/76065/?]USLEEP Performance Patch[/url][/color] [color=lime]*NEW*[/color]\n<br />\n<br />For those who are concerned about skyBirds being script-heavy, Ruhadre has created a [url=http://www.nexusmods.com/skyrim/mods/76065/?]USLEEP performance patch for skyBirds[/url] that substantially reduces the number of spawn scripts used, which in turn increases game performance and limits the growth in save game size when using this mod on heavily modded or low-end computers.\n<br />\n<br />You might also like to check out [url=http://skyrim.nexusmods.com/mods/10175]skyTEST[/url], which adds farm and wild animals (including more geese and roosters) to Skyrim and improves their AI. If used together with skyBirds, some of the bugfixes in my mod will be applied to skyTEST, such as the clipping feet fix for the chickens, roosters and geese.[/size][/color]\n<br />\n<br />[size=5][color=#6495ed]Mod Features (v0.931)[/color][/size]\n<br />[list][color=white][size=3]\n<br />[*] New fully animated bird actor models: Blue Jay, Cardinal, Tree Sparrow, Wren, Crested Lark, Brown-Chested Martin, Green Woodpecker, Red Headed Woodpecker and Domestic Goose. Also white and barred chickens.\n<br />[*]MCM menu support.\n<br />[*] The birds can hop about, perch on many objects, and FLY DYNAMICALLY (no canned animations).\n<br />[*] Each bird has custom actor sounds. They sing, chatter and call out to their flock just like real birds.\n<br />[*]\"Sound Injector\" for \"Birds of Skyrim\". skyBirds mod adds sounds to ALL of the birds from Quasiermo's \"Birds of Skyrim\" mod if both mods are used together. The roosters will now crow at dusk and dawn.\n<br />[*] Fully interactive: the birds can be killed, they will fly away from predators and they can build nests in trees.\n<br />[*] The birds will retire to their nests at night or in foul weather.\n<br />[*] The birds can perch dynamically on many objects such as trees, logs, plants, rocks and signposts.\n<br />[*] 20 new alchemy ingredients to be collected from dead birds.\n<br />[*] Fixes various bugs related to vanilla hawks/chickens/blackbirds (includes some bugs that USKP does not fix, like fixing the clipping chicken feet problem.)\n<br />[*] Highly optimized mod for zero performance loss. Can be further optimized using the MCM menu.\n<br />[*] Very clean and stable mod - tested clean with TES5EDIT and tested thoroughly for savegame bloat.\n<br />[*] The mods assets are packed in a compressed bsa archive for ease of installation and safe uninstallation. There are no loose scripts to give you problems.\n<br />[/size][/color][/list]\n<br />\n<br />[img]http://static-3.nexusmods.com/15/mods/110/images/51819-2-1408179907.png[/img][color=white][size=3][url=http://bbs.3dmgame.com/forum.php?mod=viewthread&amp;tid=3363128&amp;page=1&amp;extra=#pid64151893]Click here for Chinese version[/url][/size][/color]\n<br />[img]http://static-3.nexusmods.com/15/mods/110/images/51819-3-1408179907.png[/img][color=white][size=3][url=http://skyrim.nexusmods.com/mods/25202]Click here for Russian version (translated by alex_red)[/url][/size][/color]\n<br />[img]http://static-3.nexusmods.com/15/mods/110/images/51819-1-1408179907.png[/img][color=white][size=3][url=http://skyrim.nexusmods.com/download/1000037860]Click here for French-English dual language version (translated by plplecuyer)[/url][/size][/color]\n<br />[img]http://static-3.nexusmods.com/15/mods/110/images/51819-5-1408179673.png[/img][color=white][size=3][url=http://skyrim.nexusmods.com/mods/28821]Click here for Spanish version (translated by xlwarrior)[/url][/size][/color]\n<br />[img]http://static-3.nexusmods.com/15/mods/110/images/51819-4-1408179673.png[/img][color=white][size=3][url=http://skyrim.nexusmods.com/mods/31659/]Click here for Italian version (translated by Siegfriedm)[/url][/size][/color]\n<br />[img]http://static-1.nexusmods.com/15/mods/110/images/51819-1-1408180512.png[/img][color=white][size=3][url=http://skyrim.nexusmods.com/mods/34035/]Click here for German version (translated by endymion81)[/url][/size][/color]\n<br />[img]http://static-3.nexusmods.com/15/mods/110/images/51819-3-1408179673.png[/img][color=white][size=3][url=http://skyrim.nexusmods.com/mods/30497]Click here for Polish version (translated by aragothestel)[/url][/size][/color]\n<br />[img]http://static-3.nexusmods.com/15/mods/110/images/51819-2-1408179673.png[/img][color=white][size=3][url=http://skyrim.nexusmods.com/mods/37652]Click here for Czech version (SKYRIM CESKY - Cesky preklady modu by DropaDred)[/url][/size][/color]\n<br />\n<br />[center][url=http://www.skyrimgems.com][img]https://staticdelivery.nexusmods.com/mods/110/images/51819-0-1488080422.gif[/img][/url][/center]\n<br />\n<br />[color=orange][size=3]Please note that the following videos show an older version of the mod. The current version has many improvements.[/size][/color]\n<br />\n<br />[center][youtube]MU56Ufo9CSU[/youtube] [youtube]CC2oSGJ1Eho#t=125s[/youtube][/center]\n<br />[center][youtube]UWEgwIrUJ_8#t=233s[/youtube] [youtube]PcMUca3qQPE[/youtube][/center]\n<br />[center][youtube]863kUISnAsY[/youtube][/center]\n<br />[color=white][size=3]Featured in Skyrim Mod Sanctuary #46. Thanks to Gopher for the awesome video review! (skyBirds v0.91B shown)\n<br />Featured in Skyrim Mods Series #78. Thanks to Saiodin for the awesome video! skyBirds is at 2:05 (skyBirds v0.91B shown)\n<br />Featured in Skyrim Mods Weekly - Bits'n'Bobs #25. Thanks to Brodual for this excellent video! skyBirds is at 3:53 (skyBirds v0.91B shown)\n<br />Featured in Must Have Skyrim 10 Best Immersion Mods. See 11:43 in the video by Sinitar Gaming. \n<br />[/size][/color][color=white][size=3][url=http://hardforum.com/showthread.php?t=1702302][img]http://static-3.nexusmods.com/15/mods/110/images/51819-1-1408179673.png[/img] Featured in TESV - Skyrim Mods[/url] (under the Atmosphere category)[/size][/color]\n<br />\n<br />[size=5][color=#6495ed]Console Commands[/color][/size]\n<br />\n<br />[color=white][size=3]Console commands are no longer supported. Please use the MCM menu (skyBirds v0.93). If you are using skyBirds v0.92, you will find a list of console commands in the internal Skyrim HELP menu.[/size][/color]\n<br />\n<br />[size=5][color=#6495ed]Changelog[/color][/size]\n<br />\n<br />[color=white][size=3]Click the \"Changes\" icon above to see the changelog.[/size][/color]\n<br />\n<br />[size=5][color=#6495ed]Universal Mod Support[/color][/size]\n<br />\n<br />[color=white][size=3]Are you a moder and want birds to spawn in your custom Worldspace? Add any of the following unmodified vanilla objects to your [u]outdoor[/u] areas, at ground level, where you would like birds to spawn. Make sure to load your mod after skyBirds in your Skyrim load order.\n<br />\n<br />ACTIVATORS:[/size][/color]\n<br />[list][color=white][size=3]\n<br />[*] critterSpawnFirefly24x7\n<br />[*] critterSpawnInsects_Few\n<br />[*] critterSpawnInsects_Many\n<br />[/size][/color][/list]\n<br />\n<br />[color=white][size=3]FLORA:[/size][/color]\n<br />[list][color=white][size=3]\n<br />[*] BirdsNest\n<br />[*] BirdsNest02\n<br />[*] ChickenNest\n<br />[*] FloraCreepCluster\n<br />[*] FloraCreepClusterRock\n<br />[*] FloraSwampFungalPod01\n<br />[*] TreeReachTreeStump01MoraTapinella\n<br />[*] TreePineForestStump01MoraTapinella\n<br />[*] TreePineForestLog01MoraTapinella\n<br />[*]TreeAspenStump01ScalyPholiota\n<br />[*]TreeAspenLog01ScalyPholiota\n<br />[*]TreePineForestStump02BMoraTapinella\n<br />[*]TreePineForestStump02AMoraTapinella\n<br />[*]TreePineForestHollow01BMoraTapinella\n<br />[/size][/color][/list]\n<br />\n<br />[color=white][size=3]Additionally, if you want birds to be able to perch on specific objects, such as on part of a building, then you can place a vanilla critter landing marker at the exact location where you want the bird to perch, and the skyBirds AI will automatically try to perch there (subject to random selection, etc).[/size][/color]\n<br />\n<br />[size=5][color=#6495ed]Normal Installation[/color][/size]\n<br />\n<br />[color=white][size=3]Download and install the mod using NMM, or manually copy the files to Skyrim's DATA folder and activate the mod using the Skyrim launcher. The files that you need to put in your DATA folder are: \"skyBirds - Airborne Perching Birds.esp\" and \"skyBirds - Airborne Perching Birds.bsa\".\n<br />\n<br />The rar archive also includes an optional ini file \"skyBirds - Airborne Perching Birds.ini\", which you can also put in your Skyrim DATA folder. The ini file may improve the performance of the script engine on *some* systems. It might not work for some systems, so if you get poor framerates while using this ini file, please delete it.\n<br />\n<br />Please ensure that your Antivirus scanner is configured not to scan \"TESV.exe\" or \"skse_loader.exe\" (if you use SKSE) as I have found that this can help reduce stuttering and improve performance quite a lot during gameplay.\n<br />\n<br />If you have Papyrus logging enabled, disabling the logs may also improve game performance slightly[/size][/color]\n<br />\n<br />[color=white][size=3]\n<br />After first time installation, you might not see any birds immediately. You need to move around and explore outdoors for the birds to begin spawning.\n<br />\n<br />If you find that the skyBirds seem to glitch or get stuck for a second before taking off, or if you frequently find \"static\" skyBirds, then try using the \"skyBirds - Airborne Perching Birds.ini\" file that is included in the archive. Simply copy this ini file to your DATA folder.\n<br />\n<br />If you occasionally find \"static\" skyBirds (and it is not nighttime, snowing or raining), then just kill them and move on. It's due to a game engine glitch.\n<br />\n<br />Rarely, a woodpecker will become \"static\". Just kill it and move on.\n<br />\n<br />After upgrading this mod, any skyBirds that were in flight might glitch out temporarily (not flapping wings) until they land.[/size][/color]\n<br />\n<br />[size=5][color=#6495ed]Clean Save Upgrading Method[/color][/size]\n<br />\n<br />[color=white][size=3]This is the safest method for upgrading any mod. If you have any issues with the \"normal installation method\", then try this method instead.[/size][/color]\n<br />\n<br />[list][color=white][size=3]\n<br />[*] Load up your savegame and then enter the console (use the tilde [~] key)\n<br />[*] Type \"coc qasmoke\" to teleport to the developer test cell. Nb. don't open, use or pick up any of the stuff in this cell.\n<br />[*] While in the test cell, create a new savegame.\n<br />[*] Enter the console again and type \"qqq\" to quit out of the game.\n<br />[*] Run the Skyrim launcher, go into the \"Data Files\" section and deactivate \"skyBirds - Airborne Perching Birds\" by unticking the box in front of the mod's name.\n<br />[*] Relaunch Skyrim and load your new savegame.\n<br />[*] Create a new savegame.\n<br />[*] Quit Skyrim again\n<br />[*] Install the skyBirds update, overwriting the old files.\n<br />[*] Start the Skyrim Launcher and make sure that skyBirds is enabled in the \"Data Files\" section.\n<br />[*] Launch Skyrim and load your clean savegame.\n<br />[*] Enter the console and type \"coc Riverwood\" to teleport to Riverwood.\n<br />[/size][/color][*][color=white][size=3]Save the game, play, enjoy.[/size][/color]\n<br />[/list]\n<br />[size=5][color=#6495ed]Uninstallation[/color][/size]\n<br />\n<br />[color=white][size=3][u]Normal Uninstallation Method:[/u][/size][/color]\n<br />[list][color=white][size=3]\n<br />[*] Run the Skyrim launcher, go in to the \"Data Files\" section and deactivate \"skyBirds - Airborne Perching Birds\" by unticking the box in front of the mod's name.\n<br />[/size][/color][/list]\n<br />[color=white][size=3]Ignore any related log spam that you might see after uninstalling the mod.[/size][/color]\n<br />\n<br />[color=white][size=3][u]Clean Save Method:[/u][/size][/color]\n<br />[list][color=white][size=3]\n<br />[*] Load up your savegame and then enter the console (use the tilde [~] key)\n<br />[*] Type \"coc qasmoke\" to teleport to the developer test cell. Nb. don't open, use or pick up any of the stuff in this cell.\n<br />[*] While in the test cell, create a new savegame.\n<br />[*] Enter the console again and type \"qqq\" to quit out of the game.\n<br />[*] Run the Skyrim launcher, go into the \"Data Files\" section and deactivate \"skyBirds - Airborne Perching Birds\" by unticking the box in front of the mod's name.\n<br />[*] Relaunch Skyrim and load your new savegame.\n<br />[*] Enter the console and type \"coc Riverwood\" to teleport to Riverwood.\n<br />[*] Create a new savegame. The mod is now cleanly uninstalled.\n<br />[/size][/color][/list]\n<br />[color=white][size=3]Ignore any logs spam that you might see after uninstalling the mod.[/size][/color]\n<br />\n<br />[size=5][color=#6495ed]Compatibility[/color][/size]\n<br />\n<br />[list][*][color=white][size=3]Compatible with Dawnguard, Hearthfire, Dragonborn and Falskaar.[/size][/color]\n<br />[*][color=red][size=3]If you use ASIS you will get CTDs unless you add \"skyBirds - Airborne Perching Birds.esp\" to the Mod exclusion section of the ASIS ini file and add \"_APB_\" to the [NPCExclusions] then re-run the ASIS patcher.[/size][/color][color=white][size=3][/size][/color]\n<br />[*][color=white][size=3] skyBirds is fully compatible with \"Birds of Skyrim\", \"Birds and Flocks\" and \"SkyTEST\". [/size][/color] [color=yellow][size=3]Please load skyBirds AFTER \"Birds of Skyrim\" and \"Birds and Flocks\"[/size][/color].\n<br />[*][color=white][size=3] skyBirds currently won't recognize the \"Birds of Skyrim\" that is built into \"Tropical Skyrim\", so if you want the extra features to work simply rename \"Tropical Skyrim -- Birds.esp\" to \"Birdsofskyrim.esp\" and rename \"Tropical Skyrim --BirdArchive.bsa\" to \"Birdsofskyrim.bsa\" (the Tropical Skyrim version is identical to the regular version of Birds of Skyrim).[/size][/color]\n<br />[*][color=white][size=3] skyBirds is fully compatible with the regular version of 101Bugs. skyBirds should be loaded [u]after[/u] any mod that modifies insect spawners. This includes the \"extra spawns\" version of 101Bugs, unless you want to reduce the number of bird spawners in your game. In the latter case, you can achieve this by loading 101Bugs after skyBirds and it will owerwrite and reduce the number of scripts that skyBirds adds to the game[/size][/color]\n<br />[*][color=white][size=3] The mod \"Static Flora\" will block some of the spawners used in skyBirds. To prevent this, load skyBirds AFTER \"Static Flora\" in your load order. Again, you can load \"Static Flora\" after skyBirds to reduce the number of bird spawner scripts added to the game.[/size][/color]\n<br />[*][color=white][size=3] Compatible with \"Climates of Tamriel - Sound\". Please load skyBirds after \"Climates of Tamriel - Sound\" in your load order.[/size][/color]\n<br />[*][color=white][size=3] Compatible with Sounds of Skyrim.[/size][/color]\n<br />[*][color=white][size=3] If you use \"skyBirds\" and \"Birds of Skyrim\" together then you don't need to use the mod called \"Roosters at Dawn (by schmidte)\" which is obsolete (and seems to be broken anyway). skyBirds adds crowing rooster sounds to Qasiermo's Roosters at dusk and dawn.[/size][/color]\n<br />[*][color=white][size=3] The mod \"Invincible Hawk Fix (by samutz)\" is obsolete (and introduces new bugs). Please uninstall that mod if you use it. skyBirds fixes that bug correctly (so does USKP).[/size][/color]\n<br />[*][color=white][size=3]Mods that change the shape/diameter of tree mesh \"treepineforestdead04.nif\" may cause the woodpeckers to not sit flush against their tree, and nests to be mispositioned or floating in the air. If you use \"Lush Trees and Grass\" [/size][/color][size=3][color=yellow]please delete \"treepineforestdead04.nif\" from your \"DATA/MESHES/LANDSCAPE/TREES\" folder.[/color][/size][size=3][color=white] skyBirds should be compatible with Vurt's Skyrim Flora Overhaul (v1.79e or later) but that could change if Vurt forgets to set his tree mesh bounds correctly.[/color][/size]\n<br />[/list][color=white][size=3]\n<br />Compatibility fix for \"Expanded Towns and Cities\" (removes misplaced nests at Riverwood):\n<br />     1) Open the console.\n<br />     2) Type \"SetStage _APBQuest 10\" (without quotes). You should see the message \"[skyBirds]Deleting dynamic markers...\"\n<br />     3) The nests should be deleted within a couple of minutes or so. You should see the message \"[skyBirds]Dynamic markers have been deleted\".\n<br />     4) Save your game.[/size][/color]\n<br />\n<br />[size=5][color=#6495ed]FAQ[/color][/size]\n<br />\n<br />[color=white][size=3]\n<br />\n<br />Q: There were rumors that this mod is dangerous and can cause save bloat, according to some posts on Reddit and the Dangerous Mods Masterlist. Is skyBirds dangerous?\n<br />A: Absolutely not true and based on misinformation. Nazenn was wrong to mark my mod as \"dangerous\" and didn't test it properly. He has now tested the mod properly and extensively, admitted his mistake and apologized to me. He also updated the [url=https://www.reddit.com/r/skyrimmods/wiki/dangerous_mods_masterlist]Dangerous Mods Masterlist[/url] to reflect that skyBirds IS SAFE. The strong userbase reflects this fact.\n<br />\n<br />Q: I'm using v0.93 and there are tons of roosters at the farms!\n<br />A: Sorry about that. Please update to v0.931, which fixes that bug, then kill any excess roosters you find.\n<br />\n<br />Q: I've just installed this mod but the MCM menu doesn't appear (I'm using SkyUI and SKSE of course).\n<br />A: That's an MCM issue. Simply save and load the game and the menus should appear.\n<br />\n<br />Q: I'm using \"Birds of Skyrim\" and the flying seagulls and crows are invincible. Doesn't skyBirds fix the \"invincible hawk\" bug?\n<br />A: skyBirds fixes the vanilla \"invincible hawk\" bug, but unfortunately Qasiermo intentionally made his flying seagulls and crow models permanently invincible regardless of this bug fix.\n<br />\n<br />Q: I'm using Hearthfire and the hawks that fly above Lakeview Manor are still invincible.\n<br />A: Unfortunately the hawks added by Hearthfire are permanently invincible. They are added using an \"enable parent\" when you start building your house. Any object that has an enable parent cannot be disabled using scripts, so those hawks don't disappear when hit. This was an oversight by Bethesda.\n<br />\n<br />Q: I found some static birds on the ground and they are not animating.\n<br />A: Between about 6pm and 6am the birds try to nest in the nearby trees and go dormant. If they can't find any trees, or there aren't enough trees nearby, the birds will return to their spawn location or a nearby perch location. Usually their hiding place is discrete, but on the rare occasion they might end up \"sleeping\" in plain sight. They will come back to life again in the morning and fly away, so basically it is nothing to worry about.\n<br />\n<br />Q: I'm getting tons of frozen/static skyBirds everywhere. I use ASIS.\n<br />A: add \"skyBirds - Airborne Perching Birds.esp\" to the Mod exclusion section of the ASIS ini file and then re-run the ASIS patcher.\n<br />\n<br />Q: The woodpeckers are spawning like crazy above Bleakwind Basin. How do I disable them?\n<br />A: This is a rare bug due to a glitch in the vanilla game. Open the console and type \"SetStage  _APBQuest  20\" without the quotes. Wait for about 1 minute then save your game.\n<br />\n<br />Q: I sometimes get \"has no 3D\" or \"has no parent cell or no 3D\" errors in the Papyrus log from this mod. Are the errors safe?\n<br />A: Sporadic errors similar to the examples below are caused by cells unloading. They are safe and normal:\n<br />[code]\n<br />[05/09/2013 - 11:38:10PM] Error:  (FF000AD0): has no 3d and cannot have an animation played on it.\n<br />[05/12/2013 - 10:44:56PM] Error: Failed to setup moving reference because it has no parent cell or no 3D\n<br />[/code]\n<br />(the stack dump of \"_APBTestBirdScript01\" with several lines of data usually follows these errors).\n<br />\n<br />Just for the record, I do the test \"If Is3DLoaded() &amp;&amp; GetParentCell()\" frequently in my scripts and yet still get those errors occasionally (although it does reduce the errors a lot), so it is clearly a quirk in the game itself.\n<br />\n<br />If your log is  getting spammed with the following errors in the log:\n<br />\n<br />[code]\n<br />[05/09/2013 - 11:38:10PM] Error: Element of property LandingSites on script _APBTestBirdScript01 attached to (FF001251) cannot be bound because &lt;NULL form&gt; (0100E040) is not the right type\n<br />[05/09/2013 - 11:38:10PM] Error: None or invalid form list passed in to FindClosestReferenceOfType\n<br />[/code]\n<br />(followed by stack dumps of \"_APBTestBirdScript01.psc\")\n<br />\n<br />THAT IS CAUSED BY ASIS. Add \"skyBirds - Airborne Perching Birds.esp\" to the Mod exclusion section of the ASIS ini file and then re-run the ASIS patcher.\n<br />\n<br />Q: My Papyrus log is getting spammed with massive stack dumps and I keep seeing your scripts in the log.\n<br />A: Stack dumps are a dump of ALL scripts that you are running, and is caused by the script engine running out of stack memory. It could be caused by bad Papyrus settings in your ini file; using programs like ENBoost (that mess with the game's memory settings); a badly coded script (ie. script recursion) etc. There's no way to tell which script (if any) caused the dump. Chances are it was not caused by this mod. I've taken particular care to make sure that my scripts don't recurse too deeply. See the following links for more info about Papyrus ini settings and stack overflows:\n<br />\n<br />http://www.creationkit.com/INI_Settings_(Papyrus)\n<br />http://en.wikipedia.org/wiki/Stack_overflow\n<br />http://en.wikipedia.org/wiki/Stack_buffer_overflow\n<br />\n<br />Q: I get one or more of the following type of errors in the Papyrus log:\n<br />\n<br />[code]\n<br />[09/03/2013 - 06:49:43PM] Error: Cannot call GetValue() on a None object, aborting function call\n<br />stack:\n<br />[ (FF001144)]._APBTestBirdScript01.OnUpdate() - \"_APBTestBirdScript01.psc\" Line 196\n<br />\n<br />[09/03/2013 - 06:49:43PM] warning: Assigning None to a non-object variable named \"::temp20\"\n<br />stack:\n<br />[ (FF001144)]._APBTestBirdScript01.OnUpdate() - \"_APBTestBirdScript01.psc\" Line 196\n<br />\n<br />[09/03/2013 - 06:49:43PM] [skyBirds]OnUpdate(): skyBirds mod appears to have been uninstalled. Cleaning up[_APBTestBirdScript01 &lt; (FF001144)&gt;]\n<br />\n<br />[09/01/2013 - 03:27:27PM] Error: Cannot call GetValue() on a None object, aborting function call\n<br />stack:\n<br />   [ (000D31C1)]._APB_Spawner01.OnInit() - \"_APB_Spawner01.psc\" Line 71\n<br />\n<br />[09/01/2013 - 03:27:27PM] warning: Assigning None to a non-object variable named \"::temp0\"\n<br />stack:\n<br />   [ (000D31C1)]._APB_Spawner01.OnInit() - \"_APB_Spawner01.psc\" Line 71\n<br />[/code]\n<br />\n<br />A: That's usually caused by not following the \"clean save upgrade\" or the \"clean save uninstallation\" procedures. The \"Cannot call GetValue()\" code is something that I put in to kill the scripts that get baked into your save after disabling the mod. You get that error but the rest of the script gets shut down. It should be safe. The errors won't necessarily go away if you re-enable the mod, especially if it wasn't deactivated \"cleanly\" in the first place.\n<br />\n<br />Q: I did x and then guards or other NPCs started attacking me. I suspect your mod caused this.\n<br />A: Any mod that adds or modifies factions may make NPCs that belong to those factions hostile towards the birds. You can try using the MCM menu (Advanced page) to reset the factions. Support for mods that add factions (such as Inconsequential NPCs, Falskaar, Immersive Creatures, Monster Wars, SkyTEST, SkyRE, etc) will be added in future updates.\n<br />\n<br />Q: My computer sux. Can you make a version with fewer birds for my sucky computer?\n<br />A: Use the MCM menu to decrease the max number of birds from 60 to about 30.\n<br />\n<br />Q: Your birds are blocking the paths and acting like mini roadblocks.\n<br />A: You're probably confusing my mod with \"Birds of Skyrim\" mod which adds most of the walking birds.\n<br />\n<br />Q: The chickens etc aren't clucking. It is night time/raining/snowing.\n<br />A: I've programmed the birds do be silent at night time or if it is raining/snowing, and also if you are in combat.\n<br />\n<br />Q: It's night time/raining/snowing but the chickens are still making noises.\n<br />A: The chickens won't cluck, but they may squawk if they collide with an actor. Also they can still peck and scratch. Also, you might be using some other mod which adds custom chickens/roosters or alters chicken behavior.\n<br />\n<br />Q: It's night time/raining/snowing but there are still skyBirds flying around.\n<br />A: The birds will try to hide or build nests at night or in bad weather. This feature works best if you slow down the Skyrim \"timescale\" so that time moves more slowly. That gives the birds more time to hide. Default is 20 but I like playing on 5 (5 game minutes take 1 real minute). Use the console then type \"set timescale to x\" where x is the new value. Hint: don't use a timescale lower than 5 it might cause problems.\n<br />\n<br />Q: the birds sometimes fly into clutter and scatter it about. Can you fix this?\n<br />A: Unfortunately no. I tried changing the birds' collision layer to OL_NONCOLLIDABLE (same bugfix that USKP uses for the bees and critters) but it made no difference for collisions with clutter.\n<br />\n<br />Q: the skyBirds sometimes fly through houses and mountains.\n<br />A: That's a game engine/programming limitation.\n<br />\n<br />Q: Where can I find some woodpeckers?\n<br />A: They will be found on certain dead pine trees. Listen carefully for their distinct call and drumming sound. There are a couple of woodpeckers near Anise's cabin opposite Riverwood. You might also find one or two near Riverwood village, and one or two more on certain trees between Riverwood and Whiterun (there are 195 scattered around the whole of Skyrim). NB: after first installing/upgrading to v0.93 it will take about 10 minutes for all the woodpeckers to appear in game.[/size][/color]\n<br />\n<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/51819-2-1408180043.jpg[/img][/center]\n<br />[size=5][color=#6495ed]Credits[/color][/size]\n<br />\n<br />[color=white][size=3]Thanks to macadamstreet for giving me permission to use his Skyrim goose model, with credit to Jc1 for the original mesh and dogtown1 who did the rigging. I'd also like to thank Bellyache for his \"Animal and Creature\" modders' resource pack, from which I used the white and barred chicken textures. Also thanks to zombygeek for his contribution to the new cardinal model and textures.[/size][/color]\n<br />\n<br />[center][color=yellow]THIS MOD IS EXCLUSIVE TO NEXUS MODS\n<br /> (http://www.nexusmods.com/skyrim/mods/23771?)\n<br />DO NOT COPY THE MOD PAGE, IMAGES, OR UPLOAD THIS MOD ANYWHERE WITHOUT WRITTEN PERMISSION FROM STEVE40\n<br />[color=yellow]THIS MOD MUST NOT BE MONETIZED IN ANY WAY[/color][/color][/center]\n<br />\n<br />[size=5][color=#6495ed]Other Mods by steve40[/color][/size]\n<br />\n<br />[size=3][url=http://www.nexusmods.com/skyrim/mods/16981/?]JAWS: Deadly Oceans[/url]\n<br />[img]http://static-3.nexusmods.com/15/mods/110/images/51819-1-1408181948.jpg[/img]\n<br />[/size]\n<br />\n<br />[size=3][url=http://skyrim.nexusmods.com/mods/18466]EZ2C Dialogue Menu[/url]\n<br />[img]http://static-3.nexusmods.com/15/mods/110/images/51819-2-1408180925.png[/img]\n<br />[/size]",
  "categoryId": "83",
  "version": "v0.931",
  "author": "steve40",
  "createdUnix": "1347004169",
  "updatedUnix": "1373281815",
  "containsAdultContent": false,
  "uploadedBy": "steve40",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000029679",
      "name": "skyBirds - Airborne Perching Birds",
      "version": "v0.931",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "68129",
      "fileName": "skyBirds - Airborne Perching Birds-23771-v0-931.rar",
      "uploadedUnix": "1368449411",
      "modVersion": "v0.931",
      "virusScanUrl": "https://www.virustotal.com/file/a2846f2dc84585d672d38c6817176979103ee0d455d4314e2cff0f156e78d8b5/analysis/1407567860/",
      "changelogHtml": " Fixes the \"too many roosters\" spawning bug introduced in v0.93 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/skyBirds%20-%20Airborne%20Perching%20Birds-23771-v0-931.rar?fid=1000029679&ttl=1535794218&ri=8192&rs=8192&setec=6383ced1e54f53a562500beea27464a8"
    },
    {
      "fileId": "1000031194",
      "name": "_skyBirds_Hotfix_v0931a",
      "version": "v0.931a",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "4",
      "fileName": "_skyBirds_Hotfix_v0931a_experimental-23771-v0-931.rar",
      "uploadedUnix": "1369393767",
      "modVersion": "v0.931a",
      "virusScanUrl": "https://www.virustotal.com/file/1950a1e32f943b8cdad5c49f4f89391e20f9bb81cdff6c56195bcb8dd84553c3/analysis/1407579690/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/_skyBirds_Hotfix_v0931a_experimental-23771-v0-931.rar?fid=1000031194&ttl=1535794218&ri=8192&rs=8192&setec=9de9e665f9808b4bfd76b3d4e5cfc677"
    },
    {
      "fileId": "1000037860",
      "name": "skyBirds - Airborne Perching Birds - French English",
      "version": "v0.931a",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "68136",
      "fileName": "skyBirds - Airborne Perching Birds - French English-23771-v0-932.rar",
      "uploadedUnix": "1373281815",
      "modVersion": "v0.931a",
      "virusScanUrl": "https://www.virustotal.com/file/e4445db7344401eb7dd05fc13752b4563943d4122da93ce342875537fcf77550/analysis/1407635205/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/skyBirds%20-%20Airborne%20Perching%20Birds%20-%20French%20English-23771-v0-932.rar?fid=1000037860&ttl=1535794219&ri=8192&rs=8192&setec=1ec569ed6ce6d884b722875bb7a74f04"
    }
  ]
}