{
  "modId": 23782.0,
  "modName": "Code Comparer",
  "summary": "Compare code snippets&#39; efficiency.",
  "descriptionHtml": "Name: Code Comparer (Papyrus)\r<br />\r<br />Thread @ Bethsoft: http://forums.bethsoft.com/topic/1409880-relz-wipz-code-comparer-papyrus/\r<br />\r<br />By: JustinOther (Isaak Mills) and Cipscis (Mark Hanna)\r<br />\r<br />Version: 1.00\r<br />\r<br />Description: This is a utility designed for testing the efficiency of Papyrus snippets in the time honored tradition of Cipscis&#39; Code Comparers for Fallouts. There&#39;s often more than one way to skin a cat, but which way is the most efficient? This tool aims to provide an easy way to measure multiple snippets&#39; speed/efficiency. While the efficiency of any single script or line of code is generally inconsequential, every little bit helps, so cumulatively scripts&#39; efficiency does matter. There are eight empty slots at the top of CodeComparerQuestScript.PSC numbered 0-7. The tests will iterate the inserted code an allotted number of times (default is 10^4 or 10,000 iterations) upon selection from the &#34;Test&#34; submenu, recording the relevant information to %UserName%&#92;Documents&#92;My Games&#92;Skyrim&#92;Logs&#92;User&#92;Code Comparer.log and the associated Profiling logs. If multiple snippets from within the menu before beginning a test, the fastest snippet will be reported. \r<br />\r<br />Requirements: Skyrim v1.6.0.89 or later.\r<br />\r<br />Installation: Unpack the contents of the .7z into Skyrim&#92;Data. Activate Code Comparer.esp when testing.\r<br />\r<br />Uninstallation: Deactivate the plugin and/or delete the associated files.\r<br />\r<br />Other contents:\r<br />\r<br />   Code Comparer.ini: This enables the necessary debug features such as logging, profiling, etc.\r<br />\r<br />   Code Comparer - Purge logs.bat: It&#39;s just a quick way to delete all the .log files that accumulate, making it easier to find your test results and/or clean up your Logs directory after testing.\r<br />\r<br />   Script Logs - Shortcut.lnk: It&#39;s just a shortcut to the script log folder for easy access. You can drop the .bat into the shortcut after installation to store it with the .log files it deletes.\r<br />\r<br />Use: Insert code into the empty slots found in CodeComparerQuestScript.PSC&#39;s SpeedTest function (it&#39;s right up top) and compile. Make sure Code Comparer.esp is set to load with the launcher and load a save, preferably a clean save in an area with little going on. To start tests open Code Comparer&#39;s menu. Depending upon whether SKSE is installed or not, the menu is accessed differently.\r<br />If a sufficiently current version of SKSE is installed: Press and briefly hold R-Shift (key is rebindable from within menu)\r<br />If SKSE is not installed or is an insufficiently current version: You will find an apparel item, [Code Comparer], in your inventory. When equipped, the menu will be prompted.\r<br />Once in the menu, you can choose the &#34;Test&#34; submenu, and select the snippet to test. You&#39;ll see a notification about the test starting and completing along with the time elapsed once a test is complete. This information and more is recorded in the aforementioned logs. By default, tests will iterate 10,000 times, but you can adjust the iterations from within the &#34;Options&#34; submenu. Note that the menu will not come back up until the current test is completed and that there&#39;s no way to cancel the tests for the sake of isolating the snippets and not adding overhead. Taking larger samples will render more accurate results, but be prepared to wait awhile as some tests may take a long time to finish. Note that Code Comparer, in order to increase the accuracy of the results, calibrates itself to offset the overhead of an empty test. Changing the iterations value will prompt recalibration which might take a moment if using higher values.\r<br />\r<br />Profiling: &#34;The profiling log format is as follows:\r<br />\r<br />   &lt;current time=&#34;&#34; in=&#34;&#34; ms=&#34;&#34;&gt;:&lt;tag&gt;:&lt;stack id=&#34;&#34;&gt;:&lt;stack frame=&#34;&#34;&gt;:&lt;self&gt;:&lt;function&gt;\r<br />\r<br />   With &lt;function&gt; being the standard &lt;script&gt;.&lt;state&gt;.&lt;name&gt; format. The stack ID is there to help you separate multiple stacks (threads) in the same log - or to track the same thread through multiple logs, the frame is the current depth of the stack, and the &#34;tag&#34; will be one of the following:\r<br />\r<br />   START - start of logging\r<br />   DONE - end of logging\r<br />   PUSH - function started running\r<br />   POP - function returned\r<br />   QUEUE_PUSH - function was requested to run, but can&#39;t yet\r<br />   QUEUE_POP - function requested to return, but caller can&#39;t resume yet\r<br />\r<br />   So, for example, the amount of time between a QUEUE_PUSH and a PUSH indicates how long the VM had to wait because the object being called was most likely in use by someone\r<br />   else, if you see that a lot you might be over-using the same object and throttling yourself as everyone has to wait their turn to run.&#34; --SmkViper\r<br />\r<br />   Note: If running multiple tests, each test will produce its own Profiling logs. In the first above example, for instance, Script_codecomparerquestscript.0.log correlates with Test #1 while Script_codecomparerquestscript.1.log correlates with Test #0 because Test #1 was run after Test #0 and the most recent log will be the 0. If running multiple tests consecutively, run them in reverse order and the profiling log prefixes will numerically match the tests as listed in the Test function, menu, and TraceUser output provided there aren&#39;t preexisting logs when the game is started.\r<br />\r<br />Rights: We&#39;re lefties. Do ...whatever.\r<br />\r<br />Thanks: Beth for Skyrim and the Creation Kit. SmkViper (Jeff Lundin) for Papyrus and the ever so helpful information regarding profiling. The SKSE Team for enabling the time saving hotkey.",
  "categoryId": "39",
  "version": "1.00",
  "author": "JustinOther and Cipscis",
  "createdUnix": "1347032722",
  "updatedUnix": "1347032816",
  "containsAdultContent": false,
  "uploadedBy": "JustinOther",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86972",
      "name": "Code Comparer v1_00",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Code Comparer v1_00-23782-1-00.7z",
      "uploadedUnix": "1347032816",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/84e85a0dc982557aedc4ee1d8bf2fd151a777caa792f560227c6b3869116cded/analysis/1407151322/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Code%20Comparer%20v1_00-23782-1-00.7z?fid=86972&ttl=1535794237&ri=8192&rs=8192&setec=2da9e6792015f8debf2817d2c4a4635b"
    }
  ]
}