{
  "modId": 23800.0,
  "modName": "New Vamp Plus",
  "summary": "Fleshes out the vamplings Vingalmo has you make. They now count as undead, use vampiric drain, and drop vampire dust on death. They will also become Vampire Lords when you do, if they are your follower.",
  "descriptionHtml": "DESCRIPTION:\r<br />\r<br />When you turned someone at Vingalmo&#39;s behest, the only noticeable change was their red eyes, which were rather subtle.\r<br />\r<br />So, this changes that up a bit: your vamplings now count as bona-fide undead, they&#39;ll use vampiric drain in combat, they drop dust when they die, and they&#39;re privy to all vampiric resistances and weaknesses, including sunlight.\r<br />\r<br />In addition, your new vampiric spouse will turn into a vampire lord when you do, if they’re your follower. Serana will also exhibit this behavior.\r<br />\r<br />Also, I&#39;ve included some functionality that cures your spouse if you&#39;re no longer a vampire (nothing flashy -- they suddenly cease being one). As far as I can tell, if you become a vampire again, Vingalmo will demand you turn them once more.\r<br />\r<br />REQUIREMENTS:\r<br />\r<br />A working copy of The Elder Scrolls V: Skyrim and its expansion, Dawnguard.\r<br />\r<br />INSTALLATION:\r<br />\r<br />Place the contents of the .7z file in your &#34;Data&#34; folder, which is usually located under Steam/steamapps/common/Skyrim.\r<br />\r<br />The ReadMe document and the .bsl file are not required for the mod to run -- you may keep them or discard them.\r<br />\r<br />UNINSTALLATION:\r<br />\r<br />Enter &#34;SetStage PSDLC1VampireTurnImproved 10&#34; into the console (sans quotation marks).\r<br />\r<br />Then delete the included .esp and .bsa file.\r<br />\r<br />The nature of Skyrim’s scripting language, Papyrus, means that, even following this procedure, your Papyrus log will continue to throw errors about missing scripts, potentially leading to save game bloat. There is, lamentably, nothing that I can do about this -- you have been warned.\r<br />\r<br />UPDATING:\r<br />\r<br />Replace all older files with newer versions. If in doubt, replace all mod files with the contents of the latest uploaded archive.\r<br />\r<br />No in-game configuration is necessary.\r<br />\r<br />BUGS:\r<br />\r<br />It does take a few moments for a vampling to update, so be patient. Newly-turned vampires will have access to the weakest vampire drain, though depending on their level, its power can skyrocket, provided you wait (game-time) for the upgrade to happen.\r<br />\r<br />If you&#39;re married to a beast race, upon loading the game, you may find that their eyes are solid black if you&#39;ve turned them into a vampire. This caused by the game loading the human vampire eye texture instead of the beast race eye texture. This can be fixed by saving away from your spouse, quitting, and reloading. In theory, leaving them alone for a long enough time and coming back should also fix it.\r<br />\r<br />As of now, I haven’t figured out a good way to prevent the vampire lord from using their normal spells, but this shouldn’t cause any problems except for looking slightly odd. Also, Harkon’s cape does not flow entirely correctly on the player’s Vampire Lord form, but since it’s hardcoded, there’s nothing I can do about this issue.\r<br />\r<br />COMPATIBILITY:\r<br />\r<br />This should be compatible with practically any mod.",
  "categoryId": "33",
  "version": "1.3.2a",
  "author": "PrinceShroob",
  "createdUnix": "1347059005",
  "updatedUnix": "1416083216",
  "containsAdultContent": false,
  "uploadedBy": "PrinceShroob",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000135429",
      "name": "New Vamp Plus",
      "version": "1.3.2a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "65",
      "fileName": "New Vamp Plus-23800-1-3-2a.7z",
      "uploadedUnix": "1416083216",
      "modVersion": "1.3.2a",
      "virusScanUrl": "https://www.virustotal.com/file/feaad9534f4eca4846cda437ada04995e9d6d76f632922a9c1aaa5b286894435/analysis/1416083283/",
      "changelogHtml": " Edited the script on the Vampire Lord ash pile to match the current version of the Unofficial Skyrim Patch script it was based on <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Vamp%20Plus-23800-1-3-2a.7z?fid=1000135429&ttl=1535794267&ri=8192&rs=8192&setec=591e73d756dbc84226ee133d6795c497"
    }
  ]
}