{
  "modId": 23807.0,
  "modName": "Breaking and Entering",
  "summary": "Teach those pesky locks how a warrior gets past them!",
  "descriptionHtml": "[center][color=Brown][size=6][b]Breaking and Entering[/b][/size]\r\n[size=5]Teach those pesky locks how a warrior gets past them![/size][/color][/center]\r\n\r\n\r\n[youtube]IfeujVhTg_8[/youtube]\r\n\r\n\r\n[center][color=brown][size=4][b]Requirements:[/b][/size][/color][/center]\r\n\r\n-\tSkyrim version 1.7.7.0.6 or later. Previous versions WILL NOT WORK. \r\n\r\n\r\n[center][color=brown][size=4][b]Frequently Asked Questions/Troubleshooting:[/b][/size][/color][/center]\r\n\r\n\tQ: Is <insert random mod here> compatible with this one?\r\n\tA: Yes.\r\n\tQ: I broke the lock on that container/door! Why is the game still telling me it’s locked?\r\n\tA: Because the UI is dumb like that. There isn’t anything I can do to prevent this, but rest assured the lock state is updating even if the UI prompt is not.\r\n\tQ: I’ve installed Skyrim Script Extender! Why is the mod telling me it’s not installed?\r\n\tA: You did not FULLY install Skyrim Script Extender. You can’t just drop the SKSE DLL and the loaders into your game folder anymore; you also need to install everything provided in the Data folder, as well. Otherwise, Papyrus will be unable to access the new functions and the mod will report the “SKSE not installed” error. If you still get the error, make sure you have installed your game outside of the Program Files directory (to avoid issues with UAC) and run SKSE as an Administrator.\r\n\tQ: I have not installed SKSE and I don’t want to. Can I still use your mod?\r\n\tA: Yes, The mod is both SKSE and non-SKSE compatible and which version is used is all handled internally. You don’t need to jump through any hoops.\r\n\tQ: What’s the .BSL file for? It doesn’t do anything in-game.\r\n\tA: It is used by Archive.EXE to record filename data. Without it, if you unpacked the BSA file with Archive.EXE, the filenames would turn to gibberish.\r\n\r\n\r\n[center][color=brown][size=4][b]Overview:[/b][/size][/color][/center]\r\n\r\n\tIs your barbarian tired of fumbling around with itty-bitty bits of metal when what he REALLY wants to do is teach that pesky lock how warriors like to pick them? Well, now his dreams can finally come true. This mod is very small, but very simple: it adds a lock-bash mechanic to the game that is not only simple to use, it can be used anywhere a lock can be found. Be it a treasure chest in a dungeon, the chest in your cellar you lost the key to ages ago, or an object belonging to someone else’s mod entirely. All may be bashed.\r\n\r\n\r\n\r\n[center][color=brown][size=4][b]What\\'s New?:[/b][/size][/color][/center]\r\n\r\n-\t(Fixed Bug) Commanded actors will no longer attack you if you are lock-bashing in front of them.\r\n-\t(Fixed Bug) Only actors with valid Crime Factions will now be considered potential witnesses.\r\n\r\n\r\n\r\n[center][color=brown][size=4][b]Features:[/b][/size][/color][/center]\r\n\r\n[center][color=brown][b]Lock-Bash:[/b][/color][/center]\r\n\tYou can now open locks on both containers and doors by bashing them with your weapon (excluding Bows and Daggers). All you need to do is get up nice and close and start smashing away. Eventually, one of two things will happen:\r\n1.\tYou will hear the click of the lock breaking and the object will become unlocked. You will also receive skill progress for successfully bashing.\r\n2.\tYou will hear a rather alarming smashing sound as you damage the object, and you won’t be able to access it.\r\nIf the latter, the only way to access what was inside/behind the object is if you have the key. Or, you can wait for someone who does have the key to come by and undo the lock.\r\nBe warned, however, the citizens of Skyrim are not going to just let you beat down their doors. It is a crime, and if someone catches you trying to break down someone else’s door, you will be arrested and fined. The bounty is equivalent to an Assault charge.\r\n\r\n\r\n\r\n[center][color=brown][size=4][b]Installation:[/b][/size][/color][/center]\r\n\r\nWrye Bash users: The mod is provided in a BAIN-friendly format so that you may quickly drop it into your Installers folder and install.\r\nNexus Mod Manager users: Nexus Mod Manager will be able to handle the packaging of this mod on its own, you won’t need to do anything fancy. Just convert it into an FOMOD and install.\r\nIf you use none of the above: Just drag and drop the provided files into your Skyrim\\\\Data folder.\r\nUsers of SKSE will have access to some code optimization in the mod, but this mod is fully capable of being used without SKSE.\r\n\r\n[center][color=brown][size=4][b]Uninstallation:[/b][/size][/color][/center]\r\n\r\nWrye Bash users: Very easy, just navigate to the package in your installers tab and choose Uninstall.\r\nNexus Mod Manager: Again, very easy. Just deactivate the mod.\r\nIf you use none of the above: Simply follow the steps for Steam Workshop minus the need to unsubscribe.\r\n[color=red][b]Notice:[/b] This mod is scripted with Papyrus, and uninstalling this mod will leave script debris in your save. There is nothing that can be done about this.[/color]\r\n\r\n\r\n\r\n[center][color=brown][size=4][b]Compatibility:[/b][/size][/color][/center]\r\n\r\n-\tThe only mods that are incompatible are mods that try to add their own lock-bash mechanics to the game:\r\n\r\n[color=red][b]Smash Locks and Lock Doors[/b][/color] (http://skyrim.nexusmods.com/mods/18126)\r\n\r\n-\tThis mod is compatible with everything else, including the official DLC, and requires no patches.\r\n\r\n\r\n[center][color=brown][size=4][b]Recommended Mods:[/b][/size][/color][/center]\r\n\r\nSkyrim Script Extender: skse.silverlock.org\r\n\r\nBrawl-bug plugin: http://skyrim.nexusmods.com/mods/23435\r\n\r\n\r\n[center][color=brown][size=4][b]Known Issues:[/b][/size][/color][/center]\r\n\r\n\tThe Lock state of the containers displayed beneath your crosshair on the UI will not update when you bash a lock or damage the object until you scroll off of the object and back on. This is a bug in the UI, which nothing can be done to address from the Papyrus front.\r\n\r\n\r\n\r\n[center][color=brown][size=4][b]Permissions:[/b][/size][/color][/center]\r\n\r\n- You are free to alter, expand on, or destroy this mod in any way you see fit. If you wish to share your work, however, you MUST contact me and obtain my explicit permission before doing so. Any instances of severe mod destruction will not be eligible for technical support until restored to a functional state.\r\n- Any works that are found to be in breach of the above, the author will receive a single polite request from me to remove it from wherever it is being hosted (from all sites it is being hosted on). Failure to respond within 48 hours will result in more direct action being taken.\r\n- DO NOT upload this mod to any site other than those I have personally uploaded it to without my express permission given. Any user or site found in violation of this will be considered to be stealing intellectual property and will be treated as such. Just because this mod is free does not mean that gives you free reign over what you can do with it. My work, my rules.\r\n- If I fail to respond to your requests to expand or alter this mod within 30 days, you may consider yourself as having my approval to do as you wish, but please note that upload location restrictions still stand.\r\n- Translators: please simply PM me if you wish to translate this mod. If you wish to upload the translated version to one of my current mirrors, you may consider my answer to be “yes” outright. If you wish to upload elsewhere, though, you must obtain my permission to do so. All I wish to know is that the mod is being translated, and anyone who wishes to do so has my approval.\r\n- Compatibility: Please send me a message that you have made a compatibility patch for this mod so that I can be made aware of its presence. You do not need to wait for my permission to release compatibility patches, but I appreciate you informing me of their existence so I can factor for them.\r\n\r\n\r\n\r\n[center][color=brown][size=4][b]Full Changelog:[/b][/size][/color][/center]\r\n\r\n - v1.02: 09/23/2012\r\n\r\n        (Fixed Bug) Commanded actors will no longer attack you if you are lock-bashing in front of them.\r\n\r\n        (Fixed Bug) Only actors with valid Crime Factions will now be considered potential witnesses.\r\n\r\n\r\n - v1.01: 09/09/2012\r\n\r\n        (Fixed Bug) Added extra condition to the Witness Detection for player followers, in case they don’t get added to the PlayerFollowerFaction (example: Serana).\r\n\r\n        (Fixed Bug) Conditionalized the “caught lock-bashing” message so it only appears if you got a bounty for it.\r\n\r\n        (Fixed Bug) Made sure only the Player is capable of lock-bashing.\r\n\r\n        (Feature Change) Adjusted failure chance to be slightly higher.\r\n\r\n        (Other) Brawl-bug plugin support.\r\n\r\n - v1.0: 09/07/2012 \r\n\tInitial Release",
  "categoryId": "24",
  "version": "1.02",
  "author": "Thomas Kaira",
  "createdUnix": "1347065398",
  "updatedUnix": "1348390222",
  "containsAdultContent": false,
  "uploadedBy": "Thomas Kaira",
  "primaryFile": null,
  "files": [
    {
      "fileId": "90023",
      "name": "Script Source v1-02",
      "version": "1.02",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "5",
      "fileName": "Script Source v1-02-23807-1-02.7z",
      "uploadedUnix": "1348389103",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/8c3746cac71a1a8551b8ee06d08ef80040fb807cd037c74b6bede4a43f4f3776/analysis/1407182825/",
      "changelogHtml": " Commanded actors will no longer attack you if you are lock-bashing in front of them. <br/> \n (Fixed Bug) Only actors with valid Crime Factions will now be considered potential witnesses. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Script%20Source%20v1-02-23807-1-02.7z?fid=90023&ttl=1535794278&ri=8192&rs=8192&setec=d827f946aaed372ed692885cb339c2c4"
    },
    {
      "fileId": "90024",
      "name": "Breaking and Entering v1-02",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29",
      "fileName": "Breaking and Entering v1-02-23807-1-02.7z",
      "uploadedUnix": "1348390222",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/b170e98ead2068330cc1afc296b4e6c6bd36e4613e420e1ad5f57d45c17a8e7a/analysis/1407182825/",
      "changelogHtml": " Commanded actors will no longer attack you if you are lock-bashing in front of them. <br/> \n (Fixed Bug) Only actors with valid Crime Factions will now be considered potential witnesses. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breaking%20and%20Entering%20v1-02-23807-1-02.7z?fid=90024&ttl=1535794279&ri=8192&rs=8192&setec=fe7a5a448b83ae7b8c630b3f3c6dcfae"
    }
  ]
}