{
  "modId": 23809.0,
  "modName": "Skyrim Terminus System",
  "summary": "This is a mod for players who prefer not to use the map-marker fast-travelling or carriages, but yet tire of travelling the same Skyrim roads over and over.",
  "descriptionHtml": "======================\r\nSkyrim Terminus System\r\n======================\r\n\r\nThis mod was especially designed for people who don\\'t like to use fast-travelling, but still find it arduous travelling the roads of Skyrim over and over.  It offers a compromise by placing portals in strategic spots while maintaining the integrity of the game for people who don\\'t wish to use the carriages or fast-travelling.  Some of you may recall that we made a similar mod for Nehrim.\r\n\r\nOne nice aspect is that When you use the portals, the travel is instantaneous.  No time passes like it does if you use the map-marker fast travelling. \r\n\r\nFollowers/companions will follow you through the portals, but horses will not.\r\n\r\nThis mod is what I call \\\"moderately lore-friendly\\\".  The portals offer a different building style; But they are no more intrusive into the skyrim style than the Dwemer ruins are. \r\n\r\nEach portal is powered by a \\\"power orb\\\" with magical properties (actually a retextured Sigil Stone).  Unless a power orb is placed in the receptacle, the portal will not function.  You must search out each portal, and then search for a power orb to make it operate.  There is a note at each portal giving clues to where power orbs may be found.  \r\n\r\nPower orbs can be taken from one portal and used in another.\r\n\r\nThere is no quest shown in your journal, nor are there any map or compass arrows to guide you.  But the clues are easy, and finding the orbs shouldn\\'t be difficult.  There is a cheat section at the end of the readme (included in the download) if you wish to bypass this quest aspect and just make the portals operate.\r\n\r\nThe first portal is located at the main four-way crossroads near Whiterun (right across the river from the Honingbrew Meadery).  You don\\'t have to start with this portal, but it\\'s the easiest one to start with. Once you are inside the terminus centre building, the signs above each portal should give you enough of a clue so that you can easily locate the portals in Skyrim.  All portals are next to a main road (or a junction of main roads if possible).  There are eleven portals in Skyrim and one in Blackreach.  The portal in Blackreach is a little harder to find.\r\n\r\nOnce the portals are active, you can travel to and from any portal via the Terminus Centre just like you would through any load door.\r\n\r\n\r\n===========================\r\nINSTALLING AND UNINSTALLING\r\n===========================\r\n\r\nTo install:\r\nUnpack the .7z file with \\\"7-zip\\\" or a similar programme.\r\n\r\nCopy and paste the contents of the mod\\'s data folder into your \\\"...skyrim/data/\\\" folder.\r\n\r\nOr, alternatively,  a compliant mod manager can be used.\r\n\r\nEnable \\\"ACTerminus.esp\\\" in \\\"data files\\\" area of the launcher.\r\n\r\n\r\nTo uninstall:\r\nDelete the files installed in the above procedure from your \\\"...skyrim/data/\\\" folder.  Or use your mod manager if it supports uninstalling.\r\n\r\n\r\n=============\r\nCOMPATIBILITY\r\n=============\r\n\r\nThe mod works fine with Dawnguard.  At this time I know of no incompatibilities.  Anyone who discovers any incompatibilities, please post same to the comments section so others will have a heads up.\r\n\r\n\r\n====\r\nBUGS\r\n====\r\n\r\nOnly one real bug so far that I know of:  The receptacles only accept power orbs; And they only accept ONE power orb.  When you try to place stacked power orbs into a receptacle, the receptacle will accept the one it is supposed to accept and spit the others back out.  But you will have to click \\\"ok\\\" once for each of the orbs spit back out in order to close the popups.  This shouldn\\'t be a major issue as most likely you won\\'t have stacked power orbs in the player character inventory anyway.\r\n\r\nIssue: The steps in the mystery maze (part of the generic dungeon set) near the Winterhold portal have collision problems.  This is how they are in the vanilla game.  To advance the player character up the steps, just jump a little every now and then and you can ascend just fine.\r\n\r\nIssue: Power orbs are affected by Havok physics.  They can roll around.  It is possible (although unlikely) for a creature or character to dislodge one (especially in Blackreach) and have it roll downhill somewhere.  If a power orb is not in its designated location, hunt for it downhill from where it\\'s supposed to be.\r\n\r\n\r\n=======================\r\nCREDITS and PERMISSIONS\r\n=======================\r\nThis mod is completely public domain.\r\nAnyone is welcome to use any part of this mod in any fashion they desire.  No permissions or credits are needed.\r\n\r\nAndrew Clements...General construction and scripting.\r\nNancy Krantz...Texturing and notes.\r\nTravis Moran...Some building materials appropriated from an earlier mod.\r\nBethesda...Game, Creation Kit\r\nA vast horde of forum participants.\r\n\r\n\r\n==========\r\nTOOLS USED\r\n==========\r\nCreation Kit\r\nNifSkope\r\nAutodesk 3DS Max 2012\r\nAdobe Photoshop\r\n",
  "categoryId": "28",
  "version": "1.0",
  "author": "Andrew Clements",
  "createdUnix": "1347066233",
  "updatedUnix": "1347066693",
  "containsAdultContent": false,
  "uploadedBy": "AndrewClements",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87066",
      "name": "Skyrim Terminus System",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22148",
      "fileName": "Skyrim Terminus System-23809-1-0.7z",
      "uploadedUnix": "1347066693",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/dfedf84628c856d6b3640bffefc5046bf1f7bd6e99f8c0aabec1dd7911ecdce3/analysis/1407152242/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Terminus%20System-23809-1-0.7z?fid=87066&ttl=1535794283&ri=8192&rs=8192&setec=21631aa5570d28f3cf8dc7e536b41ffe"
    }
  ]
}