{
  "modId": 23813.0,
  "modName": "Edhildils Skimpy Clothing and Armor",
  "summary": "Skimpy sexy Edhildil Armor",
  "descriptionHtml": "Edhildils Skimpy Clothing and Armor\r\nAuthor: Edhildil\r\n07,20,2012\r\nver1.2 beta (updated)\r\n\r\n[img]http://img856.imageshack.us/img856/872/pagelogoy.jpg[/img]\r\n\r\nPlease read the whole description before you comment.\r\n\r\n\r\n[img]http://img832.imageshack.us/img832/1236/descriptionn.png[/img]\r\n\r\nThis is a female clothing and armor replacer, it will change most of the armor, robes, and some clothing in your entire game into skimpy, sexy, bodacious hot stuff. The body is based off of Caliente\\'s CBBE mod, and you\\'ll need that first (see requirements).  \r\n\r\nThe lowerbody has been enhanced in the derrier region (buttock)\r\nfor a fuller, rounder profile. The waist is somewhat thinner.\r\nThe breasts are lifted and slightly rounder (large).  \r\n \r\nI only made one size so the sliders will not work (sorry).\r\nIf you liked my DMRA mods for Oblivion you should like this mod too.\r\nI did not add bouncing boobs or butt though.\r\n\r\nBandit, Daedric, Dark Brotherhood, Dragonbone, Dragonscale, Draugr, Dwarven, Ebony, Ebony Mail, Elven, Falmer, Glass, Hide, Imperial, Iron, Nightingale, Orcish, Savior\\'s Hide, Steel, Steel Plated, Studded, Theives Guild, Tullius, and Wolf armors, all skimpy.\r\n\r\nBarkeeper, Chef, Hammerfell Garb, Jester, Archmage, Mage Apprentice, Monk, Necromancer, Warlock, Forsworn, Mythic Dawn, Mage Journeyman clothing, Thalmor Robes, all mostly skimpy. \r\n\r\nSome of the items share meshes such as Hammerfell and Redguard garb, Tullius and Penitus Oculatus etc. The robes do the same.\r\n\r\n[img]http://img84.imageshack.us/img84/3664/updatesb.png[/img]\r\n\r\n11,19,2012: v1.2: \r\n\r\nfixed the gaps in the the neck, wrists and ankles by changing vertices locations to match femalebody_0. I will not make a smaller size, that would require a complete redo and my pupils are already square from working on this. If you got the old version just download and reinstall.\r\nI plan to add proper dismemberment and bounce to the next update, this may take some time.\r\n\r\nOptional nude body file added. Note: Im not sure if beast textures will work as Argonian seemed to have invisible area around the hips, I don\\'t know about Khajit, I didnt see these textures included in CBBE.\r\n\r\nBBP\r\n=====================\r\n\r\n See usage below.\r\n\r\n\r\n[img]http://img651.imageshack.us/img651/4153/requir.png[/img]\r\n\r\n\r\nCalientes CBBE body mod installed and running in your game.(textures)\r\n\r\n[img]http://img163.imageshack.us/img163/6344/suggesth.png[/img]\r\n\r\n \r\nCalientes_Vanilla_Armor_--__Combined_Pack_v2 \r\n\r\nEdhildils Argonian CBBE Skin Texture\r\n\r\nVHH_walk\r\n \r\n[img]http://img827.imageshack.us/img827/2482/installa.png[/img]\r\n\r\nif you use Calientes_Vanilla_Armor_--__Combined_Pack_v2, install it first\r\nbefore you install this mod; in other words, install my mod AFTER caliente\\'s.\r\n\r\nUnzip Data file to a temporary location \r\nCheck folder paths and make adjustments if needed\r\ncopy/paste into Skyrim folder.\r\n\r\n[img]http://img194.imageshack.us/img194/9223/bugske.png[/img]\r\n\r\nusing Caliente Tools after installing this mod may replace the meshes\r\nfrom this mod, but i\\'m not sure. It just seems like it may overwrite\r\nthese meshes. That\\'s why you install this mod after caliente\\'s.\r\n\r\nEven though I thought I got the Skyrim supported version of NifSkope,\r\nit will not show me the dismemberment vertices, so I may have the \r\ndismemberments off, but, alot of the arms and legs are bare, so it \r\nshouldn\\'t be a big deal, some boots clip*, I will fix this when\r\nI can figure out the dismemberment vertices, thus, it is beta.\r\n\r\n*Wearing Daedric boots with the Hammerfell and Redguard garb made \r\nthe boots invisible in my testings, but Redguard boots were displayed fine. \r\n\r\nI didn\\'t make first person meshes, so there is some incontinuity ( I play\r\nit this way all the time and I barely notice), my sleeveless armors may have\r\nsleeves in first person, in other words. \r\n\r\nSome poses/ animations may slightly clip. Some greatswords will clip \r\ninto the round butt. If I could only rotate the weapon node in the skeleton...\r\n\r\n[img]http://img443.imageshack.us/img443/9233/uninstall.png[/img]\r\n\r\nYou can delete all the clothing and armor folders included in my mod from your data files. mine is:\r\n \r\nC:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\meshes\\\\armor:\r\n\r\nbandit, blades, daedric, dbarmor, dragonbone, dragonscale, draugr, dwarven,ebony, ebonymail, elven, falmer, generaltulius, glass, hide, imperial, iron, nightingale, nordplate, orcish, savior\\'shide, sons of talos, steel, studded,thievesguild, wolf\r\n\r\nC:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\meshes\\\\clothes\r\n\r\narchmage, barkeeper, chef, jester, forswornarmor, mageapprentice, magejourneyman,monk, necromancer, robemythicdawn, thalmor, warlock\r\n\r\nYou can also use this as a guide if you just want to replace a few of the \r\narmors in your game by copying the appropriate folder, say you just want iron armor from this mod, you would copy:\r\n\r\nData\\\\meshes\\\\armor\\\\iron\r\n\r\nand then paste that folder in your game data, mine is default, which is:\r\n\r\nC:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\meshes\\\\armor\r\n\r\nThat means copy/paste the \\\"iron\\\" folder from this mod into the \\\"armor\\\" folder on your computer.\r\n\r\nI would do more of the standard clothes but I like using Caliente\\'s\r\nVanilla Armor TownspersonPack for this.\r\n\r\n[img]http://img90.imageshack.us/img90/8579/creditslo.png[/img]\r\n\r\nCaliente for CBBE\r\nEdhildil (these new meshes)\r\nBethesda (original meshes)\r\n\r\nTools used:\r\n=======\r\nBlender\r\nNifscope\r\n\r\n\r\nThanks to all above and to Skyrim Nexus.\r\n\r\n[img]http://img4.imageshack.us/img4/4562/usaget.png[/img]\r\n\r\nIf you want to use my meshes in your mod please give the proper credits listed in your mod readme/description. It would also be nice if you sent me a link so I can check out your mod. I tried to convert to BBP but failed. I now give permission for anybody to convert to BBP, as my efforts seem fruitless. I really like the way TBBP functions, and would like to see animators incorporate Buttock Bounce at least in the Forward Walk animation like I made for Oblivion.  Enjoy!\r\n\r\n\r\n",
  "categoryId": "54",
  "version": "1.2",
  "author": "Edhildil",
  "createdUnix": "1347075753",
  "updatedUnix": "1353948371",
  "containsAdultContent": true,
  "uploadedBy": "Edhildil",
  "primaryFile": null,
  "files": [
    {
      "fileId": "101316",
      "name": "Edhildils Skimpy Clothing and Armor v1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7441",
      "fileName": "Edhildils Skimpy Clothing and Armor v1_2-23813-1-2.7z",
      "uploadedUnix": "1353727420",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/51c4a8bb74c863289362509a755a3f4dcc021601c1ab1fa7a7a8259fc6cb9103/analysis/1407275241/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Edhildils%20Skimpy%20Clothing%20and%20Armor%20v1_2-23813-1-2.7z?fid=101316&ttl=1535794295&ri=8192&rs=8192&setec=d48b63dce32bd4f39a49fc9df966e4f3"
    },
    {
      "fileId": "101777",
      "name": "Edhildils nude body",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "136",
      "fileName": "Edhildils nude body-23813-1.7z",
      "uploadedUnix": "1353948371",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/52165cf4ad4491bf30d1f1fb215ea966ad737c7ebec7c5e4f596448c5b7eb7c8/analysis/1407279065/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Edhildils%20nude%20body-23813-1.7z?fid=101777&ttl=1535794295&ri=8192&rs=8192&setec=7dbf0e636d1dfe8aac5d37b394141cf3"
    }
  ]
}