{
  "modId": 23817.0,
  "modName": "Undies Underneath for Skyrim",
  "summary": "The aim of Undies Underneath is to provide a bridge between being totally naked when you take off your gear and being unable to ever be completely naked at all and to blend the new systems in as (almost) seamlessly as if the game were designed that way.",
  "descriptionHtml": "Name: Undies Underneath for Skyrim\n<br />Author: popcorn71\n<br />\n<br />\n<br />\n<br />\n<br />[heading][size=6][color=red]Beta and general Warnings[/color][/size][/heading]\n<br />In case the version number didn't give it away this mod is still in 'beta' status. It SHOULD be safe for normal game play. Just remember to backup your saves just in case something goes horribly wrong. Also minor bug and oddities are to be expected. Feel free to report any bugs, give suggestions or constructive criticism in the comments section but remember that I mod first and foremost for myself.\n<br />\n<br />This mod is intended for \"[u]experienced[/u]\" to \"[u]advanced[/u]\" mod users [b][i][u]ONLY[/u][/i][/b]. Some knowledge of general mod use and utilities is expected. At the very least you will need to know how to install/uninstall mods using [url=http://skyrim.nexusmods.com/mods/1840]Wrye Bash[/url] and a base understanding of Skyrim/data folder file structure. Do NOT attempt to install this with Nexus Mod Manager as I am not and will not support it until it is out of beta. A working knowledge of how and why clothing and body mods work is REQUIRED.\n<br />\n<br />And above all else think before you post. I see enough idiocy on this sight as it is and will not tolerate it in the comment thread.\n<br />\n<br />If you do not agree with any of the above statements then I'm sorry but this mod is not for you.\n<br />\n<br />\n<br />\n<br />[heading][size=6]Requirements[/size][/heading][list][*]Skyrim v 1.7.7.0 or greater\n<br />[*][url=http://skse.silverlock.org]SKSE[/url] v1.7.3 or greater.\n<br />[*][url=http://www.nexusmods.com/skyrim/mods/58705/?]PapyrusUtil[/url]\n<br />[*]A nude body replacer for both males and females. This isn't technically a requirement for using this mod but it would kind of defeat the purpose using it with a non nude body.\n<br />[/list]\n<br />\n<br />\n<br />[heading][size=6]Description[/size][/heading]\n<br />Based on my earlier Oblivion mod [url=http://oblivion.nexusmods.com/mods/15767]Undies Underneath[/url]\n<br />\n<br />Have you ever used a body replacer and though to yourself 'Hmm... do I want my characters to have their underwear permanently welded to their body, or would I rather make them suffer from horrible chafing every time they put on that Daedric Armor' ?\n<br />\n<br />The aim of Undies Underneath is to provide a bridge between being totally naked when you take off your gear and being unable to ever be completely naked at all and to blend the new systems in as (almost) seamlessly as if the game were designed that way.\n<br />\n<br />I have designed this mod to intuitive. That is to say, there are no menus, dialog, or spells that need to be cast for this mod to work. It quietly does its business in the background without requiring any input from the player. If a character has underwear in their inventory they will wear it. If said character uenquips an item that is covering their underwear then the character will be seen in their underwear. If said underwear is Unequipped the character will be naked. Simple enough right?\n<br />\n<br />\n<br />\n<br />[heading][size=6]Body replacers with built in support[/size][/heading]\n<br />These body types have built in, out of the box support. If you use one of these then you don't need to install anything else to use this mod to work.\n<br />\n<br />Females:[list][*][url=http://skyrim.nexusmods.com/mods/2666]CBBE[/url] (I only support Curvy, Slim, and Vanilla variants. Your on your own if you use a Body Slide variant.)\n<br />[*][url=http://skyrim.nexusmods.com/mods/6709]DIMONIZED UNP female body[/url]\n<br />[/list]\n<br />\n<br />Males:[list][*][url=http://skyrim.nexusmods.com/mods/2488]Better males - Beautiful nudes and faces - New hairstyles[/url] ('Official' variants should work as they alter the skeleton only.)\n<br />[*][url=http://www.loverslab.com/topic/23944-sos-schlongs-of-skyrim/]SOS - Schlongs of Skyrim[/url] lite, default or body builder. Currently incompatible with SoS Full due to scripting complication.\n<br />[/list]\n<br />\n<br />Additional Note:\n<br />Default vanilla bodies are supplied as a fail safe to prevent missing mesh errors. As such vanilla\n<br />bodies are technically supported but NOT recommended, as using them would defeat the entire point of\n<br />using this mod. Consider switching to one to the above mentioned bodies.\n<br />\n<br />To use a body not listed above you will need to:[list=1][*]Download and install Undies Underneath for Skyrim as detailed in the 'Install' section.\n<br />[*]Download and install the desired body nude version.\n<br />[*]Download the desired bodies 'none nude' version.\n<br />[*]Open the archive and navigate to Meshes/Actors/Character/Character Assets folder and copy/extract any *body_0.nif and *body_1.nif files to Skyrim/Data/Meshes/UndiesUnderneath/DefaultItem folder.\n<br />[*]It may be necessary to also copy the texture files into your Skyrim/data folder.\n<br />[*]Overwrite when asked.\n<br />[/list]\n<br />\n<br />\n<br />[heading][size=6]Install[/size][/heading]\n<br />For [url=http://skyrim.nexusmods.com/mods/1840]Wrye Bash[/url], just allow the wizard to walk you through the process and then activate Undies Underneath.esp. For manual install, see 'Package Descriptions' section in the readme for details on the file structure. Beyond that I will not be providing ANY further support for manual installation. Do NOT attempt to install this with Nexus Mod Manager as I am not and will not support it until it is out of beta.\n<br />\n<br />\n<br />\n<br />[heading][size=6]Uninstall[/size][/heading][list=1][*]Deactivate any esp files that add or change existing items into UU items.\n<br />[*]Start your game then save and quit.\n<br />[*]Uninstall with Wrye Bash or Nexus Mod Manager.\n<br />[*](Mostly Optional) Run you save through a save game script cleaner like [url=http://www.nexusmods.com/skyrim/mods/52363/?]Save game script cleaner[/url].\n<br />[/list]\n<br />\n<br />\n<br />\n<br />[heading][size=6]Upgrading to a new version[/size][/heading]\n<br />Before updating from v0.92.00 or older, find an interior cell without any NPCs in it and save there then preform a clean install. If you don't do this [color=red][b]THE GAME WILL CRASH[/b][/color] when you try to load the save! \n<br />\n<br />\n<br />\n<br />[heading][size=6]Incompatibility[/size][/heading][list][*]Frostfall gives underwear the same amount of coverage as other body clothing items.\n<br />[/list]\n<br />\n<br />\n<br />[heading][size=6]Known Issues or Bugs[/size][/heading][list][*]Actors model won't update if they are currently mounted and their inventory is open. This is an issue with SKSEs QueueNiNodeUpdate() Function. Nothing I can do about it. This is a visual bug only. Internally every thing works as intended.\n<br />[*]While looting the closes of NPCs with undies, if you take clothing that has underwear under it their body will disappear while in the menu.\n<br />[*]If you unequip clothing on your character that covers up underwear while in 3rd person, you will get a very brief glimpse of the naked body while the Skyrim thinks about weather or not it wants notify the script engine that it should do stuff. This delay is usually less then a quarter of a second.\n<br />[*]The games AI doesn't know how to use Undies Underneath items. I have safeties in place but some strange behavior can be expected in things like scripted events.\n<br />[*]Scripts may not process fast enough on low end computers or based on Papyrus work load, leading to unintended effect. Some further optimizations will come a development continues, but there isn't a lot I can do about this. The current implementation is optimized for actors that have less UU Items equipped. The amount of slots taken up by each UU Item adds a little script overhead but not nearly as much as having a large amount of UU Items equipped on an actor. That said, all the heavy lifting is done in events. The only script that runs continuously in the background is P71_UU_Alias_Player which preforms a small handful of operations every few seconds to manage a cloak effect on the player which has also been optimized with some simple effect conditions to only run on actors that haven't been setup yet.\n<br />[*]Using the Resurrect console command on an actor with UU Items causes errors in the papyrus log.\n<br />[*]Loading a save made immediately after changing cells may cause errors. Some of these errors may not be accounted for.\n<br />[*]This mod absolutely SPEWS out debug information to the papyrus log. If you think that the mod if functioning normally that keep the debug setting in the MCM Menu off.\n<br />[/list]\n<br />\n<br />\n<br />\n<br />[heading][size=6]Tools Used[/size][/heading]\n<br />Creation Kit\n<br />Notepad++\n<br />TES5Edit\n<br />\n<br />\n<br />\n<br />[heading][size=6]Contact[/size][/heading]\n<br />The best way to reach me is by PM on the Nexus.\n<br />I also check the comments section regularly, so chances are good I will see and respond to feedback\n<br />as needed in a few days.",
  "categoryId": "28",
  "version": "0.92.06",
  "author": "popcorn71",
  "createdUnix": "1347081818",
  "updatedUnix": "1460344909",
  "containsAdultContent": true,
  "uploadedBy": "popcorn71",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000202691",
      "name": "Undies Underneath",
      "version": "0.92.06",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3117",
      "fileName": "Undies Underneath-23817-0-92-06.7z",
      "uploadedUnix": "1460344909",
      "modVersion": "0.92.06",
      "virusScanUrl": "https://www.virustotal.com/file/238657a24de728a339a6359c8ba3289d815ddfc5fc03881d6079d66b56d0a1fb/analysis/1460344926/",
      "changelogHtml": " Added Calves and Forearms to the armoraddon and tweaked male meshes so that male item appear properly. <br/> \n Removed femalebodyastrid_0.nif and femalebodyastrid_1.nif from the archive. They wern&#39;t being used. <br/> \n Somehow the default female underwear had lost its vertex colors and was being displayed compleatly black. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Undies%20Underneath-23817-0-92-06.7z?fid=1000202691&ttl=1535794300&ri=8192&rs=8192&setec=5638911545e8dda8270cd429fbe5f794"
    }
  ]
}