{
  "modId": 23828.0,
  "modName": "Adabala Building System - Ayleid Transfusion",
  "summary": "This is a LEGAL Ayleid/Aldmeri building asset or modder&#39;s resource for Skyrim. Its purpose is to be able to build up the classic Ayleid architectures in Skyrim. ",
  "descriptionHtml": "UPDATED : 2017-10-01\r<br />\r<br />Hi there.\r<br />\r<br />When Skyrim came out I hated it. Then I began to like it for its better gameplay. Then I felt the whole game to be so empty and dark unlike its predecessor. I made a two custom palace mods for Oblivion, they&#39;re the Adabala episodes. I planned the third one when the idea came:\r<br />\r<br />It should be done under Skyrim. Better engine, better lighting, blah blah.. why not? So I began to think about what can I do. The only way were the complete remodeling of every piece from scratch because of Beth&#39;s well known asset rules. I decided to take this challenge with my poor modeling skills not to speak about working with NIFs, what I hated already when modding Oblivion. So I went deep in modeling in autodidact way. The result is here. \r<br />\r<br />Q&A\r<br />******\r<br />Q: What is it?\r<br />A: Altought there is a functional esp plugin, it isn&#39;t a mod literally. It is a resource pack for modders. Its purpose is to build up Ayleid buildings in TESV:Skyrim without any legality problems. You can build up all existing variations of classic Ayleid estates known from TESIV:Oblivion including the Camoran&#39;s Palace.\r<br />\r<br />Q: It is now complete?\r<br />A: Yes and no. We now have all elements that Oblivion already carries but the two statues are missing. Yet. I&#39;m working on them (in parallel with other expansions) but they&#39;re slightly hard for me so I need a few level ups in Max to make them perfect.\r<br />\r<br />Q: It is a port?\r<br />A: No. It is not a port. Everything is remodeled from the scratch by my hands and with a Gmax. It is 100% legal. If someone wants to ban this asset (or me) and he/she needs proof, I have every Max scenes, OBJs, collision frames, whatever.\r<br />\r<br />Q: It has an esp file. It has bugs? It is intended to be a playable mod?\r<br />A: No&#33; Loriath.esp is NOT intended for regular gameplay unless you know what are you doing&#33; Loriath.esp is intended as a demonstration plugin to show the possibilities of this asset to other modders. Nothing more. Loriath.esp were NOT CLEANED therefore it may be dirty: It alters a large landmass, it displaces (but NOT deletes) a few markers, it deletes/replaces a lot of scenery elements and land textures. I don&#39;t think it will cause problems but I warned you.\r<br />\r<br />Q: I noticed bugs.\r<br />A: I love you. See something? Say something&#33; I&#39;ll fix it.\r<br />\r<br />Q: I noticed errors in Ck when try to snap elements to each other.\r<br />A: Known issue. You have to set rotation angle to 15deg. If you want to create a chain of objects: you need to drop the first one-&gt;cloning/placing it-&gt; grab the chain then continue the work. I really don&#39;t know why this happens but there is a working workaround so I don&#39;t care about it. Tiling system is the same as in Oblivion.\r<br />\r<br />Q: Textures are ugly.\r<br />A: Textures are simple and clean. and I have NO any knowledge about how to create good textures. Yet. Textures noticeably larger than necessary. Main set cleaned and recompressed but JG&#39;s ones still untouched as they will be replaced with custom ones. Until then, current ones will doing well.\r<br />\r<br />Q: Where is Interiors?\r<br />A: They&#39;re still deep in the lands of Oblivion and you can take it literally:) Originally, I planned only the exteriors what is done now. Interiors are too much work for now. Take a look at this thread sometimes for latest advances if there will be any.\r<br />\r<br />Q: Loriath is invisible, help me&#33;\r<br />A: Earlier release had this issue. Make sure that you downloaded and installed the LATEST pack which currently is 1.3. Copy everything to its right place and you&#39;re okay. If not, ask in the thread.\r<br />\r<br />Q: There will be any future expansions?\r<br />A: Yes&#33; We will have everything to build up a complete elven city including the original White Gold Tower, more complex estates, citizes dwellings, peasant&#39;s huts and so on. It will be a tremendous work. It is in progress already. \r<br />\r<br />Q: It is true that Robocop will come after me if I don&#39;t want/forgot to endorse?\r<br />A: Yes. He is watching the downloads and endorsements. If someone is missing it, there will be trouble:)\r<br />\r<br />Here is a short video review about Ayleid Transfusion.\r<br />\r<br />[youtube]F4bsBK85Nkg[/youtube]\r<br />\r<br />** Credits ** \r<br />\r<br />Now comes my part.\r<br />\r<br />Credits and my BIG thanks go to the following people:\r<br />\r<br />- Elinen : For her nice textures and help.\r<br />- Jgreybear : For his original JGAyleid textures. This asset&#39;s texture set is based on of it.\r<br />- Tamira : For important knowledge about working with NIFs.\r<br />- JonWD7 : For his valuable comments and advices.\r<br />- DirkDuggler : For his short but more important advices in collisions.\r<br />\r<br />And for others who helped me with inspiration and friendly words.\r<br />I thank for all of you.\r<br />\r<br />** Rules. **\r<br />\r<br />My work, my rules - as Sheogorath would say:)\r<br />\r<br />- You CAN use the asset as you want, no need any permission from me, I only require things mentioned below\r<br />- You CAN ALTER IT as you want by any means BUT please inform me what you&#39;ve done, and drop a few words into the thread.\r<br />- You can&#39;t use it for commercial purposes without my permission.\r<br />- You can&#39;t upload/spread it outside TESNexus without my permission.\r<br />- I can&#39;t take any responsibilities for any damages you caused by using it.\r<br />\r<br />- You can&#39;t derail blue trains with it without my permission.\r<br />- You can&#39;t use it to launching torpedoes agains nuclear driven submarines with my permission.\r<br />- Don&#39;t eat it. Especially when you&#39;re driving.\r<br />- Don&#39;t give it for a real ayleid since they don&#39;t have computers and they don&#39;t need a virtual asset as they have real ones and they would surely dislike it and because they will cut you for eight pieces, you can see, they killed Pelinal but not for his deeds, noooooo, he tried use this asset to overpower ayleids but he failed so if you don&#39;t want to die never give it for a real ayleid especially not such a mad one like me and...\r<br />- Where are my pills...\r<br />- ...\r<br />But the first 5 is still important&#33; Really&#33;\r<br />\r<br />**** And for last words.\r<br />If you use this asset in your works I require the following things:\r<br />\r<br />- An endorsement.\r<br />- A picture to the User Gallery on Nexus.\r<br />- Proper crediting.\r<br />\r<br />I think they&#39;re not too difficult operations.\r<br />\r<br />Well, we done. Thanks for attending to me.\r<br />\r<br />Regards\r<br />Varlais aran ae Wendirae.",
  "categoryId": "82",
  "version": "V1.3",
  "author": "Varlaisaran",
  "createdUnix": "1347107609",
  "updatedUnix": "1355480979",
  "containsAdultContent": false,
  "uploadedBy": "varlaisaran",
  "primaryFile": null,
  "files": [
    {
      "fileId": "105112",
      "name": "AyleidTransfusion13",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "118783",
      "fileName": "AyleidTransfusion13-23828-1-3.zip",
      "uploadedUnix": "1355480979",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/a509019477ad5e30116d7542a94dd0c50d355063e3ec0d8ac39d7c804b5abfa3/analysis/1407303881/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AyleidTransfusion13-23828-1-3.zip?fid=105112&ttl=1535794313&ri=8192&rs=8192&setec=1d2f07a86c580c9ec35762fb22323a2f"
    }
  ]
}