{
  "modId": 23821.0,
  "modName": "Betrayer of Dwarves",
  "summary": "This mod intends to tell a story (not yet implemented) about a dwarf who inadvertently destroyed all dwarves in existence. The story tells of an experiment, an acident and the label of betrayer!.",
  "descriptionHtml": "the location of the dungeon is in the screenshots above\r\n\r\nThis mod is my first large undertaking and is still very much a work in progress.\r\n\r\nv0.0.3\r\n\r\nOk, I have added several new external locations to the mod which will serve as part of the story in future versions. There is currently a mysterious cave outside riften which goes to my new area. The area is still muchly a work in progress and very buggy and incomplete. \r\n\r\nNew area outside of Riverwood, cave leads to nothing so far as I am working on other areas of the project at this time.\r\n\r\nv0.0.1\r\n\r\nThis mod intends to tell a story (not yet implemented) about a dwarf who inadvertently destroyed all dwarves in existence. The story tells of an experiment, an acident and the label of betrayer!.\r\n\r\nSo what\\'s in this version?\r\n\r\nAt this point in time I have completed (not counting the empty room which will be used for quest stuff) level 1 of the first dungeon intended to be included in the mod (a total of 10 or more planned) it includes a new type on ignot and a book that will teach a smithing recipie. this level of this dungeon has a very deadly trap which you will be rewarded for avoiding in a future version.. \r\n\r\nPlease comment on the mod if you use it!!!\r\n\r\nAt this point there are no rewards for completing this level of the dungeon other then a dwarven crossbow and some bolts.\r\n\r\nThis is an early version of the mod and as such does not contain too much, the uploading of the mod is to guage peoples reaction to the undertaken style of the dungeons so that I will know to change my style a lot of just add some tweaks",
  "categoryId": "88",
  "version": "0.0.3",
  "author": "Lynix112",
  "createdUnix": "1347098558",
  "updatedUnix": "1347098746",
  "containsAdultContent": false,
  "uploadedBy": "lynix112",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87114",
      "name": "Betrayer",
      "version": "0.0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1145",
      "fileName": "Betrayer-23821-0-0-3.rar",
      "uploadedUnix": "1347098746",
      "modVersion": "0.0.3",
      "virusScanUrl": "https://www.virustotal.com/file/1bdbb1599e53e93c5c1f6c5d81ddb5180d8b49e3f1e2f68edbbab019dfaef758/analysis/1407152827/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Betrayer-23821-0-0-3.rar?fid=87114&ttl=1535794305&ri=8192&rs=8192&setec=57ee0b901c3668efb31b6962945ac1ac"
    }
  ]
}