{
  "modId": 23837.0,
  "modName": "Castlevania Memories First Episode - Chinese Version",
  "summary": "This is the Chinese translated version of the original Castlevania Memories First Episode.",
  "descriptionHtml": "This is the Chinese translated version of the original Castlevania Memories First Episode.\r\nOriginal page:http://skyrim.nexusmods.com/mods/23428\r\nAll credit to the original author LordKarnak. \r\n\r\nIntroduction\r\n~Before posting any comments about found bugs, read the warnings section below. There might be a solution to your problem already.~\r\n\r\n~You must not have installed and active any other Castlevania versions, testing, demo or anything else for this mod to play properly. Delete the other versions and their bsa if any to properly play this one. Also, you MUST have in your game folder the CastlevaniaMemoriesFirstEpisode.esm, CastlevaniaData.esp, CastlevaniaData.bsa, CastlevaniaData.bsl and the videos folder.\r\n\r\n-You can have Alucard\\'s clothes while playing this mod from here if you like, the two mods are not conflicting:\r\nhttp://skyrim.nexusmods.com/mods/23633\r\n\r\nThis is finaly the first episode of the Castlevania Memories and contains the whole story until Garibaldi Temple. Germain calls us to fight Dracula because there are no Belmonts left in this century to oppose him. He later finds that Shaft, a dark priest from Dracula\\'s allies tries to ressurect him within the body of Richter Belmont, one who should be away from Europe for a long trip. Now, it\\'s up to you to stop him from reviving the Lord of Castlevania.\r\n\r\nDue to the mod\\'s large file size, I couldn\\'t get into this any more\r\nareas as Skyrim has some limitations to the mod files. The story will be fully completed in the next episode.\r\n\r\nThe cut-scenes are real made scenes and dialogues from the mod, which I made them like videos to prevent strange behaviors when a scene played or fps drop when many scenes would initialized at once. I also made sure that in this way, they will always be the same as I first created them.\r\n\r\n*Events are from the original Castlevania series but they don\\'t follow Konami\\'s timeline. They are remixed into a new story with Castlevania-\r\nFriendly background and many things that reminds the original games for PS2 and PSOne. That\\'s why this mod is called Memories and not let\\'s say\r\nCurse of Darkness.*\r\n\r\nFor more information, please refer to the original mod.\r\n\r\nInstallation\r\nThis is only a Chinese .esm file , please go to original page to download the main file.\r\nPlease use the NMM to install the MOD.\r\n\r\nCredit\r\nAll credit with LordKarnak, thank him for this great MOD!\r\n\r\nIf you like this MOD, please endorse the author, thank you!\r\n\r\nAbout our group\r\nARROW&KNEE MOD TEAM™ is a neutral independent mini-group for Original MOD lovers,if you have ability to use some specialized software such as PS,max,nifskope,mudbox,zb,maya and so on , please contact us.\r\nOur contact information: skyrimmodteam@gmail.com\r\nOR, you can directly PM me here.",
  "categoryId": "35",
  "version": "1.0",
  "author": "LordKarnak",
  "createdUnix": "1347114320",
  "updatedUnix": "1347115626",
  "containsAdultContent": false,
  "uploadedBy": "creed007",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87174",
      "name": "Castlevania Memories First Episode CHS",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1195",
      "fileName": "Castlevania Memories First Episode CHS-23837-1-0.7z",
      "uploadedUnix": "1347115626",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9eded858ff1b52238574b51c1287b750405c9dd47f86a15f58a7eb98c2dbe4a5/analysis/1407153244/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castlevania%20Memories%20First%20Episode%20CHS-23837-1-0.7z?fid=87174&ttl=1535794331&ri=8192&rs=8192&setec=e04e2b7fdb204b0f527adbbaba1c6304"
    }
  ]
}