{
  "modId": 23854.0,
  "modName": "Better Deadly Bandit NPCs with Improved Loot Overhaul",
  "summary": "Bandits level with you, as do their armors and weapons. Improved Bandit class structures.",
  "descriptionHtml": "Does not support any changes from DLCs. Only works on original NPCs, and their original leveled items lists. Will not work on DLC added NPC or Armor/Weapons. Sorry.\r<br />\r<br />****Attention&#33;****\r<br />This mod is economy breaking. For those that must leave naked bodies in wake of your footsteps, be warned. You will get rich off this&#33; Only mods to fix this that I can find so far:\r<br />http://skyrim.nexusmods.com/mods/13374 by Sentariel\r<br />http://skyrim.nexusmods.com/mods/21981 by Pejot\r<br />Or stop leaving naked corpses laying around. Have some decency for crying out loud.\r<br />\r<br />If these bandits start getting too hard for you, consider my Difficulty Modifier mod.\r<br />http://skyrim.nexusmods.com/mods/23552 by Me \r<br />\r<br />****Description****\r<br />This mod does a huge number of things to ensure you get the best out of your Bandit slaying adventures. As you level, so do your bandit enemies, for example a Bandit is no longer just a level 1 enemy but a level 1-64 enemy, depending on your level. Bandit enemies recieve weapon and armor upgrades as you level as well. Expect Bandits to be wearing something different every 8-10 levels. Bandit outfits also have a chance of being enchanted. Slim chance for the leveled bandit types, but a very high chance for Bandit Chiefs. Fixed some bandit class structures with some very noticable appearances.\r<br />\r<br />\r<br />****Leveling****\r<br />To ensure Bandits know when to upgrade their gear, I had to make it so that they level with the player. This is because Bandits select their gear based on what level they are, not what level you are. If a Bandit type only has 1 level then he/she will be very limited on what that 1 level can offer in terms of available weapons and gear. Bandit Chiefs are 20% higher level than the player. Bandit types and levels are as follows:\r<br />\r<br />Stage 1 Bandit, levels 1-64, base hp -15\r<br />Stage 2 Bandit, levels 10-64, base hp +15\r<br />Stage 3 Bandit, levels 19-64, base hp +45\r<br />Stage 4 Bandit, levels 28-64, base hp +75\r<br />Stage 5 Bandit, levels 37-64, base hp +105\r<br />Stage 6 Bandit, levels 46-64, base hp +135\r<br />\r<br />Stage 2 Bandit Chief, levels 6-64, base hp +50\r<br />Stage 3 Bandit Chief, levels 18-64, base hp +100\r<br />Stage 4 Bandit Chief, levels 30-64, base hp +150\r<br />Stage 5 Bandit Chief, levels 42-64, base hp +200\r<br />Stage 6 Bandit Chief, levels 54-64, base hp +250\r<br />\r<br />*Known non-bandit types effected by this mod: \r<br />Hired Thugs(same as 3 Bandit Chiefs)\r<br />Silver Hand Faction (armor changed, not sure about levels)\r<br />If you find more please leave a comment letting me know so I can make a good list of them here.\r<br />\r<br />****Gearing Up****\r<br />All of the default bandit outfits have been edited to look nothing like it did before. No more will your level 50+ characters come across little weak bandits wearing Fur Armor. No more will you be over-encumbered and be face with which of your 10 Hide Armors you need to drop. (unless you are around levels 1-8, then thats what bandits wear...)\r<br />\r<br />Bandits have decided every 8 to 10 levels or so, that they want a new, fresh change of weapons and armor. And so they shall have it. A generalized idea of what to expect as follows:\r<br />\r<br />Iron Weps/Armors             1-7\r<br />Steal Weps/Armors           8-15\r<br />Orcish Weps             16-23             Armor      38-47\r<br />Dwarven Weps                 24-31            Armor      18-27\r<br />Elven Weps                      32-39            Armor      24-31\r<br />Glass Weps/Armors          40-47\r<br />Ebony Weps/Armors         48-55+\r<br />Deadric Weps/Armors*     56-64+\r<br />Dragonscale Armors*        48+\r<br />Dragonplate Armors*        56+\r<br />*Daedric and Dragonplate/scale only have a 5% drop chance, as well as the enchanted version of such.\r<br />\r<br />BANDIT MAGES basically said to hell with armor, and started wearing some very fashionable robes. Yes thats right, I put my Bandit Mages through the Community College of Skryim, where several of them have clearly excelled in their studies and graduated with their Master Robes of Destruction. (The type of robe you find on them will depend on what stage Bandit Mage they are)\r<br />\r<br />*Special note* Sometimes a piece of equipment not listed above fits into the leveled list in a way that I had to keep it in. End result is around levels 16-40ish, not every level in between but a noticable amount, you will see for instance a Bandit wearing Steel Plate boot, gloves and helm, but a Dwarven chest piece. Most of the time it will match up, but hey, who said Bandit were great at fashion.\r<br />\r<br />****Enchanted Gear****\r<br />Almost every single enchant that you can put on weapons and armors can now be found on the weapons and armor worn by all bandits. This includes paralyse, but not somthing like firey-soul trap since is a unique found enchant vs vendor type. Each Non-Bandit Chief type has a seperate 10% chance for each piece of gear to be enchanted. Bandit Chiefs have a seperate 80% chance for each peiece of gear to be enchanted.\r<br />\r<br />The levels of the enchants grow with every type of material upgrade your Bandits go through.\r<br />\r<br />****Class Structure****\r<br />Nothing super crazy here (though this was the longest part of the mod). What you can expect to see is a huge difference on the Bandit classes as you face them 1 on 1.\r<br />\r<br />Boss Bandits have 1H wep(shield sometimes) or 2H wep, and always heavy armor.\r<br />1H DPS Bandits have a chance at a light shield and always light armor.\r<br />1H Tank Bandits always have a shield and always wear heavy armor.\r<br />2H DPS Bandits never have a shield and always wear heavy armor.\r<br />2H Berserker Bandits never have a shield and always wear light armor.\r<br />Archers always wear light armor and always have the best dagger(no enchant) as a back up.\r<br />Mages always wear robes and always have the best enchanted dagger as back up.\r<br />\r<br />****Side-effects****\r<br />Due to the dynamic structuring of the loot tables and leveling for Bandits, their may be other NPCs out their that might share/mimic the Bandit class and so they too might recieve some or all of the effected changes. I restructured a huge portion of the leveled loot tables so that I could apply them to the Bandits leveled outfits. What this might mean for you is that any random loot that might be found in a chest (weap and armor only) will always be the best to your level. Which is actually a good thing at high level, but it may also delay getting things like Orcish weapons at  level 1 and now instead you have to wait to level 16 to see it drop. Even some vendors randomly select leveled loot to sell, usually crap. Nows its always the best to your level.\r<br />\r<br />****Non-Side-effects****\r<br />This mod does not alter any damage values, gold values, wieght values, item keywords, or anything of these natures. There are no newly added items, enchants, or npcs. Only a few npc templates where duplicated and reworked so that pre-existing Bandit classes could act like their class says they should.\r<br />\r<br />This mod does not use any scripts at all. I made all the changes within the actual game files myself. That said I know what causes what, and if you have a problem I can fix it easily.\r<br />\r<br />****Reporting Bugs****\r<br />If you find a bug, please leave me a comment and I will get it fixed right away. Please leave me as much detail as possible. Report to me things like your level at the time you found the bug, if you&#39;ve see it a multiple levels, the name of the affected NPC, the name of the affected items to full detail.\r<br />\r<br />****Known Bugs****\r<br />No more reported at the moment.\r<br />\r<br />****Fixed Bugs****\r<br />1 handed tanks, 2 handed heavy armor, and 2 handed berserkers bandits have discolored heads. Found problem. Fixed. -September 9th 2012 \r<br />\r<br />****Install/Uninstall****\r<br />Install using NMM or manual\r<br />activate .ESP\r<br />????\r<br />Profit\r<br />\r<br />Unistall using NMM or manual delete\r<br />Somthing about bacon\r<br />????\r<br />Profit",
  "categoryId": "33",
  "version": "1.1",
  "author": "DaBritt87",
  "createdUnix": "1347133275",
  "updatedUnix": "1349985658",
  "containsAdultContent": false,
  "uploadedBy": "damonbritt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87254",
      "name": "Better Deadly Bandits",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "170",
      "fileName": "Better Deadly Bandits-23854-1-0.rar",
      "uploadedUnix": "1347133339",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e9a358781bd77ab4f52c4a6c84c6577c865591f99a08207424112c07bd3ac68b/analysis/1407154022/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Deadly%20Bandits-23854-1-0.rar?fid=87254&ttl=1535794356&ri=8192&rs=8192&setec=c9c32e9c9674722f78d5d56e086878b8"
    },
    {
      "fileId": "87431",
      "name": "Better Deadly Bandits",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "170",
      "fileName": "Better Deadly Bandits-23854-1-1.rar",
      "uploadedUnix": "1347207435",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ad02e219afa7aa94a4d4100853ff1f9881590120ae10ff3d4905c47bcbd2fb76/analysis/1407156062/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Deadly%20Bandits-23854-1-1.rar?fid=87431&ttl=1535794357&ri=8192&rs=8192&setec=c9f0c64e98a1100009eba6ba22a86636"
    },
    {
      "fileId": "93316",
      "name": "Better Deadly Bandits-Weapons Only",
      "version": "1.1a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "163",
      "fileName": "Better Deadly Bandits-Weapons Only-23854-1-1a.7z",
      "uploadedUnix": "1349985658",
      "modVersion": "1.1a",
      "virusScanUrl": "https://www.virustotal.com/file/29a2e646bc70e8ddee36b0b54d2963cf496a8f89f4e032db42cbf43b5e83b8a6/analysis/1407215827/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Deadly%20Bandits-Weapons%20Only-23854-1-1a.7z?fid=93316&ttl=1535794357&ri=8192&rs=8192&setec=7731e5a55648b178295b5baa27fcf816"
    }
  ]
}