{
  "modId": 23882.0,
  "modName": "Spell Combos",
  "summary": "Chain spells together to create new and powerful effects. For example: Launch Ice Spikes at your enemy then cast a Lightning Bolt, and watch your enemy get blown away causing extra damage and a push effect. This, and many more for you to tinker with&#33;",
  "descriptionHtml": "[b][size=5]Spell Combos[/size][/b]\r<br />v1.5b\r<br />\r<br />Please endorse if you like my mod&#33;\r<br />\r<br />[size=4]-==News==-[/size]\r<br />[size=3]Good news and bad news. The good news is that [url=http://www.nexusmods.com/skyrim/mods/57236/?]V2 is out[/url]&#33; The bad news is that V2 is such a huge overhaul of Spell Combos that to make it a simple update would be impossible since its design is so drastically different to the point that it&#39;d break your game. So with that, I regret to say that V2 can&#39;t work with V1, and you can only pick one or the other. But it doesn&#39;t have to be all bad. I invite everyone to use V2 and see if it&#39;s worth your time. Thanks for the support guys.[/size]\r<br />\r<br />[youtube]FY5AS4IRt7s[/youtube]\r<br />Please note that this video pertains to the initial v1.0b.\r<br />\r<br />[center][url=http://www.skyrimgems.com][img]http://SkyrimGEMS.com/images/badge_featured.png[/img][/url][/center]\r<br />The mod has been featured in Skyrim Gems&#33; Check out the resource to enhance your game&#33;\r<br />\r<br />[youtube]WZ-Flg9JGCU[/youtube]\r<br />This mod has also been featured in Preykousis&#39; show Skyrim Mod of the Day, showcasing v1.5b. Why don&#39;t you subscribe to his show? He updates on a daily basis&#33;\r<br />\r<br />-==Overview==-\r<br />Spell Combos allows you to trigger different effects (explosion, stat debuffs, push, disarm, etc.) when casting different spells in combat. It works by setting up the enemy for a combo by casting a spell of a particular element. The next spell that hits the enemy within the allotted time will trigger the spell combo. For example, casting Ice Spike on an enemy then shocking him with Sparks or Chain Lightning will cause the Superconductor combo which deals a additional damage and sets enemy magicka to 0. Different combinations of spells yield different effects, so experimentation is encouraged.\r<br />\r<br />*Thanks to user Preykousis for pointing out this page&#39;s lack of a proper description\r<br />He hosts the Youtube series [url=http://www.youtube.com/show/skyrimmodoftheday]Skyrim Mod of the Day[/url] which showcases a few mods (usually the less popular ones) on a [b]daily basis[/b].\r<br />\r<br />-==v1.5 Changes==-\r<br />&gt;A few ward combos have been added\r<br />&gt;A few combos replaced\r<br />&gt;Cold Feet now slows down enemy movement\r<br />&gt;Second-tier combos added for fire and shock (might be OP, but they&#39;re second-tier for a reason)\r<br />&gt;Mage/Candle Light combos added\r<br />&gt;Removed Overcharge\r<br />&gt;For any suggestions on balancing or suggestions for new combos, just fire away at the comments section\r<br />&gt;For any issues, please let me know immediately through the comments section as well\r<br />&gt;[b]This version already has the player immune fix from the previous version, but if you get hit with a combo let me know which combo it is and the details on how it happened (who hit you, what spells were used, etc.) in the comments section[/b]\r<br />\r<br />-==Future Plans==-\r<br />&gt;Incorporate other schools of magic (I&#39;m looking at you, Illusion)\r<br />&gt;A way for battlemages to incorporate melee combat\r<br />\r<br />-==Second-tier Combos==-\r<br />Triggering second-tier combos is a three-step process: cause the combo state, then attack the target with the same element but of higher expertise (flames &gt; firebolt, sparks&gt;lightning bolt, etc.)*. The next spell** that hits will trigger a second-tier combo***. For the sake of balance, I set the duration of being in a second-tier state to 10 seconds only so make it count&#33;\r<br />\r<br />*You can use firebolt&gt;firebolt to prep the enemy for second-tier combos\r<br />**Tip: Basic spells like flames, sparks, and frostbite cause different second-tier combos from their higher level brethren (alternatively, you can use a cloak or a rune)\r<br />***Second-tier combos will sometimes be triggered alongside first-tier combos\r<br />\r<br />-==Light Combos==-\r<br />These combos are triggered while there&#39;s a mage or candle light spell active. These combos act generally like combat support drones, which is why I call them &#34;protocols&#34; rather than &#34;combos&#34;.\r<br />\r<br />-==New Combos==-\r<br />*&gt;&gt; = second-tier combos\r<br />*&lt;&gt; = mage/candle light combos\r<br />&gt;Elemental Mimicry - Ward Combo; casts a cloak depending on the element that hit the ward\r<br />&gt;Ward Recompense - Ward Combo; restores magicka based on the damage taken while the ward is put up\r<br />&gt;Stolen Breath - absorbs stamina; replaces Frozen Life (I sorta found Frozen Life a tad annoying)\r<br />&gt;&gt;Soul Burn and Soul Fire - Soul Burn damages health over time and may cause Soul Fire\r<br />                - Soul Fire causes enemies to fire a fireball at an enemy if there are any nearby\r<br />&gt;&gt;Lightning Rod - Stops enemy movement and shocks nearby targets (careful)\r<br />&gt;&gt;Synapse Break - 0 magicka rate, 0 magicka, pushes target away\r<br />&gt;&gt;Hot Metal - Unequips all items, pushes target away, damages target based on 80% of your destruction stat\r<br />&gt;&gt;Blown Weapon - Unequips right hand weapon and removes it (yes, it removes it from the target&#39;s inventory), pushes target away, damages target based on 30% of your destruction stat\r<br />&gt;&gt;Nerve Damage - Slows down weapon swing even more than Neural Burn and causes stagger every second (for 10 seconds)\r<br />&gt;&gt;Paper Armor - Pushes target away, damage resistance stat is 0\r<br />&gt;&gt;Shaking Hands - Target&#39;s stamina and stamina rate goes down to 0\r<br />&gt;&gt;Devouring Flames - Knocks target down, deals damage based on 10% of the caster&#39;s destruction stat, doesn&#39;t cancel out the second-tier combo state\r<br />&lt;&gt;Safety Measure - Slows down time for a few seconds\r<br />&lt;&gt;Emergency Recovery - Heals the player based on the alteration stat\r<br />&lt;&gt;Absorption - Recovers magicka based on the damage dealt on the player\r<br />&lt;&gt;Repulse - Pushes the target away\r<br />&lt;&gt;Light Drones - Elemental drones* that hover around and attack enemies** that have hit you***\r<br />   *The element depends on the first spell you cast after casting the light spell\r<br />   **The drone inherits whatever spell you cast first\r<br />   ***Yes, you have to be hit first for the drones to attack anything\r<br />\r<br />-==Known Issues==-\r<br />&gt;Soul Fire and Lightning Rod will sometimes fire in a random direction even if there aren&#39;t any hostiles around\r<br />&gt;I have yet to fully test Repulse (spoiler: it&#39;s activated when you&#39;re hit by a power attack) so I can&#39;t tell if it works fullly\r<br />&gt;The drones can hit you by accident, but I designed them to explode once they hit you so they won&#39;t do it again\r<br />\r<br />-==Upgrading==-\r<br />Given the script-heavy nature of the mod, it is imperative that you make a clean save first.\r<br />&gt;Remove the previous version&#39;s .esp file\r<br />&gt;Load your game, then SAVE, then exit the game\r<br />&gt;Install the new version and activate\r<br />\r<br />-==Usage==-\r<br />Again, the combos use vanilla spells only. Maybe I&#39;ll add my own custom spells in the future.\r<br />\r<br />-==Installation==-\r<br />Just place the files into your data folder.\r<br />\r<br />-==Uninstallation==-\r<br />Remove the esp along with the associated files\r<br />\r<br />-==Permissions==-\r<br />Go ahead and make your edits. You can even release your own version of this on the Nexus. No need for permission, but please give due acknowledgement.\r<br />\r<br />-==Other mods==-\r<br />Check out my mods:\r<br />[url=http://skyrim.nexusmods.com/mods/22177]Evolving Bound Weapons[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/23096]MRECO - Magic Related Enchantments to Clothing Only[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/23502]Elemental Blade Effects[/url]\r<br />\r<br />[size=&#34;6&#34;]=============Content below pertains to v1.1===============================================[/size]\r<br />\r<br />-==v1.1 Changes==-\r<br />&gt;Spell Combos are now limited to vanilla spells only; no more custom spells\r<br />&gt;Damage has been greatly nerfed now and some effects have been changed so it should be less OP, but there might still be some balance issues\r<br />&gt;Some combos have been removed, while some have been changed into the new combos\r<br />&gt;Ward combos have been removed for the time being\r<br />&gt;Scripts have been overhauled and is now more stable\r<br />&gt;Combos won&#39;t multi-trigger anymore\r<br />&gt;For any suggestions on balancing or suggestions for new combos, just fire away at the comments section\r<br />&gt;For any issues, please let me know immediately through the comments section as well\r<br />\r<br />-=New Combos=-\r<br />&gt;&gt;Wear and Tear - halves damage resistance (Thanks to user senterpat for the idea&#33;)\r<br />&gt;&gt;Cold Feet - deals damage\r<br />&gt;&gt;Liquid Expansion - Deals damage and pushes the target\r<br />&gt;&gt;Frozen Life - Conjures a Frost Atronach\r<br />\r<br />-=Retained Combos=-\r<br />&gt;&gt;Shot Nerves - Disams the enemy\r<br />&gt;&gt;Internal Freezing - Paralyzes the enemy for 10 seconds\r<br />&gt;&gt;Wet Shock - Staggers the enemy and deals additional damage, magicka regen is nullified\r<br />&gt;&gt;Superconductor - Deals a additional damage, enemy magicka is set to 0\r<br />&gt;&gt;Flash Freeze - Staggers the enemy, along with some damage\r<br />&gt;&gt;Fry Equipment - Staggers the enemy, then unequips their gear after a few seconds\r<br />&gt;&gt;Siphon Magicka - Damages magicka, heals aggressor&#39;s own magicka, and causes stagger\r<br />&gt;&gt;Overcharge - Blows away the enemy as it explodes, dealing additional damage, prevents magicka regen\r<br />&gt;&gt;Neural Burn - Slows down the enemy&#39;s swing speed\r<br />\r<br />-==Upgrading to v1.1==-\r<br />Given the script-heavy nature of the mod, it is imperative that you make a clean save first.\r<br />&gt;Remove the previous version&#39;s .esp file\r<br />&gt;Load your game, then SAVE, then exit the game\r<br />&gt;Install the new version and activate\r<br />\r<br />-==Usage==-\r<br />No more custom spells for this version. Combos are now prepped and triggered by vanilla spells.\r<br />\r<br />-==Installation==-\r<br />Just place the files into your data folder.\r<br />\r<br />-==Uninstallation==-\r<br />Remove the esp along with the associated files\r<br />\r<br />-==Future Plans==-\r<br />&gt;Add more combos\r<br />&gt;Add more combos involving wards\r<br />\r<br />-==Known v1.1 Issues==-\r<br />&gt;Spell combos CAN be triggered against you; this adds a new level of challenge, but if it&#39;s not your thing, then download the optional v1.1 I uploaded\r<br />&gt;Some spell effects (0 magicka regen, slow swing speed, etc.) are permanent - if you get hit by these, you won&#39;t get them back to their old stats unless you use the console or reload a save (again, can be rectified with the optional v1.1 that makes the player immune to spell combos)\r<br />&gt;Some combos may trigger unexpectedly on enemies when you switch around spells too fast (cause is currently unknown)\r<br />\r<br />-==Permissions==-\r<br />Go ahead and make your edits. You can even release your own version of this on the Nexus. No need for permission, but please give due acknowledgement.\r<br />\r<br />-==Other mods==-\r<br />Check out my mods:\r<br />Evolving Bound Weapons\r<br />http://skyrim.nexusmods.com/mods/22177\r<br />MRECO - Magic Related Enchantments to Clothing Only\r<br />http://skyrim.nexusmods.com/mods/23096\r<br />Elemental Blade Effects\r<br />http://skyrim.nexusmods.com/mods/23502\r<br />\r<br />[size=&#34;6&#34;]=============Content below pertains to v1.0===============================================[/size]\r<br />\r<br />-==Minor Fix==-\r<br />If you&#39;re one of the first people who downloaded the mod, I apologize for not putting it in the game itself. I fixed it already (check the files section). Now the spell tomes can be purchased (hopefully), but do note that they are expensive for a reason. You can also find the books somewhere in the College of Winterhold (where do they keep their books again?). Again, sorry for the initial problem. I hope you enjoy the mod&#33;\r<br />\r<br />-==Overview==-\r<br />So you want to be a pure mage, but starting out is a bit of a pain. You&#39;ve got too little magicka to cast anything over prolonged battles, and your spells are  crap. Or you&#39;re pretty good at being a mage, but find that casting spells left and right is kinda stale.\r<br />\r<br />This mod is for all you pure destruction mages out there. It turns mages from a minor nuisance to a total combat mainstay. Also makes spell casting a little less predictable.\r<br />\r<br />-==Usage==-\r<br />You can find the books being sold by shops (I hope). The books can also be found somewhere in the College of Winterhold. Alternatively, you can use the console method.\r<br />&gt;Type in:\r<br />help &#34;combo &#34;\r<br />&gt;You should see the ID&#39;s associated with the combo spells\r<br />&gt;Type in &#34;player.addspell &lt;combo spell&#39;s ID&gt;&#34; (again, without the quotes)\r<br />&gt;Do this for all combo spells you want\r<br />\r<br />-==Installation==-\r<br />Just place the files into your data folder.\r<br />\r<br />-==Uninstallation==-\r<br />&gt;Remove the spells first by opening up the console\r<br />&gt;Type in:\r<br />help &#34;combo &#34;\r<br />&gt;You should see the ID&#39;s associated with the combo spells\r<br />&gt;Type in &#34;player.removespell &lt;combo spell&#39;s ID&gt;&#34; (again, without the quotes)\r<br />&gt;Do this for all combo spells you have\r<br />&gt;Remove the esp along with the associated files\r<br />\r<br />-==How To==-\r<br />Set up the spell combo by casting the &#34;Combo&#34; spells. These are magic that you can find in vanilla Skyrim, but with the added twist of putting the enemy in a &#34;Combo State&#34;. These spells deal damage based on  the user&#39;s destruction stat, making them usable until endgame. While the enemy is in a Combo State, any new attack or spell you throw at them will cause a particular combo effect. Fun, right?\r<br />\r<br />Careful though. These spells do not discriminate between friend or foe. Don&#39;t worry though. The Combo State wears off after 20 seconds or so.\r<br />\r<br />-==Combo List==-\r<br />I&#39;m not gonna give away the method, but I will give the effects. Effects with asterisks do not cancel the combo state. Experiment with different elements and effects to find out&#33; Also, if you&#39;ve got a combo idea let me know in the comments. I&#39;ll try to put that in the next update.\r<br />Hint 1: Sometimes it&#39;s not the element, but the spell itself that causes the combo.\r<br />Hint 2: It&#39;s possible to cause combos using other Combo Spells.\r<br />Hint 3: It&#39;s possible to chain combos by causing combos using Combo Spells.\r<br />Hint 4: Some combos REQUIRE a Combo Spell to be triggered.\r<br />Hint 5: On the other hand, some combos just require the element itself.\r<br />Hint 6: Combos don&#39;t work in reverse.\r<br />Hint 7(?): I haven&#39;t played enough to confirm this, but it seems an enemy can be in more than one combo state and any combo that has an identical trigger will... well, trigger. Pretty cool, I guess? Even I didn&#39;t expect that one.\r<br />\r<br />&gt;Shot Nerves - Disams the enemy (kinda buggy at the moment though)\r<br />&gt;*Burning Wound - Adds additional damage based on the aggressor&#39;s damage resistance stat\r<br />&gt;Internal Freezing - Paralyzes the enemy for 10 seconds\r<br />&gt;Wet Shock - Staggers the enemy and deals additional damage based on the aggressor&#39;s destruction stat; enemies close to each other will get hit provided they are in the same combo state\r<br />&gt;*Ice Crush - Staggers the enemy\r<br />&gt;Superconductor - Deals a additional damage based on the aggressor&#39;s destruction x 1.5 and pushes the enemy away\r<br />&gt;Flash Freeze - Staggers the enemy, along with some damage, as well as a decrease in movement speed\r<br />&gt;Fry Equipment - Staggers the enemy, then unequips their gear after a few seconds\r<br />&gt;Rebounding Ice - Deals damage based on 60% of the aggressor&#39;s destruction stat, blows away the enemy while releasing ice spikes (careful, you might get hit)\r<br />&gt;Electric Cut - Damages magicka directly based on the aggressor&#39;s destruction stat\r<br />&gt;Siphon Magicka - Damages magicka, heals aggressor&#39;s own magicka, and causes stagger\r<br />&gt;Overcharge - Blows away the enemy as it explodes, dealing additional damage based on 60% of the aggressor&#39;s destruction stat\r<br />&gt;Neural Burn - Slows down the enemy&#39;s swing speed\r<br />&gt;Burning Reprisal - Fires 3 fireballs and blows away the aggressor\r<br />&gt;Frozen Vengeance - Fires 3 ice spikes and blows away the aggressor\r<br />&gt;Thunder Runner - Fires 3 lightning bolts and blows away the aggressor\r<br />&gt;Away With You - Blows away the aggressor\r<br />\r<br />-==Known Issues==-\r<br />&gt;As I mentioned, the Shot Nerves combo is kinda buggy\r<br />&gt;Combos affect friendlies, so be careful\r<br />&gt;It&#39;s a tad unbalanced at the moment\r<br />&gt;It gets messy when several combos are triggered at once\r<br />&gt;Perks don&#39;t apply to combo spells at the moment\r<br />&gt;Many of the ward combos are untested\r<br />\r<br />-==Permissions==-\r<br />Go ahead and make your edits. You can even release your own version of this on the Nexus. No need for permission, but please give due acknowledgement.\r<br />\r<br />-==Other mods==-\r<br />Check out my mods:\r<br />Evolving Bound Weapons\r<br />http://skyrim.nexusmods.com/mods/22177\r<br />MRECO - Magic Related Enchantments to Clothing Only\r<br />http://skyrim.nexusmods.com/mods/23096\r<br />Elemental Blade Effects\r<br />http://skyrim.nexusmods.com/mods/23502",
  "categoryId": "93",
  "version": "1.5b",
  "author": "leron9999",
  "createdUnix": "1347194170",
  "updatedUnix": "1348409432",
  "containsAdultContent": false,
  "uploadedBy": "leron9999",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87387",
      "name": "Spell_Combos_V1",
      "version": "1.0b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "Spell_Combos_V1-23882-1-0b.7z",
      "uploadedUnix": "1347194242",
      "modVersion": "1.0b",
      "virusScanUrl": "https://www.virustotal.com/file/eb7748bed0350a0b5c7a227564962d0352ba9c8eeb5407b0ae6ccdec82cb8b34/analysis/1407155582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spell_Combos_V1-23882-1-0b.7z?fid=87387&ttl=1535794406&ri=8192&rs=8192&setec=60781c825ef7012e06efaf7f7d2d1956"
    },
    {
      "fileId": "87404",
      "name": "Spell_Combos_V1_Availability_Fix",
      "version": "1.0b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "Spell_Combos_V1_Availability_Fix-23882-1-0b.7z",
      "uploadedUnix": "1347197733",
      "modVersion": "1.0b",
      "virusScanUrl": "https://www.virustotal.com/file/023d5a408695bed01a834b1adfb5037e9f04916f6059ab9fb64aba9bf0c64817/analysis/1407155764/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spell_Combos_V1_Availability_Fix-23882-1-0b.7z?fid=87404&ttl=1535794407&ri=8192&rs=8192&setec=4d741533ebf53babc94880e83420a719"
    },
    {
      "fileId": "87420",
      "name": "Spell_Combos_V1_LevellingFix",
      "version": "1.0b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "Spell_Combos_V1_LevellingFix-23882-1-0b.7z",
      "uploadedUnix": "1347202928",
      "modVersion": "1.0b",
      "virusScanUrl": "https://www.virustotal.com/file/95fdcb30d5f33d62baefca3f6f38688b01549393a6586a2e199ba1850b37ee76/analysis/1407155911/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spell_Combos_V1_LevellingFix-23882-1-0b.7z?fid=87420&ttl=1535794407&ri=8192&rs=8192&setec=3a2c32c4b38c6cbe5ae0a9b19b34deee"
    },
    {
      "fileId": "88388",
      "name": "Spell_Combos_V1_1",
      "version": "v1.1b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15",
      "fileName": "Spell_Combos_V1_1-23882-v1-1b.7z",
      "uploadedUnix": "1347632747",
      "modVersion": "v1.1b",
      "virusScanUrl": "https://www.virustotal.com/file/09ccbe9c4521eb646f0fd130ba210ff4b8f6f963ab66b6549b6b45cb84953bc2/analysis/1407164763/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spell_Combos_V1_1-23882-v1-1b.7z?fid=88388&ttl=1535794408&ri=8192&rs=8192&setec=e711a33ac7dfaa89a7d8c72f768f9430"
    },
    {
      "fileId": "88394",
      "name": "Spell_Combos_V1_1_PlayerImmune",
      "version": "1.1b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "Spell_Combos_V1_1_PlayerImmune-23882-1-1b.7z",
      "uploadedUnix": "1347636483",
      "modVersion": "1.1b",
      "virusScanUrl": "https://www.virustotal.com/file/509a2cb8bce2108bdc24b0c18f37cb969874d367ebad3df3c1d6d86f3504084b/analysis/1407164822/",
      "changelogHtml": " Spell Combos are now limited to vanilla spells only; no more custom spells <br/> \n Damage has been greatly nerfed now and some effects have been changed so it should be less OP, but there might still be some balance issues <br/> \n Some combos have been removed, while some have been changed into the new combos <br/> \n Scripts have been overhauled and is now more stable <br/> \n Ward combos have been removed for the time being <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spell_Combos_V1_1_PlayerImmune-23882-1-1b.7z?fid=88394&ttl=1535794408&ri=8192&rs=8192&setec=fd4f3090c42ebbf7919890d8b90a97d5"
    },
    {
      "fileId": "90062",
      "name": "Spell_Combos_V1_5b",
      "version": "v1.5b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28",
      "fileName": "Spell_Combos_V1_5b-23882-v1-5b.7z",
      "uploadedUnix": "1348409432",
      "modVersion": "v1.5b",
      "virusScanUrl": "https://www.virustotal.com/file/ab77eb0ae03fe3f9cc54d86e91d29ed41a8341394bbf3f293289d29262d3bf5a/analysis/1407183198/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spell_Combos_V1_5b-23882-v1-5b.7z?fid=90062&ttl=1535794408&ri=8192&rs=8192&setec=2a82011f4273431caf158ba9db943b1b"
    }
  ]
}