{
  "modId": 23888.0,
  "modName": "NeV-P_Extreme Materials",
  "summary": "Old and New materials, minerals, tools, recipes... Extreme materials for Extreme Craftsmen.",
  "descriptionHtml": "[center][img]http://static-2.nexusmods.com/15/images/110/1524013-1352448490.png[/img][/center]\r<br />[center][img]http://static-2.nexusmods.com/15/images/110/1524013-1352408953.png[/img][/center]\r<br />[center][color=green] (version 2.5.5)   by ColdFire [/color][/center]\r<br />\r<br />[color=darkblue][b][i][size=5]This mod is dedicated to all the fans of forge like me ...[/size] [/i][/b][/color]\r<br />\r<br />[img]http://static-4.nexusmods.com/15/mods/110/images/23888-4-1347205866.jpg[/img]\r<br />\r<br />[color=red][size=4]Version 2.5.5:[/size][/color]\r<br />[list]\r<br />[*] Some little Fix to: recipes, Script, tutorial quest, workstation visualization in the world.\r<br />[color=yellow]\r<br />[*] load order:\r<br />[*]         Dawnguard (Dawnguard users)\r<br />[*]         SPIKE.esm (&#39;Immersive&#39; users)\r<br />[*] \t            NeV-P_ExtremeMaterials.esm\r<br />[*]         3rdEraWeaponsMoS.esm (3rdEra users)\r<br />[*] \t            NeV-P_ExtremeMaterialsWAddon\r<br />[*] \t            NeV-P_ExtremeMaterialsDWG (Dawnguard users)\r<br />[*] \t            NeV-P_ExtremeMaterialsENG (non Italian users)\r<br />[*]                     (or) NeV-P_ExtremeMaterialsENG_IP (non Italian, &#39;Immersive&#39; users)\r<br />[*]                     &#39;Immersive&#39; Mods (&#39;Immersive&#39; users)\r<br />[*]                     3rdEraWeaponMoS (&#39;3rdEra&#39; users) [/color][/list]\r<br />[color=red][size=4]Version 2.5.3:[/size][/color]\r<br />[list]\r<br />[*] Complete re-pack.\r<br />[*] All arrow mesh improved.\r<br />[*] [size=3][b]All raw materials mesh improved[/b][/size]\r<br />[*] New mesh and texture for Dwemer loots added\r<br />[*] [color=red][size=4][b] Improved compatibility with all &#39;Immersive&#39; and &#39;Third Era Weapons&#39; Mods.[/b][/size] (by request]  NOTE: Now Immersive Loot can coexist with Extreme Materials and Extreme Armory but it change all Extreme value settings for weapons and armors. You must to choose if use its or mine settings simply activate or deactivate Immersive Loot.[/color]\r<br />[color=red][size=4]Version 2.5.2:[/size][/color][/list]\r<br />[list]\r<br />[*] Some recipes and script Fix\r<br />[*] Added more items and tools into more vendor list. [b] NOTE: you need to wait some respawn to see it into the available object list.[/b]\r<br />[*] Corrected some translation\r<br />[*][size=4][b] Added LIGHT Version&#33;&#33; NO change at any Recipe and any working station, except Archery workbench....  [color=green][i] I don&#39;t know what you can do with all that new materials and tools but... If some people like this..&#33; [/color][/i][/list][/b][/size]\r<br />[color=red][size=4]Version 2.5:[/size][/color]\r<br />[list]\r<br />[*]Also changed the Dwarven Metal and objects of production.\r<br />[*] Added two new types of leather, Suede and Snake Leather.\r<br />[*] Added four types of feathers in the ingredients and its four types of stabilizers for arrows.\r<br />[*] Added a new metal, the Stellar Steel.\r<br />[*] Changed all the recipes using new materials, basing on a simple rule: what you see is what you need. Of course, the recipes are based on the production of new armors into [color=blue]Extreme Armory.[/color]\r<br />[*] Changed also all the market values of weapons and armors, in relation to new recipes.\r<br />[*] Added new choppping block for the cutting of the essences in other mills (thanks to the reporting of [b]nonoodles[/b])\r<br />[*] Added new recipes for the production of refined materials. Now you can get the materials  melting unused weapons and armor. [size=4]Are you tired of your old armor, you lack the materials and the sellers do not have enough, you picked up weapons and armor in industrial quantities&#33;? Melt it and get new raw materials to forge what you want&#33;[/size]\r<br />Unfortunately the game currently does not allow to get multiple objects from a single object; for which at the time from melting a weapon or armor you can only get the relative amount of the main material of which it consists. From some armor we can obtain more materials but in this case will have to decide which of them will get. All secondary materials such as belts and pieces of leather are lost in the process.\r<br />[*] Added a new workbench specifically for archery. Now all the bows and arrows will be craftable on it. The table was added to all most important areas of forging and to sawmills where same are available the archery  woods.\r<br />[*] From now you will need to forge the tools that can be purchased like any other things at the same merchants and blacksmiths, as well as around the world ... [color=white]The variety of existing objects in the pissed of Skyrim will even be good for something&#33;[/color]\r<br />[*] Adjusted all values of equipment (base), calculated on the actual value of the building materials + a variable percentage compared to the  equipment&#39;s level (from 20% to 50%).\r<br />From now buy armor and weapons or arrows is a real cost and not fictitious improvised. \r<br />It makes the game more challenging of the forge, a game that can make you bankrupt ... or very rich.\r<br />[*] Added new recipes to the arrow recipes, to enhance all the basic constructible arrows. For each base type there are now two new types craftable: Arrows Sharped and Disruptive, with enhanced two higher levels (the latest produce twice the damage and ignore immunity to normal weapons). All this, of course, at a fair price ...\r<br />[*] Added NMM installer. [/list]\r<br />[color=orange] IMPORTANT [/color] advice to uninstal and delete all old files before installing the new one, instead of simply overwrite.\r<br />[color=orange]LOAD ORDER:[list]\r<br />[*]Dawnguard (who have it)\r<br />[*]NeV-P_ExtremeMaterials (esm)\r<br />[*]Unofficicial Patch (who have it)\r<br />[*]NeV-P_ExtremeMaterialsDGW (esp) (Dawnguard users)\r<br />[*]NeV-P_ExtremeMaterialsENG (esp) (for not Italian users)[/color][/list]\r<br />\r<br />[color=red][size=4]Version 2:[/size][/color]\r<br />[list]\r<br />[*]improved the hierarchy of file loading: texture and mesh.\r<br />[*]improved and corrected UV mapping of some mesh and texture.\r<br />[*]added four types of precious woods for archery.\r<br />[*]added all the materials, including the new ones, in the lists of sellers. The new woods that will be added in the lists of the construction of &#34;Extreme Armory&#34; you will find on sale at material retailers in refined form, and at the sawmill: here there will be a new choppingblok with which you can cut only the new essences .\r<br />[*]Converted the mod to master file (esm), used as base for other mods compatible.\r<br />[/list]\r<br />\r<br />[color=white][size=3]For each set you can now also download all the basic template texture of materials, in high resolution, whith all the necessary channels (_d, _alpha, _n, _nalpha, _m), as a resource for all modders who want to use my new materials in their work. (Of course, a small credit is welcome)[/size][/color]\r<br />\r<br />[color=green][size=3]In this Mod have changed all existing materials for forging and new ones have been added.\r<br />The materials were modified in raw form, in refined form and in the same vein mining extraction.\r<br />The only exceptions are: lead, added exclusively for sale already refined, and the dwarven metal that I find beautiful already in the original.\r<br />Modified, improved and added new tools for processing and workbenches. Changed all basic recipes equipment conforming to these new materials; also the appearance of all the basic equipment has been revolutionized in &#39;Extreme Armory&#39; by conforming them to the appearance of new materials,\r<br />Textures were all recreated in high resolution from an image realistic and documented mineral real for all channels. Also change the mesh in the UV and related necessary channels.[/size][/color]  \r<br />\r<br />[color=red][size=3][i]Now it will be available:[/i][/size][/color]\r<br />[color=red][size=3][i]changed:[/i][/size][/color]\r<br />[color=grey]charcoal\r<br />coal\r<br />Corundum ore (in the form of massive Ruby)\r<br />Ebony raw (non-existent in mineral form made ??with goethite of Morocco)\r<br />Raw gold (native gold massive)\r<br />Iron ore (hematite stone and iron)\r<br />Raw Malachite (Malachite Mammellare)\r<br />Raw Moonstone (Feldspar Adularia)\r<br />Raw silver (Silver native)\r<br />Crude Quicksilver (in kind (usually) present in small drops between the crystals of Cinnabar, made ??in small pockets of porous rock (have you ever seen the Quicksilver into ingots?: P)\r<br />Charcoal for forging (now mineral coal)\r<br />Refined corundum (ruby pure (refined as it will remain a mystery ... xD)\r<br />Ebony refined (made ??with Quartz Chalcedony Iron Eye)\r<br />Refined gold (now also obtainable through fusion of equivalent currencies)\r<br />iron refined\r<br />malachite refined\r<br />Moonstone refined\r<br />Silver refined\r<br />Quicksilver refined\r<br />Steel (now Iron + Carbon (charcoal)\r<br />Orichalcum (metal used in ancient times for the minting of coins and jewelry: Copper alloy + Zinc)[/color]\r<br />Dwarven Metal (first Red Gold, and nowmolten at Stellar Steel)\r<br />[color=red][size=3][i]added:[/i][/size][/color]\r<br />[color=grey]Raw obsidian (natural Obsidian)\r<br />Copper ore (Native copper)\r<br />Unwrought zinc (in kind linked crystals as Sphalerite, Smithsonite and Calamine: rendered as agglomerated crystalline carbonate rock)\r<br />Refined lead (available only already refined)\r<br />Refined glass (available now with Obsidian + Lead)\r<br />refined Copper\r<br />refined Zinc\r<br />Ashwood   raw and refined \r<br />Cherrywood   raw and refined \r<br />Yew wood   raw and refined \r<br />Briarwood   raw and refined[/color]\r<br />Crow, Pheaseant, Little Peacock, Moon Bird feathers\r<br />Hawk, Crow, Pheaseant, Little Peacock, Moon Bird Arrow Feathers\r<br />Stellar Steel refined (available at the moment only from Daedric weapons and armor)\r<br />Two types of arrows upgraded, for each basic type \r<br />Carving/chisel/tanning  tools \r<br />\r<br />[color=red][i]added or changed:[/i][/color]\r<br />[list]\r<br />[*]77 meshes\r<br />[*]227 textures\r<br />[*]2 script\r<br />[/list]\r<br />\r<br />[color=grey]Almost all minerals can are obtained from mining (except just the lead), and both raw and refined minerals are on sale at the usual retailers.[/color]\r<br />\r<br />[color=red][size=3][i]installation:[/i]\r<br />IMPORTANT,[/size][/color][color=grey] This model replaces all the materials of the game and adds new ones, if you have other mods that do the same I recommend that they are removed before installing this in.\r<br />Unzip and overwrite the folders in the Rar file inside the Data folder of the game in the data selection panel launcher to activate the file NeV-P_EstremeMaterials.esm,  NeV-P_EstremeMaterialsENG.esp and NeV-P_EstremeMaterialsDWG.esp (only for Dawnguard users), and play. [/color]\r<br />\r<br />[color=red][size=3][i]Uninstall:[/i][/size][/color]\r<br />[color=grey]unmount the file NeV-P_EstremeMaterials.esm (or esp) from data launcher panel and remove all NeV-P_EstremeMaterials files from the data folder. [/color]\r<br />[color=red] The latest version (esm) will still need to load the next mods of the same series[/color]\r<br />\r<br />[color=green][size=5]If you liked  it an endorse will be appreciated, if not ... delete everything and that was that.\r<br />ColdFire[/size][/color]\r<br />\r<br />[Size=5][color=red]Of the same series:[/color][/size]\r<br />[size=3][color=yellow][url=http://skyrim.nexusmods.com/mods/26825]&#34;NeV-P_Extreme Amory&#34;:[/url][/color]\t\r<br />[color=grey]complete sets of armor and weapons related to these new materials. [/color][/size]\r<br />[size=3][color=yellow][url=http://skyrim.nexusmods.com/mods/24008]&#34;NeV-P_Titanium Dragon Equipment&#34;:[/url][/color]\t\r<br />[color=grey]Standalone evolution of the already known &#34;Tytanium Dragon Armor&#34;: new materials, better texture, complete sets and more power armors and weapons.[/color][/size]\r<br />\r<br />[color=red][size=5][b]Coming soon:[/b][/size][/color]\r<br />[size=3][color=yellow]&#34;NeV-P_Extreme Crystals:[/color]\t[color=grey]all crystals and gems of the game improved and more. [/color][/size]\r<br />[img]http://static-4.nexusmods.com/15/mods/110/images/23888-5-1347205866.jpg[/img]\r<br />[size=3][color=yellow]&#34;NeV-P_The Awakening:[/color]\t[color=grey]Cleaned up and improved version of the mod &#34;Tytanium Dragon Generation&#34;: best materials, textures, environments, creatures, quests.[/color][/size]\r<br />[img]http://static-4.nexusmods.com/15/mods/110/images/17486-1-1347209474.jpg[/img]\r<br />\r<br />[size=3][color=green]English translations by[url=http://skyrim.nexusmods.com/users/4654379] SONNYSPAK[/url][/color][/size]\r<br />\r<br />[color=red][size=5][b]IMPORTANT&#33;[/b][/size][/color]\r<br />[color=grey][size=3]&#34;The project Nev-P is looking for experts of script and animation, if you want to join our efforts are welcome. [/size][/color]\r<br />\r<br />\r<br />[color=red][size=5][b]Recommended mod:[/b][/size][/color]\r<br />[color=grey][size=3]Mighty Dragons 3 by erkeil[/size][/color]   http://skyrim.nexusmods.com/downloads/file.php?id=13423\r<br />\r<br />\r<br />DISCLAIMER\r<br />This mod is not perfect, I&#39;m not perfect. Be sure to keep a clean save than you can revert in case of any problems, before to install it.\r<br />=========================================================================================\r<br />\r<br />[center][color=darkblue][b][i][size=20]NeV-P[/size][/i][/b][/color][/center]\r<br />[center][color=darkblue][b][i][size=14]Extreme Materials[/size][/i][/b][/color][/center]\r<br />[center][color=green] (version 2.0)   by ColdFire [/color][/center]\r<br />\r<br />[color=darkblue][b][i][size=5]Questa MOD è dedicata a tutti i fanatici della forgia come me...[/size] [/i][/b][/color]\r<br />\r<br />[color=red]Versione 3: La Rivoluzione della Forgiatura[/color]\r<br />\r<br />[color=red]Versione 2.5.1:[/color]\r<br />[list]\r<br />[*] Completo re-pack della mod.\r<br />[*] Migliorate tutte le mesh delle frecce\r<br />[*] [size=3][b]Migliorate tutte le mesh dei materiali grezzi per una migliore corrispondenza con le texture[/b][/size]\r<br />[*] Aggiunte nuove texture per tutti gli oggetti Dwemer &#39;lavorabili&#39;\r<br />[*] [color=red][size=4][b] Migliorata la compatibilità con tutte le Mod &#39;Immersive&#39; e &#39;3rdEraWeapons&#39;.[/b][/size] (by request]  NOTA: Ora Immersive Loot può coesistere con Extreme Materials e Extreme Armory ma poichè essa cambia alcune impostazioni di Extreme per armi e armature; dovrete scegliere se usare le sue o le mie, semplicemente attivando o disattivando Immersive Loot.\r<br />[*] ordine di caricamento:\r<br />[*]\tDawnguard (Dawnguard users)\r<br />[*] \tSPIKE.esm (&#39;Immersive&#39; users)\r<br />[*] \t\tNeV-P_ExtremeMaterials.esm\r<br />[*]          3rdEraWeaponsMoS.esm (3rdEra users)\r<br />[*] \t\tNeV-P_ExtremeMaterialsENG (non Italian users)\r<br />[*] \t\t(or) NeV-P_ExtremeMaterialsENG_IP (non Italian, &#39;Immersive&#39; users)\r<br />[*] \t\tNeV-P_ExtremeMaterialsDWG (Dawnguard users)\r<br />[*]\t&#39;Immersive&#39; Mods (&#39;Immersive&#39; users)\r<br />[*]\t3rdEraWeaponMoS (&#39;3rdEra&#39; users) [/color]\r<br />[color=red]Versione 2.5:[/color]\r<br />[list]\r<br />[*]Modificato anche il Metallo Nanico e gli oggetti di produzione.\r<br />[*]Aggiunti due nuovi tipi di pelle, Scamosciata e di Sauro.\r<br />[*]Aggiunti quattro tipi di penne negli ingredienti e relativi quattro tipi di impennaggi per frecce.\r<br />[*]Aggiunto un nuovo metallo, l&#39;Acciaio Stellare.\r<br />[*]Modificate tutte le ricette utilizzando i nuovi materiali, basando su di una semplice regola: quello che vedi è quello che serve. Naturalmente le ricette sono basate sulle nuove armature i produzione su Extreme Armory.\r<br />[*]Modificati anche tutti i valori di mercato di armi ed armature, in relazione alle nuove ricette.\r<br />[*]Aggiunti nuovi Ceppi per il taglio delle essenze in altre segherie (grazie alla segnalazione di nonoodles)\r<br />[*]Aggiunte nuove ricette per l&#39;ottenimento dei materiali raffinati. Ora si potranno ottenere i materiali anche rifondendo armi ed armature inutilizzate. Siete stufi della vostra vecchia armatura, vi mancano i materiali e i venditori non ne hanno abbastanza, Avete raccolto armi e armature in quantità industriali&#33;? Fondetele e ottenete nuovi materiali grezzi per forgiare ciò che volete&#33;\r<br />Purtroppo il gioco al momento non permette di ottenere più oggetti da un oggetto unico per cui, per ora, dalla fusione di un&#39;arma o armatura si potrà ottenere solo la quantità relativa del materiale principale di cui è costituita. Di alcune armature si possono ottenere più materiali ma in questo caso si dovrà decidere quale di essi ottenere. Tutti i materiali secondari come cinghie e pezzi di pelle vengono persi nel procedimento.\r<br />[*]Aggiunto un nuovo tavolo da lavoro specifico per l&#39;arcieria. Ora tutti gli archi e frecce saranno forgiabili su di esso. Il tavolo è stato aggiunto a tutte le aree di forgiatura più importanti ed alle segherie stesse dove sono reperibili i legni per arcieria.\r<br />[*]Da ora per forgiare saranno necessari gli attrezzi, acquistabili come tutte le altre cose presso i commercianti e i fabbri stessi, oltre che in giro per il mondo... Tutta la varietà di oggetti esistenti nel monto di Skyrim dovranno pur servire a qualcosa&#33; \r<br />[*]Rettificati tutti i valori degli equipaggiamenti (di base), calcolati sul valore effettivo dei materiali da costruzione + una percentuale variabile rispetto al livello di equipaggiamento (dal 20% al 50%).\r<br />Da ora acquistare armature ed armi o frecce è un costo reale e non fittizio improvvisato. Questo fa il gioco della forgia più impegnativo, un gioco che può rendervi sul lastrico... o molto ricchi.\r<br />[*]Aggiunte alle ricette per frecce due nuove ricette per potenziare tutte le frecce di base costruibili. Per ogni tipo di base ora vi sono due nuovi tipi costruibili: Frecce Affilate e Frecce Dirompenti, con due livelli di potenziamento superiori (le ultime producono il doppio del danno ed ignorano l&#39;immunità alle normali armi). Il tutto, naturalmente, ad un giusto costo...\r<br />[*]Aggiunto NMM installer.\r<br />[color=white]IMPORTANTE[/color] consiglio disinstallre e cancellare tutti i file della versione vecchia prima di installare quella nuova, invece di sovrascivere semplicemente.  \r<br />[color=orange]LOAD ORDER:\r<br />Dawnguard\r<br />NeV-P_ExtremeMaterials (esm)\r<br />Unofficicial Patch\r<br />NeV-P_ExtremeMaterialsDGW (esp)\r<br />NeV-P_ExtremeMaterialsENG (esp)[/color]\r<br />\r<br />[color=red]Versione 2:[/color]\r<br />[list]\r<br />[*]migliorata la gerarchia di caricamento dei file: texture e mesh\r<br />[*]migliorate e corrette UV mapping di alcune mesh e texture.\r<br />[*]aggiunti quattro tipi di legni pregiati per arcieria. \r<br />[*]aggiunti tutti i materiali, compresi quelli nuovi alle liste dei venditori. I nuovi legni, che saranno aggiunti nelle liste di costruzione di &#34;Extreme Armory&#34; si potranno trovare in vendita presso i rivenditori di materiali in forma raffinata e presso le segherie, ove sarà presente un nuovo ceppo a cui si potranno tagliare solo le nuove essenze.\r<br />[*]Convertita la mod in file master, utilizzabile come base di per altre mod compatibili.\r<br />[/list]\r<br />\r<br />[color=white][size=3]Per ogni set saranno ora scaricabili anche tutti i texture template di base dei materiali, ad alta risoluzione, per tutti i canali necessari (_d, _alpha, _n, _nalpha, _m) come risorsa per tutti i modders che intendano utilizzare i nuovi materiali nei propri lavori. (naturalmente un piccolo credito è ben accetto)[/size][/color]\r<br />\r<br />[color=green][size=3]In questa Mod sono stati modificati tutti i materiali da forgia esistenti e ne sono stati aggiunti di nuovi.\r<br />I materiali sono stati modificati in forma grezza, in forma raffinata e nella stessa vena mineraria di estrazione. Modificati, migliorati ed aggiunti nuovi strumenti per la lavorazione e banchi da lavoro. Modificate tutte le ricette di base degli equipaggiamenti conformandole ai nuovi materiali; ugualmente l&#39;aspetto di tutti gli equipaggiamenti di base è stato rivoluzionato in &#39;Extreme Armory&#39; conformandolo all&#39;aspetto dei nuovi materiali.\r<br />Le texture sono state tutte ricreate in alta risoluzione partendo da immagini realistiche e documentabili dei minerali reali, per tutti i canali. Modificate anche le mesh nei canali relativi e necessari ed UV.[/size][/color] \r<br />\r<br />[color=red][size=3][i]Ora saranno così disponibili:[/i][/size][/color]\r<br />[color=red][size=3][i]modificati:[/i][/size][/color]\r<br />[color=grey]\r<br />Carbonella\r<br />Carbone\r<br />Corindone grezzo\t\t(in forma di Rubino massivo)\r<br />Ebano grezzo\t\t(non esistente in forma minerale reso con Geotite del \t\t\t\tMarocco)\r<br />Oro grezzo\t\t\t(oro nativo massivo)\r<br />Ferro grezzo\t\t(in pietra ferrosa ed ematite)\r<br />Malachite grezza\t\t(Malachite Mammellare)\r<br />Pietra di Luna grezza\t(Feldspato Adularia)\r<br />Argento grezzo\t\t(Argento nativo)\r<br />Mercurio grezzo\t\t(in natura (solitamente)presente a piccole gocce tra i \t\t\t\tcristalli di cinabro, reso in piccole sacche su roccia \t\t\t\tporosa (avete mai visto il  mercurio in lingotti? :P )\r<br />Carbonella da forgia\t(ora carbone minerale)\r<br />Corindone raffinato\t(Rubino puro (raffinato come resterà un mistero...xD)\r<br />Ebano raffinato\t\t(reso con Quarzo Calcedonio Occhio di Ferro)\r<br />Oro  raffinato\t\t(ora ottenibile anche tramite fusione di equivalente in \t\t\t\tmonete)\r<br />Ferro raffinato\r<br />Malachite raffinata\r<br />Pietra di Luna raffinata\r<br />Argento raffinato\r<br />Mercurio  raffinato\r<br />Acciaio\t\t\t(ora Ferro + Carbonio (carbonella)\r<br />Oricalco \t\t\t(metallo usato in antichità per il conio di monete e \t\t\t\t\tmonili: lega di Rame + Zinco)[/color]\r<br />Metallo Nanico\t\t(prima Oro rosso; ora Oro Rosso legato ad Acciaio Stellare)\r<br />[color=red][size=3][i]aggiunti:[/i][/size][/color]\r<br />[color=grey]\r<br />Ossidiana grezza\t\t(Ossidiana naturale)\r<br />Rame grezzo\t\t\t(Rame nativo)\r<br />Zinco grezzo\t\t(in natura legato in cristalli come Sfalerite, \t\t\t\t\t\tSmithsonite e Calamina: reso come agglomerati \t\t\t\t\t\tcristallini in pietra carbonatica)\r<br />Piombo raffinato\t\t(in vendita solo già raffinato)\r<br />Vetro raffinato\t\t(ottenibile ora con Ossidiana + Piombo)\r<br />Rame raffinato\r<br />Zinco raffinato\r<br />Frassino grezzo e raffinato\r<br />Ciliegio grezzo e raffinato\r<br />Tasso grezzo e raffinato\r<br />Radica grezzo e raffinato\r<br />Penne di corvo, falco, fagiano, pavoncella, uccello di luna\r<br />Impennaggi dei suddetti uccelli.\r<br />Acciaio Stellare raffinato (ottenibile per il momento solo da armi e armature Daedriche)\r<br />Due tipi di frecce potenziate per ogni tipo base\r<br />Attrezzi da intaglio/cesello/concia\r<br />\r<br />Quasi tutti i minerali sono ottenibili da vena mineraria (tranne appunto il Piombo, il Metallo Nanico e l&#39;Acciaio Stellare) e sia grezzi che raffinati sono in vendita presso i soliti rivenditori.\r<br />\r<br />Aggiunte o modificate:\r<br />[list]\r<br />[*]77 meshes\r<br />[*]227 textures\r<br />[*]2 script\r<br />[/list]\r<br />[/color]\r<br />\r<br />[color=red][size=3][i]Installazione:[/i]\r<br />IMPORTANTE,[/size][/color][color=grey] questa mod replica tutti i materiali del gioco e ne aggiunge di nuovi, se avete altre mod che fanno lo stesso vi consiglio che vengano rimosse prima in installare questa.\r<br />Decomprimere e sovrascrivere le cartelle contenute nel file .rar all&#39;interno della cartella dati del gioco; nella selezione dati del pannello del launcher attivare il file NeV-P_EstremeMaterials.esm e giocare. [/color]\r<br />Consiglio installazione tramite Fomod.\r<br />\r<br />[color=red][size=3][i]Disinstallazione:[/i][/size][/color]\r<br />[color=grey]disattivare il file NeV-P_EstremeMaterials.esm dal pannello dati del launcher e rimuovere i file relativi NeV-P_EstremeMaterials dalla cartella dati del gioco. [/color]\r<br />\r<br />[color=green][size=4]Se vi è piaciuta un voto sarà gradito, se non vi è piaciuta... cancellate tutto e chi s&#39;è visto s&#39;è visto.\r<br />ColdFire[/size][/color]\r<br />\r<br />[size=5][color=red]Della stessa serie:[/color][/size]\r<br />[size=3][color=yellow][url=http://skyrim.nexusmods.com/mods/26825]&#34;NeV-P_Extreme Amory&#34;:[/color]\t\r<br />[color=grey]set completi di armi ed armature correlati a questi nuovi materiali [/color][/size]\r<br />[size=3][color=yellow][url=http://skyrim.nexusmods.com/mods/24008]&#34;NeV-P_Titanium Dragon Equipment&#34;:[/url][/color]\t\r<br />[color=grey]Evoluzione standalone della già conosciuta “Tytanium Dragon Armor”: nuovi materiali, migliori texture, set completi e più potenza ad armature e armi.[/color][/size]\r<br />\r<br />[color=red][size=5][b]In uscita a breve:[/b][/size][/color]\r<br />[size=3][color=yellow]&#34;NeV-P_Master Of Cristals:[/color]\t[color=grey]tutti i cristalli e le gemme del gioco migliorati di più. [/color][/size]\r<br />[size=3][color=yellow]&#34;NeV-P_The Awakening:[/color]\t[color=grey]Versione ripulita e migliorata della mod “Tytanium Dragon Generation”: migliori materiali, texture, ambienti, creature, quest.[/color][/size]\r<br />\r<br />\r<br />[color=red][size=5][b]IMPORTANTE&#33;[/b][/size][/color]\r<br />[color=grey][size=3]&#34;Il progetto Nev-P è in cerca di esperti di script ed animazione, se desiderate unirvi ai nostri sforzi siete i benvenuti. [/size][/color]\r<br />\r<br />[color=red][size=5][b]MOD CONSIGLIATE:[/b][/size][/color]\r<br />[color=grey][size=3]Mighty Dragons 3 by erkeil[/size][/color]   http://skyrim.nexusmods.com/downloads/file.php?id=13423\r<br />\r<br />\r<br />Questo MOD non è perfetto, io non sono perfetto. Prima di installarlo assicuratevi di mantenere un salvataggio pulito da utilizzare per ripristinare il vostro gioco in caso di problemi.\r<br />",
  "categoryId": "29",
  "version": "2.5.5",
  "author": "ColdFire",
  "createdUnix": "1347203796",
  "updatedUnix": "1360889530",
  "containsAdultContent": false,
  "uploadedBy": "Dalmatan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "99219",
      "name": "YewWood",
      "version": "2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1745",
      "fileName": "TassoWood-23888-2.7z",
      "uploadedUnix": "1352810916",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/c45a68c24192c726aea4d558005ff7f54092512c61019bcfb9ca75fe959e3e30/analysis/1407261365/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TassoWood-23888-2.7z?fid=99219&ttl=1535794416&ri=8192&rs=8192&setec=a2fbaa79af022910ccef94ffbe61c038"
    },
    {
      "fileId": "99220",
      "name": "CherryWood",
      "version": "2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1739",
      "fileName": "CherryWood-23888-2.7z",
      "uploadedUnix": "1352811017",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/0791edd83e18287d522db874258c69114a5480527453476f01e0fc3964e9504a/analysis/1407261373/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CherryWood-23888-2.7z?fid=99220&ttl=1535794417&ri=8192&rs=8192&setec=a5a87e4ba1055eba900c142515ebb9dc"
    },
    {
      "fileId": "99221",
      "name": "AshWood",
      "version": "2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1606",
      "fileName": "AshWood-23888-2.7z",
      "uploadedUnix": "1352811082",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/8c3c2304829812ab9efdc375a7a6a0e47a7b093c420e1c39901fa6e47babae62/analysis/1407261374/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AshWood-23888-2.7z?fid=99221&ttl=1535794417&ri=8192&rs=8192&setec=8e126594e813687139a540452ec5ec32"
    },
    {
      "fileId": "99222",
      "name": "BriarWood",
      "version": "2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2332",
      "fileName": "BriarWood-23888-2.7z",
      "uploadedUnix": "1352811378",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/8298e1b1150d40018d39b6d2dea07d771fd9ab4731be1020682338a26ee85c1b/analysis/1407261378/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BriarWood-23888-2.7z?fid=99222&ttl=1535794417&ri=8192&rs=8192&setec=1a61f0577e65a48657d173f0708b83bc"
    },
    {
      "fileId": "99223",
      "name": "Corundum",
      "version": "2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "232",
      "fileName": "Corundum-23888-2.7z",
      "uploadedUnix": "1352811409",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/35ac10af75bea4c05e9054ce6fb0f5508e3a2cc852bba638c301b9f00d6aae9c/analysis/1407261379/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Corundum-23888-2.7z?fid=99223&ttl=1535794418&ri=8192&rs=8192&setec=1127cd7508e91d599d8b4db8064dfa3a"
    },
    {
      "fileId": "1000008322",
      "name": "Extreme Materials 2_5_3",
      "version": "2.5.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "95457",
      "fileName": "Extreme Materials 2_5_3-23888-2-5-3.rar",
      "uploadedUnix": "1360406329",
      "modVersion": "2.5.3",
      "virusScanUrl": "https://www.virustotal.com/file/bfb0168c31044ef0ade69d912b68b18d8ab4458dde77c12f67b7e5bcd3584b23/analysis/1407406882/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Extreme%20Materials%202_5_3-23888-2-5-3.rar?fid=1000008322&ttl=1535794418&ri=8192&rs=8192&setec=6f09da9a3caf20e4a69e8a1e1a0a8923"
    },
    {
      "fileId": "1000009741",
      "name": "EM_2-5-5_Fix",
      "version": "2.5.5",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "140",
      "fileName": "EM_2-5-5_Fix-23888-2-5-5.rar",
      "uploadedUnix": "1360839758",
      "modVersion": "2.5.5",
      "virusScanUrl": "https://www.virustotal.com/file/017afdc561a94ad99c79a43612078572e37eb38cfe06e7137f273d3febabc0c1/analysis/1407416767/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EM_2-5-5_Fix-23888-2-5-5.rar?fid=1000009741&ttl=1535794419&ri=8192&rs=8192&setec=f916ed3ed43c0ef66b768c3d15f67063"
    },
    {
      "fileId": "1000009939",
      "name": "Extreme Materials 2_5_5",
      "version": "2.5.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "96120",
      "fileName": "Extreme Materials 2_5_5-23888-2-5-5.rar",
      "uploadedUnix": "1360889530",
      "modVersion": "2.5.5",
      "virusScanUrl": "https://www.virustotal.com/file/cb9d183e6830f12508fee10ebd8b9bd4778c1e8cbdf671e9a894f57eca569c68/analysis/1407417939/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Extreme%20Materials%202_5_5-23888-2-5-5.rar?fid=1000009939&ttl=1535794419&ri=8192&rs=8192&setec=1a5111066ce9346ff72b7753c22515d5"
    }
  ]
}