{
  "modId": 23894.0,
  "modName": "Craftable Candles and Clutter",
  "summary": "Craft your own working candles to light up your life. -\r\nIncludes bowls, plates, and baskets, as well as a new item: soap.",
  "descriptionHtml": "Is your house too dark? Tired of living in a dank cave? Well now you can be civilized - no more trying to read your Brief History of the Empire by the moonlight coming through the cracks in your walls!\r\n\r\nThis mod adds a variety of movable, placeable, transportable, craftable, working candles.  No longer is your only option for lighting up your house dropping a torch on the floor.\r\n\r\n[b]F[/b]=Forge - [b]T[/b]=Tanning Rack - [b]C[/b]=Cooking Pot \r\n\r\nIncludes recipes for:\r\n-11 candles, including \r\n---a lantern [b]C[/b]\r\n---silver candlesticks [3] [b]C[/b]\r\n---the golden candlesticks seen in Sovngarde [3] [b]F[/b]\r\n---candles in bowls [b]C[/b]\r\n---candles on plates [b]C[/b]\r\n---candles in horns [b]C[/b]\r\n---a simple candlestick [b]F[/b]\r\n-candle holders without candles [4] (lantern, silver) [b]F[/b]\r\n-baskets [2] (for storing clutter) [b]T[/b]\r\n-wooden plate (necessary for candles on plates) [b]T[/b]\r\n-wooden bowl (necessary for candles in bowls) [b]T[/b]\r\n-soap (which does nothing, but you can throw yourself into a river and pretend like it does) [b]C[/b]\r\n-linen wrap (because I noticed some clothes crafting mods use linen wraps as ingredients) [b]T[/b]\r\n\r\nAlso includes one new ingredient, Animal Fat, which is pretty useless for alchemy but very nice for making candles.\r\n\r\nYour basic candle is the one in a horn that sits on a table, and it\\'s your only \\\"freebie\\\" - the only ingredient it requires is animal fat. All other candles require one other ingredient along with your basic candle. They will all show up in your crafting lists as soon as you have enough horn candles in your inventory to make them. For the candles which have candle holders you can make separately, you will have to make them first, as is only reasonable. To make the candles and candleholders at the forge you will have to have iron, silver, or gold ingots, as appropriate.\r\n\r\nNote that if you don\\'t have the primary ingredient, the recipes won\\'t show up - this means no more crafting list clutter and scrolling through pages of greyed-out names to find what you can craft! (Well, not from this mod, anyway.)\r\n\r\n\r\n[u]changes from Version 1:[/u]\r\n-Added 10 new candles, 4 candle holders, and linen wrap recipes\r\n-Removed the Tundra Cotton ingredient from candles. While I think that candles should realistically have wicks, there just isn\\'t enough tundra cotton in Skyrim to make it really feasible.\r\n-The lanterns you can find in the world can now be turned into light sources. Hooray for clutter that isn\\'t just useless junk!\r\n\r\n\r\n[u]Plans[/u]\r\n-Implement the Ruins and Imperial candles and the horn lamp. I tried this time but the ruins ones liked to pretend to be superballs and the imperial ones insisted on standing on their heads. If I get that fixed I will add them (but I seriously don\\'t know what I\\'m doing with NifSkope, so it may be a while).\r\n\r\n\r\n==============\r\nInstallation\r\n==============\r\nDownload with manager or manually place in your Data folder, as per usual. If it asks to overwrite Meshes, say \\'yes\\' (or else you candles will float in midair and not be moveable).\r\n\r\n\r\n==============\r\nCompatibility\r\n==============\r\n\r\nI don\\'t use any equippable lantern or candle mod, but I believe that these lanterns will not work with those because I created a new object which would not be accounted for by that file.\r\n\r\nOnly the original candle, the one in the bowl, will work with mods that douse and relight candles - again, because these are not objects that were in the original game. \r\n\r\nAnimal fat will only appear on variations of the original furry fauna (excluding elk - my mistake). I don\\'t think it will appear on any completely new animals created by other mods.\r\n\r\nAs always ratings/endorsements and sharing are appreciated.",
  "categoryId": "27",
  "version": "2",
  "author": "AnkhAscendant",
  "createdUnix": "1347210281",
  "updatedUnix": "1347713364",
  "containsAdultContent": false,
  "uploadedBy": "AnkhAscendant",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87447",
      "name": "Craftable Candles",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Craftable Candles-23894-1-0.rar",
      "uploadedUnix": "1347210552",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6561a4e321762df27f1457bb76ee0dd7074f654920b37c8fa79f906839561e86/analysis/1407156245/",
      "changelogHtml": " First release. 1 candle and several miscellaneous items. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20Candles-23894-1-0.rar?fid=87447&ttl=1535794429&ri=8192&rs=8192&setec=35668e8d4261b81a1b8c6a814d29a6ab"
    },
    {
      "fileId": "88590",
      "name": "Craftable Candles and Clutter v2",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "511",
      "fileName": "Craftable Candles and Clutter v2-23894-2.rar",
      "uploadedUnix": "1347713364",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/fe0eff1dbf10d5fb55efe0998bb574abf1872e079a8f8f79b838cd9c0967bf42/analysis/1407166863/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20Candles%20and%20Clutter%20v2-23894-2.rar?fid=88590&ttl=1535794430&ri=8192&rs=8192&setec=f0afbf13aa060679f2ae3dfe81c69faf"
    }
  ]
}