{
  "modId": 23910.0,
  "modName": "The Butterflys Bane and Amulet of Sior",
  "summary": "An iron sword which swings as fast as an iron dagger but does the same damage as an iron mace.  DPS is slightly higher than an Elven sword, slightly lower than an Ebony mace and exactly the same as a Glass dagger.  ",
  "descriptionHtml": "Do you love the look of the iron swords in Skyrim, but find them weak compared to all the other swords in the game? \r\n\r\nDo you get annoyed every time you hear a guard tell you, \\\"Iron? What are you killing, butterflies?\\\"\r\n\r\nDo you wish there was a story associated with or a way to use/reforge the broken iron sword at Ysgramor\\'s Tomb? \r\n\r\nThis is the mod for you! \r\n\r\nLong before the Oblivion Crisis, but long after the reign of Tiber Septim, two Companions roamed Skyrim: a Breton and a Nord. After helping an Orcish mage-smith drive Boethian cultists from her forge, she rewarded them with matching, iron swords. The Breton, Madadh (which means \\\"fox\\\"), received an iron sword which swung as fast as a dagger. The Nord, Bjorn (which means \\\"bear\\\"), received an iron sword which did the same damage as an iron mace. \r\n\r\nHowever, the leader of the Boethians merged the swords together and cursed it, causing the friends to kill one another. The Harbinger, unwilling for Boethia to receive glory for this deed, broke the sword and placed it at the foot of the statue of Ysgramor. \r\n\r\nTravel to Ysgramor\\'s tomb and collect the pieces of the broken iron sword, as well as the following items:\r\n\r\n* 1 Cave bear pelt (in lieu of a leather strip, for Bjorn)\r\n* 1 Fox pelt (in lieu of a leather strip, for Madadh)\r\n* 1 Butterfly in a jar (for speed)\r\n* 1 Bear claw (not the pastry, for strength)\r\n* 2 Iron ingots (you know ... for iron)\r\n\r\nBring them to Southfringe Sanctum (where the Orcish mage-smith once plied her trade), clear out the Orcish spellswords currently living there and you can make Butterfly\\'s Bane! This iron sword swings at the same rate as an iron dagger, but does the same damage as an iron mace. Without going into detail, this gives it DPS a little better than an Elven sword, not quite as good as an Ebony mace and exactly the same as a Glass dagger.\r\n\r\nAlso, because this is an ability of the sword itself (not an enchantment) it is immediately improveable at a grindstone and enchantable. \r\n\r\nI hope to incorporate the sword and the story into a mini-quest/mod later. There are things to learn before then. Until then, have fun with it! I suggest not enchanting it, getting the \\\"Elemental fury\\\" shout and both \\\"Dual Flurry\\\" perks. It\\'s a thing of beauty to watch that sword whipping about. Butterflies will flee at your coming! \r\n\r\nBy the way, I truly desire your comments and suggestions. Do you find the sword overpowered? Is the process of smithing it worth it or too long? Do you like it? \r\n\r\n--------------------------------------------------\r\n\r\nIn addition to the Butterfly\\'s Bane, this mod replaces the Ancient Nord Amulet in the Jarl\\'s room in Falkreath with the Amulet of Síor.  This amulet offers 15% resistance to magic and 50% resistance to poison.  \r\n\r\nFor those wondering about the lore related to the amulet, here you go.  Síor is a Celtic spelling of Sheor, the Breton version of the Nordic god Shor, whom the elves call Lorkhan.  The Nords revere Shor for the same reason the Elves hate Lorkhan, because he created Nirn and men.  This, of course, is good for men, but was apparently bad for the Elves (who believe they were immortal divines prior to the creation of Nirn).  The other Aedra ripped out the heart of Shor/Lorkhan and his body was torn asunder to create the two moons of Nirn.\r\n\r\nThe Bretons are half-elven, half-human; believed to have descended from captives taken after the Massacre at Saarthal.  They were taught by the Elves to fear Shor and call him Sheor, the \\\"Bad Man\\\" and source of all strife.  \r\n\r\nThis amulet was created by a Reachman (thus the Celtic spelling of Sheor) named Cellach (meaning \\\"strife) who believed he had been abandoned by the gods.  He, in defiance of the gods, devoted himself to Síor.  As he learned more about Síor/Shor/Lorkhan, he realized that he was one of the few Aedra or Daedra who cared for mankind and, thus, one of the few truly deserving of man\\'s devotion.  Hence, the amulet.  \r\n\r\nIncidentally, the enchantment is particularly suited to one who does battle with elves, especially Falmer.  It is especially useful for Breton werewolves who have completed the \\\"Book of Love\\\" quest and have the Lord Stone.  They will have 80% resistance to magic (the highest possible), 100% resistance to disease and 50% resistance to poison when wearing the amulet.  ",
  "categoryId": "55",
  "version": "1",
  "author": "criostoir",
  "createdUnix": "1347221905",
  "updatedUnix": "1347222163",
  "containsAdultContent": false,
  "uploadedBy": "criostoir",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87500",
      "name": "butterflysbane_siorsamulet",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Butterflys Bane-23910-1.zip",
      "uploadedUnix": "1347222163",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/157f9030bbeb2dc36bc38e9f84cbeea94a163812ad7cc3f608cb9a84a4fcd650/analysis/1407156724/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Butterflys%20Bane-23910-1.zip?fid=87500&ttl=1535794463&ri=8192&rs=8192&setec=bc6fb42bac1e44c1fbcb817cb69defff"
    }
  ]
}