{
  "modId": 23920.0,
  "modName": "Marsh Armor-Custom Ebony Argonian Hevy Armor",
  "summary": "My first mod! This is a custom Ebony armor specially made for Argonians (it works with all males).",
  "descriptionHtml": "[center]Note! this does not replace any armor in the game.\r\n\r\nThanks to everyone that endorses and downloaded my mod, honestly i did not think this would be noticed at all! So i really appreciate the support and all the great comments! And please, endorse or give me a pm, comment or such if you like it. Thanks! :)\r\n\r\nAND! i have decided to try something else, please follow the link and give me your thought :)\r\nhttp://forums.nexusmods.com/index.php?/topic/841551-project-deadric-mercenary-armor/\r\n\r\n[IMG]http://i.imgur.com/R7qTg.jpg[/IMG]\r\n\r\nSo after a lot of trial and error, i finally finished my first armor mod, i thought i\\'d put it out on the nexus.\r\n\r\n#Small update\r\nI noticed the file order in the main file was screwed up for some reason (by winrar).\r\nThat\\'s fixed, so if anybody had some problems installing the armor, it should work fine now.\r\n\r\n\r\nDescription:\r\nThe armor is of the heavy variant, and is currently only available for males, but who knows, maybe i\\'ll make one for you chicks as well.\r\nThe file is also uploaded to steam workshop.\r\n\r\nI used the vanilla Ebony armor as a base, and just worked my way around it to better fit my imagination of what an argoinian would wear.\r\nThe armor is craftable and upgradable, so here you have something that works (well.. at least for me). Looking back to when naming this armor, I could probably chose something like \\\"mercenary armor\\\" or something. Because that\\'s more of what I tried this to become\r\n\r\nI hope everybody likes and enjoys  it, and i will try to make a nice retexture in the near future.\r\nAlso feel free to leave a comment or pm me with some feedback, don\\'t be afraid to be a little harsh (i can take it).[/center]\r\n\r\nHow do i get it?\r\nYou can either craft it at a forge or get it by using the console.\r\nIf using the console, do the following:\r\nOpen the console in game by hitting the console button, located to the left of \\\"1\\\".\r\nType \\\"help marsh\\\"\r\nYou should then get 3 armor objects called: \r\nMarsh armor, Marsh gloves and Marsh boots.\r\nThen type \\\"player.additem (the number to the left of the name of the armor piece) 1\\\"\r\nDo this to all armor pieces, and it spawns in your inventory.\r\nEnjoy :)",
  "categoryId": "54",
  "version": "1.0",
  "author": "Spyke",
  "createdUnix": "1347234689",
  "updatedUnix": "1347263014",
  "containsAdultContent": false,
  "uploadedBy": "kimern88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87604",
      "name": "MarshArmor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1433",
      "fileName": "MarshArmor-23920-1-0.zip",
      "uploadedUnix": "1347263014",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c766d57c5194d3a23cc494c9c1c3c388f4bd01c36788c548705b558eae1ed1a6/analysis/1407157626/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MarshArmor-23920-1-0.zip?fid=87604&ttl=1535794475&ri=8192&rs=8192&setec=1bccd0c4b1893239cd612044637b23e5"
    }
  ]
}