{
  "modId": 23953.0,
  "modName": "Alagaesia",
  "summary": "This mod adds Alagaesia to Skyrim. It\\'s in a very early stage, but you have a heightmap 5 times bigger than Skyrim to play with. Have fun!",
  "descriptionHtml": "Hello all!\r\nWe at the Alagaesiacreationgroup are creating the lands described by Christopher Paolini in the Inheritance Cycle books with Skyrims engine.\r\n\r\nWhat will this include?\r\n\r\n- A vast new land 5x the size of the total Skyrim map, all of it playable. Done. Needs to be textured however. \r\n- A new magic system.\r\n- Dragon riding  \r\n- A lore friendly main quest following the story from the books\r\n- A second storyline that follows on the first created by the AlagaesiaCreationGroup\r\n- Side quests\r\n- Playable Alagaesian races\r\n- Everything fully voiced\r\n- (expansion) German, French and Spanish translations\r\n\r\nThis is a very large project and we\\'re aware that this will take a huge amount of time, we could greatly use your help. Visit us on http://www.alagaesiacreationgroup.tk if you wish to apply. \r\nWe especially need modellers/texturers, short on numbers for that. So anyone with those skills would be greatly appreciated!\r\nWe are also in dire need of animators, if you have the skills (they may be mediocre or little) please consider applying.\r\nModders wiht other skills such as drawing of concept art or scripting, quest writing, voice acting are highly welcome as well.\r\nIf you\\'re someone who has only recently has taken up modding then you\\'re welcome as well.\r\nThe benefit here is that you can get some experience and your mod will be put to good use.\r\n\r\nThe current contents of this mod is the empty continent of Alagaesia you can explore it by extracting the attached zip file in your skyrim data folder and typing in the console:\r\ncoc alagaesiaentrance \r\n[u] Recommended Console Commands When In Alagaesia [/u]\r\n- player.setav speedmult 500-1000 (Go faster) - If you don\\'t do this, it will take forever to get round the place. It\\'s just so big. It\\'s crazy. Be aware though, the default speed is 100. If you go round any higher than 1000, your Skyrim\\'s gonna crash sooner or later. And on less powerful machines, stick to 500-600. \r\n- tgm (God Mode) - Especially if you do the speed multiplier. Your gonna go up a hill, and die coming down it. You should be fine if you don\\'t multiply your speed, but if you do, then put on God Mode.\r\n-tcl (Toggle Collision) - If you can\\'t get up a mountain, then use this. Your probably familiar with this one. If your not, then I\\'m surprised. But I also salute you.\r\n\r\nAlso, one of our lead modelers is recruiting on the nexus page, for more information and images visit his nexus page at:\r\nhttp://skyrim.nexusmods.com/mods/26613\r\n\r\nNOTE: our forums can now be found at: http://www.alagaesiacreationgroup.tk instead of the acgteam.tk site.\r\n\r\nUPDATE 1: Carvahall map marker\r\nA very minor update that allows you to fast travel to the carvahall map marker or coc to carvahall. Simply extract the file in your Skyrim data folder, it will ask to overwrite the Alagaesia.esp file (obviously you allow it to overwrite the file).\r\n\r\nUPDATE 2: New esm is up, same way of installing as the map marker .esp, this version should solve any compatibility issues you might have",
  "categoryId": "30",
  "version": "0.02",
  "author": "Alagaesia Creation Group",
  "createdUnix": "1347305537",
  "updatedUnix": "1352716360",
  "containsAdultContent": false,
  "uploadedBy": "ACGteam",
  "primaryFile": null,
  "files": [
    {
      "fileId": "94716",
      "name": "Alagaesia - map marker fix",
      "version": "0.0.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4",
      "fileName": "Alagaesia-23953-0-0-3.zip",
      "uploadedUnix": "1350696813",
      "modVersion": "0.0.3",
      "virusScanUrl": "https://www.virustotal.com/file/af7526d0b04bc60351c017f7783193d1412237c9ab7865aacefeefdf50dcc43f/analysis/1407229382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alagaesia-23953-0-0-3.zip?fid=94716&ttl=1535794521&ri=8192&rs=8192&setec=2acb905877c4ab6423aec9d1736c8070"
    },
    {
      "fileId": "99007",
      "name": "Alagaesia - alpha",
      "version": "alpha",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "589224",
      "fileName": "Alagaesia - alpha-23953-alpha.zip",
      "uploadedUnix": "1352716360",
      "modVersion": "alpha",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alagaesia%20-%20alpha-23953-alpha.zip?fid=99007&ttl=1535794521&ri=8192&rs=8192&setec=f17ea68500fea2ea25a5ef0a30856023"
    }
  ]
}