{
  "modId": 23960.0,
  "modName": "Breton level 1 with all skills at 100 - 3 versions available",
  "summary": "Level 1/81 Breton with every skill maxed - distribute all perks and attributes freely. Very few quests logged, only one finished (Unbound). Very clean map, without clutter that gets in the way of exploring. No cheats used.\r\nAvailable as a pure human, werewolf or vampire lord.",
  "descriptionHtml": "The idea was to create a savegame that I could use to start future DLCs fully levelled, but with the option to assign perks however I pleased. Since I haven\\'t found anything like that on the Nexus (although admittedly I haven\\'t really looked) I figured someone else might want to make use of it as well. I adhered (or tried to) to the following criteria:\r\n- NO LEVEL-UP. That is to say, I raised all skills to 100 while staying on level 1. You will be entirely free to distribute all available perk points as well as attributes.\r\n- NO QUESTS. \\\"Unbound\\\" is finished, for obvious reasons. I did end up logging a few quests, although I have taken no steps to progress them.\r\n- NO EXPLORATION. I tried to keep the map as clear as possible. The exception was the major cities, i.e. the ones which you can fast-travel to from Whiterun. I managed to screw this up a bit, but the map is still neatly clean.\r\n- NO KILLING NAMED NPCs. The one exception that I let slide was Anise because she doesn\\'t provide any quests and I seriously wanted her cabin. Luckily, some bandits did the dirty work.\r\n- LEARN ALL SPELLS AND ENCHANTMENTS. Obviously this is impossible on level 1 and with the other limitations, but I learned everything I could.\r\n- MASTER DIFFICULTY AND NO CHEATS. Obviously. I did this for fun as much as profit. Anyone can cheat their way to a 100 in everything and anything below Master difficulty is not for me.\r\n\r\n\r\n\r\nGENERAL NOTES:\r\n- You \\\"start\\\" just where you would if you had just finished \\\"Unbound\\\". I sided with Ralof (Stormcloaks) simply because I haven\\'t done so before. I chose to play a Breton because they\\'re the most universally useful and a female because they\\'re at a slight advantage once you become an Agent of Dibella.\r\n- My Skyrim is quite extensively modded. It should work just fine without those mods but I haven\\'t really tested it. (If it does not work - or if you have any questions or suggestions - please contact me and I\\'ll do what I can.) Since your newly acquired Breton is likely to look like hell as a result, I recommend using the \\\"showracemenu\\\" console command - it\\'s not really cheating if it has no bearing on gameplay, now is it? By the same token, the saves should work without Dawnguard. Also, I\\'m using a mod that replaces Candlelight and Magelight. I\\'m not sure what will happen if you load the saves without the mod - you might have to acquire the light spells again.\r\n- \\\"Wolf Queen Awakened\\\" has a level-up trigger - being at level 81 will make it impossible for you to receive the Letter from Falk Firebeard. You will thus be unable to ever receive the Shield of Solitude and its Resist Magic enchantment. (No downloaded fix has worked for me so far ...) But of course, you\\'re free to do the prerequisite quest on level 1.\r\n- You\\'re starting with the Apprentice Stone magic effect activated, so be careful around magic until you replace it.\r\n- Your inventory contains some crap Equipment that should be quite enough to get you to Whiterun considering you\\'re starting at a 100 in everything, plus 700+ lockpicks left over from levelling. Also, Eltrys\\'s Note (unread). In addition to that, the cupboard in Anise\\'s cabin (just opposite the Guardian Stones) contains nearly 200k in gold, 5 sets of clothing/jewelry for enchanting, plus 100 filled Grand Soul Gems.\r\n- It should be pretty clear from my criteria outlined above, but you have no dragon souls or shouts at your disposal. Also, no enchantments or spells that cannot be acquired except by questing or marking a location other than major cities. Similarly, I picked up no unique and/or quest items (except Eltrys\\'s Note). (//Hasty edit: I did manage to pick up the Notched Pickaxe and unfortunately it\\'s already disenchanted. Sorry.)\r\n- Some unique dialogues and/or cutscenes have already been triggered, most notably the ones that happen upon entering Markarth and Solitude. Just saying. I may also have cleared some locations from afar. (There\\'s only so much beating a horse can take ...)\r\n\r\n\r\n\r\nENOUGH WITH THE NOTES ALREADY!\r\n- SAVE #470 is the base character. All skills are maxed but the character is purely human.\r\n- SAVE #475 is based on Save #470. All skills are maxed and all werewolf perks acquired - the Breton is a werewolf. For obvious reasons, this means that I started the Companions questline. This is the same character but strictly better - unless you\\'re a purist.\r\n- SAVE #480 is based on Save #475. All skills are maxed and both the werewolf and vampire lord perk trees are filled - the Breton is a vampire lord. To do this, I had to start the Dawnguard questline (duh) and since it takes somewhat longer to become a vampire lord than it does to become a werewolf, I do not recommend this save to players who are not yet familiar with Dawnguard. This character is technically not strictly superior to the other two but it would be hard to argue that Necromage is not the best perk, period. Still, vampires aren\\'t for everyone.\r\n\r\n\r\n\r\nSO WHO\\'S THIS FOR?\r\nWell, for me.\r\nI was thinking along the lines of players who don\\'t want to start over whenever a new (real) DLC comes out, players who want to try out different perk configurations, roleplayers who don\\'t want to level all of their distinct personas, players who\\'d rather enjoy the story and environment than level, players who don\\'t have enough time, etc.\r\nBut really it\\'s for anyone who\\'d like to download it.\r\n\r\nWHO ISN\\'T THIS FOR?\r\nWell, for people who don\\'t want to download this, obviously. Players who enjoy levelling, players who don\\'t like it too easy, players who damn well want to play the game themselves, and so forth.\r\n\r\n\r\n\r\n--------------------------------------------------------------------------------------------------------------------------\r\n\r\nAs an aside, a big thank-you to every modder out there taking the time to make the game more enjoyable in some little way. Don\\'t forget to endorse anyone who uploaded anything you enjoyed.\r\nThank you.",
  "categoryId": "43",
  "version": "1.0",
  "author": "NomanPeopled",
  "createdUnix": "1347312278",
  "updatedUnix": "1347313119",
  "containsAdultContent": false,
  "uploadedBy": "NomanPeopled",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87713",
      "name": "NPsaves",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9608",
      "fileName": "NPsaves-23960-1-0.rar",
      "uploadedUnix": "1347313119",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9f892a199a54bd4ebe7e7f97e301f6a45a3bce949a2651a2b3470296c26fc5f9/analysis/1407158529/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NPsaves-23960-1-0.rar?fid=87713&ttl=1535794529&ri=8192&rs=8192&setec=24d399583867bdb30ac5396e2239ffcc"
    }
  ]
}