{
  "modId": 23971.0,
  "modName": "Research Thief",
  "summary": "This mod finishes and activates Research Thief- an unfinished, unmarked College of Winterhold sidequest in which the player is asked to steal Faralda\\'s research notes and bring them to Nirya. The player is also given the option of turning Nirya in to Faralda.\r\n\r\nNote that whoever you complete the quest for will become a potential marriage candidat",
  "descriptionHtml": "There are a handful of unfinished quests in the Skyrim files, viewable only through the console or Creation Kit. Many of these quests are fully voice-acted and mostly scripted, but for one reason or another don\\'t exist in game.\r\n\r\n\\\"Research Thief\\\" is one such quest. It was to be a small College of Winterhold sidequest in which Nirya would ask you to steal the research notes of her rival Altmer, Faralda. The quest would have allowed you to do so for a handful of gold or report this offer to Faralda for a slightly smaller handful of gold.\r\n\r\nNow, thanks to this mod, you can complete this little mundane fetch quest and enjoy the voice-acted dialogue!\r\n\r\nBut why would you want to, you ask? Why, because doing so will win the favor of either Faralda or Nirya, making both marrigeable, increasing the number of marriageable female Altmer from 1 to 3!",
  "categoryId": "35",
  "version": "v1.0",
  "author": "TC01",
  "createdUnix": "1347324606",
  "updatedUnix": "1347324698",
  "containsAdultContent": false,
  "uploadedBy": "TC01",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87742",
      "name": "Research Thief",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Research Thief-23971-v1-0.zip",
      "uploadedUnix": "1347324698",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/befb34ad54b30ffdf8dbe3f26c47051d27121cdabc9bba992cc2f47127d98ccb/analysis/1407158826/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Research%20Thief-23971-v1-0.zip?fid=87742&ttl=1535794550&ri=8192&rs=8192&setec=3b8aed1f73ac43c4dc29fa27b3099e0e"
    }
  ]
}