{
  "modId": 23987.0,
  "modName": "Candle Pond Ranch",
  "summary": "Medium to large Player home near Cradlecrush Rock in between Whiterun and Windhelm. Warm inviting fully staffed home for you and your followers with beautiful scenery, harvestable food, milkable cows, stables, crafting and all the requirements of a comfortable home.",
  "descriptionHtml": "Now in Two versions:\r<br />One with Custom Female Mannequins and One with Default Bethesda mannequins. Please see bottom of page for further details.\r<br />\r<br />Located in rural Eastmarch just behind Cradlecrush rock and midway between Whiterun and Windhelm this free house and farm is a small distance off the main road. Fast travel is either to the front door or to the farm area close to the stable block.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/Modding%20Skyrim%202nd%20Aug/3MorningatCandlePond.jpg[/img]\r<br />The house contains a total of fourteen rooms and an additional galleried balcony. It is only moderately lore friendly as it has plumbed water. Decorated throughout in noble style the house has a lot of decoration and clutter but nearly all of it is statics. \r<br />Much of what looks like clutter or decoration is actually themed storage.  \r<br />Most of the storage has a few items in but nothing high end. No freebies here&#33;  It is fully navmeshed and follower friendly and comfortably sleeps 9 followers. If the owner wished to share a further three can be accomodated in the master bedroom and (if the servants were disabled) a further 3 in the basement apartment. \r<br />The house would suit a player who likes rural life in beautiful scenery in a property which accomodates followers and who appreciates crafting, mining and being able to grow and harvest their own food, the house is fully staffed so it never feels totally empty. The staff are not recruitable (by choice - I like to come home to a lived-in home).\r<br />Front door has large outdoor porch and seating. Reception room has relaxed seating for 8. Two large drop chests are on either side of the door entry.  There are two fireplaces and the large dining table seats 10. Stairs lead up to the first floor.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/TESV2012-08-2208-12-54-69.jpg[/img].\r<br />Crafting room with themed storage for alchemy and enchanting which has a fireplace and 2 seats.\r<br />Large fully equiped kitchen, containing themed decor and themed storage for raw meats, raw fish, cooked savoury food, deserts, eggs, honey, ales, fruit & vegetables. It also is equipped with a plumbed in kitchen sink, large range, counter display a stool and a chair.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/Modding%20Skyrim%202nd%20Aug/25KitchenView.jpg[/img]\r<br />Continuing from the kitchen there is a small display room containing 7 full sized mannequins (nord female nudes), 4 full sized and four small weapon display cases, 7 armor storage chests, 6 wall plaques each taking 2 swords and a shield, and 15 weapon racks. Fireplace.\r<br />leading off the display room are 3 guest bedrooms, two of which contain one double and one single bed, one containing 3 single beds all with additional seating.\r<br />Finally a fully equiped and plumbed bathroom with toilet, shower, bath, seat and sink. \r<br />Corridor containing another large storage chest leading to the back door.\r<br />\r<br />The first floor contains a galleried balcony with further seating and an indoor container garden alongside shrines to Mara and Dibella.\r<br />Continuing through the doors from the balcony is the Library. This room contains the office space used by the caretaker and house carl Hakon Logmarson.   3 Winterhold bookcases, themed scroll storage, 12 small and 2 large player operated bookcases storing a total of 352 displayed books. Shrines to the remaining 7 divines, a fireplace and seating for four (five including Hakons chair - he does his paperwork in the afternoons). [img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/TESV2012-08-2121-58-51-69.jpg[/img]\r<br />Leading from the library is the master bedroom containing 2 double beds, the bed furthest from the door provides the well rested bonus. There is a large amount of storage space, a desk, seating for 3 around the fireplace and one mannequin to display your favorite armor. \r<br />\r<br />Returning to the kitchen the stairs lead down to the two bedroomed basement apartment belonging to Hakon, his wife Kelda and their daughter, fifteen year old Signy. Together these three maintain the house, garden and farm when you are away. Kelda is also the farm blacksmith. All three are armed but weapons are not equiped indoors.\r<br />\r<br />The rear door to the property leads out to a deck and the working ranch. The ranch is walled on three sides, access from Cradlecrush rock and the house forming the fourth side. There is a large fenced vegetable patch containing harvestables including blueberries, potatoes, cabbages, carrots and garlic. A gate leads through to a mountain pasture where there is harvestable wheat, in this area there is also an archery target range and a few feet away there is Iron ore to be mined. \r<br />[img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/TESV2012-08-2122-21-39-16.jpg[/img]\r<br />Returning through the gate the new owner can view some of the livestock: 2 cows, 4 goats and a small flock of chickens (which nest under a ruined archway), near to the stables which could possibly house up to 8 horses with relative ease. \r<br />The cows are milkable, hover the cursor around the main part of their bodies and click E, they produce milk and cream once per day, this mod is not a hearthfire mod so the milk and cream are potions. \r<br />There is a large covered crafting area which contains all the facilities required to produce weapons and armor, including a smelter and 9 labelled storage chests, the steps and path to the door are lit at night.  \r<br />[img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/TESV2012-08-0203-22-59-91.jpg[/img]\r<br />Behind the stables is a second gate to another mountain meadow also with iron ore deposits. Both meadows have beautiful views. Trees screen the house on most sides, the giant at Cradlecrush is usually quite placid and there are many ways which lead around his area to get to the road, although when approaching by road it is advisable to leave the path to Cradlecrush before the last bend and take the grass path to the south of his area, if you ride straight into his home he may attack. Once you are at the house he doesn&#39;t approach and can&#39;t be seen.\r<br />\r<br />All the containers, chests and wardrobes are safe storage, the only exception is the alchemy satchel which does respawn.\r<br />\r<br />Known issues: The usual mannequin movement bug until you activate them and give them clothing. You may have to repeat this if you go in and out several times without saving and reloading. \r<br />\r<br />This is a large house and property containing a lot of statics. A high end machine would be best to run it.\r<br />\r<br />No known conflicts but it will obviously conflict with any mod which alters the landscape near Cradlecrush rock. \r<br />As seems usual with Skyrim too many house mods will cause issues.\r<br />For those experiencing the &#34;floating&#34; grass issue, this is a Bethesda bug and nothing to do with this mod adding anything strange. This fix is:\r<br />Open, in your documents folder, the Skyrim.ini AND SkyrimPrefs.ini with notepad or other similar text editor and in the [grass] section\r<br />add the following\r<br />bAllowLoadGrass=0\r<br />bAllowCreateGrass=1\r<br />bDrawShaderGrass=1\r<br />that will fix the issue for you after adding those lines save the files and reload the game and it should be sorted.\r<br />\r<br />For anyone looking for a smaller property check out my latest mod Bridge Farm My link\r<br />\r<br />Grateful thanks to the following:\r<br />Brendan62 for inspiring house mods and his help in putting me straight when I went wrong. His own beautiful homes are Autumn Lodge at  [url=http://skyrim.nexusmods.com/mods/10243]My link[/url] and Riverwood Falls Lodge at [url=http://skyrim.nexusmods.com/mods/17681]My link[/url]\r<br />The Winterhawk for different storage ideas, her lovely ranger home is at [url=http://skyrim.nexusmods.com/mods/14660]My link[/url]\r<br />berticus0001 for his tutorial on activators and general help and advice and allowing me to use and adapt some of his ideas (taps, shower and staircase - thanks Bert). Check out Berts breezehome remodel (the best - and certainly the most novel - Breezehome out there) at [url=http://skyrim.nexusmods.com/mods/8922]My link[/url] and his tutorial website at [url=http://bertscktutorial.ucoz.com]My link[/url]\r<br />I also recommend Berts mannequin fix (at least for me it stops the wretched things undressing every time you wander off for a couple of days) at [url=http://skyrim.nexusmods.com/mods/36301]My link[/url]\r<br />\r<br />\r<br />Credits\r<br />Blary for Booksets, food container meshes, open books and potion shelves\r<br />ChickenDownUnder for Harvestables\r<br />DarkRider & team CelticDecor for paintings and frames\r<br />Oaristys & Tony67 for various meshes in the Modders resource pack\r<br />Tonynarko67 for Shelf Scrolls\r<br />Artisanix for paintings and frames\r<br />yourenotsupposedtobeinhere for new rugs\r<br />Lilith for filled bowls\r<br />Berticus for the milking and undressing scripts\r<br />Phaedra for the meshes and textures for milk and cream\r<br />.................................................................................\r<br />Change log 23rd April\r<br />Added optional downloads containing facegendata only for those with barcoding problems on faces\r<br />.................................................................................\r<br />Change Log 16th April 2013\r<br />Two new versions uploaded to correct a few nifs that were giving problems. The only nif which has been completely changed is the one for the mead barrel outside the alchemy and enchanting room, it should be fine but just to be on the safe side just remove items from that storage barrel before downloading the new versions and overwriting. There is no need to move anything else or go elsewhere in game.\r<br />.................................................................................\r<br />Change Log 9th April 2013\r<br />Two new versions uploaded. Occlusion planes added, markers for both player and followers to sit in the bath and on the sidea of the bath removing the need to use another mod to do so.\r<br />PLEASE make sure your followers are not in the bathroom before saving and exiting the game. Load the new version on and overwrite. It should not be necessary to go elsewhere in game. \r<br />.................................................................................\r<br />Change Log 23rd Feb 2013\r<br />Two new versions to correct a small error that was discovered in the undressing script.  All sorted now :)\r<br />PLEASE make sure your followers are NOT in the bathroom before saving and exiting the game. Load the new version on and overwrite as usual. No need to move anything or go anywhere.\r<br />.................................................................................\r<br />Change Log 16th Feb 2013\r<br />Jumped version numbers to prevent any later confusion.\r<br />CandlePondRanch\r<br />Custom Mannequin Version. v3.0\r<br />CandlePondRanchDefaultMannequin\r<br />Bethesda mannequin version. v4.0\r<br />\r<br />Quite a few changes. To upgrade to these versions it will be necessary to move away from Candle Pond, preferably to another interior location. Save your game.  Load on the new version to overwrite. Load the game and sleep or kill a dragon or something for 24 hours before returning home. No chests or storage have been altered so it is not necessary to move anything.\r<br />\r<br />Cows are milkable with an animation - please note this mod is not hearthfire dependent therefore the milk and cream that the cows produce are custom potions (the milk does have the same stats as the hearthfire milk) - there are a few static versions in the house but if you want the potion form you&#39;ll have to milk the cows once a day. Stand facing the body of the cow and click E somewhere in its belly - the cows won&#39;t tell you they can be milked but they will tell you if they have already been milked that day. I haven&#39;t made another storage for milk and cream - they are dairy products and can probably be stored happily with the cheese.\r<br />\r<br />The bathroom will now allow your followers and yourself to bathe without clothes on, you will get a message when your inventory is removed. Your inventory will be returned to you (with a message to say so) as soon as you walk away from the bath and shower part of the bathroom and you can get dressed. Your followers will automatically re-dress as they walk out - please note they will put on whatever has the best stats in their inventory and not necessarily what they were wearing before, so check their clothes before venturing into the world. \r<br />A small step to the bath has been added, some NPC&#39;s will use it, some will just get in the bath by walking through the sides or just appearing in it, there doesn&#39;t seem any reason why some will use the step and some won&#39;t. \r<br />You can sit on the edge of the bath or in the bath yourself, it looks better in 3rd person.\r<br />\r<br />Navmesh has been tidied up a bit\r<br />Table has had 2 chairs removed to prevent the NPC&#39;s from colliding.\r<br />Toilet flush will now automatically shut off after a few seconds.\r<br />The plant pots which weren&#39;t static have been made static.\r<br />\r<br />Mod has had a few errors corrected - thanks to spanian77 for pointing them out.\r<br />Re cleaned with Tes5edit, no navmesh errors or identical to masters are reported.\r<br />.................................................................................\r<br />Changes:\r<br />21st Dec 2012. Versions 1.8 and 2.8 added. Deleted navmesh issue dealt with. Cleaned again with Tes5Edit. Bench by pond made into furniture.  Should be fine to just overwrite without any other hassles. \r<br />29th Oct 2012  Version 1.7 and 2.7 added. Now cleaned with Tes5Edit. No necessity to move anything, simply overwrite with new versions.\r<br />30th Sept V1.6 & 2.6\r<br />Previous users need to:\r<br />Remove EVERYTHING from the mannequins and remove EVERYTHING from ALL of the kitchen storage.  \r<br />All of the chests are still safe so things can be put in them temporarily.\r<br />After putting things safely away, move to a different location away from Candle Pond, preferably an interior cell.\r<br />Save the game.\r<br />Load on new version.\r<br />Go into game and wait 24 hrs or sleep.\r<br />All should then be well.\r<br />\r<br />Changes:\r<br />Storage been made properly static\r<br />Mannequins have been moved slightly further away from the wall to prevent them being pushed away from it by marker. (I have been told it helps to prevent them going for a waltz in your absence).\r<br />Screens in main living area have been moved slightly to make movement easier\r<br />Lighting in basement and a few bits of lighting throughout the house have been tweaked.\r<br />Outside a couple of floating ferns have been replanted.\r<br />  -------------------------------------------------------\r<br />23rd Sept\r<br />V1.5  Custom Mannequin version.   All this one changes is the ale storage in the kitchen that was in the box on the floor by the vegetable storage. It has been moved to the shelving unit next it to prevent it being &#34;kickable&#34;. That&#39;s all it changes. If you want this version then the only thing you need to do is empty that box, save someplace out of the house and load this version on to overwrite, all else remains the same so if you were happy with the box where it was then don&#39;t bother to download :) It may be necessary to leave the house and go to another indoor cell and sleep for 24 hrs to kick start the changes after installing the version.\r<br />V2.5 Bethesda Mannequin Version.  As above except it also tidies up the very quick fix that I did on the counter in the kitchen for version 2.4 which was fractionally out of alignment with the rest of the counter. It may be necessary to leave the house and go to another indoor cell and sleep for 24 hrs to kick start the changes after installing the version.\r<br />  -------------------------------------------------------\r<br />20th Sept. New version is available. It will be necessary to remove items from salt, egg & fish storage but everything else should be fine. This update is to correct an issue where some players reported storage moved. Everything is now nailed in place as best as I can.  There is additional storage for crockery as requested by a user. It should also correct the problem one user reported where books turned up in odd locations. Additionally files have been tidied up and so are smaller, hopefully that helps with CTD&#39;s.\r<br />Version 1.4 is file with custom mannequins.\r<br />Version 2.4 is file with Bethesda mannequins.\r<br />  -------------------------------------------------------\r<br />17th Sept. Version 1.3 is the corrected version of the original mod, fixes the wall weapon plaques which were reported as glitchy and slightly alters the lighting on the wall opposite the beds in the master bedroom to prevent the ceiling lighting issue. Other than that there are no changes. It shouldn&#39;t be necessary to remove everything from the house but would be advisable to save when you are in another cell before loading it on to overwrite the existing version. If there is a problem you can go back to the save and do what is advised for players loading v 2.3.\r<br />\r<br />Version 2.3 is a new version which has vanilla mannequins instead of the custom female nords. This one is a different esp entirely. To use this it WILL be necessary to remove everything from the house and cell, save your game in a different (preferably interior) cell. Uninstall the previous version. Reload the save. Then save and exit the game and load the new version. \r<br />Not fun carting stuff about like that but no other way round it if you want to use the new version instead of the original.\r<br />\r<br />------------------------------------------------------------------------\r<br />Thanks to Skyrim Cribs, hodilton,The Opology, Brodual,iThEcAzZ and SpizzificationN for the vids.  \r<br />[youtube]3Y-A7VpP9QM[/youtube]    [youtube]HXpAHWrt0fQ[/youtube] \r<br />[youtube]dkF54jwmed4[/youtube]    [youtube]jTKfCHwkP1A[/youtube]\r<br />[youtube]3g1Pp67S7CY[/youtube]    [youtube]Us3uZTGgmp4[/youtube]",
  "categoryId": "67",
  "version": "4.4",
  "author": "Gentester",
  "createdUnix": "1347356240",
  "updatedUnix": "1375812389",
  "containsAdultContent": false,
  "uploadedBy": "gentester",
  "primaryFile": null,
  "files": [
    {
      "fileId": "96417",
      "name": "CandlePondRanchDefaultMannequin",
      "version": "2.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23748",
      "fileName": "CandlePondRanchDefaultMannequin-23987-2-7.rar",
      "uploadedUnix": "1351477409",
      "modVersion": "2.7",
      "virusScanUrl": "https://www.virustotal.com/file/aa60ba4df6b19fdcb497e539b14b20c7b1582ea76c4ebf2e6bf669ef12ea12d4/analysis/1407240252/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CandlePondRanchDefaultMannequin-23987-2-7.rar?fid=96417&ttl=1535794569&ri=8192&rs=8192&setec=d9c5223fb1f5d9169809c880c3cf8b2a"
    },
    {
      "fileId": "106668",
      "name": "CandlePondRanchDefaultMannequin",
      "version": "v2.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23756",
      "fileName": "CandlePondRanchDefaultMannequin-23987-v2-9.rar",
      "uploadedUnix": "1356129873",
      "modVersion": "v2.9",
      "virusScanUrl": "https://www.virustotal.com/file/df0efa61ca45e27a4e9cc3d57cc4498e84cdcf652c7ec754bde7dc088b8aa6be/analysis/1407316096/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CandlePondRanchDefaultMannequin-23987-v2-9.rar?fid=106668&ttl=1535794569&ri=8192&rs=8192&setec=ee64d90b92de712e28308f17510e7b87"
    },
    {
      "fileId": "1000010350",
      "name": "CandlePondRanch",
      "version": "v3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "25524",
      "fileName": "CandlePondRanch-23987-v3-0.rar",
      "uploadedUnix": "1361046926",
      "modVersion": "v3.0",
      "virusScanUrl": "https://www.virustotal.com/file/34f5bf71c9c41cf6a062bd359cbdb1f79af250b9d0a7a82f56c52117020dc0e2/analysis/1407420986/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CandlePondRanch-23987-v3-0.rar?fid=1000010350&ttl=1535794570&ri=8192&rs=8192&setec=e191257bf61aba022356930c32acacad"
    },
    {
      "fileId": "1000010353",
      "name": "CandlePondRanchDefaultMannequin",
      "version": "v4.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24669",
      "fileName": "CandlePondRanchDefaultMannequin-23987-v4-0.rar",
      "uploadedUnix": "1361047571",
      "modVersion": "v4.0",
      "virusScanUrl": "https://www.virustotal.com/file/27e6037b56f54b3feced972c3a57109f292a6b999a56ed4f61d20fe548b03e46/analysis/1407421036/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CandlePondRanchDefaultMannequin-23987-v4-0.rar?fid=1000010353&ttl=1535794571&ri=8192&rs=8192&setec=cc06228c917671e65bdc8a1de96c5dba"
    },
    {
      "fileId": "1000012297",
      "name": "CandlePondRanch",
      "version": "V3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "25521",
      "fileName": "CandlePondRanch-23987-V3-1.rar",
      "uploadedUnix": "1361592378",
      "modVersion": "V3.1",
      "virusScanUrl": "https://www.virustotal.com/file/e4b3d28964a11b7001d484ee1b25a51c361066be3282da88c2df269ff93b9efa/analysis/1407434065/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CandlePondRanch-23987-V3-1.rar?fid=1000012297&ttl=1535794571&ri=8192&rs=8192&setec=69d8603dd6bc74fb924cbb55593678ce"
    },
    {
      "fileId": "1000012303",
      "name": "CandlePondRanchDefaultMannequin",
      "version": "V4.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24668",
      "fileName": "CandlePondRanchDefaultMannequin-23987-V4-1.rar",
      "uploadedUnix": "1361592750",
      "modVersion": "V4.1",
      "virusScanUrl": "https://www.virustotal.com/file/d6ed80d14db1d54d2588849c6556bf7e73154b46466e9c161070ce8a9efa5b5d/analysis/1407434189/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CandlePondRanchDefaultMannequin-23987-V4-1.rar?fid=1000012303&ttl=1535794571&ri=8192&rs=8192&setec=490c2dbc02d6fdad8c195fe7f5d2ad92"
    },
    {
      "fileId": "1000023384",
      "name": "Candle Pond Ranch",
      "version": "3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24673",
      "fileName": "Candle Pond Ranch-23987-3-2.rar",
      "uploadedUnix": "1365472257",
      "modVersion": "3.2",
      "virusScanUrl": "https://www.virustotal.com/file/7abf7b6a3bb4b8e4f454720e6fe7fe0b6fc55a59f1390b922d6d02831461208a/analysis/1407513622/",
      "changelogHtml": " Occlusion planes added. Markers for player and npc to sit in bath added <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Candle%20Pond%20Ranch-23987-3-2.rar?fid=1000023384&ttl=1535794572&ri=8192&rs=8192&setec=cfa14feac93ffad265a7e45346dd9d94"
    },
    {
      "fileId": "1000023385",
      "name": "Candle Pond Ranch Default mannequin",
      "version": "4.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24564",
      "fileName": "Candle Pond Ranch Default mannequin-23987-4-2.rar",
      "uploadedUnix": "1365472725",
      "modVersion": "4.2",
      "virusScanUrl": "https://www.virustotal.com/file/6a32794ce200c9f39aee3b8572326d674a1a5c217e0b03cf68466a02f7d3bbad/analysis/1407513637/",
      "changelogHtml": " Occlusion planes added. Markers for player and npc to sit in bath added <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Candle%20Pond%20Ranch%20Default%20mannequin-23987-4-2.rar?fid=1000023385&ttl=1535794572&ri=8192&rs=8192&setec=2949cd3a9098ff87c76880056548db48"
    },
    {
      "fileId": "1000024725",
      "name": "Candle Pond Ranch",
      "version": "3.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24690",
      "fileName": "Candle Pond Ranch-23987-3-3.rar",
      "uploadedUnix": "1366082363",
      "modVersion": "3.3",
      "virusScanUrl": "https://www.virustotal.com/file/db5105fffa2765d2be188fae7302101972a8ed7a9cd07b4e16d2e127e1ef012e/analysis/1407524749/",
      "changelogHtml": " 16th April New version uploaded to correct some nifs <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Candle%20Pond%20Ranch-23987-3-3.rar?fid=1000024725&ttl=1535794573&ri=8192&rs=8192&setec=91261bb7828299755cbd80c3465a987d"
    },
    {
      "fileId": "1000024727",
      "name": "CandlePondRanchDefaultMannequin",
      "version": "4.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24581",
      "fileName": "CandlePondRanchDefaultMannequin-23987-4-3.rar",
      "uploadedUnix": "1366082700",
      "modVersion": "4.3",
      "virusScanUrl": "https://www.virustotal.com/file/4750abc962445305f394063d7a961f7f6fea96775be0879966bf57627b55f442/analysis/1407524767/",
      "changelogHtml": " 16th April. New version uploaded to correct some nifs. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CandlePondRanchDefaultMannequin-23987-4-3.rar?fid=1000024727&ttl=1535794573&ri=8192&rs=8192&setec=0f1be90a49bc192cc0e19233a4da2764"
    },
    {
      "fileId": "1000026077",
      "name": "Candle Pond Ranch",
      "version": "3.3a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "498",
      "fileName": "Candle Pond Ranch-23987-3-3a.rar",
      "uploadedUnix": "1366743698",
      "modVersion": "3.3a",
      "virusScanUrl": "https://www.virustotal.com/file/3a53f2c2315ab554eb84673587910e7d1f3e0583b99696d140296c3012e4fe72/analysis/1407536618/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Candle%20Pond%20Ranch-23987-3-3a.rar?fid=1000026077&ttl=1535794574&ri=8192&rs=8192&setec=4226ca635ef1c1a8585f423a91522120"
    },
    {
      "fileId": "1000026078",
      "name": "Candle Pond Ranch Default mannequin",
      "version": "4.3a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "387",
      "fileName": "Candle Pond Ranch Default mannequin-23987-4-3a.rar",
      "uploadedUnix": "1366743757",
      "modVersion": "4.3a",
      "virusScanUrl": "https://www.virustotal.com/file/2728c83f473300385c105afc13f50b9a47147828aa13ceb5c2cb04e4173c0b45/analysis/1407536644/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Candle%20Pond%20Ranch%20Default%20mannequin-23987-4-3a.rar?fid=1000026078&ttl=1535794574&ri=8192&rs=8192&setec=bc3a1ea33def7036e191190089d06efd"
    },
    {
      "fileId": "1000044724",
      "name": "Candle Pond Ranch",
      "version": "3.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24681",
      "fileName": "Candle Pond Ranch-23987-3-4.rar",
      "uploadedUnix": "1375811925",
      "modVersion": "3.4",
      "virusScanUrl": "https://www.virustotal.com/file/744d2f5ffad02956c4f671efc0cb45f8c3f157bec4d607e8bdf6b01dbe5a090c/analysis/1407671531/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Candle%20Pond%20Ranch-23987-3-4.rar?fid=1000044724&ttl=1535794575&ri=8192&rs=8192&setec=da4ae285345afb66b7b43f512cffdae7"
    },
    {
      "fileId": "1000044726",
      "name": "CandlePondRanchDefaultMannequin",
      "version": "4.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24575",
      "fileName": "CandlePondRanchDefaultMannequin-23987-4-4.rar",
      "uploadedUnix": "1375812389",
      "modVersion": "4.4",
      "virusScanUrl": "https://www.virustotal.com/file/03c22ff6c07654b8985197e8436b44d68aecc94386bc70aab1cfe97e6e9fdd8a/analysis/1407671603/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CandlePondRanchDefaultMannequin-23987-4-4.rar?fid=1000044726&ttl=1535794575&ri=8192&rs=8192&setec=b7bf39851dba0c88982abc7e095653f9"
    }
  ]
}