{
  "modId": 23980.0,
  "modName": "Mage and Priest Semi Battle Attire",
  "summary": "Semi armoured Mage and Priest attire",
  "descriptionHtml": "I originally create the retex and mashup of the Nocturnal dress a long time ago when I was RP\\'ing a Vigilant (as much as Skyrim allows you to RP a vigilant at least) And it annoyed me that a Battle Mage/Priest bent on ridding Skyrim of Daedra and \\\"fighting\\\" evil, wore nothing more than bits of cloth.\r\n\r\nSo I decided to create a slightly armoured outfit for her and swapped out the Apprentice Mage Robes (what Skyrim uses for the Vigilant Outfits) with this one, so that I and my fellow Fighters of Injustice would look more the part.\r\n\r\nI was amused when the \\\"Cleric Armor\\\" was released because they did basically what I had done and \\\"mashed\\\" together several meshes and used the \\\"alpha channel method\\\" to remove excess bits.\r\nThe problem with that is that it requires Skyrim to load 2 or 3 complete meshes (making for huge vertex counts) and also load 2 or 3 separate texture files, both of these are very inefficient and it\\'s the reason I didn\\'t release my own version.\r\n\r\nA massive THANKYOU/KUDOS and huge amount of admiration MUST go to MAK07 who\\'s work, found here:\r\nhttp://skyrim.nexusmods.com/mods/13004\r\n\r\nAllowed me to revisit this idea and because of the work MAK07 did in \\\"cutting up\\\" the various armors, I could vastly optimize the meshes and use only the bits I needed.\r\n\r\nThere are now 2 versions of the attire, the original \\\"skimpy\\\" chainmail concept, plus a less skimpy \\\"linen dress\\\" variant.\r\n\r\nYou\\'ll note that I don\\'t call it armour (even though I gave them armor stats just a little below \\\"Glass\\\") with the \\'cloth\\' version a little less than the \\\"chainmail\\\" version, I don\\'t want to stir up the \\\"Realism Police\\\" But that\\'s probably inevitable.\r\n\r\nIt consists of:\r\n\r\nGage (gloves)\r\nHessian (boots)\r\nHabiliment / Cassock (chainmail / cloth dress)\r\n\r\nThe boot mesh is also from MAK07\r\nBut the rest of the meshes/textures are all my own work.\r\n\r\nI\\'ve tested them in game, the weight sliders work, with some minor clipping here and there, unfortunately because of the half a**d, hodge podge way that Bugthesda did their meshes, this is inevitable.\r\nThe Chainmail is transparent/translucent, however again due the the way Bugthesda implemented transparencies, it can sometimes cause weird effects.\r\n\r\n***NOTE TO ENB USERS ***\r\nIf you are using one of the custom ENB configs that has Dynamic or \\\"Intelligent\\\" Depth Of Field, you MAY notice strange behavior. Because of the transparent links in the mesh, it sometimes can\\'t decided what to focus on, the links or what\\'s visible behind them.\r\n\r\nAs always (and with most modders I\\'d guess) I appreciate INTELLIGENT, POLITE feedback on anything to do with this mod, I welcome ALL constructive comments and anything you think may improve this mod.\r\n\r\nAlways (and with most modders I\\'d guess) If you just want to whine and complain <the Realism and Lore Police> then PLEASE feel free to go somewhere else.\r\n\r\nI make these mods for my own enjoyment and because I enjoy creating things and overcoming obstacles to my visions, and I share them because there is a great deal of joy in sharing your own creations with others, so please if you like what I\\'ve done or even just appreciate the work I\\'ve done ... PLEASE ENDORSE\r\n\r\nI apologize in advance that some of the SS are a little different to others, I was experimenting with ENB configs whilst testing this mod. As with ANY screenshots, they are indicative only, as no two systems will have exactly the same GF settings. Try it first in YOUR game before saying it looks bad/good/weird/ugly ... etc.\r\n\r\nCredit/Thanks/Kudos to:\r\nMAK07 http://skyrim.nexusmods.com/mods/13004\r\nBugthesda\r\nThe Niftools Team\r\nPaint.net\r\nThe Nexus for letting us run free with our imaginations",
  "categoryId": "54",
  "version": "1.0",
  "author": "Perraine",
  "createdUnix": "1347339544",
  "updatedUnix": "1347339654",
  "containsAdultContent": false,
  "uploadedBy": "Perraine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87770",
      "name": "Mage and Priest Semi Battle Attire",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5691",
      "fileName": "Mage and Priest Semi Battle Attire-23980-1-0.rar",
      "uploadedUnix": "1347339654",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/272163a521a2ab84d6ab7c9cf222c2a49226ac440c10d42fc5dce28e366baa97/analysis/1407159012/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mage%20and%20Priest%20Semi%20Battle%20Attire-23980-1-0.rar?fid=87770&ttl=1535794561&ri=8192&rs=8192&setec=372bbea82f5ef4374fe03378e2f80a4d"
    }
  ]
}