{
  "modId": 23996.0,
  "modName": "Skyrim Vanilla Variant",
  "summary": "Overhaul of basic game play. Including Armor Variations and Basic Scripting fixes.",
  "descriptionHtml": "Overhaul of basic game play. Including Armor Variations and Basic Scripting fixes.\r\n\r\n* Version 2.0 will be released soon containing more detailed overhaul. Please comment on download with ideas and suggestions problems or complaints. Please be constructive so I can learn.*\r\n\r\nThis Mod adds several additions to vanilla Skyrim. \r\n\r\nCompanions:\r\n\r\n* Add Light version of the Companions Wolf Armor set at AR of Elven and upgraded Heavy to equal Dwarven.\r\n* Farkas now wears and properly returns to the Companions Wolf Armor \r\n* Corrected other companions to wear their proper armor. (Aela is now wearing the Light Version of the Companion\\'s Armor)\r\n* Kodlak is no longer a shut in and walks around Jorvaskr.\r\n*Look in Ysgramor\\'s Tomb for the Harbinger\\'s set. (Specialized set of the Companions Armor and Draugr helm with Ebony AR and unique enchants)\r\n\r\nThieves: Further Plans are in the works to expand the TG end Game but mostly adds Un Enchanted cloth version of the Nightingale Armor. Currently only available with console commands (Listed ad Cloth Nightingale) \r\n\r\n(2.0 will feature some changes to this Just need to learn a bit more about scripting.)\r\n\r\nMage Guild: Added a leather version of the Archmage armor in game. \r\n\r\nIt always bothered me that Alvor didn\\'t have a Smelter that has been added in game. Changed Lydia\\'s Armor to Steelplate even though she has a two handed weapon her stats for that and sword and bored are the same giving you the options of which way you want her to go.\r\n\r\n**** Shout Outs ****\r\nLook of the Wolf Armor is all thanks to MonsterMonkey and his Wolf Remix Mod.\r\nhttp://skyrim.nexusmods.com/mods/3896 \r\n\r\nAnd Aelrich is Sporting the Rare Wolfskin Black Cloak thank\\'s to Nivea\\'s Winter is Coming\r\nhttp://www.skyrim.nexusmods.com/mods/13486",
  "categoryId": "79",
  "version": "1.0",
  "author": "SNRXX37",
  "createdUnix": "1347379370",
  "updatedUnix": "1348245337",
  "containsAdultContent": false,
  "uploadedBy": "XX37",
  "primaryFile": null,
  "files": [
    {
      "fileId": "89716",
      "name": "XX37 Skyrim Vanilla Variant",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "XX37 Skyrim Vanilla Variant-23996-1-5.7z",
      "uploadedUnix": "1348245337",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/5d9e36f65b16208adac028b4f2b2d529f82a2f63c9da729da3c85577cab41d19/analysis/1407179703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XX37%20Skyrim%20Vanilla%20Variant-23996-1-5.7z?fid=89716&ttl=1535794589&ri=8192&rs=8192&setec=c9fdf1623ca0eadd9908a05b2c44e6d2"
    }
  ]
}