{
  "modId": 24010.0,
  "modName": "Bugs and things that bug me",
  "summary": "A small collection of fixes for bugs and other small annoyances.",
  "descriptionHtml": "This little file is where I keep my assorted bug and annoyance fixes.\r\n\r\nBugs Fixed:\r\n\r\nBrelyna\\'s Practice - The two spells Brelyna casts on the player can no longer be absorbed if the player has the atronach stone effect on them, potentially breaking the quest.\r\n\r\nBreezehome - The common double bed, on the second floor, is replaced with a noble double bed when the player purchases the bedroom package.\r\n\r\nSoulstealer Perk - The soul trap effect will display when an NPC/monster is killed with a conjured weapon. (This is just my Stolen Souls mod rolled into this.)\r\n\r\nThings that bugged me:\r\n\r\nHelgen Keep - The Spell Tome: Sparks, in the torture chamber, is removed and replaced with Spell Tome: Oakflesh. Just because Sparks is a starting spell for Dunmer.\r\n\r\nBreezehome - The raw rabbit legs, raw beef and venison have been removed from the house. Aside that the rabbit legs keep falling onto the floor, the meat has been sitting on the shelves far too long and were rancid and drawing flies.\r\n\r\nBreezehome - The sweetroll on the table, in the master bedroom, is now sitting on a proper plate! Do Nords always throw their food on the ground before they eat it? Sigh.\r\n\r\nKRB",
  "categoryId": "95",
  "version": "1.0",
  "author": "Kae Arby",
  "createdUnix": "1347402592",
  "updatedUnix": "1347402650",
  "containsAdultContent": false,
  "uploadedBy": "Kae Arby",
  "primaryFile": null,
  "files": [
    {
      "fileId": "87919",
      "name": "BugsThatBugMe",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "BugsThatBugMe-24010-1-0.7z",
      "uploadedUnix": "1347402650",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c9022a37d8c6752085beabeb040553a1a32f1a2a698bd502bee0222249ae74e0/analysis/1407160561/",
      "changelogHtml": " We\\'re number 1.0! <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BugsThatBugMe-24010-1-0.7z?fid=87919&ttl=1535794616&ri=8192&rs=8192&setec=619bd4a3a51a6989abed8ad42684bcb8"
    }
  ]
}