{
  "modId": 2403.0,
  "modName": "No Crafting Level-ups",
  "summary": "Prevents crafting skills from leveling the character, allowing you to effectively \\'grind\\' your craft skills without powerleveling yourself. Temporary fix until CK release.",
  "descriptionHtml": "-----------------------\r\n\r\nMod Name: No Crafting Level-ups\r\nVersion: v1.0\r\nAuthor: The Anarchist\r\nInitial Release: 12/2/2011\r\n\r\n-----------------------\r\nDescription\r\n-----------------------\r\n\r\nNo Crafting Level-ups is a series of text files designed to prevent huge level gains purely from grinding crafting skills, such as Smithing and Alchemy. My characters in particular are almost always smiths, and as such I level them straight to 100 Smithing as soon as my game starts. This inevitably ends up boosting my character to the 20s, which I don\\'t want - I want to preserve the work of getting from 1-30 the hard way.\r\n\r\nA way around this is by using the console to 1) boost these skills to 100, and 2) add any perks you would have chosen had you leveled that skills to 100 normally. The only downside to this is that you have to use the console, and as such there is no real way of \\'moderating\\' your usage of it. You could very easily boost all of these skills to the maximum and give yourself all of the perks. This really depends on yourself though - those that are more judicious will refrain from doing so. It\\'s all up to you, at this point.\r\n\r\nWhen the Construction Set is released in January I plan to revise this mod, getting rid of the text files entirely and instead making it an ESP that just prevents these skills from contributing to levels gained, or at least make the gain so small that grinding all of the skills to the maximum would only result in a level or two. As of this moment, though, text files are the only thing I can think to use until the kit is released.\r\n\r\n-----------------------\r\nHow It Works\r\n-----------------------\r\n\r\nContained in each text file is a command or a list of commands that are automatically entered into the console. Typing \\\"bat\\\" and then the name of the text file will automatically enter all of the commands, saving you a large amount of time and keeping you from having to dig up all of the perk codes yourself. You can choose to...\r\n\r\nA) Increase all skills to 100 and add all perks.\r\n     - I don\\'t recommend this, as normally leveling all the included skills to 100 would NOT give you enough perks to pick all of them. Use this is you don\\'t mind a bit of imbalance to your game.\r\n\r\nB) Increase all skills to 100 and pick and choose specific perks.\r\n     - Firstly, all skills are boosted to 100 which means you don\\'t have to worry about inadvertently gaining level progress from these skills down the road, even if you don\\'t plan on using them. For example, my character never uses Lockpicking (I use the Lockpick Pro mod) but picking locks still grants skill levels and will eventually boost my level. This way, you prevent yourself from leveling the skill any further, and can choose only the perks you want to take.\r\n\r\nC) Increase all skills to 100 only.\r\n     - This is my recommended method. This takes care of the leveling issue and lets you earn perks as normal. This would be my second method to pick, since you don\\'t have to worry about picking perks at all - just use the SkillsFull text file.\r\n\r\nD) Increase specific skills to 100 and add all perks for those skills.\r\n     - Pretty self explanatory, for example if you feel Lockpicking is one of those skills you want to level normally you can exclude it and add the rest. Each skill has a file that boosts the skill to 100 and adds all that skill\\'s perks if you so choose.\r\n\r\nE) Increase specific skills to 100 and choose specific perks.\r\n     - Same as above really except that instead of boosting everything to 100 and picking your skills, you can choose only the skills you like and the perks you like. Again, as above, I would personally limit yourself to 4 perks per skill - naturally if you want to choose additional perks by spending perk points earned through normal leveling, you can.\r\n\r\nThe file names are fairly self explanatory but I\\'ll go through a few just for clarification.\r\n\r\n\\\"SkillsAll.txt\\\" - This file will boost all skills to 100 but add NO perks.\r\n\\\"SkillsAndPerksAll.txt\\\" - This file will boost all skills to 100 and add all perks.\r\n\\\"Skill[Skill Name].txt\\\" - A file in this format will boost the skill in the name to 100 and add NO perks.\r\n\\\"Skill[Skill Name]All.txt\\\" - A file in this format will boost the skill in the name to 100 and add all perks for that skill only.\r\n\\\"Perk[Skill Name][Perk Name].txt\\\" - A file in this format will add the associated perk to your character. Keep in mind this is to be used only after the associated skill has been boosted to 100 to prevent complications. Also, a file in this format with a number after the perk name has multiple levels, such as the Alchemist perk or the Haggling perk. When using this type of file, ONLY use the one ending in the highest level you want to go to. If you want 5 in Haggling, pick only PerkSpeechcraftHaggling5.txt, not all five files.\r\n\r\n-----------------------\r\nRequirements:\r\n-----------------------\r\n\r\nNone.\r\n\r\n-----------------------\r\nInstall:\r\n-----------------------\r\n\r\nCopy the desired files into Skyrim\\'s base folder; default is C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim. If you decide to modify only Lockpicking for example, copy the contents of the Lockpicking folder in the \\\"BAT Files\\\" base folder to the Skyrim directory.\r\n\r\n-----------------------\r\nUninstall:\r\n-----------------------\r\n\r\nRemove the copied files from the Skyrim data folder.\r\n\r\nNOTE: Removing the files will NOT revert your skills and perks within the game. I HIGHLY recommend making a savegame prior to using these files in the event things don\\'t work out for you.\r\n\r\n-----------------------\r\nUsage\r\n-----------------------\r\n\r\nWhen you have a character loaded, open up the console. Once the console is opened, type \\\"bat [File Name]\\\", without brackets or the .txt extension of the file. If input properly, the game will run all commands contained in the file. Depending on the method you choose to use, this might take multiple \\'runs\\'. Once you have ran the files once, you can remove them from your Skyrim directory if you want to keep the folder clean.\r\n\r\n-----------------------\r\nNotes\r\n-----------------------\r\n\r\nI realize some may say this will result in an imbalance, and this is somewhat true, but if you are like me and wish to preserve the lower level experience, this is overlookable. Smithing will not become too imbalanced as the necessary materials for higher level armor and weapons will not start to spawn into shopkeepers\\' inventories until you reach a higher level. At most you will be able to upgrade the lower level armor to a higher level than normal.\r\n\r\nSo again, if the potential imbalances are something you don\\'t want to have in your game, do NOT use this mod in its current state, OR boost the skills to 100 only and don\\'t pick perks. By not picking perks you will negate the majority of the imbalances that might occur.\r\n\r\n-----------------------\r\nChangelog\r\n-----------------------\r\n\r\nv1.0\r\n- Initial release.\r\n\r\n-----------------------",
  "categoryId": "24",
  "version": "1.0",
  "author": "The Anarchist",
  "createdUnix": "1322865978",
  "updatedUnix": "1322866057",
  "containsAdultContent": false,
  "uploadedBy": "The Anarchist",
  "primaryFile": null,
  "files": [
    {
      "fileId": "6334",
      "name": "No Crafting Level-ups",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28",
      "fileName": "No Crafting Level-ups-2403-1-0.zip",
      "uploadedUnix": "1322866057",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1185257cee91aa7fa39b0515f90b47ef9bdd27d32d2ac7a0b46951d9bd7d8363/analysis/1406470805/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Crafting%20Level-ups-2403-1-0.zip?fid=6334&ttl=1535756635&ri=8192&rs=8192&setec=cb89cd96e3186081352b9064c49ee46d"
    }
  ]
}