{
  "modId": 24055.0,
  "modName": "Bow Equals Warhammer",
  "summary": "Bows now have the damage of warhammers, instead of half of it or less.",
  "descriptionHtml": "In the E3 videos leading up to the release of Skyrim, we were told that bows were now \\\"seriously powerful\\\". But they aren\\'t. In fact, they have just about the lowest DPS in the game.\r\nNow, some will say that this is to make up for the fact that you can shoot at a distance. But frankly, I see the need for ammo as well as precision as being enough of a nerf to cancel out that effect for balanced gameplay.\r\nNow, there are a number of more complex archery overhauls, but all of them left me cold. Either they were intended exclusively for rogue-like characters (sneak damage multipliers and the like) or they are egregiously overpowered, and intended to offer the player one shot kills.\r\nSometimes the simplest solutions are the most elegant, and therefore I give you:\r\nBow==Warhammer\r\n\r\n\r\nSOME NOTES:\r\n(This first note is not true, ignore it! I was wrong about the way the game engine works with enchanted weapons.)\r\nThis mod will not effect enchanted bows found throughout the game. You will have to find your own bow that is not enchanted, and enchant it yourself if you want an enchanted bow with the bonus. I\\'m working on that, but it may never get done, as I would have to edit about 200 different enchanted bows, which sounds really really boring. So, you can enchant your own darn bow.\r\n\r\nThere is no exact formula for the damage, but on average I would say it is 1 damage less than double what it was for lower level bows, and about 1.5 the damage on high level bows. So, bows are almost twice as good as they were.\r\n\r\nI made the nightingale bow better as well, despite the lack of a comparable warhammer. Now you can do the same damage as Karliah with it if you should get the best version of the weapon. (She used to do about 30% more than the player ever could).\r\n\r\nPlease leave ideas for bettering archery here in the comments, and if I like them and think they are reasonable balanced I will update the mod to include them.\r\n\r\nAlso, take a looks at Portal - Dynamically Placed Teleportation, my favorite mod I\\'ve made. It\\'s a barrel of laughs.",
  "categoryId": "77",
  "version": "v0.1",
  "author": "Alex Ducey",
  "createdUnix": "1347502113",
  "updatedUnix": "1347502764",
  "containsAdultContent": false,
  "uploadedBy": "atducey",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88132",
      "name": "The File",
      "version": "v0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "The File-24055-v0-1.rar",
      "uploadedUnix": "1347502153",
      "modVersion": "v0.1",
      "virusScanUrl": "https://www.virustotal.com/file/be5d209103932ad73ae2ea5f17d40996e308eb0ef92de9683d65db4ef71739af/analysis/1407162488/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20File-24055-v0-1.rar?fid=88132&ttl=1535794682&ri=8192&rs=8192&setec=bbadc6500bd38a99cbd0e12d98c7b2d9"
    },
    {
      "fileId": "88134",
      "name": "Forgot the Longbow and Hunting bow - fixed",
      "version": "v0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Forgot the Longbow and Hunting bow - fixed-24055-v0-2.rar",
      "uploadedUnix": "1347502764",
      "modVersion": "v0.2",
      "virusScanUrl": "https://www.virustotal.com/file/8f0282403cf6d88695ace26aa784e2fea65dfe693d9ebf7f588315b2f9a16234/analysis/1407162489/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forgot%20the%20Longbow%20and%20Hunting%20bow%20-%20fixed-24055-v0-2.rar?fid=88134&ttl=1535794683&ri=8192&rs=8192&setec=020a50806ba5172797af32611fe971dc"
    }
  ]
}