{
  "modId": 24066.0,
  "modName": "hyper follower pack",
  "summary": "three simple follower mods",
  "descriptionHtml": "**UPDATE**\r\nv1.1\r\n- finally gave Tolmse some starting spells (praise the sun! creationkit didn\\'t crash on me this time!)\r\n- demoted the npcs from \\\"Ally\\\" to \\\"Friend\\\"\r\n- made Pelena marriageable\r\n\r\nIncluded in this package are three basic follower mods which I use for my game. Figured I might as well share them and see if anyone likes them.\r\n\r\n1) TOLMSE MERAND\r\n- dunmer witchblade\r\n- fights primarily with destruction magic, and carries a katana for close quarters\r\n- she can be found in the New Gnisis Cornerclub\r\n- Background: \r\n\r\nTolmse is the sister of Solms, a high-ranking warrior in House Redoran. One night, Solms began reading a book entitled \\\"The Immortal Blood\\\". The days that followed consisted of Solms pacing back and forth in his room, mumbling incomprehensibly about blood and Skyrim. In weeks, Solms had stopped eating supper; in months, Solms had isolated himself in his room. Tolmse begged her brother to eat, but he paid her no heed. Eventually, Solms left their home and was never heard from since. \r\n\r\nYears after Solms\\' departure, Tolmse left Morrowind to seek him out. She headed west to Windhelm, hoping to find him in Skyrim.\r\n\r\n2) BROKE-A-TOOTH\r\n- argonian warrior\r\n- proficient in two-handed weapons and heavy armor\r\n- located in the Winking Skeever, in Solitude\r\n- Background: \r\n\r\nTooth earned his name from his propensity for physical violence. No day passed by without him beating down some random stranger who had the misfortune of pissing him off. He carried this trait even during his time as an Imperial Legionnaire. However, it was here that his short temper finally took its toll; in a fit of rage, he assaulted a senior officer after having been reprimanded for breaking a fellow soldier\\'s neck. After being formally discharged, Tooth stayed at the Winking Skeever and has since been drowning himself in mead, hoping that the inebriation would help him change his ways.\r\n\r\n3) PELENA CATIUS\r\n- imperial scout\r\n- light armor, archery\r\n- found in the Falkreath Barracks\r\n- Background:\r\n\r\nPelena never was very bright. Since her days as a youth, her mother would always scold her about her gross inattention towards her studies. She much preferred the outdoors, thrilled by the sense of adventure even from a place as simple as the plains around her home. She would always sneak out of class and out of the Imperial City, running off to her not-so-secret place atop a hill. She would pretend it was a mountain, and peer over Cyrodill and its denizens as if she had made a dangerous climb.\r\n\r\nPelena eventually joined the Imperial Legion, in Solitude. Her fellow Legionnaires never liked her very much; they were not appreciative of her often aloof and inattentive demeanor. One day, some of her fellow Legionnaires confided to her that she had been given an order to investigate reports on werewolf activity in Falkreath. She was told that, should she return with the body of a single werewolf, she would be granted a promotion... and a lifetime supply of sweetrolls. \r\n\r\nDelighted, Pelena immediately gathered her belongings and quickly made off to Falkreath. After settling there, she began making daily rounds in the surrounding forest. Disappointingly, however, she found no trace of any werewolves in the area. After a year had lapsed, she grew weary and began to wonder whether there was any truth to the Legionnaires\\' claim of a sweetroll reward: \\\"The Legion can\\'t afford that many sweetrolls!\\\", she thought.\r\n\r\nREQUIRED MOD: ApachiiSkyHair.\r\n\r\nThe ff. are not required, but are necessary to give them appearances similar to their depiction in the screenshots (must be installed in the following order):\r\n1) XCE*\r\n2) DIMONIZED UNP BASE Main Body\r\n3) UNP Blessed Body\r\n4) All in One Face Pack for UNP**\r\n5) UNP Delicate\r\n6) Fair Skin for UNP***\r\n\r\n*this is mostly just for the males\r\n**use Envision Face and Rans Headmesh Variants instead for the ENVISION version of HFP\r\n***This was used in one of the screenshots, but I currently don\\'t recommend this anymore; just realized that this was the mod that kept Tolmse from having her natural dunmer skin color\r\n\r\nOverwrite when prompted.\r\n\r\nCREDITS:\r\nApachii (for ApachiiSkyHair)\r\nXenius (for XCE)\r\ndd2501 (for Envision Face)\r\nRAN46 (for Rans Headmesh Variants)\r\ndimon99 (for DIMONIZED UNP female body)\r\ncalyps (for UNP Blessed Body)\r\nHHaleyy (for UNP Delicate and Fair Skin)\r\njmenaru (for Alyn Shir Armor)\r\ndualsun (for Pretty Female Idles)\r\nIndigoNeko (for SkyRealism - ENB Evolved)\r\nBethesda (for Skyrim!)",
  "categoryId": "33",
  "version": "v1.1",
  "author": "hyperbomb",
  "createdUnix": "1347533349",
  "updatedUnix": "1347713778",
  "containsAdultContent": false,
  "uploadedBy": "hyperbomb",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88178",
      "name": "HFP",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "366",
      "fileName": "HFP-24066-.7z",
      "uploadedUnix": "1347533420",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/97c0f6b70eabbfa2406b6421707c86270ddcf1e8b3c3d9e263f2d0013bbecef9/analysis/1407162737/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HFP-24066-.7z?fid=88178&ttl=1535794705&ri=8192&rs=8192&setec=34051f4fa226f29b66b6a6cf57c649e8"
    },
    {
      "fileId": "88494",
      "name": "HFP v1_1 envision",
      "version": "v1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "720",
      "fileName": "HFP v1_1 envision-24066-v1-1.zip",
      "uploadedUnix": "1347668778",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c35805da47e142c3445ec963d98fa338f75ed6a9c59c1ccb460bec358008c9bb/analysis/1407165907/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HFP%20v1_1%20envision-24066-v1-1.zip?fid=88494&ttl=1535794705&ri=8192&rs=8192&setec=f34187ca73e4ddded0927468479f8437"
    },
    {
      "fileId": "88591",
      "name": "HFP v1_1",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "727",
      "fileName": "HFP v1_1-24066-v1-1.zip",
      "uploadedUnix": "1347713778",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7e16b8aae00ef062364e2dcea69401b02f8881e477e8c43963b65f75d356b353/analysis/1407166865/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HFP%20v1_1-24066-v1-1.zip?fid=88591&ttl=1535794706&ri=8192&rs=8192&setec=6e0263c38ea5385c3e0ea406a9a03d33"
    }
  ]
}