{
  "modId": 24073.0,
  "modName": "LEGEND OF CAIN - The Machinima Werewolf Series",
  "summary": "Since I am more oriented to making videos and drawing pictures then making mods and have one hell of a wild imagination, I decided to create a series of short cinematic videos about my Skyrim character - Cain the werewolf, and show his losing battle against the beast within.",
  "descriptionHtml": "[img]http://oi59.tinypic.com/jujypv.jpg[/img]\r<br />[img]http://oi58.tinypic.com/5p22jl.jpg[/img]\r<br />\r<br />[color=#ffff00][b][i][size=5]Gopher took a bit of his time to showcase the series in one of his videos, \r<br />A HUGE THANKS FOR THAT GOPHER&#33;&#33;&#33;[/size][/i][/b][/color]\r<br />\r<br />[youtube]GY9TW8Hdpo0[/youtube]\r<br />\r<br />[color=#ffe599][i][u][size=4]Take note that I created my own story here that may conflict with the lore in the games&#33;\r<br />\r<br />Also, the video annotations from youtube may not display properly on these small screens, so it is RECOMMENDED to watch directly on youtube by following the links&#33;[/size][/u][/i][/color]\r<br />\r<br />[u][size=7]PILOT EPISODE - THE LEGEND IS BORN[/size][/u]\r<br />\r<br /> [i][b][size=3]&#39;&#39; Even a man who is pure of heart\r<br />    And says his prayers by night\r<br />         May become a wolf\r<br />     When the wolfsbane blooms\r<br />   And the Autumn moon is bright &#39;&#39;[/size][/b][/i]\r<br />\r<br />[size=3][url=http://www.youtube.com/watch?v=YqjiH5N3jUA]Watch the episode in HD 1080p quality on youtube&#33;[/url][/size]\r<br />\r<br />[size=2][youtube]YqjiH5N3jUA[/youtube][/size]\r<br />\r<br />[u][i][b][size=4]PLOT SUMMARY:[/size][/b][/i][/u]\r<br />\r<br />[i][b][size=2]This is the pilot episode of the upcoming Legend of Cain series octalogy, the series will use a cinematic ENB to provide realism and a cinematic feel, and I will make sure no &#39;&#39;gameplay&#39;&#39; is visible, to keep it as real as posible&#33;\r<br />\r<br />The 5 minute pilot shows in detail the horrible night that will change Cain&#39;s life forever and how the legend itself began - the night his closest friends and comrades all got slaughtered in front of his very eyes, and as the only survivor he was forced to live the rest of his life - as a werewolf... ( More info located in CAIN&#39;S STORY)[/size][/b][/i]\r<br />\r<br />\r<br />[u][size=7]EPISODE 2 - THE BEAST WITHIN[/size][/u]\r<br />\r<br /> [i][b][size=3]&#39;&#39; It is said there is no sin in killing a beast, \r<br />only in killing a man...\r<br />But where does one begin and the other end? &#39;&#39;[/size][/b][/i]\r<br />\r<br />[size=3][url=http://www.youtube.com/watch?v=D17874c2Ykc]Watch the episode in HD 1080p quality on youtube&#33;[/url][/size]\r<br />\r<br />[youtube]D17874c2Ykc[/youtube]\r<br />\r<br />[u][i][b][size=4]PLOT SUMMARY:[/size][/b][/i][/u]\r<br />\r<br />[i][b][size=2]The episode takes place 29 days after the pilot, on the day before the night of the full moon, and shows how lycanthropy is equal parts gift and a curse.\r<br />Cain discovers he can use his inner wolf powers in human form to accomplish extraordinary feats of speed and agility, but soon also realises he will be a prime target of the Silver Hand werewolf hunters.\r<br />Being a new breed of werewolf ( unlike the Companions), Cain discovers the inner beast can take control of his body if he is injured or agitated, but when it does it will eliminate any threat before fading away, and he can do nothing to stop it - he is not even conscious.\r<br />Since this episode takes place a month after the bite, Cain also experiences his Blood Moon ( his first full moon), which marks his first and most painful transformation into a wolf.[/size][/b][/i]\r<br />\r<br />[u][size=7]EPISODE 3 - A DOUBLE-EDGED SWORD[/size][/u]\r<br />\r<br /> [i][b][size=3]&#39;&#39; He who helps the wolf kill, \r<br />will be killed by the wolf later. &#39;&#39;[/size][/b][/i]\r<br />\r<br />[size=3][url=https://www.youtube.com/watch?v=rcUoHr6p9Yg]Watch the episode in HD 1080p quality on youtube&#33;[/url][/size]\r<br />\r<br />[youtube]rcUoHr6p9Yg[/youtube]\r<br />\r<br />[u][i][b][size=4]PLOT SUMMARY:[/size][/b][/i][/u]\r<br />\r<br />[i][b][size=2]A month has passed since Cain has had his blood moon ( his first full moon), and ever since, he has been haunted by monstrous visions of his time in wolf form, preventing him from restful sleep.\r<br />Taking up to drinking to relieve some of the mental stress, he has wandered into an old tavern - completely unaware it&#39;s the night of the full moon.\r<br />With an impending transformation, and with werewolf hunters in his footsteps, Cain will soon learn that being a werewolf is a heavier burden then he ever expected...[/size][/b][/i]\r<br />\r<br />[u][size=7]EPISODE 4 - PACK MENTALITY[/size][/u]\r<br />\r<br /> [i][b][size=3]&#39;&#39; For the strength of the Pack is the Wolf, \r<br />and the strength of the Wolf is the Pack. &#39;&#39;[/size][/b][/i]\r<br />\r<br />[url=https://www.youtube.com/watch?v=xV1V72-LMKU][size=3]Watch the episode in HD 1080p quality on youtube&#33;[/size][/url]\r<br />\r<br />[youtube]xV1V72-LMKU[/youtube]\r<br />\r<br />[u][i][b][size=4]PLOT SUMMARY:[/size][/b][/i][/u]\r<br />\r<br />[size=2][i][b]Nearly three months have passed since Cain&#39;s first full moon, and Cain has been struggling ever since to keep the beast under control, using all his might. In order to avoid harming anyone, Cain has distanced himself from other people, and lives in the woods as a hunter - traveling to villages rarely and only briefly to buy necessary supplies.\r<br />Spending most of his time keeping the beast within under control, Cain has discovered a way to use his curse as a tool - using his enhanced speed, senses and reflexes to aid him in hunting, he has also discovered that wolves treat him with respect. \r<br />With the full moon just a week away, Cain is preparing for his next transformation - even though there is no danger yet however, he is about to find out that his wolf may not be as easy to controlas he thought, \r<br />once the beast within him hears the call of it&#39;s Alpha....[/b][/i][/size]\r<br />\r<br />[img]http://oi57.tinypic.com/sq5f9j.jpg[/img]\r<br />[img]http://oi61.tinypic.com/2qiuyvc.jpg[/img]\r<br />\r<br />[u][size=7]THE EVENT TRILOGY[/size][/u]\r<br />\r<br />[i][b][size=2] Before the series itself began I have created a sort of &#39;&#39;sneak-peek&#39;&#39; trilogy of short videos that shows parts of Cain&#39;s life.\r<br />However NOTE that the story did not exist at the time, the ENB enhancements were not made yet, the custom werewolf textures were not used, and my skills in sony vegas and the in-game console were very poor&#33;[/size][/b][/i]\r<br />\r<br />[i][b][size=4]Considering all the flaws, \r<br />[color=#ff0000][u]THE EVENT TRILOGY IS THEREFORE CONSIDERED TO BE NON-CANON TO THE SERIES&#33;[/u][/color][/size][/b][/i]\r<br />\r<br />[u][size=6]THE BLOOD MOON[/size][/u]\r<br />\r<br />[youtube]DBuHkTQJvTo[/youtube]\r<br />\r<br />[size=3][url=http://www.youtube.com/watch?v=DBuHkTQJvTo]Watch the episode in better quality on youtube&#33;[/url][/size]\r<br /> \r<br />[u][size=4]THE EVENT[/size][/u]                    \r<br />\r<br />[i][b][size=2]When the full moon shines on the night sky for the first time since a person was &#39;&#39;infected&#39;&#39;, the human will undergo his first, most agonizing and most painful transformation...[/size][/b][/i]\r<br />\r<br />\r<br />[u][size=6]HUNTER&#39;S MOON[/size][/u]\r<br />\r<br />[youtube]MFGP6FjcNFY[/youtube]\r<br />\r<br />[size=3][url=http://www.youtube.com/watch?v=MFGP6FjcNFY]Watch the episode in HD 1080p resolution on youtube&#33;[/url][/size]\r<br />\r<br />[u][size=4]THE EVENT[/size][/u]\r<br />\r<br />[i][b][size=2]Werewolves are the greatest hunters of the land, and when they give in to their animal instincts and form a pack - the resulting chaos and bloodshed could be unimaginable...[/size][/b][/i]\r<br />\r<br />\r<br />[u][size=6]THE BEAST RISING[/size][/u]\r<br />\r<br />[youtube]tW1ltN_rAP8[/youtube]\r<br />\r<br />[size=3][url=http://www.youtube.com/watch?v=tW1ltN_rAP8]Watch the episode in HD 1080p resolution on youtube&#33;[/url][/size]\r<br />\r<br />[u][size=4]THE EVENT[/size][/u]\r<br />\r<br />[i][b][size=2]Ten long winters have passed since his first full moon, and even though he tried to control the beast within, the call of the hunt was too tempting to pass, the smell of fresh blood was just too strong to resist...\r<br />Cain has slowly become intoxicated by the werewolf&#39;s power, and still unable to control his &#39;&#39;urges&#39;&#39; even in human form, he has become a wanted man in most of Skyrim&#39;s holds - a thousand septims were offered for his capture...[/size][/b][/i]\r<br />\r<br />\r<br />[u][b][size=6]POSSIBLE PLANS FOR THE FUTURE[/size][/b][/u]\r<br />\r<br />[i][b][size=2]- After the eight-part series is finished, there may be a three-part ORIGINS trilogy, each episode explaining in detail the backstory of three major characters - Cain, Varek Lowell and the Alpha.[/size][/b][/i]\r<br />\r<br />[i][size=5]- Feel free to leave comments if you like the series and if you have questions, and of course if you have any good ideas on how the story should continue&#33;[/size][/i]",
  "categoryId": "45",
  "version": "1.6",
  "author": "NsJones",
  "createdUnix": "1347553707",
  "updatedUnix": "1376926135",
  "containsAdultContent": false,
  "uploadedBy": "NsJones",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000048102",
      "name": "Legend of Cain Wallpapers 1680x1050",
      "version": "1.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2225",
      "fileName": "Legend of Cain Wallpapers 1680x1050-24073-1-7.rar",
      "uploadedUnix": "1376926135",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/90168250ac9a6d9f8f725f6a8527afeb6f6374f3d2228a16777e93a2fa1ccb18/analysis/1407688975/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legend%20of%20Cain%20Wallpapers%201680x1050-24073-1-7.rar?fid=1000048102&ttl=1535794718&ri=8192&rs=8192&setec=138eb7930494f0c002c3f5b7434c4dc3"
    }
  ]
}