{
  "modId": 24086.0,
  "modName": "Snippys Unorthodox Spouses - Zhella",
  "summary": "Adds an optional follower/spouse to your Skyrim!",
  "descriptionHtml": "OVERVIEW:\r\nA friend of mine once requested that I turn my personal Skyrim character into an NPC for him to use. I obliged, and here she is. Note that Apachii Sky Hair is used in this mod, so you will need to have it installed if you want her to look right.\r\n(All credit for the hair goes to Apachii, download to the mod follows.)\r\nhttp://skyrim.nexusmods.com/mods/10168\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nTHING TO KNOW:\r\n1) She should be walking around in the sitting room of the Winking Skeever, in Solitude. If she\\'s not there, try waiting for a while. (You\\'ll know her when you see her.) If she doesn\\'t appear at all, please post a comment explaining whatever you think might be contributing to it. Things like whether or not you currently have a spouse/follower MAY or MAY NOT affect it.\r\n2) She doesn\\'t have a base outfit, so when you meet her for the first time she will be naked. (This isn\\'t technically considered adult content, because what you get depends on what mods you have installed already.) To fix this, tell her to follow you and give her any item. She has a set of Glass armor in her inventory, and she should equip whatever she sees as the best thing she has.\r\n3) She is a vampire, just FYI.\r\n4) I don\\'t know what would happen if you DON\\'T have ApachiiSkyHair installed, but if you would like to post a comment saying what happens, go ahead. But I would recommend having it because it\\'s an awesome mod.\r\n5) She is both a follower option AND a spousal option. You can ask her to follow you at any time, but you need to be wearing an Amulet of Mara for the marriage dialogue to appear.\r\n6) She shares her voice with Aela the Huntress, because there are no Khajiit voices that have both follower and spouse dialogues. This shouldn\\'t be a huge problem, but if you have Aela as your spouse already and end up making her your follower (or vice-versa,) it might get confusing.\r\n7) I probably won\\'t be updating this too much, since it\\'s just a small mod I made per request.\r\n8) This is the first thing I\\'ve ever done with the Creation Kit, so don\\'t be too harsh.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nMANUAL INSTALLATION:\r\nPlace the ZhellaAgain.esm into the following directory\r\nSteam>steamapps>common>Skyrim>data\r\nUninstallation should be as simple as removing the .esm from the directory.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\nCREDITS:\r\nThe character is an exact model (Combat, physical appearance, etc.) of my personal Skyrim character. Please do not steal her.\r\nAs stated above, the ApachiiSkyHair mod is used in this mod, and I give a HUGE thanks to the mod maker for creating it. Go to the link in the Overview section to download it, and support the maker.\r\nAll content is the property of its respective owner(s).",
  "categoryId": "33",
  "version": "v.1.00",
  "author": "SnippyTheDeliveryFox",
  "createdUnix": "1347588457",
  "updatedUnix": "1347588900",
  "containsAdultContent": false,
  "uploadedBy": "SnippyTheDeliveryFox",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88295",
      "name": "Zhella Custom NPC",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Zhella Custom NPC-24086-1-00.rar",
      "uploadedUnix": "1347588900",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/eed06a3a199e2fcb84f39a15e965bce67ca2cfbdd434c98d14dbdb79d8d24165/analysis/1407163938/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Zhella%20Custom%20NPC-24086-1-00.rar?fid=88295&ttl=1535794735&ri=8192&rs=8192&setec=90ceee33bbf1046c960e40dd41f10896"
    }
  ]
}