{
  "modId": 24092.0,
  "modName": "Professional Shiv",
  "summary": "The way this shiv achieves a 1 hit kill is by using a script to grant a hidden perk whilst equipped. The moment its uneqquiped, you lose the perk. The perk grants a x1000 times sneak damage multiplier.",
  "descriptionHtml": "Just outside the abandoned south gate of riften, there appears to be a hidden chest with a shiv designed for the expert.\r\n\r\nEssentially this mod is for the professional assassin. This shiv does 1 damage, and so is useless for combat. However when stealthed, the shiv is light and easy to place, causing a guranteed kill. (When in the RIGHT hand, LEFT is untested)\r\n\r\nI personally use this shiv for my assassin\\'s. I use ONLY this shiv, and if my character dies, I stop playing it.\r\nResulting in a very rewarding experience in stealth combat.\r\nIf your stood directly behind any race, you could easily thrust a shiv into any place that would instantly kill them. Thats what this shiv does.\r\n\r\nAnyways I hope you like it! I recommend using it with my \\\"Secret Entrances\\\" addon.\r\n\r\nUPDATE: The way this shiv achieves a 1 hit kill is by using a script to grant a hidden perk whilst equipped. The moment its uneqquiped, you lose the perk. The perk grants a x1000 times sneak damage multiplier.\r\n\r\n== RECOMMENDED == \r\nThe dance of Death; a killmoves mod.\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=20292",
  "categoryId": "55",
  "version": "0.1",
  "author": "Imoja",
  "createdUnix": "1347594649",
  "updatedUnix": "1347594780",
  "containsAdultContent": false,
  "uploadedBy": "Imoja",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88306",
      "name": "Professional Shiv v0r1",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Professional Shiv v0r1-24092-0-1.zip",
      "uploadedUnix": "1347594780",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/c037b3c67f2be0fb06ba57691a85e414a0ed05cdd839249256563faabfb9ddea/analysis/1407164043/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Professional%20Shiv%20v0r1-24092-0-1.zip?fid=88306&ttl=1535794745&ri=8192&rs=8192&setec=3590be9334f664549dd37688fcd93e20"
    }
  ]
}