{
  "modId": 24100.0,
  "modName": "Gravesend",
  "summary": "Warning - Adult content (some nudity, loads of dead) Requires Dawnguard\r\n\r\nAdds 6 followers (3 male & 3 female) in a rather disturbing player home.  The followers use a mix of melee (dual wield, sword and board or 2H), ranged (crossbow), and magic (conjuration or destruction).  All are essential and can be married.  Abode contains all crafting.",
  "descriptionHtml": "\\\"The problem with fighting naked is you never have anywhere to sheath your weapons,\\\" said Ranni as she kicked the dead mage into the water.  \\\"They wanted my soul to power their forge and my flesh to fill their bellies.\\\"\r\n\r\n\\\"Well, everyone needs a hobby,\\\" Helini trying to lighten the mood.  It would take more than that given the surroundings.  Dead lay everywhere.  The walls and floor sprayed with blood, some fresh, much old.  You couldn\\'t take a step without kicking a bone.\r\n\r\n\\\"They took my eye Helini.  My eye,\\\"  She was less than pleased. \\\"You know what they call a warrior with two weapons and one eye?\\\" asked Ranni.  \r\n\r\n\\\"Dead, usually.  But in your case Ran, and considering how you just fought, the smart money\\'s on you.  Just put your hair over one eye.  No-one will notice and it will hide the mark of Boethia.\\\"  Ranni had to admit, her Bosmer friend had a point.\r\n\r\n\\\"I\\'d just like to point out that I\\'ve been blind for some time and me trusty crossbow bolts still find their mark,\\\" Cataract George looked about, or, more accurately, didn\\'t.\r\n\r\n\\\"Shut up Ears.  It isn\\'t always about you.\\\"  While rendered blind from arcane battles and cataracts many years ago his keen sense of hearing allowed him to pin point his enemies.    His milky gaze was more unsettling than intimidating - his look gave you the same sort of feeling as seeing an angry child with a knife.  \r\n\r\n\\\"Old men with skinny arms and pot-bellies will wish they were us when they hear of this day,\\\" Rinen Glade, trying to turn another slaughter into an heroic tale.  The imperial jutted out his chest and raised his great sword.\r\n\r\n\\\"Unless old men want boobs they won\\'t want to be me, Ranni or Dushta,\\\" said Helini.  Rinen lost the edge off his pose.\r\n\r\n\\\"Unless they want to be hated they won\\'t want to be me either,\\\" said Vathis Faeling.  The Dunmer found the Nord\\'s dislike of elves fairly annoying.  Why he chose to sport Thalmor robes is anyone\\'s guess.  \\\"This forge is interesting.  It seems souls powered it allowing the forge to superheat.  I wonder how it is triggered.\\\"  Vathis was in his element.  He had a new project to explore.\r\n\r\n\\\"My blood is cold...\\\" began Dushta-Lukna only to be cut short by Helini.\r\n\r\n\\\"There\\'s a hot tub in the other room. Hop in.\\\"  Amazingly, the orc wandered off to do just that.\r\n\r\n\\\"Vathis is fascinated by the forge, Dush is in the tub, Ears is stuck in a corner and can\\'t find his way out.  We aren\\'t actually thinking of living here are we?\\\" Ranni wanted to know.\r\n\r\n\\\"It is ours by right of battle,\\\" Rinen seemed pleased with this.\r\n\r\n\\\"I don\\'t know what\\'s worse, the noise or the smell,\\\" added Helini.  \\\"if you need to get out of here Ran, I\\'m with you.\\\"\r\n\r\n\\\"We could let the Dovahkiin decide.  Maybe I need to stay to let my wounds heal,\\\" obviously she didn\\'t just mean those covering her face.\r\n\r\n\\\"Settled.  Dovahkiin to decide.  Let\\'s get rid of the mage\\'s bodies.  The others, well, who are they?\\\"\r\n\r\n\r\nJoin your followers in Gravesend, a combination of elegant living and blood soaked torture.  Or lead them to new adventures.  They offer a mix of races and combat styles.  All are essential and level with you.  All can be married if their somewhat world-weary looks appeal.  \r\n\r\nIf you\\'d prefer more attractive followers and an abode that isn\\'t filled with the dead, try my other mod:\r\n\r\nhttp://skyrim.nexusmods.com/mods/22034/?tab=4&navtag=%2Fajax%2Fcomments%2F%3Fthread_id%3D752876%26mod_id%3D22034\r\n\r\nBetter still, try them both.\r\n\r\nComments and screens are most welcome.  Feel free to throw in feedback and suggestions.  I\\'ll be slightly amazed if anyone wants to live in Gravesend.  It\\'s more than a little unpleasant.  Although, when sitting in the tub it\\'s easy to forget what\\'s in the next room.\r\n\r\nRequired (3):\r\n\r\nDawnguard - there aren\\'t any vampires or werewolves but it does use Dawnguard resources and will crash without it (if you don\\'t have Dawnguard, try my other mod as listed above).\r\n\r\nApachiiSkyHair_v_1_4 and ApachiiSkyHair Female_v_1_0: http://skyrim.nexusmods.com/mods/10168/?tab=2&navtag=/ajax/modimages/?user=0|:|id=10168\r\n\r\n\r\nFAQ\r\n\r\nMy game crashes with this mod, what\\'s going on?\r\n\r\nOne of three things: 1) you don\\'t have the required mods and Dawnguard installed; 2) The load order is causing issues.  Put Gravesend after the required mods but as close to the top as possible or 3) You have a conflicting mod.\r\n\r\nWhat mods conflict with this one?\r\n\r\nThere shouldn\\'t be any.  Gravesend is a single cell separate space.  The impact it has on the Skyrim world is a trapdoor on a tiny island near the Solitude Lighthouse.  If you have another mod in this exact place, it will cause problems.\r\n\r\nIs \\\"Gravesend\\\" \\\"Grave\\'s End\\\" or \\\"Grave Send\\\"?\r\n\r\nNo.\r\n\r\nWhy does the mod rely on Apachii?\r\n\r\nThis mod exists because of Apachii.  I made Ranni to try out the new hair.  I noticed it covered one eye and wondered why a dual wielding assassin-type would have their hair like that.  Maybe she lost an eye.  The next thing I knew she needed someone to capture her and a place to be held.  Gravesend was born.  So how does a naked one-eyed person get out?  Hello other followers.  I made the mod for myself so a quest seemed fairly pointless.  I won\\'t be releasing a vanilla only version.\r\n\r\nWhy does the mod use Dawnguard?\r\n\r\nI thought Ranni wouldn\\'t be able to effectively use a bow with only one eye (no depth perception).  For some reason I thought she\\'d have better luck with a crossbow.  Then it dawned on me, could someone completely blind fight if they stayed out of melee and only used a crossbow?  Well, they\\'d need exceptional hearing... Hello Cataract George.  A version without Dawnguard would have to lose Ears and a few of Helini\\'s spells.  I\\'m not sure I want to do that.\r\n\r\nWhy does this place look so familiar?\r\n\r\nGravesend was a duplicate of Broken Fang Cave.  It has been changed fairly substantially, but the base is still there (I didn\\'t bother disguising it.  People aren\\'t stupid and I have no desire to try and fool anyone).\r\n\r\nWhy isn\\'t there more storage?\r\n\r\nI think there\\'s ample.  There is storage near the crafting areas and near the bed.  These won\\'t re-spawn.  If you really need more put items on the dead bodies and then move them to wherever you like.  Be warned, though, they are set to re-spawn, although during testing I didn\\'t actually ever observe this occurring.\r\n\r\nWhy are there no display areas or mannequins?\r\n\r\nIt\\'s a taste thing.  I don\\'t like them and it doesn\\'t fit the back story.  If there\\'s a demand for it I might throw them in but I think it would look out of place.\r\n\r\nWhere will the followers go if dismissed?\r\n\r\nThey will return to Gravesend.  They are sandboxed there.  The only other AI package they all share is to sleep.  Ranni will sit in her cage during the day.\r\n\r\nDoes the forge do anything special?\r\n\r\nNot yet.  I may try my hand at armour and weapon mods.  If I do they will likely require the Gravesend forge (to keep all other forges clutter free in the menus).\r\n\r\nWhy do you want comments and screenshots to be posted?\r\n\r\nI\\'ll continue to make mods but I have no real way of knowing if people like them.  If they don\\'t I\\'ll stop putting them up.  People seem very reluctant to put in an endorsement (although it\\'s really nice when people do and it is ludicrously easy to endorse).  A quick comment is appreciated.  My other mod has hundreds of downloads (closer to a thousand now which isn\\'t bad for a companion mod) but very few comments.  There\\'s no real way of knowing if the people trying it like it or not.\r\n\r\nWhy is this considered an adult mod, there\\'s no sex?\r\n\r\nBecause you wouldn\\'t want to open this at work or in any other public space.  I actually find the prison section of Gravesend pretty gross.  If I opened this page at work I\\'d likely find myself with far more time to play about with mods, if you know what I mean.\r\n\r\nWhy is the mod introduced with a story?\r\n\r\nSo I wouldn\\'t have to make a quest.  You now have the back-story.  The rest is all up to you.\r\n\r\nThanks for checking it out and happy gaming\r\n\r\nS3\r\n",
  "categoryId": "66",
  "version": "1.0",
  "author": "Sideshowstew",
  "createdUnix": "1347623374",
  "updatedUnix": "1347623531",
  "containsAdultContent": true,
  "uploadedBy": "sideshowstew",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88367",
      "name": "Gravesend_v_1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3058",
      "fileName": "Gravesend_v_1_0-24100-1-0.zip",
      "uploadedUnix": "1347623531",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2fd37223d74b94c332b2355f3767c9c5aadffc1292c79f45cf941ce29b4f8137/analysis/1407164572/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gravesend_v_1_0-24100-1-0.zip?fid=88367&ttl=1535794758&ri=8192&rs=8192&setec=4d0cc6b7bccd8a02adf67347e0b87999"
    }
  ]
}