{
  "modId": 24105.0,
  "modName": "Cabin - In The Woods",
  "summary": "Adds a lore friendly abode situated in the middle of a forest lake and is hand crafted for viewing pleasure.",
  "descriptionHtml": "Hi!, and welcome to the Cabin in the woods.\r\n\r\n[youtube]TE_9PO4hXvo[/youtube]  [youtube]76P6HoEQkUA[/youtube] \r\n[youtube]F4bsBK85Nkg[/youtube]  [youtube]RSSkgrovowE[/youtube] \r\n\r\nDONT FORGET TO ENDORSE IF YOU LIKE!, IT ONLY TAKES ONE CLICK.\r\n\r\n---Description---\r\nThis mod is a compilation of all my work sown into one, you will see parts from all my mods from Gleaming falls and Winters lodge for examples.\r\nIt has taken a long time to compile these together into one house mod and i hope you enjoy it.\r\nThe cabin itself is situated away from prying eyes in a calm woodland above the rocky smokey alcove where the dragons rest, this build a solid structure thats immune to dragon attacks but also allows the player to observe the great view in which the beasts prey apon the land.\r\nThe cabin has everything you need in a house and is hand crafted into the area and everything you see in the area, from trees to rocks, to even insects are hand placed into coordiantion with each other to make the best possible viewing experience.\r\n\r\n---Features---\r\n-Hand crafted house and landscape layout from the well known countercruels mind.\r\n-Hand placed landscaping for the best possible viewing experience\r\n-Want to store something but dont want to enter in the house? then your in luck!, there is a huge storage chest just located outside the house on the road for your convience.\r\n-Hand placed blacksmithing shelter with:\r\n+Anvil\r\n+Workbench\r\n+Grindstone\r\n+Storage\r\nAnd each place is nicely touched with rugs and carpets and drapes to give a warm feel, and the lighting is also made to be calming with over the top oranges and crystal clear pathing systems.\r\nCabin contains:\r\n+Alchemy \r\n+Enchanting \r\n-No mannuquins for a lore friendly experience\r\n+Storage that never respawns so your loot will always be safe so long as you have the mod installed.\r\n+Sun struck lighting within the cabin gives the feeling that your still in a door distance from the skyrims wilderness \r\n+Cooking area\r\n+Fireplace with relaxing area\r\n+A cosy high class bed for your pleasure\r\n+A work desk for those who wish to plan out and think about there travels\r\n+And books galor\r\nOutside contains:\r\n+Hand crafted waterfall for a amazing calming experience \r\n+Benches situated around the cabin area to take in the gorgous view if you wish\r\n+A statue of talos to be your guardian and watch over the cabin\r\n+Insects surround the area giving a nice welcoming feeling\r\n+Woodan structures hand placed to get around the area with ease\r\n\r\n---Updates---\r\nV1.0 Release\r\nV1.2 \r\n=Fixed books in cabin, they should now stay put and not fly around\r\n=Tweaks to outside for better performance\r\n+Added Chimney to cabin for a more realistic feeling that the inside fireplace is producing smoke.\r\n+Updated chopping block area, should now look more appealing\r\n+Added Tanning rack.\r\nV1.2.1 \r\n=Fixed storage chest next to bed\r\n---Thanks---\r\n\r\ndont forget to rate and subscribe!",
  "categoryId": "67",
  "version": "v1.2.1",
  "author": "Countercruel",
  "createdUnix": "1347624833",
  "updatedUnix": "1347722929",
  "containsAdultContent": false,
  "uploadedBy": "countercruel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88623",
      "name": "Cabin in the woods - Fixed storage",
      "version": "v1.2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "76",
      "fileName": "Cabin in the woods - Fixed storage-24105-v1-2-1.rar",
      "uploadedUnix": "1347722929",
      "modVersion": "v1.2.1",
      "virusScanUrl": "https://www.virustotal.com/file/41184eaa0735739cb3c89be28382d2551bbdaf961569b41e3646e6ca0c374666/analysis/1407167290/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cabin%20in%20the%20woods%20-%20Fixed%20storage-24105-v1-2-1.rar?fid=88623&ttl=1535794762&ri=8192&rs=8192&setec=dd37d3e8d76850279b92166f401420e2"
    }
  ]
}