{
  "modId": 24110.0,
  "modName": "The Cave - A Simple Life ENGLISH",
  "summary": "Much more than a house mod. Construction on everything from the beginning. Of your journal which led you write yourself. Construct an idyllic existence. This mod is a must for role players, people want to create something and want to have popped no giant palace\\'s feet. Build your farm and live in it :)",
  "descriptionHtml": "The Cave - A Simple Life\r\n\r\nTranslation of my german mod. \r\nDiary translated by Alistair77. Thanks to you. *bow*\r\nThe remaining by google. Great tool.\r\n\r\nSo ... the journey begins after you have cleaned the moss mother Cave (northwest of Falkreath). Is a small quest with a hunter who sits in front. Visited the hunter afterwards in the pub in Falk Reach and talk to the landlady Valga and ready to go.\r\n\r\nThe procedure is usually the one reads his diary. Tools and building materials procured. Builds. And the next chapter in his diary. Read your diary, etc. The key point is to what is what to do next. There is no marker. Just pick what you need it .... buy it ... find it ... hunt it (ever looked for a  Hammer, or a broom when you need him? Have fun :))\r\n\r\nTo continue the diary of course you need pen and inkwell. Or logically?\r\n\r\nThe mod contains the following in chronological order not\r\n- A farm house\r\n - Kitchen in the basement. (Look at your stocks of food or alcohol on the shelf. Table is ready when cooked food in the warming pot. Now and then it\\'s dirty .. Sweep! The fire only burns if firewood stack in front of the house is available)\r\n - Living area upstairs (where you lead your diary continue to buy a business book about cattle / sell bookcase bed chests ... the usual....)\r\n - Basement with beds thy servants and CHILDREN! :) .. .. a portal to the tower of trophies Alchemy and enchanter workbench)\r\n\r\n- Farm (with vegetables and wheat)\r\n- Livestock (2 chickens and 1 cow if the cow is bought as a calf and needed some \\'time\\' to grow .. of course only if wheat as a feed in a haystack .. the animals (slaughtered at the butcher table you can see the blood. Meat and offal if available) .. if you decide against it, they provide eggs and cheese ... or they are sold.\r\n- Mine .. contains a small blacksmith .. and is REALLY dark ... so get torches and put them in the brackets. In the smithy you see your ore and your existing bars. There are three of each occurrence.)\r\nHunting camp for your furs and processing it.\r\n-little herb garden\r\n-An idyllic lake and cozy seating\r\nMeet-Dibella statue to your desire for children (assuming you are married)\r\n-training area for your watch\r\n\r\n5 NPC with full daily schedule\r\n-. Selene (Servant. cook (food for himself and the others .. who is tired of working better ;)) .. sweeps ... chopping wood ... looked after the cattle (eggs and cheese) .. provided the Farm (vegetables and wheat) .. bathes naked in the lake ... relax by the campfire and singing bard songs you if you ask them :) .. need leeks and still something like .. for her favorite food also wine\r\n- Melissa (miner. .. bathing, eating, exploring for ore (with its own pit magicians light .. looks great when the mine is still dark :), the ore packed in your chest ... like chicken and mead\r\n- Clessa (Guard. .. bathed, trained long-distance and close combat, is patrol, concerned furs and venison loves beef and mead.)\r\n- The 2 kids running around everywhere and play catch.\r\n\r\nEverything is provided and with Navmeshed Idlemarkern. Critterspawner etc. I have spent hours just to be there and looking around :).\r\n\r\n- Tower of trophies  (with Treasury (is) probably again remodeled armory (under observation) and trophy area (quest-related or not validation active ... the assignment of Favorquests (Thane) is not right somehow .. why scripts initially disabled and all free )\r\n\r\nOther plans:\r\n- Eliminate errors (items replaced by statics, etc.)\r\n- Integration of women and followers (automatically sandbox the cave area )\r\n- Palisades area in front of the cave (maybe occasional attacks)\r\n- Stable area (possibly with rearing horses ..)\r\n- Goats\r\n- (Feeding and breeding) Pet\r\n- If married the partner operates a Mark Booth (in Palisades area)\r\n- Factionrealms (werewolf, vampire)\r\n- More tower fittings\r\n\r\n\r\n\r\nFAQ\r\n\r\nI click on the workbench and nothing happens?\r\n- You have to keep writing your journal.\r\n\r\nWhen you build get the message that what is missing but I have everything in the box.\r\n- What is listed in the diary under construction materials must in the chest ... the tools must however remain in the inventory.\r\n\r\nWhat\\'s the deal with the NPC itself?\r\n- Selene generates 6 fire wood, cook the respective favorite food, 3 of each farm vegetables, cheese and eggs if livestock present.\r\n Her favorite food consists of cabbage and leeks, it should be in the warming pot when she eats, she is full. (+1 Posted on everything) evening at the campfire she likes wine. Then she is satisfied (again +1 on everything). The wine must be in stock in the alcohol cabinet. So they must be cooked the ingredients in the respective containers.\r\n- The same applies to the other two. (Melissa ores, Clessa variety of higher skins)\r\n\r\nThe cow is not just bigger!\r\n- It must be stored wheat in the big haystack .. then it grows gradually.\r\n\r\nThe fireplace is not blazing!\r\n- Firewood in front of the stack house. Selene can not cook when the fire is out. Do not you ;)\r\n\r\nThis mod is designed for immersion, no more and no less, especially.\r\nThis is my first mod so forgiving since if you find errors and give me know so I can fix it ..\r\n\r\nNo updates, DLC, or other mods are required.\r\nIt is 100% inkombatibel with mods that affect the moss mother WorldSpace.",
  "categoryId": "67",
  "version": "0.97",
  "author": "Cettral",
  "createdUnix": "1347632422",
  "updatedUnix": "1347632737",
  "containsAdultContent": false,
  "uploadedBy": "shonin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88386",
      "name": "The Cave - A Simple Life ENGLISH",
      "version": "0.97",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2351",
      "fileName": "The Cave - A Simple Life ENGLISH-24110-0-97.7z",
      "uploadedUnix": "1347632602",
      "modVersion": "0.97",
      "virusScanUrl": "https://www.virustotal.com/file/5478def59b1b01fe0d2e6f053f234aee1ef94f09e2ff3c65e200a8f937c94c78/analysis/1407164712/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Cave%20-%20A%20Simple%20Life%20ENGLISH-24110-0-97.7z?fid=88386&ttl=1535794769&ri=8192&rs=8192&setec=30b556d7a3258df445dc6d259f50974b"
    },
    {
      "fileId": "88387",
      "name": "The Cave - A Simple Life ENG Cheat Chest ESP",
      "version": "0.97",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "151",
      "fileName": "The Cave - A Simple Life ENG Cheat Chest ESP-24110-0-97.7z",
      "uploadedUnix": "1347632737",
      "modVersion": "0.97",
      "virusScanUrl": "https://www.virustotal.com/file/5c7ad9eacb36306a3e6aa117ee24cace036ce609e64d895fbf54da77ff6e767b/analysis/1407164763/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Cave%20-%20A%20Simple%20Life%20ENG%20Cheat%20Chest%20ESP-24110-0-97.7z?fid=88387&ttl=1535794769&ri=8192&rs=8192&setec=eef7b982eeeaf62264a86ecc4df0a6f0"
    }
  ]
}