{
  "modId": 24130.0,
  "modName": "Safe Storage in Dawnguard Houses",
  "summary": "Sets all containers (rather than a select few) within the interiors of Castle Volkihar and Fort Dawnguard to never reset, making the entirety of both buildings safe for storage just like all existing player homes.",
  "descriptionHtml": "This is a very small mod for Dawnguard that simply sets all containers within Fort Dawnguard and Castle Volkihar Keep to never reset, making all storage within both houses safe. Note that without this mod, while most of Castle Volkihar was safe for storage, Fort Dawnguard was mostly not.\r\n\r\nPreviously, the mod worked by making both areas no-respawn zones, which in addition to making all containers safe also prevented items on tables from respawning. As of version 1.1, it no longer does this, so you should find that messes will clean themselves up properly and items on tables (such as the Potions of Blood in Castle Volkihar) will respawn even though containers won\\'t.\r\n\r\nI hope to add a few other fixes to the Dawnguard houses eventually, so feel free to make suggestions in the comments.\r\n\r\nOh, and as I hope should be obvious from the title: yes, the Dawnguard DLC is required.",
  "categoryId": "67",
  "version": "v1.1",
  "author": "TC01",
  "createdUnix": "1347656668",
  "updatedUnix": "1347656712",
  "containsAdultContent": false,
  "uploadedBy": "TC01",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88463",
      "name": "Dawnguard House Fix",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Dawnguard House Fix-24130-v1-1.zip",
      "uploadedUnix": "1347656712",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/624059767ee033cc5cf9eeb8f703777161de9234c03b73125252174e522c1dfb/analysis/1407165543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnguard%20House%20Fix-24130-v1-1.zip?fid=88463&ttl=1535794807&ri=8192&rs=8192&setec=6317c9360f1d89014559c442cea4103e"
    }
  ]
}