{
  "modId": 24148.0,
  "modName": "Tormented Followers - Vhailor",
  "summary": "Adds Vhailor from Planescape Torment (PST) to the game, as a fully functional follower and with his voice from PST.",
  "descriptionHtml": "[b]Vhailor[/b], the legendary Mercykiller from [b]Planescape Torment[/b] (PST) is now present in Whiterun, at the Bannered Mare, waiting for the hero to join with him and deliver justice to the Planes.\r\nHave a look at the video preview in the video section for an in-game demonstration.\r\n\r\n[b]Installation[/b]:\r\n----------------\r\nUnpack the file PSTvhail.zip and copy the files PSTvhail.bsa and PSTvhail.esp in the \\\"skyrim\\\\data\\\" folder, then check the PSTvhail mod in the Data Files section when launching the game. Vhailor should be available in the Bannered Mare.\r\n\r\n[b]Known issues[/b]:\r\n-------------------\r\nAt the moment (version 1.0.0) it seems that Vhailor won\\'t show the follower dialogue if you have other follower mods loaded. Also I haven\\'t tested it with other follower enhancement mods, so just don\\'t load any fancy stuff if you want to test this mod. Otherwise it runs fine.\r\n\r\nVhailor uses the full daedric armor as a placeholder until I or someone else will make a Mercykiller armor model for Skyrim.\r\nI think the daedric outfit is pretty good anyway.\r\n\r\nVhailor will sometimes use the standard follower bow, even though he has a custom (more powerful) bow included.\r\nHis items are non-playable, including the armor, so they cannot be used by the player.\r\n\r\nVhailor cuts off heads pretty often..\r\n\r\n[b]Vhailor\\'s biography[/b]:\r\n-------------------\r\n\\\"[i]I am Vhailor. I am a Mercykiller. I am justice.\r\n\r\nIt is my past. It is my present. It is my future.\r\n\r\nAll who are guilty shall be punished. I shall not rest until the sentences of the condemned have been carried out.\r\n\r\nMercy is for the weak. Punishment breaks souls and makes them worthy of service to their superiors. When the number of martyrs is great enough, rebellion crumbles.\r\n\r\nKnow this, and know my heart: There is only one truth in the multiverse. The multiverse shall be sharpened upon the blade of justice. With justice as its whetstone, the multiverse shall achieve perfection. [/i]\\\"\r\n\r\n[b]Copyright stuff[/b]\r\n=============================================\r\nVhailor\\'s voice set is voiced by actor [u]Keith David[/u].\r\nI used for this mod only content that was already available on the internet through modding communities, fan-sites and Youtube.\r\nThe sources of the sound files I used to voice Vhailor in Skyrim:\r\n* Youtube in-game recordings\r\n* http://www.sorcerers.net (Infinity Engine Games modding site)\r\n-------------------\r\n[i][b]No infringement on copyright is intended, as I started this mod as a personal project, and now it is aimed to the fans of Planescape Torment, and, of course, Skyrim. I made this mod for non-commercial use, free, and as a way to celebrate one of my favorite games of all time and its heroes. There is no malicious intent, and I don\\'t have now, or in the future, any expectations of personal gain in any way (monetary, reputation, etc.) related to the content I don\\'t own. [/b][/i]\r\n\r\n-------------------\r\nMany thanks to deck16.net for the voiced (custom) followers tutorial\r\n\r\nP.S. I\\'m already working on Ignus, probably will be a flaming draugr...\r\n",
  "categoryId": "66",
  "version": "1.0.0",
  "author": "Senyn",
  "createdUnix": "1347703110",
  "updatedUnix": "1347709870",
  "containsAdultContent": false,
  "uploadedBy": "Senyn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88580",
      "name": "PSTvhail",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5977",
      "fileName": "PSTvhail-24148-1-0-0.zip",
      "uploadedUnix": "1347709870",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/c6c9cb370816d7ba5bbf0b29b05ec4dd5ea1cd9261b26e5118a2108c89dcfc12/analysis/1407166752/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PSTvhail-24148-1-0-0.zip?fid=88580&ttl=1535794840&ri=8192&rs=8192&setec=7e2206d103df74e1c6f9778319ee9b5b"
    }
  ]
}