{
  "modId": 24144.0,
  "modName": "Booze Us",
  "summary": "It\\'s about booze, liquor, and the fact that the game gives you liquor that would be in that world as rare as it might be, but doesn\\'t allow you too keep it.",
  "descriptionHtml": "Since I am annoyed with the fact that there are several potions that are in quests that are \\\"unavailable\\\" to the player to keep after the quest is done. I created a Mod that allows you to \\\"acquire\\\" several. It makes it convenient for me since I am a bit of a \\\"collector\\\" of objects especially rare potions and wines.\r\n\r\nThese include \r\nFirebrand Wine, and a couple crates.\r\nStros Ma\\'ki Brandy\r\nArgonian Ale\r\nDragon\\'s Breath Mead\r\nHoney\r\nBalmora Blue\r\nand \r\nFalmer Blood Extract\r\nBothela\\'s Stallion Potion.\r\n\r\nI also as a bit of a joke added:\r\nHonningbrew Reserve\r\n---think of it as a sample crate sent by the original Owner, in a rush of Product Sampling... :D I should put a note on the crate could be funnier still.\r\n\r\nYou will find these\r\nIn the Bee and Barb of Riften\r\n---either for sale on the Male Argonian Waiter, or in their Basement.\r\nThe Hag\\'s Cure in Markarth\r\nThe Blue Palace (main area, near the kitchen), or in the Winking Skeever in their Basement.\r\nBasically I wanted them to also be rare which makes sense with the price and so on...\r\n\r\nI may later add other Products from other games if people think that could be fun... :D\r\nOr the two wines that are going to come out with Hearthfire....\r\n~~~~~~~\r\nupdate 1.2 Adds Balmora Blue to the Bee and Barb\r\nUpdate 2.0 (the modern file)\r\n        Moves the Balmore Blue to the Ratway,\r\n        Adds Double-distilled Skooma to the same place.\r\n        Adds Troll-Fat Salve (A Gimmick made by Brynolf in the game before he made Falmer-Blood Extract\r\n         Adds Cyrodillic Brandy to the Bee And Barb\r\n         Adds an Alchemical Version of Rat Poison, and Fine-Cut Void Salts to the Game\r\n         Adds (from DawnGuard) Alchemical Versions of Finely Ground Bonemeal, and Purified Void Salts Note the mod still does not require Dawnguard as I used the data from only Vanilla Skyrim to create the Items\r\n        Adds a few Jarrin Root to the game\r\n        Adds A Black Briar Mead Barrel as a misc Item.\r\n        Also Should.... SHOULD have both Void Salts, the Rat poison, and the Bonemeal as buyable from Alchemical Merchants.... As they were added to the corresponding lists. However they also can be stolen from Bothela\r\n       Argonian Ale may (similar to the Alchemical ingredients) purchasable from Talen Jei in the Bee and Barb.\r\n~~~~~\r\nFuture:\r\nPossible Adding of potions, ingredients, and food that are in Dragonborn (but unavailable beyond quests) to the common area within the island of Solestiem, and possibly the greater world. Note if people mention said Items I\\'ll listen.\r\n\r\nUpdate 2.1 \r\nThis hopefully will be my last upload of this particular version of this mod, we\\'ll see, I do intend to have a dragonborn version however as well seperate from this one, probably will be an optional file. \r\nAdded A couple of things mentioned by Bothela In Markarth to her assistant to the game: \r\nPickled Spider Tongue, and Spoiled Taproot, they are now within the leveled list for vendors although you\\'re likely to see them about as often as you would Jazbay grapes... \r\nAlso Added Holy Water to the temple of Mara in Riften (4 bottles), and the Temple of Talos in Windhelm (1 bottle). \r\nCreated my own leveled List with Cyrodiilic, Colovian Brandies, Stros Makai Rum and at least one other and added it to the Innkeeper leveled List HOPEFULLY that should give all Inns the ability to sell those... Probably randomly. \r\nAlso Added a Couple of Bottles of Jessica\\'s Wine to the Ratway in Riften.",
  "categoryId": "85",
  "version": "2.0",
  "author": "celethiel",
  "createdUnix": "1347690477",
  "updatedUnix": "1368323289",
  "containsAdultContent": false,
  "uploadedBy": "jerlord",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88558",
      "name": "boozeus",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "boozeus-24144-1-1.zip",
      "uploadedUnix": "1347690720",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/92e327c283b1184a5827b7b3a1685fc75e23252782f3df2098378b71c1fb01e9/analysis/1407166454/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/boozeus-24144-1-1.zip?fid=88558&ttl=1535794834&ri=8192&rs=8192&setec=3b9d9ad50b77b7c1bd071478f219928b"
    },
    {
      "fileId": "1000008245",
      "name": "Boozeus",
      "version": "2.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "7",
      "fileName": "Boozeus-24144-2-0.zip",
      "uploadedUnix": "1360382844",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/9b8e1fab58fb06aec575e4016cad616b7faa3fc091ea13531df891881863b303/analysis/1407406292/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Boozeus-24144-2-0.zip?fid=1000008245&ttl=1535794834&ri=8192&rs=8192&setec=c5b87832a9a6a9a8381959612fd54a88"
    },
    {
      "fileId": "1000029443",
      "name": "booze us 3",
      "version": "3.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "8",
      "fileName": "booze us 3-24144-3-0.zip",
      "uploadedUnix": "1368323289",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/b5d1f422e24fdff320ef4d37a491656f281acf237d6e3e26caec1d476ee6665e/analysis/1407565923/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/booze%20us%203-24144-3-0.zip?fid=1000029443&ttl=1535794835&ri=8192&rs=8192&setec=f755f50b3b386a0765c524794dda716a"
    }
  ]
}