{
  "modId": 24165.0,
  "modName": "New Perks",
  "summary": "Adds more perks and edit some of them",
  "descriptionHtml": "Hi. I made New Perks to improve some perks. Many of them I just edited but I added some ranks to some perks.\r\n\r\nMany of edited perks you can see on the pictures on steam (link down). Because I’m from Poland, you can see Polish sentences but when you install that mod you will have English sentences and if you see any mistakes, tell me please.\r\n\r\n\r\n\r\nThere are all things I added:\r\n\r\n- Many ranked perks like barbarian or alchemist has added rank witch increase armor value, weapon damage or sth like that up to 150%.\r\n- Added rank to Elemental potency and dark souls that u can summon +1 creature.\r\n- Mystic army allows you to summon up to 10 creatures at the same time (you need to have 2 ranks of dark souls, elemental potency and master conjuration to learn this perk).\r\n- Your Atronach perk allows you to absorb up to 60% of enemy’s magic.\r\n- Another rank to Regeneration makes your healing  spells heal you 100% better.\r\n- Now you can reduce stamina needed to strong attacks.\r\n- Unhindered and Cushioned now increase your max carry weigh +50.\r\n- Conditioning now need only 60 pints of Heavy armor.\r\n- You can draw a bow up to 50% faster.\r\n- Sniper allows you to kill enemy instantly (5% chance)\r\n- Now you don’t need to be behind enemy to paralise him (Paralyzing strike and Warmaster).\r\n- Physician makes your potions 50% stronger (required Alchemist 2)\r\n- Poisoner makes your poison 50% stronger  (required Alchemist 2)\r\n- Sneakblood now can make you resist to disease\r\n- Avoid death heals you up to 500 HP  (required Recovery 2)\r\n- You can add 3 enchantments instead of 2 on one item.\r\n- Assassin\\'s Blade now makes your sneak attacks more deadly. You have 15% chance to instantly kill your target.\r\n- Rune master ins now 2 ranks (5 and 10 times farther)\r\n- Multi rune master with 2 ranks. Multi rune master allows to put 4/8 rune at the same time.\r\n- Elemental Ward which creat a magic ward to prectect you from spell (BLOCK) (ID: 6800538A)\r\n- Resistance to magic - increase you resist to magic (RESTORATION) (ID rank 1: 68006E7E) (ID rank 2: 68006E82)\r\n\r\nATTENTION: I don\\'t know why, but Elemental Ward and Resistance to magic is always unactive and you aren\\'t able to lern it in normal way. You need to use commend in console: player.addperk X - where X is perk id. Id ot that perk you can find upper.\r\n\r\nThis mod have problems with Vampire/Werewolf perks in Dawnguard, so if you have it and this DLC, when you open Vamp/Were perks, game will crash. I\\'m trying to solve it.\r\n\r\n\r\nIf you notice any bugs, please, tell me.\r\n\r\n\r\nYou can also find it on Steam: http://steamcommunity.com/sharedfiles/filedetails/?id=79959612 - there you can see all images.",
  "categoryId": "84",
  "version": "1.2",
  "author": "Krokodyl101",
  "createdUnix": "1347722340",
  "updatedUnix": "1347722473",
  "containsAdultContent": false,
  "uploadedBy": "Krokodyl101",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88622",
      "name": "New Perks",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20",
      "fileName": "New Perks-24165-1-2.rar",
      "uploadedUnix": "1347722473",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/35717268878ec824067c1ff788556603859a9961e7b3326d7895f3b415f4d923/analysis/1407167289/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Perks-24165-1-2.rar?fid=88622&ttl=1535794868&ri=8192&rs=8192&setec=02a82ebb8e88dfc0584598da3d74ab04"
    }
  ]
}