{
  "modId": 24191.0,
  "modName": "Dragon Power Up - ITA - ENG -",
  "summary": "Questa mod aggiunge nuove abilità e poteri ei Draghi di Skyrim\r\nThis mod give new spell and power to the Skyrim Dragon",
  "descriptionHtml": "NB:This is the same mod you can find here:\r\nhttp://skyrim.nexusmods.com/mods/14560\r\nThat is always mine (simply deleted previous account) but at an advanced version.\r\nNB:Questa è la stessa mod che trovate qui:\r\nhttp://skyrim.nexusmods.com/mods/14560\r\nSempre di mia proprietà (era il mio vecchio acconto che ho cancellato), solo che è la versione aggiornata.\r\n\r\nDESCRIZIONE ITALIANA:\r\nMod costantemente in aggiornamento, commenti e suggerimenti non sono solo accettati ma rishiesti :)\r\nInizialmente ho creato questa mod per rendere i draghi una vera sfida, e non solo grossi lucertoloni sputafiamme... ma con l\\'avvento di altre mod che li rendono praticamente degli dei, ho pensato sia meglio non esagerare.\r\nQuesta mod rende i draghi più forti del normale, con nuove abilità e punti vita aumentati, ma  comunque abbastanza deboli da essere gestibili già ad inizio gioco.\r\nHo inserito inoltre 3 tipi di drago creati da me, Drago Elettrico, Drago Giovane e Dragone, tutti e 3 con texture personalizzate (spero piacciano ^_^)\r\nSe i draghi risultassero troppo deboli o troppo forti (ma non penso) riferitemelo in modo che possa migliorarli (sono molto ben accetti anche suggerimenti sulle abilità che vorreste dare ai nostri amati lucertoloni alati)\r\n\r\nINSTALLAZIONE:\r\nInstallare via NNM.\r\n\r\nCOMPATIBILITA\\'\r\nNon compatibile con altre mod che modificano i draghi o al loro razza\r\n\r\n____________________________________________________________________________________\r\n\r\n\r\nENGLISH DESCRIPTION:\r\nMod constantly updated, comments and suggestions are not only accepted but requested :)\r\nI originally created this mod to make dragons a real challenge, and not just big fire-breathing lizards ... but with the advent of other mods that make them virtually the gods, I thought it best not to overdo it.\r\nThis mod makes the dragons stronger than normal, with new abilities and hit points increased, but weak enough to be manageable already at the beginning of the game.\r\nI also added 3 types of dragon created by me, Dragon Electric, Young Dragon and Dragon, all 3 with custom textures (hope you like them ^ _ ^)\r\nIf the dragons are too weak or too strong (but I do not think) report it so that i can improve them (suggestions on the skills that you would like to give to our beloved winged lizards are welcome )\r\n\r\nINSTALLATION:\r\nSi consiglia di fare un salvatagio di backup èer sicurezza\r\nIt is recommended to save a backup for safety\r\nInstall via NNM.\r\n\r\nCOMPATIBILITY\r\nNon compatibile con altre mod che modificano i draghi o la loro razza\r\nNot compatible with other mods that modify the dragons or their race\r\n",
  "categoryId": "83",
  "version": "1.1",
  "author": "Kalec84",
  "createdUnix": "1347756802",
  "updatedUnix": "1347820093",
  "containsAdultContent": false,
  "uploadedBy": "Kalec84",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88874",
      "name": "Draghi piu potenti -ITA-",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "32375",
      "fileName": "Draghi piu potenti -ITA--24191-1-1.7z",
      "uploadedUnix": "1347819269",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4edaea344273740d2d0fbf37ba0a689c321658592ff62e6296dc253cbacf58ca/analysis/1407169892/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Draghi%20piu%20potenti%20-ITA--24191-1-1.7z?fid=88874&ttl=1535794907&ri=8192&rs=8192&setec=49011c6a09d687cba92be15bb0af39f1"
    },
    {
      "fileId": "88875",
      "name": "Dragon modified power",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "32389",
      "fileName": "Dragon modified power-24191-1-1.7z",
      "uploadedUnix": "1347820093",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/06fad4271f2bf3dbeca25770c6b1a56af6b69d2a05dfa5c1644fef72d6499d9d/analysis/1407169938/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20modified%20power-24191-1-1.7z?fid=88875&ttl=1535794908&ri=8192&rs=8192&setec=f992a4f21bd60a44b7297e0d6eae3539"
    }
  ]
}