{
  "modId": 24208.0,
  "modName": "Sun Damage Mod by Galejro",
  "summary": "This mod will make you burn and take health damage out in the sun (with exception of shadows), with dawnguard and non-ivasively.",
  "descriptionHtml": "Galejro\\'s Sun Damage Mod\r\n\r\nThis is the first version of my mod regarding the Sun Damage.\r\n\r\nI have been apalled ever since Vampirism did not deal you damage in the sun and since dawnguard came out compatibility issues broke most other sun damage mods for me so here it is.\r\n\r\nWhat does it do?\r\n\r\nWell you just go to a nice neatly hidden shrine in Solitude and take a book, read it and booom! you get sun damage in the sun:\r\n\r\n-Sun damage takes effect In daytime and in the sun = Yes you can hide in the shadows which may prove quite convenient.\r\n-It deals you immediately 100 hp like in the \\\"Vampires hate the sun mod\\\" and 100 hp every 5 seconds if you are still in the sun up until it deals a total of 1000 hp.\r\n\r\nDoes it have problems?\r\n\r\n-Hell yeah, the shadow hiding is based on getlightlevel so this means sun damage will take effect anywhere near active torches or bright lights(that is outside and in daytime of course), -This also includes spells such as healing spells which means no using some magic in the daytime (but since you choose to use this mod I guess you won\\'t be walkin and fireballin in the sun anyways).\r\n-I am not the master of scripting so the spell affects non-vampires as well, you read that book you get sun damage wether you suck it or not of the victims. \r\n\r\nWhat\\'s in store for future?\r\n\r\n-Not much I guess, the only thing I think about is making the mod balanced, such as making a couple of scripts that will make you get 20-30 hp instead of 100 hp for low level players and 200 hp instead of 100 hp for advanced players. You will just need to replace the script in the script file to change the setting.\r\n\r\n\r\nInstallation\r\n\r\nJust extract the files into your Skyrim\\'s data folder.",
  "categoryId": "75",
  "version": "1.0",
  "author": "Galejro",
  "createdUnix": "1347794728",
  "updatedUnix": "1347794807",
  "containsAdultContent": false,
  "uploadedBy": "Galejro",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88807",
      "name": "Galejros Sun damage mod",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21",
      "fileName": "Galejros Sun damage mod-24208-1-0.rar",
      "uploadedUnix": "1347794807",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4ed0572f981dd5edda45934d61e08f8c64be2959727cc5b17d887523ead8570e/analysis/1407169082/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Galejros%20Sun%20damage%20mod-24208-1-0.rar?fid=88807&ttl=1535794940&ri=8192&rs=8192&setec=5c38907efa212f55cfb25dd6cb20a97c"
    }
  ]
}