{
  "modId": 24219.0,
  "modName": "Klingon Race - Alpha",
  "summary": "Adds a very crude attempt on a  Klingon race to Skyrim - Male only so far",
  "descriptionHtml": "Klingons fit quite nicely in Skyrm I think, sure they are not exactly attuned t the reezing cold but they could see that as a challenge.\r\n\r\nKlingons are from Star Trek, hey are great Warriors with unique language, weapons and ifstyle.\r\n\r\nThis is still in major working when I have time also.\r\n\r\nI need some help and guidance in regards to Face tints, normal aps and so forth, texturing is still its infancy for me.\r\n\r\n- Using the High Elf race as a bases due to thier ideal Facial structure and jawline, I used that as a base for adding the cranial ridges and also though of adding the Orc forehead horns and brow horns to add abit of character to the ridges, there also will be various cranial ridge designs not only just based off Worf but Gowron, Martok and any other ideal photo-realistic images that are good for cropping and merging with existing textures in Skyrim.\r\n\r\n- Im having trouble with adding beards, Eyebrows, eye colors etc as the whole process seems to keep messing up (not crashing) but one thing dissapears as soon as I add another feature.\r\n\r\n- The stats have not been worked out yet but are going to be orientated around Combat and heavy armor with a slight benefit in Combat magic and fire resistance.\r\n\r\n- if you equip an Armor, it will only appear as invisible as I have not selected all game-based armors to appear yet, also the helmet mesh thing will be a nightmare when it comes to it.",
  "categoryId": "24",
  "version": "1",
  "author": "Roddenberry",
  "createdUnix": "1347807781",
  "updatedUnix": "1347808900",
  "containsAdultContent": false,
  "uploadedBy": "nofear88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88853",
      "name": "KlingonRace - Alpha",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4996",
      "fileName": "KlingonRace - Alpha-24219-1.rar",
      "uploadedUnix": "1347808900",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/66a3a8360c22e93992839fc01396727f72b4b3b89665b69560c2051ceccfba70/analysis/1407169509/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/KlingonRace%20-%20Alpha-24219-1.rar?fid=88853&ttl=1535794961&ri=8192&rs=8192&setec=384927b89a9ac48e60346792757b91a3"
    }
  ]
}