{
  "modId": 24228.0,
  "modName": "Elder Scrolls V_The Breaking",
  "summary": "We are treating this as a expansion and not just a random quest mod!   ",
  "descriptionHtml": "Okay boys and girls it has been a long time since I have been on and there is a lot I have to tell you all. First this project is not abandoned it is simply on the back burner for the moment. Why is it on hold? well I have some big news and hope you all will help us out with what we are doing. About two months ago we realized a dream we have had for a long time now and that was the founding of a video game company VOID SOFTWORKS. We have been working on our first game you can see screenshots on http://www.voidsoftworks.com/. The game we are making is a lot like TES but different in a lot of ways a example of this is the loss of the players limbs in combat. We will be giving more details soon but we just wanted to give all of you a heads up and let you know what is going on with us. And we hope you will join us on this as we move on to what we hope will be a bright future.\r\n\r\np.s. this project will be hitting kickstarter in about 3 weeks or so and as another side note we are working on content for the site as we speak so its a little barren right now\r\n\r\nhttp://www.voidsoftworks.com/ \r\n\r\n\r\n\r\n\r\n\r\n\r\nWhat is this mod about?\r\n\r\nWell me and my brother got to talking and started thinking, why the hell are we paying $20.00 for DLC\\'s that only last a day and only gives you a short story and no real reward for your hard work except a \\\"thanks a lot for saving the world and stuff\\\". We aim to change that!!! Another thing we wanted was the feel of the old RPG\\'s on play station and a really heavy handed focus on story, not just go here ...kill this guy\r\n\r\nWhats the idea?\r\n\r\nThe story starts when you receive a letter, the note states that a group of adventurers are in need of help finding some treasure in some nameless dungeon..........(WOW!!! mod maker what a amazing creative idea that hasn\\'t been beaten to death at all :down: ) Okay Okay i get that it doesn\\'t sound that great at first but this mod will take you far north. To the city of (see screenshots) BROM KUN, a huge city on a small island in the sea so over populated that the buildings have grow vertically to accommodate for the large amount of people coming and going from this thriving port city. From this Quest packed island you will travel to more islands working your way further north to discover the truth of the elder scrolls.\r\n\r\nSome of the things that will be included.\r\n______________________________________\r\n-mini games\r\n-new factions\r\n-new weapons\r\n-new armor\r\n-followers\r\n-the ability to rule a city\r\n-the power of a demigod (with transformation)\r\n-first person cut-scene\\'s \r\nAND MORE!\r\n\r\nNew businesses, shops and entertainment.\r\n________________________________________\r\n-Banks (store your items and gold ...also a exchange rate for brom kune currency)\r\n-bakery\r\n-college (not like winter holds shitty college but real classes)\r\n-red light district (that\\'s right we are bringing back the house of earthly delights)\r\n-acting on stage\r\n-ability to play music (for gold and fun)\r\n-arena\r\n-bare knuckle boxing matches (be the king of underground slum boxing)\r\n-bouncer (keep the local rabble from starting problems the local bars and mead halls\r\n-barber shops (where you can change your look with new hair types)\r\n-clothing shops (where you can try it before you buy it)\r\nAND MUCH MUCH MORE!!! (not kidding this city is huge...and yes I know I sound like a used car salesman)\r\n\r\n///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////\r\n\r\nThis is List of modders that are helping with the project currently\r\n                                \r\n                               (BCSI MOD TEAM)\r\n____________________________________________________________\r\ndemidekidasu\r\nFarcry3671\r\nAcannibal\r\nfulljacket01\r\n\r\nand 2 other guys that don\\'t have nexus profiles \r\n____________________________________________________________\r\n\r\n-This mod is currently in development we will be putting out a side quest that will showcase some of our ideas.  \r\n\r\n-As a side note if anyone would like to help i will give the full story rundown and everything that is going to be included.\r\n\r\n-The screenshots are of the city BROM KUN, I would say its about 35% completed... this is what i have done after about 8 hours total of actual work. I have put a file out with what i have so far let me know what you think and if the file works.\r\n\r\n-OH! and we will have a trailer ready soon so keep a look out. \r\n\r\nTHE AVAILABLE FILE IS JUST FOR VIEWING AND COMMENTARY....DO NOT REDISTRIBUTE OR USE FOR YOUR OWN MOD!",
  "categoryId": "35",
  "version": "1.2",
  "author": "BCSI Mod Team ",
  "createdUnix": "1347821296",
  "updatedUnix": "1361689724",
  "containsAdultContent": false,
  "uploadedBy": "fulljacket01",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88888",
      "name": "brom kun ALPHA 1",
      "version": "Alpha1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "102",
      "fileName": "brom kun ALPHA 1-24228-Alpha1-0.rar",
      "uploadedUnix": "1347826251",
      "modVersion": "Alpha1.0",
      "virusScanUrl": "https://www.virustotal.com/file/542db94bda857df80fa8e775f4110bdc7f292e7e3ba3abc943074067044a0220/analysis/1407170044/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/brom%20kun%20ALPHA%201-24228-Alpha1-0.rar?fid=88888&ttl=1535794986&ri=8192&rs=8192&setec=13c5649ac9b1405ace803749d6c93656"
    },
    {
      "fileId": "1000012688",
      "name": "BROM KUN ALPHA 2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "183",
      "fileName": "BROM KUN ALPHA 2-24228-1-2.rar",
      "uploadedUnix": "1361689724",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/6bd259decb003b25a8e9d32266bdc7665f5be8f0c2973d9b7f70916b7627733a/analysis/1407436456/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BROM%20KUN%20ALPHA%202-24228-1-2.rar?fid=1000012688&ttl=1535794986&ri=8192&rs=8192&setec=d61e4937c1c879c5354ed2a4853174ca"
    }
  ]
}