{
  "modId": 24248.0,
  "modName": "Jazmin Follower",
  "summary": "A Reguard woman that is currently residing in Riften and working at the Bee and Barb",
  "descriptionHtml": "Please remember to stop back by and ENDORSE the file if you like her.\r\n\r\nWhy a Redguard?  Because someone asked me to make another one and I think there is a lack of Redguard followers and there is only so many ways you can do a Nord.\r\n\r\nABOUT HER:  I played around with her options a bit more than others so she has a bit more to help you.  Also, she maybe carrying a few items with her that could help you in a quest and also help you out from the beginning with a few items.  Not gonna say what they are, she won\\'t make you rich, but she will provide other help.\r\n\r\nSHE IS NON-ESSENTIAL!!!  She will die so you\\'ll have to protect her, I gave her some abilities to help protect her but you will have to pay attention.\r\n\r\nSHE IS AUTO-LEVEL:  20-120\r\nSCALE:  .96 - I wanted her to be a little shorter than typical.\r\n\r\nSKILLS:  \r\nShe is a spellsword and has the following skills:\r\nHealing, Fast Healing, Close Wounds\r\nFlames, Firebolt, Fireball, Flame Cloak\r\nSparks, Lightning Bolt, Thunderbolt, Lightning Cloak\r\nStoneflesh, Oakflesh, Ebony Flesh\r\nFear, Calm\r\nConjure: Flame Atronach, BoundSword, Bound Bow\r\n\r\n\r\nVersions: For now, this is the only version of her, but if asked I may go back and do a Vanilla hair version.\r\n\r\nLOCATION: Riften, Bee and Barb and she does belong to the Bee and Barb faction so she will be doing things around it.\r\n\r\nREQUIRED MODs: There is one requirement and that is Apachii Sky Hair\r\nhttp://skyrim.nexusmods.com/mods/10168 - A deep thanks for Apachii\\'s work!!\r\n\r\nIN THE PICTURES:  I like to show off some peoples work that they spend tireless hours creating for our enjoyment, so without further commentary here is what your seeing.\r\n\r\nARMOR:  The Art of Magicka by Zonzai and Kalell - http://skyrim.nexusmods.com/mods/1040\r\n(These two guys have put so much into that mod, that it takes me a while to download it everytime they release a new version.  \r\n\r\nJEWELRY: The Art of Magicka by Zonzai and Kalell - http://skyrim.nexusmods.com/mods/1040\r\nI had to list them twice because she is wearing a necklace designed by them\r\n\r\nThe Earrings and Circlet are by SidneyB\r\nAshara Dimonized Dress and Dragon jewelry by SidneyB\r\nhttp://skyrim.nexusmods.com/mods/14146\r\n\r\nThe top of the Ear, the clamps are from HN66s Earrings by humannature66\r\nHN66s Earrings by humannature66\r\nhttp://skyrim.nexusmods.com/mods/11130\r\n\r\nMy hope is these modders keep doing more stuff because their stuff is amazing.\r\n\r\nNOTE:\r\nShe will stay where you dismiss her. She will not return to Riften, Bee and Barb.\r\n\r\n\r\nPLEASE: If you enjoy the companion, please be kind enough to endorse the file and maybe post a pic of her in the armor you chose.\r\n\r\nTHANKS: \\\"Thank you for all those modders out there for making this game that much more enjoyable.\\\"\r\n\r\nI also thought of something the other day.  Where would we be without Nexus!!  I want to say thank you to the people behind this site, because without them, we wouldn\\'t have such a great place to find mods for our games.  Thank you Nexus!!\r\n\r\nSPECIAL THANKS: I learned how to do this over the last couple of days from a fellow modder named BravoOskar. He graciously took the time to put up a tutorial, so that some of us could try to do something like this. \r\n\r\nQUESTIONS YOU MIGHT ASK:\r\nQ. I downloaded Jazmin and she doesn\\'t look like your pictures.\r\nA. I am using several mods that make characters in game look better. The main ones are:\r\n\r\n1. Better Females by BellaGail - http://skyrim.nexusmods.com/mods/2812\r\n2. Covereyes by Mr Lenski - http://skyrim.nexusmods.com/mods/4869\r\n3. Coverwomen by Mr Lenski - http://skyrim.nexusmods.com/mods/4869\r\n4. Calientes Female Body Mod by Caliente - http://skyrim.nexusmods.com/mods/2666\r\n\r\n\r\nIF YOU LIKE THIS COMPANION, MAYBE YOU\\'LL LIKE MY OTHER ONES:\r\nArianna - Arianna - http://skyrim.nexusmods.com/mods/24145\r\nBreeLynn - http://skyrim.nexusmods.com/mods/24139\r\nDometria - http://skyrim.nexusmods.com/mods/24161\r\nFayleen - http://skyrim.nexusmods.com/mods/24174\r\nRebecca - http://skyrim.nexusmods.com/mods/24293\r\nAlexandra - http://skyrim.nexusmods.com/mods/24369",
  "categoryId": "66",
  "version": "1.0",
  "author": "Sharky Borror",
  "createdUnix": "1347848583",
  "updatedUnix": "1347848696",
  "containsAdultContent": false,
  "uploadedBy": "SharkyBorror",
  "primaryFile": null,
  "files": [
    {
      "fileId": "88940",
      "name": "Jazmin - NonEssential - Apachii SkyHair 38",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "341",
      "fileName": "Jazmin - NonEssential - Apachii SkyHair 38-24248-1-0.rar",
      "uploadedUnix": "1347848696",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6bbcfed4dc0f8432eaccc1ad76ce8a057d0c676639adc0c809f0cfef18d1b178/analysis/1407170645/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jazmin%20-%20NonEssential%20-%20Apachii%20SkyHair%2038-24248-1-0.rar?fid=88940&ttl=1535795020&ri=8192&rs=8192&setec=dddd331b53d32894265110a86a486bcd"
    }
  ]
}