{
  "modId": 24270.0,
  "modName": "River of souls Quest",
  "summary": "Added a new version since the old one was broken.",
  "descriptionHtml": "I was bored and though I might try on making a mod that adds a new dungeon and a reward, the awesome looking River of Souls sword. I don\\'t know how to make a real quest, since I\\'m just a beginner with scripting etc.. But I did make a book that gives a clue of where to go and you can buy this book at the Riverwood Trader for a merely 12 gold. I asked the maker of River of Souls (newermind43) if I could make a quest out of his weapon and it was all fine by him. So once again, thank you Nevermind43 for letting me use your sword in my mod, kudos :)\r\n\r\n===--- I doubt it would require Dawnguard, but it is recommended! ---===\r\nHowever, you do not need the River of Souls mod for this to work!\r\n\r\nSo if you guys wanna try it out, just download the mod and head to Riverwood Trader and you should all be set.\r\nI have included spoilers as well, and the dungeon might not be as long as you\\'d expect, I might update it and make it longer:)\r\n\r\nVersion 1.1\r\n\r\nOld file was broken so I uploaded a new file this version includes following updates:\r\n\r\nAdded more puzzles\r\n\r\nThere is now a way to get out of the dungeon, silly ol\\' me forgot to put one in the earlier version.\r\n\r\nI will add more to this mod later on, I just want people to play this one first and give me their feedback on it.",
  "categoryId": "35",
  "version": "1.1",
  "author": "Passet",
  "createdUnix": "1347896444",
  "updatedUnix": "1347896885",
  "containsAdultContent": false,
  "uploadedBy": "passet",
  "primaryFile": null,
  "files": [
    {
      "fileId": "89013",
      "name": "River of Souls Quest",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1649",
      "fileName": "River of Souls Quest-24270-1-1.rar",
      "uploadedUnix": "1347896885",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c79b866fd64c5e3f0ecc7087cdc33b472048d3a28c9e5cf7502959a9dff30f58/analysis/1407171311/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/River%20of%20Souls%20Quest-24270-1-1.rar?fid=89013&ttl=1535795056&ri=8192&rs=8192&setec=e86a18ab7f81f3603fb831e261f992d8"
    }
  ]
}