{
  "modId": 24306.0,
  "modName": "Skyprime",
  "summary": "Skyprime employs a low-level approach to fix unbalanced combat gameplay in Skyrim at its roots without overtly affecting the base game apart from balancing changes to combat effectiveness and difficulty.",
  "descriptionHtml": "For ease of instal: here\\'s a short foreword/summary/notes section:\r\n::Don\\'t use another balancing mod or the game will probably become too difficult::\r\n::Compatibility issue: Changes to the Barbarian perkline might cause a conflict::\r\nThis is the only high level change in this plugin.\r\n::NPCs are closer in performance to the player now, might have to use all ressources to keep up::\r\n::Master difficulty will be very challenging without good equipment and potions; and even then::\r\nThings affecting existing characters:\r\n::Weapon and Armor improvement changes:: Might have to create new weapons.\r\n::Archery, 1H & 2H custom enchantment changes:: Might have to enchant new gear.\r\nTry to recreate your gear; if the result would be less powerful you should replace the affected pieces.\r\nOnly affects smithing and three enchantments.\r\n\r\n\r\n\tSkyprime Alpha #1.1 RC#2\r\n\r\n1\t=Mission=Statement=\r\n\r\nWhile Bethesda clearly tried to give DOVAHKIIN the greatest amount of freedom in\r\nplaystyle choice and character-development possible; they as clearly failed to\r\nkeep all choices viable due to large discrepancies in combat effectiveness.\r\nThe goal of this plugin is to balance Skyrims combat gameplay utilizing a minimum\r\nnumber of changes to create an environement where there is true freedom of choice\r\nwith only the smallest necessary modifications to the game itself.\r\n\r\nRegardless of which method of battle your DOVAHKIIN chooses: It should be as\r\neffective as any other method but still make a large difference in gameplay\r\ndue to given advantages or disadvantages (like Dual-Melees lack of blocking).\r\nThe goal is not to make combat more uniform, just roughly equally powerful.\r\nAs a side-effect differences become more pronounced and combat more difficult.\r\n\r\nCornerstones of design are:\r\n\r\n::minimum intervention\r\nThe fewer and smaller the changes the better.\r\n::low level approach\r\nTrying to fix underlying problems instead of symptoms.\r\n::calculation based balancing\r\nThe numbers are based on math and should work well.\r\n::no changes to the base \r\nGame content is virtually unaffected. Changes affect mostly single variables.\r\n\r\nThere are other mods with a similar mission but very different approach,\r\ncommonly including wide ranging changes to all aspects of the game.\r\nThe mission is shared but Skyprime goes the other direction.\r\n\r\n2\t=Changes=\r\n\r\n________::skyprime_1.1.esp\r\n\r\n__General variables\r\n::Maximum flight distance of targeted spells and arrows is now 4000 (was 2000)\r\nYou can now hit flying Dragons more reliably (it\\'s still difficult, tho).\r\n\r\n__Alchemy\r\n::Fortify Restoration now reduces the cost of Restoration spells instead of\r\nincreasing the power of buffs received. Prevents extremely severe exploits.\r\nNice potion for Mages. Fair considering there are Potions of Ultimate Healing.\r\n\r\n__Magic variables\r\n::fMagicDualCastingEffectivenessBase = 2.4 (from 2.2) [cost multiplier still 2.8]\r\nDual-casting spells now have 240% effect (up from 220%), they still cost 280%.\r\n\r\n__Enchanting\r\n::Fortify OneHanded, TwoHanded & Archery have base power reduced to 6 (from 13)\r\nLimits created enchantments to roughly +24% damage (with maximum optimization).\r\n::The Enchantments used in \\\"+X% damage\\\" Generic Magic Items: Archery, 1H & 2H\r\nhas been adjusted in accordance with the Enchanting change above.\r\nThey cap at +20% per piece now.\r\n\r\n__Perks\r\n::Add 10% damage to each level of the Barbarian perk (+50% total)\r\nMakes 2H more powerful than Bows and single 1H weapons.\r\n\r\n__NPC variables\r\n::fUnarmedCreatureDPSMult = 2 (was 1)\r\n::fUnarmedNPCDPSMult = 2 (was 1.575)\r\nUnarmed NPCs, creatures and animals (most of them) now do more damage.\r\n::Leveled actors relative level changed from (EASY / MEDIUM / HARD / VERY HARD)\r\n::0.34 / 0.67 / 1 / 1.25 to 0.5 / 1 / 1.25 / 1.5\r\nThis means most leveled enemies will be of the players level or higher if they\r\nare supposed to be difficult. This does not affect an Actors maximum level.\r\n::fDamageSkillMax = 8 (was 3) [8 times base weapon damage at 100 skill]\r\n::fArmorRatingMax = 5 (was 2.5) [5 times base armor rating at 100 skill]\r\nBrings NPCs up to speed. The player has all manner of items to improve his or\r\nher statistics; NPCs do not, so their skill level must make up for this.\r\nFor comparison, the player has a value of 1.5 (+50% bonus at 100 skill) but can\r\naccumulate a total damage bonus of almost +4000% (compared to the NPCs +800%).\r\nMaster difficulty changes these numbers to +2000% and +1600%. It should be hard.\r\n\r\n__Smithing\r\n::fSmithingConditionFactor = 0.05 (was 0.575)\r\n::fSmithingWeaponMax & fSmithingArmorMax are currently unchanged\r\nMakes improving weapons and armor more difficult (roughly 11.5 times as it stands)\r\nHowever, these values might change in the future once they are better understood.\r\n\r\n________::difficulty_1.0.esp (OPTIONAL, difficulty slider changes, standalone)\r\n\r\nSkyprime is designed around Master (with default values) difficulty. Obviously it\r\ncan be made more difficult or easy by using the slider, especially in conjunction\r\nwith this optional file.\r\n\r\nThe plugin moves normal difficulty 2 steps down unchanged (*). The Labels stay as they were.\r\nExpert and Master difficulty both become more difficult than Master was before the changes.\r\n\r\nA good level to start playing with Skyprime and this plugin enabled would be Adept.\r\nGoing higher than Adept should only be attempted with very well equipped characters.\r\n\r\n:OLD:\t        | Dealt    |Taken    | Combat XP Gain\r\nNovice       | x2        | x0.5      | 50%\r\nApprentice | x1.5     | x0.75     | 75%\r\nAdept        | x1        | x1         | 100%\r\nExpert        | x0.75   | x1.5       | 125%\r\nMaster       | x0.5     | x2         | 150%\r\n\r\n:NEW:         | Dealt    | Taken    | Combat XP Gain\r\nNovice        | x1        | x1         | 100%  (* was Adept )\r\nApprentice | x0.75     | x1.5      | 125%  (* was Expert )\r\nAdept         | x0.5      | x2        | 150%  (* was Master )\r\nExpert        | x0.3333 | x2.5       | 166%\r\nMaster        | x0.25    | x3         | 175%\r\n\r\n3\t=Results=\r\n\r\n::Restoration glitch/exploit can no longer happen as before.\r\n\r\n::Smithing\r\nIncreasing the amount a weapon or piece of armor is improved now requires much higher skills.\r\nThis also means improving items generates less value since they are weaker.\r\nIt should sitll be possible to reach cap armor rating with most armor sets, skills and enchants.\r\n\r\n::Enchanting\r\nAll three damage enchantments are weaker now. With 4 pieces they stack to ~+136%. Enchantments\r\nof premade items had to be adjusted seperately (unfortunately). This cannot be nerfed in another\r\nway it seems. Without a potion at 100 skill these enchantments now yield +18%: Bought ones go up\r\nto +20% so they can actually be quite useful in late-game.\r\nFor comparison, unchanged they can reach ~+54% x 4. This could mean up to +562% damage.\r\nCombined with Smithing this will kill everything with one power attack and we did not even\r\ninclude +180% potion, +50% skill and +100% perks in the calculation.\r\n\r\n::Weapons\r\nTwoHanded weapons are more competetive now. They still deal less damage than Dual-Wielding but\r\nstill allow for blocking, which has become more important now that enemies deal greater damage.\r\n\r\n::NPCs\r\nNPCs statistics are closer to the player now in most cases, including armor rating and damage.\r\nDue to their increased attack power avoiding or blocking attacks becomes much more important.\r\n\r\n::Combat\r\nAll endgame dps are reasonably close together so using Two-Handed becomes just as viable as\r\nDestruction or One-Hand & Shield. Your choice will actually matter regardless of how you fight:\r\ndamage is reasonably fair compared to ALL other combat styles depending on other benefits or\r\ndrawbacks of a weapon and the number of perks required and/or aquired.\r\nProjectiles also have doubled effective range (close to the maximum range NPCs will fight at),\r\nthis helps with engaging flying Dragons somewhat; but they are still hard to hit.\r\n\r\n::More To-Do\r\n\r\n4\t=Installation=&=Compatibility=\r\n\r\nIf you already have improved weapons, armor or enchanted items with 1H/2H/Archery buffs when\r\nyou install this mod you might have to get rid of them if they are more powerful than the new\r\nsystem allows. An easy test is to try create the same item again and if it is worse ditch the\r\nold one. Keeping these items clearly defeats the purpose of the mod (and can confuse testing).\r\n\r\nCompatibility should be good. All changes are listed above. Even if there was an overlap it\r\nshould probably not matter much. If, for example, another mod also tries to fix the Restoration\r\nglitch it will still be fixed, one way or another.\r\n\r\n5\t=Version=Notes=\r\n\r\nAlpha #1.1 RC#2 - 22.09.2012 - created by Microlich\r\nShould be 100% bug free but is not 100% complete.",
  "categoryId": "24",
  "version": "1.1",
  "author": "Microlich",
  "createdUnix": "1347973322",
  "updatedUnix": "1348344319",
  "containsAdultContent": false,
  "uploadedBy": "Microlich",
  "primaryFile": null,
  "files": [
    {
      "fileId": "89190",
      "name": "skyprime_alpha_1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "skyprime_alpha_1-24306-1-0.7z",
      "uploadedUnix": "1347976620",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bc1c8d23f82486c3614d817165c4003d27efa29371faf86e81db829637c99352/analysis/1407172914/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/skyprime_alpha_1-24306-1-0.7z?fid=89190&ttl=1535795119&ri=8192&rs=8192&setec=35124533662174e8db268f08398c82d6"
    },
    {
      "fileId": "89766",
      "name": "difficulty_1",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1",
      "fileName": "difficulty_1-24306-1-0.7z",
      "uploadedUnix": "1348269983",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f1d48e0380e43e831e49c47991cc5e9dabddf2cd2ecb80dbec64f16fc233d1ee/analysis/1407180183/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/difficulty_1-24306-1-0.7z?fid=89766&ttl=1535795119&ri=8192&rs=8192&setec=a614cc8c193bbd83a3c8b620661da18c"
    },
    {
      "fileId": "89920",
      "name": "skyprime_alpha_1_1_rc2",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "skyprime_alpha_1_1_rc2-24306-1-1.7z",
      "uploadedUnix": "1348344319",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/8571707a7c7f38695aaa617168fd0c4823aecaa24ae448ccab8f18253df15fd2/analysis/1407182044/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/skyprime_alpha_1_1_rc2-24306-1-1.7z?fid=89920&ttl=1535795120&ri=8192&rs=8192&setec=417d9771b5cb636a9ca9d149eaf1e6c6"
    }
  ]
}