{
  "modId": 24336.0,
  "modName": "Vampire Slavers Den - Adult",
  "summary": "A player home/dungeon for all those wicked Vampires out there. Located just outside Whiterun this dungeon home includes naked slaves and vampire cattle. Must be Lv20 and a Vampire before you get in.",
  "descriptionHtml": "Vampire Slavers Den X-rated\r\n\r\nWarning ADULT Content!!! BDSM Content!!! Hardcore content!!!\r\n\r\nDon\\'t download and use this mod if you have an issue with it. Furthermore if you have issues with it move onto the next mod not worth making a fuss about something you could have easily passed by, Trolling may just get you banned.\r\n\r\nOnce a powerful clan the vampire slavers all but fallen into history. Consumed with thoughts of lust, blood, greed there many enemies all but destroying them. Will the slavers find another strong leader able rebuild their former glory, or will they too sercombe to the many devilish pleasures that lie within.\r\nMany secrets still lie undiscovered within the Den, secrets that have become lost though out the ages.\r\n\r\nRequirements:Skyrim V1.8 or higher, Dawnguard, Player must be vampire level 20 or higher, Must be of legal age for your country.   \r\n   \r\nLocation:Nestled in the hills just out from Whiterun with magnificent views looking across towards the township our player home dungeon is but a short walk to the Honningbrew meadery.\r\n\r\nContents:\r\nTraining room - With arrow and bolt storage quivers, target practice games with live slaves\r\nForge - Fully equipped forge that may become home to a master smith during your adventures\r\nBlood pool - Vampires may swim and drink in as much blood as they desire\r\nThrone room - Sit in the golden throne and admire the bound beauties gathered for the master’s pleasure\r\nUpper dungeon - Slaves in various positions and states of torture/training\r\nLower dungeon - Many more slaves and a slave mistress who will indulge you in hard BDSM play\r\nBasement - Dreadful place also filled with spoils from numerous victims\r\nQuarters - Painting gallery, beds, coffins, locked master bedroom, kitchen, wine cellar\r\nHarem - Your own harem of slaves, skooma, dancing girls, BDSM games for the player and more\r\nBrewery - Watch the slaves tread the grapes and power the boiler\r\nDepths - Gardens, Spa, many more slaves at the mercy of master’s sadistic pleasures\r\nMines - Your own private slave gang and a pit of despair\r\nLower mines - Explore the lower levels amongst the lava and slaves in peril\r\nTreasure room - Hidden from all, discover the vast riches of a former era and more\r\nSecret valley - Discover the vampire secret valley and trade in the souls of mortals\r\nLair - An undead dragon as your humble servant\r\nTeleport room - once accessed the play may quickly travel to locations in the Den\r\nStudy - Necromancy room, summon up to 5 skeleton warriors as body guards, Black sacrament Den style   \r\n\r\nItems:\r\nDen recall book - reading the books transports the player and followers back to the Study\r\nSoul weapons - craft soul weapons using the stolen souls of mortals\r\nUnique weapons and items - Rings, bows, re-fill able blood potion, soul skull.\r\n\r\nGame play:Vampire players can become not just a dragon soul sink but also collect the souls of all mortals. Trade dragon souls for mortal souls, forge new weapons, offer souls to Molag Bal, and summon unique creatures as followers. Help Hermione restore the Den by slaying its enemies and unlock new members along the way. Rest in the harem bed and receive the lover\\'s comfort perk, rest in the master’s bed with Serana and receive the Mistress Serana comfort perk (for all you Serana lovers out there).\r\n\r\nForgotten:There is more included within, which can easily slip my mind, go see for yourself.\r\n\r\nIssues:Custom vampire races may have difficulty getting in, if blood potions work on your custom vamp you should have no trouble. Some slaves are invulnerable, vampire mods that cause harm to victims may not be able to feed on them. You may end up stuck feeding on some slaves and with your hands bound, jumping breaks you free. The creature followers require modification to the vanilla follower dialogue quest mod conflict may occur but I have found UFO runs right over it and others may also.\r\n\r\nInstallation:Hopefully the NMM auto install works but if not manual merge with your data file. Make sure you are happy with this mod before incorporating it into your steady game as un-installation is not recommended / wise (This should be a part of your normal practice of mod use anyway!) \r\n\r\nUninstallation:DON\\'T !!! (a bad practice Beth. doesn\\'t support either) Remove only if you revert to a save previous to installation, it is dubious about the worth of uninstallation routines etc. and V2.0 has many scripts, I would rather spend more time making the content better than provide for bad practices. This also applies to previous version users.   \r\n\r\nUpgrading:Not recommended upgrading from versions prior to V2.0 do so at your own risk, if you do make sure everything you wish to keep is out of the Den and travel to a location away from Whiterun. Updates from V2.0 and onwards will be in the form of esp\\'s and can be included after the esm in your load order. If you swap change or even alter your load order during game play consider your save game compromised! (That\\'s how Skyrim works unfortunately)  \r\n\r\nFuture Plans:Fix any bugs or problems that come to light. Maybe a market place depending on other armor mod permissions. Link through to Blackreach (must do vanilla quest first)\r\n\r\nBugs and Clashes:I have endeavored to keep this as free from bugs as possible, they will be there and I won\\'t know about them if you don\\'t speak up. Also my load order could look completely different to yours so I have no way of knowing if there are any mod clashes unless you also pipe up. Help me help you by letting me know of any problems. This is a script heavy mod with numerous new items, 200+ NPC\\'s all of which will take a toll on your game, keep that in mind if you have bucket loads of mods installed already. NPC\\'s are persistent and should re-spawn consider save bloat if you mercilessly kill slaves and replacements appear.\r\n\r\nVersions:\r\nV2.0 Major overhaul now in ESM and BSA format, a vampire steward with a quest, unique items, custom dialogue, soul stealing & trading, soul weapons, secrets, teleport hub, many more rooms, custom nifs & textures, 3 different creature followers, small skeleton army, few games for Sub\\'s,\r\n\r\nV1.55 There is an issue with some of the scripts in V1.3, 1.4, 1.5 which have been replaced in this version and it is necessary to upgrade to this version from any of the previous 3 versions. If V1.3, 1.4, or 1.5 are to be removed ensure 1.55 is written over the top and active before resuming play, this may result in objects out of position and the only way to correct that is by de-activating the esp (read un-installation note) and you do so at your own risk!\r\n\r\nV1.5 Split main cell into 2 added kitchen and wine cellar, re-arranged layouts. Removed some doubled up objects.\r\n\r\nV1.4 Major additions, basement expanded, teleport from back of den to front, pool is re-vamped (deep now), story expanded, and a new cell that includes:- training room, spa, garden, sacrifice chamber, sparse room with idle slaves for ZAZ or ASX spells, and of course more naughty! Removed essential flag on NPCs. Quiver containers for arrows/bolts added. Included some roaming slaves, slaves more individual now. \r\n\r\nV1.3 Fixed in-tolerant allies bug, water level control with slave in pit (air games), new room and slave with umm one of those machines, added slave walking the line. \r\n\r\nV1.2 Expanded the test conditions to determine if you’re a vampire, hopefully will now let custom race vampires in without tcl.\r\n\r\nV1.1 Altered lighting levels and introduced more lighting sources.\r\nAdded more furniture and slaves, more sandbox places for followers, added 2 chests in main chamber.\r\nFixed ambient waterfall noise (was outside dungeon for some reason)\r\nRe-arranged the Lydia look alike on the ground, hopefully stop her sinking partly into ground.\r\n\r\nV1.0 Original release version.\r\n\r\nRecommended mods to run with this one:\r\nCalientes CBBE Curvey http://skyrim.nexusmods.com/mods/2666 - Naked models of course.\r\nUFO http://skyrim.nexusmods.com/mods/14037 - Great for hiring new talent and dressing them.\r\nMy Home Is Your Home http://skyrim.nexusmods.com/mods/18045 - Take them to the main chamber and give them a new home.\r\nNPC Clothes Changer and Maintainer http://skyrim.nexusmods.com/mods/11662 - Make use of all those clothes mods on the NPCs.\r\nZaz Resources http://skyrim.nexusmods.com/mods/24023 - Lots of Naughty.\r\nAdult Show XXX - ASX http://skyrim.nexusmods.com/mods/8714 More Naughty.\r\n\r\nAnd just about any skimpy clothing or adult Mod that takes your fancy.\r\n\r\nThanks:\r\nLoopJuggler for exellenct custom music\r\nMayatola for use of screen shots in paintings\r\nJet4571 for custom paintings resource http://skyrim.nexusmods.com/mods/18549  \r\nHydralisk77 for the Evil lair of Hydra http://skyrim.nexusmods.com/mods/12556 - It gave me inspiration. \r\nBeths. Creation Kit Forum for help with scripting.\r\nCopyright free clipart resources \r\n\r\nHope you Enjoy!!! ",
  "categoryId": "67",
  "version": "2.01",
  "author": "Mindboggles",
  "createdUnix": "1348051434",
  "updatedUnix": "1380774969",
  "containsAdultContent": true,
  "uploadedBy": "mindboggles",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000060937",
      "name": "Vampire Slavers Den",
      "version": "2.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "32108",
      "fileName": "Vampire Slavers Den-24336-2-01.7z",
      "uploadedUnix": "1380774969",
      "modVersion": "2.01",
      "virusScanUrl": "https://www.virustotal.com/file/325247f41d7db3711b28cc34e3c1a7492fe8a3586a7ed15aaf4945c0883c0172/analysis/1407743292/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampire%20Slavers%20Den-24336-2-01.7z?fid=1000060937&ttl=1535795168&ri=8192&rs=8192&setec=12070b5d5069051169c1c51dce3e7b02"
    }
  ]
}