{
  "modId": 24355.0,
  "modName": "Helgen Imperial Armory",
  "summary": "This mod adds a small armory to Helgen Keep, mainly for realism/immersion but also to help cover gaps in start-game equipment from the base game, most notably Heavy Armor for Imperial-siding characters, and bows for Archers.",
  "descriptionHtml": "Helgen Keep, being, as it is, an Imperial fortress at the beginning of the game, seems to be somewhat lacking in that it doesn\\'t have an armory of any sort. So, I put a few chests in the first room that every player has to pass through.\r\n\r\nVersion 1.0 of this mod adds three chests to the room in Helgen Keep where Gunjar\\'s corpse can be found. Two of those chests are side-by-side along a wall, and the third is on a different wall. All of them are simply labeled \\\"Chest\\\" ingame.\r\nVersion 1.1 moves these chests; the armor chests are moved to the torture chamber and the magic apparel chest is moved to the storeroom.\r\n\r\nSide by side, you\\'ll find the \\\"Heavy Armor\\\" chest and the \\\"Light Armor\\\" chest. Contained within:\r\nHeavy armor chest:\r\nA full set of Imperial armor (not Imperial Steel armor): boots, cuirass, gauntlets, full helmet, and shield;\r\nOne Imperial Sword;\r\nOne Steel Greatsword.\r\n\r\nLight armor chest:\r\nA full set of Imperial Light armor: boots, cuirass (not the alternate Studded variety), gauntlets, helmet, and shield;\r\nOne Imperial Bow;\r\n100 Iron Arrows;\r\nOne Imperial Sword;\r\nOne Steel Dagger.\r\n\r\nIn the storeroom is a magic apparel chest, containing:\r\nOne randomly-enchanted, leveled robes,\r\nOne leveled hood,\r\nOne random pair of unenchanted boots,\r\nOne pair of unenchanted gloves.\r\n\r\nVersion 1.1 adds two spell tomes: Healing, and one of Frostbite, Flames, or Sparks at random. If you return at level 5 or higher, the selection is expanded to include higher level spells, with tomes for the highest spells appearing at level 30.\r\nI chose the specific items for the chests to match the most common combination, and to ensure that most any playstyle can be covered with a mix-and-match to equip any type of character; for example, a light-armor, dual-wield character can take the armor and sword from the Light Armor chest, and then either the dagger from the same chest or the sword from the Heavy Armor chest, or the axe from Gunjar\\'s corpse. Likewise, a lightly-armored archer has no options for a bow until halfway through the Keep; this mod addresses that, and gives a rather decent bow right at the start of the game.\r\n\r\nThis mod also serves to provide heavy armor for characters who want to side with the Imperials at the start, but also want to wear heavy armor, which is not available from standard loot in Helgen Keep except for players who side with the Stormcloaks at game start - or possibly later in the game when Helgen is taken over by bandits.\r\n\r\nSpeaking of which, these chests are set to respawn, so I think this means that, later in the game, they may contain the same contents again (with the Magic Apparel chest having level-appropriate items for those items which are leveled). I wouldn\\'t use them to store any items, at any rate.\r\n\r\nAlso, I chose Steel rather than Iron for the weapons which don\\'t have an Imperial equivalent, based on the fact that Imperial swords are functionally identical to Steel swords. I chose swords over axes and maces as a personal preference. Two-handed weapons are available by killing Stormcloaks, and tend to be battleaxe or warhammer more often than greatsword, while at least one-handed axe and mace can be found elsewhere in the Keep (the axe being in the same room as the chests).\r\n\r\nWith version 1.1, I took feedback and changed the location of the chests to be more realistic, as well as adding a guaranteed spell tome to account for players who use a mod that removes the starting spells.",
  "categoryId": "78",
  "version": "1.1",
  "author": "Kristoffer",
  "createdUnix": "1348084483",
  "updatedUnix": "1348546704",
  "containsAdultContent": false,
  "uploadedBy": "Deadlykris",
  "primaryFile": null,
  "files": [
    {
      "fileId": "89407",
      "name": "HIA_Initial_Release",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "HIA_Initial_Release-24355-1-0.zip",
      "uploadedUnix": "1348084569",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/88aff4b38ecdb981aceb05f41e5e7343b607bf5c75c8ed7c4139ef4fc9f75a49/analysis/1407175662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HIA_Initial_Release-24355-1-0.zip?fid=89407&ttl=1535795207&ri=8192&rs=8192&setec=1f7cb9285a7d710d248bcb246651a118"
    },
    {
      "fileId": "90339",
      "name": "HIA_1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "HIA_1_1-24355-1-1.zip",
      "uploadedUnix": "1348546704",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7d644d03d2d441c5b357463ba5f34846c389f9b0ec080be1899a9b8c079f876f/analysis/1407185822/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HIA_1_1-24355-1-1.zip?fid=90339&ttl=1535795207&ri=8192&rs=8192&setec=a011a948de85c221236bff99aad55c6c"
    }
  ]
}