{
  "modId": 24358.0,
  "modName": "Dungeon Player Homes Discontinued",
  "summary": "This mod aims to add small player owned areas to existing vanilla locations around Skyrim, including ruins, caves and towers. Discontinued due to lack of demand.",
  "descriptionHtml": "Dungeon Player Homes by FinalEntity\r\n\r\n[b]Hey everyone! Thanks to all who have taken an interest, but I no longer have the time to continue this mod with University, and only a small few seem to have liked it :( So if anyone wants to take it over as their own, send me a message :) Thanks all[/b]\r\n\r\n[b][i]My second mod, I hope you enjoy :) Pictures currently show V0.1a, I\\'ll get some more updated pictures up when I have time :)[/i][/b]\r\n\r\n[center]--------------------------------------------------------------------------------------------------------[/center]\r\n\r\n[b]Description[/b]\r\n\r\nThis mod aims to add small player owned areas to existing vanilla locations around Skyrim, including ruins, caves and towers.\r\n\r\nIt seems strange that these places usually have plenty of sleeping areas and storage space, yet none of it is safe to use on a permenant basis, you can\\'t take over the dungeon and really own it if you wanted to, because you can\\'t relax with your gear. This mod changes that, so you have a safe place to sleep and store your goodies.\r\n\r\nDespite the size, I will fully navmesh any areas, so they will be follower friendly.\r\n\r\nI will modify the original areas as little as possible, to maximize compatibility with other mods and reduce bugs. Typically, I will only add an entrance to the player home, so nothing is removed or changed. The homes will be in their own cell too. This means that the main dungeon or area WILL still respawn. However, the small area that I create will be enemy free, unless they follow you in (Confirmed by m11811).\r\n\r\n[center]--------------------------------------------------------------------------------------------------------[/center]\r\n\r\n[b]Version History[/b]\r\n\r\nV0.3a - Current Release:\r\n   Adds homes to Cracked Tusk Keep and Falgars Tooth\r\n   All homes now require a key, which you\\'ll find near the end/boss level of the dungeon\r\n   Edited Bleak Falls Barrow home - New entrance and clutter\r\n\r\nV0.2a:\r\n   Changed Silent Moons Camp interior to none-respawning\r\n\r\nV0.1a:\r\n   Added small player home to Bleak Falls Barrow\r\n\r\n[center]--------------------------------------------------------------------------------------------------------[/center]\r\n\r\n[b]Locations:[/b]\r\n\r\n[i]Nordic:[/i]\r\n\r\nBleak Falls Barrow - Bleak Falls Sanctum - Alchemist Style Home\r\nFirst room in Bleak Falls Sanctum with enemies. Turn left immediatley after the first two  sarcophagi on your left. The trapdoor is on the wall next to the third sarcophagus.\r\nCheck out the custom made book table on the other side of the room.\r\nKey located in the boss level chest.\r\n\r\nSilent Moons Camp - Exterior/Interior - Warrior/Smith Style Home\r\nStandard Silent Moons Camp; ownership and respawning attributes changed.\r\nRemoved bandits from the interior as I wanted to have them removed once they\\'d been killed, but I can\\'t script :( Instead, I added some more bandits outside :) The two chests inside the dungeon are now safe for storage and the chest by the forge is also safe :)\r\nAdded a bed in the end room too. Key found on the blacksmiths worktable.\r\n\r\n[i]Fort[/i]\r\n\r\nCracked Tusk Keep - Cracked Tusk Vaults - Assassin/Thief Style home\r\nInside left hand cell, before reaching boss level cell. You\\'ll find the key on the pedestal in the boss level cell at the end (NOTE: Taking the key will NOT activate the traps).\r\n\r\nFaldar\\'s Tooth - Faldar\\'s Tooth Interior - Alchemist/Mage Style Home\r\nFirst cell on the left after descending the stairs via the MAIN entrance to the fort (this is the guarded entrance). The key is located atop the main tower, along with the bandit chief. These containers on the top of this tower should also be safe to store your items. Great place for an evening drink :)\r\n\r\nMore locations coming!\r\n\r\n[center]--------------------------------------------------------------------------------------------------------[/center]\r\n\r\n[b]Requirements[/b]\r\n\r\nCreated using the latest (1.7.7) update, so I strongly recommend you have this installed.\r\n\r\n[center]--------------------------------------------------------------------------------------------------------[/center]\r\n\r\n[b]Updating??[/b]\r\n\r\nIf you\\'re upgrading to a newer version of the mod:\r\n\r\n1 - Follow the uninstallation instructions below\r\n\r\n2 - Follow the installation instructions using the updated file\r\n\r\n[center]--------------------------------------------------------------------------------------------------------[/center]\r\n\r\n[b]Install[/b]\r\n\r\n1 - Extract the .esp file from the downloaded archive and copy it into the ../Data/ folder in your Skyrim installation directory.\r\n\r\n2 - Once the file is in place, open your Skyrim launcher, go to \\\"Data Files\\\" and check the box next to \\\"Dungeon Homes.esp\\\"\r\n\r\nOR\r\n\r\nIf you\\'re using Nexus Mod Manager, open the \\\"Plugins\\\" tab and check the box next to \\\"Dungeon Homes.esp\\\"\r\n\r\n[center]--------------------------------------------------------------------------------------------------------[/center]\r\n\r\n[b]Uninstall[/b]\r\n\r\n1 - Remove any items from the home that you want to keep, as removing the mod will remove those items.\r\n2 - Enter an indoor cell elsewhere (a tavern or another home, for example) and save your game.\r\n3 - Uncheck the \\\"Dungeon Homes.esp\\\" box in NMM or the launcher.\r\n4 - Delete the \\\"Dungeon Homes.esp\\\" file from the ../data/ folder in your Skyrim installation directory.\r\n\r\n[center]--------------------------------------------------------------------------------------------------------[/center]\r\n\r\n[b]Bugs[/b]\r\n\r\n- The bed DOES NOT give the player a \\\"Well Rested\\\" bonus, only a \\\"Rested\\\" bonus. As of current, I don\\'t know how to fix this issue. If anyone knows, please let me know, thanks :)\r\n\r\n[center]--------------------------------------------------------------------------------------------------------[/center]\r\n\r\n[b]Disclaimer[/b]\r\n\r\nYou use this mod at your own risk. I do not accept responsibility for any game or system malfunctionsor breakages caused by this mod, directly or indirectly.\r\n\r\n[center]--------------------------------------------------------------------------------------------------------[/center]\r\n\r\n[b]Permissions[/b]\r\n\r\nYou\\'re free to picture my mod in any screenshots of yours, but please give credit.\r\n\r\nIf you would like to add my mod as part of your own, just ask for permission first.\r\n\r\nHowever, you cannot re-upload this mod and claim it as your own. ",
  "categoryId": "67",
  "version": "0.3a",
  "author": "FinalEntity",
  "createdUnix": "1348095988",
  "updatedUnix": "1348157449",
  "containsAdultContent": false,
  "uploadedBy": "FinalEntity",
  "primaryFile": null,
  "files": [
    {
      "fileId": "89544",
      "name": "Dungeon Homes V0_3a",
      "version": "0.3a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "59",
      "fileName": "Dungeon Homes V0_3a-24358-0-3a.rar",
      "uploadedUnix": "1348157449",
      "modVersion": "0.3a",
      "virusScanUrl": "https://www.virustotal.com/file/3850ad7c9ae5824e36befbaace87f4c933102091aa8a775ceabbd57cf1f220c1/analysis/1407177134/",
      "changelogHtml": " Added Cracked Tusk Keep Home <br/> \n Added Faldars Tooth Home <br/> \n Overhauled Bleak Falls Barrow Home entrance <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dungeon%20Homes%20V0_3a-24358-0-3a.rar?fid=89544&ttl=1535795211&ri=8192&rs=8192&setec=d1418220a8c86cd14242e47265ad6477"
    }
  ]
}