{
  "modId": 24378.0,
  "modName": "Afterburner",
  "summary": "Feed the poor, flash fry those chickens!",
  "descriptionHtml": "[color=#FF0000][b]The files and images associated with this mod are to remain on the Nexus (nexusmods.com). If you wish to use this mod with your own, and upload it, please contact me for approval.[/b][/color]\r\n\r\nAuthor: McclaudEagle\r\nVersion: 1.0\r\n\r\n[youtube]92Myd6PX4ic[/youtube]\r\n\r\nThanks to LiveStyleGaming for the video. Afterburner is at 3:48.\r\n\r\nDescription: Adds a tome in the Sleeping Giant Inn (Riverwood) which allows the player to learn the might spell, Afterburner!\r\n\r\nImagine having the power of a jet engine in the palm of your hand. The ability to light your enemies up like a Christmas tree, and blast them off the side of that 300ft cliff to their doom. Let\\'s face it, Flames is underwhelmingly warm, and Unrelenting Force is about as unrelenting as a cat with a ball of yarn. Send people off cliff faces, blast those guard-telepathically-linked chickens onto someone\\'s dinner table on the other side of Skyrim (except a bounty), or try to use it to break your fall from a 5000ft drop, only to die because you actually thought this worked in VTOL mode...the choice is yours!\r\n\r\nInstallation: Simply extract the Afterburner.esp file into your Skyrim Data folder (Steam > SteamApps > Common > Skyrim > Data)\r\n\r\nUninstallation: De-select the mod in the mod manager program you use, and delete the Afterburner.esp file.\r\n\r\nLegal: You may use this mod however you see fit, as long as I am credited. Failure to comply with my terms will result in one thousand angry chickens chasing you to the ends of the Earth, that will peck you to death in a slow and painful manner. After that, your intestines will be used as skip-ropes for Lord Sheogorath\\'s pleasure.",
  "categoryId": "75",
  "version": "1.0",
  "author": "McclaudEagle",
  "createdUnix": "1348133772",
  "updatedUnix": "1348133816",
  "containsAdultContent": false,
  "uploadedBy": "McclaudEagle",
  "primaryFile": null,
  "files": [
    {
      "fileId": "89499",
      "name": "Afterburner",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Afterburner-24378-1-0.7z",
      "uploadedUnix": "1348133816",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/300d96217c9182b0d56c63260019906b6d1607bc6932a1d72082532887fc8e61/analysis/1407176703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Afterburner-24378-1-0.7z?fid=89499&ttl=1535795274&ri=8192&rs=8192&setec=445ddfaa28fde05202c3c24b5bbc9afa"
    }
  ]
}