{
  "modId": 24386.0,
  "modName": "Sabre Gear Backpack Deutsche Version",
  "summary": "Dies ist eine deutsche Übersetzung der Mod \\\"Sabre Gear Backpack\\\" von TreasureChest. ",
  "descriptionHtml": "Sabre Gear Backpacks v2a - Deutsche Version\r\n-------------------------------------------\r\n\r\nIm Originalen von TreasureChest zu finden auf Nexus.\r\n[b]http://skyrim.nexusmods.com/mods/13687[/b]\r\nIns Deutsche übersetzt von Lorina.\r\n\r\n\r\nInstallation\r\n------------\r\nLadet euch zunächst die originale englische Mod herunter, entpackt sie und fügt die Dateien in den Data-Ordner des Spieles Skyrim hinzu. Fügt danach die von mir übersetzte Datei  \\\"SabreFurBag.esp\\\" in den Data-Ordner. Überschreibt diese. Achtet darauf, die .esp zu aktivieren.\r\n\r\nFür den Download mit NMM installiert zuerst die englische Version, danach die Deutsche. Ihr müsst die Datei überschreiben. Aktiviert sie anschließend.\r\n\r\n\r\nDeinstallation\r\n--------------\r\nDie SabreFurBag-Dateien aus dem Data-Ordner löschen.\r\n\r\n\r\nAnmerkung der Übersetzerin\r\n--------------------------\r\nObwohl ich mir bei der Übersetzung des folgenden Textes viel Mühe gegeben habe, kann es sein, dass ich das ein oder andere falsch interpretiert habe. Über konstruktive Kritik freue ich mich. Der nun folgende von mir übersetzte Text, insbesondere der Disclaimer, sind nur als Übersetzungshilfe gedacht. Einzig und allein der originale Text von TreasureChest hat Gültigkeit! Die englische und einzig gültige Readme befindet sich im originalen Download.\r\n\r\n\r\nBeschreibung\r\n------------\r\nDiese Mod zielt darauf, \\\"TreasureChests Fur Bag\\\" im Stile von \\\"Sabre Cat Gear Mod Pack\\\" und \\\"Sabre Gear Ancient Nord Armor\\\" zu verbessern. \r\n\r\nMit neuen Texturen (von DVAted erstellt) und neuem Taschen-Zubehör (hinzugefügt von TumbaJamba) wollten wir praktische und zugleich lore-freundliche Modelle hinzufügen, die helfen die Tragekapazität zu erhöhen. Genau wie die \\\"Bag of Fur\\\" Mod hat auch hier jeder Rucksack eine Verzauberung, die die Tragekapazität erhöht. In einer alternative.esp gibt es auch Rucksäcke ohne diese Verzauberungen (NE). Diese könnt ihr selbst verzaubern.\r\n\r\nDie Rucksäcke können in der Schmiede unter dem Bereich Pelz gefertigt werden. Sie gelten nicht als Rüstung und können somit auch nicht am Tisch verbessert werden. Sie verwenden einen freien Slot, sodass durch das Anlegen keine anderen Rüstungsteile ausgetauscht werden.\r\n\r\nDurch eine eigene Kollisionsbox können die Rucksäcke auf den Boden gelegt oder in der Vorschau im Inventar angesehen werden. Die Glasflaschen sind zu 20% transaprent.\r\n\r\nDie Texturen (von DVAted) stimmen mit dem Sabre Cat Gear Mod Pack überein, können auch aber mit jeder anderen Rüstung benutzt werden.\r\n\r\nEs gibt zwei verschiedene Gewichts-Versionen mit unterschiedlichen Modellen:\r\nRucksack des Reisenden (+50 Tragekapazität)\r\nRucksack des Überlebenskünstlers (+100 Tragekapazität)\r\n\r\nJede mit 3 Fell-Farben, werden im Gegensatz zum Sabre Cat Armor aber mit Bärenfell hergestellt.\r\n\r\nPelze:\r\n1. Normal (braun/orange, für den Jäger - erfordert Bärenfell)\r\n2. Weiß (weiß, für den Schneewanderer - erfordert Schneebärenfell)\r\n3. Schwarz (schwarz, für Freunde der Schatten - erfordert Höhlenbärenfell)\r\n\r\nWeitere Zutaten sind Dinge wie Pferdefell, Ziegenfell, Leder und Lederstreifen und sogar eine Fackel und eine Holzfälleraxt für die schwere Version.\r\n\r\nWir wünschen euch viel Freude mit eurem neuen Rucksäcken auf euren Reisen!\r\n\r\n\r\nAnforderungen und Konflikte\r\n---------------------------\r\nKeine mehr. Wir freuen uns über weitere Meldungen und konstruktive Kritik.\r\n\r\ngemeldete Bugs:\r\n- violettes Glühen (FIXED) Danke an Nivea\r\n- Stahl-Kriegsaxt wird in der Schmiede nicht erkannt (FIXED) Die neue Version nutzt die Holzfälleraxt\r\n- Hirschfell wird in der Schmiede nicht anerkannt (FIXED) Wird nicht mehr benötigt\r\n\r\nDas Hirschfell wurde durch Pferdefell ersetzt. Wenn ihr kein Pferdefell finden könnt, habt ihr nicht gründlich genug gesucht. Sie können fast bei allen allgemeinen Händlern gekauft werden, insbesondere bei den Khajiit Karavanen. Ebenso können tote Pferde in der Nähe der Riesenlager (oder auf ihrem Grill) gefunden und gelootet werden. \r\n\r\n\r\nDisclaimer\r\n----------\r\nDiese Mod darf ohne ausdrückliche Erlaubnis der Autoren nirgendwo zum Download angeboten werden. Veröffentlicht keine Links zu Mediafire in Youtube-Videos! Direkte Links zu der Mod-Release-Seite sind erwünscht.\r\n\r\nDiese Mod wurde auf Steam Workshop von TumbaJamba (uCTo4HuK 3aPa3bl, http://steamcommunity.com/sharedfiles/filedetails/?id=19224) hochgeladen und durch TreasureChest hier.\r\n\r\nVerwende keine Bestandteile dieser Mod in deinen eigenen Projekten oder Veröffentlichungen ohne uns in den Credits zu nennen. Wir geben gerne die Genehmigung, wenn wir deine Pläne für würdig erachten, aber bitte frag uns zu aller erst. Die gebührende Anerkennung (Credit) sollte als heilig betrachtet werden.\r\n\r\nWir haben haben hart daran gearbeitet. Blut, Schweiß und Tränen, buchstäblich für Monate. Danke ^_^\r\n\r\n\r\nCredits\r\n-------\r\nTreasureChest/OG-Jay - für die Basis-Tasche und das Weinmodell-Skin, hinzufügen des Pferdefells, der Halskette und der Holzfälleraxt-Elemente. Ebenso für die meisten Texturen und die erste Nexus-Version.\r\ntumbajamba - für das Hinzufügen der Fackel, Flaschen und der Stahlkriegs-Axt, sowie das Steam-Release.\r\nDVAted - für die .esp, die Pelztexturen und die Readme. Und für das Mod-Team Management.\r\nTagaryen - rigging help und die allgemeine Unterstützung\r\nNivea - für den Fix des violetten Glühens\r\n",
  "categoryId": "60",
  "version": "2a",
  "author": "Lorina",
  "createdUnix": "1348148080",
  "updatedUnix": "1348148186",
  "containsAdultContent": false,
  "uploadedBy": "Lorina",
  "primaryFile": null,
  "files": [
    {
      "fileId": "89528",
      "name": "Sabre Gear Backpack v2a DV",
      "version": "2a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Sabre Gear Backpack v2a DV-24386-2a.rar",
      "uploadedUnix": "1348148186",
      "modVersion": "2a",
      "virusScanUrl": "https://www.virustotal.com/file/f74d3fa4c4c739f6051363896ee962ecec99714d3a35d537fb503afdfac7b0dc/analysis/1407176948/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sabre%20Gear%20Backpack%20v2a%20DV-24386-2a.rar?fid=89528&ttl=1535795286&ri=8192&rs=8192&setec=1aa675987976ccb4d57648d74e011bf6"
    }
  ]
}