{
  "modId": 24395.0,
  "modName": "Multiple Weapon and Armor Storage Houses",
  "summary": "This mod adds multiple weapon/armor storage houses (one in each town/city) where there are plenty of weapon racks, mannequins and displays for all the cool weapons and armor you have collected and forged. No more filled up chests or cramped player homes, there will be plenty of space for all your gear to store in each city.",
  "descriptionHtml": "Multiple Weapon and Armor Storage Houses:\r\nThis mod adds multiple weapon/armor storage houses (one in each town/city) where there are plenty of weapon racks, mannequins and displays for all the cool weapons and armor you have collected and forged. \r\n\r\nWhy I created this mod, MY EXPERIENCE:\r\nWhen playing Skyrim I was bummed out by the low amount of mannequins, weapon racks and display cases you could use through out the game. It takes quite a while before you gain access to them (in a buyable player home) and even then there is such a low amount of them that my collector inside just wasn\\'t satisfied. So I created multiple simple houses with mannequins, weapon racks and displays thru out Skyrim. There is one in or near every town or city. These include Whiterun, Riverwood, Helgen, Falkreath, Rorikstead, Markarth, Karthwastern, Dragon Bridge, Solitude, Morthal, Dawnstar, Winterhold, Windhelm, Shor\\'s Stone, Riften and Ivarstead. The weapon and armor storage house is always very near the fast travel point of the town/city or near it\\'s stables. Enjoy your collections in your new weapon and armor storages!\r\n\r\nDisclaimer:\r\n- This isn\\'t a very pretty mod, I made it pure for functionality. The weapon storages are simple farmhouses with two floors and a substantial number of mannequins, weapon racks and displays. I did take into account the landscaping though (snow or no snow). The view on the rear of Morthal Weapon Storage is quite nice though.\r\n- Sometimes the mannequins act a little weird when you enter the room, then they spawn to the place they\\'re supposed to be in. I have no idea why.\r\n- For some reason, I couldn\\'t get the navmesh to work properly, so the mod is not yet compatible with followers entering the house (not that you\\'d need them there).\r\n\r\nFeedback is welcome",
  "categoryId": "67",
  "version": "1.0",
  "author": "Edje Noh",
  "createdUnix": "1348175802",
  "updatedUnix": "1348176025",
  "containsAdultContent": false,
  "uploadedBy": "EdjeNoh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "89573",
      "name": "WeaponStoragesV1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "202",
      "fileName": "WeaponStoragesV1-24395-1-0.rar",
      "uploadedUnix": "1348176025",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e204739554e5f688322f2e48eef3a3cc168c8d041d8fed325cae1a9fd91e653d/analysis/1407178325/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WeaponStoragesV1-24395-1-0.rar?fid=89573&ttl=1535795313&ri=8192&rs=8192&setec=b60146b2ae5adc2a96fc7faa391532ce"
    }
  ]
}