{
  "modId": 24409.0,
  "modName": "Green Thumb - Harvest More",
  "summary": "Alters the \\\"Green Thumb\\\" perk to give you 5, 10, 20, 30, or 50 items per harvest!",
  "descriptionHtml": "Love gathering items? Hate that spending a huge amount of time gathering results in a rather meager amount of ingredients? Well this is the mod for you! There is a perk in the alchemy tree named \\\"Green Thumb\\\" which makes it so you get 2 items instead of 1 each time you harvest something. This mod alters that perk to give you more items per harvest. There are options for 5, 10, 20, 30, and 50 items, per harvest. Is it cheating? Yeah, but who cares. If ya don\\'t like cheating don\\'t use it :P\r\n\r\nI have not changed anything about this perk aside from it\\'s harvest multiplier, so you will still be required to level your alchemy skill to 70 and get any prerequisite perks before you can learn this perk.\r\n\r\nFor manual install, extract the files into your data folder. Once extracted to your data folder, open up the skyrim launcher, go into data files, and enable only 1 of the 5 plugin files, for whichever harvest rate you wish to use. If you have more than 1 of them enabled it either won\\'t work, or it will use whichever of them is latest in your load order.\r\n\r\nFor NMM install, click the download with NMM button, and in NMM install the mod. Once installed, go to your mods tab and disable 4 of the plugin files leaving only the 1 plugin file enabled with the harvest rate you wish to use.\r\n\r\nTo uninstall, delete the following files from your data folder:\r\nGreen Thumb - Harvest More - Readme.txt\r\nGreen Thumb - Harvest More - 5x.esp\r\nGreen Thumb - Harvest More - 10x.esp\r\nGreen Thumb - Harvest More - 20x.esp\r\nGreen Thumb - Harvest More - 30x.esp\r\nGreen Thumb - Harvest More - 50x.esp\r\n\r\nTake care using this with any \\\"auto harvest\\\" mods, especially if using one of the higher harvest multipliers in this mod, as the amount of items in your inventory could stack up pretty quick!\r\n\r\nThis should not conflict with anything except any other mod that alters this perk, and even if there is a conflict, it would most likely just use whichever mod is later in the load order and not cause any actual problems.",
  "categoryId": "40",
  "version": "1.0",
  "author": "HiFiSi",
  "createdUnix": "1348197046",
  "updatedUnix": "1348202413",
  "containsAdultContent": false,
  "uploadedBy": "HiFiSi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "89639",
      "name": "Green Thumb _ Harvest More 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Green Thumb _ Harvest More 1_0-24409-1-0.rar",
      "uploadedUnix": "1348202413",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b711457a22f6d57d06d24b2a54ca2ae53f203cc80cee74e863864c4276b50c09/analysis/1407178743/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Green%20Thumb%20_%20Harvest%20More%201_0-24409-1-0.rar?fid=89639&ttl=1535795334&ri=8192&rs=8192&setec=b79b02c4ba520ea0b42a2871a0ccb61f"
    }
  ]
}