{
  "modId": 24445.0,
  "modName": "SPERG - Skyrim Perk Enhancements and Rebalanced Gameplay",
  "summary": "A minimalist perk overhaul aimed at making leveling more fun and rewarding. Earn basic perks automatically, saving perk points for specializing your character with unique abilities. SPERG also boasts an easy installation, a variety of configuration options, and high mod compatibility.",
  "descriptionHtml": "[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/hXQSy.png[/img][/url][/center]\r<br />\r<br />In vanilla Skyrim, some skills are much harder to level than others, and some perk trees are near completely worthless. SPERG fixes both of those things by adjusting skill leveling rates, adding a number of different sources of skill gain for some of the harder skills to level, and completely overhauling the perk trees. The leveling adjustments reward players for actually going out and playing the game instead of just grinding skills because they don&#39;t go up fast enough any other way, and SPERG&#39;s perks are truly exceptional. Far from being the boring, minimalist perks of the regular game, each perk is meaningful and unique. Many perks could even be made into their own standalone mod. Give SPERG a shot and see why so many people refuse to play without it&#33;\r<br />\r<br />[b][color=red]BEFORE YOU INSTALL:[/color][/b][color=red]\r<br />This mod requires [url=http://skse.silverlock.org]SKSE[/url], [url=http://skyrim.nexusmods.com/mods/3863]SkyUI[/url], and the [url=http://skyrim.nexusmods.com/mods/1175]Skyrim -Community- Uncapper[/url]. See the installation section for more details.\r<br />\r<br />[b]BEFORE YOU UPGRADE:[/b]\r<br />Any SPERG version prior to 4.0 must be uninstalled before installing newer versions. Don&#39;t just delete the old version - you [i]must[/i] use the included uninstall function or your save file will retain abilities and script fragments that cause unpredictable bugs. See the upgrade section for more details.[/color]\r<br />\r<br />[color=yellow]If you use and like this mod, please click the endorse button to help other people find it. Thanks&#33;[/color]\r<br />\r<br />[b]Available Translations:[/b]\r<br />[list][*][url=http://skyrim.nexusmods.com/mods/29286]French[/url]\r<br />[*][url=http://www.skyrim.nexusmods.com/mods/33903]German[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/36401]Chinese (Traditional)[/url]\r<br />[/list]\r<br />If anybody would like to localize this into additional languages, please do&#33; I&#39;d be happy to answer any questions I can.\r<br />\r<br />[heading]Skyrim Perk Enhancements and Rebalanced Gameplay[/heading]\r<br />[b][color=yellow]New in version 4.0:[/color][/b]\r<br />[list][*]Almost every part of the mod was rewritten and optimized. This is the best version of SPERG yet, by far.\r<br />[*]All perk trees completed&#33;\r<br />[*]Autoperks have been improved for even more variety.\r<br />[*]Better support for the Dawnguard and Dragonborn DLCs.\r<br />[*]More sources of skill gain make leveling more natural than ever.\r<br />[*]Hardcore mode added for users who prefer a more difficult game.\r<br />[/list]\r<br />[b][color=orange]Why install this mod?[/color][/b]\r<br />\r<br />[color=#add8e6][b]-Import your existing character[/b][/color]\r<br />While it&#39;s meant for a new character, SPERG will automatically import existing characters when you first load it. Make a backup save to be safe (you should always do this when installing a new mod) and give it a try now, not later.\r<br />\r<br />[color=#add8e6][b]-More playstyles[/b][/color]\r<br />Play the character you want without worrying about gimping yourself in combat. Characters like non-destruction mages and dagger rogues are much more viable with this mod.\r<br />\r<br />[color=#add8e6][b]-Modular design without the installation fuss[/b][/color]\r<br />SPERG installation doesn&#39;t require choosing between multiple different modules or combinations of plugins - you just install it and play. If you want more customization, the in-game menu has plenty of options. For users who really want to get into the thick of modding, SPERG lets you override any tree you want, and it also supports custom plugins. It&#39;s as simple or as complicated as you want it to be.\r<br />\r<br />[color=#add8e6][b]-Seamless integration with the original game[/b][/color]\r<br />Everything this mod adds could easily be a part of the original game if you didn&#39;t know better. Making sure that a first time player would have no idea they&#39;re using a mod was one of my top priorities.\r<br />\r<br />[color=#add8e6][b]-More variety[/b][/color]\r<br />Too many characters in vanilla Skyrim end up playing almost exactly alike. Access to more varied perks and abilities gives each character a truly unique feel, making the game more fun on its own and creating more interesting tools for role-playing. Want to play a survivalist hunter who lives in peace with wild animals? Now you can.\r<br />\r<br />[color=#add8e6][b]-Brings the fun back to leveling[/b][/color]\r<br />With more perks to look forward to and more unique abilities, you can really feel your character progressing instead of feeling like the only thing that changes is the look of your weapon. The way your character plays will change as he or she grows.\r<br />\r<br />[color=#add8e6][b]-Meticulously balanced[/b][/color]\r<br />While there&#39;s always room for improvement, I&#39;ve put a lot of effort into making sure these changes are consistently balanced. The overall power level is slightly higher than in the original Skyrim due to the perks themselves being better, but there shouldn&#39;t be any singularly overpowered perks or skill trees. When needed, I even calculated ability damage based on the game&#39;s internal formulas to make sure it was consistent.\r<br />\r<br />[color=#add8e6][b]-Skill synergy[/b][/color]\r<br />The old perk trees only ever gave benefits to their related skill, which made skills feel disconnected and left certain skills without much use. The new perk trees give a lot more benefit to other skills, increasing the complexity of different character builds, and making even the most useless skills more interesting.\r<br />\r<br />[color=#add8e6][b]-Minimal conflicts[/b][/color]\r<br />Everything is carefully designed to have as few conflicts with other mods as possible. Even where conflicts arise, fixing them (or at least finding workarounds) should be relatively simple. SPERG is extremely mod friendly.\r<br />\r<br />[color=#add8e6][b]-Modder&#39;s resource[/b][/color]\r<br />I&#39;ve included the source code for all of my scripts, with the most generally applicable ones being generously commented. If you see an interesting ability that you want to copy or expand upon, you can find out exactly how it works.\r<br />\r<br />[color=#add8e6][b]-Less grinding, more playing[/b][/color]\r<br />With SPERG, you don&#39;t have to worry about things like letting a mudcrab hit you enough so your armor skill keeps up with your other skills. Forget about grinding and just play. SPERG takes care of the rest.\r<br />\r<br />[b][color=orange]What exactly does it do?[/color][/b]\r<br />\r<br />[color=#add8e6][b]-Smooth scaling[/b][/color]\r<br />Rather than tying skill improvement to a series of perks that you purchase as your skill increases, SPERG ties it to your skill directly. You no longer have to worry about what perks to take if you want a skill to be effective. Perks add new things, not make existing things better.\r<br />\r<br />[color=#add8e6][b]-Automatic perks[/b][/color]\r<br />Similar to how the skill system worked in Oblivion, you earn unique bonus perks at 25, 50, 75, and 100 in each skill. These are great rewards for leveling up skills even if you don&#39;t intend to spend any perk points on them.\r<br />\r<br />[color=#add8e6][b]-New perk trees[/b][/color]\r<br />It goes without saying that perk trees are completely redone in this mod. Nothing was removed (just made automatic or combined with other perks), but well over a hundred completely unique perks have been added.\r<br />\r<br />[color=#add8e6][b]-Fully Configurable[/b][/color]\r<br />Don&#39;t like an item in this list? Don&#39;t worry, it can be turned off. You&#39;ll never have to worry about a feature you don&#39;t like being bundled with features you do.\r<br />\r<br />[color=#add8e6][b]-Improves Skill Rates[/b][/color]\r<br />Through the [url=http://skyrim.nexusmods.com/mods/1175]Skyrim -Community- Uncapper[/url], this mod tweaks the leveling rates of each skill (but only slightly). The aim was to reduce grinding and balance the rate at which all skills increase, but to do so without changing the feel of the original game. While the values I&#39;ve suggested are well balanced, you&#39;re free to change them or turn this feature off entirely.\r<br />\r<br />[color=#add8e6][b]-Alternate Skill Gain[/b][/color]\r<br />SPERG adds several alternate sources of skill gain to make leveling feel more natural. For example, your Speech skill goes up when you use shouts in combat, and your amror skill goes up when you wear it while running around. Play the game, not the skill system.\r<br />\r<br />[color=#add8e6][b]-Equipment Salvaging[/b][/color]\r<br />Loot and steal to your heart&#39;s content, breaking down all kinds of items into raw components that you can use to improve your Smithing. This is a great addition if you have problems finding enough raw material to level the skill, or even if you just like stealing everything that isn&#39;t nailed down.\r<br />\r<br />[color=#add8e6][b]-Quest rewards[/b][/color]\r<br />As another fix to skill rates, this mod grants a free, semi-random skill gain every time you complete a quest. This is another aspect of SPERG that encourages you to just play the game instead of grind, and it also helps soften the disappointment when a quest reward is totally useless to you.\r<br />\r<br />[color=#add8e6][b]-Perk reset[/b][/color]\r<br />You can completely reset your perks whenever you want. By default, this applies a temporary penalty to health, magicka, and stamina to make sure it doesn&#39;t feel like cheating, but if you feel like I do that this should have been included from the beginning, you can turn the penalty off entirely. You can even turn it off after it&#39;s been applied and it will retroactively disappear&#33;\r<br />\r<br />[color=#add8e6][b]-Minimalist unarmed support[/b][/color]\r<br />Unarmed combat is made completely viable with little other changes to it. There are no monk style semi-magical abilities so as not to conflict with the existing flavor in Skyrim. Instead, unarmed characters take on the role of a bar-brawling scoundrel, which is much more fitting (especially for Nords&#33;).\r<br />\r<br />[color=#add8e6][b]-Better spell scaling[/b][/color]\r<br />All spells now scale directly with skill level. Destruction spells deal more damage, Illusion spells affect higher level targets, Restoration spells heal (or damage) more, and both Illusion and Conjuration spells last longer. At 100 skill, spells are twice as effective.\r<br />\r<br />[color=#add8e6][b]-Better staves[/b][/color]\r<br />Playing a pure mage can be rough at low levels, but now staves can really help out. While staves were already powerful, using them came at the expense of leveling your own magic skills. Now, using a staff levels your magic skills like it always should have. To add to the fun, you can even learn spells from staves of all kinds, including unique staves like Wabbajack and Skull of Corruption.\r<br />\r<br />[b][color=orange]Requirements[/color][/b]\r<br />[list][*]Skyrim version 1.9+ required.\r<br />[*][url=http://skse.silverlock.org]Skyrim Script Extender (SKSE)[/url] - Required for many functions used in SPERG, and it&#39;s also a requirement for the following two mods. Everyone who uses mods should already have this installed.\r<br />[*][url=http://skyrim.nexusmods.com/mods/3863]SkyUI 3+[/url] - Required for the in-game config menu. Alternate config methods are not supported.\r<br />[*][url=http://skyrim.nexusmods.com/mods/1175]Skyrim -Community- Uncapper[/url] - Despite the name, SPERG doesn&#39;t actually uncap your skills using this mod. Instead, it limits your perk gain to one every two levels. SPERG perks are very potent, so gaining one perk per level is quite overpowered. Of course, you can tweak the uncapper configuration any way you want. Double your perk gain, reduce it further, uncap your skills (or don&#39;t). It&#39;s up to you.\r<br />[/list]\r<br />[b][color=orange]Recommended Mods[/color][/b]\r<br />[list][*][url=http://skyrim.nexusmods.com/mods/9465]Faster Mining[/url] - Why should mining take 10 seconds? It shouldn&#39;t.\r<br />[*][url=http://skyrim.nexusmods.com/mods/33395]SkyTweak[/url] - A myriad of useful configuration options, all accessed through the in-game menu.\r<br />[/list]\r<br />[b][color=orange]SPERG Mods[/color][/b]\r<br />[list][*][url=http://skyrim.nexusmods.com/mods/34925/]Unofficial SPERG Patches[/url] - Several useful patches to fix conflicts with popular mods.\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/62628/]EFF 4.0 Patch[/url] - Updated to work for EFF 4.0+\r<br />[*][url=http://skyrim.nexusmods.com/mods/41609/]SPERG Weapon Styles[/url] - Modifies the one-handed tree to enhance multiple different combat styles.\r<br />[*][url=http://skyrim.nexusmods.com/mods/45042/]Bound Armory[/url] - Bound weapon improvements with a patch for SPERG compatibility.\r<br />[/list]\r<br />[b][color=orange]Installation Instructions[/color][/b]\r<br />[list=1][*]Install the above requirements.\r<br />[*]Install using NMM/ModOrganizer, or unzip everything into your Data directory.\r<br />[*]When installing manually, copy any optional patches along with the SKSE folder to your Data directory.\r<br />[*]Activate any new plugin files and play&#33;\r<br />[/list]\r<br />[b][color=orange]Upgrade Instructions[/color][/b]\r<br />Users upgrading from any SPERG version earlier than 4.0 will need to uninstall the old version first. This is a one-time issue that I would prefer to avoid, but because SPERG has been packaged as an .esm to make community patches easier, Skyrim recognizes it as a different mod. Make sure you follow these instructions to uninstall cleanly so you can have a smooth upgrade and enjoy all the new features without any issues.\r<br />[list=1][*]Use the in-game menu to uninstall. If you don&#39;t have a menu, type &#34;set SPEUninstall to 1&#34; in the console, save your game, then load your game.\r<br />[*]Repeat this for every character who was using the mod.\r<br />[*]Uninstall SPERG through your mod program of choice, or delete the plugin and .bsa files from your Data directory manually.\r<br />[*]Install SPERG through your mod program of choice, or extract the archive into your Data directory manually.\r<br />[*]If installing manually, copy the uncapper .ini settings and any applicable DLC patches from the SPERG directory to your Data directory.\r<br />[*]Rebuild any patches created by other mods. Patches that still reference the old (deleted) version will crash the game due to a missing master error.\r<br />[*]Activate any new plugins in your Data directory and load your game. Either start a new character or wait a moment for it to re-import your old one.\r<br />[/list]\r<br />[heading]New Perk Trees[/heading]\r<br />Of course, this description can&#39;t be complete without including the new perk trees. However, the formatting on this page is somewhat limited, so I&#39;d recommend just downloading the mod and checking out perktrees.html in the SPERGreadme folder. If you want to take a peek before downloading, though, then look below.\r<br />\r<br />[color=red][size=4][b]Warrior Skills[/b][/size][/color]\r<br />\r<br />[color=red][b]Archery[/b][/color]\r<br />An Archer is trained in the use of bows and arrows. The greater the skill, the more deadly the shot.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-1-1377890602.jpg[/img]\r<br />\r<br />[b]Automatic perks[/b]\r<br />\r<br />[list][*][i]Overdraw (Novice)[/i] - Your Archery skill increases the amount of damage you deal with bows.\r<br />[*][i]Critical Shot (Apprentice)[/i] - Your Archery skill increases your chance to critically hit with bows.\r<br />[*][i]Hunter&#39;s Discipline (Adept)[/i] - 80% chance to recover arrows from dead bodies.\r<br />[*][i]Ranger (Expert)[/i] - Able to move faster with a drawn bow.\r<br />[*][i]Quick Shot (Master)[/i] - Can draw a bow 30% faster.\r<br />[/list]\r<br />[b]Specialization perks[/b]\r<br />\r<br />[list][*][i]Ethereal Arrows[/i] - Firing a bow without any arrows equipped will fire an ethereal arrow from your magicka pool. These arrows improve slightly with perks that affect bound weapons.\r<br />[*][i]Eagle Eye[/i] - Pressing Block while aiming will zoom in your view.\r<br />[*][i]Steady Hand[/i] - Zooming in with a bow slows time by 50%.\r<br />[*][i]Knockout[/i] - Bashing with a bow briefly knocks the target out. This ability can only be used once every 15 seconds.\r<br />[*][i]Survivalist[/i] - Most wild animals are friendly until attacked. Gain use of the Hunter&#39;s Sight lesser power.\r<br />[*][i]Power Shot[/i] - Arrows stagger all but the largest opponents 50% of the time. Critical hits with all weapons deal 50% more damage.\r<br />[*][i]Hunter&#39;s Sight:[/i] - Arrows stagger all but the largest opponents 50% of the time. Critical hits with all weapons deal 50% more damage.\r<br />[*][i]Sniper[/i] - Bow attacks are guaranteed to critically hit when firing from out of combat.\r<br />[*][i]Head Shot[/i] - Critical hits with a bow have a 10% chance to deal lethal damage. All weapons are 5% more likely to critically hit.\r<br />[*][i]Knee Shot[/i] - Bow attacks have a 15% chance to cripple the target for 12 seconds. Targets without vulnerable knees will be paralyzed instead.\r<br />[/list]\r<br />[color=red][b]Block[/b][/color]\r<br />The art of blocking an enemy&#39;s blows with a shield or weapon. Blocking reduces the damage and staggering from physical attacks.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-2-1377890602.jpg[/img]\r<br />\r<br />[b]Automatic perks[/b]\r<br />\r<br />[list][*][i]Shield Wall (Novice)[/i] - Your Block skill increases the effectiveness of blocking.\r<br />[*][i]Power Bash (Apprentice)[/i] - Able to do a power bash.\r<br />[*][i]Charge&#33; (Adept)[/i] - You have a 20% chance to gain a burst of speed if an arrow hits you while you&#39;re blocking.\r<br />[*][i]Deflection (Expert)[/i] - Arrows that hit the shield do no damage.\r<br />[*][i]Hoplite (Master)[/i] - Able to move faster with a shield raised.\r<br />[/list]\r<br />[b]Specialization perks[/b]\r<br />\r<br />[list][*][i]Stalwart Defender[/i] - Stamina regenerates at its full rate even in combat.\r<br />[*][i]Survival Instinct[/i] - When your health is critical, time slows down before enemy melee attacks. This can only occur once every 30 seconds.\r<br />[*][i]Accurate Bash[/i] - Regular bashes with a shield deal ten times the damage and have a a 30% chance to disarm.\r<br />[*][i]Brutal Bash[/i] - Power bashes deal ten times the damage and have a 20% chance to daze the target.\r<br />[*][i]Retaliation[/i] - Blocking an attack has a 30% chance to trigger a 20% increase to melee damage for 4 seconds.\r<br />[*][i]Aegis[/i] - Blocking with a shield grants a 20% chance to absorb incoming magic and reduces incoming fire, frost, and shock damage by 50%.\r<br />[*][i]Quick Reflexes[/i] - Time slows down if you are blocking during an enemy&#39;s power attack.\r<br />[*][i]Defensive Stance[/i] - You take 20% less damage. Blocking staggers the attacker 20% of the time.\r<br />[*][i]Shield Charge[/i] - Sprinting with a shield raised knocks down most targets.\r<br />[/list]\r<br />[color=red][b]Heavy Armor[/b][/color]\r<br />Those trained to use Heavy Armor make more effective use of Iron, Steel, Dwarven, Orcish, Ebony, and Daedric armors. Heavy Armor wearers emphasize defense over speed.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-3-1377890603.jpg[/img]\r<br />\r<br />[b]Automatic perks[/b]\r<br />[list][*][i]Juggernaut (Novice)[/i] - Your Heavy Armor skill increases armor rating for Heavy Armor.\r<br />[*][i]Well Fitted (Apprentice)[/i] - 25% Armor bonus if wearing only Heavy Armor.\r<br />[*][i]Conditioning (Adept)[/i] - Heavy Armor weighs nothing and doesn&#39;t slow you down when worn.\r<br />[*][i]Tower of Strength (Expert)[/i] - 50% less stagger when wearing only Heavy Armor.\r<br />[*][i]Matching Set (Master)[/i] - Additional 25% Armor bonus if wearing at least three matched pieces of Heavy Armor.\r<br />[/list]\r<br />[b]Specialization perks[/b]\r<br />\r<br />[list][*][i]Fists of Steel[/i] - Heavy Armor gauntlets increase melee damage and reduce the stamina cost of power attacks. Gauntlets made of stronger materials have a greater effect (max 30%).\r<br />[*][i]Thick Padding[/i] - When you are wearing mostly heavy armor, arrow damage is reduced by half and frost resistance is increased by 20%.\r<br />[*][i]Wall of Iron[/i] - When you are wearing mostly heavy armor, enemies that strike you in melee occasionally stagger.\r<br />[*][i]Mounted Knight[/i] - When fighting on horseback you deal double damage and take half damage. When fighting on foot you take 20% less damage from melee attacks.\r<br />[*][i]Warded Plate[/i] - For each piece of heavy armor equipped, there is a 5% chance for incoming fire, frost, and shock spells to deal no damage (maximum 20% chance).\r<br />[*][i]Iron Will[/i] - Grants immunity to paralysis and the strongest Unrelenting Force shouts.\r<br />[*][i]Ignore Pain[/i] - 20% chance of ignoring all damage from a melee attack.\r<br />[/list]\r<br />[color=red][b]One Handed[/b][/color]\r<br />The art of combat using one-handed weapons, such as daggers, swords, maces and war axes. Those trained in this skill deliver deadlier critical hits.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-4-1377890603.jpg[/img]\r<br />\r<br />[b]Automatic perks[/b]\r<br />\r<br />[list][*][i]Armsman (Novice)[/i] - Your one-handed skill increases the amount of damage you deal with one-handed weapons.\r<br />[*][i]Training (Apprentice)[/i] - Power attacks with one-handed weapons cost 25% less stamina.\r<br />[*][i]Parry (Adept)[/i] - Blocking with one-handed weapons is more effective. This bonus increases based on the material of the weapon.\r<br />[*][i]Mobility (Expert)[/i] - You move 10% faster when wielding a one-handed weapon.\r<br />[*][i]Riposte (Master)[/i] - Blocking with a one-handed weapon or shield has a 20% chance to trigger a riposte, making your next attack 150% faster.\r<br />[/list]\r<br />[b]Specialization perks[/b]\r<br />\r<br />[list][*][i]Bone Breaker[/i] - Attacks with maces have a 10% chance to stagger the target. Attacks with all weapons ignore 50% of armor.\r<br />[*][i]Hack and Slash[/i] - Attacks with war axes deal 50% more critical damage. Attacks with all weapons are 5% more likely to critically hit.\r<br />[*][i]Bladesman[/i] - Attacks with one-handed swords are 30% faster. Attacks with all other weapons are 15% faster.\r<br />[*][i]Fighting Stance[/i] - All weapons swing 15% faster and critical damage is increased by 50% when wielding one or more one-handed weapons.\r<br />[*][i]Weapon Master[/i] - Melee attacks gain unique bonuses based on weapon type. These bonuses are listed with active magic effects.\r<br />[*][i]Critical Charge[/i] - Can do a one-handed power attack while sprinting that does double critical damage. One handed power attacks are 20% more likely to critically hit.\r<br />[*][i]Savage Strike[/i] - One-handed sideways power attacks may slay targets low on health and regenerate 100 points of stamina over 5 seconds if successful. One handed standing power attacks may decapitate enemies.\r<br />[*][i]Dual Savagery[/i] - Dual wielding power attacks do 25% bonus damage and dual wielding attacks are 25% faster.\r<br />[*][i]Paralyzing Flurry[/i] - For 6 seconds following a one-handed backwards power attack, all attacks paralyze their target. This can only occur once every 20 seconds.\r<br />[/list]\r<br />[color=red][b]Smithing[/b][/color]\r<br />The art of creating and improving weapons and armor from raw materials.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-5-1377890603.jpg[/img]\r<br />\r<br />[b]Automatic perks[/b]\r<br />\r<br />[list][*][i]Basic Smithing (Novice)[/i] - Can create Iron and Steel equipment at forges.\r<br />[*][i]Worldly (Apprentice)[/i] - Can create Elven and Dwarven equipment at forges.\r<br />[*][i]Advanced Smithing (Adept)[/i] - Can create Orcish equipment and Steel Plate armor at forges.\r<br />[*][i]Intense Heat (Expert)[/i] - Can create Glass and Ebony equipment at forges.\r<br />[*][i]Hammer of Oblivion (Master)[/i] - Can create Daedric equipment at forges.\r<br />[/list]\r<br />[b]Specialization perks[/b]\r<br />\r<br />[list][*][i]Prospector[/i] - Find twice the ore and gems when mining. Gain a 25% bonus to Iron and basic Steel armor.\r<br />[*][i]Light Armorer[/i] - Can improve Light Armor twice as much.\r<br />[*][i]Open Minded[/i] - Gain a 25% bonus to Elven and Dwarven armor. Enchantments you cast on Elven, Dwarven, and Orcish equipment are 15% more powerful.\r<br />[*][i]Heavy Armorer[/i] - Can improve Heavy Armor twice as much.\r<br />[*][i]Honorary Orc[/i] - Orcs consider you a friend and give you a 20% discount. Gain a 15% bonus to Iron, Steel, and Orcish armor, and a 30% bonus to Iron, Steel, and Orcish weapons.\r<br />[*][i]Arcane Blacksmith[/i] - You can improve magical weapons and armor. Fire damage enchantments you cast are 15% stronger.\r<br />[*][i]Weaponsmith[/i] - Can improve weapons and shields twice as much.\r<br />[*][i]Applied Knowledge[/i] - Fortify Smithing effects also increase weapon damage and armor rating.\r<br />[*][i]Dragon Armor[/i] - Can create Dragon armor (and weapons) at forges.\r<br />[/list]\r<br />[color=red][b]Two Handed[/b][/color]\r<br />The art of combat using two-handed weapons, such as greatswords, battle axes, and warhammers. Those trained in this skill deliver deadlier power attacks.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-1-1377890649.jpg[/img]\r<br />\r<br />[b]Automatic perks[/b]\r<br />\r<br />[list][*][i]Barbarian (Novice)[/i] - Your Two-Handed skill increases the amount of damage you deal with two-handed weapons.\r<br />[*][i]Seasoned (Apprentice)[/i] - Power attacks with two-handed weapons cost 25% less stamina.\r<br />[*][i]Tireless (Adept)[/i] - Your stamina regenerates 20% faster when wielding two-handed weapons.\r<br />[*][i]Merciless (Expert)[/i] - Normal two-handed attacks strike all targets in front of you.\r<br />[*][i]Counterattack (Master)[/i] - Blocking with a two-handed weapon has a 20% chance to trigger a counterattack, making your next attack 150% faster. If it&#39;s a power attack, it costs no stamina.\r<br />[/list]\r<br />[b]Specialization perks[/b]\r<br />\r<br />[list][*][i]Skullcrusher[/i] - Standing power attacks with warhammers have a 30% chance to daze the target. Attacks with all weapons ignore 50% of armor.\r<br />[*][i]Limbsplitter[/i] - Attacks with battleaxes deal 50% more critical damage. Power attacks with all weapons are 20% more likely to critically hit.\r<br />[*][i]Great Swings[/i] - Attacks with greatswords are 30% faster. Attacks with all other weapons are 15% faster.\r<br />[*][i]Champion&#39;s Stance[/i] - Attacks with two-handed weapons have a 10% chance to stagger the target. Power attacks with all weapons deal 20% more damage.\r<br />[*][i]Great Critical Charge[/i] - Can do a two-handed power attack while sprinting that does double critical damage. Critical hits with two-handed power attacks deal 50% more damage.\r<br />[*][i]Sweep[/i] - Sideways power attacks with two-handed weapons hit all targets in front of you. Melee damage is increased by 20% for 5 seconds after any two-handed power attack.\r<br />[*][i]Sunder Armor[/i] - Two-handed forward power attacks destroy the target&#39;s shield if blocked and have a 30% chance to destroy a piece of the target&#39;s armor if unblocked.\r<br />[*][i]Devastating Blow[/i] - Two-handed standing power attacks do 25% bonus damage with a chance to decapitate your enemies. Melee attacks with two-handed weapons deal 10% more damage.\r<br />[*][i]Warmaster[/i] - Two-handed power attacks have a 10% chance to deal lethal damage.\r<br />[/list]\r<br />[color=#65d700][size=4][b]Thief Skills[/b][/size][/color]\r<br />\r<br />[color=#65d700][b]Alchemy[/b][/color]\r<br />The art of brewing potions and poisons. A skilled Alchemist can harvest powerful ingredients, improve equipment, and transmute metals.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-2-1377890649.jpg[/img]\r<br />\r<br />[b]Automatic perks[/b]\r<br />\r<br />[list][*][i]Alchemist (Novice)[/i] - Your Alchemy skill increases the strength of the potions and poisons you make.\r<br />[*][i]Experimenter (Apprentice)[/i] - The higher your Alchemy skill, the more effects you recognize when eating an ingredient.\r<br />[*][i]Physician (Adept)[/i] - Potions that restore health, magicka, or stamina are 25% more powerful.\r<br />[*][i]Poisoner (Expert)[/i] - Poisons you mix are 25% more effective.\r<br />[*][i]Green Thumb (Master)[/i] - Two ingredients are gathered from plants.\r<br />[/list]\r<br />[b]Specialization perks[/b]\r<br />\r<br />[list][*][i]Fortifier[/i] - Clothing and body armor made of leather or fur gain armor rating based on your Alchemy skill. Potions that fortify health, magicka, or stamina are 50% more effective.\r<br />[*][i]Troll Blood[/i] - Health regenerates 50% faster. When your health is below 50%, you have a 20% chance to poison enemies in melee range every time you get hit.\r<br />[*][i]Envenom[/i] - Poisons applied to weapons last longer the higher your Alchemy skill (max 10 charges). You gain 50% resistance to all poisons.\r<br />[*][i]Side Effects[/i] - 33% chance to gain beneficial side effects when drinking potions or eating ingredients.\r<br />[*][i]Wortcraft[/i] - You suffer no negative effects from eating ingredients, and positive effects are substantially improved.\r<br />[*][i]Mage Oil[/i] - Enchantments you cast are 15% more effective on regular jewelry and 25% more effective on high quality jewelry.\r<br />[*][i]Surgeon[/i] - Find unique stat-boosting ingredients, more food, and more rare ingredients when looting corpses.\r<br />[*][i]Knowledge Seeker[/i] - Allows you to create the Philosopher&#39;s Stone, which unlocks the ability to transmute metal ingots.\r<br />[*][i]Purity[/i] - You create two potions or poisons instead of one. All negative effects are removed from created potions, and all positive effects are removed from created poisons.\r<br />[/list]\r<br />[color=#65d700][b]Light Armor[/b][/color]\r<br />Those trained to use Light Armor make more effective use of Hide, Leather, Elven, and Glass armors. Light Armor wearers emphasize speed and offense over protection.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-3-1377890649.jpg[/img]\r<br />\r<br />[b]Automatic perks[/b]\r<br />\r<br />[list][*][i]Agile Defender (Novice)[/i] - Your Light Armor skill increases armor rating for Light armor.\r<br />[*][i]Custom Fit (Apprentice)[/i] - 25% Armor bonus if wearing only Light Armor.\r<br />[*][i]Unhindered (Adept)[/i] - Light Armor weighs nothing and doesn&#39;t slow you down when worn.\r<br />[*][i]Nimble (Expert)[/i] - Falling damage is reduced by half.\r<br />[*][i]Matching Set (Master)[/i] - Additional 25% Armor bonus if wearing at least three matched pieces of Light Armor.\r<br />[/list]\r<br />[b]Specialization perks[/b]\r<br />\r<br />[list][*][i]Nomad[/i] - Horses you ride move 50% faster. Damage taken on horseback or while sprinting is reduced by 30%.\r<br />[*][i]Wind Walker[/i] - Stamina regenerates 50% faster. You have a 20% chance to avoid all damage from an attack when sprinting.\r<br />[*][i]Strategic Retreat[/i] - When an attack brings your health below 20%, you gain a burst of speed for 10 seconds. This effect can only occur once every 30 seconds.\r<br />[*][i]Insulating Wards[/i] - For each piece of light armor equipped, potions and armor spells have a 10% longer duration (maximum 40% increase).\r<br />[*][i]Berserker Rage[/i] - On being hit, you have a 5% chance to gain stamina regeneration and a 25% damage increase for 6 seconds. This chance is 100% if hit with a power attack.\r<br />[*][i]Skirmish Tactics[/i] - Perks which affect power attacks have a lesser effect on regular attacks as well.\r<br />[*][i]Soldier[/i] - Power attacks cost 30% less stamina.\r<br />[/list]\r<br />[color=#65d700][b]Lockpicking[/b][/color]\r<br />The art of opening locked doors and containers. Those trained in Lockpicking liberate valuables wherever they are found, from decadent manors to abandoned ruins.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-4-1377890649.jpg[/img]\r<br />\r<br />[b]Automatic perks[/b]\r<br />\r<br />[list][*][i]Security (Novice)[/i] - Your lockpicking skill makes locks easier to pick.\r<br />[*][i]Luck (Apprentice)[/i] - Find more gold in chests.\r<br />[*][i]Seeker (Adept)[/i] - 50% greater chance of finding special treasure.\r<br />[*][i]Locksmith (Expert)[/i] - Pick starts close to the lock opening position.\r<br />[*][i]Unbreakable (Master)[/i] - Lockpicks never break.\r<br />[/list]\r<br />[b]Specialization perks[/b]\r<br />\r<br />[list][*][i]Bash Locks[/i] - You may attempt to open locked doors and containers by bashing them.\r<br />[*][i]Inside Man[/i] - Allows access to inconspicuous chests placed outside of town jails. These are used for laundering stolen goods and paying discounted fines.\r<br />[*][i]Adventurous Parry[/i] - Blocking with a torch is twice as effective.\r<br />[*][i]Thief[/i] - Able to pick locks without being noticed. Carrying capacity is increased by 100.\r<br />[*][i]Blinding Bash[/i] - Bashing opponents with a torch gives their attacks against you a 30% chance to become a glancing blow (10% damage) for 8 seconds.\r<br />[*][i]Blazing Bash[/i] - Fire damage from your torch bash is significantly increased and may cause opponents to run in fear.\r<br />[*][i]Dungeon Delver[/i] - Chaurus, skeevers, and spiders are friendly until attacked. Gain use of the Dungeon Sense lesser power.\r<br />[*][i]Dungeon Sense:[/i] - Dwemer Automatons are friendly until attacked. Grants 30% shock resistance and increases the variety of dwemer scrap metal that may be melted into ingots.\r<br />[/list]\r<br />[color=#65d700][b]Pickpocket[/b][/color]\r<br />The art of thievery by stealthy or more forceful means. Skilled Pickpockets are less likely to be detected when picking pockets and more capable of defending themselves if caught.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-5-1377890649.jpg[/img]\r<br />\r<br />[b]Automatic perks[/b]\r<br />\r<br />[list][*][i]Light Fingers (Novice)[/i] - Your Pickpocket skill increases unarmed damage and your chances of successfully picking someone&#39;s pockets.\r<br />[*][i]Night Thief (Apprentice)[/i] - +25% chance to pickpocket if the target is asleep.\r<br />[*][i]Cutpurse (Adept)[/i] - Pickpocketing gold is 50% easier.\r<br />[*][i]Keymaster (Expert)[/i] - Pickpocketing keys almost always works.\r<br />[*][i]Misdirection (Master)[/i] - Can pickpocket equipped items.\r<br />[/list]\r<br />[b]Specialization perks[/b]\r<br />\r<br />[list][*][i]Extra Pockets[/i] - Carrying capacity is increased by 100 and stamina is increased by 50.\r<br />[*][i]Toxic Touch[/i] - Silently harm enemies by placing poisons in their pockets.\r<br />[*][i]Dodge[/i] - When not wearing any armor, you have a chance to take no damage from incoming attacks. This chance increases with your pickpocket skill (max 25%).\r<br />[*][i]Brigand&#39;s Brew[/i] - Consuming alcohol increases your melee damage by 30% for 15 seconds.\r<br />[*][i]Purse Snatcher[/i] - Increases run speed by 30%.\r<br />[*][i]Acid Splash[/i] - As long as one hand is free, melee attacks deal 50% more critical damage and have a 20% chance to deal extra poison damage over 3 seconds.\r<br />[*][i]Drunken Rage[/i] - Consuming alcohol has a chance of sending you into a drunken rage, increasing melee damage and reducing damage taken by 50% each. This chance increases the more you drink.\r<br />[*][i]Blade Catcher[/i] - As long as one hand is free (unarmed or spell), melee attacks deal 20% more damage and you have a 10% chance to disarm attackers that strike you in melee.\r<br />[*][i]Cheap Shot[/i] - As long as one hand is free, power attacks have a 25% chance to cripple the target. Unarmed attacks have a 5% higher chance to critically hit.\r<br />[/list]\r<br />[color=#65d700][b]Sneak[/b][/color]\r<br />Sneaking is the art of moving unseen and unheard. Highly skilled sneaks can even hide in plain sight.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-1-1377890690.jpg[/img]\r<br />\r<br />[b]Automatic perks[/b]\r<br />\r<br />[list][*][i]Stealth (Novice)[/i] - Your sneak skill makes you harder to detect while sneaking.\r<br />[*][i]Muffle (Apprentice)[/i] - Noise from armor is reduced 50%.\r<br />[*][i]Silence (Adept)[/i] - Walking and running does not affect detection.\r<br />[*][i]Silent Roll (Expert)[/i] - Sprinting while sneaking executes a silent forward roll.\r<br />[*][i]Assassin&#39;s Blade (Master)[/i] - Attacks with daggers deal 25% more damage and ignore armor.\r<br />[/list]\r<br />[b]Specialization perks[/b]\r<br />\r<br />[list][*][i]Sneak Attack[/i] - Sneak attacks deal 3x damage with bows, 6x with 1H weapons, 8x when unarmed, and 15x with daggers. Instant kills with 2H sneak attacks may cause nearby enemies to run in fear.\r<br />[*][i]Keen Eye[/i] - Dagger attacks made from out of combat are guaranteed to critically hit.\r<br />[*][i]Cloak of Shadows[/i] - You have a chance to take no damage from incoming attacks. This chance increases with your sneak skill (max 10%).\r<br />[*][i]Light Foot[/i] - You won&#39;t trigger pressure plates and you&#39;re 20% less likely to stagger when struck.\r<br />[*][i]Heart Seeker[/i] - Sneak attacks have a 10% chance to deal lethal damage.\r<br />[*][i]Assassin&#39;s Reflexes[/i] - Grants the Assassin&#39;s Reflexes lesser power, which slows time in exchange for stamina.\r<br />[*][i]Shadow Warrior[/i] - Crouching in combat renders you invisible for two seconds. This can only occur once every ten seconds.\r<br />[/list]\r<br />[color=#65d700][b]Speech[/b][/color]\r<br />This skill of persuasion can be used to get better prices from merchants, and persuade others to do as you ask. Skilled speakers can even use their voice as a weapon.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-2-1377890690.jpg[/img]\r<br />\r<br />[b]Automatic perks[/b]\r<br />\r<br />[list][*][i]Haggling (Novice)[/i] - Your Speech skill improves buying and selling prices.\r<br />[*][i]Merchant (Apprentice)[/i] - Can sell any type of item to any kind of merchant.\r<br />[*][i]Investor (Adept)[/i] - Can invest 500 gold with a shopkeeper to increase his available gold permanently.\r<br />[*][i]Fence (Expert)[/i] - Can barter stolen goods with any merchant you have invested in.\r<br />[*][i]Trader (Master)[/i] - Every merchant in the world gains 1000 gold for bartering.\r<br />[/list]\r<br />[b]Specialization perks[/b]\r<br />\r<br />[list][*][i]Convincing[/i] - Can bribe guards to ignore crimes. Persuasion attempts are 30% easier and intimidation is twice as likely to succeed.\r<br />[*][i]Good Listener[/i] - Your skills increase 5% faster, and you can train substantially more per level.\r<br />[*][i]Long Winded[/i] - Sprinting consumes very little stamina, and power attacks cost 10% less stamina.\r<br />[*][i]Best Friend[/i] - A loyal animal companion carries your extra equipment and fights by your side.\r<br />[*][i]Allure[/i] - 30% better prices with the opposite sex. Also gain the &#34;Lover&#39;s Comfort&#34; buff.\r<br />[*][i]Trained Voice[/i] - Shouts are 50% more powerful and last 30% longer.\r<br />[*][i]Master Debater[/i] - You gain 50 magicka, and your shouts prevent nearby enemies from shouting for a short time.\r<br />[*][i]Patron[/i] - Alchemy shops and court wizards you invest in will stock unique and expensive potions and scrolls.\r<br />[*][i]Legendary Skald[/i] - Time between shouts is reduced by 50%.\r<br />[/list]\r<br />[color=#3bb9ff][size=4][b]Mage Skills[/b][/size][/color]\r<br />\r<br />[color=#3bb9ff][b]Alteration[/b][/color]\r<br />The School of Alteration involves manipulating the physical and magical worlds. This skill enhances other schools and makes it easier to cast spells like Waterbreathing, protection, and Paralysis.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-3-1377890691.jpg[/img]\r<br />\r<br />[b]Automatic perks[/b]\r<br />\r<br />[list][*][i]Mystic (Novice)[/i] - Your Alteration skill increases the duration of your Alteration spells.\r<br />[*][i]Sage (Apprentice)[/i] - Cast Alteration spells for half magicka.\r<br />[*][i]Adaptation (Adept)[/i] - You gain the ability to breathe underwater. Most waterbreathing potions, spells, and enchantments give you the ability to walk on water instead.\r<br />[*][i]Seer (Expert)[/i] - New spell tomes may be found on appropriate merchants.\r<br />[*][i]Theurgist (Master)[/i] - Once every hour, you&#39;re able to cast a ritual spell near instantly for very little magicka.\r<br />[/list]\r<br />[b]Specialization perks[/b]\r<br />\r<br />[list][*][i]Ancestral Awakening[/i] - Your passive racial abilities are twice as strong, and you receive a second, awakened version of your racial power that can be used every 6 hours.\r<br />[*][i]Spell Charge[/i] - Single cast spells are 15% more effective for each second spent casting them (max 45% increase).\r<br />[*][i]Mage Armor[/i] - Magic armor spells never need to be re-cast. When not wearing armor, they are four times as strong and level Alteration as if it were an armor skill.\r<br />[*][i]Efficiency Expert[/i] - Your magic skills increase the duration of spells in each school by up to double. Each rank in a school reduces the cost of spells in that school by 10%.\r<br />[*][i]Mystic Transmutation[/i] - Allows you to forge an Arcane Converter, which can convert magicka into soul energy for powering enchantments. Higher skill levels allow the creation of more potent converters.\r<br />[*][i]Magic Resistance[/i] - Blocks 30% of a spell&#39;s effects.\r<br />[*][i]Spirit Echo[/i] - 10% chance of summoning a Spirit Echo in combat, which drains health, magicka, and stamina from enemies and returns it to you.\r<br />[*][i]Chain Casting[/i] - Destruction spells charge with each spell cast. At max charge, dual casting a spell allows you to cast double damage spells at no magicka cost for 5 seconds, but afterwards the charge will reset.\r<br />[*][i]Atronach[/i] - Absorb 30% of the magicka of any spells that hit you.\r<br />[/list]\r<br />[color=#3bb9ff][b]Conjuration[/b][/color]\r<br />The School of Conjuration governs raising the dead and summoning creations from Oblivion. This skill makes it easier to cast these spells as well as Soul Trap and bindings. \r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-4-1377890691.jpg[/img]\r<br />\r<br />[b]Automatic perks[/b]\r<br />\r<br />[list][*][i]Conjurer (Novice)[/i] - Your Conjuration skill increases the duration of your Conjuration spells.\r<br />[*][i]Covenant (Apprentice)[/i] - Cast Conjuration spells for half magicka.\r<br />[*][i]Warlock (Adept)[/i] - Bound weapons drain magicka on hit.\r<br />[*][i]Occult Lore (Expert)[/i] - New spell tomes may be found on appropriate merchants.\r<br />[*][i]Soul Reaper (Master)[/i] - You can fill two soul gems with the same soul as long as the soul is the appropriate size.\r<br />[/list]\r<br />[b]Specialization perks[/b]\r<br />\r<br />[list][*][i]Summoner[/i] - Doubles the range of all summon spells and the duration of all conjuration spells. You gain 50 health, and friendly summoned creatures gain 20% damage resistance when near you.\r<br />[*][i]Spirit Binding[/i] - Bound weapons do more damage and cast Soul Trap on targets.\r<br />[*][i]Dark Souls[/i] - Reanimated undead have 100 points more health and leech health from nearby enemies.\r<br />[*][i]Elemental Potency[/i] - Conjured Atronachs are significantly more powerful, and you gain 25% resistance to all elements.\r<br />[*][i]Mystic Binding[/i] - Bound weapons do more damage, banish summoned creatures, and turn raised ones.\r<br />[*][i]Plague Carrier[/i] - Can reanimate higher level undead. Reanimated undead spread a contagious disease that slows movement, drains health and stamina, and increases damage taken by 30%.\r<br />[*][i]Oblivion Binding[/i] - Bound weapons do more damage and gain elemental enchantments.\r<br />[*][i]Elemental Mastery[/i] - Conjured Atronachs gain new abilities and give you a 30% increase to elemental damage when summoned.\r<br />[*][i]Twin Souls[/i] - You can have two atronachs or reanimated zombies. Every six hours, you may summon three atronachs at once or reanimate all corpses around you.\r<br />[/list]\r<br />[color=#3bb9ff][b]Destruction[/b][/color]\r<br />The School of Destruction involves the harnessing the energies of fire, frost and shock. This skill makes it easier to cast spells like Fireball, Ice Spike, and Lightning Bolt.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-5-1377890691.jpg[/img]\r<br />\r<br />[b]Automatic Perks[/b]\r<br />\r<br />[list][*][i]Evoker (Novice)[/i] - Your Destruction skill increases the magnitude of your Destruction spells.\r<br />[*][i]Mage (Apprentice)[/i] - Cast Destruction spells for half magicka.\r<br />[*][i]Dedication (Adept)[/i] - Fire spells deal more health damage, Frost spells deal more stamina damage, and Shock spells deal more magicka damage.\r<br />[*][i]Archmage (Expert)[/i] - New spell tomes may be found on appropriate merchants.\r<br />[*][i]Feedback (Master)[/i] - When you have a Destruction spell readied, enemies that strike you in melee take elemental damage.\r<br />[/list]\r<br />[b]Specialization Perks[/b]\r<br />\r<br />[list][*][i]Dual Casting[/i] - Enables dual casting for all spell schools. Dual casting a spell overcharges the effects into an even more powerful version.\r<br />[*][i]Flame Affinity[/i] - Weapon attacks have a 20% chance to make targets take triple damage from fire for 4 seconds. Smithing improvements are 20% more effective.\r<br />[*][i]Intense Flames[/i] - Fire damage causes targets below 30% health to flee. 20% chance when casting a fire spell to instantly cast it a second time for no magicka.\r<br />[*][i]Impact[/i] - Most destruction spells have a chance to stagger opponents when dual cast. This chance increases when you are low on magicka.\r<br />[*][i]Frost Aura[/i] - Increases armor rating and frost resistance by 20%. Nearby enemies suffer 75% weakness to frost and 20% reduced movement speed.\r<br />[*][i]Rune Master[/i] - Can place two runes at once at triple the range. Runes are significantly more powerful, but take ten seconds to charge to full power. This timer resets each time you cast a new rune.\r<br />[*][i]Flowing Current[/i] - Shock spells deal 50% more damage. All spells cost 20% less to cast.\r<br />[*][i]Deep Freeze[/i] - Frost damage paralyzes targets below 20% health. 20% chance when casting a frost spell to instantly cast it a second time for no magicka.\r<br />[*][i]Disintegrate[/i] - Shock damage disintegrates targets below 10% health. 20% chance when casting a shock spell to instantly cast it a second time for no magicka.\r<br />[/list]\r<br />[color=#3bb9ff][b]Enchanting[/b][/color]\r<br />The art of binding magic to weapons and armor. Skilled enchanters harness enchanted items more effectively and can even manipulate powerful artifacts.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-1-1377890752.jpg[/img]\r<br />\r<br />[b]Automatic Perks[/b]\r<br />\r<br />[list][*][i]Enchanter (Novice)[/i] - Your Enchanting skill increases the strength of enchantments you cast.\r<br />[*][i]Siphon (Apprentice)[/i] - Death blows to creatures, but not people, trap 5% of the victim&#39;s soul, recharging the weapon.\r<br />[*][i]Economy (Adept)[/i] - Soul gems provide extra magicka for recharging.\r<br />[*][i]Wisdom (Expert)[/i] - Health, magicka, and stamina enchantments on armor are 25% stronger.\r<br />[*][i]Sagacity (Master)[/i] - Skill enchantments on armor are 25% stronger.\r<br />[/list]\r<br />[b]Specialization Perks[/b]\r<br />\r<br />[list][*][i]Magic Dust[/i] - Doubles the duration of all potions. Potions which fortify a crafting skill last ten times as long.\r<br />[*][i]Intensity[/i] - Elemental enchantments on weapons and armor are 25% stronger.\r<br />[*][i]Imbue Potion[/i] - Potions and poisons are 50% more effective.\r<br />[*][i]Artificer[/i] - Artifacts consume no charge, and all other weapons consume 50% less charge. You can learn the spells of unique staves by using them.\r<br />[*][i]Enchanted Weave[/i] - Enchantments are 25% more effective on clothing.\r<br />[*][i]Glittering Prizes[/i] - Weapon enchantments deal 20% more damage. You can craft unique items and modify artifacts at an enchanter.\r<br />[*][i]Soul Scavenger[/i] - Souls you trap are one size larger than normal.\r<br />[*][i]Preserver[/i] - Soul gems have a 50% chance to remain after use. Soul gems that remain have a 50% chance to retain the soul being used.\r<br />[*][i]Extra Effect[/i] - Can put two enchantments on the same item.\r<br />[/list]\r<br />[color=#3bb9ff][b]Illusion[/b][/color]\r<br />The School of Illusion involves manipulating the mind of the enemy and creating illusory puppets. This skill makes it easier to cast spells like Fear, Calm and Invisibility.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-2-1377890752.jpg[/img]\r<br />\r<br />[b]Automatic Perks[/b]\r<br />\r<br />[list][*][i]Illusionist (Novice)[/i] - Your Illusion skill increases the magnitude of your Illusion spells.\r<br />[*][i]Discipline (Apprentice)[/i] - Cast Illusion spells for half magicka.\r<br />[*][i]Longevity (Adept)[/i] - Your Illusion skill increases the duration of your Illusion spells.\r<br />[*][i]Thaumaturge (Expert)[/i] - New spell tomes may be found on appropriate merchants.\r<br />[*][i]Chameleon (Master)[/i] - Your companions turn invisible whenever you do.\r<br />[/list]\r<br />[b]Specialization Perks[/b]\r<br />\r<br />[list][*][i]Quiet Casting[/i] - All spells you cast from any school of magic are silent to others.\r<br />[*][i]Rallying Presence[/i] - Nearby allies have 50 more health, take 20% less damage, and regenerate 6 health per second. Does not work on undead, daedra or automatons.\r<br />[*][i]Phantom Beast[/i] - Phantom creatures fight at your side during combat, occasionally casting fear on their targets. If the beast dies, it will not return for 3 hours.\r<br />[*][i]Calming Presence[/i] - Giants, mammoths, ice wraiths, and trolls are friendly until attacked. Gain use of the Tranquility lesser power.\r<br />[*][i]Spectral Warrior[/i] - 5% chance to enter Spectral Form for 8 seconds when hit. In this form, you take no damage, deal 50% more damage, and illusion spells cost no magicka.\r<br />[*][i]Spectral Warding[/i] - For every 70 points of armor rating gained from worn armor, you also gain 5% magic resistance (max 40%).\r<br />[*][i]Tranquility:[/i] - Invisibility effects last twice as long. While invisible, your movement is silent, and attacks and spells pass through you.\r<br />[*][i]Master of the Mind[/i] - Illusion spells and Rallying Presence work on undead, daedra and automatons.\r<br />[*][i]Phantom Armory[/i] - Invulnerable phantom weapons will aid you during combat.\r<br />[/list]\r<br />[color=#3bb9ff][b]Restoration[/b][/color]\r<br />The School of Restoration involves control over life forces. This skill makes it easier to cast spells like Healing, Turn Undead, and magical Wards.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/24445-3-1377890752.jpg[/img]\r<br />\r<br />[b]Automatic Perks[/b]\r<br />\r<br />[list][*][i]Healer (Novice)[/i] - Your restoration skill increases the magnitude of your restoration spells.\r<br />[*][i]Conviction (Apprentice)[/i] - Cast Restoration spells for half magicka.\r<br />[*][i]Respite (Adept)[/i] - Healing spells also restore Stamina.\r<br />[*][i]Scholar (Expert)[/i] - New spell tomes may be found on appropriate merchants.\r<br />[*][i]Paladin (Master)[/i] - You take 30% less damage from undead and deal 30% more damage to them.\r<br />[/list]\r<br />[b]Specialization Perks[/b]\r<br />\r<br />[list][*][i]Resolve[/i] - Magicka regenerates 50% faster. Your restoration skill increases the duration of your restoration spells.\r<br />[*][i]Ward Absorb[/i] - Wards recharge your magicka when hit with spells. Melee attackers that strike your ward have a 30% chance to be staggered.\r<br />[*][i]Concentration[/i] - Magicka regenerates at its full rate even in combat.\r<br />[*][i]Necromage[/i] - Spells cast on undead are 25% more powerful and last 50% longer.\r<br />[*][i]Guardian[/i] - Nearby allies regenerate 6 health per second in combat. Time slows when their health drops below 10%. This can only occur once every 30 seconds.\r<br />[*][i]Exorcist[/i] - Your turn undead spells instantly kill low level undead.\r<br />[*][i]Succor[/i] - When hit, you have a 2% chance to instantly heal yourself. Once a day, when your health drops below 10% you heal 500 health instantly.\r<br />[*][i]Faith[/i] - When you cast a healing spell on yourself, half of the health restored above your maximum is converted to temporary health.\r<br />[*][i]Temperance[/i] - Whenever you gain temporary health from Faith, you gain an equivalent amount of stamina for 60 seconds.[/list]",
  "categoryId": "24",
  "version": "4.0",
  "author": "seorin",
  "createdUnix": "1348257087",
  "updatedUnix": "1377891711",
  "containsAdultContent": false,
  "uploadedBy": "seorin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "101996",
      "name": "SPERG 3-0",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1235",
      "fileName": "SPERG v3-24445-3-0.7z",
      "uploadedUnix": "1354064001",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/6561d99e8a0a4d756bff30f51af50027dc585f533a2a1e8f934f4771c41cbe74/analysis/1407281164/",
      "changelogHtml": " Way, way, way too many to list. Please see the readme file for a complete list. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPERG%20v3-24445-3-0.7z?fid=101996&ttl=1535795388&ri=8192&rs=8192&setec=4dc53b0324784a3292c8e0228f9f9759"
    },
    {
      "fileId": "101997",
      "name": "SPERG 2",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1160",
      "fileName": "SPERG 2-24445-2-5.7z",
      "uploadedUnix": "1354064163",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/c419e7644aab4bc8e04a1cb7f698d4365dc46e91e8bcbd2ad898602d58c6fcae/analysis/1407281168/",
      "changelogHtml": " -Stability should no longer affect spells it obviously shouldn\\'t (i.e. Voice of the Sky). There are probably still a few exceptions, though, and I eagerly await finding out what they are. <br/> \n -The description for the Ethereal Arrows script in the source code now says what the spell actually does. <br/> \n -New feature: perk reset. More information can be found in the description section. <br/> \n -New Archery perk, Knockout: Bashing with a bow briefly knocks the target out. This ability can only be used once every 15 seconds. <br/> \n -By popular request, you can now turn off automatic perk gain. See the description section for details. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPERG%202-24445-2-5.7z?fid=101997&ttl=1535795388&ri=8192&rs=8192&setec=0e05b18f0bfb52c918d223f0979a2629"
    },
    {
      "fileId": "1000028493",
      "name": "SPERG 3-1-1",
      "version": "3.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1287",
      "fileName": "SPERG 3-1-1-24445-3-1-1.7z",
      "uploadedUnix": "1367873671",
      "modVersion": "3.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5bbb95e41a8e4f7e650832fb80687f58e32386f87dd25086c1ab811ddcf34799/analysis/1407558185/",
      "changelogHtml": " -Paralyzing Flurry no longer has prerequisites that cannot be met.\r<br />-NPCs now benefit from the original version of Savage Strike.\r<br />-Due to redundancy, Master Trader no longer has a (Msater) tag on it.\r<br />-The install script should no longer copy duplicate or unnecessary files.\r<br />-Ethereal Arrows has been polished to hopefully get rid of a very rare bug which caused it to stop working.\r<br />-Added a new advanced menu option that lets you modify your perk points. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPERG%203-1-1-24445-3-1-1.7z?fid=1000028493&ttl=1535795388&ri=8192&rs=8192&setec=f6f3c34596d8217694cc5c7aeb87c637"
    },
    {
      "fileId": "1000050869",
      "name": "SPERG 4 0",
      "version": "4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2547",
      "fileName": "SPERG 4 0-24445-4-0.7z",
      "uploadedUnix": "1377891711",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/b59b6d4ce8d0074188d13d6d8c48238039e18c4fa1b3a5e0d9b22a2611dadb08/analysis/1407702599/",
      "changelogHtml": " This is not an exhaustive list of changes. I&#39;ve tried to be specific when possible, but nearly every aspect of SPERG has been rewritten and improved for this version. It&#39;s practically a new mod.\r<br />\r<br />Fixes & Tweaks:\r<br />-Nearly everything has been rewritten, improved, fixed, and optimized. Almost every script in the mod is affected. Overall performance should be better and bugs should be fewer. The most major changes were made to the config menu, autoperks, version upgrades, character imports, and perks which trigger off an enemy attack.\r<br />-Unarmed damage now benefits from fortify pickpocket effects.\r<br />-Most junk items now melt into ore instead of ingots. This allows the conversion rate to be reduced slightly while still allowing players to get rid of most of the junk in their inventory instead of having a stack of 3+ items stuck waiting for just one more.\r<br />-By popular request, I implemented a fix to the Impact perk so it no longer works 100% of the time. This is an option that can be turned off.\r<br />-You can no longer salvage most equipped items. Left-handed items and shields may still be melted due to a bug in Skyrim. If the bug is ever fixed, they will start working properly.\r<br />-Edits to bound weapon spells have been removed. Instead, they function much like the Mage Armor perk, with players receiving unique SPERG versions instead. This will allow you to use spells from another magic mod instead.\r<br />\r<br />Misc:\r<br />-You can now gain experience for your Speech skill by shouting (in combat only).\r<br />-You can now gain experience for your armor skill just by wearing armor and running around.\r<br />-You can now gain experience for your Alchemy skill just by drinking potions and eating ingredients.\r<br />-You can now gain experience towards permanent stat gains (or Alchemy, if you choose) by eating food.\r<br />-Non-metal items can now be broken down into leather or wood at a tanning rack.\r<br />\r<br />Menu:\r<br />-Many, many new config options have been added. Not all of them are listed here.\r<br />-Phantom summons and Ethereal Arrows have been given a &#39;manual&#39; option in the menu, with bindable keys to control their activation.\r<br />-The Auto Perk, Refund Auto Perks, Perk Reset Penalty, and Reset Auto Perks options in the config menu have been moved from the General page to the Perk Settings page.\r<br />-Unarmed Mode can now be set to \"Hotkey\" or \"Manual\" modes, which allow you to see a Fist weapon in your inventory to check damage and assign hotkeys.\r<br />-\"Ethereal Arrows Required\" has been moved to the Advanced options page.\r<br />-A menu option has been added to allow you to use vanilla versions of bound weapon spells.\r<br />-Hardcore Mode has been added to Advanced options.\r<br />\r<br />Perks:\r<br />-A significant number of edits to vanilla perks have been removed, and the SPERG versions of those perks are now completely separate. This minimizes mod conflicts and prevents unintended interactions between several perks and NPCs. However, some mods which depend on vanilla perks may stop working without a compatibility patch.\r<br />-The entire autoperk system has been completely reimagined. The first autoperk has no minimum skill requirement and simply enables (or improves) skill-based scaling. Later autoperks are earned at 25, 50, 75, and 100 skill, and each one offers helpful new bonuses or abilities.\r<br />-Nearly every perk tree has been changed in some way. Please refer to perktrees.html for a detailed look at all of the trees as they are now.\r<br />-Recipes from Knowledge Seeker no longer use the smelter. They use the Alchemy Lab instead.\r<br />-Blazing Bash no longer has a 100% chance to reduce incoming damage. It is 30% just like Blinding Bash.\r<br />-Dual Savagery has been slightly reduced in power to bring dual wielding closer in overall damage to other attack styles.\r<br />-The Recovery perk now has an appropriate description on the Active Magic Effects tab.\r<br />-Ward spells now summon a physical shield that creates a ward when blocking. This feature can be turned off. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPERG%204%200-24445-4-0.7z?fid=1000050869&ttl=1535795389&ri=8192&rs=8192&setec=4675e29a5e6cf5a67d94a3674a4c32bf"
    }
  ]
}