{
  "modId": 24451.0,
  "modName": "Uguz - A Dwemer Estate near Markarth",
  "summary": "Uguz, a \\'modest\\' \\'Deep Garden\\' style estate outside Markarth, painstakingly restored to it\\'s original Dwemer architecture and furniture...",
  "descriptionHtml": "[IMG]http://i.imgur.com/am2I2.png[/IMG]\r\n\r\nThis [size=+1][color=#5ea2e5][b]\\'Deep Garden\\'[/b][/color][/size] style estate, called [size=+1][color=#5ea2e5][b]Uguz[/b][/size][/color], was built ca. 465 1E. It has been lovingly restored by its inhabitants to it\\'s original condition, using exclusively items and materials of Dwemer origin. The books, crafting apparatus, and various alcohols are seemingly the only indications of the current era. [u][b]Now with optional follower compatability![/b][/u]\r\n\r\n[IMG]http://i.imgur.com/QdfXL.jpg[/IMG]\r\n\r\nA unimposing entrance belies the contents within. Inside the door, up the simple but long staircase, there is a small display hall, with displays of Falmer embalmed after their transformation, specimens from Blackreach, and young samples from the garden within, being constantly maintained by an automaton. Naturally occurring waters flowing through the mountain were harnessed to create the water features inside the estate.\r\n\r\nShort Version:\r\n\r\n[center][youtube]vCIKcExnnd4[/youtube][/center]\r\n\r\nLong Version (same as short version, but shows the crafting facilities):\r\n\r\n[center][youtube]yAkOA_NHUiM[/youtube][/center]\r\n\r\nThe inhabitants [u]call[/u] themselves \\'Dwemer\\', however they are actually Dunmer from a house faction that had split from the Chimer when the Dwemer and the Chimer split over their philosophical / religious differences. They now blindly study what remains of the Dwemeri, preserving and restoring what structures that they can, and here pay homage not only to this estate\\'s throne, but also to the idols within. Within this group are four merchants and three trainers, plus the silent guards.\r\n\r\n[IMG]http://i.imgur.com/i7FUd.jpg[/IMG]\r\n\r\nTo the right in the first hall are [u]the metalworking facilities[/u] with [b]a smelter, forge, workbench, and grindstone[/b]. To the left are [u]the domestic facilities[/u], with [b]a kitchen and food storage area, tanning rack, alchemy table, and an enchanting table[/b] that seems to be connected to [color=#5ea2e5]Aetherium[/color] itself, if the tool left behind, and the silently glowing wall, are any indication.\r\n\r\n[IMG]http://i.imgur.com/KuUxR.jpg[/IMG]\r\n\r\nIn the center of all the halls is the well-guarded throne, to which regular supplications are given. To the right is the \\'[color=#5ea2e5][b]Deep Garden[/b][/color]\\', maintained by a gardener and an attendant automaton, an amazing feat made possible by the energies given off by the suspended \\'suns\\', the estate\\'s underlying waterworks, and perhaps by the energies of the dormant spriggan Matrons.\r\n\r\n[IMG]http://i.imgur.com/cRcaL.jpg[/IMG] \r\n\r\nBehind the throne is the library / shrine, where one can meditate and store knowledge and items (there are 8 bookshelves that hold 18 books each, plus 8 coffers to store anything). An example of Dwemer \\'cruelty\\' is evident in the captured Wisp Mothers, forced to gaze upon the idol that Snow Elves, as they were being fooled by the Dwemer, had once built within. Their presence also lends weight to the theory that Wisp Mothers are actually a form of Snow Elf. On either side of the idol are found arcane spheres, which are now able to teleport one to important Dwemer ruins across Skyrim, and which may have been at one time a means for the Dwemer to communicate between themselves.\r\n\r\n[IMG]http://i.imgur.com/zrtHa.jpg[/IMG]\r\n\r\nFinally to the left of the throne is to be found the quarter hall, with plenty of beds for staff, and a grand Master Bed that overlooks the waterfall in that wing. It is guarded by some form of massive constructs. They do not move from their position, and like the guards do not communicate, but are aware nonetheless, always vigilant. To the right side of the quarters can be found the conference / war room with a small shrine to technology, and to the left is to be found the \\'pool\\', the area where the mechanics of the dwelling\\'s operations can be found. An essential part of the garden is the water that circulates throughout the estate, and there in the cloudy shallows it is renewed over and over again.\r\n\r\nThis makes a great Tamriel base for my other mod: [color=#5ea2e5][size=+1][url=http://skyrim.nexusmods.com/mods/28816]Aghemmor-Nakh - Architecture in Aetherius[/url][/size][/color]\r\n\r\nIf it weren\\'t for the following texture mod this would never have been built (I cannot imagine playing Skyrim without them):\r\n[color=#5ea2e5][size=+1][url=http://skyrim.nexusmods.com/downloads/file.php?id=5827] More Dwemered Textures -the Markarth and Dwemer ruins-HD by anonykitty [/url][/size][/color]\r\n\r\nTo acheive the \\'Golden Halls\\' look that is displayed (I used only the standard resolution textures), you must download them from above and install them. If anyone would be so kind as to post \\'Vanilla\\' Dwemer textures images from in the estate, I would be very grateful, as I just can\\'t force myself to uninstall the texture mod...\r\n\r\nNotes: \r\n[list]\r\n[*] The chests and satchels in the crafting areas reset, be warned. I am going to work on that. HOWEVER, the barrels in the kitchen and the coffins in the library [u]do not[/u].\r\n[*]The gardener is a sticky bugger, sometimes refusing to work.\r\n[*]One of the Dwemer Lords will often just be standing at his throne until you approach him, at which point he will go and sit at the conference round.\r\n[*][s]The lack of navmesh for companions is by design, as I didn\\'t want my -three- followers to be trashing the place as they followed me around. Followers will always be waiting at the end of the bridge for you when you exit the estate.[/s]\r\n[*]No known conflicts (yet...)\r\n\r\n\r\nSide Note: [u]I need someone to verify if when they leave Markarth through the gates and descend down the hill towards Uguz, which is past the mining camp and the farm, and let me know if they have problems with the outside disappearing. [b]ANY suggestions would be welcome.[/b] \\'Use Full LOD\\' is of course checked on all exterior objects, it seems to be just the strusture that disappears. Thank You in advance. Fast travel nor road travel to there seem to be no problem, however[/u]...\r\n\r\n\r\nTo Do:\r\n\r\n\r\n[*]Fix the chests\r\n[*]Optimize the estate\\'s rooms\r\n[*]Create a set of buttons to toggle lighting\r\n[*]Create a set of buttons for starting/stopping music soundtrack\r\n[*]Finish the rest of the teleport stones, if there are no objections\r\n[*]Further refine the lore behind the estate\r\n[/list]\r\n\r\nTo install, just drop the two files into your Data directory and check the mod in the launcher...\r\nTo uninstall, do the opposite of above.\r\n\r\n[b]Cheers.[/b]",
  "categoryId": "68",
  "version": "1.01f",
  "author": "minimonster",
  "createdUnix": "1348270040",
  "updatedUnix": "1356904482",
  "containsAdultContent": false,
  "uploadedBy": "minimonster",
  "primaryFile": null,
  "files": [
    {
      "fileId": "89767",
      "name": "Uguz",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "596",
      "fileName": "Uguz-24451-1-0.zip",
      "uploadedUnix": "1348270132",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6bdebbfa4f063ff29869c7f4284f1a21926353bf3ebcc91b7e751839eec71e18/analysis/1407180184/",
      "changelogHtml": " Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Uguz-24451-1-0.zip?fid=89767&ttl=1535795397&ri=8192&rs=8192&setec=50b66dc1ece70b2e773b6e8831955d4b"
    },
    {
      "fileId": "105078",
      "name": "Uguz Update One",
      "version": "1.01",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6714",
      "fileName": "Uguz Update One-24451-1-01.zip",
      "uploadedUnix": "1355461418",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/7dda5b819a4464201237c45a7a803dc78538bce0771aab4c95a2fee530449b34/analysis/1407303670/",
      "changelogHtml": " Added missing book texstures to .bsa <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Uguz%20Update%20One-24451-1-01.zip?fid=105078&ttl=1535795397&ri=8192&rs=8192&setec=fb438721ef5c60718bded36168ffb2b8"
    },
    {
      "fileId": "108548",
      "name": "Uguz For Followers",
      "version": "1.01f",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6717",
      "fileName": "Uguz For Followers-24451-1-01f.zip",
      "uploadedUnix": "1356904482",
      "modVersion": "1.01f",
      "virusScanUrl": "https://www.virustotal.com/file/5f4f08fb96a965a9498143ea50618530d3b39bbd35fc5bb60f91b14d6c847dcd/analysis/1407329601/",
      "changelogHtml": " Added follower compatibility <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Uguz%20For%20Followers-24451-1-01f.zip?fid=108548&ttl=1535795397&ri=8192&rs=8192&setec=28308351db6d7a64f3ee26bb57ac7146"
    }
  ]
}