{
  "modId": 24466.0,
  "modName": "Frostfall - French - GrandFroid - Francais",
  "summary": "GrandFroid est l\\'adaptation francaise de Frostfall.\r\nGrandFroid ajoute une grande Immersion a Skyrim, de style Survie.\r\nPour survivre a Skyrim, il va falloir prendre en compte son climat \r\nFinies les traversees d\\'eaux glacees en slip. Il faudra etre bien equipe pour affronter les vents rageurs, les pluies glacees et les blizzards impitoyables!",
  "descriptionHtml": "NOTE\r\n*******\r\nMerci de revenir sur cette page pour cliquer sur \\\"Endorse Me\\\".\r\nNon seulement, celà donne de la visibilité à ce MOD qui est excellent, mais aussi celà m\\'encourage pour traduire d\\'autres MOD et en développer, et puis quoi c\\'est juste gentil.\r\n\r\nDESCRIPTION\r\n****************\r\nGrandFroid est l\\'adaptation française du célèbre Frostfall.\r\nGrandFroid est un mod qui ajoute une grande Immersion à Skyrim, de style Survie.\r\n\r\nLes Trois-quarts de Skyrim  ont lieu dans des régions hostiles, de la tundra aux monts enneigés, en passant par les tourbières et marécages. \r\n\r\nNe trouvez vous pas un peu facile de traverser tout ça en petite chemise (si vous êtes mage) sous la pluie battante et le blizzard hurlant sans qu\\'il y ait un impact sur vous, sur votre énergie à combattre, voire tout simplement à survivre?\r\n\r\nGrandFroid (Frostfall) est un Mod qui apporte une grande dimension d\\'immersion au jeu. \r\nSurvivre à Skyrim n\\'est désormais plus une simple question d\\'aller cogner les méchants; Il s\\'agit aussi de survivre à son climat. \r\n\r\nFinies les traversées d\\'eaux glacées en slip (irréaliste). Il faut dorénavant être bien équipé(e) pour affronter les vents rageurs, les pluies glacées et les blizzards impitoyables.\r\n\r\nVos chances de survie dépendront du climat, et donc de ce que vous portez, de ce que vous mangez et de ce que vous apportez avec vous pour bivouaquer quand il est temps de se mettre à l\\'abri. \r\n\r\nMaintenant, Skyrim est devenu un monde hostile. \r\nNon pas à cause des monstres et ennemis qui y pullulent, mais parce que Skyrim est Skyrim. \r\nUne expérience à vivre! \r\n\r\nQU\\'EST-CE QUE GRANDFROID? \r\n************************************\r\nLes trois composantes de GrandFroid sont l\\'hypothermie, la survie aux eaux glacées, et les équipement de Camping.\r\n\r\nL\\'objectif premier de ce Mod est d\\'ajouter un profond niveau d\\'immersion au jeu, tout en évitant tout sentiment d\\'ennui. L\\'immersion et le fun réunis!\r\n\r\nGrandFroid utilise un système de localisation sophistiqué pour déterminer combien le climat, l\\'heure du jour ou de la nuit, les vêtements portés impactent sur vous. Il propose aussi un ensemble complet d\\'équipements de camping, incluant des torches forgeables. C\\'est un Mod hautement configurable, et compatible avec la plupart des autres Mods, y compris ceux du domaine des capes, du camping, de l\\'alimentation, de la nourriture, de la gestion du temps, de l\\'éclairage, des vampires et des loups-garous\r\n\r\nGrandFroid inclue aussi l\\'option Get Wet - Water FX shader de W.A.T.E.R, afin de maximiser l\\'effet visuel d\\'être trempé sous la pluie ou après avoir nagé.   \r\n\r\nAPERCU\r\n***********\r\nUn livre, \\\"Le Guide de Survie en Bordeciel\\\" doit être trouvé afin de jouer avec GrandFroid. \r\nCe livre se trouve dans toute auberge de Bordeciel. Une fois en votre possession, ce livre vous sert aussi de système de configuration. Sélectionnez dans ce cas \\\"Réécrire le livre(Configurer)\\\" en l\\'ouvrant. \r\nCe livre vous explique aussi l\\'essentiel de ce qu\\'il vous faut savoir pour survivre. Le lire est donc hautement conseillé!\r\n\r\nAprès l\\'acquisition du livre, les principes suivant s\\'appliquent à votre personnage:\r\n* Hypothermie - Vous avez des Couches de Protection. Les régions froides vont vous glacer jusqu\\'aux os, alors que les régions plus chaudes vont être un plus cléments (Rivebois, Epervine).\r\n* La Survie en eaux froides - Les eaux ont des températures relatives à leur localisation. Celles de Rivebois, Epervine et le Rift dont agréables. Celles de Blancherive sont froides. celles du Clos et des régions enneigées peuvent vous tuer en quelques secondes.\r\n* Équipement de Camping - C\\'est nécessaire pour survivre aux deux points ci-haut. Vous avez une tente forgeable pour dormir dehors, un Kit de Feu de Camp pour vous réchauffer ou vous mettre au sec, et une marmite pour cuisiner et manger chaud.\r\n\r\nVous apprendrez aussi avec ce Guide de Survie les compétences suivantes:\r\n* Pouvoir de Survie. Cela vous permettra de forger vos équipements de camping et de survie.\r\n* Sensibilité au climat, un pouvoir qui vous donne votre niveau de Couches de Protection en cours, et une description du climat environnant. Le recours à une touche-rapide est conseillé, mais de toute manière dès que le temps change, ou qu\\'une alerte survient, GrandFroid vous l\\'annonce automatiquement, donc ps de souci.\r\n* Inspection d\\'équipement, pour les joueurs avancés qui ont activé l\\'option W.E.A.R ou qui ont choisi le Mode Expert. Ceci permet de déterminer l\\'impact du froid sur vous selon ce que vous portez sur vous (armure inclue d\\'autres mods!)\r\n\r\n\r\nPRE-CONFIGURATIONS\r\n***************************\r\nLes Pré configurations sont un bon moyen de configurer GrandFroid sans avoir à configurer les options individuelles. Elles peuvent être changée à tout moment en ouvrant le Guide de Survie et en sélection \\\"Réécrire\\\"\r\n\r\nMECHANIQUE DU JEU\r\n**************************\r\n1. Hypothermie\r\n==============\r\nLes Couches de Protection déterminent votre condition avec GrandFroid. La chaleur vous en fait gagner, le froid du climat et des eaux vous en font perdre.\r\n\r\nVous allez recevoir automatiquement des messages périodiques discrets en haut à gauche de l\\'écran sur votre statut (vous vous réchauffez, vous avez froid, vous êtes trempé, etc).\r\n\r\nUtilisez votre nouvelle habileté pour garder un œil sur votre niveau actuel de Couches de Protection, et la température environnante.\r\n\r\nPerte de Couches de Protection\r\n---------------------------------------\r\n* Localisation - Le climat de l\\'endroit où vous vous situez a un grand impact sur vous. en général les régions sont (du plus doux au plus froid):\r\nEpervine (plus doux)\r\nMarkarth\r\nFaillaise\r\nLe Reach\r\nBlancherive\r\nHjaalmarch\r\nLa côte Nord\r\nLe Clos, et les montagnes (Hrothgar, ex) (plus froid)\r\n* Climat - être aux aguets du climat peut sauver votre vie. Le Blizzard peut tuer en quelques minutes. La pluie et la nage vont vous mouiller et vous rendre plus vulnérable; Vous sécherez avec le temps, mais une source de chaleur accélère le processus.\r\n* Rester au sec - Plus vous serez mouillé (mouillé, trempé, jusqu\\'aux os), en nageant ou sous la pluie, plus vous perdrez rapidement des Couches de Protection \r\n* L\\'heure du jour - Les nuits de Bordeciel sont plus froides ces temps-ci, ne l\\'oubliez pas.\r\n\r\nGain de Couches de Protection\r\n--------------------------------------\r\n* Sources de chaleur - C\\'est le seul vrai moyen. La proximité de source de chaleur (à part les torches) vont vous donner un regain de Couches de Protection assez rapidement. Utiliser les Kits de feu de camp. Au maximum, le statut \\\"Bien au chaud\\\" augmentera temporairement votre santé, votre magie et votre vigueur\r\n* Alcools - Apporte temporairement un gain de 15 à 25 Couches de Protection, dépendamment de la qualité du breuvage, et cela dure 3 minutes.Ensuite vous perdrez de 20 à 30 Couches de Protection (5 de plus que celles gagnées). L\\'alcool est donc un recours de secours en cas de besoin ou d\\'urgence, le temps de vous mettre à l\\'abri.\r\n* Les intérieurs - Vous ne perdrez pas de Couches de Protection en intérieur, même en nageant (dans les dongeons)\r\n\r\nÊtre au Chaud\r\n-----------------\r\n* L\\'habillement - La mort attend ceux qui se baladent en slip. Vous recevrez des couches de protection pour chaque pièce d\\'habillement que vous portez (tête, torse, mains, pieds). Le type d\\'habillement n\\'importe que si vous avez choisi l\\'option W.E.A.R.\r\n* Résistance au Froid - Certaines races, surtout les Nordistes sont plus résistants au Froid que d\\'autres\r\n* Torches, Capes et nourriture - Ils vont vous donner de bons bonus de résistance au froid, voire sauver votre salut.\r\n    Les Torches - Elles vous donneront un bonus de 10%\r\n    La nourriture - Les soupes et ragoûts donnent un gain de 10% à 25% (compatible avec tout Mod de nourriture)\r\n    Les capes - Elles vous donneront un bonus de 10%\r\nNotez qu\\'aucun de ces éléments ne vous immunise contre le froid, mais cumulés vous donnent un confort appréciable.\r\n\r\nNotes sur les Vampires et loups-garou:\r\n-----------------------------------------------\r\n* De part leur nature, les vampire sont peu sensibles au froid, mais à un certain point de froid, ils  commenceront à s\\'engourdir comme pour les mortels.\r\n* Les loups-garou gagnent 20 couches de protection en se transformant -l\\'équivalent d\\'une armure complète-, et 10 Couches en se nourrissant.\r\n\r\n\r\n2. Survie en Eaux Froides\r\n======================\r\nLes Eaux de BordeCiel ont des température en fonction de leur localisation, allant de rafraîchissante à frigorifiante.\r\n\r\nSauter dans des eaux glacées va vous apporter des troubles de vision et une perte totale de vigueur. Ensuite vous aurez 30 secondes pour sauver votre peau. Vous pouvez recourir à l\\'elixir de gibrevoises pour survivre en eaux glacées pendant trois minutes.\r\n\r\nVous ne serez affecté par les Eaux que si vous y nager, pas en marchant sur un cours d\\'eau. Referez vous à la température environnante pour vous donner une idée de celle de l\\'eau.\r\n\r\n\r\n3. Couper des bûches\r\n===================\r\nUtilisez une hache de bûcheron ou de braconnier vous permet de couper des bûches. Vous ne pouvez le faire qu\\'à l\\'extérieur et avec des arbres Les bûches disparaissent après 48 heures.\r\n\r\n\r\n4. Équipements de Survie forgeables\r\n================================\r\nLa Pouvoir de Survie vous donne la possibilité de forger des articles utiles à votre survie, et son utilisation augmente votre compétence de forgeage.\r\n* Torche. Composants: 1 bûche, 1 toile d lin.\r\n* Kit de Feu de Camp: Composants: 3 bûches. Brûle pendant 6 heures et peut-être réanimé avec 2 bûches.Un feu de camp vous fait regagner vos Couches de Protection et disparaît après 48 heures.\r\n* Petite Tente: Composants: 5 peaux d\\'animaux de tout type. 10 Utilisations. Permet de dormir en sac de couchage.\r\n* Grande Tente: Composants: 12 peaux d\\'animaux de tout type. 20 Utilisations. Permet de dormir en sac de couchage.\r\n* Marmite. Composants: 1 pot en fer, 1 cuillère de bois. Vous permet de cuisiner en Camping.\r\n* Elixir de gibrevoises. Composants: 15 gibrevoises, 1 œil de Smilodon, 1 œuf de poisson carnassier. Vous permet de nager en eaux glacées pendant 3 minutes. Ça goûte mauvais.\r\n\r\n5. Options avancées\r\n=================\r\nDisponibles via le Guide de Survie -> Configuration -> Avancé.\r\n\r\nW.E.A.R. (Worn Equipment Affects Rate)\r\nCette option est automatique en choisissant le Mode Expert. Avec cette option, la protection vestimentaire dépend de ce que vous portez. Il ya 3 catégories. Limitée, Moyenne, Bonne\r\n\r\nLimité: Bon pour explorer les régions du Sud, mais non conçus pour explorer les Nord et les hautes montagnes.\r\nCela inclus les matières suivantes:\r\n* Les fourrures sans manches\r\n* Les peaux\r\n* Les cloutés\r\n* Le Fer\r\n\r\nMoyenne: Offre une bonne protection globale. Convient à tout type de région, à part le Grand Nord et les hautes montagnes.\r\nLa plupart des matières entrent dans cette catégorie (y compris certaines fourrures sans manche)\r\n\r\nBonne: Permet la meilleure protection possible\r\nSeules deux matières  entrent dans cette catégories\r\n* Les fourrures avec manches\r\n* Orc\r\n\r\nUtilisez le Pouvoir d\\'inspection, si désiré, pour changer à tout moment le niveau de protection d\\'une pièce d\\'équipement portée. \r\n\r\nKit de Feu Camp Manuel\r\n------------------------------\r\nCette option est active automatiquement en utilisant le Mode Expert. Si active, les Kits de Feu doivent être allumés manuellement avec un sort de flamme, un cri, ou une torche. Pour utiliser la torche, tenez-vous debout près du feu équipé avec la torche. Le feu devrait prendre en quelques secondes.\r\n\r\nExigence de Déplacement Rapide\r\n-----------------------------------------\r\nCette option est active automatiquement en utilisant le Mode Normal. Si active, vous serez tenus de porter une hache de Bûcheron (ou de Braconnier) pour faire un Voyage Rapide. Pourquoi ? Parce que d\\'une façon réaliste, vous aurez besoin d\\'acquérir du bois à brûler et créer des feux de camp au cours de votre voyage. Le Voyage Rapide sera automatiquement permis si la Hache est dans votre inventaire.\r\n\r\nBouton de Déplacement Rapide\r\n---------------------------------------\r\nLe Déplacement Rapide est automatiquement inactivé dans le Mode Expert. Cela passe en priorité sur \\'Exigences de Voyage Rapide\\'; si le Voyage Rapide est inactivé, avoir la Hache de Bûcheron dans votre inventaire ne vous aidera pas à faire de Déplacement Rapide.\r\n\r\nBouton d\\'Attente Dehors\r\n------------------------------\r\nCette option vous active ou non la capacité \\'d\\'Attendre\\' en étant dehors. Cela impactera votre capacité de Déplacement Rapide; il ne peut pas être permis individuellement. Mais vous pourrez toujours dormir dans le couchage d\\'une tente à l\\'extérieur.\r\n\r\nMortalité des Eaux Glacées\r\n---------------------------------\r\nCette option est active automatiquement en utilisant le Mode Normal et Expert. Si active, l\\'eau \\'Glaciale\\' peut vous tuer en 30 secondes. Utilisez Flamecloak ou la concoction de gibrevoises pour vous protéger de l\\'eau glaciale.\r\n\r\nDurabilité de Tente\r\n------------------------\r\nCette option est active automatiquement en utilisant le Mode Normal et Expert. Si permise, les tentes auront un nombre limité d\\'utilisations selon leur taille et la qualité. Une Petit Tente aura 10 utilisations; une Grande 20 utilisations. Si inactivé, les tentes ont des utilisations illimitées.\r\n\r\n\r\nCOMPATIBILITE \r\n*******************\r\nPuisque GrandFroid utilise maintenant Get Wet - Water FX directement dans le mod, si vous êtes un utilisateur W.A.T.E.R, vous devriez l\\'inactiver dans W.A.T.E.R pour garantir le meilleur rendu graphique.\r\n\r\nGrandFroid offre un ensemble complet d\\'équipement de camping, GrandFroid est compatible avec:\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=10573]Camping Kit of the Northern Ranger[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=11074]LtMattMoo\\'s Camping[/url]\r\n\r\nSi vous voulez ajouter la Faim / la Soif / le Sommeil à GrandFroid, les Mods suivants sont compatibles (entre autres) :\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=10639]Imp\\'s More Complex Needs[/url]\r\n[url=http://skyrim.nexusmods.com/mods/18125]Besoins Naturels[/url]\r\n\r\nIncompatible avec d\\'autre mods style d\\'Hypothermie.\r\nPeut être incompatible avec certains mods qui ajoutent de nouveaux types météorologiques.\r\nUtilisateurs de Tales of Lycanthropy : S\\'il vous plaît voir la section dépannage.\r\nCompatible avec tous les mods de nourriture.\r\n\r\n\r\nPRE-REQUIS\r\n***************\r\nAucun. ni même SKSE.  Installez et jouez.\r\n\r\nDEPANNAGE\r\n***************\r\nPlusieurs problèmes peuvent survenir mais être résolus par vous-même en ouvrant le Guide de Survie et en allant à Configuration-> Aide-> Dépannage. Les problèmes que GrandFroid peut essayer de résoudre sont :\r\n\r\n* \\'Je suis toujours mouillé / je ne me fais jamais mouiller.\\'\r\n* \\'En entrant dans l\\'eau, je meurs immédiatement.\\'\r\n* \\'Mes capacités restent toutes à 0.\\'\r\n* \\'Je suis coincé à bouger lentement.\\'\r\n* \\'Mes Couches de Protection ne changent pas.\\'\r\n* \\'Je ne peux pas Faire de déplacement rapide.\\'\r\n* \\'Je ne peux pas attendre ou dormir.\\'\r\n\r\nPermettez s\\'il vous plaît à GrandFroid d\\'essayer de résoudre le problème pour vous. \r\n\r\nTales of Lycanthropy:\r\n--------------------------\r\nIl y a un problème de compatibilité avec GrandFroid et Tales of Lycanthropy. Le fait de se transformer vous fera perdre Couches de Protection très rapidement dans les endroits froids. Si cela vous arrive, il y a une astuce (merci, Curi0us) :\r\n\\\"il peut être résolu en changeant quel jeu d\\'animation est utilisé. Ouvrez la console et tapez \\'met lycan_transformationsetting to 3\\'.\\\"\r\n\r\nIMPORTANT\r\n**************\r\nGrandFroid est un Mod avec de nouveaux concepts à disposition du joueur sous forme d\\'options. S\\'il vous plaît, prenez le temps de lire ce qui suit et de consulter l\\'aide fournie après avoir ouvert le Guide de Survie (Configuration -> Avancé -> Aide)\r\n\r\nBeaucoup de problèmes peuvent maintenant être résolus en sélectionnant le Guide de Survie à Configuration -> Aide -> Dépannage, et en sélectionnant le problème que vous rencontrez.\r\n\r\nSi vous ressentez le besoin de désactiver, temporairement ou non, GrandFroid, cette option est aussi disponible dans le Guide de Survie à Configuration -> Avancé -> Activer/Fermer \r\n\r\n\r\nINSTALLATION MANUELLE\r\n*******************************\r\nPlacez Chesko_Frostfall.esp et Chesko_Frostfall.bsa dans Skyrim\\\\Data. Activez Chesko_Frosfall.esp dans le Data Files du Skyrim Launcher.\r\n\r\nPROBLEMES CONNUS\r\n*************************\r\nLes eaux glacées ne fonctionneront pas si vous êtes à cheval\r\n\r\n\r\nVERSION\r\n**********\r\nCeci est une version 1.6b Finale, c\\'est à dire que;\r\n- Elle est fonctionnelle à 100% identique à Frosfall 1.6b\r\n- Elle a été vérifiée par des testeurs externes\r\n- Elle a été validée par la Confrérie des Traducteurs. \r\n\r\nREMERCIEMENTS\r\n********************\r\nMerci à Chesko pour Frostball, tout le mérite lui revient! (j\\'ai quand-même pas mal bossé lol)\r\nMerci à Malhuin et Volktair pour avoir testé GrandFroid avec beaucoup de sérieux.\r\nMerci à la Confrérie des Traducteurs pour sa rigueur.\r\nMerci aux membres de la Confrérie des Traducteurs pour tout.\r\n\r\n\r\nAUTRES REALISATIONS\r\n*******************************\r\nMarqueur d Alerte de Quetes.........http://skyrim.nexusmods.com/mods/25071\r\nLes Pierres de Barenziah................http://skyrim.nexusmods.com/mods/24681\r\nSonorite pour Barenziah.................http://skyrim.nexusmods.com/mods/24639\r\n\r\n\r\n************************************************\r\n*** En Mémoire de Mathieu et Yu-Qi ***\r\n************************************************",
  "categoryId": "78",
  "version": "1.6b",
  "author": "Saxofun",
  "createdUnix": "1348317811",
  "updatedUnix": "1349549270",
  "containsAdultContent": false,
  "uploadedBy": "saxofun",
  "primaryFile": null,
  "files": [
    {
      "fileId": "89834",
      "name": "GrandFroid v1_6BETA",
      "version": "1.6bBETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "587",
      "fileName": "GrandFroid-24466-1-6bBETA.rar",
      "uploadedUnix": "1348318474",
      "modVersion": "1.6bBETA",
      "virusScanUrl": "https://www.virustotal.com/file/92f184000e4c115ed72f33695486836b5431647eb81026b31298aec87a199947/analysis/1407180904/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GrandFroid-24466-1-6bBETA.rar?fid=89834&ttl=1535795420&ri=8192&rs=8192&setec=24b67dc2f6a8d71cde4218b9b7f60b07"
    },
    {
      "fileId": "90769",
      "name": "GrandFroid Fichier Principal v1_6BETA2",
      "version": "1.6bBETA2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "881",
      "fileName": "GrandFroid Fichier Principal-24466-1-6bBETA2.zip",
      "uploadedUnix": "1348786684",
      "modVersion": "1.6bBETA2",
      "virusScanUrl": "https://www.virustotal.com/file/696e431b5cd843660e1f8b584c628ffff53dd59301b9af46615a4dd6872d82d9/analysis/1407190446/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GrandFroid%20Fichier%20Principal-24466-1-6bBETA2.zip?fid=90769&ttl=1535795420&ri=8192&rs=8192&setec=c8c83181575df0deef01aab8df02d4ea"
    },
    {
      "fileId": "92399",
      "name": "GrandFroid 1_6b Final",
      "version": "1.6b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "593",
      "fileName": "GrandFroid 1_6b Final-24466-1-6b.rar",
      "uploadedUnix": "1349549270",
      "modVersion": "1.6b",
      "virusScanUrl": "https://www.virustotal.com/file/47959ef09607520e9ff99dc8155e8685f157ce19565cbc9c297260010d5d4ca3/analysis/1407207066/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GrandFroid%201_6b%20Final-24466-1-6b.rar?fid=92399&ttl=1535795421&ri=8192&rs=8192&setec=88b8db643f61b73abc0d2e1f195a63e5"
    }
  ]
}