{
  "modId": 24478.0,
  "modName": "Witcher2 Replacer Stormcloaks",
  "summary": "Replaces Stormcloak armour with awesome Witcher2-style Blue Stripes armour.",
  "descriptionHtml": "================\r\nDetails\r\n================\r\n\r\nThis is an add-on intended for:\r\n\r\nWitcher5688\\'s Witcher2 Replace Mod - http://skyrim.nexusmods.com/mods/22054\r\nmy own Witcher2 Replacer Upgrade - http://skyrim.nexusmods.com/mods/24370\r\nDas_Reich\\'s Heavy Oblivion Style Witcher Plated Imperial Soldiers - http://skyrim.nexusmods.com/mods/16130\r\n\r\nIn Witchear5688 mod, both the Stormcloaks and the Legion use variants of the Witcher 2 light plate armour (blue and red respectively). This looks fine, but I prefer the heavy plate look of the Oblivion-style Legion. But when using the latter mod, the Stormcloaks\\' light plate armour looks puny next to the heavily-armoured Legion - basically, the Stormcloaks don\\'t look like they could compete. So I figured that the Stormcloaks would be more likely to adopt guerilla-style hit-and-run attacks and thus needed armour to match. The Blue Stripes armour from Witcher 2 is perfect - the Blue Stripes are, after all, special forces. So all the Stormcloaks wear either of the two Blue Stripes armours (leather jerkin with a hood, or light breastplate with a helmet) randomly distributed - except Ralof, who always wears the breastplate version. The Windhelm guards still wear the blue light plate armour from Witcher5688\\'s mod - I think that this really marks the Stormcloaks out as being a special, elite force but lacking in the resources to fully plate armour their soldiers. So I think it\\'s in keeping with the lore.\r\n\r\nAdditionally, in Witcher5688\\'s mod, the Stormcloak Generals wear generic barbut helmets. The plate armour looks great, but the helmet just doesn\\'t seem special enough for an officer. So I replaced it with a horned helmet. Now when you go Imperial in the Battle for Whiterun, you\\'ll shake in your boots when the Stormcloak General comes into battle with his hulking armour and huge horned helmet!\r\n\r\n================\r\nKnown Bugs\r\n================\r\n\r\nGalmar Stone-Fists beard pokes a bit through the horned helmet. Not sure if this can be helped. If anyone knows how to use a helmet to hide a beard in the same way it can hide hair or an amulet, let me know. But it\\'s a minor issue.\r\n\r\n================\r\nRequirements\r\n================\r\n\r\nWitcher5688\\'s Witcher2 Replace Mod - http://skyrim.nexusmods.com/mods/22054\r\nmy own Witcher2 Replacer Upgrade - http://skyrim.nexusmods.com/mods/24370\r\n\r\nNot essential, but this mod will make most sense when used alongside the Heavy Oblivion Style Witcher Plated Imperial Soldiers - http://skyrim.nexusmods.com/mods/16130\r\n\r\n================\r\nInstallation\r\n================\r\n\r\nDownload and install my mod with NMM is recommended, or manually extract to your date folder.\r\n\r\n================\r\nInstallation\r\n================\r\n\r\nUninstall via NMM, or manually delete the files.\r\n\r\n================\r\nCredit\r\n================\r\n\r\nThis mod would not have been possible without meshes and textures from:\r\n\r\nWitcher2 Replace Mod by Witcher5688 - http://skyrim.nexusmods.com/mods/22054\r\nWitcher 2 Helmet Pack by redxavier - http://skyrim.nexusmods.com/mods/7159\r\nCraftable Blue Stripes Commando Armor vBETA by TH3WICK3D1 - http://skyrim.nexusmods.com/mods/7807\r\n\r\nand finally, CD Projekt Red - developers of the Witcher 2 who have kindly allowed their meshes and textures to be used in other projects provided they are given credit.",
  "categoryId": "54",
  "version": "1.1",
  "author": "zulu9812",
  "createdUnix": "1348333425",
  "updatedUnix": "1348333687",
  "containsAdultContent": false,
  "uploadedBy": "zulu9812",
  "primaryFile": null,
  "files": [
    {
      "fileId": "89878",
      "name": "Witcher2 Replacer Stormcloaks",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7133",
      "fileName": "Witcher2 Replacer Stormcloaks-24478-1-1.7z",
      "uploadedUnix": "1348333687",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c544e5da69329f9b8a1935e7a0d799f5d06be2adcf6197521ba779da6061186b/analysis/1407181643/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Witcher2%20Replacer%20Stormcloaks-24478-1-1.7z?fid=89878&ttl=1535795439&ri=8192&rs=8192&setec=f9f9d7c2442133f2fc92275d13aadbc9"
    }
  ]
}