{
  "modId": 24486.0,
  "modName": "Als Eclipse Bloodcurse - Eclipse on Demand with Mechanical and Visual Effects",
  "summary": "This bestows a lesser power upon you which allows you to create an eclipse in exactly the same manner as a Bloodcursed arrow fired at the sun from Auriel&#39;s Bow. Not only does the visual effect appear, but the mechanical effects occur as well (i.e. vampires no longer take sun damage). (Requires Dawnguard DLC)",
  "descriptionHtml": "[b]AL&#39;S ECLIPSE BLOODCURSE [i](Requires the Dawnguard DLC)[/i][/b]\r<br />\r<br />[b]Update 10/17/2012[/b] -- I have added a new file, Als Eclipse Bloodcurse Alternate. It does NOT have the visual effect of the eclipse, but it removes sun damage from vampires PERMANENTLY after the power is used ONCE.\r<br />\r<br />[b]NB. 10/10/2012[/b] -- [i]The mod is slightly [u]BUGGED[/u]. The eclipsed sky will automatically come back [u]EVERY[/u] morning and last all day, just from using the power once. However, only the first day it&#39;s used will remove sun damage from vampires. Every day thereafter, you will have the black-sky-red-sun effect, but [u]STILL[/u] have sun damage, [u]UNLESS[/u] you use the power again. I am attempting to work out this bug, but the script is loops upon loops and I&#39;m having trouble untangling it, especially since none of the alterations I test out do [u]ANY[/u]thing like what I expect. &gt;.&lt;\r<br />\r<br />In the meantime, you can try checking out these mods:[/i]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/21706]Make the Day Go Away[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/24155]Block Out the Sun - Power[/url]\r<br />\r<br />[i]I do [u]NOT[/u] know if these are bugged, or if they remove the sun damage effect in addition to duplicating the visual effect. I have [u]NOT[/u] tried these mods, so use at your own risk.[/i]\r<br />\r<br />[b]If you are having this bug, here is how to remove it:[/b] [i](Thanks to Christmaskfc for figuring this out)[/i] &#34;To fix this, you need to go to indoors, wait to 8:00 pm, save and exit the game (not quicksave), un-install this mod. once you load back your save, wait to 8:00 am. then go outside and enjoy the sun :)&#34;\r<br />\r<br />__________________\r<br />\r<br />\r<br />[b][i]WHAT THIS MOD DOES:[/i][/b] It automatically adds the new lesser power &#34;Eclipse Bloodcurse&#34; to your spell menu, under &#39;Powers&#39;. You equip it and use it in the same manner as a racial power, Doomstone power, or shout. This power creates the same effect as though you had shot the sun with a Bloodcursed arrow from Auriel&#39;s Bow: you get the cool eclipse visual effect, of course, AND vampires lose their sun damage.\r<br />\r<br />It was very tricky (for me at least) trying to figure out what effect the designers used to remove the sun damage; by contrast, the visual effect was easy to find and implement.\r<br />\r<br />[b][i]WHAT THIS MOD DOES NOT DO:[/i][/b] It does not give a quest or item in which to find the power. It is automatically added to you, regardless of whether or not you are a vampire, or have started the Dawnguard quests. This mod also does not turn you into a vampire.\r<br />\r<br />[b][i]FAQ[/i][/b]\r<br />\r<br />Q: Will this remove the sun damage from my vampire?\r<br />A: For as long as the eclipse is active, yes.\r<br />\r<br />Q: How long does the eclipse last?\r<br />A: It lasts as long as it normally would if you had shot the sun with Auriel&#39;s Bow and a Bloodcursed arrow - till approximately 8:00 PM in game time.\r<br />\r<br />Q: The power is not showing up in my spell menu&#33;\r<br />A: Did you look in the right place? It&#39;s under the Powers submenu, not one of the magical schools. If it still doesn&#39;t show up, then you may have to use the command console to give yourself the power. As in the screenshot I have provided, bring up the console by pressing the tilde key (looks like ~ ), which is usually to the left of the top number row on most keyboards. Then type in\r<br />\r<br />help &#34;eclipse bloodcurse&#34;\r<br />\r<br />and press Enter. The name of the spell should come up, along with a string of numbers and letters, similarly to that in my screenshot. (It will most likely NOT be the same exact string of numbers and letters.) Whatever the string of numbers and letters YOU got, is what you should type into the following:\r<br />\r<br />player.addspell [whatever that string was, withOUT these brackets]\r<br />\r<br />and press Enter again. Now exit the console by pressing the tilde key again, and you should be ready to go&#33;\r<br />\r<br />\r<br />[b][u]OTHER MODS BY ME[/u]:[/b]\r<br />\r<br />Al&#39;s Completionist Series:\r<br />    1. [url=http://skyrim.nexusmods.com/downloads/file.php?id=9994]Al&#39;s TREASURE VAULT[/url] -- [i]Now you have a place to store all your gold and have it display as treasure&#33;[/i]\r<br />    2. [url=http://skyrim.nexusmods.com/mods/30633]Als Paragon Reward Chest[/url] -- [i]little mod rewarding the completionist player who collects all 5 Paragons[/i]\r<br />    3. [url=http://skyrim.nexusmods.com/mods/30643]Als Konahrik[/url] -- [i]little mod rewarding the completionist player who collects all vanilla dragon priest masks with a previously missing boss fight[/i]\r<br />    4. [url=http://skyrim.nexusmods.com/mods/30765]Als Treasure Map Reward[/url] -- [i]little mod rewarding the completionist player who collects all 11 Treasure Maps in vanilla Skyrim[/i]\r<br />    5. [url=http://skyrim.nexusmods.com/mods/30915]Als Vault of the Old Slayer -- Requires All 10 Dragon Claws[/url] -- [i]modestly sized dungeon rewarding the completionist player who collects all Dragon Claws in vanilla Skyrim with fantastic amounts of treasure[/i]\r<br />\r<br />Al&#39;s Powers and Abilities:\r<br />    1. [url=http://skyrim.nexusmods.com/mods/12859]Al&#39;s Thunder Smite[/url] -- [i]Insta-Kill Enemies, and ONLY Enemies[/i]\r<br />    2. [url=http://skyrim.nexusmods.com/mods/24486[/url]Al&#39;s Eclipse Bloodcurse[/url] -- [i]Tired of shooting arrows at the sun? Now you can get a true eclipse (including removed sun damage) as a power[/i]\r<br />    3. [url=http://skyrim.nexusmods.com/mods/35123]Als Shadow Walk - Automatic Invisibility While Sneaking[/url]\r<br />    4. [url=http://skyrim.nexusmods.com/mods/35045]Als Shout Like a Dragon - Dragonlike Cooldowns[/url] -- [i]Now you can shout as often as dragons can&#33;[/i]\r<br />\r<br />Al&#39;s Conveniences:\r<br />    1. [url=http://skyrim.nexusmods.com/mods/25824]Al&#39;s Elsweyr Rift[/url] -- [i]Teleport to and from a one stop shop for selling loot and crafting items from anywhere&#33;[/i]\r<br />    2. [url=http://skyrim.nexusmods.com/mods/7728]Al&#39;s &#34;Nothing Sells for Zero Gold&#34; Tweak[/url] -- [i]I bet you&#39;re tired of picking up loot that sells for nothing. So am I[/i]\r<br />    3. [url=http://skyrim.nexusmods.com/mods/35234]Als Thuum of the Magesmith[/url] -- [i]Keep the benefits of your enchanted and smithed items even when you switch outfits for a different look&#33;[/i]\r<br />    4. [url=http://skyrim.nexusmods.com/downloads/file.php?id=13355]Al&#39;s -Get 80 Perk Points and All Skills 100- Cheat Ring[/url]\r<br />\r<br />Al&#39;s Dungeons:\r<br />    1. [url=http://skyrim.nexusmods.com/downloads/file.php?id=13121]Al&#39;s Dead Dragon Giant Camp[/url] -- [i]Just as dragon lairs and giant camps are quick and easy (relatively) stops for a rich haul, so is this&#33;[/i]\r<br />    2. [url=http://skyrim.nexusmods.com/mods/30915]Als Vault of the Old Slayer -- Requires All 10 Dragon Claws[/url]\r<br />    3. [url=http://skyrim.nexusmods.com/mods/35295]Als Revakzoor - Lair of Mythic Dragons - Unfairly Difficult Mod[/url] -- [i]A lair laden with treasure, and guarded by six lethal dragons.[/i]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/19697]Al&#39;s Three Stone Watch[/url] -- [i]Lore friendly, non-cheaty, humble starter home[/i]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=7444]Al&#39;s Starry Armor and Clothing Retextures[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=7648]Al&#39;s Virility - Nude Male - PC Only (Adult Content; NSFW)[/url]\r<br />\r<br />\r<br />[b]Credits:[/b]\r<br />\r<br />--Bethesda for a great game, a great Creation Kit, and very well done tutorials\r<br />--Angelwraith for teaching me several of the basic principles of scripting in Fallout: New Vegas, which got me a leg up on Papyrus\r<br />\r<br />[b]Permissions:[/b]\r<br />You may use any part of this mod in a mod of your own, as long as you fulfill all of the following conditions:\r<br />\r<br />1. You must credit me.\r<br />2. You must notify me via PM.\r<br />3. You must put a link to my original mod, here, on your info page, and in your readme.\r<br />4. Your mod must NOT be a reupload or exact copy of mine.\r<br />5. I retain veto power (but I doubt I would ever use it). ^-^ \r<br />6. You may not use any assets from my mods in anything that you charge for&#33;",
  "categoryId": "75",
  "version": "1.0",
  "author": "AlCiao",
  "createdUnix": "1348347552",
  "updatedUnix": "1350519364",
  "containsAdultContent": false,
  "uploadedBy": "AlCiao",
  "primaryFile": null,
  "files": [
    {
      "fileId": "89926",
      "name": "Als Eclipse Bloodcurse",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1726",
      "fileName": "Als Eclipse Bloodcurse-24486-1-0.7z",
      "uploadedUnix": "1348347628",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/16007ea51034b202a961bdba17a626e339f54e1faf2dde3aade51265985b0a3d/analysis/1407182046/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Als%20Eclipse%20Bloodcurse-24486-1-0.7z?fid=89926&ttl=1535795446&ri=8192&rs=8192&setec=ec08c58a3c3b8683f51c8004fa400c0c"
    },
    {
      "fileId": "94377",
      "name": "Als Eclipse Bloodcurse Alternate",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Als Eclipse Bloodcurse Alternate-24486-1-0.7z",
      "uploadedUnix": "1350519364",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f4759121d5c2852b5afd96b633166c966defe5fb4141e4dad77048c3050fba17/analysis/1407227059/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Als%20Eclipse%20Bloodcurse%20Alternate-24486-1-0.7z?fid=94377&ttl=1535795446&ri=8192&rs=8192&setec=cf29be5ef95be0084fda7a62d8df8a96"
    }
  ]
}