{
  "modId": 24485.0,
  "modName": "Requiem of the Moon - Werewolf Perk Expansion",
  "summary": "Expands the power and durability of the werewolf skill tree. ",
  "descriptionHtml": "So! Who was a bit underwhelmed at the werewolf skill tree? I was. When I saw that the Vampire tree gave all sorts of bonuses and abilities and that, as a werewolf you could only use a third of the tree at any given time! what the heck. So heres what I did.\r\n\r\nVersiion 1.0\r\nI added 3 new perks to the werewolf tree, and tried to make them as balanced as I could. \r\n\r\nPerk 1: KING OF BEASTS ................................................................................\r\n            Adds a damage reduction buff and has 3 levels. at the first rank you will take 20 less damage from incoming attacks, not 20% less damage, 20 fewer points of incoming damage. This doesn\\'t sound like alot but you would be surprised. The next ranks are 30 and 40 less, However the 2nd and 3rd ranks require animal vigor and gorging respectively.\r\n\r\nPerk 2: HIRCINES HUNTER .................................................................................\r\n            Adds a muffle effect to werewolves which (in theory) will make people who don\\'t directly see you not know your there.(needs testing). Requires you have the Savage Feeding \r\n\r\nPerk 3: LUNA\\'S LIGHT ..................................................................................\r\n            The Ultimate in Werewolf Perks. This will add a whole other Beast form power known as Luna\\'s Light  to your power list allowing you to transform twice in a 24 power period. This perk however requires Totem of terror, Totem of the predator and the totem of the ice brothers.\r\n____________________________________________________________________________________\r\n\r\nIf yall have any ideas on what kind of perks to add let me know, if I like them I\\'ll see about putting them in! Also please please please let me know if there are issues or bugs! All I did was change the perks the werewolves have. Nothing has been done to timing or transforming or anything.\r\n\r\n\r\nIf you just want some new light and dark spells check out my other mod :\r\nRequiem of Light and Dark: http://skyrim.nexusmods.com/mods/21443/",
  "categoryId": "73",
  "version": "1.0",
  "author": "darkforte186",
  "createdUnix": "1348347550",
  "updatedUnix": "1348347850",
  "containsAdultContent": false,
  "uploadedBy": "darkforte186",
  "primaryFile": null,
  "files": [
    {
      "fileId": "89927",
      "name": "Requiem of the moon Version 1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Requiem of the moon Version 1-24485-1-0.zip",
      "uploadedUnix": "1348347850",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b4916ee9ecad5a294c1380432a65345d67233ac01bd7b98ad2273e12bf81aba3/analysis/1407182046/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20of%20the%20moon%20Version%201-24485-1-0.zip?fid=89927&ttl=1535795445&ri=8192&rs=8192&setec=8915e85c0eef97872459a876bc932c4b"
    }
  ]
}