{
  "modId": 24493.0,
  "modName": "The Terrans-My First Race Mod",
  "summary": "Adds a new race based off of the Nord Race and uses Better Females face Textures.",
  "descriptionHtml": "The Terrans are cousins of the Nords of Skyrim.  They are simialr to the Nords in looks alone.  \r\n\r\nI have added new racials for the Terrans.  This mod was originally for my upcoming mod \\\"Faeria - The Empire of Balance\\\".  The only reason I made this mod is because psychos1s has not gotten back to me about using The Temptress  for the lead female and I could not find another \\\"good\\\" race mod for female humans.  If anyone can point me to a good mod for that specific reason, please do so.  If there is anyone willing to help me with this mod by making the females look better, please send me the files and I will give you a big fat Kudos, a recommendation for female mods, and a big mention in the credits.  \r\n\r\nThis mod requires the latest CBBE and Better Females.  I believe this mod requires Dawnguard since I had it check marked when I loaded up the file in the creation kit.  I don\\'t really know since I\\'m knew to modding.\r\n\r\nThis race is NOT vampire compatible YET.  I will eventually get to it, however, it will be quite some time since my upcoming mod will not have vampires.  If anyone knows how to make a race vampire compatible race, then go ahead.  I only ask that you credit me as the original author.\r\n\r\nIf any of you would like to help with my upcoming mod, just pm me.  I need people for voice acting.  I also need some more mods, but I can take care of that.",
  "categoryId": "34",
  "version": "1.0",
  "author": "Anorias1",
  "createdUnix": "1348353553",
  "updatedUnix": "1348353643",
  "containsAdultContent": true,
  "uploadedBy": "Anorias1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "89945",
      "name": "The Terrans",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "The Terrans-24493-1-0.rar",
      "uploadedUnix": "1348353643",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6488551eff0b2bbca3bb44ca53694faad2a84b7aa24211722d9130afe315af98/analysis/1407182292/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Terrans-24493-1-0.rar?fid=89945&ttl=1535795462&ri=8192&rs=8192&setec=85a7af49c3f850a1806ab024c969647e"
    }
  ]
}