{
  "modId": 24491.0,
  "modName": "Support Magic",
  "summary": "Spells to buff, heal and fight alongside allies.",
  "descriptionHtml": "[center][img]http://www.freeimagehosting.net/newuploads/nw6ni.jpg[/img][/center]\r\n\r\n[center]What it does[/center]\r\n\r\nAdds spells centered around support roles.\r\n\r\n[center]But...[i]why?![/i][/center]\r\n\r\nSome of us like playing healers! I for one lean towards these roles in RPG games, and I found it very unfulfilling in skyrim. This mod aims to enhance the role and various playstyles of healers without detracting from the game or altering files.\r\n\r\n[center]Okay... but what are the spells?[/center]\r\n\r\nI\\'m glad you asked, non existant entity! Here they are:\r\n\r\n[center][color=lightgreen]Group Armor Spells[/color](Alteration) - All of the armor spells except dragonhide now have group counterparts. Reward your tolerance for tedium with longer lasting allies![/center]\r\n\r\n[center][Color=lightblue]Boons[/color](Restoration) -  Boons are 15 minute exclusive buffs that for the moment increase the regeneration of Health, Stamina or Magicka. As the mod grows, so will the variety for these buffs.[/center]\r\n\r\n[center][Color=lightblue]Group Healing[/color](Restoration) - A concentrated group heal. Starts off healing nearby allies for 20, and you for 15. These spells burn undead instead. Scales like a normal healing spell. A high level version can be found around a restoration of 50[/center]\r\n\r\n[center][Color=red]Siphon Health[/color](Restoration) - A concentrated health drain that heals nearby allies, and you to a lesser extent. Starts off dealing/healing 25 damage a second. Scales with and grants xp to restoration/destruction. A high level version can be found around a restoration of 50[/center] \r\n\r\n[center][Color=lightblue]Ray of Light[/color](Restoration) - You fire a ray of light that burns enemies or heals allies. Does a bit of extra damage to undead and demons, and even more damage to vampires. Scales with and grants xp to restoration/destruction. Friendly vampires will be spared some of the damage. A high level version can be found around a restoration of 75[/center]\r\n\r\n[center][Color=red]Curse/Doom Enemy[/color](Restoration) - For 1 minute, a hostile target is cursed and takes continuous damage. Starts at 10 dmg, scales with and grants xp to restoration/destruction. Doom does much more damage over time.[/center]\r\n\r\n[center][Color=lightblue]Call Tireless Guardian[/color](Restoration) - You summon a healing assistant for 3 minutes. He heals the group every few seconds, and levels with the player to 99. Using this spell grants xp to restoration/conjuration. His spells now grow as you level.[/center]\r\n\r\n[center][Color=Orange]Atronach Heals[/color](Conjuration) - These spells use the element of your chosen atronach to heal it and hurt any hostiles that get in the way. They should function like normal destruction spells of their type, and grant xp to both schools of magic.[/center]\r\n\r\n[center][Color=Cyan]Ice Wind[/color](Destruction) - Ice wind deals cold damage to enemies instantly and heals allies over time. This is essentially ice storm with a small AoE heal attached. Not great for straight up healing, but hitting friendlies with this spell is a happy accident.\r\n\r\n[b][u]All of the spells are sold by vendors of their type[/u][/b]\r\n\r\n\r\nIf you\\'re wondering how best to use the spells, the golden rule of thumb is that negative effects target hostiles, positive ones target non hostiles. \r\n\r\nHeals hurt undead, light spells do extra damage to vampires (on top of bonus damage done to all undead and demons). \r\n\r\nHealth drains are your only option if you are a vampire (or some other form of undead). \r\n\r\nPeople don\\'t have to be your followers to recieve these buffs, so you can play a healer for random encounters. \r\n\r\n\r\nSome of the damage effects benefit from fire damage perks but might not show the improvement in the description.\r\n\r\nHopefully these spells help you enjoy your healing experience in Skyrim! They should at least add some flavor without taking anything away.\r\n\r\n[b][size=+2]Changelog[/size][/b]\r\n\r\n1.2\r\n\r\nAdded undead damage effects and conditions to healing/light spells to make them play more like traditional priest spells. Ray spells now do even more damage to vampires. \r\n\r\nWatch nearby undead burn to death as you heal your allies!\r\n\r\n1.1\r\n\r\nAdded missing scripts (Fixes dual xp gain).\r\n\r\nFixed group healing\\'s targeting. Should now work only on allies like it should have.\r\n\r\nAdded higher level versions of group healing and curse enemy, around double the strength.\r\n\r\nAdded Ice Wind, a frost destruction spell that hurts enemies and heals allies. The heal works over time, but the damage works instantly. \r\n\r\nDon\\'t forget to leave a comment or endorse if you enjoy the spells, and remember:[/center]\r\n\r\n[center][b]Steve Buscemi is watching you.[/b][/center]\r\n\r\nCheck out my other mod if you want some more followers! - [url=http://skyrim.nexusmods.com/mods/23937]Coffee\\'s Companions[/url]\r\n\r\n[center][size=+2][color=red]Known Issues[/color][/size][/center]\r\n\r\n- The healing guardian holds a weapon but never swings it. This is actually working as intended, I just didn\\'t want him dual casting his spell. (Yet anyway)\r\n\r\n- Some rare encounters are angered by heals, though I can\\'t figure out why. Happens with vanilla heals too. \r\nThis may just be my game :P though it seems to have something to do with them being scripted to turn hostile later.\r\n\r\n\r\n[b][u]Recommendations[/u][/b]:\r\n\r\n[url=http://skyrim.nexusmods.com/mods/14037]UFO[/url]\r\n[url=http://skyrim.nexusmods.com/mods/14037]Atvir Dres[/url]\r\n[url=http://skyrim.nexusmods.com/mods/9286]Skyrim Redone[/url]",
  "categoryId": "75",
  "version": "1.2",
  "author": "Coffee Mandibles",
  "createdUnix": "1348351970",
  "updatedUnix": "1349385059",
  "containsAdultContent": false,
  "uploadedBy": "CoffeMandibles",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92044",
      "name": "Support Magic",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Support Magic-24491-1-2.zip",
      "uploadedUnix": "1349385059",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/7070d75fc5daf6f25ff5ce98a0f8ce7c9f6af0a7a962697342d796217032a33b/analysis/1407204005/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Support%20Magic-24491-1-2.zip?fid=92044&ttl=1535795454&ri=8192&rs=8192&setec=591e9482607ecec5a3532b87cc5489bd"
    }
  ]
}