{
  "modId": 24507.0,
  "modName": "Leveled Newbie Gear",
  "summary": "Like the look of lower level armor or weapons, but find their stats lacking at higher levels? Craftable-only weapon and armor equivalents to more powerful varieties, with the classic look you love&#33;\r<br />0.90 Beta currently supports only Steel, with Iron and Leather on the way.",
  "descriptionHtml": "Update Dec. 19 2012: I just want to say that updates to this mod should be considered &#34;on hiatus.&#34; It just seems like the workload is a bit too much for the return, and I have other projects I&#39;d rather spend my CK time on. If someone feels like contributing the other recipes in the same style, and is comfortable with A LOT of copying (stats and recipes, as well as cloning &#34;new&#34; items) from one item to another in the CK, feel free to message me. It isn&#39;t really that hard, it just takes time to do it the way I&#39;ve done here. Thanks for checking this out&#33;\r<br />\r<br />=====================\r<br />1. Description\r<br />=====================\r<br />\r<br />This mod adds new craftable-only (no loot, no merchants) weapons and armor that use the art of low level equipment, but the stats of higher level gear like Dwarven, Ebony, and Glass. You still need the correct perk to craft the better gear, and the material components are the same as the equivalent armor/weapon.\r<br />\r<br />Example: Steel Armor (Ebony) has the stats of Ebony Armor, and can be crafted / tempered with the Ebony Smithing perk and the same components as Ebony Armor, but it looks like Steel Armor.\r<br />\r<br />\r<br />================\r<br />2.Installation\r<br />================\r<br />\r<br />Use Nexus Mod Manager\r<br />\r<br />or\r<br />\r<br />1. Download manually\r<br />2. Extract RAR directly to the Data folder wherever Skyrim is installed\r<br />3. Make sure the box next to Leveled Newbie Gear.esp is checked on whatever mod managing program you use.\r<br />\r<br />\r<br />===================\r<br />3.Changelog\r<br />===================\r<br />\r<br />0.90\r<br />--------------------------------\r<br />*Upgraded variants of Steel Armor (Nordic Boots and Gloves, Armor with/without shoulderpads, Helmet with/without horns, and Shield)\r<br />---Dwarven, Orcish, Ebony, Steel Plate, Daedric, and Dragonplate\r<br />\r<br />*Upgraded variants of Steel Weapons and Hunting Bow\r<br />---Dwarven, Elven, Orcish, Ebony, Glass, and Daedric\r<br />\r<br />*Downgraded variant of Steel Plate Armor (Plated Steel Armor), craftable with Steel Smithing perk\r<br />\r<br />*Added Steel Shields with stats and names to match both Steel Plate (Adv Smithing) and Plated Steel (Steel Smithing) armor sets\r<br />\r<br />\r<br />====================\r<br />4. Future Versions\r<br />====================\r<br />\r<br />*Upgraded variants of Iron Armor\r<br />---Steel, Dwarven, Orcish, Steel Plate, Ebony, Daedric, and Dragonplate\r<br />\r<br />*Upgraded variants of Iron Weapons and Longbow\r<br />---Steel, Dwarven, Elven, Orcish, Ebony, Glass, and Daedric\r<br />\r<br />*Upgraded variants of Leather Armor\r<br />---Elven, Scale, Glass, and Dragonscale\r<br />\r<br />*Upgraded Steel and Iron Arrows\r<br />---Conversion recipes from other arrows (ex. 10 Glass Arrows = 10 Arrows - Steel (Glass))\r<br />\r<br />*Dawnguard support\r<br />---Upgraded weapons with Dragon weapon stats\r<br />---Upgraded Steel and Iron Arrow crafting\r<br />\r<br />*Complete Crafting Overhaul support\r<br />---Matched recipes (includes arrow crafting, Dawnguard not required)\r<br />\r<br />\r<br />===================\r<br />5.Compatability\r<br />===================\r<br />\r<br />I&#39;m not aware of any mods that this one has serious problems with, but I&#39;m there might be one or two out there somewhere. If you run into anything, comment or send me a message.\r<br />\r<br />This mod works great with armor/weapon replacers, as long as they replace the art by overwriting the existing art files. Most likely, if the replacer in question uses an esp file, it probably won&#39;t work with this mod. (Steel/Iron/Leather gear only, of course)\r<br />\r<br />If you are using any mods that change the stats of higher level gear such as Dwarven, Orcish, etc., this mod won&#39;t conflict, but the new Steel-variant items will still have the Vanilla stats of their equivalent item.\r<br />\r<br />I&#39;m planning on releasing a version that has recipes that match with Complete Crafting Overhaul after I finish the Vanilla and Dawnguard versions, but I&#39;m not making any versions that sync with other smithing mods because I just don&#39;t have the time or interest. Sorry.\r<br />\r<br />\r<br />=======================\r<br />6. Recommendations\r<br />=======================\r<br />\r<br />&#34;Weapons and Armor Fixes&#34; by headbomb\r<br />http://www.nexusmods.com/skyrim/mods/4719\r<br />\r<br />&#34;Complete Crafting Overhaul&#34; by headbomb, not yet supported by LNG 0.90\r<br />http://www.nexusmods.com/skyrim/mods/8003\r<br />\r<br />&#34;Smithing Perks Overhaul&#34; by headbomb\r<br />http://www.nexusmods.com/skyrim/mods/6047\r<br />\r<br />&#34;Better Sorting&#34; by headbomb\r<br />http://www.nexusmods.com/skyrim/mods/2730\r<br />\r<br />&#34;Steel Helmet Fix&#34; by Phitt (If you happen to have the transparent steel helm glitch)\r<br />http://www.nexusmods.com/skyrim/mods/1988\r<br />\r<br />\r<br />====================\r<br />7. Credits / Permissions\r<br />====================\r<br />\r<br />All work on this mod was done by me, Dudeman325. Some stats were made to mirror those found in Weapons and Armor Fixes by headbomb, and in the future I will make an alternate version that has recipes matching Complete Crafting Overhaul, also by headbomb. Neither of these mods .esp files will be referenced by mine, and all artwork used is original art packaged with the unmodded game.\r<br />\r<br />You do NOT have permission to host this mod on any other websites, either in its original state, or altered. You DO have permission to make changes to this mod for personal use, and I don&#39;t really care if you share this mod with a few friends, altered or not, as long as you aren&#39;t hosting it for public download.\r<br />\r<br />Enjoy&#33; :D",
  "categoryId": "36",
  "version": "0.90",
  "author": "Dudeman325",
  "createdUnix": "1348390460",
  "updatedUnix": "1348390692",
  "containsAdultContent": false,
  "uploadedBy": "Dudeman325",
  "primaryFile": null,
  "files": [
    {
      "fileId": "90026",
      "name": "Leveled Newbie Gear",
      "version": "0.90",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Leveled Newbie Gear-24507-0-90.rar",
      "uploadedUnix": "1348390692",
      "modVersion": "0.90",
      "virusScanUrl": "https://www.virustotal.com/file/518d3ce88457531d7f7676afce73caf4147e6a83e0b7cbf1ff250831015e67dc/analysis/1407182883/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Leveled%20Newbie%20Gear-24507-0-90.rar?fid=90026&ttl=1535795487&ri=8192&rs=8192&setec=1a9f21705d5d800017537918b42d821d"
    }
  ]
}