{
  "modId": 24578.0,
  "modName": "My Little Pony Guard Shield Retextures",
  "summary": "Changes the badges on the guardsman shields into MLP character portraits.\r\n(Currently hidden, investigating color bug)",
  "descriptionHtml": "[size=6pt][b]My Little Pony Guard Shield Retextures[/b][/size]\r\n[size=3pt]Currently taking requests.[/size] (more info below)\r\n\r\nWhat this mod does is change the badges on the shields of the guardsman across Skyrim into the character portraits of various MLP characters. \r\nNot the most original mod you may have ever seen but still, it may be nice for some fellow fans of the show to have the choice if they want to, MLP mods seem awfully scarce in the Skyrim modding scene for some reason.\r\n\r\nIf you hate ponies then this could also be the mod for you, it will only change or add shields, and what is it shields do? They block.\r\nWho wouldn\\'t like to parry a power attack from a warhammer with Rarity\\'s face? I know I would.\r\n_______________________________________________\r\n[size=2pt][b]NEWS SEGMENT:[/b][/size]\r\n\r\n[i]2012-10-13:[/i]\r\nSecond release of the mod, 0.91.\r\nAdded 26 ponies and characters from the series, plus my own OC, for a total of 27 new and 36 total.\r\nRequests added: Derpy Hooves, Gilda, Zecora.\r\n\r\nTaking a break from the mod, I am temporarily shelfing the current plans of adding all the shields to the game, learning how to mod NPC\\'s and making more significant changes of the guard shield mesh and textures (I will resume work on that later on when I actually have the time and motivation to do so), still taking requests however so if you have something in mind be sure to let me know in the comments.\r\n\r\n\r\n[i]Fuck-if-I-Know-Which-Date:[/i]\r\nFirst release of the mod, 0.9.\r\nMane 6, Luna, Celestia and Spike added as defaults for the 9 holds of Skyrim.\r\n_______________________________________________\r\n[b]General crap[/b]\r\n\r\nThis mod has been done before, one of the two versions was taken down by the owner and the other you can find [url=http://skyrim.nexusmods.com/mods/6931]here[/url].\r\nI was using the later but got a bit tired of the textures and simply decided to learn how to make my own, turns out that it\\'s basically just .dds saved images which are dirt easy to save and modify with the right GIMP2 plugin.\r\n\r\nSo right now ALL it does is change the shields of the 9 holds of Skyrim, but I have some plans in mind for this mod.\r\nCurrently the next step is to create a few alternate replacements for added variety and choice, I plan on adding 27 more retextures which will include Derpy Hooves, Vinyl Scratch, Cheerilee, the Cutiemark Crusaders and the usual bunch. This may take anything from a few days to a couple of weeks depending on the amount of time I have to spare on the project.\r\nFrom there what I want to do is add all the shield variants into the game simultaneously, perhaps add a vendor or mix them into the loot lists, spread them across the world or something.\r\n\r\nIn the meanwhile I\\'d love to take some of your requests (if there is any demand for this kind of mod at all), just name who you want added in the comments and I\\'ll scoop it up and turn it into a shield the next time I swing by.\r\n_______________________________________________\r\n[b]Instructions[/b]\r\n\r\nYou\\'ll find everything you need to know in the readme file included with the archive, don\\'t like Celestia being the pony of Solitude? Want to switch her out for say, Fluttershy? Well you can. It\\'s quite easy.\r\n_______________________________________________\r\n[b]Ponies in current version[/b]\r\n\r\nPrincess Celestia - Solitude\r\nPrincess Luna     - Windhelm\r\nTwilight Sparkle  - Winterhold\r\nApplejack          - Whiterun\r\nRainbow Dash     - Morthal\r\nRarity               - Markarth\r\nPinkie Pie          - Riften\r\nFluttershy          - Falkreath\r\n\r\n[i]Replacers (have to be manually added):[/i]\r\n\r\nApplebloom\r\nBerry Pinch\r\nBerry Punch\r\nBig Mac\r\nBon Bon\r\nCheerilee\r\nChrysalis\r\nDaring Do\r\nDerpy Hooves\r\nDiamond Tiara\r\nGilda\r\nGolden Harvest (Carrot Top)\r\nLucky\r\nLyra Heartstrings\r\nManie Manie (OC)\r\nNoi\r\nOctavia\r\nRaindrops\r\nRose\r\nScootaloo\r\nShoeshine\r\nSilverspoon\r\nSwandive\r\nSweetie Belle\r\nTrixie\r\nVinyl Scratch\r\nZecora\r\n\r\n[i]Total 36[/i]\r\n_______________________________________________\r\n[b]Requests[/b]\r\n\r\nI am taking all and any requests for new shields to be added.\r\nThis includes variations of existing shields (you can ask for multiple Rainbow Dashes for example, Original Characters of your choice, scenery, items, creatures, etc etc as long as it is related to the G4 series MLP: FiM.\r\nWhile I wont be adding them immediately and right away I\\'ll be sure to come by every now and then to see if any new requests have been made and add them to the list of new shields to make, once enough requests have been made (or enough time passes) I\\'ll create a compilation of new requests and add them as a new optional release.\r\nDO KEEP IN MIND that I am not an artist, you sort of get what you see, either you take it or you leave it.\r\nOccasionally I go back to change old shields, fix jagged edges and other crudeness, but don\\'t go about expecting a masterful work of art to come out of nowhere, I am very limited by what I, as an amateur modder and image manipulator, am capable of.\r\n\r\nIf you ask me to add, say, an anime character from your favorite series, a lancer from gears of war, or whatever shit you come up with that isn\\'t related to the series I wont be adding it, simple as that.\r\nBut I do plan on [i]eventually[/i] making a short tutorial video explaining how you can go about doing it.\r\n\r\n[i]Requests fulfilled:[/i]\r\n\r\nDerpy Hooves\r\nZecora\r\nGilda\r\n_______________________________________________\r\n[b]Bugs[/b]\r\n\r\nNone as far as I know, but if you experience any bugs related to this... \\\"mod\\\" let me know.\r\nI welcome any feedback and criticism you may have to offer.\r\n_______________________________________________\r\n[b]Credits[/b]\r\n\r\nTheomach - Practically based it off his mod by reverse engineering his files, none of it remains however.\r\nHasbro - MLP: FiM\r\n_______________________________________________\r\n[b]Other[/b]\r\n\r\nYou are free to use the mod and any files included however you damn well please.\r\nUpload it wherever you want, make your own changes, anything goes.",
  "categoryId": "29",
  "version": "0.91",
  "author": "ManualReplica",
  "createdUnix": "1348526071",
  "updatedUnix": "1350080869",
  "containsAdultContent": false,
  "uploadedBy": "ManualReplica",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93541",
      "name": "MLP Guard Shield Retextures - 2nd Release",
      "version": "0.91",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29699",
      "fileName": "MLP Guard Shield Retextures - 2nd Release-24578-0-91.rar",
      "uploadedUnix": "1350080869",
      "modVersion": "0.91",
      "virusScanUrl": "https://www.virustotal.com/file/f216560c48dbc8d8fc20f27b101f94f4ef37ad614c7e495353e0e4093bd49456/analysis/1407218362/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MLP%20Guard%20Shield%20Retextures%20-%202nd%20Release-24578-0-91.rar?fid=93541&ttl=1535795584&ri=8192&rs=8192&setec=182591feb5b52b9e0405ef6c4e4471e4"
    }
  ]
}