{
  "modId": 24585.0,
  "modName": "The Way of the Force a la Star Wars",
  "summary": "Learn the force, with all new spells, weapons, and abilities. Follow a quest, collect the holocrons, and team up with a smart mouthed dwemer sphere named Heich Kai. Become the Jedi (je&#39;daii) or Sith (Siit) you have always wanted to be&#33;",
  "descriptionHtml": "[b][size=4][u]Notice: So far I have not been able to get over to Skyrim SE, nor do any porting. Also so far, no one has any permission to port it over, because no one has asked, nor has anyone taken over the project. If you find my mod here uploaded to Bethesda.net for Skyrim SE, please report it. I assume you will likely download it before hand, so be it, but I cannot and will not support or condone my mod being used without my permission.[/u][/size]\r<br />[/b][center][b]\r<br />[size=32][color=grey]--Mod Features--[/color][/size][/b][/center]\r<br /> - [b]42[/b] force powers for you to learn with more to come, including mind control, telekinesis, force lightning, and summoning force ghosts, many never before seen in a mod.\r<br /> - A custom voiced dwemer sphere follower, who is an integral part of the main questline.\r<br /> - Includes Magicka Sabers, for the full force using experience, made compatible with this mod.\r<br /> - Teach your followers force powers, and instruct them to toggle some of them for your tactical advantage.\r<br />\r<br />[center][b][size=32][color=grey]--Mod Information--[/color][/size][/b][/center]\r<br />\r<br />[i]The Force, that mysterious thing that lives within all of us and...[/i] kark it, this is an excuse to put force powers in the game, enough said. This adds several iconic force powers including force push, force lightning, repulse, force speed, force healing and more. What stops you from using the vanilla Skyrim spells and pretending you ask? True, none of the force powers are really all -that- different from Skyrim spells. In fact, Sparks is pretty much force lightning. However, Lightning Bolt the spell is a charged single shot power. The higher up into the game you get, the less Skyrim spells look anything like what a fabled force user would use.\r<br />\r<br />So, enter the Way of the Force. Not only do these spells look more like the force powers they are styled after, with force push being a spell not a shout, repulse being centered on you and bursting outward, force lightning being able to be held like Sparks was, but with the power of the higher level spells, they also increase in power and function as you level up.\r<br />\r<br />All spells, once learned from a &#34;holocron&#34;, which you find in the world hidden at various special sites, will allow you to meditate to learn the higher level versions of those spells as you progress in the skill associated with it. So without further adieu, the powers.\r<br />\r<br />[i]But first[/i]... I want to thank:\r<br /> - [b]avenger86[/b], who created the first force powers mod, for giving me access to his work. He also created the original holocrons, including the work on the sith holocron shown in the primary screenshot. Please support his work, and go to the bottom of this mod for the recommended mods, including many of his.\r<br /> - [b]Lord Haun[/b], who is both the inspiration for creating this mod as well as a very generous modder. He has allowed a version of magicka sabers to be included into this mod, so that I can get force powers and NPC&#39;s working with magicka sabers. Please, still check out his mod. He&#39;s working on some awesome updates.\r<br />\r<br />[center][b][size=32][color=grey]--Force Powers--[/color][/size][/b][/center]\r<br />\r<br />[b][color=green]Meditation[/color][/b] - Your guaranteed first power, meditate is a lesser power with infinite uses. It has a number of uses. It will allow you to recharge mana much more quickly, and it will allow you to learn all of the higher powered spells of the list below. (You MUST meditate to gain the advanced levels, do not ask why you don&#39;t have them if you never use this power.) The cost for using this ability however is that it slows you down considerably. While the effect sometimes does not activate outside of combat, it will cause a significant reduction of speed in combat, getting you killed.\r<br />Note: The easiest holocron to find is the telekinesis holocron, found at the guardian stones (between the theif, mage, and warrior stones). I suggest going there first. \r<br />\r<br />[b][color=green]Telekinesis[/color][/b] - Starting out as a novice spell, you gain telekinesis, which allows you to pick up objects and sling them about, and fire them off. This is a pretty vanilla style telekinesis effect, but at a much lower level. All telekinesis powers use Alteration as the casting skill.\r<br /> - [b][color=green]Force Push (Padawan)[/color][/b] - At apprentice level, you can meditate and gain Force Push. This allows you to push enemies away, but it isn&#39;t extremely powerful. It will be great for getting breathing room though.\r<br /> - [b][color=green]Force Repulse (Knight)[/color][/b] - At adept level, you will be able to cast repulse, which will blast enemies back all around you. This is very useful for when you are being mobbed by many enemies, but may be slow to activate if in a terribly laggy situation already. Be warned, sending 20 enemies flying back tends to make some machines stutter.\r<br /> - [b][color=green]Force Grip (Knight)[/color][/b] - At adept level, you also gain force grip, which allows you to grab and hold a target of your choosing before tossing them away. While holding an enemy, you deal damage from crushing them, but you can hold followers and even throw them without causing them to think you are attacking them. A first person style is included as force grip acts strange in first person, this version deals no damage to anyone.\r<br /> - [b][color=green]Force Wave (Master)[/color][/b] - At expert level, you will gain the ability to use a higher level force push, that is not only more powerful, but when it hits, it will burst like a repulse, causing even more havoc. It comes with the same warning as above.\r<br />\r<br />[b][color=cyan]Malacia (Padawan)[/color][/b] - Once you gain the ability to force slow, you are able to alter the body processes of a target. In this case, you slow down a target significantly. By waving your cursor over a group of enemies, you can hit each one, allowing you to keep multiple enemies at bay. This power does not cause harm, and is considered a use of the lightside of the force, however concentrating on the enemy may cause extreme nausea and staggering. All powers under this tree are considered Alteration spells.\r<br /> - [b][color=cyan]Force Stun (Knight)[/color][/b] - At adept level, you can begin to have a more serious impact on an enemy. By targeting an enemy, you can cause their body processes to shut down temporarily, paralyzing them. Again, because this causes no harm to the target, it is usually considered a use of the lightside of the force.\r<br /> - [b][color=cyan]Force Stasis (Master)[/color][/b] - At expert level, you are able to effect an unprepared mind and put them into a deep coma-like sleep. The target has no idea what is going on around them during this time, and will simply fall down in place and sleep. Considered a lightside use of the force, it can come with some nasty implications if used for the darkside, as the target will not be able to defend themselves. Force Stasis cannot be used against a target that is already in combat.\r<br />\r<br />[b][color=red]Force Lightning (Apprentice)[/color][/b] - While telekinesis is unique in that it has a novice level starting spell, force lightning and most others start at apprentice level, and are earned from the holocrons as such. Force lightning is a concentration spell, like Sparks, but it has a far longer range, and damage. At its first rank, it works like a constant stream (and slightly less powerful) Lightning Bolt spell. All force lightning powers use Destruction as the casting skill.\r<br /> - [b][color=red]Force Lightning (Assassin)[/color][/b] - Starting at adept level, your force lightning will get more powerful, and at close range, you will cause enemies to stagger and fall to their knees.\r<br /> - [b][color=cyan]Electric Judgement (Knight)[/color][/b] - Start at adept level, a lightside user of the force can begin to learn how to channel other emotions aside from anger into their force lightning. This creates electric judgement, an ability that weakens an enemy. It acts much like the Apprentice level Force Lightning, but is more powerful, and deals secondary damage to stamina instead of magicka.\r<br /> - [b][color=red]Force Lightning (Darth)[/color][/b] - At expert level, your mastery of force lightning is complete. Now your lightning arcs to new targets, and you can strike multiple enemies with it at once. You can truly be a malicious user of the darkside now.\r<br /> - [b][color=cyan]Electric Judgement (Master)[/color][/b] - At expert level, the lightsider shows much more mastery in the ability to use Electric Judgement. It is equivalent to the Assassin level darksider ability in how it acts, but it is much more powerful. Unlike the Darth level version, it does not strike multiple targets.\r<br />\r<br />[b][color=red]Kinetite (Apprentice)[/color][/b] - Once you start down this path of study, you learn volumes about the darkside. The first ability allows you to concentrate the darkside into a ball of energy that you may hurl at enemies. This ball of energy deals damage and oftentimes knocks them off their feet for a short time.\r<br /> - [b][color=red]Force Drain (Assassin)[/color][/b] - At adept level, the darksider gains the ability to draw life force away from a target. It will drain health, stamina, and magicka, and give it to the caster. Masters of this technique could keep it going indefinitely as the magicka drained would eventually outweigh the magicka used.\r<br /> - [b][color=red]Force Destruction (Darth)[/color][/b] - At expert level, a darksider may gain the ability to concentrate the darkside into a field of energy that when hurled, blasts all in its path. Dealing huge amounts of damage in a wave, this ability can literally disintegrate an enemy.\r<br />\r<br />[b][color=cyan]Force Healing (Padawan)[/color][/b] - Once you gain the force healing holocron, you are given the ability to heal yourself in much the same manner as the Healing spell from novice levels. Instead of charging your heals, you simply hold the button down. All force healing powers are quite obviously Restoration spells.\r<br /> - [b][color=cyan]Force Healing (Knight)[/color][/b] - At adept level, you get the ability to not only heal yourself for more damage at once, but you can also cure poisons and diseases as well.\r<br /> - [b][color=cyan]Force Heal Other (Knight)[/color][/b] - Also with the Knight version of force healing, you can now use the same spell on an ally instead.\r<br /> - [b][color=cyan]Force Healing (Master)[/color][/b] - At expert level, you gain the ability to not only heal yourself, and your allies, but you can do so at the same time. Healing your allies for a lesser amount at the same time you heal yourself. This also cures poisons and diseases.\r<br />\r<br />[b][color=green]Force Speed (Padawan)[/color][/b] - Once you gain this holocron, you are able to use a set of lesser powers infinitely per day. These powers all cost mana in some form or another, and are considered Restoration spells despite functioning as powers (and using the Z key to activate). Force Speed is the first power, and allows you to run faster and attack faster for 30 seconds. All powers in this tree are considered restoration.\r<br /> - [b][color=green]Tutaminis (Knight)[/color][/b] - A seldom publicized but often flaunted force technique is the ability to absorb energy and redirect it. Tutaminis is a power ability gained at adept level that increases all energy resistances by 50%, as well as absorbing 50% of any spell thrown at you, and converting it to magicka. The downside to this power is that while activated (it can be toggled), you cannot regenerate magicka at all, no matter your equipment or buffs. You can only gain magicka through absorbing spells. You also lose all magicka when you first activate it.\r<br /> - [b][color=green]Force Bubble (Master)[/color][/b]  - A powerful protection power of a force user, at expert level, you can throw up a protective bubble of force for a short three second burst which will greatly decrease the amount of damage you take during that time. It acts like a full body ward.\r<br />\r<br />[b][color=green]Mind Trick (Padawan)[/color][/b] - Once you gain this ability, you can use Mind Trick to increase your persuasive abilities during dialog. If you know you will need to use persuasion, or you came to a persuasion dialog and exited, you can use this ability to increase your speech skill. All powers in this tree are considered illusion.\r<br /> - [b][color=cyan]Calm Emotions (Knight)[/color][/b] - At adept level, you gain the ability to calm the emotions of others. By concentrating on an area, you can cause enemies to become passive, allies to become fearless, and dispel any fear effects on the targets. The effect lasts for thirty seconds after you stop concentrating.\r<br /> - [b][color=red]Force Corruption (Assassin)[/color][/b] - At adept level, a darksider is able to begin turning the mind effecting abilities of most jedi into a corrupting darkside influence. Instead of calming a target like the jedi&#39;s version, a darksider will make the target&#39;s emotions erupt. The target becomes fearful and runs, while those around the target become enraged, and lash out at the nearest target. This sewing of madness can turn allies against one another.\r<br /> - [b][color=cyan]Battle Meditation (Master)[/color][/b] - At expert level, you can use battle meditation to buff your allies, making them fearless in combat, and making them regain magicka and stamina more quickly. You also regain magicka and stamina more quickly as a result of your link to them. The effect lasts for fifteen seconds after you stop maintaining it.\r<br /> - [b][color=red]Dominate Mind (Darth)[/color][/b] - As a powerful darkside variant of mind trick, at expert level, you gain the ability to dominate the mind of an enemy. Choosing a single target, who could be friendly already or even an enemy, you gain control of their actions. They will fight for you against enemies, and perform actions like stealing for you, though they will keep the items. They will only stay under your spell for one minute or until killed, during which time you cannot dominate another target.\r<br />\r<br />[b][color=green]Force Projection (Padawan)[/color][/b] - Once you gain knowledge of this line of using the force, you learn just how to effect the minds of your targets, but to cause illusory changes to your environment, making things appear to be where they are not, or not there at all. Force Projection is the first of those, which allows you to create a small moat of light and sound that will make an enemy think there is something there. This can be extremely useful for putting an enemy&#39;s attention elsewhere.\r<br /> - [b][color=green]Force Cloak (Knight)[/color][/b] - At adept level, you can now begin to bend lightwaves and soundwaves around you, to obscure yourself from sight. While sneaking, the sound you make will be muted, and your form will be obscured from sight. This ability is toggled, so that after discovery, you only need to re-enter sneaking to re-cloak yourself.\r<br /> - [b][color=green]Force Phantasm (Master)[/color][/b] - At expert level, you learn how to create seemingly real manifestations of light and sound that your enemy will be fooled by. While the illusion cannot cause real harm, the enemy will not know that, and will continue to attack the illusion. This is extremely useful as a distraction, keeping a group of enemies busy.\r<br />\r<br />[b][color=green]Empower Weapon (Padawan)[/color][/b] - Once you gain knowledge of force conjuration, you will be able to draw force energy into unpowered and unenchanted weapons. This will make your weapon deal extra damage, as well as giving you the ability to deflect physical attacks and spells (you gain an invisible enchanted shield). Your empowered weapon, as a bonus, will gain extra effects as a bound weapon would when you gain the perks.\r<br /> - [b][color=green]Summon Force Ghost (Knight)[/color][/b] - Starting at adept level, you can summon a force ghost, a spirit that is alive through the force and able to still act upon the physical world. You are able to give them physical presence, and in turn they will fight for you. If you follow the path of the darkside, you will begin calling on the spirits of ancient dead sith instead of jedi.\r<br /> - [b][color=green]Shatterpoint (Master)[/color][/b] - At expert level of conjuration, you gain the ability to push energy into the inperceptible cracks in armor, bone, and flesh, causing the points to burst open. This deals a large amount of damage, and with perks will also cause the target to lose a portion of their armor rating. Shatterpoint can only be used in melee range, as it requires a &#34;tap&#34; to push the energy in.\r<br />\r<br />[b][color=green]Force Blinding (Padawan)[/color][/b] - Once you learn this ability, you begin to learn to conjure force force energy into manifestations of light and fire. Force Blinding concentrates this energy into your palm, allowing you to see by the light coming from your hand. This is extremely useful for exploration, but more than that, it can also be used offensively. By releasing the mote of light, you will blind and stagger your enemies, giving you the precious seconds to escape or strike with fury.\r<br /> - [b][color=green]Pyrokinesis (Knight)[/color][/b] - At adept level, your mastery over light has extended to mastery over fire. By concentrating large amounts of heat, you can cause the air in front of you to erupt into flames. This will burn any enemy inside of it, but also with Elemental Mastery, it will continue to deal fire damage to a target hit by burning them for 15 seconds.\r<br /> - [b][color=green]Combustion (Master)[/color][/b] - At expert level, you are capable of concentrating the force into a distant object, forcing it to explode. This is a powerful ability that can be used at great distances. Virtually any object can be made to explode, from the dirt and stone, to pottery and trinkets, to people themselves.\r<br />\r<br />[b][color=green]Force Sight[/color][/b] - The first of the stand alone powers, force sight is a toggle-able illusion power that allows you to see in the dark, as well as seeing creatures in your surroundings, even undead. This is a powerful ability, and will counter force blinding. It is considered an Adept level power for reducing its mana cost.\r<br />\r<br />[b][color=green]Force Enlightenment[/color][/b] - Another stand alone power, this one buffs your ability to use force powers and other spells. It will increase your magicka regeneration rate, as well as lowering the magicka cost of all powers. It is considered an Expert Restoration power, and cannot be active at the same time as Force Valor or Force Rage.\r<br />\r<br />[b][color=cyan]Force Valor[/color][/b] - The second in the line of standalone buffing powers, this one increases your ability to withstand damage. Your armor will be increased by 100 (up to 300 with mage armor perks), and you will gain increased health regeneration. You will also gain an increased magic resistance during this time. This is considered a lightside Expert Alteration power, and cannot be active at the same time as Force Enlightenment and Force Rage.\r<br />\r<br />[b][color=red]Force Rage[/color][/b] - The last of the stand alone buffing powers, this one increase melee damage and speed, and also increase stamina regeneration. Force Rage also increases your effectiveness with destruction spells, and gives you a resistance to shock damage. This is considered a darkside Expert Destruction power, and cannot be active at the same time as Force Enlightenment or Force Valor.\r<br />\r<br />[center][b][size=32][color=grey]--Finding Holocrons--[/color][/size][/b][/center]\r<br />\r<br />In order to gain access to these powers, you will first need to find the holocrons themselves. When you enter the game, you will be sent a note containing information on how to start your quest. Follow the quest to get hints on where to find the holocrons. The first holocron you find will also grant you meditation, which is used to learn all the higher level versions of your powers. You must use the holocrons from your inventory to learn the force powers inside. They are found under books in your inventory.\r<br />\r<br />If you really -must- succumb to the darkside of the force (the console) and cheat, you can type &#34;help holocron&#34; to find the ID&#39;s of the different holocrons, and add them to your inventory. However, you must drop at least one holocron and pick it back up to trigger the event that gives you meditation. I would prefer people find the hidden holocrons though, it makes it more fun.\r<br />\r<br />There are other holocrons you can make, using a smelter, with dwarven ingots, soul gems, and glow dust. These holocrons show up under the scrolls section of your inventory, and are used to teach your followers new force powers. Be forewarned, once they know the knowledge of the force, they will be able to use that ability at any time. You must already know the power to teach it to a follower, and the follower must have enough skill in the appropriate school of training to learn it.\r<br />\r<br />[center][b][size=32][color=grey]--The Lightside and Darkside--[/color][/size][/b][/center]\r<br />\r<br />Recently (as of v1.3), two new factions have been added and will be expanded upon. These factions are the jedi and sith. They have been at war for many years. They vie for control over the force, and the ability to govern it for the betterment of man and mer, or to enslave them. You can begin to sway the battle to one side or another by your actions.\r<br />\r<br />Right now, you will find jedi and sith scattered throughout Skyrim, mostly working with groups that share some of their interests. These scouts of sorts will eventually lead to your quest down the light or the dark side. Treat the side you wish to join well, or not. Sith may not care what your intentions are.\r<br />\r<br />For now, the je&#39;daii and siit come with two advantages. They rarely carry holocrons, making it easier to locate the holocrons, without needing to find them at specific places. The other advantage is they use special weapons. Je&#39;daii use the Je&#39;daii Katana, an ancient weapon from before the time of the lightsaber. This sleek weapon is fast, and capable of delivering devastating precision strikes (they deal sneak attack damage as a dagger). The siit sword is heavy, made with alchemy, and while it is massive, the siit are capable of using it in one hand (it is a greatsword treated like a normal sword for wielding). You may also gain these weapons, from the two factions themselves, or through crafting. [i]As of v1.6, je&#39;daii and siit now also carry magicka sabers. While you cannot loot their sabers, you get saber components, which you can use to craft your own.[/i]\r<br />\r<br />[center][b][size=32][color=grey]--Magicka Sabers--[/color][/size][/b][/center]\r<br />\r<br />A new addition to the mod is magicka sabers. Based on the magicka sabers by [b]Lord Haun[/b] found at the bottom of the page, these sabers are almost completely identical except they are made to be compatible with the mod. The magicka sabers can be used in special crafting recipes and with special force abilities.\r<br />\r<br />Making a lightsaber is slightly different. Found under the Imperial section of the forge, they use quicksilver ingots, soul gems, precious gems which act as focusing crystals, and special cores which are crafted at the forge as well. They require the Arcane Smithing perk in order to craft, as they come pre-enchanted. Most of the parts you need can be found on force using enemies who are using sabers.\r<br />\r<br />[i]-The magicka sabers here will not conflict with the magicka sabers mod. Both can be used side by side, but only the sabers from this mod will function with the powers and abilities in this mod.-[/i]\r<br />\r<br />[center][b][size=32][color=grey]--Installation--[/color][/size][/b][/center]\r<br />\r<br />Simply unpack the main ZIP file into your data folder, same as any other mod, and make sure that &#34;The Force.esp&#34; is checked in your mods list. To uninstall, uncheck &#34;The Force.esp&#34; from your mods list and done. Since all of the assets used in the mod are packed into the BSA file, you&#39;ll never have issues with scripts or meshes hanging around in your data folder.\r<br />\r<br />If you experience any issues with other mods, my suggestion is to place the conflicting mod below mine in load order if the other mod is breaking. If mine is breaking, place mine lower in the mod order. Usually conflicts will be small, such as changing the same location in similar ways. In that case, use your best judgement.\r<br />\r<br />[b]Important update info[/b], going from 1.5 to 1.6 (or higher for future releases), may cause the main quest line to not begin as it should. If you do not receive any note after moving around for a while, and fast traveling, it is suggested that you disable the mod, load your save, save again, exit, re-enable the mod, and then go back into the game. This will cause you to have to re-locate the holocrons, but the quest will make it far easier to do such.\r<br />\r<br />[b]Important[/b]: If you download and install the &#34;Loose Files&#34; optional file, do not that from that point on, you will need to download the Loose Files anytime there is an update to the mod. The loose files override all files in the BSA, meaning you have to update them manually. Only use this option if you are having unresolvable conflicts with other mods.\r<br />\r<br />[center][b][size=32][color=grey]--Future Additions--[/color][/size][/b][/center]\r<br />\r<br />- Dawnguard compatibility patch, especially for Serana.\r<br />- Grand Master and Sith Lord level abilities that you will have to quest to find, and have prerequisites.\r<br />- Improve Heich Kai&#39;s voice set, and include custom dialog for him, including quest dialog.\r<br />- Continue the main quest line, including adding a dungeon starting in blackreach where you find Heich Kai.\r<br />- Force related perks that can modify your force powers and your skills with weapons, including lightside and darkside related perks.\r<br />- *Wishlist* Empower Lightsaber as a unique spell as an addon to both this mod and magicka sabers, to allow you to temporarily enchant the otherwise unenchantable sabers.\r<br />- *Wishlist* The ability to take on an apprentice (or more with UFO?) and teach him or her force powers that you know. **Getting there.**\r<br />- *Wishlist* Some way to sit down and show an animation while meditating.\r<br />- A quest to go down that will have you going down the darkside or lightside, and possible followers at the end of it. **In development**\r<br />- Feel free to make suggestions.\r<br />\r<br />[center][b][size=32][color=grey]--Changelog--[/color][/size][/b][/center]\r<br />\r<br />[b]v1.6.2[/b]\r<br /> - Exported ALL of the quest scripts from the quest, in order to avoid failure points. The scripts now reside in the items themselves.\r<br /> - Heich Kai should no longer create duplicates of himself, report any other odd behavior.\r<br /> - Added higher level Je&#39;daii and Siit NPC&#39;s, including Siit Lords, Je&#39;daii Masters, and specialty NPC&#39;s.\r<br />\r<br />[b]v1.6.1[/b]\r<br /> - Should have fixed failure points in the main quest. If you don&#39;t get the courier, go directly to Dragonsreach to get Farengar&#39;s book instead.\r<br /> - Fixed Heich Kai&#39;s spawn location, as well as giving him his voice files (which seem to have been missing from the original download).\r<br /> - Added the ability to instruct your followers in the force, making them use toggle-able force powers. Force Cloak and Force Sight are still in testing though.\r<br /> - Fixed some compatibility issues with the magicka sabers, including moving their sound assets, and fixing a few of the NIF files.\r<br /> - Changed the empower weapon power so that it no longer gives the defense bonus (in order to fix the perma-enchanting bug), but it will be replaced by perks soon.\r<br /> - I probably forgot a few of the bug fixes I did, but I fixed a bunch of them.\r<br />\r<br />[b]v1.6[/b]\r<br /> - Fixed most of the spells, so they will give proper skill increases with use.\r<br /> - Added the magicka sabers, based on [b]Lord Haun[/b]&#39;s, and made them compatible with the powers and abilities in the mod. They have a new crafting recipe, found under Imperial. They require Arcane Blacksmithing to craft.\r<br /> - Added the new siit holocron model and texture by [b]avenger86[/b].\r<br /> - Created two new quests, one for the main storyline of the quest, the other to help folks track down the various holocrons.\r<br /> - Added Heich Kai, a companion you can request the services of, found in Blackreach. He will be an intregal part of the main story as the mod progresses.\r<br />\r<br />[b]v1.5[/b]\r<br /> - Small bug fixes to various force powers, including making Malacia, Force Speed, and Meditation apply their speed changes immediately.\r<br /> - Small tweaks to various force powers, such as Kinetite, and Force Speed getting a smaller attack speed increase.\r<br /> - Fixed Force Grip finally to work in both first person and third person modes, so you no longer need both versions.\r<br /> - Added a new enemy type, the Thalmor Jen&#39;Jidai (Dark Jedi), which can be found anywhere that the Thalmor mages can be found. They only show up once you hit the high 30&#39;s in level, but they can sometimes carry Holocrons, and they will always carry Sith Swords.\r<br /> - Last but not least, added the ability to make scroll type holocrons that will allow you to teach your followers force powers. Simply create the holocrons at the Smelter, and then use them on the follower you wish to teach.\r<br />\r<br />[b]v1.4[/b]\r<br /> - Integrated the force sight, force drain, pyrokinesis, force cloak, and force corruption powers from avenger86&#39;s mod, with changes to match the format of these force powers.\r<br /> - Changed the holocron textures, based on avenger86&#39;s work with his holocrons. Big thanks to him for supplying them.\r<br /> - Added Force Sight, Force Enlightenment, Force Valor, and Force Rage as stand alone powers.\r<br /> - Added the Kinetite, Malacia, Force Projection, and Force Blinding trees and powers.\r<br /> - Added the Electric Judgement and Force Corruption powers to the existing trees. \r<br />\r<br />[b]v1.3[/b]\r<br /> - Added the empower tree. This is a little more hodge podge. It is a collection of more miscellaneous abilities than anything. It includes Empower Weapon, Summon Force Ghost, and Shatterpoint.\r<br /> - Added Jedi Katanas and Sith Swords. They have their own crafting and tempering recipes, as well as special statistics that are unique among swords.\r<br /> - Added low level jedi and sith NPC&#39;s that can be found in various areas (I&#39;ll leave this as a surprise as to where).\r<br /> - Gave the force push and related powers a debuff, to prevent spamming it. If under the debuff, you cannot push them again, but you will stagger them. The debuff&#39;s time is lowered by the Stability perk.\r<br /> - Holocrons can now be found rarely on jedi and sith. So there&#39;s a new way to find the holocrons, just in case you couldn&#39;t locate them before. Holocrons also -might- show up in certain areas in place of books. \r<br />\r<br />[b]v1.2[/b]\r<br /> - Added the mind trick tree, including mind trick, calm emotions, battle meditation, and the power Dominate Mind to control enemies.\r<br /> - Fixed a bug with the telekinesis and force speed holocrons that wasn&#39;t giving meditation\r<br /> - Changed the force lightning variants to stagger close by enemies instead of deal extra damage since the damage wasn&#39;t being limited by distance. Buffed the main damage slightly to compensate\r<br />\r<br />[b]v1.1[/b]\r<br /> - Added force grip to the telekinesis tree, including a first person version for now, as normal grip as it is acts wonky\r<br /> - Added magicka drain to tutaminis to prevent folks from deactivating it to regain their magicka again and ignoring the major drawback of it\r<br /> - Fixed the effect on Force Healing (Master) to be more visible and vibrant\r<br />\r<br />[center][b][size=32][color=grey]--FAQ--[/color][/size][/b][/center]\r<br />\r<br />[b]Q[/b]: I am not getting the courier quest right away, did something go wrong?\r<br />\r<br />[b]A[/b]: Courier quests are notoriously slow. Sometimes, they will not get to you for many in game days. Play around and don&#39;t worry about it for a while, and eventually it will come to you. If you don&#39;t want to wait, skip to the second step in the quest, and find the book in Farengar&#39;s room.\r<br />\r<br />\r<br />[b]Q[/b]: I can&#39;t get to the dwemer companion Heich Kei, it says he is inside this area, but I can&#39;t get there.\r<br />\r<br />[b]A[/b]: The area that he is in has to be unlocked through the main quest, you can&#39;t enter it yet obviously.\r<br />\r<br />\r<br />[b]Q[/b]: Same as above, but I am looking for a holocron.\r<br />\r<br />[b]A[/b]: Some holocrons are found during normal gameplay. This means you have to complete other quests to unlock the areas.\r<br />\r<br />\r<br />[b]Q[/b]: I got to Heich Kei, but he has no dialog for continuing the quest, what do I do?\r<br />\r<br />[b]A[/b]: That is actually where the quest ended. I am back with Skyrim again and a computer that will run it. I may or may not continue work on this mod. It already exceeded the scope of what I wanted, when I did things other than spells.\r<br />\r<br />\r<br />[b]Q[/b]: If you are done with this mod, can I take over?\r<br />\r<br />[b]A[/b]: If anyone wants to take over the project, you need to make me a strong case. I&#39;m obviously only going to give permission to one person to continue it, so you better make a strong case when you ask for my permission.\r<br />\r<br />\r<br />[center][b][size=32][color=grey]--Recommended Mods--[/color][/size][/b][/center]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/3174]MAGICKA SABERS[/url]... I can&#39;t say that enough. I made this mod specifically because I downloaded this one, and I wanted to make force powers.\r<br />[url=http://skyrim.nexusmods.com/mods/20045]Star Wars Imperial Credits[/url] - I think in terms of the little things, this goes a long way in adding to the immersion of well, it being Star Warsy.\r<br />[url=http://skyrim.nexusmods.com/mods/8010]Sith Academy[/url] or [url=http://skyrim.nexusmods.com/mods/7871]Jedi Temple[/url] Replacers for the College of Winterhold. I just -really- like these, and I am a big fan of this guy&#39;s art right now.\r<br />[url=http://skyrim.nexusmods.com/mods/10903]Star Wars Moon Replacers[/url] - I personally like this pack more than the featured one on the Top Five Skyrim Mods of the Week. It adds variety, not -just- the Deathstar.\r<br />[url=http://skyrim.nexusmods.com/mods/6602]Sith Code[/url] and [url=http://skyrim.nexusmods.com/mods/6616]Sith Banners[/url] - Remember that Cult of Sith(is) crack I made? Make it more of a reality with those.\r<br />\r<br />[center][b][size=32][color=grey]--Optional Files--[/color][/size][/b][/center]\r<br />\r<br />SKYRE Compatibility Patch - Made by [url=http://skyrim.nexusmods.com/users/380177]rylasasin[/url], changes the Je&#39;daii Katana to act as a katana when used in conjunction with SKYRE.",
  "categoryId": "75",
  "version": "v1.6.2",
  "author": "SephDragoon",
  "createdUnix": "1348531113",
  "updatedUnix": "1351891374",
  "containsAdultContent": false,
  "uploadedBy": "SephDragoon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92021",
      "name": "The Force v1-4",
      "version": "v1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2048",
      "fileName": "The Force v1-4-24585-v1-4.zip",
      "uploadedUnix": "1349378268",
      "modVersion": "v1.4",
      "virusScanUrl": "https://www.virustotal.com/file/f5d215ba6e039af3393b191d282cf7602238b0551195b2fafbe0cea11ae7989f/analysis/1407203763/",
      "changelogHtml": " Added the Electric Judgement and Force Corruption powers to the existing trees. <br/> \n Added the Kinetite, Malacia, Force Projection, and Force Blinding trees and powers. <br/> \n Added Force Sight, Force Enlightenment, Force Valor, and Force Rage as stand alone powers. <br/> \n Changed the holocron textures, based on avenger86\\'s work with his holocrons. Big thanks to him for supplying them. <br/> \n Integrated the force sight, force drain, pyrokinesis, force cloak, and force corruption powers from avenger86\\'s mod, with changes to match the format of these force powers. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Force%20v1-4-24585-v1-4.zip?fid=92021&ttl=1535795592&ri=8192&rs=8192&setec=89937fd8eac6225671ddae8cbc636ff0"
    },
    {
      "fileId": "93169",
      "name": "The Force v1-5",
      "version": "v1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2054",
      "fileName": "The Force v1-5-24585-v1-5.zip",
      "uploadedUnix": "1349910027",
      "modVersion": "v1.5",
      "virusScanUrl": "https://www.virustotal.com/file/c132d5e3a04f347910e1b729946c389c476fbf2b30256df2674dc18400f1f31e/analysis/1407214223/",
      "changelogHtml": " Small bug fixes to various force powers, including making Malacia, Force Speed, and Meditation apply their speed changes immediately. <br/> \n Small tweaks to various force powers, such as Kinetite, and Force Speed getting a smaller attack speed increase. <br/> \n Fixed Force Grip finally to work in both first person and third person modes, so you no longer need both versions. <br/> \n Added a new enemy type, the Thalmor Jen\\'Jidai (Dark Jedi), which can be found anywhere that the Thalmor mages can be found. They only show up once you hit the high 30\\'s in level, but they can sometimes carry Holocrons, and they will always carry Sith Sw <br/> \n Last but not least, added the ability to make scroll type holocrons that will allow you to teach your followers force powers. Simply create the holocrons at the Smelter, and then use them on the follower you wish to teach. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Force%20v1-5-24585-v1-5.zip?fid=93169&ttl=1535795593&ri=8192&rs=8192&setec=7431194953855fbaebc86adf702f156e"
    },
    {
      "fileId": "93173",
      "name": "SKYRE Compatibility Patch v1-0",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "SKYRE Compatibility Patch v1-0-24585-1-0.zip",
      "uploadedUnix": "1349911234",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7f23aad312f622c4d6800c77789c29fb962f3e15ce54b3d6011febf2ffaa21ea/analysis/1407214265/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SKYRE%20Compatibility%20Patch%20v1-0-24585-1-0.zip?fid=93173&ttl=1535795593&ri=8192&rs=8192&setec=60d816e1ae2b80854cef78c1b80cc0e8"
    },
    {
      "fileId": "94381",
      "name": "The Force v1-6",
      "version": "v1.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9930",
      "fileName": "The Force v1-6-24585-v1-6.zip",
      "uploadedUnix": "1350520905",
      "modVersion": "v1.6",
      "virusScanUrl": "https://www.virustotal.com/file/de7f8bbbb01f42b84d9e1699eecf639b2c2b313c7914b96fab497414cda3f18a/analysis/1407227172/",
      "changelogHtml": " Fixed most of the spells, so they will give proper skill increases with use. <br/> \n Added the magicka sabers, based on Lord Haun\\'s, and made them compatible with the powers and abilities in the mod. They have a new crafting recipe, found under Imperial. They require Arcane Blacksmithing to craft. <br/> \n Added the new siit holocron model and texture by avenger86. <br/> \n Created two new quests, one for the main storyline of the quest, the other to help folks track down the various holocrons. <br/> \n Added Heich Kai, a companion you can request the services of, found in Blackreach. He will be an intregal part of the main story as the mod progresses. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Force%20v1-6-24585-v1-6.zip?fid=94381&ttl=1535795594&ri=8192&rs=8192&setec=d8bc97c6c1d8dd9cd8dcb05028c831a7"
    },
    {
      "fileId": "95205",
      "name": "The Force v1-6-1",
      "version": "v1.6.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12323",
      "fileName": "The Force v1-6-1-24585-v1-6-1.zip",
      "uploadedUnix": "1350929820",
      "modVersion": "v1.6.1",
      "virusScanUrl": "https://www.virustotal.com/file/0f6de0a34ea73282a2cfab1fba2816854fb2399dcca5cd4a30d848872f36a9e8/analysis/1407232269/",
      "changelogHtml": " Should have fixed failure points in the main quest. If you don\\'t get the courier, go directly to Dragonsreach to get Farengar\\'s book instead. <br/> \n Fixed Heich Kai\\'s spawn location, as well as giving him his voice files (which seem to have been missing from the original download). <br/> \n Added the ability to instruct your followers in the force, making them use toggle-able force powers. Force Cloak and Force Sight are still in testing though. <br/> \n Fixed some compatibility issues with the magicka sabers, including moving their sound assets, and fixing a few of the NIF files. <br/> \n Changed the empower weapon power so that it no longer gives the defense bonus (in order to fix the perma-enchanting bug), but it will be replaced by perks soon. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Force%20v1-6-1-24585-v1-6-1.zip?fid=95205&ttl=1535795594&ri=8192&rs=8192&setec=72bde0f466b4914780f9f18fd83aff7e"
    },
    {
      "fileId": "96793",
      "name": "The Force v1-6-2",
      "version": "v1.6.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12333",
      "fileName": "The Force v1-6-2-24585-v1-6-2.zip",
      "uploadedUnix": "1351661602",
      "modVersion": "v1.6.2",
      "virusScanUrl": "https://www.virustotal.com/file/42dd4a5681d2fe5d1a69c9d23a3f9126de179f74e9acfc4d297dd9822b027ea6/analysis/1407243251/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Force%20v1-6-2-24585-v1-6-2.zip?fid=96793&ttl=1535795594&ri=8192&rs=8192&setec=cb8f9a37e0da166eda63a9afb7a4cf39"
    },
    {
      "fileId": "97181",
      "name": "Loose Files",
      "version": "v1.6.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8179",
      "fileName": "Loose Files-24585-v1-6-2.zip",
      "uploadedUnix": "1351891374",
      "modVersion": "v1.6.2",
      "virusScanUrl": "https://www.virustotal.com/file/995a34eae1ffc4a3c0d3ae685fdc44a33abbafaa8cfdecbb1daff13e2ab089d6/analysis/1407246613/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Loose%20Files-24585-v1-6-2.zip?fid=97181&ttl=1535795595&ri=8192&rs=8192&setec=efc670bb49258ab2f207c71f4fc99dc1"
    }
  ]
}