{
  "modId": 24590.0,
  "modName": "Subjugation",
  "summary": "\\\"Control friend or foe alike, bring them under your (nearly) absolute control.\\\"\r\n\r\nThey will follow you, fight for you, wait for you, carry your burdens... whether they want to or not.  If they\\'re an NPC (or a draugr), they can be subjugated.  Think of this the \\\"Living\\\" version of Dead Thrall.",
  "descriptionHtml": "October 10, 2012\r\n\\\"Subjugation\\\" has been featured in \\\"Hidden Gems #1\\\". (3 minute mark).\r\n\r\n[youtube]aaXLBMZRnV8[/youtube]\r\n\r\nUPDATE, 2.1, September 27, 2012\r\n- Increased the maximum number of subjugations to 15.  Though, really.  You actually want to have THAT many people following you at once?\r\n- Added a subjugate total to the group menu so you can see at a glance how many NPCs you currently have under your control.\r\n- Corrected a mis-assignment of commands in the group menu.  The Follow, Wait, and Relax buttons were giving the wrong orders.\r\n- Added a confirmation dialog to the Relese All order in the group menu, to ensure that\\'s what you truly want to do.  Accidents do happen, I\\'m as guilty as the next.\r\n- Removed the \\\"Playable\\\" flag from the tokens used by the scripts so they don\\'t show up when browsing a subjugate\\'s inventory.\r\n\r\nUPGRADING FROM AN OLDER VERSION:\r\nYou will need to either:\r\na) start a new game,\r\n\r\nor \r\n\r\nb) (the longer method but it\\'ll save you from starting over): \r\nRelease all of your subjugates.  Save your game.  Exit.  Open the game\\'s title screen and uncheck this mod from the data files.  Restart Skyrim.  Save your game again.  Back to the data files, re-check the mod so it loads.  Back into the game.  Now you\\'ll have to give yourself the spell again.  Either go back to Dragonsreach where the spell tome is, or you can just use the console.  Type: \\\"help Subjugate\\\" in the console.  I think the code is xx000d63, but to be safe, just use the help code.\r\n\r\nSUBJUGATION\r\n\\\"Control friend or foe alike, bring them under your (nearly) absolute control.\\\"\r\n\r\nThey will follow you, fight for you, wait for you, carry your burdens... whether they want to or not.  If they\\'re an NPC (or a draugr), they can be subjugated.  Think of this the \\\"Living\\\" version of Dead Thrall.\r\n\r\nREQUIREMENTS\r\nNone, other than the base game.  Although the screenshots above show some items from the Dawnguard Expansion, Dawnguard is NOT REQUIRED for this mod.  However, I do suggest you have some sort of follower enhancement mod, such as the Extensible Follower Network, which is available on the Nexus (http://skyrim.nexusmods.com/mods/12933)  There are other mods out there (Ultimate Follower Overhaul for example, http://skyrim.nexusmods.com/mods/14037), and again, it\\'s not absolutely necessary, but without one of these, you will be serverely limited on how many NPCs you can actually have following you at one time.\r\n\r\nINSTALLATION (Does not apply if you acquire this through Steam Workshop)\r\nLocate your SKYRIM installation.  For most users, it will be \\\"c:\\\\program files (x86)\\\\Steam\\\\SteamApps\\\\Common\\\\Skyrim\\\\\\\"\r\n\r\nDrop the ESP and the BSA into your Skyrim\\\\Data folder, and activate the ESP file from the title screen of the game (Or use Nexus Mod Manager).  The scripts in the Scripts folder of this archive is only included in case the BSA doesn\\'t work for whatever reason.\r\n\r\nOBTAINING THE SPELL\r\nFor now, the spell is easily obtained by going to Dragonsreach.  It\\'s on the table where you first meet Farengar.  I\\'ll likely change this in a future version, considering this is a rather easy way to obtain such a powerful spell.  Might have it be a quest reward, possibly obtained from the college after completing the master illusion ritual.\r\n\r\nSPELL MECHANICS\r\nThis spell will work on any NPC.  So, no animals, creatures, skeletons, etc.  No DRAGONS.  Just no.  Dragons have an intelligence far above that of human/mer, so just no.  Though it would be amusing... or not.  \r\n\r\nIt WILL work on the draugr, since I do believe they retain some sort of awareness, and they WERE human at one time.  Want Jyrik Gauldurson or Red Eagle fighting at your side?  Why not?\r\n\r\nIt\\'s a master-level spell, so be prepared to spend a lot of magicka in casting it.  The mean cost is 291 magicka without any perk modifier helping out.  But again, realize this is stripping away someone\\'s free will.  Of course it\\'ll take a lot of power, right?\r\n\r\nAlso, as of Version 1.1, the use of this spell on most NPCs is considered a crime, so either have a strong sneak skill (enhanced by worn enchantments for good measure), or be ready to fight with anyone who hears the victim\\'s cries.  Those of you who don\\'t want the spell to work this way:  Open the console, and type (without the quotes) \\\"set MSSubjugateIsCrime to 0\\\".\r\n\r\nOnce you have an NPC under your control, activating them brings up a menu with a list of options: (cancel), follow, wait, relax, release, and optionally, (group).  All of them are self-explanitory, save for group--group will only show up when you have more than one subjugate.\r\n\r\nWhich leads us to the group menu.  The first time the spell is cast, you are also given a second spell, an alteration spell called \\\"Subjugate Remote Control\\\".  This allows you to direct all of your subjugates from afar.  Stuck in Blackreach with your subjugates waiting for you elsewhere?  Casting this spell gives you a menu, from which you can summon all of them to you.  They all pop to your side, ready to help you fend off the horde of Falmer who\\'ve backed you into a corner.\r\n\r\nThe group menu works simliar to the single subjugate menu, save for the fact it effects all of your subjugates.  (cancel), (individual), summon, wait, relax, or release are your options here.\r\n\r\nIn both cases, having them wait or relax adds a misc. quest objective indicating the location of the subjugate(s) who are waiting for you.  It makes it easy when you can\\'t remember where you left someone.  Naturally, this quest objective is cleared when there are no subjugates waiting for you.\r\n\r\nThat leads us to one further menu, \\\"Individual\\\".  (This particular part of the mod has had me hung up for a couple of weeks, fighting with the logistics of it.  The current method of selection isn\\'t the greatest, but it does work)  This brings up a dialogue where you can cycle through all of your current subjugates, and from there direct them individually.  So, say you\\'ve left Ralof in the Ragged Flagon, and you\\'re in Markarth, you can summon him instantly to your side.  Doing so also gives him a follow order.\r\n\r\nNOTES/CAUTIONS/ISSUES\r\nAS of release 1.1, the limit is 15 subjugates at one time, increased from 10 (governed by the number of quest aliases I\\'ve allocated).  Even with that number, to take full advantage, you will need an additional mod that will allow you to have more than six NPCs/animals following you.  At present I use the Extensible follower Framework (http://skyrim.nexusmods.com/mods/12933), which is amazing for dealing with recruited followers.  Again, this isn\\'t absolutely necessary, but you will be limited to how many people are actually able to follow you at one time.  I might seem to be repeating myself here, having already mentioned this up top, but this is an important factor that will determine how much you get out of this plugin.\r\n\r\nGeneric NPCs (Bandits, draugr, guards, etc...) will reset their outfits periodically.  So careful what you give them, no guarantees they will keep it.  I would of course love to hear peoples\\' experience with this.  Does the outfit reset, or the entire inventory?\r\n\r\nAs noted about the relax option, it sometimes doesn\\'t work, i.e. they behave like they\\'ve been given a wait order.  Not sure why that happens.\r\n\r\nThe relationship rank with the player sometimes doesn\\'t reset properly when released.  I.e. you release a bandit, they won\\'t attack you.  Not sure how to sort that out, and of course I\\'m open to advice on how to fix it.\r\n\r\nSubjugating important NPCs may have unexpected consequences, i.e. Subjugating Ulfric Stormcloak before you do any of the Civil War quest.\r\n\r\nSometimes activating a subjugate will have them enter dialogue with you, although there is supposed to be a dialogue blocker in place.  Still not sure why this happens, considering the Subjugation quest has 95 priority.  Anyone with suggestions on how to fix this for good, I\\'m all ears.\r\n\r\nISSUES/PROBLEMS/CONCERNS\r\nBefore making a comment saying, \\\"This mod sucks\\\", or, \\\"This doesn\\'t work\\\", realize that neither of those comments will really help me to help you.  Something not working?  Details really help me to sort out if there is an issue.  Most cases, a subjugation that doesn\\'t work.  Situations like that, I\\'d like to know who you were trying to subjugate, so I might try it myself and figure out why.\r\n\r\n",
  "categoryId": "33",
  "version": "2.1",
  "author": "SteamCanuck",
  "createdUnix": "1348551697",
  "updatedUnix": "1348776614",
  "containsAdultContent": false,
  "uploadedBy": "steamcanuck",
  "primaryFile": null,
  "files": [
    {
      "fileId": "90352",
      "name": "Subjugation",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22",
      "fileName": "Subjugation-24590-2-0.rar",
      "uploadedUnix": "1348553076",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/1524634000cd76e713717e36db4ef810efa131c87d4591944240c4f08da50eff/analysis/1407185887/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Subjugation-24590-2-0.rar?fid=90352&ttl=1535795602&ri=8192&rs=8192&setec=579d44066057119b822dc56209b0ff63"
    },
    {
      "fileId": "90656",
      "name": "Optional Hostile Effect",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22",
      "fileName": "Optional Hostile Effect-24590-2-0.rar",
      "uploadedUnix": "1348728553",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/6a3537ee4fba8bd251b4d0f73e200ea0b2e5a6f78e57009f4739bcf6276e2173/analysis/1407189376/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Optional%20Hostile%20Effect-24590-2-0.rar?fid=90656&ttl=1535795602&ri=8192&rs=8192&setec=d5b5a45a4d1c14e5e3f4c4d50d5891bb"
    },
    {
      "fileId": "90747",
      "name": "Subjugation",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24",
      "fileName": "Subjugation-24590-2-1.rar",
      "uploadedUnix": "1348776614",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/864a9e555e4e34d7ef535679984702e9ff5c372879b8ccf57550845b4e708bd0/analysis/1407190327/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Subjugation-24590-2-1.rar?fid=90747&ttl=1535795603&ri=8192&rs=8192&setec=10668de884ca59d18e04fadcf89e5a17"
    }
  ]
}