{
  "modId": 24618.0,
  "modName": "Kalicolas Live Action Intro HD",
  "summary": "[B]Description[/B]\r\n\r\nReplaces the Bethesda Logo intro with the live action trailer in HD quality, 720p or 1080p",
  "descriptionHtml": "[img]http://farm9.staticflickr.com/8317/8024632659_c06144a7ab_c.jpg[/img]\r\n\r\n[B]Description[/B]\r\n\r\nReplaces the Bethesda Logo intro with an edited version of the live action trailer in HD quality, 720p or 1080p\r\n\r\nThis is the video that replaces the Bethesda Logo intro\r\n[youtube]vYqau1dqsF8[/youtube]\r\n\r\n[b]Who am I and what do I do?[/b]\r\n\r\nMy name is Ronnie. I call my self Kalicola on the web. I am 33 years old and work as an animator at IO-Interactive in Denmark, and have just finished my work on Hitman Absolution. I have a girlfriend and two kids, meaning that I have NO freetime at all.\r\n\r\n[b]Why am I making this mod?[/b]\r\n\r\nI love the live action trailer that was released when the game came out. So I want that trailer to be the first thing I see when I boot up the game. It sets the perfect tone for the game, instead of that anti climatic logo animation followed by a menu screen.\r\n\r\nAlso, I\\'m quite curious about making mods. And since this is my first try at uploading a mod, I want it to be something simple, just to get a good start, and to check out the workflow in submitting a mod.\r\n\r\n[img]http://farm9.staticflickr.com/8459/8024633169_bb46693825_c.jpg[/img]\r\n\r\n[b]Why don\\'t I just use one of the other simular mods out there?[/b]\r\n\r\nThere\\'s about 3 other mods out there that does the exact same as this one. I tried them all, and was not satisfied with the results. First of all, the videos was too compressed, and had too many compression artifacts. Even the best version did not look like HD. Second of all, the sound was way too high. Meaning that I had to turn down my speakers when watching the intro, and then turn the speakers back up when I got into the game. And that was also very annoying.\r\n\r\n[b]Why this mod is better?[/b]\r\n\r\nI started by downloading the highest quality trailer I could find, in 1080p. Then I loaded it up in Sony Vegas and turned down the volume of the sound to better match the game volume. I also removed all the other irrelevant stuff that was in the trailer, like the \\\"M for mature 18+\\\" and the \\\"In stores 11.11.11\\\" and stuff like that.. Then I rendered it out in what I think is the best quality compared to file size. There is NO compression artifacts in this video, and it runs smooth like butter.\r\n\r\n[img]http://farm9.staticflickr.com/8457/8024632046_1e36b37ca7_c.jpg[/img]\r\n\r\n[b]About skipping the intro[/b]\r\n\r\nIt is not possible to skip this intro, and you might not want to watch the whole intro everytime you start up the game. The other simular mods also have this problem, and so far, no one has solved it yet, as far as I know... The work around to this problem is to \\\"Alt-Tap\\\" out of the game, and then \\\"Alt-Tap\\\" back into the game (two times for some), and when the game comes up again, you will find yourself in the start menu. No big deal... Last note, if you ONLY have the game running, then alt-tap wont work. You have to have something else to alt-tap to.. Does this make sense at all? :)\r\nAnother solution is to just delete the \\\"Video\\\" folder from the skyrim data folder, and the game will start straight up in the main menu.\r\n\r\n[b]Installing the mod[/b]\r\n\r\nA: Download with mod manager and activate the mod (recommended)\r\n\r\nor\r\n\r\nB: Download manually and extract the Data folder into the skyrim root folder and click yes to overwrite (remember to backup those files before overwriting). This is where it\\'s located on my computer C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\r\n\r\nTo uninstall, just delete the files again, and copy over your backup\\'ed files. I\\'m not responsible for any lost files, or any other problems you might get with this.\r\n\r\n[img]http://farm9.staticflickr.com/8171/8024631680_59b4e5cdd9_c.jpg[/img]\r\n\r\nThanks for watching!",
  "categoryId": "42",
  "version": "1.0",
  "author": "Kalicola",
  "createdUnix": "1348611732",
  "updatedUnix": "1348613955",
  "containsAdultContent": false,
  "uploadedBy": "kalicola",
  "primaryFile": null,
  "files": [
    {
      "fileId": "90444",
      "name": "Kalicolas Live Action Intro 720p",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "67346",
      "fileName": "Kalicolas Live Action Intro 720p-24618-1-0.rar",
      "uploadedUnix": "1348612536",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cf0963282a7b0e706500cd9d9dc39f92328f21b05625ff857ce7a9120b80b07c/analysis/1407187059/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kalicolas%20Live%20Action%20Intro%20720p-24618-1-0.rar?fid=90444&ttl=1535795658&ri=8192&rs=8192&setec=81f96adfb5c9544425473bc07733830a"
    },
    {
      "fileId": "90445",
      "name": "Kalicolas Live Action Intro 1080p",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "138051",
      "fileName": "Kalicolas Live Action Intro 1080p-24618-1-1.rar",
      "uploadedUnix": "1348613955",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4353dc10ab1647fbb457f047ddae96a6a67247d135a40c21420020b4db722e3f/analysis/1407187112/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kalicolas%20Live%20Action%20Intro%201080p-24618-1-1.rar?fid=90445&ttl=1535795658&ri=8192&rs=8192&setec=9a660d0f787cb9c7c144d0d9701d68d3"
    }
  ]
}