{
  "modId": 24621.0,
  "modName": "Aryianna Devir",
  "summary": "Daughter of Viconia Devir has arrived in Skyrim!!",
  "descriptionHtml": "****Update******  07/18/2013\r\nI have down loaded a newer version and screen shots. I was never really satisfied with my original version of Aryianna. I recently started playing Skyrim again, lo and behold, I found her mother in Skyrim as well. What a pleasant surprise! I saw how she looked and started to immediately transform her daughter to look more drow like in my opinion. So let\\'s all try and remember every mod is made to the author\\'s opinion, if you don\\'t like it, you don\\'t have to down load it. Right? I am pleased to say, this version in my eyes comes closest to what I was looking for:\r\nHeight: 0.98- I wanted a smaller companion as she is a daughter and wouldn\\'t be as tall as her mother.\r\nWeight: 80-Room to grow and fill out so to speak, I think she\\'s more slender now.\r\nClothing: None, reason is because I don\\'t like spending a lot of time to remove companions clothing to suit my needs.\r\nWeapon: Iron Dagger, let\\'s face it, you\\'re gonna give her something better anyway, right?\r\nLocation: Old Hroldan  inn\r\n\r\n*****Only required file is ApachiiHairFemalev.1.5 Full or higher (http://skyrim.nexusmods.com/mods/10168//?) ********\r\n**Drow Race Mod is not needed for optional file**\r\n\r\nUses a CBBE body, but any body texture should work\r\n\r\n\r\n\r\n\r\nLovely Aryianna Devir, Daughter of Viconia Devir, has reached the age when the young are set out to learn the harshness of life. She will be waiting at the Riverwood Inn, ready to be a companion, maybe more?? Will you the dragon born, trust this Drow vixen to stand, sleep, fight, maybe love and marriage with you? Only time will tell.....\r\nAuto Level: 10 - 100\r\nLevel Scheme: Combat Ranger\r\nBeginning Inventory: No clothing, so you can dress her as you see fit; Weapons: Daedric Bow, Swords (2) and Arrows (1000)\r\nWeight: 100\r\nHeight: 1.00\r\n\r\n******Requirements:******** \r\nApachiiSkyHair 1.4 -- http://skyrim.nexusmods.com/mods/10168\r\nDrow Race - BETA  --http://skyrim.nexusmods.com/mods/16399\r\nOnly Required For Main File (Drow Race)\r\n\r\nTo get Aryianna to look like in screen shots:\r\nI used CBBE body 3.1 to build Aryianna, should be compatible with other body replacers. \r\nCoverwomen: http://skyrim.nexusmods.com/mods/3563\r\nNatural Eyes: http://skyrim.nexusmods.com/mods/3589\r\n\r\nI am considering this a WIP, would like to add a quest, voicing, possible romance/love interest just like namesake. This is first mod ever created or uploaded...if anyone would like to help me in this grand adventure...please feel free to PM...possibilities are unlimited\r\n\r\nI am open to positive/constructive feedback to make my mod better. Please endorse if you like her. That way, I know to keep working on her to make her even better!! \r\n\r\nPlease post screen shots of your companion. \r\n\r\nI want to give major kudos to Sultericdrums!! Now in dialogue with Viconia, she mentions a daughter in Skyrim!! I\\'m so honored, humbled and flattered all at same time. My hope is for someone to come along and help me build up Aryianna to make her mother proud!!\r\n\r\n\r\n\r\nThanks to Sultericdrums for allowing me to use Devir as last name and also for the inspiration to create a new Devir for Skyrim!! Viconia was one of my favorite companions from Oblivion!!\r\nThanks to Zazemel for making the awesome Drow race!!\r\nThanks to various authors whose armors I have used in screen shots!! All my lovely ladies love them!!\r\nThanks to Nexxus for having an avenue to share great things.\r\nThanks to various modders who have posted various tutorials on creating NPC companions and such.\r\nThanks to Bethesda for awesome game.\r\nAnd thanks to anyone else I may have missed!!",
  "categoryId": "66",
  "version": "1.3",
  "author": "Taintedsoul17",
  "createdUnix": "1348629166",
  "updatedUnix": "1374294478",
  "containsAdultContent": true,
  "uploadedBy": "taintedsoul17",
  "primaryFile": null,
  "files": [
    {
      "fileId": "90480",
      "name": "Aryianna Devir",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "412",
      "fileName": "Aryianna Devir-24621-1-0.7z",
      "uploadedUnix": "1348629251",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2c58ad763d12a6fe56b7503bb121921d64b24a4879f37eb684ece405bcdd9792/analysis/1407187388/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aryianna%20Devir-24621-1-0.7z?fid=90480&ttl=1535795668&ri=8192&rs=8192&setec=5fba87833905dba59026fa8fb198fd76"
    },
    {
      "fileId": "1000039754",
      "name": "Aryianna Devir",
      "version": "1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2482",
      "fileName": "Aryianna Devir-24621-1-3.7z",
      "uploadedUnix": "1374294478",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/db20245992ad414190925ec00388563056c5020d14d6c2e33ff89fde0eb6eb13/analysis/1407649996/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aryianna%20Devir-24621-1-3.7z?fid=1000039754&ttl=1535795668&ri=8192&rs=8192&setec=04b6a35f873b6d77fcdbbaea7dc6d045"
    }
  ]
}