{
  "modId": 24632.0,
  "modName": "Dragon Takeover",
  "summary": "Just for fun I made Tamriel completely dragon-heavy ;P",
  "descriptionHtml": "[center][img]http://imageshack.us/a/img823/6574/titlewg.jpg[/img][/center]\r\n\r\n[u]Description[/u]\r\n\r\nThis is just a simple plugin I made for fun which will make dragons the dominant species in Tamriel!  \r\n\r\nIt replaces animal predator spawn points like sabrecats, bears, wolves and the like with levelled dragons so it is likely that some encounters will have you run into 3 dragons at once.  Then if you tried to run away you could run into more!!!\r\n\r\n[u]Compatibility[/u]\r\n\r\nThis mod is compatible with any other dragon mod, even those that add to the levelled lists such as Deadly Dragons...in fact I would recommend DD the fights are more mental!  If you have any other mod like MoMod then some creatures in this levelled list won\\'t show.\r\n\r\n[u]Installation[/u]\r\n\r\nPut the esp in the data folder.\r\n\r\nI recommend waiting until you at least have done the vanilla initial dragon battle before installing this but this file was made more for those who are at a high level and fancy a fun challenge.\r\n\r\nI just want to make this clear that this file isn\\'t intended to conform to lore or balance or whatever, it was made simply for the challenge of getting involved in a huge dragon-fest!  It shouldn\\'t cause you any quest breaking or CTDs but you\\'re non-essential companions and NPCs will definately feel the pinch!",
  "categoryId": "83",
  "version": "1",
  "author": "Ironman5000",
  "createdUnix": "1348666045",
  "updatedUnix": "1348666102",
  "containsAdultContent": false,
  "uploadedBy": "Ironman5000",
  "primaryFile": null,
  "files": [
    {
      "fileId": "90527",
      "name": "Dragon Takeover Main",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Dragon Takeover Main-24632-1.zip",
      "uploadedUnix": "1348666102",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/fba46d4f4de048d24a4328b9866c9d2fdef87e6b742b636921f3efcddad003d9/analysis/1407187930/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Takeover%20Main-24632-1.zip?fid=90527&ttl=1535795702&ri=8192&rs=8192&setec=ade97949a4eb787ebde34e73ffe945b6"
    }
  ]
}