{
  "modId": 24652.0,
  "modName": "Auriels Weaponry",
  "summary": "  Want divine weapons worthy of a Dragonborn? The Auriel\\'s equipment has disappointed you in Dawnguard? With this Mod, the Sword, the Shield and the Auriel\\'s Bow will reveal their sacred power. The authentic splendor of the Elvish Akatosh will shine on his weaponry.",
  "descriptionHtml": "[center][url=http://lily29.bloxode.com/images/134775639276.jpeg][img]http://image.noelshack.com/fichiers/2012/39/1348696432-auriel-s-weaponry-520p.jpg[/img][/url]\r\n[color=#ffff99][size=7][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\"]Auriel\\'s Weaponry[/font][/size][/color][/center]\r\n[b]Version:[/b] 2.3\r\n[b]Author:[/b] Amras Anárion\r\n[b]Date:[/b] 24/07/2012, updated on 20/09/2012\r\n[b]Category:[/b]  Weapons\r\n[b]Language:[/b] English - the French version will be available quicky\r\n[b]Prerequisites :[/b] Skyrim.esm, Update.esm, Dawnguard.esm\r\n[b]Optional files:[/b]\r\n– The plugin’s version 1.2.1 for those who haven’t Dawnguard (included).\r\n\r\n[center][img]http://lily29.bloxode.com/images/132262541163.png[/img]\r\n[youtube]WL_1nnDMRa8[/youtube]\r\n\r\n[img]http://image.noelshack.com/fichiers/2012/39/1348692816-prez-titre-auriel-description.png[/img][/center]\r\nWant divine weapons worthy of a Dragonborn? The Auriel’s equipment has disappointed you in Dawnguard? With this Mod, the Sword, the Shield and the Auriel’s Bow will reveal their sacred power. The authentic splendor of the Elvish Akatosh will shine on his weaponry.\r\n\r\n\r\n[center][img]http://image.noelshack.com/fichiers/2012/39/1348692900-prez-titre-auriel-details.png[/img][/center]\r\n  With this Mod, the sacred relics of Auriel will recover the radiance they should have had in the game. Taking what is more beautiful in my eyes; the Bow and the Shield of the Sun God are now infused by the authentic elven art, like his Sword. Infused by the Magicka of the Aetherius, their powers are strengthened.\r\n  Under his blessing, forge his Sword and his legendary Bow in the flames of the Skyforge, the only one capable to create divine weapons. However, you need to show you worthy, because specific raw materials are required. Akatosh / Auriel is a God-Dragon, bones and scales of these heavenly creatures will be used. This implies that you need to have slain a dragon at least if you want hope to hand over these sacred objects.\r\n  Their production also requires a minimum of Smithing Skill, because Perk “Elven Forge” is required. Everything can be improved with the Moonstone refined.\r\n  Finally, concerning the Auriel’s Bow, only the fulfillment of the Dawnguard Quest will reveal its full potential. That said, be careful if you choose the path of blood, for the shine of that holy weapon radiate any Undead that succumb in its arrows, this is the will of Auriel.\r\n\r\n\r\n[color=#0099ff][size=6][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\", \\\\\\\"Monotype Corsiva\\\\\\\"]The Weapons[/font][/size][/color]\r\n\r\n[color=#009900][size=5][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\", \\\\\\\"Monotype Corsiva\\\\\\\"]Old Auriel\\'s Bow (previously Auriel’s Bow on v1.2.1)[/font][/size][/color]\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Description:[/b][/font][/color]\r\n  None. It’s the “raw” Bow, for those who want enchant it as they see fit.\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Stats:[/b][/font][/color]\r\n  • Weight: 8 Kg\r\n  • Speed: 1\r\n  • Base Damage: 17 (Same as the Ebony Bow, but given the draw speed, it’s the ranged weapon with the best DPS of Skyrim)\r\n  • Critical Damage: +17\r\n  • Value: 4200\r\n  • Enchantment: None\r\n  • Charges: None\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Forging at the Skyforge (Elven category):[/b][/font][/color]\r\n  • 1 Refined Moonstone\r\n  • 2 Dragon Bones\r\n  • 2 Quicksilver Ingots\r\n  • 5 Firewoods\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Improvement:[/b][/font][/color]\r\n  • 1 Refined Moonstone\r\n\r\n\r\n[color=#009900][size=5][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\", \\\\\\\"Monotype Corsiva\\\\\\\"]Auriel\\'s Bow[/font][/size][/color]\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Description:[/b][/font][/color]\r\n  Blessed by the holy light of the Sun, the legendary Elven Bow of Akatosh is a scourge for all those who fear the heavenly star.\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Stats:[/b][/font][/color]\r\n  • Weight: 8 Kg (DLC Vanilla: 11 Kg)\r\n  • Speed: 1\r\n  • Base Damage: 17 (Same as the Ebony Bow, but given the draw speed, it’s the ranged weapon with the best DPS of Skyrim) (DLC Vanilla: 13)\r\n  • Critical Damage: +17\r\n  • Value: 6200 (6817) (DLC Vanilla: 1000 (1436))\r\n  • Enchantment: Auriel’s Dawn => 10 effective Sun Damage on all enemies + 50 Sun Damage to Undead + Redemption of Meridia if Undead is killed within 10 seconds after the last arrow. (DLC Vanilla: only 50 Sun Damage for Undead.)\r\n  • Charges: 3200 (DLC Vanilla: 1000)\r\n  • Mana / charge: 29 (DLC Vanilla: 39)\r\n  • Uses: 110 (DLC Vanilla: 25)\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Forging at the Skyforge (Elven category):[/b][/font][/color]\r\n  • 1 Old Auriel’s Bow\r\n  • 4 Grand Soul Gems filled\r\n  • 1 Flawless Diamond\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Improvement:[/b][/font][/color]\r\n  • 1 Refined Moonstone + Arcane Blacksmith Perk\r\n\r\n  [u]Note[/u]: The Auriel’s Bow can be destroyed on the Arcane Enchanter to recover his power.\r\n\r\n\r\n[color=#009900][size=5][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\", \\\\\\\"Monotype Corsiva\\\\\\\"]Auriel\\'s Sword[/font][/size][/color]\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Description:[/b][/font][/color]\r\n  The legendary Elvish Sword of Akatosh. Offered to the Dragonborn, its divine light is feared by the Undead.\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Stats:[/b][/font][/color]\r\n  • Weight: 8 Kg (DLC Vanilla: 11 Kg)\r\n  • Speed: 1.1\r\n  • Base Damage: 13 (Same as the Ebony Sword, but with a slightly higher speed, so the DPS compete with a Daedric Sword.)\r\n  • Critical Damage: +13\r\n  • Value: 5800\r\n  • Range: 1 meter\r\n  • Scripted Enchantment: Mithril Blade => 30 Silver Damage on Undead, against 20 for the Vanilla silver effect. Knowing that this type of enemy has a x2 or x3 vulnerability to Silver, it gives a bonus of 60, see 90 damage.\r\n  • Charges: Infinite, as is counted as a script. So, you can also put your own enchantment on it, and the blade is eligible for the Shout Elemental Fury.\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Forging at the Skyforge (Elven category):[/b][/font][/color]\r\n  • 1 Flawless Sapphire\r\n  • 2 Dragon Scales\r\n  • 2 Refined Moonstones\r\n  • 2 Quicksilver Ingots\r\n  • 4 Grand Soul Gems filled\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Improvement:[/b][/font][/color]\r\n  • 1 Refined Moonstone\r\n\r\n\r\n[color=#009900][size=5][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\", \\\\\\\"Monotype Corsiva\\\\\\\"]Auriel\\'s Sword (enchanted with Auriel\\'s Dawn)[/font][/size][/color]\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Description:[/b][/font][/color]\r\n  The legendary Elvish Sword of Akatosh. Offered to the Dragonborn, its divine light is feared by the Undead.\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Stats:[/b][/font][/color]\r\n  • Weight: 8 Kg (DLC Vanilla: 11 Kg)\r\n  • Speed: 1.1\r\n  • Base Damage: 13 (Same as the Ebony Sword, but with a slightly higher speed, so the DPS compete with a Daedric Sword.)\r\n  • Critical Damage: +13\r\n  • Value: 6800 (7417)\r\n  • Range: 1 meter\r\n  • Scripted Enchantment: Mithril Blade => 30 Silver Damage on Undead, against 20 for the Vanilla silver effect. Knowing that this type of enemy has a x2 or x3 vulnerability to Silver, it gives a bonus of 60, see 90 damage.\r\n  • Enchantment: Auriel’s Dawn => 10 effective Sun Damage on all enemies + 50 Sun Damage to Undead + Redemption of Meridia if Undead is killed within 10 seconds after the last hit.\r\n  • Charges: 3200\r\n  • Mana / charge: 29\r\n  • Uses: 110\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Forging at the Skyforge (Elven category):[/b][/font][/color]\r\n  • 1 Auriel’s Sword (not enchanted)\r\n  • 1 Flawless Amethyst\r\n  • 2 Grand Soul Gems filled\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Improvement:[/b][/font][/color]\r\n  • 1 Refined Moonstone + Arcane Blacksmith Perk\r\n\r\n\r\n[color=#009900][size=5][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\", \\\\\\\"Monotype Corsiva\\\\\\\"]Auriel\\'s Shield[/font][/size][/color]\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Description:[/b][/font][/color]\r\n  Which belonged to Elvish deity Auriel, this legendary shield stores the energy of blocked attacks to turn it against the enemy. Its resistance to fire and magick is unsurpassed.\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Stats:[/b][/font][/color]\r\n  • Weight: 4 Kg (DLC Vanilla: 14 Kg)\r\n  • Armor category: Light (DLC Vanilla: Heavy)\r\n  • Armor Rating: 38 (The same as the Spellbreaker) (DLC Vanilla: 32)\r\n  • Value: 5800 (6581) (DLC Vanilla: 750 (755))\r\n  • Enchantment: Auriel’s Protective Aura => Equivalent 1 word charged of the Shout “Fus Ro Dah” every 5 hits blocked + Ward against spells up to 100 damage while blocking + 50% Fire Resistance. (DLC Vanilla: only the first power)\r\n  • Charges: Infinite, because it’s a piece of armor.\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Forging at the Skyforge (Elven category):[/b][/font][/color]\r\n  • None\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Improvement:[/b][/font][/color]\r\n  • 1 Refined Moonstone + Arcane Blacksmith Perk\r\n\r\n\r\n[color=#009900][size=5][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\", \\\\\\\"Monotype Corsiva\\\\\\\"]Sunhallowed Elven Arrows[/font][/size][/color]\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Forging at the Blacksmith per pack of 21 (Elven category):[/b][/font][/color]\r\n  • 1 Sunhallowed Elven Arrow (to ensure it’s impossible to get them without having done the Dawnguard’s Quest.)\r\n  • 1 Grand Soul Gem filled\r\n  • 20 Elven Arrows\r\n  • 5 Gleamblossoms\r\n\r\n\r\n[color=#009900][size=5][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\", \\\\\\\"Monotype Corsiva\\\\\\\"]Bloodcursed Elven Arrows[/font][/size][/color]\r\n\r\n[color=#ff2020][font=\\\\\\\"Comic sans MS\\\\\\\"][b]Forging at the Blacksmith per pack of 21 (Elven category):[/b][/font][/color]\r\n  • 1 Bloodcursed Elven Arrow (to ensure it’s impossible to get them without having done the Dawnguard’s Quest.)\r\n  • 1 Grand Soul Gem filled\r\n  • 20 Elven Arrows\r\n  • 1 Blood Potion\r\n\r\n\r\n[color=#0099ff][size=6][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\", \\\\\\\"Monotype Corsiva\\\\\\\"]Other modifications of this Mod[/font][/size][/color]\r\n\r\n  • The appearance of the Bow and the Shield are modified to be more in adequation with the Lore and the Elven art. Their stats are also improved.\r\n  • The Sunhallowed and Bloodcursed Elven Arrows see their speed multiplied by 1.5 - from 36 m/s to 54 m/s. Market value is multiplied by 10, respectively 16 to 160 and 6 to 60. Damage increased to 24, almost as much as Dragon arrows.\r\n  • In addition to being forgeable, Auriel’s Bow can be destroyed in order to recover its enchantment “Auriel’s Dawn”.\r\n  • The effects of Sun Damage are affiliated with the Restoration School, which allows the player skilled at this magic to enjoy the Mana economy bonus when he uses a weapon blessed with Auriel’s Dawn.\r\n  • The effects of Sun Damage also enjoy a shader for enchanted Weapon, the same as Fire Damage.\r\n  • Fixed some wrong keywords associated with Auriel’s Shield.\r\n  • Adds the ability to forge Sunhallowed and Bloodcursed Elven Arrows.\r\n\r\n\r\n[color=#0099ff][size=6][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\", \\\\\\\"Monotype Corsiva\\\\\\\"]Differences in the version 1.2.1[/font][/size][/color]\r\n\r\n  • Sun Damage from the enchantment “Auriel’s Dawn” is replaced by 20 fire damage.\r\n  • The “Fus Ro Dah” effect of Auriel’s Shield is replaced by Damage Reflection while blocking.\r\n  • There is no special Elven Arrows, because it’s exclusive at Dawnguard.\r\n  • The Auriel’s Bow of the v1.2.1 is the Old Auriel’s Bow from the v2.3, but with the Auriel’s Dawn of this release.\r\n  • All weapons are “standalone” and will not be recognized as genuine by the Add-on, except for textures which will apply to the original Auriel’s relics.\r\n  • A “standalone” Auriel’s Shield can be forged here. It requires two units of the 5 types of materials used for the Auriel’s Sword.\r\n\r\n\r\n[color=#0099ff][size=6][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\", \\\\\\\"Monotype Corsiva\\\\\\\"]Images and videos[/font][/size][/color]\r\n\r\n  Screenshots: [url=http://lily29.bloxode.com/a132394,0,les-armes-d-auriel-mod-skyrim.html]http://lily29.bloxode.com/a132394,0,les-armes-d-auriel-mod-skyrim.html[/url]\r\n  Showcase video of this Mod: [url=https://www.youtube.com/watch?v=WL_1nnDMRa8]https://www.youtube.com/watch?v=WL_1nnDMRa8[/url]\r\n\r\n\r\n[color=#0099ff][size=6][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\", \\\\\\\"Monotype Corsiva\\\\\\\"]Auriel and the Tamriel’s Lore[/font][/size][/color]\r\n\r\n  Auriel is the altmer vision of Akatosh, so it is natural that its weapons are imbued with the fine art of the High-Elves (contrary to what Bethesda has served us on Dawnguard). So I chose the elven weapon models that are the most beautiful in my eyes: the Cloud Courtblade of Adonnay, the Shield of Mystic Elven Armor by Sader, and the Lórien’s Bow made by BGS for MERP Mod – Middle-Earth Roleplaying the Project. (Of course, I thank and credit the creators of these meshes & textures).\r\n\r\n  Although powerful and rivaling with the Daedric weaponry in terms of damage per second, these weapons aren’t necessarily unbalanced. In line with the solar status of Auriel, I decided to give for these hallowed objects an enchantment which deals extra damage to Undead: the fury of Dawnbreaker in addition to Sun Damage for the Auriel’s Bow and a powerful silver status for the Sword. Shield also gaining the ability to deflect spells and fire, as was the case in Arena and Daggerfall.\r\n\r\n\r\n[center][img]http://image.noelshack.com/fichiers/2012/39/1348693609-prez-titre-auriel-known-issues.png[/img][/center]\r\n  • In rare cases, it happens that the silver damage bonus of Auriel’s Sword is not taken into account.\r\n  • The semi-transparence of Auriel’s Shield lets partially shadows across it. (This minor visual bug is known on the Sader’s Mod and Deadly Dragons.)\r\n  • When the effect of “Auriel’s Dawn” is used to create an enchanted item, only the value of Sun Damage for Undead can be effectively changed. The number of damage that appears in the enchantment’s menu is the half of the real damages, the effect of sunburn occurring for 2 seconds. (This bug originated Vanilla game and not the Mod itself.)\r\n\r\n\r\n[center][img]http://image.noelshack.com/fichiers/2012/39/1348693618-prez-titre-auriel-installation.png[/img][/center]\r\n  Place the contents of the Data folder in the same directory where you installed Skyrim, and then select the *.esp via the Launcher / Mod Manager / plugins.txt.\r\n  If you haven’t Dawnguard installed, replace the original *.esp with the version 1.2.1 contained on the folder “Plugin 1.2.1 no-Dawnguard”.\r\n\r\n\r\n[color=#0099ff][size=6][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\", \\\\\\\"Monotype Corsiva\\\\\\\"]Update[/font][/size][/color]\r\n\r\n  In the context of an update from version 1.2.1 to version 2.3 or later, it is highly recommended to selling or throwing Auriel’s items (especially those blessed with Auriel’s Dawn), then to reforge to ensure that new enchantments are properly taken into account.\r\n  In other cases, a simple replacement of the files will suffice.\r\n\r\n\r\n[color=#0099ff][size=6][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\", \\\\\\\"Monotype Corsiva\\\\\\\"]Uninstallation[/font][/size][/color]\r\n\r\n  To remove the mod, delete the *.esp as well as meshes & textures added.\r\n\r\n\r\n[center][img]http://image.noelshack.com/fichiers/2012/39/1348693745-prez-titre-auriel-changelog.png[/img][/center]\r\n[b][u]Dawnguard not required[/u]:[/b]\r\n\r\n  • [b]v0.9 (Pre-Beta)[/b] - Initial release\r\n  • [b]v1.0 (Beta)[/b] - Weapons appear correctly on the menu.\r\n  • [b]v1.0.1 (Beta)[/b] - Auriel’s Sword is now in the right category of the Forge, namely “Elven”.\r\n  • [b]v1.0.3 (Beta)[/b] - Slightly increased the silver power of Auriel’s Sword to rebalance it with the Bow. Own weapons powers now have a separate entry in the Creation Kit, which allows the Mod to be completely standalone.\r\n  • [b]v1.1 (Beta)[/b] - Adjustment of raw materials for forging and tempering. The number of Grand Soul Gems filled was decreased, but now we need 2 Dragon Scales for Auriel’s Sword and 2 Dragon Bones for Auriel’s Bow.\r\n  • [b]v1.2[/b] - Fixed the texture bug reported in v2.1 and adding the enchanted version of the Auriel’s Sword as in v2.2.\r\n  • [b]v1.2.1[/b] - Added a standalone Auriel’s Shield with the same enchantment in v2.2, but without the “Fus Ro Dah” effect.\r\n\r\n[b][u]Dawnguard required:[/u]:[/b]\r\n\r\n  • [b]v1.5.0 (Pre-Alpha)[/b] - Added Vanilla Sun Damage to the enchantment of the Auriel’s Bow, in addition to the effect of Dawnbreaker. The Mod now requires Dawnguard.esm.\r\n  • [b]v1.5.1 (Alpha)[/b] - Given the impossibility to linking the “standalone” Auriel’s Bow to scripts of the original DLC’s bow, this last is now directly modified by my Mod. The ancient weapon becomes “Old Auriel’s Bow”, with unchanged statistics, but without enchantment and a value reduced to 4200 septims. Therefore, the access paths for the Bow’s meshes and textures are aligned with those of the DLC (data/meshes ~ texture/dlc01/weapons/auriel) compared to version 1.1. The Sword Auriel remains standalone.\r\n  • [b]v1.5.2 (Pre-Beta)[/b] - Modifying smithing recipe for Auriel’s Bow. The Bow is destructible (to retrieve its enchantment) and craftable (with the “Old Bow Auriel” + some gems) to be recoverable (and can be acquired without having to finish the Dawnguard Quest). Thus, values of Auriel’s weapons are slightly adjusted. The Bow is listed at 6200 septims and the Sword at 5800.\r\n  • [b]v1.5.3 (Pre-Beta)[/b] - The arrows’ speed linked to the Auriel’s Bow (Bloodcursed and Sunhallowed Elven Arrows) goes from 3600 to 5400 cm/s, as the crossbow bolts. Damage of the arrows rises to 24 (knowing that Daedric is 23 and Draconic 25 damage). Finally, the value of Sunhallowed Elven Arrows rises from 16 to 160 septims. Idem for Bloodcursed Elven Arrows (from 6 to 60 septims).\r\n  • [b]v1.6 (Beta)[/b] - Adjustment of “Auriel’s Dawn” enchantment to make it balanced. Fire Damage is removed, but the explosion of Dawnbreaker remains. Any enchanted weapon with Auriel’s Dawn will now have the Shader of Fire enchantment (red radiation of the weapon, as v1.1). Finally, contrary to what the game tells, sun damage is 10 in fact on non-Undead and 60 on the Undead on Normal difficulty. (A bug in the enchantment of Vanilla Auriel’s Bow did that non-Undead took only one sun damage! Tested and verified during the Beta-Test by abusing the code “getav health” on various enemies.) Combined with Sunhallowed Elven Arrows (already enchanted in the Vanilla game), the cumulative sun damage bonus increased to 30 on non-Undead, and 120 for the Undead.\r\n  • [b]v1.6.1 (Beta)[/b] - The base damage of Auriel’s sword increases from 12 to 13 to align it with the DPS of a Daedric Sword and rebalance it towards the Auriel’s Bow.\r\n  • [b]v1.6.2 (Beta)[/b] - Given the low Mana cost of the Auriel’s Dawn, the charge of Auriel’s Bow going from 8000 to 3200.\r\n  • [b]v1.8 (Beta)[/b] - Integration and modification of Auriel’s Shield. Inspired by the “Relentless Dragonslayer’s Shield” of Deadly Dragons, the legendary shield also integrates the skin of the Mod “Mystic Elven Armor” by Sader, much more Lore Friendly than what Bethesda has served us on Dawnguard. Moreover, its enchantment is enhanced. In addition of the “Fus Ro Dah” effect (unmodified), it includes a barrier that repels spells while blocking, as the Spellbreaker, but twice as powerful. Finally, its armor rating rises from 32 to 38, its market value is quintupled and the Artifact becomes a Light Armor of 4 Kg instead of 14. (An Elvish God wears elven equipment, so light; it flows at the source of Lore.) I also took the opportunity to correct some wrong keywords, as the Mod “Better Auriel’s Shield” of popcorn71.\r\n  • [b]v1.9 (Beta)[/b] - Fixed silver damage bonus that was not taken into account with the Auriel’s Sword due to a missing keyword (WeapMaterialSilver) on the weapon.\r\n  • [b]v1.9.1 (Beta)[/b] - From the fact that the addition of Keyword WeapMaterialSilver doubled and made overpowering the improvement of Auriel’s Sword on the wheel, it was removed; and the script for silver damage has been modified to be taken into account by the elven nature of the weapon (WeapMaterialElven).\r\n  • [b]v2.0 (Beta)[/b] - Creation of the seaurielspedestal01.nif file to correct the mismatched meshes towards textures when the bow appears on its pedestal in the Inner Sanctum.\r\n  • [b]v2.1[/b] - Fixed a major bug which generated purple textures on Auriel’s equipment due to a wrong access path of textures on the meshes.\r\n  • [b]v2.2[/b] - Adding enchanted version of Auriel’s Sword. Auriel’s Shield sees its value increased by 2000 septims and won the Fire Resistance, like Arena and Daggerfall.\r\n  • [b]v2.3[/b] - Possibility to forge Sunhallowed and Bloodcursed Elven Arrows in any forge, provided you have at least one copy of these arrows.\r\n\r\n[b][u]Planned:[/u]:[/b]\r\n\r\n  • Adding an enchantment of Health leech on the Bloodcursed Elven Arrows when used with Auriel’s Bow.\r\n  • Removing Holy and Sun damage from Auriel’s Bow when using Bloodcursed Elven Arrows.\r\n  • Proposing optional textures packs for weapons or arrows from other Mods, with the permission from their respective authors.\r\n\r\n\r\n[center][img]http://image.noelshack.com/fichiers/2012/39/1348694503-prez-titre-auriel-incompatibility.png[/img][/center]\r\n  This mod will come into conflict with anything that modifies the statistics of Auriel’s Shield, his Bow or his arrows. In case of duplication of the same data, only the last is taken into account.\r\n  This mod will come into conflict with anything that modifies the appearance of Auriel’s Shield or his Bow. That said, it’s possible to choose a skin from other mods for the Shield or the Bow by placing textures and meshes in the correct folders. (See the FAQ below.)\r\n\r\n\r\n[center][img]http://image.noelshack.com/fichiers/2012/39/1348694552-prez-titre-auriel-faq.png[/img][/center]\r\n  [b]Q: I want to keep the original appearance of the Arc and / or Auriel’s Shield. How to do?[/b]\r\n  [color=#cc99ff]A: For the Bow, delete the files containing “aurielsbow” in the meshes and textures of *\\\\dlc01\\\\weapons\\\\auriel and *\\\\meshes\\\\dlc01\\\\architecture\\\\snowelfruins\\\\seaurielspedestal01.nif. For the Shield, delete all files “aurielsshield” in the meshes and textures of *\\\\dlc01\\\\armor\\\\auriel.[/color]\r\n\r\n  [b]Q: I want to install different textures for the Bow and / or Auriel’s Shield. How to do?[/b]\r\n  [color=#cc99ff]A: Proceed as above, then paste your new textures (and possibly meshes).[/color]\r\n\r\n  [b]Q: I want to install different textures for the Auriel’s quiver or his elven arrows. How to do?[/b]\r\n  [color=#cc99ff]A: Arrows and quiver textures aren’t modified by my Mod. If you only want to change these skins by putting those of “Auriel’s Bow Reloaded” Mod for example, copy the contents of his textures folder over mine without overwriting existing files (or installing my mod after his textures).[/color]\r\n\r\n  [b]Q: I find your weapons not enough powerful.[/b]\r\n  [color=#cc99ff]A: There are exploits in forging to upgrade his equipment to very high levels. With that, even an Iron Sword (Legendary) can overcome a standard Daedra Sword. Otherwise, there is TESVSnip to quickly edit the values of a Mod (if you understand what is what), failing to get into the intricacies of the Creation Kit or decrease the game’s difficulty.[/color]\r\n\r\n  [b]Q: I find your weapons too powerful.[/b]\r\n  [color=#cc99ff]A: Most players require that legendary weapons have the power they deserve, without it being so far overkill. Target Daedra level seems to be more balanced in my eyes. Otherwise, there is always the possibility of increasing the game’s difficulty or edit my Mod with TESVSnip or via the Creation Kit. Comment in order to readjust and rebalance my Mod will be welcome.[/color]\r\n\r\n  [b]Q: When I kill an Undead with Auriel’s Bow or any weapon enchanted with Auriel’s Dawn, the light explosion affects me and damage my HP. Serana is also a victim. Why?[/b]\r\n  [color=#cc99ff]A: This is because you are Vampires. When explodes, Auriel’s Radiance burns indiscriminately all Undead nearby, including your acolytes or yourself. Auriel’s Bow is a blessed weapon; Vampire who uses it must suffer the consequences. From a Role-Play perspective, it makes sense. The problem is exactly the same with Dawnbreaker. That said, do not worry, this sacred burning does little damage on you (a few Hit Points at most), and is nothing compared to the terror inspired by Auriel’s Dawn to Undead enemies (at least 60 sun damage!).[/color]\r\n\r\n\r\n[center][img]http://image.noelshack.com/fichiers/2012/39/1348694683-prez-titre-auriel-tools-used.png[/img][/center]\r\n  – Skyrim\r\n  – Creation Kit\r\n  – 7-Zip\r\n  – TESVSnip\r\n  – NifSkope and Blender\r\n  – Fraps\r\n  – Avid Studio\r\n  – Paint.Net\r\n  – Gimp\r\n\r\n\r\n[center][img]http://image.noelshack.com/fichiers/2012/39/1348694735-prez-titre-auriel-credits.png[/img][/center]\r\n  – BGS from MERP Team (The Middle-Earth Roleplaying Project) which made the Bow’s model.\r\n  => The Bow is found on the Mod “LOTR Weapons Collection” by Isilmeriel:\r\n[url=http://skyrim.nexusmods.com/mods/5727]http://skyrim.nexusmods.com/mods/5727[/url]\r\n\r\n  – Adonnay, creator of “Elven Weaponry” Mod for Oblivion.\r\n  => The sword is found on the Mod “Elven Weaponry” by cageu and SithMaster2010:\r\n[url=http://skyrim.nexusmods.com/mods/13234]http://skyrim.nexusmods.com/mods/13234[/url]\r\n\r\n  – Sader for his Mod from which I took the model of the Shield, the famous Elven Mystic Armor.\r\n  => His Elven Mystic Armor Mod:\r\n[url=http://skyrim.nexusmods.com/mods/5600]http://skyrim.nexusmods.com/mods/5600[/url]\r\n\r\n\r\n[color=#0099ff][size=6][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\", \\\\\\\"Monotype Corsiva\\\\\\\"]Legal[/font][/size][/color]\r\n\r\n  • You are free to use my own Mod’s resources or improve it as long as you credit me.\r\n  • You must credit Sader if you reuse the model of the Shield.\r\n  • You must credit Adonnay and get permission from cageu if you reuse the model of the Sword.\r\n  • You must get permission from the MERP Team if you reuse the model of the Bow.\r\n  • You can upload this mod yourself if to warn me. For cons, URLs to this mod are free and much appreciated.\r\n  • If you are inspired by my Mod to create something similar, a small tribute - although not required - will be always appreciated. ;)\r\n\r\n\r\n[color=#0099ff][size=6][font=\\\\\\\"Magic Cards\\\\\\\",\\\\\\\"Augusta\\\\\\\", \\\\\\\"Monotype Corsiva\\\\\\\"]Acknowledgements[/font][/size][/color]\r\n\r\n  • The MERP team, Adonnay, cageu, SithMaster2010 and Sader for creating beautiful elven equipment.\r\n  • The creators of Deadly Dragons for their elven shield that inspired me and I adopted in my RP game.\r\n  • Popcorn71 who discovered a problem with keywords on the Shield and I also corrected. (I hope to make your scripts compatible with mine.)\r\n  • Imfamousfoofy who is the pioneer for the overhaul of the Bethesda’s Auriel’s Bow and who has made beautiful textures with his Mod “Auriel’s Bow Reloaded”.\r\n  • Bethesda Game Studios for the wonderful game despite the bugs which we are accustomed.",
  "categoryId": "55",
  "version": "2.3",
  "author": "Amras Anarion",
  "createdUnix": "1348695592",
  "updatedUnix": "1348695888",
  "containsAdultContent": false,
  "uploadedBy": "amrasanarion",
  "primaryFile": null,
  "files": [
    {
      "fileId": "90585",
      "name": "Auriels Weaponry",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18013",
      "fileName": "Auriels Weaponry-24652-2-3.7z",
      "uploadedUnix": "1348695888",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/ce940dbcb85e58e9d3ca704623483046c15cc625c39f117511fd93b4658dc661/analysis/1407188547/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Auriels%20Weaponry-24652-2-3.7z?fid=90585&ttl=1535795723&ri=8192&rs=8192&setec=21f41a47cbed54be5d518347ef840070"
    }
  ]
}