{
  "modId": 24657.0,
  "modName": "Simple Varied Start",
  "summary": "Adds a few vanilla weapons and armor to the first two rooms of Helgen Keep so as to vary the players\\' starting situation.",
  "descriptionHtml": "UPDATE: Stuff for magic users added!\r\n\r\nOne of the things that mildly annoyed me about Skyrim was the complete lack of variety in the equipment in Helgen.  You wouldn\\'t be able to get the equipment you needed until you got to Riverwood, but at that point you\\'ve probably already gained a few skill points in a skill you never wanted to use.\r\n\r\nWell, this is my answer to that.  A simple mod that adds some various equipment to Hadvar and Ralof\\'s entrances, as well as some additional armor later on.  In addition, I thought I\\'d add some immersion to the game to justify a choice I made.\r\n\r\nThe complete list of changes are:\r\n\r\n* A longbow has been placed on top of one of the bunks, as well as a quiver of 200 arrows laid next to it.\r\n* A steel horned helmet has been added to the chest next to the bow and arrows.\r\n* A note has been added on top of the chest, from the very Imperial Captain that you all love to hate.\r\n* The Warden Chest has some Imperial Boots and an Iron Greatsword added in\r\n* Imperial Armor of the heavy variety has been added next to the chest^\r\n* A battleaxe has been driven into the table in Ralof\\'s part of the area.  I guess the dead Stormcloak missed his target and had to resort to a waraxe instead -- which cost him his life.\r\n*UPDATE*\r\n* The chest nearest the entrance is no longer an empty useless chest.  Now it contains Imperial Battlemage Armor, as well as a couple of spells no mage should be without.\r\n*One of the cages in the torture room now contains a Staff of Soul Trap, a book of Raise Zombie, and some empty soul gems.  Have fun, necromancers!\r\n\r\n^There\\'s a very strange thing that happened when I tried to put this IN the chest.  namely, it turned into two Imperial Light Armors and changed the other Imperial Light Armor in two Imperial Light Armors.  I don\\'t know why that happened, so if anyone more experience than me can inform me of this, that would be fantastic.\r\n\r\nThis is my first mod, and I tried to keep it as clean as possible.  So please, by all means, criticize this mod!  Tear it apart, dissect it, give me the blunt truth, but at least tell me how to become better while you\\'re at it.\r\n\r\nThis mod probably won\\'t be compatible with any mod that changes the Warden Chest or the other Chest nearby, so if you\\'re running a mod that does that, chances are, you don\\'t want to run his mod, too.  I might make a version that\\'s completely compatible with those mods, thoguh.",
  "categoryId": "85",
  "version": "1.05",
  "author": "Zachski",
  "createdUnix": "1348702220",
  "updatedUnix": "1348715652",
  "containsAdultContent": false,
  "uploadedBy": "Zachski",
  "primaryFile": null,
  "files": [
    {
      "fileId": "90602",
      "name": "Simple Varied Start",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Simple Varied Start-24657-1-00.zip",
      "uploadedUnix": "1348702437",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/0ee16c72a4e4c4e27ecd99651a722aa46027603dbefc22f4ec24067a4da7157a/analysis/1407188703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Varied%20Start-24657-1-00.zip?fid=90602&ttl=1535795729&ri=8192&rs=8192&setec=437d66ac68c1c24e01accd79fec22dac"
    },
    {
      "fileId": "90623",
      "name": "Simple Varied Start 1_05",
      "version": "1.05",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Simple Varied Start 1_05-24657-1-05.zip",
      "uploadedUnix": "1348715652",
      "modVersion": "1.05",
      "virusScanUrl": "https://www.virustotal.com/file/08735644a90da88bd6df3bc1fe5da70956210cfd7472a5d770cbd1fc70137af8/analysis/1407188949/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Varied%20Start%201_05-24657-1-05.zip?fid=90623&ttl=1535795730&ri=8192&rs=8192&setec=35b28082f827aff0080a9398833b7670"
    }
  ]
}