{
  "modId": 24678.0,
  "modName": "Modders Resource - Auto sorting and auto looting when crafting",
  "summary": "Contains scripts and a tutorial for implementing an automatic sorting system to containers. A test file is also available.",
  "descriptionHtml": "[b]What this mod containes:[/b]\r\nWithin this zip-file, you\\'ll find the scripts used in the [url=http://skyrim.nexusmods.com/mods/20751]Dawnspires[/url] [i]auto-sorting[/i] and [i]crafting auto-loot[/i] system, along with a test file. Bellow you\\'ll find instructions for how to implement it into your mod.\r\n\r\nTo use this, you agree to:\r\n- Not distribute it to other sites. Translating the tutorial is fine, but no files may be uploaded.\r\n- Give me credit in your description.\r\n- Place links back to this mod-page and my profile.\r\n\r\nYou are free to modify the scripts in any way you want. If you modify the scripts, I cannot be held responsible for any bugs that might arise.\r\n\r\nNote that this mod will not give your house >9000 endorsements. The design is often more important than the features.\r\n\r\n[b]First of, things you need to know:[/b]\r\n\r\nThere are two different types of chests:\r\n- Storage chests; these holds your items\r\n- Sorting chests; These only sorts your items and cannot store items\r\n\r\nThere are three sub-types of Sorting Chests:\r\n- Basic Sorting Chest; every item placed within [u]by the player[/u] gets sorted.\r\n- Lever Sorting Chest; same as the basic chest, but with a button attached to it. Pressing the button drags every item stored within the system into the linked chest. Press it again to sort items within.\r\n- Master Sorting Chest; same as the basic chest, but also sorts items not placed by the player. Generally you only want one of these.\r\n\r\nIMPORTANT NOTE:\r\nUsers have reported that dumping to many items in a container may cause items to go missing. I\\'ve dumped hundreds of items at once without losing a single item, but try to not overload it. If you have 3000+ weight, dump some of the items in, wait for it to be sorted and repeat. This also applies to the button feature.\r\n\r\nThere are several global control variables implemented. This is so that the player can enable/disable the scripted systems if they want to. Disabling is done by the following console-command:\r\n\\\"set <name of global variable> [u]to[/u] < 1 to enable, 0 to disable >\\\" , without quotes of course.\r\nExample:\r\n\\\"Set _autolootAllowAutoLoot to 1\\\"\r\nNote that there is a space between [i]Set[/i] and [i]_autolootAllowAutoLoot[/i].\r\n\r\nBy default, the sorting categories are:\r\n- Heavy Armor \r\n- Light Armor\r\n- Clothing\r\n- Weapons, including Staffs and bows\r\n- Arrows, including Dawnguard Bolts \r\n- Jewelry\r\n- Gems\r\n- Books\r\n- Scrolls\r\n- Raw Food \r\n- Cooked Food \r\n- Poisons\r\n- Potions \r\n- Ingredients\r\n- Soul Gems\r\n- Keys \r\n- Ore, including dwemer scrap\r\n- Leather, including animal hides and leather stripes\r\n- Ingots\r\n- Gold coins\r\n- Misc items\r\n\r\nYou do not need to create a unique chest for every category. Merging chests are possible without modifying th script, which I will get to later.\r\n\r\n\r\n[b]What you need to create:[/b]\r\n\r\n- 1 to 21 Storage Chest container-entries, depending on how well sorted you want your items to be.\r\n- One container entry for the Sorting Chest (Optional, but required for Crafting auto loot and pullbar functionality)\r\n- One primitive Activator (the Master Activator)\r\n- One button/lever Activator (Optional, but required for the pullbar functionality)\r\n- Three Formlists\r\n- Two Global variables\r\n- One Spell (Optional, but required for Crafting auto loot)\r\n- One Magic Effect (Optional, but required for Crafting auto loot)\r\n\r\n[b]The scripts[/b]\r\n_sgaAutosortContainer : This script goes on every container, both Storage Chests and Sorting Chests.\r\n_sgaAutosortMaster : This script goes on a the custom primitive activator.\r\n_sgaAutosortLever : Must be attached to a button, pullbar or something else the player can activate.\r\n_sgaCraftingAutoLoot : Attach it to the crafting stations you wish to include in the auto-loot system.\r\n_sgaCraftingSpell : Attached on a Magic Effect\r\n\r\nIt is recomended that you try the system out before you start, This is done by oopening the console in the main menu and typing \\\"coc AutoSortCell\\\".\r\n\r\n[b]First step: Creating containers[/b]\r\n\r\nTo create containers, navigate to WorldObjects->Containers. Duplicate a container of choice, then double click it. In my test cell, I chose the [i]MerchantWCollegeTolfdirChest[/i].\r\nOnce the container window is open, type in something easy to reconize in the ID field, such as \\\"autosort<what goes in the chest>\\\" (e.g autosortIngredientsChest). In the name field, type what the chest is meant for (e.g Ingredient Chest). Clear the Item List and make sure the Respawns tick box is unchecked.\r\nIn the scripts section, press Add. Select _sgaAutosortContainer.\r\nPress properties. There are three different entries here:\r\n- BypassGlobalCheck : Setting this to TRUE turns this container into a Sorting Chest\r\n- BypassPlayerCheck : Setting this to TRUE turns this container into a Master Sorting Chest if BypassGlobalCheck is also TRUE. You generally only want one of these.\r\n- master : Must be set to the Master Activator. We will return to this later.\r\n\r\nRepeat this step until you have [u]entries[/u] for:\r\n- 1 Storage Container per sorting category. Again, you do not need to create a unique entry for every category, merging categories are possible.\r\n- 1 Sorting Chest (Optional, but required for Crafting auto loot and pullbar functionality)\r\n\r\nPlace the containers at desired locations around your house.\r\n\r\n[b]Creating Formlists:[/b]\r\nNavigate to Miscellaneous->FormList in the ObjectWindow. Right click and select New. A new window will pop up. Drag and drop entries from the ObjectWindow into the Formlist window in order to add them to the list.\r\nYou need to create three different lists:\r\n- One list for Ores and Dwarven scraps, i.e things that can be melted.\r\n- One list for Cooked Food. This needs to be handpicked. Easiest way to do this is to go to Magic->Potions and then type \\\"Food\\\" in the filterbox.\r\n- One list of special smithing items such as Dragon Bones and Dragon Scales.\r\n\r\nYou can find an example of how this looks in the test esp in the image section above.\r\n\r\n\r\n[b]Creating the Master Activator[/b]\r\nNavigate to WorldObjects->Activators. Right click and select new.\r\nIn the ID-field, type in AutosortMaster. Press OK. Doubble-click it again. This time, the script section is not grayed out. Press Add and select _sgaAutosortMaster.\r\nPress Properties. There\\'s an example of how this looks in the test file in the image section.\r\n- Assigning ObjectReferences: This can be tricky if you haven\\'t done it before. Open your cell in the render window. Navigate to the chest you want to assign. Go back to the Script properties window, then press the \\\"Select Reference in render window\\\" button. Your cursor is now transformed into a crosshair. Double click your chest and you are done.\r\n\r\n[i]Merging chests[/i]\r\nYou can use the same chest multiple times. For example, you can set the ChestLightArmor and the ChestHeavyArmor to the same chest. In the Dawnspire, I chose to send shields and weapons to the same chest. In the test file, I send gold and jewelry to the same chest.\r\n\r\nAfter you\\'ve assigned all the properties correctly, you need to place the activator somewhere in the world. Start of by assuring markers are turned on. In the toolbar, navigate to View. Halfway through the list you\\'ll see \\\"Markers\\\". If it has a checked tickbox next to it, markers are on. Continue by selecting an object in your cell, then press the \\\"Create Trigger\\\"-button that looks like a \\\"T\\\" in a box. You\\'ll find this in the toolbar in the main window.\r\nA new window pops up. Select the AutosortMaster. Whatever object you\\'ve selected should be surounded by a red box. Move this box anywhere in your cell. Go back to the Object Window, WorldObjects->Containers. You now need to assign the AutosortMaster to the master-property in all your containers\\' script. That\\'s it. You now have a working auto sorting system.\r\n\r\n[b]Implementing Crafting autoloot[/b]\r\nIn the Object Window, navigate to Magic->spells->abilities. Right-click and select new. In the ID-field, type in something like _autoLootCraftingSpell.\r\n- Set the type to ability.\r\n- Set casting type to Constant effect.\r\n- Set delivery Type to self. Press OK.\r\n\r\nNavigate to Magic->MagicEffects. Right-click and select new. In the ID field, type something like _autoLootCraftingEffect.\r\n- Set archetype to Script.\r\n- Set Casting Type to Constant Effect\r\n- Set Delivery to Self\r\n- Tick the No Area and No Magnitude tickboxes. Press OK.\r\n\r\nDouble-click you magic effect again. In the script section, press Add. Select _sgaCraftingSpell\r\n- If you haven\\'t already, place a Sorting Chest somewhere in you cell and turn it into a Master Sorting Chest. Instructions above.\r\n- Press Properties to edit the script Properties.\r\n- Set masterChest to your Master Sorting Chest.\r\n- Set isCraftingSPell to _autoLootCraftingSpell. Press OK\r\n\r\nGo back to your spell. In the effects field, right-click and select New. Select _autoLootCraftingEffect from the list. Press OK\r\n\r\nNow you need to [b]locally[/b] add the _sgaCraftingAutoLoot-script to all the crafting stations you want to link to the auto-loot system. Double-click your crafting bench in the render window. Find the Scripts tab. Add a new script and select _sgaCraftingAutoLoot. Right-click it and select Edit Properties.\r\n- Fill the Containers-array with all chests you want to loot when activating the bench. Note that the auto loot will [b]not[/b] re-sort Weapons, Armor, Books and Scrolls.\r\n- Create a new Global Variable like we did before with the initial value 1. Set the AllowAutoLoot-property to this Global.\r\n- Set the _sga_isCraftingSpell to the _autoLootCraftingSpell.\r\n\r\nRepeat this for every crafting station you want to link to the system. It is not recommended that you edit the vanilla crafting stations as this might create mod conflicts. You can however create your own, custom crafting stations and add the script to the base entry.\r\n\r\n[b]Creating a Sorting Chest with a pullbar[/b]\r\nIn the Object Window, navigate to WorldObjects->Activators. There are two activators I suggest you choose between; GenPullbar01 and ImpButton01. Whichever you choose, right-click and select Duplicate. Doubleclick your new button/pullbar.\r\n- In the ID-field, type in something like _autoSortButton / _autoSortPullbar.\r\n- In the name field, type in something like \\\"Auto Sort Pullbar/button\\\". Press OK, the double-click the activator again.\r\n\r\nAdd the _sgaAutosortLever-script to your activator. Select edit properties like we did before.\r\n- Set master to the AutosortMaster-activator.\r\n- If you haven\\'t already, place a Sorting Chest somewhere in you cell and turn it into a Master Sorting Chest. Instructions above.\r\n- Set the mainChest to a Master Sorting Chest. Press OK.\r\n\r\nPlace your button/pullbar somewhere in your cell. Next to it, place a Sorting Chest. This must [u]not[/u] be a Master Sorting Chest. Double-click your button/pullbar. In the Rinked Ref, right-click and select new. Pick the nearby sorting chest from the render window.\r\n\r\nThat\\'s it. You now have a working Lever-chest. Remember that the button/pullbar doesn\\'t resort items automatically. Using the button once drags in items, using it again sorts items. It is easy to forget the second activation, so I recommend you keep the Lever Sorting Chest-count low.\r\n\r\n============================================\r\n\r\nEnd of tutorial.\r\n\r\n============================================\r\n\r\nGot questions? Place them in the comments.\r\n\r\n============================================\r\n\r\n[b]Why am I releasing this?[/b]\r\nThe auto-sorting and auto-loot makes crafting and storing very easy. However, my warrior cannot live in a mage tower nor can my archer. I hope that other mod-authors find this useful and are willing to implement it and share their creations.\r\n",
  "categoryId": "82",
  "version": "1.1",
  "author": "Sjogga",
  "createdUnix": "1348754331",
  "updatedUnix": "1349905579",
  "containsAdultContent": false,
  "uploadedBy": "Sjogga",
  "primaryFile": null,
  "files": [
    {
      "fileId": "90692",
      "name": "autosort and autoloot with testfile 1_0",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "21",
      "fileName": "autosort and autoloot with testfile 1_0-24678-.zip",
      "uploadedUnix": "1348754776",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/40379623a8974adb66c0debb1900bef9a49f2d64186dbe08164430167906ac24/analysis/1407189672/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/autosort%20and%20autoloot%20with%20testfile%201_0-24678-.zip?fid=90692&ttl=1535795763&ri=8192&rs=8192&setec=431f1115b1871ef6e97769fa30e15073"
    },
    {
      "fileId": "90696",
      "name": "Source code",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Source code-24678-1-0.rar",
      "uploadedUnix": "1348755081",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/916254c41d8fbfb233661ea3f614064982a12abe76db1a2237aa4af934697343/analysis/1407189673/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Source%20code-24678-1-0.rar?fid=90696&ttl=1535795763&ri=8192&rs=8192&setec=19ea365bd310a17f62b616e5e2704b84"
    },
    {
      "fileId": "93163",
      "name": "autosort and autoloot with testfile 1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21",
      "fileName": "autosort and autoloot with testfile 1_1-24678-1-1.zip",
      "uploadedUnix": "1349905579",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/84a885d1f0aa9e739860cc34c6d0ee308da01b927ecfa281418961dec97240f6/analysis/1407214157/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/autosort%20and%20autoloot%20with%20testfile%201_1-24678-1-1.zip?fid=93163&ttl=1535795763&ri=8192&rs=8192&setec=9efe2a5a6df1579d35d067a1808b6a4d"
    }
  ]
}