{
  "modId": 24687.0,
  "modName": "The Rabbit Hole Cave Hideout",
  "summary": "A small hidden hideout not far from Rorikstead",
  "descriptionHtml": "Description\r\n===================\r\n\r\nOk, basically, when I was looking for a hideout I had the following requirements for it in mind:\r\n\r\ni. It has to be a secret hideout and thus have a secret entrance\r\nii. Must be far away enough from any town, road, or warzone (Civil Unrest mod) so that it is not easily discovered, but at the same time have a central location in Skyrim \r\niii. Must be very simple, small, cosy, realistic and natural\r\niv. Must not be under a waterfall, because who wants to get soaking wet every time when entering. Or am I supposed to hold my shield up like an umbrella?\r\n\r\nUnfortunately I couldn\\'t find a mod that complied with all of these criteria so I decided to make my own simple hideout that did, and since it is now done, I might as well release it to the public.\r\n\r\nThis is probably the smallest hideout for Skyrim and is meant for temporary use.\r\n\r\nI am also making something more substantial as another hideout.\r\n\r\nInstallation\r\n====================\r\nPut file into Skyrim\\'s data folder and turn the mod on through data files menu at startup - or whatever your usual way to install is.\r\n\r\n\r\nLocation\r\n====================\r\n\r\nThe map location of the hideout is in the screenshots, but you may have to look closer to find the entrance. \r\n\r\n\r\nSuggested mods\r\n====================\r\nAny visual mod that makes Skyrim shadows darker, else the atmosphere inside just won\\'t be the same :)\r\n\r\n\r\nBugs\r\n====================\r\nThere shouldn\\'t be any bugs, but I noticed that occasionally some dead Stormcloak or imperial items ends up spawning near the entrance marker. Not sure if that has to do with this mod.\r\n\r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "Jedo",
  "createdUnix": "1348778069",
  "updatedUnix": "1348778955",
  "containsAdultContent": false,
  "uploadedBy": "Jedo_Dre",
  "primaryFile": null,
  "files": [
    {
      "fileId": "90753",
      "name": "The Rabbit Hole Cave Hideout v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "72",
      "fileName": "The Rabbit Hole Cave Hideout v1-24687-1-0.zip",
      "uploadedUnix": "1348778955",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f56370136aab2bef540078e70d7b97b8a56b7df9245b5d8ebf8650e2f72da84e/analysis/1407190343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Rabbit%20Hole%20Cave%20Hideout%20v1-24687-1-0.zip?fid=90753&ttl=1535795775&ri=8192&rs=8192&setec=ee2822b448401cd34aaa16af00d6746a"
    }
  ]
}