{
  "modId": 24689.0,
  "modName": "Sees-Through-Mist Argonian Healer",
  "summary": "An Argonian Healer Companion",
  "descriptionHtml": "[center][img]http://www.freeimagehosting.net/newuploads/ojq97.jpg[/img][/center]\r\n\r\n[center][size=+1]\\\"[i]I will find the stickplace, for I am Sees-Through-Mist, the best Argonian! Better than dog, better than crab, better than dragonfly!!![/i]\\\"[/size][/center]\r\n\r\nSees-Through-Mist is a functioning healer. His heals are scaled (get it?) and will work on you and all your allies.\r\n\r\nHe\\'ll also grant you XP for attacks that he makes.\r\n\r\n\r\n[size=+1][color=lightgreen]Skills[/color][/size]:\r\n\r\nMain - One Handed, Alteration, Restoration.\r\n\r\nSecondary - Destruction, Block, Sneak, Light Armor.\r\n\r\n[size=+1][color=cyan]Abilities[/color][/size]:\r\n\r\n[color=lightgreen]Healed-by-Mist[/color]  -  An initial heal followed by a heal over time. This scales as he levels with you.\r\n\r\n[color=orange]Shared XP gain[/color]  -  Sees-Through-Mist shares the xp gained in most of his skills with the player. \r\n\r\n[color=green]Burns-Through-Skin[/color]  -  All of his melee attacks deal poison damage and reduce magic resistance. \r\n\r\n[color=green]Burns-With-Spit[/color]  -  He can also project a venemous bile from his mouth that burns your enemies. He doesn\\'t do it too often, but how often would you want to vomit poison?\r\n\r\n[color=brown]Bash-Through-Shells[/color]  -  Sees-Through-Mist is able to smite mudcrabs with his melee strikes. Rid the coastlines of these shelled fiends!\r\n\r\n[color=purple]Summonable[/color]  -  Sees-Through-Mist carries a tome that teaches you to summon him. Scale mountains and jump off of cliffs without worrying about losing him!\r\n\r\n[size=+1][color=orange]Perks[/color][/size]:\r\n\r\n- Savage Strikes (for decapitation)\r\n- Armsman (3)\r\n- Bladesman (1)\r\n- Agile Defender (2)\r\n- Atronach\r\n- Magic Resistance (1)\r\n- Light Footed\r\n\r\n\r\n[size=+2]Story:[/size]\r\n\r\nSees-Through-Mist has spent most of his days as a drifter, doing odd jobs for odd people. It has been a meager existence, but it has at least allowed him to travel. \r\n\r\nRecently, he has found himself in Morthal under the employ of Lami, at the Thaumaturgist Hut. \r\n\r\nLami had him gathering ingredients from the surrounding area. He enjoyed this greatly, as it fit well with his hobby of smashing mudcrabs and trying to train the local dogs to speak. \r\n\r\nThings were going well for Sees-Through-Mist, until one day he discovered the wonderful taste of sticks. \r\n\r\nRealizing that he would need a suitable and secure place to keep this newfound treasure, he has decided to set out on a life of adventure.\r\n\r\nTake Sees-Through-Mist and his sticks along on your journeys and he\\'ll pay you back with heals, xp and an insatiable hatred for mudcrabs!\r\n\r\n[size=+1]Requirements:[/size]\r\n\r\n- There shouldn\\'t be any!\r\n\r\n[size=+1]Conflicts:[/size]\r\n\r\n- It\\'s a pretty simple mod with few scripts. His heals use vanilla FX and conditions, and are attached to invisible armor spells. If they don\\'t work, check which mods affect armor spells or NPC AI.\r\n\r\n[size=+2][color=red]Changelog[/color][/size]\r\n\r\n1.01\r\n\r\n- Made the FX on his heal less obnoxious, given the rate he sometimes casts it at.\r\n\r\n\r\n\r\n\r\n[size=+1]Extra Info:[/size]\r\n\r\nThe heals do work! The reason they work is because the AI has no idea that they\\'re heals at all. The game thinks he\\'s casting short, levelled armor spells. \r\n\r\nSo technically... Sees-Through-Mist is only healing you by accident. Not quite the intelligent healing of Cerwiden, mind you, but Sees-Through-Mist isn\\'t a highly trained healer. He\\'s a stick eating Argonian, which is about the difference between Mujuro and me anyway :P\r\n\r\nHe\\'s set to favor melee, magic and staves. If you find he\\'s not healing you reliably enough, try taking away any staves, shields or extra 1-handed weapons from him. He\\'s most reliable when he has a single 1-handed weapon. \r\n\r\nI really only added the staff preference so that if you\\'re already a healer, you could give him a staff and he\\'ll make use of his destruction skill.\r\n\r\nI did enable dual wielding, but that\\'s also more for people who do their own healing and would prefer he focus on melee. \r\n\r\nHe\\'s also set to essential, and is marriagable. I\\'ll make a protected esp if there\\'s a request.\r\n\r\nI used [url=http://skyrim.nexusmods.com/mods/19826]elaborate textiles[/url] in the screenshots, as well as [url=http://skyrim.nexusmods.com/mods/4869]covereyes[/url] (though I compressed the hell out of it for my own use). The sword is an Argonian blade, from [url=http://skyrim.nexusmods.com/mods/1002]Jaysus Swords[/url].\r\n\r\nBig thanks to Janusforbeare again. The summon script makes things so much more convenient. Be sure to check out his mods, [url=http://skyrim.nexusmods.com/mods/19348]Atvir Dres[/url] and [url=http://skyrim.nexusmods.com/mods/23043]fighting words[/url] if you haven\\'t already.\r\n\r\n\r\nIf you want more followers with custom abilities like these, check out my other mod [url=http://skyrim.nexusmods.com/mods/23937]Coffee\\'s Companions[/url]\r\n\r\nHappy Gaming!",
  "categoryId": "66",
  "version": "1.01",
  "author": "Coffee Mandibles",
  "createdUnix": "1348778509",
  "updatedUnix": "1348787630",
  "containsAdultContent": false,
  "uploadedBy": "CoffeMandibles",
  "primaryFile": null,
  "files": [
    {
      "fileId": "90777",
      "name": "Sees-Through-Mist",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "125",
      "fileName": "Sees-Through-Mist-24689-1-01.zip",
      "uploadedUnix": "1348787630",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/63396e93b5480b628fe5f08332f4fb7a1b2d4b86c86e23ed163ab8597e215b8e/analysis/1407190624/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sees-Through-Mist-24689-1-01.zip?fid=90777&ttl=1535795777&ri=8192&rs=8192&setec=146bada87c759aeb9ea1d058b8ae8da7"
    }
  ]
}