{
  "modId": 2471.0,
  "modName": "A Grey Dragon Mask Hood Mod",
  "summary": "Ever felt like your Dragon Priest Mask didn\\'t go with any of your outfits because the hood was brown? Well, you never have to worry about that again with Grey Dragon Priest Mask Hoods!",
  "descriptionHtml": "[color=deeppink]=====DESCRIPTION=====\r\n\r\nThis mod is a texture replacer for the hood that comes with each of the Dragon Priest Masks in the game (excluding the \\\"Ultra\\\" one). Where originally the hood is brown, I have simpy changed it so that it is grey. I acknowledge the simplicity of this mod, but I made this purely for self-use and am offering it to you, as I know some people have been searching for something similar.\r\n\r\n\\\"I\\'ve been looking for something like this for ages!\\\"\r\n\r\n\\\"Awesome, now I can actually wear these again! Great idea!\\\"[/color]\r\n\r\n[color=Chartreuse]=====INSTALLING=====\r\n\r\nNOTE: You can download it with the Nexus Mod Manager if you so choose, and there will be no need for installation.\r\n\r\nI have chosen not to include a ReadMe with this mod, as it is a very simple texture replacement. Please take a few seconds here to read up on the process. Once you have downloaded and extracted the mod, simply place the folder named \\\"textures\\\" into your Skyrim \\\"Data\\\" folder. For most of you, this will be: \r\n\r\nC:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data[/color]\r\n\r\n[color=DeepSkyBlue]=====UNINSTALLING=====\r\n\r\nTo uninstall this texture replacer, simply enter the \\\"Data\\\" folder in your Skyrim directory, then enter \\\"textures\\\" and \\\"armor\\\" then delete the folder named \\\"dragonpriesthelm\\\". Please remember to leave constructive feedback on un-installation.[/color]\r\n\r\n[color=orange]=====PLEASE NOTE=====\r\n\r\nThis mod [i]replaces[/i] the texture of the Dragon Priest Mask Hood so - as long as this mod is installed - you will not encounter an original, brown version.\r\n\r\nPlease remember to comment with ideas and criticisms!\r\nNow, download, install, and enjoy! [/color]",
  "categoryId": "54",
  "version": "V1.0",
  "author": "Ojox",
  "createdUnix": "1322902935",
  "updatedUnix": "1322903272",
  "containsAdultContent": false,
  "uploadedBy": "Ojox",
  "primaryFile": null,
  "files": [
    {
      "fileId": "6484",
      "name": "Grey Dragon Priest Mask Hoods",
      "version": "V1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "953",
      "fileName": "Grey Dragon Priest Mask Hoods-2471.rar",
      "uploadedUnix": "1322903272",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/36794d07830572182a71d93becea53c8f297b00629355a4b3c95bc095331b371/analysis/1406472492/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grey%20Dragon%20Priest%20Mask%20Hoods-2471.rar?fid=6484&ttl=1535756719&ri=8192&rs=8192&setec=b74801e60767d2c10fd1fe93027e9452"
    }
  ]
}