{
  "modId": 24724.0,
  "modName": "Nature Spells",
  "summary": "2 new alteration spells \\\"nature\\\" based. ",
  "descriptionHtml": "[color=Orange][size=6]Sadly I won\\'t update this mod anymore. Time doesn\\'t allow me. Still this mod works good as it is. I\\'m sorry. Maybe at some point, I will come back. Or if I have some more time I will work a little more on it.[/size][/color]\r\n\r\n[color=yellow][size=5]Created for skyrim 1.8. I don\\'t know if it will work for future versions.[/size]\r\n\r\n[/color]\r\n\r\nIt always bugged me that Skyrim didn\\'t have spells suitable for elfs and/or druids.. only fire,ice and thunder...so I decided to make some of my own. There is a bunch of mods that adds lots of spells but none was to my taste. \r\n\r\nThis is my first mod so there is bound to be bugs ( though I tested it and for me it worked well ) and also I created it for my self after my personal taste then decided to share it if there is someone who feels my pain. So if you don\\'t like it, don\\'t download it. \r\nAlso the spells may be a little overpowered (I tested them with master difficulty and some mods that make game play a bit harder so there is this chance). \r\nPlease report any bugs.\r\n\r\nThis mod adds 2 new spells in the alteration tree \r\nNature Grab-a spell similar to flames or frost bite only that it burst some leafs or bugs that does 15 dmg/sec+extra 3 dmg for 22 secs-require Alteration 50. \r\nNature Claw-a spell similar to fire bolt or ice spike that blast an ball of \\\"nature power\\\" with 35 dmg.-require Alteration 100\r\n\r\nYou can get the spells via console if you want or you can buy them from an Thalmor Elf called \\\"Nature teacher\\\" that hangs around in Riverwood on the isle near the big tree (see the screenshot) .. you will find hear in the bushes or she\\'ll walk around (thought it seems that not always she does that and mostly just sits there staring at the bush..kinda creepy). Initially I wanted to make her teach you the spells like the Greybeards when they teach you the shouts ... but I failed big time. \r\n\r\nInstalation :\r\n\r\nCopy the .esp file in your data folder and activate it. It should work with NMM too.\r\n\r\nUninstalation :\r\n\r\nDisable the .esp then delete it. \r\n\r\nCompatibility :\r\n\r\nIt should not conflict with anything as this mods was created from scratch and uses Skyrim default textures and animations as resources and does not replace anything. There is possbile to conflict with mods that add objects on the same spot where is the vendor, other than that i can\\'t think of anything.\r\n\r\nOnly one note here though (even I don\\'t thing its the case but just to be sure) I tried to create an shout/power and I was messing around with the values of the original shouts, it is possible that my .esp file contains information about shouts (like damage or recharge time). I kept the vanilla values but it\\'s possible that they got stored, so if you have an mod that alters shouts ( especially fire breath ) load that mod AFTER mine.\r\nTo be sure place my mod at the top of the load order, this will prevent any unwanted modification (if they even exists). \r\n\r\n[s]Future plans :\r\n\r\n-I will try to make an shout/power if you guys like this spells.\r\n-An summoning spells\r\n-An transform spell\r\n-Some more spells[/s]\r\n\r\nHope you like the mod, and enjoy it.\r\n\r\nRegards,\r\nmKta.",
  "categoryId": "75",
  "version": "1.0",
  "author": "mKta",
  "createdUnix": "1348849007",
  "updatedUnix": "1348849077",
  "containsAdultContent": false,
  "uploadedBy": "mkta",
  "primaryFile": null,
  "files": [
    {
      "fileId": "90892",
      "name": "Nature Spells And Vendor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Nature Spells And Vendor - mkta-24724-1-0.rar",
      "uploadedUnix": "1348849077",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4ad92ed6dd48a03dd9bdaee2b13c7fa7c875177a8ee5ffbb9b33f709623fed1b/analysis/1407191762/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nature%20Spells%20And%20Vendor%20-%20mkta-24724-1-0.rar?fid=90892&ttl=1535795845&ri=8192&rs=8192&setec=58b2ca2f85f1bb36973ff76823d8ff9f"
    }
  ]
}