{
  "modId": 24752.0,
  "modName": "Veiled Keep",
  "summary": "A Dwarven-influenced modest player-home suited for the burdened Dovahkiin. ",
  "descriptionHtml": "Near the place where it all began, between the spring grass of Riverwood and the snowy mountains above, an ancient and crumbling Dwarven ruin stands. Hidden in a small valley with only one entrance, it\\'s perfect for a weary adventurer to set up home. After outfitting the ruin with a small study for alchemical research, a sturdy bed, and plenty of storage for treasure, it\\'s finally been transformed from cold stone to home. \r\n\r\n----------------------------------------------------------------------------------------------\r\n\r\n[b]Veiled Keep - No Loading Doors.[/b]\r\n\r\nAnother one of my Dwarven themed homes, this one is more of a refined model of previous tries. I\\'ve been trying and trying to build myself a home I truly like and I believe this could be the one. I love Dwarven style, creating uses for the many mechanical structures they invented. I  wanted to keep the thought of a home being inhabited by something other than Dwemer, and straying away from a perfect home. It\\'s not meant to be clean and fully restored, as that would be impossible. I wanted to give additions such as the bed, which is just simply the best an adventurer could do. The forge is restored as best that could be accomplished. The smelter, also Dwarven, is essentially solid throughout so it still stands as it would before. Pipes have been cleaned and reworked, enabling the heating and passage of water. The placement of the home is between the \\\"winter\\\" and \\\"spring\\\" parts of Skyrim, and melting snow brings crystal clear water near the home. The constructs are efficient with the use of this water, heating and recycling the water through the already hot smelter. The home itself is quite small, but efficient in utilizing space. There are many bookshelves and some large display shelves that are functional. The study also has 2 large bookshelves. The apothecary, forge, and smelter are all \\\"Dwarvenized\\\" and hopefully look stunning for any who use them. \r\n\r\nBattling myself with how I wanted my home to look was difficult. Hidden or showy? Large or small? Outdoor or indoor? Loading screen or not? I finally settled with an outdoor home free from load doors, allowing natural light and shadows, and plenty of fresh air. The view from the home is spectacular as well. I love the idea of a hidden home, but didn\\'t want a hole in the ground as a presentation. I decided to surround the home with mountains with only a small cave-like entrance. Still, no load zones. \r\n\r\nAlso, I assume most of the gamers want a home that truly feels like home for a hero. Full of treasures or trinkets on display, weapons on racks, and treasure in chests. I tried my best to fill this home completely with customizable displays. The best way I found, as I\\'m not much of a modder, is using the BRILLIANT mod \\\"Unlimited Bookshelves\\\". Without this mod, I\\'m not 100% sure if the bookshelves will work. I included all the available busts of the priest masks as well, near a nice waterfall. I\\'m not 100% sure if there is a bust for the final mask, but if someone points it out I\\'ll be glad to add it. \r\n\r\n[u]INSTALLATION--->[/u]\r\n\r\nUse NMM or simply extract into main data folder.\r\n\r\nPlease, please, make a new save and make sure this doesn\\'t somehow mess up your game before overwriting. I don\\'t want to cause anyone any unnecessary pain.\r\n\r\nALSO, I\\'m not sure if followers will get stuck here or not. Like I said, I\\'m not an experienced modder so feel free to send me a message.\r\n\r\n[u]FUTURE PLANS[/u]\r\n\r\nIf I can find time to continue with this mod, and I have the good luck of learning how to implement these, I will update with these changes:\r\n\r\n* Working valve to turn water on and off (If someone can tell me how to do this, please do.)\r\n* [s]Enchanting table if enough request it.[/s]\r\n* Refine bookshelves to work a little more securely.\r\n* Add 9th Mask Bust\r\n* Get followers working correctly.\r\n\r\n[u]RECOMMENDED MODS[/u]\r\n\r\n*Unlimited Bookshelves by da5id2701- [url=http://skyrim.nexusmods.com/mods/10891]Unlimited Bookshelves[/url]\r\n*Insane0h ReAl Sunflare  by insane0hflex - [url=http://skyrim.nexusmods.com/mods/866]ReAl Sun[/url]\r\n\r\nLike I said, without Unlimited Bookshelves, the books might not store properly, so definitely pick up that mod if you don\\'t have it. It\\'s amazing. And the sunflare adds so much to the game. :)\r\n\r\n[u]THANKS[/u]\r\n\r\nThanks to da5id2701 and insane0hflex for their mod\\'s and contribution to this awesome modding community. If either of you wish not to be mentioned here, of if I missed something/someone, please let me know. \r\nThanks also to you for downloading/reading and to Skyrim Nexus.\r\n\r\n\r\n",
  "categoryId": "67",
  "version": "1.1",
  "author": "Silaent",
  "createdUnix": "1348891371",
  "updatedUnix": "1349765765",
  "containsAdultContent": false,
  "uploadedBy": "silaent",
  "primaryFile": null,
  "files": [
    {
      "fileId": "91007",
      "name": "VeiledKeep",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "89",
      "fileName": "VeiledKeep-24752-1-0.7z",
      "uploadedUnix": "1348891750",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a4813bb00bda292ce28cd4cef0c2e83dd04f029796d524eead7dc98c0a0dbb78/analysis/1407192610/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VeiledKeep-24752-1-0.7z?fid=91007&ttl=1535795906&ri=8192&rs=8192&setec=05b5e95a38c9ef9deaf635f8f0121371"
    },
    {
      "fileId": "92904",
      "name": "VeiledKeep",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "93",
      "fileName": "VeiledKeep-24752-1-1.7z",
      "uploadedUnix": "1349765765",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/dc3b476eeb3a8770cd7b224fa39a89f607524446c478100751b74f7ab8ab85d0/analysis/1407211226/",
      "changelogHtml": " Added Enchanting Table to Study <br/> \n Added piping and \\\"hot tub\\\" <br/> \n Added additional waterfall and cleaned up ground  <br/> \n Added some clutter <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VeiledKeep-24752-1-1.7z?fid=92904&ttl=1535795906&ri=8192&rs=8192&setec=b36087c17f145308df91187cc9edaeaa"
    }
  ]
}