{
  "modId": 24808.0,
  "modName": "Invisible Body Parts",
  "summary": "Makes individual body parts invisible to the player",
  "descriptionHtml": "This mod adds items to the game that you can wear which make your body parts invisible (but only to yourself)\r\n\r\nThe individual body parts are feet, hands, head, and body. So if you equip the items on your head, body, and feet, you will appear as a floating set of hands. If you equip them on your hands, feet, and body, you will appear as a floating head.\r\n\r\nThere are 12 items in total. A set of 4 pieces (head, feet, hands, and body) for each of the 3 armor types (heavy, light, and cloth. The heavy and light variants will yield an armor rating of 500 with their respective armor skill at 100 with all perks.\r\n\r\n[size=3]Note that all this does is make the body textures and shadow not visible to the player.[/size][size=4][color=yellow] NPC\\'s will still see you.[/color][/size]\r\n\r\nThe items can be found in the barrel outside the blacksmith\\'s house in Whiterun, and the barrel respawns so you can get another set after a while if you sell/lose the items.\r\n\r\nWhy did I make this? Well I just kind of stumbled upon it while trying to do something else in the CK and I thought it was kinda neat. I don\\'t really know what the hell anyone would use this for, but maybe someone would find a use for it for... something.",
  "categoryId": "28",
  "version": "1.0",
  "author": "HiFiSi",
  "createdUnix": "1348994234",
  "updatedUnix": "1348994291",
  "containsAdultContent": false,
  "uploadedBy": "HiFiSi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "91232",
      "name": "Invisible Body Parts",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Invisible Body Parts-24808-1-0.rar",
      "uploadedUnix": "1348994291",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/789c977964c39a246c83be965a2004ec4d73a195bf2c1db9fbd232dda128d305/analysis/1407195311/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Invisible%20Body%20Parts-24808-1-0.rar?fid=91232&ttl=1535795995&ri=8192&rs=8192&setec=6665376b04d4901bba429e00162bb9ac"
    }
  ]
}