{
  "modId": 24814.0,
  "modName": "Ritual Armor of Boethiah",
  "summary": "Forgeable dragonscale armor set & enchanted half-cloak (made from rendering a black dragon). Adjusts for all races, sizes, and both sexes.  Detailed and uniquely designed yet consistent with Skyrim&#39;s environment, materials & lore. The Ritual Armor of Boethiah was originally forged only by dark elf cultists worshiping the daedric prince Boethiah",
  "descriptionHtml": "[center][img]http://i.imgur.com/OSreqXx.png[/img][/center]\r<br />[img]http://i.imgur.com/XpAAN.png[/img]\r<br />[size=3]Ritual Armor of Boethiah was originally designed and forged by dark elf cultists worshiping the daedric prince Boethiah. This ancient design has been rediscovered (through a thought to be lost book found at the Sacellum of Boethiah) and modified to incorporate black dragon renderings as further armor reinforcements. Only the Champion of Boethiah has the unique knowledge to reforge this eldritch armor.[/size]\r<br />[img]http://imgur.com/JxkqV.png][/img]\r<br />[size=3]Completely new forgeable / upgradeable / enchantable stand-alone dragonscale armor set (made from the renderings of a black dragon).  Includes custom helm, cuirass, guantlets, boots plus a mask and an enchanted leather half-cloak (called Ritual Shroud of Boethiah) as additional worn armor pieces.  The armor can only be forged at the Ritual Forge which has been added to the Sacellum of Boethiah, along with a storage chest and workbench.[/size]\r<br />[center][img]http://i.imgur.com/IbfdU.png[/img][/center][size=3]The Ritual Shroud of Boethiah is enchanted with a new magickal property called &#39;Despair&#39;.[/size][size=2] The enchantment has two effects: when sneaking the wearer is silent (muffle) & when a hostile opponant gets too close they are struck by Despair and their movement is slowed.  The slowing effect is stronger than the normal slowing seen by using frost based spells but not so strong as to be paralyzing.  The effects of Despair will fade from the opponent/prey about 5 seconds after being affected, but will reactivate if they again get within range.  Fairly subtle visuals are also added to the victim of Despair.  The visual effects of sneaking and when the Despair shroud is activated are slightly different: swirling semi-transparent black smokey tendrils and dark clouds will slowly crawl across the characters face, armor and weapons when attacked. This can be a very effective alarm system by itself, alerting you to the first signs of an attack. This effect is similar to Ebony Mail but I&#39;ve changed it quite a bit so as not to be so dark and obtrusive, also it won&#39;t obstruct 1st person views at all.  When sneaking the visual effect is the same except there are no smokey tendrils.  And no, the Shroud can&#39;t be disenchanted as it is sort of a minor daedric relic.[/size]\r<br />[center][img]http://i.imgur.com/7nBIU.png[/img][/center]\r<br />[size=2]All pieces adjust for all races, sizes, and both sexes. Highly detailed and uniquely designed yet consistent with Skyrim&#39;s environment, materials & lore. This is a completely stand alone armor set that should not conflict with or replace anything.  The &#39;Shroud&#39; being a new custom item has been specially fitted for the armor but I have tried to adjust it to fit over robes and other light armors and is wearable with most cloaks. [/size]\r<br />\r<br />[size=2]One NPC involved in the early part of the quest &#39;Boethiah&#39;s Calling&#39; is outfitted in a full set of this armor.  Because of this I advise you to put this mod at the bottom of the load order to avoid any conflicts with mods that change leveled outfit lists for NPC&#39;s and such. \r<br />  [/size]\r<br />[center][size=3]Video Reviews[/size][size=2] (check out more in the Video section)[/size][/center]\r<br />[center][youtube]EB1jfeoAfCk[/youtube]  [youtube]Hh8dVWvkZPE[/youtube][/center]\r<br />\r<br />[img]http://imgur.com/4bsfL.png][/img]\r<br />[center][size=3]This armor set can only be forged once the player becomes the Champion of Boethiah\r<br />by completing the quest &#39;Boethiah&#39;s Calling&#39; which becomes available at level 30.\r<br />It can only be forged using the Ritual Forge located at the Sacellum of Boethiah.[/size][/center]\r<br />[size=2]If the player installs this mod before completing the quest they will be granted the ability &#39;Champion of Boethiah&#39; as soon as they complete it. If however the player has already completed the quest when installing this mod they will need to read a new book called &#39;Ritual Armor of Boethiah&#39; found at the Sacellum of Boethiah near the Ritual Forge. In either case it is recommended the player get the book, as it contains extra lore and detailed descriptions of the armor and magickal properties of the &#39;Shroud&#39;. \r<br />\r<br />The armor itself is light dragonscale armor with a slightly better armor rating and requires a couple extra materials to forge (daedric heart, ebony ingot) so you will of course need to be able to forge dragon armor in addition to completing the quest above. The Shroud requires additional void salts and a black soul gem (filled) as well.[/size] \r<br />\r<br />[size=3]Any and all comments and screenshots are truly welcome and encouraged and let me know if you find any bugs or wierdness, exhaustively tested but you never know.[/size]\r<br />\r<br />[center][size=3][url=http://skyrim.nexusmods.com/mods/27501#content]Official Skyrim Redone (SkyRe) Compatibility Patch by Lindy[/url][/size][/center]\r<br />\r<br />[center][size=3]Full Translations on Nexus[/size][/center]\r<br />[center][url=http://skyrim.nexusmods.com/mods/25027][img]http://i.imgur.com/8XNPN.png[/img][/url][img]http://i.imgur.com/Y0RYF.png[/img][url=http://skyrim.nexusmods.com/mods/29182][img]http://i.imgur.com/CtImL.png[/img][/url][/center]\r<br />[img]http://imgur.com/I1As8.png][/img]\r<br />[size=2]Thunderous heartfelt thanks to Bethesda for creating not just a game, but an entire world.\r<br />And to Todd Howard if you&#39;re reading this, I&#39;d work for you guys in a New York minute.\r<br />Thanks to The Nexus itself for providing this unparalleled resource for exchanging ideas, opinions, and labors of love.\r<br />To all the great helpful people on the forums and those posting comments, screenshots, endorsing, voting, modding, reviewing or even just silently checking out and downloading I am immensely grateful.  Having your work seen, discussed, used and appreciated is the ultimate reward for any artist...truly the fuel that makes any of this possible, so thank you all.\r<br />Sincere Up&#39;s to those who have been following this since the first fumbling release of the helm (on the old site).  You guys/gals all kept me inspired and motivated to see this project through, so for all of you old schoolers the next round of mead is on me.\r<br />Special thanks for [url=http://skyrim.nexusmods.com/mods/30450/]Realistic Lighting Overhaul[/url] by The Realistic Lighting Team.  I highly recommend this mod if you really want to see all the immersive details of the armor and Skyrim itself.  It&#39;s like night & day.   \r<br />Also thanks to nuska for [url=http://skyrim.nexusmods.com/mods/24273]Ethereal Elven Overhaul[/url].  Beautifully done, used in my screenshots.[/size]\r<br />\r<br />[size=3]~Wasbunny [/size] ",
  "categoryId": "54",
  "version": "4.24",
  "author": "Wasbunny",
  "createdUnix": "1349000578",
  "updatedUnix": "1357002595",
  "containsAdultContent": false,
  "uploadedBy": "Wasbunny",
  "primaryFile": null,
  "files": [
    {
      "fileId": "108803",
      "name": "Ritual Armor of Boethiah",
      "version": "4.24",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "47929",
      "fileName": "Ritual Armor of Boethiah-24814-4-24.zip",
      "uploadedUnix": "1357002595",
      "modVersion": "4.24",
      "virusScanUrl": "https://www.virustotal.com/file/75c6c5892bbae893df62cf6fbaf873a73ac6d1d1d66824b10878066e06eb9cf3/analysis/1407331638/",
      "changelogHtml": " Overall mesh & texture improvements, fixes, tweaks and spit-shine. <br/> \n As good as it&#39;s going to get...at least until 2013. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ritual%20Armor%20of%20Boethiah-24814-4-24.zip?fid=108803&ttl=1535796006&ri=8192&rs=8192&setec=5bd012b1a301eb8dabc3e0abb88388b2"
    }
  ]
}