{
  "modId": 24832.0,
  "modName": "Freedom of Speech",
  "summary": "Removing the strings attached to Shouting, and the Stones of Barenziah.",
  "descriptionHtml": "[IMG]http://i.imgur.com/SmlBT.jpg[/IMG]\r\n\r\n\r\n[center][size=4][color=cyan][b]Localizations:[/b][/color][/size][/center]\r\n[center][url=http://skyrim.nexusmods.com/mods/24839][IMG]http://i.imgur.com/gRlmQ.jpg[/IMG][/url][/center]\r\n\r\n\r\n[size=4][color=cyan][b]Requirements:[/b][/color][/size]\r\n\r\n-\tSkyrim version 1.7.7.0.6 or later. \r\n-       It is recommended you install this mod into a new game. Limitations of Papyrus and the Word Wall scripts may yield unpredictable results on already existing games.\r\n\r\n\r\n[size=4][color=cyan][b]Overview[/b][/color][/size]\r\n\r\n\tLet’s face it, we love to Shout. Trouble is in Skyrim, several of the Word Walls are locked inside of dungeons that are tied to a quest, and as such are inaccessible until that particular quest requires you to enter. This results in incomplete Shouts for people who want to roleplay and not join certain factions, which tends to leave a bitter flavor in our mouths. We want to be able to fully utilize those Shouts, but can’t without breaking character.\r\n\r\n\tThat is where this mod steps in. This mod takes all of those Word Walls locked behind quest-specific doors, and moves them elsewhere; somewhere freely accessible by everyone. Now your mage character will not be forced to join the Companions if he wants to master his Fire Breath, and same for the warrior who desires to master his Ice Form but has no intention of joining the College of Winterhold.\r\n\r\n\r\n[size=4][color=cyan][b]Features[/b][/color][/size]\r\n\r\nWhich Word Walls have been moved and where:\r\n\r\n[b]Dark Brotherhood Sanctuary (Marked for Death):[/b] Moved to Guldun\\'s Rock.\r\n[b]Dustman’s Cain (Fire Breath):[/b] Moved to Blind Cliff Towers.\r\n[b]Korvanjund (Slow Time):[/b] Moved to Deepwood Redoubt.\r\n[b]Labyrinthian (Slow Time):[/b] Moved to Silent Moons Camp.\r\n[b]Saarthal (Ice Form):[/b] Moved to Arcwind Point.\r\n[b]Snow Veil Sanctum (Disarm):[/b] Moved outside.\r\n[b]Ysgramor\\'s Tomb (Animal Allegiance):[/b] Moved slightly north.\r\n\r\nAdditionally, if you are using Dawnguard, a separate version of the mod is provided that moves the Word of Drain Vitality found at Arcwind Point to the Soul Cairn, so that people who elect not to play through Dawnguard will never be exposed to any of the new Shouts.\r\n\r\nAdditionally, two faction-locked Stones of Barenziah are moved to:\r\n\r\n[b]Dark Brotherhood Sanctuary:[/b] Moved outside.\r\n[b]College of Winterhold:[/b] Moved to the Jarl’s Longhouse in Winterhold.\r\n\r\n\r\n\r\n[size=4][color=cyan][b]Installation[/b][/color][/size]\r\n\r\n[b]Wrye Bash users:[/b] The mod is provided in a BAIN-friendly format so that you may quickly drop it into your Installers folder and install.\r\n\r\n[b]Nexus Mod Manager users:[/b] Nexus Mod Manager will be able to handle the packaging of this mod on its own, you won’t need to do anything fancy. Just convert it into an FOMOD and install.\r\n\r\n[b]If you use none of the above:[/b] Just drag and drop the provided files into your Skyrim\\\\Data folder.\r\n\r\n[color=red][b]Only one plugin should be active at a time. Use only the Dawnguard version if you have Dawnguard, and vice versa.[/b][/color]\r\n\r\n\r\n[size=4][color=cyan][b]Uninstallation[/b][/color][/size]\r\n\r\n[b]Wrye Bash users:[/b] Very easy, just navigate to the package in your installers tab and choose Uninstall.\r\n\r\n[b]Nexus Mod Manager:[/b] Again, very easy. Just deactivate the mod.\r\n\r\n[b]If you use none of the above:[/b] Simply follow the steps for Steam Workshop minus the need to unsubscribe.\r\n\r\n\r\n[size=4][color=cyan][b]Configuration[/b][/color][/size]\r\n\r\nIt is best to install this mod when starting a new game. It is not guaranteed that this mod will work correctly on pre-existing games, especially if you have already discovered a Word of Power that this mod is replacing with a new one.\r\n\r\n\r\n[size=4][color=cyan][b]Compatibility[/b][/color][/size]\r\n\r\n\tIncompatibilities with certain Cells are to be expected as this mod places new objects in certain Cells in the game and alters NavMesh, but the chances of such a conflict surfacing is minimal.\r\n\r\nAny mods that alter the quest “TGCrown” will be incompatible with this one.\r\n\r\n[b]USKP Users:[/b] Any fixes made to the quest have been imported. Although this mod does conflict, it is only superficial.\r\n\r\n\r\n[size=4][color=cyan][b]Known Issues[/b][/color][/size]\r\n\r\n\tIf you have already discovered a Word of Power in a quest-locked dungeon and mastered that corresponding Shout, you might encounter certain Word Walls that are inactive and don’t do anything. This is because you have already mastered the Shout it was meant to provide a Word for. Nothing is wrong with them.\r\n\r\n   Despite my best efforts, the Word Wall at Guldun Rock will only work properly for the third Word of Power you must obtain for Marked for Death. Once you have obtained the first two Words of Power for Marked For Death at Autumnwatch Tower and Forsaken Cave, you may then travel to Guldun Rock to obtain the final Word of Power from there.\r\n\r\n\r\n[size=4][color=cyan][b]Permissions[/b][/color][/size]\r\n\r\n- You are free to alter, expand on, or destroy this mod in any way you see fit. If you wish to share your work, however, you MUST contact me and obtain my explicit permission before doing so. Any instances of severe mod destruction will not be eligible for technical support until restored to a functional state.\r\n- Any works that are found to be in breach of the above, the author will receive a single polite request from me to remove it from wherever it is being hosted (from all sites it is being hosted on). Failure to respond within 48 hours will result in more direct action being taken.\r\n- DO NOT upload this mod to any site other than those I have personally uploaded it to without my express permission given. Any user or site found in violation of this will be considered to be stealing intellectual property and will be treated as such. Just because this mod is free does not mean that gives you free reign over what you can do with it. My work, my rules.\r\n- If I fail to respond to your requests to expand or alter this mod within 30 days, you may consider yourself as having my approval to do as you wish, but please note that upload location restrictions still stand.\r\n- Translators: please simply PM me if you wish to translate this mod. If you wish to upload the translated version to one of my current mirrors, you may consider my answer to be “yes” outright. If you wish to upload elsewhere, though, you must obtain my permission to do so. All I wish to know is that the mod is being translated, and anyone who wishes to do so has my approval.\r\n- Compatibility: Please send me a message that you have made a compatibility patch for this mod so that I can be made aware of its presence. You do not need to wait for my permission to release compatibility patches, but I appreciate you informing me of their existence so I can factor for them.\r\n\r\n",
  "categoryId": "24",
  "version": "1.2",
  "author": "Thomas Kaira",
  "createdUnix": "1349031153",
  "updatedUnix": "1356135089",
  "containsAdultContent": false,
  "uploadedBy": "Thomas Kaira",
  "primaryFile": null,
  "files": [
    {
      "fileId": "106687",
      "name": "Freedom of Speech v1-2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "406",
      "fileName": "Freedom of Speech v1-2-24832-1-2.7z",
      "uploadedUnix": "1356135089",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/a632602dcaed9cf6753438271dfdfb45bdb64593367b8e1ba02ff76acdc7b228/analysis/1407316265/",
      "changelogHtml": " (New Feature) Now moves faction-locked Stones of Barenziah, so that Thieves Guild members do not need to join the College of Winterhold and be greeted by the Dark Brotherhood to complete the quest. <br/> \n (Other) Mod cleaned in TES5Edit. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Freedom%20of%20Speech%20v1-2-24832-1-2.7z?fid=106687&ttl=1535796037&ri=8192&rs=8192&setec=d2dbc83f941f71569d49a65f828e571c"
    }
  ]
}