{
  "modId": 24831.0,
  "modName": "A Set of Saves MQ Done Legit JUST Reset to LVL 1 min world impact",
  "summary": "Based on Steptakers save game, Abiola, with the MQ done (legit play through, no console, min impact) this is a great start to just go through Skyrim and do what you want without the pesky MQ. Char was reset to Level 1 AFTER MQ was done, with minimal world impact. ",
  "descriptionHtml": "If you use these, I\\'d love for you to upload a few pics!\r\n\r\nSteptaker made this save: http://skyrim.nexusmods.com/mods/5597 with the main quest finished and with minimal impact on the world. He then reset the characters level to 1, so you can have a fresh start minus the pesky MQ. He DID NOT use the console to finish the MQ. Which is great! He did, after finishing the MQ, reset the level to one. So you can level up, pick perks etc All as you want. Every other quest remains available and untouched!\r\n\r\nPlease feel free to give me feedback. I\\'ll will prolly upload more to this if enough people want them!\r\n\r\nAfter doing a play through of the game, I wanted to just enjoy being in Skyrim, doing what I wanted. This start has been fantastic for that. I used the Showracemenu command and created several new characters to play with starting from level 1 and no main quest to bother with! No bugs, no weird surprises. So here are 3 characters you might like to wander Skyrim with. \r\n\r\nBlackthorne (Imperial): For the evil Mage/Necromancer/Vampire types, I made him in the style of Rasputin, dark, sinister looking, not handsome at all, but not a mutant either. He oozes evil. \r\n\r\nJurgan the Butcher (Nord): A true Nord warrior. Play him as good or Evil, whatever you choose this is a viking inspired character. He\\'s a brute and he\\'s a warrior. You don\\'t get called the Butcher for being warm and fuzzy. \r\n\r\nKar\\'elle: Wood Elf . Always wanted to play as a wood elf, so I made her. I figure if Elves were attractive in LOTR, why not here. I did however make her look like she gets down in the action and not like a super elf model.  She seems realistic enough. Play her anyway you see fit! \r\n\r\nRequired Mods (what I used)\r\nApachiiSkyHair http://skyrim.nexusmods.com/mods/10168\r\nCBBE http://skyrim.nexusmods.com/mods/2666\r\nCBBE skin texture V2 V3 plus Thepal and UNP compatible http://skyrim.nexusmods.com/mods/6554\r\nAll in One Face for Dawnguard Vampire and Vanilla Races - UNP - CBBEv3 - Vanilla (highly recommend) http://skyrim.nexusmods.com/mods/17704\r\nHigh Resolution Scars by Xenius http://skyrim.nexusmods.com/mods/4784\r\nI Wash - New Skin for Skyrim by Blocky http://skyrim.nexusmods.com/mods/23\r\n\r\nThe ENB i use is Seasons of Skyrim http://skyrim.nexusmods.com/mods/23812\r\n---\r\n From the Original Mods description: http://skyrim.nexusmods.com/mods/5597\r\nMain quest finished without the use of console commands skipping ahead (which means that Paarthurnax and Esbern will be around.)\r\n has all the unique weapons/shouts rewarded from the main quest\r\n[Characters Inventory]\r\nNahkriin - The Dragon Priest\\'s Mask before entering Sovngard\r\nAxe of Whiterun - For slaying the dragon at the Western Watchtower\r\nGloves of the Pugilist - +10% unarmed damage gloves when entering the Ratway\r\nParty Clothes/Shoes - Infiltration of the Thalmor Embassy\r\nGolden Claw\r\nBlackthorne has 1kgold and a Daedric dagger\r\n\r\n[Shouts] - 2 Dragon Souls for use\r\nBecome Ethereal 0/3\r\nCall Dragon 3/3\r\nCal of Valor 3/3\r\nClear Skies 3/3\r\nDragonrend 3/3\r\nFire Breath 1/3\r\nStorm Call 0/3\r\nUnrelenting Force 3/3\r\nWhirlwind Sprint 1/3\r\n[Choices Made]\r\nEtienne Rarnis released from Thalmor Embassy\r\nMalborn kept alive from Thalmor\r\nMarkarth for Riften\r\nMarkarth Jarl Switch: Jarl Igmund -> Thogvor Silver-Blood\r\nRiften Jarl Switch: Jarl Laila Law-Giver -> Maven Black-Briar\r\nStormcloaks pay for the massacre of Imperial troops at Karthwastend\r\n\r\n[RP] For those who want it :P or why are you done with the MQ & LVL 1?\r\nEverybody: \\\"All hail the Dragonborn! Alduin is defeated!\r\nTsun: \\\"When you are ready speak to me to return to Skyrim\\\"\r\n*Take the portal to Skyrim*\r\n- 1 Month Later -\r\nYou awaken near the guardian stones, you have forgotten much about what has happened. Your skills and power have greatly weakened as you cannot remember even how to fight. You search through your items and wonder whose Golden Claw this is or this mysterious cube (Runed Lexicon).\r\n*Dragon flies overhead*\r\nYou remember destroying Alduin and setting Skyrim free, although you also know that your job as Dragonborn has not finished... there is still so much more work to do. So you set off, trying to find out more about yourself and to finish your duty.\r\n[Places Discovered]\r\nRiften\r\nMarkarth\r\nWhiterun\r\nBleak falls Barrow\r\nHelgen\r\nThe Guardian Stones\r\nRiverwood\r\nHonningbrew Meadery\r\nHigh Hrothgar\r\nPeak of the World\r\nUstengrav\r\nSolitude\r\nWinterhold\r\nAlftand\r\nWindhelm\r\nIvarstead\r\nSeptimus Signus\\'s Outpost\r\nWestern Watchtower\r\nSky Haven Temple\r\nKarthspire\r\nMarkarth \r\n\r\nJust drop the save game of choice into the Skyrim save folder and load up and start fresh!\r\n\r\nBig huge thanks to steptaker for making the original Abiola save game. Countless hours of new character adventures have been created from that, saving me the time of not having the MQ to bother with. Srsly, go endorse his mod if you like this one, he made it possible!\r\n\r\nThanks to:\r\nsteptaker for his Abiola save game\r\nBethesda for a great game\r\nEvery mod maker ever, All of them! Seriously,  without you guys, these games would not be as cool. \r\n",
  "categoryId": "43",
  "version": "1.0",
  "author": "Jase180",
  "createdUnix": "1349030407",
  "updatedUnix": "1349030739",
  "containsAdultContent": false,
  "uploadedBy": "jase180",
  "primaryFile": null,
  "files": [
    {
      "fileId": "91307",
      "name": "MQ Done Legit Save Games",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11484",
      "fileName": "MQ Done Legit Save Games-24831-1-0.rar",
      "uploadedUnix": "1349030739",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a9fa7b413dbde772b53f61fe7d57b7bd68bbda4980bc913334306a57bf9aecb2/analysis/1407196448/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MQ%20Done%20Legit%20Save%20Games-24831-1-0.rar?fid=91307&ttl=1535796036&ri=8192&rs=8192&setec=f73793c6c3ca700ec86f5032d6cacb92"
    }
  ]
}