{
  "modId": 24850.0,
  "modName": "Phillys Home",
  "summary": "An Inn Converted to a home, for immersion players",
  "descriptionHtml": "I released a mod a while back called Philly\\'s bar but I was never quite happy with it.\r\n\r\nLocated between the North watch tower and Fort Greymor, you can\\'t miss it.\r\nThe key is in a lock box under the steps on the right hand side.\r\n\r\n\r\nThis is a redone version that feels a lot more comfortable.  I was able to redo the lights so it has shadow casters on all but 2 lights without it glitching out, yay!, I\\'d avoid torches and such though.\r\n\r\nI use Frostfall, Skyrealism - Feast and Famine, and Crafting 300 - Armory of Tamriel  so the home is designed with those mods in mind.  Particularly the kitchen...Lots of storage.  Also the home has a fully equipped smithy including a custom smelter that will not take up the entire room plus it looks good and seems to make sense from a believability standpoint and a 3X16 bookshelf for those of us that collect those smithing design books.\r\n\r\nThere is room for loads of books,  once I realized that I could duplicate a bookshelf setup and it would still work,  I kind of went a little nuts with the book shelves.\r\n\r\nBe warned,  The house will be infested with bandits when you get there.  not too bad, but a challenge if you\\'re using a brand new char.\r\n\r\nAlso,  the previous owner had his fingers in a lot of pockets so you will find some decent loot.  but not too nice.\r\n\r\nMostly, this is just a more rational version of the old Philly\\'s bar.\r\n\r\nif you are one the literally ten\\'s of people who downloaded the first one,  thank you :)\r\nif you are one the literally ten\\'s of people who downloaded and use the first one,  thank you as well,  also you will need to move you stuff out to update :) sorry.   \r\n\r\n\r\n\r\n\r\nRecommended  - NOT required\r\nFrostfall\r\nhttp://skyrim.nexusmods.com/mods/11163\r\n\r\nSkyrealism - Feast and Famine\r\nhttp://skyrim.nexusmods.com/mods/22327/\r\n\r\nCrafting 300 - Armoury of Tamriel \r\nhttp://skyrim.nexusmods.com/mods/2933\r\n\r\n",
  "categoryId": "67",
  "version": "1",
  "author": "armspree",
  "createdUnix": "1349054300",
  "updatedUnix": "1349054431",
  "containsAdultContent": false,
  "uploadedBy": "armspree",
  "primaryFile": null,
  "files": [
    {
      "fileId": "91396",
      "name": "Phillys Home",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "62",
      "fileName": "Phillys Home-24850-2.7z",
      "uploadedUnix": "1349054431",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/57d350f510d844f6bd35365a5e050821d46aac8363d2cd9606c7a219d8c98767/analysis/1407197103/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Phillys%20Home-24850-2.7z?fid=91396&ttl=1535796059&ri=8192&rs=8192&setec=f7a41c5de11ceaba4d2242cec3e761fb"
    }
  ]
}