{
  "modId": 24856.0,
  "modName": "Matterhorn Lodge",
  "summary": "Home near Riften",
  "descriptionHtml": "This mod puts a large house outside of Riften, near the Merryfair farm.  It is navmeshed inside and out, containers are all safe except the barrel and bags in stable.  This was done intentionally.  No quest or key as of yet.\r\n\r\nI\\'ve gone as far as I can on my own, for now.  Might add more in the future.  I\\'m not a very experienced modder so there will be some bugs to squash I\\'m sure.  If anyone is interested in teaming up to do a quest or add characters to this please pm.\r\n\r\nTo install this mod first you will need to get General Stores, http://skyrim.nexusmods.com/mods/18340.  Follow the instructions on Harvey2112\\'s page and don\\'t forget to endorse his brilliant mod.  Then after you have that simple drop my esp mesh and texture folder in your steamaps/common/skyrim/data folder.  Click yes to all replacements.\r\n\r\nBefore you head off one last bit.  I\\'d recommend taking it slow, lots of the containers aren\\'t readily apparent at first glance.  You\\'ll want to scan the shelves slowly and look at each room, to familiarize yourself with the layout.  If you like everything in one spot and rooms full of hundreds of mannequins, a separate barrel for every food, then this house might not be for you.\r\n\r\nThanks to Oaristys for his resources, really helped to create a unique look\r\nHarvey2112 for his Activators, bringing order to my chaos\r\nBlary for his open books, advice, and inspiration.\r\nAnd of course The Nexus",
  "categoryId": "67",
  "version": "1.0",
  "author": "milogrim",
  "createdUnix": "1349058658",
  "updatedUnix": "1349058947",
  "containsAdultContent": false,
  "uploadedBy": "milogrim",
  "primaryFile": null,
  "files": [
    {
      "fileId": "91408",
      "name": "Matterhorn Lodge 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18352",
      "fileName": "Matterhorn Lodge 1_0-24856-1-0.zip",
      "uploadedUnix": "1349058947",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c3521ba4c4558d5a2b4f89f9b12f288882dec9709f875d140ef6f931cc0bd788/analysis/1407197174/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Matterhorn%20Lodge%201_0-24856-1-0.zip?fid=91408&ttl=1535796065&ri=8192&rs=8192&setec=52ee81f8e34940905d0b5587dea409ed"
    }
  ]
}