{
  "modId": 24878.0,
  "modName": "The Mace of DOOM",
  "summary": "To those who remember the Mace of DOOM from Oblivion... I have replicated it for those who just wish to have a little peice of Oblivion with them! ",
  "descriptionHtml": "The Mace of DOOM returns to the world of Tamriel! It didn\\'t lost any power over the ages (so you may find it underpowered in Skyrim due to new damage system) And keeping to the old tradition the Mace of DOOM also never runs out of charge... or just just has so many charges that it feels infinite. Its still an Ebony Mace and has transformed to keep its look with its modern counterparts!\r\n\r\nThe Mace of DOOM is a reward for killing Silus at the end of Pieces of the Past which is the level 20 quest to gain Mehrunes Razor, so tough luck if you already killed him or didn\\'t kill him. Of course if you dont mind cheating however you can cheat it in with help doom.\r\n\r\nThe video link just incase it doesnt load in the video tab:\r\nhttp://www.youtube.com/watch?v=TzbTtveQZPQ&feature=youtu.be\r\n\r\nP.s The mod does NOT come with the Mortar spell, I just used that because I find it fun :)\r\n\r\n",
  "categoryId": "55",
  "version": "1.1",
  "author": "Hannah92",
  "createdUnix": "1349125896",
  "updatedUnix": "1350601399",
  "containsAdultContent": false,
  "uploadedBy": "hannah92",
  "primaryFile": null,
  "files": [
    {
      "fileId": "94533",
      "name": "The Mace of DOOM",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "The Mace of DOOM-24878-1-1.zip",
      "uploadedUnix": "1350601399",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f0bf38e172992be5862b357d0da8b7af38a862ad58dc0f90e0d9d56f2d1a65fd/analysis/1407228137/",
      "changelogHtml": " Added a description to the weapon instead of it being the boring enchantment text which wasnt even displaying correctly. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Mace%20of%20DOOM-24878-1-1.zip?fid=94533&ttl=1535796102&ri=8192&rs=8192&setec=60533b7f6ccaccf89b2e053d6117b301"
    }
  ]
}