{
  "modId": 24919.0,
  "modName": "Sidthra",
  "summary": "My player character, Sidth&#39;ra is made into a custom follower who has a custom made CombatStyle so he fights like I would. He uses archery and summons a familiar to assist you in combat.",
  "descriptionHtml": "My player character, Sidth&#39;ra, who is a Nightingale, Harbinger and minor conjuration mage in my game is made into a follower.\r<br />\r<br />Highly recommend CoverKhajits textures&#33;&#33;\r<br />\r<br />Using my characters own facegen from the game, he looks exactly like my character.\r<br />(you can also view images of him in my older mods such as, Nikandros the Fallen and Dragkol DragonPriest Follower)\r<br />\r<br />He has maxed out archery perks and stealth perks (as I do in the game) and levels with you.\r<br />He can be found right outside Breezehome in Whiterun, wearing his default clothes of master robes of conjuration. \r<br />If you give him an item he should equip his fighting gear, Wolf armor and gauntlets and steel cuffed boots of muffle. Or if you have UFO you can simply tell him &#39;you could dress better&#39; and he will switch gear. He carries elven arrows and a ebony bow, (despite having Auriels bow in game I gave him this so Dawnguard isn&#39;t required and is more lore friendly/overpowered)\r<br />He is essential and has a custom CombatStyle; focusing on only archery and summoning a familiar in the beginning of battle. (unfortunately in order for good compatibility I can&#39;t give him his midas magic spells, I could release another with his but I don&#39;t know if he will actually use them, haven&#39;t tested and need permission to use)\r<br />\r<br />The mod in the photos is a beast weight mod that increases the beast weight skeletons. (not included)\r<br />http://skyrim.nexusmods.com/mods/6239\r<br />\r<br />Its been a while since I&#39;ve been on the nexus and I&#39;ve been working on my followers and making them better. Also as soon as a nif plug-in is made for 3ds max 2013 I&#39;ll start on armor mods. (or at least try)\r<br />I&#39;ve also been attempting to make my girlfriends vampire lord wood elf character into a follower.  The face shows up correctly in CK but the exported face data is her vanilla face texture and mesh not her vampire face, despite the eyes showing up in game and the race set correctly. She also has a burned face and the face skintint doesnt match the body. I check the woodelfvampire race and even there the face doesnt match with the body. I&#39;m unsure if this is a CK issue or Dawnguard plug-in issue. I&#39;ve tried everything even rebuilding her face mesh in 3ds max 2013 and re-texturing the dds file in PS CS6 to no avail. Please PM me if you have any advice or suggestions.",
  "categoryId": "66",
  "version": "1",
  "author": "pokemoneg",
  "createdUnix": "1349202772",
  "updatedUnix": "1424298509",
  "containsAdultContent": false,
  "uploadedBy": "pokemoneg",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000148000",
      "name": "Sidthra",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Sidthra-24919-1.7z",
      "uploadedUnix": "1424298509",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/2563f9fe057c89236336ea75dd50cca40f606296e1215d29e20e186c1a64a1d3/analysis/1424298542/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sidthra-24919-1.7z?fid=1000148000&ttl=1535796168&ri=8192&rs=8192&setec=150d812561d3b132c9a759721f5e5a69"
    }
  ]
}