{
  "modId": 24921.0,
  "modName": "Hamper ENB - performance-friendly visual extravaganza",
  "summary": "Requires ENB 0.113. This is a combination of several different ENB\\'s I have tweaked and combined to give the, imo, perfect ENB setting. Many pretty FX effects, very low FPS hit. Also included is my tweaked ini files for better-than-Ultra quality with even more fps and less CTD\\'s from scripting-heavy mods.",
  "descriptionHtml": "Requires ENB 0.113. \r\nhttp://enbdev.com/mod_tesskyrim_v0113.htm\r\nThis is a combination of several different ENB\\'s I have tweaked and combined to give the, imo, perfect ENB setting. FPS-hit is VERY important to me. I feel many other ENB-series sacrifice FPS for seemingly irrelevent things, or doesn\\'t optimize their files well.\r\n\r\nMy ENB gives around 10 fps hit.\r\n\r\nIt includes:\r\nSmoothed shadows (without fps hit)\r\nGodrays\r\nTrue sun\r\nParallax textures*\r\nLorefriendly palette\r\nVery subtle FX lens-effect on fire etc\r\n\r\n*Requires downloading of some texture packs, like the Project Parallax series and Parallax Rocks and Mountains \r\n\r\nAlso includes my heavily tweaked ini files for better-than-Ultra quality but with even more fps. I use an 3-core AMD and a GTX460 card, and I get between 35-50 with my ENB activated, very rarely dropping to 30 fps. \r\nThose are based on another user, whose mod or name I can\\'t find right now. I have then further tweaked them for even better quality and more fps. I have also included another tweak under the [Papyrus] setting, that severely reduce the amount of CTD from scripting intensive mods. With 120 esp files, I pretty much never get CTD anymore. Have ran the game for 6 hours without one. Remember to change the resolution in Skyrimprefs.ini to your own. I use 1920x1080\r\nRemember to back up your own ini files first, if you feel the need to revert back.\r\n\r\nI can also recommend Texture Optimizer for even less CTD\\'s, if using many retextures etc\r\nhttp://skyrim.nexusmods.com/mods/12801/\r\n\r\n[img]http://i.imgur.com/Zgdmf.jpg[/img]\r\n\r\n[img]http://i.imgur.com/a8A4r.jpg[/img]\r\n\r\nPlease leave comment for improvements etc. Thank you.",
  "categoryId": "62",
  "version": "1.0",
  "author": "MisterHamper",
  "createdUnix": "1349203351",
  "updatedUnix": "1349203351",
  "containsAdultContent": false,
  "uploadedBy": "Misterhamper",
  "primaryFile": null,
  "files": []
}