{
  "modId": 24939.0,
  "modName": "DEE Dawnguard Enhanced Enemies",
  "summary": "Adds High level Enemies thoe the Falmer, Forsworn, Vampire, Dawnguard, Draugr, Bandit and Afflicted Armies.  It now also adds Werewolves, Wolves, Bears, Vale Cats and Giants that will spawn in random location throughout skyrim.\r\n\r\nRevised Equipsets, perks, Loot, armor, stats and combat styles.",
  "descriptionHtml": "DEE Dawnguard Enhanced Enemies\r\nGood luck and, try not to get yourself killed. -Nazir\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \r\nIf you like D.E.E. Endorse it and tell my why. If not then tell me how to improve it.\r\n\r\nInstall; Use NMM or unzip the data folder to your skyrim root directory and press yes to merge\r\ncheck esp. in Launcher or NMM.\r\n\r\nUpdate Manual:  Follow the paths from you skyrim root directory Meshes/actors/character/facegendata/facegeom now delete the folder titled \\\"Dawnguard Enhanced Enemies.esp\\\"\r\n\r\nThe the same for Textures/actors/character/facegendata/facetint and delete  \\\"Dawnguard Enhanced Enemies.esp\\\" folder.  \r\n\r\nNow unzip data folder to the root directory and allow it to merge and overwrite the original .esp.\r\n\r\nFor the record: Use NMM it\\'s faster and easier.  If you use NMM Completely remove all aspects and re-install any update clean.  That will ensure you get all updated face data and avoid grey faces.  Make sure you replace the esp in it\\'s previous location in your load order.\r\n\r\nVERY, VERY IMPORTANT:\r\nNot compatible with The Monster Mod or any other mod that alters vanilla Leveled Lists.  Ignore this warning at your own peril; saving with two such mods active will PERMANENTLY bug you save with broken creature animations.\r\n\r\nList of Known Incompatibilities:\r\nMonster Mod, Enhanced High Level Gameplay...\r\n(If you find one, Tell me and I\\'ll add it.  BACKUP YOUR SAVES!!!)\r\n\r\nThis mod is fully compatible with:\r\nWarzones: Civil Unrest, Deadly Dragons and anything that alters monsters in their vanilla form and DOES not alter their spawns.  This includes; retextures, new meshes and level changes to the monsters themselves; NOT their leveled lists or spawn points.\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\nWell, the name is fairly self explainatory. This mod add several high powered enemies to the vampire, bandit, Afflicted, Falmer, Draugr, Dawnguard and forsworn armies. It now also adds Werewolves, Wolves, Bears, Giants and Vale cats These NPCs are ALL quite powerful. You will not see any of them prior to level 50. Aside from the new creatures some of which spawn at level 30. The Creatures are capped at 90 apart from the Werewolves that are capped at 100. ALL the NPCs are capped at 100.\r\n\r\n3.0 Update: This update adds two new lower level creatures just because it can!  Gremlins(little tiny giants) and Vampire Children like Babette!  They are place in locations that make sense.  Gremlins are eveywhere and the vampire children are place with, big shock, vampires! \r\n\r\nI designed This mod for High powered characters and those who want a real challenge. Though based on \\\"Enhanced High Level Gameplay\\\" by EricWO. I did not use any of his assets. I loved his mod BUT the enemies were STILL pushovers. Not only that is threw error in the papyrus log with dawnguard. Not only that, I like Falmer Warmongers and there were none with his mod active. This mod adds a total of 12 Lore friendly NPCs to the game.\r\n\r\nNo vanilla NPCs were altered during this mods creation; however the vanilla npc leveled lists HAVE been extensively modified. I would place this mod at the very top of you loading list so anything else that changes the leveled lists can overwrite it, or download EricWO\\'s mod and use boss. Place mine where you would\\'ve put his.\r\n\r\nI will be adding more creatures over time and I will consider any feedback so long as it is presented in a respectful manner.\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\nNew NPC Lore:\r\n\r\n1. Falmer Kingslayer (Unique Sword)\r\nThese Beastial falmer are the oldest living Snow Elves. Their torture has lasted centuries, dating back to the Dwarves. They can still remember what it was like to see!\r\nThey are responsible for the deaths of many foolhardy adventurers.\r\nSPAWNS WITH FALMER\r\n\r\n2. Nordic Raider (Unique Sword)\r\nPowerfully built nords that love to raid, rob and pillage. These cut throats have been around in Skyrim for years. They are much stonger than their traditional bandit counterparts. They would rather kill you than just rob you. They know their craft quite well.\r\n\r\n3. Volkihar Exile (Unique Armored Crown)\r\nThese were Harkon\\'s most trusted advisors. Their ambition was limitless and their loyalty wore thin. They weren\\'t interested in the sun or the troubles of other vampires. They simply want to drink the blood of the world. They are tremendous spellcasters and powerful swordsmen.\r\nSPAWN WITH VAMPIRES\r\n\r\n4. Draugr Dragon Lord WARNING!!! MUCH STRONGER WITH 2.5 UPDATE (Unique Amulets)\r\nIn life these draugr were the greatest knights of the Dragon Cult. In death these ancient corpses are the most powerful abominations you will ever face in nordic ruins.\r\nSPAWNS IN NORDIC RUINS\r\n\r\n5. Dawnguard Sunbringer (Unique Axe)\r\nElite Vampire hunters, nuff said.\r\nSPAWNS WITH DAWNGUARD WAR PARTIES\r\n\r\n6. Red Eagle\\'s Heir (Unique Axe)\r\nThe most hated of the hill people. The Heirs are defiant, malicious and hate every single nord. They are the most powerful warriors in the reach and the will not hesitate to kill anything, especially nords.\r\nSPAWNS WITH FORSWORN\r\n\r\n7.Afflicted Plaguemaster (Unique Amulet)\r\nPowerful sick people who will vomit on you and probably kill you, run far away.\r\nSPAWNS WITH AFFLICTED\r\n\r\n2.0\r\n\r\n8. Massive Feral Grizzly\r\nA hulking Grizzly that is completely crazy. They will kill and eat anything. They will spawn throughout skyrim. Run, just run...\r\nSPAWNS IN THE WILD AND EVERYWHERE BEARS DO\r\n\r\n9. Giant Behemoth\r\nEver think Giants were too small? You won\\'t anymore. These massive creatures will make you bones their dinner. Fe-Fi-Fo-Fum The dragonborn had better run. These creatures are reserved for very high level heros and should be approach with EXTREME caution.\r\nPRIMARILY SPAWNS WITH GIANTS BUT ALSO IN THE WILD\r\n\r\n10.Crazed Skinhound (Unique Pelt)\r\nEver thought, there sure aren\\'t many werewolves? Now there are. The wilds will be exceedingly dangerous once you are lvl 70. They spawn in quite a few locations and they are quite hungry, and quite crazy. Don\\'t bother running, praying would be a better Idea.\r\nSPAWNS IN THE WILDS AND WITH SOME WOLVES\r\n\r\n11.Wild-Hunt Wolf\r\nWell at least you wont have to run from this one. Far more dangerous than any wolf you\\'ve ever seen, which is to say they will hurt you and they are fast. Nothing to worry about really. Unless you are afraid of bleeding a bit.\r\nSPAWNS IN THE WILD\r\n\r\n12.Enraged Vale Cat\r\nEver thought, Man those Vale sabre cats look nice? Well you\\'ll be seeing a lot more of them in the near future. Like everywhere after level 35. They\\'re hungry and huge. They are not horribly powerful though. But they will still kill you.\r\nSPAWNS IN THE WILD\r\n\r\n3.0\r\n\r\n13. Frozen Chaurus Reaper (Requested)\r\nChaurus weren\\'t always so scarce.  In the north these subbterannean monstrosities used to hunt in packs.  Due to a flash of warm weather in the north(Warm for Skyrim anyway) a large chunk of ice melted and released a great deal of these ancient Chaurus in to Skyrim.\r\nSPAWNS IN THE WILD\r\n\r\n14.Gremlin (Beta for size check)\r\nSheogorath Strikes again.  He has turn traditional giants into little tiny baby giants.  They are MUCH weaker than the larger counterparts in this mod but they still behave as if they were hulking monsters.\r\nSPAWNS ABSOLUTELY EVERYWHERE IN THE WILD AT LV. 1\r\n\r\n15. Ice Giant Behemoth \r\nEver though that the new dlc giants were cooler?  Me too!  You might not now though.  These Monsters have migrated further south in search of new hunting grounds and mates.  They have assimilated into the southern giants culture and are to be approached with extreme caution.\r\nSPAWNS WITH GIANTS AND A LITTLE BIT OF EVERYWHERE\r\n\r\n16.Volkihar Youth\r\nEver wonder where are the nordic children?  They were abducted by vampires years ago, thus discouraging reproduction in Skyrim, LOL.  Seriously though these are children who were unfortunate enough to fall into the hand of vampires.  They aren\\'t terribly powerful, but they are a nice change of speed from the traditional vampires!\r\nSPAWNS WITH VAMPIRES AT LV.1\r\n\r\n17,18,19.  Vvardenfell Vampires (unique Jewelery):\r\nWhoa, blast from the past!  I just got goosebumps!  Anyway, did you really think only the living survived the Red Mountain crisis in Morrowind?  Okay survived isn\\'t the right word.  Continued to exist then.  The Quarra, Berne and Aundae clan survivors also migrated to Skyrim in search of new hunting grounds.  The have set aside their differences and assimilated in to Skyrim\\'s Booming vampire culture!  Take THAT Isran!  \r\n\r\n  Seriously though, these are my masterpieces.  They are fully lore friendly based on their previous classes.  The Aundae have their own unique class because the vanilla classes wouldn\\'t cater to them.  They wear heavy armor and wield the powers of destruction and conjuration.  The Berne wear light armor and fight in the shadows with daggers and bows.  The Quarra are tanks, they wear heavy armor and fight with melee weapons. There is a 1/4 chance to see these vampires anywhere you would normally see my Volkihar exiles.\r\nSPAWNS WITH VAMPIRES  \r\n\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\nThis mod is not for the weak, you have been warned. These NPCs will spawn almost everywhere their counterparts are found considering you are the proper level.\r\n\r\nMy new creatures will spawn everywhere. They should be aggressive to anything. That may save you from the werewolves. Unless they\\'re really hungry... You won\\'t have to worry overly much until level 70.\r\n\r\nI will not make an easy edition so don\\'t ask. Now go read that book \\\"Killing, before you\\'re killed\\\" and learn it\\'s lessons well. If that doesn\\'t work run far, far away. Go to Morrowind and fight some cliff racers or something. At least that way you won\\'t hear the stories of the cowardly Dragonborn who doomed mankind.\r\n\r\n-ecremer ",
  "categoryId": "33",
  "version": "3.2",
  "author": "Ecremer",
  "createdUnix": "1349232775",
  "updatedUnix": "1349414992",
  "containsAdultContent": false,
  "uploadedBy": "ecremer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92107",
      "name": "Dawnguard Enhanced Enemies 3_2",
      "version": "3.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1442",
      "fileName": "Dawnguard Enhanced Enemies 3_2-24939-3-2.zip",
      "uploadedUnix": "1349414992",
      "modVersion": "3.2",
      "virusScanUrl": "https://www.virustotal.com/file/4451f6111e66d8601678379274efc57972f30bb0c1a59c8beb13775678c1c699/analysis/1407204544/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnguard%20Enhanced%20Enemies%203_2-24939-3-2.zip?fid=92107&ttl=1535796206&ri=8192&rs=8192&setec=55d41a347df0b399c62946e7a2bcb20c"
    }
  ]
}