{
  "modId": 24955.0,
  "modName": "Complete Imperial Armor Kit",
  "summary": "Ever wanted to craft the rest of the Imperial gear without murder? Did you choose the Imperial side at Helgen and couldn\\'t get a simple Imperial Sword without killing a soldier or guard later? Wanna find a Imperial Helmet Full ? Wish Imperial Heavy Armor had better stats than Iron? Want the classy Penitus Oculatus uniform?\r\n\r\nJust a simple ESP to ",
  "descriptionHtml": "The main purpose of this ESP is to enable the rest of the imperial equipment for crafting. Strangely, only the standard heavy set is available by default, but with this mod, all Imperial armor is now available, INCLUDING the Penitus Oculatus gear, which is rather cool!\r\n\r\nAdditionally, I have made steel-grade variants of the heavy armor, mainly because the standard imperial heavy armor has the stats of Iron grade armor, the weakest heavy armor in the game. It\\'s kind of an insult, and makes it much less desirable.\r\n\r\nIncluded changes over the vanilla Imperail gear:\r\n\r\nSteel variants for all Imperial heavy armor, body, helmet, gauntlets, boots, shield\r\nImperial bow and sword now craftable. The sword was slightly changed to show up under imperial section instead of steel.\r\nImperial Officer\\'s helmet craftable\r\nImperial FULL helmet now craftable (The one that can only be found in a cave somewhere by default and actually looks cool!)\r\nConsidering the officer and full helmets have better stats, I didn\\'t make recipies for steel varsions of them, BUT, I did make steel versions, so you can find \r\nthem in the console and cheat them in, if you like.\r\nAll standard light armor pieces now craftable, including Studded. Interestingly, I found it gives no more protection than normal light armor\r\nImperial light shield craftable\r\nAll parts of the Penitus Oculatus uniform craftable! Also has identical stats to normal Imperial light and studded armor.\r\n\r\nIncompatabilities:\r\nOnly anything that modifies the vanilla Imperial Sword.\r\nIf you happen to have another \\'make imperial gear craftable\\' mod, this will work along with it, but you probably don\\'t need that other mod anyway -_^\r\n\r\nCheck out my other mods:\r\n\r\n[url=http://skyrim.nexusmods.com/mods/20436]Really Radiant Raiment[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/20434]Farquar\\'s Girl, Gwendolyn Tweak[/url]",
  "categoryId": "54",
  "version": "1.0",
  "author": "PlasmaJedi",
  "createdUnix": "1349285319",
  "updatedUnix": "1349285429",
  "containsAdultContent": false,
  "uploadedBy": "PlasmaJedi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "91831",
      "name": "Complete Imperial Kit",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Complete Imperial Kit-24955-1-0.7z",
      "uploadedUnix": "1349285429",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/804dab13a7a328a87062102713ca4656b045e8108661714c139ea240f88726fd/analysis/1407201723/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Complete%20Imperial%20Kit-24955-1-0.7z?fid=91831&ttl=1535796228&ri=8192&rs=8192&setec=53e5a080e130463911ec2d6974e4b060"
    }
  ]
}