{
  "modId": 24960.0,
  "modName": "Ebony and Plate Ebony Armor Mail",
  "summary": "Ebony armor retex 4k resolution for all cuirass and new plated ebony armor too. Normal Ebony mail armor and plated mail armor. Retex for ebony mail artifact Uses ebony armor rig fixes meshes from madcat221&#39;s rigfix mod. MODE UPDATED to VERSION 2.0 NEW TEXTURES&#33;",
  "descriptionHtml": "Updated AGAIN&#33; 7/4/2014 \r<br />\r<br />Totally remade the esp file from scratch so no more dirt edit warnings from boss and also did NOT put items in the qasmoke containers this time&#33; Just by placing things in those containers a mod can conflict with another mod in bad ways:-( \r<br />\r<br />I tried boss and wyrebash but eventually settled on tes5edit mod merge patch it works great it is the only thing I use now no more boss and no more wyrebash and so far, I say SO FAR lol everything works fine.\r<br />\r<br />Here is a great simple video from youtube about how to use mod merge patch with tes5edit\r<br />\r<br />http://www.youtube.com/watch?v=ue4N6JgZEOE\r<br />\r<br />So latest version is v2.1 the only file here now with new esp included.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />MOD UPDATED totally new stuff looks a lot better now and you can see it in the day time outside:-)\r<br />\r<br />Everyone makes an ebony mod so it was time for me to make one too:-)\r<br />\r<br />Got tired of the default ebony and it seemed strange that ebony mail without the skunk effects was not buyable and craftable so I came up with this mod. \r<br />\r<br />Ebony armor has been retextured, started with the official HD 2k textures for ebony armor and did something different with it. Ebony should look like some kind of ominous evil stuff, like that obelisk from space 2001 movie but unfortunately the game engine doesn&#39;t work like that. I made it as close to super black as I could but didn&#39;t like how it just could not be seen so I went with a slight blue because the ebony ingot is actually slightly blue. \r<br />\r<br />What you get in this mod:\r<br />\r<br />Ebony armor retextured\r<br />\r<br />Ebony mail but normal not enchanted it is a new item that can be crafted\r<br />\r<br />Plated ebony armor, steel plate over ebony\r<br />\r<br />Plated ebony mail too\r<br />\r<br />Plated ebony accessories too like boots, gloves helmet shield.\r<br />\r<br />The cube map had to be replaced to get the most out of this armor, took forever to get it just right. I still can&#39;t get ebony to look like I want it to in this game but this is close enough for now. It can be seen in the day and night time outside and inside it looks slightly blue but no matter where you are the shine doesn&#39;t fade away. I thought the ebony metal should look different from everything else so it should be slick and evil and it goes well with polished steel plate metal. Gold trim for plated ebony stuff and chain mail instead of crappy leather.\r<br />\r<br />Plate ebony armor is unlocked two levels higher from ebony and it is slightly stronger and heavier requires steel ingots in addition to the standard recipe for ebony armors.\r<br />\r<br />boethiah&#39;s champion armor has been retextured in the same way as the other ebony armors but her armor has that blue marking in it and a logo for boethiah on the rear skirts with daedric lettering.\r<br />\r<br />This is my third mod now, it should be compatible with nexus mod manager but I don&#39;t use that so I don&#39;t know for sure so you will just have to try it or install manually.\r<br />\r<br />Copy the textures folder from the data folder of this mod into your game data folder.\r<br />Copy the meshes folder from the data folder of this mod into your game data folder.\r<br />Copy the ebonymod.esp file into your game data folder.\r<br />\r<br />This mod uses the fixed meshes for ebony armor from this mod: http://skyrim.nexusmods.com/mods/2903 by madcat221 with permission. So no twisted armpits and messed up skirts on the armor mesh. Pauldrons on the female armor are smaller too.\r<br />",
  "categoryId": "54",
  "version": "v2.1",
  "author": "Dragonslayer2k12",
  "createdUnix": "1349290446",
  "updatedUnix": "1404502629",
  "containsAdultContent": false,
  "uploadedBy": "dragonslayer2k12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000115881",
      "name": "EbonyModv2.1",
      "version": "v2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "192775",
      "fileName": "EbonyModv2.1-24960-v2-1.rar",
      "uploadedUnix": "1404502629",
      "modVersion": "v2.1",
      "virusScanUrl": "https://www.virustotal.com/file/d64903dee6a947925af13a28eabfb4b7a42c6dfa3e816bcc005f1a4ec99220e0/analysis/1408160736/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EbonyModv2.1-24960-v2-1.rar?fid=1000115881&ttl=1535796233&ri=8192&rs=8192&setec=3d2ab3082fd55ac24a1049a4b0be2b14"
    }
  ]
}