{
  "modId": 24971.0,
  "modName": "SkyRe - Combat Tweak",
  "summary": "Simple tweak that allows your stamina to take 95% of all the damage when blocking, aka Dark souls style.",
  "descriptionHtml": "I hated that no matter how many perks I had in Block, if I was down to last bit of health in a fight, and managed to block an attack right at the last minute, I still died, no matter how perfectly timed or heroic my block was. Then SkyRe (best mod EVER!) was released and I got so excited by the \\'timed block\\' scripting that was added, only I still kept dying, sometimes even at half health due to the increased deadliness of combat, even though I timed my block perfectly.... I would watch my opponent stagger away, signifying that I had indeed blocked the attack, in my death cam. \r\n\r\nSo I made this small tweak. I also increased the amount of damage that weapons can block to 90%, so you will take more stamina damage and a little health dmg when blocking without a shield. Combined with T3nd0\\'s combat stamina scripting, it makes combat really fun, allowing you to survive on the very edge of death, if you are good enough.....\r\n\r\nPlease not that as of version 1.2 this mod can now be run interdependently of SkyRe, meaning you don\\'t need SkyRe to use this mod, but I highly recommend it.\r\n\r\nInstallation\r\n-Just download and install with NMM.",
  "categoryId": "77",
  "version": "1.0",
  "author": "RavensBl00d",
  "createdUnix": "1349304976",
  "updatedUnix": "1349492142",
  "containsAdultContent": false,
  "uploadedBy": "Wienecke01",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92268",
      "name": "SkyRe_Combat_Tweak_All_Versions",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "SkyRe_Combat_Tweak_All_Versions-24971-1-2.rar",
      "uploadedUnix": "1349492142",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/2f4be033ec2ec87b57c787f268794ce57625c63d1416fab56425bed3e9194994/analysis/1407205983/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRe_Combat_Tweak_All_Versions-24971-1-2.rar?fid=92268&ttl=1535796252&ri=8192&rs=8192&setec=93a245cd458614c2b670b3f911da4030"
    }
  ]
}