{
  "modId": 24979.0,
  "modName": "Kaasha - An Irresistable Dagi-raht Companion",
  "summary": "Kaasha is an adorable Dagi-raht follower with blonde hair and electric blue eyes. Kick that old Khajiit out the door give this little kitten that spot at the end of your bed. Don\\'t worry, she won\\'t bite... hard...",
  "descriptionHtml": "[b]Description[/b]\r\n\r\nKaasha is an adorable Dagi-raht follower with blonde hair and electric blue eyes. Kick that old Khajiit out the door give this little kitten that spot at the end of your bed. Don\\'t worry, she won\\'t bite... hard...\r\n\r\nKaasha is a Thief class and can be recruited from The Drunken Huntsman in Whiterun. Her default armor is currently Leather. Not the most flattering apparel, I know. I highly suggest using fLokii\\'s [url=http://skyrim.nexusmods.com/mods/14037]Ultimate Follower Overhaul[/url] in order to remove the default armor (Dialog: \\\"You Know... You could Dress Better\\\"). If you have any suggestions on a nicer default armor please leave a comment. I\\'m also open to suggestions regarding class, location, and the custom textures.\r\n\r\nTo my knowledge Kaasha is the first (and currently the only) Dagi-raht companion. Hopefully, she will inspire a few more.\r\n\r\nThis mod includes a custom texture set for the Dagi-raht body and face. These texures blend human skin with Dagi fur in strategic regions (See Pics). If you are somehow find this offensive fear not! Download the No Custom Textures version and your lady will woolly where it matters. SURGEON GENERAL\\'S WARNING: Engaging in intimacy with furry cat women is the leading cause of hairballs in men.\r\n\r\nCompatible with Vanilla, [url=http://skyrim.nexusmods.com/mods/2666]CBBE[/url] and [url=http://skyrim.nexusmods.com/mods/6709]UNP[/url]. Be sure to install the correct version!\r\n\r\n \r\n\r\n[b]Requirements[/b]\r\n\r\nThis mod requires Nuska\\'s [url=http://skyrim.nexusmods.com/mods/20627]Dagi-Raht Khajiit race[/url]. Which, by the way, is awesome. The Khajiit Replacer is not necessary. Be sure to install Nuska\\'s mod with the proper body textures.\r\n\r\n \r\n\r\n[b]Installation[/b]\r\n\r\nPick the appropriate version for your body type. Choose No Custom Textures version if you do not want the hybrid body seen in the pics.\r\n\r\nObviously, I recomend NMM, but if you must do it yourself simply extract and drop the esp and texture folder into your Skyrim Data folder. Overwrite where necessary.\r\n\r\n \r\n\r\n[b]Uninstallation[/b]\r\n\r\nIf you intend to continue using the Dagi-Raht race but just want to get rid of Kaasha and the custom textures:\r\n[list=1][*]\r\nDelete RMX Kaasha.esp\r\n[*]\r\n(Only if you\\'re really anal) Delete folder Data/textures/actors/character/FaceGenData/FaceTint/RMX Kaasha.esp \r\n[*]\r\nRinstall Dagi-Raht Khajiit race to overwrite my custom textures.\r\n[/list]\r\nIf you\\'re removing Dagi-raht Khajiit race as well as Kaasha do steps 1 and 2 and forget the rest.\r\n\r\n \r\n\r\n[b]Credits[/b]\r\n\r\nBethesda, first off, for all the swell stuff they do for us.\r\n\r\nBig thanks to Nuska, creator of [url=http://skyrim.nexusmods.com/mods/20627]Dagi-Raht Khajiit race[/url] without which this mod couldn\\'t have been possible. All custom textures in this mod are based on Nuska\\'s original textures.\r\n\r\ndimon99, for the [url=http://skyrim.nexusmods.com/mods/6709]DIMONIZED UNP female body[/url] textures which I butchered in order to create our lovely hybrid UNP body.\r\n\r\nCaliente, whose [url=http://skyrim.nexusmods.com/mods/2666]CBBE[/url] textures I also butchered for the hybrid CBBE body.\r\n\r\nAnd finally, major props to Eiries whose unreleased hybrid Khajiit textures are what inspired me to create Kaasha in the first place. I still like his textures better! Be sure to check out his gorgeous [url=http://skyrim.nexusmods.com/users/35431]pics[/url].\r\n\r\n_________________________\r\n[size=1]Composed/Posted with [url=http://www.shajul.net/]WYSIWYG BBCode Editor[/url][/size]",
  "categoryId": "66",
  "version": "v1",
  "author": "ResidentMockery",
  "createdUnix": "1349330000",
  "updatedUnix": "1349330000",
  "containsAdultContent": true,
  "uploadedBy": "residentmockery",
  "primaryFile": null,
  "files": []
}