{
  "modId": 24990.0,
  "modName": "Magic Duel Traduzione italiana",
  "summary": "Traduzione italiana della bellissima mod Magic Duel!",
  "descriptionHtml": "[center]\r\n[IMG]http://i285.photobucket.com/albums/ll62/Kalec84/Immagini%20per%20mod/md-ban10ITA.png[/IMG]\r\n[/center]\r\nTraduzione italiana della mod [url=http://skyrim.nexusmods.com/mods/18763]Magic Duel[/url]\r\nAutore  [url=http://skyrim.nexusmods.com/users/825950]Seb263[/url]\r\n[center]\r\n[IMG]http://i285.photobucket.com/albums/ll62/Kalec84/Immagini%20per%20mod/Intro.png[/IMG]\r\n\r\nQuesta mod mira a migliorare il gamplay di tutti quei giocatori che sanno apprezzare l\\'uso delle magie.\r\nAvrete sicuramente notato che in skyrim, i duelli magici, specialmente quelli fra maghi puri, spesso si riducono ad un lancio alternato di palle di fuoco, dove ogni avversario si limita a cercare di schivare più dell\\'altro.\r\nCome gia detto, questa mod si pone l\\'obiettivo di rendere questi duelli magici qualcosa di veramente coinvolgente...\r\nSe l\\'autore sia riuscito nel suo intento, spetta a voi dirlo, scaricate la mod originale, la traduzione e giudicate voi stessi :)\r\n\r\n[IMG]http://i285.photobucket.com/albums/ll62/Kalec84/Immagini%20per%20mod/Funzio.png[/IMG]\r\n\r\nIl giocatore e l\\'avversatio dovranno castare allo stesso tempo (è ammesso uno scarto di 3 decimi di secondo) un incantesimo di distruzione, sia esso di tipo ghiaccio fuoco o elettrico.\r\nIl tipo di attacco non influisce sul combattimento, il danno inflitto sarà sempre lo stesso.\r\nSarete informati dell\\'inizio del duello da un flash bianco sullo schermo, dopo il quale comincerà lo scontro.\r\nLe condizioni perchè il duello inizi sono le seguenti:\r\n\r\n- Il nemico deve essere nel vostro campo visivo.\r\n- Il nemico deve essere ostile al giocatore.\r\n- La distanza tra il giocatore e il nemico deve essere compresa tra 7.15m e 25m.\r\n\r\nIn aggiunta a queste condizioni, è possibile impostare la chance di inizio duello.\r\nSe ad esempio si imposta 10%, si avrà una possibilità su 10 di iniziare un duello.\r\n\r\nUna volta apparso il flash bianco sullo schermo, un\\'animazione in terza persona darà inizio al duello. La telecamera a questo punto ruoterà automaticamente attorno al punto di impatto dei 2 incantesimi.\r\nDurante il duello tutti gli NPC ignoreranno sia voi che il vostro avversario.\r\n\r\nUna volta iniziato il duello comincia anche il divertimento, riuscirete ad essere più abili del vostro nemico?\r\n\r\nPer vincere il duello occorre sincronizzazione, dovrete premere alternativamente i due tasti di attacco, ad esempio i tasti del mouse sinistro e destro (la mod è compatibile anche col pad), il più rapidamente possibile e senza premere due volte di seguito lo stesso tasto, otterrete così dei punti combo. Alla fine del duel chi ottiene piu punti combo avrà vinto.\r\nla diferenza di livello, sia generale che di distruzione, fra voi e il vostro avversario influenzerà, in modo impostabile nelle opzioni, il punteggio combo finale.\r\nPiù potente sarà il vostro nemico, più possibilità avrà di ribaltare la situazione a suo favore!\r\n\r\nAlla fine del combattimento, se vincerete, il vostro persnaggio potrà utilizzare i poteri del tuh\\'um per dare il colpo di grazia al nemico.\r\nPerchè questa opzione sia attiva il vostro personaggio dovrà conoscere i seguenti urli:\r\n\r\n- Duello con spell di fuoco : \\\"Yol Toor Shul\\\"\r\n- Duello con spell di ghiaccio : \\\"Iiz Slen Nus\\\"\r\n- Duello con spell elettrica : \\\"Fus Ro Dah\\\"\r\n\r\nIn questo caso, dopo avere usato l\\'urlo non avrete cooldown.\r\n\r\nA questo punto il duello sarà finito e riprenderete il controllo del vostro personaggio.\r\n\r\n- Il libro delle configurazioni:\r\n\r\nInstallata la mod e avviato il gioco, nel vostro inventario apparirà il libro delle impostazioni di Magic duel, nel quale troverete la guida completa e le impostazioni di configurazione.\r\n[/center]\r\nLe impostazioni modificabili sono le seguenti:\r\n\r\n??? Attiva/Disattiva la mod\r\n??? Personalizza le seguenti impostazioni:\r\n???? Difficoltà del duello\r\n???? Velocità del duello\r\n???? Chances di inizio duello\r\n???? Dani causati del duello (percentuali)\r\n???? Influenza sul duello della differenza di livello fra il tuo pg e l\\'avversario.\r\n???? Influenza sul duello della differenza di livello di distruzione fra il tuo pg e l\\'avversario\r\n???? Impatto che il bonus sincronizzazione ha sull\\'esito del duello.\r\n???? Rallenta il Tempo.\r\n???? Urli.\r\n??? Debugging della mod.\r\n[center]\r\n[IMG]http://i285.photobucket.com/albums/ll62/Kalec84/Immagini%20per%20mod/requis.png[/IMG]\r\n\r\nQuesta mod non ha requisiti di alcun genere per funzionare.\r\nTuttavia l\\'autore raccomanda di utilizzare sempre la versione più aggiornata del gioco, reperibile su Steam.\r\n\r\n[IMG]http://i285.photobucket.com/albums/ll62/Kalec84/Immagini%20per%20mod/install.png[/IMG]\r\nInstallazione via NNM.\r\nPotete tranquillamente installare la traduzione tramite NMM, non creerà alcun conflitto.\r\ninstallazione Manuale.\r\nEstraeta il contenuto dello zip nella cartella data e tramite il luncher attivate la mod MagicDuelITA\r\n\r\n[IMG]http://i285.photobucket.com/albums/ll62/Kalec84/Immagini%20per%20mod/archivi.png[/IMG]\r\n\r\nTroverete info sull\\'andamento della mod, bug e fix sulla pagina della [url=http://skyrim.nexusmods.com/mods/18763]\r\nMod Originale\r\n[/url]\r\n\r\n[IMG]http://i285.photobucket.com/albums/ll62/Kalec84/Immagini%20per%20mod/note.png[/IMG]\r\n\r\nQuesta mod non modifica in alcun modo le magie del gioco, gli npc, le quest o altro.\r\nIl gioco originale (vanilla) è totalmente preservato e non dovrebbero esserci conflitti di alcun tipo con qualsiasi altra mod.\r\nSe doveste riscontrare problemi con la sincronizzazione (rallentamenti, spell castate al momento sbagliato ecc...) dovrete cercare di aumentare la fluidità del gioco (FPS) ad esempio abbassando le impostazioni grafiche.\r\n\r\n[IMG]http://i285.photobucket.com/albums/ll62/Kalec84/Immagini%20per%20mod/credits.png[/IMG]\r\n\r\nL\\'autore ci tiene a ringraziare:\r\n[url=http://skyrim.nexusmods.com/users/4592219]ELAmericano[/url] per il tempo speso a cercare meticolosamente ogni bug di questa versione della mod, per aver condiviso le sue opinioni e idee, e per tutto il supporto offerto all\\'autore e al suo lavoro\r\n\r\n[url=http://skyrim.nexusmods.com/users/1709101]bbe[/url] per la sua traduzione della descrizione della mod e del libro di Magic Duel, cosi come per aver testato la versione Beta.\r\n\r\n[url=http://skyrim.nexusmods.com/users/4219095]Morg198[/url] per le ue correzioni e il suo supporto durante la creazione di tutta la prima versione di questa mod\r\n\r\nRingrazia inoltre tutti coloro che lo supportano e contribuiscono alla popolarità di questa mod votandolo e postando video di questa mod\r\n\r\nInfine, Io ringrazio [url=http://skyrim.nexusmods.com/users/825950]Seb263[/url] per avermi dato il permesso di tradurre questa mod, che personalmente considero un \\\"must have\\\" di skyrim.\r\n\r\n\r\n[IMG]http://i285.photobucket.com/albums/ll62/Kalec84/Immagini%20per%20mod/notelegali.png[/IMG]\r\n\r\nQuesta mod non può essere riutilizzata/pubblicata senza il permesso dell\\'autore.\r\n\r\nChiunque volesse creare un add-on in relazione, o che utilizzi questa mod, è pregato di chiedere prima il permesso all\\'autore.\r\nSe vi da il permesso per una traduzione in qualsiasi lingua, vi prega di creare un file ESP legato a MagicDuel.esm (in questo modo la mod potrà esere aggiornata senza dover ogni volta rimuovere la traduzione)\r\n[/center]\r\n\r\n",
  "categoryId": "93",
  "version": "1.1.4",
  "author": "Mod Seb263 - Traduzione Kalec84",
  "createdUnix": "1349364385",
  "updatedUnix": "1359551818",
  "containsAdultContent": false,
  "uploadedBy": "Kalec84",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92042",
      "name": "MagicDuelITA",
      "version": "1.1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "MagicDuelITA-24990-1-1-2.7z",
      "uploadedUnix": "1349384560",
      "modVersion": "1.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/16b095ae5af2caf191b67c3afc79e48f878b612ea0fb2e57acb1fe1367a8bf20/analysis/1407204004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MagicDuelITA-24990-1-1-2.7z?fid=92042&ttl=1535796274&ri=8192&rs=8192&setec=b484eefa4d5f0d2abeaa0719e93b4e7a"
    },
    {
      "fileId": "1000005895",
      "name": "MagicDuelITA-1-1-4",
      "version": "1.1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "MagicDuelITA-1-1-4-24990-1-1-4.7z",
      "uploadedUnix": "1359551818",
      "modVersion": "1.1.4",
      "virusScanUrl": "https://www.virustotal.com/file/451066bc1c759103ad3e4ab069dfc72e206b3202cd089c67b681acfe997fc68e/analysis/1407387244/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MagicDuelITA-1-1-4-24990-1-1-4.7z?fid=1000005895&ttl=1535796275&ri=8192&rs=8192&setec=b15a72a2169b993dee1d434df21a0b17"
    }
  ]
}