{
  "modId": 25024.0,
  "modName": "PsiKotics SkyMo Necromancy Mod",
  "summary": "Become the Ultimate Necromancer. Choose your own path to power with variations of over 3,360,000 different new summon-able minions via perks alone and Infinite variations if you include the innovative research system. Plus there are many other available paths to power as well.",
  "descriptionHtml": "[center][IMG]http://i1159.photobucket.com/albums/p626/PsiSoldier/MonsterMod.jpg[/IMG][/center]\r\n[center][img]http://i1159.photobucket.com/albums/p626/PsiSoldier/NecroFinalSinFondo.png[/img]Artwork by Jonas Springborg[/center]\r\n[center]Edited by:  PipoXXXmax and Xion209[/center]\r\n[center][color=Red]Current version 0.845[/color][/center]\r\n[img]http://i1159.photobucket.com/albums/p626/PsiSoldier/Introver1.png[/img]\r\n=================================\r\n[color=Orange]Requires most recent version of Skyrim[/color]\r\n=================================\r\n[color=Orange]Requires the Skyrim Monster Mod!!!![/color]\r\n=================================\r\nThis is the Skyrim Monster Mod version of my PsiKotic\\'s Necromancer Mod!\r\n\r\n==========================\r\nMany thanks to The Awesome Skyrim Monster Mod and the authors..\r\n===============\r\nDogtown1\r\nIronMan5000\r\nStarX\r\n==============\r\n\r\nThis is available with permission obtained from Dogtown1, IronMan5000 and StarX  who we are very thankful for their hard and great work with the Monster Mod and other related mods.\r\n\r\nThis Mod is a work in progress. Currently the mod adds a major expansion to the Conjuration Perk tree along with a series of new summon undead spells. This mod adds over 70 new perks, many of which allow you to customize your undead summon spells dynamically. But don\\'t let the 70 perks intimidate you, you can play a perfectly great necromancer and still focus on other trees as well. The great thing about the number of perks is the freedom they give you to play a necromancer your way with your own style.\r\n\r\nWith a diverse assortment of perk choices your experience as a necromancer could end up being vastly different from that of another player. For example Player A may choose to increase his Legion of the Dead perks and Ritual and Control Expertise Perks and summon a larger army of weak skeletal minions. While Player B Chooses to invest in Hasten the Dead, Harden the Dead and Imbue the Dead and lead a small group of highly skilled, powerful and fast moving undead death dealers. Another player may opt for a more balanced approach of those two while yet another player chooses to specialize in Blood, Death and perhaps Spirit Mastery and meet his enemies head on.  The choices is yours and so this mod is what you make of it\r\n\r\nThe Path of the Necromancer can lead to ultimate power over both the living and the dead. However, it will not always be an easy path. In the beginning you may find your life difficult as your undead minions are weak and die quickly and easily. But for those who persevere and continue down the path with resolve and discipline they will find themselves in command of forces other mortals can only dream of.\r\n\r\nWhat does all of this mean? It means that with a basic Summon Skeleton Minion spell your summon will take about 15 seconds to summon, start with 40 health, 30 skill points in most important skills be of average or slow speed, and cost 30 points of manna subtracted from the player\\'s total as Upkeep and it will be permanent until destroyed. However with appropriate perk investments that Same skeleton might have over 300 Health, close to 90 in all combat skills, take a half a second to summon, posses extreme speed and only cost a single point of manna to maintain. Now consider that if you have invested that amount of skill points to reach this level you also likely have the ability to summon an entire army of undead killing machines.\r\n\r\nIt is also highly recommended that you download and use the mod Nature of the Beast II as it will add the ability to control your minions with hotkey presses if you have Scriptdragon or via spells if you do not use scriptdragon.  The mod also adds a great number of other improvements and is highly customizable. http://skyrim.nexusmods.com/mods/20721\r\n[center][img]http://i1159.photobucket.com/albums/p626/PsiSoldier/Perks.png[/img][/center]\r\n\r\n[center][IMG]http://i1159.photobucket.com/albums/p626/PsiSoldier/PerkPicresize6.png[/IMG][/center]\r\n[center][color=Orange]Vampiric Regenration:[/color] Vampire characters will be granted permanent health regeneration to a small degree [/center]\r\n\r\n\r\n[center][img]http://i1159.photobucket.com/albums/p626/PsiSoldier/SpellList.png[/img][/center]\r\n\r\n[center][IMG]http://i1159.photobucket.com/albums/p626/PsiSoldier/spelllistbgnotitle31mer.jpg[/IMG][/center]\r\n[center] NEW [/center]\r\n\r\n(Teleport Minion: Skeleton)    Will teleport all Skeleton Minions to target location\r\n(Teleport Minion: Barbarian)   Will teleport all Skeleton Barbarians to target location\r\n(Teleport Minion: Archer)       Will teleport all Skeleton Archers to target location\r\n\r\n[center][img]http://i1159.photobucket.com/albums/p626/PsiSoldier/SummoningSpells.png[/img][/center]\r\n\r\n[center][img]http://i1159.photobucket.com/albums/p626/PsiSoldier/summoningspellsnotitleg.png[/img][/center]\r\n[center] NEW [/center]\r\n\r\n(Summon Fire Mage)   OBTAINED VIA RESEARCH IN LAB! You may also purchase for a steep price\r\n(Summon Lightning Mage)   OBTAINED VIA RESEARCH IN LAB! You may also purchase for a steep price\r\n\r\nSummon Banshee: Summons a banshee to serve the necromancer\r\nSummon Bone Construct: Summons a large engine of death to destroy your enemies\r\nSummon Dark Spirit: Summons an ethereal soldier to combat your enemies attacks have a chance to pass through without harm\r\nSummon Death Golem: Summons a large tank like warrior to your aid\r\nSummon Death Naga: Summons a flying creature of death to attack your enemies\r\nSummon Flesh Golem: Create an zombie like golem to serve you\r\nSummon Ghost Wolf: Summons an etheral wolf to your aid, attacks have a chance to pass through without damage\r\nSummon Gloom Wraith: Summons an undead warrior to your aid armed with a warhammer.\r\nSummon Gloom Slasher: Summons a more powerful Gloom Wraith armed with a sword.\r\nSummon Lich Battle Mage: Summons a spell wielding Lich to your aid.\r\nSummon Priest of Death: Summons a combat mage to your aid.\r\nSummon Reaper Spirit: Summon a spell wielding creature of death\r\nSummon Rot Fiend: Summons a Rot Fiend to dispatch your enemies with brutal melee attacks\r\nSummon Undead Dragon: Summons an Undead Dragon To combat your enemies.\r\nSummon Vampire Lich: Summons a vampire lich to do battle with your enemies\r\nSummon Wraith: Summons a wraith to blast your enemies with magic\r\nSummon Zombie Lord: Summons a zombie lord to do battle with your enemies\r\nSummon Zombie Boss: Summon a large Zombie boss to tank your enemies\r\nSummon Zombie Soldier: Summon a zombie soldier to protect you\r\nSummon Zombie: Summon slow shambling zombies to attack your enemies.\r\n\r\n[Center][img]http://i1159.photobucket.com/albums/p626/PsiSoldier/Wheretogetver1.png[/img][/center]\r\n\r\nIn later updates you will be required to complete quests to gain some spells or recipes for spells and then complete a ritual to gain the actual spell as well as the option to build a laboratory in the Defiled Sanctum and command your liches and mages to research new spells for you.\r\n\r\nBut at this time you will simply purchase the spells. Currently you can get the spells from a number of npcs There is also a custom NPC that sells the spells located in the Riften Graveyard.\r\n\r\n[Center][img]http://i1159.photobucket.com/albums/p626/PsiSoldier/TheDefiledSanctum.png[/img][/center]\r\nIn ages past the Sanctum was once the lair of a powerful necromancer. However due to unknown reasons it was abandoned long ago or its owner destroyed and has since fallen into ruin. It is believed that the Sanctum serves as a beacon for both evil and those that would destroy it. Many sections of the lair have succumbed to cave-ins and the entire lair has been cut off from the outside world by a collapse of the entrance. However the power of death still resides in the old ruins and may reach out and call to a powerful necromancer worthy of restoring the sanctum. \r\n\r\nA powerful necromancer adept at traveling the stygian paths of the dead my find the Defiled Sanctum calling out to them. Once they learn its location they may travel there via teleportation and begin the process of claiming and restoring the lair. Once they find the heart of the dungeon they may activate the glowing orbs to begin issuing commands for the lair. The first step of the process is to clear the rubble and begin the restoration process. Once the rubble has been cleared they can begin to build the instruments needed to turn the lair into a fully functional player base.  At present you may build a Smelter, Forge, Workbench, Grindstone and an Alchemy Lab with more to come.\r\n\r\nThe Defiled Sanctum is still a work in progress and you can expect many many changes and additions to come in the future. At current time I have not allowed you to clear the entrance to the lair in part because I plan to have the lair subject to incursions by random adventurers and as you grow in power attacks from opposing factions.  And also in part because I have not yet chosen (Or honestly even looked for a location to place the entrance in the outside world, and intend to look for a place where the player can build a large number of buildings on the surface as they grow in power so I need an appropriate place to build a number of other structures near the surface entrance)\r\n\r\n\r\n[center][img]http://i1159.photobucket.com/albums/p626/PsiSoldier/Grim-ReaperGY.jpg[/img][/center]\r\n[size=4][color=#4169E1]\r\nSummoning Undead in graveyards will give you a 50 point boost to the health of any undead summoned in that location. Currently only Whiterun, Riften, Solitude and Windhelm have been added but more will come at a later time.  You should receive a message stating when you will receive or not receive a bonus for summoning as you enter and leave a Graveyard.[/size][/color]\r\n\r\n[center][size=6][color=Gold]Laboratory [/center]\r\nResearch[/size][/color]\r\n\r\nIf you haven\\'t found the Laboratory yet you need to be using the Stygian Path spells until you locate the Defiled Sanctum..  Use the new spell Stygian Paths: Defiled Sanctum to reach the lair.. Once inside the lair you can locate the throne room and use the eye of Magi to begin clearing out the lair.. One of the options will allow you to clear out the Laboratory and the Pit  Do so and you will be able to enter the laboratory.\r\n\r\nYou may conduct research in the laboratory for various fields of study. At present time only the Undead Research category is active.  To begin research in the Undead you will need to acquire the spell \\\"Capture Undead\\\"  once you have the spell you may begin capturing undead test subjects for your undead research. Almost any undead enemy you encounter may be used as a test subject. The only known exception are certain ghosts or possibly undead added from other mods.  Engage the enemy undead in combat and when they are below 25% health you may cast the Capture Undead spell on them. It should always be successful on valid targets that are below 25% health. After a few seconds they will be teleported to the Pit in the Laboratory of the Defiled Sanctum to await their turn to be slaughtered and used as a test subject for your research.\r\n\r\nOnce you have acquired your test subjects you may go to the laboratory and click on the floating eye of Magus ball near the altar in the laboratory. This will present you with the various options for conduction research. At present the options are  Increased Health, Increased Skill, Decreased Upkeep and New minion types.    The first three options may be researched indefinitely however each successive improvement will require more time for the next improvement.  All research is conducted in real time and the speed at which it is conducted is dependent on the number of researchers you assign to the project. At present time you may assign Ice Mages and Liches to conduct the research. Each Ice Mage will provide one point of Research while each lich is worth 3.\r\n\r\nSo for example.. \r\n\r\nAssigning Once Ice Mage to a Research new minion type project with a base time of 3000 seconds will provide the base amount of research meaning the project will take  \r\n\r\n(3000/1) / 60 *Seconds*  =   50 Minutes\r\n\r\nAssigning Two Ice Mages to the same project \r\n\r\n(3000/2) / 60 *Seconds* = 25 Minutes\r\n\r\nSo the more you assign to a project the faster it will be completed. The formula for other improvements is a bit more complicated the time is essentially multiplied by the number of improvements you already have made although the base time is much lower than that of researching new types of undead.\r\n\r\n[center][img]http://i1159.photobucket.com/albums/p626/PsiSoldier/ChangeLog.png[/img][/center]\r\nV 0.835 - 0.838\r\nReduced chattering sounds of Skeletons to a whisper to make them far less annoying in cramped spaces.\r\n\r\nAdded many more new sound effects for various spells\r\n\r\nAdded the Elemental Fortitude line of spells Each rank will increase the Fire, Frost, Shock and Magic Resistance of your summoned minions by a set ammount there are 8 possible ranks which can increase elemental resistance up to 100% and Magic by 50%\r\n\r\nTweaked volume on already existing custom sounds.\r\n\r\nDone work on Adding new Banshee summon but have not completed that work or added Spell Tome..  If curious anyone can add via the console but the stat tracking and all other functions are not available yet.\r\n\r\nUpdate 0.83 - 0.835\r\n\r\nReduced experience gain from Skeleton Minions and Skeleton Slaves\r\n\r\nAdded some new custom sounds to a few spells and to the Defiled Sanctum as well. Particularly the Ready sound for summons, which is now much louder and more evil sounding so you should know when a summon is ready to cast.\r\n\r\nChanged the way the mod handles vanilla summon spells.. Now if you have a vanilla summon already out and cast the spell again the old one will be replaced with the new one.\r\n\r\nIf you have the Twin Souls perk you should be allowed 2 summons at once. Occasionally things may get slightly buggy due to timing of scripts and you may end up being able to summon an additional minion or two but once they time out and expire things should return to normal. I\\'m probably not going to fix this because I would have to update the scripts too quickly causing slow down of the game so I consider this acceptable.\r\n\r\nThe vanilla \\\"Necromancy\\\" perk will now prevent Raised dead from turning back into ash as well as causing double duration. (Double Duration is fairly pointless however as I have given the vanilla spells a nearly infinite duration now)\r\n\r\nYou may now Raise the dead up to your summon limit granted by my mod, however you will now be charged upkeep depending on the Raise dead spell you use. NPC\\'s raised in this manner will not however recieve bonuses granted by my Necromancy perks, although they will still gain the Dark Souls bonus.\r\n\r\nUpkeep for Raised dead will still be reduced by your Master of Control perk and any research completed in the laboratory. Upkeep costs are as follows.\r\n\r\nUndead Thrall: 150 Magicka\r\nDread Zombie: 120 Magicka\r\nRevenant: 80 Magicka\r\nReanimate Corpse: 45 Magicka\r\nRaise Zombie: 25 Magicka\r\nV 0.8282 - 0.83\r\nFixed it so if you have previously cleared the Laboratory (Previously the Pit) or the small rooms the new boulders placed should now automatically be deleted upon the script updating.\r\n\r\nAdded the Skeletal Fire and Lightning Mages!  These new minion types may be researched in the laboratory.  Adding ranks in the Perk \\\"Imbue the Dead\\\" will greatly increase the power of the lightning and fire mages. Each rank of the perk adds more magicka, skill, perks and spells to the lightning, fire and the already existing Ice mages.\r\n\r\nThe old Ice Mage has been greatly improved as well although you are not likely to see much improvement until investing in the Imbue Dead perks.\r\n\r\nIncreased the upkeep for the Undead Ice Mage by 20 points to reflect his new potential.\r\n\r\nV 0.828 - 0.8282\r\nDeleted the boulders in the Defiled Sanctum and placed new ones.  This will hopefully fix the issue some people have been having with a boulder blocking the door to the teleport chamber.\r\nV 0.827 - 0.828\r\nRemoved all the different Necromancy spells for changing mod options and added one single spell \\\"PsiKotic\\'s Necro Mod Manager\\\"  to help with reducing clutter and making things a bit more neat in general.\r\n\r\nAdded an option in the Necro Mod Manager spell to select Yes or no to moving Draugr to the players location.  More than likely you want this set to No which should also be the default setting as the Draugr glitch too oftenwhen being moved.  This should help anyone who has been experiencing problems with the Draugr glitch.\r\n\r\nAlso updated some help messages both automatic popups and through the help option in the Mod Manager spell.\r\nV 0.825 - 0.827\r\nAdded more help messages at different points to assist new players to the mod.\r\n\r\nCorrected Perk descriptions in the Perk tree to be more informative and also to fit within the space allowed.\r\n\r\nFixed the issue with players improperly getting their manna back while slaves working in the lair.\r\n\r\nChanged the requirements for Blood and Death Mastery perks Death Mastery requires Destruction skill and Blood Mastery requires Alteration, Both skills are still in the conjuration tree however the description states the required skill and level.  Also increased the requirement for the higher level ranks.\r\n\r\nAlso fixed an issue with Legion of the Dead Rank 4 and 5 requiring the wrong perks.\r\n\r\nV 0.82 - 0.825\r\n\r\nAdded a series of automatic message boxes designed to help new players understand how to use the mod appropriately, For example when a player purchases a spell and does not possess the required perk to cast the spell he will be presented with a message box informing him so.  Likewise when a player learns a new perk he will be presented with a messagebox informing him of new spells that he may learn.  Players who have already advanced a good deal through the game and have already aquired perks such as Ritual expert will see only a few messages and never be bothered with them again.  New players will likely see many more messages as they progress through the game.\r\n\r\nI will likely add more help messages in the future but this is a good start.\r\nHopefully fixed an issue where a random boulder was appearing blocking the door to the portal room in the Defiled Sanctum..  No such boulder even existed inside the creation kit however I moved several around and resaved and was not able to duplicate the problem. Let me know if it continues to be an issue though.\r\n\r\nV 0.81 - 0.8212\r\nSet the default follow distance for summoned minions to 20 feet approximate.\r\n\r\nAlso the Config Follow distance spell was not adding properly to players spell book automaticly like it should have been.  Should be corrected now.\r\n\r\nV 0.8 - 0.81\r\nAdded new spell \\\"Necro Config Follow Distance\\\"  The spell will allow you to set a rough distance at which your undead will be teleported back to the players location\r\n\r\nAlso added another bug fix.  In the event All of a type of minion dies and the mod still believes that one lives and your minion count is over 0 and you are being charged upkeep you may use the Reset Minion count spell and it will refund your upkeep for that minion. Just be absolutely certain that the minion is dead before using the reset spell.\r\n\r\nIncreased the range and speed of the Decay projectiles.   You no longer have to be standing very close to your target to hit them.\r\n\r\nChanged the messages for summoning in a place of the dead to a notification on the top of the screen. This will prevent any of the repeating message bugs from happening with that message as well.\r\n\r\nDeathKnights and IceMages will now also be teleported to the player if they get too far away.  This could result in a bug where they are laying on the ground and not standing. But if it happens just unsummon them.\r\n\r\nFixed the problem with Death Knights occasionally spawning around the player for no reason.  \r\nProbably more that I have forgotten.\r\n\r\nV 0.798 - 0.8\r\n\r\nDivided Devour Soul into Two spells.  You now have Devour Soul which will enslave a spirit and Devour Essence which will allow you to gain some knowledge from your victim. I have not yet extensively tested this but dividing the two spells appears to have drasticly increased the performance of the script for the spell.\r\n\r\nNow when using Bone Mend you will recieve a message in the top left every few seconds informing you of the health percentage of your minion so you will no longer spend time attempting to heal a minion that does not require it.\r\n\r\nInitiated further attempts stop the player from recieving inheritance letters upon the death of their ghosts from Spirit assault. \r\n\r\nWhen a Lich or assassin dies now the Ghostly remains will auto delete after 3 minutes. This also includes the ghostly remains of any enemy types that leave behind that type of remains. I may extend this if requested. But 3 minutes I believe is more than likely enough time to loot any remains left by enemies. \r\n\r\nDecreased the minimum (Random 0 - 30) Devour Soul resist for enemies from 30 to 25 as well. \r\n\r\nV 0.795 - 0.798\r\nChanged most of the notifications so they will only appear at the top left corner of the screen and not the center. I prefered to have the messages in the center screen where they are more visible but Skyrim is just to buggy to use that. So instead you will get notifications at the top left. But this will solve the buggy repeating message error.\r\n\r\nAdded a Cheat spell \\\"Necromancy: Increment Enslaved Spirits\\\" for those who are starting new characters and want to restore their Enslaved spirit count. For sell from conjuration vendors such as Secret Fire in Dragons Reach. Not meant to be used for normal play for obvious reasons.\r\n\r\nFixed the bug with Lost Minions and Lost upkeep. Now if you have lost minions and upkeep that has not been returned simply unsummon all minions of that type and wait for a minute. The Lost minion count should be reset and upkeep returned if there is any. This will happen automaticly as long as you have 0 current minions of that type and wait for the script to update. \r\nV 0.792 - 0.795\r\nFixed it so that players may summon their Undead from the mod and also summon Atronarchs or resurect dead npc\\'s to fight for them with vanilla spells. The Vanilla Twin Souls perk will also allow the player to summon 2 normal mobs from the vanilla game as well. \r\n\r\nThere could be issues with this and summon spells created by other mods however unless the author of that mod created his own Keyword for his summoned creatures like I did with my mod and in that case If you summon one of those creatures it would likely kill all others, If the mod author did not create his own keyword and opted to use an existing one then you would likely be able to cast that spell and summon creatures equal to your limit for skeletons from my mod.   Skyrim is buggy though so there is really no way to be sure what it would do.\r\n\r\nI also Lowered the Player Relationship with ghosts from the spirit assualt spell to Friend from Ally  and OnDeath the relationship will be set to 0.   Hopefully this will fix the issue of players getting Letters of inheritance from their dead \\\"Ghosts\\\"  Lol\r\n\r\nI have also set the UnrelentingForceShout used by the Deathknights to make Undead skeletons summoned by the mod immune to the spell to help prevent friendly fire accidents and keep your own minions from going hostile against one another.\r\n\r\nAlso Put in place an extra check to prevent the Minion Death message from displaying too many times in rapid succession. Now the message can only display once about every 4 seconds. This will hopefully keep the message from getting stuck with the repeating message error caused by overloading skyrim asking for too many messages.  It is possible you could loose more than one minion within a 4 second time period and you will only recieve one message though. But this is better than a chance of the repeating error.\r\n\r\nFixed an error with the Corpse spider script that had gotten messed up.\r\n\r\nV 0.789 - 0.792\r\nYou will now recieve a 50 point health bonus for summoning inside nearly any Tomb, Crypt or Hall of the dead in Skyrim.\r\nYou will now recieve a message when you have summoned your maximum allowed Undead\r\nYou will now recieve a message when one of your undead dies telling you what type of minion died.\r\nThe summoning message for the Graveyard has been changed and is no longer a messagebox that is required to be clicked.\r\nNow when casting Devour Soul you will no longer recieve a messagebox saying you failed. Instead you will recieve one of several messages that relate how close you came to success if you failed.\r\nIncreased summoning Charge time for basic Skeleton\\'s by a few seconds.\r\nReduced the max summoning limit for basic necromancy from +4 to +1 Also removed the +1 summon for Hasten Dead 4 and Imbue Dead 5 and reduced the Summon bonus for Legion of the Dead Rank 1 2 and 3 slightly.\r\nIve done more I think.. but honestly Ive forgotten Lol\r\nV 0.784 - 0.789\r\nCreated 3 new spells that will allow the player to target a location and teleport basic skeleton minions to that location.  Provides new ways to send your minion\\'s into battle with a bit more of a tactical edge.\r\nV 0.78 - 0.784\r\nAdded two new spells to the game both go with the Harden Dead perk. The first is recieved at Rank 5 of Harden the Dead and will automaticly be added to your spell book. The spell will Buff the health of your undead minions by 25 points.   The second spell replaces the first and is added at rank 10 automaticly It lasts for 2 hours and increases the health of minions by 50 points and grants them 0.5 Health regeneration per second.  Enough to heal back to full on their own after a fight and possibly enough to survive a few extra fights.\r\nV 0.775 - 0.78\r\nCompleted Navmesh for the Defiled Sanctum, Also added some new enemies to the Dungeon Heart in the Defiled Sanctum.   One Lich, 2 Death Knights, 2 Undead Assassins, 4 Skeleton Archers and 5 Skeleton Barbarians.\r\nAlso revamped part a couple parts of the lair and changed a couple of the narrow hallways to make them much wider so players do not have as big a problem with minions blocking their way.\r\nDid a bit more work on the Laboratory, and also created a new spell \\\"Capture Undead\\\" that will capture weakend undead that are below 25% health.. The spell has not actually been added to the game yet as it requires more scripting to get it ready for the research system, but if anyone wants to check it out you can just do Help \\\"Capture Undead\\\" 4  and player.addspell Blahblah     The spell will teleport any weakend undead hit by it to the pit in the laboratory for use in the research system.. But as I said now that part of the script has not been completed only the teleportation part.  An easy way to check out the lab for anyone curious is the command   COC PsiLaboratory1   \r\nV 0.77 - 0.775\r\nPerformed a re balance of Spirit Wave and Spirit Assault.  Both spells will continue to get more powerful the more spirits you enslave however both will see diminishing returns as you continue to enslave more spirits.  Both spells can still become incredibly powerful but will require a lot more souls in order for that to happen. For example with 1000 enslaved spirits, spirit assault will summon between 11 and 25 spirits to your aid for up to 30 seconds\r\nSpirit wave has likewise been rebalanced. There is no cap on the maximum force of the spell however you will see less of an impact with each soul enslaved as you reach higher ammounts.\r\nAlso did more work on the laboratory, it is nearly ready to begin working on the research system.\r\nV 0.768 - 0.77\r\nPerformed a major re-balance of the necromancy minions.  The health bonuses for perks have been cut in half and the health of Skeletons has also been greatly reduced. Except for the barbarian which has had its base health slightly increased.  The casting time for all skeletons has been cut in half more or less not considering perks.\r\nThe Lich has had its health cut drasticly and the upkeep increased from around 110 to 200 or so. Death Knight has had its base health increased but upkeep also increased, Assassin has had base health reduced and upkeep increased. Icemage has had upkeep increased.\r\nI have altered the lair and connected the Laboratory that I am working on to the Defiled Sanctum  It is still heavily under construction but is there for anyone who wants to see and provide feedback.\r\nV 0.767 - 0.768\r\nFixed problem with Bone Mend being considered hostile to your undead\r\nFixed Lich so it only summons a max of 7 minions\r\nAdded a new spell vendor to the game that sells all necromancy spells in the Riften Graveyard.\r\nV 0.765 - 0.767\r\nAdded new spells.\r\nBone Mend: Heal undead minions by transfering your own health to them Improved ranks of Blood master require less health from necromancer\r\nReduced speed boost for Hasten Dead perk also added a spell to buff undead with increased speed.\r\nV 0.763  - 0.765\r\nAdded new spell Cannibalize allows player to convert health to magicka improved by blood mastery\r\nAdded a second rank to Vampiric Celerity and decreased speed boost for Rank 1 from 100 to 75\r\nRe-added Blood Rage and Corpse Spider spells to Vendor list (Dont know how they were removed but somehow they were)\r\nV 0.762 - 0.763\r\nModified Spirit Strike and added Spirit Wave One spell does Direct Damage the other has a more powerful Knockback.\r\nAdjusted the perk tree to make it all look better and more organized.\r\nV 0.76 - 0.762 \r\nAdded spell Spirit Strike.  Does Damage and knockback based on the number of enslave spirits from Devour Soul\r\nV 0.753 - 0.76\r\nS1. Added a help spell to cover some basic questions people have about the mod and may answer more in a later update.\r\n2. added more scripts to upgrade the lair. You may now add Forge, Smelter, workbench, Grindstone and Alchemy Lab.\r\n3. Added Perk Vampiric Celerity. Requires Hasten Dead. If the player is a vampire and chooses the perk they will automaticly gain a new spell that will provide a boost to speed and minor boost to attack speed. Includes two spells one to turn the power on and one to turn it off.\r\nV 0.75 - 0.753\r\n1. Optimized some scripts to delete summons from the game upon death to decrease save file sizes.\r\n2. Fixed a minor error with ceiling in the lair.\r\n3. Added the ability to build a Blacksmiths Forge in the lair after clearing the main room. (Now that I have the concept down the remaining items should come in quick order.)\r\n4. Did some other stuff but I forgot Lol Think I fixed the IceMage to stop being summoned if he\\'s lost.\r\nV 0.745 - 0.75\r\n1. ReAdded the Spells to reset your minion count to 0 in the event you need it.\r\n2. Updated the Lair. You may now use the large ball in the Dungeon heart to clear out the rubble from different rooms. You will need Skeleton Slaves in order to do the work and it will assign all your current slaves to the task you choose. The more slaves you have summoned the faster the work will be completed.\r\nThe lair is still largely incomplete however you can use this feature as it is now to get an idea of how things will begin to progress with the lair.\r\nV 0.74 - 0.745\r\n1. Added new spell \\\"Spirit Assault\\\"\r\nA) \\\"Spirit Assault\\\" will summon a random ammount of spirits based on the number of enslaved souls you posess to attack an enemy for a random ammount of time. This ammount of time grows with increased ranks of Spirit Mastery.\r\nThe new \\\"Soul Mastery\\\" perk line is a series of perks and spells that will start out weak but as you continue to use them will eventually become an extremely powerful force for dealing with your enemies. Each Soul you enslave will continue to make you more powerful than ever before. But it is difficult to enslave souls and you will even then be presented with the difficult choice between enslaving the soul or devouring its essence in order to increase a skill towards another level up.\r\nV 0.7365 - 0.74\r\n1. Added New Perk \\\"Soul Mastery\\\" with 10 ranks\r\n2. Added New spell \\\"Devour Soul\\\" ****KILLS ESSENTIAL NPCS*** This spell is improved by the Soul Mastery perk. When casting this spell you have a chance depending on your level of Soul Mastery and the targets Health to rip out their soul. If cast successfully the target dies instantly. If unsuccessful nothing...\r\nRipping out your victims soul will give you two choices..\r\nA) Enslave their spirit. This will add 1 point to your max manna and it will also increase the effectiveness of your Soul Mastery spells such as improving your chace of a Successful cast of \\\"Devour Soul\\\" More Soul Mastery spells are to come which this will be used for.\r\nB) Devour Essence: If you choose this option you look over your victims spirit searching for any bit of knowelge in which they possess more of than you. If your victim knows more about a certain skill than you, you will recieve a skill advance in that specefic skill. However the targets soul is lost forever and not enslaved.\r\nV 0.736 - 0.7365\r\n1. Bug fix to remove debug message for Dead Minions\r\n2. Added two new spells that will allow you to reset your minion count to 0 for different types of minions if the count becomes bugged in some way. The spells will automaticlly be added when you look at your minion count with the Necromancy Statistics spell.\r\nV 0.732 - 0.736\r\n1. Fixed problem with Stygian Paths freezing up and not working after first cast.\r\n2. Updated to allow All summoned undead to be placed at the players location if they are lost and fall too far behind.\r\n3. Added the Undead Assassin to the Necro Statistics spell.\r\nV 0.73 - 0.732\r\n1. Made Stygian Path encounters slightly more difficult in some cases, also made the portals in the Stygian Paths work better.\r\n2. Scripted the Portal in the Defiled Sanctum to teleport the player to different Graveyards.\r\n3. Altered the Defiled Sanctum with minor improvements.\r\nV 0.72 - 0.73\r\n1. Added more Stygian path Locations with Random chance to encounter Undead of different types on the paths.\r\n\r\n2. Added the Necromancers Lair, The Defiled Sanctum (Created by Tolisk) There is a 15% chance that you will discover the Lair each time you cast a Stygian Paths spell. If successful you will recieve the spell \\\"Stygian Paths: Defiled Sanctum\\\" The lair is still a work in progress and is in a highly unfinished state but if anyone has comments or suggestions we would like to hear. Many of the items in the lair are currently disabled and you will not be able to see them though as they will be added later by the player creating quests or buying them, that functionality has not yet been added.\r\nV 0.7 - 0.72\r\n1. Added 4 new spells from Acran2004\\'s Death and Decay - Necromancers Supremacy\r\nThe spells have been modified to fit in with my mods Perk system. And are improved by Death Mastery. You will need the perk \\\"Blood and Death\\\" to cast the spells. They will improve with increased ranks of Death Mastery\r\n2. Updated Stygian Path\\'s thanks to help from Tolisk for creating new cells for the Stygian Paths.. Currently only Whiterun and Riften have been updated but the remainder will be updated soon. Will also add random encounters with Undead when using the paths..\r\nV 0.697 - V 0.7\r\n1. Added two new spells Corpse Spiders & Summon Undead Assassin.\r\na) Corpse Spiders, like the Diablo 3 spell Corpse spiders summons 5 or more spiders to attack your enemies but the magic animating them lasts only a few seconds. Duration, number of spiders and health are increased by Curse Mastery.\r\nb) Summon Undead Assassin. New Summon Spell. The undead Assassin is a Corrupted Shade Archer with a serious ranged attack and the ability to paralyze targets. As with all the major summon spells it is improved by the undead perks.\r\n2. Major improvements to the Lich. The Lich will now cast Deathbolts, powerful Lifetap spells, Heart Attack spells and Summon up to 7 minions of its own once every 35 seconds when not in combat.\r\n\r\n3. Altered the spell sounds and visual effects for the Deathbolt. Changed back to ball of light since I like the idea of Light being the last thing people say they see when they are dying.\r\nV 0.6931 - 0.697\r\n1. Added 5 ranks of Death Mastery plus the Death spell \\\"Deathbolt\\\" a relatively high direct damage Death spell that is improved by ranks in Death Mastery\r\n2 Summoned Liches will now summon Skeletons of their own when not in combat. Each Lich may have up to 7 random skeleton minions of the: Minion, Barbarian or Archer variety. These minions will not require manna upkeep from the player but the Lich requires a hefty sum of upkeep. While not in combat the Lich will summon one minion aproximately every 75 seconds.\r\nV 0.69 - 0.693\r\n1. Added 6 new Perks. Blood and Death which will give access to Blood and Death spells (more in future) and 5 Ranks of Blood Mastery which will improve Blood spells\r\n2. Added the spell Blood Rage. Sends target into a Blood Rage and causes them to attack anyone nearby. It also increases their Health, Speed, weapon skills and stamina.\r\nV 0.688 - 0.69\r\n1. Added Minion Bonus stats, Lost Minion Count and Minion Upkeep to the Necromancy Statistics spell\r\nV 0.686 - 0.688\r\n1. Fixed Barbarian Summon\r\n2. Fixed Ritual Expert going past Rank 3\r\n3. Configured the game to respawn any skeleton summons at the player if they are over a certain distance and considered Lost.\r\n4. Added functionality to detect Lost Icemages, DeathKnights and Liches as well as other types of undead that are close to the range required to place them at the player. This number can be seen in the Necro Config spell.\r\n5. Added a spell to unsummon \\\"Lost\\\" units\r\n**This \\\"Lost\\\" functionality is not yet perfected and may show a lost count that is not completely correct. I still have work to do on this. But it will give you a good idea**\r\nV 0.682 - 0.686\r\n1. Added two new spells. Auto added on starting the game if you have Basic Necromancy\r\n\r\nA: Necromancy Statistics: This spell will give you all the valid statistics about your summoned undead. Still working on this but it currently gives number of current minions and will give more soon.\r\n\r\nB: Necromancy Config: This will hopefully solve the conflict about what to do with minions getting in your way. This will present you with an option upon casting the spell. You may choose to have your skeletons moved automatically if they are too close and blocking your path or Doing nothing and letting them behave as they will. Currently only the skeletons are affected by this but I may add more options later.\r\n\r\nV 0.68 - 0.682\r\n1. Rebalanced the mod some. Barbs became Apprentice Level and Archers became Journeyman level. Also increased the health of barbarians slightly.\r\n2. Instead of disappearing, If you get within one foot of some skeletons they will just be moved behind you. For all you haters this is to keep them from blocking you inside cramped spaces.. If you prefer to just be blocked in then I can change it back and let them block you..\r\n3. Added a Lich Summon. I still need to update it so that Ritual expert decreases casting time but my wife is pestering me so I dont have time now.\r\n\r\nV 0.675 - 0.68\r\n1. Added 4 new spells. Stygian Paths: (Whiterun, Windhelm, Riften & Solitude) A spell that will teleport the necromancer to the graveyard in those respective cities.\r\n2. Updated spell descriptions to be more exact and also give casting perk requirement for each spell. There seemed to be some confusion about what spells people could cast. Hopefully this will help.\r\nV 0.673 - 0.675\r\n1. Added a fun new spell\r\nPlague Rats: Summons a pack of frenzied plague Rats to harass your enemies. Plague Rats are disease carrying vermin and will attack everyone including you! The effectiveness of the spell is increased by Curse Mastery. Lots of fun with maxed Curse Master. Summon a Horde of them and watch the hilarity ensue. Curse Mastery increases both the health of plague rats and the number of rats summoned.\r\nV 0.667 - 0.673\r\n1. Added a small script that makes it so you can walk through your skeletons if they are in your way in a small space. Just walk up to them and they will vanish for a moment allowing you to walk through the space. You may have to wait a few seconds for them to disappear though.\r\nV 0.665 - 0.67\r\n1. Added two new Necromancy spells. Life Tap and Siphon Life. Both spells are improved by the Curse Mastery perk. And they level a skill other than Conjuration however they require Basic Necromancy\r\nLife Tap: A concentration spell that absorbs increasing amount of health from the enemy with higher ranks of Curse Master with only a minor increase in manna cost\r\nSiphon Life: A fire and forget spell that absorbs a very small amount of health per second but does not need to be maintained. Perk increases in Curse Master increase both the amount absorbed and the duration.\r\n2. Removed the annoying message about Upkeep from all the undead summons.\r\nV 0.661 - V 0.665\r\n1. Added New summon spell. Summon Skeleton Slave. Very basic Low cost summon. Does almost no damage and has no weapon. But it may be good for a distraction. And I may have other plans for it in the future if I put in the idea of a Necromancer\\'s lair having the slaves perform a function there to upgrade it.\r\nV 0.66 - 0.661\r\n1. Apparently fixed a bug with fireball not behaving as it should, although I didn\\'t actually do anything other than open and close fireball and save. Either way it appears to be working correctly again. Strange.\r\n\r\n[center][img]http://i1159.photobucket.com/albums/p626/PsiSoldier/FuturePlans.png[/img][/center]\r\n\r\nThings I am currently or plan to work on are\r\n1: Adding more specialized and unique undead for summoning. I have recieved permission from the authors of the Skyrim Monster Mod to add undead from the mod so you can expect to see new summons coming from there.\r\n2: Adding more Graveyard and Tomb locations for the bonus to summoning undead\r\n3: Lots more diseases and improving the disease system of the mod.\r\n4: Adding other new types of Necromancer spells that may be boosted by existing or new perks.\r\n5: Improving the visual effects for spells.\r\n6: Adding the ability to become a Lich\r\n7: Adding custom enemy factions that will hunt necromancers including the player\r\n8: Adding new spells, items, elixirs and other things through the new research system Im working on.\r\n9: The Research system I just talked about lol\r\n10: Lots lots more..\r\n\r\n[center][img]http://i1159.photobucket.com/albums/p626/PsiSoldier/logowithoutpicglow.png[/img][/center]\r\n\r\nMuch thanks to Xion209 for his great help with getting the Mod description to look so fantastic!\r\n\r\nThanks for Tolisk for his great help with the Defiled Sanctum and the Stygian Paths designs!\r\n\r\nAlso thanks to Elderwrath for his help creating the NPC merchant selling the Necromancy spells in the Riften Graveyard.\r\n\r\n(( Help Wanted))\r\nIf anyone is good at doing spell effects, scripting quests or designing levels and wants to contribute to the mod I would be more than happy to work with you. I would love to see the visual effects for the spells upgraded to something cooler, and as I said before I would really like to add some quests and even a Necromancer\\'s faction to the mod which will require some level design. I am sure I can do all of this myself but I have not yet tried my hand at it yet and if anyone loves doing any of those things It would be great to have someone to work with!\r\n\r\n((Also))\r\nI have tried very hard to make sure this mod is not over or under powered and balanced with the other vanilla perks. I would appreciate any feedback on how people feel about the different perks and spells. Are they Over or Under powered? Does anything need to be increased or Decreased? Plus any suggestions for further improvements to the Mod are always welcome. I plan to include a lot more diseases to the mod as well\r\n\r\n[center][IMG]http://i1159.photobucket.com/albums/p626/PsiSoldier/DangerReanimated1.jpg[/IMG][IMG]http://i1159.photobucket.com/albums/p626/PsiSoldier/GodMode.png[/IMG][IMG]http://i1159.photobucket.com/albums/p626/PsiSoldier/DangerReanimated1.jpg[/IMG][/center]\r\n(( Other Warnings))\r\nDO NOT USE GOD MODE WITH THIS MOD.. God mode prevents player statistics from being changed and that is a central part of this mod with upkeep. If you summon skeletons then turn on God mode and they die you will not get your manna back. Or if you have god mode on and summon you will not be charged upkeep as you should be.. IF you summon and fight the entire time with God mode it might be ok.. But not the way the mod was intended to be run.",
  "categoryId": "75",
  "version": "0.845",
  "author": "PsiSoldier",
  "createdUnix": "1349407989",
  "updatedUnix": "1349411476",
  "containsAdultContent": false,
  "uploadedBy": "PsiSoldier",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92104",
      "name": "PsiKotics SkyMo Necromancy Mod",
      "version": "0.845",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "41767",
      "fileName": "PsiKotics SkyMo Necromancy Mod-25024-0-845.zip",
      "uploadedUnix": "1349411476",
      "modVersion": "0.845",
      "virusScanUrl": "https://www.virustotal.com/file/7be5b27e815059ba6d99d5dab54927107c1ce8287487bd57520a21fea651a6f1/analysis/1407204522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PsiKotics%20SkyMo%20Necromancy%20Mod-25024-0-845.zip?fid=92104&ttl=1535796322&ri=8192&rs=8192&setec=f9b650c38ef481da9408d721cd801180"
    }
  ]
}