{
  "modId": 25039.0,
  "modName": "The Listeners Lair",
  "summary": "No one has head of the shadowguard, the leaders of the dark brotherhood and their listener until now.....Discover the listeners lair! ",
  "descriptionHtml": "After seeing the new tribunal robes mod in black specifically and a few other evil/dark armour sets i began to use them for my vampire lord/evil character, Who is the listener of the dark brotherhood. However i immediately had a problem.....i had kickass armour and was an all powerfull assassin vampire DB listener yet somehow bethedsa deemed it fit for me to live in a awful little room of the dank boring DB dawnstar sanctuary.....After siving through player homes for hours i couldnt find one to my liking. So i watched \\\"BestInSlots\\\" (which is really helpful really recomend it) creation kit tutorial taught myself how to use it and this was what i came up with, it is my first mod however and is still incomplete but i thought i wack it up a see what you guys thought.\r\n\r\n[] THE LISTENERS LAIR [] \r\n\r\nA heavily modded player home aimed at those young apsiring evil genius\\' out there wanting a base of operations. This was a mod purely for my own personal perposes as a DB listener house but i thought why not.\r\n\r\nINCLUDED SO FAR:\r\n -> Entry foyer/reception area\r\n -> Personal Quarters\r\n -> Dungeon\r\n -> Throne Room (has armours and dining area in it) [IINCOMPLETE]\r\n\r\nTO DO LIST:\r\n -> Few more rooms need navmeshing\r\n -> Will COMPLETELY redo the throne room area to fit in more with the other two rooms architecture/overall feel.\r\n -> Crafting area [thought id forgot? ;) ] \r\n -> Shadowguards in the reception area\r\n -> Redo the outside apperance (i hate it!) [it was a quick botch job just so i could see what everything looked liked and linked together dont worry it WILL be alot better]\r\n\r\n\r\nI do have a lore friendly story behind this and will edventually add it for all you lore friendly abiders out there!\r\n\r\nFUTURE PLANS:\r\nI am planning to connect this with alot more dark brotherhood orientated mods as i felt that for a massive all powerful assassin organisation they are severly lacking in presence so i will be adding DB mini sancuaries in most cities with a few DB NPC\\'s/Followers. Just so it feel a little more realistic of a massive assasin cult.\r\n\r\n\r\n\r\n",
  "categoryId": "68",
  "version": "0.5",
  "author": "OrionsAura246",
  "createdUnix": "1349443200",
  "updatedUnix": "1349443200",
  "containsAdultContent": false,
  "uploadedBy": "OrionsAura246",
  "primaryFile": null,
  "files": []
}