{
  "modId": 25041.0,
  "modName": "Quest - The Raided Farm",
  "summary": "Currently still in beta this small mod project was basically sets up so the player gains an additional small quest to help out an NPC named Jeremy who is located in the Banneredmare in  Whiterun.",
  "descriptionHtml": "NOTE: This mod is in beta! Feedback and critique is really quite welcome, please do feel free to comment on what you think  or where you think I can improve. Thank you!\r\n\r\nThis small mod was made as a 1st year University assignment. Excuse the bugs and please disregard my cheap and dodgy voice acting/ recording due to this still being in beta and i\\'m not a professional.\r\n\r\nTo begin the quest the NPC located in The Bannered Mare in Whiterun - His name is Jeremy\r\n  (Dialogue could very well be bugged for him, the fix is located in the bug section.)\r\n\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\nBackStory:\r\nA family of farmers ,The Lev family, have been attacked by bandit raiders at their family farm house near east of Whiterun. The guards don\\'t seem to have the resources to deal with it and no one else has been able to check up on them in case they too are attacked and fall victim to raiders. The only Son of the family has fled the farm and has requested help from the local hero to investigate the state of the farm and clear out the threat so that the farm can be retaken by the rightful owner.\r\n\r\nFeature List:\r\n- A new quest to avenge a family of farmers.\r\n- A new location added to the east of whiterun.\r\n- A  voiced NPC added to The Bannered Mare.\r\n- Lore friendly Quest (except for the voice acting)\r\n\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\n\r\nKNOWN BUGS:\r\nMajor bug: \r\nThe quest giver NPC \\'Jeremy\\' located in the Banneredmare won\\'t speak his quest dialogue unless you save the game inside the same cell as the npc and then load the same save. ( Strange workaround i know.)\r\nLesser Bugs:\r\n- Objective Marker to the farmhouse points to wrong location, some reason it points way out to the Reach.\r\n- NavMesh issues for the farm\\'s Exterior, it is a little weird and messes with AI pathing. (Noob modder issue I think)\r\n- Inside the farmhouse, the bandit raider sometimes does not spawn properly or the Bandit spawns inside the furniture.\r\n- Objective Marker to return to quest giver NPC from inside the basement/cave will points to the wrong location, it points to the old exit.\r\n",
  "categoryId": "35",
  "version": "beta1.0",
  "author": "PyRoFyRe",
  "createdUnix": "1349447756",
  "updatedUnix": "1349447967",
  "containsAdultContent": false,
  "uploadedBy": "PyRoFyRe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92160",
      "name": "The Raided Farm Quest",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3926",
      "fileName": "The Raided Farm Quest-25041-1-0.zip",
      "uploadedUnix": "1349447967",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c6328b390e964ad162d382ca221b91f0ca63b60b21c78c1c6551cd94a076aa2f/analysis/1407204968/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Raided%20Farm%20Quest-25041-1-0.zip?fid=92160&ttl=1535796346&ri=8192&rs=8192&setec=ada3b73efd468833d15ca6e304741c9e"
    }
  ]
}