{
  "modId": 25048.0,
  "modName": "Ankh&#39;s Racial Tweaks",
  "summary": "Short Bosmer, gigantic giants, and Falmer are people too&#33; All races logically size-adjusted for visual variation.\r<br />\r<br />Not just a cosmetic overhaul; now includes race-specific base stats and regen, and Vampire stat buffs and penalties. \r<br />\r<br />Humanoid enemies are people too&#33; (Pickpocket, feed, and talk to them.)\r<br />\r<br />",
  "descriptionHtml": "----Latest update v0.9.1: Racial abilities half-replaced. Altmer, Dunmer, Orc, Imperial, and Bosmer are still vanilla.\r<br />\r<br />Standalone No Falmer version because of the animation issues with the Falmer/Hagravens is still in 8.5 version; Breton, Nord, and Redguard races are still with vanilla powers.\r<br />\r<br />Standalone creature version (Falmer, Hagravens, Dremora, Dragon Priests all NPC-ified, edited Giants, Mammoths, and Draugr) is in full 1.0 version. I foresee no particular changes in the future; I only have the playable race racial powers left to fix. Note that since Afflicted are humans (Bretons, by their stats, although defined in the CK as a separate race), they are not covered in this pack but in the human version.\r<br />\r<br />Note that this is for Skyrim with no DLCs alone at this point; Dragonborn and Dawnguard will be looked at later.----\r<br />[size=2]\r<br />\r<br />[/size][center][size=2]----[/size][/center]\r<br />\r<br />[u][b][center]The Inspiration[/center][/b][/u]\r<br />[size=2]Perhaps I&#39;m unobservant, but most of the inhabitants of Skyrim look very similar. I can&#39;t tell a difference between Bretons an Imperials, or dark-haired Nords and Imperials, or even light-skinned Redguards and Imperials or Bretons. Some of the Dunmer are so light-skinned they might be Bosmer and the Bosmer are so tall I thought they were all Altmer until I was level 10.[/size]\r<br />\r<br />[size=2]That&#39;s not all, either. The giants aren&#39;t impressive after you&#39;ve been around for a while; sure, they&#39;re big, but they&#39;re not [/size][i]that[/i][size=2] big. Children only half-exist and are more like scenery. Falmer, for some reason, are &#34;creatures&#34; instead of people, and I&#39;m almost personally offended by that fact. [/size]\r<br />\r<br />[size=2]Aside from the racial powers, which are rarely very useful, they are completely interchangeable - and NPCs don&#39;t even have their racial powers. I don&#39;t think that they should be the same thing with different skins.[/size]\r<br />\r<br />[size=2]I have uploaded a picture of a spreadsheet. Go check it out. It lists all of the base stats of all the races, and their vampire versions. See something wrong? Yes, every single one of them is exactly the same. I had thought that there were small, very mild differences, which I was planning to exaggerate, but no, every race is the same in every meaningful way. Only racial powers and the beast races&#39; greater unarmed damage separate them. If you don&#39;t see that as a problem, I completely understand, but this mod is not for you.[/size]\r<br />\r<br />\r<br />[u][b][center]The Goals[/center][/b][/u]\r<br />[size=2]I have made this mod to implement some changes in my game, and variation between the races. I&#39;d like to be able to look at someone and know what race they are without having to check their eye color or wait for their voice. I&#39;d also like them to feel more realistic.[/size]\r<br />\r<br />[size=2]These are all changes that make sense to me. I think they&#39;re &#34;lore-friendly&#34;, because they don&#39;t directly go against what we&#39;ve been told. &#34;Lore-adherent&#34; they are not. If you want pure lore, for which I would not blame you, I suggest Height Adjusted Races with True Giants. It&#39;s what I used until I made this for myself.[/size]\r<br />\r<br />[size=2]The current version (v .9) has more-or-less finalized cosmetic changes and implemented a complicated tweaking of all base stats (health, health regen, magicka, magicka regen, stamina, stamina regen, and carry weight) of all playable races, as well as all playable vampire races. There is now more you have to consider when you want to play against type than how attractive your Altmer character is going to be in heavy armor. There are now consequences and benefits to becoming a vampire aside from glowing eyes and a resistance to disease. In addition racial powers have begun to be switched over to passive abilities.[/size]\r<br />\r<br />[size=2]All changes are designed to be unobtrusive - not only unobtrusive, but to make your race less obtrusive than in vanilla, since my goal is to remove almost all active powers and leave passive changes that become a part of you. (Most changes to powers and abilities have not been implemented yet; see below for specifics.) You don&#39;t have to do anything special, you don&#39;t have to become a new race, a special kind of vampire, or use any console commands. It doesn&#39;t add a class or birthsign feature that you have to choose from. Just activate it and forget it - you and every other person in Skyrim will automatically reflect your race&#39;s true abilities.[/size]\r<br />\r<br />\r<br />[size=2]I&#39;m open to suggestions, but I will only end up implementing changes that I think are realistic and are what I would want. Ideas for racial powers will be carefully considered since I haven&#39;t thought that much about them at this point. [/size]\r<br />\r<br />\r<br />[u][b]\r<br />[size=3]The Implementation[/size][/b][/u]\r<br />\r<br />[b]===Features===[/b]\r<br />[size=2]--note: see the picture of a spreadsheet for a more easy-to-read list of all changes to base stats and heights all in one place. This list is divided by race.[/size]\r<br />[b]\r<br />General:[/b]\r<br />[list][*][size=2]Magicka regen in combat is raised from 33% to 50%.[/size]\r<br />[i][size=2]------[/size][size=1]The reason for this will become apparent if you look at the changed stats for most races. Suffice it so say, if left normal, an Imperial mage would die very quickly.[/size][/i]\r<br />[/*]\r<br />[*][size=2]I have unchecked &#34;no combat in water&#34; under all PC races, yet for some reason you still can&#39;t fight in the water. It doesn&#39;t seem to hurt anything, it just doesn&#39;t work.\r<br />[/size][/*]\r<br />[*][size=2]Assorted enemy races which have been changed to NPCs and set to allow dialogue, pickpocketing, and feeding:[/size][size=3] [/size][size=3]Afflicted, Dremora, Dragon Priests, Falmer, Hagravens[/size][b].[/b][size=2] All have also been allowed to dual-wield and been allowed to use equip types previous denied to them. (Seriously, a Falmer can&#39;t figure out how to use a mace?) (Beware animation issues. See below.) They won&#39;t have anything to say in dialogue, of course, but should you manage to somehow make them non-hostile you could try, at least. It&#39;s not like they&#39;re scenery. [/size]\r<br />[i][i]------[/i][i][size=1][i]Falmer are not animals. [/i]Falmer are elves - barbarian, feral elves, but still people. I can&#39;t stress that enough. I&#39;m so disappointed at the game for making them &#39;creatures&#39;, and arbitrarily limiting their ability to use weapons.\r<br />[/size][/i][/i][i][size=2]------[/size][size=1]Basically, I felt anything with hands and a brain should be able to at least try to use anything they can pick up to save their lives from the terrifying Dragonborn coming to screw up their day. However, I cannot promise that it wouldn&#39;t cause animation issues; they may have been limited because they didn&#39;t have animations to use those weapons, and should they happen to pick up a sword it might cause them to be stuck. I don&#39;t actually know. [/size][/i][/*]\r<br />[*][size=2]Enemy races that have been set to allow dialogue and pickpocket but have not had any combat options changed: [/size][size=3][b]Giant[/b][/size][size=2]. Giants also have their size set to 5. (No changed combat options because it would probably cause an absurd amount of bugs and broken animations.)[/size][/*]\r<br />[*][size=2]Enemy races which have been set to allow pickpocket but not dialogue and have not been changed from &#34;creature&#34; to &#34;NPC&#34;: [/size][b][size=3]Draugr[/size][/b][size=2] (both versions)[/size][/*]\r<br />[*][size=2]Mammoths now have size set to 3.[/size][/*]\r<br />[*][size=2]Edited the Falmer racial ability &#34;blindness&#34; effect, from magnitude 80 to 90. (Not that it does much good. I believe the very high sneak skill of the race makes them able to detect your anyway. Which isn&#39;t wrong, as far as I&#39;m concerned, because they can still hear and smell.)[/size]\r<br />[/*]\r<br />[/list][size=2]\r<br />[b]Children:[/b]\r<br />[/size][list][*][size=2]Can now be pick-pocketed and fed on by vampires.\r<br />[/size][/*]\r<br />[*][size=2]No longer ticked as &#39;children&#39;, which makes them killable.[/size]\r<br />[size=2]-------[/size][i][size=1]These changes affect all pre-existing child races (Nord, Breton, Redguard, Imperial) as well as Babette but won&#39;t have any effect if someone makes a Khajiit, Argonian, Mer or any new child race that copies the vanilla settings.[/size][/i][/*]\r<br />[/list][size=2]\r<br />[b]Altmer:[/b]\r<br />[/size][list][*][size=2]Changed the racial text to display &#34;Altmer&#34; as the name and &#34;high elves&#34; as the variation.[/size]\r<br />[i][size=2]------[/size][size=1]Mer call themselves Mer. The racial menus calling them &#34;high elves&#34; (not even capitalized names) makes them seem lesser than all the properly-named variations of human and beast races. It&#39;s written from a very human, I might even say Imperial, perspective. Why not call them what they call themselves?[/size][/i]\r<br />[/*]\r<br />[*][size=2]Changed the base height to 1.1 male, 1.125 female.\r<br />[/size][/*]\r<br />[*][size=2]Stat changes: [color=red]-Base Health:[/color] 30 [color=red]-Health Regen:[/color] .6 [color=blue]-Magicka:[/color] 100 [color=blue]-Magicka Regen:[/color] 5 [color=green]-Stamina:[/color] 30 [color=green]-Stamina Regen:[/color] 2.5 [color=yellow]-Carry Weight:[/color] 175\r<br />[/size][/*]\r<br />[/list][size=2]\r<br />[b]Argonian:[/b]\r<br />[/size][list][*][size=2]Changed heights from 1.01 and 1.0 to 1.05 and 1.025, weights to .75, and mass to 1.25.\r<br />[/size][/*]\r<br />[*][size=2]Added a Tough Hide racial ability that resists 10% of physical damage.\r<br />[/size][/*]\r<br />[*][size=2]Removed the 1/day Histskin power.\r<br />[/size][/*]\r<br />[*][size=2]Changed health regen to 1.0 (up from .7) and allowed HP regen in combat.[/size]\r<br />[size=2]------[/size][i][size=1]The only other race to have HP regen in combat is trolls; Argonians are special. This is to simulate their Hist connection in a much more immersive way than using a power.[/size][/i][/*]\r<br />[*][size=2]Stat changes: [color=red]-Base Health:[/color] 80[color=red]-Health Regen:[/color] 1[color=blue]-Magicka:[/color] 60[color=blue]-Magicka Regen:[/color] 1[color=green]-Stamina:[/color] 60[color=green]-Stamina Regen:[/color] 5[color=yellow]-Carry Weight:[/color] 350\r<br />[/size][/*]\r<br />[/list][size=2]\r<br />[b]Bosmer:[/b]\r<br />[/size][list][*][size=2]Changed the racial text to display &#34;Bosmer&#34; as the name and &#34;wood elves&#34; as the variation.\r<br />[/size][/*]\r<br />[*][size=2]Base height for males is now .86, females .83, with weights and mass reduced to .8 and .75.[/size]\r<br />[size=2]------[/size][i][size=1]I have a clear memory of playing Morrowind and selecting Bosmer for my race, and my view dropping down a foot. Maybe it&#39;s been heightened by nostalgia, but it&#39;s what I want to see. Remember what Bosmer said in Morrowind? &#34;We&#39;re not polite, but we don&#39;t have to be, because we&#39;re fast.&#34; Somehow they&#39;ve lost that between then and now.[/size][/i]\r<br />[/*]\r<br />[*][size=2]Stat changes: [color=red]-Base Health:[/color] 60[color=red]-Health Regen:[/color] .9[color=blue]-Magicka:[/color] 65[color=blue]-Magicka Regen:[/color] 3[color=green]-Stamina:[/color] 40[color=green]-Stamina Regen:[/color] 5[color=yellow]-Carry Weight:[/color] 150\r<br />[/size][/*]\r<br />[/list][size=2]\r<br />[b]Breton:[/b]\r<br />[/size][list][*][size=2]Base height is now .95 for males and .925 for females, with weights and mass reduced to .9.[/size]\r<br />[size=2]------[/size][i][size=1]The reasons for this are because Bretons have mer blood, which makes them more delicate than most humans, and personal, because I usually play a Breton and I wanted them smaller and slighter.[/size][/i]\r<br />[/*]\r<br />[*][size=2]1/day racial Dragonskin power has been changed to a passive constant 15% of spell absorption. [Possibly overpowered?][/size][/*]\r<br />[*][size=2]Stat changes: [color=red]-Base Health:[/color] 40[color=red]-Health Regen:[/color] .6[color=blue]-Magicka:[/color] 80[color=blue]-Magicka Regen:[/color] 4[color=green]-Stamina:[/color] 40[color=green]-Stamina Regen:[/color] 3[color=yellow]-Carry Weight:[/color] 250\r<br />[/size][/*]\r<br />[/list][size=2]\r<br />[b]Dunmer: [/b]\r<br />[/size][list][*][size=2]Changed the racial text to display &#34;Dunmer&#34; as the name and &#34;dark elves&#34; as the variation.\r<br />[/size][/*]\r<br />[*][size=2]Changed female height from 1.0 to .97, weights to .9 & .8, and mass to 1.1.\r<br />[/size][/*]\r<br />[*][size=2]Stat changes: [color=red]-Base Health:[/color] 60 [color=red]-Health Regen:[/color] .8 [color=blue]-Magicka:[/color] 60 [color=blue]-Magicka Regen:[/color] 3 [color=green]-Stamina:[/color] 50 [color=green]-Stamina Regen:[/color] 5 [color=yellow]-Carry Weight:[/color] 300[/size][/*]\r<br />[/list][size=2][b]\r<br />Imperial:[/b]\r<br />[/size][list][*][size=2]No change to height/weight/mass - all is 1.0 for both genders. Imperials are boring.\r<br />[/size][/*]\r<br />[*][size=2]Stat changes: [color=red]-Base Health:[/color] 50[color=red]-Health Regen:[/color] .5[color=blue]-Magicka:[/color] 60[color=blue]-Magicka Regen:[/color] 1[color=green]-Stamina:[/color] 40[color=green]-Stamina Regen:[/color] 5[color=yellow]-Carry Weight:[/color] 300\r<br />[/size][/*]\r<br />[/list][size=2]\r<br />[b]Khajiit:[/b]\r<br />[/size][list][*][size=2]Changed height from 1.0 & .95 to .97 & .95, weight from .5 & 1.0 to 1.0 & .95, mass from 1.0 to 1.5.\r<br />[/size][/*]\r<br />[*][size=2]Night Eye is now toggleable and lasts for 1 day instead of 1 minute.\r<br />[/size][/*]\r<br />[*][size=2]Unarmed damage increased slightly, from 12 to 15.\r<br />[/size][/*]\r<br />[*][size=2]Stat changes: [color=red]-Base Health:[/color] 60[color=red]-Health Regen:[/color] .8[color=blue]-Magicka:[/color] 50[color=blue]-Magicka Regen:[/color] 1[color=green]-Stamina:[/color] 60[color=green]-Stamina Regen:[/color] 6[color=yellow]-Carry Weight:[/color] 250[/size][/*]\r<br />[/list][size=2]\r<br />[b]Nord:[/b]\r<br />[/size][list][*][size=2]Changed height from 1.03 to 1.035 & 1.025 (male & female), weight to 1.25 (both).\r<br />[/size][/*]\r<br />[*][size=2]Have gained a racial passive ability that grants 20% extra damage to elves. [untested. Probably OP if they keep their active power?][/size][/*]\r<br />[*][size=2]Stat changes: [color=red]-Base Health:[/color] 70[color=red]-Health Regen:[/color] .8[color=blue]-Magicka:[/color] 30[color=blue]-Magicka Regen:[/color] 1[color=green]-Stamina:[/color] 50[color=green]-Stamina Regen:[/color] 7[color=yellow]-Carry Weight:[/color] 400\r<br />[/size][/*]\r<br />[/list][size=2]\r<br />[b]Orcs: [/b]\r<br />[/size][list][*][size=2]Base mass, both genders, is now 1.5. Height changed from 1.045 to 1.075 & 1.065, weight to 1.5 & 1.25.\r<br />[/size][/*]\r<br />[*][size=2]Increased unarmed damage from 4 (base of all non-beast races) to 7. (Beast races have 10.)\r<br />[/size][/*]\r<br />[*][size=2]Stat changes: [/size][color=red]-Base Health:[/color][size=2] 70 [/size][color=red]-Health Regen:[/color][size=2] .7 [/size][color=blue]-Magicka:[/color][size=2] 40 [/size][color=blue]-Magicka Regen:[/color][size=2] 2 [/size][color=green]-Stamina:[/color][size=2] 60 [/size][color=green]-Stamina Regen:[/color][size=2] 9 [/size][color=yellow]-Carry Weight:[/color][size=2] 450[/size]\r<br />[i]------[/i][size=1][i]I didn&#39;t change their racial names to &#34;Orsimer&#34; because Orcs don&#39;t identify themselves as Mer.[/i]\r<br />[/size][/*]\r<br />[/list][size=2]\r<br />[b]Redguard: [/b]\r<br />[/size][list][*][size=2]Height from 1.005 & 1.0 to 1.02 & 1.015, mass to 1.1.\r<br />[/size][/*]\r<br />[*][size=2]Adrenaline Rush 1/day power has been changed to a passive ability that grants 2x stamina regen during combat. [untested][/size][/*]\r<br />[*][size=2]Stat changes: [color=red]-Base Health:[/color] 70 [color=red]-Health Regen:[/color] .7 [color=blue]-Magicka:[/color] 30 [color=blue]-Magicka Regen:[/color] 1 [color=green]-Stamina:[/color] 50 [color=green]-Stamina Regen:[/color] 8 [color=yellow]-Carry Weight:[/color] 350\r<br />[/size][/*]\r<br />[/list][size=2]\r<br />[b]Werewolf beast form: [/b]\r<br />[/size][list][*][size=2]Changed unarmed damage from 20 to 30 (due to the fact that beast race vampires now have 20).\r<br />[/size][/*]\r<br />[/list][size=2]\r<br />[b]Vampires:[/b]\r<br />[/size][list][*][size=2]Height/weight/mass is exactly the same as the non-vampire race (Altmer, Khajiit, Imperial, etc.)\r<br />[/size][/*]\r<br />[*][size=2]Can now equip crossbows, which were for some reason denied to them. Seems contrived.\r<br />[/size][/*]\r<br />[*][size=2]Doubled the unarmed damage of non-Vampire counterpart to reflect superhuman strength.\r<br />[/size][/*]\r<br />[*][size=2]Night Eye is now toggleable and lasts for 1 day instead of 1 minute.\r<br />[/size][/*]\r<br />[*][size=2]Permanent waterbreathing added to the Vampirism effect.\r<br />[/size][/*]\r<br />[*][size=2]Stat changes, based on normal race&#39;s stats:[/size][color=red]-Base Health:[/color][size=2] +25[/size][color=red]-Health Regen:[/color][size=2] no change[/size][color=blue]-Magicka:[/color][size=2] no change[/size][color=blue]-Magicka Regen:[/color][size=2] +2[/size][color=green]-Stamina:[/color][size=2] -10[/size][color=green]-Stamina Regen:[/color][size=2] cut in half[/size][color=yellow]-Carry Weight:[/color][size=2] +100 [/size]\r<br />[size=2]------[/size][i][size=1]These changes are because I felt there should actually be some sort of benefit and price for being a vampire. Vampires are a little harder to kill, and have super strength and are very in touch with magicka, but they are undead so their body is weak and their stamina regenerates very, very poorly. They are no longer physically inclined creatures. *Note: According to the comments, I maaaaay want to retweak the vampire magicka regen.[/size]\r<br />[/i][size=2]------[/size][i][size=1]There is an issue with this and PCs. See below.[/size][/i][/*]\r<br />[/list][size=2]\r<br />\r<br />\r<br />[b][u][center]The Future[/center]\r<br />[/u][/b]\r<br />===Planned changes===\r<br />[/size][list][*][size=2][s]Add a Waterbreathing ability to all Vampire races. Undead don&#39;t breathe.[/s] Done in v.9\r<br />[/size][/*]\r<br />[*][size=2][s]Turn all Night Eye and other enhanced-senses lesser power into toggle-able abilities (need to find out what all of these powers are.)[/s] Turns out Night Eye and Vampire night eye were the only lesser powers. Done.\r<br />[/size][/*]\r<br />[*][size=2]Remove all 1/day Powers and transform them into passive abilities, with the exception of Orcs&#39; Berserk. Nord, Imperial, Orc, and Bosmer powers will probably remain in some form; they are active things the character is [i]doing[/i] and make sense as skills. Only Orcs will remain at 1/day; they will also be given one or more new powers. Both Altmer abilities need to be changed, as their current abilities are already reflected in the adjusted stats. (This will fix the massively overpowered Altmer Vampire Mage.)\r<br />[/size][/*]\r<br />[*][size=2]Modify human-form werewolf stats to increase stamina and carry weight. (Needs scripting.)[/size][/*]\r<br />[*][size=2]Look at werewolf powers and see what needs changed.[/size][/*]\r<br />[*][size=2]Increase carry weight by 50 across the board for more playability with weaker races.[/size][/*]\r<br />[*][size=2]Add a script to give racial abilities to NPCs. (Scripting. Boooo.)[/size][/*]\r<br />[*][size=2]Any other suggestions..?\r<br />[/size][/*]\r<br />[/list][size=2]\r<br />\r<br />[b][u][center]The Limitations[/center][/u][/b]\r<br />\r<br />===Known Issues===\r<br />[/size][list][*][size=2]Falmer and Hagravens (and possible other enemy races), being marked as NPCs, can trigger perhaps the wrong kind of killmoves; they don&#39;t appear in the animation and they aren&#39;t harmed by it. I&#39;m not even much of a CK-er, and definitely not an animator, so... the best advice I can give is to hope killmoves don&#39;t happen. (This is why there is now a no-creatures version, in case it makes it unplayable for you.) This is part of the reason I didn&#39;t mark Giants as NPCs... The last thing you want to do is trigger a harmless killmove on something that can use you as a baseball.\r<br />[/size][/*]\r<br />[*][size=2]There&#39;s a similar issue with the vampire feeding. Again they don&#39;t appear in the animation, and it&#39;s been reported that there&#39;s a delay before they&#39;re harmed.[/size][/*]\r<br />[*][size=2]The size of the very tall and very short means that some animations don&#39;t play just right, because the animations are set up for Imperial-sized people. Even vanilla Altmer have some problems with holding things above where they are, and vanilla Bosmer sometimes smith things inside the anvil instead of on it. That&#39;s going to be significantly worse now, I imagine. Animation issues frankly don&#39;t bother me, though, especially when the only way to stop them is to have everyone 1.0-sized.\r<br />[/size][/*]\r<br />[*][size=2]No one has mentioned this, but I&#39;ve noticed: Vampire stat changes have no effect whatsoever on the player. The game doesn&#39;t recalculate your stats when you&#39;re infected or cured, so at best it affects NPCs and maybe if you start as a vampire via Live Another Life - but probably not even then. I&#39;d need a script to make it happen.\r<br />[/size][/*]\r<br />[*][size=2]The stat changes don&#39;t affect preexisting characters because the game doesn&#39;t recalculate your stats. Again, would need a script. \r<br />[/size][/*]\r<br />[/list]",
  "categoryId": "34",
  "version": "0.9.1",
  "author": "AnkhAscendant",
  "createdUnix": "1349464379",
  "updatedUnix": "1413943015",
  "containsAdultContent": false,
  "uploadedBy": "AnkhAscendant",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92185",
      "name": "Ankhs Races",
      "version": ".7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "44",
      "fileName": "Ankh Races-25048--7.rar",
      "uploadedUnix": "1349464500",
      "modVersion": ".7",
      "virusScanUrl": "https://www.virustotal.com/file/36b03cef3a6dc63faa029b8964d2b6d4fe1332f12ff0fbc39d3feecc75d2201d/analysis/1407205210/",
      "changelogHtml": " Changed the racial text of most elves to have the \\\"-mer\\\" name as the primary and \\\"elf\\\" as the secondary. (Orcs are the exception.) <br/> \n Adjusted racial heights. Bosmer are tiny, Altmer are very tall, Bretons are shorter than average. <br/> \n Made children killable and pickpocketable, which includes vampire feedable. <br/> \n Added Argonian \\\"Tough Hide\\\" power. <br/> \n Changed Giant and Mammoth sizes to 5.0 and 3.0 respectively. <br/> \n Unchecked \\\"no comabt in water\\\" on all NPC races, but it doesn\\'t seem to be working.  <br/> \n Major Falmer changes: Turned Falmer from \\\"creatures\\\" to \\\"NPCs\\\"; they will now inhabit black soul gems. They are now pickpocketable, able to be spoken to (for all the good it will do), have no combat restrictions, and are 90% blind instead of 80%. <br/> \n Also added an Immortal Child version which leave chidren unable to be killed, still able to be pickpocketed and fed from. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ankh%20Races-25048--7.rar?fid=92185&ttl=1535796356&ri=8192&rs=8192&setec=020313c454584a3382b082465b0fc499"
    },
    {
      "fileId": "92297",
      "name": "Ankhs Races - Immortal Children",
      "version": ".7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "44",
      "fileName": "Ankhs Races - Immortal Children-25048--7.rar",
      "uploadedUnix": "1349514814",
      "modVersion": ".7",
      "virusScanUrl": "https://www.virustotal.com/file/71086c8c5d15f2a4dca3fb99de54dc2ce327dbb6f2605677d5c7bb0d3108eea8/analysis/1407206285/",
      "changelogHtml": " Changed the racial text of most elves to have the \\\"-mer\\\" name as the primary and \\\"elf\\\" as the secondary. (Orcs are the exception.) <br/> \n Adjusted racial heights. Bosmer are tiny, Altmer are very tall, Bretons are shorter than average. <br/> \n Made children killable and pickpocketable, which includes vampire feedable. <br/> \n Added Argonian \\\"Tough Hide\\\" power. <br/> \n Changed Giant and Mammoth sizes to 5.0 and 3.0 respectively. <br/> \n Unchecked \\\"no comabt in water\\\" on all NPC races, but it doesn\\'t seem to be working.  <br/> \n Major Falmer changes: Turned Falmer from \\\"creatures\\\" to \\\"NPCs\\\"; they will now inhabit black soul gems. They are now pickpocketable, able to be spoken to (for all the good it will do), have no combat restrictions, and are 90% blind instead of 80%. <br/> \n Also added an Immortal Child version which leave chidren unable to be killed, still able to be pickpocketed and fed from. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ankhs%20Races%20-%20Immortal%20Children-25048--7.rar?fid=92297&ttl=1535796357&ri=8192&rs=8192&setec=15fc3f37462bdde4132a3b17a8de5f8b"
    },
    {
      "fileId": "93791",
      "name": "Ankhs Races - v _8",
      "version": ".8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "523",
      "fileName": "Ankhs Races - v _8-25048--8.rar",
      "uploadedUnix": "1350205130",
      "modVersion": ".8",
      "virusScanUrl": "https://www.virustotal.com/file/8ac9c9a782799291079f683f328acac20b8fae6b607107e7c4d6c20a19ab5c3f/analysis/1407221224/",
      "changelogHtml": " -Fine-tuned racial height and weight adjustments. Now only Imperials are a boring \"1.0\" across the board.   <br/> \n -Major racial stat overhaul: edited the base health/magicka/stamina, stat regen, and carry weight of all playable races in accordance with a formula based in equal parts on the Morrowind/Oblivion racial stats and intuition. <br/> \n -Similar Vampire race stat overhaul. Vampires now have increased carry weight, increased base health, increased magicka regen, lesser stamina, and slashed stamina regen, based on their non-vampire counterparts.  <br/> \n -Special note: ArgonianRace and ArgonianRaceVampire now regen health in combat.  <br/> \n -Removed Argonian Histskin power. <br/> \n -Increased magicka regen during combat from 33 to 50%. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ankhs%20Races%20-%20v%20_8-25048--8.rar?fid=93791&ttl=1535796357&ri=8192&rs=8192&setec=37e6f92772dbeab990a8bab91dc3d1ef"
    },
    {
      "fileId": "1000031638",
      "name": "Ankhs Races - No Creatures",
      "version": ".8.5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "47",
      "fileName": "No Creatures-25048--8-5.rar",
      "uploadedUnix": "1369640232",
      "modVersion": ".8.5",
      "virusScanUrl": "https://www.virustotal.com/file/f89ea23c6546fa1e10a6ac6407f4f4bab5d22126683155e707c1bd520cb7641e/analysis/1407582970/",
      "changelogHtml": " *Mostly an update for the separate Falmer-only and No-Falmer standalone files. <br/> \n *Edited Hagravens in the same way as Falmer. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Creatures-25048--8-5.rar?fid=1000031638&ttl=1535796358&ri=8192&rs=8192&setec=546d02566a1a13a38b13329bfda82118"
    },
    {
      "fileId": "1000031640",
      "name": "Ankhs Races - Creatures Only",
      "version": ".8.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Creatures Only-25048--8-5.rar",
      "uploadedUnix": "1369640736",
      "modVersion": ".8.5",
      "virusScanUrl": "https://www.virustotal.com/file/9c5582e77611d71797fc6eedc5d33f012b5bf941b8d665c7966d9c46f1cb57a1/analysis/1407582971/",
      "changelogHtml": " *Mostly an update for the separate Falmer-only and No-Falmer standalone files. <br/> \n *Edited Hagravens in the same way as Falmer. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Creatures%20Only-25048--8-5.rar?fid=1000031640&ttl=1535796358&ri=8192&rs=8192&setec=326272cabbbd83f5a68ba260c9fcaca2"
    },
    {
      "fileId": "1000031652",
      "name": "Ankhs Races - v_9",
      "version": ".9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "48",
      "fileName": "Full Version 0point9-25048--9.rar",
      "uploadedUnix": "1369648464",
      "modVersion": ".9",
      "virusScanUrl": "https://www.virustotal.com/file/69a278c8f1a69365cf1e887160464b6b2d4116e9bf8a2c47546d20b21bd562d7/analysis/1407583044/",
      "changelogHtml": " Added Hagraven changes to main mod. <br/> \n Vampires now have toggleable Night Eye and permanent water breathing. <br/> \n Khajiit Night Eyes is now toggleable and their unarmed damage increased to 15. <br/> \n Draugr can be pickpocketed but are not labeled as NPCs; one assumes that being dead has rotted their minds too far for that.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Full%20Version%200point9-25048--9.rar?fid=1000031652&ttl=1535796359&ri=8192&rs=8192&setec=51b55395abd2679449f8118a01c56e5f"
    },
    {
      "fileId": "1000131762",
      "name": "Ankhs Races 0.9.1",
      "version": "0.9.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "132",
      "fileName": "Ankhs Races 0.9.1-25048-0-9-1.zip",
      "uploadedUnix": "1413804082",
      "modVersion": "0.9.1",
      "virusScanUrl": "https://www.virustotal.com/file/c9defde5999d5dfe3dce75e377498c06daac4367a5e0ad5b4ff3f945fe15e63e/analysis/1413804182/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ankhs%20Races%200.9.1-25048-0-9-1.zip?fid=1000131762&ttl=1535796359&ri=8192&rs=8192&setec=4d9a1529c58d4bfb1ccf2f06b37e7b8a"
    },
    {
      "fileId": "1000131981",
      "name": "Ankhs Races - Creatures Only - 1.0",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "9",
      "fileName": "Ankhs Races - Creatures Only - 1.0-25048-.zip",
      "uploadedUnix": "1413943015",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2e77572968ba6732183daccadd12f75252e0863ce461c480ac31c6611c588a67/analysis/1413943082/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ankhs%20Races%20-%20Creatures%20Only%20-%201.0-25048-.zip?fid=1000131981&ttl=1535796359&ri=8192&rs=8192&setec=89a704271cbb84311f739e4cc9c99833"
    }
  ]
}