{
  "modId": 25051.0,
  "modName": "Dominions More Dawnguard Marriage Candidates",
  "summary": "This mod adds 19 marriage candidates to the game, in similar vein to Dominions More Potential Marriage Candidates.  Requires Dawnguard, and the NPC have Dawnguard roles or are vampires.  Only 4 are not directly related to Dawnguard content.  Includes a couple of Argonian and High Elf not in the vanilla game.",
  "descriptionHtml": "Similar deal as with my Dominions More Potential Marriage Candidates, this mod attempts to further increase the diversity of choices, trying to be as lore-friendly and realistic as possible. 19 new NPC have appeared in various towns, cities, Fort Dawnguard, and Castle Volkihar, who are all marriage candidates.. The difference is that this mod is based on the Dawnguard content. This means that you have Vampire-related candidates and Dawnguard members who can be marriage candidates. All were added in, no alterations to vanilla NPCs.\n<br />\n<br />Note: Requires Dawnguard\n<br />\n<br />None of them requires favors to marry.\n<br />\n<br />Here is a list of locations with the new NPCs:\n<br />\n<br />Castle Volkihar:\n<br />Adaira Blooiar - Dark elf male vampire who comes to the castle after the Dawnguard Main Events conclude, due to his opposition to certain ideals.\n<br />Badbog Vimjug - Orc female vampire who comes to the castle after the Dawnguard Main Events conclude, due to her opposition to certain ideals.\n<br />Frand Blit - Breton male vampire who comes to the castle after the Dawnguard Main Events conclude, due to his opposition to certain ideals.\n<br />Hjotrast Sjukrin - Nord female vampire who comes to the castle after the Dawnguard Main Events conclude, due to her opposition to certain ideals.\n<br />Mania Theerst - Redguard female vampire who comes to the castle after the Dawnguard Main Events conclude, due to her opposition to certain ideals.\n<br />Samiail Nihmi - Wood elf female vampire who comes to the castle after the Dawnguard Main Events conclude, due to her opposition to certain ideals.\n<br />\n<br />Dawnguard HQ:\n<br />Murber Holvius - Imperial male who is recruited following the Dawnguard Main Events concluding.\n<br />Snadmu Lihmu - Nord male who is recruited following the Dawnguard Main Events concluding.\n<br />Sosile Chill - Breton female who is recruited following the Dawnguard Main Events concluding.\n<br />Thalestr Viglstr - Nord female who is recruited following the Dawnguard Main Events concluding.\n<br />\n<br />Dragons Bridge:\n<br />Derene Vamprene - Breton female who believes that vampires have a place amongst everything else.\n<br />\n<br />Falkreath:\n<br />Thonronr Vslanr - Nord male who has become bitter toward vampires since his family was killed by them back in Cyrodil. Since then he hunts every vampire he can.\n<br />\n<br />Markarth:\n<br />Sifkning Drakning - Nord male vampire who is a business man from another province working closely with the treasury.\n<br />\n<br />Riften:\n<br />Termanin Keranin - High elf female spellsword who is a firm believer that vampires are people too.\n<br />\n<br />Solitude:\n<br />Chanal Stakal - Argonian female who was a former member of Isran's vampire dealings before Dawnguard came about, and refused to go back. Instead she hunts vampires on her own.\n<br />Hussone Feesson - Redguard female vampire who is a member of the Bard's College and practices being a bard at the Winking Skeever.\n<br />\n<br />Whiterun:\n<br />Fental Bluntal - Imperial female vampire that works as a keep servant.\n<br />\n<br />Windhelm:\n<br />Huleed Mu-eed - Argonian male noble who was exiled from his previous province, and forced to live in the Assemblage due to hatred fostered in Windhelm. This allows him to give sympathy to how vampires are treated.\n<br />\n<br />Winterhold:\n<br />Rimion Majion - High elf male who is a member of the College of Winterhold. He sees great potential in vampires doing good deeds with their powers, and wants to push for recruitment to vampires.\n<br />\n<br />What is added:\n<br />-19 new marriage candidates\n<br />-Attempts to make each new addition realistic to the location they are at (barring the wedding ceremony or other visual challenges for the vampires).\n<br />\n<br />Known quirks:\n<br />High elf males sound like Dark Elves, this being due to the High Elf marriage voice not being contained in the basic game.\n<br />\n<br />Note:\n<br />1.2 makes all NPCs essential, while 1.1 has all the NPCs non-essential.  I recommend 1.1 for those wanting realism, while I recommend 1.2 for those wanting to not worry about the NPCs while adding immersion.\n<br />\n<br />Revision History:\n<br />v1.2:\n<br />-Made all NPCs essential\n<br />v1.1:\n<br />-Turned some into followers: Rimion, Fental, Sifking, Adaira, Badbog, Mania, Murber, Snadmu, Sosile, Thalestr, Thonronr, Derene\n<br />\n<br />Credits:\n<br />-Tamreil Rebuilt - NPC name generator\n<br />\n<br />\n<br />Follow me on Facebook for updates: [url=https://www.facebook.com/ArronDominionProductions/]Arron Dominion Productions[/url]",
  "categoryId": "33",
  "version": "1.2",
  "author": "Arron Dominion",
  "createdUnix": "1349469097",
  "updatedUnix": "1414919349",
  "containsAdultContent": false,
  "uploadedBy": "Arron Dominion",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92199",
      "name": "Dominions More Dawnguard Marriage Candidates",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2477",
      "fileName": "Dominions More Dawnguard Marriage Candidates-25051-1.zip",
      "uploadedUnix": "1349469176",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/3f1b144059b58ec9eb653cbee55dcec02f34640503acf2ecfc589cde437b1ae5/analysis/1407205407/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dominions%20More%20Dawnguard%20Marriage%20Candidates-25051-1.zip?fid=92199&ttl=1535796363&ri=8192&rs=8192&setec=55648486afb62e3f2a3d04f7940f2d77"
    },
    {
      "fileId": "104180",
      "name": "Dominions More Dawnguard Marriage Candidates v1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2478",
      "fileName": "Dominions More Dawnguard Marriage Candidates v1_1-25051-1-1.zip",
      "uploadedUnix": "1355084976",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2aa3d8eacb9f1e55c3446e5fd2c953a3654a591a968457931c55e2362ff2841f/analysis/1407297534/",
      "changelogHtml": " Turned some into followers: Rimion, Fental, Sifking, Adaira, Badbog, Mania, Murber, Snadmu, Sosile, Thalestr, Thonronr, Derene <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dominions%20More%20Dawnguard%20Marriage%20Candidates%20v1_1-25051-1-1.zip?fid=104180&ttl=1535796364&ri=8192&rs=8192&setec=9fb23375820090ea7850a57d31936b14"
    },
    {
      "fileId": "1000133608",
      "name": "Dominions More Dawnguard Marriage Candidates v1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2478",
      "fileName": "Dominions More Dawnguard Marriage Candidates v1_2-25051-1-2.zip",
      "uploadedUnix": "1414919349",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/afff88bc9f9885884b83d4f41acb1cdfdf36b0ef2c9eb3207ebf6d4db3689775/analysis/1414919464/",
      "changelogHtml": " Made all NPCs essential. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dominions%20More%20Dawnguard%20Marriage%20Candidates%20v1_2-25051-1-2.zip?fid=1000133608&ttl=1535796364&ri=8192&rs=8192&setec=1d11f23f462f3791d70f0bb9635c9d5c"
    }
  ]
}