{
  "modId": 25055.0,
  "modName": "Abel Skeever",
  "summary": "Adds Abel the skeever, a skeever follower, behind the Bannered Mare. With an item to teleport him to you, in case he gets lost.",
  "descriptionHtml": "Abel Skeever\r\n\r\nDESCRIPTION:\r\nThis mod adds a skeever follower named Abel to the area behind the Bannered Mare in Whiterun. He will follow you if you tell him to, and can wait and be dismissed like normal followers can. If you take the stale aebleskive next to him, you can click on it at any time from your inventory and he will teleport to you.\r\n\r\nAlso adds the ability to make delicious aebleskiver. Because why not. You can make them at a cooking pot with the following recipe:\r\nONE CHICKEN EGG\r\nONE WHEAT\r\nONE RED APPLE\r\nONE SALT PILE\r\nYou also need to have a cast iron pot with you (the kind with a handle) to simulate an aebleskive pan.\r\n\r\nINSTALLATION:\r\n\r\nJust drop everything into the data folder.\r\n\r\nKNOWN ISSUES:\r\n\r\nYou have to tell Abel to wait before telling him to follow you. This is only an issue the first time you get him as a follower, and any times you get him after sending him \\\"home\\\" (Back to behind the Bannered Mare).\r\n\r\nThere is sometimes a problem with initiating dialogue with Abel. Be sure you are not in combat, and do not already have an animal following you. If neither of these are currently happening, open up the console (Usually the tilde~ key, to the left of the 1 key) and type in \\\"set PlayerAnimalCount to 0\\\", without the quotes, of course. This should fix it.\r\n\r\nINCOMPATIBILITIES:\r\n\r\nThere will most likely be problems with any mod that changes the landscape around the Bannered Mare in Whiterun, specifically cell 6, -2 in the Whiterun worldspace. \r\n\r\nCHANGELOG:\r\n\r\nv1.0- Initial release. Adds Abel the skeever, a skeever follower, behind the Bannered Mare.\r\n\r\n\r\nADDITIONAL NOTES:\r\n\r\nBecause why not.\r\n\r\nIf anybody would like to create a proper aebleskive mesh/texture, or a mesh for an aebleskive pan, I would be happy to put them in this mod. Or, you could release it on your own, as long as you give credit for any work from this.\r\n\r\nIf you want to use the contents of this mod for any of your own projects, go right ahead. Just make sure to credit me if you release it.\r\n",
  "categoryId": "65",
  "version": "1.0",
  "author": "MasterZipZero",
  "createdUnix": "1349472352",
  "updatedUnix": "1349472477",
  "containsAdultContent": false,
  "uploadedBy": "MasterZipZero",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92211",
      "name": "Abel the Skeever v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "201",
      "fileName": "Abel the Skeever v1-25055-1-0.zip",
      "uploadedUnix": "1349472477",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/232b0b9888ba8d00e928b3cf8c2f9400d2096e13171d5c476a234e12f717b2bf/analysis/1407205445/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Abel%20the%20Skeever%20v1-25055-1-0.zip?fid=92211&ttl=1535796369&ri=8192&rs=8192&setec=9ef32ab0718030c6410ef8f618c2743e"
    }
  ]
}