{
  "modId": 25060.0,
  "modName": "Cyndariel",
  "summary": "In the lush world of Ta\\'ana, rests a country in squalor. Northbound from a land shrouded by magic, Cyndariel is a place of outcasts, misfits. This land lies on the western coast of Kamaria, the largest continent of Ta\\'ana. It is not an extremely large area, but within Cyndariel rests a beauty, this beautiful land of autumn, tundra, and forest is ",
  "descriptionHtml": "This is a mod originally intended for me to just practice editing world landscape. Now, I have plans to create a village and to continue expanding this world with dungeons and fully voiced characters. So far, I only have a small portion completed, but I think it looks beautiful with its completely handcrafted terrain. This is a WIP. Hope you enjoy!\r\n\r\nNOW ACCESSIBLE FROM SKYRIM (on coast by solitude sawmill) or to enter autumn grove for now, use the tilde key and then type in: cow tawlandscape 0,0\r\n\r\n\r\nChanged title to Cyndariel and added extra pictures.\r\n\r\nAnyone that would like to help (modding, voice over, etc...) please message me. I NEED SOMEONE WHO ENJOYS DOING INTERIORS.\r\n\r\n\r\nDOES NOT REQUIRE DAWNGUARD!\r\n\r\nUpdate Log:\r\n1.0 initial release, small pathway area completed\r\n1.1 preview picture added, town skeleton added, and terraces added\r\n1.2 added first npc and his home\r\n1.3 completed road and added blueprint for the rest of the continent\r\n1.4 added a port city, two evil houses, and terrain enhancements\r\n1.5 huge castle made to south with beautiful garden and water added to the grove\r\n1.6 added flora to garden and fixed some minor bugs\r\n1.7 connected castle to autumn grove\r\n1.8 access from skyrim and wilderness encounters\r\n1.9 added creatures and new pictures and map markers\r\n2.0 plans to create an entire country and bug fixes",
  "categoryId": "30",
  "version": "2.0",
  "author": "Christophersondude",
  "createdUnix": "1349480584",
  "updatedUnix": "1349480584",
  "containsAdultContent": false,
  "uploadedBy": "TheAnonymousWisdom",
  "primaryFile": null,
  "files": []
}