{
  "modId": 25066.0,
  "modName": "LifeSong - The Grove Matron Staff",
  "summary": "Hidden at the center of the Roadside Ruins stands a glowing stone... Touch it, and you will be transported to a secret, ancient grove patrolled by Nature\\'s own guardians, the Spriggans. If your will to survive is strong enough, there you will discover a staff that controls the power of nature itself; LifeSong.",
  "descriptionHtml": "[center][IMG]http://i125.photobucket.com/albums/p76/lesfleursmal/LifeSongBanner.png [/IMG]\r\n\r\n[color=green][b]LifeSong – The Grove Matron\\'s Staff[/b]\r\nby Little Baron[/center][/color]\r\n\r\nHidden at the center of the Roadside Ruins stands a glowing stone... Touch it, and you will be transported to a secret, ancient grove patrolled by Nature\\'s own guardians, the Spriggans. If your will to survive is strong enough, there you will discover a staff that controls the power of nature itself; LifeSong.\r\n\r\nLifeSong\\'s primary power is the resurrection of the innocent. Innocent dead citizens killed by vampires or dragon attacks (or you!) and gentle creatures killed by predators will return to life after being touched by the magic of LifeSong.\r\n\r\nLifeSong\\'s magic does not end there, however. \r\n\r\nSimply wielding LifeSong makes you one with nature, and (most) natural creatures, including the Spriggans, will view you as an ally. In different, intuitive situations, LifeSong\\'s magic will heal allies if they need it, will boost the confidence of animal allies, will attack your enemies with biting insects, and even call natural creatures to aid you in a fight while shielding you from sight briefly. The undead are repelled and injured by its touch, albeit only briefly. \r\n\r\nSprayed on natural ground, LifeSong\\'s magic bursts forth with an abundance of magical vegetation, which acts as a lesser conduit of the staff\\'s magic... those passing through it are affected in similar but less powerful ways.\r\n\r\n[center][youtube]f930m23Bgbk[/youtube]\r\n[youtube]Zav607s5nl4[/youtube]\r\n(Many thanks to svaalbard / insane0hflex for featuring LifeSong in his Spotlight!)\r\n--------------------[/center]\r\n\r\nCaveats:\r\n\r\nLifeSong cannot, unfortunately, save a creature or citizen who has been raised as a zombie. Once the thrall has been reduced to dust, they are gone for good.\r\n\r\nI have no idea exactly what effect resurrecting an NPC who was part of a quest will have on the game. I suspect that any quests that they were involved with will behave as if they are dead, or their part in it might reset, but I didn\\'t test these theories. Obviously, if an NPC dies, they must not have been \\'indispensable\\'.\r\n\r\nLifeSong uses Skyrim\\'s faction relation system to determine what effect it will have on a target. NPC\\'s who have a very low opinion of you may not attack you on sight, but LifeSong will still perceive them as an enemy. Most of the time, however, it effects a target the way you would expect. This is not a bug, and there\\'s really no way to change it.\r\n\r\nNatural ground is determined by the game\\'s vanilla material impact system. If LifeSong does not generate vegetation on a surface it is because the game decided it was made of some material that wasn\\'t dirt, grass, gravel, broken stone, boulder, snow, etc.\r\n\r\nSome creatures are not in the Spriggan faction and therefore will still attack you even if you have LifeSong equipped. Also, Equipping LifeSong in the middle of a battle with a natural creature will not cause it to stop attacking you.\r\n\r\nAll of LifeSong\\'s powers are tied to the wielders magical ability. Restoration, Destruction and Illusion skills will effect the strength of this staff\\'s powers, just like magical skills effect any normal staff.\r\n[center]--------------------[/center]\r\n\r\nI found playing with LifeSong equipped was fun, and it was interesting to see how creatures that normally attack or flee from you react to you while it\\'s equipped. I did not, however, find it to be overpowered... it has very limited utility as a [i]weapon[/i]. I died plenty of times while testing it!\r\n\r\n[center]--------------------[/center]\r\n\r\nCREDITS:\r\n\r\nBethesda resources were used, of course. NifSkope, Blender, Paint.Net, TesVSnip and Goldwave were all used for modifications and clean-up.\r\n\r\nPERMISSIONS:\r\nI am currently unable to work on or support the MODS I made for SKYRIM. Current SKYRIM modders may use the resources they find in this mod in their own mods without permission. Please credit me as is appropriate.",
  "categoryId": "75",
  "version": "100512",
  "author": "Little Baron",
  "createdUnix": "1349483456",
  "updatedUnix": "1349483621",
  "containsAdultContent": false,
  "uploadedBy": "LittleBaron",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92250",
      "name": "LifeSong - The Grove Matron Staff",
      "version": "100512",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1031",
      "fileName": "LifeSong - The Grove Matron Staff-25066-100512.zip",
      "uploadedUnix": "1349483621",
      "modVersion": "100512",
      "virusScanUrl": "https://www.virustotal.com/file/3036e9bbd7b3e58cd42d4de98bf41b0b12848009fe5f1c4c9b984dc31ac25f6f/analysis/1407205804/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LifeSong%20-%20The%20Grove%20Matron%20Staff-25066-100512.zip?fid=92250&ttl=1535796388&ri=8192&rs=8192&setec=4263f421a0b02f3ac016492a7d54faa2"
    }
  ]
}