{
  "modId": 25068.0,
  "modName": "Placeable Statics - Move Anything",
  "summary": "Ever felt like you should be able to redecorate your house, any way you want? Shouldn&#39;t you be able to move chairs or beds, and then be able to use them where you put them? Grab, move, store, buy, place, rotate and nudge nearly any furniture and static&#33; Perfect to organize your Hearthfire home or Dawnguard Castles&#33;",
  "descriptionHtml": "[center][img] http://static1.nexusmods.com/110/mods/110/images/25068-2-1349485427.png[/img] [/center]\r<br />Ever felt like you should be able to redecorate your house, any way you want? Shouldn&#39;t you be able to move chairs or beds, and then be able to use them where you put them? Grab, move, store, buy, place, rotate and nudge nearly any furniture and static&#33; Perfect to organize your Hearthfire home or Dawnguard Castles&#33;\r<br />This mod no longer requires SKSE&#33; That means that nothing is required&#33;\r<br />\r<br />Definitions:\r<br />Furniture is something you can sit in or use (like a smith&#39;s forge).\r<br />A Container is something you can store items in.\r<br />A Static is something that doesn&#39;t move or show options when you hover the cursor over it.\r<br />Wall Clutter are statics that hang on walls.\r<br />&#34;Moveable Objects&#34; are objects that have a 3d model / can be stored in the inventory.\r<br />\r<br />If you like this mod, be sure to check out my other mods by clicking [url=http://skyrim.nexusmods.com/modules/members/index.php?id=1398716]here[/url] and clicking on the files tab. :D\r<br />\r<br />[img]http://static1.nexusmods.com/110/mods/110/images/15827-4-1336698265.png[/img]\r<br />[youtube]3BJ-GgsicIw[/youtube][youtube]Z1OlsSfN98E[/youtube]\r<br />[youtube]s_9Zpe2DPV4[/youtube][youtube]44PKUvMuQE4[/youtube]\r<br />(Note, furniture can be purchased&#33;)\r<br />\r<br />Grab and place furniture using two simple, intuitive spells\r<br />Grab and move furniture and statics as if they were clutter\r<br />Fix them in place and the act just like they did before you moved them\r<br />Rotate and manually nudge objects to get the exact fit\r<br />Move objects I haven&#39;t made a 3d model for yet: by storing it in the spell buffer\r<br />All moveable furniture with a model can be sold / purchased at general stores/blacksmiths/some inns (they&#39;re in leveled lists, so you won&#39;t see every furniture every time.)\r<br />Use the hammer to freeze statics in place, even after you uninstall the mod&#33; (See uninstalling)\r<br />\r<br />Hearthfire support&#33;\r<br />Craft moveable furniture (Requires Hearthfire)\r<br />[center][url=http://www.skyrimgems.com][img]http://static2.nexusmods.com/15/mods/110/images/15827-1-1369069574.png[/img][/url]\r<br />Check under category 410.[/center]\r<br />\r<br />[img] http://static1.nexusmods.com/110/mods/110/images/15827-1-1349493372.png[/img]\r<br />Every Breezehome item (aka, common chairs, no matter where you find them, are movable, because that item can be found in Breezehome) is movable, purchasable, and has a 3d model.\r<br />Every Proudspire item is movable, purchasable, and has a 3d model.\r<br />All banners are movable, purchasable, and have a 3d model. (I didn&#39;t bother with banners that are rapidly blowing in the wind).\r<br />All banners are craftable with the Hearthfire patch.\r<br />The vanilla versions of most Hearthfire items are movable etc.\r<br />Most Hearthfire items are movable etc. (Requires Hearthfire, duh)\r<br />\r<br />Activators are moveable etc.\r<br />Display Cases are movable etc.\r<br />Almost any furniture can be placed in the spellbuffer.\r<br />Almost any container can be placed in the spellbuffer.\r<br />Every piece of crafting equipment is movable and purchasable. Because crafting equipment has extraordinarily complex 3d models, you place them like you place wall clutter and can rotate and nudge them to get them perfect.\r<br />Rugs with a rolled model can now be rolled and unrolled.\r<br />Candle lights that can be moved can also be lit or snuffed.\r<br />\r<br />All movable Wall Clutter, Containers, and Furniture are now craftable with the Hearthfire patch.\r<br />\r<br />Exempt items:\r<br />Weapon displays like weapon plaques, book shelves (the scripted kind; the static object works fine) and weapon racks – these will require complex scripting. Hopefully I&#39;ll be able to add them in the future.\r<br />\r<br />Mannequins – same as weapon displays \r<br />\r<br />Ceiling clutter /hanging objects– they weren&#39;t meant to be placed and have sides that don&#39;t exist (from some angles you can see through them) – I&#39;ll see what I can do about them in the future.\r<br />\r<br />Some alternates to crafting furnitures (like certain cooking pots) as they act like hanging objects.\r<br />\r<br />Trees – I haven&#39;t decided what to do with them yet.\r<br />\r<br />Doors – I have my reasons.\r<br />\r<br />[img]http://z13.invisionfree.com/IceburgsSkyrim/index.php?act=Attach&type=post&id=22002745[/img]\r<br />Drop the esp and bsa into the &#39;Data&#39; folder in your Skyrim folder.  Don&#39;t forget to check the esp &#34;AK- Placable Statics.esp&#34;.\r<br />If you&#39;re using the Hearthfire patch, drop the AK- Placeable Statics esp and bsa into your data folder as well, and check on that esp as well.\r<br />\r<br />[img]http://static2.nexusmods.com/15/mods/110/images/15827-2-1336699279.png[/img]\r<br />What will happen if you uninstall this mod?\r<br />Furniture / statics in your inventory or in &#34;move mode&#34; will disappear.\r<br />Furniture / containers that you&#39;ve placed in your house will remain.\r<br />Statics / wall clutter that you&#39;ve rotated or nudged (but never picked up) will remain.\r<br />Statics / wall clutter that you&#39;ve placed will disappear.\r<br />\r<br />To stop a placed static/ wall clutter from disappearing after you uninstall, equip the Furniture Hammer and cast the select furniture spell on the static. It will ask if you&#39;re sure you want to uninstall that object.\r<br />Uninstalling an object fixes it in place forever. The only way to delete it is to use the console, click on it, and type &#34;delete&#34;. Then reload the cell. So only uninstall objects if you&#39;re going to uninstall the mod&#33;\r<br />\r<br />If you&#39;ve lost your furniture hammer, teleport to my test cell by typing &#34;coc akstaticstest&#34; into the console. There you should find another hammer.\r<br />\r<br />[img] http://static1.nexusmods.com/110/mods/110/images/15827-1-1350256578.png[/img]\r<br />Q: I can&#39;t pick up furniture&#33;\r<br />A:\r<br />1) Do you have the esp(s) checked? Make sure they&#39;re on.\r<br />2) Are you holding the Furniture Hammer, un-equip it. (It&#39;s only used for uninstalling).\r<br />3) Are you casting the spell? It&#39;s a power so use it like you use a power.\r<br />\r<br />Q: Will my placed chests respawn?\r<br />A: According to [url=http://www.creationkit.com/Cell_Reset]this[/url], the only way you&#39;ll have a container reset is if you have a respawning container placed in a respawning cell, which means you should be safe if you&#39;re using these containers in non-respawning cells, like houses.\r<br />\r<br />Q: Does this mod require Hearthfire?\r<br />A: The main file does not, but the Optional Hearthfire patch does, which means if you want to craft furniture you&#39;ll need Hearthfire. If you don&#39;t want to craft furniture you&#39;ll be fine with the main file.\r<br />\r<br />Q: How do I craft movable furniture?\r<br />A: Find a Carpentry workbench in one of your Hearthfire homes and build a &#34;Workbench (Carpentry)&#34;. Setup the Carpentry bench and use it to build movable furniture.\r<br />\r<br />Q: What happens if I uninstall?\r<br />A: See uninstall section.\r<br />\r<br />Q: How does this work with Navmeshes?\r<br />A: According to one user (Deylendor): &#34; My followers HAD navmesh related problems when I repositioned/added stuff in grand scale\r<br />But leaving the cell and returning sorts the problem out.&#34;\r<br />\r<br />Q: Will this cause save game bloat?\r<br />A: Save game bloat: Your file will get bigger for each furniture that you place, obviously, because the game is remembering that. But, when you pick up or remove the chair, the game deletes that reference and your save no longer remembers it, so you shouldn&#39;t have any savegame &#34;bloat&#34;. The save game should only get bigger as it needs to. I&#39;ve been running it as I&#39;ve been playing and haven&#39;t suffered any performance loss.\r<br />\r<br />Q: Will this make my save game&#39;s huge?\r<br />A: My game saves are currently between 17 and 18 mb. Considering the esp edits thousands and thousends of forms and it&#39;s under 2mb, I&#39;d imagine / estimate that you should be able to build until your heart is content and not notice any save game performance issues. Also, remembering where things are is the save game&#39;s job, so it&#39;s good that the save game does it instead of the esp, it&#39;s made for that. :)\r<br />\r<br />Q: Is this compatable with X mod?\r<br />A: It depends on what you mean &#34;Compatable&#34;. Nearly no mod should cause the game to CTD with this mod, but let&#39;s say that by compatible you mean: &#34;Will I able to move X mod&#39;s furniture?&#34;\r<br />\r<br />Custom homes will be compatible with this mod, so long as the objects are vanilla. Just load this esp after their esp and you should be able to move their furniture and containers. It will be a little more complex to be able to move statics, but I&#39;ll come out with a tutorial so custom house mods can make &#39;compatibility patches&#39; so you can move statics as well. It will be pretty simple. :D\r<br />Incompatible mods are listed in the compatibility section.\r<br />\r<br />\r<br />[img]http://static2.nexusmods.com/15/mods/110/images/15827-1-1336699169.png[/img]\r<br />After creating my  [url=http://skyrim.nexusmods.com/mods/24439/]Buyable Paintings and Pictures[/url] mod, I received many requests to expand the mod to move other wall clutter. Over a period of 2-3 weeks I worked to adapt my system to work with nearly any furniture, container, and static. During this time, I played bits of [url=http://skyrim.nexusmods.com/mods/22330]Tundra Defense[/url] and [url=http://skyrim.nexusmods.com/mods/22791]Home Construction and Decoration[/url]. Both times I considered giving up my expansion mod. But each time I felt I was doing something unique- something not before done. At one point I discovered [url=http://www.darkcreations.org/forums/files/file/219-solitude-furniture]Solitude Furniture[/url] and nearly gave up yet again, thinking someone else had beat me to what I was trying to do. However, none of these mods let you move furniture that&#39;s ALREADY THERE. Every mod I&#39;ve found adds new furniture that uses menus to decide what to do. It doesn&#39;t feel like real furniture when a menu is asking you if you want to sit or move the chair. On the other hand, my mod lets you grab vanilla furniture and move it, and then use it like you did before. \r<br />\r<br />[img]http://z13.invisionfree.com/IceburgsSkyrim/index.php?act=Attach&type=post&id=22002743[/img]\r<br />You&#39;ll find furniture for sale in most general trader&#39;s stores, blacksmith shops, and some inns.\r<br />While this mod is fully functional, it&#39;s far from complete&#33; (See progress section) Please endorse and comment if you&#39;d like to see work continued on this mod&#33;\r<br />\r<br />Next up:\r<br />\r<br />Finishing making crafting recipes for all movable furniture.\r<br />\r<br />On Deck:\r<br />More Lightable objects (torches / fireplaces)\r<br />And then back to player homes, maybe Riften or Windhelm…\r<br />\r<br />My goals:\r<br />Nearly every static in the game movable\r<br />Every item that is found in any of the vanilla houses movable\r<br />Balance weights and prices \r<br />Every item that is found in any of the Hearthfire houses movable (will require Hearthfire)\r<br />Many vampire items movable (will require Dawnguard)\r<br />Movable items craftable at carpentry workbench (will require Hearthfire)\r<br />There will be 3 esps: A base esp, an esp for Hearthfire required features, and an esp for Dawnguard required features.\r<br />\r<br />[img] http://static1.nexusmods.com/110/mods/110/images/15827-2-1349493373.png [/img]\r<br />Each item needs a script in order to be grabbed, and I also have to make 3d models for objects you can move around. Obviously I&#39;m not going to edit every single static in the game. For instance, I didn&#39;t make snow covered chests grab-able. If there are particular items that you want to be able to grab, request them in the comments section and I&#39;ll see what  I can do. :) \r<br />I&#39;d appreciate thoughts and comments on how to balance weight and value of furniture – to make it semi-releastic.\r<br /> \r<br />[img]http://z13.invisionfree.com/IceburgsSkyrim/index.php?act=Attach&type=post&id=22002740[/img]\r<br />Many baskets that hang on walls cannot be grabbed by the spell. This is because house walls don&#39;t have the best collision – the collision protrudes the walls, blocking the baskets. (You&#39;ll see what I mean, but you may not even notice.) If you want to move the basket, use the console command &#34;tcl&#34; to fly through the wall and grab it from the abyss.\r<br />\r<br />If you experience a bug, let me know by posting in [url=http://forums.nexusmods.com/index.php?showtopic=810982]Bug Reports, Troubleshooting, and Mod Improvement[/url]. You can also get to it by clicking the discussion&#39;s tab above.\r<br /> If you find an object that is missing a nif file, or isn&#39;t movable and should be, please tell me.\r<br />Thanks&#33;\r<br />\r<br />[img]http://static2.nexusmods.com/15/mods/110/images/15827-2-1336698265.png[/img]\r<br />This mod should be compatable with Dawnguard and Hearthfire.\r<br />If you use mesh replacers there may be a slight discrepancy between the furniture you hold and the fixed in place furniture, as I used only vanilla models (as to not distribute someone else&#39;s work). All the movable models should be fine with any texture replacers you may use.\r<br />\r<br />As Carlzilla has pointed out, since this mod attaches a script to each piece of furniture that you move, it makes this mod incompatible with other mods that edit that base object. This should be rare as it&#39;s bad form to edit a base object unless it&#39;s absolutely necessary (as it is with this mod). However, if you load this mod early in the load order, then conflicting mods will override the conflicting object and you simply won&#39;t be able to grab it. It shouldn&#39;t be a serious conflict.\r<br />\r<br />Incompatible Mods:\r<br />Uncapped Perks – Optional Magic Add-on (The main file works fine).\r<br />\r<br />\r<br />[img] http://static1.nexusmods.com/110/mods/110/images/15827-1-1349804517.png[/img]\r<br />[url=http://skyrim.nexusmods.com/mods/24439]Buyable Paintings and Pictures – Place Anywhere[/url] is a great mod (made by me) that let&#39;s you place paintings anywhere. I&#39;d recommend using it to spice up your home with a little art.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/29424]Painting  in Skyrim[/url] hugely expands Buyable Paintings by making over 100 paintings craftable (paintable at an easel). Each painting requires a unique recipe and gives a unique buff when hung and studied.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/3562] More Interactive Items - Grab Moveable Statics[/url] is a great mod for home decoration, as it lets you grab and move those clutter objects you couldn&#39;t move before.\r<br />\r<br />[url= http://skyrim.nexusmods.com/mods/22791]Home Construction and Decoration[/url] for two reasons: First, it allows you to make a custom home anywhere, and second, it lets you do new house related things like farming and animal tending. \r<br />\r<br />[url= http://skyrim.nexusmods.com/mods/13586]Decorator Assistant[/url] for help with clutter items. Placeable statics does not interfere with how this mod affects clutter. You can even use Decorator assistant to aid in moving furniture that is in move mode&#33; However, the two mods are a little finicky when both are used on the same object at the same time. After adjusting with the assistant, activating the object may make the game zoom in on the object. Just exit the menu like you would stop reading a book. If decorator assistant refuses to move/acknowledge the furniture, just pick it up and put it back down. \r<br />\r<br />[url= http://skyrim.nexusmods.com/mods/25433]Placeable Statics – Chinese Translation[/url] if you speak Chinese&#33;\r<br />\r<br />[url= http://skyrim.nexusmods.com/mods/30429] Placeable Statics - Move Anything_Spanish translation[/url] is a Spanish translation that includes debug text and works with the Hearthfire add on&#33;\r<br />\r<br />[img]http://z13.invisionfree.com/IceburgsSkyrim/index.php?act=Attach&type=post&id=22002748[/img]\r<br />I am currently not posting any mods on Steam Workshop. If you see one of my mods on Steam Workshop, please report the file to me. Thanks&#33; :D\r<br />\r<br />[img]http://static2.nexusmods.com/15/mods/110/images/15827-4-1336699170.png[/img]\r<br />Thanks to [url= http://www.creationkit.com/Category:Papyrus]The Creation Kit[/url] and the [url= http://www.uesp.net/wiki/Skyrim:Console]Unofficial Elder Scrolls Pages[/url] wikis for providing all the info I needed on everything from script functions to lore&#33; They&#39;re invaluable sites&#33;\r<br />\r<br />Thanks to Carlzilla for reminding me that Removeallitems() can remove items to a chest, which meant I could get rid of the SKSE requirement&#33; \r<br />\r<br />Thanks to Pettingson for providing troubleshooting help to many members. It&#39;s saved me time and effort and is awfully nice of him.\r<br />\r<br />Thanks to everyone for reporting bugs in a positive and encouraging way. I&#39;d especially like to thank these repeat reporters who have really teamed with me to improve this mod&#39;s quality:\r<br />Pettingson, SamusKnight2K, Bastardofus, NotteLadro, AMoor, Deylendor, Tahvohck, Eglyntine, and others. Thank you&#33;\r<br />\r<br />[img]http://z13.invisionfree.com/IceburgsSkyrim/index.php?act=Attach&type=post&id=22002742[/img]\r<br />Thanks to the handy people who made Nifskope. This mod would not have been possible (or probably even conceived) without you&#33;\r<br />\r<br />Thanks to 3ds Max /Autodesk for giving a free student copy to students&#33;\r<br />\r<br />Thanks to Amajor for giving me the idea to use books instead of clutter. After I discovered that clutter objects don&#39;t register getposition I found his thread that mentioned that weapons, books, and soul gems function with getposition. He mentioned that books didn&#39;t work for some reason, but they worked fine for me. :D\r<br />\r<br />And thanks to Bethesda for making such an awesome game, and then turning it over to your fans to tweak, change, and add to it in any way they can think up&#33;\r<br />\r<br />[img]http://static2.nexusmods.com/15/mods/110/images/15827-3-1336699170.png[/img]\r<br />Finally, if you have a great rig and some nice ENB settings, I&#39;d love it if you uploaded some pics of my mod&#33; If you&#39;re really ambitious, I&#39;d love to see someone make a trailer or video of it&#33;\r<br />Thanks&#33;\r<br />[center] [url=http://www.facebook.com/IceburgModding][img]http://static2.nexusmods.com/15/mods/110/images/15827-1-1349192119.png[/img][/url][/center]",
  "categoryId": "78",
  "version": "1.9",
  "author": "Iceburg",
  "createdUnix": "1349485162",
  "updatedUnix": "1352000393",
  "containsAdultContent": false,
  "uploadedBy": "iceburg",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92257",
      "name": "Placeable Statics 1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5036",
      "fileName": "Placeable Statics 1-0-25068-1-0.zip",
      "uploadedUnix": "1349485315",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/99842a917a2e8f91715bb929bcb4bbb0090e6c3cd985db054058e5d75fb8c0ce/analysis/1407205818/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Placeable%20Statics%201-0-25068-1-0.zip?fid=92257&ttl=1535796391&ri=8192&rs=8192&setec=50b2b1a6d772131ed7ef983e484f5536"
    },
    {
      "fileId": "92264",
      "name": "Placeable Statics 1-1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5036",
      "fileName": "Placeable Statics 1-1-25068-1-1.zip",
      "uploadedUnix": "1349488586",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ccc1b4581bc739b09fca80ec3f9e92ac69d0011959a7fd3ba769e04cf1beb2b6/analysis/1407205948/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Placeable%20Statics%201-1-25068-1-1.zip?fid=92264&ttl=1535796392&ri=8192&rs=8192&setec=482f0462acb472d7a3717d79f85f326a"
    },
    {
      "fileId": "92352",
      "name": "Placeable Statics 1-2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5036",
      "fileName": "Placeable Statics 1-2-25068-1-2.zip",
      "uploadedUnix": "1349532998",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/def7c35bf6080cd2b09f10f4b0aed689f91aff7ceea1c5cde2efeacc8279f4e5/analysis/1407206719/",
      "changelogHtml": " Adds container\\'s items to player when container is picked up or stored in spell buffer. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Placeable%20Statics%201-2-25068-1-2.zip?fid=92352&ttl=1535796392&ri=8192&rs=8192&setec=032294e6d504a3d44da09ce129c3d456"
    },
    {
      "fileId": "92361",
      "name": "Placeable Statics 1-3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5036",
      "fileName": "Placeable Statics 1-3-25068-1-3.zip",
      "uploadedUnix": "1349537102",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/eb0bab53f16750e8acdb2e2fef1b9550183dbc824ed3c300ec5bcfcb0c3e7564/analysis/1407206831/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Placeable%20Statics%201-3-25068-1-3.zip?fid=92361&ttl=1535796392&ri=8192&rs=8192&setec=84326eeae9d41c15884aa0ae06c840d6"
    },
    {
      "fileId": "92949",
      "name": "Placeable Statics 1-4",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4527",
      "fileName": "Placeable Statics 1-4-25068-1-4.zip",
      "uploadedUnix": "1349797195",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/6d168275357a5a43445db8f1ef79a79967f3909463123a82d94a8d5e7c6edb06/analysis/1407211696/",
      "changelogHtml": " Much more heavily tested than previous versions.  <br/> \n Many bugfixes since 1.3 <br/> \n Every Breezehome item movable. <br/> \n All crafting equipment movable through spellbuffer. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Placeable%20Statics%201-4-25068-1-4.zip?fid=92949&ttl=1535796393&ri=8192&rs=8192&setec=313919ec8648eaf041a4f203f770a98a"
    },
    {
      "fileId": "93880",
      "name": "Placeable Statics 1-5",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7662",
      "fileName": "Placeable Statics 1-5-25068-1-5.zip",
      "uploadedUnix": "1350241765",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/36ee0d93915e6b61e4252a596a5df5cf20628af158b574d652a8efe788092122/analysis/1407222018/",
      "changelogHtml": " All Proudspire and Breezehome items can be grabbed, moved, and purchased (including all upgrades) <br/> \n All rollable rugs movable – can roll or unroll them <br/> \n Script optimization – better performance, especially noticed with mod\\'s size increase. <br/> \n Proudspire and Breezehome candles can be lit and snuffed by casting flame and frost spells on them <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Placeable%20Statics%201-5-25068-1-5.zip?fid=93880&ttl=1535796393&ri=8192&rs=8192&setec=16e89ea894142f12288c7c7c44b22943"
    },
    {
      "fileId": "95110",
      "name": "Placeable Statics 1-6",
      "version": "1.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8581",
      "fileName": "Placeable Statics 1-6-25068-1-6.zip",
      "uploadedUnix": "1350875365",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/f15804a9cdd83c208120e50ab5007617c65f9fe3418fae1c9487ce404d3a973d/analysis/1407231737/",
      "changelogHtml": " Secret behind the scenes work! <br/> \n Support for upcoming Hearthfire Patch –many items added <br/> \n Reworked scripts – Optimized (Again) <br/> \n Crafting furniture now nudgeable and rotateable <br/> \n More Moveable Lightsources can be lit by fire spells and doused by frost spells + improved script <br/> \n Display Cases now movable <br/> \n Mounted animal heads movable <br/> \n Altars movable <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Placeable%20Statics%201-6-25068-1-6.zip?fid=95110&ttl=1535796394&ri=8192&rs=8192&setec=40613f973e91d3f102932f1155a3390e"
    },
    {
      "fileId": "96086",
      "name": "Placeable Statics 1-7",
      "version": "1.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9163",
      "fileName": "Placeable Statics 1-7-25068-1-7.zip",
      "uploadedUnix": "1351361875",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/8523200de79079cb29054c67fe292f61e40229d1bdda25e0c675d4eb7787b2b3/analysis/1407238148/",
      "changelogHtml": " Fixed Crash with movable shrines (Added missing meshes) <br/> \n Fixed rug09 (That pesky rug who jumped through the floor) <br/> \n Added a few new objects <br/> \n Hearthfire Ready <br/> \n Allowed shrines to be nudged for better placement <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Placeable%20Statics%201-7-25068-1-7.zip?fid=96086&ttl=1535796394&ri=8192&rs=8192&setec=2b59d076dcdf1a447e59314654118b4a"
    },
    {
      "fileId": "96088",
      "name": "Placeable Statics Hearthfire 1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "340",
      "fileName": "Placeable Statics Hearthfire 1-0-25068-1-0.zip",
      "uploadedUnix": "1351361986",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9afd5d1556de03e755be6163988cf64d5ab00080e6a69cd642e8e4e6f9568827/analysis/1407238149/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Placeable%20Statics%20Hearthfire%201-0-25068-1-0.zip?fid=96088&ttl=1535796395&ri=8192&rs=8192&setec=34164fc49c789c138add44a3d87aa567"
    },
    {
      "fileId": "96397",
      "name": "Placeable Statics 1-8",
      "version": "1.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9214",
      "fileName": "Placeable Statics 1-8-25068-1-8.zip",
      "uploadedUnix": "1351471516",
      "modVersion": "1.8",
      "virusScanUrl": "https://www.virustotal.com/file/1f28647caa65f8f751959bebd3223f9fbad2d350c4ab121a902ebf8651ae7187/analysis/1407240082/",
      "changelogHtml": " Fixed Falling antlers (see Dark brotherhood Oblivion quest). http://www.uesp.net/wiki/Oblivion:Accidents_Happen <br/> \n Fixed rugs not working correctly <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Placeable%20Statics%201-8-25068-1-8.zip?fid=96397&ttl=1535796395&ri=8192&rs=8192&setec=ed73ad71420d8408e6c0ae6526f6380d"
    },
    {
      "fileId": "96712",
      "name": "Placeable Statics Hearthfire 1-1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "342",
      "fileName": "Placeable Statics Hearthfire 1-1-25068-1-1.zip",
      "uploadedUnix": "1351625296",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6719c9bf030f7593b988a6bce267d48b2caaf490e2cc84c752e357e4638c5789/analysis/1407242707/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Placeable%20Statics%20Hearthfire%201-1-25068-1-1.zip?fid=96712&ttl=1535796395&ri=8192&rs=8192&setec=9da12fcae6698da9aab7652976845d06"
    },
    {
      "fileId": "97366",
      "name": "Placeable Statics 1-9",
      "version": "1.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9216",
      "fileName": "Placeable Statics 1-9-25068-1-9.zip",
      "uploadedUnix": "1351999972",
      "modVersion": "1.9",
      "virusScanUrl": "https://www.virustotal.com/file/2bfb48ee767c9ab5972fa41a88ee43bc84d55a7ece58977f3971dc2186d4e5cb/analysis/1407248477/",
      "changelogHtml": " Added a few items <br/> \n Nudge function now more precise (Nudge by 1, 10, 50, and 100 units) <br/> \n Rotate function updated. Rotate forward or backward (instead of having to rotate all the way around again). <br/> \n Any object can be stored in spell buffer for more placement options. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Placeable%20Statics%201-9-25068-1-9.zip?fid=97366&ttl=1535796396&ri=8192&rs=8192&setec=e8b6706534fb5092a418ba9c84d33059"
    },
    {
      "fileId": "97367",
      "name": "Placeable Statics Hearthfire 1-2",
      "version": "HF1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "345",
      "fileName": "Placeable Statics Hearthfire 1-2-25068-HF1-2.zip",
      "uploadedUnix": "1352000393",
      "modVersion": "HF1.2",
      "virusScanUrl": "https://www.virustotal.com/file/083ad4464a005c11d6cabc16a1ef1e2f333021d0a029a4b8f5e0e9e75e000191/analysis/1407248523/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Placeable%20Statics%20Hearthfire%201-2-25068-HF1-2.zip?fid=97367&ttl=1535796396&ri=8192&rs=8192&setec=637bc3e69857698b9cfae4857b8bcfef"
    }
  ]
}