{
  "modId": 25123.0,
  "modName": "Wauthanian Dwarven Armor",
  "summary": "A texture replacer that gives the dwarven set steel and ivory highlights.",
  "descriptionHtml": "============\r\nIntroduction\r\n============\r\nThis mod is a work in progress, based on Wauthan\\'s idea of changing the materials in the dwarven set to show steel and other materials to \\'liven up\\' the set from having a solid brass color scheme. The goal of this mod is to change the dwarven set to have other materials such as steel, ivory, and wood to give the set some variation and highlights.\r\n\r\nThe pictures don\\'t do justice to the changes I made to the textures, as the dwarven armor is just about covered by its reflections which tend to come out very blurry and pixelated in screen shots. You will get a better idea of how the armor looks while the armor is in movement, as it then shows what it really should look like.\r\n\r\n===========\r\nInstallation\r\n===========\r\nThere are two options for installing the mod, either use the nexus mod manager (easy) or try to install by hand (not quite as easy)\r\n          NMM instructions:\r\nClick the \\'install with nmm\\' button below the file, then activate the mod in the nexus mod manager.\r\n\r\n         Hand installation:\r\nManually download the file, then open the 7z file, and drag and drop the texture folder into you data folder found in you skyrim directory (C:/programfiles(x86)/steam/steamapps/common)\r\n\r\n===========\r\nUninstalling\r\n===========\r\nUse the same method for uninstalling that you used to install.\r\n       NMM:\r\nClick the uninstall button when selecting the mod in nexus mod manager.\r\n       \r\n       By hand:\r\nGo back into your skyrim directory, and remove the files from the following folders:\r\ndata/textures/armor/dwarven\r\ndata/textures/weapons/dwarven\r\nAnd make sure to only remove the files from this mod, otherwise you may lose other mod.\r\n\r\n============\r\nCompatibility\r\n============\r\nThis mod is a texture replacement, so if you have any mods that edit the meshes of the dwarven set they should still work, however this will not work with any other mods that change the dwarven textures.\r\n\r\n===================\r\nRecommended Mods\r\n===================\r\nI highly recommend that you either get an ENB series mod that gives a warm bronze feel, and maybe some bloom, or get imaginator and set it up to have something similiar (which is what I used in the prototype photos), this vastly improves some of the elements of the mod such as the contrast from the steel and the dwemer, as well as makes the ivory seem more detailed.\r\n\r\n=========\r\nFeedback\r\n=========\r\nFeedback is always welcome, though make sure to be nice and only give constructive criticism, simply saying that it doesn\\'t look good won\\'t help me fix it :)\r\n\r\n======\r\nNotes\r\n======\r\n-If you want to get an idea of what Wauthan came up with for the changes, check out the discussion at \\'http://skyrim.nexusmods.com/mods/7110/\\' called Dwarven mod topic.\r\n\r\n-Feel free to make mod requests here, just know that I do tend to take a while to make these things.\r\n\r\n-The first 2 pics have a lot of bloom, this is due to my FXAA settings right now, the parts that are blindingly white are the gold/dwemer parts of the armor reflecting the sun, they actually look quite nice when they aren\\'t blinding :)\r\n\r\n===========\r\nOther Mods\r\n===========\r\n\r\nGilded Ebony Set http://skyrim.nexusmods.com/mods/1842 (my first mod *sniff*)\r\n\r\nVES - Versicolor Ebony Sets http://skyrim.nexusmods.com/mods/7110/\r\n\r\nEnhanced Glass Armor http://skyrim.nexusmods.com/mods/1985/\r\n\r\nEnhanced Glass Weapons http://skyrim.nexusmods.com/mods/2168/\r\n\r\n=====\r\nLegal\r\n=====\r\n\r\n-Don\\'t upload any of my files anywhere without my permission.\r\n-Don\\'t change any of my files and claim them as your own without my permission.\r\n-Respect that I have devoted a lot of time to this mod, do not steal my work.",
  "categoryId": "36",
  "version": "1.0",
  "author": "Linkcube",
  "createdUnix": "1349561468",
  "updatedUnix": "1349561514",
  "containsAdultContent": false,
  "uploadedBy": "linkcube",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92437",
      "name": "Male armor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2498",
      "fileName": "Male armor-25123-1-0.7z",
      "uploadedUnix": "1349561514",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/adc8a336058614b291f1dae34595f1cc4235116d5cb985e482fc9a38195afd65/analysis/1407207304/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Male%20armor-25123-1-0.7z?fid=92437&ttl=1535796482&ri=8192&rs=8192&setec=9caaeb5381eba2c46ab247928b6bb026"
    }
  ]
}