{
  "modId": 25135.0,
  "modName": "ShiverTwitchs Fantastical Sky",
  "summary": "Tired of all those boring orange sunrises and sunsets?  This mod makes the sunrises various shades of cyan, pink, and violet and the sunsets magnificent shades of red, orange and purple!  Updated regularly :D",
  "descriptionHtml": "[[UPDATE:  Users who have More Rain/Snow or Realistic Lighting, do not use v2.1 - stick with 2.0.1 for now.  2.1 appears to be incompatible with those mods and I\\'ll have to figure out why.  But it looks like users who do have More Rain/Snow or Realistic Lighting will have to keep the super dark horizon during sunrises/sunsets, as I\\'m pretty sure the incompatibility lies in a slight fog alteration I had to make in order to get rid of it.]]\r\n\r\nHey everybody!  As my very first (and suuuper simple) mod, I decided to tackle those hideous orange sunrises and sunsets.  I\\'m sure there are plenty of ways this little tweak could be made better so, as I continue playing, I will continue to add changes and improvements (uploading them as I deem necessary) until I\\'m completely happy with it.\r\n\r\nAlso, I welcome any suggestions to help make this better - though keep in mind that this mod will evolve based on my personal tastes.  That being said, since this is relatively easy to do, if anybody has any requests I\\'ll be happy to give them a shot provided I have the time :D\r\n\r\nKEEP IN MIND:  I\\'m using several lighting mods, including Claralux, Realistic Lighting, Imaginator, as well as my own \\\"Frankenstein\\'s Monster\\\" of an ENB that I pieced together from several well known and talented ENB authors.  Why am I saying this?  Because this mod WILL NOT look the same in your game as it does in mine, plain and simple.  If you like this mod but it doesn\\'t look great with your ENB, there are ways to fix this... let me know and I\\'ll show you how :)\r\n\r\nEnjoy!\r\n\r\n(Aside: Additional mods shown in my screenshots are (or will be in the future) Dramatic Clouds, More Rain, and More Snow.  Gotta give a shout out to these because they are freakin\\' awesome.  Oh, also, some weird crazy cool sunglare texture from I-have-no-idea-where that I recolored to a pink-ish hue.)\r\n\r\n\r\nA few questions were brought up regarding incompatibilities and performance, so I figure I\\'ll address them here.  This mod will have ZERO impact on performance, all I\\'ve done is change some colors around on the existing weather types.  As far as compatibility, I\\'ll add any issues that I discover or are brought to my attention as the mod evolves, below.\r\n\r\nIncompatibilities:\r\nProject Reality: Climates of Tamriel - Overwrites my mod completely.\r\n\r\n\r\n\r\n\r\n::OLD::\r\n\r\n[[UPDATE:  V2.1 is complete!  I will be uploading in a little while once I\\'m finished double-checking all my changes as fixing a strange (Creation Kit bug?) issue regarding horizon clouds moving along the Y-axis even though no such movement is assigned >:( \r\n---V2.1 uploaded!  Now to start work on v2.2, which will add coloration to the clouds during the sunrises and sunsets, and possibly some other times, depending on the necessity.]]\r\n-----------------------------------------------------------------\r\n\r\n\r\n[[NEWS: A horrible issue occurred - of which I have yet to discover the cause - and I was forced to restart from scratch.  I will be releasing v2.0.1 tonight (10/10/12) will will contain completely redone sunrises, sunsets, and touched up days.  v2.1 and its amazing cloud colors will be soon to follow :) ]]\r\n\r\n\r\n-----------------------------------------------------------------------------------\r\n!!UPDATE!!  In honor of my very first \\'Endorsement\\' (thanks, evok99!) I decided to burn the midnight oil and finish my tidying up of the \\'clear weather\\' sunrises, sunsets, and mid-day colors.  Also, I decided to turn 2 or 3 of them UP TO ELEVEN so that every now and then a \\'super-fantastical\\' sunrise/sunset will (hopefully) leave you breathless!\r\n......but if the superfantastical moments are too extreme just rage about them in the comments and I\\'ll tone it down or add a standardfantastical version :P )\r\n\r\nLater updates will add kewler colors to the various types of inclement weather and perhaps some \\'extreme\\' weather versions.  Additionally, I\\'ll try to see if I can get the clouds in on some of this action...  golden in the morning, blood red in the evening, etc.\r\n\r\nStay tuned!  Also, if you like the mod, don\\'t forget to \\'endorse\\' it to keep my fuel burnin\\' :D\r\n-----------------------------------------------------------------------------------\r\n\r\n\r\n[[ !NEWS!  After hours of poking, prodding, trial, and error, I have made a breakthrough!  I have discovered how to be rid of that hideous dark/gray/muddy bar between the sea and the horizon!  And it only took me until 5:30 in the morning to do it!\r\nStarted working immediately on a few new sunsets and they look incredible...  figured out how to change the cloud color as well and I can\\'t wait to show everybody.  If you\\'ve been on the fence about this mod, check back in a few days and I should have v2.1 pics up :D ]]\r\n-------------------------------------------------------------------------------------\r\n\r\n\r\n[[NEWS! - v2.0.1 had been posted!  Unfortunately, I was forced to start from scratch with this version, so while I have completed all of the sky color changes to the \\\"Clear Sky\\\" weather types, the changes I had made to cloudy and rainy weather were lost :\\'( . . . luckily, there aren\\'t nearly as many cloudy/stormy weather types as there are clear, so fixing those up for v2.1 shouldn\\'t be a problem.  In light of this, however, I\\'ve decided to push the cloud color changes back until after I\\'ve finished the sky color of all the weather types, but that still shouldn\\'t take more than a week or so!\r\n\r\nAlso, at some point, I should probably organize this description area and add some fancy graphics and whatnot...]]",
  "categoryId": "62",
  "version": "v2.1",
  "author": "ShiverTwitch",
  "createdUnix": "1349579120",
  "updatedUnix": "1350652753",
  "containsAdultContent": false,
  "uploadedBy": "ShiverTwitch",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92500",
      "name": "ShiverTwitchs Fantastical Sky v1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "ShiverTwitchs Fantastical Sky v1-25135-1.rar",
      "uploadedUnix": "1349579454",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/67731f94a148e56732b8b144d050a53e82616e17cbd7a98f6b7f58c77912f199/analysis/1407207738/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ShiverTwitchs%20Fantastical%20Sky%20v1-25135-1.rar?fid=92500&ttl=1535796502&ri=8192&rs=8192&setec=c564e4b9d8009321a5788d68510576a0"
    },
    {
      "fileId": "92547",
      "name": "ShiverTwitchs Fantastical Sky v2",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "ShiverTwitchs Fantastical Sky v2-25135-2.rar",
      "uploadedUnix": "1349610856",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/5abebbd92929070863c4af4549372eb27f9f6d711ddf8694d6b0a65b4d8168c9/analysis/1407208083/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ShiverTwitchs%20Fantastical%20Sky%20v2-25135-2.rar?fid=92547&ttl=1535796503&ri=8192&rs=8192&setec=5e19e0b2457aa324bfa555ed937c528a"
    },
    {
      "fileId": "93190",
      "name": "ShiverTwitchs Fantastical Sky v2_0_1",
      "version": "2.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "ShiverTwitchs Fantastical Sky v2_0_1-25135-2-0-1.rar",
      "uploadedUnix": "1349923505",
      "modVersion": "2.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/7ded7c57947b736c5bbb8bead9a7861e33865355ee4a549112fe00fd54c2b22c/analysis/1407214442/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ShiverTwitchs%20Fantastical%20Sky%20v2_0_1-25135-2-0-1.rar?fid=93190&ttl=1535796504&ri=8192&rs=8192&setec=77434b4d9c6dd867e8457773139ef131"
    },
    {
      "fileId": "94614",
      "name": "ShiverTwitchs Fantastical Sky v2_1",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "ShiverTwitchs Fantastical Sky v2_1-25135-2-1.rar",
      "uploadedUnix": "1350652753",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/3fc4991d0d9c14819eb8bb411e1e782b9dceefd3fbe31e8fd9e97bd957eb5f7d/analysis/1407228613/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ShiverTwitchs%20Fantastical%20Sky%20v2_1-25135-2-1.rar?fid=94614&ttl=1535796504&ri=8192&rs=8192&setec=db9a7a62b5c57d43dc2f1f678809b1ad"
    }
  ]
}