{
  "modId": 25160.0,
  "modName": "Clan Tremere Mod",
  "summary": "A similar thing to Blood Magic by Allzero, But based on the Vampire the Masquerade and comes with a Guildhouse.",
  "descriptionHtml": "Clan Tremere mod by Galejro\r\n\r\nThis is a simple mod that I’ve made to improve vampire gameplay In Skyrim REQUIRES DAWNGUARD. It may be considered a mediocrate alternative to Blood Magic by allzero, and yes, he did helped me out in making this one. \r\n\r\n\r\nWhat it does:\r\n\r\n\r\nFirst of all you will find a neat dark and Tremere like Chantry located near one of the entrances to the Solitude Castle (the one with the cathedral)\r\n\r\nInside you will find:\r\n-4 Merchant NPC’s each specializing in a different field: Alchemy, Armor/Weapons, jewelery, Enchanting and Spells.\r\n-Multiple neat places for a mage type player to do Alchemy/Enchanting.\r\n-Your very own private luxurious Chantry room providing all magic stuff.\r\n-Library filled with many books both about the lore of the other Clans than Tremere as well as spell tomes for Tremere Powers. You will also find there a potion bottle which will change you into a Tremere.\r\n\r\n====READ THIS BEFORE YOU DRINK====\r\n\r\nThe potion turns you into a Tremere Vampire according to the lore. Tremere when turned into vampires loose their human magic but get generally overpowered in magic. So the potion makes you loose all your mana and it will always stay at 0 manapoints. In daylight the vampire debuffs will reduce it below 0 so you will not be able to use magic at all in daylight. But this will give you a permanent 20 point buff to all schools of magic. Since Tremere lore is not specified about their blood magic compatibility with humans it will also work for non-vampires. \r\nNO Mana!?: well yes, since Tremere Vampires loose magic for blood magic you pay for your new spells with Health (a.k.a. Blood)\r\nIt adds multiple spells usually expected of the Clan Tremere from Vampire the Masquerade universe (you can learn them from spell tomes in the chantry) divided into the following discipline Trees:\r\n\r\n\r\nThaumaturgy: Offensive vampiric magic \r\n1.\tBlood Bolt – A red fireball … duh.\r\n2.\tTheft of Vitae – A decent damage vampire absorb spell that does not get unequipped with vampire level advancement.\r\n3.\tBlood Purge – A powerful red firestorm like spell doing exactly the same \r\n(WARNING: you pay with health for each hit target so be sure to fire it with lots of health). \r\n4.\tBlood Salvo – A burst of damaging magic that deals damage to multiple targeted targets (WARNING: you pay with health for each hit target so be sure to fire it with lots of health). \r\n5.\tBlood Boil – A Power that allows you to kill any target once a night.\r\n\r\nDominate: Mind control spells that make it easier in combat and vampire life.\r\n1.\tTrance – Mesmerize spell that affects almost every target, stuns and allows to drink blood.\r\n2.\tPossetion – Makes a hit target fight everyone else.\r\n3.\tSuicide – Possetion spell that also deals damage to the target.\r\n4.\tBrainwipe – All nearby targets forget to fight you.\r\n5.\tMass suicide – Daily power that makes all targets attack themselves and they receive damage.\r\n\r\nAuspex: Mind enchancement discipline\r\n1.\tAuspex - A simple detection spell \r\n\r\nBlood Rituals: Support spells that make life more easier (all can be baught from an NPC). \r\n1.\tRegeneration – Healing spell. You pay 50 health to get more regenerated over time.\r\n2.\tSummon Gargoyle – What’s a Tremere without his gargoyle guardian.\r\n3.\tSoul Consumption – since there’s no mana you need a health based spell that does soul trap. \r\n\r\nThaumaturgy is a discipline of leveled spells so they should react accordingly to the level of the enemy, a form of security from spell usefulness degradation over time.\r\n\r\n\r\nCompatibility:\r\n\r\n\r\nI know people make better mods than mine so might as well make it compatible. The second reason is that this mod is to appeal to as large amount of players as possible. Therefore, I made this mod without any intervention into the game. No blood bars, no changes to game scripting or objects. The only thing changed is a part of ground next to the solitude castle.\r\n\r\n\r\nCredits:\r\n\r\n\r\nI would like to thank:\r\n-First and foremost White Wolf publishing for making a great universe and therefore, basis for the mod. \r\n-Allzero for contributing I making this mod as an advisor\r\n-jerminator1977 for Mythic dawn texture\r\n-Komoni for some textures and dark brotherhood robe texture\r\n-Isoku for window textures\r\n-mgbeach for rug textures\r\n-Blary for the Open books resource mod.\r\n\r\n\r\nPermissions/ Copyrights:\r\n\r\n\r\nMost of the stuff in this mod (textures) is borrowed from the listed above people. So you can’t use use or redistribute it without their permission first and than mine. \r\nIf we’re talking about clan books and discipline books Both text and textures are free for use these. Except if you want to make any monetary profits from Clan Logos (White Wolf Publishing policy)\r\n",
  "categoryId": "75",
  "version": "1.0",
  "author": "Galejro",
  "createdUnix": "1349634871",
  "updatedUnix": "1349639859",
  "containsAdultContent": false,
  "uploadedBy": "Galejro",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92621",
      "name": "Clan Tremere Mod main File",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "105544",
      "fileName": "Clan Tremere Mod main File-25160-1-0.rar",
      "uploadedUnix": "1349637902",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d990bafc6399f3d6e0cc847690a69b5d4863a0a8ab1a955ac72e6ef7b6bd7cb1/analysis/1407208773/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Clan%20Tremere%20Mod%20main%20File-25160-1-0.rar?fid=92621&ttl=1535796549&ri=8192&rs=8192&setec=3732cf937240ed13add7608b473e91a1"
    },
    {
      "fileId": "92634",
      "name": "The esp file replacer",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "119",
      "fileName": "The esp file replacer-25160-.rar",
      "uploadedUnix": "1349639859",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/bbace12a32684437d2322dd0c52012f605f82109054b4e56cdd2f91d5296e677/analysis/1407208812/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20esp%20file%20replacer-25160-.rar?fid=92634&ttl=1535796550&ri=8192&rs=8192&setec=b2d491cd13036222feb2075ff0c52e34"
    }
  ]
}