{
  "modId": 25190.0,
  "modName": "Conjure Golden Saint - Summon Spell and Custom Race",
  "summary": "The Golden Saints are back on Tamriel. Everyone\\'s favourite golden Daedra can now be summoned to aid you in combat, dressed up as or even played as.",
  "descriptionHtml": "[size=16][color=gold][center][b][u]The Return of the Saints[/u][/b][/center][/color][/size]\r\nOn his last visit to Tamriel, Sheogorath, the Daedric Prince of Madness left behind his personal address book. It contained the addresses of all his Daedric friends (only one actually, Jyggalag, who he\\'s never actually met and who only writes once an era) and servants. Haskill assured him, repeatedly and at length, that due to it being cleverly encrypted in the language of Dragons (which no mortal could understand) its retrieval was not a priority.\r\n\r\nFive copies were laboriously made before the original disappeared one night without trace, left behind in its place a half-eaten chicken leg and a crude drawing of the book. What Haskill didn\\'t realise however, was that there was in fact one mortal alive that could read it. It\\'s okay, Sheogorath will humiliate him (repeatedly and at length) later.\r\n\r\nThe Golden Saints are back on Tamriel! Everyone’s favourite Daedra were sadly lacking from vanilla Skyrim for whatever reason. I waited patiently for a mod to bring them back but alas, to no avail. I grew tired of waiting and so set about bringing them back myself, and here they are.\r\n\r\nThis mod consists of three components. A “Summon Golden Saint” spell which anyone can use, a set of armour and weapons anyone can forge and use and the opportunity to play as one in the form of a playable race. I have done my best to test, polish and balance this as much as possible, and to keep them in-line with their previous TES incarnations.\r\n\r\n[color=gold][b][u]Summon Golden Saint Spell[/u][/b][/color]\r\nThere is a new spell to summon a Golden Saint to fight for you, that behaves as follows:\r\n\r\n[list][*]It is an Expert level Conjuration spell, and requires the appropriate perk and skill level to learn.\r\n[*]It lasts for a flat 90 seconds and is [b]unaffected[/b] by perks or dual-casting  (except, in addition to skill level, to reduce spell casting cost).\r\n[*]Only one Golden Saint can be active at a time. If the spell is cast again, the current one will be unsummoned.\r\n[*]They are summoned in addition to other vanilla summoned creatures. They do not interfere with other summons, followers, animal followers or hirelings in any way and aren’t affected by Conjuration perks.\r\n[*]They aren’t affected by any “Banish” spells and cannot be pick-pocketed, commanded or looted.\r\n[*]My personal favourite part of this mod...Each time the spell is cast, [b]one of eight different Golden Saints will be summoned at random[/b]. You have a 50% chance of getting a male or female, and a 25% chance of getting a sword/shield, a two-hander, a dual-wielder or an archer.\r\n[*]All of the Golden Saints have the same perks and spells list.\r\n[*]They are [i]slightly[/i] more powerful than the highest-level summoned creature in the vanilla game.\r\n[*]There is one last difference between them and normal summoned creatures that fans of Morrowind will remember. I will not tell what it is however. [img]http://forums.nexusmods.com/public/style_emoticons/dark/tongue.gif[/img][/list]\r\nThe spell can be learned from a Spell Tome, of which a copy resides in the respective inventories of [b]each of the five Housecarls[/b] (adding items to merchants cannot be done without potential clashes with other mods). It can also be cast from scrolls, the only three of which in existence will appear in the player’s inventory on loading (if anyone knows how to add them to levelled lists via script please let me know). There is a sixth copy of the Spell Tome available by pick-pocketing a certain NPC during a particular quest. There is only one opportunity to get this particular copy. It\\'s the first (and most obvious) NPC you thought of.\r\n\r\n[color=gold][b][u]Golden Saint Armour & Weapons[/u][/b][/color]\r\nAfter the work that went into getting the armour and weapons for the Golden Saints right, I thought it would be a shame not to make them playable. If you like the look of it on your summoned Golden Saint, you can obtain their items for yourself, as follows:\r\n\r\n[list][*]All armour pieces, weapons and the shield are craftable at a blacksmith’s forge.\r\n[*]All the items will be found in the “Daedric” section and require the “Daedric Smithing” perk to forge, except for the arrows which anyone can make (in batches of fifty), available under the “Misc” section.\r\n[*]All armour pieces and the shield can be upgraded at a workbench. They are categorised as Heavy Armour.\r\n[*]All weapons can be tempered at a grinding wheel.\r\n[*]All pieces are comparable with their Daedric equivalents (few minor tweaks only).\r\n[*]All armour and weapons benefit from their respective skills & perks as expected.\r\n[*]You will need a LOT of gold ingots to make and upgrade them.[/list]\r\n[color=gold][b][u]Golden Saint Playable Race[/u][/b][/color]\r\nI have tried as much as possible to keep as close to their abilities and skills from previous games, but there has been a little re-imagining by necessity. They have the following attributes:\r\n\r\n[list][*]They are physically larger than any vanilla race, and have their own selection of vanilla hair styles, facial features and so on, along with some unique eye and skin colours.\r\n[*]They have [i]marginally[/i] better (ie. barely noticible if at all) health and magicka recovery rates than vanilla races.\r\n[*]Their racial skill bonuses are: +10 Heavy Armour, +10 Destruction, +5 Block, +5 One-Handed, +5 Restoration.[/list]\r\nTheir racial abilities are:\r\n\t[list][*]Permanent 25% chance to absorb incoming spells, ignoring their damage and adding the base magicka cost to their own magicka reserve.\r\n\t[*]Permanent 50% [b]Weakness[/b] to Poison\r\n\t[*]Lesser Ability – Powerful disarm spell to disarm opponents. It has a high magicka cost at a flat-rate of 150 and [b]isn’t[/b] affected by any skills, perks or modifiers.[/list]\r\nI have reluctantly added Vampire Race support. While the cosmetic changes that come with being a Vampire will not show as with vanilla races, quests, dialogue and gameplay should react to the player’s undeath correctly, with or without Dawnguard.\r\n\r\n[color=gold][b][u]Known Issues[/u][/b][/color]\r\n[list][*]Very minor armour clipping issues. Fixing these is beyond my abilities.\r\n[*]Armour and shield inventory and ground models show standard Elven models. Fixing this is beyond my abilities.\r\n[*]No Vampire glowing eyes or cosmetic changes to appearance. Adding support for this will only add more potential clashes.[/list]\r\n[color=gold][b][u]Incompatibilities[/u][/b][/color]\r\nI was very much looking forward to proudly pronouncing [b]none whatsoever[/b]. However, adding last-minute Vampire support has put paid to that! Nothing in this mod will clash with any other mod, except for potentially any other custom races [b]specifically[/b] with Vampire Race support. If you play as another custom race already, put this mod [b]higher[/b] in your load order so that their changes overwrite mine.\r\nOtherwise, it makes no difference where this mod goes in your load order.\r\n\r\n[color=gold][b][u]Credits[/u][/b][/color]\r\nMeshes and textures used in this mod were themselves made by other mod authors, or of course, Bethesda themselves. I’d like to thank them, in no particular order, for their wonderful work without which this mod wouldn’t have looked remotely as good.\r\n[list][*][b]Male armour mesh[/b] – With thanks to [b]Sundracon[/b] for the brilliant [url=http://skyrim.nexusmods.com/mods/2649]male cuirass[/url] (if a rather questionable body). [img]http://forums.nexusmods.com/public/style_emoticons/dark/tongue.gif[/img]\r\n[*][b]Male body mesh[/b] – Thanks again to [b]Sundracon[/b], this time for a much more appropriate [url=http://skyrim.nexusmods.com/mods/4196]body mesh[/url]!\r\n[*][b]Female armour mesh[/b] – With thanks to [b]bingles[/b] for his kind permission to use his wonderful [url=http://skyrim.nexusmods.com/mods/7904]female cuirass[/url].\r\n[*][b]Golden Saint Eyes[/b] – With thanks to [b]MissAniThrope[/b] for her kind permission to use her stunning [url=http://skyrim.nexusmods.com/mods/12214]eye textures[/url]. They make the vanilla ones pale in comparison.\r\n[*][b]Golden Saint armour textures[/b] – A sincere thank you to [b]hkjun[/b] for the [url=http://skyrim.nexusmods.com/mods/3588]incredible textures[/url]. These textures put the “Golden” into “Golden Saint”!\r\n[*][b]Golden Saint Crown[/b] – With thanks to [b]pnkrd[/b] for the lovely [url=http://skyrim.nexusmods.com/mods/5803]crown mesh[/url]. Elegant, beautiful and makes a huge difference.\r\n[*]I\\'d also like to thank [b]Mujuro[/b] for his patience and prodding on the forum when I was frustrated with Papyrus.[/list]\r\n[color=gold][b][u]Installation[/u][/b][/color]\r\n- Use NMM, or alternatively:\r\n- Download the archive manually, and unpack the two files inside the \\\"Data\\\" folder, “Golden Saints.esp” and “Golden Saints.bsa” into your /Skyrim/Data directory.\r\n- Start the game, and on the launcher, select “Data Files” and ensuring “Golden Saints.esp” is ticked, click OK.\r\n\r\n[color=gold][b][u]Uninstallation[/u][/b][/color]\r\nDelete the aforementioned two files.\r\n\r\n[color=gold][b][u]My other mods[/u][/b][/color]\r\n[list][*][url=http://skyrim.nexusmods.com/mods/14687]Unbound Bow - Fires unlimited arrows[/url]\r\n[*][url=http://skyrim.nexusmods.com/mods/14730]Shadowcloak Armour - Daedric Stealth Suit[/url]\r\n[*][url=http://skyrim.nexusmods.com/mods/23916]Invisibility Eyes Fix[/url] - Fixes the glitch whereby the player\\'s eyes are messed up after turning invisible/visible[/list]",
  "categoryId": "33",
  "version": "1.0",
  "author": "KingsGambit",
  "createdUnix": "1349664504",
  "updatedUnix": "1349664720",
  "containsAdultContent": false,
  "uploadedBy": "KingsGambit",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92693",
      "name": "Golden Saints",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18951",
      "fileName": "Golden Saints-25190-1-0.zip",
      "uploadedUnix": "1349664720",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0ac837ca5fb934ec0045960f9871a5bfc789a687a2e791e8f9a8268f427c9756/analysis/1407209352/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Golden%20Saints-25190-1-0.zip?fid=92693&ttl=1535796586&ri=8192&rs=8192&setec=3e79b7aa577a90744a057ddba4d78cbe"
    }
  ]
}