{
  "modId": 25210.0,
  "modName": "POTENT -Perk Overhaul To Enhance Two-handers-",
  "summary": "Script-free 2H perk mod that: adds new tactics to melee combat, enriches the experience of playing classical RPG classes (paladin, knight, withchunter...) by tailoring perks to those playstyles, incorporates a double skill requirement system for certain perks, fleshes out the perk descriptions so that they feel more like an achievement. ",
  "descriptionHtml": "POTENT: Perk Overhaul To Enhance Two-handers\r\nby Tiny Lampe\r\nversion: 1.0 (first release)\r\nRequirements: Skyrim version 1.6.87.0.6 or higher\r\n**************************************************************\r\n\r\nThis mod makes changes to the two-handed perk tree; it adds some new perks and modifies or even removes some vanilla perks. Everything is achieved without using scripting so this mod is safe to install and uninstall.\r\n\r\n\r\nWhat are the changes?\r\n****************************\r\n\r\n1. Barbarian perk removed, now leveling your two-handed skill increases weapon damage. \r\n2. Perks that bring new tactics to melee combat. \r\n3. Perks with double skill requirements that allow to mitigate some weaknesses of two-handed weapons. \r\n4. Perks that flesh out certain classes. \r\n5. Fleshed out perk descriptions \r\n\r\n\r\nThe perks, in detail:\r\n**************************\r\n\r\n2h training - requires 0 skill, replaces ‘Barbarian’: The road of training is long but rewarding; the more you increase your two handed skill, the more damage you will do with two handed weapons.\r\n\r\nInvigorating Pain -requires 70 skill-: They hit you with all they got yet your block resisted; after blocking a power attack your confidence in victory makes you swing 60% faster for 4 seconds.\r\n\r\nOpportunist -requires 50 skill-: You have learnt to use the pain of your enemies in your advantage; normal attacks on staggered opponents deal 30% more damage.\r\n\r\nChampion’s Stance rank 2: - requires 50 skill in 2H and Block-: As an adept at both heavy weaponry and block, you are now able to block 25% more effectively with two handed weapons.\r\n\r\nChampion\\'s Stance rank 3 - requires 50 skill in 2H and Restoration -: By delving into restoration you managed to apply its secrets in your fighting style; blocking with a 2H weapon automatically casts a 60-point ward spell.\r\n\r\nCharge -requires 60 skill, replaces \\'Great Critical Charge\\': You are not afraid of getting hit, but your foes should since your might is so strong that your sprinting power attacks can send them flying (30% chance).\r\n\r\nCounterattack -requires 100 skill, replaces Warmaster-: You have learnt to use the strength of your foes to your advantage: landing a backwards PA when they are doing a forward PA will knock them down.\r\n\r\nEnchantment amplification -requires 50 skill in 2H and enchanting: By delving into enchanting you have learnt to take advantage of 2H weapons\\' bigger size and infuse them with 50% stronger enchantments.\r\n\r\nKnight -requires 30 skill-: You have learnt the importance of momentum; by power attacking from your horse, your swings gain a 50% chance of knocking down your opponents.\r\n\r\nPaladin of Namira - requires 70 skill in 2H and 50 in Restoration- : Thanks to your restoration expertise each swing of a 2H silver weapon will set the undead aflame, consuming 4 HP/s during 120 seconds (stackable)\r\n\r\nPlease notice!: all the vanilla perks that I didn\\'t mention above as being replaced (the Sweep perk, weapon specialization perks etc) have NOT been removed. They are still in the tree and behave as they did in they vanilla game.\r\n\r\n\r\nOther changes:\r\n*******************\r\n\r\nSilver Perk: (this is a hidden perk that allows silver weapons to be \\'especially effective against undead\\'). Change I made: as opposed to give a flat +20 damage against undead, now the amount of damage done is proportional to your restoration skill so With 20 restoration you do +20 damage, with 100 restoration, you do +100 damage!\r\n\r\nQuick Reflexes: (this is the perk from the block tree). Change I made: now you have to block AND not move at all in order to trigger the slow-time effect. Why? 1) Because otherwise Quick reflexes and my perk \\'Invigorating Pain would share the exact same trigger conditions. 2) Because imposing a isMoving=0 condition on quick reflexes makes sense to me.\r\n\r\n\r\nInstallation and Uninstallation:\r\n***************************************\r\n\r\nSimply drop the .esp file into the data folder to install. Make sure it is checked before you play\r\nSimply remove the .esp file from the data folder to uninstall. Since this mod doesn\\'t contain scripts, your save files are completely safe.  \r\n\r\n\r\nCompatibility:\r\n******************\r\n\r\nThis mod doesn\\'t remove any vanilla entry.\r\nThis mod modifies most of the vanilla perks in the Two-handed perk tree, the perk quick-reflexes (in the block tree) and the hidden perk called \\\"silver perk\\\".\r\nThis mod also adds several new perks in the Two-handed perk tree.\r\n\r\nThis mod should be compatible with anything that doesn\\'t modify the 2handed perk tree, the block perk tree and the silver perk.\r\nIf you already have a mod XYZ that modifies some of those entries and want to see my changes applied, load my mod after XYZ.\r\n\r\n\r\nLegal:\r\n********\r\n\r\nThis mod is a nexus-exclusive release. Please respect my decision and do not upload this file to other sites.\r\n\r\nYou must get permission from me before you are allowed to modify my files or use them in your project. If you send me an e-mail and I don\\'t reply in 15 days, then you\\'re free to modify and/or use my files however you see fit.  ",
  "categoryId": "77",
  "version": "1.0",
  "author": "Tiny Lampe",
  "createdUnix": "1349712505",
  "updatedUnix": "1349983915",
  "containsAdultContent": false,
  "uploadedBy": "tiny lampe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93314",
      "name": "POTENT -Perk Overhaul to Enhance Twohanders- ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "POTENT -Perk Overhaul to Enhance Twohanders- -25210-1-0.7z",
      "uploadedUnix": "1349983915",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4e6f84d980b2f04fe2f9bada307b69805d361919c935b560beab0414fddecdf6/analysis/1407215823/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/POTENT%20-Perk%20Overhaul%20to%20Enhance%20Twohanders-%20-25210-1-0.7z?fid=93314&ttl=1535796610&ri=8192&rs=8192&setec=e0dd11e824eaafaa3197c89d8fa08a10"
    }
  ]
}