{
  "modId": 25223.0,
  "modName": "Castlevania Memories First Episode - No Videos Version",
  "summary": "This is an alternate version of the Castlevania Memories First Episode, this time without the videos for a better gaming experience and because I inspired from a comment in the original version.",
  "descriptionHtml": "Castlevania Memories First Episode - No Videos Version\r\n====================================================\r\n\r\nThis is an alternate version of the Castlevania Memories First Episode, this time without the videos for a better gaming experience and because I inspired from this comment by Talon111:\r\n\r\n[quote]I just started playing this mod and while I really like the work done on the castle and the ambience I absolutely HATE and I do mean HATE the videos! The whole idea of playing an RPG is that you play YOUR own avatar and not being forced to watch someone else\\'s idea of the hero suddenly take over the cut scenes, and with awful voice acting at that! Why did you not use the existing game system of NPC dialogues? That would have been so much better and not jar you out of your player experience by being forced to endure your vision of the Dragonborn! This is so irritating that I will absolutely NOT endorse this regardless of how much I may enjoy the rest of it, those stupid videos just kills it for me![/quote]\r\n\r\n[img]http://static.skyrim.nexusmods.com/images/1920630-1343187061.jpg[/img]\r\n\r\nIntroduction:\r\n=========================\r\nThis is finaly the first episode of the Castlevania Memories and contains the whole story until Garibaldi Temple. Germain calls us to fight Dracula because there are no Belmonts left in this century to oppose him. He later finds that Shaft, a dark priest from Dracula\\'s allies tries to ressurect him within the body of Richter Belmont, one who should be away from Europe for a long trip. Now, it\\'s up to you to stop him from reviving the Lord of Castlevania.\r\n\r\nDue to the mod\\'s large file size, I couldn\\'t get into this any more\r\nareas as Skyrim has some limitations to the mod files. The story will be fully completed in the next episode.\r\n\r\nQuest StartUp\r\n===================================\r\nYou will go to Riverwood as in the demo version and find the mysterious mechanic chest in front of Riverwood Trader. You will be teleported to the Abandoned Castle Bridge and you\\'re free to explore.\r\n\r\nMinimun Level:\r\n===================================\r\nIt\\'s recommended to be in 20 and up level when you start the mod. You may gain levels during the game but this is best to be played with ease.\r\n\r\nInstallation:\r\n=============================\r\nThis version is friendly with the NMM and can be installed auto by it.\r\n\r\nFor manual install, just extract the files to your skyrim data directory. Usually found at C:\\\\Program Files(x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data but you will need 7zip or WinRar to open it.\r\n\r\n~You must not have installed and active any other Castlevania versions, testing, demo or anything else for this mod to play properly. Delete the other versions and their bsa if any to properly play this one.~\r\n\r\nKnown Bugs & Issues:\r\n=============================\r\n\r\n-It is best not to have the innocent devil summoned when you enter the Garibaldi after Wyvern\\'s Lair. The same in the Garibaldi Sanctuary at the end of the Garibaldi Inner Halls. He might destroy the events and make the game not continue.\r\n\r\nCredits:\r\n===================================\r\n\r\nBethesda Game Studios\r\nAdobe\r\nNiftools\r\nAutodesk\r\n\r\n===================================\r\nSpecial Thanks:\r\n===================================\r\n\r\nMichiru Yamane for giving me permission to use original soundtracks from the Castlevania games for PS2 and PSOne.\r\n\r\nTo the actors:\r\n-Stephen C. as St. Germain & Shaft\r\n-Torzelan as Alucard\r\n-Vereta as Dragonborn(Not active in this version) & Richter (The name is corrected in game in this version)\r\n-SnakeDeShazer as Hector\\'s Voice\r\n\r\nAnd to Fire3lf for recording an about three hours livestream gameplay of the episode and making an awesome spotlight.\r\n\r\n==========Good Gaming=================",
  "categoryId": "35",
  "version": "1.0",
  "author": "LordKarnak",
  "createdUnix": "1349728043",
  "updatedUnix": "1349787700",
  "containsAdultContent": false,
  "uploadedBy": "LordKarnak",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92931",
      "name": "Castlevania First Episode No Videos",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "192752",
      "fileName": "Castlevania First Episode No Videos-25223-1-0.7z",
      "uploadedUnix": "1349787700",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/def026c7b3783ff6ade688f5a039b54e0bd046cca0450d56be6380f67a4ae06d/analysis/1407211492/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castlevania%20First%20Episode%20No%20Videos-25223-1-0.7z?fid=92931&ttl=1535796625&ri=8192&rs=8192&setec=382fd79b5a1c0c0ef7ae051babf10b90"
    }
  ]
}