{
  "modId": 25236.0,
  "modName": "General Stores - Proudspire",
  "summary": "This adds base General Stores activators throughout Proudspire in Solitude, to autosort and safely store all your items and let you access them from any other General-Stores enabled home.  General Stores required!  Get it at http://skyrim.nexusmods.com/mods/18340",
  "descriptionHtml": "This mod adds General Stores, autosorting storage activators by the amazing Harvey2112, to Proudspire in Solitude without removing or changing anything else. For those who are not familiar with General Stores, it\\'s like cloud storage for your Skyrim items. Let each activator automatically sort and store all your inventory and you can access it from any other General Stores addon, such as my similar mods for Breezehome in Whiterun, Honeyside in Riften, and Vlindrel Hall in Markarth at:\r\n\r\nhttp://skyrim.nexusmods.com/mods/25282\r\nhttp://skyrim.nexusmods.com/mods/25283\r\nhttp://skyrim.nexusmods.com/mods/25316\r\n\r\nBest of all, you can never lose your stuff! As long as you leave the GeneralStores.esm activated it holds all your stuff safely regardless of whether you keep this or any other General Stores mod installed. Mix and match all of them to your heart\\'s content, or make your own! Tons of mods for different made from scratch or vanilla homes are already available. Since you need it for this mod anyway, you can read all about Harvey2112\\'s General Stores at\r\n\r\nhttp://skyrim.nexusmods.com/mods/18340\r\n\r\nPlease endorse him while you are there.\r\n\r\nThe activators added are:\r\n\r\nScrolls - bookcase by the front entrance\r\nBooks and papers - 1st floor at stairwell\r\nGeneral chest - 1st floor alcove\r\nFood pot - kitchen\r\nStolen items lockbox - 2nd floor bedroom above safe\r\nTreasures lexicon - 2nd floor bedroom next to shelf\r\nArmor dummy - next to the other armor dummies in the basement\r\nWeapon rack - near the other weapon racks in the basement\r\nSmithing chest - near the weapon racks across from the vanilla ingots\r\nPotion shelf - hallway near the basement exit\r\nIngredient shelf - hallway near the basement exit\r\nSoulstone rack - near the enchanter\r\n\r\nThe activators are the only things added, nothing is taken away, and they shouldn\\'t clip with anything in any state of house upgrade aside from the occasional spider web.",
  "categoryId": "67",
  "version": "1.0",
  "author": "elGrecoLoco",
  "createdUnix": "1349745326",
  "updatedUnix": "1349745451",
  "containsAdultContent": false,
  "uploadedBy": "elGrecoLoco",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92863",
      "name": "GeneralStores-Proudspire1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "GeneralStores-Proudspire1_0-25236-1-0.zip",
      "uploadedUnix": "1349745451",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a30ebea499412706a745871cabb2bf3dfa4183cf7b564165f0851efab6db7d86/analysis/1407210856/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GeneralStores-Proudspire1_0-25236-1-0.zip?fid=92863&ttl=1535796641&ri=8192&rs=8192&setec=90a68624ede830cb3319ae61330aac18"
    }
  ]
}