{
  "modId": 25239.0,
  "modName": "Berts Hearthfire Dairy Goods Upgrade",
  "summary": "An upgrade for the dairy goods side of the Hearthfire DLC.",
  "descriptionHtml": "[u]Berts Hearthfire Dairy Goods Upgrade[/u]\r\n[url=http://skyrim.nexusmods.com/mods/38483/]Polish Add-on[/url] by Hegemont\r\n(Requires this mod be installed first! )\r\n\r\n-------------------------------------------------------------------------------------------------\r\nOther Mods By Me!\r\n\r\n[url=http://skyrim.nexusmods.com/mods/15801]Berts Breezehome Cellar[/url]\r\nAdds an open (no loadscreen) cellar to Breezehome with a full set of crafting and smithing tools plus displays for armour, weapons, dragon masks and dragon claws!\r\n\r\n[url=http://skyrim.nexusmods.com/mods/8922]Berts Breezehome Remodeled[/url]\r\nA full remodel of Breezehome including interior, exterior and cellar & so much more!\r\n\r\n[url=http://skyrim.nexusmods.com/mods/15806]Berts Breezehome Garden[/url]\r\nA new garden grotto added to Whiterun available as a standalone or connected to the vanilla Breezehome & is also pre-packed with my Cellar & Remodeled mods.\r\n\r\n[url=http://skyrim.nexusmods.com/mods/29665]Remo\\'s Display Spells[/url]\r\nA collection of spells aimed specifically at making your house a home.\r\n\r\n-------------------------------------------------------------------------------------------------\r\n\r\nThis mod uprades the dairy goods side of the Hearthfire DLC.\r\nIt makes all standard cows and domesticated goats milkable (fully animated).\r\nDomesticated goats give 1 jug of goat milk when milked and all dead goats (domesticated & wild) can be looted for a jug of goat milk as well (the chance of you catching a wild goat and milking it is slim so I didn\\'t bother!).\r\nDead cows can now be looted for Rennet which is used in cheese making.\r\n\r\nThe milk churns in the Hearthfire houses have been changed to crafting milk churns (semi animated) at which you can make:\r\nButter: 1 jug of milk + 1 salt pile\r\nRaw Eidar Cheese Wheel: 1 Rennet + 1 Salt Pile + 2 Jugs of Milk\r\nRaw Goat Cheese Wheel: 1 Rennet + 1 Salt Pile + 4 Jugs of Goat Milk\r\n\r\nRaw cheese wheels are then placed on a maturing shelf for 3 game-days untill ready.\r\n\r\nRennet & Goats milk can also be bought from inns, if they have any in stock.\r\n\r\nThe goats and cows do not tell you they can be milked, just activate them and you\\'ll either begin milking or be told they have already been milked, come back tomorrow.\r\n\r\nI have slightly altered the properties of the cheeses to make them worth getting/carrying/making/eating for lower level characters:\r\n\r\n\r\n------------------------Eidar----Goat\r\n\r\nWedge\r\nRestore Health-----5-----------5\r\nRestore Stamina---0-----------5\r\nWeight--------------0.33------0.66\r\nGold------------------4----------7\r\n\r\nSliced Wheel\r\nRestore Health-----15-----15\r\nRestore Stamina----0------15\r\nWeight---------------1.0----2.0\r\nGold------------------10-----18\r\n\r\nFull Wheel\r\nRestore Health-------20-----20\r\nRestore Stamina-----0------20\r\nWeight----------------1.5----3.0\r\nGold-------------------18-----35\r\n\r\nIf you use any other mods that change the attributes of the cheeses ensure that the version you wish to use is lower in your load order in the <Data> section of your Skyrim launcher!\r\n\r\nMany thanks to  IsharaMeradin for her easy-to-follow guide for 1st/3rd person checking!\r\nhttp://skyrim.nexusmods.com/mods/25936#content\r\nAnd for jiggling the OnLoad/OnActivate part of the milking script!\r\n\r\nNote: Any other mod that changes cows, goats, the milk churns or cheeses may conflict, be sure to check each thoroughly!\r\n\r\nberticus0001 ;-)\r\n\r\n-------------------------------------------------------------------------------------------------\r\n[u]Resources & Settings[/u]\r\n\r\nFor modders who want to use the scripts etc this resources pack includes a more extensive version of the cheese maturing scripts, or use the ones from the full mod above\\'s  .bsa.\r\n\r\nThis version does not require Hearthfire to be installed!\r\n\r\nMods that use these scripts:\r\n[url=http://skyrim.nexusmods.com/mods/25439]Bridge Farm by gentester[/url]\r\nWinner of the SKYRE farm contest and main instigator for creation of the scripts!\r\nUses the cow milking script only!\r\n\r\n\r\nHeres a list of the included scripts and a quick description of how to set them up and what they do!\r\n\r\n;--------------------------------------------------------------------\r\nCow Milking:\r\n\r\nScript:\r\nzz01scrpt_hf_cowmilking\r\n\r\nSetup:\r\nPlace the script on a custom cow actor, set the settings and populate your mod with your cows.\r\n\r\nMy Settings:\r\nBucket: - Bucket01 (The bucket that appears under the cow)\r\nBYOHFoodMilk - If your using this on a mod with Hearthfire as a master you can just hit Auto-Fill, else point this to your Milk potion (The food item you get for milking: Jug of Milk)\r\nDaysToWait - 1.00 (=24hrs \\'till you can milk this cow again)\r\nFailureMessage - This cow has already been milked today, try again tomorrow! (what you\\'re told if you haven\\'t waited long enough)\r\nHowManyMilkPer - 1 (How many jugs of milk you get per milking)\r\nIdleStop_Loose - Auto-Fill (Stops the animation playing)\r\nMilkingSound - AMBWaterChurnLP (A nice water/squirty sound)\r\nWhatYouGot -1 Jug of Milk Added (The notification that pops up in the corner of the screen after milking)\r\nXMarker - Auto-Fill (An XMarker to aim the player)\r\n\r\n\r\n;--------------------------------------------------------------------\r\nChurn:\r\n\r\nScripts:\r\nzz01scrptchurnrun\r\nzz01defaultactivatelinkedref \r\n\r\nSetup:\r\nAs the churn is furniture it doesn\\'t need any scripts, just duplicate any piece of furniture (eg, chair, any crafting bench etc.) and replace the .nif with the enclosed churn .nif (churnfrn.nif) then create a new <Keyword> to link to your new cheese recipes and apply that along the other furniture keywords to the churn.\r\nNext select the churn in the render window and create a new trigger called churnhandle or something you can recognize and assign it the churn handle .nif (handle01.nif), give it the same name as the churn and attach the script zz01defaultactivatelinkedref to it. This is a customized script that will activate it\\'s linked reference whenever the handle is activated, the ones that come with the game are a bit of a pain sometimes and will often either only work once, or not at all!!\r\nClick OK to finish the new trigger then once back on the render window double-click the new trigger and in it\\'s <Primitive> tab select <Player Activate> and set the <Primitive> drop-down box to <None>, hit OK and then middle-mouse click the render window to make it active and press F5, wait a moment while the render screen refresh\\'s itself and you\\'ll now have the churn handle in place. Double click the handle once more and in the <Linked Ref> tab connect it to the churn, this is so activating the handle will automatically activate the churn, else you have to look down to find the churn!\r\nNow you need to drag an XMarker into the window and using the x, y, z coordinates from the handle place the XMarker at it\\'s base (you want to move the handle down to the lowest point in it\\'s animation first!), this Xmarker will designate the lowest point of the handle as it\\'s movement is animated. Now duplicate the XMarker and move it up till there is a small gap between the two, this will be the top of the handles movement!\r\nNow go back to the churn and add the script zz01scrptchurnrun and in it\\'s setting link it to the handle and both XMarkers and set the audio. Included in here is the option to get two things from one crafting, eg butter & buttermilk from one milk, to use this you will need to create a new food that has a double object .nif, then create a Formlist that has this double object in and attach the formlist and the two separate objects (butter and buttermilk) in the appropriate slots. Now when you create the double object in the churn, when you exit the churn the script will automatically check you for the double object(s) and switch them for the separates!\r\nI think that covers everything for that, check the example mod to see how it all connects together, the example uses ale instead of milk and the Eidar cheese wheel is the example double object, so when you make them you\\'ll have them switched for two of my custom cheeses to show how that works!\r\n\r\nThe settings for this are mostly just pointing to each part of the whole, handle, XmarkerUp, XMarkerDown etc.\r\nThe player animation for this is a bit naff, there\\'s just nothing that exists in-game that works for it except the first part of the smithing animation where you pull the bellows rope, unfortunately I can\\'t separate that animation from the rest of the smithing (working the anvil, quenching the ingot etc.) so I\\'ve gone for a generic leaning on the counter animation. Check the example for the list of furniture keywords.\r\n\r\n;--------------------------------------------------------------------\r\nMaturing/Ageing:\r\n\r\nScripts:\r\nzz01scrptmaturing01startx\r\nzz01scrptmaturing02phantommenu\r\nzz01scrptmaturing03maturing\r\nzz01scrptmaturing04final\r\n\r\nSetup:\r\nThe maturing scripts are built expecting 3 custom/maturable cheeses with 4 strengths per cheese type, though they can be used for ageing wine or anything else you want to have change over time.\r\nTo start with you\\'ll need to create your 12 .nifs (3 types x 4 strengths) as clutter objects for use as in-game cheeses (or wines), next you\\'ll have to create 12 duplicate versions set as static for display during the maturing process.\r\nLastly you\\'ll need a \\\"Phantom\\\" .nif for the initial activator (see mine in the example).\r\nCreate the food versions of your objects using the standard clutter versions then create triggers of each using the static nifs and also a trigger for the static \\\"Phantom\\\". Next put the food version into Formlists, each type must have it\\'s own, then do the same for the static trigger versions but in this case add the \\\"Phantom! at the start of each list.\r\nHere\\'s an example of what the lists should look like:\r\n\r\nFood_RedCheeseList\r\n---RedCheese01\r\n---RedCheese02\r\n---RedCheese03\r\n---RedCheese04\r\n\r\nTRGR_RedCheeseList\r\n---STC_Phantom01\r\n---STC_RedCheese01\r\n---STC_RedCheese02\r\n---STC_RedCheese03\r\n---STC_RedCheese04\r\n\r\nOnce your lists are done drag an XMarker to the position you want you maturing points to be and add the maturing01startx script to it. Now add the maturing02phantommenu script to the static trigger \\\"Phantom\\\" base object, add the script maturing03maturing to the static \\\"cheeses\\\" 01, 02 & 03 base objects and finally add the final script maturing04final to static \\\"cheese\\\" 04 base object.\r\n\r\nSettings:\r\nzz01scrptmaturing01startx\r\nThis script only has one setting that needs any of the static trigger formlists\r\n\r\nzz01scrptmaturing02phantommenu\r\nThis script needs each of the formlists to be inserted in the settings along with 2 message boxes, 1 for what type of cheese (wine) to place and 1 for what strength. It also has a setting where you need to put the text of what is shown when you don\\'t have the cheese/strength you selected.\r\n\r\nzz01scrptmaturing03maturing\r\nThis scripts settings include, what potion/food this cheese (wine) is, how many days to wait before this strength matures to the next strength, the formlist for the current cheese(wine) static trigger type and the number of the NEXT strength in the formlist.\r\n\r\nzz01scrptmaturing04final\r\nThis final script just needs to know what the food/potion it is and what static trigger formlist it comes from.\r\n\r\n;--------------------------------------------------------------------\r\n\r\nA few notes\r\n\r\nAs stated at the top, the example mod does not require Hearthfire so there is no milk! Anything that should point to milk (cow milking/the churn) will give/require ale!\r\nDo NOT place the first of the maturing scripts on the base object of the XMarker, it should only be placed on the marker in the render window, or you could duplicate the xmarker!\r\n\r\nThe maturing process is an OnCellLoad event as it needs the event to trigger the swapping of the cheeses (including the first time it\\'s run to place the phantom, so you must be out of the cell/worldspace when installing), but thanks to IsharaMeradin the cowmilking is no longer OnCellLoad so if your just pottering around the farm for a whole day you don\\'t have to travel away and back just for the cows to be re-milkable!\r\nMany thanks for that!!!\r\n\r\nMooo!!!\r\nbert;-)\r\n\r\n",
  "categoryId": "78",
  "version": "1.0",
  "author": "berticus0001",
  "createdUnix": "1349749251",
  "updatedUnix": "1358119045",
  "containsAdultContent": false,
  "uploadedBy": "berticus0001",
  "primaryFile": null,
  "files": [
    {
      "fileId": "94778",
      "name": "Berts Hearthfire Dairy Resources Plus Example Mod",
      "version": "BHFR.1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "126",
      "fileName": "Berts Hearthfire Dairy Resources Plus Example Mod-25239-BHFR-1-0.7z",
      "uploadedUnix": "1350738098",
      "modVersion": "BHFR.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b2c4a68dcec540005ad282e7ba1ebc22c38fd67436a8e7689bbfe7cf347d108d/analysis/1407229743/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Berts%20Hearthfire%20Dairy%20Resources%20Plus%20Example%20Mod-25239-BHFR-1-0.7z?fid=94778&ttl=1535796649&ri=8192&rs=8192&setec=94247b11a18d60cde0c2eadbf9cfd748"
    },
    {
      "fileId": "1000002136",
      "name": "Berts Hearthfire Dairy Goods Upgrade",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "231",
      "fileName": "Berts Hearthfire Dairy Goods Upgrade-25239-1-0.7z",
      "uploadedUnix": "1358119045",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d94c132120ece5599b4818ad01f52e72984b9f48f6b8166c1bc9579e776ae6b5/analysis/1407351906/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Berts%20Hearthfire%20Dairy%20Goods%20Upgrade-25239-1-0.7z?fid=1000002136&ttl=1535796649&ri=8192&rs=8192&setec=6dd53e03df35aefd0a578bc030a9b199"
    }
  ]
}