{
  "modId": 25244.0,
  "modName": "SkyRe - Royal Elven Armor",
  "summary": "SkyRe compatible Royal Elven Armor by theRoadstoker",
  "descriptionHtml": "This page hosts 2 mods. They are both ESP files and REQUIRE you to have installed SkyRe as well as Royal Elven Armor and its patches first. Load this mod after the Royal Elven Armor mod!\r\n\r\nRequired: http://skyrim.nexusmods.com/mods/9286\r\nRequired: http://skyrim.nexusmods.com/mods/25083/\r\n\r\nThe first Esp (ArmourMark1) adds completely new recipes and changes the stats to reflect the gear as if it was all gilded. It also adds breakdown and tempering recipes and deletes the elven wood and subsequent chest in Riverwood. This departs from the original intent but makes the armors more fair to use.\r\n\r\nThe second Esp (ArmourMark2) keeps the stats and recipes of the original, but still requires elven smithing for tempering, only fixing tempering. Due to the nature of crafting the items, there will be no breakdown recipes. It leaves the original elven wood and chest.\r\n\r\nOnly install one version and do so after Royal Elven Armor.\r\n\r\nIf you have any problems or questions please contact me!\r\n\r\nFAQ\r\nQ: Can you make a SkyRe patch/other mod for this?\r\nA: I am always happy to do this for anyone, but do not ask me, tell the owner/creator of the mod he should tell me. I do not do anythign without the origonal authors permission, so ask them to give it to me and I will be more than happy to. \r\n\r\nQ: Can you make a mod for me like this?\r\nA: Depends. I am terrible with texture/models/animations so if it requires me to make those, no, otherwise, maybe. If it is me changing a patch to reflect stats you find more appropriate, I will see if you are right and will likely post a follow up patch.\r\n\r\nQ: Should I endorse stuff you make?\r\nA: While you should endorse every mod you like, it does a great injustice to everyone if you have not first endorsed the mod authors whose work I am using, endorse them first!\r\n\r\nQ: Can I tag your work?\r\nA: Please!\r\n\r\nQ: Can I link to or otherwise modify your work?\r\nA: The ESP file is mine, I rebuild them from scratch, so modify them for personal use only. Else, contact the uploader of the mod I am editing, they own all the textures and cool stuff!\r\n\r\nCredits:\r\ntheRoadstroker for making the mod! He owns the mod and related images, not me!\r\nT3nd0 for making SkyRe and his help in making this.\r\nSkyrim Nexus for hosting this.\r\nBethesda for stealing my life.",
  "categoryId": "54",
  "version": "1.10",
  "author": "TehFrederick",
  "createdUnix": "1349754870",
  "updatedUnix": "1349756223",
  "containsAdultContent": false,
  "uploadedBy": "TehFrederick",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92886",
      "name": "ArmourMark1",
      "version": "1.10",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "ArmourMark1-25244-1-10.rar",
      "uploadedUnix": "1349755597",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/72a2b19a7314e6e377ef4e3de4517914d10eed573cceb81aa052d86d52d7c70d/analysis/1407211118/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArmourMark1-25244-1-10.rar?fid=92886&ttl=1535796655&ri=8192&rs=8192&setec=e084d6becef8ef16e35b37f0daa5cea8"
    },
    {
      "fileId": "92887",
      "name": "ArmourMark2",
      "version": "1.10",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "ArmourMark2-25244-1-10.rar",
      "uploadedUnix": "1349756223",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/4891d25e9c57d06fd9203a17c56b70dddc9db3ab09e7ae969ab4ed9fd0a7b9f8/analysis/1407211119/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArmourMark2-25244-1-10.rar?fid=92887&ttl=1535796655&ri=8192&rs=8192&setec=91635af75f01c9a1ce58663f5e52bf70"
    }
  ]
}