{
  "modId": 25257.0,
  "modName": "The Aedras Six",
  "summary": "This mod adds Four magic items to the game, and two Powers. Buy or steal them from a new merchant in the exterior area of Sky Haven Temple. Among other things that are useful, you can buy all six fun, useful, and powerful magic items, for your own use.",
  "descriptionHtml": "Aedra is the name of the divines who create life in the world, they were later named the Eight Divines. Long ago, The Divine Akatosh challenged Venorth, a Daedric lord to a duel, and beat him, then used the Daedra\\'s power to create six powerful items.\r\nThis mod adds Four magic items to the game, and two Powers. Buy or steal them from a new merchant in the exterior area of Sky Haven Temple. Among other things that are useful, you can buy the six items:\r\n\r\nSword of Giant\\'s Strength:\r\nHarnesses the power of a Giant, and hurls everything in your path away. (Even Giants!) Model is an ebony sword. XX0022F8 Base ID code, XX being the position in your mod load list.\r\n\r\nStaff of Miguellean:\r\nBlasts of lightning fly from this staff, anyone or anything it hits will have constant sparks on them for a while. Pushes back any actors it it\\'s way. XX000D63 Base ID\r\n\r\nBow Of Akatosh\\'s Force:\r\nChanges any arrows that it shoots, into arrows that use the Venorath\\'s power, and throws back any creatures that you shoot. (Only works on them when they aren\\'t still getting up.) XX003328 Base ID.\r\n\r\nShield of Warding:\r\nBlocking with this Ebony shield will put up a ward, protecting you. If you block in combat, it will also electrify any who come near you, if used outside of combat, only the harmless ward appears. XX003DFA\r\n\r\nLight of Akatosh:\r\nA Power that summons Venorath, the Daedric lord of Destruction, to do your bidding. Daedra can not die, so Akatosh forever bound him to do good.\r\n\r\nPower of Paralysis:\r\nA Power that stuns anyone for a very long period of time.\r\n\r\nKelraag Finedealer found these in a long forgotten Nord Ruin, which was a temple to Akatosh.\r\n\r\nWatch a amazing video by JJstudios: http://www.youtube.com/watch?v=nVysxeg0OMM\r\n\r\nYou could also download this mod on the steam workshop here: http://steamcommunity.com/sharedfiles/filedetails/?id=101254889\r\n\r\nUpdate 1.1 - Changed names of items to fit the Lore of Tamriel.\r\n\r\nDon\\'t forget to Endorse if you like, also, i\\'d appreciate any comments, with suggestions, errors or whatever.",
  "categoryId": "55",
  "version": "1.1",
  "author": "Thuynder",
  "createdUnix": "1349797935",
  "updatedUnix": "1349798289",
  "containsAdultContent": false,
  "uploadedBy": "Thuynder",
  "primaryFile": null,
  "files": [
    {
      "fileId": "92953",
      "name": "The Aedras Six",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26",
      "fileName": "The Aedras Six-25257-1-1.7z",
      "uploadedUnix": "1349798289",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/96e65e81736bb80db88c2a829a6d7baa2e8d7cd4cc166665cce75838d55c00c9/analysis/1407211753/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Aedras%20Six-25257-1-1.7z?fid=92953&ttl=1535796672&ri=8192&rs=8192&setec=4f12ce28cae948c6fe0965b424a7145e"
    }
  ]
}