{
  "modId": 25275.0,
  "modName": "powered by PERKELE armor",
  "summary": "",
  "descriptionHtml": "I\\\\\\\\\\\\\\'m creating new unique armorset called \\\\\\\\\\\\\\\"powered by Perkele!\\\\\\\\\\\\\\\" -armor\r\n\r\nI don\\\\\\\\\\\\\\'t know what is wrong with this helmet nif... it would be wonderful if someone could tell me how to get this working.\r\n\r\n\r\n\r\nThe name Perkele is of Indo-European origin. Related gods from other areas are Perk?nas (Lithuania), P?rkons (Latvia), Percunis (Prussia), Piarun (Belarus), Peko or Pekolasõ (Estonia) and Perun (Bulgaria, Croatia, Czech republic, Poland, Russia, Ukraine, Serbia, Slovakia, Slovenia).\r\n\r\nPerkele is the god associated with thunder in Finnish mythology, like Thor of Norse mythology. In modern Finnish perkele is a common swearword.\r\nContents\r\n\r\nAs \\\"Perkele\\\" is the no so original name for \\\"Ukko\\\", it has a history of being used as a curse: a cry for the god for strength. It still is a common curse word in vernacular Finnish. To a Finn, the word entails seriousness and potency that more lightly used curses lack. Also, when the Research Institute for the Languages of Finland held a popular contest to nominate the \\\"most energizing\\\" word in the Finnish language, one of the suggestions was Perkele because \\\"it is the curse word that gave the most strength for the reconstruction of Finland after the wars.\\\" However, the popular vote was won by the word \\\"Aurinko\\\", sun.\r\n\r\nMany Finnish heavy metal bands like Impaled Nazarene and Norther use the word perkele for emphasis and to reference Finnishness. The Swedish Oi! band Perkele is also named after the Finnish swear word.\r\n\r\nIn Star Trek IV: The Voyage Home a Finnish whaler can be heard exclaiming \\'Perkele!\\' after the Klingon Bird of Prey decloaks ahead of the whaling vessel.\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "54",
  "version": "",
  "author": "Jussi138",
  "createdUnix": "1349830688",
  "updatedUnix": "1349830861",
  "containsAdultContent": false,
  "uploadedBy": "Jussi138",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93030",
      "name": "perkele helm",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "230",
      "fileName": "perkele helm-25275-.rar",
      "uploadedUnix": "1349830861",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/161f8a55b4dbe9b52cfe0b72b75d0f3553d02552775ddaaee8f7cae05727ca74/analysis/1407212645/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/perkele%20helm-25275-.rar?fid=93030&ttl=1535796688&ri=8192&rs=8192&setec=84e6e1a1b51f53fa0268679fa2f0a2fd"
    }
  ]
}