{
  "modId": 25283.0,
  "modName": "General Stores - Honeyside",
  "summary": "This adds base General Stores activators throughout Honeyside in Riften, to autosort and safely store all your items and let you access them from any other General-Stores enabled home. General Stores required! Get it at http://skyrim.nexusmods.com/mods/18340",
  "descriptionHtml": "===Version 1.1 uploaded! Moved some activators for better compatibility with Hearthfire, please see the changelog at the end.===\r\n\r\nThis mod adds General Stores, autosorting storage activators by the amazing Harvey2112, to Honeyside in Riften without removing or changing anything else. For those who are not familiar with General Stores, it\\'s like cloud storage for your Skyrim items. Let each activator automatically sort and store all your inventory and you can access it from any other General Stores addon, such as my similar mods for Breezehome in Whiterun, Proudspire in Solitude, and Vlindrel Hall in Markarth at:\r\n\r\nhttp://skyrim.nexusmods.com/mods/25282\r\nhttp://skyrim.nexusmods.com/mods/25236\r\nhttp://skyrim.nexusmods.com/mods/25316\r\n\r\nBest of all, you can never lose your stuff! As long as you leave the GeneralStores.esm activated it holds all your stuff safely regardless of whether you keep this or any other General Stores mod installed. Mix and match all of them to your heart\\'s content, or make your own! Tons of mods for different made from scratch or vanilla homes are already available. Since you need it for this mod anyway, you can read all about Harvey2112\\'s General Stores at\r\n\r\nhttp://skyrim.nexusmods.com/mods/18340\r\n\r\nPlease endorse him while you are there.\r\n\r\nThe activators added are:\r\n\r\nScroll shelf - to the right above the stairs\r\nBooks and papers- on top of scroll shelf\r\nGeneral chest - to the left of the stairs down\r\nFood pot - kitchen on hearth\r\nStolen items lockbox - on top of scroll shelf\r\nTreasures lexicon - top of stairs next to general chest\r\nArmor dummy - to the right at the top of the stairs down\r\nWeapon rack - top of stairs\r\nSmithing shelf - top of stairs\r\nPotion shelf - bottom of stairs\r\nIngredient shelf - bottom of stairs\r\nSoulstone rack - in basement next to door to enchanting room\r\n\r\nThe activators are the only things added, nothing is taken away, and they shouldn\\'t clip with anything in any state of house upgrade aside from the occasional spider web.\r\n\r\nChangelog\r\n--------------\r\n1.1 --- Shuffled a lot of activators around for better aesthetics and Hearthfire compatibility.  Potions have joined ingredients at the bottom of the stairs, soulstone stand moved outside enchanting room, general chest moved upstairs (and nudged the treasure lexicon over a bit), armor stand upstairs, scrolls moved to previous bookshelf area, books and lockbox now on top of scrolls.  Also corrected a dirty edit of mist effects I accidentally slid around while placing activators.\r\n1.0 --- First release",
  "categoryId": "67",
  "version": "1.1",
  "author": "elGrecoLoco",
  "createdUnix": "1349845169",
  "updatedUnix": "1350081609",
  "containsAdultContent": false,
  "uploadedBy": "elGrecoLoco",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93062",
      "name": "GeneralStores-Honeyside1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "GeneralStores-Honeyside1_0-25283-1-0.zip",
      "uploadedUnix": "1349845234",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5d5816f45d277501952bf1c86b87eac81792d52e51f30f4f7d457857e6241874/analysis/1407212944/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GeneralStores-Honeyside1_0-25283-1-0.zip?fid=93062&ttl=1535796705&ri=8192&rs=8192&setec=0e8f6a5d5a551ed4d1ab5310aa17614b"
    },
    {
      "fileId": "93545",
      "name": "GeneralStores-Honeyside1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "GeneralStores-Honeyside1_1-25283-1-1.zip",
      "uploadedUnix": "1350081609",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6b63b9844ccc32cea4d9f1053a95ac9259117290169635aacd0fc06d53415f24/analysis/1407218409/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GeneralStores-Honeyside1_1-25283-1-1.zip?fid=93545&ttl=1535796706&ri=8192&rs=8192&setec=8975f71e0ed6325b1f978e1606dce397"
    }
  ]
}