{
  "modId": 25282.0,
  "modName": "General Stores - Breezehome",
  "summary": "This adds base General Stores activators throughout Breezehome in Whiterun, to autosort and safely store all your items and let you access them from any other General-Stores enabled home. General Stores required! Get it at http://skyrim.nexusmods.com/mods/18340",
  "descriptionHtml": "===Version 1.1 uploaded!  Moved some activators for better compatibility with Hearthfire and basement mods, please see the changelog at the end.===\r\n\r\nThis mod adds General Stores, autosorting storage activators by the amazing Harvey2112, to Breezehome in Whiterun without removing or changing anything else.  For those who are not familiar with General Stores, it\\'s like cloud storage for your Skyrim items.  Let each activator automatically sort and store all your inventory and you can access it from any other General Stores addon, such as my similar mods for Proudspire in Solitude, Honeyside in Riften, and Vlindrel Hall in Markarth at:\r\n\r\nhttp://skyrim.nexusmods.com/mods/25236\r\nhttp://skyrim.nexusmods.com/mods/25283\r\nhttp://skyrim.nexusmods.com/mods/25316\r\n\r\nBest of all, you can never lose your stuff!  As long as you leave the GeneralStores.esm activated it holds all your stuff safely regardless of whether you keep this or any other General Stores mod installed.  Mix and match all of them to your heart\\'s content, or make your own!  Tons of mods for different made from scratch or vanilla homes are already available.  Since you need it for this mod anyway, you can read all about Harvey2112\\'s General Stores at \r\n\r\nhttp://skyrim.nexusmods.com/mods/18340\r\n\r\nPlease endorse him while you are there.\r\n\r\nThe activators added are:\r\n\r\nScrolls - top shelf right side by the front entrance\r\nBooks and papers - bottom shelf right side by the front entrance\r\nGeneral chest - second floor hallway between weapon rack and bedroom\r\nFood plate - kitchen table\r\nStolen items lockbox - top shelf left side by the front entrance\r\nTreasures lexicon - to the left next to the shelf by the front entrance\r\nArmor dummy - next to vanilla weapon rack on first floor\r\nWeapon rack - on right side, same wall as existing weapon rack but across the shelf near the kitchen\r\nSmithing shelf - first floor to the left of the stairs\r\nPotion shelf - first floor to the left of the stairs\r\nIngredient satchel - top shelf left side by the front entrance\r\nSoulstone stand - to the right of the shelf on your left as you enter\r\n\r\nThe activators are the only things added, nothing is taken away, and they shouldn\\'t clip with anything in any state of house upgrade aside from the occasional spider web.\r\nI don\\'t have Hearthfire yet but there is a deleted walkmesh bug with it that can cause CTDs with all Breezehome mods, keep this in mind if either Bethesda or the unofficial patch hasn\\'t fixed it yet.\r\n\r\nChangelog\r\n--------------\r\n1.1 --- Added enchanting storage (how did I miss that?), moved the general chest upstairs and moved the alchemy storage to the entryway shelf (and changed the stolen goods lockbox to make room) for better compatibility with Hearthfire and basement mods.\r\n1.0 ---  First release",
  "categoryId": "67",
  "version": "1.1",
  "author": "elGrecoLoco",
  "createdUnix": "1349841627",
  "updatedUnix": "1350075624",
  "containsAdultContent": false,
  "uploadedBy": "elGrecoLoco",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93055",
      "name": "GeneralStores-Breezehome1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "GeneralStores-Breezehome1_0-25282-1-0.zip",
      "uploadedUnix": "1349841702",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/eadb591b169426bac5b10def0685953da2c11d7e4d64d7e7eecd299bd33dbcb3/analysis/1407212942/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GeneralStores-Breezehome1_0-25282-1-0.zip?fid=93055&ttl=1535796703&ri=8192&rs=8192&setec=955efdf866b7c56cb4aa4c00a4892993"
    },
    {
      "fileId": "93524",
      "name": "GeneralStores-Breezehome1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "GeneralStores-Breezehome1_1-25282-1-1.zip",
      "uploadedUnix": "1350075624",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c0751784b0f6576cffdf59eacb2dca29bbd6e7f317043b44731f090910f69b2c/analysis/1407218225/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GeneralStores-Breezehome1_1-25282-1-1.zip?fid=93524&ttl=1535796704&ri=8192&rs=8192&setec=e774a40b893da5f899c8dd973d7ab3a3"
    }
  ]
}