{
  "modId": 25315.0,
  "modName": "XCE Dawnguard Vampire Face Fix",
  "summary": "Fixes the massive discoloration between XCE Head and Body in Dawnguard",
  "descriptionHtml": "Xenius is a god, he has made some of my favorite texture pack that have yet to be matched here on Nexus, well, long as you want to stay Vanilla and not have massive gazzongas or nude mods.\r\nAlso anyone who knows what causes these issues in NPCs goign greyface (official content) please, let me know :)\r\n\r\n[IMG]http://i641.photobucket.com/albums/uu140/edg3k/2012-10-11_00001_zpsb203ef0b.jpg[/IMG]\r\n\r\nAnyway, with Dawnguard we got many new fantastic changes, including an entire change of the Vampire races, while welcome it and the patches (official and unofficial) led to some issues.\r\nNamely mismatched head & bodies.\r\nIve suffered from this one the last few days and I swear to god its driven me nuts. Ive tried everything but I couldnt find the cause, so I gave up and fixed at least one minor issue.\r\nThis is a single file that can be installed, over Xenius Dawnguard file to replace the femaleheadvampire.dds creating a better match with XCE body texture, Detailed Bodies. It doesnt fix all the problems with the mismatched skin tones but its a small step closer. I\\'m working on a better version or in the long run, finding out what the hell causes the Vampire Thralls to keep their vanilla faces instead of the proper Vampire ones (all races not just humans)\r\nAnyway, if you have XCE and Xenius Dawnguard then this might help you fix your issue if its as extreme as mine.\r\n\r\nEnjoy and Endorse XCE, hes the man.\r\n\r\nVersion 2 with corrected pathing.",
  "categoryId": "29",
  "version": "2.0",
  "author": "Edg3",
  "createdUnix": "1349915607",
  "updatedUnix": "1350334902",
  "containsAdultContent": false,
  "uploadedBy": "Edg3k",
  "primaryFile": null,
  "files": [
    {
      "fileId": "94067",
      "name": "Xenius Dawnguard Vampire Tweak",
      "version": "V2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1922",
      "fileName": "Xenius Dawnguard Vampire Tweak-25315-V2.rar",
      "uploadedUnix": "1350334902",
      "modVersion": "V2",
      "virusScanUrl": "https://www.virustotal.com/file/a1155d7014bf5a21c6d727be2768f124727105b745394d13c3af89fd8d232aee/analysis/1407223808/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Xenius%20Dawnguard%20Vampire%20Tweak-25315-V2.rar?fid=94067&ttl=1535796741&ri=8192&rs=8192&setec=6cbc9de1ca396d7a0101c59fa92c8d25"
    }
  ]
}