{
  "modId": 2531.0,
  "modName": "AntiFREEZE performance patch 9 ENBSeries",
  "summary": "Bugfix for graphic, freezing, bsods, some performance inssues, fps limiter and counter, etc",
  "descriptionHtml": "BY LAST UPDATE OF LICENSE, BINARY FILES REMOVED FROM PATCH\r\n\r\n[color=red]same version, but with graphic modification included (ENBSeries 0.100) is available[/color]\r\n\r\nOlder version is here:\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=953\r\n\r\n[b]Updates and my other mods:[/b]\r\n[color=yellow]http://enbdev.com[/color]\r\n\r\n[b]Tested with game 1.1, 1.2, 1.3 versions and they all require this to run much more stable[/b]\r\n\r\n\r\n[b]!!!WARNING!!![/b]\r\n[color=green]*[/color] This patch DOES NOT affect your game in bad way anyhow and do not modify game files, you can remove it at no cost, any time. Please, do not speculate regarding things you don\\'t know.\r\n\r\n[color=green]*[/color] Patch can be used with other d3d9.dll files together. To do this, read this description closer to the end in description of [PROXY] config category (or use docs on my web site).\r\n\r\n[color=green]*[/color] LAA 4GB patch is supported by this one.\r\n\r\n[color=green]*[/color] To increase performance at full, try to set custom DeviceID and VendorID values in enbpatch.ini file (HEX values). You can find such info in google, vendor id are two (AMD or NVidia) and device id a lot (videocard model). Try first to set up powerful videocards from same vendor as your card. For example GeForce 9600 GT vendorid=000010de and deviceid=00000622 (but better use other values).\r\nHere you may find VendorID, DeviceID, DeviceName information for videocard:\r\nhttp://www.pcidatabase.com\r\n\r\n\r\n[b]ADDITIONAL FEATURES:[/b]\r\nFps limiter, fps counter, alternative to vsync slowdown.\r\n\r\n\r\n[b]GAME FIXES:[/b]\r\n[color=green]GRAPHIC[/color] flame from dragons breath, other fire and magix fx invisible, volumetric fog, black dots on the screen or kind of black fence on it, other related to graphics (if you have them). Also it have property to increase quality of shadow texture for reducing \\\"pixelation\\\" (it\\'s not a smooth shadows).\r\n\r\n[color=green]PERFORMANCE:[/color] this patch not increase performance as framerate (only for some WinXP or specific PC, if SpeedHack enabled), but it fix freezing of the game in about 5 seconds when traveling the world. Performance increased for shadow quality \\\"Ultra\\\".\r\n\r\n[color=green]GENERIC:[/color] driver BSODs with extreme quality and not enough video memory is fixed. Some users noticed no black screens and other bsods fixed.\r\n\r\n\r\n[b]IMPORTANT CHANGES:[/b]\r\nVersion #8 changed AntiBSOD to much faster code, it runs even better than without it. Added hotkey for fps counter ([INPUT] category of enbpatch.ini). SpeedHack is now activates some internal optimization, driver and videocard dependent.\r\n\r\nVersion #7 antibsod fix implemented, hope it will help somebody, debugging that cost my hdd health. Added fps limit, fps measure, experimental multihead and multimonitor support (not tested, don\\'t have hardware). Videocard name now can be customized same way as deviceid and vendorid.\r\n\r\nVersion #6 have beta test of memory usage reducer, please activate this feature only after reading included description! Also some minor performance changes in specific locations.\r\n\r\nVersion #4 have optimized performance code, faster than previous. Also you may disable graphic patch and leave only freeze fix. This fix support up to 4 gb memory patched game (largeaddressaware).\r\n\r\n\r\n[b]INSTALLATION:[/b]\r\nUnpack files from archive to game folder (where TES5.exe located). Make sure EVGA, Afterburn or XFire tools are not running.\r\n\r\n[b]RUN:[/b]\r\nStart the game with launcher, because video options must be reconfigured.\r\n\r\n[b]PROBLEMS:[/b]\r\n[color=green]1[/color] Some users have crash on start. First of all it\\'s Steam new protection doing this. Aslo this could be bad display drivers, try to use older or newer. \r\n[color=green]2[/color] Tools like EVGA, Afterburn, XFire and other overlay may be the problem (shut down them).\r\n[color=green]3[/color] Some ATI users have performance impact whatever they change in enbpatch.ini.\r\n[color=green]4[/color] Crossfire or SLI are not supported.\r\n\r\n\r\n[b]Some info about configuring, in short:[/b]\r\n[MULTIHEAD]\r\nForceVideoAdapterIndex=false - if set to true, then you may choose index of videocard or it\\'s display to be active. Experimental feature for multihead cards or multimonitor systems, i don\\'t have hardware for testing this, so try yourself (VideoAdapterIndex=1 for example). Unfortunately, this still useless for Optimus users.\r\nVideoAdapterIndex=0\r\n\r\n[INPUT]\r\nKeyCombination=16 - this is the decimal value of virtual key (VK_SHIFT) for turning on/off something\r\nKeyFPSLimit=36 - decimal value of the virtual key (VK_HOME) to switch on/off fps limiter, use it by pressing together \\\"shift\\\" and \\\"home\\\" keys (default). Other key numbers can be found in msdn for example, convert them from hex to decimal.\r\n\r\n[LIMITER]\r\nWaitBusyRenderer=false - if set \\\"true\\\", allow to fix some lags (potentially mouse lagging), behave like vsync enabled.\r\nEnableFPSLimit=false - you should know what is fps limiter software, turn it on if you need this feature and set next parameter to desired maximal frame rate.\r\nFPSLimit=40.0\r\n\r\n[FIX]\r\nForceSingleCoreCPU= - do not activate this unless all previous parameters changes not helped to fix lags/freezing. Also this may help for single core cpu to run game faster.\r\nIgnoreThreadManagement= - allow Windows to share threads between cores.\r\nIgnoreThreadPriority= - nice solution for reducing some lags and in some situations increase performance (CPU/OS dependent).\r\nFixGraphics= - replace videocard device and vendor id with custom, this disables vendor specific hack of the game which not working properly.\r\nUseDeviceInSafeMode= - don\\'t take in mind, just performance tweak, but may produce crashes if set to \\\"false\\\", in safe mode some invalid calls are not passed to drivers.\r\nThese two are customized videocard descriptors:\r\nDeviceId=00009440\r\nVendorId=00001002\r\nThis new parameter is for setting the name of your card:\r\nDeviceName=GeForce 9600 GT\r\nAntiBSOD=true - by default it set to true now, if something wrong, try to turn it off.\r\n\r\n[PROXY]\r\nEnableProxyLibrary=true - if set to true, then other d3d9 library can be used together with this patch.\r\nInitProxyFunctions=true - required to be true for most third party d3d9 libraries/mods\r\nProxyLibrary=fxaa.dll - file name of some other d3d9.dll, for example fxaa. Also rename other mod file to same string you wrote here.\r\n\r\n\r\nLike it? Donations will be much appreciated, as they allow to spend more time for modding, instead of main job http://enbdev.com/donate_en.htm\r\n\r\nThank you",
  "categoryId": "39",
  "version": "96",
  "author": "Boris Vorontsov",
  "createdUnix": "1322949319",
  "updatedUnix": "1331723247",
  "containsAdultContent": false,
  "uploadedBy": "BorisVorontsov",
  "primaryFile": null,
  "files": [
    {
      "fileId": "43218",
      "name": "Read me information",
      "version": "9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Read me information-2531-9.zip",
      "uploadedUnix": "1331723247",
      "modVersion": "9",
      "virusScanUrl": "https://www.virustotal.com/file/b2940f610b420f96adcacc957dbf3c8a6b6d62aa64411d2cb26cd08979cd594a/analysis/1406748579/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Read%20me%20information-2531-9.zip?fid=43218&ttl=1535756820&ri=8192&rs=8192&setec=ca3a7103024b96a6e2fb77896005cd18"
    }
  ]
}