{
  "modId": 25314.0,
  "modName": "Alfar Race",
  "summary": "A diminutive fairy race for character creation.",
  "descriptionHtml": "*Summary\r\n\r\nThe Alfar are a tiny species of Mer, highly adapted to their forest homes in Skyrim, where they have dwelt since the time of the Snow Elves.  Adept in the arts of herbalism, alchemy and bowcraft, they remain mostly hidden in their deep wilderness groves.\r\n\r\nIn game terms, the race has the standard spread of starting skill bonuses, with Archery as a major skill.  They have a low starting health but a high starting magicka.  They have a constant quickness ability and a daily use invisibility power.  The race also comes with a custom skeleton so your first person perspective will match your character height.  \r\n\r\n*Issues\r\n\r\nSkyrim uses one 1st person skeleton for all races so if you switch to a standard Elder Scrolls race you will still have an Alfar perspective.  To revert to normal height, uninstall my mod.  NMM makes this simple.\r\n\r\nSome clipping in rare instances, particularly on wooden stairs and cart rides.\r\n\r\nCrafting animations don\\'t match up with the stations\r\n\r\nCollision detection on ceilings does not recognize the reduced height.  Sorry no walking under tables :-(\r\n\r\n*Recommended Mods\r\n\r\nHigher Jumping by Volek for getting to those hard to reach places.\r\nhttp://skyrim.nexusmods.com/mods/164\r\n\r\n*Credits\r\n\r\nI owe much to Shubrook because without his Pixies mod to reverse engineer I doubt I would have been able to fix some of the problems with instituting a small size race.\r\n\r\nAlso credit goes to drwee who\\'s tutorial on editing skeleton meshes allowed me to make the necessary changes to implement a first person perspective which matches third person height.\r\n\r\n",
  "categoryId": "34",
  "version": "1.0",
  "author": "madscirat",
  "createdUnix": "1349914335",
  "updatedUnix": "1349914379",
  "containsAdultContent": false,
  "uploadedBy": "madscirat",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93176",
      "name": "Alfar Race",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Alfar Race-25314-1-0.7z",
      "uploadedUnix": "1349914379",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1e1092957aece7783116a5e9fb96fd4b47c7fc3a9b368d2274f2d2f95ec616d0/analysis/1407214265/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alfar%20Race-25314-1-0.7z?fid=93176&ttl=1535796739&ri=8192&rs=8192&setec=2d222b2684576be2f8319db926fce64a"
    }
  ]
}