{
  "modId": 25359.0,
  "modName": "en construccion",
  "summary": "En construccion",
  "descriptionHtml": "[center][img]http://imageshack.us/a/img826/1445/ecosperdidos.png[/img][/center]\r\n\r\nEcos Perdidos es una serie de mods basada en misterios entretenidos y emocionantes, los cuales, al desentrañar secretos, resolver enigmas y alcanzar el conocimiento posible, dan como resultado o recompensa, algo sumamente útil y original sin desequilibrar el juego.\r\nLa recompensa puede ser desde un objeto especial, un perk, magia, cualquier cosa según de que se trate la aventura, pero lo que cualquiera de estos premios tendrán en común es la utilidad.\r\n\r\nComentarios: No es de mi gusto el sistema típico de misiones, con el diario que se actualiza y marca puntos en la \\\"brújula\\\", siempre que sea posible no seguiré ese camino, incluso no creo que sea necesario ya que mi objetivo en esta serie es crear mods interesantes, pero claros y funcionales, es decir que no serán necesarias características de una quest convencional, ademas así me parece mas inmersivo y realista.\r\n\r\n¿Cómo se activa la quest?\r\nLa quest no se activa, simplemente porque no es una quest como cualquier otra, esta es libre en todos los aspectos, sin parámetros fastidiosos que respetar ni modos obligatorios para llevar a cabo los diferentes objetivos. Para comenzar la aventura primero hay que llegar a un \\\"punto de inicio\\\", en donde el mismo entorno dispondrá de la información necesaria para decidir como continuar, a partir de ese momento cada paso que des corre por tu cuenta, los objetos, textos o personajes que encuentres a lo largo de las aventuras te permitirán comprender lo que sucede y como proseguir.\r\n\r\n[center][img]http://imageshack.us/a/img560/4492/bannersnexus2.png[/img][/center]\r\n\r\nEsta es la primer entrega: El plegador espacial.\r\nLa trama se desarrolla entorno a ciertos misterios de la ciencia dwemer/enana; es recomendable haber leído los tres volúmenes de la colección \\\"Enanos, La raza perdida de Tamriel\\\", o al menos el tercero.\r\nPunto de inicio:",
  "categoryId": "35",
  "version": "1.0",
  "author": "DamianQ",
  "createdUnix": "1349997764",
  "updatedUnix": "1349997764",
  "containsAdultContent": false,
  "uploadedBy": "damianq",
  "primaryFile": null,
  "files": []
}