{
  "modId": 25357.0,
  "modName": "Music change",
  "summary": "Just a replacement for the Music.",
  "descriptionHtml": "After some time playing I got bored of the music, so I put some music of my collection, and no, no FF, DQ, but you\\'ll find some rare tracks, and no, no music downloaded from internet, it\\'s not perfect since the game uses random choices to play, like the explore set plays on towns and the exterior, but I had to do something for a change and to share.\r\n\r\nPs: At the intro in the cart the music change abruptly when you arrive to town, the game plays some random music from town or explore set, my bad. \r\n\r\nOk, after I figure out how to record the game, buying the program Fraps, figuring how to convert a video, creating a channel in youtube, uploading the video I\\'m done.\r\n\r\nDue to express solicitude of volnaiskra here it is, now first of all, sorry for the frame rate, I was working, SQL Server is really demanding, while doing that my little brother recorded the game,\r\nhe likes the dark ENB, I don\\'t, playing in a 80\\\" TV it\\'s a pain for my eyes to turn up the light of the TV.\r\nThe first part showcase the menu, then the town a little, then a battle with a dragon, now, this is what I don\\'t like about the awful random music system of Skyrim, the first time plays the explore music, but the next two loads doesn\\'t, I don\\'t like playing in silence, then the music played in the first two rounds, personally I\\'ll use them for fighting with four to six enemies, nothing serious but action demanding, and the third is one of my favorites for - We\\'re for some deep trouble, this is some serious sh.. -, I hope you like it.\r\n\r\nFor the 13 people so far who downloaded please comment just to let know others if it\\'s good, so so or crap.",
  "categoryId": "61",
  "version": "",
  "author": "brankomilenko",
  "createdUnix": "1349989836",
  "updatedUnix": "1349991536",
  "containsAdultContent": false,
  "uploadedBy": "brankomilenko",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93328",
      "name": "Music",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "126333",
      "fileName": "Music-25357-1.rar",
      "uploadedUnix": "1349991536",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/8bd2539ab1650ca54f08f5cca6e304518862eb18d91a513ac4c0f9b275f28452/analysis/1407216055/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Music-25357-1.rar?fid=93328&ttl=1535796813&ri=8192&rs=8192&setec=080fe23cb5b8565ece3e0981eee657fc"
    }
  ]
}