{
  "modId": 25356.0,
  "modName": "Elven Thalmor Variety",
  "summary": "Provides the framework for separate Elven and Thalmor armor sets with different textures.",
  "descriptionHtml": "[b][size=9][color=red]Elven Thalmor Variety[/color][/size][/b]\r\n\r\nBy VonBarb.\r\n\r\n\r\n[b][size=6][color=yellow]What it does :[/color][/size][/b]\r\nElven Thalmor Variety gives the Thalmor their own standalone Thalmor-themed Elven armor that can be created at any forge or looted from dead Thalmor, so you can have different texture sets for default Elven armour and Thalmor soldiers without one overwriting the other.\r\n\r\nElven Thalmor Variety was created with the following texture sets for Thalmor in mind, but any other combination should work :\r\n\r\n[b]\\\"aMidianBorn Elven Armor\\\" By CaBal :[/b] http://skyrim.nexusmods.com/mods/23125\r\n\r\n\t\r\n[b]\\\"Dark Elven Thalmor-style Equipment\\\" by Flobulon :[/b] http://skyrim.nexusmods.com/mods/712\r\n\r\n\r\n[b][size=6][color=yellow]What it does[/color] [color=red]NOT :[/color][/size][/b]\r\n[color=red]!! It does not include any textures !![/color] This mod only provides the framework for you to customise your Thalmor armors appearance. I included the default normal and environment map files for the Thalmor variants since not all repaint mods include them, but [color=red]no custom textures are included[/color]. You will need to download them separately and install them manually as explained in the Installion Instructions .pdf provided.\r\n\r\n - Weapons are not supported as of this release version. Texture sets that replace the default textures for Elven armor will affect the Thalmor too !\r\n\r\n[b][size=6][color=yellow]Features :[/color][/size][/b]\r\n- Adds a new set of standalone Thalmor-themed Elven armor (including Light and Gilded variants) with matching shield.\r\n- Edited Thalmor leveled lists so Thalmor soldiers will wear it instead of the default Elven armor.\r\n- The Thalmor Armor set is craftable at any forge under \\\"Elven\\\", upgradeable at any workbench and enchantable.\r\n- Stats are the same as Elven armor.\r\n- Added crafting recipes for Elven Light armor since they won\\'t be available through looting Thalmor bodies anymore.\r\n- Edited Gilded armor crafting recipe to actually include gold :D\r\n- Can be used with most Elven armor retexture mod.\r\n\r\n[b][size=6][color=yellow]How to install :[/color][/size][/b]\r\n[color=red]! Manual installation of some files is required ![/color] Read the Installation Instructions provided in the .zip.\r\n\r\n[b][size=6][color=yellow]Where to find in game :[/color][/size][/b]\r\nCraftable at any forge under Elven, or lootable from Thalmor soldiers. Crafting recipes for Thalmor armors are the same as Elven, with two extra ingredients to account for the paint.\r\n\r\n[b][size=6][color=yellow]Compatibility notes :[/color][/size][/b]\r\nWhile this shoudl be compatible with most mods, keep the following in mind :\r\n\r\n- You can use pretty much any texture set you like, provided they are [b]replacer[/b] sets. A texture set from a standalone mod may not be compatible, as the texture files names will not be the same.\r\n- Any mod affecting the Elven armor meshes will also affect the Thalmor set. For instance, if you\\'re using a \\\"Masked Elven Helmet\\\" mod, make sure the texture sets you use for Elven and Thalmor sets are both compatible with the new mesh, lest you get strange results.\r\n- Any mod affecting Elven armor stats will not affect the Thalmor set, which will retain the default Elven values.\r\n- Any mod affecting the leveled lists for default Thalmor units is [b]not[/b] compatible with Elven Thalmor Variety. Mods adding new Thalmor units should be compatible (untested) though their armors may not match.\r\n\r\n[b][size=6][color=yellow]What I know is wrong with it :[/color][/size][/b]\r\n- Weapons are not supported as of 1.0. I might add support for weapons in a later update.\r\n- No chance of looting enchanted Talmor armor. Enchanted Elven armor can still be found, but no support for random enchanted Thalmor gear was added. \r\n\r\n[b][size=6][color=yellow]Who I\\'d like to thank :[/color][/size][/b]\r\nBethesda of course, The Nexus, and the people who made the CK available to the community, as well as those who took time to post some very useful tutorials on the web about how to get the most out of these tools.\r\n\r\nAll the texture artists who shared so many great Elven armor repaints that provided the incentive for this mod.\r\n\r\n[b][size=6][color=yellow]What\\'s coming next (probably) :[/color][/size][/b]\r\n- Support for weapons.\r\n\r\nRegarding [b]SkyRe[/b], I don\\'t use that mod myself and don\\'t want to start using it just to provide compatibility versions, but if someone wishes to make a compatibility patch, they are welcome to do so. I\\'ll be glad to host it on this mod\\'s pages if they want, and provide all due credits of course. \r\n\r\n[b][size=6][color=yellow]What you may do with this mod :[/color][/size][/b]\r\nDownload it, enjoy it, not enjoy it, endorse it or not, take lots of pictures of your characters wearing the armor and sharing them with us, tell me what you think of it, provide ideas...\r\n\r\nHowever you may not use it or any parts of it in your own mod or post on another site. Translations are OK.\r\n\r\n[b][size=6][color=yellow]Changelog :[/color][/size][/b]\r\n\r\n[b][color=yellow]Version 1.01 (October 17 2012) : [/color][/b]\r\n- Fixed issue with wrong Thalmor shield texture. To install, drop the .esp in you \\\"Data\\\" folder and overwrite.\r\n\r\n[b][color=yellow]Version 1.0 (October 2012) : [/color][/b]\r\n- Initial release version\r\n\r\n[b][size=6][color=red]Please report any bugs, compatibility issues or inconsistencies you find ![/color][/size][/b]",
  "categoryId": "54",
  "version": "1.01",
  "author": "VonBarb",
  "createdUnix": "1349988527",
  "updatedUnix": "1350460979",
  "containsAdultContent": false,
  "uploadedBy": "VonBarb",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93324",
      "name": "Elven Thalmor Variety",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12040",
      "fileName": "Elven Thalmor Variety-25356-1-0.zip",
      "uploadedUnix": "1349988691",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5d559fe47efb3bc9518b6620df20316997758df0b8d17d6f35adcde85a124d35/analysis/1407215950/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elven%20Thalmor%20Variety-25356-1-0.zip?fid=93324&ttl=1535796812&ri=8192&rs=8192&setec=a298f1e662968cf91f71e2212359bf21"
    },
    {
      "fileId": "94272",
      "name": "Thalmor shield Hot FIx",
      "version": "1.01",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "3",
      "fileName": "Thalmor shield Hot FIx-25356-1-01.zip",
      "uploadedUnix": "1350460979",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/909c79c90b17d33dd5f17e96087e48fddd983f75713e0ce1a3421df36db8323e/analysis/1407226202/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thalmor%20shield%20Hot%20FIx-25356-1-01.zip?fid=94272&ttl=1535796812&ri=8192&rs=8192&setec=a89d7846d91b5564f3ba522472bd9152"
    }
  ]
}