{
  "modId": 25355.0,
  "modName": "Nes Spellcaster",
  "summary": "Nes Spellcaster is a simple, general, and lore-friendly mod aimed at improving the mage themed perks, spells, and enchantments. Athough a rogue perk, alchemy is also a part of this mod ( can\\'t live without potions hmm).",
  "descriptionHtml": "Nes Spellcaster is a simple, general, and lore-friendly mod aimed at improving the mage themed perks, spells, and enchantments. Athough a rogue perk, alchemy is also a part of this mod ( can\\'t live without potions hmm).\r\n\r\nFrom re-arranged perks to brand new ones, the main aim here is to make mage gameplay (or even hybrid) feel fun, effective, and rewarding without throwing something really overpowered ou there. Trying to keep it as close to the feel of the original gameplay, but more fun.\r\n\r\n I will be adding/changing spells and perks soon.\r\n\r\nObs:\r\n------------------------------------\r\n\r\n - No Dawnguard required.\r\n - As with many perk mods, this mod is best suited for a fresh start.\r\n - If you intend on using this mod on an existing character, make sure to remove the appropriate perks you have via console.\r\n - Novice through Master perks for every magic school are the main ones to worry about, so remove them before anything else.\r\n - This is also my first mod, so if you find any bugs i\\'d be happy to try and fix them.\r\n\r\nGeneral Changes:\r\n------------------------------------\r\n\r\n - (With a few exceptions) Master level spells had their cast time reduced to 2.0 seconds.\r\n - Fortify \\\"magic School\\\" enchantments now have different effects:\r\n        - Destruciton: improves damage from this school.\r\n        - Conjuration: affects higher level targets.\r\n        - Alteration: increases duration for spells from this school.\r\n        - Restoration: increases damage/heal/level from restoration spells.\r\n        - Illusion: affects higher level targets, and slightly reduces magicka cost.\r\n - The only enchantments that now reduces magicka cost as they used to are the chest enchant: fortify + magicka regen.\r\n - New spells\r\n - New effects for existing spells.\r\n - Select perks are re-arranged, buffed, or nerfed.\r\n - All summon/raise dead spells have 2.0 minute(s) base duration.\r\n - The new Novice through Master perks of each skill are non-cumulative.\r\n - Novice - Master perks now affect all spells of their skill.\r\n\r\n\r\nMagic Schools:\r\n-------------------------------\r\n*********** Illusion **********\r\n-------------------------------\r\nThe least changed out of all skills. Illusion already felt it could do too much for the mage without changes, so the only changes made were for convenience. Plus if tied with the new fortify illusion enchantment, it could count as a pretty good buff.\r\n\r\nPERKS\r\n------\r\n - Novice - Master: +10% effectiveness, -12% magicka cost for each.\r\n - Quiet casting: moved to a more convenient placement, but two pre-requisite perks are required.\r\n - (NEW) Aspect of Havok: merely a fusion of perks that affect fear and frenzy spells. Mainly to balance the path choice to the top illusion perk.\r\n\r\nSPELLs\r\n------\r\n- (NEW)(ADEPT) Dark Eye: a spell for nightvision.\r\n\r\n\r\n********* Conjuration **********\r\n--------------------------------\r\nBy far the most modified of them all. I separated it intro three branches of summoning (raise dead, atronachs, and daedra),and a fourth for bound weapons. Each branch has a rule of its own. With this design it becomes rewarding to place points into conjuration, rather than aiming only for twin souls on the original.\r\n\r\nPERKS\r\n------\r\n - Novice - Master: -15% magicka cost, and additional effects for each.(see below)\r\n - (NEW) Binder: duration for bound undead/weapons are doubled.\r\n - (NEW) Summoner: duration for summoned daedra/atronachs are doubled.\r\n - (NEW) Atromancy: Summoned atronachs are stronger.\r\n - (NEW) Necromancy: health bonus for raised dead are doubled.\r\n - (NEW) Daedric Calling: Summoned dremora archers/warriors are stronger.\r\n - (NEW) Gravesurge: permanent undead, and they won\\'t turn to ash when killed.\r\n - (NEW) Soul Reaver: control 3 undead at once.\r\n - (NEW) Twin Souls: control 2 atronach/ daedras at once.\r\n - Nethermancy: just a rename for the perk that improves bound weapon damage.\r\n - (NEW) Planar Chain: a fusion of oblivion binding and soul stealer for bound weapons.\r\n\r\nATRONACHS\r\n---------\r\n - Atronachs now increase in power for each novice-master perk you pick above their own.\r\n\t(e.g. An Expert conjurer would have his flame atronach (learned on apprentice) be on the same level as his storm atronach (learned at expert))\r\n - The perk ATROMANCY grants a small boost to their level.\r\n - However WITHOUT any conjuration perks atronachs remain as such that storm > frost > flame, and casting a storm or frost without perks would be highly taxing on your magicka.\r\n - Atronachs are given permanency through their Master-level spells: Flame/Storm/Frost Calling.\r\n\r\nDAEDRA\r\n------\r\n - Daedras work in the same way atronachs do for novice-master perks.\r\n        - Dremora Archer(Adept)\r\n        - Dremora Warrior(Expert)\r\n - DAEDRIC CALLING will not add levels to daedras, instead it will add perks to them, such as Armsman, Juggernaut, Quickshot, among others.\r\n - Due to their volatile nature daedra are not given permanency, but are a worthy choice for being versatile in combat.\r\n\r\nUNDEAD\r\n------\r\n - Novice - Master perks increase the lvl of the target the raise dead spell affects.\r\n - Each rank of the raising spell above novice will grant a health bonus and affect the creature of appropriate level (doubled by necromancy)\r\n        - (Novice) Raise Zombie\r\n        - (Apprentice) Reanimate Corpse: +20(40) health\r\n        - (Adept) Revenant: +40(80) health\r\n        - (Expert) Wight: +60(120) health\r\n        - (Master) Animate Dead: +80(160) healh, no longer limited to persons only.\r\n - Undead are given permanency through the GRAVESURGE perk.\r\n\r\nBOUND WEAPONS\r\n-------------\r\n - Increased their power slightly so that they are very attractive to new players. At higher levels however smithing will surpass these weapons.\r\n\r\n\r\n********* Destruction **********\r\n--------------------------------\r\nA small tweak here and there was all this skill needed. You would rarely go beyond adept, or even apprentice, perk in the original. And the between the master spells, the lightning storm far superior than the other two options.\r\n\r\n\r\nPERKS\r\n----\r\n - Novice - Master: +10% damage, -15% magicka cost each.\r\n - Rune Master: the last perk change here, rune distance nerfed down to 4x, but their damage increases by 50%.\r\n - Intense Flames: reduced fear duration to 5 seconds on all spells. Mainly to reduce the backfire that usually comes with fear effects.\r\n\r\nSPELLS\r\n-----\r\n - Blizzard: 1.5 cast time, increased damage.\r\n - Lightning Storm : 2.0 cast time, slightly nerfed damage.\r\n - Fire Storm: 1.5 cast time, Increased damage.\r\n\r\n\r\n********* Restoration **********\r\n-------------------------------\r\nIn Oblivion or in the books throughout skyrim, restoration is often mentioned to not only heal, but to harm as well. So I just separated restoration into entropy and life, nothing too specific or complicated, but just for the flavor of it.\r\n\r\nPERKS\r\n-----\r\n - Novice - Master: -10% magicka cost, +5% potency each.\r\n - (NEW) Hemomancy: increases the damage from entropy spells.\r\n - (NEW) Essence Drain: Entropy spells now also drain stamine by half the life drained.\r\n - (NEW) Death Cloak: Improved version of AVOID DEATH, that heals your HP to full.\r\n - Regeneration: healing bonus decreased to 25%.\r\n\r\nSPELLS\r\n------\r\n - (NEW)(Apprentice) Life Leech: drains 10 hp per second.\r\n - (NEW)(Adept) Siphon Health: drains 15 hp per second.\r\n - (NEW)(Expert) Drain Life: drains 20 hp per second.\r\n - Turn undead spells now deal fire damage to undead at all ranks and variations.\r\n (I\\'m thinking of converting these spells to Damage over time effects and not drains)\r\n\r\n\r\n********* Alteration **********\r\n--------------------------------\r\nAnother skill that only needed few changes. Added 2 new spells as well, as a build up to the paralyze in expert.\r\n\r\nPERKS\r\n-----\r\n - Novice - Master: -12% magicka cost, +20% duration each.\r\n\r\nSPELLS\r\n------\r\n  - (NEW)(Apprentice) Slow: slows down target by 50%.\r\n  - (NEW)(Adept) Blur: Increases movement speed as you channel.\r\n\r\n\r\n********* Enchanting **********\r\n--------------------------------\r\nJust needed to re-arrange one (actually three) perks, and make the choice up to extra effect a bit less obvious, and less punishing.\r\n\r\nPERKS\r\n-----\r\n - Enchanter: (3 ranks), 30% increased enchant each.\r\n - (NEW) Elemental Praxis: (2 ranks), a fusion of storm, frost, fire enchants, +15% potency each.\r\n - Insightful Enchanter: (2 ranks), + 15% potency each.\r\n - Soul Stealer: increased to 10% of stolen soul.\r\n\r\n\r\n*********** Alchemy ************\r\n--------------------------------\r\nConstelation actually looks like a potion now lol. With that aside, separated into two pathways, potions and poisons. And seriously, who would ever put points in experimenter that far up the alchemy lvl anyway ?\r\n\r\nPERKS\r\n-----\r\n - Alchemist: (3 ranks), 30% potency to potions each.\r\n - Benefactor: (2 ranks), 15% potency to potions each.\r\n - POisoner: (2 ranks), 15% potency to poisons each.\r\n - (NEW) Durable Concoctions: potions and poisons you make last 50% longer.",
  "categoryId": "75",
  "version": "1.0",
  "author": "nespheok",
  "createdUnix": "1349988403",
  "updatedUnix": "1349988829",
  "containsAdultContent": false,
  "uploadedBy": "Nespheok",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93325",
      "name": "Nes Spellcaster",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "33",
      "fileName": "Nes Spellcaster-25355-1-0.zip",
      "uploadedUnix": "1349988829",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/556e88488ad8a3d4b5a8c8f34af7466ad540a6b686e877cb0e14b5a4744a9fe6/analysis/1407215950/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nes%20Spellcaster-25355-1-0.zip?fid=93325&ttl=1535796810&ri=8192&rs=8192&setec=60d08e5014e0d0dd57bcc8a63718e621"
    }
  ]
}