{
  "modId": 25363.0,
  "modName": "Book Common History and the Origins of the Akavir",
  "summary": "I\\\\\\'ve taken some creation myths from the Wikipedia website and researched all three cultures ranging from Korea, China, and Japan.\r\n\r\n",
  "descriptionHtml": "The Akavir history book starts off at the beginning in reference to real life of the cultures of Korea. The second paragraph has Japanese names taken from Japanese Mythology as well but the story has been invented to fit the Elder Scrolls universe.The third story is in reference to Chinese mythology because of the Chinese names that has been mentioned.\r\n\r\nThis mod is for those who wish to download the Return of the Akavir.\r\n\r\nThere are Asian names that are \\\"made up\\\" and there are some that some of you may recognize from Wikipedia. I had to change the letters so that it still sounds real but it stays within the lore.\r\n \r\nAlso, I have included some words and meanings from the TES lore that has similarities in regards to the Akaviri Gods and Goddess. \r\n\r\nThese Akaviri Gods have not been mentioned in the TES lore, if you know of any you may let me know and I will correct the names BUT your research HAS TO be legit in order for me to make corrections to my work!\r\n\r\nYou all may improve on my work but I require that you all give me credit as I am the original writer. I did my research on the Elder Scrolls Wikia website and Wikipedia for the actual Asian culture. ",
  "categoryId": "85",
  "version": "",
  "author": "StormKat33",
  "createdUnix": "1350002988",
  "updatedUnix": "1350003128",
  "containsAdultContent": false,
  "uploadedBy": "StormKat33",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93358",
      "name": "Book Common History and the Origins of the Akavir",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Book Common History and the Origins of the Akavir-25363-.rar",
      "uploadedUnix": "1350003128",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/892c5bbd38f1c86dbe8b6396abc0f91a90540db0a7dc74633fc6ed945226592f/analysis/1407216422/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Book%20Common%20History%20and%20the%20Origins%20of%20the%20Akavir-25363-.rar?fid=93358&ttl=1535796823&ri=8192&rs=8192&setec=48e5332d762008caffabeb1ec22bddfc"
    }
  ]
}