{
  "modId": 25360.0,
  "modName": "Companion Valfar",
  "summary": "The ultimate Stormcloak. Fully voiced, hairy, intoxicated and ever happy to bash some Elf skulls in&#33;",
  "descriptionHtml": "[center]\r<br />[img]http://img716.imageshack.us/img716/4059/valfar.gif[/img]\r<br />[b][heading] COMPANION VALFAR\r<br />by Omesean [/heading][/b]\r<br />\r<br />\r<br />Update 1.4.0 has been uploaded. This one should fix all problems related to UFO. Several topics have also been added, allowing sandbox \r<br />behavior, customization of appearance and blocking idle chatter. \r<br />Uninstall the old version, make a clean save and use the current version\r<br /> instead&#33;\r<br />\r<br />\r<br />Nexus user Charosian is responsible for the excellent bit of storytelling called [url=http://skysteel.tumblr.com]Skysteel - Beyond the 7000 Steps[/url], a tale in which Valfar was priviledged to make his appearance. Below is showcased a video depicting a brawl between (amongst others) Valfar and Hoth, portraying the tremendous quality and effort being put towards the creation of this epic. Check out the [url=http://skysteel.tumblr.com/]Tumblr page[/url], updated mondays, to see a great interpretation and implementation of Companion Valfar and revel in some awe-inspiring storytelling&#33;\r<br />\r<br />[youtube]mAOng_ij5Qw[/youtube][/center]   \r<br />\r<br />[center][img]http://imageshack.us/a/img202/7834/descriptionk.jpg[/img]\r<br />[youtube]xo_iSopCkL0[/youtube][youtube]n9G60IWYHXM[/youtube][/center]\r<br />\r<br />Valfar is a highly customized follower mod. A great warrior, lover of mead and hater of elves&#33; Do you fancy the Stormcloaks over those sissy Imperials? Then look no further my friend, for you have found the ultimate Stormcloak follower&#33;\r<br />\r<br />His armour is custom, his voice is custom, even his beard is custom - and it&#39;s all in in a single package and, I quote, &#34;itching to kill something&#34;. Your average barbarian - always a bottle of mead and rusty battleaxe within reach, and able to cast a shout (or three&#33;). You&#39;ll see him whacking down hordes of Thalmor milk drinkers with a single blow, all the while shouting epic comments and battle cries, and he&#39;ll do so with a smile&#33;\r<br />\r<br />And when I say that his voice is custom, I say that I treated it the same as I do with all my armour mods: I mix and match parts of the vanilla game and put them together in a whole new package. This is clearly evident on his armour, but his voice is a good example of this as well. For Valfar I wanted a very special voice that fully reflects his personality. And rather than scouring the internet for a voice actor like that, I found one already part of the vanilla game. We all know Ulfric&#39;s right hand, Galmar Stone-Fist. I extracted his dialogue and mixed it into the CK under whole new conditions and functions - in fact, the only thing that causes his voice to not be 100% custom is that I didn&#39;t act them myself. Everything has been added manually - over two hundred lines of dialogue, most of which are used during idle chatter to add a bit of life to an otherwise dull and average follower. Please don&#39;t argue that if I didn&#39;t voice act him myself he does not have a custom voice at all. There&#39;s a lot of work put into this, and if you can&#39;t see or appreciate that your opinion is of very little importance to me.\r<br />\r<br />In the background you&#39;ll find Valfar has a distaste for anything of elven nature. As such, Elven players can&#39;t recruit him, with an exception for orcs. I know fully well what the mer in orsimer stands for, but I feel they don&#39;t comply to the haughty stigma of the common Elven races.This is the way I intended him, and the way he shall remain. Please don&#39;t argue over this. \r<br />\r<br />[center][img]http://imageshack.us/a/img836/666/backgroundvmm.jpg[/img][/center]\r<br />Valfar&#39;s pa was a blacksmith, and at the early stages of his youth was trained to work the hammer and anvil in his father&#39;s fashion. The happy family lived on the northern coast of Solstheim in Skaal village. His father, Windir, was skilled at the creation of all things ebony. After all, the island was rich in ebony deposits. Young Valfar relished in the traditional hunts, but at the time of his initiation was ambushed by a mighty brown bear. A long chase ensued, untill at least the bear somehow fell off a cliff and into a gorge, where Valfar was able to end his life with his father&#39;s ebony dagger, given to him to bring good luck during his trials. He took the pelt off the mighty beast which since then became part of his costume: the very same pieces of fur you see on him today.\r<br />The rest of his youth progressed relatively smoothly. There were no orc raids or rapes, contrary to what one might find in most roleplayer&#39;s stories. He picked up his father&#39;s skill in the art of blacksmithing and spent his days working the forge, creating mighty weapons or armour for Tamriel&#39;s wealthiest knights. There was no hatred for the elves at that time. Solstheim&#39;s proximity to Morrowind has always led to a relatively large presence of Dunmer on the island, but they lived in peace at the time of his youth. Untill, of course, the Great War arrived.\r<br />Valfar and his father both enlisted for the army. Valfar was still a relative youth back then (and relatively beardless), and although his father was well into his forties, he was an accomplished warrior. During the great and bloody battle of the Red Ring, Windir was killed by a High Elf as both he and his son were hacking down their foes. Since then, and especially so after the White Gold Concordat, he has lived in utmost hatred for anything Elven. A pointed ear is enough for him to reach for his axe, mostly due to his post traumatic stress disorder. It has become a reflex since the great war.\r<br />The many inns of Cyrodiil proved little comfort for our warrior, and at last thoughts of home drove him north. That&#39;s where he gazed upon the Throat of the World, and has lived as a hermit since then. For twenty five years, doing naught but meditating and drinking mead, hunting game and slaying the occasional Thalmor patrol seeking to rout out that most holy symbol of Nordic culture, the greybeards.\r<br />\r<br />[center][img]http://imageshack.us/a/img163/4620/installation.jpg[/img][/center]\r<br />[center][b][color=red][size=&#34;7&#34;]READ THIS SECTION THOROUGHLY[/size][/color][/b][/center]\r<br />[b][color=red]Installation:[/color][/b]\r<br />   - Drop the .bsa and .esp file into your Skyrim data folder, typically located at C:&#92;Program Files (x86)&#92;Steam&#92;SteamApps&#92;common&#92;Skyrim&#92;Data\r<br />   - Activate the .esp through either the game launcher or the Nexus Mod Manager\r<br />      WARNING: When using the popular follower overhaul U.F.O. (Ultimate Follower Overhaul), please make sure to place CompanionValfar.esp BELOW the UFO .esp\r<br />          Questions caused by failure to heed this warning will not be answered. I&#39;ll simply frown, then smile, then continue doing something useful.\r<br />\r<br />[b][color=red]Location:[/color][/b]\r<br />\r<br />   You&#39;ll find him at his campsite on the slopes of the Throat of the World. It&#39;s a snowy place, right next to the road, on a small hill.\r<br />   Cheaters amongst us will find the console command &#34;coc HHPathshrine03&#34; very useful. It&#39;ll drop you right in his tent. To acces the console, press\r<br />   the tilde (`) button on the far right corner of your keyboard. Then type in the command as listed above without quotation marks.\r<br />\r<br />[b][color=red]Bugs:[/color][/b]\r<br />\r<br />Bethesda&#39;s latest patch (1.7) introduced the dialogue bug. This causes most voiced followers to remain awfully silent at the first run. To fix this issue, simply save the game with the mod enabled and then reload that same save. An indicator for his full dialogue being available is the &#34;Let&#39;s Talk&#34; topic.\r<br />\r<br />[b][color=red]Compatibility:[/color][/b]\r<br />\r<br />   Companion Valfar should be compatible with the popular follower mod &#34;Ultimate Follower Overhaul&#34;, provided you load CompanionValfar.esp BELOW the UFO one.\r<br />   Issues might arise when using other complex follower mods, such as the &#34;Extensible Follower Framework&#34;.\r<br />   The armour draws textures from a great amount of vanilla assets. Provided your installed texture mods don&#39;t alter the vanilla appearance (e.g. add alpha textures\r<br />   or completely change the UV maps), there should be only benefits.\r<br />\r<br />[b][color=red]FAQ:[/color][/b]\r<br />\r<br />        Q: &#34;Could you please make his beard/armour standalone?&#34;\r<br />        A: This armour is a preview to Æsir Armour, the main package. It includes the beard(s&#33;), armour (much more complicated in the real mod) and even a cool dungeon to die a few times in.\r<br />   \r<br />   Q: &#34;Could you please do a female version of his armour?&#34;\r<br />   A: Be patient and wait for the release of Æsir Armour. It will have female support.\r<br />   \r<br />   Q: &#34;Could you please add support for (insert random follower overhaul mod here)?&#34;\r<br />   A: If demand is high, I might just do that.\r<br />\r<br />   Q: &#34;ZOMG, cud u plz do a blck retex of his armur? Kthxbai&#33;&#34;\r<br />   A: Shoo.\r<br />\r<br />    Q: &#34;Could you please add more unique features, like a personal weapon or mount?&#34;\r<br />   A: It&#39;s in the works&#33;\r<br />\r<br />   Q: &#34;Could you please do a version without (insert random item attached to his armour here)?&#34;\r<br />   A: Go do it yourself. All it takes is NifSkope and knowledge of how to press a delete button.\r<br />\r<br />[center][img]http://imageshack.us/a/img717/3492/recommended.jpg[/img][/center]\r<br />   -   The armour Valfar uses (my soon to be released Æsir Armour) draws textures from a huge amount of vanilla resources. As such, the armour will benefit\r<br />   from any high resolution textures you have installed. Some of those texture mods are:\r<br />\r<br />   [url=3261]Hvergelmirs Armor Retexture - HAR[/url]   - for the iron base armour and fur parts - by lthot\r<br />   [url=7045]Hvergelmirs Shield Retexture - HSR[/url] - for the shield on his back   - by lthot\r<br />   [url=20792]aMidianBorn steel plate armor[/url] - for the little fur piece in the middle of his kilt - by CaBaL120\r<br />\r<br />   -   To achieve the exact same appearance as in the screenshots on the mod&#39;s description page, you&#39;ll want to download:\r<br />\r<br />   [url=2356]XCE - Xenius Character Enhancement[/url] - by Xenius\r<br />   [url=3574]Gizmodians Scars[/url]   - by Gizmodian and Xenius\r<br />   [url=2488]Better males - Beautiful nudes and faces - New hairstyles[/url] - Faces - GeonoxFaces package - by Chris57 and FavoredSoul\r<br />   [url=28363]Beards[/url] - by lthot & a (very) little me\r<br />\r<br />   -   Of course, this is not the full list of the textures he can use. I&#39;m sure there are many more on the Nexus, but I just don&#39;t have the time to\r<br />   browse through the massive database these days. If you would like to show your appreciation for this mod in another way than endorsing, please, post\r<br />   a few images and links&#33;\r<br />[center][img]http://imageshack.us/a/img842/5601/creditst.jpg[/img][/center]\r<br />[b][color=red]Credits:[/color][/b]\r<br />\r<br />   - Frankdema, for his continued support, beta testing, great conversations and help with the description page&#39;s layout. You&#39;re awesome, Frank&#33;\r<br />   - Aesir, for the lovely whisk(e)y chatter (amongst others), beta testing and incredible enthusiasm for the mod. I raise a glass in your name, Aesir&#33; A Laphroaig, even.\r<br />   - Mujuro, whom I can&#39;t thank enough for his help with getting the dialogue quests to work. You rock, man&#33;\r<br />   - Deck16, for his incredible guide (http://deck16.net/post/22645519500/making-a-unique-voiced-follower-in-skyrim-part-1). This wouldn&#39;t have been possible without you&#33;\r<br />   - Hothtrooper, for his beta testing and great support. Keep producing mods, my apprentice&#33;\r<br />   - The Nexus and DarkOne in particular. Thanks, all of you&#33;\r<br />   - Again, Tom Waits, for keeping me going with his awesome music during mind-numbing dialogue modding. I&#39;d have collapsed by now if not for these sweet tunes&#33;\r<br />   - Paul Eiding, the original voice actor (for Galmar Stone-Fist, Septimus Signus and Felldir the Old). No voice was more fitting for my companion than his&#39;&#33;\r<br />   - The team at Bethesda Games Studio, because none of this would have been remotely possible without them. True legends, that lot&#33;\r<br />- Terje Bakken, a true Windir\r<br />\r<br />[b][color=red]Permissions:[/color][/b]\r<br />\r<br />This mod, apart from being a follower mod, also serves as a preview of my soon to be released armour. As such, I will not tolerate any redistribution of either modified or unmodified (that, in particular) files from the armour folder. It&#39;s still in development, and even if you wish to incoorporate it into your massively awesome complete overhaul, wait for me to release it&#33;\r<br />   You may NEVER, in any given circumstance, wether Naglfar appears on the horizon or newts fall from the sky, upload this mod to the Steam Workshop.\r<br />   Do contact me if you wish to use these assets in an other way than aforementioned permissions. Especially in terms of translations.\r<br />   Please respect my wishes in this regard&#33;\r<br />\r<br />[b][color=red]Tools used:[/color][/b]\r<br />- TesVEdit\r<br />   - Blender\r<br />   - NifSkope\r<br />   - GIMP\r<br />   - Creation Kit\r<br />   - AVS Audio Editor\r<br />   - Unfuzer (download it at http://skyrim.nexusmods.com/mods/9797)\r<br />   - A very loyal little coffee machine\r<br />\r<br />[b][color=red]Changelog:[/color][/b]\r<br />   v1.4.0 - 24.10.12 - prefixed all scripts with OS_\r<br />           - Removed Valfar from factions CurrentFollowerFaction and WIFollowerCommentFaction\r<br />           - Added dynamic relax package, replacing the wait here topic when Valfar deems the current cell safe enough.\r<br />           - Further improvements on the additions from 1.3.0\r<br />           - General bugfixes\r<br />   v1.3.0 - 22.10.12 - Added several additional functionalities:\r<br />                - The player can order Valfar to be silent (and vice-versa) now\r<br />           - The player can order Valfar to remove his hood and banner, and vice versa.\r<br />   v1.2.1 - 19.10.12 - Fixed several problems introduced by patch 1.2:\r<br />           - Messed up landscape around the Imperial camp\r<br />                - Previous modified race checks were running on Valfar rather than the player. It caused Imperials and custom races to be unable to recruit him.\r<br />   v1.2.0 - 19.10.12 - Moved all follower functions to a custom quest to prevent further compatibility issues. This disables some mods from working on him, but at least he shouldn&#39;t screw it up for the rest anymore. Custom races should also be compatible now.\r<br />   v1.2.0 - 19-10-12 - Moved all follower functions to a custom quest to prevent further compatibility issues. This disables some mods from working on him, but at least he shouldn&#39;t screw it up for the rest anymore. Custom races should also be compatible now.\r<br />v1.1.0 - 13.10.12 - Added race check to his initial dialogue. Elves can&#39;t recruit him, Nords go without hassle and all other races require a mini quest (the camp is in Ivarstead&#33;). \r<br />           - Removed condition in DialogueFavorGeneric that checked the amount of followers. He should follow regardless of your current followers.\r<br />        v1.0.1 - 12.10.12 - Brooch texture path fixed.\r<br />   v1.0.0 - 11.10.12 - Initial release&#33;\r<br />\r<br />[b]\r<br />Please show your appreciation for this mod by either leaving a message in the comments section, telling me stories of your adventures with Valfar or adding your images to the mod&#39;s page.\r<br />\r<br />   Enjoy&#33;\r<br />\r<br />      With love,\r<br />         Sean, the author[/b]\r<br />\r<br />[center][url=http://www.skyrimgems.com][img]http://SkyrimGEMS.com/images/badge_featured.png[/img][/url][/center]",
  "categoryId": "66",
  "version": "1.4.0",
  "author": "Omesean",
  "createdUnix": "1349998309",
  "updatedUnix": "1351123427",
  "containsAdultContent": false,
  "uploadedBy": "Omesean",
  "primaryFile": null,
  "files": [
    {
      "fileId": "94672",
      "name": "Companion Valfar",
      "version": "1.2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15044",
      "fileName": "Companion Valfar-25360-1-2-1.rar",
      "uploadedUnix": "1350674975",
      "modVersion": "1.2.1",
      "virusScanUrl": "https://www.virustotal.com/file/3d623d6998b61f0d18b5646f77d63a1ab9efe6228bc6974d9157266224e3d949/analysis/1407228975/",
      "changelogHtml": " Fixed landscape around the Imperial camp that was messed up with the introduction of patch 1.2.0 <br/> \n Fixed new race conditions to run on the player rather than the subject. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Companion%20Valfar-25360-1-2-1.rar?fid=94672&ttl=1535796816&ri=8192&rs=8192&setec=a03b0453748b8162b15a8b0f4257f8aa"
    },
    {
      "fileId": "95648",
      "name": "Companion Valfar",
      "version": "1.4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16485",
      "fileName": "Companion Valfar-25360-1-4-0.zip",
      "uploadedUnix": "1351123427",
      "modVersion": "1.4.0",
      "virusScanUrl": "https://www.virustotal.com/file/bc56974dd8ca3f36e9bcc5edf9cc199c242e67b8936704c5340a77993ec0f66d/analysis/1407234923/",
      "changelogHtml": " Prefixed all scripts with \\\"OS_\\\" to prevent incompatibility. <br/> \n Removed Valfar from factions CurrentFollowerFaction and WIFollowerCommentFaction to prevent issues with UFO <br/> \n Added dynamic relax package, replacing the wait here topic when Valfar deems the current cell safe enough. <br/> \n Further improvements on the additions from 1.3.0 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Companion%20Valfar-25360-1-4-0.zip?fid=95648&ttl=1535796817&ri=8192&rs=8192&setec=378010ed988b40467e1808f81d5afc28"
    }
  ]
}