{
  "modId": 25364.0,
  "modName": "General Stores - Fort Dawnguard",
  "summary": "Adds General Stores to Fort Dawnguard",
  "descriptionHtml": "[heading] General Stores for Dawnguard HQ, Endorse please if you like makes me happy ;-)[/heading]\r\n[img=center] http://skyrim.nexusmods.com/mods/images/25343-1-1349985161.png [/img]\r\nCheck out my other MOd you will find there this mod to it´s a compilation of general stores placements [url=http://skyrim.nexusmods.com/mods/25343] Gemeral Stores for Hearthfire Houses[/url]for Hearthfire\r\n[line]\r\n\r\n[b][heading][center][color=green]General Stores in Fort Dawnguard to make living more easy.[/color][/center][/heading]\r\n\r\n[center]Main File[/center]\r\n\r\n[center]Save no Problems reported[/center]\r\n\r\n[center]Adds Many General Stores Containers to Fort Dawnguard Personal Space[/center]\r\n[heading]OO now General Stores at Dawnguard[/heading]\r\n\r\nThis mod adds General Stores Container to Locations of the world of Skyrim. I started to add them first in Hearthfire Location.. \r\n\r\nAfter now you will find several other Location for gener Stores in vanilla Skyrim and Dawnguard DLC. Look at the optional Files for more locations. You will never loose your stuff cause it´s saved by the general stores master esm and accesible everywhere General Stores is used.\r\n\r\nThe supperb Generals Stores Mod is not developed by my it´s a modders resource form Harvey, i just placed the container, so all the credits belong first to him.\r\n\r\nYou have to download the resource to make this placement work. You will find it under\r\n\r\n- [url=http://skyrim.nexusmods.com/mods/18340] Harves General Stores [/url]\r\n\r\nalthough most question about general stores get a solution there just read the readme´s\r\n\r\nthx a lot enjoy\r\n\r\n[heading] Howto store your new dlc stuff right[/heading]\r\n\r\n(text copied from orginal Harves Modders Resource) Heuristic Learning Containers adapt to all DLC and mod added items. Once stored, new items are recognized and supported for sorting and bulk transfers. FINALLY, repetitive stress has been banished forever!\r\n\r\nGeneral Stores Master Chest: - Single activator with access to everything\r\n\r\n[list]\r\n[*]One-Click Rinse Cycle (unburden) - Unloads and sorts all smithing, alchemy, filled grand souls, books, scrolls, and raw foods\r\n[*]Unburden - Same as Rinse Cycle above\r\n[*]Autosort - Add any items to a single chest and they will autosort to appropriate lockers.\r\n[*]  Manual Inspection - Menu driven direct access to all 12 lockers plus Armor and Weapon OCD  sets \r\n[*]Stash Cash - Store your extra gold in the Treasures locker\r\n[*]Storage Cistern Trapdoor - Adds access to a lore friendly storage cistern which can be placed under any building. Access to all 12 locker and all OCD sets. While the Trapdoor may look and function as a door, it is actually an activator so you can drag/drop it and not worry about setup and Navmesh. Sorry, no followers.\r\n[/list] \r\n\r\n[heading] Install:  [/heading]\r\n[list]\r\n[*]Do a save before installing so you can rollback, Outside Version is save but inside Version got  uninstall Problems\r\n\r\n[*]Please load  [url=http://skyrim.nexusmods.com/mods/18340] Harves General Stores ESM[/url] before this esp and hearthfire.esm , and of couse download and install it\r\n[/list] \r\n\r\n\r\nPlease endorse Harvey for Orginal mod while you are there.\r\n\r\nHope you enjoy it, im new at modding. Endorse if you like ! Also please Endorse Harvey  which made General Stores mod!!!\r\n\r\nEnjoy Alex\r\n\r\nbtw. If my english is a very shitty thingy, thats cause im german\r\n\r\nin diesem Sinne wer Rechtschreibfehler findet kann Sie behalten!\r\n",
  "categoryId": "67",
  "version": "0.1",
  "author": "funkfanatic",
  "createdUnix": "1350004128",
  "updatedUnix": "1350004179",
  "containsAdultContent": false,
  "uploadedBy": "funkfanatic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93359",
      "name": "GSFortDawnguard",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "GSFortDawnguard-25364-0-1.rar",
      "uploadedUnix": "1350004179",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/f5463cec1af722fdeafda21d852a6036e34864b186ec76422d7d445f71cd8f6d/analysis/1407220214/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GSFortDawnguard-25364-0-1.rar?fid=93359&ttl=1535796824&ri=8192&rs=8192&setec=2901503b164f896512534dacd0a38dea"
    }
  ]
}