{
  "modId": 25371.0,
  "modName": "VOM - Passive Night Vision For Vampires",
  "summary": "Have you ever wondered how vampires can see just fine in the sunlight and at night? Does the blurry vanilla night eye bother you? This simple mod solves both problems! (Fully compatible with anything else)",
  "descriptionHtml": "-- Description --\r\n\r\nGet ready for a true night-creature experience. Night eye is no longer a convenient set of glasses that you can use at will. You will see perfectly fine in the dark, nights will be beautiful and clear and you will be able to easily navigate even the darkest of dungeons. The catch? Light sources will be blindingly white. You, the player, will come to hate the sun just like your character does!\r\n\r\n-- Compatibility --\r\n\r\nNone. Doesn\\'t alter vampirism in any way. The mod has a quest monitoring the player and checking if he or she is a vampire. This is done every game hour so it won\\'t affect performance. This will work with any other mods you have.\r\n\r\n-- Installation --\r\n\r\nEither use NMM or extract the files into your data folder. Delete the files to uninstall. No need for clean saves of any kind.\r\n\r\nAfter installation, wait or sleep for an hour and sleep and the mod will activate. If you cure yourself, the night vision will deactivate on its own after an hour.",
  "categoryId": "24",
  "version": "1.0",
  "author": "elite5472",
  "createdUnix": "1350019118",
  "updatedUnix": "1350019157",
  "containsAdultContent": false,
  "uploadedBy": "elite5472",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93383",
      "name": "Main File",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Main File-25371-1-0.zip",
      "uploadedUnix": "1350019157",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e473a537fd32c14090983aaf1933873a5274de4f2ea689caceb2c34f6593e2ad/analysis/1407216843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-25371-1-0.zip?fid=93383&ttl=1535796836&ri=8192&rs=8192&setec=72990cf7a39620eb3e7562f3a6567012"
    }
  ]
}