{
  "modId": 25407.0,
  "modName": "Skyrim Mall - projected suspended - need serious help",
  "summary": "A shopping mall in Skyrim. WIP, but will need additional support.",
  "descriptionHtml": "This mod is a project to build an authentic shopping mall in Skyrim. It\\'s a large underground mall with space for over 140 shops, 8 restaurants in a food court, and four anchor stores. The mall entrances interconnect the mall to various locations in Skyrim, mainly in cities and towns. One of the easiest entrances to locate is a door on the floor just as you walk into Dragonsreach. The building and entrances have been completed; however, I cannot continue any further. I have been running into widespread and continuous problems with getting the navmeshes to work properly, getting NPCs to walk around the building, and getting guards to respond to crimes. I spent almost 12 hours of extreme frustration to create a single merchant who will remain in her shop and sell, but I cannot get her to follow a set work schedule. I spent too much time on this and much of it was wasted. I need help from more experienced modders to add shops, merchants, NPC shoppers, guards, and quests. This project is now open source to anyone who wishes to complete it, but please give me credit for the initial concept and the building.\r\n\r\nMy goals intended for this project:\r\n\r\nFully-functional stores with a store manager/owner along with a few workers operating on various shifts\r\nMall hours to be 10 AM - 9 PM (12 PM - 6 PM on Sunday), doors locked when mall is closed\r\nStores to sell categorized merchandise (i.e. book store, jewelry store, shoe store, potion store, etc.)\r\nSigns with store names over the doors and mall signs around Skyrim\r\nOnly male NPCs can enter mens restroom and female NPCs in womens restroom; walking into a restroom opposite the player\\'s gender will result in a crime\r\nMall office with quests\r\nNPCs entering restrooms and dressing rooms automatically become naked\r\nItems in the stores are owned and can be stolen, but at the cost of bounty.\r\nMultiple guards serving as mall security.\r\n\r\nIMPORTANT: Store attendants are to remain behind the counters and not wander around the mall!!!\r\n\r\nI have included one merchant located just north of the food court (second door to the right), sample items in one restaurant, and names for the anchor stores. The bookstore will sell every book in Skyrim, the outdoor store will sell hunting equipment and have crafting / smithing stations available, and the furniture store will feature merchants whom you buy houses and decorations from.\r\n\r\nAfter all of the trouble, I have had enough of this. This is too much for a novice modder. I hope that this could eventually become a sucessful community project and can be featured in the Steam Workshop. Anyone who wants to contribute to this mod, please reply. Any help would be appreciated.",
  "categoryId": "69",
  "version": "1.00",
  "author": "banzaigtv",
  "createdUnix": "1350072522",
  "updatedUnix": "1350072611",
  "containsAdultContent": false,
  "uploadedBy": "banzaigtv",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93512",
      "name": "Skyrim Mall - pre-alpha build",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "188",
      "fileName": "Skyrim Mall - pre-alpha build-25407-1-00.rar",
      "uploadedUnix": "1350072611",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/6825c1a676a63f589908852ce239f30bb485d9eb2109cb1dfc445f396cd827ca/analysis/1407218106/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Mall%20-%20pre-alpha%20build-25407-1-00.rar?fid=93512&ttl=1535796895&ri=8192&rs=8192&setec=b291b1feb357870ed0377a3b2414a984"
    }
  ]
}