{
  "modId": 25403.0,
  "modName": "Orc follower - Khadvak",
  "summary": "Essential orc follower found in Riverwood. A warrior class with 1h weapons and shields, levels with your character. Also Marriageable.",
  "descriptionHtml": "Khadvak is an Orc follower found in Riverwood - as he\\'s right at the beginning of the game I kept his inventory very simple with some steel armor, shield and a sword. He\\'ll level with your character as well so he\\'s nice and balanced (with the exception of not being able to die!). I also made him marriageable, because it seemed silly to pass up on the option.\r\n\r\nI used XCE so if you want him exactly as is in the picture you\\'ll need this. http://skyrim.nexusmods.com/mods/2356\r\n\r\nI made him for my mage, but I really liked him so thought I\\'d share, but this is my first mod so feedback is very welcome :)\r\n\r\nI\\'d love to do a backstory on how he came to be in Riverwood, but I\\'m yet to find a good tutorial on setting up a dialogue that doesn\\'t include a quest, if you can point me to one tyvm :)\r\n\r\nPS- had a little trouble packaging this cause steam\\'s epic archive system was convinced there were zero files. So I did a little research and did it manually, hope I got it right.",
  "categoryId": "66",
  "version": "1.0",
  "author": "Tylia",
  "createdUnix": "1350064721",
  "updatedUnix": "1350066485",
  "containsAdultContent": false,
  "uploadedBy": "Tylia",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93497",
      "name": "Khadvak",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "150",
      "fileName": "Khadvak-25403-1-0.rar",
      "uploadedUnix": "1350066485",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/25fba372ca8c8398de425fd64028b4d744294a74017c2f9e12ad88dc35eaf0b9/analysis/1407217984/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Khadvak-25403-1-0.rar?fid=93497&ttl=1535796890&ri=8192&rs=8192&setec=e8e9f47bcee7e9c98bf4ca92b5b5053d"
    }
  ]
}