{
  "modId": 25402.0,
  "modName": "House Solitude",
  "summary": "Medium sized atmospheric playerhouse in Solitude. Fully navmeshed/companion friendly, plenty of storage space. Beautifull bathroom, bedroom with double bed, childs room, livingroom, kitchen, upper floor with &#39;magic craft area&#39; and guest/companion bed. ",
  "descriptionHtml": "[youtube]edAQCONLyPY[/youtube]\r<br />\r<br />Video by EmadWasfi, tnx a lot dude.\r<br />\r<br />[b]READ the important notes below&#33;[/b]\r<br />\r<br />[b]Install:[/b] Drop the files in your Data folder (The Elder Scrolls V Skyrim/Data) and overwrite when prompted.\r<br />\r<br />Just as the title says, this is my first mod. I got bored with al those &#39;cute houses/enormous palaces in &#39;rural scenes&#39;. \r<br />Nobody seemed to make a house that fitted my preferences so I took up the challenge to build it myself.\r<br />Check the images for the result :) \r<br />\r<br />As my character now has a lovely companion in his life (yes, the house is ofcourse fully navmeshed and companion friendly) and with Hearthfire and \r<br />kid-adoption mods around maybe even a kid in the future (*teehee* that&#39;s where that ridiculous small room is for ofcourse :) it&#39;s no longer safe \r<br />to sleep in the wilderniss. Even a dovakiin likes to sleep peacefully without bandits knocking on his door. Safe behind Solitudes strong walls. \r<br />\r<br />Located in Solitudes &#39;Arch area&#39;. After you enter the &#39;living area&#39; from the market place it&#39;s located just on \r<br />your left side, you can&#39;t miss it. It&#39;s named &#39;Solitude farmhouse&#39;. No key required. It&#39;s open and set player owned. \r<br />At the moment there is only one other mod (Solitude enhanced) which adds buildings and trees in this part of the \r<br />Solitude world (all other houses are underground etc) and the house is compatible with that one, so it should be \r<br />compatible with all current Solitude mods. \r<br />\r<br />Fully navmeshed/companion friendly, plenty of storage space. Beautifull bathroom, bedroom with double bed, childs room (ofcourse the child bed can only be used by a child or the player, not by an adult follower), livingroom, kitchen, upper floor with &#39;magic area&#39; and guest/companion bed. \r<br />Although the house has an alchemy and enchanting area there is NO smithing stuff. No forge, no workbench etc. \r<br />Simply because this doesn&#39;t belong in a &#39;civilian living area&#39; and besides that, Beirands smithy is just around the corner. \r<br />\r<br />Mod comes with two choices: One with interior shadows (strongly recommended&#33;) and one without.\r<br />\r<br />[b]Want your husband or wife to live in the house,[/b] but he/she is a vanilla NPC or a companion without &#39;live everywhere&#39; option? Use this mod to make them live wherever you want: http://skyrim.nexusmods.com/mods/11370\r<br />\r<br />[b]\r<br />Important notes:[/b]\r<br />\r<br />[b]1[/b]: As  I&#39;ve used a lot of  shadows it might be that some computers with low-end graphics cards \r<br />have troubles with the visuals in the bathroom and near the fireplace. A common problem \r<br />called &#39;striping shadows&#39; which causes stripes on the interior, and even \r<br />worse, on your character and NPC&#39;s body/face. If this occurs to you, change \r<br />these lines in your SkyrimPrefs.ini. ( found in C:Users*USERNAME*DocumentsMy GamesSkyrim )\r<br />\r<br />iBlurDeferredShadowMask=20\r<br />fInteriorShadowDistance=2000.0000\r<br />fShadowDistance=3000.0000\r<br />fShadowLODStartFade=200.0000\r<br />iShadowMode=4\r<br />iShadowMaskQuarter=4\r<br />iShadowFilter=4\r<br />bTreesReceiveShadows=1\r<br />bShadowMaskZPrepass=1\r<br />\r<br />Credits for these tweaks go to defosh369, thanks dude&#33; If you think the shadow quality can be \r<br />even better you can download more tweaks from defosh&#39;s original page: http://skyrim.nexusmods.com/mods/283 \r<br />\r<br />If this doesn&#39;t help (Can&#39;t imagine, in that case your computer is probably too old to \r<br />run Skyrim anyway) lower your graphic settings or use the .esp in the optional download (House in Solitude NO SHADOWS). \r<br />\r<br />[b]2[/b]: This house has mannequins. Unfortunately there is a bug (not caused by this or any mod, it&#39;s a vanilla bug) that \r<br />causes mannequins to &#39;wander&#39;. First time you load the cell the mannequins are on the place where they&#39;re supposed to be,\r<br />but when you leave and enter the house again the mannequins are out of place, showing up all over the house.\r<br />\r<br />If you suffer that issue, use this modified mannequin script, it cures the problem perfect: http://skyrim.nexusmods.com/mods/10652\r<br />\r<br />[b]3[/b]: Followers often don&#39;t enter the bathroom, they will just stand in front of the bathroom &#39;door&#39; in the bedroom. This seems \r<br />to have something to do with the following distance, which is isn&#39;t close enough to follow in such narrow rooms. I can&#39;t help that. \r<br />Most of the time they spawn near the player after some seconds. If they don&#39;t, just \r<br />order them to sit on the wooden bench in the bathroom, this is close enough to the door so the sit-on-bench animation \r<br />forces them into the bathroom. (If they are not standing near the door this trick won&#39;t work so you&#39;ll have to walk around a bit until they come to the &#39;door&#39;)\r<br />\r<br />[b]Known issues:[/b] \r<br />\r<br />None, as far as I know. Although you might notice a bit of a frame drop when you first enter the house after you start playing. This restores in a few seconds and it&#39;s only the first time. Not really a problem.\r<br />\r<br />[b]Credits:[/b] \r<br />\r<br />Ofcourse to defosh369 for his advice and Tamira and Arion for their teddybear resource (http://skyrim.nexusmods.com/mods/16625). Not to forget Wolf and Emma for their tips and criticism.\r<br />\r<br />[b]Permissions: [/b]\r<br />\r<br />Like the house and want to use it in your mod? That&#39;s fine, but give me credits and let me know about it. Also if you use the teddybear resources, don&#39;t forget to credit Tamira and Arion. Last but not least, endorsements are nice ofcourse, but I even like to see an uploaded pic of your char in the house. To me that&#39;s the best evidence that someone likes it. Have fun :)",
  "categoryId": "67",
  "version": "1",
  "author": "Eend123",
  "createdUnix": "1350063151",
  "updatedUnix": "1350063524",
  "containsAdultContent": false,
  "uploadedBy": "eend123",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93481",
      "name": "House in Solitude",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "813",
      "fileName": "House in Solitude-25402-1.rar",
      "uploadedUnix": "1350063251",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b8bef2f18106867a87c0882a1a95c4d774f748f5b4478b3dfebfcbd365f19cc5/analysis/1407217747/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/House%20in%20Solitude-25402-1.rar?fid=93481&ttl=1535796887&ri=8192&rs=8192&setec=bde57b237ef34328307eef39f23c9356"
    },
    {
      "fileId": "93482",
      "name": "House in Solitude NO Shadows",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "813",
      "fileName": "House in Solitude NO Shadows-25402-1.rar",
      "uploadedUnix": "1350063524",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/52451db647dd1d8300a7de222c11ec85210458c2028af815841135408d9410fc/analysis/1407217803/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/House%20in%20Solitude%20NO%20Shadows-25402-1.rar?fid=93482&ttl=1535796888&ri=8192&rs=8192&setec=ba0ec47be86898c5b342e4d05cad1c15"
    }
  ]
}