{
  "modId": 25422.0,
  "modName": "Craftable Cloud Storage",
  "summary": "If you want to eliminate the tedium of inventory management, keep easy access to [I]all[/i] your stuff, and get on with the business of Dragon slaying, then this mod is for you.  Craftable, placeable, automated, heuristic, centralized storage.  Why play without it?",
  "descriptionHtml": "[Center][Img]http://static.skyrim.nexusmods.com/mods/images/25422-1-1350089116.jpg[/img][/Center]\r\n[size=3][center][color=yellow][b][i]Craftable, placeable, automated, heuristic, centralized storage.  Why play without it?[/i][/b][/color][/center][/size]\r\n[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/hXQSy.png[/img][/url][/center]\r\n[B]\r\n[list][*] If spending your precious gaming time stooped over a dusty chest feels rewarding to you, [I]please don\\'t download this mod[/i].\r\n[/list]\r\n[list][*] If you enjoy tapping \\\"R\\\"- <click> until your fingers cramp, [I]probably not for you[/i].\r\n[/list]\r\n[list][*] If you like being anchored to just one house because that\\'s where you started storing your stuff, [I]this is not the mod you want[/i].\r\n[/list]\r\n[/b]\r\n[Center][heading][color=Springgreen]If you want to eliminate the tedium of inventory management, keep easy access to [I]all[/i] your stuff, and get on with the business of dragon slaying, this [B][I]is[/i][/b] the mod you need. \r\n[/color][/heading][/center]\r\nMystic Artifacts crafted at the smelter can be used to place a variety of automated storage activators, anywhere you choose to place them.  Activators feature (mostly) unique, lore-friendly meshes and superfast menu-diven bulk transfers to and from your inventory. Items stored in-game are held safely by an independent, proven master file so this mod can [U]never[/u] lose your stuff.  \r\n\r\n[Center][B]Incredibly simple to use, incredibly useful, and guaranteed to transform inventory management from a chore to a joy.[/center][/b]\r\n\r\n[list][*] Drop a key to spawn a Crafting Stores Activator, and with two clicks you\\'ve stored all your heavy ores, ingots and whatnot.  Trudge across the breadth of Skyrim unencumbered to another location with a Crafting Stores and with two clicks have immediate access everything previously stored.  \r\n[/list]\r\n[list][*] Tap [U]any[/u] alchemy workstation with a Mystic Pick and an Alchemical Stores activator spawns on the station.  Similarly, tap an enchanting station and spawn a Enchantment Stores activator.  Every one you spawn will access the same inventory.\r\n[/list]\r\n[list][*] Anywhere you can go, you can spawn storage.  A friendly smithy\\'s, a vanilla home, a remote hideaway. You can even spawn storage in DLC and mod locations.\r\n[/list]\r\n[list][*] Lore friendly and balanced.  It is ENTIRELY up to you how much storage access to add and where. Crafting involves rare ingredients to discourage spamming, but hey if you\\'re a spammer you certainly know how to player.additem.\r\n[/list]\r\n[list][*] Heuristic Learning Containers adapt to all DLC and mod added items.  Once stored, new items are recognized and supported for sorting and bulk transfers.  Repetitive stress has been banished forever!\r\n[/list]\r\n[list][*] Included is a fully outfitted, lore friendly storage cistern accessed through trapdoors you can place.  Inside this cistern you will find a vast array of storage options, but sadly, not your followers.\r\n[/list]\r\nCraftable Cloud Storage is powered by [URL=http://skyrim.nexusmods.com/mods/18340]General Stores[/URL], a stable, reliable storage resource. Compatible with any and all other GS enabled mods.  Check the link to learn more and review the Real Estate Listings for homes already configured with a range of compatible storage.\r\n\r\n\r\n[heading][color=Springgreen]Mystic Artifacts:[/color][/heading]\r\nCrafting of such powerful artifacts can only be accomplished in the extreme heat of a smelter.  Artifacts are classified as of Draugr origin (Nord).  Keys will float to the top of your inventory, weapons will not.\r\n\r\n[color=Darkturquoise]Mystic Crafting Key:[/color]\r\n[list][*]Spawns a Crafting Stores Anvil activator for easy storage of your crafting supplies.\r\n[*]Menu [Store All, Smithing, Smelting, Tanning, Gemstones, Grab Mystic, Exit].\r\n[*]Requires (1 Quicksilver Ingot, 1 Fire Salts)to smelt.\r\n[/list]\r\n\r\n[color=Darkturquoise]Mystic Pantry Key:[/color]\r\n[list][*]Spawns a Food Stores \\\"Crate and Barrel\\\" activator . \r\n[*]Menu [Store All, Store Raw, Pantry, Cooked Foods, Raw Foods, Spices, Exit].\r\n[*]Requires (1 Firewood, 5 tomatoes) to smelt.\r\n[/list]\r\n\r\n[color=Darkturquoise]Mystic Potions Key:[/color]\r\n[list][*]Spawns a Potion Stores \\\"Crate and Barrel\\\" activator. \r\n[*]Menu [Store All, Buffs, Poisons, Restoratives, Distillation, Liquid Assets, Exit].\r\n[*]Requires (1 Ebony Ingot, 1 Pearl) to smelt.\r\n[/list]\r\n\r\n[color=Darkturquoise]Mystic Unburden Key:[/color]\r\n[list][*]Spawns an Unburden Fountain a.k.a. the one-button rinse cycle. \r\n[*]One-click autostores all smithing, alchemy, books, filled grand souls, and raw foods. \r\n[*]Requires (1 Refined Malachite, 1 Frost Salts) to smelt.\r\n[/list]\r\n\r\n[color=Darkturquoise]Mystic Master Key:[/color]\r\n[list][*]Spawns a General Stores Master Chest with access to everything\r\n[*]Menu Choices:\r\n[*] [U]Unburden[/u] - Same effect as Unburden activator above\r\n[*] [U]Autosort[/u] - Add any items to a single chest and they will autosort to appropriate lockers.\r\n[*] [U]Manual Inspection[/u] - Menu driven direct access to all 12 lockers and all OCD container sets\r\n[*] [U]Stash Cash[/u] - Store your extra gold in the Treasures locker\r\n[*]Requires (1 Gold Ingot, 1 Deadra Heart) to smelt.\r\n[/list]\r\n\r\n[color=Darkturquoise]Mystic Cistern Key:[/color]\r\n[list][*] Spawns a General Stores Cistern Trapdoor adding direct access to the storage cistern.\r\n[*] Multiple trapdoors can be spawned.  When you exit, you return to the door from which you entered.\r\n[*] Cistern is lore friendly and can logically exist parallel to or under existing basements.\r\n[*] 12 Primary Lockers, 9 fully automated.\r\n[*] 17 OCD container provide direct, filtered access (raw food, cooked food, etc.)\r\n[*] DragonClaw and Bugjar displays stands, but no-one to show them off too because ...\r\n[*] No followers allowed in the cistern.\r\n[*] Requires (1 Moonstone Ingot, 1 Briar Heart) to smelt.\r\n[/list]\r\n\r\n[color=Darkturquoise]Mystic Embalming Pick:[/color]\r\n[list][*] Tap Alchemy workstations to spawn an Alchemical Stores activator on the table.\r\n[*] Tap Enchanting workstations to spawn an Enchantment Stores activator on the table.\r\n[*] Equipable as a weapon but does no damage.\r\n[*] Usable 5 times, then \\\"poof\\\".  Time to dungeon dive for another pick.\r\n[*] Spawned activators may collide with existing objects on workstations, which won\\'t break your game but may break your activator.\r\n[*] Once spawned, Alchemy and Enchanting activators cannot be removed! \r\n[*] Requires (1 Embalming tool, 5 bone meal) to smelt.\r\n[/list]\r\n\r\n[color=Darkturquoise]Mystic Destruction Pick:[/color]\r\n[list][*]Used to remove activators spawned from keys\r\n[*] Strike an activator once and it will implode.\r\n[*] The original key is returned to your inventory.\r\n[*] => Equipable as weapon (with damage and tempering)\r\n[*] => Usable as a pickaxe (and pretty light).\r\n[*] => A re-decorator\\'s best friend.\r\n[*] Requires (1 Gold Ingot, 1 QuickSilver Ingot, 1 Moonstone Ingot, 1 Refined Malachite) to smelt.\r\n[/list]\r\n\r\n[heading][color=Springgreen]How to spawn activators:[/color][/heading]\r\n[list=1]\r\n[*]Stand precisely where you would like an activator located.  Activators spawn directly under your feet and will always face back at you.\r\n[*]Select a Mystic Key and drop from inventory.\r\n[*]Step back a bit ...\r\n[/list]\r\n\r\n[heading][color=Springgreen]How to install:[/color][/heading]\r\nThis archive is probably compatible with Nexus Mod manager, but I don\\'t know.  I do it the old fashioned way...\r\n\r\n[list=1]\r\n[*] Open the archive \r\n[*] Copy [color=yellow]GeneralStores.esm[/color] and [color=yellow]GeneralStores.bsa[/color] to your \\\\data directory. \r\n[*] Copy [color=yellow]CraftableCloudStorage(GS).esp[/color], and [color=yellow]CraftableCloudStorage(GS).bsa[/color] to your \\\\data directory. \r\n[*] Enable [color=yellow]GeneralStores.esm[/color] in the launcher of your choice.  Load order doesn\\'t really matter. BOSS will recognize and place the GeneralStores.esm\r\n[*] Enable [color=yellow]CraftableCloudStorage(GS).esp[/color] in the launcher of your choice.  Load order doesn\\'t really matter. \r\n[/list]\r\n\r\nIf you already have General Stores v2.3 installed, you can skip step 2.  Same files.\r\n\r\n[heading][color=Springgreen]Compatibility:[/color][B] No worries, Mate![/b][/heading]\r\nThe GeneralStores.esm master has only a microscopic footprint, adding a small amount of new content walled off from the rest of the game.  By itself, it makes no changes to nor has any interaction whatsoever with anything in Skyrim.  All items stored during gameplay are held by the esm, NOT by esp applications.  \r\n\r\n[color=yellow][Center][B]So long as GeneralStores.esm remains active, it will continue to safeguard your valuable gear.[/b][/center] [/color]\r\n\r\nWhether for necessity or temporary insanity, if you choose to disable CraftableCloudStorage(GS).esp all your stuff will remain safe and accessible through the GeneralStores demo home, Optional Asteria(GS) or any other GS compatible mod.\r\n\r\nCompatible with all mod and DLC added storable content via the heuristic learning containers.  Just add the new stuff to the appropriate container once and it will be recognized subsequently for all automation.  You will need to access the cistern to properly add new crafting materials or foods.\r\n\r\n[U]Likely[/u] incompatible with any mod that replaces or makes significant changes to the alchemy or enchanting workstations, as this mod uses custom meshes and scripts.  Retex & scripts mods may work.  Depends.\r\n\r\nMystic Embalming Pick will probably not work on highly custom workstations found in some mod homes.\r\n\r\n[heading][color=Springgreen]Helpful Hints:[/color][/heading]\r\n[list][*]I highly recommend a solid save of your game before you using Mystic artifacts for the first time.\r\n[/list]\r\n[list][*]Its a good idea to craft the Mystic Destruction Pick right away so you can play around with placement as you get a feel for the size and shape of the activators.  \r\n[/list]\r\n[list][*]When placing objects in-game, there is always the possibility of clipping.  Be mindful of your surroundings.\r\n[/list]\r\n[list][*]This mod cannot modify navmeshes dynamically, so think in terms of placement in corners rather than pathways where NPC\\'s normally walk.\r\n[/list]\r\n[list][*]Activators are designed for flat surfaces and may not orientate properly on steep slopes.\r\n[/list]\r\n[list][*]\\\"Crate and Barrel activators have no collision on the crates, which can be weird at times.\r\n[/list]\r\n[list][*]Activators spawn just in front of you so keep that in mind.  The most accurate way for you to control placement is by looking straight down.  And get the hell out of the way if you are in a height constrained place.\r\n[/list]\r\n[list][*]You need at least one General Stores Master Chest to access stores taken by an Unburden Fountain.  A trapdoor to the Cistern provides even better access and already has a Master Chest.\r\n[/list]\r\n[list][*] Autosorting with the master chest will auto-classify new items if it can.  If it can\\'t they remain in the chest, so always check back after sorting completes.  These items can be classified by adding them directly to containers in the cistern or the Master Chest menu.\r\n[/list]\r\n[list][*]There is a lot more info about what\\'s in the cistern and how this all works over at [URL=http://skyrim.nexusmods.com/mods/18340]General Stores[/url].\r\n[/list]\r\n\r\n[heading][color=Springgreen]Changelog:[/color][/heading]\r\n\r\nv2.3 compatibility update\r\n* compatible with GeneralStores v2.3\r\n* several bug fixes\r\n* new DLC compatibility patches\r\n* removed \\\"GS\\\" from object names\r\n\r\nv2.2 critical fix\r\n* Actually [B][I]includes[/b][/i] the fix in the release\r\n* updated crafting menu change \\\"grabs\\\" for OCD container access.  Grab Mystic will only snatch enough material to to craft one of each key.\r\n* updated pantry menu has two quickstore options plus access to the OCD set including ingredients (spices)\r\n\r\nv2.1 critical fix\r\n* Corrected function of Crafting activator\r\n\r\nv2.0\r\n* Updated to General Stores v2.21\r\n* Added Mystic GS Potions key / new Crate and Barrel activator\r\n* Added Mystic GS Pantry key / new Crate and Barrel activator\r\n* Removed disenchantment from Mystic GS Embalming Pick\r\n* Renamed all scripts\r\n \r\nv1.01 critical fix\r\n* Corrected function of Mystic GS Destruction Pick\r\n* Corrected effect name on Mystic GS Embalming Pick\r\n\r\nv1.0 Initial Release\r\n\r\n[heading][color=Springgreen]Credits:[/color][/heading]\r\n\r\nDefiniteIntegral for giving me the basics of effects scripting.  Literally.  You should check out his [URL=http://skyrim.nexusmods.com/mods/8971]Soul Forge[/URL].\r\nOaristys\\' [URL=http://skyrim.nexusmods.com/mods/16525]Modders Resource Pack[/URL].  Technically a part of GS, but given a leading role here so credits x 2. \r\nBarrels and Bread enhanced thanks to [URL=http://skyrim.nexusmods.com/mods/8655]Static Mesh Improvement Mod - SMIM[/url] by Brumbek, also part of GS but worth another plug.\r\n\r\n[heading][color=Springgreen]Re-Use:[/color][/heading]\r\nIt\\'s mine, all mine.  Oh, and Bethesda\\'s (just ask supernastypants).  You may use it freely and in perpetuity, but you cannot own it nor \\\"borrow\\\" from it.  Nor may you upload it to the Workshop.  It will break on Steam anyways.\r\n",
  "categoryId": "78",
  "version": "2.3",
  "author": "Harvey2112",
  "createdUnix": "1350088342",
  "updatedUnix": "1358630044",
  "containsAdultContent": false,
  "uploadedBy": "Harvey2112",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93640",
      "name": "CraftableCloudStorage_v1-1",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "25236",
      "fileName": "CraftableCloudStorage_v1-1-25422-1-01.7z",
      "uploadedUnix": "1350141178",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/3d4be86760e094b265e364a11d1a6340af51143c8cda673b209669e23f26f8b4/analysis/1407219795/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CraftableCloudStorage_v1-1-25422-1-01.7z?fid=93640&ttl=1535796910&ri=8192&rs=8192&setec=0ed33a71b55dc8e0afb9b13060e4b8ac"
    },
    {
      "fileId": "1000000206",
      "name": "CraftableCloudStorage_v2-2",
      "version": "2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "45438",
      "fileName": "CraftableCloudStorage_v2-2-25422-2-2.7z",
      "uploadedUnix": "1357417283",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/e9a759dd0fd3239cd9bc47885b5606995388def9600dc2d50c0c85eb71f8d6be/analysis/1407338818/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CraftableCloudStorage_v2-2-25422-2-2.7z?fid=1000000206&ttl=1535796911&ri=8192&rs=8192&setec=a9d563b1d9a88d72dfb295e67416c22e"
    },
    {
      "fileId": "1000003538",
      "name": "CraftableCloudStorage_v2-3",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "44387",
      "fileName": "CraftableCloudStorage_v2-3-25422-2-3.7z",
      "uploadedUnix": "1358629822",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/72be70be002e35035a2ed6c5af3554fc15a645620fa8f133de35861179251e2e/analysis/1407361877/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CraftableCloudStorage_v2-3-25422-2-3.7z?fid=1000003538&ttl=1535796911&ri=8192&rs=8192&setec=457d4a4f48b7da0e72bc1370571265c8"
    },
    {
      "fileId": "1000003541",
      "name": "CraftableCloudStorage_v2-3_lite",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5465",
      "fileName": "CraftableCloudStorage_v2-3_lite-25422-2-3.7z",
      "uploadedUnix": "1358630044",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/ff88bb5f54a75d20bb7907c967fec1345f891e011cbfacc8263b54f628c5f484/analysis/1407361883/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CraftableCloudStorage_v2-3_lite-25422-2-3.7z?fid=1000003541&ttl=1535796912&ri=8192&rs=8192&setec=14c275bf272a453381971cbe188e2bfb"
    }
  ]
}