{
  "modId": 25439.0,
  "modName": "Bridge Farm",
  "summary": "Small fortified farm near Dragonbridge on the Morthal Road. Milkable Cows, harvestable beehives, greenhouse with tomatoes, other harvestables, new recipes. Everything a player needs including all crafting needs, in a convenient location a short distance from Solitude.",
  "descriptionHtml": "[b][color=#ff0000]In light of recent changes to Valve and Steam workshop and Paying for mods.[/color]\r<br />[color=#ff0000]My mods are free to download and will remain so. [/color]\r<br />[color=#ff0000]I do not  give my permission for my mods to be uploaded to Steam Workshop or uploaded for Gaming Consols. This is not me being PC elitist. I don&#39;t own a gaming consol so I can&#39;t troubleshoot, maintain the mod or in any way be helpful to a user - if someone wants to do all that they are welcome to get in touch with me and ask to do so. [/color]\r<br />[color=#ff0000]I do not under any circumstances give my permission for any assets I personally have made for this mod to be used in a mod which then charges users money to download them.[/color]\r<br />[color=#ff0000]Other permissions remain as listed at the bottom of this page. [/color][/b]\r<br />\r<br />Bridge Farm\r<br /> \r<br />A small fortified enclosed smallholding near Dragonbridge, on the Morthal Road not far from Meeko’s shack.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/Bridge%20Farm%20Now%20finished%2011th%20Oct/TESV2012-09-2903-48-46-39.jpg[/img] \r<br /> \r<br /> SKYRE Farm Challenge Winner.  [url=http://skyrimrealestate.com]My link[/url] \r<br />Comes in two versions: \r<br />Version 1.4 works WITHOUT Hearthfire\r<br />Version 3.1 Needs Hearthfire DLC \r<br />\r<br />Hearthfire Version of Bridge Farm\r<br />Purchasable - READ THE FOR SALE SIGN, keys will be in your inventory automatically after purchase.\r<br />This version allows two children to move into the house.  If you want to move your children to the house then you MUST use TMPhoenix&#39;s mod (that mod also takes care of the spouse moving in and ensures that the spouse sleeps in the master bed and sandboxes correctly both indoors and outside the rest of the time) at \r<br />http://skyrim.nexusmods.com/mods/29249 \r<br />Please note that if you already have a game running where you have adopted a child already using the vanilla adoption TMPhoenix&#39;s mod will only allow you to move the original hearthfire 2 children and your spouse to a suitable mod home. If you wanted more children to adopt and move to a larger house you would have to start a new game and use his mod from the beginning in place of the vanilla adoption system. \r<br />This version has a small building in the garden which sleeps 3 followers in skyrim world space, they have a fireplace and all the comforts of home but can also guard your property and children.\r<br />If using TMPhoenix&#39;s mod the second bedroom has been redesigned to allow the two children to sleep and sandbox there, they will play both upstairs and downstairs and also go outside to play the same as hearthfire houses. Your spouse will also move in and out of the house and sandbox in both areas.\r<br />If not using the the adoption mod then its just a spare bedroom with some toys :)\r<br />The lighting has been reworked\r<br />You should also find that the gate is MUCH less likely to be opened by your followers or passers by\r<br />In the garden most of the existing planting has been removed and you now have 50 hearthfire planting mounds to grow and harvest exactly what you want. \r<br />\r<br />Non Hearthfire Version of the Farm \r<br />Has a master bedroom and a bedroom which will sleep 2 followers, this version has planting already in place and it is harvestable under the vanilla system (that means it will take some time to respawn/regrow items but you will get them back eventually. Added plants include tomatoes and blueberries which are also harvestable.\r<br />\r<br />Sleeps 4 maximum in Non Hearthfire Version. Sleeps 2 adults, 2 children and 3 followers in the Hearthfire version..\r<br />This farm has only a small interior space ideal for the lone player or one who only has one or two followers, add a dog and you are going to be over-crowded&#33;   However for the player without a horde of followers this home has everything you need in cosy surroundings.\r<br />3/4 indoor rooms, 2 exterior rooms and greenhouse.  \r<br />Fast travel marker to just outside the gate.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/Bridge%20Farm%20Now%20finished%2011th%20Oct/TESV2012-09-2901-16-14-39.jpg[/img] \r<br />[img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/Bridge%20Farm%20Now%20finished%2011th%20Oct/TESV2012-10-1018-16-12-23.jpg[/img]\r<br />\r<br />Features. \r<br />[img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/Bridge%20Farm%20Now%20finished%2011th%20Oct/TESV2012-10-1018-01-45-88.jpg[/img] \r<br />Milkable cows (just mouse over and click e – the cows won’t tell you they can be milked and it looks best if you don’t have a shield equiped), the animation sometimes has the cows kicking the bucket over but it generally works more often than not, I suspect cows kick buckets over all the time in real life. Our three Highland Cattle produce Bridge Farm Milk & Bridge Farm Cream daily.  Hearthfire Version produces a Jug of Milk (the same one as produced in the Hearthfire houses and for sale at some stores) and Bridge Farm Cream daily.\r<br />Honey can be collected daily from the beehives. Hearthfire version allows Honey and Honeycomb to be harvested on an occasional basis using the same models as the Hearthfire homes.\r<br />2 new recipes. Bridge Farm Snowberry Pie and Bridge Farm Coq Au Vin. Both recipes can be crafted at the range as there is no room for the Hearthfire oven in this house (- note that the Hearthfire version now has the Hearthfire Oven outside).\r<br />\r<br />Greenhouse with harvestable tomato plants (non hearthfire version) or planting mounds (hearthfire version).\r<br />Harvestable apple trees\r<br />Other harvestable plants including blueberries and tomatoes for the non hearthfire version. 50 planting mounds for Hearthfire users..  \r<br />The Hearthfire version allows the grain mill to be used and will convert 3 wheat, harvestable right outside the mill door, into 1 bag of flour.\r<br />The Hearthfire version has two butter churns, one in the dairy and one in the house, both of which will produce butter on an occasional basis.\r<br />Inside:\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/Bridge%20Farm%20Now%20finished%2011th%20Oct/TESV2012-09-2901-09-59-46.jpg[/img] \r<br />[img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/Bridge%20Farm%20Now%20finished%2011th%20Oct/TESV2012-09-2901-14-11-47.jpg[/img] \r<br /> \r<br />The top floor where the player enters has the kitchen, dining and lounging area. 2 upper shelving units and an area of counter near the dining table are player operated bookcases and can store 126 books. There is a sink with running water and it has plenty of themed hidden storage for food items, there are also 3 weapon racks.  Downstairs the house has a small office/storage area with 9 chests and two warm and cosy bedrooms, one of which has 2 weapon racks. \r<br />[img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/Bridge%20Farm%20Now%20finished%2011th%20Oct/TESV2012-09-2901-10-52-06.jpg[/img]\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/Bridge%20Farm%20Now%20finished%2011th%20Oct/TESV2012-09-2901-11-03-03.jpg[/img] \r<br /> \r<br />The house is lit in the day by natural sunlight but at night candles provide the illumination. There are no mannequins. Shrines are strategically placed both within the house and in the exterior areas.\r<br />Outside:\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/Bridge%20Farm%20Now%20finished%2011th%20Oct/TESV2012-10-1018-01-45-88.jpg[/img] \r<br />The smithing area is adjacent to the house, with other crafting needs accommodated on the walkway and deck area including a large storage chest. From the end of the walkway Solitude can just be seen in the distance.\r<br />Underneath the walkway is an outside washroom with sink, shower and toilet. \r<br />Further along is the dairy and cold store area where the harvest is stored before going to market and there is chilled storage to keep the milk and cream fresh. (The picture is from the non Hearthfire version – they look similar except the butter churn is on the floor and the milk is the Hearthfire variety not the bottles.)\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/Bridge%20Farm%20Now%20finished%2011th%20Oct/TESV2012-10-1018-00-41-78.jpg[/img]\r<br /> \r<br />Adjacent to the dairy is the stable where there is also a chopping block.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/Bridge%20Farm%20Now%20finished%2011th%20Oct/TESV2012-09-2913-29-52-68.jpg[/img]\r<br />The Greenhouse has harvestable tomatoes and jazzbay grapes, it also contains the alchemy and enchanting areas, there is a small player operated bookshelf which takes just 15 books and storage for all magical crafting needs including designated chests for scrolls and potions.\r<br /> \r<br />The entire farm is walled, with the cows and goats separate from the vegetable area, although the chickens are allowed to glean from the wheat field.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/Bridge%20Farm%20Now%20finished%2011th%20Oct/TESV2012-09-2901-16-32-81.jpg[/img]\r<br />All storage is safe.\r<br />The gate marker is high enough to allow a rider to open the gate without dismounting.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/modding%20skyrim/Bridge%20Farm%20Now%20finished%2011th%20Oct/TESV2012-09-2901-16-03-09.jpg[/img]\r<br />\r<br />thanks to svaalbard/insane0hflex for the vid\r<br />[youtube]ia5ZTOIvF6c[/youtube]\r<br />\r<br />[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/q3cn1.png[/img][/url][/center]\r<br /> \r<br />Known Issues\r<br />A lot of “stuff” in an exterior cell may cause problems for low end machines and probably fps drop. In common with my other mod this one contains a lot of statics used as decoration and a high end machine will run this mod much more easily. \r<br />The milking and honey harvesting are on-load scripts, what this means is that going back into the house for 24 hours won’t allow you to milk/collect honey again – however going about the business of being the dragonborn and travelling around in and out of the cell will refresh it, and you will be able to harvest regularly.  The Hearthfire version still uses the on-load script for milking however the beehives are different and only allow occasional harvesting.\r<br />For those wanting a larger player home check out my other mod Candle Pond Ranch which sleeps 9 followers: [url=http://skyrim.nexusmods.com/mods/23987]My link[/url]\r<br />Fully compatible with missjennabee’s  Expanded Towns and Cities mod (it is just across the river from Dragonbridge South):  [url=http://skyrim.nexusmods.com/mods/13608]My link[/url]\r<br />\r<br />No longer incompatible with the latest version of [url=http://www.nexusmods.com/skyrim/mods/9557/?]Arthmoor’s Alternate Start – Live Another Life[/url] Arthmoor moved his farm in that mod to make room for the one in Cutting Room Floor - so if you use Alternate Start but not Cutting Room Floor Bridge Farm will now work fine.\r<br />\r<br />Known conflict with [url=http://www.nexusmods.com/skyrim/mods/47327/?]Arthmoor’s Cutting Room Floor[/url]  which puts a farm in the same spot.\r<br />Reported conflict with WARZONES-Civil unrest, one of the spawn points for attackers seems to be located in the garden. Unconfirmed.\r<br />Conflicts with http://skyrim.nexusmods.com/mods/38273 Scholars Solace. Player home mod in the same location.\r<br />No other known conflicts but it will obviously conflict with any mod which alters the landscape in that area.\r<br />As seems usual with Skyrim too many house mods will cause issues.\r<br />For those experiencing the &#34;floating&#34; grass issue, this is a Bethesda bug. The fix is:\r<br />Open, in Your Documents folder, My Games, Skyrim,  the Skyrim.ini AND SkyrimPrefs.ini with notepad or other similar text editor and in the [grass] section\r<br />add the following\r<br />bAllowLoadGrass=0\r<br />bAllowCreateGrass=1\r<br />bDrawShaderGrass=1\r<br />that will fix the issue for you after adding those lines save the files and reload the game and it should be sorted.\r<br />\r<br />Changes: \r<br />2nd Aug2013. Uploaded a completly new Hearthfire version with childrens bedroom and hearthfire planting mounds. This version requires a clean install if you have been using the house previously.\r<br />22nd Dec 2012. v1.4 and 2.4 Fixed the deleted navmesh issue and recleaned both versions.\r<br />9th Nov 2012\r<br />Version 2.3 Hearthfire Version\r<br />Added the crafting oven. Also uploaded a pic so you can see where I have placed it. It isn&#39;t necessary to empty anything. Just move to another interior cell, save your game, load on the update, go in game and wait, sleep or kill dragons or something for 24 hours in game before returning to Bridge Farm. This version has altered the navmesh slightly to make it less likely that strangers will wander in or followers will wander out.\r<br />Version 1.3 standard version\r<br />Update with the navmesh correction to make it less likely that strangers will wander in or followers will wander out. It isn&#39;t necessary to do anything on this update - just download and add it, no need to move or do anything as it doesn&#39;t change anything except the navmesh by the gate.\r<br />29 Oct 2012. New versions 1.2 and 2.2 added, cleaned with Tes5Edit.\r<br />20 Oct. Added versions 1.1 and 2.1. This makes sure that respawning cows will also be able to be milked. New script ensures they stand still when being milked.  Corrected a spelling mistake on the Jewellery Chest in Main Bedroom. Corrected a clipping issue with a goblet in the the second bedroom.\r<br />Please remove all items from Gold & Jewellery Chest in Main bedroom, nothing else needs to be moved. Move to another location, preferably an interior cell someplace. Save the game. Load on new version to overwrite. Go in game and wait/sleep/kill a dragon someplace for 24 hours in game time before going back to Bridge Farm.\r<br />\r<br />Grateful thanks to the following:\r<br />Phaedra and Berticus0001 for advice. Check out Berts Hearthfire Dairy Resources @ [url=http://skyrim.nexusmods.com/mods/25239]My link[/url]\r<br />The players on Skyrim Real Estate especially Shezrie and Brendan62. \r<br />Tesalliances brilliant series of tutorials by Dark Rider for getting me started.\r<br />Everyone who makes resources available.\r<br />Bethesda for the game.\r<br />\r<br />Credits:\r<br />Blary for booksets, open books, food containers & potion shelves \r<br />Berticus0001 for milking and honey scripts. \r<br />ChickenDownUnder for Harvestables \r<br />Dark Rider for Celtic Decor pictures and frames\r<br />Daemonjax (lighting ball scripts) for New Hearthfire version\r<br />Insanity Sorrow for Chess Board, washing stuff, alchemy bits, watering can, butter churn, Ice cream churn and thread spools\r<br />Lilith for baskets of flowers and filled bowls\r<br />Merilia for Meshes and Textures for Snowberry Pie and Coq Au Vin\r<br />MJY for metal texture on chiller door \r<br />Nart2007 for glass panels \r<br />Oaristys & Tony67’s Modders Resource Pack for various meshes \r<br />Phaedra for Meshes and Textures for Milk and Cream  \r<br />WillieSea for Tomato Plants and Apple Trees (from Levellers Tower mod with permission for tomato plants also given by Elinen) \r<br />\r<br />I recommend the following mods:\r<br />More plants and recipes for Hearthfire by numberland http://skyrim.nexusmods.com/mods/26851 \r<br />Gives the choice of more plants for the hearthfire planting mounds, things like tomatoes and apple trees can now be grown and a lot of extras depending on which version you use.\r<br />Hearthfire Dolls are Ugly by Berticus0001  http://skyrim.nexusmods.com/mods/39377   Replacer for the fairly horrid hearthfire dolls that allows you to choose between various teddy bears or elf dolls\r<br />Another Mannequin Script Fix by Berticus0001 http://skyrim.nexusmods.com/mods/36301 \r<br />Stops the annoying unequiping of a mannequin&#39;s inventory if you are absent from the house for more than a day or two and fixes them in place. Berts installation instructions have to be followed completely for it to work correctly.",
  "categoryId": "67",
  "version": "3.1",
  "author": "Gentester",
  "createdUnix": "1350121158",
  "updatedUnix": "1395000284",
  "containsAdultContent": false,
  "uploadedBy": "gentester",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93601",
      "name": "Bridge Farm",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "47991",
      "fileName": "Bridge Farm-25439-1-0.rar",
      "uploadedUnix": "1350122008",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8c54f8ac34f814c94c4876d1c4652c3a726eacd5ee2460b8eeb47a133bfe4176/analysis/1407219257/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bridge%20Farm-25439-1-0.rar?fid=93601&ttl=1535796938&ri=8192&rs=8192&setec=8259c2c453d8d8e440e34096d9f1e8fd"
    },
    {
      "fileId": "93603",
      "name": "Bridge Farm Hearthfire Version",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "47423",
      "fileName": "Bridge Farm Hearthfire Version-25439-2-0.rar",
      "uploadedUnix": "1350122698",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/3df438650b1ab605028ed84011a6693d85ac52da857f9cbfccec9040d0b2da65/analysis/1407219276/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bridge%20Farm%20Hearthfire%20Version-25439-2-0.rar?fid=93603&ttl=1535796939&ri=8192&rs=8192&setec=42eda04cc45b3b5329b712b7f38d0084"
    },
    {
      "fileId": "94795",
      "name": "Bridge Farm",
      "version": "v1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40786",
      "fileName": "Bridge Farm-25439-v1-1.rar",
      "uploadedUnix": "1350745761",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/61c48496b64e1901aa0dcd2723fe487ecc39b0e8b632e91d909e8fb575f01f36/analysis/1407229876/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bridge%20Farm-25439-v1-1.rar?fid=94795&ttl=1535796939&ri=8192&rs=8192&setec=7c0a1db484451a2d233d7027204019bb"
    },
    {
      "fileId": "94796",
      "name": "Bridge Farm Hearthfire Version",
      "version": "V2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40219",
      "fileName": "Bridge Farm Hearthfire Version-25439-V2-1.rar",
      "uploadedUnix": "1350746335",
      "modVersion": "V2.1",
      "virusScanUrl": "https://www.virustotal.com/file/705cbfa8ca0c31c05170898ded192cc3ed965ce2633e15015ad4ad46d51f2a1c/analysis/1407229885/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bridge%20Farm%20Hearthfire%20Version-25439-V2-1.rar?fid=94796&ttl=1535796939&ri=8192&rs=8192&setec=8848a226ad42be76f18dee6dfade29b8"
    },
    {
      "fileId": "96443",
      "name": "Bridge Farm",
      "version": "v1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40765",
      "fileName": "Bridge Farm-25439-v1-2.rar",
      "uploadedUnix": "1351484216",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/2d8aa33945cc9a5d7e389ffe700b366a7978d9a70362d96dea34652c9b4ffe06/analysis/1407240321/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bridge%20Farm-25439-v1-2.rar?fid=96443&ttl=1535796940&ri=8192&rs=8192&setec=580297ec9660892bb2540f10cde9a82f"
    },
    {
      "fileId": "96452",
      "name": "Bridge Farm Hearthfire Version",
      "version": "V2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40198",
      "fileName": "Bridge Farm Hearthfire Version-25439-V2-2.rar",
      "uploadedUnix": "1351490379",
      "modVersion": "V2.2",
      "virusScanUrl": "https://www.virustotal.com/file/5f4389b87cec7f5a5a318da1f1ffbe4f888f14a04b275243325e2ff4b7b46aff/analysis/1407240442/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bridge%20Farm%20Hearthfire%20Version-25439-V2-2.rar?fid=96452&ttl=1535796940&ri=8192&rs=8192&setec=49c577ea577a0741df571991d0d2cf17"
    },
    {
      "fileId": "98277",
      "name": "Bridge Farm Hearthfire Version",
      "version": "V2.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40196",
      "fileName": "Bridge Farm Hearthfire Version-25439-V2-3.rar",
      "uploadedUnix": "1352475349",
      "modVersion": "V2.3",
      "virusScanUrl": "https://www.virustotal.com/file/d7f606c2519813c8a977535e6bed7481b9e0b629c69cb66346fa453c4c7d0ff5/analysis/1407255447/",
      "changelogHtml": " Added crafting oven to hearthfire version, altered navmesh to make it less likely that strangers will walk in or followers will walk out. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bridge%20Farm%20Hearthfire%20Version-25439-V2-3.rar?fid=98277&ttl=1535796941&ri=8192&rs=8192&setec=59de1fbeb86135f3c2a24668490faf5c"
    },
    {
      "fileId": "98281",
      "name": "Bridge Farm",
      "version": "V1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40761",
      "fileName": "Bridge Farm-25439-V1-3.rar",
      "uploadedUnix": "1352478135",
      "modVersion": "V1.3",
      "virusScanUrl": "https://www.virustotal.com/file/bdbd726b0999e1d4fe298feab5a8bc3203a5c7282f7eb0ee20e9811f2af1bd16/analysis/1407255497/",
      "changelogHtml": " Tweaked the navmesh to make it less likely that strangers will walk in or followers will wander out <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bridge%20Farm-25439-V1-3.rar?fid=98281&ttl=1535796941&ri=8192&rs=8192&setec=6c335a6f0c9e8e2a7d9c596a1878eae1"
    },
    {
      "fileId": "106768",
      "name": "Bridge Farm",
      "version": "v1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "40761",
      "fileName": "Bridge Farm-25439-v1-4.rar",
      "uploadedUnix": "1356161776",
      "modVersion": "v1.4",
      "virusScanUrl": "https://www.virustotal.com/file/2e97badb39b92ece42ae280b52f56d6731c7a390bca4350ea6897caf3de79967/analysis/1407316776/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bridge%20Farm-25439-v1-4.rar?fid=106768&ttl=1535796942&ri=8192&rs=8192&setec=0be0030c1e2c70dbf18e6c34ecd9b918"
    },
    {
      "fileId": "106769",
      "name": "Bridge Farm Hearthfire Version",
      "version": "v2.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40196",
      "fileName": "Bridge Farm Hearthfire Version-25439-v2-4.rar",
      "uploadedUnix": "1356162315",
      "modVersion": "v2.4",
      "virusScanUrl": "https://www.virustotal.com/file/6f0d1a502f997074ef797500a6ea78401de0c3fab23d9fb4a950d58339112431/analysis/1407316809/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bridge%20Farm%20Hearthfire%20Version-25439-v2-4.rar?fid=106769&ttl=1535796942&ri=8192&rs=8192&setec=010365a450202d3da495de3b674a2054"
    },
    {
      "fileId": "1000043314",
      "name": "Bridge Farm Hearthfire Version",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "50656",
      "fileName": "Bridge Farm Hearthfire Version-25439-3-0.rar",
      "uploadedUnix": "1375397033",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/a6311b8e5f289654b411c7abc941dfdb0f0b84a1c19511151f706657ebe6d6ad/analysis/1407665852/",
      "changelogHtml": " New File added for Hearthfire Version. Requires a Clean Install <br/> \n Added Scholars Solace to list of conflicting mods <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bridge%20Farm%20Hearthfire%20Version-25439-3-0.rar?fid=1000043314&ttl=1535796943&ri=8192&rs=8192&setec=bad5a07e7ee7782d0e23f60ea7f39cd4"
    },
    {
      "fileId": "1000101432",
      "name": "Bridge Farm Hearthfire Version",
      "version": "3.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "50657",
      "fileName": "Bridge Farm Hearthfire Version-25439-3-1.rar",
      "uploadedUnix": "1395000284",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/84fafc49669bed4cedb69853ff33301c55f0480bf782753688f09e1b7826465f/analysis/1407984791/",
      "changelogHtml": " 24 April. Added note to top of mod profile page <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bridge%20Farm%20Hearthfire%20Version-25439-3-1.rar?fid=1000101432&ttl=1535796943&ri=8192&rs=8192&setec=3691c19e932240afcfb5b8131657633f"
    }
  ]
}