{
  "modId": 25452.0,
  "modName": "Magic Duel - Reborn Spanish translation",
  "summary": "Traducción de este curioso mod que te permitirá tener duelos entre magos como nunca antes los habías visto.",
  "descriptionHtml": "[CENTER]\r\nTraducción al castellano del mod \\\"Magic Duel - Reborn\\\" de Seb263.\r\n[i]Esta traducción requiere del mod original:[/i]\r\n[url=http://skyrim.nexusmods.com/mods/34583]-Magic Duel - Reborn-[/url]\r\n\r\n[LINE]\r\n\r\n\r\n[color=red]En el siguiente enlace explica como mejorar la estabilidad del mod[/color]\r\n[url=http://skyrim.nexusmods.com/articles/1143]Mejorar estabilidad de Magic Duel - Reborn[/url]\r\n\r\n\r\n\r\n[LINE]\r\n\r\n[color=orange]DESCRIPCIÓN Y CARACTERÍSTICAS[/color]\r\n\r\n[/CENTER]\r\nPara explicar que hace este mod en profundidad, os traiga la propia traducción del libro que se te dará nada más instalar el mod:\r\n\r\n\r\n\r\n[b]Bienvenido a la guía Duel Magic: Reborn.[/b]\r\nEncontrarás toda la información de como modificar los duelos.\r\n\r\nPrimero de todo, NO FUNCIONARA si no estás usando SKSE.\r\nSi abriendo este libro recibes el mensaje de que SKSE no está instalado, por favor sigue las instrucciones en el mensaje\r\n\r\n[color=lime]Capítulo I : Lanzar condiciones[/color]\r\n[color=lime]Capítulo II : Como funciona[/color]\r\n[color=lime]Capítulo III : Parámetros[/color]\r\n[color=lime]Capítulo IV : F.A.Q[/color]\r\n\r\n[color=lime]Lanzar Condiciones[/color]\r\n\r\nAntes de usar tu magia para empezar un duelo, tienes que estar a cierta distancia de tu enemigo :\r\nEntre 7.15m y 25m para todos los NPCs excepto dragones.\r\nEntre 10.70m y 28.50m para dragones.\r\n\r\nLos tipos de magia que pueden empezar un duelo son 4 :\r\nFuego, hielo, descarga y drenación\r\n\r\nPara dragones, los gritos que pueden empezar un duelo son los siguientes :\r\n\\\"Yol Toor Shul\\\", \\\"liz Slen Nus\\\" y \\\"Fus Ro Dah\\\" (saber todas las 3 palabras de un grito no es obligatorio).\r\n\r\n\r\nNota : Solo los gritos empezarán duelos con dragones, y solo la magia empezará duelos con NPCs\r\n\r\nPara intentar un duelo, debes lanzar tu hechizo / grito al mismo tiempo que tu enemigo lanza un hechizo / grito. \r\n\r\nLas probabilidades de empezar un duelo pueden ser cambiadas en los parámetros.\r\n\r\n\r\n[color=lime]Como funciona[/color]\r\n\r\n[color=orange]Duelos contra otros NPCs o criaturas.[/color]\r\n\r\nUna vez que el duelo se inicia, tendrás que alternar entre click izquierdo y derecho (aunque puedes cambiar las claves) para empujar el hechizo del enemigo hacia él.\r\nSi te las arreglas para alternar tus ataques correctamente, el indicador overdrive1 se llenará más rápido dándote ventaja.\r\nDurante el duelo, las barras de magia de ambos duelistas se agotará. Si bien se vacía o no, el perdedor recibe daño proporcional a su progreso en el duelo.\r\n\r\n\r\nUna vez que uno de los duelistas es derrotado, recibirá daño basado en la fuerza del ganador y también será noqueado en función de esa fuerza.\r\nTambién puedes encontrar un movimiento final único para cada elemento.\r\n\r\nSi los NPCs en el área inmediata no están ocupados peleando con alguien más, pueden ser espectadores del duelo y animar a su persona favorita.\r\n[pagebreak]\r\n\r\n1) Indicador Overdrive: El indicador Overdrive se representa con la barra de salud (rojo), te permite realizar tu hechizo más poderoso a costa de drenar magia más rápido.\r\nUna vez que se activa el Overdrive, la barra drena rápidamente y sólos tiene unos momentos para disfrutar de tu aumento de poder.\r\n\r\n2) Barra de Magia: La magia del jugador es representada por defecto por la barra azul, la barra de magia del enemigo está representada por la barra de energía (verde).\r\nEstos barras representan con exactitud el estado de tu magia y de tu enemigo.\r\n\r\n\r\n[color=orange]Duelos contra dragones[/color]\r\n\r\nAl comienzo del duelo, tendrás acceso a un hechizo de protección (mano derecha), así como un grito del mismo tipo que el que utilizaste al iniciar el duelo.\r\n\r\nPara ganar el duelo, es necesario acabar con el dragón con tu grito mientras él trata de hacer lo mismo.\r\nPara que tus ataques sean más eficientes, tu grito tiene que llegar a la boca del dragón en el momento en que está a punto de atacar.\r\nLa precisión es incluso más importante que en los duelos clásicos.\r\nNo olvides que cada grito se compone de 3 partes dependiendo de que palabras hallas aprendido.\r\n\r\n\r\nTambién hay que tener en cuenta que un grito de un elemento opuesto al utilizado por el dragón va a hacer más daño.\r\nTambién puedes utilizar Desgarro de Dragones para debilitar a tu enemigo antes de un duelo.\r\n\r\nSi tu grito se está recargando, puedes protegerte mediante el hechizo de protección a costa de drenar tu magia.\r\n\r\nLa salud del dragón está representada por su barra de aguante (verde).\r\n\r\n\r\n\r\n[color=lime]Parámetros[/color]\r\n\r\nComo usted probablemente ya sabe, es libre de volver a definir todos los parámetros de duelo para satisfacer sus necesidades y deseos.\r\n\r\nSi desea utilizar SkyUI, también tiene acceso al menú de configuración MCM disponible en el menú de pausa.\r\nSi no lo tiene instalado, puede acceder al menú clásico a través de este libro.\r\n\r\nAmbos menús ofrecen exactamente las mismas opciones, no se limitarán al no utilizar SkyUI.\r\n\r\n\r\n[color=lime]FAQ[/color]\r\n\r\nPregunta: ¿Es posible usar un mando para los duelos?\r\nRespuesta: Si, no olvides redefinir las hotkeys via menú de configuración.\r\n\r\nProblema:Tengo problemas para empezar un duelo / He perdido el libro del mod. \r\nSolución:Usa la opción \\\"resetear mod\\\" en el menú de configuración para reiniciar el mod. Si no tienes SkyUI y has perdido el libro, escribe \\\"StartQuest MDRResetQuest\\\" en la consola.\r\n\r\n\r\nProblema: Durante un duelo, no veo el impacto de los hechizos y las acciones entre mi personaje y el enemigo no están sincronizadas.\r\nSolución: Su equipo puede estar teniendo dificultades en la gestión de los duelos. Considere la posibilidad de la reducción de sus gráficos en la configuración.\r\n\r\nProblema: Estoy atascado en un duelo, es imposible moverse o progresar.\r\nSolución: Utilice la función de depuración (por defecto F12) para obligar a detener el duelo y recuperar el control de tu personaje.\r\n\r\n[LINE]\r\n\r\n[i]En el siguiente enlace podréis encontrar más mods traducidos al español.[/i]\r\n[url=http://skyrim.nexusmods.com/mods/34137]Translations and mods to spanish in the nexus[/url]\r\n\r\n\r\n[size=12][i][b]Thanks to Seb263 for this mod.[/b][/i][/size]\r\n",
  "categoryId": "24",
  "version": "v1.0.0",
  "author": "jalmpitt",
  "createdUnix": "1350138968",
  "updatedUnix": "1365678609",
  "containsAdultContent": false,
  "uploadedBy": "jalmpitt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013338",
      "name": "MagicDuel v1-1-4 spanish translation",
      "version": "v1.1.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "19",
      "fileName": "MagicDuel v1-1-4 spanish translation-25452-v1-1-4.rar",
      "uploadedUnix": "1361870221",
      "modVersion": "v1.1.4",
      "virusScanUrl": "https://www.virustotal.com/file/0100123be7fecb938c74f7c53c9aedd85ff7c1fc004226b7bf2958d18334cc46/analysis/1407440303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MagicDuel%20v1-1-4%20spanish%20translation-25452-v1-1-4.rar?fid=1000013338&ttl=1535796975&ri=8192&rs=8192&setec=710284fc93e236eb6ce63aee2dada232"
    },
    {
      "fileId": "1000023438",
      "name": "MagicDuelReborn V1-0-0 Spanish",
      "version": "v1.0.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24",
      "fileName": "MagicDuelReborn V1-0-0 Spanish-25452-v1-0-0.rar",
      "uploadedUnix": "1365507739",
      "modVersion": "v1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/30faaffb7385a5a3965e9905f6a3abb3f8c643dc8773158badff48b368371efd/analysis/1407513967/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MagicDuelReborn%20V1-0-0%20Spanish-25452-v1-0-0.rar?fid=1000023438&ttl=1535796976&ri=8192&rs=8192&setec=35db6dcb4537cda622ad8d9dc6fb5a0b"
    },
    {
      "fileId": "1000023769",
      "name": "MagicDuelReborn v1-0-0 Spanish Mas Menu MCM",
      "version": "v1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26",
      "fileName": "MagicDuelReborn v1-0-0 Spanish Mas Menu MCM-25452-v1-0-0.rar",
      "uploadedUnix": "1365678609",
      "modVersion": "v1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/c5b2b05e13b05eb57152b333403966c07652629290db88fbc074d8df403e3bff/analysis/1407516784/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MagicDuelReborn%20v1-0-0%20Spanish%20Mas%20Menu%20MCM-25452-v1-0-0.rar?fid=1000023769&ttl=1535796976&ri=8192&rs=8192&setec=06a76ae4235026f08de6637e03c92847"
    }
  ]
}