{
  "modId": 25475.0,
  "modName": "Hire your own Housecarl",
  "summary": "Allows you to dismiss and hire a Housecarl of your own choice.",
  "descriptionHtml": "IMPORTANT: The features of this mod are now included in my Hearthfire Enhanced. If you intend to use that mod, or already used previous versions of it, install or update it BEFORE removing this as it will recover the housecarls you assigned with this one. Do NOT install this after updating HFE to 1.22. This mod won&#39;t get anymore updates but still can be used if you don&#39;t want HFE.\r<br />\r<br />The last version requires HearthFire, the last non HF version is still available on nexus as old version and on steam as separate mod from the HF one.\r<br />As I mentioned the vanilla one won&#39;t be updated any longer even if I add new feature, it may have bug fixes but as nothing was reported yet that&#39;s unlikely too.\r<br />\r<br />Update procedure if you used the vanilla version:\r<br />First of all you MUST unsubscribe for the old version if you used vanilla from steam. The esp name was changed and you really MUST NOT have both enabled at the same time.\r<br />Recommended procedure is a clean save: disable/delete the old version, if you got the new version already make sure it&#39;s not enabled at this time; enter the game and load your save ignoring the warning; save(=the clean save) and exit the game; enable the new mod and load the clean save.\r<br />By following this the mod will attempt to figure the housecarls you replaced and/or the vacant positions.\r<br />Check your current assignments using &#34;sqv LH_Housecarls&#34; in the console: you can see the &#34;assigned&#34; housecarls and compare the id&#39;s with the &#34;candidate&#34; ones to see if they look like what you expected.\r<br />(There&#39;s also possible to use Wrye Bash to switch to the new esp but if you don&#39;t know what I mean I won&#39;t help you butcher your game, trust me it&#39;s better to use the clean save, if you go for WB use &#34;setquestaliases LH_Housecarls&#34; from the console to populate the added aliases)\r<br />Sorry, couldn&#39;t find a easier way for the upgrade procedure and not screw it for the people who don&#39;t have HF.\r<br />\r<br />The main feature will be to dismiss vanilla assigned housecarl and the ability to recruit your own...somehow similar with recruiting blades or stewards. I will also aim to give housecarls something useful to do.\r<br />The mod will try to be lore friendly, yet the lore for them is not sufficiently established in ES so real world premedieval lore will be the model. This means housecarls are bodyguards, warrior type, they won&#39;t do your groceries.\r<br />\r<br />Current features\r<br />Dismiss housecarls. They will go to the local inn after that and you may hire them back.\r<br />Talk to some vanilla followers to hire them in the place of the dismissed housecarls. See next section for candidate NPCs.\r<br />If default housecarls were dead, assigned to the Blades or you married one of them even before adding this mod their position should be free as soon as you start using this.\r<br />\r<br />Candidates NPC\r<br />You can check which vanilla followers can become housecarls using &#34;sqv LH_Housecarls&#34;. Navigate with PgUp/Dn and will notice their ingame names and reference ids. To get an idea they are: the hirelings form inns, companions non werewolfs, the two orcs from the forts in the western part of map, some other followers with simple vanilla quests, the default hosecarls to be rehired or hired in different hold.\r<br />For other NPC to become candidate for the job please use the console: &#34;help housecarlcandidate&#34;, select the npc so it&#39;s id get displayed then type &#34;addtofaction XXX&#34; where XXX is the id of the faction returned by the help command. I urge you to test this one as even the final version may not provide a choice for your preferred NPC, modded followers should work too this way, try to use it on a potential follower as this mod won&#39;t make them followers if hired as housecarls.\r<br />\r<br />Issues\r<br />Dialogue options should appear for the assigned housecarls to dismiss them and for candidates to be hired if you have an open position for them but to may be affected by now the classical dialogue bug so: load, save, load after installing this mod.\r<br />\r<br />Compatibility considerations\r<br />AI (packages) are assigned via a quest with a priority of 20. If the packages are modified by a quest of lower priority the housecarls will go for the schedule defined by my mod, if they are modified by a higher priority quest they will go for the other schedule. AI (packages) for default vanilla housecarls (non HF) while they are assigned to their original house will not be overwritten so expect to see them doing their original or modded by others schedule if it was changed by other mod.\r<br />I will try not to touch any NPC directly, not even the vanilla housecarls. All will be done via aliases. So it should be compatible with any cosmetic housecarls enhancements as long as the reference is not changed.\r<br />All testing will be done with my current multiple followers mod (EFF) so expect full compatibility even with other similar ones.",
  "categoryId": "66",
  "version": "1.01",
  "author": "LukeH",
  "createdUnix": "1350172031",
  "updatedUnix": "1359586140",
  "containsAdultContent": false,
  "uploadedBy": "LukeH",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103398",
      "name": "HireableHousecarl_vanilla",
      "version": "0.90",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10",
      "fileName": "HireableHousecarl-25475-0-90.zip",
      "uploadedUnix": "1354743141",
      "modVersion": "0.90",
      "virusScanUrl": "https://www.virustotal.com/file/5567aff461a08df7d541f8f0fae4f6a2c05baeb34e401f6007cab2179f6e4712/analysis/1407292564/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HireableHousecarl-25475-0-90.zip?fid=103398&ttl=1535797020&ri=8192&rs=8192&setec=e6575c2a71957d3ea9196caa2dea68e7"
    },
    {
      "fileId": "108137",
      "name": "HireableHousecarls_100",
      "version": "1.00.HF",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "HireableHousecarls-25475-1-00-HF.zip",
      "uploadedUnix": "1356736291",
      "modVersion": "1.00.HF",
      "virusScanUrl": "https://www.virustotal.com/file/0417d72c2ece30e04499b07323cdf548830c0d0d41764ae30c777dfcc542fd32/analysis/1407326403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HireableHousecarls-25475-1-00-HF.zip?fid=108137&ttl=1535797021&ri=8192&rs=8192&setec=7541dd73e01adcd11bc6e49b696e604f"
    },
    {
      "fileId": "1000005998",
      "name": "HireableHousecarls",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "HireableHousecarls-25475-1-01.zip",
      "uploadedUnix": "1359586140",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/afbb984c352c95b99dd10fbd6062ffa60c50d8eec050fd396f8f046a6beb5bd2/analysis/1407387980/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HireableHousecarls-25475-1-01.zip?fid=1000005998&ttl=1535797021&ri=8192&rs=8192&setec=c9ec749a2f201999c3889c6048113ad3"
    }
  ]
}