{
  "modId": 25482.0,
  "modName": "Outpost Rognar",
  "summary": "(WIP) adds a new fort that will soon look and feel like it was ment to be apart of skyrim",
  "descriptionHtml": "things to know before you download...\r\n\r\nthis is a (WIP) \\\"work in progress\\\"  \r\n\r\nyou DO NOT NEED dawnguard for this mod!\r\n\r\nTHE LOCATION: make you\\'re way to the \\\"Valtheim Towers\\\" north of \\\"The Throat of The World\\\", inorder to get to the outpost as of now, you need to clear out the bandits that are held up in these tower\\'s \r\n\r\nWHAT ALL IS, OR WILL BE ADDED?: as of right know it add\\'s a new fort a few NPC\\'s and one that you can marry! once it is finished it will add a few player houses, new faction, and a few quest\\'s that will allow you to pick a side for this fort to take, will you aid the empire or will you help unite the rebels to take over skyrim?\r\n\r\nsome FAQ\\'s!\r\n\r\nQ: this mod is crashing my game!\r\nA: mod\\'s are very stupid, a lot of them if they are anywhere in the same area will not work properly. Any mods you have in this location will not work. only mod i know of is divide and conquer, it will not work with this mod.\r\n\r\nQ: can we help with this mod?!\r\nA: yes but you must ask me first\r\n\r\nQ: why do you not have a map marker at this fort so we can go right to it?\r\nA: as i have said above, it is not a finished mod.\r\n\r\nQ: why do you not just upload this when you are done?\r\nA: because it goes much faster when i have the public help test it out. so i do not finish the mod and it turns out, \\\" oh hey half the fort i fall through\\\" and i will have to re do everything.\r\n\r\nbe sure to endorse  and track your favorite mod\\'s show your support for the modder\\'s out there!\r\n\r\nP.S. if you are going to post a comment about any grammar mistakes, just do not post. show respect to all modder\\'s by keeping the comments about the mod and not the words to describe the mod. thank you",
  "categoryId": "68",
  "version": "V1",
  "author": "chunkymodder",
  "createdUnix": "1350185790",
  "updatedUnix": "1350185904",
  "containsAdultContent": false,
  "uploadedBy": "Chunkymodder",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93751",
      "name": "rognar",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "309",
      "fileName": "rognar-25482-V1.rar",
      "uploadedUnix": "1350185904",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/5ac362f961faec79a1e01fb00a027b42f85977cf7ef20e55f110f4881db5aae9/analysis/1407220925/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/rognar-25482-V1.rar?fid=93751&ttl=1535797033&ri=8192&rs=8192&setec=64d0ea0bbb16dc7561cf9b9df372e620"
    }
  ]
}