{
  "modId": 25535.0,
  "modName": "Economics of Skyrim - German Translation",
  "summary": "Dies ist die deutsche Übersetzung der Mod Economics of Skyrim von Thomas Kaira\r\n\r\nThis is the german translation of the mod Economics of Skyrim by Thomas Kaira",
  "descriptionHtml": "Auszug aus der Readme\r\n--------------------------------\r\n\r\n\r\nEconomics of Skyrim\r\nEin intensiver Ökonomie-Overhaul für Elder Scroll V: Skyrim\r\n\r\nVorraussetzungen:\r\n-\tSkyrim version 1.6.89.0.1 oder neuer. Frühere Versionen WERDEN NICHT FUNKTIONIEREN. \r\n-\tSkyrim Script Extender 1.05.9 oder neuer. Einige Dinge die diese Mod tut, kann Papyrus selbst nicht umsetzen. Deswegen wird der Skyrim Script Extender benötigt, du kannst ihn hier herunterladen:\r\nhttp://skse.silverlock.org\r\n\r\nHaufig gestellte Fragen/Fehlersuche\r\n\tQ: Wieso sind verzauberte Gegenstände manchmal günstiger als ihre Grundgegenstände?\r\n\tA: Weil sie sich ihre Wertinformation nicht mit den Grundgegenständen teilen. Bedauerlicherweise wäre es schrecklich unpraktisch sie einzubinden damit sich ihre Werte ändern. (es sind einfach zu viele) Dieser Fehler ist bekannt und es gibt nichts um das zu korrigieren, also bitte nicht fragen.\r\n\tQ: Wieso brauch das Regionale Werte Script solang um ausgeführt zu werden?\r\n\tA: Weil die Papyrus VM eine schreckliche Plattform ist um große Mengen von Items zu handlen. Wenn du es nicht magst, kannst du die Regionalen Werte ausschalten. \r\n\tQ: Ich bekomme nie eine Aufforderung die Mod zu starten. Was kann ich tun?\r\n\tA: Downloade die Loose Scripts Version der Mod und nutze sie stattdessen. Dies tritt auf wenn das Spiel es nicht schafft die Scripte korrekt zu laden wenn die Mod startet. Wenn dies dein Problem nicht löst überprüfe deine Versionsnummer. Wenn sie unter 1.6.89 ist musst du dein Spiel aktualisieren.\r\n\tQ: Ich habe Skyrim Script Extender installiert! Wieso sagt mir die Mod das es nicht installiert ist?\r\n\tA: Du hast Skyrim Script Extender nicht VOLLSTÄNDIG installiert. Du kannst nicht mehr nur die SKSE DLLs und die Loader in deinen Spieleordner platzieren; du musst auch alle Dateien für den Data Ordner platzieren. Ansonsten ist Papyrus nicht in der Lage auf die neuen Funktionen zuzugreifen und die Mod wird den \\\"SKSE nicht installiert\\\" Fehler melden.\r\n\r\nÜbersicht\r\n\tDu bist bei deinem lokalen Schmied angekommen und kaufst neue Spielzeuge, Rüstungen, was auch immer du willst. Ist dir jemals etwas seltsames aufgefallen? Wie zum Beispiel das jeder einzelne Schmied genau die selben Gegenstände auf Lager hat? Nun, das kommt weil es nunmal so ist.\r\n\tJeder Haupt-Händler im Spiel bekommt sein Lager durch ein einziges Standardarrangement von Leveled Lists, welche sowohl ihre Vorräte randomisieren und es besser gesagt an dein Level anpasst. Es funktioniert doch es ist sehr unelegant und kann einem die Augenbrauen hochziehn lassen wenn der Schmied der nichts ausser minderwertigen Stahl verkauft plötzlich beim nächsten Mal eine Bootsladung voll Ebenerz im Angebot hat.\r\n\tWürde es nicht sehr viel mehr Sinn machen wenn die Vorräte der Händler sich an den Rohstoffen orientieren die es in der Region zu finden gibt? Dies sind keine modernen Zeiten, Händler verlassen sich nicht darauf Sachen zu kaufen um sie wieder zu verkaufen; sie verkaufen was sie herstellen. Ich finde die Ökonomie des Spiels sollte dies wiederspiegeln. Das ist wo die Mod ins Spiel kommt.\r\n\r\n\t\r\nFunktionen\r\n\r\nRegionale Vorräte\r\n\tMit dieser Mod werden die Vorräte der Händler sehr viel unterschiedlicher. Der Schmied in Weißlauf zum Beispiel wird eine viel stärker abweichende Auswahl an Gütern haben als der Schmied in Rifton. Und dies ist weil die Rohstoffe die den beiden Schmieden zur Verfügung stehen sehr viel unterschiedlicher sind.\r\n\tJede der neun Festen hat ihre eigen Personalität und Atmosphäre und nun werden die Händler in dies integriert. Alles, von den Waffen und Rüstungen die du bei den Schmieden kaufst, bis hin zu den Tellern und dem Besteck das du bei den lokalen Krämerläden kaufst wird nun unterschiedlich zwischen den Städten und Händlern sein. \r\n\tVerschiedene Faktoren fließen in die Variation ein:\r\n\r\n1.\tRohstoffe: Womit müssen die lokalen Händler arbeiten? Bei einer Feste mit einer großen Versorgung an Eisen wird man Eisen und Stahlwaren im Überfluss beim Schmied sehen,  und Gastwirte werden verschiedene Menus zwischen den Städten haben abhängig von den Essensquellen.\r\n2.\tWohlstand: Wieviel Geld haben die Personen in der Gegend zur Verfügung? Schmiede neigen nicht dazu sich darum viel zu kümmern, wenn ihre Metallarbeiten gut sind kommen ihre Geschäfte aus ganz Skyrim. Jeder andere jedoch wird ziemlich oft seine Vorräte danach richten was sich die örtlichen Bewohner leisten können. Feiner Schmuck kann in Markarth etwa in Fülle gefunden werden, doch in Rifton ist er beinahe nicht existent. Warum? Weil Rifton nicht annähernd so eine wohlhabende Stadt ist wie Markarth. Ganz einfach.\r\n3.\tVerfügbarkeit: Wenn Rohstoffe nicht sofort verfügbar sind in der Region, kaufen Händler oftmals einige ihrer Güter in angrenzenden Regionen. Auf diese Weise wirst du manchmal untypische Waren zum Verkauf sehen. Allerdings sind diese nicht garantiert auf Vorrat da die Händler versuchen so wenig wie möglich Güter von anderen zu kaufen.\r\n4.\tAktuelle Ereignisse: Skyrim ist im Krieg. Vorräte orientieren sich gezwungenermaßen an den Bedürfnissen der Truppen. Erwarte nicht soviel Eisen und Pfeile zu finden wie vorher.\r\n\r\nDie oben genannten Faktoren nutzend wird jeder Händler im Spiel neu ausgestatten sodass die Gegenstände die sie verkaufen stark davon abhängen wo in der Welt sie sich befinden. Das meiste ihrer Vorräte stammt aus lokalen Gütern, mit einer kleineren Menge die sie von reisenden Händlern erhalten. Darüber hinaus wurde das meiste der Levelskalierung entfernt, sodass das was ein Händler an einem Tag verkauft sehr wahrscheinlich auch ein paar Wochen und ein paar Drachen später noch verkauft.\r\n\r\nRegionale Werte\r\nNicht nur was die Händler verkaufen ist abhängig von der Region, sondern auch was sie tatsäclich dafür bezahlen. Während du reist wirst du eventuell festellen das die angezeigten Werte der Items die du trägst schwanken. Was du siehst ist wieviel Händler in der Gegend bereit sind zu zahlen für die Items die du mit dir herumträgst. Du wirst nicht allzu viel Gewinn machen wenn du Schmuck in Markarth verkaufst, aufgrund des Überflusses an Gold und Silber in der Region, doch in Weißlauf kannst du einen sehr viel besseren Handel machen damit.\r\nDu hast die Notwendigkeit schnell  etwas Geld zu machen? Warum nicht SELBST der fahrende Händler für die nicht lokalen Güter sein die jemand anderes verkauft? Wenn du die Rolle des reisenden Händlers spielen möchtest ist diese Mod genau dein Weg dafür.\r\n\r\nExtra Händlergold\r\nSehen wir es ein; Händler haben einfach zu wenig Gold um mit der hochwertigen Beute die wir später im Spiel zu ihnen bringen. So, nun nicht mehr! Diese Mod bietet einige Optionen wieviel extra Gold die Händler erhalten sollen aus denen du wählen kannst. Diese sind:\r\n1.\tVanilla (Keine Änderung)\r\n2.\tMehr (+500 extra Gold)\r\n3.\tViel Mehr (+1000 extra Gold)\r\n4.\tReich (+2000 extra Gold)\r\n5.\tSpreng die Bank! (+5000 extra Gold)\r\nDu kannst wählen welche auch immer du magst. Und du kannst dies wann immer du willst ändern, jedoch bitte achte darauf das zuliebe der Balance deine Änderungen keinen Effekt auf Händler haben die du bereits besucht hast bis ihre Inventare neu aufgefüllt werden.\r\n\r\nSchmiededienstleistungen\r\nSchmiede sind zu mehr gut als nur einen Ort zum kaufen von Waffen und Rüstung. Schmiedearbeiten sind ein feines Handwerk das weit mehr umfasst als gewöhnliche Verkäufe, somit können sie nun dieses Handwerk für dich ausführen. Alles was du brauchst sind einige Münzen zum ausgeben.\r\n\r\n1.\tVerbessern: Schmiede können nun für dich deine Waffen verbessern wenn du es nicht selbst machen willst. Ein neues Dialogthema ist bei allen Schmieden verfügbar während sie Dienstleistungen anbieten: \\\"Kannst du meine Ausrüstung verbessern?\\\" Wähle es aus und der Schmied wird dich fragen ob du deine Waffen oder deine Rüstung verbessert haben willst. Wähle welches du haben möchtest (oder ändere deine Meinung wenn du das Thema versehentlich angeklickt hast) und der Schmied wird dich darüber informieren bis zu welcher Qualität es ihm möglich ist deine Ausrüstung zu verbessern, und wird dies tun. Zu einem gewissen Preis.\r\n2.\tBestellen: Die Schmiede hat nicht den unglaublichen Dwemerhelm hinter dem du her bist? Wieso nicht darum bitten ihn herzustellen? Ein neues Dialogthema ist verfügbar bei allen Schmieden: \\\" Kann ich etwas Ausrüstung bestellen?\\\" Wähle es aus und der Schmied wird dir eine Liste aller Waffen und Rüstungen zeigen die er für dich herstellen kann(es variiert nach Region, sodass verschiedene Schmiede verschiedene Güter anbieten). Für jeden Gegenstand den du bestellst musst du einen Spieltag warten bevor du deine Bestellung abholen kannst (also wenn du drei Gegenstände bestellst musst du drei Tage warten). Eine Quest wird für dich angezeigt welches zeigt wie lange du noch warten musst, ermöglicht dir leichten Überblick über deine Bestellungen zu behalten und aktualisiert sich alle 24 Stunden. Sobald die volle Zeit die du warten musst abgelaufen ist, wird die Quest aktualisiert und sagt dir das deine Bestellung bei dem jeweiligen Schmied abgeholt werden kann und ein Questmarker wird dir den Weg zum Schmied zeigen (falls du es vergessen hast). Rede wieder mit ihm, frage \\\"Ist meine Ausrüstung fertig?\\\" und du wirst deine glänzende neue Ausrüstung erhalten. Du kannst allerdings nur 10 Bestellungen gleichzeitig laufen haben.\r\n3.\tBeide dieser Funktionen sind universell kompatibel sodass es dir möglich ist sie bei jedem Schmied in der Welt zu finden, inklusive solcher die durch andere Mods hinzugefügt werden.\r\n\r\n\r\nInstallation\r\nSkyrim Script Extender wird benötigt! Keine Wenns und Abers, du brauchst ihn und gut!\r\n\r\nWrye Bash Nutzer: Die Mod hat ein BAIN-freundliches Format sodass du sie schnell in deinen Installer Ordner schieben kannst und installieren.\r\n\r\nNexus Mod Manager Nutzer: Nexus Mod Manager ist in der Lage das Archiv dieser Mod zu verarbeiten, du musst nichts ausgefallenes tun. Einfach in FOMOD konvertieren und installieren.\r\n\r\nFalls du keins von den oberen nutzt: Ziehe die Dateien in deinen Skyrim\\\\Data Ordner.\r\n\r\nNutzer von Fuz-Ro-Doh (ein Universal Silent Voice SKSE plugin) können die optionale \\\"No Silent Voice\\\" Datei herunterladen, welche keine silent MP3s für die neuen Dialoge enthält und dir so ein wenig Speicherplatz spart.\r\n\r\n\r\nDeinstallation\r\nEs werden keine extra Schritte benötigt wenn du die Mod deinstallieren möchtest. da die Änderungen zu den Itemwerte aktuell nie im Savegame gespeichert werden(Die Moddaten ja aber nicht die aktuellen Werte selbst). Wenn du speicherst und beendest während die Regionalen Werte aktiv sind, die Mod deaktivierst und zurückkehrst sind alle Item Werte wieder normal.\r\nEs wird empfohlen das Spiel entfernt von allen Händlern zu speichern und nachdem du die Mod deinstalliert hast 2 Tage wartest bis die Inventare von allen Händlern zurückgesetzt wurden. Es ist nicht unbedingt notwendig dies zu tun, jedoch werden die Modänderungen bleiben bis die Vorräte der Händler zurückgesetzt wurden.\r\n\r\nWrye Bash Nutzer: Sehr leicht, Navigiere einfach zu deinen Installers tab und wähle  Uninstall.\r\nNexus Mod Manager: Nochmal, sehr leicht. Deaktiviere einfach die Mod.\r\nFalls du keins von den oberen nutzt: Folge einfach den Schritten vom Steam Workshop bis auf Unsubscribe.\r\n\r\nKonfigurieren der Mod\r\n\r\nNeues Spiel: Aufgrund der Notwendigkeit Probleme mit der Spielstartszene in Helgen (und allgemein) zu vermeiden und um Unterbrechungen zu vermeiden wird die Mod erst nachdem du die Introsequenz bis zu dem Punkt abgeschlossen hast an dem deine Fesseln zerschnitten werden (kurz nachdem du die Unterkunft in Helgen betrittst) gestartet. Oder wenn du eine Alternativer Start Mod wie Live Another Life nutzt nachdem du die Startzelle verlässt. Sobald eine dieser Konditionen erfüllt wurde wird dir ein Menü-Item (eine Goldmünze namens +Skyrim Ökonomie Optionen+) gegeben und eine Nachricht wird angezeigt die dir mitteilt das es nun sicher ist die Mod zu starten.\r\n\r\nBestehendes Spiel: Die Nachricht das es sicher ist die Mod zu starten wird eine Sekunde nachdem du das Spiel geladen hast erscheinen.\r\n\r\nNachdem du benachrichtigt wurdest das Economics of Skyrim ist bereit, kannst du die Mod starten wann immer du willst indem du die Menü-Münze nutzst. Sobald du dies tust wird die Mod beginnen die Anfangsdaten die sie benötigt um voll funktionfähig zu sein. Wenn dies erledigt ist bekommst du eine Nachricht ob du die Regionale Werte Funktion aktivieren nun aktivieren möchtest oder sie deaktiviert lassen möchtest. Wenn du wählst sie deaktiviert zu lassen, kannst du sie wann immer du willst im Menü aktivieren.\r\nDie verfügbaren Optionen im Menü sind:\r\nExtra Gold: Hier wählst du wieviel extra Gold du den Händlern geben willst. Jeder Knopf wird genau das tun was oben in der Funktionensektion beschrieben ist.\r\nRegionale Werte: Optionen zum konfigurieren der Regionale Werte Scripte können hier gefunden werden. Dies sind:\r\n>Aktiviere/Deaktiviere Regionale Werte: Schaltet die Regionale Werte Funktion an bzw. aus.\r\n>Benachrichtigungen: Wenn du willst kann die Mod dich benachrichtigen wenn die Regionale Werte Aktualisierungen starten und enden. Dies kann hier eingestellt werden.\r\n>Werte neu berechnen: Dies teilt der Mod mit das Regional Werte Aktualisierungsscript erneut laufen zu lassen. Dies kannst du nutzen falls deine Itemwerte durcheinander gebracht wurden und du sie zurücksetzen willst.\r\n>Regionale Info: Diese Option zeigt dir eine Beschreibung der Hauptrohstoffe und den Status der lokalen Ökonomie der Region in der du dich gerade befindest. Oder wenn du dich in keiner der neun Regionen befindest bekommst du eine Nachricht darüber.\r\n\r\nKompatibilität\r\nDiese Mod ist nicht mehr länger inkompatibel mit Mods die die Basishändlercontainer oder ihre Leveled Lists bearbeiten*.\r\n* Die Nutzung des Wrye Bash Bashed Patch ist notwendig um ideale Kompatibilität sicherzustellen. Die Mod ist bereits getagged sodass du nur die Leveled Lists dieser Mode in den Bashed Patch importieren musst.\r\n\tNutzer der vorigen Kompatibilitätspatches: Diese sind nun überflüssig. Bitte entferne sie aus deiner Ladereihenfolge.\r\n\tMöglicherweise bemerkst du das einige Items vom Schmied verbessert werden können die nicht am Schleifstein/Werkbank verbessert werden können. Dies ist weil diese Mod an USKP (Unofficial Skyrim Patch) angepasst ist und USKP macht diese Items verbesserbar. Deshalb diese Mod ebenfalls.\r\nFalls du weitere Inkompatibilitäten in deinem Spiel entdeckst berichte sie. Es gibt keine Garantie das sie angegangen werden doch wenn es durchaus gefordert wird ist es wahrscheinlich.\r\n\r\nAktuelle Liste inkompatibler Mods (nicht nutzen):\r\n-\tCutthroat Merchants (Alle Plugins): Diese Mod erlaubt dir bereits die Händlerschwieirigkeit in einem weitaus größeren Grade als Cutthroat Merchants einzustellen. Es gibt keinen ersichtlichen Grunde beide Mods zusammen zu nutzen.\r\n\r\nBekannte Probleme\r\n\tRegionale Werte ändert nicht die Werte von bereits verzauberten Gegenständen. Dies ist so weil ihre Wertinformationen seperat von den Werten der Basisitems sind und sie in Regionale Werte zu integrieren ist hoffnungslos unpraktisch (die Scripte würden viel zu lange zum ausführen brauchen). Die kann und wird nicht gefixt.",
  "categoryId": "69",
  "version": "1.3",
  "author": "Thomas Kaira and Exte",
  "createdUnix": "1350258375",
  "updatedUnix": "1350258419",
  "containsAdultContent": false,
  "uploadedBy": "exte",
  "primaryFile": null,
  "files": [
    {
      "fileId": "93930",
      "name": "Economics of Skyrim v1_3 DV",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "182",
      "fileName": "Economics of Skyrim v1_3 DV-25535-1-3.rar",
      "uploadedUnix": "1350258419",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/679964c3de4f005774b63a1b738c53a7c4e501dd59c6ba9de7e31aded685ff49/analysis/1407222484/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Economics%20of%20Skyrim%20v1_3%20DV-25535-1-3.rar?fid=93930&ttl=1535797103&ri=8192&rs=8192&setec=45a46e6be39e93afe53aecb45df8c107"
    }
  ]
}