{
  "modId": 25592.0,
  "modName": "Summoning Conjurations and Zombies Ravages Magicka",
  "summary": "Summoning conjurations or raising zombies ravages the player\\'s magicka for the duration of the spell, but you can summon as many as you can maintain.",
  "descriptionHtml": "Multiple minions, but at a price.  Summoning conjurations or raising zombies reduces the player\\'s maximum magicka by the same amount as the spell would normally cost and that reduction lasts for as long as the spell itself would normally last.\r\nSo for example, if you have 200 magicka and your skills are such that each familiar costs 50, you could cast four of them, but you will then not be able to cast any spells at all until at least one of them expires.  More likely you would cast for example two of them and then be limited to 100 magicka for other spells until the diminished magicka wears off.  \r\nThis only affects the player (not NPCs) and only results from the listed spells (Familiars, Atronachs, and Undead from other sources behave as normal)\r\n\r\nAffected spells are:\r\nConjure Familiar\r\nRaise Zombie\r\nConjure Boneman DG\r\nConjure Flame Atronach\r\nReanimate Corpse\r\nSummon Arvak DG\r\nConjure Frost Atronach\r\nConjure Mistman DG\r\nRevenant\r\nConjure Dragon Priest\r\nConjure Dremora Lord\r\nConjure Storm Atronach\r\nConjure Wrathman DG\r\nDread Zombie\r\n\r\nInstallation:\r\nI use NMM, but you can just put it in your data folder if you prefer.\r\nThen ingame go to the Guardian Stones and click on the MageStone to add the perk \\\"Multi Souls\\\".\r\nYou don\\'t need to accept the mage sign, just clicking the stone will activate the mod.\r\n(Version 1.0 users should either update or refer to the console instructions below)\r\n\r\nCompatibility:\r\nThis is my first public mod so I make no claims except that it is working well for me.\r\nPretty much the only native objects this mod touches are the Novice->Expert summon and zombie Spells. (the SPELLs themselves, not any MGEFs)\r\nI am using it with 3352 by Kachajal and 23547 by DaBritt87 which are great and mostly compatible. (load this after DaBritt87\\'s)\r\n\r\nBackStory:\r\nI wanted to build a pure mage that focused on conjuration almost exclusively (no armor, no weapons, no destrcution) just conjuration, illusion and alteration. [enchanting is overpowered so i don\\'t use it on any of my characters anymore]\r\nIn order for that to be viable, or fun, my first thought was \\\"I\\'ll just change the twin souls perk to allow me unlimited summons.\\\" but that was extremely over-powered because the spells are actually quite cheap, I could recover the magicka and cast again just a few seconds later.  \r\nSo I searched the Nexus and found DeanCarter\\'s mod \\\"Conjuration Modification\\\" 10335. It was a great concept, but the comments said it wasnt working at all, the ravage values are arbitrary and he changed a ton of other things because he decided the summons should last forever: I disagree, so I launched the SCK and started from scratch, but DeanCarter gets credit for the inspiration.  \r\n\r\nVersion 2.0:\r\nPrevious uploads didn\\'t include the script files (a rookie mistake).  Now it should work the same for you as it does for me.\r\n\r\nVersion 1.2:\r\nPotions of fortify Conjuration and the perks Atromancy and Necromancy extend the duration of the magicka reduction by only half as much as they extend the duration of the spell.\r\nWith previous versions there was little incentive to boost the time on your summons because the \\'ravagecost\\' was also extended, this makes it useful again.\r\nAtromancy for example will extend a 1 minute atronach to 2 minutes but your magicka will be diminished for only 1.5 minutes.\r\n\r\nVersion 1.0 Console Perk Addition:\r\nhit ` to enter the console and type \\\"help multi\\\" it will list the perk along with its formID (the first few characters depend on your load order but it will end in \\\"003323\\\"\r\ntype \\\"player.addperk XX003323\\\" [without the quotes of course, and replacing the XX with whatever is listed by the help command]\r\n* You can easily diable all effects of the mod ingame with \\\"player.removeperk XX003323\\\"",
  "categoryId": "93",
  "version": "2.0",
  "author": "MaxCarnage",
  "createdUnix": "1350398221",
  "updatedUnix": "1353452023",
  "containsAdultContent": false,
  "uploadedBy": "MaxCarnageCanis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "94528",
      "name": "SummonsRavageMagicka101",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "SummonsRavageMagicka101-25592-1-01.7z",
      "uploadedUnix": "1350600095",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/e46385f4b1142720d74e9f9377c1ba7d9e7a387435bed971149ccf06873edf7c/analysis/1407228136/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SummonsRavageMagicka101-25592-1-01.7z?fid=94528&ttl=1535797179&ri=8192&rs=8192&setec=db10aa85e3df00b054322f298e17accd"
    },
    {
      "fileId": "95695",
      "name": "SummonsRavageMagicka12",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "SummonsRavageMagicka12v-25592-1-2.7z",
      "uploadedUnix": "1351152520",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/f50b64d96c5b76c78d7f0f64ff6c545470856aa0d8037b9a023f233b9b006a85/analysis/1407235451/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SummonsRavageMagicka12v-25592-1-2.7z?fid=95695&ttl=1535797180&ri=8192&rs=8192&setec=33b04ca23ae9cf4b4afbd622bff88ac6"
    },
    {
      "fileId": "100775",
      "name": "SummonsRavageMagicka20",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "SummonsRavageMagicka20-25592-2-0.7z",
      "uploadedUnix": "1353452023",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/cea64fde2d2a4139727f0525742e006986f721b9eb924c23eff13398008a118e/analysis/1407271623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SummonsRavageMagicka20-25592-2-0.7z?fid=100775&ttl=1535797180&ri=8192&rs=8192&setec=4440f38d91d86978e74beb01a76422f1"
    }
  ]
}