{
  "modId": 25696.0,
  "modName": "Bigger and Badder LICH KING Collectors Edition",
  "summary": "READ Main Discription \r<br />This is a revamp of the Original Lich King Armor and Weapons with many changes.\r<br />Included are new Visual Energy Effects that Envelope Your Sword and a unique enchant &#34;Soul Devour&#34;\r<br />THE GIANT CLAW HAND is an OPTIONAL SHIELD, YOU DO NOT HAVE TO USE IT&#33;",
  "descriptionHtml": "[color=red][b][color=#00ff00]NEW NOTES:  First, please read the text before asking questions.  Second, the broken pieces of Frostmourne are the broken rusty sword bits in Ysgramor&#39;s Tomb.  Third, I need to relearn modding as I have spent way way to much time away from gamming, currently trying.  Fourth, &#34;Soul Devour&#34; is not the same as &#34;Soul Trap&#34;.  You cannot fill gems with &#34;Soul Devour&#34;, &#34;Soul Devour&#34; is basically the sword itself eating the souls of everything you kill, much like Frostmourne would.  Also, there is no loud Thunder Clap sound when Soul Devour is used, instead you get a whispering wind type sound.  If you have an issue, please read the below text, please.  Lastly, if your issue is already addressed below, then I will simply delete your question, no anger intended.  Enjoy.[/color]\r<br />\r<br />&#33;&#33;&#33;&#33;&#33;&#33;&#33;YOU MUST have Skyrim updated to 1.5 or higher&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;  Collectors edition is Lore friendly, requiring more challenging crafting materials and newly named items (for those that had my old mod, you will have to recraft or cheat to get the main body armor back, due to new naming of items).  Frostmournes Damage has been increased by 3 base points, must find &#34;Frostmourne Remanants&#34; in Ysgramor Tomb&#34;.  If you like, PLEASE take the time to endorse, currently hiring a team to bring this to perfection.  \r<br />&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;AND ONE OTHER THING&#33;, when switching between mask, ensure you actually TAKE OFF one mask than equip the OTHER&#33;&#33;&#33;&#33;&#33;  If you simple just switch mask, than the Blue Draugr glowing eye ORBS and blue body mist sometimes shut off without turning back ON&#33;  Unfortunatly, over 50 people will make this error and send me a message :/ [/b][/color]  (this happens because the enchant on one mask is being shut off when you simply switch, not allowing the enchant for the other one to turn on.  Remember, simply unequip one mask than equip the other)\r<br />\r<br />[youtube]2oKCYCMsmcU[/youtube] [youtube]w6Ckw0A56C0[/youtube]\r<br />[youtube]4DPawhIz2Yw[/youtube] [youtube]44PKUvMuQE4[/youtube]\r<br />\r<br />[color=red][b]  EACH HELMET IS EITHER A 2 or 3 PIECE SYSTEM, FOLLOW THESE INSTRUCTIONS\r<br />-X- Three Helmet Versions (Note, helmets are either 3 piece or 2 piece systems)&#33;&#33;&#33;&#33;&#33;\r<br />--------Lich King’s Helmet + Lich King’s Mail Hood + Shadow Mask (What I use)\r<br />--------Lich King’s Helmet + Lich King’s Mail Hood + Warlord Mask\r<br />--------Lich King’s Helmet + Lich King’s Skull[/b][/color]\r<br />\r<br />-First Change, all items are now in the &#34;DragonArmor/Plate of the Damned&#34; Smithing perk, requiring 100 skill level to attain.  Armor is stronger than Daedric by 5 rating points per piece.\r<br />\r<br />-Second MAJOR change, all file paths have been remade, this took awhile.  What does that mean?  That this MOD will NOT affect any other Lich King Mods you may have, so now you can have Jojjo&#39;s or anyone else&#39;s version along with mine at the same time.\r<br />\r<br />-Thrid MAJOR change, all vertices have been edited, stretched, reshaped or compressed and tested 1 millimeter at a time, to give you the largest suit I could make without causing extreme clipping.  YOU NEED to see the difference in game.  The overall frame of the character (while in armor) will be INCREASED with this edition.  \r<br />\r<br /> -All textures are permanently adjusted to the &#34;Wrath of the Lich King addition&#34; from fellow modder Mitchhunter.  The armor in-game looks awsome and now matches the helmet which many of you complained about.  All future updates will use these Textures, further seperating this from previous Lich King Mods.\r<br />\r<br />[heading][color=teal][b]Nice Mods to use with Mine[/b][/color][/heading]\r<br />--  If you want the &#34;Bigger Badder one handed frostmourne&#34; to mount on your back, use nockchaa&#39;s mod at http://skyrim.nexusmods.com/mods/6276/?tab=2&navtag=/ajax/modimages/?user=0|:|id=6276      It would look lame for a giant sword to mount on your hip....\r<br />\r<br />-- If you want to sound like a deep voiced killer&#33; (and if your using the nord) download &#34;Change my nord voice&#34; by hardermob at http://skyrim.nexusmods.com/mods/16572 .  Otherwise your Lich King will continue to sound like an elf going through puberty..... the defualt voice for all races is the wood elf :/    \r<br />\r<br />[heading][color=teal][b]*******ARMOR ITEMS INCLUDED*********[/b][/color][/heading]\r<br />-X- Four Versions of Armor\r<br />--------Normal (The one I use in the photos)\r<br />--------Smaller Belt\r<br />--------Capeless\r<br />--------Capeless with Smaller Belt\r<br />All stats for the armor are Daedric plus 5 additional armor rating points per item.  \r<br />\r<br />[color=red][b]\r<br />-X- Three Helmet Versions (Note, helmets are either 3 piece or 2 piece systems)&#33;&#33;&#33;&#33;&#33;\r<br />--------Lich King’s Helmet + Lich King’s Mail Hood + Shadow Mask (What I use)\r<br />--------Lich King’s Helmet + Lich King’s Mail Hood + Warlord Mask\r<br />--------Lich King’s Helmet + Lich King’s Skull[/b][/color]\r<br />\r<br />-X- Three Versions of Frostmourne\r<br />--------1 Handed\r<br />--------2 Handed\r<br />--------2 Handed Special (Can Use Shields)\r<br />All Versions of Frostmourne use Identical Stats.  Two handed Daedric Damage+3 additional damage points, One handed Daedric Speed and an extended damage reach.  Frostmourne now comes equipped with a special enchant.\r<br />\r<br />The Sword will have an energy field created by myself “LuciferX10” and a special Soul Devour Enchant that DefiniteIntegral, whose scripting talents far surpass mine, greatly aided me in.  Soul Devour will show the souls of your enemy slowly being ripped from their body’s while you fight them.  Once dead it will play the soul trap animation.  Every kill will play these effects, however the thunder clash sound effect does not play.  You will still hear it in “soul trap”, it is only removed from “soul devour”.  Also, soul stones/gems are not needed for this enchant, it will always play.\r<br />\r<br />-X- One version of the “Claw Shield of Dreadful Force”\r<br />The enchant is the same as the spellbreaker shield, HOWEVER, the visual effect is MUCH COOLER as it now use the same visuals as the greater Ward Spell.  If shield effect does not display, just un-equip and re-equip it and it shoud be fine.  Also note that the shield was scaled for the larger armors and may not look right with other armors. \r<br />\r<br />[heading][color=teal][b]*******TO ACCESS THESE ITEMS*********[/b][/color][/heading]\r<br />Console command via &#34;Help Lich 4&#34; and &#34;Help frostmourne 4&#34; or learn how to smith Dragon Armor, all my items can be found under the Dragon Smithing Tree,(THE MASK AND MAIL HOOD REQUIRE NO CRAFTING MATERIALs to Make, as they are for looks only).  If you are using another Lich King mod, such as Jojjo’s, you will find my items have slightly different names, to further differentiate them from Jojjo’s (in case you like to use both and want easy ways to identify the items in the console menu, all my items have an “X” in the front and end, EXAMPLE: “X Lich King’s Helmet X”.  \r<br />\r<br />Furthermore, my Frostmourne is just called “X Frostmoure X”  or  “X Frostmourne (2-handed) X” NOT “Frostmourne Sword” or “Frostmourne Greatsword” those will be from other MODS you may have installed.\r<br />\r<br />[heading][color=teal][b]*******NOTES*********[/b][/color][/heading]\r<br />*A note to other modders, if you’re playing with my meshes in your &#34;personnel mods&#34; the chest will now look crooked in Nifskope but leave it, because it is actually much more even in game now. \r<br />\r<br />I know the Lich King does not have a mask or chain mail hood under his helmet, however, no one has been able to replicate the glowing eyes and shadowed face, soooo........\r<br />In order to have the glowing eyes, I used a mask with a script that allows the Draugr glowing eye effect to be turned on and off with the removal of the mask.  (NO MORE GLITCHING DRAUGR EYES THAT NEVER SHUT OFF).  ( The Glowing eyes will look like crap on a normal face, the mask is a must).  The mask itself does have glowing blue eyes, but I like the addition of the Draugr glowing eyes combined with mine.\r<br />\r<br />In order to make the mask fit the inside of the helmet, I had to make the character face/head vanish, (to avoid a mask clipping through your face).  However because there was no longer a head, I had to add an inner chain mail hood to hide the neck and ear slots of the helm.  Otherwise it would look like you had no head or neck under the Lich King Helm.  The original helm has been shrunken ever so slightly and lowered in order to match up with the Draugr Glowing eye effect.  So if you wear my helm without the other 2 pieces, your forehead might clip &#34;ever-so-slightly&#34; through the helmet.  When all three pieces are worn together the helmet becomes completely compatible with all races.  This helmet was designed to wear all three peices\r<br />\r<br />[color=blue][i]Credits:\r<br />Jojjo - for then original Lich King mod http://skyrim.nexusmods.com/mods/6348/?tab=2&navtag=/ajax/modimages/?user=0|:|id=6348\r<br />\r<br />Elixiir - for the lighting effects on frostmourne eyes and runes (Not the energy field around the blade, that was me)\r<br />http://skyrim.nexusmods.com/mods/6031/?tab=2&navtag=/ajax/modimages/?user=0|:|id=6031\r<br />\r<br />Ancalor1995, DRK973, and cat_woman1989 for the original Darksiders mask that I heavely modified.  And glove that I rescaled and posistioned to use as a shield.  http://skyrim.nexusmods.com/mods/14392\r<br />\r<br />Shadowjin for the awsome textures I used on my Claw Shield\r<br />\r<br />Sasino for the original Mail Hood\r<br />http://skyrim.nexusmods.com/mods/13944[/i][/color][i]\r<br />[color=red]Please note that the mailhood included in this mod cannot work without the mask, nor is it wide enough to function as a stand alone hood, please visit his mod if you would like a proper stand-alone mail hood.[/color]\r<br />\r<br />[color=blue]Faelrin and Alnnxs for the work they did on the cape for Jojjo&#39;s mod.\r<br />Mitchhunter for his awsome textures\r<br />\r<br />SpaceWiking for use of part of one of his scripts that enables the use of Draugr eyes without out the horrible permanent eye effect glitch.\r<br />\r<br />DefiniteIntegral for his help in developing the Soul Devour Enchant, you should check out his mod at http://skyrim.nexusmods.com/mods/8971 to access the AWSOME soul forge and soul snare enchant.  Soul Snare does not include the energy field of the blade, yet it will steal all the souls and store them in a containment unit like in “Ghost Busters” so you won’t need so many soul stones/gems.  There is much more than that, so go check out his mod&#33;&#33;&#33;&#33;[/color][/i]",
  "categoryId": "54",
  "version": "2.0",
  "author": "LuciferX10",
  "createdUnix": "1350622305",
  "updatedUnix": "1352075769",
  "containsAdultContent": false,
  "uploadedBy": "LuciferX10",
  "primaryFile": null,
  "files": [
    {
      "fileId": "94570",
      "name": "Bigger and Badder Lich King",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "92606",
      "fileName": "Bigger and Badder Lich King-25696-2-0.zip",
      "uploadedUnix": "1350622896",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/899704717a75bfba1ad17465a4cc7d7e039c02ef5a77b8b441cfdd56b1faabed/analysis/1407228459/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bigger%20and%20Badder%20Lich%20King-25696-2-0.zip?fid=94570&ttl=1535797349&ri=8192&rs=8192&setec=3e70dcc23a8d8c34908fb51531082418"
    },
    {
      "fileId": "94731",
      "name": "3 Additional Versions of Frostmourne without Soul Devour",
      "version": "Optional",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7",
      "fileName": "3 Additional Versions of Frostmourne without Soul Devour-25696-Optional.zip",
      "uploadedUnix": "1350708637",
      "modVersion": "Optional",
      "virusScanUrl": "https://www.virustotal.com/file/5e0da7b4eae1b0b4b821c4df8e206efe7bf38f5439c7e6ed89bddabdb81c025e/analysis/1407229392/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/3%20Additional%20Versions%20of%20Frostmourne%20without%20Soul%20Devour-25696-Optional.zip?fid=94731&ttl=1535797349&ri=8192&rs=8192&setec=6d7b41d5b80647d6d838ce32005c5ed1"
    },
    {
      "fileId": "95049",
      "name": "Lich King Collectors Edition- 2 additional opptional armor variants",
      "version": "Optional",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5705",
      "fileName": "Lich King Collectors Edition- 2 additional opptional armor variants-25696-Optional.zip",
      "uploadedUnix": "1350847998",
      "modVersion": "Optional",
      "virusScanUrl": "https://www.virustotal.com/file/40642d6d3139ff93c21f6128efa414af4cfd1c4d5dc5e14fad68fd34b7a2b1d3/analysis/1407231487/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lich%20King%20Collectors%20Edition-%202%20additional%20opptional%20armor%20variants-25696-Optional.zip?fid=95049&ttl=1535797350&ri=8192&rs=8192&setec=78dbc183a8c41092f6bb018ed4ba1a7a"
    },
    {
      "fileId": "97576",
      "name": "Lich King Collectors Edition-3 Additional Armor Variants",
      "version": "Optional",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8609",
      "fileName": "Lich King Collectors Edition 3 Additional Armor Variants-25696-Optional.zip",
      "uploadedUnix": "1352075769",
      "modVersion": "Optional",
      "virusScanUrl": "https://www.virustotal.com/file/638ddb59ec2a62fd032e2cc2993d629f5a111d14a7d01d56a9131098489aeb7e/analysis/1407250043/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lich%20King%20Collectors%20Edition%203%20Additional%20Armor%20Variants-25696-Optional.zip?fid=97576&ttl=1535797350&ri=8192&rs=8192&setec=f74ffbfb9daf9070805b99a5046b52fb"
    }
  ]
}