{
  "modId": 25727.0,
  "modName": "Stairway to Heaven - suspended updates until further notice",
  "summary": "Adds a new player home in Heaven",
  "descriptionHtml": "This mod is a work in progress. It adds a player house in Heaven. To get there, you must climb an extremely long flight of stairs going up into the stratosphere. The stairway begins northeast of Riften. At the end of the stairway lies a gate. Go through it to enter a new player home. Be sure to read the book on a table in front of you detailing instructions on how to get back up to Heaven without climbing the stairs again. You will also meet a familiar resident who does nothing but sits on his throne.\r\n\r\nThis is a starter player home I am using to learn all the aspects of the Creation Kit. Updates in the future will include:\r\n\r\nA stockable bookshelf\r\nA few quests\r\nNPCs in the form of angels\r\nMore furnishings\r\nOptimization\r\n\r\nUPDATE: It will be at least two more weeks until this mod is updated. I have recovered my hard drive to its original factory settings  to perform a clean upgrade to Windows 8 and as a result, my programs and Skyrim files have uninstalled. I will be gradually restoring my programs and files from backup and should be getting Skyrim back up soon.",
  "categoryId": "30",
  "version": "1.00",
  "author": "banzaigtv",
  "createdUnix": "1350671115",
  "updatedUnix": "1350671148",
  "containsAdultContent": false,
  "uploadedBy": "banzaigtv",
  "primaryFile": null,
  "files": [
    {
      "fileId": "94656",
      "name": "Stairway to Heaven",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "360",
      "fileName": "Stairway to Heaven-25727-.rar",
      "uploadedUnix": "1350671148",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5e344cb60faff8db80a44a220707e9c9c907056853e073e08ce8de6ea4bfd7ee/analysis/1407228906/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stairway%20to%20Heaven-25727-.rar?fid=94656&ttl=1535797410&ri=8192&rs=8192&setec=501bf46e92eddbe174b032be815aa37b"
    }
  ]
}