{
  "modId": 2576.0,
  "modName": "Dragonscale Skimpy Bikini Version",
  "summary": "A mod to make the dragonscale armor lighter but keep you from flopping around everywhere such as it were.",
  "descriptionHtml": "This is an edit of the Dragonscale light armor for female characters only. I felt that the stock armor was more of a Heavy armor style than a light armor. This removes quite a bit of the excess dragonbone on the armor giving it a much lighter feel and resembles a dragonscale/dragonbone corset as opposed to a suit of plate mail. I\\'ve managed to tweak the mesh placement to avoid almost all of the clipping. While testing it out the only times I can see it are in the basic power attack animation.  Unlike the nude mesh version I\\'ve uploaded this one uses the stock body and includes a quick 1 min retexture of the underwear to make it look like dragonscale.\r\n\r\nThanks to the posts done by Templar666 and Thepal I figured out how to make this and got the resources to do so. Much kudos to them and there hard work. The screenshots don\\'t include Thepals texture files to avoid angering any powers that might be.  Hope you enjoy.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Dbard",
  "createdUnix": "1322987513",
  "updatedUnix": "1322988432",
  "containsAdultContent": false,
  "uploadedBy": "kpet3946",
  "primaryFile": null,
  "files": [
    {
      "fileId": "6809",
      "name": "Dragonscale skimpy bikini mesh",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1189",
      "fileName": "Dragonscale skimpy bikini mesh-2576-1-0.rar",
      "uploadedUnix": "1322988432",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6bca8b8694a1be42984a25a4161a908376ad2f6ae3d0a7b4f64dd8253c32a08c/analysis/1406476213/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonscale%20skimpy%20bikini%20mesh-2576-1-0.rar?fid=6809&ttl=1535756892&ri=8192&rs=8192&setec=96b1c8f22a8ea5ca6402db2fa7b2dd0d"
    }
  ]
}