{
  "modId": 25770.0,
  "modName": "THE BIG MANS---tRUE lEGATE",
  "summary": "A replacer for the imperial legate armor. Like all of my mods this aims to create a more appealing armor set to the game. Enjoy!",
  "descriptionHtml": "    tRUE lEgate is a single installment of a large group of mods currently in production, with\r\nthe aim to completely overhaul all of the armors of Skyrim. This mod is currently a work in \r\nprogress.,\r\n\r\n    tRUE lEgate is a single installment of a large group of mods currently in production, with the aim to completely overhaul all of the armors of Skyrim. This mod is currently a work in progress. There is still some texturing that needs to finished. I am working on improving the quality of the fur, and will continue to eliminate the clipping issues. quality of the fur, and will continue to eliminate the clipping issues. ALso the first person and female versions will be completed soon.\r\n\r\n*The helmet image is just a concept art. It is what i am trying to achieve with the helmet. This is why i have used the ancient nord helm as a base. It is an attempt at remaking the imperial helmets from oblivion. I have no experience with 3dx max or blender so i am unable to remove the horns from the helmet, and texturing to remove them is nearly impossible. if anyone would like to help with this and bring this helmet to life, please message me.",
  "categoryId": "54",
  "version": "1.2",
  "author": "DarthIre ",
  "createdUnix": "1350751884",
  "updatedUnix": "1352136726",
  "containsAdultContent": false,
  "uploadedBy": "DarthIre",
  "primaryFile": null,
  "files": [
    {
      "fileId": "97651",
      "name": "tRUE lEGATE 1dot2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35406",
      "fileName": "tRUE lEGATE 1dot2-25770-1-2.zip",
      "uploadedUnix": "1352136726",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/366d9a32df8c52af19ade2b080ef3549ea47bd5d8087112dbdac48f9b2ab1f3a/analysis/1407250762/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/tRUE%20lEGATE%201dot2-25770-1-2.zip?fid=97651&ttl=1535797459&ri=8192&rs=8192&setec=387cc8401e06e55a7079a92e435bb468"
    }
  ]
}