{
  "modId": 25782.0,
  "modName": "SME - Roleplaying Speeds",
  "summary": "Small, roleplay- and realism-oriented mod that tones down the movement speeds of vanilla NPCs and creatures and accounts for different weapon types in combat.",
  "descriptionHtml": "~~UPDATE~~\r\n\r\n1.1 version of this mod is out. I slightly increased all NPC speeds (player included) as well as made\\\"combat enhancements\\\" for movement with various styles of weapons (e.g. one-handed, bows, magic, etc.) equipped. What that means is that some weapons types will grant more or less mobility than others, simulating what I would believe to be more realistic behavior. Example: I can\\'t imagine that a two-handed warrior would be able to strafe as well as a mage running around unarmed. Hope you enjoy :D\r\n\r\n~~UPDATE~~\r\n\r\nTABLE OF CONTENTS:\r\n\r\nI. Overview\r\nII. Primary Changes\r\nIII. Secondary Changes + Balance\r\nIV. Combat Enhanced\r\nV. Effect on Animations\r\nVI. Installation\r\nVII. Compatibility\r\nVIII. Thanks and Credits\r\n\r\nOVERVIEW:\r\n\r\nThis mod is the tiny first installment of what will become a larger realism and roleplaying immersion mod (SME - Sukeban\\'s Medieval Economy). It\\'s aim is to remove some of the unrealistic attributes from the Dragonborn and make him or her into an ordinary NPC. In addition to being far more \\\"realistic,\\\" I have found that movement speeds affect nearly EVERY facet of an open-world game, from the pace and tactics of combat to the perceived size of the map. By slowing things down, the world feels much larger and more alive.\r\n\r\nOnly a handful of items in the CK have been touched in this mod; specifically, the movement (MOVT) fields governing the speeds of actors in the world. Below is a summary of what has been changed:\r\n\r\nPRIMARY SPEEDS CHANGED:\r\n\r\nA. Walk Speed - Increased to 65 to make walking realistic, yet viable for travel.\r\nB. Run Speed - Roughly halved to 215, transforming it more into a light jog.\r\nC. Sprint Speed - Roughly halved to 335, still very quick yet no longer implausibly so\r\nD. Horse Walk: Increased to 80, making it realistic and faster than human walking.\r\nE. Horse Run: Slowed to 380, making it faster than human sprint yet no longer imbalanced.\r\nF. Horse Sprint: Slowed to 450, making it an upgrade over running yet no longer blindingly fast.\r\n\r\nSECONDARY CHANGES AND BALANCE:\r\n\r\nI have also changed the default speeds for swimming (both human and horse) to make them slower and more realistic. There are also changes to weapon-equip speeds, with two-handed weapons moving slightly slower than one-handers, and with bows moving the fastest when equipped. I have also slowed down the power attack speeds and have slightly lowered the speed that NPCs move at while blocking and casting/equipping magic. Sneaking speeds have also been slightly reduced for realism.\r\n\r\nCOMBAT ENHANCED:\r\n\r\nAs of version 1.1, this mod adds a bit more depth to combat by modifying movement speeds based on the type of weapon that a player has equipped. This is intended to better simulate how different weapons would play out in a battle situation, instead of treating each weapon as behaving the exact same way.\r\n\r\n1. One-handed: Light weapons are general weapons, imposing no real limitations nor any tremendous bonus. These weapons handle quickly running forward (charging) and strafe well. A bit less ideal when giving up ground (reversing). Movement speed is low when attacking, meaning that one must exercise hit-and-run tactics rather than slash their way out of trouble.\r\n\r\n2. Two-handed: Heavy weapons are made for advancement and for blocking, so they handle well going forward and backward. Less ideal for strafing and generally slower than the other weapons types due to their weight. These weapons have better movement speed when attacking, simulating the inertia or momentum of swinging a cumbersome object with force.\r\n\r\n3. Bows: Archers are actually given a movement bonus for running forward with a bow equipped, simulating their acumen on the hunt. Archers are unskilled at giving up ground, however, and are average at strafing. Bows are also very slow when drawn, given the physical strength and concentration involved in aiming.\r\n\r\n4. Magic: Mages are generally very agile and have no real movement limitations. They move fastest when strafing, simulating the \\\"duel\\\"-like nature of mage-on-mage battles. They are fast, but slightly less so, when directly charging a target and/or retreating. When attacking, mages move at a medium pace, simulating the concentration that a magic-user must use when attacking. In general, mages have the best overall mobility due to the fact that they do not have a weapon to impede their bodies.\r\n\r\nEFFECT ON ANIMATIONS:\r\n\r\nI am not an animator, so I have done my (scientific) best here. Some speeds were de facto bound by their animation, both to upper and lower borders. For example, I could not get the swimming speed to go below a certain amount, simply because the animation would not run any slower, even at lower values for the MOVT speed. Some animations would just look awkward if pressed beyond a certain point. Horses became awkward if made to gallop at too slow of a speed, which is why their Run speed is kept somewhat higher than where I wanted it to be.\r\n\r\nHave no fear, Reader, for I hate awkward animations even more than I hate unrealistic movement speeds; and I have always erred on the side of fluid animations in this mod. Therefore, you should not find any objectionable animations after installing this mod.\r\n\r\nINSTALLATION:\r\n\r\nSimply drop .Esp into your Skyrim/Data folder. To uninstall do the reverse. No information is saved to your character file so you have nothing to worry about in terms of messing up your saves.\r\n\r\nCOMPATIBILITY:\r\n\r\nUnsure at the moment. I made this mod with the hope that it can be loaded last and overwrite the speeds in other mods (Mods like Requiem, SkyRe, etc.). I just did a fresh reinstall of Skyrim, so I haven\\'t been able to test with any of the more extensive and popular mods out there. Perhaps users can comment and let me know? As it is, this mod is completely stand-alone and requires nothing else save for the game (Dawnguard not required).\r\n\r\nTHANKS AND CREDITS:\r\n\r\nHuge thanks to Wolfmark who, many moons ago, put out his excellent Skyrim Speeds utility (still on Nexus, if interested). That was the spiritual forefather of this mod.",
  "categoryId": "78",
  "version": "1.1",
  "author": "Sukeban",
  "createdUnix": "1350767037",
  "updatedUnix": "1350876227",
  "containsAdultContent": false,
  "uploadedBy": "sukeban",
  "primaryFile": null,
  "files": [
    {
      "fileId": "95114",
      "name": "SME - Roleplaying Speeds Complete",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "SME - Roleplaying Speeds Complete-25782-1-1.7z",
      "uploadedUnix": "1350876227",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/57a4324da5664da533e88e5bd4eea6fd9584fa9386db36baca423966c9c75c62/analysis/1407231739/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SME%20-%20Roleplaying%20Speeds%20Complete-25782-1-1.7z?fid=95114&ttl=1535797471&ri=8192&rs=8192&setec=c3760026bea85146c3166f25192906f8"
    }
  ]
}