{
  "modId": 25806.0,
  "modName": "Recover All Arrows",
  "summary": "Recover all your arrows from dead bodies in a lore friendly way.",
  "descriptionHtml": "Description:\r\n\r\nSo what does this mod do? It simply adds another level to Hunters Discipline called Hunters Retrieval that allows you to recover “all” the arrows which hit what you were aiming at (animal or NPC).\r\n\r\nI made this mod for myself because it really bugged me that I couldn’t recover all my arrows after hitting a target. Was I supposed to believe that my arrows simply disappeared, especially when I could plainly see said arrows protruding from the still warm and bloody corpse? Surely I thought, if I can kill a dragon I should be able to dig out an arrow from a dead enemy or animal. And it bugged me even more when I kept losing my expensive and hard to come by (without console) Daedric arrows.\r\n\r\nAnd before anyone says “but there is already a couple of mods that do this”, yes I know. However, I wanted to do this in a lore friendly way. A way that didn’t alter the vanilla Hunters Discipline perk, one that didn’t use any scripts, quests or alter any game settings, and one that you still had to work for. I mean there has to be some skill involved with properly butchering a carcass, right!!\r\n\r\nTo keep it lore friendly as I said, you have to be level 80 or above in Archery before you can get this perk. And of course you have to be a good shot, or you’re still going to lose your arrows :)\r\n\r\nBugs:\r\nNone that I know of. It took me a while to figure out how to do this without using scripts or quests etc, and I have been using it for ages in my games without any problems. However, if you discover any bugs please let me know and I will do my best to rectify them.\r\n\r\nI also don’t know if this works for non-vanilla arrows as I don’t use any myself. I would be interested to know if it does or not. Although I don\\'t see why it wouldn\\'t.\r\n\r\nConflicts:\r\nNot sure, would probably be a conflict with say “Arrows and Bolts Tweaks” by kevkas (a great mod in itself), or at least that portion of the mod that alters arrow recovery.\r\n\r\nInstallation:\r\nUnzip and place esp into your Skyrim Data folder. Or install with NMM.\r\n\r\nUsage and Distribution:\r\nI do not give permission to upload this mod to any other sites. I would prefer it stays here on Nexus.\r\n\r\nFeel free to use this mod however you like, but if you do use it in something else then at least a credit would be good.\r\n\r\nFinally:\r\nI made this for myself. I just thought there could be some likeminded people on this great site who might appreciate it also. So endorse if you want to, or don’t, it’s up to you.\r\n\r\nRegards,   White_Knuckle\r\n",
  "categoryId": "73",
  "version": "1.0",
  "author": "White_Knuckle",
  "createdUnix": "1350816241",
  "updatedUnix": "1350816380",
  "containsAdultContent": false,
  "uploadedBy": "White_Knuckle",
  "primaryFile": null,
  "files": [
    {
      "fileId": "94971",
      "name": "Recover All Arrows",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Recover All Arrows-25806-1-0.7z",
      "uploadedUnix": "1350816380",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/91af2d90ab1beea39461fa326470d0e27339c08b20174fe88cd93ffdfb263862/analysis/1407230821/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Recover%20All%20Arrows-25806-1-0.7z?fid=94971&ttl=1535797507&ri=8192&rs=8192&setec=253380d6354ff35db3d05f2ebf693b26"
    }
  ]
}