{
  "modId": 25838.0,
  "modName": "NightGuard - NightKin In A New Light",
  "summary": "The NightGuard originate from all around Tamriel as they are simply a collection of vampires that have found the error in there ways and seek redemption. On your journeys around Skyrim you may bump into several NightGuard couriers, if you do feel free to lend one a hand as many other of Skyrims inhabitants don\\'t feel towards them as you and I.",
  "descriptionHtml": "The main objective for NightGuard is for it to one day develop and reach the standards of DLC. Until then i am going to keep updating it. I hope you guys have as much fun playing NightGuard as i did making it.\r\n\r\nThe NightGuard originate from all around Tamriel as they are simply a collection of night kin that have found the error in there ways and seek redemption. On your journeys around Skyrim you may bump into several NightGuard couriers, if you do feel free to lend one a hand as many other of Skyrims inhabitants don\\'t feel towards the NightGuard as you and I. On your travels you might also stumble upon the NightGuard base of operation just outside of Winterhold, once here speak to some of the NightGuard there may be some loot in it for you.\r\n\r\nYou will know a NightGuard when you see one as they will be proudly wearing the NightGuard ebony amour and gracefully holding a silver sword just encase any unworthy creatures of the night pass them in there journeys. \r\n\r\nRecently the NightGuard have started to spread there presence all around Skyrim, this being the case they have moved there central base of command to a more discreet location to the north of Winterhold, here they can monitor the NighGuards standings in Tamriel from afar. With there new growth the NightGuard have been able to bring more night kin to their cause, these being some of the more docile werewolves situated around Skyrim. As well as this the NighGuard builders have been able to start construction on several NighGuard sanctuary\\'s situated around Skyrim. The first of these being to the east of Ivarstead and the second being to the south of Dawnstar. \r\n\r\nNightGuard contains several new and interesting NPC with more coming very soon as well as two new areas as well as lots of loot, as long as you have the skill to acquire it. NightGuard does not require any other mods or DLC other than the original Skyrim game. This is my first ever mod so please mention any basic modding techniques that you feel I have missed out.\r\n\r\nIf you find any notable glitches or bugs in this mod then feel free to notify me about them. Likewise if you have enjoyed this mod then please rate it as this will help out immensely.  If you would like anything added to the mod then I would appreciate it if you told me about what you would like. ",
  "categoryId": "89",
  "version": "V1.6",
  "author": "Tekk3y",
  "createdUnix": "1350850415",
  "updatedUnix": "1351018805",
  "containsAdultContent": false,
  "uploadedBy": "tekk3y",
  "primaryFile": null,
  "files": [
    {
      "fileId": "95057",
      "name": "NightGuard",
      "version": "V1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35",
      "fileName": "NightGuard-25838-V1-0.rar",
      "uploadedUnix": "1350850584",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1d282ab988229aee43fa8657ae9f673fb0c1139deb08c7c5677862b3d255424f/analysis/1407231489/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NightGuard-25838-V1-0.rar?fid=95057&ttl=1535797546&ri=8192&rs=8192&setec=b7b8ea2d61258abbcafe8168f849805b"
    },
    {
      "fileId": "95233",
      "name": "NightGuard",
      "version": "V1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "64",
      "fileName": "NightGuard-25838-V1-5.rar",
      "uploadedUnix": "1350939981",
      "modVersion": "V1.5",
      "virusScanUrl": "https://www.virustotal.com/file/0599ba06d1c3dda72209cb63677e9dcab0450d6ab70c25fe330f026330aa002c/analysis/1407232383/",
      "changelogHtml": " Changed Location of main Base <br/> \n Added werewolves <br/> \n Added NightGuard sanctuary <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NightGuard-25838-V1-5.rar?fid=95233&ttl=1535797546&ri=8192&rs=8192&setec=0e5cfaa99de5a575e1ede7883f9a4879"
    },
    {
      "fileId": "95414",
      "name": "NightGuard",
      "version": "V1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "92",
      "fileName": "NightGuard-25838-V1-6.rar",
      "uploadedUnix": "1351018805",
      "modVersion": "V1.6",
      "virusScanUrl": "https://www.virustotal.com/file/f2ba0bfc62e1e34a536c73a589941faafc5aa96aff1b58cd5ff75f5d94c2a371/analysis/1407233532/",
      "changelogHtml": " Added possible fix on moving characters around <br/> \n Added new sanctuary <br/> \n Added new area to NightGuard main command <br/> \n Removed several areas for the NightGuard main command <br/> \n Changed loot in areas, so not to be broken <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NightGuard-25838-V1-6.rar?fid=95414&ttl=1535797547&ri=8192&rs=8192&setec=a2cf2cd6036dbe1656ff94d407e4f55e"
    }
  ]
}