{
  "modId": 25846.0,
  "modName": "TERA Armors Collection for Skyrim - Male and UNP female",
  "summary": "A collection of 64 TERA armors (23 heavy, 28 light, and 13 robes) with more coming every updates. All of them are uniquely beautiful, have weight slider support for both genders, inventory models, relatively balanced stats and recipes and are ready for use in Skyrim. *NOTE - this mod is obviously NOT lore-friendly*",
  "descriptionHtml": "[center][/center]\r<br />\r<br />[b]THIS MOD IS NO LONGER BEING WORKED ON. THERE WILL BE NO MORE UPDATES FROM ME. PLEASE DO NOT PM ME ABOUT IT. IF YOU NEED TO USE THESE ARMORS FOR YOUR FOLLOWER MODS OR A BODY CONVERSION, PLEASE JUST ASSUME I&#39;LL SAY YES. AS LONG AS YOU GIVE CREDITS TO BLUEHOLD STUDIO, ENMASSE ENTERTAINMENT AND MYSELF, WE&#39;RE GOOD.\r<br />\r<br />[/b]\r<br />[b]ALSO, PLEASE GO TO CHECK OUT THE MOD BELOW BY LADYHORUS. IT&#39;S BASICALLY A BETTER VERSION OF MY MOD WITH ALL OF THE KINKS AND BUGS STRAIGHTENED OUT. CONSIDER IT THIS MOD&#39;S SPIRITUAL SUCCESSOR. [/b]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/79020/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D79020%26preview%3D&pUp=1]ladyHorus&#39;s Tera Armors[/url] \r<br />\r<br />\r<br />[b][color=lightgreen][size=3]For those who simply want to get the armor without having to craft them (testers and photo junkies), search for &#34;Tera Barrel&#34; and spawn it with the console command next to you. The barrel contains all the armor pieces in this mod.\r<br />\r<br />How to do this step by step:\r<br />1) Open the Skyrim console command by pressing the tilde key &#34;~&#34;, should be right next to your &#34;1&#34; key\r<br />2) Type in help &#34;Tera barrel&#34; 0 and then hit enter\r<br />3) The game will then give you a numerical code that correspond to the barrel, it might be something like 12584A5, the code will be different from person to person\r<br />4) Take note of that code and then type in player.placeatme XXXXXXXX and hit enter. Replace the XXXXXXX with the code that you just got\r<br />5) Close the console command by hitting the tilde key again. The barrel should spawn exactly where you stand.[/size][/color][/b]\r<br />\r<br />[b][color=orange][size=3]All of the &#34;Helmet&#34; and &#34;Hood&#34; in this mod except for a handful are supposed to be invisible. You will not see anything show up when you equip these head gears. They are only there so you can get the armor bonus from perks. [/size][/color][/b]\r<br />\r<br />[b][color=red][size=3]I will NOT convert these armors to any other body (LB, UNBP, ADEC, etc.), so please do not ask. I am not interested in any other body variations beside UNP, and so I will not listen or respond to any request of such nature.[/size][/color][/b]\r<br />\r<br />[size=3][b][color=yellow]CBBE and 7base version of this mod can be found on the Nexus. Simply search for &#34;Tera&#34; and you&#39;ll find them easily [/color][/b][/size]\r<br />\r<br />[size=3][b][color=lightblue]You MUST update your Skyrim to at least version 1.8 in order for these armors to show up in your game. There&#39;s no other way around it. [/color][/b][/size]\r<br />\r<br />\r<br />[center][img]http://4.bp.blogspot.com/-QEsBHpl7lBc/T4DJD1-Yn4I/AAAAAAAAARo/oQAgCv4B_bs/s640/tera.jpg[/img][/center]\r<br />\r<br />\r<br />\r<br />\r<br />[heading] [center]BACKGROUNDS[/heading][/center] (skip if you&#39;re not interested)\r<br />\r<br />As many of you may have already noticed, I am the second author of the popular TERA armor mod for UNP and UNBP body here on the Nexus. If you have no idea what I&#39;m talking about, it&#39;s [url=http://skyrim.nexusmods.com/mods/22023]this mod[/url] \r<br />\r<br />Silver0236, the original author of that mod was able to get permission from TERA&#39;s publisher to use their 3D models for Skyrim. You can read all about it over there since I&#39;m not going to repeat it here. Basically, I believe this is safe and should not infringe any copyrights. \r<br />\r<br />The original intent was that I would partner up with Silver0236 and work in conjunction with him to release TERA armors for both bodies (UNP and UNBP) simultaneously. However, I was a faster worker and was able to made much more armors than he could keep up. I posted a couple of teaser pictures on that mods for my almost-finished armors and many people wanted me to just release them instead of waiting for the UNBP conversion.\r<br />\r<br />I decided to give in and now I&#39;m releasing my TERA armor conversions as my own mod. I did not have a fall out with Silver0236 or anything. All of my meshes and textures released for this mod are still available for him and anyone to use. I simply want better control over my mods and I feel that releasing a bunch of armors for one body and not the other on the old mod page will confuse a lot of people, especially since I have no ability to upload images for the author&#39;s section of the mod for some reason... \r<br />\r<br />\r<br />\r<br />[heading][center]WHAT THIS MOD CONTAINS[/heading][/center]\r<br />\r<br />This mod will give you 64 armors from the game TERA Online (23 heavy, 28 light and 13 robes), converted for use in Skyrim with the UNP female body and the vanilla male body, all with balanced stats and smithing recipes. Some armors are on the weaker end while some are intended for end-game characters. Some higher level armors require appropriate smithing perks to be craftable, while some are available for you from the start\r<br />\r<br />All of these armors come with four pieces each: body, gloves, boots and an invisible helmet. [color=orange][size=3]Yes, the helmets and hood are purely for the bonus armor rating from perks and are supposed to be invisible, so please do not ask questions about them in the comment section.[/size][/color]\r<br />\r<br />These armors can be found spread out across different vanilla smithing categories based on their stats. The robes can all be found in the MISC section. Some higher tier robes will require some light armor smithing perks to be craftable. All mage robes also come with a pre-enchanted version that can be crafted if you have the Arcane smithing perk.\r<br />\r<br />The list of armors is as followed, ordered from weakest to strongest. The final &#34;Eternal&#34; armor sets for each respective category are the &#34;ultimate&#34; armors that can only be crafted when you complete the entire smithing perk tree.(check the image sections for previews of all the armors for both genders)\r<br />\r<br />[center][b]HAUBERK (Heavy Armors)[/b][/center]\r<br />\r<br />[center][color=lightblue]Keener Iron (Iron)[/color][/center][center][color=lightblue]Velkas (Iron Banded)[/color][/center][center][color=lightblue]Liberator (Imperial)[/color][/center][center][color= lightblue]Steelgaze (Steel)[/color] [/center][center][color=lightblue]Ciebel Guard (Steel)[/color] [/center][center][color=lightblue]Orphic (Dwarven)[/color] [/center][center][color=lightblue]Arcadia (Dwarven)[/color] [/center][center][color=lightblue]Scion Plate (Steel Plate))[/color] [/center][center][color=lightblue]Palrada Plate (Steelplate)[/color][/center][center][color=lightblue]Rubicite (Orcish)[/color] [/center][center][color=lightblue]Sinestral (Orcish)[/color] [/center][center][color=lightblue]Ulcissor (Orcish)[/color][/center][center][color= lightblue]Xenocite (Ebony)[/color] [/center][center][color=lightblue]Tenebrescent (Ebony)[/color][/center][center][color=lightblue]Trielek (Ebony)[/color] [/center][center][color=lightblue]Atroscine (Dragonplate)[/color] [/center][center][color= lightblue]Sententia (Dragonplate)[/color] [/center][center][color=lightblue]Ascendant (Dragonplate)[/color][/center][center][color= lightblue]Deathshell (Daedric)[/color] [/center][center][color=lightblue]Chaos Bloodplate (Daedric)[/color][/center][center][color= lightblue]Viridinium (Daedric)[/color] [/center][center][color=lightblue]Val Tirkai (Daedric)[/color] [/center][center][color=lightblue]Eternal Centurion (Ultimate)[/color][/center]\r<br />\r<br />\r<br />[center][b]CUIRASS (Light Armors)[/b][/center]\r<br />\r<br />[center][color= lightgreen]Crisping (Hide)[/color] [/center][center][color= lightgreen]Dawnturn (Hide)[/color] [/center][center][color=lightgreen]Karassia (Hide)[/color][/center][center][color= lightgreen]Brigandine (Hide)[/color] [/center][center][color=lightgreen]Viator (Studded))[/color][/center][center][color= lightgreen]Blade Dancer (Studded)[/color][/center][center][color=lightgreen]Heartsworn (Leather)[/color][/center][center][color= lightgreen]Zalisleather (Leather)[/color] [/center][center][color=lightgreen]Castanic Hunter (Leather)[/color][/center][center][color= lightgreen]Sea Rover (Leather)[/color] [/center][center][color= lightgreen]Gunslinger (Leather)[/color] [/center][center][color=lightgreen]Cromos (Elven)[/color][/center][center][color= lightgreen]Moonbuckled (Elven)[/color] [/center][center][color=lightgreen]Elven Scaled (Elven) [/color][/center][center][color= lightgreen]Jalmarak (Elven)[/color][/center][center][color= lightgreen]Gildhorn (Elven)[/color][/center][center][color=lightgreen]Rysio (Elven Gilded)[/color][/center][center][color=lightgreen]Sylward (Scaled)[/color][/center][center][color= lightgreen]Voidmeld (Scaled)[/color][/center][center][color=lightgreen]Quantum (Glass)[/color][/center][center][color=lightgreen]Cyasmic (Glass)[/color][/center][center][color= lightgreen]Deathskin (Glass)[/color] [/center][center][color= lightgreen]Kshara (Glass)[/color] [/center][center][color= lightgreen]Shadow Fang (Glass)[/color] [/center][center][color= lightgreen]Elleon (Glass)[/color] [/center][center][color= lightgreen]Dreamswept (Dragonscale)[/color] [/center][center][color= lightgreen]Elseworlder (Dragonscale)[/color] [/center][center][color= lightgreen]Eternal Warden (Ultimate)[/color] [/center]\r<br />\r<br />\r<br />[center][b]ROBES (Mage Robes - found in MISC)[/b][/center]\r<br />\r<br />[center][color=yellow]Neophyte [/color][/center][center][color=yellow]Cerulean Alchemist[/color][/center][center][color=yellow]Leafchaser[/color][/center][center][color= yellow]Skysoar[/color] [/center][center][color=yellow]Nightwinder[/color] [/center][center][color= yellow]Sikhanda[/color] [/center][center][color=yellow]Solace[/color][/center][center][color= yellow]Necrosin[/color] [/center][center][color=yellow]Timerender[/color] [/center][center][color= yellow]Ebon Shroud[/color] [/center][center][color= yellow]Royalrite[/color] [/center][center][color= yellow]Divinesight[/color] [/center][center][color=yellow]Eternal Magus[/color][/center]\r<br />\r<br />\r<br />[center][b]WORKS IN PROGRESS (Not yet released)[/b][/center]\r<br />\r<br /> [center][color= lightgray]None at the moment[/color] [/center]\r<br />\r<br />\r<br />\r<br />[center][b]*These are not all of the armors planned for this mod, more armors will be added to the WIP section as the mod progresses, but currently, these are the ones that I have on my plate*[/b][/center]\r<br />\r<br />\r<br />[heading][center]REQUIREMENTS[/heading][/center]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/6709]UNP Body[/url]\r<br />\r<br />\r<br />[heading][center]RECOMMENDED MOD[/heading][/center]\r<br />\r<br />I recommend the following mods for a full experience: \r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/27463]Tera Weapon Collection[/url] by Iromizu. Iromizu was the generous modder who provided me with many of these Tera meshes and now he has outdone himself with this weapon mod. You got the Armor, why not get the weapon as well for a complete look? His mod is also very balanced and go perfectly with this mod. Do yourself a favor and get this.\r<br />\r<br />\r<br />\r<br />\r<br />[heading][center]KNOWN BUGS[/heading][/center]\r<br />\r<br />- Currently, you cannot craft the enchanted version of the Nightwinder robe since it required the enchanted version to craft the enchanted version. So it&#39;s practically useless. If you want the robe with the enchantment, just get it from the console command. It should be the second &#34;nightwinder robe&#34; if you search for it\r<br />-Possible clippings can occur (this is inevitable)\r<br />-Some armors are not weighted very well (the White Mage Robe and Nightwinder Robe look kind of strange from the back while your character is moving - nothing too jarring though, judge for yourself.)\r<br />\r<br />\r<br />** Please report any additional bugs if you find them in the comment section (images attached with the reports are preferred).\r<br />\r<br />\r<br />\r<br />[heading][center]PERMISSIONS, DISCLAIMER AND CREDITS[/heading][/center]\r<br />\r<br />[color=lightblue]Bethesda[/color]- for the amazing game, Skyrim\r<br />[color=lightblue]En Masse Entertainment/Bluehole Studios[/color] - for their MMO game with awesome armor designs that this mod is based on - TERA Online.\r<br />[color=lightblue]Silver0236[/color] - for his effort in acquiring the rights for these armors - you&#39;re the man who started it all\r<br />[color=lightblue]Acdale[/color] - for his Xenocite and Viridinium meshes\r<br />[color=lightblue]fox (anonymous author)[/color] - for a lot of his/her/their TERA meshes\r<br />[color=lightblue]&#34;L&#34; Community[/color] - for their supports and blessing with the TERA meshes in this project.\r<br />[color=lightblue]Iromizu[/color] - for his supports with the TERA models resource from the original games. Now, I can work much faster.\r<br />[color=lightblue]Eldroth[/color] - for his helps with some of the male armors\r<br />[color=lightblue]dimon99[/color] - for his UNP body that this mod is based on\r<br />[color=lightblue]Nightasy[/color] - for his tutorial on editing and creating armors - check his videos out if you want to start editing armors yourself [url=http://skyrim.nexusmods.com/mods/19249]here[/url] \r<br />[color=lightblue]Syndrome, Toad and the navercafe mod team[/color] - for allowing me fair use of their TERA meshes\r<br />[color=lightblue]Arrowintheknee mod team[/color] - for the many original CBBE TERA meshes - you guys were the lead in Skyrim modding back in its hay day and are still awesome now.\r<br />[color=lightblue]juancok[/color] - for his marvelous works with some of the armor&#39;s textures.\r<br />[color=lightblue]Xescream[/color] - for his help with the level list plugin for v 1.7\r<br />[color=lightblue]archel24[/color] - for his help with the level list plugin for v 1.9\r<br />[color=lightblue]Hellosanta[/color] - for some of the armors&#39; retextures\r<br />[color=lightblue]jmemaru[/color] - for the permission to use some of Scarlet Dawn&#39;s armor resource\r<br />\r<br />And the many modders who&#39;ve created these armors for CBBE prior to this. These armors were made for CBBE first by many anonymous authors. Who all have allowed the free use of their works. I simply take their meshes and convert them into UNP body.\r<br />\r<br />You can use assets from this mod freely. Convert this to CBBE, ADEC, LB, or any other body that you use.\r<br />\r<br />[center][color=red][b]PLEASE, FOR THE LOVE OF ALL THINGS GOOD RIGHTEOUS AND HOLY, DO NOT DISTRIBUTE THIS MOD ANYWHERE WITHOUT MY PERMISSION. IF YOU WANT TO HOST THIS MOD SOMEWHERE OTHER THAN NEXUS, ESPECIALLY PLACES LIKE THE STEAM WORKSHOP, PLEASE CONTACT ME FIRST. IF YOU CHOOSE TO IGNORE THIS MESSAGE AND UPLOAD THIS MOD WITHOUT MY CONSENTS, I WILL SHOW NO MERCY.[/b][/color][/center]\r<br />\r<br />[center][color=yellow][b]The assets from TERA Online are used with the express permission of the En Masse Entertainment Public Relations Department.\r<br />All models in this pack are copyrighted, and belong to their original authors and copyright holders. This mod is not a commercial modification and no profits will be gained by releasing any parts of it for any material benefits.\r<br />The original Tera armor concepts, mesh and textures are owned and copyrighted by En Masse Entertainment and used with permission. All rights reserved.[/b][/color][/center]\r<br />\r<br />\r<br />[heading][center]FEATURED VIDEOS[/heading][/center]\r<br />\r<br />** Thank you MxR for the feature video\r<br />\r<br />[youtube]F6zV-Vq7Qjw&feature=g-all-u[/youtube]\r<br />\r<br />** Thank you frederickone1 for the feature video\r<br />\r<br />[youtube]bazKhm5E5Rg[/youtube]\r<br />\r<br />** Thank you SaioTV for the feature video\r<br />\r<br />[youtube]l8NziOfn7SA[/youtube]\r<br />\r<br />[heading][center]**FAQ FAQ FAQ FAQ FAQ FAQ**[/heading][/center]\r<br />All your questions answered here - READ THESE BEFORE ASKING QUESTIONS IN THE COMMENT PLEASE - YOUR QUESTION MAY HAVE ALREADY BEEN ANSWERED&#33;&#33;\r<br />\r<br />[color=yellow]Q: Is there a CBBE version of these armors? \r<br />Please make CBBE versions. \r<br />Can you please create CBBE versions for these as well?\r<br />I only use CBBE, can you please make these armors for them? \r<br />CBBE&#33; or no download\r<br />etc. etc.[/color]\r<br />\r<br />A: Read the Important messages section on top of the mod. It has a link to a CBBE version of this mod.\r<br />\r<br />\r<br />[color=yellow]Q: How do you even install this mod?/ i installed the mod but when I wear the armors, my character&#39;s body disappeared?[/color]\r<br />\r<br />A: There are two ways that you can install the mod: using NMM and manual install. I&#39;ll go over both\r<br />\r<br />NMM install require that you first download and install Nexus mod manager (you can find it on the Nexus itself). After you installed the program, go to this mod page and look at the &#34;files&#34; tab. You&#39;ll see that there are two parts to this mod&#39;s main files. There should be a green &#34;button&#34; on each part that say &#34;Download with NMM&#34;, click on that for both and the NMM program should launch and begin downloading the files. \r<br />\r<br />Once it finished downloading. Go to the &#34;plugin&#34; tab on the NMM program and you should see the two parts of this mod there. Click on part 1 and then click on the isntall option on the NMM, let it install completely. Then, here&#39;s the important part, click on part 2 of the mod and install it, when asked if you would like to &#34;update&#34; the mod, pick &#34;NO&#34; and then continue install the mod\r<br />\r<br />\r<br />Manual install require you do download both parts manually. They will comes in .rar formats, so you will need winrar to extract both. When extracted, you&#39;re interested in the &#34;meshes&#34; and &#34;textures&#34; folders as well as the &#34;TERAarmors&#34;.esm and .esp files. Go into your Skyrim directory (should be Steam/steamapp/skyrim/data&#34; then move the newly extracted meshes, textures and esm, esp files from the two parts into the data folder, if any prompts came up, select yes to replace all. Then launch Skyrim once with the Skyrim launcher so the game will recognize and activate the mod.\r<br />\r<br />\r<br />[color=yellow]Q: I can&#39;t make my followers wear the mage robes because they have 0 armor rating, can you please make them armors instead or at least add some armor to them?[/color]\r<br />\r<br />A: I cannot make the mage robes have armor rating because I have classified them as &#34;Cloth&#34; in the CK. When an item is classified as such, no matter what armor rating value you put in will become 0 in the actual game. Also, I will not make them into armors because they are designed for mage players, whose perks depends on them having no armor.\r<br />\r<br />It is recommended that you download the UFO - Ultimate follower overhaul mod since it has a &#34;you could dress better&#34; command that allows you to remove the follower&#39;s default outfit, so you can just remove that and give them a mage robe from this mod and they will wear it.\r<br />\r<br />\r<br />[color=yellow]Q: How do you make your character&#39;s skin so shiny and &#34;wet&#34; - Glosstech can only make it look metallic instead of... you know... wet.[/color]\r<br />\r<br />A: To make the character skin to look like my character in the screen shots, you need:\r<br />\r<br />1) someting to make the skin shiny (edit the femalebody_s.dds, femalehead.dds, and femalehand.dds files in textures/actors/characters/female - just increase the brightness by about 20) \r<br />OR search for glosstech - however both of these will make the skin looks &#34;metallic&#34; and not &#34;wet&#34; - so you&#39;ll need....\r<br />2) an ENB file - ANY ENB would do but you need to go to:\r<br />[ENVIRONMENT] section in enbseries.ini and find these lines and change them accordingly\r<br />(these are the settings I use - the higher the number the more &#34;wet&#34; it will look - just play around with the numbers and see what works for you. You can see the effects better indoor right next to a light source)\r<br />\r<br />SpecularAmountMultiplierDay=5.0\r<br />SpecularAmountMultiplierNight=5.0\r<br />SpecularAmountMultiplierInterior=5.0\r<br />SpecularPowerMultiplierDay=6.0\r<br />SpecularPowerMultiplierNight=6.0\r<br />SpecularPowerMultiplierInterior=6.0\r<br />(KEEP THESE TWO AT 0)\r<br />SpecularFromLightDay=0.0 \r<br />SpecularFromLightNight=0.0\r<br />\r<br />\r<br />\r<br />Also, for those who are curious I am using Project ENB - Realistic Setting.\r<br />\r<br />[color=yellow]Q: Are you planning on doing a CBBE/UNPB/LB/ADEC/ *insert body here* version?[/color]\r<br />\r<br />A: No and... really no. I am only interested in the UNP body at the moment. The CBBE body has enough people working on armors for it. The LB body is too new and .. not really to my taste. As for the other bodies... not really my things.. sorry. However, you can freely convert this to any body you wish w/o needing my permission. Just remember the credit and we&#39;re good\r<br />\r<br />[color=yellow]Q: Will you be adding BBP support?[/color]\r<br />A: No, I don&#39;t think so. BBP never really interest me much because I generally see my character from the back, not the front. I didn&#39;t bother with BBP back in Oblivion, so it won&#39;t be any different here. However, if any of you want to add BBP support to my armors and release it as your own mod - go right ahead, just remember the credits and we&#39;ll be fine.\r<br />\r<br />[color=yellow]Q: Do you take request?[/color]\r<br />A: Depends really. Some armors does not really interest me, and some are just really painful to work with. Many of you who have no experience with this kind of works probably have no idea, but seriously, it&#39;s not exactly that exciting. If you have requests - post it in the comment section, but just know that I&#39;ll probably not get to it anytime soon.\r<br />\r<br />[color=yellow]Q: I have found a bug that involves this this and that[/color]\r<br />A: If you find a bug - post it in the comment section. If the bug involves weird behaviors with the armor meshes or texture - please post a picture with a title that said :ERROR - so that I can see it clearly and hopefully fix that in the next update.\r<br />\r<br />[color=yellow]Q: Why won&#39;t you respond to my PM? I reported a bug a couple of days ago, at least reply so that I know you&#39;ll look into it&#33;[/color]\r<br />A: Look, many people report bugs on my mods in both the comment section and PM. I cannot answer every single one of them. If the bug is small, I usually ignore it. If it&#39;s a major bug, then I&#39;ll fix it in the next update and mention your name in either a comment or the change log, crediting you for your help. I do not bother with forum message unless it is absolutely necessary, so please understand and don&#39;t be angry when I do not reply to your message. Know that I read EVERY SINGLE bug report and comments that you guys posted and took many of them to heart when I&#39;m updating the mods. If I don&#39;t reply, just assume that I&#39;m busy taking your bug report to heart and working my butts off to fix that issue. If it&#39;s a cultural thing that demands me to reply to your comments in forum and I don&#39;t understand it, then I&#39;m sorry.",
  "categoryId": "54",
  "version": "1.91",
  "author": "asianboy345",
  "createdUnix": "1350855970",
  "updatedUnix": "1417380314",
  "containsAdultContent": false,
  "uploadedBy": "asianboy345",
  "primaryFile": null,
  "files": [
    {
      "fileId": "108228",
      "name": "TERA Armors - UNP - Main File - version 1-7 - PART 1",
      "version": "1.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "246064",
      "fileName": "TERA Armors - UNP - Main File - version 1-7 - PART 1-25846-1-7.rar",
      "uploadedUnix": "1356782325",
      "modVersion": "1.7",
      "virusScanUrl": null,
      "changelogHtml": " Complete and full support for male characters for all armors <br/> \n Added 4 new armors since v 1.6 - Ascendant, Sikhanda, Brigandine and Deathskin - for a total of 40 armors <br/> \n Fixed some clipping issues <br/> \n Fixed most of the over-sized boots for the female armros <br/> \n General  fine-tuning for most of the armors <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TERA%20Armors%20-%20UNP%20-%20Main%20File%20-%20version%201-7%20-%20PART%201-25846-1-7.rar?fid=108228&ttl=1535797555&ri=8192&rs=8192&setec=9b77729fc26d1cf010ec2103571a4d18"
    },
    {
      "fileId": "108229",
      "name": "TERA Armors - UNP - Main File - version 1-7 - PART 2",
      "version": "1.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "137367",
      "fileName": "TERA Armors - UNP - Main File - version 1-7 - PART 2-25846-1-7.rar",
      "uploadedUnix": "1356782590",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/fb7a42373998b55df0cf356f1ab3273a5e2ffd59b2544d56af3689556fd7b426/analysis/1407327315/",
      "changelogHtml": " Complete and full support for male characters for all armors <br/> \n Added 4 new armors since v 1.6 - Ascendant, Sikhanda, Brigandine and Deathskin - for a total of 40 armors <br/> \n Fixed some clipping issues <br/> \n Fixed most of the over-sized boots for the female armros <br/> \n General  fine-tuning for most of the armors <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TERA%20Armors%20-%20UNP%20-%20Main%20File%20-%20version%201-7%20-%20PART%202-25846-1-7.rar?fid=108229&ttl=1535797555&ri=8192&rs=8192&setec=1b9ad3526edfb97095188f5a2439df45"
    },
    {
      "fileId": "1000054469",
      "name": "TERA Armors - Main File",
      "version": "1.75",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "450083",
      "fileName": "TERA Armors - Main File-25846-1-75.rar",
      "uploadedUnix": "1378972741",
      "modVersion": "1.75",
      "virusScanUrl": null,
      "changelogHtml": " - Add 7 new armors (Elleon, Tenebrescent, Chaos Bloodplate, Phonic, Graceshed, Necrosin, Ebon Shroud)\r<br />- Some armors now require perks to be craftable\r<br />- Robes now have armor rating (they appears as \"light armor\" in the game but are still cloth in nature and will work with any mage perks)\r<br />- Fixed most of 1st person issues with male armors and some female armors.\r<br />- Fixed some of the \"webbed finger\" bug, they are still very prevalent but are a little less noticeable.\r<br />- Fixed some general clippings and mesh bugs. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TERA%20Armors%20-%20Main%20File-25846-1-75.rar?fid=1000054469&ttl=1535797556&ri=8192&rs=8192&setec=505884289f874a7983c35e36f1ddc408"
    },
    {
      "fileId": "1000114765",
      "name": "Tera Armors - Main File",
      "version": "1.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "630309",
      "fileName": "Tera Armors - Main File-25846-1-9.rar",
      "uploadedUnix": "1403867697",
      "modVersion": "1.9",
      "virusScanUrl": null,
      "changelogHtml": " - Added 16 new sets \r<br />- Reworked about 30% of the old sets so they are more form fitting \r<br />= Inventory models fixed for all armors, both genders. They can all be dropped and picked up normally\r<br />- New normal maps added to all armors, old and new. These are much more detailed and rough compared to the older version, which can make some armors look like plastic. \r<br />- Remove the pseudo-light armor robes. The robes are now cloth again with 0 armor rating, but all their pre-enchanted versions give a flat armor rating boost depending on the tier \r<br />- Recipes for many armors changed. The robes recipes are now more complicated, but to get the pre-enchanted version, you&#39;ll only need the original unenchanted robe and a soul gem. The level of the soul gem depends on the robe \r<br />- Clarion is now switched to a light armor, renamed Cyasmic \r<br />- Many armors are given new names, see the comment section for the change list <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tera%20Armors%20-%20Main%20File-25846-1-9.rar?fid=1000114765&ttl=1535797556&ri=8192&rs=8192&setec=c398bc053d6f785feb722f6a43becb1d"
    },
    {
      "fileId": "1000114873",
      "name": "Tera Armors - Main File with Fix",
      "version": "1.91",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "631206",
      "fileName": "Tera Armors - Main File-25846-1-91.rar",
      "uploadedUnix": "1403918376",
      "modVersion": "1.91",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tera%20Armors%20-%20Main%20File-25846-1-91.rar?fid=1000114873&ttl=1535797556&ri=8192&rs=8192&setec=e6838f4e34baa4334e7b12f3e932a34f"
    },
    {
      "fileId": "1000137331",
      "name": "Level List Plugin",
      "version": "1.91",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "14",
      "fileName": "Level List Plugin-25846-1-91.rar",
      "uploadedUnix": "1417380314",
      "modVersion": "1.91",
      "virusScanUrl": "https://www.virustotal.com/file/e154ec758f4e82bcc5aa6f85adc96ff6817f6d92d2f32b61bab12ed0a348d790/analysis/1417380362/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Level%20List%20Plugin-25846-1-91.rar?fid=1000137331&ttl=1535797557&ri=8192&rs=8192&setec=982fb516ea25b6c9db68ebca00605ffb"
    }
  ]
}