{
  "modId": 25844.0,
  "modName": "Farming or Gardening for Skyrim",
  "summary": "This is a very easy farming system for Skyrim, made originally by the modder Magnemoe for Hearthfire.  I made a few small changes to make it usable in Skyrim without Hearthfire.",
  "descriptionHtml": "From the pictures you\\'ll probably be able to tell why the original mod uses resources from Hearthfire.  Get that mod at http://skyrim.nexusmods.com/mods/25655 \\\"Farm Everywhere\\\".  Please endorse that mod if you like this one.  \r\n\r\nAs a player who constantly goes alchemist no matter if I go smithing or enchanting or not, I love the ability to grow my own personal ingredient respawnitory.  It will require some tweaking to get some items looking right, and some will never look right (for example, the meshes being used for Mora Tapenella or Scaly Pholiota don\\'t include the logs they grow on, and since this is using all vanilla meshes, they will be floating mid-air).\r\n\r\nHow the mod actually works is described in better detail in the read-me included.  Basically, craft a hoe and power attack the ground 3 times to create a clump of dirt.  Before planting, using sneak, you can use a menu to move the clump of dirt around.  Once it\\'s set how you like it, add a seed.  In 24 hours the seed will become a plant and be harvestable.  In 3 days time harvested plants will regrow, and unused dirt piles will be deleted.\r\n\r\nFrom the original version you could grow:\r\nCabbage                 | Glow Mushrooms             |   Imp Stool\r\nCarrots*                  | Jazbay Grapes                |   Namira\\'s Rot\r\nGourds                   | Juniper Berries             |     Blisterwort\r\nLeeks                     | Lavender                         |  Nightshade\r\nPotatoes                 | Mora Tapenela               |    Nirnroot*\r\nCanis Root              | Blue Mountain Flowers      |   Scaly Photila\r\nTundra Cotton         | Purple Mountain Flowers |    Snowberries\r\nCreep Cluster          | Red Mountain Flowers |        Spiky Grass\r\nDeathbell                | Fly Amanita        |                Thistle\r\nDragon\\'s Tongue      | Bleeding Crown |                  Wheat\r\nFungal Pods             | White Cap |                        Hanging Moss\r\nGiant Lichen\r\n\r\nIn the 1.1 update the following are added:\r\nChicken Eggs  |         Rock Warbler Eggs       |        Pine Thrush Eggs\r\nChaurus Eggs   |        Crimson Nirnroot*        |       Blue Butterfly**\r\n\r\n* denotes a new form created by this mod, which will not play nice with auto collection mods.  All other items should be base game items as of the 1.1 version of the mod.\r\n\r\n** Blue butterfly\\'s are added more as an after thought.  They also have there own new form, probably wont respawn, and depending on the time of day, might not be blue butterfly\\'s.  And don\\'t expect them to move (though in testing, the luna moth born from blue butterfly wing did flap it\\'s wings as it flew in place, the blue butterfly\\'s do not).  It\\'s not as if growing a butterfly from a wing stuck in the ground is how it should work.  I don\\'t think of myself as a modder, and offer this as is.\r\n\r\nRequirements:\r\nSKSE (Magnemoe did some very nice scripting that needs it)\r\n\r\nNotes:\r\n-Because of the unevenness of the ground some dirt clumps may start off completely submerged.\r\n-The mounds created by this mod can be stood on, you know, if you want a flying garden in the sky.\r\n\r\nSpecial Thanks:\r\nMagnemoe:  for allowing me to upload this vanilla version of his mod.  The vast majority of this work was done by him.\r\n",
  "categoryId": "24",
  "version": "1.1",
  "author": "Mark",
  "createdUnix": "1350855439",
  "updatedUnix": "1351306039",
  "containsAdultContent": false,
  "uploadedBy": "m11811",
  "primaryFile": null,
  "files": [
    {
      "fileId": "95970",
      "name": "ZariaFarmingVanilla",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "96",
      "fileName": "ZariaFarmingVanilla-25844-1-1.zip",
      "uploadedUnix": "1351306039",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/3ea3a75d8b993defee81fe4881bc5e38d0babd266486cfab9a73982612521b1d/analysis/1407237486/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ZariaFarmingVanilla-25844-1-1.zip?fid=95970&ttl=1535797551&ri=8192&rs=8192&setec=42af6b55a6b68d918d7fcdf35b3774c8"
    }
  ]
}