{
  "modId": 25869.0,
  "modName": "Skyrim Unleashed",
  "summary": "Skyrim Unleashed is a complete re-balance of Leveled lists and Skyrims game-design for a real immersive adventure, deadly combats and rewarding experience&#33; Everything in files without scripts or heavy modifications.",
  "descriptionHtml": "[b]SU development is in standby for now. SU II beta is perfectly playable,balanced and enjoyable if don&#39;t use extra items mods (as recommended in the beta topic)[/b]\r<br />\r<br />Last part of the following description is outdated (chapter III and beyond). Read the sticky post in comments section for more informations.\r<br />\r<br />[center][img]http://lastrie01.free.fr/prezimg01.jpg[/img][/center]\r<br />\r<br />[center][url=http://www.skyrimgems.com][img]http://SkyrimGEMS.com/images/badge_featured_500.png[/img][/url][/center]\r<br />[center][/center]\r<br />[center][/center]\r<br />[center]DUEL - Combat realism is not required but STRONGLY RECOMMENDED&#33;[/center]\r<br />[center][url=http://skyrim.nexusmods.com/mods/2700][img]http://lastrie01.free.fr/duel.jpg[/img][/url][/center]\r<br />\r<br />[center][b]TESTIMONIALS[/b]\r<br />\r<br />[i]-Great mod... I really enjoy the diversity in game play. I firmly believe your work and vision is one of the best overhaul on nexus. I find playing without your mod leaves skyrim lacking in enjoyment. keep up your ideas \r<br />\r<br />\r<br />-This simply is brilliant, so far the best most balanced most compatible and most stable and most underrated complete overhaul i&#39;ve used so far... I really have no idea what to say right now, i&#39;ts simply brilliant \r<br />\r<br />\r<br />-This mod is amazing. It gave my TES V a second life. Creating new caracters was boring, because I knew it all, done everything after hundreds of hours of play. Now, everything is a challenge, everything is hard to get. Being a massive fan of Dark Souls and Demon Souls, I love that. You really get a sense of achievment when you finally kill that group of bandit that was bugging you for an eternity. Thanks you for your work. Please keep going &#33;\r<br />\r<br />\r<br />-First, SU II simply`feels` right... it`s one of those mods you don`t know notice it`s there but if you try to deactivate it, you realize you can`t play without it. It is well balanced and well optimized- I`m happy to report not one CTD while playing this mod. Levelled lists are exceptionally well done...Unlike some other overhauls, SU adds difficulty where was needed(in a lore friendly way)... while keeping in mind that Skyrim is also a game about exploration, so it doesn`t try to turn this into Demon Souls conversion. \r<br />\r<br />\r<br />-This mod is for people like me, people who would not dream of taking their level 1-5 noob character to bleak falls barrow, because how does one dare think such a scary place should be easy? Its about preparation and patience. Found one piece of really nice armor? Think about selling it (increased prices for rare goods) and actually go to an Alchemist and buy a powerful health potion, even if it takes all of your money; would you rather have that at the bottom of a dungeon or a pocket full of gold? This mod brings back the feeling of OOO for me, without being as intrusive as mods like Requiem. Learn to pick your fights; simply take on what you can and learn when to move on. Actually use the dialogue options to turn down quests if they sound dangerous. Knowing when to walk away and *move on* is a skill in itself. Playing this way you can actually get by without dying. The reward comes when you find you&#39;re turning down less things, going deeper into caves, and actually feeling like you are getting powerful.\r<br />\r<br />\r<br />- After several days now of playing with SU, I can honestly say &#34;WELL DONE&#34; 2 HUGE thumbs up, this is the BEST overhaul I&#39;ve ever had installed on one of Beth&#39;s games.\r<br />\r<br />\r<br />-best... overhaul... EVER&#33;&#33;&#33;&#33;&#33; love it&#33; I simple love it&#33; &gt;.&lt; played for about 2 hours by that time in vanilla game I have finished all the bounty quest in whiterun killed the first dragon, and half way to riften &gt;.&lt; with this I have onle went through valheim keep to get amren sword It was hard as F&%k to get it, this mod is a lot of fun :B \r<br />\r<br />\r<br />-Anyway I just wanted to say your mod is amazing, the subtle ways in which it changes the game are truly mind-blowing when you realise them.\r<br />\r<br />\r<br />-This mod makes it damn hard...gloriously hard...my nipples hard. It does exactly what it says. I&#39;m at over 2000 hours of play with this game and I had to change everything that I had been doing the entire time prior to using this mod. It was wonderful. Using cover, running like hell, using cover, dying, wash, rinse, repeat. I got my ass kicked the first time I strolled in to get the Dragonstone tablet. I should have realized what I was in for when I had to chug a potion after tangling with the wolves outside of Riverrun. I have gotten a handle on it and I&#39;m now level 22, but I will tell you that I have died more times getting there than I have during an entire playthroughs. This mod is a biatch, but you love her anyway. \r<br />\r<br />\r<br />-SU forces the player to experiment with Skyrim, and use the full potential hidden in the game. If you wish to survive, you have to hunt, craft, mine, sneak, learn, just to name a few. Do not look at this as difficulty, look at this as a possibility to dive into the captivating atmosphere of Skyrim. I have tried many overhauls, but as of yet, SU is the best for me, as it suits my need for harder gameplay\r<br />\r<br />\r<br />-I have experience with a lot of other gameplay changing mods and SU is among the best. The way SU balances out some of the exploits crafting/enchanting/buying&selling that persist with the vanilla game along with making enemy encounters less predictable makes Skyrim more fun, exciting, and challenging. \r<br />\r<br />\r<br />-This mod captures the spirit of the Classic RPG really well with having a &#39;road to power&#39;. Great work, finally a overhaul I can really enjoy&#33; It reminds me of games like Morrowind, Gothic series and The Witcher games. \r<br />\r<br />\r<br />-Saw this mod a while ago but was using so many other gameplay mods that i decided not to try it......biggest mistake EVER&#33; I can&#39;t believe it&#39;s not more popular&#33;&#33; So far i am simply loving the changes, most of all the economy, the vanilla one is so messed up it&#39;s painful and no mods got it right until now =)\r<br />\r<br />\r<br />-awesome mod. So far, it&#39;s better Skyre, and much more mod-friendly, a huge plus. Now you actually have to BUILD your character, both in perks and in the role-playing way. Want to deal with heavy mobs? Go get the equipment, or craft it. Take your time. Laast, you made my day.\r<br />\r<br />\r<br />-I&#39;ll be honest. At first I didn&#39;t understand the goal of this mod. After a few hours playing, I get it now. This mod is amazingly balanced and rewarding on a whole new level. Spending the first 10-15 levels doing side jobs, making coin brawling in taverns and hunting let me train and equip myself well enough to go back and take sweet revenge on that group of bandits that kicked my butt yesterday. Well done Laast.\r<br />\r<br />\r<br />-This is simply the best gameplay mod I&#39;ve ever seen.\r<br />\r<br />\r<br />-This is an amazing mod. You have done a brillant job at making the world of Skyrim challenging and fun to explore once again.\r<br />\r<br />\r<br />- Definitely one of the better 200+ Skyrim mods I&#39;ve wasted my time downloading. Adds an essential realistic flavor and an element of danger where there wasn&#39;t one before. You&#39;ll find yourself scurrying around looking for another tactic you didn&#39;t before know existed just to give you the edge over a simple bandit. Now I can appreciate all the little aspects of Skyrim.\r<br />\r<br />\r<br />- Your mod is great in so many ways though. I love the changes to items, smithing, levels, economy. And it&#39;s great to see how active and responsive you are&#33; \r<br />\r<br />\r<br />- Finally got to playing a new game using this...I&#39;m getting my arse handed to me all the time. I had to get a hireling just to get through Bleak Falls Barrow. I actually have to use block now&#33; Really loving this...great job.\r<br />\r<br />\r<br />- I found this mod alone to keep me challenged. It is well balanced.\r<br />\r<br />\r<br />- Still works unbelievable great&#33; getting money is hard and there is always a thing which i want to buy. I never reach 10.000 gold as a warrior xD finding treasure chests is still awesome. \r<br />\r<br />\r<br />- You make my countless hours wasted in Skyrim very enjoyable&#33;\r<br />\r<br />\r<br />- Endorsed and i want to thank you for this great mod, i played with my mod-setup the last 40 hours including combat-realism and of course skyrim unleashed. IT FEELS JUST GREAT&#33; \r<br />\r<br />\r<br />- Thanks Laast, I&#39;m having a great time playing Skyrim again with your mod.\r<br />\r<br />\r<br />- Thanks for all the work you&#39;ve put into this mod, Skyrim feels dangerous once again :)\r<br />\r<br />\r<br />- Now tactical combat is necessity, you must eliminate enemies one by one without rush and avoid missiles, especially at low/middle levels.\r<br />\r<br />\r<br />- This mod changed Skyrim for me. It made it fun again. For that, I cant thank you enough. You did what should have been done from the beginning. Skyrim is now tactically challenging. You have made all the perks have impact on the game. No more maxing out a few trees and cruising through the game. I have to block now. I NEVER had to block in vanila. The only down side is that my girlfriend wont play anymore because she keeps getting one-shot by archers. Actually I dunno if thats a downside or not... Seriously, as far as game play changes, this mod is without a doubt one of, if not the best. Endorsed and thanks.\r<br />\r<br />\r<br />- Endorsed&#33; Must have for players seeking a challenge&#33; After completing the main quest on Master I have been modding Skyrim to make it more difficult, THIS mod did it though&#33; Day and night difference. Skyrim is a challenge now. I used the vanilla (no Wo3e or Jasus) version of this mod on a new character and am enjoying every minute of it.\r<br />\r<br />\r<br />- I&#39;ve never played Skyrim so long before getting bored to death. And with this mod I&#39;m still immersed in the world and can&#39;t wait to play Skyrim again every evening. It ruined my social life. Fix it&#33;\r<br />\r<br />\r<br />- All I can say is DOWN LOAD THIS MOD&#33; DO IT&#33; YOU KNOW YOU WANNA&#33; In closing, I think this mod is summed up in three simple words: YOU-WILL-PUCKER\r<br />\r<br />\r<br />- I really enjoyed the mod so far. In my opinion the best de-leveller (from descriptions) but also one of the most underestimated mods on nexus.[/i][/center][i]\r<br />[/i]\r<br />\r<br />\r<br />\r<br />[center][img]http://lastrie01.free.fr/SU%20prez.jpg[/img][/center]\r<br />[center][img]http://lastrie01.free.fr/SU%20prez02.jpg[/img][/center]\r<br />[center][img]http://lastrie01.free.fr/SU%20prez03.jpg[/img][/center]\r<br />[center][img]http://lastrie01.free.fr/SU%20prez04.jpg[/img][/center]\r<br />[center][img]http://lastrie01.free.fr/SU%20prez05.jpg[/img][/center]\r<br />[center][img]http://lastrie01.free.fr/SU%20prez06.jpg[/img][/center][center][/center]\r<br />\r<br />\r<br />[center][b]Thanks to every players supporting Skyrim Unleashed&#33; Have fun&#33;\r<br />\r<br />Laast[/b][/center]",
  "categoryId": "24",
  "version": "2.4",
  "author": "Laast",
  "createdUnix": "1350910818",
  "updatedUnix": "1389094089",
  "containsAdultContent": false,
  "uploadedBy": "Laast",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000033599",
      "name": "1_Skyrim Unleashed DG and DB",
      "version": "2.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1444",
      "fileName": "1_Skyrim Unleashed DG and DB-25869-2-4.rar",
      "uploadedUnix": "1370846748",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/245c279c694a704a6e40eb259d432d92fed55215321569f738ed637f7f7435e7/analysis/1407598744/",
      "changelogHtml": " Fixed guards with missing name/loot. <br/> \n Fixed random adventurers/ brawlers agressivity. <br/> \n Fixed damage by PC in Legendary difficulty. <br/> \n Various fixes and balancing. <br/> \n Added DG only version + Hardcore addon file is now included as optional. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/1_Skyrim%20Unleashed%20DG%20and%20DB-25869-2-4.rar?fid=1000033599&ttl=1535797598&ri=8192&rs=8192&setec=5ec4a1fb96e2c5f9d0259d56ef6b0785"
    },
    {
      "fileId": "1000033600",
      "name": "2_Skyrim Unleashed DG",
      "version": "2.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1283",
      "fileName": "2_Skyrim Unleashed DG-25869-2-4.rar",
      "uploadedUnix": "1370846821",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/f28ab4dda7f2d9154ba8d22f81f6b8af1f6d2b047c0c244353f93deb4eba053f/analysis/1407598745/",
      "changelogHtml": " Fixed guards with missing name/loot. <br/> \n Fixed random adventurers/ brawlers agressivity. <br/> \n Fixed damage by PC in Legendary difficulty. <br/> \n Various fixes and balancing. <br/> \n Added DG only version + Hardcore addon file is now included as optional. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/2_Skyrim%20Unleashed%20DG-25869-2-4.rar?fid=1000033600&ttl=1535797599&ri=8192&rs=8192&setec=e9d122c2373ef041db2dd0f7a79b7f9a"
    },
    {
      "fileId": "1000033601",
      "name": "3_Skyrim Unleashed Vanilla",
      "version": "2.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1214",
      "fileName": "Skyrim Unleashed Vanilla-25869-2-4.rar",
      "uploadedUnix": "1370846895",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/088e011180233e832cba70aa2194a7e5883490d2b5f93c63d9357131823fefa1/analysis/1407598751/",
      "changelogHtml": " Fixed guards with missing name/loot. <br/> \n Fixed random adventurers/ brawlers agressivity. <br/> \n Fixed damage by PC in Legendary difficulty. <br/> \n Various fixes and balancing. <br/> \n Added DG only version + Hardcore addon file is now included as optional. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Unleashed%20Vanilla-25869-2-4.rar?fid=1000033601&ttl=1535797599&ri=8192&rs=8192&setec=4dd32fe37e9b611e411b6a382630380a"
    },
    {
      "fileId": "1000090325",
      "name": "Skyrim Unleashed II",
      "version": "Beta3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2225",
      "fileName": "SU II Beta-25869-Beta3.rar",
      "uploadedUnix": "1389094089",
      "modVersion": "Beta3",
      "virusScanUrl": "https://www.virustotal.com/file/5e202e50be51f2ea5a0482c8787d72919e1fcb7adc76999b0dca2abe595e27b4/analysis/1407875958/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SU%20II%20Beta-25869-Beta3.rar?fid=1000090325&ttl=1535797600&ri=8192&rs=8192&setec=86a33d53614866fda4fbbc84c34d5028"
    }
  ]
}