{
  "modId": 25872.0,
  "modName": "Der Schatten von Meresis",
  "summary": "(German) English translation \\\"The Shadow of Meresis\\\" available. (EV/DV) \r\nDie Mod fuegt eine laengere Quest ein, die euch durch die verschiedensten Orte in ganz Himmelsrand fuehren wird.",
  "descriptionHtml": "Get the English Version [url=http://skyrim.nexusmods.com/mods/36843//?\\']here[/url]. \r\n[img]http://i.imgur.com/zFDyj.png[/img]\r\n[img]http://i.imgur.com/hPJI8.png[/img] \r\n\r\n[i][font=\\'Georgia, Times New Roman, Times, serif\\'][size=4][b]Version:[/b][/size][/font][/i] 1.0 \r\n[font=\\'Georgia, Times New Roman, Times, serif\\'][i][b][size=4]Release[/size][/b][/i][/font]: 22.10.2012 \r\n[i][b][font=\\'Georgia, Times New Roman, Times, serif\\'][size=4]Dateigröße[/size][/font][/b][/i]: 70,0 MB \r\n[i][b][font=\\'Georgia, Times New Roman, Times, serif\\'][size=4]Sprachversion:[/size][/font][/b][/i] deutsch \r\n\r\nAm Ufer des Flusses Carth findet ihr eine Leiche, die scheinbar ohne äußere Verletzungen gestorben ist. Um den Hals dieser Person bemerkt ihr ein leicht glänzendes, schwarzes Amulett. Ohne zu zögern nehmt ihr das gefundene Schmuckstück in eure Hände. \r\nAls ihr wieder aufwacht liegt ihr schweißgebadet in der \\\"Vier Schilde Taverne\\\" in Drachenbrügge. Ein junger Wächter Stendarrs wacht neben euch. Wenn ihr die Augen schließt, könnt ihr es wieder in der Ferne hören: schmerzerfüllte Stimmen und dunkle Schatten, die euch im Fieberwahn heimsuchten... \r\n\r\nDie Mod fügt eine längere Quest ein, die euch durch verschiedene Orte in ganz Himmelsrand führen wird. Neben diesen neuen Orten und Dungeons werden mehrere neue Charaktere mit mehr als 200 voll vertonten Dialogzeilen von vier Sprechern eingefügt. Die Spieldauer des Plugins liegt etwa bei zwei bis drei Stunden. \r\n\r\nDie Quest beginnt an der Sägemühle von Einsamkeit (südlich von Kathas Hof) wo ihr auf einer kleinen Sandbank am dortigen Fluss eine Leiche finden werdet.\r\n\r\n[center] [URL= http://skyrim.nexusmods.com/mods/36843//?][IMG] http://i.imgur.com/GzvBlfB.png[/IMG][/URL] [/center]\r\n[img]http://i.imgur.com/KgQRU.png[/img] \r\n\r\n[img]http://i.imgur.com/KgQRU.png[/img] \r\n\r\nSkyrim Version 1.7.7.0.6 (offiziell Patch 1.7) \r\n\r\n\r\n[i][font=\\'Georgia, Times New Roman, Times, serif\\'][size=4][b]Trailer:[/b][/size][/font][/i]\r\n\r\n[youtube]4ziWdjybFAw[/youtube]\r\n\r\n[i][font=\\'Georgia, Times New Roman, Times, serif\\'][size=4][b]Videos:[/b][/size][/font][/i]\r\n\r\n[youtube]iBLp8-aKhBw[/youtube]\r\n\r\n[i][font=\\'Georgia, Times New Roman, Times, serif\\'][size=4][b]Inkompatibilitäten:[/b][/size][/font][/i]\r\n- Momentan wird durch eine Veränderung dieser Mod im Geistermeer ein Dungeon der Mod \\\"Erbe der vergessenen Schätze\\\" verdeckt, sodass \\\"Schatten von Meresis\\\" kurz deaktiviert werden muss um dieses Dungeon zu besuchen. Der umgekehrte Fall stellt jedoch kein Problem dar.\r\n\r\n[i][font=\\'Georgia, Times New Roman, Times, serif\\'][size=4][b]FAQ:[/b][/size][/font][/i]\r\n\r\nAchtung, enthält Spoiler:\r\n\r\n- In dem Schiff kann ich keine Fackeln anzünden.\r\nDas ist bewusst so gemacht. Das vorhandene Licht sollte ausreichen um das komplette Schiff zu erkunden. Eventuell kann es bei der Verwendung andere Mods die das Tages und Nachtlicht verändern bzw. dunkler machen zu dunkel in dem Schiff werden.\r\nAllerdings ist es ohne Probleme möglich Lichtzauber zu verwenden.\r\n\r\n\r\n- Ich hänge in dem Schloss fest, wie komme ich wieder raus?\r\nErkundet ein wenig das Schloss, ihr werdet früher oder später auf jemanden treffen der euch hilft.\r\n\r\n\r\n- Ich soll Pelagius drehen, finde allerdings die Winde nicht.\r\nAn dem Eingang von der Bibliothek zum Schlossturm findet sich links neben dem Eingang ein Hebel, der eine Tür zu einem geheimen Raum öffnet, in dem sich die Winde befindet.\r\n\r\n\r\n- Ich verstehe das Wasserrätsel nicht.\r\nErklärung: Jede der vier Wassersäulen muss auf die richtige Stufe eingestellt werden. Dazu finden sich bei Nacht Hinweise im Innenhof.\r\nDes weiteren werden zur Morgen- und Abenddämmerung weitere Hinweise sichtbar.\r\n\r\n\r\n- Ich brauche einen weiteren Tipp für das Wasserrätsel.\r\nDer einzige wirklich schwierige Hinweis lautet: \\\"Die Laufbahnen des vollen Masser und des leeren Masser sind gemeinsam so hoch wie der höchste Punkt des Himmels.\\\"\r\nDer höchste Punkt des Himmels entspricht der höchsten Einstellung für eine Säule. D.h. die Stufe des vollen Masser (Vollmond) und des leere Massers haben addiert die Stufe 8. \r\n\r\n\r\n- Ich kann den Spiegel nicht aktivieren.\r\nDie Spiegel muss vorsichtig am unteren Rand aktiviert werden, wo zugegebenermaßen etwas präzise mit dem Fadenkreuz gezielt werden muss.\r\n\r\n\r\nIch wünsche viel Spaß beim Spielen .",
  "categoryId": "35",
  "version": "1.0",
  "author": "Hebrock",
  "createdUnix": "1350915000",
  "updatedUnix": "1350915091",
  "containsAdultContent": false,
  "uploadedBy": "Hebrock",
  "primaryFile": null,
  "files": [
    {
      "fileId": "95180",
      "name": "Der Schatten von Meresis",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "72178",
      "fileName": "Der Schatten von Meresis-25872-1-0.rar",
      "uploadedUnix": "1350915091",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/648c3e0fc0dbc8fde2545c0d408d062c77662a5eb68349573385b0e394c87921/analysis/1407232160/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Der%20Schatten%20von%20Meresis-25872-1-0.rar?fid=95180&ttl=1535797603&ri=8192&rs=8192&setec=c4e292c8a7f3595b02171c2680405ac0"
    }
  ]
}