{
  "modId": 2588.0,
  "modName": "Link from Legend of Zelda",
  "summary": "Begin TES5 SKYRIM as Link from Legend of Zelda.  New starting location, weapons, models, textures, and sounds.  ",
  "descriptionHtml": "Update 8.20.2012\r\nHey Community,\r\n\r\n     Sorry for the long delay in information. Currently I am focused on projects for work and personal.  If anyone is interested in taking the assets from this project and compiling them to the steam workshop, please send me a pm.\r\n\r\nUpdate 12.15.2011\r\n\r\nI added a quick test in the images section of a character you are likely to run into once the full construction set version of the mod is released.  This is very w.i.p. right now, so far just messing with colors and facial stuff.  Weapons are still undecided.  Perhaps this is how you will acquire some of Link\\'s better equipment in the game...\r\n\r\nUpdate 12.12.2011\r\n\r\nI have uploaded a new Test v 0.4 of the mod.  It adds the following.\r\n\r\n-Navi ring for permanent whisp\r\n-Changes to armor texture maps\r\n-Improvements to the hand textures (see image)\r\n-Gear has been balanced for starting equipment\r\n-Hat mesh fix so that it will scale with Larger characters\r\n-Hylian corrected\r\n-bat file to call non enchanted Link items to inventory for importing to old saves or doing your own enchantments as you progress. \r\n\r\nBased on a popular request, I have made it so you now start with more basic level gear.  You can now use enchanting and smithing to improve Link\\'s items yourself.  If you need to add a higher level enchantment to one of his items but already have done so, use the bat file in the .rar to call his base level items to your inventory. This way you can always put a new enchantment on the Link clothes.  This is also useful if you wish to import these items to another save file.\r\n\r\nI posted another mod which improves male human hands by adding detail and fixing the nails.  This is included in this mod but with younger, hairless hands.  If you want to grab the older hairy hands, head over to here...\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=3433\r\n\r\n\r\nUpdate 12.5.2011\r\n\r\nThis is a test version of a Link/Zelda mod.  The final version will be released with more content once the tool set comes out.  Please download and leave a comment about things you would like different.  Below is a small list of future changes already in the pipe but please feel free to comment about things you would like adjusted or added.  I added a video as well you can watch on youtube.\r\n\r\nhttp://www.youtube.com/watch?v=UCccSkV6KqA\r\n\r\nPlease do not use these files for creation of other mods for now.  Please contact me through the Nexus though if you have a question regarding this.\r\n\r\n\r\nDESCRIPTION\r\n\r\nI have done a link redesign that I feel fits in well with the Skyrim theme.  Do not expect to see a specific Link from a specific Zelda, because this is not it.  The tool set is still not out so In the meantime, I am only focusing on Links model, Textures, and assets.  \r\n\r\nThe game starts you off on an alter in a little temple looking place at the Evergreen Grove.  There you can grab all your gear from a chest and head off and do whatever you want.  There is a marker if you want to start with the main quest, but the rest of the map is blanked out fresh.\r\n\r\nThe idea is to focus on 1 handed, block, light armor, potion making. I have enchanted his gear to help offset his low armor values. I am still tweaking the values of the starting items. I would like you to be able to use them the entire game. The buffed up items also help simulate more Zelda play style, where killing things is fairly simple, and defense is based on using your shield effectively rather than armor\r\n\r\nBelow is a list of changes I have made to vanilla skyrim...\r\n\r\nyounger woodelf face normal map\r\nBlue woodelf eye color map\r\nyounger male face normal map\r\nyounger male face color map\r\nyounger male face spec map\r\nyounger male body normal map\r\nyounger male body color map\r\nyounger hand color map with no hair or dirt\r\nyounger hand normal map\r\nlink tunic color map\r\nlink tunic spec map\r\nlink tunic normal map\r\nbracer color map\r\nbracer normal map\r\nbrace spec map\r\nboot color map\r\nfine hat mesh\r\nfine hate color map\r\nfine hate normal map\r\nfine hate spec map\r\nMagic sword color map\r\nMagic sword spec map\r\nMagic sword normal map\r\nhyrule shield color map\r\nNew game starting location\r\nNo major cities pre shown on map\r\nnew smaller character scale\r\nnew intro\r\nnew title music\r\nnew level up music\r\nnavi ring\r\nchest and fireflies at starting location\r\n\r\nPotential Change List\r\n-Starting chest location\r\n-Start with Epona\r\n-Master sword textures/Mesh\r\n-Master sword and other quests\r\n\r\nAll rights for skyrim belong to Bethesda and so on.\r\nAll work and concepts based on Link by Nintendo.\r\nAll right for music based on the 25th Anniversary Zelda Orchestra Recording.\r\nHappy to add anything else in this section if needed.\r\n\r\nJust a side note.  Parts of this mod may also be a useful alternative for....\r\n\r\n-Hairless younger bodies\r\n-Younger faces for male\r\n-Less angular wood elves\r\n-Better hand textures with no hair or blood\r\n-Blue eyes for wood elves\r\n\r\nPlease check out this mod if you would like to just improve the regular vanilla hands.\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=3433\r\n\r\n\r\n\r\n",
  "categoryId": "29",
  "version": "0.4",
  "author": "alteredTheBeast",
  "createdUnix": "1322999577",
  "updatedUnix": "1323677372",
  "containsAdultContent": false,
  "uploadedBy": "alteredTheBeast",
  "primaryFile": null,
  "files": [
    {
      "fileId": "9597",
      "name": "TES5_LinkMod_Testv4",
      "version": "0.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25022",
      "fileName": "TES5_LinkMod_Testv4-2588.rar",
      "uploadedUnix": "1323677372",
      "modVersion": "0.4",
      "virusScanUrl": "https://www.virustotal.com/file/a9dd8481084ee17e55e4a2f642c0ec38b04c603bb86f7f9c74ba38b53fe618f7/analysis/1406509876/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TES5_LinkMod_Testv4-2588.rar?fid=9597&ttl=1535756912&ri=8192&rs=8192&setec=e86db3a73b19c73b2fd893993055f217"
    }
  ]
}