{
  "modId": 25882.0,
  "modName": "Imperial Robes",
  "summary": "Do you like the college-style mage robes but feel self-conscious about wearing blue in front of your Legion pals? This mod adds two mage robes in proud Imperial red and gold.",
  "descriptionHtml": "[img=center]http://skyrim.nexusmods.com/mods/images/25882-1-1361643292.jpg[/img]\r\n\r\n[line]\r\n\r\n[size=4][i]    Do you like the college-style mage robes but feel self-conscious about wearing blue in front of your Legion pals? This mod adds two mage robes in proud Imperial red and gold.[/i][/size]\r\n\r\n    [size=5][b]INTRODUCTION[/b][/size]\r\n\r\n    I first uploaded it on the Steam Workshop, where people have been enjoying it thus far, but I figured since this site seems to be where the big fish of Elder Scrolls modding swim, it would be an even more nurturing environment for a fledgling modder who wants to learn the ropes.\r\n\r\n    This is my first mod for an Elder Scrolls game, but it is actually not too shabby. Nevertheless I am eager to learn what you beautiful people think I could have done better, and how. I welcome all kinds of feedback, suggestions and requests and will try to respond to all comments. Let me know if everything works for you. And also if it doesn\\'t.\r\n\r\n    [size=5][b]FEATURES[/b][/size]\r\n\r\n    This mod adds six garments to the game:\r\n[list]\r\n    [*] The [b]Imperial Recruit Robes[/b] and [b]Imperial Recruit Hood[/b], which are based on the Novice Robes and Novice Hood and have the same stats as those, with an added 20% health regen bonus to help you hold the line.\r\n\r\n    [*] The [b]Imperial Specialist Robes[/b], which are based on the Expert Robes and come in five varieties, one for each school of magic. Similarly to the Recruit Robes their stats are the same as \\'Expert Robes of [Magic School]\\' but with a 20% bonus to health regen. They also come in an unenchanted version called \\'Legion Robes\\'.\r\n\r\n    [*] The [b]Imperial Foxskin Boots[/b] and the [b]Imperial Foxskin Bracers[/b], which are simply cloth versions of Imperial Light Boots and Imperial Light Bracers for players who use the Mage Armor perk.\r\n[*] The [b]Imperial Battlemage Hood[/b], which is based on the unequippable \\'Torturer\\'s Hood\\' from the main game. Unlike the Recruit Hood, the Battlemage hood can be worn with most armor without immersion-breaking clipping issues (for reference, it uses the same mesh as the Thieves\\' Guild Hood.) It fortifies magicka regeneration by 40 percent.\r\n[/list]\r\n    For details on the stats of the robes, see screenshots.\r\n\r\n    They can be bought from Beirand, the Solitude Blacksmith and Imperial Outfitter. Note however that the SPECIALIST ROBES AND BATTLEMAGE HOOD ARE ONLY AVAILABLE AFTER YOUR CHARACTER REACHES LEVEL 24, much like the Expert Robes in the vanilla game. Everything except the Specialist Robes can also be purchased from the Quartermasters in the Imperial camps around Skyrim.\r\n\r\n    The robes are retextured versions of the Novice and Expert Robes. The textures were made by combining elements from those robes with elements from the Imperial Light Armor, with handpainted details. They use custom normal maps, with shiny leather parts and dull fabric. The mod includes no meshes, so it should work with any body- and/or armor replacer.\r\n\r\n    I welcome all kinds of feedback and suggestions and will try to respond to all comments. Let me know if everything works for you. And also if it doesn\\'t.\r\n\r\nI can\\'t seem to add tags to this mod, forums suggest it will pass in a while. In the meantime, I\\'d appreciate your help with tagging it.\r\n\r\n[size=5][b]TREASURE HUNT![/b][/size]\r\n\r\nSince version 1.1 of the mod, there is a unique version of the Recruit Robes, with a new unique texture and better stats than the regular Recruit Robes. It\\'s a mostly atmospheric piece for players who like immersion; power players might be disappointed. I hid it in a lore-appropriate place. Here\\'s the clue:\r\n\r\n - It is in the bedchamber of a mage who was in the Legion during the Great War with the Aldmeri Dominion.\r\n\r\nIt is in a chest. Happy hunting.\r\n\r\nIf this works out I\\'ll do more of these.\r\n\r\n    [size=5][b]MANUAL INSTALLATION[/b][/size]\r\n\r\nThis mod should be fully compatible with the Nexus Mod Manager, but it is just as easy to install manually:\r\n[list=1]\r\n    [*] Open \\'ImperialRobes.rar\\' and extract the contents (the \\'Data\\' folder containing \\'imperialrobes.esp\\' and \\'imperialrobes.bsa\\') into your skyrim game folder (It is usually at \\'C:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\\\'.)\r\n\r\n    [*] Open the Skyrim launcher, click \\'Data Files\\' and check \\'imperialrobes.esp\\' in the list. (Sometimes you have to wait a while while Steam updates any subscribed mods you might have.)\r\n\r\n    [*] This should be it. Congratulate yourself on a job well done. Turn on some [url=http://www.youtube.com/watch?v=n1LMdAYt6b8]celebratory music[/url]; pour a glass of red wine and think back on the highs and lows of this long and arduous adventure. Call your mother and tell her what you\\'ve done, she will definitely be very proud of you. Beirand and the Quartermasters should have the robes next time you start the game.\r\n[/list]\r\n[size=5][b]F.A.Q.[/b][/size]\r\n\r\n    Q: Will you make similar robes for the Stormcloaks?\r\n    A: YES. In fact I [url=http://skyrim.nexusmods.com/mods/27378/] I just finished it[/url]\r\n\r\nQ: Will there be an unenchanted version of the Recruit Robes?\r\nA: No. The choice to have an unechanted version only of the Specialist Robes (the Legion Robes) and not of the Recruit Robes was a very deliberate one on my part. The basis was that there are unenchanted Expert Robes in the main game, but no such thing for the Novice Robes. I aim for this mod to integrate as smoothly as possible with the vanilla experience. I hope nobody minds too much.\r\n\r\nQ: Will you make the Robes craftable?\r\nA: No, seeing as robes are not craftable in the main game. Once again sorry to everyone who does not share my philosophy on preserving the sanctity of the game. Please don\\'t be mad.\r\n\r\n    [size=5][b]TRANSLATIONS[/b][/size]\r\n\r\n[url=http://modgames.net/load/249-1-0-14476] RUSSIAN[/url] - A Russian language version of the mod is available from Russian site [url=http://modgames.net/load/249-1-0-14476]modgames.net[/url].\r\n\r\n[url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/vetements_et_objets/robes_de_la_legion_imperiale.php]FRENCH[/url] - A French translation of the mod was developed by French group [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/vetements_et_objets/robes_de_la_legion_imperiale.php]La confrérie des traducteurs[/url], and is available through their site.\r\n\r\n [size=5][b]CHANGE LOG[/b][/size]\r\n\r\nVersion 2.0 - February 23rd 2013\r\n - All new textures!\r\n - All new normal maps!\r\n - Beast race support for the hoods.\r\n - The Battlemage Hood is now leveled to 24.\r\n\r\nVersion 1.2 - November 17th 2012\r\n- Added the Battlemage Hood, see above.\r\n- Equipped the two battlemages in the intro and the Helgen Keep Torurer with Battlemage Hoods.\r\n- Made the robes available from the Quartermasters at the various Imperial camps.\r\n- Lowered the price of the Recruit Robes to a more reasonable level.\r\n- Made the treasure hunt chest player-owned.\r\n\r\nVersion 1.1 - October 24th 2012\r\n- Fixed the Imperial Foxskin Boots and Bracers being classified as light armor.\r\n- Fixed the first person texture of the Recruit Robes being that of the Expert Robes.\r\n- Added a unique version with a special texture of the Recruit Robes to a secret location. \r\n\r\n[size=5][b]THANKS[/b][/size]\r\n\r\n[list]\r\n[*] Heron on the Steam Workshop, for pointing out an error with the foxskin gear (that I promtly fixed in 1.1)\r\n[*] Lumenbeing on the Skyrim Nexus, for inspiring the secret bonus version of the recruit robes.\r\n[*] antisupastar on the Nexus for organizing the Russian version, and Aspard on modgames.net for the translation.\r\n[*] Valkyr47 on the Nexus for translating the mod into French.\r\n[/list]\r\nHelp me make this mod better by giving your suggestions and opinions. If they are especially helpful I\\'ll put you here.\r\n[size=8]~[/size]\r\nYou can also subscribe to this mod on the [url=http://steamcommunity.com/sharedfiles/filedetails/?id=103771164&searchtext=]Steam Workshop[/url]\r\n\r\nPraise be Akatosh and all the Divines.\r\nGustav",
  "categoryId": "60",
  "version": "2.0",
  "author": "Gustav Lundgren",
  "createdUnix": "1350928539",
  "updatedUnix": "1361645060",
  "containsAdultContent": false,
  "uploadedBy": "GustavL",
  "primaryFile": null,
  "files": [
    {
      "fileId": "95441",
      "name": "Imperial Legion Robes 1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5338",
      "fileName": "Imperial Legion Robes-25882-1-1.rar",
      "uploadedUnix": "1351027489",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2976f4ff3cf3723262ea2f8ad5805557de557c4664b8d3c1c99446fa82aef48c/analysis/1407233733/",
      "changelogHtml": " Fixed an error where the Imperial Foxskin Boots and Bracers were still classified light armour. Thanks to Workshop user Heron for pointing this out. <br/> \n Fixed an error where the female first person model for the specialist robes used the original blue expert robes texture. <br/> \n Added a unique set of Recruit Robes with unique textures to a secret location. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imperial%20Legion%20Robes-25882-1-1.rar?fid=95441&ttl=1535797615&ri=8192&rs=8192&setec=6c4be6a4825193fc13948989bee76e05"
    },
    {
      "fileId": "100020",
      "name": "Imperial Legion Robes 1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5886",
      "fileName": "Imperial Legion Robes-25882-1-2.rar",
      "uploadedUnix": "1353148432",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/b043e0a5ef5b577dab6cb070a4dd08e03d8270eb2d1dd656d172b245b17826d0/analysis/1407266607/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imperial%20Legion%20Robes-25882-1-2.rar?fid=100020&ttl=1535797615&ri=8192&rs=8192&setec=bc8b4167601f79608dc9430ccfcdb60f"
    },
    {
      "fileId": "1000012491",
      "name": "Imperial Robes 2_0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6396",
      "fileName": "Imperial Robes 2_0-25882-2-0.rar",
      "uploadedUnix": "1361645060",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/375ec16022be0756adf8bfaddefef5a5ac4fd17dba020dac4b498918da86a3dd/analysis/1407435371/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imperial%20Robes%202_0-25882-2-0.rar?fid=1000012491&ttl=1535797615&ri=8192&rs=8192&setec=ffe11ea74ed27698af513d253a9fe1d1"
    }
  ]
}