{
  "modId": 25905.0,
  "modName": "Heike Schimanski Nordgirl Save Helgen Keep",
  "summary": "This is the savegame of Heike Schimanski, a Nordgirl, shortly after entering Helgen Keep on the Imperial side of the coin. Shared because I wanted to give something back to the community, but I can\\'t mod my way out of a wet paper bag.",
  "descriptionHtml": "Heike\\'s Background:\r\n\r\nHeike grew up in Cyrodiil but her childhood was far from normal. Her parents were assassinated when she was but a babe for reasons to this day unknown, but her presence left the Dark Brotherhood Assassin with a crisis of morals. The assassination of Heike\\'s parents had just been business, but just ignoring the crying infant in the crib? The assassin took the infant with him, but was then left with yet another problem, where to go with the infant?\r\nDrawing on his contacts, he handed the infant over to a Nord couple of criminals who were members of the thieve\\'s guild. The couple gave Heike her name and trained her to follow them in their footsteps.\r\nEventually, Heike\\'s adoptive parents ran afoul with a very powerful Imperial diplomat and history repeated itself, leaving Heike without a family a second time. But this time, Heike had a childhood of training in burglary and survival skills under her belt. Feeling no connection with Cyrodiil, she decides to travel to Skyrim, to see the land of her forebearers and to make a name for herself as both a thief and an assassin.\r\n\r\nHeike\\'s future. (As I intend to let it play out...)\r\nStraight after Riverwood, Heike goes to Windhelm to follow up on the Dark Brotherhood rumor. Riften is the first stop on that quest and the first chance to enter the Thieve\\'s Guild. Heike does mainly radiant quests for both factions (I have done the main stories so often I\\'m looking to play Skyrim as sandboxer with some direction, radiant quests are the awesome.) and eventually becomes fascinated with vampires. Somewhere in the back of her mind, there is also this idea of building a house from the ground up and maybe even adopt an orphan or two...\r\n(But you can take Heike on adventures of your own, of course. This is just what I want her to do.)\r\n\r\nWhat you need to make Heike look like the screenshots:\r\n\r\nApachii Skyhair. Heike uses the short version of the sleek flip.\r\nhttp://skyrim.nexusmods.com/mods/10168\r\n\r\nRealistic Female Faces.\r\nhttp://skyrim.nexusmods.com/mods/25551\r\n\r\nFlans Eyes for Skyrim.\r\nhttp://skyrim.nexusmods.com/mods/14539\r\n\r\nEnhanced Character Edit. Heike uses the anime eye-shape of it.\r\nhttp://skyrim.nexusmods.com/mods/12951\r\n\r\nOptional:\r\nThe UNP vanilla body. (I like women, I hate plastic.)\r\nhttp://skyrim.nexusmods.com/mods/6709\r\n\r\nUNP Delicate. (Awesomeness on top of awesomeness? Yes, please.)\r\nhttp://skyrim.nexusmods.com/mods/20530\r\n\r\nJaySuS Blades. (Moar Swords, Moar!)\r\nhttp://skyrim.nexusmods.com/mods/1002\r\n\r\nLustmord Vampire Armor. (Now we\\'re getting somewhere in Nosferatu land!)\r\nhttp://skyrim.nexusmods.com/mods/25852/\r\n\r\nBathing Beauties. (Migal\\'s magnum opus and the most righteous place to have Malukah singing in the background.)\r\nhttp://skyrim.nexusmods.com/mods/11427\r\n\r\nEisen Platte. (No comment, it\\'s the proverbial epithome of armor mods.)\r\nhttp://skyrim.nexusmods.com/mods/11050\r\n\r\nThat\\'s about it. Should you find any discrepancy between the screenshots of Heike and how she looks in your game, don\\'t bring it to me. I can\\'t help because no modded game out there is exactly like mine. First and foremost, I don\\'t run custom environments as I\\'m quite happy with what Bethesda gave us, so if you run an ENB, expect glaring differences. Also, if you just use the savegame as is, without bothering to get the mods that matter, I can\\'t predict for the life of me how Heike will turn out in your game.\r\nEnjoy Heike!",
  "categoryId": "43",
  "version": "Final",
  "author": "Javamonsoon",
  "createdUnix": "1350981532",
  "updatedUnix": "1350990463",
  "containsAdultContent": true,
  "uploadedBy": "javamonsoon2o2p",
  "primaryFile": null,
  "files": [
    {
      "fileId": "95341",
      "name": "Heike Schimanski",
      "version": "Final",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1368",
      "fileName": "Heike Schimanski-25905-Final.rar",
      "uploadedUnix": "1350981696",
      "modVersion": "Final",
      "virusScanUrl": "https://www.virustotal.com/file/8b48c969180761cefbefc5570396050c5ce1459e5504430cbf6b6fb1415a78e9/analysis/1407232932/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Heike%20Schimanski-25905-Final.rar?fid=95341&ttl=1535797652&ri=8192&rs=8192&setec=33c939635159012cf88141be3c5614f8"
    },
    {
      "fileId": "95353",
      "name": "Heike Schimanski Latest",
      "version": "Final",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1336",
      "fileName": "Heike Schimanski Latest-25905-Final.rar",
      "uploadedUnix": "1350990463",
      "modVersion": "Final",
      "virusScanUrl": "https://www.virustotal.com/file/f213b4471852752de647170041e3e87a424d576011bc79b9730cd5def61ee2c9/analysis/1407232995/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Heike%20Schimanski%20Latest-25905-Final.rar?fid=95353&ttl=1535797652&ri=8192&rs=8192&setec=ffdb65365bc70f50a4b687f5031fa2b7"
    }
  ]
}