{
  "modId": 25946.0,
  "modName": "Lustmord Vampire Armor - German Translation - Deutsche Version",
  "summary": "Dies ist die deutsche Uebersetzung der Mod \\\"Lustmord Vampire Armor\\\" von AmethystDeceiver.",
  "descriptionHtml": "[b][COLOR=#FFD700]Dies ist die deutsche Übersetzung der Mod \\\"Lustmord Vampire Armor\\\" von AmethystDeceiver. Alle Rechte für diese Mod liegen bei ihm. Der nachfolgende Text ist ebenfalls nur übersetzt. Es gibt Passagen, die in der \\\"Ich-Form\\\" übersetzt sind. Diese beziehen sich auf AmethystDeceiver, nicht auf mich ;)[/COLOR][/b]\r\n\r\n\r\nEinen lieben Dank an Bladensright, der die Beschriftung des Vorschau-Bildes übersetzt hat =)\r\n\r\n[CENTER]******************************************************************************************[/CENTER]\r\n\r\n[b][COLOR=#FFD700]Update 1.2[/COLOR][/b]\r\n- CBBE Oberschenkelschutz: Unsichtbarkeit gefixt\r\n- Armbrustbolzen: Unsichtbarkeit gefixt \r\n- Item-Exploit gefixt\r\n\r\nSollten keine großen Fehler mehr auftreten, wird das nächste Update ein Feature-Update (Version 2.0) sein. \r\nDaran arbeite ich gerade:\r\n- Alle männlichen Body-Mesh (unterstützt das richtige Gewicht, es gibt keine schmächtigen Männer mehr)\r\n- CBBE Slim und UNP Petite Frauen-Körper werden unterstützt\r\n- 3 neue Farbvarianten: Violett, Purpur und Pearl.\r\n\r\n[b][COLOR=#FFD700]Update 1.1[/COLOR][/b]\r\n- Armbrust und Bolzen sind hinzugekommen. Craften könnt ihr dies mit der Chaos-Schmiede unter Daedra\r\n\r\n[CENTER]******************************************************************************************[/CENTER]\r\n\r\n[b][COLOR=#FFD700]Beschreibung[/COLOR][/b]\r\nDie \\\"Lustmord Vampir Rüstung\\\" ist eine eigenständige, modulare und anpassbare, leichte Rüstung die aus vielen einzelnen Teilen besteht. Einige davon haben einzigartige Eigenschaften. Sie ist für männliche sowie weibliche Charaktere gedacht und unterstützt die Körper-Mods UNPB, CBBE sowie den Vanilla-Körper.\r\n\r\n\r\n[b][COLOR=#FFD700]Benötigt wird[/COLOR][/b]\r\n- Dawnguard \r\n- mindestens Patch 1.7\r\n- Die originale Datei von AmethystDeceiver. Diese findet ihr hier:  [URL=http://skyrim.nexusmods.com/mods/25852/]http://skyrim.nexusmods.com/mods/25852/[/URL]\r\n\r\n\r\n[b][COLOR=#FFD700]Features[/COLOR][/b]\r\n- modulare, aus vielen Komponenten bestehende, leichte Rüstung für männliche und weibliche Charaktere\r\n- Sie unterstützt Vanilla / UNP / CBBE Körper-Typen, welche jeweils seperat hergestellt werden können\r\n- Unabhängiges Schmiedesystem, eine herkömmliche Schmiede wird nicht benötigt\r\n- Mini Start-Quest: Untersuche den Aussichtspunkt der Abgeschnittenen Zunge\r\n- Strumpfband-Beutel: Eine Item-Aufbewahrungstasche (kann im Kraft-Menu angewählt und per Schrei-Taste geöffnet werden)\r\n- Blutdurst: Ist der Charakter mit dem kompletten Set ausgerüstet, kann die Rüstung mit Bluttränken gefüllt werden, sodass ein Rüstungsbonus von 25% angerechnet wird. Bluttränke können mit der rüstungseigenen Schmiede hergestellt werden (lest die Readme für weitere Details)\r\n\r\n\r\n[b][COLOR=#FFD700]Installation[/COLOR][/b]\r\n[b]NMM[/b]\r\n1. Ladet die originale, englische Mod mit der \\\"Download with Manager\\\"-Taste. Wählt entweder die HD (High Definition) oder die SD (Standart Definition) aus. Installiert nicht beides!\r\n2. Drückt danach im NMM die Installieren-Taste\r\n3. Ladet danach meine übersetzte Version (enthält nur die esp). Ihr werdet gefragt, ob die esp-Datei überschrieben werden soll. Bestätigt dies mit JA.\r\n4. Aktiviert anschließend alle esm und esp-Dateien im Launcher unter \\\"Datendateien\\\"\r\n\r\n[b]Manuell[/b]\r\n1. Ladet euch die originale, englische Mod manuell von Nexus. Wählt entweder die HD (High Definition) oder die SD (Standart Definition) aus. Installiert nicht beides!\r\n2. Entpackt die Datei und kopiert alles in den Skyrim/Data-Ordner. Überschreibt Dateien, wenn ihr dazu aufgefordert werdet\r\n3. Ladet nun meine übersetzte Version (enthält nur die esp). Ihr werdet gefragt, ob die esp-Datei überschrieben werden soll. Bestätigt dies mit JA.\r\n4. Aktiviert anschließend alle esm und esp-Dateien im Launcher unter \\\"Datendateien\\\"\r\n\r\nSiehe Abschnitt zur Fehlerbehebung, wenn nötig.\r\n\r\n\r\n[b][COLOR=#FFD700]Deinstallation[/COLOR][/b]\r\nDiese Methode sorgt für eine sichere und saubere Deinstallierung, welche das Risiko auf einen beschädigtes Savegame reduziert:\r\n\r\n1. Zieht alle Lustmord-Items aus und entfernt sie aus eurem Inventar (dies stellt sicher, dass es keine anhaltenden magischen Effekte mehr gibt)\r\n2. Reist an einen sicheren Ort zum Speichern, z. B. im Vanilla-Skyrim auf freiem Gelände. Wartet im Spiel etwa 24 Std. Speichert dann das Spiel und beendet Skyrim\r\n3. Wer die Mod mit NMM installiert hat, deinstalliert es nun auch mit diesem wieder. Ansonsten fahrt mit Schritt 4 fort.\r\n4. Bei manueller Installierung: Ladet euch den Lustmord-Uninstaller aus dem Download-Bereich (zu finden bei der originalen Mod) herunter und entpackt diese in den Skyrim/Data-Ordner. Installiert diese Datei nicht über den NMM!\r\n5. Ladet euren Spielstand, wartet weitere 24 Stunden im Spiel. Speichert und beendet.\r\n6. Nun könnt ihr die Lustmord.esp und bsa-Dateien löschen. Löscht nicht die Skripts im Skript-Ordner.\r\n\r\n[CENTER]******************[/CENTER]\r\n[b][COLOR=#FFD700]Hinweise und bekannte Probleme[/COLOR][/b]\r\n- Wenn nach der Ausstattung des Strumpfbandes das Strumpfband im Kraft-Menu nicht angezeigt wird, zieht es aus und wieder an.\r\n- Wenn nach eurem nähren mit Blutdurst-Power sich euer Rüstungswert nicht erhöht, zieht ein Rüstungsteil aus und wieder an.\r\n\r\nBeide Probleme werden durch ein bekanntes Problem mit der Spielengine verursacht, welche unter bestimmten Bedingungen die Ausrüstungsbedigungen nicht erkennt oder die zur Ausrüstung gehörenden Skripte nicht richtig aktualisiert.\r\n\r\nRüstungs-Bodyslots sind möglicherweise nicht kompatibel mit einigen Mods. (...was durch ein Belegen derselben Körperbereiche - auch wenn sie sich nicht überlagern - zu einem Ablegen der Ausrüstung führt). Um dieses Problem zu vermindern habe ich diesen Thread auf den 8. Februar zurückgesetzt (ob die Modentwickler diesem Protokoll folgen ist alleine ihre Entscheidung):\r\n[URL=http://forums.bethsoft.com/topic/1344290-body-part-ids-for-unused-biped-nodes-consensus/page__fromsearch__1]Body node discussion thread[/URL]\r\n\r\n[COLOR=#DAA520][b]Wie kann ich diese Rüstung herstellen?[/b][/COLOR]\r\nIhr solltet eine Quest im Abschnitt \\\"Verschiedenes\\\" im Questtagebuch erhalten. Der Name ist \\\"Untersuche den Aussichtspunkt der Abgeschnittenen Zunge\\\". Folgt dazu dem Questmarker. Ihr erhaltet den Zauber \\\"Chaos-Schmiede\\\" nach Abschluss dieser Quest.\r\n\r\nStellt sicher, dass ihr mindestens den Skyrim-Patch 1.6 installiert habt, damit der Questmarker erscheint. Sollte aus irgend einem Grund der Marker nicht erscheinen, überprüft euer Questlog und demarkiert/markiert diese Quest.\r\n\r\nSobald ihr den Crafting-Zauber aus dem Buch gelernt und die Chaos-Schmiede aufgerufen habt, seht ihr 4 Kategorien: Daedra, Leder, Schmuck und Sonstiges.\r\nDaedra enthält alle \\\"starken\\\" Rüstungsteile wie Kürass, Stiefel, Handstulpen, Handschuhe, usw.\r\nLeder enthält alle \\\"weichen\\\" Rüstungsteile wie Mütze, Umhang, Oberschenkelschutz, usw.\r\nSchmuck enthält alle verzauberbaren Schmuckteile\r\nSonstiges enthält alle weiblichen Rüstungsvarianten. Unterstützt werden Vanilla (Default), UNPB (blessed) und CBBE (curvy). Dieses gilt ebenfalls für die Strumpfbänder.\r\n\r\n\r\n[COLOR=#DAA520][b]Bedeutet es, diese Mod erfordert den Daedra-Perk?[/b][/COLOR]\r\nNein, ihr könnt alle Teile ohne den Perk herstellen. Mit diesem Perk bekommt man allerdings einen erhöhten Rüstungswert.\r\n\r\n[COLOR=#DAA520][b]Ist diese Rüstung nur für Vampire?[/b][/COLOR]\r\nZwar ist diese Rüstung für Vampire gemacht worden, du musst aber kein Vampir sein um diese Rüstung zu tragen. Diese Rüstung selbst ist \\\"vampirisch\\\", sie trinkt Blut, um an Macht zu gewinnen.\r\n\r\n[COLOR=#DAA520][b]Warum haben einige Rüstungsteile keinen Rüstungswert?[/b][/COLOR]\r\nTatsächlich haben sie einen Rüstungswert. Es ist ein  prozentual basierter Rüstungswert, der sich je nach  Anzahl der Stücke erhöht (max. 3 gestackte Prozent). Erhöht ihr euer Basis-Rüstungsset, wird die zusätzliche Menge an Rüstungsschutz ebenfalls erhöht.\r\n\r\n\r\n[b][COLOR=#FFD700]Fehlerbehebung[/COLOR][/b]\r\nSchaut in mein [URL=http://skyrim.nexusmods.com/articles/287]Mod-Benutzerhandbuch Survival Guide[/URL].\r\n",
  "categoryId": "54",
  "version": "1.2",
  "author": "Lorina",
  "createdUnix": "1351090428",
  "updatedUnix": "1351703210",
  "containsAdultContent": false,
  "uploadedBy": "Lorina",
  "primaryFile": null,
  "files": [
    {
      "fileId": "95560",
      "name": "Lustmord Armor DV",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "32",
      "fileName": "Lustmord Armor DV-25946-1-0.rar",
      "uploadedUnix": "1351090511",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/998872207318817613602020f9d7f856aec0b43aa631de98274b5295f656db80/analysis/1407234252/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lustmord%20Armor%20DV-25946-1-0.rar?fid=95560&ttl=1535797696&ri=8192&rs=8192&setec=f443dd09368b86b77f390c26fc27f477"
    },
    {
      "fileId": "96850",
      "name": "Lustmord Vampire Armor DV",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "33",
      "fileName": "Lustmord Vampire Armor-25946-1-1.rar",
      "uploadedUnix": "1351703210",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/408a83e5eeec42a657cc055f21b5c6325f626342e24ae12968c1c06621a2f53b/analysis/1407243749/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lustmord%20Vampire%20Armor-25946-1-1.rar?fid=96850&ttl=1535797696&ri=8192&rs=8192&setec=12b398a185b0c35991df924ac2c88321"
    }
  ]
}