{
  "modId": 25947.0,
  "modName": "A More Organized Luxury Suite feat General Stores",
  "summary": "REQUIRES: Bathing Beauties Luxury Suite AND General Stores.\r\nThis mod simply replaces several containers around the suite with general stores\\' activators. The result is a more organized and attractive place to store your gear. ",
  "descriptionHtml": "[color=red]***********************************************************\r\nI AM NOT ACTIVELY MODDING SKYRIM AT THE MOMENT.\r\n\r\nAnything I created is free for use and derivitive work. None of mods were complete and I apologize that some of them were never finished. If someone wants to pick up where I left off, they are welcome to use my work by either uploading their own mod or I can give them access to that mod\\'s page. \r\n\r\nMy custom work will continue as planned, and I am still taking commissioned followers, there is a waiting period of a few weeks however. \r\n\r\nThanks everyone for your support and hopefully I will come back soon. But alas, I have a seasonal job and until April 15th, I don\\'t know how much time I will have, or when I do have time, if I\\'ll want to return to skyrim modding.\r\n*********************************************************** [/color]\r\n\r\n[size=4]Required Mods:[/size] \r\n[url=http://skyrim.nexusmods.com/mods/11427]BBLS BEAUTIES Edition[/url] \r\n[url=http://skyrim.nexusmods.com/mods/18340]General Stores[/url]\r\nMy mod will do absolutely nothing but crash your game without the master files from the above two mods. They\\'re both amazing anyway, you need them! (I will make a Beefcakes Edition as soon as I can, but it may be a while, I encourage someone else to convert this to work with the beefcake edition!)\r\n\r\n\r\nThis mod adds General Stores activators to the Luxury Suite. \r\n\r\n[b][color=red][size=4]IMPORTANT[/size][/color][/b]\r\n[b]Before you activate this mod,[/b] go to the suite and retrieve all your things! This is very important. The objects in your safe upstairs should be safe but I make no promises! Also [b]back up your save game[/b] because I\\'ve only tested this on my machine/game. \r\n\r\n[b]Installation:[/b]\r\nDrop the .esp in your data folder and load it after all other BBLS Plugins, make SURE you have the general stores and luxury suite .esm files activate or you will CTD. \r\n\r\n[b]Uninstallation: \r\n[/b]No need to get your things out of storage, just throw away BBLSGeneralStoresbyNatilde.esp and you\\'re back to the old luxury suite! \r\n\r\n[b]Credits:\r\n[/b]Thank you to Migal for the BBLS, which is my guiltiest skyrim pleasure! \r\nAnd a big thank you to Harvey2112 for making General Stores which is by far, my favorite mod of all time!! seriouslyiwannahaveyourbabies :/\r\n\r\nThis mod took me less than an hour to make so if you don\\'t like something I encourage you to fire up the CK and customize it to your liking! The General Stores ESM is incredibly easy to work with, it was so much fun. That being said, as always I\\'ll listen to feedback and suggestions/requests, but I have a lot on my plate irl right now, and even more on my modding plate, so please understand if I can\\'t make every small change requested!",
  "categoryId": "67",
  "version": "1.0",
  "author": "Natilde",
  "createdUnix": "1351091264",
  "updatedUnix": "1351091356",
  "containsAdultContent": false,
  "uploadedBy": "natilde",
  "primaryFile": null,
  "files": [
    {
      "fileId": "95563",
      "name": "General Stores for the BBLS",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "General Stores for the BBLS-25947-1-0.7z",
      "uploadedUnix": "1351091356",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d7eb0cf87e645dcda60e931f21151021959a60900eb494df566eaf6082145302/analysis/1407234363/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/General%20Stores%20for%20the%20BBLS-25947-1-0.7z?fid=95563&ttl=1535797697&ri=8192&rs=8192&setec=8708aa8cf49cc82be2a2345efa04a59f"
    }
  ]
}