{
  "modId": 2595.0,
  "modName": "Traditional Elder Scrolls Classes for Skyrim",
  "summary": "This mod aims to recreate through console commands 20 of the 21 classes present in Morrowind  in Skyrim. ",
  "descriptionHtml": "If you\\'re anything like me, you like to roleplay a bit, it\\'s part of the point in an Elder Scrolls game. However, in some cases it seems like Bethesda\\'s gone to war against the roleplayer. I won\\'t get into heartfelt convictions here, but I will say this: I like to feel like my character is coming from somewhere and going to someplace else, that there\\'s a reason why he\\'s in prison. Now I understand why Bethesda removed the class system, most of us ended up making our own damn custom class anyway and doing what we wanted. However, I felt that there was another, under-appreciated facet of the class system. It gave your character a background, a mien, a set of tenets to adhere to. I don\\'t much like starting out as a nobody in Skyrim, so I made this mod. Sadly I\\'m not a wizard and can\\'t make this a simple .esp yet with no Construction Kit\r\n\r\nThis mod aims to recreate through console commands 20 of the 21 classes present in Morrowind (I did not include the Monk) in Skyrim. \r\n\r\nInstallation Notes:\r\nUnpack all the files in the folder into your Skyrim directory\r\nType bat <Filename> to attain your desired class only when you have control of your character or else some guy named Prisoner will steal your class\r\nCrouch once\r\nOptional: Type bat <Race> to get your delicious racial bonuses\r\n\r\nMechanics Notes:\r\n\r\n--On Racial bonuses - You may notice I reduce all the skills to 5 ala Morrowind and then use the setav command to, well, set the actor values to a corresponding level, this gets rid of racial skill bonuses, but not to fear, I have also included files for all the racial bonuses as well and done you the favor of fixing the egregious error of Imperials not having any sort of Speechcraft bonus whatsoever.\r\n\r\n--On skills that no longer exist - Since the classes are taken from Morrowind, certain skills don\\'t exist in Skyrim. As such, if a class is specialized in one of the three styles of combat and has a skill from that specialization, it gets an extra +10 bonus to Health/Stamina/Magicka for each skill that is nonexistent in Skyrim but only if it\\'s part of its main specialization. A Stealth specialized class won\\'t get +10 Magicka because it takes Mysticism. It also won\\'t get +10 Stamina because it takes Mercantile because Mercantile is now consolidated into Speechcraft.\r\n\r\n--On Statistics Bonuses - Skyrim does not have statistics, and that makes the nerd in me silently rage, but I can deal with it. Each class gets 100 points of bonuses divided between Stamina, Carry Weight, Health, Magicka, and Movement Speed. I thought long and hard on these to make them appropriate enough for the \\\"feel\\\" of the class. An Acrobat\\'s not gonna get any Magicka Bonuses, but he can move like the wind and carry more stuff than your average joe. A Knight isn\\'t going to move any faster than a normal person, but he\\'s going to be tougher and stronger than your average joe. Get the idea? Remember that when you activate the file you need to crouch once to activate your new movespeed.\r\n\r\n--On skills that were split but are now consolidated or skills that were consolidated but now are split- Axe/Blunt/Long Blade/Short Blade,  Heavy Armor/Medium Armor/Light Armor Speechcraft/Mercantile, Stealth/Pickpocket - If a class is stated that it specializes in a skill that has been consolidated or even split in Skyrim, the 20 point bonus is applied for the Major Skill and then +5 for each \\\"split\\\" skill afterward.  In the case of Pickpocket and Stealth, I\\'ve just applied the same bonus I do to Stealth to Pickpocket\r\nExample: The Barbarian specializes in Blunt Weapons and Axe, thus he gets +20 initially for Axe (arbitrary) and then another +5 for Blunt to one handed. Because Skyrim only differentiates between 1hand and 2hand, if the class has Block as a Major Skill from the original class in Morrowind, he will only get the points for 1h. If the class does not have Block as a Major Skill, then it gets the same points for 2h as well\r\n\r\n--On Specializations - Each Specialization gets some basic perks. Stealth Specializations get Backstab or Eagle Eye, Light Armor Rank 1, and Stealth Rank 1. Combat Specializations are more varied. If a Weapon Skill is taken and Block is also taken (as a Major) then you get Deflect Arrows, Armsman Rank 1, and Heavy Armor 1. If Block is not taken then you get Armsman 1, Heavy Armor 1, and Barbarian 1.\r\nThere are exceptions to the Combat = Heavy Armor Specialization rule. The Barbarian, Scout, and Archer for example all fit the role of a Light Armored class better in my opinion, also the Scout and Archer get Eagle Eye instead of Deflect Arrows (they take Medium Armor in Morrowind which is split between both Light and Heavy in Skyrim if you look at the Armors Skyrim provides) Magic Specializations get Novice Rank in all castable schools.\r\n\r\n\r\n--On Spells - Some classes do not get additional spells, some get a whole slew of them. I tried to match the best equivalents Skyrim has to the ones in Morrowind, as such some things just flat out don\\'t exist and there\\'s nothing I can do to make it exist.\r\n\r\nAll this stuff is incredibly arbitrary and simplified because I didn\\'t want to do too much thinking - if you don\\'t like it well whatever. Change the files yourself! That\\'s the magic of modding even if this \\\"mod\\\" is little more than a text file with some scripts. Huge credit to Nocturn Stalker whose mod - http://skyrimnexus.com/downloads/file.php?id=2028 - inspired this to be created.\r\nIf something\\'s broke, let me know.",
  "categoryId": "34",
  "version": "1.0",
  "author": "PTJ440",
  "createdUnix": "1323003286",
  "updatedUnix": "1323003334",
  "containsAdultContent": false,
  "uploadedBy": "PTJ440",
  "primaryFile": null,
  "files": [
    {
      "fileId": "6849",
      "name": "Skyrim Classes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Skyrim Classes-2595-1-0.7z",
      "uploadedUnix": "1323003334",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bfa1c2c7fbfa8c19374e8c4339e353e5a70b65ea0111c88415f6c94843612a12/analysis/1406476742/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Classes-2595-1-0.7z?fid=6849&ttl=1535756926&ri=8192&rs=8192&setec=ffe70bf6f77dcf9035047671b8aa13f0"
    }
  ]
}