{
  "modId": 25952.0,
  "modName": "TF_Kinda Better Horns - for iron helmets",
  "summary": "I hated the iron helmet texture, with the crappy ram horns. So I replaced it. Too bad the female mesh is so crappy that it\\'s almost incompatible with my texture. The horns aren\\'t pointy enough on that one...",
  "descriptionHtml": "***TF_KindaBetterHorns.7zip readme***\r\n\r\nDo you ever use the Iron Helmet? If you\\'re like me, you didn\\'t because the horns look odd, and not quite as cool as one would hope. I fixed it for myself eventually, but here\\'s the end result. It\\'s not high-res, but it\\'s a good enough fix for anyone on default res.\r\n\r\nI would be willing to do the same for the high-res pack textures if someone would kick down the relevant textures for me to do the same to. I am on 56k and don\\'t want to download it yet. I\\'m waiting on a far-flung library trip for that.\r\n\r\nAnyway, it replaces BOTH helmets, even though it looks strange with the female version, and if there are any bugs, please tell me on my nexus file page or blog at thefunktasm.wordpress.com\r\n\r\nTo install, simply place the Textures folder into your Skyrim \\\"data\\\" folder, which if you don\\'t know where it is, you\\'ll need to locate your steam directory, and then go into the \\\"steamapps\\\" folder, then \\\"common\\\", and Skyrim should be in there. From then, you go into the data folder and either drag the files from your decompression tool of choice or extract them there. Alternatively I\\'m sure that certain mod installers can install simple directory based mods like this so you can quickly remove them. It\\'s up to you.\r\n\r\nI\\'d also recommend a mod that gives females the same Iron Helmet as males.",
  "categoryId": "29",
  "version": "0.98.REL",
  "author": "The_Funktasm",
  "createdUnix": "1351097307",
  "updatedUnix": "1351098409",
  "containsAdultContent": false,
  "uploadedBy": "The_Funktasm",
  "primaryFile": null,
  "files": [
    {
      "fileId": "95597",
      "name": "TF_KindaBetterHorns",
      "version": "0.98.rel",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "794",
      "fileName": "TF_KindaBetterHorns-25952-0-98-rel.7z",
      "uploadedUnix": "1351098409",
      "modVersion": "0.98.rel",
      "virusScanUrl": "https://www.virustotal.com/file/2ad19ab1cf40e1c7b67978b0bc542130909d3d0da031658f6f6cd0922dc6378f/analysis/1407234461/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TF_KindaBetterHorns-25952-0-98-rel.7z?fid=95597&ttl=1535797705&ri=8192&rs=8192&setec=a67253071c0c9331d4e05eace6e9bb60"
    }
  ]
}