{
  "modId": 25981.0,
  "modName": "Masters of Skill",
  "summary": "This mod adds new Master Trainers of Skyrim who train skills up to level 100, whilst also adding prerequisite Quests in order to access their services. The existing trainers have had their training levels reduced (e.g. Common trainers now train up till 25 instead of 50). At this time, Archery and Heavy Armour are fully implemented.",
  "descriptionHtml": "This mod adds new Master Trainers of Skyrim who train skills up to level 100 given you complete a prerequisite Quest for each trainer. The existing trainers have had their training levels reduced (e.g. Common trainers now train up till 25, rather than 50). At the moment Archery and Heavy Armour are fully implemented.\r\n\r\nThe most important things to note:\r\n\r\n1. Back up your save before trying any mod.\r\n2. Load this mod AFTER the Vanilla Unofficial Patch - this is because the patch fixes a few errors in trainer classes, which this mod edits. This mod has replicated those fixes, however, to compensate.\r\n3. The vanilla Master Trainers will have unvoiced custom dialogue (as well as some other NPCs); this means you will need to turn subtitles on when asking about training, once you have reached a skill level of 75 in their respective skill. To see which trainers this affects, see the Installation section. I have kept this at the minimum.\r\n4. The Quest can be begun either by encountering the Master Trainer in your travels or by talking with the vanilla \\\"Master\\\" Trainer once you reach a skill level of 75 in their respective skill.\r\n\r\n\r\n[B]Table of Contents[/B]\r\n=========================================================================================\r\n1. Premise\r\n2. Details\r\n3. Installation and Set-Up\r\n4. Troubleshooting\r\n5. Bugs and Suggestions\r\n6. Spoilers - See the Readme\r\n=========================================================================================\r\n[B]Premise[/B]\r\n=========================================================================================\r\nBack in Oblivion I enjoyed that the Master Trainers were a little more involved in the world; giving to the Champion errands to complete before they offered their services. In truth I remembered these errands to be a little more engaging than they actually were, but nonetheless I have tried to apply that principle to Skyrim. \r\n=========================================================================================\r\n[B]Details[/B]\r\n=========================================================================================\r\nAt this stage this mod is incomplete; that is not because of an overanxious desire to upload something, but rather because I want to be guided in the right path of mod making for Skyrim. \r\n\r\nCurrently Completed:\r\n\r\nArchery - Anglalos\r\nHeavy Armour - Gaelion Dres\r\n\r\nThe training system has been slightly reworked in order to fit in with the spirit of this mod. Common trainers (at this stage Faendal) may train up up until Level 25 in their respective skill (at this stage Archery). Expert trainers (at this stage Aela the Huntress and Gharol) up until level 50. Master trainers (at this stage Niruin and Farkas) up until level 75. This is so that \\\"my\\\" \\\"Master\\\" trainers (which they are still regarded as such ingame, because of limitation issues) may train up until level 100. But before they will do so you must: 1) Find them and 2) Earn their willingness. This has a number of benefits. First, these trainers may be more friendly to your role-playing experience (for instance you need not have access to the Thieves Guild in order to train your Archery). Second these trainers may train you up till and beyond the vanilla restriction of 90. And thirdly they ask that you complete a Quest for them, which is not only - hopefully - fun, but will also reward you (given you take the time to find your reward) within the quest itself.\r\n\r\nYou can begin this quest one of two ways:\r\n\r\n1) Once you have exhausted the vanilla Master Trainer of his training (once you reach a skill level of 75 in their respective skill) you may ask him where to get further training.\r\n\r\n2) You may encounter the Master Trainer on your travels (a spoiler is included in the readme).\r\n\r\nIf ever in doubt, check your journal!\r\n\r\nNote: If you are using any Nude Mods, then your opponents will appear nude for the Archery Quest. Because of this, there is potentially nudity in this mod.\r\n=========================================================================================\r\n[B]Installation and Set-Up[/B]\r\n=========================================================================================\r\n1) Click the Download with Nexus Mod Manger button under the files tab\r\n2) Check the Masters of Combat.esp under Nexus Mod Manager or the Skyrim launcher\r\n\r\nor\r\n\r\n1) Click on download it manually in the Files tab\r\n2) Copy the contents of the downloaded archive to the Data folder\r\n3) Check the Masters of Combat.esp under Nexus Mod Manager or the Skyrim launcher\r\n\r\nThe following trainers will need subtitles enabled (although your journal will inform of all you really need to know):\r\n\r\nFarkas\r\nNiruin\r\n\r\nThere are other characters which will require subtitles enabled in order to understand them, but that should become apparant from the directions of the Quest.\r\n\r\nPlease save you game prior to installing this mod; I cannot guarantee this mod won\\'t affect it in undesirable ways, although I have expierenced no problems whatsoever.\r\n=========================================================================================\r\n[B]Troubleshooting[/B]\r\n=========================================================================================\r\nAlthough this mod uses custom dialogue, the Custom Dialogue Bug should not be present. I have tested it with a fix that I have used (which you do not need to worry about) and it has worked for me. If for some reason it does not work for you, and Anglalos does not give you any option to speak to him, save your game and then reload.\r\n\r\nCurrently, I do not know of any incompatibilities, except for with the Vanilla Unofficial Patch, which edits the trainer classes of Farkas and Aela. To fix this, load THIS mod AFTER the unofficial patch (this mod has replicated those fixes to compensate). If you encounter any others, please let me know. \r\n=========================================================================================\r\n[B]Bugs and Suggestions[/B]\r\n=========================================================================================\r\nI welcome bug reports; this is the primarily reason for uploading this mod now, so that I may be made aware of any mistakes I have made, that I can avoid in the future. Suggestions, too, are welcome, so long as they are constructive and respectful.\r\n=========================================================================================\r\n[B]Credits[/B]\r\n=========================================================================================\r\nAudacity - for sound editing\r\nBethesda - for the Creation Kit, for the lore of the Elder Scrolls, for TES:V - Skyrim, for sheer flexibility, etc.\r\nSharpshooter8 - for his ENB used in the Screenshots: http://skyrim.nexusmods.com/mods/15105\r\nMultiXwm by Vikichan - for Audio conversion\r\nTESVEdit by its associated authors - http://skyrim.nexusmods.com/mods/25859\r\n=========================================================================================",
  "categoryId": "35",
  "version": "2.0",
  "author": "JFD",
  "createdUnix": "1351146678",
  "updatedUnix": "1351146678",
  "containsAdultContent": false,
  "uploadedBy": "JesseFrederick",
  "primaryFile": null,
  "files": []
}