{
  "modId": 26005.0,
  "modName": "Highway to Hell - suspended updates until further notice",
  "summary": "Adds a player home / dungeon in hell.",
  "descriptionHtml": "This mod is a work in progress. It adds a player house in Hell. To get there, you must travel down a large highway leading up to a cave. The highway starts near Fort Greymoor. Enter the cave to go to hell. You will begin a long descent down into the Pool of Death below. Beware of the spikes as they will kill you if you land on one. Try to fall into the water in the Pool of Death. To make this easier, you can optionally traverse down a long trail of descending platforms that will push your jumping skills to the test. But be sure to heal between jumps. The south end of Hell is a player home with furnishings and crafting stations, including a burning bed! The exit from Hell is not too far away. However, there is one catch. You must travel to the north end where an army of devils and Satan himself await. You must fight the devils and Satan to open the way out. Included are devil leaders who hold some keys to the exit and the boss Satan who holds the master key. You can collect healing potions from defeated enemies to stay alive. But beware, though, that Satan is extremely powerful. Kill the leaders and Satan to obtain the keys to the exit doors. Also by defeating Satan, you can obtain a massive gold prize as well as his powerful fire staff.\r\n\r\nPlease note that if you are using nude mods, then some enemies will become nude.\r\n\r\nThis mod will likely contain several bugs since I’ve had so much trouble with it during the testing process. It is in beta development stages and will be updated occasionally. It has been discovered that the mod is not fully compatible with SKSE; the extender will sometimes cause the enemies to not appear unless you activate the mod after a clean save.\r\n\r\nWARNING: Due to a lighting bug, please create a new game save in Hell and when you need to reload or when you are killed, reload the game save.\r\n\r\nUpdates in the future will include:\r\nA stockable bookshelf\r\nA torture area\r\nMore furnishings\r\nOptimization\r\n\r\nYou will need to be at a very high level to beat this dungeon. Also beware that not only is this a living hell for you in the tough battles, but it can also be hell on your PC. Because of the large group of enemies in one area, a high-end PC is needed. To play this dungeon smoothly, you will need the following:\r\n\r\nWindows Vista / 7\r\nIntel Core i7 processor or equivalent\r\n8 GB RAM\r\n1024 MB NVIDIA GeForce GTX 460 or ATI Radeon HD 5850 video card or better\r\n\r\nUPDATE: It will be at least two more weeks until this mod is updated. I have recovered my hard drive to its original factory settings  to perform a clean upgrade to Windows 8 and as a result, my programs and Skyrim files have uninstalled. I will be gradually restoring my programs and files from backup and should be getting Skyrim back up soon.",
  "categoryId": "88",
  "version": "1.00",
  "author": "banzaigtv",
  "createdUnix": "1351205659",
  "updatedUnix": "1351205717",
  "containsAdultContent": false,
  "uploadedBy": "banzaigtv",
  "primaryFile": null,
  "files": [
    {
      "fileId": "95780",
      "name": "Main file",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "120",
      "fileName": "Main file-26005-1-00.rar",
      "uploadedUnix": "1351205717",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/cfcd262b5f18ac0c22968f13ea572c926672ee80fd84e711e8238311b5c3f03d/analysis/1407236283/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20file-26005-1-00.rar?fid=95780&ttl=1535797775&ri=8192&rs=8192&setec=f65b1121063a108d6fdf705e5ee05ac1"
    }
  ]
}