{
  "modId": 26027.0,
  "modName": "Project Infection",
  "summary": "This Mod is a work in progress and is still being worked on until the full release.",
  "descriptionHtml": "This mod not only modifies the abilities of the Afflicted, but it also causes the Afflicted to infect any type of Elf npc (Orcs, Wood elves, High elves, Dark elves, The Falmer).\r\n\r\nThis infection is not transmitted via bite, like in zombie movies. Instead it is transfered through the Afflicted\\'s Throw up Acid attack. This will burn the npc causing damage to them, and slowly killing them in the process. \r\n\r\nThe Infection can be seen as a biohazard, as anyone infected shows signs of infection.\r\n\r\nIf you see some one with these symptoms: A Aura that makes them appeared that they have been poisoned, Increased aggression, or perhaps you hear them making UH! sounds like they are being hit. \r\n\r\nThat means they are infected and are about to die. When they die, they stay dead for a few seconds, and resurrect as a NPC named: Infected (Insert Elf Race here) depending on what elve they are.\r\n\r\nHowever they appear that they have started to decay, but still have skin. These infected will attack on sight, and are fueled with pure adrenaline. This makes them Hard to kill, and I suggest hitting them from a distance.\r\n\r\nIf they aren\\'t killed within 2 minutes of transformation, they transform into stage two, which makes them into Feral Infected.\r\n\r\nThese Ferals are more dangerous and have the Afflicted\\'s ability to throw up acid to infect Elves.\r\n\r\n\r\nThis mod will also add Random Encounters.\r\n\r\nYou might find two Elves fighting an Afflicted and the Afflicted manages to infect one of them. The infected will come up to you asking for a Potion of Cure Disease.\r\nIf you don\\'t give it to him, he will transform into an Infected and attack you.\r\n\r\nYou might also find Feral infecteds across Skyrim, However sometimes they aren\\'t regular Feral infected and might have the name \\\"Feral Infected Dwemer or Feral Infected Snow elf\\\"\r\n\r\nThere is also a backstory that Elves cannot become Afflicted because of Peryite\\'s \\\"green liquid\\\"\r\n\r\nAlso the Falmers used this as a Bio-weapon against the Dwemer 200 Years prior to the Afflicted discovering this liquid.\r\n\r\n\r\nThis mod will also add more Afflicted to Skyrim, but this depends on if you completed the Spellbreaker quest, in which the Afflicted will be renamed differently.\r\n\r\nAlso in the version two of this mod when it is released and then updated, you will be able to Wield the power to convert Elves to Infected and they will follow your orders.\r\n\r\nAlso there will be Varients of infection, For example: Orcs are affected differnetly from the infection. There Feral infected form is similar to the Drudge in Gears of War 3. \r\n\r\nWhile Regular Elves will just become Rot Fiends from the Monster Mod, when they become feral, and they will be Renamed to Feral Infected.\r\n\r\n(People who use Monster Mod won\\'t have to worry as it will not rename Rot fiends or any other Npc related to Monster Mod)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nSo just give me Ideas if you want anything else and I will do them, or try.",
  "categoryId": "33",
  "version": "",
  "author": "Jakslade",
  "createdUnix": "1351265811",
  "updatedUnix": "1351265811",
  "containsAdultContent": false,
  "uploadedBy": "jakslade",
  "primaryFile": null,
  "files": []
}