{
  "modId": 26052.0,
  "modName": "League of Legends - Riven Sword Model",
  "summary": "3D model of the huge sword of Riven (League of Legends champion)",
  "descriptionHtml": "Sup guys.\r\nRiven is my favorite character in League of Legends (beside of Ahri) and I wanted to play with her sword.\r\n\r\n[size=3][b]Story[/b][/size]\r\nI was awakened and made a model of her sword.\r\nEnd of the story.\r\n\r\n[center][img]http://skyrim.nexusmods.com/mods/images/26052-1-1351292831.jpg[/img]\r\nunrendered\r\n\r\n[img]http://static.skyrim.nexusmods.com/mods/images/26052-1-1351292573.jpg[/img]\r\nIn the rendering corners are rounded (that makes it look round, but it isn\\'t). Looks horrible without it, but with texture it should look nice - I hope. You can imagine that the weird sword form was a pain in the ass.[/center]\r\n\r\nPolygons: 3180\r\nNot the lowest count, but should\\'nt be a problem for a sword that appears one or two times on the screen.\r\n\r\n[size=3][b]Need somebody to texture it[/b][/size]\r\nI just can\\'t texture it. I have not the abilities to do it. I have the ressources and I could do it, if I would invest a lot of time - sure. But I don\\'t have the time. So I\\'m searching for someone who\\'s able to texture this sword nicely and add it to the game. Putting it into the game would be something I could do on my own I guess tho. I never imported a model for Skyrim, so maybe the model is not \\\"perfect\\\". Talk to me and I can fix it somehow.\r\n\r\nI had a lot of different templates (artwork, screenshots) for the model of the sword. I tried to make the model as I think Riot thought of it. It\\'s mostly designed after the sword in it\\'s \\\"ultimate form\\\" that you see in the game. But also I was taking care of details in the artwork. I would love the texture to be as badass as ingame + artwork, with glowing effects and shizz. Would be awesome.\r\n\r\n[center][img]http://skyrim.nexusmods.com/mods/images/26052-1-1351291995.png[/img]\r\ningame screen[/center]\r\n\r\n[size=3][b]Ideas on the functions[/b][/size]\r\nYou can see that the model is the sword in it\\'s \\\"ultimate form\\\".\r\nI made the model so that, for the normal form, a couple of the model parts just need to be removed. I had in mind that the player is running around with the normal sword and has a power that switches or transforms the sword into the \\\"ultimate form\\\" for some time.\r\n\r\n[size=3][b]You want to texture it? Permissions and contact[/b][/size]\r\nIf somebody wants to texture it, go ahead and do what you want. Would be nice if you tell me how/where you did/used it. Otherwise you have full permissions to use it. The .obj is in the files section.\r\n\r\n\r\n[size=3][b]Credits:[/b][/size]\r\nThanks to Riot Games for the cool champion Riven\r\nThanks to whoever will hopfeully texture this sword\r\nThanks to myself to getting my lazy ass up and model the sword",
  "categoryId": "82",
  "version": "1337.42",
  "author": "SaioTV",
  "createdUnix": "1351291834",
  "updatedUnix": "1351291905",
  "containsAdultContent": false,
  "uploadedBy": "Saiodin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "95943",
      "name": "Riven sword obj data",
      "version": "0.9999999",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "38",
      "fileName": "Riven sword obj data-26052-0-9999999.rar",
      "uploadedUnix": "1351291905",
      "modVersion": "0.9999999",
      "virusScanUrl": "https://www.virustotal.com/file/562efd0495ee54ed4588134d15fb0d687944613ba402e055d75bdc5817a6bd7c/analysis/1407237223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riven%20sword%20obj%20data-26052-0-9999999.rar?fid=95943&ttl=1535797842&ri=8192&rs=8192&setec=96b245af90fb2de7e5205653cfe9f0f7"
    }
  ]
}