{
  "modId": 26074.0,
  "modName": "Fort Horizon",
  "summary": "Adds a huge player owned island fort in the sea of ghosts with a buzzling town and soon to come npc\\\\\\'s. this is in its early WIP.",
  "descriptionHtml": "Lore: Fort Horizon is a marvel of imperial architecture, Built to Strenghten imperial domination of the seas and destroy piracy its soaring towers and walls are a sight to behold for any sailor  sailing near it. Years after its construction a small town emerged because people flocked to the safety inside the giant walls. now that the civil war is brewing the stormcloaks are planning to siege the fort and claim it as their own, Will the dragonborn decide who is worthy enough to lay claim to such place.\r\n\r\nWhat you get: as mentioned before a huge fort with walls reaching across the island and inside you will find a town. You can  become the lord of this community and the fort will become your player home. \r\n\r\nWhat i have done:\r\nThe fort interior is about 40% complete.\r\nthere are almost no interiors for the houses.\r\nthere is a mine but nothing of interest inside it.\r\nmost of the exterior is done but there is allways the\r\nwork that never gets done, cluttering.\r\na ship with an interior.\r\n\r\nWhats left to do:\r\ncreate interiors for every building.\r\nadd more clutter.\r\nadd npc\\\\\\'s.\r\ncreate more interiors.\r\nnavmeshing .\r\nand a lot more.\r\n\r\nThis mod is about 40% done, this release is only a taste of what is yet to come:) and of course if you spot any glitches or bugs dont hesitate to comment. sorry for my horrible english:P\r\n\r\nRequirements:\r\nDawnguard\r\nlatest skyrim patch.\r\n\r\nhow to enter the fort horizon landscape, just type in coc abshackinterior01  and step outside the shack, unfortunatly i dont yet fully understand how to make teleporting possible so its a one way trip so make a save before you get there\r\n\r\n",
  "categoryId": "68",
  "version": "WIP",
  "author": "VGC",
  "createdUnix": "1351330240",
  "updatedUnix": "1351330240",
  "containsAdultContent": false,
  "uploadedBy": "VGC",
  "primaryFile": null,
  "files": []
}