{
  "modId": 26092.0,
  "modName": "V740T Rain and thunder improving",
  "summary": "New sounds of rain and thunder ...",
  "descriptionHtml": "The sounds of thunder and rain especially in the game are not necessarily refine-decided to change it ...\r\n\r\nModification of course compatible with Climates of Tamriel, CoT uses the file (esp), so all of the files that the paste to the folder (weather) we obtain priority and is loaded as those currently running the game. (unless a modification excludes the effects of, or in \\\"SkyrimPrefs\\\" you off weather effects)\r\n\r\nWHAT\\'S NEW?\r\n\r\nNow all kinds of rain not have their own repetitive soundtrack ..\r\n\r\nLight rain in the small creatures that always arouses the desire to escape, therefore, should be able to hear how we communicate with each other - now how are you listen to it will be heard (in low rainfall)\r\n\r\nAverage rain usually is not very diverse, and what was hidden already done - so the rain can be heard, but not any longer even silent cries of animals, even the smallest ...\r\n\r\nIn the case of very heavy rain I decided quite clearly differentiate the rain, because that\\'s what happens in nature. The sound is now more \\\"wave\\\" Listen, the harder it rains again and after a while a little less like ...\r\n\r\nWhen it comes to thunder Beside decided to add the same lightning type effects, lightning hit a tree, or odgl?os weak rain or wind. Along with the rain soundtrack gives us the type of effect - stronger rain during a lightning strike, or slightly stronger wind. (of course, these effects are not very clearly audible, so as not to spoil the real experience)\r\n\r\nMY OTHER MODS\r\n\r\nNEW era for PLANTS -------------------------- http://skyrim.nexusmods.com/mods/28212",
  "categoryId": "61",
  "version": "1.0",
  "author": "vito740",
  "createdUnix": "1351377937",
  "updatedUnix": "1351378908",
  "containsAdultContent": false,
  "uploadedBy": "vito740",
  "primaryFile": null,
  "files": [
    {
      "fileId": "96129",
      "name": "V740T Rain and thunder improving",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "49900",
      "fileName": "V740T Rain and thunder improving-26092-1-0.rar",
      "uploadedUnix": "1351378908",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/47d479177f344e58f28dc964b097044731356c85a5deaa5b84b399f910a1cf54/analysis/1407238522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/V740T%20Rain%20and%20thunder%20improving-26092-1-0.rar?fid=96129&ttl=1535797932&ri=8192&rs=8192&setec=cab8fd7dc7a609925fcbd57518d6e303"
    }
  ]
}