{
  "modId": 26228.0,
  "modName": "Realistic Needs and Diseases",
  "summary": "- Just another needs mod with some twists ;)",
  "descriptionHtml": "[url=http://www.skyrimgems.com][center][img]http://skyrimgems.com/images/badge_featured_sm.png[/img][/center][/url]\r<br />[center][img]http://static-2.nexusmods.com/15/mods/110/images/26228-1-1358516408.png[/img][/center]\r<br />[center][color=#6EC907]Logo by starfis, Thank you starfis&#33;[/color][/center]\r<br />I made this mod because all existing needs mods I found are either too complex or no longer maintained. I&#39;d rather not to get into calories, nutrition formulas etc.., I want a relatively simple needs mod that blends in with the game, but still enough functionality to be fun. I used TRO in my first play-through and like the concept, but it&#39;s abandoned, so I set out to emulate it and build my own, that&#39;s how this mod started. Many ideas were borrowed from Basic Needs, many indeed, so I feel proper credit must be given where it&#39;s due.\r<br />------------------------------\r<br />[color=#A9F5BC]Translations:[/color]\r<br />[url=http://skyrim.nexusmods.com/mods/31000]Brazilian Portuguese translation[/url] by Lanceras\r<br />[url=http://www.nexusmods.com/skyrim/mods/34676]Czech translation[/url] by wyruzzah\r<br />[url=http://www.confrerie-des-traducteurs.fr/forum/viewtopic.php?f=195&t=14307]French translation[/url] by Oaristys\r<br />[url=http://skyrim.nexusmods.com/mods/27182]German translation[/url] by CreatorX\r<br />[url=http://www.nexusmods.com/skyrim/mods/49060]German translation[/url] by mditsch\r<br />[url=http://www.nexusmods.com/skyrim/mods/49327]Italian translation[/url] by improbabile\r<br />[url=http://skyrim.2game.info/detail.php?id=26228]Japanese translation[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/30459]Polish translation[/url] by aragothestel\r<br />[url=http://www.nexusmods.com/skyrim/mods/50059]Spanish translation[/url] by criswolf09\r<br />------------------------------\r<br />\r<br />v.1.9.10\r<br />-this is just a repackaging of 1.9.9, fixed a few typos, that&#39;s all, even MCM says it&#39;s 1.9.9 ;)\r<br />-a merged esp, with 3 DLC patches merged into the main plugin, is available in Optional Files\r<br />-if you&#39;re already running 1.9.x, simply overwrite old files\r<br />\r<br />v1.9.9\r<br />-added &#34;Clean Cooking Menu&#34; option,\r<br />if enabled, recipes will only show up when you have at least one of the main ingredients in inventory\r<br />-fixed the spring water bottle, so the large bottle actually gives you 3 drinks\r<br />-added “Milk Drinker&#39;s Blessing” option , if enabled, dragonborn can milk cows\r<br />-added several new recipes, reduced the amount of spoiled food in barrels and sacks, \r<br />-can use hotkey (default B) to collect molds from spoiled junkpots, so you don&#39;t have to “E” it ;)\r<br />-tried to persuade some market vendors to sell vegetables\r<br />-added wells for hearthfire homes, the wells will fill your bottle/skins with spring water\r<br />-added recipes to smelt empty bottles into glass\r<br />-updated Pure Water patch to v4.6, W.A.T.E.R and Realistic Water Two both have RND compatible versions, so no longer need patches\r<br />-if you&#39;re already running 1.9.x, simply overwrite old files\r<br />\r<br />This version also includes an optional RND_AnimalLoot.esp, it adds wolf/bear/sabrecat/mammoth meat, with recipes, also increases the prices of pelts and tusks to make hunting more meaningful. Most animals like elks and bears will give you 4-6 cuts of meat, and mammoth up to 10. The idea is not to be overly realistic, but to be practical and simple in this case. This little esp is pure optional, and can be easily tes5edited as you see fit.\r<br />\r<br />To milk a cow, you need a milk bucket, just pick up any bucket and convert it at the tanning rack. Crouch, put your crosshair on a cow, then press E, it takes one hour in game to milk the cow. The base success rate is 50%. Bringing some straws to feed the cow will greatly increase your chance of success. Also, avoid visiting the cow at night, she won&#39;t like it.\r<br />\r<br />And one more thing, if you&#39;re tired of the beggar&#39;s stew, use console “set RND_IamNoBeggar to 1” to get rid of them.\r<br />\r<br />[color=#BEF781]-To Update, if updating from an earlier version, anything pre-1.8.5, please\r<br />1 use MCM menu or Sugar Ball to stop the mod, quit game, uninstall old version,\r<br />2 start game, double check your character is fine, save to a new slot, quit game\r<br />3 install new version; you will lose waterskins during the clean save, please use console to add them back.[/color]\r<br />\r<br />[url=http://static-2.nexusmods.com/15/mods/110/images/26228-1-1361341562.jpg][img]http://static-2.nexusmods.com/15/mods/110/images/thumbnails/26228-1-1361341562.jpg[/img][/url] | [url=http://static-2.nexusmods.com/15/mods/110/images/26228-4-1351593176.jpg][img]http://static-2.nexusmods.com/15/mods/110/images/thumbnails/26228-4-1351593176.jpg[/img][/url]\r<br />[color=#FE642E]To install: It&#39;s recommended using NMM or Wrye Bash to install this mod. To start the mod in game, open MCM menu, click &#34;Start RN&D&#34;, then exit the menu. You will receive needs effects (in active effects menu) and two powers, “Check Needs” and “Drink from Stream”, the first time you start the mod.\r<br />To uninstall, you must stop the mod, open MCM menu, click &#34;Stop RN&D&#34;, and make sure all needs and diseases effects are gone, before removing the files.[/color]\r<br />\r<br />[url=http://skse.silverlock.org]SKSE[/url] + [url=http://skyrim.nexusmods.com/mods/3863]SkyUI[/url] are highly recommended&#33; Some features are disabled if you don&#39;t have SKSE, also some configuration options are only available in MCM menu. The sugar ball (old configuration menu item) is no longer needed if you use SkyUI3, I&#39;ll maintain it as a backup option for now, and will probably remove it in future versions.\r<br />\r<br />[color=#ff8c00]Features:[/color]\r<br />\r<br />[i]This mod is compatible with vampire, werewolves and cannibalism. Vampires have no need for food or water, and werewolves/cannibals feeding will satisfy hunger and thirst.[/i]\r<br />\r<br />This mod works very well with [url=http://skyrim.nexusmods.com/mods/25029]Perseid&#39;s Inns and Taverns - Realistic Room Rental Enhanced[/url], they&#39;re made to work together after all. ;) Also, [color=#F3F781]skooma can come in handy sometimes, unless you&#39;re a perfect law-abiding citizen, it doesn&#39;t hurt to keep a few bottles in your backpack.[/color]\r<br />\r<br />[color=#6EC907]Progressive Diseases:[/color] Diseases are no longer easily ignored nonsense. Initial syndromes are still mild (as in vanilla), but without treatment, things get worse, much worse, over time. Find a cure as soon as possible&#33; But if you can&#39;t afford a cure, you can always rest and hope for the best, there is a chance your body will slowly fight off the disease by itself if you get enough rest. By rest, I mean a clean bed and warm fire, you&#39;re likely to catch more diseases sleeping in a dirty bandit camp&#33;\r<br />[color=#D0FA58]Disease Fatigue[/color], if enabled, you will get tired more quickly, also can&#39;t sleep well when diseased. Please check for disease effects first if your character suffers sleep disorder.\r<br />\r<br />[color=#6EC907]Check Needs:[/color]\r<br />[url=http://static-2.nexusmods.com/15/mods/110/images/26228-1-1352821155.jpg][img]http://static-2.nexusmods.com/15/mods/110/images/thumbnails/26228-1-1352821155.jpg[/img][/url]\r<br />When you start the mod, you will gain a “Check Needs” power, so you can bind it to a hotkey for quick checking. You can also enable debug mode to have it display needs points.\r<br />[color=#6EC907]Hotkeys:[/color] If you have SKSE, this mod also adds hotkeys for Check Needs &lt;default N&gt; and Drink from Stream&lt;default B&gt;, the drink key doubles as “empty” key, if you want to empty a bottle or waterskin without drinking its content, highlight the bottle/wine in inventory, then hit B; the keys are configurable in MCM.\r<br />\r<br />[color=#6EC907]Hunger has 6 stages:[/color]\r<br />Gluttony - I have eaten too much. Speed -30%.\r<br />Satiated - Health, stamina regeneration +10%.\r<br />Peckish - Ready for a snack. (no bonus or negative effect)\r<br />Hungry - Health, stamina regeneration -30%.\r<br />Very Hungry - Health, stamina regeneration -60%. Sneak is 25% harder. Attack damage -25%.\r<br />Starving - Health, stamina regeneration -90%. Carry Weight -50. Attack Damage -50%.\r<br />\r<br />Eating and drinking animations when you eat/drink.\r<br />[i]-Animations are disabled automatically while playing in first person view.[/i]\r<br />New and modified recipes, alternative texture for stews.\r<br />There is 15% chance eating raw food will catch diseases.\r<br />Stale/spoiled food not only tastes disgusting, but will also give you diseases.\r<br />Food items in barrels, sacks have been greatly reduced, and most of them you do find will be stale.\r<br />Some large food items like cheese wheels will provide several servings, you don&#39;t finish the whole thing in one bite.\r<br />\r<br />[color=#6EC907]Thirst has 5 stages:[/color]\r<br />Quenched - Magicka, stamina regeneration +10%.\r<br />Slightly Thirsty - Ready for a drink. (no bonus or negative effect)\r<br />Thirsty - Magicka, stamina regeneration -30%.\r<br />Very Thirsty - Magicka, stamina regeneration -60%. Time between shouts +25%. Spells 25% less effective.\r<br />Dehydrated - Magicka, stamina regeneration -90%. Time between shouts +50%. Spells 50% less effective.\r<br />\r<br />Drinking ale/mead or wine will give you empty bottle, any vanilla &#34;empty wine bottle&#34; you pick up will also be converted into reusable ones. \r<br />You can refill empty bottles and waterskins in any river (stand in water then click the bottle), or you can ask for clean water in inns and taverns.\r<br />Drinking river water directly can cause diseases, boil before drinking. Spring water (currently only available from drinking fountains) is safe to drink.\r<br />Herbal Tea will give you +10 speech for 300 seconds, milk is also available if you don&#39;t mind being a milk drinker.\r<br />If you have installed [url=http://skyrim.nexusmods.com/mods/24282]Drinking Fountains of Skyrim[/url], activate the fountain to refill all your empty bottles, or sneak-activate to drink directly from the fountains.\r<br />\r<br />[color=#D0FA58]For cooking[/color], you need to convert bottled water into plain “water” (flagon), I did this so I don&#39;t have to duplicate recipes for different types of water containers. Water conversion gives you empty bottles back. Many innkeepers now also stock everyday cooking ingredients, things like salt, garlic, honey, chicken eggs, elves ears, frost mirriam, etc.\r<br />[color=#D0FA58]Seawater:[/color] If you run out of salt, you can collect seawater using empty bottles along the coastline, boiling seawater gives you salt.\r<br />\r<br />[color=#ff8c00]Food Spoilage,[/color] if enabled, this mod will keep track of food items in player inventory, you can configure how long it takes for each type of food to spoil, you can also collect (25% chance) molds and rotten flesh from those spoiled junk, and use them in alchemy.\r<br />\r<br />[color=#6EC907]Inebriation has 5 stages:[/color] With visual and stumbling effects.\r<br />Sober - I&#39;m sober. (no bonus or negative effect)\r<br />Dizzy - Good stuff, just a bit dizzy. Unarmed Damage +5, Damage Resist +10.\r<br />Drunk - My head is spinning. Unarmed Damage +10, Speech -15, Magicka regeneration -15, Spells 50% less effective, duration -50%.\r<br />Wasted - I&#39;m completely wasted...Magicka and Stamina regeneration -25, Spells 85% less effective, duration -85%.\r<br />Blackout - Knocks you out right on the spot, only to wake up 4 hours later head spinning. \r<br />\r<br />[color=#6EC907]Sleep has 5 stages: [/color] \r<br />Well/Rested - Same as in vanilla\r<br />[i]-Werewolf will get a &#34;Restless Beast&#34; stage instead, just to keep it lore friendly.[/i]\r<br />Slightly tired - Ready for a nap. (no bonus or negative effect)\r<br />Tired - Carry Weight -30, Skills improve 25% slower.\r<br />Very tired - Carry Weight -60. Skills improve 50% slower. Speed -20%.\r<br />Exhausted - Carry Weight -90, Skills improve 75% slower. Speed -30%.\r<br />\r<br />You must sleep for enough hours to get fully rested. There is no need to sleep consecutive hours though, if you wake up still tired, you can simply go back and take another nap. The &#34;dirty bedroll&#34; disease chance is actually location based, not which bedroll you use. The name itself is a bit misleading. Because if the place is filthy you bedroll is doomed to get dirty once you throw it down on the floor. ;) Avoid locations like dungeons, bandit camps, animal dens etc., pick a clean spot and you will be fine.\r<br />\r<br />[color=#6EC907]Camping Gear: [/color]\r<br />This mod provides a set of basic camping gear, including tent, bedroll, tinderbox, and cooking pot. The camping equipments are craftable, also available for purchase from general merchants. The bedroll can be used standalone, or with a tent. To use, drop it on the floor, sneak-activate to unpack the bedroll. To pitch a tent with a bedroll, you must have both Traveller&#39;s Tent and Bedroll in inventory, then pitch the tent. Drop it, sneak-activate to pitch, a cot will be placed inside the tent automatically. To build a campfire, you must have at least 3 firewoods and a tinderbox. Drop the tinderbox, sneak-activate to build campfire. If you have a Cast Iron Pot in inventory, a cooking pot will be placed by the fire as well. Campfire lasts for 6 hours, you can activate the fire to add more firewoods, add/remove cooking pot, or sneak-activate it to put out the fire. If left unattended, campfire will burn out then remove itself after 24 hours.\r<br />\r<br />[color=#ff8c00]Configuration:[/color] You can configure Hunger/Thirst/Fatigue rate, disease chance and many other options in game, to better fit your timescale and play style.\r<br />\r<br />For whoever wants to do the math, here&#39;s the details: \r<br />Hunger: Gluttony(0) – Satiated(5) – Peckish(30) – Hungry(60) - Very Hungry (120) - Starving (240) (capped at 240)\r<br />Thirst: Quenched(0) - Slightly Thirsty(40) - Thirsty(80) - Very Thirsty(160) - Dehydrated(240) (capped at 240)\r<br />Sleep: Well/Rested(0) - Slightly tired(30) - Tired(60) - Very tired(120) – Exhausted(240) (capped at 240)\r<br />Take hunger for example, hunger rate 6 means 6 hunger points per game hour, so it takes about 10 hours to go from full to hungry; if you put it on 1, it means 1 hunger point per game hour, that&#39;s 24 points a game day, and will take you about 3 days to get hungry. The same applies to thirst and sleep. This mod doesn&#39;t rely on timescale, because I use in-game time in scripts, not real time. No matter what timescale you use, a game day is still 24 game hours. But timescale does affect player perception, how frequently you need to eat and such when you play the game.\r<br />\r<br />Inebriation: Sober(0) - Dizzy(30) - Drunk(60) - Wasted(90) - Blackout(150) (capped at 150)\r<br />You can adjust alcohol level for weak/normal/strong alcoholic beverages, the higher the value the quicker you get drunk. Take weak alcohol mead for example, the default is 10, which means, when you drink one bottle of mead, it increases your alcohol points by 10 (the actual number will vary slightly in game from bottle to bottle), when your alcohol points reach 30 (after about 3 meads), you get slightly tipsy, at 60 (after 6 meads) you get drunk. So if you lower the value from 10 to 5, you can drink approx. 12 meads before getting drunk.\r<br />\r<br />[color=#ff8c00]Compatibility & Patches:[/color]\r<br />Not compatible with same type needs/diseases mods of course.\r<br />[color=#D0FA58]You&#39;ll also need to load this mod after any other mods that modify vanilla food.[/color]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/11163]Frostfall[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/41076]Realistic Water Two[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/13268]WATER - Water And Terrain Enhancement Redux[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/10175]SkyTEST - Realistic Animals and Predators[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/9717]Better Vampires[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/9286]Skyrim Redone[/url], please load this mod after SkyRe\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/12452]Sands of Time[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/16553]Harvest Overhaul[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/33201]Hunterborn[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/20721]Nature of the beast II[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/16139]Fishing in Skyrim[/url]\r<br />\r<br />[color=#6EC907]Patches for following mods also available under Optional Files[/color]\r<br />[url=http://www.nexusmods.com/skyrim/mods/5816]Babettes Feast - Improved Cooking[/url] by Merilia\r<br />[url=http://www.nexusmods.com/skyrim/mods/26017]Destructible bottles Extended[/url] by lamer1000\r<br />[url=http://www.nexusmods.com/skyrim/mods/13608]Expanded Towns and Cities[/url] by missjennabee\r<br />[url=http://www.nexusmods.com/skyrim/mods/19281]Requiem - The Roleplaying Overhaul[/url] by Xarrian and Ogerboss\r<br />[url=http://www.nexusmods.com/skyrim/mods/19922]Unique Booze Bottles HD[/url]  by XRC\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/38519]Falskaar - Realistic Needs and Diseases Patch[/url] by Tom2681\r<br />[url=http://skyrim.nexusmods.com/mods/28591]Cooking Expanded - Realistic Needs and Diseases Compatibility Patch[/url] by born2bkilled\r<br />[url=http://skyrim.nexusmods.com/mods/29620]Improved Fish - Realistic Needs and Diseases Compatibility Patch[/url] by born2bkilled\r<br />[url=http://www.nexusmods.com/skyrim/mods/32847]Knapsack Enhanced[/url] by born2bkilled\r<br />[url=http://www.nexusmods.com/skyrim/mods/33253]Herbal Tea[/url] by Gustav Lundgren, RND Patch by Starfis\r<br />[url=http://www.nexusmods.com/skyrim/mods/38507]Collect water from wells - RND Compatible[/url] by Thicketford\r<br />\r<br />The bottles in screenshots are from [url=http://www.nexusmods.com/skyrim/mods/4260]Silly Level of Detail[/url], and the font is [url=http://www.nexusmods.com/skyrim/mods/2596]Kingthings Petrock font[/url] ;)\r<br />\r<br />[color=#ff8c00]Credits:[/color]\r<br />[url=http://skyrim.nexusmods.com/mods/13687]Sabre Gear Backpack[/url]\r<br />TreasureChest and DVAted are most generous to allow me use the waterskin from their backpacks, it&#39;s a shame to rip it off the pack, so in case you&#39;re not already using the backpacks, please download and endorse their wonderful work ;)\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/24282]Drinking Fountains of Skyrim[/url]\r<br />MannyGT has been very kind to allow me use the fountains. Please don&#39;t forget to endorse the fountains&#33; :)\r<br />\r<br />-----------------------\r<br />Changelog\r<br />\r<br />v.1.9.10\r<br />-this is just a repackaging of 1.9.9, fixed a few typos, that&#39;s all, even MCM says it&#39;s 1.9.9 ;)\r<br />-a merged esp, with 3 DLC patches merged into the main plugin, is available in Optional Files\r<br />-if you&#39;re already running 1.9.x, simply overwrite old files\r<br />\r<br />v1.9.9\r<br />-reverted to traditional modular format for max compatibility ;p\r<br />-added recipes to smelt empty bottles into glass\r<br />-carried forward all the features from 1.9.8\r<br />-if you&#39;re already running 1.9.x, simply overwrite old files\r<br />\r<br />v1.9.8\r<br />-Merged all 3 DLC patches into the main esp, \r<br />this means, this version requires all 3 DLCs, if you don&#39;t have them all, please use v1.9.5. \r<br />-added &#34;Clean Cooking Menu&#34; option, \r<br />if enabled, recipes will only show up when you have at least one of the main ingredients in inventory\r<br />-fixed the spring water bottle, so the large bottle actually gives you 3 drinks\r<br />-added “Milk Drinker&#39;s Blessing” option , if enabled, dragonborn can milk cows\r<br />-added several new recipes, reduced the amount of spoiled food in barrels and sacks, \r<br />-can use hotkey (default B) to collect molds from spoiled junkpots, so you don&#39;t have to “E” it ;)\r<br />-tried to persuade some market vendors to sell vegetables\r<br />-added wells for hearthfire homes, the wells will fill your bottle/skins with spring water\r<br />-updated Pure Water patch to v4.6, W.A.T.E.R and Realistic Water Two both have RND compatible versions, so no longer need patches\r<br />-if you&#39;re already running 1.9.x, simply overwrite old files\r<br />\r<br />v1.9.5\r<br />-make first person messages optional, so you can choose “I feel hungry” or “You feel hungry”\r<br />-added an option to hide Check Needs and Drink from Stream powers from powers menu\r<br />-added an option to disable Cure disease from shrines\r<br />-Bug Fix: fixed the bug player could contract disease even with 100% resistance\r<br />-general script update and some other minor changes\r<br />-if you&#39;re already running 1.9.x, simply overwrite old files \r<br />\r<br />v1.9.2\r<br />-Bug Fix: corrected ShoutRecoveryMult values in very thirsty/dehydrated stage\r<br />-reworked drunk blackout script, now the blackout doesn&#39;t happen immediately when your alcohol points hit 150, but randomly when you&#39;re totally wasted (alcohol points &gt;135), also you no longer lose blur vision when it happens\r<br />-minor changes to MCM menu, “Food Spoil in Days” string was hard coded in the script by mistake, it&#39;s fixed now\r<br />-if you&#39;re already running 1.9.x, simply overwrite old files\r<br />\r<br />v1.9.1\r<br />-Bug Fix: fixed hotkey “amnesia” bug -hopefully\r<br />-Bug Fix: fixed the bug hunger/thirst points not reset when player turned vampire\r<br />-added alternative set of drunk visual effects without using double vision \r<br />-added detection for Solstheim ocean to collect seawater\r<br />-stomach growl alarms nearby enemies\r<br />-this is a minor bug fix release, if you&#39;re already running 1.9, simply overwrite old files\r<br />\r<br />v1.9\r<br />-added hotkeys for check needs &lt;default N&gt; and drink from stream&lt;default B&gt;\r<br />the drink key doubles as “empty” key, if you want to empty a bottle or waterskin without drinking its content, highlight the bottle/wine in inventory, then hit B; the keys are configurable in MCM\r<br />-boiling seawater(salt recipe) now gives empty bottles back, but requires firewood\r<br />-Bug Fix: fixed the bug waterskins couldn&#39;t be refilled with seawater\r<br />-added optional food spoilage, this is a simple module that keeps track of food items in player inventory, you can configure how long it takes for each type of food to spoil, you can also collect(25% chance) molds and rotten flesh from those spoiled junk, and use them in alchemy.\r<br />-added salted meat, doesn&#39;t spoil, tastes very salty, increase thirst\r<br />-charred meat increases thirst level, removed cough effect\r<br />-flag all needs effects “No hit event” to avoid triggering brawl bug\r<br />-separate “river water” disease chance from “raw food”\r<br />-unarmed damage boost when drunk, and some other minor changes\r<br />-added a quick patch for dragonborn DLC\r<br />\r<br />v1.8.5\r<br />-Added a logo, designed by starfis&#33; Thank you :D\r<br />-Added seawater, now you can collect seawater using empty bottles, boiling seawater gives you salt\r<br />-Reworked drunk effects, also added configuration to adjust random tripping % chance\r<br />-Reworked disease script, also added an option to disable disease fatigue\r<br />-Bug Fix: fixed a bug where check needs indicates tired while active effects show well rested\r<br />-Added charred meat recipe, doesn&#39;t taste so good, but doesn&#39;t require salt or other ingredients to cook, great for lost souls in the woods\r<br />-Fixed keywords for some food items, also some innkeepers will now sell everyday cooking ingredients\r<br />-Changed the texture for rabbit stew, and several other minor changes and fixes\r<br />\r<br />v1.8.1\r<br />-added MCM menu, requires SkyUI3\r<br />-added a slider to adjust hungry/tired sound volume\r<br />-added a toggle to remove camping gear from crafting menus\r<br />-added a toggle to enable hunger/thirst/alcohol effects for vampire character\r<br />\r<br />v1.8\r<br />-added an option to force satiation first, so you don&#39;t go directly from hungry/peckish to gluttony by eating just one food item\r<br />-added an option to die of thirst after 48 hours of dehydration\r<br />-bug fix: fixed a minor bug inebriation points not going down to 0 while sober\r<br />\r<br />v1.7.2\r<br />-Bug Fix: Fixed a bug that could cause serious performance issue. \r<br />\r<br />v1.7.1\r<br />-Bug Fix: Fixed the broken “Slow Fatigue Rate by xx% during fast travel” option, which left a bunch of errors in Papyrus log.\r<br />\r<br />v1.7\r<br />-Added optional auto-reminder with sound notification\r<br />stomach growl when hungry, cough when thirsty, and yawn when sleepy\r<br />-Disable animation automatically while in first person view\r<br />-Bug fix: fixed innkeepers not refilling waterskins\r<br />-Bug Fix: fixed werewolf feeding not getting the gorging effect with dawnguard\r<br />-Bug fix: fixed resting had no effect on diseases\r<br />now resting in warm and clean beds (player houses and inns) will slowly remove disease effects,\r<br />it&#39;s not recommended though, you should always find a cure as soon as possible\r<br />-Bug Fix: corrected alcohol and water bottles weight\r<br />-Added guaranteed hangover remedy to cure stuck drunk problem\r<br />-Added a recipe to cook hearthfire milk jug into 2 milks\r<br />-Reworked the drinking fountains patch(now included in main package), crouch to drink directly from the fountains\r<br />\r<br />v1.6\r<br />-Added a power to drink directly from water source\r<br />-Added waterskin, craftable, also available for purchase from general traders\r<br />-Added an option to slow down fatigue rate during fast travel\r<br />-Cooking pots no longer consume water bottles, you get empty bottles back\r<br />-Bug Fix: fixed “spells xx% less effective” affecting enchanted equipments\r<br />-Reworked hearthfire patch\r<br />\r<br />v1.5\r<br />-Added a dialogue option to refill all bottles\r<br />-Make “check needs” power only, no more hand equip\r<br />-Convert all vanilla “empty wine bottles” you pick up into reusable ones\r<br />-More salt for sale, and more soups and stews in innkeepers inventories\r<br />-Added milk, rabbit stew, pheasant stew, mushroom soup and chicken soups\r<br />-Added normal maps for textures, that&#39;s why the sudden increase in mod file size\r<br />-Move sugar ball to food category, remove sugar ball recipe\r<br />-Bug Fix: fixed traveller&#39;s bedroll duplicate issue, adjusted cooking pot position\r<br />-Bug Fix: fixed quest related food items, Argonian Ale, Balmora Blue, Jessica&#39;s Wine, \r<br />Cyrodillic Brandy, Dragon&#39;s Breath Mead, Colovian Brandy, Stros M&#39;Kai Rum, Holy Water, Mammoth Snout\r<br />\r<br />v1.4\r<br />-Added a Check Needs power, so you can bind it to a hotkey for quick checking \r<br />you can also enable debug mode to have it display needs points\r<br />-Bug Fix: Fixed the Spells xx% less effective debuff affected potions\r<br />-Bug Fix: Fixed a few food items, Talen-Jei&#39;s special drinks, mead with juniper berry, butter, flour, \r<br />-Make all drinks decrease more thirst points\r<br />-Added an option to toggle drunk visual effects\r<br />-Added basic camping gear, including tent, bedroll, tinderbox, and cooking pot\r<br />\r<br />v1.3\r<br />-Added an option to adjust how quickly you get drunk\r<br />-Modified the sleep system, now it looks like this\r<br />Sleep: Well/Rested(0) - Slightly tired(30) - Tired(60) - Very tired(120) – Exhausted(240)\r<br />With fatigue rate set to 4, it takes about 16 hours from fully rested to tired again, and 3 days to complete exhaustion.\r<br />Also, werewolf will get a &#34;Restless Beast&#34; stage instead of Well/Rested, just to keep it lore friendly.\r<br />-Bug Fix: Fixed a minor bug where vampire sleep condition not initiated at start\r<br />-Bug Fix: Fixed the bug only mead/ale bottles play refill animation\r<br />-Resized all textures to avoid pixel bug \r<br />-Included patches for Pure Waters, HearthFires, \r<br />-To Update, please use sugar ball to stop the mod before loading new version.\r<br />\r<br />v1.2\r<br />-Reworked the sleeping part to avoid/minimize mod conflict, \r<br />should now be compatible with Sands of Time, let me know in case this is not the case lol\r<br />-Bug Fix: Fixed Bottle Refill animation stuck in first person issue, and added toggle\r<br />-Bug Fix: Fixed the innkeepers taking 3 bottles but refill only one\r<br />-Bug Fix: Fixed vampire handling, now this mod should correctly recognise vamps, food and drink should have no effect on vampires, but animation will play when player vampire eats something\r<br />-Bug Fix: Fixed the sticky drunken-hangover animation -hopefully, player movement should return to normal when sober\r<br />-Bug Fix: Fixed vampires and werewolves getting food diseases when eating raw/stale food\r<br />-Lower Rock Joint contact rate to 3% from 5%,\r<br />-Lower inebriation first stage tripping to 5% from 15%\r<br />-To Update, please use sugar ball to stop the mod before loading new version.\r<br />\r<br />v1.1 \r<br />-Bug Fix: fixed the sleep issue that low fatigue rate affected rest recovery\r<br />-Bug Fix: fixed the bug werewolves got Gluttony while feeding in wolf form\r<br />-Rework the menu to include disease chance configuration and animation toggle\r<br />-To update, please stop the mod using sugar ball before loading new version\r<br />\r<br />v1.0 initial release",
  "categoryId": "78",
  "version": "1.9.10",
  "author": "perseid9",
  "createdUnix": "1351592615",
  "updatedUnix": "1390629931",
  "containsAdultContent": false,
  "uploadedBy": "perseid9",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000088733",
      "name": "RND_FAMP2",
      "version": "0.2",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "7",
      "fileName": "RND_FAMP2-26228-0-2.7z",
      "uploadedUnix": "1388263484",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/0a85731d9caa1ce762b7afaf405787f20f68d1eca9fdef42df6a1eaf36c09b34/analysis/1407862517/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RND_FAMP2-26228-0-2.7z?fid=1000088733&ttl=1535798137&ri=8192&rs=8192&setec=faa04b43b082adaf45ef9e7ad2bec471"
    },
    {
      "fileId": "1000088834",
      "name": "RealisticNeedsandDiseases",
      "version": "1.9.10",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4952",
      "fileName": "RealisticNeedsandDiseases-26228-1-9-10.7z",
      "uploadedUnix": "1388326810",
      "modVersion": "1.9.10",
      "virusScanUrl": "https://www.virustotal.com/file/b554754c71631899981e2bc61018602c9dda22ef7989034bd4e21089061898e3/analysis/1407863489/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RealisticNeedsandDiseases-26228-1-9-10.7z?fid=1000088834&ttl=1535798138&ri=8192&rs=8192&setec=f7a457fc9e27a4013cc652b45a2758ff"
    },
    {
      "fileId": "1000089041",
      "name": "RND_USKP-Patch",
      "version": "1.9.10",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "1",
      "fileName": "RND_USKP-Patch-26228-1-9-10.7z",
      "uploadedUnix": "1388430109",
      "modVersion": "1.9.10",
      "virusScanUrl": "https://www.virustotal.com/file/36420c9a0a5752b44b9f4b810db78228c544e677ef572646f4d286755ac21690/analysis/1407865097/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RND_USKP-Patch-26228-1-9-10.7z?fid=1000089041&ttl=1535798138&ri=8192&rs=8192&setec=3a229e6ccc33fb031125bc1fb1b5b7bb"
    },
    {
      "fileId": "1000089058",
      "name": "RND merged esp 2",
      "version": "1.9.10",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "62",
      "fileName": "RND merged esp 2-26228-1-9-10.7z",
      "uploadedUnix": "1388434422",
      "modVersion": "1.9.10",
      "virusScanUrl": "https://www.virustotal.com/file/6d3d94b8d82bbe214a7d00c083e23675e04772fa313f01f6c7a2b5fdf1f635b5/analysis/1407865176/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RND%20merged%20esp%202-26228-1-9-10.7z?fid=1000089058&ttl=1535798139&ri=8192&rs=8192&setec=7062a2c9977b083385317ace45445c2d"
    },
    {
      "fileId": "1000093252",
      "name": "RND_PatchPack",
      "version": "2.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "19",
      "fileName": "RND_PatchPack-26228-2-1.7z",
      "uploadedUnix": "1390629931",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/51f6ff67fa25ca7da87379ef135f9b79f7f4e2398c3c868561434f3977610553/analysis/1407900795/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RND_PatchPack-26228-2-1.7z?fid=1000093252&ttl=1535798139&ri=8192&rs=8192&setec=ec09735097247dc57a74ab94853630ae"
    }
  ]
}