{
  "modId": 26224.0,
  "modName": "Plant Yellow Mountain Flowers",
  "summary": "Hearthfire allows you to cultivate plants at your custom home, however there are certain plants that are not allowed to be planted. The Yellow Mountain Flower, probably because it is a Dawnguard plant, is one of these plants. This mod changes that, and that is all it does. ",
  "descriptionHtml": "Hearthfire allows you to cultivate plants at your custom home, however there are certain plants that are not allowed to be planted. The Yellow Mountain Flower, probably because it is a Dawnguard plant, is one of these plants. This mod changes that, and that is all it does. You still only get one from each plant, and it takes three days to produce another.\r\n\r\nRequires:\r\n\r\nDawnguard\r\nHearthfire\r\n\r\nNotes:\r\n\r\nThis does not seems to affect yellow mountain flowers that you may have already planted, if you\\'ve been attempting to fix this yourself. If you happen to have planted one, for this mod to affect it you\\'ll need to clear it out of the planter and plant another one.\r\n\r\nOnce you plant one, you must (in any order): wait 24 hours, leave the area (or enter your house). After doing both of those things, return and your plant should be there.\r\n\r\n**I have also made this mod available from the Steam Workshop**",
  "categoryId": "95",
  "version": "1.0",
  "author": "someshta",
  "createdUnix": "1351578669",
  "updatedUnix": "1351579153",
  "containsAdultContent": false,
  "uploadedBy": "someshta",
  "primaryFile": null,
  "files": [
    {
      "fileId": "96629",
      "name": "Yellow Mountain Flower ESP",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Yellow Mountain Flower ESP-26224-1-0.zip",
      "uploadedUnix": "1351579153",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b29d466015394994780128cea81ed015861804797e32fb0861eba42cfde2eaeb/analysis/1407241743/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Yellow%20Mountain%20Flower%20ESP-26224-1-0.zip?fid=96629&ttl=1535798131&ri=8192&rs=8192&setec=9b4d52842439b46722996c40d30a484b"
    }
  ]
}