{
  "modId": 26238.0,
  "modName": "Wooded Oak",
  "summary": "adds a Hand crafted alternative to Gleaming Falls",
  "descriptionHtml": "Welcome to Wooded Oak!.\r\n[youtube]qaw0a4llLjg[/youtube] \r\n\r\n===Description===\r\n\r\nThis mod was intended as a alternative to my Gleaming falls mod, but with a different style in mind. The style i went with was a rustic wooded look rather then a colourful green spaced layout. \r\n\r\nThe area i have created has been hand crafted into the area i have chosen and i have spent a great deal of time trying to get everything fitted together so that it would make a easy lore friendly place thats nice to walk around. i have taken the liberty to add two fetch mini quests to the mod so it gives the player a chance to earn the home instead of unlocking it immediately. \r\n\r\nthe previous owner of the household was a hated oblivion npc, to which i think when you peeps find it will be quiet amusing.\r\n\r\nI do hope you enjoy this creation i have made and any requests asked of me for the mod will be implemented by my promise of support as all my mods have, and will consider other more bizzarr requests also if i think it will fit into the mod itself.\r\n\r\n===features===\r\n-Non respawning storage guaranteed, checked and polished to perfection. \r\n-Lore friendly, No mannuquins. This mod was intended as a adventurer household not a storage area.\r\n-Secret chests and hidden easter eggs await with a mention of a certain oblivion character.\r\n-Hand crafted landscape with each peice of rocks/flora and objects hand placed into the area.\r\n-Waterfall resting area for your comfort.\r\n-Insects inhabit the area giving a peacful feeling\r\n-All the neccesery crafting components include:\r\n+Blacksmithing\r\n+alchemy\r\n+enchanting\r\n+cooking\r\n+chopping wood\r\n+tanning rack\r\nAll placed around the area to give a purpose to walk about.\r\n\r\n-gates are key locked and must find the previous owner to obtain the key. this stops dumb people or low level people from getting the secret treasure first.\r\n-tockade mix and wooden towers inhabit the area to give great views\r\n-Plenty of chest/barrels/sacks to store all your misc items and maybe more important things.\r\n\r\n===Updates====\r\nV1.0 Release\r\nV1.1 \r\n=Fixed tent not being enterable\r\nV1.2\r\n=added entrance by waterfall for upcoming smelter cave\r\n=Redesigned waterfall\r\n=Made skeleton with key more easy to find\r\n=Made first note easy to find\r\n\r\nThanks.   PLEASE RATE AND SUBSCRIBE!, IT ONLY TAKES A SECOND.",
  "categoryId": "67",
  "version": "V1.2",
  "author": "Countercruel",
  "createdUnix": "1351609794",
  "updatedUnix": "1351713843",
  "containsAdultContent": false,
  "uploadedBy": "countercruel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "96877",
      "name": "Wooded Oak",
      "version": "V1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "119",
      "fileName": "Wooded Oak-26238-V1-2.rar",
      "uploadedUnix": "1351713843",
      "modVersion": "V1.2",
      "virusScanUrl": "https://www.virustotal.com/file/571e1b86661c08c55feecffeb754a9823455454a5b5332c99428de558c63ec2f/analysis/1407243851/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wooded%20Oak-26238-V1-2.rar?fid=96877&ttl=1535798172&ri=8192&rs=8192&setec=52a9154847fb2a447f16e1183dd5a661"
    }
  ]
}