{
  "modId": 26258.0,
  "modName": "Better Shrouded Armor and Fix",
  "summary": "I just want to start by saying i am not the creater of Better Shrouded Armor or the Fix Mods.\r\nAll this mod does is add the female gauntlets fix and the 1st person female and male gauntlets and armor fix. You also dont need the original mod just hit the nexus mod download button and when its done install.",
  "descriptionHtml": "Why I Made This Mod\r\nI just want to start by saying i am not the  creater of Better Shrouded Armor or the Fix Mods.\r\nThis is an awsome mod, great job to the original creater and to the creaters of the Fix Mods.\r\nNow then, i didnt get permision to do this (but the site does say that you can upload fixes) and if the creater wants to take this off and add this to his site hes more than welcome. When i downloaded this mod the female gauntlets and the first person armor and gauntlets didnt work.  There are several mods that fixes this issue i know but you have to go here and get this one and go there to get that one, then you have extra mods to keep up with, it becomes a hassle. This mod fixes this issue by making a all in one download. \r\nThis also alters the ancient db armor as well.\r\nYou do not need the original mod this has everything.\r\n\r\nAbout What This Mod Does\r\nThe original creator made a male and female replacer for the db armor. The link to the original is \r\nhttp://skyrim.nexusmods.com/mods/12015 (Also a link in the Mirrors Section)\r\nHalf Dead did a awesome job on the 3rd person armor and when he made it for the female he left out the female gauntlets. The 1st person meshes for the male and female were not there at all. \r\nAll this mod does is add the female gauntlets fix and the 1st person female and male gauntlets and armor fix. They didnt change anything. They copy and pasted and added _f to the gauntlets and added 1stperson to the rest that needed it so the 1stperson and 3rdperson are the same. And no fancey esp either. You also dont need the original mod just hit the Nexus Mod Manager download button and when its done install. Or click download manually and install the witcher folder in your textures folder (not the texture armor folder) and the dbarmor folder in your meshes armor folder (or if you dont have a meshes armor folder move the armor folder this comes in over to meshes). You can still use a armor pack that alters the armor in the game just delete the meshes/armor/dbarmor folder, then install this mod.\r\n\r\nIssues\r\nAlso there is a clipping issue with the Khajiit ears. They poke through the hood if anyone knows how to fix this there more than welcome to try. This mod will conflict with any mod that changes dbarmor.\r\n\r\nEndorsements and Credit\r\nI take none of the endorsements and credit for this Mod.\r\n\r\nAll Endorsements and Credit Goes To\r\nHalf Dead for the Original Mod\r\nCreasta for the Female Gloves Fix Mod\r\nSpliffz/Dave_Rayner87 for the First Person Fix Mod\r\nScepth for the Quick Fix Mod\r\nThank You All For This Awesome Mod\r\nIf You Think This Is A Awesome Mod As Well Please Endorse\r\n\r\nOther Mods That Change or Adds Armor\r\nhttp://skyrim.nexusmods.com/mods/12450 (Also a link in the Mirrors Section)\r\nThis is Deacons Dark Brotherhood Pack. Its a very nice mod and u get the listeners armor at the end, in your room at the dawnstar sanctuary. It has some nice enchantments, like resist magic, increased one handed weapon damage, increased bow damage and alot more. Each piece of the listeners armor has 3 enchantments and you get some nice swords, a bow and some daggers. Its all very nice stuff except the bow and daggers are hard to keep charged, but the swords stay charge. I dont use the weapons personaly but the armor is awesome. The picture thats different from the rest is the listeners armor. You cant see it but the eyes do glow red.\r\n                                   \r\n                                                       !!!!All Hail Sithis!!!!\r\n                                                   !!!!All Hail The Listener!!!!\r\n\r\nAlso there is this\r\nhttp://skyrim.nexusmods.com/mods/16474 (Also a link in the Mirrors Section)\r\nThis is Deadly Dragons Armory. Its goes with, but doesnt need, Deadly Dragons. Has some realy nice armor you can craft. You have to craft the armor from the smelter first, then make the enchanted armor at the forge with the right materials. The end results are awesome. Also it has different sets, cloth, light and heavy armors. There are like 2 or 3 sets for each.",
  "categoryId": "54",
  "version": "1",
  "author": "Half Dead",
  "createdUnix": "1351636159",
  "updatedUnix": "1351636349",
  "containsAdultContent": false,
  "uploadedBy": "drew073086",
  "primaryFile": null,
  "files": [
    {
      "fileId": "96732",
      "name": "Better Shrouded Armor and Fix",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5478",
      "fileName": "Better Shrouded Armor Fix-26258-1.7z",
      "uploadedUnix": "1351636349",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/31add207cbe87b08b41ff3880b9a6690185611e5976f75b0962b1cdd0725b0e2/analysis/1407242886/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Shrouded%20Armor%20Fix-26258-1.7z?fid=96732&ttl=1535798197&ri=8192&rs=8192&setec=00fda35bc0f50f82c3a74f7f19e187e1"
    }
  ]
}