{
  "modId": 26267.0,
  "modName": "House Of Dracula - A Quest Mod",
  "summary": "A Halloween quest mod featuring the classic monsters of the Universal films. ",
  "descriptionHtml": "The Wulff Pack Presents:\r\n\r\n[img]http://skyrim.nexusmods.com/mods/images/26267-1-1351891922.jpg[/img]\r\n\r\n~Story~\r\nCount Dracula has risen from his grave once more and is gathering the creatures of the night for a siege on Skyrim. Travel to his castle and put the ancient vampire back in his grave once and for all. \r\n\r\nIncludes a new Haunted Castle-style dungeon to explore.\r\n\r\nTO START: Go to the castle south of Dragonbridge. You\\'ll find a note from Professor Von Helsing there. \r\n\r\nRemember, if you like, endorse!\r\n\r\n~Requirements:\r\nDawnguard\r\nTurn on the subtitles\r\n\r\n~Recommended:\r\nHigher level players\r\nSome kind of realistic lighting mod (may look silly without)\r\n\r\n~FAQ~\r\nPlease read this is you have questions before posting in the comments! We won\\'t respond if the answer is already here!\r\n\r\nQ: Crashing!\r\nA: Try uninstalling some other mods that might conflict. If that doesn\\'t solve the problem, leave us a comment or send us a message detailing what happened. We\\'ll try our best to fix it. But if it\\'s an engine conflict, there\\'s not much we can do about that. :(\r\n\r\nQ: Can we have screenshots of the bosses?\r\nA: What, and spoil all the fun?\r\n\r\nQ: What do we do with Lawrance Talbot? Is he supposed to be in the cage?\r\nA: Yes, he should be in his cage, but he might spawn outside of it for whatever reason. Hopefully we can get that fixed in future updates. \r\n\r\nQ: The Twilight Zone door isn\\'t working!\r\nA: Why do you want to go in there, huh?\r\n\r\nQ: It\\'s not showing up as a quest. \r\nA: It\\'s not supposed to. We don\\'t care much for the \\'hold your hand\\' quest system Skyrim sports, so we make most of our quests unofficial. Also, making it an official quest requires scripting and we\\'re not good with that. Yet. \r\n\r\nQ: The bedroom doors won\\'t open! I have to tcl through them to get in!\r\nA: There are levers you\\'re supposed to pull to open them. We thought that would be better than having a million keys laying around cluttering up your inventory. \r\n\r\nQ: Why is there no music?\r\nA: We feel that sometimes music only distracts from the environment. In this case, we thought that the silence and the sound of your own footsteps was much better ambiance.\r\n\r\nQ: There\\'s a problem with Dracula...\r\nA: Dracula has given us lots of issues with his script. We\\'ll try to fix him in future updates. \r\n\r\nQ: Do you have any future plans for this mod?\r\nA: Definitely. This mod was made in the time span of two and a half weeks, so we didn\\'t get the put in as much as we wanted to, mostly due to scripting problems. But we certainly have plans for Castle Dracula. \r\n\r\n~Version History~\r\n1.0 - Release version\r\n\r\n~Planned Updates~\r\nGeneral optimization and additional/modified content",
  "categoryId": "35",
  "version": "1.0",
  "author": "The Wulff Pack",
  "createdUnix": "1351652314",
  "updatedUnix": "1351652702",
  "containsAdultContent": false,
  "uploadedBy": "DarthWulff",
  "primaryFile": null,
  "files": [
    {
      "fileId": "96780",
      "name": "House Of Dracula",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "413",
      "fileName": "House Of Dracula-26267-1-0.rar",
      "uploadedUnix": "1351652702",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d1bc32d7e08b60f396fc2138dc04299e527e481b6aaf9f9e16291c74298dd8e3/analysis/1407243182/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/House%20Of%20Dracula-26267-1-0.rar?fid=96780&ttl=1535798222&ri=8192&rs=8192&setec=2e42d2ae041311e1c9669caf406d73c6"
    }
  ]
}