{
  "modId": 26263.0,
  "modName": "NinasMessages",
  "summary": "WATCH - REMEMBER - FIND",
  "descriptionHtml": "This simple mod looks like the Treasure Map mini quests in origin Skyrim, but this use screenshot pictures instead simple maps. If you walked in land of Skyrim with opened eyes, can find the messages which are placed in specified locations.\r\nThese mini quests are in 5 difficulty levels with different count of steps. Every step contains one place that can be found by help of four pictures. If you find the place you will be rewarded by some coins and an excerpt (or one piece of an excerpt) from a famous person.\r\n\r\nInstallation:\r\nJust install the NinasMessages as usual (just copy the data folder into your Skyrim folder, i think this will not overwrite nothing).\r\nOption: The optional downloadable packs contains the pictures of the messages in original size. (You maybe need this if you cant identify a place beecause the pictures in the messages are too little.) These packs are not mod, just picture and you can only watch in a viewer software. Don\\'t install!\r\n\r\nPlay:\r\nYou will find a strong box in Whiterun at base of the Talos monument near the great tree in main palace. This contains the letters what starts the quests. The quests - of course - not include map sign! Just follow the instructions what you find in the message books. I think you can complete the missions only if you were already at the targeted place or identify by the flora, surface and objects. The difficulty 1-3 can be found by a rookie Skyrim-explorer and the 4-5 only by an advenced (i think above 20 level) adventurer.\r\n\r\n\r\nThanks:\r\nBethesda - above all\r\nAll modders who can help me to create my own Skyrim land (listed in my profile)\r\nAll the people who aren\\'t lazy to write tutorials and how-can-do on Web.\r\nThe testers: NestatheRedRiver, Raziel (Templar84) and lovelygod69 after-release-tester\r\n\r\nKNOWN ISSUES:\r\nThe role of these quests is you remember the explored places and find it by your memory. However YOU can identify a place BUT the character with who you currently play DON\\'T. Because some place are hidden and explorable only by another quest. Here is a list of the required completed quests from the main skyrim files.\r\nRequired completed quests: THE BLACK STAR - Deadric quest of Azura; SCOUNDREL\\'S FOLLY - a Thieves guild quest",
  "categoryId": "35",
  "version": "v1",
  "author": "GeeTheKing",
  "createdUnix": "1351645685",
  "updatedUnix": "1351646522",
  "containsAdultContent": false,
  "uploadedBy": "GeeTheKing",
  "primaryFile": null,
  "files": [
    {
      "fileId": "96760",
      "name": "NinasMessages",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12002",
      "fileName": "NinasMessages-26263-v1.rar",
      "uploadedUnix": "1351645898",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/7b5f336957bdf66fc11875aec0cad5fb4706b4ef0528148c130b7d49ad8d1da8/analysis/1407243010/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NinasMessages-26263-v1.rar?fid=96760&ttl=1535798211&ri=8192&rs=8192&setec=08cebad3d7d667e659559417b179fa0b"
    },
    {
      "fileId": "96770",
      "name": "Pictures",
      "version": "v1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "47697",
      "fileName": "Pictures-26263-v1.rar",
      "uploadedUnix": "1351646522",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/8dd4b8fb146b7c4f477ff400f8b74edfa25f4df9347fb9daa94a51c3551253ca/analysis/1407243076/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pictures-26263-v1.rar?fid=96770&ttl=1535798211&ri=8192&rs=8192&setec=493227c09e24aa50ec1366e4219c0ae8"
    }
  ]
}