{
  "modId": 26289.0,
  "modName": "Lakeview Flats for Tundra Defense",
  "summary": "Flattens a sizable area to assist in building the tundra defense outpost.",
  "descriptionHtml": "Hearthfire is a lot of fun (Required)\r\n\r\nTundra Defense (http://www.skyrim.nexusmods.com/mods/22330) is an amazing mod. Its just difficult to place the buildings sometimes.\r\n\r\nSo why not combine the two and make a place specially designed to put the TD buildings while overlooking your work from your Hearthfire home of Lakeview?\r\n\r\nAt the Lakeview home, I\\'ve flattened out an area, built some towers and walls for use with the TD guards and navmeshed the whole thing with preferred routes along the roads.\r\n\r\nNear the center, you\\'ll see a tiny well, that\\'s the center of the flattened area and is the best place to put the TD well. At four locations, outside the main gates (the ones with roads leading to them) you\\'ll find kettles that has no business being there. That is the approximate furthest location for the TD perimeter markers.\r\n\r\nBe sure you have the latest SKSE http://skse.silverlock.org/ and your game is the latest version (1.8 as of today)\r\n\r\nIf you have another mod that tinkers with the exterior of the Lakeview mansion, it might not be happy playing together with this mod. \r\n\r\nI\\'ve done all I can for the patrol and perimeter guards. They work, sometimes. But I drug a follower all over the area and had no problem with stairs or anything. Until I get that \\'aha\\' moment, it\\'s going to have to be good enough. If it frustrates you too much, just use stationary guards.\r\n\r\nIf you have a previous version, you might need to go inside and save, then quit, then disable this mod (and maybe tundra defense), load your game, wait for five days (per tundra defense), then save, then reload both mods.",
  "categoryId": "24",
  "version": "1.0",
  "author": "Wild Bill",
  "createdUnix": "1351708503",
  "updatedUnix": "1352846047",
  "containsAdultContent": false,
  "uploadedBy": "whpsh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "99335",
      "name": "Lakeview Flats Main",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "501",
      "fileName": "Lakeview Flats Main-26289-1-0.zip",
      "uploadedUnix": "1352846047",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ad2fe70ca29ddf7697731ccd19541396ce3db4cbe1c0542ce19a53a0cd52d1b0/analysis/1407262158/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lakeview%20Flats%20Main-26289-1-0.zip?fid=99335&ttl=1535798261&ri=8192&rs=8192&setec=cd9d9fd4ca2393a227e52ebf558bae16"
    }
  ]
}