{
  "modId": 26291.0,
  "modName": "AFC - Accommodations for Companions - Camp Serpent - Lager Serpent - English and German",
  "summary": "GERMAN\r\n\r\nAFC (Accommodations for Companions) setzt sich zum Ziel, Behausungen und Unterkünfte für Begleiter in die Welt von Skyrim einzufügen. Viele Beklagen sich, dass sie kaum Platz haben, ihre Begleiter unterzubringen. Nun, das ändert sich mit AFC. \r\n\r\nDiese Behausungen und Unterkünfte sind nur für Begleiter geeignet, natürlich kann man ",
  "descriptionHtml": "GERMAN\r\n\r\nAFC (Accommodations for Companions) setzt sich zum Ziel, Behausungen und Unterkünfte für Begleiter in die Welt von Skyrim einzufügen. Viele Beklagen sich, dass sie kaum Platz haben, ihre Begleiter unterzubringen. Nun, das ändert sich mit AFC. \r\n\r\nDiese Behausungen und Unterkünfte sind nur für Begleiter geeignet, natürlich kann man sich dort auch selbst aufhalten, nur findet man dort das Allernötigste. Was für alle Begleiter ausreichen zu scheinen ist.\r\n\r\nDesweiteren könnt Ihr auch in diesen Behausungen und Unterkünfte eure Pferde, bzw, die Pferde eurer Begleiter \\\"Parken\\\". Auch wurde daran gedacht, dass Ihr eure Kutschen auch noch unterbringen könnt. Viel Platz ist aufjedenfall vorhanden, um eure Begleiter unterzubringen.\r\n\r\nLager Serpent\r\n\r\nDas Lager Serpent besteht aus vielen kleineren Zelten, sowie einem Werkstattzelt, ein Gemeinschaftszelt und einem Versorgungszelt. In der Mitte des Lagers ist eine Feuerstelle eingerichtet, an dem eure Begleiter Ihr Tagemahl zubereiten können. Das Lager wird von einer hohen stabilen Holzmauer gesichert.\r\nDer Eingang wird daher auch durch ein stabiles Holztor gesichert. Das Tor ist gerade groß Genung, um eure Kutsche hindurch zufahren. Ihr findet das Lager südlich vom Westlichen Wachtrum Weißlaufs. \r\n\r\nNun viel Spaß mit eurem neuem Lager für eure Begleiter :)\r\n\r\nENGLISH\r\n\r\nAFC\\'s goal, houses and accommodation for attendants in\r\nThe world of Skyrim insert. Many complain that they have little room to accommodate their attendants. Well, that changes with AFC.\r\n\r\nThese dwellings and accommodations are only suitable for companion, of course you can also stay there yourself, only one finds only the bare necessities. What seem to be sufficient for all companion. Furthermore, your can in these dwellings and accommodations your horses, or the horses euerer companion \\\"Parking\\\". It was also thought that you put your coaches still can. Plenty of space is available repays to accommodate your companions.\r\n\r\nCamp Serpent\r\n\r\nThe camp Serpent consists of many smaller tents, and a workshop tent, a tent community and a supply tent. In the middle of the camp is set up a fire pit, where your companions can prepare your food. The camp is secured by a high solid wooden wall. The input is therefore secured by a sturdy wooden door. The door is big enough to drive through your coach. You can find the warehouse south of the western watchtower Whiteruns.\r\n\r\nHave fun with your new storage for your companions.",
  "categoryId": "66",
  "version": "1.0",
  "author": "ChrisDiCesare aka Assassinehdr95",
  "createdUnix": "1351715022",
  "updatedUnix": "1351715114",
  "containsAdultContent": false,
  "uploadedBy": "Assassine hdr95",
  "primaryFile": null,
  "files": [
    {
      "fileId": "96881",
      "name": "AFC_Camp_Serpent_EV",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "AFC_Camp_Serpent_EV-26291-1-0.rar",
      "uploadedUnix": "1351715071",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8ec702eefcdd0c8b2b85a74930a638930c156291d7d3fe484fe6522e829f899b/analysis/1407243926/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AFC_Camp_Serpent_EV-26291-1-0.rar?fid=96881&ttl=1535798266&ri=8192&rs=8192&setec=9d7beec263056e4e5cf10ff10213c476"
    },
    {
      "fileId": "96882",
      "name": "AFC_Lager_Serpent_DV",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "AFC_Lager_Serpent_DV-26291-1-0.rar",
      "uploadedUnix": "1351715114",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/33d322f865ad10c5892691b81c691e7a83cc6580f18eda92cb535425867ecebf/analysis/1407243962/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AFC_Lager_Serpent_DV-26291-1-0.rar?fid=96882&ttl=1535798267&ri=8192&rs=8192&setec=db1ad2fe8baee941ba31f597d5a240c0"
    }
  ]
}