{
  "modId": 26306.0,
  "modName": "RT Immersive Junk",
  "summary": "Adds miscellaneous junk (and if you are lucky something useful) to barrels. And remains like bonemeal and ectoplasm to coffins and urns.",
  "descriptionHtml": "What does it do?\r\n-Adds junk and other miscellaneous items to barrels and sacks, and if you are really lucky, something of worth accidentally thrown away by the careless folk of Skyrim\r\n-Adds remains to burial urns and coffins, like bonemeal and ectoplasm.\r\n-Barrels and sacks are either junk or food the people of Skyrim don\\'t keep their apples where they keep their inkwells.\r\n\r\nWhy did I make it?\r\nAs a long time player of Morrowind and Oblivion I found it rather odd when I came to Skyrim only to find that barrels contained only fresh produce, and burial urns and coffins never ever contained the remains of the dead.\r\n\r\nQuite simply it was immersion breaking for me.\r\n\r\nSo I decided to plug that leak in the immersion barrier by creating a mod that made me think that people used barrels and sacks for more than just produce and actually buried their dead in the appropriate vessels.\r\n\r\nUpcoming:\r\n-Hearth fire version, now you might be able to find a nail or two and a hinge here and there maybe some other stuff too.\r\n-an exceedingly low chance (2% ish) for the dead to get angry with you for defiling their remains, causing them to reach into this world as a ghost!\r\n-ectoplasm to be moved from the urns to only being acquired by killing vengeful spirits as above.\r\n-adding a chance to find rag clothing or a very small chance to find basic clothes in coffins. you filthy grave robbers!\r\n-add a random chance to find food items like soups and cooked leaks and such to all the empty cooking pots over fires in Skyrim\r\n\r\nSuggestions:\r\nI am all ears to suggestions and would love to hear about what other small things I can improve with containers here and there\r\n\r\nCurrent issues:\r\nThe kitchens of skyrim now have junk in their barrels and sacks. Minor, but bothers me, yet I don\\'t want to go through and edit specific containers.\r\n\r\nNotes:\r\nPlease remember to endorse RT Immersive Junk if you liked it, I would love too see it picked up by Skyrim G.E.Ms \r\n",
  "categoryId": "78",
  "version": "1.0",
  "author": "Rorax",
  "createdUnix": "1351756003",
  "updatedUnix": "1351804950",
  "containsAdultContent": false,
  "uploadedBy": "Rorax",
  "primaryFile": null,
  "files": [
    {
      "fileId": "96954",
      "name": "RTJunkrc1",
      "version": "1.0rc1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "RTJunk-26306-1-0rc1.7z",
      "uploadedUnix": "1351756448",
      "modVersion": "1.0rc1",
      "virusScanUrl": "https://www.virustotal.com/file/1c376dfa1a839a8adbf34e533cdbcb20bb1c12a633f45170bfc1c0558cb5d0e7/analysis/1407244513/",
      "changelogHtml": " The first release for the mod. Will not be moved to 1.0 until all possible bugs are worked out as it stands. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RTJunk-26306-1-0rc1.7z?fid=96954&ttl=1535798285&ri=8192&rs=8192&setec=5fb79c150105c0f53d7d1d469f93f2d4"
    },
    {
      "fileId": "97047",
      "name": "RTJunk",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "RTJunk-26306-1-0.7z",
      "uploadedUnix": "1351804950",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/19cc4c13e6a46e901fcf75050ca2df0f33e4c78b0ea476492cc2ca5acbba6ae2/analysis/1407245492/",
      "changelogHtml": " Barrels and sacks are now either junk barrels or food barrels. you will no longer find food and junk togeather in the same barrel or sack. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RTJunk-26306-1-0.7z?fid=97047&ttl=1535798286&ri=8192&rs=8192&setec=b9ed610696762a906d63e7a4170210f7"
    }
  ]
}