{
  "modId": 26332.0,
  "modName": "Wrath of Potema - Wolfqueens Hunger",
  "summary": "Adds a new weapon to the game, Wolfqueen\\'s hunger. Standalone.",
  "descriptionHtml": "[youtube]jjyF_T59Bnw[/youtube] [youtube]5u_t4yV5Y2Y[/youtube]\r\nVideo on left by Hodilton, many thanks! Sword showcase starts from 1:11 onwards.\r\nVideo on right by Brodual, many thanks also!\r\n\r\n\r\n=================================================\r\nWrath of Potema - Wolfqueen\\'s Hunger, V 1.0 \r\n=================================================\r\n\r\nBy MTindle, SikSikSikki and Millenia\r\n\r\n\r\n******* BACKGROUND ********\r\n\\\"Feared and treacherous in her rule, her hunger for power did not end with her death. In life, she dabbled heavily in Necromancy. Few historic figures are viewed as unambiguously evil, but Potema, the so-called \\\"Wolf Queen of Solitude\\\", surely qualifies for that dishonor.\\\"\r\n\r\nDeep in her dungeon beneath Solitude\\'s Blue Palace, Queen Potema toiled away with her Necromantic rituals. Though evil, through and through, she was still of noble birth and she felt it necesarry to have created for her a magnificent blade to use during her vile, sacriligous rites. And so, the Wolfqueen\\'s Hunger was born. Those who managed to steal a small look at the sword and lived told stories that she made a pact with an black-hearted eldritch being in order to transform it from it\\'s mundane materials into something truly sinister.\r\n\r\n******* ABOUT *******\r\n\r\nThis mod adds a standalone, upgradeable and enchanted sword into Skyrim. Model and textues all 100% new, no reusing any vanilla assets. The enchantment is a single enchantment called \\\"Wolfqueen\\'s Bite\\\" comprised of Frost, Health/Drain, and Soul Trap, making it equally deadly to MOST enemies you could encounter.\r\n\r\nThe weapon can be found in the Blue Palace Crypts, on Potema\\'s corpse. If you\\'ve already fought Potema, you can add the sword to your inventory with \\\"help wolfqueen\\\" and choosing the WEAP item. The item\\'s ID should be xx00183A, (where xx is determined by your load order) so all you need to type into the console is [color=red] player.additem xx00183A 1. [/color]\r\n\r\nIt can be upgraded (NOT crafted) at a forge, simply being because it is supposed to be a fully unique weapon. As with most unique or enchanted items in vanilla Skyrim, Wolfqueen\\'s Hunger can only be improved if you have the Arcane Blacksmith perk in your Smithing tree. \r\n\r\n\r\n******* INSTALLATION *******\r\n\r\nExtract all files into the Data folder, and make sure that \\\"PotemasWolfblade.esp\\\" is checked in the Data files. If you don\\'t know how to install mods I would suggest that you watch a video online about the whole process, it\\'s rather easy.\r\n\r\nOr you could just use NMM, which is a one click install, your choice.\r\n\r\n\r\n******* UNINSTALLATION *******\r\n\r\nFor an easy uninstall, delete \\\"PotemasWolfblade.esp\\\" in the Data folder. This should render the mod totally inactive in your game. However those looking to uninstall it completely, just delete all files associated with the mod, that is, delete the MT folder under \\'weapons\\' in both the Mesh and Textures folders.\r\n\r\n\r\n******* AUTHORS AND CREDITS *******\r\n\r\nMTindle - Mesh, nif work/conversion and base level CK work\r\nSikSikSikki - Concept drawing, CK work and Lore know-it-all\r\nMillenia - Gem model, helpful modelling tips and epic texture\r\n\r\nHowever as well as these people, some others helped along the way...\r\n\r\nMoraelin - Nifskope advice\r\nThe Vampire Dante - Some great ideas and advice\r\nForzane - Again some Nifskope help\r\nAlCaio - Faithful Guinea Pig\r\n\r\nAnd Bethesda or course for making the game :D\r\n\r\n\r\n******* TOOLS USED *******\r\nThe Creation Kit, obviously\r\nAutodesk 3D Studio Max 2011 - Mesh work and conversion\r\nNifSkope - Invaluable for getting the thing in-game\r\nPhotoshop - Textures",
  "categoryId": "55",
  "version": "1.0",
  "author": "MTindle - SikSikSikki - Millenia",
  "createdUnix": "1351803966",
  "updatedUnix": "1352030288",
  "containsAdultContent": false,
  "uploadedBy": "MTindle",
  "primaryFile": null,
  "files": [
    {
      "fileId": "97423",
      "name": "WolfQueens Hunger",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2238",
      "fileName": "WolfQueens Hunger-26332-1-02.7z",
      "uploadedUnix": "1352030288",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/35751206acdb4210fa871027c297e39cc96370e9c5303159a71120bcfee31947/analysis/1407248946/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WolfQueens%20Hunger-26332-1-02.7z?fid=97423&ttl=1535798321&ri=8192&rs=8192&setec=b05e387c09ed220ad66ad5a3ed01dc05"
    }
  ]
}