{
  "modId": 26330.0,
  "modName": "Brygard lvl 1 to 53 Nov 1 2012",
  "summary": "Save game Brygard lvl 1 ready to be level 53 in which you choose his stats and what to spend his perks which he has 52.\r\nHe\\'s in Helgen with Hadvar.\r\nBrygard has been training his skills to 100 in the following:1hand,2hand,destruction,restoration,light and heavy armor,sneak and block.\r\n105 days in game has passed.\r\n",
  "descriptionHtml": "Skyrim 1.7 with Heartfire and Dawnguard recommended or up.\r\n\r\nThis a save of my character named Brygard a male Nord,there\\'s nothing special about his look but his stats and level are what you want.\r\nBrygard has been training his skills to 100 in the following:1hand,2hand,destruction,restoration,light and heavy armor,sneak and block.\r\n105 days in game has passed.\r\n\r\nYou can use the console command \\\"showracemenu\\\" whith out the quote to change Brygard appearance and name,but do not change sex or race to avoid problems.\r\nFor more info about this go here and look for \\\"showracemenu\\\"\r\nhttp://www.uesp.net/wiki/Skyrim:Console\r\n\r\nQuote:\r\nNote: Using this command to alter one\\'s race will reset skills and health/magicka/stamina to default levels.\r\nThis command can be safely used to alter a character\\'s appearance without causing any unwanted side-effects as long as race is not changed.\r\nHowever, it should be noted that upon completing your changes and choosing a name for your character, all temporary active effects (such as Gift of Charity or shrine blessings) will be removed.\r\nRacial resistances will no longer be listed in Active Effects until the game is loaded from the main menu, at which time racial resistances will be automatically reapplied.\r\nPermanent active effects such as those from guardian stones or perks will not be lost.\r\nActive effects granted from enchanted items will not be listed until the items are re-equipped.\r\nEnd of Quote.\r\n\r\nMake a back up of your saves game number 2 or the whole folder and drop the folder named \\\"saves\\\" to your skyrim folder under your documents.\r\nExample in Windows 7:\r\nC:\\\\Users\\\\Brygard\\\\Documents\\\\My Games\\\\Skyrim\r\n\r\nMy save game is mod free except I have Dawnguard and Heartfire installed when I played this character,so you might get a warning about missing stuff.\r\n\r\nWhen you load the save ingame \\\"Save 2 - Brygard  Helgen Keep  151.52.00\\\" he will be level 1 but he be ready to level up to level 53.\r\n\r\nYou can choose what to invest his points either for Magic,Health,Stamina or equally distrubute it which after that you have 52 perks that you can\r\ninvest in any of the skills of your choosing or save them for other skills that your going to raise for later on the game.\r\n\r\nYou can raise all skills to 100 and reach to level 81 which you will have 80 perks total to use or in this case you only need to level 29 more to reach 80 perk points.\r\n\r\nAnother thing you will be encumbered due that I have looted all items I could from Helgen,also there some female npc front of you to test any female body mods before exiting Helgen.\r\n\r\nI made this character for me to use in the future when all DLC or when Skyrim hits it\\'s GOTY edition that includes everything so I don\\'t have to level from scratch again.\r\n\r\nHopefully patches in the future wont require you to make a brand new character from scratch.\r\n\r\nI decided to share my save game for people that don\\'t have time to raise level fast etc etc,this save game will save some of your time leveling as well as mine\r\nin the future gameplay.\r\n\r\n\r\nRecommended mod to use when using the console command \\\"showracemenu\\\"\r\n\\\"Ultimate NPC Face Unlocker\\\"\r\nhttp://skyrim.nexusmods.com/mods/21488\r\nYou will be able select 240 presets for Nords face if you don\\'t like brygard\\'s face.",
  "categoryId": "43",
  "version": "1.0",
  "author": "Brygard",
  "createdUnix": "1351795311",
  "updatedUnix": "1351796005",
  "containsAdultContent": false,
  "uploadedBy": "xf15bd4zu49x",
  "primaryFile": null,
  "files": [
    {
      "fileId": "97031",
      "name": "Brygard lvl 1 to 53 Nov 1 2012",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1912",
      "fileName": "Brygard lvl 1 to 53 Nov 1 2012-26330-1-0.zip",
      "uploadedUnix": "1351796005",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f73fa8adec639c11ec75e8855764fc81bbe2f6cbd0e69f8bed15382043161367/analysis/1407245344/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brygard%20lvl%201%20to%2053%20Nov%201%202012-26330-1-0.zip?fid=97031&ttl=1535798319&ri=8192&rs=8192&setec=c0989527c9355d0ea8aa64f67493b7f2"
    }
  ]
}