{
  "modId": 26343.0,
  "modName": "Super Simple Breezehome",
  "summary": "Super simple breezehome mod, changed fire pit for fireplace and added chimney outside too. Guest bedroom for follower mods. Fixed lydia&#39;s bedroom so she sleeps, no more stuck lydia&#33; No forges or smelters or gaudy furniture just breezehome. NOW COMPATIBLE WITH HEARTHFIRE DLC&#33;",
  "descriptionHtml": "This mod is the beginning of the direction I want to go with modding breezehome. It is not the final product that I want to make but more of a framework to see where the direction could be improved. I added many basic things that a lot of people want fixed like lydia&#39;s bed properly arranged so she can actually use it. Fixed the navmesh around her bed so she will actually use it too. Got rid of the fire pit and replaced it with a fireplace in the kitchen. Better arranged the living room furniture so there is more room to do something there and get from the front door to the ladder easier. Fixed the ladder so nobody gets stuck at the top. Added a safe in the main bedroom, added better lighting throughout the house and increased radius of main lights. All storage in the house is SAFE no respawn storage that includes the barrels behind the ladder and the sacks under the beds upstairs which by default would respawn after a while.\r<br />\r<br />Ok I think I have finally fixed the hearthfire problems this time. What I did was make this mod use the hearthfire, dawnguard DLCs AND use the unofficial skyrim patch, unofficial dawnguard patch, and unofficial hearthfire patch as well so now you will need ALL of those things to use the hearthfire version of this mod.\r<br />\r<br />I moved the guest room/kids room and lydia&#39;s room around so lydia now sleeps just outside the main bedroom and the guest/kids sleep in lydia&#39;s old space. I did this because I had the child beds too close together causing the kids not to use them. Lydia&#39;s default room just had more room for kids beds so it works better there for kids.\r<br />\r<br />I put lydia default standing position downstairs so she won&#39;t keep trying to walk in and out of her room when you enter the house and also to see if it makes any difference for some things to work or not.\r<br />\r<br />I set the player bed to use the spousebed keyword and linked to the house center xmarker so now your spouse should sleep in the player bed only.\r<br />\r<br />I compeltely deleted the housepurchase settings and started over for those. I think I got the settings right this time for HF stuff to work after reviewing the source scripts for HF stuff.\r<br />\r<br />I recommend you start with a new game for this one, I don&#39;t know what will happen for save games from the old version.\r<br />\r<br />I ran the TES5EDIT program on this mod before uploading&#33; I used the correct guides for using that program so it should be as clean as it can be.",
  "categoryId": "67",
  "version": "v1.3",
  "author": "Dragonslayer2k12",
  "createdUnix": "1351819086",
  "updatedUnix": "1434099578",
  "containsAdultContent": false,
  "uploadedBy": "dragonslayer2k12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "99087",
      "name": "supersimplebreezehomefixed",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "151",
      "fileName": "supersimplebreezehomefixed-26343-v1-1.rar",
      "uploadedUnix": "1352751893",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/801c0f6593e85a2b7318bda4742b93ffc2e65dcdb61920c517500136afe35181/analysis/1407260590/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/supersimplebreezehomefixed-26343-v1-1.rar?fid=99087&ttl=1535798335&ri=8192&rs=8192&setec=991d5c9084e134a6ae4fd05bd44cc213"
    },
    {
      "fileId": "1000163833",
      "name": "SSBreezeHomeMod",
      "version": "v1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "183",
      "fileName": "SSBreezeHomeMod-26343-v1-3.rar",
      "uploadedUnix": "1434099578",
      "modVersion": "v1.3",
      "virusScanUrl": "https://www.virustotal.com/file/0ed5606231d9d11a6382eced58d534dfaa140021d3ad0a65ccc76c57c1943e9e/analysis/1434099603/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSBreezeHomeMod-26343-v1-3.rar?fid=1000163833&ttl=1535798335&ri=8192&rs=8192&setec=7b933da0da3fe2a0c3cdfbed6cee48b3"
    }
  ]
}