{
  "modId": 26366.0,
  "modName": "Animated Prostitution - TRADUZIDO PORTUGUES-BR",
  "summary": "TRADUZIDO PARA PORTUGUES-BR E REVISADO",
  "descriptionHtml": "EDIT: PODE SER USADO COM QUALQUER MOD DE NUDEZ MALE E FEMALE.\r\n\r\nolá pessoal trago a todos o esse mod maravilhoso e muito bem elaborado, parabenizo o criador dele, essa versao que estou disponibilizando esta com os diálogos todos traduzidos, pra quem quer curtir não so a animação mas tambem todos os diálogos, ta a oportunidade, pois sou sincero em dizer os diálogos estão 100% picantes , que é uma diversão a mais para o publico +18^^ irei colocar algumas descrições aqui do mod mais se tiverem alguma duvida de como usa-lo vou deixar o link do post original pra que quiser ver.\r\n\r\n\r\nSE GOSTAREM ENDOSSEM, POIS ISSO PODE SER BESTEIRA MAIS PRA MIM É MUITO SATISFATORIO E ME INCENTIVA PARA QUE EU POSSA CONTINUAR O MEU TRABALHO :)\r\n\r\nThis mod allows you to have sex with NPCs.\r\n\r\nTo use it, talk to your marriage partner (default key \\\"E\\\"). To use this with other NPCs, you must equip an item with the enchantment \\\"Sexually Active\\\" . The animations play for 60 seconds on a timer.\r\n\r\nEach NPC has a cool down time of 1 game hour. You the player can boink as much as you wish, but NPCs can\\'t. (Poor NPCs just don’t have the endurance of the Dragonborn!)\r\n\r\nAn AP Amulet of Dibella will be added and equipped once you start a game with this mod enabled. If you lose it or upgrade with out resetting, you can make on at a forge under the jewelry category.\r\n\r\nBefore starting to use the mod, make sure to visit the option menus first so that the settings can be tweaked to your satisfaction.\r\n\r\n-Mod highlights-\r\nYou can have sex with almost all friendly NPCs.\r\nYou can let male NPCs have sex with your companion.\r\nYou can make almost any friendly NPC a companion.\r\nYou can pimp yourself on automatic mode for coinage. (Female players only ATM.)\r\nYou get Speechcraft experience for talking NPCs into it.\r\nHas built-in strap-on to enable females to use male AP animations.\r\nCan be used in either full bore or covert modes.\r\nHas its own behavior files, allowing it to be run out of the box.\r\nCan be made compatible with fore\\'s work.\r\n\r\n recommend:\r\nFor females:\r\nInstall first...\r\nCHSBHC - BBP - Nude and Jiggly Mod by CherryHotaling the female body. (All animations in AP Skyrim are BBP enabled, but BBP is not necessary.)\r\nInstall next...\r\nCBBEv3M Body Replacer\r\nThen...\r\nRun BodySlide and make your self a nice looking never nude. Just keep the arse small to match the AP Strap-on.\r\nLast...\r\nIn game, pick the females strip to nude option.\r\n\r\nFor Males:\r\nInstall first...\r\nBetter males - Beautiful nudes and faces - New hairstyles by Chris57 and FavoredSoul for the male body. (I pick the one with undies.)\r\nLast...\r\nIn game, pick the males strip to nude option.\r\n\r\n(This is just MY way of setting up the bodies. Feel free to pick your own.)\r\n\r\n-Note about included nude bodies-\r\nAP has a set of naked bodies that come with it for the “use nude body” setting.\r\nThe male body is from the erect \\\"Better Males\\\".\r\nThe female body is a body slide \\\"CBBE\\\".\r\nThere is a female body-slide body \\\"CBBE BBP\\\".\r\nThese are just placeholders and it is recommended that you replace them with a body of your own choosing.\r\n\r\n-Note about spells-\r\nAP spells will be added when you equip an AP Amulet of Dibella or a piece of equipment enchanted with the AP-exclusive enchantment \\\"Sexually Active\\\". They will be removed when you unequip the AP Amulet of Dibella or the enchanted item.\r\n\r\nEquipping the amulet grants your character several new abilities:\r\n\\\"AP Options\\\" -- toggles the options menu. Binds to the shout/powers button. (Default Z.)\r\n\\\"AP Enjoy Yourself\\\" -- allows a female Dragonborn to have a little fun. Binds to the shout/powers button. Exclusive to women.\r\n\\\"AP Player Slut Spell\\\" -- brings up the menu for prostitution options. Also enables you to begin working. Binds to the shout/powers button. Exclusive to women, for now.\r\n\\\"AP Show Me\\\" -- strips the targeted NPC for a time. Works on both men and women. Binds to the action buttons, and takes up one hand. (Default left/right mouse button.)\r\n\\\"AP Uncontrolled Urges\\\" -- makes the targeted woman strip nude and have some fun. Binds to the action buttons, and takes up one hand.\r\n\r\nSpecial note: The auto pimp yourself spell (female only ATM) can be ended by drawing your weapons, or re-casting the spell.\r\n\r\n-Note about strap-on-\r\nAP has optional strap-ons that can be forged under the leather category. To use it, just be female and have it in your inventory when you talk to an NPC, no need to equip it.\r\nTo get a female NPC to use it, add it to their inventory. How you *cough* give it to them is up to you. \r\nIf you have strap-ons from another mod that you like better then the AP one, you can just copy over the files or pick the option \\\"Strap On Override\\\".\r\n\r\n-Making an NPC into a follower-\r\nJust sleep with them FOR FREE enough times. Each free time raises their relationship rank one rank. At rank 4, they can be asked to follow you as a companion. This is accessed through the new \\\"Come with me\\\" dialogue upon reaching rank 4.\r\nYou can make almost any friendly NPC into a follower, even ones that would normally never be recruitable. However, AP followers may only have basic commands; others have the full range of commands, and this is pre-determined by their voice type. You can interact with AP-made companions through the \\\"Let’s talk\\\" dialogue. \r\n\r\n-Making an NPC into a follower: male players-\r\nI knew that housecarls were good for something. Even with the option \\\"Dragonborn Can\\'t Be Gay\\\", you can still give away your follower. Guys like that kind of thing... \r\n\r\n-Making an NPC into a follower -- Modded NPCs-\r\nIf you have other mods that change the properties of followers or add new options when you talk to them, these fields will also show up on followers made through AP. For example, with the mod My Home is Your Home, you can invite your new friends to stay at one of your houses. Be aware, however, that followers earned through AP may not have the full range of function and may not respond correctly to these new, modded commands.\r\n\r\n-Using the bed sex options-\r\nTake your date to a bed. Either use Let\\'s Talk -> Can you do something -> Bed, Or click (E) on the bed and pick one of the menus.\r\nIf you are female you have the option to self pleasure.\r\n\r\n-Fixes and better functionality for AP followers-\r\nSo, you\\'ve made an unusual follower via AP, one that the game doesn\\'t normally allow. If you try them in combat, though, there is a good chance that they will be very fragile and weak. How do you fix it? The answer is console commands and/or mods.\r\nTo level up the new follower to your level, open the console command menu with the tilde key (~). Click on them to target them, then input this code without the quotation marks: \\\"setlevel 1000,0,1,81\\\".\r\nFollowers in general tend to be killed easily. Want to make your new follower effectively immortal by making them essential? There is a method to do it with console codes, but the simplest way is to try the mod UFO - Ultimate Follower Overhaul, which lets you set followers as essential and much more.\r\nGiven the NPC you want plenty of favors, but they\\'re not willing to go with you? Open the console, target them, and input this code without quotation marks: \\\"player.setrelationshiprank player 4\\\". That should solve it.\r\nAnd of course, BE CAREFUL with who you make a follower. If they are a vendor, it can disrupt their selection of goods. If their behavior is heavily scripted, it might break. If they are involved in quests, things can get messy.\r\n-Pimping your follower-\r\nYou can pimp your follower to male NPCs with no speech check. Giving them away for free will make the NPC like you. If you have 50+ Speech, you can try to get 25g for them. Your follower isn\\'t anywhere near as hot as the Dragonborn, so don\\'t expect to make to much coin.\r\n\r\npost original :  http://skyrim.nexusmods.com/mods/10748\r\n\r\n-Credits-\r\nProgramming/Animation/Scripting/Design/Everything by JoshNZ\r\nText revisions by MysteryHelper (And oh thank-you, my everything isn\\'t worth anything if you can\\'t read it)\r\n\r\nTRADUÇÃO: Liatec\r\n",
  "categoryId": "51",
  "version": "2.34",
  "author": "Liatec",
  "createdUnix": "1351882892",
  "updatedUnix": "1351883529",
  "containsAdultContent": true,
  "uploadedBy": "liatec",
  "primaryFile": null,
  "files": [
    {
      "fileId": "97156",
      "name": "Animated Prostitution-TRADUZIDO PORTUGUES BR",
      "version": "2.34",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "108254",
      "fileName": "Animated Prostitution-TRADUZIDO PORTUGUES BR-26366-2-34.rar",
      "uploadedUnix": "1351883529",
      "modVersion": "2.34",
      "virusScanUrl": "https://www.virustotal.com/file/f77febd5dc992a9435352de52ec91890dc226e05986fe64960f2de21bfd51c1e/analysis/1407246443/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Animated%20Prostitution-TRADUZIDO%20PORTUGUES%20BR-26366-2-34.rar?fid=97156&ttl=1535798390&ri=8192&rs=8192&setec=9cdd83b2d0571502c1a76aa8ae941d9b"
    }
  ]
}