{
  "modId": 26392.0,
  "modName": "Invincible Mage",
  "summary": "This is a multimod for mages to increase their power and regeneration of magicka with one Necromancer modded amulet and a new Necromancer ring, improves master powers casting time and adds all spell books in one location for purchase with a low price.",
  "descriptionHtml": "This is a mod that adds a modded Necromancer amulet and a new modded Necromancer ring available for purchase in Dragonsreach, it also adds all spell books including master spells. The items can be purchased from Jarl\\'s mage, Farengar Secret-Fire at a cheap price. The mod also improves master spells casting time from 3 seconds to 0 seconds making them flawless in combat, 3 seconds casting time is much and if an enemy hits you then it disrupts the spell from being used. The Necromancer amulet adds 1000 points to magicka and all spells cost 25% less to cast, the Necromancer ring regenerates magicka 1000% faster and all spells cost 25% less to cast.\r\nUpdate to 1.0b changes the regeneration of magicka, health and stamina in combat to be equal to regeneration rate out of combat.\r\nThe mod is tested by me and it works properly with no bugs/glitches etc.",
  "categoryId": "40",
  "version": "1.0b",
  "author": "ArchangelArchmage",
  "createdUnix": "1351939471",
  "updatedUnix": "1351959867",
  "containsAdultContent": false,
  "uploadedBy": "ArchangelArchmage",
  "primaryFile": null,
  "files": [
    {
      "fileId": "97294",
      "name": "Invincible Mage",
      "version": "1.0b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Invincible Mage-26392-1-0b.rar",
      "uploadedUnix": "1351959867",
      "modVersion": "1.0b",
      "virusScanUrl": "https://www.virustotal.com/file/3df4b993a03fabe26c99aa6659130b942d04f9f1e6a23674ca43dedbf1f4b96f/analysis/1407247623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Invincible%20Mage-26392-1-0b.rar?fid=97294&ttl=1535798434&ri=8192&rs=8192&setec=7a5a6447b0a068ab7c28cce164a62d73"
    }
  ]
}