{
  "modId": 26398.0,
  "modName": "Kamdoon",
  "summary": "Welcome to Kamdoon&#33;\r<br />this is a totally new world im creating, it&#39;s inspired by alot of my time playing oblivion & skyrim.\r<br />so far with over 7 months work to this it&#39;s coming along well. i&#39;m in the process of an update asap. but as it stands this is a rather large map so far. want to experience something different? then try",
  "descriptionHtml": "************************NEW NEW NEW NEW NEW NEW NEW NEW NEW  NEW NEW NEW NEW*****************\r<br />****************************************************************************************************************************\r<br />****************************************************************************************************************************\r<br />Hey Everyone.\r<br />\r<br /> \r<br />\r<br />I think this has been a long time coming, something that I wanted to ignore.. I&#39;ve put so much into this thing and learned so much doing it that it has been a tremendous leap forward in my skills as a DIY level designer. there&#39;s been ups, and down&#39;s and a lot of coffees and sleepless nights toiling away on this mod. But with a heavy heart I regret to inform you all that I &#39;m closing this mod down. Now before it&#39;s too late..  Don&#39;t fret it isn&#39;t the last of the work that you&#39;ll see from me. ;)\r<br />\r<br /> \r<br />\r<br />And before you ask No it&#39;s not because of the current glitch in progress. But for many reasons. One being that it&#39;s too Big, and too spread out to truly ever finish unless I devote say 3 years to the project for the size it is. Another, that is something I think a lot of people go through. That over time our perspectives change, we change as an individual & things that felt a certain way months before are different now. at least that&#39;s how I feel. 99% of the first few months of work feel like something I should scrap. Which isn&#39;t a bad thing only that I&#39;ve gotten better at my modding craft & the older areas are out of place with the much more tidy new stuff.\r<br />\r<br /> \r<br />\r<br />I hate to drop this bomb on everyone who&#39;s been following me throughout this project, but don&#39;t feel disheartened. I appreciate the support and the comments both positive and the negative. It&#39;s helped shape what I do.\r<br />\r<br /> \r<br />\r<br />In the end, the project is better left as is. An unfinished beast of a mod that you can draw your own story on. It&#39;s been worth all the time and effort I &#39;ve spent as I &#39;m now in the position to give you a much sleeker, more defined experience, that comes with now having many months experience using the Creation Kit* \r<br />\r<br /> \r<br />\r<br /> \r<br />\r<br />I&#39;ll be contacting my Voice actors to give them the news & to let them know that i&#39;ll keep their work for a future skyrim project.\r<br />\r<br /> \r<br />\r<br /> \r<br />\r<br />Not to drag this into the ground i&#39;ll leave it there.\r<br />\r<br />For all of you who have waited until this was to be &#34;Finished&#34; before playing it i&#39;ll advise you all that now is as good a time as any to play the most recent up to date version of the released parts.   over on my Skyrim Nexus page HERE &gt;&gt;&gt;&gt;    http://skyrim.nexusm...?id=26398&pUp=1\r<br />\r<br /> \r<br />\r<br /> \r<br />\r<br />Whilst I wait for more comments from those of you who have yet to play the released stuff i&#39;ll leave you all with a glimmer of hope*\r<br />\r<br /> \r<br />\r<br />I began work recently on a new mod. the name is still under wraps, but it&#39;s sitting at a hefty little file size now of BETHESDA PLUG-IN DATA FILE: 363KB.\r<br />\r<br />And is comprised of the skyrim master file, along with Dawnguard, Hearthfire & Dragonborn add - ons&#33;  Yes this means you will need the DLC. But I believe that most of you will eventually own all the dlc anyway.\r<br />\r<br /> \r<br />\r<br />I won&#39;t be releasing any more info on this until the time is right, I &#39;d wager about a months time. but I have a checklist of things to do before I can show this to the world.\r<br />\r<br />Firstly..\r<br />\r<br /> \r<br />\r<br />1. Tidy up underwater ( have all the unrealistic drop offs smoothen out in a realistic fashion )\r<br />\r<br />2. Set up the jail system so guards act correctly.\r<br />\r<br />3. finalize afew locations and music in them accordingly.\r<br />\r<br />4. Navmesh the area upto par.\r<br />\r<br />5. Add more NPC&#39;s ( I&#39;ve got various vendors with a trainer skill attached and packages&#33; but need more )\r<br />\r<br />6. LOD.. Add a basic lod for the area.\r<br />\r<br />and afew other things. then i&#39;ll begin releasing info on my much smaller and well thought out mod. Which will be perhaps the size of Whiterun&#39;s interior city. This mod is about making it small, making it work, and making it memorable. So far it&#39;s well on it&#39;s way to be a very unique experience.\r<br />\r<br /> Again thanks for reading. and as I mentioned above.. Play what I&#39;ve released of Kamdoon&#33; it&#39;s worth your time checking out what took up so many of my nights&#33;&#33;&#33;  XD\r<br /> \r<br />Thanks everyone.  \r<br />\r<br /> Clint.\r<br />\r<br />*********************NEW NEW NEW NEW NEW NEW NEW NEW*******************************************************\r<br />************************************************************************************************************************************************************************************************************************************************************\r<br />\r<br />\r<br />\r<br />VERSION #3 DEMO IS OUT A.1.3.0  \r<br />\r<br />FIRST DEMO FOR THE NEW YEAR 2013&#33;  ENJOY&#33; COMMENT&#33; ENDORSE&#33;  ;)\r<br />- All that you need to download is the latest version, which is demo 3*.\r<br />\r<br />*NEW* - TRAILER FOR KAMDOON 2013 IS UP WATCH IT HERE UNDER MY VIDEO SECTION&#33;  \r<br />- Complete with voice narration by none other than Matthew Wade aka &#39;lomekian&#39; from TESALLIANCE.ORG&#33;&#33;\r<br />\r<br />HERE: &gt; http://www.youtube.com/watch?v=HZ0Mze4UMRo\r<br />\r<br />&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;\r<br />&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;\r<br />KAMDOON CONFIRMED VOICE ACTORS / ACTRESSES:\r<br />Morfolk Capitol Guards: Stephanie aka &#39;Arisen1&#39;\r<br />Cyrius Grey: Matthew Wade aka &#39;lomekian&#39;\r<br />Icerun Guards: Matthew Wade aka &#39;lomekian&#39; & &#39;xybris&#39; & Barrett Leddy\r<br />Pacnuversiyix: &#39;zaf&#39; & Daniel Hodge\r<br />\r<br />\r<br />Notes::\r<br />\r<br />When you first enter death adders barrow, and fight a priest, a gate closes down on the far end of the room. For the moment you will have to TCL past that as i&#39;ve yet to make a proper enterance to that area of the Barrow. However there&#39;s still multiple enterances here with different areas to explore regardless  :)\r<br />\r<br />Also to the left of that barrow i have yet to complete those mountains, thus there&#39;s still some gaps i haven&#39;t yet filled i&#39;m getting to that soon.\r<br />thanks everyone.\r<br />\r<br />*NEW NOTE* - There&#39;s a possible error in &#34;detinwulf&#39;s domain&#34; in the tower, it&#39;s supose to only have 2 people, Detinwulf* and his daughter Emily* - if for some reason there&#39;s upto 3 extra people there from &#34;skyrim&#34; it&#39;s an error on my part&#33; and i&#39;ll get to fixing this ASAP. thanks for understanding.\r<br />15/02/2013.\r<br />\r<br />KAMDOON: WHAT IS KAMDOON?\r<br />- Kamdoon is based around the area of high rock. It encompasses distinct areas of Daggerfall, the Wrothgarian and Dragontail mountains, and a host new areas that while are not in the &#39;Elder scrolls&#39; lore Still have a significant role in what makes up Kamdoon. \r<br />\r<br />- The premise of this world is as follows.\r<br />\r<br /> 3E 293 Turdas Last seed - The rival splinter factions controlling the various city states and kingdom territory&#39;s thoughout High Rock have been hit hard by the war to the south in Skyrim between the Aldmeri Diminion and the human races, as many refugees have poured into high rock fleeing for their lives, With the &#39;gold concordat&#39; signed and the outlaw of talos worship across the land many have lost not only their livelyhoods but their beliefs as well. \r<br />\r<br />As the latest horde of the high elf&#39;s decended apon skyrim to silence the few remaining worshippers of talos, tensions raced as much of the known world was already in chaos due to the latest news of Dragons attacking towns and villages across skyrim and now spreading their wrath apon high rock..\r<br />\r<br /> Recently Orsinium too has been hit hard by attacks from dragons\r<br />nerving even the strong Orcs who inhabit the southern city state.. \r<br />\r<br />3E 293 - { ADDED LORE} \r<br />\r<br />**On this same year an unexplained warp appeared during the skirmishes, out of this warp, a rift in time, out came a lone figure.. cloaked & wreathed in flame this ungodly demon cursed the land of Kamdoon, creating a time paradox that would change the shape of history forever... after this event, the seasons would be forever different, random, unplanned.. Time itself changed, and the era&#39;s timelined became stretched & distorted.. if there was a fix to this curse no one alive yet knew how to undo it&#39;s malice...**\r<br />\r<br />\r<br />- The Deselle Isles, Bjoulsae River tribes, & the Western Reach have also been laid to ruin by apparently a dragon race that is led by the overlord Alduin*, the only known thing about this new threat is afew eye witness reports by the breton villagers that state they saw dragons that looked far older than the others and differed in size, shape and colour.\r<br />\r<br />The highland strongholds & isolated valley settlements have brought about seperate clans independent of each other and all of which are out for themselves. Refusing to co-operate into one cohesive unit. Nevertheless, their language, traditions & legends are a unifying legacy that has not diminished over time but instead flourished.\r<br />\r<br />- The dominion was doing everything it could to get back at the known world for their loss of power after overextending their reach trying to control nearly a quarter of Tamriel.\r<br />Now as the fighting expanded, the aldmeri realized they again bit off more than they could chew, with dwindling resources to continue the war a large contingent desided to gather their best\r<br />troops falling back to their fortress in Balfiera the &#39;Direnni Tower&#39;. \r<br />\r<br />Even with everything going on the Bretons of High Rock still refused to unite.\r<br />- The war was raging, with seemingly no end. Daggerfall became seriously bomabarded by attacks from various tribes and rading parties of the aldmer. \r<br />\r<br />Holding them back were the special forces of high rock effective groups of warriors utilizing brutal guerilla tactics that although the general populace wouldn&#39;t unite consisted of Orc&#39;s, bretons, nords, wood elves, khajit&#39;s and a handful of imperials who were thrown out from the regular forces before the war, and they became their own force to be reconed with.. \r<br />\r<br />- Daggerfall with its strong economy, cultural, and military force in southern High Rock became a backbone where the rest of high rock would grow and prosper from, but not until the great war\r<br />found an end. For this the special forces known as Dagger-Rend or &#34;Rend-unt-militus&#34; and their nabouring clans would have to fight back the hordes of aldmer attempting to crush any hope of peace. Thus the enormity of the situation played heavily on their hearts and minds.\r<br /> \r<br />- From a bleak and ravaged landscape, the bretons and militia got word to skyrim to send aid. Even with the turmoil in skyrim, the leaders of the major holds came to an agreement in conjuntion with the Greybeards of the &#39;throat of the world&#39;. What happened next sent swift justice through the hearts of the larger part of bretony rule. \r<br />\r<br />- - 3E 374 middas Frostfall, \r<br />- The added might of not only the bretons, militia, Orcs and now a large contingent of nords from skyrim sent the aldmer reeling, they crushed the threat once and for all not allowing any of the high elf&#39;s main force to survive. Only a handful of stragglers and cowards slipped away into Hammerfell un-noticed and let their hate subside and venture into other means of survival.\r<br />\r<br />- 3E 375 The threat of dragons was still strong, infact stronger than ever. Some believe that the aldmer were using some foul magic to curse the land or to control dragons, none of which could\r<br />ever be proved. Now with the takeover threat disbanded the dragons knew the remaining forces were to scarce to be of any concern to them and began to systematically slaughter various towns &\r<br />settlements along the Iliac Bay&#39; and wayrest. threatening the newfound hope of the peolples of high rock. \r<br />\r<br />- The clans that united after the war governed what remained of Sentinel and wayrest, and having wayrest recently destroyed by Alduin himself sent chills down the spine of everyone from the new\r<br />found officials that roes up to rule high rock, and even the hardiest of souls who fought in the special forces, not even the Greybeards had the strenght to stop him on his path to swallow the entire world. \r<br />\r<br />Only those few known to be &#34;Dragonborn&#34; could stop him, but who are they and where? none have been seen for millenia. \r<br />\r<br />- Vampire clans from after the war also settled themselves in the region, Trading for the most part at a heightened price due to the war, mostly in black goods and trade such dealings usually envolved the sale of Skooma, and other rare oddities such as daedra hearts &#34;Literally&#34; how they came to posess these are still a mystery as the Daedra haven&#39;t been sighted in centuries..\r<br />\r<br />Also to add to the turmoil, the thieves guild have sprung up again taking from those unfortunate souls making a living in farm or costal areas where the presence of military personnel is slim at best. \r<br />\r<br />- 3E 377- Reports of alduin have decreased for some unknown reason, prehaps he is planning an attack, no one is sure. However a small group of nords have come apon a strange portal in skyrim,\r<br />that reeks of daedric magic, the group vanished before they could raise any alarms.\r<br />\r<br />- 3E 391 - A farmer in high rock stumbled apon another of these &#34;Portals. He had no idea of what it was, or who built it, apon touching the portal he was warped to skyrim. Once he realised this\r<br />the man found himself lost in the thick forests, until he stumbled apon a small house in the forest. There he was met by an old woman who heard his plight..\r<br />\r<br />She offered him a feast, this was too good to be true as he was saw so much food in his life. the starving man ate the food without question.. Soon after this the poison he ate suffocated\r<br />Him, as he collapsed his eyes opened enough to see that this woman was not what he thought at all, but an apparition that tricked him.\r<br />\r<br /> his life ebbed away as he sank to the wood floor. - This being&#39; was the devils brew taken human form. The daedra had returned... What hope was left in the world of men? this story continues with the player* coming across this Portal and discovering the truth behind Alduin and the threat from the reborn daedra.. Will the holds join forces in time to stop the impending doom? it&#39;s upto You&#33; \r<br />\r<br />Known issues & Bugs\r<br />- When you get to the &#34;city gates&#34; area there&#39;s a beggar standing just outside the enterance. Once you talk to him a FORCED MOVE is suposed to happen where your body is taken over&#39; and you kill him.. BUT* right now the quest is bugged and FREEZES when your &#34;taken over&#34;. this i&#39;m working on fixing so just avoid talking to him for now&#33;  You can still hit ESC and load up another save point just incase you wish to see this for yourself ok.   { UPDATE 3 STILL HAS THIS BUG - I&#39;LL HAVE TO DELETE THIS BIT AND TRY THE QUEST AGAIN }.\r<br />\r<br />\r<br />INSTALLATION\r<br />Simply extract the files into your Data folder as per usual for a mod. I&#39;ve got LOD files too so i hope they work for you, You should be able to see into the distance with this mod right now.\r<br />But it is a slightly old LOD so theres afew glitches here or there but ill update this Soon&#33;\r<br />Place Kamdoon.esp in your load order at startup, and put it just below Skyrim.esm or whatever it&#39;s up to you. Enjoy.\r<br />\r<br />\r<br />Getting to Kamdoon\r<br />either at the start menu type coc thewhiteroad \r<br />\r<br />OR\r<br />\r<br />Go to Riverwood, cross the bridge on your way out of there towards Whiterun and at the end of the bridge to your right is a &#34;Mysterious Statue&#34; Activate this to enter my world..\r<br />* Im very much concidering moving the statue to a more desolate area of skyrim but for now Riverwood will do ok\r<br />\r<br />Just start with a new game for best results to avoid any dirty saves. thanks\r<br />to EXIT kamdoon simply -   LOOK AT MY JPEG MAP IMAGE I&#39;VE SUPPLIED IN THE MAIN FOLDER HERE. SEE THE RED CIRCLE? THAT&#39;S WHERE YOU NOW START, SEE THE RED &#34;X&#34;? THATS ROUGHLY THE POSITIONING OF THE EXIT STATUE BACK TO { SKYRIM }. \r<br />\r<br />Once you pass the nordic tower &#34;detinwulf&#39;s Domain&#34; at the start of a bridge look to your right&#33; you can&#39;t miss it. Thankyou.\r<br />.....................................................................\r<br />\r<br />There&#39;s bound to be the odd bug / glitch etc in this new update 3. However i&#39;ve been squashing as many of these issues as possible, if you notice anything odd that i may have missed just let me know thankyou.\r<br />\r<br />mostly, issues as always stem from dirty saves so always start this as a fresh save. There&#39;s afew lighting issues at the moment but that&#39;s just upto me to place the lights better, but i&#39;ve gone over all the trouble spots, \r<br />\r<br />as always if you want to leave a question / comment you know how to reach me.\r<br />\r<br />Clint.  at  voiceactorsneeded@gmail.com, or on my nexus page just drop a comment there&#33;\r<br />\r<br />@2013.\r<br />\r<br />1901 Named Exterior Cells to date&#33; {MORE NOW}..\r<br />\r<br />+ numerous exterior wilderness cells that have forested areas and just natural landscape to them. and there&#39;s still a ton of exterior cell space to fill yet&#33;\r<br />\r<br />\r<br />18 Interior spaces to date.\r<br />\r<br />\r<br />Quests completed : 0 / 70\r<br />\r<br />Quests planned : 5 / 70\r<br />\r<br />\r<br />Major Quests: 30 to create.\r<br />\r<br />Side Quests: 35 to create.\r<br />\r<br />Misc Quests: 5 to create.\r<br />\r<br />\r<br />Lines of Dialogue: 675 so far, and 22+ roles for those 675*. Much, much more to come&#33;\r<br />\r<br />\r<br />Interiors ##\r<br />1x candlehearth Inn.\r<br />1x Farmhouse.\r<br />1x farmInn.\r<br />2x caves\r<br />1x nordic ruins.\r<br />1x Secret vampire hall { cave }.\r<br />1x bannered mare style Inn\r<br />1x Player home { Breezehome type }\r<br />1x Blacksmith {Whiterun style}.\r<br />1x Jorvaskr House.\r<br />1x Windhelm Palace type castle.\r<br />1x Skyhaven temple style Temple.\r<br />\r<br />PLUS MORE&#33;&#33;\r<br />\r<br />\r<br />Main City&#39;s:\r<br />\r<br />\r<br />Morfolk Capitol#\r<br />\r<br />\r<br />- An open rocky tundra plains region with vast spanning roadworks branching off to various directions. home to the Jarl* of Morfolk. The open wilds here are home to a vast variety of wildlife, it is especially teeming with mammoth&#39;s and their Giant herders.\r<br />\r<br />\r<br />Ustenthiem Proper#\r<br />\r<br />A strong fortification from the harsh environments and the harsher beasts that roam it&#39;s borders.\r<br />here houses the central hub of trade to all the other walled city&#39;s of Kamdoon.\r<br />it&#39;s also the home of the &#34;Sahqon Spaan&#34; or { Crimson Shield&#39;s } - In the common tongue.\r<br />a band of brave adventurers from all over Tamriel who&#39;ve settled here.\r<br />\r<br />it is completely walled off by snow in all directions, And beyond Ustenthiem&#39; lies the towering behemoth of a mountain where the high king of Kamdoon resides, tucked away in the comfortable castle walls protected by his finest guard.\r<br />It&#39;s also the main source of mead distribution to the various city states, and houses some of the finest Inn&#39;s in all of kamdoon, said to be filled with colourful characters and the finest of song.\r<br />\r<br />It&#39;s &#34;Market Square&#34; is home to the fishing village quarter. with craftsmen and women from kamdoon, skyrim, hammerfell, even blackmarsh & Elsweyr.\r<br />the housing here is strongly influenced by Morrowwind, with it&#39;s Igloo style homes, and lively trade taking place around the clock. It&#39;s also nefarious for it&#39;s black market trade in Skooma&#39; from the local Khajit & Argonian races.\r<br />\r<br />\r<br />Daggerfall Castle#\r<br />\r<br />A place of great significance, yet in troubled times. most of it now is being rebuilt from dragon attacks, and warring skirmishes spilling over into it&#39;s borders.\r<br />daggerfall is a shell of it&#39;s former glory, with much repairs going on hold as the wraith dragon king Mogul Faar is determined to bring it to the ground,  resistence is strong, and hope yet lies on the horizon for this troubled state.\r<br />\r<br />\r<br />&#34;{ VARIOUS }&#34;\r<br />\r<br />\r<br />\r<br />There are a bunch of other city&#39;s that are yet to be named etc.\r<br />\r<br />\r<br />{ CASTLES } \r<br />\r<br />\r<br />Wrothgarr Keep#  (yet to be detemined is it&#39;s interior look and people etc)\r<br />\r<br />\r<br />Castle Solskaar#\r<br />\r<br />\r<br />\r<br />A daunting palace not too far from Ustenthiem&#39;s White Mountain.\r<br />here is home to the Vampire clans and those delving in Necromancy, Mages cast out from the guilds for practicing the dark arts. It also houses the Dockworks* where the Pirates and thieves guilds co - exist with the vampires, to further there own agendas.\r<br />it&#39;s ioslation from society allows them to rule over the area with an iron fist, as any one foolish enough to wander there is said to never be heard from again.\r<br />\r<br />\r<br />( more castles are planned to be dotted around the world)\r<br />\r<br />\r<br />\r<br />{Villages } \r<br />\r<br />\r<br />(a few collective villages exist from place to place, one so far amongst these is worth mentioning above the rest)\r<br />\r<br />\r<br />Driftwood#\r<br />\r<br />On the outskirts of the k&#39;vessi Forest&#39; lies Driftwood# a small village\r<br /> nestled into the frozen waterfalls. Here holds the rural farming community&#39;s,\r<br /> livestock & wheat growth, a humble inn and is also home to the &#34;Fighters Guild&#34;. \r<br />Where men & women come to train and to take on the role of slaying any fell beasts \r<br />that stray too close to the town. Also to hunt down the thieves & bandits who have robbed\r<br /> and pillaged the nearby villages and towns.\r<br />\r<br />\r<br />There&#39;s so much more i could say but i&#39;ll leave it here for now.\r<br />and comment here if you want to add feedback.\r<br />\r<br />STEAM VERSION OF DOWNLOAD HERE: http://steamcommunity.com/sharedfiles/filedetails/?id=98910209&searchtext=kamdoon\r<br />\r<br />BETHESDA FORUMS PAGES HERE: http://forums.bethsoft.com/topic/1385553-wipz-kamdoon/page__st__180 THREAD #1 IS NOW CLOSED GO HERE INSTEAD : http://forums.bethsoft.com/topic/1444529-wipz-kamdoon-thread-2/\r<br />\r<br />PROBOARDS WEBSITE HERE: http://kamdoonmod.proboards.com/index.cgi\r<br />\r<br />SUBSCRIBE TO MY YOUTUBE HERE: http://www.youtube.com/channel/UCDyGrD3OtBvb-nsnCUX8Ozg?feature=watch\r<br />\r<br />FOLLOW ME ON TWITTER HERE: @clintmathewchap\r<br />\r<br />TESALLIANCE.ORG FOR VOICE ACTORS HERE: http://tesalliance.org/forums/index.php?/topic/5879-wipz-kamdoon-requesting-voice-actors/",
  "categoryId": "30",
  "version": "A1.3.0",
  "author": "Clint mathew chapman",
  "createdUnix": "1351948639",
  "updatedUnix": "1359592254",
  "containsAdultContent": false,
  "uploadedBy": "coheed82",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000006010",
      "name": "Kamdoon",
      "version": "A.1.3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "89482",
      "fileName": "Kamdoon-26398-A-1-3-0.rar",
      "uploadedUnix": "1359592254",
      "modVersion": "A.1.3.0",
      "virusScanUrl": "https://www.virustotal.com/file/c878d682b5487e1dfc09833b99871c14bf4f5e227e0bc8e9e465d263ae4a72af/analysis/1407388208/",
      "changelogHtml": " Moved the exit statue so easy to find <br/> \n All new interiors <br/> \n created massive landscape areas with new LOD <br/> \n added more character and life <br/> \n vast new Dungeons with multiple ways to explore them <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kamdoon-26398-A-1-3-0.rar?fid=1000006010&ttl=1535798487&ri=8192&rs=8192&setec=92b527af8a2be6479bfedb902f23112f"
    }
  ]
}