{
  "modId": 26401.0,
  "modName": "Slower Companions Advancement Remade",
  "summary": "This mod was made based on Yorimi\\'s idea to force you to do more radiant companions quests before you are acepted into their ranks and later into the circle. Fully compatible with the latest\r\n1.8.151 patch",
  "descriptionHtml": "This mod was made based on Yorimi\\'s idea to force you to do more radiant companions quests before you are acepted into their ranks and later into the circle. Fully compatible with the latest\r\n1.8.151 patch\r\n\r\nAs most people would agree the way you were accepted into the most prestigious fighting group in skyrim was quite ridiculous. Proving yourself to them by killing a couple of bandits. \r\n\r\nWith this mod you\\'ll need to do quite a few of those radiant quests before you\\'ll get in and even more before you\\'ll get into the circle. You\\'ll need to reach a certain level to progress as well.\r\n\r\nIt is said that the circle is a group of the most trusted and honered members. So i guess it would make sense to do a lot of work and have a lot of experience before you can join them.\r\n\r\nThe mod comes in 3 versions:\r\n\r\nstandard:\r\n\r\nlevel 8 character and 3 completed radiant quests to start Proving Honor\r\nlevel 12 character and 6 completed radiant quests to start The Silver Hand\r\nlevel 18 character and 8 completed radiant quests to start  Blood\\'s Honor.\r\n\r\nmore work:\r\n\r\nlevel 14 character and 5 completed radiant quests to start Proving Honor\r\nlevel 18 character and 10 completed radiant quests to start The Silver Hand\r\nlevel 24 character and 13 completed radiant quests to start  Blood\\'s Honor.\r\n\r\nlots more work:\r\n\r\nlevel 18 character and 6 completed radiant quests to start Proving Honor\r\nlevel 22 character and 12 completed radiant quests to start The Silver Hand\r\nlevel 28 character and 15 completed radiant quests to start  Blood\\'s Honor.\r\n\r\nNow if you don\\'t have the required level but completed the required ammount of quests you\\'ll still be able to take more quests until you reach the required level.\r\n\r\n\r\nTo install it just choose the version you want and copy the contents to your game folder.\r\n\r\nObviously it will work on any new game. It will also work if you started the companions quest but haven\\'t done - Proving Honor or The Silver Hand or the Blood\\'s Honor \r\n\r\nThis mod is compatible with pretty much every other mod out there as long as it doesn\\'t modify the CompanionsHousekeepingScript\r\n",
  "categoryId": "25",
  "version": "1.0",
  "author": "Tulib202",
  "createdUnix": "1351950882",
  "updatedUnix": "1351951019",
  "containsAdultContent": false,
  "uploadedBy": "taj202",
  "primaryFile": null,
  "files": [
    {
      "fileId": "97264",
      "name": "slower companions remade",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "33",
      "fileName": "slower companions remade-26401-1-0.zip",
      "uploadedUnix": "1351951019",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e7f418514c61590fa7bd5f2eb8662c58de0a3fd6fd2f164ed1b43228448e7487/analysis/1407247396/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/slower%20companions%20remade-26401-1-0.zip?fid=97264&ttl=1535798492&ri=8192&rs=8192&setec=2ab216b5a485b74a76befff179d3a4c8"
    }
  ]
}