{
  "modId": 26433.0,
  "modName": "Heavy armor perk change",
  "summary": "This mod changes the heavy armor perk tree, by removing 2 perks. the perks removed are fist of steel and cushioned. I have replaced them with 2 new perks that allow a heavy armored warrior to charge in and kill before being killed.",
  "descriptionHtml": "This is a small mod that takes Fists of steel and removes it from the game, replacing it with Heart of Steel. This new perk allows a player to regain health during combat, Heart of Steel has 3 ranks; rank 1: increases health regain by 100% at level 20 heavy armor, rank 2 by 150% at level 30 heavy armor and rank 3 by 200% at level 50 heavy armor. On master difficulty it works great for heavy armored warriors who are constantly having to use restoration, with luck this perk will keep you running until you get in close with the enemy.\r\n\r\nThe second perk in this mod \\\"Triple Rashomon\\\" reduces incoming spell damage by a % each rank, the perk has 3 ranks. the first rank reduces incoming spell damage by 10% at level 50 heavy armor, the second rank reduces spell damage by 25% at level 60 heavy armor and the last rank reduces spell damage by 45% at level 70 heavy armor. Never should a heavy armored warrior be feared by the sight of a \\\"spell caster\\\". get up close and slug them to death with these 2 new perks.\r\n\r\nReflecting blows has been removed and replaced with Art of War, this perk change Reduces enemy critical hit chance by 25%. ",
  "categoryId": "77",
  "version": "2.1",
  "author": "Jamesl609",
  "createdUnix": "1352007986",
  "updatedUnix": "1352496586",
  "containsAdultContent": false,
  "uploadedBy": "Jamesl609",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98333",
      "name": "Heavy armor perk change",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Heart of steel and Triple Rashomon-26433-2-0.rar",
      "uploadedUnix": "1352496586",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/248ff18cbf8f62f13564f0c650c53a06f348a40b2c1fce0094c8d50f05fe6abd/analysis/1407255783/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Heart%20of%20steel%20and%20Triple%20Rashomon-26433-2-0.rar?fid=98333&ttl=1535798546&ri=8192&rs=8192&setec=22adcf85bf258fa8051dc471cc1f5fe8"
    }
  ]
}