{
  "modId": 26439.0,
  "modName": "Khajiit Will Follow",
  "summary": "Adds a trio of khajiit followers to the game, each with their own quest and back story.",
  "descriptionHtml": "[b][u]Update (01/16/2016):\r<br />[/u]\r<br />KWF Change Log[/b]\r<br /> \r<br />-Added optional updated file for download. Changelog listed below:\r<br />\r<br />-Minor changes to Nanak and S’ariq’s appearances. They’re regular fashion models now.\r<br /> \r<br />- Moved followers to a unique voice type and added over 400 lines of voiced dialogue, so no more mute khajiit with default follower voice. \r<br /> \r<br />-The more you talk to your companion, the more new things he’ll have to say, but critically, he will mostly only speak when spoken to\r<br />(I’m looking at you Mjoll).\r<br /> \r<br />-Converted audio to xwm from wav. Mod size reduced by 90% as a result (lol).\r<br /> \r<br />-Fixed permissions with Nanak’s quest so that picking up his book doesn’t count as stealing\r<br /> \r<br /> -Fixed permissions with Bikhai’s quest so that picking up his crumpled note doesn’t\r<br />count as stealing.\r<br /> \r<br />-Bikhai’s locket is no longer considered a quest item after completing his quest.\r<br /> \r<br />-Various fixes and additions to scripts to streamline quests.\r<br /> \r<br />-Fixed faction placement for Gatka-Dar, so bandits should no longer attack her on sight.\r<br /> \r<br />-Don’t make Chatur’jo angry&#33;\r<br />\r<br />____________________________\r<br />Khajiit Will Follow is a mod that adds three new khajiit followers to the game. They each have a quest associated with them along with their own back story. They have custom dialogue as well, but do not have voice actors at the moment. Follower dialogue is the same as any other khajiit follower.\r<br />\r<br />Warrior: Bikhai can be found in the Jorrvaskr Basement in Whiterun. Specializes in 1H, block, archery, heavy armor, and sneak.\r<br />\r<br />Thief: S&#39;ariq can be found in the Riften Jailhouse (some thief he is). Specializes in dual wielding, light armor, and sneak.\r<br />\r<br />Wizard: Nanak can be found in the Bard&#39;s College in Solitude. Specializes in destruction spells (fire, ice, and shock), light armor, and sneak, and has two shouts in his repertoire.\r<br />\r<br />These followers have slight stat modifications and level with the Dragonborn, so they may have a mitigating effect on the difficulty of the game. Balance seems pretty good at the Expert level. Installation is the same as with every mod. First: Do it via NMM. Second, after installing the mod, you will need to make a save and reload that save for the scripts and everything to run correctly.\r<br />\r<br />Let me know what you think&#33; This is my first mod, so a lot of the time I spent was on learning the creation kit. Let me know if you think the followers are too overpowered. I can lower their level/stats accordingly. It&#39;s possible that I have missed some issues in troubleshooting despite my best efforts, so any feedback/bug reports are greatly appreciated. Thanks for looking&#33;\r<br />\r<br />_______________________________________________\r<br />\r<br />Other highly suggested mods:\r<br />\r<br />CoverKhajiit face mod\r<br />CoverEyes mod\r<br />Moonpath to Elsweyr mod\r<br />Khajiit Speak mod (for khajiit Dragonborn only)",
  "categoryId": "66",
  "version": "1.0",
  "author": "robbobert",
  "createdUnix": "1352017610",
  "updatedUnix": "1452997160",
  "containsAdultContent": false,
  "uploadedBy": "robbobert",
  "primaryFile": null,
  "files": [
    {
      "fileId": "97400",
      "name": "Khajiit Will Follow",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28314",
      "fileName": "Khajiit Will Follow-26439-1-0.rar",
      "uploadedUnix": "1352018186",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2c99eb058e3a8f02bfdc888eff529d90cc4cada7caed669e6ca45feb2014f734/analysis/1407248833/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Khajiit%20Will%20Follow-26439-1-0.rar?fid=97400&ttl=1535798563&ri=8192&rs=8192&setec=c4e0c8e27eae0229bcf258e136af9e82"
    },
    {
      "fileId": "1000191702",
      "name": "Khajiit Will Follow 2.0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20862",
      "fileName": "Khajiit Will Follow 2.0-26439-2-0.rar",
      "uploadedUnix": "1452997160",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/285d64c766faf488163562f64b697d0fa68cf46c317687548fea6c3b4c68a93e/analysis/1452997227/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Khajiit%20Will%20Follow%202.0-26439-2-0.rar?fid=1000191702&ttl=1535798563&ri=8192&rs=8192&setec=4018b717891f989dcd506e10973f5753"
    }
  ]
}