{
  "modId": 26455.0,
  "modName": "Halfmoon Tradingpost",
  "summary": "Description:\r<br />If you like a very detailed house mod with lots of amenities for the adventurer hunter type, and if you like seclusion in a central location with a spectacular scenic setting then this is the place for you&#33;\r<br />First you should know that this mod is a conversion of Half Moon Mill by lake Ilinalta and changes the look of the",
  "descriptionHtml": "EDIT: THIS MOD IS NOT COMPATIBLE WITH THE DARK BROTHERHOOD QUESTLINE&#33;\r<br />Console workaround does NOT work. DO NOT USE THIS MOD IF YOU WANT TO PLAY THE DARK BROTHERHOOD QUESTLINE&#33;\r<br />\r<br />NEW Vanilla version added&#33;\r<br />Halfmoon Tradingpost V 1 requires NO &#34;Hearthfires&#34; dlc.\r<br />Changes that were made to 1.2 also apply except of course related to content that is specific to Hearthfires.\r<br />\r<br />Half Moon Trading Post V-1.2 by Kursan\r<br />This version requires the dlc Hearthfires to be installed. \r<br />\r<br />Changelog 1.2:\r<br />Fixed  the seating arrangement around the interior table so that animations don&#39;t get stuck in table.\r<br />Changed entry angle to interior to reduce item scatter upon entry.\r<br />Changed music of interior cell.\r<br />Added more lights around the place by the smelter, the smithy, the oven, the shed, and the mill. This is very useful if you run a weather mod that adds darker nights.\r<br />Removed the brush behind the mill to open the place up a bit. (Discovered by doing so that Hearthfires dlc added a rock quarry to the rockwall behind the mill that was previously hidden by brush).\r<br />Repositioned the targets.\r<br />Added two Corundum ore vain&#39;s to the rock face behind the mill.\r<br />Added some mushroom patches behind the mill.\r<br />Added some shadow flicker to the campfire and the smithy.\r<br />Corrected a typo on a chest.\r<br />\r<br />Description:\r<br />If you like a very detailed house mod with lots of amenities for the adventurer hunter type, and if you like seclusion in a central location with a spectacular scenic setting then this is the place for you&#33;\r<br />First you should know that this mod is a conversion of Half Moon Mill by lake Ilinalta and changes the look of the mill property quite a bit. It also removes a minor quest from the dark brotherhood to kill the occupants of Half Moon Mill since they are no longer present.\r<br />If either of this bothers you then this mod may not be for you...\r<br />\r<br />What you get:\r<br />A single room log cabin by the lake roughly where the old mill house used to be with great detailing all around it. \r<br />Interior: 1 large, 1 small bookshelf, 4 safe storage chests, 10 weapon racks standing and hanging, 3 shield racks, 2 closets, 2 safe food barrels, a cooking place by the chimney, a shrine to Stendarr and divers clutter and decoration.\r<br />\r<br />Exterior: An alchemy station with safe barrel storage, a grindstone, workbench and tanning rack and one more safe chest are on the deck; off the deck additional storage in sacks and barrels,(the barrels that are safe have unique names such as &#34;Ingredients&#34; Meats&#34; etc.) \r<br />One more tanning rack by the butchery shed, and a smelter sits behind the still functioning mill. Added a safe barrel for ore storage by the smelter.\r<br />A forge sits under its own cover between mill and house; added two safe chests by the forge for storing Ingots and crafted items. \r<br />Two chicken nests and a veggie garden are close by the cabin.\r<br />There are lots of decorative details inside and out and also a covered second deck attached to the cabin containing many pelts that hunters dropped there. \r<br />There is a cozy fire pit in front of the cabin by the stream, with two log benches to sit on, a cooking spit and a small hide tent with a hay pile to sleep on. Various Mushrooms and a beehive were added around the cabin.\r<br />Added a flour grindstone to the yard and if you have Heartfire installed you can produce flour with it and now a bread baking Oven was added to the outside of the cabins chimney with a roof over it; its a comunity oven after all :)\r<br />Added another wooden bridge for easier transit between Smelter and Smithy.\r<br />There is a Journal by the previous owner inside the house.\r<br />\r<br />Compatibility, known issues: \r<br />As mentioned in the intro I removed the old mill house and its occupants, this conflicts only with one minor quest given by the dark brotherhood to kill the two residents of Half Moon Mill. If this causes you to be unable to progress to the next quest, simply use the console to complete that quest as follows:\r<br />Hit the ~ key which opens the console then type: completequest DBSideContract04, then hit Enter key and ~ again to close the console. Alternatively you can open the console ~ and type: setstage DBSideContract04 200. This will complete the quest to kill Hern and allows you to move on; the next quest should be &#34;The Silence has been broken&#34;. No other quests or NPC&#39;s should be affected by this mod. \r<br />\r<br />As you approach from down the road you may see the “ghostly” outline of the old house before you are close enough and the new one comes into focus. I do not know how to fix this distant land vision and I actually don&#39;t mind the effect of a “haunted” house appearance. \r<br />\r<br />Installation:\r<br />In Steam Workshop, simply Subscribe and make sure its check box appeared in your load order. (A thumbs up if you like it would be nice:)\r<br />Manual DL: After download to a your desktop open the zip file and copy the esp into your Skyrim Data folder, again make sure the check box in your Data load order is checked for Halfmoon Trading post. \r<br />\r<br />  \r<br />Credit:\r<br />I thank Bethesda for a truly wonderful game world upon which we can expand&#33; \r<br />I like to give much credit to Okiir who&#39;s very atmospheric “Riverwood Hunters cabin” inspired me to make this mod. I have used it as a base model for my cabin but changed the layout to suit what I had envisioned. Several of his ideas from it such as the log benches by the fire and the ambient lighting and smoke inside the cabin, as well as some of his decorative ideas remained.  \r<br />The weapon racks are all done by me but Okiir gets full credit for doing the bookshelves.\r<br />\r<br />Back story:\r<br />I always loved the location of Half Moon Mill by the lake and stream, and I really wanted to live there. I also love a simple log cabin as a house, that is how it started and then the idea grew into making it look like a used, lived in trading post for the many hunters around the lake and surrounding forests. It seems to make allot of sense to have a trading post in a central location where hunters would gather to trade their goods and maintain their gear to avoid the long trek into town  to resupply. \r<br />\r<br />The history of the place is that the Vigilants of Stendarr found out that the occupants of the mill were Vampires that prayed on unsuspecting travelers, (which is true in the game) and so killed them. \r<br />They burned down their house to “purify” the place and buried their bodies behind the house. (The two grave markers sit behind the cabin) The trading post was build by an enterprising Nord, who never returned from an adventure and so the house and mill were left for other adventurers (you) to move in.\r<br />\r<br />Future plans for the Trading post:\r<br />Perhaps will add a small quest to find the missing hunter that build the Trading post.\r<br />I hope to add some features from “Heartfire” such as a baking oven. (Done&#33;)\r<br />If I can ever figure it out I would love to have Kajit traders show up randomly at the Trade post and also random Hunters. If you can give me a tip on how to do this or would like to make that addition yourself I would be very happy and grateful as long as credit is given where it is due.\r<br />I do NOT plan to add mannequins and display cases to the house as they would not fit in size and character. \r<br />\r<br />Thanks for downloading and hope you enjoy the place as I do.\r<br />",
  "categoryId": "67",
  "version": "1.2",
  "author": "Kursan ",
  "createdUnix": "1352044444",
  "updatedUnix": "1352674112",
  "containsAdultContent": false,
  "uploadedBy": "Kursan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98888",
      "name": "Halfmoon Tradingpost ",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "87",
      "fileName": "Halfmoon Tradingpost -26455-1-2.zip",
      "uploadedUnix": "1352667667",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/0d7280f5bbef6da34c8c8638fcaf7665677fc8aaa673e790022e96dea1f5c36c/analysis/1407259210/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Halfmoon%20Tradingpost%20-26455-1-2.zip?fid=98888&ttl=1535798589&ri=8192&rs=8192&setec=4f08ffeb8aaea7eb38bf4f92adb36176"
    },
    {
      "fileId": "98908",
      "name": "Vanilla Halfmoon Tradingpost",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "51",
      "fileName": "Vanilla Halfmoon Tradingpost-26455-1.zip",
      "uploadedUnix": "1352674112",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/f48378b9169187ee8d580000dfb4715c8eba49b929276c37abee24c9169a39ab/analysis/1407259366/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vanilla%20Halfmoon%20Tradingpost-26455-1.zip?fid=98908&ttl=1535798590&ri=8192&rs=8192&setec=d5b71cbd7faea3cec96e1b894a4f6ecf"
    }
  ]
}