{
  "modId": 26465.0,
  "modName": "Revenge of Dagoth Ur",
  "summary": "Dagoth Ur has returned to Tamriel. Can you stop him?",
  "descriptionHtml": "Take on Dagoth Ur and the Sixth House in this small Quest. Dagoth Ur was the Dunmer Devil of the Tribunal faith in Morrowind. He along with Vivec, Almalexia and Sotha Sil Tapped into the power of the heart of Lorkhan(the heart of a dead god) to make themselves gods, Dagoth Ur infused some part of his being with the heart meaning whenever he was killed he was revived again at the heart of Lorkhan. With his power he created 7 brothers the Ash Vampires who were also revived at the heart over time after they were slain and were Dagoth Ur&#39;s Generals. Dagoth Ur created the blight a disease which turned living things into his deformed slaves. Being a great sorcerer Dagoth Ur could also send dreams into the minds of the people of Morrowind and drive them mad turning them into his servants. Dagoth Ur wanted to drive all the non dumner races from Morrowind and reclaim it for the Dunmer and then take all of Tamriel. Dagoth Ur was destroyed by the Nereverine(a Dark Elf hero) and the heart was thought to be destroyed. Until now.... \r<br />\r<br />To start the quest talk to the Messenger of Azura in the Bannered Mare in Whiterun. This mod also adds a dreamer to each city/town in Skyrim(easiest one to find is just outside the Drunken Huntsman in Whiterun). The mod is recommended for high level characters. Dagoth Ur has some dialogue so you may want to talk with him before fighting him.\r<br />\r<br />Installation:   Unpack, Copy and paste all to Data folder, check Revenge of Dagoth Ur in data files and play.\r<br />\r<br />Requires dawnguard \r<br />\r<br />Cleaned with TES5Edit\r<br />\r<br />I have to give some thanks to ghosu who tutored me a bit on Nifskope and IsharaMeradin for help with scripting.\r<br />\r<br />V1.2: Added the missing textures for the Sixth House Banners I apparently forgot.\r<br />\r<br />V1.3: Vastly improved the textures of SkinnedHound and Cultist \r<br />\r<br />V1.4: Added Dagoth Ur&#39;s disembodied voice to the dungeon and gave him some custom sounds\r<br />\r<br />V1.5: Souped up Dagoth Ur, Added some clutter and the artifact Sunder(see if you can find it).\r<br />\r<br />V1.6: Added speech when Dagoth Ur kills the player and added a 3rd disembodied voice speech to the dungeon.\r<br />\r<br />V2.0: Added custom armor for Dagoth Ur, Increased his muscle mass and added new abilities. Added voice file for when Dagoth Ur is victorius\r<br />\r<br />v2.1: Fixed bug where Dagoth Ur was attacking using hand to hand. Now he fights with his spells as was originally intended.\r<br />\r<br />V3: Improved Dagoth Ur Model, added voice acting, redone and expanded quest, added new dungeon with miniboss, new monsters and added Wraithguard.\r<br />\r<br />V3.1: Fixed bug where messenger of Azura wouldn&#39;t talk or give reward at end of quest\r<br />\r<br />Thanks to the amazing work of SolarTails all bugs have now been fixed by her. Thanks&#33; Heres what she did:\r<br />\r<br />V3.2:   - Quest markers now properly show where you need to go\r<br />\r<br />- Unhazaal no longer should cause any crashing (least it works for me now)\r<br />\r<br />(both these fixes were due to NavMesh errors. I rebuilt the navmeshing in each level from scratch and elimited all errors that both the Creation Kit&#39;s error check and TES5Edit could find)\r<br />\r<br /> \r<br />\r<br />- Dialog for all Actors was better organized some to eliminate the pause between words at break point. Same dialog, it just flows better now with no noticable breaks in longer topics.\r<br />\r<br />- Dreamer&#39;s greet you with thier &#34;I am a dreamer..&#34; line instead of the default Dark Elf greeting\r<br />- Azura&#39;s Messenger initially greets you with her greeting, rather than the default Dark Elf greeting\r<br />\r<br />(both above tweaks were to reduce or eliminate the use default game voices. So they don&#39;t sound like they have two voices)\r<br />\r<br /> \r<br />\r<br />- I gave the Messenger of Azura a name to make her feel less generic and like an actual person. Iverelle Savidri. I appologise for taking that liberty, and feel free to rename or change her back if you like.\r<br />\r<br />- I made Ash Altars into actvators, so I could attach an Ambiant sound to them. So now the Sixth House whispering sound eminates from these statues, and eliminates the need for a script\r<br />\r<br />- Merged a couple of scripts, such as Dagoth Ur&#39;s OnHit and OnDeath scripts, as well as made a universal Whisper script for the dungeons where Dagoth Ur or Vanis whispers to you. So now one script for all of these whisper instances, rather than one for each.\r<br />\r<br />- To help avoid potential conflicts with other mods, I added the prefix RoDU (Revenge of Dagoth U) before the FormIDs in the Kit, as well as put a lot of the data files in &#34;dagoth&#34; sub folders. Just a bit of file organizing\r<br />\r<br />- I tweaked some of the models as well, to fix some minor, but potential stability bugs. (I used to crash when mousing over the Ash Statue in inventory randomly, for example), but they should all be good now.\r<br />\r<br />- Removed the need for several items in the creation kit, such as the custom triggers for the Dagoth whispers. These triggers now use the default triggers in the creation kit, and point toward the appropriate scripts. Also removed the need to define the Sixth House robes texture in the creation kit, but directly applying them to the robe models themselves.\r<br />\r<br />VOICE ACTING:\r<br />\r<br />Dagoth Ur & Dreamers:   Jeremy King (Vulon) Skyrim Nexus\r<br />Dagoth Vanis:                Michael Rogel (Skull One) Voice Actors Alliance Forums\r<br />Messenger of Azura:       Holly Lindin Voice Actors Alliance Forums",
  "categoryId": "35",
  "version": "3.2",
  "author": "Morrowind1979",
  "createdUnix": "1352051731",
  "updatedUnix": "1403131001",
  "containsAdultContent": false,
  "uploadedBy": "morrowind1979",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000113516",
      "name": "Revenge of Dagoth Ur",
      "version": "3.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35350",
      "fileName": "Revenge of Dagoth Ur-26465-3-2.rar",
      "uploadedUnix": "1403131001",
      "modVersion": "3.2",
      "virusScanUrl": "https://www.virustotal.com/file/346b7be35c768a26cf5b2691b2051d821d8b31fadd2e246ebbedfa1fc9307e52/analysis/1408132597/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Revenge%20of%20Dagoth%20Ur-26465-3-2.rar?fid=1000113516&ttl=1535798606&ri=8192&rs=8192&setec=72119d511d3d931ac821b814ebc3bc38"
    }
  ]
}