{
  "modId": 26478.0,
  "modName": "Erys",
  "summary": "Adorable half-Bosmer, half-Breton save, with a nightmarish past. Come and read her story...",
  "descriptionHtml": "[center]\r\n[url=http://www.youtube.com/user/Demidekidasu][IMG]http://www.massey.ac.nz/massey/fms/Massey%20News/site-images/icons/social-media/youtube-icon.png[/IMG][/url][url=https://twitter.com/Demidekidasu][IMG]http://www.kellilampkin.com/wp-content/plugins/wp-greet-box/images/twitter_icon.png[/IMG][/url]\r\n\r\n[IMG]http://i1152.photobucket.com/albums/p492/Demidekidasu/Profile.jpg[/IMG]\r\n---------------------------------------------------------------\r\n[/center]\r\n[b][u]ERYS\\' STORY[/u][/b]\r\n[i]Erys was born into a confusing world for a child. Her mother, a Breton herbalist named Galyws, was of a very pious nature, spending most of her time in worship of the Divines. In contrast, her father, a proud Bosmer named Ehil, was a follower of the Daedric Prince Hircine and earned a living by hunting game in the forests surrounding the City of Chorrol. This led to much conflict between her parents, with Erys often torn between them.\r\n\r\nHer mother taught Erys the skills of herbalism, and her father taught her the ways of the hunt. This was a dangerous education for such a frustrated and confused child.\r\n\r\nA single foolish act was to be the defining moment in Erys\\' life.\r\n\r\nWhen she was 15, Erys caught her father spending time with another woman. Furious, Erys followed her into the forest and shot a poisoned arrow into the woman\\'s stomach. She then dragged the woman\\'s body to a secluded spot her father often visited, knowing her father would find the body.\r\n\r\nA few days later, her father was overcome with grief and committed suicide. Her mother soon lost grip of reality due to the deep sorrow in her heart, and wondered off into the forest one night, never to be seen again. Erys knew it was all her fault, and cried herself to sleep every night, begging the Divines to undo what she had done. But the Divines did not answer.\r\n\r\nErys eventually fled to the Imperial City and spent her time amongst beggars, learning how to pick the pockets of rich folk in order to survive. This often got her into trouble with the law, and she spent much time in jail - her burning hatred for the world often leading to attempted escapes, sometimes successful, just to spite those who locked her up.\r\n\r\nOne day, she was noticed by a wealthy Elf who invited her to his house for dinner. Erys was resistant at first, but eventually relented. Sadly, this was not the happy ending it could have been for Erys. The man had lied to Erys, and she was knocked unconscious as she entered his house.\r\n\r\nShe awoke in a cold, poorly-lit dungeon, naked and chained to a wall. Several other girls were in the dungeon with her, some clearly fairing not well at all, with bruises and other injuries visible all over their abused bodies.\r\n\r\nThis is the end, Erys thought. She lost track of how long she spent in that dungeon - although she knew it was several years. Erys soon began to wonder if this was her punishment.\r\n\r\nOne day, she worked out how to free herself from the shackles. But she was not content with merely escaping. She wanted to kill the man who had done this to her.\r\n\r\nShe waited for him to visit her.\r\n\r\nWhen he came close, she pounced onto him and forced her thumbs into his throat. He gargled blood for a moment before he died, and she looked into his horror-stricken eyes, grinning at him in the most sinister way.\r\n\r\nAfter freeing the other girls, she collapsed onto the floor and cried until she vomited. One girl stayed behind to comfort Erys, and invited her north to her homeland, Skyrim.\r\n\r\nThe girl, who never told Erys her name, succumbed to illness and died before they reached the border. Erys buried her in an unmarked grave amongst a patch of pretty flowers, and continued north, leaving her nightmarish past behind her...[/i]\r\n\r\n\r\n[b][u]MODS YOU WILL NEED[/u][/b]\r\n[i][u]DIMONIZED UNP female body by dimon99[/u][/i]\r\n(\\\"UNP BASE Main body V1dot2\\\" and \\\"DIMface2\\\")\r\nhttp://skyrim.nexusmods.com/mods/6709\r\n\r\n[i][u]Lovely Hairstyles by sn00p[/u][/i]\r\nhttp://skyrim.nexusmods.com/mods/7403\r\n\r\n[i][u]Natural Eyes by nevenbridge[/u][/i]\r\nhttp://skyrim.nexusmods.com/mods/3589\r\n\r\n[s][i][u]Improved Freckles Skyrim by missjennabee[/u][/i]\r\nhttp://skyrim.nexusmods.com/mods/16147[/s]\r\n(Mod has been set to \\\"hidden\\\" as there is a major issue with it. You don\\'t actually need it, she just won\\'t have the freckles.)\r\n\r\nPlease make sure to endorse those files. The mod authors really deserve it for their fantastic work :)\r\n\r\n\r\n[b][u]NOTES[/u][/b]\r\n[i]This save is a level 7 female Wood Elf character, with skills focusing on stealth and archery. She is quite short (scale 0.85) to reflect her young age (somewhere between 16 and 20 - she doesn\\'t even know herself due to her ordeal!), so you may need to compensate for reduced jump height with console commands.\r\n\r\nA couple of quests have been done already, but the main quest has not yet been started. Whiterun has been visited, some stuff has been bought and sold, a couple of dungeons have been explored, but that is about all!\r\n\r\nYou might receive warnings for mod dependency when you first load the save - just ignore, they are not crucial to this character, assuming it does not mean you are missing one or more of the above mods!\r\n\r\nI recommend you type \\\"refini\\\" into the command console when you first load the save.[/i]\r\n\r\n\r\n[u][b]SOME OF MY OTHER MODS[/b][/u]\r\n- [URL=http://skyrim.nexusmods.com/mods/19841]LIAT - Lively Inns and Taverns[/url]\r\n- [URL=http://skyrim.nexusmods.com/mods/27807]Millview - A lovingly Crafted Player Home[/url]\r\n- [URL=http://skyrim.nexusmods.com/mods/23216]Bard\\'s Lute[/url]\r\n- [URL=http://skyrim.nexusmods.com/mods/27975/]Custom Music In Your House[/url]\r\n- [URL=http://skyrim.nexusmods.com/mods/26589]Passtime[/url] (alpha test)\r\n- [URL=http://forums.nexusmods.com/index.php?showtopic=832425]LTC - Lively Towns and Cities[/url] (coming soon!)",
  "categoryId": "43",
  "version": "1.0",
  "author": "DemiDekiDasu",
  "createdUnix": "1352061176",
  "updatedUnix": "1352061327",
  "containsAdultContent": false,
  "uploadedBy": "demidekidasu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "97528",
      "name": "Erys",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1498",
      "fileName": "Erys-26478-1-0.zip",
      "uploadedUnix": "1352061327",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7ee4173f69d166d39581ef44f48f8ab680760f3c56deb61ba07f8bc1ca920899/analysis/1407249605/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Erys-26478-1-0.zip?fid=97528&ttl=1535798623&ri=8192&rs=8192&setec=f4b41b2cb65184db35cb7ad06abca3f0"
    }
  ]
}