{
  "modId": 26480.0,
  "modName": "AFC - Accommodations for Companions - Old Veste - Alte Veste - English and German",
  "summary": "ENGLISH\r\n\r\nAFC\\'s goal, houses and accommodation for attendants in\r\nThe world of Skyrim insert. Many complain that they have little room to accommodate their attendants. Well, that changes with AFC.\r\n\r\nThese dwellings and accommodations are only suitable for companion, of course you can also stay there yourself, only one finds only the bare necessi",
  "descriptionHtml": "ENGLISH\r\n\r\nAFC\\'s goal, houses and accommodation for attendants in\r\nThe world of Skyrim insert. Many complain that they have little room to accommodate their attendants. Well, that changes with AFC.\r\n\r\nThese dwellings and accommodations are only suitable for companion, of course you can also stay there yourself, only one finds only the bare necessities. What seem to be sufficient for all companion. Furthermore, your can in these dwellings and accommodations your horses, or the horses euerer companion \\\"Parking\\\". It was also thought that you put your coaches still can. Plenty of space is available repays to accommodate your companions.\r\n\r\nOld Veste\r\n\r\nThe old fortress was once a great bastion, but it was destroyed in the last great war of the dragons.\r\n\r\nSometime over the centuries it was rebuilt, but now she is leaving.\r\n\r\nNow you can use this old fortress and quartered your companions. There is enough space there. It is also a great Trainigsbereich and a forge for your crew members.\r\n\r\nHave fun with my modification.\r\n\r\nGERMAN\r\n\r\nGERMAN\r\n\r\nAFC (Accommodations for Companions) setzt sich zum Ziel, Behausungen und Unterkünfte für Begleiter in die Welt von Skyrim einzufügen. Viele Beklagen sich, dass sie kaum Platz haben, ihre Begleiter unterzubringen. Nun, das ändert sich mit AFC. \r\n\r\nDiese Behausungen und Unterkünfte sind nur für Begleiter geeignet, natürlich kann man sich dort auch selbst aufhalten, nur findet man dort das Allernötigste. Was für alle Begleiter ausreichen zu scheinen ist.\r\n\r\nDesweiteren könnt Ihr auch in diesen Behausungen und Unterkünfte eure Pferde, bzw, die Pferde eurer Begleiter \\\"Parken\\\". Auch wurde daran gedacht, dass Ihr eure Kutschen auch noch unterbringen könnt. Viel Platz ist aufjedenfall vorhanden, um eure Begleiter unterzubringen.\r\n\r\nAlte Veste\r\n\r\nDie alte Veste war einst ein großes Bollwerk, doch sie wurde im letzten großen Krieg der Drachen zerstört. \r\n\r\nIrgendwann im Laufe der Jahrhunderte wurde sie wieder aufgebaut, doch nun ist sie verlassen. \r\n\r\nNun könnt ihr diese alte Festung nutzen und eure Begleiter einquartieren. Es ist genügend Platz da. Es ist auch ein großer Trainigsbereich sowie eine Schmiede für eure Begleiter vorhanden.\r\n\r\nNun viel Spaß mit meiner Modifikation.",
  "categoryId": "66",
  "version": "1.0",
  "author": "ChrisDiCesare aka Assassinehdr95",
  "createdUnix": "1352062074",
  "updatedUnix": "1352062166",
  "containsAdultContent": false,
  "uploadedBy": "Assassine hdr95",
  "primaryFile": null,
  "files": [
    {
      "fileId": "97533",
      "name": "AFC Alte Veste DV",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30",
      "fileName": "AFC Alte Veste DV-26480-1-0.rar",
      "uploadedUnix": "1352062140",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fdf522b1cd07a7908ccf4b7ae0a18ac34aae4d78a0d21d29e04d9b166476319a/analysis/1407249677/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AFC%20Alte%20Veste%20DV-26480-1-0.rar?fid=97533&ttl=1535798628&ri=8192&rs=8192&setec=581b82538dc2d4c5c2bcb36ef264f33c"
    },
    {
      "fileId": "97535",
      "name": "AFC Old Veste EV",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30",
      "fileName": "AFC Old Veste EV-26480-1-0.rar",
      "uploadedUnix": "1352062166",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9f41b73d82b4ec15e95fdc617f618e1919a1bbcdc6cc8c58b2e6c8fff572a213/analysis/1407249678/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AFC%20Old%20Veste%20EV-26480-1-0.rar?fid=97535&ttl=1535798628&ri=8192&rs=8192&setec=933fba34fb691b22e972b41f6b541288"
    }
  ]
}