{
  "modId": 26497.0,
  "modName": "Skyrim Ultimate Vanilla Save Set",
  "summary": "This is a set of six Vanilla Saves for Skyrim throughout the beginning of the game.",
  "descriptionHtml": "[b][U]DISCLAIMER[/U][/b]\r\nIf you have not played Skyrim before please note that the descriptions below may contain spoilers from the first few hours of the game.\r\n\r\n[b]These Save Files are from Skyrim Patch 1.8 and may not load correctly on earlier versions![/b]\r\n\r\n[b][U]WHAT IS THIS?[/U][/b]\r\nThis is a single file that contains six vanilla save files from various points early in the game, ranging from character creation to after speaking with the Greybeards. The character is an Imperial Female.\r\n\r\nThese saves files are 100% from vanilla Skyrim. Absolutely no mods were used, not even official mods like the official texture pack, Dawnguard, or Hearthfire. Absolutely no textures, tweaks, SKSE, console commands - ABSOLUTELY NOTHING! Only Skyrim. That\\'s it.\r\n\r\n[b][U]WHY?[/U][/b]\r\nIf you\\'re like me, you have restarted your game a dozen times or more after trying several different mods, perhaps due to crashes, freezes, and other common mod related issues. Which means you are sick and tired of the beginning parts of the game such as escaping Helgen, retrieving the claw from Bleak Falls Barrow, the first dragon fight near Whiterun, and climbing the 7000 steps to answer the summons of the Greybeards. The save files will allow you to pick up your game around any of these events and jump right in without worrying because these are clean vanilla saves.\r\n\r\n[b][U]WHAT DOES THE FILE INCLUDE?[/U][/b]\r\nBelow I have outlined in detail what each of the saves contain, but first some general notes.\r\n\r\nI have tried to focus on the main quest only so I have avoided most everything possible so you can explore it for yourself. I have not leveled up the character, which means you can easily use the [i]showracemenu[/i] command in the console to modify your character without losing anything, or potentially damaging your character\\'s stats. I have tried to be thorough in the events I did play through so you don\\'t have to worry that I missed anything valuable. I gathered all the money, ingredients, potions, and worthwhile weapons/armors etc. I found along the way, but did not deviate from the main quest to start any optional quests or obtain any items. \r\n\r\n[b]SAVE FILES INCLUDED[/b]\r\n01 CHARACTER CREATION - At the very beginning of the game. Will start directly at Character Creation.\r\n02 RETRIEVED THE CLAW - At Riverwood, right after completing Bleak Falls Barrow and returning the claw.\r\n03 BEFORE FIRST DRAGON FIGHT - At Whiterun, just before the first Dragon fight.\r\n04 AFTER FIRST DRAGON FIGHT - At Dragon\\'s Reach after defeating the first dragon, obtaining the first shout, and speaking with the Jarl.\r\n05 HIGH HROTHGAR - At High Hrothgar for the first time, just after climbing the 7000 steps.\r\n06 AFTER SPEAKING WITH GREYBEARDS - At High Hrothgar, after speaking with the Greybeards and learning the Whirlwind Sprint shout.\r\n\r\n\r\n[b][U]IMPORTANT NOTE[/U][/b]\r\nIn order to pass through the early parts of the game as quickly as possible without exploring too much of the game, these save files are all set on NOVICE difficulty. Please REMEMBER to adjust your difficulty settings after loading these saves to suite your preference.\r\n\r\n\r\n[b][U]INSTALL[/U][/b]\r\nSimply drop the files in the folder where your Skyrim Saves are located, usually at ...\\\\Documents\\\\My Games\\\\Skyrim\r\n",
  "categoryId": "43",
  "version": "1.0",
  "author": "Merkhava",
  "createdUnix": "1352081006",
  "updatedUnix": "1352081089",
  "containsAdultContent": false,
  "uploadedBy": "Merkhava",
  "primaryFile": null,
  "files": [
    {
      "fileId": "97585",
      "name": "Skyrim Ultimate Vanilla Saves",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8782",
      "fileName": "Skyrim Ultimate Vanilla Saves-26497-1-0.zip",
      "uploadedUnix": "1352081089",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0184088f7c5a693cee24d1327da47a0a5da3306aff29c819f6fa9bb59f788c94/analysis/1407250146/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Ultimate%20Vanilla%20Saves-26497-1-0.zip?fid=97585&ttl=1535798665&ri=8192&rs=8192&setec=1a594817fa201fc3cbb3de64cafb49a5"
    }
  ]
}