{
  "modId": 26500.0,
  "modName": "Build Your Own Home - TRADUZIDO PORTUGUES - BR",
  "summary": "TRADUÇÃO COMPLETA",
  "descriptionHtml": "Construa sua própria casa!\r\n\r\n\r\nSim isso é certo! Você constrói a casa! Você constrói a casa como quiser! A casa é totalmente modular! Adicione o que você gosta e remover o que você odeia!\r\n\r\nQuer um pequeno barraco simples localizado por um rio bonito? Você tem isso!\r\nQuer uma casa de dois andares com um quarto e uma pequena fazenda fora? Construí-lo!\r\nQuer uma pequena fortaleza, com jardins, Smithys, tannerys e muito mais? Vá em frente!\r\n\r\nÉ a sua casa, construí-lo como você escolhe!\r\n\r\nPersonalizá-lo!\r\n\r\n\r\nDecore sua casa para refletir VOCÊ! Você é um indivíduo único, com um estilo de jogo único! Construa sua casa para refletir!\r\n\r\nEscolha um dos quatro \\\\\\\"Temas\\\\\\\" para decorar a sua casa, estes temas podem ser misturados e combinados para \\\\\\\"híbridos\\\\\\\" projetos. Você é um assistente de estudar o arcano? A vida ao ar livre caçador? A vida em reclusão ladrão? Misturá-los à vontade! Sua casa reflete você! Mais informações sobre projetos abaixo (imagens de fantasia!)\r\n\r\nTambém está disponível um covil escondido que pode refletir lobisomens ou vampiros! Sua escolha!\r\n\r\nIntrodução!\r\n\r\n\r\nVocê constrói a casa! Ir reunir os materiais! Mantenha à mão um machado e uma picareta ao seu lado, finalmente\r\nvocê tem razão para ir lá e coletar material!\r\n\r\nA casa situa-se fora da prisão abandonada, em Shack Lucky. Confira as imagens se você não sabe o que eu estou falando. Rápida viagem para a prisão abandonado e você não pode perder a casa, o seu direito acima do rio. Se você nunca foi para a prisão abandonada, a sua essentially à direita na bifurcação na estrada entre Riften, Windhelm, e Whiterun. Viagens de Whiterun para Riften e depois de passar a torre bandido chegar a uma estrada sinuosa precipício, então uma ponte. Quando você alcançar a ponte que você fez para a casa.\r\n\r\nUma vez lá, não deixe de pegar Jornal de Lucky dentro do galpão (convenient!), onde você também pode\r\narmazenar todos os seus materiais de construção. Na revista Lucky que retrata seus planos para a casa, para que você\r\nsaber quais os materiais para recolher! Para iniciar a construção encontrar a bancada com a ação sobre ele, e usá-lo! (Siga as imagens!)\r\n\r\nQuestões comuns!\r\n\r\n\r\nP. Minha bancada não vai funcionar!\r\n\r\nA. Você precisa Skyrim versão 1.6.\r\nVocê não pode estar em combate. (<- Isso inclui Seguidores Às vezes você não pode estar em combate, mas marcas de seu seguidor você como em combate.).\r\nVocê precisa de uma cópia legal.\r\n\r\nSe até mesmo um dos que não é cumprida, isso não vai funcionar. Fixar um deles.\r\n\r\nP. CTD ao entrar na casa!\r\n\r\nA. Você tem o Fix Script velho Vanilla Mannequin, vá buscar o novo!\r\n\r\nP. O meu livro não tem tudo!?\r\n\r\nA. Ele faz, continue virando as páginas. Há uma página em branco de vez em quando para manter o livro à procura direito. Tudo está no livro.\r\n\r\nP. Há coelhos em minha casa!?! E uma raposa!?!\r\n\r\nA. Você queria um certo animal de estimação? Não gosta deles? Mate-D:\r\n\r\nQ. Ele diz que eu não tenho material suficiente, mas eles estão no barril!\r\n\r\nA. O barril está lá apenas para facilitar o armazenamento, você precisa ter os materiais em sua pessoa: p\r\n\r\nQ. Ele diz que eu não tenho material suficiente, mas eu faço! Duas vezes verificado!\r\n\r\nA. Para o lugar do fogo: Você precisa de minério de ferro, não lingotes. Para qualquer coisa usando \\\\\\\"Deer Esconder\\\\\\\" Você precisa ter certeza de esconder seu veado veio de um alce! Seus veados esconder ELK!\r\n\r\nQ. Eu não posso alimentar na cara dormindo?!\r\n\r\nA. socá-lo, eu não sei por que isso acontece, mas socá-lo sempre resolve-lo para mim, ele willl ignorar o gesto e continuar a dormir. Isso agora também é um problema em Dawnguard, pelo que a sua, obviamente, até Bethesda para corrigir isso. Por agora, os punhos vai fazer.\r\n\r\nP. CTD aqui ou ali, o quê?\r\n\r\nA. Este mod é muito limpo, um monte de outros mods não são. Você pode ter que encaminhá-los para fora e tentar desativar alguns mods que você possa ter. Se você tem um CTD, não há nenhuma maneira clara de resolver isso do que você tomar o tempo para ajustar a sua ordem de carga mod ou verificar conflitos. Desculpe dizer, mas é apenas isso.\r\n\r\nP. Pode minha esposa mora aqui?\r\n\r\nA. Tentando cônjuges a viver em uma casa modded não é realmente fácil de fazer, e vai ultimitely conflito com qualquer outro mod que tenta fazer o mesmo. A sua não é prático até mesmo para tentar, em vez usar este mod:\r\n\r\nEsposos podem viver em qualquer lugar\r\n\r\nSeu melhor do que o sistema de baunilha. Obtê-lo.\r\n\r\nP. Por que há cabeças lobisomem na minha den lobisomem?\r\n\r\nLobisomens A. são abertamente hostis para com o outro, e Hircine diz-lhes para matar um ao outro o suficiente para que faça sentido. Esses lobisomens pobres não estavam em sua mochila.\r\n\r\nP. Por que não há tema Guerreiro?\r\n\r\nA. eu lhe darei tal uma pitada.\r\n\r\nQ. Eu sou um vampiro Belua e santuários me machucar! Ouch!\r\n\r\nIr longe de santuários\r\n\r\nBeluaDisableShrineDamage tipo definido como um\r\n\r\nviajar através de algumas células\r\n\r\nVolte para casa: D\r\n\r\nP. O meu coto é roxo>: O\r\n\r\nA. Isso é um problema com o pacote de textura de baunilha HD não, o meu problema: p\r\n\r\n\r\n\r\nPOST ORIGINAL:    http://skyrim.nexusmods.com/mods/18480#content\r\n\r\n\r\n\r\n\r\nCRÉDITOS:\r\n\r\nAUTORIA: by Supernastypants\r\nTRADUÇÃO: by Liatec",
  "categoryId": "67",
  "version": "1.82",
  "author": "Liatec",
  "createdUnix": "1352092324",
  "updatedUnix": "1352092784",
  "containsAdultContent": false,
  "uploadedBy": "liatec",
  "primaryFile": null,
  "files": [
    {
      "fileId": "97597",
      "name": "Build Your Own Home Version TRADUZIDO PORTUGUES-BR",
      "version": "1.82",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11018",
      "fileName": "Build Your Own Home Version TRADUZIDO PORTUGUES-BR-26500-1-82.rar",
      "uploadedUnix": "1352092784",
      "modVersion": "1.82",
      "virusScanUrl": "https://www.virustotal.com/file/1b9ebfc4f353be17a3846fc05e8d7d9689b30cc481eceb04c85d8f3a1a277a69/analysis/1407250210/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Build%20Your%20Own%20Home%20Version%20TRADUZIDO%20PORTUGUES-BR-26500-1-82.rar?fid=97597&ttl=1535798669&ri=8192&rs=8192&setec=5e39289d0bf6018f6fa06a0be320b47e"
    }
  ]
}