{
  "modId": 26524.0,
  "modName": "Breezehome Make Over",
  "summary": "",
  "descriptionHtml": "SPOILER ALERT:\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nDo you feel like you got short changed when you purchased Breezehome? You save the city from a Dragon, and the Jarl allows you to purchase a house with holes in the roof, paint coming off the walls and a fire pit you can accidentally walk into. Well i felt after becoming \\\"Thane of Whiterun\\\" you were rewarded with crap. No this mod does not have a super underground basement or 20 extra rooms that do not fit with the actual size of the house. This is a simple yet elegant mod fit for your title. I replaced the walls and some of the furniture in the house to make this house a home you would want to play through out the game with. I did not fill it with a ton of clutter either. I tried to keep the house as clean and clutter free as possible while giving it a nicer look. I added 1 mannequin to the house cause i feel it should have one, and a couple extra weapon plaques, and 1 extra weapon rack. I kept the original bookshelves in the house also while just replacing the original furniture with upper class furniture. No i did not add a smelter, anvil, tanning rack, grind stone, or workbench. Don\\'t be lazy lol there is a blacksmith right next door.\r\n\r\nREQUIREMENTS: \r\n\r\nMake sure you purchase Breezehome with all the furnishings before installing this mod. \r\n\r\n\r\nNOTES:\r\n\r\nFor some odd reason the original cupboard in the back of the house still likes to appear in the house even though i replaced it. Same thing with the shield plaque in the master bedroom. It really is not noticeable until you take a good look at it. You can open up the console click it and disable it. \r\nI would not recommend switching the alchemy lab into a child\\'s bedroom cause it can break this mod.\r\nIf you are currently using Breezehome I recommend you take all your belongings out of the house before installing the the mod.\r\nLydia seems to be working fine in the Breezehome Make Over. If you notice any issues with the mod please feel free to leave a comment and i will try to correct it. I did my best not to have any lighting clipping issues also so it is CLIP FREE =D.\r\n\r\nInstallation:\r\n\r\nJust drag on drop the Breezehome Make Over.esp into your Data folder.\r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "Supra2061",
  "createdUnix": "1352145071",
  "updatedUnix": "1352145173",
  "containsAdultContent": false,
  "uploadedBy": "Supra2061",
  "primaryFile": null,
  "files": [
    {
      "fileId": "97663",
      "name": "Breeze Home Make Over",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Breeze Home Make Over-26524-1-0.zip",
      "uploadedUnix": "1352145173",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b71494f647c77877d75764d40ef792cccf6a6c0bf8d2560bd3090a6a5529d191/analysis/1407250807/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breeze%20Home%20Make%20Over-26524-1-0.zip?fid=97663&ttl=1535798700&ri=8192&rs=8192&setec=720b137a1e4249eb9ad6d8e0841bc294"
    }
  ]
}