{
  "modId": 26520.0,
  "modName": "RealisticWeaponsAndArmour",
  "summary": "Changes I made to the most common Weapons, Shields and Armour in the Game (Iron, Steel, Orcish etc...) making them more realistic concerning damage and protection. Not at all classes refined, will be soon, this is yet a complete alphaVersion. Works very well with Borgut1337 \\\\\\\"Realistic Combat Mod\\\\\\\" and \\\"Locational Damage\\\" by Khamul78\r\n",
  "descriptionHtml": "What is this mod about?\r\n\r\nIncreased damage to all non quest or \\\"special\\\"-weapons, meaning steel, iron etc. . Higher protection from different armor. Dwarven and ebony the highest, leather and simple clothing very low. \r\nYou must learn to time your attacks and not get hit by arrows, or learn to block them off. Very hard to play for people specialized on twohanded, easy to play for stealth players with arrows (although 3 times arrowdamage i intend to turn off for this mod, for the purpose of realism, instead one should learn to aim for the head if sneaking already, and this without HUD...), but it will be balanced anyway. People with shields are adviced to crouch and block arrows or evade and learn to time their one handed strikes on enemies. \r\nStill there is a lot of work and this is just the beginning.\r\n\r\nIs not compatible with any mod that changes weapondmg or armorpoints in any way.\r\n\r\nWhat I am happy with in this mod for the Moment:\r\n\r\na) The damage arrows blocked by the shield cause are almost irrelevant as in reality.\r\n(but if hit anywhere else, even in the arm or legs is always deadly, although this should work together with kahmul78s mod)\r\n\r\nb)Two handed swords are almost always deadly\r\n\r\nThings that need to be worked on:\r\n\r\na)The Perk System and its effects, making the damage that is takeable unrealistic, either being to much or to little... (basically having too much of an impact, so that f.e. some characters with a higher lvl can take multiple arrows to the head only because of their heavy armour abilities...)\r\n\r\nSo many other things...\r\n\r\nSo for example:\r\n\r\nTwo handed swords: carrying, training, fighting.\r\n\r\nYou will have to be able to carry a weapon in battle first (mybe this will be a perk, which will also go hand in hand with other possibilities you gain from this perk, maybe a fitting name could be \\\"strength\\\" or smth similar).\r\nOnce you can do this with a twohanded sw. you are only able to make simple moves like left and right slice, but no effective turnarounds or 360 degree swings. (ideally this would bring you sometimes out of balance or most likely if you hit the enemies shield, would make you loose your weapon or loose balance again. or your lucky and nothing happens, enemy looses shield etc...), but the main thing is, you make little dmg.\r\nTo be able to make effective and strong hits you must hit either a trainer or a dummy (or all other realistic ways one would learn to fight with this weapon) until you raise your perk. AND! you must eat and drink regularly and fittingly (not too realistic, but at least more than just bread) to keep up this level of strength. There are a lot of basic need mods out there, that could do this. This gives food a sense and also can be very interesting, if you lead a group of followers, soldiers whatsoever and have to make sure your there is always enough food in camp, not only to survive but have them training etc... (but for the ones who would hate hunting or ambushing a caravan full of food, one could leave this feature out). \r\nSo your \\\"fighting trainer\\\" will for exmple holds his shield and you will bash and bash it more often than you can count and within days or less or more, your perk will rise... (maybe there ll be an option to learn faster or slower, as realistic as you want it ...). Maybe if you have enough stamina and/or the \\\"strength\\\"-perk, you will learn to make more dmg in no time, because you can bash harder, but you d be making more damage if you d be training, because there is an experience factor (maybe training would just make your perk rise faster, or there d be another perk(-arm) like lets call it \\\"stable grip\\\" or whatsoever, that will add to the damage, pace and so on of your bash...).\r\nThis just as a taste... its a little complex, dont even know whats possible of it, but i ll work on it, because imo this will make the game unresistable. \r\nEveryone is welcome to share ideas too, or work on it themselves if they like. No thinking about me claiming copyright etc...      \r\n\r\n(will continue writing ideas down soon...)\r\n\r\nThings i work on atm:\r\n\r\nForsworn weapons and armor, fitting damage and protection points accordingly. \r\nChanging perks, as described above. \r\nCant promise an update too soon, but anyone wanting to contribute with ideas, files... you re most welcome. \r\n\r\n[Old content]\r\nThis is still a rough alpha version, but its meant to work together with borguts and kahmuls mod. \r\nBorguts mod making combat and enemies intelligence more realistic, kahmuls mod making aiming important, and this mod to make your intelligence, your aiming and your choice of weapon and armour vitally important!\r\nActually made by special request from a friend and originally just developed by me for me, for tittykittys tower defense mod, now for the community. With increasing interest i ll pick up the work again and refine it to the last of your wishes;)\r\n\r\n\r\nCredits and Thx for their beautiful mods:\r\nBorgut11337\r\nKahmul78\r\nTittiKitty\r\n\r\n",
  "categoryId": "55",
  "version": "1.0",
  "author": "PrinceSanguine",
  "createdUnix": "1352139111",
  "updatedUnix": "1352752127",
  "containsAdultContent": false,
  "uploadedBy": "PrinceSanguine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "99090",
      "name": "WeaponsTD1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "WeaponsTD1-26520-1-0.rar",
      "uploadedUnix": "1352752127",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/36b9bfce0c30d01e269624e2f3f4b4b98a42e04ede6e2b72bbd3cf312f99f0b4/analysis/1407260645/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WeaponsTD1-26520-1-0.rar?fid=99090&ttl=1535798697&ri=8192&rs=8192&setec=5566e2b3eb1cd8683f4674c03a1d7474"
    }
  ]
}