{
  "modId": 26548.0,
  "modName": "Rise of the Ancient Falmer",
  "summary": "Idea concept n Weapons mod - add sSnow Elves fighting Thalmor near Winterhold",
  "descriptionHtml": "This small mod adds a bunch of retextured Elven wepons ment to go with the Ancient Falmer Armor plus I added a bunch of Snow Elves fighting Thalmor near Winterhold. \r\nThis is ment to be a Falmer scounting party from a hidden Snow Elf Enclave based deep within Skyrim who have lasted for thousands of years and only recently heard rumors of the rediscovery of thier ancient Temples by the outside world.\r\n\r\nThese Snow Elves have decided its time to re-connect with the rest of Tamriel and have attracted the attention of the Thalmor. Since these are modern Elves, they wish to try and forge a dialogue between the two but the Thalmor, in thier arrogance and singlemindedness demand that these Falmer submit to thier questions of thier weapons, magic and also where thier hidden home is so they can \\\"re-intergrate\\\" these lost elves into the Dominion.\r\n\r\nThe Falmer warriors, unused to such demands and threats immediatly say no to this answer and thus both greeting parties immediatly fight, with the Thalmor winning the upper-hand with thier fire spells and the Falmer vulrable to such attacks but they also had some tricks up there sleveless armor sleves with advanced archery using Auri-El\\'s blessing and razor-ice tipped weapons against the Thalmor.\r\n\r\nExpect to see them fighting just west of Winterhold, over the ridge to the West.\r\n\r\nThe Thalmor are very aggresive and are very likely to attack you unless you have some mod that makes the Thalmor friendly to you.  (Is there a mod yet that lets you join them?)\r\nThe Snow Elves should not be an enemy to you unless your part of the Thalmor somehow, watch out though, they are aggresive so companions who are also aggresive may attack them and vice versa.\r\n\r\nThis mod also lets you access the Ancient Falmer Armors (both kinds - paldroned and paldronedless) early in the game if you have Dawnguard. The Paldronless woren by Gelebor, is a copy of his armor but same stats n all.\r\n\r\nThe idea of this mod is to try to re-integrate Falmer into Modern Skyrim society and perhaps make a mini-city using the Falmer Temple resources in Dawnguard, and perhaps use that Aylied resource pack also.\r\n\r\n",
  "categoryId": "33",
  "version": "1",
  "author": "beth",
  "createdUnix": "1352228953",
  "updatedUnix": "1352229872",
  "containsAdultContent": false,
  "uploadedBy": "nofear88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "97836",
      "name": "Rise of the Ancient Falmer",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5236",
      "fileName": "Rise of the Ancient Falmer-26548-1.rar",
      "uploadedUnix": "1352229872",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/858e970fca21d20fd84b1d00365278a865db26a765e6e71266541e0076583441/analysis/1407252249/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rise%20of%20the%20Ancient%20Falmer-26548-1.rar?fid=97836&ttl=1535798730&ri=8192&rs=8192&setec=0a21b17b96f38b64afeb13915b5e12a2"
    }
  ]
}