{
  "modId": 26550.0,
  "modName": "Daiyus Smithing Mods",
  "summary": "A collection of modular of mods that work to make Smithing the best it can be. Includes Perk corrections, arrow recipes for non-Dawnguard users, and more.",
  "descriptionHtml": "[url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i1368.photobucket.com/albums/ag172/Daiyus37/Modding/Mod%20Page%20Description%20Banners/Forever%20Free_zpsmzwanqbn.jpg[/img][/url]\r<br />\r<br />This is my personal collection of mods that pertain to Smithing. Skyrim&#39;s Smithing is one of it&#39;s strongest points in my opinion, but there&#39;s always room for improvement. I have made (and am planning on making) a collection of modular mods that when used together will &#34;perfect&#34; the Smithing system. The aim is to be as modular as possible, so you can pick what you want. Do you prefer the way another mod handles the missing recipes? That&#39;s fine, use theirs instead of mine, but you can still use my Perk changes to craft everything to Legendary. I accept that there are other mods out there doing the same thing as me. I personally had issues with them and decided to do it myself. It&#39;s up to you which mods you want to use.\r<br />\r<br />This is a work in progress mod. Not all modules are built yet, and the ones that are may not be perfect. I&#39;ll explain what my future plans are in each description, be it a whole new module, or updates to one that&#39;s already been released.\r<br />\r<br />So, what&#39;s this mod doing?\r<br />\r<br />\r<br />\r<br />\r<br />[b]Module 1: Legendary Basic Smithing[/b]\r<br />The Problem: In Vanilla Skyrim not all weapons and armour can be upgraded to Legendary status. This is because not all weapon and armour materials are covered by the Perks. Basic materials such as Iron, Leather, and Hide, are completely skipped. This means they never receive the double bonus that other materials receive once their respective Perk has been taken.\r<br />\r<br />The Solution: Legendary Basic Smithing edits the Steel Smithing Perk so that all these missed materials are added, and renames the Perk to &#34;Basic Smithing&#34;. This means that you can now take your favourite Iron Greatsword, Stormcloak Armour, Light Imperial Bracers, or Leather Boots to a Grindstone/Workbench, and improve them just as much as Steel stuff.\r<br />\r<br />Haw is it done? Every Perk has a set of keywords that it affects, so as an example, Orcish Smithing effects everything with the keywords &#34;WeapMaterialOrcish&#34; and &#34;ArmorMaterialOrcish&#34;. I have added many keywords to the Steel Smithing Perk (now Basic Smithing), these include:\r<br />\r<br />ArmorMaterialHide\r<br />ArmorMaterialIron\r<br />ArmorMaterialIronBanded\r<br />ArmorMaterialImperialLight\r<br />ArmorMaterialImperialStudded\r<br />ArmorMaterialLeather\r<br />ArmorMaterialStormcloak\r<br />ArmorMaterialStudded\r<br />WeapMaterialDraugr\r<br />WeapMaterialFalmer\r<br />WeapMaterialImperial\r<br />WeapMaterialIron\r<br />WeapMaterialSilver\r<br />WeapMaterialWood\r<br />\r<br />I have removed a Keyword from Dwarven Smithing:\r<br />\r<br />WeapMaterialDraugrHoned\r<br />\r<br />I have added Keywords to Advanced Armors:\r<br />\r<br />WeapMaterialDraugrHoned\r<br />WeapMaterialFalmerHoned\r<br />\r<br />Also renamed Advanced Armors to Advanced Steel Smithing.\r<br />\r<br />I&#39;ve also added Keywords to Forsworn, Guard, Summerset Shadows, Linwe, and Ancient Nordic Armours. Nightingale equipment is now under the Advanced Steel Smithing Perk (as it is likely that it&#39;ll be Light Armour users using this), the weapons still need Ebony Ingots though.\r<br />\r<br />If I&#39;ve missed any, please let me know and I&#39;ll fix ASAP.\r<br />\r<br />Compatibility: Compatible with anything that doesn&#39;t alter the Steel, Dwarven, or Advanced Perks.\r<br />\r<br />\r<br />\r<br />\r<br />[b]Module 2: Dawnguard Style Arrows[/b]\r<br />The Problem: If you don&#39;t have Dawnguard you can&#39;t craft arrows (unless you use a mod). It was a silly thing for Bethesda to leave out in the first place. If you&#39;ve got Dawnguard you don&#39;t need this module.\r<br />\r<br />The Solution: All I&#39;ve done is replicated Dawnguards recipes in the Vanilla game. You will find the recipes in their corresponding categories. 1 Firewood + 1 *material* Ingot = 24 Arrows. Daedric Arrows require an Ebony Ingot and a Daedra Heart. You will need the corresponding Perks to craft the arrows of that tier, so Dwarven Smithing to make Dwarven Arrows, etc.\r<br />\r<br />Future Plans: None, unless there are any bug reports. It works as intended.\r<br />\r<br />\r<br />\r<br />\r<br />[b]Module 3: Reclaiming Lost Knowledge[/b] In Development\r<br />The Problem: There are many items that we cannot forge, or make. Lockpicks, Torches, Thieves Guild Armour, etc, etc. This is a shame as there&#39;s a lot of content just begging for us to craft and use.\r<br />\r<br />The Solution: I will create recipes for a lot of the missing items. I will also create tempering recipes for ingame items that currently cannot be tempered, for example Daedric Artifacts. Many items will require you to have done things ingame. Only members of the Thieves Guild will be able to make Thieves Guild Armour, ore Legionarres make Legion Armour.\r<br />\r<br />Future Plans: This is the biggest module I&#39;ve had to tackle yet. There&#39;s currently no ETA on this. I want it to be as thorough as possible before release. If you have any ideas, know of any lesser known items to be missing, or just plain want to make sure I don&#39;t miss anything obvious, I&#39;d love to hear it.\r<br />\r<br />\r<br />\r<br />\r<br />[b]Module 4: Practical Learning[/b] Yet to be started\r<br />The Problem: Why are only certain aspects of the Smithing process considered good enough to learn from? Is the treatment of the ore, or tanning of pelts just as important to the whole process?\r<br />\r<br />The Solution: Make all the worksations grant experience. The forge should get the most as it is the most complex part, however Smelting, Tanning, and even mining should grant small amounts of experience.\r<br />\r<br />\r<br />\r<br />\r<br />[b]Module 5: Crafting Breakdown[/b] Not yet in development.\r<br />By request of Wulfgar64. This module will allow players to break old weapons, armours, and other miscellaneous objects back down into base components. It&#39;s not a 100% transfer, some materials will be lost in the process.\r<br />\r<br />\r<br />\r<br />\r<br />[b]Module 6: The Rebirth of Unarmoured[/b] Currently a pipe dream\r<br />This one is by request of javamonsoon2o2p. He asked if it&#39;s possible to make clothes armoured and temperable. It&#39;s a wonderful idea, and one I would love to have a go at. It&#39;s by far the most complex idea I&#39;ve ever tried to get wotking in my head. I&#39;m not even sure if I&#39;ll ever be able to make this work how I&#39;d like it to, but it&#39;s something I&#39;d like to have a go at nonetheless once everything else is sorted.\r<br />\r<br />If you have any more ideas I&#39;d be glad to hear them. ",
  "categoryId": "73",
  "version": "1.3",
  "author": "Daiyus",
  "createdUnix": "1352245444",
  "updatedUnix": "1352663088",
  "containsAdultContent": false,
  "uploadedBy": "Daiyus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98617",
      "name": "DSM Legendary Basic Smithing V1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "0",
      "fileName": "DSM Legendary Basic Smithing V1_1-26550-1-1.rar",
      "uploadedUnix": "1352580794",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6bd27854f565a6312103bf095679cce30561a2d35cf6884843c6332816a52158/analysis/1407257408/",
      "changelogHtml": " Changed incorrect AND requirements to OR requirements in Legendary Basic Smithing <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DSM%20Legendary%20Basic%20Smithing%20V1_1-26550-1-1.rar?fid=98617&ttl=1535798731&ri=8192&rs=8192&setec=1af200a5a7ca4c67cfbb3f749c04e2fd"
    },
    {
      "fileId": "98618",
      "name": "DSM Dawnguard Style Arrows V1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "DSM Dawnguard Style Arrows V1_0-26550-1-0.rar",
      "uploadedUnix": "1352580842",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/840dd399d2c074cf806b7afcd514168f6d50d3ebbbebec4812a50d66ad8932a9/analysis/1407257409/",
      "changelogHtml": " Initial release of Legendary Basic Smithing <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DSM%20Dawnguard%20Style%20Arrows%20V1_0-26550-1-0.rar?fid=98618&ttl=1535798732&ri=8192&rs=8192&setec=6237d4a6dabbd8bde4e50eae3562f925"
    },
    {
      "fileId": "98654",
      "name": "DSM Legendary Basic Smithing V1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "DSM Legendary Basic Smithing V1_2-26550-1-2.rar",
      "uploadedUnix": "1352593377",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/f0490e34d689dcc1e40b365f873fea3b942a33919a96bc1fb98cd05a10e11b78/analysis/1407257711/",
      "changelogHtml": " Initial release of Dawnguard Style Arrows <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DSM%20Legendary%20Basic%20Smithing%20V1_2-26550-1-2.rar?fid=98654&ttl=1535798732&ri=8192&rs=8192&setec=46c7a12f9aed2fc10a95599fcbe7a386"
    },
    {
      "fileId": "98854",
      "name": "DSM Legendary Basic Smithing V1_3",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "DSM Legendary Basic Smithing V1_3-26550-1-3.rar",
      "uploadedUnix": "1352663088",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/cae7f15fd111b05fb6abcc91bad71a1265acaaf0715bcdaa52a0376ba81c087e/analysis/1407259023/",
      "changelogHtml": " Added keywords and edited more perks in Legendary Basic Smithing <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DSM%20Legendary%20Basic%20Smithing%20V1_3-26550-1-3.rar?fid=98854&ttl=1535798733&ri=8192&rs=8192&setec=9826f288eccfcd60f504b01c74693379"
    }
  ]
}