{
  "modId": 26569.0,
  "modName": "USURE - Degradation des items 7_1 - francais",
  "summary": "Rajoute à Skyrim la dégradation + réparation des armes et armures, connue déjà dans les épisodes précédents des elder scrolls.",
  "descriptionHtml": "[img]http://static-1.nexusmods.com/15/mods/110/images/26569-1-1352282189.jpg[/img]\r<br />\r<br />\r<br />\r<br />     *** Please Endorse if you like this work ***\r<br />English version now available &#33;&#33; :\r<br />http://skyrim.nexusmods.com/mods/32057\r<br />\r<br />[b][size=5]**********************\r<br />*** Série USURE ***\r<br />**********************[/size]\r<br />[/b][size=3]\r<br />Les mods de la série USURE s&#39;efforcent de rendre au volet SKYRIM des Elder Scrolls, le minimum de contraintes qu&#39;il lui faut pour rendre au jeu ses défis et combattre l&#39;ennui &#33;\r<br />En y jouant la première fois, j&#39;ai trouvé le jeu trop propre, trop poli, trop brillant de facilité. Au niveau 30 avec tous les chevaux d&#39;acquis, tous pareils, toutes les maisons toute meublée, et des réserves de 30000 or dans mes coffres. Des squelettes avec des armes flambantes neuves, les followers vous offrant leurs vies pour une défense de mamouth etc.. Tant d&#39;incohérences &#33;\r<br />Ma réaction a été de proposé cette série &#34;USURE&#34; avec:\r<br />\r<br />- Dégradation des items,\r<br />- Commerce difficile\r<br />- Difficulté rebalancée,\r<br />- Chevaux variés,\r<br />- Boire, manger, dormir,\r<br />- Maisons plus coûteuses,\r<br />- Transports plus coûteux,\r<br />- Followers rémunérés.\r<br />- Leveling ralenti.\r<br />- et bien plus....\r<br />A vous de savoir si vous voulez d&#39;un jeu version édulcoré..Sinon osez ces mods ;)\r<br />Just enjoy.[/size]\r<br />\r<br />[size=5]******* DÉGRADATION DES OBJETS ÉQUIPÉS **********[/size]\r<br />\r<br />[size=3]Bienvenue dans le vrai monde de skyrim, celui où les choses ne perdurent pas...\r<br />Revenir à l&#39;usure des items, à mon regret économisée par Bethesda, tel était le but de ce mod.\r<br />\r<br />JE RECOMMANDE FORTEMENT DE LIRE CECI AVANT L&#39;UTILISATION DU MOD &#33;&#33;[/size]\r<br />\r<br />[size=4][b]********************************\r<br />*Instalation et démarrage:*\r<br />********************************[/b]\r<br />[/size][size=3]\r<br />- télécharger le mod\r<br />(deux fichiers .esp + .bsa)\r<br />\r<br />- Placer les fichiers dans le répertoire skyrimdata\r<br />\r<br />- activer le mod dans le launcher.\r<br />\r<br />- [u]REQUIERT SKSE[/u] &#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;\r<br />\r<br />- lancer le jeu depuis skse_loader.exe (v. actuelle)\r<br />\r<br />- [u]ET DÉMARRER UNE NOUVELLE PARTIE &#33;&#33;&#33;&#33;&#33;&#33;[/u][/size]\r<br />[size=4]\r<br />[b]**********************\r<br />Désinstallation:\r<br />**********************[/b][/size]\r<br />\r<br />[size=3]- Sélectionner dans le menu du livre &#34;Configuration du mod DEGRADATION&#34; l&#39;option &#34;Aucune&#34; dégradation. Attendez qlq sec.\r<br />- effectuer une sauvegarde.\r<br />- Quitter le jeu et désélectionner ou effacer le fichier Degradation.esp (répertoire data)\r<br />- Relancer le jeu, charger votre sauvegarde avec dégradation désactivée.\r<br />- ATTENTION: SEULS LES ITEMS (armes et armures) MARQUÉS &#34;inconnu&#34; RESTERONT DANS L&#39;INVENTAIRE APRES LA DESINSTALLATION DU MOD &#33;&#33; (et les objets uniques aussi)[/size]\r<br />\r<br />[b][size=4]**********************\r<br />Description:\r<br />**********************[/size][/b]\r<br />[size=3]\r<br />\r<br />- Ouvrez le Menu MCM pour configurer le mod à souhait.\r<br />Dégradation à quatres vitesses proposées, selon à quelle difficulté vous jouez le jeu (dont dépend la fréquence d&#39;emploi des items en combat), \r<br />et/ou vos préférences. Possibilité aussi ici de désactiver la dégradation complètement.\r<br />Options également disponibles pour la réparation desw items:\r<br />- Nécessité d&#39;atteindre un niveau de compétence en forge ou non\r<br />- Néccessité d&#39;avoir du matériel correspondant pour effectuer les réparations.\r<br />- Gain de compétence ou non etc..\r<br />\r<br />- Vos items équipés dégraderont:\r<br />-&gt; une dégradation d&#39;usure quotidienne de port.\r<br />-&gt; une dégradation lors des combats, plus intense, bien sûr.\r<br />Les armes sont + ou - solides selon leur poids et leur matériel.\r<br />\r<br />- Réparation à la meule pour les armes, à l&#39;établi pour les armures.\r<br />-&gt; Selon vos compétences en forge, il faudra payer de l&#39;or au forgeron contre son aide...(en option)\r<br />-&gt; Déplacer votre perso devant l&#39;établi ou la meule ou sélectionner un marteau pour entrer en mode &#34;réparation&#34; marqué par des frappes sonores en arrière plan de marteaux de forgeron - ou bruit de meule.\r<br />-&gt; Ouvrez votre inventaire et sélectionner les unes après les autres toutes les armes et armures à réparer.\r<br />-&gt; Un message vous informera sur l&#39;état de l&#39;item, ses coûts de réparation, les options etc..\r<br />-&gt; Réparer tous vos objets depuis l&#39;inventaire, une fois terminé, quittez le mode réparation en vous éloignant de la meule, l&#39;établi ou en sélectionnant les marteaux.\r<br />- Le mod est entièrement configurable: Vitesse de degradation, Forge (compétences, lingots requis), Marteaux (cassables, compétences, lingots) dans un livre-option.\r<br />\r<br />- En chemin, équipez-vous de marteaux pour effectuer les reparations (à la oblivion..)\r<br />Les marteaux de forgeron sont mis en vente chez les marchands. Vous pourrez aussi les créer à la forge.\r<br />Vos marteaux peuvent se casser, plus ou moins fréquemment, selon votre abilité en forge. (en option)\r<br />\r<br />- Toutes les réparations coûtent des lingots. (en option)\r<br />\r<br />- Pas de réparation possible durant les combats.\r<br />\r<br />- Les réparations effectuées à la forge augmenteront votre compétence &#34;forgeron&#34; un peu, contrairement à celle au marteau.\r<br />Préférez donc la forge &#33;\r<br />\r<br />- Vous pourrez réparer vos items enchantés par vous-même, sans la compétence forge arcane.\r<br />Au contraire des armes magiques trouvées qui devront être réparées contre de l&#39;or à la forge ou bien requiert la competence forge arcane.\r<br />(en option)\r<br />\r<br />- Les armes et armures seront marquées dans votre inventaire &#34;[neuve]&#34; ou &#34;[inconnu]&#34;:\r<br />\r<br />-&gt; Les armes &#34;inconnues&#34; sont celles trouvées dans le monde, sur les adversaires, dans les coffres etc...\r<br />Vous les dévoilerez en les équipant simplement; \r<br />Tous les items trouvés ne sont plus flambants neufs, ce qui à mon goût ajoute beaucoup en réalisme. Ils auront un état de santé compris entre 80% et 100% de leur état initial.\r<br />Les items inconnus dévoilés apparaitront cependant parfois déjà améliorés, à différents niveaux, par leurs prédecesseurs.\r<br />Vous ne pourrez ni vendre, ni améliorer, ni enchanter une arme marquée inconnue, découvrez-la d&#39;abord.\r<br />\r<br />-&gt; Les armes &#34;neuves&#34; sont celles fabriquées à la forge, ou vendue par les vendeurs.\r<br />équipez-les avant de les enchanter, améliorer.\r<br />\r<br />- Vos armes et armures équipées découvertes pourront être enchantée ou améliorée par vos soins.\r<br />\r<br />- Pour chaque type d&#39;item (ex: &#34;épée de fer d&#39;incandescence&#34;), seulement trois exemplaires de chaque type présents dans l&#39;inventaire seront jouables.\r<br />Au-delà de trois exemplaires, vous ne pourrez équiper/dévoiler le quatrième item du même type sans devoir vous séparer d&#39;un des trois premiers exemplaires. \r<br />(Limite certes absurde mais incontournable pour la réalisation de ce mod, ceci n&#39;étant pas très gênant dans le jeu..)\r<br />\r<br />- La détérioration dans ce mod n&#39;est &#34;que&#34; statistique &#33;&#33; Ne vous attendez pas à du spectacle graphique &#33;\r<br />Ce mod inclut la degradation et reparation des items importés par d&#39;autres mods &#33;\r<br />[/size]\r<br />********************************************\r<br />\r<br />- [u]Version 7.1[/u]\r<br />&gt; Les attaques magiques ne font plus de &#34;ravages&#34; en dégradant les armures: Degradation similaire aux coups recus d&#39;armes.\r<br />&gt; MCM Menu propose un éventail plus grand de vitesses de dégradation disponibles.\r<br />&gt; les hâches de bucheron  et les pioches dégradent lors de leur utilisation dans les mine ou sur les sites de bois.\r<br />&gt; Armures draconiqes: Bug corrigé.\r<br />&gt; Augmentation de la compétence forge proportionnelle au niveau actuel lors des réparations.\r<br />\r<br />-[u] Version 6.0[/u]: Passée l&#39;intro, le mod s&#39;enclenche tout seul avec les premiers items que vous trouverez.\r<br />\r<br />\r<br />[u]Version 5.0[/u]\r<br />- Toujours dans un progrès d&#39;allègement de ce mod, effectuez vos réparations forges comme suit:\r<br />\r<br />Déplacez-vous devant l&#39;établi pour les armures, ou devant la meule pour les armes, le seul fait de vous placer devant l&#39;instrument déclenche automatiquement le mode réparation correspondant. \r<br />L&#39;entrée en mode s&#39;accompagne d&#39;un effet sonore correspondant.\r<br />Ouvrez votre inventaire, sélectionner vos items à réparer un par un.\r<br />Quitter le mode réparation en vous éloignant simplement de la forge.\r<br />\r<br />[u]Version 4.3[/u]\r<br />- La découverte d&#39;objets améliorés n&#39;octroie que rarement (une chance sur 20) des objets améliorés exquis, parfait ou épique.\r<br />\r<br />\r<br />[u][b]Version 4.1\r<br />[/b][/u]Ajout du livre option correcte une fois rejoint le dongeon de l&#39;intro.\r<br />\r<br />[u][b]Version 4.0[/b][/u]\r<br />Refonte complète du mod.\r<br />Vous n&#39;aurez plus besoin d&#39;équiper les objets avant de les réparer:\r<br />-&gt; Sélectionner l&#39;établi iou la meule ou un marteau; entrer ainsi en mode &#34;réparation&#34; marqué par des frappes sonores en arrière plan de marteau de forgeron.\r<br />-&gt; Ouvrez votre inventaire et sélectionner les unes après les autres toutes les armes et armures à réparer.\r<br />-&gt; Un message vous informera sur l&#39;état de l&#39;item, ses coûts de réparation, les options etc..\r<br />-&gt; Réparer tous vos objets depuis l&#39;inventaire, une fois terminé, &#34;Éteignez&#34; le mode réparation en sélectionnant la meule, l&#39;établi ou les marteaux.\r<br />- Le mod est entièrement configurable: Vitesse de degradation, Forge (compétences, lingots requis), Marteaux (cassables, compétences, lingots) dans un livre-option.\r<br />\r<br />[b][u]Version 3.1[/u][/b]\r<br />- Jeter la bague, elle n&#39;est plus fonctionnelle (si vous la trouvez encore dans votre inventaire)\r<br />- Trouver un livre Option dans les objets divers de votre inventaire\r<br />- Le mod est entièrement configurable: Vitesse de degradation, Forge (compétences, lingots requis), Marteaux (cassables, compétences, lingots)\r<br />- Mod rééquilibré\r<br />\r<br />[b][u]Version 3.0[/u][/b]\r<br />- Permet lors de la découverte d&#39;items dans le monde de tomber sur des objets améliorés de tous niveaux &#33;&#33;\r<br />Et oui pourquoi se battent ils tous avec des armes et armures non améliorées alors qu&#39;ils ont la plupart des forges dans leur camp ??\r<br />- Les objets trouvés sont maintenant seulement un peu dégradés lors de leur découverte, c&#39;est ridicule que les adversaires ne soignent pas leur équipement, donc les objets trouvés auront maintenant une valeur entre 80% et 100% de leur valeur initiale.\r<br />\r<br />Version 2.3\r<br />- Sur le chevalet de tannage, recycler la plupart des armures légères trouvées (seulement celles encore [inconnu] &#33; ) pour en tirer le matériel cuir.\r<br />- Bug des animations interrompues résolu.\r<br />- Ajout de sons de forge lors des utilisations de la meule ou de l&#39;établi.\r<br />\r<br />Version 1.8\r<br />Nouvelles recettes à la forge telles que vous pouvez faire fondre des armes et armures [inconnues] pour en récupérer des lingots (de la matière originale de l&#39;item bien sûr), lingots utilisables par ex pour la réparation ou la création, l&#39;apprentissage de la compétence forgeron etc..\r<br />\r<br />Version 1.72\r<br />Dû à une erreur de programme, les ennemis perdaient de la santé lorsqu&#39;ils frappaient.\r<br />Bug corrigé.\r<br />\r<br />Version 1.71\r<br />\r<br />Révision du système de payement lors des réparations à la forge:\r<br />\r<br />-&gt; le coût des réparations est toujours variable en fonction de combien l&#39;item est cassé (plus un item est cassé, plus il sera cher de le réparer), de sa matière (lingot), de son enchantement(ou non), de vos compétences(ou non), et du prix de base de l&#39;item.\r<br />\r<br />-&gt; cependant si vous possédez la compétence en forge requise pour réparer, la réparation ne coûte désormais plus rien, en effet, il était stupide que la fabrication d&#39;un objet revienne moins cher que sa réparation &#33;\r<br />\r<br />\r<br />Version 1.7\r<br />Voir screenshots:\r<br />Lors de l&#39;équipement d&#39;une arme ou armure une barre indicative d&#39;état de santé de l&#39;item s&#39;affiche en haut à gauche de l&#39;écran pour vous renseigner de son état de détérioration &#33;\r<br />\r<br />Rend la dégradation plus visible. Il était agacant de ne pas savoir exactement de combien l&#39;item a dégradé sinon en ayant recours pour cela aux marteaux ou aux forges &#33;\r<br />\r<br />enjoy\r<br />\r<br />\r<br />Version 1.61:\r<br />-&gt; Bug corrigé empêchant d&#39;équiper convenablement les boucliers des gardes.\r<br />\r<br />Version 1.6 = Gros update:\r<br />\r<br />-&gt; Les haches de bucheron et les piques de mineur sont maintenant fabricables à la forge &#34;bois&#34;, elles dégradent si utilisées en combat et sont réparables.\r<br />\r<br />-&gt; Possibilité de laisser le forgeron réparer les items (pour ceux qui souhaitent ne pas augmenter leur competence de forgeron)\r<br />\r<br />-&gt; Les réparations d&#39;items à la forge octroient un peu plus d&#39;expérience que dans les versions précédentes.\r<br />\r<br />-&gt; le coût des réparations est maintenant variable en fonction de combien l&#39;item est cassé (plus un item est cassé, plus il sera cher de le réparer), de sa matière (lingot), de son enchantement, de vos compétences, et du prix de base de l&#39;item.\r<br />\r<br />-&gt; Ainsi les armes enchantées peuvent être utilisées modérement dès le début du jeu, sans que le coût de réparation ne deviennent trop énorme.\r<br />\r<br />-&gt; La degradation d&#39;usage quotidienne hors combat est désormais aléatoire et plus espacée (1 occurence pour ca 24-48 h)\r<br />\r<br />\r<br />1.56 \r<br />Différents bugs corrigés:\r<br />-&gt; la forge propose maintenant des pièces impériales neuves à créer.\r<br />-&gt; les items uniques/rares sont réparables, par ex les armures de la guilde des voleurs (le bug est corrigé)\r<br />-&gt; les armures de plate sont réparables\r<br />\r<br />Version 1.53\r<br />La bague propose une option supplémentaire de vitesse &#34;très lente&#34; dégradation.\r<br />\r<br />Version 1.52\r<br />- Bug corrected with weapons stopping suddenly to degrade &#33;&#33;\r<br />Version 1.51: Items degrade depends on material and weight.\r<br />Version corrigée concernant l&#39;intégration des items d&#39;autres mods.\r<br />(Bug fixé= La charge d&#39;une sauvegarde mettait parfois les items d&#39;autres mods à une valeur de 0 -&gt; corrigé maintenant dans 1.51)\r<br />\r<br />VOILA COMPATIBLE AVEC LES ITEMS D&#39;AUTRES MODS &#33;&#33; Version 1.51 &#33;\r<br />\r<br />Le 03/11/2012\r<br />Mod créé par Marcoousik pour skyrim.\r<br />Version 1.0: Original\r<br />Version 1.1: Bug fixé lors de la somme de la valeur des armures affichée dans l&#39;inventaire.\r<br />Version 1.2: Fixe l&#39;apparition d&#39;un effet magique et nettoie les scripts pour la désinstallation.\r<br />Version 1.3: Le mod a été nettoyé des npc et des races, donc compatible maintenant aux mods rajoutant des races ou les utilisant pour autre chose.Le tutoriel de la forge est maintenant jouable.\r<br />Version 1.4: Mod intégrant la degradation + réparation des items venus d&#39;autres mods.\r<br />Bug de l&#39;armure de fer non réparable fixé. Mod plus stable.\r<br />La Table d&#39;enchantement ne propose plus d&#39;améliorer des items marqués [inconnu ] ou [neuf](Bug fixé).\r<br />Version 1.51:\r<br />- version revue et corrigée, bug corrigé concernant l&#39;intégration d&#39;items d&#39;autres mods, donc si vous aviez des anomalies, ré-essayer avec cette version, la précédente s&#39;étant avérée incomplète.\r<br />- Dégradation selon poids et matériel de fabrication: Plus l&#39;item est fabriqué d&#39;un matériel coûteux et rare, plus l&#39;item sera résistant à la dégradation.\r<br />\r<br />\r<br />\r<br />***********************\r<br />Bugs\r<br />\r<br />- Aucun repéré. Mais cette version demande à être testée et retestée de long en large...\r<br />La programmation a été soignée mais lourde et longue, ainsi une petite erreur (ca peut toujours arriver) dans des listes créées pourraient occasionner des ratages gênants. A suivre.\r<br />\r<br />- Connu: Petit temps d&#39;attente entre les menus de réparation proposés au marteau et à la forge. Cela tient aux calculs des valeurs d&#39;items.\r<br />Patientez un petit peu.\r<br />De même, lors de l&#39; équipement d&#39;un item marqué neuf ou inconnnu, l&#39;item sera retiré de votre inventaire, patientez qlq sec (+ou-) avant que n&#39;apparaisse l&#39;item dévoilé jouable dans votre inventaire.\r<br />***********************\r<br />Merci\r<br />\r<br />- À Bethesda + creation kit + skyrim + wiki.\r<br />- À la confrérie des traducteurs.\r<br />- À tous ceux qui me signaleront des bugs ou auront plaisir à jouer ce mod &#33;\r<br />\r<br />***********************\r<br />Copyright\r<br />\r<br />- Vous avez tous les droits de remanier ou d&#39;améliorer ce mod.\r<br />Mais veillez svp à citer cette source lors d&#39;une publication d&#39;un mod inspiré de celui-ci, merci.\r<br />\r<br />***********************",
  "categoryId": "24",
  "version": "7.1",
  "author": "Marcoousik",
  "createdUnix": "1352281705",
  "updatedUnix": "1429519807",
  "containsAdultContent": false,
  "uploadedBy": "marcousik",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000120435",
      "name": "DEGRAGATION_3-1-FR",
      "version": "3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "580",
      "fileName": "DEGRAGATION_3-1-FR-26569-3-1.zip",
      "uploadedUnix": "1407056962",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/ecb0de6566673ba39fce499ae92b728a0bef773817c1c0154eef60f294aa4812/analysis/1407057007/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DEGRAGATION_3-1-FR-26569-3-1.zip?fid=1000120435&ttl=1535798765&ri=8192&rs=8192&setec=3f3b51b305d503b8653e8bcc4e8b5bcc"
    },
    {
      "fileId": "1000122617",
      "name": "DEGRAGATION_4-2-FR",
      "version": "4.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "554",
      "fileName": "DEGRAGATION_4-2-FR-26569-4-2.zip",
      "uploadedUnix": "1408356510",
      "modVersion": "4.2",
      "virusScanUrl": "https://www.virustotal.com/file/c45fc8580b30878622324d8cc310287cebe77952d2e9b1cb868fa7db394df692/analysis/1408381014/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DEGRAGATION_4-2-FR-26569-4-2.zip?fid=1000122617&ttl=1535798766&ri=8192&rs=8192&setec=7ac11712ee7f8b81f9749304e98ba809"
    },
    {
      "fileId": "1000125576",
      "name": "DEGRAGATION_4-3-FR",
      "version": "4.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "554",
      "fileName": "DEGRAGATION_4-3-FR-26569-4-3.zip",
      "uploadedUnix": "1410009998",
      "modVersion": "4.3",
      "virusScanUrl": "https://www.virustotal.com/file/5e60aab4a305886fc92b2ee46dc30364e679e0cdf5e5c40ba60f9674ba5d1954/analysis/1410010083/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DEGRAGATION_4-3-FR-26569-4-3.zip?fid=1000125576&ttl=1535798766&ri=8192&rs=8192&setec=ae9b47caa34025917e216ffc262fb78d"
    },
    {
      "fileId": "1000134555",
      "name": "DEGRAGATION_5-0-FR",
      "version": "5.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "555",
      "fileName": "DEGRAGATION_5-0-FR-26569-5-0.zip",
      "uploadedUnix": "1415528387",
      "modVersion": "5.0",
      "virusScanUrl": "https://www.virustotal.com/file/d405874ca902a45fd06d0f171bef2062bbca4e8e7fa0a0124780e5705d1cd31c/analysis/1415528464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DEGRAGATION_5-0-FR-26569-5-0.zip?fid=1000134555&ttl=1535798767&ri=8192&rs=8192&setec=72d6f76ed2d970db3085d45cefa0311e"
    },
    {
      "fileId": "1000139347",
      "name": "DEGRAGATION_6-0-FR",
      "version": "6.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "666",
      "fileName": "DEGRAGATION_6-0-FR-26569-6-0.zip",
      "uploadedUnix": "1418937199",
      "modVersion": "6.0",
      "virusScanUrl": "https://www.virustotal.com/file/32fd811135cff73e9bf5b50a3b64932330521d3fe3ce8cbe79411ecf75dbeb65/analysis/1418937243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DEGRAGATION_6-0-FR-26569-6-0.zip?fid=1000139347&ttl=1535798767&ri=8192&rs=8192&setec=1723854e6ee369468695ec5f8146d9b6"
    },
    {
      "fileId": "1000140017",
      "name": "DEGRAGATION_6-0-F1",
      "version": "6.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "666",
      "fileName": "DEGRAGATION_6-0-F1-26569-6-1.zip",
      "uploadedUnix": "1419413336",
      "modVersion": "6.1",
      "virusScanUrl": "https://www.virustotal.com/file/06fda2cc19f84810df506397d377b7759831c51b3b7386092bb1fc4b5097925a/analysis/1419413343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DEGRAGATION_6-0-F1-26569-6-1.zip?fid=1000140017&ttl=1535798768&ri=8192&rs=8192&setec=58591876914a2e1796c6a3334f5792f9"
    },
    {
      "fileId": "1000143103",
      "name": "DEGRAGATION_6-2-FR",
      "version": "6.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "665",
      "fileName": "DEGRAGATION_6-2-FR-26569-6-2.zip",
      "uploadedUnix": "1421415875",
      "modVersion": "6.2",
      "virusScanUrl": "https://www.virustotal.com/file/fd47fddb1f604219f42c6ef088f6efdda417bdadb5e1a4ee469ac1ab948c9176/analysis/1421415905/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DEGRAGATION_6-2-FR-26569-6-2.zip?fid=1000143103&ttl=1535798768&ri=8192&rs=8192&setec=09f57d27cab938dbd3e9631395e98f08"
    },
    {
      "fileId": "1000143693",
      "name": "DEGRAGATION_6-2-2-FR",
      "version": "6.2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "666",
      "fileName": "DEGRAGATION_6-2-2-FR-26569-6-2-2.zip",
      "uploadedUnix": "1421751574",
      "modVersion": "6.2.2",
      "virusScanUrl": "https://www.virustotal.com/file/e4cc36ba7f4258b10f476bba37e8410bc690d46a686b7271665cbe37fff1ae66/analysis/1421751603/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DEGRAGATION_6-2-2-FR-26569-6-2-2.zip?fid=1000143693&ttl=1535798769&ri=8192&rs=8192&setec=b8d9221ba84952f102eb6e7d8f0d26a2"
    },
    {
      "fileId": "1000156414",
      "name": "DEGRAGATION_7-1-FR",
      "version": "7.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "680",
      "fileName": "DEGRAGATION_7-1-FR-26569-7-1.zip",
      "uploadedUnix": "1429519807",
      "modVersion": "7.1",
      "virusScanUrl": "https://www.virustotal.com/file/f1b2412a0bfcd1b25119efa423366aa7cc6098d4f10d2ea10e150be60862bc2b/analysis/1429519865/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DEGRAGATION_7-1-FR-26569-7-1.zip?fid=1000156414&ttl=1535798769&ri=8192&rs=8192&setec=c3ad0b8026a6e15a40b0073f510f53b2"
    }
  ]
}