{
  "modId": 26561.0,
  "modName": "Survival Mode",
  "summary": "The Survival Mode mod endeavors to add an additional layer of realism to your adventures in Skyrim, by rendering your character susceptible to such conditions as dehydration, starvation, sleep deprivation, and addiction. ",
  "descriptionHtml": "[b][size=16]Survival Mode[/size]\r\nby Xanatos[/b]\r\n\r\n\r\n[b]—NEW FEATURE————————[/b] \r\n\r\nThis mod now grants you the ability to drink water from virtually any water source in vanilla Skyrim. (**See EXCLUSIONS below.) This was a massive feature to implement; I manually had to map out every inch of shoreline, every river, and even every standing puddle in the entire realm of Skyrim. The exterior wilderness was the most difficult, and there is a possibility that I may have missed a stream or chunk of coastline. If you notice any areas where you are definitely unable to drink the water, let me know and I\\'ll correct it ASAP. \r\n\r\nThe spell named \\'Drink Water\\' (found under Restoration) can be used whenever you are standing near a valid water source by simply \\\"casting\\\" towards the water. The water level must be below your chest and the water itself must be in close proximity, within an arm\\'s length or so, for the drink action to succeed. You\\'ll know the action succeeded if you hear a swallowing sound, and see a notification in your upper left-hand corner stating: \\\"The water quenches your thirst.\\\"\r\n\r\nBelow are lists of valid water sources and exclusions.\r\n\r\n*[u]VALID WATER SOURCES[/u] \r\n·All streams and rivers\r\n·All coastal waters\r\n·All ponds and fountains\r\n·All puddles and other standing water often found in dungeons and caves\r\n·[b]Inside Major Cities and Villages[/b]\r\nWhiterun and Markath have been entirely mapped. All small villages have been mapped. I believe some other major cities are still patchy and should be fully mapped by the next update.\r\n\r\n**[u]EXCLUSIONS[/u]\r\n·[b]Babbling brooks[/b]\r\nThese appear as a thin layer of water running over rocks; in the context of the game, these aren\\'t even water objects, they are visual effect objects. The majority of these babbling brooks run on steep and inaccessible inclines, and virtually all of them lead to valid water sources. So use survival tactics to make use of the babbling brooks by following them to viable sources of water.\r\n·[b]Waterfalls[/b]\r\nThese, like babbling brooks, are actually visual effect objects not water objects. Waterfalls always spill into valid water sources.  \r\n·[b]Volcanic Water[/b]\r\nSouth of Eastmarch can be found an area which is under the influence of large amounts of geothermal activity. The water found here is toxic, containing harmful levels of hydrogen sulfide. You currently are unable to drink this water; I\\'ll be implementing a feature soon which allows you to drink it, but at a price to your health. \r\n·[b]Dawnguard[/b]\r\nI have yet to map all new locations [i]specifically[/i] added thru Dawnguard, please be patient!\r\n\r\n\r\n\r\n[b]—CHANGE LOG————————[/b] \r\n\r\n[u]v0.806[/u]\r\n·Added ability to drink water from virtually any typical water source in Skyrim via a spell named \\\"Drink Water\\\"\r\n·Changed activation of Settings Menu from book-activation to spell-activation. The Settings Menu Spell is named \\\"Survival Mode - Settings\\\" and is of the Alteration type\r\n·Added all wines to the Alcohol category\r\n\r\n[u]v0.76[/u]\r\n·Added a Settings Menu accessible via a second book, titled \\\"Survival Manual\\\"\r\n·Added options to disable ailments or their effects, individually or globally\r\n·Added options for tweaking various other ailment settings\r\n·Implemented food/beverage consumption buffer (similar to sleep recovery threshold) to prevent recovery stacking\r\n·Added short delay to death-popup messages so they aren\\'t shown before death animation\r\n·Scripts retooled; ailments completely modularized at script level\r\n\r\n[u]v0.701[/u]\r\n· .bsa issues, rebuilt [hotfix]\r\n\r\n\r\n\r\n[b]—OVERVIEW————————[/b] \r\n\r\nThe Survival Mode mod endeavors to add an additional layer of realism to your adventures in Skyrim, by rendering your character susceptible to such conditions as dehydration, starvation, sleep deprivation, and addiction. \r\n\r\nThis mod is not for the faint of heart, as it is guaranteed to make your adventures even more perilous. You will have to ensure that your character is eating, drinking, and sleeping properly according to realistic time-tables (scaled to the game\\'s actual timescale.) Failure to do so will result in penalties to various stats, which grow progressively worse if ignored; and in the case of starvation and dehydration, death will eventually occur. \r\n\r\nAddiction to alcohol and narcotics has been included as well, which in turn leads to some very interesting and rather significant withdrawal symptoms. Death by overdose can also result from over-consumption of drugs/alcohol. \r\n\r\n\r\n\r\n[b]—HOW DOES THIS MOD WORK?——————————[/b]\r\n\r\n*Note that an Options Menu has now been implemented in this mod, thus many of the settings described below are not set in stone, i.e. you will be able to tweak many different aspects of the mod to suit your individual play style.\r\n\r\nThe various ailments (starvation, dehydration, sleep deprivation, withdrawal) all carry their own levels of severity, or phases. Regarding starvation and dehydration, the phases grow progressively worse and can eventually lead to death if ignored. Sleep deprivation will also grow progressively worse, though it wont result in death if left unchecked. Withdrawal is unique in the sense that after acquiring an addiction, you\\'ll enter into a period of withdrawal whose effects peak after a few days, then taper off.\r\n\r\nWith the exception of alcohol/drug withdrawal, an ailment\\'s severity level decreases by one level each time the player treats the ailment. So what does this mean, exactly? See the following example...\r\n\r\n[code]After 24 hours without consuming liquids, you enter into Minor Dehydration, whose effects negatively impact certain stats. After another 24 hours, you enter into Moderate Dehydration, further impacting those stats. At this point, consuming one serving of liquid will reduce the severity level back to Minor Dehydration. Consuming one more serving will remove the Minor Dehydration ailment, thus resetting the 24-clock that monitors your liquid consumption.[/code]\r\n\r\nThe above process is essentially how starvation and sleep deprivation work as well, though sleep deprivation can only be reduced by uninterrupted naps of 4 hours or more.\r\n\r\nAddiction and Withdrawal work somewhat differently. After acquiring an addiction to a substance, you will initiate the Withdrawal process any time you consume that substance. Withdrawal grows progressively worse every 24 hours for a period of three days, after which the effects taper off daily. While experiencing withdrawal, there will be a chance (at set intervals) of experiencing short episodes of \\\"intense withdrawal\\\". The chance of these episodes occurring increases and decreases parallel to the withdrawal\\'s severity level.\r\n\r\nAddiction does not occur automatically, you can safely consume addictive substances as long as you don\\'t cross a certain threshold (unique for each substance) in any given 24 hour period. After crossing that threshold, however, your character will forever have an addiction to that particular substance. Addiction itself does not negatively impact your character in any way, it simply means you will always experience withdrawal after consuming the substance of addiction.\r\n\r\nUnique visual effects accompany every ailment, making it easy to discern between the various afflictions; unique sound effects (if not yet implemented) are on the way as well. Below are the timetables for starvation, sleep deprivation, and Moon Sugar withdrawal; other tables can be found in the Survival Guide (provided to your character upon enabling this mod.)\r\n\r\n[b][u]Dehydration Timetable[/u][/b]\r\nDay 0- No known adverse effects.\r\nDay 1- Health and Stamina recharge  5% slower. Encumbrance of  5%.\t(i.e. Minor Dehydration)\r\nDay 2- Health and Stamina recharge 10% slower. Encumbrance of 10%.  (i.e. Moderate Dehydration)\r\nDay 3- Health and Stamina recharge 15% slower. Encumbrance of 15%.  (i.e. Major Dehydration)\r\nDay 4- Health and Stamina recharge 25% slower. Encumbrance of 25%.  (i.e. Severe Dehydration)\r\nDay 5- Death.\r\n\r\n[b][u]Starvation Timetable[/u][/b] (notice it affects the body much like dehydration, albeit at a decelerated rate)\r\nWeek 0- No known adverse effects.\r\nWeek 1- Health and Stamina recharge  5% slower. Encumbrance of  5%.\r\nWeek 2- Health and Stamina recharge 10% slower. Encumbrance of 10%.\r\nWeek 3- Health and Stamina recharge 15% slower. Encumbrance of 15%.\r\nWeek 4- Health and Stamina recharge 25% slower. Encumbrance of 25%.\r\nWeek 5- Death.\r\n\r\n[b][u]Sleep Deprivation Timetable[/u][/b]\r\nWeek 0- No known adverse effects.\r\nWeek 1- Movement Speed  2% slower. Magicka recharges 10% slower.\r\nWeek 2- Movement Speed  4% slower. Magicka recharges 20% slower.\r\nWeek 3- Movement Speed  6% slower. Magicka recharges 30% slower.\r\nWeek 4- Movement Speed  8% slower. Magicka recharges 40% slower.\r\nWeek 5- Movement Speed 10% slower. Magicka recharges 50% slower.\r\nWeek 6- No additional effects.\r\n\r\n[b][u]Drug Withdrawal Timetable[/u][/b]\r\nDay 0- No known adverse effects.\r\nDay 1- Mental-based skills decrease by  2%. A 10% chance of sporadic visual impairment/hallucinations.\r\nDay 2- Mental-based skills decrease by  5%. A 50% chance of sporadic visual impairment/hallucinations.\r\nDay 3- Mental-based skills decrease by 10%. A 75% chance of sporadic visual impairment/hallucinations.\r\nDay 4- Mental-based skills decrease by  5%. A 50% chance of sporadic visual impairment/hallucinations.\r\nDay 5- Mental-based skills decrease by  2%. A 10% chance of sporadic visual impairment/hallucinations.\r\nDay 6- Withdrawal subsides.\r\n\r\n[b][u]Alcohol Withdrawal Timetable[/u][/b]\r\nDay 0- No known adverse effects.\r\nDay 1- Physical-based skills decrease by 2%. A 10% chance of sporadic visual impairment and loss of balance.\r\nDay 2- Physical-based skills decrease by 5%. A 50% chance of sporadic visual impairment and loss of balance.\r\nDay 3- Physical-based skills decrease by 10%. A 75% chance of sporadic visual impairment and loss of balance.\r\nDay 4- Physical-based skills decrease by 5%. A 50% chance of sporadic visual impairment and loss of balance.\r\nDay 5- Physical-based skills decrease by 2%. A 10% chance of sporadic visual impairment and loss of balance.\r\nDay 6- Withdrawal subsides.\r\n\r\n\r\nI\\'m trying to find a strong and logical balance between the effects of each condition, so these numbers are subject to change. Also, for the purposes of balance, potions and alchemical ingredients cannot be used to treat starvation or dehydration. \r\n\r\n\r\n\r\n[b]—INSTALLATION————————[/b] \r\n\r\n[b]Auto:[/b]\r\n[url=http://skyrim.nexusmods.com/mods/modmanager]NexusModManager[/url]\r\n\r\n[b]Manual:[/b]\r\nSimply extract the contents of the downloaded .zip to the Data directory in your Skyrim install dir...\r\n\r\n[i]i.e.   *\\\\[SkyrimInstallDir]\\\\Data[/i]\r\n\r\nTo manually uninstall, simply delete the extracted files.\r\n\r\nTo manually update, simply overwrite the old files.\r\n\r\n\r\n\r\n[b]—GETTING STARTED————————[/b] \r\n\r\nEverything you\\'ll need to know to get you started can be found in your \\\"Survival Guide\\\", which is added to your character\\'s inventory after enabling this mod. Be sure to read it carefully as your life just may depend on it!\r\n\r\nThe Settings Menu can be accessed via the SPELL titled \\\"Survival Mode - Settings\\\" in the Alteration category. \r\n\r\n\r\n\r\n[b]—FAQs————————[/b] \r\n\r\n[i]Does this mod affect Vampires? Werewolves?[/i]\r\nVampires, being undead, are immune to the ailments of this mod. As soon as your vampirism is cured, however, the mod will immediately take effect. Werewolves, being mortal, are [b]not[/b] immune to the effects of this mod.\r\n\r\n*Note, versions 0.7.60 and 0.8.06 has vampire immunity temporarily disabled\r\n\r\n[i]Will this mod work with Mod XYZ?[/i]\r\nI took great care designing this mod to be as friendly as possible with mods from other developers. As long as Mod XYZ doesn\\'t change the game\\'s timescale, and as long as it doesn\\'t *replace* the vanilla consumable items, there should be no conflicts whatsoever.\r\n\r\n[i]I have a question or bug report, how do I contact you?[/i]\r\nYou may contact me through the Nexus or at the email address found below, and I will do my best to respond as soon as possible. Please be aware that I will not respond to any question whose answer can be found in the Survival Guide.\r\n\r\n[i]Can I make a feature request?[/i]\r\nOf course! I\\'m always open to improving the quality of this mod. Contact me and I will consider your request. Credit will be given to any who submit an accepted feature request.\r\n\r\n\r\n\r\n[b]—INFO FOR DEVELOPERS————————[/b] \r\n\r\nAs is mentioned in the FAQs, to ensure compatibility with this mod, it is important not to adjust the game\\'s timescale; the entire functionality of this mod is dependent upon the default, vanilla timescale.\r\n\r\nReplacing the vanilla consumable items can also break this mod, since Keywords have been applied to most consumable items to distinguish their type.\r\nIf your mod adds new consumable items, you can easily ensure seamless cohesion with this mod by following these simple guidelines:\r\n\r\n—Non-alcoholic and non-potion drinkables should posses the keyword [b]VorpalKeywordDrinkable[/b]\r\n—Alcoholic beverages should posses the keyword [b]VorpalKeywordAlcohol[/b]\r\n—Narcotic substances should possess the keyword [b]VorpalKeywordNarcotic[/b]\r\n—Non-soup and non-ingredient food items should posses the keyword [b]VorpalKeywordEdible[/b]\r\n—Soups are a special case which should posses both the [b]VorpalKeywordDrinkable[/b] and [b]VorpalKeywordEdible[/b] keywords\r\n\r\n\r\n\r\n[b]—CREATOR————————[/b] \r\n\r\nThomas Truax",
  "categoryId": "24",
  "version": "0.8.06",
  "author": "Xanatos",
  "createdUnix": "1352266157",
  "updatedUnix": "1353257396",
  "containsAdultContent": false,
  "uploadedBy": "TheXanatosGambit",
  "primaryFile": null,
  "files": [
    {
      "fileId": "97890",
      "name": "Survival Mode v0_7_00",
      "version": "0.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "64",
      "fileName": "Survival Mode-26561-0-7.zip",
      "uploadedUnix": "1352266289",
      "modVersion": "0.7",
      "virusScanUrl": "https://www.virustotal.com/file/0d4f86edc49dcad1b420e5ac3292088aa894b52a071fa10bb15150ded073063f/analysis/1407252724/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Survival%20Mode-26561-0-7.zip?fid=97890&ttl=1535798753&ri=8192&rs=8192&setec=c4377250b806a0ece4fb2b3d36ed434d"
    },
    {
      "fileId": "97899",
      "name": "Survival Mode v0_7_01",
      "version": "0.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "70",
      "fileName": "Survival Mode v0_7_01-26561-0-7.zip",
      "uploadedUnix": "1352274374",
      "modVersion": "0.7",
      "virusScanUrl": "https://www.virustotal.com/file/86a6ba6a7f02d38cc945184a2dbb19a4fef83a207e23d3badc53f929b5ff1f48/analysis/1407252905/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Survival%20Mode%20v0_7_01-26561-0-7.zip?fid=97899&ttl=1535798754&ri=8192&rs=8192&setec=e509be821c2bd65b614339f311529d79"
    },
    {
      "fileId": "98439",
      "name": "Survival Mode v0_7_60",
      "version": "0.7.60",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "82",
      "fileName": "Survival Mode v0_7_60-26561-0-7-60.zip",
      "uploadedUnix": "1352534181",
      "modVersion": "0.7.60",
      "virusScanUrl": "https://www.virustotal.com/file/2d0ad8f715d546dc02d1fe9cad1a7fef010e126fcb803e9c11d704753ed1d9e7/analysis/1407256385/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Survival%20Mode%20v0_7_60-26561-0-7-60.zip?fid=98439&ttl=1535798754&ri=8192&rs=8192&setec=89c3a21bd0878939260b814852404075"
    },
    {
      "fileId": "100290",
      "name": "Survival Mode v0_8_06",
      "version": "0.8.06",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "648",
      "fileName": "Survival Mode v0_8_06-26561-0-8-06.zip",
      "uploadedUnix": "1353257396",
      "modVersion": "0.8.06",
      "virusScanUrl": "https://www.virustotal.com/file/75977bfd6cab47587ce0fba4c697bbf4ea16fe2b83077d5e03e11d5baa892ed0/analysis/1407268384/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Survival%20Mode%20v0_8_06-26561-0-8-06.zip?fid=100290&ttl=1535798755&ri=8192&rs=8192&setec=c23c1bda869adc7ea741cc84b60c508b"
    }
  ]
}