{
  "modId": 26576.0,
  "modName": "Craftable Vampire Jewelry",
  "summary": "Adds the vampire jewelry under jewelry crafting at the forge",
  "descriptionHtml": "This is a quick and easy mod for those who sided with the Dawnguard but still want access to the lovely new jewelry meshes the vampires get with the radiant fetch quests. \r\nHonestly I wasn\\'t going to do the creepy skull amulets but i was doing everything else so I just tossed em in.\r\n\r\nBased on textures they are divided into 4 material combos,\r\nEbony/Sapphire\r\nMoonstone/Garnet\r\nQuicksilver/Ruby\r\nCorundum/Emerald\r\n\r\nThere is a ring and a necklace for each combo. Also added was the (apparently) missing recipe for the bone hawk ring, a super unique item that is 3 rings with a hooked claw instead of a stone, very cool and there was only one in the whole game. \r\nAll the recipes are consistent with existing jewelry, prices may be a bit wonky for the base items but the purpose of this mod is for cosmetic enchanting reasons so I didn\\'t spend much time thinking about it.\r\n\r\nThe mod has been cleaned and should have no references to anything except to 9 recipes and 8 new items of jewelry.\r\nThis mod was originally for personal use, but because its so straightforward and potentially useful for folks who dont like \\\"major Overhauls\\\" of craftable stuff, I thought I would release it. \r\nNo expansions are likely, if I do add more jewelry from my own library of meshes then I will release it as a separate mod.\r\n\r\nThis mod REQUIRES patch 1.8, sorry to those who were having issues related to this. ",
  "categoryId": "60",
  "version": "0.1",
  "author": "Star Boi",
  "createdUnix": "1352300020",
  "updatedUnix": "1352300104",
  "containsAdultContent": false,
  "uploadedBy": "Earrindo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "97956",
      "name": "Dawnguard Jewelry Craftable",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Dawnguard Jewelry Craftable-26576-0-1.rar",
      "uploadedUnix": "1352300104",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/d770e7937087814dbb40a2c1c880c8b88223896262c24096da674b67317108a8/analysis/1407253209/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnguard%20Jewelry%20Craftable-26576-0-1.rar?fid=97956&ttl=1535798777&ri=8192&rs=8192&setec=36ce926fa1bec76e50dfe94686a50c33"
    }
  ]
}