{
  "modId": 26614.0,
  "modName": "Litheria Draugr Skirts",
  "summary": "WARNING: Contains see through outfits so adults only. I formed the rags that the female Draugrs have on in the dungeons to fit the new Litheria body released by Humannature66 and Ginnyfizz and added a few different textures to it as well.",
  "descriptionHtml": "Name          : Litheria Draugr Skirts\r\nVersion       : 1.0\r\nDate          : 11-08-12  \r\nCategory      : Armour\r\nAuthor(s)     : Tattooedillusions\r\n-------------------------------------------------------------------\r\n-------------------------------------------------------------------\r\n\r\nUPDATE 12-09-12: \r\nFor those that might track this file or come here for the first time and want a conversion for other body types I have just released Draugr Skirts UNP UNPB CBBE and BBP Variants at the following address:\r\n\r\nhttp://skyrim.nexusmods.com/mods/28056\r\n\r\nCheers and Enjoy!\r\nTI\r\n\r\nUPDATE: v1.1 (11-10-12)\r\nAdded the vanilla textured Draugr Skirt/Dress/Rags to Cidhna Mine Prison in Markarth so when you go to prison you can at least have something form fitting.  I chose the vanilla textured one for immersion purposes because it looks like it could be used as prison garb.  New picture to show where.  In a barrel to the immediate left after you leave your cell at the beginning of the quest.  NOTE: IF YOU CAN\\'T GRAB IT RIGHT AWAY, TURN AND WALK DOWN THE STAIRS UNTIL THE ORC GUARD CLOSES THE GATE.  You\\'ll then be able to grab it.  Many thanks to Baron of Hell for that tip.  If there are any other prisons you end up in or something that takes everything from you let me know where, what quest and so on and I\\'ll add one there too.  I haven\\'t been through the whole game yet so I don\\'t know all the quests and locations.\r\n\r\n\r\nDescription:\r\n------------\r\nWARNING: Contains see through outfits so adults only. I formed the rags that the female Draugrs have on in the dungeons to fit the new Litheria body released by Humannature66 and Ginnyfizz and added a few different textures to it as well.\r\n\r\n\r\nDetail:\r\n-------\r\n\r\nVERY IMPORTANT SO PLEASE READ THE FOLLOWING BEFORE DOWNLOADING:\r\n\r\nYou will need the mod HN66s Litheria - Race - Body - Armors by humannature66 and ginnyfizz (http://skyrim.nexusmods.com/mods/25461) in order for this to work because the skirts are just that. Just the skirts with no body attached and use the number 55 body slot to coincide with HN66\\'s Sexy Dresses in his mod. They will only fit the Litheria body. If you use a different body there will be insane clipping.  \r\n\r\nOk now on to what this is. For one this is my first Skyrim mod. Before this I started modding New Vegas on, as luck would have it, HN66\\'s Skinny body and Skinny Shop by doing BNB conversions of them and grew from there. This is also my first attempt at a full blown re-texture. I have used the Hue/Saturate option a few times to bring out different colors but never using totally different textures. Needless to say I need to find a \\\"Texturing for Dummies\\\" book soon so please go easy on my  lack of talent. If you find that you like it, awesome and thank you. If you think it sucks, you\\'re not alone but don\\'t rub my face in it and just look for something you do like please.\r\n\r\nWhat I did was I took the dirty, silky-ish skirt/rags that the female Draugrs wear in their dungeons and formed it to the Litheria body. There is the original texture, 3 leather textures, 4 lace textures and a chainmail texture right now. With better knowledge of what I\\'m doing I would like to do more at a later time but right now this is what I\\'ve got. So you start a new game and decide to play as the Litheria race but those prison outfits are big and bulky compared to the Litheria body so you want something fast to tide you over until you get to HN66\\'s Litheria Temple to get the real goodies.  It\\'s not much but when you enter Helgen Keep after you decide which faction to go with there will be a barrel in the room that both sides first encounter each other. If you side with the Stormcloaks I believe it is the very first room you enter.  If you side with the Imperials it should be the 2nd. In that barrel you can slip into something a bit more comfortably by grabbing an original texture Draugr skirt. The other textures are in 2 different dungeon areas. Probably your first (chainmail & leathers) will be deep in Bleak Falls Barrow when you retrieve the Dragonstone. It\\'s in a chest in the same area as where you learn your first Shout. The other (lace) is in Potema\\'s Sanctum a little before you enter the room full of her minions. Check the pictures for locations. Hopefully more to come later.  Enjoy and if you like it please endorse, leave a comment or submit a picture (I have it set so I have to verify just so I know when someone does decide to send one) or if you\\'re feeling really generous all 3 would be awesome ha ha. And PLEASE don\\'t forget to do the same for HN66 and Ginnyfizz\\'s Litheria Body Race & Armors mod. They are the one\\'s that really deserve it.\r\n\r\nCheers!\r\nTI\r\n\r\n\r\n---Installation:---\r\n-------------------\r\nManual Installation:\r\n--------------------\r\nIMPORTANT PLEASE READ THE FOLLOWING\r\nIn order for the outfits to work as intended, you MUST:\r\n\r\nFIRST download and install the Litheria Race Body & Armor mod by following their install directions.\r\n\r\nSECOND extract the file you just downloaded from here to anywhere you want to on your computer.\r\n\r\nTHIRD copy the data folder in the file you just downloaded to your FONV game directory which should be C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim.\r\n\r\nFOURTH make sure the LitheriaDraugrSkirt.esp is ticked in either your mod manager or your launcher and enjoy.\r\n\r\n\r\n---Uninstallation:---\r\n---------------------\r\nManual Uninstallation:\r\n----------------------\r\nUntick the .esp file in the mod manager or launcher and delete it and the files that came with this mod.\r\n\r\n\r\nKnown issues and bugs:\r\n----------------------\r\nMaybe a little clipping. I didn\\'t notice any but if you do please don\\'t be afraid to mention it and I will try to fix it. Also, on the right hip you will notice some triangles. That is how the original Beth mesh was and my noobness has no idea to fix it. Another thing I have no idea how to fix is if you look at the photos I\\'ve uploaded you\\'ll notice that when inside somewhere some of the outfits (lighter ones especially) will look darker when the light hits it. I have no idea if this is a nif setting I have to change or if it\\'s just Skyrim\\'s lighting. Any advice would be great on that matter.\r\n\r\n\r\nIncompatabilities:\r\n------------------\r\nAny other body type will \\\"bust out\\\" of the clothing because this was formed for the Litheria body and only the Litheria body.\r\n\r\n\r\nContact:\r\n--------\r\nFeel free to send me a message here at the Nexus if you run into any issues or just to say Hey.\r\n\r\n\r\nIMPORTANT - Requirements:\r\n-------------------------\r\nSkyrim of course\r\n\r\nHN66s Litheria - Race - Body - Armors by humannature66 and ginnyfizz\r\nhttp://skyrim.nexusmods.com/mods/25461\r\n\r\n\r\nCredits:\r\n--------\r\nHumannature66 and ginnyfizz for the sexy (IMO) Litheria body, race and armor mod.\r\nhttp://skyrim.nexusmods.com/mods/25461\r\n\r\nHumannature66 for his great input and thoughts on the Litheria Draugr Skirts. Also for some of the other goodies he\\'s brought to Skyrim.\r\nhttp://skyrim.nexusmods.com/users/1341839\r\n\r\nGinnyfizz for her input and ideas (Helgen) on the Litheria Draugr Skirts also.\r\nhttp://skyrim.nexusmods.com/users/196909\r\n\r\nKendo 2 for some nifskope tips he\\'s given me and the sweet NV comics and all the awesome clothing/armors past and present.  You can check all those out at his user page.\r\nhttp://newvegas.nexusmods.com/users/282595\r\n\r\nJonas66 for the blender tips and his amazing tutorials on Blender, Nifskope, Screenshots, etc.  Check out those if you\\'re interested in starting Blender along with his other great clothing mods.\r\nhttp://newvegas.nexusmods.com/users/241581\r\n\r\nNightasy for all of the amazing video tutorials he has done for modding Skyrim including a couple that covered some CK questions I didn\\'t know the answers to.\r\nhttp://skyrim.nexusmods.com/users/3076419\r\n\r\nBaron of Hell for the tip on Cidhna Mine Prison location that takes all of your belongings away and puts you back in regular prison clothes.\r\n\r\nBlender Foundation\r\n\r\nNifskope\r\n\r\nBethesda for creating the Fallout & Elder Scrolls series and allowing us to mod these games\r\n\r\nAnd everyone else that is among the credits of each of the people listed above!\r\n\r\nIf I\\'ve left anyone out at all please don\\'t hunt me down just yet.  PM me and I will gladly add you!\r\n\r\n\r\nLegal and licensing:\r\n--------------------\r\nIf you can make these look great then go for it but please at least include myself and the talented modders I\\'ve listed in your credits. Also just drop a line to me to let me know what your plans are so I can check out what you\\'ve done with them. Oh and teach me while you\\'re at it ha ha.   \r\n\r\n",
  "categoryId": "54",
  "version": "1.1",
  "author": "Tattooedillusions",
  "createdUnix": "1352392976",
  "updatedUnix": "1352596346",
  "containsAdultContent": true,
  "uploadedBy": "tattooedillusions",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98116",
      "name": "LitheriaDraugrSkirts",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2715",
      "fileName": "LitheriaDraugrSkirts-26614-1-0.7z",
      "uploadedUnix": "1352393262",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/82094c1bd5663cff194509f13878f418fdf6198b057ff1c41d747948d52e66bf/analysis/1407254350/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LitheriaDraugrSkirts-26614-1-0.7z?fid=98116&ttl=1535798821&ri=8192&rs=8192&setec=6255f3a8bc5d3ad8810e9690e0c47a03"
    },
    {
      "fileId": "98665",
      "name": "LitheriaDraugrSkirtsCidhnaMine",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "2",
      "fileName": "LitheriaDraugrSkirtsCidhnaMine-26614-1-1.7z",
      "uploadedUnix": "1352596346",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6a48501e5d6644a22218a031577fa698f96e816bcc50bb23fd232828f04d9f76/analysis/1407257764/",
      "changelogHtml": " Added the vanilla textured Draugr Skirt/Dress/Rags to Cidhna Mine Prison in Markarth so when you go to prison you can at least have something form fitting.  Thanks to Baron of Hell for the tip! <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LitheriaDraugrSkirtsCidhnaMine-26614-1-1.7z?fid=98665&ttl=1535798822&ri=8192&rs=8192&setec=7b084000eb68603d17a593d26b64a14f"
    }
  ]
}