{
  "modId": 26659.0,
  "modName": "White River Lodge",
  "summary": "A wilderness lodge-style player home made for low to mid-level players, as a showcase for your companions.",
  "descriptionHtml": "Conveniently located on the White River inbetween Riverwood and Whiterun. The White River Lodge is designed with the low to mid-level player in mind, it\\'s a dimly-lit and smokey lodge where the accomodations are comfortable but not extravagant. The front door opens directly into the main hall with it\\'s massive fire pit which is the focal point of the lodge. I mainly use this player home as a showcase for my followers - as a place for them to live and pass the time when I\\'m not using them.\r\n \r\nThe lodge comes with a (sometimes irreverent) housekeeper who cooks and cleans (also is a food vendor), and a bard-in-training who plays for rent and to entertain your companions. The bard does not sing - he only does instrumentals. But if you find even that gets annoying then feel free to kill him, I won\\'t mind.\r\n \r\nIn addition to the main hall there is a master bedroom, companion\\'s sleeping quarters, bard\\'s quarters, living area, kitchen, and armory / storage / housekeeper\\'s quarters.\r\n \r\nThe lodge is fully navmeshed by hand, which means that it is companion friendly. In order for your companions to live here though, you will need to use another mod that allows them to do so. Personally I use Amazing Follower Tweaks which has the option to \\\"Dismiss but hang out here\\\", and after doing so my companions eat, drink, sleep and pass their time at the lodge. I know there are other mods that let you do the same thing, I just forget the names.\r\n \r\nNote that there are no cheat rooms or free items here, and also note that there are currently no crafting stations. I will release an expansion later that has a crafting area below the ground floor. In the meantime you can just travel to Riverwood or Whiterun for your crafting needs, they are just around the corner.\r\n \r\nIf you download and like the house, then please endorse. Although I use this personally as my home in Skyrim, if I know that people like it and use it then I will be more motivated to release my additions to the house on the Nexus. This is my first release, I have plans for at least two more releases.\r\n\r\nI would like to hear any constructive thoughts and comments you might have, I would be happy to incorporate any ideas that coincide with what I have in mind for the house. Also feel free to upload pics of you and your companions at the lodge!\r\n\r\n[youtube]ADJUn3Q-9J4[/youtube]\r\n\r\n===========================================================================\r\n\r\nRequirements: None.\r\n\r\nInstallation: Download the file and extract the contents to your skyrim\\\\data folder.\r\n\r\nUninstallation: Delete the following files/directories:\r\nData\\\\WhiteRiverLodge.esp\r\nData\\\\Meshes\\\\Actors\\\\Character\\\\BWHousekeeper\r\nData\\\\Meshes\\\\Actors\\\\Character\\\\FaceGenData\\\\FaceGeom\\\\WhiteRiverLodge.esp\r\nData\\\\Textures\\\\Actors\\\\Character\\\\bwHousekeeper\r\nData\\\\Textures\\\\Actors\\\\Character\\\\FaceGenData\\\\FaceTint\\\\WhiteRiverLodge.esp\r\n\r\nThanks go to dimon99 for the DIMONIZED UNP body that the housekeeper uses.\r\n\r\nThe ENB that I use in the screen shots is Project ENB, with the sharpness tweaked up a lot. I also have the in-game brightness turned all the way down, which helps to give the lodge it\\'s intended dark & smoky atmosphere.",
  "categoryId": "67",
  "version": "1.0.0",
  "author": "beezer1",
  "createdUnix": "1352504606",
  "updatedUnix": "1352505954",
  "containsAdultContent": false,
  "uploadedBy": "beezer1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98371",
      "name": "Main File",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26438",
      "fileName": "Main File-26659-1-0-0.rar",
      "uploadedUnix": "1352505954",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/574dc4da990b5763ae1034e11173fac16be539a93f4642cdb7692cf52bda9ae7/analysis/1407259641/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-26659-1-0-0.rar?fid=98371&ttl=1535798900&ri=8192&rs=8192&setec=43b61fbd8ea52d6b5ced6f5ea739b823"
    }
  ]
}