{
  "modId": 26704.0,
  "modName": "Convenient Horse Herding",
  "summary": "Every horse that you own and ride becomes a member of your own herd. Choose any place as your herd camp or become a herd leader, rename horses and buy guardian dogs to protect your herd. Requires SKSE.",
  "descriptionHtml": "[center]\r<br />[img]http://static2.nexusmods.com/110/images/621184-1352563887.jpg[/img]\r<br />[youtube]nl5xNkp76A4[/youtube]\r<br />\r<br />\r<br />[url=http://www.skyrimgems.com][img]http://i.imgur.com/sSbds.png[/img][/url]\r<br />[/center]\r<br />\r<br />[heading]Features[/heading]\r<br />[list]\r<br />[*] Easy herd management with up to 30 horses.\r<br />[*] Rename herded horses and give them any name you like.\r<br />[*] Set the herd camp anywhere to have all horses in one place.\r<br />[*] Become a herd leader and have all horses travel with you.\r<br />[*] Fast travel back to the camp via dynamic map marker.\r<br />[*] Non-unique horses are automatically given random unique name when joining herd.\r<br />[*] Purchase up to 3 guardian dogs to protect your herd.\r<br />[*] Convenient Horses v4.5+ Horse Call integration.\r<br />[/list]\r<br />\r<br />[heading]Things You Should Know[/heading]\r<br />[list]\r<br />[*] Skyrim v1.9.32.0 and Skyrim Script Extender (SKSE) v1.7.0+ are required to run this mod.\r<br />[*] At first herding has been developed as integral part of Convenient Horses mod but I decided to release it separately because of SKSE requirements and purchased horses having their names reset.\r<br />[/list]\r<br />\r<br />[heading]Getting Started[/heading]\r<br />[u][b]Installation[/b][/u]\r<br />1. Update Skyrim to minimum 1.9.32.0 version.\r<br />2. Install or update SKSE to version 1.7.0 or greater.\r<br />3. You can now download and install the mod.\r<br />\r<br />[u][b]Uninstallation[/b][/u]\r<br />1. Open console and type (StopQuest CHHerding).\r<br />2. Save the game.\r<br />3. Uninstall the mod.\r<br />\r<br />[u][b]Loading[/b][/u]\r<br />As soon as you load your game with this mod your last ridden horse will be added to a herd first. To add other horses simply ride them. If horse does not have unique name it will be given random one which you can later change. Apart from getting unique name nothing new will happen until you buy Herding Equipment from any stable master.\r<br />\r<br />[heading]Feature Dscriptions[/heading]\r<br />[u][b]Herding Equipment[/b][/u]\r<br />Once purchased Full Herding Equipment (backpack w/ flag) will be automatically equipped and all your horses will travel with you. Your carry weight will be increased by 100 points while wearing the equipment. It is now a good moment to decide where you should set a camp for your herd, be it outside of your estate or somewhere in wilderness. Note that you can only set a camp in the main outdoor zone (aka Tamriel). To mark the spot as a herd camp you simply drop the equipment out of your inventory. If all conditions are met then flag will be placed in the front of you and backpack returned to you as a Basic Herding Equipment (backpack w/o flag) to allow you to keep the carry weight bonus. If you do not mark the camp spot and do not wear the equipment horses will simply wait in current location and if you store the equipment somewhere else all horses will travel to their original home locations.\r<br />\r<br />[u][b]Herding Flag[/b][/u]\r<br />Flag marks the spot of your herd camp where all your horses will gather. Flag will be displayed on your map and you can fast travel to it. When you activate the flag a menu will popup from where you can rename or dismiss your horses or you can pick up the flag and carry it to another location.\r<br />\r<br />[u][b]Horse Renaming[/b][/u]\r<br />You can initiate horse renaming procedure via Flag menu. Everything is done via dialogue system so you don&#39;t even need a keyboard. Horse selection dialogue will show up first where you will have to select one horse by name. After you select the horse a new dialogue will show where you can construct a new name, minimum of 3 and maximum of 40 characters. To construct the name use all available dialogue options and accept when done. Note that game doesn&#39;t not handle case sensitive strings well because of string caching so I had to use some tricks to make it happen therefore upper case letters are handled automatically. Pay attention to constructed name before accepting because it might rarely happen that it matches the string from a cache and have letter case ignored, in which case you will have to use different name.\r<br />\r<br />[u][b]Horse Dismissal[/b][/u]\r<br />Also available via Flag menu. Select a horse to be removed from herd. If you dismiss your last ridden horse game will think that you do not currently own a horse, until you mount one again.\r<br />\r<br />[u][b]Livestock Guardian Dogs[/b][/u]\r<br />You can purchase up to 3 dogs from any stable master that will guard your horses. Dogs will try to stick with the herd, randomly patrol between horses, are essential and cannot die. For each dog purchased every horse in your herd will receive increased passive health regeneration and will run away from threats. Only exception is your current last ridden horse which will receive no bonuses and will not be affected by herd behavior so you should use Convenient Horses or any other horse mod to control behavior of your last ridden horse. Dogs can be sold back to any stable master for a full refund.\r<br />\r<br />[u][b]Lost Equipment[/b][/u]\r<br />If you lose or misplace your equipment you can talk to stable masters to easily retrieve it. If equipment is permanently lost or destroyed you will have to restart the quest via console (StopQuest CHHerding) followed by (StartQuest CHHerding).\r<br />\r<br />[u][b]Convenient Horses Integration[/b][/u]\r<br />Calling and riding your herded horses has never been easier. If you have Convenient Horses v4.5 or higher use your horse call power while sneaking and you will be able to to call any horse from your herd by its name.\r<br />\r<br />[u][b]Compatibility[/b][/u]\r<br />[list]\r<br />[*] This mod works with all vanilla and custom horses from other mods, except summoned horses (Blaze works as it uses custom summon mechanics).\r<br />[*] Designed to be used with Convenient Horses mod.\r<br />[/list]\r<br />\r<br />[u][b]Credits[/b][/u]\r<br />Lorelai - Great support and creating horse name collection.\r<br />\r<br />\r<br />[heading]Change Log[/heading]\r<br />[list]\r<br />V1.2:\r<br />[*] Fixed all incompatibilities. Now works with Hearthfires DLC horses and changes to &#34;stables&#34; quest have been removed.\r<br />[*] Improved compatibility with non-english versions of the game when it comes to handling horse names.\r<br />[*] Display names are now permanent and do not need to be refreshed on each game load. Original names are now restored when stopping the quest to uninstall the mod, except horses that have been herded using older version of the mod.\r<br />[*] Added dialogue option to generate new random name when renaimng the horse.\r<br />[*] Guardian dogs can now be sold back to any stable master for a full refund.\r<br />[*] Guardian dogs will no longer retaliate if attacked by player.\r<br />[*] Herded horses should no longer leave the camp and travel to their original home locations. This was caused by removing them from an alias in order to refresh their name on load, which is no longer neccessary.\r<br />[*] Last ridden horse can now be dismissed from a herd.\r<br />[*] Fixed bug where purchasing herding equipment in interiors would mark it as stolen.\r<br />[*] Added missing script fragment which caused dialogue for purchasing all three dogs at once not working.\r<br />V1.1:\r<br />[*] Greatly reduced the chance of having duplicate random names assigned when horse is being herded.\r<br />[*] Horses will now walk while traveling to the flag instead of running.\r<br />[*] Fixed bug with herded horses sometimes running their default AI packages causing them to leave horse camp.\r<br />[*] Fixed bug causing herded horses to be dismissed during name update on game load.\r<br />[*] Fixed bug where health regeneration bonus would increase past the intended values if horse is in combat and where only first 5 horses would receive it.\r<br />V1.0.1\r<br />[*] Fixed CTD when dropping equipment due to corrupted BSA package.\r<br />V1.0\r<br />[*] Initial release.\r<br />[/list]",
  "categoryId": "83",
  "version": "1.2",
  "author": "Alek",
  "createdUnix": "1352565499",
  "updatedUnix": "1393331257",
  "containsAdultContent": false,
  "uploadedBy": "mitchalek",
  "primaryFile": null,
  "files": [
    {
      "fileId": "100716",
      "name": "Convenient Horse Herding v1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2579",
      "fileName": "Convenient Horse Herding v1_1-26704-1-1.zip",
      "uploadedUnix": "1353430659",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/bf2479f0f6548bbb38f9a1afdc738d017ec8c9b2ac494c9c45681a5c07ee9ad6/analysis/1407271205/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horse%20Herding%20v1_1-26704-1-1.zip?fid=100716&ttl=1535798962&ri=8192&rs=8192&setec=62f4300623eaed498c205e9ffe5fcd10"
    },
    {
      "fileId": "1000098706",
      "name": "Convenient Horse Herding v1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2583",
      "fileName": "Convenient Horse Herding v1_2-26704-1-2.zip",
      "uploadedUnix": "1393331257",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/7a112d400a7b3a3f98fab441e50acbc9f0cb005bc2500521051d87754b98cbf8/analysis/1407949687/",
      "changelogHtml": " Fixed all incompatibilities. Now works with Hearthfires DLC horses and changes to &#34;stables&#34; quest have been removed. <br/> \n Improved compatibility with non-english versions of the game when it comes to handling horse names. <br/> \n Display names are now permanent and do not need to be refreshed on each game load. Original names are now restored when stopping the quest to uninstall the mod, except horses that have been herded using older version of the mod. <br/> \n Added dialogue option to generate new random name when renaimng the horse. <br/> \n Guardian dogs can now be sold back to any stable master for a full refund. <br/> \n Guardian dogs will no longer retaliate if attacked by player. <br/> \n Herded horses should no longer leave the camp and travel to their original home locations. This was caused by removing them from an alias in order to refresh their name on load, which is no longer neccessary. <br/> \n Last ridden horse can now be dismissed from a herd. <br/> \n Fixed bug where purchasing herding equipment in interiors would mark it as stolen. <br/> \n Added missing script fragment which caused dialogue for purchasing all three dogs at once not working. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Convenient%20Horse%20Herding%20v1_2-26704-1-2.zip?fid=1000098706&ttl=1535798962&ri=8192&rs=8192&setec=c57d6638e436508d4813b698563c0910"
    }
  ]
}