{
  "modId": 26722.0,
  "modName": "Treebalance - Smithing Tree",
  "summary": "Streamlines and improves the Smithing perk tree.",
  "descriptionHtml": "[font=verdana]Normally, you can take just one or two perks (Steel Smithing and maybe Arcane Blacksmith) and need nothing else. Attributes among material classes vary so little compared to smithing bonuses that spending anything else in the tree had very little value. I\\'ve rebuilt the tree, but instead of just forcing you to take more perks for the same benefit, I\\'ve shifted things around and added new things. Each perk is now more valuable, but without changing end-game balance.\r\n\r\nThis will not be for everyone, but players who want a Smithing tree with perks that are useful and interesting while still being balanced will appreciate this. Importantly, [i]I do not add or remove any perks[/i]. Three perks were edited into new ones, but they\\'re the same base IDs. This means if you won\\'t lose any perks upon adding or removing this mod. Below is a list of the changes.\r\n\r\n\r\n[color=firebrick]Steel Smithing[/color] became:\r\n[color=skyblue]Craftsman:[/color] Can craft Steel items. All weapon and armor improving is 30% better.\r\n[list][*]Rather than immediately giving doubled smithing bonuses, I have spread these increases out over the tree in three perks. The opening perk, Craftsman, is the first. The shift from focusing on material type to simply applying to everything fixes the problem with some items not being affected, and importantly makes investing into the later perks in the tree more valuable by not front-loading the whole benefit.[/list]\r\n\r\n[color=firebrick]Elven Smithing[/color] became:\r\n[color=skyblue]Elven Foundry[/color]: Can create Elven, Dwarven, and Orcish armor and weapons at forges.\r\n[list][*]Elven Foundry has compressed Elven, Dwarven, and Orcish Smithing. It unlocks crafting of all three types of weapons and armor. Orcs and dwarves are elves, plus these three item classes were all roughly similar anyway (elven strongest weapons, orcish strongest armor, dwarven in middle on both), so the perks felt somewhat redundant before.[/list]\r\n\r\n[color=firebrick]Advanced Armors[/color] became:\r\n[color=skyblue]Advanced Smithing[/color]: Can create Scaled and Plate armor at forges. All weapon and armor improving is 40% better.\r\n[list][*]This still unlocks Scale and Plate, but because those are so statistically similar to the previous item classes, it also increases smithing of all items by 40%. This stacks additively with Craftsman for 70% total.[/list]\r\n\r\n[color=skyblue]Arcane Blacksmith[/color] is unchanged except that its new required perk is Advanced Smithing and not Craftsman.\r\n\r\n[color=firebrick]Glass Smithing[/color] became:\r\n[color=skyblue]Glassmaking[/color]: Can create Glass and Ebony armor and weapons at forges.\r\n[list][*]Glassmaking has taken the place of both Ebony and Glass Smithing, unlocking the crafting of both item classes. Ebony and malachite in Elder Scrolls are both volcanic glasses. They should be roughly similar to work. Because you\\'re already choosing between Light and Heavy Armors in their own perk trees, it always annoyed me that Smithing made you take the same choice. I\\'ve streamlined the system to remove that.[/list]\r\n\r\n[color=firebrick]Daedric Smithing[/color] became:\r\n[color=skyblue]Imbuing[/color]: Can create Daedric armor and weapons at forges.  All weapon and armor improving is 30% better.\r\n[list][*]Daedric is the best heavy armor and, without Dawnguard, the best weapon class. This only unlocks one type though, so I\\'ve also added the final improvement bonus. This stacks with Craftsman and Advanced Smithing for 100% total, which is the same doubled smithing bonus you got from the tree before, but now it applies to everything.[/list]\r\n\r\n[color=firebrick]Dragon Armor[/color] became:\r\n(Normal) [color=skyblue]Dragonsmith[/color]: Can create Dragon armor at forges. Dragons drop more items.\r\n(Dawnguard) [color=skyblue]Dragonsmith[/color]: Can create Dragon armor and Dragonbone weapons at forges. Dragons drop more items.\r\n[list][*]Besides just adding dragon crafting, this now makes killing a dragon much more valuable by spawning extra items on its corpse. You\\'ll see small added gold, more scales, and more bones. There\\'s also a much higher chance of weapons and armor (especially enchanted) and a new chance to spawn random jewelry. This will all be the same leveled gear you normally could find, and it works on any dragon you kill. This stacks with Salvage, by the way. Dragons will still have a chance to drop extra crafting items too if you\\'ve got both perks.[/list]\r\n\r\n\r\nBut wait... what about Dwarven, Ebony, and Orcish Smithing? Those perks haven\\'t been removed. They were simply transformed into something else entirely. These three new perks make the tree much more interesting. All three require Craftsman to unlock.\r\n\r\n[color=skyblue]Tanner[/color] (replaces [color=firebrick]Dwarven[/color], requires 30 skill): Tanning racks are more productive and you gain 50 carry weight.\r\n[list][*]This increases the yield of all tanning rack recipes by 50%, rounded down, minumum 1. Because that really isn\\'t good enough and because leather weighs a lot, I\\'ve also thrown in added carry weight to make the perk more valuable. Tanner provides another way to get more carry weight, plus helps earn smithing experience and money by giving you access to more leather. It\\'s a good multi-purpose perk with a low enough skill requirement to be taken early.[/list]\r\n\r\n[color=skyblue]Salvage[/color] (replaces [color=firebrick]Orcish[/color], requires 40 skill): Find bonus crafting items on enemies.\r\n[list][*]Everything you kill has a 33% chance to spawn a single (except leather strips, which spawn in groups of 5) bonus crafting item on death. These items are leveled and are mostly leather and ores, but can also include gems. Anything you kill has this chance, so you could go slaughtering bunnies and goats and still find things. The chance isn\\'t extremely high, but neither is the skill requirement. Take Salvage early and the extra items will really add up.[/list]\r\n\r\n[color=skyblue]Metallurgy[/color] (replaces [color=firebrick]Ebony[/color], requires 50 skill): Smelting is more productive and you find extra ores when mining.\r\n[list][*]Smelting now provides double the normal output. Mining with this perk gives you a 50% chance per ore mined to find a random extra ore in any vein where you\\'d normally have a chance to find gems (and this chance doesn\\'t conflict, so you don\\'t have a lower chance of gems with this perk). Much like gems, these extra ores can be of any type regardless of the vein being mined (iron is the most common, but they all can occur at any level). Metallurgy provides a huge increase to the amount of ingots you\\'ll be making, and thus the amount of crafting you can do.[/list]\r\n\r\n\r\nThis mod also fixes errors where Deer Pelt couldn\\'t be turned into leather and Dwarven Scrap Metal couldn\\'t be smelted. These now can be and work with the Tanner and Metallurgy perks.[/font]",
  "categoryId": "24",
  "version": "1.0",
  "author": "Kevin Kidder",
  "createdUnix": "1352586802",
  "updatedUnix": "1389738821",
  "containsAdultContent": false,
  "uploadedBy": "sushisquid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98642",
      "name": "SmithingTree100",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "SmithingTree100-26722-1-0.zip",
      "uploadedUnix": "1352586840",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b6419779f9c84fc1c6c77eaaa5ac5986be501ffed8b7ba6a62c23f06ce7498d3/analysis/1407257653/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SmithingTree100-26722-1-0.zip?fid=98642&ttl=1535798992&ri=8192&rs=8192&setec=21c64b55ea81c539663665fba6eed33f"
    },
    {
      "fileId": "1000091516",
      "name": "SmithingTreeDG101",
      "version": "1.01",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "SmithingTreeDG101-26722-1-01.zip",
      "uploadedUnix": "1389738762",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/e4e02e168fc9d5f14094abf72a3db7084e2f8af5fec37be3b2afb5a785f1c36e/analysis/1407886350/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SmithingTreeDG101-26722-1-01.zip?fid=1000091516&ttl=1535798993&ri=8192&rs=8192&setec=86e7d934f909014f441b65ac26b77422"
    },
    {
      "fileId": "1000091517",
      "name": "SmithingTreeDB100",
      "version": "1.00",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "SmithingTreeDB100-26722-1-00.zip",
      "uploadedUnix": "1389738821",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/6b7bb9c325ec36d0c7f4f203946c4269eb680a6345421895e243f8b4d160b1a5/analysis/1407886351/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SmithingTreeDB100-26722-1-00.zip?fid=1000091517&ttl=1535798993&ri=8192&rs=8192&setec=91053820e333d77f72ad123ea0c0e671"
    }
  ]
}