{
  "modId": 26720.0,
  "modName": "Ordinator Armor by Natterforme",
  "summary": "This is a Nexus Exclusive. This adds a set of Ordinator armor ported from an Oblivion mod with permission. \r\n",
  "descriptionHtml": "Name: Ordinator Armor Port by Natterforme\r\n Version: 1.00\r\n Date: 11/10/2012\r\n Category: Weapons and Armor\r\n Recommended: Skyrim Mod Manager\r\n Author(s): Natterforme\r\n Source: \r\n  \r\n Description\r\n ===========\r\n This is a Nexus Exclusive. This adds a set of Ordinator armor ported from an Oblivion mod with permission. \r\n Location\r\n ========\r\n All pieces of the set can be crafted at the crafting forge and can be tempered at the proper upgrading areas. The armor is stand alone and will not replace any vanilla armors.\r\n \r\n Details\r\n =======\r\n \r\n THIS IS A NEXUS EXCLUSIVE! NO STEAM SUPPORT WILL BE OFFERED AT THIS TIME! IF I FIND THAT THIS HAS BEEN UPLOADED TO STEAM WITHOUT MY PERMISSION I WILL NOT BE LENIENT TOWARDS THE UPLOADER(S). YOU HAVE BEEN WARNED!!!\r\n\r\nI have been informed that the updated textures will probably not be uploaded. CaBal120 did his best, but making new textures is very difficult and has told me that there is not much more we can do. I am sorry everyone^^. \r\n\r\nIf anything changes I will keep you all posted!\r\n\r\n \r\n This is a port of an original fan made mod in Oblivion. All credit to the original contributors are being recognized. If you are an original contributor and you believe that you have not been given proper credit, please feel free to PM me so that you can be added.\r\n \r\n This mod adds several items to the game. The set includes a cuirass, gauntlets, boots, and a helmet. All of the equipement can be used by both genders and the armor is compatiable with beast races. All pieces of the armor can be crafted at the crafting forge and can be tempered at the proper upgrading areas. All pieces of the armor come in Light Armor and Heavy Armor armor types, but are aesthetically the same. All types use ebony ingots to craft or upgrade. The light armor version needs the elven Smithing Perk to craft the items and has the stats of Elven armor. The heavy armor variety requires the Ebony Smithing Perk and has equivalent stats as Ebony. All pieces use the ebony gnd models at this time. Both Light and Heavy versions cost the same.\r\n \r\n ***CaBal120 is working on updating the textures to HD format. Currently the textures are the unchanged ones from Oblivion and are really low res. I have a couple of updated ones but I believe in uniformity over partial implementation. Until they are all completed the armor will be using the original textures. Please be patient. \r\n\r\n \r\n Install\r\n =======\r\n Either throw the folders into your Data directory or use the Nexus Mod Manager to do it for you.\r\n\r\n Uninstall\r\n =========\r\n Either use Nexus Mod Manager to remove the files or manually remove them from you Skyrim/Data folder. \r\n \r\n Upgrade\r\n =======\r\n I plan to upgrade and improve this mod over time as I fix bugs, think of new ideas, become more adapted to the CK, and so on. Be sure to check back in once and awhile for updates. Be sure to completely uninstall any previous versions of this mod before upgrading though.\r\n \r\n I will not take responsibility for corrupted save games or lost save games. Get into the habit of backing up your saves to protect your game data. Ignore at your own risk!\r\n\r\n Incompatibility\r\n ===============\r\n This mod should not be incompatable with any other mods to my knowledge. However it is always a possibility so please let me know about it if you experience a conflict.\r\n \r\n Known Issues or Bugs\r\n ====================\r\n \r\nThe plume on the male helmet does not fit the original texture and looks off. This is because the original had unfixable mesh problems and had to be replaced. The plume will work with the HD textures but for now they will remain as they are using the Oblivion textures. This is not a major issue but I do know about it so dont worry about telling me about it^^.\r\n \r\n \r\n  History\r\n ======= \r\n \r\n 11/10/2012- Version 1.0 Initial Release\r\n \r\n Contact\r\n =======\r\n You can find me on the Nexus Forums here as Natterforme.\r\n \r\n Credits\r\n =======\r\n Thanks to Cyro for creating the Oblivion version of this armor.\r\n Thanks to themythofanst for supporting and housing the armor in the Vvardenfell Imports mod in Oblivion.\r\n Thanks to sockit2me66 for his initial contributions to porting this armor and allowing me to take over the project.\r\n Thank you to CaBal120 for providing updated, high resolution textures to bring this armor into the future of TES games and allowing new and old players alike to enjoy this armor for many years to come(once implimented).\r\n Thanks to Bethesda for creating Skyrim and Oblivion.\r\n Thanks to SkyrimNexus.com for the a one-stop-shop resource for authors and players.\r\n Thanks to LHammonds for the Readme Generator this file was based on.\r\n Thanks to all of you who have encouraged me and have supported me since I first put up screenshots of my work back in December 2011 and January 2012.\r\n I thank you all for your patience with me^^.\r\n Thanks to God for creating us all. Amen.\r\n \r\n Tools Used\r\n ==========\r\n 7-Zip - http://www.tesnexus.com/downloads/file.php?id=15579\r\n Blender - http://www.tesnexus.com/downloads/file.php?id=12248\r\n NIFSkope - http://niftools.sourceforge.net/wiki/NifSkope\r\n Nexus Mod Manager - http://www.tesnexus.com/downloads/file.php?id=2097\r\n Paint.NET - http://www.tesnexus.com/downloads/file.php?id=11909\r\n Photoshop - http://www.adobe.com/products/photoshop/\r\n Readme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r\n\r\n Licensing/Legal\r\n ===============\r\n This is a Skyrim Nexus Exclusive.\r\n\r\n You MUST contact me before you do anything with this mod in any form for any reason. This includes language translations. This is a port of a popular armor in Oblivion and I do not claim credit for originally creating the mod in Oblivion. What I do claim credit for is the body morphing for both genders to the vanilla bodies and fixing mesh problems that existed with the Oblivion models. I will NOT be providing Steam Workshop support at this time. \r\n\r\n I do not feel comfortable with their legal policies towards modding so I will not use it. I will not support or endorse its use at this time. If I want it to be on Steam, I will do so myself. If you see this on Steam, LET ME KNOW! I will not support any version of this mod found on Steam. I will not accept any childish excuse about \\\"sharing\\\" with the community. If you refuse to respect my wishes, I can not, in good faith, respect yours.\r\n\r\n -Natterforme",
  "categoryId": "54",
  "version": "1.0",
  "author": "Natterforme",
  "createdUnix": "1352586027",
  "updatedUnix": "1352586115",
  "containsAdultContent": false,
  "uploadedBy": "Natterforme",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98640",
      "name": "Ordinator Armor Official Release1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9935",
      "fileName": "Ordinator Armor Official Release1_0-26720-1-0.zip",
      "uploadedUnix": "1352586115",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1f74b1d1107d72c391e097183c33f3e76f18c8cc8c694cc96959702e7e9334d7/analysis/1407257649/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20Armor%20Official%20Release1_0-26720-1-0.zip?fid=98640&ttl=1535798989&ri=8192&rs=8192&setec=156b2e68a55d1e9e93eaa163e4563493"
    }
  ]
}