{
  "modId": 26754.0,
  "modName": "No More Frost Resistance - A Magicians Mod",
  "summary": "Removes all innate frost resistance from enemies in Skyrim and all nords, including the player.",
  "descriptionHtml": "So you\\'ve made a dazzling frost mage with access to all the chilly arcane incantations that such a refined purveyor of magic should have. You venture forth in Skyrim to wield your freezing spells against your myriad enemies only to find to your dismay that MORE THAN HALF of your god damn enemies have 50% frost resistance. That\\'s almost all the higher-level animals, all draugr, all other undead creatures, many Dwemer constructs have half or FULL frost resistance, all Nords, Vampires in Dawnguard, frost trolls, and countless others. This is utterly ludicrous. Neither of the other Destruction elements have this kind of problem, with many enemies having an actual WEAKNESS to fire, making most frost spells indisputably obsolete especially given how ineffectual their \\'slow\\' effect turns out to be.\r\n\r\nIf you want to be a frost mage (read: actually find yourself in a position to viably use any frost spell more than once a year) without being incredibly nerfed because of poor game design, grab this mod and make ice and snow a force to be reckoned with.\r\n\r\n-WHAT EXACTLY IT DOES-\r\nIt removes the \\\"Frost Resistance\\\" effect from the game. Enchantments and potions will still be fully functional for all actors including the player. Magic absorb, and nonspecific magic resistance are still fully functional. Nord racial frost resistance will be non-functional including for the player. Frost Atronachs have thier old resistance because, hey, it\\'s an atronach, and secondly many frost mages rely on their resistance to be able to spam frost AoE. No enemy in the entire game (except Frost Atronachs) that isn\\'t wearing frost resist items will have resistance to frost. This is not exactly unbalanced as laughably few enemies have resistance to the other two elements.\r\n\r\n-HOW TO INSTALL AND UNINSTALL-\r\nJust use NMM or manually copy the .esp file to the Data subfolder of your Skyrim installation. To uninstall delete that file.\r\n",
  "categoryId": "93",
  "version": "1.00",
  "author": "tryingtocheerup",
  "createdUnix": "1352646919",
  "updatedUnix": "1352651543",
  "containsAdultContent": false,
  "uploadedBy": "tryingtocheerup",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98792",
      "name": "No More Frost Resistance",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "0",
      "fileName": "No More Frost Resistance-26754-1-00.7z",
      "uploadedUnix": "1352647029",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/772ba5e42dac5d3d8637428038a5bbc399bdbe47c28aa9f3af35b019f145e6b5/analysis/1407258562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20More%20Frost%20Resistance-26754-1-00.7z?fid=98792&ttl=1535799041&ri=8192&rs=8192&setec=ac37b6a830a34651064596c64ddb154b"
    },
    {
      "fileId": "98808",
      "name": "No More Frost Resistance",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "No More Frost Resistance-26754-1-01.7z",
      "uploadedUnix": "1352651543",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/6590a9629e5046c30cf0cf35c79c211be9a386f6b833929478b3e72d8b2642bf/analysis/1407258723/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20More%20Frost%20Resistance-26754-1-01.7z?fid=98808&ttl=1535799042&ri=8192&rs=8192&setec=9a284c37abe418d7b4c5835077c5507b"
    }
  ]
}