{
  "modId": 26753.0,
  "modName": "One Year Later - Starting Orc Character",
  "summary": "Two Saved Game Choices in Honor of the one year anniversary of the release of Skyrim!\r\nThe orc47to81 will give you a level 47 character with NO SKILLS ready to become lvl 81.",
  "descriptionHtml": "Requires Skyrim version 1.8.151.0.7 or higher.\r\n\r\nNOT SUPPORTED ON OLDER VERSIONS!!!\r\n\r\n\r\nThese save games DO NOT require any DLC\\'s or mods.\r\n\r\nI leveled up entirely in vanilla Skyrim.\r\n\r\nThe orc47to81 will give you a level 47 character with NO SKILLS ready to become lvl 81.\r\n\r\nIn honor of the one year anniversary of the release of Skyrim on 11-11-11 i am releasing my main starting character, a good male Orc exactly one year(and one hour) later in game from the time Hadvar says to you \\\"You there step forward\\\" and \\\"who are you\\\" and you select your race and begin the adventure. This happens on Morndas 8:31AM, 17th of Last Seed 4E 201. My 1yearlater.ess save game is on  Morndas 9:31AM, 17th of Last Seed 4E 202 right outside of Riverwood ready to discover it.\r\n\r\nI have leveled 7 characters to 81 in the past year but did it mostly with custom races. Frustrated by all of the problems and incompatibles custom races created and modders not keeping up with patches and DLC releases i created a new Orc character. Selected Master difficulty and played through Hardcore , meaning if i died i had to start with a brand new game.\r\n\r\nThis is a unique character, only the minimal quests have been done, such as getting into the thieves guild to train lockpick and archery. I have been very careful not to do any quests or even begin the game, all i did was level up legitimately.\r\n\r\nBoth save games will give you a level 81 character with 100 in all stats except Pickpocket which is 90.\r\n\r\nI wanted to create a good Paladin type class so i was very careful not to murder, steal or pickpocket anyone so check the crime tab.\r\n\r\nSome unique things you will notice,  things like i have never been to Riverwood or Whiterun or Solitude. All leveling up has been done in Windhelm and Riften.\r\n\r\nIt took me approximately 6 weeks real time to level this character up.\r\n\r\nOnly the year later save game has The Book of Love Quest completed and the Dragon Stone ready to be delivered, with a few Essential Dragon Shouts ready to be unlocked.\r\n\r\nIf you want to choose all your skills choose the orc47to81.ess save game.\r\n\r\nIf you want the one year later character choose the 1yearlater.ess save game.\r\n\r\nEnjoy!\r\n",
  "categoryId": "43",
  "version": "1.0",
  "author": "gloomfrost",
  "createdUnix": "1352646325",
  "updatedUnix": "1352646392",
  "containsAdultContent": false,
  "uploadedBy": "gloomfrost",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98789",
      "name": "One Year Later Save Games",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3858",
      "fileName": "One Year Later Save Games-26753-1-0.zip",
      "uploadedUnix": "1352646392",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3aac3e789ce26e19793fe9e3a7f7e082a9c77c0e6b4b320c08ab2d6809eed804/analysis/1407258562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/One%20Year%20Later%20Save%20Games-26753-1-0.zip?fid=98789&ttl=1535799040&ri=8192&rs=8192&setec=d7be8014dec64d1c9aff2a6e7eeed3dc"
    }
  ]
}