{
  "modId": 26759.0,
  "modName": "Blood on ice Sangue su ghiaccio fix",
  "summary": "Questa mod risolve un problema con la missione Sangue su ghiaccio (windhelm), attivata prima o durante la guerra civile. Italiano. English users with Tes5edit is easy convert it to english or other language.",
  "descriptionHtml": "Se la missione Sangue su ghiaccio (blood and ice) è attivata durante l\\'attacco di windhelm (missione guerra civile lato imperiale) o l\\'attacco viene eseguito prima del completamento della missione essa è impossibile  da portare a termine. Questa mod risolve tale problema. Deve essere caricata nel gioco solo dopo aver riscontrato il problema. Può essere rimossa dopo il completamento della missione.\r\nRichiesta versione 1.7.7.0 del gioco o superiore\r\nEnglish users: The blood on ice quest is bugged when is actived when is happening the windehelm attack or if you attack windehelm after the graveyard scene is trigged but before the quest is completed . This mod fix that if you load into the game after the bug rise. This mod is in italian but using tes5edit you can translate this into your language( it change only some dialogue conditions but not the dialogue\\'s texts). You can upload the new file but you must give me credit and link this page to your mod page and send to me the link of your page( that I will include in this page). It can be removed after quest ended.\r\nVersion 1.7.7.0 required or above",
  "categoryId": "95",
  "version": "1",
  "author": "llde",
  "createdUnix": "1352650496",
  "updatedUnix": "1352650794",
  "containsAdultContent": false,
  "uploadedBy": "llde",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98806",
      "name": "blood on ice fix italian",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "blood on ice fix italian-26759-1.7z",
      "uploadedUnix": "1352650794",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/8af278cb6e4601e236086c6856f4b3546c4439e8016b46b897961a8944b88247/analysis/1407258722/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/blood%20on%20ice%20fix%20italian-26759-1.7z?fid=98806&ttl=1535799049&ri=8192&rs=8192&setec=d392ff8d6d961d7aeba999054eb5ad0c"
    }
  ]
}