{
  "modId": 26760.0,
  "modName": "SkyRealism--ENB Evolved Vibrant--Personal Performance Settings",
  "summary": "My personal performance-oriented ENB settings originally based on ENB Evolved (Vibrant). Intended for use with older ATI HD4XXX (or nVidia equivalent) video cards with limited memory and bandwidth.",
  "descriptionHtml": "[img]http://i34.photobucket.com/albums/d135/soulassassin547/misc/TESV2012-11-1003-52-57-36.jpg[/img]\r<br />[b]SkyRealism -- ENB Evolved Vibrant -- Personal Performance Settings[/b]\r<br />[i]Custom-tuned fast performance version by sa547\r<br />Based on the original by IndigoNeko\r<br />\r<br />[b][center][color=#00ff00]THIS NOT-FOR PROFIT PRESET CAN BE DOWNLOADED AND USED FREE OF CHARGE[/color][/center][/b][/i]\r<br />----------------------------\r<br />[b]Updates[/b]\r<br />Version 1.5 released for ENB version 0.123, with additional configurations; 1.0 also available for 0.119.\r<br />\r<br />----------------------------\r<br />[b]Description[/b]\r<br />----------------------------\r<br />This ENB setting was modified to accommodate some older GPUs (circa 2008) with smaller VRAM (256-512mb) and limited bandwidth (64bit or 128bit), especially 9XXX-series geForces and HD4XXX-series Radeons, by lowering the quality in exchange for increased performance while giving out some desired FX such as blooming (for that hazy look), SSAO and DOF, or optionally you can turn them off and leave blooming enabled only.\r<br />\r<br />At 800x600 --- currently my gameplay resolution --- this setting provides a good FPS rate (most graphical details to 75-100%, 20-30fps outdoors, 30+ fps indoors) with Powercolor Radeon HD4670 with 512mb VRAM and 128-bit bandwidth. \r<br />\r<br />However, I believe that better performance and quality levels at higher resolutions can be achieved with more recent GPUs with bigger VRAM and bandwidth. Or if you dare, install performance enhancers such as HiAlgo to up the framerate. \r<br />\r<br />----------------------------\r<br />[b]For Best Results...[/b]\r<br />----------------------------\r<br />Setup for Catalyst 12.6 [i]control panel[/i] (or nVidia equivalent) is as follows: 4XAA (anti-aliasing), 16XAF (aniso), Catalyst AI set to Advanced, mipmap set to Quality, vertical refresh set to Off (or On if needed, I had it off as I use a CRT), Adaptive AA set to Enabled/Performance, and OpenGL triple-buffering enabled. \r<br />\r<br />On the Skyrim launcher, you set up the video with no anti-aliasing and anisotropy set at 16 (or not), but FXAA is disabled.\r<br />\r<br />(The configurations presented are what I use on my rig, but ultimately it depends on how you want your GPU be set up for a balance between performance and quality within a limited amount of system resources, it&#39;s a matter of personal preference.)\r<br />\r<br />Also as an option (provided that you first backup), better stability and performance could be obtained by using texture conversion tools to reduce the size of DDS files which could eat up precious VRAM and partly cause CTDs.\r<br />\r<br />As always, updated video card drivers are a must (lest it fails and you have to roll back to an older yet more stable version).\r<br />\r<br />To get some eyecandy within the limits of my PC, I use low/mid-res versions of popular visual enhancement mods such as W.A.T.E.R. and Skyrim Flora Overhaul. As with all Evolved ENBs, this is to work in conjunction with Realistic Lighting with Customization.\r<br />\r<br />You can adjust brightness, contrast and color levels in-game by the use of MyGoodEye&#39;s IMAGINATOR.\r<br />\r<br />----------------------------\r<br />[b]Requirements[/b]\r<br />----------------------------\r<br />The original ENB Evolved settings I based on can be obtained here:\r<br />http://skyrim.nexusmods.com/mods/23765\r<br />\r<br />As per Boris Vorontsov&#39;s insistence, I contain only the necessary setting files (and none of his executables), and for ENB itself you&#39;ll have to get 0.119 from his site:\r<br />http://enbdev.com/index_en.htm\r<br />\r<br />BTW, it&#39;s best to play the game with the darned lights [i]off[/i].\r<br />\r<br />----------------------------\r<br />[b]Installation[/b]\r<br />----------------------------\r<br />Open and unzip with a free utility like 7-zip, then copy the contents into the Skyrim program folder.\r<br />\r<br />----------------------------\r<br />[b]Uninstallation[/b]\r<br />----------------------------\r<br />Within the Skyrim program folder, find all files beginning with ENB*, and then either you delete or move them elsewhere.\r<br />\r<br />----------------------------\r<br />[b]Notes[/b]\r<br />----------------------------\r<br />For performance purposes I have by default enabled only EnableBloom and EnableSunRays to true, and all others -- including ambient occlusion and depth-of-field (both enabled in the config by default) -- can be disabled for more performance (there is at least one that I have disabled because of a weird grainy red effect when turned on); these can be changed according to personal preferences and GPU specs.\r<br />\r<br />Although the lowest resolution on the Skyrim launcher allows you only to set at 800 x 600 (which is my current default given the limitations of the HD4670 video card), a resolution of 640 x 480 can be set by opening SkyrimPrefs.ini and finding these lines:\r<br />\r<br />iSize H=600   \r<br />iSize W=800\r<br />\r<br />edit them to become\r<br />\r<br />iSize H=480   \r<br />iSize W=640\r<br />\r<br />At such a resolution, you can play the game with most ENB effects on with reduced pressure on the GPU, but the consequence is that you have the smallest screenshot possible.\r<br />\r<br />----------------------------\r<br />[b]Backstory[/b]\r<br />----------------------------\r<br />Originally for the first two months after assembling my PC and installed Skyrim, I played the game in vanilla and cut down the resolution to the lowest possible, believing that my GPU couldn&#39;t handle more. But then I decided to try out and began with a well-known graphics enhancer, used it for a month until I felt I needed to bring out more oomph from my Radeon.\r<br />\r<br />So I did, updated Catalyst to the most stable possible version, made changes, and then gave ENB a shot... and what I could say? Utterly mind-blowing. \r<br />\r<br />I was impressed by the way it changed how I look at Skyrim; the game became vivid and more lifelike that I was enticed to install improved texture packs to heighten the experience. At the same time I started playing around with various ENB settings, looking for what I really wanted, until I found ENB Evolved.\r<br />\r<br />I became stuck with ENB Evolved for a lot of good reasons: balanced colors, saturation, contrast and brightness; reasonably visible nights and interiors, excellent depth-of-field algorithms, works well with Realistic Lighting with Customization, and most importantly, an instructive, concise and useful user&#39;s manual.\r<br />\r<br />Having used this modified setting for some time, I felt I have to share it to everyone else playing this game, striking the balance between performance and stability, and stunning visual quality and clarity.\r<br />\r<br />----------------------------\r<br />[b]Parting Words[/b]\r<br />----------------------------\r<br />Asides from this ENB setting, also I created a set of customized retextures based on anano&#39;s popular school uniform armor set, and I would like to share them. The problem is that apparently anano has yet to know how to use the private messaging system, and so it&#39;s hard to gain permission to upload those retextures, so until he finally figures out the system, for now I can only show you some screenshots of those retexts.\r<br />\r<br />As this is an occasion, a year&#39;s worth of Skyrim, I think this will be a fine gift for those who want their Skyrim to look good even on an older PC, without having any performance issues. So, enjoy and live long. ;)\r<br />\r<br />-----------------------------\r<br />[b]Distribution and Alteration[/b]\r<br />-----------------------------\r<br />Players are free to download this pack and alter the settings according to their preferences, but re-distribution of modified ENB Evolved settings prior to uploading requires prior notification to IndigoNeko, as well as credits to his name.\r<br />\r<br />----------------------------\r<br />[b]Credits[/b]\r<br />----------------------------\r<br />SkyRealism – ENB Evolved by IndigoNeko, with bokeh effects by Matso, and FX files by Tapioks\r<br />\r<br />ENB 0.119 by Boris Vorontsov\r<br />\r<br />All other mods mentioned are properties of their respective authors. No rabbits were harmed in the production of this ENB setting.",
  "categoryId": "62",
  "version": "1.5",
  "author": "sa547",
  "createdUnix": "1352651682",
  "updatedUnix": "1354950497",
  "containsAdultContent": false,
  "uploadedBy": "sa547",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98816",
      "name": "ENB Evolved Vibrant -- PPS 1p0 _Modified_",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "128",
      "fileName": "ENB Evolved Vibrant -- Personal Performance Settings _Modified_-26760-1-0.zip",
      "uploadedUnix": "1352653297",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1b4d0c80a1acfa9fb8dae68cea0328071100b947bae0e5a5e2d2c52da32d2f71/analysis/1407258843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ENB%20Evolved%20Vibrant%20--%20Personal%20Performance%20Settings%20_Modified_-26760-1-0.zip?fid=98816&ttl=1535799051&ri=8192&rs=8192&setec=b276ed1f7450294129a705776968cb21"
    },
    {
      "fileId": "103796",
      "name": "ENB Evolved Vibrant -- PPS 1p5 _Modified_",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "129",
      "fileName": "ENB Evolved Vibrant -- PPS 1p5 _Modified_-26760-1-5.zip",
      "uploadedUnix": "1354950497",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/d765363aa8dcfbf3be81778ee3e1be91c2578b79637cf594b7b52dbad0523b73/analysis/1407294903/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ENB%20Evolved%20Vibrant%20--%20PPS%201p5%20_Modified_-26760-1-5.zip?fid=103796&ttl=1535799052&ri=8192&rs=8192&setec=fc396debc87452a18004ee4a73e6e252"
    }
  ]
}