{
  "modId": 26775.0,
  "modName": "More Non-Alcoholic Drinks",
  "summary": "Adds two new drinks to innkeepers and bartenders across Skyrim.",
  "descriptionHtml": "[b]More Non-Alcoholic Drinks[/b] by Sparrow\r\n\r\nLet\\'s face it, Nord culture is pretty much based around two things: getting drunk, and smacking people in the face. A sober Nord is a grumpy Nord, and this goes some way to explain why every single tavern in Skyrim offers ale, mead, wine, even brandy... and not a single drop of any other beverage. \r\n\r\nThat\\'s where I come in.\r\n\r\nThis mod adds bottles of water and milk to Skyrim\\'s innkeepers and bartenders, allowing those of us who don\\'t fancy getting piss-drunk every time they want to wet their whistle to do so soberly.\r\n\r\nThe bottles of water and milk restore ten points of stamina and health respectively, but unlike the other drinks they do not impact regeneration. They should theoretically cost the same as standard Ale - when I tested it with a fresh-outta Helgen character all three drinks would set me back 16 septims.\r\n\r\nThis mod has been cleaned with TES5Edit, so it only modifies what I want it to.\r\n\r\n[b]Installation[/b]\r\n\r\nDownload the mod and drag-and-drop the contents into your Data folder. Shouldn\\'t be any more complicated than that.\r\n\r\n[b]Compatibility[/b]\r\n\r\nThis mod is compatible with Dawnguard as far as I am aware. However, there may be compatibility issues with Hearthfire and most needs mods. If anyone can help with these, please message me to see if we can work something out (you will be credited on the main page of the mod and in the readme).",
  "categoryId": "85",
  "version": "1.0",
  "author": "Sparrow",
  "createdUnix": "1352673042",
  "updatedUnix": "1352673091",
  "containsAdultContent": false,
  "uploadedBy": "Summergale",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98903",
      "name": "More Non-Alcoholic Drinks",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "More Non-Alcoholic Drinks-26775-1-0.zip",
      "uploadedUnix": "1352673091",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/803485a1beb0507beb07e9af16dfe3e273c1c5ce6f0b513227b1a6911b510da9/analysis/1407259365/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Non-Alcoholic%20Drinks-26775-1-0.zip?fid=98903&ttl=1535799078&ri=8192&rs=8192&setec=1af6c1459d0e9d716f0d5ac8fc66e014"
    }
  ]
}