{
  "modId": 26778.0,
  "modName": "Heros_Respite_Home",
  "summary": "This is a free player home located near the area of Rorikstead!",
  "descriptionHtml": "Welcome to Hero’s Respite!\r\n\r\n(This is the first mod I\\\\\\'ve put on the nexus, so please let me know if something doesn\\\\\\'t work correctly).\r\n\r\nThis mod is also available on the Steam Workshop: http://steamcommunity.com/sharedfiles/filedetails/?id=102409942\r\n\r\nVERSION 1.2 FIXES:\r\n\r\nVersion 1.2 fixed an issue where the weapon rack nearest to the entrance door in breezehome was not placed correctly.\r\n\r\nVERSION 2.0 FIXES / ADDITIONS:\r\n\r\nI added a stairway going up to the home, toned down the lighting in the basement vault area, and move a couple of the mannequins along the walls in the vault to the ground. (The mannequins are still the same mannequins so they should not have any issues if you have something stored on them, if there is an issue please let me know)/\r\n\r\nThis is a player created home, for the player who needs a good home! I created this place of R&R for the champion who wants to be alone with their thoughts, craftsman’s (or craftswoman’s) trade, or simply a place to store their valuables.\r\n\r\nA NOTE ON COMPATABILITY:\r\n\r\nThis home was created using ONLY assets from vanilla Skyrim and does NOT contain anything from the Dawnguard or Hearthfire expansions… Because I am poor… and I haven’t bought them yet. Other than modules which conflict with the location of this home it should theoretically work with anyone’s game and any expansion. It has not been tested with other modules, so if issues arise with anything please let me know so I can mention it in the description!\r\n\r\n*** A potential issue has been brought to my attention with this mod, and that is the game\\'s either freezing or crashing when you try to enter the basement area. I have so far only heard of 1 instance of this happening, and I am looking into what may be causing it. If anyone else experiences this issue PLEASE let me know as soon as possible! Thank you very much! ***\r\n\r\n*** If you have a LOT of breeze home mods, I have heard 1 report that there may be issues running with my mod and the breeze home mods installed. The mod should be able to run properly if a couple of the breeze home mods are taken out of the load order / not being used at the same time with this mod. I have no information on WHICH breeze home mod(s) were causing the issue at this time. ***\r\n\r\nHOW TO INSTALL:\r\n\r\nI forgot to change this from the steam page description, my apologies for that!\r\n\r\nIn lieu of typing out all of the instructions I am providing a URL to the tesnexus wiki page which will give very good instructions on how to install my file!\r\n\r\nhttp://wiki.tesnexus.com/index.php/How_to_install_Skyrim_mods\r\n\r\nHOW TO GET TO THE HOME:\r\n\r\nI debated back and forth about creating a quest to get the home and buy it, but ultimately decided against it. There will be a new map marker in your game (near the area of Rorikstead) once you have the mod loaded that you can walk / run / ride / fly / teleport / however you prefer to travel to.\r\n\r\nOnce you get to the outside gate you will find a large Dwemer chest on the wall. This chest contains the key which can open the gate, and the house.\r\n\r\nOnce you get into the house, directly next to the front door, there will be a table with a book and a key on it. The book explains some of what is in the house, and the key is for the basement.\r\nOnce you have access to the house the map marker can be fast-traveled to. It will lead to the front door.\r\n\r\nFANTASTIC! NOW, WHAT DOES MY HOME INCLUDE?:\r\n\r\nKeep in mind that I created this mod with the single player, or the player who wants to get away from everyone in mind. It is fully navmeshed so you can bring a companion (or ball-and-chain) along for the night, otherwise unless you have a mod which allows it, you will not be able to bring your spouse long to live there with you.\r\n\r\nBoth inside of the home itself and the basement area are set to non-public, and non-respawning, so nothing should go missing if you put something in your new home!\r\n\r\nOutside Grounds:\r\nVarious harvestable plants.\r\nA mini-farm with some vegetables for those of you who don’t like meat.\r\nGreat looking walkways from the gate to your home.\r\nA reading nook under a large beautiful tree with a burning fire for those cold nights.\r\nA chopping block so you can stay stocked up with wood for your fires.\r\nA patio looking out onto the landscape.\r\nWriting tables.\r\nSittin’ an’ watchin’ chair facing east for those majestic sunsets.\r\nArchery targets placed strategically around your grounds and by the road for someone who wants to shoot something while they wait for the sun to rise.\r\n\r\nInside Home – Ground Level:\r\nFully stocked bar to forget those late nights and bad decisions.\r\nFully stocked kitchen with a wash basin.\r\nVegetable & Meat chests, because you simply cannot mix those if you want to stay healthy.\r\nA Chef’s outfit, because who really wants to get their nice new outfit dirty while preparing a meal?\r\nA Fancy Fireplace!\r\n2 Bookshelves (88 books total storage)\r\n\r\nInside Home – Upstairs:\r\nA lavish bed to rest your head.\r\nA writing desk for your nightly musings.\r\nLockbox for your jewelry and spare change while you sleep.\r\n2 mannequins.\r\n3 weapon racks (each holds 2 weapons).\r\n2 weapon plaques (each holds 1 weapon)\r\n3 wardrobes for your daily clothing storage.\r\n1 bookshelf (holds 44 books)\r\nShrine room (Zenithar, Talos, Stendarr, Nocturnal, Mara, Kynareth, Julianos, Dibella, Arkay, Akatosh)\r\n1 mead barrel (non-respawning)\r\n\r\nBasement (Main Area):\r\nIt’s an abandoned Dwemer Hall! OHMERGERD!\r\nDoomstones (13 total… I could get them to function but couldn’t get the pretty light-show to work when you activate them, still I think they look acceptable without it).\r\nRunning river with water wheels powered by Dwemer technology.\r\n4 mannequins.\r\n4 weapon racks (8 weapons total).\r\n11 chests for all of your metals.\r\nA chest for your skins.\r\nSmelter, forge, workbench, sharpening wheel, tanning rack.\r\n\r\nBasement (Training Area):\r\nLong range with dummies and targets to fire your arrows and spells at.\r\nCircle training area for all of your fancy melee combat training.\r\n4 weapon racks (8 weapons total).\r\n8 weapon plaques (8 weapons total).\r\n\r\nBasement (Alchemist’s Alcove):\r\nSummoning circle (comfortable enough for even the pickiest of minions, yet strong enough for the ones with anger issues).\r\nHerb gardens with a variety of herbs for any need.\r\nAlchemist’s workbench.\r\nEnchanter’s table.\r\nShelves with stuff\r\n1 chest for alchemy ingredients, and 1 for enchanting items.\r\n2 bookshelves (108 books total).\r\n\r\nBasement (EXTRA Secure Vault):\r\nAin’t no one getting in this place unless you tell them to!\r\n4 huge Re-spawning mead barrels (technically 1 of them is for spiced wine).\r\n37 mannequins.\r\n9 shield plaques.\r\n16 weapon racks (32 weapons total).\r\n16 bookshelves (384 books total).\r\n1 doubly-secure safe.\r\n12 free-standing weapon display cases with activators.\r\n36 dagger display cases with activators.\r\n10 large display cases WITHOUT activators so you can drag and place anything that will fit into them.\r\n\r\n\r\nANOTHER QUICK NOTE (THIS TIME ABOUT UPDATES):\r\n\r\nI am willing to update this mod if issues arise, and will be checking comments regularly to see what people think and / or what issues may have arisen. I don’t want to update anything that may cause someone to have issues in their game, so placement and contents / respawn-ability of containers will not be changed.\r\n\r\nThe location of the home will NOT be changed.\r\n\r\nThere will NOT be any NPC’s added (as I stated previously, this is intended as a get-away home).\r\n\r\nI WILL update navmesh / lighting / placement of NON container objects or shelves if it seems necessary and enough people want it.\r\n\r\n\r\n\r\nThank you for trying out this home!\r\n\r\nPlease feel free to like and endorse my mod if you enjoyed it!\r\n\r\nTell your friends about it!\r\n\r\nIf you want to see examples of more of my work please visit my portfolio website!\r\n\r\nwww.wix.com/mg_laird/leveldesign",
  "categoryId": "67",
  "version": "2.0",
  "author": "Michael Laird",
  "createdUnix": "1352678917",
  "updatedUnix": "1353014430",
  "containsAdultContent": false,
  "uploadedBy": "mglaird",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98933",
      "name": "HerosRespiteHome",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "320",
      "fileName": "HerosRespiteHome-26778-1-1.zip",
      "uploadedUnix": "1352678999",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f0db703594af5b69ffad69b7c27200d626907b2dcf019d25fe9a690e540ec19a/analysis/1407259507/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HerosRespiteHome-26778-1-1.zip?fid=98933&ttl=1535799081&ri=8192&rs=8192&setec=55d353467a1c57ab059ffe42444b9e93"
    },
    {
      "fileId": "99260",
      "name": "Heros_Respite_Home_V1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "320",
      "fileName": "Heros_Respite_Home_V1_2-26778-1-2.zip",
      "uploadedUnix": "1352827933",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/31b322399b31ede99057e60ae9e8913813593076642c03b3a4bf7b726853e68f/analysis/1407261610/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Heros_Respite_Home_V1_2-26778-1-2.zip?fid=99260&ttl=1535799081&ri=8192&rs=8192&setec=ad9a1b23e1fc7d2fbdd7cd6c9ea7b1c7"
    },
    {
      "fileId": "99696",
      "name": "HerosRespiteHomeV2_0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "371",
      "fileName": "HerosRespiteHomeV2_0-26778-2-0.zip",
      "uploadedUnix": "1353014430",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/12a5ab7d925d47cf7a07b826bfa1aa8105cad84f0f616e6ba48ff22d5e9acf73/analysis/1407264364/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HerosRespiteHomeV2_0-26778-2-0.zip?fid=99696&ttl=1535799082&ri=8192&rs=8192&setec=67043c32add296067a2cb558dcb47b9c"
    }
  ]
}