{
  "modId": 26783.0,
  "modName": "Tribunal Robes Standalone Recolored Sets",
  "summary": "This mod adds a standalone burgundy re-texture and a very black re-texture of Zairaam&#39;s Tribunal Robes. For both male and female&#33; Original mod is still required.",
  "descriptionHtml": "                                       HAPPY ONE YEAR ANNIVERSARY OF SKYRIM&#33;&#33;&#33;\r<br />\r<br />\r<br />NOTE: You still at least need the textures from the original mod by Zairaam installed. Download Tribunal Robes V2. You can find it [url=http://skyrim.nexusmods.com/mods/20077]here[/url].\r<br />\r<br />Also, if you have any texture glitches or problems, try downloading [url=http://www.nexusmods.com/skyrim/mods/61010/?]this mod[/url].\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Description\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />This is my one year Skyrim anniversary present to everyone&#33;\r<br />\r<br />This mod offers two standalone re-textures of my favorite armor mod Tribunal Robes by Zairaam. It includes a burgundy re-texture, and a very black re-texture for those of you who want something darker than the purple-black texture. Its more of a grey-black texture, and I tried to make the grey more black but it kinda distorted the texture. I personally love the original black texture but I wanted something darker, too. This mod is standalone, meaning it won&#39;t replace anything in the original mod and should be completely compatible with it too.\r<br />\r<br />How to get them:\r<br />I put a chest in Hag&#39;s End containing all the armors. But first you&#39;ll have to go through Deepwood Redoubt to get to Hag&#39;s End. The chest is at the top of the Hag&#39;s End ruin(See images). Please don&#39;t complain about how you have to go through a forsworn infested ruin or how you have to craft them to get them, because if I made it so you could pick them up from a chest in the middle of a town, then that would kinda be cheating, and you would get great armor for free. The chest does not respawn, so if you want more armors because you lost the other ones or you want more for followers or whatever, you&#39;ll have to craft them at a forge.\r<br />\r<br />How to craft them:\r<br />For the light armors you&#39;ll need the glass smithing perk.\r<br />For the heavy armors you&#39;ll need the ebony smithing perk.\r<br />For the cloth versions you don&#39;t need any perks, just the required ingredients.\r<br />Everything besides the light armor can be found in the MISC section in the forge. The light armor is in the Glass category. I don&#39;t know why.\r<br />\r<br />\r<br />I&#39;m no longer making retextures for this set, so please do not request any.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Requirements\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />You need the [url=http://skyrim.nexusmods.com/mods/20077]original mod[/url]. You don&#39;t have to install everything from the original mod, just the textures.\r<br />\r<br />You&#39;ll probably need the latest Skyrim patch too.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Install/Uninstall\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Extract files from archive into Skryim data folder. Click yes to all. It shouldn&#39;t ask you to overwrite anything. Activate esp. And that&#39;s it&#33;\r<br />\r<br />Go to Data and delete CFtribunalrobes.esp. Then go to Data/meshes/ and delete CFtribunalrobes. And then go to Data/Textures/armor and delete CFtribunalrobes.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Credits\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Bethesda for making Skyrim.\r<br />Zairaam for his AWESOME work in the original mod. It&#39;s still my favorite armor mod, Zairaam&#33; ;)\r<br />Greyblood for testing.\r<br />And the Nexus creators and staff for their awesome work and website.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Usage/Permission\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />You are not allowed to upload this mod to any other site without mine and Zairaam&#39;s permission. And you are not allowed to use this in any of your own mods without mine and Zairaam&#39;s permission either. If you want to do a translation or modify my work, please ask me first.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />Bugs/incompatibilities\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />The only bug that I know of so far is that the female khajiit and argonian hood is super glossy. I don&#39;t know how to fix this yet, and I&#39;m not sure if this is something I did, or if its something the original author did. From what I know and have tested, this should be completely compatible with the original mod. Please let me know if you find any bugs or incompatibilities&#33;",
  "categoryId": "54",
  "version": "1.0",
  "author": "CrimsonFairy",
  "createdUnix": "1352685905",
  "updatedUnix": "1352686678",
  "containsAdultContent": false,
  "uploadedBy": "CrimsonFairy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98957",
      "name": "CFtribunalrobes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "46754",
      "fileName": "CFtribunalrobes-26783-1-0.rar",
      "uploadedUnix": "1352686678",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/06d75bebc7bb6437deec4dba97fa0b638aecaf9058ce000a57f5993430f46f7e/analysis/1407259597/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CFtribunalrobes-26783-1-0.rar?fid=98957&ttl=1535799091&ri=8192&rs=8192&setec=7e937ff94843482e4f320ed94dca61f3"
    }
  ]
}