{
  "modId": 26802.0,
  "modName": "EcthelionOtW Skyrim Wallpaper Compilation HD",
  "summary": "This compilation contains my best and most popular Skyrim captures, revised and in Full HD to celebrate the 1st birthday of this gaming masterpiece. If there is interest I will constantly update this mod with new scenes for those who love the true beauty of this fantastic world.",
  "descriptionHtml": "[IMG]http://i.imgur.com/skWpAl.jpg[/IMG]\r\n\r\nAbout this Mod\r\n\r\nThis compilation contains my best and most popular Skyrim captures, revised and in Full HD to celebrate the 1st birthday of this gaming masterpiece. If there is interest I will constantly update this mod with new scenes for those who love the true beauty of this fantastic world. Among the great, talented and inspiring screenarchers here on the Nexus I am just an apprentice, but since my work received lots of positive feedback so far I decided to release some of my screens here in this mod. If you want to get an idea of the character of my work please check out the \\\"image\\\" section of my Nexus profile.\r\n\r\n\r\nFeatures:\r\n\r\n- 12 of my most popular shots, revised and ( hopefully ) improved\r\n- 2 of them in 2 different versions with different coloration settings\r\n- 1920x1080 resolution jpegs\r\n- I will create a 2560x1600 version if requested.\r\n- all images edited with GIMP 2 and Windows tools\r\n- all images exclusive to Skyrim Nexus\r\n \r\n\r\nRecommended installation:\r\n\r\nCreate a wallpaper folder in a suitable location (e.g. the \\\"images\\\" section of your Windows installation).\r\nExtract the files \\\"Skyrim Wallpaper Compilation HD\\\" to that location. Right click on the image you want as your wallpaper, and click on \\\"Set as desktop background\\\".\r\nYou can also enable the \\\"Desktop Background Switcher\\\" function of your Windows 7+ installation if you cannot decide which one to take.\r\n\r\n\r\nOther mods :\r\n\r\n- Seductive Lips HD\r\nhttp://skyrim.nexusmods.com/mods/22701\r\n\r\n- Realistic Female Face Skin HD\r\nhttp://skyrim.nexusmods.com/mods/23447\r\n\r\n- Dibellas Temptress gift - Beauties of Skyrim\r\nhttp://skyrim.nexusmods.com/mods/22190\r\n\r\n- Molag Bals Temptress Gift - Evil Beauties of Skyrim\r\nhttp://skyrim.nexusmods.com/mods/23829\r\n\r\n- Dibellas Lunari Gift - Beauties of Skyrim\r\nhttp://skyrim.nexusmods.com/mods/24560\r\n\r\n- Beauties of Skyrim - Eilinel Temptress Vampire Start Savegame\r\nhttp://skyrim.nexusmods.com/mods/22063\r\n\r\n\r\nAuthor\\'s note\r\n\r\nFirst of all I have to thank Bethesda for the creation of this masterpiece and all the talented modders here on the Nexus who made this game look so beautiful and fascinating. I also wish to thank my fellow screenarchers here on the Nexus - you are a great, great source of inspiration for me and I look forward to every new piece of art released by you.\r\n\r\nIf you enjoy my work and want me to create more wallpapers please endorse this mod and tell me what you want to see next. Every single one of these pictures took hours of tweaking and I can only hope you will be pleased with the outcome of my work.\r\n\r\nI also hope to receive lots of feedback, ideas and suggestions. Critizism is also welcome, since it can only improve my work.\r\n\r\n\r\n",
  "categoryId": "28",
  "version": "1.0",
  "author": "EcthelionOtW",
  "createdUnix": "1352740767",
  "updatedUnix": "1352741153",
  "containsAdultContent": false,
  "uploadedBy": "EcthelionOtW",
  "primaryFile": null,
  "files": [
    {
      "fileId": "99066",
      "name": "EcthelionOtW Skyrim Wallpaper Compilation HD",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10267",
      "fileName": "EcthelionOtW Skyrim Wallpaper Compilation HD-26802-1-0.zip",
      "uploadedUnix": "1352741153",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ca18640e1bf806e7cb2fc07bea1d9f63d68cd43cc2945d020d871ce86f6194e5/analysis/1407260472/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EcthelionOtW%20Skyrim%20Wallpaper%20Compilation%20HD-26802-1-0.zip?fid=99066&ttl=1535799110&ri=8192&rs=8192&setec=73f0ddd4500484c0876fccecf922cdd5"
    }
  ]
}