{
  "modId": 26816.0,
  "modName": "Open Sesame - Lockpicking Spells",
  "summary": "Alteration spells used for unlocking chests and doors",
  "descriptionHtml": "[B][U]- Intro - [/U] [/B]\r\n\r\nOblivion gave us the option to either pick locks with a lockpick, or if you were talented enough with the arcane arts you could unlock a chest or door using magic.  Skyrim hasn\\'t given us that option unfortunately (Although the Skeleton Key and the Tower Stone are pretty good alternatives).  I found that I didn\\'t care for my pure magic user to be skilled in picking locks, and I didn\\'t care for keeping the Tower Stone blessing all the time, so that just left me with one option...to add in a set of Alteration spells to automatically unlock items again.\r\n\r\n[B][U]- How it Works - [/U] [/B]\r\n\r\nIn Version 1.1 I\\'ve changed the funcionality of the spells a bit.  To open locked chests or doors now all you need to do is cast the appropriate level spell for the lock you\\'re trying to open, then interact with the chest or door.  The item should be automatically unlocked and open for you immediately.  Casting the spell gives you a 10 second perk that allows you to unlock any lock equal to or lower than the spell you cast.  \r\n\r\nIf you prefer the old way (utilitizing the Tower Stone buff that requires you to select from a menu to unlock the item) you can use Version 1.0 still.  \r\n\r\n[B][U]- Spell Locations and Requirements - [/U] [/B]\r\n\r\nTo find the spells you will need the appropriate Alteration level (0 for Notice, 25 for Apprentice, 50 for Adept, 75 for Expert, and 100 for Master).  You will also need to find a vendor that sells Alteration spells of the level you require (Farengar in Whiterun\\'s Dragonreach sells up to Apprentice level Alteration, fyi).  For the Unlock Master Lock spell you\\'ll need to complete the Alteration Ritual quest just as you would normally to unlock Master level spells.  Some spells may show up in dungeons/loot as well if you\\'ve already reached the appropriate Alteration requirement.\r\n\r\n[B][U]- Change Log -[/U] [/B]\r\n\r\nVersion 1.1\r\n***Changed all the spells so you are no longer required to select \\\"Open with Magic.\\\"  Simply casting the spell and interacting with the door or chest should automatically open the item now.\r\n\r\nVersion 1.0\r\n***Added 5 spells to the game to allow players to unlock items if they have sufficient ability in the Alteration school.\r\n***Added the spells to the leveled loot lists so they may be accessed through loot and vendors.",
  "categoryId": "75",
  "version": "1.1",
  "author": "ulukinatme",
  "createdUnix": "1352774949",
  "updatedUnix": "1352824945",
  "containsAdultContent": false,
  "uploadedBy": "ulukinatme",
  "primaryFile": null,
  "files": [
    {
      "fileId": "99147",
      "name": "Lockpicking Spells",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Lockpicking Spells-26816-1-0.rar",
      "uploadedUnix": "1352775041",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9e1813b830dd063d9937b844ca12277dec8303225e0313077f49ff957d64c26f/analysis/1407261062/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lockpicking%20Spells-26816-1-0.rar?fid=99147&ttl=1535799128&ri=8192&rs=8192&setec=c4a5df1ef27ac786318175320b9d5d12"
    },
    {
      "fileId": "99250",
      "name": "Open Sesame - Lockpicking Spells",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Open Sesame - Lockpicking Spells-26816-1-1.rar",
      "uploadedUnix": "1352824945",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/213da629f4d37cd4c36b3f4db4ba0573c3636817e2efd285ad2ac8c3e29d5e5f/analysis/1407261547/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Open%20Sesame%20-%20Lockpicking%20Spells-26816-1-1.rar?fid=99250&ttl=1535799129&ri=8192&rs=8192&setec=5e02e929a6ac8a52f21a923a51b7b596"
    }
  ]
}