{
  "modId": 26813.0,
  "modName": "The Warriors Way Weapon Pack",
  "summary": "Based on the weapons used by the \\\"Greatest Swordsman in the History of Mankind......EVER\\\". \r\n\r\nAs seen in the movie \\\"The Warrior\\'s Way\\\".\r\n\r\nFormerly listed as the weeping sword, it\\'s been updated to allow more weapons to be added from the movie.",
  "descriptionHtml": "Update: I had a few issues with normals on the original upload that I missed and actually had to remake a couple of parts. I\\'ve also added the Wakizashi that Yang used in training Kate Bosworth\\'s character. Other changed details are adding a soul trap enchantment on the Weeping Katana and renaming it to keep all the weapons together in the crafting and inventory menus as well as making it easier for future updates. Please delete the old \\\"weeping sword\\\" esp and associated files as both the mesh and textures are tweaked and renamed. \r\n\r\n\r\nThis is a sword based on the one seen in the movie, \\\"The Warrior\\'s Way\\\". \r\n\r\n1st, great movie with a cool visual style to it and an enjoyable plot. Yang, the strongest warrior of the Sad Flutes clan (the cruelest assassins in the world) betrays his own by refusing to kill the last surviving member of a clan the Sad Flutes were at war with. The life he spares is a baby princess whose father was the greatest swordsman in the history of mankind, until Yang killed him. \r\n\r\nYang was raised from a little boy to be the strongest Sad Flute, but has become empty inside and seeks a new life by protecting this little baby princess so he heads to America where he settles down in the badlands. Knowing that the Sad Flutes would never stop hunting him, he seals his sword to it\\'s scabbard so that his former master won\\'t be able to track him down by hearing the weeping of his blade for all the souls it has taken. Inevitably though, the seal must be broken.\r\n\r\nThat\\'s all I\\'ll say about the movie in case some care to check it out but it does explain the idea behind this sword. \r\n\r\nMore detail on the model itself. The scabbard isn\\'t completely accurate, my choice, as the one in the movie is slightly wider than mine. The pommel is slightly rounder as well but again, my choice. The blade is cleaner and shinier than normally seen in Skyrim but in the movie it\\'s very pristine looking, my choice but I might still decide to tone it down a bit once I see what others think. Texture wise I still need a normal map but I\\'m leaving town for a few days so that will have to wait. Other than that, not much to this model, took longer testing it in game than to make it. \r\n\r\nI made a quick player character to vaguely resemble Yang to showcase the sword.",
  "categoryId": "55",
  "version": "1.5",
  "author": "Rebelmoon",
  "createdUnix": "1352767407",
  "updatedUnix": "1353123366",
  "containsAdultContent": false,
  "uploadedBy": "Rebelmoon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "99139",
      "name": "Weeping Sword",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "186",
      "fileName": "Weeping Sword-26813-1-0.rar",
      "uploadedUnix": "1352767518",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f8a8fcef0145f5ad43998c3269b4c4edf9799ece4cf8d79edad8916cb91d35c3/analysis/1407260948/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Weeping%20Sword-26813-1-0.rar?fid=99139&ttl=1535799123&ri=8192&rs=8192&setec=34df8055adef6faf74f13dd70a3ca68e"
    },
    {
      "fileId": "99976",
      "name": "The Warriors Way Weapon Pack",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "809",
      "fileName": "The Warriors Way Weapon Pack-26813-1-5.rar",
      "uploadedUnix": "1353123366",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/59964c7ecb6236dc4556511273c46d1fc96b32721e341613523359f4c61db10e/analysis/1407266287/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Warriors%20Way%20Weapon%20Pack-26813-1-5.rar?fid=99976&ttl=1535799123&ri=8192&rs=8192&setec=27f630cc5e0f3d6a64e6cbd1032e7597"
    }
  ]
}