{
  "modId": 26836.0,
  "modName": "Tradergold-Fix",
  "summary": "Erhöht das den Händlern zur Verfügung stehende Gold.\r\nIncreases the trader\\'s gold.",
  "descriptionHtml": "Diese Modifikation ändert das den Händlern zur Verfügung stehende Gold, kurzgesagt, sie haben sehr viel mehr davon.\r\nVorallendingen Schmiede haben nun sehr viel Gold, damit ihr eure Waffen und Rüstungen schnell verkaufen könnt.\r\nAndere Händler haben zwar auch mehr Gold, aber nichtsdestotrotz ist ihr Goldvorrat begrenzt. Nutzt daher den Gemischtwarenhändler nicht im Übermaß.\r\nNicht verändert hat sich das Geld der Hehler in Skyrim.\r\n\r\nThis modification increases the trader\\'s gold a lot. Especially blacksmiths got much of it, so you can quickly sell your weapons and armors. The other traders got more gold, too, but it\\'s still limited. So, do not overuse the misc-item vendor for everything.\r\nThe amount of gold, which fences got, wasn\\'t changed. ",
  "categoryId": "28",
  "version": "1.0",
  "author": "Almalexian",
  "createdUnix": "1352829310",
  "updatedUnix": "1352835243",
  "containsAdultContent": false,
  "uploadedBy": "Almalexian",
  "primaryFile": null,
  "files": [
    {
      "fileId": "99299",
      "name": "Tradergold-Fix Multilingual",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Tradergold-Fix Multilingual V 1-26836-1-0.rar",
      "uploadedUnix": "1352835243",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a0e94c994da5f40dc2b46e240c5b1c359fdcf3990777abc8b6e0c0103939950f/analysis/1407261782/",
      "changelogHtml": " -Schmiede haben nun einen Goldvorrat von 5000 Goldstücken <br/> \n -Magier haben nun einen Goldvorrat von 3000 Goldstücken <br/> \n -Alchemisten haben nun einen Goldvorrat von 2000 Goldstücken <br/> \n -Gemischtwarenhändler haben nun einen Goldvorrat von 1500 Goldstücken <br/> \n -Wirte und andere Kleinhändler haben nun einen Goldvorrat von 500 Goldstücken <br/> \n -Blacksmith\\'s have a vendor gold of 5000 pieces of gold, now <br/> \n -Mages have a vendor gold of 3000 pieces of gold, now <br/> \n -Alchemists have a vendor gold of 2000 pieces of gold, now <br/> \n -General vendors have a vendor gold of 1500 pieces of gold, now <br/> \n -Inn owner\\'s and other small vendor\\'s have a vendor gold of 500 pieces of gold, now <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tradergold-Fix%20Multilingual%20V%201-26836-1-0.rar?fid=99299&ttl=1535799171&ri=8192&rs=8192&setec=4d932ed1bc48379230abe900fc1ce742"
    }
  ]
}