{
  "modId": 26869.0,
  "modName": "More plants and recipes for Hearthfire - base game version",
  "summary": "Adds a number of new plantables to the Hearthfire planters, currently: Jarrin Root, Nirnroot, Crimson Nirnroot, Frost Mirriam, Elves Ear, Blueberry, Garlic, Red Apple Tree, Green Apple Tree, Tomatoes, Saltrice, Sugar and Stoneflower. Dawnguard version adds  Gleamblossom, Yellow Mountain Flower and Soul Husk.",
  "descriptionHtml": "Now with Oblivion and Morrowind plants! Works on all Hearthfire planters - both in the outside garden and in the indoor Greenhouse. Adds a number of new plantables to the Hearthfire planters, currently: Jarrin Root, Nirnroot, Crimson Nirnroot, Frost Mirriam, Elves Ear, and from other sources Blueberry, Garlic, Red Apple Tree, Green Apple Tree, Tomatoes, Saltrice, Sugar and Stoneflower. The Dawnguard version has Gleamblossom, Yellow Mountain Flower and Soul Husk, 3 of each are available in the crafting chests outside each hearthfire house. Also adds a new food (Blueberry Crostata) and recipes for  Blueberry Crostata, Long Taffy Treat, Boiled Creme Treat, Honey Nut Treat, Moon Sugar, Butter and Spiced Wine.\r\n\r\nPotential conflicts with anything editing the house planters or adding any of the plants I\\'ve adding. If you had the non-dawnguard version and switch to the dawnguard version existing plants made using that mod may disappear (but can be cleared and replanted fine). This mod is cleaned regularly when uploading.\r\n\r\nAll mods require Hearthfire. Dawnguard one requires Dawnguard.\r\n\r\nTo do: add more plants (many)\r\nFiddle with meshes so things fit better\r\nAdd the ability to craft or buy planters\r\nWork out how to make Poison Bloom work (currently being problematic)",
  "categoryId": "67",
  "version": "2.0",
  "author": "Rowan Thomas - Numberland",
  "createdUnix": "1352872117",
  "updatedUnix": "1352909519",
  "containsAdultContent": false,
  "uploadedBy": "numberland",
  "primaryFile": null,
  "files": [
    {
      "fileId": "99440",
      "name": "More plants",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4413",
      "fileName": "More plants-26869-2-0.rar",
      "uploadedUnix": "1352909519",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/1c2685cf403e0e1369d0d88296c80b8abc46766eb4b8d35ec4faacce318443c2/analysis/1407262989/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20plants-26869-2-0.rar?fid=99440&ttl=1535799228&ri=8192&rs=8192&setec=bd0f77aa11b1db03b97386f607ce0c79"
    }
  ]
}