{
  "modId": 26875.0,
  "modName": "Ring of Warding and Conjuration spells as lesser powers",
  "summary": "Ever wish blocking with your hands, one handed weapon or two handed weapon wasn\\'t so shit, or ever wondered why you weren\\'t able to summon your minions while using a two handed weapon?Well this may just solve your problem.",
  "descriptionHtml": "Please note file is called Blood Elf as it was started as a custom race, but was abandoned due to me becoming frustrated :P Alright pictures all corrupted on me they will be coming tomorrow :/\r\n\r\n\r\nThis mod does two things:\r\n\r\n1. Adds a new ring either found on the floor of the Sleeping Giant Inn or can be obtained through console. this ring is in its own slot (slot 60) so it hopefully wont class with any other mods. When blocking with this ring equipped whether using a shield, two handed or just your bare hands a Greater ward will materialise in front of you protecting you from 80 points of magic damage as well as increasing your armour rating by 80.\r\n\r\n2. The second half of this mod is only in here by accident, I forgot to save the previous mod and open a new one and just started this one in the same mod. Now what this second bit is, is just something I wanted for myself, the ability to use the raise dead spells while keeping my two-handed weapon or one-handed weapon and shield or even bow equipped without having to waste time changing back and fourth. So to do this I converted all of the Raise dead spells into Lesser powers, this means they can be used as much as desired, given you have enough magika. The spell tomes are available from all the usual places, hopefully, and will become available at the same level the rest of those spells are available at, example expert spell wont be available until you are able to buy other expert level conjuration tomes. Also there is a tome for each level summon, from zombie to corpse to revenant to dread zombie and finally dead thrall, each has the prefix Blood.\r\n\r\nBugs:\r\nNone that i know of...\r\n\r\nAll feedback welcome :)",
  "categoryId": "54",
  "version": "1.0",
  "author": "iamironman956",
  "createdUnix": "1352884937",
  "updatedUnix": "1352885017",
  "containsAdultContent": false,
  "uploadedBy": "iamironman956",
  "primaryFile": null,
  "files": [
    {
      "fileId": "99399",
      "name": "Blood elf",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Blood elf-26875-1-0.7z",
      "uploadedUnix": "1352885017",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4a10e1672139266608e0dbc56424ca36f166114caa866b0104546a1b866a9203/analysis/1407262806/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20elf-26875-1-0.7z?fid=99399&ttl=1535799240&ri=8192&rs=8192&setec=37df5408c4ef3989ed0df42d0ec5db28"
    }
  ]
}