{
  "modId": 26966.0,
  "modName": "Enchanting For Mages Rebalanced",
  "summary": "Re-balances what enchantments are available for mages\\' equipment.\r\n\r\n1.  Adds a set of \\\"Magnify Spellschool\\\" enchantments to Hands (cloth and armor) and Rings.\r\n2.  Restricts \\\"Fortify Spellschool\\\" enchantments to Heads (cloth and armor) and Necklaces.\r\n3.  Mages Robes are available, but the enchantment cannot be placed on any other items.\r\n4. ",
  "descriptionHtml": "[quote]Urgent: All Thalmor Agents Operating in Skyrim\r\nEncryption: Echo-Kalpa-Xarxes\r\n\r\nThe nord is infamous for his tenuous grasp of magic; indeed, of all the threats we face in the north, even the horkers rank above what passes for mages.  We\\'ve been able to take our magical superiority for granted, and so we\\'ve become complacent.  In recent weeks the mages of Winterhold have stumbled upon a rather potent enchantment, one that could create some minor inconvenience for our forces should it be allowed to become widespread.  Until now they\\'ve focused all their enchantments on the efficiency of their spells, to stretch their pitiful stores of magicka further, yet these new enchantments focus on [i]power.[/i]  \r\n\r\nAlready they\\'ve begun to sell rings and gauntlets bearing these magics to traders: I will continue to undermine their supplies of soulgems, but inevitably you will run into a nord or breton who thinks his new purchase makes him your equal.  Your orders are to eliminate those who wield this enchantment, investigate where they procured it, and inform me via encrypted message.  \r\n\r\nOf course the most important thing to remember is that this changes nothing.  Do not be concerned: despite their new toys, they are still only human.\r\n\r\n-High Overseer Ancano, First of the Phynaxic Order, Lineage of Xarxes[/quote]\r\n\r\n[center][b][size=4][u]Dementor Presents[/u][/size][/b][/center]\r\n[center][b][size=6][color=red]Enchanting for Mages Rebalanced[/color][/size][/b][/center]\r\n\r\n[b][u]Preface[/u][/b]\r\nIt is my opinion that enchantments for mages in Skyrim was poorly designed: one can enchant himself a suit of armor which reduces the mana cost of all spells in two spell schools to zero (thus entirely negating the perks which halve those costs) but there is no enchantment which can improve the power of said spells.  This was a mod I made entirely for myself: if you are entirely satisfied with playing a mage in Skyrim by all means ignore it entirely.  However, I feel I\\'ve done a good job in finding some balance between reducing the ability to eliminate mana costs and adding the ability to improve the power of the spells.\r\n\r\n[b][u]Changes[/u][/b]\r\n[b][color=red]Magnify Spellschool-[/color][/b] These enchantments are found on rings, gloves and gauntlets, and increase the power of your spells: destruction spells do more damage, illusion spells effect higher-level targets, conjuration and alteration spells last for longer, and restoration spells restore more health.  These rings and gauntlets have been added to the leveled item tables, so they\\'ll show up at shops and in chests around the world.\r\n[b][color=red]Fortify Spellschool-[/color][/b] These enchantments are no longer found on rings or body armor: they exist solely on head items and necklaces.\r\n[b][color=red]Mage Robes-[/color][/b] The robes worn by mages, including those purchasable at the College of Winterhold, still retain their unique version of the Fortify Spellschool enchantments.  However, that enchantment cannot be placed on a new item by the player.\r\n[b][color=red]The Magnify Restoration Exploit-[/color][/b] Removed the association between all worn enchantments and any spellschool (almost all of them had been linked to restoration).  This had been the cause of an existing exploit involving potions of magnify restoration, and was overpowering in the hands of a vampire with the Necromage perk.  Spellschool affiliations on weapons and staves remain unchanged.\r\n\r\n[b][u]Version History[/u][/b]\r\n[color=red][b]1.0: 11/16/2012[/b][/color]\r\n- Initial Release\r\n\r\n[b][u]FAQ[/u][/b]\r\n[color=red][b]Where can I find these enchantments?[/b][/color] Smiths will sell gauntlets bearing the new enchantments, so shop around.  Rings bearing the new enchantments can be found anywhere you could find the old rings.  Additionally, Thalmor agents have been reported to be using Magnify Destruction enchantments on their gloves.  That Ancano is a sneaky bastard!  Also, word is some old gloves turned up with a Magnify Conjuration enchantments, something about a Dedra-worshipping cult.  I hear they\\'re in a museum in Dawnstar.\r\n[color=red][b]What happens to my existing gear?[/b][/color] If you enchanted it yourself, it shouldn\\'t change.  If you bought a ring with a Fortify Spellschool enchantment it will change into a Magnify Spellschool enchantment when you load the mod.  If you have storebought body armor of Fortify Spellschool it will likely disappear.  Also, if you are using versions of the Thalmor or Mythic Dawn gloves which you\\'ve enchanted yourself, those enchantments will be overridden by the new magnify enchantments.\r\n[color=red][b]What about unique gear?[/b][/color] Unique items like the Nightweaver\\'s Band and the Bond of Matrimony remain unchanged.  You still cannot disenchant them.\r\n[color=red][b]How do I install this mod?[/b][/color] Unpacking the zip into your data folder should do the trick.",
  "categoryId": "75",
  "version": "1.0",
  "author": "Dementor",
  "createdUnix": "1353075088",
  "updatedUnix": "1353075263",
  "containsAdultContent": false,
  "uploadedBy": "Dementor4",
  "primaryFile": null,
  "files": [
    {
      "fileId": "99829",
      "name": "EnchantmentsForMages",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17",
      "fileName": "EnchantmentsForMages-26966-1-0.zip",
      "uploadedUnix": "1353075263",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7051e55f0f74547a66d2557f386c54001625a41297a11db5fc9d8489306d58b3/analysis/1407265093/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EnchantmentsForMages-26966-1-0.zip?fid=99829&ttl=1535799379&ri=8192&rs=8192&setec=b9de9a257414f39dec21d0649a59316f"
    }
  ]
}