{
  "modId": 26981.0,
  "modName": "Grimoas 3rd person friendly Candlelight Spell",
  "summary": "This file gives several options to get the floating light ball from the candlelight spell out of the way when playing in third person. All options come in one download with a scripted NMM installer to make it as easy as possible to choose and change your mind!\r\n",
  "descriptionHtml": "[size=5][center]Grimoa\\'s 3rd person friendly Candlelight Spell[/center][/size]\r\n\r\n[size=4]>> What does it do?[/size]\r\nThis file gives several options to get floating light ball from the candlelight spell out of the way when playing int third person. All options come in one download with a scripted NMM installer to make it as easy as possible to choose and change your mind!\r\nThe mod only changes a mesh, so it is compatible with anything that changes duration, casting cost, light radius, (you name it) through an esp file.\r\n\r\n\r\n[size=4]>> Installation[/size]\r\nUse NMM to install and easily choose the option of you choice!\r\n\r\nTo manually install unpack the archive, locate the option you want and manually move the contents of that folder to Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data\r\nTo uninstall remove Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\meshs\\\\magic\\\\lightspellactorfx.nif\r\n\r\n\r\n[size=4]>> Options[/size]\r\nPlease see the image section!\r\n\r\n01 blue hue removal only\r\nDid you ever notice that everything gets a blueish hue when using the candlelight in 3rd person but not when in 1st person? I think that blue is a tad bit much... I removed it in all options of the mod. If you want to keep it, this mod is not for you. ;)\r\n\r\n02 moved to left\r\nThe glowing light orb is moved to the left. This works very nicley if you have your camera set off to the right. (As in my pictures.)\r\n\r\n03 moved to right\r\nThe glowing light orb is moved to the right. Probably a better option if you have your camera set off to the left side.\r\n\r\n04 - 06 less rainbow\r\nI removed the rainbow rays, which are quite annoying in 3rd person. Comes in centered, left and right versions.\r\n\r\n07 - 08 no rainbow\r\nI removed every trace of rainbow colors! Comes in centered, left and right versions.\r\n\r\n\r\n[size=4]>> Issues[/size]\r\nThe options that move the light orb move the point where it materializes when cast by the same amount. To change that I would have to edit the animation (I think) but that\\'s beyond me atm.\r\n\r\n\r\n[size=4]>> Legal stuff[/size]\r\nDo what you want. Credit would be nice.\r\n(But really, anyone could redo the same edits in nifskope so what\\'s the point?)\r\n\r\n\r\n[size=4]>> Credits[/size]\r\nNifskope for letting my edit nifs.\r\nBethesda for Skyrim\r\n\r\n",
  "categoryId": "75",
  "version": "1.0",
  "author": "Grimoa",
  "createdUnix": "1353091784",
  "updatedUnix": "1353092062",
  "containsAdultContent": false,
  "uploadedBy": "Grimoa",
  "primaryFile": null,
  "files": [
    {
      "fileId": "99873",
      "name": "Grimoas 3rd person friendly Candlelight Spell",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "267",
      "fileName": "Grimoas 3rd person friendly Candlelight Spell-26981-1-0.7z",
      "uploadedUnix": "1353092062",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/34440c014c6e8ff5af9bc23bf3e69873b529fbf165109c2dbddb9c26e49ee1f4/analysis/1407265454/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grimoas%203rd%20person%20friendly%20Candlelight%20Spell-26981-1-0.7z?fid=99873&ttl=1535799399&ri=8192&rs=8192&setec=200116a455bdd82eae4f34a41e902702"
    }
  ]
}