{
  "modId": 27046.0,
  "modName": "SkyRe Compatible Dread Hunter and Dread Huntress Armor Patch",
  "summary": "A compatibility patch to make the Dread Hunter and Dread Huntress armor inline with Skyrim Redone\\'s armor stats.",
  "descriptionHtml": "This is my first mod please let me know if there are any bugs.\r\n\r\nInstallation:\r\n\r\nYou must first install [url=http://skyrim.nexusmods.com/mods/21125]the Dread Hunter and Huntress armor mod[/url] then download the compatibility patch and simply activate it in your plugin\\'s list instead of the original ESP.\r\n\r\nThis should work for all Versions of the Dread Hunter and Dread Huntress armor mod.\r\n\r\n\r\nChanges:\r\n\r\nI basically left the heavy variant alone and only changed the armor values to be inline with Skyrim Redone and added Meltdown recipes. The light Version I changed to be inline with the Gilded Elven armor and changed to require the Elven Smithing perk. As well as added melt down recipes for both the dawnguard and nondawnguard versions.\r\n\r\nI also gave the hoods a proper armor value for their variants instead of cloth values and added an ingot to the crafting and tempering recipes. If anyone would prefer the old cloth armor ratings on the hoods just leave a comment and I\\'ll put up a version for that.\r\n\r\nCompatible with Version 0.99.21.1 of SkyRE\r\n\r\nSpecial thanks to:\r\nT3nd0s for making Skyrim Redone\r\nand Echo 1162 for making his awesome armor mods.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Synobal",
  "createdUnix": "1353217709",
  "updatedUnix": "1353217823",
  "containsAdultContent": false,
  "uploadedBy": "Synobal",
  "primaryFile": null,
  "files": [
    {
      "fileId": "100190",
      "name": "SkyRe Compatible Dread Hunter and Dread Huntress armor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "SkyRe Compatible Dread Hunter and Dread Huntress armor-27046-1-0.7z",
      "uploadedUnix": "1353217823",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/65176c6b16d4cdfd3558aeca8f35bf2b4d6b32dbccb73f9ef8cd6b21588eb6cf/analysis/1407267904/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRe%20Compatible%20Dread%20Hunter%20and%20Dread%20Huntress%20armor-27046-1-0.7z?fid=100190&ttl=1535799511&ri=8192&rs=8192&setec=4f1564dd17259e1dabada71cdcfd974b"
    }
  ]
}