{
  "modId": 27051.0,
  "modName": "Breezehome Shadow Striping Fix",
  "summary": "A simple change to ONE light inside Breezhome to remove the striping effect near the entrance fire pit.",
  "descriptionHtml": "New version is available, this is a collection of multiple shadow striping fixes I\\'ve done including this and a few others, future updates will be incorporated into that mod to eventually make 1 file with all the areas fixed! If switching to the main collection, deactivate this first or delete the .esp from your Data folder if you manually installed before using the new mod.\r\n\r\nSkyrim Shadow Striping Fix - http://skyrim.nexusmods.com/mods/27418\r\n\r\n-------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nUploaded by request. I know there are other mod\\'s for this, but apparently some people have problems getting those to work, or performance issues or mod conflicts. A friend asked for my version I made for my own use, so here it is! :)\r\n\r\nDESCRIPTION:\r\nAs basic and simple as possible, only making a change to to the 1 \\\"Shadowcaster\\\" at the fire pit in Breezehome\\'s entrance. This mod only increase the depth bias on that light, so there should be no conflicts with other mods, unless it was a mod that completely removed the light from Breezehome\\'s entrance lol. Should not be any performance issues, I tested all the way from Low shadow settings all the way up through to Ultra and the FPS stayed the same as before the mod was introduced. So whatever FPS you have in Breezehome with the settings/mods you use now, will stay the same with this mod.\r\n\r\nI use this in combination with Realistic Lighting w/ Customization, Claralux, and Wearable Torches are all the lighting related mods I use, and have no problems with. Just load this after any mod that changes lights or lighting.\r\n\r\nREQUIREMENTS:\r\n-Latest version of Skyrim was used to create this, not sure if that means you\\'ll need 1.8, since it modifies a light asset that has been in the game since 1.0 lol, but you should have it anyways! always stay up to date ;)\r\n*DAWNGUARD or HEARTHFIRE are NOT required.* Just wearing the armor in the screens, that\\'s all!\r\n\r\nINSTALLATION:\r\nDownload with NMM and activate with NMM!\r\n-If you must manually download/install, it\\'s a basic extract to Skyrim\\'s DATA folder, and activate the .esp in your load order manager.\r\n\r\nLOAD ORDER:\r\nLoad this after anything that changes the lights or lighting, or Breezehome. If your unsure, to be safe load it last in the load order, or as close to last as you can. Should be fine even if something you use needs to be last and you put this after it, I very much doubt it would conflict since this makes such a minor change lol.\r\n\r\nProblems? Can\\'t get it to work? Or just questions and comments leave in the comments section, or send me a message even, if you\\'d like. If you happen across other areas with the dreaded \\\"Shadow Striping Bug\\\" then feel free to let me know and I will address it. Hope something as small and simple as this can improve your game play and experience! Cheers! :)\r\n-------------------------------------------------------------------------------------------------------------------------------------\r\n*Just wanted to make a spot to say a heartfelt THANK YOU to all who endorsed. Happy to help and see my work appreciated! Cheers!*",
  "categoryId": "95",
  "version": "1.0",
  "author": "forum42087",
  "createdUnix": "1353233395",
  "updatedUnix": "1353234120",
  "containsAdultContent": false,
  "uploadedBy": "forum42087",
  "primaryFile": null,
  "files": [
    {
      "fileId": "100228",
      "name": "Breezehome Shadow Striping Fix",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Breezehome Shadow Striping Fix-27051-1-0.rar",
      "uploadedUnix": "1353234120",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/07d793251712a7559f332cee81b183e5517afd4e48e82e63310ee504888b0abc/analysis/1407267967/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezehome%20Shadow%20Striping%20Fix-27051-1-0.rar?fid=100228&ttl=1535799514&ri=8192&rs=8192&setec=b10e1fbc110b0066a7f687b698899650"
    }
  ]
}