{
  "modId": 27068.0,
  "modName": "Nordic Adventurers Armor by Natterforme",
  "summary": " This is a Nexus Exclusive. This adds a set of equipement intended for role players and adventurers! ",
  "descriptionHtml": " \r\nName: Nordic Adventurer\\'s Armor by Natterforme\r\n Version: 1.0\r\n Date: 11/18/2012\r\n Category: Weapons and Armor\r\n Recommended: Skyrim Mod Manager\r\n Author(s): Natterforme\r\n Source: \r\n  \r\nDescription\r\n ===========\r\n This is a Nexus Exclusive. This adds a set of equipement intended for role players and adventurers! \r\n \r\nLocation\r\n ========\r\n All pieces of the set can be crafted at the crafting forge and can be tempered at the proper upgrading areas. The armor is stand alone and will not replace any vanilla armors.\r\n \r\nDetails\r\n =======\r\n \r\n THIS IS A NEXUS EXCLUSIVE! NO STEAM SUPPORT WILL BE OFFERED AT THIS TIME! IF I FIND THAT THIS HAS BEEN UPLOADED TO STEAM WITHOUT MY PERMISSION I WILL NOT BE LENIENT TOWARDS THE UPLOADER(S). YOU HAVE BEEN WARNED!!!\r\n \r\n Lore:\r\n \r\n Unlike the savage hunter, whose trophies are the bones and skins of the animals he hunts and the enemies he has killed, the Adventurer lives for the next discovery, the next tomb, the next crypt. The trophies of the Adventurer are not the blood and bones of his enemies, but the armor and weapons he has collected at the end of each adventure. Ever practical, he does not burden himself with fancy trinkets and rich clothing. He leaves the loot at home and keeps his sword arms free. Whereas other men proclaim their strength by going shirtless, sleeveless, without pants, or with open-toed shoes, the Adventurer wears a full set of winter clothing, warm and form fitting. This protects him from the biting chill of the harsh winds on the frozen tundra. He keeps his armor clean but unpolished, to prevent him from being easily spotted by its glare. The armor is cold to the touch and he suppliments it with a heavy overcoat and fur. A collector and historian, he occasionally adds a piece of ancient armor worn by Draugr to his suit, valuing its durability and its strength through the ages. This armor is good for explorers of ancient ruins, archers, woodsmen and women, rogues, fallen nobility, and various other forms of role play.  \r\n \r\n This armor is a fusion of the Steel and Nord plate armor sets, with an addition of Draugr elements. Whereas the Steel and Nord plate armors are individually very strict and rigid, this armor is meant to be more rugged and forgiving. The steel and nord plate are two of my favorite armors and I wanted to combine them in a meaningful way. My previous WIP attempts did not do this and progress was complicated by mesh issues and corrupted files. Wishing to start clean, I redid the entire armor from scratch over a couple of days. While much of the old armor has been tossed out, subtle elements of the original remain. Much has been added or changed the total look and feel is very different from the original.\r\n \r\n This mod adds several items to the game. The set includes a cuirass, gauntlets, boots, and a helmet. Khajits and Argonians and Orcs use the Steel Helmet. The humanoid races use the unique one that combine steel and nord plate helmets. All of the equipment can be used by both genders. The model is the same for both genders but looks good on both.\r\n \r\n There will not be a unique female version because of three things:\r\n \r\n A) The differences between the male and female yarl clothing is too drastic and dont fit well together.\r\n B) There is no female texture of the Ulfric clothing so to use on a female version.\r\n C) The male version actually looks pretty good on them in my opinion.\r\n \r\n The armor comes in both Light and Heavy varients. The Heavy version has equivalent stats of Nord Plate(Steel Plate) and the Light Version has the same stats as Elven. Both sets use relatively the same amount of materials to craft and both use steel to upgrade them at the proper upgrading areas. The ground models used are the Steel ground models.\r\n \r\n The armor uses vanilla textures so it will be affected by any retexture mods that you use that change the affected pieces of armor. This can be beneficial as you can customize your own set of armor. The files do not include textures but a texture folder is added to your data/textures/ section in case that ever changes.\r\n \r\n You are encouraged to use CaBal120\\'s Steel and Nord Plate retextures! They look great and can only improve your game. I use them in all of my screenshots!\r\n \r\n You are encouraged to use this armor in conjunction with Frankdema\\'s Explorer armor! It looks great and goes well with this one!^^\r\n \r\n This is now a part of the Nordic Series, a series of armor that will highlight different playstyles, where we add an armor set and a follower NPC later who uses the armor. Frankdema\\'s Nordic Explorer Armor is a pair to this one.\r\n\r\nA Czech translation of this mod can be found here:\r\n\r\nhttp://skyrim.nexusmods.com/mods/37652/?tab=1&navtag=%2Fajax%2Fmoddescription%2F%3Fid%3D37652%26preview%3D&pUp=1\r\n \r\n\r\nInstall\r\n =======\r\nEither throw the folders into your Data directory or use the Nexus Mod Manager to do it for you.\r\n\r\nUninstall\r\n =========\r\n Either use Nexus Mod Manager to remove the files or manually remove them from you Skyrim/Data folder. \r\n\r\nUpgrade\r\n =======\r\n I plan to upgrade and improve this mod over time as I fix bugs, think of new ideas, become more adapted to the CK, and so on. Be sure to check back in once and awhile for updates. Be sure to completely uninstall any previous versions of this mod before upgrading though.\r\n \r\nI will not take responsibility for corrupted save games or lost save games. Get into the habit of backing up your saves to protect your game data. Ignore at your own risk!\r\n\r\nIncompatibility\r\n ===============\r\n This mod should not be incompatable with any other mods to my knowledge. However it is always a possibility so please let me know about it if you experience a conflict.\r\n \r\nKnown Issues or Bugs\r\n ====================\r\n \r\n There are no known issues at this time. Please exhaust all possible avenues of mod confliction before reporting a bug or an error. To be fair, I do mess up occassionally and make mistakes, but many problems are often the cause of the mod user, and not the mod maker. Also, be sure to give a complete explaination of your problem so that I can more adequetely address the issue when you find one.. Screenshots are highly recommended in this regard.\r\n \r\n \r\nHistory\r\n =======\r\n \r\n 11/18/2012- Initial Release\r\n \r\nContact\r\n =======\r\n You can find me on the Nexus Forums here as Natterforme.\r\n \r\nCredits\r\n =======\r\n Thanks to Frankdema, for making the Explorer Armor set, the spiritual companion to this armor set! :D\r\n Thanks to Cabal120 for retexturing Skyrims vanilla armors and injecting more awesomeness into Skyrims vanilla assets!\r\n Thanks to DropaDred for his Czech translation!\r\n Thanks to Bethesda for creating Skyrim.\r\n Thanks to SkyrimNexus.com for the a one-stop-shop resource for authors and players.\r\n Thanks to LHammonds for the Readme Generator this file was based on.\r\n Thanks to all of you who have encouraged me and have supported me since I first put up screenshots of my work back in December 2011 and January 2012.\r\n I thank you all for your patience with me^^.\r\n Thanks to God for creating us all. Amen.\r\n \r\nTools Used\r\n==========\r\n 7-Zip - http://www.tesnexus.com/downloads/file.php?id=15579\r\n Blender - http://www.tesnexus.com/downloads/file.php?id=12248\r\n NIFSkope - http://niftools.sourceforge.net/wiki/NifSkope\r\n Oblivion Mod Manager - http://www.tesnexus.com/downloads/file.php?id=2097\r\n Paint.NET - http://www.tesnexus.com/downloads/file.php?id=11909\r\n Photoshop - http://www.adobe.com/products/photoshop/\r\n Readme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r\n\r\n Licensing/Legal\r\n ===============\r\n This is a Skyrim Nexus Exclusive.\r\n\r\n You MUST contact me before you do anything with this mod in any form for any reason. This includes language translations. I will NOT be providing Steam Workshop support at this time. \r\n\r\n I do not feel comfortable with their legal policies towards modding so I will not use it. I will not support or endorse its use at this time. If I want it to be on Steam, I will do so myself. If you see this on Steam, LET ME KNOW! I will not support any version of this mod found on Steam. I will not accept any childish excuse about \\\"sharing\\\" with the community. If you refuse to respect my wishes, I can not, in good faith, respect yours.\r\n\r\n -Natterforme",
  "categoryId": "54",
  "version": "1.0",
  "author": "Natterforme",
  "createdUnix": "1353257081",
  "updatedUnix": "1353265156",
  "containsAdultContent": false,
  "uploadedBy": "Natterforme",
  "primaryFile": null,
  "files": [
    {
      "fileId": "100313",
      "name": "Nordic Adventurers Armor Official Release 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1061",
      "fileName": "Nordic Adventurers Armor Official Release 1_0-27068-1-0.zip",
      "uploadedUnix": "1353265156",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5acdd545a505b8efe9ea9d7a78a50d13c45442e7196695bb83154eb575e48d75/analysis/1407268506/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nordic%20Adventurers%20Armor%20Official%20Release%201_0-27068-1-0.zip?fid=100313&ttl=1535799557&ri=8192&rs=8192&setec=be980fa05dbfa1f9520a0f2ec8ccce21"
    }
  ]
}