{
  "modId": 27084.0,
  "modName": "Followers can Relax german_6_35",
  "summary": "Übersetzung der neuesten version von \\\"Followers can Relax\\\" (vers. 6.35)\r\nNeue Begleiter Dialogoptionen\r\nBegleiter agieren mit der Umgebung während sie warten oder folgen.\r\nBegleiter sammeln zutaten.",
  "descriptionHtml": "THIS IS ONLY THE GERMAN TRANSLATION OF THIS MOD\r\n\r\noriginal mod: http://skyrim.nexusmods.com/mods/9504\r\nAll credits go to KingCoin\r\n\r\nÜbersetzung der neuesten version von \\\"Followers can Relax\\\"\r\n\r\nDa mich gestört hat das meine Begleiter plötzlich mit anderer Stimme und auf englisch antworten habe ich das kurzerhand \\\"gefixt\\\" \r\n\r\nIch habe nur die Topics übersetzt und die voice files mit deutschen ausgetauscht, die Untertiel wurden von mir nicht übersetzt. \r\n\r\nIch danke KingCoin für diese kleine aber feine mod und die Erlaubnis dafür, die Übersetzung hier hochladen zu dürfen. Die Orignal version wird zwar nicht benötigt, aber ladet sie euch dennoch runter damit ihr KingCoin nen Endorse geben könnt. Ehre wem Ehre gebührt.\r\n\r\nInstallation:\r\nEinfach die Dateien in den Data Ordner kopieren und im SkyrimLauncher bzw. ModManager auswählen. FollowerWander2Serana.bsa und FollowerWander2Serana.esp werden nur benötigt wenn ihr Dawnguard besitzt.\r\n\r\nWas diese mod bringt:\r\nBegleiter bekommen eine neue Dialogoption \\\"Du darfst dich frei Bewegen\\\"\r\nMan muss sich dann entscheiden ob der Begleiter an Ort und Stelle warten oder einem weiterhin folgen soll. Der Begleiter wird in beiden Fällen frei mit der Umgebung interagieren.\r\n\r\nSolltet ihr ihr euch im Freien befinden könnt ihr eurem Begleiter anweisen Zutaten zu suchen.\r\nDer Begleiter geht dann los und sammelt in der näheren Umgebung,für 150sec, Zutaten.\r\n\r\nBugs:\r\nman sollte die neue Dialogoption bei Serana erst auswählen wenn man Dawnguard abgeschlossen hat, um potentielle Probleme während der Quests aus dem Weg zu gehen.\r\n\r\nJe nach Skyrim Version kann es passieren das die Dialogoption nicht sofort auftaucht. Einfach das Spiel speichern und wieder laden.\r\n\r\ngetestet mit vers. 1.7.7.0.6\r\n",
  "categoryId": "66",
  "version": "6.35de1",
  "author": "KingCoin - marvin",
  "createdUnix": "1353274859",
  "updatedUnix": "1353274985",
  "containsAdultContent": false,
  "uploadedBy": "42marvin42",
  "primaryFile": null,
  "files": [
    {
      "fileId": "100357",
      "name": "Followers can Relax",
      "version": "6.35de1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "705",
      "fileName": "Followers can Relax-27084-6-35de1.7z",
      "uploadedUnix": "1353274985",
      "modVersion": "6.35de1",
      "virusScanUrl": "https://www.virustotal.com/file/9f7746464ffedcdb5a5b8149bf1e7c89f5a4f3f18219a4641a9d3d2c1667e59d/analysis/1407268807/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Followers%20can%20Relax-27084-6-35de1.7z?fid=100357&ttl=1535799587&ri=8192&rs=8192&setec=0b7edca073db7c91748dafa85bf363c5"
    }
  ]
}