{
  "modId": 27100.0,
  "modName": "Standalone Follower - Alessio Moretti - Ex-Imperial Sniper",
  "summary": "Adds a new Companion to Skyrim, Alessio, the Ex-Imperial Sniper.",
  "descriptionHtml": "[size=6]\r\nATTN: This file, and my other standalone follower mods have been discontinued in favor of a page that hosts all of them as one mod, along with updates/new followers/etc.\r\n\r\nThat mod page can be found here: http://skyrim.nexusmods.com/mods/38042//?\r\n[/size]\r\n\r\n[heading][B]Name: Alessio Moretti\r\n\r\nRace: Imperial\r\n\r\nEye Color: Yellow\r\n\r\nLocation: Hunter Jacuzzi Camp (West of Darkwater Crossing)[/B][/heading]\r\n[B][COLOR=Red]Download Instructions:[/COLOR]\r\n\r\nThrough Nexus Mod Manager (Recommended)\r\n1. Click Download with Manager\r\n2. Click Install\r\n3. Done! Enjoy Your new companion\r\n\r\nManually\r\n1. Download the Zip File\r\n2. Extract the Contents (BSA and ESP) to the Skyrim Data Folder\r\n3. Done! Enjoy Your new companion\r\n\r\n[COLOR=Red]Notes:[/COLOR]\r\nAll of my followers are created with Master Difficulty (Or Higher through Mods), and for later game in mind . That being said, if they seem broken/OP early on, or on low difficulties, that\\'s why.\r\n\r\nAs always, my follower\\'s are completely standalone, unless stated otherwise. I put a lot of work into their backgrounds, so I hope you take the time to read them :3\r\n\r\nI\\'ve recently made the switch to Amazing Follower Tweaks (http://skyrim.nexusmods.com/mods/15524) upon updating my game, and I haven\\'t looked back. I highly recommend trying it out alongside my followers. Remember to place the followers below AFT on the load order.\r\n\r\nPlease, leave comments, and endorse if you enjoy playing with my mods!\r\n\r\nIf there are any bugs or glitches, let me know and I\\'ll gladly fix them ASAP to the best of my ability.\r\n\r\n\r\n[COLOR=Red]Changelog:[/COLOR]\r\nVersion 1: Initial Release\r\n\r\nVersion 2: Realized the method I used had perks stacking up way too high, so, fixed that.\r\n\r\n[COLOR=Red]Background:[/COLOR]\r\n\r\nAlessio Moretti\\'s life has been filled with nothing but war. A member of the Imperial Army from a young age, he\\'s witnessed the deaths of his enemies, his friends, and his loved ones; he\\'s simply grown tired of it all.\r\n\r\nDespite his high commendations and skill as a sharpshooter, he longed for something simpler, something more fulfilling. Alessio has always admired the huntsmen of Skyrim, living off the land, and making due with they could procure. Despite bring trapped in a barracks for years in order to make ends meet, he\\'s based his life around that ideal, growing skilled in alchemy and archery. \\\"Tomorrow\\'s the day,\\\" he whispers to himself at dinner.\r\n\r\nAlessio\\'s escape begins before the break of dawn. His trained footsteps echo no louder than a feather on the walls of the barracks in Solitude as he quietly slides past his comrades. \\\"Maybe I\\'m a bit TOO good at this.\\\" A quick look at the guard at the gate tells him this is his chance. He rushes forward, catching the man in a sleeper hold, and slowly lays him down upon the cold, stone floor. He steps through the gate, and walks out not a soldier, but a man free to do as he pleases.\r\n\r\nHe makes the transition to huntsman quick and easily. He was finally on his own, living as he\\'s always wanted; carefree.\r\n\r\nThough, despite his newfound joy, the conflict between the Stormcloaks of Windhelm and the Imperial Army wages on, and he soon realizes that not even the hunters of the wild can truly be free until the rebellion is put down. Despite his intentions, Alessio realizes that the war must come to an end, for one side or the other, before a true peace can be achieved. He seeks out the Dragonborn in order to fulfill this thought.\r\n\r\n[COLOR=Red]Description:[/COLOR]\r\n\r\nAlessio is a trained Imperial Sniper, taking advantage of his surroundings and superior marksmanship to take out his foes from afar. As a soldier, he also is an experienced swordsman. A man of few words, he prefers action, getting the jump on his foes with his quiet steps and deadly poisons. He has no interest in the arcane, preferring to rely on the arrows on his back, and the steel at his hip.\r\n\r\n\r\n[COLOR=Red]Perk List:[/COLOR]\r\n\r\nArchery: Overdraw (3), Power Shot, Critical Shot (3), Hunter\\'s Discipline, Ranger, Quick Shot\r\n\r\nOne-Handed: Armsman (2), Hack and Slash (3)\r\n\r\nLight Armor: Agile Defender (2), Custom Fit, Unhindered, Wind Walker\r\n\r\nSneak: Stealth (5), Muffled Movement, Backstab, Deadly Aim, Silent Roll, Silence.\r\n\r\n\r\n[COLOR=Red]Spell List:[/COLOR]\r\n\r\nNone\r\n\r\n\r\n[COLOR=Red](Hopefully) To Come:[/COLOR]\r\n\r\nFully Scripted Follower Quests\r\n\r\nFully Voiced Followers\r\n\r\n\r\n[COLOR=Red]Resources:[/COLOR]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/4141]High Res Face Maps for Men by Geonox at Skyrim Nexus - Skyrim mods and community[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/9915]MissAniThrope and chakaru11s C Eyes at Skyrim Nexus - Skyrim mods and community[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/19733]Hothtrooper44\\'s Barbarian Armor[/url]\r\n\r\n[url=http://skyrim.nexusmods.com/mods/10168]ApachiiSkyHair at Skyrim Nexus - Skyrim mods and community[/url][/B]",
  "categoryId": "66",
  "version": "2.0",
  "author": "HikoTanzaki",
  "createdUnix": "1353300331",
  "updatedUnix": "1356358966",
  "containsAdultContent": false,
  "uploadedBy": "hikotanzaki",
  "primaryFile": null,
  "files": [
    {
      "fileId": "100419",
      "name": "Alessio Moretti v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27676",
      "fileName": "Alessio Moretti v1-27100-1-0.7z",
      "uploadedUnix": "1353300474",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fad99320137cb5602615cdddb27a58a151d02a2a007bfd6fb441245680b05422/analysis/1407269310/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alessio%20Moretti%20v1-27100-1-0.7z?fid=100419&ttl=1535799624&ri=8192&rs=8192&setec=27777d6ed7179312cb06d28e1bd931af"
    },
    {
      "fileId": "107278",
      "name": "Alessio Moretti Version 2",
      "version": "2.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "3",
      "fileName": "Alessio Moretti Version 2-27100-2-0.zip",
      "uploadedUnix": "1356358966",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/c385c113a18aa13c32ccdd598bae35950981a68b9e6cb4b778941103841749de/analysis/1407320652/",
      "changelogHtml": " Fixed a perk issue <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alessio%20Moretti%20Version%202-27100-2-0.zip?fid=107278&ttl=1535799625&ri=8192&rs=8192&setec=94ea03f25e6c46895863887a7525cb82"
    }
  ]
}