{
  "modId": 27113.0,
  "modName": "Make Master Harder - Difficulty Tweak Mods Suite",
  "summary": "MMH is a package of individual difficulty tweaking mods that change different aspects of the game. You don&#39;t have to apply them all, just take your pick from the individual mods - Magicka cost reduction, fortify crafting effects reduced, fortify weapon damage effects reduced, sneaking difficulty increased, base health regen lowered and HoT poti",
  "descriptionHtml": "Please note: There will be no future updates. I have discontinued my support for this mod. But if there&#39;s a bug or issue you would like to fix, or if you just want to improve it, feel free to edit the mod using the Creation Kit. Also in the discussion you are allowed to advertise mods based on the file, or better mods than these.\r<br />\r<br />Recommended mods to improve game difficulty with your preferred configuration:\r<br />Dynamic Potions\r<br />Skyrim More Spawns\r<br />Organised Bandits in Skyrim\r<br />Immersive Bandits, Patrols, Civil War, mod series.\r<br />Complete Crafting Overhaul Redone\r<br />Stealth Skills Rebalanced\r<br />\r<br />All of those are available on the Nexus.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />INTRODUCTION\r<br />\r<br />This is a suite of tweak mods that is intended for players who want their experience in Skyrim to be more difficult and their character less able to become OP.\r<br />\r<br />It is not an overhaul, just tweaks. None of the tweaks makes changes to perks. In my own Skyrim experience I want to preserve the vanilla flavor and legitimacy - I just want to tweak some of the things that make it too easy.\r<br />\r<br />There are five tweak mods to choose from, which address 6 of the major &#34;easy-mode&#34; aspects of the vanilla difficulty.\r<br />1. Magicka cost reduction\r<br />2. Fortify crafting skill effects\r<br />3. Fortify weapon damage increase effects\r<br />4. Sneaking\r<br />5. Health regen\r<br />6. Instant potions\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />MODS OVERVIEW\r<br />\r<br />1. Less Magicka Cost Reduction\r<br />Lowers the magicka cost reduction, making it more difficult and less convenient to achieve 100% reduction.\r<br />Vanilla: 8-12-15-17-20-22-25 \r<br />Mod: 5-8-10-12-14-16-18\r<br />\r<br />2. Fortify Crafting Reduced\r<br />Aims to make crafting less OP and prone to abuse. It reduces the maximum crafting skill increase effect by roughly half of vanilla values. This should affect potions, enchantments, items, both non-crafted and crafted.\r<br />\r<br />3. Fortify Weapon Damage Reduced\r<br />Affects Fortify Marksman (Archery), Fortify One Handed and Fortify Two Handed enchantments. Reduces the amount damage can be increased by players enchanting their own items. \r<br />\r<br />4. Harder Sneaking\r<br />Should make sneaking more difficult. Increases the impact some of your actions, movement, sound and visibility will have on NPCs whilst you&#39;re sneaking.\r<br />Falmers should also be &#34;blinder&#34; now to compensate for increased visibility detection.\r<br />\r<br />I also recommend the Improved Sneak Detection mod by Dragonborn77. It could be better than mine and also includes Falmer blindness increase. Here is the link - http://skyrim.nexusmods.com/mods/23353\r<br />\r<br />5. Health Regeneration - Reduced\r<br />All player races have had their base health regeneration reduced from 0.7 to 0.3\r<br />\r<br />6. HoT, MoT, SoT Potions\r<br />Both crafted and non-crafted restore potions can be changed to RoT (restore over time) with a 5 second duration. For example, a Potion of Minor Healing now restores 5 health per second for 5 seconds, for a total of 25 points of healing (which is the same total as the vanilla potion). Ultimate Healing Potions restore 60 points per second, for a total of 300.\r<br />\r<br />HoT = Health\r<br />MoT = Magicka\r<br />SoT = Stamina\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />UPDATES\r<br />\r<br />8/12/12 - FIXED - Restore potion cost when buying or selling have been increased to approximately the same values as they should be. I had neglected to change this previously, resulting in being able to buy heal potions for a very low cost.\r<br />\r<br />7/12/12 - Added SoT (stamina) and MoT (magicka) Potions. \r<br />- Added Fortify Weapon Damage Reduced\r<br />- Added Dawnguard addon for Fortify Crafting Reduced\r<br />\r<br />21/11/12 - HoT Potions: Updated the in-game description of heal potions so that it now mentions they have a duration.\r<br />\r<br />20/11/12 - Harder Sneaking: I&#39;ve gained a better understanding about sneaking and detection so have made some changes to Harder Sneaking. I&#39;ve also increased the blindness of Falmers from 80 to 100.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />INSTALLATION\r<br />\r<br />Manual - Simply download the package file, or the individual mod files if you prefer. Add them to your Skyrim &gt; Data folder, and enable in Skyrim&#39;s launch menu section for Data Files.\r<br />\r<br />Nexus Mod Manager - Download, activate, enable as you please.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />TROUBLESHOOTING\r<br />\r<br />- You may find that pre-modded crafted items are not affected by the changes. However, newly crafted items should be.\r<br />\r<br />- Not all items in the game may be affected by the mods. It may be an oversight on my part, so please let me know. There may also be unique items with unique enchantments that outperform crafted items - this would actually increases the usefulness of uniques.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />FEEDBACK\r<br />\r<br />If you encounter any discrepancies/bugs/errors please let me know. And if you have any ideas about how to improve the tweaks, or add to them, please let me know that too&#33; \r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />WHY I MADE THESE MODS\r<br />\r<br />I made these mods because I want to play through the game again, and use crafting and potions and such, but not in the OP way they are given in vanilla. I like crafting, and I&#39;m not opposed to maxing it out in theory - the trouble is that in the vanilla game it totally breaks the challenge of the game to do so. I still want to use crafting, but want there to be limits set by the game engine so it doesn&#39;t become so OP. Combat should be intense, mentally-demanding and interesting. When you have an absurdly OP weapon, and 50 instant heal potions to spam, it is not. I&#39;d prefer it if the game itself set the limits, rather than me imposing soft limits on myself. And I know other players are also dissatisfied with vanilla difficulty and are eager for such modding also.\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~",
  "categoryId": "24",
  "version": "1.2",
  "author": "zyg0tic",
  "createdUnix": "1353321436",
  "updatedUnix": "1354933238",
  "containsAdultContent": false,
  "uploadedBy": "zyg0tic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "103585",
      "name": "MMH - Make Master Harder Suite",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "99",
      "fileName": "MMH - Make Master Harder Suite-27113-1-1.zip",
      "uploadedUnix": "1354851498",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/42cd4e6bb824ed6bbc69f71c96ccfce1fc24dce57579141a40bf16ad28e55ff8/analysis/1407293764/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MMH%20-%20Make%20Master%20Harder%20Suite-27113-1-1.zip?fid=103585&ttl=1535799648&ri=8192&rs=8192&setec=a16e7be729aebdc18c336e65e5307a92"
    },
    {
      "fileId": "103739",
      "name": "Regen Reduced DG Edition",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "95",
      "fileName": "Regen Reduced DG Edition-27113-1.zip",
      "uploadedUnix": "1354932886",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/a5922d49d3e91d0c1450384dcb598d0b453883bdefcf5de3725337f891de6092/analysis/1407294486/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Regen%20Reduced%20DG%20Edition-27113-1.zip?fid=103739&ttl=1535799648&ri=8192&rs=8192&setec=9507ec40474609c81608ef56605866a7"
    },
    {
      "fileId": "103740",
      "name": "MMH - Make Master Harder Mods Package",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "98",
      "fileName": "MMH - Make Master Harder Mods Package-27113-1-2.zip",
      "uploadedUnix": "1354933238",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/c6f2d15a4b5d4d56a09b6fc63fc8efeec379f9a96af24fdb9c6379e20e71a89b/analysis/1407294487/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MMH%20-%20Make%20Master%20Harder%20Mods%20Package-27113-1-2.zip?fid=103740&ttl=1535799649&ri=8192&rs=8192&setec=73670caeee3012314a283455079149b7"
    }
  ]
}