{
  "modId": 27112.0,
  "modName": "Alucard from Castlevania as Follower",
  "summary": "Add Alucard as a follower, as well as a new armor set and weapon.",
  "descriptionHtml": "I hope I pact it right, so let me know if it doesn\\'t install right, I\\'m not used to nexus uploading procedure.\r\nUPDATE!\r\nNoticed that one of the fur armors is taking the appearance of Alucard Armor. Im going to fix that also decrease some of the enchantements for the sword, like werewolf knock back as it seems to be knocking everyone back.\r\nV1.\r\nTHIS IS MY VERY FIRST MOD!!!\r\n\r\nThis is a follower mod I made. It is Alucard from the Castlevania series, he is pretty powerful, infact too powerful, so I nerfed his abilities and armor ratings. He has his own unique sword and armor, they are simply retexturings of the Royal Vampire Armor and of the silver sword. If there are problems let me know. You can find him in Riften in the Bee and the Barb pub. You can also get his armor and sword which are located in a \\\"Mysterious Chest\\\" in riverwood by the stream near the black smith, you can\\'t miss it! \r\n\r\nMy plan was to bring Alucard into the game in a lore friendly way, I would maybe like to make a quest about him, and Dracula, much like with castlevania memories mod, but this one would be set in the world of the elder scrolls, so this is an alucard not connected so closely to the games. I may need help to do that anyway thats my idea, enjoy!",
  "categoryId": "66",
  "version": "V1.1",
  "author": "snakedeshazer",
  "createdUnix": "1353320461",
  "updatedUnix": "1353324523",
  "containsAdultContent": false,
  "uploadedBy": "snakedeshazer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "100476",
      "name": "AlucardFollower",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12030",
      "fileName": "AlucardFollower-27112-v1-1.rar",
      "uploadedUnix": "1353324523",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/56be9f0f44157fe47bc7795460a5157ac3a82a7743edc16f2678de8d061029f4/analysis/1407269528/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AlucardFollower-27112-v1-1.rar?fid=100476&ttl=1535799646&ri=8192&rs=8192&setec=0716a99970d2df790ea27d2cd8879697"
    }
  ]
}