{
  "modId": 27152.0,
  "modName": "Lynesta - follower designed as spouse with merchant skills",
  "summary": "This mod add\\'s a simple NPC follower designed for the specific purpose of being a spouse.",
  "descriptionHtml": "“Take my wife.......please!”\r\n\r\nThis gem of a joke from Rodney Dangerfield says it all. \r\n\r\nMeet Lynesta, created specifically as marriageable follower for the express purpose of having a spouse that would work with these two mods:\r\n\r\nEkkii Spouse Life - http://skyrim.nexusmods.com/mods/10319\r\n\r\nSpouse Store Mod - http://skyrim.nexusmods.com/mods/12325\r\n\r\nI was getting a bit tired of having to run around all of Skyrim trying to offload my ill gotten loot until I found the above mod and thought perhaps that a spouse with a dedicated Barter skill would help my make a few Septims without having to do much legwork. \r\n\r\nAdditionally I found it very frustrating that I was being penalised by the barter system with merchants not having enough gold to pay for my awesome weapons, armour and potions after I had so carefully invested time and effort into Smithing and Alchemy. Yes while I realise there are mods here on our wonderful Nexus that can raise the gold of various merchants I attempt to role play Skyrim as lore friendly and immersive as possible.  \r\n\r\nAfter two play throughs with both toons married to Lynesta, the happy couples managed to make quite a substantial amount of gold from the comfort of Breezehome without having to venture out too much to offload loot. \r\n\r\nPlease note: Both games were played prior to my installing Hearthfire.\r\n\r\nStatistics:\r\n\r\nRace: Nord\r\n\r\nSkill set: Vendor - Pawnbroker\r\n\r\nLocation: Old Hrolden Inn\r\n\r\nWhile she is combat capable she won’t exactly be going toe to toe with Alduin or anything hence I usually whisk her off to Riften to get married and then to Breeze home for the um-ah honeymoon, before putting her to work in the Whiterun market District.\r\n\r\nLynesta is custom player house friendly and has an amount of gold and gold ingots in her inventory when you meet her along with an enchanted Dwarven Dagger and Bow.\r\n\r\nRequired Mods:\r\n\r\nNumenume Hair - http://skyrim.nexusmods.com/mods/11173\r\n\r\nSylvia tattoos - http://skyrim.nexusmods.com/mods/23362\r\n\r\nMods  featured  in  screenshots:\r\n\r\nUNPB Blessed Body – standard - http://skyrim.nexusmods.com/mods/14899\r\n\r\nOsare Gothic Lolita - http://skyrim.nexusmods.com/mods/17727\r\n\r\nSeraphine Armour – UNPB BBP - http://skyrim.nexusmods.com/mods/25153\r\n\r\nTifa Outfit - http://skyrim.nexusmods.com/mods/14216\r\n\r\nPlease also note this is a huge step for me sharing a first mod as I am pretty much an “Old Noob” – that until recently had no idea how to use the CK or NPC Editor. \r\n\r\nAny constructive comments or advice would be greatly appreciated.\r\n\r\nThanks:\r\n\r\nBravoOskar \r\n\r\nFor his fantastic nub friendly tutorial ( http://skyrim.nexusmods.com/mods/23972) which gave me to courage to even attempt to make some NPC’s for my own use. Unfortunately he has decided to withdraw from modding at the moment but I for one hope to see his brilliant talents on display on Nexus again in the future. \r\n\r\nWith some more tweaking I hope to be able to share my other NPC’s with your all very soon.\r\n",
  "categoryId": "66",
  "version": "1.0",
  "author": "Stew Hood ",
  "createdUnix": "1353396537",
  "updatedUnix": "1353397568",
  "containsAdultContent": false,
  "uploadedBy": "StewHood",
  "primaryFile": null,
  "files": [
    {
      "fileId": "100642",
      "name": "Lynesta",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "424",
      "fileName": "Lynesta-27152-1-0.rar",
      "uploadedUnix": "1353397568",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ceb5b1e998150385e293045d76a05f1eca21b8ebf0e5066cb6ca0820ff81a9fb/analysis/1407270666/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lynesta-27152-1-0.rar?fid=100642&ttl=1535799714&ri=8192&rs=8192&setec=cc96de95ee73248b8c9729dcc5cd0c50"
    }
  ]
}