{
  "modId": 27205.0,
  "modName": "Balanced Katana Crafting",
  "summary": "Adds craftable balanced 1H and 2H katanas for crafting in Skyrim that require either daedric or dragon smithing perks",
  "descriptionHtml": "In vanilla skyrim, there is only one choice for 2H weapons - big and slow. This mod adds a craftable 2H Katana to skyrim using the Ebony Blade&#39;s vanilla model. I made sure to balance it by keeping its DPS consistent with a Daedric Greatsword. The difference is that the attacks are faster, but do less damage per hit. It is also quieter when drawn (useful for stealthy characters). This adds new options for players when using 2H weapons.\r<br />\r<br />To make a 2H katana (called Di-Katana ingame), you must have daedric smithing. It can be crafted at any forge. This item is unenchanted when made and can be tempered with an ebony ingot.\r<br />\r<br />I also added a second 2H katana that is enchanted with a &#34;mysterious&#34; and relatively unique enchantment. This is an invention of Eorlund Gray-Mane, and hints about this sword are hidden in an accidently dropped note near the Skyforge. This is only craftable at the Skyforge after completing the Companions questline and requires the additional Arcane Smithing perk. It fits nicely in with the questline as a side-story of Eorlund Gray-Mane creating a new sword design that takes through the completion of the Companions questline to perfect.\r<br />\r<br />This mod shouldn&#39;t interfere with any other mods.\r<br />\r<br />UPDATE 1: I have also added a 1H Daedric Katana with the same design principle. The weapon attacks faster, but does less damage for the same DPS as a Deadric Sword.\r<br />UPDATE 2: I have made it so that if you have daedric smithing or dragon smithing, you can make the katanas. This allows light armor speced players to make them too.\r<br />\r<br />Do you want a follower that uses this 2H katana?  Download my other mod: http://www.nexusmods.com/skyrim/mods/27206",
  "categoryId": "55",
  "version": "",
  "author": "Freyzor",
  "createdUnix": "1353464799",
  "updatedUnix": "1353465192",
  "containsAdultContent": false,
  "uploadedBy": "Freyqq",
  "primaryFile": null,
  "files": [
    {
      "fileId": "100819",
      "name": "katana crafting",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "katana crafting-27205-.zip",
      "uploadedUnix": "1353465192",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c449077710f66136e6c3a439b724545f01ef98963fe8ab244eda2a2898b2ceaf/analysis/1407271923/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/katana%20crafting-27205-.zip?fid=100819&ttl=1535799799&ri=8192&rs=8192&setec=521b0e331b483520ba692b335b46be66"
    }
  ]
}