{
  "modId": 27200.0,
  "modName": "Gilded Elven Armor",
  "summary": "Adds the rest of the Gilded Elven Armor set, makes all Gilded Elven pieces require Advanced Smithing to craft or improve, and makes Gilded Elven a set that benefits from Matched Set (Light Armor: 70).",
  "descriptionHtml": "I created this mod because I felt like the Gilded Elven Cuirass was out of place and I was frustrated that it didn\\'t cause a matched set bonus.  (In the end, Gilded Elven is its own set, and isn\\'t compatible with regular Elven as a bonus for the Light Armor 70 perk:  Matched Set)\r\n\r\nAll the Gilded Elven pieces have 20% more Armor Rating than the normal Elven pieces, rounded to the nearest whole number in keeping with Elven Gilded Cuirass being about 20% stronger than the regular Elven Armor.\r\n\r\nI did not add any Gilded pieces to leveled lists or random enchanted item lists (I might consider it with enough interest/endorsements/comments).  Currently, the only way to acquire these items is to build them at the forge, and it will require the Advanced Smithing perk.  The recipes mostly require a single piece Quicksilver instead of a single piece of Leather (the Shield being the exception, it replaced an Iron Ingot with a Quicksilver Ingot).\r\n\r\nCompatibility/Prerequisites:\r\nDLC:  This shouldn\\'t require any of the DLC packs, I have them, though, so if someone without runs into issues, please say so.\r\nMods:  This shouldn\\'t require Lost Art of the Blacksmith, Smithing Perks Overhaul, and/or Weapons and Armor Fixes.  If someone without runs into issues, please say so.  (One of those mods tried to influence Elven Gilded Cuirass by giving it a second armor keyword, and I took it out to prevent 4x armor improving.)\r\n\r\nDirty Edits:\r\nThere might be some.  This is my first mod editing objects, and I did it in the Creation Kit.  I\\'d take constructive tips on how to cleanse them if they exist.",
  "categoryId": "36",
  "version": "0.1",
  "author": "physicist1",
  "createdUnix": "1353462704",
  "updatedUnix": "1353462854",
  "containsAdultContent": false,
  "uploadedBy": "physicist1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "100811",
      "name": "Gilded Elven Armor",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Gilded Elven Armor-27200-0-1.7z",
      "uploadedUnix": "1353462854",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/f137ebc645901e59fb9b9db97c3f17be920bc7aa8e2c1d43d71fd8e5bcc697bd/analysis/1407271810/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gilded%20Elven%20Armor-27200-0-1.7z?fid=100811&ttl=1535799781&ri=8192&rs=8192&setec=ea9c57f684642fc1781ec74343625de3"
    }
  ]
}