{
  "modId": 27216.0,
  "modName": "The Town Is Safe",
  "summary": "Decreases the lethality and frequency of vampire attacks on towns.",
  "descriptionHtml": "[center][b][size=1][color=#FF0000]ATTENTION:[/color] While I reserve the right to delete off-topic comments and trolling from my threads, I WILL [u]NEVER[/u] BAN [u]ANY USER[/u] FROM ACCESSING [u]ANY[/u] OF MY FILES, NO MATTER WHAT THEY POST IN THE COMMENT THREAD. THERE ARE [u]NO[/u] EXCEPTIONS TO THIS RULE.[/size][/b][/center]\r\n\r\nTheTownIsSafe - 0.3a\r\n\r\nAuthor: bluedanieru\r\n\r\n--------------------------------------------------------------------------------\r\n\r\nDecreases the lethality and frequency of vampire attacks on towns. Rather than spawning Master Vampires for town attacks, will spawn from the leveled list for regular vampires. Decreases by 95% the chance of encountering a vampire in a town normally, and by half the chance of encountering a vampire in a town during an eclipse. Note also that the new spawns might not take effect until after the next vampire attack, *after* loading this mod. That is, possibly you can install this plugin and see one more attack on a town by a Master Vampire, and *then* only after that with regular vampires. Also, the decreased chance for spawning in towns will not drop until after the first attack, after loading this mod. Don't spam the comments section with messages about this. IF YOU DO I WILL HUNT YOU DOWN AND CUT OUT YOUR HEART AND DRINK YOUR BLOOD. YOU'VE BEEN WARNED.\r\n\r\nIt also gives guards an attack bonus against vampires, allowing them to dispatch vampires more quickly.\r\n\r\nFinally, it lowers the frost damage dealt by Death Hounds, as if a few of them got near an NPC it was pretty much an insta-kill, especially if the NPC wasn't a Nord.\r\n\r\nInstallation:\r\n\r\nPlace the contents of the archive in your Skyrim/Data directory. Works with Nexus Mod Manager.\r\n\r\nCompatibility:\r\n\r\nIncompatible with some mods that make changes to guards, depending on how that change is implemented. Also incompatible with mods that make changes to Death Hound abilities and vampire attack frequency in Dawnguard, naturally. In any case you should be able to load this mod first and just lose whatever part is incompatible.\r\n\r\nNot compatible with \"When Vampires Attack\".\r\n\r\nVersion History:\r\n\r\n0.3 - Initial release.",
  "categoryId": "28",
  "version": "0.3",
  "author": "bluedanieru",
  "createdUnix": "1353494126",
  "updatedUnix": "1353494308",
  "containsAdultContent": false,
  "uploadedBy": "bluedanieru",
  "primaryFile": null,
  "files": [
    {
      "fileId": "100863",
      "name": "The Town Is Safe - 0_3",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22",
      "fileName": "The Town Is Safe - 0_3-27216-0-3.zip",
      "uploadedUnix": "1353494308",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/6ec082f08a648453470bfab87acca07e93877e09f5998928db63227b3a0cea8f/analysis/1407272229/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Town%20Is%20Safe%20-%200_3-27216-0-3.zip?fid=100863&ttl=1535799815&ri=8192&rs=8192&setec=def6c92d28f66dff17629873cf31b29f"
    }
  ]
}