{
  "modId": 27263.0,
  "modName": "Enhanced Dragon Shouts for -Dovahkriid - The Dragon Lords-",
  "summary": "A simple audio modification that \\\"enhances\\\" the vocals of the dragon lords to sound more beastly and intense! I\\'ve added several subtle layered effects to really bring out the \\\"oomph\\\" factor when facing these mighty beasts. In future version, I, my self, will be voicing \\\"custom\\\" shouts too which are also found in AurianaValoria1 great mod!",
  "descriptionHtml": "[size=6]Enhanced Dragon Shouts For Dovahkriid - The Dragon Lords [/size]\r\n\r\n[IMG]http://i50.tinypic.com/71lk4p.png[/IMG]\r\n\r\n[size=5]Requires:[url=http://skyrim.nexusmods.com/mods/11206] Dovahkriid - The Dragon Lords [/url][/size]\r\n\r\nFEEDBACK\r\n==========\r\n\r\nPLEASE watch my new videos as there uploaded, especially the ones of my \\\"new\\\" shouts (the second video currently) as i\\'d like to know what you think :), this is a personal taste mod, if you don\\'t like what you hear, politely move on, if you do, give me ideas to make it even better :), (within reason) i wont be taking ideas based on \\\"this sounds shit\\\" or \\\"omg that doesnt sound right\\\" or \\\"make it sound better because it doesnt sound good\\\" i mean come on, that helps no one, if you have ideas give me them positively, not negatively! Thank you.\r\n\r\n- Overwhelming majority\r\n- It\\'s a damn good idea/addition to the mod (in my opinion)\r\n- Fixes a bug/issue/is based on positive feedback\r\n\r\nAdditions\r\n==========\r\n04/11/2012 - Made sure its mod manager downloadable, sorry about that, site issues!\r\n28/11/2012 - Updated main file, now includes ESP to fix \\\"duration\\\" issues with dragon shouts\r\n24/11/2012 - New video demonstrating my custom made shout for \\\"Elemental Breath\\\" is now up!\r\n23/11/2012 - Added sample video demonstrating the \\\"enhanced\\\" sounds, with the video, its default sound first THEN my edited sound afterwards in order going back and forth until the end :).\r\n\r\nComing soon\r\n===========\r\n\r\n- Try and figure out a way to make the sounds in game \\\"echo\\\" around the enrioment better\r\n- Custom dragon shouts done by myself, for the \\\"none vanilla\\\" shouts found in the mod\r\n\r\nDescription\r\n===========\r\nSimply put, this just enhances the male dragons vocal shouts to be a bit more \\\"beefy\\\" and, IMO personally sound a bit more dragon-like. \r\nOr more technically, i\\'ve added the following effects:\r\n\r\n- Enhanced reverberation effects to give the scale of the beasts more punch\r\n- Added a pitch decline layer that ever so slightly makes the shouts \\\"throatier\\\" and more beast like\r\n- Added a snare room effect, normalized and extended the current layers so the sound bigger, more echoing and slightly more bassy\r\n- Overall volume increased to match layer adjustments\r\n\r\nSo all in all, it\\'s just a simple set of tweaks that make the shouts more dragon like, and bit let humanoid sounding\r\n\r\n\r\nInstall\r\n=======\r\n1. Extract the files to a temporary location, like the desktop.\r\n1a. Just in case, backup the folder \\\"AV1Dragon_Lords.esp\\\\CrDragonLordMale\\\" found in the \\\"Data\\\\sound\\\\Voice\\\" folder (just in case for whatever reason you dislike the changes)\r\n2. Copy the \\\"data\\\" folder to Steam\\\\SteamApps\\\\common\\\\Skyrim\r\n3. Let it overwrite everything it asks for, clicking \\\"yes\\\"\r\n3a. load my esp literally just after original esp (av1dragon_lords.esp)\r\n4. Play, find a dragon, and experience it for your self! (or just play the audio files first to get some idea of what you\\'ll here)\r\n\r\nUninstall\r\n=========\r\n1. Simply just replace your backup copy of \\\"CrDragonLordMale\\\" folder and overwite, then you will have the default sounds again.\r\n\r\nIncompatibility\r\n===============\r\nN/A\r\n\r\nKnown Issues or Bugs\r\n====================\r\nN/A\r\n\r\nHistory\r\n=======\r\n1.01 - fix for sound duration issue\r\n1.0 - release\r\n\r\nContact\r\n=======\r\nLeave a comment in the thread\r\n\r\nCredits\r\n=======\r\nThanks to Bethesda for creating Skyrim and the Creation Kit.\r\nThanks to Zardalu for the fixed Blood Dragon texture.\r\nThanks to Mujuro for the quest script.\r\nThanks to Blacksupernova for his help in figuring out voice files, and for his Dragon Real Shout mod, upon which these voices were based.\r\nThanks to LHammonds for the Readme Generator this file was based on.\r\n- Thanks to AurianaValoria1 for the original mod and allowing permissiong to upload my enhancments\r\n\r\nTools Used\r\n==========\r\n7-Zip - http://www.tesnexus.com/downloads/file.php?id=15579\r\nReadme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r\nAbletonLive - https://www.ableton.com/en/ (for the ehancements)\r\n\r\n\r\nLicensing/Legal\r\n===============\r\nThis mod is not to be uploaded to any other site for any reason, regardless of whether or not you can contact me/us. ",
  "categoryId": "61",
  "version": "1.01",
  "author": "Tyranick",
  "createdUnix": "1353587801",
  "updatedUnix": "1354106629",
  "containsAdultContent": false,
  "uploadedBy": "†TYRANICK†™",
  "primaryFile": null,
  "files": [
    {
      "fileId": "101034",
      "name": "Version 1 Enhanced Sounds",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1786",
      "fileName": "Version 1 Enhanced Sounds-27263-1-0.rar",
      "uploadedUnix": "1353589311",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3b4670b548a2ccc32756b1693ec1b0da53401bff93c772f24ce67dce2d96f8d8/analysis/1407273429/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%201%20Enhanced%20Sounds-27263-1-0.rar?fid=101034&ttl=1535799877&ri=8192&rs=8192&setec=b12824da9aa11bf57726d0d5263b338a"
    },
    {
      "fileId": "102061",
      "name": "EMD Shouts",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1786",
      "fileName": "EMD Shouts-27263-1-01.rar",
      "uploadedUnix": "1354106629",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/5849d709e1be6133f384f7ad8d8a6de91c6e24019357bb0af8ecdb186230a946/analysis/1407281663/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EMD%20Shouts-27263-1-01.rar?fid=102061&ttl=1535799877&ri=8192&rs=8192&setec=8ccce0f9baf18582c6178a0f03414c11"
    }
  ]
}