{
  "modId": 27320.0,
  "modName": "Riften Bypass",
  "summary": "Adds a road along the east side of Riften.",
  "descriptionHtml": "This mod adds a road that connects the Riften north gate to the road that leads to Morrowind, allowing traffic and commerce to get to Riften from the direction of Morrowind.  An unmaintained road between the Riften southeast gate (boarded up) and the south gate exists on the south side of the Riften wall.  While not intended for heavy traffic, it acknowledges that the pathway exists.\r\n\r\nThe bypass road between the north gate and the road to Morrowind was constructed largely to avoid the city after the revolt and subsequent burning of Riften in 4E 129.  Although the events in Morrowind at the beginning of the 4th Era had resulted in diminished commerce and greatly reduced traffic, once the Dunmer exodus from Morrowind was finished, the road to Morrowind was still considered important. \r\n\r\nToday, the road eliminates the need to man and maintain the south east gate into the city during this time of civil unrest.  Although portions of the road are in disrepair due to time and the elements, the road remains an important link between Skyrim and Morrowind.\r\n\r\nNotes:\r\n1) This mod does not do anything to address the usability of south east gate, the one that is boarded up.  Other mods have addressed that, but they have not been tested along with this mod.  My feeling is that opening this gate introduces problems with any attacks upon Riften during the civil war, as well as additional complexities with gaining initial entry into Riften.\r\n2) The road is fully nav-meshed and is marked for NPC priority.  NPCs will have no problems traveling this road.\r\n3) The encounter area on the east side of Riften remains in place and is close enough to the road that randomly spawned encounters will involve travelers on the road.\r\n4) Additional trees were added near the south gate at the fork where the broken path leads along the wall.  These trees were added for aesthetic purposes to hide the repeating texture pattern on the Riften wall as seen by travelers approaching Riften from the southwest.\r\n5) This mod was conceived prior to Dawnguard, but I did not decide to build it until after I saw Dawnguard.  It works with Dawnguard, and in fact I think it adds to Dawnguard, but Dawnguard is not needed.\r\n6) Extra care was taken to avoid conflicting with the civil war attack on Riften, however, I have not directly tested it to make sure that no conflict exists.\r\n7) This mod makes extensive changes to terrain and flora from the Riften north gate to the Morrowind road and from the closed southeast gate to the south road to Riften.  Any other mods that use or change this area may conflict.\r\n8) This mod is an old mod for me and has been used with every patch since Dawnguard.\r\n9) I do not own Hearthfire but do not expect any conflicts.\r\n\r\nInstallation:\r\n\r\nUse NMM to install for best results.  Otherwise, copy the RiftenBypass.esp to the Data directory and check the mod to activate. Load order should not be an issue unless there is a conflicting mod.\r\n\r\nUninstallation:\r\n\r\nSimply remove RiftenBypass.esp.  It is probably best to not be in the area, so as to avoid unnecessarily scaring the characters and NPCs when the road suddenly vanishes.\r\n\r\n\r\n",
  "categoryId": "58",
  "version": "1.0",
  "author": "lordrichter",
  "createdUnix": "1353709338",
  "updatedUnix": "1353709396",
  "containsAdultContent": false,
  "uploadedBy": "lordrichter",
  "primaryFile": null,
  "files": [
    {
      "fileId": "101276",
      "name": "RiftenBypass",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "391",
      "fileName": "RiftenBypass-27320-1-0.zip",
      "uploadedUnix": "1353709396",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/069a0f275f6988847183e60201682a6bb8625c98c9190862045d1e1802c9c8b7/analysis/1407274929/",
      "changelogHtml": " Initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RiftenBypass-27320-1-0.zip?fid=101276&ttl=1535799958&ri=8192&rs=8192&setec=d7685ceed59b70ba32d9da70546eeffe"
    }
  ]
}