{
  "modId": 27326.0,
  "modName": "Wearable Satchel",
  "summary": "A playable modders resource which showcases three scripting variants of a wearable satchel that also doubles as a container.",
  "descriptionHtml": "This is a playable modders resource.\r\n\r\n[color=pink]Sources & Permissions[/color]\r\n-- The satchel (mesh & texture) comes from the stock game\\'s Imperial heavy armor set. Fortunately it was a separate mesh from the armor so that made my life much easier.\r\n-- The ground object satchel is an adaptation of the stock alchemy satchel that I made for my bag of holding mod Glimpse of Elsewyr. I was unable to get a working ground object with the wearable satchel so I opted to use the other since this mod is more for demonstration purposes than flushed out game incorporation.\r\n-- The scripts are written by myself and this mod is intended to show how they work as well as the ideas behind them. Using & adapting the scripts for personal use is fine, no need to ask me.  Using & adapting the scripts for a mod release simply requires credit for my hardwork.\r\n-- Everything else is simple Creation Kit work that anyone could accomplish if they put their minds to it.\r\n\r\nThere are three versions of a wearable satchel.  All three are craftable in the leather section for 2 leathers and 4 strips.  All three use the same body slot (58) and cannot be worn at the same time.  The male version is stock and the female version is UNP based from the adaptation by exeter for his mod UNP Female Armors -- http://skyrim.nexusmods.com/mods/7305\r\n\r\n[color=pink]Satchel - Anything[/color]\r\nThis is by far the most simple, but may be considered by some to also be the most \\\"non-realistic\\\"\r\nThis satchel is a fixed 45 pounds. When grabbed it will open a container which you can place anything within. If you do not want to drop & grab you can also access the container by favoriting the satchel & assigning it a hotkey (numbers 1 thru 8), the container will open whenever unequipped. If unequipping in the regular player inventory, you may notice a slight jump on exit, this is due to the unequip function running but not able to display the container\\'s interface.\r\n\r\n[color=pink]Satchel - Smithing[/color]\r\nThis is a step up from the previous version and attempts to be a little bit realistic.\r\nThis satchel is a fixed 10 pounds. When grabbed it will open a container which you can place anything within. If you do not want to drop & grab you can also access the container by favoriting the satchel & assigning it a hotkey (numbers 1 thru 8), the container will open whenever unequipped. If unequipping in the regular player inventory, you may notice a slight jump on exit, this is due to the unequip function running but not able to display the container\\'s interface.  Whenever this satchel is dropped to the ground or placed into another container smithing related materials in the player\\'s inventory will be auto-transfered.  When the satchel is re-equipped all items stored inside will be returned to the player.\r\n\r\n[color=pink]Satchel - Alchemy[/color]\r\nThis satchel is the most complicated and tedious to set up and given game limitations is the most realistic of the three.\r\nThis satchel is a fixed 10 pounds with a 35 pound enchantment to carry weight. When grabbed it will open a container which you can place anything within. If you do not want to drop & grab you can also access the container by favoriting the satchel & assigning it a hotkey (numbers 1 thru 8), the container will open whenever unequipped. If unequipping in the regular player inventory, you may notice a slight jump on exit, this is due to the unequip function running but not able to display the container\\'s interface.  Whenever this satchel is dropped to the ground or placed into another container alchemy related materials in the player\\'s inventory will be auto-transfered to as close as possible to the 35 pound enchantment.  When the satchel is re-equipped all items stored inside will be returned to the player.\r\n\r\nWhile the last two versions attempt to be \\\"realistic\\\", they only remain so if you do not add anything else to them. The major difference between the last two versions is that the smithing uses a form list while the alchemy uses an array.  Arrays are limited to 128 items and they do process slower than form lists, but are the only way to determine how much weight has been transfered out from the player as that value has to be checked after each item. In fact you can open your inventory and watch as the items are removed to the container. Form lists have no limit and are fairly instant transfers but they will take all of every item available that is on the list, therefore it is impossible to halt a form list transfer when a certain weight is reached.\r\n\r\n[color=pink]Customizing[/color]\r\n[color=deeppink]Mod authors[/color] \r\n-- you\\'ll want to examine how this is setup and recreate with your own versions in your own mods.\r\n[color=deeppink]Mod users[/color] \r\n[color=orange]-- To add more items to the alchemy satchel:[/color]\r\nEvery stock game item short of 3 specific quest items are already included. DLC items are not.  To add them you will need to include the DLC esm file as a master and load this plugin as active in the Creation Kit. You will need to locate the armor form abIM_WearableSatchelB, right click & choose edit, locate the script section, highlight the only script & press the properties button. In the window that pops up, highlight the ingredient property entry. A long list of items will appear, scroll thru the list to get an idea of what is there vs what is missing then press the Add button.  A drop down box will appear at the bottom with the word NONE, go thru the drop down box and find an entry you want to add, highlight it and press Add again if you are going to add more, if it is your last entry to add simply click in the large list of items and it will be added. Press Ok to save the property change, press Ok to save the armor form, then save the plugin.\r\n\r\n[color=orange]-- To add more items to the smithing satchel:[/color]\r\nMost smithing items have been included but not all. Locate the form list abIM_CraftingItems, right click & choose edit, move the new window so that the Object window will not cover it up.  Locate whatever items you want to add in the Object window then drag and drop them to the form list, they\\'ll be added to the bottom. When finished press Ok to save the form list and save the plugin.\r\n\r\n[color=pink]Installation:[/color]\r\nPlace the esp & bsa files into your data directory & Activate. NMM can do this for you.\r\n\r\n[color=pink]Uninstallation:[/color]\r\nDeactivate & Remove the esp & bsa files from your data directory. NMM can do this for you.\r\n\r\n[color=pink]Credits:[/color]\r\nBethesda for Skyrim & the Creation Kit\r\nexeter for UNP Female Armors -- [url=http://skyrim.nexusmods.com/mods/7305]http://skyrim.nexusmods.com/mods/7305[/url]",
  "categoryId": "82",
  "version": "1.0",
  "author": "IsharaMeradin",
  "createdUnix": "1353714714",
  "updatedUnix": "1353714805",
  "containsAdultContent": false,
  "uploadedBy": "IsharaMeradin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "101291",
      "name": "Wearable Satchel",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3100",
      "fileName": "Wearable Satchel-27326-1-0.7z",
      "uploadedUnix": "1353714805",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/78ff1702f8b30de66f02613390f282b470162805cb4909c5825e4ec2c22332b7/analysis/1407275002/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wearable%20Satchel-27326-1-0.7z?fid=101291&ttl=1535799967&ri=8192&rs=8192&setec=4b628b80d35827328012bb08bc17a23e"
    }
  ]
}