{
  "modId": 27338.0,
  "modName": "SoulMasters Dragon Bridge Player House",
  "summary": "A modest Player House set in Dragon Bridge",
  "descriptionHtml": "Hi,\r\n\r\nThank you for downloading and trying my Player House Mod.\r\n\r\nSM_House_Mod_1-1.esp needs to be installed in your Skyrim Data folder. \r\n\r\nThe Nexus Mod Manager should install it with no trouble.\r\n\r\nIf you head over to Arcadia\\'s Cauldron in Whiterun, you will find a letter on the counter.\r\n\r\nThe letter informs you of the untimely death of the Mighty Warrior SoulMaster, and that you the player have inherited his modest house.\r\n\r\nThe House is located in Dragon Bridge.\r\n\r\nThere are one or two interesting items to find in the house and surrounding area.\r\nCan you discover SoulMaster\\'s Secret?!\r\n\r\nIncluded is the Bow from my previous Mod - SoulMaster\\'s Doom Bow and Soul Arrows. I have lowered the power on the bow for this mod to take it out of the Godly Items Category. It is however, still very powerful!\r\n\r\nAll crafting is catered for in the House with A Blacksmith\\'s Forge, Workbench and Grindstone. A Tanning Rack, An Enchanting Table and Alchemy Table. \r\nIn the garden is a Smelter and veg plot and chickens wander around too. Cooking is catered for as well.\r\n\r\nA new bridge adjacent to the Dragon Bridge affords access to the House.\r\n\r\nThere are some lovely views from the surrounding area.\r\n\r\nPlease feel free to leave feedback and help me improve the mod with your suggestions?\r\n\r\nKnown issues:\r\n\r\nBookshelves currently do not work correctly - will be fixed in the next update.\r\n\r\nVersion History:\r\n\r\n1.0 \r\nInitial release required Dawnguard and Hearthfire to run\r\n\r\n1.1 \r\nFixed File Header now does not need Dawnguard or Hearthfire!\r\nAdded chimney smoke\r\n\r\nOther Mods I have done that may interest you:\r\n\r\nhttp://skyrim.nexusmods.com/mods/26201\r\nhttp://skyrim.nexusmods.com/mods/27599\r\nhttp://skyrim.nexusmods.com/mods/27591\r\nhttp://skyrim.nexusmods.com/mods/26099\r\n\r\n[color=#00FFFF]Please take note: If you are using a pirated (ie non Steam enabled) version of the game, please do not leave comments about how this part of my mod or that is not working on your game! I am not prepared to waste my time trying to help you out with your illegal software! I\\'m unemployed, but still manage to pay for my games (they are what keep me sane) so if I can, you should be able to as well![/color]\r\n\r\nSoulMasterII\r\n\r\n[IMG]http://i1154.photobucket.com/albums/p535/mike_patrick1/sm0g9rv24znf_zps9d795d9a.gif[/IMG]\r\n\r\n[color=#FFFF00]Please, DO NOT upload any part of my mods anywhere else![/color]",
  "categoryId": "67",
  "version": "1.1",
  "author": "SoulMasterII",
  "createdUnix": "1353728038",
  "updatedUnix": "1353985131",
  "containsAdultContent": false,
  "uploadedBy": "SoulMasterII",
  "primaryFile": null,
  "files": [
    {
      "fileId": "101881",
      "name": "Version 1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "160",
      "fileName": "Version 1-1-27338-1-1.7z",
      "uploadedUnix": "1353985131",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6bdba5a8f00259373f5d7f59a17e195c85f2ebd9d0afe446720dc2cff9acb226/analysis/1407279989/",
      "changelogHtml": " No longer requires DLC to run. <br/> \n Added chimney smoke <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%201-1-27338-1-1.7z?fid=101881&ttl=1535799987&ri=8192&rs=8192&setec=a0e2615612a91d6e5c31db0643375a06"
    }
  ]
}