{
  "modId": 27341.0,
  "modName": "Fallen Angel_Demon Nord",
  "summary": "Demonic race",
  "descriptionHtml": "This is a mod i created to be a god character with out actually using god mode. starts out with 500 health, 550 stamina, and 650 magic. all of which regenerate very fast and health regenerates during combat. the base of this mod (where i got the idea) was basicly the lore behind the fallen angels in the christian religion, as such this race is EXTREMLY POWERFULL. it starts out with 4 very leathal fire based destruction spells (one of which does 300 damage), 1 illusion spell that should allow you to remain hidden for a LONG time, as well as a night eye effect based off of the vampire sight. this race was not designed to be used with weapons as i also raised the unarmed attack damage higher than that of a werewolf. it is designed to be uses as a magic/unarmed race.\r\nthis race boasts 100 resist to fire and 50 frost as well as a unarmored Armor rating of 80 (which when paired with even the weakest of armors should give you a very good protection). i didnt get all fancy with appearance, its basic nord, (due to my belief that if a demon was to actually come to earth they wouldn\\'t look like a demon, but like an ordinary person to better blend in) i taint gonna give you mucch in the way of a challenging play through but will work good as a F**k around character. i have yet to test it with either vampire scripts or werewolf scripts as i just got done running through helgen and stopped when i got to whiterun. \r\n\r\na mod id recomend which i like to use with this. ive been trying to figure out how to add flight to this mod with out other mods but untill i figure it out id recomend the flying ring mod\r\n\r\nhttp://skyrim.nexusmods.com/mods/15775\r\n\r\nPS. the way i meant to have it was to also be alot faster than everyone in the game....but creation kit dont allow you to modify movement speed ( atleast not that ive found anyways.) so to get the full effect on how i really planed it you\\'ll have to use the console to modify speed. \r\nplayer.setav speedmult 200  that should get you to the speed i originally had in mind.\r\n\r\nUpdate 1.2: bumped fire resist from 100 to 70. added 100 disease resist, added 30 resist to shock. corrected the frost resist from 50 to 0 because i forgot nords have 50 resist to frost anyway.\r\n\r\npossible future updates:\r\nif i could ever figure out how to 3d model id like to add a transfomation power that will give it usable wings as well as a more demonic appearance and an even higher stats as a kind of True Form deal. if any one could recomend tutorials on similar subjects that would help in this effect it would be much apperciated. thanks.\r\n\r\nas far as permissions go:\r\nmodify it as you see fit for personal use if you re-upload it with any of your personal tweaks credit me for base idea, post anywhere you see fit as long as i\\'m credited, and use in your own shit as long s i\\'m credited ",
  "categoryId": "34",
  "version": "1.0",
  "author": "wolfpack91",
  "createdUnix": "1353736016",
  "updatedUnix": "1353808966",
  "containsAdultContent": false,
  "uploadedBy": "wolfpack91",
  "primaryFile": null,
  "files": [
    {
      "fileId": "101328",
      "name": "Demon Nord",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "Demon Nord-27341-1-0.zip",
      "uploadedUnix": "1353736348",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/db38ec2861c2db01fda73afcd391dc80833d2c6f99640ac01501bc87a5742406/analysis/1407275287/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Demon%20Nord-27341-1-0.zip?fid=101328&ttl=1535799990&ri=8192&rs=8192&setec=b16421623bebc5403874877515331d71"
    },
    {
      "fileId": "101498",
      "name": "demon nord",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "demon nord-27341-1-2.zip",
      "uploadedUnix": "1353808966",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/3023608484ca4bc73cf10caeb20315561b5497323759ac64f62dcdafa6ec7273/analysis/1407276800/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/demon%20nord-27341-1-2.zip?fid=101498&ttl=1535799990&ri=8192&rs=8192&setec=8d1c1a2b845b2ddec89e4aefe9d00e96"
    }
  ]
}