{
  "modId": 27342.0,
  "modName": "Lunar Armor",
  "summary": "Requires Dawnguard.  Armor set which has various effects while the moons are out.",
  "descriptionHtml": "Requires Dawnguard as it uses Ivory Armor textures.\r\n\r\nThis is my first mod, it adds a set of armor that will cause a variety of enchantments to happen while the moons are out.  I added no scripts, all armor effects were added using whatever the creation kit has to deliver already.  Some of the effects you will see:\r\n\r\n- Increased sprinting speed with boots equipped.\r\n- Cloaking effect while blocking with shield\r\n- Cloaking effect while blocking with a 2 handed weapon if gauntlets are equipped\r\n- Increased stamina regen if standing still while wearing boots\r\n- Increased health regeneration rate while standing still wearing cuirass\r\n- Various hidden enchantments that only happen in special circumstances\r\n\r\n\r\nThe enchantments do not work in most dungeouns, and indoor areas, as the moon is not shining upon them.\r\n\r\nThe chest containing the armor is in Septimus Signus Outpost.\r\nThe items are:\r\n\r\nLunar Crown\r\nLunar Cuirass\r\nLunar Gauntlets\r\nLunar Boots\r\nSecunda\\'s Glow\r\n\r\nI added the ability to change Lunar armor into Masser armor at any forge under the misc. section.\r\nIt\\'s possible to use it as an exploit at the moment to increase smithing, I\\'m not sure how to remove that yet.\r\n\r\nI\\'m also having trouble getting the speed boost with the boots to activate right away, as it is you need to sprint, then let go of and re-hit the sprint button to get your character to run faster.\r\n\r\nIf you want to checkout the items quickly you can type\r\n\r\n\\\"help (item name)\\\" into the console.  Fo example, \\\"help secunda\\\" should cause the shield \\\"Secunda\\'s Glow\\\" to show up, along with a string of digits alongside it.\r\nThe next step is to type \\\"player.additem ######### 1\\\" and place the ID that was next to the shield into the ##### area, the 1 just means add one of them to your inventory.\r\nYou can also type in \\\"coc septimussignusoutpost\\\" and you will teleport there immediately.\r\n\r\nI\\'ve also added a shout called \\\"Secunda\\'s Grasp\\\", however it is in testing stage but you can add it to your player with \\\"player.addshout ######\\\" with the ##### signs being the ID you will retrieve from typing \\\"help secunda\\\" and looking for Secunda\\'s Grasp ID #.\r\n\r\nInstall by extracting the ESP file into skyrim/data, if you downloaded a previous version it should just copy right over it with no problems, although you may have to re-equip the items to make them work properly.\r\n\r\nI have really big plans for modding with the Lunar Theme, I\\'m actually just getting started and learning slowly so check back every so often.\r\n\r\nThanks and please leave a comment if there is trouble, or if you encounter a bug, as I\\'m still learning :)  ",
  "categoryId": "54",
  "version": "0.02",
  "author": "Dirtfoot84",
  "createdUnix": "1353736920",
  "updatedUnix": "1353736920",
  "containsAdultContent": false,
  "uploadedBy": "dirtfoot84",
  "primaryFile": null,
  "files": []
}