{
  "modId": 27367.0,
  "modName": "Become Overlord",
  "summary": "",
  "descriptionHtml": "Requires Dawnguard!\r\n\r\nfirst i need to thank \r\n\r\nLiliths Obliterator - Custom Battleaxes, Waraxes and Maces 3.0\r\n\r\nOverlord Armor & Dungeon boss\r\n\r\nfor the awesome meshes on the armor and weapon\r\ni think i did a totaly good job with this mod\r\n\r\nWARNING! if you got previus versions it could be that the game will crash on load PLZ deinstall my mod make a save without my mod and install again = will work\r\n\r\nAbout the mod:\r\n\r\nIn whiterun on the grey mane house  (what will be destroyed later, first house left side from marked) is a  new door that leads into a small room with an surprise i bet you will not survive it =)\r\nbut if you manage you will get the armor the weapon and 2 spell tomes\r\nthe spell tomes allow you to summon up to 20 goblins!\r\nthey follow you in a little crowd (somethimes they need a bit to follow because of custom ai packages)\r\nive added male goblins that use mele weapons dualwielded and female goblins that use bows\r\nthe second spell tome allows you to kill them when you point at them (spells where alot of work)\r\n\r\nUpdate!!\r\nNewspelltome send Goblins Makes them search for armor and weapons and pick up the best choice and drop the old/bader ones\r\nUpdate!!\r\nwhen goblins die they give theyr inventory to the player and starting with nothing\r\nUpdate!!\r\nadded now a completly new spell tome that contains all spells can be found on the table in the room\r\nadded now different spells for different goblins\r\nadd healer and mage goblins\r\nUpdate!!!\r\nFixed death goblins teleport\r\nFixed main gate teleport problems!!\r\nBig update!!\r\nI changed the way they spawn now there are 80 unique goblins (was needet to let them keep stuff when teleport LOTS OF WORK thanks to Black RL)\r\nlots of bug fixing i only know 1 existing bug somethimes it can happen that when they drop items they can drop tru the ground but happens realy not often\r\n\r\nif you see any bug plz tell me!!\r\n\r\nIf you like endorse =)\r\n\r\n\r\n\r\nRealy much thanks For the Teleport to playerscript when reach distance and the help for the pick up script To Black RL Realy love what you did",
  "categoryId": "66",
  "version": "4",
  "author": "AluCard",
  "createdUnix": "1353782256",
  "updatedUnix": "1354489300",
  "containsAdultContent": false,
  "uploadedBy": "Silencedoom",
  "primaryFile": null,
  "files": [
    {
      "fileId": "102844",
      "name": "newestversion",
      "version": "5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "60259",
      "fileName": "newestversion-27367-5.zip",
      "uploadedUnix": "1354489300",
      "modVersion": "5",
      "virusScanUrl": "https://www.virustotal.com/file/2cee1ca6f0e6af3374450049207b6a93965817147df467421c0a44caaf29d1ec/analysis/1407289172/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/newestversion-27367-5.zip?fid=102844&ttl=1535800044&ri=8192&rs=8192&setec=5ed9ddf4c8ec4e1bad1d2002d0452519"
    }
  ]
}