{
  "modId": 27378.0,
  "modName": "Stormcloak Robes",
  "summary": "Ever wish you could immolate fools while rocking your Stormcloak colours? This mod adds new robes in cool Stormcloak blue.",
  "descriptionHtml": "[img=center]http://static.skyrim.nexusmods.com/mods/images/27378-4-1353799518.jpg[/img][line]\r\n\r\n[size=4][i]Gone are the days when you had to choose between wearing mage gear and representin\\' your crew. Secede in style with these new Stormcloak-themed Robes.[/size][/i]\r\n\r\n[size=8]~[/size]\r\n\r\n[size=5][b]INTRODUCTION[/b][/size]\r\n\r\nThis is the frequently asked-for sequel to my Imperial Legion Robes mod, and its way better. My previous mod was a hit on the Workshop but a total flop here. Hope it works out better this time.\r\n\r\nI hope you all agree that my skills have improved since last time. I would really like to hear what you think: What could I improve in this mod? What should I think about for my next mod? I prefer everything I do to be a learning experience, and since many of you guys are a lot more experienced with modding than I am, you could be a great help.\r\n\r\n[size=5][b]FEATURES[/b][/size]\r\n\r\nThis mod adds six new garments to them game:\r\n\r\n- The [b]Stormcloak Volunteer Robes[/b] and [b]Stormcloak Volunteer Hood[/b], which are based on the Novice Robes and hood from the main game and have identical stats to those, plus a 30% bonus to stamina regen on the robes, which will help with both the hitting and the running.\r\n\r\n- The [b]Stormcloak Sage Robes[/b], which come in five exciting flavours; one for each school of magic. Their stats are the same as \\'Expert Robes of [Magic School]\\', with the above discussed 30% Stamina regen bonus. There is also an unenchanted version called \\'Rebel Robes.\\'\r\n\r\n- The [b]Stormcloak Ivory Boots[/b] and [b]Stormcloak Ivory Bracers[/b], which are merely cloth versions of the Stormcloak Officer Boots and Bracers for those who use the \\'Mage Armor\\' perk.\r\n\r\n- The [b]Stormcloak Seeker Shawl[/b], which is the equivalent of the \\'Imperial Battlemage Hood\\' from my Imperial Legion Robes mod. It is intended to be worn with armor and gives a 40% bonus to magicka regeneration. There is also an unenchanted version called \\'Rebel Shawl.\\'\r\n\r\nAll of it can be bought from Oengul War-Anvil, castle blacksmith of Windhelm, or from any of the Quartermasters in the Stormcloak war camps across Skyrim. However, just like the Expert Robes from the vanilla game, [b]the Stormcloak Sage Robes and Stormcloak Seeker Shawl can only be purchased after your character reaches level 24[/b].\r\n\r\nUnlike my previous mod, these textures are primarily \\\"hand drawn\\\", with only some minor details recoloured. Textures were taken from free texture sites and copy-pasted from the Stormcloak Armor and Stormcloak Officer armor to make sure the robes have a similar feel. The design of the Volunteer Robes is based on the Stormcloak Cuirass and the design of the Sage Robes is based on the the Stormcloak Officer Armor.\r\n\r\nThe mod includes no meshes, so it should be compatible with any body- or clothing replacer you might use.\r\n\r\n[size=5][b]TREASURE HUNT[/b][/size]\r\n\r\nIntroduced in version 1.1 of the mod is a new version of the Volunteer Robes with unique stats and a unique texture. I hid it in a place that seemed suitable from a lore standpoint. Here are the clues:\r\n\r\n[list]\r\n[*]They belonged to a Stormcloak who was killed sometime before the beginning of the game.\r\n[*]They are hidden in an end table in her room in her family home.\r\n[/list]\r\nIf you have been chatty with Skyrim\\'s populace you might know who the Stormcloak in question is. If you don\\'t know who it is, some detective work is in order. Happy hunting!\r\n\r\n[size=5][b]CHANGE LOG[/b][/size]\r\n\r\n[b]Version 1.1[/b] - December 2, 2012 [list]\r\n[*]Added the treasure hunt (see above.)\r\n[*]Added an unenchanted version of the Seeker Shawl, called \\'Rebel Shawl\\' for sale from Oengul (I forgot to add it to the Quartermasters, sorry.)\r\n[*]Updated the normal maps on the Sage Robes. The fur should look a bit more 3D now. As an unfortuante side effect, the female ground model looks a bit funky, but it looks great when worn.\r\n[/list]\r\n[size=5][b]VIDEOS[/b][/size]\r\n\r\nBrodual kindly spotlighted my mod; check out their video.\r\n\r\n[youtube]_weEyM4nWUE[/youtube]\r\n\r\nLiveStyle Gaming reviewed my mod as part of their Mod of the Day series:\r\n\r\n[youtube]HtKrB0drmZQ[/youtube]\r\n\r\n[size=5][b]MANUAL INSTALLATION[/b][/size]\r\n\r\nThis mod should be fully compatible with the Nexus Mod Manager, but it is just as easy to install manually:\r\n[list=1]\r\n    [*] Open \\'StormcloakRobes.rar\\' and extract the contents (the \\'Data\\' folder containing \\'stormcloakrobes.esp\\' and \\'stormcloakrobes.bsa\\') into your skyrim game folder (It is usually at \\'C:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\\\'.)\r\n\r\n    [*] Open the Skyrim launcher, click \\'Data Files\\' and check \\'stormcloakrobes.esp\\' in the list. (Sometimes you have to wait a while while Steam updates any subscribed mods you might have.)\r\n\r\n    [*] This should be it. Put a [url=http://www.youtube.com/watch?v=a8Uzikag7Xo]cool groove[/url] on the grill and take a break; if anyone\\'s earned it it\\'s you.[/list]\r\n\r\n[size=5][b]FAQ[/b][/size]\r\n\r\nQ:Will you make an Imperial version of this?\r\nA: I did; the [url=http://skyrim.nexusmods.com/mods/25882]Imperial Legion Robes mod[/url] was actually my first mod.\r\n\r\n[size=5][b]KNOWN ISSUES[/b][/size]\r\n\r\n[list]\r\n[*] Texture problems with the hoods on Argonians and Khajiit. The hoods do work, but they show the regular mage hood texture. I haven\\'t figured out how to do proper beast race support yet; hopefully I\\'ll crack it.\r\n[*] The Rebel Shawl is not for sale from the Stormcloak quartermasters.\r\n[/list]\r\n[size=5][b]TRANSLATIONS[/b][/size]\r\n\r\n[list]\r\n[*][url=http://modgames.net/load/249-1-0-14710]RUSSIAN[/url] - A Russian language version is available from Russian site [url=http://modgames.net/load/249-1-0-14710]modgames.net[/url][/list]\r\n[size=5][b]THANKS[/b][/size]\r\n\r\n[list]\r\n[*]Brodual and JayFriezah for their videos; very flattering.\r\n[*]Aspard for his Russian translation[/list]\r\n[size=8]~[/size]\r\nYou can also subscribe to this mod on the [url=http://steamcommunity.com/sharedfiles/filedetails/?id=109941882]Steam Workshop[/url]\r\n\r\nOnce again, please shoot me a comment if you like it. And some screenshots would be nice too.\r\n\r\nTalos guide you,\r\nGustav",
  "categoryId": "60",
  "version": "1.1",
  "author": "Gustav Lundgren",
  "createdUnix": "1353797976",
  "updatedUnix": "1354468627",
  "containsAdultContent": false,
  "uploadedBy": "GustavL",
  "primaryFile": null,
  "files": [
    {
      "fileId": "101466",
      "name": "Stormcloak Robes 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6040",
      "fileName": "Stormcloak Robes 1_0-27378-1-0.rar",
      "uploadedUnix": "1353798096",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/00c9b97e14eb59b8200469ec730660dfe6febdfe433656d39feb65ab2ef563ee/analysis/1407276547/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stormcloak%20Robes%201_0-27378-1-0.rar?fid=101466&ttl=1535800063&ri=8192&rs=8192&setec=64c47950fb12149aff8d4760c3355271"
    },
    {
      "fileId": "102791",
      "name": "Stormcloak Robes 1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9419",
      "fileName": "Stormcloak Robes 1_1-27378-1-1.rar",
      "uploadedUnix": "1354468627",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7824fdb46daf13a52f6d8ae9dc1e8c8378497833b97d83213335000d3c231d9e/analysis/1407288727/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stormcloak%20Robes%201_1-27378-1-1.rar?fid=102791&ttl=1535800064&ri=8192&rs=8192&setec=2d6ee4f5bb02b77aa16a8b9236a67a0f"
    }
  ]
}