{
  "modId": 27386.0,
  "modName": "Mini-Museo",
  "summary": "Esta no es una casa con un salon para poner tus armas, ¡no&#33;, Este es un salón para exhibir tus armas, armaduras y trofeos, es como un mini-museo cerca de Whiterun.",
  "descriptionHtml": "[color=gold][b]Descripción:[/b][/color]\r<br />\r<br /> Este mini_museo Cuenta con: \r<br />\r<br />-16 Maniquíes, para colocar tus preciadas armaduras y mostrarlas a los nietos decirles Y; [i]&#34;con armadura this Derrote una ESE oso gigante de la cueva-Pero abuelo ESA Se La comió el oso- ¡ah si&#33; Pero Esta es igual &#34;[/i] . \r<br />\r<br />-10 Placas para exhibir armas en Las Paredes, Así te daras Cuenta si te Llega un Alguna faltar en solitario con echar una mirada al rededor, Tal Vez no des con el ladron Pero Te daras prisa en llenar el hueco. \r<br />\r<br />-6 Placas párrafo Armas doble-Mano con Soporte para escudos. Ahí Donde Deben Estar Para Que La Pareja no tomo tu arma para Cortar las zanahorias para La Cena. \r<br />\r<br />-8 Exhibidores de madera con cristal con Soporte para armas y 2 párrafo busque dagas para mantener resguardadas Las armas mágicas (SI ASI gustas), Asi los pequeños y manos traviesas sin us las párr hechizar un ingenuo Cuanto se les cruce en el Camino.   \r<br />\r<br />-11 Estantes para colocar tus trofeos, Tesoros y Otras cosillas Que Hayas acquired en tus Viajes. Recuerda con orgullo el Pichel con El que bebiste cerveza con el Jarl de Whiterun Y Que hay un PASE ONU Ser artilugio mas de la cocina con el Que le daran un beber agua ala mascota. \r<br />\r<br />-8 Libreros para mas de 400 libros, párr Que Un Día en El Que no salgas de aventura Tengas un buen libro a la mano Y Que también tengas de Donde escoger. \r<br />\r<br />Este mini-museo también Cuenta con una segunda planta en la que se encuentran los Libreros y 2 alcobas, la Contiene Primera 2 camas párrafo Tus Seguidores y la Segunda para ti con puerta para no Ser molestado. \r<br />\r<br />Muy Diferencia de una de otras casas de mods this no hay Plantas Tiene nI, ni platos, cucharas Tazas de nI, nI, nI frutas; A l entrar sin Encontraras La Cena cérvida de alguien mas, ni sentiras Que mataste al pobre vendedor de legumbres tan solo para Pasar La Noche Despues de que te correteo el dragón, Este mini-museo ningún Tiene AEE Cosas salva de las Naciones Unidas par de mesas, de las Naciones Unidas el par de sillas, de las Naciones Unidas par de barriles, la olla para cocinar y Un cofre TODO nuevo ya Diferencia de AEE Cosas tu tendras Que adornarla como quieras. \r<br />\r<br />TAMPOCO Encontraras mesa de alquimia, ni fragua de herrero ya Que como esta relatively cerca de Whiterum mejor IR Hacia Ahí para forjar tus armas y armaduras, tambien es un buen pretexto para salir a caminar y sin Estar encerrados TODO EL TIEMPO. \r<br />\r<br />es con compatibles Hearthfires y Dawunguard Aunque no hijo Necesarios párr Que El funcione mod. \r<br />\r<br />de antemano ¡Gracias a [u]supernastypants[/u] por Su &#34;Inicio edificable de recursos y Tutorial&#34; para colocarlo en mi Poder mod ya [color=cyan]Zuna Stormcloak[/color] por Las clases divertidas. \r<br />\r<br />favor por, háganme Notar los Fallos si los hubiese párr arreglarlos Poder. gracias.",
  "categoryId": "67",
  "version": "v.1.0",
  "author": "Richeliu2012",
  "createdUnix": "1353805336",
  "updatedUnix": "1353805522",
  "containsAdultContent": false,
  "uploadedBy": "Richeliu2012",
  "primaryFile": null,
  "files": [
    {
      "fileId": "101486",
      "name": "Mini Museo",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25",
      "fileName": "Mini Museo-27386-1-0.rar",
      "uploadedUnix": "1353805522",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/96cd5c968f70d329fffd49e8552c29662aeb7f2ef9e76f30a093596155524121/analysis/1407276724/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mini%20Museo-27386-1-0.rar?fid=101486&ttl=1535800075&ri=8192&rs=8192&setec=fdadd29e8c34cb89dafe154babafafe1"
    }
  ]
}