{
  "modId": 27387.0,
  "modName": "Sharingan Powers",
  "summary": "Adds Sharingan abilities into Skyrim&#33;  Now with Sharingan, Amaterasu, Susanoo, Tsukoyomi, Kamui, Kamui(Warp), Kamui(Teleport), and Kotoamatsukami.",
  "descriptionHtml": "AS OF VERSION 2.0, DRAGONBORN DLC IS NOW REQUIRED FOR THIS MOD TO WORK. WHEN UPGRADING TO VERSION 2.0 FROM A PREVIOUS VERSION, MAKE SURE YOU FOLLOW THE DIRECTIONS AS IF YOU WERE ADDING THE ABILITIES FOR THE FIRST TIME. As suggested, this mod will add new abilities to Skyrim. Fans of the Naruto series will definitely recognize these abilities. All abilities can be added by going to Mzulft. Shortly into Mzulft, there is a door tucked into a corner on your right, at the top of a ramp. Entering the door should bring you into a small room with a dwemer button. Press this button to gain access to all abilities. When testing, it was sometimes necessary to press the button 3 or 4 times before the abilities were added. Currently, the mod adds: \r<br />\r<br />\r<br />Sharingan – Basic ability of this MOD: consists of Night Vision, Detect Life, and a subtle slow time effect. If playing without the Eternal Mangekyou Sharingan turned on, using mangekyou abilities (Amaterasu, Tsukoyomi, Susanoo, etc) will cause the effectiveness of this ability to diminish over time. First, the slow time effect will disappear, which probably won’t be very noticeable. Next, the Night Vision will no longer function. And finally, there will be a vision blurring effect for as long as sharingan is enabled. For those who don’t wish to use the Eternal Mangekyou, toggling the switch on and then back off will reset the sharingan to its basic function. While this ability is active, the player will lose 20 Magicka and Stamina per second. Cast ability again while active to disable it. \r<br />\r<br />\r<br />Amaterasu – Lesser power that engulfs the target in black flames which burn until only ash is left, causing them to panic and flee like a little girl as they burn. Without Eternal Mangekyou Sharingan active, each use will cause a temporary vision blur as well as degrade the effectiveness of the basic sharingan spell. This ability will cost half of the player’s maximum Magicka and Stamina to cast. \r<br />\r<br />\r<br />Tsukoyomi – Lesser power which will instantly paralyze the target for 10 seconds. There is no way to resist paralysis, however targets marked as immune to paralysis still won’t be affected. During the paralysis, the enemy will lose 30 points of magicka and stamina each second. Without Eternal Mangekyou Sharingan active, each use will cause a temporary vision blur as well as degrade the effectiveness of the basic sharingan spell. This ability will cost half of the player’s maximum Magicka and Stamina to cast. \r<br />\r<br />\r<br />\r<br />Susanoo – Lesser power that surrounds the caster with a ribcage engulfed by purple flames, protecting them from all damage until disabled. Caster is unable to move or attack while surrounded by this effect. Without Eternal Mangekyou Sharingan active, each use will cause a temporary vision blur as well as degrade the effectiveness of the basic sharingan spell. While this ability is active, the player will lose 10 Magicka and Stamina per second but will also heal by that amount each second. Cast ability again while active to disable it.\r<br />\r<br />Kamui – This ability will make the caster incorporeal for 5 seconds, causing any attacks against the caster to pass straight through without causing damage. The caster can attack while this ability is active, but it will cause this ability to end immediately. Without Eternal Mangekyou Sharingan active, each use will cause a temporary vision blur as well as degrade the effectiveness of the basic sharingan spell. This spell will cost 20% of the player’s maximum Magicka and Stamina to cast. \r<br />\r<br />\r<br />Kamui(Warp) –When casting this ability on an enemy, you will receive a menu prompting where to send the enemy. You will have the choice of putting them in 1 of 4 containment cells, or sending them into the void. Putting them into a cell will result in their being accessible via the Dungeons within the Jikukan home area, however sending them into the void will cause them to be gone forever. This ability cannot be used against Dragons, Mammoths, and Giants. Without Eternal Mangekyou Sharingan active, each use will cause a temporary vision blur as well as degrade the effectiveness of the basic sharingan spell. It will cost half of the player’s maximum Magicka and Stamina to cast this spell. \r<br />\r<br />\r<br />Kamui(Teleport) – Teleports the player to a fully usable home, complete with a housekeeper/merchant, all crafting stations, extensive storage, weapon/armor displays, vault, dungeon access, dragon priest mask racks, and black book displays. Home also includes a central teleport pad and buttons to set teleport destinations; all cities and each faction from Dawnguard DLC are available for teleport. Since Dawnguard isn’t required for this MOD, faction teleport destinations are approximated as closely as possible to grant access to each. Fast travelling from the home is available, so any map markers found throughout Tamriel should be accessible as well. Home is fully navmeshed for NPC use, however the only NPC able to access these areas is the housekeeper since the teleport ability is the only way into this cell. Also, in addition to the standard home decorations, there is a special teleport pad on the upper level. Using the upper pad will enable you to reach a special area where you can upgrade one of your Sharingan Powers (you will also need three special keys hidden throughout the player home to access the power upgrade area), or enable/disable the Eternal Mangekyou Sharingan. You will need 4 Centurion Dynamo cores for each time you want to access the upgrade area. If you use the teleport ability while in any of the home areas, you will immediately be returned to wherever you were standing when you teleported into the player home. \r<br />All of the spells have a sharingan activation sound from the series when they hit the target, although it’s not a high quality one. For the spells that toggle on and off when used, toggling off the spell will cause the standard sharingan ending sound to play. \r<br />\r<br />\r<br />Kotoamatsukami – Puts the target under a genjutsu illusion, turning them into an unwitting follower that will assist you in combat. Due to differences in their brain chemistry: Giants, Mammoths, Dragons, and Dragonborn (cough...Miraak) are unaffected by this spell. Casting this on a target that is already under its effect will allow you to either release them, or to toggle their Follow/Wait here options. You may only have this spell active on one NPC at a time. Casting it on a different NPC will cause the first follower to return to their original location in the game, and will cause the new NPC to follow you instead. \r<br />\r<br />\r<br />\r<br />\r<br />Future Plans for this MOD\r<br />\r<br />\r<br />None. Sadly, I’ve shifted interests from modding Skyrim and have moved onto other games. I’d originally planned to re-release this MOD with a fully function dwemer city and questline, however I’ve abandoned those ideas. Short of fixing any bugs not listed in the “Known Bugs” section, I will no longer make changes to this MOD. If anyone would like to take over future development of this MOD, simply ask me. Most of the dwemer city is actually built already, although it’s lacking NPCs and there is no way into it without using the console. \r<br />\r<br />\r<br />\r<br />Change Log\r<br />\r<br /> \r<br />\r<br />Version 2.4– 3-4-14\r<br />Fixed the Susanoo transparency issue.  Mesh is now semi-transparent in game, as intended.\r<br />Eye texture optimizations.  File size drastically reduced.  Should also address the long-running issue where the eye textures would stop showing up until ShowRaceMenu was used to reset them.\r<br />Sharingan eyes now glow in game&#33;  Should be noticeable, especially in dark areas or if you use a dark ENB preset.\r<br />\r<br /> \r<br />\r<br />Version 2.31– 2-18-14\r<br />Susanoo has an actual model now&#33; It&#39;s not just a blob of black flames that appear around the player anymore. Unfortunately, this means you will no longer be free to move around and attack the enemies while susanoo is active. If you&#39;re using the upgraded version, the summoned allies will take care of the fighting for you.\r<br />Fixed the issue with the upgrade room not animating properly.\r<br />Fixed misspelling of Tsukuyomi.\r<br />\r<br />Version 2.2 - 11-18-13\r<br />Kotoamatsukami is back&#33; It works exactly as intended now, and I&#39;m not able to find any bugs with it&#39;s functionality. Let me know if you happen across any issues with it.\r<br />Split upgrade menu into multiple parts to make it more screen-size friendly.\r<br />Enabled fast travel from all parts of Jikukan player home, not just the main area.\r<br />Bug fix to stop Skyrim weather from changing to Sovngarde sky after fast travelling from the Jikukan player home.\r<br />Changed so there can only be 10 Amaterasu ground flames in existence at a time, in order to prevent computer overload/game crashes when cast onto groups of enemies. After hitting the limit of 10 ground flames, the game will begin deleting the oldest ground flames one-by-one, in order to maintain the limit of 10 at all times.\r<br />\r<br />Version 2.11 – 10-9-13 \r<br />Bug fix release to fix accidental omission of Upgrade room script from version 2.1. You should be able to use the upgrade room again, sorry guys. \r<br />\r<br />\r<br />Version 2.1 – 10-9-13 \r<br />Bug fix release to fix the issue with Kagrenac guards following the player everywhere. Also, fixes the issue where Amaterasu flames get stuck on player when using the upgrade room for Amaterasu or Susanoo. \r<br />Added the ability to COC into the room with the button to add the Sharingan abilities. Open the console and type “COC SharinganPowerRoom” without the quotes to be taken directly to the sharingan power room. It’s a good idea to either teleport or COC out of the room once you’ve gotten the powers, especially while low level and/or before completing the mages guild quest that takes you into Mzulft. \r<br />\r<br />\r<br />Version 2.0 – 8-28-13 \r<br />Major overhaul of the spells. Some function similar to how they were originally, but upgraded tiers of each have been added. Each spell, except Kamui Teleport, now has a large cost associated with it to further balance the abilities. \r<br />Kamui added. This is the ability that the masked man uses in the series to allow attacks to pass through without hurting him. Both a base and upgraded tier will be available. \r<br />Kagrenac, a dwemer city named after a former chief tonal architect, has been added. It is inaccessible to the player due to its incomplete state, however I thought it worth mentioning and leaving in the MOD in case anyone else decides to take over further development. \r<br />\r<br />\r<br />Version 1.4 – 1-30-13 \r<br />Kotoamatsukami removed, at least for now. The original idea was to be able to use it on an enemy and make them into a follower while the effect was active, but after extensive research I’ve found this isn’t feasible. Please view the FAQS section for more info. \r<br />Sharingan eye textures added for all vanilla races. Available textures are: Basic sharingan, Itachi’s Mangekyou, Izuna’s Mangekyou, Kakashi’s Mangekyou, Madara’s Mangekyou (regular and eternal), Shisui Mangekyou, and Sasuke’s Mangekyou (regular and eternal). \r<br />Basic Sharingan spell now has a slight slow time effect. This is similar to the Mangekyou sharingan slow time effect, but to a much lesser extent. \r<br />Created perk named “Eternal Mangekyou Sharingan”, which will disable the vision damaging effect when added to the player. See the FAQS section for more info. \r<br />Created custom worldspace called “Jikukan Dungeons”. Enemies sent away by the Kamui(Warp) spell will now be placed in this dungeon. The player may then enter the dungeon and interact with the NPCs inside, although they will be just as hostile inside the dungeon was they were in the outside world. \r<br />Re-styled the Jikukan room into a more functional space. Added all crafting stations, a couple of mannequins, a general merchant, a player owned bed, and plenty of storage. The large return door has been moved to a different location, and a small door leading to the dungeons has been added. \r<br />\r<br />Version 1.3 – 12-14-12 \r<br />Bug fix to correct omission from version 1.2 which caused the Kamui spells not to work properly.Thanks to WeeGee097 for the helpful video that pointed out this issue. It made fixing the problem much easier. \r<br />\r<br />Version 1.2 – 12-6-12 \r<br />Created two additional powers: Kamui(Warp) and Kamui(Teleport) \r<br />Created custom room as teleport destination for Kamui(Teleport) spell. \r<br />\r<br />Version 1.1 - 11-25-12 \r<br />Created two additional powers: Susanoo and Kotoamatsukami. \r<br />Split Sharingan into two powers: Sharingan and Mangekyou Sharingan. Both had same effect, except Mangekyou added a slow time effect. \r<br />Changed Amaterasu flame effect slightly. It now burns longer. As the ash pile materializes, the black flames start to vanish, to better give the appearance that it actually burned the target to ash. \r<br />Changed Tsukoyomi to drain stamina and magicka instead of dealing direct damage. Tsukoyomi on the show was a genjutsu, which were never intended to be directly fatal. \r<br />Changed all powers to be lesser powers, meaning they can be cast multiple times in a day. \r<br />Created two versions of the MOD: one which includes a vision blurring effect as the Amaterasu, Tsukoyomi, Susanoo, and Kotoamatsukami spells are cast; and another which excludes the vision blurring effect. Damage and effects are otherwise identical between the two versions. \r<br />\r<br />Version 1.0 - 11-24-12 \r<br />Uploaded the MOD on Nexus. Included three powers: Sharingan, Amaterasu, and Tsukoyomi. \r<br />\r<br />Any feedback is welcome. Whether it’s to compliment the spell effects, or even if it’s just to tell me how I messed something up with one of the abilities. If you want to request a specific spell be added, just let me know which one. I can’t promise I’ll definitely be able to do it, but I’ll try my best to accommodate. \r<br />\r<br />\r<br />\r<br />\r<br />Known Bugs\r<br />\r<br />\r<br />When casting Susanoo, it&#39;s possible you may still be affected by knockback effects. This can cause you to be pushed out of the susanoo animation. Simply turn it off and back on again to make it appear around you. \r<br />\r<br />Standing in puddles of fire/ice/etc. with Susanoo active still hurts you. DO NOT stand in fire. I&#39;m not fixing this. You deserve it for standing in fire&#33;\r<br />\r<br />If you travel into another area while one of the toggle spells are active, it will cancel the spell. This is part of the game engine and perfectly normal. However, when you cast the ability again to enable it, it will behave as though it’s already active. After the first cast, though, it will sync itself back up and function normally again. \r<br />\r<br />If you cast Amaterasu onto an enemy and they flee into another area through a load door, it will cancel the Amaterasu effect on them. They will immediately come back to fight you again. Since the game engine removes active magic effects when travelling between cells, there is nothing that can be done to fix this. However, using the upgraded Amaterasu will cause them to almost always get the effect back when they re-enter the area, since it will usually drop a ground flame on their exit/entry point.\r<br />\r<br />When I tested using the upgrade room to upgrade Kotoamatsukami, I kept getting a CTD. I was able to get around this by starting a new game, so I think it&#39;s something saved into existing savegames that used this MOD before Kotoamatsukami was added. You can either start a new save, or open the console and type Set UchihaUpgradedPower to 43. This will set Kotoamatsukami as upgraded without needing to use the upgrade room, thus avoiding the CTD issue. All other spells are confirmed upgradable without a new save/console command.\r<br />\r<br />Kotoamatsukami(PLEASE READ)- Not all NPCs in Skyrim are designed for combat. The spell will tweak their settings to prevent them from fleeing as soon as the fight starts, but that doesn&#39;t necessarily make them useful in a fight. Some NPCs are simply too weak to be effective in a fight. Also, since this spell actually creates a copy of the original NPC, it&#39;s possible the copy may not be exactly the same as the original. For example, when used on a bandit/stormcloak/imperial NPC, the copy may be a different gender, have a slightly different appearance, or possibly even have a very different fighting style than the original. Also, trolls, bears, ice wraiths, and wolves all seem to spawn from the same basic creature, so casting this spell on one type may actually result in you getting a follower of a different kind. The only way around this would be to not create the copy, and have the original NPC follow you instead. This is entirely possible, but not a useful option since it could break the game by altering NPCs default settings.\r<br />\r<br />\r<br />\r<br />\r<br />FAQS\r<br />\r<br /> \r<br />\r<br />Why don’t Khajiit and Argonian have glowing eyes?\r<br />Because I hate cats and lizards&#33;  But seriously, the vanilla  Skyrim eye meshes don’t support glow effects, despite the CK giving the option to add them.  By looking at what was done in a separate glowing eyes mod, I was able to figure out how to make them for other races.  No luck with Argonian/Khajiit though.\r<br />\r<br /> \r<br />\r<br />What if I don’t want glowing eyes?\r<br />Use MOD version 2.31.  It was the last version I released before putting in the glowing eyes.  Or you could use version 2.4 and just play as an Argonian or Khajiit.\r<br />\r<br />\r<br />Will susanoo be changed to allow movement in the future?\r<br />Possibly, but unlikely. This spell has always been a bit OP, and I think this balances it quite nicely. Also, my ability to create custom meshes is extremely limited. Allowing movement would require me to be able to attach the entire mesh onto the player so it would move with them. That&#39;s something that I&#39;ve been entirely unable to do until this point. Given the limited time I&#39;m devoting to modding, it&#39;s unlikely I&#39;ll suddenly be able to do it.\r<br />\r<br />How do I upgrade one of my sharingan abilities?\r<br />First, complete my hide and seek challenge to find all three keys that unlock the upgrade room. Use the upper teleport pad (the one that requires 4 dynamo cores to use) to teleport to the upgrade room. Place each key in its appropriate pedestal, then use the dwemer button to gain access to the upgrade tome. Use the upgrade tome to select which ability to upgrade. It will tell you what each upgrade will do and ask for confirmation if you click on them. There’s also an option to revert all powers to default, in case you don’t like any of the upgrades. \r<br />\r<br />Where are the keys to upgrade sharingan abilities hidden? \r<br />Look around and find them. I didn’t make them particularly hard to find. I will say that they’re all hidden within the player home. There’s 1 in the main area, 1 in the dungeons, and 1 in the lower levels. Take your time and look for small cubes. \r<br />\r<br />Vision damage/Sharingan deterioration is on, and I don’t want it&#33; How do I turn it off? \r<br />To disable the vision damaging effect, use the upper level teleport pad in the player home. You will need to spend 4 Centurion Dynamo Cores in order to power the teleport pad and reach this area. When you arrive, turn right and flip the dwemer lever on the wall up. This will add the Eternal Mangekyou Sharingan, disabling the vision damage and basic sharingan deterioration. \r<br />\r<br />I’ve changed my mind because I don’t know what I want. How do I turn vision damage back on? \r<br />Follow the same procedure outlined above to remove vision damage, except flip the switch down instead. \r<br />\r<br />How do I quickly get access to all the Sharingan abilities?\r<br />Open the console and type COC SharinganPowerRoom. You&#39;ll be taken straight to the button which adds all the abilities. IMPORTANT: If you haven&#39;t completed the Mages guild quest that takes you into Mzulft, I&#39;d recommend using either fast travel or Kamui(Teleport) to exit the area after you get the abilities. Also, you can come back to this room at any point in order to add any new abilities I put into the MOD.\r<br />\r<br />\r<br />\r<br />Compatibility\r<br />\r<br />\r<br />You must have Skyrim patch 1.9.32.0.8 (latest patch) installed for this MOD to work properly, otherwise the spells won’t show up in game. Aside from that, the only potential incompatibility issue I could see would be a mod that happens to alter the same space at the top of the ramp in Mzulft. That’s unlikely to happen since I picked a kind of random spot to insert the door into the room. However, even if it did, the spells could still be added via the player.addspell console command. \r<br />\r<br />\r<br />\r<br />Permissions\r<br />\r<br />\r<br />Feel free to use part, or all, of the info from this MOD in any way you see fit, but please give me credit for anything you borrow. \r<br />\r<br />\r<br />\r<br />Credits\r<br />\r<br />\r<br />Bethesda: For an awesome game like Skyrim.\r<br />\r<br />Loris Cangini: For posting the 3D model of Sasuke&#39;s Susanoo online. I tweaked it quite a lot, but couldn&#39;t have gotten a finished product without this as a base to begin with. Check out the site at the following link: http://naruto3dmodels.blogspot.com/2013/05/sasukes-susanoo.html\r<br />\r<br />Hothtrooper44: For allowing me to use the Dwarven Mage armor from his awesome armors MOD. You can’t actually obtain the armor set from my MOD, even by killing the housekeeper via console. If you want to use it, go download his MOD from the following page:http://skyrim.nexusmods.com/mods/19733//?\r<br />\r<br />EnaiSiaion: For his Evil Twin spell, which inspired my redesigned version of Kotoamatsukami. Also, for including his source script in the BSA for his Apocalypse mod, so that I could see how he actually accomplished the cloning process from the Evil Twin spell. Apocalypse MOD link:http://skyrim.nexusmods.com/mods/16225/?\r<br />\r<br />Kurasa25: For showing me how to correct the Susanoo transparency issue.  He’s also created a separate version of the Susanoo spell which will allow movement.  Susanoo MOD link:  http://www.nexusmods.com/skyrim/mods/51575/?\r<br />\r<br />Dumle35: For his glowing eyes mod.  I was able to use it to figure out how to create glowing eyes with sharingan textures.  Glowing Eyes link: http://www.nexusmods.com/skyrim/mods/21232/? \r<br />\r<br />All the people using my MOD who contributed with idea on the comments page. I realize I didn’t use a lot of them, but they were all heard loud and clear. If nothing else, the ideas contributed did help me get the MOD to this point by challenging me to keep pushing further.",
  "categoryId": "75",
  "version": "2.4",
  "author": "Kpheonix57",
  "createdUnix": "1353805626",
  "updatedUnix": "1393961700",
  "containsAdultContent": false,
  "uploadedBy": "Kpheonix57",
  "primaryFile": null,
  "files": [
    {
      "fileId": "101488",
      "name": "Sharingan Powers",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "187",
      "fileName": "Sharingan Powers-27387-1-0.zip",
      "uploadedUnix": "1353805766",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f396e7cd321711cd7b44dcaae9caf83bd03db4e35afbd923df5d77addd2165bf/analysis/1407276725/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sharingan%20Powers-27387-1-0.zip?fid=101488&ttl=1535800077&ri=8192&rs=8192&setec=66f0643dee623b2d4d333a24266ef52e"
    },
    {
      "fileId": "101654",
      "name": "Sharingan Powers - With Vision Blur",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "199",
      "fileName": "Sharingan Powers - With Vision Blur-27387-1-1.zip",
      "uploadedUnix": "1353885377",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9a029bf9e65af2af5c66faa94148cb890c392e133b987e23ac6133b01d105289/analysis/1407278174/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sharingan%20Powers%20-%20With%20Vision%20Blur-27387-1-1.zip?fid=101654&ttl=1535800078&ri=8192&rs=8192&setec=8abc5963773d1f7550498373cae02339"
    },
    {
      "fileId": "101655",
      "name": "Sharingan Powers - Without Vision Blur",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "199",
      "fileName": "Sharingan Powers - Without Vision Blur-27387-1-1.zip",
      "uploadedUnix": "1353885503",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/162c87df10a6309ca3c7877fce7415fc6822a6169a4d5fbc35517189268a51bd/analysis/1407278174/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sharingan%20Powers%20-%20Without%20Vision%20Blur-27387-1-1.zip?fid=101655&ttl=1535800078&ri=8192&rs=8192&setec=72cfefbd008d048b63890b5c16134488"
    },
    {
      "fileId": "103591",
      "name": "Sharinan Powers - With Vision Blur",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "233",
      "fileName": "Sharinan Powers - With Vision Blur-27387-1-2.zip",
      "uploadedUnix": "1354853846",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/8b2e3e12ce4b8afd773969b23161aa765c6f7dcfd0828f8bef1844f3a2d79d72/analysis/1407293767/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sharinan%20Powers%20-%20With%20Vision%20Blur-27387-1-2.zip?fid=103591&ttl=1535800079&ri=8192&rs=8192&setec=f887fa2904a83785ff8a08b90ea383f3"
    },
    {
      "fileId": "103592",
      "name": "Sharingan Powers - Without Vision Blur",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "233",
      "fileName": "Sharingan Powers - Without Vision Blur-27387-1-2.zip",
      "uploadedUnix": "1354854005",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/e80a73627f38f47d644dea531d4db86b0b581663b110ad03b669041f03bbdb02/analysis/1407293769/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sharingan%20Powers%20-%20Without%20Vision%20Blur-27387-1-2.zip?fid=103592&ttl=1535800079&ri=8192&rs=8192&setec=e483ac5d6207e01b781287fcd6acb828"
    },
    {
      "fileId": "105222",
      "name": "Sharingan Powers - With Vision Damage",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "256",
      "fileName": "Sharingan Powers - With Vision Damage-27387-1-3.zip",
      "uploadedUnix": "1355529304",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/7ac1a0fbcf8ae31660a09633c37ade812c84f3e5755727fea441b7ea0e6cb642/analysis/1407304451/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sharingan%20Powers%20-%20With%20Vision%20Damage-27387-1-3.zip?fid=105222&ttl=1535800080&ri=8192&rs=8192&setec=7be63d35b08217163e15e98f7de17d32"
    },
    {
      "fileId": "105223",
      "name": "Sharingan Powers - Without Vision Damage",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "256",
      "fileName": "Sharingan Powers - Without Vision Damage-27387-1-3.zip",
      "uploadedUnix": "1355529364",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/266c9a3db8dd10be1ea868ed287890c24c31fd7cac534ab298cf5a036bb6f7ef/analysis/1407304452/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sharingan%20Powers%20-%20Without%20Vision%20Damage-27387-1-3.zip?fid=105223&ttl=1535800080&ri=8192&rs=8192&setec=dc74c266168a2cc9651b2130be175568"
    },
    {
      "fileId": "1000005934",
      "name": "Sharingan Powers - Standalone Combined Version",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11274",
      "fileName": "Sharingan Powers - Standalone Combined Version-27387-1-4.zip",
      "uploadedUnix": "1359564954",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/4e920b3b45bff00bf9af6241573a43492a3fd792ae06e2368386d7b649af959e/analysis/1407387609/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sharingan%20Powers%20-%20Standalone%20Combined%20Version-27387-1-4.zip?fid=1000005934&ttl=1535800081&ri=8192&rs=8192&setec=47423dca8d00a1404d2e4a97f63c12a8"
    },
    {
      "fileId": "1000006946",
      "name": "Sharingan Powers - Standalone Combined Version - No Upgraded Abilities - No Dragonborn DLC required - Basic Player Home",
      "version": "1.41",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11266",
      "fileName": "Sharingan Powers - Standalone Combined Version-27387-1-41.zip",
      "uploadedUnix": "1359949868",
      "modVersion": "1.41",
      "virusScanUrl": "https://www.virustotal.com/file/d6f67a156cb8eaeeceeb15545f49a03409fbe04e42d32613cc22d146f30cfcb2/analysis/1407396251/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sharingan%20Powers%20-%20Standalone%20Combined%20Version-27387-1-41.zip?fid=1000006946&ttl=1535800081&ri=8192&rs=8192&setec=f4d0970c9dcc4a9f4f5f9872a271c4a6"
    },
    {
      "fileId": "1000050533",
      "name": "Sharingan Powers - Dragonborn DLC version - Includes all things listed on main MOD page",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "15333",
      "fileName": "Sharingan Powers - Dragonborn DLC version - Includes all things listed on main MOD page-27387-2-0.zip",
      "uploadedUnix": "1377736391",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/7b6fa46d087bc2da5534432b0653e9c0ac18b48fad6dd407a2d24386b1ee2c19/analysis/1407700511/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sharingan%20Powers%20-%20Dragonborn%20DLC%20version%20-%20Includes%20all%20things%20listed%20on%20main%20MOD%20page-27387-2-0.zip?fid=1000050533&ttl=1535800082&ri=8192&rs=8192&setec=f6aab7c9c93e57155414a017cc3b2cf8"
    },
    {
      "fileId": "1000063888",
      "name": "Sharingan Powers - Dragonborn DLC version - Includes all things listed on main MOD page",
      "version": "2.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "26008",
      "fileName": "Sharingan Powers - Dragonborn DLC version - Includes all things listed on main MOD page-27387-2-1.zip",
      "uploadedUnix": "1381367677",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/bb7d5be65f0851d38e829b84d699a159d712937bf93d69af5b62ab637b6d04eb/analysis/1407750975/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sharingan%20Powers%20-%20Dragonborn%20DLC%20version%20-%20Includes%20all%20things%20listed%20on%20main%20MOD%20page-27387-2-1.zip?fid=1000063888&ttl=1535800082&ri=8192&rs=8192&setec=2292910a0876657907ab4aa0594c1396"
    },
    {
      "fileId": "1000069874",
      "name": "Sharingan Powers - Dragonborn DLC version - Includes all things listed on main MOD page",
      "version": "2.11",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14822",
      "fileName": "Sharingan Powers - Dragonborn DLC version - Includes all things listed on main MOD page-27387-2-11.zip",
      "uploadedUnix": "1382572337",
      "modVersion": "2.11",
      "virusScanUrl": "https://www.virustotal.com/file/9637fb780adac0b63cf21eb46ac0bf8de1b97574aed4c3f158fd26ed0bd38408/analysis/1407766654/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sharingan%20Powers%20-%20Dragonborn%20DLC%20version%20-%20Includes%20all%20things%20listed%20on%20main%20MOD%20page-27387-2-11.zip?fid=1000069874&ttl=1535800083&ri=8192&rs=8192&setec=40718844435a90952395e4fe16159049"
    },
    {
      "fileId": "1000080667",
      "name": "Sharingan Powers - Dragonborn DLC version - Includes all things listed on main MOD page",
      "version": "2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24740",
      "fileName": "Sharingan Powers - Dragonborn DLC version - Includes all things listed on main MOD page-27387-2-2.zip",
      "uploadedUnix": "1384833600",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/44c56498e55b291f100e7706a267ed889e5fd9c27e6f90feec186f78f6b55819/analysis/1407799036/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sharingan%20Powers%20-%20Dragonborn%20DLC%20version%20-%20Includes%20all%20things%20listed%20on%20main%20MOD%20page-27387-2-2.zip?fid=1000080667&ttl=1535800083&ri=8192&rs=8192&setec=3d1d5494b2b0eabfc436f68abb118234"
    },
    {
      "fileId": "1000097744",
      "name": "Sharingan Powers - Dragonborn DLC version - Includes all things listed on main MOD page",
      "version": "2.3",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "23393",
      "fileName": "Sharingan Powers - Dragonborn DLC version - Includes all things listed on main MOD page-27387-2-3.rar",
      "uploadedUnix": "1392779458",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/05e0fa4bb6d9734ff36af9d03d1b2a82737e311487d81bbaad25f65eeb626d02/analysis/1407940064/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sharingan%20Powers%20-%20Dragonborn%20DLC%20version%20-%20Includes%20all%20things%20listed%20on%20main%20MOD%20page-27387-2-3.rar?fid=1000097744&ttl=1535800084&ri=8192&rs=8192&setec=2131e70131c2e0eab95e0aa9f180cebc"
    },
    {
      "fileId": "1000097800",
      "name": "Sharingan Powers - Dragonborn DLC version - Includes all things listed on main MOD page",
      "version": "2.31",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23393",
      "fileName": "Sharingan Powers - Dragonborn DLC version - Includes all things listed on main MOD page-27387-2-31.rar",
      "uploadedUnix": "1392826367",
      "modVersion": "2.31",
      "virusScanUrl": "https://www.virustotal.com/file/abefa1fb280cb17541fad68d2697a77c629d66002c404eb9f4b757c8788568df/analysis/1407940517/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sharingan%20Powers%20-%20Dragonborn%20DLC%20version%20-%20Includes%20all%20things%20listed%20on%20main%20MOD%20page-27387-2-31.rar?fid=1000097800&ttl=1535800084&ri=8192&rs=8192&setec=940fcbe08fb9bcd9b419e3cf908e6928"
    },
    {
      "fileId": "1000099812",
      "name": "Sharingan Powers - Dragonborn DLC version - Includes all things listed on main MOD page",
      "version": "2.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14438",
      "fileName": "Sharingan Powers - Dragonborn DLC version - Includes all things listed on main MOD page-27387-2-4.rar",
      "uploadedUnix": "1393961700",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/1ba786afeef256b8e01092eb9a29181234ce6158d0c660244b173394b76e5387/analysis/1407960189/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sharingan%20Powers%20-%20Dragonborn%20DLC%20version%20-%20Includes%20all%20things%20listed%20on%20main%20MOD%20page-27387-2-4.rar?fid=1000099812&ttl=1535800085&ri=8192&rs=8192&setec=cae1bfb75d2dfb51b624ade7633ba13a"
    }
  ]
}